{
  "game_id": "0021601143",
  "espn_id": "400899408",
  "date": "Apr 02, 2017",
  "matchup": "LAL vs. MEM",
  "headline": "Russell scores 28, Lakers beat Grizzlies 108-103",
  "body": "LOS ANGELES --  There were many times when Los Angeles Lakers guard D'Angelo Russell would have let early struggles ruin his entire game.\n\nMaturity can be a slow evolving game, but against the Memphis Grizzlies on Sunday he was able to shrug off his first-quarter troubles and rebound to score 28 points in a 108-103 victory.\n\nRussell, 21, had four turnovers in the first quarter, but the second-year guard had only one more the rest of the game.\n\n\"I've seen more consistency in his professionalism and in his affecting the outcome of games, whether he's struggling or hitting shots,\" said Lakers coach Luke Walton. \"He had those early turnovers and before those games would kind of snowball and he would struggle the rest of the night.\"\n\nThree Lakers joined Russell's effort by adding double-doubles, handing the Grizzlies a difficult loss. They fell to 42-35 on the season, 1 1/2 games back of Oklahoma City for the sixth spot in the Western Conference with five games to play.\n\n\"These are games that could have seeding impact for us,\" said Memphis guard Mike Conley.\n\nConley overcame his own early struggles, scoring 14 of his 20 points in the fourth quarter, but missed a 3-pointer with 6.3 seconds to play that could have tied the game.\n\nJulius Randle had 18 points and 11 rebounds for the Lakers, while Larry Nance Jr. added 12 points and 14 boards. Thomas Robinson finished with 12 points and 10 rebounds, the first time the Lakers had three double-doubles in a game since Dec. 16, 2014 (Wesley Johnson, Jordan Hill and Ed Davis).\n\nThe Lakers outrebounded the Grizzlies 51-33 and forced six turnovers in the fourth quarter.\n\n\"I just thought they caught us by surprise,\" Memphis guard Tony Allen said. \"Their speed, their second-chance points, pick-and-roll coverages, 50-50 balls. It was a little bit of everything.\"\n\nMemphis picked up another 20 points from Troy Daniels off the bench, but no Grizzlies player ended up in double figures in rebounds.\n\n\"Our guys are tired of losing,\" Walton said.\n\nTIP-INS\n\nGrizzlies: Vince Carter, 40, was rested. He had appeared in 50 of the Grizzlies' last 51 games. \"He's running on fumes right now and giving me everything he has. I had to find a way to get him a break,\" coach David Fizdale said. ... C Marc Gasol missed his fourth consecutive game with a left foot strain.\n\nLakers: The Lakers continue to lead the league in scoring (48.1 points per game) off the bench. That could have something to do with having used 23 different lineups. ... After having started 10 consecutive games, rookie center Ivica Zubac missed his second consecutive game with a sore right knee.\n\nOHIO STATE\n\nBoth Conley and Russell were point guards for the Buckeyes. Conley is in his ninth NBA season. Said Russell: \"That's my guy. He's one of the vets I've looked up to for a long time. He's really paved the way for a guy like me.\"\n\nPAINFUL WIN\n\nThe victory could actually prove costly to the Lakers. They are now tied with Phoenix for the league's second-worst record (22-55). If the teams finish tied, they would combine the number of pingpong balls for second and third and then split them evenly in determining lottery picks.\n\nUP NEXT\n\nGrizzlies: Travel to San Antonio to meet the Spurs on Tuesday. The Grizzlies are 2-1 against the Spurs this season, having won the first two matchups.\n\nLakers: In a slight scheduling oddity, both play the same team next. The Lakers are up second, traveling to San Antonio to meet the Spurs on Wednesday. The Lakers are 0-3 against the Spurs, having lost the three games by an average of 16 points.",
  "source": "espn_api",
  "crawled_at": 1764995354.746111
}