{
  "game_id": "0022001004",
  "espn_id": "401307811",
  "date": "May 07, 2021",
  "matchup": "CHA vs. ORL",
  "headline": "Hornets top Magic 122-112, inch closer to play-in tournament",
  "body": "CHARLOTTE, N.C. -- — Terry Rozier scored 28 points, LaMelo Ball added 27 points and the Charlotte Hornets inched closer to securing a spot in the play-in tournament with a 122-112 win over the Orlando Magic on Friday night.\n\n\r\n                    The Hornets needed a win and a loss by Chicago to Boston to clinch a berth, but the Bulls beat the Celtics 121-99. Charlotte can clinch a spot in the play-in tournament with a win Sunday against New Orleans.\n\n\r\n                    P.J. Washington had another strong shooting night and finished with 23 points and nine rebounds, while Bismack Biyombo had 11 points and 11 rebounds as Charlotte (33-34) bounced back from a 21-point drubbing by the Bulls on Thursday night.\n\n\r\n                    Dwayne Bacon had a career-high 28 points and Mo Bamba added a career-best 18 rebounds to lead the Magic (21-46). Cole Anthony had 22 points.\n\n\r\n                    Rozier took 20 shots and got the line nine times, making seven, in his most aggressive game in weeks.\n\n\r\n                    “He has a been rock all year for us,\" Hornets coach James Borrego said of Rozier. \"There are no excuses out of him, even when his shot wasn't falling in stretches. ... We would be a lost team without him, so give him a lot of credit.”\n\n\r\n                    Ball was aggressive, too.\n\n\r\n                    The Magic led for the better part of three quarters, but Ball began to assert himself with series of strong drives through the lane and some nifty no-look passes to set up teammates with easy buckets.\n\n\r\n                    Using his quick first step, Ball drove at one point and delivered a one-handed, no-look dish to Rozier on the right wing set up a 3 to put the Hornets ahead by 10 with 8:24 left in the game. The Magic never mounted a serious challenge after that.\n\n\r\n                    Ball continued to struggle with his 3-point shot, though, missing all seven attempts and it's unclear if that's because of the wrist injury that kept him out of 21 games. At times, Ball was seen shaking his wrist during breaks in the action and he admitted it was “a little sore.”\n\n\r\n                    When he left the game, he would have the wrist wrapped in a warm pack under a towel.\n\n\r\n                    “My shot was a little off and I knew I had to get to the rim,” Ball said.\n\n\r\n                    “We need him at the rim, that’s really his strength for us,” Borrego said of Ball, an NBA Rookie of the Year candidate. \"Not only to finish, but to kick it. Just getting downhill and kicking it. ... He was big tonight. He looked much more comfortable out there tonight and it just built off his aggressiveness to the rim.”\n\n\r\n                    The Magic struggled in pick and roll defense, allowing the Hornets to score a season-high 68 points in the paint.\n\n\r\n                    “We actually had pretty good individual defense, (but) our high pick-and-roll defense was a real problem area,” Magic coach Steve Clifford said.\n\n\r\n                    TIP INS\n\n\r\n                    Magic: Shot 41.8% from the field.\n\n\r\n                    Hornets: G Malik Monk played only nine minutes before aggravating his right ankle injury. Monk returned earlier this week after missing 15 games with a sprained ankle. ... New University of North Carolina basketball coach Hubert Davis attended the game, as did his predecessor Roy Williams.\n\n\r\n                    BAMBA ON THE BOARDS\n\n\r\n                    Clifford likes what the Magic are getting from Bamba on the boards, calling it a \"major strength.\"\n\n\r\n                    Now he wants him to expand his game.\n\n\r\n                    “Run both ways consistently so you can anchor the defense and go after every rebound and develop a pick-and-roll game where you can roll, you can flare and you can short flare,\" Clifford said. \"I think those are attainable things.”\n\n\r\n                    WASHINGTON ON FIRE\n\n\r\n                    In the two games since the berth of his child, Washington has been red hot shooting the ball, going 17 of 27 from the field, including 71.4% (10 of 14) from 3-point range.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Host Timberwolves on Sunday in their final home game of the year. They close the season with four games on the road.\n\n\r\n                    Hornets: Host Pelicans on Sunday. \n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997004.640799
}