{
  "game_id": "0022200845",
  "espn_id": "401469000",
  "date": "Feb 10, 2023",
  "matchup": "MIL @ LAC",
  "headline": "Bucks beat Clippers 119-106 for 10th straight win",
  "body": "LOS ANGELES -- — Giannis Antetokounmpo scored 35 points and the Milwaukee Bucks beat the Los Angeles Clippers 119-106 on Friday night for their first 10-game winning streak since 2019-20.\n\n\r\n              Brook Lopez had 22 points and 15 rebounds, and Jrue Holiday added 19 points for the Bucks, who have won 12 of 13. They completed a back-to-back sweep in LA, having beaten the Lakers a night earlier.\n\n\r\n              “There's a point in the season where things get repetitive and winning has been,” Holiday said.\n\n\r\n              Paul George led six Clippers in double figures with 19 points, 11 rebounds and six assists. They were without Kawhi Leonard, who sat out due to injury management.\n\n\r\n              Antetokounmpo had 38 points and 10 rebounds against the Lakers. He picked up where he left off, scoring the Bucks’ first eight points as they raced to a 14-2 lead to open the game.\n\n\r\n              “You have a 7-footer that shoots a 3-point shot (Lopez) and if you put a forward on Giannis, he’s going to attack the basket, get to the free-throw line, finish at the rim,” Clippers coach Tyronn Lue said. “They put you in a tough predicament. That’s why they’re a good team and they won a championship a few years ago.”\n\n\r\n              The Greek Freak came in averaging 37.6 points, 14 rebounds and 5.4 assists while shooting 61% from the floor during the Bucks' winning streak. He was the leading vote-getter in the Eastern Conference for the All-Star Game on Feb. 19. He'll be making his seventh straight start and was voted a captain for the third time.\n\n\r\n              “We're all playing confidently, playing together and clicking,” Lopez said. \n\n\r\n              The Clippers rallied before losing 106-105 at Milwaukee last week. They did it again in the third when neither team led by more than five for much of the period. Antetokounmpo eventually took over, stretching Milwaukee’s lead to 76-68 with three straight baskets and he assisted on a basket by MarJon Beauchamp.\n\n\r\n              The Bucks dominated the fourth, extending their lead from five points to double-digits. \n\n\r\n              Antetokounmpo scored seven of the Bucks' first 10 points in the second. When he went to the bench, Lopez scored 14 points to send the Bucks into halftime leading 54-51.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Jae Crowder, newly acquired from Phoenix, will join the team in Milwaukee this weekend. ... Lopez, who is 34, became the oldest player in the NBA to make 100 3-pointers and have 100 blocked shots in a season. ... The Bucks earned their first season sweep of the Clippers since 2019-20 and just their third since 2000-01. ... Khris Middleton (injury management) sat out after scoring 22 points against the Lakers. ... Bobby Portis (right knee MCL sprain) missed his ninth straight game. \n\n\r\n              Clippers: George hit a 3-pointer in the third that gave him 16,000 career points. ... Leonard missed his 20th game of the season while resting his right knee. The team fell to 9-11 when he's out because of his knee. \n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Boston on Tuesday.\n\n\r\n              Clippers: Host Golden State on Tuesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994565.5547369
}