{
  "game_id": "0022000606",
  "espn_id": "401307391",
  "date": "Mar 15, 2021",
  "matchup": "IND @ DEN",
  "headline": "Jokic, Nuggets beat travel-weary Pacers 121-106",
  "body": "DENVER -- — Nikola Jokic notched his 35th double-double with 32 points and 14 rebounds, leading the Denver Nuggets over the travel-weary Indiana Pacers 121-106 on Monday night.\n\n\r\n                    Michael Porter Jr. and Will Barton each scored 20 points for the Nuggets, who used a big fourth quarter to get the win.\n\n\r\n                    Malcom Brogdon led Indiana with 24 and Justin Holiday had 19. Domantas Sabonis finished a rebound shy of a triple-double with 10 points and 10 assists.\n\n\r\n                    The start of the game was moved back an hour because the Pacers were unable to fly from Phoenix into Denver until Monday afternoon. A snowstorm that officially dropped 27 inches at Denver International Airport closed the runways from late Sunday morning. Four runways were reopened mid-afternoon Monday.\n\n\r\n                    “I knew they got in late so I just wanted to put my foot on the gas early to figure out if they was or wasn’t (tired), but I knew I was going to figure it out,” said Barton, who scored the first eight points of the game for Denver. “I was going to try to put them on their heels. I was going to find out one way or another if they were tired.\"\n\n\r\n                    Indiana rallied from 20 down in the first half to take a 79-74 lead midway through the third quarter. The Pacers led 91-87 after three, but the Nuggets opened the fourth with 14 straight points to take a 101-91 lead.\n\n\r\n                    “Our defense in the third quarter was a joke and if we had any chance of coming back and winning we had to play defense,” Denver coach Michael Malone said. “That quarter they had 35 points and shot 61.9% from the field.”\n\n\r\n                    The Pacers didn’t score their first points until nearly five minutes into the fourth and were outscored 34-15. Caris LeVert didn’t want to blame the travel issues for the loss.\n\n\r\n                    “Going down 20 points to a good team is tough to overcome,” he said. “We’re competitors, we don’t want to make excuses. Stuff happens in life. For us to get to where we want to go, we can’t go down 20 points to a good team like that.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: G Jeremy Lamb missed his second straight game with a sore left knee. ... LeVert had 17 points in his second game back from having a cancerous mass removed from his kidney on Jan. 26.\n\n\r\n                    Nuggets: G Monte Morris was out of the lineup for the second straight game with a quad strain. G Gary Harris missed his 12th straight game with a left adductor strain, while R.J. Hampton continues to be out due to health and safety protocols.\n\n\r\n                    SNOW BUSINESS\n\n\r\n                    Pacers coach Nate Bjorkgren drew on his experience in the D-League when dealing with the delayed travel.\n\n\r\n                    “There’s a few guys on our team that have gone through things like this before,” he said. “Fifteen years ago, when I was in the minor leagues, this stuff happened, a little bit, not a lot, but it happened. We did a lot of travel on the day of the game.”\n\n\r\n                    Indiana wasn’t the only one affected by the weather. Referees Bill Kennedy, Michael Smith and Jonathan Sterling, the officiating crew from Saturday night’s game in Denver, were stuck in town and worked Monday’s game.\n\n\r\n                    The Los Angeles Kings, who played the Colorado Avalanche on Sunday afternoon, had to stay overnight Sunday and the NHL postponed the Kings’ Monday night home game against St. Louis.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host Brooklyn on Wednesday night.\n\n\r\n                    Nuggets: Host Charlotte on Wednesday night.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997141.2512698
}