{
  "game_id": "0021500786",
  "espn_id": "400828673",
  "date": "Feb 09, 2016",
  "matchup": "MIL vs. BOS",
  "headline": "Middleton's free throw lifts Bucks over Celtics 112-111",
  "body": "MILWAUKEE -- Greg Monroe isn't used to being out of the starting lineup.\nBenched at the start of Tuesday night's game against the Boston Celtics, the Milwaukee Bucks center responded with a huge game. He scored 29 and grabbed 12 rebounds to spark his team to end a five-game losing streak with a 112-111 victory.\nHe started 48 games as a rookie with Detroit and has been in the starting lineup for 336 of 348 contests since then until coming off the bench against Boston.\n\n\"It's all about getting the win and making sure I do my part when I'm out on the court,\" Monroe said.\nMonroe signed a three-year, $50 million deal with a player option for the third year this off-season.\nThe Bucks benched Monroe and Michael Carter-Williams and inserted into the starting lineup Miles Plumlee and O.J. Mayo, who was returning from a lengthy injury absence.\n\"It's not easy when you've started your whole career to be asked to do something different,\" Bucks coach Jason Kidd said of Monroe. \"He never complains. He just does his job. I thought he did it at a very high level tonight.\"\nThe Bucks blew a 19-point fourth-quarter lead but got the victory when Khris Middleton made one of two free throws with 0.6 seconds left, giving the Bucks an improbable win.\nMiddleton drew a foul on Avery Bradley to get to the line following a Bucks' timeout that gave them the ball at halfcourt.\n\"I'm just trying to make a good defensive play, trying to be aggressive,\" Bradley said. \"The ref made a great call.\"\nBoston had tied the game when Kelly Olynyk made two free throws with one second remaining.\nMilwaukee appeared to have won the game on Monroe's last-second hook shot, which gave the Bucks a 111-109 lead. After Boston called a time out, Olynyk drew the foul with no time expiring off the clock as he attempted to catch a lob pass.\nMiddleton had 20 points and Carter-Williams added 16.\nJae Crowder and Bradley had 18 points each for the Celtics.\nAfter trailing by a point at halftime, Milwaukee built a 19-point lead after three. Boston, which had won nine of 10, chipped away at the lead throughout the fourth before Crowder hit a 3-pointer with 22 seconds left to tie it.\nThe Bucks grabbed their first lead at 49-46 on Rashad Vaughn's 3-pointer with just less than five minutes remaining in the first half. The Celtics led 54-53 at the half.\nThe Celtics built a 10-point lead midway through the first quarter and held a 30-26 advantage at the end of the period. Boston shot 57 percent in the quarter.\nCAREER YEAR\nCrowder's averages in nearly all statistical categories are the highest of his four-year NBA career. His performance this season has impressed his coach. \"This is the most opportunities he's ever gotten,\" Brad Stevens said. \"He just wants to get better every single day. His work ethic is terrific. He sets a good example.\"\nTIP-INS\nCeltics: Crowder, who has been hobbled by an ankle injury, was in the starting lineup. ... Boston shot 50 percent overall in the first half but just 5-of-15 from 3-point range.\nBucks: Coach Jason Kidd on the lineup change: \"It's nothing that Michael or Moose (Monroe) have done, but we're just going to try something different. Here at the 53-game mark we'll look at a different lineup. We need to find out about some different guys going forward. Our record isn't where we want it to be.\" ... Mayo returned after missing 11 games with a left hamstring injury. He missed 11 games earlier in the season with a right hamstring injury. ... Forward John Henson missed his fourth straight with a back injury. ... Milwaukee began a stretch in which it plays 20 of its final 30 regular-season games at home.\nUP NEXT\nCeltics: Host the Los Angeles Clippers on Wednesday night.\nBucks: Host the Washington Wizards on Thursday night",
  "source": "espn_api",
  "crawled_at": 1764994037.623592
}