{
  "game_id": "0022400287",
  "espn_id": "401704853",
  "date": "Nov 27, 2024",
  "matchup": "ATL @ CLE",
  "headline": "Trae Young's 22 assists help Hawks stun Cavaliers 135-124, only Cleveland's 2nd loss this season",
  "body": "CLEVELAND -- — Trae Young had a career-high 22 assists — the most in the NBA this season — and scored 20 points as the Atlanta Hawks handed Cleveland just its second loss this season, beating the Cavaliers 135-124 on Thursday night.\n\n\r\n              The Cavs fell to 17-2 and lost for the first time in 11 home games. \n\n\r\n              De'Andre Hunter added 26 points and Jalen Johnson 22 for the Hawks, who made all the big plays down the stretch to stun the Cavs. Rookie Zaccharie Risacher, the No. 1 overall pick in this year's draft, scored 13 of his 17 points in the first three minutes of the second half for Atlanta.\n\n\r\n              Donovan Mitchell scored 30 and Evan Mobley added 22 points and 13 rebounds for Cleveland, which was trying to become the first team to start 18-1 or better.\n\n\r\n              Takeaways\r\n              Hawks: Young didn't have his best shooting night (6 of 18), but the league's assists leader got all his teammates involved. Atlanta ended a three-game losing streak and recorded its second big road win this season after winning in Boston on Nov. 12 without Young.\n\n\r\n              Cavaliers: Finally showed some vulnerability at home after being so dominant. Cleveland built an early 19-point lead that may have given it a false sense of security.\n\n\r\n              Key moment\r\n              With the Hawks up four, Young, who turned the ball over on Atlanta's previous possession, almost lost it again before recovering and draining a 39-foot 3-pointer to make it 129-122 with 1:23 left.\n\n\r\n              Key stat\r\n              Atlanta's Dyson Daniels came in leading the NBA in steals at 3.13 per game. No player has averaged over three steals for a season since Milwaukee's Alvin Robertson (3.04) in 1990-91.\n\n\r\n              Up Next\r\n              The teams meet again with a “Black Friday” NBA Cup game in Atlanta. The Hawks (2-1) are tied for first in Group C while the Cavs (1-1) have two games left in pool play.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997954.750517
}