{
  "game_id": "0021600824",
  "espn_id": "400900229",
  "date": "Feb 13, 2017",
  "matchup": "MIL vs. DET",
  "headline": "Bucks beat Pistons 102-89 behind Monroe's double-double",
  "body": "MILWAUKEE -- With two straight double-digit wins, the Milwaukee Bucks are starting to figure out how to adjust again to life without star forward Jabari Parker.\nTheir 102-89 win on Monday night over the Detroit Pistons was even more impressive given that they only got eight points from All-Star forward Giannis Antetokounmpo.\nBut center Greg Monroe and Michael Beasley picked up the slack, combining for 48 points, and the Bucks forced 17 turnovers in holding an opponent to less than 100 points for the first time in 20 games.\n\"Giannis is an All-Star. He's been carrying us the whole year. It's only right that we gave him a game off,\" said Monroe, who picked up his 12th double-double of the season with 25 points and 13 rebounds.\nMonroe was 12 of 15 from the field, while Beasley had 23 points on 10-of-13 shooting. The Bucks led by 22 at one point and held a double-digit advantage for most of the second half.\n\"Those two guys crushed us. And then our offense was pathetic,\" Pistons coach Stan Van Gundy said. \"It was just a miserable night all around.\"\nCertainly not for the Bucks, who had a confidence-building outing as they get used to playing without Parker. The 20 point-a-game scorer tore his left ACL last week for the second time in three seasons. Parker is likely out until next February.\nStarting now with Parker out, Beasley sliced through traffic for layups and hit mid-range jumpers. Monroe, the active 6-foot-11 center, wheeled in the lane for baskets and boards.\n\"Us being his family, being brothers, we've got to pick up the slack, just hold down the fort until (Parker) gets back,\" Beasley said.\nMarcus Morris led Detroit with 26 points, while Andre Drummond added 21 points and 12 rebounds.\nBROKEN DOWN\nDetroit's third frontcourt starter, jump-shooting big man Jon Leuer, added 15 points and 11 boards.\nBut the Pistons didn't have enough production out of their backcourt, getting a combined 19 points from their top three guards. They were 7 of 21 (33 percent) from 3-point range.\nIt was a disappointing outcome a night after beating Toronto 102-101 after coming back from a 16-point fourth-quarter deficit.\n\"Our focus wasn't as great as it needed to be tonight, especially in a game we needed to win,\" forward Tobias Harris said.\nDEFENSE FIRST\nMilwaukee held an opponent to less than 100 points for the first time since a 98-94 victory on Jan. 2 against Oklahoma City.\n\"It wasn't always perfect but the guys' effort was high, guys were flying around,\" coach Jason Kidd said.\nSTAT LINES\nAntetokounmpo was 2 of 9 from the field, but had six assists. ... G Khris Middleton, playing his fourth game back since coming back from a torn hamstring, finished with a season-high 11 points.\nTIP-INS\nPistons: Rookie F Henry Ellenson was inactive in the former Marquette star's first visit to Milwaukee since being taken by Detroit with the 18th overall pick in last year's draft. Ellenson played one season with the Golden Eagles. ... Drummond was 6 of 12 in the first half for 16 points. He was often matched up against rookie Thon Maker. The rest of the team was 8 of 26 from the field in the first half.\nBucks: Led by Beasley and Monroe, Milwaukee started the second quarter 7 of 11 from the field. Beasley started out the game 6 of 6, while Monroe hit his first seven shots. ... Antetokounmpo was scoreless in the first half for the third time this season.\nUP NEXT\nPistons: Host Dallas on Wednesday night in Detroit's last game before the All-Star break.\nBucks: Try to take the season series with the Nets in a visit to Brooklyn on Wednesday night.\n---\nFollow Genaro Armas at https://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764995164.273868
}