{
  "game_id": "0021501051",
  "espn_id": "400828938",
  "date": "Mar 21, 2016",
  "matchup": "PHX vs. MEM",
  "headline": "Stephenson leads Grizzlies past Suns, 103-97",
  "body": "PHOENIX --  Thanks to Lance Stephenson and the new guy, the Memphis Grizzlies pulled out a win in Phoenix.\n\nStephenson scored 12 of his 16 points in the fourth quarter and the Grizzlies closed with the final eight points of the game to beat the Suns 103-97 on Monday night.\n\nPhoenix was scoreless the final 2:12.\n\n\"To come from behind and outscore them 64-47 in the second half, that was tremendous,\" Grizzlies coach David Joerger said. \"... Down the stretch we got five stops in the row to finish the game and that was tremendous.\"\n\nJordan Farmar, who signed a 10-day contract earlier in the day, scored 12 for Memphis, nine in the fourth quarter.\n\n\"Jordan is a champion,\" the Grizzlies' Zach Randolph said. \"That is what we expect out of him.\"\n\nStephenson's rebound basket after Farmar's airball layup attempt gave Memphis a 99-97 lead with 31 seconds to play.\n\nRandolph added 14 points and blocked Jon Leuer's shot with Memphis nursing that two-point lead.\n\nDevin Booker scored 18 points and P.J. Tucker 15 for Phoenix. Leuer had 13 points and 13 rebounds. Brandon Knight also had 13 points but on 4-of-17 shooting.\n\n\"It was defense,\" Stephenson said. \"Tony Allen came in and we got incredible stops. We were playing together defensively. We were aware. ... We're a defensive team. When we're playing great defense, the offensive end comes easy for us.\"\n\nPhoenix center Tyson Chandler sat out the second half with back spasms.\n\n\"Losing Tyson at halftime really hurt us,\" Phoenix interim coach Earl Watson said. \"Every time we play Memphis we control the paint. The second half they had 28 points in the paint.\"\n\nTrailing most of the second quarter and all of the third, the Grizzlies got 10 points from Stephenson in the first 2:40 of the final quarter to take the lead.\n\nFarmar scored seven consecutive points to put Memphis ahead 90-85 with 6:15 to go. Booker's 12-footer capped a 6-0 spurt that put the Suns up 93-92 with 3:51 remaining and it was back and forth from there.\n\nKnight's step-back 21-footer put Phoenix ahead 97-95 with 2:12 1eft, but the Suns couldn't handle Memphis' trademark physical play down the stretch.\n\n\"Just playing physical,\" Booker said. \"They were beating us off the glass, beating us in the paint.\"\n\nLeuer missed an open 3 from the corner, got the rebound and drove to the basket, but Randolph smothered him and blocked the shot.\n\n\"I put it on myself to make that shot,\" Leuer said of his 3-point try. \"It's a shot I know I can get, I just left it a little short.\"\n\nFarmar sank two free throws, then Allen stole Alex Len's inbounds pass after a timeout. Allen wrapped up the scoring with two free throws with 9.1 seconds to play.\n\nAn all-reserves lineup scored the first 15 in an 18-2 Suns first-half run. John Jenkins, Leuer and Chase Budinger each sank a 3-pointer to cap the outburst and Phoenix led 42-30 with 4:08 left in the half.\n\nA 3-pointer by Matt Barnes and Ryan Hollins' fast-break dunk chopped the lead to 42-35.\n\nBut, after missing his first seven shots, Knight sank a 3-pointer and Booker made three of four free throws over the final 35 seconds of the half to give the Suns a 50-39 lead.\n\nThe Grizzlies, who split the season series with Phoenix 2-2, methodically narrowed the lead through the third quarter and were down 73-70 entering the fourth.\n\nTIP INS\n\nGrizzlies:  Mike Conley missed his ninth consecutive game with a sore left foot/left Achilles tendinitis. ... Memphis opened a three-game road trip, its longest journey through the rest of the season.\n\nSuns: The Suns beat Memphis twice in the last month, 111-106 in Phoenix on Feb. 27 and 109-100 in Memphis on March 6. ... The Suns host the Lakers on Wednesday in Kobe Bryant's final visit to Phoenix. \"This would be my only chance to play against him,\" said Booker, a rookie. \"That's a story I can tell for the rest of my life, playing against Kobe Bryant.\"\n\nUP NEXT\n\nGrizzlies: At the Los Angeles Lakers on Tuesday night.\n\nSuns: Host the Los Angeles Lakers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994826.693164
}