{
  "game_id": "0022301071",
  "espn_id": "401585699",
  "date": "Mar 29, 2024",
  "matchup": "MIN @ DEN",
  "headline": "Conley, Edwards lead surging Timberwolves past Nuggets 111-98 and into 1st-place tie in West",
  "body": "DENVER -- — This is why Glen Taylor doesn't want to let go of the Minnesota Timberwolves.\n\n\r\n              Anthony Edwards scored 25 points and Mike Conley added 23 in Minnesota's 111-98 rout of Denver on Friday night that sent the Timberwolves into a first-place tie in the Western Conference — and the defending NBA champion Nuggets into third place.\n\n\r\n              “There's a lot of resilience to this team,\" T-Wolves coach Chris Finch said. \"We've been very tough-minded all season. Our goal remains to play our best basketball heading into the playoffs. If that allows us to finish first, second or third, whatever, that's what it is. But we've got a lot of big games coming up against teams that are playing for a lot, as well. \n\n\r\n              \"So, this was exactly the test that we need coming down the stretch.”\n\n\r\n              The Nuggets (51-23) failed to reach 100 points for the second straight game and fell a-half game behind the Timberwolves and the Oklahoma City Thunder, who easily handled Phoenix 125-108 on Friday night.\n\n\r\n              The Nuggets were without star point guard Jamal Murray (ankle, knee) for a fourth consecutive game, and once again their lack of depth was exposed as their bench provided very little help in Denver's second straight loss at home.\n\n\r\n              Nobody missed Murray more than MVP favorite Nikola Jokic, who had consecutive cringing turnovers to end the third quarter and missed 11 of his first 17 shots against Minnesota's pestering double teams before rallying to finish with 32 points despite playing with a sore shooting wrist.\n\n\r\n              “I was surprised he played tonight, to be quite honest,” Denver coach Michael Malone said. “His wrist has really been giving him a lot of trouble, and Nikola is a guy who plays through a lot of things that most guys wouldn't play through.”\n\n\r\n              Malone also said Murray apologized to him for his absence, “and I said, ‘Don’t apologize. You're not trying to be hurt. And your health is more important than a win right now.' \n\n\r\n              “Because, as I've said many times, I have complete confidence that that group regardless of seed can beat anybody anywhere when we're healthy,” Malone added. \"Because we've done it.” \n\n\r\n              Rudy Gobert added 21 points for Minnesota, which has won four in a row. Playing on the court where their playoff run ended last season, the Timberwolves took the lead for good on Gobert's alley-oop dunk in the opening minutes and never let up in cruising to their biggest victory of the season.\n\n\r\n              “It feels great,” Gobert said. \"Obviously, coming in, they're a great team. They are a team that personally really inspired me, what they did last year. I have a lot of respect for this team and what they've accomplished. But we know that this year we're a more mature team than we were last year and we know that this year we have a lot of confidence in our ability to beat anyone anywhere.\n\n\r\n              “And today was a very, very good test.” \n\n\r\n              After going 15-2 coming out of the All-Star break, the Nuggets find themselves in a sudden slump with back-to-back losses at home for the first time all season. They lost to Phoenix 104-97 on Wednesday night.\n\n\r\n              Behind 13 early points from Jaden McDaniels, the Wolves grabbed a 62-43 halftime lead and were never threatened after the break. \n\n\r\n              This marked the Timberwolves' first game since Taylor declared Thursday he won't take the final step of his drawn-out $1.5 billion deal to hand Marc Lore and Alex Rodriguez the majority stake in the franchise as planned. \n\n\r\n              “If there was ever a definition of ‘above your pay grade,’ this is it,” Finch said before tip-off. “For us, it's business as usual. ... There's been no ripple effects down here at troop level.\"\n\n\r\n              The Wolves improved to 9-3 since Karl-Anthony Towns went out with a torn meniscus three weeks ago.\n\n\r\n              “We're missing our best player,\" Edwards said, “so we're still not where we want to be.” \n\n\r\n              Malone talked up the Wolves long before they put a whooping on his team the likes of which the Nuggets haven't seen in years. He praised Edwards’ athleticism and physicality during his pregame news conference and also noted that Minnesota recently topped the 50-win mark for the fifth time ever.\n\n\r\n              “A lot to be excited about in Minnesota,” Malone said. “I wouldn’t sell the team, either.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Chicago on Sunday night.\n\n\r\n              Nuggets: Host Cleveland on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996448.538898
}