{
  "game_id": "0022400882",
  "espn_id": "401705448",
  "date": "Mar 04, 2025",
  "matchup": "HOU @ IND",
  "headline": "Tyrese Haliburton and the Pacers recover from blown lead, close out the Rockets 115-102",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton scored 28 points and matched a season high with 15 assists, and the Indiana Pacers recovered after blowing a 17-point third-quarter lead to beat the Houston Rockets 115-102 on Tuesday night.\n\n\r\n              Pascal Siakam scored 18 points and Myles Turner added 16 for the Pacers, who have won six of eight.\n\n\r\n              Alperen Sengun scored 25 points and Tari Eason had 16 points and 14 rebounds for the Rockets, who dropped their third in a row.\n\n\r\n              Indiana led 90-73 with three minutes left in the third quarter but immediately allowed a 15-0 run by Houston. The Rockets pushed ahead 96-95 on a layup by Amen Thompson with 8:45 left in the fourth, but Aaron Nesmith responded with a three-point play that kicked off an 18-3 run by the Pacers.\n\n\r\n              Takeaways\r\n              Rockets: They were 32-14 on Jan. 28 but have lost 11 of their past 16 games.\n\n\r\n              Pacers: Six of their next seven games are on the road. The stretch includes home and away meetings with Milwaukee, which beat Atlanta Tuesday night to remain in fourth place in the Eastern Conference, with the same record as fifth-place Indiana (35-25).\n\n\r\n              Key moment\r\n              Ben Sheppard made a 3-pointer — his first basket of the game — early in the fourth quarter to stop Houston's 15-0 run and give Indiana a five-point advantage.\n\n\r\n              Key stat\r\n              Haliburton reached double digits in assists for the sixth straight game, his longest such streak this season. He entered averaging 8.8 assists per game after leading the league in that category last season at 10.9.\n\n\r\n              Up next\r\n              Rockets: At New Orleans on Thursday night.\n\n\r\n              Pacers: At Atlanta on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997360.765551
}