{
  "game_id": "0021800722",
  "espn_id": "401071395",
  "date": "Jan 25, 2019",
  "matchup": "CLE vs. MIA",
  "headline": "Winslow scores 27, leads Heat past Cavaliers 100-94",
  "body": "CLEVELAND --  The Miami Heat looked like a different team in the second half Friday night.\n\nTrailing at the break, Miami took over in the final two quarters and defeated the Cleveland Cavaliers 100-94.\n\n\"The starters have taken some heat, no pun intended, and they wanted to come out and show what they can do,\" Heat coach Erik Spoelstra said.\n\nJustise Winslow scored 27 points and Hassan Whiteside had 14 points and 13 rebounds.\n\nDwyane Wade scored 13 points in his final game at Quicken Loans Arena, and Derrick Jones Jr. added 14 points.\n\n\"Everything wasn't perfect, but we were just playing the game hard,\" Wade said. \"We did a great job coming out of the break for the second half.\"\n\nCedi Osman scored a career-high 29 points for the Cavaliers, who have lost 18 of 19. The Cavaliers have lost nine straight at home, with their last home victory coming Dec. 12.\n\nWinslow made three 3-pointers and scored 13 points in the third. With Cleveland leading 65-62, Miami went on a 28-7 run for a 90-72 lead early in the fourth.\n\n\"Justise was obviously great on the stat sheet and you can feel his presence all over the court,\" Spoelstra said.\n\nWinslow was 11 of 18 from the field and hit four 3-pointers.\n\nThe Heat led 96-78 with 4:12 to play before the Cavaliers went on a 13-1 run, sparked by 3-pointers from Collin Sexton and Alec Burks.\n\nAnte Zizic made a free throw with 1:09 to play that cut the lead to 97-91, but Bam Adebayo made two foul shots with 20 seconds remaining.\n\n\"That is always a step in the right direction when we're within striking distance,\" Cavaliers coach Larry Drew said. \"We did fight back to get it under 10. I like that in us.\"\n\nThe Heat easily defeated the Cavaliers in the teams' first two meetings, 118-94 in Miami on Dec. 28, and 117-92 in Cleveland on Jan. 2.\n\nThe first half featured six lead changes and the score was tied six times. Cleveland led 53-48 at halftime, before Miami took over.\n\nBurks and Sexton each scored 13 for Cleveland.\n\nTIP-INS\n\nHeat: G Dion Waiters (migraine) was unavailable. The No. 4 overall pick in the 2012 draft spent his first three NBA seasons with Cleveland. . F Kelly Olynyk (four minutes) and G Rodney McGruder (10 minutes) saw action after falling out of the rotation earlier this week. Both failed to score.\n\nCavaliers: Cleveland is 5-19 at home. ... G Cameron Payne, who didn't play Friday, will complete his second 10-day contract Saturday, meaning Cleveland must either sign him for the rest of the season or let him go.\n\nLAST TIME AROUND\n\nWade is to retire after the season. The Cavaliers showed a video tribute during the game's first timeout for the future Hall of Famer, who waved to the fans while getting a loud ovation.\n\nWade played in 46 games with the Cavaliers last season. He was traded to Miami in February.\n\n\"It was great,\" Wade said. \"In four months here, I got a chance to get out into the community and get to know some of the fans, so it was nice. I appreciate it.\"\n\nWade exchanged jerseys with Sexton following the game.\n\n\"It means a whole lot,\" Sexton said. \"Everything he did for this game and him being someone I can talk to is pretty cool.\"\n\nINJURY UPDATE\n\nDrew hopes All-Star Kevin Love, who has played in only four games because of a foot injury, will return soon. Drew was impressed with Love's work during offensive drills in Friday's shoot-around.\n\nDrew said Love still hasn't gone through any contact drills and no timetable has been established for his return.\n\nForward Tristan Thompson will miss about two more weeks because of a sprained left foot. He's been sidelined for five games. Forward Larry Nance Jr. returned after missing eight games with a sprained right knee and had six points in 21 minutes.\n\nTOUGH TIMES\n\nDrew became head coach when Tyronn Lue was fired Oct. 28, after an 0-6 start. Drew's contract includes a team option for the 2019-20 season. He'll receive a buyout payment if the Cavaliers choose not to retain him.\n\n\"We know all the challenges we've had thus far,\" Drew said. \"We certainly know there will possibly be more challenges ahead, but we'll continue to try to keep this team very competitive, keep this team playing hard (and) keep developing our young guys.\"\n\nUP NEXT\n\nHeat: Visit New York on Sunday.\n\nCavaliers: Visit Chicago on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994764.948574
}