{
  "game_id": "401810060",
  "espn_id": "401810060",
  "date": "Nov 10, 2025",
  "matchup": "UTAH vs MIN",
  "headline": "Anthony Edwards scores 35 points and leads Timberwolves to 2nd win over Jazz in 4 days",
  "body": "SALT LAKE CITY -- — Anthony Edwards had 35 points and six assists as the Timberwolves beat the Jazz 120-113 on Monday night for Minnesota's second win over Utah in four days.\n\n\r\n              Minnesota, which beat Utah 137-97 on Friday and topped Sacramento 144-117 on Sunday, has won three straight games and five of its last six.\n\n\r\n              Edwards posted his ninth straight game of 30 or more points, marking the longest stretch of 30-point games against the Jazz for any NBA player.\n\n\r\n              Julius Randle added 27 points, eight rebounds, and seven assists for Minnesota. Rudy Gobert chipped in 14 points and 12 boards.\n\n\r\n              Keyonte George scored 27 points and Lauri Markkanen added 23 to lead the Jazz.\n\n\r\n              Back-to-back baskets from George keyed a 10-0 run to close out the first quarter that gave Utah a 30-26 lead. He scored 12 points on 5-of-6 shooting in the quarter.\n\n\r\n              Minnesota countered with its own 10-0 run to go ahead 47-46 late in the second quarter. Randle powered the spurt by scoring a pair of baskets and assisting a third.\n\n\r\n              The Timberwolves built on that momentum, going up 66-55 early in the third quarter. Starting with Randle’s reverse layup on the final play before halftime, Minnesota scored 15 unanswered points to surge ahead for good. Edwards fueled the run, scoring three baskets and assisting two others from Randle.\n\n\r\n              It set the stage for a dominant third quarter for the Timberwolves, who outscored the Jazz 33-9 through the first 8½ minutes of the period to build up an 86-64 lead.\n\n\r\n              Utah cut the deficit to single digits multiple times in the fourth quarter, but never got closer than seven points.\n\n\r\n              Up Next\r\n              Timberwolves: Host Sacramento on Friday.\n\n\r\n              Jazz: Host Indiana on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042601.274432
}