{
  "game_id": "0022400931",
  "espn_id": "401705497",
  "date": "Mar 10, 2025",
  "matchup": "CHA @ MIA",
  "headline": "Hornets rally past reeling Heat, who waste another 17-point lead in 105-102 loss",
  "body": "MIAMI -- — Miles Bridges scored 35 points, Mark Williams added 24 points and 10 rebounds and the Charlotte Hornets got their first divisional win of the season by beating the reeling Miami Heat 105-102 on Monday night.\n\n\r\n              It was the third time in March alone that Miami lost a game after leading by at least 17 points — all those collapses coming at home. The Heat led New York by 19 on March 2, led Chicago by 17 on Saturday and led the Hornets by 17 in the first half.\n\n\r\n              Bam Adebayo finished with 23 points, 14 rebounds and eight assists for the Heat, and Tyler Herro finished with 21 for Miami — which has lost four straight and five of six.\n\n\r\n              LaMelo Ball had 15 points and 10 assists for Charlotte, which was 22 for 23 from the foul line. Miami was 14 for 20 at the line.\n\n\r\n              Takeaways\r\n              Hornets: Charlotte had been 0-11 against Southeast Division opponents this season. No team since the current format of four or more divisions in 1970-71, has gone winless within its own division over a full season.\n\n\r\n              Heat: Rookie center Kel'el Ware got meaningful fourth-quarter minutes for only the second time in Miami's last six games. “He’ll definitely get his opportunities moving forward,” Heat coach Erik Spoelstra said. \"Look, I get it. ... If you lose games, the coach puts himself out there to be second-guessed. There’s no question about it.”\n\n\r\n              Key moment\r\n              Bridges made a 3-pointer with 1:15 left for the lead, then added another on the next Charlotte possession to put the Hornets ahead for good.\n\n\r\n              Key stat\r\n              Charlotte had scoring runs of 14-0 in the third quarter and 10-0 in the fourth.\n\n\r\n              Up next\r\n              Charlotte makes its second stop on a four-game trip Wednesday in Atlanta. Miami plays the fourth game in a five-game homestand Wednesday against the Los Angeles Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997434.571896
}