{
  "game_id": "0022200936",
  "espn_id": "401469091",
  "date": "Mar 01, 2023",
  "matchup": "MIA vs. PHI",
  "headline": "Maxey scores 27, 76ers roll past Heat 119-96 without Embiid",
  "body": "MIAMI -- — Joel Embiid got the night off. The Philadelphia 76ers didn't need him anyway.\n\n\r\n              Tyrese Maxey scored 27 points, James Harden added 23 and the 76ers took control early on the way to a 119-96 win over the Miami Heat on Wednesday night.\n\n\r\n              Tobias Harris scored 18 points, while Paul Reed had 16 points, 14 rebounds and was plus-26 in 29 minutes for the 76ers, who played without their All-Star center; Embiid sat with left foot soreness.\n\n\r\n              The 76ers are 9-4 when Embiid doesn’t play this season.\n\n\r\n              “We are a versatile, deep basketball team. ... Everybody who came in was ready,” 76ers coach Doc Rivers said.\n\n\r\n              Bam Adebayo scored 20 for the Heat, who beat Philadelphia on the road Monday but trailed by as many as 25 in the rematch at home. Jimmy Butler scored 16 for Miami before leaving in the fourth quarter with right knee soreness.\n\n\r\n              “We've shown that we can be the very best against anybody anywhere,” Heat coach Erik Spoelstra said. “We've also shown this.”\n\n\r\n              Philadelphia was 15 for 39 on 3s; Miami — the NBA's lowest-scoring team — was 7 for 29.\n\n\r\n              That was a huge part of the story, and so was the second quarter: Philadelphia outscored Miami 37-15 in that period, the best single-quarter differential of the season for the 76ers and the worst single-quarter differential of the season for the Heat.\n\n\r\n              Miami has now lost five of its last six, and remains in the No. 7 spot — meaning the play-in round — in the Eastern Conference with 19 games left.\n\n\r\n              “We have to start really figuring it out,” Adebayo said.\n\n\r\n              Philly’s most lopsided quarter win, before Wednesday, was 18 points on three different occasions. The Heat’s worst quarter loss of the season had been getting outscored by 20 points against the Los Angeles Clippers — in a game Miami actually won.\n\n\r\n              Not this time. Miami got the lead down to 11 in the third quarter, before it ballooned back to 19 after three quarters and 25 when the 76ers opened the final period on a 6-0 run. It was 102-77 with 10:08 left when Butler walked down the tunnel toward the Heat locker room and didn’t return.\n\n\r\n              This was the start of a league-high 15 road games in the season’s final 40 days for Philadelphia. Memphis has the second-most in that span with 12. Philadelphia has only seven home games left, tied with Minnesota for the fewest in the NBA.\n\n\r\n              “We’ll be fine. We’ll get through it,” Rivers said. “The key is winning as many of these games as you can during this stretch and then being healthy. You have to try to figure out both. If this was early in the year, you’d rest guys way more because you want to get through the year. The second half, you’re really trying to ramp guys up more. And that’s a tougher task given the amount of games we have.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: Philadelphia started a five-game trip, matching its longest of the season. The 76ers had a 5-0 trip from Jan. 14-21. ... The 76ers snapped a two-game slide. They’ve had two three-game losing streaks this season — an 0-3 start, then another 0-3 stretch from Nov. 30 through Dec. 5. ... The 76ers were 22 for 22 from the foul line.\n\n\r\n              Heat: It was the 36th game in Heat history in which they were outscored by at least 22 points in a quarter. Not surprisingly, Miami is 1-35 in those games. The win was over Washington in 2007. ... Spoelstra remained three wins behind Red Holzman (696) for No. 20 on the NBA’s all-time win list.\n\n\r\n              HOME WARRIORS\n\n\r\n              Miami began a stretch where it’ll play six consecutive games at home. The Heat don’t play outside of Florida again until March 18 at Chicago; they play at Orlando on March 11 as the lone road game in their next nine.\n\n\r\n              SPO VS. DOC\n\n\r\n              Spoelstra has faced Rivers 65 times, including playoffs, which is more than he has any other coach. The only coach Rivers has faced more often than Spoelstra is Indiana’s Rick Carlisle; they’ve gone against each other 80 times.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit Dallas on Thursday.\n\n\r\n              Heat: Host New York on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993933.7468102
}