{
  "game_id": "0022300538",
  "espn_id": "401585166",
  "date": "Jan 12, 2024",
  "matchup": "MIN vs. POR",
  "headline": "Timberwolves cruise to 116-93 win over Trail Blazers behind Gobert's 24 points, 17 rebounds",
  "body": "MINNEAPOLIS -- — Rudy Gobert had 24 points and 17 rebounds, Karl-Anthony Towns scored 23 points and the Minnesota Timberwolves cruised to a 116-93 victory over the Portland Trail Blazers on Friday night.\n\n\r\n              Gobert returned after missing one game with left hip soreness. The twin tower duo of Gobert and Towns dominated an undermanned and young Portland squad that was on the second game of a back-to-back after losing 139-77 in Oklahoma City a night earlier, matching the fifth-biggest loss in NBA history.\n\n\r\n              Gobert and Towns combined to shoot 16 of 19 from the field and Towns was 3 of 3 from 3-point territory. \n\n\r\n              “We want to see each other succeed,” Gobert said. “We want to be able to win together. That’s unique. In this league, a lot of teams have egos. I think we’re both in a place in our career now where it’s about winning. Nothing else matters.”\n\n\r\n              Minnesota shot 55% as a team, while holding the Trail Blazers to 39%. \n\n\r\n              Mike Conley returned to the lineup after missing a game to rest and had nine points and 10 assists. Anthony Edwards finished with nine points for the Timberwolves, who ran their record to 14-3 at home this season. Gobert, Edwards and Conley didn't play in the fourth quarter.\n\n\r\n              “Just be professionals, just come out and play with the standards that we’ve established for ourselves since Day 1 here,” Towns said of facing a struggling Trail Blazers team. “Defensively and offensively finding, again, another gear and get back to our groove.”\n\n\r\n              Duop Reath had 14 points for Portland, which lost six of seven in finishing a seven-game road trip. Jerami Grant added 13 points for the Trail Blazers.\n\n\r\n              “When our schedule came out and I seen this trip, I said, ‘Dang, that’s a beast of a trip here,’ and I didn’t even know we would, obviously, be injured or hurt or whatever position we would be in,” Portland coach Chauncey Billups said. “Just a tough trip, but it turned out to be even tougher than I thought it would.”\n\n\r\n              Jabari Walker returned after missing four games with left knee tendinitis and had 17 points off the bench, but Portland’s DeAndre Ayton missed his 10th straight game with right knee tendinitis and Shaedon Sharpe missed the game with adductor soreness.\n\n\r\n              Malcolm Brogdon returned for the Trail Blazers after sitting out Thursday and had nine points off the bench. But leading scorer Anfernee Simons was 0-for-10 shooting and scored just five points.\n\n\r\n              Minnesota regained the top spot in the Western Conference with the win, but the Wolves had run into trouble recently, particularly on the offensive end. They had lost four of six games and were plagued by turnovers.\n\n\r\n              Minnesota started the day averaging the third-most turnovers in the league at 15.3 per game, contributing to a scoring average of 113.1 points per game which was 22nd in the NBA. The Wolves committed 16 turnovers on Friday but it didn’t cost them against the Blazers.\n\n\r\n              Minnesota scored the first 11 points of the game and never looked back. It led by 22 in the first quarter before Portland climbed within nine midway through the second. But the Wolves would lead by 36 in the fourth, an all-too-familiar feeling for the Blazers.\n\n\r\n              During its seven-game road trip, Portland lost by at least 21 six times. Its lone win came at Brooklyn, 134-127 in overtime.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Return home against Phoenix on Sunday.\n\n\r\n              Timberwolves: Host the Los Angeles Clippers on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764996474.9024022
}