{
  "game_id": "0021500105",
  "espn_id": "400827992",
  "date": "Nov 09, 2015",
  "matchup": "MEM @ LAC",
  "headline": "Clippers edge Grizzlies 94-92 on Redick's late scoring",
  "body": "LOS ANGELES -- The Clippers got drawn into playing the Grizzlies' grinding style and still managed to eke out a victory.\nJ.J. Redick scored six straight points in the final 55 seconds to rally Los Angeles to a 94-92 victory Monday night, snapping a two-game skid.\n\"We made the game a lot harder than it was supposed to be,\" said DeAndre Jordan, who had 13 points and 12 rebounds. \"Being able to finish the game shows our maturity. I don't think we would have won this game a few years ago.\"\nBlake Griffin had 24 points and 12 rebounds for the Clippers during a back-and-forth game in which neither team led by more than eight points.\n\n\"Once you get in that type of game you just have to win,\" Clippers coach Doc Rivers said. \"We played their game and won but that's not the way we want to play.\"\nRedick finished with 16 points, including a go-ahead 3-pointer and then all three free throws after being fouled by Tony Allen to put the Clippers ahead 90-86.\nZach Randolph scored 26 points for the Grizzlies, who dropped their third in a row. Marc Gasol added 18 points but had a couple of costly misses at the foul line in the closing seconds, and Mike Conley had 16.\n\"We played Grizzlies basketball,\" Randolph said. \"If we play like that, keep playing like that, we'll get back to our old selves. A loss is a loss but we've got to take the positives, the energy, the defense, the things we did well.\"\nThe final 13 seconds turned into a foul fest.\nChris Paul fouled former teammate Matt Barnes on a 3-point attempt with eight seconds left, and Barnes made all three to draw the Grizzlies to 90-89.\nJamal Crawford hit a pair of free throws after being fouled by Courtney Lee to keep Los Angeles ahead 92-89 with seven seconds left. Crawford added 13 points off the bench, but drew groans from the fans with a rare miss that had Los Angeles leading 93-90 with five seconds to go.\nGasol was only 3 of 6 over the final six seconds while an especially loud male fan taunted him. Two of his misses cost the Grizzlies a chance to tie the game.\n\"I just overthought the free throw,\" he said. \"I outsmarted myself.\"\nNeither team led by more than six points through the first three quarters.\nTIP-INS\nGrizzlies: Barnes faced his old team for the first time since leaving over the summer. He had eight points, six rebounds and four fouls in 27 minutes off the bench. ... Gasol received a flagrant-1 foul after hitting Griffin in the nose with his left arm in the fourth.\nClippers: Both teams had 40 rebounds, making it the first time that the Clippers weren't outrebounded this season. ... Paul returned after missing one game with a sore right groin. ... Paul Pierce was called for a flagrant-1 foul on Jeff Green, who landed in the courtside photographers in the fourth.\nCOMING HOME\nBarnes was warmly greeted by his old Clippers teammates and the video board displayed a message thanking him in the first quarter.\nPaul and his young son attended a birthday party for Barnes' twin sons on Sunday. Barnes exchanged trash-talking text messages with Jordan and Griffin before the game.\n\"It's still family,\" Barnes said. \"It's bittersweet. I had a lot of good times here. L.A. is home but I'm in Memphis now. This is a solid situation for me, especially considering this is the team the Clippers went to war with in the playoffs. So to be traded, and end up in Memphis where I still have a chance to win, it's a blessing.\"\nRivers misses Barnes, too.\n\"He was a great instigator. It's an underrated thing in the league,\" the coach said. \"He had the ability to get under people's skin and that's not a bad thing.\"\nDJ IN DALLAS\nMavericks fans likely have Wednesday's game against the Clippers circled on their calendars. That's when Jordan visits for the first time since he told Mavs owner Mark Cuban he was coming to Dallas and then backed out.\n\"They're going to boo louder I guess,\" Rivers said. \"At the end of the day, their job is not to cheer for us anyway.\"\nQUOTE OF THE NIGHT\n\"I was just glad I made it out alive,\" said Paul, who got poked in the left eye by Randolph in the third, causing the Clippers guard to leave the court briefly.\nUP NEXT\nGrizzlies: Host NBA champion Golden State on Wednesday.\nClippers: They visit Dallas on Wednesday in Jordan's first game there since he reneged on a verbal commitment to play for the Mavs last summer.",
  "source": "espn_api",
  "crawled_at": 1764994481.8619971
}