{
  "game_id": "0021801102",
  "espn_id": "401071775",
  "date": "Mar 24, 2019",
  "matchup": "SAC @ LAL",
  "headline": "Lakers ride Kuzma's hot 3rd to beat Kings 111-106",
  "body": "LOS ANGELES --  After being eliminated from playoff contention, there has been plenty of discussion about how the Los Angeles Lakers should use LeBron James for the rest of the season.\n\nFor James, there is no debate. As long as he is physically able to play, he intends to go all out when he's on the court.\n\nJames had 29 points, 11 rebounds and 11 assists, Kyle Kuzma scored 21 of his 29 points in the third quarter and the Lakers ended a five-game losing streak with a 111-106 win over the Sacramento Kings on Sunday night.\n\n\"I felt I was healthy enough to go out and do something to help our team win, so I just went with my gut,\" James said. \"I'm happy I was able to go out and make a couple plays.\"\n\nJaVale McGee had 17 points and 14 rebounds to help the Lakers win for the third time in their past 15 games.\n\nMarvin Bagley III had 25 points and 11 rebounds off the bench for the Kings, who trail San Antonio by 6 1/2 games for the eighth and final playoff spot in the Western Conference with nine games remaining.\n\nSacramento pulled within two points at 106-104 with 17 seconds left in the fourth quarter when Bogdan Bogdanovic hit a 3, but James made four free throws down the stretch.\n\nAfter invoking the basketball gods in an on-court interview after the game, James said he owed it to the fans and to himself to give his best whenever possible.\n\n\"If I'm on the floor, I've got to try to play as hard as I can or do something to affect the game and not cheat the game,\" said James, who had 12 points and three assists in the fourth quarter. \"So if I'm out on the floor, if I'm in uniform, then I've got to try to make things happen.\"\n\nJames had a lead to protect, thanks to a white-hot third quarter from Kuzma, who was 7 for 8 from the field and made four of his five 3-point attempts. It was the fourth time this season Kuzma scored at least 20 points in a quarter, giving the Lakers an 87-77 lead after three quarters.\n\nThe Lakers started the third quarter on a 16-0 run with Kuzma completing a three-point play and James knocking down two 3-pointers, his second giving Los Angeles a 62-49 lead.\n\n\"We just weren't getting back. They were running the floor, pitching the ball up the court and finding some easy ones,\" Kings guard De'Aaron Fox said. \"I don't think we made it extremely tough on (Kuzma) today, but he had a great game.\"\n\nON THE JOB TRAINING\n\nKings coach Dave Joerger has kept Bagley almost exclusively at forward in his rookie season to allow him to ease into his new environment. But Bagley has the size and length to play at center and defend that position, something he is starting to do more in the final games. Bagley's growing versatility was evident against the Lakers, even getting to take on James at both ends of the court.\n\n\"I want to be able to guard every position out there,\" Bagley said. \"I just try to lock in and try to do my best to stop them and get stops for my team, and just try to play hard. But it's exciting.\"\n\nMCGEE THE QB\n\nJames credited McGee for keeping the Lakers defense organized in the second half, limiting the Kings to 38.9 percent shooting and making 12 of 25 shots inside the paint. McGee was calling out screens and rotating when necessary to change the trajectories of shots, James said. The veteran center finished with five blocks.\n\n\"We're very good when JaVale is kind of quarterbacking that whole thing,\" James said. \"It's great when he's active, and on the offensive end we just trying to reward him.\"\n\nTIP-INS\n\nKings: Sacramento outscored Los Angeles 51-17 in bench points. However, Bagley, Bogdanovic and Yogi Ferrell were the only Kings reserves to score. Bogdanovic had 17 points, and Ferrell scored nine. ... F Harry Giles III missed his second straight game because of a thigh contusion. Joerger was hopeful Giles would be available at Dallas on Tuesday.\n\nLakers: Kentavious Caldwell-Pope scored 16 points while starting in place of Reggie Bullock. Bullock did not play because of plantar fasciitis. ... Los Angeles had a 31-20 edge in fast-break points. ... Coach Luke Walton expects an update on F Josh Hart (knee) this week. Hart missed his second straight game.\n\nUP NEXT\n\nKings: Visit Dallas on Tuesday.\n\nLakers: Host Washington on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994164.385494
}