{
  "game_id": "0021800636",
  "espn_id": "401071313",
  "date": "Jan 12, 2019",
  "matchup": "SAC vs. CHA",
  "headline": "Bogdanovic scores 22 to lead Kings past Hornets, 104-97",
  "body": "SACRAMENTO, Calif. --  The Sacramento Kings usually try to run past opponents or win games from behind the 3-point line. They are also learning they can triumph by playing solid defense and limiting their mistakes on offense.\n\nBogdan Bogdanovic scored 22 points, Willie Cauley-Stein had his second straight double-double with 12 points and 12 rebounds, and the Kings beat the road-weary Charlotte Hornets 104-97 on Saturday night.\n\nThe Kings, who committed just 11 turnovers compared to 20 by Charlotte, are 7-0 this season when holding an opponent below 100 points. Earlier this week, Sacramento had 26 turnovers in a loss at Phoenix.\n\n\"This was kind of a gritty win. We stuck together, kept competing defensively and got stops,\" Kings coach Dave Joerger said. \"A good win for us.\"\n\nDe'Aaron Fox and Buddy Hield each scored 21 points for the Kings, who improved to 10-3 against Eastern Conference teams. The Hornets fell to 2-11 against teams from the West.\n\nKemba Walker had 31 points despite going 3 for 12 on 3-pointers for the Hornets, who have lost three straight and five of six. Charlotte is 5-15 away from home this season, and is 1-4 on a trip that ends Monday at San Antonio.\n\nThe Hornets did a good job of slowing down the Kings, holding them to four fast-break points, but Sacramento hit crucial shots in the fourth quarter every time Charlotte tried to make a run.\n\n\"Just a lot of mistakes. We made a lot of mistakes down the stretch defensively, and they made plays,\" Walker said. \"That's really what it was. We came out with some great energy tonight. We were really conscious of that. We haven't been playing with that kind of energy as of late.\"\n\nWalker had 14 points in the first half and Charlotte led 59-57 entering the third period. The Kings held an 82-76 lead at the start of the fourth quarter. Charlotte opened the final period with four straight points to pull within a bucket, but Bogdanovic had five points in a 10-0 run to give the Kings a 92-80 lead.\n\nWalker responded with six straight points to start a 9-0 Charlotte run that brought the Hornets back within three points, yet they could get no closer as Hield scored eight late points and the Kings extended their lead.\n\n\"We got stops when we needed to get stops, and that's what ultimately brought us out on top,\" Fox said. \"They made a run at the end, but we were able to get the stops when we needed them.\"\n\nTIP-INS\n\nHornets: Walker has scored 30 or more points in 12 contests this season, and has 68 such games in his career. . ... Michael Kidd-Gilchrist had 11 points and seven rebounds off the bench. ... Tony Parker was given the night off. ... Host the Kings on Thursday. ... Three straight losses ties their longest skid of the season.\n\nKings: Cauley-Stein had 14 points and 14 rebounds two nights earlier in Sacramento's 112-102 home victory over the Detroit Pistons. ... Marvin Bagley had 11 points and nine rebounds off the bench. ... Broke a three-game losing streak to the Hornets, and defeated Charlotte in Sacramento for the first time since 2015.\n\nFELLOW WILDCATS\n\nFox and Malik Monk, who had 10 points off the bench for the Hornets, were backcourt mates at Kentucky in 2016-17. That Wildcat team reached the final eight of the NCAA Tournament.\n\nUP NEXT\n\nHornets: Visit San Antonio on Monday. Charlotte is playing 10 of its 14 games in January on the road.\n\nKings: Host the Portland Trail Blazers on Monday, wrapping up a three-game homestand. The Kings then have a six-game road trip, and do not play again in Sacramento until Jan. 30.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994199.695319
}