{
  "game_id": "0022200081",
  "espn_id": "401468236",
  "date": "Oct 29, 2022",
  "matchup": "MIA @ SAC",
  "headline": "Kings outlast Heat 119-113, win first game of Mike Brown era",
  "body": "SACRAMENTO, Calif. -- — Kevin Huerter scored 27 points, hitting seven 3-pointers, to help the Sacramento Kings win for the first time this season with a 119-113 victory over the Miami Heat on Saturday.\n\n\r\n              It’s the first victory for Kings coach Mike Brown, who was hired this past offseason. The Los Angles Lakers are the last winless team in the NBA.\n\n\r\n              “It was (about) trying to get a win,” Brown said. “Doesn’t matter when it comes. ... hopefully we can have some carryover going on this road trip.”\n\n\r\n              Kings rookie Keegan Murray scored a career-best 22 points.\n\n\r\n              “I think we played well,” Murray said. “We expect to win games.”\n\n\r\n              With the Kings up four points, Huerter was fouled with 14.2 seconds left. He made both free throws to extend Sacramento’s lead to six and seal the win.\n\n\r\n              De’Aaron Fox had scored 27 points or more during the Kings’ first four games of the season. He finished with 17 points and added 13 rebounds, a career-high.\n\n\r\n              Domantas Sabonis picked up two early fouls in the third quarter and sat with five fouls until the early fourth. Sabonis finished with 18 points and seven rebounds in 22 minutes. He fouled out with 5:52 left.\n\n\r\n              Harrison Barnes scored 11 points. All five Sacramento starters scored in double-figures.\n\n\r\n              “Nobody knows how hard those guys work,” Brown said. “Watching these guys work every day and seeing their togetherness, you feel that we’re going to have a real shot at this thing.”\n\n\r\n              Tyler Herro led the Heat (2-5) with 34 points and knocked down five 3-pointers. Bam Adebayo added 23 points and Kyle Lowry had 15.\n\n\r\n              Jimmy Butler scored 13 points, his lowest scoring output of the season.\n\n\r\n              After Sacramento went up 42-33 with 7:28 in the second quarter, they ended the first half on a 29-13 run to stretch the lead to 22 at the break.\n\n\r\n              “That’s been a little bit of a trend, our starts defensively,” Miami Heat coach Erik Spoelstra said. “They came in with desperation. They wanted to get that first win.”\n\n\r\n              The Heat outscored Sacramento 33-19 in the third, which cut the Sacramento lead to six. Miami cut the lead to as close as one after a Herro And-1.\n\n\r\n              “It’s not rocket science to us,” Spoelstra said. “... we are going to improve. We are not that far away.”\n\n\r\n              KENTUCKY REUNION\n\n\r\n              For the first time in an NBA regular season game, Malik Monk, Fox and Adebayo shared the court together The trio played together during the 2016-17 season at Kentucky. The Wildcats reached the regional final that year.\n\n\r\n              TIP-INS\n\n\r\n              Heat: F/C Dewayne Dedmon missed Saturday’s game with a non-COVID illness. Dedmon played 34 games with Sacramento during the 2019-20 season… Miami coming in had won three of four against Sacramento.\n\n\r\n              Kings: Brown successfully won a challenge in the first quarter when a foul was called on Sabonis. It was changed to an offensive foul on Adebayo… Sacramento coming in had committed the 5th most fouls in the NBA, averaging 23.8 per game. They had 29 against Miami… Kings shot a season-low 31 3-pointers.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Hosts Golden State on Tuesday.\n\n\r\n              Kings: Start a four-game road trip and play the Hornets Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993993.750248
}