{
  "game_id": "401810048",
  "espn_id": "401810048",
  "date": "Nov 09, 2025",
  "matchup": "ORL vs BOS",
  "headline": "Brown, Walsh, White and Simons power the Celtics to a 111-107 win over the Magic",
  "body": "ORLANDO, Fla. -- — Jaylen Brown scored 27 points, and Derrick White and Jordan Walsh hit 3-pointers in the final minute to send the Boston Celtics to a 111-107 win over the Orlando Magic on Sunday night.\n\n\r\n              White, who finished with 21 points, hit a 3-pointer with 45 seconds left to give the Celtics a four-point lead. Walsh made a 3 with 13 seconds remaining to extend Boston's lead to 110-105.\n\n\r\n              Paolo Banchero, slowed by foul trouble in the second half, scored 14 of his 28 points in the fourth quarter for Orlando. Franz Wagner and Jalen Suggs scored 20 points apiece.\n\n\r\n              Boston's Anfernee Simons scored 25 points in the first half.\n\n\r\n              Simons hit three 3-pointers and scored Boston's first 14 points of the second quarter, helping the Celtics to an 11-point lead.\n\n\r\n              The Magic pulled even by halftime and led 85-83 when Suggs scored on an inside runner early in the fourth quarter. Luka Garza (16 points, eight rebounds in 17 minutes) and Hugo Gonzalez then combined for nine points as part of a 13-0 bench surge, giving Boston an 11-point edge with 5:58 left.\n\n\r\n              Banchero hit a turnaround jumper pulled the Magic within one point with 59 seconds left, but Orlando failed to complete the comeback try.\n\n\r\n              The Magic shot 7 for 30 (23.3%) from 3-point range. The Celtics shot 13 for 33 (39.4%), but made 5 of 8 in the final quarter, including two by Walsh.\n\n\r\n              Up next\r\n              Celtics: At Philadelphia 76ers on Tuesday.\n\n\r\n              Magic: Host Portland Trail Blazers on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042591.3686268
}