{
  "game_id": "0022200013",
  "espn_id": "401468028",
  "date": "Oct 19, 2022",
  "matchup": "PHX vs. DAL",
  "headline": "Suns rally from 22 points down to beat Mavericks 107-105",
  "body": "PHOENIX -- — Damion Lee understands the final possession etiqutte in an NBA game, so the Phoenix Suns new role player passed the ball to Devin Booker with about 15 seconds left, expecting the All-Star guard to take the final shot.\n\n\r\n              Booker passed it right back to Lee.\n\n\r\n              The 6-foot-5 Lee rewarded Booker's confidence by hitting a difficult jumper over Spencer Dinwiddie with 9.7 seconds left, lifting the Suns to a 107-105 victory over the Dallas Mavericks on Wednesday night after they trailed by 22 points early in the third quarter.\n\n\r\n              “I got double-teamed, so I made the right play,” Booker said grinning. “I trust my teammates, I trust everybody out there. It's something we've scouted and we've schemed. Teams are going to throw different defenses at me.”\n\n\r\n              Booker finished with a team-high 28 points. Lee scored all of his 11 points in the fourth quarter.\n\n\r\n              Lee — who signed with the Suns in the offseason after four seasons with Golden State — hit three important 3-pointers in the fourth, but saved the best for the final seconds.\n\n\r\n              “Ball was in my hands, just go make a play,” Lee said. “I know people are giving me the credit with the game-winning shot, but this was a total team effort.”\n\n\r\n              Dallas star Luka Doncic missed a long 3-pointer at the buzzer.\n\n\r\n              “It's the first game, we have a couple of new guys, we still have to work,” Doncic said. “We have 81 games to go. We are going to get it right.”\n\n\r\n              It was an impressive come-from-behind win for the Suns, who picked up a victory against the team that eliminated them from the playoffs last season in embarrassing fashion.\n\n\r\n              The Mavericks led 67-45 early in the third quarter and 93-80 with eight minutes left, but the Suns kept pushing. Cameron Payne's layup put the Suns up 101-100 with 3:10 left for the first lead since the first quarter.\n\n\r\n              Doncic scored 35 points for the Mavericks. Christian Wood added 25 points and eight rebounds in his team debut.\n\n\r\n              Dallas built a 21-point lead in the second quarter but the Suns cut that advantage to 77-76 late in the third on Payne's jumper. Wood made back-to-back 3s — including one that banked off the glass — to push the Mavs back on top 88-76 early in the fourth.\n\n\r\n              But the Suns never stopped playing. Deandre Ayton had 18 points and 10 rebounds, Cameron Johnson added 15 points, and Mikal Bridges had 13 points and 11 rebounds. Johnson left the game in the fourth quarter because he was cramping and didn't return.\n\n\r\n              The 23-year-old Doncic — entering his fifth NBA season — scored 13 points as the Mavericks jumped out to a 32-24 lead after the first quarter. Dallas stretched its lead to 21 in the second before settling for a 62-45 halftime advantage.\n\n\r\n              “We played for 3 1/2 quarters, then we run out of steam,” Dallas coach Jason Kidd said. \n\n\r\n              It was the first game for the Suns since their stunning 123-90 home loss to the Mavs in Game 7 of the Western Conference semifinals. The top-seeded Suns had won 64 games during the regular season, which set a franchise record.\n\n\r\n              Despite that disappointment, GM James Jones opted to keep most of the nucleus, signing Booker and Ayton to lucrative long-term deals.\n\n\r\n              The Mavericks — which lost to the Warriors in the Western Conference finals after beating the Suns — also have a similar roster, though they lost Jalen Brunson to the Knicks in free agency.\n\n\r\n              MCGEE'S BACK\n\n\r\n              JaVale McGee was back in Phoenix on Wednesday, but he had switched sides from the Suns to the Mavericks.\n\n\r\n              The 7-foot McGee started for the Mavericks, finishing with three points and four rebounds in 14 minutes. He was a vital part of the Suns' bench last season, averaging 9.2 points and 6.7 rebounds per game.\n\n\r\n              SARIC, TOO\n\n\r\n              Suns forward Dario Saric played in his first game since suffering a torn ACL in the first half of Game 1 of the NBA Finals in 2021. He missed all of last season.\n\n\r\n              Saric — who checked in early in the second quarter to loud cheers — averaged 8.7 points per game during the 2020-21 season.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: F Davis Bertans (right knee) and G Frank Ntilikina (right ankle) weren't available to play. G Facundo Campazzo was on the inactive list. \n\n\r\n              Suns: G Landry Shamet (left hip strain) and F Jae Crowder (not with team) weren't available to play. Crowder and the Suns mutally agreed that the forward would stay away from the team while the front office looked for a trade. ... C Deandre Ayton played just seven minutes in the first half because of foul trouble.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Memphis on Saturday night.\n\n\r\n              Suns: At Portland on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995101.443325
}