{
  "game_id": "0022200841",
  "espn_id": "401468996",
  "date": "Feb 10, 2023",
  "matchup": "MEM vs. MIN",
  "headline": "Morant has near triple-double as Grizzlies top Timberwolves",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 32 points, nine rebounds and nine assists, Desmond Bane added 20 points and the Memphis Grizzlies built a big lead through the fourth quarter and coasted to a 128-107 win over the Minnesota Timberwolves on Friday night.\n\n\r\n              Santi Aldama finished with 18 points, while Jaren Jackson added 15 points and four blocks as Memphis was still shooting close to 60% when both teams emptied their benches in the fourth. \n\n\r\n              Memphis, which built some cushion late in the first half, went on a 9-0 run to stretch its lead to 112-92 in the fourth. The win was the second straight for Memphis, after going through a stretch where the Grizzlies lost eight of nine.\n\n\r\n              “This was just a product of getting a couple of practices under our belt. A couple of shootarounds,” Memphis coach Taylor Jenkins said. “Guys watching film and craving it.”\n\n\r\n              Like many teams, Minnesota had to choose how to try to stop Morant, who was 13 of 23 from the field. He was 10 of 15 in the paint, scoring 20 points in that area. But things got tougher with Morant connecting on a trio of 3-pointers in the first half. \n\n\r\n              Minnesota coach Chris Finch said his defenders were too far off the ball at the point of attack.\n\n\r\n              “It's certainly a challenge for anyone to keep A, Ja out of the paint, and B, away from the rim,” Finch said.\n\n\r\n              Jaylen Nowell led the Timberwolves with 21 points, while Anthony Edwards scored 17 points. Taurean Prince and Kyle Anderson scored 12 points apiece for Minnesota.\n\n\r\n              With Thursday's trade deadline still working itself out, the Timberwolves pieces were available to play. Mike Conley, acquired by Minnesota from Utah at the trade deadline, started at point guard and had nine points. Luke Kennard, who the Grizzlies picked up from the Los Angeles Clippers, did not play.\n\n\r\n              “It was weird,” Conley said of walking into the starting point guard role the day after the trade, “But it was like basketball at the end of the day. ... I didn't know anything as much as I would like to.”\n\n\r\n              The teams played extremely close through the first two quarters. Neither team led by more than six points until Memphis went on a 12-2 run to close the half. There were nine ties and three lead changes before the Grizzlies took a 69-58 advantage.\n\n\r\n              The teams' two electrifying guards — Morant and Edwards — led their respective teams in the half, with Morant scoring 20 points and Edwards, the top scorer for Minnesota, with 11.\n\n\r\n              The teams played even through most of the third until another closing burst by Memphis stretched the lead to 103-86. At that point, Memphis was shooting 62% for the game.\n\n\r\n              “They made a lot of tough shots,” Conley said, “but for the most part, we let them get too many easy ones.”\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: In addition to Conley, Nickeil Alexander-Wallace, picked up in trade deadline acquisitions, was available but did not play. ... Gobert grabbed seven rebounds in the first half to pass Caldwell Jones for 83rd on NBA's career list. In the fourth quarter, he tied Sam Perkins for 82nd. \n\n\r\n              Grizzlies: Bane passed Michael Dickerson for 20th in franchise scoring. ... Morant's 3-pointers in the first half, tied him with with Marc Gasol for 10th on franchise list with 301.\n\n\r\n              A LUKE BOOST\n\n\r\n              When asked about the improved play Friday night, Morant said it was due to “my dog, Luke (Kennard).”\n\n\r\n              And Morant, not necessarily known for his 3-point shooting, said Kennard's presence helped him on his 3-pointers in the first half. “I had to step up a little bit,” Morant said. “Shoot like him.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Play the Mavericks at Dallas on Monday\n\n\r\n              Grizzlies: Travel to Boston on Sunday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994186.529402
}