{
  "game_id": "0022300443",
  "espn_id": "401585071",
  "date": "Dec 30, 2023",
  "matchup": "MIN vs. LAL",
  "headline": "Edwards scores 31, Timberwolves hold on to beat the Lakers 108-106 on LeBron's 39th birthday",
  "body": "MINNEAPOLIS -- — LeBron James woke up sick on his 39th birthday, unsure if he'd be able to help the Los Angeles Lakers in their road game Saturday night against the Western Conference-leading Minnesota Timberwolves.\n\n\r\n              James played and, as he's done throughout his career, hit a big shot in the closing seconds. Unfortunately for the Lakers, the NBA's replay center ruled the long jumper with 3.3 seconds left was just a 2-pointer, leaving James to question the replay ruling on his birthday.\n\n\r\n              Anthony Edwards scored 31 points, Naz Reid added 21 off the bench and Minnesota held on to beat Los Angeles 108-106 Saturday night.\n\n\r\n              Rudy Gobert had 13 points and 13 rebounds as Minnesota overcame 19 turnovers to win for the fourth time in five games. Two of those wins have come against Los Angeles and the Timberwolves are now 14-1 at home this season.\n\n\r\n              “It was the same story that we talked about before the game,” Minnesota coach Chris Finch said. “We shoot 50%, (have) 19 turnovers. Whenever we didn’t turn it over, we got pretty decent looks. Sometimes the switching bothered us a little bit, but I thought we moved it really well, and just turnovers continue to plague us.”\n\n\r\n              Edwards scored 11 points in the fourth, hitting a pair of 3-pointers after the Lakers had closed within one each time. Mike Conley's 3-pointer with 35 seconds remaining gave Minnesota a 107-100 lead.\n\n\r\n              Los Angeles had a closing push led by James, whose long jumper with 3.3 seconds left was ruled a 2-pointer and confirmed by replay, leaving the Wolves up 107-106.\n\n\r\n              “It’s obviously a 3,” James said. \"My foot is behind the line. I mean, you can see the space between the front of my foot and the 3-point line. You can clearly see a white, the wood on the floor. There’s a space in between the front of my foot and the 3-point line. So, you know, Stevie Wonder can see that, champ.”\n\n\r\n              James later added: “It’s super frustrating in the sense of what the hell we got a replay for? What do we have replay for if even the replay gets it wrong?\"\n\n\r\n              Edwards hit one of two free throws and James' attempt at the buzzer was off the mark.\n\n\r\n              “I had no clue,” Edwards said. \"I was ready to hit the game-winner, for real. I was ready for Finchy to draw up a play for me. I was ready for that, I didn’t even know it was a 2 until everybody was saying it.”\n\n\r\n              Anthony Davis had 33 points, 17 rebounds and eight assists for Los Angeles, which has lost seven of 10 since winning the In-Season Tournament. James, who was questionable for the game with a non-COVID-19 illness, added 26 points.\n\n\r\n              The Lakers scored 19 points off Minnesota turnovers but shot just 42% from the field and were 7 of 24 from 3.\n\n\r\n              “We had some guys that had some great looks, looks they normally knock down that they didn't knock down,” Los Angeles coach Darvin Ham said. \n\n\r\n              In the fourth game with their bigger starting lineup, the Lakers hounded Minnesota early with Davis the focal point on both ends. Los Angeles led by as many as 11 in the first quarter, while Davis had 17 points, eight rebounds and four assists in the first.\n\n\r\n              The Wolves’ shooting eventually brought them back with a spark off the bench from Reid. With Karl-Anthony Towns struggling, the third of Minnesota’s big men answered with a pair of 3-pointers before going to the basket for his points.\n\n\r\n              “Once again, he saves us,” Edwards said of Reid. “So yeah, it’s always strength in numbers or whatever you wanna call it.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Finish a back-to-back Sunday afternoon at New Orleans.\n\n\r\n              Timberwolves: Play at New York on New Year’s Day.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764996479.29869
}