{
  "game_id": "0022000961",
  "espn_id": "401307764",
  "date": "May 01, 2021",
  "matchup": "MEM @ ORL",
  "headline": "Anthony's 3-pointer gives Magic 112-111 win over Grizzlies",
  "body": "ORLANDO, Fla. -- — Cole Anthony hit a contested 3-pointer with 0.1 seconds remaining, giving him a career-best 26 points, and the Orlando Magic beat the Memphis Grizzlies 112-111 on Saturday night.\n\n\r\n                    Anthony, a rookie who hit a game-winning shot earlier in the season against Minnesota, drilled the high-arching shot over the outstretched arm of Memphis guard Kyle Anderson. Anthony, who had 15 fourth-quarter points, added eight rebounds and six assists for the Magic, who ended their home losing streak at nine games.\n\n\r\n                    “Crunch time, I said this a couple of games ago, I want that ball and I want to go and get it for my team,” said Anthony, who made 4 of 6 shots and hit all five of his free throws in the fourth. “If it means making the right play and getting the ball to someone else so they can get a bucket or me making a big shot, I just want to get that (win) for the team.”\n\n\r\n                    Memphis led by 20 points in the third quarter before Orlando’s furious rally in the fourth. The Magic tied the game at 109 on a 3-pointer from Moritz Wagner with 1:16 to play.\n\n\r\n                    After the teams traded misses, Memphis got possession on a ball out of bounds following a lengthy replay review. Grizzlies guard Dillon Brooks then went to work and hit a 17-foot jumper over the outstretched arm of Orlando’s Dwayne Bacon to give the Grizzlies a 111-109 lead with 7 seconds to play. \n\n\r\n                    But Anthony answered with his jumper, leaving Memphis with its 10th loss in games where it lead by double digits.\n\n\r\n                    Currently eighth in the Western Conference standings, the Grizzlies fell three games back of Portland and had their lead over San Antonio drop to a half-game.\n\n\r\n                    “It doesn’t matter who we are playing — the worst team in the East or the best in the West — we need all of these games,” Brooks said. “It’s just energy and competitiveness.”\n\n\r\n                    Brooks scored 23 points, while Ja Morant added 22 points and seven assists. Anderson had 21 points, but did not score in the fourth quarter. Jonas Valanciunas notched his 43rd double-double of the season with 11 points and 16 rebounds.\n\n\r\n                    The teams were playing for a second consecutive night after the Grizzlies won 92-75 in Memphis in a game where both teams failed to reach 40% shooting. \n\n\r\n                    Wagner had a season-high 24 points in just his third game with the Magic. His biggest shot of the night knotted the game at 109. Afterward, he marveled at the gutsy shot Anthony made to give the Magic the win.\n\n\r\n                    “He has the right amount of craziness in him and I mean that in a positive way,” said Wagner, who hit 4 of his 6 3-pointers. \n\n\r\n                    Bacon scored 23 points, while R.J. Hampton added 18.\n\n\r\n                    CLIFFORD STILL OUT\n\n\r\n                    Magic coach Steve Clifford, who led Orlando to the playoffs each of the two previous seasons, missed his fifth straight game because of COVID-19 protocols. Clifford tested positive for the virus last week, then tested negative twice and was positive again. Clifford’s first positive test came in between two vaccination shots and he’s yet to experience any of the virus symptoms.\n\n\r\n                    “From everything he has told me, he’s feeling fine, has no symptoms, no temperature and his oxygen levels are good,” acting head coach Tyrone Corbin said. “He’s feeling great and looking forward to coming back.” \n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Grayson Allen missed his second straight game with a hand injury. Memphis coach Taylor Jenkins said Allen is trending toward returning by Monday. … The Grizzlies recently started a season-closing stretch of 11 games in 17 nights. The final 10 opponents have a .408 winning percentage prior to Saturday for the NBA’s second-easiest closing stretch. … A night after hitting just 3 of 12 shots, Morant made his first four shots.\n\n\r\n                    Magic: The Orlando Magic Youth Foundation raised more than $150,000 at a charity golf tournament to benefit at-risk children in Central Florida. The money raised this week pushed OMYF’s total donated over the last 30 years to $26 million. … The Magic were once again without five players, including forward Chuma Okeke for a second straight game with a sprained ankle. …\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Host New York on Monday night.\n\n\r\n                    Magic: Play at Detroit on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996919.0678341
}