{
  "game_id": "0021401132",
  "espn_id": "400579424",
  "date": "Apr 03, 2015",
  "matchup": "OKC @ MEM",
  "headline": "Green scores 22 points to lead Grizzlies over Thunder 100-92",
  "body": "MEMPHIS, Tenn. -- Jeff Green led Memphis' offense, but it was his defense that shut down Russell Westbrook.\nGreen scored 22 points and Marc Gasol added 19 as the Grizzlies defeated the Oklahoma City Thunder 100-92 on Friday night.\nBut it was a defensive switch to put Green on Westbrook in the second quarter that stymied Westbrook the rest of the night. After scoring 12 points in the first quarter against the Memphis point guards, coach Dave Joerger put the 6-foot-9 Green on the 6-foot-3 Westbrook.\n\nFrom there, Westbrook scored six points, making only one of 11 shots from the field in the final three quarters.\n\"I didn't want to go to that in the first quarter,\" Joerger said. \"Once we got through the first quarter, we kind of went to it and gave (Westbrook) a different look.\"\nZach Randolph finished with 14 points for Memphis, while Mike Conley and Courtney Lee scored 13 apiece. Nick Calathes contributed 10 as Memphis moved into a tie with Houston for the second seed in the Western Conference and top spot in the Southwest Division.\nEnes Kanter led the Thunder with 24 points and 17 rebounds. Westbrook scored 18, but connected on only five of his 20 shots. Anthony Morrow and Kyle Singler scored 13 each.\n\"Both teams played physical, and both teams made it very hard during spurts,\" Thunder coach Scott Brooks said. \"We missed a bunch of layups, and we missed some free throws (16 of 26), and we missed some good looks at 3s.\"\nMemphis held a nine-point lead with 3 minutes left, but the Thunder got a three-point play from Kanter and a floater from Steven Adams to cut the lead to 92-88 with 2:14 left.\nOklahoma City was unable to get closer the stretch as the Thunder dropped their fourth of the last five, but still maintained a slight half-game hold on the conference's final seed over the New Orleans Pelicans, who defeated Sacramento 101-95 Friday night.\n\"They are one of those teams that is going to grind you down at the end of the shot clock,\" Morrow said of Memphis. \"They'll take 23, 24 seconds to get their shot off. Down the stretch, they just grinded us down.\"\nThe Thunder led through much of the first half as Westbrook was not only scoring early, but putting pressure on Memphis' point guard.\nWestbrook was determined to post up Conley early, then Calathes was put on the Thunder's leading scorer. By early in the second frame, both Memphis point guards were saddled with three fouls.\nBut Green and the Grizzlies defense changed the momentum, helping Memphis take a 55-49 lead into halftime.\n\"It has nothing to do with me. It was a team effort,\" Green said of his defense. \"If coach is going to put me on Russell, my job is to take on the challenge of being in front of him and doing my job.\"\nWestbrook's assessment of the defensive change amounted to \"not much. It just stopped the post up. That was about it. That's normal.\"\nThe Thunder pulled even as Kanter took over in the early stages of the third, but the Grizzlies scored nine straight points to carry a 77-69 lead into the final frame.\n\"We are trying to win out for the rest of the year,\" Lee said. \"Houston is right there with us competing for that second spot. That's the best thing we can do is just try to win all the games.\"\nTIP-INS\nThunder: The teams have played 38 times, including the playoffs, since the start of the 2010-11 season, the most between any two teams in the league. ... Nick Collison missed his seventh straight game with a left ankle sprain.\nGrizzlies: Memphis G Tony Allen missed his third game with a strained left hamstring. ... The Grizzlies recorded their 15th sellout of the season. The franchise record is 18 in the 2004-05 season. ... The Grizzlies play the Washington Wizards on Saturday in a rare home back-to-back. The last time Memphis played games on consecutive nights at home was in February 2012.\nNOT THIS TIME: The Thunder limited Memphis to 37.2 percent shooting in a 105-89 victory Feb. 11 -- the only Oklahoma City victory over the Grizzlies this season. Memphis shot 47.5 percent in Friday's win.\nUP NEXT:\nThunder: Host Rockets on Sunday.\nGrizzlies: Host Wizards on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764991864.290616
}