{
  "game_id": "0022000711",
  "espn_id": "401307500",
  "date": "Mar 29, 2021",
  "matchup": "TOR @ DET",
  "headline": "Rookies lead Pistons over Raptors 118-104",
  "body": "DETROIT -- — Saben Lee scored 14 of his 19 points in the first half in his second career start, and the Detroit Pistons beat the Toronto Raptors 118-104 on Monday night.\n\n\r\n                    Saddiq Bey, another Detroit rookie, also scored 19 points and Hamidou Diallo added 19 of his own. Fred VanVleet scored 22 for the Raptors, who lost for the 12th time in 13 games.\n\n\r\n                    Lee was a second-round draft pick before this season, and the rebuilding Pistons have given plenty of opportunities to their young players recently. He went 6 of 7 from the field in the first half and eventually came within two points of matching his season high.\n\n\r\n                    Lee said he noticed a bit of a difference being a starter.\n\n\r\n                    “I guess it’s kind of more just read and react, being ready for any coverages that they could kind of change up,\" he said. \"Just being ready from the jump, really.”\n\n\r\n                    Detroit led 35-27 after one quarter, then scored the first 11 points of the second. It was never all that close after that. The Pistons led by as many as 23 in the fourth.\n\n\r\n                    “It just seems like we’re just really in a run of injuries, illness, bad breaks,\" Raptors coach Nick Nurse said. \"It is frustrating.”\n\n\r\n                    Detroit had six players in double figures, and four of them were reserves. Diallo grabbed 10 rebounds and Cory Joseph scored 17 points. Rookie Isaiah Stewart contributed 14 points and Frank Jackson added 12.\n\n\r\n                    Toronto, meanwhile, had all five starters in double figures, but its bench was outscored 65-24.\n\n\r\n                    OG Anunoby scored 19 points for the Raptors and Gary Trent Jr. had 15.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Toronto was without DeAndre’ Bembry (health and safety protocols), Jalen Harris (right hip pointer), Patrick McCaw (swollen left knee) and Paul Watson (health and safety protocols).\n\n\r\n                    Pistons: Detroit signed F Tyler Cook to a second 10-day contract before the game. He scored three points. ... The Pistons won easily despite turning the ball over 20 times.\n\n\r\n                    NEW FACES\n\n\r\n                    Diallo was acquired by the Pistons in a recent trade, and this was only the second game he's played for them.\n\n\r\n                    “Once he came in the game, the game changed. He kind of lit a fire under everybody,\" Detroit coach Dwane Casey said. \"Athletic young man, just scratching the surface of who he can be in this league.”\n\n\r\n                    This was Trent's third game since being acquired by Toronto.\n\n\r\n                    “We’ve had one practice,\" he said. \"Just trying to adjust on the fly. As more time goes on, it will get better.”\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Visit Oklahoma City on Wednesday night. The teams split two games last season.\n\n\r\n                    Pistons: Host Portland on Wednesday night. Detroit has won six of its last nine against the Trail Blazers.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996838.52389
}