{
  "game_id": "0021900139",
  "espn_id": "401160781",
  "date": "Nov 10, 2019",
  "matchup": "TOR @ LAL",
  "headline": "Raptors end Lakers' 7-game winning streak in 113-104 victory",
  "body": "LOS ANGELES --  Pascal Siakam had 24 points and 11 rebounds, Fred VanVleet finished with 23 points and 10 assists and the Toronto Raptors snapped the Los Angeles Lakers' seven-game winning streak with a 113-104 victory Sunday night.\n\nChris Boucher matched his career high with 15 points for the Raptors, who have won three straight and six of seven. The defending NBA champions played without two key regulars after losing starter Kyle Lowry to a broken left thumb and top reserve Serge Ibaka to a sprained right ankle, but Toronto still rallied in the fourth quarter and hung on late for its 10th consecutive win over the Lakers.\n\nAnthony Davis scored 27 points and LeBron James had 13 points, 15 assists and 13 rebounds in his 85th career triple-double, but the Lakers lost for the first time since opening night against the Clippers.\n\nToronto led 104-92 with 3:50 to play on Terence Davis' third 3-pointer after a rally by four reserves and Siakam, but Kyle Kuzma hit back-to-back 3-pointers while LA scored eight straight points. The Lakers then missed four consecutive 3-pointers with the chance to pull even, and Siakam threw down back-to-back dunks on the fast break to seal it.\n\nNorman Powell scored 14 points while starting in Lowry's spot for Toronto.\n\nDavis and James both had big games, but the Lakers' supporting cast wasn't helpful and their team defense didn't look nearly as sharp as it had been in recent games. Kuzma scored 13 of his 15 points in the fourth quarter.\n\nDanny Green went scoreless on 0-for-5 shooting in 27 minutes for the Lakers, who signed him to a two-year free agent deal in the summer. The sharpshooting veteran won a ring with the Raptors last year while shooting a career-high 45.5% on 3-pointers during his sole season in Toronto.\n\nSiakam got off to a 3-for-15 start from the field, preventing him from matching his 44-point effort at New Orleans two nights ago. But he excelled in the second half, particularly in a lineup including four reserves as Toronto jumped to its first double-digit lead of the night early in the fourth quarter.\n\nToronto opened the fourth with a 17-6 run led by nine points from Boucher, the undrafted Canadian who was on the last two teams to win the NBA title.\n\nTIP-INS\n\nRaptors: Ibaka is leaving the team to return to Toronto for treatment, Nurse said. He will miss the rest of the road trip. ... Lowry will be out for \"a couple of weeks, minimum,\" according to the coach. ... Nurse won his first coaches' challenge on a foul called against Siakam in the third quarter. Nurse had gone 0 for 6 this season on challenges. He celebrated by hugging his assistant coaches and a Lakers fan at courtside.\n\nLakers: Rajon Rondo has progressed to 5-on-5 full court workouts, but the veteran point guard still isn't ready for his season debut. He has a right calf strain. ... Troy Daniels hit three 3-pointers and finished with 11 points.\n\nUP NEXT\n\nRaptors: Stay in the building to face Kawhi Leonard and the Clippers on Monday night+\n\n.\n\nLakers: Visit the Phoenix Suns on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995657.529724
}