{
  "game_id": "0021701136",
  "espn_id": "400975882",
  "date": "Mar 30, 2018",
  "matchup": "LAL vs. MIL",
  "headline": "Bledsoe scores 39, Bucks beat Lakers 124-122 in OT",
  "body": "LOS ANGELES --  With the game tied in the final seconds of regulation, Eric Bledsoe missed the same type of 3-pointer that he'd gotten the entire game.\n\nOnce the next five minutes started, Bledsoe made up for that miss in a big way.\n\nBledsoe scored 11 of his 39 points in overtime, and the Milwaukee Bucks overcame a huge comeback by the Los Angeles Lakers to win 124-122 on Friday night.\n\n\"I just tried to be aggressive,\" Bledsoe said. \"We needed this game, and I had the hot hand. We always try to go to the hot hand and I just tried to play off that.\"\n\nKhris Middleton added 28 points and Giannis Antetokounmpo scored 27 for the Bucks, who won their third straight game and second in two nights. They beat the Golden State Warriors on Thursday.\n\nBledsoe scored nine straight points to start the overtime period and give the Bucks a 121-112 lead with 2:35 remaining. He made three layups and a 3-pointer during that stretch.\n\nThe Lakers responded with an 8-0 run. Antetokounmpo split a pair of free throws with 16.4 seconds remaining, and Kyle Kuzma missed a shot on the next possession. Bledsoe made two free throws with 2 seconds left to seal the win for Milwaukee.\n\n\"I think Bled (did) what he does well: the Bled Show,\" Antetokounmpo said. \"(He) took over the game and gave us a win.\"\n\nKuzma had 27 points for the Lakers, who will finish with a losing record. Brook Lopez added 20 points, while Julius Randle had 18 points and 10 rebounds.\n\nRandle tied the game at 112 on a layup with 1:30 to go in regulation. Bledsoe and Middleton both had opportunities to give the Bucks the lead in the closing seconds, but they each missed.\n\nLos Angeles outscored Milwaukee 29-15 to send the game into overtime.\n\nKuzma gave the Lakers a 107-106 lead with 4:57 remaining in the game. It was the first lead for Los Angeles since the first quarter, when it led 21-19 with 5:57 left in the period.\n\nMilwaukee built a 20-point lead late in the third quarter that culminated in Brandon Jennings assisting back-to-back baskets by Jabari Parker and Tyler Zeller.\n\n\"Obviously the first pretty much three quarters, it was as bad as I've seen us play defensively,\" Lakers coach Luke Walton said. \"They were shooting rhythm shots. Bledsoe might as well (have) been in a gym by himself shooting 3-pointers.\"\n\nIvica Zubac scored 12 points in the fourth quarter and along with the second unit ignited a 29-9 run that bridged the third and fourth periods for the Lakers. Zubac finished with 16 points.\n\n\"They were huge for us,\" Josh Hart said of the unit that closed the gap. \"They were out there having fun, playing together, getting stops out in transition, and playing to our strengths. So you have to give them a lot of credit. They battled and got us back in it.\"\n\nRandle dunked the ball ferociously over Tyler Zeller to give the Lakers a 21-17 lead midway through the first quarter. Los Angeles trailed 39-34 despite shooting 78 percent from the field in that period.\n\nTIP-INS\n\nBucks: Made 11 3-pointers.\n\nLakers: Kentavious Caldwell-Pope was ejected late in the second quarter after vociferously arguing a non-call. He had to be restrained by Walton and teammates.\n\nHART RETURNS\n\nHart had 13 points and 13 rebounds in his return from a broken left hand that kept him out 14 games.\n\nWalton said before the game that while Hart's recovery time put his potential return near the end of the season, he wanted to get Hart some playing time if there were enough games left.\n\n\"He's been cleared to play,\" Walton said. \"He's played 3-on-3, 2-on-2, for the last few days. He's gotten smacked in that hand a few times. The doctors have told us he's good to go. It's as strong as the other hand. So there's no reason, in my opinion, that we shouldn't get him out there playing again and finding a little bit of rhythm before we get into the offseason.\"\n\nHIGH SCHOOL REUNION\n\nWalton attended University of San Diego High School, where Prunty was a head coach of the freshman team and an assistant on the varsity team. Prunty coached Walton while in high school.\n\nLater in his career, Prunty landed a job as an assistant with the Cleveland Cavaliers and again coached Walton, who spent two years there before retiring from the NBA.\n\n\"I played under Joe on my last year and a half in Cleveland, I've seen Joe in the tunnels for years when I was a player,\" Walton said. \"So the fact that we were in the same high school together and he was coaching me, that part I've gotten over. But if you do take a step back, it's kind of strange that my high school coach is now the head coach of the team that I'm coaching against.\"\n\nPrunty jokingly took credit for all of Walton's basketball skills.\n\n\"What was interesting was Uni High School at the time, we were red and gold,\" Prunty said. \"The next time I met up with Luke after he had gone on to Arizona and the NBA and with the Lakers obviously for a while, the next time I saw him was in Cleveland, and red and gold were the colors. It was interesting.\"\n\nUP NEXT\n\nBucks: At the Denver Nuggets on Sunday.\n\nLakers: Host the Sacramento Kings on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764992937.87313
}