{
  "game_id": "0022000052",
  "espn_id": "401267212",
  "date": "Dec 29, 2020",
  "matchup": "ORL @ OKC",
  "headline": "Vucevic has double-double as Magic beat Thunder 118-107",
  "body": "OKLAHOMA CITY -- — Nikola Vucevic had a season-high 28 points and 10 rebounds, and the Orlando Magic beat the Oklahoma City Thunder 118-107 Tuesday night.\n\n\r\n                    Orlando, 4-0 for the first time in the franchise’s 31-season history, is one of only two remaining unbeaten teams in the NBA, along with Atlanta. The Magic started 3-0 only three previous times before this season.\n\n\r\n                    “We’re happy where we are, to start the season 4-0, but we also at the same time are aware that there are so many things we can do better, especially on the defensive end,” Vucevic said. “The positive is knowing that we were able to win, so now we can work on those things and get better and take a step forward.”\n\n\r\n                    Shai Gilgeous-Alexander had 23 points, seven rebounds and seven assists for Oklahoma City, which lost its second home game in two nights after winning its opener at Charlotte. The Thunder had won their last five games (and 15 of their last 18) against the Magic and now are 10-3 at home all-time against Orlando.\n\n\r\n                    Dwayne Bacon went 9 of 10 from the field and scored 18 points to go with eight rebounds for Orlando, which surpassed the 110-point mark for the fourth straight game. After the Thunder tied the score at 87-87 early in the fourth, Bacon scored six points in a 10-4 spurt that gave Orlando the lead for good.\n\n\r\n                    Oklahoma City made only 4 of 13 free throws in the fourth, thwarting the Thunder’s hopes to rally. Isaiah Roby, who hadn’t scored a point in a NBA game before Tuesday, had 19 points and seven rebounds for Oklahoma City, while Luguentz Dort added 15 and Mike Muscala had 14.\n\n\r\n                    “I thought we scrapped pretty hard tonight,” Thunder coach Mark Daigneault said. “I thought our competitiveness and engagement, in the first three quarters especially, was pretty good. There were a couple of times where the game could have gotten away from us and we made a play or made a stop. Obviously, (we) just didn’t get enough in the fourth, or throughout the game.”\n\n\r\n                    Orlando led 36-27 early in the second quarter before a 12-2 run — fueled by nine points from Hamidou Diallo — put the Thunder back ahead 39-38. The Magic again pushed its lead out, this time to 53-43, but Oklahoma City pulled within 60-56 by halftime. The Thunder briefly pulled even at 80-80 on a 3-pointer by Gilgeous-Alexander but Orlando led 87-85 entering the fourth quarter.\n\n\r\n                    TIP-INS:\n\n\r\n                    Magic: Vucevic became Orlando’s franchise leader in field goals by making 12 against the Thunder. He now has 4,083 with the Magic, passing Nick Anderson (4,075) in that statistical category … Aaron Gordon started but coach Steve Clifford said Gordon remains on a minutes restriction as the player recovers from a hamstring injury he suffered last season. He scored 12 points in 22 minutes.\n\n\r\n                    Thunder: Center Al Horford didn’t play, resting on the second day of a back-to-back, while veteran guard George Hill missed the game with neck spasms … Roby and Justin Jackson both started for the first time this season for Oklahoma City. It was Roby’s first career start and he scored nine first-quarter points … The shooting woes continued for first-round draft pick Aleksej Pokusevski, who went 1 of 8 from the field, although he did score his first career points in the third quarter of his third NBA game.\n\n\r\n                    QUOTABLE:\n\n\r\n                    Clifford, on Vucevic setting the franchise’s record for field goals: “He’s such a professional and such a committed, conscientious player. … He gives me a lot of credit for him playing well since I got here. There’s no guy here that I’ve done less to help than him. The way he works, the amount of time he puts in, two years ago he was an All-Star and last year he was our best player. He is in a great place right now and he’s ready to have a terrific, terrific year.”\n\n\r\n                    UP NEXT:\n\n\r\n                    Magic: Begin a four-game homestand against Philadelphia on Thursday before hosting Oklahoma City on Saturday.\n\n\r\n                    Thunder: Host New Orleans on Thursday before starting a five-game road stretch on Saturday in Orlando.",
  "source": "espn_api",
  "crawled_at": 1764997814.58534
}