{
  "game_id": "0022301216",
  "espn_id": "401616470",
  "date": "Dec 08, 2023",
  "matchup": "TOR @ CHA",
  "headline": "Gordon Hayward scores 24 points as hot-shooting Hornets hold off Scottie Barnes, Raptors 119-116",
  "body": "CHARLOTTE, N.C. -- — Gordon Hayward scored 24 points, Miles Bridges added 22 and the hot-shooting Charlotte Hornets survived Scottie Barnes' triple-double to beat the Toronto Raptors 119-116 on Friday night.\n\n\r\n              Terry Rozier had 21 points and 13 assists and rookie Brandon Miller scored 20 for the Hornets, who shot 55.7% from the field, 52% from beyond the 3-point arc and made 18 of 20 free throws.\n\n\r\n              Barnes had 31 points, 10 assists and 10 rebounds for Toronto, but missed a shot at the buzzer that appeared as though it would have sent the game into overtime had it gone down. After the game, it was determined that Barnes' foot was on the line, making it a 2-point attempt.\n\n\r\n              Barnes' triple-double was the third of his career and second this season.\n\n\r\n              Pascal Siakam added 25 points for the Raptors, who trailed by 13 points to start the fourth quarter and rallied to take a five-point lead, only to squander it down the stretch.\n\n\r\n              “It was just about not panicking,” Bridges said of battling back after surrendering the lead. “We know they went on a run and they came back, but at that moment right there we just had to change the way we were playing and be more physical.”\n\n\r\n              Despite playing without their top scorer in LaMelo Ball, who is out with an ankle injury, the Hornets tied a franchise record with four players finishing with at least 20 points — the first time that has happened since Feb. 13.\n\n\r\n              “That is what we need to do, especially with Melo out,” Bridges said. “We're capable of that every night and we have to continue to hold each other accountable and come out and be aggressive every game.”\n\n\r\n              Both teams entered the game having lost four of their previous five.\n\n\r\n              The Hornets led by 20 in the first half and took a 90-77 lead into the fourth quarter. But the Raptors opened the period with an 11-2 run, fueled by their reserves.\n\n\r\n              Toronto took the lead with seven minutes left when Precious Achiuwa knocked down a 3 and pushed its advantage to five when Barnes hit a runner in the lane, drawing boos from the crowd.\n\n\r\n              But the Hornets stormed back behind a barrage of 3s from Bridges, Rozier and Miller to give them a one-point lead with 4:23 left, prompting Raptors coach Darko Rajakovic to put his starters back in.\n\n\r\n              Rozier buried a difficult step-back jumper from the left wing to put Charlotte up by three with 22.2 seconds left before inadvertently fouling Barnes on a 3-point attempt. Barnes missed the first free throw before making the final two.\n\n\r\n              Rozier made two free throws with 7.3 seconds left to put Charlotte up by three.\n\n\r\n              “They made some tough shots down the stretch,” Barnes said of the Hornets.\n\n\r\n              Barnes said the Raptors need to start faster.\n\n\r\n              “We have to come and play with some urgency from the beginning and lock in mentally,” Barnes said. “Create stops and let that lead us to transition on the offensive end.”\n\n\r\n              The Hornets came into the game having made 43.9% of their 3-pointers in the previous three games and stayed hot in the first half, making 8 of 13 from beyond the arc to build a 66-54 halftime lead. \n\n\r\n              “I think the last five or six games our shot profile has gotten a lot better,\" Hornets coach Steve Clifford said. \"Early in the year, we were scoring a ton in the paint, but we weren’t making many 3s nor were we shooting that many. Now we’re getting a better balance.\"\n\n\r\n              Charlotte finished 13 of 25 from beyond the arc.\n\n\r\n              Toronto's Otto Porter Jr. left the game in the first half with a left foot contusion.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At New York on Monday night.\n\n\r\n              Hornets: Host Miami on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995444.465843
}