{
  "game_id": "0022000543",
  "espn_id": "401267703",
  "date": "Mar 03, 2021",
  "matchup": "CLE vs. IND",
  "headline": "McConnell sets steals mark, Pacers rally past Cavs 114-111",
  "body": "CLEVELAND -- — T.J. McConnell set an NBA record with nine steals in the first half and posted his second career triple-double with 16 points, 13 assists and a franchise-best 10 steals, leading the Indiana Pacers to a 114-111 victory over the Cleveland Cavaliers on Wednesday night.\n\n\r\n                    McConnell also went 8 of 8 from the field in 36 minutes off the bench as Indiana rallied from a 19-point deficit in the third quarter to end its four-game losing streak. Malcolm Brogdon scored 29 points and Domantas Sabonis had 18 points for the Pacers.\n\n\r\n                    “That’s as good of an all-around game from T.J. as you’re going to see in the NBA with the multiple ways he affected it,” Brogdon said. “He’s the ultimate teammate, as well, so we were all very happy for him.”\n\n\r\n                    The NBA record of 11 steals in a game is shared by New Jersey’s Kendall Gill on April 3, 1999, against Miami, and San Antonio’s Larry Kenon on Dec. 26, 1976, at Kansas City.\n\n\r\n                    McConnell’s previous career best was six steals on two occasions, the last on Feb. 12, 2018, against New York, when he had his first triple-double with 10 points, 10 rebounds and 11 assists. The sixth-year pro leads the league in steals with 2.0 per game.\n\n\r\n                    “The guys showered me with water after the game, but I don’t remember much about it because it was so cold,” McConnell said, laughing. “It was not enjoyable, but it was enjoyable at the same time, if that makes any sense.”\n\n\r\n                    Collin Sexton had 32 points, 10 assists and three steals, and Jarrett Allen had 17 points and 11 rebounds for the Cavaliers, who committed 26 turnovers and had their four-game winning streak snapped. They held an 81-62 lead midway through the third.\n\n\r\n                    Indiana went up for good at 108-106 on a 3-pointer by Justin Holiday with 1:18 left. After a Dylan Windler layup pulled Cleveland within 112-111, Brogdon made two free throws with one second left and the Cavaliers were unable to get off a potential game-tying shot.\n\n\r\n                    “This was very, very big for us and a really impressive game by T.J.,” Indiana coach Nate Bjorkgren said. “You’re always going to get the effort from him at both ends. He’s got that look in his eye every night.”\n\n\r\n                    Indiana stole the ball on six straight Cleveland possessions in the first period -- five by McConnell -- and rattled off 11 consecutive points. The Pacers scored 35 points off turnovers, more than offsetting their first half total of five rebounds.\n\n\r\n                    “McConnell earned it, he earned it tonight,” Cavaliers coach J.B. Bickerstaff said. “He’s a pest all the time. He’s super competitive all the time.”\n\n\r\n                    Cleveland point guard Darius Garland scored 16 points in 19 minutes before exiting with a strained left groin.\n\n\r\n                    Sexton had 14 points and 10 assists at halftime and became the first Cavaliers player to have double-digit assists in the opening half since LeBron James on Feb. 6, 2017, at Washington.\n\n\r\n                    HISTORY LESSON\n\n\r\n                    McConnell is the first NBA player to record a point-assist-steal triple-double since Atlanta’s Mookie Blaylock had 14 points, 11 assists and 10 steals against Philadelphia on April 14, 1998.\n\n\r\n                    “I was just playing with our defensive principles and trying to help run the team, I wasn’t going out of my way to make steals,” McConnell said. “We kind of dug ourselves a hole, so I’m happiest about the win.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: G Doug McDermott (broken tooth) visited the dentist Tuesday and was in the starting lineup. … G Jeremy Lamb (left knee soreness) returned to action after missing one game. … G Caris LeVert (left kidney carcinoma) and F T.J. Warren (left foot stress fracture) remain out, but LeVert could make his Indiana debut later this month after being acquired in the James Harden mega-trade.\n\n\r\n                    Cavaliers: F Dean Wade made his fifth consecutive start and scored a career-high 17 points with five 3-pointers. “Dean is a real likeable dude, to be honest with you, and that’s why the other guys are so happy about his success,” Bickerstaff said. … F Taurean Prince (left ankle soreness), who had been limited to one game and eight minutes since Feb. 14, was Cleveland’s fourth player off the bench.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host Denver on Thursday. Following the All-Star break, Indiana will go on the road for three games beginning March 12 at the Lakers.\n\n\r\n                    Cavaliers: Visit New Orleans on March 12. Cleveland won’t play another game at Rocket Mortgage FieldHouse until March 17 against the Celtics.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997878.7387168
}