{
  "game_id": "401810152",
  "espn_id": "401810152",
  "date": "Nov 29, 2025",
  "matchup": "MIL vs BKN",
  "headline": "Antetokounmpo scores 29, surpasses 21,000 career points in Bucks' 116-99 win over Nets",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 29 points and topped the 21,000-point mark for his career on Saturday night as the Milwaukee Bucks snapped a seven-game losing streak with a 116-99 victory over the short-handed Brooklyn Nets.\n\n\r\n              Antetokounmpo, in his second game back after missing four due to a groin strain, became the 42nd player, and sixth-youngest, in NBA history to reach 21,000 career points when he hit a 3-pointer midway through the third quarter.\n\n\r\n              Antetokounmpo shot 12 for 15 in 19 minutes and had eight rebounds.\n\n\r\n              Bucks guard Kevin Porter Jr. scored 13 points in his first game back since spraining an ankle in the season opener. Porter then injured his right meniscus working his way back and underwent surgery in early November. A.J. Green added 15 points and Bobby Portis Jr. 13 for Milwaukee.\n\n\r\n              Rookie Danny Wolf, playing in his fifth game, had a career-high 22 points for the Nets. Wolf shot 8 for 16, including 5 for 9 from beyond the arc. Jalen Wilson added 13 points.\n\n\r\n              The Bucks took control with a 39-24 scoring advantage in the second quarter and held a 71-53 lead at the half. The margin ballooned to 92-60 with just over five minutes left in the third quarter.\n\n\r\n              The Nets were without leading scorer Michael Cooper Jr. (24.3 points per game), who missed his second consecutive game due to lower back tightness. Starting guard Egor Demin was sidelined with injury management for a left plantar fascia tear.\n\n\r\n              Brooklyn already was without guard Cam Thomas (21.4 points), who has been sidelined since early November due to a left hamstring strain.\n\n\r\n              Antetokounmpo returned to the lineup Friday and scored 30 points in 118-109 loss to the New York Knicks that eliminated the Bucks from the NBA Cup.\n\n\r\n              Up next\r\n              Nets: Host the Charlotte Hornets on Monday.\n\n\r\n              Bucks: Visit the Washington Wizards on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042717.4353778
}