{
  "game_id": "0022400238",
  "espn_id": "401704804",
  "date": "Nov 17, 2024",
  "matchup": "MEM vs. DEN",
  "headline": "Grizzlies beat short-handed Nuggets 105-90 in opener of a 2-game set in Memphis",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson scored 20 points, and the Memphis Grizzlies built a 24-point lead in the fourth quarter in a 105-90 victory over the short-handed Denver Nuggets on Sunday in the opener of a two-game set.\n\n\r\n              The teams will meet again Tuesday night in Memphis in an NBA Cup game.\n\n\r\n              Nuggets star center Nikola Jokic missed the game for personal reasons, while forward Aaron Gordon is recovering from a strained right calf. Denver has lost two straight. Coach Michael Malone returned after missing the last game to attend his daughter's high school volleyball playoff match.\n\n\r\n              Rookie Jaylen Wells added 15 points to help Memphis win its fourth straight home game. Desmond Bane had 11 points, 11 rebounds and seven assists. \n\n\r\n              Julian Strawther led Denver with 19 points. Christian Braun and Jamal Murray scored 13 points each, going a combined 11 of 26 from the field and 1 of 8 on 3s. \n\n\r\n              Takeaways\r\n              Nuggets: Denver missed the all-around play of Jokic, and poor shooting made for a long evening. Murray and his teammates couldn't make up the difference of the Denver center's almost 30 points and 13.7 rebounds.\n\n\r\n               Grizzlies: The fast pace that Memphis plays now led to 20 fast-break points, and had Denver scrambling back on defense.\n\n\r\n              Key moment\r\n              Midway though the second quarter, Memphis went on 14-1 run that turned a slim lead into a double-digit advantage, part of Memphis outscoring Denver 27-18 in the period. Memphis then opened the second half with 10 straight points.\n\n\r\n              Key stat\r\n              Memphis, which struggle from outside the arc in its previous game against Golden State, made nine 3-points in the first half to build a double-digit lead. The Grizzlies would finish the night 13 of 39 from 3-point range.\n\n\r\n              Up next\r\n              The two teams meet again Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997753.6628108
}