{
  "game_id": "0022200362",
  "espn_id": "401468517",
  "date": "Dec 06, 2022",
  "matchup": "DEN vs. DAL",
  "headline": "Finney-Smith's late 3 helps Mavs to 116-115 win over Nuggets",
  "body": "DENVER -- — Dorian Finney-Smith had someone in his ear after missing a late 3-pointer.\n\n\r\n              It was Luka Doncic and his message was straightforward: Shoot it again if the opportunity arises.\n\n\r\n              He followed Doncic's directions. He wouldn't miss. \n\n\r\n              Finney-Smith hit a go-ahead 3-pointer with 17.3 seconds remaining and the Dallas Mavericks rallied after squandering a late lead to beat the Denver Nuggets 116-115 on Tuesday night.\n\n\r\n              “Him just giving me confidence, that means a lot,” Finney-Smith said. “I’m just happy we got the win.”\n\n\r\n              Not that it would be easy.\n\n\r\n              Nikola Jokic had a chance to tie the game with 12 seconds remaining, but missed the first of two free throws. Spencer Dinwiddie hit both free throws to help seal the win for the Mavericks.\n\n\r\n              Tim Hardaway Jr. scored a season-high 29 points and Doncic recorded his 52nd career triple-double with 22 points, 12 assists and 10 rebounds. \n\n\r\n              The Mavericks hardly looked weary as they played the second game of a back-to-back. They beat the Western Conference-leading Phoenix Suns the night before.\n\n\r\n              “A lot of great things happened,” Mavericks coach Jason Kidd said. “It was a great game.” \n\n\r\n              Aaron Gordon had 27 points, while Jokic added 19 points, eight assists and eight rebounds for the Nuggets, who dropped their third straight game on a night when they committed 17 turnovers.\n\n\r\n              “There are no moral victories,” Nuggets coach Michael Malone said. “I feel the guys played hard, we competed and gave ourselves a chance.”\n\n\r\n              Dallas appeared to have the game well in hand after taking a 111-101 lead with just over 4 minutes remaining. But the Nuggets went on an 11-0 run and jumped in front on Bruce Brown's 3-pointer. \n\n\r\n              All it did was set the stage for Finney-Smith, who finished with 19 points. \n\n\r\n              The Mavericks finished 27 of 31 from the free throw line. Hardaway missed both attempts with 4.2 seconds remaining, setting up a desperation heave from Jamal Murray at the buzzer that missed the mark.\n\n\r\n              “Would love to have had a timeout at the end of the game so we could, make-or-miss on those Hardaway free throws, could've advanced the ball and get a better, quality shot,\" Malone said. \"That’s on me. You can’t beat yourself.\n\n\r\n              “We know that they are an offensive firepower, a team that’s loaded. They have shooting everywhere.” \n\n\r\n              Nuggets guard Bones Hyland had a big bounce-back performance with 20 points after being benched last game for the second half. Malone said he chatted with Hyland and emphasized how big of a role he plays on the second unit. \n\n\r\n              “They call my name and I’m going to go out there and just do what I do,\" Hyland said. “Try to put the team in the best position.”\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: The Mavericks are 2/3 in the second game of a back-to-back. ... Christian Wood had 14 points.\n\n\r\n              Nuggets: F Michael Porter Jr. (heel) missed a seventh straight game. ... F Jeff Green returned after missing seven games with a knee injury. He had seven points.\n\n\r\n              DISPERSING MINUTES\n\n\r\n              Kidd was asked about social media posts and fans who wonder why younger players such as Jaden Hardy don't receive more minutes. \n\n\r\n              Simple answer: not enough to go around.\n\n\r\n              “Maybe we should bring Luka up, and ask, does he want to play less? Or Spencer?” Kidd explained. \"You just have to be patient. I know society isn’t patient or Twitter isn’t patient, because they want it now — fantasy leagues and all that. My job is to put those guys in a position to be successful. Right now, we’ve got a good thing going. ... Twitter isn’t the coach or the player.”\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Milwaukee on Friday night.\n\n\r\n              Nuggets: At Portland on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994720.974634
}