{
  "game_id": "0021600479",
  "espn_id": "400899921",
  "date": "Dec 28, 2016",
  "matchup": "MIL @ DET",
  "headline": "Parker scores 31 points as Bucks beat Pistons 119-94",
  "body": "AUBURN HILLS, Mich. --  Barring an unlikely playoff matchup, the Milwaukee Bucks played their final game at the Palace of Auburn Hills on Wednesday night.\n\nThey will be taking away a lot of good memories.\n\nJabari Parker scored 31 points and Giannis Antetokuompo had 23 points and eight assists as the Bucks beat the Detroit Pistons 119-94. Milwaukee scored 58 points in the paint, hit 50 percent of its 3-pointers and had 36 assists on 48 field goals.\n\n\"We were moving the ball really well, and J.P. was getting to the rack,\" Antetokuompo said. \"We both had a lot of open looks and our teammates got us the ball. That's when we're going to win.\"\n\nGreg Monroe added 14 points, six assists and five rebounds against his former team to help the Bucks win for the second time in five games. Tony Snell and Matthew Dellavedova each scored 11.\n\n\"Any time you have two guys getting it going like Jabari and Giannis, it makes the rest of us better,\" Monroe said. \"They are doing their jobs, so everyone has to come in and feed off them.\"\n\nTobias Harris had 23 points and 12 rebounds off the bench for Detroit, which has dropped six of seven. The Pistons ended a five-game losing streak Monday with a win over the Cleveland Cavaliers, who rested LeBron James, but weren't competitive against visiting Milwaukee.\n\n\"They got everything they wanted,\" Pistons point guard Reggie Jackson said. \"I don't think we executed our game plan. They beat us across the board and definitely brought more energy.\"\n\nPistons coach Stan Van Gundy is usually willing to call out his players after poor performances, but he refused to do that in a brief postgame press conference.\n\n\"This is entirely on me,\" he said. \"We have had too many games where we are getting buried. I'm embarrassed right now, and I have a lot of thinking to do to find a way to get this fixed.\n\n\"This is brutal.\"\n\nThe Bucks (15-15) are two games ahead of the Pistons (15-19) in the Eastern Conference playoff race.\n\nMilwaukee led by as many as 11 in the first half, thanks to seven 3-pointers, but Jackson's emphatic dunk at the end of the second quarter pulled Detroit to 62-54. The Bucks outshot the Pistons 54.5 percent to 50 percent, but Milwaukee had four more 3s and six more free throws.\n\nThe Bucks used their outside threat to get the ball to the rim in the third quarter. They scored 14 points in the paint and added enough jumpers to push the lead to 19.\n\n\"I thought we did a good job of coming out in the second half and playing even better,\" Monroe said. \"The ball kept moving, we were making the right plays and helping on defense. That gets us out into transition and makes us even better.\"\n\nThe margin was 90-75 going into the fourth, and the Pistons never got enough stops to threaten a rally.\n\nTIP-INS\n\nBucks: Milwaukee came into the game ranked 28th in the NBA in 3-pointers, after finishing 30th a season ago. The Bucks hit seven of 11 attempts in the first half. ... Monroe was booed when he entered the game. He started his career with the Pistons before going to Milwaukee as a free agent in the summer of 2015.\n\nPistons: Van Gundy went to a little-used combination to try to change things up in the second quarter, playing Jackson and fellow point guard Ish Smith together. They came into the game having played only three minutes together all season. ... Andre Drummond had 16 points and nine rebounds. Jackson scored 14, but Smith had only two points on 1-of-5 shooting in 20:32.\n\nSTILL STRUGGLING\n\nWhile Drummond has improved his free throw shooting from last season's NBA record-low 35.5 percent, he's at just 44.2 percent after going 3 for 13 in the last two games. Only he, DeAndre Jordan and Ben Wallace have had full seasons that bad in the last 40 years.\n\nON TARGET\n\nMilwaukee shot at least 60 percent from the floor in three of the four quarters, and scored 31 points while hitting 45.5 percent in the second. \"Let's make one thing clear,\" Van Gundy said. \"They played a very, very good basketball game.\"\n\nDEFENSIVE COLLAPSE\n\nThe Pistons allowed 1.00 points per possession through their first 27 games, one of the best marks in the NBA. During their 1-5 stretch, though, that has jumped to 1.15 points -- about 14 more per game given their usual playing pace.\n\nRELISHING HIS ROLE\n\nThe Pistons are 1-2 since Van Gundy moved Jon Leuer into the starting lineup ahead of Harris, but Harris has done a nice job in his new role. Including his 23 points against the Bucks, he's scored at least 21 in each game as a reserve.\n\nUP NEXT\n\nBucks: At the Minnesota Timberwolves on Friday.\n\nPistons: At the Atlanta Hawks on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995196.451732
}