{
  "game_id": "0021800668",
  "espn_id": "401071344",
  "date": "Jan 17, 2019",
  "matchup": "TOR vs. PHX",
  "headline": "Siakam scores winning basket, Raptors beat Suns 111-109",
  "body": "TORONTO --  The Phoenix Suns figured Toronto guard Kyle Lowry was going to take the decisive shot. Pascal Siakam and the Raptors had other plans.\n\nSiakam scored the winning basket just before time expired, leading the Raptors to a 111-109 victory over the Suns on Thursday night.\n\nSerge Ibaka put Toronto up 109-107 on a hook shot with 47 seconds left, but Mikal Bridges tied it with a pair of free throws with 13 seconds remaining.\n\nToronto gave the ball to Siakam, who let the clock wind down before driving for a left-handed layup that bounced off the backboard and fell through the rim as the buzzer sounded. The basket was confirmed following a video review.\n\n\"I always feel I can get to the rim,\" Siakam said. \"I just felt like I had an advantage, just long strides and try to get there. The big came up to help, but it was kind of too late.\"\n\nSiakam had 10 points and 12 rebounds as Toronto extended its home winning streak to eight.\n\n\"I just thought he could beat somebody off the dribble,\" Raptors coach Nick Nurse said. \"He made a great move and he finished it off.\"\n\nSiakam's winner wasn't quite what Phoenix was expecting.\n\n\"We were surprised,\" Suns coach Igor Kokoskov said. \"Personally, I was thinking Lowry was going to take the last shot. Siakam made a big play for his team.\"\n\nIbaka scored 22 points and Lowry had 16 points and nine rebounds for the Raptors, who have won six of seven overall.\n\nDevin Booker scored 30 points, Deandre Ayton had 15 points and 17 rebounds, and Kelly Oubre Jr. scored 18 for the Suns.\n\nFred VanVleet had 15 points and C.J. Miles returned after missing three of the previous four games because of a sore right hip to score 13.\n\nKawhi Leonard (rest) sat as the Raptors played the second game of a back-to-back.\n\nLowry was originally expected to rest, but told Nurse he wanted to play as he works his way back into shape after missing time with a sore back.\n\nPhoenix was up 78-77 to begin the fourth, but Toronto took the lead at 88-87 when the Suns' Josh Jackson fouled Toronto's Chris Boucher on a dunk with 7:50 to go. Jackson argued the call and was ejected after picking up his second technical foul. After video review, the foul on Boucher was ruled flagrant. Toronto made both of its foul shots and got the ball back, with Lowry hitting a 3 to put the Raptors up 95-87.\n\n\"I felt it was my job to step up and say something for my teammates,\" Jackson said. \"I felt like somebody should have got a technical foul because that was just ridiculous.\"\n\nKokoskov said the Suns need to do a better job of maintaining their composure in key moments.\n\n\"To beat a team like Toronto on their court, you almost have to play a perfect game, and we didn't,\" he said.\n\nPhoenix trailed 57-49 at halftime.\n\nTIP-INS\n\nSuns: Jackson scored seven points in 19 minutes before being ejected. ... G Jamal Crawford (left knee) missed his second straight game. ... Phoenix F Quincy Acy was a second round pick by Toronto in 2012. ... The Suns are 4-18 on the road. ... Ayton's career-high in rebounds is 18.\n\nRaptors: F OG Anunoby missed his second straight game for personal reasons. ... Toronto is 12-5 against Western Conference opponents. ... G Patrick McCaw made his Toronto debut, going scoreless in six minutes. He signed with the Raptors last Thursday.\n\nMILESTONE MOMENT\n\nLowry finished with eight assists, giving him 5,002 for his career. He's one of 10 active players to reach the mark.\n\n\"He really commands the offense and knows where to get it,\" Nurse said.\n\nLowry joins Jose Calderon, Raymond Felton, LeBron James, Chris Paul, Tony Parker, Rajon Rondo, Dwyane Wade, John Wall and Russell Westbrook.\n\n\"It's a great stepping stone for my individual, personal career,\" Lowry said.\n\nSETTING SUNS\n\nToronto swept the season series against Phoenix in consecutive years for the first time in franchise history.\n\nBACK-TO-BACKS\n\nThe Raptors are an NBA-best 8-1 in the second game of back-to-backs this season. This was their ninth of 12 such sets.\n\nUP NEXT\n\nSuns: Visit Charlotte on Saturday night.\n\nRaptors: Host Memphis on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994108.9531782
}