{
  "game_id": "0022200497",
  "espn_id": "401468652",
  "date": "Dec 25, 2022",
  "matchup": "DEN vs. PHX",
  "headline": "Jokic, Nuggets outlast Suns 128-125 in OT; Booker sidelined",
  "body": "DENVER -- — Nikola Jokic had another monster triple-double, Aaron Gordon threw down a pivotal dunk that stood up after a review in overtime and the Denver Nuggets rallied for a 128-125 victory over the Phoenix Suns on Sunday night.\n\n\r\n              Jokic had 41 points, 15 rebounds and 15 assists for his 83rd career triple-double. The two-time reigning NBA MVP had a 40-point, 27-rebound, 10-assist outing a week ago.\n\n\r\n              “Sick,” Gordon said of the statistics Jokic is posting these days. “Those are video game numbers.”\n\n\r\n              It was the fourth 40-point, 15-rebound, 15-assist game in NBA history, according to ESPN Stats & Info. He joined Oscar Robertson (1961, 1962) and James Harden (2016).\n\n\r\n              Phoenix star Devin Booker lasted only 4:20 in his return from a groin injury, scoring two points after getting 58 against New Orleans in his previous start.\n\n\r\n              Jamal Murray tied it in regulation for Denver on a dunk with 10.7 seconds left. But it was Gordon's OT slam that helped propel the Nuggets to the victory. At first, he was called for an offensive foul, but a review determined that Landry Shamet was moving, awarding Gordon the basket and a free throw.\n\n\r\n              Best in-game dunk he's ever had?\n\n\r\n              “Yeah,” Gordon said. “Because of the time and score.”\n\n\r\n              Jokic had a take on the dunk, too, because he was close to Gordon on the play.\n\n\r\n              “I was open,” Jokic cracked.\n\n\r\n              It certainly raised the noise level in the building.\n\n\r\n              “Loudest I’ve heard this place in a long time for a nonplayoff game,” Nuggets coach Michael Malone said. \n\n\r\n              Phoenix had a chance to tie it in the closing seconds of OT, only to throw away a pass.\n\n\r\n              The Suns, who led by 12 in the third quarter, set up for a winning play in regulation but Mikal Bridges was called for an offensive foul after accidentally running into a Denver player. Bridges atoned by blocking Murray's shot just before the buzzer.\n\n\r\n              The Nuggets improved to 2-6 in games held on Christmas. The other win was in 1994 against Seattle.\n\n\r\n              Shamet came off the bench to score 31 points — matching his career high — on a night the Suns lost Booker again to the groin injury. Booker was just returning to the court after missing the last three games because of groin soreness.\n\n\r\n              “I didn't even see it,\" Suns coach Monty Williams. “They came to me when I was walking the sidelines and they said, ‘Man, we’ve got to get Book.' I looked up and he had that look on his face and I knew something had happened.” \n\n\r\n              Deandre Ayton added 22 points and 16 rebounds as Phoenix had six players in double figures. Chris Paul had 17 points and 16 assists, but missed five free throws. \n\n\r\n              The Suns have dropped eight of 11.\n\n\r\n              \"We’ll be all right,” Shamet said. “The important thing is we’re doing the right things.”\n\n\r\n              Gordon finished with 28 points and Murray 26.\n\n\r\n              The Nuggets led by 15 points early in the game. Shamet scored 15 points in the second quarter to help Phoenix work its way back into the game. \n\n\r\n              Gordon wound up 11 of 18 from the field and Jokic 16 of 25. Both extended their streaks to 23 games of shooting .500 or better from the field, which broke the franchise record set by Nene in 2010-11. \n\n\r\n              TIP-INS\n\n\r\n              Suns: Phoenix guard Cameron Payne (sprained right foot) and forward Cam Johnson (torn meniscus) went through a stepped-up workout Christmas morning. Payne hasn’t played since Dec. 13 and Johnson since Nov. 4. \n\n\r\n              Nuggets: Forward Jeff Green fractured his hand against Portland on Friday. The team said he will be reevaluated in four weeks. ... Forward Michael Porter Jr. had seven points on 3 of 11 shooting in his second game back from a heel injury.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Memphis on Tuesday night.\n\n\r\n              Nuggets: At Sacramento on Tuesday and Wednesday nights.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994714.9259899
}