{
  "game_id": "0021800212",
  "espn_id": "401070893",
  "date": "Nov 14, 2018",
  "matchup": "LAL vs. POR",
  "headline": "LeBron gets 44, passes Wilt in LA's 126-117 win over Blazers",
  "body": "LOS ANGELES --  A floating jumper, a foul and a free throw in the fourth quarter of a tight game.\n\nWith a gorgeous three-point play , the King jumped over the Big Dipper.\n\nLeBron James' inimitable presence has already been felt in his first few weeks in Hollywood. His most impressive game yet for the Lakers included a bit of history when he passed Wilt Chamberlain on the NBA's career scoring list.\n\nThe superstar with no shortage of historic achievements was more excited about leading his surging new team to yet another win.\n\nJames had a season-high 44 points, 10 rebounds and nine assists, roaring past Chamberlain for fifth place on the scoring chart and leading the Lakers to a 126-117 victory over the Portland Trail Blazers on Wednesday night.\n\nJames scored 28 points in the second half and vaulted past Chamberlain's 31,419 points on that three-point play with 3:55 to go. LeBron finished a memorable night with 31,425 points, and fell just short of his 75th triple-double during his most impressive performance since joining the Lakers.\n\nAfterward, James praised Chamberlain as \"One of the most dominant forces we ever had in our game, along with Shaq. One of the greatest Lakers to ever play the game. A 100-point scorer. One of the greatest scorer-rebounders to ever play this game.\"\n\nJames already has moved from seventh to fifth on the career scoring list during his first 14 games with Los Angeles, passing Dirk Nowitzki and Chamberlain. Five of the top six scorers in NBA history have suited up for the Lakers -- including Chamberlain, whose No. 13 hangs high above the Staples Center court.\n\nJames hit his first five 3-pointers and finished 13 of 19 from the field, reaching his latest milestone during a dominant performance that had chants of \"M-V-P!\" raining down from the Staples Center crowd.\n\nBut the kid from Akron will never let it get to his head.\n\nIn fact, he will donate his jersey and the game ball to his I Promise School back in Ohio.\n\n\"Anytime my name is mentioned with some of the greats to play this game, I always think back to my hometown, where I come from, how far I've come,\" James said.\n\nBefore the Lakers embark on a three-game trip that includes his return to Cleveland on Nov. 21, James showed his new home fans what they can expect in big moments -- as if any basketball fan with a pulse didn't already know. He scored 16 points in the third quarter and 12 in the fourth, never allowing Portland to make a final run during the Lakers' fourth consecutive win.\n\n\"We did a lot of nice things, but we did a lot of sloppy things tonight,\" coach Luke Walton said. \"A lot of soft defense.\"\n\nThere was bad news on a triumphant night, too: After the game, Walton revealed that Rajon Rondo broke his right hand, apparently while making a steal in the fourth quarter. The veteran point guard will be sidelined for at least a few weeks, and starter Lonzo Ball's so-far moderate workload is likely to increase.\n\n\"It's tough,\" James said. \"He's one of our captains, one of our leaders. I know he'll get right to it with his rehab, but it's next man up.\"\n\nDamian Lillard had 31 points, 11 assists and eight rebounds, and CJ McCollum scored 23 in the Trail Blazers' first road loss to the Lakers since Feb. 22, 2013, ending a nine-game streak at Staples. Portland has lost two straight to the Lakers after winning 16 in a row.\n\n\"LeBron, it was a dominant performance,\" Portland coach Terry Stotts said. \"(Scoring) 44 points on 19 shots, that doesn't happen too often. When he's hitting his 3s and putting his head down, he's tough to stop.\"\n\nJaVale McGee scored 20 points and Brandon Ingram added 17 in the Lakers' sixth win in seven games. After a slow start, Los Angeles (8-6) is already finding its groove in its first season with James and his fellow veterans joining a young core. Los Angeles is off to its best start since the 2011-12 season.\n\nTIP-INS\n\nTrail Blazers: Lillard played without restrictions after missing practice to rest his right knee. ... Portland's four-game winning streak ended, but the Blazers are still on top of the Northwest Division. ... Jusuf Nurkic had 21 points and 14 rebounds, and Al-Farouq Aminu scored 18 points.\n\nLakers: The 6-foot-5 Josh Hart blocked a dunk attempt by the 7-foot Nurkic in the first quarter. ... Michael Beasley didn't play, but the veteran was back in uniform after missing several recent games for undisclosed personal reasons. He hasn't played since Oct. 25.\n\nHEAVY HITS\n\nThe Blazers delivered two hard fouls against James in the fourth quarter, both requiring him to spend an extra moment recovering. McCollum floored James with a foul that was upgraded to a flagrant foul with 4:38 left, and then Nurkic appeared to use his two fists to make a crybaby gesture when talking to officials about it.\n\n\"LeBron carried them,\" Nurkic said. \"When he's making shots, outside shots, he's tough to handle.\"\n\nFAMILIAR FOES\n\nThe teams were meeting for the third time in four weeks already this season, a schedule quirk that didn't particularly please either coach. The Blazers spoiled LeBron's debut with the Lakers in a 128-119 win at Portland last month, but the Lakers replied by ending their 16-game skid in the rivalry by beating the Blazers 114-110 just 16 days later in the Moda Center. The clubs don't have their final meeting until the regular-season finale at Staples Center on April 9.\n\nUP NEXT\n\nTrail Blazers: At Minnesota on Friday night.\n\nLakers: At Orlando on Saturday night.\n\n---\n\nMore AP NBA: www.apnews.com/tag/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995033.821873
}