{
  "game_id": "0022000354",
  "espn_id": "401267514",
  "date": "Feb 06, 2021",
  "matchup": "BKN @ PHI",
  "headline": "Embiid, Simmons lead 76ers past short-handed Nets 124-108",
  "body": "PHILADELPHIA -- — Ben Simmons showed exactly why trading him away wouldn’t have been easy — even for James Harden.\n\n\r\n                    Simmons played a complete game on both ends of the court, finishing with 16 points, 12 rebounds, eight assists and three steals to help the Philadelphia 76ers to a 124-108 victory over the short-handed Brooklyn Nets on Saturday night.\n\n\r\n                    Joel Embiid scored 33 points and Tobias Harris added 21 points and 12 rebounds for the Eastern Conference-leading 76ers, who have won five of six.\n\n\r\n                    Harden had 26 points, 10 assists and eight rebounds for Brooklyn, which was without stars Kyrie Irving and Kevin Durant.\n\n\r\n                    Irving is day to day with a right finger sprain, and Durant is out for a week due to the NBA’s health and safety protocols.\n\n\r\n                    Simmons, reportedly an important piece of a potential Philadelphia-Houston trade that never materialized when Harden landed in Brooklyn last month in a blockbuster deal, played aggressively throughout.\n\n\r\n                    “I look forward to playing everybody, especially Brooklyn because they have such offensively gifted players,” Simmons said. “I want to play the best players in the league every night, so I look forward to the challenge.”\n\n\r\n                    Simmons’ potential departure for Harden was hotly debated by 76ers fans. Some who focus on the guard’s shooting shortcomings lobbied for the move while others pointed to his overall skillset, on full display Saturday, as a reason to hang onto the 24-year-old two-time All-Star.\n\n\r\n                    “I think you have to coach him and be around him to see his value,” Philadelphia coach Doc Rivers said. “He’s invaluable to a basketball team. Not only his defense and passing, but so many little things.”\n\n\r\n                    Simmons’ highlight was a steal and fast-break dunk over Tyler Johnson with 59 seconds left in the third quarter.\n\n\r\n                    Embiid continued his stellar play, surpassing 30 points for the eighth time in nine games.\n\n\r\n                    “He’s just been dominant,” Simmons said. “I haven’t seen anyone who can stop him.”\n\n\r\n                    The big man was questionable after landing awkwardly on his right knee in Thursday’s 121-105 loss to Portland but showed no ill effects. Afterward, he said he’s fine physically.\n\n\r\n                    The 76ers took control with a 14-0 run over 3:05 late in the third. Harden tied it at 79 with 5:15 left on a free throw after Danny Green was whistled for a technical foul, one of four in the game.\n\n\r\n                    Then, the Sixers took over.\n\n\r\n                    Harris started the spurt with a jumper before Green scored eight straight points, including a pair of 3-pointers from virtually the same spot in the left corner. Embiid’s two free throws with 2:10 left in the period finished the run, giving Philadelphia its largest lead to that point at 93-79. The Nets were 0 for 4 from the field with three turnovers during that stretch.\n\n\r\n                    “I thought the third-quarter run, both defensively and offensively, changed the game for sure,” Rivers said.\n\n\r\n                    Philadelphia ended the third ahead 102-86, and the Nets never threatened in the fourth.\n\n\r\n                    “I do think fatigue played a part,” coach Steve Nash said after Brooklyn played the second game of a back-to-back. “We asked a lot of our guys, a lot of James. These guys have played a lot of minutes. Without two starters, I think there was fatigue. I thought the guys competed and gave ourselves a chance.”\n\n\r\n                    Durant is expected to rejoin the team Friday, Nash said. In a strange scene Friday against Toronto, the Nets star wasn’t available to start, entered as a reserve for the first time in his 867-game career and then was pulled in the third quarter.\n\n\r\n                    Durant had three negative COVID-19 tests within a 24-hour period, but someone whom he interacted with on Friday afternoon had an inconclusive test, thus the reasoning for keeping Durant out at the start of the game. When that test eventually came back positive, the NBA took Durant off the court.\n\n\r\n                    That didn’t sit well with Durant, who Tweeted his displeasure, or his Nets teammates, who expressed confusion and frustration afterward over the way the situation was handled.\n\n\r\n                    COVID CHATTER\n\n\r\n                    Prior to the game, Nash discussed COVID-19 and NBA protocols in light of Durant’s situation. While acknowledging that this season has been a challenge, he is grateful to still be playing.\n\n\r\n                    “Is it perfect? No, but nothing is this year,” Nash said. “We have to do our best to navigate the pandemic. It’s tricky. That is what we all signed up for, to complete and execute this season. Get through it, and get through it as safely as we can.”\n\n\r\n                    SHOOTING SIDEWAYS\n\n\r\n                    Rivers said Saturday’s morning shootaround was longer than normal and had more of a “mini-practice” feel. With limited practices, the coach is running one shootaround per week more like a practice.\n\n\r\n                    Even the coach participated. Rivers had a successful 14-year career as an NBA point guard, but shot 32.8% from 3-point range.\n\n\r\n                    How’d he do?\n\n\r\n                    “Not very well,” Rivers said. “I haven’t changed at all.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Brooklyn won the first meeting, 122-109 on Jan. 7. … DeAndre Jordan and Harden were whistled for consecutive technical fouls seconds apart in the first quarter. They were upset that basket interference wasn’t called on Green’s follow layup. … Landry Shamet added 22 points for the Nets.\n\n\r\n                    76ers: Simmons received a technical late in the third for taunting. … Philadelphia wore its City Edition jerseys. … Seth Curry had 11 points and four assists. He was listed as questionable due to illness after being pulled from Thursday’s loss to Portland due to lack of energy.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: At the Detroit Pistons on Tuesday.\n\n\r\n                    76ers: At the Sacramento Kings on Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997506.3708658
}