{
  "game_id": "0022400952",
  "espn_id": "401705518",
  "date": "Mar 12, 2025",
  "matchup": "MIN @ DEN",
  "headline": "Anthony Edwards scores 29 points and Julius Randle adds 25 as Timberwolves rout Nuggets 115-95",
  "body": "DENVER -- — Anthony Edwards scored 29 points, Julius Randle added 25 and the Minnesota Timberwolves extended their winning streak to six games by routing the Denver Nuggets 115-95 on Wednesday night.\n\n\r\n              Rudy Gobert finished with 11 points and 10 rebounds for the Timberwolves, who improved to 3-0 against the Nuggets this season. The last game between these two Northwest Division foes is April 1 in Denver.\n\n\r\n              Donte DiVincenzo had 10 points as Minnesota's bench outscored Denver's reserves by a 26-14 margin.\n\n\r\n              Nikola Jokic led the Nuggets with 34 points and eight rebounds. He and the rest of Denver's starters were taken out with 5:05 remaining and Minnesota up 109-84.\n\n\r\n              Jokic had a nifty coast-to-coast, fast-break dunk in the first half. It was a rare highlight for the Nuggets. Jamal Murray was 0 for 7 with one point in the first half. He finished 4 of 15 for 12 points.\n\n\r\n              Takeaways\r\n              Timberwolves: Their stellar defense limited Denver to 20 assists, 18 fast-break points and 52 points in the paint. All were below the Nuggets' league-leading averages. \n\n\r\n              Nuggets: After scoring 140 points in Monday's win at Oklahoma City on 60.5% shooting, the Nuggets never found their shooting touch. They shot 40.4% in a game they never led.\n\n\r\n              Key moment\r\n              Denver coach Michael Malone tried just about everything to spark his team in the first half. He called timeouts, challenged a play and even got a technical. Minnesota led by 14 in the opening half. \n\n\r\n              K\r\n              ey stat\r\n              The six straight wins is Minnesota's longest streak of the season.\n\n\r\n              Up next\r\n              Both teams play Friday, with the Nuggets hosting the Los Angeles Lakers and the Timberwolves at home against Orlando.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998079.023977
}