{
  "game_id": "0022400630",
  "espn_id": "401705196",
  "date": "Jan 24, 2025",
  "matchup": "POR @ CHA",
  "headline": "Simons scores 27 points as Trail Blazers beat Hornets 102-97 for 4th straight victory",
  "body": "CHARLOTTE, N.C. -- — Anfernee Simons scored 17 of his 27 points in the second half, Jerami Grant added 22 points and the Portland Trail Blazers defeated the Charlotte Hornets 102-97 on Friday night for their fourth straight win.\n\n\r\n              Deni Avdija had 18 points and Dononvan Clingan added 13 rebounds as the Blazers outscored the Hornets 29-22 in the fourth quarter.\n\n\r\n              Nick Smith Jr. had 17 points and Josh Okogie added 16 points and 10 rebounds to lead the Hornets, who lacked scoring power without LaMelo Ball, Miles Bridges and Brandon Miller.\n\n\r\n              The Hornets led 75-73 entering the fourth quarter, but the Blazers quickly took control. After Portland corralled two offensive rebounds on the same possession, Simons buried a 3 to give the Blazers the lead for good with 7 1/2 minutes to play, sparking a 7-0 run. The Blazers never trailed again.\n\n\r\n              The Hornets shot 7 of 22 in the fourth quarter.\n\n\r\n              Takeaways\r\n              Trail Blazers: It was another solid defensive effort for the Trail Blazers on the second night of a back-to-back. Portland shut down Orlando with a 101-79 road victory on Thursday, then carried that momentum against the Hornets, limiting Charlotte to 41% shooting.\n\n\r\n              Hornets: With Miller out for the season following wrist surgery, the Hornets are going to need some others to step up their 3-point shooting. They didn't get much of that against the Blazers and the offense had no one to turn to in the fourth quarter. \n\n\r\n              Key moment\r\n              After the Hornets cut the lead to five, Grant knocked down a baseline jumper with just under one minute to put the game away.\n\n\r\n              Key stat\r\n              The Blazers were 27 of 39 from the foul line; the Hornets were 24 of 28.\n\n\r\n              Up next\r\n              The Blazers return home to host the Thunder on Sunday night. The Hornets host the Pelicans on Saturday night as part of a nine-game homestand. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998177.6703
}