{
  "game_id": "0022300893",
  "espn_id": "401585521",
  "date": "Mar 05, 2024",
  "matchup": "PHX @ DEN",
  "headline": "Durant erupts in OT, leads Suns to 117-107 win over Nuggets after blowing 22-point lead",
  "body": "DENVER -- — Kevin Durant was off the mark with his jumper — until it mattered most.\n\n\r\n              Durant scored 35 points, including eight in overtime, and the short-handed Phoenix Suns rebounded after blowing a 22-point lead in the second half to beat the Denver Nuggets 117-107 on Tuesday night.\n\n\r\n              After scoring just 12 points in the fourth quarter, the Suns erupted for 15 in OT, led by Durant and Bradley Beal, who had five of his 16 in the extra period.\n\n\r\n              Durant's biggest shot of the night was a game-tying, step-back 3-pointer with 26.6 seconds remaining. He was 3 of his previous 17 from the floor leading into that shot. But there was no doubt he was taking it.\n\n\r\n              “I knew coming across half-court, ‘This is do-or-die right here, I've got make this shot or it might be game,’” said Durant, who was 14 of 34 from the floor. \"My fundamentals were right on that one.\n\n\r\n              \"It felt good leaving my hands. ... I just love hearing the crowd go silent. That’s always a good feeling on the road.”\n\n\r\n              Grayson Allen hit eight 3-pointers and scored 28 points to help the Suns snap a two-game slide.\n\n\r\n              Trailing 77-55 early in the third, Denver went on a furious comeback to turn what was looking like a rout into a thriller. Kentavious Caldwell-Pope hit a go-ahead 3-pointer with 1:30 remaining, followed by a Jamal Murray basket to make it 102-99. \n\n\r\n              Durant tied it and set the stage for Nikola Jokic, whose last-second floater missed to send the game into overtime. \n\n\r\n              “I’ve seen (Jokic) make that 95 out of 100 times,” Murray said. “We all thought it was going in.”\n\n\r\n              Murray finished with 28 points while Jokic added 25 points, 16 rebounds and five assists as the Nuggets had their six-game winning streak halted. \n\n\r\n              “Such a winnable game. That may be one of the worst losses we’ve had,” Murray said. “It’s tough. It’s just tough.”\n\n\r\n              Allen hit eight straight 3-pointers, but missed his final four once the Nuggets put Caldwell-Pope on him as a primary defender.\n\n\r\n              “They all felt good leaving my hands,\" Allen said. \"Saw a few go in early and got more aggressive with the ones I was taking and they kept going in.”\n\n\r\n              Jusuf Nurkic fouled out with 2:28 remaining as he tried to contain Jokic. Nurkic had 12 rebounds a game after grabbing a franchise-record 31 boards against Oklahoma City. \n\n\r\n              The Suns were missing Devin Booker (sprained ankle), Nassir Little (knee), Damion Lee (meniscus surgery) and Josh Okogie (abdominal strain). \n\n\r\n              It was a big win for the Suns, who are in the sixth spot and teetering close to being in the play-in tournament.\n\n\r\n              “You look at the totality of the season, obviously the end result is always important, playing in the playoffs, trying to win a championship, those are important,” Durant said. \"But you celebrate little moments.”\n\n\r\n              Trailing 43-36 in the second quarter, the Suns went on a 29-5 run to open a comfortable cushion before halftime. The lead ballooned to 22 points early in the third before Denver's surge. \n\n\r\n              \"That was the message at halftime — we’re not playing hard enough,” Nuggets coach Michael Malone said, whose team was outscored 37-18 in the second quarter. “I think we had a couple of guys that kind of showed up tonight in chill mode.”\n\n\r\n              Jokic added to his resume of making buzzer-beating heaves when he swished a turnaround, 26-footer to end the first quarter. His shot — nicknamed the “Sombor Shuffle” — energized the crowd and capped a quarter where the teams were a combined 11 of 17 from 3-point range.\n\n\r\n              This was the second matchup between the Nuggets and Suns this season, but nothing like Denver's 119-111 win on Dec. 1 in Phoenix. In that contest, the Suns were without Booker, Damion Lee and Beal, while the Nuggets were missing Murray.\n\n\r\n              “This is one of those where tomorrow we all feel better. Tomorrow we have better clarity and a lot more positive energy,\" said Murray, whose team shot 42.7% from the field. “But today it’s tough. It wasn’t just one person who didn’t shoot well, it was damn near everybody.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Toronto on Thursday night.\n\n\r\n              Nuggets: Host Boston on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996645.1866539
}