{
  "game_id": "0021601027",
  "espn_id": "400900422",
  "date": "Mar 17, 2017",
  "matchup": "MIL @ LAL",
  "headline": "Bucks hold off Lakers 107-103 after 3 ejections for shoving",
  "body": "LOS ANGELES --  Malcolm Brogdon delivered a hard foul to Nick Young, who shoved back. Greg Monroe then staggered Young with another shove, which got D'Angelo Russell and Brandon Ingram involved -- along with a Milwaukee Bucks security guard.\n\nThe third-quarter fracas ended with three ejections, and it left Los Angeles coach Luke Walton furious.\n\nThe drama also motivated the Lakers to make a surge, but the Bucks held on for a bumpy victory in their increasingly smooth playoff push.\n\nKhris Middleton scored 14 of his season-high 30 points in the fourth quarter and the Bucks beat the Lakers 107-103 on Friday night for their eighth victory in nine games.\n\nMonroe, Russell and Young were ejected after the scuffle with 36 seconds left in the third quarter. While Walton praised his players' response and saw problems with nearly every decision made by the officials in the aftermath, Milwaukee coach Jason Kidd also was pleased by his team's resilience.\n\n\"After things like that, there's always a momentum swing, and it swung their way,\" Kidd said. \"The guys stayed the course. They kept playing, and we found a way to keep the lead and finish the game.\"\n\nJordan Clarkson scored 21 points for the Lakers, who appeared to be inspired by the brouhaha. They trimmed Milwaukee's lead from 18 points to 103-100 with 7.9 seconds left before the Bucks hit four late free throws to seal it.\n\n\"I love the way the young guys stepped up for me,\" Young said. \"As a team, the whole coaching staff, players, we've got each other's backs. That's unity. That's a team.\"\n\nWALTON'S QUESTIONS\n\nWalton didn't understand the officials' decision to punish Russell with the same penalty received by Monroe, who delivered a fierce shove to Young's neck area.\n\n\"D'Angelo only responded after Monroe had grabbed Nick by the neck and thrown him,\" Walton said. \"So if D'Angelo didn't push him, I would have been (mad) at D'Angelo. He did the right thing. So for the NBA to say that the two of them did the same thing and just canceled each other out is absolute crap to me.\"\n\nWalton also was infuriated that the officials did nothing about a member of the Bucks' security team who came onto the court and shoved Ingram during the exchange.\n\n\"If there's nothing wrong with that, then I have no problem finding some people to hire on our staff (for the) next time we get in a skirmish,\" Walton said. \"The refs don't say anything about that, and he puts his hands on one of our players. He works for them. He can touch (Milwaukee's) players all he wants. Don't touch my damn players. Because if that's OK, I'm sure we can find a couple of people here in LA that want that job working for the Lakers, too.\"\n\nFAST FINISH\n\nYoung scored 16 points and Russell had 14 before their ejections, but the Bucks appeared to be cruising to an easy win before the prolonged scuffle. They had opened up an 18-point lead while Antetokounmpo scored 12 points in the first 6:15 of the third.\n\nAntetokounmpo fouled out with 7.9 seconds left, but Julius Randle made only one ensuing free throw. Clarkson added a last-second 3-pointer, but Milwaukee hung on.\n\nRISING BUCKS\n\nGiannis Antetokounmpo scored 26 points before fouling out for the Bucks (34-34), who are in seventh place in the Eastern Conference standings with a good shot at their second winning season in 14 years.\n\nMilwaukee leads eighth-place Miami (34-35) by a half-game, and the Bucks opened up a 1 1/2-game lead over the ninth-place Detroit Pistons (33-36), who lost to Toronto.\n\nLOSING LAKERS\n\nRookie Ivica Zubac had 18 points and eight rebounds for the Lakers (20-49), who have lost 12 of 13. Only Brooklyn has a poorer record than the Lakers, whose fall has increased their chances of keeping their first-round pick this summer.\n\nTIP-INS\n\nBucks: This was the third stop on a six-game road trip. They swept both Staples Center tenants.\n\nLakers: They were officially eliminated from playoff contention. ... F Tarik Black didn't play due to an apparent case of the flu.\n\nUP NEXT\n\nBucks: At Warriors on Saturday.\n\nLakers: Host Cavaliers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995141.313405
}