{
  "game_id": "0021800684",
  "espn_id": "401071360",
  "date": "Jan 19, 2019",
  "matchup": "TOR vs. MEM",
  "headline": "Green hits 7 3s in 3rd quarter, Raptors top Grizzlies 119-90",
  "body": "TORONTO --  Danny Green knocked down 3 after 3, and as he did, he heard something unusual: Toronto fans chanting his name.\n\nGreen had a season-high 24 points and set a franchise record for 3-pointers in a quarter with seven in the third, and the Raptors beat the Memphis Grizzlies 119-90 on Saturday night.\n\n\"I haven't heard that since I was a little kid, from your parents on the sidelines,\" Green said of the \"Danny, Danny\" chants. \"It was fun.\"\n\nWhen Green was young, his dad used to be the one calling his name at games, although not to offer congratulations.\n\n\"It wasn't a positive cheer,\" Green said. \"It was more of a criticizing, coaching what you need to do better kind of cheer. You could hear him anywhere.\"\n\nSerge Ibaka scored 18 points, Pascal Siakam had 17 and the Raptors extended their home winning streak to nine. Toronto is 20-4 at home.\n\n\"That was awesome,\" coach Nick Nurse said. \"We hadn't had one like that in a while. It was good to see some of our shooters make some shots.\"\n\nGreen shot 7 for 9 from 3-point range in the third quarter and Toronto made 10 from long range in the period, outscoring Memphis 45-14 to take a 100-62 lead into the fourth.\n\n\"It was a lot of open ones,\" Green said. \"It wasn't like they were tough, contested or difficult shots. Just run the floor, get to the corner and get to the space.\"\n\nGreen had 21 points in the third, one shy of Kyle Lowry's franchise record for a quarter. He matched a career high with eight 3s for the game. Green also made eight 3-pointers against Minnesota in 2013.\n\n\"We were getting in the paint and their system is to collapse, and we kept finding him,\" Nurse said.\n\nThe 45-point third was Toronto's highest-scoring quarter of the season, and the highest-scoring third quarter in franchise history.\n\nNorman Powell scored 14 points, C.J. Miles matched his season high with 13 and Lowry had 12 as the Raptors won for the seventh time in eight games.\n\nToronto finished 17 for 36 from 3-point range.\n\nJaren Jackson Jr. scored 16 points, Shelvin Mack had 14, and Ivan Rabb had 13 points and 10 rebounds as the short-handed Grizzlies lost for the 11th time in 12 games. Memphis has lost seven straight on the road.\n\n\"Until we find that consistency from the offensive end, things will be challenging and we'll have to keep fighting,\" said guard Mike Conley, who scored 10 points.\n\nRaptors forward Kawhi Leonard missed his second straight game for rest. Leonard also sat out Thursday's win over Phoenix, the second game of a back-to-back.\n\nThe Grizzlies were without centres Marc Gasol (sore back) and Joakim Noah (personal reasons).\n\nIbaka scored 10 points in the first, and the Raptors closed the quarter with a 7-2 spurt to lead 23-19 after one.\n\nToronto led 55-48 at halftime.\n\nThe Raptors opened the third with a 10-0 run as Memphis didn't score for 3:13.\n\n\"They came out with purpose in that third quarter and kind of knocked us out,\" Grizzlies coach J.B. Bickerstaff said. \"We've got to do a better job of understanding who the hot guy is.\"\n\nTIP-INS\n\nGrizzlies: Memphis missed six straight shots to start the game before a 3-pointer by Temple. ... After matching a season-high 16 3-pointers in Friday's loss at Boston, Memphis shot 10 for 29 from long range. ... The Grizzlies made a season-worst 26 turnovers, leading to 38 points.\n\nRaptors: F OG Anunoby (personal reasons) was absent for the third straight game. ... Miles matched his career-best with five steals, all of them in the first half. ... Toronto has twice won a record 12 straight at home, doing so most recently last season. ... The Raptors are unbeaten at home since a Dec. 9 loss to Milwaukee.\n\nDOUBLE DUTY\n\nChris Boucher, Jordan Loyd and Malachi Richardson all played for Toronto after combining for 67 points for the G-League's Raptors 905 in a Saturday afternoon home win over Greensboro.\n\n\"They can handle that,\" Nurse said.\n\nBEST AGAINST THE WEST\n\nThe Raptors are 13-5 against Western Conference opponents, the best record of any East team.\n\nUP NEXT\n\nGrizzlies: Host New Orleans on Monday night.\n\nRaptors: Host Sacramento on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994107.149377
}