{
  "game_id": "0022400087",
  "espn_id": "401704653",
  "date": "Oct 26, 2024",
  "matchup": "LAC @ DEN",
  "headline": "Harden, Powell help Clippers overcome Jokic's 41 points to beat Nuggets 109-104",
  "body": "DENVER -- — James Harden had 23 points and 16 assists, Norman Powell scored 26 of his 37 points in the second half and the Los Angeles Clippers overcame Nikola Jokic's 41 points to beat the Denver Nuggets 109-104 on Saturday.\n\n\r\n              Jokic made a career-high seven 3-pointers but missed a free throw with 20 seconds left that would have tied the game. Harden made four from the line in the final 30.5 seconds. \n\n\r\n              The Clippers trailed 103-100 when Powell hit a 3-pointer. Jamal Murray, who had 22 points, missed a layup and Harden then made two free throws.\n\n\r\n              After Jokic split a pair from the line, Harden made two more foul shots to make it 107-104 and Jokic missed an off-balance 3-pointer.\n\n\r\n              Takeaways\r\n              Clippers: Harden missed a free throw in the opening loss to Phoenix on Wednesday but was 12 of 13 from the line on Saturday. Several of his 16 assists were to Ivica Zubac, who had 24 points and 15 rebounds.\n\n\r\n              Nuggets: The offense was better but the bench was 3 of 18 from the field. Only Julian Swather hit a field goal for that unit.\n\n\r\n              Key moment\r\n              Jokic presented Colorado star Nathan MacKinnon with his MVP trophy in the Avalanche’s home opener two weeks ago, and MacKinnon returned the favor before Saturday’s tip. He brought out the Michael Jordan Trophy while wearing a Jokic jersey and gave the three-time MVP a hug.\n\n\r\n              Key stat\r\n              Denver hit just 7 of 38 shots from 3-point range in Thursday’s loss to Oklahoma City and started Saturday missing 11 of 13. The Nuggets made 12 of their next 20 from deep but missed their final two attempts.\n\n\r\n              Up next\r\n              The Clippers travel to Golden State on Sunday night while the Nuggets begin a three-game road trip at Toronto on Monday night.\n\n\r\n              ------------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998062.930447
}