{
  "game_id": "0021900685",
  "espn_id": "401161327",
  "date": "Jan 26, 2020",
  "matchup": "HOU @ DEN",
  "headline": "Jokic helps Nuggets beat Rockets 117-110 on somber day",
  "body": "DENVER --  Colorado was the epicenter of Kobe Bryant's worst moment, but even in Denver, in a building where he was frequently booed, there were tears and stunned silence.\n\nIt started with a moment of silence for the NBA great, who was killed in a helicopter crash about an hour before the game, and led to chants of \"Kobe! Kobe! Kobe!\"\n\nThe game became secondary on this melancholy Sunday at Pepsi Center as the Denver Nuggets held off the Houston Rockets 117-110.\n\n\"I've got to be honest, it wasn't on my mind when we lost, us losing the game,\" Rockets guard Austin Rivers said. \"This pain is not going to go away anytime soon. You don't even have to be a basketball fan to feel this.\"\n\nIn 2003, Bryant was charged with sexually assaulting a 19-year-old employee at a Colorado resort. He had said the two had consensual sex, and the charge was eventually dropped. The woman later filed a civil suit against Bryant that was settled out of court. Bryant's adulation remained strong in Los Angeles even amid the allegations.\n\nBut not so much in Denver, where, for years, his every appearance was met with lusty boos from fans who heard more about Bryant's case than those in other NBA towns.\n\nAll afternoon, the mood was somber.\n\nA few of the Denver players sat at their lockers before the game, staring at their phones in disbelief with the details of Bryant's death starting to emerge. The 41-year-old Bryant and his 13-year-old daughter, Gianna, were among the nine people killed in the crash near Calabasas, California, about 30 miles northwest of downtown Los Angeles.\n\nHouston players Tyson Chandler and P.J. Tucker were visibly upset during the tribute, while Rivers covered his eyes with his arm. Rivers also had a tribute to Bryant on his shoes. So did Tucker, who wrote, \"There will never be another.\"\n\n\"This is beyond tough. I don't have the words,\" Tucker said. \"There will never be another person like him. Still trying to process it. ... I don't even really remember much from the game. I'm sorry. Just didn't mean a whole lot now.\"\n\nNikola Jokic said he got goosebumps when he heard of Bryant's death.\n\n\"I couldn't believe it,\" said Jokic, who finished with 24 points, 12 rebounds and 11 assists for his ninth triple-double of the season. \"He's not just a legend here, he's a legend across the world. We lost a huge person, a role model. It's a huge loss for everybody.\"\n\nJokic gave everything in honor of the player nicknamed Black Mamba.\n\n\"When you think about Kobe it's, `No excuse. Nothing can put your mind off what you love to do,\" Jokic said. \"It's the Mamba mentality, for sure.\"\n\nLike many around the league, Jerami Grant called Bryant his favorite player growing up.\n\n\"Watching everything he did on the court, off the court, the way he carried himself,\" said Grant, who scored a season-high 25 points. \"It's extremely tough.\"\n\nThe first half remained a complete blur for Michael Porter Jr. as he processed his feelings. He remembered meeting Bryant at a Nike camp, when the superstar offered him encouragement.\n\n\"We all look up to him,\" said Porter, who scored 17 points to help the Nuggets even the season series with Houston at two apiece. \"I didn't think it was real.\"\n\nRussell Westbrook scored 22 of his 32 points in the second half. Eric Gordon added 19 points and Ben McLemore scored 15 in the absence of leading scorer James Harden, who sat out with a bruised left thigh.\n\nOnce the final horn sounded, reality of Bryant's death set back in.\n\n\"It's devastating. This one hurt to the core,\" Gordon said. \"To hear news like that before the game, it was tough to stay focused. It's tough to hear news like that before the game -- a guy you admire, a guy you looked up to.\"\n\nTIP-INS\n\nRockets: Westbrook had 10 turnovers. ... Clint Capela grabbed 12 rebounds.\n\nNuggets: It was Jokic's 37th career triple-double. ... Morris finished with 17. ... The Nuggets were without Jamal Murray (left ankle sprain), Paul Millsap (bruised left knee) and Mason Plumlee (right foot).\n\nDIFFERENT STORY\n\nRockies All-Star shortstop Trevor Story drained the pregame free throw while wearing a pair of Kobe Bryant shoes. Story has always been a big fan of Bryant.\n\n\"The way he played the game was so inspiring to me,\" Story said. \"The Mamba mentality, you try to mimic that. The intensity he played with was so special.\"\n\nUP NEXT\n\nRockets: At Utah on Monday. Rockets coach Mike D'Antoni listed Harden as doubtful for the game against the Jazz and added that Westbrook will sit it out.\n\nNuggets: At Memphis on Tuesday. The Nuggets are 2-0 against the Grizzlies this season.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996628.623719
}