{
  "game_id": "0022300438",
  "espn_id": "401585066",
  "date": "Dec 29, 2023",
  "matchup": "MEM @ LAC",
  "headline": "George, Harden help Clippers close successful December with 117-106 win over Grizzlies",
  "body": "LOS ANGELES -- — What a difference a month makes for James Harden and the Los Angeles Clippers.\n\n\r\n              After struggling in November and trying to incorporate Harden into the lineup after he was acquired in a Nov. 1 trade with Philadelphia, the Clippers closed a successful December with a 117-106 victory over the Memphis Grizzlies on Friday night.\n\n\r\n              Paul George scored 23 points while Harden added 16 points and 13 assists for the Clippers, who were 11-2 in December, the best mark in the Western Conference for this month.\n\n\r\n              “I give credit to our coaching staff and players for just working through all that adversity when we lost six games in a row (in November) and just trying to figure it out,” Clippers coach Tyronn Lue said. “Once we figured out our rotations and how we wanted how to play, we've had to win games different ways, ugly sometimes. We're doing some good things and I like our attitude right now.”\n\n\r\n              The Clippers entered December three games under .500 on the season. They began the month with nine straight wins for their longest winning streak since 2015-16. Los Angeles was missing Kawhi Leonard for the fourth straight game due to a left hip contusion and has gone 2-2. \n\n\r\n              Harden has picked up some of the scoring slack with Leonard not in the lineup. He is averaging 20.5 points in Leonard's absence, which is three points more than his season average.\n\n\r\n              “We didn’t expect to be a hit right away. And it still isn't nowhere near we need to be,” said Harden, who had his sixth double-double of the season. “Tonight and over the last couple games, when someone like Kawhi is out you need me to score and play make a little bit more. We are learning each other more game by game. It's obviously fun when you are winning.”\n\n\r\n              Ivica Zubac added a season-high 20 rebounds along with 15 points for his fifth double-double in his last seven games.\n\n\r\n              The Clippers had seven players score in double figures. At 19-12, they lead the Pacific Division by a half-game over Sacramento and are fourth in the West.\n\n\r\n              Jaren Jackson Jr. and Marcus Smart scored 22 apiece for the Grizzlies. Ja Morant had 19 points and 10 assists. Morant is averaging 26.8 points in five games since coming back from a 25-game suspension to begin the season.\n\n\r\n              “Yeah, I mean, it’s a different ballgame. A little more comfort in my job as I go out there and make it easier for them. Find them easier looks, that’s just my role on this team,\" Morant said about the early results of his return.\n\n\r\n              The Clippers led most of the game. A dunk by Daniel Theis 30 seconds into the fourth quarter gave them a 96-75 advantage before Memphis began to rally.\n\n\r\n              Memphis scored 12 straight points to open a 22-9 run over a four-minute span. Smart's 3-pointer with 6:03 remaining got the Grizzlies within 105-97 before the Clippers furthered their lead.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host the Sacramento Kings on Sunday.\n\n\r\n              Clippers: Host the Miami Heat on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996026.2083561
}