{
  "game_id": "0022200925",
  "espn_id": "401469080",
  "date": "Feb 28, 2023",
  "matchup": "TOR vs. CHI",
  "headline": "Raptors beat Bulls 104-98 for 8th victory in 10 games",
  "body": "TORONTO -- — Pascal Siakam scored 20 points, Gary Trent Jr. had 19 and the Toronto Raptors beat the Chicago Bulls 104-98 on Tuesday night for their eighth victory in 10 games.\n\n\r\n              O.G. Anunoby added 17 points and Jakob Poeltl had 14 to help the Raptors win their fourth straight at home, matching their longest streak of the season.\n\n\r\n              Nikola Vucevic led the Bulls with 23 points and Zach LaVine had 17. DeMar DeRozan scored 13 points against his former team as Chicago fell to 10-21 on the road.\n\n\r\n              The Bulls had won back-to-back home games after losing six straight before the All-Star break, holding both Brooklyn and Washington below 90 points, but couldn’t keep that streak going north of the border.\n\n\r\n              Toronto had 94 field goal attempts to Chicago’s 71 and outrebounded the Bulls 47-35, including a 19-6 advantage on the offensive glass.\n\n\r\n              “They have size everywhere,” Bulls coach Billy Donovan said about the Raptors. “We did get hurt, no question, on the glass.”\n\n\r\n              The Bulls shot 37 for 71 overall and went 10 for 25 from 3-point range, but had 20 turnovers that led to 21 points for Toronto.\n\n\r\n              “It’s hard to put up points in a game like that with what we did,” Donovan said. “I thought we were trying to play the right way and we were trying do the right things. We just didn’t execute as well as we needed to.”\n\n\r\n              Vucevic said the Bulls needed to work harder to battle for rebounds.\n\n\r\n              “We didn’t do a good enough job tonight of boxing them out and grabbing the ball,” he said. “A few of them were 50-50.”\n\n\r\n              Raptors forward Scottie Barnes struggled through the first three quarters, shooting 1 for 8, but scored eight points and had a season-high four blocks in the final period.\n\n\r\n              “The competitive side of him really starts emerging in the fourth,” Raptors coach Nick Nurse said. “He just starts playing really physical and really tough.”\n\n\r\n              Anunoby said he appreciated Barnes’ big finish.\n\n\r\n              “He was amazing,” Anunoby said. “He was everywhere, making blocks, getting the ball and pushing, passing, finishing. He was doing everything.”\n\n\r\n              Barnes finished with 11 points. He had eight rebounds and four assists.\n\n\r\n              Chicago led 46-44 at the half. LaVine scored 11 points in the third and the Bulls scored the final five points of the quarter to take a 72-70 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Ayo Dosunmu scored 10 points and Andre Drummond had 10 rebounds. … Chicago waived G Goran Dragic, making him a free agent. The 15-year veteran, 36, has missed the past four games because of a sore left knee. … G Alex Caruso celebrated his 29th birthday.\n\n\r\n              Raptors: Barnes had a career-high five blocks against Sacramento on Dec. 13, 2021. … Toronto signed G Will Barton and waived F Juancho Hernangomez. Barton averaged 7.7 points in 40 games with Washington before he was waived Feb. 21. He played four minutes in his Toronto debut Tuesday. … G Dalano Banton (left thumb) was not available.\n\n\r\n              FRED’S BACK\n\n\r\n              Toronto guard Fred VanVleet returned after missing the past three games as he spent time at home for the birth of his third child. VanVleet shot 1 for 11, going 1 for 9 from 3-point range and scoring three points, but still made an impact with nine assists and six rebounds.\n\n\r\n              “It makes a big difference having Fred out there,” Anunoby said. “It definitely helps our team. He’s just a steady presence.”\n\n\r\n              GOOD MONTH\n\n\r\n              Toronto went 8-3 in February, its most victories in any month this season.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Detroit on Wednesday night.\n\n\r\n              Raptors: Begin five-game trip at Washington on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994029.827208
}