{
  "game_id": "0022200327",
  "espn_id": "401468482",
  "date": "Dec 02, 2022",
  "matchup": "DEN @ ATL",
  "headline": "Murray scores 34 points, short-handed Hawks beat Nuggets",
  "body": "ATLANTA -- — Dejounte Murray scored 34 points, rookie A.J. Griffin tied a career high with 24 subbing for injured Trae Young and the short-handed Atlanta Hawks beat the Denver Nuggets 117-109 on Friday night.\n\n\r\n              “I think we just showed how deep we are,\" Murray said. “Young talent and bunch of hard-working guys. We had three key guys out, three starters, and it's hard to win games in this league like that, especially playing a team like that that's feeling each other. Obviously their record shows what they've been doing this season.\"\n\n\r\n              Denver star Nikola Jokic, the two-time defending NBA MVP, had just four points in the first half on 2-of-5 shooting, but he and the Nuggets got hot in the third, cutting a 16-point deficit with a 14-1 run to make it 64-62 on Aaron Gordon’s layup. Jokic had 24 points, 10 rebounds and eight assists.\n\n\r\n              Denver tied it at 75 on Jamal Murray’s free throw with 3:34 to go in the third and took its first lead when Jokic’s straightaway 3 beat the shot-clock buzzer to make it 79-78 late in the period. \n\n\r\n              The Nuggets pulled within three on Bruce Brown’s layup with 3:37 left in the game, but couldn’t close the gap any further after Atlanta went on an 8-0 run, ending with Murray’s layup with 33 seconds to go.\n\n\r\n              It marked the first time this season that the Hawks placed seven players in double figures.\n\n\r\n              “A lot of guys were ready to step up and ready to play,\" Murray said. “The main thing I try to preach to these guys is try to be confident each and every day. It's just basketball. You're going to turn the ball over. You're going to make mistakes. Overall, I think we were having a lot of fun as well.\"\n\n\r\n              The Hawks were riddled with injuries before the game with Young, their leading scorer, sidelined by soreness in his right shoulder and John Collins out at least two weeks and De’Andre Hunter out at least one week. In all, Atlanta had eight players listed on the injury report.\n\n\r\n              “I give them 100% credit,\" Nuggets guard Ish Smith said. “There's 450 guys in this league. You've got to respect everybody. I think they've got talented guys. They got a chance to play and they played well.”\n\n\r\n              Atlanta has won two straight after dropping three in a row. The Nuggets snapped a four-game winning streak.\n\n\r\n              The Hawks outscored Denver 26-11 in points off turnovers.\n\n\r\n              “We knew they would come out more aggressive and what they did was get their transition game going,\" Atlanta coach Nate McMillan said. “We were late getting back in transition in that third quarter. They got back in the game pretty quickly.\"\n\n\r\n              TIP-INS: \n\n\r\n              Nuggets: F Michael Porter Jr. missed his fifth straight game with a left heel strain. ... Jamal Murray was a game-time decision with a deep thigh contusion. ... F Jeff Green was out with a right knee contusion, but coach Michael Malone said the team is hopeful he can play in the next game.\n\n\r\n              Hawks: Young was a game-time decision with right shoulder soreness. ... Griffin started in his spot. ... G Bogdan Bogdanovic made his season debut after missing 22 games following knee surgery and scored five points in 22 minutes. ... Collins (left ankle sprain) and Hunter (right hip flexor strain) were replaced in the lineup Jalen Johnson and Jarrett Culver, who’s on a two-way contract. ... Johnson started in Collins’ spot and had 10 points and 10 rebounds. \n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At New Orleans on Sunday.\n\n\r\n              Hawks: Host Oklahoma City on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994723.434747
}