{
  "game_id": "0022200897",
  "espn_id": "401469052",
  "date": "Feb 24, 2023",
  "matchup": "MIA @ MIL",
  "headline": "Giannis exits early with knee issue; Bucks rip Heat 128-99",
  "body": "MILWAUKEE -- — The Milwaukee Bucks sure didn’t let Giannis Antetokounmpo’s early exit bother them Friday night as they rolled to their most-lopsided victory of the season.\n\n\r\n              Now they wait to learn whether they might have to continue playing without the two-time MVP \n\n\r\n              Antetokounmpo left late in the first quarter with a right knee issue to spoil his rapid recovery from a sprained wrist, but the Bucks still trounced the Miami Heat 128-99 for their 13th consecutive triumph.\n\n\r\n              “I haven’t gotten the full breakdown, but I’m pretty sure either on a a drive or on a screen or something like that, he knocked knees with somebody and just wasn’t able to return,\" said Bucks coach Mike Budenholzer, who had no update beyond that.\n\n\r\n              Antetokounmpo was in the starting lineup just four days after heading to New York to have his right wrist examined. \n\n\r\n              “Sometimes you have to stop him from himself, being able to calm down and maybe even not play a couple of games, knowing that we’re No. 2 (in the East), knowing that we’re all right,\" said Jrue Holiday, who had 24 points. \"I know he doesn’t like it. He tries to play every single game, which I completely understand. I feel like I’m the same way.”\n\n\r\n              Antetokounmpo was on the floor late in the first quarter when the two-time MVP passed the ball and immediately motioned to the bench as the Bucks called a timeout to enable him to head to the locker room.\n\n\r\n              He had four points, four rebounds and four assists in just six minutes.\n\n\r\n              The Bucks still had no trouble extending the longest winning streak in the NBA this season. The Bucks pulled ahead for good four minutes into the game and rolled to their most lopsided victory of the season.\n\n\r\n              “It didn't slow them down one bit when Giannis went out,” Heat coach Erik Spoelstra said. “They just put it in overdrive.”\n\n\r\n              Holiday shot 5 of 9 from 3-point range, had seven assists and five rebounds. He drew perhaps his biggest ovation of the night when the scoreboard video caught him joining the crowd singalong to the Backstreet Boys’ “I Want It That Way” during a timeout late in the fourth quarter. \n\n\r\n              “That's a classic song,” Holiday said. “And we were winning. So good vibes.”\n\n\r\n              Bobby Portis had 18 points and 11 rebounds in his return from a sprained right medial collateral ligament that caused him to miss 11 games. Brook Lopez had 17 points, Grayson Allen 16 and Khris Middleton 12.\n\n\r\n              “It was fun just to be out there, fun just to play the game I love to play,” Portis said.\n\n\r\n              Jimmy Butler scored 23, Bam Adebayo 18, Tyler Herro 14 and Caleb Martin 13 for the Heat, who shot just 9 of 40 on 3-point attempts.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Kevin Love and Cody Zeller made their Heat debuts after signing with Miami during the All-Star break. Love, who had reached a buyout with the Cleveland Cavaliers, was in the starting lineup but went scoreless in his first game appearance in a month. He did have eight rebounds and four assists in 22 minutes. Zeller was playing his first game of the season and had 10 points in 16 minutes.\n\n\r\n              Bucks: Jae Crowder, acquired at the trade deadline, made his 2022-23 debut and had nine points in 16 minutes. Crowder hadn't played at all for Phoenix this season as the Suns attempted to deal him. ... Meyers Leonard, who signed a 10-day contract this week, had five points and six rebounds in 15 minutes while playing his first NBA game since January 2021. ... Pat Connaughton (left calf soreness) and Wesley Matthews (right calf strain) didn't play.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Charlotte on Saturday. The Heat are 2-1 against the Hornets this season with the home team winning each of the three games.\n\n\r\n              Bucks: Host Phoenix on Sunday in the first matchup of the season between the teams. The Bucks and Suns will face off again March 14 in Phoenix.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sport",
  "source": "espn_api",
  "crawled_at": 1764993937.8091788
}