{
  "game_id": "0022200781",
  "espn_id": "401468936",
  "date": "Feb 02, 2023",
  "matchup": "CHA @ CHI",
  "headline": "Dosunmu, White lead way as Bulls beat Hornets 114-98",
  "body": "CHICAGO -- — Ayo Dosunmu matched a season high with 22 points, Coby White scored 20 points and the Chicago Bulls overcame shaky outings by DeMar DeRozan and Zach LaVine to beat the Charlotte Hornets 114-98 on Thursday night.\n\n\r\n              Dosunmu made 9 of 10 shots, and White hit three 3-pointers. Nikola Vucevic added 17 points and 12 rebounds, and Andre Drummond had 15 points and 11 rebounds in just under 15 minutes.\n\n\r\n              The Bulls used a big third quarter to turn a four-point halftime lead into an 85-70 advantage heading to the fourth.\n\n\r\n              They stayed in control the rest of the way and got some payback for a loss one week earlier in Charlotte even with DeRozan and LaVine not performing to their usual standards.\n\n\r\n              “It's just a testament to our team,” Dosunmu said. “We have a very deep team. At this point of the season, we're gonna need everyone to come out and play on both ends.”\n\n\r\n              DeRozan finished with 15 points on 4-of-12 shooting, after getting his sixth All-Star selection and second in as many seasons with the Bulls. LaVine scored 10 points. But even with its two best players not scoring the way they normally do, Chicago had six players in double figures and made enough plays to beat the team with the second-worst record in the Eastern Conference.\n\n\r\n              Terry Rozier scored 23 points for Charlotte. LaMelo Ball, coming off a triple-double Tuesday night in a loss at Milwaukee, added 19 points, eight rebounds and six assists before getting ejected with 1:21 remaining. He was furious about a non-call after LaVine blocked his layup and picked up two separate technical fouls. Mason Plumlee had 16 points and 11 rebounds.\n\n\r\n              The Bulls scored the first 10 points of the second half to bump a four-point lead to 63-49.\n\n\r\n              Dosunmu started the run and finished it with layups, and Vucevic and Patrick Williams made back-to-back 3-pointers.\n\n\r\n              BIG SPARK\n\n\r\n              Drummond became the first NBA player since Darryl Dawkins in 1978-79 to record at least 15 points and 11 rebounds while playing 15 minutes or less, according to the Elias Sports Bureau. \n\n\r\n              The two-time All-Star signed with Chicago last summer to back up Vucevic. He's been in and out of the rotation and been used sparingly of late. \n\n\r\n              “At the end of the day, I just have to be a good teammate,” Drummond said. “That’s what I can focus on. When you focus on the stuff you can’t control, that’s when you start getting to that dark place.”\n\n\r\n              Drummond played just 3:31 in Tuesday's loss to the Los Angeles Clippers and did not appear in five of the seven games prior to that.\n\n\r\n              “Am I OK with it?\" he said. “I’m never OK with it. I’m a basketball player. I want to play. But circumstances that I'm in, I have to work my way back to get to where I want to get to.”\n\n\r\n              Drummond said the best path for him is “being a good teammate” and doing \"whatever it takes to help this team win.”\n\n\r\n              ON POINT\n\n\r\n              This was only the second time this season that DeRozan, LaVine or Vucevic did not lead the Bulls in scoring. Javonte Green did it in a win over Charlotte on Nov. 2. Williams also tied DeRozan for the lead in a win over Brooklyn on Jan. 4.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: The Hornets, last in the NBA in 3-point percentage coming in, made 7 of 35 from beyond the arc.\n\n\r\n              Bulls: G Alex Caruso left the game with a sprained right foot. He scored seven points in seven minutes before exiting early in the second quarter. ... Williams tweaked his right ankle in the fourth quarter, but said he'll be fine. ... Coach Billy Donovan said the All-Star break will be “important” for Green as he recovers from right knee surgery. Sidelined since Dec. 31, Green has been riding a bike but is not cleared to run. \n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Detroit on Friday night.\n\n\r\n              Bulls: Host Portland on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994258.8877702
}