{
  "game_id": "0021900791",
  "espn_id": "401161433",
  "date": "Feb 09, 2020",
  "matchup": "LAC @ CLE",
  "headline": "Clippers hand Cavs worst home loss in franchise history",
  "body": "CLEVELAND --  The presence of Andre Drummond began the night with optimism for the Cleveland Cavaliers.\n\nThat positive feeling was quickly dashed by a 133-92 loss Sunday to the Los Angeles Clippers, the Cavaliers' worst home defeat in franchise history.\n\n\"Tonight was pretty ugly, so show 'em your worst first and you only can go up from there,\" Kevin Love said.\n\nDrummond started in his first game with Cleveland after being acquired from Detroit at the trade deadline. He scored 19 points, had 14 rebounds and even hit a pair of 3-pointers in 29 minutes.\n\nDrummond's numbers weren't nearly enough as the Clippers led wire-to-wire without star forward Kawhi Leonard. Cleveland's previous worst was a 39-point loss to Chicago in 2012.\n\nLou Williams scored 25 points, Paul George had 22 and Marcus Morris added 10 in his first game with the Clippers.\n\nLos Angeles' biggest lead was 45 points in the fourth quarter after coach Doc Rivers had given his starters the rest of the night off.\n\nDrummond stressed patience after Cleveland's 12th straight loss at home. The Cavaliers have dropped 13 of 14 overall.\n\n\"We're not looking at the scoreboard,\" he said. \"I said it when I first got here in the locker room. I don't care about the record. I don't care about the scoreboard. I just care about, did we get better today? My goal is to push these guys and keep them positive, continue to work hard and show no quit on this season.\"\n\nThe Clippers didn't miss Leonard, who was out because of a sore left knee. Morris, acquired from New York at the trade deadline, started in Leonard's spot at power forward and played 22 minutes.\n\nThe Clippers were obviously angry following an embarrassing 142-115 loss in Minnesota on Saturday. Los Angeles shot 70% percent in the first quarter, making 14 of 20 from the field.\n\n\"There are nights for whatever reason, it's the perfect storm,\" Rivers said. \"Last night was one of those. You just move on from it.\"\n\nMorris knocked Drummond to the floor with a hard foul as Cleveland's center tried to score in the third quarter. The play was upgraded to a flagrant foul after a review.\n\nMorris' final game with the Knicks came in Cleveland on Feb. 3. He scored 26 points in New York's overtime win.\n\n\"That was cool, man,\" Morris said of his debut. \"The guys made the game easy. I asked them before the game where they liked the ball and they asked me where I wanted it.\"\n\nDrummond replaced Tristan Thompson, who has started 48 games. Thompson came off the bench and scored seven points in 19 minutes. Love had 10 points in 26 minutes.\n\nDrummond ran through some drills during a Saturday workout to get familiarized with the team's system.\n\n\"We had no practice time, so it was expected for us to come out and look lost, obviously because we were trying to figure out plays,\" he said. \"I didn't really know many plays yet.\"\n\n.TIP-INS\n\nClippers: Leonard missed his 13th game of the season. ... G Patrick Beverley (strained right groin) was out for second straight game. ... Los Angeles wore throwback Buffalo Braves uniforms. The franchise played in Buffalo from 1970-78.\n\nCavaliers: Drummond is 3 for 24 on 3-pointers this season. .... Thompson hit his fourth career 3-pointer in the second quarter. ... Kevin Porter Jr. had 17 points.\n\nTOUGH TIMES\n\nThe Cavaliers' celebration of their 50th season in the NBA has seen the team have the worst record in the Eastern Conference.\n\n\"We were not good and way out of sync in so many ways,\" coach John Beilein said of the latest loss. \"While it's not acceptable to us, it's understandable given the new dynamic of our team. So coaches will meet again tomorrow and we will try to get some better symmetry on it.\"\n\nWELCOME BACK\n\nClippers assistant Tyronn Lue was the Cavaliers' coach during their 2016 NBA championship season. He returned to Rocket Mortgage FieldHouse for the first time since being fired by Cleveland after six games last season.\n\nLue was given a standing ovation and waved to the crowd when he was introduced during a timeout.\n\n\"This is the house that Jim Brewer and Ty Lue built,\" Rivers said. \"It's a great feeling when you return to a place you won a championship. Heck, he had a parade in the streets here. That's a pretty good memory.\"\n\nBrewer, who played for the Cavaliers and several other teams in a 10-year NBA career, is Rivers' uncle.\n\nUP NEXT\n\nClippers: Visit Philadelphia on Tuesday.\n\nCavaliers: Host Atlanta on Wednesday. Cleveland's last win at home came over the Hawks on Dec. 23.",
  "source": "espn_api",
  "crawled_at": 1764996494.6799202
}