{
  "game_id": "0021600092",
  "espn_id": "400899542",
  "date": "Nov 06, 2016",
  "matchup": "LAL vs. PHX",
  "headline": "Lakers hold off Suns 119-108 to move above .500",
  "body": "LOS ANGELES -- Julius Randle refused to back down from Tyson Chandler, and both big men got technical fouls for trash talking. Moments later, the crowd rose to its feet when Randle got the ball against Chandler on the perimeter in the closing minutes.\nInstead of forcing a confrontation, Randle fed Jordan Clarkson for a decisive 3-pointer.\nThe Los Angeles Lakers are young and headstrong, but they're learning all the time.\nAnd for just the second time in three years, they're a winning team.\nNick Young scored 22 points, Clarkson added 18 and the Lakers moved above .500 with their third straight victory, 119-108 over the Phoenix Suns on Sunday night.\nTwo days after their stunning upset of Golden State, the Lakers (4-3) held off the Suns down the stretch despite Devin Booker's career-high 39 points. Randle also scored 18 for the Lakers and assisted on that 3 by Clarkson with 1:27 left to seal it.\n\"The fact he did what he did was such a winning play on his part,\" Los Angeles coach Luke Walton said. \"Unselfish. It's everything we want. It's him using his brain, him being competitive, him fighting for the team.\"\nAfter three seasons of gradually increasing misery, the Lakers are young, fun and improving. They're also unbeaten at home, winning three straight games at Staples Center for the first time since April 2013.\n\"We're doing things the right way, and we're starting to see some success,\" Randle said. \"We easily could have given up the lead, but we kept fighting. ... That's just my game. I don't back down from anybody. I'm not afraid of nobody.\"\nOther than its season-opening victory last month, Los Angeles hadn't had a winning record since the franchise was 10-9 on Dec. 6, 2013. The three worst seasons in team history followed, but Walton's new Lakers are already injecting optimism into their huge fan base with up-tempo excitement and a quick start to the season.\nBooker scored 29 in the second half while setting a career high for the second straight game. T.J. Warren had 22 points and Eric Bledsoe added 19 for Phoenix, which started slowly two days after a road game in New Orleans.\n\"They're a good team in transition, and we knew that coming in,\" said Booker, who also had seven assists. \"We had some mental breakdowns, and they took advantage of it.\"\nBOOK MAKING\nBooker followed up his 38-point game against the Pelicans on Friday with another beauty. After missing nine of his 12 first-half shots, the 20-year-old heated up with a series of high-difficulty buckets while Phoenix trimmed the Lakers' lead.\n\"Doesn't matter,\" Booker said. \"It's another game, especially if we lose. If we get a win, I'm more excited about it. Everybody looks good when you win, and that's what we're trying to do. Scoring as many points as you want and not making the playoffs isn't a good look.\"\nBooker outscored D'Angelo Russell, his fellow second-year NBA guard, but Russell had 11 points -- eight in the fourth quarter -- and six assists.\nUNCLE P DELIVERS\nYoung's strong game included a four-point play with 4:19 left. Even the Suns have taken notice of the veteran guard, whose Lakers career appeared to be over last summer. \"We knew Nick has been playing well all season,\" Phoenix coach Earl Watson said. \"He's done a really good job turning his game around.\"\nNANCE INJURED\nLakers F Larry Nance Jr. has a concussion after a first-quarter tumble. Nance was undercut by P.J. Tucker while they scrambled for a loose ball near midcourt. Nance didn't return, and he must miss Tuesday's game against Dallas as well, according to the NBA's concussion protocol. Nance is a valuable reserve in his second NBA season, averaging 8.2 points and 5.2 rebounds per game.\nTIP-INS\nLos Angeles' bench outscored the Suns' reserves 47-9. ... Timofey Mozgov added 14 points and eight rebounds for the Lakers. ... Lakers fan Travis Milne hit a half-court shot before the fourth quarter to win $35,000. Several Lakers high-fived Milne, who pointed at his forearm in an imitation of Russell's famed \"Ice In My Veins\" celebration of big shots. Russell didn't see the homage, but was visibly pleased to hear about it after the game.\nUP NEXT\nSuns: At Portland on Tuesday.\nLakers: Host Dallas on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995449.305203
}