{
  "game_id": "0021500596",
  "espn_id": "400828483",
  "date": "Jan 15, 2016",
  "matchup": "POR @ BKN",
  "headline": "Lillard has 33 points, Blazers beat Nets, win 3rd straight",
  "body": "NEW YORK --  Damian Lillard added to the Brooklyn Nets' fourth-quarter woes this season.\n\nLillard had 14 of his 33 points in the final period to lead the Portland Trail Blazers past the Nets, 116-104 on Friday night for their third straight win.\n\nAs Lillard sat in the bench, Portland trailed 92-86 with 8:41 left in the fourth quarter after a pull-up jumper by Andrea Bargnani. But backup center Ed Davis scored 20 seconds later to start a 19-2 run.\n\nLillard then came back into the game with 8:08 remaining, tapped each of his teammates' hands, and then he and Davis combined for 14 points during that key stretch that gave the Blazers a 105-94 lead with 4:26 remaining.\n\n\"I came in and I just told everybody it's winning time,\" said Lillard, who also added 10 assists.\n\n\"We got to start getting stops because they're having a hard time stopping us. The first team that stops the other is going to win this game. We (were) hitting some shots but we definitely tightened up on the defensive end, too.\"\n\nAllen Crabbe came off the bench and had 19 points while Davis had 14 points and 10 rebounds for the Trail Blazers, who ended a two-game skid against Brooklyn.\n\nPortland moved within a half-game of the Utah Jazz for the eighth and final playoff spot in the Western Conference. During the last four games, Lillard has averaged 31.3 points and 9.8 assists.\n\n\"We've seen it before and we know what he is capable of doing,\" said Trail Blazers coach Terry Stotts. \"He came back against a couple of good teams, so that was tough. He's been playing some exceptional basketball and we needed all of it tonight.\"\n\nBrook Lopez scored 25 points for the Nets, who have lost 11 of their last 12 games at Barclays Center. Point guard Donald Sloan came up just short of his first career triple-double, scoring 15 points with nine rebounds and nine assists.\n\nIt was Brooklyn's second loss in three games under interim coach Tony Brown, who took over when Lionel Hollins was fired last Sunday.\n\n\"Obviously it's still a work in progress. We're always learning and building,\" Lopez said. \"But we still have great spirits abound.\"\n\nAfter Davis extended Portland's lead to 105-94 with a put-back dunk off Lillard's missed 3-point attempt, the Nets scored five straight to cut it to 105-99 on Sloan's 3-pointer with 3:35 remaining.\n\nBut the Trail Blazers then pulled away for good with an 11-5 run, paced by four points from Lillard, to seal the first game a three-game East Coast road trip.\n\n\"Damian Lillard, it's a joke that this guy hasn't been (voted) an All-Star,\" Brown said. \"He plays with so much poise.\"\n\nTIP-INS\n\nTrail Blazers: Lillard has had at least 10 assists in three of his last five games, including his last two. He came up one short in the other two games.\n\nNets: Sloan, who celebrated his 28th birthday by getting his third straight start at point guard in place of injured starter Jarrett Jack, played a season-high 32 minutes. ... Brooklyn outrebounded Portland 46-42. ... All five starters for the Nets scored in double figures.\n\nLATE NIGHT SPECIAL\n\nAfter scoring 17 of his 31 points in the fourth quarter of last Sunday's come-from-behind victory over Oklahoma City, Lillard struck again the final period against the Nets, going 4 of 5 from the field, including a pair of 3s in almost eight minutes.\n\nBACK TO WHERE IT STARTED\n\nTrail Blazers starting center Mason Plumlee watched last June's NBA draft at Barclays Center. By the time he left the building, former Nets general manager Billy King had called to let him know he had been traded along with the draft rights to Pat Connaughton for Steve Blake and the rights to Rondae Hollis-Jefferson. Plumlee, a 2013 first-round selection by the Nets, pick has started each of Portland's first 42 games this season, averaging 9.2 points and 7.8 rebounds.\n\nUP NEXT\n\nTrail Blazers: Visit Philadelphia on Saturday night.\n\nNets: Visit Atlanta on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994518.015866
}