{
  "game_id": "0021900615",
  "espn_id": "401161257",
  "date": "Jan 16, 2020",
  "matchup": "MIL vs. BOS",
  "headline": "Antetokounmpo, Bucks hold off Celtics, 128-123",
  "body": "MILWAUKEE --  Giannis Antetokounmpo had 32 points and 17 rebounds, Khris Middleton scored 23 and the Milwaukee Bucks held off the Boston Celtics 128-123 on Thursday night.\n\nWith the victory, the NBA-leading Bucks (37-6) extended their winning streak to five games.\n\nKemba Walker scored a game-high 40 points to lead the Celtics, who took the floor without Jaylen Brown. The 6-foot-6 forward suffered a sprained right thumb in a 13-point loss to Detroit on Wednesday.\n\n\"We saw a play late in the first half and we think that might have been when it happened,\" Boston coach Brad Stevens said. \"Maybe it got worse as the game went on. He didn't say much about it at halftime. Certainly, after the game it was sore. Today, more sore.\"\n\nStevens said they will do more tests on Brown's thumb on Friday.\n\nMarcus Smart, who started in place of Brown, had 24 points.\n\nAntetokounmpo, who also had seven assists, had his 35th double-double of the season.\n\nAfter trailing by as many as 27, the Celtics outscored Milwaukee 36-22 to pull within 127-123 with 38 seconds to play. But Smart missed a 3-pointer and Middleton knocked down one of two free throws to seal the victory.\n\nAntetokounmpo scored the first basket of the night and the Bucks never trailed.\n\nMilwaukee hit seven of their first 10 shots, including their first four attempts from 3, and led 36-20 after the first quarter. Brook Lopez had three of those 3-pointers and had 11 points in the opening quarter. Lopez finished with 16 points.\n\nMilwaukee set a new season-high with 76 points in the first half. The Bucks had a 76-58 lead at the break.\n\nBoston stormed out in the second half, cutting Milwaukee's lead to 87-81 with 5:16 left in the third. But the Bucks ended the quarter on a 19-6 run.\n\nGordon Hayward, who finished with seven points on 1-of-10 shooting for the Celtics, scored his only field goal on a 3 at the end of the third.\n\nJayson Tatum had 17 points and Daniel Theis added 12 points and 10 rebounds in the loss.\n\nDonte DiVincenzo had a career-high 19 points off the bench for Milwaukee.\n\nTIP-INS\n\nCeltics: Boston entered the night having won five straight when trailing by at least 15 points after the first quarter dating back to Nov. 10, 2017. That streak, which was the longest such streak in NBA history, ended.\n\nBucks: Milwaukee has a three-game winning streak against the Celtics for the first time since winning four straight over the 2012 and 2013 seasons.\n\nUP NEXT\n\nCeltics: Host the Suns on Saturday.\n\nBucks: At the Nets on Saturday.\n\n---\n\nFollow Keith Jenkins on Twitter: https://twitter.com/MrKeithJenkins\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996144.459475
}