{
  "game_id": "0021800554",
  "espn_id": "401071230",
  "date": "Jan 02, 2019",
  "matchup": "CHA vs. DAL",
  "headline": "Early shooting barrage lifts Mavs to rare road victory",
  "body": "CHARLOTTE, N.C. --  Luka Doncic and Dennis Smith Jr. fueled an early long-range shooting blitz and the Dallas Mavericks beat the Charlotte Hornets 122-84 on Wednesday night to end a nine-game road skid.\n\nDoncic and Smith each had 18 points, and Harrison Barnes added 17. The Mavericks hit 10 first-quarter 3-pointers -- three from Doncic and two from Smith -- and finished with 18 overall.\n\nDallas won its first road game since Nov. 28. It entered the game with a NBA-worst 2-16 road record, compared to 15-3 at home.\n\nThe Mavericks led 42-26 after the first quarter, and Charlotte got no closer than 18 the rest of the game. Dallas led by at least 20 points for the final 26 1/2 minutes.\n\nDwight Powell scored 15 points, Wesley Matthews had 11, and DeAndre Jordan had eight points and 13 rebounds. Doncic added 10 rebounds and Smith seven assists, and the Mavericks didn't use any of their starters for more than 29 minutes in the game.\n\nCharlotte was led by Kemba Walker's 11 points. Walker made 4 of 14 shots and missed all five of his 3-point tries in 27 minutes. He was pulled with 3:15 left in the third quarter and didn't return.\n\nTIP INS:\n\nMavericks: Fayetteville native Smith played one year at N.C. State and bought 25 tickets for Wednesday's game. He had many other friends and family in attendance in his lone trip to his home state. He was one of three Mavericks with local ties; Barnes played at North Carolina, and 11th-year Dallas assistant coach Darrell Armstrong is a Gastonia native who played at Fayetteville State.\n\nHornets: They started only their fourth different lineup of the season Wednesday after Jeremy Lamb (right hamstring) and Cody Zeller (broken right hand) were injured in Monday's 125-100 home win over Orlando. Walker and Devonte Graham opened at guard, Nic Batum and Marvin Williams at forward and Willy Hernangomez at center. Graham, a 2018 second-round pick out of Kansas, made his first career start.\n\nUP NEXT\n\nMavericks: Visit Boston Celtics on Friday.\n\nHornets: Begin a six-game, 10-day trip on Saturday in Denver. Charlotte also visits Phoenix, the Los Angeles Clippers, Portland, Sacramento and San Antonio before returning home Jan. 17 against Sacramento.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994395.698671
}