{
  "game_id": "0021900046",
  "espn_id": "401160688",
  "date": "Oct 28, 2019",
  "matchup": "MIL vs. CLE",
  "headline": "Middleton scores 21, leads Bucks past Cavaliers 129-112",
  "body": "MILWAUKEE --  The Milwaukee Bucks were in a serious mood Monday night after a loss to Miami in their home opener over the weekend.\n\nKhris Middleton scored 21 points and the Bucks used a strong finish to hold off the Cleveland Cavaliers 129-112.\n\nMiddleton scored 10 points in a late 28-12 run and seven Milwaukee (2-1) players finished in double figures.\n\n\"Khris really kind of put the nail in the coffin with a couple of his finishes,\" Bucks coach Mike Budenholzer said. \"He's a big shot-maker and closer.\"\n\nCleveland had pulled within 96-91 on a Tristan Thompson dunk with 9:26 remaining, but Milwaukee responded. Point guard Eric Bledsoe had six points as the Bucks went up by 12, and Middleton hit a pair of 3-pointers, the second one giving Milwaukee a 124-103 lead with 2:50 remaining.\n\nOn a relatively quiet night for Bucks star Giannis Antetokounmpo (14 points on 5-of-15 shooting and 10 rebounds), Milwaukee got a huge boost from reserves George Hill and Pat Connaughton. Hill had 19 points and Connaughton scored 17, including 14 in the first half.\n\n\"We play great together; we have great continuity,\" Connaughton said. \"For us, it's about making sure we bring the energy and winning plays and do our job.\"\n\nBrook Lopez had 16 points and Wesley Matthews and Bledsoe each added 14 for Milwaukee.\n\nCleveland (1-2) was led by guard Collin Sexton with 18 points, and Tristan Thompson and Jordan Clarkson each had 17.\n\n\"This is a great team,\" Cavaliers forward Larry Nance Jr. said. \"They're probably picked to come out of the East this year. \"So to play on their court and battle them down to near the last minute is positive.\n\n\"We put a lot of emphasis on Giannis, but that's what makes this team great. You take him out of it or at least contain him to a certain extent, and the other guys stepped up. Pat, G. Hill, Kyle (Korver). That's what makes these guys tough to beat.\"\n\nThe Bucks sank 17 of 38 attempts from 3-point range (44.7%), with Connaughton going 4 of 5 beyond the arc and Middleton hitting 3 of 5.\n\n\"They've been averaging 50 (three-point attempts) and they only got 38 off,\" Cavaliers coach John Beilein said. \"They got some really good open ones but that's because they're veterans. There's a reason why they're contenders for the NBA championship.\"\n\nMilwaukee trailed 31-30 after the first quarter, but rallied to take a 59-52 halftime lead. Connaughton scored 11 points in the second quarter.\n\nHill, obtained from the Bucks in a trade with Cleveland last December, hit 7 of 10 shots and added eight rebounds and three assists.\n\n\"I think the first two games I was being very passive and unselfish and trying to make the right play instead of just playing basketball,\" Hill said. \"I'm just trying to make an impact on both ends.\"\n\nAntetokounmpo scored 30 points while posting a triple-double in the Bucks' season-opening win at Houston and had 29 in the overtime loss to Miami. But he wasn't worried about being limited to 14 against Cleveland while dishing out seven assists.\n\n\"I'm just trying to be aggressive,\" Antetokounmpo said. \"One of the things I do well is finding others open shots. If I see a guy open, I just want to pass it on the money and hopefully he'll knock it down.\"\n\nTIP-INS\n\nCavaliers: Former Bucks player John Henson played 8 minutes (3 points, 3 rebounds) in Cleveland's 110-99 victory over Indiana on Saturday, but suffered a strained right hamstring that could sideline him for a month. The Cavaliers acquired him from Milwaukee in a three-team deal last December, but he was out the rest of the season following wrist surgery. Henson and Ante Zizic (left foot plantar fasciitis) were out. ... Beilein is quite familiar with Bucks forward D.J. Wilson, who played for him at Michigan. \"He's got so many tools with his length and overall ability,\" Beilein said. \"He can shoot; he can pass. Finding his place and staying healthy and all those things are going to be key for him.\"\n\nBucks: Foul woes plagued Milwaukee in its first two games, and Antetokounmpo fouled out of both contests. Opponents are doing their best to draw fouls on the Bucks star or force a call by the officials. \"I haven't picked up on a strategy,\" Budenholzer said. \"I think Giannis can be more disciplined. He knows that. I have a ton of confidence that he can self-correct.\" Antetokounmpo had two fouls in 29 minutes on Monday.\n\nUP NEXT\n\nCavaliers: Host the Chicago Bulls on Wednesday.\n\nBucks: Play at the Boston Celtics on Wednesday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-NBA",
  "source": "espn_api",
  "crawled_at": 1764996187.04242
}