{
  "game_id": "0022001058",
  "espn_id": "401307871",
  "date": "May 14, 2021",
  "matchup": "LAC @ HOU",
  "headline": "Rockets get 122-115 win with Clippers resting stars",
  "body": "HOUSTON -- — Kelly Olynyk scored 20 points and fell a rebound shy of a triple-double as the Houston Rockets snapped a seven-game skid with a 122-115 victory over a Los Angeles Clippers team that rested several starters Friday night. \n\n\r\n                    Olynyk had 11 assists and nine rebounds to help the Rockets win for the first time since April 29.\n\n\r\n                    “Every one of them coming together to have a victory is really good stuff,\" coach Stephen Silas said. \n\n\r\n                    The Clippers were without Paul George, Kawhi Leonard and Patrick Beverley as all three sat out on the second night of back-to-back games as the team prepares for the playoffs. \n\n\r\n                    The loss coupled with a win by Denver on Friday night leaves the Clippers in a tie for third place in the Western Conference with one game remaining. \n\n\r\n                    Coach Tyronn Lue said he's thinking about how his rotation will look as the postseason approaches, but that he hasn't nailed everything down yet. \n\n\r\n                    “We've got a lot of decisions to make, but the most important thing is health,\" he said. \n\n\r\n                    The Rockets, who have the NBA’s worst record at 17-54, won for just the second time in the last 14 games thanks to a balanced scoring effort where seven players scored at least 10 points. \n\n\r\n                    Rookie Jae’Sean Tate added 20 points and Khyri Thomas and Anthony Lamb added 17 points each for Houston.\n\n\r\n                    Rockets owner Tilman Fertitta visited the team in the locker room after the victory.\n\n\r\n                    “Tilman came in and spoke to the team and told them how proud he was of them and he hadn’t done that this season,\" Silas said. “The players really liked that.\" \n\n\r\n                    The Rockets trailed by as many as 11 in the first half but used a 43-point second quarter to take an 83-79 lead into halftime. \n\n\r\n                    A 3-pointer by Luke Kennard got the Clippers within four with about eight minutes left in the third quarter. The Rockets then used a 14-5 run, powered by seven points from D.J. Augustin, to extend the lead to 97-84 with about four minutes left in the third. \n\n\r\n                    A basket by DeMarcus Cousins cut the lead to 11 early in the fourth quarter. But Thomas scored four quick points for the Rockets to make it 112-97 with about eight minutes to go. \n\n\r\n                    Kennard led the Clippers with 23 points and Rajon Rondo had nine points and a season-high 13 assists. \n\n\r\n                    Rookie Jay Scrubb had a career-high 17 points for the Clippers in his first career start.\n\n\r\n                    “From this game tonight you can tell what kind of player he’s going to be,\" Lue said. “He’s a scorer.\" \n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: Avery Bradley missed a fifth straight game due to personal reasons. ... Christian Wood missed his sixth consecutive game because of a sore right ankle. ... Kevin Porter Jr. sat out for a fifth straight game with a sprained left ankle. \n\n\r\n                    Clippers: Serge Ibaka returned after missing 30 games with lower back tightness. He had 15 points, seven rebounds and four assists in 17 minutes. “I liked what I saw from Serge,\" Lue said. “I think having Rajon on the floor with Serge helped out.\" ... Cousins scored 13 points off the bench. \n\n\r\n                    GOODBYE BILL \n\n\r\n                    Friday night was the last game as play-by-play announcer for Bill Worrell, who has worked on the team’s television broadcast for 39 years. \n\n\r\n                    Worrell will serve as a special contributor for AT&T SportsNet next season before retiring but will no longer do play-by-play for the broadcasts. \n\n\r\n                    Worrell was honored with a video tribute during a timeout in Friday’s game and Hall of Famer Hakeem Olajuwon recorded a video message thanking Worrell for his years of work with the Rockets. \n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: End the season Sunday night at Atlanta. \n\n\r\n                    Clippers: Wrap up the regular season Sunday night at Oklahoma City. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997658.853585
}