{
  "game_id": "0021600507",
  "espn_id": "400899949",
  "date": "Dec 31, 2016",
  "matchup": "OKC vs. LAC",
  "headline": "Westbrook leads Thunder past Clippers 114-88",
  "body": "OKLAHOMA CITY --  Russell Westbrook and Oklahoma City bounced back nicely from an ugly loss at Memphis.\n\nWestbrook had 17 points, 14 assists and 12 rebounds for his NBA-best 16th triple-double of the season, leading the Thunder to a 114-88 victory over the depleted Los Angeles Clippers on Saturday night.\n\nWestbrook played just 28 minutes as Oklahoma City put away Los Angeles with a big first half. Enes Kanter had 23 points and eight rebounds, and Victor Oladipo added 15 points.\n\nThe Thunder lost 114-80 to the Grizzlies on Thursday night, with Westbrook going 6 for 19 from the field and committing six turnovers before he was ejected when he was whistled for two technical fouls with 6:41 left in the third.\n\nBut they managed to turn it around in a hurry against Los Angeles.\n\n\"Obviously tonight they were undermanned and without a few key guys,\" Thunder coach Billy Donovan said. \"I thought coming out of the Memphis game there were some things we talked about wanting to do better and I thought we did that tonight.\"\n\nOladipo was 4 for 9 from the field and 5 for 5 at the free-throw line in his return from a right wrist injury.\n\n\"It was good. The pace was high,\" Westbrook said. \"Vic was wonderful. The opportunity of having another ball handler in the game, being able to carry out different plays for our team, it was good.\"\n\nThe Clippers played without Chris Paul, who was sidelined by a hamstring injury, and Blake Griffin, who is recovering from right knee surgery. Brandon Bass and Marreese Speights each had 18 points, and Austin Rivers finished with 14 on 3-for-11 shooting.\n\nOladipo and Kanter each had nine points in the first quarter as Oklahoma City jumped out to a 33-12 lead. Alex Abrines drilled a half-court shot at the halftime buzzer, giving the Thunder a 69-40 lead at the break.\n\nTIP-INS\n\nClippers: C DeAndre Jordan finished with nine points and 11 rebounds. ... Los Angeles shot 41 percent (31 for 75) from the field.\n\nThunder: Abrines had 12 points, and Steven Adams scored 11.\n\nUP NEXT\n\nClippers: Host the Phoenix Suns on Monday night.\n\nThunder: Travel to Milwaukee to take on the Bucks on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995297.774322
}