{
  "game_id": "0021600513",
  "espn_id": "400899410",
  "date": "Jan 02, 2017",
  "matchup": "MIL vs. OKC",
  "headline": "Brogdon's free throws seal Bucks' 98-94 win over Thunder",
  "body": "MILWAUKEE --  Milwaukee's Tony Snell didn't score a point Monday night. He still made the biggest play of the game for the Milwaukee Bucks.\n\nGiannis Antetokounmpo had 26 points and 10 rebounds and rookie Malcolm Brogdon hit two free throws with eight seconds left, lifting the Bucks over the Oklahoma City Thunder 98-94.\n\nWith Milwaukee leading 96-94, Oklahoma City's Russell Westbrook sprinted down the lane, but Snell deflected the ball off the Thunder guard's leg, knocking it out of bounds with 8.8 seconds left.\n\n\"He blew right past me, but I had a little tip of the basketball, it got his knee and I got lucky on that one,\" Snell said.\n\nOklahoma City coach Billy Donovan didn't call a timeout before Westbrook's sprint down the lane.\n\n\"Russell had a good head of steam and he could get in the lane, especially with where Snell was picking him up because he was backpedaling,\" Donovan said. \"He got around him. I guess Snell got a piece of the ball.\"\n\nBrogdon then was fouled and made both free throws to seal it.\n\nSnell for much of the game drew the defensive assignment on Westbrook, who led Oklahoma City with 30 points and six assists but made only 3 of 17 shots in the second half. He was 9 of 28 overall, including 2 of 10 on 3-point shots.\n\nSnell began the preseason with Chicago, but Milwaukee sent guard Michael Carter-Williams to the Bulls in a trade for the shooting guard after Khris Middleton went down with an injury. Snell can't match Middleton's scoring -- he led the Bucks with 18.2 points per game last year -- but is a strong defender.\n\n\"We've got to give our props to Tony,\" Antetokounmpo said. \"Great job. He's doing the little things. I hope people see that, too. He's a winner.\"\n\nAntetokounmpo had five assists, including when he drove the lane and passed to John Henson for a layup, giving Milwaukee a 96-94 lead with 54 seconds to go.\n\n\"When I'm aggressive and I'm going to the paint, I draw a lot of crowd,\" Antetokounmpo said.\n\nTwice late in the fourth quarter, Antetokounmpo attacked the rim and was double-teamed.\n\n\"Then I realized John was going to be open,\" he said.\n\nSteven Adams scored 20 points and Victor Oladipo added 18 for Oklahoma City, which had won five of six coming into the game.\n\n\"We've been in positions like that and come up on the other end with a win, so we just need to continue to keep growing and keep getting better,\" Oladipo said.\n\nParker scored 19 points and Greg Monroe added 15 off the bench. Brogdon, making his third start, had 12 points but only made 3 of 12 shots.\n\nTIP-INS\n\nThunder: The team assigned G Cameron Payne to the Oklahoma City Blue of the Development League. Payne fractured the fifth metatarsal in his right foot during the preseason and hasn't played in an NBA game this season. ... The team plays 12 of 15 games on the road this month. ... The team made 11 consecutive shots to open the game, but missed 11 consecutive shots in the third quarter.\n\nBucks: Starting G Matthew Dellavedova missed his third consecutive game with a strained right hamstring. ... The Milwaukee crowd booed when Westbrook hit a 3-pointer and did Aaron Rodgers' \"Discount Double check\" on the court with a big smile.\n\nREPLAY GETS IT RIGHT\n\nWhen Westbrook drove down the lane and lost the ball off his leg, the referees initially signaled the ball went off Snell. After a video review, they reversed the call and gave Milwaukee possession.\n\nKIDD ON TRIPLE-DOUBLES\n\nBucks coach Jason Kidd is third on the career list with 107 triple-doubles, about twice the 53 that Westbrook has in his career.\n\n\"Russ isn't going out there looking for a triple-double, he's just playing the game,\" Kidd said. \"That's the best thing about it. When you start worrying about how many assists or rebounds you need, that's when the ball starts bouncing the other way.\"\n\nUP NEXT\n\nThunder: At Charlotte on Wednesday night.\n\nBucks: At New York on Wednesday night in the first of back-to-back games with the Knicks.",
  "source": "espn_api",
  "crawled_at": 1764995193.600854
}