{
  "game_id": "0021600497",
  "espn_id": "400899939",
  "date": "Dec 30, 2016",
  "matchup": "MIL @ MIN",
  "headline": "Wiggins, Towns lead Wolves over Bucks, 116-99",
  "body": "MINNEAPOLIS --  The Minnesota Timberwolves and Milwaukee Bucks have two of the most promising groups of young stars in the NBA.\n\nMinnesota's core shined just a little brighter Friday night\n\nAndrew Wiggins scored 31 points and Karl-Anthony Towns had 18 points and 16 rebounds to help the Timberwolves beat the Bucks 116-99.\n\nZach LaVine added 24 points and Shabazz Muhammad had 22 points in 18 minutes off the bench for the Wolves, who shot 55.8 percent from the field and hit 13 of 25 3-pointers. LaVine hit 6 of 9 from deep and Muhammad made 4 of 5 3s to help the Wolves outlast Milwaukee.\n\n\"We want to show that we're the better team with the better young players,\" LaVine said. \"But you've got to respect your opponent at all times. They have great players like we do, but at the end of the day I'm glad we came out with the win.\"\n\nGiannis Antetokounmpo had 25 points, seven rebounds and five assists for the Bucks, who played the first of at least two games without starting point guard Matthew Dellavedova because of a strained hamstring. Jabari Parker scored 20 points for Milwaukee.\n\nParker and Antetokounmpo combined to make 19 of 28 shots, and the Greek Freak had a breathtaking swat against LaVine with the two youngsters one-on-one in the open court.\n\nThe Wolves were just as dynamic, never more than when Towns swatted a shot from Greg Monroe, sprinted the length of the floor and dunked a lob from Wiggins for an 82-66 lead in the third quarter. And Wiggins put the game away with a soaring dunk over Miles Plumlee in the fourth quarter.\n\n\"I'd rather lose to the Bulls than lose to this team,\" Parker said about the 11-22 Wolves. \"It's not against them, but we've got to win these games. We got to. If we want to be good we've got to win these games.\"\n\nTIP-INS\n\nBucks: Milwaukee entered the night leading the league in points in the paint at 50.5 per game. The Bucks outscored Minnesota 54-48 in that category on Friday night. ... Michael Beasley scored 12 points off the bench against his former team.\n\nTimberwolves: Towns had his 23rd double-double of the season, fourth-most in the NBA. ... LaVine had his eighth game with at least five 3s. Only Stephen Curry (10) has more. ... The Timberwolves honored usher Arlene Pitts on her last night before retirement. She has worked Timberwolves games for 23 seasons.\n\nSHABAZZ SHINES\n\nWhen speaking of the Wolves' youngsters, Muhammad is rarely mentioned these days. He's struggled mightily on the defensive end, which has made it difficult for him to earn the confidence of coach Tom Thibodeau. But he finally broke out on Friday night, scored 10 of his 22 points in the first quarter and hit his first four 3-pointers to give the Wolves a huge lift one game after their bench managed just eight points in a loss at Denver.\n\n\"It's relieving to have one of those performances,\" Muhammad said. \"I can definitely build on this one.\"\n\nBIG SHOT\n\nThe Bucks were charging in the fourth quarter, having whittled a 19-point deficit down to 12 when the Wolves inbounded the ball with just 0.3 seconds on the shot clock. LaVine got room, caught the pass and quickly fired a shot that went through, but officials initially ruled a shot clock violation.\n\nAfter a review, it was determined that LaVine did get the shot off in time, giving the Wolves a 101-87 lead.\n\nBROGDON STARTS\n\nBucks rookie Malcolm Brogdon started for Dellavedova, and coach Jason Kidd said the team would need to make no adjustments with the rookie playing instead of the veteran. Kidd said Brogdon was having one of the two best rookie seasons in the league this year alongside Philadelphia's Joel Embiid. The 24-year-old Brogdon was the sixth pick in the second round out of Virginia.\n\n\"He's a special rookie,\" Kidd said.\n\nBrogdon had 11 points, four rebounds and four assists.\n\nUP NEXT\n\nBucks: Milwaukee has another short road trip to Chicago for a game against the Bulls on Saturday, when the Bucks will try to improve to 3-0 against their division rivals this season.\n\nTimberwolves: Minnesota stays at home to host the Portland Trail Blazers on Sunday, but may avoid star PG Damian Lillard, who has been hampered by an ankle injury.",
  "source": "espn_api",
  "crawled_at": 1764995195.0792892
}