{
  "game_id": "0021600647",
  "espn_id": "400900068",
  "date": "Jan 20, 2017",
  "matchup": "CHI @ ATL",
  "headline": "Schroder, Millsap pace Hawks' 102-93 win over Bulls",
  "body": "ATLANTA --  Dennis Schroder thought his night was over with the Atlanta Hawks leading by 30 points late in the third quarter.\n\nHe headed to the bench to watch the entire fourth quarter, only to get called into emergency duty for one hurried last minute.\n\n\"A win is a win,\" the fourth-year point guard said. \"We played great the first three quarters. The fourth quarter -- it happens. We were relaxing a little bit.\"\n\nSchroder scored 23 points, Paul Millsap added 14 and the Hawks held back a late scare to beat the Chicago Bulls 102-93 on Friday night.\n\nDwight Howard and Thabo Sefolosha combined by 24 points for Atlanta, which has won 10 of 12.\n\nThe Bulls put up little resistance all night until their reserves outscored Atlanta's backups 37-8 from the last minute of the third quarter until the last minute of the fourth. The run ended when Bobby Portis' dunk cut the lead to 95-90 with 1:08 remaining.\n\nChicago trailed by 22 at the end of the first, by 29 at the end of the second and 30 at the end of the third.\n\nAtlanta's lead was tenuous enough that Hawks coach Mike Budenholzer brought back Millsap with 1:56 remaining and Schroder with 1:34. Schroder hit a jumper to make it 97-90 and Millsap pulled down a defensive rebound that led to a 10-point lead.\n\nJimmy Butler finished with 19 points for the Bulls, who looked uninspired most of the night. They have dropped five of seven.\n\n\"We need to come out better, man,\" Butler said. \"We need to start playing better from the jump, a full 48 minutes. It's terrible basketball. That's not the way we're supposed to play, man. It's so disappointing.\"\n\nFor the Hawks, the outcome was the exact opposite from Wednesday's blowout loss at Detroit. The Hawks trailed by 24 in the first and never recovered.\n\n\"I thought the focus and effort were very good,\" Budenholzer said. \"You have a team with character, a team with pride.\"\n\nLeading 22-10 in the first quarter Friday, the Hawks went on a 16-3 run that ended with Malcolm Delaney's 3 early in the second. The lead swelled to 32 on Schroder's 3 early in the third.\n\nChicago missed its first 11 attempts beyond the arc before Butler's 3 cut the lead to 49-26 with 5 minutes left in the second.\n\nAtlanta has won six straight in the series.\n\n\"It's got to be something inside you to want to go out and compete and give yourselves an opportunity to win basketball games,\" Bulls coach Fred Hoiberg said. \"Tonight's effort, we didn't allow that.\"\n\nDOUBLE WHISTLE\n\nHoward and Bulls C Robin Lopez each received a technical foul late in the third.\n\nLopez laid a hard foul on Howard, who took exception and used his shoulder to lean into Lopez's shoulder and push Lopez back as he walked slowly to the free throw line. Lopez stood on the side of the lane for the first foul shot and was whistled for the technical as he and Howard kept jabbering at each other.\n\nLopez left the game and sat on the floor near the Bulls' bench. Howard left a minute later. Neither played in the fourth.\n\nTIP-INS\n\nBulls: There were a few thousand Bulls fans among the announced crowd of 16,328. One of the few chances they had to cheer was on Butler's alley-oop feed to Dwyane Wade for a third-quarter dunk. That was as good as it got until Portis jammed late in the game. Wade, a 12-time All-Star in his first season with Chicago, scored four points on 2-for-10 shooting. ... Portis and Paul Zipser each scored 10 points. Jerian Grant had 12.\n\nHawks: The 29-point halftime lead was a season high. ... The 13 points allowed tied a season low in the first quarter. ... Budenholzer wouldn't speculate when F Mike Muscala will return after missing three straight games with a sprained left ankle.\n\nUP NEXT\n\nBulls: host Sacramento on Saturday. Chicago has won eight of nine against the Kings.\n\nHawks: host Philadelphia on Saturday. Atlanta has won 11 of 12 against the 76ers.",
  "source": "espn_api",
  "crawled_at": 1764995052.866116
}