{
  "game_id": "0022100025",
  "espn_id": "401358780",
  "date": "Oct 22, 2021",
  "matchup": "PHX @ LAL",
  "headline": "Dwight, AD downplay confrontation in Lakers' loss to Suns",
  "body": "LOS ANGELES -- — Dwight Howard and Anthony Davis both say their physical confrontation on the Los Angeles Lakers' bench was a momentary disagreement that has already been resolved.\n\n\r\n                    Even if their big men are getting along again, the Lakers have a whole lot more repairing to do.\n\n\r\n                    Chris Paul scored his 20,000th career point on the way to 23 points and 14 assists, and Devin Booker added 14 points in the Phoenix Suns' 115-105 victory over the winless Lakers on Friday night.\n\n\r\n                    The Lakers were incapable of defending Paul or running any effective offensive plays for long stretches while dropping to 0-2 this season, but they lit up social media when Davis and Howard had  a confrontation in the bench area during a first-half timeout.\n\n\r\n                    “We just had a disagreement about something that was happening on the floor,” Howard said. “We’re both very passionate about winning. We didn’t want to lose this game. We got it out of the way. We’re grown men. Things happen. But we already talked. We squashed it. There’s no issues between me and him. And that’s my brother. That’s my teammate.”\n\n\r\n                    The veteran big men's teammates separated them right after Howard fell back to the bench from a brief physical exchange. Davis said the disagreement was about how to play a particular pick-and-roll assignment.\n\n\r\n                    “It's over with,” said Davis, who had 22 points and 14 rebounds. “After the situation happened, me and DH talked about it ... and we left it in the locker room at halftime.”\n\n\r\n                    Paul became the first player in NBA history to pair 20,000 points with 10,000 career assists while the defending Western Conference champions carved up the Lakers, who trailed by 32 points in the third quarter.\n\n\r\n                    LeBron James scored 25 points and Russell Westbrook had 22 points, 11 rebounds and nine assists as Los Angeles dropped to 0-2 so far in its reboot season despite playing decently in the first and final quarters. The Suns were dominant in a nominal rematch of the first-round playoff series last summer won by Phoenix on the way to the NBA Finals.\n\n\r\n                    While the Suns kept their winning core together, the Lakers have 12 new players and a long way to go after their offseason decision to rebuild around just three players from a roster that won a championship a year ago this month.\n\n\r\n                    “There's a process along with building something to become the team you want to become, and I know it firsthand,” James said. “It doesn't happen overnight, as much as you want it. It just takes time, and we'll know when that time is. Right now, we've got to continue to just push.”\n\n\r\n                    During the middle quarters, the Lakers showed more fight off the court than on it while getting outscored by 30 points. Along with the confrontation between Howard and Davis, there was another confrontation between Rajon Rondo and a heckling fan.\n\n\r\n                    “We’re just trying to get it together,” Howard said. “This is our second game. A lot of people are counting us out already. A lot of people laughing at us and joking. But we know what’s on the line. We want to win. We’re very passionate. We want 18 (championships for the Lakers), so we’re not going to stop until we get there.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Landry Shamet played despite right foot soreness, scoring three points in 15 minutes. ... Mikal Bridges scored 21 points and Jae Crowder had 13.\n\n\r\n                    Lakers: Carmelo Anthony scored 16 points. ... Rookie Austin Reaves got his first career basket and his first 3-pointer in the fourth quarter.\n\n\r\n                    CP3 20K + 10K\n\n\r\n                    Paul got his milestone 20,000th point on a free throw in the second quarter. The 36-year-old point guard proudly brought the game ball to his postgame interview.\n\n\r\n                    “Like a kid,” Paul said. “When you get done playing this game, you want to have things to remember things. I'm going to keep this for sure.”\n\n\r\n                    Paul is the 47th player in NBA history to hit that scoring mark, and he is currently fifth in league annals with 10,299 assists. He should pass Mark Jackson (10,334) and Steve Nash (10,335) for third place in assists within the next few games.\n\n\r\n                    THE HEAVE-HO\n\n\r\n                    A fan was ejected from a courtside seat in the third quarter after he exchanged words with Rondo. The veteran point guard pointed out the fan to security, and the fan slapped away Rondo’s hand before security led him out.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: At Portland on Saturday night.\n\n\r\n                    Lakers: Host Memphis on Sunday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764993698.8664498
}