{
  "game_id": "0022300250",
  "espn_id": "401584878",
  "date": "Nov 26, 2023",
  "matchup": "BKN vs. CHI",
  "headline": "Nets hit NBA season-high 25 3-pointers, beat Bulls 118-106",
  "body": "NEW YORK -- — Spencer Dinwiddie scored 24 points and the Brooklyn Nets made an NBA season-best 25 3-pointers in a 118-109 victory over the Chicago Bulls on Sunday night.\n\n\r\n              Lonnie Walker IV and Royce O’Neale each made six 3-pointers and Mikal Bridges had four. The previous high this season was 23 by Dallas at Memphis on Oct. 30. \n\n\r\n              The Nets set a franchise record for any quarter with 11 3-pointers in the second and made 16 in the first half. They finished 25 of 52, falling short of the franchise record of 27 and the NBA mark of 29.\n\n\r\n              “We were making shots tonight,” Brooklyn coach Jacques Vaughn said. “The ball was being sprayed all over the place and so very unselfishly, and we got rewarded for that.”\n\n\r\n              Walker and O’Neale each scored 20 points and Bridges had 15 to help Brooklyn improve to 8-8 and follow its 112-97 victory over Miami on Saturday night with its second straight win. Trendon Watford added 11 points and Cam Johnson 10.\n\n\r\n              “The ball finds energy,” said Walker about himself and O'Neale. “We were shooting well but everyone was shooting, as well. I think the energy as a team, we were all synced up. We were locked in. The game is all about runs. I was hitting. Royce was hitting.\n\n\r\n              \"But we had other players who were playing aggressive, being aggressive, doing the right thing, rebounding, pushing the ball, and the tempo. So collectively we kind of got engaged and picked it up together.” \n\n\r\n              DeMar Derozan led Chicago with 27 points. Coby White scored 23 points, and Zach LaVine and. Patrick Williams added 20 apiece. The Bulls dropped to 5-13 with their fourth straight loss.\n\n\r\n              “I've always talked about adversity and challenges and difficulties,” Chicago coach Billy Donovan said. “And to me, I think there's, one, a lot to learn through adversity and, two, the solution to adversity would not be to shut down. If you do do that, that would be the worst thing to do.” \n\n\r\n              The Bulls had a 36-19 advantage at the end of the first quarter, in which they led by as much as 21. The Nets outscored the Bulls 44-19 in the second quarter and led 63-55 at halftime. The positive 25-point differential was the most in any second quarter in team history, and the 44 points the second-most in a second quarter in franchise history. \n\n\r\n              “Obviously 25 3s is a lot of 3s,” Donovan said. “It’s hard to overcome when a team makes 25 3s. Give them credit. They were shots that they made through good ball movement, good offense by them to find those other shots that we probably didn’t communicate well enough and didn’t contest well enough. So (it) probably lies somewhere in the middle there. I know there’s a lot more that we could have done.”\n\n\r\n              Brooklyn was short-handed, playing without Nic Claxton (sprained left ankle), Ben Simmons (impinged left lower back nerve), Cal Thomas (sprained left ankle) and Dennis Smith Jr. (sprained lower back).\n\n\r\n              UP NEXT:\n\n\r\n              Bulls: At Boston on Tuesday night in the NBA In-Season Tournament.\n\n\r\n              Nets: Host Toronto on Tuesday night in the NBA In-Season Tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996608.812971
}