{
  "game_id": "0021900014",
  "espn_id": "401160656",
  "date": "Oct 24, 2019",
  "matchup": "DET vs. ATL",
  "headline": "Trae Young has 38 points, Hawks beat Pistons 117-110",
  "body": "DETROIT --  Trae Young feels like a veteran as he enters his second NBA season.\n\nThat'sbad news for the rest of the league.\n\nYoung had 38 points and nine assists and the Atlanta Hawks opened the season with a 117-100 victory over the Detroit Pistons on Thursday night.\n\n\"I'm a lot more comfortable than I was at this point last year,\" Young said. \"Obviously, I'm not a rookie anymore and I felt great out there tonight. Once I hit a couple shots, I knew it was rolling.\"\n\nIf anyone at Little Caesars Arena doubted how good Young was feeling, he made it clear midway through the second quarter, hitting a 3-pointer from the edge of the Pistons logo at half court.\n\n\"I knew it was deep, but I didn't realize I was on the logo until someone told me at halftime,\" he said. \"Ever since high school, I've known when I was in range and let it go.\"\n\nJohn Collins added 20 points and 10 rebounds, and Jabari Parker had 18 points.\n\nVince Carter checked in for Atlanta with 6:52 left in the first quarter, becoming the first player to see action in 22 NBA seasons.\n\n\"Vince stabilizes this team,\" Hawks coach Lloyd Pierce said. \"Our starting lineup has about half as many years as he does, and we've got a bunch of guys who weren't even born when he started. He didn't have a basket tonight, but the boxscore can't show you everything he did to help us win.\"\n\nDerrick Rose led Detroit with 27 points, and Andre Drummond had 21 points and 12 rebounds.\n\nDrummond had 32 points and 23 rebounds in Detroit's season-opening victory on Wednesday in Indiana, but the Hawks scored 60 points in the paint.\n\n\"I thought we came out tonight with a laissez-faire attitude defensively, and they took the game to us,\" Pistons coach Dwane Casey said. \"We had a good game last night, but that didn't mean a hill of beans tonight.\"\n\nDrummond, who played 78 minutes in just over 24 hours, didn't think that was the problem.\n\n\"I really didn't have time to ease myself into the game, but this was just a tough night for us overall,\" he said. \"We're NBA players. There's no excuse for the way we started the game.\"\n\nYoung's four-point play with 3:43 left in the first half gave him 26 points -- the highest-scoring half of his career -- and put the Hawks up 58-51.\n\nRose, though, scored 15 points in the half and Langston Galloway's late 3-pointer gave Detroit a 63-60 halftime lead.\n\nThe teams stayed close for most of the quarter, but back-to-back dunks by Parker -- one over Thon Maker -- put Atlanta up 88-79. Parker added two free throws, giving him 18 points, and the Hawks took a 91-81 lead into the break.\n\nDe'Andre Hunter's 3-pointer extended Atlanta's lead to 97-83 with 8:47 to play. Detroit scored the next four points before the game was delayed for several minutes because of the clock failure.\n\nThe Pistons narrowed the lead to 98-92, but a pair of Rose turnovers helped the Hawks scored the next seven points and take a 13-point lead with 4:47 to play.\n\nDetroit got the margin to single digits, but Young's three-point play with 1:33 wrapped it up.\n\nTIP INS\n\nHAWKS: Carter has played 62 games against Detroit, second only to the 64 he has played against the Boston Celtics. Only 11 players have faced the Pistons more often since the NBA-ABA merger, led by Robert Parish with 90.\n\nPISTONS: PF Blake Griffin (hamstring/knee) is expected to miss three more games before being evaluated for a possible return.\n\nOLD-SCHOOL BASKETBALL\n\nThe teams played without game and shot clocks for three minutes in the fourth period. The time remaining was announced at each stoppage in play and the shot clock was announced at 10 seconds and counted down from five. The clocks returned to the scoreboard for the final six minutes, but the boards above the baskets remained blank.\n\n\"That was disappointing -- I don't know what happened -- but it disrupts the flow of the game when you are looking around to see the clock,\" Casey said.\n\nINJURY UPDATE\n\nReggie Jackson left early in the third quarter due to back tightness. Casey said he will be examined on Friday to see if he can face the Philadelphia 76ers on Saturday.\n\nUP NEXT\n\nHawks: Host Orlando on Saturday night.\n\nPistons: Host Philadelphia on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996313.927395
}