{
  "game_id": "0022400972",
  "espn_id": "401705538",
  "date": "Mar 15, 2025",
  "matchup": "MIL vs. IND",
  "headline": "Bucks take big lead and then hang on down the stretch to beat Pacers 126-119",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 34 points, 10 rebounds and seven assists before fouling out and the Milwaukee Bucks defeated the Indiana Pacers 126-119 on Saturday night.\n\n\r\n              After trailing 105-84 with 11 minutes left, Indiana made a frantic comeback and cut Milwaukee’s lead to 122-119 on Andrew Nembhard’s 3-pointer with 12.5 seconds remaining. The Bucks had led 117-106 when Antetokounmpo fouled out with 2:46 left.\n\n\r\n              Taurean Prince and Kevin Porter Jr. went 4 of 4 on free-throw attempts down the stretch to preserve the Bucks' victory.\n\n\r\n              Damian Lillard added 25 points, 10 rebounds and eight assists as the Bucks (38-28) took a one-game lead over Indiana in the race for fourth place in the Eastern Conference standings and home-court advantage in the first round of the playoffs. \n\n\r\n              The Bucks went 3-1 against the Pacers this season and would own the head-to-head tiebreaker if they end up with the same record.\n\n\r\n              Aaron Nesmith scored 30, Pascal Siakam 26 and Tyrese Haliburton 24 for the Pacers. Haliburton also had 15 assists to match his season high.\n\n\r\n              The two teams were meeting four nights after Haliburton’s four-point play with 3.4 seconds left gave the Pacers a 115-114 victory over the Bucks in Indiana. That created a playoff-type atmosphere Saturday with a spirited crowd frequently booing the Pacers.\n\n\r\n              Takeaways\r\n              Pacers: Playing one night after a 112-100 triumph at Philadephia, the Pacers could have let up after falling behind by 21 in the fourth quarter. They instead made this one come down to the wire.\n\n\r\n              Bucks: Milwaukee has won two straight games to bounce back from a three-game skid\n\n\r\n              Key moments\r\n              Prince made a few big plays down the stretch to help the Bucks survive. He made a 3-pointer with 1:50 left after Indiana cut the lead to six. Prince also went 4 of 4 from the foul line over the final 18.2 seconds.\n\n\r\n              Key stat\r\n              Milwaukee shot 54.4% to help the Bucks withstand 15 turnovers.\n\n\r\n              Up next\r\n              The Bucks host the West-leading Oklahoma City Thunder on Sunday. The Pacers visit the Minnesota Timberwolves on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997824.1231701
}