{
  "game_id": "401810166",
  "espn_id": "401810166",
  "date": "Dec 01, 2025",
  "matchup": "WSH vs MIL",
  "headline": "McCollum and Middleton lead the Wizards to a 129-126 win over Milwaukee despite Porter's 30 points",
  "body": "WASHINGTON -- — CJ McCollum scored 28 points, including a 3-pointer with 14.4 seconds remaining that helped the Washington Wizards outlast the Milwaukee Bucks 129-126 on Monday night.\n\n\r\n              The Wizards (3-16) have won two of three following a 14-game losing streak, and Milwaukee only managed a split in two games against Washington and Brooklyn — two of the NBA's worst teams.\n\n\r\n              It was tied at 115 after former Bucks standout Khris Middleton made a 3-pointer for Washington. Then Giannis Antetokounmpo nearly lost control of the ball while being fouled on a drive, but managed to flip it up and in for a three-point play with 3:36 to play. Then Antetokounmpo slammed down an alley-oop on Milwaukee’s next possession.\n\n\r\n              The Wizards battled back, however, taking a two-point lead on Middleton's 3-pointer with 52.2 seconds remaining. Antetokounmpo — who was called for a violation in the first half for not shooting a free throw quickly enough — was fouled with 39.3 seconds left and made one of two. Then McCollum stepped back and sank a 3-pointer at the end of the shot clock to make it 127-123.\n\n\r\n              Bilal Coulibaly stole the ball and dunked with 5.4 seconds left, pushing the lead to six and drawing Antetokounmpo's sixth foul.\n\n\r\n              Kevin Porter Jr. scored 30 points for Milwaukee in his second game back from knee surgery. This was only the third game all season for Porter, who dealt with a sprained ankle and then a meniscus tear in his right knee. He scored 13 points against Brooklyn on Saturday.\n\n\r\n              Milwaukee led 81-65 in the third before Washington rallied to tie it before the quarter was over.\n\n\r\n              Antetokounmpo scored 26 points but went just 6 of 11 from the line.\n\n\r\n              Up next\r\n              Bucks: Host Detroit on Wednesday night.\n\n\r\n              Wizards: At Philadelphia on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042729.533115
}