{
  "game_id": "0021600038",
  "espn_id": "400899488",
  "date": "Oct 30, 2016",
  "matchup": "MIL @ DET",
  "headline": "Drummond's big night leads Pistons over Bucks 98-83",
  "body": "AUBURN HILLS, Mich. --  Andre Drummond finished with another flashy stat line, and coach Stan Van Gundy felt the 7-footer's contributions went well beyond the numbers.\n\n\"He's just been really willing offensively to give himself up. He knows the attention he draws and he has been willing to do that,\" Van Gundy said. \"That's frustrating at times, but he's still getting shots -- a lot of them are offensive rebounds, I understand that, but he's still getting the ball down there and getting a chance to score.\"\n\nDrummond had 20 points and 23 rebounds, helping the Detroit Pistons cruise to a 98-83 victory over the Milwaukee Bucks on Sunday night. Kentavious Caldwell-Pope added 21 points for the Pistons, who scored seven straight points in the final minute of the third quarter to build a 10-point lead.\n\nDrummond reached 20 rebounds for a second consecutive game, and this was his 10th career game with at least 20 points and 20 rebounds.\n\n\"I worked hard this summer on all aspects of my game,\" Drummond said. \"The work is just showing.\"\n\nTobias Harris scored 16 points for Detroit, and Marcus Morris and Ish Smith added 11 each. Giannis Antetokounmpo led the Bucks with 17.\n\nMilwaukee never led in the second half.\n\nDetroit lost its opener at Toronto but has bounced back with double-digit victories at home over Orlando and Milwaukee.\n\nDetroit led 68-65 late in the third before finishing the quarter with a flourish. A 3-pointer by Caldwell-Pope was followed by a dunk from Harris that put the Pistons up 75-65.\n\n\"I thought that the best thing of the game was we played a pretty low-energy third quarter for the first nine minutes of it, but then we got right back in the game,\" Van Gundy said. \"We responded well to that and opened it back up to double figures, basically, with our defense the last three minutes of the quarter and getting out in transition. There were a lot of things to be really happy with.\"\n\nDrummond's put-back dunk in the fourth made it 88-75.\n\n\"They made a few runs, but we didn't do a good job trying to stop their momentum and get it back within reach,\" Bucks guard Matthew Dellavedova said. \"We'd have a play or two where we wouldn't come up with a loose ball or they would get a rebound and pull away again. I felt like we were always chasing them on the scoreboard and we couldn't really get back level or get up.\"\n\nThe Pistons led 24-21 after the first quarter. An early 8-0 run in the second pushed the lead to double digits, and it was 50-39 at halftime.\n\nTIP-INS\n\nBucks: Greg Monroe, in his second season with Milwaukee after leaving the Pistons, scored 11 points. ... Khris Middleton, another former Piston, is out because of a hamstring injury.\n\nPistons: Detroit is without PG Reggie Jackson (knee), and Smith, his replacement, went 5 of 17 from the field. But all five starters for the Pistons scored in double figures. Smith had seven assists. ... Drummond had eight offensive rebounds.\n\nSHUT DOWN\n\nDetroit won easily despite shooting only 44 percent from the field. The Pistons held Milwaukee to 39 percent and outrebounded the Bucks 58-40.\n\nOVERWHELMED\n\nMilwaukee finished with season lows in rebounds (40) and defensive rebounds (30). Drummond's presence was a big reason for that.\n\n\"Drummond is an All-Star and he understands his role,\" Milwaukee coach Jason Kidd said. \"He plays his role every night. He's going to score, get to the free-throw line, make or miss. When his team misses shots, he's right there for offensive rebounds.\"\n\nUP NEXT\n\nBucks: Visit New Orleans on Tuesday night.\n\nPistons: Finish a three-game homestand when they host New York on Tuesday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764995232.186943
}