{
  "game_id": "0021800081",
  "espn_id": "401070762",
  "date": "Oct 27, 2018",
  "matchup": "MIL vs. ORL",
  "headline": "Giannis Antetokounmpo has 21 as Bucks rout Magic 113-91",
  "body": "MILWAUKEE --  The Milwaukee Bucks proved they could thrive, at least temporarily, without their franchise player.\n\nWith Giannis Antetokounmpo sidelined to start the second half while being evaluated for a possible concussion, the Bucks built a big third-quarter lead and cruised to a 113-91 win over the Orlando Magic on Saturday night.\n\nThe Bucks have won six consecutive games to start the season, one shy of the record set by the 1971-72 team. The win sets up a Monday night showdown in Milwaukee with the Toronto Raptors, the league's only other unbeaten team.\n\nAntetokounmpo, who finished with 21 points in a season-low 19 minutes, fell to the floor underneath the basket midway through the first quarter after catching an elbow from the Magic's Aaron Gordon.\n\n\"I just got hit in the head,\" Antetokounmpo said. \"I tried to block the shot. I fell down. I don't remember much after that. I have to be careful with that. We did some (concussion) tests in the second quarter and some additional tests in the third quarter.\"\n\nWhen asked what he remembered about the play, Antetokoumpo said he was \"probably knocked out.\"\n\n\"I just remember the hit. But I'm fine,\" he said.\n\nMilwaukee coach Mike Budenholzer noted that Antetokounmpo continued to play close to his normal minutes in the first half after the blow to the head before being sent back to the locker room to undergo further tests after halftime. Antetokounmpo played 3 minutes in the fourth quarter.\n\n\"We just wanted to be extra cautious, make sure everything was OK and give him an extra look,\" Budenholzer said.\n\nGordon described Antetokounmpo as \"tough\" for coming back out on the court.\n\n\"He is resilient. I hit him with the elbow, unintentionally,\" Gordon said. \"It was hard. Props to him for coming back into the game.\"\n\nKhris Middleton added 18 points and Malcolm Brogdon scored 16 for the Bucks, who were coming off a 125-95 blowout of the Minnesota Timberwolves on the road on Friday night in which they made 19 3-pointers on 46 attempts, both season highs.\n\nMilwaukee connected on just 10 of 30 shots from long range against the Magic.\n\nNikola Vucevic had 16 points and nine rebounds for Orlando. D.J. Augustin added 11, all in the first half. The Magic shot 32 percent from the field overall and 23 percent from 3-point range.\n\n\"We didn't do a good job playing our game tonight,\" Vucevic said.\n\nThe Magic attempted a franchise-record 43 3-pointers and made 10.\n\n\"It is part of our game plan to have a lot of us shooting 3s and space the floor,\" Vucevic said. \"Our 3s tonight weren't exactly good ones. You can't just shoot any shot. You've got to make sure you work for the right one.\"\n\nAfter a tightly contested first quarter in which Orlando led by five at one point, the Bucks took control in the second and built a 14-point lead at the half. Antetokounmpo had 15 first-half points, while Middleton had 12.\n\nMilwaukee's lead grew to 26 in the third with Antetokoumpo on the bench for the entire period. The Bucks closed the quarter on an 11-1 run and headed to the fourth with a 93-68 lead.\n\nLESS WEAR AND TEAR\n\nAlthough it took a shot to the head to keep him off the court on Saturday night, Antetokounmpo only logged 23 minutes of playing time on Friday night in the blowout win. He said he appreciates the rest during back-to-back games.\n\n\"I know when I'm 40 and I'm retired, I'm going to be able to chase my kids and I'm still going to have my knees and I'm not going to look for knees on eBay,\" Antetokounmpo said.\n\nTIP-INS\n\nMagic: Didn't lead after first quarter. ... The Bucks' high-powered offense is getting a lot of attention, but Orlando coach Steve Clifford sees another reason for Milwaukee's early-season success. \"To me, their offense is one thing, but they were a top-10 offensive team last year,\" Clifford said. \"It's the defense though that is making a bigger difference.\"\n\nBucks: Rookie Donte DiVincenzo had a season-best 15 points, including back-to-back baskets late in the third quarter, topping his previous high of nine points set Friday night. .Ersan Ilyasova pulled down 10 rebounds. ... Budenholzer called a timeout with a 27-point lead late in fourth quarter after his team surrendered an easy basket.\n\nUP NEXT\n\nMagic: Host Sacramento on Tuesday.\n\nBucks: Host Toronto on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994533.1531909
}