{
  "game_id": "0021500549",
  "espn_id": "400828436",
  "date": "Jan 08, 2016",
  "matchup": "OKC @ LAL",
  "headline": "Lakers' Lou Williams scores 23 of 44 in fourth, but OKC too much",
  "body": "LOS ANGELES -- Kevin Durant and Russell Westbrook have dominated plenty of fourth quarters in their day. When Lou Williams dropped 23 points in the final period for the Lakers, Oklahoma City's stars were just grateful Kobe Bryant wasn't able to help him out.\nWestbrook had 36 points, 12 rebounds and seven assists, and the Thunder barely survived Williams' 44-point performance for a 117-113 victory over the Los Angeles Lakers on Friday night.\nDurant scored 24 points in the Thunder's 15th victory in 18 games. The streaky, smooth-shooting Williams still put an extraordinary scare into Oklahoma City with a series of fallaway jumpers, pull-up baskets and other clever shots that had Staples Center fans on their feet.\n\"He's been a scorer since he came out of the womb,\" Durant said. \"He hit four or five shots falling out of bounds in the corner, and then he hit some transition 3s. It wasn't like our defense was bad. He made shots tonight.\"\n\nWilliams had all but five of the Lakers' points during a frenetic final period, and he put the Lakers up 110-107 on three free throws with 1:58 to play before Westbrook got a three-point play and an assist on Steven Adams' go-ahead dunk.\nWilliams didn't get the Lakers' potential tying shot: Coach Byron Scott's final play could have gone to Bryant or Williams, but Bryant took charge and missed an 8-foot runner over Durant with 4 seconds left.\n\"It's just how the game went,\" Williams said. \"The first game of the year I played here, Kobe was comfortable enough to give me the ball for the game winner. Tonight he takes the game winner. Last night I took one. Some nights he is going to take those shots, and we live with the results either way.\"\nJordan Clarkson hit a last-minute 3-pointer while contributing 17 points for the Lakers, who have lost three straight to drop to a Western Conference-worst 8-30.\nNO CALL\nBryant, who had 19 points while playing in back-to-back games despite an ailing right shoulder, believed Durant fouled him. \"It's not a matter of opinion,\" Bryant said. \"You watch the play, and he hit me on the forearm right at the end of my release, which is why the ball went short. It is what it is, but it's basketball.\"\nSWEET LOU\nWilliams had the highest-scoring game of his 11-year NBA career, dropping 17 points in the first eight minutes of the fourth to close the gap. \"Man, he got in a great groove,\" Bryant said. \"His pull-up jumper started working and he got to the basket, drawing contact. He just got in a fantastic rhythm.\"\nKEEPING IT TIGHT\nAt least the Lakers avoided a third straight blowout loss to the Thunder in three weeks.\nOklahoma City beat the Lakers by a combined 75 points in two meetings last month, including a 35-point humiliation at Staples Center two weeks ago. Oklahoma City has won seven straight over the lowly Lakers, including four straight at Staples.\nD'ANGELO'S INJURY\nLakers rookie D'Angelo Russell played eight minutes and scored two points before going to the locker room for good in the second quarter. The No. 2 overall pick injured his ankle Thursday in Sacramento after scoring a career-high 27 points, and he tried to play through the discomfort before leaving.\nTIP-INS\nThunder: Oklahoma City improved to 18-3 against the West. ... Durant passed Lakers great James Worthy during the third quarter for 96th place on the NBA's career scoring list.\nLakers: Williams had the Lakers' first 40-point game since Bryant did it in November 2014. ... Julius Randle had another rough shooting night, going 1-for-7. He also played solid defense and grabbed eight rebounds before fouling out with 2:32 to play.\nUP NEXT\nThunder: At Portland on Sunday.\nLakers: Host Utah on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994177.934305
}