{
  "game_id": "0022400373",
  "espn_id": "401704939",
  "date": "Dec 20, 2024",
  "matchup": "CHA @ PHI",
  "headline": "Embiid scores 34 points in return, helping the 76ers beat the Hornets 108-98",
  "body": "PHILADELPHIA -- — Joel Embiid had 34 points and nine assists after missing a game because of a sinus fracture, helping the Philadelphia 76ers beat the Charlotte Hornets 108-98 on Friday night.\n\n\r\n              Wearing a protective “ Phantom of the Opera ” mask, Embiid was introduced to a roaring ovation.\n\n\r\n              Embiid scored 22 points in the first three quarters to lead the 76ers to their fourth win in five games. Philadelphia is still well under .500 at 9-16 but a recent hot streak has it at least within striking distance of a play-in tournament berth.\n\n\r\n              Embiid has been ravaged by injuries this season and has only played in seven games, mostly due to knee soreness.\n\n\r\n              Vasilije Micic led the Hornets with 20 points. They lost their fourth straight game and have lost for the 12th time in 13 games.\n\n\r\n              Takeaways\r\n              Charlotte: LaMelo Ball sat out as the Hornets manage his injured left calf. The Hornets are being cautious with how they handle Ball, who had 34 points and 13 assists a night earlier in a loss at Washington.\n\n\r\n              76ers: Tyrese Maxey scored 23 points and Paul George had five points and 10 rebounds. The heralded Big Three of All-Stars Embiid, Maxey and George started a game together for only the fourth time this season.\n\n\r\n              Key moment\r\n              The 76ers went wild in the first quarter. Maxey hit four 3s and the 76ers shot 56% overall from the floor to race to an 18-point lead.\n\n\r\n              Key stat\r\n              Kelly Oubre Jr. scored 22 points for Philadelphia. He combined with Maxey to hit eight of the 76ers' 12 3-pointers.\n\n\r\n              Up next\r\n              Charlotte hosts Houston on Monday, while the 76ers play Saturday at Cleveland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997712.663255
}