{
  "game_id": "0021800752",
  "espn_id": "401071425",
  "date": "Jan 29, 2019",
  "matchup": "BKN vs. CHI",
  "headline": "Russell scores 30, Nets beat Bulls for 9th straight at home",
  "body": "NEW YORK --  D'Angelo Russell credits Brooklyn coach Kenny Atkinson for giving him an extra push this season.\n\nA night after being benched for the entire fourth quarter during a tough loss at Boston, the Nets point guard stepped up with an impressive second-half performance.\n\nRussell scored 24 of his 30 points over the final two quarters, Shabazz Napier had 24 off the bench and the Nets beat the Chicago Bulls 122-117 on Tuesday night for their ninth straight win at home.\n\nRondae Hollis-Jefferson had 18 points and Joe Harris had 17 for the Nets, who improved to 28-24 and matched last season's win total.\n\n\"I give him a lot of credit for the teaching moments,\" Russell said about Atkinson, who wasn't pleased with his guard's rebounding effort from the previous night. \"My knowledge and IQ has really rose to another level just from learning from my mistakes and him breaking it down and us (dissecting) the film together.\"\n\nThe Nets, who played their third straight game without injured key reserve guard Spencer Dinwiddie, have won 13 of 14 at Barclays Center and seven of eight overall.\n\nBrooklyn started slow in the first quarter, shooting just 8 for 29 from the field, after losing at Boston on Monday night.\n\nThe Nets trailed by nine at one point and 54-50 at halftime but turned it around after Russell made three straight baskets during a one-minute stretch that bridged the end of the third quarter and the final period.\n\nZach Levine had 26 points and Jabari Parker added 22 points and nine rebounds for the Bulls, who have lost four straight and 10 of 11.\n\nLauri Markkanen had 18 points and a career-high 19 rebounds, each on the defensive end of the court.\n\n\"We need toughness and I think everybody stepped their game up and I am trying to do the same thing,\" Markkanen said.\n\nMarkkanen scored five straight points late in the fourth to inch the Bulls closer 110-106 with 2:18 left.\n\nOn the next possession, Parker blocked DeMarre Carroll's driving layup and Russell was able to recover the ball near the halfcourt area after a Chicago defender tried to scoop it up. Russell's hustle play was capped with a nifty pass to a cutting Harris that made it 112-106.\n\n\"I thought D'Angelo really managed the game well at the end of the game,\" Atkinson said. \"They're double-teaming him, he's getting it out, he's making the right play.\"\n\nTIP INS\n\nBulls: Markkanen is the first NBA player to notch 19 rebounds without tallying an offensive board. DeMarcus Cousins was the last to do so when he pulled down 20 rebounds in 2015.\n\nNets: Napier's five 3-pointers matched a career-high. ... Brooklyn's nine-game winning streak at home is the second-longest active winning streak in the league. Toronto has won its last 10 at home.\n\nGUARDING THE BALL\n\nRussell recorded his league-leading third game this season with at least 30 points, five or more assists and no turnovers. Paul George is up next with two.\n\nUP FOR THE CHALLENGE\n\nBrooklyn rookie F Rodions Kurucs was selected to the Rising Stars game, which will be held Feb. 15, two nights before the All-Star Game in Charlotte.\n\nThe Latvian will be play for the World team. He has been a pleasant surprise for the up-and-coming Nets this season. The 20-year-old is the lowest drafted player chosen to this year's game between the top first- and second-year players.\n\nKurucs entered the night averaging 9.4 points off 49.4 percent shooting from the field in 34 games.\n\nHe will be joined by starting center Jarrett Allen, Brooklyn's first-round pick in the 2017 draft. Allen, who will be on the U.S. squad, is averaging 11.3 points, 8.3 rebounds and 1.5 blocks in 49 games this season.\n\nMarkkanen will represent the Bulls. He has posted 17.1 points and 7.4 rebounds in 27 games after missing the first 18 to start his second season in the league due to a sprained right elbow.\n\nUP NEXT\n\nBulls: Continue a three-game trip Wednesday night in Miami.\n\nNets: Play at San Antonio on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995403.4321458
}