{
  "game_id": "0022000907",
  "espn_id": "401307707",
  "date": "Apr 24, 2021",
  "matchup": "MIA vs. CHI",
  "headline": "Heat waste big lead, then hang on late to beat Bulls 106-101",
  "body": "MIAMI -- — The start was great for the Miami Heat. The finish, not so much.\n\n\r\n                    And the result was just good enough.\n\n\r\n                    Duncan Robinson made seven 3-pointers and scored 23 points, Kendrick Nunn had 22 and the Heat held off a big Chicago rally to beat the Bulls 106-101 on Saturday night.\n\n\r\n                    Bam Adebayo had 20 points and 10 assists for the Heat, and Jimmy Butler added 20 points. Miami never trailed, but saw what was a 24-point lead cut to two in the final moments before hanging on.\n\n\r\n                    “That's as much of a must-win as we've had this year,\" Robinson said.\n\n\r\n                    Coby White scored 31 points for Chicago, and Nikola Vucevic had 26 points and 14 rebounds. The Bulls outscored the Heat 60-45 in the second half, but wound up losing for the seventh time in their last 10 games.\n\n\r\n                    “I think the guys fought and battled,\" Bulls coach Billy Donovan said.\n\n\r\n                    The teams will meet in Miami again Monday. The Heat remained seventh in the Eastern Conference, a half-game behind sixth-place Boston, while Chicago fell 1 1/2 games behind No. 10 Washington in the race for the final play-in berth.\n\n\r\n                    “There was definitely an edge, probably an angst, about trying to do whatever we had to do to get this win tonight,\" Heat coach Erik Spoelstra said. “And that's simply the way it has to be the rest of the year.\"\n\n\r\n                    White made three free throws with 30.3 seconds left, and the Heat turned the ball over on their ensuing possession. White got free for a dunk to get Chicago to 103-101, but Nunn made a pair of free throws and Miami would survived.\n\n\r\n                    The Heat were coming in off a 15-point loss in Atlanta on Friday night, one that cost Miami the tiebreaker with the Hawks and a chance to move up the Eastern Conference playoff standings. And the mandate from Spoelstra was simple: “Bring a much better game,” he said.\n\n\r\n                    It didn’t take long to see that his team was listening — for a half, anyway.\n\n\r\n                    Miami built a 24-point lead in the first half. The only game in which they had a bigger first-half lead all season was Feb. 5 against Washington, when they led by 28 in the second quarter — another game where the Heat were smarting from what they considered a bad loss, that one being a three-point defeat to the Wizards two nights earlier.\n\n\r\n                    It was 61-41 at the half. But the Heat went frigid to start the second half, scoring only 22 points in the first 15 minutes after intermission, and Chicago got as close as three on a 3-pointer from Denzel Valentine with 7 minutes left to end what was a 21-7 spurt by the Bulls to start the final quarter.\n\n\r\n                    “We just started playing poised basketball,\" Valentine said. “We were just taking advantage of mismatches, just playing really smart, and also our energy picked up on the defensive end.\"\n\n\r\n                    The Heat did the same, just in time.\n\n\r\n                    “We don't care if we won by half a point,\" Adebayo said. “As long as there's a ‘W' at the end.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Vucevic is the third player to face Miami four times this season joining Derrick Rose and Norman Powell. No player has more points (103) or rebounds (52) against the Heat in 2020-21 than Vucevic, who played Miami three times when he was with Orlando earlier this season. ... Chicago had 12 fast-break points to Miami's three.\n\n\r\n                    Heat: Goran Dragic (knee), Tyler Herro (foot) and Victor Oladipo (knee) did not play. Dragic and Herro both played on Friday and Oladipo has now missed nine consecutive games. ... This was the start of the ninth two-game, single-city series for the Heat this season. Miami still hasn’t swept one of those, and will get a chance Monday.\n\n\r\n                    MORE ROBINSON\n\n\r\n                    It was the 25th consecutive game in which Robinson has made multiple 3-pointers, breaking his own record set last season. He’s also the third player with multiple games where he’s made six 3’s by halftime this season, joining Golden State’s Stephen Curry and Chicago’s Zach LaVine.\n\n\r\n                    LAVINE UPDATE\n\n\r\n                    Zach LaVine remains in Chicago while dealing with the NBA’s health and safety protocols related to the coronavirus, and the Bulls aren’t sure when he’ll be back. “He’s basically by himself,” said Bulls coach Billy Donovan, noting that LaVine can’t even go to the team facility for workouts yet. “The isolation part of this is really challenging for anybody.”\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996758.027659
}