{
  "game_id": "0022200655",
  "espn_id": "401468810",
  "date": "Jan 15, 2023",
  "matchup": "LAL vs. PHI",
  "headline": "LeBron hits 38K, but Embiid leads 76ers past Lakers 113-112",
  "body": "LOS ANGELES -- — LeBron James became the second player in NBA history to score 38,000 career points, but Joel Embiid had 35 points and 11 rebounds while the Philadelphia 76ers held off the Los Angeles Lakers 113-112 Sunday night for their seventh win in nine games.\n\n\r\n              Russell Westbrook failed to get off a clean shot or a pass in the final second under defense from Embiid, allowing the 76ers to hold on for their fourth straight road win. Westbrook claimed he was fouled by Embiid, who disagreed.\n\n\r\n              James put up 35 points, 10 assists and eight rebounds for the depleted Lakers, who have lost three straight after a five-game winning streak. James surpassed 38,000 points with a jumper that was part of his 8-for-9 start with 16 points in the first quarter.\n\n\r\n              “It's just frustrating to get into those positions and not be able to come out with the victory,” James said. “We got the stop, gave ourselves a chance to win, and didn't execute. ... We're playing good basketball. We're just not winning games.”\n\n\r\n              James Harden added 24 points and 13 assists for Philadelphia, which swept the season series and beat Los Angeles for the sixth straight time.\n\n\r\n              “Wasn't one of our better games, especially defensively,” 76ers coach Doc Rivers said. “We had no pace. We were tired. As a coach, you're saying, ‘Let’s just get to the fourth quarter and see if we can win it.'”\n\n\r\n              Georges Niang hit a 3-pointer on an assist from Embiid with 1:28 left to put Philadelphia up 111-109. A lengthy video review then overruled a call and resulted in a turnover for James before Embiid drained a 14-foot jumper with 45 seconds left.\n\n\r\n              Troy Brown Jr. hit a corner 3-pointer to trim Philly's lead to one point, and Embiid missed a jumper with Westbrook in his face.\n\n\r\n              The Lakers didn't called timeout as Westbrook drove to the hoop with a chance to win it. He couldn't get off a shot or a pass, with an apparent crosscourt pass attempt deflecting off Niang's hands before time ran out.\n\n\r\n              “(Embiid) was grabbing my wrist,” Westbrook said. “I couldn't get my hand up to shoot. ... Couldn't get the ball up. It's frustrating, but I know the game didn't come down to that one shot.”\n\n\r\n              Embiid disagreed with Westbrook's claim about the final possession.\n\n\r\n              “I don't think I fouled him,” Embiid said. “Physical play on both sides. You could've called a foul on the other end, too. He was unlucky because he lost the ball. I would say he was unlucky.”\n\n\r\n              Westbrook had 20 points, 14 rebounds and 11 assists, extending his NBA record with his 198th career triple-double. Westbrook has four triple-doubles off the bench this season, putting him past Detlef Schrempf for the career record for triple-doubles as a reserve.\n\n\r\n              38K\n\n\r\n              James and Kareem Abdul-Jabbar are the only members of the NBA’s 38,000-point club, and James will pass Abdul-Jabbar (38,387 points) atop the career scoring list next month if he remains on his current pace. James didn't want to talk about the milestone afterward.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Rivers used Embiid and the mildly ailing Harden (left heel) and Tobias Harris (left knee) even on the second night of a back-to-back that began in Utah. ... De'Anthony Melton, the San Fernando Valley native and USC product, went scoreless in 21 minutes.\n\n\r\n              Lakers: Anthony Davis has now been out for a month, missing his 15th straight game with a foot injury. ... The Lakers used their 24th different starting lineup this season. ... Patrick Beverley (illness) missed his second straight game. Lonnie Walker (knee) and Austin Reaves (hamstring) are still out.\n\n\r\n              UP NEXT\n\n\r\n              76ers: At Clippers on Tuesday night.\n\n\r\n              Lakers: Host Houston on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994131.003718
}