{
  "game_id": "0022400335",
  "espn_id": "401704901",
  "date": "Dec 06, 2024",
  "matchup": "MIL @ BOS",
  "headline": "Jayson Tatum scores 34, Celtics beat Bucks 111-105 to spoil Khris Middleton's season debut",
  "body": "BOSTON -- — Jayson Tatum had 34 points and 10 rebounds, and the Boston Celtics held on to beat the Bucks 111-105 on Friday night in Khris Middelton's season debut for Milwaukee.\n\n\r\n              Jaylen Brown added 25 points as the Celtics made 17 3-pointers to earn their 10th victory in 11 games.\n\n\r\n              Damian Lillard finished with 31 points for Milwaukee, which has lost two straight since winning a season-best seven in a row. Giannis Antetokounmpo added 30 points and 11 rebounds on his 30th birthday. \n\n\r\n              Middleton had 11 points and five assists in 23 minutes after missing the Bucks’ first 21 games while recovering from offseason ankle surgeries.\n\n\r\n              Boston led 107-102 after a floater by Jrue Holiday when Brown was whistled for a foul on a 3-point attempt by Middleton, who hit all three free throws.\n\n\r\n              Two free throws by Holiday put Boston ahead 109-105. Antetokounmpo then turned it over, leading to a layup by Al Horford.\n\n\r\n              Takeaways\r\n              Bucks: Middleton’s return marked only the 43rd time that he, Antetokounmpo and Lillard have played together. How well the recently surging Bucks can integrate Middleton could determine their prospects of contending in the East.\n\n\r\n              Celtics: This was another statement win for a team that has beaten the Bucks in all three meetings this season.\n\n\r\n              Key moment\r\n              The back-and-forth antics between Antetokounmpo and Brown added another chapter Friday. Early in the third quarter, Antetokounmpo leaned his shoulder into Brown as Antetokounmpo passed by on his way to throw the ball inbounds. Brown then returned the favor he ran up the court and was whistled for a technical foul. The exchange followed a similar incident during Boston’s Nov. 10 win at Milwaukee. \n\n\r\n              Key stat\r\n              The game featured 11 ties and 14 lead changes. Neither team led by more than eight points.\n\n\r\n              Up next\r\n              The Bucks visit Brooklyn on Sunday. The Celtics host Memphis on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997851.87821
}