{
  "game_id": "0022401118",
  "espn_id": "401705684",
  "date": "Apr 04, 2025",
  "matchup": "SAC @ CHA",
  "headline": "Kings beat Hornets 125-102 to maintain hold on 10th spot in the West",
  "body": "CHARLOTTE, N.C. -- — Zach LaVine had 25 points and 10 rebounds, Domantas Sabonis added 24 points, 11 rebounds and seven assists and the Sacramento Kings rolled past the Charlotte Hornets 125-102 on Friday night to remain in 10th place in the Western Conference standings.\n\n\r\n              DeMar DeRozan added 22 points to help the Kings win for only the second time in their last nine games.\n\n\r\n              Sabonis was on pace for his 68th career triple-double before leaving the game with three minutes left in the third quarter after taking a knee to his right thigh. He did not return for his normal rotation in the third quarter with the Kings well in control and the team did not announce any injury.\n\n\r\n              Miles Bridges had 22 points, and Moussa Diabate added 15 points and 11 rebounds for the Hornets.\n\n\r\n              The Kings held a 1/2-game lead over Phoenix Suns for the final spot in the play-in tournament entering the game and wasted little time with the injury-riddled Hornets. Sacramento built a 19-point lead at halftime behind Sabonis, who had 18 points, eight rebounds and six assists at the break. \n\n\r\n              Takeaways\r\n              Kings: Malik Monk scored 17 points on 7-of-12 shooting off the bench against his former team.\n\n\r\n              Hornets: Bridges was the only opening night starter still on the floor for Charlotte. LaMelo Ball and Brandon Miller have already been ruled out for the season, and were joined on the bench by Mark Williams (thoracic muscle spasms) and Josh Green (shoulder soreness). \n\n\r\n              Key moment\r\n              After falling behind 10-4 early, the Kings closed the first quarter on a 22-8 run to take control of the game and were never seriously challenged again.\n\n\r\n              Key stat\r\n              Charlotte's starters were 5 of 24 from 3-point range.\n\n\r\n              Up next\r\n              Both teams are in action Sunday with the Kings visiting the Cavaliers and the Hornets hosting the Bulls. \n\n\r\n              --------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997305.6484952
}