{
  "game_id": "0022200216",
  "espn_id": "401468371",
  "date": "Nov 16, 2022",
  "matchup": "MIL vs. CLE",
  "headline": "Lopez scores 29, Bucks deal Cavs 5th straight loss 113-98",
  "body": "MILWAUKEE -- — Brook Lopez understands that playing alongside Giannis Antetokounmpo is going to create plenty of open looks.\n\n\r\n              His improved 3-point shooting is helping the Milwaukee Bucks' 7-foot center capitalize more than ever.\n\n\r\n              Lopez shot 7 for 9 from 3-point range and scored 29 points as the Bucks beat the skidding Cleveland Cavaliers 113-98 on Wednesday night. \n\n\r\n              “Obviously Giannis is so good, he's going to draw so much attention,\" Lopez said. “The rest of us just have to be ready when we're open. We're going to be open a lot because they load up so much, every team loads up so much. You've just got to be ready to be open, catch it and shoot it.”\n\n\r\n              Lopez has gone 35 of 90 from 3-point range through the first 14 games of the season. He’s shooting 38.9% from beyond the arc and making 2.5 3-pointers per game, putting him on pace to set career highs in both categories.\n\n\r\n              The Cavaliers have lost five straight games since racing to an 8-1 start that included eight straight wins.\n\n\r\n              “Honestly, we’ve got kind of a fat-cat mentality,” Cavaliers coach J.B. Bickerstaff said. “We went out and won eight games in a row,. Everyone was giving us love and praising us and we got really comfortable.\"\n\n\r\n              Antetokounmpo had 16 points, 12 rebounds and eight assists for the Bucks. Jordan Nwora had a season-high 21 points to help the Bucks outscore the Cavaliers 45-20 in bench points. \n\n\r\n              Lopez was one off his career high in 3-pointers. The 7-footer made eight 3-pointers against Miami on Nov. 11, 2018.\n\n\r\n              Donovan Mitchell and Darius Garland each had 23 points and Evan Mobley added 20 for the Cavaliers.\n\n\r\n              Mitchell returned after sitting out one game with a strained right ankle, but the Cavaliers played a second straight game without Jarrett Allen due to a non-COVID illness. Without their All-Star center on the floor, the Cavaliers were outrebounded 52-34 and outscored 21-6 in second-chance points.\n\n\r\n              “We’re not playing winning basketball right now,” Bickerstaff said. “It’s that simple. We have a formula in place that allows us or will allow us to be successful. Holding each other to that (standard) is what we have to do. Right now we are not.”\n\n\r\n              Milwaukee was missing Jrue Holiday (sprained right ankle), Grayson Allen (sprained right ankle) and Wesley Matthews (strained right hamstring). This is the fourth straight game Holiday has missed.\n\n\r\n              The Bucks already are without Khris Middleton (wrist), Pat Connaughton (calf) and Joe Ingles (knee), who have yet to make their season debuts.\n\n\r\n              Bobby Portis had 10 points and 11 rebounds for the Bucks. Jevon Carter added 11 points and eight assists.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Swingman Dylan Windler will miss about four to six more weeks after undergoing a platelet-rich plasma injection on his sprained right ankle. The ankle injury has caused Windler to play just one game this season. \n\n\r\n              Bucks: Connaughton was listed as probable on the initial injury report, but was held out. The 29-year-old guard hasn’t played this season due to strained right calf. ... The Bucks went with a super-sized starting lineup that included a frontcourt of the 6-11, Antetokounmpo, the 7-foot Lopez and the 6-11 Portis. ... A.J. Green returned from a nasal fracture to play his second game of the season and first since Oct. 22.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host the Charlotte Hornets on Friday to begin a four-game homestand. \n\n\r\n              Bucks: At Philadelphia on Wednesday. The Bucks opened the season by winning 90-88 at Philadelphia on Oct. 20.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994599.554631
}