{
  "game_id": "0022300897",
  "espn_id": "401585525",
  "date": "Mar 06, 2024",
  "matchup": "HOU vs. LAC",
  "headline": "Leonard has 28 points as Clippers rally late for 122-116 win over Rockets",
  "body": "HOUSTON -- — Kawhi Leonard had 28 points, and Paul George and James Harden each scored 21 as the Los Angeles Clippers rallied for a 122-116 win over the Houston Rockets on Wednesday night. \n\n\r\n              The Clippers trailed by as many as 20 points and didn’t lead in the second half until there were less than three minutes remaining.\n\n\r\n              “In the first half it was like we were running in mud,” Clippers' coach Tyronn Lue said. “We couldn’t keep up with them. They got out in transition and we just couldn’t get back and get matched. So at halftime we made a strong point about that.”\n\n\r\n              Los Angeles overcame another big night from Houston big man Alperen Sengun, who had 23 points, a season-high 19 rebounds and 14 assists for his fourth career triple-double. It came a night after he scored a career-best 45 points in a win over San Antonio.\n\n\r\n              Jabari Smith Jr.’s 3-pointer got the Rockets within 2 with less than two minutes to go. Norman Powell made one of two free throws for the Clippers before Sengun missed two free throws with just over a minute remaining to leave Houston down 115-112.\n\n\r\n              Fred VanVleet got a technical with 48 seconds left arguing about a foul called on Sengun on a shot attempt by George. He made all three free throws to extend the lead to 118-112 and send the home fans streaming for the exits.\n\n\r\n              Leonard was asked about the difference in his team from the first to second half. \n\n\r\n              “Just coming out with more energy,” he said. “I feel like especially in the first quarter we were sluggish, thinking we were just going to win the game. Then we obviously started picking it up with our energy and started cutting and screening.”\n\n\r\n              Smith added 19 points for Houston and rookie Cam Whitmore had 17.\n\n\r\n              “We guarded well in the first half and didn't in the second half,” Houston coach Ime Udoka said. “Credit to them because they do have three really good scorers that can get it going, but you'd like to have a little more resistance or consistency between the two halves.”\n\n\r\n              The Clippers used an 8-1 run to make it 111-109 and give them their first lead since early in the first quarter with just under three minutes to play. Powell started that run with a 3 and George capped it with another one before pointing to his teammates on the bench.\n\n\r\n              Houston missed a shot after that before Leonard had a 3-point play to extend the lead to 114-109 with two minutes left.\n\n\r\n              Houston led by 10 after a basket by Dillon Brooks early in the fourth quarter before Los Angeles used a 9-4 run to cut the lead to 96-91. Harden led the way in that stretch, scoring seven points.\n\n\r\n              Whitmore made a 3 for the Rockets before an 8-2 run by the Clippers, powered by 3s from George and Leonard cut the lead to 101-99 midway through the quarter.\n\n\r\n              The Rockets were up by 11 with about three minutes left in the third quarter before the Clippers used an 8-1 run to get to 82-78 with about 90 seconds left in the quarter.\n\n\r\n              Sengun and Brooks both made a basket for Houston after that, but Leonard ended the quarter with a jump shot to cut the lead to 86-80 entering the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Chicago Friday night.\n\n\r\n              Rockets: Visit Portland Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995582.8798258
}