{
  "game_id": "0021600670",
  "espn_id": "400900091",
  "date": "Jan 23, 2017",
  "matchup": "MIL vs. HOU",
  "headline": "Antetokounmpo scores 31 in Bucks' 127-114 win over Rockets",
  "body": "MILWAUKEE --  Relegated to a reserve role in his previous game for breaking a team rule, Jabari Parker came out in \"attack mode\" against the Houston Rockets.\n\nHis play inspired teammate Giannis Antetokounmpo.\n\nAntetokounmpo had 31 points, Parker scored 20 of his 28 in the first half and the Milwaukee Bucks snapped a five-game losing streak Monday night with a 127-114 victory over the Rockets.\n\n\"I see my teammate, my brother on the court, my guy, be in attack mode, and I'm like, yeah, this is the night, I've got to be in attack mode, too. We've got to get this one,\" Antetokounmpo said.\n\nJames Harden just missed a triple-double with 26 points, 12 assists and nine rebounds, but committed 11 of Houston's 22 turnovers. Patrick Beverley added 18 points for the Rockets, who fell to 1-1 on their five-game road trip.\n\nMilwaukee made 59 percent of its shots, including 11 of 23 from 3-point range.\n\n\"We had a really good game last game (at Memphis) defensively, and this game we just let up,\" Harden said. \"In order to get where we want to go, we have to be consistent on that end of the floor.\"\n\nAntetokounmpo made 11 of 17 shots and scored nine points in the final 4:16. Houston got no closer than six points in the final three minutes.\n\nParker was back in the starting lineup one game after coming off the bench while being disciplined for talking to the media about a players-only team meeting Friday night.\n\n\"This win really puts us in the right direction, the right mind frame,\" Parker said. \"Hopefully, we can use this as energy toward the next one.\"\n\nJason Terry's 17-foot jumper sparked an 11-0 run that gave Milwaukee the lead for good, 101-99. The Bucks extended the margin to 110-99 when Tony Snell hit a 3-pointer with 6:48 left. Terry had two steals during the spurt and Houston committed four turnovers.\n\n\"We just turned the ball over a little bit carelessly, and they answered on the other end with it,\" Houston's Ryan Anderson said.\n\nGreg Monroe added 17 points and 10 rebounds in 27 minutes off the bench for Milwaukee, which lost 111-92 at Houston last Wednesday.\n\nNene had 17 points, and Clint Capela and Anderson scored 16 apiece for Houston.\n\nThe Rockets scored nine consecutive points to take a 78-77 lead on Capela's dunk with 8:03 left in the third quarter. Milwaukee guard Matthew Dellavedova had 10 points in the quarter, though, and the Bucks led 93-91 heading into the fourth.\n\nThe Bucks made 14 of 18 shots in the second period to open a 68-64 lead at halftime. Milwaukee shot 68 percent (28 for 41) in the first half.\n\nMilwaukee's 68 points before halftime were the most the Rockets have allowed this season, frustrating coach Mike D'Antoni. Parker made eight of 12 shots and had six rebounds and five assists in the first half.\n\n\"He's a handful and once he gets started, it's hard to turn him off,\" D'Antoni said.\n\nLINEUP INTACT\n\nWith Anderson returning from the flu and Capela regaining his starting role, the Rockets used their preferred starting lineup for the first time since Dec. 17 when Capela went out with a broken leg. The lineup of Capela, Anderson, Beverley, Harden and Trevor Ariza went 15-2 through Dec. 17.\n\nDEFENDING HARDEN\n\nParker said the Bucks wanted to keep the ball out of Harden's hands as much as possible. \"When the ball is in his hands the majority of the time, it's usually going in the right direction (for Houston),\" he said. \"His assist-to-turnover ratio is very good and he scores 30 points a game. We just try to limit him and make it as tough as possible.\"\n\nTIP-INS\n\nRockets: Harden didn't attempt a shot until he was fouled while taking a 3-pointer with 53 seconds left in the first quarter. He made his first five shots and didn't miss until there was 6:21 left in the third. ... Sam Dekker, who scored 30 points in his first NBA start Saturday night, came off the bench and had four points in 17 minutes.\n\nBucks: Milwaukee scored the first 14 points of the second quarter, opening a 47-33 lead on Monroe's hook with 8:11 left. ... John Henson, who had started 34 consecutive games at center, was replaced by Miles Plumlee and didn't play.\n\nUP NEXT\n\nRockets: At the Boston Celtics on Wednesday. Houston has won three consecutive games in Boston.\n\nBucks: Host the Philadelphia 76ers on Wednesday. Milwaukee's nine-game winning streak over the 76ers was snapped last Monday when Philadelphia beat the Bucks 113-104.",
  "source": "espn_api",
  "crawled_at": 1764995179.185119
}