{
  "game_id": "0022301132",
  "espn_id": "401585760",
  "date": "Apr 07, 2024",
  "matchup": "LAC vs. CLE",
  "headline": "George scores 39 points and leads late revival as Clippers beat Cavaliers 120-118 for 50th win",
  "body": "LOS ANGELES -- — Paul George scored 23 of his 39 points in the fourth quarter, James Harden added 22 and the Los Angeles Clippers rallied to beat the Cleveland Cavaliers 120-118 on Sunday for their 50th victory.\n\n\r\n              Los Angeles overcame a 26-point deficit for the third-largest comeback victory in franchise history.\n\n\r\n              “These situations aren't ideal, but it's nice when posed with these challenges we come together,” George said. “We really just dug down. That second half was special. Everyone was locked in defensively.”\n\n\r\n              Terance Mann hit a tying 3-pointer and Amir Coffey followed with a 3 to give the Clippers their first lead since late in the first quarter, 118-115.\n\n\r\n              “I can't take credit for none of it without them,” said George, who also had 11 rebounds and seven assists. “Those guys hit the biggest shots of the afternoon.”\n\n\r\n              Jarrett Allen completed a three-point play for Cleveland to tie it at 118. After a timeout, George hit a jumper for a 120-118 lead with seven seconds left. He made all 16 of his free throws, too.\n\n\r\n              “We were within striking range and my aggression just got higher,” George said. “It was just the will to win at that point.”\n\n\r\n              Darius Garland drove the lane and got blocked by Paul, but the Cavs got the offensive rebound. Max Strus put up a desperation shot from the right corner, falling down by the Clippers bench as it missed with time expired.\n\n\r\n              “The opportunity was there for us,” Cavs coach J.B. Bickerstaff said. “We just couldn't make enough shots in the second half.”\n\n\r\n              The Clippers reached the 50-win mark for the first time since 2016-17 when they had 51. They did it without Kawhi Leonard, who missed his fourth straight game because of inflammation in his right knee.\n\n\r\n              “To get to 50 wins from where we started, that's huge,” Clippers coach Tyronn Lue said, referring to the team's six-game skid in November.\n\n\r\n              The Cavs outplayed the Clippers for the better part of three quarters, pushing the advantage to 26 in the third.\n\n\r\n              That's when the Clippers started to come alive.\n\n\r\n              They outscored the Cavs 29-6 over the end of the third and start of the fourth, capped by five straight points from George on a 3-pointer and two free throws, to trail 100-97.\n\n\r\n              Six Cavs were in double figures, including all five starters. Garland scored 28 points. Strus and Evan Mobley added 20 points each, Caris LeVert had 18 starting in place of All-Star Donovan Mitchell and Allen finished with 17 points and 10 rebounds.\n\n\r\n              Mitchell, who has been slowed by an injured left knee for weeks, sat out a day after the Cavs' 19-point loss to the Lakers. The sliding Cavs are doing what they can to manage Mitchell's injury as they gear up for the playoffs.\n\n\r\n              Cleveland extended its lead to 26 points in the third. Allen had 10 points in the period, including eight of their first 15. He scored back-to-back for a 94-68 lead.\n\n\r\n              The Clippers closed the third on an 18-4 run, led by eight from Ivica Zubac, to trail 98-86 going into the fourth.\n\n\r\n              The Cavs led 80-59 at halftime after shooting 60% from the floor and scoring 40 points in each quarter. Their 80 points were a season high in a half. They had runs of 10-0, 6-0 and 8-0 in the second as four of their starters had at least 15 points at the break. \n\n\r\n              “We knew that first half wasn't us,” George said. “There was no defense being played at all on our behalf.” \n\n\r\n              Lue said he wasn’t sure whether Leonard would be back for Tuesday’s game at Phoenix.\n\n\r\n              “I don’t have a level of concern,” he said.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Memphis on Wednesday night to open final regular-season homestand.\n\n\r\n              Clippers: At Phoenix on Tuesday night. They're 25-15 on the road.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996532.622632
}