{
  "game_id": "0022300114",
  "espn_id": "401584742",
  "date": "Oct 31, 2023",
  "matchup": "ORL @ LAC",
  "headline": "With James Harden watching, Clippers take control in 3rd quarter to beat Magic 118-102",
  "body": "LOS ANGELES -- — Paul George scored 27 points, Russell Westbrook added 18 and the Los Angeles Clippers beat the Orlando Magic 118-102 on Tuesday night as future teammate James Harden watched from a suite.\n\n\r\n              Harden could not be on the Clippers' bench because the trade bringing him to Los Angeles from the Philadelphia 76ers has not been finalized. \n\n\r\n              He and fellow newcomer P.J. Tucker arrived at the arena 75 minutes before tipoff. Harden was greeted by owner Steve Ballmer and then met with the Clippers in the locker room. The 10-time All-Star and 2018 NBA MVP hugged Westbrook and George upon seeing them. Harden already has a locker with his new No. 1 Clippers blue jersey ready to be donned.\n\n\r\n              When asked by a reporter if he was excited about being traded to the Clippers, Harden said: “You don’t understand.”\n\n\r\n              Westbrook, Kawhi Leonard and Los Angeles coach Tyronn Lue declined to comment about the Harden trade because it wasn't official yet.\n\n\r\n              The Clippers had only 11 players in uniform due to the pending trade, with nine seeing at least 18 minutes. Bones Hyland and Norman Powell added 18 points apiece.\n\n\r\n              Westbrook scored 16 points and George 14 in the third quarter. The Clippers trailed 50-47 at halftime before taking control by outscoring the Magic 41-21.\n\n\r\n              “I thought honestly, we were getting great shots in the first half. They just weren’t falling,” George said. “We continued to be aggressive. There wasn't any panic (in the first half). We've got great shot-makers.”\n\n\r\n              Paolo Banchero led Orlando with 15 points and Franz Wagner had 14 points and eight rebounds. Moritz Wagner scored 13 off the bench.\n\n\r\n              “They turned up the level defensively as well as offensively. They started attacking us a little bit more,” Magic coach Jamahl Mosley said. “I thought the ball movement was good tonight, but shots didn't fall.”\n\n\r\n              Orlando jumped out to a 38-29 advantage with 4:24 remaining in the second quarter before Los Angeles scored seven straight points.\n\n\r\n              The third period featured a 26-6 run by Los Angeles over nearly six minutes. It included a spurt of 10 straight Clippers points, eight supplied by George. \n\n\r\n              After shooting 33.3% from the floor in the first half, the Clippers were 17 of 23 in the third quarter.\n\n\r\n              “We were nasty offensively in the first half. Our defense is what saved us,” Lue said. “I would say in the third quarter Russ did a good job pushing the pace. We got some turnovers getting out in transition and then PG got hot as well.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: Wrap up their four-game trip Thursday against Utah.\n\n\r\n              Clippers: Face the Los Angeles Lakers on Wednesday as the visiting team.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995750.955555
}