{
  "game_id": "0022401009",
  "espn_id": "401705575",
  "date": "Mar 19, 2025",
  "matchup": "SAC vs. CLE",
  "headline": "The Kings hand the Cavaliers their 3rd straight loss with a 123-119 win",
  "body": "SACRAMENTO, Calif. -- — DeMar DeRozan scored 27 points and the short-handed Sacramento Kings handed the Cleveland Cavaliers their third straight loss with a 123-119 victory on Wednesday night.\n\n\r\n              DeRozan made back-to-back baskets down the stretch to give the Kings a 119-116 lead and they closed it out from there for their second consecutive win following a four-game losing streak.\n\n\r\n              Malik Monk added 20 points as the Kings won without stars Domantas Sabonis and Zach LaVine. \n\n\r\n              Evan Mobley scored 22 of his 31 points in the final 15 minutes for Cleveland but it wasn't enough to help the Cavs get back on the winning track. Cleveland has matched its longest skid of the season following a 16-game winning streak.\n\n\r\n              Donovan Mitchell added 26 points for Cleveland. \n\n\r\n              Takeaways\r\n              Cavaliers: With Darius Garland resting, Mobley took over for a stretch in the second half. He scored Cleveland’s final seven points of the third quarter and first eight of the fourth for 15 in a row to get the game back tied after the Cavs trailed by 11.\n\n\r\n              Kings: Sacramento fell behind by 13 early with Sabonis (ankle) and LaVine (personal) sidelined as they missed 17 of their first 19 shots. But they rallied thanks in part to a season-high 16 points from rookie Devin Carter.\n\n\r\n              Key moment\r\n              Sacramento went on a 7-0 run midway through the fourth to take a 109-107 lead. DeRozan tied the game with a 3-pointer and Carter then had a steal and dunk to put the Kings ahead. \n\n\r\n              Key stat\r\n              The Kings shot 1 for 11 from 2-point range in the first quarter for their worst performance in any non-overtime period in 19 years. They went 1 for 14 against Dallas in the third quarter on March 12, 2006.\n\n\r\n              Up next\r\n              The Kings host Chicago on Thursday to finish a back-to-back, while the Cavs head to Phoenix on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997312.769603
}