{
  "game_id": "0022200251",
  "espn_id": "401468406",
  "date": "Nov 21, 2022",
  "matchup": "MIL vs. POR",
  "headline": "Bucks pull away in second half to beat Trail Blazers",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 37 points and the Milwaukee Bucks pulled away in the second half to beat the Portland Trail Blazers 119-111 on Monday night.\n\n\r\n              Antetokounmpo made 16 of his 24 field goal attempts to go along with seven rebounds and six assists in 35 minutes. Milwaukee improved to 12-4 and 9-1 at home.\n\n\r\n              “I thought he played with his teammates well and then played well himself,” Bucks coach Mike Budenholzer said. “Everybody made the right pass. If you don't make the right pass, if you're holding it too much, they can junk it up with all the different things they do defensively.”\n\n\r\n              Milwaukee outscored Portland 30-18 in the third quarter after leading 63-61 at halftime.\n\n\r\n              Then Bucks guard Jrue Holiday scored 13 of his 17 points in the fourth quarter, including a shot from behind the backboard. Holiday opened the quarter with a 3-pointer to give the Bucks a 96-79 lead and had the first nine Milwaukee points in the period.\n\n\r\n              “It was good for him to see it go in,” Budenholzer said. “He scored a lot of different ways.”\n\n\r\n              Grayson Allen played aggressively and contributed 17 points and eight rebounds for Milwaukee.\n\n\r\n              Anfernee Simons paced the Trail Blazers (10-7) with 29 points and Josh Hart added 17 points. Center Jusuf Nurkic had 16 points and 10 rebounds. Portland lost its third straight game.\n\n\r\n              “Obviously playing Giannis it's always going to be a tough night,” Simons said. “He's just so tough to guard. It took all five of us to guard him.”\n\n\r\n              Portland took a 32-30 lead after the first quarter while shooting 58.3% from the field (14 of 24).\n\n\r\n              The teams traded the lead eight times in the first half. Antetokounmpo elevated over Nurkic for an emphatic dunk but Simons sank a baseline shot just before the second-quarter buzzer to close the gap to two points.\n\n\r\n              Antetokounmpo scored 19 points in the third quarter as the Bucks extended their lead to 93-79 entering the final period.\n\n\r\n              The Bucks star absorbed some hard fouls but said he wasn't worried about it.\n\n\r\n              “I take a lot of hard hits but at the end of the day it's basketball,” Antetokounmpo said. “I enjoy putting my body on the line. It puts a fire in my belly and wakes me up. When I get hit, I kind of enjoy it. I feel I'm part of the game, I'm locked in and I'm being aggressive.”\n\n\r\n              The Bucks had 31 assists on 47 made field goals as they kept the ball moving.\n\n\r\n              “There were a couple beautiful possessions, especially in the third quarter, where every single person touched it,\" Allen said. “It switched sides several times. We had the defense scrambling around and we ended up with a wide-open three or a layup at the rim. It's fun to play like that.\"\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Rookie Shaedon Sharpe started in place of point guard Damian Lillard, who was out with a strained soleus muscle in his right lower leg. Lillard will be re-evaluated in one to two weeks, according to the Trail Blazers. The 19-year-old Sharpe, the seventh overall pick in the 2022 draft, was averaging 9.7 points in 15 games. He had two points on 1-of-9 shooting in 27 minutes.\n\n\r\n              Bucks: Pat Connaughton made his season debut after missing Milwaukee’s first 15 games with a right calf strain. Connaughton entered the game at the start of the second quarter and finished with seven points in 16 minutes … Khris Middleton and Wes Matthews scrimmaged with G-League Wisconsin Herd players earlier Monday. Middleton has not played this season following left wrist ligament surgery, and Matthews missed his third straight game with a right hamstring strain. Budenholzer gave no timetable on their return.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Play at Cleveland on Wednesday. \n\n\r\n              Bucks: Host Chicago on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994596.801951
}