{
  "game_id": "0021600569",
  "espn_id": "400899990",
  "date": "Jan 09, 2017",
  "matchup": "CHI vs. OKC",
  "headline": "Westbrook, Thunder cruise past Bulls 109-94",
  "body": "CHICAGO --  Even Russell Westbrook was impressed with the passing by Oklahoma City's big men.\n\nWestbrook flirted with another triple-double and Steven Adams led a dominant effort in the paint, helping the Thunder pull away from the Chicago Bulls for an easy 109-94 victory Monday night.\n\nWestbrook had 21 points, 14 assists and nine rebounds, falling just short of his 18th triple-double of the season. But his all-around performance is practically a sure thing these days.\n\nIt was the inside play of Adams and Enes Kanter that really hurt Chicago, with the big men scoring with ease or passing out of double-teams to set up their teammates.\n\n\"They do a great job of playing off each other,\" Westbrook said.\n\nAdams had 22 points on 11-for-14 shooting, and Kanter finished with 20 points and 11 rebounds. The duo helped the Thunder to 56.6 percent shooting from the field, a 60-36 advantage on points in the paint and a 42-38 edge in rebounding.\n\n\"I thought tonight, on both ends of the floor, we played at a high level,\" coach Billy Donovan said.\n\nDwyane Wade led Chicago with 22 points, and Michael Carter-Williams had 15. Cristiano Felicio finished with 11 points and 11 rebounds.\n\nThe Bulls had won three in a row and five of seven, but they were no match for the Thunder with Jimmy Butler hampered by an illness. The reigning Eastern Conference player of the week had one point on 0-for-6 shooting and seven assists.\n\n\"I appreciate him coming out and giving it a shot. That says a lot about him, as a competitor, but he was really struggling, obviously,\" coach Fred Hoiberg said.\n\nButler was sent home after he left the game in the third quarter, and Hoiberg said Butler will not play Tuesday night against Washington. Wade, who turns 35 on Jan. 17, also will rest against the Wizards.\n\n\"Jimmy can't put up 50 every night. We have to do better. We have to support him a lot better,\" Bulls forward Taj Gibson said.\n\nGibson's three-point play off a slick pass from Wade got Chicago within 10 with 6:51 left in the third, but Westbrook helped the Thunder put it away from there.\n\nThe dynamic point guard threw an alley-oop to Adams and then found the center for a layup. Westbrook set up Andre Roberson for a 3-pointer and a cutting dunk. Kanter added a driving layup with 54 seconds left, helping Oklahoma City to an 89-67 lead after three.\n\nGRANT VS GRANT\n\nBrothers Jerami and Jerian Grant faced off. Jerian Grant had 11 points in 21 minutes for the Bulls. Jerami Grant played 16 minutes for the Thunder and finished with seven points.\n\n\"Whenever I get to play against him, it's great to see him,\" Jerami Grant said.\n\nTIP-INS\n\nThunder: Victor Oladipo scored 13 points on 6-for-9 shooting. ... G Cameron Payne played almost 15 minutes in his second game of the season after being sidelined by a right foot injury. ... The Thunder had lost four straight road games.\n\nBulls: G Rajon Rondo did not play on his bobblehead night. The veteran guard hasn't played since Dec. 30 against Indiana, and it's unclear when or if he will return to Hoiberg's rotation. ... Rookie G Denzel Valentine missed his third straight game with an ankle injury.\n\nUP NEXT\n\nThunder: Host Memphis on Wednesday night. The Thunder lost 114-80 to the Grizzlies on Dec. 29.\n\nBulls: Visit Washington on Tuesday night, beginning a stretch with three of four on the road. The Bulls and Wizards split the first two games of their season series.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764995058.7485912
}