{
  "game_id": "0021600692",
  "espn_id": "400900113",
  "date": "Jan 26, 2017",
  "matchup": "PHX @ DEN",
  "headline": "Nuggets' Jokic has 27 points, 14 rebounds before late injury",
  "body": "DENVER --  Nikola Jokic is the biggest reason for Denver Nuggets' rise, so when he went down hard Thursday night there was deep concern.\n\nWhen the news came back that the 21-year-old center had only a left hip strain there was audible relief.\n\n\"I'm glad it wasn't anything serious,\" Darrell Arthur said. \"He's probably going to sit a couple of games so we can get him back. We're definitely going to miss him out there.\"\n\nThey were happy Jokic was around for most of the game against Phoenix. The Serb had 29 points, 14 rebounds and eight assists before leaving late in Denver's 127-120 victory over the Suns.\n\nJokic went down without contact under the Phoenix basket with 1:47 left. He was on the floor for a while with the entire Nuggets team surrounding him. He finally stood and limped to the locker room as the Nuggets closed out their fifth straight home win.\n\nGeneral manager Tim Connelly and veteran Mike Miller stood outside the exam room, and when Jokic came out with his older brothers he walked to the locker room on his own.\n\nX-rays after the game were negative and he was sitting at his locker with ice on his left hip. The team said he will have an MRI done on Friday morning.\n\n\"It's mixed emotions in the locker room,\" Nuggets coach Michael Malone said. \"Nikola is truly beloved by all of his teammates. He has no ego, he's a young kid, he likes to have fun, he's a little bit goofy, and the guys love him for that. For all the success that he's having he's still the same kid, and that's why everybody cares about him and respects him.\"\n\nDanilo Gallinari added 23 points, and Will Barton had 16 for Denver. The Nuggets have won six of eight.\n\nEric Bledsoe led Phoenix with 28 points, Devin Booker had 24 and T.J. Warren added 21 points and eight rebounds.\n\nDown by nine in the third quarter, Denver closed the period with a 14-5 run to take a 96-92 lead.\n\nThe lead changed hands a couple of times, with Bledsoe leading the way for Phoenix with 14 fourth-quarter points. Jokic kept pace with nine points in the period. His last basket, a short jumper in the lane, gave the Nuggets a 125-118 lead.\n\n\"They made some plays and we couldn't get no stops,\" Bledsoe said.\n\nThe Nuggets hit 21 of 25 free throws in the second half and outscored the Suns 30-14 from the line. Denver also held a 46-28 advantage on the glass.\n\n\"Rebounds, minus-18 for the game; minus-18 at the free-throw line,\" Phoenix coach Earl Watson said. \"Those are numbers you can't overcome, but we still had a chance to win.\"\n\nTIP-INS\n\nSuns: G Dragan Bender was inactive with right ankle soreness. The rookie missed Tuesday's game against Minnesota as well. ... Jared Dudley was back in the lineup after sitting out Tuesday.\n\nNuggets: G Emmanuel Mudiay sat out his third straight game with lower back soreness. Coach Michael Malone said before the game that he didn't think Mudiay would miss many more games. ... The Nuggets signed F Johnny O'Bryant to a 10-day contract.\n\nMARQUESE TALENT\n\nWatson didn't need long to decide he wanted Phoenix to get Marquese Chriss last summer in the draft after watching his pre-draft workout.\n\n\"The type of things he did athletically above the rim I hadn't seen done before,\" Watson said. \"I wanted to shut the workout down after the first 10 minutes. To me it was a no-brainer.\"\n\nThe 19-year-old Chriss has been solid for the Suns while learning on the job. His demeanor on and off the court reminds Watson of his former teammate, Russell Westbrook.\n\n\"Russ had this demeanor off the court of just the nicest person in the world but you get him on the court and you think he can't be a nice person in real life,\" Watson said. \"Marquese kind of has that same thing.\"\n\nChriss was in foul trouble Thursday and was held to five points in eight minutes.\n\nUP NEXT\n\nSuns: Host the Nuggets on Saturday night.\n\nNuggets: At the Suns on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995965.3846242
}