{
  "game_id": "0022200920",
  "espn_id": "401469075",
  "date": "Feb 27, 2023",
  "matchup": "MIA @ PHI",
  "headline": "Butler's acrobatic layup, 23 points lead Heat past 76ers",
  "body": "PHILADELPHIA -- — Jimmy Butler hit an acrobatic reverse layup in the final minutes, and his 23 points led five Miami players in double figures as the Heat edged the Philadelphia 76ers 101-99 on Monday night.\n\n\r\n              Butler was an assist shy of a triple-double, adding 11 rebounds and nine assists. He also had four steals. His spinning move and finishing layup while driving between the Sixers’ Joel Embiid and P.J. Tucker gave the Heat a 100-99 lead with 1:28 to play after Philadelphia rallied from an 11-point deficit in the fourth quarter. He added a free throw with 8.1 seconds left.\n\n\r\n              “I work on that kind of stuff every day,” Butler said of his highlight-reel basket. “I love to play this game and I love to compete, but it’s always much more fun when we win.”\n\n\r\n              James Harden had a chance to win the game for the 76ers, but his 3-point try at the buzzer bounced off the back of the rim.\n\n\r\n              “You have to expect things to be a little bit gnarly on the road,” Miami coach Erik Spoelstra said. “You have to weather a bunch of different storms. … Sometimes you just need the ball to bounce the right way. Harden had a window there and was open, but we contested so many shots tonight that sometimes when you do get an open shot you don’t have a great rhythm.”\n\n\r\n              Gabe Vincent scored 14 points and Bam Adebayo added 13 as the Heat snapped a four-game losing streak.\n\n\r\n              Embiid led all scorers with 27 points and 12 rebounds. Harden finished with 20 points and 12 assists.\n\n\r\n              Max Struss hit a pair of free throws with 7:10 to play in the fourth quarter, giving the Heat an 11-point lead. But the 76ers mounted a furious rally, erasing the deficit and taking the lead on a pair of Harden free throws.\n\n\r\n              The Sixers rally was keyed by Tyrese Maxey, who scored 19 of his 23 points in the second half before fouling out with 3:21 to play.\n\n\r\n              The Heat did a nice job on Philadelphia defensively, forcing 18 turnovers. However, the 76ers also missed several layups, especially in the second half.\n\n\r\n              “I just think we were really sloppy tonight, sluggish,” Philadelphia coach Doc Rivers said. “It happens, but you still have to find a way to win the game. Tonight, we didn’t.”\n\n\r\n              Miami also got help from the bench as Struss scored 13 points and Victor Oladipo added 11.\n\n\r\n              The 76ers have lost back-to-back games. Philadelphia hasn’t lost three in a row since the first week of December. They look to avoid the skid in a rematch with the Heat on Wednesday in Miami.\n\n\r\n              TIP-INS\n\n\r\n              Heat: There was a thought that G Kyle Lowry would return to the lineup Monday after he was upgraded on the injury report to questionable on Sunday. However, the Heat downgraded Lowry just as quickly on Monday and he missed his ninth straight game with knee soreness. Heat coach Erik Spoelstra said there’s no timetable for his return, but that he was making progress. ... G Tyler Herro was also listed as questionable Sunday with a rib contusion, but he was in the starting lineup.\n\n\r\n              76ers: Philadelphia played its final home game before heading out on a five-game trip. More than that, it is facing an incredibly daunting March schedule. The 76ers will play 17 games in 31 days and 12 of the first 15 will be on the road. If that weren’t enough, the Sixers will play four sets of games on consecutive nights, with all eight contests on the road in eight different cities.\n\n\r\n              HAMLIN CELEBRATED Buffalo Bills safety Damar Hamlin was in attendanc e, sitting with 76ers owner Joshua Harris and Fanatics owner Michael Rubin. He was wearing a No. 3 Sixers jersey and received a nice ovation from the sellout crowd when introduced during a second quarter timeout.\n\n\r\n              UP NEXT\n\n\r\n              The teams play again at Miami on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993935.0607271
}