{
  "game_id": "0022400613",
  "espn_id": "401705179",
  "date": "Jan 22, 2025",
  "matchup": "BKN vs. PHX",
  "headline": "Booker and Durant lead the Suns to a 108-84 victory over the short-handed Nets",
  "body": "NEW YORK -- — Devin Booker scored 32 points in his 200th career 30-point performance, Kevin Durant added 24 against his former team and the Phoenix Suns eased to a 108-84 victory over the short-handed Brooklyn Nets on Wednesday night.\n\n\r\n              Booker shot 14 for 24 from the field to quickly get back on track after getting held to 15 points Monday in a loss to Cleveland that snapped his five-game streak with 30 or more. \n\n\r\n              Nick Richards grabbed 15 rebounds in his second start for the Suns, who went back above .500 at 22-21 while playing without Bradley Beal.\n\n\r\n              Keon Johnson scored 20 points for the Nets, who lost their fifth straight. Jalen Wilson added 15.\n\n\r\n              The Nets were missing key players such as former Sun Cam Johnson, Cam Thomas, D'Angelo Russell and Ben Simmons in their ninth straight home loss.\n\n\r\n              Takeaways\r\n              Suns: After reaching the midpoint of its schedule with a .500 record, Phoenix can quickly get a good start to the second half with games against Brooklyn and NBA-worst Washington, which it plays next. \n\n\r\n              Nets: Durant noted that his former team has done well acquiring draft assets, which could pay off nicely in the future but doesn't do the Nets any good on the court for now. \n\n\r\n              Key moment\r\n              The Suns led only 39-36 with 3 1/2 minutes remaining in the first half. A 10-2 burst pushed the lead into double digits and the lead stayed there for the entire second half. \n\n\r\n              Key stat\r\n              Durant reached 20 points for the 20th consecutive game, four shy of the franchise record. \n\n\r\n              Up next\r\n              The Nets host Miami on Saturday, when they will retire Hall of Famer Vince Carter's No. 15 jersey during a halftime ceremony. The Suns host Washington that night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997982.2769978
}