{
  "game_id": "0022200171",
  "espn_id": "401468326",
  "date": "Nov 09, 2022",
  "matchup": "CLE @ SAC",
  "headline": "Sabonis scores 21 points, Kings top Mitchell, Cavs 127-120",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis scored 21 points and the Sacramento Kings overcame another big performance by Donovan Mitchell to beat the Cleveland Cavaliers 127-120 on Wednesday night.\n\n\r\n              Mitchell scored 38 points on 16 of 28 shooting as the Cavaliers lost their second in a row following an eight-game winning streak. He began the game averaging 31.2 points per game this season.\n\n\r\n              “Different nights it's different things,\" Mitchell said.\n\n\r\n              Harrison Barnes had a season-high 20 points for Sacramento. He had zero points in the Kings' loss to Golden State on Monday.\n\n\r\n              “I have confidence in myself,\" Barnes said. \"I’ve had my fair share of ups and downs ... although some nights are good, some nights are not. I don’t think it’s changed how my spirit is.”\n\n\r\n              De’Aaron Fox added 15 points and eight assists for the Kings. He was subbed out with 8:44 left in the fourth quarter but returned for the final two minutes.\n\n\r\n              Trey Lyles had 16 points, including four 3-pointers, off the Sacramento bench. Malik Monk added 14 points.\n\n\r\n              Keegan Murray also had 14 points. The 22-year-old rookie from Iowa had not scored in double-digits in the Kings' last three games.\n\n\r\n              Mitchell also had five rebounds and four assists.\n\n\r\n              Caris LeVert had 21 points, 10 rebounds and six assists. Jarrett Allen had 20 points and seven rebounds for Cleveland.\n\n\r\n              “A lot of it is communication,” LeVert said “Tonight was (spent) a lot of transition. Sacramento is a fast team.”\n\n\r\n              The Kings never trailed and led by as many as 15 until Cleveland took its first lead with 9:13 left in the fourth on a basket by Kevin Love. He had nine points and eight rebounds.\n\n\r\n              \"We ran the same play down the stretch at least 15 times,” Kings coach Mike Brown said. “Great team effort, the staff was great across the board, and the fans were fantastic tonight. … We’re all learning and growing together.”\n\n\r\n              Cavaliers guard Darius Garland had six points, his second-lowest scoring performance since scoring four points in a season-opening loss to Toronto.\n\n\r\n              “He had a rough night,” Cavaliers coach J.B. Bickerstaff said. “We all know what Darius is capable of … shots weren’t going for him. He was battling to try and figure it out.”\n\n\r\n              BICKERSTAFF PRAISES BROWN\n\n\r\n              Brown worked under Bickerstaff's father, Bernie, as a video coordinator. \n\n\r\n              “It’s awesome (he's a head coach) because I have known Mike since I was 13,\" Bickerstaff said. \"He worked for my dad as a video coordinator when I was growing up. There’s no better person than Mike Brown. You don’t find people (like that) in our business.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: LeVert was given a technical foul with 3:26 left in the second quarter. ... Mitchell has scored 30 points or more in eight of 10 games. ... Cleveland had 64 points in the paint. Sacramento had only 40.\n\n\r\n              Kings: Luke Walton returned to Sacramento for the first time as an assistant coach for the Cavaliers. Walton coached the Kings for two full seasons before being fired after 17 games last season. … Sacramento ranked 29th in the NBA in free throw percentage coming into Wednesday. They shot 30 of 35.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: In San Francisco to play the Warriors on Friday.\n\n\r\n              Kings: Travel to Los Angeles to face the Lakers on Friday.\n\n\r\n              ------\n\n\r\n              This story has been corrected to show that Harrison Barnes scored 20 points, not 19.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995256.097057
}