{
  "game_id": "0022400916",
  "espn_id": "401705482",
  "date": "Mar 08, 2025",
  "matchup": "CHI @ MIA",
  "headline": "Giddey scores 26 to lead Bulls' comeback from 17 down to beat the Heat 114-109",
  "body": "MIAMI -- — Josh Giddey scored 26 points and the Chicago Bulls rallied from a 17-point, first-half deficit to beat the Miami Heat 114-109 on Saturday night.\n\n\r\n              Coby White finished with 21 points and Zach Collins had 18 points and 15 rebounds. Tre Jones added 15 points for the Bulls, who won their second straight in Florida after beating Orlando on Thursday.\n\n\r\n              Chicago took the lead for good when White’s three-point play with 1:25 remaining made it 110-109. Giddey’s 3-pointer with 17 seconds left padded the lead.\n\n\r\n              The Heat built a 51-35 advantage early in the second quarter but allowed the Bulls to stay within distance after they scored four points in the final 7:13 of the period.\n\n\r\n              Bam Adebayo and Andrew Wiggins each scored 22 points and Tyler Herro added 21 for the Heat. Wiggins returned after missing the last five games because of a right ankle sprain.\n\n\r\n              It was the 16th time Miami has lost after squandering a double-digit lead this season.\n\n\r\n              Takeaways\r\n              Bulls: White shot 6 for 16 from the field and 0 for 8 from 3-point range after his career-high 44 points in Orlando.\n\n\r\n              Heat: The Heat completed their 13th back-to-back set, which began with Friday’s home loss to Minnesota. Miami has been swept in six of the sets played on consecutive days.\n\n\r\n              Key moment\r\n              Jones made two consecutive layups and Jalen Smith also scored on a layup with 5:52 remaining in the fourth that closed an 11-0 surge and put the Bulls ahead 97-94 for their first lead since the first period.\n\n\r\n              Key stat\r\n              The Bulls made 23-of-26 free throws. White finished 9 of 9 from the line.\n\n\r\n              Up next\r\n              The Bulls host Indiana on Monday while the Heat continue their five-game homestand against Charlotte on Monday.",
  "source": "espn_api",
  "crawled_at": 1764997041.417259
}