{
  "game_id": "401809940",
  "espn_id": "401809940",
  "date": "Oct 22, 2025",
  "matchup": "UTAH vs LAC",
  "headline": "Kessler scores 22 points to lead Jazz past Clippers 129-108",
  "body": "SALT LAKE CITY -- — Walker Kessler had 22 points and nine rebounds, Lauri Markkanen scored 20 and the Utah Jazz beat the Los Angeles Clippers 129-108 on Wednesday night.\n\n\r\n              Brice Sensabaugh added 20 points off the bench for Utah, which set a team record for points in a season opener. \n\n\r\n              Kessler, the longest-tenured member of the Jazz, went 7 for 7 from the field. He blocked four shots and finished with four assists. \n\n\r\n              The new-look Clippers appeared confused on the court at times in a disappointing debut for a team with lofty aspirations. Ivica Zubac led Los Angeles with 19 points and seven rebounds. James Harden and Brook Lopez each scored 15. Kawhi Leonard had 10 points on 3-of-9 shooting.\n\n\r\n              It was Los Angeles' most lopsided season-opening loss in 17 years.\n\n\r\n              Utah made its first 19 shots in the paint, as crisp passing and precise ball movement led to layups and dunks.\n\n\r\n              Widely expected to finish near the bottom of the NBA this season, the Jazz had 38 assists on 48 baskets and shot 55% from the field. Keyonte George led Utah with nine assists to go with his 16 points.\n\n\r\n              Ace Bailey, the No. 5 pick in this year's draft, has been ill and was limited to 20 minutes for the Jazz. He scored two points. \n\n\r\n              Bradley Beal also was on a minutes restriction in his Clippers debut and had five points.\n\n\r\n              Taylor Hendricks, who sustained a gruesome broken leg in the third game last season, returned to the court and looked bouncy coming off the bench for Utah. He finished with 13 points and five rebounds.\n\n\r\n              The Jazz led 78-47 at halftime after shooting 71.8% from the floor. The Clippers gave up 78 points in a half only once last season, while the Jazz hadn’t scored that many in a first half since the 2023-24 season.\n\n\r\n              Utah was 12 for 12 on 2-point field goals and added four 3s in the first quarter.\n\n\r\n              Up next\r\n              Clippers: Host the Phoenix Suns on Friday.\n\n\r\n              Jazz: Visit the Sacramento Kings on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042482.139806
}