{
  "game_id": "401810100",
  "espn_id": "401810100",
  "date": "Nov 17, 2025",
  "matchup": "TOR vs CHA",
  "headline": "Barrett scores tiebreaking basket as Raptors beat Hornets 110-108",
  "body": "TORONTO -- — RJ Barrett scored the tiebreaking basket with 18 seconds left in the fourth quarter, Brandon Ingram and Scottie Barnes both had pivotal blocked shots in the final moments and the Toronto Raptors won for the eighth time in nine games by beating the Charlotte Hornets 110-108 on Monday night.\n\n\r\n              Ingram scored 27 points, Barnes and Barrett each had 16 and Immanuel Quickley added 15 points and 10 rebounds as Toronto won its fourth straight.\n\n\r\n              Ingram got the crowd on its feet with an eye-popping fourth quarter dunk over Hornets rookie center Ryan Kalkbrenner. \n\n\r\n              After Barrett’s go-ahead basket, Ingram maintained the lead by blocking Kalkbrenner from behind. On the final possession, Barnes sealed it by blocking Collin Sexton’s putback attempt at the buzzer.\n\n\r\n              Jakob Poeltl scored 13 points and Gradey Dick had 10 for Toronto.\n\n\r\n              Kon Knueppel scored 24 points, Miles Bridges added 22 and LaMelo Ball had 20 but the Hornets lost for the sixth time in seven games. Charlotte is 1-6 on the road.\n\n\r\n              Sexton finished with 17 points as Charlotte’s bench outscored Toronto’s 35-23.\n\n\r\n              Kalkbrenner led Charlotte with 10 rebounds.\n\n\r\n              The Hornets shot 10 for 40 from 3-point range, their lowest shooting percentage from long range this season.\n\n\r\n              Ball returned after sitting out Saturday’s loss to Oklahoma City, the second game of a back-to-back. Ball played 27 minutes in Friday’s overtime loss to Milwaukee, his first action after missing the previous five games because of a right ankle impingement. \n\n\r\n              Barnes set a Raptors franchise record by recording at least one block and one steal in his 10th consecutive game, a career-best. Vince Carter did it in nine straight games for Toronto from April 1 to 16, 1999.\n\n\r\n              Up next\r\n              Hornets: At Indiana on Wednesday.\n\n\r\n              Raptors: At Philadelphia on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042644.424957
}