{
  "game_id": "0022201115",
  "espn_id": "401469270",
  "date": "Mar 26, 2023",
  "matchup": "MEM @ ATL",
  "headline": "Morant's 27 points help streaking Grizzlies hold off Hawks",
  "body": "ATLANTA -- — Hidden in the Memphis Grizzlies’ six-game winning streak is a potentially more important number for the team’s postseason hopes — two straight road wins.\n\n\r\n              Ja Morant scored 27 points in his return to the Memphis starting lineup and the Grizzlies held off the Atlanta Hawks 123-119 on Sunday night to extend the NBA's longest active winning streak.\n\n\r\n              Desmond Bane added 25 points for Memphis, twice delivering fourth-quarter baskets after Atlanta pulled within one.\n\n\r\n              Memphis (47-27) is second in the Western Conference despite a 15-22 road record. Back-to-back wins away from Memphis provide hope the Grizzlies are gaining crucial late-season momentum in road games.\n\n\r\n              The six-game winning streak began with a 126-120 overtime victory at San Antonio on March 17. A win at Atlanta (37-38) was \"huge,” according to Grizzlies forward Jaren Jackson Jr.\n\n\r\n              “We haven’t really been getting it going on the road,” Jackson said.\n\n\r\n              Morant received a big cheer from the Atlanta sellout crowd during pregame introductions. He came off the bench in his first two games after serving an eight-game NBA suspension for posting a video in which he was shown waving a gun at a Denver-area strip club. \n\n\r\n              Morant's minutes were still watched closely by coach Taylor Jenkins, who had the two-time All-Star on the bench early in the fourth quarter when the Hawks made a charge.\n\n\r\n              Saddiq Bey's 3-point play for Atlanta cut the Grizzlies' lead to 98-87 before Bane responded by sinking a jumper. AJ Griffin's jumper again pulled the Hawks within one before Bane answered with another basket.\n\n\r\n              “We got caught in a spot trying to figure out Ja's minutes,” Jenkins explained. \n\n\r\n              Jenkins said before the game he hoped to keep Morant's minutes in the “upper 20s.” Morant played 29 minutes.\n\n\r\n              Minutes later, Bane's 3-pointer gave Memphis a 110-103 advantage. The Hawks made one final push, cutting the Grizzlies' lead to 122-119 on De'Andre Hunter's 3-pointer. After a free throw by Tyus Jones extended the lead to four points, Atlanta called a timeout with 11.6 seconds remaining.\n\n\r\n              Trae Young, who led Atlanta with 28 points, missed a short jumper before Bogdan Bogdanovic's 3 from the corner also was no good. \n\n\r\n              COMEBACK FALLS SHORT\n\n\r\n              Young added 10 assists one day after he was ejected for throwing the ball at an official during the Hawks' 143-130 win over Indiana on Saturday.\n\n\r\n              “If one or two more shots go in, it's a different story,” Young said, noting the Grizzlies made 13 3-pointerss, compared to only seven for the Hawks. “They hit six more 3s than us and only won by four.”\n\n\r\n              BLOCKING HAWKS SHOTS — AGAIN\n\n\r\n              Jackson continued to thrive as a shot blocker against Atlanta. Jackson set a career high with eight blocks in the Grizzlies' 128-103 home win over the Hawks on Dec. 12. He added five blocks on Sunday, all in the first half.\n\n\r\n              Jackson was called for a foul on a block that knocked John Collins to the floor with six seconds remaining in the first half. Jackson and Jenkins were called for technical fouls for arguing the call against Jackson, and a review confirmed it was a clean block.\n\n\r\n              MAN IN THE MIDDLE\n\n\r\n              The Hawks also got big production from their big men. Starting center Clint Capela had 18 points and 16 rebounds. Backup Onyeka Okongwu added 13 points and seven rebounds. The two combined for five blocks, including four by Capela.\n\n\r\n              Atlanta took a 31-9 advantage in second-chance points built on their 48-39 edge in rebounds.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: With Morant starting, Jones had 13 points in a backup role. Jackson scored 15. \n\n\r\n              Hawks: Hunter started after missing one game with a bruised left knee. Bogdanovic, also slowed by a bruised left knee, returned to a backup role. ... F Jalen Johnson (groin, hamstring) missed his sixth straight game.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Orlando on Tuesday.\n\n\r\n              Hawks: Host Cleveland on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994167.253362
}