{
  "game_id": "0022400591",
  "espn_id": "401705157",
  "date": "Jan 18, 2025",
  "matchup": "HOU @ POR",
  "headline": "Jalen Green leads Rockets with 26 points in 125-103 victory over Trail Blazers",
  "body": "PORTLAND, Ore. -- — Jalen Green scored 26 points and the Houston Rockets beat Portland 125-103 on Saturday night, the Trail Blazers' fifth straight loss. \n\n\r\n              Alperen Sengun had 23 points and 15 rebounds for the Rockets. \n\n\r\n              Scoot Henderson had 21 points and 11 assists off the bench for the Blazers. Toumani Camara added 17 points.\n\n\r\n              Fred VanVleet started for the Rockets and finished with nine points after missing Thursday's 132-127 loss to Sacramento for personal reasons. That defeat snapped Houston's five-game winning streak. \n\n\r\n              Jerami Grant started for Portland after a facial contusion sidelined him for the last nine games. He finished with seven points. \n\n\r\n              The Rockets led by as many as nine points early, but Anfernee Simons hit a 3-pointer that put the Blazers up 31-29 midway through the second quarter. Houston held a 51-50 edge at halftime. \n\n\r\n              Sengun's driving layup touched off a 15-0 run that gave the Rockets a 70-56 lead in the third quarter.\n\n\r\n              Takeaways\r\n              Rockets: Amen Thompson did not play because of left calf soreness. ... Sengun scored six of Houston’s first 10 points. ... The Rockets out-rebounded Portland 61-40. \n\n\r\n              Trail Blazers: Deni Avdija missed a third game because of a right ankle sprain. Deandre Ayton was out with lower back soreness. ... Robert Williams III had three blocks. \n\n\r\n              Key moment\r\n              Green and Dillon Brooks made back-to-back 3-pointers during Houston's big run in the third quarter. Anfernee Simon's layup for Portland finally ended it, but Portland couldn't recover. \n\n\r\n              Key stat\r\n              Sengun had 14 points in the third quarter and was 6 of 9 from the field. For the game, he was 10 of 19. \n\n\r\n              Up next\r\n              Rockets: Host Detroit on Monday.\n\n\r\n              Trail Blazers: Host Bulls on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997383.381484
}