{
  "game_id": "0022400493",
  "espn_id": "401705059",
  "date": "Jan 06, 2025",
  "matchup": "POR @ DET",
  "headline": "Cade Cunningham leads Pistons' rally for 118-115 win over Blazers and rare .500 record",
  "body": "DETROIT -- — Cade Cunningham had 32 points and nine assists as the Detroit Pistons reached .500 for the first time after New Year's Day since 2019 with a 118-115 win over the Portland Trail Blazers on Monday night.\n\n\r\n              Tim Hardaway Jr. added 26 points for Detroit and Jalen Duren had 14 points and 12 rebounds. The Pistons (18-18), who were 3-33 after 36 games a season ago, have won seven of eight.\n\n\r\n              Anfernee Simons had 36 points and nine assists for Portland, while Shaedon Sharpe had 20 points, eight assists and eight rebounds. The Trail Blazers led by 22 points in the first half.\n\n\r\n              Hardaway tied the game with a jumper with 3:39 to play, then hit a 3-pointer to make it 109-106. After the teams traded baskets, Simons hit a layup to make it a one-point game.\n\n\r\n              Malik Beasley hit a 3-pointer to put the Pistons ahead 114-110. Deandre Ayton dunked for Portland with 49.5 seconds to go, but Duren's putback restored the four-point lead.\n\n\r\n              Takeaways\r\n              Blazers: Coach Chauncey Billups was honored before the game for his contributions to Detroit's 2004 championship and his induction into the Basketball Hall of Fame.\n\n\r\n              Pistons: Detroit hasn't been .500 after New Year's since it finished 41-41 in 2018-19. That season, Blake Griffin led the Pistons to the playoffs, but injured his knee in the process and they were swept by Milwaukee.\n\n\r\n              Key moment\r\n              The Blazers nearly blew Detroit off the floor in the first three minutes of the second quarter. Portland outscored the Pistons 17-0, helped by four straight 3-pointers from Sharpe and Simons.\n\n\r\n              Key stat\r\n              Portland outshot Detroit 53.3% to 44.7% from the floor, but went 3 of 5 from the free-throw line while Detroit was 19 of 22. The Pistons also had a 17-7 edge in offensive rebounds.\n\n\r\n              Up next\r\n              Trail Blazers: At New Orleans on Wednesday.\n\n\r\n              Pistons: At Brooklyn on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998183.048531
}