{
  "game_id": "0022200785",
  "espn_id": "401468940",
  "date": "Feb 03, 2023",
  "matchup": "CHA @ DET",
  "headline": "Bey hits late 3-pointer to help Pistons beat Hornets 118-112",
  "body": "DETROIT -- — Saddiq Bey scored 22 points, including a tiebreaking 3-pointer with 32.1 seconds left, and the Detroit Pistons rallied to beat the Charlotte Hornets 118-112 on Friday night.\n\n\r\n              The Pistons were playing for the first time since a 111-105 loss in Dallas on Monday. The team was stuck in Texas until Thursday by a combination of airplane problems and weather, forcing the postponement of Wednesday’s home game against the Washington Wizards.\n\n\r\n              “Winning this game is a testament to everyone involved in this team — the players, the coaches and the staff,” Bey said. “We were pretty much stuck on a plane for three days, but we found a way to stay ready and come back here to get the win.”\n\n\r\n              Mason Plumlee missed five free throws in the last 6:04 as Detroit outscored Charlotte 26-18 in the fourth quarter.\n\n\r\n              “The fourth quarter really killed us after we had done a good job for the first three,” Hornets coach Steve Clifford said. “We had five turnovers in the quarter, we went 1 for 7 on 3 — and six of those were good shots — and we missed five free throws. That's the game right there.”\n\n\r\n              Jaden Ivey had 24 points for the Pistons, Jalen Duren had 13 points and 13 rebounds, and Isaiah Stewart had eight points and 16 rebounds as Detroit outrebounded Charlotte 51-37.\n\n\r\n              “It wasn't pretty, but we did what we needed to do,” Pistons coach Dwane Casey said. “Isaiah had 16 rebounds and six assists and (Duren) had 13. Even Saddiq had eight rebounds with the second unit.”\n\n\r\n              LeMelo Ball had 23 points, eight assists and eight rebounds for the Hornets before fouling out. Terry Rozier added 23 points.\n\n\r\n              “You have to have an offensive balance — you can't just score in transition and you can't just score in the halfcourt,” Clifford said. “We did a good job of scoring early in possessions, but we have to be better in halfcourt sets.”\n\n\r\n              Bojan Bogdanovic's 3-pointer put the Pistons ahead 108-106 with 2:34 left, but Plumlee tied it with a short jumper.\n\n\r\n              After Ivey made two free throws, Plumlee split a pair — his fifth miss in eight attempts in the quarter. Plumlee was the only Hornets player to score between P.J. Washington's 3-pointer with 7:12 to play and Ball's tying three-point play with 1:20 left.\n\n\r\n              After both teams missed, Bey hit a baseline 3-pointer to put Detroit up 115-112. \n\n\r\n              “The building was electric in the last minute,” Bey said. “The rookies were making plays and I knew I needed to knock that one down.”\n\n\r\n              After a timeout, the Hornets took a 5-second violation and Alec Burks made it a five-point game from the free-throw line.\n\n\r\n              Charlotte led 94-92 going into the fourth, with the teams combining for 98 points in the paint.\n\n\r\n              Detroit’s 23 turnovers for 30 points helped Charlotte build a 106-102 lead with 4:31 to play, but Plumlee missed four of six free throws to keep the Pistons in the game.\n\n\r\n              TIP INS\n\n\r\n              Hornets: Made 19 of their first 21 free throw attempts, including 6 for 6 from Plumlee, until he missed four in 93 seconds. ... Charlotte had a 15-2 edge in fast-break points.\n\n\r\n              Pistons: Rookies Ivey and Duren will play in the Rising Stars Game, giving Detroit five participants in the last two seasons. Bey, Stewart and Cade Cunningham played in the game last year.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host the Orlando Magic on Sunday.\n\n\r\n              Pistons: Host the Phoenix Suns on Saturday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994257.279022
}