{
  "game_id": "0022000596",
  "espn_id": "401307380",
  "date": "Mar 14, 2021",
  "matchup": "MIA @ ORL",
  "headline": "Butler scores 29 as Heat beat Magic for 4th straight win",
  "body": "ORLANDO, Fla. -- — Jimmy Butler started Sunday night’s game against Orlando by winning the opening tip and ended it with a steal and win-sealing layup as the Miami Heat topped the Magic 102-97.\n\n\r\n                    In between, the standout guard was pretty good, too, helping the Heat win their fourth straight and for a 10th time in 11 games.\n\n\r\n                    “He has very disciplined gambles and I know that’s counterintuitive, but Jimmy’s a disciplined team defender’’ Miami coach Erik Spoelstra said of Butler, who had 29 points, nine assists, seven rebounds and five steals for the suddenly surging Heat. “He has a knack, that super-high IQ and that cat quickness that you can’t teach, and it surprises everybody.” \n\n\r\n                    Tyler Herro came into the game listed as questionable because of a shoulder strain, but he came off the bench and contributed 22 points, eight rebounds and four 3-pointers. Ten of his points came in the fourth quarter.\n\n\r\n                    Miami trailed by as many as six points in the second half and faced a four-point deficit at the start of the fourth. The Heat are 3-12 when trailing after three periods.\n\n\r\n                    The teams traded the lead five times in the fourth period before the Heat pulled away in the final three minutes behind their defense and Butler’s scoring. A 7-0 run — started by a Butler jumper and a Herro 3 — gave Miami a 100-94 lead. Orlando missed five straight shots and went three minutes without a point.\n\n\r\n                    Butler’s steal of a Michael Carter-Williams pass and subsequent layup with four seconds remaining sealed the win. Butler’s defense led to 23 Orlando turnovers and 26 points off those mistakes for the Heat.\n\n\r\n                    “We should have taken care of the ball better,” said Magic guard Terrence Ross, who had 31 points and made 8 of 13 3-point shots. “That was the game right there — turnovers.”\n\n\r\n                    All-Star center Nikola Vucevic scored 17 of his 38 points in the third quarter for Orlando, which lost its eighth straight. The Magic, who are 1-2 this season against the rival Heat, haven’t won since Feb. 21. Vucevic finished with 10 rebounds for his 26th double-double.\n\n\r\n                    Said Spoelstra of Vucevic, who has repeatedly bedeviled Miami through the years: “It feels like you’re looking at the modern-day Dirk Nowitzki.”\n\n\r\n                    Replied Vucevic, who hit six 3-pointers: “Dirk? That's one of the nicest thing anybody has ever said to me. To hear him say that, it means a lot.” \n\n\r\n                    Ross’ 28-footer that could have tied the game with 16 seconds left fell well short.\n\n\r\n                    Miami’s Kelly Olynyk had 18 points and seven rebounds, and Duncan Robinson chipped in 14 points, with four 3-pointers. The Heat won despite shooting 41.6% from the floor.\n\n\r\n                    EUPHORIC FOR EWING\n\n\r\n                    Magic coach Steve Clifford was a part of a couple of group text chats that included Pelicans coach Stan Van Gundy, Rockets coach Stephen Silas, ABC analyst Jeff Van Gundy and others who were rooting for former NBA star and assistant coach Patrick Ewing as his Georgetown Hoyas went on to win the Big East championship on Saturday. Ewing was on coaching staffs with Clifford in Houston, Orlando and Charlotte for 15 years.\n\n\r\n                    “He’s one of my closest friends and this will give you and idea — (Ewing) texts with my parents and they will tell you he’s an incredible person,” said Clifford, who noted that he also shared text messages with Charlotte owner Michael Jordan on Saturday while the two were rooting for Ewing’s Hoyas. “He attacked becoming a terrific coach the same way he attacked becoming a terrific player. … He deserves all of this because he’s made himself into a terrific coach.” \n\n\r\n                    TIP INS\n\n\r\n                    Heat: Andre Iguodala’s one basket was a 3-pointer that gave Miami a 93-92 lead with 3:42 to play. He added six rebounds. … Miami is 5-9 this season when shooting worse than 44%.\n\n\r\n                    Magic: Clifford said that Evan Fournier (groin strain), Aaron Gordon (ankle sprain) and James Ennis III (sore calf) “weren’t close for today.” … Orlando had more turnovers (seven) than field goals (six) in the first quarter. … GM Anthony Parker and head coach Stan Heath of the G League champion Lakeland Magic attended Sunday’s game.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Host Cleveland on Tuesday.\n\n\r\n                    Magic: Play at New York on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996785.8832839
}