{
  "game_id": "401810145",
  "espn_id": "401810145",
  "date": "Nov 24, 2025",
  "matchup": "PHX vs HOU",
  "headline": "Amen Thompson scores 28, Rockets roll past Suns 114-92 despite missing star Kevin Durant",
  "body": "PHOENIX -- — Amen Thompson scored 28 points, Aaron Holiday added 22 off the bench and the Houston Rockets beat the Phoenix Suns 114-92 on Monday night, despite not having star forward Kevin Durant in the lineup for the first time this season.\n\n\r\n              The Rockets won for the 11th time in 13 games, bouncing back from Friday night's loss to the Nuggets. The Suns three-game winning streak was snapped.\n\n\r\n              Houston was in control for most of the night, never trailing after early in the first quarter. The Rockets took an 84-75 lead into the fourth and the Suns never got closer than six.\n\n\r\n              Thompson shot 10 of 16 from the field and added eight assists and seven rebounds. Holiday made six 3-pointers.\n\n\r\n              Durant — a 15-time All-Star averaging a team-high 24.6 points per game — missed the game for personal reasons.\n\n\r\n              The matchup was a bit of a letdown after Sunday’s announcement that Durant wasn't playing, delaying his return to the city where he spent the previous 2 1/2 seasons. \n\n\r\n              The Suns traded Durant to the Rockets during the offseason in a seven-team deal in exchange for Dillon Brooks, Jalen Green and the No. 10 overall pick in the draft, which Phoenix used to select Duke center Khaman Maluach.\n\n\r\n              Brooks led the Suns with 29 points on 11 of 22 shooting. Devin Booker scored 18 and Collin Gillespie added 16. Phoenix shot 41.3% from the field and had 20 turnovers, which led to 26 points for Houston.\n\n\r\n              The Rockets took a 59-50 lead into halftime. Holiday scored 12 points for the Rockets before the break. Brooks and Gillespie had 13 for the Suns.\n\n\r\n              Houston has won five straight games against Phoenix. The Suns' 92 points were a season low.\n\n\r\n              Up next\r\n              Rockets: At Golden State Warriors on Wednesday night.\n\n\r\n              Suns: At Sacramento Kings on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042691.1929972
}