{
  "game_id": "0021500839",
  "espn_id": "400828726",
  "date": "Feb 22, 2016",
  "matchup": "PHX @ LAC",
  "headline": "Clippers hand Suns worst loss of dismal season, 124-84",
  "body": "LOS ANGELES --  The Los Angeles Clippers haven't lost two straight games since just before Blake Griffin got injured in late December. Without their resident superstar, J.J. Redick's scoring has picked up and DeAndre Jordan is demanding the ball.\n\nRedick scored 22 points in a 124-84 victory over Phoenix on Monday night that dealt the Suns their 12th consecutive loss overall and 15th in a row on the road.\n\nJordan added 17 points and 11 rebounds, and Chris Paul had 16 points and 14 assists for the Clippers, who split their previous two games against the West's top two teams, the Warriors and Spurs. Los Angeles had its way with the conference's second-worst team, earning its most lopsided win of the season while improving to 20-6 without Griffin.\n\n\"DJ commands a lot of attention when he ducks in and rolls for lobs,\" Paul said. \"It was great for us to feed him and get him going.\"\n\nJordan took over in the third quarter, scoring the Clippers' first 10 points to push their lead to 69-50. Besides making two free throws, the big man took a fast-break, alley-oop pass from Paul for a reverse dunk, scored on a hook shot and then dunked again. The Clippers outscored the Suns 31-19 in the period and built a 90-61 lead going into the fourth.\n\n\"Chris and J.J. put me in position to score easy baskets,\" Jordan said.\n\nArchie Goodwin scored 20 points off the bench for the Suns, who trailed the entire game on the way to their worst loss of the season. Alex Len added 14 points and Mirza Teletovic had 13.\n\n\"Effort is everything,\" Suns interim coach Earl Watson said. \"We're OK with losing if we're learning the right way to win. We can't take any shortcuts no matter who we face.\"\n\nThe Clippers shot 51 percent in the first half and led by 19 at the end of the first quarter.\n\nThe Suns opened the second quarter with a 16-1 run -- their lone stretch of success -- against the Clippers' reserves to close within four. Los Angeles went 0 for 4 and committed five turnovers in a span of 5:23.\n\n\"We've just got to learn how to buckle down when we have those spurts,\" Goodwin said. \"We can extend those spurts longer than we actually did.\"\n\nThat brought the Clippers' starters back, with Redick scoring 11 points during a 22-9 spurt that extended their lead to 59-42 at the break. Redick's 3-pointer capped the run in which he missed another 3 but scrambled for the offensive rebound and hit a pull-up jumper.\n\n\"We just let them have too many stretches where they made a lot of shots and we didn't cut them off,\" Goodwin said.\n\nRedick, Jordan, Paul and the other starters rested the entire fourth quarter. They watched the second unit increase the lead to 43 points -- their biggest of the year -- helped by six 3s in the period.\n\nClippers newcomer Jeff Green added 18 points.\n\nTIP-INS\n\nSuns: They haven't won on the road since Dec. 7 at Chicago. ... Their 11 previous losses were by an average of 12 points. ... C Tyson Chandler sat out with a bruised right shoulder. ... Phoenix fell to 2-8 in the second game of a back-to-back set, having lost to the Spurs by seven points on Sunday.\n\nClippers: They have won five of seven. ... Los Angeles assigned F Branden Dawson to the Erie Bayhawks of the NBA's D-League, his third such stint this season. He appeared in three games with the Clippers, with two points and three rebounds. ... A challenge for the upcoming season of \"Celebrity Apprentice\" was filmed during timeouts.\n\nFIRST POINTS\n\nAlex Stepheson scored his first points in the NBA with a basket in the fourth quarter. He recently signed a 10-day contract with the Clippers, having played overseas after not being drafted out of Southern California.\n\n\"I didn't even realize I scored my first basket. I was just thinking, get back on defense,\" he said. \"After the game, the coaches and the guys were like, `You scored your first basket' and made me dance and do all this stuff that showed me I was part of the team.\"\n\nRETOOLING SUNS\n\nNot long removed from his own NBA playing days, Watson is focused on getting the young Suns to believe in the team's style of play and each other.\n\n\"When you play the top teams in this league and you can take the punch, and the team still believes, and be uplifted even though a loss, it shows our resilience,\" the former UCLA star said. \"Resilience carries you in this league.\"\n\nUP NEXT\n\nSuns: Host Brooklyn on Thursday. The Nets won the first meeting 94-91 on Dec. 1.\n\nClippers: Host Denver on Wednesday. The Clippers have won six in a row at home against the Nuggets.",
  "source": "espn_api",
  "crawled_at": 1764994838.3129542
}