{
  "game_id": "0022000313",
  "espn_id": "401267473",
  "date": "Feb 01, 2021",
  "matchup": "LAL @ ATL",
  "headline": "Road warriors: James, Davis lead Lakers past Hawks 107-99",
  "body": "ATLANTA -- — There weren't many fans in the stands, but enough for LeBron James to get in some jawing along the sideline.\n\n\r\n                    He didn't mind a bit — especially after the Lakers closed out a nearly two-week-long trip with another victory.\n\n\r\n                    “Fans in the stands is just better,” James said with a smile.\n\n\r\n                    Anthony Davis scored 25 points and James dominated down the stretch as the Lakers held off the Atlanta Hawks 107-99 on Monday night.\n\n\r\n                    During the fourth quarter, James got into a brief verbal confrontation with a female fan who pulled down her mask to make a point.\n\n\r\n                    The referees halted the game and called in security officers, who appeared to eject the fan from State Farm Arena. There was a socially distanced crowd of 1,341 for the lone Atlanta visit by the reigning NBA champions.\n\n\r\n                    James said it was no big deal. In fact, he didn't think the fan should've been tossed.\n\n\r\n                    “At the end of the day, I'm just happy fans are back in the building,” he said. “I missed that interaction. I need that interaction.”\n\n\r\n                    The Lakers took control with a 16-0 run bookended around the end of the third period and the beginning of the fourth.\n\n\r\n                    Atlanta rallied, closing to 98-97 on Trae Young's 3-pointer. But James responded with a 3 of his own from the top of the key, came up with a huge block at the other end on Clint Capela, and finished off the Hawks with a fast-break layup off a pass from Kentavious Caldwell-Pope.\n\n\r\n                    James tacked on four straight free throws to seal the victory. He finished with 21 points after managing only nine through the first three quarters.\n\n\r\n                    Young led the Hawks with 25 points and 16 assists. \n\n\r\n                    Atlanta has struggled to close out games. Seven of its 10 losses are by single digits, most of them going down to the last few possessions.\n\n\r\n                    “It's tough,” said John Collins, who added 22 points for the Hawks. “We knew is would come down to the small things, the execution late in the game. It's just frustrating to lose like that. It was a hard-fought game. The one thing we can take away is we can play with anybody.”\n\n\r\n                    Los Angeles went 5-2 while playing seven road games in 12 days, certainly looking like the fresher team in the closing minutes against the Hawks.\n\n\r\n                    Atlanta appeared to be taking control, ripping off eight straight points late in the third for a 76-70 lead. But the Lakers stifled that run, scoring the final five points of the period, and followed with an 11-0 outburst to start the fourth quarter.\n\n\r\n                    \r\n                      James and Kyle Kuzma hit 3-pointers and Alex Caruso finished off the spurt with a dunk, pushing the Lakers to the first double-digit lead for either team to that point.\n\n\r\n                    In a brutal start to the fourth, the Hawks missed three straight shots, Danilo Gallinari committed two turnovers, and Bruno Fernando was whistled for an offensive foul.\n\n\r\n                    Davis went 10 of 14 from the field for the Lakers. Montrezl Harrell added 19 points, while James had nine assists.\n\n\r\n                    CARUSO'S ROLE\n\n\r\n                    Caruso again had the best plus-minus rating on the Lakers, who outscored Atlanta by 13 points while he was the court.\n\n\r\n                    Undrafted out of college, the fifth-year guard has claimed a bigger role in the playing rotation with his contributions at both ends of the court. He had eight points, two assists and two steals in nearly 25 minutes of playing time.\n\n\r\n                    “He's one of our best players,” coach Frank Vogel said. “That's the simplest way to put it. He typically moves the needle in a positive direction.”\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Extended their streak to 31 straight victories when holding an opponent below 100 points. ... Los Angeles has won eight of its last nine meetings against Atlanta. ... James extended his NBA record streak of double-digit games to 1,017 in a row.\n\n\r\n                    Hawks: De'Andre Hunter missed the game after undergoing a non-surgical procedure on his right knee. It's not known how long the second-year player will be out. ... Atlanta also was missing rookie C Onyeka Okongwu (left Achilles soreness). ... Capela picked up his third foul with 9:57 left in the second quarter and spent the rest of the half on the bench. \n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Finally return home to face the Denver Nuggets on Thursday.\n\n\r\n                    Hawks: Host the Dallas Mavericks on Wednesday.\n\n\r\n                    ------\n\n\r\n                    Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 and find his work at https://apnews.com/search/paulnewberry\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997316.8167539
}