{
  "game_id": "0021700376",
  "espn_id": "400975127",
  "date": "Dec 09, 2017",
  "matchup": "MIA @ BKN",
  "headline": "Dragic,  Johnson help Heat beat Nets in Mexico City",
  "body": "MEXICO CITY --  The Miami Heat spent a lot of time in the last couple of days as a group of tourists in Mexico City. When they got back in the court, they were all business.\n\nGoran Dragic and Tyler Johnson each scored 20 points and Miami beat the Brooklyn Nets 101-89 on Saturday in the Heat's first game in Mexico in franchise history.\n\nPlaying in front of 19,777 fans at raucous Arena Ciudad de Mexico -- and with former Heat star Chris Bosh courtside, around the team for a game for the first time in well over a year -- Dragic was 9 of 19 from the field and had seven rebounds for Miami. The Heat snapped a two-game losing streak to improve to 12-13.\n\n\"It was a terrific and easy trip coming down from San Antonio, we had a day off to go out and see the city, you don't travel all this way to watch TV in your room, I'm going to need to get on a diet after this trip,\" said Miami coach Erik Spoelstra, who said he visited as many cafes as possible. \"It was fun but then we got back to work and we prepared good for tonight's game.\"\n\nJames Johnson added 17 points, Justise Winslow had 15 and Kelly Olynyk 11 for Miami. The Heat rallied from two seven-point deficits, using a stingy defense that allowed only 36 points in the second half.\n\n\"It was a great game for us, especially on the defensive end,\" Dragic said. \"Tyler played great and the second unit gave us the extra boost that we needed, we have a deep bench and everybody can play.\"\n\nMiami arrived Wednesday night after a loss in San Antonio. The players had a video session the day after and Spoelstra left them visit the city the rest of the day.\n\nMost of the players and coaches went shopping and sightseeing in Polanco, an upscale neighborhood in the capital.\n\n\"The fans are terrific, it's a great environment,\" Spoelstra said. \"I was pleasantly surprised walking around and seeing NBA games on the T.V. everywhere we went, and the fans recognized us, it felt like we were in Miami\".\n\nBy arriving two days ahead of the game, the Heat had a chance to know the city but it came with a price because they struggled early in the game with the altitude. Mexico City's 7,350 feet above sea level is at a far higher elevation than Denver -- the NBA's highest venue at 5,280 feet.\n\nProfessional teams try different approaches to avoid the effects of the altitude on the body and usually, arriving as close to a game as possible is regarded as the way to go.\n\n\"It was tough, it feels like we played two games, but `Spo' (Spoelstra) did a great job rotating so we could stay fresh,\" Dragic said.\n\nRondae Hollis-Jefferson led the Nets with 18 points. Coming off a 100-95 victory over Oklahoma City on Thursday night in the Mexico City opener, the Nets dropped to 10-15.\n\nIn the third quarter, the Nets took a seven-point lead on Tyler Zeller's layup, but Dragic sealed a 10-2 run to give Miami a 60-59 lead and the Heat took a 75-72 advantage into the final period.\n\nBOSH COURTSIDE\n\nBosh was warmly welcomed by his former club. Bosh and his wife Adrienne got long hugs from Spoelstra, and Bosh interacted with players throughout the night. Bosh's career with the Heat was cut short by recurring bouts with blood clots. \"He looks good,\" Spoelstra said, according to The Palm Beach Post. \"His family, his kids are doing well. I love CB. He's Heat family for life.\" Bosh even did one of his trademark videobombs during the televised postgame interview with Winslow, drawing laughs.\n\nREGULAR VISITORS\n\nThe game between the Heat and the Nets was the fourth in Mexico this year. It marks the first time the NBA has hosted four international regular-season games in the same country in one calendar year (outside Canada). In January, the Phoenix Suns played the Dallas Mavericks and the San Antonio Spurs. Also, the game was the 26th south of the border since 1992, also a record for any nation besides the U.S. and Canada.\n\nINCHING ON RILEY\n\nSpoelstra (452-295) is two wins short from tying Pat Riley (454-395) for the most wins in Heat history. Spoelstra is the only second active coach in the NBA to record at least 450 wins with their current team. The other one is Gregg Popovich.\n\nFEELING THE HEAT\n\nThe Nets suffered their sixth straight loss to the Heat. Brooklyn has not beaten Miami since Dec. 28, 2015.\n\nUP NEXT\n\nHeat: At Memphis on Monday night.\n\nNets: Host Indiana on Tuesday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993566.83099
}