{
  "game_id": "0021801060",
  "espn_id": "401071733",
  "date": "Mar 19, 2019",
  "matchup": "HOU @ ATL",
  "headline": "Harden, Capela lead Rockets to easy win over Hawks",
  "body": "ATLANTA --  Chris Paul wasn't concerned that Houston would keep struggling to hit shots.\n\n\"In the first half we weren't making anything,\" he said. \"We looked, and it was tied up and we were down two at some point. Once we started making stops, we can blow this game open, man. That's what I always say. `If we're not making shots, you better go on a run on us.' \"\n\nJames Harden had 31 points and 10 assists, Clint Capela added 26 points and 11 rebounds and the Rockets won their third straight game with a 121-105 victory over the Atlanta Hawks on Tuesday night.\n\nThe Rockets have won 12 of 13 and have 10 wins in their last 13 road games.\n\nIt was a lopsided matchup. The Hawks, led by Trae Young's 21 points and 12 assists and John Collins' 20 points 10 rebounds, are rebuilding and likely headed for the NBA draft lottery. Houston is third in the Western Conference and has plenty of star power.\n\nHarden, the league's scoring leader, is trying to become the first player since Michael Jordan in 1988-89 to average at least 30 points, seven assists, six rebounds and two steals.\n\nAtlanta had no player able to defend him for long as he finished 8 for 18 from the field and 11 of 12 from the foul line. Harden set a new NBA single-season high of 890 attempts beyond the arc, four more than Stephen Curry took in 2015-16.\n\nPaul, who last month joined Oscar Robertson, Magic Johnson, John Stockton and Jason Kidd as the only players with at least 17,000 career points, 9,000 assists and 4,000 rebounds, had 13 points, 11 assists, three steals and just one turnover.\n\n\"We get most of the shots that we want every night,\" Paul said. \"It's just a matter of whether or not they go in. We just keep trying to turn the defense and push the tempo and we feel like we can make shots.\"\n\nCapela got his sixth straight double-double and 37th overall.\n\n\"Their second-half execution was tough,\" Collins said. \"I think they turned it up a little bit, hit a lot of tough shots and that pushed the lead out. With a team like that, if they get a lead, they know how to keep it.\"\n\nHouston struggled beyond the arc in the first half, missing 13 of its first 15 attempts, and entering the third was just 4 for 21.\n\nBut just as they did Sunday with 21 3s in a win over Minnesota, the Rockets came out of the break quickly, finishing the period with eight 3s to take charge of the game.\n\nThe Hawks never had a chance the rest of the way, letting Houston push the lead to 93-78 early in the fourth when Paul fed Kenneth Faried for a layup.\n\nAtlanta took a two-point lead early in the third on Dewayne Dedmon's 3, but it lasted just a few seconds. P.J. Tucker, Paul and Harden each followed with a 3 to make it 68-61. The Hawks called timeout before Harden and Tucker each hit a 3 to push the lead back to double digits.\n\nHarden fed Capela for a dunk that made it 78-67, and Atlanta coach Lloyd Pierce asked for another timeout. It did little to slow Houston, which went up 104-84 on Paul's 3.\n\nCapela's three-point play in the second quarter made it 53-42 for the game's first double-digit lead on an 11-1 Houston run.\n\n\"We have a lot of knockdown shooters,\" Harden said. \"Offensively, we can get it going at any moment. If we can sustain our defensive pressure for an entire game, then we can put a lot of pressure on the other team's defense.\"\n\nTIP-INS\n\nRockets: Danuel House Jr. had six 3s and 19 points. ... Houston finished with 19 3s, two nights after getting 21 against the Timberwolves. .. Coach Mike D'Antoni continued his pattern of resting players. C Nene sat out Tuesday and will do so on Wednesday. G Iman Shumpert was given Tuesday off. ... Harden has at least 10 assists in his last five games.\n\nHawks: Rookie G Kevin Huerter went 2 for 9 from the field and finished with four points in 27 minutes. ... 41-year-old Vince Carter, a reserve, had 14 points and nine rebounds in 27 minutes.\n\nUP NEXT\n\nRockets: At Memphis on Wednesday.\n\nHawks: Host Utah on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995287.521517
}