{
  "game_id": "0022000721",
  "espn_id": "401307511",
  "date": "Mar 31, 2021",
  "matchup": "DET vs. POR",
  "headline": "Trail Blazers beat Pistons 124-101 for 4th straight win",
  "body": "DETROIT -- — Damian Lillard had 33 points and 10 assists and the Portland Trail Blazers beat the Detroit Pistons 124-101 on Wednesday night.\n\n\r\n                    CJ McCollum added 24 points and Carmelo Anthony and Robert Covington each scored 16 as Portland finished an undefeated four-game road trip.\n\n\r\n                    “It is always tough to win games on the road in this league, and that's especially true in these circumstances,” Portland coach Terry Stotts said. \"We had a 3-0 trip earlier in this season, and we thought these were four winnable games.\n\n\r\n                    “But this was the last game of a road trip against a team with a poor record, so we could have overlooked it. That didn't happen.”\n\n\r\n                    Jerami Grant scored 30 points for Detroit, which lost for the fifth time in six games. Mason Plumlee added 18 points, but Detroit's other three starters — Saddiq Bey, Josh Jackson and Saben Lee — combined for two points on 1-for-17 shooting.\n\n\r\n                    “Jerami got his 30, but that was a tough 30 points,” Pistons coach Dwane Casey said. “We've got a lot of guys out right now, but we need someone to step up and help him out.”\n\n\r\n                    Grant had 17 first-half points to help Detroit to a 52-51 lead, but Lillard's 3-pointer on Portland's first possession of the second half started a 17-2 run. The Trail Blazers hit their first five 3-point attempts of the quarter and Lillard finished with 16 points in the period as Portland took an 87-79 lead.\n\n\r\n                    “Teams always have a lot of energy at the start of games, but that doesn't always translate to the second half,\" Lillard said. “Right now, stepping it up in the third quarter of games is our specialty and we have to keep doing that.”\n\n\r\n                    The Pistons cut the gap to six early in the fourth quarter, but couldn't put together a sustained run.\n\n\r\n                    Portland shot 59.5% from the floor in the second half, including 9-19 on 3-pointers, and hit 20 of 21 free-throw attempts.\n\n\r\n                    “Guarding the 3-point line is a huge part of defending an elite team like Portland, and I thought we did a good job of that in the first half,” Casey said. “They got away from us in the second half, though.”\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: Anthony played his 35th career game against the Pistons, the team that passed on him in the 2003 NBA draft to select Darko Milicic. He hasn't had much success against them. His 21.4 scoring average is lower than against any other opponent than San Antonio (19.2), and his average of 5.1 rebounds is his worst against any team.\n\n\r\n                    Pistons: Bey entered the game needing four 3-pointers to break Brandon Knight's franchise rookie record of 105, set in 2011-12. But he fouled out after missing all seven 3-point attempts. \n\n\r\n                    NEWEST PISTON PLAYS BIG ROLE\n\n\r\n                    Hamadou Diallo, playing his third game since being acquired from the Oklahoma City Thunder on March 13, had 19 points on 7-for-8 shooting in a reserve role.\n\n\r\n                    “We're very excited about that young man's potential, because he gives us someone who can shoot from the outside and attack the basket,” Casey said. “He's not a finished product, especially as an outside shooter, but he has a lot of room to grow.”\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Host the Milwaukee Bucks on Friday.\n\n\r\n                    Pistons: Host the Washington Wizards on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997910.923465
}