{
  "game_id": "0022400047",
  "espn_id": "401703416",
  "date": "Nov 29, 2024",
  "matchup": "CHI vs. BOS",
  "headline": "Tatum scores 35, Pritchard adds 29 off the bench and Celtics outlast Bulls 138-129",
  "body": "CHICAGO -- — Jayson Tatum scored 35 points and had 14 rebounds to lead the Boston Celtics past the Chicago Bulls 138-129 in Friday night’s NBA Cup pool game.\n\n\r\n              Reserve Payton Pritchard added a season-best 29 points, including 11 straight during a fourth-quarter run that gave the Celtics the lead for good.\n\n\r\n              Nikola Vucevic scored a season-high 32 points and had 11 rebounds for Chicago, which could have secured a spot in the Cup quarterfinals with a victory. Atlanta, which defeated Cleveland earlier in the day, secured the Group C berth and will advance to the knockout round.\n\n\r\n              Boston still as a shot at the wild-card berth but it depends on the outcome of Tuesday’s games.\n\n\r\n              Zach LaVine added 29 points for the Bulls, including four 3-pointers to become the franchise's career leader in made 3s.\n\n\r\n              Tied at 108, Pritchard made 3-pointers on consecutive possessions to start an 11-4 run that gave Boston breathing room. Jaylen Brown and Kristaps Porzingis each added 21 points.\n\n\r\n              Takeaways\r\n              Celtics: Boston had its complete roster available for the first time this season but only three reserves played significant minutes. It didn’t hurt that Pritchard, who played 28 minutes and most of the fourth quarter, was part of that trio.\n\n\r\n              Bulls: LaVine’s third 3-pointer with 3:05 to play pulled the Bulls within 125-122 and made him the franchise’s career leader. He finished with four 3s and now has 1,051, two more than Kirk Hinrich.\n\n\r\n              Key moment\r\n              Pritchard hit a deep 3-pointer with 5:25 to play to cap his 11-point spurt and put Boston ahead 119-112. He finished the night 7 for 11 from behind the arc and scored all but five of the Celtics’ 34 bench points.\n\n\r\n              Key stat\r\n              The Celtics were 15 for 23 from the floor in the fourth quarter.\n\n\r\n              Up next\r\n              Boston travels to Cleveland on Sunday. Chicago welcomes Brooklyn on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997094.9942431
}