{
  "game_id": "0021500370",
  "espn_id": "400828257",
  "date": "Dec 15, 2015",
  "matchup": "MIL @ LAL",
  "headline": "Kobe scores 22, leads Lakers' 113-95 rout of Milwaukee",
  "body": "LOS ANGELES -- Kobe Bryant felt the old spring in his legs and the familiar certainty in his shot. The rest of the Los Angeles Lakers rolled right along with him to a comfortable win.\nIn a rough farewell campaign, Bryant knows it's important to savor good times such as the Lakers' biggest blowout in two seasons.\nBryant had 22 points and six assists during a 113-95 victory over the Bucks on Tuesday night in Milwaukee's first game since ending Golden State's unbeaten run at 24-0 to start the season.\nD'Angelo Russell had 19 points and seven assists as the Lakers took a 22-point lead in the third quarter and cruised to their second victory in 15 games, snapping a six-game skid and improving to 4-21. Lou Williams scored 16 points, while Julius Randle had 14 points and 14 rebounds.\n\nBryant got \"M-V-P!\" chants throughout the night, and the crowd chanted his name while he relaxed on the bench with the Lakers up 20 in the closing minutes.\n\"For me, it's even more special because I want to appreciate every chance to come to this arena,\" Bryant said. \"Just taking it all in, because I know it'll be over in the bat of an eye.\"\nMichael Carter-Williams scored 19 points for the Bucks, who played without leading scorer Greg Monroe in their first game since snapping the Warriors' 28-game winning streak dating to last season.\n\"It's very humbling,\" said John Henson, who scored six points while starting in Monroe's place.\nMonroe was a late scratch with a sore left knee for the Bucks, who have lost 10 straight road games.\n\"We missed Moose tonight,\" Milwaukee coach Jason Kidd said. \"But we're not putting this on Moose being out. This is about the guys who had the uniform on tonight didn't give any effort.\"\nMONROE'S INJURY\nHenson said Monroe was hurt during the Bucks' morning shootaround in Beverly Hills.\n\"We were just kind of going through some things, then somebody tripped and kind of fell into his legs,\" Henson said. \"It happens. So you've got to be ready.\"\nTHE BLUEPRINT\nThe Lakers had a season-high 26 assists, grabbed 18 offensive rebounds and produced seven double-digit scorers for the first time this season.\nThey pushed their lead to 18 points in the third quarter on a four-point play by Bryant. Moments later, Los Angeles was up by 22 -- its largest lead at any point in the entire season.\nLos Angeles finished with its largest margin of victory since March 30, 2014 -- two seasons, 115 games and 26 wins ago.\n\"I think this is the blueprint tonight of how we've got to play every game,\" said Jordan Clarkson, who had 11 points.\nKOBE CHRONICLES\nBryant had a productive, relatively efficient game in the Lakers' return to Staples Center after a 1-7 road trip. He also got the fourth quarter off after playing in his 11th game in 18 days.\n\"He is one of the best to ever play this game, and given the opportunity, he can embarrass you,\" Kidd said. \"And he did that tonight.\"\nBryant shot an airball on his first attempt, but later hit four straight to finish the first quarter with 10 points. He hit three 3-pointers and finished 7 for 15 from the field, building on his improved shooting in the past four games.\n\"My legs feel much better,\" said Bryant, who complained of severe fatigue early in the season. \"I feel in a better rhythm. Feels like my legs kind of caught up.\"\nSHORT ANSWER\nSo does such a solid performance in a victory inspire second thoughts about Bryant's impending retirement?\n\"No,\" he said. \"Honestly, no.\"\nTIP-INS\nBucks: G Greivis Vasquez will be out for three to four months after having knee surgery Tuesday. ... G Jerryd Bayless isn't on the trip due to a sprained ankle.\nLakers: Clarkson returned from a two-game absence with an ankle injury. ... Rookie Larry Nance Jr. threw down a high-flying dunk on Henson in the third quarter.\nUP NEXT\nBucks: At Clippers on Wednesday.\nLakers: Host Rockets on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994077.070285
}