{
  "game_id": "0022300267",
  "espn_id": "401584895",
  "date": "Nov 30, 2023",
  "matchup": "MIA vs. IND",
  "headline": "Butler scores 36, Heat get hot late to top Pacers 142-132 and snap a 3-game slide",
  "body": "MIAMI -- — The last time Miami scored 45 points in a fourth quarter was 1989, long before Pat Riley arrived in South Florida, long before Erik Spoelstra arrived, long before most of the current Heat players were born.\n\n\r\n              It happened again Thursday to fuel a comeback win.\n\n\r\n              The Heat made 15 of their final 17 shots and Jimmy Butler's 36 points led the way as Miami topped Indiana 142-132 — despite the Pacers getting a career-high 44 points from Tyrese Haliburton.\n\n\r\n              The 45 fourth-quarter points were second-most in team history, topped by only a 48-point fourth against New York on March 2, 1989. And it was the third-most total points in Heat history, more than 31 above their season average.\n\n\r\n              “That's definitely not our style of basketball,” Butler said. “But a win is a win.”\n\n\r\n              Rookie Jaime Jaquez Jr. scored 14 of his 24 in the fourth quarter for the Heat, who trailed by 13 early and didn’t take the lead for the first time until about 10 minutes remained. Butler added 10 rebounds, Josh Richardson scored 19 points and Duncan Robinson added 16 for Miami, which snapped a three-game slide.\n\n\r\n              The Heat used a 28-6 run in the fourth to take control in the opener of a two-game series. They host the Pacers again Saturday.\n\n\r\n              “I thought the fourth-quarter defense was really good,” Spoelstra said. “They're not an easy team to defend.”\n\n\r\n              Haliburton scored 28 points in the first half for the Pacers, who had 73 points at intermission — then gave up 78 in the second half. Haliburton also had 10 assists, the NBA's first game of at least 44 points and that many assists since Donovan Mitchell's 71-point, 11-assist night for Cleveland on Jan. 2.\n\n\r\n              Obi Toppin scored 25 for the Pacers, who trailed by as many as 16 in the fourth before making a late run. Bruce Brown scored 15 and Buddy Hield had 12, though shot 2 for 11 from 3-point range.\n\n\r\n              The Pacers are averaging 127.9 points, slightly ahead of Denver’s NBA-record average of 126.5 set in 1981-82. \n\n\r\n              Problem is, they're giving up 125.8 points — the worst in the league this season. Only two teams, the 1981-82 and 1990-91 Denver Nuggets, finished a season allowing more points per game.\n\n\r\n              “Ultimately, it comes down to defense,” Haliburton said. “We can score against anybody as a group. ... But at some point this year, we’re going to have to get some stops to win games. That’s not on the coaching staff. It’s on us as players. And, you know, it starts with me.”\n\n\r\n              The Heat lost All-Star center Bam Adebayo in the second quarter after a bruised left hip was aggravated; Adebayo has been dealing with that problem for several days and missed a game last week because of that hip.\n\n\r\n              Indiana missed 20 shots (12 for 32) in the fourth to three for Miami (15 for 18). The Pacers were 3 for 17 from 3-point range in the fourth, while the Heat went 2 for 2.\n\n\r\n              “Fourth quarter was obviously very rough,” Pacers coach Rick Carlisle said. “We've got to play better overall. We've got to make more shots. We've got to defend situations better.”\n\n\r\n              Miami paid tribute to longtime Pacers media relations director David Benner, who died earlier this year. A seat was left in Benner's honor courtside, with a bouquet of yellow flowers — the Pacers' primary color.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995380.449142
}