{
  "game_id": "0021900015",
  "espn_id": "401160657",
  "date": "Oct 24, 2019",
  "matchup": "MIL @ HOU",
  "headline": "Bucks beat Rockets 117-111 in Westbrook's Houston debut",
  "body": "HOUSTON --  When Giannis Antetokounmpo fouled out with more than five minutes left after putting up a triple-double against the Houston Rockets, the rest of the Milwaukee Bucks didn't panic.\n\n\"These guys in this locker room, we're fighters, we're competitors,\" Wesley Matthews said. \"If Giannis fouls out we can't just come into the locker room.\"\n\nAntetokounmpo scored 30 points and his supporting cast held on to lead the Bucks to a 117-111 victory over the Rockets on Thursday night in a star-studded opener featuring the last three MVPs.\n\nAntetokounmpo, the MVP last season, also had 13 rebounds and 11 assists. While certainly upset after fouling out, he was impressed with the way his team responded.\n\n\"They did an amazing job,\" he said. \"Moving the ball, knocking down shots.\"\n\nBrook Lopez made two free throws with about a minute left before a layup by Russell Westbrook. But Lopez made a fadeaway shot to leave Milwaukee up 115-109 with 39 seconds remaining. James Harden added a pair of free throws before Ersan Ilyasova made a jump shot with about 15 seconds to go that sent many fans heading to the exits.\n\nSome had wondered what would happen with the pairing of the two ball-dominant guards in Harden and Westbrook after the 2017 MVP was traded from Oklahoma City for Chris Paul this summer. In their first game together with the Rockets both filled up the stat sheet, but they were unable to come away with a win after leading for much of the game.\n\nWestbrook had 24 points, 16 rebounds and seven assists.\n\nHarden, the 2018 MVP, added 19 points, 14 assists and seven rebounds. He was 2 of 13 from the field, 1 of 8 on 3s and made 14 free throws without a miss.\n\n\"They're going to be fine,\" coach Mike D'Antoni said. \"It's sad to say, but we're not going to win 82 games this year. Now we've got a chance to win 81.\"\n\nThe Bucks led by six when Antetokounmpo fouled out. He walked to coach Mike Budenholzer and implored him to challenge the call, but he'd already used his one challenge per game that coaches get this season and couldn't do anything to help his superstar.\n\nHarden echoed his D'Antoni's sentiment and raved about Westbrook.\n\n\"Everybody saw it tonight,\" Harden said. \"He's a different type of breed on that court. But it's Game 1, we're not going to get too down, and even if we won, we're not going to get too excited.\"\n\nHouston scored the next five points, with the last four from Westbrook to cut the lead to 101-100. But Khris Middleton hit a 3-pointer with 3 1/2 minutes left to stretch Milwaukee's lead.\n\nThe Bucks were up by six with about two minutes left before P.J. Tucker knocked a 3 from the corner. But Matthews added a 3-pointer for Milwaukee seconds after that to push the lead to 111-105.\n\nMilwaukee opened the fourth quarter with a 13-3 run to make it 91-90 and take its first lead of the night. Antetokounmpo led the way in stretch, scoring eight points. The Rockets missed several shots and had a turnover before they finally got back on track.\n\nThere were about eight minutes left when Harden found Westbrook connected on two straight plays. On the first one Harden dished to Westbrook and he was fouled on a layup to get a 3-point play. The next time down the court Harden sent a bounce pass to Westbrook in the lane and he finished with a two-handed dunk that put Houston up 95-91 and brought a huge ovation from the crowd.\n\nBut the Bucks made the next 10 points, led by five from Brook Lopez, who capped the run with a 3-pointer to make it 101-95 with about 5 1/2 minutes left.\n\nTIP-INS\n\nBucks: Lopez had 14 points and four rebounds. ... Ilyasova had13 points and 11 rebounds off the bench. ... Milwaukee made 16 of 46 3-pointers.\n\nRockets: Tucker had 17 points and made five 3-pointers. ... Houston also made 16 3-pointers. ... Clint Capela had 13 points and 12 rebounds.\n\nNBA/CHINA RELATIONSHIP\n\nA group of 30 fans held signs and wore shirts in support of anti-government protesters in Hong Kong at the game.\n\nHouston general manager Daryl Morey angered China with a since-deleted tweet in support of the protesters earlier this month.\n\nWednesday's opening-night games were not televised in China in the wake of Morey's tweet that caused tension between the NBA and Chinese officials.\n\nOne man held a sign the read: \"Thank you Morey,\" with a red heart after Morey's name. Another sign read: \"No censorship in America\" and a third declared: \"Freedom is not FREE.\" Another man held a sign that said: \"Fight for freedom, stand with Hong Kong,\" which are the exact words included in Morey's tweet.\n\nUP NEXT\n\nBucks: Host Miami on Saturday.\n\nRockets: Host New Orleans on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996189.936929
}