{
  "game_id": "0022300592",
  "espn_id": "401585220",
  "date": "Jan 20, 2024",
  "matchup": "MIL @ DET",
  "headline": "Lillard has 45 points and 11 assists to lead the Bucks past the Pistons, 141-135",
  "body": "DETROIT -- — Damian Lillard had 45 points and 11 assists to lead the Milwaukee Bucks to a 141-135 victory over the Detroit Pistons on Saturday.\n\n\r\n              “Dame was so great tonight, and he was competing on both sides of the ball,” Bucks coach Adrian Griffin said. “I had no idea he had 45, but he's a rhythm player and he definitely got into a rhythm out there. He made big shots, and that's why he's on this team.”\n\n\r\n              Lillard was the first player in Bucks history with at least 40 points, 10 assists and five 3-pointers in a game.\n\n\r\n              “I had a good warmup and I got a couple shots to go in, so I felt good,” he said. “I knew it was an important game, so I picked my spots. I moved the ball when I needed to move the ball and I attacked when I needed to attack.”\n\n\r\n              Giannis Antetokounmpo added 31 points, 10 rebounds and nine assists, but missed 11 of his 22 free throw attempts. Brook Lopez had 19 points for the Bucks, who have won four of five.\n\n\r\n              “Giannis was big on both ends,” Griffin said. “He got us some stops at the start of the second half and he was aggressive with the ball and getting to the rim. When he draws fouls, he gets us to the bonus faster than a lot of teams, and that's invaluable.”\n\n\r\n              Alec Burks (33) and Ausur Thompson (career-high 22) combined for 55 points for Detroit's second unit, but Bojan Bogdanovic (19) and Jaden Ivey (18) were the only starters to reach double figures in the opener of a two-game series.\n\n\r\n              “Burks has been phenomenal. I'm trying to think of veterans who've been this type of player in the past,” Pistons coach Monty Williams said. “His ability to score the ball and communicate with the young guys on the floor have helped us a ton.”\n\n\r\n              The Pistons are 2-37 in their last 39 games, including a record-tying 28-game losing streak. They host Milwaukee again Monday.\n\n\r\n              Antetokounmpo had five points in a 9-0 run that gave the Bucks a 126-121 lead with 4:40 to play, but he missed his 10th free throw seconds later.\n\n\r\n              Lillard, though, scored five straight points to push Milwaukee's lead back to 134-126 with 2:11 left.\n\n\r\n              “It's hard to play defense when a team has (49) free throws,” Williams said. “I feel bad for our team because we're trying to play good basketball and good defense.”\n\n\r\n              Detroit missed seven of its first eight shots in the third, allowing Milwaukee to go ahead 80-71. Antetokounmpo continued to struggle from the line, missing eight of his first 12 attempts to keep Detroit in the game.\n\n\r\n              Lillard finished with 19 points in the quarter, giving him 36 for the game, but the Pistons were still within 103-98 at the end of the third. Mike Muscala hit back-to-back 3-pointers early in the fourth, putting Detroit up 106-105. \n\n\r\n              The Bucks took a 70-67 halftime lead on Lilliard's 31-footer at the buzzer. He had 17 points and seven assists as both teams shot over 50% from the floor.\n\n\r\n              “We need to take better care of the 3-point line on Monday,” Griffin said. “Will they shoot like this next time? I don't know, but we have to make sure we don't give them that confidence.”",
  "source": "espn_api",
  "crawled_at": 1764996130.607056
}