{
  "game_id": "0021500727",
  "espn_id": "400828614",
  "date": "Feb 01, 2016",
  "matchup": "TOR @ DEN",
  "headline": "Nuggets end Raptors' 11-game winning streak, 112-93",
  "body": "DENVER -- The Toronto Raptors were ready for Danilo Gallinari. They didn't have an answer for Nikola Jokic.\nThe rookie center had 27 points and 14 rebounds, and the Denver Nuggets ended Toronto's 11-game winning streak with a 112-93 victory over the Raptors on Monday night.\nJokic's totals were season highs. He had 23 points and 12 rebounds against San Antonio on Nov. 28 and now has four double-doubles in his past five games. The 20-year-old Serbian has surpassed even his own expectations for this season.\n\"When I came here I didn't think I would play,\" he said. \"Now I have trust from the coach.\"\nHis effort Monday eased the burden on Gallinari, Denver's leading scorer. Gallinari had just 13 points on 4-of-7 shooting and let Jokic dominate Toronto.\n\n\"He had a good game. I'm very happy for him,\" Gallinari said. \"I told him the challenge is for him to do that every night.\"\nWill Barton scored 20 points and Randy Foye had 16 for the Nuggets, who swept the season series. They won in Toronto on Dec. 3 to stop an eight-game losing streak.\nThe Raptors entered with the NBA's longest current winning streak but couldn't duplicate the success they had in January. They led by one midway through the second quarter but trailed by double digits for most of the second half.\nA frustrated Dwane Casey emerged from the locker room after the game with a crumpled boxscore.\n\"You can describe it any way you want to,\" the Toronto coach said. \"That was a stinker. That was one of our worst performances of the year. We played like we were playing in mud. You can blame it on the altitude, whatever it was. We stunk.\"\nDeMar DeRozan led Toronto with 24 points. His All-Star backcourt mate, Kyle Lowry, scored just nine and went 1 for 6 from the foul line.\nLowry said Casey was angry with the performance and suggested his players use the boxscore as toilet paper.\n\"That describes this night for us,\" he said. \"We just didn't have it tonight and they kicked our (butts).\"\nJokic was a problem for the Raptors from the start. He nearly had a double-double in the first half with 15 points and seven rebounds. He started slowly in the second half but scored six straight points late in the third quarter to give the Nuggets a 73-60 lead. His last basket in the sequence came when he cut through the lane and dunked off a pass from Emmanuel Mudiay.\nJokic went 2 of 4 from the line in the final 1:57 of the third to tie his career high. He came in late in the fourth and set new highs for his rookie season.\n\"What a performance. Every time I think he's kind of maxed out for his rookie season, he finds a way to keep on impressing me,\" Denver coach Michael Malone said. \"You can talk about some of these other young bigs, who are all talented, and I wouldn't trade him for anybody in the world. He's a special young man and a special young talent. He's only going to get better as he gets stronger.\"\nThe Nuggets put the game away early in the fourth. Barton scored the first eight points of the quarter to make it 88-65. Foye hit a 3-pointer to make it 97-70 with 8:03 left.\nTIP-INS\nRaptors: F James Johnson left late in the second quarter with a sprained left ankle and did not return. He was hurt when he collided with Gallinari at midcourt. ... Casey was selected the Eastern Conference coach of the month for January. The Raptors were 12-2 in the month, including seven straight wins at home.\nNuggets: G Jameer Nelson was inactive with a sore left wrist. Nelson missed six games with the injury before returning for two. He aggravated the injury in Saturday's overtime loss at Indiana. ... A winter storm that rolled through the Denver area Monday contributed to the low attendance of 10,007 at Pepsi Center.\nUP NEXT\nRaptors: At Phoenix on Tuesday night.\nNuggets: At Utah on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994723.841365
}