{
  "game_id": "0022301124",
  "espn_id": "401585752",
  "date": "Apr 04, 2024",
  "matchup": "ATL @ DAL",
  "headline": "Luka Doncic finishes with 25 points after scoreless 1st quarter, Mavs beat Hawks 109-95",
  "body": "DALLAS -- — Luka Doncic finished with 25 points after a rare scoreless first quarter and the Dallas Mavericks stayed alone in fifth place in the Western Conference with a 109-95 victory over the Atlanta Hawks on Thursday night.\n\n\r\n              Kyrie Irving scored 26 points and Doncic had 12 rebounds and eight assists as the Mavericks opened a rare stretch of three home games in four days with their 12th victory in 14 games.\n\n\r\n              Dallas, which clinched a spot in the postseason, was coming off a five-game trip, the longest of the season.\n\n\r\n              “We were little tired, first game back from a long road trip,” coach Jason Kidd said. “But I thought the chemistry and trust was showing again. It wasn’t pretty, but we did what we had to do.” \n\n\r\n              The juggled home slate came after a scheduled game at Golden State in January was postponed following the death of Warriors assistant coach Dejan Milojevic.\n\n\r\n              Golden State visits Friday night to finish a back-to-back for both teams, with the Warriors coming off a 133-110 victory in Houston that was a big step toward clinching a spot in the West play-in tournament. \n\n\r\n              Dallas' game against Atlanta was moved up a day in order for Golden State's visit to be pushed back three nights. That cleared the way for the Mavs' rescheduled game in California, where the Warriors won 104-100 on Tuesday.\n\n\r\n              The Mavericks are a game ahead of Phoenix, which holds the final guaranteed playoff spot in the West, and have the tiebreaker on the Suns. \n\n\r\n              Sacramento, New Orleans and the Los Angeles Lakers have a realistic shot at the No. 6 as well. The Suns and Pelicans joined the Mavs in clinching top-10 spots Thursday night.\n\n\r\n              Bogdan Bogdanovic scored 17 points and Dejounte Murray added 16 for the Hawks, who have clinched a spot in the play-in tournament in the East and are jockeying with Chicago for the final two spots as the ninth and 10th seeds.\n\n\r\n              The Hawks trimmed a 17-point Dallas lead in the third quarter to seven early in the fourth, but a scoring drought of more than five minutes followed to keep Atlanta from getting closer. The Hawks matched their season low in scoring after averaging 120 points in the previous seven games.\n\n\r\n              “They're good defensively,” Hawks coach Quin Snyder said. “I feel like anytime we are able to move the ball and change sides, we're not attacking a set defense as much. That can contribute to it at times.”\n\n\r\n              Doncic had his second scoreless first quarter and his fewest minutes in the frame this season after picking up his second foul less than six minutes in.\n\n\r\n              The MVP candidate and league scoring leader scored 16 in the second quarter, capping a 10-0 run with an intentional bank on a 3-pointer from the wing in the final seconds of the first half for a 65-57 Dallas lead.\n\n\r\n              Irving steadied the Mavericks with eight points in each of the first two quarters, and P.J. Washington had eight of his 19 points in the first.\n\n\r\n              “Luka gets in foul trouble,” Kidd said. “This is a great scenario that could happen in a big game. It could happen in the playoffs. Someone else has to step up.”\n\n\r\n              Washington ended a scoreless stretch of 3:17 for both teams with his fifth 3-pointer for a 105-93 lead with 2:41 remaining. \n\n\r\n              A midseason trade acquisition added for defense and some 3-point help, Washington is shooting 44% from long range in six games since an eight-game run where he was at just 16%.\n\n\r\n              “Obviously, I've been in the gym working on my shot,” Washington said. “For me, it's just take it with confidence, just step into it and make sure my footwork's right.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Denver on Saturday.\n\n\r\n              Mavericks: The rematch with the Warriors comes after Golden State ended Dallas' seven-game winning streak, which tied a season best.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996261.462705
}