{
  "game_id": "0021900590",
  "espn_id": "401161232",
  "date": "Jan 12, 2020",
  "matchup": "CHA @ PHX",
  "headline": "Oubre steps up as Booker struggles, Suns beat Hornets 100-92",
  "body": "PHOENIX --  When their offense misfired early and the Phoenix Suns trailed by 14 points in the second quarter, they turned up the heat on defense.\n\nIt spurred the Suns to 100-92 victory over the Charlotte Hornets, and the first sweep of a season series with them since the 2013-2014 season.\n\nKelly Oubre Jr. had 25 points and tied a career high with 15 rebounds. He made his presence felt on defense with three steals and two blocked shots, and had 15 points in the second half on a night when Suns star guard Devin Booker struggled from the floor, shooting just 3 of 12. Booker finished with 12 points, nine assists and seven turnovers.\n\nDeandre Ayton added 18 points and nine rebounds for Phoenix, which has won five of its last eight games.\n\n“Kelly's a guy who plays 40 minutes and you look at him and he doesn't look tired at all,” Suns coach Monty Williams said. “We don't run a ton of plays for him, and yet he ends up with 25 points because he just plays hard and he's learning to play with the group.”\n\nDwayne Bacon scored 24 points for the Hornets, who have lost four straight and 10 of their last 12 games. Devonte Graham added 22 points and eight assists.\n\nBacon's layup and free throw with 1:44 left cut the Suns' lead to 89-87. Ayton put the Suns up 91-87 with a layup, and Oubre picked up a loose ball and dunked with 45 seconds left for a 93-87 lead.\n\nThe Hornets couldn't recover.\n\n“We didn't fold when they made their run,\" Oubre said. “We stuck to our game plan all night and we got the win.”\n\nAyton threw down a dunk off a lob from Booker with 3:53 to go in the first quarter for a 14-11 lead, but the Hornets closed the quarter on a 13-4 run for a 24-18 lead.\n\nBacon scored seven of his team’s first 12 points to give Charlotte a 36-22 lead, its largest of the game. Bacon had 13 points in the first half.\n\n“Our defense gave us a great shot to win this game,” Hornets coach James Borrego said. “We had three starters go 3 for 22, most nights that's not going to get you an NBA win. So we stick together, heads up and move forward.”\n\nThe Suns appeared to lack energy early on, but got going with a 13-1 run in the second quarter.\n\nOubre blocked a shot at one end and put in a layup at the other in a span of six seconds, making it 37-35. Dario Saric's 3 tied the score at 42, and Ayton dunked with 1:51 left for a 46-45 lead.\n\nAyton had 12 first-half points. Neither team scored from that point on until halftime.\n\nOubre's 3-pointer gave the Suns a 63-56 lead with 4:39 left in the third, but Bacon’s layup with 13 seconds remaining tied it at 71 going into the fourth quarter.\n\n“We kept saying ‘this is where we want to be,’” Graham said. “But they made more plays late in the game.”\n\nTIP-INS\n\nHornets: C Bismack Biyombo left in the second quarter after being hit in the nose, but later returned. … Borrego, on the Hornets at the midway point of their season having played 41 games entering Sunday: “The second half of the year is about growth and opportunity and experience, and I think when all those things mesh together, it provides us a bright future.” ... G Terry Rozier's streak of five games with 20 or more points ended with five Sunday.\n\nSuns: Ayton gave Suns fans a scare when he went down and grabbed his left ankle after a botched lob just before halftime. But the 2018 No. 1 overall pick got back up and stayed in the game. … Booker made the 595th 3 of his career, moving him into sixth place on the Suns' all-time made 3-pointers list. ... Aron Baynes started his 12th straight game at center, with Ayton coming off the bench again.\n\nOFFICIAL ASSIST\n\nDedric Taylor, one of the game’s officials, got an important assist during a first-quarter timeout when he rushed over to help a small child lift up a heavy sign. The crowd cheered, Taylor got a high five from the little one and a pat on the back from the Suns mascot, The Gorilla.\n\nZELLER JAM\n\nThe play of the night was a fast-break lob from Graham to Cody Zeller for a two-handed dunk with 5:37 to go in the third quarter, making the score 60-56 Suns. Zeller had 15 points in the 400th game of his NBA career.\n\nUP NEXT\n\nHornets: At Portland on Monday night.\n\nSuns: At Atlanta on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996071.4573572
}