{
  "game_id": "0022000880",
  "espn_id": "401307678",
  "date": "Apr 20, 2021",
  "matchup": "SAC vs. MIN",
  "headline": "Timberwolves beat Kings for second time this season, 134-120",
  "body": "SACRAMENTO, Calif. -- — Karl-Anthony Towns had 25 points and a season-high 18 rebounds, and the Minnesota Timberwolves pulled away over the final five minutes and thumped the Sacramento Kings 134-120 on Tuesday night.\n\n\r\n                    Anthony Edwards and D’Angelo Russell added 28 points apiece to help the Timberwolves beat the Kings for the second time this season and the first time in front of fans at Golden 1 Center. About 1,600 front-line workers sat alongside cardboard cutouts after California eased its COVID-19 restrictions earlier this month. \n\n\r\n                    Minnesota trailed 115-114 when Edwards made his fifth 3-pointer to start a 17-3 run. Towns had seven points during the stretch.\n\n\r\n                    “That was the game right there,” Towns said. “We knew we had a chance to put them away. It was the first time this season where we really had a chance to lay the hammer and we did it.”\n\n\r\n                    The Timberwolves entered the game with the worst record in the NBA before beating the Kings for the second time this season. Minnesota won 116-106 at home on April 5.\n\n\r\n                    Things were slightly different this time.\n\n\r\n                    Both teams scored 74 points in the first half and combined for more than 200 heading into the fourth quarter.\n\n\r\n                    “I don’t think much defense was actually played,” Towns said.\n\n\r\n                    Harrison Barnes and Mo Harkless scored 20 points apiece for Sacramento. The Kings have lost 10 of 11.\n\n\r\n                    The Timberwolves repeatedly burned the Kings from the perimeter with 18 3-pointers, one shy of their season high.\n\n\r\n                    “We got anything we wanted on the offensive end and for the most part they were getting whatever they wanted on the offensive end,” Minnesota’s Josh Okogie said. “We were able to (get) a couple of stops and that was what got us over the top.”\n\n\r\n                    Sacramento pushed Minnesota after a slow start and led 103-99 going into the fourth before getting held to 17 points over the final 12 minutes.\n\n\r\n                    The difference down the stretch came down to defense. \n\n\r\n                    “We did a lot of really good things offensively but really only put together one quarter of defense,” Kings coach Luke Walton said. “It’s hurt us all year. You just can’t try to outscore people. Give Minnesota credit. They won the shootout because in the fourth quarter we stopped making shots and they kept going.”\n\n\r\n                    VERDICT REACTION\n\n\r\n                    Players from both teams watched as the verdict in the Derek Chauvin trial was announced, particularly the Timberwolves. Chauvin, a former police officer in Minneapolis, was found guilty on all charges in the murder of George Floyd.\n\n\r\n                    The Timberwolves play at the Target Center, within minutes of where the trial was held. They dedicated the game ball from the win over the Kings to Floyd and his family.\n\n\r\n                    “It was a bittersweet moment that justice was served but it was served at the cost of a life,” Towns said. “I hope today was a step towards reform and a step toward bringing this whole thing to an end for all the families. There was such a sense of relief I was excited to go play. We all have been worried in this locker room if we were going to be able to go home and see our families.”\n\n\r\n                    DELAY, DELAY, DELAY\n\n\r\n                    Six days after getting hit with delay of game calls three times in the fourth quarter, the Kings were called for another delay – this time before the opening tip-off. No reason was given but Buddy Hield, as he does before most home games, was last to joint the rest of the players on court. \n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Minnesota made nine 3s in the first quarter. Edwards had four of them and scored 16 in the opening 12 minutes. … Jaylen Nowell has missed the last three games with a bruised right tibia.\n\n\r\n                    Kings: Hassan Whiteside had 12 points and seven rebounds in his second straight start. He was also called for delay for hanging on the rim following a dunk. … Terence Davis was whistled for a technical in the third quarter.\n\n\r\n                    UP NEXT\n\n\r\n                    The teams play again at Golden 1 Center on Wednesday.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997948.3262
}