{
  "game_id": "0022000658",
  "espn_id": "401307447",
  "date": "Mar 22, 2021",
  "matchup": "MEM vs. BOS",
  "headline": "Morant, Brooks lead Grizzlies past Celtics in overtime",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 29 points and nine assists, and the Memphis Grizzlies beat the Boston Celtics 132-126 in overtime on Monday night.\n\n\r\n                    Dillon Brooks added 24 points, seven rebounds and seven assists as the Grizzlies won for the third time in four games. Jonas Valanciunas had 16 points and 19 rebounds.\n\n\r\n                    Jaylen Brown led Boston with 27 points, and Jeff Teague finished with a season-high 26 points. Robert Williams III had 17, and Marcus Smart scored 16.\n\n\r\n                    “We had this one,” Brown said, later adding: “It’s definitely one we want back. We played hard to get back into the game. There’s still a lot of stuff we’ve got the clean up.”\n\n\r\n                    Morant scored the last three points of the game from the free-throw line. Brooks had five points early in the extra period.\n\n\r\n                    “Credit our guys,” Memphis coach Taylor Jenkins said. “Big stops and big rebounds down the stretch to close out a big win.”\n\n\r\n                    Morant added: “Us continuing to fight and be able to lock in late in the game, won us this game.”\n\n\r\n                    The Celtics already were without starting guard Kemba Walker when Jayson Tatum was a late scratch with an illness. That meant two of Boston’s top three scorers were missing.\n\n\r\n                    “When you are missing guys like Jayson and Kemba, you have to win with a better defense,” Celtics coach Brad Stevens said. “I think that’s what we’ve been able to do in the past.”\n\n\r\n                    But this time, they were not able to overcome Memphis, which played well in the extra period. While Morant and Brooks led the offensive attack, Stevens pointed to Valanciunas as a major factor. He said the Grizzlies center “just destroyed us.”\n\n\r\n                    “Even though he ended with 16 points, it felt like a lot bigger than that,” Stevens said. “It felt like he was getting what he wanted off the glass.”\n\n\r\n                    Boston trailed by nine midway through the fourth quarter. But Smart found Daniel Theis for a tying alley-oop dunk with 7.3 seconds left in regulation, sending it to overtime.\n\n\r\n                    Brown, who connected on 10 of 18 from 3-point range en route to 34 points in a win over Orlando on Sunday, struggled through much of three quarters, starting 3 of 11 from the field. He finished 11 of 24.\n\n\r\n                    “We played together. We were connected out there,” Brooks said. “We had minor slippage, but we found a way to overpass it and make the right plays to win the game.”\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Brown has reached double figures in each of his 40 games this season. He has scored at least 20 in 30 of those games. ... Defeated the Grizzlies 126-107 on Dec. 30 when Brown had a career-high 42 points. ... Walker sat out his 17th game to deal with left knee injury management. Teague started in his spot. Fourth-year F Semi Ojeleye started for Tatum. ... Teague was 5 for 5 in the first half, including a pair of 3-pointers. His previous season high was 19 against Milwaukee on Dec. 23.\n\n\r\n                    Grizzlies: Had not defeated Celtics in last 10 meetings. Their last home win over Boston was Jan. 10, 2016.\n\n\r\n                    SECOND NIGHT PROBLEMS\n\n\r\n                    The Celtics have lost six straight on the second night of back-to-backs, many of those without Walker.\n\n\r\n                    “We started the year off great on the second night of back-to-backs, and have not been good the past month,” Stevens said, later adding: “The formula doesn’t change just because you played yesterday. You have to have the ability for guys that are fresh to impact the game.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Travel to Milwaukee for the second of a four-game road trip on Wednesday.\n\n\r\n                    Grizzlies: Play at Oklahoma City on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996949.8389308
}