{
  "game_id": "0021901318",
  "espn_id": "401224793",
  "date": "Aug 14, 2020",
  "matchup": "TOR vs. DEN",
  "headline": "Johnson scores 23 points to help Raptors top Nuggets 117-109",
  "body": "LAKE BUENA VISTA, Fla. --  Stanley Johnson scored 19 of his season-high 23 points in the second half, and the Toronto Raptors closed out their regular season with a 117-109 victory over the slipping Denver Nuggets on Friday.\n\nThe seldom used Johnson, who came in averaging 1.5 points per game, hit three 3-pointers and a floating bank shot during a span of less than four minutes in the fourth quarter, helping the Raptors push their lead to 103-92 with six minutes to go.\n\nDenver never pulled closer than seven points after that and lost its third straight to fall to 3-5 in its final eight regular-season games that were played in the NBA's \"bubble\" in the Orlando area.\n\nPaul Watson scored 22 points -- shattering his previous career high of four points -- and Normal Powell added 15 points for the Raptors, who've won four straight and seven of their eight regular-season games in Central Florida.\n\n\"A lot of growth for a lot of players,\" Raptors coach Nick Nurse said in summing up a regular season that exceeded expectations after last summer's departures of Kawhi Leonard and Danny Green in free agency. \"There was a lot of resiliency considering we had a lot of injuries, too.\n\n\"Just a good kind of top-to-bottom effort by the crew for certainly the first 60-plus games, and then to re-gather and keep it rolling once we got here, it's good. It's a joy to be around this team.\"\n\nBoth teams entered the game locked into playoff position -- Denver the No. 3 seed in the Western Conference and Toronto No. 2 in the Eastern Conference. Regulars for each club played, but their minutes were dialed back.\n\nDenver's Nikola Jokic and Jamal Murray each played about 10 minutes, during which Murray hit three 3s for the bulk of his 11 points.\n\nDenver's PJ Dozier highlighted his team-high 20-point performance by hitting five of six 3-point shots.\n\n\"The confidence level is very high,\" Dozier said. \"Once you see one go in, you see another one go in and you're kind of rolling.\"\n\nMonte Morris added 16 for the Nuggets.\n\nToronto combined for 18 3s on 35 attempts, with Johnson and Watson each hitting a team-high four.\n\nDenver coach Mike Malone criticized his team's perimeter defense.\n\n\"This is a common theme,\" Malone said. \"I'm embarrassed by it -- I really am -- by the fact that every night we're giving up 16, 17, 18 3s.\n\n\"Right now, it's almost comical how bad our 3-point defense is,\" Malone added.\n\nToronto surged into the lead for good late in the first quarter when Terence Davis made consecutive 3s, the second on a step-back move after he'd sent Paul Millsap soaring past him with an exaggerated up-fake.\n\nSoon after, Chris Boucher's free throws started a 14-0 run that included 3s by Malcolm Miller and Boucher, followed by Jonhson's finger roll to give Toronto its largest lead at 39-23.\n\nDenver closed to 54-50 late in the second quarter when Morris hit a cutting layup and a 3 in succession to cap a 9-0 Nuggets run.\n\nPowell's finger roll and Matt Thomas' free throws pushed Toronto's lead back up to 58-50 at halftime.\n\nTIP-INS\n\nNuggets: Keita Bates-Diop scored 11 points. ... Troy Daniels, Mason Plumlee and Millsap each scored 10. ... Denver lost to Toronto for the first time in four games. ... The Nuggets combined for 16 made 3s on 38 attempts, but shot just 41.4% (36 of 87) overall.\n\nRaptors: Shot 50% (45 of 90) overall. ... Thomas had his first start this season and Davis his fourth. ... Boucher finished with nine points and nine rebounds in less than 22 minutes.\n\nWATSON WATCH\n\nThe 25-year-old Watson, who played in college at Fresno State, has played in just 10 career NBA games -- all since January with Atlanta and Toronto.\n\nHe appeared in just two games with the Hawks before joining the Raptors on a two-way contract and played just three games with Toronto before the NBA season was suspended because of the coronavirus pandemic.\n\nHe has appeared in five games since the season resumed, twice playing more than 20 minutes.\n\n\"Being able to go out there and work with the time I'm getting is a confidence builder,\" Watson said.\n\nNurse has been encouraged.\n\n\"He can play,\" Nurse said. \"He's going to be part of our future, from what I can see so far.\"\n\nUP NEXT\n\nNuggets: Open their first-round playoff series against Utah on Monday.\n\nRaptors: Begin their first-round playoff series against Brooklyn on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995568.223296
}