{
  "game_id": "0022000051",
  "espn_id": "401267211",
  "date": "Dec 29, 2020",
  "matchup": "MIL @ MIA",
  "headline": "Bucks set NBA record for 3-pointers made in a game",
  "body": "MIAMI -- — On Sunday, the Milwaukee Bucks endured their worst 3-point effort in just over a year.\n\n\r\n                    On Tuesday, they set the NBA record for 3's in a game.\n\n\r\n                    Go figure.\n\n\r\n                    The Bucks made a record 29 3-pointers in their 144-97 romp past the reigning Eastern Conference champion Miami Heat on Tuesday night. They shot 29 for 51 from deep, two nights after going 7 for 38 in a loss to New York.\n\n\r\n                    “Some nights, the basketball gods are with you a little bit,” Bucks coach Mike Budenholzer said. “It's probably one of those nights.”\n\n\r\n                    Milwaukee used 13 players and 12 made at least one 3-pointer — the only exception being two-time reigning MVP Giannis Antetokounmpo. Khris Middleton had four 3's and scored 25 points, Jrue Holiday made six 3's in his 24-point night and Donte DiVincenzo was 5-for-6 from deep to finish with 17 points.\n\n\r\n                    Antetokounmpo had only nine points. But his brother, Thanasis Antetokounmpo — who was 0 for 11 from 3-point range in his career entering the night — got into the act and made one from deep.\n\n\r\n                    “I knew we were shooting well,” said Bucks center Brook Lopez, who made three 3's. “I didn't know we were anything close to that.”\n\n\r\n                    The record-breaker was made by Sam Merrill, who got the 28th 3-pointer with 6:07 remaining, giving the Bucks a 131-86 lead.\n\n\r\n                    The previous record for 3’s in a game was 27, set by the Houston Rockets against the Phoenix Suns on April 7, 2019. Milwaukee’s previous most was 22, against Sacramento on Nov. 4, 2018. The most previously allowed in a game by Miami was 24, on Feb. 5 against the Los Angeles Clippers.\n\n\r\n                    Milwaukee was up 10-0 after 78 seconds, 21-3 after about four minutes, and the tone was set in the first meeting between the teams since last season's playoffs, when the Heat eliminated the Bucks in five games.\n\n\r\n                    “It looked like they have been thinking about this game for 80 days,” Heat coach Erik Spoelstra said.\n\n\r\n                    Milwaukee led 46-26 after one quarter, 83-51 at the half.\n\n\r\n                    Tyler Herro scored 23 points for the Heat. Miami’s Jimmy Butler missed the game with a sprained right ankle; it's unknown if he'll play Wednesday when the Heat and Bucks meet again.\n\n\r\n                    “Tomorrow, we're going to have to come out with a lot more energy or we're going to get embarrassed again,” Herro said.\n\n\r\n                    It was the biggest road win in Bucks history, topping the 39-point margin at New York on April 10, 1987. The 47-point margin matched the second-worst loss in Heat history; they lost 138-91 to Pat Riley and the Los Angeles Lakers in the eighth game of Miami’s first season.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Milwaukee had 16 3’s by halftime, the most of any half in team history. ... The Bucks’ last three games have all been decided long before the final buzzer, with them beating Golden State by 39 on Christmas, then losing by 20 in New York on Sunday and leading by as many as 51 on Tuesday.\n\n\r\n                    Heat: The worst Heat loss was 148-80 against Cleveland in 1991. ... Tuesday's 32-point halftime deficit was second worst in team history, topped by a 33-point hole on March 8, 1989 when Riley and the Lakers led 76-43 at the break. ... Herro had 20 points by halftime, the first time he’s done that in his career.\n\n\r\n                    WELCOME BACK\n\n\r\n                    The Heat had about 100 fans at the game, all family and friends of players and employees. “I think it is a boost for the family, just to be able to have some normalcy and have a real opportunity to support their loved ones,” said Spoelstra, whose wife Nikki attended.\n\n\r\n                    STREAK ENDS\n\n\r\n                    Giannis Antetokounmpo’s streak of 108 consecutive regular-season games — and 132 overall — with at least 10 points ended. It was the first time since Feb. 13, 2017 that he played, scored less than 10 points and the Bucks won anyway.\n\n\r\n                    UP NEXT\n\n\r\n                    The teams meet again Wednesday in Miami.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997423.637429
}