{
  "game_id": "0021500650",
  "espn_id": "400828537",
  "date": "Jan 22, 2016",
  "matchup": "MIL @ HOU",
  "headline": "Harden's 30 points lead Rockets over Bucks 102-98",
  "body": "HOUSTON -- Josh Smith couldn't stop smiling Friday night.\nAfter making what he admitted was a mistake by signing with the Clippers in the offseason, Smith got a second chance, returning to the Houston Rockets in a trade with Los Angeles earlier in the day.\nSmith scored just two points in about 20 minutes of a 102-98 win over the Milwaukee Bucks, but he contributed in plenty of other ways, drawing raves from interim coach J.B. Bickerstaff and his teammates.\n\"The thing that's important for us is Josh's ability to pass the ball,\" Bickerstaff said. \"It's infectious when he makes the extra passes over and over again and everybody's a recipient of it.\"\n\nSmith spent the second half of last season with the Rockets before signing with the Clippers. He received a standing ovation when a video of his highlights and a welcome message was played on the video boards early in the first quarter.\nBickerstaff had said before the game that he didn't expect him to play until Sunday. Instead, he entered the game for the first time with about five minutes left and had five rebounds and six assists to go with his one bucket.\n\"He just did the things that don't show up in the stat sheet but that are effective and help teams win,\" said James Harden, who led the team with 30 points. \"We're just happy to have him back.\"\nSmith had a tough time with the Clippers and had appeared in just four games since Dec. 21.\n\"I wanted to play bad, man,\" Smith said. \"I haven't played in like a month, month and a half. So being able to touch that hardwood makes you appreciate a lot of things. Being able to be around a group of guys and coaching staff that is confident in you is definitely helpful for my game.\"\nThe Rockets closed the third quarter with a 14-2 run to turn a one-point game into a double-digit lead entering the fourth.\nThey were up by 12 when the Bucks went on a 14-4 run that started with consecutive dunks by Giannis Antetokounmpo and Michael Carter-Williams and ended with a 3-pointer by Khris Middleton, to cut the lead to 100-98 with 6.9 seconds left.\nBut Trevor Ariza made a pair of free throws after that to secure the victory.\nMiddleton and Greg Monroe scored 21 points each for the Bucks, whose three-game winning streak ended.\nThe Bucks thought Smith was a key to Houston's win, too.\n\"He did a great job on both ends, just making plays,\" Monroe said. \"He was definitely causing problems in the lane and kicking it out and finding shooters.\"\nHouston led by 13 entering the fourth quarter and was up by 14 when Milwaukee used a 10-2 run to get within six at 88-82 with about 6 1/2 minutes remaining.\nThe Rockets used an 8-2 run, with two 3-pointers from Harden, to push it to 96-84 with 4 1/2 minutes left.\nThe Bucks opened the second half with a 16-4 run that cut Houston's lead to 61-60 with midway through the third quarter. Jabari Parker had six points in that span and Carter-Williams had five, highlighted by a two-handed alley-oop dunk from Parker.\nHouston scored four straight points after that, but the Bucks scored the next four to get within one point again.\nThis time, Ariza made consecutive 3-pointers to start the big run that pushed Houston's lead to 79-66 at the end of the third quarter. Smith blocked a dunk by John Henson near the end of the quarter that had all the Rockets on the bench standing and cheering.\nThe Rockets scored the last five points in the second quarter to push their lead to 57-45 at halftime.\nTIP-INS\nBucks: Antetokounmpo had 18 points and six rebounds. ... Carter-Williams added 11 points with 12 rebounds. ... Milwaukee scored 58 points in the paint.\nRockets: PG Patrick Beverley missed his second straight game with a sprained left ankle. ... Ariza had 19 points. ... Terrence Jones scored 14 points with eight rebounds and four blocks.\nHOWARD'S HEALTH\nDwight Howard sat out after spraining his left ankle in the first minute of Wednesday night's game. Bickerstaff said he expects Howard to be out three to four more days. Howard was playing well before the injury and had 10 straight double-doubles entering Wednesday's game.\nQUOTABLE\nMiddleton on the team's failed comeback attempt: \"We kept fighting and hung with them on their runs and kept trying to grind it out. We did give ourselves a chance to win the game. We were just a little too late.\"\nUP NEXT:\nBucks: Visit New Orleans Saturday.\nRockets: Host Dallas Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994051.2233999
}