{
  "game_id": "0022000644",
  "espn_id": "401307431",
  "date": "Mar 20, 2021",
  "matchup": "CHA @ LAC",
  "headline": "George, Leonard lead Clippers' 125-98 rout of Hornets",
  "body": "LOS ANGELES -- — Paul George had 21 points and 10 assists, Kawhi Leonard added 17 points and the Los Angeles Clippers emerged from two inconsistent weeks with a 125-98 victory over the Charlotte Hornets on Saturday night.\n\n\r\n                    Terance Mann scored 16 points and Lou Williams had 15 for the Clippers, who had seven scorers in double figures and went 23 for 23 from the free throw line during just their third win in eight games. Los Angeles bounced back from blowout losses to New Orleans and Dallas in the previous six days with an overwhelming effort against the Hornets, who lost their third straight.\n\n\r\n                    Miles Bridges scored a season-high 21 points and Gordon Hayward added 17 for the Hornets, who took their worst defeat of the season for the second time in three games.\n\n\r\n                    George scored 12 points while staking the Clippers to a 17-point lead in the first quarter. Los Angeles kept a healthy margin for the rest of the night, allowing Leonard to rest in the fourth quarter.\n\n\r\n                    “We’re a scary team when we play hard,” said Terance Mann, who scored a season-high 16 points in a reserve role.\n\n\r\n                    LaMelo Ball scored 13 points for Charlotte in the rookie sensation's second straight game in his native Los Angeles area. Ball played extensively in the second half despite clearly struggling with discomfort in his right wrist, which appeared to be injured in an early fall.\n\n\r\n                    Hornets coach James Borrego had no postgame update on Ball.\n\n\r\n                    “Give the Clippers a ton of credit,” Borrego said. “They’re a heck of a team. ... This season has been a grind. We’ve got a young group that’s played a lot of minutes, and they continue to show up every night, keep battling and keep playing.”\n\n\r\n                    The Hornets are winless on their five-game road trip after losing three straight for the first time since Jan. 22. Charlotte, which lost by 25 in Denver to start its trip, hasn't beaten the Clippers at Staples Center in 11 tries since February 2009.\n\n\r\n                    “It’s not been our finest basketball these last three games,” Hayward said. “We can be a lot better, that’s for sure. We’ve got to try to pick ourselves up here, stay together, stay positive. It’s a season of ups and downs, and we’ve been through it already, so there’s no reason to hang our heads. We’ve played three really good teams, and it doesn’t get any easier.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Terry Rozier hit the 300th 3-pointer of his brief career in Charlotte, becoming the fastest player in Hornets history to reach the mark by doing it in just 102 games. He missed the final 15 minutes with a bruise on his left hip. ... Bridges was drafted by the Clippers in 2018 and quickly traded to Charlotte. ... P.J. Washington sprained his right ankle in the first half, but played extensively in the second half.\n\n\r\n                    Clippers: Patrick Beverley missed his fourth straight game with right knee soreness, and Serge Ibaka sat out his third straight with lower back tightness. ... LA was perfect at the free throw line for the third time this season and the 26th time in franchise history. ... Luke Kennard, the Clippers' $64 million guard, didn't play until garbage time after sitting out the last two games.\n\n\r\n                    NIC'S REVENGE\n\n\r\n                    Nicolas Batum had 11 points and five rebounds off the bench for the Clippers in his first game against the Hornets since he was waived last November to make room for Hayward's arrival. The French big man spent five years in Charlotte, scoring a career-high 15.1 points per game in 2016-17.\n\n\r\n                    “He did a great job setting the tone early with his defense when he checked into the game,” Clippers coach Tyronn Lue said. “The guys were happy for him playing against his old team, and to get a win like that is pretty impressive.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: At Spurs on Monday.\n\n\r\n                    Clippers: Host Hawks on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997010.605025
}