{
  "game_id": "0021501002",
  "espn_id": "400828889",
  "date": "Mar 15, 2016",
  "matchup": "LAL vs. SAC",
  "headline": "Kings complete first season sweep of Lakers, 106-98",
  "body": "LOS ANGELES -- If the Sacramento Kings were nearly as successful against the rest of the NBA as they were against the Los Angeles Lakers this season, perhaps they'd be contending for a playoff berth.\nDarren Collison had 22 points in his ninth start of the season, DeMarcus Cousins also scored 22 and the Kings completed a four-game season sweep with a 106-98 victory Tuesday night.\n\"Consistency has been one of our biggest problems,\" Cousins said after the Kings improved to 26-40. \"It's frustrating. We're still trying to figure it out. But the one thing about this locker room is that we stick together. We believe in one another and we just keep pushing forward, trying to finish the season strong.\"\nThis was the first time the Kings went an entire season without losing to the Lakers during the franchise's 68-year history, which dates back to the 1948-49 Rochester Royals. Sacramento has won eight of the last nine meetings after losing 16 of the previous 21.\nRajon Rondo had 12 assists, nine points and six rebounds to help the Kings snap a five-game skid. And they did it even though Cousins didn't make a field goal until converting a layup with 2.3 seconds left in the first half.\nThe two-time All-Star, playing his second game following a one-game suspension for his on-court outburst at coach George Karl during a loss against Cleveland last Wednesday, missed his first four shots and finished 4 for 10 with eight rebounds.\nThe Lakers, who trailed by as many as 23, got as close as 97-91 on a pair of free throws by Julius Randle that capped a 15-5 run with 3:14 to play. Rudy Gay clinched it for the Kings by scoring seven of his 20 points in the final 2:57.\n\"Anytime you win a game on the road by (eight) points and sustain the tempo and emotion of the game, it's good,\" Karl said. \"It's good to get out of our funk and off the losing streak and put some joy back into the locker room. It's another step in a good direction.\"\nCollison started at shooting guard and made 10 of 14 shots in place of Ben McLemore, who missed his fourth straight game with a non-displaced fracture in his right ring finger. The seven-year veteran from UCLA came in averaging 13.3 points.\n\"We got off to a really bad start against Utah, so our focus tonight was to get off to a really good start tonight,\" Collison said. \"Our defensive presence had an impact early on, and everything took care of itself. If there's anything we can learn from this year, it's to get off to good starts and make sure we have a lot of impact on the game before they do.\"\nKobe Bryant, fighting shoulder problems throughout his 20th and final NBA season, sat out. Metta World Peace, who spent two-plus seasons with Sacramento as Ron Artest, had two points in 20 minutes in his fourth start this season and first since Nov. 16.\nReserve guard Lou Williams led the Lakers with 17 points on a night when the team was 5 for 26 from 3-point range and committed 22 turnovers that were converted into 30 points.\n\"We try to make the hard play. We didn't make the simple play,\" was Randle's explanation for all the miscues.\nSacramento never trailed, opening the game with an 18-4 run and increasing the margin to 28-9 with 18 fast-break points. Los Angeles had seven turnovers in the first quarter alone.\n\"Obviously, we didn't do a good job of handling the pressure,\" coach Byron Scott said. \"They are a steals type of team, a gambling type of team, and we just didn't react well to it.\"\nNone of the Lakers reached double digits in points until Williams hit a 3-pointer with 6:41 left in the third quarter. By then, the Kings were ahead 71-51.\n\"I think we got our hands involved in the game,\" Cousins said. \"We made it very uneasy for them to deal with our pressure and it affected them a lot.\"\nThe Lakers have lost 23 of 28 and with 14 games to play they are within seven losses of matching the worst season in franchise history.\nTIP-INS\nKings: Karl has used 24 different starting lineups in his first full season with Sacramento. ... Cousins averaged 21.5 points, 9.3 rebounds and 53.1 percent shooting from the field in his other three games against the Lakers this season.\nLakers: Reserve forward Brandon Bass was sidelined because of a corneal abrasion in his right eye. . Bryant has missed 15 of the Lakers' 68 games. They are 4-11 with him out of the lineup.\nUP NEXT\nKings: Host New Orleans on Wednesday.\nLakers: Host Phoenix on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994248.961663
}