{
  "game_id": "0022100723",
  "espn_id": "401360542",
  "date": "Jan 26, 2022",
  "matchup": "CHA @ IND",
  "headline": "Hornets break franchise record with 158-126 win over Pacers",
  "body": "INDIANAPOLIS -- — Charlotte coach James Borrego gave his players a simple instruction Wednesday night.\n\n\r\n              Let it fly.\n\n\r\n              The Hornets didn’t disappoint. They made 24 3-pointers, broke the franchise’s single-game scoring record and produced the highest point total in the NBA this season with a 158-126 win over the Indiana Pacers.\n\n\r\n              “Tonight we we kind of got in that zone in the third quarter and we didn’t look back,” said Kelly Oubre Jr., who scored a career-high 39 points and made a career-best 10 3-pointers. “None of us were going for numbers today. We just wanted to play hard.”\n\n\r\n              The numbers, though, were incredible. Oubre was 12 of 18 from the field and only missed five 3s. LaMelo Ball had his fourth triple double of the season with 29 points, 13 assists and 10 rebounds. In all, four Hornets players topped the 20-point mark as they tied a season-best from beyond the arc.\n\n\r\n              Charlotte also snapped a two-game losing streak and pulled off a four-game sweep of the injury-depleted Pacers, who eliminated the Hornets in the play-in round last season.\n\n\r\n              It was no surprise to Borrego.\n\n\r\n              “We were due for one of these games,” he said. “We just got rolling, one guy after another and just a great game offensively tonight and a great third quarter defensively. That’s what turned the game.”\n\n\r\n              The Pacers, led by 17 points from both Goga Bitdaze and rookie Isaiah Jackson, lost their third straight and seventh out of nine. \n\n\r\n              Playing without three starters, Indiana simply couldn’t keep up, and it didn’t much time to see what was coming. \n\n\r\n              Charlotte opened the game by scoring 12 of the first 15 points and led 71-70 at the half. The Hornets opened the third quarter with seven straight points and used a 13-2 spurt to take a 104-82 lead with 4:18 to go. \n\n\r\n              They broke the franchise mark, fittingly, on a 3 from Myles Bridges with 5:14 to go and coasted to the final buzzer.\n\n\r\n              “It happens, you’ve just got to keep going and playing tougher like we did on the West Coast,” Bitadze said. “It’s hard. It’s not like you’re going to forget about it. You’ve got to use it as motivation.”\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Charlotte also topped its previous record scoring total, set in a 146-143 overtime loss to Houston in November. Charlotte’s 141-point game against the Los Angeles Lakers on Nov. 24, 1993, was the team’s top scoring total in regulation. ... Bridges finished with 22 points and Terry Rozier had 20. ... Charlotte shot 58.1% from the field and 53.3% on 45 3-point attempts.\n\n\r\n              Pacers: Torrey Craig and Lance Stephenson each had 14 points and Stephenson had 10 assists. ... Bitadze had six rebounds. ... Chris Duarte scored 11 points while Justin Holiday and Caris LeVert each had 10. ... Two-time All-Star Domantas Sabonis (sprained left ankle), Myles Turner (left foot) and Malcolm Brogdon (sore right Achilles tendon) all sat out.\n\n\r\n              HAYWARD OUT\n\n\r\n              Hornets forward Gordon Hayward did not play Wednesday after the team announced he had entered the COVID-19 health and safety protocols. Borrego said it’s unclear when the 2017 All-Star might return to action. Hawyard also has been dealing with a sore right foot.\n\n\r\n              “It’s unfortunate, it’s disruptive, but that’s the nature of the sport and the game and life,” Borrego said. “So we’ll move forward. Obviously, we’ve had a hard time the last year and a half without him so it’s time for someone on the bench to step up.”\n\n\r\n              QUOTABLE\n\n\r\n              “You never want to lose like that at home,\" Craig said. “The only thing we can do now is learn from it. We've got to flush this one tonight and get ready for Oklahoma City.\"\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Return home on Friday to face the Los Angeles Lakers.\n\n\r\n              Pacers: At Oklahoma City on Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992882.650243
}