{
  "game_id": "0022000225",
  "espn_id": "401307703",
  "date": "Apr 23, 2021",
  "matchup": "MEM @ POR",
  "headline": "Morant scores 33, Grizzlies beat Trail Blazers 130-128",
  "body": "PORTLAND, Ore. -- — Ja Morant had 33 points and 13 assists and the Memphis Grizzlies handed the Portland Trail Blazers their fourth straight loss with a 130-128 victory on Friday night. \n\n\r\n                    Dillon Brooks added 25 points for Memphis, which snapped a two-game losing streak. Morant is the first player in franchise history with as many points and assists in the same game. He had no turnovers. \n\n\r\n                    Damian Lillard overcame a slow start and finished with 27 points, and Jusuf Nurkic added 26 points and a season-high 17 rebounds. Portland has lost six of its last seven. \n\n\r\n                    “We know what we’re capable of every night. We’ve just got to go out there with a lot of energy for 48 minutes,” Morant said. “Offensively we're going to score the ball, so as long as we are locked in on the defensive end and get stops we're going to always put ourselves in a position to win the game.”\n\n\r\n                    Neither team was able to lead by double digits. The Grizzlies had a 100-99 edge heading into the final period. \n\n\r\n                    Nurkic's dunk gave the Blazers a 116-115 lead, but Jaren Jackson Jr.'s layup put the Grizzlies back in front with 5:20 left. Lillard made the second of a pair of free throws to tie it at 117 before Nurkic's layup. \n\n\r\n                    The teams wrestled for the lead down the stretch. Morant's layup put Memphis up 125-123. He missed the first of a pair of free throws before Norman Powell's layup got the Blazers within a point with 45.9 seconds left. \n\n\r\n                    The Blazers got the ball with 10.7 seconds left and 2.1 on the shot clock, but Nurkic missed a shot under the basket. De’Anthony Melton made free throws at the other end, giving Portland 3.6 seconds left for a 3-pointer to tie it.\n\n\r\n                    Lillard was fouled and made his first free throw but his second rimmed out and Portland couldn't catch up. \n\n\r\n                    “They pushed the pace on us the entire game. Obviously we didn't shoot the ball from three in the fourth quarter, but that wasn't the reason we lost. We really didn't take away their transition all for most of the night, and that, and the fourth quarter, I think made the difference,” Blazers coach Terry Stotts said. \n\n\r\n                    The Grizzlies were in the midst of a seven-game road trip, longest of the team's Memphis-era. They'll play the Trail Blazers three times in the space of a week. After Friday's game, the teams meet again Sunday afternoon at the Moda Center, then they face off in Memphis next Wednesday. \n\n\r\n                    Memphis had lost four straight to the Blazers, and the Grizzlies hadn't won in Portland since 2017. \n\n\r\n                    “We knew they were going to score, they’ve done it all season long so we had to have a next play mentality,” Memphis coach Taylor Jenkins said. \n\n\r\n                    Both teams were slow to get warmed up. The Grizzlies led 28-20 in the opening quarter and 62-56 at the break. Morant's putback capped the half and he led all scorers with 14 points. \n\n\r\n                    Nurkic's layup and a 3-pointer from CJ McCollum got Portland within 62-61 to start the second half. \n\n\r\n                    Portland pulled in front 71-70 on Lillard's layup, but he came down hard on the court and came up grimacing. It was just his second game back after a hamstring injury kept him out for three games. He stayed in the game. \n\n\r\n                    The Blazers couldn't hold on to the lead and Brooks' running jumper gave the Grizzlies a 94-91 lead. \n\n\r\n                    Portland gave up a season-high 75 points in the paint. \n\n\r\n                    “It’s harder when you lose by one point or a close game than just blowouts,\" Nurkic said. \"It hits harder.”\n\n\r\n                    TIP INS\n\n\r\n                    Grizzlies: Dillon Brooks played for the University of Oregon. ... The teams were due to meet in late January, but the game was called off because of coronavirus protocol. Memphis did not have the league-required eight players for the game. ... Memphis Center Jonas Valanciunas missed his third game because of concussion protocol. \n\n\r\n                    Trail Blazers: Portland continued to run tests for when the team is allowed to welcome fans back, with a handful of people — mostly employees and family — sitting in socially distanced courtside seats across from the team benches. Among the “fans” in the stands was Lillard's toddler son. Oregon still has not allowed spectators at indoor sporting events because of COVID-19. \n\n\r\n                    TRIPLE TREAT\n\n\r\n                    Morant, Jackson and Brooks had 10 or more field goals, marking the first time three Grizzlies have had as many since Mike Conley, Marc Gasol and Zach Randolph against the Phoenix Suns in 2017. \n\n\r\n                    Jackson finished with 23 points off the bench. It was just his second game back this season after recovering from left knee surgery. \n\n\r\n                    “I’m very excited to have him back on the floor,\" Morant said. \"He's a tough cover. You’ve just got to pick and choose what you’re going to give up with him. He's able to knock down the 3, attack you off the dribble and finish inside so it’s hard to contain him.”\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996926.580639
}