{
  "game_id": "0021900280",
  "espn_id": "401160922",
  "date": "Nov 30, 2019",
  "matchup": "SAC vs. DEN",
  "headline": "Kings rally from 17 down to beat Nuggets 100-97 in overtime",
  "body": "SACRAMENTO, Calif. --  Sacramento coach Luke Walton views Harrison Barnes as a calming influence for the Kings, something that showed in a comeback win over Denver on Saturday.\n\nBarnes scored six of his season-high 30 points in overtime, Buddy Hield hit two free throws with 9.5 seconds left and the Kings rallied to beat the Nuggets 100-97.\n\n\"That's largely my role, to come in to help where needed,\" Barnes said. \"Some nights it's scoring. Some nights it's rebounding, some night it's defense. Some nights it simply just making the right play. That's something I try to do consistently for this team.\"\n\nBarnes' leadership has become much more valuable while Sacramento plays without injured starters De'Aaron Fox and Marvin Bagley III. He helped stabilize the Kings after they trailed by 17 at halftime, then came up big in overtime when he nearly outscored Denver by himself.\n\n\"Tonight, he showed again why he's so important to us on both ends of the court,\" Walton said. \"It was a good, solid win for our group, one that we needed and we worked for.\"\n\nSacramento didn't lead until Barnes made a jumper early in overtime. Gary Harris' 3-pointer put the Nuggets up 95-94, but Barnes answered with two free throws and scored on a short lean-in shot.\n\nHarris made two free throws before Hield answered with two of his own to help Sacramento end a six-game losing streak against Denver.\n\nThe Kings became the third team this season to win after trailing by 17 at halftime, joining Miami and the Los Angeles Lakers.\n\nThe Nuggets failed to get off a shot in the final 15 seconds as Jamal Murray dribbled out the clock.\n\n\"We have to come up with something better,\" Murray said. \"The ball was in my hands, so it makes me look bad when that happens. We have to come up with something better, get open, and set some screens. It all comes out in the execution.\"\n\nNemanja Bjelica had 10 points and 12 rebounds for the Kings. Richaun Holmes added 13 points and 10 rebounds, and Hield had 21 points despite an off-night shooting.\n\nHarris scored 18 of his 25 points in the first quarter. Will Barton added 14 points, 12 rebounds and five assists. Murray scored 15 points.\n\nThe Nuggets missed a chance to win in regulation when Holmes blocked Murray's shot from behind at the buzzer.\n\n\"You have to get a shot off at the end of regulation and you have to get a shot off at the end of overtime, and we didn't get a shot off either time,\" Denver coach Mike Malone said. \"Obviously I have to do a better job in terms of helping us with that late game execution.\"\n\nSacramento was behind 75-67 entering the fourth. Hield, who struggled with his shot for much of the game, made consecutive 3s and scored on a driving layup to tie it at 90.\n\nTIP-INS\n\nNuggets: Denver scored 57 points in the first half but was outscored 60-40 after that. ... Nikola Jokic missed five consecutive shots in the fourth quarter. ... Harris' previous season high of 17 points also came against Sacramento.\n\nKings: Holmes' double-double is his sixth this season, a career high. ... Bagley has yet to be cleared to play but is getting closer. The second overall pick a year ago, Bagley has been out since breaking his right thumb in the season opener. Fox (left ankle sprain) is also making progress in his rehab but isn't as close as Bagley.\n\nWINNING UGLY\n\nThe Kings won despite shooting 38.5% from the floor. They are one of six NBA teams to win shooting at least that poorly.\n\nUP NEXT\n\nNuggets: Return to Denver to host the Los Angeles Lakers on Tuesday.\n\nKings: Host the Bulls on Monday. Sacramento has won the last four against Chicago.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996411.324607
}