{
  "game_id": "401810090",
  "espn_id": "401810090",
  "date": "Nov 16, 2025",
  "matchup": "WSH vs BKN",
  "headline": "Nets beat Wizards 129-106 in a matchup of 1-win teams, sending Washington to its 11th straight loss",
  "body": "WASHINGTON -- — Michael Porter Jr. scored 34 points and Tyrese Martin scored seven straight points late in the third quarter and finished with 20 as the Brooklyn Nets sent the Washington Wizards to their 11th straight loss, 129-106 Sunday night in a matchup of one-win teams.\n\n\r\n              The Nets snapped a four-game skid and won for the first time since beating Indiana 112-103 in the first week of November, a victory that ended a run of seven straight losses to open the season. Both of Brooklyn's victories have come on the road, where they are 2-5.\n\n\r\n              Nic Claxton scored 17 points, Ziaire Williams added 13, Noah Clowney finished with 12 and Terance Mann 10 for Brooklyn.\n\n\r\n              Kyshawn George led the Wizards in scoring with 29 points. CJ McCollum added 17 points and Khris Middleton 14 for Washington, which shot 35% (12 for 34) from 3-point range and 44% (37 for 84) overall.\n\n\r\n              Washington fell to 0-6 at home and lost for the 12th time in 13 games this season. The Wizards last won on Oct. 24, at Dallas (117-107), in the second game of the season. \n\n\r\n              The Nets overcame 11 turnovers in the first half and used a 35-25 scoring edge in the second quarter for a 63-53 lead at the break.\n\n\r\n              The Wizards battled back in the third quarter and outscored Brooklyn 31-22 over the first 10 minutes of the period to close within 85-84.\n\n\r\n              But after Williams hit a pair of free throws to increase the Nets' lead to three, Martin sandwiched a pair of field goals around a 3-pointer that stretched the lead back 10 points at 94-84 heading into the final period. \n\n\r\n              The Nets opened the fourth quarter on a 14-4 run and increased their lead to 20 points at 108-88 with just under eight minutes left and were never threatened the rest of the way.\n\n\r\n              Up next\r\n              Nets: Host the Boston Celtics on Tuesday.\n\n\r\n              Wizards: At Minnesota on Wednesday in the opener of a three-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042635.496809
}