{
  "game_id": "0022000059",
  "espn_id": "401267219",
  "date": "Dec 30, 2020",
  "matchup": "CHA @ DAL",
  "headline": "Ball, Hornets dominate Mavs' home opener in 118-99 win",
  "body": "DALLAS -- — LaMelo Ball scored 22 points, Miles Bridges had 20 points and a career-high 16 rebounds and the Charlotte Hornets blew out Dallas 118-99 in the Mavericks' home opener Wednesday night.\n\n\r\n                    Terry Rozier, who scored 18 points, hit a pair of 3-pointers early in a 14-0 run to start the second half, giving the Hornets a 25-point lead coming off their first win — over Kevin Durant, Kyrie Irving and the Brooklyn Nets — after an 0-2 start.\n\n\r\n                    Charlotte silenced Luka Doncic and the Mavericks, who are still without European sidekick Kristaps Porzingis as the 7-foot-3 Latvian recovers from knee surgery. \n\n\r\n                    Still, Dallas was coming off its first victory after dropping the first two games as well, a 51-point blowout at the Los Angeles Clippers that included an NBA-record halftime lead of 50 points (77-27).\n\n\r\n                    “For us it’s just about building and growing,” Charlotte coach James Borrego said. “We didn’t have the best training camp. There’s a lot of factors there, but I believe now we have found our footing.”\n\n\r\n                    The Hornets were up 68-57 at the break and outscored Dallas 30-12 in the third quarter. Doncic was limited to 12 points for the game and sat the fourth with the game out of reach while Tim Hardaway Jr. led Dallas with 18 points.\n\n\r\n                    “Their game plan was to come out as aggressively and as physically as they could and try to take any rhythm out of our game,” coach Rick Carlisle said. “They succeeded on some levels. It’s clear Luka doesn’t have his rhythm yet.”\n\n\r\n                    Charlotte went 5 of 10 from 3-point range in the third while the Mavericks missed their first nine after the break from long range, including three in one possession, and finished the quarter 1 of 15 from beyond the arc. Dallas was 11 of 41 for the game.\n\n\r\n                    Ball, the third overall pick in the draft, finished 7 of 10 from the field, including 4 of 5 from deep and made all four free throws to easily beat the high from his first three games of 13 points. The 19-year-old had eight rebounds and five assists.\n\n\r\n                    “He's growing up right before our eyes,” Bridges said. “As long as he's playing his game and having fun, we just want to focus on the defensive end.”\n\n\r\n                    Devonte Graham's 3 gave the Hornets their first 25-point lead, and Jalen McDaniels made it 90-60 midway through the third with an alley-oop layup.\n\n\r\n                    The Hornets had no trouble with a Western Conference playoff qualifier from last season despite 4-of-16 shooting from Gordon Hayward, who scored 11 points.\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Washington, McDaniels and center Bismack Biyombo had little trouble getting good looks close to the rim, combining to go 11 of 18 from the field. Washington scored 11 points, McDaniels 10 and Biyombo nine. ... All 16 of Bridges' rebounds were on the defensive end.\n\n\r\n                    Mavericks: Porzingis went through his first full workout Tuesday after Dallas returned from its season-opening three-game trip. Carlisle says Porzingis is still on track for a January debut. ... Dallas shot 30% in the second half after being right at 50% at halftime. ... Doncic backup Jalen Brunson scored 16 points, and Maxi Kleber had 12 — all on first-quarter 3-pointers.\n\n\r\n                    TESTY JOHNSON\n\n\r\n                    James Johnson was ejected along with Cody Martin after the two had an altercation late in the fourth quarter. Johnson, a newcomer who figured to add toughness to the Dallas roster, was called for a technical from the bench in the first quarter before even entering the game. \n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Memphis visits Charlotte on Friday after sweeping the season series last year. The Hornets had won the previous five meetings.\n\n\r\n                    Mavericks: Miami visits Dallas on Friday in what could be the third meeting between Doncic and Slovenian countryman Goran Dragic. Doncic is 0-4 against the Heat, who have won six consecutive games against the Mavericks. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997052.445214
}