{
  "game_id": "0022200363",
  "espn_id": "401468518",
  "date": "Dec 07, 2022",
  "matchup": "ORL vs. LAC",
  "headline": "Magic beat Clippers 116-111 in OT, snap 9-game losing streak",
  "body": "ORLANDO, Fla. -- — Rookie Pablo Banchero scored 10 of his 23 points in overtime and the Orlando Magic snapped a nine-game losing streak with a 116-111 win over the Los Angeles Clippers on Wednesday night.\n\n\r\n              Banchero, the top overall pick in the NBA draft, made all six of his free throws in the final seven seconds of overtime, rallying the Magic from a 111-110 deficit.\n\n\r\n              “I think the ball just found me later in the game. I think I was aggressive the whole game, but I was just letting it come to me. I was going to take my opportunities when they came,” the 20-year-old Banchero said. “I don’t really go in the lane thinking I’m trying to get fouled. I’m just trying to go score.”\n\n\r\n              The Clippers never got a shot off in the final seconds because of two turnovers — one a five-second violation in which they couldn't inbound the ball.\n\n\r\n              Terrance Mann came off the bench to lead the Clippers with 19 points. Nicolas Batum scored 16 points and center Ivica Zubac had 16 points and 13 rebounds before fouling out with seven seconds left in overtime.\n\n\r\n              Bol Bol and Mo Wagner each scored 20 points for the Magic, who trailed by 18 points in the first quarter and by 17 late in the third.\n\n\r\n              “(The comeback) really is big for this group,” coach Jamah Mosley said. “They communicated in the huddles, which I love, when we were down. Not getting too far down. Staying in the moment. They understood exactly what they have do in these moments.”\n\n\r\n              Paul George and Kawhi Leonard combined for 17 points in the first quarter and the Clippers made five 3-pointers in the first seven minutes to race to a 23-6 lead. The Magic shot 4 for 18 with seven turnovers in the first period and trailed 32-14.\n\n\r\n              \"I just thought that once we got the lead, we didn't do a good job of playing the same way that got us the lead,\" said Clippers coach Tyronn Lue. “We had 17 turnovers for 29 points.”\n\n\r\n              Cole Anthony's 3-pointer started a 12-2 run late in the first half to get the Magic within three points. Leonard hit a 3-pointer late in the third period that extended the Clippers' lead to 17 points before Bol and Anthony led another charge to get Orlando back in it.\n\n\r\n              “Our energy helped us get a lot of stops down the stretch,” said the 7-foot-2 Bol, who had nine rebounds and two blocks.\n\n\r\n              Franz Wagner scored seven points during a 17-1 run that gave Orlando an 85-79 lead before George and Batum re-entered the game with 8:36 remaining in the fourth, launching an 18-4 run by the Clippers.\n\n\r\n              Leonard, Fultz and George missed jumpers in the final seconds of the fourth quarter and the two lowest-scoring teams in the NBA were tied at 99-99 at the end of regulation.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: George had 10 points in the first quarter and finished with 11. . . . G Luke Kennard (calf) sat out as a precaution. ... F Marcus Morris (illness) did not play but is hopeful of playing Thursday. ... G Norman Powell missed a fourth game with a strained left groin. ... G John Wall did not play due to a sore knee. \n\n\r\n              Magic: Fultz's only point of the game was the final point of the fourth quarter. ... C Wendell Carter Jr. missed a 10th straight game with a foot injury. ... G Jalen Suggs (ankle), F Chuma Okeke (knee) and G Gary Harris (hamstring) did not play.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Play at Miami on Thursday night.\n\n\r\n              Magic: Host Toronto Raptors on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994648.291886
}