{
  "game_id": "0021500829",
  "espn_id": "400828716",
  "date": "Feb 21, 2016",
  "matchup": "MEM @ TOR",
  "headline": "DeRozan leads Raptors past Grizzlies, 98-85",
  "body": "TORONTO --  Back home for the first time in three weeks, the Toronto Raptors started playing tough defense again in a workmanlike win.\n\nDeMar DeRozan scored 21 points, Kyle Lowry added 18 and the Raptors beat the Memphis Grizzlies 98-85 Sunday night for their eighth consecutive victory at home.\n\nJonas Valanciunas, one of five Toronto players in double digits, had 10 points and 12 rebounds for his 13th double-double of the season. Cory Joseph scored 14 off the bench to help the Raptors rebound after giving up 110-plus points in consecutive losses at Minnesota and Chicago.\n\nFor coach Dwane Casey, who made no effort to disguise his displeasure with Toronto's lackluster play on the road, the return to defensive fundamentals was a welcome sight.\n\n\"Everyone's knees were bent, down in the stance, ready to play and out of the vacation mode I think,\" he said. \"If you look around the league, the scores have all spiked up and I say this again, I think the whole league has to get used to that long week of time off and get back into game shape, get the sea legs back, get the mentality back and play basketball.\"\n\nIt was the Raptors' first home game since a Jan. 30 victory over Detroit. Toronto hosted the NBA All-Star Game last weekend.\n\nZach Randolph had 18 points and Mario Chalmers scored 17 for the Grizzlies. Vince Carter added a season-high 16 against his former team.\n\nLance Stephenson scored 16 points in his Grizzlies debut after arriving from the Los Angeles Clippers in a trade last Thursday.\n\nLowry, who joined DeRozan as the two Raptors who took part in the All-Star Game, agreed the party had ended and was now in the rearview mirror.\n\n\"For sure, it felt like that,\" Lowry said. \"We lost the first game out of the break, but now we're back to winning ways.\"\n\nJoseph hit a key 3-pointer with 1:09 left to open a 10-point advantage and all but end any hope of a Memphis comeback.\n\nIn limiting the Grizzlies to 36.8 percent shooting from the field, Toronto improved to 11-0 when holding opponents under 40 percent. Memphis was 3 for 20 from 3-point range.\n\n\"We played better defensively tonight,\" Joseph said. \"Everything was quicker. Quicker to the ball, 50-50 balls, rotations were better. We just tried to keep them out of the paint and make them take tough shots.\"\n\nFor a Grizzlies team that added three new players in Stephenson, P.J. Hairston and Chris Andersen at the trade deadline, and just got Brandan Wright back after he missed 46 games with a knee problem, redeveloping that required chemistry is going to take time.\n\n\"For having a group that's just coming together in the last 48 hours, to go 1-1 this weekend, that's pretty good,\" coach David Joerger said, pointing to his team's 109-104 win over Minnesota.\n\n\"They're fighting and competing and they're doing it together. We'll get better at the technical parts of learning how to play together.\"\n\nPoint guard Mike Conley was impressed with how the newcomers fit in, particularly Stephenson, who played his first game with Memphis after sitting out Friday's victory at Minnesota.\n\n\"Lance looked good,\" Conley said. \"He adjusted really quickly. We kind of slimmed down the playbook a little bit and just gave him three or four plays to remember and just let him play in space and he's really good at that.\"\n\nCONFIDENT CORY\n\nCasey said he expects Joseph to keep improving as a clutch player. \"We give him credit for being in San Antonio, but again, Tony Parker, Tim (Duncan) and (Manu) Ginobili were in at crunch time,\" Casey said. \"Cory is now being the man in crunch time for the first time in his career. He is learning. He is doing a great job and we are excited he is here.\"\n\nCALLING FOR BACKUP\n\nHighlighted by 17 points from Mario Chalmers, the Memphis bench combined for 52 points -- three shy of its season high set Jan. 16 at Oklahoma City.\n\nHEADY COMPANY\n\nDeRozan tied Chris Bosh and Morris Peterson for the most wins by a player in Raptors history (232). \"I kept seeing it on Twitter the past couple days and that's how I really knew,\" DeRozan said. \"It's a cool thing honestly, just to be in the record books, and I have an opportunity to keep growing with that.\"\n\nTIP-INS\n\nGrizzlies: Carter, second on the Raptors' career scoring list with 9,420 points, reached double digits at the Air Canada Centre for the first time since putting up 17 points for Phoenix on Feb. 11, 2011. He received a rousing ovation when he entered in the first quarter. ... Carter needs eight points to pass Charles Barkley (23,757) for 24th in NBA history. ... G Tony Allen (left knee) sat out.\n\nRaptors: The 21 days between home games marked the longest stretch in franchise history. ... Toronto is 18-10 against teams with winning records.\n\nUP NEXT\n\nGrizzlies: Host the Los Angeles Lakers on Wednesday.\n\nRaptors: Visit the New York Knicks on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994432.144227
}