{
  "game_id": "0021900192",
  "espn_id": "401160834",
  "date": "Nov 18, 2019",
  "matchup": "MIL @ CHI",
  "headline": "Antetokounmpo scores 33 as Bucks beat Bulls 115-101",
  "body": "CHICAGO --  Giannis Antetokounmpo showed off a couple of scratches on his hands and arms. The leader of the Milwaukee Bucks was whistled for five offensive fouls, but finished the game on the floor.\n\nThe Chicago Bulls tried everything against the NBA MVP. Nothing worked.\n\nAntetokounmpo had 33 points and 10 rebounds, and the Bucks beat the Bulls 115-101 on Monday night for their fourth straight victory.\n\n\"I'm just going to keep trying to go downhill, keep trying to go through guys,\" said Antetokounmpo, brushing off the foul trouble. \"I'm really happy that they're offensive fouls and they're not dumb fouls and all that.\n\n\"Usually in the games like this that I get offensive fouls, I know that I'm aggressive. ... So I'm happy with that.\"\n\nBrook Lopez added 19 points, 10 rebounds and five blocked shots as Milwaukee won for the eighth time in nine games. The Bucks also beat the Bulls 124-115 on Thursday in Milwaukee.\n\nAntetokounmpo was 13 for 22 in his 13th consecutive double-double to begin the season. It's the longest active streak in the NBA.\n\n\"They have a guy they can go to who can get the bucket,\" Bulls coach Jim Boylen said. \"That's what good teams have. I've been on those teams. We're figuring out who that guy is.\"\n\nDaniel Gafford led Chicago with 21 points in his return from the G League. Coby White had 13, and Ryan Arcidiacono finished with 12.\n\nThe Bulls got a season-high 63 points from their reserves, but Zach LaVine and Lauri Markkanen struggled. LaVine finished with 11 points on 4-for-16 shooting, and Markkanen had nine on 2-for-12 shooting from the field.\n\n\"Shooters, all the players go through slumps,\" said Markkanen, who is shooting just 36.2% this season. \"Everybody's broken through it at some point. When I'm staying confident, believing every shot's going in, I know it's going to turn around.\"\n\nWhite made consecutive 3-pointers to give Chicago a 99-98 lead with 6:23 left, but Milwaukee closed the game with a 17-2 run.\n\nAntetokounmpo got it started with a slick reverse layup. Eric Bledsoe then converted a three-point play to make it 103-99 with 5:04 left.\n\n\"We got stops,\" Lopez said, \"and it's something we need to do for a full 48 minutes every night.\"\n\nGeorge Hill finished with 18 points for Milwaukee, which improved to 7-2 on the road. Donte DiVincenzo scored 15 in his third consecutive start in place of Khris Middleton, who is out with a bruised left thigh.\n\n\"Some really good stuff from him again tonight,\" Bucks coach Mike Budenholzer said.\n\nGafford went scoreless in his first four NBA games, but the second-round draft pick had 16 points in the first half on 8-for-9 shooting, including five dunks.\n\nMilwaukee closed the second quarter with a 12-2 run for a 60-56 halftime lead. Antetokounmpo had 18 points at the break.\n\nTIP-INS\n\nBucks: Hill made four of Milwaukee's 15 3-pointers. ... Middleton isn't expected back until December.\n\nBulls: F Luke Kornet had surgery to address a sinus obstruction. He is expected to be sidelined for seven to 10 days. The 7-foot-1 Kornet had been trying to play through the issue, but he was having trouble sleeping. \"We feel like this is going to be really good for him,\" Boylen said. \"His overall well-being I think we think will improve.\" Kornet signed with Chicago in July. ... LaVine reached 5,000 career points on a 3 in the second quarter.\n\nUP NEXT\n\nBucks: Visit the Atlanta Hawks on Wednesday night. Milwaukee won three of four against Atlanta last season.\n\nBulls: Host the Detroit Pistons on Wednesday night. Chicago beat Detroit 112-106 in their first meeting of the season Nov. 1.\n\n---\n\nJay Cohen can be reached at https://twitter.com/jcohenap\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996174.631573
}