{
  "game_id": "0022200509",
  "espn_id": "401468664",
  "date": "Dec 27, 2022",
  "matchup": "TOR vs. LAC",
  "headline": "George scores 23, Clippers beat Raptors for 7th win in 9",
  "body": "TORONTO -- — Paul George scored 23 points, Ivica Zubac had 23 points and 16 rebounds, and the Los Angeles Clippers won for the seventh time in nine games by beating the Toronto Raptors 124-113 on Tuesday night.\n\n\r\n              Norman Powell scored 22 points off the bench and Kawhi Leonard had 15 as the two members of Toronto’s 2019 championship team returned to Canada for the first time since before the COVID-19 pandemic.\n\n\r\n              Leonard hadn’t played in Toronto since Dec. 11, 2019, when he received his championship ring. Fans cheered when he was introduced before tipoff.\n\n\r\n              “It’s always great memories coming in this arena,” said Leonard, who sat out Monday’s win at Detroit. “I’d rather give the fans in Toronto the chance to see me play again. That was part of my decision.”\n\n\r\n              Reggie Jackson scored 20 points and Marcus Morris Sr. added 10 as all five Clippers starters scored in double digits.\n\n\r\n              “This was one of our most complete games of the season,” Clippers coach Ty Lue said.\n\n\r\n              George made 9 of 18 shot attempts, Jackson went 9 for 15 and Zubac was 7 for 13.\n\n\r\n              “He’s been amazing for us all year,” Lue said of Zubac. “He was a monster on the glass, 10 offensive rebounds.”\n\n\r\n              While the Raptors hadn’t played since Dec. 23, the Clippers were on the second night of a back-to-back and didn’t reach their Toronto hotel until after 3 a.m., arriving after rallying for an overtime victory over the Pistons. Still, the difference in rest didn’t hurt Los Angeles.\n\n\r\n              “It just shows the level that we can play at no matter what’s against us when all the guys are locked in, focused and playing for one another,” Powell said.\n\n\r\n              Pascal Siakam scored 36 points, topping 25 for the career-high fifth straight game, and Scottie Barnes had 17 points and 13 rebounds as the Raptors’ home losing streak reached four.\n\n\r\n              One game after making a season-high 19 3-pointers in a road win at Cleveland, Toronto shot 6 for 23 from distance against the Clippers, matching a season-low. Toronto went 1 for 9 from long range in the second half.\n\n\r\n              “I think the shots not going in are affecting our transition defense and it’s affecting our energy and fight a little bit,“ Raptors coach Nick Nurse said.\n\n\r\n              Gary Trent Jr. scored 20 points, O.G. Anunoby had 18 and Malachi Flynn 10. Each made two 3-pointers for the Raptors.\n\n\r\n              Toronto’s Fred VanVleet left in the first quarter to stretch out his sore lower back, then checked out again early in the third. He finished with four points in 23 minutes and shot 2 for 6, going 0 for 3 from 3-point range.\n\n\r\n              Ahead 60-56 at halftime, the Clippers extended their lead to 18 in the third behind 11 points from Powell. Los Angeles took a 97-82 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: G John Wall (left knee) sat out on the second night of a back-to-back. … Leonard returned after sitting out Monday’s comeback win at Detroit.\n\n\r\n              Raptors: Barnes had eight assists. … Siakam had nine rebounds. … Began a stretch that sees them play nine of 10 at home. … Before the game, Nurse said F Precious Achiuwa (sprained right ankle) is close to returning. Achiuwa missed his 22nd straight game Tuesday. … C Christian Koloko (right knee) left in the fourth quarter and did not return.\n\n\r\n              QUALITY QUARTET\n\n\r\n              The Clippers had a season-high four players score at least 20 points. It’s the first time they’ve done it since Mar. 19, 2021, against Milwaukee.\n\n\r\n              NORM!\n\n\r\n              Powell played north of the border for the first time since Feb. 28, 2020, Toronto’s final home game before COVID-19 shut down the season. Fans gave Powell a loud ovation after the Raptors honored him with a video tribute during a first-quarter timeout.\n\n\r\n              “It’s a full-circle moment for me to be where it all started,” Powell said.\n\n\r\n              Powell planned to leave town with his 2019 championship ring, which had been in Toronto throughout the pandemic.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Boston on Thursday night.\n\n\r\n              Raptors: Host Memphis on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994072.180063
}