{
  "game_id": "0022001068",
  "espn_id": "401307882",
  "date": "May 16, 2021",
  "matchup": "MIL @ CHI",
  "headline": "Young, White help Bulls top starter-less Bucks 118-112",
  "body": "CHICAGO -- — Thaddeus Young scored 20 points, Coby White added 19 and the Chicago Bulls beat Milwaukee 118-112 with Giannis Antetokounmpo and the rest of the Bucks’ starters missing the regular-season finale Sunday night.\n\n\r\n                    The Bucks ruled Khris Middleton out because of lingering soreness in his left ankle, then scratched Antetokounmpo and the rest of the starters once it became clear the No. 2 seed in the Eastern Conference was out of reach.\n\n\r\n                    The Brooklyn Nets clinched the position by beating the Cleveland Cavaliers. That locked Milwaukee into the third spot and a first-round matchup against the Miami Heat. \n\n\r\n                    Coach Mike Budenholzer saw no need to use his starters with little on the line. The game was the Bucks' fifth in seven days.\n\n\r\n                    “Once the Brooklyn score went final, I think it was particularly for the starters, a decision that made a lot of sense,” he said. “Give them a day, give them a little extra time.”\n\n\r\n                    Bucks rookie Jordan Nwora set career highs with 34 points and 14 rebounds. Jeff Teague scored 23. But with its top players out, Milwaukee came up short after winning eight of nine.\n\n\r\n                    “I'm really confident in my game,” Nwora said. “I think I can play whenever they need me, just by staying ready. I'm on a great team, behind some great players. Just being patient, being ready.”\n\n\r\n                    The Bulls prevented the Bucks from becoming the first NBA team to go unbeaten in its division, with an 11-1 mark against the Central. Chicago also snapped a 12-game losing streak against Milwaukee.\n\n\r\n                    WINNING FINISH\n\n\r\n                    Lauri Markkanen scored 17, Ryan Arcidiacono set season highs with 14 points and four 3-pointers, and the Bulls finished their first season under coach Billy Donovan on a winning note — even though Zach Lavine (right knee tendinitis) and Nikola Vucevic (hip) did not play. But they know they have work to do if they're going to contend in the conference.\n\n\r\n                    “Every day for me with these guys was phenomenal,\" Donovan said. “It was a great group. ... I've got a strong affinity for these guys as people and the way they conducted themselves professionally. It's hard for me to sit here and say, ‘OK, what does our team need?’\"\n\n\r\n                    ON TARGET\n\n\r\n                    The Bulls were up by four early in the fourth when Arcidiacono — who did not miss a 3 in the game — hit three from beyond the arc in a span of a minute as the lead grew to 100-89. \n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: The Bucks averaged a franchise-record 120.1 points, making them the first team to score 120 or more per game since the 1984-85 Denver Nuggets. ... Middleton missed his fourth game this season. “We feel like if we can kind of get on top of it this 24, 48 hours, I think he’ll be in a great place heading into the week of prep and playoffs,” Budenholzer said. ... F Thanasis Antetokounmpo exited with a sore right patella tendon. \n\n\r\n                    Bulls: Donovan is missing the playoffs for the first time in six seasons as an NBA coach. He got there each of the past five years with Oklahoma City. “I've probably been in situations in college where you probably knew you were not going to make the NCAA Tournament,” said Donovan, who led Florida to two NCAA championships in 19 years. “It came down to your conference tournament, and a lot of times in those situations, it was having to win four games in four days, which is really challenging.” ... Daniel Theis (sprained right hip), Tomas Satoransky (sprained left ankle) and Troy Brown Jr. (sprained left ankle) were unavailable. \n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Open the playoffs at home against Miami.\n\n\r\n                    Bulls: Season is over.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997648.822958
}