{
  "game_id": "0021600414",
  "espn_id": "400899856",
  "date": "Dec 19, 2016",
  "matchup": "CHI vs. DET",
  "headline": "Bulls break out of slump for 113-82 rout of Pistons",
  "body": "CHICAGO --  For the Chicago Bulls, snapping out of their recent slump was as simple as putting the ball in the basket.\n\nJimmy Butler scored 19 points, Rajon Rondo had 10 points, 14 assists and eight rebounds, and the Bulls beat the Detroit Pistons 113-82 on Monday night to end a three-game losing streak.\n\n\"Everything looks better when you're making shots,\" Butler said. \"If you're not making shots, it's hard to win.\"\n\nTaj Gibson added 16 points, Robin Lopez had 14 and Dwyane Wade, Doug McDermott and Nikola Mirotic had 13 apiece for Chicago, which had lost six of eight.\n\nJon Leuer scored 16 points for the Pistons, who have dropped three straight and four of five.\n\n\"We got crushed,\" Detroit coach Stan Van Gundy said. \"It was a disgusting performance by all of us, me included. I mean, it was unprofessional, embarrassing, humiliating. Whatever you want to say, it was terrible.\n\n\"It looks to me like a lack of effort and a lack of heart. And if you don't play hard, you're not going to have any confidence. We looked like we were hoping the game would be easy tonight, and it wasn't. And we just caved.\"\n\nAfter scoring just 69 points in a 26-point loss to Milwaukee on Friday, the Bulls busted out for 69 points in the first two quarters, their best for any half this season.\n\nChicago, which entered tied for sixth-worst in the NBA with a .436 field-goal percentage, made 17 of 21 shots (81 percent) in taking a 35-19 lead at the end of the first quarter.\n\nThe Bulls had 15 assists on their 17 field goals, with Rondo (seven) and Butler (six) leading the way.\n\n\"That ball was moving so rapidly and everybody was getting rhythm shots,\" Butler said. \"When you see your first few go in, it's a long night for whoever's guarding you.\"\n\nThe Bulls still were shooting a blistering 72.7 percent at halftime -- they led 69-34 -- and even managed to knock down 4 of 6 3-pointers, which had been a problem during their recent struggles.\n\nThe lead was 97-63 entering the fourth quarter, and the Pistons offered little resistance from there. None of the Chicago starters played in the fourth.\n\n\"Give the guys a lot of credit for stepping up,\" Bulls coach Fred Hoiberg said. \"Last week was an embarrassing week for everybody.\"\n\nTIP-INS\n\nPistons: They held a players-only meeting following Saturday's 15-point home loss to Indiana, but Van Gundy didn't place much significance on it. \"Team meeting my (butt),\" he said. \"Like I said before, that stuff means nothing. It's what you do on the court. Talking's easy.\"\n\nBulls: They shot a season-best 59.8 percent from the field and tied a season high with 34 assists. Their 15 first-quarter assists are tied (with Golden State) for the most assists in a quarter this season. . Their previous high for a half was 65 points in the first half of a game Oct. 31 at Brooklyn.\n\nMIROTIC RETURNS\n\nAfter not playing the previous two games (both coach's decisions), Mirotic entered the game with 3:39 left in the first quarter. He hit his first three shots, including a 3-pointer, and finished with 10 points in 12 first-half minutes.\n\n\"The big thing was the way he performed at practice,\" Hoiberg said. \"He has been coming in to get to work. He was the first guy in the gym four or five straight days. I wanted to get him back in there and he hit a couple of shots.\"\n\nFILM STUDY\n\nA large portion of Chicago's three-hour practice on Sunday was watching lowlights of the 95-69 loss to Milwaukee on Friday.\n\n\"Everybody came in with an open mind, took the criticism that they deserved and learned from it and got better,\" Butler said.\n\nUP NEXT\n\nPistons: Host Memphis on Wednesday night.\n\nBulls: Conclude a three-game homestand against Washington on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995075.691417
}