{
  "game_id": "0021500413",
  "espn_id": "400828300",
  "date": "Dec 21, 2015",
  "matchup": "POR @ ATL",
  "headline": "Dennis Schroder helps Hawks beat Blazers despite losing tooth",
  "body": "ATLANTA -- Something that appeared to be a tooth flew out of Dennis Schroder's mouth after a collision.\nNo big deal. Schroder wasn't about to leave the game.\nSchroder took advantage of Portland's depleted backcourt to score 18 points, and the Atlanta Hawks beat the Portland Trail Blazers 106-97 on Monday night for their fourth straight win.\nSchroder, Atlanta's backup point guard, said he lost the cap that had been bonded to his tooth after a collision with Meyers Leonard's knee. He casually slipped it into his sock and remained in the game to lead six Atlanta scorers in double figures.\nSchroder said he'll visit his dentist \"ASAP\" on Tuesday. Hawks coach Mike Budenholzer said he liked the toughness he saw in Schroder and when Paul Millsap returned after tweaking his left ankle and leaving the game.\n\"I thought the competitiveness and the toughness, you could feel it tonight,\" Budenholzer said. \"We could breathe again when Paul came back in.\"\nThe Trail Blazers were without their starting guards and leading scorers, Damian Lillard and C.J. McCollum. Lillard has plantar fasciitis in his left foot and missed a game for the first time in his career, ending his streak of playing in 275 consecutive games.\nMcCollum has two sprained ankles. Lillard said he has been playing with a sore foot for a few weeks.\nAllen Crabbe had 19 points for Portland in a fill-in start. Tim Frazier had 12 points and seven assists and fell 25 seconds shy of playing the full 48 minutes.\n\"I did all right,\" Frazier said. \"But we didn't get a win. I didn't do enough. I think we showed some fight out there tonight, top to bottom.\"\nThe Trail Blazers have lost four straight.\nPortland's Maurice Harkless had 14 points, including three straight baskets in the second quarter: a 3-pointer, a left-handed layup and a jam. Mason Plumlee, who had 11 points, added two free throws to cut Atlanta's lead to 40-39.\nKent Bazemore's drive for a basket ended Portland's run. The Hawks pushed the lead to 55-43 at halftime and continued to pull away in the third period.\nA basket by Thabo Sefolosha early in the final quarter stretched the lead to 21 points at 79-58. The Trail Blazers cut the deficit below 10 points late in the game but couldn't make a serious charge.\nSefolosha, Mike Scott and Jeff Teague had 13 points for Atlanta. Paul Millsap had 12.\nTIP-INS\nTrail Blazers: The Blazers fell to 1-9 against the Eastern Conference this season. ... Gerald Henderson had 12 points.\nHawks: Bazemore had 12 points. ... C Edy Tavares was inactive after being recalled from the Austin Spurs of the NBA Development League.\nNO 48 FOR FRAZIER\nPortland coach Terry Stotts said before the game Frazier might play the full 48 minutes. Frazier settled for 47:35.\n\"I was actually kind of disappointed I took him out that one possession,\" Stotts said. \"I would have liked to have had him (play) 48. But he had three fouls.\"\nFrazier, who started three games with Philadelphia last season as a rookie, made his first start for Portland.\nSTREAK ALIVE\nThe Hawks' four-game winning streak, which followed three straight losses, is good news for an Atlanta team that had struggled to reclaim the form it showed in advancing to last season's Eastern Conference finals.\n\"It's been a while since we have been streaking,\" Bazemore said. \"We had a little rough patch there.\"\nSTREAK ENDS\nLillard said he had to think about protecting his health for the remainder of the season instead of preserving his consecutive games streak.\n\"It's more about not trying to be extra tough, worried about the streak or anything like that,\" Lillard said. \"It's something I can take care of now and try to just handle it now as opposed to it lingering on for the rest of the season.\"\nLillard said he expects to miss only \"one game, maybe two.\"\nUP NEXT\nTrail Blazers: At New Orleans on Wednesday night.\nHawks: Host Detroit on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994525.157326
}