{
  "game_id": "0022300663",
  "espn_id": "401585291",
  "date": "Jan 29, 2024",
  "matchup": "MEM vs. SAC",
  "headline": "Domantas Sabonis has career-high 26 rebounds as Kings shut out Grizzlies late for 103-94 win",
  "body": "MEMPHIS, Tenn. -- — Domantas Sabonis had a career-high 26 rebounds along with 20 points, De'Aaron Fox scored 23 points and the Sacramento Kings rallied past the injury-plagued Memphis Grizzlies 103-94 on Monday night.\n\n\r\n              Sabonis finished 10 of 11 from the field and had 16 rebounds in the first half, a Kings record for rebounds in a half since the franchise moved to Sacramento in 1985. His previous career best was 25 rebounds for Indiana on Nov. 29, 2021 against Minnesota, and he surpassed it with 27.5 seconds left — part of a stout defensive performance by the Kings to close out the game.\n\n\r\n              Sabonis had five assists, becoming the second player in NBA history with at least 20 points, 25 rebounds, five assists and a shooting percentage of 90% or better. The other was Wilt Chamberlain, who did it six times.\n\n\r\n              Kings coach Mike Brown called it “a monster night.”\n\n\r\n              “I'm not saying he's Wilt,” Brown said, “but to be mentioned in that category for putting up that statistical line like he did, that's absolutely amazing.”\n\n\r\n              Sacramento held Memphis scoreless over the final three minutes. Kevin Huerter added 17 points for the Kings, who won their fourth straight.\n\n\r\n              “They've got the clutch player of the year in De'Aaron Fox,” said Memphis forward GG Jackson, who finished with 12 points. “He hit some very, very, very tough shots. ... Obviously, Sabonis did Sabonis things.”\n\n\r\n              Jaren Jackson Jr. led the Grizzlies with 22 points and Santi Aldama scored 16 on 5-of-14 shooting. Scotty Pippen Jr. had 12 for Memphis, which fell to 5-16 at home.\n\n\r\n              The Grizzlies led by 15 points in the first half and held onto the lead until midway through the third quarter. Sacramento outscored Memphis 28-21 in the period.\n\n\r\n              The Grizzlies pulled ahead 92-88 with 4:43 left before the Kings responded with a decisive 12-2 run. Memphis missed six of its final seven shots.\n\n\r\n              “The coaching staff warned us that if we didn’t come out and play hard and be the aggressive team, it was going to be a long night,” Sabonis said. “And it was.”\n\n\r\n              As they have done all season, the Grizzlies played short-handed. The injury report listed 11 players out against the Kings, and the Grizzlies signed 6-foot-9 forward Matthew Hurt to a 10-day contract earlier Monday. Hurt finished with 10 points.\n\n\r\n              Memphis used its 27th starting lineup of the season. Nonetheless, the Grizzlies played well until the closing minutes.\n\n\r\n              “Our guys love to compete,” Memphis coach Taylor Jenkins said. “That's how we've always operated. So, I was not surprised by the performance. Obviously, we didn't come out with a win, but so proud of the way our guys battled.”\n\n\r\n              The Grizzlies started 7 of 10 from 3-point range to build an early lead. Meanwhile, the Kings missed their first 12 3s before Malik Monk knocked one down in the second period. Brown said he wasn't bothered by the cold start, saying his team took good shots.\n\n\r\n              Sacramento got closer with a 10-0 run midway through the second. Memphis led 50-47 at the break, when the Kings had 12 turnovers. They finished with 19.\n\n\r\n              Sabonis helped the Kings stay close enough to make a push at the end, and he had a couple rebounds and a dunk in the closing rally.\n\n\r\n              “The impressive thing with (Sabonis) is he plays hard every single night,” Huerter said. “Eighty-two games. He wants to be on the court. He really sets the tone for us on both sides of the ball. Just his energy. The way he talks to guys, trying to will us to victory.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Continue their seven-game trip at Miami on Wednesday.\n\n\r\n              Grizzlies: Host Cleveland on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996016.106882
}