{
  "game_id": "0021600934",
  "espn_id": "400900329",
  "date": "Mar 06, 2017",
  "matchup": "MIL @ PHI",
  "headline": "Antetokounmpo, Snell lead Bucks past 76ers, 112-98",
  "body": "PHILADELPHIA -- The Milwaukee Bucks have picked the perfect time to play their best basketball of the season.\nGiannis Antetokounmpo scored 24 points, Tony Snell had 18 of his season-high 21 in the first half and the Bucks never trailed in a 112-98 victory over the Philadelphia 76ers on Monday night.\nMalcolm Brogdon and Khris Middleton added 13 apiece for the Bucks, who won their third straight game to stay 1 1/2 games back of Detroit for the final playoff spot in the Eastern Conference playoff race.\n\"Right now we're playing our best basketball,\" Antetokounmpo said. \"Everybody is playing hard, we're playing team basketball and we're making a (playoff) push. That's great for us right now.\"\nThe Bucks executed their game plan just as it was drawn up on the board in their locker room.\nWritten atop the board were the words \"pass pass pass,\" and Milwaukee had 28 assists on 41 baskets.\n\"When the ball is moving like that and guys are making shots, it's fun to watch,\" coach Jason Kidd said.\nFirst among the defensive keys was \"keep 3 out of game.\" Philadelphia shot 26.7 percent from the arc.\nSecond among the defensive keys was \"transition -- keep out of game.\" The 76ers had just 15 fast-break points.\nKidd really liked what he saw on Monday.\n\"Being aggressive, sharing the ball, playing defense at the right time of the year,\" he said. \"Our playoff season has started now. It's great they all believe they can make this push and it's going to take all of us. Everybody has to chip in and it starts at the defensive end.\"\nJustin Anderson tied his career high with 19 points for Philadelphia, which has lost five of six. The 76ers were without big man Jahlil Okafor (knee) for the second straight game. They are so short of bodies that they received a hardship exception to sign Shawn Long to a 10-day contract on Monday. Long, in his NBA debut, had 13 points and seven rebounds.\n\"I've played 64 combinations since the All-Star break, born of injury, born of trades,\" Philadelphia coach Brett Brown said. \"The good news is, we've had a lot of practice at this. We will navigate through this.\"\nHall of Famers Allen Iverson and Julius Erving were present. The retired 76ers franchise greats probably could've helped, too.\nIt was the second straight lopsided loss for the 76ers, who had just nine players when they allowed a season-high 136 points in a 30-point loss to the Pistons on Saturday night.\n\"It's unacceptable, if you ask me, because we don't have enough guys,\" said Philadelphia's Dario Saric, who had 14 points and eight rebounds. \"We've got maybe five, six injuries and started minus-17 and tried to win the game. I think it's not possible.\"\nSnell shot 7 of 10 from the field, including 4 of 6 on 3-pointers, to help the Bucks to a 60-43 halftime lead. The 76ers shot just 23.5 percent from the arc before halftime, making 4 of 17 long-range shots.\nAnd the Bucks just kept pouring it on after the break, extending their lead to as many as 27 points in the second half.\nTIP-INS\nBucks: Michael Beasley (hyperextended left knee) missed his third straight game. ... After scoring 16 points in 17 minutes in Saturday's 101-94 win over Toronto, Spencer Hawes had two points in six minutes. ... Snell topped his previous season best of 20 points on Dec. 26 at Washington. His career high is 24 on Feb. 10, 2015, at Sacramento while a member of the Bulls. ... The Bucks shot 49.4 percent (41 for 83) from the field.\n76ers: Long was averaging 20.2 points and 11.1 rebounds for Delaware 87ers in the D-League. ... Gerald Henderson returned after missing two straight games with a hip injury and scored five points in 17 minutes.\nNOT THIS TIME\nThe Bucks had lost both previous meetings to Philadelphia, including a 114-109 loss in Milwaukee on Jan. 25 in which the 76ers scored 72 first-half points.\nPhiladelphia didn't reach 72 points until the fourth quarter in this one.\nLONG'S NIGHT\nLong didn't seem to have any first-game jitters. He said his comfort level was helped by the fact that he spent training camp with the 76ers.\n\"I just felt good,\" he said. \"I felt comfortable. Coach told me to shoot it. When a coach tells you to shoot it, it gives you confidence.\"\nUP NEXT\nBucks: Host the Knicks on Wednesday night.\n76ers: At Portland on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995151.2574239
}