{
  "game_id": "0022200691",
  "espn_id": "401468846",
  "date": "Jan 20, 2023",
  "matchup": "SAC vs. OKC",
  "headline": "Murray scores 29, Sabonis has triple-double, Kings beat OKC",
  "body": "SACRAMENTO, Calif. -- — Rookie Keegan Murray had season highs of 29 points and 14 rebounds, Domantas Sabonis added his fifth triple-double of the season and the Sacramento Kings beat the Oklahoma City Thunder 118-113 on Friday night for their sixth consecutive win.\n\n\r\n              “Overall, I feel like our team has kind of rallied around me, and I’m grateful for that,” Murray said.\n\n\r\n              Sabonis finished with 18 points, 14 assists and 13 rebounds. Murray, the No. 4 pick in the draft from Iowa, became the first Kings rookie to record consecutive double-doubles since the 2018-19 season.\n\n\r\n              “Keegan surprised me tonight,” Kings coach Mike Brown said. \"He had a couple of moves that I’m really impressed with. I can’t wait to go back and watch. He had a couple of moves that I am in love with. I’m glad that he’s starting to show what he is capable of.”\n\n\r\n              De'Aaron Fox scored 23 points and Kevin Huerter chipped in 14.\n\n\r\n              The Kings (26-18) have two six-game winning streaks in the same season for the first time since 2002-03 and are third in the Western Conference.\n\n\r\n              Isaiah Joe knocked down a 3-pointer with 2.4 seconds left to cut the Kings' lead to three before Fox made a layup off an inbound pass. \n\n\r\n              “The team always runs through the finish line,” Thunder coach Mark Daigneault said. “Great competitive level. We played exceptionally hard. …certainly a relevant game we can learn from.”\n\n\r\n              Shai Gilgeous-Alexander scored 37 points for the Thunder (22-24), who had won three of four.\n\n\r\n              Joe finished with 21 points off the bench. Lu Dort and Josh Giddey each scored 15 points.\n\n\r\n              “The guys fought hard,” Joe said. “We all fought hard. ...we were focused and we fell short to a team that's been rolling.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: F Jeremiah Robinson-Earl remained out with an ankle sprain and illness.\n\n\r\n              Kings: Sabonis returned from a one-game absence from a non-COVID illness. …Fox received a technical foul with 7:41 left in the second quarter\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Philadelphia on Saturday.\n\n\r\n              Thunder: At Denver on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995303.640036
}