{
  "game_id": "0022300918",
  "espn_id": "401585546",
  "date": "Mar 09, 2024",
  "matchup": "CHA vs. BKN",
  "headline": "Miles Bridges scores 24, Hornets beat Nets 110-99 to snap 6-game losing streak",
  "body": "CHARLOTTE, N.C. -- — Miles Bridges had 24 points and 10 rebounds, Brandon Miller added 23 points and the Charlotte Hornets delivered another blow to the Brooklyn Nets’ sagging playoff hopes with a 110-99 win on Saturday night.\n\n\r\n              Nick Richards added 15 points and 11 rebounds and Vasa Micic chipped in with 12 points and 10 assists for the Hornets (16-48), who snapped a six-game losing streak.\n\n\r\n              “We came out with real good energy tonight,” Richards said.\n\n\r\n              Cam Thomas returned from a six-game absence due to an ankle injury and scored 31 points in 30 minutes while playing under a minutes restriction, but the Nets (25-39) still fell 4 1/2 games behind the Atlanta Hawks for the 10th and final play-in spot in the Eastern Conference with their third loss in four games.\n\n\r\n              “We have to take care of our business and win these last games and hopefully things will turn around and go in our favor,” Thomas said. “But we have to stick to it and keep playing.” \n\n\r\n              Thomas said Brooklyn's man-to-man defense needs to improve, citing several instances where Hornets players — most notably Micic and Miller — were able to blow by defenders and score on easy baskets.\n\n\r\n              “It's effort man, that's all of it,” Thomas said. “... Giving up straight line drives is hard and it puts a lot of pressure on our defense because then they can just spread it out and make wide-open 3s, catch-and-shoot 3s. We have to take pride in just keeping someone in front of us.\"\n\n\r\n              Thomas, who was a game-time decision, decided to give it a go and put in 17 points in the first quarter on 7-of-8 shooting while helping the Nets build a 12-point lead.\n\n\r\n              But the momentum wouldn't last.\n\n\r\n              Charlotte would battle back to take a 63-52 lead at halftime behind Bridges and Miller. Brooklyn had several defensive breakdowns in the second half, including one where they left Bridges wide open under the basket for an easy two-handed jam en route to building a 12-point advantage.\n\n\r\n              It was the second straight night the Hornets carried an eight-point lead into the fourth quarter, but unlike Friday when they surrendered 44 points to Washington and lost 112-100, Charlotte didn't fold.\n\n\r\n              When the Nets cut Charlotte's double-digit lead to six with two minutes to play, Miller scored on a driving layup high off the glass to stem the tide. After a Nets miss, Bridges scored on a transition layup and drew a foul for a 3-point play to push Charlotte's lead to 11 and secure the victory.\n\n\r\n              “That's what I said to the guys: 'We’re in the same exact place,'” Hornets coach Steve Clifford said. “Against Washington we kind of lost our way in the fourth quarter at both ends. Our offense and defense was awful. Tonight we weren't great offensively, but our defense was great.”\n\n\r\n              Along with Thomas, Nets backup center Day’Ron Sharpe also was back after missing two games with a wrist injury. Cam Johnson sat out with an ankle sprain.\n\n\r\n              Charlotte played without six players due to injury.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Cleveland on Sunday night.\n\n\r\n              Hornets: At Detroit on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995949.27344
}