{
  "game_id": "0021800569",
  "espn_id": "401071245",
  "date": "Jan 04, 2019",
  "matchup": "CHI vs. IND",
  "headline": "Victor Oladipo hits late 3, Pacers beat Bulls 119-116 in OT",
  "body": "CHICAGO --  Victor Oladipo calmly rose to the occasion again and helped the Indiana Pacers emerge from a frantic finish with another win.\n\nOladipo banked in a 3-pointer from just above the top of the arc with 0.3 seconds left in overtime to give Indiana its sixth straight victory, 119-116 over the Chicago Bulls on Friday night.\n\nOladipo had 36 points and seven rebounds, including some big baskets in the third quarter that gave the Pacers their first lead after Chicago got off to a fast start.\n\nOn his game-winner, Indiana's leading scorer stepped from the center court logo toward the arc and fired a shot over Kris Dunn than kissed the backboard and dropped through the net.\n\n\"It felt great coming out of my hands, and it banked in,\" Oladipo said. \"It felt like I didn't bank it, it would have been a swish. I work on that shot all the time.\"\n\nChicago's Zach LaVine then hit a 3-pointer from the corner, but after time ran out in the extra period.\n\nIndiana's Domantas Sabonis added 23 points and 12 rebounds in the first game of a five-game trip. Thaddeus Young had 16 points, including several key baskets down the stretch in the fourth quarter, to help the Pacers overcome an early 12-point deficit.\n\n\"(Oladipo) is our star,\" Young said. \"Before overtime started, I pulled him aside and said, `It's time to take us to the promised land.\"\n\nThe Bulls (10-29) young lineup gave the rising Pacers (26-12) all they could handle.\n\nLaVine led Chicago with 31 points. He made two 3-pointers in the closing moments of regulation to tie it at 105 and send it to overtime. He hit the first 3 with 17.3 seconds left from outside the left side of the arc, then knotted it with 3.9 seconds remaining from almost the same spot.\n\nIndiana made nine of 28 3-point attempts, but Chicago hit 12 of 28.\n\n\"We need to get closer and pressure the ball,\" Pacers coach Nate McMillan said.  \"The good thing is you can learn off a win.\"\n\nLauri Markkanen had 27 points, and Dunn had 16 points and 17 assists for Chicago.\n\nLaVine was 5 for 9 from beyond the arc. Markkanen was 4 of 9.\n\n\"I think we got in a rhythm early where we were pushing the pace and were taking and making 3's,\" LaVine said. \"It's just one of those types of games you want to win.  Either team could have said we should have won that game.\"\n\nThe Bulls dropped their third straight and fourth in their last five. But Chicago looked quick and confident, and nothing like a team that had been clobbered 112-84 by Orlando on Wednesday.\n\n\"I think everyone had their moments when they were feeling hot and were making shots,\" Markkanen said. \"I think we found the right guys at the right times tonight and just tried to play unselfish and make plays.\"\n\nChicago led 78-75 heading into the fourth quarter, but Indiana grabbed a six-point lead with 1:12 left when Sabonis hit a pair of free throws. LaVine then tied it\n\nTRADE FALLOUT: Guards MarShon Brooks and Wayne Selden Jr., acquired by the Bulls in a trade Thursday that sent guard Justin Holiday to Memphis, has not yet joined Chicago. The Grizzlies also sent second-round picks in 2019 and 2020 to the rebuilding Bulls. Chicago waived guard Cameron Payne in another move.\n\n\"What we did last night was consistent with our direction,\" Executive Vice President-Basketball Operations John Paxson said. \"Getting the two second-round picks was important to us. We're going to keep Wayne Selden. He's a young player and we'll see what he develops into. It's a deal we felt we had to make.\"\n\nYOUTH TO THE FRONT: Chandler Hutchison, a 22-year-old rookie forward, moved into Chicago's young lineup and made his fourth start this season. Hutchison and the Bulls' four other starters -- Markkanen, Wendel Carter Jr., LaVine and Dunn -- were all first-round picks. Dunn, who's 24, is the oldest in the group. Carter is the youngest at 19.\n\n\"(The trade) gives Chandler Hutchison an opportunity to play,\" Paxson said. \"He'll have to meet the standards Jim (Boylen) and we want, but he'll get the opportunity.\"\n\nTIP-INS\n\nPacers: C Myles Turner was back in the starting lineup, wearing a face mask, after breaking his nose in a collision with Atlanta forward-center John Collins midway through the third quarter of a 116-108 win Monday in Indianapolis. Turner had 20 points, eight rebounds and blocked four shots in less than 24 minutes in that game, then needed only a brief medical procedure to fix his nose. \"I'm feeling great,\" Turner said before Friday's game. \"Excited to get out there.\"\n\nBulls: F Bobby Portis (sprained right ankle) missed his seventh straight game but might return Sunday when the Bulls host Brooklyn. Portis will have another contact day on Saturday. \"It does look good,\" coach Jim Boylen said, \"but I'm not going to bank on it.\" ... F Jabari Parker entered the game in the first quarter after not playing since Dec. 13 at Orlando (nine games) due to illness and coaching decisions.\n\nUP NEXT\n\nPacers: At Toronto on Sunday night\n\nBulls: Host Brooklyn on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994820.979039
}