{
  "game_id": "0022000420",
  "espn_id": "401267580",
  "date": "Feb 15, 2021",
  "matchup": "IND vs. CHI",
  "headline": "Bulls run past Pacers with late flurry for 120-112 OT win",
  "body": "INDIANAPOLIS -- — Zach LaVine wants to be more than just a flashy scorer. It's a work in progress, but he showed Monday night how much he has improved this season.\n\n\r\n                    After scoring 12 of his 30 points in the fourth quarter to help Chicago force overtime, LaVine dug in defensively and helped lead the Bulls to a 120-112 victory over the Indiana Pacers.\n\n\r\n                    “He’s tried to be more and more engaged (defensively),” coach Billy Donovan said. “I feel like he’s working defensively, and I think he’s finding out how difficult it is to be a two-way player in this league. He’s chasing all these guys, he’s getting hit and he’s working. And late in the game, he was involved in a lot of those defensive stops for us.”\n\n\r\n                    The combination helped the Bulls end a 10-game losing streak in the series and an eight-game skid at Indiana.\n\n\r\n                    And LaVine got plenty of help — after shooting an errant 19-footer at the end of regulation.\n\n\r\n                    Garrett Temple started overtime with a 6-foot pull-up. After Thaddeus Young chased down an offensive rebound, Denzel Valentine made a 3-pointer to give the Bulls a 110-105 lead. They never trailed again.\n\n\r\n                    “That’s what our defense is built on, forcing you into tough shots, making you miss and not letting you get second chances,” said Pacers guard Malcolm Brogdon, who had 23 points and 15 rebounds.\n\n\r\n                    Brogdon helped Indiana charge back from an 11-point deficit in the fourth quarter. Domantas Sabonis' two free throws with 4:58 left in regulation gave the Pacers a 94-92 lead.\n\n\r\n                    After LaVine scored four straight to give the Bulls a 105-103 lead, Brogdon's 5-footer with 10.5 seconds left tied the score at 105.\n\n\r\n                    “We competed and battled, it wasn’t always pretty,” Donovan said. “There were a lot of balls and plays we missed at the rim, but we scrapped and made them miss a lot at the rim. That’s how we have to play.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Coby White had 19 points, eight assists and seven rebounds. ... LaVine also had nine rebounds. ... Young had 13 points and 11 rebounds against his former team. ... Temple had 16 points and Valentine finished with 11. ... Wendell Carter Jr. had 11 points and nine rebounds in his return after being sidelined by a bruised right quadriceps tendon. He sat out the previous 11 games. \n\n\r\n                    Pacers: Sabonis had 25 points, 10 rebounds, five assists and four blocks. ... Guard T.J. McConnell made his first start of the season, replacing Doug McDermott (sore right knee). McConnell scored 19 points — his highest total since joining the Pacers. ... Myles Turner had 11 points and six more blocks — his eighth game this season with five or more. ... The Pacers were 9 of 33 on 3s and had 19 turnovers, ending a five-game stretch with 10 or fewer.\n\n\r\n                    FAN-LESS\n\n\r\n                    The Pacers first welcomed fans back to Bankers Life Fieldhouse on Jan. 24 and played their next five games in front of smaller crowds because of the COVID-19 pandemic. But on Monday, a few hours before tip-off, team officials announced a snowstorm would require them to close the arena doors to fans after city officials announced they were issuing a travel advisory.\n\n\r\n                    INJURY UPDATE\n\n\r\n                    Pacers coach Nate Bjorkgren remains hopeful he can get forward T.J. Warren and guard Caris LeVert back this season. Warren, Indiana's top scorer last season, hasn't played since the Pacers announced Dec. 31 that he would undergo surgery on his left foot. LeVert hasn't played since being acquired in a January trade with Houston after Indiana's team doctors found a cancerous growth on LeVert's kidney. LeVert traveled with his teammates to Brooklyn last week. Warren sat on the bench Monday night.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Visit Charlotte on Wednesday, a venue where they’ve lost two straight.\n\n\r\n                    Pacers: Will try to win its fourth straight over Minnesota on Wednesday in Minneapolis.",
  "source": "espn_api",
  "crawled_at": 1764997148.431805
}