{
  "game_id": "0022200963",
  "espn_id": "401469118",
  "date": "Mar 05, 2023",
  "matchup": "CHI vs. IND",
  "headline": "Haliburton's 3-pointer pushes Pacers past Bulls 125-122",
  "body": "CHICAGO -- — Tyrese Haliburton scored 29 points, including a 3-pointer with 2.7 seconds left, to give the Indiana Pacers a 125-122 victory Sunday over the Chicago Bulls.\n\n\r\n              Haliburton's game-winning shot occurred after Zach LaVine missed a free throw that would have given the Bulls the lead with 22.6 seconds remaining. LaVine, who scored 42 points, was fouled on a 3-point attempt by Bennedict Mathurin and converted the first two free throw tries.\n\n\r\n              “Against Boston (a Feb. 23 loss) I had a shot with four seconds and I didn't take it until the buzzer and took a bad shot, so I shot the first one I saw,\" Haliburton said. 'It felt good.\"\n\n\r\n              After Haliburton's 3-pointer, a game-tying shot attempt by Nikola Vucevic bounced off the rim.\n\n\r\n              “The first couple options weren't open,” the Bulls' DeMar DeRozan said. “At that point, just scrambling to try to get the ball in and get a shot off.” \n\n\r\n              Mathurin added 17 points for the Pacers (29-36), while DeRozan scored 23 for the Bulls (29-36), who lost despite shooting 60.8% (45 for 74) from the field.\n\n\r\n              “We got guys who can put the ball in the basket,” said Bulls guard Patrick Beverley, who guarded Haliburton on the final shot. “We just have to rebound it. That's what it was. We lost it on offensive rebounding.”\n\n\r\n              The Pacers embarked on a 17-2 run and took their first lead at 47-44 on Chris Duarte's 3-pointer with seven minutes left in the second quarter. Duarte and fellow reserve T.J. McConnell each provided a spark while Haliburton rested his sore right calf during the Pacers' spurt.\n\n\r\n              Duarte sank three 3-pointers, and McConnell distributed five assists during the Pacers' run. \n\n\r\n              “I thought our second unit was the key to the game,” Pacers coach Rick Carlisle said. “Ty hit a hellacious shot at the end. He's having a heck of a year.”\n\n\r\n              INJURY REPORT:\n\n\r\n              Pacers: F Aaron Nesmith (sore left hip) out.\n\n\r\n              Bulls: F Javonte Green (right knee surgery) hasn't progressed past straight-ahead running and feels discomfort when attempting to move laterally, coach Billy Donovan said. Green hasn't played since Dec. 31. \n\n\r\n              UP NEXT:\n\n\r\n              Pacers: Monday vs. Philadelphia\n\n\r\n              Bulls: Wednesday at Denver",
  "source": "espn_api",
  "crawled_at": 1764994473.122436
}