{
  "game_id": "0022301048",
  "espn_id": "401585676",
  "date": "Mar 27, 2024",
  "matchup": "CHA vs. CLE",
  "headline": "Brandon Miller scores 31 points on career-high seven 3s as Hornets beat Cavaliers 118-111",
  "body": "CHARLOTTE, N.C. -- — Rookie Brandon Miller made a career-high seven 3-pointers and finished with 31 points, and the Charlotte Hornets beat the Cleveland Cavaliers 118-111 on Wednesday night to avenge a 23-point loss earlier in the week.\n\n\r\n              Miles Bridges and Tre Mann each added 17 points and Grant Williams had 16 off the bench for Charlotte (18-54), which shot 58% from the field to snap a five-game losing streak. Vasa Micic had 11 points and 12 assists, and Nick Richards added 11 points and 10 rebounds.\n\n\r\n              But it was Miller who provided the boost — and the knockout blow with a 3 with 25 seconds left — for the Hornets.\n\n\r\n              “He was big,” Hornets coach Steve Clifford said of the NBA draft's No. 2 overall pick, who was 11 of 19 from the field and had six rebounds. \"He made big plays and he got going in the second half. Another really good performance.”\n\n\r\n              The same can't be said of the Cavaliers (44-29), who lost to one of the league's worst teams. \n\n\r\n              Jarrett Allen scored 24 points and Max Strus, who returned after missing three weeks with a knee injury, added 19 on five 3s. Sam Merrill had 17 points for the slumping Cavs, who have lost four of their last five games.\n\n\r\n              “You go through ups and downs during a season and we definitely aren't playing our best basketball right now,” Merrill said. “We've got to fix that, clearly. But we have also shown that we can play at a high level and we have nine games to get that back before the playoffs.”\n\n\r\n              The Cavaliers beat the Hornets 115-92 on Monday night in Cleveland after Marcus Morris Sr. was ejected after throwing a high elbow that flattened Richards. Morris did not play in this game.\n\n\r\n              Cavs coach J.B. Bickerstaff said his team didn't have the right mental approach, calling it a “frustrating” game.\n\n\r\n              “Our attitude toward winning and losing was not where it needed to be,\" Bickerstaff said. “We settled in the first quarter because we thought the game was going to be easy because we were scoring. ... But they’re NBA players too, and if you give them confidence and you give them opportunity, it’s going to come back and bite you.”\n\n\r\n              The Hornets, who were beginning an eight-game homestand after playing 13 of 17 on the road, played inspired from the start.\n\n\r\n              During one stretch in the fourth quarter, Charlotte had four chances to score after two offensive rebounds by Williams kept the possession alive. That eventually resulted in Miller charging down the lane for an open one-handed dunk.\n\n\r\n              Darius Garland's pull-up 3 from the top of the key gave the Cavaliers a 107-105 lead with 6:47 left in the game and it appeared the Cavs might be on the verge of pulling away.\n\n\r\n              But the Hornets stayed close and regained the lead with two minutes remaining when Miller fed Bridges for an alley-oop dunk in transition and then followed by hitting a one-handed floater.\n\n\r\n              Cleveland didn’t score in the final 3:28 of the game.\n\n\r\n              Allen missed two free throws with 1:04 left and the Cavaliers had two turnovers in the final minute, including a travelling call on Caris LeVert.\n\n\r\n              Miller tied the franchise rookie record for 3s in a game. \n\n\r\n              “I wasn’t aware, I was just happy that we got the win,\" Miller said. \"With being on a losing streak, I think a win like this can start something great and we’ll try to build off this.” \n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host 76ers on Friday night.\n\n\r\n              Hornets: Host Warriors on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995938.6375191
}