{
  "game_id": "0021401125",
  "espn_id": "400579417",
  "date": "Apr 02, 2015",
  "matchup": "HOU @ DAL",
  "headline": "Harden scores 24, Rockets rally past Mavericks, 108-101",
  "body": "DALLAS -- James Harden had plenty of help a night after carrying Houston with a career high in scoring -- he even got a boost from Dwight Howard not long after the center with the troublesome right knee limped off the court.\nHarden scored 24 points, Howard sparked a rally with the strong start to the fourth quarter and former Dallas guard Jason Terry hit a tiebreaking 3-pointer to help the Houston Rockets beat the Mavericks 108-101 Thursday night.\n\"Having `Big Fella' back today kind of helped us out a little bit,\" Harden said of Howard. \"We've got to get his rhythm going `cause we're going to need him in the postseason.\"\nThe Rockets (52-24) moved a half-game ahead of Memphis in the race for the No. 2 seed in the Western Conference behind Golden State.\n\nEven with the loss, the Mavericks (46-30) are likely to end up with the seventh seed after a win over Oklahoma City on Wednesday put them four games up on the Thunder and gave them the tiebreaker. They're now 3 1/2 ahead with six to go.\nDirk Nowitzki led Dallas with 21 points.\nHarden led the Rockets in scoring -- as usual -- a night after scoring a career-high 51 points in a win over Sacramento. But key contributions were plentiful as Houston wiped out six-point deficits twice in the fourth quarter.\nIt started with Howard going high for a rebound, and straight back up for a dunk to start a 6-0 run at beginning of the quarter, when he returned wearing knee pads he didn't have earlier.\nJust last week, Howard returned after missing two months with swelling in his right knee -- and he had limped off the court 4 minutes into the third after not even trying to get off the floor on a couple of alley-oop attempts. But he ended up with eight points and seven rebounds.\n\"There was a point in the game where I got kneed in my knee but gotta go back to the Hakeem knee pads now,\" Howard said, referring to former Rockets star center Hakeem Olajuwon. \"The most important thing is for me to stay healthy and kind of get into a rhythm for these last couple of games, then in the playoffs, really stride out.\"\nTerry broke a 95-all tie with a 3-pointer and had 10 points, and Corey Brewer -- another important part of Dallas' championship run in 2011 -- hit a couple of key buckets and finished with 14. Trevor Ariza scored 19, and Josh Smith had all 15 of his points in the second half and finished with a game-high 12 rebounds.\nHarden appeared to give Houston a 104-97 lead with a layup at the shot-clock buzzer, but it was overturned on review a couple of possessions later. With the score back at 102-97, Nowitzki hit a layup to get Dallas within three with 1:17 left.\nAfter misses from Brewer and Smith, Monta Ellis, who had 19 points, missed a potential tying 3 and the Rockets put the game away at the line. They made all 10 free throws in the fourth quarter.\nDallas center Tyson Chandler had eight points and eight rebounds at halftime, and point guard Rajon Rondo had eight points and six assists at the break. But both were shut out in the second half.\n\"I feel like in the second half we slowed our tempo down,\" Chandler said. \"I think we had them on their heels in the first half.\"\nFREE THROW ADVENTURES\nJoey Dorsey shot an air-ball on a free throw in the first half, and bounced the next one off the backboard and out. Soon after, the Mavericks fouled him on purpose and he had another air ball while missing both again. Clint Capela did the same thing later in the first half. Dorsey was 1 of 6 from the line, but the Rockets recovered to go 29 of 40.\nANOTHER MISSING PIECE\nThe Mavericks have rarely had all players available since adding Amare Stoudemire in mid-February. And now they're not sure the status of forward Chandler Parsons after he left in the third quarter with right knee soreness and didn't return. Coach Rick Carlisle said the knee was hurting after the game against Oklahoma City, and the Mavericks aren't sure when Parsons was injured. Parsons scored 11 points before leaving.\nTIP-INS\nRockets: Harden, the NBA leader in free throws and attempts, was 10 of 12 from the line after making all four in the fourth quarter. ... The current West standings would have the Rockets and Mavericks playing in the first round. \"We may see these guys in the playoffs,\" Brewer said after the Rockets finished 3-1 in the season series. \"So, you want to let `em know we're gonna be beatin' their butts.\"\nMavericks: Dallas played the Rockets all four times this season on the second night of a back-to-back, but this time the Rockets were doing it too -- and playing for the fourth time in five nights. ... Stoudemire had 11 points, five rebounds and two steals in 14 minutes, while Al-Farouq Aminu had seven points, eight rebounds and four blocked shots, including a spike of a Howard attempt in the first half.\nUP NEXT\nRockets: at Oklahoma City on Sunday.\nMavericks: home against Golden State on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764992231.368095
}