{
  "game_id": "401810133",
  "espn_id": "401810133",
  "date": "Nov 23, 2025",
  "matchup": "CLE vs LAC",
  "headline": "Donovan Mitchell scores 37 points, takes over in 3rd in Cavaliers' 120-105 win over Clippers",
  "body": "CLEVELAND -- — Donovan Mitchell scored 37 points and took over when the game got close, leading the Cleveland Cavaliers to a 120-105 victory over the Los Angeles Clippers on Sunday night.\n\n\r\n              Mitchell helped the Cavs pull away with a flurry of plays late in the third quarter. He finished with five 3-pointers, eight rebounds and six assists.\n\n\r\n              Evan Mobley had 18 points and 10 rebounds and De'Andre Hunter scored 17 points as Cleveland went 4-2 on a six-game homestand.\n\n\r\n              Ivica Zubac paced the Clippers with 33 points — two off his career high — and 18 rebounds.\n\n\r\n              James Harden, who ha d a franchise-record 55 points for Los Angeles in a win at Charlotte on Saturday, missed all eight 3-point shots and finished with 19 points. \n\n\r\n              Kawhi Leonard scored 20 points in his return to the Clippers' lineup after missing 10 games with a sprained right ankle. LA went 2-8 while Leonard was out.\n\n\r\n              Los Angeles trimmed a 13-point deficit to one in the third when Mitchell went to work.\n\n\r\n              The six-time All-Star had consecutive 3-point plays, dropped a 3-pointer and had two assists in the final 3:06 as the Cavs closed the quarter with a 15-3 run to open a 92-79 lead.\n\n\r\n              Mitchell then made another 3-pointer and had two more assists in the opening minutes of the fourth as the Cavs pushed their lead to 18.\n\n\r\n              The Cavaliers were without several key players as starting center Jarrett Allen (finger) and guards Lonzo Ball (knee), Sam Merrill (hand) and Craig Porter Jr. (hamstring) sat with injuries.\n\n\r\n              Cleveland has played 10 different starting lineups while combating injuries.\n\n\r\n              Clippers guard Chris Paul picked up five assists in 17 minutes. Paul announced his retirement on Saturday via social media, and the 12-time All-Star received a warm ovation from Cleveland's crowd when he checked into the game.\n\n\r\n              Up next\r\n              Clippers: At Los Angeles Lakers on Tuesday night.\n\n\r\n              Cavaliers: At Toronto on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042682.2056
}