{
  "game_id": "0021700099",
  "espn_id": "400974850",
  "date": "Oct 30, 2017",
  "matchup": "TOR @ POR",
  "headline": "DeRozan has 25 and Toronto downs Portland 99-85",
  "body": "PORTLAND, Ore. -- DeMar DeRozan credited Toronto's second unit for Portland's ugly second quarter.\nThe Trail Blazers were held to just six total points -- Evan Turner's layup and four free throws -- in the period and Toronto went on to win 99-85 on Monday night.\n\"They did something big for us holding them to one field goal throughout the whole quarter,\" DeRozan said about the bench. \"It gave us a great opportunity to go out there and pull out this win.\"\nDeRozan had 25 points to lead the Raptors, who were up by as many as 26 points. Kyle Lowry added a season-high 19 points and added 10 rebounds.\n\"Man, they did a great job of cutting off everything,\" Lowry said about the second unit. \"It was such an ugly slugfest in the second quarter.\"\nThe win extended Toronto's winning streak over Portland to five straight games.\nDamian Lillard had a season-high 36 points for the Blazers, who got within 13 in the final quarter. CJ McCollum, who had scored 20 or more points in each of Portland's first six games this season, had 16.\nToronto was without center Serge Ibaka, who is averaging 15 points a game this season, because of swelling in his right knee. The knee started to bother him following a victory over the Lakers in Los Angeles on Friday. Jacob Poetl took his place in the starting lineup.\nThe Raptors also missed Jonas Valanciunas for a fourth straight game with a left ankle sprain.\nToronto's focused on defense throughout, coach Dwane Casey said.\n\"I mean, you're not going to stop a great player like Lillard or McCollum,\" Casey said. \"But our whole emphasis was to make them work for every inch of the court.\"\nDeRozan had 15 points in the first quarter and the teams were knotted at 29 going into the second. DeRozan led the Raptors with 24 points in the 101-92 victory over the Lakers.\nThe Blazers went cold in the second quarter. Really cold. They went 0-for-16 from the field until Turner's layup with 5 seconds left before the half. Portland's other four points in the quarter came from free throws and the Raptors led 54-35 at the break.\nThe Blazers' six total points were a franchise low for the second quarter.\n\"It wasn't like they were unstoppable,\" Lillard said. \"They were scoring and we weren't.\"\nGoing back into the first quarter, the Blazers missed 20 straight shots over the miserable stretch.\n\"Brutal,\" Coach Terry Stotts said about the stretch. \"It was tough. I felt bad for them.\"\nLillard hit a pair of consecutive 3-pointers and a layup in the third quarter, but the Blazers couldn't make up much ground. The Raptors led 81-61 going into the final period.\nPortland went on a 10-5 run to open the fourth and close the gap to 86-71 with 8:55 left. Lillard added a 16-footer to cut the margin to 13.\nPortland was coming off a 114-107 win at home over the Suns on Saturday.\nTIP INS\nRaptors: It was the fourth game of a season-long six game road trip for Toronto. ... The Raptors won both games against the Blazers last season.\nTrail Blazers: Portland's lowest point total for any quarter is five points. ... It was the last of a four-game home stand for the Blazers. ... Meyers Leonard is currently out because of right lateral ankle sprain. ... It was the 76th 30-point game of Lillard's career.\nNOGUERIA'S NIGHT: Lucas Nogueira scored a season-high 17 points for the Raptors, along with nine rebounds. He had five blocked shots\n\"He's engaged and he's into it and we know what he can do,\" Lowry said. \"He just has to do it consistently. That's the biggest thing I say to him every night, get out there and be a shot blocker and be dominate on the defensive end.\"\nQUOTABLE: \"The first quarter was really nice and the second quarter was really bad.\" --Stotts.\nUP NEXT\nToronto plays the Nuggets in Denver on Wednesday.\nThe Trail Blazers visit the Utah Jazz on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764992921.9712582
}