{
  "game_id": "0021600161",
  "espn_id": "400899611",
  "date": "Nov 16, 2016",
  "matchup": "DAL @ BOS",
  "headline": "Thomas has big 4th quarter to lift Celtics over Mavs 90-83",
  "body": "BOSTON --  The Celtics don't want to rely solely on Isaiah Thomas to win.\n\nBut on some nights, putting the ball in the All-Star guard's hands is simply the best option.\n\nThomas scored 22 of his 30 points in the fourth quarter in Boston's 90-83 victory over the Dallas Mavericks on Wednesday night.\n\nHe scored 20 of Boston's final 24 points to help the Celtics beat back a late Mavericks' surge.\n\nAvery Bradley added 18 points and 13 rebounds.\n\nAfter the Mavericks took a 70-66 lead, Thomas scored Boston's next 13 points to put the Celtics back in front 79-76. They never trailed again.\n\nAfter one of the baskets late in the run Thomas ran down the court and flashed two thumbs up.\n\n\"I guess I just like that quarter,\" Thomas said. \"Sometimes guys get a little tighter, and then the pressure gets a little tougher for them. I guess I like the pressure.\"\n\nHarrison Barnes led the Mavericks with 28 points. Wesley Matthews added 22.\n\nDallas, which was already missing several players because of injuries, lost two more. Starter Deron Williams exited in the second quarter with a left calf injury, and J.J. Barea was helped off the court in the fourth quarter after straining his left calf as well.\n\nCoach Rick Carlisle said it appears Barea will \"be out for a while\", but added that he didn't think it was real serious. He said it's his understanding that Williams just experienced some tightness.\n\nThe Celtics outrebounded Dallas 53-32, which coach Brad Stevens said is a welcomed sign for a team that struggled in that department early in the season.\n\n\"Maybe it's the law of averages, and some just bounced our way,\" Stevens said. \"But we're defending at a better rate than we were.\"\n\nTIP-INS\n\nMavericks: Have lost three straight. ... Had a season-low 31 points at the first half. ... Dirk Nowitzki missed his fifth straight game with a right Achilles strain.\n\nCeltics: Thomas has scored 20 or more points in each of the first 11 games of the season. ... Scored a season-low 90 points. ...Tied their season high with 19 turnovers. ... Boston's 10-point second quarter was its lowest scoring output in a second quarter this season. ... Al Horford remains in the NBA concussion protocol and sat out his eighth straight game. Jae Crowder missed his seventh consecutive game with a sprained left ankle.\n\nTEAM MEETING\n\nCeltics guard Marcus Smart said the team held a meeting after its blowout loss to the Wizards on Nov. 9 to help refocus its commitment on the defensive end.\n\n\"It was no coaches, just us,\" Smart said. \"We had to look ourselves in the mirror and come to the conclusion that it is on us and we're the ones playing and that we have to get it together.\"\n\nBradley said the conversation was frank and honest.\n\n\"Just that we need to hold each other accountable,\" he said. \"We weren't playing to our ability. We had two or three guys playing hard at the defensive end, but the other three guys weren't. And we needed everyone playing hard consistently as a team. Tonight I feel like was one our best defensive games.\"\n\nNO FREEBIES\n\nThere weren't many trips to the free throw line in the first half for either team. The Celtics were just 2 for 6 in the half, and the Mavericks missed their lone attempt in the first quarter. Neither team attempted a free throw in the second quarter.\n\nINJURY UPDATE\n\nStevens said Crowder would practice Friday, but that he does not expect him to play Saturday against Golden State. Stevens said his last report on Horford was that the big man had \"a great workout\" on Wednesday.\n\nCarlisle said Dirk Nowitzki is making progress as well.\n\n\"It feel likes he's getting close,\" he said.\n\nUP NEXT\n\nMavericks: Return home Friday to host the Grizzlies, before heading back on the road for trips to Orlando and San Antonio.\n\nCeltics: Host the Warriors Friday, and then begin a three-game trip with a stop in Detroit on Saturday.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764996156.480769
}