{
  "game_id": "0021800849",
  "espn_id": "401071522",
  "date": "Feb 12, 2019",
  "matchup": "PHI vs. BOS",
  "headline": "Hayward scores 26, Celtics beat 76ers again 112-109",
  "body": "PHILADELPHIA --  The Boston Celtics still own the Philadelphia 76ers no matter who is on the court.\n\nGordon Hayward scored 26 points, including a go-ahead 3-pointer with 1:50 remaining, and Boston beat Philadelphia 112-109 on Tuesday night. Al Horford had 23 and Jayson Tatum scored 20 and grabbed 10 rebounds to help the Celtics continued their dominance over the Sixers.\n\nPlaying without All-Star point guard Kyrie Irving, who sprained his right knee Saturday night, the Celtics beat the Sixers for the third straight meeting this season after defeating them in five games in the Eastern Conference semifinals last season.\n\n\"Against a very quality opponent was big, especially on the road without Kyrie, it was huge,\" Hayward said.\n\nJoel Embiid had 23 points and 14 rebounds and Jimmy Butler scored 22 for Philadelphia.\n\nHayward's 3 from the corner put Boston up 105-103 and Marcus Smart added a free throw. The Sixers had a chance to tie when Jimmy Butler went to the line for three free throws but he missed two. After a turnover, Embiid lost the ball with under a minute left. Smart then blew past Ben Simmons for a dunk to extend the lead to 108-104 with 24 seconds left. Butler made a driving layup and a free throw to cut it to 108-107.\n\nAfter Horford sank two free throws, Tobias Harris missed a 3 and Embiid put it back in with only 2.4 seconds left. Butler couldn't get a desperation 3 off in time before the buzzer sounded as the Sixers dropped their first game in three since acquiring Harris in a flurry of moves last week.\n\n\"This is a new team,\" Simmons said. \"There are things we're going to work on, things we need to get better at, but it's a good test for us to see where we're at with this new team. But I'm excited with everyone we have and to see how far we can go.\"\n\nThe Celtics answered the call in their first game since Marcus Morris questioned the team's toughness after they surrendered leads of 28 points to the Clippers and 18 points to the Lakers on their home court.\n\n\"Good teams have clunkers, but good teams respond to those with the right effort and approach,\" Celtics coach Brad Stevens said.\n\nBoth teams are tied for the fourth spot in the East with a 36-21 record.\n\n\"We understood Philly's been playing at a high level,\" Horford said. \"We had disappointing losses at home. I felt like our backs were against the wall, so we all needed to come out and set the tone and we did that.\"\n\nAfter trailing for nearly the entire first half, the Sixers opened the third quarter on a 9-0 run to take a 55-52 lead. JJ Redick's 3-pointer capped the run. Minutes later, Simmons thrilled the crowd by driving around Tatum and throwing down a thunderous right-handed jam. But Tatum answered at the opposite end with a spin move around Embiid and dunk over Simmons.\n\nNO TAMPERING\n\nThe NBA said Los Angeles Lakers president Magic Johnson did not break any league tampering rules when he spoke about possibly working with Simmons in the offseason. The investigation was initiated after it was revealed Sunday that Simmons wanted to meet with Johnson to talk about the art of being an elite point guard. Johnson complimented Simmons publicly on Sunday. Sixers GM Elton Brand said Monday he already told Simmons he wouldn't allow it.\n\nTIP-INS\n\nCeltics: Improved to 14-13 on the road. ... Horford was 6 for 23 from beyond the arc over his last 10 games before making 3 of 5. ... Morris had 17 points.\n\n76ers: Fell to 23-7 at home. ... Embiid was 9 of 22, including 2 of 8 from 3-point range. ... Harris was 0 for 6 beyond the arc.\n\nUP NEXT\n\nCeltics: Host the Detroit Pistons on Wednesday night.\n\n76ers: Visit the New York Knicks on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994015.544738
}