{
  "game_id": "0022000612",
  "espn_id": "401307397",
  "date": "Mar 16, 2021",
  "matchup": "CHI vs. OKC",
  "headline": "LaVine scores 40 as Bulls beat Thunder 123-102",
  "body": "CHICAGO -- — Zach LaVine scored 40 points on 15-for-20 shooting, and the Chicago Bulls beat the Oklahoma City Thunder 123-102 on Tuesday night for their second straight win.\n\n\r\n                    LaVine led the way as Chicago shot 51% (48 for 94) from the field. The All-Star guard was 7 for 12 from 3-point range in 31 minutes of playing time.\n\n\r\n                    “He was unbelievably efficient on offense,\" coach Billy Donovan said. “He was spectacular.”\n\n\r\n                    LaVine's shots were dropping, one after another, especially when the Bulls needed a lift.\n\n\r\n                    “I've always been pretty efficient,” LaVine said. “I think I just got more consistent with shots and started to take some better ones.\n\n\r\n                    “Everything I shoot, I think I should make it.”\n\n\r\n                    Lauri Markkanen had 22 points for the Bulls, and Thaddeus Young added 17 points and nine rebounds. Tomas Satoransky finished with 13 points and seven assists.\n\n\r\n                    Shai Gilgeous-Alexander scored 21 points for Oklahoma City, which had won three of four. Moses Brown had 20 points and 16 rebounds, and Kenrich Williams scored 14.\n\n\r\n                    “I think tonight we just couldn't find a way to compete the way we need to for 48 minutes,” Thunder coach Mark Daigneault said.\n\n\r\n                    LaVine made his first five shots — including four 3-pointers — as Chicago raced to a 42-28 lead after one quarter.\n\n\r\n                    But the Thunder stormed back with a 15-0 run and took a 50-49 lead with 6:32 left in the half on Williams' 3-pointer from the corner.\n\n\r\n                    LaVine returned to the lineup and Chicago got back on track offensively, outscoring Oklahoma City 21-14 heading into the intermission.\n\n\r\n                    “I just want to come out and give us a good push,” LaVine said. “I wanted to help put the game away.”\n\n\r\n                    LaVine stayed hot early in the third quarter, sinking his first three shots on layups. Chicago outscored Oklahoma City 31-16 in the third to up its lead to 102-79.\n\n\r\n                    “(LaVine) requires a five-man defense and that showed us an area where we need to improve,” Daigneault said. \"A player like LaVine is going to burn you for every little mistake. \n\n\r\n                    “He burned us tonight and there's a lot we can learn from that.”\n\n\r\n                    KIDS COOLED OFF\n\n\r\n                    The game featured two of the youngest players in the NBA. Oklahoma City’s Aleksaj Pokusevski (19 years, 3 months) and Chicago’s Patrick Williams (19 years, 7 months) both started. \n\n\r\n                    Pokusevski and Williams both had 23 points in their previous game. But they struggled in this one. Pokusevski finished with four points on 2-for-9 shooting. Williams had just two points, going 1 for 9 from the floor.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Rookie Theo Maledon, also 19, returned after sitting out Sunday with a right ankle injury. Lu Dort (toe) and Al Horford (rest) were unavailable. Horford was rested for consecutive games for this first time this season. ... Brown and Ty Jerome were back in the starting lineup after making their first career NBA starts on Sunday against Memphis. ... Daigneault said the Thunder would take its time to “onboard” G/F Svi Mykhailiuk, who was acquired in a trade on Saturday.\n\n\r\n                    Bulls: Donovan said Garrett Temple (left ankle sprain) is out of his walking boot and making progress, but he had no timetable for the forward’s return. ... In their previous meeting with the Thunder this season, in Oklahoma City on Jan 15, the Bulls blew a 22-point lead and lost 127-125 in OT.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: At Atlanta on Thursday.\n\n\r\n                    Bulls: Host San Antonio on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764997589.298829
}