{
  "game_id": "0022300968",
  "espn_id": "401585596",
  "date": "Mar 16, 2024",
  "matchup": "BKN @ IND",
  "headline": "Pacers roll after halftime, beat the Nets 121-100",
  "body": "INDIANAPOLIS -- — Pascal Siakam had 28 points and 11 rebounds, Aaron Nesmith scored 16 points and the Indiana Pacers beat the Brooklyn Nets 121-100 on Saturday night.\n\n\r\n              All-Star Tyrese Haliburton finished with 14 points and seven rebounds for the Pacers, overcoming a 6-for-18 shooting night, and his backup T.J. McConnell finished with 13 points. McConnell has scored in double figures 10 times in his past 17 games.\n\n\r\n              “Pascal was great,” Indiana coach Rick Carlisle said of Siakam, who made 11 of 22 shots, all six free throws and added three steals. “He was great on offense. Defensively, he had his best game.”\n\n\r\n              Cam Thomas had 22 points and eight rebounds for the Nets, who were outscored 82-42 in the paint in the teams’ first meeting of the season. Brooklyn shot 43% from the field, committed 21 turnovers and fell to 1-4 on its six-game road trip.\n\n\r\n              “Get 82 points in the paint, 17 offensive rebounds and 21 turnovers, that’s tough to beat a team like that,” Brooklyn interim coach Kevin Ollie said. “We can’t have 21 turnovers. Got to protect your paint. We got to keep people in front of us.”\n\n\r\n              Indiana trailed 30-25 at the end of the first quarter and led just 59-57 at halftime before blowing the game open in the second half, leading by 27 in the fourth quarter. The victory was the Pacers’ seventh of the season by a margin of at least 20 points.\n\n\r\n              “Just get to the paint and great things will happen,” Nesmith said. “When you get to the paint, you tend to score more. We put emphasis on that.”\n\n\r\n              Cam Johnson scored 14 points for the Nets, Dennis Schroder and 13 points and five assists, and Dorian Finney-Smith finished with 12 points. Brooklyn, in 11th place in the Eastern Conference standings, had gone 6-1 in its previous seven visits to Indiana.\n\n\r\n              “We got to do all the tough things,” Ollie said. “Did it first half. Basketball was beautiful. Second half we went into (isolation) basketball. We’re not good enough to do that.”\n\n\r\n              The sixth-place Pacers shot 48% from the floor and carried an 86-78 lead into the fourth quarter despite making only 4 of 26 3-point attempts to that point. Indiana won the rebounding battle 59-48 and prevailed for the third time in its past four games.\n\n\r\n              “I’m all about the team,” Siakam said. “I try my best to bring that energy every time. Physical (defense), continue to challenge, multiple efforts, guard, I thought we did that. I want to make sure I’m all about winning. That’s my focus.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: Face the San Antonio Spurs on Sunday night in Austin, Texas.\n\n\r\n              Pacers: Host the Cleveland Cavaliers on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996326.6681669
}