{
  "game_id": "0022401194",
  "espn_id": "401705760",
  "date": "Apr 13, 2025",
  "matchup": "DAL @ MEM",
  "headline": "Lamar Stevens scores career-high 31 points as Grizzlies coast to a 132-97 win over Mavericks",
  "body": "MEMPHIS, Tenn. -- — Lamar Stevens scored a career-high 31 points, Marvin Bagley III had 25 points and 11 rebounds and the Memphis Grizzlies defeated the Dallas Mavericks 132-97 on Sunday in the teams' regular-season finale.\n\n\r\n              Both the Grizzles and Mavericks will play in the Western Conference play-in tournament. So, with both teams’ positions pretty well set — Memphis at No. 8 and Dallas at No. 10 — many of the starters sat out with soreness, injury recovery or rest.\n\n\r\n              That left Sunday’s game as a contest between bench players.\n\n\r\n              Cam Spencer scored 23 points and Jay Huff had 22 for Memphis.\n\n\r\n              Daniel Gafford led the Mavericks with 20 points and seven rebounds. Jaden Hardy scored 17 points and Max Christie finished with 14 points.\n\n\r\n              Memphis increased the lead to 23 points in the second quarter, but Dallas scored the final 10 points of the half to cut the Mavericks' deficit to 67-54. Gafford scored 18 points, missing on one of his eight shots.\n\n\r\n              Takeaways\r\n              Mavericks: Dallas struggled down the stretch, losing four of its last five.\n\n\r\n              Grizzlies: With major players such as Ja Morant, Jaren Jackson Jr. and Desmond Bane taking the game off, Memphis gave its reserves extended playing time.\n\n\r\n              Key moment\r\n              Diminutive Memphis backup guard Yuki Kawamura had a pair of spectacular assists in the second quarter. He grabbed a turnover by Dallas and flipped it overhead to a streaking Bagley for a dunk. A couple of minutes later, with Memphis on the break, he dropped a bounce pass between his legs to a trailing Spencer for a 3-pointer.\n\n\r\n              Key stat\r\n              Memphis outscored Dallas 65-43 after halftime to break the game open.\n\n\r\n              Up next\r\n              Dallas is the No. 10 seed and will play at No. 9 Sacramento on Wednesday night. The winner will then have to beat the loser of the Golden State-Memphis game to face top-seeded Oklahoma City in the first round. The No. 8 Grizzlies will be on the road Tuesday night to face the No. 7 Warriors.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997124.016094
}