{
  "game_id": "0021500059",
  "espn_id": "400827946",
  "date": "Nov 03, 2015",
  "matchup": "LAL vs. DEN",
  "headline": "Faried leads Nuggets' surge past winless Lakers, 120-109",
  "body": "LOS ANGELES -- When the Denver Nuggets embrace the up-tempo, hard-working style of play in coach Mike Malone's highest aspirations, they're capable of beating teams a whole lot better than the Los Angeles Lakers.\nKenneth Faried had 28 points and 15 rebounds, and Danilo Gallinari got 14 of his 21 points in the second half of the Nuggets' 120-109 victory over the winless Lakers on Tuesday night.\nJ.J. Hickson scored 17 points in his first significant playing time of the season for the Nuggets, who earned their fifth consecutive victory over the Lakers at Staples Center since November 2012. Although Denver isn't considered a favorite to land a playoff spot, the Nuggets' second-half onslaught against the Lakers demonstrated their talent.\nFaried dominated the low post, went 10 for 13 and hit all eight of his free throws in Denver's 10th win over Los Angeles in the clubs' last 11 meetings.\n\"Coach said we needed to get back to playing Nuggets basketball -- running, attacking the paint, three or four passes,\" Faried said. \"I was able to exploit that. I was able to live in the paint, and then that opened things up for my guards. And then we played defense.\"\n\nDenver took control midway through the third quarter, scoring 15 points in 2:45 while hitting 11 of its last 15 shots in the period to turn a six-point deficit into a 10-point lead. Emmanuel Mudiay missed his first eight shots before hitting a 3-pointer while getting fouled by fellow teenage rookie point guard D'Angelo Russell in the third, leading to a catalyzing four-point play.\nJordan Clarkson matched his career high with 30 points, and Lou Williams added 14 of his 24 points in the fourth quarter for the Lakers, who started 0-4 for the second straight year.\nKobe Bryant had 11 points on 4-of-11 shooting, doing little to end his slump.\nBRYANT'S MIND\nBryant bemoaned his play two days ago in a loss to Dallas, and the 20-year veteran took Monday off practice to clear his mind. Kobe didn't seem as bothered about his offensive play despite three airballs. He's looking forward to the Lakers' upcoming road trip as a chance to build chemistry while working on team defense.\n\"The pressure is on everyone to try and fix things, so you have to communicate and teach and be better next time,\" Bryant said. \"You can't get emotional about it. You've got to get technical about it.\"\nYOUNGSTERS MEET\nThe game featured the first meeting between Russell and Mudiay, respectively the second and seventh picks in last summer's draft. Russell had seven points and six assists before sitting on the Lakers' bench down the stretch, while Mudiay made a late surge to finish with 12 points and 10 assists.\n\"This was great for Emmanuel to go in there in a close game and have to make some plays,\" Malone said.\nRussell didn't get that opportunity, and the rookie said \"I have no idea\" how to get the same opportunities from coach Byron Scott, who apparently thought a more veteran lineup gave the Lakers a better chance to win.\n\"It's something I've got to deal with,\" Russell said.\nRANDLE RUMBLE\nJulius Randle scored 16 points in his third double-digit scoring game of the season, and the rough-and-tumble youngster got the veteran Faried's attention. \"He's got a lot of growing up to do,\" Faried said with a chuckle. \"He's young, but he's good. He's talented. He's just got to figure it out. This is really his first real season. Hopefully he'll get it together for himself.\"\nTIP-INS\nNuggets: C Joffrey Lauvergne and F Nikola Jokic both sat out to rest back injuries. ... Wilson Chandler still hasn't played this season due to a hip injury.\nLakers: Randle played the second half in safety goggles after getting poked in the eye late in the first half. ... Big man Tarik Black made his season debut, getting seven points and eight rebounds. ... Brandon Bass played despite a corneal abrasion.\nUP NEXT\nNuggets: Host Utah on Thursday.\nLakers: At Brooklyn on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994327.146281
}