{
  "game_id": "0022000061",
  "espn_id": "401267221",
  "date": "Dec 30, 2020",
  "matchup": "LAC vs. POR",
  "headline": "Leonard returns from 2-game absence; Clippers beat Blazers",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 28 points in his return from a two-game absence, Paul George added 23 points, and the Los Angeles Clippers breezed past the Portland Trail Blazers 128-105 on Wednesday night.\n\n\r\n                    It was the Clippers’ second straight blowout win to close out the year. They beat Minnesota by 23 points a night earlier after bouncing back from an ugly 51-point defeat against Dallas last weekend.\n\n\r\n                    Leonard wore a clear plastic mask held in place by two white straps around his head to protect his mouth, where he had eight stitches after getting elbowed by teammate Serge Ibaka a week ago. He started slowly, scoring 12 points in the first half, when the Clippers shot 58% from the floor. \n\n\r\n                    Leonard and George came out firing to start the second half. They combined to score the Clippers' first nine points, extending their lead to 85-57. \n\n\r\n                    George had 10 rebounds, while he and Leonard had seven assists each. Six Clippers scored in double figures. Lou Williams added 15 points off the bench.\n\n\r\n                    “Guys are playing hard, we’re locked in,” Williams said. “We know we have a lot of guys who are capable, we’re playing with trust.”\n\n\r\n                    CJ McCollum scored 25 points, making seven 3-pointers, to lead the Blazers, whose two-game winning streak ended. Damian Lillard made 14 of 15 free throws to finish with 20 points after missing 11 of 14 shots from the field. He was 0 of 8 from 3-point range.\n\n\r\n                    “They just had a 50-point loss, so they’ve been locked in,” Lillard said of the Clippers. “We missed open shots, we allowed them to get clean looks because we were late and not as active on the defensive end.”\n\n\r\n                    The Blazers led just three times and never by more than three points. They lived at the line, making 29 of 34 free throws. Carmelo Anthony made 9 of 10 foul shots and scored 15 points.\n\n\r\n                    Portland never got a big run going in the second half, when it trailed by 30. \n\n\r\n                    “When you get down in the league, it’s hard to come back, especially against talented teams,” McCollum said.\n\n\r\n                    The Clippers led by 21 in the second quarter. Leonard scored six points in an 18-7 run, capped by his three-point play that made it 67-46. Lillard and McCollum combined to score the Blazers' final 15 points to pull them to 76-57 at halftime. \n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: G Gary Trent Jr. sat out with a right calf strain after scoring 28 points off the bench against the Lakers on Sunday. ... The Blazers have been in town since the weekend and used the Clippers' facility to practice on Tuesday. With the tight restrictions in COVID-19 ravaged Los Angeles County, the team can't meet or eat as a group at its hotel. “I like to go for my walks,” coach Terry Stotts said. “I like getting out of the hotel.”\n\n\r\n                    Clippers: They've had at least 30 assists in the last two games for the first time since Dec. 1-6, 2014. ... The team is 4-1 to start the season for the first time since 2017-18. ... F Marcus Morris Sr. has yet to play this season because of knee soreness. \n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Visit Golden State on Friday in the first of back-to-back games with the Warriors.\n\n\r\n                    Clippers: Visit Utah on Friday to begin the new year.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997707.576991
}