{
  "game_id": "0021600961",
  "espn_id": "400900356",
  "date": "Mar 09, 2017",
  "matchup": "MEM vs. LAC",
  "headline": "Austin Rivers has 20 points, Clippers top Grizzlies 114-98",
  "body": "MEMPHIS, Tenn. --  The Los Angeles Clippers didn't really prepare as usual for their game with the Memphis Grizzlies on Thursday night. Instead, a frank discussion replaced the normal game-day walkthrough and video session.\n\nThe result was Los Angeles playing one of its better games recently, routing the Grizzlies 114-98 and also providing a three-game buffer over Memphis in the Western Conference playoff race.\n\n\"We know we haven't played the way we should,\" said Clippers forward Blake Griffin, who had 14 points, 12 rebounds and eight assists. \"Sometimes, you've got to scrap the film, scrap the walk-through and just talk and let guys get some frustration out.\"\n\nAustin Rivers scored 20 points, and Chris Paul added 19 points and seven assists to lead Los Angeles.  J.J. Redick scored 15 points, while Jamal Crawford matched Griffin with 14\n\nBoth teams entered the night not performing well recently, and Clippers coach Doc Rivers said it was time to take a different approach when they gathered for Thursday's video session. Instead of reviewing plays, he started talking. Then players started talking\n\n\"It was a long meeting, but it was a truthful meeting,\" Rivers said. \"We just talked. There wasn't any screaming. It was just a good team discussion about what we want to be and what we need to do.\"\n\nFor Memphis, the woes continued. The Grizzlies are 14-15 since Jan. 1, and coach David Fizdale is grasping for answers with lineup changes and other adjustments. The results haven't been positive. Not only has Memphis lost four straight, including Monday night over the lowly-Brooklyn Nets, but the last three setbacks were all by double digits.\n\nMarc Gasol led Memphis with 20 points, and Zach Randolph had 18 points and 11 rebounds, but the Grizzlies defense, historically one of the team's identities, allowed the Clippers to shoot 51 percent. Los Angeles led 54-45 at the break, then outscored Memphis 31-20 in the third to build a lead that eventually would stretch to 22 in the final frame.\n\nLos Angeles rebounded from a loss at Minnesota on Wednesday night for its third victory in four games. And, while the Clippers moved three games ahead of Memphis for the fifth spot, the Grizzlies fell into a tie with Oklahoma City for the sixth seed.\n\nAnd guard Mike Conley acknowledged it is late in the season for the team to be teetering.\n\n\"We need to respond with desperation,\" said Conley, who had 13 points, but was 3 of 14 from the field and missed all four 3-point attempts. \"It's time. We can't talk about it, and continue to say we're going to do the right things. We've got to go out there and do it.\"\n\nTIP-INS\n\nClippers: Los Angeles was playing its third game in four nights and sixth game since March 1. ... DeAndre Jordan was fouled on a 3-point in the second quarter and made two of three free throws. ... Griffin's 13 rebounds marked on the second time in the last 15 games Jordan (12) hasn't led the team in rebounds. ... Rivers reached the 20-point mark for the 11th time this season, more than the first four seasons of his career combined (nine times.\n\nGrizzlies: F Chandler Parsons did not play because of scheduled rest, Parsons, who is still dealing with knee soreness, had played in Memphis' previous three games over four days. ... Memphis has allowed at least 100 points in seven of the last nine games. ... Randolph recorded his 17th double-double of the season off the bench, a league best for a reserve. ...The four-game losing streak is Memphis' longest of the season.\n\nONLY WAY IS UP\n\nLos Angeles outrebounded Memphis 47-34, a turnaround from recent performances. Rivers noted before the game that his team ranked 29th out of 30 teams in rebounding since the All-Star break. \"It's tough to go lower,\" Rivers said. \"We can. We're working on it, but we have to rebound better as a group.\"\n\nUP NEXT\n\nClippers: Face the Philadelphia 76ers on Saturday.\n\nGrizzlies: Continue their four-game homestand Saturday against the Atlanta Hawks.",
  "source": "espn_api",
  "crawled_at": 1764995573.15115
}