{
  "game_id": "0021800743",
  "espn_id": "401071416",
  "date": "Jan 27, 2019",
  "matchup": "LAL vs. PHX",
  "headline": "Zubac, Caldwell-Pope lead short-handed Lakers past Suns",
  "body": "LOS ANGELES --  Los Angeles Lakers coach Luke Walton gave his short-handed team one important key going into Sunday's game against Phoenix: Attack the paint.\n\nThe Lakers were able to do that, and in the process snapped a three-game losing streak with a 116-102 victory over the Suns.\n\nIvica Zubac and Kentavious Caldwell-Pope each scored 24 points and Brandon Ingram added 22 as Los Angeles won for the first time with LeBron James and Lonzo Ball both out of the lineup. Walton was also missing Kyle Kuzma (hip) and Tyson Chandler (rest). Still, the Lakers dominated the inside against a small Phoenix lineup as it had a 70-46 advantage in points in the paint.\n\n\"I was boxing out my guy and my teammates were also boxing out their guys. Their guards weren't able to fly in and get the boards,\" said Zubac, who also had a career-high 16 rebounds.\n\nThe Lakers' domination in the paint also opened up the perimeter. They were 10 of 23 on 3-pointers, including an 8-of-15 clip in the second half.\n\n\"When you're getting downhill and putting pressure on the rim like that, when you do get 3s, they have a tendency to go in more often,\" Walton said. \"We needed a win and we got a real nice game.\"\n\nDevin Booker scored 21 points, Kelly Oubre Jr. added 17 and Mikal Bridges 16 for Phoenix, which has dropped eight straight for its second-longest losing streak of the season. The Suns dropped 10 in a row from Nov. 25 to Dec. 11.\n\nPhoenix's Deandre Ayton, the first pick in the NBA draft, missed his fifth straight game with a sprained left ankle. Rookie guard De'Anthony Melton missed his second game because of a sprained right ankle. While coach Igor Kokoskov is hopeful of having Ayton back this week, he said Melton will miss a significant amount of time.\n\nRichaun Holmes returned after missing the past four games with a sprained right foot and scored 12 points with 10 rebounds.\n\n\"They were attacking our bodies, they were attacking the paint and the rim. We were passive. We were just defending ourselves,\" Kokoskov said. \"We have to guard the yard. There was no secret.\"\n\nThe Lakers jumped out to a 12-2 lead less than five minutes into the game as the Suns missed eight of their first nine shots from the field. Phoenix found its shooting stroke, though, and went on a 14-4 run, which included three straight 3-pointers, to tie it at 16. It would be tied three more times in the first quarter before the Lakers went on a 6-2 run the final 1:06 to lead 31-27 at the end of the first.\n\nLos Angeles began to steadily pull away in the second quarter and saw its lead grow to 63-46 with 1:15 remaining on Rajon Rondo's driving layup. The Lakers were 16 of 26 from the field in the quarter as they led 65-53 at halftime.\n\nPhoenix slowly cut into the Lakers' lead in the second half and got within six at 90-84 with 11:25 remaining on a three-point play by Holmes. But the Lakers put it out of reach again with a 14-4 run, which included 11 points by Lance Stephenson.\n\nTIP-INS\n\nSuns: Emanuel Terry, who was signed to a 10-day contract Sunday, made his NBA debut during the second quarter and finished with five points. ... Jamal Crawford appeared in his 1,304th game and moved past Elvin Hayes for 20th in NBA history in games played.\n\nLakers: Los Angeles is 6-10 since James was injured in a Dec. 25 game at Golden State. ... Stephenson finished with 17 points and is averaging 11.5 points in the past four games. ... Rajon Rondo had 11 assists and has 24 in the two games since he returned from a finger injury.\n\nUP NEXT\n\nSuns: Travel to the San Antonio Spurs on Tuesday night.\n\nLakers: Host the Philadelphia 76ers on Tuesday night.\n\n---\n\nFollow Joe Reedy at www.twitter.com/joereedy\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994330.918603
}