{
  "game_id": "0022300290",
  "espn_id": "401584918",
  "date": "Dec 02, 2023",
  "matchup": "DEN @ SAC",
  "headline": "Kings overcome Jokic's 8th triple-double of the season, beat Nuggets 123-117",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox had 26 points and a career-high 16 assists, Malik Monk made a clutch 3-pointer late in the fourth quarter and the Sacramento Kings beat the Denver Nuggets 123-117 on Saturday night to spoil Nikola Jokic’s NBA-leading eighth triple-double.\n\n\r\n              The Kings led comfortably most of the might before Denver made its best run of the night to get to 112-110 with four minutes left on Jokic’s only 3-pointer of the game.\n\n\r\n              Fox then made a contested jumper in the key, before Monk’s corner 3-pointer with 1:11 helped seal it as chants of “Light the beam! Light the beam” broke out inside Golden 1 Center.\n\n\r\n              “Fantastic, fantastic night from our best player when we needed it the most,” Kings coach Mike Brown said about Fox. “He has to step up in games like this for us to win.”\n\n\r\n              Jokic finished with 36 points, 14 assists and 13 rebounds, the 114th career triple-double for Denver’s big man. The rest of the NBA had eight triple-doubles combined going into the night.\n\n\r\n              “You’re never going to stop (Jokic) with just one guy. A lot of times, even with the whole team, you probably won’t stop him,” Fox said. “You just want to make sure the other guys don’t really get it going. When they do, it’s pretty much pick your poison with that team.”\n\n\r\n              Monk scored 26 points. Domantas Sabonis added 17 points, 15 rebounds and seven assists.\n\n\r\n              Reggie Jackson scored 20 points for the Nuggets, who looked much crisper on offense with Aaron Gordon back in the lineup after missing four games with a right heel sprain. Gordon had 17 points and seven rebounds.\n\n\r\n              It wasn’t enough as the Kings ended the Nuggets’ hopes of winning a third consecutive road game for the first time since the playoffs last season.\n\n\r\n              “I think our fifth game in seven nights had a lot to do with it,” Nuggets coach Mike Malone said. “We lost the game in the second quarter. That’s where the game got away.”\n\n\r\n              Jokic gave the Nuggets an early boost with 16 points in the first quarter as Denver led 30-25. \n\n\r\n              When Jokic went to the bench in the second quarter, the Kings went on a 17-4 run punctuated by Monk’s drive and pass to JaVale McGee for an easy dunk.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Los Angeles Clippers on Wednesday night.\n\n\r\n              Kings: Host New Orleans on Monday night in the NBA In-Season Tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996767.786442
}