{
  "game_id": "0021601069",
  "espn_id": "400900464",
  "date": "Mar 23, 2017",
  "matchup": "DAL vs. LAC",
  "headline": "Barnes' late basket, steal put Mavs past Clippers, 97-95",
  "body": "DALLAS --  Harrison Barnes thrived in a new position on Thursday night, and so did the Mavericks.\n\nBarnes made the go-ahead basket, then stole the ball from Blake Griffin with 3.9 seconds left as Dallas beat the Los Angeles Clippers 97-95.\n\nMavericks coach Rick Carlisle started a big lineup, with Barnes moving from power forward to small forward.\n\n\"I have a little bit more energy from not banging with as many bigs,\" Barnes said.\n\nBarnes made a 14-foot jumper with 1:06 remaining for the game's 11th lead change, making it 96-95. After he stripped Griffin, Wesley Matthews made a free throw with 0.9 seconds to play before J.J. Redick missed a 3-point attempt that would have won it at the buzzer. His shot bounced off the far side of the rim.\n\n\"We had a great shot on the last play,\" Clippers coach Doc Rivers said. \"That was great execution, and it was a 3, would have been a game-winner. Make, miss, we will live with that.\"\n\nGriffin scored 21 points, including nine in a row in the fourth quarter, but he missed his last three shots and turned the ball over four times in the game.\n\n\"I got to take care of the ball on the last play of the game,\" Griffin said, \"if you trust me with the last play of the game.\"\n\nDallas expected Griffin to have the ball.\n\n\"I have to give credit to our coaching staff,\" Barnes said. \"They scouted that play well before the game. We knew it was coming to Blake. I just tried to play good defense, and I was in the right spot and the right time.\"\n\nThe Clippers had their three-game winning streak snapped. Dallas, battling from behind for a playoff berth, had lost four of six.\n\n\"I don't care about the race,\" Rivers said. \"I care about how we play.\"\n\nSeth Curry led Dallas with 23 points. Barnes finished with 21 and Dirk Nowitzki had 14.\n\nThe new lineup had Nerlens Noel starting at center and point guard Yogi Ferrell on the bench.\n\nCurry started at point guard and had four assists.\n\n\"We're going to give this a look,\" Carlisle said. \"It may be the rest of the year, it may not.\"\n\nNoel finished with 12 rebounds, two blocked shots and two steals, including one in the final minute.\n\nDeAndre Jordan had 14 points and 18 rebounds for the Clippers. Chris Paul scored 15 points and Austin Rivers had 13.\n\nThe Mavericks led by as many as 12 points in the second quarter. But after trailing 44-32, Los Angeles finished the first half on a 22-4 run for a 54-48 halftime lead.\n\nPaul had 13 points in the first half, and Jordan already had a double-double with 10 points and 12 rebounds. Nowitzki and Curry each had 10 points for the Mavericks.\n\nDallas started the third quarter with a 13-2 run to regain the lead at 61-56. The Mavericks took a 79-77 lead into the fourth quarter.\n\nTIP-INS\n\nClippers: Redick's four-point play in the second quarter was the 31st of his career. ... The Clippers outrebounded Dallas 25-15 in the first half, but only 20-19 in the second.\n\nMavericks: Barnes has scored 20-plus points 35 times this season. He totaled 19 games of 20-plus in his first four NBA seasons with Golden State. ... Dallas scored 21 points off 17 turnovers, nine in the second half. The Mavericks committed only nine turnovers for eight points.\n\nTHE LINEUP\n\nCarlisle seemed pleased with the lineup change.\n\n\"We got to look at Curry at point with a really conventional team out there. We got a look at Noel with Dirk and Barnes. We got to see how things would shake out with Barnes at 3.\"\n\nTHE MIGHTY FALL\n\nDallas' J.J. Barea -- listed at 6 feet, 185 pounds -- was ejected with 5:29 to play in the third quarter after pushing the 6-10, 251-pound Griffin to the floor.\n\nCrew chief Bill Spooner explained the call.\n\n\"The contact, in our judgment, was deemed unnecessary and excessive. The contact was to the shoulders and above to the throat. That is deemed as a flagrant penalty two.\"\n\nUP NEXT\n\nClippers: Begin a three-game homestand on Saturday afternoon against Utah.\n\nMavericks: Play the third game of a four-game homestand vs. Toronto on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996102.451238
}