{
  "game_id": "0021500355",
  "espn_id": "400828242",
  "date": "Dec 13, 2015",
  "matchup": "TOR vs. PHI",
  "headline": "DeRozan's 25 points lift Raptors over 76ers 96-76",
  "body": "TORONTO --  Luis Scola's hot start gave the Toronto Raptors just the shot in the arm they needed to pick up their fourth straight win.\n\nThe Argentinian had 14 of his season high-matching 22 points in the first quarter to help Toronto overcome a slow start and beat the Philadelphia 76ers 96-76 Sunday night.\n\nScola was 6-of-8 shooting, including a pair of 3s, and five rebounds in the first quarter while Toronto (16-9) overcame an eight-point deficit by going on a 24-8 run to end the opening quarter.\n\n\"Starting games well is something that has helped me a lot during my career,\" Scola said. \"It's something I've done well a lot of times.\n\n\"The team might benefit from it since I'm starting here and there's a chance for me to do that.\"\n\nWith the win, Toronto closed its homestand at 4-2. Philadelphia has lost six straight and fell to 1-24.\n\nDeMar DeRozan led Toronto with 25 points and eight rebounds. Kyle Lowry added 16 points and five rebounds while Bismack Biyombo had a team-high rebounds with his six points.\n\n\"He can score in bunches quick and tonight he did,\" DeRozan said of Scola. \"It's not his first time doing it and we try to milk him as much as possible when he gets it going like that.\"\n\nDeRozan came into the night averaging 21.7 points per game, and this was his third straight outing with at least 20 points.\n\nJahlil Okafor led Philadelphia with 23 points and 14 rebounds. Robert Covington added 15 points and nine rebounds.\n\nThe 76ers also lost Nerlens Noel to injury. The center was being evaluated at a Toronto hospital for a \"corneal abrasion\" before determining if he could fly with the team to Chicago.\n\nAfter taking a lead in the first quarter, Toronto never trailed. The Raptors led by 20 points late in the third quarter but the 76ers battled back.\n\nOkafor's bucket with 7:16 to go in the fourth cut the Raptors' lead to 77-71.\n\nBut the Raptors scored five straight points to widen their advantage to 11 and were never threatened again.\n\n\"It started with our defense,\" Okafor said of the run that got Philadelphia back into the game. \"We still played good defense, but we had trouble scoring near the end of the game.\"\n\nPhiladelphia coach Brett Brown said his team's 22 turnovers were \"far too many.\"\n\nThose mistakes led to 28 Toronto points. The Raptors' 10 turnovers led to nine 76ers points.\n\nTIP-INS\n\n76ers: The 76ers have lost all 14 road games this season. ... Philadelphia shot just 28 for 84, or 33 percent, from the field, including 5 for 23, or 22 percent, in the third.\n\nRaptors: Toronto has won 10 straight games against the 76ers, including both this season. ... The Raptors have held opponents under 100 points 17 times this season, second in the NBA to 20 by the San Antonio Spurs.\n\nNOEL TO HOSPITAL\n\nBrown said Noel's hospitalization was \"precautionary\" because the team was immediately flying to Chicago for a Monday night game and they wanted to make sure Noel could withstand the pressure of altitude in an airplane.\n\nAWESOME OKAFOR\n\nOkafor had his seventh double-double of the season and has now scored at least 20 points in three straight games. His 10 20-point games lead all NBA rookies. Brown said he played Okafor about 4 minutes more than he wanted to because \"we rode him for a while. His fitness is good. His mobility is good. I feel he's just getting more comfortable on a NBA court.\"\n\nO CANADA\n\n76ers guard Nik Stauskus, Raptors guard Cory Joseph and forward Anthony Bennett were teammates for Canada during the 2015 FIBA Americas, which was the qualifying tournament for next summer's Olympics in Rio de Janeiro.\n\nUNDEFEATED JERSEYS\n\nFor the second time, the Raptors wore their alternate black and gold jerseys, which are inspired by the OVO record label of Toronto rapper Drake. Toronto has won both games.\n\nQUOTABLE\n\n\"For whatever reason, it's one of those teams that he seems to get his groove going against.\" Toronto coach Dwane Casey on Scola.\n\nUP NEXT\n\nThe 76ers travel to Chicago to take on the Bulls on Monday night.\n\nThe Raptors begin a three-game trip Monday night against the Indiana Pacers.",
  "source": "espn_api",
  "crawled_at": 1764994751.7599769
}