{
  "game_id": "0022400909",
  "espn_id": "401705475",
  "date": "Mar 07, 2025",
  "matchup": "PHX @ DEN",
  "headline": "Nikola Jokic has 31 points, 22 assists and 21 rebounds in Nuggets' 149-141 OT win over Suns",
  "body": "DENVER -- — Nikola Jokic had 31 points, 21 rebounds and a career-high 22 assists and the Denver Nuggets outlasted the Phoenix Suns 149-141 in overtime Friday night after losing a 21-point lead.\n\n\r\n              Jokic became the first NBA player with a triple-double of at least 30 points, 20 rebounds and 20 assists. He tied his own team record with his 29th triple-double of the season, stretching his career total to 149.\n\n\r\n              Aaron Gordon made a career-high seven 3-pointers and had 27 points for Denver. Kevin Durant scored 29 points for Phoenix, hitting a 3-pointer at regulation buzzer to send it into overtime.\n\n\r\n              Jokic opened the extra period with a floater in the lane to spark a 7-0 run. The Nuggets led by 11 after Christian Braun's dunk and layup with 51 seconds left.\n\n\r\n              Three nights after overcoming a 23-point deficit to beat the Los Angeles Clippers 119-117 at home, the Suns trailed 85-64 in the third and cut it to heading into the fourth. They went ahead 122-120 in the final minute, but Denver answered and took a 125-122 lead on Braun's 3-pointer with 1.4 seconds left. \n\n\r\n              Takeaways\r\n              Suns: Devin Booker scored 16 of his 34 points in the fourth quarter, but was scoreless in overtime. Mason Plumlee had 18 points and 11 rebounds.\n\n\r\n              Nuggets: Denver leads the league in assists at 31 per game and matched that through three quarters and finished with 38.\n\n\r\n              Key moment\r\n              Denver outscored Phoenix 12-2 in the first 2:48 of overtime.\n\n\r\n              Key stat\r\n              The Nuggets, who entered the night 28th in the NBA in 3-pointers per game with 12, hit that mark on Gordon’s fifth of the night with 4:58 left in the second quarter. They finished 21 of 40.\n\n\r\n              Up next\r\n              The Suns are at Dallas on Sunday. The Nuggets play the first of two straight games at Oklahoma City on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_api",
  "crawled_at": 1764998234.1356611
}