{
  "game_id": "0021800366",
  "espn_id": "401071047",
  "date": "Dec 06, 2018",
  "matchup": "PHX @ POR",
  "headline": "Lillard and Layman lead Blazers to 108-86 win over the Suns",
  "body": "PORTLAND, Ore. --  Jake Layman hadn't played in Portland's last five games, so he wanted to make the best of it when he did get his chance.\n\nLayman came off the bench to score a career-high 24 points and the Trail Blazers snapped a three-game losing streak with a 108-86 rout of the Phoenix Suns on Thursday night.\n\n\"I just went out there and tried to be aggressive, play within our offense and not do anything too crazy,\" he said. \"I was getting open shots. Damian (Lillard) was finding me, other guys were finding me.\"\n\nLayman, who scored 15 points in just under six minutes in the first quarter, started earlier this season but had not played since Maurice Harkless returned from a knee injury to the starting lineup.\n\n\"He (Layman) came out of the starting lineup, had a good attitude, worked hard, knew he was going to get an opportunity at some point and remained positive while he wasn't playing. And he took advantage of the opportunity when he did come in,\" Blazers coach Terry Stotts said.\n\nLillard added 25 points and eight assists before sitting for the final quarter for Portland, which led by as many as 31 points. It was a welcome win for the Blazers, who had lost six of their last seven games.\n\nTroy Daniels had a season-high 15 points for the struggling Suns, who were held to nine points in the first quarter for the second consecutive game and have lost seven straight. Phoenix has just four victories this season, and just one on the road.\n\nThe Suns relied heavily on three rookies, Elie Okobo, Mikal Bridges and center Deandre Ayton while missing T.J. Warren for the fourth straight game because of right ankle soreness and Devin Booker for the second game because of a left hamstring strain. Booker is the team's top scorer, averaging 23.5 points, while Warren averages 17.7.\n\n\"It's a challenging time for us as a team,\" said Suns coach Igor Kokoskov. \"Obvioulsy, we're a young group ... When the challenging moments come, you have to show toughness.\"\n\nThe Blazers were without starting guard CJ McCollum because of a sprained left ankle. McCollum was hurt in the fourth quarter of Portland's 111-102 loss at Dallas on Tuesday. Seth Curry started in his place against the Suns.\n\nThe Blazers barely missed McCollum, jumping out to a 26-5 lead after Lillard's 3-pointer. Lillard and Layman both had 15 points in the period.\n\nPortland led by as many as 27 points in the first half and went into the break ahead 62-41. The gap remained at 20-plus points throughout the third quarter as the Blazers took an 87-61 lead into the final period.\n\nSuns guard Jamal Crawford showed frustration at the end of the third by slamming the ball down before heading to the bench.\n\nIt was the first of a back-to-back for the Suns, who host Miami on Friday.\n\n\"Losing is tough,\" Suns forward Trevor Ariza said. \"It's really tough but at this point all I can really do is continue to be positive and continue to encourage our younger players to try and be better at the start of games.\"\n\nTIP-INS\n\nSuns: It was the first of three meetings this season between the teams. ... The Suns trailed Sacramento 36-9 after one on Tuesday.\n\nTrail Blazers: It was the first of a short two-game homestand for Portland before a quick two-game road trip. ... It was Portland's eighth straight victory over the Suns. .... Portland got 57 points from its bench.\n\nAILING AYTON\n\nKokoskov said Ayton was under the weather, which is why Richaun Holmes started. But Ayton went on to play more than 27 minutes and finished with 11 points and eight rebounds.\n\n\"He had some stomach issues and didn't feel right and it was my decision not to play him at all but he insisted on playing the game and that was the adjustment we made,\" Kokoskov said. \"I was surprised he even played in this game.\"\n\nUP NEXT\n\nSuns: Host Miami on Friday.\n\nTrail Blazers: Host the Minnesota Timberwolves on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995094.777127
}