{
  "game_id": "0022300050",
  "espn_id": "401584138",
  "date": "Nov 24, 2023",
  "matchup": "MIN vs. SAC",
  "headline": "Kings stay unbeaten in NBA In-Season Tournament by topping Wolves 124-111 behind Fox's 36 points",
  "body": "MINNEAPOLIS -- — De'Aaron Fox had 36 points and 12 assists, and the Sacramento Kings prevented the Minnesota Timberwolves from clinching a spot in the quarterfinals of the NBA In-Season Tournament with a 124-111 victory Friday night. \n\n\r\n              The Kings improved to 3-0 in Group C in the Western Conference and can win it by beating Golden State in their final group game on Tuesday. The quarterfinals start Dec. 4.\n\n\r\n              “It’s always good to compete for something else,” said Harrison Barnes, who had 10 of his 18 points in the first quarter.\n\n\r\n              Malik Monk scored 17 points and Domantas Sabonis added 15 points and 11 rebounds for the Kings, who bounced back strong from two straight losses at New Orleans. They held Minnesota to 15 third-quarter points on 5-for-20 shooting.\n\n\r\n              “We know that we can score with the best of ’em. That’s not going to surprise anybody in this league, but we know that if we want to be the best team that we can possibly be, we have to be better defensively,\" Fox said.\n\n\r\n              Anthony Edwards scored 35 points on 17-for-18 free-throw shooting and Karl-Anthony Towns added 27 points and 11 rebounds for the Timberwolves, who are 2-1 in the tournament. Their 11-3 start overall and 7-0 at home were the best in franchise history, and they took the court with the best record in the NBA. This was their first loss in eight home games.\n\n\r\n              “They came out, punched us in the mouth. It took us a while to respond,” Wolves coach Chris Finch said. “Both teams were up for it, you could see.”\n\n\r\n              The Kings led for all but 79 seconds of the first quarter. Nickeil Alexander-Walker swished a 3-pointer that brought the Wolves within 72-70 less than three minutes after halftime, but they didn't get nearly enough deep shots to drop down the stretch.\n\n\r\n              “I keep telling our guys if we can lock in the way that we’re capable of defensively, we’re going to have a chance to be great,” Kings coach Mike Brown said.\n\n\r\n              The Kings had the decided edge in points in the paint (58-42), on second chances (26-15) and off the bench (45-25). They shot a season-best 48.6% from 3-point range, hitting 17 of 35.\n\n\r\n              This fast-paced matchup between two on-the-rise clubs was Minnesota's first home game in the soccer-style tournament, with a special sky blue court unveiled to look like the players were walking on water.\n\n\r\n              The Kings looked unsinkable at the beginning, with a surge of energy for the final stop on this six-game road trip. Entering the evening just 25th in the league in 3-point shooting (34.4%), they heated up in a hurry with a 7-for-9 start from deep. The Wolves brought the NBA's second-best 3-point defense to boot, yielding to opponents at a 32.3% clip.\n\n\r\n              Fox, who was one of six Kings to make multiple 3s, pitched in a soaring left-handed slam off a crossover dribble in the paint that put them up 48-33. They built their biggest lead of the game (57-35) on a dunk by Monk that punctuated a 19-4 spurt to open the second quarter.\n\n\r\n              “In the second quarter we started to stay home more,\" Edwards said. “We should’ve been doing it from the jump because the coaches had a great game plan.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Golden State Tuesday, their final group play game of the in-season tournament.\n\n\r\n              Timberwolves: Visit Memphis Sunday. They host Oklahoma City on Tuesday, their last scheduled game for the round-robin portion of the tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996492.50295
}