{
  "game_id": "0021600850",
  "espn_id": "400900256",
  "date": "Feb 23, 2017",
  "matchup": "ORL vs. POR",
  "headline": "Lillard rallies Trail Blazers to 112-103 win over Orlando",
  "body": "ORLANDO, Fla. -- Damian Lillard felt fresh after the All-Star break.\nAside from going to the Trail Blazers facility for treatment each morning, Lillard spent the majority of his time at home watching television, relaxing and consuming water. If his first game back from break was any indication, it was exactly what he needed.\nLillard scored 17 of his 33 points in the fourth quarter to rally struggling Portland to a 112-103 victory over the Orlando Magic on Thursday night.\n\"I truly believe that break played a part in me being able to come out fresh,\" said Lillard, who fought through picking up three fouls in the first half. \"Even though I got into foul trouble early in the game, I still felt good. I didn't feel discouraged about that and I think that played a huge part in that fourth quarter.\"\nLillard brought the Blazers back from an 11-point deficit early in the fourth with a couple of big 3-pointers and drives to the basket during a stretch in which Portland outscored Orlando 16-4 to claim the lead. Lillard's 3-pointer from the corner with 5:21 remaining gave the Blazers their first lead since the first quarter at 96-95.\nPortland would not trail again even though the game remained close down the stretch.\n\"He has done that often in his career,\" said Portland coach Terry Stotts, whose team snapped a three-game losing streak. \"When he gets to rolling like that ... I don't know if it's a normal thing but it's certainly not surprising.\"\nBut what may have been surprising was the defense of seldom-used guard Shabazz Napier, who put a stop to the penetration of Orlando guard Elfrid Payton in the second half. Napier played so well that Stotts played a three-guard lineup for much of the final 24 minutes to allow Napier, C.J. McCollum and Lillard to be on the floor together.\n\"More than anything else it was his defense,\" Stotts said of Napier. \"I liked his defense on the ball and I just didn't feel comfortable taking him out.\"\nThe Blazers spoiled Terrence Ross' Magic debut and also sent Orlando to its sixth loss in its last seven games.\nThe Magic led by as many as 14 points, but the all-too-familiar breakdowns on the interior defense and the inability to get consistent points outside of Nikola Vucevic plagued them down the stretch.\nOrlando coach Frank Vogel couldn't hide his frustration as his team's already slim playoff chances fade with each loss.\n\"That's exactly what I'm talking about,\" Vogel said. \"Up nine or whatever we were in the fourth quarter, you should win that game.\"\nIt was the exact opposite feeling in the Blazers' locker room. They had lost six of their last eight games entering Thursday night.\n\"Getting that feeling that we did much better than we have all season,\" Lillard said. \"We got a big win on the road.\"\nTIP-INS\nTrail Blazers: Forward Al-Farouq Aminu did not play Thursday because of continued problems with his left knee. Aminu missed the Blazers' last game before the All-Star break against Utah on Feb. 15 because of a left knee sprain. ... Newly acquired Jusuf Nurkic was inserted into the starting lineup and had 12 points and 12 rebounds. ... With his 3-pointer early in the third quarter, Lillard has now made at least one 3-pointer in a career-high 37 consecutive games dating back to Nov. 22. It's the second-longest streak in franchise history.\nMagic: Point guard C.J. Watson, who was recently inserted into the starting lineup, is listed as day-to-day with a sore right Achilles tendon. Watson said he expects to miss about a week to allow the injury to heal. ... With Watson out, Vogel went with a starting lineup of Evan Fournier, Aaron Gordon, Ross, Payton and Vucevic.\nNEW EDITION\nRoss' debut didn't go quite as anyone would have hoped. He struggled from the field early, missing his first four shots before hitting a 3-pointer in the second quarter.\nHe finished with 13 points on four of 17 shooting, which included a two for eight showing from 3-point range.\n\"I liked how aggressive he was, even though he took a few bad shots,\" Vogel said. \"I liked him being assertive on the offensive end.\"\nUP NEXT\nTrail Blazers: Portland continues its four-game road swing with a stop at Toronto on Sunday.\nMagic: Orlando will host Dwight Howard and the Atlanta Hawks on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995830.92754
}