{
  "game_id": "0021900683",
  "espn_id": "401161325",
  "date": "Jan 25, 2020",
  "matchup": "OKC @ MIN",
  "headline": "Schroder scores 26, Paul 25 as Thunder beat T-Wolves 113-104",
  "body": "MINNEAPOLIS --  With veterans banged up, Oklahoma City’s young players are gaining valuable experience and learning how to win on the road.\n\nHaving Chris Paul around to stabilize things certainly helps, too.\n\nPaul scored 25 points and hit timely shots to deflate Minnesota’s runs, and Dennis Schroder had a team-high 26 points off the bench to lead the Thunder to their fifth straight win, 113-104 over the slumping Timberwolves on Saturday night.\n\nSince December, the Thunder have gone 12-3 on the road and have won five consecutive games away from Chesapeake Energy Arena. Their bench played well again, outscoring Minnesota’s reserves 52-20. That was especially big considering Nerlens Noel was out with a fractured cheek bone, and Steven Adams wasn’t quite at full strength after missing two games due to injury.\n\n“I thought being somewhat short-handed and Steven probably not all the way back physically, the job those guys did on the road to find a way to win was really, really great,” coach Billy Donovan said.\n\nOklahoma City had seven players in double figures, including 15 points from Darius Bazley and 11 from Shai Gilgeous-Alexander.\n\n“Young guys amazing once again,” Paul said. “We came out, I think we were nine, 10 strong.”\n\nPaul had 10 points during a 31-12 run that appeared to give the Thunder control in the third. The Wolves managed to climb back late. Robert Covington's 3-pointer with 1:07 to play made it 109-104, but Paul answered with a floater in the lane and Schroder added a pair of free-throws to put the game out of reach.\n\n“He has so much experience,” Mike Muscala, who had 11 points off the bench, said of Paul. “He knows his spots. He knows how to keep the ball moving.”\n\nKarl-Anthony Towns scored 37 for the Timberwolves, who cut a 20-point deficit to five in the final minutes but lost their ninth in a row. The All-Star center has scored 30 points in three straight games for the second time in his career, but saw uneven production from his teammates.\n\n“The league is what it is,” Towns said. “They’re going to kick when you’re down, and they’re going to keep kicking you until you get it. We’ve got to get up.”\n\nREELING WOLVES\n\nAndrew Wiggins scored 22 for Minnesota, and Shabazz Napier had his first-career triple-double with 10 points, 13 assists and 10 rebounds.\n\nNot that Napier was in any mood to celebrate afterward.\n\n“I don’t care about that man, I could care less,” he said. “I’ve said this a million times, to many people, I could go in a game and throw a thousand turnovers, as long as we win.”\n\nKAT ADJUSTMENTS\n\nThe Thunder withstood an early push from Towns, who scored 19 of Minnesota’s first 20 points.\n\n“We did a better job of crowding the floor on him and at least putting some people around him where he didn't have so much room to operate,” Donovan said.\n\nSchroder came off the bench to score 10 in the period to steadily push the Thunder past the Wolves, who failed to find any early offense when Towns took a rest. The rest of the team went 1 for 13 from the floor in the first quarter.\n\nTIP INS\n\nThunder: Adams played 23 minutes in his return to the lineup after missing two games with a sprained left ankle. Adams was held scoreless, yet provided a big body to harass Towns. … The team said Noel underwent a successful procedure to repair a fractured left cheek, and that his status would be updated next week. Noel, who’s averaging 8.2 points and 5.2 rebounds, sustained the injury Friday night against Atlanta. … F Danilo Gallinari was also out with a sore left thumb injured Friday night.\n\nTimberwolves: G Allen Crabbe limped to the locker room with a left knee injury after a hard fall in the first quarter. He did not return. ... Rookie Jarrett Culver was back in the starting lineup a night after Josh Okogie started in the back court to guard Houston’s James Harden. … The Wolves recalled G Jaylen Nowell from the G League on Saturday. The second-round pick in the 2019 draft averaged 21 points in 24 games with the Iowa Wolves.\n\nUP NEXT\n\nThunder: Host Dallas Mavericks on Monday.\n\nTimberwolves: Host Sacramento Kings on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996217.841391
}