{
  "game_id": "0021901300",
  "espn_id": "401224775",
  "date": "Aug 11, 2020",
  "matchup": "POR @ DAL",
  "headline": "Lillard pours in 61 to lift Blazers past Mavs, 134-131",
  "body": "LAKE BUENA VISTA, Fla. --  Damian Lillard is simply willing the Portland Trail Blazers toward the postseason.\n\nThe veteran guard tied a career high with 61 points, leading the Blazers to a 134-131 victory over the Dallas Mavericks on Tuesday night that moved his team into eighth place in the Western Conference.\n\n\"Ain't nothing I want more,\" Lillard said of the playoffs. \"When I came here (to Disney World) I told them I'm not here to waste my time. Our work ain't done yet but we're fighting for it.\"\n\nThe Blazers will clinch a spot in the play-in series with a win Thursday against Brooklyn.\n\n\"We have to come out with the same mentality,\" Lillard said. \"We control our own destiny. That's the most important game of our lives.\"\n\nLillard joined Wilt Chamberlain as the only players with three 60-point games in a season. Coach Terry Stotts said his guard has been extra focused since missing two late free throws in a loss to the Clippers on Saturday.\n\n\"He's showing a lot of resolve,\" Stotts said. \"Nobody wanted to come into this bubble and make the playoffs more than Dame. We have one more game to go, but his leadership and his game speaks for itself. But he's bringing the team along with him.\"\n\nKristaps Porzingis scored 36 points before fouling out late in the game and Luka Doncic had 25 points, 10 assists and eight rebounds for the Mavericks, who will finish No. 7 in the West.\n\nLillard made nine 3-pointers in his sixth 50-point game of the season. He's the 12th player in NBA history to score 50 points in back-to-back games after dropping 51 on the 76ers on Sunday.\n\nHe scored in every way imaginable, from well beyond the 3-point line, on blow-by drives, short jumpers and at the foul line. Lillard finished 17 of 32 from the floor and 9 of 17 from beyond the arc while making all 18 free throw attempts.\n\n\"Damian played incredible,\" Porzingis said. \"Made some unbelievable shots. Hats off to him.\"\n\nHis most remarkable shot came with less than 2 minutes remaining. With the Blazers down three, he launched a shot from 36 feet away that hit the back of the rim and bounced several feet above the top of the backboard before dropping through the net.\n\n\"I've never seen a shot like that -- ever,\" said Mavericks coach Rick Carlisle. \"That was unbelievable.\"\n\nAfter Porzingis fouled out, Lillard drew a double-team and dished to Haasan Whiteside for a dunk to put the Blazers up by two. Doncic split a pair of free throws to cut the lead to one with 40 seconds left.\n\nLillard missed a fallaway jumper, and the Mavericks appeared to take the lead on Dorian Finney-Smith's 3-pointer from the corner, but Trey Burke was called for an illegal screen and officials waived off the basket.\n\n\"I don't know what to say,\" Doncic said. \"They call what they see out there. Personally, on the last play, I don't think it was an offensive foul. Especially I don't think you call those fouls in that moment. They can make mistakes.\"\n\nThe Mavs were forced to foul CJ McCollum, who made two free throws to put the Blazers up by three with 3.9 left. Tim Hardaway Jr.'s 3-pointer from the corner hit the side of the backboard as time expired.\n\n\"We just kept saying keep our composure,\" Lillard said. \"We knew the first team that came up with a few stops would win. It was going to come down to who wanted it more.\"\n\nThe game featured the two leading scorers since the NBA restart, with Doncic entering averaging 33.4 points and Lillard 33. Lillard was hot from the start, scoring 25 in the first half as the Blazers took a 66-58 lead.\n\n\"The problem was that he kept getting to the free throw line,\" Carlisle said. \"I haven't looked at the film yet as far as whether the calls were accurate or whatever. But great players have a knack for getting the whistle to blow.\n\n\"In the end, we were unable to keep him off the free throw line. When you let a guy who shoots like that shoot 18 free throws and score 18 points with the clock stopped, you're putting yourself up against it.\"\n\nTIP INS\n\nBlazers: Seth Curry did not play due to a leg injury. ... Blazers finished the first quarter on a 15-0 run to lead 38-31.\n\nMavericks: Porzingis showed his full offensive arsenal in a 16-point first quarter, scoring on pick-and-rolls, lob dunks, deep 3s and at the foul line.\n\nMELO STEPS UP\n\nCarmelo Anthony continues to play well. The 36-year-old forward scored 26 points on 10-of-17 shooting for Portland, several of those coming on low post moves.\n\n\"He had matchups on the block where we were able to take advantage of that,\" Stotts said.\n\nUP NEXT\n\nBlazers: Play Nets on Thursday.\n\nMavericks: Play Suns on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996599.845502
}