{
  "game_id": "401810110",
  "espn_id": "401810110",
  "date": "Nov 19, 2025",
  "matchup": "CLE vs HOU",
  "headline": "Alperen Sengun scores 28 points as Rockets top Cavaliers 114-104 for fifth straight win",
  "body": "CLEVELAND -- — Alperen Sengun had 28 points and 11 rebounds, Kevin Durant scored 20 points, and the Houston Rockets extended their winning streak to five with a 114-104 victory over the Cleveland Cavaliers on Wednesday night.\n\n\r\n              Aaron Holiday scored 14 of his 18 points in the fourth quarter for Houston, which is 10-1 since starting the season with two losses. Jabari Smith Jr. scored 14 and Amen Thompson had 12 points, nine boards and five steals.\n\n\r\n              De'Andre Hunter scored 25 points to pace the Cavaliers. Donovan Mitchell added 21 points, 19 in the final period when they got as close as 77-76 before the Rockets answered with back-to-back hoops by Sengun and Thompson.\n\n\r\n              Evan Mobley had 18 points, but missed six of his 10 free throw attempts for Cleveland, which fell to 2-2 on a six-game homestand, its longest of the season. Jarrett Allen added eight points and seven rebounds.\n\n\r\n              Houston extended its lead to 69-47 midway through the third on Smith's jumper, but the Cavaliers ended the quarter on a 23-5 run to pull within 74-70. Mobley had eight points and Lonzo Ball added seven during the surge.\n\n\r\n              Durant had 13 points and Sengun had 10 points and six rebounds, powering the Rockets to a 57-40 advantage at halftime. Houston led by 14 in the opening quarter and by 20 in the second.\n\n\r\n              Smith and Hunter were both called for flagrant fouls and technicals in the first half, while Cleveland's Nae'Qwan Tomlin picked up a technical.\n\n\r\n              Cavaliers point guard Darius Garland (left great toe) and swingman Jaylon Tyson (concussion) both missed their fifth straight games, while shooting guard Sam Merrill (right hand sprain) was hurt Monday against Milwaukee. Tyson could return Friday.\n\n\r\n              Up next\r\n              Rockets: Host Denver on Friday night.\n\n\r\n              Cavaliers: Host Indiana on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042652.877126
}