{
  "game_id": "0022000239",
  "espn_id": "401267399",
  "date": "Jan 22, 2021",
  "matchup": "LAC vs. OKC",
  "headline": "Clippers dominate, beat Thunder 120-106 for 6th win in row",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 31 points, Paul George added 29 and the Los Angeles Clippers beat the Oklahoma City Thunder 120-106 on Friday night for their sixth straight win.\n\n\r\n                    Serge Ibaka had 17 points and 11 rebounds to help the Clippers improve to 12-4, tying the Lakers for the NBA’s best record.\n\n\r\n                    Shai Gilgeous-Alexander led the Thunder with 30 points and eight assists against his former team. Lu Dort added 19 points.\n\n\r\n                    “He was amazing. He had some great moves, great finishes around the basket as always,” teammate Mike Muscala said of Gilgeous-Alexander. “He makes the game easier for everybody on the court.”\n\n\r\n                    The Thunder were in catch-up mode most of the way before dropping their second straight and fourth in five games. They were just 14 of 42 from 3-point range and only got to the free throw line 13 times.\n\n\r\n                    “We had a bad start,” Dort said. “We had to talk to each other, pick it up, and play harder.”\n\n\r\n                    The Clippers grabbed control in the first half, scoring 36 points in the first quarter and 34 in the second on 63% shooting. They had scoring runs of 21-2 and 11-4 in the first.\n\n\r\n                    They opened the second quarter with a 19-10 spurt, including George’s steal and dunk followed by his consecutive 3-pointers, for their largest lead of 27 points.\n\n\r\n                    From there, the Thunder put together a 25-15 surge, hitting five 3-pointers, to trail 70-53 at halftime.\n\n\r\n                    The Thunder worked to reduce a 23-point deficit to 10 points in the third. They outscored the Clippers 15-2 during one stretch, helped by eight points from Dort and Muscala’s first 3-pointer after he missed four attempts in the first half.\n\n\r\n                    But Leonard quickly put the Clippers ahead 91-75, running off six in a row. Muscala hit another 3-pointer that left the Thunder trailing by 13 going into the fourth.\n\n\r\n                    “Teams are going to make runs, regardless of it’s a top team or a young team,” George said. “You got to learn how to win in adversity and learn how to weather the storm. It's more so about us withstanding that and executing down the stretch.”\n\n\r\n                    George scored 11 points in the fourth against his old team, when Gilgeous-Alexander had 10 for the Thunder.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: It took until the second half, but Dort and Muscala continued their streaks of both hitting at least one 3-pointer in each game they’ve played this season. Dort leads the team with 34 3-pointers and Muscala is second with 26. ... They dropped to 1-6 against the West.\n\n\r\n                    Clippers: Lou Williams recorded his 249th career game with at least five assists off the bench, tying J.J. Barea for the most such games in NBA history.\n\n\r\n                    NEW ADDITION\n\n\r\n                    Nicolas Batum and his wife, Lily, welcomed a daughter earlier Thursday. He tweeted a black-and-white photo of the baby named Nayeli. “Woman (sic) are the strongest. They both have done a great job. What a crazy day. I’m the happiest man in the world,” he wrote, adding three heart emojis. Batum scored 14 points.\n\n\r\n                    UP NEXT\n\n\r\n                    The teams meet again Sunday at Staples Center.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997701.9604921
}