{
  "game_id": "0022400450",
  "espn_id": "401705016",
  "date": "Dec 31, 2024",
  "matchup": "MIL @ IND",
  "headline": "Antetokounmpo and Bucks shake off sluggish 1st half, rally to beat the Pacers 120-112",
  "body": "INDIANAPOLIS -- — Giannis Antetokounmpo shook off a four-point first half and finished with 30 points and 12 rebounds as the Milwaukee Bucks rallied from a 19-point deficit and beat the Indiana Pacers 120-112 on Tuesday.\n\n\r\n              Antetokounmpo, a two-time MVP who missed the previous three games with a non-COVID illness, stepped up in the second half after the Bucks fell behind 83-64 in the third quarter. The NBA scoring leader made 11 of 20 shots from the field and 8 of 13 from the line while adding five assists.\n\n\r\n              Brook Lopez scored 16 points and Bobby Portis Jr. had 14 points and 15 rebounds for the Bucks, who outscored the Pacers 67-48 after halftime.\n\n\r\n              Bennedict Mathurin led the Pacers with 25 points. Pascal Siakam had 20.\n\n\r\n              Takeaways\r\n              Bucks: Just when it seemed as if the Bucks were headed to a third consecutive loss, they went on a 12-0 run and trimmed a huge deficit to three points entering the final quarter. The strong second half made up for a sluggish first half.\n\n\r\n              Pacers: Each time Indiana nears .500, there’s a setback with another disappointing loss. Blowing such a big lead at home could sting for a while.\n\n\r\n              Key moment\r\n              Gary Trent Jr. hit two clutch 3-pointers late, the first with the Bucks leading by one and the second with a two-point lead just as the shot clock expired to make it 115-110 with 1:39 remaining.\n\n\r\n              Key stat\r\n              Damian Lillard missed all seven shots, including three 3s, and committed two turnovers in a forgettable first half while being hounded by top Pacers defender Andrew Nembhard. Lillard finished with 3-for-14 shooting for nine points.\n\n\r\n              Up next\r\n              The Bucks host Brooklyn on Thursday, and the Pacers visit Miami on Thursday.\n\n\r\n              ---- \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997844.587872
}