{
  "game_id": "0022300517",
  "espn_id": "401585145",
  "date": "Jan 10, 2024",
  "matchup": "MIN @ BOS",
  "headline": "East-leading Celtics hold off West's best Timberwolves in OT, improve to 18-0 at home",
  "body": "BOSTON -- — The last time the Timberwolves won in Boston, Kevin Garnett was the starting center — for Minnesota. Alex Rodriguez was in spring training, trying to bounce back from the New York Yankees' historic collapse in the AL Championship Series against the Red Sox. \n\n\r\n              Garnett's number is hanging from the rafters in the new Boston Garden now, not far from the 2008 NBA championship banner he helped the Celtics win. And Rodriguez, who's now a Timberwolves owner, was sitting courtside on Wednesday night to watch another Boston team break his heart. \n\n\r\n              Jayson Tatum scored 45 points — 14 of them in the fourth quarter and another 12 in overtime — to help the Celtics beat the Timberwolves 127-120 in a matchup of the two conference leaders. Boston improved to 18-0 at home for the first time in franchise history.\n\n\r\n              “You live for those moments. You want to do whatever you can to help your team win,\" Tatum said. “I didn’t want to lose at home yet. We’re still undefeated. The crowd got behind us. The energy got going. That was a fun ballgame toward the end.”\n\n\r\n              Jaylen Brown had 35 points and 11 rebounds for the Celtics. Jrue Holiday scored 12, including a corner 3-pointer off an offensive rebound by Derrick White to cap a 14-3 run that gave Boston a 111-109 lead with 26 seconds left in regulation.\n\n\r\n              Anthony Edwards hit a pair of free throws to tie it, and Tatum missed an off-balance shot at the buzzer that could have won the game in regulation. \n\n\r\n              Edwards had 29 points and Karl-Anthony Towns scored 25 with 13 rebounds for Minnesota, which flew in from Orlando in the afternoon because of weather problems that prevented the Timberwolves from traveling Tuesday night.\n\n\r\n              “We’re playing against a young superstar in Anthony Edwards. … It’s going to be an opportunity for him to showcase his greatness,” Brown said. “My whole thing was, ‘Not tonight.’”\n\n\r\n              The Timberwolves (26-11) have the top record in the Western Conference, trailing only NBA-best Boston (29-8) overall. Minnesota beat the Celtics in overtime in their previous matchup, in November. \n\n\r\n              “We've got a great memory,” Tatum said. “We remember playing those guys in Minnesota. We remember how it felt to lose that game.” \n\n\r\n              Minnesota last won at Boston in March 2005 — five months after the Red Sox rallied from a 3-0 deficit in the ALCS to beat Rodriguez's Yankees and then went on to win their first World Series in 86 years. Two years later, the Timberwolves traded Garnett to Boston, where he helped the Celtics snap a 22-year drought — the longest in franchise history — and win the NBA title.\n\n\r\n              But neither that roster nor any of the 16 other Celtics teams to win it all ever started a season with 18 straight wins at home. The 1957-58 team won its first 17 home games; the 1985-86 Celtics went 40-1 at home overall. \n\n\r\n              The Celtics have won 25 regular-season home games in a row, going back to last March. (They did lose in Boston during the playoffs, including a Game 7 loss to the Miami Heat in the Eastern Conference finals.)\n\n\r\n              “There’s nothing better than getting the Garden and the crowd to appreciate Celtics basketball,” Boston coach Joe Mazzulla said. “Even when we did suck, which we did at times, they kept us in it. It’s important to have that relationship with the crowd and the city.”\n\n\r\n              Boston led by nine with eight minutes left in the second quarter and still held a 54-48 edge in the final minute of the half before Minnesota scored the last five points before the break, making it a one-point game when Towns stole the ball and fed Edwards on a fast break just before the buzzer.\n\n\r\n              Towns scored on the first possession of the second half to give the Timberwolves their first lead. Minnesota led 106-97 with 3:35 left in the fourth before Boston scored 14 of the last 19 points in regulation.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Portland Trail Blazers on Friday night.\n\n\r\n              Celtics: At the Milwaukee Bucks on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996689.5317361
}