{
  "game_id": "0021501000",
  "espn_id": "400828887",
  "date": "Mar 15, 2016",
  "matchup": "MIL vs. TOR",
  "headline": "Lowry scores 25 points to lead Raptors past Bucks, 107-89",
  "body": "MILWAUKEE --  Even though leading scorer DeMar DeRozan was given the night off, Kyle Lowry and some of the lesser-known Toronto Raptors made sure they had little trouble with Milwaukee.\n\nLowry had 25 points and 11 assists, and rookie Norman Powell scored a season-high 17 in a 107-89 victory over the Bucks on Tuesday.\n\n\"It just shows how much depth we have on the bench, when your star player can have a rest game and we still have a dominating game like that,\" said Powell, who played 34 minutes after averaging just 7 per game coming in.\n\nBismack Biyombo, starting for injured center Jonas Valanciunas, had 12 points, 13 rebounds and two big blocks in the decisive third quarter, when Milwaukee missed 16 of 22 shots.\n\nToronto led 81-66 after three, allowing coach Dwane Casey to rest Lowry in the fourth.\n\n\"It was just our activity (on defense),\" Lowry said. \"Biz got two big blocks and that just sparked us. When he protects the rim we need to make sure we do something on the other end and reward him. It was a complete team effort.\"\n\nGiannis Antetokounmpo had 18 points, 12 rebounds and nine assists in 35 minutes for Milwaukee, just missing a triple-double.\n\nDeRozan, who averages 23.8 points per game, was in uniform but didn't play after starting each of the team's first 65 games and playing 39 minutes in a loss to Chicago on Monday night.\n\nValanciunas was held out as a precaution after bruising his left hand against the Bulls.\n\nToronto took control by scoring the first eight points of the second half to open a 62-49 lead. The Raptors then scored seven consecutive points midway through the third quarter to make it 71-55 on Lowry's 3-pointer with 6:07 left.\n\nMilwaukee never got within single digits again.\n\n\"The ball didn't move,\" Bucks coach Jason Kidd said of his team's third-quarter woes. \"I think we got a little frustrated. We have to do a better job shooting outside the paint.\"\n\nLowry made five of nine shots from the field and 11 of 13 free throws as Toronto won for the fourth time in five games. The effort came one night after he had 33 points, 11 rebounds and seven assists in the loss to the Bulls.\n\nCasey said before the game his team could start resting players in anticipation of the playoffs. Toronto is secure in the second spot in the Eastern Conference, and the game against the Bucks was the Raptors' third in four days.\n\nAntetokounmpo had four triple-doubles in his last 11 games before Tuesday night. Kidd pulled him with 2:47 left, one assist short of another triple-double.\n\nJabari Parker also scored 18 points for the Bucks.\n\nLowry had 20 points in the first half and Toronto led 52-49 at halftime.\n\nD-LEAGUE DEVELOPMENT\n\nCasey said Powell's time in the D-League helped his development immensely. Powell averaged nearly 25 points in eight games before being recalled on March 4. \"He went down and got in rhythm, having a feel for the game, understanding time-score situations,\" Casey said.\n\nLACK OF EFFORT\n\nAntetokounmpo said his team didn't play hard in the second half. \"We are supposed to come in the third quarter and play hard so we can win the game because that's really important for us right now,\" he said. \"We just didn't play hard. That's it.\"\n\nTIP-INS\n\nRaptors: Toronto won all four games in the season series. ... Powell was drafted in the second round by the Bucks but traded on draft night to the Raptors in a deal for Greivis Vasquez.\n\nBucks: F John Henson returned after missing 20 games with a sore lower back. He scored four points in 6 minutes. ... The game was delayed about 3 minutes early in the third quarter due to the surface being slippery near midcourt. A minor league hockey team plays at the BMO Harris Bradley Center and there is ice a couple of layers under the NBA court.\n\nUP NEXT\n\nRaptors: At Indiana on Thursday.\n\nBucks: Host Memphis on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994012.7820039
}