{
  "game_id": "0021500492",
  "espn_id": "400828379",
  "date": "Jan 01, 2016",
  "matchup": "CHA @ TOR",
  "headline": "DeRozan leads Raptors past Hornets 104-94",
  "body": "TORONTO --  DeMar Rozan and the Toronto Raptors found their groove with just enough time left to make a move on the Charlotte Hornets.\n\nDeRozan had 23 point and Kyle Lowry added 18 points and a season-high 11 assists as the Raptors pulled out a 104-94 victory over the Hornets on Friday night.\n\n\"We finally got into a rhythm, got a couple of stops and that's all we needed,\" DeRozan said. \"We had a couple of possessions where we were going back and forth and they were scoring. We just understood that if we got some stops and some big buckets we would be right back in the game and we would be able to take the lead.\"\n\nToronto entered the final quarter trailing by eight points and took the lead for the first time since the second quarter on a 3-pointer from Lowry with 8:30 to go. With the score tied at 94 about four minutes later, the Raptors ran off the final 10 points of the game -- back-to-back 3-pointers from Lowry and DeMarre Carroll helped seal the win.\n\nCharlotte missed its last eight field-goal attempts, shooting just 19 percent in the fourth quarter.\n\nJonas Valanciunas, in just his third game back after missing 17 games with a broken left hand, had his team-leading sixth double-double of the season with 10 points and a game-high 13 rebounds.\n\nToronto relied heavily on its outside shooting to avenge the 109-99 loss in Charlotte last month, matching a season-high with 15 3-pointers on 33 attempts. But Raptors coach Dwane Casey was less impressed with the 39.6 percent that his team shot from the field on the night.\n\n\"I'd love to shoot 45, 47, 48 (percent), but right now we're kind of discombobulated offensively, timing is off, guys are not exactly in the right places, and trying to get everybody back in,\" he said. \"And we'll get there, but it's going to take a little time, it's a little bumpy right now.\"\n\nThe Hornets looked at the loss as a missed opportunity, particularly after taking the eight-point lead into the fourth quarter, but for coach Steve Clifford, that edge should have been more.\n\n\"We were right there,\" he said. \"We should have been up eight, 10, 12 at the end of the third. I think it's pretty simple.\"\n\nWinning the battle on the boards played a big part in the victory for Toronto, with the Raptors holding a 54-43 edge and a 26-8 edge in second-chance points. The 20 offensive rebounds, including 11 off the bench for Bismack Biyombo, were a season high for Toronto.\n\n\"Offensive rebounds, that really hurt us tonight,\" Kemba Walker said. \"They had a bunch of points off offensive rebounds and it's got to be a gang effort, it's not just our bigs. The smalls as well, they've got to get in there and hurt them.\"\n\nWalker, who had a team-high 18 points, had 10 points in the third quarter to put Charlotte in position to snap a two-game skid. But the Hornets, missing Al Jefferson, Michael Kidd-Gilchrist and Jeremy Lin because of injuries, couldn't compete with the Raptors down the stretch.\n\n\"The second half they absolutely punished us on the glass,\" said Marvin Williams, who had 17 points. \"I think that is where the game was lost. I think we had played hard up until that point but they just wanted it a little more than we did.\"\n\nEASTERN PROMISE\n\nWith the win, the Raptors improve to 13-6 against Eastern Conference teams this season, including 7-1 at home.\n\nBIG D\n\nThe Raptors improved to 19-3 when they hold opponents to less than 100 points, and Toronto has won 14 consecutive games when it holds teams under the century mark.\n\nANKLE BREAKER\n\nCory Joseph brought the crowd to its feet. With Brian Roberts covering Joseph at the top of the key, a slickly executed crossover had Roberts sitting on his backside and Joseph was easily able to find Lowry for the go-ahead basket with 8:30 to go in the game.\n\nTIP-INS\n\nHornets: Charlotte's bench was contributing 39.4 points per game coming in, tops in the Eastern Conference, with Jeremy Lamb and Lin averaging 11.3 and 11.1 points respectively, the top two bench scoring averages among qualified players in the Eastern Conference. ... Walker needs one more 30-point game to match his career high for a season with five. Walker has also had two single-game performances with at least 35 points, five rebounds, five assists and two blocks, the only player in the NBA to accomplish that twice this season. ... Nicolas Batum's 16.3 points per game is the most by all qualified non-rookie players on new teams in the NBA this season.\n\nRaptors: Toronto registered 20 wins before the New Year for the second straight season, the only two seasons that they have done so in franchise history. ... Toronto is now 19-3 when holding opponents under 100 points. ... DeRozan tied his season high with 34 points in Wednesday's win over the Washington Wizards, and according to Elias Sports Bureau became the first Raptor since Vince Carter in 2003 to register at least 30 points, five rebounds, five assists and multiple steals and blocks in the same game. ... In the midst of a 13-game stretch against Eastern Conference teams, Toronto is now 13-6 against the East this season with a 7-1 record at home against Eastern Conference teams.\n\nUP NEXT\n\nHornets: host Oklahoma City on Saturday night.\n\nRaptors: host Chicago on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994386.0777888
}