{
  "game_id": "0022300563",
  "espn_id": "401585191",
  "date": "Jan 15, 2024",
  "matchup": "TOR vs. BOS",
  "headline": "Tatum has 19 points, 14 rebounds, Celtics win 105-96 for 8th straight over Raptors",
  "body": "TORONTO -- — Jayson Tatum had 19 points and 14 rebounds, Jrue Holiday scored eight of his season-high 22 points in the fourth quarter, and the Boston Celtics won their eighth straight meeting with Toronto, beating the Raptors 105-96 on Monday night.\n\n\r\n              Derrick White also scored 22 points, Kristaps Porzingis had 15 and Al Horford had 10 points and 11 rebounds as the Celtics completed a second straight four-game season sweep of their Atlantic Division rivals.\n\n\r\n              White scored 10 points in the fourth quarter, making a key 3 from the corner with just over a minute remaining.\n\n\r\n              “What he does for our team a lot of times goes unnoticed,” Holiday said of White. “A lot of times, too, it makes a big impact.”\n\n\r\n              Boston forward Jaylen Brown sat out because of a hyperextended right knee. Celtics coach Joe Mazzulla said Brown is dealing with soreness but that the injury is not considered serious.\n\n\r\n              “This year we’ve shown that, regardless of who’s out, there’s an affirmation that everyone is going to step up,” Mazzulla said.\n\n\r\n              RJ Barrett scored 24 points and Immanuel Quickley had 21 in the Raptors’ fourth straight loss. Pascal Siakam scored 17 points and Scottie Barnes had 10 points and 13 rebounds.\n\n\r\n              Toronto dropped to 0-10 against Atlantic Division opponents. Boston improved to 6-0 when holding opponents below 100 points.\n\n\r\n              The Raptors were without guard Gary Trent Jr., who sat out because of flu-like symptoms. Toronto’s Jontay Porter made his first career start in place of injured center Jakob Poeltl, who missed his fourth straight game because of a sprained left ankle.\n\n\r\n              Toronto shot 4 for 32 from 3-point range, its worst mark of the season, and missed all 13 attempts from distance in the second half. \n\n\r\n              “I thought it looked like we were getting good looks,” Toronto coach Darko Rajakovic said. “The ball did not go in.”\n\n\r\n              The Raptors went 4 for 29 from 3-point range in home loss to Portland on Oct. 30.\n\n\r\n              White made 5 of 11 from distance, giving him more made 3-pointers than Toronto’s entire team.\n\n\r\n              Boston shot 10 for 18 from long range in the first half and led 61-55 at the intermission.\n\n\r\n              Tatum had nine points and six rebounds in the third quarter as the Celtics took an 84-75 lead to the fourth.\n\n\r\n              The Raptors led 73-66 with 6:18 left in the third but shot 1 for 10 the rest of the quarter as Boston used an 18-2 run to regain the lead.\n\n\r\n              “We know that anything is possible,” Holiday said. “We know that we can come back and be able to withstand those punches.”\n\n\r\n              Barnes scored to make it 100-96 with two minutes remaining in the fourth but White answered with his fifth 3-pointer.\n\n\r\n              “His confidence and his aggressiveness are super important,” Mazzulla said of White.\n\n\r\n              Toronto finished with 25 assists, extending its franchise-record streak of games with 25 or more to 23.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host San Antonio on Wednesday night.\n\n\r\n              Raptors: Host Miami on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995420.783495
}