{
  "game_id": "0022400611",
  "espn_id": "401705177",
  "date": "Jan 20, 2025",
  "matchup": "CHI @ LAC",
  "headline": "LaVine leads Bulls over Clippers 112-99 as Chicago snaps 5-game skid with rare win in back-to-back",
  "body": "INGLEWOOD, Calif. -- — Zach LaVine scored 35 points and the Chicago Bulls defeated the Los Angeles Clippers 112-99 on Monday night to snap a five-game skid.\n\n\r\n              Talen Horton-Tucker added 18 points off the bench. Josh Giddey had 18 points, 10 rebounds and nine assists as the Bulls improved to 2-6 in back-to-backs this season.\n\n\r\n              The Clippers' four-game winning streak ended without starters Kawhi Leonard and Ivica Zubac. Norman Powell scored 27 points and James Harden added 17 points and 10 assists.\n\n\r\n              The Clippers closed to 101-92 on a three-point play by Derrick Jones Jr. before the Bulls ended the game on an 11-7 surge.\n\n\r\n              Takeaways\r\n              Bulls: LaVine notched his 109th career game with at least 30 points, tying the late Bob Love for second-most such games in franchise history.\n\n\r\n              Clippers: Zubac sat out for the first time this season after being poked in the eye in Sunday’s win over the Lakers. Los Angeles missed his rebounding, with the Bulls controlling the boards, 54-40. Leonard is being held out of back-to-backs as part of injury management for his right knee.\n\n\r\n              Key moment\r\n              LaVine led a dominant third quarter with 15 points. The Bulls outscored the Clippers 36-16 to turn a two-point halftime deficit into an 18-point lead going into the fourth.\n\n\r\n              Key stat\r\n              The Bulls made 15 3-pointers, led by five from LaVine. The Clippers were 9 of 42 from long range.\n\n\r\n              Up next\r\n              The Bulls visit Golden State on Thursday. The Clippers host defending NBA champion Boston on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997067.393196
}