{
  "game_id": "0022300651",
  "espn_id": "401585279",
  "date": "Jan 27, 2024",
  "matchup": "SAC @ DAL",
  "headline": "De'Aaron Fox scores 34 as Kings cool off Luka Doncic and beat Mavericks 120-115",
  "body": "DALLAS -- — De’Aaron Fox scored 34 points and Harrison Barnes had 20 to lead the Sacramento Kings to a 120-115 win over Dallas on Saturday night, cooling off the Mavericks' Luka Doncic who had 28 points the night after scoring a franchise-record 73. \n\n\r\n              “Fox was joking to me to just, ‘Don’t let (Doncic) put 70 on your head tonight,’ ” said Keegan Murray, who was the Kings’ primary defender on Doncic and scored 15 points. In the locker room afterward, Murray posed while wearing the team’s defensive player of the game crown.\n\n\r\n              The Kings had a 23-point lead that dwindled to 114-108 with two minutes to play before Fox scored on a layup and a pair of free throws. Maxi Kleber converted his own follow with seven seconds left to pull Dallas within three. Barnes hit two free throws with 4.4 seconds to go.\n\n\r\n              “When you have a lead like that, it’s natural that you just want to waste some time,” Fox said. “We’ve got to be able to finish a game better than that.”\n\n\r\n              Kevin Huerter scored 18 and Domantas Sabonis had 17 points and a game-high 11 rebounds for his 27th consecutive double-double as the Kings won their third straight following a season-worst four-game losing streak. They’ve won the first two games of a season-long seven-game road trip.\n\n\r\n              The Mavericks split their back-to-back after beating Atlanta 148-143 on Friday night when Doncic tied for the fourth most points in a game in NBA history behind only Wilt Chamberlain and Kobe Bryant.\n\n\r\n              Doncic also had 17 assists and 10 rebounds on Saturday for his ninth triple-double this season, third in the NBA behind Nikola Jokic’s 13 and Sabonis’ 12.\n\n\r\n              “With the depth that we have, he’s out there trying to do it by himself,” Mavericks coach Jason Kidd said. “That’s who he is. He loves to take on the world.”\n\n\r\n              Grant Williams scored a career-high 27 points, matching a career best with seven made 3’s, and Tim Hardaway Jr. had 19 for Dallas.\n\n\r\n              Doncic played a season-high 46:09 minutes after playing 44:43 on Friday night. He shot 9 of 26, hitting his first 3-pointer on nine attempts with 17 seconds to go. It was his lowest output since scoring 25 points in 32 minutes in a 16-point home loss to the Kings on Nov. 19.\n\n\r\n              “I’m tired. I can’t wait to go to sleep, honestly,” Doncic said. “I thought we fought well. I’m proud of how this team fought. Obviously, we couldn’t get the win, but we fought really well.”\n\n\r\n              Doncic was called for a technical foul early in the second quarter after being blocked twice within five seconds by Murray. At that point, his 4-of-12 shooting from the floor matched his total of missed field-goal attempts on Friday when taking 33 shots.\n\n\r\n              The Kings had a season-high 10 blocks, nine in the first half.\n\n\r\n              Dallas’ Kyrie Irving missed his third straight game after spraining his right thumb on Monday. He has missed 19 games this season. It was the 24th time in 46 games that Dallas has played without one or both of its stars.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit Memphis on Monday night.\n\n\r\n              Mavericks: Host Orlando on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996792.842884
}