{
  "game_id": "0022300440",
  "espn_id": "401585068",
  "date": "Dec 30, 2023",
  "matchup": "TOR @ DET",
  "headline": "Pistons beat Raptors 129-127 to end NBA record-tying losing streak at 28 games",
  "body": "DETROIT -- — The Detroit Pistons ended their NBA record-tying losing streak at 28 games with a 129-127 victory over the short-handed Toronto Raptors on Saturday night, as Cade Cunningham had 30 points and 12 assists. \n\n\r\n              The Pistons, who hadn't won since Oct. 28, matched the Philadelphia 76ers’ record of 28, split over the 2014-15 and 2015-16 seasons. They finished one shy of the record for the four major American and Canadian leagues, set by the Chicago Cardinals during World War II. \n\n\r\n              “I feel amazing,\" Cunningham said. “We just kept battling. It's been a long stretch, all these losses, but I'm just happy to be part of a group of guys who don't quit.”\n\n\r\n              Jalen Duren had 18 points and 17 rebounds for Detroit (3-29) while Kevin Knox II scored 17 points.\n\n\r\n              “I'm just so happy we were able to get that,” Duren said. “We've been fighting hard for a couple of months to get one, and we've been through a lot of adversity.”\n\n\r\n              Pascal Siakam had 35 points and Dennis Schroder scored 28 for Toronto, which was playing the second half of a back-to-back. The Raptors traded OG Anunoby, Precious Achiuwa and Malachi Flynn to the New York Knicks earlier in the day. They received RJ Barrett and Immanuel Quickley, but they were not available on Saturday.\n\n\r\n              “It was a very emotional day for everyone,” Raptors coach Darko Rajakovic said. “I'm really proud of the energy our guys had, taking everything into account. \n\n\r\n              \"I also don't want to take anything away from what Detroit did. They played a really good game and hit some very, very timely shots.”\n\n\r\n              The Pistons led 90-86 going into the fourth and neither team was able to put together a run until back-to-back 3-pointers by Cunningham and Jaden Ivey made it 110-99 with 5:50 to go.\n\n\r\n              Toronto responded with an 8-2 run, including six points from Scottie Barnes, but Cunningham’s jumper made it 114-107 and the Pistons got three straight stops against Siakam. Another jumper by Cunningham moved the margin to nine with 1:34 to play.\n\n\r\n              Siakam’s 3-pointer made it 126-122 with 17 seconds left, but the Pistons clinched the game from the line. Gary Trent Jr. hit a 3-pointer with a second left, but the celebration was already beginning.\n\n\r\n              “I've been in a ton of locker rooms my whole life, but that's a first for me,” Pistons coach Monty Williams said. “Guys were screaming. I was almost in tears. I'm just so happy for our guys and for everyone in the locker room.”\n\n\r\n              The Raptors trailed by eight points at halftime, but Siakam and Trent scored 24 points in eight minutes to put Toronto ahead 75-74. Siakam finished with 20 of Toronto’s 42 points in the quarter, and more importantly, drove Cunningham to the bench with four fouls.\n\n\r\n              “I challenged both (Siakam) and Scottie at halftime,” Rajakovic said. “I told them that we needed more from them in the second half, and they both did a really good job.”\n\n\r\n              The Raptors scored 83 points in the second half after only putting up 44 in the first.\n\n\r\n              “We missed some free throws and we missed a bunch of layups that we usually make,” Rajakovic said.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Cleveland on Monday night.\n\n\r\n              Pistons: At Houston on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995432.118355
}