{
  "game_id": "0021500720",
  "espn_id": "400828607",
  "date": "Jan 31, 2016",
  "matchup": "LAL vs. CHA",
  "headline": "Hornets send Lakers to record-tying 10th loss in row, 101-82",
  "body": "LOS ANGELES -- The road-weary Charlotte Hornets were making the final stop on a four-game trip after back-to-back losses. They were missing four key players due to injury.\nAgainst a better team than the Los Angeles Lakers, all of that might have mattered.\nMarvin Williams and Michael Kidd-Gilchrist had 19 points and 12 rebounds apiece, and the Hornets sent the Lakers to their franchise record-tying 10th consecutive defeat, 101-82 on Sunday night.\nKemba Walker had 12 points, seven rebounds and six assists for the Hornets, who hit 13 3-pointers and had a 59-42 rebounding edge in a decisive win over the Western Conference's worst team. Charlotte led for all but one possession, cruising back home even with four of its top eight scorers sidelined.\n\"We just wanted to end the road trip the right way, and the ending was great from the jump,\" Walker said. \"The energy and intensity was all there. We did everything we wanted to do.\"\nKobe Bryant scored 23 points in 23 minutes, but the Lakers matched the 1994 team for the longest skid in the proud history of a franchise that's won 16 NBA championships. Los Angeles dropped to 9-41, guaranteeing three straight non-winning seasons for the first time since 1961.\n\"Honestly, it doesn't really matter,\" said Bryant, the 20-year NBA veteran. \"I mean, does it make a (lousy) season less (lousy)? You just want a win, no matter what.\"\nWhile Bryant hit four 3-pointers and excelled in his first 20-point performance since Jan. 7, his teammates received loud boos from a Staples Center crowd finally growing tired of their poor play in his farewell season.\n\"I think the fans are just as frustrated as we are,\" Lou Williams said. \"Hopefully the boos weren't because of a lack of effort, because I thought our guys played all right. We just missed shots. Once we started missing shots, I think we just got demoralized. ... I think we've got a lot of guys in there right now with a lack of confidence, and we have to somehow get that back.\"\nJordan Clarkson scored 13 points and Lou Williams added 11 for the Lakers, who finished January with 14 losses in 15 games since their only winning streak of the season.\n\"The Navy SEALs have a way of taking guys to the bottom of the pool,\" Bryant said. \"Sometimes, you've got to go to the bottom of the pool, man, and figure it out. We're almost there, gasping for air.\"\nMKG IN LA\nKidd-Gilchrist returned from shoulder surgery in Portland on Friday night after being sidelined since October. He went 6 for 7 against the Lakers and hit two 3-pointers.\nKOBE'S STRENGTHS\nBryant missed his first five shots before banking in a short jumper late in the first quarter. He heated up with three 3-pointers and two free throws in a 2:06 span in the second quarter, earning a standing ovation and chants of \"Kobe! Kobe!\" from the adoring Lakers fans.\nBryant was a high school freshman when the Lakers lost 10 straight games in 1994 under interim coach Magic Johnson, who watched this game from courtside.\nLIN'S RETURN\nJeremy Lin had six points, five assists and five rebounds despite a sprained right ankle. The point guard spent last season with the Lakers, struggling to fit into coach Byron Scott's offense and rarely playing a significant role on the worst team in franchise history. Lin signed with Charlotte in July.\nTIP-INS\nHornets: Jeremy Lamb sat out his fifth straight game while hobbled by a sprained toe. ... Nicolas Batum also sat out again due to a strained toe.\nLakers: The crowd observed a pregame moment of silence for Marge Hearn, the widow of longtime Lakers broadcaster Chick Hearn. She was 98 when she died Saturday night. ... Before the game, the Lakers signed Make-a-Wish recipient Yitzi Teichman to a one-day contract. The brain cancer fighter got a No. 18 jersey. ... Rookie F Larry Nance Jr. sat out after a setback with his sore right knee. The Lakers are considering shutting him down until after the All-Star break, Scott said. ... IOC President Thomas Bach, Harrison Ford and Calista Flockhart, and Robbie and Claudine Keane attended the game.\nUP NEXT\nHornets: Host the Cavaliers on Wednesday.\nLakers: Host the Timberwolves on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994270.422415
}