{
  "game_id": "0022401133",
  "espn_id": "401705699",
  "date": "Apr 06, 2025",
  "matchup": "CHI @ CHA",
  "headline": "Coby White scores 37, Josh Giddey adds 23 as Bulls beat Hornets 131-117 for 3rd straight win",
  "body": "CHARLOTTE, N.C. -- — Coby White scored 37 points, shooting 6 of 8 from 3-point range, Josh Giddey added 23 points, 10 rebounds and eight assists and the Chicago Bulls rolled past the Charlotte Hornets 131-117 on Sunday for their third straight win.\n\n\r\n              Nikola Vucevic contributed 16 points and 11 rebounds for the Bulls, who entered one game behind the Atlanta Hawks for the eighth spot in the Eastern Conference.\n\n\r\n              Mark Williams had 22 points and nine rebounds for the Hornets, who have lost 10 of 12 games. K.J. Simpson and Jusuf Nurkic each had 18 points.\n\n\r\n              White continued to have success in Charlotte, a few hours from where he grew up in Goldsboro, North Carolina, and later played college basketball for the Tar Heels. In his last four games against the Hornets at the Spectrum Center, White has averaged 30.5 points.\n\n\r\n              He finished 12 of 16 from the field and had five assists.\n\n\r\n              Takeaways\r\n              Bulls: Patrick Williams always seems to play well in Charlotte, where he was born and raised, and Sunday was no exception. He scored 15 points on 6 of 8 shooting.\n\n\r\n              Hornets: Miles Bridges continues to struggle mightily from beyond the 3-point arc, shooting 18.5% (10 of 54) over the last eight games. Bridges spent the entire fourth quarter on the bench.\n\n\r\n              Key moment\r\n              After falling behind by 10 early, the Bulls took control in the second quarter and built a 75-55 halftime lead behind White, who had four 3s in the second quarter including a heave from just inside midcourt to beat the first-half buzzer.\n\n\r\n              Key stat\r\n              Charlotte finished 8 of 30 from beyond the arc.\n\n\r\n              Up next\r\n              Both teams are in action Tuesday night. The Bulls visit the Cavaliers, while the Hornets wrap up their home schedule against the Grizzlies. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997022.512956
}