{
  "game_id": "0022000069",
  "espn_id": "401267229",
  "date": "Jan 01, 2021",
  "matchup": "MEM @ CHA",
  "headline": "Brooks helps undermanned Grizzlies beat Hornets 108-93",
  "body": "CHARLOTTE, N.C. -- — Dillon Brooks scored 21 points and the undermanned Memphis Grizzlies beat the Charlotte Hornets 108-93 on Friday night.\n\n\r\n                    Memphis, which had seven players ruled out for various health reasons and dressed just nine, closed out a three-game road trip 2-1.\n\n\r\n                    “Being down a few guys, it’s the next-man-up mentality,” Grizzlies coach Taylor Jenkins said. \n\n\r\n                    Kyle Anderson finished with 18 points and a career-best 11 rebounds, and Brandon Clarke 15 scored for Memphis.\n\n\r\n                    “Either way, I’m going to play hard off the bench or if I start,” Clarke said. “I’m able to do either one of them, and it’s fun.”\n\n\r\n                    Jonas Valanciunas had 14 points and 10 rebounds, Gogul Dieng scored 14, and Desmond Bane 10 for the Grizzlies. Tyus Jones led all players with 12 assists.\n\n\r\n                    “I think they’re overall aggressive and they were the aggressive team,” Hornets coach James Borrego said. “In (a win on Wednesday at) Dallas, we were the aggressive team. Tonight, Memphis was the more aggressive team. Give them credit.”\n\n\r\n                    Bane was 2 of 7 from long distance and extended his streak of games with multiple 3-pointers to five, second-most in NBA history. \n\n\r\n                    Bismack Biyombo led Charlotte with 16 points and 12 rebounds, and LaMelo Ball had 15 points and a team-best six assists. The Hornets got 14 points each from Gordon Hayward and Caleb Martin. P.J. Washington finished with 10 points.\n\n\r\n                    “A lot of it is on the offensive end,” Borrego said of the Hornets’ struggle to score Friday. “We can’t find a rhythm offensively. We can’t get good looks or we’re turning it over. So, it’s something that we’ve got to address. There are some areas that we’ve got to refocus on and there’s not a lot of practice time here. So, we’re just going to have to do it through game reps and we’ve got another shot tomorrow night (in Philadelphia).”\n\n\r\n                    Charlotte was slowed by 9-of-31 shooting from 3-point range, shot just 40.7% from the floor and trailed by as many as 24 points.\n\n\r\n                    “That’s how you create your juice and your energy, night in and night out,” Jenkins said of the defensive effort against Charlotte, which was held to eight points in transition. “To hold a team that can score at a high level under 30 points in all four quarters. … I thought was huge.”\n\n\r\n                     MELO MAKING CASE FOR STARTING ROLE\n\n\r\n                    After a pair of impressive games, LaMelo Ball looks as if he could be a nice addition to the starting lineup for Charlotte. Coach James Borrego said he’s continuing to evaluate the team’s lineup.\n\n\r\n                    “I’m looking at everything right now in evaluation,” Borrego said. “We’re only five games in now. … I’ve got to continue to look and look at it hard.”\n\n\r\n                    Before his 15-point, six assist performance against Memphis, Ball registered 22 points, eight rebounds, and five assists in a win against Dallas.\n\n\r\n                     TIP-INS\n\n\r\n                    Grizzlies: Forward Grayson Allen, who played at Duke, missed the game with a left ankle sprain. He was one of seven Memphis players listed as out for the game. … The Grizzlies have not started the same lineup in any of their five games. … Valanciunas has posted a double-double in all five games this season.\n\n\r\n                    Hornets: Biyombo reached 4,000 career rebounds with seven in the first half. … Charlotte will play consecutive games in Philadelphia on Saturday and Monday to start a four-game road trip that includes stops in Atlanta and New Orleans.\n\n\r\n                    UP NEXT:\n\n\r\n                    Grizzlies: Will play at home on Sunday against the Lakers.\n\n\r\n                    Hornets: Will visit the 76ers on Saturday and Monday.\n\n\r\n                     ------",
  "source": "espn_api",
  "crawled_at": 1764996990.7845068
}