{
  "game_id": "0021800610",
  "espn_id": "401071286",
  "date": "Jan 09, 2019",
  "matchup": "MIL @ HOU",
  "headline": "Antetokounmpo scores 27 to lead Bucks over Rockets 116-109",
  "body": "HOUSTON --  Giannis Antetokounmpo wasn't going to join in on the debate about whether he should be an early favorite for MVP after he led the Milwaukee Bucks to a victory over the Houston Rockets and last year's MVP James Harden on Wednesday night.\n\nThe rising young star was just happy his team was leaving Houston with a win.\n\n\"All I care about is winning,\" Antetokounmpo said. \"I know by winning and doing whatever it takes to help your teammates and leaving everything out on the floor everything will take care of itself, the titles and all that.\"\n\nAntetokounmpo scored 27 points and grabbed a season-high 21 rebounds to help the Bucks withstand a 42-point performance from Harden in a 116-109 win.\n\nIn this matchup of early front-runners for MVP, Harden and his teammates were done in by a shooting slump late in the third quarter that spilled into the fourth and left them down by 15 points.\n\n\"We just got stagnant and defensively I think we allowed 38 points in that quarter -- way too many -- especially at home and so there you go,\" Harden said. \"We couldn't get out in transition. We couldn't get to where we want to go because we couldn't get any stops.\"\n\nMilwaukee held a 13-point lead with about five minutes left before Houston used an 8-0 run, started by two 3-pointers from Harden, to cut the lead to 107-102. The Bucks got a layup from Eric Bledsoe before Harden scored the next four points to get Houston within 109-106 with 2 1/2 minutes left.\n\nAntetokounmpo made one of two free throws to push Milwaukee's lead to four points with about 90 seconds left. Harden missed his third straight 3-pointer before Antetokounmpo added a layup on the other end to make it 112-106 with 40 seconds remaining.\n\nHarden missed another 3 seconds later and the Bucks added four free throws down the stretch to secure the their seventh victory in eight games.\n\nIt was Harden's sixth 40-point outing in the last eight games and he has scored 30 or more points in 14 straight games, which is the longest streak since Tracy McGrady did it in 2003. He shot 6 of 16 on 3-pointers to give him at least five in the last 11 games.\n\nHouston center Clint Capela struggled, making just 4 of 16 shots a game after scoring a career-high 31 points in a win over the Nuggets on Monday. He finished with 18 points and 13 rebounds.\n\nCoach Mike D'Antoni credited Milwaukee's big defensive duo of Brook Lopez and Antetokounmpo for making things tough on Capela.\n\n\"They're imposing at the rim,\" D'Antoni said. \"They did a good job and it costs us some turnovers, and we just weren't real sharp and we tried to force some things up underneath the basket.\"\n\nThe Bucks scored the first six points of the fourth quarter to stretch a run they started in the third quarter to 15-0 and make it 98-83 with about 10 minutes left.\n\nThe Rockets got their first field goal since the 4:32 mark of the third quarter when P.J. Tucker made a 3-pointer a few seconds after that.\n\nHouston led by 6 at halftime after 23 points by Harden, but the Bucks opened the third quarter with an 11-3 run to take a 65-63 lead with about 9 1/2 minutes left in the quarter. Milwaukee got four points from Malcolm Brogdon and three from Antetokounmpo in that stretch.\n\nThe Rockets got five quick points from Gerald Green to start a 7-0 run later in the third that put them up 75-70.\n\nThe Bucks were down by 7 later in the quarter before using a 17-1 spurt to end the quarter and take a 92-83 lead into the fourth. That run included a 9-0 run in the last 1:19 of the quarter highlighted by a tip-in at the buzzer by Antetokounmpo.\n\nTIP-INS\n\nBucks: D.J. Wilson missed his second straight game with a bruised hip. ... Brogdon finished with 24 points. ... Khris Middleton added 15 points.\n\nRockets: Chris Paul missed his ninth game in a row with a strained left hamstring. ... Eric Gordon missed his fifth straight game with a bruised right knee. ... Houston shot 18 of 48 on 3-pointers.\n\nBOUNCE PASS?\n\nA weird play came in the third quarter when Antetokounmpo threw a pass across the lane and it bounced off Harden's face and back at Antetokounmpo , who dished it to Ersan Ilyasova for a 3. Harden fell slowly to the court after he was hit but got up quickly and seemed to be OK.\n\nAntetokounmpo felt bad that he hit Harden in the face and said he apologized.\n\n\"It was crazy because it was so hard for the ball to be able to bounce from one side of the floor to the other side of the floor that's how you know how hard the pass was,\" he said. \"It was an accident, but I'm so happy it bounced back to me.\"\n\nHarden said he never saw it coming.\n\n\"I didn't even know what happened,\" Harden said. \"I think the ball somehow came back into his hands ... wish I would have seen it.\"\n\nUP NEXT\n\nBucks: Visit Washington on Friday night.\n\nRockets: Host Cavaliers on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994491.570851
}