{
  "game_id": "0022300746",
  "espn_id": "401585374",
  "date": "Feb 09, 2024",
  "matchup": "SAC vs. DEN",
  "headline": "Sabonis breaks tie with Jokic for NBA triple-double lead with 16, Kings rout Nuggets 135-106",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 17 points, 17 rebounds and 10 assists to break a tie with Nikola Jokic for the NBA triple-double lead with 16 and the Sacramento Kings beat the Denver Nuggets 135-106 on Friday night.\n\n\r\n              Jokic, the NBA triple-double leader the last two seasons, had 23 points, eight rebounds and seven assists to fall just short of keeping pace with Sabonis.\n\n\r\n              “Going against the best is always more exciting, more fun,” Sabonis said. “You always want to challenge yourself as a competitor. As a competitor you always want to go against the best.”\n\n\r\n              The defending champion Nuggets lost for the first time in four games and missed a chance to slip past the Minnesota Timberwolves for the top spot in the Western Conference.\n\n\r\n              Malik Monk added 23 points for the Kings. De’Aaron Fox had 15 points, 10 assists and five steals. Keegan Murray scored 17 points.\n\n\r\n              Sabonis is a major reason why the Kings are still in contention in their quest to make back-to-back appearances in the postseason since 2004-06.\n\n\r\n              A three-time All-Star who didn’t make the team this season, Sabonis shot 7 of 9 from the floor and had 16 of his rebounds off the defensive glass. He is attempting to become the second Kings player in the Sacramento era to lead the NBA in triple-doubles. Chris Webber shared the league lead of five with Jason Kidd during the 1999-2000 season.\n\n\r\n              Sacramento rebounded from a loss to lowly Detroit to beat the Nuggets. The Kings led by 32, forced 21 turnovers and held a 65-42 advantage in bench scoring.\n\n\r\n              “I told our guys, ‘I believe in you. You guys have a chance to be great,’” Kings coach Mike Brown said. It shouldn’t take a loss like we had for us to lock in like we did tonight. It’s up to us to lock in, focus on the small details and go out there and perform for 48 minutes from start to finish. If we do, we’ll be happy where we are at the end of the year.”\n\n\r\n              Aaron Gordon scored 14 points for Denver. Christian Braun added 13 and Jamal Murray had 12. The Nuggets were playing on the second-half of a back-to-back after beating the Lakers in Los Angeles on Thursday night.\n\n\r\n              Nuggets coach Mike Malone bemoaned his team’s self-inflicted errors. Denver’s turnovers led to 37 points for the Kings.\n\n\r\n              “We didn’t take away anything, but you’re not going to beat a good team on the road with what we have,” Malone said. “When they covert at that kind of rate, you’re not giving yourself a chance to win.”\n\n\r\n              Monk made one of the biggest plays of the night when he stole an inbounds pass and made a 3-pointer at the buzzer to end the first quarter.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Milwaukee on Monday night.\n\n\r\n              Kings: At Oklahoma City on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996788.220096
}