{
  "game_id": "0022000284",
  "espn_id": "401267444",
  "date": "Jan 28, 2021",
  "matchup": "LAL @ DET",
  "headline": "With Davis out, Lakers fall to Pistons 107-92",
  "body": "DETROIT -- — LeBron James made his first seven shots from the field and looked plenty capable of leading the Lakers to a victory with Anthony Davis sidelined.\n\n\r\n                    Then James tried to become more of a facilitator — and he never really regained that scoring groove.\n\n\r\n                    James scored just two points after halftime, and the Detroit Pistons handed Los Angeles its second straight loss, 107-92 on Thursday night. Davis sat out because of a right quad contusion.\n\n\r\n                    “I think early on I got it going, and then I still at the end of the day, still got to get my teammates involved,” James said. “I definitely missed some shots that I know I’m accustomed to making.\"\n\n\r\n                    Blake Griffin scored 23 points for the Pistons, who are having a strange week that has included wins over the 76ers and Lakers but a loss to Cleveland in between.\n\n\r\n                    “I thought we were really good,” Griffin said. “I was proud of the way everybody played.”\n\n\r\n                    James had 22 points and 10 assists. The Lakers lost by a point at Philadelphia on Wednesday night, and now the defending champions are on their first losing streak of any length since before last year's playoffs.\n\n\r\n                    Detroit led by one before Griffin's 3-pointer with 6:54 remaining started a 16-0 run. The Lakers went nearly seven minutes without scoring.\n\n\r\n                    “I don’t know if we ran out of gas,\" Lakers coach Frank Vogel said. \"We just didn’t have a great rhythm that second half in any way.”\n\n\r\n                    Wayne Ellington added 20 points for the Pistons.\n\n\r\n                    James was questionable because of a left ankle sprain, but he looked fine at the outset, scoring 14 points in the first quarter. James made four 3-pointers in the first half, but so did Ellington, and the Pistons only trailed 58-56 at the break.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Kyle Kuzma scored 22 points and Talen Horton-Tucker contributed 13. ... James went 1 of 12 from the field after making his first seven shots.\n\n\r\n                    Pistons: Detroit made all 13 of its free throws. ... Mason Plumlee had 17 points and 10 rebounds.\n\n\r\n                    UPS AND DOWNS\n\n\r\n                    The last three Detroit games — a win over Philadelphia on Monday, a loss to Cleveland on Wednesday and the game against the Lakers on Thursday — were decided by exactly 15 points.\n\n\r\n                    The Pistons caught a break when Joel Embiid of the 76ers was out Monday, and again when they missed having to face Davis, but this rebuilding team can use some reasons for optimism. Besides, the Lakers are still tough as long as James is in the lineup.\n\n\r\n                    “They’re experienced, they know how to play,\" Detroit coach Dwane Casey said. \"But it’s good for us to get that confidence and to reinforce what you’re preaching.”\n\n\r\n                    TORRID STRETCH\n\n\r\n                    Ellington finished 6 of 9 from 3-point range and is 40 of 67 from long distance in his last eight games. Ellington became the eighth player in NBA history to have at least seven straight games with four or more 3s.\n\n\r\n                    “He just single-handedly spaced our floor on offense, when you have to give that much attention to somebody,\" Plumlee said. \"Coach always draws up a good first play to get him off, he hits it and then it’s like the rest of the night that team is worried about him coming off pin-downs. Then now, he is getting some cutting baskets because they are so worried about him coming off the screen. It just changes the dynamics of your offense.”\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Visit the Boston Celtics on Saturday night. The teams split two games last season, with Boston winning its home game 139-107.\n\n\r\n                    Pistons: Visit the Golden State Warriors on Saturday night. The Warriors beat Detroit 116-106 on Dec. 29.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997320.900398
}