{
  "game_id": "401810164",
  "espn_id": "401810164",
  "date": "Dec 01, 2025",
  "matchup": "DET vs ATL",
  "headline": "Cunningham stars late as the Pistons hang on to beat the Hawks 99-98",
  "body": "DETROIT -- — Cade Cunningham scored eight of his 18 points in the final 3:21, and the Detroit Pistons rallied to beat the Atlanta Hawks 99-98 on Monday night.\n\n\r\n              Atlanta had a chance to win with 0.1 seconds left, but Jalen Johnson couldn't convert a tip-in as time expired.\n\n\r\n              Jalen Duren had 21 points and 11 rebounds for the Pistons, who won for the 15th time in 17 games. Caris LeVert added 14 points and made two key defensive plays down the stretch.\n\n\r\n              Johnson had 29 points and 13 rebounds for Atlanta, which had won four of five. Nickeil Alexander-Walker added 26 points and Onyeka Okongwu scored 20.\n\n\r\n              Neither team led by more than five points until LeVert made it 74-68 with the last basket of the third quarter. \n\n\r\n              Detroit created possessions with relentless pressure on the glass — it had more offensive rebounds than Atlanta had defensive rebounds for much of the game — but gave them back with 22 turnovers in the first three quarters.\n\n\r\n              Alexander-Walker's 3-pointer tied it at 82 with 7:06 to play, but Cunningham's short jumper put the Pistons up 91-89 with 3:21 to go. LeVert forced turnovers on the next two Atlanta possessions. He turned the first one into a layup, and Cunningham hit two free throws on the second.\n\n\r\n              That made it 95-89, but Cunningham missed a 3-pointer, and Johnson and Alexander-Walker hit back-to-back 3s to tie the game with 1:12 left.\n\n\r\n              Cunningham's jumper made it 97-95, and Alexander-Walker missed at the other end. Cunningham then converted a reverse layup in traffic with 17 seconds to play.\n\n\r\n              Alexander-Walker made another 3-pointer to make it 99-98 with 1.2 seconds left. Daniss Jenkins missed two free throws, and the Hawks called a timeout with 0.1 seconds left.\n\n\r\n              Up next\r\n              Hawks: Host the Los Angeles Clippers on Wednesday.\n\n\r\n              Pistons: Visit the Milwaukee Bucks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042728.17072
}