{
  "game_id": "0021500903",
  "espn_id": "400828790",
  "date": "Mar 02, 2016",
  "matchup": "MIL vs. IND",
  "headline": "Hill scores 19, Pacers survive rally, beat Bucks 104-99",
  "body": "MILWAUKEE --  Rodney Stuckey got hot right when the Indiana Pacers needed it.\n\nAfter collecting just three points through the first three quarters, Stuckey scored 12 straight in the fourth to extend Indiana's lead to double digits over the Milwaukee Bucks on Wednesday night. Stuckey's outburst came right after Milwaukee's Greg Monroe had scored 11 straight to start the quarter and cut Indiana's lead to six.\n\nThe Pacers survived a last-minute rally to defeat the Bucks 104-99 to end a three-game losing streak.\n\n\"I just saw lanes where I could be aggressive and attack the basket and shoot the ball when I was open,\" said Stuckey, who finished with 15 points. \"Coach is giving me plays. I made some shots, so I felt good.\"\n\nJordan Hill had 19 points and Paul George had 15 and a game-high 10 rebounds for Indiana, which had seven players score in double figures.\n\nStuckey was part of an Indiana bench that outscored Milwaukee's 47-27. The bench scored 21 of the Pacers' 31 fourth-quarter points.\n\n\"They were great. They were the group that kind of helped us get out in front,\" Indiana coach Frank Vogel said.\n\nKhris Middleton had 23 points to pace the Bucks, who have lost three of four. Giannis Antetokounmpo added 22 and Jabari Parker 18 for Milwaukee.\n\nThe Bucks rallied late. Jerryd Bayless was fouled as he made a slashing layup with 16.4 seconds. His free throw cut Indiana's lead to three. George missed two free throws with 14.9 remaining. After a timeout, Middleton's 3-point attempt clanked off the rim with 5.9 seconds left.\n\nSolomon Hill hit two free throws to give Indiana a five-point margin and seal the win.\n\n\"We kept making runs all game. We just couldn't get over the hump,\" Middleton said.\n\nThe teams were tied at 22 after a sloppy first quarter, with Milwaukee committing six turnovers. Indiana opened the second quarter on a 14-2 run and held a 49-39 lead at the half.\n\nIndiana extended its lead to 18 midway through the third with an 11-3 run. The Pacers' lead grew to 19 before the Bucks went on 12-0 run, which started with three consecutive baskets by Parker, who was coming off a career-high 36-point game against Houston on Monday.\n\nTO THE POINT\n\nAt 6 feet 11 inches, Antetokounmpo is far from a prototypical NBA point guard, but coach Jason Kidd continues to rely on the third-year player to handle playmaking duties. \"You can see that his leadership skills are starting to come out.\" At his height, Antetokounmpo sees different passing lanes, Kidd said. \"He has that skill of being able to find guys.\" Pacers coach Frank Vogel applauded the move. \"It's a smart use of their talent and their ability,\" Vogel said.\n\nMUCH IMPROVED\n\nVogel had high praise for veteran center Ian Mahinmi, who is averaging career highs in minutes, rebounds and points in his eighth NBA season. \"Ian has to be in the conversation for Most Improved (Player),\" Vogel said. \"He's had a great offensive year to go with what I feel is being one of the best and most versatile defensive centers in the NBA.\"\n\nTIP-INS\n\nPacers: Pacers: G/F C.J. Miles missed his sixth game in a row with a strained left calf. Miles didn't accompany the team to Milwaukee. ... Indiana will travel to Milwaukee again for an April 13 matchup, the final of the four regular-season meetings between the teams.\n\nBucks: PG Michael Carter-Williams missed a second consecutive game with patella tendinitis. Carter-Williams has been unable to practice, coach Jason Kidd said. \"Hopefully in the next day or so we can get him back on the (practice) court and see how he's feeling.\" ... Kidd said the Bucks received a call from the league office about the length of time Antetokounmpo had been taking to shoot free throws. \"When the league makes that call, you've got to make that adjustment or you are going to get embarrassed. He made the adjustment,\" Kidd said.\n\nUP NEXT\n\nPacers: At Charlotte on Friday night.\n\nBucks: Host Minnesota on Friday night",
  "source": "espn_api",
  "crawled_at": 1764994024.901556
}