{
  "game_id": "0021900299",
  "espn_id": "401160941",
  "date": "Dec 03, 2019",
  "matchup": "DET @ CLE",
  "headline": "Griffin, Pistons pound Cavs 127-94 for 1st winning streak",
  "body": "CLEVELAND --  The Detroit Pistons are suddenly on a roll.\n\nBlake Griffin scored 24 points, Andre Drummond had 17 points and 14 rebounds, and the Pistons routed the Cleveland Cavaliers 127-94 Tuesday night to win consecutive games for the first time this season.\n\nThe Pistons thumped San Antonio 132-98 on Sunday and put together another dominant performance, shooting 54% and hitting 18 of 35 3-point attempts.\n\n\"We're building it, we're getting better,\" coach Dwane Casey said. \"We're not there yet, but we're getting closer.\"\n\nGriffin played just 24 minutes and was 8 of 13 from the field, including 6 of 7 from deep. Drummond played 31 minutes as Detroit's starters were on the bench for the fourth quarter.\n\nGriffin scored 16 points in the first quarter with four 3-pointers. The 6-foot-10 forward missed training camp and the first 10 games of the season with a hamstring injury.\n\n\"He didn't have an exhibition season, so he's still getting his sea legs under him and is playing his way back into shape,\" Casey said.\n\nGriffin was called for traveling after Detroit won the opening tip but hit a 3-pointer a minute into the game.\n\n\"I don't think we've called the first play of the game for me all season, but that's OK,\" he said with a smile. \"It's not how I really get into it. I just do my thing and take what they give me.\"\n\nDetroit hit 10 3-pointers in the first half and built a 57-38 lead, a margin that steadily grew and reached 35 in the fourth quarter.\n\nCleveland has lost 10 of 11. The Cavaliers were coming off a loss to Milwaukee in which they cut a 22-point margin to three late in the game.\n\n\"It's really a tough one for us,\" Cleveland forward Kevin Love said. \"We were pretty happy with most of the game last game and how we played. Tonight we came out and laid an egg.\"\n\nCollin Sexton scored 22 points, and Tristan Thompson had 10 points and 14 rebounds.\n\nCleveland coach John Beilein removed all five of his starters late in the third quarter with the Cavaliers trailing 87-60. Cleveland's starters returned in the fourth quarter, but the lead reached 111-76 midway through the period.\n\nThe Cavaliers had a 15-0 run to go ahead 28-24 late in the first quarter, but Detroit outscored Cleveland 38-18 over the final 13:25 of the half.\n\nSvi Mykhailiuk scored 15 points for Detroit, which had six players in double figures. Langston Galloway had 14.\n\nTIP-INS\n\nPistons: Detroit is 2-9 on the road. ... The Pistons and Cavaliers played for the first time this season and will meet three times in January.?\n\nCavaliers: Cleveland didn't shoot a free throw until the 2:29 mark of the second quarter when it trailed 59-40. ... Rookie G Dylan Windler, who has been out all season with a stress reaction in his left leg, is expected to play for Canton of the G League on Thursday. Windler, the 26th pick in the draft, practiced with the Cavaliers on Sunday and Monday.\n\nINJURY UPDATE\n\nThe Pistons announced point guard Reggie Jackson, who has missed the last 19 games because of a stress reaction in his lower back, is showing progress in his recovery and will be re-evaluated in two weeks. Jackson, who played in all 82 games last season, was injured against Atlanta on Oct. 24.\n\n\"That is encouraging news,\" Casey said. \"Bruce (Brown) has done a good job treading water at point guard after being a forward in college, but we're looking forward to getting Reggie back.\"?\n\nFAMILIAR TERRITORY\n\nBeilein coached against the Pistons for the first time since leaving Michigan and taking over the Cavaliers job. It was pointed out before the game the Wolverines lost a total of 15 games under Beilein the last two seasons. Cleveland is 5-15 this season.\n\n\"Thanks for reminding me,\" he said with a laugh.\n\nThe Cavaliers have lost four of five on a homestand that ends Friday against Orlando.\n\nUP NEXT\n\nPistons: Host Milwaukee on Wednesday. The Pistons are 0-9 against the Bucks over the last two seasons.\n\nCavaliers: Host Orlando on Friday. The Magic makes its second visit to Cleveland in a 10-day span, having won 116-104 on Nov. 27.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996295.967575
}