{
  "game_id": "0022400437",
  "espn_id": "401705003",
  "date": "Dec 29, 2024",
  "matchup": "IND @ BOS",
  "headline": "Haliburton scores 31 points as Pacers rebound from 37-point loss to Celtics by winning rematch",
  "body": "BOSTON -- — Tyrese Haliburton scored 31 points and the Indiana Pacers rebounded from a 37-point loss to Boston two nights earlier by beating the Celtics 123-114 on Sunday night in the rematch.\n\n\r\n              Andrew Nembhard, who returned after missing Friday’s game with tendinitis in his left knee, added 17 points, eight rebounds and eight assists for the Pacers. Pascal Siakam chipped in with 17 points and Bennedict Mathurin had 14.\n\n\r\n              Jaylen Brown led Boston with 31 points and six assists. Jayson Tatum had 22 points, nine boards and six assists. Payton Pritchard added 21 points and Derrick White scored 17.\n\n\r\n              The Celtics lost their sixth game at home already this season. Last season, they went 37-4 at TD Garden during the regular season and 9-2 in the playoffs en route to the NBA championship. \n\n\r\n              Takeaways\r\n              Pacers: Coming off a blowout loss, coach Rick Carlisle wanted to see his team respond by getting off to a physical start. The Pacers went inside instead of setting for jumpers and outscored Boston 66-48 in the paint to make up for the loss of injured forward Obi Toppin (sprained left ankle).\n\n\r\n              Celtics: After coasting to the lopsided win on Friday when they hit 23 3-pointers, they followed that by going only 16 of 54 from beyond the arc while missing starters Jrue Holiday (shoulder injury) and Kristaps Porzingis (sprained left ankle).\n\n\r\n              Key moment\r\n              The Celtics had whittled an 11-point deficit to 105-103 on Tatum’s three-point play with 7:38 to play before the Pacers scored the next 13 points over nearly two minutes to take control.\n\n\r\n              Key stat\r\n              Indiana made 22 free throws to just 16 for Boston.\n\n\r\n              Up next\r\n              The Pacers host the Bucks on Tuesday afternoon, and the Celtics are at home against the Raptors the same day.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998145.8750489
}