{
  "game_id": "0021600924",
  "espn_id": "400900319",
  "date": "Mar 04, 2017",
  "matchup": "MEM @ HOU",
  "headline": "Harden's 33 points lead Rockets over Grizzlies, 123-108",
  "body": "HOUSTON --  James Harden had a simple answer for why the Houston Rockets were so successful in the third quarter against the Memphis Grizzlies on Saturday night.\n\n\"Being aggressive,\" he said. \"That's all.\"\n\nHarden scored 33 points and Clint Capela had 24 to help the Rockets build a big lead in the third quarter and coast to a 123-108 victory over the Grizzlies.\n\nEric Gordon added 18 points and made six of Houston's 18 3-pointers in the victory that tied the season series with the Grizzlies at 2-2.\n\nHouston led by 15 to start the fourth quarter and was up 109-89 after an alley-oop dunk by Capela midway through the quarter. The Grizzlies resorted to intentionally fouling Capela soon after that, but he made 8 of 10 attempts before going to the bench with Houston up by 16 with about 3  1/2 minutes left.\n\nCapela hopes his work on Saturday night will deter teams from using that technique in the future.\n\n\"I hope they know now that I can make free throws,\" he said. \"I'm working on it every day since I got in the NBA and now I see the results. I'm trying to be consistent in what I'm doing.\"\n\nMike Conley had 23 points for the Grizzlies and JaMychal Green added 20.\n\nThe Rockets led by four in the third quarter before using a 13-7 run, with all their points from Harden, to extend their lead to 72-62 midway through the period. Harden, who finished with six 3s, made three 3-pointers in that span and capped it with a dunk.\n\nConley made two free throws after that before Gordon got going, making two 3-pointers in 90 seconds to fuel an 8-2 run which pushed Houston's lead to 80-66.\n\nA layup by Green got the Grizzlies within 10 points late in the third quarter, but Houston wrapped up the period with an 8-3 spurt to make it 93-78 entering the fourth. Gordon started that run with another 3 and Harden capped it with a 3-pointer just before the buzzer.\n\n\"We stopped defending the 3-point line with discipline and it just doesn't take long with them,\" Grizzlies coach David Fizdale said. \"It's really like three or four possessions that can bust a game open for this team and that's what happened.\"\n\nThe Rockets led 55-51 at halftime.\n\nTIP-INS\n\nGrizzlies: Vince Carter played in his 1,329th regular season game on Saturday to tie Moses Malone for 16th in NBA history. ... The Grizzlies made 8 of 28 3-pointers. ... Marc Gasol had 17 points.\n\nRockets: It was Houston's 17th straight game with at least 10 3s. ... Harden had 11 assists to go with his 33 points for his 20th game this season with at least 30 points and 10 assists. ... Nene had 11 points for his fourth straight game in double figures.\n\nBACK-TO-BACK\n\nChandler Parsons, who has been on a minutes restriction all season following multiple knee surgeries, played in back-to-back games for the first time all season after also playing Friday night in Dallas.\n\n\"That's a big step in his progression to be able to play in a back to back,\" Fizdale said.\n\nParsons had two points, two assists and seven rebounds in 19 minutes.\n\nRECORD BOOKS\n\nGordon has made 180 3-pointers in 49 games off the bench this season to set an NBA record. The previous record was 179 set by Mirza Teletovic with the Suns last season in 78 games as a reserve.\n\nUP NEXT\n\nGrizzlies: Host Brooklyn on Monday.\n\nRockets: Visit San Antonio on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995576.031297
}