{
  "game_id": "0022200672",
  "espn_id": "401468827",
  "date": "Jan 18, 2023",
  "matchup": "MEM vs. CLE",
  "headline": "Grizzlies top Cavs, tie team record with 11th win in a row",
  "body": "MEMPHIS, Tenn. -- — Desmond Bane scored 25 points, Ja Morant had 24 and the Memphis Grizzlies won their 11th straight game to match the franchise record, beating the Cleveland Cavaliers 115-114 on Wednesday night.\n\n\r\n              Steven Adams tipped in the winner with 16 seconds left. Adams was in position to tip in a miss by Morant.\n\n\r\n              “(Adams) has been doing what he’s been doing all season . . . manning the boards,” Morant said. “He got us the win.”\n\n\r\n              Dillon Brooks preserved the victory by blocking Garland’s 3-point try at the buzzer.\n\n\r\n              “I just wanted to stay on (Garland),” Brooks said about the closing seconds. “He tried to side-step me and take a jump shot, but I got the block.”\n\n\r\n              Darius Garland led Cleveland with 24 points and 14 assists, Caris LeVert had 23, and Evan Mobley added 18 points and 15 rebounds. Cleveland played without scoring leader Donovan Mitchell because of a strained left groin.\n\n\r\n              “It was really fun out there,” Garland said. “The crowd was into it. We were into it. Everyone was competing at a high level. We just couldn’t get the result we wanted.”\n\n\r\n              Memphis (31-13) tied the franchise record set last season during roughly the same time of year (Dec. 26, 2021, to Jan. 13, 2022). The Grizzlies also scored 115 points or more points for the 11th straight game. \n\n\r\n              The Grizzlies led by seven at the half, but the Cavaliers remained close throughout the third quarter and grabbed the lead, at 91-89, in the closing seconds on a 3-pointer by Lamar Stevens.\n\n\r\n              In the fourth quarter, the Grizzlies built a quick six-point lead after a 3-pointer from Bane, but the Cavs responded with a 9-0 run. It remained close throughout the game’s final seven minutes.\n\n\r\n              “We put ourselves in great position down the stretch,” Cavaliers coach J.B. Bickerstaff said. “They just made one more play than we did.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Cleveland is 13-4 this season when Jarrett Allen has a double-double. He had 14 points and eight rebounds.\n\n\r\n               Grizzlies: Morant went to the locker room late in the first quarter after taking a blow to the back of the neck on a drive to the rim. He returned to the bench a few minutes later and re-entered the game in the second quarter.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Golden State on Friday night.\n\n\r\n              Grizzlies: At Los Angeles Lakers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994198.455111
}