{
  "game_id": "0022401212",
  "espn_id": "401736806",
  "date": "Dec 13, 2024",
  "matchup": "CHI vs. CHA",
  "headline": "Dosunmu and Giddey lead the Bulls past the struggling Hornets 109-95",
  "body": "CHICAGO -- — Josh Giddey had 17 points, nine rebounds and seven assists, and the Chicago Bulls beat the struggling Charlotte Hornets 109-95 on Friday night.\n\n\r\n              Ayo Dosunmu scored 19 points as Chicago bounced back from two straight losses. Coby White added 18 points.\n\n\r\n              Giddey and Dosunmu each hit three 3-pointers for the Bulls, who led almost the entire way, sending the Hornets to their 13th loss in 16 games.\n\n\r\n              Brandon Miller led Charlotte with 21 points, and Mark Williams had 15. Miles Bridges added 14 points and nine rebounds after missing 10 games because of a bruised right knee.\n\n\r\n              Former Bull Taj Gibson got a standing ovation when he checked into the game with about a minute remaining.\n\n\r\n              Takeaway\r\n              Hornets: Though they're getting healthier after being hit hard by injuries, the Hornets can't get star guard LaMelo Ball back soon enough. The NBA's third-leading scorer missed his seventh straight game because of a strained left calf.\n\n\r\n              Bulls: The Bulls were aggressive, took control early and withstood several minor pushes on the way to a rather easy win. \n\n\r\n              Key moment\r\n              Bulls guard Lonzo Ball had the crowd roaring late in the first half when he hustled to track down a loose ball near midcourt and connected with Zach LaVine for a thunderous alley-oop dunk.\n\n\r\n              After Miller hit a 13-footer for Charlotte, Dosunmu drove for a layup. Bridges got called for a technical after missing on a drive. LaVine hit the free throw to make it 59-42 with 18 seconds left but got called for a travel, leading to a floater for Miller at the halftime buzzer that cut the lead to 15.\n\n\r\n              Key stat\r\n              The Bulls blocked a season-high 11 shots, with Jalen Smith matching a career best by rejecting five. He also had 11 points and 11 rebounds.\n\n\r\n              Up next\r\n              The Hornets host Philadelphia on Monday, while the Bulls visit Toronto that night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997088.350969
}