{
  "game_id": "0022400108",
  "espn_id": "401704674",
  "date": "Oct 28, 2024",
  "matchup": "CHI @ MEM",
  "headline": "LaVine, Vucevic key fourth-quarter rally as Bulls defeat Grizzlies 126-123",
  "body": "MEMPHIS, Tenn. -- — Zach LaVine scored 30 points, including 11 in the fourth quarter to key a Chicago comeback as the Bulls defeated the Memphis Grizzlies 126-123 on Monday night.\n\n\r\n              Nikola Vucevic finished with 22 points for the Bulls. Coby White scored 20 and Josh Giddey finished with 12 points, eight assists and 13 rebounds, including a key offensive rebound in the final seconds.\n\n\r\n              Desmond Bane led Memphis with 30 points, making 11 of 19 shots, including 6 of 10 from 3-point range. Jaren Jackson Jr. had 19 points, while Jake LaRavia finished with 17 points, and Scotty Pippen Jr. had 14 points and 10 assists.\n\n\r\n              The Bulls led 126-123 after Giddy split a pair of free throws with 8.9 seconds left. Memphis had the last shot, but Bane's 3-point attempt was off the mark.\n\n\r\n              Takeaways\r\n              Bulls: Chicago used a fourth-quarter rush starting with about nine minutes left. After trailing by as many as 20, Chicago was able to overtake Memphis outscoring the Grizzlies 33-23 in the fourth quarter.\n\n\r\n              Grizzlies: Memphis continues to squander leads in the third quarter. At one point in the period, the Grizzlies held a 15-point lead. But as they had in previous games, they gave up a big run to let the Bulls back into the game.\n\n\r\n              Key moment\r\n              The Bulls were trailing 106-98 when LaVine and Vucevic returned to the floor with about nine minutes left. That started Chicago's comeback. The Bulls would outscore Memphis 22-6 over the next four minutes, capped by a 3-pointer by LaVine. That was enough for Chicago to hold on for the victory.\n\n\r\n              Key stat\r\n              Both teams have had trouble early in the season holding onto the ball. But the Bulls committed only nine turnovers, and Memphis had 10.\n\n\r\n              Up next\r\n              Chicago entertains Orlando on Wednesday. Memphis plays at home against the Nets on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997118.773959
}