{
  "game_id": "0021800223",
  "espn_id": "401070904",
  "date": "Nov 16, 2018",
  "matchup": "MIL vs. CHI",
  "headline": "Bucks use huge second half to rout Bulls 123-114",
  "body": "MILWAUKEE --  Milwaukee Bucks coach Mike Budenholzer was seething over what he perceived as a lackadaisical effort in the first half Friday night and unloaded on his team at halftime.\n\nMessage delivered.\n\nEric Bledsoe scored 25 points, Khris Middleton and Giannis Antetokounmpo each added 23 points and the Bucks erased a 22-point deficit and beat the Chicago Bulls 123-104.\n\nIt was the Bucks' largest comeback win of the season and they tied the second-largest halftime deficit overcome in franchise history.\n\nAntetokounmpo described his coach's demeanor behind closed doors.\n\n\"He was mad,\" Antetokounmpo said. \"He was really upset. Coach came in and let us know that we weren't putting enough effort and energy into the game.\"\n\nAntetokounmpo, Bledsoe and Middleton responded with a much better second half.\n\nDown 63-45 at the half, the Bucks outscored the Bulls 46-17 in the third quarter.\n\nAntetokounmpo's dunk capped a 31-11 surge and gave the Bucks their first lead since the opening minute at 76-74 with 3:22 left in the quarter. Bledsoe had 14 points, Middleton 11 and Antetokounmpo nine to help Milwaukee take a 91-80 lead into the fourth.\n\nMilwaukee started the season 7-0, but has alternated wins and losses over the last nine games The Bucks lost to Memphis 116-113 on Wednesday night.\n\nJabari Parker and Justin Holiday, who led the Bulls to the big first-half lead, went cold in the third. Each had a basket and nobody else stepped up to stop the blowout. Parker scored 17 of his season-high 21 points, and Holiday added 18 of his season-high 20 in the first half.\n\nHoliday knew exactly how their lead evaporated.\n\n\"The name of the game is to able to play defense regardless of what's happening offensively,\" he said. \"Defensively, we didn't do our job.\"\n\nMilwaukee never let the lead slip below 12 points in the fourth.\n\nThe Bucks came in leading the NBA in points per game differential and maintained that margin, winning their 11th game by an average of 10.9 points per game.\n\nHoliday was perfect from beyond the arc for Chicago in the first half. He sank all six attempts, three in each quarter. The last one just before the end of the second pushed the Bulls' lead to 63-41.\n\nParker keyed the Bulls' first quarter with 15 points, five off his season-high. He hit three 3-pointers and a pullup jumper that capped an 11-2 surge for a 16-point lead at 35-19. The Bulls' scrappy defense forced seven turnovers good for 15 points.\n\nTIP-INS\n\nBulls: F Lauri Markkanen (right elbow sprain) has increased his workload during practice. Head coach Fred Hoiberg said Markkanen, who missed his 15th game, was one to two weeks away from possibly returning to action.\n\nBucks: F Thon Maker could see more playing time with C John Henson (left wrist ligament) out indefinitely. Guards Matthew Dellavedova and Sterling Brown could be called upon with G Donte DiVincenzo (left quadriceps strain) out for the next three games.\n\nMEDICAL UPDATES ON BUCKS HENSON, DiVINCENZO\n\nC John Henson tore a left wrist ligament at Portland on Nov. 6, then played the next three games before reporting new discomfort Wednesday night against the Memphis Grizzlies. An evaluation confirmed the injury. Surgery is scheduled for the near future. He was averaging 5.6 points, 5.1 rebounds and an assist in 13.5 minutes per game.\n\nRookie G Donte DiVincenzo suffered a minor left quadriceps strain against the Grizzlies. He is expected to miss three games before being re-evaluated. In 14 games, he is averaging 6.4 points, 3.1 rebounds and 1.8 assists in 18.1 minutes per game.\n\nSTAT LINES\n\nChicago converted 17 Bucks' turnovers into 30 points. Milwaukee forced 12 miscues for 13 points.\n\nThe Bucks scored 52 points in the paint to the Bulls' 38.\n\nUP NEXT:\n\nBulls: Host Toronto on Saturday night.\n\nBucks: Host Denver on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994522.7437508
}