{
  "game_id": "0021900375",
  "espn_id": "401161017",
  "date": "Dec 13, 2019",
  "matchup": "CHA @ CHI",
  "headline": "Hornets use balanced scoring to beat Bulls 83-73",
  "body": "CHICAGO --  The Charlotte Hornets weren’t sharp offensively, yet a couple of timely scoring bursts and solid defense helped them to win again.\n\nDevonte’ Graham scored 16 points, Miles Bridges and P.J. Washington each had 13 and the Hornets bounced back after squandering an early 15-point lead, beating the Chicago Bulls 83-73 on Friday night for their third straight victory.\n\n“The term we keep using is resiliency,” Charlotte coach James Borrego said. “These guys, we just keep bouncing back. We don't hang our heads. We just keep playing.\"\n\nThe Hornets bounced back twice in this one.\n\nAfter the Bulls rallied with 15 straight points to tie it at 44-all early in the third quarter, Charlotte responded with eight straight.\n\nCharlotte led 59-50 after a sloppy third quarter, but Kris Dunn’s jumper with 5:25 left in the fourth cut Charlotte’s lead to 66-64. Then, Terry Rozier and Graham hit back-to-back 3s to give the Hornets some breathing room and they held on.\n\nIt was the lowest offensive output of the season for both teams. Charlotte’s previous low was 87 points against Boston on Nov. 7. Chicago‘s low was 84 against Toronto on Oct. 26.\n\nThe Bulls’ point total was the lowest in the NBA this season.\n\nCharlotte shot 38% from the floor, but the Bulls were even worse at 30% in a choppy game between sub-.500 teams. Bismack Biyombo had 12 points for the Hornets.\n\nThe Hornets outrebounded the Bulls 60-45, including 49 defensive boards to 34 for Chicago.\n\n\"We had probably one of our best rebounding games,” Biyombo said. “And defensively, we were playing attention to detail. So, overall, it was a great game for us.\"\n\nZach LaVine and Ryan Arcidiacono each had 12 points, Thaddeus Young and Lauri Markkanen added 10 apiece as Chicago lost for the fourth time in five games.\n\n“It seemed like an 80s game, we just couldn’t score” LaVine said. “We didn’t let our bad offense affect our defense.”\n\nThat was one thing Bulls coach Jim Boylen said he liked after his team hit only 27 of 90 shots from the floor.\n\n“Our defense was so good even though we were in transition 63 times,” Boylen said. “Think about it, 63 missed and our defense was still was where it was at. I am proud of that part of it.”\n\nCharlotte led 24-15 after the first quarter as Biyombo scored eight points. The Hornets shot 40% in the period, and the Bulls missed on their first seven attempts from the floor, shooting only 28% for the quarter and allowing Charlotte to establish control early.\n\nThe Hornets picked up the pace in the second quarter and opened a 15-point lead at 44-29 on Rozier’s finger-roll layup with 2:53 left.\n\nBut the Bulls reeled off 11 straight points to close to 44-40 at the half. LaVine scored eight points in the quarter, including a running dunk with 27.3 seconds left.\n\nMarkkanen hit a 3-pointer 14 seconds into the third and Dunn sank a free throw 39 seconds later to extend Chicago’s run to 15-0 for a tie at 44-all.\n\nCharlotte then countered with eight straight points to restore its lead at 52-44.\n\nTIP-INS\n\nHornets: Nicolas Batum sat out his second game (left hand injury discomfort) and Marvin Williams missed his fourth for right knee soreness. Malik Monk returned after missing Wednesday’s game at Brooklyn with an injured finger.\n\nBulls: Young entered averaging 21.6 minutes and nine points, his lowest numbers in both categories since his rookie season of 2007-08 with Philadelphia. He played 26:33 in this one. The 31-year-old forward signed a three-year, $41 million deal with Chicago in July after three seasons with Indiana, where he averaged 30.7 minutes last season.\n\nLEADING AGAIN\n\nGraham led all scorers for a second straight game, but it was quite a drop from his career-high 40 on Wednesday at Brooklyn when the Hornets rallied from a 20-point deficit to beat the Nets 113-108.\n\nSITTING OUT\n\nWhile Young got more time and points in this one, Markkanen played 25 minutes, 34 seconds and sat nearly 15 minutes in the second half. The 22-year-old Finn entered playing an average of 29.9 minutes.\n\nUP NEXT:\n\nHornets: At Indiana on Sunday\n\nBulls: Host the Los Angeles Clippers on Saturday ahead of a four-game trip.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996084.1255639
}