{
  "game_id": "0021600357",
  "espn_id": "400899799",
  "date": "Dec 11, 2016",
  "matchup": "OKC vs. BOS",
  "headline": "No triple-double, but Westbrook leads Thunder past Celtics",
  "body": "OKLAHOMA CITY -- Russell Westbrook's triple-double streak ended at seven games, but he finished the night with two things that meant more to him -- a win and his long-lost shooting stroke.\nWestbrook scored 23 of his 37 points in the second half to help the Oklahoma City Thunder defeat the Boston Celtics 99-96 on Sunday. He had 12 rebounds but only six assists, ending the NBA's longest triple-double run since Michael Jordan had seven straight in 1989.\nWestbrook hadn't been satisfied. He shot just under 38 percent during the streak, and said after Friday's loss to Houston that it bothered him. Against the Celtics, he made 14 of 26 shots and finally found his rhythm.\n\"Just taking shots I wanted to take, that was the most important part,\" he said. \"And playing from the block. That's the most important part. I talked to my dad this morning, and he got on me about not using that to my advantage, and I definitely tried to do more of that tonight.\"\nWestbrook wasn't worried about the streak ending.\n\"Honestly, I'm just happy we won tonight,\" he said. \"That's the most important thing. As a player, I always try to look forward. Maybe at the end of the season, I can talk about it, but as of right now, my job is to move forward and get ready for Portland.\"\nSteven Adams scored 16 points on 7-for-8 shooting and Enes Kanter added 14 points for the Thunder, who have won seven of eight. Oklahoma City got away with making just 14 of 27 free throws.\nAl Horford scored 19 points, and Jae Crowder and Avery Bradley each added 18 for the Celtics.\nThe Celtics controlled most of the first half and led 43-39 at halftime. It was Oklahoma City's lowest-scoring first half of the season.\nThe Celtics led by 13 in the third quarter, but the Thunder whittled their deficit to four by the end of the period.\nWestbrook made a driving layup with 30.6 seconds left to give the Thunder a 96-94 lead. Westbrook then won a jump ball with Bradley to start a fast break, and Jerami Grant finished it with a dunk that put Oklahoma City up 98-94 with 14.4 seconds to play.\nMarcus Smart scored in close for Boston to make it 98-96. Westbrook made the first of two free throws with 5.1 seconds left to leave the door open, but Smart's 3-pointer for the tie bounced away as time expired.\n\"I think we just stopped moving the ball,\" Bradley said. \"We took some bad shots. We weren't able to score the ball. If we continued to play the way we had, we could have made it easier on ourselves.\"\n---\nTIP-INS\nCeltics: G Isaiah Thomas missed his third straight game with a strained right groin. He averages 26 points per game. ... Smart, who played college ball at Oklahoma State, got his eighth start of the season. He finished with 11 points, nine assists and six rebounds. ... Crowder fouled out.\nThunder: Westbrook was issued a technical foul in the second quarter. ... The Thunder missed their first 16 3-pointers and finished 3 for 21. ... Coach Billy Donovan was called for a technical foul midway through the third quarter.\nINJURY UPDATE\nThunder guard Victor Oladipo left the game for good after spraining his right wrist on a hard fall with 5.2 seconds left in the first quarter. He leaped to challenge a shot by Jonas Jerebko and fell onto Jerebko's shoulder and back on the way down, causing him to lose control of his landing.\nSTAT LINES\nAdams has made 15 of 17 field goal attempts and 10 of 14 free throws over the past two games, with averages of 20 points and nine rebounds.\nUP NEXT\nThe Celtics visit San Antonio on Wednesday.\nThe Thunder play at Portland on Tuesday.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995311.543353
}