{
  "game_id": "0022300708",
  "espn_id": "401585336",
  "date": "Feb 04, 2024",
  "matchup": "MIA vs. LAC",
  "headline": "Kawhi Leonard scores 25, Clippers top Heat 103-95 for 25th win in last 30 games",
  "body": "MIAMI -- — The Los Angeles Clippers have been on the road for nearly two weeks, forced from their home building because of the Grammy Awards.\n\n\r\n              It hasn't slowed the Clippers down whatsoever.\n\n\r\n              Kawhi Leonard had 25 points and 11 rebounds, James Harden scored 16 of his 21 points in the second half and the Clippers remained red-hot by topping the sliding Miami Heat 103-95 on Sunday night. They improved to 5-1 on their seven-game, 11-day trip that ends Monday night in Atlanta.\n\n\r\n              “You get those mental blocks at this stage but we've been staying afloat,” Leonard said. “Appreciate everybody coming out and playing and staying locked-in. Those are the things that I'm happy about.”\n\n\r\n              The Clippers are more than “staying afloat.” They are 25-5 since the start of December — by far the best record in the NBA over that span. Harden flirted with a triple-double, finishing with 11 assists and eight assists. Norman Powell scored 16 points and Paul George added 11 for the Clippers.\n\n\r\n              “It's just having that mindset that we're going to try to win every game,” Clippers coach Tyronn Lue said. “I give guys credit. They've been doing that. We have a lot of talent. We have a lot of guys willing to sacrifice to do whatever it takes to win, and that's what we did.”\n\n\r\n              Jimmy Butler scored 21 points and Terry Rozier finished with 17 for the Heat, who fell to 2-8 in their last 10. Bam Adebayo and Josh Richardson each had 14 points for Miami.\n\n\r\n              “We have to figure out how to make it flow,” Adebayo said. “You have to make it flow or it's not going to work. ... We've been in worse situations.”\n\n\r\n              Adebayo grabbed 13 rebounds and Caleb Martin scored 11 points for Miami, which played without its two best 3-point shooters. Duncan Robinson remains in the NBA's concussion protocols and Tyler Herro was slated to start Sunday, then was a very late scratch after being diagnosed with a migraine.\n\n\r\n              Miami was held under 100 points for the 12th time this season. The Heat are 2-10 in those games; only Portland and Charlotte have more such games this season.\n\n\r\n              “There are some things offensively you can do with better pace and better intention,\" Heat coach Erik Spoelstra said. \"That’s not exclusive to us. And we’ll work on that and we’ll get better.”\n\n\r\n              The teams combined for seven first-half fouls, the fewest in any NBA game this season. The 43 points was a season-low for the Clippers and tied the third-fewest by halftime for the Heat. And the 86 combined points by the break was the sixth-fewest out of more than 700 games played so far this season.\n\n\r\n              But the second half saw every offensive number tip the Clippers' way. They shot 50% to Miami's 42%, outscored the Heat 27-12 from the 3-point line and were 17 for 20 from the foul line — compared with Miami's 6 for 6.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Atlanta on Monday night.\n\n\r\n              Heat: Host Orlando on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995351.208596
}