{
  "game_id": "0022000983",
  "espn_id": "401307786",
  "date": "May 04, 2021",
  "matchup": "PHX @ CLE",
  "headline": "Booker scores 31, Suns dominate OT to beat Cavs 134-118",
  "body": "CLEVELAND -- — Not themselves for long stretches and struggling with a team going nowhere, the Suns finally showed up in overtime.\n\n\r\n                    Did they ever.\n\n\r\n                    “We stayed the course,” Chris Paul said. “We came out and put the game away.”\n\n\r\n                    Devin Booker scored 31 points, Paul added 23 and 16 assists and Phoenix scored the first 15 points of OT to outlast the under-manned Cleveland Cavaliers 134-118 for their fifth straight win, keeping the Suns even with Utah atop the Western Conference standings.\n\n\r\n                    Mikal Bridges made two 3-pointers, dunked, had a block and assist in the opening minutes of overtime and Phoenix outscored Cleveland 20-4 in the extra five minutes.\n\n\r\n                    “We punched them first, jumped out to that lead and kept going,” said Bridges, who scored 22 and made four 3-pointers.\n\n\r\n                    The Suns (47-18) are tied with Jazz for the West's best record.\n\n\r\n                    Phoenix let a late lead in regulation slip away to Cleveland, which was missing six players, including starting point guard Darius Garland, with injuries but battled one of the NBA's best teams for 50 minutes before wilting.\n\n\r\n                    “We ran out of gas,” said Cleveland coach J.B. Bickerstaff, who only had a seven-man rotation. “Our guys gave us what they had. Phoenix made us pay for some mistakes early in OT.”\n\n\r\n                    Cavs rookie Isaac Okoro scored a season-high 32 points and Collin Sexton 29 for Cleveland, which dropped its seventh straight.\n\n\r\n                    Okoro muscled inside for a layup — on a play the Cavs ran for him out of a timeout — with 24.9 seconds left to tie it 114-all. The Suns had one last chance in regulation, but Booker dribbled himself into a bad situation in the corner and had to force up a long shot at the horn that missed.\n\n\r\n                    Booker opened OT with a bucket and Bridges took it from there.\n\n\r\n                    His first 3 made it 119-114, his dunk put the Suns up seven, and then shortly after swatting away Cedi Osman's drive, Bridges hit his second 3 to make it 129-114.\n\n\r\n                    Ball game.\n\n\r\n                    “He's the consummate team guy,\" Paul said of Bridges. \"When he's going, we go.”\n\n\r\n                    SPECIAL SIGNING \n\n\r\n                    Earlier in the day, Cleveland signed veteran center Anderson Varejão to a 10-day contract, more of a ceremonial move to close his NBA career and celebrate 12 seasons with the Cavs.\n\n\r\n                    Varejão was active but did not dress or play, disappointing some fans who had hoped to see the popular Brazilian get his first action for the Cavs since 2016.\n\n\r\n                    The team played a video during a timeout in the first quarter to welcome back Varejão, who waved to the crowd.\n\n\r\n                    Bickerstaff is confident having Varejão around for even a short period will benefit the team's young players.\n\n\r\n                    “He’s a mentor,\" Bickerstaff said. \"He’s got a wealth of experience and knowledge and he embodies the things that we talk about wanting to be. For him, he can choose to live anywhere in the world. He lives in Cleveland and has made Cleveland his home.\n\n\r\n                    “When I think about how he played the game, we talk about people who compete, we talk about people who are selfless and he was those two things personified.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: F Jae Crowder missed his seventh game with a sprained right ankle. ... Coach Monty Williams said it was “cool” that the Cavs signed Varejão. He noted the center's impact on the game, saying there are coaches who teach the “Varejão screen” to their big men. ... The Suns rank in the middle of the league in 3-point attempts (34.8 per game) and that's fine with Williams. “I'd rather make more 3s than just jack up 3s,” he said. ... Cleveland was the only team Phoenix didn't play last season as two games between the teams were scheduled after the season was suspended in March.\n\n\r\n                    Cavaliers: Sexton reached 4,000 career points in his 200th career game, becoming the fourth-quickest Cleveland player to hit the plateau (LeBron James 166, Austin Carr 190, Kyrie Irving, 193). ... Okoro added a season-best six assists. ... Despite the Cavs falling short of their playoff goal and an assortment of problems, Bickerstaff believes he and his staff have made significant strides in their first full season. They fell a cultural shift is underway. \"It's a place where people want to be and a place other people want to come,” he said. “We're not perfect, but we share the game and compete. We're in Year 1 of something and the foundation has been laid.” \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Continue a rough stretch at Atlanta on Wednesday. Seven of Phoenix's last nine games are on the road.\n\n\r\n                    Cavaliers: Host Portland on Wednesday. The Trail Blazers beat the Cavs by 19 on Feb. 12.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997732.3242009
}