{
  "game_id": "401810077",
  "espn_id": "401810077",
  "date": "Nov 12, 2025",
  "matchup": "OKC vs LAL",
  "headline": "Gilgeous-Alexander scores 30 points as the Thunder beat Doncic and the Lakers 121-92",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 30 points and nine assists in three quarters, and the Oklahoma City Thunder rolled past the Los Angeles Lakers 121-92 on Wednesday night.\n\n\r\n              Isaiah Joe added 21 points for the Thunder, who improved their league-best record to 12-1. \n\n\r\n              Oklahoma City blew out one of its top Western Conference rivals for the second game. It beat the Golden State Warriors 126-102 on Tuesday night.\n\n\r\n              Los Angeles guard Luka Doncic was held to 19 points on 7-for-20 shooting. He was averaging 37.1 points coming into the game.\n\n\r\n              Oklahoma City’s Lu Dort, a defensive stopper who normally guards Doncic, was out with an upper right trapezius strain, and the Thunder got the job done anyway.\n\n\r\n              Austin Reaves, who was averaged 30.3 points, had 13 points on 4-for-12 shooting for the Lakers. Los Angeles had scored at least 116 points in every game this season, but it didn't get close after shooting 40.3% from the field.\n\n\r\n              The Lakers played without LeBron James once again, though he practiced on Wednesday for the first time this season. He got some reps with the team’s G League affiliate earlier in the day in California.\n\n\r\n              Los Angeles could have used another star against Oklahoma City. The Thunder led 30-18 at the end of the first quarter, then held the Lakers without a field goal for nearly eight minutes to start the second. Los Angeles missed its first 11 shots of the quarter as Oklahoma City extended its advantage to 70-38 at halftime.\n\n\r\n              In the closing seconds of the third quarter, Gilgeous-Alexander drove to the hoop, then fired a behind-the-back pass to Joe, who nailed a 3-pointer as time expired in the period to give Oklahoma City a 100-64 lead.\n\n\r\n              Up next\r\n              Lakers: Visit the New Orleans Pelicans on Friday.\n\n\r\n              Thunder: Visit the Charlotte Hornets on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042615.386688
}