{
  "game_id": "0021400410",
  "espn_id": "400578702",
  "date": "Dec 22, 2014",
  "matchup": "CHI vs. TOR",
  "headline": "Derrick Rose and Jimmy Butler lead Bulls' late surge to top Raptors",
  "body": "CHICAGO -- Even surrounded by an array of offensive talent, Derrick Rose proved he is still the go-to guy in Chicago.\nRose scored 29 points, Jimmy Butler added 27 points and 11 rebounds, and the Chicago Bulls snapped the Toronto Raptors' six-game winning streak with a 129-120 victory on Monday night.\nRose scored 15 of the Bulls' franchise-record 49 points in the fourth quarter.\n\"We know we can always count on him, go to him. That's just the type of guy he is,\" Butler said. \"He wants the pressure on him. He produces. He produced. I think we're going to keep on going back to him and he's going to do the same thing every night.\"\nChicago, which has won three straight, got Rose and Taj Gibson back after each missed two games. Rose was ill and Gibson was out with an ankle injury.\n\"I felt good. I was kind of surprised. I wasn't as fatigued as I thought I would be missing a couple of days,\" Rose said.\nRose's jumper over Kyle Lowry put the Bulls up 106-100 with 4:12 left. He put away the game with a 3-pointer to make it 118-105 with 1:17 left.\nThe Eastern Conference-leading Raptors wanted to make a statement in Chicago after losing earlier this season to the Bulls at home.\n\"We've been hearing about it all week, the last couple of days. They wanted to play us, we beat them there and they wanted to come here and get revenge. Tonight I think was a big game for us,\" Rose said.\nLowry scored 34 points and Jonas Valanciunas finished with 20 for Toronto, which led by 12 in the third quarter. Lowry scored 18 points in the fourth.\n\"We didn't play defense and they executed extremely well,\" Lowry said. \"Derrick Rose looked like his old self, and he played extremely well. They executed extremely well. Forty-nine points -- give them credit. Whatever play they called they got good shots, and they got where they wanted to get on the floor. But we didn't give them any pushback. That's one thing we have to make sure we do from now on.\"\nAfter Lowry's runner gave the Raptors a one-point lead, Chicago scored six straight to make it 100-95. Rose and Joakim Noah had back-to-back baskets and Nikola Mirotic capped it off with a pair of free throws before Raptors coach Dwane Casey burned a timeout with the Chicago crowd on its feet.\nMirotic finished with 12 points and Aaron Brooks had 17 points off the bench.\nJames Johnson put the Raptors up 80-68 with 6:35 left in the third quarter, but the Bulls scored eight unanswered to tie it in the final minute of the period. Pau Gasol found Gibson for an alley-oop dunk to tie the game at 80.\nThe Raptors began a six-game road trip on Monday after playing a league-high 17 home games.\nLowry had a follow shot with 0.1 seconds left to give the Raptors a 66-60 lead at the half.\nTIP-INS\nRaptors: James Johnson is making a defensive impact for the Raptors after struggling to get minutes with the Bulls in his first two seasons. \"Like all of us, we get a little older and wiser and smarter,\" Casey said of the five-year veteran. \"Hopefully, that's the case with him, that he's matured.\"\nBulls: Rose played in 10 straight games before getting sick. He's missed 10 games this season with various injuries and illness. \"In Derrick's case, it was good where he was stringing some games together. Unfortunately, he got sick and now we have to hope he can pick up where he left off,\" coach Tom Thibodeau said.\nHE SAID IT\nCasey on Butler: \"I've had a man crush on him for a while now. He's a strong, physical kid and now he's knocking down shots, handling the ball and he's just developed into an all-around, All-Star-type player. He's one of those kids you really admire because he's made a lot of who he was coming out of college. I don't think anybody projected him to be where he is now.\"\nTRAINER'S ROOM\nBulls guard Kirk Hinrich left the game with a strained left hamstring in the second half.\nUP NEXT\nRaptors: Visit the Los Angeles Clippers on Saturday.\nBulls: Visit Washington on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764991702.166665
}