{
  "game_id": "0022400162",
  "espn_id": "401704728",
  "date": "Nov 04, 2024",
  "matchup": "CHA @ MIN",
  "headline": "Naz Reid makes five 3-pointers and scores 25 points to lead Timberwolves to 114-93 win over Hornets",
  "body": "MINNEAPOLIS -- — Naz Reid had 25 points and nine rebounds, and the Minnesota Timberwolves beat the Charlotte Hornets 114-93 on Monday night.\n\n\r\n              Anthony Edwards scored 21 points, while Donte DiVincenzo added 14 and Julius Randle had 13 for Minnesota, which hit 18 of 38 3-pointers (47.4%), while holding Charlotte to 10 for 42 (23.8%) from beyond the arc. Rudy Gobert added eight rebounds and eight points, all on dunks.\n\n\r\n              LaMelo Ball scored 19 points for Charlotte. Miles Bridges, Brandon Miller and Tre Mann each added 10.\n\n\r\n              Takeaways\r\n              Hornets: After winning their season opener, the Hornets have lost five of their last six. They were missing starting center Mark Williams (strained left foot tendon) and backup big man Nick Richards (sore shoulder).\n\n\r\n              Timberwolves: The Wolves led by 28 early in the fourth, allowing first-round draft picks Rob Dillingham and Terrence Shannon Jr. to make their Target Center debuts. Dillingham thrilled the crowd with a pair of flashy one-handed runners, while Shannon missed the only shot he took.\n\n\r\n              Key moment\r\n              Tied at 24 to start the second quarter, Nickeil Alexander-Walker and DiVincenzo hit 3-pointers and Gobert had two dunks in a 13-2 run that put the Timberwolves on top for good.\n\n\r\n              Key stat\r\n              Reid (5 for 7), Edwards (4 for 6), Mike Conley (3 for 5) and DiVincenzo (3 for 6) combined for 15 3-pointers.\n\n\r\n              Up next\r\n              The Hornets return home to host the Pistons on Wednesday. The Timberwolves travel to Chicago to face the Bulls on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997471.3317828
}