{
  "game_id": "0022100942",
  "espn_id": "401360761",
  "date": "Mar 03, 2022",
  "matchup": "TOR vs. DET",
  "headline": "Cunningham has 22 points as Pistons hold off Raptors 108-106",
  "body": "TORONTO -- — Cade Cunningham had 22 points and 12 rebounds, Jerami Grant scored 26 and the Detroit Pistons held off Toronto 108-106 on Thursday night for their sixth straight victory over the Raptors.\n\n\r\n              Saddiq Bey scored 23 points, Hamidou Diallo had 11 and Isaiah Stewart added 10 as the Pistons gave coach Dwane Casey his ninth win in 12 games against the team that fired him in May 2018.\n\n\r\n              Detroit swept the season series from Toronto for the second straight year, the first time the Pistons have done that.\n\n\r\n              “Our chemistry in general is just getting better and better,” Cunningham said. “Our togetherness as a team has really helped us.”\n\n\r\n              Detroit has won four of six after losing the previous eight.\n\n\r\n              “I like the steps we’re taking,” Casey said. “We’re growing.”\n\n\r\n              The Pistons are 7-26 on the road. Three of those victories have come in their past four road games, including wins at Boston and Charlotte.\n\n\r\n              “I like playing on the road a lot, just as much as home,” Bey said. “It’s just a motivation. I like the boos.”\n\n\r\n              Scottie Barnes had 21 points and 10 rebounds, Pascal Siakam scored 28 points, Precious Achiuwa had 18 and Gary Trent Jr. 14 for the Raptors, who have lost three of five.\n\n\r\n              Raptors All-Star guard Fred VanVleet sat for the fourth time in six games because of a sore right knee, forward OG Anunoby missed his fifth straight game because of a fractured right ring finger, and forward Thad Young was out with a non-COVID-19 illness.\n\n\r\n              Toronto trailed 91-79 through three quarters but closed the gap in the fourth. Achiuwa’s 3-pointer with 1:26 remaining made it 106-102 and, after a missed shot by Bey, Siakam’s driving shot made it 106-104.\n\n\r\n              After a timeout, Cunningham missed a 3 and Achiuwa was fouled, but only made his second free throw, cutting the deficit to one. At the other end, Bey’s driving shot gave Detroit a 108-105 edge with 14.2 seconds to go.\n\n\r\n              Cunningham blocked Trent’s shot and Barnes came up short from 3 but Achiuwa was fouled going for the rebound, going to the line with 0.7 seconds to play. He made the first but missed the second as time expired.\n\n\r\n              Toronto shot 7 for 26 from 3-point range. The Raptors went 7 for 23 from long distance in Tuesday’s home win over Brooklyn.\n\n\r\n              Cunningham scored 10 points in the first quarter and Detroit was 5 of 11 from 3-point range to lead 31-22 after one. Grant scored nine points in the second but Barnes had eight for the Raptors, who trailed 60-57 at halftime.\n\n\r\n              Grant and Cunningham each had eight points in the third as Detroit outscored Toronto 31-20 to take a 91-77 lead to the fourth.\n\n\r\n              Raptors coach Nick Nurse was ejected with 2:27 left in the third after picking up two technical fouls for arguing a foul call on guard Dalano Banton.\n\n\r\n              “I saw the replay, which was probably not great for me to see,” Nurse said. “You can only take so much.”\n\n\r\n              Toronto outscored Detroit 34-20 after Nurse’s ejection, but it wasn’t enough.\n\n\r\n              “We appreciated him going to bat for us and fighting,” Siakam said.\n\n\r\n              Detroit shot 13 of its 28 free throws in the third.\n\n\r\n              “I don’t think we were given an opportunity in that third quarter,” Achiuwa said. “That opportunity was taken away from us.”\n\n\r\n              HARD KNOCKS\n\n\r\n              Barnes stayed down briefly after hitting the back of his head on the court after colliding with Stewart on a dunk attempt in the first. Later in the quarter, Siakam went down hard after battling Kelly Olynyk for a rebound. Barnes and Siakam both stayed in the game.\n\n\r\n              BEEN A WHILE\n\n\r\n              Toronto’s last victory over Detroit was a 105-92 road win on Jan. 31, 2020. That win, Toronto’s 10th straight at the time, also clinched All-Star coaching honors for Nurse and his staff at the 2020 showcase in Chicago.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: F Marvin Bagley III (sprained left ankle) missed his third straight game. … G Frank Jackson (back spasms) did not play.\n\n\r\n              Raptors: Nurse said Anunoby is expected to miss two weeks. … Barnes was selected Eastern Conference rookie of the month for February. … Trent shot 0 for 7 in the first quarter. He finished 4 of 23, and went 3 for 15 from 3-point range.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host the Indiana Pacers on Friday night.\n\n\r\n              Raptors: Host the Orlando Magic on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992718.163073
}