{
  "game_id": "0022400718",
  "espn_id": "401705284",
  "date": "Feb 05, 2025",
  "matchup": "CLE @ DET",
  "headline": "Garland's deep buzzer-beating 3-pointer gives Cavs 118-115 win over Pistons",
  "body": "DETROIT -- — Darius Garland hit a 31-foot 3-pointer at the buzzer to give the Cleveland Cavaliers a 118-115 win over the Detroit Pistons on Wednesday night.\n\n\r\n              The Cavaliers, playing without All-Star Donovan Mitchell who missed the game with a shoulder contusion, overcame nine points from Detroit's Cade Cunningham in 11 seconds.\n\n\r\n              Cunningham made it 112-109 with a 3-pointer with 16 seconds left, but Garland hit a free throw to make it a two-possession game.\n\n\r\n              Cunningham made three free throws to pull Detroit within one with 7.3 seconds to go. The Pistons fouled Garland, who made 115-112. Cleveland fouled Cunningham on a 3-point attempt, and he hit all three, tying the game with five seconds left. Garland rushed down the court and hit the winning shot from just inside the center-court logo.\n\n\r\n              Evan Mobley had 30 points for Cleveland and Garland added 25. Cunningham had 38 points, nine assists and seven rebounds.\n\n\r\n              Takeaways\r\n              Cavaliers: Mitchell has missed two other games this season — a 14-point win over the Charlotte Hornets on Nov. 17 and a six-point victory against the Toronto Raptors on Jan. 9. He had 31 points on Tuesday night in a 112-105 loss to Boston.\n\n\r\n              Pistons: Paul Reed was called for a flagrant foul with 10:02 for not allowing Mobley a safe landing place on a 3-point attempt. Mobley hit two of the three free throws and Craig Porter made it a five-point possession and 10-point lead with a 3-pointer.\n\n\r\n              Key moment\r\n              Cleveland outshot Detroit 43.8% to 34.6% in the third quarter, but the Pistons forced seven turnovers and grabbed six offensive rebounds to outscore the Cavaliers 27-21 in the period.\n\n\r\n              Key stat\r\n              Mobley hit a 3-pointer on the first possession of the game and turned it into 20 first-half points. He was 7 of 10 from the floor.\n\n\r\n              Up next\r\n              The Cavaliers visit Washington on Friday night. The Pistons stay home for a Friday night visit from Philadelphia.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998309.875809
}