{
  "game_id": "0021500868",
  "espn_id": "400828755",
  "date": "Feb 26, 2016",
  "matchup": "LAL vs. MEM",
  "headline": "Carter scores 19 for Grizzlies in 112-95 win over Lakers",
  "body": "LOS ANGELES -- If Vince Carter has his way -- as he did Friday night against the Lakers -- there won't be any Kobe Bryant-like farewell tours in his immediate future.\nCarter scored a season-high 19 points and five of his teammates also reached double figures to help the Memphis Grizzlies cruise to a 112-95 victory over Los Angeles.\n\"It's hard to even imagine not playing anymore, because I still love playing,\" said Carter, who turned 39 last month. \"I still have that burning desire. And whenever the body says it's time, then it's time to move on. I don't ever want to disrespect the game and go out there just to play and take the money, because it's not that.\n\"Once you hit that first 12-15 years, everything after is for the love of the game. And that's where I am right now. I'm putting the work in to still compete at a high level.\"\n\nCarter made his first five shots -- all 3-pointers during a 7:48 span -- and finished 7 for 10 from the field in 20 minutes to help the Grizzlies win for the 13th time in 17 games.\n\"I don't know. I was just locked in and trying to do anything I could for the team,\" Carter said. \"I don't know if it makes me feel younger, but it just brings back good memories and shows that I can still do this. The guys are trying to find me, and that makes you feel good.\"\nThe 18-year veteran and eight-time All-Star brought back memories of his \"Vinsanity\" days with the Toronto Raptors, hitting consecutive 3s just 28 seconds apart to give Memphis a 54-38 lead with 6:03 left in the first half.\n\"I had him subbed out for P.J. Hairston, who was waiting to go in. And while the guy was sitting there waiting for a dead ball, Vince made two more to put him at five,\" Grizzlies coach Dave Joerger said with a laugh. \"But he was getting tired. I mean, he gets up for the fifth one, I thought he was like on the way down. It was a double-clutch.\"\nHairston scored 21 points, Mike Conley had 17 points and seven assists, and Zach Randolph added 15 points and 10 rebounds for Memphis.\nBryant sat out because of a sore right shoulder as the Lakers lost their eighth straight and 22nd in 25 games. They got 22 points from rookie D'Angelo Russell in his fourth consecutive start and 26th this season at point guard.\n\"It was one of those days where Kobe just slept wrong and woke up a little sore,\" coach Byron Scott said. \"The last couple of days he's just tried to get that thing as manageable as possible so that he'd feel no pain going into these next two games. I was wondering yesterday how he was going to feel today, but I wasn't 100 percent surprised by it.\"\nThe Lakers, who never led in either of the previous two meetings with the Grizzlies, led in this one for a brief moment -- when Jordan Clarkson opened the scoring with a 5-foot floater.\nThe loss was the Lakers' NBA-worst 33rd by a double-digit margin. The closest team to them in that category is Philadelphia with 27.\n\"It's obvious that we're not on the same page,\" Russell said. \"Sure, at this point, you want to win. But you try to develop stuff that can help you win early next year. The mistakes that we're making now, we have to get it together so that next year we don't make the same mistakes.\"\nLos Angeles has dropped 13 of its last 15 meetings with the Grizzlies and nine in a row since beating them 96-92 on Dec. 17, 2013.\nTwo nights earlier, the Grizzlies beat the Lakers 128-119 at home. In that one, Memphis set a season high for points and scored at least 30 in every quarter for just the third time in the franchise's 21-year history.\nTIP-INS\nGrizzlies: G Tony Allen missed his third straight game because of a sore left knee. ... Matt Barnes, who scored a season-high 25 points against the Lakers on Wednesday, played 29 scoreless minutes in the rematch.\nLakers: The remaining road cities on Bryant's farewell tour are Denver, Phoenix, Utah, New Orleans, Houston and Oklahoma City. Scott said he's more likely to rest Bryant at home than on the road. \"I think it all depends on how he feels,\" Scott said. \"I know his obligation to the fans here at home, and also to the fans on the road that are going to see him for the last time. We still have a bunch of home games left, so I do kind of look at it where he might take a couple of those games off. But when we hit the road and go to Denver, Utah and Phoenix for the last time, I'm pretty sure in his mind that those are three games that he does not want to miss.\"\nUP NEXT\nThe Grizzlies play at Phoenix on Saturday night.\nThe Lakers host Brooklyn on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994258.3645172
}