{
  "game_id": "0021801144",
  "espn_id": "401071817",
  "date": "Mar 30, 2019",
  "matchup": "MEM @ PHX",
  "headline": "Valanciunas' huge night helps Grizzlies overcome Booker's 48",
  "body": "PHOENIX --  Punished by Devin Booker for three quarters, the Grizzlies turned the tables down the stretch.\n\nMemphis pounded the ball inside to Jonas Valanciunas, who took advantage of a physical mismatch to score 14 of his career-high 34 points in the fourth quarter for a 120-115 victory over the Phoenix Suns on Saturday night.\n\n\"I was just doing my thing, going hard and battling in the low post,\" Valanciunas said. \"Playing pick-and-roll with Mike (Conley) is always an advantage for us. I was going hard.\"\n\nConley had 33 points and Valanciunas added 20 rebounds, 11 on the offensive glass, as the Grizzlies worked inside to attack Suns forward Dragan Bender, who was forced to defend the interior when center Deandre Ayton departed with a left ankle sprain late in the third quarter. Backup center Richaun Holmes was out with a migraine.\n\nBooker finished with 48 points, 24 in the first quarter, and fell two points short of becoming the fifth player in NBA history to score at least 50 points in three straight games. He had the ball on the final two Suns possessions but was double-teamed and could not get off a shot.\n\nValanciunas hit two free throws to tie the game at 106 before Conley made a 3-pointer for a lead the Grizzlies never lost. Valanciunas scored 10 points in the final 4 1/2 minutes as the Grizzlies finished on a 16-9 run. They had lost five of seven.\n\n\"We were able to get a few stops in a row,\" Conley said. \"They were scoring at will, especially Devin. Luckily we got some misses and we were able to get down on the other end and really execute offensively.\"\n\nBooker made two free throws for a 106-104 lead with 4:50 remaining, giving him 46 points, but he made one more field goal as the Grizzlies threw double-teams at him over the final few minutes. Booker was 19 of 29 from the field and had 11 assists.\n\n\"At some point, when a guy has 40-plus points, you have to try to change up coverage on him,\" Conley said. \"We tried to send more and more guys at him and try to make him more of a playmaker down the stretch. He is so capable of taking over a game in the fourth quarter.\"\n\nValanciunas went 16 of 28 from the field and added five assists. Justin Holiday had 14 points and Bruno Caboclo had 12.\n\nAyton had 17 points and 13 rebounds for the Suns, who have lost six in a row. He left after rolling his left ankle after contesting Valanciunas' tip-in with 3:03 remaining in the third quarter.\n\nThe Suns led by as many as 18 in the first half, when Booker had 28 points.\n\n\"When I'm on the court, I'm doing everything possible to lead this group to wins,\" Booker said. \"We're undermanned. Deandre gets hurt, we have Dragan at the 5, so he's playing out of position. They played through the mismatch.\"\n\nTIP-INS\n\nGrizzlies: The Grizzlies lost the first game of the season series when Booker hit a jumper with 1.7 seconds remaining in the Suns' 102-100 victory. ... For the last two weeks, the Grizzlies have limited their off days to film study, meetings and shootarounds. \"Everybody is banged up,\" coach J.B. Bickerstaff said. \"We just wanted to see what we could do to rest their legs as much as possible and help guys recover. It's more about being fresh and ready for the games.\"\n\nSuns: Ayton has a team rookie-record 39 double-doubles, two more than Alvan Adams had in 1975-76. . Booker has scored 25 points in 10 straight games, one short of Amare Stoudemire's franchise record. ... F Josh Jackson had 10 points in his first game back after missing three with a right ankle sprain.\n\nBOOK IT\n\nWilt Chamberlain scored at least 50 in three straight 10 times, while Elgin Baylor and Michael Jordan did it once apiece.\n\nKobe Bryant scored 50 in four straight in March 2007, including 65 against Portland. The streak ended when he scored 43 points against Golden State on March 25.\n\n\"There is no right way to guard him,\" Bickerstaff said of Booker. \"There's no shot he can't make.\"\n\nELITE EIGHT\n\nThe Grizzlies (31-45) will lose their 2019 first-round pick to Boston because of an earlier trade if they do not finish with one of the eight worst records in the league, but Bickerstaff said he is not coaching with that in mind.\n\n\"We're going out trying to win basketball games,\" Bickerstaff said. \"Building a foundation, it starts with an expectation of winning. It's hard to turn the page when you just lose and lose and lose. Our message to our guys is, do whatever it takes to win. Go out, play as hard as you can, play as unselfish as you can, and let's build that foundation.\"\n\nThe Grizzlies are half-game ahead of Washington (31-46) for the eighth-worst record. New Orleans is 32-45. Dallas is 29-46.\n\nUP NEXT\n\nGrizzlies: Play at the Los Angeles Clippers on Sunday in the second game of a four-game road trip.\n\nSuns: Host Cleveland on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994891.174248
}