{
  "game_id": "0021501230",
  "espn_id": "400829117",
  "date": "Apr 13, 2016",
  "matchup": "POR vs. DEN",
  "headline": "Playoff destination sealed, Blazers beat Nuggets 107-99",
  "body": "PORTLAND, Ore. -- The Trail Blazers' third straight playoff appearance is all the sweeter for Damian Lillard because few thought Portland would come this far.\nThe Blazers clinched the fifth spot in the Western Conference on Wednesday night and will face the Los Angeles Clippers in the first round of the playoffs.\n\"Coming into this year, they didn't give us a chance, know what I mean?\" said Lillard, the lone starter from last year's team still on the roster. \"The fact that we found our way back to the fifth spot, it makes is that much more special.\"\nLillard had 21 points before sitting in the final quarter and the Blazers, with their playoff fate sealed earlier in the night, defeated the Denver Nuggets 107-99 to wrap up the regular season.\n\nCJ McCollum added 17 points for the Blazers, who led by 18 points in the final quarter despite putting all of their starters on the bench.\n\"We wanted to play well heading into the playoffs,\" forward Ed Davis said. \"We took it seriously and we tried to win. And some guys got some opportunities tonight, so that's a good thing.\"\nThe Trail Blazers were assured of the fifth seed by virtue of Dallas' 96-91 loss to the San Antonio Spurs. The Blazers will open the playoffs in Los Angeles on Sunday night.\nPortland has never faced the Clippers in the postseason.\nThe fans roared at the Moda Center when the Dallas result was announced just before tipoff, and McCollum addressed the crowd: \"When they doubted us, you didn't. So thank you.\"\nHe punctuated the sentiment: \"Let's get ready for the playoffs!\"\nEmmanuel Mudiay finished with 25 points to lead five Nuggets in double figures. Denver finished the season 33-49 and in 10th place in the West, improving by three games over last year's win total.\nCoach Michael Malone, asked to assess his feeling about the Nuggets' finish, said: \"Not happy. Not satisfied. But encouraged.\"\nThe Nuggets jumped out to 31-27 in the first quarter, capped by Nikola Jokic's 3-pointer. Jokic led all scorers with 11 points in the quarter. Jokic had 18 points and 13 rebounds for the game, his 16th double-double of the season.\nAllen Crabbe's 3-pointer put Portland up 35-34 and the Blazers went on to hold a slim 58-56 lead at the break. Crabbe finished the game with 16 points.\nPortland stretched the lead to 81-70 lead in the third quarter on CJ McCollum's layup.\n\"It's been a long season,\" Mudiay said. \"We had to take our lumps.\"\nThe Blazers could have locked up their playoff fate earlier, but they fell 106-105 loss to the Minnesota Timberwolves on Saturday, sealed with Karl-Anthony Towns' hook shot with 1.8 seconds left.\nTIP INS\nNuggets: Malone praised the development of G Will Barton, who was playing in his first season with the Nuggets after three seasons with Portland. Barton ranks third in the league among reserves. \"He's been a spark plug off the bench for us all season,\" Malone said. ... Denver was without Darrell Arthur (knee) and C Joffrey Lauvergne (back).\nTrail Blazers: Owner Paul Allen and the fans gave the Blazers a standing ovation after the final buzzer... Lillard averaged 25.1 points in the regular season, while McCollum averaged 20.8 -- making them the first backcourt in Blazers' history to average 20 or more points apiece. ... Lillard is the first Blazer to average 25-plus points, joining Clyde Drexler and Kiki Vandeweghe.\nMOST 3s\nLillard hit his 827th 3-pointer, besting Wesley Matthews' Portland franchise record of 826.\n\"The fact that he leads the franchise in 3s after four seasons is remarkable,\" Portland coach Terry Stotts said.\n\"It's an honor,\" Lillard said. \"I've been here four years now, and it came a lot quicker than I would have called. But it's an honored to be a part of that list.\"\nUP NEXT\nThe Nuggets are finished for the season.\nThe Trail Blazers open the first round of the playoffs at the Los Angeles Clippers on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994494.512448
}