{
  "game_id": "0022100517",
  "espn_id": "401360336",
  "date": "Dec 29, 2021",
  "matchup": "CHA @ IND",
  "headline": "Hornets take charge early, hold on late to beat Pacers",
  "body": "INDIANAPOLIS -- — Terry Rozier scored a season-high 35 points, LaMelo Ball added 21 points and 12 rebounds, and the Charlotte Hornets beat the Indiana Pacers 116-108 on Wednesday night.\n\n\r\n              Ball also had nine assists, falling just short of his third triple-double this season and the fourth of his career. The Hornets won their third straight overall and fifth in a row in the series, including all three matchups this season.\n\n\r\n              Rozier was 13 of 23 from the field, 5 of 9 on 3-poiners and helped close it out from the free-throw line.\n\n\r\n              \"We got off to a good start, need to continue to do that,\" Rozier said. “The game is all about runs, and it's just all about how you respond, and I thought we responded well. We made some big shots down the stretch, took care of the ball, and that was the most important part.\"\n\n\r\n              The problem for Indiana was another slow start.\n\n\r\n              While Caris LeVert scored 27 points and Domantas Sabonis posted his 25th double-double this season with 15 points and 18 rebounds, Indiana lost for the fifth time in seven games and for the second straight time after facing an early double-digit deficit. Sabonis also had seven assists.\n\n\r\n              Charlotte never trailed after taking control with an early 15-3 run and then extending the margin to as much as 18 in the first half. They kept the Pacers at arm's length most of the rest of the game.\n\n\r\n              \"They hit a couple of 3s down the stretch, but every shot was contested, so it’s really built on our defense,” Charlotte coach James Borrego said.\n\n\r\n              Though Indiana cut the halftime deficit to 71-57 and closed to 73-63 with a quick flurry to open the third quarter, the Pacers didn't get closer than 10 until Kelan Martin and Oshae Brissett made 3-pointers to pull Indiana within 87-82 in the final minute of the third.\n\n\r\n              Indiana got as close as four several times in the fourth quarter but never made it a one-possession game. Rozier helped the Hornets close it out from the free-throw line.\n\n\r\n              “The first half was poor, really. Nine turnovers, gave up 71 points, just not good enough,\" Pacers coach Rick Carlisle said. “I loved how we played in the second half, but for us it's about playing 48 (minutes).\"\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Rozier made five 3s and has at least four in a career-high five straight games. ... Gordon Hayward scored 18 points in his hometown. ... Jalen McDaniels finished with 12 points, a career-best fifth straight double-digit game. ... Charlotte shot 59.1% from the field in the first half, 51.8% for the game. It is 10-0 when making at least 50%. ... The Hornets' three wins against Indiana this season have come by a total of 12 points.\n\n\r\n              Pacers: Keifer Sykes, a 27-year-old rookie out of Green Bay, made his NBA debut in the first quarter. He did not score. ... Myles Turner had 14 points and four blocks. ... Brissett also scored 14 points. ... LeVert was 4 of 12 on 3s, moving within one of No. 400 in his career. ... Indiana played without leading scorer Malcolm Brogdon for the third straight game because of a sore right Achilles tendon. Brogdon averages 19.0 points.\n\n\r\n              COVID-19 UPDATES\n\n\r\n              The Pacers also were without Jeremy Lamb after he tested positive for COVID-19 and assistant coach Lloyd Pierce, who entered the health and safety protocols following an inconclusive test.\n\n\r\n              It's just another virus flurry for the Pacers, who lost coach Rick Carlisle for four games after a positive test this month and Justin Holiday for two weeks. Two members of Carlisle's staff, Jenny Boucek and Zach Chu, also have missed time. \n\n\r\n              Charlotte was missing three players because of COVID-19 — Miles Bridges, P.J. Washington and Scottie Lewis.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Take a three-day break before hosting Phoenix on Sunday.\n\n\r\n              Pacers: Host Chicago in a rare afternoon game New Year's Eve. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992896.942105
}