{
  "game_id": "0022400749",
  "espn_id": "401705315",
  "date": "Feb 08, 2025",
  "matchup": "DEN @ PHX",
  "headline": "Jokic falls assist short of triple-double in his 3 quarters in Nuggets' 122-105 victory over Suns",
  "body": "PHOENIX -- — Nikola Jokic had 28 points, 11 rebounds and nine assists to just miss a triple-double before sitting out the fourth quarter and the Denver Nuggets won their season-best sixth straight game, beating the Phoenix Suns 122-105 on Saturday night.\n\n\r\n              Jokic made 11 of 13 shots in 28 minutes. Jamal Murray had 30 points for the Nuggets, who played without starters Russell Westbrook and Michael Porter Jr., both sidelined with left hamstring injuries.\n\n\r\n              Devin Booker scored 24 points to lead Phoenix, who didn’t have injured starters Kevin Durant (sprained left ankle) or Bradley Beal (injured left big toe) for the second night in a row. Also out was Grayson Allen, who sat with an injured left knee. He made two 3-pointers in the final 4 seconds Friday night to force overtime in an eventual victory over Utah.\n\n\r\n              Bol Bol had a season-high 19 points, and Tyus Jones added 15 points and 10 assists for the Suns. They have lost four of five.\n\n\r\n              Takeaways\r\n              Nuggets: Guard Julian Strawther helped pick up for Westbrook’s absence, finishing with 18 points and six assists in 39 minutes. Christian Braun also had 18 points.\n\n\r\n              Suns: Fan favorite Bol, playing 33 minutes in the absence of three missing regulars, had two offensive-rebound baskets in the first quarter, then completed a behind-the-back pass to Damion Lee for a 3-pointer that brought the sellout crowd to its feet. \n\n\r\n              Key moment\r\n              Murray made 3-pointers on his first three shots, guiding the Nuggets to a 10-2 lead. The Suns led briefly in the first quarter but that was it. Denver led by 23.\n\n\r\n              Key stat\r\n              Booker, one night after playing 49 of a possible 53 minutes, played 34 minutes and finished 8 of 19 from the field.\n\n\r\n              Up next\r\n              Nuggets host Portland on Monday night, and the Suns host Memphis on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998255.545985
}