{
  "game_id": "0021900211",
  "espn_id": "401160853",
  "date": "Nov 20, 2019",
  "matchup": "HOU @ DEN",
  "headline": "Jokic, Nuggets bottle up Harden and Rockets in 105-95 win",
  "body": "DENVER --  Rule No. 1 in defending James Harden: Throw different looks at him.\n\nRule No. 2: See above.\n\nAt least, that was Denver's highly effective blueprint.\n\nNikola Jokic had 27 points and 12 rebounds, Denver played smothering defense on Harden and the Nuggets beat Houston 105-95 on Wednesday night to snap the Rockets' eight-game winning streak.\n\n\"You have to have rules against James Harden,\" Denver coach Michael Malone explained. \"You can't play him with your standard defense. Great player defense is required for great players.\"\n\nSo, the Nuggets tried a little bit of everything to contain Harden, even rolling the 7-foot Jokic out high along with another defender.\n\nThe variety of schemes did the trick -- as much as it can against Harden. Houston's star playmaker finished with 27 points, snapping his string of eight consecutive games with 36 or more. He was 8 of 16 from the floor as the Rockets were held under 100 points for the first time this season. They were averaging an NBA-best 119.5 per game.\n\n\"We were locked in,\" said Jokic, whose team is 7-0 this season when keeping an opponent below 100 points.\n\nStill, Jokic found it funny that his team was being lauded for \"stopping\" Harden.\n\n\"That's crazy when a guy scores 27 and it's bad,\" Jokic said. \"We know he's going to score. He's going to be aggressive. Just make it harder and try to be there. ... Just to give them different looks.\"\n\nIt worked -- this time.\n\n\"They just double-teamed every possession,\" Harden said. \"They got lucky. They got away with one. We didn't execute how we needed to.\"\n\nThe Rockets struggled from 3-point range, hitting 12 of 38. They did make at least 10 for a 71st straight game dating to last season.\n\nRussell Westbrook finished with 25 points on 8-of-22 shooting and Clint Capela grabbed 21 rebounds.\n\n\"We had open shots,\" Westbrook said. \"We just didn't make them.\"\n\nWill Barton scored 15 points, while Torrey Craig and Juancho Hernangomez provided boosts off the bench as Denver's reserves outscored the Rockets' backups by a 32-21 margin.\n\nOne of the key sequences came in the third quarter, when Paul Millsap blocked Harden's shot and Barton turned it into a dunk on the other end. That energized the Pepsi Center crowd and sent the Nuggets on a pivotal run.\n\nIt's not easy making things difficult for Harden, who's seen just about every defensive scheme imaginable.\n\n\"He's one of those guys that when you're watching film it's like watching a horror movie,\" Malone said. \"He's that talented.\"\n\nTIP-INS\n\nRockets: F Danuel House Jr. hurt his shoulder after running through a screen set by Jokic in the third quarter. House will be evaluated Thursday. ... G Ben McLemore was given a flagrant foul for a push in the fourth.\n\nNuggets: Gary Harris and Jamal Murray each scored 10 points.\n\nCRAIG'S D\n\nCraig played a big role with three blocked shots in helping to limit Westbrook's damage. Craig knew he was getting under his opponent's skin when Westbrook lobbied to officials for foul calls.\n\n\"That's kind of a sign that I'm getting on his nerves a little bit,\" said Craig, who also turned in an impressive dunk.\n\nSPURTS\n\nThe first quarter was filled with plenty of spurts -- a 7-0 run by Denver, soon followed by a 13-0 run for Houston and then a 15-0 run by the Nuggets.\n\nELITE CATEGORY\n\nRockets coach Mike D'Antoni sees Jokic in the same sort of category as Harden or Westbrook in being difficult to contain.\n\n\"He's going to do what he does. Same as James,\" D'Antoni said. \"I don't care what they do to James -- if he has a good game, it's because of James. If he has a bad game, it's because of James. Same with Russell. There are a few players that are that special.\"\n\nNO FOULS\n\nTrying not to foul Harden is easier said than done. He drew a foul on a 3-pointer the Nuggets challenged, believing he kicked out his left leg, but the call on the floor stood. Harden was 7 of 10 from the free throw line.\n\n\"He's a master at drawing the foul,\" Malone said. \"They changed NBA rules because of James Harden.\"\n\nUP NEXT\n\nRockets: In Los Angeles to play the Clippers on Friday.\n\nNuggets: Host the Boston Celtics on Friday in the second game of a four-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996651.3266299
}