{
  "game_id": "0021900792",
  "espn_id": "401161434",
  "date": "Feb 09, 2020",
  "matchup": "MIA @ POR",
  "headline": "Blazers beat Heat 115-109 in Iguodala's debut for Miami",
  "body": "PORTLAND, Ore. --  Andre Iguodala fell short in his first chance to get a win with the Miami Heat.\n\nHis next one will come against his former team.\n\nDamian Lillard had 33 points and eight assists, Gary Trent Jr. scored 22 points and the Portland Trail Blazers beat Miami 115-109 on Sunday night.\n\nIguodala had two points in his first game since the NBA Finals.\n\n\"It felt good tonight,\" Iguodala said. \"I wanted to get a feel for where I was at. Honestly, I haven't even played a pickup game or anything since the finals. I was trying to get a feel for where my mind was. Overall, I felt really good out there.\"\n\nFor Iguodala and the Heat, the next game will be at Golden State, where he was a member of three championship teams and the MVP of the 2015 NBA Finals.\n\n\"I've played a lot of basketball games in my career, so the emotional highs and lows, I don't have anymore,\" Iguodala said of returning to play his former team. \"For this team, more importantly, we want to win. This road trip is tough with a lot of guys down. We've got new bodies and us getting a win is more important than how I feel.\"\n\nHassan Whiteside had 11 points and 17 rebounds against his former team, including a pair of free throws with 11.5 seconds left that gave Portland a seven-point lead.\n\nWhile Lillard has been the catalyst for everything, the Blazers have gotten a major shot in the arm from Trent. The former bench warmer has averaged more than 14 points over the last five games and has shot above 51% on 3-pointers during that stretch.\n\n\"You just love to see it,\" Lillard said. \"I told him the other day, I don't know if I've been more proud or happier for another player or a younger player since I've been in the league. A second-round pick, McDonald's All-American and went Duke, but doesn't get an opportunity right away. He had a lot to learn, his dad played in the league, and he did it.\"\n\nTrent's play hasn't gone unnoticed by opponents either, especially after he hit a 3-pointer with 2:08 left to put Portland up 110-103.\n\n\"He has really stepped up and played well,\" Heat coach Erik Spoelstra said. \"It's not easy to be a role player with great players. That sounds easy but you have to do a lot of the little things. At the end of the clock teams are trying to get the ball out of the great players' hands and you have to step up and he hit a big shot.\"\n\nGoran Dragic had 27 points for Miami, which played without Jimmy Butler and Tyler Herro. Duncan Robinson had 19 points, but just four after halftime.\n\nIguodala, acquired from Memphis before the trade deadline, made his Miami debut in the first quarter, wearing No. 28. He made an impact with a block of Portland's Mario Hezonja. In the second quarter, Hezonja sprained his left ankle and did not return, leaving Portland with just eight available players.\n\nAfter a foul was called on Lillard with 0.9 seconds left in the third quarter, Blazers coach Terry Stotts challenged the call. The call was overturned after the review, which showed a clean block by Lillard and a loose ball foul on Dragic. Lillard made both free throws to give the Blazers a 93-83 lead heading into the final period.\n\nIguodala began the fourth quarter with an assist to Chris Silva on an alley-oop. A steal by Iguodala on the next possession led to Robinson's 3-pointer, forcing a Blazers timeout with 11:01 left.\n\nBam Adebayo's layup cut the Blazers' lead to 111-108 with 46 seconds left. However, Lillard answered back with a layup of his own to push the lead back to 113-108 with 25 seconds left.\n\nAfter the Heat had three opportunities to cut into the lead, Whiteside grabbed the rebound and was fouled.\n\nTIP-INS\n\nHeat: Sunday was the first game for the Heat with new additions Iguodala and Jae Crowder. Iguodala has plenty of respect in the league still. \"I see a winning player,\" Blazers coach Terry Stotts said. \"He is an experienced, winning player. A very good wing defender. I think he complements the Miami roster really well, with the versatility that he brings at both ends.\"\n\nTrail Blazers: Lillard's recent sizzling stretch caught the eye of Spoelstra. \"It's been a little bit of a habit of mine,\" he said. \"We play our game East Coast time and I throw on a West Coast game and it usually ends on Portland for the last two weeks with what this guy has been doing. The whole league has been watching. They're in a desperate situation trying to make the playoffs. You have to respect the urgency and toughness and focus that they are going to bring into every single game.\" Lillard had averaged over 41 points per game over the past 10 games entering Sunday.\n\nUP NEXT\n\nHeat: Monday night at Golden State Warriors.\n\nTrail Blazers: Tuesday night at New Orleans Pelicans.",
  "source": "espn_api",
  "crawled_at": 1764996617.023921
}