{
  "game_id": "0022301006",
  "espn_id": "401585634",
  "date": "Mar 21, 2024",
  "matchup": "HOU vs. CHI",
  "headline": "Jalen Green scores 26 points as Rockets win 7th straight, beat Bulls 127-117",
  "body": "HOUSTON -- — Jalen Green scored 26 points, Dillon Brooks had 23 before he was ejected from the game and the Rockets won their seventh straight, 127-117 over the Chicago Bulls on Thursday night.\n\n\r\n              “Good to get back to playing good basketball,\" Rockets coach Ime Udoka said. “Now you want to ride that momentum and just keep tightening the rope and do a little bit more every game.” \n\n\r\n              Houston has gone 9-1 in March and is now just 2 1/2 games behind Golden State for the final play-in spot in the Western Conference. The Rockets' seven-game winning streak is their longest since 2021.\n\n\r\n              With the Rockets leading 84-75 with 6:02 left in the third quarter, a foul committed by DeMar DeRozan on Green upset Brooks. DeRozan turned and subsequently elbowed Brooks in the chin, which caused an on-court scrum.\n\n\r\n              After review, the initial foul by DeRozan was ruled a flagrant foul 2 and he was ejected. Brooks was given a technical foul and ejected for his role in the scrum.\n\n\r\n              “Had a great game, great impact, wish he didn't get ejected but like I said I don't mind him standing up for his guys,” Udoka said of Brooks. “It was good to see him bounce back. He's struggled a little bit lately shooting it but looked really good tonight.\" \n\n\r\n              Bulls interim coach Billy Donovan was surprised.\n\n\r\n              \"Anytime you lose good players it's never good. I don't think DeMar's intention was to get a flagrant 2, certainly it was fouling and of course flagrant 1 and they're shooting a free throw. I don't think that was ever his intention was to do that. I actually was a little surprised that it got elevated to a flagrant 2, personally.” \n\n\r\n              Crew Chief Curtis Blair spoke to the pool reporter after the game. \n\n\r\n              “DeRozan was assessed a flagrant foul penalty 2 because the contact was excessive and unnecessary,” Blair said. “Because Brooks escalated the situation, therefore he was given a technical foul and ejected.” \n\n\r\n              Brooks left the game at the time with a team-leading 23 points on 10-of-13 shooting, while DeRozan exited with 16 points on just 4-of-15 shooting in 23 minutes.\n\n\r\n              “Just not being out there and giving us the full chance to go out and win a game, that’s what I’m more frustrated about more than anything,” DeRozan said. “Not being out there with my guys, seeing the outcome could’ve been.” \n\n\r\n              Brooks did not speak to the media following the game. \n\n\r\n              After the delay, Houston finished the quarter strong to lead 105-94 and never looked back. The bench came through big for Houston, scoring 49 points, compared to just 28 from Chicago’s bench.\n\n\r\n              “Really outplayed their bench,” Udoka said. “Like you said, when Dillon goes out, he was having a great game himself, and Jabari (Smith Jr.) struggled with foul trouble, it was great for those guys to come in and have an impact.” \n\n\r\n              Jock Landale scored 17 and grabbed 12 rebounds, Aaron Holiday had 15 and Jeff Green added 14, all off the bench for Houston. Amen Thompson had 15 points and eight rebounds.\n\n\r\n              For Chicago, Ayo Dosunmu led the way with 35 points on 13-of-18 shooting. Nikola Vučević scored 16 points and grabbed 14 boards for his 40th double-double of the season. Coby White returned to play after missing the last three games due to a right hip sprain and scored 13 for the Bulls.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995573.7981398
}