{
  "game_id": "0022300550",
  "espn_id": "401585178",
  "date": "Jan 14, 2024",
  "matchup": "IND @ DEN",
  "headline": "Jokic leads balanced offensive effort in Nuggets' 117-109 win over Pacers",
  "body": "DENVER -- — Nikola Jokic recorded 25 points, 12 rebounds and nine assists, finishing an assist shy of his 13th triple-double of the season, to help lead the Denver Nuggets to a 117-109 victory against the Indiana Pacers on Sunday.\n\n\r\n              Michael Porter Jr. and Jamal Murray matched Jokic with 25 points apiece for the Nuggets, who shot a season-high 64.8% from the field and had all five starters finish in double figures. Aaron Gordon added 20 points and 10 rebounds for the Nuggets, who improved to 17-4 at home this season.\n\n\r\n              Jokic made 12 of his 13 field-goal attempts. The two-time NBA MVP is shooting 81% (85 of 105) from the field over his past nine games.\n\n\r\n              The offensive output was enough to overcome a sloppier-than-usual performance for the reigning NBA champions, who finished with a season-worst 21 turnovers and allowed 14 offensive rebounds, off of which the Pacers got 20 second-chance points.\n\n\r\n              The victory was Denver’s 14th in its past 18 games. \n\n\r\n              “I think we’re in a good spot,\" Porter said. \"We’re about what you can expect with a vastly different bench lineup than last year coming off a championship and a short summer. Obviously, we’d love to be No. 1 in the west, but we’re a couple of games behind it. We’re feeling good. Guys are healthy. That’s all you can ask for.”\n\n\r\n              Indiana, which had won nine of its past 11 games, fell to 2-2 since losing star Tyrese Haliburton to a strained left hamstring.\n\n\r\n              In a matchup of the NBA’s top scoring offense against its No. 2 scoring defense, the Pacers, who entered the day averaging an NBA-best 126.6 points per game, were held to 17.6 points below their season average. Indiana was also limited to seven fast-break points after averaging 17.2 per game in its first 38 games, the second-best mark in the league.\n\n\r\n              “It was just a point of emphasis to get back,\" Murray said. \"We knew that’s what they do and they do it really well and they’ve been doing it all season.”\n\n\r\n              The Nuggets trailed by four in the third quarter, but recovered and built a nine-point lead after a Christian Braun basket with 9:16 remaining in the fourth.\n\n\r\n              In his return to Denver, where he helped lead the Nuggets to the franchise’s first NBA championship last season, Bruce Brown had a team-high 18 points, 10 rebounds and six assists for the Pacers. Before the game, Brown was presented with his championship ring and mobbed by his former teammates, with the crowd serenading him with chants of his name.\n\n\r\n              “It was more than I expected,\" Brown said. \"I didn’t know the crowd was going to cheer like that. I almost started crying, but I had to hold it in because I told one of the fans I wasn’t going to cry, so it was tough. I loved it, though.”\n\n\r\n              Six other Pacers finished in double figures, led by Buddy Hield's 16 points.\n\n\r\n              Indiana was without forward Aaron Nesmith, who’s making 46.6% of his 3-pointers this season, the fourth-best mark in the NBA.\n\n\r\n              “I thought we fought hard in this game,\" Pacers coach Rick Carlisle said. \"There were some frustrating parts of it. A lot of this came down to Jokic’s greatness and Murray’s greatness.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Utah on Monday night.\n\n\r\n              Nuggets: At Philadelphia on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996194.533046
}