{
  "game_id": "0022200409",
  "espn_id": "401468564",
  "date": "Dec 13, 2022",
  "matchup": "SAC @ PHI",
  "headline": "Sixers cruise past Kings 123-103 behind 80-point 1st half",
  "body": "PHILADELPHIA -- — Joel Embiid scored 31 points, James Harden had 21 points and 15 assists, and the Philadelphia 76ers scored 80 points in the first half and cruised to a 123-103 win over the Sacramento Kings on Tuesday night.\n\n\r\n              Tobias Harris also scored 21 points while adding nine assists for the Sixers, who have won three straight to start a seven-game homestand.\n\n\r\n              “We're playing pretty well offensively,” said Embiid, who has scored 30 or more points in five straight games. “James is doing a great job getting everyone easy shots. My teammates are doing a fantastic job moving the ball and being in the right spots. That's what we've got to do — all we have to do is stay healthy. But we're not there yet. We have a long way to go.”\n\n\r\n              Domantas Sabonis led the Kings with 22 points. Sacramento has lost three of the first four games of its six-game East Coast swing.\n\n\r\n              “I saw a little clip on news on the late Mike Leach (the Mississippi State football coach who died Monday night) saying 'It's not sweet unless its hard,'” Kings coach Mike Brown said. “The NBA year and grind is really hard and we're going to have to experience the downs like we have ups in this short time together.”\n\n\r\n              Two nights after Embiid scored 53 points in a victory over Charlotte, Harden and Harris took advantage of Sacramento's defensive focus on the big man. With two defenders often on Embiid, Harris camped out in the corner for wide-open 3s while Harden dished from the top of the key until his own shot got warm in the second quarter. \n\n\r\n              “The ball was moving and the floor was wide open,” Sixers coach Doc Rivers said. “That's exactly what we've been talking about. They are moving the ball and playing together.\"\n\n\r\n              Philadelphia led 80-55 at halftime, thanks in part to a 20-9 edge in fast-break points. Fourteen of those 20 points came off Sacramento turnovers.\n\n\r\n              “We had a ton of breakdowns, we didn't have a lot of help on drives and they got to the rim very easily,” Brown said. “We have to figure some things out and dig a little deeper.”\n\n\r\n              The 76ers shot 51.2% — the third straight game they've been better than 50% from the floor. They only topped 50% once in the nine games before that. They also recorded a season-high 34 assists.\n\n\r\n              “We got settled in and we know what we're trying to accomplish possession by possession,” Harden said. “That's the most important thing. If everyone is trying to accomplish different agendas, the team is not going to be successful. Knowing what we're trying to accomplish and doing what we have to do on both sides of the ball is critical.”\n\n\r\n              Malik Monk had 16 points off the bench for the Kings.\n\n\r\n              TIP-INS\n\n\r\n              Kings: De'Aaron Fox (right foot soreness) was back in the starting lineup and finished with 13 points. ... Fox was hurt during a loss to Milwaukee last Wednesday and missed two subsequent games.\n\n\r\n              76ers: De'Anthony Melton was held out with lower back tightness. Melton has been starting in place of Tyrese Maxey and scored 33 points on Friday night against the Lakers. ... Maxey (left foot fracture) has not been cleared to run at full speed. ... The Sixers scored 80 or more points in the first half for the 14th time in franchise history. Their previous high this season was 67 against Orlando on Nov. 17.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Toronto on Wednesday night.\n\n\r\n              76ers: Host Golden State on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995308.157227
}