{
  "game_id": "0022400075",
  "espn_id": "401704641",
  "date": "Oct 24, 2024",
  "matchup": "OKC @ DEN",
  "headline": "Gilgeous-Alexander, Holmgren lead Thunder to 102-87 win over Nuggets in season opener",
  "body": "DENVER -- — Shai Gilgeous-Alexander scored 28 points, Chet Holmgren added 25 as part of a stellar all-around performance and the Oklahoma City Thunder beat the Denver Nuggets 102-87 on Thursday night in the season opener for both teams.\n\n\r\n              Holmgren proved to be a handful on both ends of the floor. He tied a career high with 14 rebounds, and had five assists and blocked four shots. Reserve Aaron Wiggins added 15 points.\n\n\r\n              It was an important divisional game right out of the gate. The Thunder and Nuggets both finished 57-25 last season, with the Thunder earning the No. 1 seed in the Western Conference by virtue of a tiebreaker.\n\n\r\n              Reigning NBA MVP Nikola Jokic had 16 points, 13 assists and 12 rebounds for Denver. \n\n\r\n              Jokic's point guard partner, Jamal Murray, had 12 points on 4-of-14 shooting. Christian Braun added 16 points. while Aaron Gordon, fresh off signing a new contract extension, added 12 points. Denver was 7 of 39 on 3-pointers.\n\n\r\n              Takeaways \r\n              Thunder: Holmgren can run the floor with authority. In the third quarter, he blocked a shot by Jokic, ran the down the court, took a pass and and threw down a powerful dunk. \n\n\r\n              Nuggets: The Thunder's bench outscored the Nuggets' reserves 25-16. New addition Russell Westbrook had six points on 2-of-10 shooting.\n\n\r\n              Key moment \r\n              Before the game, Denver players and coaches paid tribute to the late Dikembe Mutombo by wearing T-shirts emblazoned with an image of the big man’s iconic finger wag. In the first quarter, the team showed a video tribute celebrating Mutombo’s big accomplishments on and off the court. Then, fans stood and applauded for 55 seconds — his number. Mutombo died last month of brain cancer. He was 58.\n\n\r\n              Key stat\r\n              At an average of 24 years, 148 days, the Thunder opened the regular season with the youngest roster in the league. \n\n\r\n              Up next\r\n              The Thunder are at Chicago on Saturday night, while the Nuggets host the Los Angeles Clippers on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997695.541003
}