{
  "game_id": "0022300691",
  "espn_id": "401585319",
  "date": "Feb 02, 2024",
  "matchup": "SAC @ IND",
  "headline": "Sabonis breaks Robertson's franchise mark for consecutive double-doubles as Kings top Pacers 133-122",
  "body": "INDIANAPOLIS -- — Domantas Sabonis had 26 points and 12 rebounds to break Oscar Robertson’s single-season franchise record with his 30th consecutive double-double as the Sacramento Kings defeated the Indiana Pacers 133-122 on Friday night. \n\n\r\n              Sabonis added seven assists and De'Aaron Fox had 25 points and six steals a day after the NBA announced its All-Star reserves and neither of the Kings' stars was selected.\n\n\r\n              “Two fantastic performances from both those guys,” said Sacramento coach Mike Brown, who praised Sabonis’ performance as “historic.”\n\n\r\n              Robertson had a 29-game double-double streak from Dec. 6, 1961, to Jan. 30, 1962.\n\n\r\n              Malik Monk finished with 23 points, six assists and five rebounds for the Kings, who won for the fifth time in their last six contests.\n\n\r\n              “Good, good win versus a really good team on the road,” Brown said. “It wasn’t always textbook, but (Sacramento defenders’) ability to protect and cover for one another was really good to see. In the second half, I think (Indiana) had 20 points in the paint, which was huge for us.”\n\n\r\n              Bennedict Mathurin had 31 points and five rebounds for the Pacers, who shot 54% from the field but committed 21 turnovers and fell to 4-8 in their last 12 games. Pascal Siakam added 22 points and six rebounds.\n\n\r\n              The Kings, who shot 57%, raced ahead by as many as 18 points in the third quarter. Indiana closed within 11 at 99-88 entering the fourth, but never got closer than seven in the final period.\n\n\r\n              “De’Aaron Fox, Malik Monk are really fast,” Mathurin said. “(The Kings) have a lot of guys who can score. It’s hard to contain them.”\n\n\r\n              Indiana All-Star Tyrese Haliburton scored 14 points and had an uncharacteristic five turnovers and just one assist while coming off the bench in his third game back from an injured hamstring. With the organization managing his minutes, Haliburton checked in for the first time at the start of the second quarter and played only 22 minutes. \n\n\r\n              “He was in favor of having the ability to finish the game,” Pacers coach Rick Carlisle said. “The first two games, (starting) made sense.\"\n\n\r\n              He added that bringing Haliburton off the bench “was not an easy thing to do, obviously.” Carlisle said players' health has to be a top priority. \n\n\r\n              \"So, sometimes you go through these kind of challenges,” he said.\n\n\r\n              The teams met nearly two years to the day of their milestone trade – Feb. 8, 2022 – that sent Haliburton to Indiana and Sabonis to Sacramento. The Kings improved to 3-2 in the clubs’ five meetings since the swap.\n\n\r\n              Sacramento trailed 39-38 at the end of the first quarter, but forced nine turnovers in the second period and held a 71-64 lead at the intermission.\n\n\r\n              Indiana played without starting center Myles Turner, who's averaging 17 points and 6.9 rebounds per game but has a sprained ankle. Backup big man Jalen Smith (10.7 points and 5.7 rebounds per game) sat out due to back spasms.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Continue their seven-game road trip Saturday night against the Chicago Bulls.\n\n\r\n              Pacers: Play at the Charlotte Hornets on Sunday night.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996791.357127
}