{
  "game_id": "0022300911",
  "espn_id": "401585539",
  "date": "Mar 08, 2024",
  "matchup": "MIN @ CLE",
  "headline": "Darius Garland scores 34, Jarrett Allen 33 as Cavaliers outlast Timberwolves 113-104 in overtime",
  "body": "CLEVELAND -- — Darius Garland scored 34 points, Jarrett Allen added a career-high 33 and 18 rebounds and the injury-thinned Cleveland Cavaliers handed the NBA's best road team a loss, beating the Minnesota Timberwolves 113-104 in overtime Friday night.\n\n\r\n              Allen made a career-best 15 free throws, including 14 after halftime. He scored 10 points in overtime as the Cavs outscored the Timberwolves 16-7 and won their eighth straight against a Western Conference team.\n\n\r\n              It was Cleveland's eecond win in four days against one of the league's elite teams. On Tuesday, the Cavs rallied from 22 points down in the final minutes to stun the East-leading Boston Celtics.\n\n\r\n              “It just boosts us for when everybody else gets back,” Allen said. “Contrary to belief, we're better when everybody is in the lineup.”\n\n\r\n              Cleveland was without starters Donovan Mitchell, Evan Mobley and Max Strus because of injuries but had enough to down the Timberwolves, who could be excused for being tired following a 113-111 win at Indiana on Thursday.\n\n\r\n              With the loss, Minnesota fell a half game behind Oklahoma City for the Western Conference lead.\n\n\r\n              Naz Reid scored a career-high 34 and Anthony Edwards 19 — on just 7-of-27 shooting — for Minnesota, which came in a league-best 21-11 on the road.\n\n\r\n              Minnesota coach Chris Finch sat out after feeling ill shortly before tipoff. He met with reporters about 90 minutes before the game and didn’t mention any issues. Assistant Micah Nori filled in for Finch.\n\n\r\n              The Cavs were helped by Minnesota center Rudy Gobert, who was called for a technical foul with 27 seconds left.\n\n\r\n              After being whistled for a disqualifying sixth foul — a push underneath on offense — by official Scott Foster, Gobert rubbed his fingers together and made the money sign as if implying the referee was on the take.\n\n\r\n              Foster didn't see the gesture, but official Natalie Sago did and T'd up Gobert, who finished with 17 rebounds in 37 minutes.\n\n\r\n              Nori was disappointed and displeased with Gobert.\n\n\r\n              “A technical foul with 27 seconds in the game, to be honest, is unacceptable,\" Nori said. \"That’s who Rudy is, but you’ve got to be smart. He made a visual that was automatic. He was obviously frustrated — both teams were — but we have to be smarter.”\n\n\r\n              Gobert admitted he was wrong in making the gesture.\n\n\r\n              “My reaction, which I think was the truth, but it wasn’t the time to react that way,\" he said. \"It cost my team the game. It was an immature reaction. It’s not just one call. Everyone makes mistakes, but when it’s over and over and over again, of course it’s frustrating.”\n\n\r\n              Garland made the technical to tie it at 97. Minnesota had one last chance in regulation, but Edwards' baseline jumper at the horn was off.\n\n\r\n              The Timberwolves were also missing All-Star center Karl-Anthony-Towns. He's scheduled to have knee surgery next week and will be out at least one month.\n\n\r\n              Edwards was coming off a 44-point performance in the win over Indiana, a game he sealed with a chase-down block in the final second before striking his head on the bottom of the backboard.\n\n\r\n              He didn't do anything quite that sensational, though Edwards did get called for a technical after dunking on Allen — much to the delight of Minnesota's bench.\n\n\r\n              Mitchell missed his third game with a left knee bone bruise. Cleveland's leading scorer and All-Star received a platelet-rich plasma injection earlier this week and will be reevaluated Saturday.\n\n\r\n              “He's progressed,” Cavs coach J.B. Bickerstaff said. “He’s doing stuff on the floor. It just becomes the next workout and the next workout and how he feels and then continuing to ramp up from there.”\n\n\r\n              UP NEXT \n\n\r\n              Timberwolves: At Lakers on Sunday.\n\n\r\n              Cavaliers: Host Brooklyn on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996457.8279822
}