{
  "game_id": "0021800489",
  "espn_id": "401071170",
  "date": "Dec 23, 2018",
  "matchup": "PHX @ BKN",
  "headline": "Nets bounce back, beat weary Suns 111-103",
  "body": "NEW YORK --  Deandre Ayton was eating breakfast after a short, sleepless night when the reality of NBA life hit the rookie.\n\nIn college, he'd have had a break Sunday.\n\nThis is the pros.\n\n\"I was talking to the coach, I was like, `Yo, we've got to do this again,\" he said.\n\nHe and the Suns found out just how tough that is with weary legs after playing three overtimes a night earlier.\n\nSpencer Dinwiddie scored 24 points, D'Angelo Russell had 18 points, eight assists and six rebounds, and the Brooklyn Nets beat the Suns 111-103 on Sunday night.\n\nThe Suns, who fell 149-146 in Washington a night earlier, dropped their second straight after a four-game winning streak.\n\nRookie Rodions Kurucs from Latvia added 16 points and 10 rebounds for the Nets. They bounced back from a loss to Indiana on Friday to win for the eighth time in nine games.\n\n\"I still think the defense could be better. I think we're in an OK place, not a great place,\" coach Kenny Atkinson said.\n\nAyton had 26 points and 18 rebounds, shooting 13 of 16 from the field. Devin Booker -- who yawned a couple times in the locker room before the game -- had 25 points and nine assists a night after playing 55 minutes.\n\nThe Suns arrived at their New York hotel after 1:30 a.m. and had a short turnaround with the game in Brooklyn tipping at the earlier-than-usual time of 6 p.m., and knew they faced a tough game.\n\n\"It's the NBA. We understand that,\" Booker said. \"I'd say a late game going into an early game I don't quite understand. I think the other way around would make more sense, but I don't make the schedule. They say computers do, so we'll just go with that.\"\n\nThey had a brunch meeting Sunday but coach Igor Kokoskov said they didn't talk much basketball, feeling the players weren't ready to think about that.\n\nHe said even the players who said they were tired and sore wanted to play. They were a step slow in the first quarter, giving up 38 points, but steadied themselves in the second and trailed 63-56 at halftime.\n\nIt wasn't close much longer, thanks to Brooklyn making five 3-pointers in the third quarter while Phoenix went 0 for 5.\n\nAyton's basket had cut it to two with 8:26 left in the period before Joe Harris and Russell made consecutive 3-pointers, Kurucs made the next two baskets and Jared Dudley made another 3 to cap a 13-0 spurt and give the Nets a 79-64 lead. Russell hit another 3 for the final points of the period, making it 91-74.\n\n\"Man, we started making winning plays,\" Russell said. \"To get separation we had to get stops. It took a lot.\"\n\nPhoenix made it look closer by intentionally fouling Ed Davis, who finished with 15 points and nine rebounds but was just 1 for 7 from the line.\n\nTIP-INS\n\nSuns: Phoenix fell to 2-2 on its season-high, five-game trip that ends Wednesday in Orlando. ... T.J. Warren was just 2 for 11 for four points.\n\nNets: Harris made three 3-pointers, making him the first player in franchise history to make three or more in 6 straight games. He scored 13 points. ... Atkinson said he expects G Allen Crabbe (sore right knee) back soon after Christmas.\n\nNO SLEEP IN BROOKLYN\n\nKokoskov downplayed the impact the Suns' late bedtime would have.\n\n\"Well, I've been up for the wrong reasons so many times,\" he joked.\n\nAs for the players?\n\n\"No, it doesn't affect,\" the native of Serbia said. \"It's a new generation, they're good. They play video stations all night long.\"\n\nALL'S FINE\n\nAtkinson said he preferred to move forward rather than say much about the $25,000 fine he was given by the NBA on Saturday for verbally abusing game officials and failing to leave the court in a timely manner following his ejection late in Friday's game. He had he had spoken with Kiki VanDeWeghe, the NBA's executive vice president of basketball operations, and understood the explanation.\n\n\"The referees, and I really mean this, I think they do a fantastic job and that's throughout the league,\" Atkinson said. \"And I think I make mistakes, they make mistakes, and my focus needs to be on our players and making the adjustments that's going to help us pull out a game.\"\n\nUP NEXT\n\nSuns: Visit Orlando on Wednesday.\n\nNets: Host Charlotte on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995083.987309
}