{
  "game_id": "0021600198",
  "espn_id": "400899648",
  "date": "Nov 20, 2016",
  "matchup": "CHI @ LAL",
  "headline": "Jimmy Butler's 40 points boost Bulls past Lakers, 118-110",
  "body": "LOS ANGELES --  Even when Dwyane Wade takes a night off to rest, Jimmy Butler gets the benefit of his new Chicago Bulls teammate's veteran experience.\n\nNot that Butler needed a whole lot of help while he carved up the Los Angeles Lakers.\n\nButler scored a season-high 40 points and Isaiah Canaan added a season-high 17 in the Bulls' fifth victory in six games, 118-110 over the Lakers on Sunday night.\n\nNikola Mirotic had 15 points and 15 rebounds and the Bulls held off Los Angeles' late rally for their third win in four stops on their annual circus road trip. They also bounced back solidly after blowing a 19-point lead in a loss to the Clippers on Saturday night.\n\n\"It was a quick turnaround from last night to today, but I saw everybody working on their body and everybody watching the film,\" Butler said. \"That's how it's supposed to be.\"\n\nChicago got a vintage game from Butler, its two-time All-Star and gold medal-winning Olympian. He destroyed a series of Los Angeles defenders with his usual flair, scoring inside and on the perimeter without hitting a 3-pointer.\n\n\"He was attacking all night,\" Chicago coach Fred Hoiberg said. \"He told me before the game, `Coach, I'm going for 40 tonight,' and he did it.\"\n\nEven on the second half of back-to-back road games, Chicago outrebounded the Lakers 56-37 -- including 16 offensive boards -- and constantly outhustled Los Angeles to loose balls.\n\nThe Bulls did it all without Wade, who rested for the first time this season. He scored 28 points on Saturday, but the Bulls are monitoring their 34-year-old guard's long-term health.\n\n\"Even though D-Wade is out, he's still helping me through this process and letting him know what I should be doing, helping me read the game,\" Butler said. \"It's great to have him in my corner.\"\n\nLou Williams scored a season-high 25 points and Larry Nance Jr. had a career-high 18 for the Lakers (7-7).\n\n\"Jimmy Butler had a pretty fantastic game,\" Lakers coach Luke Walton said. \"He's a pretty fantastic player, but if he's going to do that, then we have to shut down the rest of the guys. We let him get his, and the role players all chipped in and did their part as well. You either take away the star or take away the role players. You can't let everyone have a night.\"\n\nRONDO'S RETURN\n\nRajon Rondo had four points, nine rebounds and 12 assists despite a sore left ankle. He hit a floater in the lane with 28.6 seconds left to secure the Bulls' win after Los Angeles trimmed a 15-point lead to five.\n\nLONG SEASON\n\nThe Lakers' young stars mostly struggled in their second straight loss. D'Angelo Russell had only eight points and seven assists while playing cautiously on a sore left knee. Jordan Clarkson managed just five points on 1-of-12 shooting, and Julius Randle had 14 points.\n\nThe Lakers also got a lesson in hard work from the dogged Bulls, particularly in the paint.\n\n\"There was a stretch in the second quarter when they just bullied us on the glass,\" Nance said. \"I don't know what was the cause of it.\"\n\nLAST GASP\n\nEven on a bad night, the young Lakers made a late rally to trim Chicago's lead to 115-110 with 1:12 left on back-to-back 3-pointers by Nick Young and Russell. Young and Russell then missed 3-pointers that would have trimmed Chicago's lead to two, and Butler won a jump ball before Rondo's clinching floater.\n\nTIP-INS\n\nBulls: Rondo played his second straight game on that balky ankle. ... They'll host the Lakers in the rematch on Nov. 30. The Bulls have only two games before then, while the Lakers have five. ... German C Paul Zipser sat out with a lower back strain.\n\nLakers: Walton got his first technical foul of the season from referee Kane Fitzgerald in the second quarter after a no-call. ... Luol Deng scored six points. He spent his first 9 1/2 NBA seasons with the Bulls.\n\nUP NEXT\n\nBulls: The circus trip continues at Denver on Tuesday.\n\nLakers: Host Oklahoma City on Tuesday in the next daunting matchup of a rough stretch with 18 games in 30 days.",
  "source": "espn_api",
  "crawled_at": 1764995097.4134889
}