{
  "game_id": "0022201219",
  "espn_id": "401469374",
  "date": "Apr 09, 2023",
  "matchup": "ORL @ MIA",
  "headline": "Haslem scores 24 in farewell, Heat top Magic 123-110",
  "body": "MIAMI -- — Udonis Haslem went out a winner, and put on a show.\n\n\r\n              Haslem scored 24 points in his final regular-season game, Duncan Robinson added 20 and the Miami Heat tuned up for the play-in tournament by topping the Orlando Magic 123-110 on Sunday.\n\n\r\n              It was Haslem's highest-scoring game since he had 28 points on Nov. 14, 2009. He checked out for the final time with 58.9 seconds left, getting the last of many ovations that rained down throughout the afternoon.\n\n\r\n              And Haslem became the first 42-year-old to score 24 or more points in a game. Kareem Abdul-Jabbar was three days past his 41st birthday when he scored at least 24 for the final time; no one had been older than that in such a game, until Sunday.\n\n\r\n              “He is the ultimate competitor, the ultimate teammate, the ultimate winner,” Heat coach Erik Spoelstra said. “He's about all the right things. He also has that ‘it’ quality and he's always had that.”\n\n\r\n              Haslem was 9 for 17 from the floor, 3 for 7 from 3-point range. It was Haslem's 1,026th game — including playoffs — and he's only scored more points in two of them.\n\n\r\n              “So many people have sacrificed for me and this is for them. This is their day as much as it is mine,” said Haslem, who is retiring when this season — his 20th, all with Miami — ends. “This love affair that I've had with this organization and this city for the last 20 years is going to continue to grow.”\n\n\r\n              Victor Oladipo scored 19, Jamal Cain added 18 and Omer Yurtseven finished with 14 for Miami — which got a franchise-record 111 points off its bench.\n\n\r\n              Kevon Harris scored 22 for Orlando, while Caleb Houstan added 21 and Chuma Okeke scored 14. The Magic started 5-20, then went 29-28 in their final 57 games.\n\n\r\n              “I just have to say how proud of this group I am,” Magic coach Jamahl Mosley said. “Being able to sustain a 5-20 record and not waver, that just shows the resiliency in this group, the willingness to learn, the willingness to take on different challenges.”\n\n\r\n              Miami held out Jimmy Butler, who rested in advance of Tuesday’s play-in game against Atlanta. Orlando held out Paolo Banchero, his rookie season ending because of back tightness.\n\n\r\n              Orlando remained in the play-in race until the final few days of the season, a huge change from last season.\n\n\r\n              “I think everyone can see where we’re headed,” Banchero said.\n\n\r\n              Most of Miami's rotation players who did appear — Max Strus, Bam Adebayo, Tyler Herro, Gabe Vincent, Kyle Lowry, Kevin Love, Cody Zeller and Caleb Martin — got one or two shifts before their days were declared over. None of those players logged more than 12 minutes.\n\n\r\n              Haslem — 42 years and 304 days old — is the fifth-oldest player to appear in an NBA game. Nat Hickey was 45 when he played in two games with Providence in January 1948. Kevin Willis played until he was 44, while Robert Parish and Vince Carter both did until they were 43.\n\n\r\n              Haslem passed Dikembe Mutombo for No. 5 on the oldest-to-play list; Mutombo was 42 years, 300 days old when he appeared in his NBA finale.\n\n\r\n              “Couldn't have scripted this any better,” Spoelstra said.\n\n\r\n              TIP-INS\n\n\r\n              Magic: At 34-48, Orlando still posted its fourth-best record in the past 11 years. … Franz Wagner scored 10 points for the Magic, who gave up a 16-0 run in the fourth quarter.\n\n\r\n              Heat: The Heat have finished each of the past four regular seasons with a winning record. They’re one of five teams with such an active streak, joining Denver, the Los Angeles Clippers, Milwaukee and Philadelphia. ... It was Miami's first home game since its building was renamed Kaseya Center.\n\n\r\n              WALL AND HASLEM\n\n\r\n              Haslem’s first regular-season game was Oct. 28, 2003. One of the referees for that game was Scott Wall — who also was one of the referees Sunday for Haslem’s final game.\n\n\r\n              BANCHERO’S YEAR\n\n\r\n              Banchero, the overwhelming favorite to win rookie of the year, would be the third Magic player to win the award. The others are Mike Miller — Banchero’s agent — in 2001 and Hall of Fame player Shaquille O’Neal in 2003. Miller and O’Neal both won NBA titles with the Heat.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Season complete.\n\n\r\n              Heat: Host Atlanta in play-in tournament on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994302.178095
}