{
  "game_id": "0022300509",
  "espn_id": "401585137",
  "date": "Jan 08, 2024",
  "matchup": "MIA vs. HOU",
  "headline": "Heat get 28 from Herro, 22 from Adebayo and top Rockets 120-113",
  "body": "MIAMI -- — Kyle Lowry got hurt and left the game while he was still in the game. He didn't even wait for play to stop, simply exiting the floor and temporarily having Miami play 5-on-4 for a few seconds.\n\n\r\n              Even that didn't derail the Heat.\n\n\r\n              Tyler Herro scored 28 points, Bam Adebayo finished with 22 points and 12 rebounds — getting most of that in the second half — and the Heat led almost the entire game on the way to topping the Houston Rockets 120-113 on Monday night.\n\n\r\n              “The Philly guy in him right now is saying ‘I’ll be all right,'” Heat coach Erik Spoelstra said of Lowry. “He's as tough as you can be in this league. He's played through more things than probably anybody currently playing in this association.”\n\n\r\n              Lowry was diagnosed with a sprained left hand, then returned to the bench to see Miami finish off the win. Kevin Love scored 15 points for Miami, while Duncan Robinson and Jaime Jaquez Jr. each had 14 for the Heat. Josh Richardson finished with 12 for Miami.\n\n\r\n              The Heat moved to No. 4 in the Eastern Conference, followed by No. 5 Orlando, No. 6 Indiana, No. 7 Cleveland and No. 8 New York. Those five teams are separated by zero games — all five are exactly 21-15.\n\n\r\n              Adebayo had 18 points and 10 rebounds in the second half, after his first half was slowed by foul trouble.\n\n\r\n              “My teammates were looking for me in the second half,” Adebayo said.\n\n\r\n              Fred VanVleet led all scorers with 32 points for the Rockets, who opened a six-game road trip. Alperen Sengun scored 22 points and grabbed 11 rebounds for Houston, which got 11 points apiece from Cam Whitmore and Jalen Green. Houston was without Dillon Brooks (right oblique strain) for the seventh consecutive game.\n\n\r\n              The Heat were without Jimmy Butler for the eighth time in the last nine games as he continues to recover from a right toe joint sprain; Miami improved to 6-2 in those eight absences. Lowry got hurt in the third quarter while defending a layup try by VanVleet — his former Toronto teammate and backcourt mate on the Raptors’ 2019 NBA title team.\n\n\r\n              Houston is 18-17 through 35 games — a far cry from where the Rockets were at this point in the last three seasons. They were 11-24 in 2020-21, and 10-25 in both 2021-22 and 2022-23, on their way to final totals of 17, 20 and 22 wins in those seasons.\n\n\r\n              “For me, not surprised or happy,” Rockets coach Ime Udoka said. “They bought in from Day 1 and once you see the competitive side, the mindset, you know you have the right guys there. We had five or six games that we could have flipped the other way.”\n\n\r\n              The Heat led for 20:48 of the first half, the Rockets led for just 1:26 in that 24-minute span, but the scoreboard didn’t show any such discrepancy. Houston outscored Miami 8-0 in the final 1:27 of the half, and the teams went into the break tied 59-59.\n\n\r\n              It was only the second halftime tie of the season for both teams. But Miami never trailed in the second half and the Heat edge eventually reached 15 in the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Visit Chicago on Wednesday.\n\n\r\n              Heat: Host Oklahoma City on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996695.129741
}