{
  "game_id": "0021500993",
  "espn_id": "400828880",
  "date": "Mar 14, 2016",
  "matchup": "OKC vs. POR",
  "headline": "Russell Westbrook-led Thunder match last season's win total",
  "body": "OKLAHOMA CITY -- The Oklahoma City Thunder gave the Portland Trail Blazers something to think about.\nRussell Westbrook had 17 points, 16 assists and 10 rebounds in his 12th triple-double of the season, and Oklahoma City beat the Trail Blazers 128-94 on Monday night.\nIf the playoffs had started Monday, Portland would have been at Oklahoma City.\n\"We know we might face these guys in the playoffs, so we wanted to send a message,\" forward Kevin Durant said.\n\nWestbrook had the 31st triple-double of his career and matched Sacramento's Rajon Rondo for the most assists without a turnover in a game this season.\n\"Just enjoy the process, come out and play at a high level, like I do every night,\" Westbrook said.\nEnes Kanter scored a season-high 26 points, Durant added 20 and Serge Ibaka had 15 for the Thunder, whose 45th win matched their victory total from last season. Oklahoma City shot a season-high 59 percent from the field.\nDamian Lillard scored 21 points and C.J. McCollum added 15 for the Trail Blazers, who have lost five of seven. Portland shot a season-low 34.1 percent from the field.\nPortland allowed its highest field goal percentage of the season, and Oklahoma City's field goal percentage defense was its best of the season.\nThe Thunder improved to 12-0 this season when Westbrook gets a triple-double, and he fell one rebound short of having it by halftime. He collected his 10th point on a layup with 3:37 remaining in the first half and notched his 10th assist on a pass to Ibaka for a dunk with 2:40 remaining in the second quarter. He got his ninth rebound with 3:25 left, but couldn't snag another one. He had 10 points, nine rebounds and 11 assists at the break.\nAccording to STATS, no NBA player has collected a triple-double in the first half of a game since the start of the 2002-03 season, when the company began keeping track.\n\"He's a handful,\" Lillard said. \"He was coming off pick-and-rolls, making plays for guys, and they made shots. I didn't think he did anything different tonight than what he does all the time.\"\nOklahoma City led 66-42 at halftime, and Westbrook contributed five more assists in the third quarter to help the Thunder go up 102-72 at the end of the period.\nThe teams will meet one more time in the regular season, on April 6 in Portland.\nSTAT LINES\nDurant had at least seven assists for the fifth time in the past six games to boost his season average to 4.8.\nON THE RISE\nKanter is averaging 17.2 points and 11.4 rebounds in his past five games. During that span, he has shot 69.4 percent from the field and 94.7 percent from the free throw line.\nQUOTE OF THE NIGHT\nDurant, on recent issues with turnovers: \"It's not like I'm just running down and the ball is dribbling off my foot and I'm just throwing it out of bounds. I mean, it's trying to make the right play.\"\nTIP-INS\nTrail Blazers: Portland shot 31.4 percent in the first half. ... Committed just four turnovers before the break. ... Lillard scored 14 points in the third quarter. ... Beat Orlando 121-84 on Saturday for their largest victory of the season.\nThunder: G Dion Waiters did not play for the fourth straight game. He hasn't played since his brother's death. ... Durant scored 15 points in the first quarter, matching the most he has scored in that period this season. ... The Thunder went on an 18-0 run that stretched from late in the first quarter to early in the second. ... C Nazr Mohammed played for the second time since Oklahoma City picked up the free agent. He scored his first basket of the season in the final minute.\nUP NEXT\nTrail Blazers: At San Antonio on Thursday.\nThunder: At Boston on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994138.111561
}