{
  "game_id": "0021601212",
  "espn_id": "400900590",
  "date": "Apr 11, 2017",
  "matchup": "CHA @ ATL",
  "headline": "Resurgent Hawks rout Hornets 103-76 for 4th straight victory",
  "body": "ATLANTA -- After a maddening, up-and-down season, the Atlanta Hawks seem to be getting hot at just the right time.\nPlayoff time.\nDwight Howard had 19 points and 12 rebounds as the resurgent Hawks won their fourth straight game, routing the listless Charlotte Hornets 103-76 on Tuesday night to wrap up the No. 5 seed in the Eastern Conference.\nThe Hawks will face the Washington Wizards in the opening round of the postseason.\n\"We think we can beat anybody that's coming our way,\" guard Dennis Schroder said. \"We've still got to get better, but we're heading in the right direction for sure.\"\nA week ago, Atlanta's playoff hopes were in jeopardy after a dismal stretch that included two losses to Brooklyn, the worst team in the NBA.\nThen, in a sudden turnaround that epitomized the team's inconsistent play all season, the Hawks knocked off East-leading Boston and recorded two straight stunning victories over the defending NBA champion Cleveland Cavaliers, including Sunday's comeback from a 26-point deficit .\nThis one was never in doubt. Charlotte played its regular-season finale already eliminated from the playoffs and without its best player, Kemba Walker.\nIt showed.\nAtlanta raced out to a 63-44 lead by halftime, shooting 71 percent (24 of 34) over the first two quarters.\n\"There was a lot of good stuff at both ends of the court,\" Hawks coach Mike Budenholzer said, before adding a word of caution . \"We've been here before. We've got to stay hungry, stay edgy. The last four or five games, it's been a simple message: compete and play together.\nAll 13 players scored for the Hawks, who were able to rest their starters in the second half. Paul Millsap and Ersan Ilyasova added 10 points apiece.\n\"We showed that we've got a bunch of guys who are ready to play,\" said backup point guard Jose Calderon, who was on the court for more than 17 minutes. \"That gives us confidence.\"\nJeremy Lamb led the Hornets with 21 points, but it was a forgettable ending to a disappointing year in Charlotte.\n\"The season was a letdown for us,\" Lamb said. \"We've just to learn from it.\"\nTIP-INS\nHornets: Closed the season with a five-game losing streak. ... Michael Kidd-Gilchrist became the third Charlotte player in the last four seasons to start at least 81 games in a season. Walker and Marvin Williams did it last season. ... Lamb is a native of suburban Norcross. ... The Hornets shot just 33 percent from the field.\nHawks: Howard posted his 53rd double-double of the season. ... Thabo Sefolosha scored four points in 15 minutes after missing eight games with a right groin strain. ... Atlanta announced before the game that manager of basketball operations Malik Rose will serve as general manager of their new D-League team beginning next season. ... How long had it been since the Hawks defeated the defending NBA champion in back-to-back games? It last happened in February 1984, when Atlanta beat Julius Erving and the Philadelphia 76ers on consecutive nights.\nKEMBA SITS\nThe Hornets shut Walker down for the final two games of the regular season, officially because of left knee soreness but largely to ensure he didn't sustain a needless injury for a team already eliminated from the playoffs.\nWalker finished at 23.2 points a game, the best year of his career.\nCharlotte was also without another double-figure scorer, Marco Belinelli, who missed the last three games of the season with a strained left finger.\nMILLSAP'S AWARD\nBefore the game, Millsap received the team's Jason Collier Memorial Trophy for community service.\nThe award is named after the former Hawks center who died in 2005 at age 28 from a heart condition.\nUP NEXT\nHornets: Summer vacation. Finished at 36-46, a significant drop-off from the 48-34 mark posted by last year's playoff team.\nHawks: Close the regular season at Indiana on Wednesday night. The game means nothing to Atlanta, but the Pacers are still trying to lock up a playoff berth.\n---\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 . His work can be found at http://bigstory.ap.org/content/paul-newberry .\n---\nFor more AP NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764995456.751302
}