{
  "game_id": "0021800796",
  "espn_id": "401071469",
  "date": "Feb 05, 2019",
  "matchup": "CHA vs. LAC",
  "headline": "Harris' jumper gives Clippers 117-115 win over Hornets",
  "body": "CHARLOTTE, N.C. --  Still not quite healed from a shoulder strain he suffered last week, Tobias Harris came up big for the Los Angeles Clippers.\n\nHarris scored 34 points, including a running jumper in the lane with 4.3 seconds remaining, and the Clippers rallied from 20 points down to beat the Charlotte Hornets 117-115 on Tuesday night.\n\n\"It's as good as it's going to be,\" Harris said of his injured shoulder. \"It's not any better or worse. It's about pushing myself and battling through it, keeping my mental state at a high level to go into a game and be effective.\"\n\nLou Williams scored 31 points for the Clippers, Montrezl Harrell added 16 and Patrick Beverley 15. Los Angeles, playing its third road game in four days, shot 18 for 24 (75 percent) on 3-pointers.\n\nCharlotte had a chance to tie or take the lead on its last possession, but struggled to inbound the ball and Marvin Williams' 3-point attempt at the buzzer was short.\n\n\"That wasn't what we were looking for,\" Hornets coach James Borrego said. \"I could have come up with something better.\"\n\nKemba Walker scored 32 points and Jeremy Lamb added 22 for the Hornets. Marvin Williams finished with 13 points and Malik Monk had 12. It was the second time this season Charlotte lost a game after leading by 20. The Hornets lost 126-121 to New York on Dec. 14 after leading by 21.\n\n\"There are a lot of teams that when they're up 20, they win the game,\" Lamb said. \"There are times when you're down 20 that you lose, or you're down 20 and you make a run. A 20-point lead in the NBA has always been something that's not safe.\"\n\nBeverly's loose-ball foul with 21.1 seconds left put Marvin Williams on the line for Charlotte. Williams hit both to tie it at 115.\n\nThe Hornets led 88-68 on a Miles Bridges 3-pointer with 3:17 to play in the third.\n\nWalker, held to 13 in a Clippers win this season, had 25 by halftime -- but just seven in the second half. The Clippers kept the ball from getting anywhere close to him for the final shot.\n\n\"We thought, `deny,\" Clippers coach Doc Rivers said. \"We did not want him to catch the ball, and we had already decided that we were not going to trap because we didn't want anyone getting the open 3-pointer. We said `at all costs, if we can deny him the ball, deny him the ball.\"\n\nTIP INS\n\nClippers: Los Angeles held Walker to 13 points in their first matchup this season, a 128-109 win. Walker scored 25 on 8-of-15 shooting (4 for 6 on 3s) in the first half Tuesday. ... Danilo Gallinari (back) did not play. ... The Clippers' third-period woes continued as they were outscored 34-31.\n\nHornets: Center Cody Zeller, who missed 16 games after surgery on his right hand, entered the game at the 6:43 mark of the first period with a small brace on his hand, but didn't wear it in the second half. He finished with 11 rebounds.  ... Tony Parker left after 9 minutes on the court with a back injury and didn't return. . Marvin Williams tied a career high with four blocked shots.\n\nUNREAL SHOOTING NIGHT\n\nThe Clippers kept a gaudy 3-point shooting percentage throughout and it didn't fade away late. Late in the third, it was 77 percent.\n\n\"I was like, are we really shooting 77 percent?\" Harris said. \"But we were. We should just be pulling up from anywhere at that point.\"\n\nIMPRESSIVE MOVE\n\nLate in the first half, Walker picked up a loose ball on the Clippers' end. Teammate Bismack Biyombo fell to the court also the ball. Walker, with the ball still in play, helped Biyombo up before turning up court on the dribble, prompting a surprised smile from Biyombo.\n\nALL-STAR ACTION\n\nWalker will participate in the 3-point contest at NBA All-Star weekend. Teammate Miles Bridges will take part in the slam-dunk contest.\n\nUP NEXT\n\nClippers: Visit Indiana on Thursday night.\n\nHornets: Visit Dallas on Wednesday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994372.409497
}