{
  "game_id": "0021900506",
  "espn_id": "401161148",
  "date": "Jan 01, 2020",
  "matchup": "MIL vs. MIN",
  "headline": "Antetokounmpo scores 32, Bucks hold off Wolves 106-104",
  "body": "MILWAUKEE -- The Milwaukee Bucks were happy to get another win though they know they didn't play up to their standards.\nGiannis Antetokounmpo had 32 points and 17 rebounds, and the Bucks held off a strong challenge from short-handed Minnesota in a 106-104 victory over the Timberwolves on Wednesday night.\n\"Not paying our best but still finding a way to win is good,\" Bucks coach Mike Budenholzer said. \"But this isn't the formula.\"\nAntetokounmpo got his 30th double-double in 33 games this season and Khris Middleton added 13 points despite shooting 5 for 18 as league-best Milwaukee hit just 42.6% of its shots overall and only 9 of 36 from 3-point range. Brook Lopez scored 11 points and Eric Bledsoe had 10.\n\"We missed a lot of good shots and came out a little slow,\" Middleton said.\nShabazz Napier had 22 points to lead Minnesota, and Gorgui Deng scored 15, Josh Okogie added 12 and Jarret Culver 10.\nMinnesota was playing without its two best players as Karl-Anthony Towns and Jeff Teague sat with knee injuries. The Timberwolves were also missing Treveon Graham and Andrew Wiggins, who were battling flu-like symptoms.\n\"That presented a lot of opportunities for a lot of guys and I thought a lot of guys stepped up,\" Napier said.\nNapier, starting in place of Teague, scored 15 points on 5-of-7 shooting in the first half, but then had just seven after the break.\nMilwaukee slumped out of the gate. The Bucks had just four points through the first six minutes and didn't take a lead until Lopez converted a three-point play to make it 31-29 with 8:41 left in the second quarter.\nThey went into halftime with a 52-51 lead despite shooting 34% from the floor. Minnesota connected at a 41.7% clip but made only 3 of 14 3-pointers while the Bucks knocked down 8 of 26 from beyond the arc.\nA 15-6 run capped off by Antetokounmpo's 3 out of halftime put the Bucks ahead by 10 and they took a 77-71 lead into the fourth.\nCulver's driving dunk over Lopez got the Timberwolves within a basket with 9:38 to play but he was called for a technical foul on the play that ultimately set up Kyle Korver's 3 to put the Bucks back up by six, 87-81 with 8:45 remaining.\nMinnesota responded with five straight points to pull within one but Antetokounmpo's driving layup and Middleton's 3 snuffed out the rally.\nThe Timberwolves mounted one last challenge in the closing minute as Dieng hit the first of two free throws to make it 106-104 with 46.2 seconds left. Robert Covington grabbed Pat Connaughton's missed layup, giving Minnesota the ball with 21 seconds left but after the Timberwolves used their last timeout, Dieng missed a 19-footer with 3 seconds remaining.\n\"We were hoping to get Shabazz on a quick catch and go or we liked going for a win with (Covington) getting to the corner,\" Minnesota coach Ryan Saunders said. \"There is a reason they are arguably the best defense team in the league too, they blew it up.\"\nBUILDING UP BLEDSOE\nBledsoe played 20 minutes in his second game back after missing two weeks with a leg injury. And while he shot only 4 for 10 shots, he also added 6 rebounds, 2 assists and 2 blocked shots.\n\"That is what (Bledsoe) does,\" Middleton said. \"His speed, his pace, we call him big car, just how big and strong he is. For us to play well, we are going to need him out there.\"\nBIG NIGHT FOR NAPIER\nNapier hit the 20-point mark for the second time this season. The veteran point guard came into the contest averaging 8.1 points on 34.5 percent shooting in 19 games this season but knocked down 7 of 13 shots against the Bucks including 4 of 7 from distance while adding six rebounds three assists and a blocked shot in 31 minutes.\nTIP-INS\nTimberwolves: Karl-Anthony Towns worked out before the game with a sleeve on his injured left leg but still doesn't have a timetable to return. ... Towns has missed the last eight games.\nBucks: SG Wesley Matthews sat out for a second straight game because of a bruised right thigh but Budenholzer said he expected Matthews to be fine and available possibly as early as this weekend.\nUP NEXT\nTimberwolves: Return home to face Golden State on Thursday night.\nBucks: Host San Antonio on Saturday night before heading out on a four-game West Coast swing next week.\n---\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996152.580158
}