{
  "game_id": "0022200330",
  "espn_id": "401468485",
  "date": "Dec 02, 2022",
  "matchup": "ORL @ CLE",
  "headline": "Mitchell scores 34, Cavaliers top Magic 107-96",
  "body": "CLEVELAND -- — Donovan Mitchell scored 34 points and Evan Mobley had 19 points and 13 rebounds, lifting the Cleveland Cavaliers to a 107-96 victory over the Orlando Magic on Friday night.\n\n\r\n              Mitchell poured in 16 points in the first nine minutes, outscoring Orlando himself by one, and the Cavaliers never relinquished control. Cleveland eventually led by 20 in winning for the 10th time in 11 home games this season.\n\n\r\n              “This is no shot at my guys in Utah, but I’m having fun again and that goes a long way,” said Mitchell, acquired from the Jazz in a Sept. 3 trade. “This group has a bunch of guys who want to learn and who want to be great.\n\n\r\n              “Sometimes a new beginning is all you need. I’ve fit in here because I’ve filled a void.”\n\n\r\n              Darius Garland had 18 points and six assists, and Kevin Love added 11 points and 10 rebounds off the bench for the Cavaliers. Love returned after missing six games with a broken right thumb.\n\n\r\n              Mobley, the runner-up for NBA Rookie of the Year last season, shot 9 of 10 from the field and has six double-doubles in the last nine games. He also had four assists in 38 active minutes.\n\n\r\n              “My calm demeanor just comes naturally, so that’s how I play the game,” Mobley said. “Every time I step out here on the court, I try to get better and better.”\n\n\r\n              Rookie forward Paolo Banchero scored 22 points, Cole Anthony had 19 and Markelle Fultz added 10 points and six assists for the Magic, who lost their seventh straight and have the worst record in the NBA at 5-18.\n\n\r\n              It was Anthony’s second game back after missing a month with a torn right oblique. Fultz made his season debut Wednesday after missing 21 games with a broken left toe.\n\n\r\n              “Mitchell is an All-Star, man, and we’ve got to do a better job on him early,” Anthony said. “I know when I hit a couple of shots right away, it really gets me going. We can’t let him get off like that.”\n\n\r\n              Moritz Wagner, still recovering from a right mid-foot sprain, had 16 points and nine rebounds in his first start of the season for Orlando. Younger brother Franz Wagner also scored 16.\n\n\r\n              The Magic played without top rebounder Wendell Carter Jr. and point guard Jalen Suggs. Carter has been out eight games with a right foot injury and Suggs missed his fourth straight with a sore right ankle.\n\n\r\n              “I just come to work with a smile and do my best,” Moritz Wagner said. “We feel like we can be successful once we get all our guys back and healthy. It’s on us to keep pushing until that happens.”\n\n\r\n              ON THE MEND\n\n\r\n              Cavaliers G Ricky Rubio (left knee surgery), who tore his anterior cruciate ligament last Dec. 28 at New Orleans, played light 3-on-3 for the first time this year Thursday at the team’s suburban training facility.\n\n\r\n              No timetable has been established for Rubio to return to NBA action, but coach J.B. Bickerstaff said: “Ricky is doing a little bit more and more. He’s got a doctor’s appointment coming up soon and we’re looking to see where he’s at.”\n\n\r\n              TIP-INS\n\n\r\n              Magic: G Gary Harris (right hamstring strain) did not play after getting hurt two nights earlier against the Hawks. Harris underwent left knee surgery on Sept. 1 and has only appeared in six games. … C Mo Bamba (back spasms), C Jonathan Isaac (left knee recovery) and F Chuma Okeke (left knee soreness) were all unavailable.\n\n\r\n              Cavaliers: All-Star C Jarrett Allen (bruised lower back) missed his fourth game in a row after getting injured Nov. 25 at Milwaukee. … F Lamar Stevens started in his return from a four-game absence with a non-COVID-19 illness. … Cleveland plays 10 home games in December, only heading on the road for three contests until Dec. 29.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Visit Toronto on Saturday night.\n\n\r\n              Cavaliers: Visit New York on Sunday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994649.668074
}