{
  "game_id": "0022301199",
  "espn_id": "401585827",
  "date": "Apr 14, 2024",
  "matchup": "LAC vs. HOU",
  "headline": "Rockets beat playoff-bound Clippers 116-105 to salvage a .500 season. Kawhi Leonard still out for LA",
  "body": "LOS ANGELES -- — Rookie Cam Whitmore scored 21 points and the Houston Rockets beat the playoff-bound Los Angeles Clippers 116-105 on Sunday to finish at .500 season and avoid a fourth straight losing season.\n\n\r\n              Rookie Amen Thompson had a triple-double of 18 points, 11 rebounds and a career-high 10 assists for the already eliminated Rockets, who finished 41-41 in coach Ime Udoka's first season. Houston was 22-60 last year and 20-62 in 2022.\n\n\r\n              The Pacific Division champion and fourth-seeded Clippers are headed to the playoffs, where they'll meet Luka Donic and the fifth-seeded Dallas Mavericks in the first round next weekend.\n\n\r\n              Terance Mann scored 24 points and Amir Coffey added 18 for the Clippers in their last regular-season game at Crypto.com Arena. It's where they've juggled dates with the Lakers and NHL’s Kings since 1999. The team is moving to its new Intuit Dome in Inglewood next season.\n\n\r\n              The Clippers couldn't avoid their first three-game losing streak since James Harden's first game with the team, when they lost six in a row from Nov. 1-14.\n\n\r\n              Clippers superstar Kawhi Leonard missed his eighth straight game because of right knee inflammation. The team went 4-4 over that stretch.\n\n\r\n              Coach Tyronn Lue gave his usual opaque answers about Leonard’s status for the upcoming playoffs before the game. “We’ll see. He feels OK,” said Lue, who, when asked if Leonard has been working out, said, “He’s been doing a little something.”\n\n\r\n              Also sitting out for the Clippers were Paul George, Harden, Ivica Zubac, Russell Westbrook, Norman Powell and Bones Hyland, who scored a combined 64 points in his previous three games.\n\n\r\n              Xavier Moon had 14 points, six rebounds and six assists in his first career start for the Clippers. Moon, a 6-footer, beat 7-foot-4 Boban Marjanovic in a jump ball in the fourth. They matched up again and Marjanovic stuck out his long arm to poke the ball away from Moon.\n\n\r\n              “He's a big boy,” said Clippers assistant Dan Craig who coached the game, “but X got that jump ball against him.”\n\n\r\n              Marjanovic scored 13 points in 12 minutes of the fourth. The former Clipper delighted the fans when he smilingly missed two free throws to ensure they would receive free chicken sandwiches.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996527.3639412
}