{
  "game_id": "0021800508",
  "espn_id": "401071184",
  "date": "Dec 26, 2018",
  "matchup": "MEM vs. CLE",
  "headline": "Gasol scores 20 points, Grizzlies beat Cavaliers 95-87",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies took advantage when Cleveland missed its first 12 shots.\n\nThen the Cavaliers came storming back, and Marc Gasol and his teammates had just enough to hold on for a wire-to-wire win.\n\nGasol had 20 points, nine rebounds and six assists, and the Grizzlies beat the Cavaliers 95-87 on Wednesday night despite nearly blowing a 17-point fourth-quarter lead.\n\n\"They're a team that doesn't quit. They have a really good coach and some young talent over there,\" Memphis guard Mike Conley said of the Cavaliers and coach Larry Drew. \"We had to finish the game out.\"\n\nKyle Anderson and Conley added 15 points each, with Conley handing out eight assists. Garrett Temple and Jaren Jackson Jr. had 11 points each.\n\nCleveland dropped its fourth straight. Jordan Clarkson led the Cavaliers with 24 points off the bench, and rookie Collin Sexton had 16 points and six assists. Cedi Osman had 10 points.\n\nMemphis led from the first possession and built up the advantage during Cleveland's 0-for-12 shooting slump. The Grizzlies were up 78-62 about midway through the fourth quarter, but Cleveland rallied to get within 86-82 on a drive by Osman with 1:19 left.\n\n\"We were just playing hard, trying to cut the lead and win the game,\" Clarkson said of the burst, adding: \"I mean we were right there, making plays. It just didn't come out our way.\"\n\nAfter Memphis' timeout, Conley scored on an acrobatic layup and had a steal before he was fouled. When the Grizzlies point guard converted both free throws, the lead was back to 90-82, and the Grizzlies finished out their second straight win.\n\nThe late rally seemed contrary to a game that started so poorly for the Cavaliers, who had only one made free throw until the 4:26 mark of the first.\n\n\"It was the start of the game that really put us in a little bit of a hole,\" Drew said. \"The first six minutes, we just couldn't make a shot.\"\n\nDespite the poor start, the Cavaliers still were within striking distance before Conley's four straight points.\n\n\"That's a solid team,\" Anderson said of Cleveland. \"Their record doesn't do them justice. They're still a bunch of good guys that play together.\"\n\nTIP-INS\n\nCavaliers: Cleveland's 32 first-half points were a season low for any half this season, one less than in Sunday's loss to the Chicago Bulls. ... G David Nwaba did not play because of a left ankle sprain from Sunday's loss. ... G Rodney Hood sat out his second game with left Achilles tendon soreness. ... Sexton has reached double-figures in 29 games.\n\nGrizzlies: Memphis has played on the day after Christmas every year since 2005 but had lost the previous seven games on Dec. 26. ... Before Wednesday's win, the last wire-to-wire victory was March 17 of last season over Denver ... Conley was 6 of 16 from the floor, including missing all five of his 3-point shots. ... All five Memphis starters reached double figures, the fourth time in the last five games. ... Gasol had four blocks, part of Memphis recording 10 blocks in the game.\n\nSLOW START\n\nThe Cavs had nine points in the first quarter, a season low for any period. Channing Frye hit a 3-pointer with 4:24 left in the first for Cleveland's first field goal. Seven turnovers only contributed to Cleveland's misery.\n\n\"Maybe it was Christmas, who knows,\" Clarkson said. \"Maybe everybody (ate) well on Christmas and came in a little slow.\"\n\nUP NEXT\n\nCavaliers: Play at Miami on Friday.\n\nGrizzlies: Host Boston on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994134.2196329
}