{
  "game_id": "0021500221",
  "espn_id": "400828108",
  "date": "Nov 25, 2015",
  "matchup": "MIL vs. SAC",
  "headline": "Gay scores 36 points, Kings beat Bucks 121-113",
  "body": "MILWAUKEE -- Rudy Gay scored 36 points and the Sacramento Kings beat the Milwaukee Bucks 129-118 on Wednesday night for their second road victory of the season.\nBucks coach Jason Kidd was ejected with 1:49 remaining after he slapped the ball out of a referee's hand. Kidd had to be restrained by players and an assistant coach before being escorted to the locker room.\nKings coach George Karl got hit with a technical earlier in the game.\nImmediately after the game, Kings and Bucks players could be heard shouting at each other in a hallway leading to the locker rooms. Several police officers were positioned in the area a short time later.\nMany of the Milwaukee players left the arena before reporters were allowed into the locker room and those who remained, along with Kidd, shed little light on the situation but admitted that frustrations mounted throughout the game over the officiating and the team's poor play on defense.\n\"I was having a Coke and eating some popcorn,\" Kidd said. \"I was sent in early. I don't know what happened.\"\nKidd said his ejection came after he walked out onto the court trying to request a timeout from referee Zach Zarba.\n\"We had our discussion. He gave me a (technical),\" Kidd said. \"From there, I was trying to protect my guys. Understanding that we felt that we were getting fouled and the whistle wasn't being blown. My job is to protect those young guys. But that wasn't the issue of the game. They got our temperature and saw we didn't want to play defense.\"\nBucks forward John Henson denied knowing what led to the post-game confrontation, but it appeared as though O.J. Mayo of the Bucks and Sacramento's DeMarcus Cousins confronted each other on the court as the game ended.\n\"I was just trying to help my teammate get off the court,\" Henson said.\nMilwaukee's Jerryd Bayless also tried to downplay the post-game incident.\n\"It's basketball. It happens. You move on,\" Bayless said.\nWhen asked if Cousins exchanged words with him in the hallway, Bayless said: \"I don't know. I wasn't really paying attention.\"\nSacramento won despite being without Cousins, their scoring and rebounding leader who sat out because of a strained lower back. The Kings had lost all five previous games that Cousins missed this season.\nOmri Casspi added 19 and seven rebounds, and Rajon Rondo had 10 points and 13 assists for the Kings.\n\"You go out there and desperately need a win so I had to do whatever I could to get it,\" Gay said. \"I got to the foul line early and that's how I got my rhythm.\"\nKarl stressed the team's overall performance.\n\"Rudy carried us offensively but I thought the team played together and moved the ball, found the open man so consistently,\" he said.\nGiannis Antetokounmpo and Khris Middleton had 21 points apiece for Milwaukee, and John Henson had 15 points and 11 rebounds. The Bucks have lost six of their last eight games.\nGay had 14 points in the first quarter to help the Kings take a 40-33 lead. They were 17 of 22 from the field in the period.\nSacramento, who had lost three out of four coming into the game, including an overtime loss Monday night at Charlotte, scored 69 points in the first half but only held at a three-point lead.\nThe Kings entered the fourth quarter with a 96-92 lead and extended it to 12 on Willie Cauley-Stein's free throw with 5:22 remaining. Antetokounmpo had a three-point play to cut it to 113-107 with 3:50 left. Gay then made a 3-pointer and was fouled. He made the free throw to build the Sacramento lead to 10.\nTIP-INS\nKings: Sacramento wrapped up a five-city trip. .... Kosta Koufos replaced Cousins in the starting lineup. Cousins, who injured his back against Charlotte, could return Friday. ... Only eight players saw action.\nBucks: Bayless hit a 3-pointer with two defenders in his face as time expired in the second quarter. Bayless made all three of his 3-point attempts in the first half. ... Milwaukee was 7 of 14 from 3-point range in the first half.\nONE OF A KIND:\nKarl said he has struggled to think of a player with a comparable skill set of Antetokounmpo. \"Is he not unique? No one plays like this guy. This guy is the new guy. This is the new form. He goes left and swings back right and all of sudden he's above the rim.\"\nUP NEXT\nKings: Host Minnesota on Friday night.\nBucks: At Orlando on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994094.07475
}