{
  "game_id": "0021900326",
  "espn_id": "401160968",
  "date": "Dec 06, 2019",
  "matchup": "OKC vs. MIN",
  "headline": "Thunder hit buzzer-beater to force OT, then top Timberwolves",
  "body": "OKLAHOMA CITY --  The Thunder had found multiple ways to lose close games this season.\n\nNot this time. Chris Paul scored a season-high 30 points and Oklahoma City pulled off an improbable 139-127 overtime victory over the Timberwolves on Friday night.\n\nWith Minnesota ahead 121-119 and 1.1 seconds remaining in regulation, Oklahoma City fouled Karl-Anthony Towns. He missed a free throw, then Minnesota was issued a technical foul for a delay of game because Jordan Bell did not have his jersey tucked in when he subbed in. It was a technical because the Timberwolves had been called for delay of game late in the third quarter, and a technical is given on a second delay of game.\n\nDanilo Gallinari made the technical free throw for Oklahoma City, then Towns shot his second free throw at the other end. He made it, putting Minnesota up two but giving Oklahoma City a chance at a throw-in. The Thunder would have had to scramble if Towns had missed because they were out of timeouts. Steven Adams took advantage of the unexpected opportunity and completed a nearly length-of-the-court pass to Dennis Schroder, who made a layup as time expired to force overtime.\n\nIt left the Thunder celebrating and the Timberwolves stunned.\n\n\"I ain't ever been part of something like that,\" Towns said. \"I've been a part of a lot of basketball games in my life, but I've never seen something like that happen . just the execution of everything going down.\"\n\nBell was in no mood to discuss it after the game. He walked past a group of reporters and said, \"I'll save my money.\"\n\nTowns said he was trying to miss the second free throw, but that -- and everything else -- went haywire in that final sequence during regulation.\n\nOklahoma City was prepared.\n\n\"We actually practiced that specific situation a lot in practice, and to see it pay off is good,\" sad Thunder guard Shai Gilgeous-Alexander, who scored 29 points.\n\nOklahoma City outscored the Timberwolves 17-5 in the extra period.\n\n\"We knew once we made the shot, we had a lot more work to do, and we were willing to do whatever it took to win,\" Gilgeous-Alexander said.\n\nSchroder scored 25 points, Adams had 22 points and 11 rebounds, and Gallinari scored 21 points for the Thunder.\n\nJeff Teague scored a season-high 32 points, and Towns added 30 for the Timberwolves.\n\nMinnesota coach Ryan Saunders said Minnesota played well enough to win.\n\n\"We're going to pick ourselves up and be better,\" he said. \"But it hurts.\" TIP-INS\n\nTimberwolves: F Andrew Wiggins sat out with a left thumb sprain. Wiggins averages 24.9 points per game. ... Committed 13 fouls in the third quarter. .... Minnesota made 2 of 6 free throws in the fourth quarter. ... Towns made 5 of 9 3-pointers.\n\nThunder: Thunder G Abdel Nader got his first start of the season and the third of his three-year NBA career. .... G Terrance Ferguson was out with soreness in his right hip. .... G Deonte Burton served a one-game suspension due to conduct detrimental to the team.\n\nFIRST TIME\n\nThe Thunder had five players score at least 20 points for the first time since the team started playing in Oklahoma City in 2008-09. According to the Thunder, it was the first time that has happened for any NBA team since the Atlanta Hawks did it in 2004.\n\n\"Oh wow,\" Paul said. \"That's sick. I didn't know that. It just shows that we played the right way. Played the right pace and tempo. Defense got to be better, but you know a win is a win and we are going to take it.\"\n\nOFFICIAL OUT\n\nOfficial Haywoode Workman was injured during the game Scott Foster and Mark Ayotte finished it out as a two-man crew.\n\nFREEBIES\n\nOklahoma City made 32 of 34 free throws in the second half and overtime, including 8 of 8 in the extra period.\n\n\"We did a lot of fouling in the third and fourth quarter, and then overtime,\" Saunders said. \"We need to play more clean in that sense.\"\n\nThe Thunder outscored the Timberwolves 36-14 from the free throw line overall.\n\nUP NEXT\n\nTimberwolves: At Los Angeles Lakers on Sunday.\n\nThunder: At Portland on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996241.414562
}