{
  "game_id": "0022400928",
  "espn_id": "401705494",
  "date": "Mar 10, 2025",
  "matchup": "PHI @ ATL",
  "headline": "Daniels leads balanced attack with 25 points as surging Hawks beat short-handed 76ers 132-123",
  "body": "ATLANTA -- — Dyson Daniels scored 25 points, and the surging Atlanta Hawks beat the short-handed Philadelphia 76ers 132-123 on Monday night.\n\n\r\n              Atlanta shot 54.1% from the field and had six players score in double figures. Zaccharie Risacher had 22 points, including 20 in the first half, and Terance Mann added a season-high 19.\n\n\r\n              The Hawks (31-34) have won three straight and four of five overall. \n\n\r\n              Quentin Grimes scored 35 points, including 17 in the fourth quarter, for the 76ers (22-42), who have lost four of five. Ricky Council IV matched his career high with 19 points.\n\n\r\n              Risacher's follow-up, two-handed jam helped the Hawks close the first half strong for a 66-57 lead at the break.\n\n\r\n              Takeaways\r\n              76ers: The 76ers had only nine players in uniform because of injuries for several notable players, including point guard Tyrese Maxey and forwards Paul George and Kelly Oubre Jr. The team announced George also will miss Wednesday night’s game at Toronto with left groin soreness. Maxey missed his fourth consecutive game. Andre Drummond, the normal starting center, was held out due to an illness.\n\n\r\n              Hawks: Point guard and leading scorer Trae Young (left calf contusion) did not play. ... Daniels, who leads the NBA with 178 steals and his average of 3.02 per game, added to his total with a takeaway on Philadelphia’s first possession.\n\n\r\n              Key moment\r\n              The Hawks outscored the 76ers 23-7 over the final 4:50 of the first half. They never trailed in the second half.\n\n\r\n              Key stat\r\n              The Hawks claimed a 47-31 advantage in rebounds. Risacher and Clint Capela each had eight.\n\n\r\n              Up next\r\n              Each team plays Wednesday night, when the Hawks host Charlotte and the 76ers visit Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998206.615368
}