{
  "game_id": "0022400624",
  "espn_id": "401705190",
  "date": "Jan 23, 2025",
  "matchup": "MIL vs. MIA",
  "headline": "Lillard, Bucks overcome travel issues to trounce Heat 125-96 for 5th straight win",
  "body": "MILWAUKEE -- — Damian Lillard had 29 points, 11 assists and nine rebounds and the Milwaukee Bucks overcame travel issues to beat the Miami Heat 125-96 on Thursday for their fifth straight victory.\n\n\r\n              Lillard had appeared to get his fourth career triple-double before leaving with 3:57 remaining, but the 10th rebound that had been credited to Lillard was changed.\n\n\r\n              The start was pushed back an hour due to the Bucks’ troubles getting out of New Orleans, which had a historic snowstorm Tuesday. The Bucks’ scheduled Wednesday game with the Pelicans was postponed, and their plane arrived in Milwaukee less than three hours before the start Thursday.\n\n\r\n              Milwaukee's Giannis Antetokounmpo had 25 points and 12 rebounds. Gary Trent Jr. scored a season-high 21 points and shot 7 of 10 on 3-point attempts.\n\n\r\n              Kel'el Ware had 22 points and 10 rebounds for Miami. Tyler Herro had 21 points and nine assists.\n\n\r\n              Miami's Jimmy Butler began serving a two-game suspension for what the Heat described as a “continued pattern of disregard of team rules, insubordinate conduct and conduct detrimental to the team.” \n\n\r\n              Takeaways\r\n              Heat: Miami needed to play its best to withstand Butler's absence. The Heat instead couldn't slow down Milwaukee and failed to capitalize on the Bucks' late arrival to Milwaukee.\n\n\r\n              Bucks: The Bucks trailed 18-3 midway through the first quarter. But they still exceeded 120 points for a fifth straight game.\n\n\r\n              Key moment\r\n              Lillard scored six points in the final 1.1 seconds of the first half for a 71-55 lead. He was fouled by Duncan Robinson on a 3-pointer and hit three free throws. After Ware threw away the inbounds pass, Lillard made a corner 3.\n\n\r\n              Key stat\r\n              Lillard had his big performance despite going scoreless for the first 18 1/2 minutes.\n\n\r\n              Up next\r\n              Both teams play Saturday. The Heat will be at Brooklyn, while the Bucks begin a four-game trip at the Los Angeles Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997836.504148
}