{
  "game_id": "0021900509",
  "espn_id": "401161151",
  "date": "Jan 02, 2020",
  "matchup": "IND vs. DEN",
  "headline": "Nuggets use second-half rally to win at Indiana 124-116",
  "body": "INDIANAPOLIS --  Denver Nuggets rookie Michael Porter Jr. took command on his hometown stage Thursday night.\n\nHe repeatedly beat Pacers defenders and even occasionally the shot clock with his nifty drives to the hoop. He knocked down 3-pointers. He even upstaged All-Star teammate Nikola Jokic.\n\nPorter scored a season-high 25 points, helping the Nuggets battle back from a double-digit deficit in the first half and leading them past Indiana, 124-116.\n\n\"It was cool,\" said Porter, whose first appearance on the Bankers Life Fieldhouse floor came as a fourth grader. \"I was hitting some of my shots and doing some of my moves that I used to do, so I felt pretty good out there.\"\n\nIt probably looked familiar to some in the crowd, too.\n\nPorter spent Wednesday reminiscing with old grade-school buddies from an Indianapolis suburb and invited them to his first NBA appearance on the Pacers' home court.\n\nHe couldn't have written a more perfect script.\n\nPorter helped the Nuggets get back on track after they gave up 37 first-quarter points, helped them take control late in the third quarter and was still playing well enough to help them close it out -- with some help from his teammates.\n\nHe wound up 11 of 12 from the field, 2 of 3 on 3-pointers, grabbed five rebounds and had one big assist.\n\nAnd on a night Jokic struggled because of foul trouble, the Nuggets needed someone else to step forward.\n\nYes, Jokic finished with 22 points, 12 in the fourth quarter, and seven rebounds. But it was Porter who drew the rave reviews.\n\n\"It's another glimpse into a very bright future,\" Nuggets coach Michael Malone said. \"He just got his first postgame water celebration, the guys dumped him. Everybody on the bench was happy for him.\"\n\nJeremy Lamb had a season-high 30 points for the Pacers, who have lost four of six.\n\nDomantas Sabonis had 18 points, nine rebounds and nine assists, falling just short of his first career triple-double for the second time this week.\n\nBut it was a frustrating night for the Pacers, who led the entire first half and never trailed until another Indiana native, Gary Harris, knocked down a 3-pointer with 9:16 left in the third quarter to make it 73-72.\n\nLamb answered with a 3, which turned the game into a back-and-forth contest until Monte Morris closed out the the third with a 3-pointer and an 18-foot jumper -- off a rebound and pass from Porter -- to give the Nuggets a 92-88 lead.\n\nDenver opened the fourth by outscoring Indiana 11-6 to make it 103-94 and the Pacers could only get as close as 107-104 with 6:31 to go. Jokic and Porter scored eight of Denver's next 10 points to seal the victory.\n\n\"You have to tip your cap to him,\" Turner said, referring to Porter. \"I've been following his career and I think he's been through a lot. It's cool and refreshing to see someone like that go off and have a good game. You hope, obviously, it's against someone else.\"\n\nTIP-INS\n\nNuggets: Will Barton III had 16 points, 10 rebounds and five assists. ... Jamal Murray also had 22 points. ... Harris returned to the lineup after missing the previous two games with a bruised left shin and finished with 12 points. ... Jokic picked up three quick fouls and played just eight minutes in the first half. ... Denver had a 47-34 rebounding advantage and snapped a two-game losing streak in Indy ... The Nuggets had 27 assists, improving to 17-4 when posting 25 or more this season.\n\nPacers: Turner had 21 points and T.J. Warren added 20. ... Aaron Holiday finished with 10 assists. ... Lamb made all five of his 3-point attempts and also grabbed six rebounds. ... Indiana's first-quarer scoring total was a season high. ... Malcolm Brogdon has missed four of Indiana's last five games with injuries, this time with a sore back. ... The Pacers had won six straight home games before Thursday.\n\nTHEY SAID IT\n\nNuggets: \"I think everybody's getting more and more excited about what Michael's going to bring, not just in the future, but right now,\" Malone said.\n\nPacers: \"I felt like we had the feeling we were up more than we were. I felt like we were just cruising because we were making shots. But those are the times we have to improve as a team and go up by 20,\" Sabonis said.\n\nUP NEXT\n\nNuggets: Will make their third stop on a five-game road trip Saturday at Washington.\n\nPacers: Can pull off a second straight season sweep of the Hawks on Saturday in Atlanta.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995856.235751
}