{
  "game_id": "0022301174",
  "espn_id": "401585802",
  "date": "Apr 12, 2024",
  "matchup": "CLE vs. IND",
  "headline": "Donovan Mitchell scores 33 points, Cavaliers clinch playoff spot with 129-120 win over Pacers",
  "body": "CLEVELAND -- — Donovan Mitchell scored 33 points, Jarrett Allen had 29 points and 13 rebounds and the Cleveland Cavaliers clinched a playoff berth with a 129-120 victory over the Indiana Pacers on Friday night.\n\n\r\n              Indiana pulled within 120-118 with 2:04 remaining on Pascal Siakam’s drive, but Darius Garland answered with a 3-pointer over Siakam. The Cavaliers scored the final six points, capped by an Isaac Okoro three-point play that ended with him somersaulting before posing for the crowd.\n\n\r\n              Garland and Caris LeVert each finished with 16 points, and Max Strus had seven points and nine assists. Allen made 13 of 14 shots for Cleveland, which earned its first back-to-back playoff appearances since making four straight NBA Finals from 2015-2018.\n\n\r\n              “Tonight was the closest we were going to get to a playoff feel before the playoffs, and we felt that pressure as an organization,” Allen said. “We should celebrate this accomplishment because everybody has worked hard to make this happen. But the job is not done yet. We want to go far in the playoffs.\"\n\n\r\n              The Cavaliers also locked up a top-four seed in the East — and home-court advantage in the opening round — despite Mitchell only playing 11 games and averaging just 19.5 points since the All-Star break because of ongoing left knee soreness and a broken nose.\n\n\r\n              “It’s been a long 2/3 months, but I’ve continued to believe,” said Mitchell, whose scoring total was his highest since Feb. 12. “This is what I do. Now, how do I elevate myself to be better in the playoffs? This is a good win for us and I think we're in a good spot.”\n\n\r\n              Tyrese Haliburton had 19 points and 12 assists, Siakam scored 19 points and Myles Turner had 17 points for the Pacers, who can advance to the playoffs for the first time since 2020 with a win over Atlanta or a Philadelphia loss on Sunday.\n\n\r\n              Thanks to the jumbled postseason picture, Indiana can finish as high as fifth and as low as eighth in the East. The seventh- and eighth-place clubs will be part of the play-in tournament.\n\n\r\n              “Sunday is what you play your whole season for, it’s one game at home with an opportunity,” Pacers coach Rick Carlisle said. “We’ll have to flush this as soon as we can and get ready. Tonight was disappointing and we’ve got some things to get cleaned up.”\n\n\r\n              Aaron Nesmith scored nine points in the third and Haliburton had eight, pulling Indiana to 97-94 going into the fourth. Pacers forward Obi Toppin sprained his left ankle in the period and did not return.\n\n\r\n              The Cavaliers built a 14-point lead in the second and were up 70-59 at halftime. Mitchell scored 18 points in 18 minutes and Allen had 16 points and nine rebounds.\n\n\r\n              “There were times this year when many people had us dead in the water,” Cleveland coach J.B. Bickerstaff said. “Somehow, some way, this group stuck together and persevered. I think that’s a great sign for us.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Atlanta on Sunday.\n\n\r\n              Cavaliers: Host Charlotte on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996716.663025
}