{
  "game_id": "0022300255",
  "espn_id": "401584883",
  "date": "Nov 27, 2023",
  "matchup": "LAL @ PHI",
  "headline": "LeBron James suffers worst defeat in NBA career as Embiid, 76ers rout Lakers by 44 points",
  "body": "PHILADELPHIA -- — LeBron James never endured a lopsided basketball defeat like the one he suffered with Los Angeles in Philadelphia.\n\n\r\n              James has lost big before. His Miami Heat once got trounced by 36 points in the NBA Finals. The Indiana Pacers beat James and the Lakers by 42 in 2019. \n\n\r\n              But this blowout was an all-timer: By the time Joel Embiid clinched a triple-double in the third quarter, the 76ers were on their way to a 138-94 win over the Lakers on Monday night, the 44-point loss now the worst in James' career that dates to 2003.\n\n\r\n              “What needs to change in order for that to not happen again? A lot,” James said, without elaboration.\n\n\r\n              The miserable milestones piled up for the Lakers. It was their worst loss to the 76ers in 290 games in the series.\n\n\r\n              It was so bad, James didn't even grab a rebound.\n\n\r\n              OK, one more: The 76ers beat the Lakers for the seventh straight time.\n\n\r\n              “That's my favorite team,” Embiid said, again noting he learned of basketball through Kobe Bryant. “Any time I play against them, you want to get the win. But I do it every night anyways against every other team.”\n\n\r\n              The box score tells part of the story. The 76ers hit 22 3-pointers to just seven for the Lakers, and even when Embiid sat out the entire fourth quarter, the 76ers still outscored them 40-14.\n\n\r\n              “We got killed on the 3-point line,” James said. “They made shots. Give them credit.”\n\n\r\n              The rest? It was just a lethargic effort from a team that seemed resigned early — the 76ers led by 25 in the first half — that was it was a good night to throw in the towel.\n\n\r\n              “Your competitive spirit has to be at a high level,” Lakers coach Darvin Ham said. “It almost has to be bulletproof to a certain degree. You have to meet force with force. They outhustled us.”\n\n\r\n              The reigning NBA MVP, Embiid finished with 30 points, 11 rebounds and 11 assists for his sixth career triple-double. It was Embiid's first of the season and his seventh career game with 10-plus assists. \n\n\r\n              Embiid's anticipated showdown with James never really materialized. James scored 18 points in 29 minutes but nothing he did could make a dent in the 76ers' lead. He has now played more minutes than any player in NBA history, with playoff time included.\n\n\r\n              “That doesn't mean much to me,” James said.\n\n\r\n              Tyrese Maxey scored 31 points for the 76ers. Anthony Davis had 17 points and 11 rebounds for the Lakers.\n\n\r\n              The 76ers opened the game 3-point happy and hit 13, a season high for a half, on 26 shots.\n\n\r\n              Maxey hit four. The Lakers, though, left any Sixer not named Maxey or Embiid open and paid for it. Patrick Beverley hit three in the half and Marcus Morris Sr. went 3 for 3. Embiid buried one for a 64-39 lead.\n\n\r\n              The Lakers missed 7 of 10 3s in the half.\n\n\r\n              With Eagles QB Jalen Hurts watching courtside, Embiid blocked Davis with such authority the smack could be heard rows deep off the court.\n\n\r\n              Maxey scored 20 at the break as he tries to strengthen his bid for his first All-Star berth. Embiid had 17 as he makes a run at his third straight scoring title.\n\n\r\n              “You certainly don't go into a game like this expecting that kind of game to break out,” 76ers coach Nick Nurse said. “When the 3 ball starts going in the way they did early, I think that just energizes everybody.”\n\n\r\n              The 76ers put their 12th win away early.\n\n\r\n              They also scored points for trash talk when forward Paul Reed called Davis “a big flopper.”\n\n\r\n              “You know, he’s gonna be flailing,” Reed said at shootaround.\n\n\r\n              Both coaches were bemused at why a backup poked Davis.\n\n\r\n              “Go guard him, I guess. Best of luck, Paul,” Ham said.\n\n\r\n              No matter. The game was never competitive enough to worry much about fouls and flops. \n\n\r\n              The 76ers won their second straight after a two-game losing streak and could have Kelly Oubre Jr. back soon. Oubre averaged 16.3 points in eight games before he was injured in an alleged hit-and-run accident. He participated in shootaround and may join the 76ers on their upcoming two-game road trip.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Have back-to-back road games Wednesday at Detroit and Thursday at Oklahoma City.\n\n\r\n              76ers: Hit the road for games Wednesday at New Orleans and Friday at Boston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995542.126567
}