{
  "game_id": "0022400305",
  "espn_id": "401704871",
  "date": "Dec 01, 2024",
  "matchup": "ORL @ BKN",
  "headline": "Magic beat Nets 100-92 for 2nd win over Brooklyn in 3 days",
  "body": "NEW YORK -- — Franz Wagner had 20 points, nine rebounds, eight assists and two blocks, and the Orlando Magic claimed their sixth straight win, and second in three days over the Nets, with a 100-92 victory against Brooklyn on Sunday.\n\n\r\n              Goga Bitadze added 12 points and 13 rebounds, Kentavious Caldwell-Pope had 16 points and Wendell Carter Jr. had 14 points and seven rebounds to help Orlando claim its 12th win in its past 13 games despite committing a season-high 22 turnovers.\n\n\r\n              Cam Johnson led Brooklyn with 26 points, and Dennis Schroder added 20 points and seven assists. \n\n\r\n              After an evenly matched first half that featured 14 lead changes and 11 ties, Orlando did its best to take control in the third quarter by outscoring Brooklyn 25-19. Despite losing second-leading scorer Jalen Suggs, who picked up his fifth foul at the 10:41 mark, the Magic went on a 17-6 run and built their largest lead, 69-59.\n\n\r\n              But Brooklyn did not wilt. The Nets opened the fourth quarter with a 7-0 run, with Schroder scoring five points, including a three-point play that gave them the lead 76-75 with 10:45 left.\n\n\r\n              Takeaways\r\n              \r\n              Orlando: The Magic used their size advantage with Wagner and Bitadze to outscore Brooklyn 54-38 in the paint and claim a 52-33 rebounding advantage.\n\n\r\n              Brooklyn: The Nets dropped their second straight to the Magic and fell to 3-11 against the Eastern Conference this season.\n\n\r\n              Key moment\r\n              The Magic turned up the heat on Brooklyn defensively in the fourth quarter by forcing six fourth-quarter turnovers and outscored Brooklyn 17-9 over the final 7:01. \n\n\r\n              Key stat\r\n              The Magic, the league’s top defense, also held the league’s second-ranked 3-point-shooting team to just 8 for 31 (25.8%) from deep Sunday.\n\n\r\n              Up next\r\n              The Magic are at the Knicks on Tuesday, and the Nets are at the Bulls on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997570.279063
}