{
  "game_id": "0021800872",
  "espn_id": "401071545",
  "date": "Feb 21, 2019",
  "matchup": "HOU @ LAL",
  "headline": "LeBron rallies Lakers to 111-106 victory over Rockets",
  "body": "LOS ANGELES --  LeBron James knows that he needs to turn up his intensity if the Los Angeles Lakers are going to make the playoffs. He certainly did that on Thursday night against the Houston Rockets when his team needed it the most.\n\nJames scored 16 of his 29 points in the second half as the Lakers rallied from a 19-point deficit midway through the third quarter to defeat the Rockets 111-106.\n\nIt was Los Angeles' largest comeback win of the season and its sixth when trailing by 15 or more at any point. The previous biggest comeback came on Feb. 7 at Boston when it was down 18 in the second quarter.\n\n\"I need to be in that level right now. Knowing the circumstances we are in and kick starting something,\" said James, who also had 11 rebounds and six assists. \"I like where I am at and will continue to get better. Tonight was a step in the right direction.\"\n\nThe Lakers were down 95-88 with 7:49 remaining when they went on a 17-4 run over a six-minute span to take control. James, who scored eight points during the run, gave Los Angeles a 99-97 lead with 4:15 remaining. They would lead by as many as eight in the final minute.\n\nAfter struggling from the field the first three quarters, the Lakers were 8 of 13 from the field and 10 of 11 from the foul line in the final 12 minutes. Houston, which made close to half its shots the first 36 minutes, was just 7 of 19 from the field and 2 of 12 on 3-pointers. It also didn't get to the foul line the final 20 mintues.\n\n\"It looked like we got our defensive mojo, our defensive confidence, back as the game went along,\" Lakers coach Luke Walton said. \"We had to get to different match-ups but we kept scrapping a found a way to give ourselves a chance.\"\n\nBrandon Ingram had 27 points -- including 11 of 14 from the foul line -- and 13 rebounds. Kyle Kuzma added 18 points.\n\nJames Harden led Houston with 30 points, 10 rebounds and nine assists before fouling out with 1:24 remaining. It is his 32nd consecutive game where he has scored 30 or more points, overtaking Wilt Chamberlain for the second-longest streak in NBA history. Chamberlain also holds the record at 65 games.\n\n\"It's a few things like it has been throughout the entire season,\" said Harden on not sustaining a large lead. \"Sooner or later, you have to be able to correct them.\"\n\nPaul, who had 23 points and 10 rebounds before also fouling out, was an assist shy of a triple double.\n\n\"It comes down to where LeBron makes big shots and we didn't,\" Houston coach Mike D'Antoni said. \"We probably ran a little bit out of gas. It was a lot of little factors.\"\n\nHouston led 32-22 at the end of the first quarter when it ended the period with eight straight points, including back-to-back 3-pointers by Faried and Austin Rivers.\n\nHarden's jumper gave the Rockets a 52-39 advantage with 4:20 remaining before the Lakers went on an 9-0 run. The Rockets would lead 58-52 at halftime.\n\nPLAYOFF CHASE\n\nThe Lakers evened their record at 28-28 but remain in 10th place in the Western Conference and 2 1/2 games behind the Clippers for the final playoff spot. Their next three games are against teams with losing records and they face the Clippers twice down the stretch.\n\nWalton said he has seen a more intense James since the Lakers returned from the All-Star break.\n\n\"He's had a more serious look to his face,\" Walton said. \"He recognizes where we are at and the sense of urgency. He was huge tonight but he's always great.\"\n\nCAPELA RETURNS\n\nHouston center Clint Capela returned to the lineup for the first time since Jan. 13 and had a double-double. Capela -- who had 12 points and 10 rebounds -- suffered a right thumb injury against Orlando and missed 15 games.\n\nTIP-INS\n\nRockets: Eric Gordon scored 14 points and Kenneth Faried 13. ... It is only the fifth loss for Houston in 33 games when it has led after three quarters.\n\nLakers: Reggie Bullock scored 14 points. ... G Mike Muscala missed the game due to a sprained right ankle.\n\nUP NEXT\n\nRockets: Travel to the Golden State Warriors on Saturday night.\n\nLakers: Visit the New Orleans Pelicans on Saturday night.\n\n---\n\nFollow Joe Reedy at www.twitter.com/joereedy\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995297.943143
}