{
  "game_id": "0022400239",
  "espn_id": "401704805",
  "date": "Nov 17, 2024",
  "matchup": "POR vs. ATL",
  "headline": "Shaedon Sharpe scores 32 points and Trail Blazers withstand late Hawks rally for 114-10 win",
  "body": "PORTLAND, Ore. -- — Shaedon Sharpe had 32 points, including a key 3-pointer down the stretch, and the Portland Trail Blazers withstood a late rally by the Atlanta Hawks for a 114-110 victory on Sunday night. \n\n\r\n              Dalano Banton added 23 points for Portland, which has won its last three games.\n\n\r\n              Portland led 94-81 heading into the last period, but the Hawks went on a 10-0 run to get within 99-96 before Trae Young's 3-pointer tied it at 99. Young made another 3 that gave Atlanta a 102-101 lead. \n\n\r\n              Sharpe's shot-clock beating 3-pointer with 1:03 left put Portland ahead 109-108, and the Blazers hung on the rest of the way. Sharpe had Portland's last 11 points. \n\n\r\n              The Blazers trailed by as many as 16 points in the first half, but went ahead 77-76 on Banton's 3-pointer in the third quarter. \n\n\r\n              The Hawks jumped out to 25-9 lead but Portland got within 56-54 late in the first half on Deni Avdija's jumper. \n\n\r\n              Young finished with 29 points for the Hawks, who led 64-56 at the break. \n\n\r\n              Takeaw\r\n              ays\r\n              Hawks: Forward De'Andre Hunter missed the game with right knee injury management, but he could play Monday when the team visits Sacramento. Hunter has played in three games this season. \n\n\r\n              Trail Blazers: DeAndre Ayton missed his third straight game with what the Blazers said Sunday was a deep contusion in his right index finger. ... Anfernee Simons missed a second game because of an illness. ... Oregon quarterback Dillon Gabriel was at the game. \n\n\r\n              Key Moment\r\n              Sharpe made three straight dunks midway through the third quarter that helped Portland close to within 76-74 and energized the Blazers. \n\n\r\n              Key Stat\r\n              Atlanta's Dyson Daniels has at least one steal in 12 straight games, the second-longest active streak in the NBA. \n\n\r\n              Up Next\r\n              Hawks: Visit the Sacramento Kings on Monday night. \n\n\r\n              Trail Blazers: Visit the Oklahoma City Thunder on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998194.276534
}