{
  "game_id": "0022000054",
  "espn_id": "401267214",
  "date": "Dec 29, 2020",
  "matchup": "LAC vs. MIN",
  "headline": "Clippers rebound from 51-point debacle to top Wolves 124-101",
  "body": "LOS ANGELES -- — Lou Williams led seven Clippers in double figures with 20 points and Los Angeles routed the Minnesota Timberwolves 124-101 on Tuesday night in a game missing stars for both teams.\n\n\r\n                    The Clippers bounced back from a 51-point shellacking against Dallas two days earlier despite playing without Kawhi Leonard for the second straight game because of a mouth laceration. Minnesota big man Karl-Anthony Towns sat out with a dislocated left wrist.\n\n\r\n                    “It feels good to get a win after that atrocious loss,” said Reggie Jackson, who finished with 11 points. “We knew that wasn’t necessarily who we are.”\n\n\r\n                    Paul George added 18 points, Serge Ibaka had 16 points and eight rebounds, and Luke Kennard scored 15 for the Clippers. \n\n\r\n                    D'Angelo Russell led the Timberwolves with 22 points. Malik Beasley added 19 and Ricky Rubio had 17. Jarrett Culver equaled his career high with 10 rebounds.\n\n\r\n                    “We started the game the right way, but when things aren’t going our way, everybody plays selfish,\" Rubio said. \"We've got to learn.” \n\n\r\n                    The Timberwolves were coming off a 36-point loss to the Lakers on Sunday.\n\n\r\n                    “We didn’t learn nothing from the game against the Lakers,” Rubio said. “We came with the same mindset of just, go out there and hoop. That can’t continue. We are way worse than 2-2 right now.”\n\n\r\n                    The Clippers led by 20 at halftime and 31 in the third quarter on Williams' three-point play. That's when they made six 3-pointers, including four in a row, with George hitting two of his three in that stretch.\n\n\r\n                    Williams' points came off the bench to go with 12 by Ivica Zubac, helping the Clippers' backups outscore Minnesota's reserves 56-32.\n\n\r\n                    “Zubac was making their team kind of pay for being a smaller team,” Jackson said. “He made it easy on us.”\n\n\r\n                    The Wolves were quicker out of the gate, opening a nine-point lead to start the game. The teams were tied once in the second quarter, just before the Clippers' 31-11 run, including 12 in a row, that extended their lead to 70-50 at the break.\n\n\r\n                    “They couldn’t stop us after that,” Zubac said. “Guys were just more aggressive. Our coaching staff made a point that in the game against Dallas we had the least paint drives. Our focus was to put the ball on the floor and get into the paint.”\n\n\r\n                    All 12 Clippers players scored in the game. They shot 56% from the field and had a season-high 32 assists, equaling their total against Denver on Christmas. \n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Also missing the game were G Jaylen Nowell (left ankle) and G Josh Okogie (left hamstring strain).\n\n\r\n                    Clippers: Los Angeles coach Tyronn Lue said he isn't sure when Leonard will get the eight stitches out of his mouth that were needed after he accidentally got elbowed by Ibaka going for a rebound last Friday at Denver. ... The team is using prerecorded video performances of the national anthem and reruns of rap performances from previous seasons at halftime. \n\n\r\n                    CROATIA EARTHQUAKE\n\n\r\n                    Zubac grew up just east of the Croatian border and is a citizen of the country where a 6.3-magnitude earthquake struck southwest of the capital of Zagreb on Tuesday. Buildings were destroyed and at least seven people were killed.\n\n\r\n                    “I feel like I represent the whole country, coming from a small place. People are very proud from Croatia,\" Zubac said. “It’s tough times over there. That city that was hit (Petrinja) the most was ran over during the war and the place was still in bad condition, a lot of old buildings and houses.”\n\n\r\n                    Zubac said he spoke to people he knows in Croatia and they weren't seriously affected by the quake. \n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: Host Washington on Friday to begin the new year.\n\n\r\n                    Clippers: Host Portland in their final game of the calendar year.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997708.909246
}