{
  "game_id": "0022300787",
  "espn_id": "401585415",
  "date": "Feb 14, 2024",
  "matchup": "PHX vs. DET",
  "headline": "Suns shake off Booker's early ejection, roll past Pistons 116-100",
  "body": "PHOENIX -- — Kevin Durant scored 25 points and the Phoenix Suns overcame fellow All-Star Devin Booker's early ejection to rout Detroit 116-100 on Wednesday night in Pistons coach Monty Williams first game in Phoenix since being fired by the Suns.\n\n\r\n              Williams coached the Suns from 2019 through last season, leading them to the NBA Finals in 2021. He received a video tribute and a loud ovation from the sellout crowd before the game.\n\n\r\n              Booker was ejected 5:24 into the game after his second technical foul. He received the first technical for arguing with officials about a foul call against him. During a subsequent timeout and, after the Pistons’ Cade Cunningham shot free throws, Booker received the second one and an automatic ejection. Booker finished with seven points on 2-of-5 shooting.\n\n\r\n              Suns coach Frank Vogel also received a technical for arguing Booker’s ejection. There were 51 fouls called in the game — 31 on Detroit.\n\n\r\n              Durant said he was surprised at Booker's ejection, but understood the officials' wanting to control the game because of a pregame altercation between the Pistons' Isaiah Stewart and the Suns' Drew Eubanks that led to Stewart's arrest for assault.\n\n\r\n              “Yeah it did, because he was talking to me,” Durant said. “I guess (Booker) said something that ticked the ref off, but they were on edge before the game anyway because of the situation and they thought it might escalate. I can see it from their perspective, but I just think the techs were too quick.”\n\n\r\n              Saben Lee scored 16 points and Eric Gordon had 13 points for Phoenix, with guard Bradley Beal sidelined after straining his left hamstring Tuesday night in a victory over Sacramento. Jusuf Nurkic had 10 points and 13 rebounds. \n\n\r\n              Simone Fontecchio led Detroit with 18 points. Every player who suited up for each team saw playing time in the final game for each squad before the All-Star break.\n\n\r\n              The Suns led 14-13 when Booker was tossed, then outscored Detroit 23-12 the rest of the quarter and pulled away in the second period for a 70-41 halftime edge. Their biggest lead in the game was 35 points.\n\n\r\n              “After Devin got thrown out, I knew our young guys didn’t understand what was about to happen,” Pistons coach Monty Williams said. “They got more physical and the game changed, we turned the ball over so many times and the momentum shifted right after that.”\n\n\r\n              Durant, who didn’t play in the fourth quarter, led the Suns in the first half with 12 points. Gordon, starting for , scored 10 points and Lee also had 10.\n\n\r\n              Eubanks had six points and eight rebounds in 18 minutes.\n\n\r\n              Stewart was arrested for assault for punching Eubanks at the arena hours before the teams played. Phoenix police said Stewart was issued a citation and released. Stewart was already listed as out for the game because of a sprained left ankle.\n\n\r\n              Eubanks said the altercation happened as he was coming into the arena for the game. He said an argument started and they were chest-to-chest before Stewart threw the punch. Security intervened and Eubanks said he was fine for the game.\n\n\r\n              “Keep the game first. There’s a lot of noise,” Durant said. “It’s unfortunate what happened before the game. It’s supposed to be a brotherhood, but I also understand, dudes get into stuff. We try to avoid that in this league. Hopefully, we can move on from it. We all support Drew.”\n\n\r\n              Williams, whose new team endured a NBA-record tying 28-game losing streak this season, relished the opportunity to come back and relive the successes of the Suns.\n\n\r\n              “Getting an opportunity to come (to Phoenix), the partnership I had with the players here in particular Devin, I think about how blessed I was to come here and coach this team,” Williams said before the game. “All the stuff that happened here was a treat.”\n\n\r\n              NEXT\n\n\r\n              Pistons: At Indiana on Thursday, Feb. 22.\n\n\r\n              Suns: At Dallas on Thursday, Feb. 22.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996650.1994271
}