{
  "game_id": "0022000108",
  "espn_id": "401267268",
  "date": "Jan 06, 2021",
  "matchup": "ORL vs. CLE",
  "headline": "Fultz suffers knee injury; Magic go on to beat Cavs 105-94",
  "body": "ORLANDO, Fla. -- — Former top overall draft pick Markelle Fultz suffered a season-ending tear of the anterior cruciate ligament in his left knee in the first quarter of the Orlando Magic’s 105-94 win over the Cleveland Cavaliers on Wednesday night.\n\n\r\n                    Fultz, who was off to the best start of his career, was driving to the basket less than five minutes into the game when he was cut off by Isaac Okoro and his left knee buckled without contact. The Orlando point guard writhed in pain on the floor for several minutes before he was helped into a wheelchair. The team confirmed after the game that Fultz tore his ACL.\n\n\r\n                    “It’s a huge blow for us,” said Magic center Nikola Vucevic, whose team also will be without standout forward Jonathan Isaac this season because of an ACL tear. “Unfortunately for (Fultz) this is really sad because for two years he had the injury with his shoulder, then last year he finally got to play and this year it was supposed to be a big year for him. He was ready and he started the season out awesome. This really sucks for a guy like him who has worked his way back. It’s hard to see and you feel for the guy.”\n\n\r\n                    Fultz signed a three-year, $50 million extension last month and was finally showing the promise that made him the No. 1 overall pick in the 2017 draft as he led the Magic to a quick start this season. He came in averaging a career-best 14-3 points in seven games.\n\n\r\n                    Fultz was drafted by the Philadelphia 76ers as part of their lengthy rebuild but struggled for years with a difficult-to-diagnose shoulder injury ultimately determined to be thoracic outlet syndrome, a nerve ailment that affected the feeling in his arm and hand. He was traded to the Magic in February 2019.\n\n\r\n                    Rookie Cole Anthony, who had eight points, four rebounds and three assists on Wednesday, will now be the starter at point guard for the Magic. Fellow rookie Jordan Bone will also see playing time with Michael Carter-Williams out with a sprained foot ligament.\n\n\r\n                    Terrence Ross scored 20 points and hit five 3-pointers to lead the Magic, who beat the Cavaliers for a second time in three nights.\n\n\r\n                    “This is part of the league. It happens, people get hurt,” Ross said. “We play a lot and go through a lot and people get hurt. We’ve still got to keep playing ball. We have a way to play and we can’t let the whole season fall or collapse because of a couple of injuries.”\n\n\r\n                    Dwayne Bacon added 19 points on 8-of-14 shooting and Nikola Vucevic chipped in 16 points, seven rebounds and six assists for an Orlando squad off to its best eight-game start since the 2017-18 season. Down by as much as 13 points early on, the Magic surged ahead by as much as 21 early in the fourth quarter.\n\n\r\n                    Collin Sexton scored 21 points for Cleveland, his eighth straight game with at least 20 points to start the season. That broke LeBron James’ franchise record from 2004-05. Sexton played through a left ankle sprain suffered in the first half.\n\n\r\n                    Orlando missed its first six 3-point tries but made 10 of 17 from beyond the arc in the second and third quarters. Cleveland was 4 of 26 from 3-point range.\n\n\r\n                    Andre Drummond had 19 points and 15 rebounds for the Cavs, his eighth straight double-double.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers coach J.B. Bickerstaff said he stopped his preparations for the game to watch supporters of President Donald Trump storm the U.S. Capitol. “It’s saddening and it’s disgusting, to be honest with you. Our democracy has been a beacon for hundreds of years of what the world ideologically should be, and people have looked up to us all over the world. And what is happening there is a disgrace,” he said.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: At Memphis on Thursday.\n\n\r\n                    Magic: At Houston on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997808.440976
}