{
  "game_id": "401809994",
  "espn_id": "401809994",
  "date": "Oct 30, 2025",
  "matchup": "MIL vs GS",
  "headline": "Rollins shines again as Bucks beat Warriors 120-110 without Antetokounmpo",
  "body": "MILWAUKEE -- — Ryan Rollins set a career scoring high for a second straight game with 32 points as the Milwaukee Bucks withstood Giannis Antetokounmpo’s absence to beat the Golden State Warriors 120-110 on Thursday night.\n\n\r\n              Antetokounmpo, who entered Thursday ranked second in the league in scoring (36.3) and rebounding (14.0), was dealing with left knee soreness that had him listed as probable in the Bucks’ injury report. The Bucks announced about an hour before the opening tip that the two-time MVP had been ruled out, and he watched the game from the bench.\n\n\r\n              Rollins shot 13 of 21 from the floor and 5 of 7 from 3-point range just two nights after scoring 25 points in a 121-111 victory over the New York Knicks. Rollins, who began his NBA career with Golden State in 2022-23, also had eight assists.\n\n\r\n              Myles Turner added 17 points for the Bucks. Cole Anthony had 16 before fouling out with 7:34 left to lead a Milwaukee bench that outscored Golden State's reserves 38-29.\n\n\r\n              Stephen Curry scored 27, Jonathan Kuminga 24 and Jimmy Butler 23 for Golden State. Butler also had 11 rebounds.\n\n\r\n              After trailing by eight with five minutes remaining, Golden State got Milwaukee’s lead down to 106-104 on Curry's 3-pointer with 4:03 left. Rollins answered 10 seconds later with a 3-pointer of his own to start an 11-2 run.\n\n\r\n              Rollins punctuated his big performance by sinking one last 3-pointer that capped the scoring with 25 seconds left.\n\n\r\n              Curry’s streak of consecutive successful free throw attempts ended at 57 when he missed one with 4:52 remaining. That was the second-longest such streak of Curry’s career, as he made 80 in a row from March 2019 to January 2021.\n\n\r\n              Up Next\r\n              Warriors: Visit the Indiana Pacers on Saturday.\n\n\r\n              Bucks: Host the Sacramento Kings on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042529.8276339
}