{
  "game_id": "0021900357",
  "espn_id": "401160999",
  "date": "Dec 11, 2019",
  "matchup": "IND vs. BOS",
  "headline": "Brogdon, Holiday help Pacers rally past Celtics 122-117",
  "body": "INDIANAPOLIS --  Indiana aced one major test Wednesday.\n\nNow coach Nate McMillan expects the Pacers to continue putting up high marks.\n\nMalcolm Brogdon scored 29 points and made all 15 of his free throws, the Holiday brothers combined for 20 fourth-quarter points and Indiana rallied from a 10-point deficit to finally beat the Boston Celtics 122-117.\n\n\"One of our problems all season has been closing out these games against elite teams,\" Brogdon said. \"Tonight we were able to do that so it will definitely help our confidence.\n\nThe rebuilt Pacers snapped a seven-game losing streak against Boston, which included a first-round playoff sweep last season. They managed to dig themselves out of a 94-84 hole to start the fourth quarter with teamwork, defense and patience. And they did it with injured All-Star Victor Oladipo cheering throughout the stretch run.\n\nThe fact this performance came on a night three-time All-Star Kemba Walker scored a season-high 44 points, making seven 3-pointers and dishing out seven assists to lead Boston only made it sweeter.\n\n\"He's obviously one of the great players in the league and once he gets downhill, it's tough to stop him,\" Aaron Holiday said. \"I just tried to fight over the screens and hoped my bigs could help me at the rim.\"\n\nFor McMillan, it was precisely the kind of effort he talked about Monday as the Pacers entered their most challenging three-week stretch so far.\n\nAnd against an old nemesis in Boston, the Pacers played it perfectly.\n\nThey withstood Walker's 15-point first quarter, his scoring flurries at the end of the first half and start of the second half, even the 12-2 run Walker and Jayson Tatum spurred to close out the third quarter.\n\nSo with Walker on the bench, Indiana took advantage and turned the game with a team effort.\n\nThe Pacers forced five turnovers in the first 8 1/2 minutes of the fourth quarter to close to 98-96.\n\nDoug McDermott finally tied the score at 102 with two free throws at the 5:07 mark. Aaron Holiday gave Indiana a 105-104 lead with 4:16 left and Justin Holiday added gave Indiana a 114-109 lead with 1:26 left. Brogdon made six free throws in the last 17.1 seconds and Walker fired an airball on a 3 that would have tied it with 4 seconds to go.\n\nBoston's four-game winning streak ended.\n\n\"I just missed,\" said Walker, who was 2 of 7 in the fourth. \"I took some good ones, maybe a few that weren't so good but I just missed.\"\n\nTIP-INS\n\nCeltics: Guard Marcus Smart missed his second straight game with a left eye infection. ... Boston had assists on each of its first 11 baskets. ... Jaylen Brown had 18 points, eight rebounds and eight assists before fouling out. ... Tatum finished with 16 points, Brad Wanamaker had 12 and Daniel Theis scored 11. ... The Celtics were 14 of 36 on 3s and their bench was outscored 47-19 by Indiana.\n\nPacers: NBA Commissioner Adam Silver and new Indianapolis Motor Speedway owner Roger Penske attended the game. ... Aaron Holiday scored 11 of his 18 points in the fourth quarter. Justin Holiday had 17 points, nine in the fourth. ... Domantas Sabonis had 15 points 14 rebounds and four assists, while T.J. Warren scored 14 and Myles Turner had 11. ... Brogdon also had eight assists and had the best free-throw shooting performance by a Pacer since Danny Granger made all 16 of his attempts on March 1, 2011. ... Indiana's bench outscored Boston's 47-19...\n\nBACK HOME AGAIN\n\nTrips to Indianapolis are usually enjoyable for Boston coach Brad Stevens, who led nearby Butler to two Final Four appearances after growing up in Brownsburg -- an Indianapolis suburb.\n\nAnd he's far from alone.\n\nGordon Hayward also grew up on the west side of Indianapolis and played on Butler's first Final Four team. Rookie guard Carsen Edwards starred at Purdue and rookie guard Romeo Langford was the state's 2018 Mr. Basketball Award winner. He played at Indiana University last year and had a large group of supporters make the trip from his southern Indiana hometown, New Albany, for the game.\n\nOLADIPO UPDATE\n\nMcMillan said Oladipo looks better in practice and continues to make progress, but there's still no timetable for his return from a ruptured quad tendon in his right knee.\n\nHe suffered the injury in January.\n\n\"He's still rehabbing, working hard and he's certainly getting better,\" McMillan said. \"He's getting closer but I think he's still a ways off.\"\n\nUP NEXT\n\nCeltics: Head home for their second showdown this season with division rival Philadelphia on Friday.\n\nPacers: Will try to extend their winning streak over the Hawks to six straight Friday in Atlanta.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995866.415605
}