{
  "game_id": "0021500864",
  "espn_id": "400828751",
  "date": "Feb 26, 2016",
  "matchup": "TOR vs. CLE",
  "headline": "Kyle Lowry hits winner on career night; LeBron misses at buzzer",
  "body": "TORONTO -- Kyle Lowry had a big smile after capping off a career night by hitting the clinching basket in the closing seconds.\nLowry finished with a career-best 43 points to help the Toronto Raptors beat the Eastern Conference-leading Cleveland Cavaliers 99-97 on Friday night.\n\"My first game winner in my illustrious 10-year career,\" he said, noting that he was at Villanova that last time he'd done that.\nTerrence Ross added 15 for Toronto, which won its 10th straight at home to tie a franchise record previously set between March 24 and Nov. 4, 2002.\n\nLeBron James, who scored 25, had a chance to win the game with a late 3-pointer, but his shot missed the rim completely as time expired.\nJames is now 5-for-47 (10.6 percent) over the past 10 seasons on potential game-tying and go-ahead field goals in the final 5 seconds of the fourth quarter and overtime. Among players with at least 25 attempts, only Jamal Crawford has a worse field goal percentage on those shots over that span, according to ESPN Stats & Information. James also has missed 16 go-ahead 3-pointers with less than 5 seconds remaining in the fourth quarter and overtime during his career, the most in the NBA since he entered the league in 2003-04.\nKevin Love added 20 for the Cavaliers, whose lead over Atlantic Division-leading Toronto in the East was cut to two games. They also conceded the playoff seeding tiebreaker to Toronto, with the Raptors clinching the season series 2-1.\nLowry played down his individual effort, though, which bettered the 41 he put up against Golden State on Dec. 5.\n\"The bigger deal is that we won the game,\" he said. \"That's all that matters. I think we grew tonight, but we've got the team to get better. Now we've (got to) put our efforts into Detroit and worry about Detroit.\"\nLowry's 15-for-20 performance also helped make up for an ineffective night from the team's top scorer, DeMar DeRozan, who was suffering from flu-like symptoms and was held to a season-low six points.\nDwane Casey had insisted all day that this matchup between the East's top two teams was just another game and not a possible playoff preview, and he refused to change his tune following the victory, with a game at Detroit coming next.\n\"Again, it is just one game,\" he said. \"If we come back and stub our toe on Sunday, what does it mean? Nothing. Zero. It is one of 82.\"\nIn the Cleveland dressing room, Love disagreed about the importance of the game.\n\"Anybody who says it wasn't is lying to you,\" he said when asked whether it was a big game, particularly with the playoff tiebreaker on the line. \"We knew coming in it was going to be a hostile environment away from home. They're a very good team and had won nine in a row before tonight, so we knew they were going to be tough to beat, and it was no different.\"\nDespite leading for almost the entire game, Cleveland faltered down the stretch, allowing Toronto to tie the score with 3:03 left courtesy of a 9-0 run over 90 seconds. For James, it was the kind of performance the team has to learn from.\n\"It's mental mistake after mental mistake, and those hurt more than anything when you can play better mentally,\" he said. \"People get so caught up in the physical side of the game. We lack mental (strength) right now, and we've got to continue to get better with it.\"\nTHROWING THOMAS\nFormer NFL MVP and Hall of Famer Thurman Thomas was at the game, zipping signed footballs into the crowd with the kind of compact spirals that almost made you forget he was a running back and not a quarterback.\nBENCH MARK\nThe Raptors' reserves combined to outscore the Cavaliers' backups 37-23, highlighted by 15 from Ross and another 11 from Bismack Biyombo.\nMILESTONE MAN\nDeRozan appeared in his 500th game with Toronto on Friday, becoming the fourth Raptors player to reach the milestone, joining Morris Peterson, Jose Calderon and Chris Bosh. He received a video tribute and a standing ovation when the milestone was announced in the first quarter.\nTIP-INS\nCavaliers: Mo Williams (left knee) sat out the game. ... Cleveland is 43-of-86 from 3-point range against the Raptors this season, well above its season average of 10.1 made 3s per game. When asked whether he looked for a certain number of 3s, coach Tyronn Lue said, \"Not a number, just open 3s. We don't want to force shots and take really quick shots contested, but when we get our chance to get our shot and take our shot, we want to take it.\"\nRaptors: With his two 3-pointers, Lowry tied Andrea Bargnani (579) for second on the franchise's all-time list and now trails only Peterson (801). ... Jonas Valanciunas left the game in third quarter after being elbowed in the ribs by James and headed to the dressing room for a rib/diaphragm exam. He returned to the bench later in the quarter and was back on the floor in the fourth. ... Toronto has won 26 consecutive games when holding opponents to fewer than 100 points, the second-longest streak in team history and one shy of tying the franchise record.\nUP NEXT\nCavaliers: At Washington on Sunday.\nRaptors: At Detroit on Sunday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994711.937711
}