{
  "game_id": "0022000570",
  "espn_id": "401307353",
  "date": "Mar 11, 2021",
  "matchup": "TOR vs. ATL",
  "headline": "Snell's 3-pointer at buzzer lifts Hawks over Raptors 121-120",
  "body": "TAMPA, Fla. -- — Tony Snell hit a 3-pointer at the buzzer Thursday night and the Atlanta Hawks came back from a 15-point deficit in the final six minutes to beat the Toronto Raptors 121-120.\n\n\r\n                    Trae Young scored 37 points for the Hawks, who won their third straight. It was Young's sixth assist of the game that set up Snell for a clean look just before the final horn.\n\n\r\n                    \"Trae draws so much attention, but he didn’t have anything (open),” said Hawks coach Nate McMillan. “So he trusted his teammate, kicked it back out, and Tony did what he’s been doing for us — he hit a big 3.”\n\n\r\n                    Norman Powell scored 33 points for Toronto and Chris Boucher had another big game off the bench with 29 points and nine rebounds. Kyle Lowry, who moved into second place on Toronto's career scoring list, finished with 17 points and 12 assists.\n\n\r\n                    Boucher followed his career-high, 30-point game on March 4 to help Toronto come back from an early 19-point deficit, hitting 10 of 15 shots.\n\n\r\n                    Toronto shot 9 for 25 with five turnovers in the final quarter, losing for the fifth time in six games. \n\n\r\n                    The Raptors knew they had to get the ball out of Young's hands for the final shot.\n\n\r\n                    “We threw the farm at him,” Powell said. “We were trying to make somebody else make a play, and they did.”\n\n\r\n                    Lowry’s 17 points moved him ahead of Chris Bosh into second place on Toronto’s scoring list with 10,292 points. DeMar DeRozan is first with 13,296.\n\n\r\n                    The Raptors played again without Fred VanVleet, Pascal Siakam and OG Anunoby because of the NBA's coronavirus safety protocols. Coach Nick Nurse, who had missed the two preceding games along with most of his staff for the same reason, was back on the bench Thursday night.\n\n\r\n                    “We have to adjust to what we have on the floor and take what the defense gives us,” said Powell, who missed two free throws with 56 seconds left. “Right now I have to be an aggressive offensive player and I kind of like it. But I've got to make those free throws. That's totally on me.”\n\n\r\n                    The Raptors made only eight of their first 26 shots, and when Solomon Hill's 3-pointer completed an 11-0 Atlanta run early in the second quarter, the Hawks led 48-29.\n\n\r\n                    Boucher scored twice and Powell hit a 3-pointer on a 12-0 run to help the Raptors get back in it, but they never led until Powell's 3-pointer made it 78-76 midway through the third quarter.\n\n\r\n                    The Hawks were down 112-97 when Boucher hit another 3-point shot with 6:13 left.\n\n\r\n                    Young hits four shots late in the fourth quarter, including a driving layup that brought the Hawks within two.\n\n\r\n                    TIP-IN\n\n\r\n                    Hawks: Snell, the NBA's hottest 3-point shooter (64.6%) since Feb. 1, shot 2 for 3 from behind the arc, the first two shots coming early in the first quarter. ... Clint Capela had 19 rebounds, leading the Hawks to a 53-50 edge. ... F De'Andre Hunter, who has missed 18 straight games and had right knee surgery Feb. 8, will return soon, according to McMillan. \n\n\r\n                    Raptors: Powell has scored 24 or more points in seven of his last nine games. ... F-C Henry Ellenson, who signed a 10-day contract Wednesday after playing 15 games in the G League bubble, did not play. ... The Raptors expect to make 3,800 tickets available for their next game in Tampa, March 19 against Utah.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Play at home against Sacramento on Saturday night.\n\n\r\n                    Raptors: Play at Charlotte on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764996854.20065
}