{
  "game_id": "0021800620",
  "espn_id": "401071296",
  "date": "Jan 10, 2019",
  "matchup": "SAC vs. DET",
  "headline": "Hield scores 18 as Kings defeat Griffin-less Pistons 112-102",
  "body": "SACRAMENTO, Calif. --  Buddy Hield scored 18 points, Willie Cauley-Stein had 14 points and 14 rebounds, and the Sacramento Kings beat the Detroit Pistons 112-102 on Thursday night with Blake Griffin out for rest.\n\nIman Shumpert had 13 points and De'Aaron Fox had 12 points and six assists for the Kings, who had lost five of six.\n\nStanley Johnson had 16 points off the bench, Reggie Bullock added 15 points and Andre Drummond had 12 points and 11 rebounds for the Pistons, who have lost four straight and 9 of 11.\n\nGriffin, Detroit's scoring leader, got the night off after playing 37 minutes Wednesday night in a 113-100 loss at the Los Angeles Lakers. He did not have a rebound in that game, the first time that had happened in his eight-year pro career.\n\nThe Kings went 9 for 22 from behind the 3-point line (40.9 percent) against a Pistons team that entered as the NBA's best in defending against 3-pointers, holding opponents to 31.9 percent shooting. Sacramento entered second in the NBA in shooting 3s at 39 percent.\n\nDetroit went 11 for 38 on 3s, with Bullock hitting three of them.\n\nThe Kings were coming off one of their worst losses of the season, blowing a 21-point second-half lead in a 115-111 defeat Tuesday night at Phoenix, the worst team in the Western Conference.\n\nSacramento never trailed, starting the game with a 13-2 spurt and leading 34-21 after one period. The Kings held a 65-48 halftime lead and maintained that 17-point margin at the end of three quarters. They took their biggest lead of the night, 102-79, with about eight minutes left.\n\nTIP-INS\n\nPistons: Drummond needed four offensive rebounds to tie Dennis Rodman for second most in team history but only got one. ... Had won two straight and seven of 10 against the Kings. ... Host Sacramento on Jan. 17.\n\nKings: Shumpert returned to the starting lineup after missing three games with a sprained right index finger. ... Are 9-3 against Eastern Conference teams this season. ... Fox, who had eight turnovers in the loss at Phoenix two nights earlier, had two against the Pistons in 24 minutes.\n\nUP NEXT\n\nPistons: Continue their four-game trip Saturday at the Los Angeles Clippers in Griffin's first return to LA against his former team. He was traded to the Pistons in January 2018.\n\nKings: Host the Charlotte Hornets on Saturday night in the second game of a three-game homestand. The Kings have lost three straight to the Hornets and have not defeated Charlotte in Sacramento since 2015.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994201.2326038
}