{
  "game_id": "0021600949",
  "espn_id": "400900344",
  "date": "Mar 08, 2017",
  "matchup": "CHI @ ORL",
  "headline": "Payton's 2nd straight triple-double leads Magic over Bulls",
  "body": "ORLANDO, Fla. --  The lack of emotion on Orlando point guard Elfrid Payton's face said plenty after his follow shot with 1:16 remaining had just provided the biggest basket of the night.\n\nHe had just put the finishing touches on a masterful triple-double night, but Payton calmly walked back to the bench as the crowd in Amway Center cheered. He finished the night with 22 points, 14 rebounds and 14 assists in 36 minutes of the Magic's 98-91 victory over the Chicago Bulls on Wednesday for his second straight triple double.\n\n\"For me, it's more like once it's done,\" Payton said when asked if he was aware of the night he was having. \"I'm trying to help pitch in any way I can. Get a steal, get a rebound, assist to help somebody get going. I know once they get going they are going to play harder on defense. Any way I can help.\"\n\nPayton, who has been up and down all season and has endured two benchings under first-year coach Frank Vogel, was certainly the catalyst Wednesday night. He made plays driving the ball to the rim, finding the open man for open shots and he even defied his coach's demand of getting back on defense after missed shots, as his six offensive rebounds indicated.\n\nVogel, whose team ended a two-game losing streak, overlooked Payton's defiance.\n\n\"Sometimes you have to break the coach's rule,\" Vogel said. \"We want our point guards back on defense, but those are loose ball plays and that's part of it.\"\n\nLargely because of Payton's play along with some timely shots by Evan Fournier (20 points) and Terrence Ross (14), the Magic were able to overcome a 13-point, third-quarter deficit and then put the clamps on Jimmy Butler and the Bulls in the fourth quarter to escape with a needed win.\n\n\"I was proud of how we closed the game out tonight,\" said Vogel. \"We are happy with how we played for the most part the last two games, but not how we finished.\"\n\nWhile the Magic didn't close out as planned against New York on Monday night, they played just good enough Wednesday to preserve the win. The Bulls closed with two points of the lead late in the fourth quarter, but then Orlando turned up the defensive pressure to pull away. Butler finished with 21 points, but he missed some big shots down the stretch and the Bulls were limited to just 14 fourth-quarter points.\n\n\"Sometimes we played great defense, and sometimes they missed shots, but we did enough,\" Vogel said. \"We had enough solid defensive possessions to secure the win.\"\n\nWhile it was a big win for the Magic, it was another tough loss for the Bulls, who have dropped three straight and four of their last five. They came into the night trying to cling to one of the final Eastern Conference playoff spots, tied for seventh place.\n\n\"We're playing hard,\" said Bulls coach Fred Hoiberg. \"It's not an effort thing. We played very good stretches of basketball. Again, we've got to play a full 48 minutes.\"\n\nTIP-INS\n\nBulls: Dwyane Wade sat out with a strained left quadriceps. ... Rajon Rondo returned to action after missing Monday's loss at Detroit with a right ankle injury. ... Bobby Portis's career-best streak of four straight games in double figures was snapped, as he scored just eight points. ... Cristiano Felicio scored six points against Magic rookie center Stephen Zimmerman during an 8-0 run early in the second quarter.\n\nMagic: Nikola Vucevic missed his third straight game with a sore right Achilles tendon. He is listed as day-to-day. ... Payton recorded his fifth career triple-double.\n\nUP NEXT\n\nBulls: Chicago returns home to take on the Houston Rockets on Friday night. Houston is looking to sweep Chicago for the second time since 2008-09.\n\nMagic: Orlando travels to Charlotte for the first game of a back-to-back. The Hornets have won five straight against the Magic.",
  "source": "espn_api",
  "crawled_at": 1764995026.541924
}