{
  "game_id": "0021300820",
  "espn_id": "400489693",
  "date": "Feb 21, 2014",
  "matchup": "CHI vs. DEN",
  "headline": "Tony Snell adds career-high 20 points as seven Bulls win again",
  "body": "CHICAGO -- This one was all over in the first quarter, right about the time Jimmy Butler's only 3-pointer made it a 20-point game.\nAnother fast start for the Chicago Bulls sent the Denver Nuggets to an embarrassing loss for first-year coach Brian Shaw.\nD.J. Augustin had 22 points and eight assists, and the Bulls routed the Nuggets 117-89 Friday night for their fifth consecutive victory.\n\"I just thought it was well-balanced,\" Chicago coach Tom Thibodeau said. \"I thought it was strong on both sides of the ball.\"\n\nRookie Tony Snell added a career-high 20 points as the Bulls put seven players in double figures. Taj Gibson had 15 points and 10 rebounds, and Joakim Noah finished with 14 points, 11 boards and five assists.\nRandy Foye scored 23 points for Denver, which has lost six of seven. Aaron Brooks had 17 on 7-for-11 shooting in 28 minutes in his Nuggets debut, which also included a technical foul when he was involved in a tussle with Noah in the third.\n\"I got a little bit more confident toward the end,\" Brooks said. \"You can tell the team is a little rusty as far as me getting in there, but I think we'll figure it out.\"\nDenver acquired Brooks and forward Jan Vesely in a pair of trades on Thursday. The 7-foot Vesely had five points and five rebounds in 16 minutes.\nWhile Shaw was pleased with the play of his newest players, he sounded frustrated when describing the rest of the roster.\n\"It felt like tonight we had some guys who just decided they weren't going to play, they weren't going to put forth any effort to get the job done,\" he said. \"It's unfortunate. This is a nationally televised game, and we're professionals. As a staff, we have to beg guys to give effort when we play.\"\nThe Bulls shot 50 percent and outrebounded the Nuggets 50-40 while improving to 17-7 since Jan. 1. Chicago jumped to a 23-point halftime lead and then put it away with a 16-5 run at the end of the third quarter.\nMike Dunleavy, Carlos Boozer and Kirk Hinrich had 10 points apiece for Chicago, which will go for a season-high sixth straight win Sunday at Miami.\n\"We feel like we're playing at a high level,\" Gibson said. \"Our defense is phenomenal, I think.\"\nForced to play short-handed due to the trades and a slew of injuries, Denver used only eight players in Thursday night's 101-90 victory at lowly Milwaukee. Brooks and Vesely were cleared in time to play against Chicago, but the Bulls jumped all over the weary Nuggets right at the start.\n\"We act like a big, bad wolf against Milwaukee last night, then we come in tonight, nationally televised game against the Bulls, and we tuck our tails and hide,\" Shaw said.\nChicago used runs of 13-2 and 8-0 to open a 32-12 lead on Butler's 3-pointer with 1 minute left in the first quarter. Brooks responded with seven straight points, but the Bulls led 32-19 after one.\nIn the continuation of an encouraging trend for Chicago, the Bulls have outscored their opponents by an average of 29.9 to 18.3 in the opening period over the last seven games, according to STATS.\nThe only issue for the Bulls from their latest fast start was the health of Butler, who bruised a rib late in the opening period. Thibodeau said he is day to day and could travel with the team to Miami on Saturday.\n\"It's one of those things, with a rib, we have to see how he is when he gets up tomorrow,\" Thibodeau said.\nIt was more of the same in the second. Snell had 10 points in the quarter on 4-for-5 shooting, helping the Bulls to a 69-46 lead at the break. It was a season-high point total for any half for Chicago and the most allowed by Denver in a half all season.\nThe Nuggets also lost Darrell Arthur to a strained left hip in the second, shelving the forward for the rest of the game. The team said he irritated a previous injury.\n\"It's something in the groin, hip area,\" Shaw said. \"When he came out of the game, he said his hip was bothering him. I don't know if it's the exact same (injury as earlier this season), but it's in that region.\"\nGame notes\nShaw said PG Ty Lawson (broken left rib) still feels some pain at times when he tries certain moves in practice. \"I don't know if he's getting close or if he's not,\" Shaw said. \"He says he's feeling better.\" Lawson has missed Denver's last five games. ... The Bulls' previous high for points in a half was 64 in the first half of a 107-104 loss at Philadelphia on Nov. 2. ... Nuggets F Kenneth Faried was whistled for a flagrant foul for taking down Snell with 3:42 left in the third. Noah and Brooks then received technicals for their roles in a resulting skirmish.",
  "source": "espn_api",
  "crawled_at": 1764992647.8972428
}