{
  "game_id": "0021601141",
  "espn_id": "400899401",
  "date": "Apr 01, 2017",
  "matchup": "POR vs. PHX",
  "headline": "Blazers at .500 with 6th straight win, 130-117 over Suns",
  "body": "PORTLAND, Ore. --  Damian Lillard joked that no team goes into the season hoping to play at .500.\n\nYet the Trail Blazers were happy to pull to 38-38 on the season Saturday night with a 130-117 victory over the Phoenix Suns. Lillard had 31 points as Portland continued its late-season push for the playoffs with a sixth straight victory.\n\n\"We feel like we're the team right now that we should have been all along, the way we're playing. And all that matters is getting that playoff spot,\" Lillard said. \"I guess it's good to be .500, but nobody comes into the season saying, `Let's play .500 basketball.' We wish we were in a better position.\"\n\nCJ McCollum added 29 points for Portland, which holds the eighth and final playoff spot in the Western Conference. The Blazers (38-38) led by as many as 25 points and got back to .500 for the first time since they were 12-12 on Dec. 9.\n\nDevin Booker had 31 for the Suns, who lost their 11th straight for the fifth-longest losing streak in franchise history. Phoenix was just ahead of the Lakers at the bottom of the Western Conference.\n\n\"We're here to get better by not making the same mistakes,\" Booker said.  \"We're getting a chance to play, but we need to treat it like it's do-or-die time. It's not often that rookies get this many minutes so as a young group we need to come together and play like we're trying to do something here.\"\n\nThe Blazers played their first game without Jusuf Nurkic since announcing that he had a fractured right leg and will miss the rest of the regular season.\n\nThe 7-foot center was credited with boosting Portland's late-season surge. In 20 games since coming to the Blazers in a trade with Denver, Nurkic was averaging 15.2 points, 10.4 rebounds and 1.9 blocks.\n\nNurkic, who has a non-displaced right leg fibular fracture, will be re-evaluated in two weeks. It was unclear when the injury occurred.\n\n\"The goal is still to make the playoffs and everybody will have to do more,\" coach Terry Stotts said.\n\nGrateful that the injury wasn't more serious, Nurkic said he will follow what the team doctors say so that he can return quicker.\n\n\"It's part of the life, part of the job. I'm not going to be negative,\" he said before the game.\n\nMeyers Leonard started in Nurkic's place.\n\nThe Suns pulled within four at 99-95 on Alan Williams' layup early in the fourth quarter. But after a pair of free throws, Al-Farouq Aminu dunked to extend Portland's lead to 103-95.\n\nThe Blazers jumped out to an early 20-6 lead after McCollum's 3-pointer. Aminu pushed the lead to 32-15 with another 3.\n\nThe Suns had no spark and Portland extended its lead to 48-25 on Maurice Harkless' reverse layup and Evan Turner's 3-pointer in the second quarter.\n\nPhoenix closed the gap to 61-53 on a follow dunk from Marquese Chriss and T.J. Warren's fast-break dunk late in the half, and the Blazers went into the break with a 63-53 lead. McCollum led all scorers with 14 points.\n\nBooker's layup got the Suns within 63-55, but McCollum and Lillard made consecutive 3-pointers to pull away again.\n\nLillard hit a 3-pointer from about 30 feet out to give Portland an 84-69 lead, then raised his arms as the crowd erupted in cheers.\n\n\"Our guys are young, they're still fighting,\" Phoenix coach Earl Watson said. \"They're still trying to create an identity.\"\n\nTIP INS\n\nSuns: Phoenix was without Leandro Barbosa for the fourth straight game because of right hamstring spasms. ... The Suns won only the first of the four-game season series with the Blazers.\n\nTrail Blazers: The Blazers recalled guard Tim Quarterman from the Long Island Nets of the NBA Development League. ... Stotts wore a University of Oregon pullover in his pregame chat with the media. The Blazers' game started at about halftime of the Ducks' Final Four game against North Carolina.\n\nLILLARD'S NEW MILESTONES: Lillard keeps adding to his legacy as a Trail Blazer. With his 31 points Saturday night, he reached 1,902 for the season, a new career high. He also had his 26th game of the season with 30 or more points, tying the franchise record reached by Kiki Vandeweghe and Clyde Drexler.\n\nUP NEXT\n\nSuns: host the Rockets on Sunday night.\n\nTrail Blazers: visit the Timberwolves on Monday. The game was originally scheduled for March 6 but was postponed because of condensation on the floor at Target Center.",
  "source": "espn_api",
  "crawled_at": 1764995642.452787
}