{
  "game_id": "0022400079",
  "espn_id": "401704645",
  "date": "Oct 25, 2024",
  "matchup": "CHA @ ATL",
  "headline": "Young scores 38 points as Hawks overcome Ball's 3-point barrage, 34 points, to beat Hornets 125-120",
  "body": "ATLANTA -- — Trae Young scored 38 points and the Atlanta Hawks overcame LaMelo Ball's 34 points and career-best nine 3-pointers to beat the Charlotte Hornets 125-120 on Friday night.\n\n\r\n              Ball made 9 of 14 3-pointers, beating his previous career high of eight.\n\n\r\n              De'Andre Hunter added 24 points for Atlanta.\n\n\r\n              Charlotte never led but pulled even twice in the final period.\n\n\r\n              Ball scored 34 points in the Hornets' 110-105 win at Houston on Wednesday to open the regular season. He matched that total with his ninth 3-pointer with 7:31 remaining. \n\n\r\n              The Hornets were without two starters, including guard Brandon Miller. The team said Miller will be out at least a week because of a strained left glute. Center Mark Williams was held out with a strained tendon in his left foot.\n\n\r\n              Takeaways \r\n              Hornets: Despite missing two starters, Charlotte showed depth with four scorers in double figures. Miles Bridges scored 27 points and Tre Mann had 17 points. Nick Richards had 12 points and 13 rebounds. \n\n\r\n              Hawks: Young consistently provided baskets or big plays when the Hornets provided a challenge. With the game tied at 90, Young's 3-pointer gave the lead back to Atlanta. Following a tying 3 by Charlotte's Josh Green, Young answered with a short jumper.\n\n\r\n              Key moment \r\n              Ball went to the bench with his fifth foul with 6:50 remaining and returned to the court with 3:49 remaining. Only 15 seconds later, Ball was called for an offensive foul. The sixth foul was no secret as Young immediately raised six fingers as Ball left the game for good.\n\n\r\n              Key stat \r\n              After being outscored 28-16 in the first quarter, the Hornets scored 42 points in the second period and trailed only 62-58 at halftime. Ball scored 18 points in the period.\n\n\r\n              Up next \r\n              The Hornets host Miami in their home opener on Saturday and the Hawks visit Oklahoma City on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997475.356748
}