{
  "game_id": "0021601207",
  "espn_id": "400900585",
  "date": "Apr 10, 2017",
  "matchup": "MIL vs. CHA",
  "headline": "Bucks brush past Hornets for 89-79 win",
  "body": "MILWAUKEE --  Giannis Antetokounmpo smiled for pictures with fans and even threw new sneakers into the stands as the Milwaukee Bucks celebrated on the court after their final home game of the regular season.\n\nThey'll be back at the Bradley Center late next week for a first-round game in the NBA playoffs.\n\nThe Bucks secured at least the sixth seed in the Eastern Conference with an 89-79 win over the Charlotte Hornets on Monday night. Tony Snell scored 16 points, while Jason Terry had season highs of 15 points and five 3-pointers for Milwaukee, which shot 16 of 28 (57 percent) from behind the arc.\n\nImproving to 42-39, the Bucks secured their first winning season since 2009-10, when they won 46 games. A team that was seven games under. 500 on March 1 is back in the playoffs for the second time in three years.\n\n\"We've grown a lot this season. For us to come back from where we were to be able to solidify a playoff position, it's huge for this organization and going forward,\" Terry said.\n\nCenter Greg Monroe provided punch in the paint with 16 points and nine rebounds for the Bucks. Antetokounmpo picked up his third triple-double of the season with 10 points, 11 rebounds and 10 assists, clinching the feat after firing a pass with 54 seconds left to Khris Middleton for a 3.\n\nThe Hornets led for much of the first three quarters despite being without leading scorer Kemba Walker because of a hyperextended left knee.\n\nTrailing 66-61 going into the fourth, Milwaukee asserted control in the final period with Terry hitting from the outside and Monroe controlling the middle.\n\n\"We got really disorganized there with our second unit in the fourth. That was the difference in the game,\" Hornets coach Steve Clifford said.\n\nMichael Kidd-Gilchrist had 13 points for the Hornets.\n\nTIP-INS:\n\nHornets: Walker and G/F Marco Belinelli (finger) missed the game with the team out of playoff contention. ... F/C Frank Kaminsky, who starred in college at Wisconsin, went 1 of 12 from the field for three points in 21 minutes off the bench.\n\nBucks: PG Malcolm Brogdon played 25 and had five points, four rebounds and three assists in his return to the floor after missing five games with a sore back. Brogdon looked a little rusty, though the rookie got valuable playing time as he prepares for his first postseason. Backup C John Henson had two points and played nine minutes in his return after missing 10 games with a sprained left thumb.\n\nFORWARD IN FOURTH\n\nCharlotte shot just 5 of 20 from the floor in the fourth quarter, when the Bucks were only starting to take off. Milwaukee was 6 of 8 from 3-point range in the fourth.\n\n\"Their defense was really good in the fourth,\" Clifford said. \"To have a chance, you have to be organized on every possession.\"\n\nAntetokounmpo added to his nightly collection of highlight-reel plays with alley-oop dunk off an inbounds pass from Middleton with 6:09 left to give the Bucks a 78-73 lead. Monroe and Antetokounmpo provided balance in the lane late in the game to help Milwaukee pull away.\n\nBEHIND THE ARC\n\nMiddleton finished with 15 points and joined the 3-point barrage with a 4-of-5 outing from the behind the arc. Snell was also 4 of 5 from 3-point range.\n\n\"The shooting was great. (Terry) was great,\" Kidd said. \"That group shoots together and it looks like they were at practice shooting together today. Nobody panicked.\"\n\nHORNETS NOTES\n\nJeremy Lamb had 12 points for Charlotte. Treveon Graham also had 12 points, a career high.\n\nAn 18-1 run that stretched between the first and second quarters helped the Hornets take a 46-43 lead at halftime. The Bucks stayed in the game with hot shooting from behind the 3-point arc.\n\nUP NEXT\n\nHornets: Wrap up the regular season on Tuesday at Atlanta.\n\nBucks: Travel to Boston to end the regular season against the Celtics.\n\n---\n\nMore NBA Basketball:\n\nhttps://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Genaro Armas at: https://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764995120.946133
}