{
  "game_id": "0021900545",
  "espn_id": "401161187",
  "date": "Jan 06, 2020",
  "matchup": "CHI @ DAL",
  "headline": "Doncic's big third quarter leads Mavericks over Bulls 118-110",
  "body": "DALLAS --  It wasn't the 38 points, the 11 rebounds or the 10 assists from Luka Doncic that most impressed his coach on Monday night.\n\nIt was his poise. But the production didn't hurt either.\n\nDoncic scored 21 points in the third quarter and had his NBA-leading 11th triple-double of the season to lead the Dallas Mavericks past the Chicago Bulls 118-110 Monday night.\n\nDoncic scored 17 of the Mavs' 19 points in the final 5:35 of the third to break open what had been a tie game. His 3 gave Dallas a 72-69 lead it would not relinquish.\n\n\"I thought tonight the most impressive thing about his game was his demeanor and his disposition and his poise,\" Mavericks coach Rick Carlisle said. \"Teams are sending athletic guys to be physical and banging him, and he really stayed level-headed.\"\n\nThe 20-year-old scored at least 20 in a quarter for the second time this season. He hit three 3s over that decisive stretch and scored four other times on drives to the basket, including a rainbow floater that banked in as he was getting fouled. His only blip was missing the subsequent free throw.\n\n\"For me, all that matters is we got to win,\" Doncic said. \"We needed that win coming from a loss (in overtime to Charlotte on Saturday) that we should have won. My team is helping a lot. We just played tough from the start to the end and that's how it's got to be.\"\n\nDwight Powell added 16 points for Dallas on 6-for-6 shooting from the floor and 4-for-4 from the line. The Mavericks played without Kristaps Porzingis for the fourth straight game due to right knee soreness.\n\nLauri Markkanen led the Bulls with 26 points, starting the game despite spraining his left ankle Saturday night against Boston.\n\n\"I was proud of Markkanen fighting through. (He) played his heart out,\" Chicago coach Jim Boylen said. \"I thought our guys played really hard, competed.\"\n\nChicago stayed close throughout the game, even after losing forward Wendell Carter Jr. to a right ankle sprain with 8:25 left in the third quarter. Chicago went on a quick 10-2 run after Carter's injury to tie the score at 69 before Doncic took over.\n\nTIP-INS\n\nBulls: Tomas Satoransky had a career-high 14 assists. ... Chandler Hutchison played for the first time since Nov. 27, recovering from a right shoulder sprain. . Chicago fell to 1-15 this season against teams over .500.\n\nMavericks: Reserve forward Ryan Broekhoff is working with a group of his fellow Australian NBA and G League players to raise money for those affected by the bushfires in his native country. \"There's a small group of (Australians in the NBA) and we're all very close,\" Broekhoff said. \"It's kind of us doing our little bit to raise awareness and get donations.\" ... J.J. Barea played his 619th game for the Mavs, tying Jason Terry for sixth-most in franchise history.\n\nAN ANKLE FOR AN ANKLE\n\nMarkkanen was upgraded from doubtful to questionable during the Bulls' shootaround and then tested the ankle in warm-ups.\n\n\"I warmed up and it felt pretty good,\" Markkanen said. \"I didn't feel much pain. Just got to fight through. I know how much pain I can tolerate.\"\n\nBut in the third quarter, the Bulls suffered another ankle injury Carter went down after landing awkwardly on Powell's foot while going up for a layup. Carter, who played just 44 games last year because of thumb surgery, was taken off the court on a wheelchair. X-rays were negative.\n\nHARDAWAY RETURNS\n\nDallas got a big lift from the return of Tim Hardaway Jr., who missed the past three games with a left hamstring strain. Hardaway scored 14 points in the first quarter on 5-for-5 shooting with three 3s. Carlisle restricted his minutes, and Hardaway finished with 15 points in 21 minutes.\n\n\"I'm happy I was able to make an impact and play within the offense,\" Hardaway said. \"I credit the guys. They did a phenomenal job of finding me and making it easy for me to knock down shots.\"\n\nUP NEXT\n\nCeltics: At the New Orleans Pelicans on Wednesday.\n\nMavericks: Host the Denver Nuggets on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996347.6558762
}