{
  "game_id": "0021501052",
  "espn_id": "400828939",
  "date": "Mar 22, 2016",
  "matchup": "CHA @ BKN",
  "headline": "Batum scores 23 points as Hornets beat Nets 105-100",
  "body": "NEW YORK --  A night after scoring 29 points while Charlotte rallied from 23 down to beat the San Antonio Spurs, Jeremy Lin carried the Hornets again Tuesday night.\n\nLin scored 21 points and Nicolas Batum had 23 to help the Hornets beat the Brooklyn Nets 105-100.\n\n\"Jeremy Lin was huge for us,\" Batum said. \"In the third and fourth, he stepped up again for us. He did it last night in the second quarter to give us life, and he did it again tonight. I don't think we would have won that game if he didn't step up again for us.\"\n\nBrook Lopez had 29 points, nine rebounds and a season-high six assists and Sean Kilpatrick added a career-high 25 points for the Nets.\n\nBatum hit two big shots down the stretch to key the win. Batum had a four-point play to put Charlotte up 91-84 with 4:11 left and a 3-pointer to extend the lead to 96-88 with 2:44 remaining.\n\n\"I think he is just confident,\" Hornets coach Steve Clifford said. \"He made Jeremy Lin play really well again tonight. Courtney Lee played well again tonight, but Nicolas really made the plays with the game on the line. He had the four-point play and the other pull-up jumper after that. When we needed him, he really made the big plays.\"\n\nBojan Bogdanovic cut the deficit to 98-97. Kemba Walker then sank two free throws to push Charlotte's lead to 100-97, and the Hornets never looked back.\n\nDespite the loss, Brooklyn hopes the play of Kilpatrick and the return of Rondae Hollis-Jefferson -- he played for the first time in 50 games Tuesday due to an ankle injury -- can provide a spark down the stretch.\n\n\"I like the spirit of Sean Kilpatrick, I love the spirit of Rondae Hollis-Jefferson,\" Nets coach Tony Brown said. \"He's getting a chance to play again and they're playing their butts off when they're out there.\"\n\nCharlotte has won 10 of 12 games and is half a game out of third place in the Eastern Conference, creeping up on home-court advantage.\n\n\"I've only been to the playoffs one time,\" Walker said. \"From what coach says, it's pretty important. It's home-court advantage. Of course, everyone wants to be at home, especially for the first two games.\"\n\nTIP-INS:\n\nHornets: Coach Steve Clifford commended Al Jefferson for adjusting his game and coming off the bench for the good of the team. \"I think the thing he's done this year, and because of his injuries people haven't seen it, is he's added a ball movement and pick-and-roll aspect. He's not just a post-up player anymore.\" ... Frank Kaminsky started for the second time in his career, replacing Marvin Williams (sprained left ankle). ... Aaron Harrison and Michael Kidd-Gilchrist did not dress.\n\nNets: Coach Tony Brown has noticed a change in Charlotte's play with Al Jefferson coming off the bench. \"When you lose a Jefferson, who's been a huge piece of their team and he got a lot of touches in the low post, maybe the pace wasn't there with Jefferson as a starter.\" ... Kilpatrick has scored in double figures six straight games off the bench, which ties Andrea Bargnani for the longest streak for a Nets reserve this season. ... Sergey Karasev and Jarrett Jack did not dress.\n\nUP NEXT\n\nHornets: Visit Detroit on Friday night.\n\nNets: Host Cleveland on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994345.772634
}