{
  "game_id": "401810142",
  "espn_id": "401810142",
  "date": "Nov 24, 2025",
  "matchup": "MEM vs DEN",
  "headline": "Jamal Murray, Peyton Watson help Nuggets hold off a late push by Grizzlies for 125-115 victory",
  "body": "MEMPHIS, Tenn. -- — Jamal Murray had 29 points and eight assists, Peyton Watson scored 14 of his 27 points in the third quarter, and the Denver Nuggets held off a late push by Memphis, defeating the Grizzlies 125-115 on Monday night.\n\n\r\n              Nikola Jokic recorded his 10th triple-double of the season with 17 points, 16 assists and 10 rebounds for Denver, which has won three of four.\n\n\r\n              Jock Landale, playing extended minutes because of an injury to Zach Edey, matched his career best with 26 points and had 10 rebounds for Memphis. Jaylen Wells finished with 22 points and Cam Spencer added 18.\n\n\r\n              Memphis was within 114-108 with six minutes left when Murray connected on a pair of 3-pointers. A basket by Tim Hardaway Jr. (13 points) with 2:23 left took the lead to 119-108.\n\n\r\n              Murray shot 6 of 9 from beyond the arc, and the Nuggets were 22 of 43 (51.2%) on 3s.\n\n\r\n              The Nuggets were missing two starters — Christian Braun, out with a left ankle sprain, and Aaron Gordon, who is dealing with a right hamstring strain that could keep him out of action at least a month. Together they account for about 20 points a game.\n\n\r\n              The Grizzlies are playing without most of their primary point guards, including Ja Morant, who missed his fourth straight game with a right calf strain. Edey left in the first half Monday with a head injury and did not return.\n\n\r\n              Denver's tough defense contributed to Memphis converting only 40% of its shots in the first half, giving the Nuggets a 62-54 lead at the break. Memphis made a dent in the third quarter, but Watson helped the Nuggets lead 93-85 entering the fourth, with the final points coming on a half-court buzzer-beater by Jokic.\n\n\r\n              Up next\r\n              Nuggets: Host San Antonio on Friday.\n\n\r\n              Grizzlies: At New Orleans on Wednesday to begin a four-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042688.8593621
}