{
  "game_id": "0021800181",
  "espn_id": "401070863",
  "date": "Nov 10, 2018",
  "matchup": "OKC @ DAL",
  "headline": "Rookie Luka Doncic, veteran J.J. Barea help Mavs topple streaking Thunder",
  "body": "DALLAS -- J.J. Barea and Luka Doncic brought experience and youth -- and a win -- to Dallas on Saturday night.\nRookie Doncic scored 22 points and veteran Barea had a season-high 21 off the bench, including 16 in a first-half surge, as the Mavericks defeated the Oklahoma City Thunder 111-96.\nThe Mavericks won for the second time in nine games and snapped the Thunder's seven-game winning streak after they had lost their first four games of the season.\n\"Barea was great,\" Dallas coach Rick Carlisle said. \"Extremely aggressive, scored it, passed it. He was certainly a big tone-setter for us.\"\nOklahoma City raced to an early 18-12 lead, but Barea scored 11 points in a foul-filled first quarter, including two free throws for a 23-22 lead at the end of the period. Barea accounted for 16 of the Mavericks' 20 points for a 32-24 lead before returning to the bench.\n\"Our bench guys got a little mojo going on offense,\" Carlisle said.\nDallas built its lead to 24 points, 57-33, before the Thunder scored the last 12 points of the first half.\nThe 34-year-old Barea was the second-oldest Maverick active for the game. He led the way as the Dallas bench outscored Oklahoma City's 53-22.\n\"I got in a rhythm tonight, feeling good,\" Barea said. \"I was telling the guys on the bench we've got to come in with a lot of energy.\"\nThe Mavericks' youngest player, 19-year-old Doncic, scored nine of his points in the third quarter. He came off the court flexing his right knee but returned for the fourth quarter.\nDoncic, averaging better than 20 points per game, also had a game-high and career-high eight assists.\n\"He's been great,\" Barea said. \"He's finishing. He's knocking down the 3s, he's driving.\"\nHarrison Barnes and Dorian Finney-Smith scored 11 points each and Dennis Smith Jr. had 10 for Dallas.\nPaul George and Steven Adams had double-doubles for Oklahoma City, each finishing with 20 points and 13 rebounds. Dennis Schroder added 19 points and Jerami Grant had 13.\nThe Mavericks shot a season-best 56 percent from the field (43 for 77). The Thunder made only 39 percent of their field goal attempts (38 for 97) and couldn't capitalize on 26 offensive rebounds.\n\"The biggest difference was obviously the 3-point shooting. They shot it really well and we had our opportunities and didn't shoot particularly well,\" Thunder coach Billy Donovan said.\nDallas made 14 of 29 3-pointers (48 percent) and Oklahoma City only 9 of 34 (27 percent).\nTIP-INS\nThunder: Russell Westbrook missed his third game because of a sprained left ankle. ... The bench scored only two points in the first half on 1-for-13 shooting. ... Raymond Felton, Oklahoma City's oldest player, was born the same day as Dallas' J.J. Barea -- June 26, 1984.\nMavericks: Gave up a season-low 96 points -- 13 fewer than their previous low, 109 by Chicago on Oct. 22. ... Held the Thunder to 45 points in the first half, the fewest this season for a Dallas opponent. ... The Mavericks shot 13 for 18 (72 percent) from the field in the second quarter, including 6 of 8 (75) from 3-point range.\nSTARS OUT TONIGHT\nDallas played without Dirk Nowitzki, who underwent left ankle surgery during the offseason. The Thunder were without  Westbrook (sprained left ankle) for the third game.\n\"I'd be thrilled if (Nowitzki) played in November,\" Mavericks coach Rick Carlisle said. \"I just think he's moving around better.\"\nOklahoma City's Billy Donovan said of Westbrook: \"Every day, I think he gets better but in terms of projecting a date when he's going to be ready, no.\"\nBENCH MARKS\nDevin Harris, 35, returned after missing all but this season's opening game because of a strained left hamstring. He contributed six points.\nFinney-Smith said Harris was a big part of the bench's season-high 53 points.\n\"We're deep, especially when Devin Harris gets back out there and J.J. (Barea) going like that.\"\nMUST BE THE SHIRTS\nThe Mavericks played in their City Edition jerseys for the first time this season.\n\"I liked them, that smoke grey,\" Finney-Smith said. \"If that's what it takes to get the win, I'll wear them again.\nUP NEXT\nThunder: Play the first of two home games against Phoenix on Monday.\nMavericks: Take a quick trip to play Chicago on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994629.161067
}