{
  "game_id": "0022000705",
  "espn_id": "401307494",
  "date": "Mar 28, 2021",
  "matchup": "ATL @ DEN",
  "headline": "Gordon scores 13 in Denver debut, a 126-102 win over Hawks",
  "body": "DENVER -- — Aaron Gordon scored 13 points in his debut with Denver, and the Nuggets beat the Atlanta Hawks 126-102 on Sunday night.\n\n\r\n                    Denver acquired Gordon from Orlando at the trade deadline and he got the start, playing 21 minutes. Paul Millsap, who had been starting at power forward, came off the bench. JaVale McGee, who was traded to Denver from Cleveland in a deadline deal, didn’t play.\n\n\r\n                    “I see no limits for this team,” Gordon said. “It looks like we have all the pieces for this team, we have depth. We’re covered in a lot of different spots. As long as we’re working together there’s no stopping us.”\n\n\r\n                    Nikola Jokic finished with 16 points, 10 rebounds and eight assists, and Michael Porter Jr. had 15 points and 10 rebounds for Denver, which quickly integrated Gordon into the mix.\n\n\r\n                    “He knows why he came here, he knows what he can do, he knows how he can help and he’s doing that,” Jokic said. “He’s embraced it. He saw how we play. If he’s open the ball’s going to find him.”\n\n\r\n                    The Hawks entered the game having won nine of 11, but couldn’t stay with the new-look Nuggets. \n\n\r\n                    Trae Young scored 21 points, but had seven turnovers to go with seven assists. Danilo Gallinari had 14 points against his former team.\n\n\r\n                    Atlanta coach Nate McMillan said his team was affected by what he thought were non-foul calls in the first quarter.\n\n\r\n                    “Early in the game we got distracted by that and we didn’t make adjustments appropriately and they pretty much controlled the game from start to finish,” McMillan said.\n\n\r\n                    Gordon had seven of his 11 first-half points in the second quarter and the Nuggets took a 10-point lead at the break. The lead was extended to 20 points early in the third quarter.\n\n\r\n                    Gordon benefitted from Jokic’s court vision and turned a couple of his passes into dunks.\n\n\r\n                    “It makes the game so easy,” Gordon said. “He makes the right reads, he’s talking to us on the floor telling us what he wants to see from us. It makes the game easy playing with a guy like that.”\n\n\r\n                    Atlanta got within 13, but Denver took a 97-79 lead into the fourth quarter. A quick start in the fourth gave the Nuggets a 25-point lead, and the Hawks never got the deficit below 20 points the rest of the way.\n\n\r\n                    “We knew it was going to be a tough game,” Young said. “It’s disappointing losing the way we did and by how much but they’re a deep team, and then adding Aaron made them an even better team.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: F De’Andre Hunter missed his third straight game with right knee soreness. “We’re trying to get that removed before he gets on the floor again,” McMillan said before the game. “He hasn’t done anything for the last three days.” ... G Lou Williams, acquired Thursday, will join the team in Phoenix.\n\n\r\n                    Nuggets: JaMychal Green led Denver with a season-high 20 points and Jamal Murray finished with 17 points. ... G Monte Morris (left quad strain) missed his ninth straight game. ... F Gary Clark, acquired from Orlando along with Gordon, is not with the team. \n\n\r\n                    FAN APPRECIATION\n\n\r\n                    The Nuggets will have fans in the stands for the first time this season when they play Philadelphia on Tuesday night. There are expected to be approximately 4,500 health-care workers and first responders in attendance.\n\n\r\n                    NOT FEELING CHARITABLE\n\n\r\n                    Young echoed McMillan’s thoughts on the officials not calling fouls for them in the first quarter but he didn’t want to comment for fear he would be fined.\n\n\r\n                    When it was pointed out that the money the NBA collects for fines goes to charity, Young still didn’t bite.\n\n\r\n                    “If we got to pick I’d probably tell you, probably go more in depth, but I don’t get to pick the charity,” Young said.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: At the Phoenix Suns on Tuesday night.\n\n\r\n                    Nuggets: Host the 76ers on Tuesday night.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997632.853769
}