{
  "game_id": "0021600932",
  "espn_id": "400900327",
  "date": "Mar 05, 2017",
  "matchup": "OKC @ DAL",
  "headline": "Curry, Nowitzki lead Mavericks past Thunder, 104-89",
  "body": "DALLAS --  It seems so long ago when Dirk Nowitzki was sidelined with a sore Achilles and the Dallas Mavericks were at the bottom of the Western Conference.\n\nThings sure have changed in just a few months.\n\nNowitzki is now closing in on another milestone and the Mavs are making a serious run at the playoffs.\n\nNowitzki had 18 points and 12 rebounds and Seth Curry scored 22 as Dallas beat the Oklahoma City Thunder 104-89 on Sunday night. Nowitzki tied his season high for rebounds and is 20 points away from becoming the sixth player to score 30,000. He'll likely set the mark at home, where Dallas plays its next three games.\n\nMeanwhile, the Mavericks are 26-36 and just two games out of the final playoff spot in the Western Conference, having won 12 of 19 overall and 10 of 12 at home.\n\n\"I want to play within the system,\" Nowitzki said. \"I don't want to just hoist shots to get (the milestone). I want to help the team win. We're still chasing a playoff spot, and I think wins right now are more important. Whenever it happens, it happens.\"\n\nRussell Westbrook scored 29 points after scoring more than 40 in each of his last four games. He had six rebounds and five assists, but the Mavericks frustrated him into both a technical foul and a flagrant-one foul. Both came in the midst of a 21-4 third-quarter run that allowed Dallas to blow the game open.\n\nWestbrook picked up the technical with 8:15 to go in the third quarter when he bounced the ball angrily in referee Marat Kogut's direction after being called for an offensive foul. Then he got his flagrant with 4:27 to go in the quarter for shoving Harrison Barnes and sending him sprawling to the court.\n\nWestbrook wouldn't discuss either play after the game, saying, \"It happened. It's over with.\"\n\n\"He's a smart guy. He understands he'll have to do a good job there,\" Thunder coach Billy Donovan said. \"I think he understands what's in front of him and what we need to do. I know the team is important to him and the win is important to him.\"\n\nBarnes, who finished with 17 points, made the flagrant free throws and then another to give the Mavericks their biggest lead at 81-57.\n\n\"I probably won't be getting that invite to the NFL Combine,\" Barnes said of Westbrook's shove.\n\nSteven Adams scored 19 for Oklahoma City, and Enes Kanter had 16.\n\nTIP-INS\n\nThunder: Westbrook's combination of a technical and flagrant-one does not result in an ejection, and he stayed in the game and scored 15 of his team's 21 points in the third quarter. He had 14 in the first quarter and was held scoreless in the second and fourth quarters. ... Victor Oladipo missed his sixth straight game with back spasms.\n\nMavericks: Wesley Matthews was back in the starting lineup after missing two games with a hip injury, scoring nine points and taking the charge that led to Westbrook's technical foul. ... Nerlens Noel had his second straight game in double figures, scoring 13. ... Dallas beat the Thunder for the first time in the teams' past six regular-season meetings.\n\nCURRY ON FIRE\n\nCurry, who has scored more than 20 points in five of the team's last six games, scored eight of Dallas' last 10 in the second quarter to give the Mavs a 60-50 halftime lead. The Mavericks shot 14 for 20 in the second quarter.\n\n\"I just try to exceed expectations and play well,\" Curry said. \"And most importantly turn the season around and help the team win. As long as I'm helping the team win, then I'm doing my job.\"\n\nNOT MY MVP\n\nIt's a good thing for Westbrook that Mavericks owner Mark Cuban doesn't have a vote in the MVP race.\n\nCuban said Sunday night that he would vote for either James Harden or LeBron James, and that Westbrook wasn't in the mix despite averaging a triple-double through 62 games.\n\n\"You look at what Harden is doing on a team that was 41-41 last year,\" Cuban said. \"Look what they're doing now. The Rockets have a top-three record after everybody wrote them off -- because of James Harden. That's the difference.\"\n\nCuban said last year that Westbrook wasn't a superstar because he hadn't led an otherwise average team to a 50-win season and a playoff series victory, and he's sticking to his classification.\n\n\"It's impressive; don't get me wrong,\" Cuban said. \"He's incredible in his own way. But the criteria is the criteria.\" Cuban later added: \"It'd be no fun if I changed my mind.\"\n\nUP NEXT\n\nThunder: Host Portland on Tuesday. The Trail Blazers have won two of the teams' previous three meetings this year, including a 114-109 win Thursday in Portland.\n\nMavericks: Host the Lakers on Tuesday, the start of a three-game stretch -- all at home -- against the three teams with the NBA's three worst records.",
  "source": "espn_api",
  "crawled_at": 1764995263.7316952
}