{
  "game_id": "0021500188",
  "espn_id": "400828075",
  "date": "Nov 20, 2015",
  "matchup": "LAL vs. TOR",
  "headline": "Lowry scores 25, Raptors hang on to beat Lakers 102-91",
  "body": "LOS ANGELES -- A broken bone in starting center Jonas Valanciunas' left hand put a damper on an otherwise satisfying Friday night for the Toronto Raptors.\nKyle Lowry had 25 points, DeMar DeRozan scored seven of his 18 in the final 3:34, and the defending Atlantic Division champions snapped a three-game skid with a 102-91 victory over the Los Angeles Lakers.\nValanciunas scored three points in 18 minutes before breaking his non-shooting hand on a foul by Kobe Bryant under the Toronto basket in the final minute of the first half. Valanciunas broke the same bone -- in his right hand -- during his 2012-13 rookie season and missed 18 games.\n\n\"It's unfortunate, and we're definitely going to miss him because of what we do, so it's next man up right now,\" Lowry said.\nFive players scored in double digits for the Raptors, off to an 8-6 start that began with five straight wins. They converted 15 Lakers turnovers into 21 points.\nTerrence Ross, who signed a three-year, $33 million contract extension with Toronto on Nov. 2, had eight points in 14 minutes after missing six games because of a sprained ligament in his left thumb.\nBryant finished with 10 points in 38 minutes on 5-for-13 shooting after being rested Monday night in Phoenix during the Lakers' 120-101 loss. In his two previous games, he played 32 1/2 minutes at Dallas last Friday and almost 36 minutes two nights later against Detroit in a 97-85 victory.\nRookie point guard D'Angelo Russell, the second pick in the draft, had 17 points in 33 1/2 minutes. Russell is still learning the intricacies of the pro game at the tender age of 19 -- a delicate balance for coach Byron Scott, who made his own NBA debut at age 22.\n\"I think at times you've got to leave him alone and at other times you have to talk with him. But I've got to treat him like a man,\" Scott said before the game. \"Sometimes that might be a little harsh, but he's got to learn. As I told the guys last week, the NBA stands for `No Boys Allowed.' It's a man's game.\n\"He has to get better at cutting, and learning that when the ball is in somebody else's hands, you still be effective. And that's all a part of growing up.\"\nThe last-place Lakers are 11 games out of first place in the Pacific Division, the largest deficit for any team in the NBA -- including the 0-13 Philadelphia 76ers.\nToronto opened a 91-75 lead with a 12-2 run after the Lakers got within six on a 3-pointer by ex-Raptor Lou Williams with 11:10 left. DeMarre Carroll's 3-pointer capped the rally with 7:58 to play, giving Toronto its biggest lead.\n\"It's always important to play with the lead, but we have to find ways to finish games out and be as strong as we were tonight,\" Lowry said.\nThe Lakers responded with a 12-2 spurt capped by a 3 from Metta World Peace that narrowed the gap to 93-87 with 3:49 remaining. Toronto restored its double-digit lead before Bryant's 3-pointer brought the Lakers to 97-91 with 1:48 to go.\n\"Being in these situations the last few games, we understand what we've had to do to win -- get a stop, score, get a stop, score,\" DeRozan said. \"We understand that teams are going to pick it up and try and make their run to close it out in the fourth quarter, so we have to be prepared for it, stay calm and don't panic.\"\nLowry led all scorers in the first half with 19 points, making five of six shots from behind the 3-point line. But the Raptors trailed 50-49 at the break after the Lakers ended the second quarter with a 17-8 run that included six points by Julius Randle.\n\"Once Kyle gets hot like that, it's tough to guard him,\" DeRozan said. \"We looked for him a lot. Once he gets rolling like that, we all know we're going to ride the wave as much as possible and try to make everything easy for him.\"\nTIP-INS\nRaptors: G Norman Powell, who played four seasons at UCLA, spent the entire game on the bench in his first visit to Staples Center as a pro. On Thursday night, his former Bruins teammates named him honorary captain before beating Pepperdine 81-67 at Pauley Pavilion. ... This is the first time the Raptors play the Lakers and Clippers on the same road trip since entering the NBA in 1995-96.\nLakers: Bryant, whose 81-point outburst against Toronto at Staples Center in January 2006 remains the second-highest scoring game in league history, had a triple-double the last time the Lakers hosted the Raptors on Nov. 30, 2014. ... Williams faced his former team for the first time since signing a three-year, $33 million contract with Los Angeles in July. He finished with six points in 16 minutes. Williams was the league's Sixth Man of the Year in 2014-15, but was not offered a contract by the Raptors after the season.\nUP NEXT\nRaptors: At the Los Angeles Clippers on Sunday.\nLakers: Home against Portland on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994314.291202
}