{
  "game_id": "0021300649",
  "espn_id": "400489522",
  "date": "Jan 25, 2014",
  "matchup": "MEM vs. HOU",
  "headline": "Mike Conley leads Grizzlies past Rockets for second straight night",
  "body": "MEMPHIS, Tenn. -- For the second consecutive night, the Memphis Grizzlies slowed down Houston and walked away with a win.\nMike Conley scored 17 points, Zach Randolph had 15 points and 17 rebounds, and the Grizzlies nearly held the Rockets to their lowest output of the season in a 99-81 victory Saturday.\n\"We tried to slow them down,\" Randolph said. \"They like to get up and down the court. They like to run and gun. We just tried to get back and play and get stops.\"\nThe formula was similar to Friday, when the Grizzlies won 88-87 in Houston, but this time Memphis took control early. The Grizzlies held the Rockets to 37 percent shooting and built the lead to as many as 27 points before both teams sent in reserves to finish the game.\nCourtney Lee also had 15 points and Kosta Koufos scored 14, hitting seven of his eight shots from the field. James Johnson added 12 points for Memphis and Nick Calathes had a season-high 11.\nJames Harden led the Rockets with 16 points, and Chandler Parsons scored 11. Dwight Howard had 10 points and 12 rebounds, but Houston's three-game road winning streak was snapped.\n\"The last two games we've been terrible offensively,\" Parsons said. \"Their pace works for them. They make you play a half-court offense. They are physical. They grab. They reach. They hold. When you do that so much, they are not going to call every single foul.\"\nMemphis' bench outscored the Rockets' reserves 44-27. The Grizzlies also had a 56-32 advantage in the paint and a 52-38 edge on the boards.\nThe Grizzlies, as they did Friday, controlled the pace of the game, holding Houston to its second-lowest scoring output this season. Houston's season low was 80 points on Jan. 10 at Atlanta.\nRockets coach Kevin McHale said before the game that Houston needed a score in the 100s to overcome Memphis' deliberate, grind-it-out pace. That game plan went awry when the Rockets, who entered averaging 105.5 points, managed only 14 in the first quarter.\n\"They beat us. Bottom line,\" McHale said. \"They beat us (Friday) night, and they beat us up again (Saturday). They got offensive rebounds. They moved the ball. They caught us being stagnant, and they were better than us by far.\"\nMemphis extended its 11-point halftime lead by outscoring the Rockets 25-19 in the third quarter. Lee had nine points in the period and Harden scored 10 for the Rockets, limited to five field goals out of 21 shots. Three of those baskets were by Harden.\nFrom there, Memphis stretched the lead to 27 midway through the fourth, and McHale began sending in his backups.\nParsons, who connected on 10 shots from 3-point range Friday, finished 1 of 6 from long range, part of the Rockets going 9 of 32 from 3-point territory.\nMemphis has won 12 of its last 17 and is 5-1 since Marc Gasol returned from a knee injury. Several Grizzlies said the team appears on the verge of regaining the identity it had during recent playoff runs.\n\"We're ready to win and we prepare like we want to win,\" Johnson said. \"We travel like we want to win, and everybody is holding each other accountable. When you put those things together, we beat teams bad.\"\nGame notes\nSince moving to Memphis, the only other time the Grizzlies played a home-and-home set on back-to-back nights was in 2006 against the Dallas Mavericks. ... Randolph played his 300th game for the Grizzlies and posted his 189th double-double, tying Pau Gasol's total with the team. ... The Rockets were held under 90 points for the sixth time this season.",
  "source": "espn_api",
  "crawled_at": 1764993075.8393202
}