{
  "game_id": "0021800283",
  "espn_id": "401070964",
  "date": "Nov 24, 2018",
  "matchup": "DAL vs. BOS",
  "headline": "Barea, Mavs pull away in 4th for 113-104 win over Celtics",
  "body": "DALLAS --  J.J. Barea held the shooter's pose for several seconds before big center DeAndre Jordan picked him up and carried him to the bench , the diminutive Dallas guard high-fiving everybody along the way.\n\nIt just felt like a big 3-pointer in the Mavericks' sixth straight home victory.\n\nBarea scored 20 points and tag-teamed with Wesley Matthews on back-to-back 3s to take control in the fourth quarter of a 113-104 victory over the Boston Celtics on Saturday night.\n\n\"I was mad that I missed the one before that one, went in and out on me,\" Barea said. \"First time I think I've been lifted up from the other side of the court all the way to the bench. We're having fun.\"\n\nHarrison Barnes also had 20 points, teenage rookie Luka Doncic totaled 15 points and matched Barea with eight assists, while starting at point guard with Dennis Smith Jr. sidelined by a wrist injury, as the Mavericks (9-9) got back to .500 with their seventh win in nine games.\n\nIt's the latest Dallas has been .500 or better since the end of the 2015-16 season, and it's the first six-game home winning streak for the Mavericks in almost two years.\n\nJayson Tatum scored 21 points and Kyrie Irving and Marcus Smart had 19 apiece for the Celtics, who followed a win with a loss in a back-to-back for the third straight time this season a night after winning in Atlanta.\n\nBoston was without Gordon Hayward, who sat with soreness in his surgically repaired left ankle, in part because of playing on consecutive nights.\n\nJust like a Dallas team coming off consecutive woeful seasons, the Celtics (10-10) are at .500 coming off two straight trips to the Eastern Conference finals.\n\n\"We don't impose our fear and will on teams,\" said Smart, who had to be held back from fans by Irving in the final seconds against his hometown team. \"Last year, teams when they came in and played the Celtics, they knew they were in for a fight. This year, teams can't wait to play us and that's a problem.\"\n\nThe Mavericks led by five starting the fourth quarter but pushed the lead to 106-90 on those consecutive 3-pointers from Barea and Matthews, who had 15 points after missing three straight games and four of the past five with a left hamstring strain.\n\nDoncic looked like a natural at the point from the start with five assists in the first quarter while making all three of his 3-point attempts for nine points.\n\nIn one sequence, he sent Marcus Morris lunging toward the basket with a fake away from the ball, then watched Irving fly past him by faking the shot before making a 3.\n\nIrving got rolling in the second quarter, scoring nine points on 4-of-5 shooting while helping cut an 11-point deficit to three at halftime (59-56).\n\nDECKING DONCIC\n\nDoncic was doing enough for the Celtics to feel the need to try to knock him off his game in the third quarter.\n\nJaylen Brown put a forearm in Doncic's chest when he was looking another direction while running up the floor and sent the 19-year-old sprawling. Brown's move came after Doncic intercepted a pass in transition near midcourt, drove to the baseline and slipped a pass to Jordan for a dunk.\n\nJordan was given his second technical for hanging on the rim, but officials ruled it a non-unsportsmanlike technical, allowing Jordan to avoid an ejection as he finished with 14 points and 13 rebounds. Brown received an offsetting technical on a video review for the blindside hit on Doncic.\n\nCHIPPY LATE, TOO\n\nDoncic had to be separated from Brown after getting knocked to the floor, and there was another dustup when Smart shoved Maxi Kleber not long after they were part of a jump ball in the final seconds, long after the outcome had been decided. Smart was assessed a technical.\n\nTIP-INS\n\nCeltics: Al Horford returned after missing his first game of the season to rest a sore left knee. He had eight points and eight rebounds. ... Brown scored 16 points, and Morris added 13. ... Irving was 9 of 24 from the field with six assists and five turnovers.\n\nMavericks: F/C Dwight Powell missed his third straight game with a left knee injury. ... Coach Rick Carlisle said Smith sprained his right wrist in a loss to Memphis two games earlier. He played but was limited in a win over Brooklyn.\n\nUP NEXT\n\nCeltics: At New Orleans on Monday.\n\nMavericks: At Houston on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995469.909825
}