{
  "game_id": "0021800361",
  "espn_id": "401071042",
  "date": "Dec 05, 2018",
  "matchup": "MIL vs. DET",
  "headline": "Bledsoe scores 27, leads Bucks to 115-92 win over Pistons",
  "body": "MILWAUKEE --  The formula for success in Milwaukee doesn't always have to revolve around the high-scoring duo of Giannis Antetokounmpo and Khris Middleton.\n\nEric Bledsoe matched his season high with 27 points and Antetokounmpo added 15 as the Bucks rolled to a 115-92 victory over the Detroit Pistons on Wednesday night.\n\nMiddleton, the team's second-leading scorer at 18.5 points per game, was inactive for personal reasons. Antetokounmpo's output was 13 below his average, although he added a team-high eight rebounds.\n\n\"For other guys to step up when we needed, it's always a good sign,\" Bucks coach Mike Budenholzer said. \"We talk about being prepared for your opportunities, and different guys either get bigger opportunities, or get to play that haven't been playing.\"\n\nMilwaukee countered an opening basket with nine consecutive points and did not trail after that. The Bucks led 30-21 after one quarter, 56-45 at halftime and then opened the third period with a 19-4 run.\n\nBledsoe's 3-pointer put Milwaukee up 75-49 with 7:25 left in the third.\n\n\"If you're not making shots, you have to defend. I thought we guarded the 3-point line in stretches but not good enough,\" Pistons coach Dwane Casey said. \"They play a different style so we have to get out and guard the 3-point line, but we did not do a good job of that tonight.\"\n\nBlake Griffin had 31 points and Reggie Jackson scored 15 for the Pistons, who lost their second straight after a five-game winning streak.\n\nThe Bucks, with the second-best record (16-7) in the East behind Toronto, improved to 12-2 at home. They are 4-5 on the road.\n\nMilwaukee was playing its first game since Saturday, while the Pistons were playing their fourth in six days.\n\n\"When you're in the middle part of that playoff race, everybody is fighting for something,\" Casey said. \"These next gauntlet games will be like that. Our fight level has to go up. I thought that group at the end (showed fight). The first group showed it in stretches, but we have to come out of the chute with the same fight.\"\n\nAntetokounmpo was limited to six points in the first half on 3-of-8 shooting, but Bledsoe picked up the slack with 18 points, aggressively going to the basket.\n\n\"I had to, especially with one of our main guys out,\" Bledsoe said. \"Somebody had to have a good game.\"\n\nGriffin kept the Pistons close in the first half with 22 points on 9-of-16 shooting, including 3 of 6 from beyond the arc.\n\nMilwaukee closed the first quarter with a 9-4 spurt. Two free throws by Thon Maker gave the Bucks their biggest lead of the half at 56-43.\n\nDetroit's bench was a combined 3 for 17 in the first half, missing all six 3-point attempts.\n\nTIP-INS\n\nPistons: G Ish Smith strained his right groin and did not play in the second half. \"I don't think it's anything terrible. I should be fine,\" Smith said. \"It was real frustrating (not playing). We'll figure it out. We'll see what's the deal tomorrow after the MRI. I heal fast, so I should be all right.\"\n\nEXAM WEEK\n\nDetroit entered with the fourth-best record in the East. After hosting two-time defending champion Golden State on Friday, the Bucks play at East-leading Toronto on Sunday. \"The Warriors, everybody knows how good they are, and how they test you, and then the same with Toronto,\" Budenholzer said. \"I think those are great for a team. You learn from them, really win or lose, and what it's going to take to play against the elite teams.\"\n\nUP NEXT\n\nPistons: Return home to host the Philadelphia 76ers on Friday.\n\nBucks: Host the Golden State Warriors on Friday.\n\n---\n\nFor more AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994512.311114
}