{
  "game_id": "0022300998",
  "espn_id": "401585626",
  "date": "Mar 20, 2024",
  "matchup": "MIL @ BOS",
  "headline": "Celtics open big lead, hold on to beat Bucks without Giannis, 122-119",
  "body": "BOSTON -- — Milwaukee Bucks guard Patrick Beverley made a spin move in the lane, floated a jumper over Boston's Luke Kornet and then headed back on defense in a crouch, holding his hand a few inches above the floor to mock the Celtics center.\n\n\r\n              Too small?\n\n\r\n              No, too soon.\n\n\r\n              Irked by the insult to his teammate, Payton Pritchard erupted for 10 points in the quarter, matching the entire Bucks output and helping the Celtics open a big lead before holding on for a 122-119 victory over Milwaukee on Wednesday night. \n\n\r\n              “It kind of lit a fire under me,” said the 6-foot-1 Pritchard, who had 19 points and six rebounds — most of it in the second quarter, when Boston turned a five-point lead into an 18-point cushion. “He's trying to clown one of our teammates. So I definitely took it a little personally.”\n\n\r\n              Jayson Tatum scored 31 points for Boston, which took advantage of the absence of two-time MVP Giannis Antetokounmpo to win its seventh straight game. The Celtics have not lost to an Eastern Conference team at home all season.\n\n\r\n              Derrick White had 23 points and eight assists, while Jaylen Brown finished with 21 points and eight boards for Boston. \n\n\r\n              Damian Lillard scored 32, including a 3-pointer in the final second. Bobby Portis had 24 points and 15 rebounds for the Bucks, who had won two in a row. \n\n\r\n              Although the game featured two East division leaders, the Celtics hold an 11-game edge over the second-seeded Bucks in the race for home-court advantage. Any other juice in the matchup was lost when Antetokounmpo was ruled out for the second straight game with a left hamstring problem.\n\n\r\n              Celtics coach Joe Mazzulla said the game wasn't necessarily a playoff preview. \n\n\r\n              “Nothing’s guaranteed in life,” he said. “We may see them; they may see us; we may not. You never know what’s going to happen. I know both teams are developing an identity and there's obviously a DNA there that both teams have. But you don't want to overthink things. And you don’t take anything for granted.” \n\n\r\n              It was 10-all when the Celtics scored 13 of the next 15 points to open an 11-point lead. The Bucks cut it to two before the end of the first quarter, but Boston used a 21-8 run – with 10 points coming from Pritchard -- to make it 56-38. \n\n\r\n              Pritchard also had the most rebounds (four) and assists (three) in the quarter.\n\n\r\n              \"Everybody always had talked about his shooting,\" Mazzulla said. “But I think this year, in particular, he’s been impacting by his rebounding, impacting by his defense, his pace. He’s just becoming a really well-rounded player who knows he can have a positive impact on the game in many different ways, and it’s a huge asset for us.”\n\n\r\n              Pritchard also fired up the crowd when he took an offensive board away from Brook Lopez, a player a full foot taller. Frustrated, the 7-foot-1 center pushed him away in disgust.\n\n\r\n              Pritchard celebrated by flexing his muscles and slapping hands with Kristaps Porzingis; Tatum waved his arms to encourage the crowd, which rose to give Pritchard a standing ovation.\n\n\r\n              “Just a winning play,\" Pritchard said. “He’s a 7-footer and I’m 6-foot -- you know, little in the NBA standard. I’m just a competitor.”\n\n\r\n              Boston led by as many as 21 points but the Bucks didn't get within single digits until the final minutes, when they scored 10 straight points — eight of them, including back-to-back long 3-pointers, from Portis — to turn a 13-point lead into a one-possession game. \n\n\r\n              But Portis missed a 3, Tatum hit a pair of free throws and then the Celtics star drove for a layup to make it 114-107 with 1:38 to play. \n\n\r\n              Antetokounmpo also missed the Bucks’ 140-129 home victory over Phoenix on Sunday. He has missed five games this season; Milwaukee is 3-2 without him.\n\n\r\n              The Greek star, 29, ranks third in the NBA in scoring (30.8), sixth in rebounding (11.2) and 15th in assists (6.4) this season.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Brooklyn on Thursday night.\n\n\r\n              Celtics: At Detroit on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996504.9304168
}