{
  "game_id": "0022300522",
  "espn_id": "401585150",
  "date": "Jan 10, 2024",
  "matchup": "MIA vs. OKC",
  "headline": "Gilgeous-Alexander scores 28 points, Thunder use runs of 17-0 and 13-0 to beat Heat 128-120",
  "body": "MIAMI -- — The season is nearing the halfway point, and the Oklahoma City Thunder are barely outside of the top spot in the Western Conference.\n\n\r\n              They're not impressed.\n\n\r\n              Shai Gilgeous-Alexander scored 28 points, Chet Holmgren added 23 and the Thunder used two big second-half runs to beat the Miami Heat 128-120 on Wednesday night.\n\n\r\n              At 25-11, Oklahoma City is off to its best 36-game start since 2015-16 — a season when Kevin Durant, Russell Westbrook and the Thunder wound up making the West finals.\n\n\r\n              “What's put us in this position is we've improved continuously,” Thunder coach Mark Daigneault said. “We prepare for the next game. We execute as best we can. We do our best. We compete together. We understand it's not perfect and then we learn from the good, the bad. And we just rinse and repeat that 82 times ... wherever that lands us.”\n\n\r\n              The Thunder rode the strength of two big runs — a 13-0 spurt to open the third quarter, then a 17-0 run that started late in the third and extended five minutes into the fourth. Miami missed its first five shots of the second half, then missed 10 straight during the second Oklahoma City burst.\n\n\r\n              Jalen Williams finished with 19 points, a career-best 12 assists and nine rebounds, while Lu Dort scored 14 points and Isaiah Joe added 11. Oklahoma City beat Miami for the second time in the last 10 meetings.\n\n\r\n              “I think it was around the third quarter, the start of the fourth, we had a really big run defensively,” Williams said. “I think that kind of turned the tide in the game.”\n\n\r\n              Bam Adebayo led Miami with 25 points, 11 rebounds and six assists. Jaime Jaquez Jr. scored 21 points and Haywood Highsmith had a career-best 19.\n\n\r\n              Tyler Herro scored 17 points, Nikola Jovic added 15 and Kevin Love had 12 for the Heat. Miami used a late 10-0 run to get within six with 1:08 remaining, but wouldn't score again.\n\n\r\n              Miami used its 20th different starting lineup of the season, in only 37 games. Jimmy Butler (toe, foot) and Caleb Martin (ankle) remained out, and Kyle Lowry was out with the sprained left hand that he suffered Monday night against Houston.\n\n\r\n              Miami led 69-65 after a statistically odd first half, one where the Thunder shot 69.2% and didn’t lead. History said that shouldn’t have happened.\n\n\r\n              Since the NBA began logging play-by-play data digitally in 1996-97, there had been 130 instances of a team shooting 69.2% or better in a first half — and this was only the third time that a team shot that well in the opening 24 minutes but trailed at the break anyway.\n\n\r\n              The Thunder cooled off in the second half, but still finished the game shooting 59%.\n\n\r\n              “We should always be competing on defense,” Herro said. “When we’re missing shots we can’t let that affect our energy and effort on the other end.”\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Portland on Thursday night.\n\n\r\n              Heat: Host Orlando on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996693.597501
}