{
  "game_id": "0022000250",
  "espn_id": "401267410",
  "date": "Jan 24, 2021",
  "matchup": "CLE @ BOS",
  "headline": "Brown scores 33, leads Celtics to 141-103 win over Cavs",
  "body": "BOSTON -- — Jaylen Brown scored 20 of his 33 points in the third quarter and the Boston Celtics snapped their three-game losing streak Sunday night by cruising to a 141-103 victory over the Cleveland Cavaliers.\n\n\r\n                    Kemba Walker added 21 points, Daniel Theis scored 17, Carsen Edwards had 15 and Marcus Smart had 12 for Boston, which posted a season high in points in a half, taking a 73-51 edge into intermission. Brown played just 19 minutes.\n\n\r\n                    “We needed a win,” Brown said. “We lost three in a row. Being back on our floor, we wanted to make sure we came out with great intensity and we did.”\n\n\r\n                    Collin Sexton led Cleveland with 13 points, far below his team-leading average of 26.8 per game, as the Cavaliers' three-game winning streak ended.\n\n\r\n                    Coming off impressive back-to-back victories over the Brooklyn Nets in which they scored 147 and 125 points, respectively, the Cavaliers were simply never in this one.\n\n\r\n                    Boston pushed the ball out on the fast break, getting several easy looks that it converted while the Cavaliers missed 10 of their initial 13 shots.\n\n\r\n                    “I thought our defensive intensity was good for most of the game and I thought our offense fed off of it,” Boston coach Brad Stevens said. \n\n\r\n                    Brown made it look easy in his limited playing time. He's scored 25 or more in four straight games, the longest stretch of his career.\n\n\r\n                    “He’s in a great rhythm scoring,” Stevens said.\n\n\r\n                    Behind Smart’s 10 points and Brown’s nine, the Celtics shot 60% and pulled to a 38-21 lead after the opening quarter.\n\n\r\n                    They pushed it to 41-21 on Walker’s 3-pointer on the first possession of the second quarter.\n\n\r\n                    “We can't get complacent. We won three games in a row,\" said Cleveland guard Jarrett Allen, who scored 12 points. “We came out flat, almost like we expected to win. We have to come out hungry.”\n\n\r\n                    The Celtics used a 15-0 spree to pull ahead 96-59 on Walker’s 3-pointer from the left wing that sailed through the net as he was falling to the floor with 6 1/2 minutes left in the third quarter. It came a possession after Brown nailed a 3 from directly in front of Cleveland’s bench. From there, both coaches gave ample playing time to their reserves.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Sexton had scored 20 or more points in 15 straight games. ... Andre Drummond had 11 points and five rebounds, his second time this season falling short of a double-double. ... F Kevin Love missed his 13th straight with a strained calf.\n\n\r\n                    Celtics: Rookie guard Payton Pritchard was sidelined with a Grade 1 right MCL sprain he sustained in the last game. ... No starter played more than 27 minutes. ... Like they did before the previous two games, the players huddled with their arms around each other during the national anthem. ... Stevens had a one-word answer after when asked if Walker would play Monday in consecutive games: “No.” Walker has been working his way back from a left knee injury that delayed his start to the season.\n\n\r\n                    TATUM'S RETURN\n\n\r\n                    Jayson Tatum has been cleared to play Monday night against the Chicago Bulls, Stevens said. Tatum missed his fifth straight game Sunday due to COVID-19 protocols.\n\n\r\n                    HE LOOKS FAMILIAR\n\n\r\n                    Boston C Tristan Thompson spent his first nine seasons with Cleveland before signing as a free agent with the Celtics during the offseason.\n\n\r\n                    He greeted his former team by scoring Boston's first basket.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Host the defending champion Lakers on Monday night, opening a stretch of six of their next eight at home.\n\n\r\n                    Celtics: At the Bulls on Monday, beginning a stretch of seven of their next eight on the road.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997894.691563
}