{
  "game_id": "0022200861",
  "espn_id": "401469016",
  "date": "Feb 13, 2023",
  "matchup": "MIA vs. DEN",
  "headline": "Nikola Jokic scores 27, Nuggets hold off Heat 112-108",
  "body": "MIAMI -- — No team came into Monday night having allowed fewer points in the paint per game this season than Miami.\n\n\r\n              Nikola Jokic wasn't bothered.\n\n\r\n              The two-time reigning MVP made the most of every opportunity, finishing with 27 points on 12-of-14 shooting and leading the Denver Nuggets past the Heat 112-108 — snapping Miami's eight-game home winning streak.\n\n\r\n              “Nikola did what he does,\" Denver coach Michael Malone said.\n\n\r\n              Jokic also had 12 rebounds and eight assists for Denver, which shot 58%. The Nuggets moved five games ahead of idle Memphis atop the Western Conference standings and joined Boston as the only teams to reach the 40-win mark this season.\n\n\r\n              “He’s a great player. He makes everybody around him better,” Miami’s Max Strus said. “They stepped up and made shots. Tough team to beat. Obviously, they’re No. 1 in the West for a reason.”\n\n\r\n              The Nuggets were 29 of 40 inside the paint, good for 58 points. Miami came into the night allowing an average of 44.9 paint points.\n\n\r\n              Michael Porter Jr. scored 17, Bruce Brown added 16, Jeff Green scored 12 and three Nuggets — Vlatko Cancar, Christian Braun and Thomas Bryant — each finished with 10 points.\n\n\r\n              “It speaks to the quality of our depth,\" Malone said.\n\n\r\n              Jimmy Butler had 24 points, nine assists and eight rebounds for the Heat. Strus scored 23, Bam Adebayo had 19, Gabe Vincent 15 and Jamaree Bouyea added 10 for Miami.\n\n\r\n              Denver was without its second- and third-leading scorers — Jamal Murray (right knee inflammation) and Aaron Gordon (left rib contusion). It was the fifth consecutive game missed for Murray, and the third in a span of five games for Gordon.\n\n\r\n              Malone said “hopefully, maybe” they could return in Denver’s game against Dallas on Wednesday, the team’s finale before the All-Star break.\n\n\r\n              Brown, who played his college ball at Miami, made a 3-pointer with 9:07 left in the third to put Denver up 70-69 — and the Nuggets held the lead the rest of the way. Denver eventually led by as many as 10. Miami got within one point on three occasions from there.\n\n\r\n              “People don't win here a lot, especially because there's a lot of festivities, obviously,\" Brown said. “But they're also a great team ... glad we got the win.\"\n\n\r\n              It was the 40th double-double of the season for Jokic. Only Sacramento’s Domantas Sabonis, with 44, has more.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Denver's 40-18 record matches the best 58-game start in franchise history. The Nuggets also were 40-18 in the 2018-19 and 2019-20 seasons. ... Jokic got a technical with 16.7 seconds left in the half, arguing that he was fouled as he scored. It was his third technical of the season.\n\n\r\n              Heat: It was another close game for Miami. The Heat fell to 20-12 in games decided by five points or fewer. ... Miami Dolphins coach Mike McDaniel was at the game. ... The Heat do not play at home again until March 1. That’ll start a stretch where 12 of the final 20 Heat games are at home. ... Kyle Lowry (left knee soreness) and Victor Oladipo (ankle) remained out. Tyler Herro also missed the game with a left knee bruise, suffered in Saturday’s win at Orlando.\n\n\r\n              BAM’S MOM\n\n\r\n              Marilyn Blount, Adebayo’s mother, presented her two-time All-Star son with a ball commemorating the accomplishment in a brief pregame ceremony. \n\n\r\n              JOKIC VS. JOVIC\n\n\r\n              Barring an NBA Finals meeting, the world will have to wait until next season for a Jokic vs. Jovic matchup. Heat rookie Nikola Jovic did not play in either Miami-Denver game this season. He’s currently out with a stress reaction in his lower back.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Dallas on Wednesday.\n\n\r\n              Heat: Visit Brooklyn on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993940.6185029
}