{
  "game_id": "0021801081",
  "espn_id": "401071754",
  "date": "Mar 22, 2019",
  "matchup": "CLE vs. LAC",
  "headline": "Gallinari scores 27 as Clippers edge Cavaliers 110-108",
  "body": "CLEVELAND --  The Los Angeles Clippers' latest victory in a torrid March came the hard way.\n\nWhile happy to leave town on a high note, coach Doc Rivers knew his team caught a break Friday night in a 110-108 win over the Cleveland Cavaliers that was in doubt until Jordan Clarkson's 3-point attempt from the top of the key hit off the back rim as time ran out.\n\n\"We were supposed to foul on that last play, but didn't,\" Rivers said. \"And we just got lucky they missed the shot.\"\n\nDanilo Gallinari led Los Angeles with 27 points. Shai Gilgeous-Alexander scored 16, while Lou Williams had 15 for the Clippers, who are 9-1 this month and closing in on a playoff spot in the Western Conference.\n\nLos Angeles, which began the night eighth in the conference, hung on in the final seconds after leading by six points with just under two minutes to play. Patrick Beverley split a pair of free throws with 6 left, giving the Clippers a two-point lead.\n\nClarkson took the inbounds pass and dribbled as the clock ticked down.\n\n\"I thought it was in,\" he said. \"It happens. It's part of the game. I was open and we got a good shot.\"\n\nKevin Love scored 22 points for Cleveland, which trailed 94-83 early in the fourth quarter. Clarkson and rookie Collin Sexton each had 20.\n\nCleveland trailed 108-102 with just under two minutes to play, but baskets by Clarkson and Larry Nance Jr. cut the lead to two with 37 seconds left.\n\nBeverley missed a 3-pointer, but the Clippers grabbed the rebound and Landry Shamet made one of two free throws with 13 seconds to play.\n\nLove scored in the lane with 10 seconds left to cut the lead to one before Beverley's free throw.\n\nLos Angeles didn't lead until early in the third. Beverley's tip-in midway through the period broke a 73-all tie.\n\nThe Clippers play their next three games on the road, including a meeting with Milwaukee, which has the league's best record.\n\n\"We treat every game as a business trip,\" Beverley said. \"You can have fun in the summertime. Right now, we're going for the highest seed we can get.\"\n\nCleveland scored 40 points in the first quarter. The Cavaliers had won four straight at home, including victories over Detroit and Milwaukee. The Pistons were playing without Blake Griffin, while Giannis Antetokounmpo sat out for the Bucks.\n\nSexton had scored more than 23 points in seven straight games, surpassing a mark for rookies last accomplished by Tim Duncan in 1998.\n\nTIP-INS\n\nClippers: Gallinari scored 11 of the team's 24 points in the first quarter. ... Montrezl Harrell took an elbow in the face from Sexton in the first quarter, but remained in the game and scored 14 points. ... Shamet had 15 points.\n\nCavaliers: G Matthew Dellavedova missed his eighth straight game with a concussion. ... Nance, who missed five games with a bruised rib before returning Wednesday, was hit in the chest taking a charge in the second quarter.\n\nTOUGH WEEK\n\nLove didn't play Monday after taking a hard fall last Saturday. He returned Wednesday, but banged heads with Milwaukee's Eric Bledsoe.\n\nLove's problems continued in the second quarter when he was hit in the groin area by Gallinari's forearm. The five-time All-Star spent a couple of moments on the floor in pain, but stayed in the game.\n\n\"I've got to be a little bit more lucky, I guess,\" he said. \"Even tonight, I got hit in a spot you don't want to get hit. I'm still here. I feel good.\"\n\nCOACHING LOOP\n\nRivers has kept in contact with Tyronn Lue, who was fired as Cavs head coach on Oct. 28. Lue, an assistant on Rivers' staff in Boston, has attended a few Clippers' practices.\n\n\"He wants to get back in and he deserves to be back in,\" Rivers said. \"He's feeling great. He wouldn't tell you this, but maybe this happened at the perfect time for his health.\"\n\nLue missed several games last season because he wasn't feeling well. He coached Cleveland to the NBA title in 2016 and three straight NBA Finals appearances.\n\nBIG WIN\n\nRivers was in a good mood during his pregame press conference after UC Irvine upset Kansas State in the NCAA Tournament. His son, Spencer, played seven minutes for the winners.\n\n\"OK, what do you guys want to talk about, the Anteaters?\" Rivers said as he walked into the interview room.\n\nUP NEXT\n\nClippers: Visit New York on Sunday.\n\nCavaliers: Visit Milwaukee on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994735.534998
}