{
  "game_id": "0022400587",
  "espn_id": "401705153",
  "date": "Jan 18, 2025",
  "matchup": "ATL @ BOS",
  "headline": "Young scores 28 points to lead the Hawks to a 119-115 overtime victory over the struggling Celtics",
  "body": "BOSTON -- — Dyson Daniels hit a short jumper in the lane with just over a minute left in overtime and Onyeka Okongwu made two free throws with 11 seconds left, lifting the Atlanta Hawks to a 119-115 victory over the Boston Celtics on Saturday night.\n\n\r\n              Trae Young led Atlanta with 28 points and 12 assists, and Daniels finished with 23 points.\n\n\r\n              Jaylen Brown had 24 points, 11 rebounds and eight assists for Boston.\n\n\r\n              Celtics’ star Jayson Tatum added 23 points after coming into the game listed as questionable with a left shoulder strain. He shot 7 of 21 overall.\n\n\r\n              After putting up 30 points in a victory over Orlando on Friday, Tatum was flexing his shoulder often when he was talking to a trainer during pregame shootaround. He didn’t seem to take many shots and started the game by missing seven of eight. \n\n\r\n              Young hit two free throws to tie it with 3.5 seconds left in regulation and Tatum missed a fallaway as the horn sounded. Tatum also missed a 3 late in OT.\n\n\r\n              Takeaways\r\n              Hawks: Young returned to lineup after missing the previous game with a bruised rib. De’Andre Hunter was also back after being out with a sore left foot. \n\n\r\n              Celtics: With big men Al Horford (left toe sprain) and Kristaps Porzingis (injury management) sidelined, Luke Kornet started and finished with 17 points and seven rebounds in 31 minutes.\n\n\r\n              Key moment\r\n              Tatum and Hunter got into a tussle going for a rebound in OT and had to be separated. The officials didn’t issue any technicals, which was important because Tatum had received one in the second quarter.\n\n\r\n              Key stat\r\n              The Celtics are 8-8 in their last 16 games.\n\n\r\n              Up next\r\n              The Hawks are at the New York Knicks on Monday, and the Celtics open a West Coast trip at Golden State, also on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997947.7174258
}