{
  "game_id": "401810160",
  "espn_id": "401810160",
  "date": "Nov 30, 2025",
  "matchup": "POR vs OKC",
  "headline": "Gilgeous-Alexander scores 26, Thunder hold on to beat Trail Blazers 123-115",
  "body": "PORTLAND, Ore. -- — Shai Gilgeous-Alexander scored 26 points, Chet Holmgren had 19 points and nine rebounds, and the Oklahoma City Thunder beat the Portland Trail Blazers 123-115 on Sunday night for their 12th straight victory.\n\n\r\n              The Thunder move to 20-1 with the win, their only loss coming against the Trail Blazers on Nov. 5.\n\n\r\n              In his second game back from wrist surgery, Jalen Williams had 16 points and eight rebounds in 34 minutes.\n\n\r\n              Deni Avdija finished with 31 points, 19 rebounds and 10 assists for Portland. Toumani Camara had 19 points and eight rebounds, and Jerami Grant scored 18 points.\n\n\r\n              Holding a 76-74 lead, the Thunder unsuccessfully challenged Holmgren’s fourth foul with 5:00 left in the third quarter. He returned to start the fourth quarter but picked up his fifth foul. Portland cut the lead to 95-93 before Holmgren returned with 8:08 left.\n\n\r\n              That's when the Thunder regained control. A layup by Kenrich Williams pushed the lead to 102-93 with 6:53 left. Williams made it 105-96 on a 3-pointer a little more than a minute later.\n\n\r\n              Gilgeous-Alexander’s fadeaway pushed Oklahoma City ahead 107-100 with 4:18 to go.\n\n\r\n              Portland got back within two points 107-105 with 2:58 left, but the Thunder led by Gilgeous-Alexander used their experience to close out the game.\n\n\r\n              Offense flowed for both teams in the second quarter, with both shooting over 40% from the 3-point line and 50% from the field. Grant’s 3-pointer with 9.2 seconds remaining gave Portland a 55-54 halftime lead.\n\n\r\n              The Thunder were without Isaiah Hartenstein and Alex Caruso.\n\n\r\n              Up next\r\n              Thunder: At Golden State on Tuesday night.\n\n\r\n              Trail Blazers: At Toronto on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042724.5223198
}