{
  "game_id": "0022201033",
  "espn_id": "401469188",
  "date": "Mar 14, 2023",
  "matchup": "MIL @ PHX",
  "headline": "Bucks clinch playoff spot, top Suns 116-104 for 50th win",
  "body": "PHOENIX -- — The Milwaukee Bucks walked into one of the toughest places to play in the NBA, snatched the lead from the Phoenix Suns midway through the fourth quarter and then closed with a flourish to earn a 116-104 victory.\n\n\r\n              That's not easy to do. \n\n\r\n              But the Bucks made it look easy. That's exactly why they became the first team to clinch a playoff berth this season Tuesday night, as well as becoming the first to 50 wins this season.\n\n\r\n              “We just have a good balance on our team,” Bucks guard Jrue Holiday said. ”At any given moment, somebody can explode.\"\n\n\r\n              Giannis Antetokounmpo provided his usual scoring with 36 points while Brook Lopez added 21. The Bucks have won 21 of their past 23 games in an impressive two-month run. The Suns have dropped three straight.\n\n\r\n              “We just mentioned it in the coaches' locker room to appreciate this,” Bucks coach Mike Budenholzer said. “Making the playoffs in this league is hard. You should never take anything for granted.”\n\n\r\n              Said Antetokounmpo: “We are good. We are in a good place right now. We got to keep on learning, staying humble.”\n\n\r\n              The Suns trailed by nine points at halftime but cut the deficit to 85-84 heading to the fourth after Devin Booker hit a mid-range jumper at the third quarter buzzer.\n\n\r\n              Cam Payne hit back-to-back 3-pointers to put the Suns up 90-87, which was their first lead of the second half. The game stayed tight for the next several minutes but the Bucks took the lead for good when Pat Connaughton hit a corner 3 for a 100-97 advantage with 6:30 remaining.\n\n\r\n              Antetokounmpo added 11 rebounds and eight assists. Lopez shot 10 of 14 from the field and added 10 rebounds. The Bucks closed the game on a 24-9 run.\n\n\r\n              Booker led the Suns with 30 points on 13-of-27 shooting. Deandre Ayton had 19 points and eight rebounds despite playing just 26 minutes because of foul trouble.\n\n\r\n              The Bucks led 57-48 at halftime. Antetokounmpo led the Bucks with 20 points while Booker and Ayton both had 10 for the Suns. Phoenix shot just 39.2% from the field in the first half.\n\n\r\n              IRRITATED MONTY\n\n\r\n              There was a large free throw disparity in the game with the Bucks shooting 37 free throws while the Suns shot 16. \n\n\r\n              Suns coach Monty Williams wasn't pleased.\n\n\r\n              “It is not fair,” Williams said. “Book has three free throws and Jrue Holiday is one of the most physical defenders in the game. Giannis has 24 free throws. It is ridiculous. There is no other way to put it.”\n\n\r\n              Later, Williams added: “They beat us, make no mistake about it, but that is a hard one to swallow.”\n\n\r\n              TORREY'S TOOTH\n\n\r\n              Suns forward Torrey Craig lost a tooth in the third quarter after taking an inadvertent elbow from Antetokounmpo. He laid on the floor for a few seconds before finding his tooth on the ground, which he picked up and took to the bench. \n\n\r\n              TIP-INS\n\n\r\n              Bucks: Guards Grayson Allen (sore foot), Goran Dragic (sore knee) and Khris Middleton (right knee injury management) all missed the game. ... Signed C Meyers Leonard to a contract for the remainder of the season. Leonard has played in five games while on two 10-day contracts, averaging 2.8 points and 2.0 rebounds. ... F Jae Crowder returned to Phoenix for the first time since being included in the trade that brought Kevin Durant to the Suns. He hit a 3-pointer with 1:23 left that gave the Bucks a 13-point lead.\n\n\r\n              Suns: Durant missed his fourth straight game because of a sprained left ankle. He's played just three games since coming to the team via trade in February. ... Hosted a 60th straight sellout crowd. ... Booker has scored at least 20 points in 21 straight games. That's the third-longest active streak in the NBA behind Joel Embiid and Jayson Tatum.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Indiana on Thursday.\n\n\r\n              Suns: Host Orlando on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994556.5465128
}