{
  "game_id": "0021700286",
  "espn_id": "400975037",
  "date": "Nov 25, 2017",
  "matchup": "SAC vs. LAC",
  "headline": "Griffin's late jumper, 33 points lead Clippers over Kings",
  "body": "SACRAMENTO, Calif. -- Blake Griffin sent the Clippers home happy.\nGriffin made a 10-foot jumper with 3.2 seconds remaining and had a season-high 33 points to lead Los Angeles over the Sacramento Kings, 97-95 on Saturday night.\nThe Clippers squandered a 10-point, fourth-quarter lead, but Griffin gave them a second straight victory to end their five-game road trip.\n\"We'll take the wins however we can get them,\" said Griffin, who made 13 of 25 shots and added five assists. \"We can play with anyone, no matter how banged up we are.\"\nIt's been a difficult time for the Clippers in the post-Chris Paul era. After opening the season with four straight wins, injury-plagued LA has dropped 11 of 12 games before winning their last two.\nAfter Buddy Hield made consecutive 3-pointers to tie the game at 95, the Clippers called timeout and designed a play for their perennial All-Star forward.\nGriffin drove toward the basket, then pulled up for the jumper over Willie Cauley-Stein.\n\"It was the play we wanted, but it was too early,\" Clippers coach Doc Rivers said. \"But he knew he had to take the shot.\"\nOn their final possession, the Kings went to Hield, who had 16 points in the fourth quarter. But DeAndre Jordan forced him to penetrate instead of taking a 3-pointer. Hield's wild left-handed runner at the buzzer wasn't even close.\n\"He could have blocked it? I don't know. I just couldn't get my right hand over the ball,\" Hield said.\nLou Williams made four 3-poiners and had 18 points for the Clippers, who have beat the Kings 10 straight times in Sacramento. Austin Rivers added 14 points and Jordan had 16 rebounds.\nHield had career highs of seven 3-pointers and 35 points. Zach Randolph added 17 points and seven rebounds, and Bogdan Bogdanovic and George Hill each had 10 points.\nSacramento had won four of its previous five games at Golden 1 Arena and appeared to be headed for another win after leading by 18 points early in the third quarter.\nBut the Clippers ran off 17 unanswered points, including three consecutive 3-pointers by Williams.\n\"The first four minutes of the third quarter, all we did is take jump shots,\" Kings coach Dave Joeger said. \"We were less aggressive and they were the aggressors. They came out and made shots, made plays, and got loose balls. That's why they got ahead and we had to chase them at the end.\"\nBoth Williams and Griffin had 12 points in the third, when the Clippers outscored the Kings 29-10.\nTIP-INS\nClippers: Ex-Clipper Baron Davis was among the crowd. ... LA was again without injured starters Danilo Gallinari (sore hip) and Milos Teodosic (foot injury). Patrick Beverley underwent season-ending microfracture surgery on his right knee.\nKings: Sacramento shot 4 of 19 in the third quarter and had eight turnovers. They shot 58.5 percent in the first half. ... Rookie DeAaron Fox struggled, hitting 2 of 9 shots and finishing with four points and three assists.\nHIELD A SPARK OFF THE BENCH\nHield began the season as a starter, but has blossomed coming off the bench. He's a primary reason why the Kings second unit often outscores the starters. That was the case against the Clippers when the bench held a 51-44 edge.\n\"Buddy Hield is a scorer. We had trouble containing him. He does what he does,\" Rivers said.\n---\nUP NEXT\nClippers: Play the Lakers on Monday.\nKings: Visit Golden State on Monday.",
  "source": "espn_api",
  "crawled_at": 1764993286.3950348
}