{
  "game_id": "0021301059",
  "espn_id": "400489932",
  "date": "Mar 25, 2014",
  "matchup": "OKC @ DAL",
  "headline": "Dirk Nowitzki scores 32 as Mavs beat Thunder in overtime",
  "body": "DALLAS -- Dirk Nowitzki was frustrated by his poor shooting performance in Dallas' previous game. That disappointment, plus a little help from an old friend, turned into another big performance by the veteran forward.\nNowitzki scored seven of his 32 points in overtime, leading the Mavericks to a 128-119 victory over the Oklahoma City Thunder on Tuesday night.\nNowitzki also had 10 rebounds and six assists. In Dallas' loss to Brooklyn on Sunday, he was 2 for 12 from the field in his worst shooting performance of the season.\n\"The last game was disappointing for me,\" Nowitzki said. \"I was just hesitating too much, so I had to go back to having fun out there and just being me.\n\"That was a heck of a game, and it was fun to be a part of.\"\nThe 7-foot Nowitzki was 11 for 23 from the field and 8 for 8 at the line.\n\"His emotion and his attitude carried the team,\" Mavericks coach Rick Carlisle said. \"He's a prideful guy. I think great players are great for a reason. They never let anything keep them down for long. He's bounced back from every adversity he's ever had in his career, so this is no surprise.\"\nKevin Durant led Oklahoma City with 43 points. He has scored at least 25 in 36 consecutive games in the longest such streak since Michael Jordan's 40-game run during the 1986-87 season.\nDallas had seven players score in double figures. Jose Calderon went 6 for 8 from 3-point range and finished with 22 points.\nNowitzki said he spent time on Tuesday with Holger Geschwinder, his longtime basketball mentor from his home country of Germany. He said they got in a little shooting work.\n\"I guess he was tired of watching my shooting percentage,\" Nowitzki said. \"It's always good when he's there.\"\nRussell Westbrook scored 23 for Oklahoma City. All of his points came in regulation, when he played 31:50. He added another minute in overtime.\nWestbrook is limited to 30 to 32 minutes per game because of his oft-injured right knee.\nOklahoma City was coming off a 117-96 victory over Denver on Monday night. The Thunder had won four in a row.\n\"I'm proud of our guys' effort and energy, coming back from back-to-back games,\" coach Scott Brooks said. \"I can't complain about anything we did tonight.\"\n\"We didn't make the big play,\" said Durant, who has scored 40 points or more 13 times this season. \"They made shots in overtime. You have to give them credit.\"\nThe Mavericks scored the first five points of the extra period on two free throws by Nowitzki and a 3-pointer by Calderon. They never trailed again.\nThe victory pushed Dallas into eighth place in the Western Conference, a half-game ahead of idle Phoenix. The Mavericks improved to 3-2 on a franchise-long, eight-game homestand, with three of the games going to overtime. They began the homestand in seventh place, 1 1/2 ahead of the ninth-place Suns.\nCalderon returned to the starting lineup after being knocked out of Sunday night's game in the first minute. He was whacked in the face by Brooklyn's Mason Plumlee, chipping a facial bone between his nose and mouth.\nCalderon said the injury only hurts when he talks or laughs. \"And I don't have to laugh during games,\" he said.\nAnother of Calderon's 3s came with 26.3 seconds left in the fourth quarter and sent the game into overtime.\n\"It felt good from the beginning,\" he said, \"but you don't know until that ball goes through the rim.\"\nDallas won 109-86 at Oklahoma City on March 16 in the Thunder's worst loss of the season. Westbrook missed that game because the team wants to limit the activity for his surgically repaired knee, choosing to rest him in one part of back-to-back games.\nWestbrook was the catalyst of Oklahoma City's second-quarter rally after the Thunder fell behind by 10. He scored 10 points in the period, including a foul shot that gave Oklahoma City a 57-48 lead with 1:25 to go.\nBut the Mavericks answered with three consecutive 3-pointers -- one from Calderon and two from Vince Carter -- to tie it with 33.4 left in the half. Durant then hit a 3 to give Oklahoma City a 60-59 lead at the break.\nThe Thunder hit 14 of 18 shots in the period and shot 57.1 percent for the half.\nGame notes\nThunder center Kendrick Perkins, sidelined since Feb. 20 with a groin strain, is hoping to return at Houston on April 4. ... If Dallas finishes among the league's top-10 teams, Oklahoma City will get the Mavericks' first-round draft choice next summer as a result of a series of trades.",
  "source": "espn_api",
  "crawled_at": 1764992834.204115
}