{
  "game_id": "0022201058",
  "espn_id": "401469213",
  "date": "Mar 18, 2023",
  "matchup": "TOR vs. MIN",
  "headline": "Raptors win 7th straight at home, beat Timberwolves 122-107",
  "body": "TORONTO -- — Pascal Siakam had 27 points and 10 rebounds and the Toronto Raptors extended their season-high home winning streak to seven by beating the Minnesota Timberwolves 122-107 on Saturday night.\n\n\r\n              Jakob Poeltl had 14 points and 11 rebounds, matching his career high with his fourth straight double-double, to help the Raptors improve to 24-4 all-time in home meetings with Minnesota.\n\n\r\n              Fred VanVleet scored 28 points for Toronto, while Gary Trent Jr. added 19, O.G. Aunoby 15 and Scottie Barnes 10.\n\n\r\n              Rudy Gobert had 14 points and 12 rebounds and Naz Reid scored 22 points for the Timberwolves, who were playing the second game of a back-to-back. Minnesota lost in double overtime at Chicago on Friday, and didn’t arrive at its Toronto hotel until 5 a.m. Saturday.\n\n\r\n              “A lot of adversity for us, but we came out and we tried to compete to try to win the game,” Gobert said. “Obviously, Toronto is a very physical team. They kind of wore us down throughout the whole game. At the end, we just ran out of gas.”\n\n\r\n              The Wolves played without guard Anthony Edwards, who left in the first quarter Friday because of a sprained right ankle. Coach Chris Finch said Edwards is using a walking boot, adding there’s no timetable for his return.\n\n\r\n              A first–time All-Star this season, Edwards was injured when he landed awkwardly after jumping while throwing a pass.\n\n\r\n              Jaden McDaniels scored 18 points as the slumping Wolves lost their third straight and fifth in six.\n\n\r\n              “We’ve got to keep our heads up, we’ve got to keep fighting,” Finch said. “We’ve got to stay positive right now. That’s all we can do.”\n\n\r\n              Minnesota has lost 18 straight in Toronto. The Timberwolves last won north of the border on Jan. 21, 2004, when Sam Cassell, Kevin Garnett and Latrell Sprewell were the Wolves’ leading scorers in a 108-97 victory.\n\n\r\n              Toronto’s only home loss in the series since was a 116-112 defeat on Feb. 14, 2021, when the Raptors were playing in Tampa, Florida, because of border restrictions related to the COVID-19 pandemic.\n\n\r\n              Siakam made just one of six from 3-point range Saturday, but shot 10 for 16 inside the arc.\n\n\r\n              “He’s had a couple of games in a row now where we’ve seen a lot of variety in what he’s doing,” Raptors coach Nick Nurse said. “That, to me, is his recipe for having a good night.”\n\n\r\n              Toronto led 32-26 after one and 66-58 at halftime.\n\n\r\n              Reid’s basket with 4:16 left in the third gave Minnesota its first lead since the opening minutes of game but the Raptors closed the period with an 11-2 run to take a 94-85 lead to the fourth.\n\n\r\n              “We didn’t do a great job of managing the end of any quarter tonight,” Finch said.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Mike Conley and Kyle Anderson each scored 12 points. ... Minnesota is 15-20 on the road.\n\n\r\n              Raptors: C Christian Koloko wore a protective face mask after fracturing his nose in Thursday’s win over Oklahoma City. … Toronto is 23-13 at home.\n\n\r\n              OUT OF RANGE \n\n\r\n              Minnesota shot 5 for 23 from 3-point range. McDaniels went 4 for 6, but the rest of the team was 1 for 17.\n\n\r\n              “We had a lot of really good, wide-open looks,” Finch said. “We needed those 3s to go in tonight. We made the right play, they didn’t go in.”\n\n\r\n              FAMILY MATTERS\n\n\r\n              Gary Trent Sr. played three minutes off the bench for Minnesota the last time they beat the Raptors in Toronto. His son played 29 minutes off the bench for the Raptors on Saturday.\n\n\r\n              LOCAL HERO?\n\n\r\n              While trying to honor Toronto-born Nickeil Alexander-Walker during a second quarter timeout, the arena PA announcer read a message mistakenly referring to the Minnesota guard as Nickeil Walker-Alexander. The incorrect name was also briefly displayed on the video screen.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit New York on Monday.\n\n\r\n              Raptors: Visit Milwaukee on Sunday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994018.7955992
}