{
  "game_id": "0021500930",
  "espn_id": "400828817",
  "date": "Mar 06, 2016",
  "matchup": "MIL vs. OKC",
  "headline": "Durant, Westbrook help Thunder hold off Bucks 104-96",
  "body": "MILWAUKEE -- Someday, the Milwaukee Bucks might have a dynamic playmaking duo to rival Oklahoma City's 1-2 punch of Kevin Durant and Russell Westbrook.\nFor now, Milwaukee's Jabari Parker and Giannis Antetokounmpo can watch and learn from the Thunder's fearsome twosome.\nDurant had 32 points and 12 rebounds, Russell Westbrook posted his 10th triple-double of the season and the Thunder built a big early lead before holding on for a 104-96 victory on Sunday.\n\"We had a couple of lulls in the game here and there, but for the most part we were solid all night. They didn't get nothing easy,\" Durant said.\nWestbrook finished with 15 points, 10 rebounds and 11 assists for the Thunder, who led by 21 with 6 minutes left in the third quarter before nearly getting overrun by the Bucks.\nAntetokounmpo picked up his third triple-double of the season with 26 points, 12 rebounds and 10 assists. Parker had 26 points and shot 12 of 23 from the field.\nParker and Antetokounmpo form the frontcourt core of the young Bucks. Durant and Westbrook are one of the top veteran forward-guard combos in the league.\nWhile they don't play the exact same positions, all four players can fill up the stat sheet.\n\"When you look at Oklahoma City, they're veteran guys who have gone through the process that Giannis and Jabari are going through,\" coach Jason Kidd said. \"We can take that path because those two are both pretty talented. I think Giannis and Jabari can do that.\"\nKhris Middleton scored 18 points, including 10 straight during a 24-5 run between the third and fourth quarters that drew the Bucks within 84-82 with 11:23 left.\nBut Oklahoma City withstood the Bucks from there, holding Milwaukee without a field goal for about a 7-minute stretch of the fourth quarter.\nBUCKS COMEBACK\nIt was a feat for the Bucks to just make it that close again after falling behind 32-12 following a poor-shooting first quarter.\nThe Bucks went just 3 of 23 from the field over the opening 12 minutes. Some fans booed their hometown team after one timeout.\nOne of the biggest cheers during the first half was reserved for Houston Texans star and former Wisconsin defensive lineman J.J. Watt, a Milwaukee-area native who had a baseline seat in the front row.\nThen the Bucks' energy picked up in the third quarter.\nMiddleton was an instigator, hitting two 3s during the run and converting a steal off Durant for a layup near the end of the third quarter that had fans at the Bradley Center buzzing.\nThe Thunder took momentum back with defense in the fourth quarter, a welcome change after getting outscored by double digits in the fourth quarters of their previous two games.\n\"They made a lot of good plays. We just couldn't stop them, especially in the fourth,\" Parker said.\nDIFFERENT FIRST\nThe Thunder built a 20-point lead in the first quarter with Westbrook and Durant combining for just one shot -- a miss -- but 11 assists. Durant said it was part of a concerted effort to keep teammates involved.\n\"I'm not so sure that would always be the best thing for our team. We need them to be aggressive, but when those guys do that stuff, it really opens up,\" Donovan said.\nSTAT LINE\nOklahoma City won despite coughing up 21 turnovers to just 10 for Milwaukee.\nTIP-INS\nThunder: Durant had five turnovers on Sunday after finishing with 15 overall in his previous two games, including nine in a loss to the Warriors on Thursday. ... Enes Kanter finished with 18 points and 12 rebounds. ... The Thunder are 10-0 this season when Westbrook gets a triple-double and 25-4 all-time.\nBucks: F John Henson missed his 16th straight game with a sore lower back. Kidd said Henson did take a positive step after the forward played some 3-on-3 and took part in some drills in practice on Saturday. ... G Michael Carter-Williams missed his fourth straight game. The team added a sore left hip to the injury report for Carter-Williams on Friday, to go with left knee tendinitis. ... Antetokounmpo became the first Milwaukee player to have three triple-doubles in a season since Alvin Robertson in 1990-91.\nUP NEXT\nThunder: Host the Los Angeles Clippers on Wednesday.\nBucks: Visit the Chicago Bulls on Monday.\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764994021.3595352
}