{
  "game_id": "0022001033",
  "espn_id": "401307842",
  "date": "May 11, 2021",
  "matchup": "DET vs. MIN",
  "headline": "Towns, Edwards lead Timberwolves past undermanned Pistons",
  "body": "DETROIT -- — Karl-Anthony Towns scored 28 points and Anthony Edwards added 22 as the Minnesota Timberwolves beat the undermanned Detroit Pistons 119-100 on Tuesday night in a game with significant lottery implications.\n\n\r\n                    “I thought we did a professional job out there tonight,” Timberwolves coach Chris Finch said. “There were a couple times where we lost focus, but we kept things going and got the job done.”\n\n\r\n                    Minnesota's second straight win was its 22nd in 69 games, while the Pistons dropped to 20-50. The Houston Rockets (16-53) are the only team with fewer wins than Detroit. There are three teams -- the Oklahoma City Thunder, the Orlando Magic and the Cleveland Cavaliers -- with 21 wins.\n\n\r\n                    Ricky Rubio added 19 points for Minnesota while DeAngelo Russell had 15 points and 10 assists.\n\n\r\n                    “I think our defense was probably better than our offense,” Finch said. “We found a way to turn them over and turn it into points. In our halfcourt offense, we were overcomplicating things by trying too hard to move the ball.”\n\n\r\n                    Saddiq Bey scored 21 points and Saben Lee added 20 for Detroit, which lost for the 10th time in 12 games. The Pistons turned the ball over a season-high 28 times, leading to 34 Minnesota points.\n\n\r\n                    “You can't win a basketball game when you turn the ball over 28 times,” Bey said. “It doesn't matter what else you are doing, that's going to cost you the game.”\n\n\r\n                    Pistons coach Dwane Casey had nine players dressed, including six rookies and they struggled badly on offense. Detroit shot 34.3% in the first half and turned the ball over 15 times for 16 Minnesota points.\n\n\r\n                    The Timberwolves led 62-40 at the start of the second half, but the Pistons scored the first 12 points of the third quarter to make it a 10-point game. Minnesota, though, took advantage of more Detroit turnovers to go on an 8-0 run of their own to move the score to 70-52.\n\n\r\n                    “I think Minnesota is 30th in the league in defense or something like that, but they are long and mobile,” Casey said. “We knew that if we took care of the ball and made a few passes, we could get a good shot, but we were throwing it away and giving them free points.”\n\n\r\n                    The margin was 86-65 at the period's end, and Detroit never threatened in a low-intensity fourth quarter.\n\n\r\n                    “When you are playing any NBA team, you can do yourself a lot of good by getting out to an early lead,” Towns said. “When you start the game playing well, it is easier to keep that going. We were a little sluggish at the start of the second half, but we finished it out.”\n\n\r\n                    TIP INS\n\n\r\n                    Timberwolves: Minnesota's starters scored 73 of its 86 points in the first three quarters, including 22 of 24 in the third quarter.\n\n\r\n                    Pistons: Point guards Killian Hayes and Lee only committed one of Detroit's 16 turnovers in the first half. Shooting guard Josh Jackson had seven in the half and finished with nine.\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: Host the Denver Nuggets on Thursday.\n\n\r\n                    Pistons: Host the Denver Nuggets on Friday.",
  "source": "espn_api",
  "crawled_at": 1764997897.757076
}