{
  "game_id": "0021800660",
  "espn_id": "401071336",
  "date": "Jan 16, 2019",
  "matchup": "MIL @ MEM",
  "headline": "Antetokounmpo leads streaking Bucks past Grizzlies 111-101",
  "body": "MEMPHIS, Tenn. --  The Milwaukee Bucks are doing more than just winning. They are dominating opponents.\n\nThe Bucks won their third straight game and 14th of the last 17 Wednesday night with a 111-101 victory over the Memphis Grizzlies.\n\nThe victory marked the 23rd time the Bucks have won by double-digits and they entered the game with a 16.2-point winning margin in their previous 13 victories.\n\nWednesday's win over Memphis would have added to that point differential, if not for a closing run by the Grizzlies. Milwaukee led by 31 in the fourth quarter with about 8 minutes left.\n\nGiannis Antetokounmpo led the Bucks with 27 points and 11 rebounds, while Eric Bledsoe had 16 points, 12 of which came during a momentum-swinging third quarter.\n\nMemphis had pulled ahead 59-58 for its only lead of the game and Antetokounmpo was headed to the bench with his fourth foul, a situation that should have meant advantage Grizzlies.\n\nInstead, Bledsoe scored nine straight points, part of the Bucks reeling off a 19-0 run to end of any Memphis hopes.\n\n\"Eric Bledsoe was phenomenal. He really changed the game,\" Milwaukee coach Mike Budenholzer said, later adding: \"We needed him. We needed someone to step up and have a game like that.\"\n\nThe Memphis situation is entirely different from the Bucks. The Grizzlies lost their third straight and are 7-20 since starting the season 12-5. And that third quarter in which the Bucks took over the game was the latest nightmare for the Grizzlies.\n\nThe 19-0 Milwaukee burst led to the Bucks outscoring Memphis 41-28 in the frame. And Memphis coach J.B. Bickerstaff continued to repeat the key stat in his postgame comments -- eight turnovers for 20 Milwaukee points in the third.\n\n\"It's pretty simple,\" Bickerstaff said. \"Unforced turnovers, live ball turnovers at the top of the floor that lead to transition dunks, easy baskets.\"\n\nThe Memphis reserves played better than the starters, with Omri Casspi leading the Grizzlies with 17 points, JaMychal Green added 14 points, along with 10 rebounds and three blocks. Mike Conley and Marc Gasol also scored 14 points each for Memphis.\n\nAnd the Memphis miseries are leading to frustration for the Grizzlies.\n\n\"We've lost 10, lost 11, so we've got to take a stance as a team and we've got to stop this slide,\" Casspi said. \"It's been like that for a while, so enough talking. We've got to do more on the court.\"\n\nTIP-INS\n\nBucks: Milwaukee leads the series 23-22. . Antetokounmpo recorded his 30th double-double of the season. . Memphis defeated the Bucks 116-113 on Nov. 14. Milwaukee is now 5-0 facing teams that it lost to in its previous meeting. ... Milwaukee made 23 of 44 shots in the second half, including 9 of 20 from outside the arc.\n\nGrizzlies: Memphis played its only home game in a five-game stretch. . Memphis missed 10 of its first 11 shots in the game, part of the Grizzlies shooting 26 percent in the opening quarter. . The Bucks' 41 points in the third quarter was the most given up by Memphis in any period this season. ... .JaMychal Green recorded his fifth double-double of the season.\n\nNEXT STARTER\n\nAs Bickerstaff tries to find some combination to get a boost for his team, he inserted Justin Holiday into the starting lineup. Holiday, obtained from the Chicago Bulls in a Jan. 4 trade, lasted about four minutes before he picked up his second foul and didn't re-enter the game until the second half. \"We need him to play well,\" Bickerstaff said. \"We need him to be comfortable so that he can contribute at the level that we think we can.\" Holiday finished with five points, including making his first 3-pointer for Memphis.\n\nVIEW FROM THE BENCH\n\nAntetokounmpo got an observer's view of the run by the Bucks as he had just left the game with four fouls when the Bucks clicked off the 19-0 rally. \"(It was) our pace,\" he said of the run. \"We were able to get in passing lanes, get some deflections. We made them turn the ball over and we were able to run, create threes, easy looks, easy layups.\n\n\"I think Bledsoe did a good job of setting the tone and everybody else followed.\"\n\nUP NEXT\n\nBucks:  At Orlando to face the Magic on Saturday\n\nGrizzlies: Face the Celtics in Boston on Friday\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994485.979824
}