{
  "game_id": "0022200617",
  "espn_id": "401468772",
  "date": "Jan 10, 2023",
  "matchup": "LAC vs. DAL",
  "headline": "Leonard, Clippers hold off Doncic, Mavs to snap 6-game skid",
  "body": "LOS ANGELES -- — Kawhi Leonard scored a season-high 33 points, Norman Powell added 27 and the Los Angeles Clippers snapped a six-game losing streak Tuesday night with a 113-101 victory over the Dallas Mavericks despite 43 points from Luka Doncic.\n\n\r\n              It's the fourth time in the past five games Leonard has scored at least 24. \n\n\r\n              “I thought it was a good game for us with the way we competed and scrapped for 48 minutes,” Clippers coach Tyronn Lue said. “And then Kawhi controlling the whole game and being very efficient with 33 points on 12 shots.”\n\n\r\n              Leonard, who missed last season due to a knee injury, also seems to be getting more of his stamina back. This marked the first time he played at least 36 minutes in consecutive games.\n\n\r\n              Leonard got off to a quick start with 11 points in the first quarter as the Clippers led throughout.\n\n\r\n              “I got in a rhythm, knocked down open shots, trusted in my teammates and we were able to pull it out,” Leonard said.\n\n\r\n              Doncic, who sat out Sunday against Oklahoma City due to left ankle soreness, missed four of his first five shots and had 12 points on 3-of-9 shooting in the first half before getting hot.\n\n\r\n              The NBA's leading scorer had 20 points in the fourth quarter and got the Mavericks within 104-96 on a 3-pointer with 2:50 remaining, but Leonard answered with a 3 of his own after grabbing an offensive rebound to push the margin back to double digits.\n\n\r\n              “We had to box out but we were small trying to get the rebounds on loose balls. That was a big miss but Kawhi was in the right place at the right time and made the 3,” Dallas coach Jason Kidd said.\n\n\r\n              Doncic responded with another jumper from beyond the arc before Leonard was fouled on a 3-point attempt from the corner. Leonard hit all three free throws to make it 110-99 with 1:40 remaining.\n\n\r\n              “That was huge for us. I thought Kawhi did a good job with those two shots to seal the game,” Lue said.\n\n\r\n              It was the ninth time in 27 regular-season and playoff games that Doncic has scored 40 points against the Clippers. Doncic also had 11 rebounds for his ninth double-double against Los Angeles. \n\n\r\n              “We lost to them, I don’t know if it was a big night,” Doncic said. “We played good defense in the second half but it wasn't there in the first.”\n\n\r\n              The Clippers had a 35-33 lead in the second quarter before going on a 27-9 run over a seven-minute span as Powell led the way with 11 points.\n\n\r\n              Los Angeles went into halftime with its largest lead of the game at 69-47.\n\n\r\n              “Energy and effort wasn’t there in that first half. In the second half we were better being able to execute,\" Kidd said. \"When we don’t score it really affects our defense and you saw that in the first half.”\n\n\r\n              SCARY MOMENT\n\n\r\n              Midway through the third quarter, Doncic got bumped while chasing a loose ball, lost his balance and did a somersault over the first row of courtside seats before he landed on his shoulder. He quickly returned to the court.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Tim Hardaway Jr. scored 16 points and Spencer Dinwiddie added 13. ... Dwight Powell bruised his right hip during the first half and did not return.\n\n\r\n              Clippers: Terance Mann added 12 points. ... Leonard tied a season high in rebounds with nine. ... Marcus Morris Sr. scored 10 of his 12 points in the first quarter. ... Ivica Zubac (eight points) ended up playing only 15 minutes after he picked up his third foul with 7:23 remaining in the first quarter. \n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Remain in Los Angeles to face the Lakers on Thursday.\n\n\r\n              Clippers: Host the Denver Nuggets on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994974.577379
}