{
  "game_id": "0021901234",
  "espn_id": "401224689",
  "date": "Jul 31, 2020",
  "matchup": "MEM @ POR",
  "headline": "McCollum, Lillard help Blazers get past Memphis in OT",
  "body": "LAKE BUENA VISTA, Fla. --  CJ McCollum scored 33 points, teaming with Damian Lillard for 11 of Portland's 16 in overtime, and the Trail Blazers pulled out a desperately needed victory to resume their season by beating the Memphis Grizzlies 140-135 on Friday.\n\nLillard finished with 29 points and nine assists as the Trail Blazers boosted their hopes for a seventh consecutive playoff appearance. Carmelo Anthony added 21 points as Portland moved within 2 1/2 games of the Grizzlies for the No. 8 spot in the Western Conference.\n\n\"Everybody knew how important that game was,\" Blazers coach Terry Stotts said. \"This is playoff basketball from us and we have that pressure and you can't shy away from it.\"\n\nMcCollum started fast, scoring 19 points in the first half, and finished strong with two crucial 3-pointers in overtime. The first one to open the extra period gave Portland the lead for good, and he added six assists.\n\nJaren Jackson Jr. had 33 points and rookie Ja Morant added 22 points and 11 assists for Memphis.\n\nIt certainly wasn't pretty. Portland was called for 36 fouls, sending Memphis to the free throw line 50 times. The Grizzlies drew 26 fouls and the teams combined for five technical fouls.\n\nBut it was a wild start to their resumption of the NBA season.\n\n\"It was a weird game,\" McCollum said. \"But all in all, all we need is wins. We need to get as many wins as we can and get out of here.\"\n\nMemphis rallied from a 13-point, third-quarter deficit to take an 11-point lead, then gave it away almost as quickly. When the Grizzlies recovered to take a 112-103 lead with 6:01 left in regulation, it appeared the Grizzlies might pad their lead in the standings.\n\nInstead, Anthony's 3 with 37.5 seconds left tied the score at 124 and Morant fell on a last-second fast break, sending the game to overtime.\n\nAfter McCollum broke the tie with the opening 3, Gary Trent Jr. and McCollum followed with two more 3s to make it 135-124 and the Grizzlies couldn't get closer than three the rest of the game.\n\n\"Win or lose, we've got to keep focused on the next task at hand,\" Memphis coach Taylor Jenkins said. \"That was a challenge. It was a heck of a game.\"\n\nTIP-INS\n\nGrizzlies: Have tied the single-season franchise record with five games of 130 or more points. The mark was previously set in 2006-07. ... Morant made only one basket in the first half. ... Brandon Clarke added 21 points and Dillon Brooks had 15. ... Memphis is 0-28 when shooting worse than its opponent this season.\n\nTrail Blazers: Evened the season series with the Grizzlies. ... Hassan Whiteside's streak of 14 consecutive double-doubles ended. The league's No. 2 rebounder scored seven points and grabbed four rebounds. ... McCollum made three 3s to give him 1,000 in his career, joining Lillard as the only players in franchise history to hit that mark. ... Anthony had his 768th career 20-point game. He needs three to tie Wilt Chamberlain for No. 8 all-time.\n\nTHEY'RE BACK\n\nThe suspended season gave Portland a chance to get healthy and plug two injured starters back into the lineup -- Jusuf Nurkic and Zach Collins.\n\nIt made a huge difference.\n\nCollins had been out since late October with an injured left shoulder. He had seven points and nine rebounds.\n\nNurkic made his season debut and his first regular-season appearance since suffering a gruesome left leg injury March 25, 2019. Despite shooting just 5 of 11 from the field, he had 18 points, nine rebounds and matched his career high with six blocks as he played with a heavy heart.\n\nFollowing the game, he told reporters his grandmother had contracted COVID-19 and was in a coma.\n\n\"The last couple days have been some of the hardest days of my life,\" he said. \"Please take care of yourself and wear the damn mask.\"\n\nQUOTE OF THE DAY\n\n\"We've just got to be smarter, don't use your hands, know what the refs' tendencies are to call,\" Morant said. \"You have to study that a little bit and don't do the little things wrong. You just can't get away with it. Got to be smarter.\"\n\nUP NEXT\n\nGrizzlies: Continue their playoff quest with another crucial game Sunday against San Antonio.\n\nTrail Blazers: Hope to avoid a season sweep Sunday against Boston.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995678.219381
}