{
  "game_id": "0021600532",
  "espn_id": "400899953",
  "date": "Jan 04, 2017",
  "matchup": "CHI @ CLE",
  "headline": "Butler's big fourth leads Bulls to win over depleted Cavs",
  "body": "CLEVELAND -- LeBron James was reminded what it's like to be Cleveland's only star.\nLonesome and no fun.\nJimmy Butler took over in the fourth quarter, scoring 10 straight points during a critical stretch and leading the Chicago Bulls to a 106-94 win Wednesday night over the Cavaliers, who had a less-than-100 percent James and were without Kyrie Irving and Kevin Love.\nButler, who was coming off a 52-point game against Charlotte, scored 14 of his 20 points in the fourth as the Bulls held off Cleveland's rally and ended the Cavs' 13-game winning streak with James in the lineup.\nButler said Dwyane Wade, who returned to his hometown this summer, encouraged his new teammate to take control.\n\"The guy who wears No. 3 on this team came to me and was like, `Win the game,\" Butler said. \"So I guess a switch cut on. I knew I was going to have to do that in the fourth anyway, but with him telling me that, you can't let D-Wade down.\n\"He's been doing it for years. It was my time to step up.\"\nJames, who has been battling a head cold for several days, was questionable until about 20 minutes before the game, when the Cavs announced he would be the one -- and only -- member of Cleveland's \"Big 3\" in uniform. He finished with 31 points, eight rebounds and seven assists in 37 minutes.\nJames was forced to go it alone as Irving missed his third straight game with a hamstring issue that appears to be more serious than first diagnosed and Love is still recovering from a nasty case of food poisoning.\nJames said there was never any question he would play.\n\"If I can walk, I can go,\" he said, \"unless coach tells me to sit down. My plan was to play.\"\nBut without Irving and Love, the Cavs didn't have enough firepower to slow the Bulls, who got 17 points from Doug McDermott and made a season-high 13 3-pointers.\nThe Bulls made just 1 of 8 3s in the first quarter before finding their range. They dropped 11 of their next 14 and built a 15-point lead when James went to the bench with 3:30 left in the third quarter.\nBut Cleveland's reserves cut Chicago's lead to four when James returned with 8:49 remaining. He made two straight layups to pull the Cavs within 89-88 and was driving for the go-ahead bucket when Butler stepped in front of him in the lane and drew a charge.\n\"He's coming at you full speed, that's the right play to make,\" Butler said. \"It could go either way, obviously. You've got to brace yourself. I got all my pads here somewhere. We've got all of that for a reason.\"\nJames didn't argue about the foul.\n\"It was a good call,\" James said.\nButler then hit a 3-pointer on the next possession, and Cleveland never got closer than eight and had its home winning streak ended at nine.\nROAD AHEAD\nThe Cavs are set to embark on a season-long, six-game road trip. James was asked if it's coming at a good time with the injury and illnesses.\n\"I don't know until we know who's active,\" he said. \"I don't know if it's going to be a good time or not until we know who's active and who's playing. See what happens.\"\nWADE'S KNEE\nWade scored 10 points in 27 minutes after missing Monday's game with a swollen left knee. He said it feels better but the team will monitor him closely.\n\"This is a grueling month,\" Wade said. \"We have four back-to-backs. We want to play it smart, find gaps, find days to get through it.\"\nTIP-INS\nBulls: Starting PG Rajon Rondo didn't play for the third straight game amid talk that he could be traded. ... Chicago came in leading the league with 13.7 offensive rebounds and grabbed 12.\nCavaliers: Cleveland fell to 18-3 at home. ... James played in his 724th game with Cleveland, passing Danny Ferry (723) for the second most in franchise history. Zydrunas Ilgauskas (771) is the career club leader. ... Love received several IVs during his recovery from food poisoning, which the team said came from eating sea bass on New Year's Eve. Lue said the forward lost 10 pounds and had not gotten his strength back. \"He couldn't keep food down,\" Lue said, adding Cleveland's training staff felt he needed another day to recuperate. ... Even before the flu bug bit Cleveland, the Cavs were already without J.R. Smith (thumb surgery) and Chris Andersen (ACL tear). ... Indians free agent prize Edwin Encarnacion received a loud ovation when he was introduced during the first quarter.\nUP NEXT\nBulls: Host Toronto on Saturday. Chicago has won nine straight over the Raptors.\nCavaliers: Begin the season's longest road trip at Brooklyn on Friday before a five-game swing out West, which concludes with a Jan. 16 matchup at Golden State.",
  "source": "espn_api",
  "crawled_at": 1764995062.077587
}