{
  "game_id": "0022400520",
  "espn_id": "401705086",
  "date": "Jan 09, 2025",
  "matchup": "HOU @ MEM",
  "headline": "Sengun has 32 points and 14 rebounds as the Rockets beat the Grizzlies 119-115 in Morant's return",
  "body": "MEMPHIS, Tenn. -- — Alperen Sengun had 32 points and 14 rebounds, and the Houston Rockets held on to beat the Memphis Grizzlies 119-115 on Thursday night in a showdown between two of the top teams in the Western Conference.\n\n\r\n              Jalen Green finished with 27 points and Fred VanVleet scored 22 as the Rockets won their third straight and solidified their hold on second place in the Western Conference, moving 1 1/2 games ahead of Memphis.\n\n\r\n              Ja Morant scored 27 points in his return from a five-game absence with a shoulder injury, and Jaren Jackson Jr. added 21 points, eight rebounds and six blocks for Memphis. Desmond Bane had 16 points.\n\n\r\n              Houston dominated the inside early, scoring 20 points in the paint before the halfway point of the first quarter. Memphis initially couldn't stop anything at the rim. Houston opened a 17-point lead before taking a 68-63 advantage at the break.\n\n\r\n              Takeaways\r\n              Rockets: Houston is 12-5 on the road, including six straight wins away from home.\n\n\r\n              Grizzlies: After allowing the Rockets to score inside and build a big lead, Memphis chipped into the advantage to make it a more competitive game. \n\n\r\n              Key moment\r\n              With 3.8 seconds left in the game and Houston leading 117-114, Bane fired up a 3-pointer that rattled in. But Memphis coach Taylor Jenkins called timeout before the shot was made. Bane was fouled on the ensuing inbounds, and Memphis wouldn't get another chance for a winning shot.\n\n\r\n              Key stat\r\n              Houston is 19-3 when score at least 110. Houston hasn't allowed more than 115 points in past 15 games.\n\n\r\n              Up next\r\n              The Rockets are at Atlanta on Saturday. Memphis travels to Minnesota to face the Timberwolves on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997388.324379
}