{
  "game_id": "0021800465",
  "espn_id": "401071146",
  "date": "Dec 19, 2018",
  "matchup": "MEM @ POR",
  "headline": "Lillard scores 24, Blazers down the Grizzlies 99-92",
  "body": "PORTLAND, Ore. --  The Trail Blazers' bench is proving to be difficult to stop when all five players come together.\n\nPortland's reserves were key in the team's 99-92 victory over the Grizzlies on Wednesday night, outscoring the Memphis bench 44-14.\n\n\"It's great when guys are getting open, everybody's setting screens and being unselfish, looking for guys and not looking for their own shot, not looking to go one-on-one the whole time. It's contagious and everyone loves playing like that,\" forward Zach Collins said.\n\nIt was the second time in the past week that Portland's bench has been instrumental in a victory. The reserves outscored their counterparts for Toronto 58-26 in a 128-122 victory over the Raptors last Friday night.\n\n\"It was good to see them play well, play with confidence,\" coach Terry Stotts said. \"They moved the ball well, played with a lot of energy. They were the difference in the game just like they were a few nights ago.\"\n\nDamian Lillard led the Blazers with 24 points, including 15 in the third quarter. Meyers Leonard combined for 12 points and eight rebounds.\n\n\"I just know we played hard, we played together and we're playing well right now,\" Leonard said of the second unit. \"So we just have to continue to do what we're doing.\"\n\nPortland went on an 11-0 run to start the fourth quarter and stretched its lead to 85-71 on Collins' layup and Seth Curry's 3-pointer. The Blazers led by as many as 16 points in the period.\n\nMemphis closed within 99-92 after Marc Gasol's free throws with 45.5 seconds left, but couldn't catch up for their fourth straight loss. The Grizzlies were led by Mike Conley with 23 points.\n\n\"Sometimes teams just go through lulls like this,\" Conley said. \"You hit spells where you seem to rattle in and out every open look you get.\"\n\nMemphis was coming off a 110-93 loss Monday at the Golden State Warriors, the first of a four-game road swing.\n\nGrizzlies coach J.B. Bickerstaff said before the game that center Joakim Noah would not play because of an Achilles injury. But Conley, who missed the game against the Warriors because of hamstring soreness, started.\n\nThe Grizzlies got off to a fast start, going up 17-8 at the start and capitalizing on six Portland turnovers. Portland closed the gap and tied it at 17 on Meyers Leonard's 3-pointer before the end of the first quarter. Evan Turner's pullup jumper gave Portland a 19-18 lead early in the second, and Grizzlies weren't able to re-take the lead until Jaren Jackson's driving layup made it 35-34.\n\nConley made consecutive 3-pointers and the Grizzlies led 52-47 at the half. He led all scorers with 15 points.\n\nAfter a slow start in the first half, Lillard hit four 3-pointers and 15 points in the third quarter. Leonard's 3-pointer put Portland in front 74-67.\n\n\"That second unit came in the third and early fourth and really gave them a great spark,\" Conley said. \"They play with a lot of energy and do a lot of things with great force and force you to guess both sides of the court and that's a tough thing to do.\"\n\nThe Blazers were coming off a 131-127 victory on the road against the Clippers. Lillard had 22 points in the third quarter and Portland snapped a six-game losing streak on the road.\n\nTIP INS\n\nGrizzlies: Bickerstaff said the Grizzlies missed Dillon Brooks, who missed his 20th game because of a right knee injury. Brooks, who played for the Oregon Ducks, is in his second NBA season. \"We miss the tenacity that he plays with. The toughness. A never-given-in attitude,\" Bickerstaff said before the game.\n\nTrail Blazers: Lillard was just 2 of 7 from the field in the first half. ... Every Blazer who played scored. ... Portland had 21 turnovers. ... It was the fourth straight win at home for Portland, matching the team's season high.\n\nPUT IT IN THE BOOK: The win came in Lillard's 500th career game. He has scored 11,685 points, had 1,365 3-pointers and 3,113 assists.\n\nSEARCHING FOR ANSWERS: \"Were going through a rough patch right now. In the NBA it happens. Our responsibility is to come up with the best way to get out of it. Everybody in that locker room has to participate in our own rescue. That's what we're gonna do. We're not gonna quit, we're not gonna back down. This group is going to continue to compete. We've just got to find our mojo,\" Bickerstaff said after the loss.\n\nUP NEXT\n\nGrizzlies: Memphis continues its road trip at Sacramento on Friday.\n\nTrail Blazers: Portland hosts Utah on Friday.\n\n---\n\nMore AP NBA: www.apnews.com/nba and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994929.630026
}