{
  "game_id": "0022000837",
  "espn_id": "401307633",
  "date": "Apr 14, 2021",
  "matchup": "MEM vs. DAL",
  "headline": "Doncic's 3 at buzzer leads Mavericks past Grizzlies 114-113",
  "body": "MEMPHIS, Tenn. -- — Luka Doncic hit a leaning, lunging 3-pointer as time expired to give the Dallas Mavericks a 114-113 victory over the Memphis Grizzlies on Wednesday night.\n\n\r\n                    Doncic ended the night with 29 points, while Kristaps Porzingis added 21 points. Dwight Powell had 12 points, shooting 6 of 7 from the field.\n\n\r\n                    But it was Doncic’s winning shot, falling down just beyond the 3-point line, that sent the Mavericks sprinting down the court as Doncic raised his arms and smiled. Officials reviewed the play, confirming the 3-pointer for Dallas' win rather than sending the game to overtime.\n\n\r\n                    “Honestly, I don’t remember,” Doncic said when asked if he got a good look at the rim. “I was kind of falling down. It’s kind of lucky, but we’ll take it.”\n\n\r\n                    Mavericks coach Rick Carlisle could only express amazement at the ending of a game that was close between two teams jockeying for postseason positioning.\n\n\r\n                    “It certainly was quite a game,” Carlisle said. “A lot of ups and downs. The last play was amazing. You look at the last minute or so. In those situations, you pull off a miracle in a game like that once in a blue moon. It just doesn’t happen very often.”\n\n\r\n                    Grayson Allen led the Grizzlies with 23 points, including matching his career-best with six 3-pointers. But the 90.6% free throw shooter missed a pair of foul shots with 2.2 second left, setting the stage for Doncic’s winning basket.\n\n\r\n                    Powell grabbed the rebound on Allen's second miss, and the Mavericks called timeout with 1.8 seconds remaining. On the ensuing inbounds play, Doncic split Memphis defenders Jonas Valanciunas and Dillon Brooks, began stumbling behind the 3-point line and flipped up the shot that swished through the net.\n\n\r\n                    “It came down to one great shot at the end by him,” Memphis coach Taylor Jenkins said.\n\n\r\n                    The Mavericks, sitting in seventh place in the West, gave themselves a bit of a buffer with the victory – extending their advantage to 2 1/2 games over the eighth-place Grizzlies. But Memphis’ lead over Golden State in ninth and San Antonio in 10th is only one game.\n\n\r\n                    Doncic, who struggled in the first half, scored 14 in the third quarter, but Memphis still maintained an 89-83 lead heading into the final period.\n\n\r\n                    And while Memphis would increase the lead to six on several occasions in the fourth, the advantage wasn’t enough to prevent Doncic’s heroics.\n\n\r\n                    “We’re happy with how we played tonight, up to 1.8 seconds,” Morant said. “All you can do is force somebody into a tough shot, and Luka made the tough shot. No reason to have our heads down or anything on how we played.”\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Played their only road game out of a stretch of nine games. ... Improved to 17-12 on the road. ... Max Kleber passed Hubert Davis in the first quarter for 17th on the Mavericks career 3-pointers list. Davis, recently hired as North Carolina’s head coach, had 306.\n\n\r\n                    Grizzlies: Announced they signed G Tim Frazier to a 10-day contract. ... Allen shot 4 of 5 in the first quarter, scoring 14 points. ... Morant passed O.J. Mayo for 12th on the team’s career assists list.\n\n\r\n                    PLAY-IN SITUATION\n\n\r\n                    In recent days, Mavs owner Mark Cuban and Doncic have expressed their opposition to the play-in formula for the final playoff spots. The Mavericks, in the seventh spot in the West, lead the four teams that could end up in the play-in. “I do have opinions on it,” Carlise said. “But my focus has got to be on what is going on right now. It’s a reality. The play-in tournament is happening. If we end up in the play-in, we’ll embrace that challenge. That will be a great experience.”\n\n\r\n                    LAST WORD\n\n\r\n                    “I was really surprised when it went in.” – Doncic on the final shot.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Host the New York Knicks on Friday\n\n\r\n                    Grizzlies: Open a seven-game road trip on Friday in Chicago.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764996933.7441962
}