{
  "game_id": "0022400112",
  "espn_id": "401704678",
  "date": "Oct 28, 2024",
  "matchup": "POR @ SAC",
  "headline": "De'Aaron Fox scores 24 points, surpasses 10,000 for career as Kings beat Trail Blazers 111-98",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox scored 24 points and surpassed 10,000 for his career, DeMar DeRozan added 23 points and the Sacramento Kings beat the Portland Trail Blazers 111-98 on Monday night for their first win of the season.\n\n\r\n              Fox became the fifth player in franchise history to reach the 10,000 mark when he made a 3-pointer in the third quarter. The Kings never trailed, expanding a 60-58 lead midway through the third quarter to 26 points in the fourth.\n\n\r\n              DeAndre Ayton had 20 points and 11 rebounds for the Blazers, joining Bill Walton as the only players in franchise history to start a season with four straight double-doubles.\n\n\r\n              DeRozan had 19 points at the half, making 9 of 10 three throws and hitting a contested jumper at the buzzer to give the Kings a 51-43 lead.\n\n\r\n              Sacramento made 23 of its 25 free throw attempts.\n\n\r\n              Domantas Sabonis had 16 points and 13 rebounds for the Kings, and Kevin Huerter added 18 points.\n\n\r\n              Takeaways\r\n              Trail Blazers: The Blazers had shot 39% from 3-point range over their last two games, and coach Chauncey Billups praised his team before the game for creating good drive-and-kick looks. But Portland, the league’s worst 3-point shooting team last season, was just 4 of 22 from deep on Monday.\n\n\r\n              Kings: The Kings lost their first two games by a combined six points.\n\n\r\n              Key moment\r\n              After a sluggish first half, the Kings closed the third quarter on a 29-13 run to take an 18-point lead into the fourth. Malik Monk and Sabonis combined for a 9-0 spurt during that stretch.\n\n\r\n              Key stat \r\n              The Kings held the Blazers without a fast-break point until late in the fourth quarter.\n\n\r\n              Up next\r\n              Trail Blazers: At the Los Angeles Clippers on Wednesday.\n\n\r\n              Kings: At Utah on Tuesday to begin a four-game trip.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998198.736316
}