{
  "game_id": "0021600540",
  "espn_id": "400899961",
  "date": "Jan 05, 2017",
  "matchup": "OKC @ HOU",
  "headline": "Nene's late free throws lift Rockets over Thunder, 118-116",
  "body": "HOUSTON -- The Houston Rockets weren't happy to have squandered an 18-point lead, leaving them tied with Oklahoma City with just seconds left on Thursday night.\nBut they were proud of the plays they made at the end of the game to hang on for the win.\nJames Harden scored 26 points and Nene hit two free throws with 0.7 seconds remaining to lift the Rockets to their sixth straight victory, 118-116 over the Thunder.\n\"There's going to be some close games in the postseason where we'll have to figure ways to close them out, and it isn't always going to be us making shots and it being perfect,\" Harden said. \"We're going to have to get stops sometimes.\"\nHouston overcame Russell Westbrook's 49 points, though the star guard struggled down the stretch.\nHarden found Nene right under the basket and he was fouled by Jerami Grant as he attempted a shot, setting up the winning free throws. Nene had a season-high 18 points for his 12th double-digit game this season.\n\"I saw two defenders guarding me and I saw Nene wide open,\" Harden said. \"No matter if it's the fourth quarter with three seconds to go or the first quarter with 10 minutes to go, I'm going to make that pass. And my teammates know that and he was prepared and ready for it.\"\nA pair of foul shots by Harden tied it with just under two minutes remaining. The teams combined to miss seven shots after that, with Westbrook missing three in that span, before Nene's free throws.\nWestbrook was a bit touchy was asked about his last missed 3-point attempt.\n\"Did you see what happened? There's nothing to take you through,\" he said. \"I missed the shot.\"\nThe Thunder attempted an alley-oop on the inbounds pass after that, but Enes Kanter couldn't finish the play and Houston held on.\nWestbrook finished two points shy of his season high as Oklahoma City dropped its third straight.\nHouston was clinging to a four-point lead with about 2 1/2 minutes remaining before Westbrook and Victor Oladipo made consecutive 3-pointers to put Oklahoma City up 116-114.\nThe Rockets had a 14-point lead early the fourth quarter before their offense stalled, and the Thunder went on a 20-7 run to cut the lead to 107-104 with about 5 1/2 minutes left. Westbrook was on the bench for most of that time and Oladipo scored five points during that run before Westbrook returned and capped it with four straight points.\nWestbrook had 40 points entering the fourth quarter. But he wasn't getting much help from his teammates, with the rest of the Thunder managing just 43 points as Houston led 97-83 after three.\n\"He played an incredible game and in a lot of ways ... kept us close because we weren't getting a lot of production offensively,\" Oklahoma City coach Billy Donovan said.\nWestbrook, who finished with eight 3-pointers, made one with about nine minutes left in the third quarter to get Oklahoma City within 10. Houston scored the next eight points to extend the lead to 82-64. Another 3 by Westbrook came after that to end a scoring drought by the Thunder of almost three minutes.\nHouston had an 18-point lead with about six minutes left in the quarter when the Thunder scored the next eight points to cut it to 10 again. But Houston responded with an 8-2 spurt, with five points from Eric Gordon, to push the lead to 93-77.\nThe Rockets led 67-56 at the break.\nTIP-INS\nThunder: Oladipo had 17 points and seven rebounds. ... Andre Roberson added 14 points. ... Kanter had 15 points with 13 rebounds.\nRockets: Gordon added 22 points with five 3-pointers. ... Houston improved to 26-3 when leading after three quarters. ... Harden had 12 assists for his 15th straight double-double.\nOUCH\nHouston guard Patrick Beverley returned after missing two games with a sprained right wrist and finished with 11 points, eight rebounds and three assists. He was asked if he felt OK.\n\"No. It hurt (a lot). Wrist is throbbing right now,\" he said. \"But for some reason every shot I shot felt good. I was able to do the hustle plays and energy plays. I'm just happy my energy was good. I would say I was solid defensively, but (Westbrook) scored 50 points. So I'm just happy he didn't get a triple-double and we got a win.\"\nWESTBROOK'S NIGHT\nWestbrook's 49 points were the most a player has scored against Houston since current Rocket Corey Brewer had 51 for Minnesota on April 11, 2014. It was the third-most points Westbrook, whose career high is 54, has ever scored.\nUP NEXT\nThunder: Host the Denver Nuggets on Saturday.\nRockets: Visit the Orlando Magic on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995293.8659961
}