{
  "game_id": "0022000730",
  "espn_id": "401307520",
  "date": "Mar 31, 2021",
  "matchup": "PHX vs. CHI",
  "headline": "Booker scores season-high 45, Suns beat Bulls 121-116",
  "body": "PHOENIX -- — Devin Booker scored a season-high 45 points, Chris Paul added 19 points and 14 assists, and the Phoenix Suns held on to beat the Chicago Bulls 121-116 on Wednesday night.\n\n\r\n                    The Suns built a 16-point lead midway through the third quarter, but the Bulls cut that advantage to 94-86 by the start of the fourth. Chicago hung close throughout the final minutes, pulling within three points multiple times. Thaddeus Young's bucket in the paint brought the Bulls within 115-112 with less than a minute left.\n\n\r\n                    Booker responded with his final basket — blowing past Nikola Vujecic for a layup — and the Suns won their fourth straight. Chicago's losing streak is now at five games.\n\n\r\n                    “I was just making shots,” Booker said. “Getting good screens, getting in the paint and taking what the defense gives me. Got a few transition ones early to get in a rhythm.”\n\n\r\n                    Booker had another All-Star performance in a season full of them, making 17 of 24 shots from the field and 9 of 10 free throws. He was especially effective on mid-range jumpers, finishing time and again over Chicago's defense.\n\n\r\n                    “He’s one of the rare guys in the league who can score on all three levels, with the ball, without the ball and he can post up,” Suns coach Monty Williams said. “He did it every way you can describe or imagine tonight.”\n\n\r\n                    Phoenix's Dario Saric had 16 points off the bench on 6-of-9 shooting, including 3 of 5 on 3-pointers.\n\n\r\n                    Chicago was led by Vujecic's 24 points and 10 rebounds. Young added 19 points and 10 rebounds, and Denzel Valentine also scored 19 points.\n\n\r\n                    Booker scored 22 points before the break on 10-of-14 shooting to help the Suns lead 67-58 at halftime. Phoenix made 10 of 18 (55.6%) shots from 3-point range. Paul said Booker's efficiency is fun to watch.\n\n\r\n                    “The fact that he does it in the course of the game,” Paul said. “It's not like he's out there hunting.”\n\n\r\n                    Chicago coach Billy Donovan said his team's defense was better in the second half but there's wasn't much of a way to stop Booker. \n\n\r\n                    “I thought Booker had a big night because he made all his midrange jumpers,” Donovan said. “It wasn’t like he did it beyond the line, he did it from mid-range, so give him credit.”\n\n\r\n                    Phoenix won despite Chicago having a 50-32 rebounding advantage, including an 18-4 lead in offensive boards. But the Bulls shot just 43% from the field and missed on several opportunities close to the basket.\n\n\r\n                    “They’re just so doggone big and they kept crashing the boards,” Williams said. “We finally went big and were able to keep them at bay a little bit.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Chicago was without G Zach LaVine (right ankle sprain) and G Coby White (left cervical pain). LaVine is averaging 27.5 points per game while White averages 15. White missed his second straight game. ... G Tomas Satoransky played his 100th game with the Bulls. ... Chicago closed the month of March with a 4-10 record. ... Vucevic was called for a technical foul midway through the fourth quarter. \n\n\r\n                    Suns: F Frank Kaminsky missed his second straight game in the league's health and safety protocol. ... F Abdel Nader was also out with right knee soreness. ... Saric had a second straight productive game off the bench. He had 20 points in the team's win over the Hawks on Tuesday. ... Phoenix shot 57% from the field. ... Jae Crowder had four blocked shots.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Travel to face the Jazz on Friday night.\n\n\r\n                    Suns: Host the Thunder on Friday night\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt at www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997742.330367
}