{
  "game_id": "0022300920",
  "espn_id": "401585548",
  "date": "Mar 09, 2024",
  "matchup": "PHX vs. BOS",
  "headline": "Jayson Tatum, Jaylen Brown lead Celtics past Suns 117-107, snapping rare 2-game skid",
  "body": "PHOENIX -- — Jayson Tatum scored 29 points, Jaylen Brown added 27 and the NBA-leading Boston Celtics beat the Phoenix Suns 117-107 on Saturday night.\n\n\r\n              The Celtics came into the game on a rare two-game skid after dropping games to the Cleveland Cavaliers and Denver Nuggets. After Saturday's win, Boston still hasn't lost three in a row and improved to 49-14 overall.\n\n\r\n              “We’re not perfect. We try to be, we really do try,” Tatum said. “But we make mistakes. This is a tough league, the other teams are really good and have great players. It’s all about how you respond.\n\n\r\n              “You want to be a special team, you’ve got to do a good job responding.”\n\n\r\n              Tatum said the Celtics used Friday's off day in Phoenix to recharge, playing 18 holes of golf and enjoying some sunshine and 70-degree weather in the desert. He said it helped the team reset and get back to winning.\n\n\r\n              “Today, we bounced back in a positive way,” Tatum said.\n\n\r\n              The Suns — playing without injured All-Star Devin Booker — were led by Kevin Durant's season-high 45 points on 18-for-26 shooting. Bradley Beal added 25 points while Jusuf Nurkic scored 11 and grabbed 11 rebounds.\n\n\r\n              “I just wanted to be aggressive, play through anything,” Durant said. “I was able to knock some shots down and loosen the defense. We were right there so many times, but they made big plays coming out of time outs.”\n\n\r\n              Brown scored 18 points to lead the Celtics to a 62-50 halftime advantage and they never trailed in the second half.\n\n\r\n              The Suns fought back in the third quarter and Durant's transition 3-pointer cut Boston's lead to 77-74 with 3:54 left, but Jrue Holiday responded with a 3 and the Celtics took an 87-78 lead into the final quarter.\n\n\r\n              Boston's Payton Pritchard and Tatum hit back-to-back 3s to start the fourth. Al Horford hit a corner 3-pointer with 1:54 left to put the Celtics up 110-102.\n\n\r\n              The Celtics got good production from their bench — particularly Luke Kornet and Pritchard. The 7-foot-1 Kornet had 14 points on 6-of-7 shooting, while Pritchard scored 10.\n\n\r\n              “They were amazing, they were tremendous,” Boston coach Joe Mazzulla said. “I thought Payton changed the game with his defense.”\n\n\r\n              Boston starter Kristaps Porzingis missed the game with right hamstring tightness.\n\n\r\n              Booker missed his fourth straight game with a sprained ankle. The four-time All-Star has returned to the floor for practice as he nears his expected return.\n\n\r\n              “I thought we battled, I’m proud of how hard we fought,” Suns coach Frank Vogel said. ”I didn’t like how many loose balls we weren’t getting at the beginning of the game — got to have more urgency against a team with the best record in the NBA. But I thought we caught ourselves and played a spirited game throughout the rest of it.”\n\n\r\n              The Suns came into the game as the No. 6 team in the crowded Western Conference race and are trying to stay out of the postseason play-in tournament. The top six seeds in each conference automatically move to the first best-of-seven round.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Portland on Monday.\n\n\r\n              Suns: At Cleveland on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996642.930848
}