{
  "game_id": "0022300475",
  "espn_id": "401585103",
  "date": "Jan 03, 2024",
  "matchup": "LAL vs. MIA",
  "headline": "Tyler Herro scores 21 points, Heat pull away in 4th quarter to beat Lakers 110-96",
  "body": "LOS ANGELES -- — Tyler Herro scored 21 points, Duncan Robinson had 11 of his 13 points in the fourth quarter and the Miami Heat beat the Los Angeles Lakers 110-96 on Wednesday night.\n\n\r\n              Jaime Jaquez Jr. added 16 points and Nikola Jovic and Bam Adebayo scored 15 apiece as all eight Miami players who saw action scored in double figures. Kevin Love had a season-high 14 rebounds along with 10 points.\n\n\r\n              The Heat led most of the game, but Christian Wood’s driving layup and free throw to complete a 3-point play got Los Angeles to 74-72 with 10:46 remaining in the fourth quarter.\n\n\r\n              Miami responded with a 10-2 run that included 3-pointers by Robinson and Jaquez. Robinson's perimeter shot from the corner near the Lakers' bench extended the lead to 77-72 and was the catalyst that got the Heat going the rest of the way.\n\n\r\n              “Duncan’s first half 3s were more wide open than the one that he hit in front of their bench at the end of the clock. I think that’s where he’s dangerous. He’s ignitable. He sees one go and I think that's where it changed for him,” Heat coach Erik Spoelstra said. “We ended up basically running our offense through him and Bam on the catch and shoot off ball movements in the fourth quarter because of that.”\n\n\r\n              The Heat then put it out of reach and snapped a two-game losing streak with a 15-6 run during a four-minute stretch midway through the fourth quarter.\n\n\r\n              Miami shot just 39.1% from the field the first three quarters, but was 14 of 24 in the fourth, including 6 of 11 on 3-pointers.\n\n\r\n              “Tonight was a better late than never situation. I was pretty non-existent for three quarters but came around and kept on letting it fly,” Robinson said. “It was a good fourth. We had good activity on both ends and made it difficult for them to guard.”\n\n\r\n              The Lakers were just 4 of 30 on 3-pointers and committed 15 of their 22 turnovers in the first half.\n\n\r\n              Anthony Davis had 29 points and 18 rebounds for Los Angeles. Davis added six assists and five blocks to join Philadelphia's Joel Embiid as the only players this season to record at least 25 points, 15 rebounds, five assists and five blocks in a game.\n\n\r\n              Austin Reaves scored 24 points. LeBron James was 6 of 18 from the field and finished with 12 points.\n\n\r\n              Wednesday night began a stretch where the Lakers play 11 of 12 games in Los Angeles, including a “road game” against the Clippers. However, they have dropped three straight and gone 3-9 since winning the inaugural NBA In-Season Tournament.\n\n\r\n              “It’s a little bit of everything right now and if we keep on this trend, it’s not going to be good for us.” Davis said after the Lakers fell to 17-18. “It’s kind of obvious that we’ve got to figure it out sooner than later.”\n\n\r\n              Love's layup off a steal gave the Heat a 43-31 lead with 4:22 remaining in the first half. \n\n\r\n              Miami had a 43-35 advantage at halftime before the Lakers slowly started coming back in the second half. \n\n\r\n              Miami was without Jimmy Butler for the sixth time in seven games because of irritation in his right foot.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Conclude five-game trip against Phoenix on Friday night.\n\n\r\n              Lakers: Host Memphis on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995526.693582
}