{
  "game_id": "0021900397",
  "espn_id": "401161039",
  "date": "Dec 16, 2019",
  "matchup": "MIA @ MEM",
  "headline": "Morant, Valanciunas lead Grizzlies past Heat 118-111",
  "body": "MEMPHIS, Tenn. --  This time, Ja Morant and Memphis landed the final punch against Miami.\n\nMorant had 20 points and 10 assists to lead the Grizzlies to a 118-111 victory over the Heat on Monday night.\n\nJonas Valanciunas finished with 21 points and 10 rebounds as Memphis won for the fourth time in five games. De'Anthony Melton scored 16 points, and Jaren Jackson Jr. had 15.\n\nThe Grizzlies also played Miami in their season opener on Oct. 23, losing 120-101 when the Heat rallied in the fourth quarter. The Heat put together another big finish Monday night, but the Grizzlies responded with their own push.\n\n\"We just learned,\" Morant said of the difference since the first game of the season. \"I feel like we lost a lot of games late in the fourth quarter. A team would go on a run, and we weren't able to bounce back from it. ... We're just learning from our mistakes.\"\n\nMiami had won four of five, including three overtime victories. Jimmy Butler had 25 points and eight assists, and Tyler Herro scored 22 points.\n\n\"Our (man) defense was pretty poor all the way through,\" Heat coach Erik Spoelstra said. \"The zone defense gave us a little bit of life. I don't know if it was because it got them out of rhythm or because we were just more active.\"\n\nThe Grizzlies were up by 11 when Butler went on his own 7-0 run in the fourth. Derrick Jones Jr. then scored five points to help Miami take a 107-104 lead with 5:30 left.\n\nMemphis responded with 11 straight points for a 115-107 lead on a Morant drive with 2:31 left.\n\nJones finished with 15 points for Miami, and Bam Adebayo recorded his sixth straight double-double with 14 points and 13 rebounds.\n\nIt was Miami's first loss of the season to a sub-.500 team.\n\n\"Even in the midst of the second half (the Heat) were going on, you wouldn't believe the communication the guys had,\" Grizzlies coach Taylor Jenkins said, later adding: \"No one was overthinking it and putting their heads down, which were some of the moments earlier in the season.\"\n\nBAM AWARD\n\nAdebayo was named the Eastern Conference Player of the Week earlier Monday after averaging 20 points, 11.3 rebounds and 8.7 assists in three games last week.\n\n\"I love it. I love it for him,\" Spoelstra said. \"He's all about the right things. This won't go to his head. It's not like he is doing this for individual accolades.\"\n\nTIP-INS\n\nHeat: Adebayo has 17 double-doubles this season. ... Butler took only three shots in the first half, but did have five assists. ... Butler has nine straight games of at least 20 points.\n\nGrizzlies: F Jae Crowder, who missed Saturday's home game against Washington with left ankle soreness, returned to action. ... Memphis' 73 first-half points were a season high for a half and the fifth-highest in franchise history.\n\nUP NEXT\n\nHeat: Complete a three-game road trip Wednesday night in Philadelphia\n\nGrizzlies: Play at Oklahoma City on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995530.449561
}