{
  "game_id": "0022000096",
  "espn_id": "401267256",
  "date": "Jan 04, 2021",
  "matchup": "MIA vs. OKC",
  "headline": "Heat go on 20-0 run, roll past Thunder 118-90",
  "body": "MIAMI -- — Kelly Olynyk became the latest option in Miami’s starting lineup. He made a case to stick around.\n\n\r\n                    Olynyk made five 3-pointers on his way to 19 points, Bam Adebayo led all scorers with 20 on 9-for-10 shooting and the Heat beat the Oklahoma City Thunder 118-90 on Monday night. \n\n\r\n                    Miami has played six games, alternating losses then wins in all six, and has used a different starting five every time.\n\n\r\n                    “I think the starting lineup is so overstated in so many ways,\" Heat coach Erik Spoelstra said. “The more important thing is us building consistency to how we want to play.\"\n\n\r\n                    Jimmy Butler scored 18 points for Miami, which used a 20-0 third quarter run to turn what was a four-point game into a runaway. Olynyk had 11 points in that spurt, including three 3-pointers, and the Heat stretched the lead to 35 — their biggest such cushion of the young season.\n\n\r\n                    “It's a different flow and a different game when you start,\" Olynyk said. “You can kind of let the game come to you. ... But nonetheless, you've got to play your role, whatever it is.\"\n\n\r\n                    Shai Gilgeous-Alexander scored 18 points for the Thunder, who sat their starters in the fourth quarter. Darius Bazley scored 16 and Luguentz Dort scored 12 for Oklahoma City — which saw its chance slip completely away during that five-minute stretch of the third quarter.\n\n\r\n                    “We want to be a team that plays 48 minutes,” Thunder coach Mark Daigneault said.\n\n\r\n                    The Thunder were just 13 of 48 from 3-point range.\n\n\r\n                    “The way our offense is set up, guys are going to get open looks,\" Bazley said. “A lot of the teams we play, they're like packed into a shell ... guys are set up to get good looks, especially when you're playing off the ball.\"\n\n\r\n                    The Heat shot 57%; the Thunder shot 37%. Duncan Robinson scored 12 points for the Heat, all of them coming from 3-point range.\n\n\r\n                    Adebayo became the fourth player to have multiple games shooting 9-for-10 or better in Heat history, joining Hassan Whiteside (five times), Alonzo Mourning (four) and Udonis Haslem (three). Adebayo also went 9 for 10 on Jan. 5, 2020 against Portland.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Rookie Aleksej Pokusevski (concussion protocol) missed the game. ... Oklahoma City was down 63-49 at the half, its biggest deficit at the break so far this season. ... The Thunder went 0 for 10 from the field during Miami’s 20-0 run, seven of those misses from 3-point range.\n\n\r\n                    Heat: Butler missed all six of his shots in Dallas on Friday, so the Heat got him a layup on the first possession of the game Monday. ... The Heat debuted their latest “Vice” court and uniform. ... Miami has played six games; it has led by at least 20 in two and trailed by at least 20 in two others.\n\n\r\n                    REF HURT\n\n\r\n                    Crew chief Kane Fitzgerald left with 3:50 remaining in the first quarter with a left leg injury, possibly to his hamstring. That left two officials to finish the game, referee Aaron Smith and umpire Brandon Schwab — a non-staff official.\n\n\r\n                    RARE WIN\n\n\r\n                    Miami got a home win over the Thunder for the first time since Dec. 3, 2015. The Thunder didn’t come to Miami in 2017 or 2020; the 2017 quirk was just based on the way the schedules fell, and last season’s “home” game for the Heat was played inside the bubble at Walt Disney World.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Visit New Orleans on Wednesday, the third game of a five-game trip.\n\n\r\n                    Heat: Host Boston on Wednesday, a rematch of the 2020 Eastern Conference finals.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996815.2022028
}