{
  "game_id": "0022001036",
  "espn_id": "401307845",
  "date": "May 11, 2021",
  "matchup": "BKN @ CHI",
  "headline": "Durant scores 21, Nets beat Bulls 115-107",
  "body": "CHICAGO -- — Kevin Durant had 21 points and eight assists, and the Brooklyn Nets beat the Chicago Bulls 115-107 on Tuesday night despite Zach LaVine’s 41 points.\n\n\r\n                    Joe Harris added 17 points and Bruce Brown had 15 points and 10 rebounds as Brooklyn won its second straight after a four-game slide.\n\n\r\n                    “That’s what we do every game,” Durant said after the Nets finished with 32 assists on 42 field goals. “That’s who we’ve been all season.”\n\n\r\n                    Chicago had its three-game winning streak — and probably its postseason hopes — end.\n\n\r\n                    Brooklyn, which lost guard Kyrie Irving to an apparent facial injury early in the second half, led 93-74 at the start of the final period and sat its starters for most of the period. LaVine, who had 12 points in the fourth, forced them back in by scoring eight straight to cut the lead to 102-91 with 4:54 to play.\n\n\r\n                    Durant and Jeff Green each had baskets in the final few minutes to keep the Bulls from rallying all the way back.\n\n\r\n                    Green added 14 points and Nicolas Claxton had 10 points and 10 rebounds.\n\n\r\n                    Chicago, in desperate need of a win, helped doom itself by staying under 40% from the floor until the final minutes. Coby White finished with 16 points and Nikola Vucevic added 12 points and 12 rebounds.\n\n\r\n                    “Zach did all he could to carry us,” coach Billy Donovan said. “We needed that because we just didn’t have a lot of other things going.”\n\n\r\n                    The Bulls fell three games behind idle Washington for the final spot in the Eastern Conference play-in tournament and will need to win their final three and hope for help from either the Wizards or Indiana to secure a berth.\n\n\r\n                    Brooklyn, meanwhile, remains ahead of Milwaukee in the race for the second seed in the conference playoffs.\n\n\r\n                    The Nets had a double-digit lead before the game was four minutes old and kept the margin there most of the first half before going to intermission up 64-51.\n\n\r\n                    OUCH!\n\n\r\n                    Irving caught an elbow from Vucevic in the right side of his face when the two were going for a rebound early in the third quarter. He knelt to the floor as the play went the other way and walked to the dressing room after being helped off the floor by a trainer. He did not return to the game after scoring 13 points with five assists in 21 minutes.\n\n\r\n                    Coach Steve Nash said Irving underwent an “inconclusive” X-ray but exhibited no concussion symptoms. He’ll be evaluated further when the team returns to Brooklyn on Wednesday.\n\n\r\n                    “He mixes it up a lot with the big fellas so he might catch an elbow here and there,” Durant said of his teammate. “He took a nice elbow to the face.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: James Harden (right hamstring strain) missed his 18th straight game. Nash said he’s “hopeful” the nine-time All Star will play in one of the team’s final three games. … Brown wore a hard facemask after suffering a broken nose in a collision during practice. \n\n\r\n                    Bulls: C Daniel Theis started Tuesday after missing Sunday’s win over Detroit with a right hip contusion.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host San Antonio on Wednesday. \n\n\r\n                    Bulls: Host Toronto on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764997470.587414
}