{
  "game_id": "0022400507",
  "espn_id": "401705073",
  "date": "Jan 07, 2025",
  "matchup": "DEN vs. BOS",
  "headline": "Jayson Tatum scores 29, Porzingis adds 25 as Celtics hold off depleted Nuggets 118-106",
  "body": "DENVER -- — Jayson Tatum scored 29 points, Kristaps Porzingis added 25 and the Boston Celtics held off the depleted Denver Nuggets 118-106 on Tuesday night as three-time NBA MVP Nikola Jokic sat out because of an illness.\n\n\r\n              Porzingis had 11 rebounds, while Jrue Holiday contributed 19 points. The Celtics attempted 35 3-pointers, which was well below their season average of 50.17. Instead, they outscored the Nuggets by a 60-46 margin in the paint. \n\n\r\n              Russell Westbrook had 26 points for Denver and eight turnovers. Michael Porter Jr. added 15 points and 10 rebounds as the Nuggets dropped to 10-7 at home. They were 33-8 last season.\n\n\r\n              Trailing by as many as 15 points in the first half, the Nuggets rallied to make sure the game stayed tight down the stretch. There was a momentary break with 8:56 remaining when a cup of ice spilled on the court. It took several minutes to clean up. Christian Braun followed with a 3-pointer to tie it at 93. \n\n\r\n              Boston went on a 15-0 run to help cement the win. \n\n\r\n              The game between the last two NBA champions was setting up to feature two of the top players in the league. But Jokic went from probable to questionable to finally ruled out. The Nuggets were also missing Aaron Gordon (calf). \n\n\r\n              Takeaways\r\n              Celtics: Stellar defense down the stretch, including steals from Al Horford and Tatum.\n\n\r\n              Nuggets: The bench had a solid showing with Julian Strawther scoring 19 and Peyton Watson 14.\n\n\r\n              Key moment\r\n              Porter appeared to be fouled by Sam Hauser going in for a dunk with 2:57 left in the third quarter and Denver trailing 80-77. The Celtics won the challenge.\n\n\r\n              Key stat\r\n              There were 10 lead changes and eight ties.\n\n\r\n              Up next\r\n              The Nuggets turn around and host the Los Angeles Clippers on Wednesday night, while the Celtics play at home against Sacramento on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998258.418472
}