{
  "game_id": "0022400695",
  "espn_id": "401705261",
  "date": "Feb 02, 2025",
  "matchup": "CHI @ DET",
  "headline": "Cade Cunningham's 22 points and 15 assists lead Pistons over Bulls 127-119",
  "body": "DETROIT -- — Cade Cunningham had 22 points and 15 assists as the Detroit Pistons defeated the Chicago Bulls 127-119 on Sunday.\n\n\r\n              The Pistons overcame a triple-double from Nikola Vucevic, who finished with 20 points, 10 rebounds and 10 assists. \n\n\r\n              Cunningham, named to his first All-Star team earlier this week, didn't have his best shooting night, going 10 for 23 from the floor and 2 for 6 on 3-pointers, but created easy baskets for his teammates all game.\n\n\r\n              Jalen Duren added 21 points and 13 rebounds for Detroit, while sixth-man Malik Beasley scored 19. The Pistons finished with seven players in double figures.\n\n\r\n              Coby White led Chicago with 22 points, while Josh Giddey added 20 points and 11 rebounds.\n\n\r\n              A 3-pointer by Vucevic pulled the Bulls within 111-104 with 6:13 to play, but Chicago couldn't string together enough stops to make a serious run. Cunningham set up dunks for Ausar Thompson and Duren followed by Tim Hardaway Jr. and Beasley hitting 3-pointers.\n\n\r\n              Takeaways\r\n              Bulls: Zach LaVine missed his third straight game for personal reasons. \n\n\r\n              Pistons: Isaiah Stewart returned for the Pistons after serving a one-game suspension in Thursday's win over the Dallas Mavericks.\n\n\r\n              Key moment\r\n              The Pistons outscored Chicago 34-19 in the second quarter, shooting 51.9% (14-27) from the floor while the Bulls were at 31.6% (6-19). Simone Fontecchio had nine points in the period while Cunningham added seven. Josh Giddey had six for Chicago.\n\n\r\n              Key stat\r\n              The Pistons made 13 of their first 19 shots in the fourth quarter (68.4%) before missing twice in garbage time. Chicago shot 46.9% from the floor in the second half, including 37% from the 3-point line, but only outscored Detroit 65-63.\n\n\r\n              Up next\r\n              The Pistons are home again on Monday, hosting the Atlanta Hawks, while Chicago returns home to host the Miami Heat on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997059.549115
}