{
  "game_id": "0021800814",
  "espn_id": "401071487",
  "date": "Feb 07, 2019",
  "matchup": "LAL @ BOS",
  "headline": "Rondo's jumper at buzzer lifts Lakers over Celtics 129-128",
  "body": "BOSTON --  LeBron James won't be playing alongside Anthony Davis this season.\n\nBut he does have a team he's hoping can build on a big win over its longtime rival.\n\nRajon Rondo hit a 20-foot jumper as time expired to lift the Los Angeles Lakers over the Boston Celtics, 129-128 on Thursday night.\n\n\"I practice those shots all the time,\" said Rondo, who hit his first career go-ahead field goal in the final 10 seconds of fourth quarter or overtime. \"Couldn't imagine it being in the Garden though. ... This is one I'll be playing for the rest of my life.\"\n\nJames had 28 points, 12 rebounds and 12 assists. Kyle Kuzma added 25 points and Rondo had 17 points and 10 assists to help Los Angeles bounce back after a 42-point loss at Indiana on Tuesday.\n\nJames is the third Lakers player with a triple-double in Boston, joining Magic Johnson and Elgin Baylor.\n\n\"I'm starting to get more and more back to myself,\" James said. \"Every possession, every quarter, every time I take a hit, I'm able to nudge it off and keep going. I'm working my way back and I'm getting better and better every single minute.\"\n\nRondo was in the right place at the right time for his final shot against the team he won an NBA title with in 2008. Brandon Ingram had his layup attempt blocked by Al Horford, but Horford whiffed on the rebound and the ball bounced into Rondo's hands.\n\n\"I thought the basketball gods rewarded the right team,\" Celtics coach Brad Stevens said.\n\nKyrie Irving led Boston with 24 points and eight assists. Jayson Tatum added 22 points and 10 rebounds. Daniel Theis has 20 points off the bench but the Celtics had a five-game win streak snapped.\n\nIt ended a wild, speculation-filled day in which the NBA's trade deadline expired with one of the players potentially on the wish list of both the Lakers and Celtics staying with his current team.\n\n\"I'm happy to still be on the team,\" said Tatum, whose name has been the subject of recent trade speculation. \"I'm glad that it's over with for now.\"\n\nLos Angeles attempted to put together a deal for Davis, but New Orleans held onto the All-Star despite him saying recently that he would not sign an extension and wanted to be traded. It means any potential suitor will have to wait until the summer to make a run at him.\n\nThe Lakers weren't completely quiet Thursday, trading Michael Beasley and Ivica Zubac to the Clippers for Mike Muscala.\n\nBut for now, James will have to go forward with most of a roster that improved to 2-2 since his return from a groin injury that kept him out of action a month.\n\nTIP-INS\n\nLakers: Shot 22 of 41 from the 3-point line.\n\nCeltics: Were outscored 50-42 in the paint. . Shot 16 of 38 from the 3-point line.\n\nWILD FINISH\n\nBoston led by as many as 18 in the first half. The Lakers erased it in third quarter, connecting on nine of their 13 attempts from beyond the arc and outscoring the Celtics 42-27 in the period to retake the lead entering the fourth.\n\nBut the Celtics responded with a 15-4 run to start the final period to get it back.\n\nJames and Irving traded shots down the stretch. In one exchange James' 3-pointer cut Boston's lead to 114-113. Irving then calmly responded with his own step-back 27-footer.\n\nLater, it was Irving assisting on a big basket. With Boston leading 121-118, Irving drove into the middle of the Los Angeles defense and kicked it out to a wide-open Marcus Morris for a 3 with just 1:24 left.\n\nBut following an Irving turnover, James tied it with his own corner 3-pointer.\n\nTOUGHER EAST\n\nThe Celtics stood mostly pat at the trade deadline, except for trading Jabari Bird to the Atlanta Hawks. The move opens a roster spot for the Celtics and allowed them part ways with a player who hasn't played this season after charged with beating up his girlfriend last September.\n\nBut two of the teams currently in front of them in the East did make some changes.\n\nThe Bucks, who had the best record in the NBA entering the day, picked up Nikola Mirotic in a deal with the Pelicans. The Raptors added former All-Star center Marc Gasol from Memphis in exchange for center Jonas Valanciunias.\n\n\"Those teams were already really good. And the assumption would only be that they'd only benefit from those moves,\" Stevens said.\n\nUP NEXT\n\nLakers: Continue their six-game road trip at Philadelphia on Sunday.\n\nCeltics: Host the Clippers on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n--\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764995441.776764
}