{
  "game_id": "0021800702",
  "espn_id": "401071375",
  "date": "Jan 22, 2019",
  "matchup": "TOR vs. SAC",
  "headline": "Lowry, VanVleet each score 19, Raptors beat Kings 120-105",
  "body": "TORONTO --  Even without Kawhi Leonard in the lineup, the rested Toronto Raptors were too much for the tired Sacramento Kings.\n\nKyle Lowry and Fred VanVleet each scored 19 points, Pascal Siakam had 18 and the Raptors beat the Kings 120-105 on Tuesday night.\n\nSerge Ibaka had 15 points and 10 rebounds as the Raptors extended their home winning streak to 10 games. Toronto's franchise record for consecutive home wins is 12.\n\nC.J. Miles scored a season-high 15 points and Norm Powell added 11 as Toronto won for the eighth time in nine games.\n\nLeonard missed his third straight game for rest and will also skip Wednesday's game at Indiana, coach Nick Nurse said. Leonard is expected to return Friday at Houston.\n\nA two-time NBA defensive player of the year, Leonard was limited to nine games with San Antonio last season because of a quadriceps injury.\n\nKings rookie Marvin Bagley scored a career-high 22 points and added 11 rebounds in his first career start.\n\n\"I'm really impressed with what he's done with his game,\" coach Dave Joerger said. \"The sky is the limit for Marvin. He's going to be a heck of a player for us.\"\n\nBogdan Bogdanovic scored 16 points and Brady Hield had 15 as Sacramento lost for the third time in four games.\n\nThe short-handed Kings were without three starters. Guard De'Aaron Fox sat because of a sore right toe, while forward Nemanja Bjelica was out because of a sore back. Forward Iman Shumpert sat out to rest. Shumpert made one of 10 shots in Monday's loss at Brooklyn.\n\nSacramento dropped to 3-7 in the second game of a back-to-back, and Joerger acknowledged his team ran out of gas late.\n\n\"It caught us at the end there,\" Joerger said. \"We had some turnovers that were out of fatigue, especially Bogdanovic. He's a pretty sharp dude and I ran him too long.\"\n\nThe Kings missed all six of their 3-point attempts in the fourth and allowed 12 second chance points in the final frame.\n\nThe Raptors, meanwhile, improved to an NBA-best 7-0 when playing with at least one day of rest and facing an opponent on the second night of a back-to-back. Toronto is 3-0 at home and 4-0 on the road in such games.\n\nSan Antonio (5-0) and Brooklyn (4-0) are the only other teams without a loss in those circumstances. Both have played all such games at home.\n\nToronto trailed 34-29 after one quarter, but Ibaka scored seven points in the second to give the Raptors a 60-56 edge at halftime.\n\n\"They came out and kind of jumped us a little bit,\" Lowry said. \"They were kind of fresher. As the game went on, we kind caught our second wind.\"\n\nWillie Cauley-Stein's dunk with 4:35 left in the third tied the score at 73-all, but Siakam had seven points as Toronto closed the quarter with a 15-5 run, taking an 88-78 lead into the fourth.\n\nWINNING WITHOUT KAWHI\n\nThe Raptors are 11-2 when Leonard does not play.\n\nON A ROLL\n\nMiles has scored 10 or more points in three straight games. He hadn't scored in double figures in consecutive games this season before the current streak.\n\nTIP-INS\n\nKings: Bogdanovic and Yogi Ferrell also started for the Kings. ... All five starters scored at least 10 points. ... Bogdanovic had nine assists and eight rebounds.\n\nRaptors: F OG Anunoby (personal reasons) was absent for the fourth straight game. Nurse said Anunoby is expected to return Friday. ... Lowry led the Raptors with nine assists. ... Toronto is 14-5 against Western Conference opponents. ... The Raptors outscored the Kings 24-12 in second-chance points.\n\nUP NEXT\n\nKings: Visit Memphis on Friday night.\n\nRaptors: Visit Indiana on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994105.755476
}