{
  "game_id": "0021801220",
  "espn_id": "401071893",
  "date": "Apr 10, 2019",
  "matchup": "ATL vs. IND",
  "headline": "Sumner's 3 last-second free throws lift Pacers past Hawks",
  "body": "ATLANTA --  Edmond Sumner sank three free throws with three-tenths of a second remaining, lifting the playoff-bound Indiana Pacers over the Atlanta Hawks 135-134 Wednesday night.\n\nTaurean Prince's 3-pointer with 1.1 seconds remaining gave Atlanta the lead, but DeAndre Bembry's foul on Sumner's last-second 3-point attempt changed the game.\n\nTJ Leaf set career highs with 28 points and 10 rebounds for Indiana.\n\nTyreke Evans scored 27 points and Sumner had 22 as the Pacers won despite resting most of their top scorers.\n\nPrince and Trae Young each scored 23 points for Atlanta. John Collins scored 20 points and set a career high with 25 rebounds.\n\nWith their fifth seed and matchup with fourth seed Boston already set in the Eastern Conference playoffs, the Pacers were in full lookahead mode.\n\nCoach Nate McMillan rested Indiana's top five scorers. Darren Collison was the only regular starter in the lineup, and he didn't play in the second half.\n\nMcMillan said he wanted to give minutes to \"some guys who need to play\" while others with \"tweaks\" needed the rest.\n\nA floater by Young gave Atlanta a 129-128 lead. Following a timeout, Leaf and Atlanta's Alex Len traded jams, leaving the Hawks with a 131-130 lead.\n\nPacers center Kyle O'Quinn was ejected with 5:39 remaining for his Flagrant 2 foul on Young. O'Quinn reached out and hit Young in the head, knocking the rookie to the floor, following a steal by Young. The blow did not appear to be intentional.\n\nThe hard foul seemed to motivate Young, who made both free throws before sinking an extra-long 3-pointer and then adding a three-point play, giving Atlanta a 59-58 lead. Indiana led 73-69 at halftime.\n\nThe Pacers completed their first season sweep of the Hawks since 2004-05.\n\nTIP-INS\n\nPacers: McMillan said F Myles Turner (sore right ankle) \"should be ready\" for the playoffs. McMillan said G Wesley Matthews (sore right toe) would be questionable if the playoffs started Wednesday night. ... Leaf's previous high was 18 points against Minnesota on Feb. 28.\n\nHawks: Len had 20 points and 10 rebounds. ... Young had 11 assists and six turnovers. ... Kevin Huerter scored 17 points while making five 3-pointers.\n\nONE MORE YEAR\n\nFans chanted \"One more year!\" when Vince Carter stood at the free-throw line in the third quarter. It looks like they'll get their wish. Before completing his 21st season, Carter, 42, said he'd like to play another season. \"If they'll have me I'm all for it,\" Carter said before the game. Coach Lloyd Pierce said the decision belongs to Carter.\n\nUP NEXT\n\nPacers: As Eastern Conference fifth seed, Indiana will play at fourth seed Boston for the first two games of the first round of the NBA playoffs.\n\nHawks: Atlanta's focus shifts to the NBA draft lottery on May 14. The Hawks hope to draw the No. 1 overall pick in the June 20 NBA draft.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995338.14447
}