{
  "game_id": "0021900327",
  "espn_id": "401160969",
  "date": "Dec 06, 2019",
  "matchup": "MIL vs. LAC",
  "headline": "Giannis scores 27 on 25th birthday, Bucks rout Clips 119-91",
  "body": "MILWAUKEE --  Giannis Antetokounmpo had plenty of time to relax and enjoy his 25th birthday Friday night against the Los Angeles Clippers.\n\nAntetokounmpo had 27 points and 11 rebounds before exiting the game with 8:56 to play and his Milwaukee Bucks ahead by 36. The Bucks went on to win 119-91 and capture their 14th straight victory.\n\n\"The fans were unbelievable tonight,\" Antetokounmpo said. \"They made me feel special. They made this day feel special. Usually a lot of people, their birthday, they celebrate, they go out, they do all that. But that's not me. That's not what I do. But the fans made it really special for me.\"\n\nThe reigning MVP made 11 of 20 shots and recorded his 21st double-double of the season.\n\n\"It was Giannis' birthday and we searched all over the city to find a gift and we couldn't find one, so we gave him this one,\" Clippers coach Doc Rivers said. \"That's all I can come up with because we were awful.\"\n\nThe Bucks led by as many as 41 and extended their longest winning streak since winning 16 consecutive games over two seasons in 1973.\n\nKhris Middleton added 17 points and Pat Connaughton and Ersan Ilyasova each scored 13 off the bench for Milwaukee.\n\nRivers pulled all of his key players out of the game with the Bucks leading 101-67 with 9:25 remaining in the fourth quarter. The group exited to the chant of \"Overrated! Overrated!\" from the Milwaukee crowd.\n\n\"We were just still stagnant at the beginning of the fourth,\" Kawhi Leonard said. \"We weren't really running anything, not executing. Coming down, taking shots early with no passes. So, I mean, I understand why he pulled us. Plus the lead was up high and we really didn't have no type of momentum.\"\n\nLeonard had 17 points and Paul George added 13 for the Clippers.\n\nFriday night was the first time Leonard and Antetokounmpo faced each other since the Eastern Conference finals in May, when Leonard's Toronto Raptors beat Antetokounmpo and the Bucks in six games en route to winning the NBA championship.\n\nLeonard said the biggest difference between Antetokounmpo then and now is he's shooting the ball with more confidence. Antetokounmpo agreed.\n\n\"Obviously, yes, I'm a little more confident with my jump shot,\" he said. \"I believe in myself more. I think my teammates believe in me even more this year. But I'm just aggressive. Since the year started, I've been on a mission to help my team win every night and I think I've stayed on that path.\"\n\nMilwaukee led 30-15 after the first quarter, with Middleton scoring 10 points in the opening frame. The Bucks held a 52-43 advantage at the break. After scoring 10 points in the first half, Antetokounmpo dropped 10 in the first 4:13 of the third quarter to help the Bucks outscore the Clippers 35-19 in the period.\n\nMilwaukee dominated Los Angeles inside, outscoring the Clippers 58-38 in the paint.\n\n\"They were so much more physical than us. It was not even close,\" Rivers said.\n\nJaMychal Green missed his second straight game for Los Angeles after suffering a bruised tailbone last Friday night against the San Antonio Spurs.\n\nTIP-INS\n\nClippers: Leonard and George practiced together for the first time as teammates on Thursday in Milwaukee. \"It was nice we could run some end-of-the game stuff against live defense,\" Rivers said. \"When you messed it up, you had a chance to correct it. I could share what I was looking for and they could share what they liked. We've not had the opportunity to do that.\"\n\nBucks: Milwaukee completed the season sweep of the Clippers. Antetokounmpo was an assist shy of a triple-double (38 points, 16 rebounds) in a 129-124 win in Los Angeles on Nov. 6. Neither George nor Leonard played that night.\n\nUP NEXT\n\nClippers: At the Wizards on Sunday.\n\nBucks: Host the Magic on Monday.\n\n---\n\nFollow Keith Jenkins on Twitter: https://twitter.com/MrKeithJenkins\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996162.259613
}