{
  "game_id": "0022200708",
  "espn_id": "401468863",
  "date": "Jan 23, 2023",
  "matchup": "CHI vs. ATL",
  "headline": "DeRozan scores 26 in 1,000th game, Bulls beat Hawks 111-100",
  "body": "CHICAGO -- — DeMar DeRozan scored 26 points in his 1,000th career game, Nikola Vucevic added 14 points and 17 rebounds and the Chicago Bulls beat the Atlanta Hawks 111-100 on Monday night. \n\n\r\n              The Bulls (22-24) returned to Chicago after a 126-108 win over the Pistons in Paris on Thursday and matched their season high with a third straight victory. \n\n\r\n              “The second half of the season, you can't give games back. Everything matters from here in and out,\" DeRozan said. \"You got to be the desperate ones. You got to go out there and compete.” \n\n\r\n              Trae Young had 21 points and 13 assists, while Dejounte Murray added 20 points for the Hawks, who have lost two straight after winning five in a row. \n\n\r\n              The Bulls started to pull away in the fourth quarter after Young found John Collins for an alley-oop dunk to cut the lead to 91-88. Zach LaVine answered with a 3-pointer and a pair of free throws before DeRozan made a 3 to extend the lead to 99-88 with 5:29 left. \n\n\r\n              LaVine finished with 20 points.\n\n\r\n              In the previous two meetings in Atlanta, both games ended with a buzzer-beater. AJ Griffin beat the Bulls at the horn on Dec. 11 and 10 days later, Ayo Dosunmu returned the favor with a follow shot as time expired.\n\n\r\n              The Bulls controlled most of the second half.\n\n\r\n              Patrick Williams sealed the game with a 3 to put Chicago up 108-95 with 1:53 left. Williams finished with 18 points and nine rebounds.\n\n\r\n              “I thought Patrick was really good tonight on the glass. He had some really important timely rebounds both defensively and offensively. That was important for us in crucial situations,” said Bulls coach Billy Donovan. “He is a guy that has to try to get double-figure rebounds for us.\"\n\n\r\n              The Hawks lost their key defender De’Andre Hunter before the game to asthma symptoms. \n\n\r\n              “They got two really good weapons (DeRozan and LaVine) over there and it is hard to guard a lot of guys in this league 1-on-1. So you have to use multiple guys and when you’re missing probably your best defender, it’s hard,\" Young said. \n\n\r\n              \"You are going to have to send doubles, you're going to have to do different types of schemes you (wouldn't) have if you had him out there. It's obviously not an excuse why we lost, but I definitely think that's tough when you have two high horses over there.” \n\n\r\n              Clint Capela had 16 points and 12 rebounds for Atlanta.\n\n\r\n              The Bulls led 57-48 at the half. LaVine scored 12 points on 5-of-9 shooting. Murray led the Hawks with 15 points. Young was held to four points on 1-of-6 shooting. \n\n\r\n              TIP-INS\n\n\r\n              Hawks: Bogdan Bogdanovic was back in the lineup after missing Saturday's loss to Charlotte with a right knee injury. He finished with 11 points in 33 minutes. ... THe Hawks had 18 turnovers. \n\n\r\n              Bulls: G Goran Dragic missed the game with a non-COVID illness. Donovan said Dragic will not travel with the team to Indiana but may re-join them during the three-game road trip. ... Bulls were 6 of 25 from the floor in the first quarter and 17 of 25 in the second quarter. ... DeRozan became the 143rd player to play in 1,000 games or more. ... The Bulls began a stretch where they play four games in six nights in four different cities. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Oklahoma City on Wednesday.\n\n\r\n              Bulls: At Indiana on Tuesday.\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994487.645549
}