{
  "game_id": "0022400806",
  "espn_id": "401705372",
  "date": "Feb 22, 2025",
  "matchup": "CHI vs. PHX",
  "headline": "Booker, Durant and Beal help the Suns beat the Bulls to snap a 4-game losing streak",
  "body": "CHIAGO -- — Devin Booker had 29 points and eight assists, Kevin Durant scored 27 points and Bradley Beal had 25 in his return to the starting lineup to help the Phoenix Suns beat the Chicago Bulls 121-117 on Saturday to end a four-game losing streak.\n\n\r\n              Playing the third of five straight road games, the Suns overcame an early deficit and held off the Bulls. They won for the first time since Jan. 31 with the Big Three of Booker, Durant and Beal in the lineup together.\n\n\r\n              Josh Giddey led Chicago with 24 points and had 10 assists and eight rebounds. The Bulls have lost six straight.\n\n\r\n              The Suns missed their first seven attempts and shot 29.2% in the first quarter. Chicago jumped out to a 10-point lead on a buzzer-beating floater from Tre Jones. Phoenix was 16 of 21 from the field in the second quarter and led by two at the half.\n\n\r\n              Phoenix built a 12-point lead in the third, but Chicago pulled within three entering the final quarter. Chicago evened it up in the final minutes, only for Booker, Beal and Durant to close it out.\n\n\r\n              Takeaways\r\n              Suns: Phoenix was able to refocus and quickly get back into the game.\n\n\r\n              Bulls: Rookie Matas Buzelis had 15 points, but Chicago struggled to get consistent scoring from the rest of its lineup after the first quarter.\n\n\r\n              Key moment\r\n              Coby White tied it for Chicago at 111 and made a layup with 34.7 seconds left to pull the Bulls within three, but Beal’ put it away with a 3-pointer from the left wing.\n\n\r\n              Key stat\r\n              Chicago committed 21 personal fouls to Phoenix’s 11.\n\n\r\n              Up next\r\n              The Suns are at Toronto on Sunday night. The Bulls are at Philadelphia on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997050.9010298
}