{
  "game_id": "0021801123",
  "espn_id": "401071796",
  "date": "Mar 28, 2019",
  "matchup": "PHI vs. BKN",
  "headline": "Embiid's big night leads 76ers past Nets 123-110",
  "body": "PHILADELPHIA --  Joel Embiid is raising his game in anticipation of the playoffs.\n\nEmbiid had 39 points, 13 rebounds and six assists to lead the Philadelphia 76ers to a 123-110 victory over the Brooklyn Nets on Thursday night.\n\nJJ Redick scored 18 points and Ben Simmons had 16 points and eight assists for the 76ers, who snapped a two-game losing streak.\n\nThe game matched teams that would've met in the first round of the playoffs had the postseason started Thursday. The 76ers have a strong hold on the No. 3 seed in the East with seven games remaining, and they moved three games ahead of idle Indiana.\n\n\"We might see them in the playoffs, so it was good to see where we're at, especially after two losses,\" Embiid said. \"I've been feeling it. I've been getting ready. I'm excited.\"\n\nEmbiid has a bad taste in his mouth from last season's second-round exit via Boston. In that series, Embiid was forced to wear a mask to protect an eye injury. He's preparing for a deeper postseason run this time around.\n\n\"It's definitely going to be a different story,\" he said.\n\nEmbiid did his damage inside and outside against the Nets. The All-Star center got off to a fast start, scoring 14 of Philadelphia's first 19 points while making five of seven shots, including all three 3-point tries.\n\nJoe Harris scored 22 points and Rondae Hollis-Jefferson added 19 for Brooklyn, which is clinging to a playoff spot.\n\nThe Nets began Thursday sixth in the East, but dropped to seventh with Detroit's 115-98 win over Orlando on Thursday. Brooklyn is a half-game in front of No. 8 Miami and just one game ahead of the ninth-place Magic and two games clear of No. 10 Charlotte.\n\n\"We have to be better to beat a team like this,\" Brooklyn coach Kenny Atkinson said.\n\nBrooklyn finished a grueling seven-game road trip 2-5. And it doesn't get easier for the Nets, who are trying to make the playoffs for the first time since the 2014-15 season.\n\nBrooklyn's remaining six-game schedule includes contests against Boston, Toronto, Indiana, Miami and a pair vs. Milwaukee.\n\n\"We have to recharge our batteries,\" Atkinson said. \"It's been a long trip. We have to somehow get that juice back. We lacked a little juice tonight.\"\n\nPhiladelphia surged to an early lead and never let go.\n\nHelped by making eight of their first 10 3-point attempts, the 76ers led by as many as 20 points in the first half before settling for a 68-58 lead at the break. The Nets closed to within six at 71-65 and had a chance to cut it to four with Rodions Kurucs at the line for two free throws 2:42 into the third quarter. But Kurucs missed both foul shots, and Philadelphia ran off 10 straight to take a 15-point lead.\n\n\"It's really bitten us,\" Atkinson said of the free-throw shooting. \"You have to make your free throws.\"\n\nTECHNICALLY SPEAKING\n\nThe teams received a combined four technical fouls. Three of the fouls came in the first half, all from referee Scott Foster for arguing calls. For Philadelphia, Embiid and Jimmy Butler were whistled for techs, while Brooklyn's D'Angelo Russell received one. Simmons was called for a tech in the second half for dissent.\n\nHEAD GAME\n\nEmbiid, Butler and Mike Scott wore tie-back headbands. It was Embiid's idea, and the big man said he might stick to the fashion statement after draining three 3-pointers.\n\nTIP-INS\n\nBrooklyn: Allen Crabbe (right knee) missed his sixth straight game. ... The Nets dropped to 17-22 on the road. ... Brooklyn struggled from the free-throw line, shooting 19 of 29. ... Russell, who was averaging 28.3 points on the road trip, scored 13.\n\nPhiladelphia: Assistant coach Billy Lange accepted the head coaching job at Saint Joseph's University on Thursday. Lange's duties coaching the defense will be assumed by Jim O'Brien. ... Philadelphia improved to 30-9 at home and 13-7 since adding Tobias Harris.\n\nUP NEXT\n\nBrooklyn: Open a three-game homestand Saturday against Boston.\n\nPhiladelphia: At Minnesota Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764993988.906865
}