{
  "game_id": "0021900311",
  "espn_id": "401160953",
  "date": "Dec 04, 2019",
  "matchup": "MEM @ CHI",
  "headline": "Bulls hang on to beat Grizzlies 106-99",
  "body": "CHICAGO --  Although closing out games remains a struggle, the Chicago Bulls have hung on to win two straight after several losses in similar situations earlier in the season.\n\nZach LaVine scored 25 points, Wendell Carter Jr. had 16 points and 13 rebounds, and Chicago beat the short-handed Memphis Grizzlies 106-99 on Wednesday night after nearly losing a 22-point lead.\n\nLauri Markkanen had 15 points as the Bulls won consecutive games for the first time.\n\nMonday in Sacramento, the Bulls had a 19-point lead reduced to two late before winning 113-106.\n\n\"We gave up our lead again, but just like we did in Sacramento, we made big plays down the stretch,\" LaVine said. \"We kept our composure.\"\n\nWhile happy with the wins, Chicago coach Jim Boylen hopes for more consistency to avoid the wild swings.\n\n\"We play good basketball for 12, 15 minutes, then we play five minutes of poor basketball,\" Boylen said. \"Then it flips. Now we've got to get back and re-engage, play good basketball again.\n\n\"We're learning how to do that. You've got to handle those spurts. You've got to try to get back in the flow. I thought in the last two games, we had enough plays to do that, settle down.\"\n\nJonas Valanciunas had 32 points and 13 rebounds, and Jaren Jackson Jr. and Jae Crowder each scored 15 points for Memphis, which has dropped eight of nine.\n\nRookie Ja Morant, the Grizzlies' leading scorer at 18.6 points per game, missed his third straight game with back soreness.\n\n\"I was doing everything that I can,\" Valanciunas said. \"We need some wins. We've got to pull some out.\"\n\nThe Bulls scored the game's first seven points and had a 13-2 lead after four minutes. Scoring consistently was a problem for Memphis throughout the first half.\n\nChicago had its biggest lead at 50-28 with 3 1/2 minutes to go in the second before the Grizzlies scored the final seven points of the quarter to make it 50-35 at halftime.\n\nLaVine opened the scoring in the third quarter to make it 52-35, but Memphis then ran off eight straight to pull within 52-43.\n\nA few minutes later, the Chicago lead was down to 61-55 following a five-point possession. De'Anthony Melton was fouled on a clear-path call and sank both free throws. After the Grizzlies inbounded the ball, Crowder hit a 3-pointer.\n\nThat was as close as Memphis would get in the third. The Bulls closed the quarter with a 17-5 run for a 78-64 edge heading into the fourth.\n\nChicago was leading 82-70 with 8 1/2 minutes remaining before the Grizzlies went on a 17-6 run to make it 88-87 with 4 1/2 minutes to play.\n\nLaVine, though, answered with five quick points and Kris Dunn hit a 3-pointer with 3 minutes left to get the lead back up to 96-87. The Bulls hung on from there.\n\nTIP-INS\n\nGrizzlies: Valanciunas returned after missing the previous two games with flu-like symptoms. Before the game, coach Taylor Jenkins thought he might have to limit his center's minutes, but he played 29 minutes, more than his season average of 24.6. \"I was winded,\" he said. \"A nice way to put it.\" . Rookie F Brandon Clarke (left oblique soreness) and F Kyle Anderson (right heel soreness) also sat out.\n\nBulls: The team still is awaiting the results of a follow-up MRI on F Otto Porter (left foot bone bruise) to determine how much longer he'll be sidelined. Porter hasn't played since Nov. 6 at Atlanta . F Chandler Hutchison (right shoulder sprain) missed his third straight game ... The Bulls have won six straight against Memphis.\n\nIN THE CLUTCH\n\nLaVine has scored at least 25 points in each of the last four games and has been making big plays down the stretch.\n\n\"When we get down to the nitty gritty, I have to put my hard hat on and make some plays,\" he said. \"It's not just me. I think I made two, I made a pass to (Dunn) and he made a big one and (Markkanen) made a big one as well.\"\n\nUP NEXT\n\nGrizzlies: At the Utah Jazz on Saturday night in the second of a four-game road trip.\n\nBulls: Host Golden State on Friday night after the Warriors won 104-90 last week in the first meeting.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995744.203794
}