{
  "game_id": "0021500253",
  "espn_id": "400828140",
  "date": "Nov 29, 2015",
  "matchup": "LAL vs. IND",
  "headline": "Kobe scores 13 after announcement, but Pacers beat Lakers",
  "body": "LOS ANGELES -- Kobe Bryant drained a 3-pointer with 11 seconds left in a one-point game, and the Lakers' crowd roared with a mix of excitement and nostalgia for the transcendent moments of its beloved star's now-finite career.\nBryant then shot an airball on a potential tying 3-pointer with 6 seconds to play, and everybody was reminded why Kobe is ready to walk away from basketball in the spring.\nBryant scored 13 points on 4-of-20 shooting after declaring he will retire at the end of the season, and the Indiana Pacers hung on to send Los Angeles to its sixth consecutive defeat, 107-103 Sunday night.\n\nBryant overcame another poor shooting night with two big late jumpers that reflected his vintage offensive skills. He still couldn't overcome Paul George, who scored the Pacers' final 11 points in the last 1:27 to finish with 39.\nBryant's quick-release 3-pointer from straightaway trimmed the lead to 104-103 for the Pacers, who had been up 22 in the second half. Lakers fans dared to dream of a storybook finish to a night that began with each fan receiving a letter from Bryant, thanking them for 20 years of support.\nBut after the Lakers got the ball back with a three-point deficit, Bryant's airball only underlined the worst shooting season of his career -- and a reason he won't look back when he's done.\n\"I've known for a while,\" Bryant said. \"A decision like this, you can't make that decision based on outside circumstances. It has to be an internal decision, and finally I've decided to accept that I can't actually do this anymore, and I'm OK with that. It takes a weight off my shoulders and everybody else's.\"\nGeorge carried the Pacers with nine free throws in the last 1:07 as Indiana opened a four-game West Coast road trip with its fifth straight victory despite blowing nearly all of that huge lead.\n\"He's still Kobe Bryant, regardless of how he shot the ball tonight,\" said George, a California native. \"We still had to look at him as the young Kobe when it came to crunch time. It was just a great moment being out there with him. Kobe was my Jordan (growing up), watching him win championships.\"\nJordan Clarkson had 22 points and a career-high 10 rebounds for the Lakers. Nick Young hit six 3-pointers while scoring 22 points.\nWEARY LEGS?\nThe rebuilding Lakers are off to a 2-14 start despite the relative health of Bryant, the team's career scoring leader and a five-time NBA champion. Bryant intends to play out the season, but the third-leading scorer in league history missed his first six shots and went 2 for 15 in the first half. He said the finality of the long-expected decision didn't affect his play.\n\"It's my first time playing back-to-back (games this season), so I felt drained for other reasons,\" he said.\nSOFT START\nBryant and the Lakers responded to the retirement announcement with one of their worst halves in a season full of ineptitude for both the superstar and his teammates. Los Angeles made just 11 of its 49 shots in the first half.\nHIBBERT'S REUNION\nLakers center Roy Hibbert had eight points and nine rebounds in his first meeting with his former teammates. The 7-footer spent his first seven NBA seasons with the Pacers, making two All-Star teams before leaving town last summer.\nHILL'S HOMECOMING\nIndiana big man Jordan Hill had six points and 10 rebounds in his first game back to face the Lakers. He spent 178 games with Los Angeles over the last four seasons before leaving as a free agent. He appeared in 12 playoff games in 2012.\nTIP-INS\nPacers: Indiana wore its Hickory High alternate uniforms made famous in \"Hoosiers\" for the Hollywood road game. ... The Pacers went 11-2 in November.\nLakers: Bryant's wife, Vanessa, and daughters Natalia and Gianna watched from courtside seats. ... Bryant is 18 for 76 in his last four games.\nUP NEXT\nPacers: At Clippers on Wednesday.\nLakers: At Philadelphia on Tuesday. L.A. begins an eight-game road trip in Bryant's former hometown.",
  "source": "espn_api",
  "crawled_at": 1764994308.244382
}