{
  "game_id": "0021500486",
  "espn_id": "400828373",
  "date": "Dec 31, 2015",
  "matchup": "DET vs. MIN",
  "headline": "Drummond powers Pistons past Timberwolves 115-90",
  "body": "AUBURN HILLS, Mich. --  With Andre Drummond and Reggie Jackson leading the way, coach Stan Van Gundy thinks the Detroit Pistons have a bright future.\n\nDrummond had 23 points and 18 rebounds and Jackson added 19 points and nine assists, leading the Pistons to a 115-90 victory over the Minnesota Timberwolves on Thursday night.\n\nHeading into 2015, Detroit had just eaten Josh Smith's contract and was buried in the Eastern Conference standings at 8-23. A year later, the Pistons are 18-15 and contending for the team's first postseason berth since 2009.\n\n\"We've obviously come a long way in the last 12 months,\" Van Gundy said. \"We've turned the roster around, and we've now got a group of guys who fit together on the floor and are all high-character individuals. There's a much better feel with this team.\"\n\nThe other difference is, unlike a year ago when Smith was just off the roster and Greg Monroe was on his way out, Van Gundy has a roster that isn't being rebuilt on a weekly basis.\n\n\"We've got a core here that we can keep together financially for an extended period, and we can do it in a way that will let us add on pieces in the next couple years,\" he said. \"A year ago, we were constantly looking at other rosters and salary sheets trying to find how we could upgrade ourselves a little bit. We don't have to do that now.\"\n\nDrummond came out with just over three minutes to play, narrowly missing his sixth 20-20 game of the season. Kentavious Caldwell-Pope scored 22 points for the Pistons, who had lost three in a row.\n\nKarl-Anthony Towns led the Timberwolves with 22 points and nine rebounds, while Andrew Wiggins had 21 points. Minnesota was coming off a 94-80 victory over Utah on Wednesday night.\n\n\"We tried to start the game focused and get off to a good start, but we just didn't have a lot of energy after the first quarter,\" point guard Ricky Rubio said. \"It just went downhill after the first quarter, and they started hitting shots. We couldn't get a stop, and they really hurt us.\"\n\nThe Pistons got off to another of the slow starts that have angered Van Gundy for the last several games, trailing 22-15 at the end of the first quarter.\n\nBut they bounced back in the second, holding Minnesota to 26.1 percent shooting while outscoring the Timberwolves 30-15 for the quarter. Drummond and Jackson then used the high pick-and-roll to get going in the third.\n\n\"It's tough when those big guys are hitting your guards 25 or 30 times a night,\" Minnesota coach Sam Mitchell said. \"They are just getting the wood laid on them, and that's why it is so important, going forward, to get stronger. That will make us a better basketball team.\"\n\nLate in the quarter, the Timberwolves resorted to the usual technique of intentionally fouling Drummond. He missed two foul shots, dropping him to 1 for 7 on the night, and was quickly replaced by Aron Baynes.\n\nDetroit had a 78-70 lead after three, and Anthony Tolliver and Stanley Johnson hit 3-pointers to help increase the advantage to 90-74 with 9:33 left.\n\nThe Pistons outscored the Timberwolves 100-68 over the final three quarters.\n\n\"We've had a lot of games in the last two weeks, and I think our guys just ran out of gas,\" Mitchell said.\n\nTIP-INS\n\nTimberwolves: With Minnesota playing for the second time in 22 hours, Kevin Garnett was given the night off. Gorgui Dieng replaced him in the starting lineup, with Damjan Rudez picking up extra minutes off the bench.\n\nPistons: Brandon Jennings received a long ovation from the crowd when he entered late in the first quarter. Because of his Achilles' tendon injury in January, it was his first appearance in a home game in 11 months and 10 days. He finished with seven points, six rebounds and three assists in 21 minutes.\n\nUP NEXT\n\nTimberwolves: Host Milwaukee on Saturday.\n\nPistons: Visit Indiana on Saturday.\n\nPARTISAN CROWD\n\nPalace crowds usually tend to favor Michigan State over Michigan, but the balance was tilted Thursday with a lot of Spartans fans staying home to watch the football team in the Cotton Bowl. At halftime, the Palace showed FOX Sports 1's countdown of the 10 best plays of 2015, and Michigan State's last-second win at the Big House was loudly booed.",
  "source": "espn_api",
  "crawled_at": 1764994932.325807
}