{
  "game_id": "0022000785",
  "espn_id": "401307578",
  "date": "Apr 08, 2021",
  "matchup": "OKC vs. CLE",
  "headline": "Sexton scores 27 points, Cavaliers beat Thunder 129-102",
  "body": "OKLAHOMA CITY -- — Collin Sexton scored 27 points and the Cleveland Cavaliers ended a five-game series losing streak to Oklahoma City, beating the Thunder 129-102 on Thursday night.\n\n\r\n                    Taurean Prince scored 22 points, Darius Garland added 21 and Kevin Love had 18 points and 11 rebounds for Cleveland. The Cavaliers broke open a tight game with an 11-0 run to begin the second half.\n\n\r\n                    The Cavaliers closed a stretch in which they played seven of eight games away from home with consecutive wins at San Antonio and Oklahoma City, the first time they have won two straight since road wins beating Philadelphia on Feb. 27 and Houston on March 1.\n\n\r\n                    Cleveland had assists on 35 of its 48 baskets, something that pleased coach J.B. Bickerstaff immensely.\n\n\r\n                    “That’s outstanding,” Bickerstaff said. “That’s ball movement. That’s execution. That’s unselfish play. It took us a minute to get there but defensively, I thought we were really good the last three quarters.\n\n\r\n                    “It was about the effort. It was about being in the right spots. It was just about executing our system over and over again and not thinking about the opponent. It’s ‘What are we doing when we’re playing well?’ I don’t think we did that until the second half.”\n\n\r\n                    Ty Jerome led the Thunder with a career-high 23 points. They have lost five straight and eight of their last nine. The losing streak is Oklahoma City’s longest since early in the 2014-15 season, when the Thunder dropped six straight games. Oklahoma City suited up only nine players against Cleveland.\n\n\r\n                    Cleveland led 65-61 after a wild first half that included 13 lead changes and eight ties. The Cavaliers held Oklahoma City scoreless for nearly four minutes to start the second half and went up 76-61 on a 3-pointer by Love.\n\n\r\n                    The Cavaliers’ lead never fell below double digits after that. They were up 93-75 entering the fourth quarter and led by as many as 29 points.\n\n\r\n                    “They obviously came out at halftime ready to go, way more so than us,” Oklahoma City coach Mark Daigneault said. “That’s when they opened the game up … and they sustained it and built on it as the game went on. I thought they just kind of wore us down.”\n\n\r\n                    Theo Maledon scored 14 points, and Moses Brown had 13 for Oklahoma City.\n\n\r\n                    NANCE UPDATE\n\n\r\n                    Larry Nance Jr. missed a fifth straight game for Cleveland with a mysterious illness that the team has said is not connected with COVID-19. Bickerstaff said Nance has lost nearly 20 pounds but that the player is making progress, although there isn’t yet a timetable for his return.\n\n\r\n                    “I try to leave the medical conversations to the experts, but from what I understand, my conversations, he’s feeling better, he’s progressing,” Bickerstaff said.\n\n\r\n                    TIP-INS:\n\n\r\n                    Cavaliers: Cleveland’s most recent win over Oklahoma City before Thursday came on Feb. 13, 2018 … Matthew Dellavedova had a season-high seven assists and since making his season debut on April 1, he has 22 assists and no turnovers … Sexton had his 34th game this season of 20 or more points, tying his career best for such games in a season, set in 2019-20.\n\n\r\n                    Thunder: Leading scorer Shai Gilgeous-Alexander missed his sixth straight game with plantar fasciitis in right foot … Oklahoma City committed 18 turnovers that led to 24 points for Cleveland … The Thunder scored 14 third-quarter points, their third-lowest total in that quarter this season.\n\n\r\n                    UP NEXT:\n\n\r\n                    Cavaliers: Host Toronto on Saturday.\n\n\r\n                    Thunder: Host Philadelphia on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764997076.47695
}