{
  "game_id": "0021600876",
  "espn_id": "400900282",
  "date": "Feb 26, 2017",
  "matchup": "MEM @ DEN",
  "headline": "Conley scores 31 as Grizzlies beat Nuggets 105-98",
  "body": "DENVER -- Some friendly advice from Zach Randolph to his point guard, Mike Conley -- shoot, shoot and shoot some more.\n\"No shot is a bad shot for him,\" Randolph said.\nConley scored 31 points, including 13 in the fourth quarter, and the Memphis Grizzles held off the Denver Nuggets 105-98 on Sunday.\n\"It's very important for him to be aggressive, especially coming out in the beginning,\" Randolph explained. \"We're going to fall behind them. How they go is how we go.\"\nThe other part of the \"they\" that Randolph referenced was Marc Gasol, who chipped in with 23 points and found his mark from long range by hitting three 3-pointers. Randolph did his part, too, with 20 points and 11 rebounds for Memphis, which snapped a two-game skid.\n\"I tried to do what I could to be aggressive,\" Conley said. \"Got some good looks early, got into a good rhythm, carried that into the third and fourth quarters.\"\nThe Grizzlies have won four straight in Denver -- an intriguing run, considering they're 9-32 all-time in the Mile High City.\nDanilo Gallinari had 24 points as Denver dropped to 0-12 this season when failing to reach 100 points. Then again, it's hard to score a ton of points against the Grizzlies given their grinding style of play.\n\"We didn't actually play our style. They made us play their style,\" Nuggets center Nikola Jokic said. \"If we continue to play like this we're not going to win many games, so we need to play better. A lot better.\"\nThe Grizzlies outscored the Nuggets 21-13 on second-chance points and outrebounded them 49-39. What's more, Memphis finished 22 of 25 from the free throw line.\nBefore the game, Memphis coach David Fizdale talked about needing someone outside the usual cast to step up down the stretch.\nOnce again, though, Conley raised his hand -- and game. He gave the Grizzlies the lead for good on a pair of free throws with 7:54 remaining, the start of a 7-0 run that gave them some separation.\n\"He's always under control, runs his team and makes the right play,\" Nuggets coach Michael Malone said. \"Him and Gasol are probably, in the NBA, the best point guard-center combo in the league. They proved it again tonight.\"\nJokic was more assertive after back-to-back shaky performances. He finished with 10 points, 11 rebounds and six assists.\nRight after the All-Star break, Jokic indicated he was feeling drained. Malone understands, but said everyone in the league is worn out this time of year.\n\"The great players and the great teams find a way to fight through it and get their second wind and get ready for the postseason,\" said Malone, whose team is narrowly holding onto the final playoff spot in the West. \"I hope that's what our guys can do.\"\nTIP-INS\nGrizzlies: G/F Vince Carter picked up a technical late in the second quarter. ... F/C Brandan Wright wasn't with the team for personal reasons. ... F JaMychal Green had 10 rebounds.\nNuggets: All five starters scored in double figures. ... F Kenneth Faried didn't play due to a sore lower back. ... C Roy Hibbert was in uniform after being acquired from Milwaukee at the trade deadline. He didn't get into the game.\nNEW ROLE\nEmmanuel Mudiay has dealt with a troublesome back, inconsistent play and now a demotion. Usually a starter since being taken with the seventh overall pick in the 2015 draft, he's backing up Jamal Murray and Jameer Nelson. Mudiay didn't play Sunday.\n\"My message to him is this is not set in stone,\" Malone said. \"A lot of things can change -- continue to work and continue to stay ready.\"\nBOUNCE-BACK WIN\nConley wanted to see the way the Grizzlies would rebound from a 102-92 loss at Indiana on Friday in which they trailed by 27 points. He appreciated what he saw.\n\"With a team that doesn't play well through adversity, you could easily come in here and lose by 20 again against a very good, young team,\" Conley said. \"I thought we handled ourselves very well.\"\nUP NEXT\nGrizzlies: Host Phoenix on Tuesday as Memphis tries to complete a season sweep of the Suns.\nNuggets: Open a two-game road swing Tuesday in Chicago.",
  "source": "espn_api",
  "crawled_at": 1764995580.894114
}