{
  "game_id": "0022300078",
  "espn_id": "401584706",
  "date": "Oct 27, 2023",
  "matchup": "MEM vs. DEN",
  "headline": "Nikola Jokic, Jamal Murray lead Denver past Memphis 108-104",
  "body": "MEMPHIS, Tenn. -- — Nikola Jokic had 22 points, 12 rebounds and seven assists, Jamal Murray also had 22 points and the Denver Nuggets thwarted a fourth-quarter rally to defeat the Memphis Grizzlies 108-104 on Friday night.\n\n\r\n              Reggie Jackson added 16 points for the defending champions as Denver won its second straight to open the season. But it wasn't easy as the Grizzlies were able to overtake the Nuggets in the fourth before Denver closed out the game.\n\n\r\n              “That's their identity,” Murray said. “That's how they win games and make it tough. (Memphis) did a good job of playing physical and staying within striking distance all game.”\n\n\r\n              Jaren Jackson Jr. led Memphis with 21 points, nine rebounds and three blocks, while Marcus Smart finished with 20 points, five assists and five steals.\n\n\r\n              Desmond Bane had 15 points despite going 4 of 17 from the floor and 1 of 10 from 3-point range.\n\n\r\n              “It's a challenge.” Smart said of the chemistry needed to close out games. “This is a work in progress. Everybody is learning.”\n\n\r\n              Memphis took a 98-97 lead midway through the fourth, but Jokic's 3-pointer and an offensive putback by the Denver center came on either side of a 3-pointer by Murray as the Nuggets retook the lead for good.\n\n\r\n              “We had some good looks at the end, but credit the Nuggets defense, They made it tough,” Memphis coach Taylor Jenkins said. “We got our chances and didn't convert.”\n\n\r\n              Memphis continued to be thin on the frontline with center Steven Adams and reserve forward Brandon Clarke out with injuries for the bulk of the season, and potential starter Santi Aldama nursing a sprained ankle. The offensive punch was also limited by Ja Morant's 25-game suspension to start the season.\n\n\r\n              Both teams started poorly. By the midway point of the first quarter, they were a combined 5 of 24 from the field and had missed all 10 3-pointers taken to that point in the game. \n\n\r\n              The shooting improved and Denver held a 61-56 lead at halftime.\n\n\r\n              The Grizzlies spent much of the night scrambling to stay in the game, keeping the deficit in single digits.\n\n\r\n              At the midway point of the fourth, a steal and layup by Derrick Rose brought Memphis within 95-93. The Grizzlies overtook the Nuggets on Rose's leaner in the lane for a 98-97 lead with 4:28 left. Denver outscored Memphis 11-6 the rest of the way.\n\n\r\n              Denver coach Michael Malone said his team as the reigning league champion can expect every team's best effort.\n\n\r\n              “Everybody wants to come out and beat the champs,” Malone said pregame. It was a theme he repeated after leaving with a win.\n\n\r\n              “Everybody's going to get up for us,” Malone said. “We're not going to get an effort of ‘Oh, it’s Denver.' No, it will be ‘The champs are coming to town.’ ”\n\n\r\n              Both coaches saw improvement from the season-opener — a win for the Nuggets over the Lakers and the Grizzlies losing to New Orleans.\n\n\r\n              “Big step in the right direction,” Jenkins said. \"This was a great test for us.\"\n\n\r\n              As for Malone, he saw his team maintain their poise down the stretch after being overtaken by the Grizzlies.\n\n\r\n              “If you are going to be them, you are going to have to earn it,” he said. “And that's what we did.”\n\n\r\n              ------\n\n\r\n              UP NEXT\n\n\r\n              NUGGETS: At Oklahoma City on Sunday\n\n\r\n              GRIZZLIES: At Washington to face the Wizards on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996520.162128
}