{
  "game_id": "0022000884",
  "espn_id": "401307684",
  "date": "Apr 21, 2021",
  "matchup": "TOR vs. BKN",
  "headline": "Raptors ride strong 3rd quarter to 114-103 win over Nets",
  "body": "TAMPA, Fla. -- — Pascal Siakam had 27 points and nine rebounds, OG Anunoby scored 25 points and the Toronto Raptors seized control in the third quarter in a 114-103 victory over the Brooklyn Nets on Wednesday night, extending their winning streak to four games.\n\n\r\n                    Kyrie Irving had 28 points, 11 rebounds and eight assists, and Bruce Brown added 21 points and 14 rebounds for the Nets, who again played without the injured Kevin Durant.\n\n\r\n                    “It's obviously a difficult situation, but a lot of teams are playing short-handed. You've got to play with the guys who are there,” said Joe Harris, whose hot shooting got the Nets off to a good start. “At the start of the second half, we let them go on a few different runs.”\n\n\r\n                    Playing at close to full strength for the first time in weeks with the return of veteran guards Kyle Lowry and Fred VanVleet, Toronto made 13 of 24 shots (54%) and outscored the Nets 36-23 in the third quarter.\n\n\r\n                    “OG got us going early, then Pascal got it going and we just continued to get better throughout the game,” Lowry said. “We figured it out.” \n\n\r\n                    “The chemistry built throughout the game,” coach Nick Nurse said. “I thought our guys did a really good job of adjusting. Obviously, we were creating a lot of good shots. I think it was a good step forward.”\n\n\r\n                    Jeff Green hit a 3-pointer and Irving followed with two in the final minutes of the first quarter, propelling the Nets to a 13-point lead, their largest of the game.\n\n\r\n                    Toronto stormed ahead in the first eight minutes of the second half, hitting seven of its first nine 3-point shots and outscoring the Nets 34-14 to lead 90-72.\n\n\r\n                    The Nets were down by eight early in the fourth quarter when Freddie Gillespie blocked a layup by Joe Harris, igniting a 7-0 run that put the Raptors up 104-89 with 7:37 left.\n\n\r\n                    Irving and Brown helped the Nets cut the gap to five with 3:01 left, but they got no closer.\n\n\r\n                    Raptors power forward Chris Boucher was helped off the floor with an ankle injury with 10:53 remaining.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Durant missed a second full game after aggravating his thigh injury in the first quarter Sunday at Miami. Durant, who has missed 35 of Brooklyn's 59 games, might play this weekend, according to coach Steve Nash. ... In the first nine minutes of the game, Harris was 4 for 4 from behind the arc while the rest of the Nets were 0 for 7. The Nets finished 13 for 41. \n\n\r\n                    Raptors: The Raptors used a different starting lineup for an eighth straight game. ... Gillespie had five of Toronto's eight blocks. . . . Mike Evans, Chris Godwin and Justin Watson of the Tampa Bay Buccaneers, all wearing Raptors/Siakam jerseys, were given a scoreboard introduction. Godwin held a replica of the Vince Lombardi trophy. ... G-F Rodney Hood (knee) and G-F Paul Watson (knee) were inactive. \n\n\r\n                    NORMAL MINUTES\n\n\r\n                    Siakam, Lowry and VanVleet, who were among NBA leaders in minutes before their injuries came, were active together for the first time in 12 games. The Raptors went 6-5 in that stretch. Nurse predicted “normal minutes for Kyle and Fred, but not normal Kyle and Fred minutes.” Both played 35 minutes, and Siakam played 37.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Play at Indiana on Friday night.\n\n\r\n                    Raptors: Play at New York on Saturday afternoon.\n\n\r\n                    ------\n\n\r\n                     More AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764996822.2329128
}