{
  "game_id": "0021600367",
  "espn_id": "400899809",
  "date": "Dec 12, 2016",
  "matchup": "LAL @ SAC",
  "headline": "Kings use 39-point third quarter to beat Lakers 116-92",
  "body": "SACRAMENTO, Calif. --  Luke Walton will back his players every time, and when no whistle came as DeMarcus Cousins took down Julius Randle early in the game the new Lakers coach got crazy mad.\n\nAs in having to be held back as he made his way to midcourt before a pair of technical fouls in succession led to an ejection -- two of seven total Ts in a testy game.\n\n\"I just felt like I needed to stand up for my guys,\" Walton said. \"I felt like what happened on the floor wasn't right and my only concern is our guys and the locker room and our team. If I feel like something's not right I'm going to stand up for my guys.\"\n\nCousins had 31 points, 16 rebounds, five assists and three blocks, and the Sacramento Kings used a big third quarter to send slumping Los Angeles to a seventh straight defeat with a 116-92 win Monday night.\n\nAfter five straight points by Cousins during one sequence, Darren Collison hit consecutive 3-pointers late in the third as the Kings outscored the Lakers 39-13 in the quarter on the way to just their second victory in seven games. Collison wound up with 20 points.\n\nWalton was ejected at the 4:14 mark of the first quarter, and he had to be held back by his players. Randle sure appreciated it.\n\n\"Ahh, I love my coach, man,\" Randle said. \"That's my guy. He backs me up with everything. He has all of our backs 100 percent.\"\n\nRandle also received a T on the play and associate head coach Brian Shaw took over. D'Angelo Russell, Shaw, Cousins and Lou Williams also had technicals.\n\nThe Lakers got Russell and Nick Young back for Sunday's 118-112 home loss to the Knicks, but their minutes were limited again Monday.\n\nRussell scored 17 points while Jordan Clarkson and Williams contributed 15 and 14 points, respectively, off the bench. Young had eight points as Los Angeles lost for the eighth time in nine games. The Lakers played the second game of a back-to-back while kicking off a seven-game, 13-day road trip.\n\n\"I thought guys grabbed each other and came out in the third with a lot of energy against a team playing the second night of a back-to-back,\" Kings coach Dave Joerger said.\n\nRussell had missed 12 of 13 games with left knee soreness and Young returned after sitting out seven of nine with a strained calf.\n\nThis was already the Lakers' second visit to new Golden 1 Center, where they won 101-91 on Nov. 10 after trailing by 19 in the second quarter.\n\n\"I felt like for the first time this season we kind of gave in, we gave up, which is disheartening because our group has been very resilient all year long,\" Walton said.\n\nKings guard Ben McLemore was helped off the court with a bruised left quadriceps at the 7:35 mark of the first quarter after getting a knee on Mozgov's screen. He didn't return.\n\nWALTON'S SUPPORTING CAST\n\nAs Walton experiences the bumps and losing streaks, he has leaned on old boss Steve Kerr of the Warriors, Phil Jackson and even his dad, Bill. He also is so thankful to have Shaw on his staff -- he mentioned it before the game and ejection -- since he has been through it all as a head coach.\n\n\"We're all in it together and we're taking accountability in leading as well,\" Walton said.\n\nTIP-INS\n\nLakers: Walton increased his technical total to three and the Lakers had six in all. ... Los Angeles is 4-10 on the road.\n\nKings: Cousins had his 10th 30-point game. ... F Rudy Gay headed to the locker room 3:50 before halftime with a hip flexor. ... G Matt Barnes had the night off for planned rest and wasn't in uniform. ... Sacramento Mayor Kevin Johnson sat courtside in suit and tie and was honored during a second-quarter ceremony with a signed basketball for his efforts getting new Golden 1 Center built.\n\nUP NEXT\n\nLakers: At Brooklyn on Wednesday as their season-high road trip goes East for the rest of the way before returning Dec. 24 ahead of a Christmas Day game with the Clippers.\n\nKings: At Houston on Wednesday. The Kings lost 117-104 at home to the Rockets on Nov. 25.",
  "source": "espn_api",
  "crawled_at": 1764995426.682998
}