{
  "game_id": "0022100741",
  "espn_id": "401360560",
  "date": "Jan 28, 2022",
  "matchup": "IND @ OKC",
  "headline": "Sabonis has triple-double, leads Pacers past Thunder in OT",
  "body": "OKLAHOMA CITY -- — The Indiana Pacers had to change things up.\n\n\r\n              They had just given up 158 points in a home loss to Charlotte on Wednesday night, a franchise record for points allowed and the most any team has given up this season. \n\n\r\n              Indiana often skips game day practices on the road to save energy. But before Friday's game against the Oklahoma City Thunder, Indiana coach Rick Carlisle had his players focus on staying in front of their opponents during their shootaround. \n\n\r\n              The Pacers bounced back with a gritty performance. Domantas Sabonis had 24 points, 18 rebounds and 10 assists and the Pacers outlasted the Thunder 113-110 in overtime.\n\n\r\n              “It was much needed,” Pacers coach Rick Carlisle said. “To have a game like that (loss to Charlotte) in our building in front of our fans is not what we want to experience. It was tough.\"\n\n\r\n              Sabonis had his fifth triple-double of the season and 18th overall.\n\n\r\n              Justin Holiday added 22 points to help the injury-plagued Pacers snap a three-game losing streak. Guard Malcolm Brogdon, Indiana’s No. 2 scorer with 18.5 points per contest, missed his fourth straight game with a sore right Achilles. Center Myles Turner missed his seventh straight game with an injured left foot.\n\n\r\n              “In a season like this where so much has gone against us, this was a game that was a microcosm of the things going against us,\" Carlisle said. \"But the guys just kept fighting and got the win. And so I’m really happy for them.”\n\n\r\n              Lu Dort scored 27 points, and Josh Giddey added 15 points and 10 rebounds for the Thunder. Shai Gilgeous-Alexander, Oklahoma City's leading scorer this season, sprained his right ankle early in the third quarter and did not return. He was seen after the game on crutches and in a boot. Thunder coach Mark Daigneault said after the game that the team would know more on Saturday.\n\n\r\n              The Thunder led 54-51 at halftime behind 11 points from Dort and 10 from Darius Bazley.\n\n\r\n              Oklahoma City opened the second half on a 12-0 run, holding the Pacers scoreless for more than four minutes. The Thunder led 80-73 heading into the fourth.\n\n\r\n              Sabonis' putback with just under a minute remaining in regulation tied the score at 100, and no one scored the rest of the period.\n\n\r\n              Dort hit 3-pointers on back-to-back possessions to give Oklahoma City a 108-102 lead.\n\n\r\n              The Pacers rallied, and a steal and layup by Holiday put the Pacers ahead 111-110 with 40.8 seconds to play. Holiday made two free throws with 6.5 seconds left to give Indiana a 113-110 lead.\n\n\r\n              Oklahoma City's Kenrich Williams made a 3-pointer that appeared to tie the game, but the Pacers had fouled another player intentionally before the shot. Oklahoma City's Mike Muscala missed his first free throw accidentally. He missed the second intentionally, but the Thunder couldn't come up with the ball, and Indiana held on.\n\n\r\n              Carlisle said the plan to foul before the shot went up was well executed.\n\n\r\n              “If you if you do it successfully, there are a string of events that need to happen for the team to be able to tie the game,\" he said. \"They’re going to need to miss a free throw, they’re need to get the rebound, they’re going to need to find an open player and they’re going to need to get the ball a basket. And if you don’t do that, you leave a lot to chance because NBA players do amazing things in the last 6.5 seconds of a game.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Sabonis was cheered during pregame introductions when he was announced as a starter for the Pacers. He started his NBA career with the Thunder in 2016 and he played with the team for one season before getting traded. ... Lance Stephenson scored 14 points.\n\n\r\n              Thunder: Center Derrick Favors sat out with lower back soreness. ... Muscala hit a 3-pointer in the closing seconds of the first quarter to give Oklahoma City a 30-29 lead. ... Bazley scored 14 points.\n\n\r\n              QUOTABLE\n\n\r\n              Carlisle: “It was a night of many, many frustrations. But in the end, it was a night of great joy because of how the guys stuck to it and stuck together. \n\n\r\n              DOUBLE CHECKING\n\n\r\n              The game featured three reviews in a four-minute span in the third quarter.\n\n\r\n              “I thought the third quarter just got a little clunky,” Daigneault said. “There were a bunch of reviews. It kind of broke the rhythm, I thought, for both teams\"\n\n\r\n              ROUGH SHOOTING\n\n\r\n              Caris LeVert made just 3 of 19 shots and finished with 10 points. For the season, he averages 18 points on 43.5% shooting.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Dallas on Saturday.\n\n\r\n              Thunder: Host Portland on Monday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993029.128027
}