{
  "game_id": "0022200797",
  "espn_id": "401468952",
  "date": "Feb 04, 2023",
  "matchup": "MIA @ MIL",
  "headline": "Antetokounmpo has triple-double; Bucks win 7th straight",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had a triple-double with 35 points, 15 rebounds and 11 assists and the Milwaukee Bucks beat the short-handed Miami Heat 123-115 on Saturday night for their seventh straight victory.\n\n\r\n              “You kind of know what to expect from the Miami team,\" Antetokounmpo said. “We’ve played them so many times. I’ve played them so many times throughout my years. They’re going to help one another. They're going to be aggressive on defense. You’ve just got to make the right pass, just keep oon being aggressive and making as many good decisionsn as you can throughout the game.\"\n\n\r\n              Jimmy Butler scored 32 points and Tyler Herro added 24 for the Heat, who had just nine available players. Notable injured Miami players included Kyle Lowry (sore left knee) and Victor Oladipo (sprained right ankle).\n\n\r\n              Antetokounmpo had his third triple-double of the season and 32nd of his career. The 11 assists matched his season high.\n\n\r\n              “We know that Miami’s going to throw a lot of people at him, a lot of bodies,” Bucks coach Mike Budenholzer said. “He’s got to be willing to pass and play with is teammates, and we’ve got to make shots. I think he did that. It starts with him being aggressive, him drawing extra defenders. His teammates have got to make plays around him. We did enough of that, had enough defense, particularly in the fourth quarter, to grind out a win tonight.”\n\n\r\n              Antetokounmpo had 26 points, 14 rebounds and 11 assists in a victory at Minnesota on Nov. 4. He had 30 points, 21 and 10 assists in an overtime win at Toronto on Jan. 4.\n\n\r\n              The two-time MVP's latest triple-double came two nights after he scored 54 points in a 106-105 victory over the Los Angeles Clippers. During the Bucks' winning streak, Antetokounmpo is averaging 39.4 points, 14.7 rebounds and 5.0 assists.\n\n\r\n              Khris Middleton scored a season-high 24 points and put the Bucks ahead for good with a tiebreaking buzzer beater to end the third quarter. Grayson Allen added 19, Jrue Holiday 15 and Pat Connaughton 14. \n\n\r\n              “They're a great team, so they're going to find ways to change the rhythm of the game, change the pace a little bit, figure out a way to get back in the game,” Middleton said. “They did. ... We were just able to sustain the things we were doing and not let their changes affect us as much.”\n\n\r\n              The Bucks gained a measure of revenge after losing consecutive games in Miami on Jan. 12 and 14. Antetokounmpo didn’t play in either of those games.\n\n\r\n              Miami’s Gabe Vincent had a career-high 28 points in one of the Heat’s victories over the Bucks and 27 in the other. Vincent had just seven points Saturday while shooting 3 of 9.\n\n\r\n              The loss completed a 1/3 road swing for the Heat.\n\n\r\n              “You definitely have to go home disappointed,” Heat coach Erik Spoelstra said. “You have to maximize every opportunity when you're on a road trip like this. It's hard to win on the road. We'll gather ourselves.”\n\n\r\n              TIP-INS\n\n\r\n              Heat: This game represented a homecoming for Herro, who had his jersey retired Friday night at nearby Whitnall High School in Greenfield. Herro’s Heat teammates and Spoelstra attended the ceremony. Earlier this season, they attended a similar ceremony when Heat veteran Udonis Haslem got his jersey retired at Miami High. “The guys really do care about each other and want to support each other,” Spoelstra said before the game. “You also love seeing guys back in their old environment.”\n\n\r\n              Bucks: Now that they’ve finished a four-game homestand, the Bucks are about to begin a demanding stretch of their schedule. They go on a three-game West Coast trip before returning home to face the Eastern Conference-leading Boston Celtics on Feb. 14.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Indiana on Wednesday night.\n\n\r\n              Bucks: At Portland on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993947.689884
}