{
  "game_id": "0021800092",
  "espn_id": "401070773",
  "date": "Oct 29, 2018",
  "matchup": "TOR @ MIL",
  "headline": "Sans Freak, Bucks top Raptors to be last NBA undefeated team",
  "body": "MILWAUKEE --  No Giannis Antetokounmpo, no problem for the Milwaukee Bucks.\n\nWith the way they're shooting from the 3-point line, the Bucks look like they can beat just about anybody in the NBA.\n\nErsan Ilyasova scored a season-high 19 points and the Bucks cruised without the injured Antetokounmpo to beat the Toronto Raptors 124-109 on Monday night in a showdown of the NBA's last undefeated teams.\n\nMilwaukee improved to 7-0 in a marquee matchup that lost some luster with Antetokounmpo in concussion protocol and Raptors star Kawhi Leonard sitting out to rest.\n\nThe Bucks' start to the season matches the 1971-72 club for best in franchise history. Milwaukee made up for Antetokounmpo's absence with another strong showing from the perimeter, with Malcolm Brogdon and Eric Bledsoe chipping in 17 points each.\n\n\"Of course we have more confidence when (Antetokounmpo) is on the floor,\" Brogdon said. \"But we have a lot of confidence even when he's not on the floor due to the system and due to the confidence that (coach Mike Budenholzer) gives us.\"\n\nSerge Ibaka scored 30 points for Toronto, which had its franchise-best 6-0 start snapped. Pascal Siakam added 22.\n\nThey still couldn't keep up with the Bucks, who eclipsed the 110-point mark for the seventh straight game even without the high-flying Antetokounmpo, who averages 25.0 points and 14.2 rebounds.\n\nIlyasova, starting for Antetokounmpo, helped pick up the slack, setting the tone with an active night all over the floor and adding a team-high 10 rebounds.\n\nThe Bucks didn't stop moving when they had the ball either, especially at the 3-point line. Milwaukee's 19 3-pointers tied a franchise record which was previously reached just three days ago against Minnesota.\n\n\"They dictated the tempo of the game tonight,\" Raptors guard Kyle Lowry said.\n\nIt was the first game in NBA history between teams with a record of 6-0 or better, according to the Elias Sports Bureau.\n\nFIRE AWAY\n\nBudenholzer wants his team to hoist 3-pointers, and an 11-3 run in the fourth quarter sparked by two 3s from Khris Middleton helped turn a 15-point advantage into a 113-90 lead with 7:39 left.\n\nThe philosophy calls for 3s and proper spacing among the five players on the floor to help create 1-on-1 opportunities for Antetokounmpo.\n\nIt's working without him, too. Seven players scored in double figures.\n\n\"When they see advantages, they are seeing opportunities within the confines of what we do and still trying to play unselfishly,\" Budenholzer said.\n\nNO HELP\n\nRaptors coach Nick Nurse said his team needed better help defense to stop the Bucks' cuts and straight-line drives. When the Bucks weren't taking it straight to the hoop, they were kicking the ball out for perimeter shots.\n\n\"It's a little difficult with the five-out spacing to get adjusted,\" Nurse said. \"It's not easy to guard the ball 1-on-1 in this league. It gets harder all the time.\"\n\nGOING COLD\n\nThe Bucks' defense tightened after allowing the Raptors to start 12 of 17 (70 percent) from the floor with 2:37 left in the first quarter.\n\nToronto went on to shoot 31 percent from that point to the fourth quarter, when the Bucks' lead swelled to 15.\n\n\"When you're trying to get back in it and they don't go in you automatically say, `Aw man, they're shooting too much,\" Nurse said. \"But I really thought we fought and tried to stay in it.\"\n\nTIP INS\n\nRaptors: Leonard was expected to sit out just Monday's game. ... Toronto went about a four-minute stretch between the first and second quarters shooting 1 of 10 from the floor to fall behind by nine with 10:06 left in the second.\n\nBucks: Antetokounmpo was injured Saturday against Orlando. ... Ilyasova (14 points) and Thon Maker (11) were active up front in the first half to help make up for the absence of Antetokounmpo, who cheered on his teammates one row behind the bench. ... Asked what he was most surprised by in the Bucks' fast start, Budenholzer said \"I'm not a big surprise guy. I'm just happy with the way they've worked every day. It's been a good steady work ethic.\"\n\nUP NEXT\n\nRaptors: Return home to host the Philadelphia 76ers on Tuesday.\n\nBucks: Visit the Celtics on Thursday in rematch of first-round playoff series last year won by Boston in seven games.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994125.198963
}