{
  "game_id": "0021600890",
  "espn_id": "400900296",
  "date": "Feb 28, 2017",
  "matchup": "DET vs. POR",
  "headline": "Morris, Pistons outlast Portland 120-113 in OT",
  "body": "AUBURN HILLS, Mich. -- The Detroit Pistons rallied for another win after trailing by double digits.\n\"That's not a good formula,\" coach Stan Van Gundy said. \"I applaud our resilience. ... To be good, I'd like to play a more solid game from beginning to end.\"\nMarcus Morris scored a career-high 37 points, including Detroit's first seven in overtime, and the Pistons rallied from a 13-point, third-quarter deficit to beat the Portland Trail Blazers 120-113 on Tuesday night.\nIsh Smith had 12 points, seven assists and seven steals for the Pistons, who pulled within one game of seventh place in the Eastern Conference.\nDamian Lillard had 34 points and 11 rebounds for Portland while falling an assist shy of his first triple-double. He had only one assist after the start of the fourth, however, and the Trail Blazers were eventually done in by turnovers.\n\"We've always been a team that takes care of the ball, but that's not happening right now,\" Lillard said. \"We can't give the ball away all the time and expect to win games, especially on the road.\"\nSmith was scoreless heading into the fourth quarter but gave Detroit a huge lift down the stretch. The Pistons came back from an 18-point deficit to beat Charlotte on Thursday, and they rallied from 16 down to win at Toronto on Feb. 12.\n\"We're playing with a lot of fight,\" Detroit's Andre Drummond said. \"We're not out of the game, ever. When things get tough, we really come together.\"\nC.J. McCollum scored 25 points for Portland.\nThe Pistons trailed 75-62 in the third before closing that quarter on a 13-4 run. It was Portland that had to rally late in the fourth, and Lillard's driving layup with 2.8 seconds left tied it at 109 and forced overtime.\nMorris opened the scoring in overtime with a 15-footer, and after Portland tied it on a layup by Maurice Harkless, Morris answered with a three-point play and an 18-footer to make it 116-111.\n\"He's a great one-on-one player, especially because of his high release, and it is tough to double him in that offense because they can get him the ball in so many different places,\" Portland coach Terry Stotts said. \"When he's hitting from the perimeter, it is tough to stop him.\"\nTIP-INS\nTrail Blazers: Portland was without Evan Turner (right hand) and Festus Ezeli (left knee). ... Jusuf Nurkic scored 19 points.\nPistons: Detroit completed a season sweep of Portland, and both games went beyond regulation. The Pistons beat the Trail Blazers 125-124 in double overtime on Jan. 8. ... Drummond had 19 points and 15 rebounds.\nTHROWING IT AWAY\nPortland finished the game with 24 turnovers to Detroit's eight. The Pistons outscored the Trail Blazers 21-11 in points off turnovers, and sloppiness with the ball was about the only thing slowing Portland on a night it shot 52 percent from the field.\nMcCollum had six turnovers and Lillard had four.\nRARE MISS\nThe Pistons caught a break late in the fourth quarter. Detroit was up by two and had the ball when Kentavious Caldwell-Pope missed a shot, giving Portland possession with 10.8 seconds left. Caldwell-Pope, who apparently felt he'd been fouled, was whistled for a technical foul.\nLillard, a 90-percent shooter from the line, missed the free throw, and his layup moments later only tied the game instead of putting Portland up one.\n\"We got very, very fortunate there,\" Van Gundy said. \"I don't even think I need to say much. I think he knows that's a point at which you can't get a technical. You have to walk away, no matter how upset you are.\"\nMcCollum and Lillard had both been called for technicals earlier in the second half.\nUP NEXT\nTrail Blazers: Host the Oklahoma City Thunder on Thursday night.\nPistons: Visit the New Orleans Pelicans on Wednesday night. Detroit beat New Orleans 118-98 on Feb. 1.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764996040.236714
}