{
  "game_id": "0022300320",
  "espn_id": "401584948",
  "date": "Dec 14, 2023",
  "matchup": "MIA vs. CHI",
  "headline": "Bulls run out to huge lead, then hang on to beat Heat 124-116",
  "body": "MIAMI -- — The Chicago Bulls started the night by doing something their franchise hadn't seen since the Michael Jordan era.\n\n\r\n              They ended up doing something that not even Jordan's great teams did.\n\n\r\n              A 33-8 run to start the game set the tone, and the Bulls just made the Miami Heat try in vain to catch them the rest of the way. Coby White scored 26 points, reserve Ayo Dosunmu added 24 and the Bulls topped the Heat 124-116 on Thursday night.\n\n\r\n              “Really pleased with the way they came out,” Bulls coach Billy Donovan said.\n\n\r\n              Nikola Vucevic finished with 24 points, 12 rebounds and seven assists for the Bulls. White had 11 assists and seven rebounds, while DeMar DeRozan scored 23 for Chicago.\n\n\r\n              The 25-point lead in the first quarter was the biggest by Chicago since Jordan and the Bulls led Golden State by 27 in the opening period of a game on Jan. 31, 1997. And the final scoring numbers — four players with at least 23 points — was something that no Bulls team had done since 1969.\n\n\r\n              “They made a lot of shots,” Heat guard Kyle Lowry said. “Give them credit. They came out super-high energy.”\n\n\r\n              Jaime Jaquez Jr. scored 22 for Miami, which was playing on the second night of a back-to-back. Jimmy Butler scored 20, Lowry and Caleb Martin each had 17, and Kevin Love had 16 for the Heat.\n\n\r\n              Chicago's 25-point lead in the opening quarter was the second-largest such edge in the NBA this season — Boston led Washington by 26. But after that, the Miami comeback tries started. Many of them, in fact.\n\n\r\n              Miami got it down to 14 by the end of the first quarter. Chicago then ran the lead back out to 24 and the Heat rallied again — a 27-7 run helped them get within 60-56 at halftime.\n\n\r\n              The trend never stopped. Miami was within three early in the third; the Bulls went on a burst to get the lead back to 14. The Heat closed to 105-101 on a layup by Lowry with 7:10 left; Chicago quickly pushed the lead back to 11.\n\n\r\n              Back they came again — Butler made a free throw with 2:46 left to cut the lead to 113-109. But Dosunmu hit a 3-pointer on the next Chicago possession, and that was the last gasp for the Heat.\n\n\r\n              “You do have to credit them,” Heat coach Erik Spoelstra said. “They jumped all over us. ... We didn’t start the game with a lot of juice and we’re not going to make any excuses about it.”\n\n\r\n              Alex Caruso returned to the lineup for Chicago — and then quickly departed again with another injury.\n\n\r\n              Caruso had missed the Bulls’ last two games with a sprained left ankle. He started Thursday and had six quick points, then got tangled with Vucevic just 4:45 into the game and hurt the same ankle. He went into the locker room for evaluation and was ruled out for the rest of the game.\n\n\r\n              “I don't want to say he injured it the same way,\" Donovan said. “But the injury that he was dealing with in his foot, it's the same spot.”\n\n\r\n              Miami was again without Bam Adebayo (hip), Josh Richardson (back spasms), Haywood Highsmith (back) and Tyler Herro (ankle). But Herro — who has missed 17 consecutive games — said he could return as soon as Monday’s game against Minnesota that will end a four-game Heat homestand.\n\n\r\n              UP NEXT\n\n\r\n              The teams play again Saturday in Miami, their fourth and final meeting of the regular season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995371.1817741
}