{
  "game_id": "0021800139",
  "espn_id": "401070820",
  "date": "Nov 04, 2018",
  "matchup": "TOR @ LAL",
  "headline": "Ibaka's career-high 34 sends Raptors past Lakers, 121-107",
  "body": "LOS ANGELES --  Serge Ibaka outscored the Lakers by himself in the first quarter, and he didn't miss a shot until the third. He beat LA inside and outside on the way to the biggest offensive game of his career.\n\nThanks to Ibaka's brilliance for the Toronto Raptors, Kawhi Leonard wasn't missed by anyone except the Lakers fans who might have been hoping to entice him home.\n\nIbaka made his first 14 shots on the way to a career-high 34 points, and the Raptors didn't need an injured Leonard in a 121-107 victory over Los Angeles on Sunday night.\n\nIbaka had 10 rebounds and didn't miss a shot until 5:16 remained in the third quarter, finishing 15 of 17. He was overpowering while the Raptors jumped to a stunning 31-point lead in the first quarter, and he returned in the final minutes to close out Toronto's eighth consecutive win over the Lakers.\n\n\"I was just focused,\" Ibaka said. \"I knew Kawhi was out tonight, so I just wanted to go out there and do my best.\"\n\nWith the Lakers' small lineups struggling to contain Ibaka early on, he became the first player to start a game 14 of 14 from the field since Shaquille O'Neal did it in February 2006, according to the NBA.\n\n\"That's pretty cool,\" Toronto coach Nick Nurse said. \"The best thing is he's doing it with some real good composure. He's getting in there and taking his time. He's using his size, his power, and using pretty good footwork, so it's something we can go to.\"\n\nKyle Lowry added 21 points and 15 assists for the Eastern Conference-leading Raptors, who haven't lost to the Lakers since 2014.\n\n\"We really wanted to put some pressure on them and guard the ball,\" Nurse said. \"We got off to an unbelievable start. We looked athletic and fast all over the place tonight.\"\n\nToronto didn't let its huge lead dwindle significantly until the final minutes, when the Lakers' youngster got the margin down to 117-107 with LeBron James on the bench. Toronto was forced to re-insert its starters in the final minutes to preserve the win.\n\n\"They've been playing like they're the best team in the Eastern Conference so far,\" said James, who finished with 18 points and six assists. \"They just came out and hit us right in the mouth, and it's going to be very hard to make a game of that when you're trying to expend so much energy to get back into it.\"\n\nKyle Kuzma scored 24 points and Brandon Ingram added 16 for the Lakers, who are 4-6 after their first 10 games with James after this defeat on the tail end of a back-to-back set that began with a gritty win in Portland on Saturday night.\n\n\"In my experience, unfortunately, most of the time when a player like Kawhi sits out, that team ends up winning,\" Lakers coach Luke Walton said. \"There's a sense of freedom and joy that comes when a top player like that is out. We tried to explain that that's part of how this works, but it doesn't seem like we took that to heart.\"\n\nTIP-INS\n\nRaptors: Leonard has sat out three of his first 10 games with Toronto, missing two games last month to manage his workload coming back from last season's injury struggles. He injured his foot late in the Raps' win at Phoenix on Friday night. Nurse doesn't know whether Leonard will play Monday at Utah. ... OG Anunoby took Leonard's spot in the starting lineup and contributed seven points.\n\nLakers: Starting with their fourth-quarter slump in Portland, the Lakers were outscored 75-34 in a 21:16 stretch spanning the two games. ... Fans at courtside included Denzel Washington, Kristen Bell, Dax Shepard, Ariel Winter, middleweight champion Canelo Alvarez, New York Giants receiver Odell Beckham Jr. and UFC featherweight title contender Brian Ortega, who will fight Max Holloway for the belt in Toronto on Dec. 8.\n\nBYE KAWHI\n\nLeonard sat out with soreness in his left foot, depriving Lakers fans of their only look at the superstar before he could become an unrestricted free agent next summer. The Lakers would love to sign a second superstar like Leonard, who grew up in the Inland Empire area, one hour east of Los Angeles.\n\nBAD START\n\nThe Lakers' first quarter was shockingly bad. Toronto took a 41-10 lead with 2:21 still remaining in the first quarter, and Ibaka outscored the Lakers 20-17 in the opening period. Ibaka went 11 for 11 in the first half, while Lowry had 12 assists as the Raptors hit six 3-pointers and forced nine turnovers.\n\nUP NEXT\n\nRaptors: At Utah on Monday night.\n\nLakers: Host Minnesota on Wednesday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994295.9798021
}