{
  "game_id": "0021600490",
  "espn_id": "400899932",
  "date": "Dec 29, 2016",
  "matchup": "PHX vs. TOR",
  "headline": "Suns shine in second half, beat Raptors 99-91",
  "body": "PHOENIX --  The young Phoenix Suns might be pushovers to some in the NBA. On Thursday night, they sought to be the aggressors.\n\nIt worked in the second half, as the Suns showed grit on both offense and defense in beating the Toronto Raptors 99-91.\n\nEric Bledsoe scored 22 points, Devin Booker had nine of his 19 in the fourth quarter, and the Suns held the Raptors to 40 percent shooting.\n\nThe Raptors, in second place in the Eastern Conference, lost consecutive games for the first time since Nov. 20 and 21.  Both teams played the second of back-to-back games.\n\n\"A lot of teams or coaches say, `If they hit us, we have to sustain that hit and come back.' Our thing is, let's be the first one to hit,\" Suns coach Earl Watson said. \"We came out in the third quarter and did a great job.\"\n\nThe Raptors trailed for most of the second half and cut a 14-point deficit to 90-85 on a layup by DeMar DeRozan with 3:25 to play in the fourth quarter. But the Suns hung on, winning for just the second time in eight games. They have won back-to-back home games for the second time this season.\n\nDeRozan and Kyle Lowry scored 24 points apiece for the Raptors.\n\nBooker made a layup and a free throw, then a 3-pointer on the next possession to give the Suns a 96-85 lead with 1:51 to play. The Raptors were too far behind to catch up.\n\n\"I'm not shooting the best,\" said Booker, who went 6 for 19, \"but I just stick with it. My coach still trusts me, my team still trusts me.\"\n\nWith the Raptors struggling at both ends, Phoenix went up 72-58 on Booker's layup with 46 seconds left in the third quarter. T.J. Warren's 10-foot floater at the buzzer had the Suns in front 76-62.\n\n\"A lot of it is mental. We catch ourselves standing, we catch ourselves playing in mud,\" Raptors coach Dwane Casey said. \"Playing in mud for three quarters.\"\n\nThe Suns led 12-4 and the Raptors started the game shooting 1 for 10. But Toronto went on a 14-4 run over the last 5:04 of the first quarter and led 18-16 when it ended, despite making just 6 of 18 shots.\n\nTIP-INS\n\nRaptors: F Patrick Patterson left the game in the first half with a strained left knee and did not return. He played 8 1/2 minutes and did not score. \"I just know I felt a sharp jolt pain in my knee and after that I tried to run it off, but it wasn't happening,\" Patterson said. ... F DeMarre Carroll started back-to-back games for the first time this season. The Raptors played their sixth back-to-back set. ... The Raptors are 5-19 against Phoenix since Dec. 26, 2004.\n\nSuns: G Tyler Ulis matched his season and career high with 10 points in 15 minutes. ... The 40 points were an opponent season-low allowed by the Suns in a first half. ... F Jared Dudley missed his third straight game, not playing per coach's decision.\n\nFIESTA TIME\n\nWith the Fiesta Bowl college football playoff game two days away, Clemson coach Dabo Swinney attended Thursday night's game. His Tigers face Ohio State in nearby Glendale, Arizona.\n\nASSIST MAN\n\nBledsoe had 10 assists, two on lobs for dunks. He fed Chandler for one in the first quarter and Marquese Chriss for another in the fourth, the latter giving the Suns a 78-65 lead.\n\nBIG BLOCK\n\nWatson and Bledsoe made mention of a key blocked shot by center Alex Len early in the fourth quarter that energized the Suns and many in the sellout crowd. Len dismissed a dunk attempt by Pascal Siakam, and the play resulted in one of Toronto's 19 turnovers.\n\nUP NEXT\n\nRaptors: At the Los Angeles Lakers on New Year's Day, the fifth of a six-game road swing against Western Conference teams.\n\nSuns: At Utah on New Year's Eve, the first of a two-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764995982.732789
}