{
  "game_id": "0022400229",
  "espn_id": "401704795",
  "date": "Nov 16, 2024",
  "matchup": "CHA vs. MIL",
  "headline": "LaMelo Ball, Hornets overcome Antetokounmpo's first triple-double this season to beat Bucks 115-114",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball scored 19 of his 26 points in the second half, and the Charlotte Hornets overcame Giannis Antetokounmpo’s first triple-double of the season to beat the Milwaukee Bucks 115-114 on Saturday.\n\n\r\n              Antetokounmpo had a chance to win the game at the buzzer, but his foul line jumper rimmed out.\n\n\r\n              Miles Bridges returned from a three-game absence and scored 19 points, while Moussa Diabate added 12 points and 14 rebounds off the bench.\n\n\r\n              Taurean Price had 23 points for the Bucks, while Antetokounmpo finished with 22 points, 15 rebounds and 12 assists. Bobby Portis had 21 points.\n\n\r\n              The Hornets led by four before Pat Connaughton made a 3-pointer and then, following Ball's miss, drove the lane and scored to put Milwaukee up by one with 19 seconds left.\n\n\r\n              Ball responded by driving the right side of the lane and drawing a foul on Antetokounmpo on the following possession. He made both free throws with 7.3 seconds left for the final margin.\n\n\r\n              NASCAR champion Joey Logano attended the game along with former tennis pro Andy Roddick and his wife, actress Brooklyn Decker.\n\n\r\n              Takeaways\r\n              Bucks: Portis was huge off the bench, including scoring eight points in the third quarter to help the Bucks build a 90-86 lead heading into the fourth quarter.\n\n\r\n              Hornets: Diabate became the ninth player in franchise history to record at least 10 offensive rebounds. \n\n\r\n              Key moment\r\n              The foul on Antetokounmpo with 7.3 seconds left was the difference in the game. The Bucks thought Ball simply fell and wasn't fouled but they were out of challenges.\n\n\r\n              Key stat\r\n              The Hornets outrebounded the Bucks 53-40 despite playing without centers Mark Williams and Nick Richards.\n\n\r\n              Up next\r\n              The Bucks host Raptors on Monday night. The Hornets travel to face Cleveland on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997464.2260811
}