{
  "game_id": "0022300923",
  "espn_id": "401585551",
  "date": "Mar 09, 2024",
  "matchup": "TOR @ POR",
  "headline": "Ayton has season-high 30 points and Trail Blazers hold off Raptors 128-118 in OT",
  "body": "PORTLAND, Ore. -- — Deandre Ayton returned from a right hand sprain and had a season-high 30 points and 19 rebounds to help the Portland Trail Blazers beat the Toronto Raptors 128-118 in overtime on Saturday night. \n\n\r\n              Dalano Banton had 25 points and Anfernee Simons added 23 to snap a three-game Portland losing streak. The Blazers (18-45) were playing the second of a back-to-back after a 123-107 loss to the Houston Rockets on Friday night. \n\n\r\n              Immanuel Quickley scored 29 points and Gary Trent Jr. added 23 for the Raptors, who have won just once in the last five games. Toronto (23-41) was coming off a 120 -113 loss at the Phoenix Suns on Thursday. \n\n\r\n              Quickley's layup narrowed it to 111-109 with just over a minute left in regulation before Matisse Thybulle's layup for Portland. Chris Boucher made a pair of free throws for Toronto with 23.1 seconds left. \n\n\r\n              After a jump ball, Toronto sent up a flurry of shots before Boucher's layup tied it with 0.7 seconds left. Portland inbounded the ball to Ayton under the net, but his attempt rimmed out to send the game to overtime. \n\n\r\n              Ayton dunked to open the extra period. Simons' 3 pushed the lead to 120-113 and Toronto couldn't keep up. \n\n\r\n              “I've been watching these dudes play. We've been trending, playing some good basketball and competing,” Ayton said. “I was just making sure my wheels were working and I could keep up with my team.” \n\n\r\n              Raptors coach Darko Rajakovic said his team looked tired going into overtime. \n\n\r\n              “Offensively I thought Portland brought a lot of physicality and as the game was progressing were were trying to figure out how to play against that physicality,” Rajakovic said. “In overtime, I felt we took good shots, they didn't fall.”\n\n\r\n              Ayton and rookie Scoot Henderson both returned after extended absences. Ayton missed five games with the hand sprain, while Henderson missed eight games with an adductor injury. \n\n\r\n              Henderson was on a minutes restriction but scored nine points in his first four minutes. He finished with 13. \n\n\r\n              But Portland was still without Jerami Grant (right hamstring) , Jabari Walker (right hip) and Malcolm Brogdon (right elbow). Shaedon Sharpe was out after core surgery. \n\n\r\n              Portland jumped out to a 22-8 lead after Simons' 3-pointer in the opening quarter. Portland pushed the lead to 38-18 in the second quarter. \n\n\r\n              Portland took a 63-46 lead into halftime. Ayton led the way with 14 points and 10 rebounds. \n\n\r\n              But the big lead began to slip away for Portland in the second half. \n\n\r\n              “We were feeling ourselves just a little bit too much in that third quarter,” Blazers coach Chauncey Billups said. “We played like the game was over. This is the NBA, it’s never over. It was a good lesson for us.” \n\n\r\n              UP NEXT\n\n\r\n              Raptors: Visit the Denver Nuggets on Monday night. \n\n\r\n              Trail Blazers: Host the Boston Celtics on Monday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995403.804509
}