{
  "game_id": "0022300322",
  "espn_id": "401584950",
  "date": "Dec 14, 2023",
  "matchup": "BKN @ DEN",
  "headline": "Jokic gets his 10th triple-double of the season as the Nuggets beat the Nets 124-101",
  "body": "DENVER -- — Nikola Jokic became the first NBA player with at least 10 triple-doubles in seven straight seasons as the Denver Nuggets beat the Brooklyn Nets 124-101 on Thursday night for their third consecutive win.\n\n\r\n              Jokic had 26 points, 15 rebounds and 10 assists in his 115th career triple-double during the regular season. Denver also was bolstered by the return of Jamal Murray, who missed Tuesday's game at Chicago with ankle soreness. He scored 16 points, and Peyton Watson added 18 for the defending champion Nuggets.\n\n\r\n              \"Hey, with Nikola, life becomes a lot easier,\" Denver coach Michael Malone said. “He's just a heck of a player — 26 points, 10 assists, 15 boards, getting to the foul line and doing it in an efficient manner. But what I was probably most pleased about was Nikola's defense. I wanted to be aggressive. I want to be at a level to be disruptive and I think Nikola set the tone with that tonight.”\n\n\r\n              Denver, which improved to 10-1 at home, was especially tough on Brooklyn’s 3-point shooters. The Nuggets held the Nets to 26.7% from beyond the arc (8 of 30).\n\n\r\n              “Our defense was amazing,” Jokic said. “I think defense won the game for us. It was good to have a win like that.”\n\n\r\n              Playing the second of back-to-back games on the road, the Nets were missing Dennis Smith Jr., who did not make the trip while continuing to recover from an upper-back injury. They were led by Spencer Dinwiddie's 17 points, with Cam Thomas adding 13.\n\n\r\n              Brooklyn coach Jacque Vaughn said the Nets were playing “a team that was rested and ready for us. It was a tough back-to-back, the emotional and mental part of it. We just didn't have it tonight.” \n\n\r\n              Up by 13 at halftime, the Nuggets broke loose for 38 points in the third quarter with Jokic putting the finishing touches on the surge by driving for a layup in the waning seconds of the period. They led 90-67 going into the fourth and went up 103-78 midway through the period on a breakaway dunk by Christian Braun.\n\n\r\n              Denver played much of the final period with its reserves and maintained a double-digit lead the rest of the way.\n\n\r\n              Murray scored 14 points in the first half when the Nuggets opened a 52-39 lead, the fewest points they've allowed in a half all season. \n\n\r\n              UP NEXT\n\n\r\n              Nets: Visit the Golden State Warriors on Saturday night.\n\n\r\n              Nuggets: Host the Oklahoma City Thunder on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996359.931257
}