{
  "game_id": "0021800616",
  "espn_id": "401071292",
  "date": "Jan 09, 2019",
  "matchup": "DET @ LAL",
  "headline": "Kuzma's career-high 41 leads Lakers over Pistons 113-100",
  "body": "LOS ANGELES --  Kyle Kuzma scored a career-high 41 points in three quarters against his childhood team, joining some rarified company in the process.\n\nHis offensive outburst propelled the Los Angeles Lakers over the Detroit Pistons 113-100 on Wednesday night to improve to 3-5 without injured LeBron James.\n\n\"Our team has shown a lot of growth from the post-LeBron injury,\" Lakers coach Luke Walton said.\n\nKuzma had 22 points in the third quarter, hitting four 3-pointers to get the crowd on its feet and scoring on consecutive goaltending calls. He joined Klay Thompson, Stephen Curry, James Harden and James with 40-plus points in three quarters this season.\n\n\"Pretty cool,\" Kuzma said. \"That's the team I grew up watching. My fondest memories is them beating the Lakers.\"\n\nKuzma was a 9-year-old in Flint, Michigan, when the Pistons won the 2004 NBA Finals.\n\nHe sat out the fourth quarter and put a wrap around his lower back, which has bothered him lately.\n\nThe second-year forward had scoring runs of 10 and six points in the period, when the Lakers led by 16.\n\n\"Everything was in the rhythm of the offense,\" said Kuzma, who put up 500 shots the day before.\n\n\"No matter what's going on in the game he believes the next shot's going in,\" Pistons guard Langston Galloway said.\n\nMichael Beasley picked up where Kuzma left off, scoring 15 of his 19 points in the fourth on his 30th birthday. His scoring touch had James and other players on the bench on their feet.\n\nDetroit's Blake Griffin, averaging a career-high 25.3 points per game, was held to 16. He had no rebounds for the first time in his career, in part because of Kuzma's defense.\n\n\"You never want to come in here and have a performance like that, especially when you need wins,\" Griffin said. \"The energy just wasn't there. We just did a poor job managing this trip so far.\"\n\nAndre Drummond had 17 rebounds and Reggie Jackson added 15 points for the Pistons, who have lost three in a row and six of seven.\n\nThe Lakers took the lead for good in the second during a 20-7 spurt that pushed their lead to 13. Lonzo Ball's bounce pass in the paint to Kentavious Caldwell-Pope got it going. Ball hit a 3-pointer and Kuzma had five points before James came on the court to cheer his teammates during a timeout.\n\nTIP-INS\n\nPistons: F Zaza Pachulia (bruised right lower leg) sat out.\n\nLakers: James (left groin strain) is set to be re-evaluated Friday and won't travel with the team for its game in Utah. ... Rajon Rondo (right ring finger surgery) has also missed eight games. ... The Lakers had a 72-44 edge in the paint. ... Tyson Chandler was given the night off.\n\nHE SAID IT\n\n\"It felt like it was skipping around out there until it hit Kuz's hand and would go up every time.\" -- Walton on his team's ball movement.\n\nUP NEXT\n\nPistons: Visit Sacramento on Thursday in the second game of a back-to-back before returning to LA to face the Clippers on Saturday.\n\nLakers: At Utah on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994694.696398
}