{
  "game_id": "0022200928",
  "espn_id": "401469083",
  "date": "Feb 28, 2023",
  "matchup": "SAC @ OKC",
  "headline": "Barnes scores 29 points, Kings beat Thunder for 4th straight",
  "body": "OKLAHOMA CITY -- — Harrison Barnes scored 29 points and the Sacramento Kings beat the Oklahoma City Thunder 123-117 on Tuesday night for their fourth consecutive victory. \n\n\r\n              Domantas Sabonis had 22 points, 13 rebounds and nine assists and Kevin Huerter added 20 points and nine assists for the Kings. Sacramento also beat the Thunder on Sunday night.\n\n\r\n              The season scoring leaders for both teams did not play. Sacramento’s De’Aaron Fox missed with soreness in his left wrist and Oklahoma City's Shai Gilgeous-Alexander was out due to health and safety protocols and an abdominal strain.\n\n\r\n              Sacramento coach Mike Brown was glad the Kings didn’t use Fox’s absence as an excuse.\n\n\r\n              “Our guys, they came with a little bit of an edge tonight and they played greedy,” Brown said. “And that’s what excites me about this team is, knowing what’s at stake, still coming and performing the way that they did and getting the win and finishing this trip off the right way gets me really excited about the group.”\n\n\r\n              The Thunder put their best perimeter defender, Lu Dort, on Huerter, so Brown made Barnes the focal point of the offense. Brown said Barnes' success opened things up.\n\n\r\n              “It allows us to attack different matchups, it frees other guys, it takes the pressure off of other guys,\" Brown said. \"And he’s a willing passer too. So guys have got to be ready to catch and shoot when that ball comes out because he’s going to find the mismatch throughout the course of the game.” \n\n\r\n              Thunder rookie Jalen Williams matched a season high with 27 points. Dario Saric, a reserve forward/center the Thunder acquired in a trade with Phoenix before the All-Star break, had a season-high 21 points. But Oklahoma City shot just 43.9% in its fourth straight loss.\n\n\r\n              Thunder coach Mark Daigneault said Gilgeous-Alexander's missing 31 points per game weren't why the Thunder lost.\n\n\r\n              “For us to lean on that right now would not be wise,” he said. “We need to we need to build our collective toughness and our collective togetherness and solve the problem as a team.”\n\n\r\n              Sacramento led 71-66 at halftime behind 17 points, seven rebounds and seven assists from Sabonis. \n\n\r\n              The Kings went on a 13-0 run in the third quarter to go up 89-72, but the Thunder rallied and trailed 93-87 heading into the fourth.\n\n\r\n              Oklahoma City tied it at 98 before Sacramento responded with a 12-2 run, and the Kings controlled the rest of the game.\n\n\r\n              THEM AGAIN?\n\n\r\n              Brown on playing the same opponent two consecutive games: “I do like it. And I like the break in between. Although you feel like you’ve been here in one spot forever, it’s is beneficial for the travel team because they’re there, they’re rested, they’re fresh, they’re locked in and they’re able to play on a pretty high level instead of traveling in the night before.”\n\n\r\n              QUOTABLE\n\n\r\n              Daigneault on Saric: “He’s kind of a magnet to the ball. I think he’s a security blanket. Guys throw to him. I mean, we’re not like, pushing his button or anything like that, but he’s an easy guy to play with.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: F Trey Lyles was called for a technical foul in the second quarter. ... Barnes scored just nine points on Sunday. ... F Keegan Murray finished with 13 points and 10 rebounds. \n\n\r\n              Thunder: G Isaiah Joe, who scored 28 and 24 points in his previous two games, had eight points on 3-for-5 shooting. ... Signed G Lindy Waters III to a multi-year contract on Monday. The former Oklahoma State star had signed a Two-Way contract last year. ... Williams scored 16 points in the fourth quarter. ... G Josh Giddey committed his third foul midway through the first quarter.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host the Los Angeles Clippers on Friday niht.\n\n\r\n              Thunder: Host the Los Angeles Lakers on Wednesday night.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995289.972151
}