{
  "game_id": "0021800529",
  "espn_id": "401071206",
  "date": "Dec 29, 2018",
  "matchup": "CLE @ ATL",
  "headline": "Young, Carter power Hawks past Cavs, 111-108",
  "body": "ATLANTA --  There hasn't been much for Hawks forward John Collins to feel good about this season.\n\nHis team has almost no chance to make the playoffs, so Collins wants to enjoy the good times while they last.\n\n\"We're a young team with a new coaching staff,\" he said. \"It's all about getting together as a group and figuring it out. I think we have been.\"\n\nTrae Young and Vince Carter each scored 21 points, Collins added 14 points and 12 rebounds, and Atlanta beat the Cleveland Cavaliers 111-108 on Saturday night.\n\nCarter, 41, had his first game with 20 points for Atlanta and became the oldest player in history to lead or tie for the team lead in scoring. He looked half his age with a baseline dunk midway through the fourth and then hit a corner 3 that made it 98-92 a couple of minutes later.\n\n\"More than anything, I wanted to bring the energy,\" Carter said. \"I'm not the youngest guy, but I want to play the hardest.\"\n\nAtlanta, enjoying a rare run of success in its first season of rebuilding under new coach Lloyd Pierce, has won five of six. At 11-24, the Hawks have the fourth-worst mark in the Eastern Conference, but they've done better recently compared to Cleveland, which dropped its sixth in a row.\n\nCedi Osman finished with 22 points, and Larry Nance Jr. and Collin Sexton each had 18 for the Cavs. Cleveland fell to 8-29, worst in the NBA.\n\nThe Cavs never led after Jaron Blossomgame's alley-oop dunk made it a three-point game midway through the third. They trailed by 12 late in the third, but Sexton's free throw tied it at 106-all with 58 seconds remaining.\n\nAfter Collins scored on a follow shot, Alec Burks made an errant inbound pass to Nance that Justin Anderson stole and handed to Young.\n\n\"We just didn't set our screens, and they did a good job of denying us,\" Osman said. \"Everything just happened really fast, and we lost the ball, but that was just another of our simple mistakes.\"\n\nYoung missed a 3-pointer, but DeAndre' Bembry was fouled on a rebound and hit a free throw to make it a three-point game. Cleveland blew its last chance to score when Jordan Clarkson missed a 3 in the closing seconds.\n\n\"We are going to keep fighting,\" Cavs coach Larry Drew said. \"I don't think we put ourselves in a position for it to be a better result at the end of the game and we just didn't make plays down the stretch and missed some free throws.\"\n\nTrailing by 10 in the last 2 minutes of the first, Atlanta tied it at 28-all on Young's straightaway 3 and took its first lead on Alex Len's inside basket early in the second. Len took passes from Young and Kent Bazemore to score at the rim on consecutive possessions that put the Hawks up 47-41, and the lead jumped to 12 on 3s by Jeremy Lin and Kevin Huerter.\n\nEARLY NIGHT\n\nBazemore limped off the floor with a right ankle sprain midway through the third and did not return. Working to get open, Bazemore drew a foul as he fell backward into Osman. He made one of two free throws before heading straight to the locker room and finished with five points and five rebounds in 20 minutes.\n\nTIP-INS\n\nCavaliers: Drew had only nine healthy players for the second straight night. ... Ante Zizic was a late scratch with right knee soreness. ... G Rodney Hood missed his fourth straight game with a left Achilles tendon soreness. ... Nance appeared to have a leg injury late in the game but he stayed in. ... The lineup of Sexton, Burks, Blossomgame, Osman and Nance Jr. dropped to 0-2. It was the Cavs' 16th starting five.\n\nHawks: F Taurean Prince, the team's third-leading scorer, missed his 11th game with a left ankle sprain. ... Young, Bazemore, Huerter, Len and Collins comprised the 10th lineup for Lloyd Pierce.\n\nUP NEXT\n\nCavaliers: Host Miami on Wednesday.\n\nHawks: Visit Indiana on Monday to begin a three-game road trip.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994783.337579
}