{
  "game_id": "0021600243",
  "espn_id": "400899693",
  "date": "Nov 26, 2016",
  "matchup": "MEM @ MIA",
  "headline": "Conley's late flurry lifts Grizzlies over Heat, 110-107",
  "body": "MIAMI --  Memphis coach David Fizdale offered a one-word assessment about being on the visitors' bench in Miami.\n\n\"Weird,\" Fizdale said.\n\nSuffice to say, Fizdale and Miami coach Erik Spoelstra are both thrilled their matchups for the season are over.\n\nMarc Gasol scored a season-high 28 points, Mike Conley had 11 of his 21 in the final 3:06 and the Grizzlies beat the Heat 110-107 on Saturday night.\n\nTroy Williams added 18 for the Grizzlies, who earned a split of the home-and-home with the Heat and gave Fizdale a win in the building where he served as a Miami assistant for the past eight seasons.\n\n\"It's just hard to compete against your brothers like that and fight like that,\" Fizdale said. \"I can only imagine if we both ever make it to the finals, how tough that would be. But I'm glad it's over. It worked out how it's supposed to -- he won on my spot, I won on his spot, we break even and now we root for each other again.\"\n\nDion Waiters scored a season-high 28 for Miami, which got 15 points and 12 rebounds from Hassan Whiteside, and 15 points from Josh Richardson. But after winning in Memphis on Friday, the Heat fell short against a Grizzlies team that's now 5-0 this season in games decided by five points or less.\n\n\"You've got to tip your hat to that team,\" Spoelstra said. \"Every time they've been in a close game this year, they've found a way to gut it out and get a win.\"\n\nConley was under no minutes restriction on Saturday, and that was big for Memphis.\n\nThe Grizzlies led 99-98 when he checked in with 4:01 left, and he scored their last 11 points -- the first salvos in that flurry being a 3-pointer, then a three-point play, and then a deep 3 to put his team up 108-101 with 1:25 left.\n\n\"Conley made every ... big ... play down the stretch,\" Spoelstra said. \"It's early right now, but if he's not an All-Star it'll be a crime.\"\n\nWaiters' 3-pointer in the final minute got the Heat within three, and his layup on the next Miami possession cut Memphis' lead down to 108-107. But Conley made a pair from the line with 11.4 seconds left, and the Grizzlies escaped when Richardson's 3-point try hit the rim and bounced off as time expired.\n\nTIP-INS\n\nGrizzlies: Gasol's previous season high was 27, set Wednesday in Philadelphia. He was held to nine points by the Heat on Friday, and hasn't posted consecutive single-digit scoring games yet this season. ... Memphis G Vince Carter is now nine games shy of making his 1,300th regular-season appearance.\n\nHeat: Spotted on the concourse was former NBA referee Joe Crawford, who's now working for the league (and was seeking a hot dog for halftime). ... Floyd Mayweather's not-very-subtly designed van bearing his The Money Team logos was parked near the Heat player lot. ... This was Miami's first time playing the same opponent on consecutive nights since games with Orlando, Feb. 14 and 15, 2006.\n\nMISSING PLAYERS\n\nMemphis' Zach Randolph missed his second straight game as he continues to grieve his late mother, and the Grizzlies are also still without former Heat player James Ennis (right calf). Miami was again without point guard Goran Dragic (left elbow), forward Justise Winslow (left wrist) and forward Willie Reed (right knee).\n\n5 FOR 5\n\nBoth teams had all five starters reach double figures. Miami also had two reserves get there.\n\nUP NEXT\n\nGrizzlies: Host Charlotte on Monday, as a 10-game, 16-day stretch continues.\n\nHeat: Host Boston on Monday, in the first Celtics-Heat meeting of the season.",
  "source": "espn_api",
  "crawled_at": 1764995618.998018
}