{
  "game_id": "0021501049",
  "espn_id": "400828936",
  "date": "Mar 21, 2016",
  "matchup": "CHI vs. SAC",
  "headline": "Bulls rally late for a 109-102 victory over the Kings",
  "body": "CHICAGO -- The Chicago Bulls have been in the habit of playing down to the level of their competition this season.\nNot against the Sacramento Kings on Monday night, though.\nDerrick Rose and Taj Gibson had 18 points each, Doug McDermott added 16 and Pau Gasol had 14 points and 14 rebounds to lead the Bulls to a 109-102 comeback victory over the Kings.\nRose was 9 for 15 from the field and hit a couple of 15-foot jumpers during Chicago's decisive 10-0 run in the fourth quarter to rally from a five-point deficit.\nGasol recorded his 39th double-double of the season in just 24 1/2 minutes in his first game back after missing four games with a swollen right knee.\nThe Bulls (36-33) have won three straight and maintain slim lead on the Detroit Pistons (35-32) for the eighth and final playoff spot in Eastern Conference.\n\"Early in the year, I am not sure we would have won this game,\" coach Fred Hoiberg said. \"Earlier, when we had a stretch like that, it would continue to spiral out of control.\"\nRose agreed: \"Earlier in the year, it probably would have slipped. We're just finding ways to win, just winning games somehow.\"\nDeMarcus Cousins had 19 points and 18 rebounds, Darren Collison had 19 points and Rudy Gay had 18 for Sacramento, which trailed throughout before taking a five-point lead midway through the fourth.\n\"What helped us is the way we were moving the ball,\" Cousins said. \"I think in the last couple of minutes the ball got stagnant and their defense took advantage of us. We weren't able to make any plays down the stretch.\"\nThe Bulls had an eight-point halftime lead and stretched their advantage to 69-57 early in the third quarter, but Sacramento responded with an 11-2 run to make it 71-68. After the Bulls built their advantage back up to 77-70, the Kings closed the quarter with an 11-4 run to make it 82-81 heading into the fourth.\nSacramento carried the momentum into the final quarter and took an 89-86 lead on Marco Belinelli's 3-pointer with 8:40 left -- its first advantage since late in the first quarter.\nTrailing 95-90, the Bulls scored 10 straight points to take a 100-95 lead. Rose hit a pull-up 15-footer over Cousins to put Chicago back on top, 96-95, with just under 5 minutes to go.\nAfter the Kings ended the streak with a basket by Rajon Rondo, Jimmy Butler had a tip-in and Mike Dunleavy hit a 3-pointer to make it 105-97 with 1:28 remaining.\n\"We played well for 6 minutes tonight,\" Hoiberg said. \"Luckily, it was the last 6 minutes of the game.\"\nTIP INS\nKings: Rookie C Willie Cauley-Stein returned after missing the previous two games with flu-like symptoms. He was scoreless in 5 minutes. ... Rookie F Ben McLemore (fractured right ring finger) missed his eighth straight game.\nBulls: G E'Twaun Moore (left hamstring) missed his second straight and Hoiberg already declared him out the next three games, which includes games at New York and Orlando. \"He won't travel on this upcoming trip,\" Hoiberg said. \"We'll re-evaluate him when we get back from Orlando.\"\nFOR STARTERS\nThe Bulls' starting lineup of Rose, Butler, Dunleavy, Gibson and Gasol was the projected lineup heading into the season, but Monday marked just the second time those five players have been on the court to begin a game this season.\n\"It's a good feeling to have your guys back and have different options,\" Hoiberg said. \"We've still have a couple of them with plans in place with their minutes. Once we get rid of that, it'll be a great feeling.\"\nThey're 2-0 with that lineup.\nUP NEXT\nKings: Visit the Minnesota Timberwolves on Wednesday night.\nBulls: Host the New York Knicks on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764993906.360876
}