{
  "game_id": "0022400880",
  "espn_id": "401705446",
  "date": "Mar 03, 2025",
  "matchup": "DAL vs. SAC",
  "headline": "Kings dominant in 122-98 win over Mavericks, who lose Irving to left knee sprain",
  "body": "DALLAS -- — Zach LaVine scored 22 points and DeMar DeRozan added 20, each sitting out the fourth quarter, as the Sacramento Kings beat Dallas 122-98 Monday night with the Mavericks losing Kyrie Irving late in the first quarter to a left knee sprain.\n\n\r\n              The Kings have won four consecutive games while the Mavericks have dropped two straight and four of five.\n\n\r\n              Sacramento played without Domantas Sabonis, the NBA’s top rebounder, who suffered a grade 1 left hamstring strain in the first minute of Saturday’s win at Houston. Sabonis will miss at least one week.\n\n\r\n              Jonas Valanciunas made his first start since being acquired by the Kings on Feb. 5 and had 14 points and nine rebounds in 23 minutes through three quarters.\n\n\r\n              Irving landed awkwardly after being fouled on a drive to the basket and immediately grabbed his leg, remaining on the floor for multiple minutes. He was helped to the free-throw line and sank both shots before being helped to the locker room.\n\n\r\n              Kai Jones, signed by Dallas on Monday to a two-way contract in the wake of injuries to multiple big men, led the Mavericks with 21 points, a career high, and nine rebounds.\n\n\r\n              Dallas lost another player midway through the third quarter when reserve guard Jaden Hardy left with a right ankle sprain.\n\n\r\n              Takeaways\r\n              Kings: They swept the three-game season series and are tied for eighth place in the West, one game ahead of Dallas.\n\n\r\n              Mavericks: Their seven 3-pointers (on 25 shots) were one above their season low.\n\n\r\n              Key moment\r\n              \r\n              Irving's night ended with five points in nine minutes.\n\n\r\n              Key stat\r\n              The Kings took a 10-point lead into the second half and used a 21-2 run to outscore the Mavericks 34-16 in the third period.\n\n\r\n              Up next\r\n              Both teams play on the road Wednesday, the Kings at Denver completing a four-game trip and the Mavericks at Milwaukee.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997150.6827579
}