{
  "game_id": "0022200443",
  "espn_id": "401468598",
  "date": "Dec 17, 2022",
  "matchup": "MEM @ OKC",
  "headline": "Grizzlies star Morant ejected, short-handed Thunder win",
  "body": "OKLAHOMA CITY -- — Memphis star Ja Morant was ejected just before halftime and an undermanned Oklahoma City Thunder squad ended Memphis’ winning streak at seven with a 115-109 victory Saturday night.\n\n\r\n              Morant was ejected with 43 seconds left in the half when he was called for his second technical foul after apparently making remarks to courtside Memphis fans that were derogatory about the officiating. He didn’t say specifically what he said to the fans, but did confirm the conversation and said he wasn’t speaking to the official before either technical.\n\n\r\n              “I got my first tech for saying I got hit in my (expletive) face. Didn’t curse at him,” Morant said. “Another situation where he’s in my conversation and I get another tech for talking with a fan. I feel like when these fans came here, went online to buy these tickets, they didn’t say Ray (Acosta) name to come watch.”\n\n\r\n              Morant scored just six points on 3-of-10 shooting. The All-Star guard picked up his first technical 11 seconds earlier after committing a foul to stop play and complain about a no-call on a drive to the basket. \n\n\r\n              The Thunder, playing without stars Shai Gilgeous-Alexander and Josh Giddey, ended a five-game losing streak. Lu Dort scored 24 points and Isiah Joe had a season-high 23 points, hitting five 3-pointers.\n\n\r\n              Joe said he didn’t prepare any differently when he found out he was getting his first start of the season.\n\n\r\n              “I had my same routine, the same thoughts went through my head before the game. I’m getting in the game at a different time now. I’m starting and I just do what the team needs at the time,” Joe said. “With a team like this, you never know when your number is going to get called. Fortunately tonight my number was called early, I started. Not just me, but I feel like a lot of my teammates can do the same thing. At this level, if your coach has to tell you to be ready, you probably shouldn’t be here in the first place.”\n\n\r\n              Dillon Brooks led Memphis with 32 points.\n\n\r\n              Dort, the only regular starter in Oklahoma City’s lineup, got the Thunder going early with 10 points in the first five minutes, including two 3-pointers.\n\n\r\n              When Jaylin Williams hit back-to-back baskets in the second quarter, the Thunder led by double digits, and expanded the lead to 64-43 at halftime.\n\n\r\n              Playing with a collection of reserves, rookies and two-way players getting their most extensive action of the season, the Thunder maintained a double-digit lead until the final two minutes. Memphis made a late run, closing to five in the final minute on Brooks’ 3-pointer.\n\n\r\n              Oklahoma City finished 19 of 45 from 3-point range after shooting more than 50% for most of the game.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Brooks was also given a technical foul during the break in action when Morant was ejected.\n\n\r\n              Thunder: In addition to Giddey and Gilgeous-Alexander, the Thunder were without Darius Bazley and Jeremiah Robinson-Earl. Omoruyi, a two-way player, got his first NBA start and Joe his first start in a Thunder uniform.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Denver on Tuesday night.\n\n\r\n              Thunder: Host Portland on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994215.14898
}