{
  "game_id": "0021800199",
  "espn_id": "401070880",
  "date": "Nov 13, 2018",
  "matchup": "CHA @ CLE",
  "headline": "Clarkson scores 24, injury-riddled Cavaliers blast Hornets",
  "body": "CLEVELAND --  The Cleveland Cavaliers are dealing with so many injuries they needed an assistant coach to suit up for practice Monday.\n\nA little over 24 hours later they did just fine with their healthy players.\n\nJordan Clarkson scored 24 points, Tristan Thompson had 21 rebounds and 11 points, and Cleveland won for the second time this season, beating the Charlotte Hornets 113-89 on Tuesday night.\n\nThe Cavaliers (2-11) broke a five-game losing streak. Cleveland's first win came against Atlanta on Oct. 30.\n\nCleveland's injury list grew longer while the losses piled up. Forwards Kyle Korver (sore right foot) and Cedi Osman (back spasms) didn't play Tuesday and are the most recent additions.\n\nAll-Star forward Kevin Love (foot surgery), starting point guard George Hill (hamstring) and forward Sam Dekker (ankle) have also been sidelined.\n\nCavaliers coach Larry Drew gave a rundown of the team's injuries in his pregame media session and then asked, \"Who'm I missing? Is that it?\"\n\nThompson was a key member of the team that went to four straight NBA Finals and won the championship in 2016. Despite the injuries and early season drama that included coach Tyronn Lue being fired after an 0-6 start, he knows the players must keep their heads up.\n\n\"We've got to,\" he said. \"This is the NBA. We can't feel sorry for ourselves. It's a month into the season. We have to keep pushing and keep getting better.\"\n\nKemba Walker, the league's third-leading scorer, was held to a season-low seven points and was 2 for 16 from the field. The Hornets star guard was averaging 27.9 points going into the game.\n\n\"This was one of those nights,\" Walker said. \"I got to all my spots, was able to take all my shots. It was a rough night shooting the basketball.\"\n\nThompson matched his career high in rebounds and didn't play in the fourth quarter.\n\nRodney Hood scored 16 points for Cleveland, which built a double-figure lead midway through the first quarter and maintained that the rest of the game. Rookie point guard Collin Sexton had 16 points and five assists. David Nwaba scored 18 points off the bench.\n\nJeremy Lamb scored 22 points for Charlotte. The Hornets were 33 for 95 from the field and hit 8 of 41 of their 3-point attempts.\n\nCleveland's past three losses were by a combined 12 points. The Cavaliers, who lost to the Hornets 126-94 on Nov. 3, led 63-42 late in the second quarter and were up 67-51 at the half, when Charlotte was 19 for 53 from the field.\n\n\"For the work we've been putting in and the tough times we've been through, tonight's win kind of pays off,\" Drew said.\n\nThe Hornets cut the lead to 78-67 in the third quarter, but scored two points over the final five minutes of the period. J.R. Smith and Nwaba helped Cleveland maintain the momentum by hitting 3-pointers on back-to-back possessions.\n\nThe Cavaliers built the lead to 25 points in the fourth quarter.\n\nTIP-INS\n\nHornets: Walker, an 87 percent shooter, missed two free throws in a trip to the line midway through the second quarter. ... F Michael Kidd-Gilchrist (sprained right ankle) did not play after being injured Sunday at Detroit. He's averaging 8.6 points in 13 games off the bench. ... F Dwayne Bacon entered the rotation in his spot.\n\nTIP-INS\n\nCavaliers: Love had surgery Nov. 2 and is still wearing a walking boot on his left foot. .... Korver doesn't believe his injury is serious and said that he'd be surprised if he isn't ready play when the Cavaliers visit Detroit on Nov. 19. .... The 37-year-old Korver has been bothered by foot injuries the past two seasons. ... Drew said Osman likely will miss his third straight game Wednesday.\n\nMAKING PROGRESS\n\nSexton, taken with the eighth pick in the draft, had four assists and five rebounds in 33 minutes. Drew said the 19-year-old will continue to play substantial minutes when Hill returns, but didn't indicate whether the rookie will continue to start.\n\n\"I see growth in the last week and a half,\" Drew said. \"He's starting to kind of figure it out.\"\n\nRALLY KILLER\n\nCharlotte won three of four going into the game, but didn't play well in dropping to 7-7.\n\n\"Hopefully this gives us some fire,\" coach James Borrego said. \"There wasn't a whole lot of good out there. We're going to have to use this game as fuel for the next game.\"\n\nUP NEXT\n\nHornets: Host Philadelphia on Saturday.\n\nCavaliers: Visit Washington on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994428.8243442
}