{
  "game_id": "0022300879",
  "espn_id": "401585507",
  "date": "Mar 04, 2024",
  "matchup": "MEM @ BKN",
  "headline": "Luke Kennard scores season-high 25 points, Grizzlies beat Nets 106-102 to end 5-game skid",
  "body": "NEW YORK -- — The Memphis Grizzlies pummeled the Brooklyn Nets with hammers and daggers.\n\n\r\n              Luke Kennard scored a season-high 25 points and the Grizzlies snapped a five-game losing streak by beating the Nets 106-102 on Monday night.\n\n\r\n              Jake LaRavia added 14 points and 10 rebounds for the Grizzlies, who outrebounded the Nets 50-33 and piled up 25 second-chance points to make up for all the offense they are missing because of injuries. Lamar Stevens chipped in 13 points. \n\n\r\n              LaRavia said Memphis coach Taylor Jenkins has tried to get the Grizzlies to be more active on the offensive glass, calling a rebound that is put back up and in, a hammer, and one that is kicked back out for a 3-pointer, a dagger.\n\n\r\n              “We got a lot of crucial offensive rebounds that helped us get extra possessions, so just something that we’ve been focusing on more lately,” LaRavia said. \n\n\r\n              The Nets had won 111-86 in Memphis on Feb. 26, allowing their fewest points this season for their first victory under interim coach Kevin Ollie. They weren't quite as good defensively and were much worse offensively, adding to their woes with a dismal 17-for-30 (56.7%) showing on free throws.\n\n\r\n              The final miss came on a curious decision to have Mikal Bridges intentionally miss the final of a three-shot foul with the Nets down three and still 6.7 seconds remaining. The Nets were called for a violation, but the Grizzlies probably would have grabbed the rebound the way they outworked the Nets on the boards. \n\n\r\n              “The play starts with the shot, that’s when their plays started,” Ollie said. “So when they shot it, they went to go get it.” \n\n\r\n              Nic Claxton had 21 points for the Nets, who were coming off consecutive victories over Atlanta that had allowed them to pull within two games of the Hawks for 10th place in the Eastern Conference and the final spot in the play-in tournament. But Bridges, their leading scorer who had 38 points in Saturday's victory, was 4 for 14 Monday and had just 14 points. \n\n\r\n              The game was tied at 88 before Stevens had the next two baskets, and a basket by Kennard made it 94-88. Claxton ended Brooklyn's drought, but Vince Williams Jr. scored and Kennard had his sixth 3-pointer for a 99-90 lead with three minutes to play.\n\n\r\n              Kennard finished 8 for 11 overall and 6 for 9 behind the arc. He's also battled injuries and illnesses, missing 31 games this season. \n\n\r\n              “It definitely feels good to get a game like that and on top of it to get a win,” Kennard said. \"We’ve struggled the last five, six games here.\n\n\r\n              “We have some young guys out there. Just continuing to try to be a leader for them and just trying to make the right plays and it definitely felt good to knock a few shots down as well.”\n\n\r\n              The Nets played without Cam Thomas because of foot and ankle injuries, and Ben Simmons, who was sidelined because of a pinched nerve in his lower back, the same injury that sidelined him for 35 games earlier this season.\n\n\r\n              That's nothing compared to the Grizzlies' injury woes, with Memphis missing the likes of Ja Morant, Jaren Jackson Jr., Desmond Bane and Marcus Smart on Monday.\n\n\r\n              But they led 53-52 at halftime and extended that to 71-63 on Kennard’s 3-pointer midway through the third. Brooklyn used a 9-0 run to turn a seven-point deficit into a 77-75 edge, but Memphis got the final five points of the period to lead 80-77 going to the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit Philadelphia on Wednesday.\n\n\r\n              Nets: Host Philadelphia on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996002.479706
}