{
  "game_id": "0021600445",
  "espn_id": "400899887",
  "date": "Dec 23, 2016",
  "matchup": "OKC @ BOS",
  "headline": "Westbrook triple-double leads Thunder past Celtics 117-112",
  "body": "BOSTON -- With the clock running down and the Thunder falling behind, Russell Westbrook turned unstoppable.\nThe Oklahoma City point guard had his 14th triple-double of the season and his third straight 40-point game, scoring 45 points with 11 assists and 11 rebounds on Friday night to lead the Thunder to a 117-112 victory over the Boston Celtics.\nWestbrook scored the last seven points of the first half after and Oklahoma City's last 15 in the game, including eight straight during a 10-0 run that gave the Thunder the lead for good.\n\"It's important for me to know how to close games,\" Westbrook said. \"All the best players figure out how to close games.\"\nEnes Kanter and rookie Domantas Sabonis scored 20 points for Oklahoma City, which had lost three of its previous five games.\nIsaiah Thomas had 34 points and 10 assists and Al Horford scored 23 points for Boston, which had won a season-high four straight games.\nBut Westbrook took control when it mattered, converting a three-point play to give the Thunder the lead with just under 3 minutes left, and then making two long 3-pointers in the final 75 seconds to ice it.\n\"We've got really good defenders on him and he made great plays,\" Celtics coach Brad Stevens said. \"I don't know what to say other than `Hats off to him' for plays he made.\"\nWestbrook didn't make his first basket until 4 minutes into the second quarter. But with 45 seconds left in the second quarter, Westbrook hit a 27-footer to tie the game 54-all and followed it with a layup to give the Thunder the lead.\nHe closed out the half with two free throws, heading into the break with 16 points, nine assists and four rebounds.\nThe Celtics tied it 96-96 in the third when Thomas drove and converted a three-point play with about 7 minutes left. As he stepped to the line to take the free throw, the crowd chanted \"M-V-P!\"\nBoston led 104-100 lead when Westbrook went off on another run.\nAfter Jerami Grant's dunk cut it to two points, Westbrook scored the next eight. In all, he scored Oklahoma City's final 15 points.\nTIP-INS\nThunder: Thunder coach Billy Donovan coached Horford at Florida. ... Anthony Morrow had a block in the fourth quarter that ricocheted off the referee and into the stands.\nCeltics: Led for all but 65 seconds in the first half. ... Horford surpassed 20,000 minutes in his career. ... Boston's 17-13 record is the same after 30 games as last season.\nHACK-A-ROBERSON\nAfter Westbrook gave the Thunder the lead, the Celtics tried to climb back in front by intentionally fouling Andre Roberson. Twice in the final 3 minutes they sent him to the line -- he missed all four free throws -- but Donovan left him in the game.\n\"He's going to be in that situation later in the year,\" Donovan said. \"It's easy to pull the guy out and say `He can't make free throws.' But I think it's important to show confidence in him.\"\nLIKE FATHER\nSabonis was 7 for 7 for 17 points in the first half to surpass his career high of 15. The son of Hall of Famer Arvydas Sabonis scored only three points in the second but, along with Kanter, pulled enough defenders away from Westbrook to cause problems.\n\"I think if we shut one of those guys down we get this game,\" Celtics forward Amir Johnson said. \"Westbrook causes so much attention we leave those other guys open and they made shots.\"\nUP NEXT\nThunder: Host the Timberwolves on Sunday. Oklahoma City is 4-4 on Christmas Day and Minnesota will be making its debut on the holiday.\nCeltics: Travel to the Knicks. Boston swept all four games against New York last season.",
  "source": "espn_api",
  "crawled_at": 1764995303.639638
}