{
  "game_id": "0021800224",
  "espn_id": "401070905",
  "date": "Nov 17, 2018",
  "matchup": "BKN vs. LAC",
  "headline": "Clippers rally past Nets 127-118 for 4th straight win",
  "body": "NEW YORK --  Montrezl Harrell provided a big lift for the Los Angeles Clippers in the fourth quarter.\n\nMom was pretty impressed.\n\nHarrell scored 10 of his 16 points in the final period, and the Clippers rallied to beat the Brooklyn Nets 127-118 on Saturday night for their fourth straight victory.\n\nDanilo Gallinari scored 28 points and Tobias Harris had 27 as Los Angeles opened a three-game trip with its sixth win in seven games overall. Lou Williams finished with 16 points and five assists.\n\nThe 24-year-old Harrell also grabbed 10 rebounds while playing an NBA game in front of his mother, Selena, for the first time.\n\n\"My mom works two jobs and I also have two younger brothers, one which is still in high school, and one which is in college probably an hour and a half away from the house,\" Harrell said.\n\n\"So I still got two younger brothers at home that still are grinding to do their thing to pursue their dreams in their own careers. Her work schedule is kind of crazy.\"\n\nBrooklyn lost for the fourth time in five games. Jarrett Allen had 24 points and 11 rebounds, and D'Angelo Russell added 23 points and 10 assists.\n\nThe Clippers started out poorly and trailed by as many as 15 points midway through the first half.\n\nLos Angeles coach Doc Rivers was searching for a spark and went away from his original game plan before finding the right group, which included Harrell, Williams and three other reserves, to start the final period.\n\nThe Clippers took their first lead of the game with 8:21 remaining after Williams made three free throws to make it 102-101.\n\n\"Nothing made sense, honestly,\" Rivers said. \"This was a game for us tonight that we had to throw every logical thing out and just try to find five guys that can make a run.\"\n\nAfter Allen's free throws put Brooklyn up 110-108 with 5:21 to go, Harrell led the Clippers on a 9-0 run with six points, including a pair of free throws with 2:59 left to give Los Angeles a 117-110 lead.\n\n\"I thought their bench did a phenomenal job,\" Nets coach Kenny Atkinson said.\n\n\"I thought they brought the energy. We obviously missed some shots, but I thought Montrezl Harrell and Lou Williams, obviously those guys came in and changed the game.\"\n\nRussell got Brooklyn within four on a 3-pointer with 2:09 remaining, but Gallinari's 17-foot jumper sealed it for Los Angeles.\n\nTIP-INS\n\nClippers: G Avery Bradley was held out due to a sprained left ankle. He has missed the last six games.\n\nNets: Allen's double-double was his fifth of the season after recording four in 72 games last season.\n\nMIND GAMES\n\nAs Brooklyn was preparing to inbound the ball after calling timeout with 6:10 left in the first quarter, Russell was baited by Clippers point guard Patrick Beverley into picking up a technical foul.\n\nBeverley kept nudging Russell as they ran down the court to position themselves right under the arc before the Nets guard elbowed him. Beverley walked over to the referee to complain. He then got under Russell's skin as soon as the ball was about to be thrown in before the official whistled Russell for throwing an elbow.\n\nUP NEXT\n\nClippers: Continue their three-game road trip at Atlanta on Monday night.\n\nNets: Visit the Miami Heat on Tuesday Night.",
  "source": "espn_api",
  "crawled_at": 1764995427.2546198
}