{
  "game_id": "0021500227",
  "espn_id": "400828114",
  "date": "Nov 27, 2015",
  "matchup": "CHA vs. CLE",
  "headline": "James scores 25 to lead Cavs over Hornets again, 95-90",
  "body": "CHARLOTTE, N.C. -- LeBron James can't explain why he plays so well against the Charlotte Hornets, but he sure has a knack for picking up his game.\n\nJames had 25 points and 13 rebounds, extending his personal run of dominance versus Charlotte by leading the Cleveland Cavaliers to a 95-90 victory Friday night.\nKing James' teams have won 23 straight games against franchises based in Charlotte -- both the Hornets and Bobcats. He played in all but two of those.\nThe four-time MVP said he was just happy the Cavs could get back to .500 on the road, improving to 4-4 this season.\nJames spoke to his teammates after Cleveland's loss in Toronto, though he refused to call it a team meeting.\n\"I said what I had to say, the guys responded and we got a win,\" James said.\nCharlotte's Kemba Walker, who has been around for most of the losses to James, called it frustrating not to be able to beat him. The last time James lost to a Charlotte team was Feb. 19, 2010, during his first stint with the Cavaliers.\n\"Down the stretch he makes the plays to win basketball games. That's what makes him a great player,\" Walker said.\nKevin Love had a double-double at halftime for the Cavs and finished with 18 points and 16 rebounds despite sitting out the fourth quarter.\nCleveland coach David Blatt went with a smaller lineup that included Matthew Dellavedova, Tristan Thompson, Richard Jefferson, J.R. Smith and James.\n\"We felt we had a certain lineup that was working,\" Blatt said. \"It wasn't a plan going into the fourth quarter, honestly. It was just working well for us.\"\nLove said he was a little surprised he didn't play in the fourth but was fine with the decision after the game.\n\"Those five we had out there were rolling in the fourth quarter,\" Love said. \"I was ready, but we kept those guys in and they did a great job.\"\nWalker had 18 points and Nicolas Batum added 17 points and eight rebounds to lead Charlotte.\nWith Carolina Panthers quarterback Cam Newton sitting courtside in a Larry Johnson jersey, the Hornets led most of the way and took a 76-72 advantage into the fourth quarter.\nBut the Cavaliers rallied to take an 87-86 lead with a little more than 6 minutes to play behind a 3-pointer and a driving layup by Dellavedova. Smith extended the lead to four on a 3 from the right wing.\nThe Hornets cut the lead to two on Jeremy Lamb's jumper and had a chance to take the lead with 20 seconds left, but Batum missed a contested 3-pointer from the top of the key.\nSmith was fouled intentionally and added two free throws with 12.9 seconds remaining to make it a two-possession game. Batum missed another 3 with 9.2 seconds left and the Cavs put the game away.\nTIP-INS\nCavaliers: Timofey Mozgov returned to the starting lineup after missing the past three games with a strained right shoulder. He had eight points in 17 minutes. ... Dellavedova also returned after missing a game with tightness in his left calf and had seven points.\nHornets: Charlotte was 8 of 25 from 3-point range and committed 16 turnovers.\nHUG BETWEEN STARS\nNewton was introduced in the third quarter and started doing the \"dab\" as the crowd went wild and music played in the arena.\nHe later shared a hug with James after the game. James said the two stars have been friends since Newton played college football at Auburn.\n\"It's great to see him have success he is having for this franchise right now,\" James said. \"He is doing some unbelievable things not only on the field but off the field, too. Hopefully he continues to do what he's doing. He's a role model here in this city and the franchise should be happy to have him.\"\nPanthers coach Ron Rivera, linebacker Thomas Davis, fullback Mike Tolbert and defensive end Charles Johnson also attended the game.\nTOUGH FOURTH QUARTER\nAfter holding the Washington Wizards to six points in the fourth quarter on Wednesday night, the Hornets got a taste of their own medicine against the Cavaliers. Charlotte struggled in the fourth, scoring just 14 points on 7-of-24 shooting from the field.\nUP NEXT\nThe Cavaliers host Brooklyn on Saturday night.\nThe Hornets host Milwaukee on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994404.665291
}