{
  "game_id": "0022201069",
  "espn_id": "401469224",
  "date": "Mar 19, 2023",
  "matchup": "LAC @ POR",
  "headline": "Paul has 29 and Clippers down Blazers 111-102",
  "body": "PORTLAND, Ore. -- — Paul George had 29 points and the Los Angeles Clippers handed the Portland Trail Blazers their sixth straight loss with a 117-102 victory on Sunday night., \n\n\r\n              Kawhi Leonard added 24 for the Clippers as they fight for home-court advantage in the playoffs. Los Angeles was sitting at fifth in the Western Conference standings just a half-game behind of the Phoenix Suns. The Clippers have won five of their last six games. \n\n\r\n              “We expect to win. We come in and we expect to win, that's really the key,” George said. “We expect to play well, we know what we need to do and we know what it looks like when we're at our peak. We're dialed in, we're getting on guys if we're blowing coverage, if we're not where we need to be. I think we're holding each other accountable.”\n\n\r\n              Jusuf Nurkic finished with 23 points and 11 rebounds for the Blazers, who were in 13th in the West, well outside of playoff contention. Damian Lillard had 21 points and nine assists. \n\n\r\n              Portland never led in the game but pulled within 103-97 on Nurkic's layup in the fourth quarter. Leonard's jumper and George's 3-pointer pushed the Clippers' lead back to 108-97 and many Portland fans started heading for the exits. \n\n\r\n              “We've still got to get better,” Leonard said. “There's a lot of things — a lot of mistakes that we're making at times. So we've got to clean that up a little bit and see if we can just keep making leaps.”\n\n\r\n              Assistant coach Dan Craig was the acting head coach for the Clippers because Tyronn Lue had a non-COVID illness and did not travel with the team. It was Craig's third time standing in as head coach, and his first win. \n\n\r\n              Los Angeles was coming off a 113-108 loss at home to Orlando the night before, snapping a four-game winning streak. \n\n\r\n              “Feels pretty good. We needed a win and I thought it was just a good team contribution to come in here on the second night of a back-to-back,” Craig said.\n\n\r\n              The Clippers led by as many as 15 points in the first half but the Blazers closed the gap to 44-42 on Drew Eubanks' basket before Trendon Watford tied it with a layup. Portland was not able to pull in front and the Clippers led 59-55 at the break. \n\n\r\n              Paul George's dunk put Los Angeles up 76-66 midway through the third quarter but the Blazers hung around, pulling within 79-74 on another Eubanks basket. \n\n\r\n              “I thought the third quarter kind of hurt us a little bit but it was still nip and tuck in there the whole time, but just could never really pick up momentum,” Blazers coach Chauncey Billups said. “I thought we had so many stretches where we had good looks, just knock them down” \n\n\r\n              TIP INS\n\n\r\n              Clippers: Leonard started after sitting out the Clippers' loss to Orlando on Saturday because of injury management. ... The Clippers have won three straight against the Blazers, including a 118-112 victory on Nov. 29. The two teams play once more, on April 8 in Los Angeles. \n\n\r\n              Trail Blazers: Nassir Little returned after missed Portland's last game, a 126-112 loss to the Boston Celtics on Friday, because of a non-COVID illness. ... Lillard has scored 20 or more points in 31 straight games, an ongoing career record and the longest active streak in the NBA. \n\n\r\n              LISTEN TO THE KID\n\n\r\n              Craig said his 7-year-old son Brody is a “hoop junkie” who steals the team reports out of his dad's bag to study them. So when asked before the game if Brody had any advice for his father ahead of Sunday night's meeting with the Blazers, Craig laughed: “He's worried about Lillard.” \n\n\r\n              It was a valid concern, given that Lillard went into the game averaging 32.4 points, third in the league behind Philadelphia's Joel Embiid (33.5) and Dallas' Luka Doncic (33). \n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host the first of two games against Oklahoma City on Tuesday night. \n\n\r\n              Trail Blazers: Visit the Utah Jazz on Wednesday night. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994954.644288
}