{
  "game_id": "0022400180",
  "espn_id": "401704746",
  "date": "Nov 06, 2024",
  "matchup": "TOR @ SAC",
  "headline": "DeMar DeRozan scores 27 points to lead the Kings past the Raptors 122-107",
  "body": "SACRAMENTO, Calif. -- — DeMar DeRozan scored 27 points in a record-setting performance and the Sacramento Kings beat the Toronto Raptors 122-107 on Wednesday night.\n\n\r\n              Domantas Sabonis added 17 points, 13 assists and 11 rebounds for his third triple-double of the season for Sacramento. He shot 6 for 6 from the field and 5 for 5 at the free-throw line.\n\n\r\n              Keegan Murray chipped in with 22 points and 12 rebounds, and De’Aaron Fox scored 21.\n\n\r\n              The 35-year-old DeRozan has scored at least 20 points in each of his first eight games with the Kings, breaking a franchise mark established by Chris Webber when he reached 20 in his first seven games with Sacramento in 1999.\n\n\r\n              DeRozan spent the past three seasons with the Chicago Bulls. The six-time All-Star also has played for Toronto and San Antonio during his 16-year NBA career.\n\n\r\n              RJ Barrett had 23 points to lead the Raptors. Davion Mitchell scored 20 in his first game in Sacramento since being traded to Toronto last summer.\n\n\r\n              Takeaways\r\n              Raptors: Toronto led for most of the first three quarters before wilting in the fourth. The Raptors were outscored 33-14 in the final period.\n\n\r\n              Kings: Fox played strong defense but struggled again shooting from the floor as he is dealing with a finger injury. Fox went 5 for 17 and just 2 of 8 on 3-pointers. He is 5 for 25 from beyond the arc in his last three games. \n\n\r\n              Key moment\r\n              The Kings trailed 95-89 early in the fourth before going on a 9-0 run that gave them the lead for good. DeRozan started the spurt with a jumper, and Malik Monk scored the final seven points. \n\n\r\n              Key stat\r\n              Sabonis had the eighth game in the NBA since at least 1982-83 with a triple-double while missing no shots from the field or foul line. The previous player to do it was Josh Giddey for Oklahoma City against Portland on Jan. 11.\n\n\r\n              Up next\r\n              Raptors: At the Los Angeles Clippers on Saturday night, the third stop on a five-game trip.\n\n\r\n              Kings: Host the Clippers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997000.9328861
}