{
  "game_id": "0022200423",
  "espn_id": "401468578",
  "date": "Dec 14, 2022",
  "matchup": "LAC vs. MIN",
  "headline": "George has triple-double, Clippers beat Timberwolves 99-88",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 19 points, Paul George had a triple-double and the Los Angeles Clippers rallied to beat the undermanned Minnesota Timberwolves 99-88 on Wednesday night for their third straight victory.\n\n\r\n              George had 17 points, 11 rebounds and 11 assists for his first triple-double since joining the Clippers before the 2019 season. \n\n\r\n              “I don't know how he did that,” Leonard said. “I was like, ‘Who were you passing the ball to?’”\n\n\r\n              Luke Kennard added season highs of 16 points and four 3-pointers as six Clippers scored in double figures. \n\n\r\n              “We finally started making shots and played defense,” Leonard said. “We kept going from there.”\n\n\r\n              Coming off a 20-point victory over the NBA-leading Boston Celtics on Monday, the Clippers started out cold. They missed 13 of their first 15 shots and it wasn’t until the third that they shot over 30% from the floor.\n\n\r\n              Anthony Edwards led Minnesota with 19 points while in foul trouble. Rudy Gobert had 11 points and 13 rebounds.\n\n\r\n              “We couldn't make a bucket basically,” Wolves coach Chris Finch said. “Things dried up for us a little bit in the fourth.”\n\n\r\n              The teams were tied twice early in the fourth, the last time at 71 on Kyle Anderson's basket.\n\n\r\n              From there, the Clippers outscored the Wolves 25-9 before both teams brought in their benches for the final two minutes. Los Angeles ran off eight straight points and Kennard hit two 3-pointers while Nicolas Batum had another. \n\n\r\n              George scored four in a row, pushing the Clippers' lead to 91-78. He had a pair of free throws and Batum stole the ball and fed George for a layup.\n\n\r\n              “Just took what the defense game him, didn't force it,” Clippers coach Tyronn Lue said about George. “We've been talking about playing the right way, the simple way and he did it.”\n\n\r\n              Down five at halftime, the Clippers started Batum in the second half for Ivica Zubac, who left with left knee discomfort. Batum hit a 3-pointer and another basket for five quick points. He added another 3-pointer that pushed the Clippers' lead to 61-55.\n\n\r\n              “I needed a good scoring game at home finally because I've been pretty bad,” Batum said. \n\n\r\n              Minnesota took a 65-64 lead on Edwards' basket before Kennard's 3-pointer put the Clippers back in front by two going into the fourth.\n\n\r\n              The Timberwolves have been without Karl-Anthony Towns (right calf strain) the last couple weeks, and D'Angelo Russell (left knee contusion) is day-to-day.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Fell to 6-8 on the road and 2-6 against the West away from home. ... Jordan McLaughlin (left calf strain) missed his third straight game. ... Taurean Prince (right shoulder subluxation) remains out.\n\n\r\n              Clippers: It was George's fifth career triple-double and the 47th in franchise history. ... John Wall (left knee) sat out to avoid playing back-to-back on Thursday. ... Batum turned 34 and Robert Covington turned 32 on Wednesday. Batum said he was relieved to see France beat Morocco to reach the World Cup final.\n\n\r\n              UNDER 25\n\n\r\n              The Clippers held the Wolves under 25 points in all four quarters. “That's elite defense,” Lue said. Leonard called it “amazing basketball.”\n\n\r\n              OUCH!\n\n\r\n              A ball coming off the hands of Anderson hit Lue in the leg on the sideline. “He messed me up, I was hurting,” Lue said, “but I'm all right.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Oklahoma City on Friday night to conclude trip.\n\n\r\n              Clippers: Host Phoenix on Thursday night in the second game of a back-to-back.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994982.8500931
}