{
  "game_id": "0021600802",
  "espn_id": "400900207",
  "date": "Feb 10, 2017",
  "matchup": "MIL vs. LAL",
  "headline": "Lakers survive late Bucks rally to win 122-114",
  "body": "MILWAUKEE --  Still bothered by his team's lackluster play at the end of its last lengthy road trip in December, Luke Walton challenged his Los Angeles Lakers players to put out a better effort against the Milwaukee Bucks.\n\nWalton came away satisfied as the Lakers concluded a five-game road trip with a 122-114 win Friday night.\n\n\"To be at the end of a road trip like this and for as hard as we worked in practice (on Thursday), for them to come out and give that type of effort from the jump, I was very pleased with the overall game,\" Walton said.\n\nNick Young scored 26 points and the Lakers overcame a career-high 41 points by Giannis Antetokounmpo and withstood a furious late rally by the Bucks to finish the trip with a 2/3 record.\n\nYoung connected on his first eight shots from the field, including five 3-pointers. Lou Williams added 21 points for the Lakers, who led by as many as 27 before the Bucks, who trailed by 19 entering the fourth, rallied late, sparked by a 14-0 run.\n\n\"At the end of the day, you just want to win, especially against a team like the Lakers,\" Antetokounmpo said. \"They aren't a playoff team.\"\n\nA late dunk by the Bucks' Malcolm Brogdon was waived off for offensive basket interference. After a defensive stop, Greg Monroe's layup cut the lead to 114-109.\n\nAfter a near turnover by the Lakers, Williams was fouled and made two free throws with 24 seconds left to push the lead to seven and effectively secure the win.\n\nThe Bucks, who have lost 12 out of 14, played their first game since losing Jabari Parker for the season after he tore the ACL in his left knee in a home loss to Miami on Wednesday. Rookie Thon Maker replaced him in the starting lineup and finished with seven points and six rebounds in 17 minutes.\n\nThe Lakers led 76-55 at the half, setting their season high for points in any half this season. They shot 69 percent in the half, including sinking 10 of 16 three-point attempts.\n\nLos Angeles shot a blistering 82 percent, the best of any team in a quarter this season, to take a 47-30 lead after the first. The output matched the highest single-quarter points total in the league for the season. Young had 11 first-quarter points for Los Angeles, which led by as many as 19.\n\n\"We were attacking, we weren't settling,\" Walton said.\n\nFIGHTING BACK\n\nWalton, who dealt with serious back troubles during his playing days, said the road to recovery that Parker is facing often can be a struggle. \"For me, I got to dark places, for sure,\" Walton said. \"Ultimately, it comes down to you making the sacrifice to put that work in.\"\n\nTIP-INS\n\nLakers: Fouled as he attempted a 3-pointer from the top of the key just before halftime, Young watched from his back near the half-court circle as the shot swished through the net. He converted the free throw for a four-point play, his second of the game. \"I was thinking, OK, this is one of them nights,\" Young said. ... After seeing his team allow a driving layup to Matthew Dellavedova, Walton called a timeout just 17 seconds into the third quarter.\n\nBucks:  Khris Middleton, who returned on Wednesday after missing the first 50 games of the season with a torn hamstring, scored six points in nearly 21 minutes. Bucks coach Jason Kidd said Middleton will rest and not travel with the team to Indiana. ... Spencer Hawes was active for the first time since being acquired from Charlotte in a Feb. 2 trade for Miles Plumlee, but didn't play. ... Roy Hibbert, acquired along with Hawes, was inactive and has yet to suit up for his new team.\n\nUP NEXT\n\nLakers: Host Sacramento on Tuesday before going back on the road Wednesday. The teams have split their first two matchups.\n\nBucks: Play at Indiana on Saturday. Milwaukee knocked off the Pacers 125-107 on Nov. 3 in the teams' first and only matchup so far. The 125 points rank as the team's third-highest total of the season.",
  "source": "espn_api",
  "crawled_at": 1764995167.4725409
}