{
  "game_id": "0022301059",
  "espn_id": "401585687",
  "date": "Mar 27, 2024",
  "matchup": "PHX @ DEN",
  "headline": "Kevin Durant scores 30 points to lead Suns to another win in Denver, 104-97",
  "body": "DENVER -- — Kevin Durant had 30 points, 13 rebounds and five blocks and the Phoenix Suns won in Denver for the second time this month, beating the defending champion Nuggets 104-97 on Wednesday night.\n\n\r\n              “I’m glad we didn’t let that San Antonio game bleed over to the next game,” Durant said in reference to the Suns' road loss Monday night to a Spurs team without rookie sensation Victor Wembanyama. \n\n\r\n              The Suns, with the toughest remaining schedule in the NBA, moved a half-game ahead of Sacramento for the seventh spot in the Western Conference as they try to move up to sixth to avoid a play-in game. Dallas is No. 6, a half-game ahead of Phoenix.\n\n\r\n              The Western Conference-leading Nuggets struggled without starting point guard Jamal Murray, who missed his third straight game with a sprained left ankle.\n\n\r\n              Nikola Jokic had 22 points, nine rebounds and 10 assists as he fought through lower back pain and left hip soreness.\n\n\r\n              The Nuggets, a half-game ahead of Oklahoma City and Minnesota, lost for just the third time in 18 games since the All-Star break, and two of those losses have come at home to the Suns, who prevailed 117-107 in overtime at Ball Arena on March 5.\n\n\r\n              Denver won six straight games at home after that, but Wednesday night were again victimized by terrific long-range shooting from the Suns, who made 16 of 33 shots from behind the arc. Denver was 10 of 40 on 3s.\n\n\r\n              Michael Porter Jr. and Aaron Gordon each added 18 points for Denver, but the Nuggets' bench shot just 5 of 19 and Denver was outrebounded 39-29.\n\n\r\n              “Not once did I think these guys are playing harder than us,\" Denver coach Michael Malone said. \"For most teams, every game is an important game. We're trying to keep the No. 1 seed. You don't have to come off a bad loss at San Antonio (like the Suns did) to be in a desperate game.\n\n\r\n              “So, I think our guys definitely played hard. Could we have played better? Of course. And could we have made more shots? That definitely would have helped the outcome.\" \n\n\r\n              Jusuf Nurkic was out for Phoenix with a sprained right ankle after the center was hurt in the third quarter of the Suns' 104-102 loss at San Antonio on Monday night.\n\n\r\n              Bradley Beal left that game with a sprained right ring finger, but he started Wednesday night and sank a trio of 3-pointers in the first quarter, setting the tone for another sizzling shooting performance by the Suns, who sank 15 3-pointers at Ball Arena in their last visit.\n\n\r\n              Thad Young's fadeaway 6-foot jumper over Jokic's outstretched arms gave the Suns a 59-52 halftime lead, and Durant scored half of Phoenix's points in a 10-0 run the Suns used to take control early in the third quarter.\n\n\r\n              The Nuggets pulled to 71-68, but they watched the Suns re-establish themselves via a turnaround jumper from Durant and back-to-back 3-pointers from Booker and Eric Gordon that restored Phoenix’s double-digit lead that was never really threatened again.\n\n\r\n              “I would say we didn’t have carryover,\" Suns coach Frank Vogel said. \"It showed up as focus and intensity. We know what’s at stake. We know how many games we have left. We know what the schedule looks like. \n\n\r\n              “We still say we remain confident against anybody on the schedule, as illustrated by coming in and beating the champs in their building. So next game up. The competition is fierce. We’re going to have to repeat this and stay at this level to continue to win games.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Oklahoma City on Friday night.\n\n\r\n              Nuggets: Host Minnesota on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996638.905899
}