{
  "game_id": "0021800609",
  "espn_id": "401071285",
  "date": "Jan 09, 2019",
  "matchup": "ATL @ BKN",
  "headline": "Nets climb out of early hole, beat Hawks 116-100",
  "body": "NEW YORK --  The Nets already showed they can fight their way out of tough times, having left an eight-game skid behind last month.\n\nSo a 19-point deficit certainly wasn't going to deter them.\n\nD'Angelo Russell scored 23 points, Ed Davis grabbed a season-high 16 rebounds, and the Nets climbed out of their early hole to beat the Atlanta Hawks 116-100 on Wednesday night.\n\nDeMarre Carroll added 17 points to help the Nets improve to 21-22 with their eighth victory in their last nine home games. They managed only 20 wins for the entire season just two years ago, but have engineered a big turnaround after a slow start to this season. On Wednesday, they did the same thing in the game.\n\n\"I don't think in the beginning of the year we would have finished the game out like we did. But now we've grown,\" center Jarrett Allen said.\n\nThey yielded 46 points in the first 15 minutes, then held the Hawks to 37 points over the next 25 minutes.\n\nJoe Harris, back after a one-game absence with a sprained right ankle, scored 16 points, as did Spencer Dinwiddie.\n\nJohn Collins had 30 points and 14 rebounds for the Hawks, who may have run out of steam after their strong start while playing a night after a close loss in Toronto. Trae Young had 17 points and seven assists, and Jeremy Lin added 16 points.\n\n\"I think we came out with the momentum from last night's game,\" Hawks coach Lloyd Pierce said. \"A lot of energy, a lot of movement, a lot of pace, attacking downhill and then we just ran out of gas.\"\n\nThe Hawks jumped to a 13-4 lead behind two three-point plays from Collins, who scored 12 points in the first quarter to help Atlanta open a 38-23 lead. The Hawks extended the lead to 46-27 on Young's three-point play after his steal about three minutes into the second, but the Hawks stalled from there and Brooklyn got it down to 57-51 at halftime.\n\nThe Nets then got the first basket of the second half and Hawks called timeout just 18 seconds in. Harris knocked down three 3-pointers over the next few minutes as the Nets moved ahead after trailing the entire first half, and they gained control for good by scoring the last nine of the third quarter, capped by Davis' three-point play, to bring an 86-80 edge to the fourth.\n\n\"Guys just vocalized that we needed to pick up the energy, just compete harder,\" Harris said. \"That's all it really boiled down to. It had nothing to do with Xs and Os, making shots, anything like that. It was just competing harder and we did a better job to help us in the defensive end in the second quarter.\"\n\nTIP-INS\n\nHawks: There was a video tribute for Vince Carter during a first-quarter timeout. Carter is third on the Nets' career scoring list. He had three points. ... Collins had his 11th 20-point, 10-rebound game.\n\nNets: Starting F Jared Dudley left in the third quarter with an injured left hamstring. He lost the ball while driving to the basket, raised his hand to check out of the game and walked directly to the nearby tunnel toward the locker room. ... The Nets have beat the Hawks four straight times, matching a franchise record.\n\nGOOD TIMES, BUT IS IT GOOD-BYE?\n\nCarter enjoyed watching the video of his highlights of his 4 1/2 seasons as a Net. He turns 42 this month and is in his 21st season, but hasn't said if he will retire. Still, he didn't mind that the video may have been premature.\n\n\"I'm OK with it. Either way it's cool,\" he said with a smile. \"I'm very thankful for it, that they even considered it.\"\n\nTOUGH TIMES DON'T LAST\n\nIt was about a month ago that the Nets had dropped eight straight games to fall to 8-18. They then knocked off Toronto on Dec. 7 to start a seven-game winning streak. Coach Kenny Atkinson said that while losing so much feels like an \"apocalypse,\" he leaned on his days as a Hawks assistant to Mike Budenholzer.\n\n\"I always reference the Atlanta days, when we lost 15 out of 16,\" he said of the 2013-14 season, when the Hawks actually lost 14 of 15.\n\n\"Who knew the next year we were going to win 60 games or whatever? So with Coach Bud, whether it was during that losing streak or during the winning streak, we kind of conducted business as usual and stuck with our kind of beliefs and our culture.\"\n\nUP NEXT\n\nHawks: At Philadelphia on Friday night.\n\nNets: At Toronto on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995363.799268
}