{
  "game_id": "0021400672",
  "espn_id": "400578964",
  "date": "Jan 26, 2015",
  "matchup": "OKC vs. MIN",
  "headline": "Thunder down Timberwolves behind Russell Westbrook, Serge Ibaka",
  "body": "OKLAHOMA CITY --  Without Kevin Durant, the Thunder seamlessly shifted to their alter ego.\n\nRussell Westbrook scored 18 points, Serge Ibaka added 13 points and a season-high 19 rebounds, and Oklahoma City gutted out a 92-84 victory over the Minnesota Timberwolves on Monday night.\n\nDurant sat out after spraining the big toe on his left foot Sunday against the Cleveland Cavaliers. The normally explosive Thunder adjusted and fell back on the the grind-it-out, defense-first approach that kept them competitive while Durant was out for the first 17 games of the season with a broken bone in his right foot. The Thunder won, despite shooting just 42 percent from the field.\n\n\"I thought we did a good job of playing defense for 48 minutes and not letting our offense dictate our defense,\" Westbrook said.\n\nWestbrook shot just 7 for 22 from the field, but was 4 for 6 and scored 11 points in the fourth quarter to help the Thunder remain in control. Ibaka played one of his best games of the season. He made 6 of 13 shots and had two blocks and two steals.\n\nReserves Anthony Morrow and Reggie Jackson each added 14 points to help Oklahoma City's bench outscore Minnesota's 45-21. The Thunder reserves are used to coming up big because Durant has missed 24 games this season.\n\n\"I think what is the case now is we don't have that shock factor,\" Thunder forward Nick Collison said. \"We understand that we're capable of playing and we're fine.\"\n\nAndrew Wiggins scored 23 points, Thaddeus Young had 22 and Gorgui Dieng had a season-high 18 rebounds for the league-worst Timberwolves, who shot a season-low 34.1 percent from the field.\n\n\"One thing I love about the guys is we continue to fight and scrap and find ways to get stops,\" Thunder coach Scott Brooks said.\n\nOklahoma City led 25-19 at the end of the first quarter, then pushed the lead to 15 in the second. In the closing seconds of the first half, Nick Collison threw a pass the length of the court. Perry Jones caught the ball off the bounce in front of everyone and scored a reverse layup with 0.5 seconds remaining to give the Thunder a 48-40 lead at the break.\n\nWiggins scored 13 points in the first half to help the Timberwolves stay in the game.\n\nBack-to-back baskets by Young cut Oklahoma City's lead to 57-54 midway through the third quarter.\n\nWith the Thunder leading 62-56 late in the third quarter, Minnesota coach Flip Saunders was issued a technical foul for loudly disagreeing with a call against Wiggins. Jackson made all three free throws to bump Oklahoma City's lead to nine heading into the fourth.\n\nSaunders never expected an easier road when he learned Durant wouldn't play.\n\n\"How are you going to take advantage?\" he said. \"They have got Westbrook, one of the top five players (in the league) and eight guys that have been to the conference finals. They are still a good team.\"\n\nTIP-INS\n\nTimberwolves: F Robbie Hummel is out indefinitely with a broken finger on his right hand he suffered Sunday against Atlanta. ... Kevin Martin missed his 34th consecutive game with a fractured right wrist. He was listed as questionable, but did not dress.\n\nThunder: C Steven Adams, who missed Sunday's game against Cleveland with a migraine, started. ... Jones, who didn't play at all Sunday against Cleveland, started against Minnesota. He finished with six points in 25 minutes. ... C Kendrick Perkins was issued a technical foul with 4:16 left in the second quarter.\n\nON THE RISE\n\nWiggins, the No. 1 pick in the 2014 draft, played solid defense on Westbrook. Saunders said he felt Wiggins had potential to be a great defender when the Timberwolves made the deal to get him from Cleveland.\n\n\"I thought that he could be a great two-way type of player, and I still believe that,\" Saunders said. \"He showed signs of that tonight.\"\n\nQUOTE OF THE NIGHT\n\nBrooks' opening statement to the media at his postgame press conference, given the ugliness of the game: \"I'm surprised you guys stayed.\"\n\nUP NEXT\n\nTimberwolves: Host Boston on Wednesday.\n\nThunder: At New York on Wednesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764991894.265253
}