{
  "game_id": "0021500985",
  "espn_id": "400828872",
  "date": "Mar 13, 2016",
  "matchup": "MIL @ BKN",
  "headline": "Antetokounmpo's fourth triple-double in 11 games leads Bucks",
  "body": "NEW YORK -- Giannis Antetokounmpo bolted from foul line to foul line in just a few dribbles, and after setting up teammates so frequently, this time it was his turn.\nHe faked a pass and leaped from just inside the line for a dunk so powerful that it may have been the reason photographers had to fix a camera mounted to the backboard at halftime.\n\"There's only a couple people in the world that probably can make that play, and he's one of them,\" Bucks teammate Greg Monroe said.\n\nAntetokounmpo had 28 points, 14 assists and 11 rebounds, nearly getting his fourth triple-double in the last 11 games by halftime, and Milwaukee beat the Brooklyn Nets 109-100 on Sunday night.\nAntetokounmpo already had 12 points, nine assists and eight rebounds by the half on his way to becoming the first Bucks player with four triple-doubles in a season. All of them have come since Feb. 22.\n\"Sometimes it doesn't look like he's sweating, or breathing hard,\" Bucks coach Jason Kidd said, \"and that just shows how talented he is.\"\nJabari Parker added 23 points, and Khris Middleton had 19 points to help the Bucks win their third straight game. Playing for the second straight night and delayed getting into Brooklyn by plane trouble, they got off to a strong start thanks to Antetokounmpo's seven assists in the first quarter.\n\"That's what I was trying to do,\" he said. \"I was trying to make the right plays and find the open guy, but doing that you've got to stay aggressive.\"\nBrook Lopez scored 20 points for the Nets, who dropped their fourth in a row. Sean Kilpatrick tied his career high with 19 in his first home game with the Nets after they returned from a franchise-record, nine-game trip.\nThe Nets committed 12 turnovers that led to 17 points in the fourth quarter of their first home game since Feb. 22 as Milwaukee seized control after trailing 79-78 through three.\n\"The Achilles heel with this team so far this year is late games and the crunch time, and they haven't been able to deliver part of the plays,\" Nets interim coach Tony Brown said.\nAntetokounmpo set up Miles Plumlee's dunk that put Milwaukee ahead for good at 99-98 with 3:21 to play. The Bucks kept expanding it from there on a finishing 12-2 run, helped repeatedly by the Nets' turnovers that sent Antetokounmpo leading a fast break in the other direction.\nThaddeus Young had 17 points and 10 rebounds and was one of the Nets who couldn't stop Antetokounmpo, who shot 12 for 16 from the field.\n\"He puts a lot of pressure on you,\" Young said. \"He's very aggressive and has the green light.\"\nTIP-INS\nBucks: Because of plane trouble, the Bucks didn't get into New York until early Sunday afternoon. Their plane wasn't able to take off Saturday night after their victory over New Orleans in Milwaukee, so they remained there overnight. ... Antetokounmpo's seven assists in the first quarter matched the high for a Bucks player in any period this season.\nNets: Brooklyn was swept in the three-game season series. The Nets dropped the first two in their first seven games of the season. ... G Wayne Ellington missed the game with an upper respiratory infection. ... Brooklyn wore \"Los Nets\" jerseys as part of the NBA's Latin Nights series.\nWHERE DID EVERYBODY GO?\nLopez is the only player remaining from the Brooklyn team that Kidd coached to the second round in the 2013-14 season. Kidd got the Bucks job that July in what began the team's breakup. Paul Pierce wasn't re-signed and many more moves followed.\n\"That happens in sports. Change happens all the time, from coaches to players, so the teams that tend to win are the ones who stick together, are together for a long time,\" Kidd said. \"You look at Golden State, you look at San Antonio, you look at Oklahoma City, those are the teams that are atop the NBA and those are the teams that tend to win, so for Brooklyn or Milwaukee, we're all trying to strive to be consistent.\"\nUP NEXT\nBucks: Host Toronto on Tuesday night.\nNets: Host Philadelphia on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994014.3973482
}