{
  "game_id": "0022400080",
  "espn_id": "401704646",
  "date": "Oct 25, 2024",
  "matchup": "CLE vs. DET",
  "headline": "Mitchell, Wade help Cavaliers beat Pistons 113-101 in Bickerstaff's return to Cleveland",
  "body": "CLEVELAND -- — Donovan Mitchell and Dean Wade scored 19 points apiece and Cleveland won its home opener 113-101 on Friday night over the Detroit Pistons and former Cavaliers coach J.B. Bickerstaff.\n\n\r\n              Jarrett Allen added 17 and 11 rebounds as the Cavs won their 10th straight over the Pistons to give new coach Kenny Atkinson a win in his home debut and a 2-0 start.\n\n\r\n              Bickerstaff got a mixed reaction from fans in his return after being fired after last season despite leading the Cavs to the Eastern Conference semifinals. \n\n\r\n              Cade Cunningham scored 33 and Jaden Ivey 22 for the Pistons, who were still within eight in the fourth quarter when Wade made back-to-back 3-pointers in a 31-second span to put the Cavs ahead 105-91 with 6:17 left.\n\n\r\n              Takeaways\r\n              Pistons: More positive signs as Detroit played its second straight solid game but came up short. The Pistons only won 14 games last season but have some good core pieces for Bickerstaff to develop.\n\n\r\n              Cavaliers: For the second straight game, they handled business against a weaker team. It's been a solid start under Atkinson, who is still toying with rotations as he learns more about his team.\n\n\r\n              Key moment\r\n              Cavaliers reserve Ty Jerome provided a huge spark off the bench, scoring 10 points and getting three assists in eight minutes as Cleveland took control in the first half, closing with a 13-4 run to go up by 10. Jerome played in just two games last season due to a serious ankle injury. The Cavs raved about him during camp with GM Koby Altman calling him “the MVP of September” and Atkinson has him in the rotation already.\n\n\r\n              Key stat\r\n              Cunningham was guilty of trying to do too much at times and committed a game-high nine turnovers.\n\n\r\n              Up next\r\n              The Pistons head home to host the NBA champion Boston Celtics on Saturday while the Cavaliers travel to Washington on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998326.8763242
}