{
  "game_id": "0021600871",
  "espn_id": "400900277",
  "date": "Feb 25, 2017",
  "matchup": "CHI @ CLE",
  "headline": "Bulls take advantage of James' absence, beat Cavs 117-99",
  "body": "CLEVELAND --  With LeBron James missing from Quicken Loans Arena, the Cleveland Cavaliers were reminded again just how tough life can be without their star.\n\nJames stayed home with strep throat while Dwyane Wade scored 20 points and Jimmy Butler recorded a triple-double, leading the Chicago Bulls to a 117-99 victory Saturday night.\n\nCleveland coach Tyronn Lue said he wasn't sure how long the Cavaliers would be without the four-time MVP. Cleveland struggled as it often does without James -- they are 4-19 without him since he returned to Cleveland in 2014, including 0-4 this season.\n\nForward Tristan Thompson knows opposing teams won't feel sorry for the Cavaliers when James isn't on the court.\n\n\"It's a long season,\" he said. \"Guys are going to be out. Guys are going to be hurt. Guys are going to be sick. It's part of the game of basketball. Whether it's LeBron or whoever it might be, we have to be ready to play.\"\n\nChicago has won all three games against Cleveland this season. It took advantage of James' absence to win its fourth straight overall.\n\nWade was 9 of 18 from the field and had 10 assists with eight rebounds. Butler had 18 points, including 13 in the third quarter, to go along with 10 rebounds and 10 assists.\n\n\"Of course, I wanted to play against LeBron,\" said Wade, a longtime friend of James. \"But once we knew he wasn't playing, we had to put that to the back of our mind and focus on playing a team with Kyrie Irving.\"\n\nIrving led Cleveland with 34 points, hitting 13 of 25 from the field. Kyle Korver scored 14 points before limping to the locker room after landing awkwardly on his right leg late in the fourth quarter.\n\nButler didn't score until hitting a 3-pointer late in the second quarter. The game was tied nine times and featured 10 lead changes in the first half. The Bulls pulled away from a 65-all tie midway through the third quarter and used an 11-0 run to gain control.\n\nThe Cavaliers have lost seven straight without James, dating to March 16 of last season when they beat Dallas.\n\nJames remained home for Saturday morning's shootaround, and Lue announced about 90 minutes before tip-off that he wouldn't play. Lue confirmed James had strep throat after the game. James is averaging 25.7 points per game.\n\nChicago had seven players in double figures. Rajon Rondo scored 15 points and Nikola Mirotic added 14.\n\nJames Jones scored 14 points for the Cavaliers, also playing without the injured Kevin Love and J.R. Smith. It appeared Korver might join the list when he walked gingerly to the locker room, but he said tests after the game showed no structural damage.\n\n\"I'm feeling fortunate,\" he said. \"I feel like it could have been a lot worse. It was really scary. I landed kind of short-legged. You've seen a lot of bad injuries when that happens, but I think I'm going to be OK.\"\n\nHELP ON THE WAY\n\nDeron Williams is expected to sign with Cleveland on Monday. The veteran point guard cleared waivers Saturday and told the Cavaliers he intends to sign with them. Williams will give Cleveland another playmaker and can also back up Irving at point guard.\n\nTIP-INS\n\nBulls: G Michael Carter-Williams didn't make the trip after injuring his knee Friday against Phoenix. Coach Fred Hoiberg said he was unclear about a timetable for Carter-Williams' return. Jerian Grant started in place of Williams. ... G Cameron Payne, acquired from Oklahoma City before the trade deadline, scored six points in his team debut.\n\nCavaliers: Richard Jefferson started for James and scored nine points. ... Korver moved into fifth place on the career 3-pointers list (2,015). ... Thompson, not known for his outside shooting, hit a 20-footer as the shot clock expired in the second quarter.\n\nUP NEXT\n\nBulls: Host Denver on Tuesday. Chicago has an 18-11 record at United Center this season.\n\nCavaliers: Host Milwaukee on Monday. Cleveland is 2-1 against the Bucks this season.",
  "source": "espn_api",
  "crawled_at": 1764995035.028163
}