{
  "game_id": "0021900558",
  "espn_id": "401161200",
  "date": "Jan 08, 2020",
  "matchup": "HOU @ ATL",
  "headline": "Rockets hold off Hawks, Harden posts another triple-double",
  "body": "ATLANTA --  James Harden's big first quarter gave Houston a lead that seemed safe.\n\nHis misses helped give Atlanta a chance.\n\nHarden scored 41 points, including 22 in the first quarter, to lead the Houston Rockets over Trae Young and the Hawks 122-115 on Wednesday night.\n\nHarden had 10 assists and 10 rebounds for his second straight triple-double. He made only 9 of 34 shots, including 4 of 20 3-pointers.\n\nYoung kept pace. The Hawks' second-year point guard had 42 points, 13 rebounds and 10 assists. He and Harden are the first players to post 40-point triple-doubles in the same game, according to the Elias Sports Bureau.\n\nHarden faded in the second half, when he made only 2 of 18 shots.\n\n\"I think, obviously, we had a couple guys run out of gas,\" said Houston coach Mike D'Antoni. \"... Our legs got tired obviously. We just had to hang on.\"\n\nD'Antoni said Harden \"just didn't shoot the ball well. So be it.\"\n\nHarden had 44 points, 11 rebounds and 11 assists for his first triple-double of the season in a 118-108 win over Philadelphia on Friday night.\n\nThe Hawks pulled within three late in the fourth quarter, the last time at 118-115 on two free throws by Alex Len. Harden sank four free throws in the final 10.4 seconds.\n\n\"They made shots,\" Harden said. \"We missed shots. They're a feisty team.\"\n\nClint Capela had 22 points and 22 rebounds, and Ben McLemore had 18 points in Houston's third straight win.\n\nHarden more than made up for the absence of Russell Westbrook, his usual backcourt partner. D'Antoni had a confident answer when asked before the game about the impact of Westbrook being rested.\n\n\"Just more James,\" D'Antoni said.\n\nIt was a safe prediction.\n\nHarden, who scored 60 points in his last game against Atlanta in November, set out on another high-scoring pace. The NBA's leader at 38.4 points per game, Harden abused the Hawks with his mix of 3-pointers and drives. Atlanta's frequent best answer was to foul him, and he made 19 of 23 free throws.\n\nHouston led 45-29 after the first quarter and pushed the lead to 20 in the second period.\n\nThe Hawks rallied in the third, cutting the Houston lead to 87-83.\n\nFollowing Houston's timeout, Harden sank a 3-pointer to start a 12-2 run to close the period, pushing the lead back to double figures. McLemore had two 3s in the run.\n\nAtlanta again pulled close in the final period. Len's three-point play pulled the Hawks to 108-105.\n\nTIP-INS\n\nRockets: Eric Gordon had 17 points in his fourth game back after missing 22 games. He had arthroscopic knee surgery on Nov. 13. ... The 45 first-quarter points wasn't the high mark for any quarter this season. Houston scored 46 third-quarter points in the first win over Atlanta and had 48 fourth-quarter points at Washington on Oct. 30.\n\nHawks: John Collins had 17 points and 14 rebounds. ... The triple-double was Young's second this season and third of his career. ... F Bruno Fernando, who had been listed as a starter, was held out for personal reasons. Cam Raddish moved into the starting lineup. ... After missing four straight games with a right shoulder impingement, F Jabari Parker will be re-evaluated in two weeks following a non-surgical procedure on the shoulder on Tuesday. Parker is Atlanta's third-leading scorer with 15 points per game.\n\nREASON FOR HOPE\n\nThe Hawks have the NBA's worst record (8-30) but Young said it is \"super exciting to see\" the team's effort against Houston. \"We've got a lot of our guys back healthy,\" Young said. \"We just have to figure out how to close out games.\"\n\nAPPRECIATING CAPELA\n\nHarden said Capela's stat line didn't tell the whole story of his contribution, especially on defense.\n\n\"He does that every night,\" Harden said. \"He doesn't get credit for it. He guards the best player every single night.\"\n\nUP NEXT\n\nRockets: At Oklahoma City on Thursday night, continuing a stretch of five games in seven days.\n\nHawks: Visit Washington on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996636.0333922
}