{
  "game_id": "0021600487",
  "espn_id": "400899929",
  "date": "Dec 29, 2016",
  "matchup": "OKC @ MEM",
  "headline": "Gasol, Randolph lead Grizzlies past OKC as Westbrook tossed",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies were already rolling when Russell Westbrook took his leave -- ejected after a pair of technical fouls.\n\nFrom there, the Grizzlies just continued to pile on the points.\n\nMarc Gasol scored 25, Zach Randolph added 21 and the Grizzlies built their fourth-quarter cushion to 37 before coasting to a 114-80 victory over the Oklahoma City Thunder on Thursday night.\n\nTroy Daniels helped the lead swell in the fourth, shooting 6 of 8 from outside the arc in the final period while scoring all 22 of his points.\n\n\"I just was happy with the effort,\" Memphis coach David Fizdale said. \"That's all I cared about -- seeing us play harder. Sprinting back on defense, diving on the floor for loose balls.\"\n\nMemphis weathered a bit of an early second-half rally and still led 61-45 when Westbrook was whistled for two technicals with 6:41 left in the third.\n\n\"Honestly, it's crazy, man, especially to be ejected when I didn't do nothing,\" Westbrook said. \"It was just crazy, especially for me because I don't feel I get the benefit of the doubt most of the time, especially throughout the game, with the refs.\"\n\nWestbrook, the NBA's leading scorer at 31.7 points per game, left with 21 points, five rebounds and no assists. Enes Kanter scored 19 as Oklahoma City set a season low for points.\n\n\"I thought (the Grizzlies) did a terrific job defensively,\" Thunder coach Billy Donovan said. \"They've been good defensively all year long. I think there are some things that we certainly could have done a whole lot better.\"\n\nThe loss snapped Oklahoma City's four-game winning streak, while Memphis ended a two-game skid.\n\nThe Thunder never got the Memphis lead under double digits in the second half.\n\nTIP-INS\n\nThunder: G Victor Oladipo missed his ninth game with a right wrist injury. Anthony Morrow, the most common replacement for Oladipo, started his seventh game of the season. ... The Thunder had six turnovers in the first quarter, all by Westbrook.\n\nGrizzlies: Have 10 wins in December, the first time they've accumulated double-digit wins in the month. ... Randolph played in his 1,012th career regular-season game. Exactly half of them (506) have come in a Memphis uniform. ... Daniels' 22 points in the fourth tied a franchise record for one quarter. Greg Anthony had 22 in a quarter against Detroit on Dec. 7, 1995, when the team was in Vancouver.\n\nBIG TOE, NO-GO\n\nMemphis PG Mike Conley missed his second game with a bum left big toe. Fizdale said it was caused by \"a broken toenail type of thing,\" adding: \"When those 7-footers step on your toes, that's not pleasant.\"\n\nTRIPLE-DOUBLE ZERO\n\nWestbrook's ejection assured Memphis would maintain its streak of not allowing a triple-double in 176 games -- the longest current run in the league. The Grizzlies haven't allowed a triple-double since Dec. 13, 2014, when Michael Carter-Williams had 16 points, 11 rebounds and 11 assists for the Philadelphia 76ers.\n\nMORE FROM WESTBROOK\n\n\"I get so many techs just for talking. I can't even say nothing when I'm getting hammered every time I go to the damn basket through the games and previous games,\" Westbrook said. \"Not tonight, but every night. I just don't get reffed the same way as other people, and I don't appreciate it.\"\n\nAND NOW FROM THE CHIEF\n\nJason Phillips, the officiating crew chief, speaking to a pool reporter, said Westbrook's beef was about a shot clock reset regarding whether a Grizzlies shot hit the rim. Phillips used the term \"adamant\" several times in describing the Thunder guard's complaint. Officials advised Westbrook they heard his point, and it was time to move on. Westbrook continued to gripe, drawing the first technical. The complaint continued \"and then even proceeds to use some profanity,\" Phillips said. \"At that point, he's issued a second technical foul.\"\n\nUP NEXT\n\nThunder: Oklahoma City returns home for a New Year's Eve game against the Clippers, the only Thunder home game in a six-game stretch.\n\nGrizzlies: Start a four-game West Coast road swing on New Year's Eve at Sacramento.",
  "source": "espn_api",
  "crawled_at": 1764995299.204719
}