{
  "game_id": "0022400465",
  "espn_id": "401705031",
  "date": "Jan 02, 2025",
  "matchup": "MIL vs. BKN",
  "headline": "Nets build big lead and barely hang on down the stretch for 113-110 victory over Bucks",
  "body": "MILWAUKEE -- — Cam Johnson scored 26 points, Cam Thomas had 24 and the Brooklyn Nets withstood a frantic Milwaukee comeback attempt down the stretch to beat the Bucks 113-110 on Thursday.\n\n\r\n              Brooklyn led by as many as 24 and still owned a 111-90 advantage with less than seven minutes left before the Bucks scored 20 straight points. The Bucks had the ball with a chance to take the lead, but Giannis Antetokounmpo couldn’t finish on his drive to the basket.\n\n\r\n              Brooklyn’s Ziaire Williams got the rebound and hit two free throws with 6.1 seconds left.\n\n\r\n              Damian Lillard missed two potential tying 3-point attempts in the last 4.1 seconds. \n\n\r\n              Antetokounmpo had 27 points, 13 rebounds and seven assists while shooting 12 of 24 from the floor. \n\n\r\n              Milwaukee’s Andre Jackson Jr. was ejected from the game with 9.9 seconds left in the first half for making unnecessary and excessive contact with Brooklyn’s Nic Claxton. \n\n\r\n              Takeaways\r\n              Nets: Brooklyn went 3-1 against the Bucks this season, including two wins at Milwaukee over the last eight days. The last time the Nets beat the Bucks as many as three times within the same regular season is 2013-14.\n\n\r\n              Bucks: Antetokounmpo has scored at least 20 points while shooting at least 50% from the floor in each of his 26 games this season, the longest such streak in NBA history. Shaquille O’Neal (January-March 2001) and Zion Williamson (February-April 2021) were the only players to score at least 20 points and make at least half their shot attempts in 25 straight games. \n\n\r\n              Key moment\r\n              D'Angelo Russell, who had 11 points and 12 assists, was carried to the locker room in the final minute with what Nets coach Jordi Fernandez said was cramps. Johnson tweaked his ankle in the final seconds.\n\n\r\n              Key stats\r\n              The Nets' last basket came with 6:55 left, but they still found a way to win.\n\n\r\n              Up next\r\n              Both teams play at home Saturday, with the Nets facing the Philadelphia 76ers and the Bucks meeting the Portland Trail Blazers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997842.662291
}