{
  "game_id": "0022300723",
  "espn_id": "401585351",
  "date": "Feb 06, 2024",
  "matchup": "CHI vs. MIN",
  "headline": "Coby White rallies the Bulls to a wild 129-123 overtime win against the Timberwolves",
  "body": "CHICAGO -- — Coby White and DeMar DeRozan scored 33 points apiece, and the Chicago Bulls erased a 23-point deficit in a 129-123 overtime victory over Anthony Edwards and the Minnesota Timberwolves on Tuesday night.\n\n\r\n              Nikola Vucevic had 24 points for Chicago, and Andre Drummond finished with 16 points, 16 rebounds and four blocked shots. The Bulls were coming off a 123-115 loss to Sacramento in which they nearly rallied all the way back from a 30-point deficit.\n\n\r\n              “We started to make shots and the crowd starts to get into it, get behind and we changed the momentum of the game,” White said. “But it’s not a fun way to live: digging yourselves in a hole. We’ve got to figure out a way to at least not make the first half and the second half look so drastically different.”\n\n\r\n              Edwards had 38 points and 12 rebounds for Minnesota, which had won three of four. Karl-Anthony Towns scored 33 points in the opener of a four-game trip.\n\n\r\n              The Timberwolves jumped out to a 22-point halftime lead, and Edwards’ 3-pointer made it 74-51 with 10:32 left in the third quarter. But White led the Bulls back, scoring 30 points after the break.\n\n\r\n              \"Coby White is an incredible basketball player,” Drummond said. “This is what he does. He was really big for us in that third (quarter), hitting a lot of big shots. Defensively he was great, it was an all-around great night for him. He was a great leader for us today.”\n\n\r\n              Towns’ 3 tied it at 115 with 50.5 seconds left, and DeRozan missed a turnaround jumper as time expired in regulation.\n\n\r\n              DeRozan redeemed himself by scoring the Bulls’ first six points of overtime, going over 30 points for the fifth time this season. DeRozan also had five assists and four steals as the Bulls won despite the injury absences of Patrick Williams and Zach LaVine, who is expected to undergo season-ending surgery on his right foot later this week.\n\n\r\n              ″(DeRozan) has shown he’s Mr. Fourth Quarter, or Mr. Overtime, whatever it’s called,” White said. ”That’s when winning time occurs.”\n\n\r\n              Edwards went 5 for 9 from 3, but he was called for a crucial charging foul with 1:06 remaining in OT, and split a pair of free throws on the next trip down the floor as the Timberwolves were trying to draw the game within a single possession.\n\n\r\n              “We collectively did a better job on Edwards in the second half,” Bulls coach Billy Donovan said. “We did a better job of pressing up on Towns on some of the catch-and-shoot opportunities he had in the first half. When we’re able to get stops, we’re able to get out and force a little tempo for us and generate some easy baskets.”\n\n\r\n              Towns connected on seven 3-pointers, and Rudy Gobert had 12 points and a team-high 16 rebounds. Entering Tuesday with the NBA’s stingiest scoring defense and tied for the Western Conference’s best record, the Timberwolves jumped out to a huge lead as the Bulls missed their first nine 3-point attempts. But Minnesota shot just 36.6% (15 for 41) in the second half.\n\n\r\n              “The defense fell apart,” Timberwolves coach Chris Finch said. ”(The late game offense was) not great. A couple of key turnovers. Tried to win it all by ourselves at times.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Continue their road trip in Milwaukee on Thursday.\n\n\r\n              Bulls: Visit the Memphis Grizzlies on Thursday.\n\n\r\n              ------\n\n\r\n              NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995885.495072
}