{
  "game_id": "0021600978",
  "espn_id": "400900373",
  "date": "Mar 11, 2017",
  "matchup": "MIL vs. MIN",
  "headline": "Balanced Bucks beat Timberwolves 102-95 for 6th straight win",
  "body": "MILWAUKEE --  For much of the season, the Milwaukee Bucks have relied on Giannis Antetokounmpo to carry the scoring load.\n\nNot Saturday night. The All-Star got lots of support against Minnesota.\n\nTony Snell scored 19 points, Antetokounmpo had 18 and the balanced Bucks beat the Timberwolves 102-95 for their season-high sixth consecutive victory.\n\nMilwaukee had seven players score in double figures. Matthew Dellavedova had 16 points and Greg Monroe finished with 12.\n\n\"We'd love for everybody to score 10 points but the big thing is these guys kept fighting,\" Bucks coach Jason Kidd said. \"There are a lot of tired bodies in that locker room.\"\n\nIt's the longest winning streak for the Bucks since a six-game run in the 2011-12 season.\n\nKarl-Anthony Towns had 35 points and 14 rebounds for Minnesota, which was coming off a victory against Golden State on Friday night. Ricky Rubio added 22.\n\n\"We got off to a slow start,\" Timberwolves coach Tom Thibodeau said. \"We didn't close the half well. We didn't start the fourth quarter well. That all created a problem.\"\n\nThe Timberwolves got within two with just under three minutes remaining on a Rubio jumper but the Bucks held off the late challenge in a game that featured 13 ties and 13 lead changes.\n\nJohn Henson and Khris Middleton each scored 11 points for the Bucks, and Rashad Vaughn had 10. Milwaukee shot 46.2 percent from the field.\n\nFUTURE IS NOW\n\nThe Bucks (32-33) and Timberwolves (27-38) are fighting to make the playoffs, even if it means facing a top-seeded team.\n\n\"You've got to play for today,\" Kidd said. \"You can't control the lottery balls. You never know what the future holds. With free agency and the way things change so fast in this league, you have to try to get through that process sooner rather than later.\"\n\nTowns said it's important for the Timberwolves to play in the postseason.\n\n\"We don't play this game to lose. We're professional athletes,\" he said. \"We want to win. It's not about being the big fish or the little fish. It's about being part of the pond.\"\n\nDEFENSIVE EFFORT\n\nThe Bucks held their opponent to less than 100 points for a season-high fifth consecutive game. Milwaukee is 18-4 in such games on the season.\n\nIRON MAN\n\nAntetokounmpo logged more than 40 minutes, despite playing with five fouls for an extended period.\n\n\"We don't want to run him up to 40 (minutes) every night, but where we are in the season and what we're playing for, he's answered the bell,\" Kidd said.\n\nTIP-INS\n\nTimberwolves: Towns nearly had a double-double in the first half with 16 points and nine rebounds. ... Thibodeau was whistled for a technical foul early in the third quarter after he argued a delayed goaltending call on Gorgui Dieng, who blocked John Henson's shot. ... F Adreian Payne dressed for the third straight contest but didn't play. He missed the previous 13 games while being treated for thrombocytopenia.\n\nBucks: G Malcolm Brogdon (back) and F Mirza Teletovic (hamstring) sat out for the second consecutive game. ... Henson picked up a technical foul midway through the third quarter after being called for a foul on Towns. ... After a review that took place more than a minute later, a key fourth-quarter basket by Monroe was ruled to have been after the expiration of the shot clock. ... The Bucks have won five of six against the Timberwolves.\n\nUP NEXT\n\nTimberwolves: Host Washington on Monday in the second of four consecutive games against Eastern Conference opponents. Minnesota fell to the Wizards 112-105 on Jan. 6 in their lone meeting this season.\n\nBucks: Play at Memphis on Monday to start a six-game road trip. The Bucks defeated the Grizzlies 106-96 on Nov. 12 in Milwaukee in the only matchup between teams this season.",
  "source": "espn_api",
  "crawled_at": 1764995146.888479
}