{
  "game_id": "0022400153",
  "espn_id": "401704719",
  "date": "Nov 03, 2024",
  "matchup": "ORL @ DAL",
  "headline": "Luka Doncic scores 32 points, Mavericks overwhelm Banchero-less Magic 108-85",
  "body": "DALLAS -- — Luka Doncic had 32 points, nine rebounds and seven assists, Daniel Gafford scored a season-high 18 points, and the Dallas Mavericks beat the Orlando Magic 108-85 on Sunday night.\n\n\r\n              The defending Western Conference champions outscored the Magic 30-9 in the first 9:30 of the second quarter en route to a 65-40 halftime lead. Dallas’ largest lead was 33 points.\n\n\r\n              Orlando played its second game without Paolo Banchero, the No. 1 overall pick in the 2022 draft and 2023 Rookie of the Year, who suffered a torn right oblique last Wednesday.\n\n\r\n              Another Magic starter, Wendell Carter Jr., was limited to nine first-half minutes, six points and a rebound because of a strain of his left plantar fascia.\n\n\r\n              Franz Wagner led the Magic with 13 points, and Orlando scored well below its average of 111.7 points per game.\n\n\r\n              Kyrie Irving had 17 points, and Dereck Lively II had 11 points and 11 rebounds off Dallas’ bench.\n\n\r\n              Takeaways\r\n              Magic: With the injuries, Orlando was outscored 52-36 in the paint and were a season-worst 19.5% on 3-pointers (8 of 41).\n\n\r\n              Mavericks: Gafford also had eight rebounds, bouncing back after having only six points and three rebounds in last Thursday’s home loss to Houston.\n\n\r\n              Key moment \r\n              The Mavericks outscored the Magic 13-2 in the final 3:10 of the first quarter, and Orlando missed its last six field goal attempts, including a full-court heave at the buzzer.\n\n\r\n              Key stat\r\n              Mavericks coach Jason Kidd wanted a faster offensive pace with fewer fouls and more rebounds. Dallas outscored Orlando 19-12 in fast-break points and finished with a season-high 53 rebounds.\n\n\r\n              Up next \r\n              The Magic will visit the Thunder on Monday, the same day the Mavericks will host the Pacers and coach Rick Carlisle, who coached Dallas to its lone NBA title in 2011.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997876.186969
}