{
  "game_id": "0021800202",
  "espn_id": "401070883",
  "date": "Nov 14, 2018",
  "matchup": "PHI @ ORL",
  "headline": "Magic come back to beat 76ers 111-106 in Butler's debut",
  "body": "ORLANDO, Fla. --  Everything about Jimmy Butler's first game with the 76ers was going great, until the fourth quarter.\n\nButler had 14 points in his Philadelphia debut, but the 76ers collapsed late and lost to Orlando 111-106 after Terrence Ross hit a tiebreaking 3-pointer with 8.7 seconds left that helped the Magic finish off a big comeback Wednesday night.\n\n\"We're going to be just fine because once we put this together, we're going to be tough,\" said Butler, acquired Monday from Minnesota in a five-player swap.\n\nThe four-time All-Star played 33 minutes and shot 6 for 12 from the field after a couple of days spent adjusting to the big trade.\n\n\"A lot has been going on, but that's no excuse for not winning,\" he said. \"No matter what, we're expected to win. I'm expecting to win, and we're expecting to win as a team. So that isn't an excuse.\"\n\nOrlando scored 21 straight points in the fourth quarter, then held the 76ers without a field goal over the final 3 1/2 minutes.\n\n\"You don't just click your heels and win NBA games. We will use this as a way to remind everyone that this is the NBA,\" said 76ers coach Brett Brown. \"Although we lost, the organization of the things we put in put us in decent position. If we can get three shots (in the final minute) instead of three turnovers, maybe we're talking to each other about a win.\"\n\nNikola Vucevic had 30 points for the Magic, including two clinching free throws with 5.8 seconds remaining.\n\n\"They just made a big trade and we knew they were probably going to be very fired up to come in and play well,\" said Vucevic, who scored 11 in the fourth quarter. \"We stayed poised for 48 minutes. We got down 16 and we kept fighting. Getting stops was the big thing.\"\n\nJoel Embiid finished with a triple-double of 19 points, 13 rebounds and 10 assists for the 76ers, who lost for the seventh time in nine road games. J.J. Redick led Philadelphia with 22 points but committed two turnovers in the final 31 seconds.\n\nVucevic had 19 points in the first half to help Orlando come back from a 10-point deficit and lead 53-52 at the break.\n\nTwo baskets by Redick during a 10-2 run early in the third quarter put Philadelphia up 62-60. Embiid then made a play that turned the game sharply in the 76ers' favor for a while. After having the ball stolen from him by Magic forward Wes Iwundu, the 7-footer chased Iwundu down the court and blocked his layup attempt from behind.\n\nPhiladelphia led 92-76 before the Magic scored 21 consecutive points.\n\nThe 76ers made only seven of 18 shots in the fourth quarter. But the big number, according to Magic coach Steve Clifford, was free throws: 12 for Orlando, two for Philadelphia.\n\n\"It's been an area of weakness, and then tonight in the fourth quarter we didn't foul,\" Clifford said. \"Keeping the other team out of the bonus is a big deal, and in the fourth quarter it's even a bigger deal.\"\n\nWilson Chandler ended the 76ers' scoreless stretch of more than four minutes with a short baseline floater. Mike Muscala hit a 3-pointer for their final field goal with 3:33 remaining.\n\nBIG-TIME BLOCK\n\nAfter missing six games with a right ankle sprain, Jonathan Isaac played 16 quiet minutes except for one very loud play -- a rejection of Embiid's dunk attempt, high above the rim, right in the middle of the Magic's 21-0 spurt. \"That was pretty much the play of the game -- just the challenge alone,\" Orlando forward Aaron Gordon said. \"It takes a lot of courage to go up there and block somebody coming down the lane like that.\n\nSaid Isaac: \"It felt fantastic.\"\n\nTIP-INS\n\n76ers: Embiid made all three of his 3-pointers in the first 4:09 of the game. ... Ben Simmons is 23 for 28 (.821) from the foul line at home, and 22 for 44 (.500) on the road.\n\nMagic: Ross has converted 12 of 18 shots from 3-point range in the last three games. ... Orlando broke a four-game losing streak against the 76ers and won for the fifth time in seven games overall.\n\nUP NEXT\n\n76ers: Home against Utah on Friday night.\n\nMagic: Home against the Los Angeles Lakers on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994069.194606
}