{
  "game_id": "0021600964",
  "espn_id": "400900359",
  "date": "Mar 09, 2017",
  "matchup": "LAL @ PHX",
  "headline": "Russell scores 28, Lakers finally win in Phoenix 122-110",
  "body": "PHOENIX --  The Los Angeles Lakers stopped their desert drought with one satisfying performance.\n\nD'Angelo Russell scored 28 points, including six 3-pointers, and the Lakers earned their first win in Phoenix in six years with a 122-110 victory over the Suns on Thursday night.\n\nJordan Clarkson added 19 for the Lakers, who snapped an eight-game losing streak. Brandon Ingram and Ivica Zubac scored 14 points apiece.\n\nIt was Los Angeles' first win in Phoenix since Jan. 5, 2011. The Lakers had lost 11 straight road games against the Suns, including a 137-101 laugher in their previous game in Phoenix on Feb. 15, the most one-sided Suns win in the series' history.\n\n\"They whupped us pretty bad before the All-Star break,\" Clarkson said, \"so we wanted to get this win and we came out and competed. We came together, moved the ball.\"\n\nThe Lakers took the lead to start the second half and were up by as many as 21 Thursday night. A late Phoenix run made it a seven-point game before Los Angeles scored the final five points.\n\n\"I think the Lakers felt like they had something to prove after the last game we played,\" the Suns' Devin Booker said. \"They came out and showed that. We didn't have any fight tonight.\"\n\nBooker scored 23 for Phoenix. Marquese Chriss added 18, and T.J. Warren finished with 17 points.\n\nLos Angeles outscored Phoenix 21-8 to start the second half. It opened an 82-71 lead on Ingram's dunk off a pass from Russell with 4:10 left in the third.\n\nJulius Randle's 3-pointer gave the Lakers their biggest lead at 116-95 with 4:53 to play. The Suns put together a 15-1 spurt to cut it to 117-110 on Booker's cutting layup through traffic, but there was just 51.2 seconds to play.\n\nRussell ended any doubt with his final 3, making it 120-110 with 32.5 seconds remaining.\n\n\"There was definitely a focus at shoot-around today,\" Lakers coach Luke Walton said. \"It was pretty obvious and we talked about it as a group, that they looked locked in. I was expecting the guys to come out and give the effort that they did, honestly.\"\n\nThe Suns trailed most of the first half, going 4:26 without a point in a 10-0 Lakers run, before Booker scored seven in a 14-2 surge that put Phoenix up 63-59 with 40.6 seconds to play. Clarkson's layup at the buzzer cut the Suns' lead to 63-61 at the break.\n\nPhoenix won the first three games of a season-long five-game homestand, but lost the last two.\n\n\"It's really disappointing,\" Booker said. \"We've beaten top teams, competed with thee top teams in the league. Every team's talented, but they (the Lakers) are one of the losing teams like us and we should have just come out here and competed hard.\"\n\nPhoenix coach Earl Watson said the Lakers \"did a good job of just being the toughest team on the court from beginning to end.\"\n\nTIP-INS\n\nLakers: The game featured the NBA's two youngest coaches --  Watson (37) and Walton (36). ... Randle finished with 13 points. He was coming off his third triple double of the season. ... The eight-game losing streak had matched the Lakers' longest of the season.\n\nSuns: The NBA fined Jared Dudley $35,000 for head-butting Washington's Jason Smith on Tuesday night. ... Alan Williams had 16 points and 10 rebounds for his fifth straight double-double off the bench.\n\nUP NEXT\n\nLakers: Return home to face Philadelphia on Sunday night, a matchup of two teams in the bottom four in the NBA.\n\nSuns: Visit Dallas on Saturday night before returning for three more at home.",
  "source": "espn_api",
  "crawled_at": 1764995371.9569972
}