{
  "game_id": "0022300633",
  "espn_id": "401585261",
  "date": "Jan 25, 2024",
  "matchup": "LAL vs. CHI",
  "headline": "LeBron, Russell lead the Lakers' impressive shooting in a 141-132 victory over Chicago",
  "body": "LOS ANGELES -- — LeBron James had 25 points and 12 assists a few hours after being named to his record 20th NBA All-Star team and the Los Angeles Lakers beat the Chicago Bulls 141-132 on Thursday night.\n\n\r\n              D’Angelo Russell hit eight 3-pointers and scored 29 points, Anthony Davis scored 22 points and Austin Reaves had 20 points and eight assists. Jarred Vanderbilt added a season-high 17 points as the Lakers made 60.9% of their shots in their fourth win in six games.\n\n\r\n              After hitting 15 of their 18 shots in a spectacular second quarter, the Lakers racked up a season-high 112 points through three quarters and took a 24-point lead that allowed them to weather the Bulls' 39-point fourth quarter. The Lakers' 141 points were a season high, as were the Bulls' 132.\n\n\r\n              “We’re just playing the right way,” James said. “Guys are feeling very comfortable out there. We’ve got guys that can make shots. We’ve got guys that can make plays. Doesn’t matter who’s shooting.”\n\n\r\n              Los Angeles-area native DeMar DeRozan scored 14 of his 32 points in the fourth to lead six scorers in double figures for the Bulls, who have lost the first two on their three-game West Coast trip. Coby White added 25 points, Nikola Vucevic had 20 and former Lakers guard Alex Caruso had 17.\n\n\r\n              “We certainly dug ourselves a hole,” Chicago coach Billy Donovan said. “The difference in the game was the foul line for them. We fouled them too much. They shot astronomically well. The turnovers, and the close of the second quarter, really hurt.”\n\n\r\n              With this victory, the Lakers went 6-6 to wrap up a 23-day stretch in which they had just one game outside Los Angeles. They’ll spend the next two weeks on a six-game road trip while the Grammy Awards take over their downtown arena.\n\n\r\n              Although Russell didn't score in the fourth, he finished one shy of his career high in 3-pointers, and he continued to complicate the Lakers’ decisions on his future with another big game ahead of the trade deadline. The point guard’s contract is highly moveable, but Los Angeles must decide whether it can get enough in return to shake up its .500 season — particularly if Russell can keep up this recent stretch of outstanding play.\n\n\r\n              “My confidence is through the roof, and I’m going to keep it there,” Russell said. “I just try to complement Bron and AD. I know they can get us out of games single-handedly, so just try to complement them, if that’s me shooting, facilitating, whatever that may be.”\n\n\r\n              James became the first 20-time All-Star in NBA history earlier Thursday, surpassing Kareem Abdul-Jabbar’s record. James, who topped Abdul-Jabbar as the leading scorer in league history last season, will also start his 20th All-Star Game in his 21 seasons.\n\n\r\n              “I mean, I've exceeded expectations in my career, so it's just humbling,” James said. “It's very cool to be able to continue to have these compliments throughout your career, but I've exceeded anything than I ever dreamed that I would be in the NBA, and I did that a long time ago. Everything else is just kind of extra credit.”\n\n\r\n              Before the game, Donovan said star guard Zach LaVine will be out for at least another week before his ankle injury is re-evaluated. The UCLA product was frequently linked with the Lakers in trade rumors earlier this season.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Portland on Sunday night.\n\n\r\n              Lakers: At Golden State on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995512.122386
}