{
  "game_id": "0022200107",
  "espn_id": "401468262",
  "date": "Nov 02, 2022",
  "matchup": "CLE vs. BOS",
  "headline": "Garland scores 29 in return, Cavs edge Celtics 114-113 in OT",
  "body": "CLEVELAND -- — Darius Garland missed everything while sitting on the bench, but mostly the joy of playing and winning.\n\n\r\n              He's back, and it looked like he never left.\n\n\r\n              Garland scored 29 points in his return after missing five games with an ugly eye injury, Donovan Mitchell added 25 and the Cleveland Cavaliers beat the Boston Celtics 114-113 in overtime on Wednesday night for their sixth straight victory.\n\n\r\n              Garland added 12 assists, including an alley-oop to Mitchell in OT that put the Cavs up 112-109 and they held on for their second win over the Celtics in less than a week.\n\n\r\n              Afterward, Garland lamented not having his sunglasses as he squinted from the lights in the arena's TV studio. The 22-year-old's left eye remains discolored and puffy from an injury sustained in the opener.\n\n\r\n              His time away from the Cavs was harder than he could have imagined.\n\n\r\n              “We were winning and I was happy about that, but I wanted to be on the floor with them and feel that energy,” he said. \"I’m happy to be back now.” \n\n\r\n              Jayson Tatum's basket with 1:04 left pulled Boston within a point, and thanks to some poor possessions by Cleveland, the Celtics had a chance to win it at the buzzer before Jaylen Brown's 18-footer went off the back of the rim.\n\n\r\n              “It was pretty much get me the ball to make the play and I came up short,” Brown said. \"Two seconds is enough time to get a good shot. I got a good look. It’s a makeable shot.”\n\n\r\n              Brown scored 30 and Tatum had 26 points and 12 rebounds for the Celtics, who were looking to avenge an OT loss at home last week to the Cavs. But Cleveland overcame a 15-point deficit and now has two wins over the defending Eastern Conference champions.\n\n\r\n              “They’re hungry and they want to make some noise,\" Brown said. \"When you play against them, you’ve got to come ready to play, I’ll tell you that.”\n\n\r\n              Tatum forced this overtime with two sensational plays in the final 6.7 seconds.\n\n\r\n              First, he drove the lane for an emphatic dunk — and may have been fouled by Jarrett Allen — to tie it 107-all. Then, on Cleveland's final trip of regulation, he blocked Mitchell's step-back 3-pointer as the horn sounded.\n\n\r\n              Garland had been out since the season opener on Oct. 19, when he was accidentally swiped across the eye by Toronto’s Gary Trent Jr. A nasty cut under his eyelid and excessive swelling kept Garland out.\n\n\r\n              But back doing what he does best, Garland led the Cavs to another signature win in this young season. Before the game, he was encouraged by Mitchell to take the first six shots.\n\n\r\n              “He really set the tone,\" Mitchell said. “I can't speak for everybody else, I just didn't know what his rhythm was going to be like. He came out like he's been playing with us this whole stretch.”\n\n\r\n              Allen added 14 points and 14 rebounds for the Cavs, who had some offensive issues while welcoming Garland back.\n\n\r\n              Garland didn't show a speck of rust early on, making his first three 3-pointers and scoring 14 points in the first quarter — his career high for the first 12 minutes. He added three assists, two steals and moved around the floor with his usual fluidity.\n\n\r\n              THREE-VELAND\n\n\r\n              The Cavs have been behind the curve, so to speak, when it comes to 3-pointers in recent years.\n\n\r\n              But Cleveland came in averaging 34.3 shots behind the arc, and coach J.B. Bickerstaff said he's got no restrictions on how many his team can take.\n\n\r\n              “Any open shots that teams are willing to give us,” he said. “We'll take ’em.”\n\n\r\n              They tried a franchise-record 50 on Sunday against New York and made 23, the second most in club history.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Brown and Tatum each have six 20-point-plus games. …. C Robert Williams (left knee surgery) have been inactive for every game, but could return before the end of December.\n\n\r\n              Cavaliers: Improved to 3-0 in overtimes. ... Kevin Love missed all five 3s after making eight on Sunday. He did have a rare dunk, posing afterward as his teammates celebrated on the bench. “He barely got over the rim,\" Garland joked. \"I wouldn’t call it a slam but a stuff. But I’ll give it to him.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Chicago on Friday night. \n\n\r\n              Cavaliers: Visit Detroit on Friday to start a five-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995259.74386
}