{
  "game_id": "0021900515",
  "espn_id": "401161157",
  "date": "Jan 02, 2020",
  "matchup": "MEM @ SAC",
  "headline": "Fox helps Kings rally from 20 down to beat Grizzlies 128-123",
  "body": "SACRAMENTO, Calif. --  De’Aaron Fox finally got the Kings running at the quick pace he grew accustomed to last season, and his season-high five steals helped send them on their way.\n\nFox scored 10 of his 27 points in the final five minutes and the Kings overcame a 20-point deficit in the first half to beat the Memphis Grizzlies 128-123 on Thursday night, ending an eight-game losing streak.\n\n\"You go down 20 in the first quarter, it’s easy to give in,\" Sacramento coach Luke Walton said. \"That’s the easier thing to do, and our guys kept scrapping and fighting, scrapping and fighting. They pulled out a hard-fought, gritty win. That’s kind of who our group is.\"\n\nIt's a group that hasn't had much success defensively this season while Fox has been in and out of the lineup.\n\nFox made an immediate impact against Memphis, coming from behind to block a shot by Jaren Jackson Jr. after the Grizzlies grabbed the opening tip. Fox also had a midcourt steal and layup as part of a run in the fourth quarter when the Kings turned a two-point deficit into an eight-point lead.\n\n\"I feel like I’m one of the best guys in the league that can actually go for those type of gambles,” Fox said of his early block. “I came up and I made a lot of plays defensively tonight. Sometimes you have to be able to take those risks and be able to make plays defensively.”\n\nWalton compared Fox to a free safety in football.\n\n“He’s so quick and he reads things so well that when he’s really engaged and he’s coming over making helps, he just gets to places so quick and he’s so explosive,” Walton said. “It gets us out and running.”\n\nBuddy Hield had 26 points and seven rebounds to help the Kings win for the first time since beating Golden State on Dec. 15. Richaun Holmes added 18 points and seven rebounds, and Bogdan Bogdanovic scored 16 points.\n\nThe Kings allowed 42 points in the first quarter and 37 in the third but held the Grizzlies to 13 through the first 10 ½ minutes of the fourth quarter, one of the best defensive stretches of the season by Walton’s team.\n\nSacramento took control with a 14-4 run after trailing 106-104 with 5:11 to go. It’s the Kings largest comeback of the season.\n\n“We’ve got to learn how to play with a big lead like that, especially early in the game,” Memphis coach Taylor Jenkins said. “We’ve got to know that when a team’s down 20, that all those things that we made an emphasis of in the first quarter, you have to take it to another level. It kind of just slipped on us.”\n\nJa Morant, the Western Conference rookie of the month for December, had 23 points and seven assists for Memphis. Jonas Valanciunas added 18 points and 12 rebounds.\n\nThe Grizzlies led 42-26 after the first quarter and took a 97-90 advantage into the fourth.\n\nBefore the game a moment of silence was held for former NBA Commissioner David Stern. At halftime, a tribute to Stern played on the giant video scoreboard. Stern died Wednesday at the age of 77.\n\nTIP-INS\n\nGrizzlies: The 42 points matched the most in any quarter by Memphis this season and were five more than the Grizzlies had in a first quarter this season.\n\nKings: The 128 points were the Kings' season high. … The King avoided their first nine-game losing streak since 2009. … Marvin Bagley III (left foot soreness) was on the court taking shots before the game. That’s considerable progress from when Bagley got hurt Dec. 26 against Minnesota and left the arena in a walking boot. There is no timetable for his return.\n\nPASSING FANCY\n\nThe Grizzlies dished out 31 assists, the 12th time this season they’ve had 30 or more. That’s tied for second-most in franchise history and one shy of the record set last season.\n\nFINED\n\nSacramento’s Dewayne Dedmon was fined $50,000 by the NBA for making public comments regarding his desire to be traded.\n\nUP NEXT\n\nGrizzlies: Play the Clippers in Los Angeles on Saturday. Memphis has lost three straight in the series, including 121-119 at home on Nov. 25.\n\nKings: Host the Pelicans on Saturday. Sacramento lost three of four to New Orleans last season.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995725.523411
}