{
  "game_id": "0022300024",
  "espn_id": "401584112",
  "date": "Nov 14, 2023",
  "matchup": "DEN vs. LAC",
  "headline": "Nikola Jokic scores 32, Nuggets win 111-108 to keep the Clippers winless with James Harden",
  "body": "DENVER -- — Nikola Jokic had 32 points, 16 rebounds and nine assists, and the Denver Nuggets beat Los Angeles 111-108 in an NBA In-Season Tournament game on Tuesday night, keeping the Clippers winless since acquiring James Harden last month.\n\n\r\n              Jokic was perfect on 14 free throw attempts, including two with 13 seconds left that helped the Nuggets hold off the Clippers’ comeback try.\n\n\r\n              Los Angeles has lost five straight with Harden, who was acquired on Oct. 30, and six in a row overall despite the 34-year-old guard’s best game with his new team since arriving from Philadelphia.\n\n\r\n              “I kept reiterating, I didn’t have a training camp or a preseason, so kind of learning on the fly,” Harden said. “Also getting myself into James Harden shape. Tonight was definitely another step in the right direction and just keep improving.”\n\n\r\n              Harden scored 21 points and Paul George tied a season high with 35 points as Los Angeles fell to 0-2 in West Group B play.\n\n\r\n              “I thought we played great. It’s tough, the adversity of playing against the extra three,” George said of the officiating. “I thought they were awful but, the defending champs, we’ve got to play better.\n\n\r\n              “So many times I got hit on layups, 3-pointers. It was constant. Jump shots, getting hit, smacked on the forearm. It was a poor job.”\n\n\r\n              Aaron Gordon scored 20 points and Reggie Jackson 18 for Denver, which has won both of its games in the West B bracket.\n\n\r\n              The Nuggets were without point guard Jamal Murray for the fourth straight game. He is expected to miss the rest of the month with his strained right hamstring.\n\n\r\n              Denver appeared to have sealed the game when Jokic fed Gordon for a dunk and a 109-104 lead with 50 seconds left. Jackson missed two free throws with 32 seconds remaining and Kawhi Leonard hit two from the line before coming up with his fifth steal, which led to George’s layup with 15 seconds left.\n\n\r\n              After Jokic’s free throws, George’s 3-point attempt wedged between the rim and backboard. The Nuggets won the jump ball and held on as time expired.\n\n\r\n              “Today they played well but we played well enough to get a (win),” Jackson said.\n\n\r\n              Harden got aggressive at the end of third, going around Jalen Pickett for a layup, hitting two free throws and draining a 3-pointer with 4.7 seconds left in the period to give the Clippers an 84-81 lead. Gordon hit 31-footer at the horn to tie it heading into the fourth. \n\n\r\n              Los Angeles took a 99-92 lead on Leonard’s fadeaway midway through the fourth.\n\n\r\n              “They’re still figuring it out. You can see it, they’ve got a lot of talents that overlap,” Jackson said of the Clippers’ four stars. “When you have superstars, superstars can do a lot of things. They gave us a great punch tonight.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host the Houston Rockets on Friday night in their third tournament game.\n\n\r\n              Nuggets: At the New Orleans Pelicans on Friday night for their first road game of the tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996771.441899
}