{
  "game_id": "0022000042",
  "espn_id": "401267202",
  "date": "Dec 28, 2020",
  "matchup": "MEM @ BKN",
  "headline": "Grizzlies lose Morant to ankle injury, beat Nets in overtime",
  "body": "NEW YORK -- — Ja Morant could barely stand, needing a wheelchair to take him from the court area after spraining his left ankle.\n\n\r\n                    Having already lost their first two games, now the Memphis Grizzlies had lost the NBA Rookie of the Year and their best player.\n\n\r\n                    “A moment like that can really test you, but our guys just kept on fighting,\" Grizzlies coach Taylor Jenkins.\n\n\r\n                    And Morant was there to watch them.\n\n\r\n                    The Grizzlies earned their first victory of the season, outlasting the short-handed Brooklyn Nets 116-111 in overtime Monday night.\n\n\r\n                    Morant was hurt late in the first half when he leaped to block a shot by Timothé Luwawu-Cabarrot and landed on the Nets forward's foot. Morant immediately hopped off the floor, then laid on the floor in pain before being wheeled to the back of the arena.\n\n\r\n                    He rejoined his teammates on the bench in the second half with his foot in a walking boot, offering energy and support to carry them through a tense finish.\n\n\r\n                    “He's a team player. He loves his squad,” teammate Dillon Brooks said. \n\n\r\n                    Morant watched Brandon Clarke score the go-ahead basket on a follow shot with 41 seconds left in overtime before the Grizzlies put it away with free throws.\n\n\r\n                    Morant averaged 36 points in the two losses, scoring a career-high 44 in the season opener, but the Grizzlies found enough offense without him Monday.\n\n\r\n                    “Unbelievable display of resiliency by our group,” Jenkins said.\n\n\r\n                    Kyle Anderson scored a career-high 28 points and Brooks added 24 for the Grizzlies. Clarke had 16 points and Jonas Valanciunas finished with 14 points and 14 rebounds.\n\n\r\n                    “We kind of knew that this was a game that we had to win no matter what,” Clarke said.\n\n\r\n                    Caris LeVert had 28 points and 11 assists for the Nets, who rested Kevin Durant and Kyrie Irving while losing for the second straight night. Brooklyn is also without Spencer Dinwiddie, who will have surgery to repair a partially torn right ACL sustained Sunday.\n\n\r\n                    With both stars returning this season from injury, the Nets decided Sunday night they would rest Durant after he played a season-high 36 minutes in a loss to Charlotte. They listed him on the injury report Monday morning. Irving was added a few hours later. \n\n\r\n                    The players forced to take on bigger roles perhaps ran out of gas in overtime, when the Nets managed five points from LeVert but nothing more, shooting 2 for 10.\n\n\r\n                    “Early in the season I think guys are still acclimating to back-to-backs, let alone an overtime back-to-back,” Nets coach Steve Nash said.\n\n\r\n                    Neither team was ahead by more than seven in the second half, when there were 16 lead changes, so it wasn’t a surprise when they needed five more minutes after LeVert missed a 3-pointer on the last possession of regulation. \n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Memphis started a three-game road trip. ... Anderson's previous career high came in the last game, when he had 20 points against Atlanta.\n\n\r\n                    Nets: Luwawu-Cabarrot scored 21 points, but only two after halftime. ... The Nets opened a six-game homestand, their longest since playing six straight games at Barclays Center during the 2015-16 season. \n\n\r\n                    SPENCER'S SURGERY\n\n\r\n                    The Nets said Dinwiddie would have surgery scheduled for next week and further updates would be provided afterward. In an Instagram post, Dinwiddie recalled returning from a more severe knee injury in college seven months later. “Next question: Will I miss the road to a (at)brooklynnets 2021 championship? My response: As we’ve seen before. Crazier things have happened,” he wrote.\n\n\r\n                    BACK IN BROOKLYN\n\n\r\n                    The Grizzlies were the last visiting team to win in Brooklyn — nine months ago. They crushed the Nets 118-79 on March 4, a week before the season was suspended because of the coronavirus. \n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Try to snap a nine-game losing streak to Boston on Wednesday.\n\n\r\n                    Nets: Play the first of two straight home games against Atlanta on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996994.220572
}