{
  "game_id": "0022001049",
  "espn_id": "401307859",
  "date": "May 13, 2021",
  "matchup": "ORL @ ATL",
  "headline": "Bogdanovich scores 27 points, Hawks breeze past Magic",
  "body": "ATLANTA -- — Bogdan Bogdanovich scored 27 points, Trae Young added 18 and the Atlanta Hawks beat the Orlando Magic 116-93 on Thursday night for their third straight victory.\n\n\r\n                    Clint Capela added 14 points and 14 rebounds for the Hawks a day after they clinched their first playoff berth since 2016-17. Atlanta has the NBA’s longest active home winning streak at 10 games and has won 18 of its last 20 at State Farm Arena.\n\n\r\n                    “You’ve got to be able to protect home, and it’s tough to win on the road in the NBA,\" Hawks forward Kevin Huerter said. “We want this building to be a place that people don’t want to come in and play both with obviously our fans but the energy we bring from playing at home, using the fans and using everything about homecourt to our advantage.\"\n\n\r\n                    Beginning the night fourth in the Eastern Conference with a game remaining, the Hawks improved to 26-11 overall since March 1 — when Nate McMillan took over as interim head coach — the highest victory total in the East over that span.\n\n\r\n                    Atlanta led 81-55 on John Collins’ straightaway 3, and the Magic never got within 17 in the second half. The lead swelled to 30 on Bogdanovich’s free throws midway through the third and was trimmed to 22 entering the fourth.\n\n\r\n                    The Hawks, winning for the sixth in the last seven games, rested their starters in the fourth quarter.\n\n\r\n                    R.J. Hampton led the Magic with 15 points. Orlando dropped to 10-24 on the road.\n\n\r\n                    “It’s tough,\" Magic guard Gary Harris said. “These guys are young. They’re going to figure it out. We’re all figuring it out one game at a time. You have some highs. You have some lows. We’ve done a lot of good things and there’s a lot of things we need to improve on. Just keep working. That’s all we can do.\"\n\n\r\n                    Bogdanovich was 9 for 12 from the field, 4 for 7 on 3s. McMillan loves how he and Young are feeding off each other since Bogdanovich took on a bigger role a few weeks ago.\n\n\r\n                    “Trae knows this guy can put the ball in the basket,\" McMillan said. “We’ve added some sets since he’s gone into that starting lineup to try to take advantage of his skill and his ability to catch and shoot. I think both he and Trae are building some chemistry out on the floor. When you have a guy that can shoot like that, you’ve got to find ways to put the ball in his hands.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Orlando has dropped five in a row to fall to 21-49. ... C Mo Bamba missed his second straight game with an illness.\n\n\r\n                    Hawks: Bogdanovich (right hamstring soreness), Capela (right heel pain) and F Danilo Gallinari (lower back soreness) were listed as questionable before the game. Bogdanovich and Capela started, and Gallinari had 10 points in 24 minutes. ... Young was listed as probable before the game with right hip soreness. ... Bogdanovich’s previous career high of games of 20 or more points was set last year with Sacramento at 17. ... Capela, the NBA’s rebounding leader, had 13 boards in the first half.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Visit Philadelphia on Friday.\n\n\r\n                    Hawks: Host Houston on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997568.4677498
}