{
  "game_id": "0022400406",
  "espn_id": "401704972",
  "date": "Dec 25, 2024",
  "matchup": "MIN @ DAL",
  "headline": "Edwards scores 26, Wolves hold on to beat Mavs 105-99 after Doncic injury",
  "body": "DALLAS -- — Anthony Edwards scored 26 points, and the Minnesota Timberwolves held on for a 105-99 Christmas Day victory over Dallas after Mavericks superstar Luka Doncic left the game with a strained left calf.\n\n\r\n              A rematch of last season's Western Conference finals won by Dallas fell flat when Doncic pulled up lame while running a play late in the second quarter Wednesday. Then it got wild when the Mavs erased almost all of a 28-point deficit in the second half.\n\n\r\n              The five-time All-Star never made it back to the defensive end and limped off the court after Dallas called timeout. It was Doncic's second game back after missing two with a left heel contusion.\n\n\r\n              Kyrie Irving scored 39 points but was short on a 3-pointer that would have put the Mavs ahead in the final minute after they trailed by 28 late in the third quarter. Doncic scored 14 points. \n\n\r\n              Rudy Gobert had 14 points and 10 rebounds.\n\n\r\n              Takeaways\r\n              Timberwolves: Julius Randle played in Dallas against his hometown team for the first time since the blockbuster trade that brought him from the New York Knicks. He had 23 points, 10 rebounds and eight assists.\n\n\r\n              Mavericks: They finally shook the malaise of the Doncic injury in the fourth quarter, cutting a 28-point deficit from late in third quarter to two.\n\n\r\n              Key moment\r\n              Doncic pulling up lame changed everything. The five-time All-Star is the reason the Mavs were playing their fifth consecutive Christmas game. \n\n\r\n              Key stat\r\n              Timberwolves: Minnesota allowed an average of 121 points on 50% shooting during the three-game skid coming into its third-ever Christmas game. Defense led to the big lead in Dallas.\n\n\r\n              Mavericks: Klay Thompson was 4 of 10 on 3s and passed Reggie Miller for fifth on the NBA's career list. Thompson, who scored 12 points, has 2,562 to Miller's 2,560.\n\n\r\n              Up next\r\n              Minnesota at Houston on Friday. Dallas at Phoenix on Friday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998097.7573419
}