{
  "game_id": "0021800603",
  "espn_id": "401071279",
  "date": "Jan 08, 2019",
  "matchup": "OKC vs. MIN",
  "headline": "Saunders wins 1st game, T'Wolves top Thunder 119-117",
  "body": "OKLAHOMA CITY --  Ryan Saunders went right into the fire in his first game as the Minnesota Timberwolves' interim coach.\n\nHis debut was a down-to-the wire finish with the Oklahoma City Thunder, one of the best teams in the Western Conference.\n\nHis team came through. Andrew Wiggins had a season-high 40 points and 10 rebounds, and the Timberwolves beat the Thunder 119-117 on Tuesday night.\n\nSaunders deflected credit after the game.\n\n\"It's unbelievable how they stayed connected throughout the whole game,\" he said. \"Down the stretch, there were so many times where we could have disbanded and then the crowd could have got into us. I can't say enough about that team.\"\n\nSaunders, just 32 years old, is the son of former Timberwolves head coach Flip Saunders. The team fired Tom Thibodeau on Sunday.\n\nThe players went all out for their new leader.\n\n\"He fed off our energy, and we fed off his energy,\" Timberwolves forward Taj Gibson said. \"We were just trying to get a win for him.\"\n\nKarl-Anthony Towns scored 20 points and Dario Saric added 15 for the Timberwolves.\n\nOklahoma City's Russell Westbrook missed two 3-pointers in the closing seconds that would have given the Thunder the lead. He finished with 25 points and 16 assists.\n\n\"We just tried to stay solid, really,\" Wiggins said. \"We knew they were going to try to be aggressive with either (Paul) George or Westbrook. If we're going to foul, make a hard foul. And don't let them hit the 3. That was the main thing.\"\n\nGeorge scored 27 points and Steven Adams added 20 points and 12 rebounds for Oklahoma City.\n\nThunder reserve center Nerlens Noel was taken off the court on a stretcher in the third quarter after Wiggins made contact with him on a dunk attempt.\n\nNoel took an elbow in the face as Wiggins went up, and Noel hit the ground hard. A defensive foul was called on Noel. The play was reviewed, and no additional fouls were called. Noel was down for several minutes before being taken from the court. Thunder coach Billy Donovan said Noel was taken to the University of Oklahoma's OU Medical Center.\n\n\"I just tried to make an aggressive move and dunk,\" Wiggins said. \"He tried to contest it. I think he fell wrong. I didn't really see it until I saw him on the ground. Hopefully, he's good. I hope nothing but the best for him. I hope he gets healthy soon and comes back stronger.\"\n\nIn the fourth quarter, Oklahoma City guard Dennis Schroder somehow won a jump ball with Towns, and Westbrook hit a 3-pointer to give the Thunder a 111-110 lead.\n\nJosh Okogie's corner 3-pointer with 26.8 seconds left put the Timberwolves up 119-115.\n\nWestbrook made two free throws, then Minnesota's Tyus Jones traveled with 15.5 seconds left to give the Thunder a chance.\n\nTIP-INS\n\nThunder: G Alex Abrines missed his fifth consecutive game for personal reasons. ... Schroder was listed as questionable with a left quad contusion, but he entered the game in the first quarter. ... Westbrook fell one assist short of his season high.\n\nTimberwolves: G Derrick Rose missed his sixth straight game with a sprained right ankle. ... F Robert Covington missed his fourth straight game with a bruised right knee. ... Timberwolves guard Jeff Teague was ejected in the third quarter after a skirmish with Schroder. He finished with eight points in 26 minutes. ... Wiggins and Towns both finished with five fouls.\n\nSTAT LINES\n\nWiggins made 16 of 18 free throws, one short of his career high for made free throws. Oklahoma City made 19 free throws overall.\n\nHE SAID IT\n\nWiggins, on run-in with Schroder in the third quarter: \"I don't know what's wrong with him ... I looked right through it. He's not someone I see as a problem.\"\n\nUP NEXT\n\nTimberwolves: Host the Dallas Mavericks on Friday.\n\nThunder: At the San Antonio Spurs on Thursday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994588.0354738
}