{
  "game_id": "0021900580",
  "espn_id": "401161222",
  "date": "Jan 11, 2020",
  "matchup": "LAL @ OKC",
  "headline": "Lakers top Thunder 125-110 without LeBron, Anthony Davis",
  "body": "OKLAHOMA CITY --  The Los Angeles Lakers fully expected victory, even without LeBron James and Anthony Davis.\n\nKyle Kuzma was among those who took advantage. He scored a season-high 36 points and the Lakers rolled past the Oklahoma City Thunder, 125-110 on Saturday night.\n\nLakers coach Frank Vogel said James had a chest cold. James is averaging 25.4 points, a league-leading 10.7 assists and 8.7 rebounds and has helped the Lakers to the best record in the Western Conference.\n\nDavis, who leads the Lakers with 27.1 points per game, sat out for his second straight game with a gluteus maximus contusion.\n\nStill, the Lakers felt they had enough to win, even against a Thunder team that had won 11 of 13.\n\n\"That's why you have a great team,\" said Quinn Cook, who led the Lakers' reserves with 13 points. \"We want to have guys who contribute one through 15. That's the goal of anybody putting a team together. Obviously, this team is talented. Everybody is selfless and everybody is ready. We all put the work in.\"\n\nKuzma, in just his third start of the season, made 15 of 24 shots.\n\n\"I just got an opportunity to get scoring opportunities, having the ball in my hands,\" Kuzma said.\n\nRajon Rondo added 21 points, 12 rebounds and eight assists for the Lakers. Los Angeles shot 51.5% to win its eighth in a row.\n\n\"Rondo set the tone for us,\" Kuzma said. \"Going right after CP (Chris Paul) right out of the gate, being aggressive with his scoring. A lot of times, everybody knows him as a pass-first guy. He came out today in attack mode.\"\n\nJames played on Friday night and had 35 points, 16 rebounds and seven assists in a win over the Dallas Mavericks.\n\nWithout him, the Lakers raced to a 73-49 halftime lead over the Thunder behind 58% shooting. Kuzma scored 23 points before the break. It was Oklahoma City's largest halftime deficit of the season.\n\nThe Lakers extended the lead to 32 in the third quarter before Oklahoma City rallied and trimmed its deficit to 102-82 at the end of the period.\n\nThe Thunder got as close as 11 points with 2:37 to go before a short jumper and a 3-pointer by Kuzma ended the rally.\n\nShai Gilgeous-Alexander and Danilo Gallinari each scored 24 points for Oklahoma City. The Thunder came out flat after an emotional win over the Houston Rockets in Russell Westbrook's return on Thursday.\n\nIt was a tough lesson for the Thunder, who have been surprisingly good this season.\n\n\"I thought that they brought the energy and the intensity, and we didn't match it from the first minute,\" Gallinari said.\n\nTIP-INS\n\nLakers: G Danny Green sat out with a sore right hip. ... C Dwight Howard was issued a technical in the fourth quarter. ... Howard had 14 rebounds.\n\nThunder: Reserve center Nerlens Noel missed the game with sprained left ankle. ... Gallinari was issued a technical foul in the third quarter for arguing a call against him. ... Shot 52.4% in the second half and outscored the Lakers 61-52.\n\nSTAT LINES The Lakers got 48 points from their bench, including 13 points from Cook, 12 from Dwight Howard and Troy Daniels, and 11 from Alex Caruso.\n\nQUOTABLE\n\nVogel on how Kuzma will benefit from the game: \"I really think that's going to carry over to when those guys (James and Davis) come back, and we'll continue to see his minutes grow and grow throughout the season.\"\n\nUP NEXT\n\nLakers: Host the Cleveland Cavaliers on Monday.\n\nThunder: Visit the Minnesota Timberwolves on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995998.4174871
}