{
  "game_id": "0022400281",
  "espn_id": "401704847",
  "date": "Nov 25, 2024",
  "matchup": "LAC @ BOS",
  "headline": "Kristaps Porzingis scores 16 in season debut, Celtics hit 22 3-pointers in 126-94 win over Clippers",
  "body": "BOSTON -- — Jayson Tatum scored 20 points and the Boston Celtics made 22 3-pointers in a 126-94 win over the Los Angeles Clippers on Monday night. \n\n\r\n              Payton Pritchard added with 20 points for Boston, which extended its season-high win streak to six games. \n\n\r\n              Kristaps Porzingis finished with 16 points on 6 of 12 shooting, to go along with six rebounds and two blocks in his season debut following offseason ankle surgery. He made the start and played 23 minutes with Al Horford (illness) and Luke Kornet (hamstring) out. \n\n\r\n              Ivica Zubac led the Clippers with 23 points and 10 rebounds. James Harden added 19, nine assists and eight rebounds. The loss snapped a five-game win streak for LA. \n\n\r\n              Takeaways\r\n              Clippers: Los Angeles made the game a little interesting in the third quarter, using a 22-8 run to trim Boston’s lead to 14. But Boston made its next three 3s to help push the lead back above 20.\n\n\r\n              Celtics: Teams entered the night averaging 52.8 points per game in the paint against the Celtics this season. The Clippers finished with 58 interior points, but made noticeable adjustments when Porzingis was on the floor. \n\n\r\n              Key moment\r\n              The Celtics went 4 for 17 from 3-point distance in the first quarter, then opened the second by connecting on 10 of their first 13 attempts from beyond the arc. It helped stretch what had been a seven-point lead after the opening 12 minutes to 19 points. \n\n\r\n              Key stat\r\n              Boston finished the second quarter 12 for 17 from 3, tying the NBA record for 3-point makes in a quarter. \n\n\r\n              Up next\r\n              The Clippers continue their four-game trip on Wednesday against the Washington Wizards. The Celtics visit the Chicago Bulls on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998051.662233
}