{
  "game_id": "0022200620",
  "espn_id": "401468775",
  "date": "Jan 11, 2023",
  "matchup": "MIL @ ATL",
  "headline": "Holiday, Lopez help Bucks hold off Hawks, 114-105",
  "body": "ATLANTA -- — Jrue Holiday scored 27 points, Brook Lopez had 20 points and 12 rebounds and the Milwaukee Bucks held off the Atlanta Hawks 114-105 on Wednesday night.\n\n\r\n              Giannis Antetokounmpo added seven points, 18 rebounds and 10 assists, and Bobby Portis II had 13 points and 10 rebounds. Milwaukee has won four of five.\n\n\r\n              “We’re resilient,\" Holiday said. “We don’t like to lose. I think close games like that — not that we enjoy those moments — but we do think they’re teaching moments where can kind of close out games and use all that and everything we did tonight in the future.\" \n\n\r\n              The Hawks, playing without Trae Young and Clint Capela, erased a 24-point deficit early in the third to make it 101-all on John Collins’ fast-break layup with 4:05 remaining. They took their first lead on Bogdan Bogdanovic’s baseline jumper coming out of a timeout. Lopez answered with a corner 3, and the Bucks went on a 10-0 run and led the rest of the way.\n\n\r\n              Bogdanovic scored 22 points, and De'Andre Hunter had 16 for the Hawks.\n\n\r\n              “We did a better job of applying pressure in the second half,\" Atlanta coach Nate McMillan said. “This is a team that’s going to try to attack the paint, attack the rim and if they can’t get to the rim, they’re going to shoot 3s. In the second half we got more pressure, disrupted more and were able to get some stops.\" \n\n\r\n              An illness left the Hawks without Young, averaging 27.3 points and 9.8 assists. Leading rebounder Capela was sidelined with a strained right calf.\n\n\r\n              The Bucks led 39-19 after the first quarter and built a lead that didn't look like the Hawks could overcome when Milwaukee led by 24 in the third. \n\n\r\n              “Credit to our guys,\" Milwaukee coach Mike Budenholzer said. “We had a big lead, then a big comeback for Atlanta. A big punch from Atlanta. We were able to throw the last one and were able to finish it. Credit to our players.\"\n\n\r\n              It was an uncharacteristicly low scoring night for Antetokounmpo, the two-time MVP who averages 31.7 points, but Budenholzer thought he was engaged throughout the game.\n\n\r\n              “I thought it was one of Giannis’ best games without scoring,\" Budenholzer said. “I thought he trusted his teammates. He made a ton of great plays. For him to go to the boards, do everything else he does and then find the willpower, the competitiveness to get a tough offensive rebound, not force it through a bunch of traffic.\"\n\n\r\n              TIP-INS\n\n\r\n              Bucks: G Khris Middleton missed his 34th game, the last 13 with right knee soreness, but he participated in 5-on-5 drills Tuesday in Atlanta and is getting closer to returning. ... Milwaukee shot 64.3% on 3s while the Hawks 0 for 3 beyond the arc in the first quarter. ... Starting guard Grayson Allen sprained his right ankle in the first half and did not return. He finished with six points. ... Holiday improved to 6-2 in games against brothers Aaron and Justin Holiday.\n\n\r\n              Hawks: Capela missed his eighth straight game and 11th overall. ... Atlanta was outrebounded 32-20 in the first half and 57-41 overall. ... Aaron Holiday started in Young’s spot and finished with four points in 14 minutes. Justin Holiday did not play. ... Derrick Favors, a 12-year veteran forward-center, was added to the Hawks’ roster on a 10-day contract to give the team more size during Capela’s absence. He has not played this season.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Miami on Thursday and Saturday.\n\n\r\n              Hawks: At Indiana on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994575.352986
}