{
  "game_id": "401809965",
  "espn_id": "401809965",
  "date": "Oct 26, 2025",
  "matchup": "MIN vs IND",
  "headline": "Timberwolves hang on to beat depleted Pacers 114-110, after Edwards exits early with tight hamstring",
  "body": "MINNEAPOLIS -- — Julius Randle had 20 of his 31 points in the first half and Rudy Gobert added 14 points and 19 rebounds, helping the Minnesota Timberwolves hold on after an early exit by star Anthony Edwards to beat the depleted Indiana Pacers 114-110 on Sunday night.\n\n\r\n              Edwards was pulled with hamstring tightness, but Donte DiVincenzo (17 points) held together the backcourt and Naz Reid (16 points, 10 rebounds) pitched in, too.\n\n\r\n              After Pascal Siakam hit 33 points for the Pacers on his 3-pointer with 42 seconds left to cut their deficit to 110-108, Jaden McDaniels answered with a finger-roll to push the lead to four with 20 seconds remaining.\n\n\r\n              Aaron Nesmith added 18 points for the Pacers, who are resigned to playing the season without Tyrese Haliburton, and lost current leading scorer Bennedict Mathurin to a sprained toe the previous night in Memphis. \n\n\r\n              Andrew Nembhard, the primary point guard while Haliburton recovers from the torn Achilles tendon that painfully ended his NBA Finals, was out for the second straight game with a shoulder strain among seven players unavailable.\n\n\r\n              That left the Pacers (0-3), who lost their opener in double overtime to defending champion Oklahoma City, with a starting lineup including journeyman Jay Huff, little-used big man Isaiah Jackson, and young guard Ben Sheppard.\n\n\r\n              The home opener hype in Minnesota, with the rollout of stage-style lighting on the court and the return of the all-black uniforms with pine-tree trim worn during the Kevin Garnett era, abated when Edwards went missing 3:08 into the game.\n\n\r\n              But as he watched from the bench in a gray hoodie and black shades, the Wolves (2-1) took control by outscoring the Pacers 28-17 in the third quarter and drawing 11 fouls while being whistled for only three that period.\n\n\r\n              Up next\r\n              Indiana plays at Dallas on Wednesday. Minnesota hosts Denver on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042506.540454
}