{
  "game_id": "0022100208",
  "espn_id": "401360032",
  "date": "Nov 15, 2021",
  "matchup": "TOR @ POR",
  "headline": "McCollum scores 29 as Trail Blazers beat Raptors 118-113",
  "body": "PORTLAND, Ore. -- — If only the Trail Blazers could figure out why they're successful at home but struggle on the road. \n\n\r\n                    CJ McCollum had 29 points and Damian Lillard added 24 to lead the Portland Trail Blazers to a 118-113 victory over the Toronto Raptors on Monday night. \n\n\r\n                    The Blazers, who were playing the second of a back-to-back, improved to 6-1 at home. That's in stark contrast to the road, where Portland is 1-7. \n\n\r\n                    “When we play at home, it's a different team than when we play on the road. That's just the truth. And I'm not sure what it is,” Lillard said. “I think when you're at home there's just a level of comfort and support that you feel from the fans. But at the same time, we're NBA players. We play on the road a lot.”\n\n\r\n                    OG Anunoby had 27 points for the Raptors, who have lost five of six. Pascal Siakam added 20. \n\n\r\n                    “They made tough shots,” Anunoby said. “We were playing hard. They’re making tough shots, but we were playing hard. That’s how it goes sometimes. They have good players on their team.”\n\n\r\n                    It was a streaky fourth quarter for both teams. Larry Nance Jr.'s alley-oop dunk gave Portland a 99-89 lead before McCollum's 3-pointer pushed it to 105-92. \n\n\r\n                    The Raptors rallied with a 9-0 run, pulling to 105-101 on Fred VanVleet's 3-pointer with 5:34 left. Portland didn't let Toronto get any closer, and Lillard's 3 stretched the Blazers' lead to 110-101. \n\n\r\n                    VanVleet made consecutive 3-pointers to narrow it to 112-111 with 1:51 to go. After Norman Powell made free throws for Portland, McCollum hit a jumper to make it a five-point game. Nance's dunk all but sealed the win with 38.5 seconds left. \n\n\r\n                    Nance finished with 15 points off the bench. \n\n\r\n                    “We've got a rest day tomorrow, so I can sleep all day if I want. So there was no excuse not to use every bit of energy we had,” Nance said. “I thought we did an outstanding job in the fourth quarter of fighting off their runs and making some of our own.”\n\n\r\n                    Lillard was questionable before the game because of an abdominal strain, but he started. Lillard missed the Blazers' loss at Denver on Sunday night with the injury. \n\n\r\n                    Lillard has had a slow start to the season, averaging 20 points a game, well off his average last season. \n\n\r\n                    VanVleet returned to the Raptors after missing a game with groin soreness, but center Precious Achiuwa missed a second straight game with right shoulder tendinitis. \n\n\r\n                    Toronto led by 14 early and went into the second quarter up 33-24. Anunoby had 14 points, including four 3-pointers in the opening quarter alone. \n\n\r\n                    The Blazers ended the first half on a 9-0 run to take a 61-60 lead at the break. \n\n\r\n                    Portland stretched the lead to eight in the third quarter, but Toronto tied it at 85 going into the final period on Malachi Flynn's driving layup. \n\n\r\n                    Lillard and McCollum hit back-to-back 3-pointers to give the Blazers a 93-85 lead. \n\n\r\n                    “The start of the second and the start of the fourth really let us down,” Raptors coach Nick Nurse said. “It changed the momentum and put us in a hole in the fourth.”\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: It was the first of a six-game road trip. ... Gary Trent Jr. played his first two-plus seasons in Portland. ... All five of Toronto's starters were in double figures. \n\n\r\n                    “I still feel like we’ve got a lot of room to grow,” Toronto center Khem Birch said. “We’ve got a lot of young guys who are still developing. We’ve just got to be patient and it's gonna come soon.\"\n\n\r\n                    Trail Blazers: Lillard had 10 of his 16 first-half points in the second quarter. ... Portland was coming off a 1/3 road trip. ... Lillard had eight assists. ... McCollum had six 3-pointers. \n\n\r\n                    UP NEXT\n\n\r\n                    The Raptors visit the Utah Jazz on Thursday. \n\n\r\n                    The Trail Blazers host the Chicago Bulls on Wednesday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764993166.473989
}