{
  "game_id": "0022000472",
  "espn_id": "401267632",
  "date": "Feb 21, 2021",
  "matchup": "BKN @ LAC",
  "headline": "Nets hold on to edge Clippers, win season-best 6th in a row",
  "body": "LOS ANGELES -- — James Harden scored 37 points and the Brooklyn Nets held off a furious fourth-quarter rally to edge the Los Angeles Clippers 112-108 on Sunday night for their season-best sixth victory in a row.\n\n\r\n                    The Nets wrapped up a 5-0 trip, beating Golden State, Sacramento, Phoenix, and both Los Angeles teams to complete their longest undefeated single trip in franchise history. All but two of the wins were by double digits. They've now defeated West teams eight straight times. \n\n\r\n                    “Winning six in a row, all it does is keep the world silent for a bit,” Kyrie Irving said. “When we hit a bump in the road, then it’s, ‘What’s going on with the Nets?' The destination is making it to that main stage and earning our way there.”\n\n\r\n                    Harden just missed a triple double, finishing with 11 rebounds and seven assists. Irving added 28 points and eight assists. \n\n\r\n                    Paul George led the Clippers with 34 points. Kawhi Leonard had 29 points on 9-of-19 shooting. Ivica Zubac finished with 13 points, but no other Clippers reached double figures. Lou Williams was 2 of 11, and Marcus Morris 2 of 7.\n\n\r\n                    The Nets dominated in the paint, outscoring the Clippers, 60-38. \n\n\r\n                    Leonard hit a pair of free throws to it it 108-all with 28 seconds remaining.\n\n\r\n                    Irving missed a 3-pointer and former Clipper DeAndre Jordan grabbed the offensive rebound and scored. Leonard got called for an offensive foul that put Harden at the line, and he made both free throws to finish off the victory. \n\n\r\n                    “No call, so great defense,” said Leonard, who promptly got up and walked out of his postgame virtual media session.\n\n\r\n                    Brooklyn got off to a quick start in the fourth. Harden breezed past Zubac to score, Joe Harris hit a 3-pointer and Harden made a pair of free throws for a 15-point lead — its largest of the game.\n\n\r\n                    Zubac and George combined to score 20 straight points, drawing the Clippers to 103-99. Zubac dunked twice and George made two 3-pointers and six free throws in the spurt. Leonard ran off four in a row that drew the Clippers to 107-103.\n\n\r\n                    Patrick Beverley fouled Jeff Green from behind with 2:50 remaining. Green crumpled to the floor and the Clippers challenged the call, but lost. Green kicked over a drink cooler on his way off the court.\n\n\r\n                    “We showed mental toughness and belief by continuing on this trip no matter who is available,” Nets coach Steve Nash said, citing the team’s 24-point comeback at Phoenix and its recovery from blowing the lead to the Clippers. “Some of that toughness has to be built, it’s not just turned on.”\n\n\r\n                    Williams hit a 3-pointer and Jordan fouled Leonard, who made both for the tie. \n\n\r\n                    Brooklyn stretched a seven-point halftime lead to 11 points in the third. The Clippers closed within four points on a basket by George, but the Nets quickly got back to double digits on a 3-pointer by Harris. \n\n\r\n                    Irving scored 12 points — matching his total from the first half — to send the Nets into the fourth leading 89-79.\n\n\r\n                    “We’re still growing, but this is a really good road trip for us,” Harden said. “From when I first got here, we’re playing hard and we’re playing smart. We’ve had time to go over things on both sides of the ball and that’s why we’re playing better.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Kevin Durant missed his fourth straight game with a left hamstring strain. He's averaging 29 points, 7.3 rebounds and 5.3 assists. “Even when Kevin gets back, it's not going to be easy,” Harden said. \n\n\r\n                    Clippers: Fell to 11-6 at home. ... Previously lost to the Nets by four points Feb. 2. \n\n\r\n                    OVER AND OUT\n\n\r\n                    George was pulled with 2:50 to play and the Clippers down six. He had clocked 33 minutes; his playing time is being restricted as he returns from a toe injury. “I wanted to keep going,” he said. “I’m healthy and I feel good.”\n\n\r\n                    HELPING HAND\n\n\r\n                    Harden is working to help out people in his former city of Houston affected by the winter storms that knocked out electricity and caused pipes to burst in the unusual cold that battered the region. Besides food, he says water will be shipped in this week and he's talking to plumbing companies about repairs. “It won’t stop because there’s so many people that’s been affected that I can’t stop,” he said. “Phone calls every day trying to impact the city because they’re shown me so much love and respect.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host Sacramento on Tuesday night.\n\n\r\n                    Clippers: Host Washington on Tuesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997501.6183722
}