{
  "game_id": "0021801029",
  "espn_id": "401071702",
  "date": "Mar 15, 2019",
  "matchup": "MIL @ MIA",
  "headline": "Bucks, down 20 at half, rout Heat in historic rally",
  "body": "MIAMI -- There was no yelling and screaming in the Milwaukee locker room at halftime.\nA little bit of film got reviewed, a couple of adjustments got discussed and the Bucks believed a 20-point deficit could be overcome.\nThey were right.\nGiannis Antetokounmpo scored 33 points and finished an assist shy of a triple-double, and the Bucks tied a franchise record for second-half comebacks on the way to beating the Miami Heat 113-98 on Friday night.\n\n\"It doesn't matter if you're down 20, 15, 10,'' said Antetokounmpo, who also had 16 rebounds and 9 assists. \"We're going to keep playing hard. It's a process. You've got to win games like this. You've got to face adversity when you're playing on the road. In the playoffs, it's not going to be easy. We want to be a great team, and that's why we keep playing hard.''\nThe Bucks were 1-100 all time -- 0-77 on the road -- when trailing by 20 or more at the half. They trailed 72-52 at the half against the New York Knicks on Feb. 18, 1977, and won 124-123.\nOn Friday, it was Heat 62, Bucks 42 at the half.\nFrom there, Bucks 71, Heat 36. Milwaukee also became the first team in NBA history to trail by at least 20 at the break and wind up winning by at least 15 points.\n\"We lost our energy in the second half,'' said Justise Winslow, who led Miami with 20 points -- all before intermission.\nThe Heat's lead over Orlando and Charlotte for the No. 8 spot in the Eastern Conference was trimmed to just one game.\nHassan Whiteside had 14 points and 11 rebounds for the Heat, Josh Richardson scored 11 points and Dwyane Wade was one of four players with 10 for Miami. Wade bruised his right hip on a hard fall late in the third quarter.\n\nKhris Middleton scored 21 and Eric Bledsoe had 17 for the NBA-best Bucks, who improved to 52-17.\nAntetokounmpo was in total control of the second half, grabbing an offensive rebound with 2:40 left and throwing a no-look, behind-the-head pass to Bledsoe for a layup and a 110-92 lead. Most fans didn't see it -- they were long gone by then.\n\"To do what we did in the second half, I'm just pleased with the guys, the way they were able to flip it,'' Bucks coach Mike Budenholzer said. \"Our defense fuels our offense. We want that to be our identity.''\nThe Bucks lost Malcolm Brogdon in the first quarter to a sore right heel. Brogdon was 0-for-3 in 7 minutes.\nThe rally from 23 down was the Bucks' biggest of the season, one better than what they did against Chicago on Nov 16. It was only the fifth game all season where the Bucks trailed by 20 or more, and they're now 2-3 in those games.\nThe Heat came out flying, leading 25-8 before any of the starters came out for their first rest of the night. The biggest lead was 37-14 with a minute to go in the opening quarter, and the Bucks pared that down to 13 on three occasions in the second quarter. Miami wound up closing the half on a 10-3 spurt to push the lead back to 20.\nIt all changed -- and fast.\nThe Bucks made as many 3-pointers in the third quarter -- five -- as the Heat made field goals. Middleton and Ersan Ilyasova each had 10 points in the quarter, Miami shot 5-for-20 and got outrebounded 16-8, and the lead was down to one going into the fourth.\nThe lead didn't last long, and Milwaukee kept pulling away.\n\"Sometimes you're going to miss open shots,'' Heat coach Erik Spoelstra said. \"Sometimes you're going to miss free throws. Sometimes there are going to be turnovers. Sometimes there are going to be things you don't agree with the officiating. All of that in the second half really distracted us, and they really took advantage of that.''\nTIP-INS\nBucks: Middleton also had eight assists. ... George Hill returned after a nine-game absence with an adductor strain. He played seven scoreless minutes.\nHeat: It was the fourth time in franchise history that Miami lost when leading by 20 or more at the half. The Heat had been 51-0 all time at home and 71-3 all time overall with that big a lead at the break. ... Miami signed guard Charles Cooke to a 10-day contract before the game. Cooke has been with the team's G League affiliate in Sioux Falls, South Dakota.\nCLOSING IN\nBucks center Brook Lopez was 0-for-1 from 3-point range. He's now up to 436 3s attempted in the 2018-19 campaign, three shy of matching Channing Frye's mark for the most ever by a 7-footer in a season. Frye tried 439 in 2010-11.\nONLY ONE\nMiami was bidding to become the second team this season to beat Milwaukee twice. Only Phoenix has managed to do that so far in 2018-19.\nUP NEXT\nBucks: Host Philadelphia on Sunday.\nHeat: Host Charlotte on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994459.049432
}