{
  "game_id": "0021900027",
  "espn_id": "401160669",
  "date": "Oct 26, 2019",
  "matchup": "DET vs. PHI",
  "headline": "Tobias Harris returns to Detroit to lead 76ers past Pistons",
  "body": "DETROIT --  The Philadelphia 76ers are expected to be one of the NBA's top teams this season.\n\nSaturday night, they lived up to those expectations with their best player was in street clothes.\n\nWith Joel Embiid sidelined with an ankle injury, the 76ers still had too much height and speed for the Detroit Pistons, beating them 117-111.\n\nTobias Harris scored 29 points against his former team, Al Horford added 23 and Mike Scott had 17 as a reserve. Of their 69 points, 33 came on 11-of-19 3-point shooting.\n\n\"They are really tough to guard because they've got so many big guys who can pop out and knock down a 3-pointer,\" Pistons center Christian Wood said.\n\nHarris said the Sixers won by sticking to their game plan despite Embiid's absence.\n\n\"We were playing defense, moving the call and creating shots,\" he said. \"I had a lot of great looks because we would get a stop at one end and we would get down the floor and create something off the run.\"\n\nPhiladelphia had 30 assists to Detroit's 20 and held one of the league's best offensive-rebounding teams to five in 37 attempts.\n\n\"We've got a lot of new parts and we're still learning each other, but we kept battling tonight,\" said Ben Simmons, who had 13 points and 10 assists. \"That was huge.\"\n\nThe Pistons also weren't at full strength, either. Blake Griffin's season won't start for Detroit until November because of knee and hamstring soreness and Reggie Jackson missed the game with a back injury.\n\nDetroit led by 13 points in the third quarter, but Drummond came out of the game with his fourth foul, leaving Dwane Casey to improvise a lineup that also couldn't include leading scorer Derrick Rose. Philadelphia cut the lead to one in less than four minutes.\n\n\"A stretch without Blake, Reggie, Andre and Derrick is going to be tough,\" he said. \"We're asking guys to play together who have never been on the floor as a group with the game on the line.\"\n\nRose led Detroit with 31 points in 27 minutes, but his history of injuries doesn't allow Casey to use him as much as he'd like.\n\n\"Believe me, I would love to have him out there for 40 minutes a night, but he just can't do it,\" Casey said.\n\nThe Pistons turned the ball over 23 times, leading to 31 Philadelphia points, and missed 15 free throws in a game that was close until the closing moments. Drummond had 13 points and 12 rebounds, but only three came on the offensive end, and he was 3-of-10 from the line.\n\n\"You can't make 21 free throws out of 36 and turn the ball over 23 times against a great team,\" Casey said.\n\nDrummond had a chance to tie it in the final five minutes, but Kyle O'Quinn blocked his layup and Simmons scored at the other end before Drummond got off the floor. That gave the 76ers a 101-97 lead with 4:37 to play and forced coach Dwane Casey into a timeout.\n\nAfter a Pistons miss, Horford hit a 3-pointer, then made it 107-97 with a three-point play after a Detroit turnover.\n\nHorford added two more baskets as the Sixers closed out the game.\n\nTIP INS\n\n76ers: Horford scored 15 points in the first 10 minutes of the third quarter. ... Harris, a fan favorite during his time in Detroit, playfully waved to the crowd after one of his 3-pointers.\n\nPistons: Casey challenged a second-quarter foul on Drummond. The call was upheld, costing Detroit a timeout. ... Markieff Morris had 14 points and Luke Kennard combined for 26 points in the first half, but only seven in the second half.\n\nWOOD LOOKING FOR PLAYING TIME\n\nPistons center Christian Wood played four minutes in the season opener and didn't get on the floor Thursday against Atlanta, so he wanted to make the most of his 19 minutes on Saturday. With Griffin out and Drummond in foul trouble, Wood had 11 points and five rebounds.\n\n\"I'm trying to show that I deserve to be in the rotation,\" he said. \"I want the coaches to know I can guard someone like Ben Simmons or Mike Scott in a key situation.\"\n\nUP NEXT\n\n76ers: At Atlanta on Monday night.\n\nPistons Host Indiana on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996312.288457
}