{
  "game_id": "0021500621",
  "espn_id": "400828508",
  "date": "Jan 18, 2016",
  "matchup": "TOR vs. BKN",
  "headline": "Lowry, DeRozan lead Raptors over Nets 112-100",
  "body": "TORONTO --  Kyle Lowry and DeMar DeRozan are both All-Star hopefuls for Toronto. They showed why while helping the Raptors match a season high with their fifth straight win.\n\nThe backcourt duo combined for 61 points, including 17 in the fourth quarter, and the Raptors pulled away from the Brooklyn Nets down the stretch in a 112-100 victory Monday night.\n\n\"They played like All-Stars tonight and without their performance we don't win the game,\" Raptors coach Dwane Casey said. \"They have played so much together, the continuity, the offensive sets, the spacing and they understand where each other is going to be.\"\n\nToronto outscored the Nets 31-16 in the fourth quarter, including 14-2 to end the game, after trailing by nine points late in the third.\n\nLowry scored 13 of his game-high 31 points in the fourth quarter, including three of his seven 3-pointers, and added eight assists while DeRozan scored 30 points and had five assists.\n\nIt was the first time Lowry and DeRozan have each scored at least 30 points in the same game.\n\nDeRozan said he and Lowry are \"extremely comfortable\" taking over games.\n\n\"It's second nature now and a lot of things do not need to be said,\" DeRozan said. \"It's a feel thing and something that comes from years of playing and knowing each other's game.\"\n\nThe Nets led for much of the second half before going cold with the game on the line. They have lost three straight and eight of their last nine.\n\nThe game featured eight lead changes and 11 ties, the last of them 98-98 with 6:33 to go.\n\nTerrence Ross scored five straight points to give Toronto the lead for good. DeRozan added a basket, and then Lowry hit his third 3 of the quarter to make it 108-98.\n\n\"We did a good job of taking care of the ball the majority of the second half,\" said Brook Lopez, who led the Nets with 29 points and 10 rebounds. \"Our turnovers really hurt us and obviously they got a lot of buckets off those.\"\n\nThe Nets turned the ball over 14 times leading to 20 Raptors points while Toronto turned it over eight times leading to 11 points for Brooklyn.\n\n\"It seems like the same old story,\" Brooklyn interim coach Tony Brown said. \"We get down late in stretches of the game, some of the things we were doing really well, we started turning the ball over late.\"\n\nJoe Johnson had 22 points, seven assists and five rebounds for the Nets, Donald Sloan had 13 points, eight rebounds and six assists while Thaddeus Young added 11 points and nine rebounds.\n\nJonas Valanciunas had a game-high 12 rebounds to go with six points for the Raptors while Patrick Patterson and Ross each had 12 points off the bench for Toronto.\n\nLowry said the attention given to his teammates, particularly DeRozan, gave him \"wide-open looks\" throughout the night.\n\nTIP-INS\n\nNets: Brooklyn dropped to 4-16 on the road this season. ... The Nets hit just 7 of 19 field goal attempts in the fourth quarter.\n\nRaptors: The Raptors bench outscored the Nets reserves 33-21 on the night. ... Ross was 5 for 5 from the field, including two 3s.\n\nRISING BROOK\n\nMonday was the 456th game as a Net for Lopez, moving him into a tie with Lucious Harris for ninth on the franchise's career list of games played.\n\nNOT ENOUGH NET\n\nBrooklyn shot 51 percent on the night, just the second time in six games this season the Nets have lost when shooting at least 50 percent from the field.\n\nOLYMPIC FINALIST\n\nDeRozan was named a finalist for Team USA for the 2016 Olympics in Brazil. He was a member of the American team that went 9-0 to win the 2014 FIBA World Cup in Spain and is among 30 players vying for the 12-man roster.\n\nROAD WARRIORS\n\nThe Raptors, 12-6 in Toronto and 14-9 away, are one of only two teams in the NBA with more wins on the road than at home but a better than .500 record in both places. Dallas is the other team.\n\nUP NEXT\n\nThe Nets host the Cavaliers on Wednesday night.\n\nThe Raptors host the Celtics on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994733.468898
}