{
  "game_id": "0022300248",
  "espn_id": "401584876",
  "date": "Nov 26, 2023",
  "matchup": "CHA @ ORL",
  "headline": "Franz Wagner, Cole Anthony score 30 each, Magic beat Hornets 130-117 for 7th straight win",
  "body": "ORLANDO, Fla. -- — Franz Wagner and Cole Anthony scored 30 points each to help the Orlando Magic pull away for a 130-117 victory over the Charlotte Hornets on Sunday night and extend their win streak to seven games.\n\n\r\n              Anthony scored 17 points in the fourth quarter, keying a rally that helped the Magic stretch their lead as high as 16 points. Paolo Banchero added 23 points and eight assists.\n\n\r\n              Miles Bridges had 23 points and 10 rebounds for the Hornets, who played the second half without LaMelo Ball after he went down with an ankle injury.\n\n\r\n              Terry Rozier, playing for the first time since Nov. 4 after missing nine games with a groin strain, had 22 points and nine assists for Charlotte.\n\n\r\n              The win streak is Orlando’s longest since a franchise-record nine-game streak from Dec. 23, 2010 to Jan. 12, 2011. Wagner, for one, doesn't see any reason it can't go much longer.\n\n\r\n              “I think everybody in the building believes so and that’s what made this,” he said. “That’s how it starts for us, I think — the change in our mentality compared to the last two years.”\n\n\r\n              “It wasn’t our best start, it wasn’t our best game, but you can’t be mad about a win in the NBA,\" said Anthony, who also had seven rebounds, seven assists and two steals. “We’ve got to approach everything the exact same away. We’ve set a standard for ourselves and we need to maintain that standard.”\n\n\r\n              Despite the absence of Ball, Orlando led by only 95-92 when Anthony drove for a 3-point play with 10:12 remaining. He stole a pass and got it to Wagner for two free throws, then assisted Banchero's 7-foot bank shot. Charlotte never again got the lead under five.\n\n\r\n              The Hornets found themselves down 61-57 after a first half in which they shot 59.5% (25 for 42). Offense wasn't the problem, according to Hornets coach Steve Clifford.\n\n\r\n              “We've played now 15 games and 13 of them were more than good enough to win offensively regardless of who’s out there,” Clifford said. “But we've got to defend better in the half court.”\n\n\r\n              Wagner made his first nine shots, a variety of layups, dunks and finger rolls, and all five of Magic center Goga Bitadze's field goals came on dunks. The Magic had 33 assists on 47 field goals. \n\n\r\n              Caleb Houstan scored six points on one possession to help Orlando build a 9-point lead in the second quarter. Brandon Miller flagrantly fouled Houstan on a shot attempt. After Houstan made all three free throws, the Magic retained possession and Houstan hit a 3-pointer. Those were his only six points of the game.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit New York on Tuesday.\n\n\r\n              Magic: Host Washington on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995658.733452
}