{
  "game_id": "0021800078",
  "espn_id": "401070759",
  "date": "Oct 27, 2018",
  "matchup": "CHA @ PHI",
  "headline": "Embiid leads 76ers past Hornets",
  "body": "PHILADELPHIA --  The \"3-and-D\" approach fit Philadelphia's Robert Covington perfectly.\n\nCovington hit a key 3-pointer down the stretch and made Charlotte star Kemba Walker work hard for every point, helping the 76ers defeat the Hornets 105-103 on Saturday night.\n\nJoel Embiid had 27 points and 14 rebounds and J.J. Redick and also hit a key 3-pointer late.\n\nThe game was tied at 99 after Walker's 3-pointer with 3:04 left. Redick put the 76ers ahead 102-99 with 2:03 left by nailing a 3 from the left wing. Walker answered with a layup to pull Charlotte within one, but Covington drained a 3-pointer from the right wing five seconds later to make it 105-101.\n\nCovington finished with 18 points and 10 rebounds. He also chased the speedy and talented Walker all over the court.\n\nWalker scored 37 points but needed 31 shots, finishing 11-for-31 from the field.\n\nPhiladelphia coach Brett Brown credited Covington.\n\n\"Covington's best game of the year,\" Brown said. \"He ended up being our bell-ringer. He had that big 3 to really seal the game. He was very good tonight.\"\n\nEmbiid also was his usual good self despite being game-time decision after injuring his left ankle in practice on Friday. But the Philadelphia big man didn't favor his ankle at all while recording his sixth double-double in as many games to start the season.\n\n\"I'm good,\" he said.\n\nBen Simmons contributed 14 points and 12 rebounds for Philadelphia, which evened its record at 3-3.\n\nThe Philadelphia point guard credited Covington.\n\n\"Covington's amazing game on Kemba made it tough for him to score,\" he said.\n\nWalker entered second behind Steph Curry in 3-point attempts (64) and 3-pointers made (29) but went just 3-for-15 from the arc on Saturday. The two-time All-Star had 30 points, hitting 11 of 18 from the field, in Friday's 135-106 win over Chicago.\n\nHornets coach James Borrego acknowledged that the back-to-back situation likely affected Walker.\n\n\"Sometimes those shots don't fall with tired legs,\" he said.\n\nOverall, though, Borrego liked his team's performance.\n\n\"Great effort, especially defensively,\" he said. \"I'm really proud how they battled.\"\n\nFollowing Covington's 3-pointer, the Hornets missed all four of their field-goal attempts from that point, with Walker's two free throws with 2.6 seconds left accounting for their final points.\n\nNeither team led by more than six points in a tightly contested second half. The 76ers erased an 85-83 deficit to start the fourth by scoring six straight to open the period and take an 89-85 lead with 10:50 left. Second-year guard Markelle Fultz electrified the crowd with a one-handed fastbreak dunk during the spurt.\n\nFultz also drew cheers with a first-half spinning layup and a third-quarter baseline jumper. The second-year guard re-worked his jump shot over the summer after shooting struggles during an injury-plagued season last year.\n\nTIP-INS\n\nHornets: G Tony Parker (rest) didn't play.  . Rookie Miles Bridges had 14 points.\n\n76ers: Wilson Chandler (hamstring) missed his sixth straight game to start the season. . Embiid has a double-double in every game this season. . According to Elias, Embiid is one of seven players with 2,000 points, 1,000 rebounds and 200 blocks in his first 100 games, joining Tim Duncan, Shaquille O'Neal, Alonzo Mourning, David Robinson, Hakeem Olajuwon and Ralph Sampson.\n\nUP NEXT\n\nHornets: Host Miami on Tuesday.\n\n76ers: Host Atlanta on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994439.5406232
}