{
  "game_id": "0022000908",
  "espn_id": "401307709",
  "date": "Apr 24, 2021",
  "matchup": "LAL @ DAL",
  "headline": "Doncic, Mavs beat Lakers 108-93 in Davis' 2nd game back",
  "body": "DALLAS -- — Luka Doncic was swarmed by double teams with the Lakers trying to force someone other than the Dallas sensation to beat them again in Los Angeles star Anthony Davis' second game back from a long injury absence.\n\n\r\n                    That someone was Dwight Powell. \n\n\r\n                    Doncic had 18 points and 13 assists, four of them helping Powell score 12 of his season-high 25 points in the fourth quarter as the Mavericks overcame a 17-point deficit to beat Los Angeles 108-93 on Saturday night.\n\n\r\n                    The Mavericks swept the two-game home set against the defending NBA champs — and Davis' first two games in nearly 10 weeks — while moving a game ahead of Portland for the all-important sixth seed in the Western Conference. The No. 7 team has to make the playoffs through a play-in format.\n\n\r\n                    Powell, who finished one point off his career high, was 11 of 12 from the field and had a six-point run with the bucket that gave the Mavericks their first lead since the first quarter at 89-87. The Mavericks outscored LA 62-35 in the second half.\n\n\r\n                    Doncic was just 6 of 15 from the field with all that defensive attention and the Mavericks missing the Slovenian star’s European sidekick, Kristaps Porzingis, after the 7-foot-3 Latvian sprained his left ankle in the 115-110 Dallas victory two nights earlier.\n\n\r\n                    The 22-year-old, two-time All-Star had five assists in the fourth quarter and a long step-back 3 that gave Dallas its first 10-point lead at 101-91.\n\n\r\n                    “They were double-teaming me. In Europe I used to do this a lot,” Doncic said. “I know how it goes. But here the floor is wider, so it's kind of easy.”\n\n\r\n                    The Lakers, still without fellow star LeBron James and also missing Kentavious Caldwell-Pope with a right ankle sprain two nights after he led LA with a season-high 29 points in the first loss, dropped the season series with Dallas. LA has lost four of five and is just 1 1/2 games ahead of the Mavericks for fifth place in the Western Conference.\n\n\r\n                    Davis was sluggish again coming off the absence forced by right calf and heel issues, finishing 5 of 19 from the field. The eight-time All-Star’s best stretch came late in the second quarter, when he scored 10 of his 17 points to help the Lakers turn a four-point edge into a 58-46 halftime lead.\n\n\r\n                    But after Davis returned with 8:34 remaining and the Lakers leading by three, they were outscored 28-10 the rest of the way.\n\n\r\n                    “It's going to be a work in progress,” Lakers coach Frank Vogel said. “He's playing with a new teammate (Andre Drummond). He's got to get his legs under him. It's going to be a little disjointed at times. Hopefully it doesn't cost us too many games.”\n\n\r\n                    Vogel expanded the minutes restriction on Davis to 25 from 15, and he ended up playing 28:19, missing all six 3-point attempts and going 7 of 8 on free throws with three rebounds.\n\n\r\n                    “I’m getting to the shots,” Davis said. “Everything’s short. Just a legs thing, a rhythm thing. The good thing about it, they all felt good.” \n\n\r\n                    Dallas was missing another starter after Josh Richardson reported right hamstring tightness during the morning shootaround. The void was filled by Powell, Dorian Finney-Smith (21 points) and JJ Redick, who hit one of his two 3s on an 8-0 run that took less than two minutes.\n\n\r\n                    All five of Powell's fourth-quarter baskets were layups or dunks, with Doncic setting up most of them.\n\n\r\n                    “He's always been great against trapping defenses,” Dallas coach Rick Carlisle said. “I never mind seeing trapping defenses on him because he's so great at delivering the ball.”\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: C Marc Gasol returned after missing three games because of a broken left little finger, scoring a point with seven rebounds in 18 minutes. ... Dennis Schroder had 16 points and 10 assists. Kyle Kuzma scored 14.\n\n\r\n                    Mavericks: Coach Rick Carlisle said the club didn't think the ankle injury was serious for Porzingis, who was out for the 20th time in 59 games. He also has been sidelined by knee and back issues. ... F Maxi Kleber returned after missing a game with a lower back contusion, getting nine points and 10 rebounds. ... Doncic was called for his 14th technical foul in the second quarter. He's two away from a one-game suspension. \n\n\r\n                    SLUMP BUSTER\n\n\r\n                    The Mavericks got even at the end of the third quarter when Tim Hardaway Jr. — 1 of 10 from the field at that point — pulled up for a buzzer-beating 3-pointer and a 79-all tie. He finished 2 of 13.\n\n\r\n                    BIG BEN\n\n\r\n                    Ben McLemore, making his first start in nine games for the Lakers in Caldwell-Pope’s absence, was 4 of 5 from 3 in the first quarter and finished with a team-high 20 points, his most for LA. McLemore was 6 of 10 from deep.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: LA is at Orlando on Monday in the third game of a four-game trip. The Lakers can sweep the two-game season series with a win, but are just 2-8 at Amway Center. \n\n\r\n                    Mavericks: A three-game road trip starts in Sacramento on Monday. It's the first of two meetings in a week, with the Mavericks trying to bounce back from a 121-107 loss to the Kings in Dallas eight days earlier.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997281.918466
}