{
  "game_id": "0021800414",
  "espn_id": "401071095",
  "date": "Dec 12, 2018",
  "matchup": "SAC vs. MIN",
  "headline": "Kings hit 19 3-pointers in 141-130 win against Minnesota",
  "body": "SACRAMENTO, Calif. --  Sacramento coach Dave Joerger wants his team to use its speed to run right past opponents.\n\nWhen the Kings are clicking, it's hard to slow them down.\n\nNemanja Bjelica made four of Sacramento's franchise-record 19 3-pointers and finished with 25 points, helping the Kings beat the Minnesota Timberwolves 141-130 on Wednesday night.\n\nSacramento shot a season-best 58.1 percent (50 for 86) from the field in its fifth win in six games. It also had 33 fast-break points.\n\n\"I think it was probably a pretty exciting game to watch if you're a fan -- we enjoyed it as well,\" Joerger said. \"Ball was moving. We're better when we attack.\"\n\nBuddy Hield and Bogdan Bogdanovic each scored 20 points for Sacramento, and rookie Marvin Bagley III had 17 points and 10 rebounds.\n\nAndrew Wiggins scored 25 points for Minnesota, and reserve Derrick Rose finished with 20. Karl-Anthony Towns had 19 points and 11 rebounds.\n\nThe Timberwolves remained winless in 10 road games against Western Conference opponents. They have just two road wins this season, tied for second-worst in the NBA.\n\n\"We score 130 points -- 80 in the second half -- shoot over 50 percent and lose. The disappointment is in our defense,\" Timberwolves coach Tom Thibodeau said. \"You can't jog back against them. We did that and they got easy baskets.\"\n\nThe athletic Kings had seven players score in double figures. Hield made five 3s, part of a 19-for-38 performance from behind the arc for Sacramento.\n\nThe Kings led 63-50 at halftime, but the Timberwolves opened the third quarter with 11 straight points and 21 of 26 overall. Sacramento then responded with 11 straight points, including consecutive 3-pointers by Iman Shumpert, and never trailed again.\n\nThe Kings opened the fourth quarter with a 16-7 run, including three 3-pointers by Yogi Ferrell, to open a 13-point lead.\n\n\"They ran the floor fast, they never stopped. We just had to make it hard for them and try to take things away from them, but we didn't really do that,\" Wiggins said. \"They made a lot of shots. We could have done better at taking it away from them and forcing them off the line. So it's back to the drawing board.\"\n\nTIP-INS\n\nTimberwolves: Jeff Teague had a team-high 13 assists, but hit just three of his 11 shots. ... The Timberwolves dropped to 0-3 on their four-game trip. They lost 116-108 at Golden State on Monday night. ... The Timberwolves' 57 wins against the Kings remain their most against any NBA rival. ... Minnesota had won nine of its previous 14 games since the Nov. 12 trade that sent Jimmy Butler to Philadelphia.\n\nKings: It was Bagley's fourth double-double of the season. ... Ferrell had 17 points off the bench. ... The Kings also defeated the Timberwolves in Sacramento 121-110 on Nov. 9. The teams meet for the final time this season in Minnesota on Feb. 25.\n\nBIG THIRD\n\nThe Timberwolves' 42 points in the third quarter were their most in that period this season. Rose and Robert Covington each had nine points in the quarter.\n\nSACRAMENTO HISTORY\n\nThe Kings (15-12) topped 140 points twice in their first 27 games, scoring 146 points at Atlanta on Nov. 1. Only two other teams in franchise history accomplished that feat in 27 games -- the 1982-83 Kansas City Royals and the 1960-61 Cincinnati Royals.\n\nUP NEXT\n\nTimberwolves: Visit the Phoenix Suns on Saturday.\n\nKings: Wrap up a two-game homestand by hosting the Golden State Warriors on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994205.9113028
}