{
  "game_id": "0021700572",
  "espn_id": "400975318",
  "date": "Jan 05, 2018",
  "matchup": "DAL vs. CHI",
  "headline": "Dunn gets career-high 32 as Bulls hold off Mavs 127-124",
  "body": "DALLAS --  Kris Dunn, Justin Holiday and the Chicago Bulls kept making free throws in the final minute. Somehow, the Dallas Mavericks kept getting closer.\n\nOnly after Yogi Ferrell's desperation 3-pointer at the buzzer fell short could the Bulls finally celebrate a 47-point fourth quarter Friday night and a frantic 127-124 victory over the Mavericks after leading by 10 with 68 seconds to go.\n\nDunn scored a career-high 32 points and Holiday added 23 for the Bulls, who made all 13 free throws in the final 1:08 but still gave Dallas a chance because the Mavericks had three-point possessions four times while pressing full court and fouling after every bucket.\n\nA turnover helped also as the teams combined for 35 points in that final sequence. The Mavericks allowed a franchise record in points for any quarter.\n\n\"When you have a 10-point lead with about a minute to go, you've got to find a way to get a couple of stops,\" said Bulls coach Fred Hoiberg, whose team started the fourth with a 10-0 run. \"But it's a really good win coming down here against a team that's been really hot, rolling.\"\n\nNobody figured to be saying that about either team a month into the season. But it was a fittingly close game for teams having remarkably similar seasons -- almost the same record after miserable starts followed by respectable recoveries that pulled each out of last in its conference.\n\nThe Bulls (14-25) were 3-20 before a seven-game winning streak that sparked an 11-5 record since the woeful start.\n\nThe Mavericks (13-27), who started 2-14, just had their best winning streak of the season stopped at four by Stephen Curry's 3-pointer in the final seconds of Golden State's 125-122 victory in Dallas. Oh, and the Mavericks were down 12 with 4 1/2 minutes left in that loss.\n\n\"We are falling into some bad habits playing these windshield-wiper games,\" Dallas coach Rick Carlisle said. \"We just need to take a hard look at it.\"\n\nWesley Matthews scored 24 points and Harrison Barnes had 23 for the Mavericks, who were outscored 47-36 in the fourth.\n\nRookie Lauri Markkanen had 16 with an emphatic follow-up dunk during a 16-4 surge that put the Bulls up 114-104 with 1:08 to play. Dunn started that run with a jumper and finished it with his ninth assist for Nikola Mirotic's layup.\n\nThe Mavericks fouled the Bulls eight times in the final minute-plus, hoping the Bulls would miss but they never did. Still, Dallas chipped away.\n\nMatthews hit all three free throws after a foul from behind the arc. Dwight Powell had a three-point play. Dennis Smith Jr. had a steal and dunk along with a pair of 3s, the latter after he missed from long range but hit an even longer shot after an offensive rebound by Barnes to get within 125-124.\n\nAfter a Chicago timeout, Dallas quickly fouled Holiday, who made both free throws with 2.6 seconds left before Ferrell's miss from the left wing after a long inbound pass was relayed to him.\n\nHoliday had eight of the late free throws, and Dunn three. Smith scored 10 of his 15 points in the final 44 seconds.\n\nDirk Nowitzki scored 19 points and was 3 of 3 from long range, including one to give the Mavericks their final lead at 100-98.\n\nTIP-INS\n\nBulls: Hoiberg said G Zach LaVine (left knee) was still on schedule for his possible season debut in about a week. LaVine had a light day of shooting and will get another full workout Saturday. ... Dunn, in his second season, topped his previous best of 24 on Nov. 28 against Phoenix. He had a game-high four steals. ... Mirotic had 11 points and 10 rebounds.\n\nMavericks: Matthews had his second straight 20-point game, matching his previous total for the season. ... J.J. Barea had 11 points and nine assists. ... The previous franchise record for points in a quarter was 46, both times in the fourth. The most recent was Jan. 19, 1996, a 129-124 win at home against Boston.\n\nON TARGET\n\nHoliday (5 of 6) and Dunn (4 of 5) combined to go 9 of 11 from 3-point range as the Bulls shot 50 percent (14 of 28) from beyond the arc. Chicago shot 68 percent in the first quarter and 56 percent for the game. The Mavericks shot 53 percent, the sixth time in eight games they've shot at least 50 percent after doing so just twice before that.\n\nWHAT MIGHT HAVE BEEN\n\nEarly in the frantic final minute, Powell was called for his sixth foul after he won a battle for a loose ball against Denzel Valentine. Powell finished the play with a dunk, and the Mavericks weren't happy with the call. Dallas was down 116-110 at that point. Powell finished with 13 points after matching his career high with 21 against the Warriors.\n\nUP NEXT\n\nBulls: At Indiana on Saturday.\n\nMavericks: Knicks at home Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993952.4437351
}