{
  "game_id": "0021500299",
  "espn_id": "400828186",
  "date": "Dec 06, 2015",
  "matchup": "MEM vs. PHX",
  "headline": "Green's late dunk sends Grizzlies over Suns 95-93",
  "body": "MEMPHIS, Tenn. -- Phoenix coach Jeff Hornacek groaned as Courtney Lee's inbound pass floated toward the rim\nHornacek watched Jeff Green dunk with 0.5 seconds left, helping the Memphis Grizzlies escape with a 95-93 win over the Suns on Sunday.\n\"They just made a play,\" Hornacek said.\nThe Lee-to-Green connection helped Memphis avoid squandering a 93-87 lead with 1:30 remaining, giving the Grizzlies their ninth win in their last 12 games.\n\"We felt like we didn't play great,\" Memphis coach Dave Joerger said. \"Towards the end, we kind of shot ourselves in the foot.\"\nThe Suns' last chance to tie the game came on Eric Bledsoe's 22-footer from the right corner as the horn sounded. The two-point attempt was long, sending Phoenix to its fourth straight loss despite a late rally that pulled the Suns even.\nMarc Gasol led Memphis with 22 points, and Lee scored 13 of his 18 points in the second half to match his season high. Mike Conley had 12 points and Mario Chalmers finished with 11. Green and Zach Randolph scored 10 points apiece.\nBledsoe led the Suns with 23 points and six assists and also had seven rebounds. Brandon Knight scored 17 points and Mirza Teletovic had 14. Alex Len had 12 points, while Jon Leuer finished with 10 points and 11 rebounds.\nPhoenix erased Memphis' six-point lead with 90 seconds left on two baskets inside by Len and another by P. J. Tucker.\nLen tied the game at 93 when he tipped in a missed free throw by Leuer with 11.9 seconds remaining. During the next Grizzlies' possession, Len initially was called for a goaltend on Conley's drive with 2.1 seconds left -- a play reviewed by officials and overturned to keep the game tied.\nOn the ensuing inbound play, Knight fumbled the pass out of bounds, giving the ball back to the Grizzlies with 0.8 seconds left.\nLee, inbounding from the left sideline, lobbed the ball to Green, covered by Tucker but curling to the right side of the basket for the winning field goal.\n\"I told (Jeff) I was going to throw it to him if I saw P.J. Tucker's numbers,\" Lee said. \"He went up and made the play.\"\n---\nTIP-INS:\nSuns: Tyson Chandler missed his fifth straight game with a right hamstring injury. ... Leuer played more than two seasons with the Grizzlies and was given a nice ovation when he was introduced in the Phoenix starting lineup. ... The Suns entered the game with the third-best percentage from 3-point range but made only one of their first 13 shots from outside the arc. They finished 9 of 31. ... Phoenix will wrap up a six-game trip Monday in Chicago. The journey carried them 5,770 miles.\nGrizzlies: Memphis has won eight straight in the series. ... Memphis is now 11-1 when leading at the half. ... Matt Barnes and Len were assessed double technicals in the third when they got tied up together. ... Lee had a season-best six assists, including the game-winner.\nSUNS DROUGHT: After building an early 10-point lead, Phoenix went more than 6 minutes without scoring. Memphis outscored the Suns 18-4 the rest of the first quarter.\nCLOSE FOR THE SUNS: During the four-game losing streak, the Suns have lost by three, five, three and two points. \"There's no way that game doesn't go into overtime, at least,\" Tucker said. \"But the fate of the Suns right now is crazy.\"\nANATOMY OF A WINNING PLAY: On the winning basket, Green came out of the left corner across the middle. Conley brushed Tucker -- who was chasing Green -- enough to slow him up, and Leuer wasn't able to get to the basket in time to contest Green's dunk on the lob from Lee. \"(The play) got morphed between (former Memphis coach) Lionel Hollins and (former assistant) Johnny Davis. Then I tweaked it a little bit,\" Joerger said.\nUP NEXT\nSuns: Travel to Chicago Bulls on Monday night.\nGrizzlies: Host Oklahoma City Thunder on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994465.1641312
}