{
  "game_id": "0022401116",
  "espn_id": "401705682",
  "date": "Apr 03, 2025",
  "matchup": "TOR vs. POR",
  "headline": "Shaedon Sharpe scores 36 as Trail Blazers keep postseason hope alive with a 112-103 win over Raptors",
  "body": "TORONTO -- — Shaedon Sharpe scored 36 points to lead the Portland Trail Blazers past the Toronto Raptors 112-103 on Thursday night.\n\n\r\n              Sharpe, from London, Ontario, was in an all-Canadian backcourt with Toronto’s Dalano Banton as Portland (34-43) won back-to-back games to keep its Western Conference postseason hopes alive. Sharpe added six rebounds and five assists. Banton added 23 points.\n\n\r\n              Deni Avdija finished with 26 points and 15 rebounds for Trail Blazers, who trail idle Sacramento, which holds the final play-in spot in 10th place.\n\n\r\n              RJ Barrett, of Mississauga, Ontario, had 18 points, five rebounds and four assists for Toronto (28-49). Orlando Robinson added 14 points. Ochai Agbaji finished with 15 points and A.J. Lawson, of Brampton, Ontario, 13 off the bench.\n\n\r\n              Takeaways\r\n              Trail Blazers: Sharpe was dominant in the first half, scoring 11 points in the first quarter and nine in the second. He didn’t slow down in the third either, adding seven more points in the first five minutes of the period.\n\n\r\n              Raptors: Because Toronto’s looking at a lottery pick, head coach Darko Rajakovic leaned on his depth with an eye to developing young players for next season. As a result, the Raptors reserves outscored Portland’s 47-14, but the Trail Blazers ran a shorter bench to seal the win.\n\n\r\n              Key moment\r\n              A driving Sharpe layup with 5.4 seconds left in the third quarter capped a 17-8 Trail Blazers run to close the final 4:26 of the period. That gave Portland a seven-point lead that held throughout the fourth.\n\n\r\n              Key stat\r\n              Trail Blazers head coach Chauncey Billups spoke pre-game about the pros and cons of crashing the boards for offensive rebounds. Portland won that battle on Thursday, getting 22 second-chance points to Toronto’s 11.\n\n\r\n              Up next\r\n              Both teams play Friday. Portland closes out a five-game trip at Chicago, while Toronto hosts Detroit.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997605.456844
}