{
  "game_id": "0022300216",
  "espn_id": "401584844",
  "date": "Nov 19, 2023",
  "matchup": "HOU @ LAL",
  "headline": "James scores season-high 37, hits go-ahead free throw as Lakers hold off Rockets 105-104",
  "body": "LOS ANGELES -- — Going into Sunday night's game, LeBron James wasn't motivated alone by Dillon Brooks' slights against him.\n\n\r\n              The Los Angeles Lakers superstar took to Instagram on Saturday night and wrote under a graphic showing he had 108 games with at least 30 points since coming to Los Angeles in 2018 “But I just came here to make movies though! Ain't that what y'all said right !?!?”\n\n\r\n              That graphic needs to be updated.\n\n\r\n              James scored a season-high 37 points, including the go-ahead free throw with 1.9 seconds remaining, as the Lakers held off the Houston Rockets 105-104 on Sunday night.\n\n\r\n              It was James’ fifth 30-point game this season and his fourth in his last seven.\n\n\r\n              “Sometimes you need to remind people. So that’s what it was,” James said about the graphic.\n\n\r\n              Alperen Sengun's layup tied it with four seconds remaining when the Lakers called timeout. Austin Reaves passed it into James, who was fouled by Tari Eason as he drove inside. James missed the first free throw, but made the second.\n\n\r\n              Houston, which did not have a timeout left, got the ball to midcourt, but Brooks' 3-point attempt was offline.\n\n\r\n              “I liked how we battled back and kept fighting. We just didn't play smart at the end,” Rockets coach Ime Udoka said.\n\n\r\n              James scored 13 points in the fourth quarter and gave the Lakers their fifth win in the last six games.\n\n\r\n              Earlier in the game, the NBA's All-Time leading scorer became the fourth player in league history with at least 10,500 assists (he finished with eight and is at 10,504). He also tied Vince Carter for seventh on the 3-pointers list with 2,290, and moved past Clyde Drexler for eighth on the steals list at 2,208.\n\n\r\n              “That's the LeBron we’ve all come to know and love over these 21 years,” Lakers coach Darvin Ham said.\n\n\r\n              James and Brooks, who have had a nice rivalry going since last season's playoff series between the Lakers and Memphis Grizzlies, put on another entertaining show.\n\n\r\n              James picked up a technical for shoving Brooks early in the third quarter but then made a “too small” gesture on the court after he scored over Brooks late in the quarter.\n\n\r\n              “He's a great competitor. I like going against him. And he was hooping tonight for sure. He shot the ball exceptionally well and kept them in the game,” James said.\n\n\r\n              Anthony Davis added 27 points and 10 rebounds, but fouled out with 58 seconds remaining. Reaves came off the bench and had 17 points.\n\n\r\n              Brooks led the Rockets with 24 points, including a season-high six 3-pointers, and Sengun had 23. Houston has dropped two straight after five straight wins.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Golden State on Monday night.\n\n\r\n              Lakers: Host Utah on Tuesday in the In-Season Tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995637.013598
}