{
  "game_id": "0022200331",
  "espn_id": "401468486",
  "date": "Dec 02, 2022",
  "matchup": "MIL vs. LAL",
  "headline": "Davis scores 44, LeBron passes Magic as Lakers beat Bucks",
  "body": "MILWAUKEE -- — Anthony Davis and LeBron James tore apart the NBA's top-rated defense and gave Los Angeles Lakers coach Darvin Ham a triumphant return to Milwaukee.\n\n\r\n              Davis scored a season-high 44 points and James passed Magic Johnson on the NBA’s career assists list Friday night in the Lakers' thrilling 133-129 victory over the Bucks. \n\n\r\n              It marked Ham's first game in Milwaukee since taking over as Lakers coach after working as an assistant on Bucks coach Mike Budenholzer's staff from 2018-22.\n\n\r\n              Ham and Budenholzer shared a big hug before the game.\n\n\r\n              “It was a beautiful night,\" said Ham, who also played for the Bucks from 1999-2002.\n\n\r\n              It also was quite a night for Davis, a Green Bay Packers fan who delivered his big performance with Aaron Rodgers in the stands. Davis spoke with the Packers' four-time MVP quarterback before and after the game.\n\n\r\n              “I saw him before the game and he said, ‘I need 30 tonight,'” Davis said. \"I just saw him and he said, ‘I only said 30, not 40.’ It’s always good for him to come out and watch the Lakers play.”\n\n\r\n              James made a tiebreaking 3-pointer with 3:22 left and finished with 28 points, 11 assists and eight rebounds. He upped his career assist total to 10,144 and moved into sixth place, ahead of Johnson’s 10,133.\n\n\r\n              “It means a lot, obviously,” James said. “The way Magic approached the game, it was very infectious. His teammates loved playing with him because of the joy he played with and the ability to pass the ball and get other guys involved. He was always excited about seeing his teammates be great. I always admired that in him. What’s even more humbling and super duper cool is the fact that I’m doing it in a Laker uniform and knowing how much Magic means to the Laker franchise.”\n\n\r\n              The Lakers had the highest point total and field-goal percentage (.536) the Bucks had allowed all season. Milwaukee entered Friday with the NBA's top defensive rating.\n\n\r\n              “It was too easy, too easy, too easy,” Milwaukee's Giannis Antetokounmpo said. “They were living in the paint. That's not who we are.”\n\n\r\n              Los Angeles withstood a 40-point performance from Antetokounmpo, who also had seven rebounds and five assists.\n\n\r\n              The Lakers also spoiled the 2022-23 debut of Milwaukee’s Khris Middleton, who had 17 points and seven assists in his return from offseason wrist surgery.\n\n\r\n              Milwaukee missed two potential tying 3-pointers in the final 20 seconds.\n\n\r\n              After Davis missed a fadeaway jumper, the Bucks called a timeout with 21.4 seconds left and then found an open Grayson Allen, whose 3-point attempt went off the side of the rim. \n\n\r\n              The Lakers’ Russell Westbrook missed two free throws with 13.3 seconds remaining, but Jrue Holiday couldn’t connect on a 3-pointer with just over five seconds left. Davis made a clinching free throw with 4.5 seconds left.\n\n\r\n              “Grayson got a good look,” Budenholzer said. “Good execution. Good screening. We'll live with that shot all the time. And Jrue, similar. We got the kick ahead, playing against a defense that's not set. Jrue, kind of a good rhythm shot for him. It was contested, but Jrue was 6 of 12 tonight (from 3-point range). He was feeling it.”\n\n\r\n              Holiday had 28 points for the Bucks, and Bobby Portis added 15 points and 10 rebounds. Westbrook had 15 points, 11 assists and seven rebounds for the Lakers.\n\n\r\n              WESTBROOK'S BUSY NIGHT\n\n\r\n              Westbrook exchanged words with a fan early in the game and indicated afterward he’d approach the league office about it. Westbrook didn’t specify what the fan said to him.\n\n\r\n              “I don’t mind you coming to the game and heckling and doing certain things, but there’s a certain line you don’t cross,” Westbrook said. “I feel like he crossed it.” \n\n\r\n              Westbrook also got called for a lane violation on a foul shot by Antetokounmpo early in the game. Westbrook appeared to start counting the number of seconds Antetokounmpo took before his next free throw.\n\n\r\n              Antetokounmpo got called for a 10-second violation on a free throw later in the game.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Davis also had 10 rebounds. He's collected at least 20 points and 10 rebounds in nine straight games. ... The Lakers opened a six-game trip. ... James played his 1,381st career regular-season game to move into sole possession of 13th place. He had been tied with Clifford Robinson. \n\n\r\n              Bucks: Antetokounnmpo has scored at least 30 points in six straight games. ... Portis had his 13th double-double. He entered Friday one of 12 NBA players averaging a double-double. Portis was the only one who isn’t a consistent starter.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Washington on Sunday.\n\n\r\n              Bucks: At Charlotte on Saturday in their first matchup of the season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994592.7468622
}