{
  "game_id": "0022300165",
  "espn_id": "401584793",
  "date": "Nov 08, 2023",
  "matchup": "DET @ MIL",
  "headline": "Damian Lillard scores 34 points as the Bucks beat Pistons 120-118; Giannis ejected in 3rd period",
  "body": "MILWAUKEE -- — Damian Lillard scored 34 points and Bobby Portis added 18 as Milwaukee rallied to beat the Detroit Pistons 120-118 on Wednesday night in a game in which Bucks star Giannis Antetokounmpo was ejected midway through the third quarter.\n\n\r\n              “It’s another huge night as far as finding a way to win,” Bucks coach Adrian Griffin said. “I thought it was a gusty victory. A lot of guys stepped up.”\n\n\r\n              Antetokounmpo was ejected with nine minutes left after picking up his second technical foul for apparently taunting a defender after scoring on a dunk.\n\n\r\n              Antetokounmpo had 15 points on 6-of-16 shooting and a team-leading nine rebounds in 22 minutes when he was ejected.\n\n\r\n              “It’s an emotional game. He made a phenomenal play,” Griffin said. “It was exciting, emotional and I thought he moved on fairly quickly. So, I was surprised with the second technical, but that’s up to the league to decide.”\n\n\r\n              Cade Cunningham scored 33 points and Marcus Sasser 26 for the Pistons, who were missing six players due to illness and injury.\n\n\r\n              Detroit, which led by 10 points midway through the fourth quarter, held a 115-112 lead after two free throws by Cunningham with 1:39 remaining.\n\n\r\n              Lillard scored on a drive and added a jumper from the lane to put the Bucks up 116-115.\n\n\r\n              Brook Lopez hit a 3-pointer to increase Milwaukee’s lead to 119-115 before Cunningham netted a 3 to cut the Pistons’ deficit to 119-118. The Bucks missed on their next possession, but the Pistons turned the ball over with nine seconds left.\n\n\r\n              “That was the shot of the night,” Lillard said of Lopez’s 3-pointer. “Just having a guy who can protect the paint the way, knowing that you’re funneling guys to him. But also knowing that he’s that type of threat from three. I had all the confidence in the world when he shot it and it was big-time shot.”\n\n\r\n              Jae Crowder hit the second of two free throws with 3.9 seconds remaining to make it 120-118.\n\n\r\n              The Bucks led 73-60 when Antetokounmpo was ejected. Detroit rallied for a 95-90 lead after three quarters.\n\n\r\n              Sasser converted a three-point play that put the Pistons up 109-99 with just over seven minutes remaining.\n\n\r\n              “The third quarter was the kind of basketball that we’ve been talking about playing,” Pistons coach Monty Williams said. “Now, our guys have to turn the page on this. It’s an NBA skill to lose a game like this and have the ability to bounce back and have that kind of effort in our next outing.”\n\n\r\n              Portis scored 13 points to fuel a 16-2 run that put the Bucks up 42-27 with 8:17 left in the first half.\n\n\r\n              The Bucks got 26 points from their bench in the first half on the way to a 62-52 lead at the break.\n\n\r\n              Milwaukee was without Khris Middleton, held out of the first game of a back-to-back for right knee injury management.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Philadelphia 76ers on Friday.\n\n\r\n              Bucks: At Indiana Pacers on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995795.032052
}