{
  "game_id": "0022300373",
  "espn_id": "401585001",
  "date": "Dec 20, 2023",
  "matchup": "SAC vs. BOS",
  "headline": "Celtics bounce back from a tough loss to beat Kings 144-119",
  "body": "SACRAMENTO, Calif. -- — Jaylen Brown and Derrick White each scored 28 points and the short-handed Boston Celtics bounced back from a disappointing loss at Golden State with a 144-119 victory over the Sacramento Kings on Wednesday night.\n\n\r\n              Boston blew a 17-point lead before losing to the Warriors in overtime Tuesday night and played without leading scorer Jayson Tatum (ankle) and big man Al Horford (rest) against the rested Kings.\n\n\r\n              But the Celtics looked like the far fresher team and rolled to their sixth win in seven games. \n\n\r\n              “It’s a long year. You have to have the proper perspective,” coach Joe Mazzulla said. “Of course, we’re not going to be happy if we lose. The great thing about playing 82 games is you get a chance to shake it off the next day.”\n\n\r\n              Kristaps Porzingis, who missed the game against Golden State because of a calf injury, dominated the interior for Boston with 24 points, nine rebounds and six blocked shots. \n\n\r\n              The shooters led by White did the rest as the Celtics made 22 of 42 3-pointers after missing 41 of 58 attempts from long range in the loss to the Warriors. \n\n\r\n              “We had great shooters missing wide-open looks,\" White said. “You just have to trust that if you continue to get looks people will knock them down. We were able to make them today like we weren't yesterday. That's just the name of the game.”\n\n\r\n              De'Aaron Fox scored 29 points on his 26th birthday to lead the Kings, who had won three straight games. \n\n\r\n              The teams got off to a fast-shooting start with the Kings making 11 3-pointers in the first quarter and the Celtics answering with eight to tie for the most combined 3s ever in a quarter with a Mavericks-Warriors game from 2019. Sacramento led 41-38 after one. \n\n\r\n              But as the 3s stopped falling for the Kings, the Celtics started to take control. They made six more 3s in the second quarter as the 28 combined first-half 3s also tied the NBA record for a half set in that 2019 game. \n\n\r\n              Sacramento made only 10 3s in the final three quarters after making 11 in the first.\n\n\r\n              “We just kind of made an adjustment, just being there on the catch,” White said. “They play fast. They got a lot of talented players. We stepped up to the challenge.” \n\n\r\n              Boston opened up a 21-point lead in the third quarter when White and Jrue Holiday hit back-to-back 3s around a blocked shot by Porzingis. \n\n\r\n              Brown's dunk over Trey Lyles expanded the lead to 28 points late in the third for Boston. The Celtics coasted from there to their fifth straight win over the Kings. \n\n\r\n              “That was a good old fashion butt kicking,” Kings coach Mike Brown said. \"Give the Celtics a lot credit especially coming off a back-to-back. They for sure didn’t look like the team that was waiting on us here.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Los Angeles Clippers on Saturday.\n\n\r\n              Kings: Host Phoenix on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996798.539639
}