{
  "game_id": "0021500213",
  "espn_id": "400828100",
  "date": "Nov 24, 2015",
  "matchup": "CHI @ POR",
  "headline": "Butler scores 22, Bulls beat Blazers in Rose's return",
  "body": "PORTLAND, Ore. -- This visit to Portland ended on a much happier note for Derrick Rose than the last.\nRose returned after missing two games with a sprained left ankle and scored 17 points in the Chicago Bulls' 93-88 victory over the Trail Blazers on Tuesday night.\nRose hadn't played in Portland since he tore the meniscus in his right knee against the Blazers in November 2013, ending his season. The disappointing injury came after he missed the entire previous season because of surgery on his left knee.\n\n\"I'm just happy I got off the court,\" Rose joked afterward. \"I think we played an all-right game. We won so that's the only thing that matters.\"\nJimmy Butler had 22 points for the Bulls, who have won five of their last six. Butler's highlight came at the end of the first half, when he hit a half-court buzzer beater that put Chicago in front 48-39.\nBut the Blazers didn't make it easy.\nRose's floating jumper stretched Chicago's lead to 78-65 early in the fourth quarter, but Portland rallied within 78-76 on Ed Davis' tip shot.\nDamian Lillard missed a 3-pointer to tie it for Portland with 2:25 left, then missed the second of a pair of free throws with 20.7 seconds left that would have also pulled the Blazers into a tie.\nCJ McCollum's quick layup got Portland within 89-88 with 13 seconds to go. But after Butler made a pair of free throws, McCollum missed on a 3-point attempt and Taj Gibson hit free throws for the final margin.\nLillard finished with 19 points, 10 rebounds and eight assists, but shot 4 of 22 from the field. McCollum added 18 points.\n\"I thought I got a lot of good looks at the rim, the shots just didn't go in,\" Lillard said. \"I was more disappointed with the free throw that kind of just went halfway down the basket and came out.\"\nThe Blazers had won two straight after a seven-game losing streak, including a 107-93 victory on the road against the Los Angeles Lakers on Sunday. Still without Meyers Leonard because of a dislocated left shoulder, the Blazers started Noah Vonleh to go against Nikola Mirotic.\nIt was also the Bulls' first win in Portland since 2007. Rose missed last year's game in Portland because of a hamstring injury.\nGoing into Tuesday night's game, Rose said his minutes wouldn't be restricted because of the ankle injury. His return came at an opportune time for the Bulls, who were without Aaron Brooks for the second game because of a sore hamstring.\n\"I felt all right. There were some plays where I had no lift on my shot as far as like driving the ball, but that's going to come the more I play and the stronger it gets,\" said Rose, who logged nearly 35 minutes.\nThe Bulls pulled ahead 39-29 midway through the second quarter on Gibson's 14-foot jumper. Portland pulled within six points before the break, but Butler's 47-footer extended Chicago's lead just before they left the court.\nPortland opened the second half with a 7-0 run and pulled within 48-46 on Vonleh's 3-pointer followed by a layup. But the rally was short-lived and Butler's reverse layup put the Bulls ahead 62-52.\nThe game got chippy in the final minutes when Butler and Mason Plumlee got into it. In the aftermath, Plumlee was served with a flagrant foul, and Butler got a technical. After the game, Plumlee said he deserved the tech for hitting Butler hard through the screen.\nPau Gasol had 12 points and 14 rebounds for the Bulls.\nTIP INS\nBulls: Chicago was coming off a 106-94 loss at Golden State on Friday. The game against the Blazers ended a three-game western road swing. ... Chicago hadn't won at the Moda Center since 2007.\nTrail Blazers: Portland Timbers midfielder Jack Jewsbury was at the game. The Timbers are currently in Major League Soccer's Western Conference finals. Portland defeated FC Dallas 3-1 this past Sunday, and the two-legged playoff series goes to Dallas this weekend.\nDUNLEAVY'S VISIT\nMike Dunleavy continues to make progress but he's still out of the Bulls' lineup after back surgery this fall.\nBut while out he was inducted to Jesuit High School's Hall of Fame. He was in the class of 1999.\nUP NEXT\nBulls: Host Indiana on Friday.\nTrail Blazers: Host the Lakers on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993970.364633
}