{
  "game_id": "0021901301",
  "espn_id": "401224776",
  "date": "Aug 11, 2020",
  "matchup": "MEM vs. BOS",
  "headline": "Celtics keep Grizzlies from clinching spot in play-in series",
  "body": "LAKE BUENA VISTA --  Jayson Tatum scored 29 points and the Boston Celtics ran past Memphis 122-107 on Tuesday, putting the Grizzlies in further danger of missing the playoffs.\n\nThe Grizzlies missed another chance to guarantee themselves a spot in the Western Conference play-in series, and fell out of eighth place after Portland beat Dallas later Tuesday.\n\nBoston (48-23), which has already locked up the Eastern Conference's third seed, won its fourth straight.\n\nGordon Hayward and Kemba Walker each added 19 points. The Celtics assisted on 29 of their 44 made baskets.\n\nWalker said they are in a good place with the playoffs about a week away.\n\n\"I think we're pretty close to being ready, especially after tonight,\" he said. \"We've definitely come a long way. We're jelling really well. We're having fun. Competing at a very high level. I think we're feeling pretty good right now.\"\n\nCoach Brad Stevens agreed that the trajectory is good.\n\n\"Hopefully we can just keep getting better,\" he said. \"The way the ball has been moving has been good. The way guys are covering for one another. But we know that we've got less than a week before we open a playoff series. So all of it better be getting good.\"\n\nMemphis (33-39) lost for the sixth time in seven games since the restart. Ja Morant finished with 26 points and 13 assists. He also attempted a career-high 15 free throws. His previous high was 11. Jonas Valanciunas finished with 14 point and 10 rebounds.\n\nThe Grizzlies arrived in Florida with 3 1/2-game cushion over their nearest competitor for the eighth seed in the West. But their struggles have guaranteed the need for a play-in game for that final spot with Portland, San Antonio and Phoenix all still in contention.\n\nMemphis will head into its final seeding game against Milwaukee on Thursday needing a win to earn a place in the play-in game. The team that finishes ninth would have to beat the eighth-place team twice.\n\nMorant said their attitude remains the same as when the season restarted.\n\n\"I feel like every game we play it's the underdog,\" he said. \"We were projected to be 27th this year and we here. So that's how we've been attacking every game. I feel like our next game won't be no different.\"\n\nBoston didn't look like a team coasting into the postseason. Stevens played his regular starters and they were active on both ends of the floor\n\nTatum paced the offensive attack, scoring 17 points in just 15 minutes of action in the first half.\n\nTied at 13 in the first quarter, the Celtics went a 33-11 run and led by as many as 22 in the second quarter.\n\nBoston held the Grizzlies to 33% (17 of 51) shooting in the half, including 1 of 13 (7.7%) from the 3-point line.\n\nTIP-INS\n\nCeltics: Closed first quarter on 11-4 run. Shot 51% from the field (44 of 86) for the game.\n\nGrizzlies: Finished 24% (7 of 29) from beyond the arc.\n\nUP NEXT\n\nCeltics: Play Wizards on Thursday.\n\nGrizzlies: Play Bucks on Thursday\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995672.2286599
}