{
  "game_id": "0022200515",
  "espn_id": "401468670",
  "date": "Dec 28, 2022",
  "matchup": "ORL @ DET",
  "headline": "Three players ejected as Pistons-Magic scuffle in first half",
  "body": "DETROIT -- — Orlando’s Moritz Wagner appeared to briefly get knocked out by a punch to the back of the head after starting a fight in the first half against the Pistons that led to three ejections Wednesday night in a scene that triggered memories of an ugly brawl in Detroit 18 years ago.\n\n\r\n              Wagner was ejected for a flagrant foul, while Detroit’s Killian Hayes and Hamadou Diallo were thrown out for their actions during the ensuing scuffle in front of the Pistons bench. \n\n\r\n              With 34 seconds left in the first half, Wagner and Hayes chased an errant Magic pass into the backcourt. Wagner knew Orlando would be called for a backcourt violation as soon as he touched it, and as he slowed up to let it go out of bounds, Hayes tried to cut past him along the sideline.\n\n\r\n              Wagner hip-checked Hayes into the Detroit bench. starting a scuffle that involved every player on both teams. \n\n\r\n              Hayes got back up and swung his right arm and struck Wagner, who slumped over and appeared to be unconscious.\n\n\r\n              “He’s fine,” said Franz Wagner, Moritz’s younger brother. “I haven’t seen the video, but I know that’s the last thing he wanted to do.”\n\n\r\n              In 2004, a fight between the Pistons and Indiana Pacers became forever known as “The Malice at the Palace” after fans became involved in the wild melee.\n\n\r\n              Numerous Magic players could be facing suspension for leaving the bench area during an altercation. Franz Wagner, Cole Anthony, Wendell Carter Jr, Gary Harris, Mo Bamba, R.J. Hampton, Terrence Ross and Admiral Schofield were the players out of the game as the Orlando bench emptied.\n\n\r\n              “I need an explanation about the decision because my understanding is you can’t leave the bench area and escalate a situation,” Pistons coach Dwane Casey said. “That’s when really bad things can happen.”\n\n\r\n              Franz Wagner said the Magic players didn't feel they had a choice. \n\n\r\n              “We’re aware of the rule, but things like that usually happen on the court, not on one of the benches,” he said. “Your worry is that your teammate is down there amongst the whole other team.”\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994637.028571
}