{
  "game_id": "0022000398",
  "espn_id": "401267558",
  "date": "Feb 11, 2021",
  "matchup": "TOR @ BOS",
  "headline": "Ojeleye scores career-high 24, Celtics down Raptors 120-106",
  "body": "BOSTON -- — The Celtics didn’t play the way they wanted to on either end of the floor during their recent West Coast trip.\n\n\r\n                    Back at home, they got sparks from two unlikely sources to tame one of the league’s hottest teams.\n\n\r\n                    Semi Ojeleye had a career-high 24 points and six 3-pointers, and the Boston Celtics rolled to a 120-106 win over the Toronto Raptors on Thursday night.\n\n\r\n                    Rookie Payton Pritchard added 20 points and had a career-high six 3s to help Boston snap a two-game skid.\n\n\r\n                    The Celtics never trailed and led by as many as 19, thanks in part to a season-high 20 3-pointers.\n\n\r\n                    Ojeleye said he feels like he’s playing a lot freer offensively this season.\n\n\r\n                    “I really try to focus on the process on the shooting and not the result,” OJeleye said.\n\n\r\n                    Leading scorers Jayson Tatum and Jaylen Brown deferred to their teammates from the outset as they drew attention from Toronto's defenders.\n\n\r\n                    “(They're) able to impact the game whether they’re scoring or not,” Ojeleye said. “They took everybody with them.”\n\n\r\n                    Kyle Lowry led the Raptors with 24 points and six assists. Pascal Siakam finished with 23 points for Toronto, which was coming off a win at Washington a night earlier.\n\n\r\n                    Toronto cut what had been a 15-point deficit to 98-93 with 6:21 remaining. But the Celtics used a 15-5 run to take control down the stretch.\n\n\r\n                    The Raptors played without OG Anunoby (left calf strain) for the ninth straight game but still managed to dominate in the paint, where they outscored the Celtics 58-32.\n\n\r\n                    But Boston’s second unit was strong throughout and, led by Pritchard, outscored its bench counterparts 38-31.\n\n\r\n                    As well as Boston played on the offensive end, it also did a good job defensively, holding the Raptors without a second-chance point.\n\n\r\n                    The Celtics had assists on 30 of their 39 field goals.\n\n\r\n                    “If we can play this way and we can just continue to share and build some habits. … I think that will help us,” coach Brad Stevens said.\n\n\r\n                    In Toronto's prior loss, last week at Atlanta, the Raptors also allowed their opponent to shoot more than 50% from 3-point range. The Raptors finished their trip at 4-2 but missed out on a chance to get back to .500 following a 2-8 start to the season.\n\n\r\n                    “I feel pretty good. Trending upward, playing really good basketball,” coach Nick Nurse said. “We weathered some storms and came back. … We’ve got a lot of room for improvement. We’ve got some time to get better.”\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Yuka Watanabe (left ankle sprain) sat for the second consecutive night. Nurse said he anticipates both Anunoby and Watanabe returning Sunday against Detroit.\n\n\r\n                    Celtics: Ojeleye and Pritchard are the first pair in Celtics franchise history to make at least six 3-pointers in the same game. ... Marcus Smart missed his sixth straight game with a left calf tear.\n\n\r\n                    EARLY ACTION\n\n\r\n                    Toronto cut an early 11-point deficit to a point early in the second quarter but struggled to keep pace with Boston’s 3-point shooting. The Celtics connected on 12 of 20 attempts from beyond the arc in the half.\n\n\r\n                    Tatum and Brown combined for just two points in the first quarter. They remained active in the offense, though, assisting on eight of Boston’s 12 field goals in the period. That helped the Celtics sprint out to a 15-4 lead and take a 34-29 edge into the second quarter.\n\n\r\n                    ELITE COMPANY\n\n\r\n                    Pritchard is the third Celtics player since the 2000-2001 season to produce at least 20 points, six 3-pointers and five rebounds off the bench.\n\n\r\n                    He’s the first Celtics reserve to accomplish that feat since Rasheed Wallace (Nov. 11, 2009).\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Host Minnesota on Sunday in Tampa, Florida, where Toronto will play its home games for the rest of the season.\n\n\r\n                    Celtics: Host Detroit on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996868.956393
}