{
  "game_id": "0022201026",
  "espn_id": "401469181",
  "date": "Mar 13, 2023",
  "matchup": "MIL @ SAC",
  "headline": "Giannis has 46 points, 12 boards as Bucks beat Kings 133-124",
  "body": "SACRAMENTO, Calif. -- — Giannis Antetokounmpo had 46 points and 12 rebounds as the Milwaukee Bucks beat the Sacramento Kings 133-124 on Monday night.\n\n\r\n              Khris Middleton scored 31 points and Brook Lopez added 23 for the Bucks, who are on the verge of becoming the first team to clinch a playoff berth this season. They came in needing a win and a Miami loss, but the Heat beat Utah. \n\n\r\n              “It was a really fun environment to play in,” Lopez said. \"Sacramento always has great fans, great team this year. You get the cowbells and everything like that and all stuff I remember. It was a really fun atmosphere.”\n\n\r\n              Domantas Sabonis had 23 points, 17 rebounds and 15 assists for his 10th triple-double of the season for Sacramento. Sabonis has a franchise-record 54 double-doubles, which leads the NBA. \n\n\r\n              “Their team is very good for us to take our foot off the accelerator,” Sabonis said. \"That’s what we did in the second half, unacceptable.”\n\n\r\n              De'Aaron Fox scored 35 points to lead the Kings, and Kevin Huerter had 17 of his 28 in the fourth quarter. \n\n\r\n              The Bucks scored six straight points on a 3-pointer by Brook Lopez and three free throws by Middleton to take a 106-100 lead with under eight minutes remaining in the fourth quarter. Sacramento scored the next eight points and took a two-point lead on Huerter's 3 midway through the quarter.\n\n\r\n              Antetokounmpo made two free throws to cap a 7-0 run that put Milwaukee up 113-108 with five minutes to go, and the Kings got no closer than two points the rest of the way. Another 7-0 burst push the lead to 127-116 with two minutes left.\n\n\r\n              “It’s unfortunate,” Bucks coach Mike Budenholzer said. “I think it was a great game. I was so impressed by Sacramento and they way they play. I’m not going to say anything about what did or didn’t happen.”\n\n\r\n              FIGHT\n\n\r\n              With 15.4 seconds left, Sacramento's Trey Lyles and Lopez got into an altercation, which led to the ejection of both players.\n\n\r\n              “I don’t know what happened, but we ain’t taking (nothing) from nobody,\" Kings coach Mike Brown said. \"Trust me on that. And they’re all going to have each other’s backs in there.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: F Joe Ingles was ruled out with knee injury management. ... Middleton received a technical foul with 9:20 left in the 4th quarter.\n\n\r\n              Kings: Sacramento received its second delay of game warning with 10:09 left in the third quarter, resulting in a technical foul.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Phoenix to face the Suns on Tuesday night.\n\n\r\n              Kings: At Chicago to face the Bulls on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA and https://www.twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994557.987651
}