{
  "game_id": "0021900772",
  "espn_id": "401161414",
  "date": "Feb 07, 2020",
  "matchup": "TOR @ IND",
  "headline": "Raptors pull away from Pacers 115-106 for 13th straight win",
  "body": "INDIANAPOLIS --  Toronto coach Nick Nurse keeps imploring the defending NBA champions to fix their flaws.\n\nThe bigger challenge, right now, might be identifying those errors.\n\nTwo days after rallying from a 19-point deficit to extend their franchise-record winning streak, the short-handed Raptors used another late charge to pull away from Indiana 115-106 on Friday night for their 13th consecutive victory.\n\n\"I thought we were into it the whole 48 minutes,\" Nurse said. \"I thought we were playing well enough to maybe get away. You know how those games come down to somebody hits a couple at one end, somebody misses a couple at the other and all of a sudden the game's over.\"\n\nLately, the Raptors seem to have had all the answers.\n\nThey've won without Marc Gasol and Norman Powell, two key players who are injured. They won Wednesday when it looked as though they didn't have a chance. And this time, they delivered the decisive final flurry without six-time All-Star Kyle Lowry.\n\nLowry missed the final 14 1/2 minutes with what Nurse described as a whiplash injury.\n\nAnd yet, the Raptors still managed to beat the Pacers for the second time in three days, win their first game in Indianapolis in 13 months and head home with their 10th consecutive road victory.\n\n\"We just won the previous game when they were up, just like this,\" Terence Davis II said after scoring 17. \"We didn't want to make the same mistake.\"\n\nInstead, Serge Ibaka scored 22 points and grabbed 10 rebounds to help the Raptors keep their perfect mark intact for at least one more day. Fred VanVleet added 20 points and seven assists for Toronto, which hasn't lost since Jan. 15.\n\nFor the Pacers, it was another excruciating loss.\n\nDomantas Sabonis finished with 19 points and 16 rebounds to lead the Pacers, and Victor Oladipo added 15 points and four assists in his first home start since returning from an injured right knee.\n\nIndiana has lost a season-high four in a row, three of those coming on their home court.\n\n\"Once again, they just killed us in transition with 27 fast-break points,\" coach Nate McMillan said. \"We've just got to do a better job taking care of the ball, a better job executing our offense and really playing both sides of the basketball.\"\n\nToronto finally broke it open late in the third quarter when they turned a 12-3 run into an 87-78 lead. But when Lowry left with 2:42 to go, the Pacers closed out the quarter with five straight points, cutting the deficit to four.\n\nThe Pacers got as close as 101-99 with 6:47 left before Davis scored seven points in a 12-4 spurt that gave Toronto an insurmountable 113-103 lead with 1:48 to go.\n\nTIP-INS\n\nRaptors: Pascal Siakam scored 15 points despite hurting his eye. ... OG Anunoby scored 16 points and had five steals before fouling out. The Raptors are 20-4 when Anunoby scores in double figures. ... VanVleet also finished with two steals, his 21st game this season with more than one. ... The Raptors made seven 3-pointers in the first quarter and wound up 17 of 38 from beyond the arc.\n\nPacers: Malcolm Brogdon had 16 points and eight assists, while T.J. McConnell and Justin Holiday each scored 12. McConnell also had seven assists. ... Jeremy Lamb finished with 11 points. ... Sabonis had 10 points and 10 rebounds at halftime, his 39th double-double this season. ... T.J. Warren missed the game because he had not cleared the concussion protocol.\n\nLOWRY UPDATE\n\nLowry finished with 16 points and 11 assists in 28 minutes but did not return after colliding with Ibaka.\n\nReplays appeared to show Lowry's head making contact near Ibaka's hip as he fell to the floor after drawing a foul. Lowry remained down on the court for several minutes as teammates gathered round. Eventually, he got up and walked to the bench before heading to the locker room.\n\nHe did not talk to reporters following the game, though he complained of soreness in his neck and right shoulder and moved stiffly around the locker room.\n\nNurse said he didn't expect Lowry to play Saturday night.\n\nROUNDING INTO SHAPE Oladipo seems to be reverting to form after finishing with 15 points, four assists and two steals in 27 1/2 minutes. His 5-of-11 shooting was a welcome improvement over the 24.5% mark he had coming into the game but what upset him the most was committing four of Indiana's 20 turnovers.\n\n\"In the first half, we did a great job sharing the ball and playing defense,\" he said. \"In the second half, we turned the ball over a little too much and they responded off our turnovers.\"\n\nUP NEXT\n\nRaptors: host Brooklyn on Saturday, seeking a sixth straight win in the series.\n\nPacers: return to action Saturday when Zion Williamson and New Orleans make their only appearance in Indianapolis this season.\n\n---\n\nMore AP NBA coverage: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995597.4822102
}