{
  "game_id": "0022200193",
  "espn_id": "401468348",
  "date": "Nov 13, 2022",
  "matchup": "MIN @ CLE",
  "headline": "Garland's career-high 51 not enough, Cavs lose to Wolves",
  "body": "CLEVELAND -- — All-Star point guard Darius Garland was watching the scoreboard, but not his individual statistics on Sunday night. He received a pleasant surprise.\n\n\r\n              Garland poured in a career-high 51 points — 27 of them in the fourth quarter — and made a career-best 10 3-pointers as the Cleveland Cavaliers lost 129-124 to the Minnesota Timberwolves. Cleveland had trailed 99-75 late in the third.\n\n\r\n              “I didn’t even know I had 50 until I went to the bench,” Garland said. “No one told me and I wasn’t paying attention to anything, except trying to win the game.\n\n\r\n              “That’s the great thing about this group of guys. No one cares about individual numbers. It’s all about the team.”\n\n\r\n              Garland’s point total was briefly the highest in the NBA this season, surpassing the 49 by Memphis’ Ja Morant against Houston on Oct. 21. Roughly one hour later, Philadelphia’s Joel Embiid scored 59 in a 105-98 win over the Utah Jazz.\n\n\r\n              The Cavaliers’ franchise record of 57 points is shared by LeBron James and Kyrie Irving. Garland fell four points shy of tying the Rocket Mortgage FieldHouse mark held by Irving and James Harden.\n\n\r\n              “Incredible performance, master class by Darius, and we’re hoping for many more of those out of him,” Cleveland forward Kevin Love said. “That was just beautiful. He got to his spots, kept us right there and gave us a chance at the end, and that’s all you can ask.”\n\n\r\n              Garland became the fourth Cavaliers player to score 50, joining James (nine times), Irving (twice) and Walt Wesley (once). His 10 3-pointers doubled his previous single-game high and were one short of Irving’s team record.\n\n\r\n              Cleveland, which lost its fourth in a row, played without injured All-Stars Donovan Mitchell and Jarrett Allen. Mitchell was sidelined with a sprained right ankle, while Allen sat out with a sore left ankle.\n\n\r\n              D’Angelo Russell had season highs of 30 points and 12 assists and Karl-Anthony Towns scored 29 points to help the Timberwolves overcome Garland’s onslaught.\n\n\r\n              “Garland is a phenomenal young player and he got super hot,” Minnesota coach Chris Finch said. “When guys like him get hot, there is no shutting them down, so you’ve got to really, really work. But I’m not here to be super picky with our guys after a win.”\n\n\r\n              Garland made two free throws with 8.3 seconds left to pull Cleveland within 126-124, but Russell made it 127-124 from the foul line. Kevin Love threw away the subsequent inbounds pass and Taurean Prince made two free throws to lock up the win.\n\n\r\n              Russell made 11 of 13 shots, including 4 of 5 3-pointers, and Towns grabbed 13 rebounds for Minnesota, which snapped a three-game losing streak. Prince had 19 points off the bench and Rudy Gobert added 15 points and 12 rebounds.\n\n\r\n              ROCKY RUSSELL\n\n\r\n              Timberwolves G D’Angelo Russell shot .377 from the field over the first 13 games and is averaging less than 15.0 points for the first time since his rookie season of 2015-2016.\n\n\r\n              Coach Chris Finch said Russell’s lack of production is a concern, but is not considering moving him out of the starting lineup.\n\n\r\n              “We’re not going anywhere without D-Lo playing at a much better level for us, but he had kind of a slow start last season, too,” Finch said. “I see his shooting struggles more related to hesitancy, not anything related to his role.”\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: C Naz Reid (illness) missed his second straight game. F Josh Minott and G Wendell Moore Jr. are on G League assignments with Iowa. … Two-way F Luka Garza traveled with the Timberwolves.\n\n\r\n              Cavaliers: F Dean Wade (right knee soreness) missed his second game in a row. F Dylan Windler (right ankle sprain) and G Ricky Rubio (left knee surgery) have not played this season.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit Orlando on Wednesday.\n\n\r\n              Cavaliers: Visit Milwaukee on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995187.161973
}