{
  "game_id": "0022201110",
  "espn_id": "401469265",
  "date": "Mar 25, 2023",
  "matchup": "PHX vs. PHI",
  "headline": "Booker, Biyombo help Suns snap skid, beat 76ers 125-105",
  "body": "PHOENIX -- - Bismack Biyombo isn't a particularly good shooter, he's a clank machine at the free-throw line and is undersized defensively against most opposing post players.\nOn the other hand, he plays really, really hard.\nAnd that's exactly what the Suns needed on Saturday night.\nBiyombo had one of his best games this season with 17 points, 13 rebounds and five blocks, Devin Booker scored 29 points and Phoenix beat the Philadelphia 76ers 125-105 to snap a three-game losing streak.\n\"When things are not going well, what do you do?\" Biyombo said. \"You've just got to put your head down and keep working and eventually we'll catch a break.\"\nIt was a badly needed win for the Suns, who had lost six of seven coming into the game to slide down to No. 5 in the Western Conference playoff race. The Sixers have lost three of their past four.\nBiyombo - starting for the injured Deandre Ayton - was a force on both ends of the court, getting interior buckets on offense and making life difficult for Sixers star Joel Embiid on defense. It was his constant energy that boosted the Suns, particularly after a frustrating loss to the Kings one night before.\n\"Bizzy plays hard,\" Suns guard Chris Paul said. \"That's a talent. He's in the right spot at the right time and his energy - we feed off it. He covers up a lot of our mistakes on the defensive end.\"\nThe game was tight through most of the first three quarters, but the Suns used a 26-11 run to turn a tied game into a 15-point advantage early in the fourth quarter. Phoenix got good minutes from most of their bench players, particularly Terrence Ross and T.J. Warren.\nWarren finished with 16 points, while Ross had 15.\n\"Our bench production - it was huge,\" Suns coach Monty Williams said. \"We had to dig deep.\"\nBooker shot 9 of 18 from the field and hit all nine of his free throws.\nThe Suns won despite a huge game from Sixers guard Tyrese Maxey, who finished with 37 points on 14-of-19 shooting, including 7 of 11 from 3-point range. Embiid added 28 points and 10 rebounds.\n\"We didn't play well,\" Sixers coach Doc Rivers said. \"We didn't move the ball today. The ball was stagnant offensively. That's not how we play.\"\nThe road-weary Sixers have played 10 of their past 13 on the road.\n\"I thought I missed a lot of shots I usually make,\" Embiid said. \"They loaded up a lot so I barely had any driving lanes.\"\nBoth teams were missing key pieces. The Suns were without Ayton (hip) and Kevin Durant (ankle), while the 76ers didn't have James Harden (achilles).\nThe Suns had a 58-53 halftime lead. Maxey led all scorers with 21 points before the break, while Booker had 18 for the Suns.\nHOT BOOK\nBooker is on one of the best scoring streaks of his career. He came into Saturday's game averaging 33.8 points on 58.5% shooting over his past 11 games.\nTIP-INS\n76ers: Harden missed his third straight game and fourth of the past five. The veteran leads the NBA in assists per game.\nSuns: Ayton missed his fourth straight game. Durant has played in just three games since coming to the Suns in a trade-deadline deal in mid-February ... Booker scored 13 points in the first quarter. ... Hosted a 62nd straight sellout crowd. ... Biyombo had a season-high eight offensive rebounds.\nUP NEXT\n76ers: Travel to face Denver on Monday.\nSuns: Travel to face Utah on Monday.\n------\nAP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995219.642022
}