{
  "game_id": "0022400663",
  "espn_id": "401705229",
  "date": "Jan 29, 2025",
  "matchup": "CHA vs. BKN",
  "headline": "Keon Johnson scores 18 points as Nets beat Hornets 104-83 to snap 7-game losing streak",
  "body": "CHARLOTTE, N.C. -- — Keon Johnson led a balanced Brooklyn attack with 18 points, and the Nets snapped a seven-game losing streak with a 104-83 win over the Charlotte Hornets on Wednesday night.\n\n\r\n              Jalen Wilson added 15 points and Tosan Evbuomwan had 14 for the Nets, who never trailed.\n\n\r\n              Ben Simmons returned after missing the last five games with an illness and a back injury and had 10 points and six rebounds off the bench for the Nets.\n\n\r\n              Miles Bridges had 23 points and 13 rebounds for the Hornets, who played without four regular starters including LaMelo Ball, Mark Williams, Brandon Miller and Josh Green. Vasa Micic overcame an early chest injury and returned to finish with 15 points and seven rebounds.\n\n\r\n              The Hornets had limited options offensively, and were held to 34% shooting from the floor and 29% from 3-point range.\n\n\r\n              Takeaways\r\n              Nets: Among the Nets who did not play were Cam Thomas (left hamstring strain), Bojan Bogdanovic (left foot recovery), Noah Clowney (left ankle sprain) and Cameron Johnson (right ankle sprain). The Nets won despite being outrebounded 52-40.\n\n\r\n              Hornets: The training staff is continuing to evaluate Ball's most recent ankle sprain, but coach Charles Lee has not given an update on how long he expects the 2022 All-Star to be out. Williams missed the game due to left foot injury management.\n\n\r\n              Key moment\r\n              Brooklyn bolted to an 11-2 lead and pushed the advantage to 21 entering the fourth quarter.\n\n\r\n              Key stat\r\n              The Nets held the Hornets to 30% shooting in the first half and led 53-37 at the break.\n\n\r\n              Up next\r\n              The Nets visits the Rockets on Saturday night; the Hornets franchise-long nine-game homestand continues Friday night against the Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997708.8246348
}