{
  "game_id": "0021900395",
  "espn_id": "401161037",
  "date": "Dec 16, 2019",
  "matchup": "TOR vs. CLE",
  "headline": "Siakam scores 33 as Raptors beat Cavs 133-113",
  "body": "TORONTO --  Raptors coach Nick Nurse expected guard Norman Powell would lose his starting spot once Fred VanVleet was healthy.\n\nPowell's recent offensive outburst is forcing Nurse to reconsider.\n\nPascal Siakam scored 33 points, Kyle Lowry had 20 points and 11 assists, and Toronto beat the struggling Cleveland Cavaliers 133-113 Monday night.\n\nPowell scored 26 points, Serge Ibaka had 14 and OG Anunoby 12 as Toronto set a season-high in points and won for the eleventh time in 14 home games. The Raptors have won back-to-back at home after losing three straight here.\n\nPowell has scored 20 or more points in three straight games for the first time in his career. He scored 20 or more four times in 60 games last season.\n\nLowry said it's the best string of games he's ever seen from Powell.\n\n\"Great stretch right now,\" Lowry said. \"He's shooting the ball confidently, pushing it in transition. I think he's understanding how to play in transition a lot better now.\"\n\nNurse echoed Lowry's praise.\n\n\"What I like is the speed at which he sees the open floor and goes for it,\" Nurse said.\n\nVanVleet has missed four straight games because of a sore right knee but is getting closer to a return. Whether he comes back as a starter or a bench player remains to be seen.\n\nFor his part, Powell doesn't mind whether or not he starts.\n\n\"I'll do whatever helps the team,\" he said. \"Coming off the bench or starting, it doesn't matter to me as long as we're winning.\"\n\nLowry's double-double was his 110th with Toronto, tying Antonio Davis for third-most in franchise history. They trail Jonas Valanciunas (137) and Chris Bosh (239).\n\nThe double-double was Lowry's second in seven games since returning from a left thumb injury that sidelined him for 11 games.\n\n\"I'm getting a little bit better,\" Lowry said. \"Still need a little bit of time, but I'm getting a little bit better.\"\n\nCollin Sexton scored 25 points, Darius Garland had 20 and Tristan Thompson 18 as the Cavaliers lost for the 16th time in 18 games.\n\nCleveland has dropped two straight after winning 117-109 at San Antonio on Thursday night to snap a season-long eight-game skid.\n\n\"They're just a really good team and certainly a better team than us tonight,\" Cavs coach John Beilein said of the Raptors.\n\nThe Raptors scored eight points off six Cavaliers turnovers in the first quarter. Love led the Cavs with seven points in the first, and Cleveland closed the quarter with a 10-0 run but still trailed 37-29.\n\nThe Cavaliers made only two turnovers in the second but couldn't close the gap on Toronto. Powell scored six points in the quarter and the Raptors led 66-54 at halftime.\n\nPowell drew gasps for his one-handed slam dunk from Siakam's high lob pass in the third. Powell scored 16 points in the quarter, and Siakam added 13 to give the Raptors a 104-84 lead.\n\n\"It was good to show that I've still got the bounce,\" Powell said.\n\nTIP-INS\n\nCavaliers: Cleveland is 1-8 against Atlantic Division opponents. ... The Cavaliers are 3-11 on the road. ... Cleveland has lost seven of eight games in December. ... The Cavaliers finished with 11 turnovers, leading to 18 points for the Raptors.\n\nRaptors: Toronto outscored Cleveland 29-4 in fast-break points. ... Siakam matched his career-high with five 3-pointers. ... The Raptors shot 16 for 32 from long range. ... Anunoby led Toronto with nine rebounds. . Toronto is 9-1 when Siakam scores 30 or more.\n\nTHE DEFENSE RESTS\n\nCleveland has allowed 130 or more points four times this season. The Cavs gave up a season-worst 143 points at Dallas on Nov. 22. Cleveland has not kept an opponent below 100 points since a 93-87 loss to Orlando on Dec. 6.\n\nTAKE CARE\n\nToronto's seven turnovers were a season-low. The Raptors had two turnovers in the first half.\n\nUP NEXT\n\nCavaliers: Host Charlotte on Wednesday night.\n\nRaptors: Visit Detroit on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995631.5808399
}