{
  "game_id": "0022000568",
  "espn_id": "401307311",
  "date": "Mar 11, 2021",
  "matchup": "CHA vs. DET",
  "headline": "Washington, Rozier help Hornets down Pistons 105-102",
  "body": "CHARLOTTE, N.C. -- — Some NBA players tend to shy away from taking big shots with the game on the line.\n\n\r\n                    Terry Rozier clearly isn't one of them.\n\n\r\n                    P.J Washington had 20 points and nine rebounds, while Rozier continued to build on his reputation as Charlotte's closer by scoring 12 of his team's final 15 points to lead the Hornets to a 105-102 win over the Detroit Pistons on Thursday night.\n\n\r\n                    Hornets coach James Borrego called him “fearless.”\n\n\r\n                    “He's very comfortable in those moments,” Borrego said. “It's almost like he is more locked in the tighter the game is. That's rare at any level, much less at this level.”\n\n\r\n                    Rozier was 2 of 9 from the field before going 4 of 5 in the final 3:11 with the NBA's ultimate finisher, six-time champion and team owner Michael Jordan, sitting courtside.\n\n\r\n                    Rozier said he hasn't always been on teams where he's the first option to take the big shot, but said that doesn't mean he wasn't ready.\n\n\r\n                    “That is what separates the good from the greats,” said Rozier, who finished with 17 points. “If you want to be great you have to have that confidence down the stretch.”\n\n\r\n                    Teammate Gordon Hayward said he's seen that from Rozier all season.\n\n\r\n                    “He's not afraid of any moment,” Hayward said. “He was pretty quiet and then at the end of the game he just went off and won the game for us.”\n\n\r\n                    Raptors coach Dwane Casey expressed frustration with his team's inability to defend Rozier with the game on the line.\n\n\r\n                    “That’s what he does. That's what he’s been doing all year. It’s no surprise,” Casey said. “But we’ve got to do a better job of being physical, getting into him, riding him over screens, make him put it on the floor multiple times and make it hard for him.”\n\n\r\n                    Hayward added 17 points and Cody Zeller chipped in with 15 points and a key rebound for Charlotte (18-18).\n\n\r\n                    Jerami Grant had 32 points on 11-of-24 shooting for the Pistons.\n\n\r\n                    With Charlotte trailing 96-94, Zeller grabbed a big offensive rebound in traffic and kicked out to an open Washington for a corner 3-pointer with 2:22 left to give the Hornets the lead for good.\n\n\r\n                    After a Pistons turnover, Rozier took over.\n\n\r\n                    He drove the left side of the lane and knocked down a soft bank shot while drawing a foul, pushing the lead to four. Then he added a 3 from the wing on the next possession to push the lead to five and sank a floater in the lane with the shot clock winding down to give the Hornets a 105-100 lead with 9.1 seconds left.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Saddiq Bey, who grew up in Charlotte, had 14 points. ... Committed 14 turnovers leading to 19 Charlotte points. \n\n\r\n                    Hornets: Borrego said he plans to stick with the starting lineup of LaMelo Ball, Rozier, Hayward, Washington and Zeller moving forward. ... Devonte Graham returned to the floor after missing nearly a month with a knee injury. ... Made 23 of 24 foul shots.\n\n\r\n                    SOME FANS ALLOWED\n\n\r\n                    The Hornets distributed 500 complimentary tickets to frontline workers from healthcare partner Novant Health for the game. They're the first spectators allowed in at the Spectrum Center in more than a year.\n\n\r\n                    About 3,000 general public fans will be allowed in for the next home game on Saturday.\n\n\r\n                    “It was great to have some people in the stands,” Hayward said. “I am glad we were able to win for them.”\n\n\r\n                    GOING DEEP\n\n\r\n                    Casey played 12 players against the Hornets, which he said was the plan going in.\n\n\r\n                    “First of all, we haven’t played in almost a week.” Casey said. \"Guys were a little winded, they were in the same thing, I don’t know how many guys they played. But I think both teams were just trying to get fresh bodies in, and you know getting guys a blow and I thought everybody who came in the game did an excellent job.” \n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: At Brooklyn on Saturday night.\n\n\r\n                    Hornets: Host Raptors on Saturday night as part of a three-game homestand.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997017.62121
}