{
  "game_id": "0021801103",
  "espn_id": "401071776",
  "date": "Mar 25, 2019",
  "matchup": "PHI @ ORL",
  "headline": "Magic shut down 76ers in 2nd half, win 119-98, close on 8th",
  "body": "ORLANDO, Fla. --  A little desperation went a long way for the Orlando Magic.\n\nThe Magic shut down the Philadelphia 76ers in the second half of a 119-98 victory on Monday night that moved them within a half-game of eighth place in the Eastern Conference.\n\n\"They were desperate. They played like it and we did not,\" said 76ers coach Brett Brown, whose team was held without a field goal for a second-half stretch of nearly 12 minutes. \"Nik Vucevic is a really difficult matchup and (Evan) Fournier really had a fantastic night. Their desperation was evident.\"\n\nVucevic had 28 points and 11 rebounds, and Fournier scored 24 points for the Magic, who outscored the 76ers 30-5 while Philadelphia missed 15 straight shots.\n\n\"It's impressive, especially when you look at all the firepower they have, even without Ben Simmons,\" Vucevic said. \"We needed this win with a tough road trip coming up, starting tomorrow night in Miami.\"\n\nThe Magic completed their first 5-0 homestand in franchise history and moved a half-game behind Miami in chasing the final playoff spot in the East. They visit the Heat on Tuesday.\n\nJoel Embiid led the 76ers with 20 points and 10 rebounds.\n\nPlaying without point guard Simmons, the 76ers led 60-57 after shooting 61.5 percent in the first half. The second half was a different story.\n\n\"I thought we went away from what was working to get those field goals (in the first half),\" said Tobias Harris, who had 12 of his 15 points in the first half. \"But that game wasn't won or lost on the offensive end for us. That game would have been won on the defensive end. We didn't do a great job against them.\"\n\nShake Milton's jump shot cut the Magic's lead to 78-77 with 4:32 left in the third quarter, but Philadelphia did not score in the remainder of the period, falling behind by 14 points.\n\nWhen Zhaire Smith hit a 3-pointer with 4:50 remaining in the game, it ended a stretch of 11 minutes, 42 seconds without a field goal for the 76ers, who then trailed 108-85.\n\n\"I think the urgency has not been with us,\" Brown said. \"It happens. As I candidly said, we're trying to hold on to our third-place position, and land the plane and keep people healthy.\"\n\nJ.J. Redick, who scored 79 points and made 18 of 29 3-pointers in the 76ers' first three games against Orlando this season, made only 1 of 7 Monday night and finished with eight points.\n\n\"He's not going to miss those very often, but we'll take it,\" said Magic coach Steve Clifford.\n\nTIP-INS\n\n76ers: Simmons sat out the game with a stomach virus, missing his first game since Oct. 23. ... T.J. McConnell got his second start of the season at point guard. ... F Mike Scott left the game with lower back tightness in the second half.\n\nMagic: Carter-Williams, who was Rookie of the Year for the 76ers in 2013-14, signed a second 10-day contract. ... The Magic used the same starting five for a 27th straight game. ... The NBA and Walt Disney World Resort announced Aug. 12 as the opening date for NBA Experience, an interactive theme event at nearby Disney Springs.\n\nANOTHER BOOST FROM CARTER-WILLIAMS\n\nThe Magic got another big boost off the bench from Michael Carter-Williams, who had 15 points, six rebounds and three assists in 20 minutes. \"I think that's my job with this team, to bring energy and push the ball up the floor,\" Carter-Williams said. \"I'm here to make the little plays and I know big things will come after that.\"\n\nUP NEXT\n\n76ers: Host Brooklyn on Thursday night.\n\nMagic: Play at Miami on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764993990.5932548
}