{
  "game_id": "0022201090",
  "espn_id": "401469245",
  "date": "Mar 22, 2023",
  "matchup": "ATL @ MIN",
  "headline": "Towns scores 22 in return as Timberwolves rally past Hawks",
  "body": "MINNEAPOLIS -- — Trailing by a point with 7.2 seconds left, Timberwolves coach Chris Finch looked at Karl-Anthony Towns in the huddle and told him he’d get the ball with a chance to put Minnesota ahead.\n\n\r\n              It set up Towns for a memorable return from a calf injury.\n\n\r\n              Towns drove to his right against Atlanta’s John Collins, drawing a foul. He converted both free throws with 3.6 seconds left to send Minnesota to a 125-124 win against the Hawks on Wednesday night.\n\n\r\n              “Shoutout to Finch having that confidence in me after 51 games and all of the things I had to deal with,” said Towns said, who scored 22 points. “I just knew in my bones I wasn’t going to miss.”\n\n\r\n              But officials acknowledged after the game they missed on the game's final play.\n\n\r\n              A foul wasn't called as Minnesota’s Taurean Prince appeared to make contact with Atlanta’s Saddiq Bey after Bey secured an offensive rebound. After reviewing it after the game, crew chief Ben Taylor told a pool reporter a foul should have been called.\n\n\r\n              “On postgame review, we see it,” Taylor said. “It appears that Prince moves back into Bey’s space, and we should have assessed a foul on the play.”\n\n\r\n              Naz Reid added 26 points off the bench and Jaden McDaniels had 25 for Minnesota, which trailed by 10 points with 7:18 remaining but used a 19-5 run to get back in the game.\n\n\r\n              Atlanta led 124-123 with 50.5 seconds left after a pair of free throws by Trae Young, setting up Towns’ big finish.\n\n\r\n              “It’s obviously one of the beauties of KAT,” Finch said. “You can give him the ball in a lot of places on the floor in high-leverage situations. He’s going to get a clean look, put a lot of pressure to get the foul.”\n\n\r\n              Towns had been out since Nov. 28 with the injury. And Minnesota had lost three of four and slid to ninth in the Western Conference beginning the night.\n\n\r\n              “It’s what movies is made of, it’s what dreams is made of,” Towns said. “I’m glad my movie had a good ending.”\n\n\r\n              Young scored 29 points and De’Andre Hunter added 16 for Atlanta, which was playing the second game of a back-to-back after beating Detroit 129-107 Tuesday night with second-leading scorer Dejounte Murray missing both games with a non-COVID-19 illness.\n\n\r\n              Atlanta, who shot 54.2% from the field and hit 12 of 26 3-pointers, started the day eighth in the Eastern Conference. They were 2 1/2 games behind Miami and one game ahead of Toronto.\n\n\r\n              “I was thinking about this and that and the other,” Hawks coach Quin Snyder said. “A shot here or a foul here or a call here, a missed shot, and I just kept coming back to the same thing, that we just competed. Over time, that’s the most important thing for a team to do.”\n\n\r\n              Minnesota had a 10-11 record when Towns went out as the team struggled at times to adapt to having two big men on the court together in Towns and newcomer Rudy Gobert.\n\n\r\n              Towns, a three-time All-Star, received a special pregame introduction and was cheered loudly by the home crowd. He returned to a team that found its rhythm with Anthony Edwards carrying the scoring load with a host of veterans filling complementary roles.\n\n\r\n              The Timberwolves also traded Towns’ good friend D’Angelo Russell and acquired Mike Conley at the trade deadline.\n\n\r\n              “Very pleased with him coming back and giving us what he gave us,” Conley said. “He’s just going to get better and better, I believe. For me, it’s another guy we’re adding in and I got to get used to playing alongside.”\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Young posted his 100th straight game with at least five assists. It’s the longest active streak in the NBA and the ninth longest in history. ... Jalen Johnson missed his fourth game in a row with left hamstring tightness and a groin strain.\n\n\r\n              Timberwolves: Edwards was listed as questionable, but missed his third straight game. Backup point guard Jordan McLaughlin was out with an illness. ... Gobert had 12 points and 12 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Return home against Indiana on Saturday.\n\n\r\n              Timberwolves: Play at Golden State on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994810.12307
}