{
  "game_id": "0021801020",
  "espn_id": "401071693",
  "date": "Mar 14, 2019",
  "matchup": "OKC @ IND",
  "headline": "Pacers rally from 18-point deficit to beat Thunder 108-106",
  "body": "INDIANAPOLIS --  Paul George figured to be the feature attraction in his second visit to Indiana since a blockbuster trade two years ago.\n\nDomantas Sabonis and Wesley Matthews upstaged the former Pacer on Thursday night.\n\nMatthews tipped in a basket with 1.8 seconds left and Indiana rallied from a 19-point deficit to beat the Oklahoma City Thunder 108-106. Sabonis added 26 points against this former team.\n\n\"Man, this team fights. That's one of the big reasons why I chose to come here,\" Matthews said. \"We fight, we compete. No lead is too much. We needed a win against a playoff team, and that's what we've got to do going forward.\"\n\nWithout All-Star guard Victor Oladipo, who the underdog Pacers got in the blockbuster deal that sent George to the Thunder in July 2017, Indiana fought its way back over the final 15 minutes behind the other player it acquired in the deal, Sabonis, and Matthews, who the Pacers signed last month as Oladipo's replacement.\n\nIt was Indiana's second-largest comeback this season.\n\nThey did it against George, a six-time All-Star who shrugged off resounding boos to score 36 points, and Russell Westbrook, who added his 27th triple-double of the season but missed a 3-pointer from beyond the top of the key as the buzzer sounded.\n\nWestbrook finished with 19 points, 14 rebounds and 11 assists.\n\nGeorge was terrific for the first 47 minutes.\n\nHe scored 25 points in the first half and completed a three-point play to give the Thunder a 73-54 lead with 7:18 left in the third quarter. He even made the tying 3-pointer with 1:49 left in the game and two free throws to give Oklahoma City a 106-104 lead with 1:13 to go.\n\nIt was a different story in the final minute.\n\nGeorge turned the ball over twice, slipped as the Pacers started their final possession and got knocked to the floor on a pick -- giving Indiana the one-man advantage that allowed Matthews to free himself for the putback on Bojan Bogdanovic's errant 16-footer.\n\n\"At the end of close games, there's going to be contact,\" Thunder coach Billy Donovan said. \"In those situations you just have to play through that.\"\n\nMatthews finished with 16 points and seven rebounds to help Indiana cut its magic number for clinching a playoff spot to one.\n\nThe Pacers' second straight win also kept them in third place in the Eastern Conference while the Thunder slipped into a tie for fifth in the West.\n\n\"Domantas really came in during that second half and established us,\" coach Nate McMillan said. \"I thought we did a good job, especially late, pressuring their dribble, getting some deflections and really disrupting their rhythm defensively. That is what we have to be about and, really, it came at the right time for us.\"\n\nTIP-INS\n\nThunder: Westbrook has 131 triple-doubles in his career. ... Steven Adams had 17 points and eight rebounds. ... Oklahoma City went 3-3 during a stretch in which they played five road games. ... The Thunder fell to 6-5 on the second night of back-to-backs this season.\n\nPacers: Darren Collison had 17 points, six rebounds and seven assists. ... The Pacers committed 16 turnovers. ... Bogdanovic scored 23 points and extended his streak of consecutive games in double figures to 24 and his career best single-season total of 20-point games to 28. ... Tyreke Evans missed his second straight game for personal reasons. McMillan said he expects Evans to travel with the team later this week.\n\nBOO-BIRDS\n\nGeorge brushed off the boos by saying he thought his second trip back to Indiana was tamer than his first.\n\nPacers fans didn't just boo, though.\n\nAt one point, they chanted \"Zion hates you,\" a reference to the blown out shoe that forced Duke star Zion Williamson to miss a few games. At another, they serenaded George with \"We don't miss you.\"\n\nGeorge took it in stride.\n\n\"I actually think things seem more normal now,\" he said. \"I feel like things have died down.\"\n\nUP NEXT\n\nThunder: Hosts the Western Conference-leading Warriors on Saturday.\n\nPacers: Begin a crucial four-game road trip at Denver on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994554.7750368
}