{
  "game_id": "0022000914",
  "espn_id": "401307717",
  "date": "Apr 25, 2021",
  "matchup": "ORL vs. IND",
  "headline": "Magic rookie Cannady' breaks ankle in loss to Pacers",
  "body": "ORLANDO, Fla. -- — Malcolm Brogdon scored 24 points and the Indiana Pacers used a big third quarter to rout short-handed Orlando 131-112 on Sunday night in a game marred by Magic rookie Devin Cannady’s gruesome ankle injury.\n\n\r\n                    Cannady suffered an open fracture of his right ankle in the first quarter when he landed awkwardly while trying to contest Edmond Sumner’s layup. Magic center Mo Bamba was so shaken by the sight of the injury that he took his jersey off and placed it over Cannady’s badly broken and bleeding ankle.\n\n\r\n                     “Sickening. First, of all (Cannady) is a good guy who has worked his tail off to get better,\" said Tyrone Corbin, who directed the Magic with head coach Steve Clifford out after testing positive for COVID-19 on Saturday. \"It’s just sickening to see him go down like that. We’re praying for him.”\n\n\r\n                    The former Princeton star was set for surgery Sunday night. He was part of the Lakeland Magic’s G League title team this year.\n\n\r\n                    Playing less than 24 hours after rallying to beat Detroit, the Pacers had a 41-20 edge in the third quarter to cruise to their third straight victory. \n\n\r\n                    “It was our ball movement, we were playing with great energy, we were running out and having fun,’’ said JaKarr Sampson, who had eight of his 11 points in the third quarter. “The ball found me and I was able to make shots. We just did a great job of coming out in the second half with energy and establishing that lead early.”\n\n\r\n                    Indiana remained a game behind Charlotte for eighth place in the Eastern Conference — two games ahead of No. 10 Washington.\n\n\r\n                    “Everyone’s aware of the standings and that there are so many teams bunched up together,” Indiana coach Nate Bjorkgren said. “Every game is important and the opponent doesn’t matter who you play because every team is good. … Our guys just want to continue playing the way that we are — moving the ball and fighting like crazy on the defensive end.”\n\n\r\n                    “Defensively, we didn’t take anything away from these guys,” Corbin said. “They got blow-bys, transition baskets and they ran on us on makes. They got it all and when we’re rebuilding we have to understand that we can’t give up effort baskets.”\n\n\r\n                    Sumner added 21 points for Indiana, Justin Holiday hit six 3-pointers and had 20 points, and Caris LeVert had 18 points and six assists. The Pacers shot 54.9% and hit 15 3s.\n\n\r\n                    Dwayne Bacon led Orlando with 20 points, and Wendell Carter Jr. added 10 points and 13 rebounds. \n\n\r\n                    The Pacers beat Magic for the third time this season and sixth overall.\n\n\r\n                    TIP INS\n\n\r\n                    Pacers: Indiana was without starters Domantas Sabonis (back strain) and Myles Turner (foot) and reserves Jeremy Lamb (knee) and Goga Bitadze (ankle) again. Sabonis, who has had 40 double-doubles and six triple-doubles, has missed the last four games and hasn’t played since April 18. The Pacers are 5-2 without Sabonis.\n\n\r\n                    Magic: Clifford first tested positive following Thursday night’s loss to the Pelicans, but two tests on Friday were negative and Saturday’s was positive. Clifford got his second dose of the Moderna COVID-19 vaccine on Thursday and he is hopeful his predicament doesn’t keep anyone from getting vaccinated. “I just don’t understand why anyone would be against the vaccination,” he said.\n\n\r\n                    Rookie guard Devin Cannady suffered an open fracture of his right ankle in the first quarter when he landed awkwardly while trying to contest Edmond Sumner’s layup. Magic center Mo Bamba was so shaken by the sight of the injury that he took his jersey off and placed it over Cannady’s badly broken and bleeding ankle. \n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host Portland on Tuesday night.\n\n\r\n                    Magic: Host the Los Angeles Lakers on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764997572.631165
}