{
  "game_id": "401810139",
  "espn_id": "401810139",
  "date": "Nov 24, 2025",
  "matchup": "TOR vs CLE",
  "headline": "Brandon Ingram scores season-high 37 points as Raptors beat Cavaliers 110-99 for 8th straight win",
  "body": "TORONTO -- — Brandon Ingram scored 15 of his season-high 37 points in the third quarter, Scottie Barnes had 18 points and 11 rebounds, and the Toronto Raptors beat the Cleveland Cavaliers 110-99 on Monday night for their eighth straight win.\n\n\r\n              Sandro Mamukelashvili scored 12 points and Immanuel Quickley had 11 for Toronto, which has won 12 of 13.\n\n\r\n              Two of the Raptors' victories in their streak have come against the Cavaliers. Toronto swept the season series for the first time since the 2019-20 season.\n\n\r\n              Cleveland’s Donovan Mitchell had 17 points but shot 6 of 20, going 3 of 12 from 3-point range. \n\n\r\n              Jaylon Tyson scored 15 points, and Evan Mobley and Nae’Qwan each had 14 for Cleveland. Lonzo Ball shot 3 for 15, missing 10 of 12 attempts from long range to finish with eight points.\n\n\r\n              Toronto closed the first half with a 13-2 run to lead 57-54 at the break.\n\n\r\n              The Raptors played without RJ Barrett, who has a sprained right knee. Barrett left Sunday’s win over Brooklyn in the third quarter after landing awkwardly on a fast-break dunk. Tests did not reveal a serious injury, coach Darko Rajakovic said.\n\n\r\n              Ingram connected on 6 of 12 attempts in the third. His final basket, a 3-pointer with 1:20 left in the period, gave Toronto its biggest lead at 88-74.\n\n\r\n              Cleveland’s Darius Garland (sore left big toe) and De’Andre Hunter (rest) sat on the second night of a back-to-back. Toronto’s Jakob Poeltl returned after sitting out Sunday because of a sore lower back. Poeltl had 13 rebounds.\n\n\r\n              Jarrett Allen, who missed his third straight game because of a sprained finger on his right hand, was among seven Cavs players out with injuries.\n\n\r\n              Up next\r\n              Cavaliers: At Atlanta on Friday.\n\n\r\n              Raptors: Host Indiana on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042687.0060842
}