{
  "game_id": "0022300772",
  "espn_id": "401585400",
  "date": "Feb 13, 2024",
  "matchup": "ORL vs. OKC",
  "headline": "Jalen Williams, Shai Gilgeous-Alexander lead Thunder past Magic 127-113",
  "body": "ORLANDO, Fla. -- — Jalen Williams scored 33 points, Shai Gilgeous-Alexander added 32 points and five assists and Oklahoma City shook off a sluggish start beat the Orlando Magic 127-113 on Tuesday night in the Thunder's final game before the All-Star break.\n\n\r\n              Gilgeous-Alexander scored 13 points during a five-minute stretch of the third quarter in which the Thunder took command of the game, which was played on the night the Magic retired Shaquille O’Neal's No. 32.\n\n\r\n              Chet Holmgren had 13 points, nine rebounds and five blocks for the Thunder.\n\n\r\n              Paolo Banchero led the Magic with 23 points and 10 assists. Wendell Carter Jr. had 22 points and seven rebounds.\n\n\r\n              Jalen Suggs hit three 3-pointers to stake Orlando to an early 11-point lead, but it was gone by the end of the first quarter.\n\n\r\n              “We kind of just weathered that storm, something we've been doing all year,” said Williams, who made 12 of 18 shots. “I think we were able to double down on our physicality and compete with them. Once we got our physicality back into the game, I thought we did a good job of course correcting and playing with a lead.”\n\n\r\n              Gilgeous-Alexander got going in the second half, scoring six of the Thunder's first seven field goals, and when Holmgren hit a 3-pointer with 6:10 left in the third quarter, Oklahoma City led 80-63.\n\n\r\n              “We were up eight at halftime, and Chet hadn’t played great, Shai hadn’t played great,” said Thunder coach Mark Daigneault. “And yet the cumulative effect and everybody else carried us through the first half and put us in a good position. Shai’s too good of a player to have a whole game like that.\"\n\n\r\n              The Magic played better defense on him in the first half.\n\n\r\n              \"We did a great job in that first half with Shai,\" Magic coach Jamahl Mosley said. ”Just being able to defend him without fouling early was a big process, but then he got himself going.\"\n\n\r\n              Jonathan Isaac opened the final period with a dunk to bring the Magic back to within eight at 92-84. But Holmgren blocked two straight shots, Williams ran off 10 straight points for the Thunder and a 3-pointer by Cason Wallace stretched Oklahoma City's lead to 107-86 with 8:02 left.\n\n\r\n              The Magic made only seven of 29 3-point shots after building their early lead.\n\n\r\n              O’Neal, the first Magic player to have his number retired, played his first four NBA seasons (1992-93 through 1995-96) in Orlando. The number retirement presence charged the atmosphere.\n\n\r\n              Banchero said he enjoyed a playoff-type atmosphere — noticing extra energy in the building because of the celebration for O’Neal that was happening postgame.\n\n\r\n              “The defense chants and all that, it was great to just be in that environment,” Banchero said. “Great job by the fans for putting that environment together for us. We couldn’t come up with a win but just as an organization, as a team, we would love for that to just become the new norm around here.”\n\n\r\n              UP NEXT:\n\n\r\n              Thunder: Host the Los Angeles Clippers on Feb. 22.\n\n\r\n              Magic: Host New York on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995696.198555
}