{
  "game_id": "0021900507",
  "espn_id": "401161149",
  "date": "Jan 01, 2020",
  "matchup": "LAL vs. PHX",
  "headline": "West-leading Lakers beat Suns 117-107 for 3rd win in row",
  "body": "LOS ANGELES --  The Lakers built a huge early lead against Phoenix only to see it shrink to single digits.\n\nThey still won their third in a row, but considered it a lesson learned.\n\nLeBron James notched his eighth triple-double of the season, Anthony Davis had 26 points and 11 rebounds, and the Western Conference leaders opened the new year with a 117-107 victory on Wednesday night.\n\n“We can't allow ourselves to fall into a trap like that,” Davis said. “You got to learn how to handle success within games.”\n\nJames finished with 31 points, 13 rebounds and 12 assists in a game that appeared well in hand by the end of a dominant first quarter. He had double-figure points and assists by halftime.\n\n“We wanted to get off to a good start and protect home as well as we can,” James said.\n\nThe Suns rallied in the fourth, getting within seven points after trailing by 36 earlier in the game. That forced the Lakers' starters back in, and James steadied them with eight points to close out the win.\n\n“You always got to be engaged until the clock hits zero,” James said.\n\nThe Lakers shot 70% in a ferocious opening quarter when they made their first 11 shots. Danny Green had their first miss on a 3-point attempt, but the Lakers controlled the offensive rebound and JaVale McGee found Green for a dunk.\n\n“I'm asking our guys to dominate everybody they play,” Lakers coach Frank Vogel said. “Our guys took that message to heart.”\n\nThe Lakers missed just eight attempts in the first. James airballed a shot, but they snagged the rebound and Avery Bradley scored to salvage the possession.\n\nThe Lakers put together a 25-4 run in which the Suns were limited to only free throws. Among the highlights, Davis dunked over Aron Baynes and let out a roar, and later Davis threw down a reverse dunk on James' pass. Not to be outshone, James followed with a two-handed jam that ignited the crowd. Los Angeles led 43-17 at the end of the quarter.\n\nKyle Kuzma, sporting blond hair, had three 3-pointers in the second. Bradley scored on a smooth behind-the-back pass from James. Kentavious Caldwell-Pope beat the shot clock with a casual heave on a 3-pointer. Dwight Howard chipped in eight points and the Lakers shot 61% in taking a 74-41 lead into halftime.\n\nKuzma added 19 points and Bradley had a season-high 18.\n\nDevin Booker scored 32 points and Kelly Oubre Jr. added 26 for the Suns. Phoenix had won two in a row after losing eight straight.\n\n“We turned it up a notch in the second half and came out swinging,” Booker said. “We did it with defense and a will to play and a competitive spirit. We know we can do it. We'll figure it out. Anytime you go 2-2 on a road trip, it's a good road trip.”\n\nTIP-INS\n\nSuns: Booker has scored 30 or more points in a season-high four straight games. ... They fell to 1-4 all-time playing on New Year's Day; it was their first such contest since 1983. ... They were held to a season-low 17 points in the first quarter. ... The Suns gave up a season-worst 74 points in the first half. ... Frank Kaminsky III missed his second straight game because of a right knee injury.\n\nLakers: They improved to 18-0 against teams under .500 this season and more such opponents are coming up: New Orleans, Detroit and New York. ... Howard notched his 1,000th career steal. ... Their 43 points in the first quarter were a season high. ... Alex Caruso had right calf tightness and didn't return. ... Green and McGee stayed loose by jumping rope on court during a timeout in the fourth.\n\nREMEMBERING STERN\n\nThere was a moment of silence for former NBA commissioner David Stern who died Wednesday at 77. “We lost a great visionary,” James said. “Him and Dr. James Naismith are the two most important people in basketball.” James recalled the day he was drafted he spoke to Stern behind the scenes. “He told me he wanted to wear my suit one day,” James said, laughing.\n\nJames said something should be named after Stern, much like the NBA championship trophy is named for Larry O'Brien.\n\nRUBIO'S SLIP\n\nRicky Rubio said he hurt his hip after slipping on a wet spot on the court and left the game in the closing minutes. “I don't know yet if I'll be able to play the next game,” he said.\n\nRubio had six points on 2-of-7 shooting and nine assists for the Suns.\n\nWORKING HIS WAY BACK\n\nPhoenix's DeAndre Ayton scored 16 points in his second game back from a sprained right ankle. He pulled down a game-high 14 rebounds in 31 minutes.\n\n“I'm trying to get my rhythm back,” he said. \"We got down early but we woke up in the second half. I take this personal and I'm taking it home with me. We need to start games the way we ended the game and put fear into our opponents and pressure the rim.\"\n\nUP NEXT\n\nSuns: Host the New York Knicks on Friday to open a five-game homestand.\n\nLakers: Host New Orleans on Friday in the middle of a five-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996003.618567
}