{
  "game_id": "0021900473",
  "espn_id": "401161115",
  "date": "Dec 28, 2019",
  "matchup": "TOR @ BOS",
  "headline": "Lowry has 30 points to carry Raptors over Celtics, 113-97",
  "body": "BOSTON --  The Toronto Raptors didn’t need any speeches. That loss on Christmas was sticking in their minds the last few days.\n\nKyle Lowry scored 30 points, Serge Ibaka had 20 and the Raptors beat Boston 113-97 on Saturday night, snapping the Celtics’ five-game winning streak.\n\nPatrick McCaw and Fred VanVleet each added 18 points for Toronto, which avenged the loss on Christmas and sent Boston to just its second loss in 15 games at home this season.\n\n“I think it was internal. It didn’t sit well with me on Christmas Day,” McCaw said. “We definitely didn’t give it our best effort and I think tonight guys took it personally. It wasn’t talked about. Guys just went out and gave it their all.”\n\nKemba Walker led the Celtics with 30 points, and Jaylen Brown had 17 after getting consecutive 30-point games for the first time in his career. Brown had a career-high 34 in a win over Cleveland on Friday.\n\n“We beat those guys two times already (this season), and obviously a few days ago on Christmas,” Walker said. “They definitely remembered that, of course. But those are the defending champs. They’ve got a target on their back, you know? They’re the team to beat. They came in like they were the defending champs tonight.”\n\nPlaying their first game since losing by 16 to the Celtics on Wednesday -- the first NBA game in Canada on Christmas -- the Raptors never trailed in breaking a two-game losing streak.\n\n“I think we just wanted to go out there and kind of compete a little better than we did on Christmas,” Lowry said.\n\nToronto was without two of its top four scorers due to injuries -- Pascal Siakam (groin) and Norman Powell (left shoulder subluxation). Siakam leads the team with 25.1 points per game, and Powell is averaging 14.4.\n\nThey also were missing center Marc Gasol (left hamstring). All three were injured in the same game, a Dec. 18 win at Detroit.\n\nThe Celtics had used a 10-0 spree to slice a 13-point deficit down to 70-67 midway into the third quarter, but the Raptors -- like they did all night when Boston made a charge -- answered with a quick 8-0 spurt that was highlighted by consecutive 3s from McCaw and VanVleet.\n\n“Toronto just raised their level of intensity and we weren’t ready to handle it,” Brown said.\n\nThe Raptors also had a 12-point lead cut to five late in the third.\n\nToronto led by 10 after the third and Boston never threatened in the fourth.\n\nMcCaw’s 3-pointer made it 109-92.\n\nTIP INS\n\nRaptors: It was the fifth straight game that the trio of Siakam, Powell and Gasol was sidelined. … They shot 71.4 % (15 of 21) in the opening quarter and led by 11 at the break. … Toronto’s loss on Christmas was the first either team had won on the road in 13 tries.\n\nCeltics: Guard Marcus Smart returned after missing eight games with an eye infection that spread to both eyes. He hadn’t played since Dec. 6 and got a loud ovation when he entered midway into the opening quarter. He scored seven points in 23 minutes.\n\nBUZZER BEATERS\n\nSmart hit a 3 from the top of the key at the horn at the end of the first quarter and Walker hit one from the top closing the second.\n\nROLLER COASTER\n\nRaptors coach Nick Nurse talked about his team’s struggles without some key players the last few games.\n\n“We’ve had some up-and-down moments,” he said. “I think that’s been the hardest part of it -- consistency. We’ve seen it even in the same games. We’ve looked awesome in eight or 10 minutes and then we look like we can’t do anything right in three or four minutes.”\n\nTHAT’S NEWS TO ME\n\nWhen Boston coach Brad Stevens was asked about his team being the NBA’s top rebounding club for the month, he paused and said: “Us? Shocker.”\n\nHe didn’t have an explanation for the statistic.\n\n“I don’t know, the ball’s bounced our way, I guess,’’ he said. We haven’t changed anything on either side of the floor.”\n\nUP NEXT\n\nRaptors: Host the Oklahoma City Thunder on Sunday night.\n\nCeltics: At the Charlotte Hornets on New Year’s Eve afternoon.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995621.8954911
}