{
  "game_id": "0022300868",
  "espn_id": "401585496",
  "date": "Mar 02, 2024",
  "matchup": "MEM vs. POR",
  "headline": "Anfernee Simons scores 30 points, Trail Blazers beat Grizzlies 107-100 in OT",
  "body": "MEMPHIS, Tenn. -- — Anfernee Simons scored 20 of his 30 points in the second half and overtime and the Portland Trail Blazers beat the Memphis Grizzlies 107-100 on Saturday night after overcoming a 13-point deficit in the final nine minutes.\n\n\r\n              Jabari Walker finished with 18 points and 12 rebounds, while Toumani Camara added 15 points to help Portland sweep the two-game set after taking the opener 122-92 on Friday night. Ashton Hagans finished with 13 points and eight assists, while Dalano Banton scored eight his 10 points in overtime.\n\n\r\n              “I knew coming into the game that we were going to have to do everything we could,” Portland coach Chauncey Billups said. \"You beat a team like that ... at home, they're going to come out and swing. Throw every swing they can at you, and they did that.\n\n\r\n              Santi Aldama and Vince Williams Jr. each had 21 points for Memphis, which lost its fifth straight. GG Jackson added 17 points, and Aldama and Williams had eight rebounds each.\n\n\r\n              “We responded from (Friday),” Aldama said. “That was great. But I just felt like defensively, we weren't there. Offensively, we were stagnant.”\n\n\r\n              Memphis coach Taylor Jenkins characterized the 30-point loss Friday as “embarrassing.” While the Grizzlies were much more competitive Saturday, they were unable to hold a lead that was 78-61 after three quarters. Jenkins said the performance was “way more encouraging.”\n\n\r\n              “Simons is a really good player, and got some clean looks,” Taylor said about the fourth-quarter collapse. \"We didn't make enough shots in that fourth quarter. I thought we played great for the first three quarters. Then they went on a run to start the fourth.”\n\n\r\n              Memphis, with a lot of key players injured, has not closed games and let victories slip away as it did Saturday. Portland was actually down 18 in the early stages of the fourth, and still trailed by 13 with nine minutes left.\n\n\r\n              “I thought we stopped sharing the ball in that third quarter,” Billups said, adding he told his team to just try to get the deficit to single digits. “We did that, and so many guys played so well.”\n\n\r\n              Despite the Memphis double-digit lead, Portland tied it at 95 with 1.3 seconds to go on Walker's two free throws. Both teams missed lobs at the rim on the final possessions of regulation.\n\n\r\n              “I just felt like we were stuck. It’s been happening,” Aldama said. “We stopped playing the game that got us there.”\n\n\r\n              In overtime, Simons scored Portland's first basket before Banton took over, including a dunk as time ran out.\n\n\r\n              “Down 18 (in the fourth), it's big,” Hagans said. Now, it's just time to keep it going,\"\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Minnesota on Monday night.\n\n\r\n              Grizzlies: At Brooklyn on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996004.011223
}