{
  "game_id": "0022000352",
  "espn_id": "401267512",
  "date": "Feb 06, 2021",
  "matchup": "SAC vs. DEN",
  "headline": "Jokic scores 50 but Nuggets tripped up by Kings 119-114",
  "body": "SACRAMENTO, Calif. -- — Harrison Barnes had 28 points and seven rebounds to help offset a career-high 50 points by Denver’s Nikola Jokic, and the Sacramento Kings beat the Nuggets 119-114 on Saturday to complete a season sweep.\n\n\r\n                    Barnes made five 3-pointers, shot 10 of 16 overall and scored 13 points in the third quarter. Barnes also made a pair of free throws with 0.5 seconds remaining.\n\n\r\n                    The Kings have won six of seven after opening the season 5-10.\n\n\r\n                    “It’s hard work and trust that has led us to a turnaround,” coach Luke Walton said. “The group’s continued to believe in each other, believe in what we’re building. There’s just a confidence with the group and we’re giving ourselves chances.”\n\n\r\n                    Sacramento had four players with 21 points or more and rode Hassan Whiteside’s first double-double of the season to the win.\n\n\r\n                    The Kings needed it on a day Jokic had another monster game.\n\n\r\n                    “I was just really locked in,” said Jokic, who had matched his previous career high of 47 against Utah on Jan. 31. “We had a couple young guys in the game. I tried to help them a little bit. I don’t know if I did a good job or not. In the last quarter I was kind of aggressive.”\n\n\r\n                    Jokic just missed adding to his franchise record of 46 triple-doubles. The big man had 12 assists and eight rebounds and scored 23 points in the fourth quarter. But it wasn’t enough for the Nuggets, who lost their third straight.\n\n\r\n                    “More impressive than the 50 points, the 12 assists and the eight rebounds was his approach, his mindset, his leadership,” Denver coach Michael Malone said. “He knew we were undermanned. He understood how important this game was. Nikola goes out and does his job. He doesn’t care. We lost the game, that’s all he’s going to care about.”\n\n\r\n                    It was another tough blow for Denver. \n\n\r\n                    Two nights after being limited to 35 points in the second half when they wasted a double-digit lead and lost to the Lakers, the Nuggets stuck close in the first half before fading over the final 10 minutes.\n\n\r\n                    “We’re not out there just trying to let guys score. We just need a little more multiple effort,” said Monte Morris, who started in place of Jamal Murray. “First half the defense wasn’t too bad. Second half it kind of got away from us.”\n\n\r\n                    Jokic made a 3-pointer to cut Sacramento’s lead to 112-107 but De’Aaron Fox responded with a layup to help the Kings hold on.\n\n\r\n                    The Nuggets fell to 12-10. Three of the losses have come against the Kings.\n\n\r\n                    Sacramento first-round draft pick Tyrese Haliburton scored a season-high 23 points. Whiteside added 11 points and 11 rebounds, and Richaun Holmes had 21 points for the Kings. \n\n\r\n                    Paul Millsap added 14 points for Denver.\n\n\r\n                    Barnes scored seven straight points midway through the second quarter, and Haliburton made a 3-pointer with 30 seconds remaining to put the Kings ahead 53-52 at halftime.\n\n\r\n                    “Just our pace, being able to get out and run,” Barnes said. “Obviously they are a great offensive team, extremely well coached. For us, making sure our offense is sett up well to defend (is key).”\n\n\r\n                    HIELD’S 3-POINT STREAK ENDS\n\n\r\n                    Buddy Hield’s streak of consecutive games with at least one 3-pointer ended at 87 after the Kings guard went 0 for 9 beyond the arc. Hield’s streak was the longest active in the NBA. Walton was still impressed with Hield’s performance, which included seven assists and zero turnovers.\n\n\r\n                    “For us to be a good team we have to find ways to help us win when our shots aren’t going,” Walton said. “His shot was off tonight, so what did he do? He was selfless and he found other ways to help the team win. That’s a great sign.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Jokic had six assists in the first quarter. As a team, Denver had 16 assists in the first half after having 19 total against the Lakers on Thursday. … Murray (left knee) did not play for the second time this season. Gary Harris (left adductor strain) and Facundo Campazzo (right knee soreness) were also held out. Harris hasn’t played since a Jan. 31 win against Utah.\n\n\r\n                    Kings: Whiteside left the game with 6:40 left in the fourth quarter after it appeared he got poked in the eye.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Begin a four-game homestand against the Bucks on Monday. \n\n\r\n                    Kings: Visit the Clippers on Sunday. Los Angeles has won both games this season, although Sacramento swept a pair of games at Staples Center last season.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997183.563071
}