{
  "game_id": "0021500140",
  "espn_id": "400828027",
  "date": "Nov 14, 2015",
  "matchup": "HOU vs. DAL",
  "headline": "Felton helps short-handed Mavericks beat Rockets 110-98",
  "body": "HOUSTON -- Dallas Mavericks veteran point guard Raymond Felton danced his way down the court to his team's bench, wearing an ear-to-ear grin.\nLate in the fourth quarter, Felton scored seven straight to give his Dallas a 14-point lead in their 110-98 road victory over the Houston Rockets. Still smiling after the win and his best scoring night in two years, Felton downplayed the celebration.\n\n\"That wasn't a dance move, man,\" Felton said. \"It was just a little hop and a skip, that's all it was.\"\nEven Dallas coach Rick Carlisle admitted he was a fan of Felton's celebration.\n\"He was fired up,\" Carlisle said. \"I thought it was terrific. When you get one of those moments, you've got to enjoy it.\"\nIt was a long-awaited breakout game for the former star who has struggled with injuries and finding his role in recent years. Felton's hot shooting started early on Saturday in a shooting competition during warmups, when he outdueled fellow veteran role player Charlie Villanueva in a 3-point contest.\n\"I didn't want to hurt his confidence, so I let him win,\" Villanueva said with a laugh.\nVillanueva scored 19 points as the pair stepped up in the absence of a trio of starters in Dirk Nowitzki, Wesley Matthews and Chandler Parsons.\nEmotions ran high and plenty of hard fouls were shared between the in-state rivals. They met in the first round of the playoffs in April, where Houston won 4-1.\nElevated by Houston's poor defense and their own hot shooting, the Mavericks scored a season-high 57 first-half points.\nJames Harden led Houston with 25 points, 10 assists and seven rebounds, and Terrence Jones had 23 points. The Rockets fell to 1/3 this season in games played without center Dwight Howard, who rested on Saturday night.\nThe Mavericks took advantage of Howard's absence by dominating the Rockets in paint scoring, 54-40, and out-rebounding the Rockets 46-43.\nAfter a four-game winning streak followed their slow 0-3 start, Houston has now lost three straight again and is on the verge of its first four-game losing streak since the 2012-13 season.\n\"This is as bad as it can get, I hope,\" Rockets coach Kevin McHale said. \"I can't imagine it getting much worse than that.\"\nDallas led by as many as 26 in the first half before Houston finally started to hit shots in the third quarter, outscoring the Mavericks 33-25 in that period after trailing 57-34 at halftime. Despite multiple rallies in the second half, Houston never pulled within single digits.\nFormer Maverick Jason Terry scored 19 points off the bench for Houston and drew a flagrant foul trying to block Dwight Powell's layup in the third quarter. With an opportunity to cut into the lead late in the game, Terry air-balled a 3-pointer and caught playful trash-talk from his former teammate Nowitzki, who was nearby on the bench.\n---\nTIP-INS\nMavericks: Nowitzki sat out his first game of the season. ... Felton's points were his most since the 2012-13 season.\nRockets: Houston scored a season-low 34 points in the first half. ... The Rockets lost to Dallas at home for the first time since 2013. ... Howard was sidelined on Saturday night for a planned game of rest. Houston was also without PG Patrick Beverley (ankle) and Sam Dekker (back).\nHONORING VICTIMS IN PARIS\nThere was a pre-game moment of silence in the Toyota Center for those impacted by the terrorist attacks in Paris. The Rockets waved the French flag on multiple screens. Houston second-year center Clint Capela grew up in Chalon, France, and played high school basketball just outside of Paris.\nROUGH STUFF\nHarden was called for a flagrant foul after driving to the basket and throwing an elbow that caught Felton in the face.\nThe game ball had to be replaced by a backup in the second half after it was contaminated with an unknown player's blood.\nCLUTCH CITY\nThe Rockets debuted their sleeved \"Clutch City\" uniforms featuring font inspired by the franchise's \"ketchup-and-mustard\" jerseys of the 1980s and their championship years in 1993-94 and 1994-95. The red and yellow uniforms featured white \"Clutch City\" script on the front.\nUP NEXT\nMavericks: Dallas visits Philadelphia and Boston on Monday and Wednesday nights.\nRockets: Houston hosts Boston on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994668.243916
}