{
  "game_id": "0022000389",
  "espn_id": "401267549",
  "date": "Feb 10, 2021",
  "matchup": "MIL @ PHX",
  "headline": "Suns rally to beat Bucks 125-124 despite Giannis' 47 points",
  "body": "PHOENIX -- — The All-Star backcourt of Chris Paul and Devin Booker is starting to get comfortable for the Phoenix Suns. Now they're beating good teams, piling up wins and rising quickly in the Western Conference.\n\n\r\n                    Booker scored 30 points, Paul added 28 points and seven assists and the Suns extended their winning streak to four games by rallying to beat the Milwaukee Bucks 125-124 on Wednesday night.\n\n\r\n                    Booker and Paul combined for 15 points in a tight fourth quarter.\n\n\r\n                    “It’s tough for other teams,” Paul said. “You don’t know what to take away. Most teams have one primary defender so who you gonna put him on? Me or Book? We’re learning to play off of each other.”\n\n\r\n                    Milwaukee had its five-game winning streak snapped despite getting a season-high 47 points from Giannis Antetokounmpo. The Bucks had a chance to win on the final possession, but Antetokounmpo missed a 20-foot jumper at the buzzer.\n\n\r\n                    “To get it to Giannis, to be at the top of the key with the court spread, you attack or get a shot,” Bucks coach Mike Budenholzer said. “He got a pretty good look.”\n\n\r\n                    The Suns have won seven of eight and have a 15-9 record.\n\n\r\n                    Phoenix struggled to slow the Bucks’ offense, especially in the first three quarters. Milwaukee has scored at least 120 points in every game over their past six. Antetokounmpo made 15 of 23 shots from the field, including 15 of 19 from inside the arc, finishing all night on layups and dunks.\n\n\r\n                    The Suns took their first lead of the second half at 104-101 when Paul made a 3-pointer with 11 minutes left in the fourth quarter. Frank Kaminsky made another long ball less than a minute later to push the Suns ahead 107-101.\n\n\r\n                    Booker made a step back 3-pointer with 2:30 left to put the Suns up 124-116 but the Bucks pulled to 124-122 with a minute left on Khris Middleton's corner 3. Antetokounmpo flushed a dunk on the next possession to tie it at 124 with 50 seconds left.\n\n\r\n                    Booker made a free throw with 32 seconds left that proved to be the difference.\n\n\r\n                    “It’s a big win for us,” Suns coach Monty Williams said. “We don’t take wins like this for granted.”\n\n\r\n                    The teams fought to a 32-all tie in the first quarter before the Bucks caught fire from 3-point range and scored 39 points in the second. Milwaukee took a 71-59 lead into the break after shooting 13 of 24 (54%) from long range. \n\n\r\n                    Bryn Forbes and Antetokounmpo led the Bucks with 17 points each. Forbes — who was making just his second start of the season — made 5 of 6 3-pointers.\n\n\r\n                    NATIONAL ANTHEM\n\n\r\n                    Suns coach Monty Williams said he understands both sides of the debate on playing the national anthem before sporting events, but said he “enjoys” the song during the pregame. \n\n\r\n                    The Suns have played the anthem at all home games this season, even when fans weren't in attendance.\n\n\r\n                    “I’ve also experienced the anthem in the World Cup and the Olympics, which was one of the coolest things I’ve ever been a part of, was hearing our anthem in a foreign country before you compete or at the end when you win,” Williams said. “So for me, as much as I can appreciate both sides of the coin, it does hold a special place in my heart because of what I’ve experienced.”\n\n\r\n                    Dallas Mavericks owner Mark Cuban and the NBA made news earlier this week when reports surfaced that the anthem hadn't been played at the team's first 11 home games.\n\n\r\n                    Cuban relented Wednesday and the anthem will be played before home games this season after the NBA reiterated its “longstanding league policy” to include the song. \n\n\r\n                    HOLIDAY OUT\n\n\r\n                    Bucks guard Jrue Holiday missed a second straight game because of the league's health and safety protocols. Coach Mike Budenholzer said he's been in touch with Holiday while he's been out.\n\n\r\n                    “Spoke with Jrue a lot over the past few days,” Budenholzer said. “He's in a good place and he's taking care of himself, but he has an eye on the team too.”\n\n\r\n                    Holiday started the season's first 23 games and is averaging 16.4 points.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Backup forward Bobby Portis had 10 points and nine rebounds in the first half. ... Antetokounmpo made 17 free throws, which was easily a season high. He also shot 17 of 21 on his free throws, which is much higher than his 61% season average.\n\n\r\n                    Suns: The Suns shot 61% from the field in the first quarter. ... The Suns are expanding ticket capacity to 3,000 fans starting with Tuesday's game against the Nets. They've allowed up to 1,500 fans in the arena for the past three games. ... Jae Crowder had 14 rebounds. ... Kaminsky added 14 points, eight rebounds and eight assists.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Continue their road trip at Utah on Friday.\n\n\r\n                    Suns: Continue their homestand against the 76ers on Saturday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997401.513539
}