{
  "game_id": "0021900566",
  "espn_id": "401161208",
  "date": "Jan 09, 2020",
  "matchup": "OKC vs. HOU",
  "headline": "Westbrook scores 34 in return, but Thunder roll past Rockets",
  "body": "OKLAHOMA CITY --  The Oklahoma City Thunder spoiled Russell Westbrook's return.\n\nWestbrook scored 34 points, but the Thunder beat the Houston Rockets 113-92 on Thursday night.\n\nWestbrook was a league MVP and two-time scoring champ for the Thunder before being traded to the Rockets last summer for Chris Paul and draft picks.\n\nThe fans remember him as the star who stayed after Kevin Durant left for then-rival Golden State in 2016, and they showered him with appreciation before the game. There was a tribute video, then loud cheers as he was introduced with enthusiasm, in the same manner as a home Thunder player. The crowd stood, cheered loudly and even chanted M-V-P as the announcer moved on to other players. Westbrook even ran over to a corner of the court and exhorted the crowd before the tip, just like he did when he played for the Thunder.\n\n\"Some things you can't put into words,\" Westbrook said. \"I've been here for so long and so many great memories, great people. The absolute best fans in the world because they come with it, and tonight they came with it.\"\n\nThe atmosphere also lifted the Thunder.\n\n\"The energy was amazing,\" Paul said. \"Our first nationally televised game and Russ being back so we knew that the crowd -- I mean the crowd is always great, but we knew it was going to be a different energy tonight with Russ' first game back here and I mean, you've got to get excited during the player intros. Shai (Gilgeous-Alexander) and I were just sitting over there talking about, you know, 'All right, let's get to it.\"\n\nIt was a strange day for Westbrook. He said he had never even seen the visiting locker room during his 11-year run in Oklahoma City. It was a bit odd for him early in the game when the crowd that he so often riled to a fever pitch was cheering for the other team during a run that put the Rockets on their heels.\n\n\"Definitely different, but once you start hooping and competing, you kind of zone it out a little bit,\" he said.\n\nWestbrook scored 18 points in the first half, but the Thunder led 60-48 at the break after shooting 53.8% from the field. The Thunder extended their lead throughout the second half. Westbrook was subbed out with 7:18 remaining.\n\nDanilo Gallinari led the Thunder with 23 points and 11 rebounds and Gilgeous-Alexander added 20 points.\n\nHouston's James Harden, who entered the night averaging a league-best 38.5 points, was held to 17 on 5-for-17 shooting.\n\nAfter the game, Westbrook embraced several Thunder players, then went over and hugged Thunder owner Clay Bennett. He acknowledged the crowd one last time before he exiting on the opposite end of the floor from his days as a Thunder player.\n\nWestbrook was the last remaining player from the team that began playing in Oklahoma City in 2008 after the franchise left Seattle.\n\n\"I don't regret one thing being here in Oklahoma City,\" he said. \"I don't regret signing back, I don't regret staying here. I don't regret anything that I did here. I feel like I left everything out on the floor every single night and did what I could for the city.\"\n\n---\n\nTIP-INS\n\nRockets: Harden wore shoes with Thunder colors as part of an Adidas campaign. ... The Rockets made just 11 of 40 3-pointers. ... Another former Thunder player, Thabo Sefolosha, entered the game in the fourth quarter. ... Houston's point total was a season low.\n\nThunder: Oklahoma City shot 53.8% in the first quarter to take a 37-21 lead. It was the Thunder's highest-scoring opening quarter of the season. ... Paul scored 18 points and Dennis Schroder added 16. ... Thunder G Hamidou Diallo was issued a technical foul in the fourth quarter.\n\nOKC's SPECIAL UNIFORMS\n\nThe Thunder wore special gray and gold City Edition uniforms. They were designed in partnership with the Oklahoma City National Memorial & Museum to commemorate the upcoming 25th anniversary of the April 19, 1995, bombing of the Alfred P. Murrah Federal Building in downtown Oklahoma City.\n\nQUOTABLE\n\nWestbrook: \"The fans here, the people, they never did me no wrong. I have nothing, no bad blood, nothing here in this city from no fans or nobody in this organization because they gave me all they have, and I gave them all I have.\"\n\nSTAT LINES\n\nHouston's starters outside of Westbrook and Harden scored a combined 14 points on 5-for-16 shooting.\n\nUP NEXT\n\nRockets: Host Minnesota on Saturday night.\n\nThunder: Host the Los Angeles Lakers on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996224.60499
}