{
  "game_id": "0021701167",
  "espn_id": "400975913",
  "date": "Apr 03, 2018",
  "matchup": "SAC @ PHX",
  "headline": "Suns end franchise-worst skid at 15, beat Kings 97-94",
  "body": "PHOENIX --  On track to finish with their worst record since their inaugural season 50 years ago, the Phoenix Suns finally closed out an opponent and won again.\n\nJosh Jackson scored 18 of his 28 points in the first half and the Suns ended a franchise-record, 15-game losing streak with a 97-94 victory over the Sacramento Kings on Tuesday night.\n\n\"It was a win that we really, really wanted,\" Jackson said.\n\nAlex Len added 17 points and 15 rebounds, and Tyler Ulis had 13 points and nine assists as the Suns held the cold-shooting Kings to 37 percent shooting.\n\nThe Kings trailed by as many as 12 in the fourth quarter but had a chance to tie after forcing a turnover with 7 seconds remaining. Bogdan Bogdanovic and Justin Jackson missed potential game-tying 3-pointers before the final buzzer.\n\n\"It was scary. I don't really know how they got that open,\" Josh Jackson said. \"We didn't execute the game plan as well as we should have but lucky they didn't make the shot.\"\n\nBogdanovic led the Kings with 22 points and Jackson added 19 points and eight rebounds. Sacramento has lost five of six.\n\nThe Suns have the NBA's worst record at 20-59 and will finish with the second-lowest win total in 50 years of existence unless they win all three remaining games.\n\nSacramento trailed by just four to start the final 12 minutes. The Suns built a 12-point lead with 4:19 left and held on for their first win since Feb. 28, and first home victory since Jan. 31 against Dallas.\n\n\"It's a great learning experience for our guys. These guys are in a tough situation and I thought we played well for most of the game,\" coach Jay Triano said. \"I'm glad we learned with a `W' this time instead of a loss.\"\n\nThe Suns made just two of their first 11 shots in the game's first five minutes, but the score was tied at 22 at the end of the first quarter.\n\nJosh Jackson had 10 points in the opening quarter.\n\nThe Suns went ahead 37-26 on big man Len's 3-pointer with 6:41 left in the first half. It was Len's first 3 of the season and after smiling as he backpedaled on defense, he was subbed out moments later and shared a laugh with Triano.\n\n\"I just felt good coming down the floor,\" Len said. \"My defender was all the way in the paint. I was like, `I'll just take my chances.\"\n\nThe Kings responded with nine unanswered points, but needed Willie Cauley-Stein's 8-footer just before the halftime buzzer to be down 46-40 at halftime.\n\nPhoenix led by as many as 14 early in the third quarter but the Kings rallied to cut the lead to four with three consecutive 3-pointers. Justin Jackson's half-court heave went in but was ruled to be released after the quarter buzzer, and the Suns led 73-69.\n\n\"The margin of error is very small when you're down seven or eight with 90 seconds to go,\" Kings coach Dave Joerger said. \"We had a fighting chance there at the end.\"\n\nTIP-INS\n\nKings: G Vince Carter appeared to hurt his right ankle trying to defend a drive to the basket and fell to the floor late in the second quarter. He later returned. ... F Skal Labissiere did not play due to a sprained ankle. ... G De'Aaron Fox had a career high nine rebounds. ... Former NFL running back and 1995 Heisman Trophy winner Eddie George attended the game.\n\nSuns: G Devin Booker missed his ninth straight game with sprained right hand. ... The Suns were also without key players T.J. Warren (knee) and Elfrid Payton (knee), but Len returned after missing three games with a left ankle sprain. ... A pregame moment of silence was held for former Suns player Alton Ford, who died of cancer. Ford was drafted by the Suns in 2001 and spent two seasons with the team.\n\nSTEAL AND SERVE\n\nUlis made the play of the night midway through the third quarter when he stole the ball from Bogdanovic in the open court, fell down, got back up while keeping his dribble, spun and dished to teammate Dragan Bender for a dunk.\n\nDANIELS HURT\n\nThe Suns lost guard Troy Daniels to a right ankle sprain after he limped off with 5:14 to play in the half and didn't return. But Triano said Daniels should be fine in a couple of days.\n\nUP NEXT\n\nKings: Friday at Memphis.\n\nSuns: Host New Orleans Friday.",
  "source": "espn_api",
  "crawled_at": 1764993222.087154
}