{
  "game_id": "0022201099",
  "espn_id": "401469254",
  "date": "Mar 24, 2023",
  "matchup": "TOR vs. DET",
  "headline": "Siakam scores 32 as Raptors rout struggling Pistons 118-97",
  "body": "TORONTO -- — Pascal Siakam scored 32 points, Chris Boucher had 19 points and 13 rebounds and the Toronto Raptors routed the struggling Detroit Pistons 118-97 on Friday night for their eighth win in nine home games.\n\n\r\n              Fred VanVleet added 18 points and O.G. Anunoby 17 as Toronto completed its first four-game sweep of Detroit since the 2017-18 season.\n\n\r\n              The Raptors also improved to 7-0 when holding opponents below 100 points, and bounced back from Wednesday’s disappointing home loss to Indiana.\n\n\r\n              “In that game, we just didn’t come out with as much energy as we usually do,” Siakam said of the defeat to the Pacers. “We just made it a point to come out and be aggressive and set the tone early.”\n\n\r\n              Boucher shot 7 for 14 off the bench, went 2 for 5 from 3-point range and had two blocks and a steal in 29 minutes.\n\n\r\n              “He’s best, we’re best, when he’s just flying around,” Raptors coach Nick Nurse said. “It’s a little wild sometimes. It’s fun to watch. He’s blocking shots. He’s trying to dunk everything, he’s hoisting up 3s.”\n\n\r\n              Jaden Ivey scored 20 points and Marvin Bagley III and James Wiseman each had 14 for Detroit, but the Pistons lost for the 16th time in 17 games.\n\n\r\n              “I feel like our effort was horrible tonight,” Ivey said. “We’ve just got to have more effort.”\n\n\r\n              Detroit has the NBA’s worst record at 16-58. The Pistons are 7-29 on the road, the worst mark in the Eastern Conference.\n\n\r\n              “We’ve got to all look ourselves in the mirror and say, ‘Is our spirit there?’” Ivey said. “That’s the most important thing when you step out there on the floor.”\n\n\r\n              Toronto played its second straight game without forward Scottie Barnes (left wrist), guard Gary Trent Jr. (right elbow) and forward Precious Achiuwa (right hamstring).\n\n\r\n              The Raptors had won the three previous meetings with Detroit by a combined nine points, but were never challenged in this one. The Pistons led 3-1 after Bagley completed a 3-point play in the first minute, but VanVleet restored Toronto’s lead with a 3 and the Raptors never trailed again.\n\n\r\n              “They were like a machine to start the game,” Pistons coach Dwane Casey said of Toronto. “That was the difference between the first three games and this game.”\n\n\r\n              VanVleet scored 10 points in the first and Toronto led 38-26 after one.\n\n\r\n              “Fred played like a pro,” Casey said. “He took us out of what we wanted to do.”\n\n\r\n              Siakam made seven of 10 attempts in the second and scored 17 points as the Raptors extended their lead to 72-52 at the half. Toronto took a 92-73 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Ivey made nine turnovers. … Shot 6 for 25 from 3-point range. ... R.J. Hampton scored 13 points. ... Bagley had nine rebounds. ... G Cory Joseph (non-COVID illness) and G Rodney McGruder (right foot) were not available, joining long-term absentees Bojan Bogdonovic (left Achilles), Alec Burks (left foot), Cade Cunningham (left leg), Hamadou Diallo (right ankle) and Isaiah Stewart (left shoulder). ... F Isaiah Livers started after missing the previous four games because of right hip soreness. He finished with 12 points.\n\n\r\n              Raptors: Siakam had nine assists and Jakob Poeltl had 11 rebounds. ... Made eight 3-pointers in the first half, one more than they had in all of Wednesday’s home loss to Indiana. ... Scored 22 points off 23 Detroit turnovers.\n\n\r\n              DRESS FOR SUCCESS\n\n\r\n              Trent sat on the bench wearing a black jacket adorned with Raptors logos and bearing his name and jersey number on the back.\n\n\r\n              DOUBLING HIS PLEASURE\n\n\r\n              Boucher has 32 career double-doubles off the bench, the most in Raptors history.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Milwaukee on Monday.\n\n\r\n              Raptors: Host Washington on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994014.398222
}