{
  "game_id": "0021800473",
  "espn_id": "401071154",
  "date": "Dec 21, 2018",
  "matchup": "MIL @ BOS",
  "headline": "Antetokounmpo scores 30, Bucks beat Celtics 120-107",
  "body": "BOSTON --  The Milwaukee Bucks turned their slow start into a long, frustrating night for the Boston Celtics.\n\nGiannis Antetokounmpo scored 30 points and got the Bucks rolling on an early 16-0 run that put Milwaukee in command for good in a 120-107 win over the short-handed Celtics on Friday night.\n\n\"We just tried to play a bit harder, a bit sharper,\" said Antetokounmpo, who also had eight rebounds and five assists.\n\nKhris Middleton had 21 points and nine rebounds, Tony Snell scored 15 and Thon Maker added 12 points for Milwaukee, which has won six of seven.\n\nAfter falling behind 10-1 in the first quarter, Antetokounmpo got Milwaukee's first field goal 2:99 into the game on a dunk that started the Bucks on a 16-point run and dazed the Celtics, who never recovered.\n\n\"We haven't lost twice to the same team this year,\" Antetokounmpo said. \"It's a good feeling, coming in here and getting a win in here because they play so well at home.\"\n\nKyrie Irving had 15 points, nine rebounds and seven assists for the Celtics, whose frustrations after their third straight loss carried over and led to a lengthy closed-door meeting in the locker room after the game.\n\n\"It is something that we will keep in the locker room,\" said Jayson Tatum, who scored 20 for Boston. \"It's not something for everybody to know what we talked about. We just have to be better as a team.\"\n\nThe Celtics were missing their top two centers and forward Marcus Morris. Milwaukee capitalized on its advantage inside all night.\n\n\"As you dig a hole against them, it's hard to come back. They're a heck of a team,\" Boston coach Brad Stevens said.\n\nMalcom Brogdon had 10 points and nine rebounds and Antetokounmpo pulled down eight boards for the Bucks, who finished with a 55-36 rebounding advantage. Boston also sent Antetokounmpo to the foul line 17 times, and he made 13 free throws.\n\nWith Milwaukee controlling the paint, the Celtics were forced outside and made just 10 of 34 attempts from 3-point range and were 34 for 91 overall.\n\n\"They missed a lot of shots,\" Bledsoe said. \"I'm pretty sure they got a pretty good amount up -- they just missed a lot of them. We did a great job of scrambling tonight.\"\n\nThe Celtics have lost three straight since winning eight in a row.\n\nJaylen Brown scored 21 for Boston. Gordon Hayward had 11 points and and Semi Ojeleye finished with 10 points, getting the start at center with Al Horford and Aron Baynes both out with injuries.\n\nMilwaukee dominated the first half after the slow start, using a 9-0 run late in the second quarter to pull ahead by as much as 26 points.\n\nBoston made a few runs in the second half but was never able to get the margin closer than 11.\n\nBrown's dunk with 9:43 left pulled Boston within 97-82, but he was called for a technical for flexing his muscles after the dunk and Brogdon made the ensuing free throw.\n\nBrown made a 3-pointer to cut the lead to 103-90, and then Rozier made a steal and started on a fast break with Hayward, who spun a layup off the backboard while drawing a foul. Hayward missed the free throw and a chance at the three-point play.\n\nTALK IT OUT\n\nBoston's locker room remained closed for nearly 40 minutes after the game ended. Players wouldn't get into specifics about what was said, but it was clear that inconsistent play following the eight-game winning streak was one of the topics discussed.\n\n\"It was well needed,\" Brown said. \"It was definitely well needed and we're trying to move forward in the right direction.\"\n\nKNOCKOUT\n\nLL Cool J was sitting courtside and got a big cheer when he showed up on the monitor as his song \"Mama Said Knock You Out\" blasted through the public address system.\n\nTIP-INS\n\nBucks: Antetokounmpo scored Milwaukee's first 14 points in the third quarter. ... The Bucks also out-rebounded the Celtics 31-13 in the first two periods and led 65-48 at halftime. Milwaukee shot 63 percent (12 for 19) in the first quarter and led 35-22 after one. ... F Ersan Ilyasova had surgery Friday on his nose, which he broke during practice last weekend. Ilyasova, who is averaging 7.5 points and 5.5 rebounds, is out indefinitely.\n\nCeltics: Morris has a sore right knee and did not dress. ... Horford missed his seventh straight game with a sore left knee. ... Baynes has a broken finger on his left hand. He underwent surgery on Thursday and is expected to be out four to six weeks. ... Boston made a franchise-record 24 3-pointers in the first meeting, beating the Bucks 117-113 on Nov. 1.\n\nUP NEXT\n\nBucks: Visit the Miami Heat on Saturday night.\n\nCeltics: Host the Charlotte Hornets on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994503.35361
}