{
  "game_id": "0022300667",
  "espn_id": "401585295",
  "date": "Jan 29, 2024",
  "matchup": "MIL @ DEN",
  "headline": "Jokic gets triple-double, Nuggets spoil Doc Rivers' debut as Bucks coach with 113-107 win",
  "body": "DENVER -- — Doc Rivers saw the same thing coaching from the sideline Monday night as he did watching from his couch all season — a talented Milwaukee team that just needs a little more time to take shape.\n\n\r\n              Also, that Nikola Jokic continues to be next-level at everything he does. \n\n\r\n              Jokic spoiled Rivers' debut as Milwaukee coach by recording his 14th triple-double of the season to help the Denver Nuggets surge by the Bucks, 113-107. \n\n\r\n              “They’re great,” Rivers said of his new squad. “They’re a very coachable team.”\n\n\r\n              Jokic finished with 25 points, 16 rebounds and 12 assists. Jamal Murray scored 35 for the Nuggets, who gained separation during a late 8-0 run.\n\n\r\n              The game was a chance for Rivers to size up his built-to-win-now club. Bucks players made an instant impression with him — and he on them. \n\n\r\n              “He did a great job commanding the team, leading the team,” forward Khris Middleton said. “It's going to take time for us to get used to him and him to see what we’ve been doing and how we’ve been successful so far this season and in the past.”\n\n\r\n              Rivers was lured out of his role as an analyst to take over for first-year Bucks coach Adrian Griffin, who was fired after 43 games and a 30-13 record. \n\n\r\n              Embarking on his 25th season as an NBA head coach, Rivers alternated between arms folded, hands on his knees and hands on hips in moving up and down the sideline. He kneeled at times, clapped, consulted with Joe Prunty, the interim coach before Rivers' arrival, and even showed frustration over a foul called on Brook Lopez late in the game for an illegal screen. \n\n\r\n              Rivers watched his new team squander an early 13-point lead, fall behind by nine and then fight back before Aaron Gordon ended the comeback by blocking Damian Lillard's layup attempt with 24.7 seconds remaining.\n\n\r\n              The game featured 12 ties and nine lead changes. \n\n\r\n              “I mean, that’s why I play — to play these kinds of games, to play under the pressure, to play tight games,” Jokic said. “I like to play under those circumstances.”\n\n\r\n              The win was a milestone for Michael Malone — victory No. 400 as coach of the Nuggets. \n\n\r\n              The significance?\n\n\r\n              “It means that I’ve been here a long time,” Malone cracked.\n\n\r\n              Giannis Antetokounmpo had 29 points and 12 rebounds for the Bucks, who began a five-game trip. The “Greek Freak” played nearly 37 minutes despite dealing with an illness that had his availability up in the air leading into the game. Had he missed the contest, it would’ve been the second straight game in which an NBA MVP didn’t play at Ball Arena. On Saturday, reigning MVP Joel Embiid was a late scratch for Philadelphia because of a balky left knee. \n\n\r\n              But Antetokounmpo treated the capacity crowd to a high-flying exhibition (and was called for a 10-second violation on a free throw that electrified fans). He was named the NBA player of the week for the East earlier in the day.\n\n\r\n              “I try to thrive in those moments as much as I can,\" Antetokounmpo said of going against players such as Jokic. “And learn as much as I can.\"\n\n\r\n              Lopez had 19 points, including five of Milwaukee's 16 3-pointers. Lillard finished with 18 points. \n\n\r\n              Rivers conceded it will take a minute to settle in on the bench as he steadily meshes his style with the way the Bucks already play. He wants them flowing along and not overthinking.\n\n\r\n              One thing he doesn't have to remind them of — just how good they are. The Bucks feature several holdovers, led by Antetokounmpo, from the team that won the NBA championship in 2020-21.\n\n\r\n              “They already know what the goal is,” Rivers said. \"And they all know that the only way you reach that goal is it has to be ‘We’ — as a group.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Lillard returns to Portland on Wednesday to face his former team. He spent 11 seasons with the Trail Blazers.\n\n\r\n              Nuggets: Play at Oklahoma City on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996124.028036
}