{
  "game_id": "0021800770",
  "espn_id": "401071443",
  "date": "Feb 01, 2019",
  "matchup": "CHA vs. MEM",
  "headline": "Walker scores 23, Hornets beat depleted Grizzlies 100-92",
  "body": "CHARLOTTE, N.C. --  At both ends of the court, the Charlotte Hornets had too much at the end for the Memphis Grizzlies.\n\nKemba Walker scored 23 points, Marvin Williams hit two key 3-pointers and Bismack Biyombo swatted away a pair of late shots as the Hornets beat the depleted Memphis Grizzlies 100-92 Friday night.\n\nMemphis suited up just 10 healthy players and was minus star Mike Conley, who sat because of soreness in his left knee. Starters Kyle Anderson and Jaren Jackson Jr. were also sidelined.\n\nWilliams' 26-foot shot with 2:55 left tied it, and his deep jumper 38 seconds later gave the Hornets the lead for good at 93-90.\n\n\"They were playing us the same,\" said Williams, who finished with 16 points. \"I was just able to make those shots. I wasn't doing that early on.\"\n\nMalik Monk, who scored 14 of his 20 points in the fourth quarter, had two 3-pointers in the final period. The Hornets were shooting just 36.8 percent from 3-point land through the third quarter.\n\n\"Marvin was great, Malik was great,\" Hornets coach James Borrego said. \"The second half especially, just getting downhill and getting to the rim. Knocking that shot down, (Malik) is getting more and more comfortable down there. He looks really confident shooting the ball right now. So give those two guys a lot of credit.\"\n\nBiyombo, who finished with seven rebounds and three blocks, had just one point but made a difference on the defensive end. The 6-foot-9 center blocked JaMychal Green's dunk attempt with 1:48 to go and swatted away a layup attempt by Shelvin Mack 20 seconds later.\n\n\"I think we struggled to find a bucket down the stretch,\" Grizzlies coach J.B. Bickerstaff said. \"They had guys in Kemba, Tony Parker, those guys that are used to having the ball in their hands in big moments. We struggled from the offensive end to find a bucket. That was able to give them the opportunity down the stretch.\"\n\nParker finished with 15 points and seven assists for Charlotte.\n\nCharlotte had a tough time matching Memphis' energy and effort at the start, and Borrego said he didn't think his team \"came out with the right spirit.\"\n\nBut Monk and Williams came up big when the Hornets needed it.\n\n\"We expect that from those guys,\" Walker said. \"When teams are covering me the way these guys are covering me nowadays we expect guys to come in and make shots and Marv was huge and Malik was huge.\"\n\nMack led Memphis with 19 points and nine assists, Justin Holiday and Ivan Rabb added 15 points each and Joakim Noah and Green each had 10 points for the Grizzlies.\n\nTIP-INS\n\nGrizzlies: Memphis also was without Omri Casspi (right knee) and Garrett Temple (shoulder). . Memphis has lost 28 of its last 36 games and 17 of its last 19 since Dec. 26. . Marc Gasol, who averages 15.7 points per game, didn't score until late in the second quarter. He finished with eight points and six rebounds.\n\nHornets: Charlotte swept the series for the second year in a row. . Parker was listed as questionable ahead of the game after missing Wednesday's contest with a sore ankle but was cleared to play late Friday. ... Charlotte shot just 35 percent from the field in the first quarter and turned the ball over four times, resulting in nine points for Memphis. . Starter Jeremy Lamb, who finished with six points, played just six minutes in the first half, missing his first four shots.\n\nZELLER CLOSE\n\nHornets center Cody Zeller, who had surgery in early January to repair a broken right hand after being injured Dec. 31 against Orlando, is \"close\" to returning, Borrego said. \"How close I can't be specific yet, but we're getting there. He looks great,\" Borrego said. Zeller was averaging 9.3 points and 6.2 rebounds per game before getting hurt.\n\nSTAYING TOUGH\n\nDespite a losing record and a 14th place standing in the Western Conference, Bickerstaff says he's happy with his team's effort. \"Our guys don't lay down,\" he said. \"We may get beat, whatever may happen, but most nights -- every now and then you have that NBA night -- but most nights you're going to have to take it from us if you want to beat us.\"\n\nUP NEXT\n\nHornets: Host Chicago Bulls on Saturday.\n\nGrizzlies: Visit the New York Knicks on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994376.897124
}