{
  "game_id": "0021800813",
  "espn_id": "401071486",
  "date": "Feb 07, 2019",
  "matchup": "TOR @ ATL",
  "headline": "Siakam, VanVleet set career highs to lead Raptors past Hawks",
  "body": "ATLANTA --  The Toronto Raptors have a new big man coming to help their push for the top spot in the Eastern Conference.\n\nIn the meantime, the Raptors won by playing small.\n\nPascal Siakam scored a career-high 33 points, Fred VanVleet added a career-best 30 and the Raptors rallied after trailing by 17 points in the first half to beat the Atlanta Hawks 119-101 on Thursday night.\n\nToronto, which pulled within 1  1/2 games of Eastern Conference leader Milwaukee, acquired center Marc Gasol from Memphis before Thursday's trade deadline for Jonas Valanciunas, C.J. Miles and Delon Wright, and a 2024 second-round draft pick. The team should learn Friday when to expect Gasol's arrival.\n\n\"There are a lot of positives that come with a guy like Gasol and I think most of them come with being battle-tested,\" said Raptors coach Nick Nurse. \"He's got a hell of a career under his belt.\"\n\nThe Raptors were short-handed after trading four players in two deals. Toronto also traded center Greg Monroe to the Nets for cash considerations.\n\nToronto used only nine players and relied heavily on Siakam, who also had 13 rebounds, and VanVleet with All-Star Kawhi Leonard resting.\n\nRookie Trae Young and Taurean Price each had 19 points for Atlanta.\n\nAtlanta led 66-49 in the second quarter.\n\n\"I give them credit, man, they came out guns a blazing,\" Nurse said of the Hawks.\n\nAfter their big deficit, the Raptors used an 11-0 run to launch their comeback. Danny Green, who had 12 points, sank three free throws to cap the run.\n\nToronto kept the momentum in the third quarter and led 88-85 entering the final period. The Raptors opened the fourth quarter with a 13-3 run to extend the lead in their third straight win.\n\nThe Hawks scored 68 points in the first half and only 33 after halftime.\n\n\"We thought it was going to come easy for us in the second half and it didn't,\" said Hawks coach Lloyd Pierce, who added, \"Finish has been a key word for us all year. ... I thought we were complacent.\"\n\nKyle Lowry had 13 points while making only 3 of 13 shots from the field. He had 13 assists.\n\nTIP-INS\n\nRaptors: Leonard was held out with a sore left knee. ... Siakam scored 17 points in the second quarter. ... Siakam had 30 points at Milwaukee on Jan. 5. VanVleet's previous high was 25 points.\n\nHawks: John Collins had 12 points and 12 rebounds. ... With his sixth point, Vince Carter tied Jerry West for 21st on the NBA's career scoring list (25,192). Carter finished with nine points. ... The Hawks were forced to waive G Daniel Hamilton, who had averaged 3.0 points in 19 games, to accommodate the trades. ... Atlanta's modest two-game winning streak ended. It has not won more than three straight games this season.\n\nWELCOME TO TORONTO\n\nLowry said he was sorry to see the exits of four teammates but was eager to have Gasol join the team. He said he exchanged texts with Gasol after the trade.\n\n\"Marc's a hell of a basketball player,\" Lowry said. \"... It's going to be very cool. He knows he's going to a good opportunity.\"\n\nHAWKS DEALS\n\nThe Hawks plan to release two players acquired in separate deals, Shelvin Mack and Jabari Bird. The Hawks traded Tyler Dorsey to Memphis for Mack and acquired Bird and cash from the Celtics for a conditional 2020 second-round draft pick. Bird hasn't played this season after being charged with beating up his girlfriend.\n\nENERGY AND POINTS\n\nSiakam downplayed his big scoring night.\n\n\"I guess it's cool,\" he said, adding his emphasis was, \"Just bringing energy. That's more important to me than getting the points.\"\n\nUP NEXT\n\nRaptors: Visit Knicks on Saturday night.\n\nHawks: Host Hornets on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994259.939878
}