{
  "game_id": "0022200840",
  "espn_id": "401468995",
  "date": "Feb 10, 2023",
  "matchup": "MIA vs. HOU",
  "headline": "Butler's dunk at end gives Heat 97-95 win over Rockets",
  "body": "MIAMI -- — The play was drawn up by assistant coach Chris Quinn during a Miami Heat scrimmage at the NBA restart bubble in 2020. A lob to the rim off an inbounds pass, and the result was a Jimmy Butler dunk.\n\n\r\n              When that happened, Butler hung on the rim, pointed to Heat coach Erik Spoelstra and demanded it be used in a game.\n\n\r\n              Almost three years later, the play — “CQ\" on Spoelstra's game sheet, the initials of its inventor — finally got used. And it worked.\n\n\r\n              Gabe Vincent threw an alley-oop inbounds pass to Butler for a dunk with 0.3 seconds remaining, giving the Heat a 97-95 win over the Houston Rockets on Friday night for their eighth consecutive home win.\n\n\r\n              “It took us about three years to get back to it,\" Spoelstra said. “That's one of those benefits of all the time we had in the bubble.\"\n\n\r\n              Tyler Herro had 31 points, nine rebounds and eight assists for the Heat, who won despite scoring only 39 second-half points. Bam Adebayo scored 20 points, Butler had 10 of his 16 points in the fourth and Max Strus added 14 for Miami.\n\n\r\n              “Any way to get a win, at this point in the season, it's all about wins,\" Herro said. “We'll take one any way we can get one.\"\n\n\r\n              Jabari Smith Jr. scored 22 points for the Rockets. Kenyon Martin Jr. had 17 and Alperen Sengun added 12. Jalen Green had 11 points, including a game-tying layup with 0.7 seconds left.\n\n\r\n              But Miami called time, Vincent threw the lob and Butler ended up on his back — after the game-winner. The Heat swept the season series with the Rockets, winning two games by a combined five points.\n\n\r\n              “There was confusion whether we were switching or not,\" Rockets coach Stephen Silas said of the final play. “I said in the huddle, ‘Stay home, stay home, stay home.' And we didn't stay home, and it was an avalanche after that. ... We've got to learn these lessons.\"\n\n\r\n              It was Houston’s first game since being involved in trade-deadline deals — sending Eric Gordon to the Los Angeles Clippers in a three-team move that landed the Rockets Danny Green, and picking up Justin Holiday and Frank Kaminsky in another.\n\n\r\n              “We are going to have the most cap space this summer of any team in the NBA, I believe. ... We’re going to have a lot of room to sign free agents, to make trades into that space, to really transform the team,” Rockets general manager Rafael Stone said. “And we decided that we’re really, really valuing that flexibility. Within that context, we think that we improved the team.”\n\n\r\n              But the acquisition of John Wall, as expected, was essentially just to make salary math work. Barring a major change in thinking, his return to the Rockets only exists on paper.\n\n\r\n              “We do intend, at this time, to waive John,” Stone said.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Houston's 28-game streak of allowing at least 100 points ended. ... The Rockets — as many teams have done this season when the schedule allows — are making a mini-vacation out of their trip to Miami. They’re not scheduled to leave town until Sunday. Some practice time before leaving Miami is planned.\n\n\r\n              Heat: Jamaree Bouyea got his first basket, making him the 278th player to score in a Miami uniform. ... Udonis Haslem missed the game for personal reasons. ... Kyle Lowry missed his third consecutive game with left knee soreness and won’t play on Saturday either. It wouldn’t seem likely that he plays again before the All-Star break.\n\n\r\n              MORE 3s\n\n\r\n              The first five baskets of the game were 3-pointers — three by Miami, two by Houston. Miami was 8 for 20 from beyond the arc in the first half, after going 6 for 19 in the entirety of Wednesday’s win over Indiana. Miami ended up 12 for 38 on 3s, exactly doubling the numbers against the Pacers.\n\n\r\n              CLANK\n\n\r\n              The third quarter score was Rockets 17, Heat 17. The 34 combined points was the third-fewest in a third quarter this season — the Heat and Brooklyn combined for 31 on Jan. 8, and the Nets and Boston combined for 32 on Dec. 4.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Visit Philadelphia on Monday.\n\n\r\n              Heat: Visit Orlando on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993944.670507
}