{
  "game_id": "0022200932",
  "espn_id": "401469087",
  "date": "Feb 28, 2023",
  "matchup": "LAC vs. MIN",
  "headline": "McDaniels has 20 points, Timberwolves beat Clippers 108-101",
  "body": "LOS ANGELES -- — Jaden McDaniels isn't the first player that comes to mind when mentioning key players on the Minnesota Timberwolves' roster, but the forward is proving to be a problem for the Los Angeles Clippers.\n\n\r\n              The third-year forward had his second straight strong game against the Clippers, scoring 20 points Tuesday night in the Timberwolves' 108-101 victory that snapped a three-game losing streak.\n\n\r\n              “This is a big win, We lost two games we could have won. This time we were able to get stops,” said McDaniels, who had 18 points in the last meeting against the Clippers on Jan. 6. \n\n\r\n              It is the fourth time this season McDaniels has had a 20-point game. He is averaging 11.6 points this season, but 15.4 over the past five games.\n\n\r\n              The Timberwolves (32-32) moved up to eighth in the Western Conference while the Clippers (33-31) remained sixth. The fourth through 10th spots are separated by only three games.\n\n\r\n              “Everybody played really well and that’s what we’ve been waiting for,” Timberwolves coach Chris Finch said. “We've been hit and miss with guys but we really needed an effort like tonight.”\n\n\r\n              Anthony Edwards added 18 points and Rudy Gobert scored 16, including a key dunk in the final minute. \n\n\r\n              Paul George had 25 points and Kawhi Leonard 23 for the Clippers, who have dropped three straight. Los Angeles' last two losses before Tuesday came in overtime, including a 176-175 double-overtime loss Friday night to Sacramento in the second highest-scoring game in NBA history.\n\n\r\n              “We just got to continue to drill it,\" George said. \"New guys here, new rotations, new personnel. We got to drill it. Once we get it well get back to what we were doing before the break. I have no concern on that end.\" \n\n\r\n              The Clippers had 25 turnovers that led to 29 Minnesota points. The Timberwolves also had a 60-38 advantage in points in the paint.\n\n\r\n              “We just got to get guys used to playing with one another, but we just can’t have the careless turnovers,\" coach Tyronn Lue said. \"Those are the ones that kill you, and we had it under control for awhile but now we gotta get it back.”\n\n\r\n              The Timberwolves opened up a 88-75 lead with 11:20 remaining in the fourth quarter. The Clippers slowly whittled away and got to 105-101 after a 3-pointer by Russell Westbrook with 42.2 seconds remaining, but Gobert's dunk on the ensuing trip down the floor quashed any hopes of a Los Angeles rally.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Naz Reid and Kyle Anderson had 12 points apiece. ... Took first lead with 5:39 remaining in the second quarter on Taurean Prince's layup that was set up after a steal by Mike Conley to make it 45-44. Minnesota led at halftime 58-56. \n\n\r\n              Clippers: Westbrook had 14 points, 10 assists and seven rebounds. ... Norman Powell had 13 points off the bench, and also was called for a technical foul in the third quarter. ... Ivica Zubac had 12 points and nine rebounds after missing the last two games due to a right calf injury. ... Jumped out to a 32-20 lead late in the first quarter as they shot 12 of 23 during the first 12 minutes. ... Committed 12 turnovers in the first half that resulted in 18 Timberwolves' points. \n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Los Angeles Lakers on Friday night.\n\n\r\n              Clippers: At Golden State on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994959.6044412
}