{
  "game_id": "0022200414",
  "espn_id": "401468569",
  "date": "Dec 14, 2022",
  "matchup": "CHA vs. DET",
  "headline": "Burks, Pistons spoil Ball's return to floor with OT win",
  "body": "CHARLOTTE, N.C. -- — Alec Burks scored a season-high 27 points off the bench, Killian Hayes added 25 and the Detroit Pistons spoiled LaMelo Ball’s return to the floor with a 141-134 overtime victory against the Charlotte Hornets on Wednesday night.\n\n\r\n              Bojan Bogdanovic had 24 points and Isaiah Stewart chipped in with 19 points and 11 rebounds for Detroit (8-22). Jalen Duren grabbed 18 rebounds as the Pistons snapped a three-game losing streak.\n\n\r\n              Burks had five points in overtime, including his fourth 3-pointer of the game with 1:47 left to put the Pistons up for good.\n\n\r\n              “We know what he is going to do,” Hayes said of Burks, now in his 12th NBA season. “He has been through these situations and he definitely gave us a lift in overtime.”\n\n\r\n              Kelly Oubre Jr. scored 28 points to lead the Hornets, while Terry Rozier added 25, although he was just 2 of 13 from beyond the arc.\n\n\r\n              Ball had with 23 points on 9-of-18 shooting to go along with 11 assists in his first game since Nov. 16 due to a sprained left ankle. He fouled out with 29.6 seconds left in regulation, and his presence was missed in overtime as the Hornets (7-21) were outscored 14-7.\n\n\r\n              Ball said he felt some pain in his ankle during the game and felt a step slow.\n\n\r\n              The 21-year-old point guard looked rusty early on with five of his first six 3-point attempts hitting the front rim.\n\n\r\n              “It was legs and stuff, just getting back into it,” Ball said.\n\n\r\n              But he began to heat up early in the fourth quarter, knocking down back-to-back 3s, including a fadeaway in the left corner, to trim Detroit’s lead to five. Ball then drove the lane and dished to Jalen McDaniels up top for a 3-pointer to tie it just under 10 minutes left in regulation.\n\n\r\n              “He’s really talented and we had three quarters scoring 30 or more,” Hornets center Mason Plumlee said. “It’s great to have him back.”\n\n\r\n              With the game tied late, Bogdanovic missed a fall-away jumper and the Hornets grabbed the rebound and called a timeout with 1.3 seconds left in regulation to set up a side inbounds play. But Rozier’s off-balance 3 from the corner rattled around the rim and out at the buzzer, sending the game to overtime.\n\n\r\n              Detroit dominated in OT with Ball out of the game.\n\n\r\n              Burks and Hayes drained consecutive 3s to give Detroit a 138-134 lead with 1:11 left.\n\n\r\n              “When you get an overtime win like that, it shows character,” Hayes said.\n\n\r\n              Hornets coach Steve Clifford ripped into his team after the game, expressing his dissatisfaction with the defensive effort. \n\n\r\n              “Until we care about something besides how many points we score, we’re not going to win much,” Clifford said in an opening statement before leaving without taking questions from reporters. “We are playing no defense — not one guy. There’s not a bright spot. We don’t run back on defense, we don’t guard the ball, our pick-and-roll stuff. ... All we care about is scoring. That’s it.\"\n\n\r\n              Said Ball: “We have to lock in on defense and figure that out. As soon as we do we will turn this thing around.”\n\n\r\n              SILAS REMEMBERED\n\n\r\n              The Hornets honored former coach Paul Silas, who died Saturday, with a moment of silence and a video tribute before the game. The team will wear a commemorative “Silas” patch on the left sleeve of its pullovers for the remainder of the season.\n\n\r\n              Silas spent eight seasons with the Hornets and is third in club history in games coached (401), games won (193) and winning percentage (.481).\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Made 18 3-pointers.\n\n\r\n              Hornets: McDaniels had a rather embarrassing moment when he received a backdoor bounce pass from Plumlee and attempted a one-handed dunk, only to have the ball bounce off the rim and sail over the team's bench and out of bounds.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Sacramento on Friday night.\n\n\r\n              Hornets: Host Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994282.748766
}