{
  "game_id": "0022400499",
  "espn_id": "401705065",
  "date": "Jan 06, 2025",
  "matchup": "MEM vs. DAL",
  "headline": "Jaren Jackson Jr. scores 35 points to lead Grizzlies past Mavs 119-104",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 35 points, 13 rebounds and five assists to lead the Memphis Grizzlies to a 119-104 victory over the Dallas Mavericks on Monday night.\n\n\r\n              Scotty Pippen Jr. finished with 18 points, while Jaylen Wells added 17 points and 11 rebounds as Memphis won for the 10th time in the last 11 home games.\n\n\r\n              P.J. Washington led the Mavericks with 17 points and 10 rebounds. Naji Marshall finished with 16 points, while Klay Thompson and Jaden Hardy added 15 points each. Dallas has lost five straight.\n\n\r\n              The Mavericks already were without leading scorer Luka Doncic with a left calf strain, and earlier Monday, Dallas announced that backcourt mate Kyrie Irving will miss time with a bulging disk in his back. That meant both teams were without their starting backcourts as injuries kept Ja Morant and Desmond Bane out for the Grizzlies.\n\n\r\n              Takeaways\r\n              Mavericks: With Doncic and Irving both out with injuries, Dallas was missing its top two scorers and 52.4 points a game. Then the Mavericks lost Daniel Gaffor to a left ankle sprain in the second quarter. \n\n\r\n              Grizzlies: Memphis got in an early deficit with turnovers and poor shooting, but righted things with better control of the offense through the final three quarters.\n\n\r\n              Key moment\r\n              Memphis had taken the lead to 13 early in the fourth, its biggest of the game at that point, but Dallas began relying on 3-pointers to get within five points near the seven-minute mark. Memphis went on a 10-2 run to take the lead back to 13 with 2:12 left.\n\n\r\n              Key stat\r\n              Memphis, which is second in the league in points in the paint, finished with 52 points inside and outrebounded Dallas 55-50, including 13 offensive boards.\n\n\r\n              Up next\r\n              The Mavericks host the Lakers on Tuesday. The Grizzlies host Houston on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997906.192715
}