{
  "game_id": "401809790",
  "espn_id": "401809790",
  "date": "Nov 21, 2025",
  "matchup": "CLE vs IND",
  "headline": "Mitchell scores 32, Garland adds 20 in return as Cavaliers beat Pacers 120-109 in NBA Cup",
  "body": "CLEVELAND -- — Donovan Mitchell scored 32 points, Darius Garland had 20 in his return to Cleveland's lineup and the Cavaliers pulled away in the second half for a 120-109 victory over the Indiana Pacers in an NBA Cup game on Friday night.\n\n\r\n              It was the first meeting between the teams since the Pacers eliminated the top-seeded Cavaliers in five games in last season’s Eastern Conference semifinals.\n\n\r\n              Evan Mobley added 22 points and 12 rebounds for the Cavaliers, who improved to 2-1 in East Group A.\n\n\r\n              Andrew Nembhard had a career-high 32 points for injury-plagued Indiana, which fell to 0-2 in group play. Pascal Siakham added 26 points and nine rebounds and Bennedict Mathurin scored 21 points.\n\n\r\n              The NBA finalists from a year ago are 2-14 and missing six players. Indiana has dropped nine of its last 10.\n\n\r\n              Garland missed five games due to a contusion on the left big toe that he had surgically repaired in June.\n\n\r\n              The two-time All-Star point guard played 26 minutes and scored 18 points in the first half. He finished 5 for 12 from the field, including three 3-pointers, and made all seven of his free throws.\n\n\r\n              The Cavaliers led 62-55 at halftime before they went on a 21-9 run over a four-minute span in the third quarter to take control. Jalen Tyson scored eight of his 14 points during the spurt, which pushed their advantage up to 16 midway through the quarter.\n\n\r\n              Cleveland's largest lead was 103-81 on Mitchell's pullup 3-point early in the fourth quarter. It was the ninth time in 15 games this season the All-Star guard has scored at least 30 points.\n\n\r\n              Indiana made a 16-4 run to get within 10 with five minutes remaining, but could not draw closer.\n\n\r\n              Up Next\r\n              Pacers: Host Detroit on Monday.\n\n\r\n              Cavaliers: Host LA Clippers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042665.1408892
}