{
  "game_id": "0021501145",
  "espn_id": "400829032",
  "date": "Apr 03, 2016",
  "matchup": "OKC @ HOU",
  "headline": "Harden's 41 lead Rockets past Thunder 118-110",
  "body": "HOUSTON -- When Oklahoma City Thunder coach Billy Donovan was asked what went on in his team's most recent fourth-quarter collapse, he had a quick answer:\n\"James Harden is what happened late,\" Donovan said.\nHarden scored 15 of his 41 points in the final quarter and had nine assists overall to help the Houston Rockets improve their playoff chances with a 118-110 win Sunday.\nOklahoma City lost its league-leading 13th game in which it held a fourth-quarter lead. The Thunder led by six early in the fourth until Harden hit back-to-back 3s to tie the game at 93.\nWith 30 seconds left, Harden stole a pass from Kevin Durant and found Patrick Beverley for a transition dunk to give Houston an eight-point lead and the Rockets held on for an important victory.\n\"We were just all in attack mode, making play after play, putting pressure on every single player,\" Harden said. \"It was very important for us.\"\nHarden scored 15 points in the fourth quarter for his 11th 40-point game of the season, trailing only Stephen Curry's 12.\nThe inconsistent Rockets have alternated wins and losses for six straight games as they desperately chase a trip to the postseason.\nDurant had 33 points and eight rebounds for the Thunder. Durant blamed the loss on the fact that Houston had 22 offensive rebounds and scored 21 second-chance points.\n\"They shot 20 more shots than us,\" Durant said. \"Defensively, we were good, and in our half-court, they really couldn't score on us. But they got second-chance points.\"\nAfter posting seven triple-doubles in the month of March, Russell Westbrook had 23 points, 13 rebounds and fell one assist shy of picking up his 17th triple-double of the season. Westbrook was much more combative with questions regarding blown fourth-quarter leads.\n\"I don't agree with us `losing the lead' if we're up two points going into the fourth quarter because, to me, that's not losing the lead,\" Westbrook said. \"To me, that doesn't make any sense. I think we've been doing a good job of playing well and closing out games, so I'm not worried about that.\"\nOklahoma City lost for just the second time in the past three weeks and had won nine of its previous 10 entering Sunday.\nSitting ninth in the West behind Utah and Dallas in seventh and eighth, Houston closes out the season with games against Dallas, Phoenix, the Lakers and Sacramento.\nBoth teams started off slow. They missed a combined 10 of their first 12 shot attempts and committed a total of 15 first-half turnovers. The Rockets got going with hustle around the rim.\nOn a second-quarter possession, Houston missed six shots and gathered offensive rebounds every time until Dwight Howard ended it with a dunk to put the Rockets up 33-30.\n\"Shots weren't going in, but we didn't sulk and hang our heads,\" Rockets coach J.B. Bickerstaff said. \"We went and got the ball back, and we got another look at it.\"\nHouston held a five-point lead at the end of the first quarter after Jason Terry hit a 3-pointer with 1 second remaining.\nThe Thunder finished the second quarter on a 7-0 run, capped by a layup from Westbrook that put Oklahoma City up 53-52 at the half.\nOklahoma City built its largest lead of the game midway through the third quarter, going up 12. Houston briefly regained the lead until Durant closed out the quarter with three consecutive free throws to give the Thunder an 82-80 lead entering the fourth.\nTIP-INS\nThunder: Oklahoma City had 21 turnovers, Houston had 10. ... Enes Kanter scored 16 points off the bench for Oklahoma City in just 18 minutes. ... For the sixth time in the past seven games, Nick Collison did not play.\nRockets: SG K.J. McDaniels played a season-high 18 minutes and scored 10 points. ... Andrew Goudeluck played for the first time since March 14, picking up two points and two steals in nine minutes. ... PF Terrence Jones was the only active Rockets player who didn't play; he has been out since Feb. 29.\nFINAL FOUR IN HOUSTON\nThe Rockets have five players who played in at least one Final Four in college, including a representative in each of the past five Final Four weekends. Rookie Sam Dekker represented Wisconsin the past two years, Montrezl Harrell played for Louisville's championship team in 2013, Terrence Jones played for Kentucky in 2011 and won a title the next year. Additionally, Corey Brewer won two titles with Florida in 2006 and 2007, and Jason Terry won one at Arizona in 1997.\nKENNY \"THE JET\"\nThe Rockets honored former player and current commentator Kenny \"The Jet\" Smith with a video presentation and framed painting commemorating his two championships with the franchise in 1993-94 and 1994-95. Smith was in Houston for the Final Four and sat midcourt next to Rockets owner Les Alexander.\nUP NEXT\nThunder: Visit Denver on Tuesday.\nRockets: Visit Dallas on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994123.4608278
}