{
  "game_id": "0022101109",
  "espn_id": "401360928",
  "date": "Mar 26, 2022",
  "matchup": "TOR vs. IND",
  "headline": "Raptors rout Pacers after fire causes delay, fan evacuation",
  "body": "TORONTO -- — Pascal Siakam scored 23 points and the Toronto Raptors routed the depleted Indiana Pacers 131-91 on Saturday night in a game delayed 70 minutes in the first half because of a speaker fire that forced the evacuation of fans.\n\n\r\n              Scottie Barnes added 19 points, Precious Achiuwa 18, OG Anunoby 16, Chris Boucher 15 and Thad Young 11 as the Raptors posted their biggest margin of victory this season.\n\n\r\n              Oshae Brissett led Indiana with 21 points. Justin Anderson had 18, Jalen Smith 15 and Buddy Hield 14. The Pacers have lost three straight and five of seven.\n\n\r\n              No one from the sellout crowd of 19,800 was around at end to see Toronto move past Cleveland into sole possession of sixth place in the Eastern Conference after the Cavaliers lost 98-94 in Chicago. The Raptors are one game behind the fifth-place Bulls with eight games remaining.\n\n\r\n              Sixth place is the last guaranteed postseason spot, with teams finishing in the Nos. 7-10 spots headed for the play-in tournament.\n\n\r\n              In the first quarter, two sections of fans behind the basket at the east end of the stadium were cleared and Toronto Fire Services personnel could be seen in the empty aisles, staring at the ceiling.\n\n\r\n              “I was like, ‘Jeez, I wonder why they didn’t sell those seats tonight?’ That was my first thing,” Raptors coach Nick Nurse said. “Then I saw the firemen standing there.”\n\n\r\n              Later, another section was cleared as play continued. Before long, video surfaced on social media of flames coming out from a speaker hanging above the stands.\n\n\r\n              Pacers acting head coach Lloyd Pierce said he spoke to lead official Zach Zarba about the acrid smell coming from the burning speaker.\n\n\r\n              “You could definitely smell it,” Pierce said. “By the time (the game) stopped the smell was tough.\n\n\r\n              “Fifteen years for me, probably the most bizarre situation that we’ve been in for a game,” Pierce added.\n\n\r\n              During a timeout, public address announcer Herbie Kuhn announced that the arena was being evacuated at the order of Toronto Fire Services, telling booing fans that the game had been suspended.\n\n\r\n              Players headed to their locker rooms with 4:05 left in the second quarter and the Raptors leading 66-38.\n\n\r\n              Brissett, who is from Toronto, had a large crowd of people on hand to watch him play at home but they all had to leave.\n\n\r\n              “I got a whole bunch of texts from friends, family,” Brissett said. “They were really mad.”\n\n\r\n              During the delay, two workers using ropes and harnesses hung from the ceiling and sprayed a fire extinguisher at the problematic speaker.\n\n\r\n              Remaining ushers and arena security staff cheered when the Raptors returned to warm up for the restart. The halftime break was cut from 15 minutes to 7 1/2 minutes, and players did not leave the court during the intermission.\n\n\r\n              “It was crazy,” Achiuwa said. “I’ve never been in a game like that.”\n\n\r\n              Toronto guard Fred VanVleet, who missed two games earlier this month because of a sore right knee, did not return following the restart.\n\n\r\n              This was the latest instance of fan-free basketball for the Raptors, who played to no more than a few hundred fans at home games between Dec. 31 and Mar. 1 because of Ontario government restrictions related to the COVID-19 pandemic.\n\n\r\n              Anunoby and Siakam combined for 22 points in the first, one more than the Pacers had as a team, and Toronto closed the quarter with a 23-5 spurt to lead 41-21.\n\n\r\n              “We definitely came out really flat,” Brissett said.\n\n\r\n              Ahead 66-38 when the game was suspended, Toronto led 74-46 at halftime.\n\n\r\n              HURTING PACERS\n\n\r\n              Indiana guard Malcolm Brogdon (conditioning) sat for the fourth straight game, while guard Chris Duarte (left big toe) missed his fifth straight, and forward Isaiah Jackson (headache) missed his second straight. The Pacers were also without center Goga Bitadze, who sat because of a sore right foot.\n\n\r\n              CHECKING ON COACH\n\n\r\n              Pacers coach Rick Carlisle missed his second straight game for personal reasons. Pierce said he’d checked in with Carlisle since a loss Thursday night at Memphis.\n\n\r\n              “We just keep it professional, but he’s doing well,” Pierce said. “He’s concerned about us but we’re concerned about him as well.”\n\n\r\n              SIX PACK\n\n\r\n              Toronto is 15-4 when six or more players score in double digits.\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Smith returned after missing the past two games because of a non-COVID illness. … Indiana is 9-29 on the road. The Pacers went 3-5 away from home in March.\n\n\r\n              Raptors: G Gary Trent Jr. (left big toe) sat for the third straight game but is “pretty close” to a return, Nurse said. … Signed G Armoni Brooks to a multi-year contract. Brooks had previously signed two 10-day contracts with Toronto.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Atlanta on Monday night.\n\n\r\n              Raptors: Host Boston on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992702.496916
}