{
  "game_id": "0021900928",
  "espn_id": "401161570",
  "date": "Mar 05, 2020",
  "matchup": "SAC vs. PHI",
  "headline": "Harris scores 28 as Sixers beat Kings to end long road skid",
  "body": "SACRAMENTO, Calif. --  Tobias Harris had 28 point and 14 rebounds and the short-handed Philadelphia 76ers beat the Sacramento Kings 125-108 on Thursday night for their first road win in more than a month.\n\nShake Milton scored 20 points and Al Horford had 18 points, eight rebounds and six assists for the Sixers, who also won in Sacramento for the first time since 2015. Alec Burks added 17 points and Raul Neto had 16.\n\nDe'Aaron Fox had 23 points and seven assists for Sacramento. Buddy Hield scored 22.\n\nPhiladelphia ended its nine-game road losing streak while continuing to play without Joel Embiid and Ben Simmons. Embiid sat out a fourth straight game because of a left shoulder sprain, while Simmons missed his sixth straight with a nerve impingement in his back.\n\nThe Sixers, who were also without Josh Richardson, never trailed and took a 16-point lead into the fourth quarter before hanging on for their first road win since Jan. 20 at Brooklyn.\n\n\"When you hear a date like that, you're reminded of enough is enough,\" Sixers coach Brett Brown said. \"To try to find a way to win on the road, we felt a sense of urgency tonight and I'm happy for the guys. Their spirit and their physicality, I thought, were excellent.\"\n\nPhiladelphia still had to sweat it out after Hield and Harrison Barnes made back-to-back 3-pointers to pull the Kings within 112-106 with five minutes remaining.\n\nHarris ended Sacramento's run with a short jumper and Horford followed with a dunk and two free throws. Philadelphia closed the game with a 13-2 run.\n\n\"We took the level of physicality that we were playing with, we wanted to enhance it tonight,\" Harris said. \"They made some runs and we were able to combat that just with different guys making big plays and big shots. It was a good win for us, especially on the road.\"\n\nHarris nearly had a double-double by halftime, and his 19 points before the break was one more than he had total two nights earlier in a loss to the Lakers.\n\nSacramento coach Luke Walton changed things up in the third and went to a small lineup that helped the Kings get within 84-78.\n\nThat was as close as they got, and Walton blamed his team's 18 turnovers that led to 22 points for the Sixers.\n\n\"It was kind of how we approached the game for some reason,\" Walton said. \"There's always going to be turnovers that the other team forces. But it seems like tonight that there were four or five that were completely uncharacteristic of us.\"\n\nTIP-INS\n\n76ers: Richardson took part in shooting drills before the game but did not play. Richardson remains sidelined with a concussion he suffered while colliding with teammate Alec Burks on Sunday.\n\nKings: Richaun Holmes continues to make progress and could return within the next few days. Holmes has missed 25 games with a right shoulder injury. . Kent Bazemore was hit with a technical foul in the fourth quarter.\n\nSTAT STAR\n\nHorford finished the game with a plus-41 in 36 minutes, a remarkable achievement that left his coach awed. \"It's kind of an almost unheard of number,\" Brown said. \"He was that dominant, not because he had like 40 points. It's just defensively he really was excellent and offensively he was efficient. Al, really, from a holistic standpoint was our bell-ringer.\"\n\nUP NEXT\n\n76ers: At Golden State on Saturday.\n\nKings: At Portland Trail Blazers on Saturday. Sacramento has lost 12 straight at Moda Center.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996382.8341289
}