{
  "game_id": "401810057",
  "espn_id": "401810057",
  "date": "Nov 10, 2025",
  "matchup": "CHI vs SA",
  "headline": "Wembanyama scores 38 points as the Spurs rally past the Bulls for a 121-117 victory",
  "body": "CHICAGO -- — Victor Wembanyama scored 18 of his 38 points in the fourth quarter, and the San Antonio Spurs beat the Chicago Bulls 121-117 on Monday night for their third consecutive win.\n\n\r\n              Wembanyama also grabbed 12 rebounds and blocked five shots. The 7-foot-4 center made six 3-pointers and went 11 for 19 from the field in San Antonio's first win at Chicago since March 17, 2021.\n\n\r\n              He became the first player in NBA history with at least 35 points, 10 rebounds, five assists, five blocked shots and five 3-pointers in a game.\n\n\r\n              De’Aaron Fox scored 21 points for the Spurs in his second game of the season. Stephon Castle had 19 points and 11 assists, and Luke Kornet finished with 16 points.\n\n\r\n              Chicago dropped to 5-1 at home. It has lost four of five overall.\n\n\r\n              The Bulls played without guard Josh Giddey, who was sidelined by a right ankle injury. Kevin Huerter stepped into the starting lineup and finished with 23 points.\n\n\r\n              Chicago had a 104-91 lead before Wembanyama put together a personal 10-0 run. He made a fadeaway jumper and a 3-pointer to get San Antonio within three with 7:05 left.\n\n\r\n              The Spurs went ahead to stay with a late 10-0 run. Wembanyama made two big 3s, and Castle's two foul shots made it 119-114 with 18 seconds remaining.\n\n\r\n              The Bulls shot 28% (7 for 25) from the field in the fourth, compared to 43.5% (10 for 23) for the Spurs.\n\n\r\n              Ayo Dosunmu and Tre Jones each scored 20 points for Chicago. Jalen Smith had 11 points and 12 rebounds.\n\n\r\n              The Bulls used a 10-2 run to open a 95-85 lead with 1:15 left in the third quarter. Huerter's 3-pointer gave the Bulls a 98-89 lead going into the final period.\n\n\r\n              Up next\r\n              Spurs: Host Golden State on Wednesday night in the first of two consecutive home games against the Warriors.\n\n\r\n              Bulls: At the Detroit Pistons on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042598.779979
}