{
  "game_id": "0022400217",
  "espn_id": "401704783",
  "date": "Nov 13, 2024",
  "matchup": "ORL vs. IND",
  "headline": "Franz Wagner scores 29 points, Magic beat Pacers 94-90 to improve to 6-0 at home",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 29 points, Jalen Suggs hit two free throws with 9.8 seconds left and the Orlando Magic beat the Indiana Pacers 94-90 on Wednesday night to remain unbeaten at home.\n\n\r\n              Orlando is 6-0 at home this season and has won 13 in a row overall at home.\n\n\r\n              Pascal Siakam led Indiana with 29 points. Bennedict Mathurin added 23 points — scoring 12 straight Pacers points late in the fourth quarter — and 12 rebounds. Tyrese Haliburton had with nine points and 12 assists.\n\n\r\n              Goga Bitadze added 12 points and 12 rebounds for the Magic. Anthony Black came off the bench for six points, six assists, four steals and a block.\n\n\r\n              Takeaways\r\n              \r\n              Pacers: The Pacers survived a scoreless half by Haliburton to lead 45-41, but the NBA’s third-best 3-point shooting team could not survive 10-for-30 shooting from behind the arc.\n\n\r\n              Magic: The Magic relied on defense (10 blocks, eight steals, 38% Indiana shooting).\n\n\r\n              Key moment\r\n              The Pacers had a four-point lead and momentum in the opening seconds of the fourth quarter when Black blocked a layup by Johnny Furphy, igniting a 13-1 Orlando run. Indiana did not score in the fourth quarter until Siakam hit a 3-pointer at 7:26.\n\n\r\n              Key stats\r\n              Bitadze, Jonathan Isaac (11) and rookie Tristan daSilva (9) led Orlando to a 50-41 rebounding advantage.\n\n\r\n              Up next\r\n              \r\n              The Pacers return home to face Miami on Friday night. The Magic host Philadelphia on on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997579.707691
}