{
  "game_id": "0022400969",
  "espn_id": "401705535",
  "date": "Mar 15, 2025",
  "matchup": "OKC @ DET",
  "headline": "Shai Gilgeous-Alexander scores 48 points and Thunder hold off Pistons 113-107",
  "body": "DETROIT -- — Shai Gilgeous-Alexander scored 48 points and the Oklahoma City Thunder beat the Detroit Pistons 113-107 on Saturday night.\n\n\r\n              Gilgeous-Alexander shot 17 of 26 from the floor, including 4 of 6 from 3-point range, and added six assists and three steals for Oklahoma City, which won for the ninth time in 10 games.\n\n\r\n              Cason Wallace added 20 points for Thunder, and Isaiah Hartenstein had 12 points and 10 rebounds.\n\n\r\n              Detroit's Cade Cunningham matched a season low with 11 points on 5-of-18 shooting before being ejected for arguing calls late in the third quarter. \n\n\r\n              Tobias Harris led the Pistons with 18 points, while reserve Dennis Schroder had 17 points and 11 assists in place of Cunningham.\n\n\r\n              Detroit trailed 91-75 until Malik Beasley's buzzer-beating layup at the end of the third quarter. His 3-pointer pulled the Pistons within 98-97 with 4:16 left.\n\n\r\n              Gilgeous-Alexander answered with a 3, a runner in the lane and a layup to make it 106-100 with 2:07 left before setting up Wallace for a clinching 3-pointer.\n\n\r\n              Takeaways\r\n              Thunder: Luguentz Dort left after appearing to injure himself slipping on the court with 48 seconds left in the third quarter. He didn't play in the fourth quarter.\n\n\r\n              Pistons: Held a moment of silence before the game for Junior Bridgeman, who died Monday at 75. Bridgeman played 12 NBA seasons, mostly for the Bucks, then became a highly successful businessman. \n\n\r\n              Key moment\r\n              The Pistons were called for five technicals in the third quarter, including three during an extended argument with 48 seconds left in the period. Cunningham received both of his at that point, along with Schroder. Oklahoma City ended up with four points on the possession, increasing its lead from 11 to 15.\n\n\r\n              Key stat\r\n              The Pistons made 50% (8 of 16) of their first-half 3-point attempts and held the Thunder to 22.7% (5 of 22) from behind the arc, but still trailed 55-54 at the half. Oklahoma City had a 7-2 edge on the offensive glass and forced 11 turnovers, while only committing seven.\n\n\r\n              Up next\r\n              The Thunder play Sunday in Milwaukee, while Detroit is in New Orleans on Monday. —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997665.886555
}