{
  "game_id": "0022000091",
  "espn_id": "401267251",
  "date": "Jan 03, 2021",
  "matchup": "LAC @ PHX",
  "headline": "George scores 39 points, Clippers hold off Suns 112-107",
  "body": "PHOENIX -- — Paul George scored 39 points and the Los Angeles Clippers held on to beat the Phoenix Suns 112-107 on Sunday night after nearly blowing a 31-point lead in a matchup of two of the Western Conference’s top early season teams. \n\n\r\n                    At 5-2, the Clippers are tied with the Suns and Los Angeles Lakers for the West lead. \n\n\r\n                    George was 7 of 10 from 3-point range and Los Angeles was 17 of 29 overall. Kawhi Leonard added 15 points, but shot 4 of 21 from the field, and Luke Kennard came off the bench to add 14 points. \n\n\r\n                    “I had to be aggressive and stay in attack mode,” George said. “It is not going to be everybody’s night every night. I had to step up and help our best player on the team, help Kawhi. My job is to help him lead and help him score and give him a break from time to time.” \n\n\r\n                    Devin Booker led Phoenix with 25 points, and Deandre Ayton added 24. Chris Paul, who played six seasons for the Clippers, had 15 points, nine rebounds and six assists. They had won four in a row and 13 of 14 dating to their perfect run in the NBA bubble. \n\n\r\n                    Los Angeles opened the second quarter with 15 straight points to make it 50-24. George, Kennard and Reggie Jackson each had five points in the run. The Clippers pushed the lead to 31 at 60-29 with 6:28 left in the half and led 64-44 at the break. \n\n\r\n                    Phoenix cut it to 88-81 at the end of the third. In the fourth quarter, Phoenix pulled within a point at 90-89 on Cameron Johnson’s 3-pointer with about 10 minutes left. \n\n\r\n                    “It was obviously not the start we wanted,\" Suns coach Monty Williams said. “They came out shooting the heck out of the ball. Even the 3s they made were off the dribble with a hand in their face. It is like, `What defense do you have for that.'”\n\n\r\n                    Two 3s by L.A.‘s Serge Ibaka extended the lead to 96-91. The Suns pulled to 107-104 in the final minutes, but Nicolas Batum hit a 3-pointer to put it away. \n\n\r\n                    “I was ready anytime to make a shot and a play for the team,\" said Batum, who missed much of last season with injuries. “It is great to be on the court after what happened to me the last 18 months, basketball wise, to play on a team like that and in those situations. The trust of my teammates and from a guy like (George) to give me the ball and make a shot. It feels great.” \n\n\r\n                    TIP-INS \n\n\r\n                    Clippers: Prior to the game it was announced that seven members of the Clippers’ support staff will begin a seven-day quarantine after one person in the group tested positive for COVID-19. There were no players or coaches included in the quarantine. … Forward Marcus Morris missed his seventh game. He has not played this season because of right knee soreness. \n\n\r\n                    Suns: The Suns held a moment of silence for Hall of Famer Paul Westphal. He died Saturday of brain cancer at age 70. He went to the NBA Finals as a player and coach with the Suns. ... Forward Abdel Nader, who was acquired in the Chris Paul trade, sat out again because of concussion protocol. Nader suffered the concussion in a preseason game against Utah. \n\n\r\n                    UP NEXT \n\n\r\n                    Clippers: Host San Antonio on Tuesday night. \n\n\r\n                    Suns: Host Toronto on Wednesday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997706.279547
}