{
  "game_id": "0022301020",
  "espn_id": "401585648",
  "date": "Mar 23, 2024",
  "matchup": "ORL vs. SAC",
  "headline": "De’Aaron Fox and Keon Ellis hit key free throws to help the Kings beat the Magic 109-107",
  "body": "ORLANDO, Fla. -- — De’Aaron Fox hit tying and go-ahead free throws with 21.2 seconds left and finished with 31 points, and Keon Ellis added another free throw in the final seconds as the Sacramento Kings beat the Orlando Magic 109-107 on Saturday night.\n\n\r\n              After Fox tied the game at 107 and put the Kings ahead at 108-107, Ellis added another point with two seconds remaining and Sacramento ended Orlando’s five-game win streak.\n\n\r\n              Paolo Banchero missed a long 3-pointer attempt at the buzzer for the Magic, who lost a similar game in double overtime at Sacramento on Jan. 3.\n\n\r\n              “We’re trying to prove ourselves, just like them,” said Ellis, who grew up 30 miles up the road in Eustis, Florida. “So when we’re out here we’re tying to earn each others’ respect.”\n\n\r\n              Ellis, who scored a career-high 19 points and added six assists, also hit a 22-footer that gave the Kings a five-point lead with 1:59 left.\n\n\r\n              “Keon was huge. He was freaking phenomenal,” Sacramento coach Mike Brown said.\n\n\r\n              Domantas Sabonis had 21 points and 14 rebounds for Sacramento. It was his 53rd straight double-double, tying Kevin Love’s streak in 2010-11, which is the longest since the ABA-NBA merger in 1976.\n\n\r\n              “Obviously a big, big accomplishment by Domas,” Brown said. “But it’s like clockwork for him with the 14 rebounds and 21 points.”\n\n\r\n              Keegan Murray added 22 points for the Kings, who overcame Malik Monk’s 0-for-11 shooting.\n\n\r\n              Jonathan Isaac matched his career high with 25 points for the Magic.\n\n\r\n              Banchero finished with 22 points, Franz Wagner added 18 and Cole Anthony came off the bench with 15 points, seven rebounds and six assists.\n\n\r\n              “That’s a tough game, man,” Anthony said. “It’s a really good team, well coached. They’ve got some good players, but we had a chance to win a game. You can’t ask for more than that in the NBA.\"\n\n\r\n              Isaac drew an ovation when he was taken out after an eight-minute stretch of the first half in which he produced 17 points, four rebounds and a block of Sabonis.\n\n\r\n              Sabonis scored five points during a 13-0 run in the third quarter that moved the Kings ahead 74-65, the largest lead of the game for either team.\n\n\r\n              “Nineteen lead changes, tied 13 times. I mean, that’s the battle we’ve had with them,” Magic coach Jamahl Mosley said. “It was similar to the game there. ... We’ll just have to keep looking at these films and how we can learn from these situations.”\n\n\r\n              The Kings overcame modest 43.7% shooting with just seven turnovers.\n\n\r\n              “We won the possession game while defending,” Brown said, “and that’s why we got a road win in a tough environment versus a really good team.”\n\n\r\n              Caleb Houston started for the Magic, but left the game with an ankle injury in the first half.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Philadelphia on Monday.\n\n\r\n              Magic: Host Golden State on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996178.238423
}