{
  "game_id": "0021900381",
  "espn_id": "401161023",
  "date": "Dec 14, 2019",
  "matchup": "TOR vs. BKN",
  "headline": "Siakam scores 30 points, Raptors beat Nets to snap home skid",
  "body": "TORONTO --  One huge quarter from 3-point range helped the Toronto Raptors halt a rare home losing streak.\n\nPascal Siakam scored 30 points, Marc Gasol set season highs with 17 points and 15 rebounds and the Raptors beat the Brooklyn Nets 110-102 on Saturday night to snap a three-game slump on their home court.\n\n\"Our overall feel-good was there tonight,\" Toronto guard Kyle Lowry said.\n\nNorman Powell fouled out with 25 points and Lowry had 17 to help the Raptors win their ninth straight home game against the Nets and beat Brooklyn for the 16th time in 17 meetings.\n\n\"I really think tonight's game was fuelled by the defense we had,\" Powell said.\n\nSerge Ibaka had 12 points and 12 rebounds as Toronto extended an NBA record by winning its 34th straight at home against a division foe. The Raptors are unbeaten at home against Atlantic Division opponents since a Nov. 10, 2015, loss to the New York Knicks.\n\nThe Raptors made nine of 12 attempts from 3-point range in the first quarter, including their first seven straight.\n\n\"It gave us some good energy to start to shoot the ball so well,\" coach Nick Nurse said.\n\nThe hot shooting didn't last, and Toronto went 5 for 28 from distance the rest of the way.\n\n\"We've just got to keep shooting, keep getting shots up and playing aggressive,\" Lowry said.\n\nToronto came in having made 27.2% of its 3-point attempts in its previous five games, four of them losses. The Raptors made a season-low seven 3-pointers Monday night in a 93-92 win at Chicago.\n\nWednesday's loss to former teammate Kawhi Leonard and the Clippers was Toronto's third straight at home after a franchise-record nine consecutive home wins to begin the season. The Raptors hadn't lost three straight at home since Nov. 29 to Dec. 5, 2015.\n\nSiakam topped 25 points Saturday for the first time in six games. Toronto lost four of the five games in which Siakam failed to score at least 25.\n\n\"Our energy was where we want it to be,\" Siakam said. \"We made a lot of mistakes but we covered it up with our energy.\"\n\nSpencer Dinwiddie scored 26 points, Garrett Temple added 16 and Taurean Prince had 14 points and 10 rebounds for the Nets, who are 0-4 on the road against opponents with winning records.\n\nNets coach Kenny Atkinson said sloppy ball handling and poor outside shooting was too much to overcome against the defending NBA champions. Brooklyn shot 12 for 46 from long range, with Temple missing 12 of 14 attempts. The Nets also made 20 turnovers, leading to 29 points for the Raptors.\n\n\"When you have 20 turnovers and then you miss the amount of shots we did, it's just not good enough,\" Atkinson said.\n\nTemple couldn't convert a three-point play after making a layup to begin the fourth, and Powell scored five points as Toronto replied with a 9-0 run, taking a 99-85 lead with 8:32 left to play.\n\nNine of Toronto's 12 field goals in the first were 3-pointers, one shy of the team record for a single quarter. Siakam had 14 points in the first as the Raptors overcame an early 12-2 deficit to lead 38-31 after one.\n\n\"Credit to them being locked in from the jump,\" Prince said.\n\nTIP-INS\n\nNets: Jarrett Allen had 10 rebounds, extending his career-best streak of 10-plus rebound games to 10. It's the longest streak by a Nets player since Reggie Evans did it in 18 straight in 2012-13. . Brooklyn's 59 rebounds were a season-high. . The Nets are 3-7 against opponents with winning records.\n\nRaptors: G Fred VanVleet (right knee) missed his third straight game. . Gasol had a career-high 17 rebounds against Charlotte last Jan. 23.\n\nSHORT REST\n\nThe Nets play again in less than 24 hours, hosting Philadelphia at 6 p.m. on Sunday.\n\n\"It's part of the job,\" Allen said. \"We've been built to play basketball. We condition our bodies to be able to do this and let's just go play tomorrow.\"\n\nDOUBLY DISAPPOINTING\n\nBrooklyn, which led by 10 points early, couldn't hold a double-digit lead for the second straight game. The Nets saw a 20-point lead slip away in Wednesday's 113-108 home loss to Charlotte.\n\nREINFORCEMENTS ARRIVING\n\nWith his 25-game suspension for violating the NBA's drug program complete, the Nets will have Wilson Chandler active for the first time Sunday. Prince said the veteran forward will provide defensive toughness and 3-point shooting.\n\n\"He makes good decisions on offense, doesn't really step outside of his game,\" Prince said.\n\nUP NEXT\n\nNets: Host Philadelphia on Sunday night.\n\nRaptors: Host Cleveland on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995633.251298
}