{
  "game_id": "0022300815",
  "espn_id": "401585443",
  "date": "Feb 24, 2024",
  "matchup": "BKN @ MIN",
  "headline": "Edwards scores 29, Towns adds 28 as Wolves pull away for 101-86 win over Nets",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 11 of his 29 points in the fourth quarter, punctuated by a dunk in the final minute, as the Minnesota Timberwolves took sole possession of first place in the Western Conference with a 101-86 win over the Brooklyn Nets on Saturday night.\n\n\r\n              Karl-Anthony Towns added 28 points for Minnesota, which bounced back from a loss Friday to Milwaukee. The Timberwolves are now 5-2 this season on the second night of back-to-backs.\n\n\r\n              “We needed a win desperately,” said Timberwolves head coach Chris Finch. “Still not playing really sharp basketball, particularly on the offensive end. But defensively, we were really strong.”\n\n\r\n              Cam Thomas led Brooklyn with 18 points. Nets leading scorer Mikal Bridges, who entered Saturday averaging 21.7 points per game, added 15 points.\n\n\r\n              The win puts the Timberwolves a half-game ahead of idle Oklahoma City in the conference.\n\n\r\n              The Nets fell to 0-2 under interim head coach Kevin Ollie. Ollie took over for Jacques Vaughn, who was fired during the All-Star break.\n\n\r\n              “I thought we did a great job coming together as a team and facing adversity,” Ollie said. “But we've got to make shots.”\n\n\r\n              Both teams struggled from the floor. Minnesota shot 43% overall and 31.6% from deep. Brooklyn shot 34% and was just 6 of 35 from 3-point range. It was the lowest field-goal percentage by a Wolves opponent this season.\n\n\r\n              Things got chippy with 22.5 seconds remaining and the game already out of hand. Dennis Schroder made contact with Mike Conley after Conley hit a 3-pointer, causing Minnesota’s Jaden McDaniels to shove Schroder. The play resulted in four offsetting technical fouls, two for each team.\n\n\r\n              “I understand where Dennis is going,” Ollie said of the play. “It's a late game. (Conley's) a veteran, so I know if he had to do it over again, he wouldn't take the shot.”\n\n\r\n              The Timberwolves were without center Rudy Gobert, who missed Saturday’s game with a sprained left ankle. Gobert suffered the injury in the third quarter of the loss to Milwaukee. Saturday was just the second game he’s missed this season.\n\n\r\n              Without Gobert, Minnesota struggled on the boards. Brooklyn outrebounded the Wolves 56-51.\n\n\r\n              The Timberwolves trailed at halftime and led by just two after three quarters before outscoring the Nets 31-20 in the fourth.\n\n\r\n              “It was ugly, sloppy. I think by both teams, actually,” said Timberwolves center Naz Reid. “But we (were) able to buckle down in the last quarter and handle business.”\n\n\r\n              Brooklyn point guard Ben Simmons left the game in the third quarter with a leg injury. The 27-year-old Simmons has played in just 14 games this year. Ollie said Simmons would get more testing done and he will travel with the team.\n\n\r\n              Reid landed awkwardly in the second quarter, colliding with the basket and hitting his leg midway through the second quarter. He walked to the locker room under his own power and eventually returned to the game in the middle of the third quarter.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Memphis on Monday night.\n\n\r\n              Timberwolves: Host San Antonio on Tuesday night.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996332.26475
}