{
  "game_id": "0021900600",
  "espn_id": "401161242",
  "date": "Jan 14, 2020",
  "matchup": "MEM vs. HOU",
  "headline": "Morant, Brooks lead Grizzlies to 121-110 win over Rockets",
  "body": "MEMPHIS, Tenn. --  Early this season, the young Memphis Grizzlies were still learning how to close out games -- a shortfall the team has overcome during its longest winning streak in more than three years.\n\nThe Grizzlies outscored the Houston Rockets 36-27 in the fourth quarter Tuesday night as Memphis pulled away for a 121-110 victory, stretching the Grizzlies' winning streak to six games -- their longest since December 2016.\n\nRookie guard Ja Morant had 26 points and eight assists, and Dillon Brooks scored 24 to lead Memphis. Jonas Valanciunas added 19 points and Jaren Jackson Jr. had 15 despite going 6 of 16 from the floor.\n\nMorant missed only one of his 11 shots, becoming the first rookie in NBA history to score at least 25 points while handing out eight or more assists and shooting 90% or better from the field.\n\n\"Early on, we would get stagnant, and we would run the same thing over and over,\" Brooks said of the team's fourth-quarter problems earlier in the season. \"Now, we're getting more diversity with Ja getting to the middle and making great plays and great decisions.\"\n\nBrooks also was responsible for guarding Rockets star James Harden, the NBA's leading scorer. Harden perhaps had more scoring duties against Memphis as backcourt mate Russell Westbrook sat out to rest on the opening night of a back-to-back. Harden scored 41 points, his fifth straight game against the Grizzlies surpassing 40. But he shot 13 of 37, including 5 of 19 from 3-point range.\n\nThat included missing all seven shots in the fourth quarter as Memphis pulled away in the final eight minutes.\n\n\"There were little things,\" Rockets coach Mike D'Antoni said. \"Most importantly, we couldn't keep the Grizzlies in front of us. They finished very well at the rim on a lot of fast-break possessions. . We didn't do enough to stop them.\"\n\nEric Gordon finished with 23 points for Houston, and Clint Capela had 16 points and 16 rebounds.\n\nCapela said in games the Rockets have lost \"finishing defensively, we weren't good enough. Our goal is always to keep the team under 100 points, which didn't happen.\"\n\nThe teams were tied at 95 with about eight minutes left when the Grizzlies went on an 11-1 run fueled by 3-pointers from Solomon Hill, Brooks and Morant. That gave Memphis a 106-96 lead with five minutes remaining.\n\nThe win left the Grizzlies clinging to eighth place in the Western Conference, a half-game ahead of the idle San Antonio Spurs.\n\n\"Every game is a statement game at this point,\" Jackson said, \"because you are playing for seeding, playing for the playoffs. Everybody is trying to work towards that, but definitely, when you're on a winning streak, it gives you a bit more energy.\"\n\nTIP-INS\n\nRockets: Westbrook also sat out Houston's previous game at Memphis on Nov. 4, which was the second of a back-to-back. . With Westbrook out, Austin Rivers started at guard alongside Harden. Rivers was given the nod over Gordon. \"Someone has to chase Morant around, and I want Austin to do that,\" D'Antoni said before the game. \"Help save Eric's legs a little bit.\" ... Capela has at least 10 rebounds in 25 of the past 26 games. ... The loss left D'Antoni one win short of 200 as coach of the Rockets. ... It was only the second time Houston has lost in 16 games when Harden scored at least 40 points this season.\n\nGrizzlies: F Jae Crowder sat out with right hip soreness. Kyle Anderson started in his place, his third start of the season. . Jackson has 13 straight games with multiple 3-pointers, tying Mike Miller for the franchise record. . Memphis has scored at least 110 points in 12 consecutive games, the longest active streak in the NBA.\n\nGORDON MAKING PROGRESS\n\nGordon's 23 points were a season high after the Rockets guard missed 22 games following right knee arthroscopy. He also sat out last Thursday's loss at Oklahoma City with right knee soreness.\n\n\"It's coming together,\" Gordon said. \"I want to continue to get better and better. . It's going to take some time. I'm getting better, the knee is getting better and I just have to get in some better shape.\"\n\nUP NEXT\n\nRockets: Open a four-game homestand against Portland on Wednesday.\n\nGrizzlies: Host the Cleveland Cavaliers on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995717.305952
}