{
  "game_id": "0021700438",
  "espn_id": "400975189",
  "date": "Dec 17, 2017",
  "matchup": "ORL @ DET",
  "headline": "Sharp-shooting Pistons hold on for 114-110 win over Magic",
  "body": "DETROIT --  The Detroit Pistons tied a franchise record for 3-pointers -- and they needed almost all of them to avoid a bad home loss.\n\nReggie Bullock scored a career-high 20 points, and the Pistons made 17 shots from beyond the arc in a 114-110 victory over the Orlando Magic on Sunday. Detroit nearly gave away a 24-point lead in the fourth quarter, and coach Stan Van Gundy wasn't happy at all with his team's effort.\n\n\"We played a very good first half, Reggie Bullock and Anthony Tolliver played very well, and we didn't try at all in the second half,\" Van Gundy said. \"We didn't bring anything to the second half.\"\n\nThe Pistons have won three in a row after starting December with a seven-game losing streak.\n\nNikola Vucevic had 24 points, 14 rebounds and seven assists for the Magic. They have dropped five straight and 16 of 19.\n\nDetroit started fast, making six of its first seven shots to take a 15-5 lead. At the end of the first quarter, Ish Smith made a shot, and then Langston Galloway added a steal and a floater when the Magic botched the inbound play. It was 36-23 after one.\n\nThe Pistons led 60-43 at halftime after going 10 of 18 from beyond the arc in the first half. Then Detroit added six more 3-pointers and 36 points in the third quarter.\n\nTolliver's 3-pointer tied the franchise record and gave the Pistons a 105-81 lead with 7:00 remaining. Then Orlando scored the game's next 19 points.\n\n\"I don't really feel like our defensive intensity was very good the whole game,\" Tolliver said. \"Even though we were shooting really well, I think we definitely relaxed way too much.\"\n\nOrlando trailed 105-100 after its huge fourth-quarter run, but Mario Hezonja, who would finish with eight 3-pointers, missed one for the Magic. Tobias Harris scored on a driving shot at the other end with 1:21 to play.\n\nThe Pistons finished 17 of 34 from beyond the arc, and the Magic were even better at 17 of 33.\n\n\"It was great that we didn't give in when we were down 20. We finally did the things we hadn't been doing all night,\" Vucevic said. \"We hit shots, but I think it all started with us finally getting stops.\"\n\nHarris, Tolliver and Reggie Jackson scored 17 points each for the Pistons. Hezonja had 28 points for Orlando, and Jonathon Simmons added 23.\n\nOPPORTUNITY\n\nBullock has played increased minutes lately with Stanley Johnson shooting poorly. His big game was especially welcome Sunday, when guard Avery Bradley was out with a right groin problem.\n\nBullock finished 8 of 10 from the field and eclipsed his previous career high of 17 points.\n\n\"This is probably one of my most true opportunities probably, since I've been in the league,\" Bullock said. \"Just knowing I'm going to be in the rotation.\"\n\nRESERVES\n\nThe Magic got good scoring from the trio of Hezonja, Vucevic and Simmons, but Orlando's bench was outscored 45-18. Injuries have sapped some of the team's depth.\n\n\"We extended the starters' minutes, but we still need to have a bench,\" coach Frank Vogel said. \"We've got backups starting, so they are already extended just from that.\"\n\nTIP-INS\n\nMagic: G Arron Afflalo (back), F Aaron Gordon (right calf), G-F Evan Fournier (right ankle) and G-F Terrance Ross (knee) were out. ... Elfrid Payton had 15 points and seven assists.\n\nPistons: F Jon Leuer (left ankle) missed the game.\n\nUP NEXT\n\nMagic: At Chicago on Wednesday night.\n\nPistons: At Dallas on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764993696.148298
}