{
  "game_id": "0021900458",
  "espn_id": "401161100",
  "date": "Dec 25, 2019",
  "matchup": "LAL vs. LAC",
  "headline": "Kawhi Leonard's 35 fuels Clippers as Lakers lose fourth in row",
  "body": "LOS ANGELES -- The Clippers were resilient and dominant in the second half to put away the Lakers, using the NBA's marquee Christmas game to show why the city and the Western Conference might belong to them this season.\nKawhi Leonard scored 11 of his 35 points in the fourth quarter and had 12 rebounds and 5 assists to help the Clippers beat Lakers 111-106 on Wednesday night.\nThe Clippers trailed by 12 points at halftime, by 15 in the third quarter, and by seven in the fourth quarter with 6 minutes, 39 seconds remaining, but they rallied to improve to 2-0 against the Lakers this season.\n\"And we didn't flinch,\" Clippers coach Doc Rivers said. \"Like, we just kind of hung in there. Almost felt like we were biding our time and just trying to make a run. That's something you have to have when things aren't going great for you. You just got to hang in there, and I thought we did that tonight.\"\nLeonard set a franchise record for points on Christmas, and he became the 10th player in NBA history with at least 35 points, 10 rebounds and 5 assists on Dec. 25.\nMontrezl Harrell had 18 points off the bench and Paul George added 17, and the Clippers are 15-2 at Staples Center.\n\"We have so many interchanging parts,\" Clippers guard Lou Williams said. \"We have guys that's going to have big nights. I think I had five or six points tonight, and that's just how this team is built. It's going to be different guys every night.\"\nKyle Kuzma led the Lakers with 25 points. LeBron James had 23 points, 10 assists and 9 rebounds, and Anthony Davis had 24 points. The Lakers have lost four consecutive games.\nWilliams made two free throws -- after a questionable foul call against Davis for tapping the swingman after his transition layup rimmed out -- to give the Clippers a 105-103 lead with 3:29 to go.\nLeonard, who had a 3 to cap a 7-0 run and tie it at 101 with 5:14 remaining, then made four late free throws.\n\"They wanted it more,\" Davis said. \"We had a lot of mistakes down at the end of the game, mental mistakes at both ends of the floor. We fouled a lot in the fourth quarter, put them to the line. ... We gave that one away.\"\nLos Angeles had a chance to tie in the final seconds, but video review showed James touched the ball last after Patrick Beverley knocked it away as James went up for a 3. George hit two free throws for the final margin.\n\"That wasn't the game right there,\" James said. \"I mean, it's a big play and you want to try to get it right, but it wasn't where the game was lost.\"\nTIP-INS\nClippers: Williams had six points and seven rebounds. ... The Clippers had a 50-42 edge in rebounds.\nLakers: Kuzma had 15 points in the first quarter, making 5 of 7 shots, including 3 of 4 3s. ... The Lakers' bench outscored the Clippers' reserves 49-36. ... James played in his 14th Christmas Day game, second in NBA history to Kobe Bryant at 16.\nBIG RESPONSE\nAfter allowing a 14-2 run over the final 2:52 of the second quarter, the Clippers regrouped with nine different players scoring to tie it up at 86-all going into the fourth quarter. Defensively, they held the Lakers to 9-of-23 shooting in the third, including 1-of-10 from 3.\n\"We've done worse,\" Williams said of the struggles closing out the first half. \"We've dropped 15-point leads in three straight games before this, so I think that's just growing pains.\"\nSANTA'S LAP\nThere was plenty of star power sitting courtside for the highly anticipated game, including Red Hot Chili Peppers bassist Flea and R&B star The Weeknd. But Kevin Hart found himself closer to the action than expected when Davis missed a fallaway shot at the end of the first half and ended up on top of the comedian. James ran over from the bench and did the same, much to the amusement of Hart's kids.\nUP NEXT\nClippers: Host Utah on Saturday night.\nLakers: At Portland on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764996008.63042
}