{
  "game_id": "0021500797",
  "espn_id": "400828684",
  "date": "Feb 10, 2016",
  "matchup": "TOR @ MIN",
  "headline": "Timberwolves come back from 18 down to stun Raptors, 117-112",
  "body": "MINNEAPOLIS --  The Toronto Raptors were rolling, beating up on a young Minnesota team when maybe, just maybe, their thoughts drifted to the party that awaits them back home this weekend.\n\nThat's when the Timberwolves pounced, and a Canadian star and his fellow No. 1 overall draft pick delivered a stunning comeback.\n\nKarl-Anthony Towns had 35 points and 11 rebounds, and Toronto-born Andrew Wiggins scored 13 of his 26 in the fourth quarter to rally the Timberwolves from 18 points down to a 117-112 victory Wednesday night.\n\nRicky Rubio had 19 points, eight assists and eight rebounds to outplay All-Star guard Kyle Lowry, and the Wolves used a huge advantage at the free throw line to close out a team that had won 14 of its last 15 games.\n\nThe Wolves have lost five games this season when leading by at least 17 points. They trailed by 18 in the second quarter and flipped that script.\n\n\"We got back in the locker room and just talked among ourselves and found out what we needed to do,\" Wiggins said. \"We found out what was working and we kept doing it.\"\n\nMinnesota set season highs with 43 free throws made on 53 attempts on the way to its largest comeback win of the season. The Raptors were whistled for 34 fouls compared to 21 for the Wolves.\n\nDeMar DeRozan scored 35 points for the Raptors, who head home to host All-Star Weekend beginning on Friday night. But Lowry was held to 14 points and seven assists while battling foul trouble, and the combination of Wiggins and Towns was too much down the stretch.\n\n\"We're not good enough to come out and throw our press clippings or our record on the court and not perform,\" Toronto coach Dwane Casey said.\n\nThe Raptors appeared to be cruising toward a highly anticipated weekend in Canada when they raced out to an 18-point lead in the second quarter. Then Lowry picked up his fourth foul, Jonas Valanciunas couldn't handle Towns in the paint and the Timberwolves came all the way back to grab the lead early in the fourth quarter.\n\n\"They're just another team to me,\" Wiggins said when asked if there was something special about beating the team he grew up watching. \"Another team to beat.\"\n\nCasey emphasized before the game the need for a veteran group to hold it together for one more night before the party starts in Toronto. The Raptors were facing a Timberwolves team with the third-worst record in the West that was just blown out by lowly New Orleans in this building two nights prior.\n\nWhen the Raptors got up big early, they might have relaxed a little bit and they found themselves in a fight for the final 9 minutes.\n\nRubio's third 3-pointer gave the Timberwolves a 104-98 lead with 5:24 to play.\n\nThe Raptors fought back to tie the game with under 3 minutes to play, but Wiggins hit big shot after big shot a day before heading back to his hometown to play in the Rising Stars Challenge on Friday night.\n\n\"We'll see them again,\" Lowry said.\n\nLANDMARK WIN\n\nThe Timberwolves improved to 17-37, one more win than they had last season.\n\n\"We're going in the right direction,\" Wiggins said. \"We have the right pieces. We have all the talent. Now we just need to put everything together.\"\n\nTOWNS SHINES\n\nTowns joined Shaquille O'Neal, Kevin Durant, Carmelo Anthony, LeBron James and Chris Webber as the only players in their 19- or 20-year-old seasons to have at least 35 points, 10 rebounds and three blocks in a game. When asked if he surprises himself with his production, Towns quipped, \"I do surprise myself sometimes. Missing two free throws, missing open jump shots.\"\n\nTIP-INS\n\nRaptors: Their 68 points were their most in a first half this season. ... Bismack Biyombo left in the second quarter after a nasty spill under the basket but was able to return in the second half. ... The Raptors made 10 of 31 3-pointers to just 4 of 14 for Minnesota.\n\nTimberwolves: F Tayshaun Prince missed the game to attend former teammate Chauncey Billups' jersey retirement ceremony in Detroit. Zach LaVine started in Prince's place and finished with 13 points. ... Gorgui Dieng had 14 points and 10 rebounds, and all five Timberwolves starters finished in double figures. ... The Wolves again played without Kevin Garnett (leg), Nikola Pekovic (ankle) and Kevin Martin (wrist).\n\nUP NEXT\n\nRaptors: Visit Chicago on Feb. 19.\n\nTimberwolves: Visit Memphis on Feb. 19.",
  "source": "espn_api",
  "crawled_at": 1764994717.714595
}