{
  "game_id": "0021601080",
  "espn_id": "400900475",
  "date": "Mar 24, 2017",
  "matchup": "LAL vs. MIN",
  "headline": "Lakers beat Wolves 130-119 in OT to snap 6-game skid",
  "body": "LOS ANGELES --  Credit Shaquille O'Neal with an unofficial assist in a rare Lakers victory.\n\nThe big man caused a scene when he ambled into Staples Center in the second quarter Friday night, fist-bumping fans before taking a courtside seat near his old team's bench.\n\n\"The whole arena turned into `Oh my gosh, Shaq is here,\" said Larry Nance Jr., who shook his hand at halftime. \"He deserves it and it was an honor getting to play on his night. I'm just glad we got the win.\"\n\nThe mere presence of the Hall of Fame center who led the Lakers to three straight NBA titles from 2000-02 electrified the crowd and buoyed the last-place Lakers, who rallied from 15 points down in the third to beat the Minnesota Timberwolves 130-119 in overtime.\n\n\"There was a better energy in the building because of Shaq,\" Lakers coach Luke Walton said. \"We didn't get to channel that until the second half when the second unit came in and began defending. It definitely brings a little extra.\"\n\nJordan Clarkson had career highs of 35 points and eight 3-pointers as the Lakers snapped a six-game skid. He scored just five points on 1-of-9 shooting in a loss to the Clippers on Tuesday.\n\n\"He seemed to have that spark back that he's played with most of the year,\" Walton said.\n\nJulius Randle added 23 points and 12 rebounds for the Lakers, who earned just their second victory since the All-Star break. They had lost 15 of 16 coming into the matchup of last-place teams in their respective divisions.\n\nAndrew Wiggins scored 36 points before fouling out with 1:17 left in OT and Karl-Anthony Towns added 25 points and 13 rebounds for Minnesota, which dropped its fifth in a row.\n\n\"We've done this so many times,\" Towns said. \"That's the most discouraging thing.\"\n\nThe Wolves were ahead by eight with 2  1/2 minutes left in regulation before the Lakers outscored them 9-1.\n\n\"We talked about being up on the screens and not giving up 3s, and we sat back and gave them 3s, so that's it,\" coach Tom Thibodeau said. \"That's the name of the game.\"\n\nRandle's floating bank shot capped a 9-0 run before Wiggins made one of two free throws to force overtime tied at 109.\n\nThe Lakers dominated the extra session, when Clarkson had seven points. They scored the first eight points to take a 117-109 lead.\n\n\"We needed every point of his 35,\" Nance said. \"It was one of those games where everything he was throwing up went in.\"\n\nRicky Rubio finished with 19 points and 15 assists for the Wolves, who were held to 10 points in OT.\n\n\"After losing four in a row, we wanted to show character,\" Rubio said. \"For a second we showed it, but the game is 48 minutes.\"\n\nTIP-INS\n\nTimberwolves: Wiggins scored a career-high 47 points in the first meeting of the season.\n\nLakers: F Brandon Ingram's right patellar tendinitis flared up, so he didn't play in the fourth quarter or OT. He had 11 points. ... It was their first OT game of the season. ... C Ivica Zubac had seven points and three rebounds in his seventh start of the season. He averaged 13.0 points and 5.5 rebounds in his other six starts this month. ... The Lakers' lone win since the All-Star break was against Phoenix on March 9. ... Jack Nicholson made a rare appearance in his courtside seat.\n\nKNOCKING DOWN NANCE\n\nNance Jr. got clobbered in the face by Gorgui Dieng chasing a loose ball with 1:04 left in regulation. He was down on the court for a bit and tears welled in his eyes. He had a bloody nose and scratched eye.\n\n\"I didn't want Staples seeing that,\" he said of his tears. \"It takes a while to recuperate yourself.\"\n\nFans chanted his first name once Nance got back on his feet.\n\n\"It was an awesome feeling,\" he said. \"They're chanting my name on Shaq's night.\"\n\nPUNCHING SHAQ\n\nWalton attended the unveiling of O'Neal's statue outside Staples Center before the game. Walton was a rookie teammate of O'Neal with the Lakers in 2003.\n\n\"I've said he used to threaten to punch me all the time if I didn't throw him the ball or if I fouled him in practice,\" Walton recalled. \"I always listened to him.\"\n\nO'Neal sat courtside with mother Lucille O'Neal and they shared a kiss. O'Neal addressed the fans at halftime.\n\nUP NEXT\n\nTimberwolves: Visit Portland on Saturday.\n\nLakers: Host Portland on Sunday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764995362.300808
}