{
  "game_id": "0022400997",
  "espn_id": "401705563",
  "date": "Mar 18, 2025",
  "matchup": "LAC vs. CLE",
  "headline": "Clippers rally past Cavaliers 132-119, handing East leaders a second straight loss",
  "body": "INGLEWOOD, Calif. -- — Kawhi Leonard scored 33 points and the Los Angeles Clippers handed the East-leading Cleveland Cavaliers their second straight loss, 132-119 on Tuesday night.\n\n\r\n              Ivica Zubac had 28 points and 20 rebounds and James Harden added 22 points and nine assists in the Clippers’ fourth straight victory.\n\n\r\n              Max Strus scored a season-high 24 points for the Cavs, whose 16-game winning streak ended Sunday against Orlando. Their NBA-best road record dropped to 26-7 after they led by 12 in a 45-point first quarter.\n\n\r\n              Donovan Mitchell had 18 points and 11 assists and Evan Mobley scored 17 points in his return from a one-game absence with a foot contusion.\n\n\r\n              Takeaways\r\n              Cavaliers: Despite losing two in a row for the first time since Jan. 22-25 when they dropped three straight, they still have a comfortable lead in the East with less a month left in the regular season.\n\n\r\n              Clippers: Playing without injured coach Tyronn Lue for the fourth time recently, they clawed back from a 12-point deficit early to pull off one of their biggest wins of the season. They'll need that kind of scrappy mindset to hang on to a playoff spot.\n\n\r\n              Key moment\r\n              The Clippers put together a 20-3 run over the end of the third and start of the fourth, turning a one-point back-and-forth into a 12-point lead in the final quarter. Bogdan Bogdanovic scored seven in the spurt and finished with 20 points off the bench.\n\n\r\n              Key stat\r\n              The Clippers controlled the boards, 49-29, and the Cavs were 17 of 26 from the free-throw line.\n\n\r\n              Up next\r\n              The Cavaliers visit Sacramento on Wednesday to finish a back-to-back. The Clippers host Memphis on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997935.587349
}