{
  "game_id": "0022300453",
  "espn_id": "401585081",
  "date": "Jan 01, 2024",
  "matchup": "DET @ HOU",
  "headline": "Pistons fall to Rockets 136-113 in first game since end of 28-game skid",
  "body": "HOUSTON -- — Two nights after their NBA record-tying 28-game losing streak ended, the Detroit Pistons were blown out 136-113 on Monday night by the Houston Rockets, who got 26 points and nine assists from Alperen Sengun and 22 points from Jalen Green.\n\n\r\n              Detroit (3-30), which beat Toronto 129-127 on Saturday, failed to win consecutive games for the second time this season.\n\n\r\n              Pistons coach Monty Williams said he had thought about how his team would respond after the win.\n\n\r\n              “I thought about it the last day,” Williams said. “When you’re fighting for a win like we were for so long and you get one, I’m sure there’s emotional stuff that I can’t explain, but when you’re in our situation, you got to recover quickly.”\n\n\r\n              Green and Sengun combined to score 37 points in the third quarter as the Rockets outscored the Pistons 47-25 in the period to take a 106-80 lead into the fourth.\n\n\r\n              “It wasn’t the best feeling going in at halftime up four when we felt like we played well enough to be up double digits,” Houston coach Ime Udoka said. “Gave a few leads up, but came out with the right mindset, focused and had a big quarter. (We) kind of put it away there.”\n\n\r\n              Sengun shot 9 of 13 from the field and Green made five 3-pointers as the Rockets snapped a three-game skid.\n\n\r\n              Sengun said he played more aggressively in the third quarter.\n\n\r\n              “I knew I needed to play better,” Sengun said. “I was mad at myself, and I pushed myself in the second half. I played my game. I wasn’t playing like myself in the first half. I missed a lot of shots. I didn’t play with that energy, but if you want to win everyone has to play good, and I did my job in the third quarter.”\n\n\r\n              Sengun has scored at least 20 points in six straight games, and Green has scored at least 20 in three straight.\n\n\r\n              Alec Burks scored 21 points, Jaden Ivey added 19 and Bojan Bogdanovic had 14 for the Pistons. Jalen Duren had 12 points and 13 rebounds for Detroit, which shot 49% and went 13 of 29 on 3-pointers.\n\n\r\n              “We are one of the youngest teams in the league, so no one should outwork us ever, and that's what happened tonight,” Bogdanovic said. “They kind of outrun us, outworked us, and that's got to stop.”\n\n\r\n              Tari Eason had 17 points, Jae’Sean Tate scored 16 and Fred VanVleet had 15 points and seven assists for Houston, which shot 56%, including 15 of 35 on 3s. The Rockets turned 18 turnovers into 33 points.\n\n\r\n              Houston’s Amen Thompson had 12 points in his first game against twin brother Ausar Thompson, who finished with five points for Detroit.\n\n\r\n              Leading 62-60 early in the third quarter, Houston went on a 19-4 run to open up an 81-64 lead on a 3-pointer by VanVleet with 6:43 remaining in the third. Sengun scored 11 points during the burst.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: At Utah on Wednesday.\n\n\r\n              Rockets: Host Brooklyn on Wednesday as their seven-game homestand continues.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995777.155967
}