{
  "game_id": "0022400317",
  "espn_id": "401704883",
  "date": "Dec 02, 2024",
  "matchup": "CHI vs. BKN",
  "headline": "Giddey gets a triple-double as the Bulls race past the Nets for a 128-102 victory",
  "body": "CHICAGO -- — Josh Giddey had 20 points, 13 rebounds and 11 assists, helping the Chicago Bulls beat the Brooklyn Nets 128-102 on Monday night.\n\n\r\n              It was Giddey's first triple-double of the season and No. 12 for his career.\n\n\r\n              Nikola Vucevic had 21 points and 10 rebounds for Chicago, which had lost three of four. Matas Buzelis scored 20 points on 7-for-10 shooting, and Zach LaVine finished with 18.\n\n\r\n              Brooklyn lost its third consecutive game — all in the last four days. Dariq Whitehead scored 18 points for the Nets, and Dennis Schroder had 16 points and 10 assists.\n\n\r\n              Brooklyn played without forward Cam Johnson because of a sprained left ankle — part of a long list of injuries for the Nets. He scored 26 points in Sunday's 100-92 loss to Orlando.\n\n\r\n              Chicago guard Coby White also was sidelined by a sprained left ankle.\n\n\r\n              The Bulls started to pull away in the third quarter, outscoring the Nets 36-22 in the period. Buzelis' basket off a pass from Giddey made it 92-72 going into the fourth.\n\n\r\n              Takeaways\r\n              Nets: It looked as if Brooklyn got a little tired in the second half. The Nets shot 40% from the field, including a 14-for-42 performance from 3-point range. \n\n\r\n              Bulls: Vucevic continues to add to his solid start to the season. He made three of his team's 16 3-pointers.\n\n\r\n              Key moment\r\n              Chicago used a 13-0 run to take a 50-42 lead with 3:23 left in the first half. Giddey capped the decisive stretch with a 3-pointer.\n\n\r\n              Key stat\r\n              The Bulls shot 52.2% (48 for 92) from the field. They have shot at least 50% in their last six games, the longest such streak in the NBA this season.\n\n\r\n              Up next\r\n              The Nets host the Indiana Pacers on Wednesday night. The Bulls visit San Antonio on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997093.497684
}