{
  "game_id": "0021600851",
  "espn_id": "400900257",
  "date": "Feb 23, 2017",
  "matchup": "CHA @ DET",
  "headline": "Pistons rally from 18 down, beat Hornets 114-108 in OT",
  "body": "AUBURN HILLS, Mich. -- As exasperated as he can look on the sideline sometimes, Detroit coach Stan Van Gundy says he actually doesn't give players too hard a time about shot selection.\nSometimes, a player needs the freedom to keep shooting, like when Kentavious Caldwell-Pope scored the Pistons' last 11 points of regulation to force overtime.\n\"For a guy like Pope to go on a streak like that, he's got to be a bit of a gunslinger and not be worried about what's going on,\" Van Gundy said. \"He's not going to get on those kinds of streaks if you're going to discourage him from shooting the ball.\"\nCaldwell-Pope scored 33 points , including three 3-pointers late in the fourth quarter during a pulsating Detroit rally, and the Pistons outlasted the Charlotte Hornets 114-108 in overtime Thursday night.\nCaldwell-Pope's 3-pointer with 18.2 seconds to play tied the game at 100. Kemba Walker scored Charlotte's final nine points of the fourth, but the Pistons forced him to give up the ball on the last possession, and Marco Belinelli missed a 3-pointer that could have won it.\nDetroit, which was behind by 18 in the third quarter, never trailed in the overtime. Caldwell-Pope's 3-pointer with 55 seconds remaining put the Pistons up 110-102.\n\"Obviously, we didn't do a great job on defense, but you have to give KCP credit for hitting everything,\" Walker said. \"This is a tough league, and there are nights when you just can't stop someone.\"\nCharlotte led 85-70 at the start of the fourth but missed 14 of its first 15 shots in the period, enabling Detroit to cut into the lead.\nWalker scored 34 points. Tobias Harris had 25 for the Pistons.\nCharlotte was without 7-footer Cody Zeller, who was out with quad soreness.\nThe Pistons took a 1 1/2 -game lead over Milwaukee for the eighth and final playoff spot in the Eastern Conference. Charlotte fell 3 1/2 back and has lost 12 of its last 13 games.\nTIP-INS\nHornets: Charlotte went 25 of 26 on free throws and had a significant advantage over Detroit, which was 11 of 12.\nPistons: Detroit recalled F Henry Ellenson and G Michael Gbinije from the team's Grand Rapids affiliate in the D-League before the game. Neither of them played. ... Smith became the first Detroit player with at least 15 assists in a reserve role since Kevin Porter had 19 on Jan. 9, 1977 against the Los Angeles Lakers.\nSTANDING PAT\nDetroit didn't make a trade on deadline day , keeping its tandem of center Andre Drummond and point guard Reggie Jackson intact.\n\"As much as you would like for progress to be steadily uphill, it's not always,\" Van Gundy said before the game. \"That doesn't mean that you lose faith in your guys.\"\nDrummond and Jackson didn't play well Thursday, however, and neither played at all in the fourth quarter or overtime. Backup point guard Ish Smith finished with five points on 2-of-12 shooting but tied a career high with 16 assists.\nODD MATCHUP\nWith big men Zeller and Miles Plumlee (strained right calf) out, the Hornets were still able to give Detroit problems thanks to center Frank Kaminsky's ability to play on the perimeter. Detroit adjusted by going with a smaller lineup down the stretch.\n\"Any time you have a lead like that it's tough to sustain the lead sometimes because you get a little comfortable,\" Harris said. \"We just tried to change the pace out there and really used our defense to fuel our offense.\"\nUP NEXT\nHornets: Visit the Sacramento Kings on Saturday, the third of seven straight games away from home for Charlotte.\nPistons: Host the Boston Celtics on Sunday night.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764995486.542586
}