{
  "game_id": "0021800707",
  "espn_id": "401071380",
  "date": "Jan 23, 2019",
  "matchup": "CLE @ BOS",
  "headline": "Rozier's perfect start, 26 points carry Celtics past Cavs",
  "body": "BOSTON --  The Boston Celtics had a little tuneup before their big mid-winter test.\n\nTerry Rozier scored 22 of his 26 points in the first half and the Celtics coasted to their fifth straight victory with a 123-103 win over the struggling Cleveland Cavaliers on Wednesday night.\n\nNow, they look ahead to a showdown with defending champion Golden State at TD Garden on Saturday night.\n\n\"We have a great test Saturday and we'll learn more about us,\" Boston coach Brad Stevens said. \"We're not where we want to be at this point.\"\n\nJaylen Brown scored 23 points, Gordon Hayward 18 and Jayson Tatum 15 for Boston, which won its 10th straight at home. Rozier, who added eight rebounds and six assists, started in place of the ill Kyrie Irving and shot 6 for 6 and scored 16 points in the opening quarter. He made his only two shots in the second -- both 3-pointers -- including a 31-foot buzzer-beater from the top of the key that gave Boston a 65-50 halftime lead.\n\nRozier said he found out via text from Irving in the morning that he was going to start, which helped him get \"mentally prepared.\"\n\nIrving was sidelined with flu-like symptoms, and Boston was also without Al Horford, who was given the night off to rest and be fresh for the Warriors. Horford had missed seven games in December with a sore left knee before they built his minutes back up.\n\nWhen asked about team's winning streak at home, Rozier said: \"That's a big one to get 11 in a row. We know how big this game is.\"\n\nCedi Osman led the Cavaliers with a career-high 25 points and eight rebounds, and Ante Zizic had 19 points with eight boards. Cleveland has lost five in a row and 17 of its last 18.\n\nThe Cavaliers might have been in town, but a good number of fans at might have been already looking ahead to Saturday's game with the Warriors. It was relatively quiet until Boston took charge with a 27-11 run to close the second quarter, pushing its lead from two to 15 at the half.\n\n\"I thought they sped us up a little bit,\" Cavaliers coach Larry Drew said. \"You know we had a real good pace going at the beginning. Second quarter, I thought their pressure kind of sped us up. We took some bad shots, we turned the basketball over and on the road you just can't do that, particularly against a good team.\"\n\nMarcus Smart started the spree, hitting a 3-pointer -- one of five the Celtics had in the run. Rozier had two, the last coming just before the buzzer, bringing the crowd to its feet.\n\nIn the second half, Robert Williams' basket pushed Boston's lead to 86-67 late in the third quarter. It was 12 points entering the final quarter and early garbage time after the Celtics opened the fourth by scoring the first seven points.\n\nTIP-INS\n\nCavaliers: They were missing a few veteran players: Kevin Love (surgery, left foot), Larry Nance Jr. (sprained right knee), Tristan Thompson (left foot soreness) were not with the team. ... Fell to 4-22 on the road.\n\nCeltics: Stevens said his team has gotten a boost from Aron Baynes, who started for Horford. \"His spirit is felt,\" Stevens said before the game. \"You can feel it in practice, you can feel it just around the gym.\" The 6-foot-10 center played in his fifth game after missing the previous 13 with a broken left finger. ... Improved to 19-5 at home.\n\nMYSTERY BASKET\n\nAbout 45 minutes after the game ended, the Celtics PR staff informed the media that the final score was changed to 123-103 and a basket was taken away from Tatum.\n\nThe team said due to a computer glitch, he was credited with a basket in the fourth quarter, but the NBA reviewed the tape and it never occurred.\n\nThe change didn't affect any of the day's listed betting lines on total points or the game's spread.\n\nSTEPPIN' RIGHT IN\n\nRozier was the first Celtics player to score 20 or more points in a half on perfect shooting since Paul Pierce went 7 for 7 and had 20 in the second half against Chicago on Oct. 30, 2009, according to the Elias Sports Bureau.\n\nLast season, the 6-foot-1 guard was a spark in Boston's run to the Eastern Conference finals, averaging 16.5 points per game when Irving was lost before the playoffs with a knee injury, earning him the nickname \"Scary Terry.\"\n\n\"You can say it's one of my better starts.\" Rozier said of the opening quarter.\n\nNICE TOUCH\n\nOsman was 8-for-11 from the field, making 6 of 7 3-point attempts.\n\n\"I would say I was feeling good today about my shots,\" he said.\n\nUP NEXT\n\nCavaliers: Host the Heat on Friday.\n\nCeltics: Host the Warriors in a nationally televised matchup Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994766.515309
}