{
  "game_id": "0021800234",
  "espn_id": "401070915",
  "date": "Nov 18, 2018",
  "matchup": "MEM @ MIN",
  "headline": "Gasol, Conley lead Grizzlies past Timberwolves, 100-87",
  "body": "MINNEAPOLIS --  With Mike Conley finally healthy to rejoin teammate Marc Gasol, and adding 6-foot-11, 242-poound rookie Jaren Jackson Jr., the Memphis Grizzlies have gone back to their long-trusted approach of physical defense.\n\nIt has got Memphis winning again, too.\n\nGasol had 26 points and 13 rebounds, Conley added 18 points and nine assists and the Grizzlies pulled away to beat the Minnesota Timberwolves 100-87 on Sunday.\n\nMemphis, which entered the game with the second-most points off turnovers in the NBA, forced Minnesota into 20 turnovers and turned them into 19 points in winning for the fifth time in six games.\n\n\"That's what gives us the best chance to win against any team,\" Gasol said about the physical style. \"I think that's who we try to be consistently. Obviously last year was a little glitch in the system, but for the past what, 10, 11, 12 years, this team has taken pride on being a very physical team, and that's what gives us the best chance to win.\"\n\nGasol's shooting helped the Grizzlies overcome their own sluggish offensive start. He was 4 of 7 from 3-point range and Memphis hit 12 overall.\n\n\"It's a game-changer,\" Memphis coach J.B. Bickerstaff said of Gasol's outside shooting. \"Those shots break games open for you.\"\n\nGasol scored 18 points in the second half.\n\nKarl-Anthony Towns had 15 points and 20 rebounds for the Timberwolves. They had won three straight games since trading Jimmy Butler to Philadelphia.\n\n\"There was a physicality to the game that we probably didn't respond to as well as we could have or should have,\" Minnesota coach Tom Thibodeau said.\n\nThe Wolves entered the game with the second-fewest turnovers in the NBA at 12.5 per game, but the Grizzlies were active early and forced Minnesota into eight turnovers in the first quarter. The Wolves had averaged 113 points per game in winning the first three games of the homestand after trading Butler.\n\n\"They play slow,\" Minnesota forward Robert Covington said. \"They played a part in it. We can't allow them to dictate our pace. We got to get the ball out, in transition we need to use our athleticism. Tonight, we weren't able to do that.\"\n\nDario Saric, who came over from the 76ers along with Covington, hit three 3-pointers and scored 11 points in the fourth. Saric hit a 3 to draw the Wolves within eight points, but Gasol hit a pair of 3s on consecutive possessions after a timeout.\n\nTIP-INS\n\nGrizzlies: Memphis is 26-8 against Minnesota over the past decade. . The Grizzlies shot 33.3 percent in the first quarter and had six of their 12 turnovers. ... Memphis has won two in a row on the road for the first time since March 15-16, 2017.\n\nTimberwolves: Minnesota held Memphis to 17 points in the first quarter, a season low for a Wolves opponent in any quarter. ... Derrick Rose scored a team-high 18 points on 6-of-11 shooting off the bench for Minnesota. ... The Wolves are 7-2 at home. . Towns had his fifth double-double in the past seven games.\n\nGREEN RETURNS\n\nForward JaMychal Green returned to the Grizzlies' lineup after missing 12 games with a broken jaw. Bickerstaff said he wanted to use Green in short increments. Off the bench, Green had eight points and eight rebounds in 21 minutes.\n\n\"I felt a little rust, got to get my legs back underneath me,\" Green said. \"But other than that, it was just fun to be out there. We played great defense tonight, we got a lot of stops. We're moving the ball well offensively.\"\n\nUP NEXT\n\nGrizzlies: Return home Monday night for the second game of the back-to-back against Dallas.\n\nTimberwolves: Finish their five-game homestand Wednesday night against Denver.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994949.546614
}