{
  "game_id": "0021600076",
  "espn_id": "400899526",
  "date": "Nov 04, 2016",
  "matchup": "DAL vs. POR",
  "headline": "Lillard scores 42 as Trail Blazers beat Mavericks 105-95",
  "body": "DALLAS -- Damian Lillard extended the Dallas Mavericks' season-opening misery on the court. Dirk Nowitzki's aching Achilles continued it off the court.\nLillard scored 27 of his season-high 42 points in the second half to lead the Portland Trail Blazers to a 105-95 victory over Dallas on Friday night, sending the Mavericks to the first 0-5 start in their 37-year franchise history.\nNowitzki sat out the second half with a sore right Achilles and after the game, the team announced he would miss at least the next week.\n\"It's just uncomfortable and sore,\" Nowitzki said. \"So we decided to just shut it down. I'm already not moving great at 38 as it is, so to be out there moving on one leg is not helping myself and it's not helping the team.\"\nThe Mavericks were also without Andrew Bogut (personal reasons), and Lillard and the Blazers took advantage. With backcourt mate C.J. McCollum saddled with foul trouble for most of the game, Lillard had 18 of Portland's 25 points during a 14-minute stretch of the second half.\n\"Sensational. Amazing. All-Star. MVP,\" McCollum said of Lillard's performance. \"He definitely saved us. He saves us all the time.\"\nMason Plumlee had 19 points and Al-Farouq Aminu added 12 points and 10 rebounds for Portland.\nJ.J. Barea scored 23 points and Harrison Barnes had 17 points and 10 rebounds for the Mavericks.\nThe Blazers led by three at halftime despite shooting only 3 for 14 on 3-pointers in the first half, but started 7 for 8 from beyond the arc in the third quarter to open a 78-62 lead.\nHowever, Portland went 0 for 10 for the rest of the quarter and the Mavericks pulled to 79-76 entering the fourth.\nAfter Salah Mejri's dunk closed the gap to one, Lillard scored two quick baskets at the other end, then made a 3 with 8:18 left to put the Blazers up 89-80. The Mavericks got no closer than six the rest of the way.\n\"When they got it to one, I knew coach was going to put me back in a little earlier than usual,\" Lillard said. \"As soon as he called my name, I ran to the scorer's table and knew what needed to happen.\"\nTIP-INS\nTrail Blazers: Coach Terry Stotts earned his 300th win as a head coach. . Lillard has scored at least 27 points in each of Portland's first six games. ... McCollum played only 24 minutes due to foul trouble and scored nine points, but his driving lay-up with 4:34 to go gave the Blazers a 95-87 lead. It was his only basket after the first quarter. ... Shabazz Napier tied the score at 26-26 after one quarter when he stole the ball from Barea in the front court and made a 32-footer at the buzzer.\nMavericks: Devin Harris has missed all five regular season games after suffering a right big toe sprain in the team's final preseason game. ... The Mavericks scored more points (six) on the fast break in the first quarter than their game average of 4.5, the NBA's lowest.\nMISSING BOGUT\nLillard, who earlier this week said Golden State's defense was \"just not the same\" without Bogut this year, began exploiting Bogut's absence in the Dallas defense in the second quarter with an attacking style of play.\nLillard scored 10 points in the quarter, all of them a result of drives to the basket that ended in lay-ups or foul shots.\n\"He's a huge difference,\" Lillard said. \"He makes a huge difference for them defensively and offensively as a big that can catch the ball in the middle of the defense and make plays. And he protects the paint on defense.\"\nRALLY THE RESERVES\nThe Mavericks sliced into Portland's third-quarter lead, playing mostly with Barea and four reserves in the game. Justin Anderson scored two inside baskets and fired up the crowd with a block of Aminu's layup at the other end.\n\"They went hard. They had energy. They ignited the crowd,\" Dallas coach Rick Carlisle said. \"That's what this is going to take. It's a time when everyone is going to need to dig very deep.\"\nUP NEXT\nTrail Blazers: At Memphis on Sunday.\nMavericks: Host Milwaukee on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764996160.130938
}