{
  "game_id": "0022300901",
  "espn_id": "401585529",
  "date": "Mar 06, 2024",
  "matchup": "LAL vs. SAC",
  "headline": "De’Aaron Fox ties career high with 44 points as Kings roll to a 130-120 victory over Lakers",
  "body": "LOS ANGELES -- — Mike Brown is starting to run out of adjectives to describe De’Aaron Fox.\n\n\r\n              The Sacramento Kings coach might need a thesaurus with the type of season his high-scoring guard is having.\n\n\r\n              Fox tied a career high with 44 points as the Kings continued their mastery of the Los Angeles Lakers with a 130-120 victory Wednesday night. It was Fox’s seventh game this season with at least 40 points, fourth-most in the NBA.\n\n\r\n              “He was amazing. I hate using that word because to me that’s who he is,” Brown said. “It’s hard to score 44 points every single night, especially on the percentage that he did it at, but he is more than capable with his ability. It was a big game for him in a big-game environment.”\n\n\r\n              Malik Monk added 26 and Domantas Sabonis recorded his 22nd triple-double this season — and fourth in seven games — with 16 points, 20 rebounds and 12 assists as the Kings won their fourth straight over the Lakers dating to last season.\n\n\r\n              Sacramento has won six of the last seven against its Pacific Division rival and remained in seventh place in the Western Conference with a 35-26 record. The Kings are a half-game behind Phoenix for sixth and not having to take part in the play-in tournament.\n\n\r\n              “Right now where the standings are, if we lose this game, we’re half a game in front of them rather than 2 1/2 like it is now,\" Fox said. \"So right now especially to play teams that are around us in the standings, those games mean a little more.”\n\n\r\n              LeBron James led the Lakers with 31 points and 13 assists. He came out with 3:56 remaining with the game out of hand after tweaking his left ankle. James has been listed as questionable on the injury report since the All-Star break due to the ankle.\n\n\r\n              “Some games it's better than others. I didn't feel it during the Oklahoma City game (on Monday) and I didn't feel it tonight until the fourth quarter,” he said. “Some days are better than others.”\n\n\r\n              Rui Hachimura scored 29, while Anthony Davis had 14 points and 11 rebounds. \n\n\r\n              Los Angeles (34-30) had a chance to make up ground in the conference standings, but remain in 10th.\n\n\r\n              Sacramento came in having dropped three of its last four, including a 113-109 defeat against Chicago on Monday after it had a 22-point lead late in the third quarter.\n\n\r\n              The Kings appeared early as if Monday's loss was still bothering them as they fell behind by 19 points in the first quarter. But Sacramento dominated the second quarter, outscoring LA 44-20 to take a 72-57 advantage at halftime.\n\n\r\n              “We were getting deflections and getting out in transition which was huge for us in the second quarter,\" Fox said. \"We scored 44 points, but I think a lot of that was because of the way that we were playing defensively.”\n\n\r\n              A 3-pointer by D'Angelo Russell gave the Lakers a 37-18 advantage with 1:52 remaining in the first quarter before the Kings started to rally back.\n\n\r\n              Sacramento ended the opening 12 minutes with 10 straight points. The Kings trailed 48-40 before closing the half on a 32-9 run. \n\n\r\n              The Kings started their spurt with 10 straight points. Mitchell's 3-pointer tied it at 48 midway through the quarter before a dunk by Trey Lyles put them on top.\n\n\r\n              Sacramento was 13 of 14 from the field over the final 7:32 of the first half, including six 3-pointers. Mitchell and Fox scored nine points apiece and Monk added seven.\n\n\r\n              “They got a few easy opportunities in transition and they were able to get inside and make some tough shots. The sense of urgency we have to be able to maintain that,” Lakers coach Darvin Ham said. “We talk about forcing our will on the game. We obviously initiated it, but we didn’t sustain it and we damn sure didn’t finish it.”\n\n\r\n              The Kings' largest lead was 22 points late in the third quarter before the Lakers closed the stanza on a 15-5 run.\n\n\r\n              The Lakers, though, were never able to get it into single digits.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host San Antonio on Thursday.\n\n\r\n              Lakers: Host Milwaukee on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995495.1893408
}