{
  "game_id": "0021501209",
  "espn_id": "400829096",
  "date": "Apr 11, 2016",
  "matchup": "OKC vs. LAL",
  "headline": "Durant leads Thunder past Lakers in Bryant's last road game",
  "body": "OKLAHOMA CITY -- Thunder fans flocked to Chesapeake Energy Arena to see Kobe Bryant one last time.\nThey ended up getting a show from their own stars.\nKevin Durant scored 34 points and Russell Westbrook had a triple-double by halftime to help the Thunder beat the Los Angeles Lakers 112-79 on Monday night in the final road game of Bryant's 20-year career.\nKobe looked vintage in the first quarter with 13 points, but he went scoreless the rest of the way.\n\nWestbrook had his league-leading 18th triple-double of the season, and the 37th of his career. He finished with 13 points, 14 assists and 10 rebounds.\n\"I haven't seen anybody get triple-doubles as much as he has in a season,\" Bryant said. \"That's pretty outrageous, what he's been able to do all year long. It seems to fly under the radar with what Steph (Curry) is doing at Golden State and what they're doing as a team, but he's having a historical season. He's probably the most athletic player I've ever played against.\"\nWestbrook was honored to be a part of Bryant's last road trip.\n\"It was very special for me, man,\" he said. \"Growing up in L.A., a young boy watching the Lakers and watching him kind of take over the town, and to be here now, in the NBA, being a part of his last (road) game is something special to me. It's a blessing. It's something I never take for granted.\"\nPlenty of Lakers fans lined up at the arena more than two hours before the start, and the crowd chanted Bryant's name as they waited during pregame warmups. The Thunder honored him with a video before the tip.\nWestbrook finished the first half with 11 points, 10 rebounds and 10 assists as the Thunder led 58-48 at the break. He clinched the triple-double on an assist to Anthony Morrow for a 3-pointer with 11.9 seconds left in the second quarter. According to STATS, no player has clinched a triple-double before halftime since it began keeping track in 2002-03.\nDurant scored 16 points during a 26-6 run to start the second half, and the Thunder led 89-61 at the end of the third quarter.\nBryant sat down for good in the third quarter. In the fourth quarter, the crowd chanted \"We want Kobe,\" and \"Kobe,\" but the Thunder had the game well in hand. Lakers coach Byron Scott was most concerned about keeping Bryant healthy for the season finale Wednesday against Utah, so he didn't consider putting him back into the game.\n\"I wasn't thinking about it at all,\" Scott said. \"We were down 30 points. I wasn't going to put him in for a minute. At the six-minute mark, or something like that, of the third quarter, he was coming toward the sideline and I asked him how he felt. He was kind of like, `I'm all right.' I said, `Well, let's just end this right now and just get you ready for Wednesday.' There was no argument whatsoever. He just knew that at that particular time, he was done.\"\nDurant was glad the Thunder fans treated Bryant well.\n\"The fans did their job by showing him major love,\" Durant said. \"I know we competed against him so many times -- two playoff series against these guys, coming in here as one of the most hated players. They showed a lot of class tonight, as we expect our fans to do, and he came out and played well for them.\"\nCOURTSIDE\nOklahoma G Buddy Hield, who led the Sooners to the Final Four, sat in the front row. Bryant watched when Hield scored 37 points in the Sooners' Elite Eight win against Oregon.\nQUOTABLE\nBryant, on how he's similar to Westbrook: \"I didn't smile much on the court, either. He plays the game with such an energy and such aggressiveness. It needs to be appreciated.\"\nTIP-INS\nLakers: Bryant missed his first two shots, but made a 3-pointer about five minutes into the game. ... C Roy Hibbert was called for a Flagrant 1 foul in the third quarter on a shot by Steven Adams. ... Bryant scored 42 points in his final playoff game, a loss in Oklahoma City on May 21, 2012.\nThunder: Westbrook and Julius Randle were called for double technicals in the first quarter. ... Adams finished with 13 points and 15 rebounds. ... Remained unbeaten this season when Westbrook gets a triple-double.\nUP NEXT:\nLakers host Jazz on Wednesday.\nThunder play at Spurs on Tuesday.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .",
  "source": "espn_api",
  "crawled_at": 1764994116.4306612
}