{
  "game_id": "0022300218",
  "espn_id": "401584846",
  "date": "Nov 20, 2023",
  "matchup": "DET vs. DEN",
  "headline": "Reggie Jackson leads Nuggets past Pistons for 107-103 win after Nikola Jokic ejected",
  "body": "DETROIT -- — Reggie Jackson scored 21 points and carried Denver in the fourth quarter after two-time MVP Nikola Jokic was ejected in the first half, and the Nuggets handed the Detroit Pistons their 12th straight loss, 107-103 on Monday night.\n\n\r\n              Jackson had eight points and three assists in the final period as he and Kentavious Caldwell-Pope (20 points) shined against their former team. Michael Porter Jr. finished with 14 points and 11 rebounds for the defending NBA champion Nuggets (10-4), who ended a two-game skid.\n\n\r\n              “We were desperate tonight, because we were 0-2 on this road trip and we really needed a win,” Caldwell-Pope said. “We knew they were going to come out hard, because they hadn't won a game in a while, but we got it did done.”\n\n\r\n              Jokic and Denver coach Michael Malone were both ejected after arguing calls. Malone was thrown out for coming onto the court to dispute a call late in the first quarter, and Jokic was tossed for picking up a second technical with 1:22 left in the second period.\n\n\r\n              “I think Nikola was worried about my welfare,” Malone joked. “It is tough to watch a game on TV — we were hugging on good plays and I was cursing in Serbian on the bad ones.”\n\n\r\n              Jokic finished with nine points, five rebounds and five assists in 15 minutes. Jamal Murray (hamstring) missed his seventh straight game.\n\n\r\n              Cade Cunningham had 27 points and nine assists for the Pistons (2-13), while Marvin Bagley III finished with 18 points. Detroit has lost 36 of its last 40 games, dating to February.\n\n\r\n              “When you look at this stretch, it is a lot of losses, but I think there were some positives,” Pistons coach Monty Williams said. “There were just too many fouls and too many offensive rebounds allowed down the stretch.”\n\n\r\n              Aaron Gordon's three-point play gave the Nuggets a 106-103 lead with 1:25 to play, and Denver blocked shots on Detroit's next three possessions. That let the Nuggets run the clock down to 11 seconds, and Jackson hit one of two free throws to make it 107-103.\n\n\r\n              “Our guys know that, if you want to win a one-possession game on the road, you are going to have to get timely stops,” Malone said. “KCP probably made the defensive play of the game when Reggie got beaten off the bounce and he came over and got the stop without fouling.”\n\n\r\n              The Pistons didn't score in the last 1:41, missing their last four shots.\n\n\r\n              The Nuggets outscored the Pistons 25-24 in the third quarter to take a 81-79 lead, but Stanley Umude had eight points and an assist in Detroit's 10-3 run to start the fourth.\n\n\r\n              Denver struggled to score without Jokic, and Jaden Ivey's free throws put Detroit ahead 97-94 with 3:53 left. Jackson answered with a three-point play to tie it.\n\n\r\n              “This is obviously tough,” Ivey said. “Every single person in this locker room wants to win. We want to win for each other, the coaches, the organization, the fans and the city.”\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Orlando on Wednesday.\n\n\r\n              Pistons: At Indiana for an In-Season Tournament game on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995787.447008
}