{
  "game_id": "0021600594",
  "espn_id": "400900015",
  "date": "Jan 13, 2017",
  "matchup": "MIL vs. MIA",
  "headline": "Parker, Antetokounmpo lead Bucks past Heat, 116-108",
  "body": "MILWAUKEE --  The Milwaukee Bucks made quick work of the slumping Miami Heat.\n\nJabari Parker had 24 points, Giannis Antetokounmpo added 19 and the Bucks scored 42 first-quarter points in their 116-108 victory Friday night.\n\n\"The first quarter was a great carryover from our last game,\" Milwaukee coach Jason Kidd said, pointing to Bucks' victory Tuesday night in San Antonio. \"Guys were very willing passers and we got a lot of wide-open shots.\"\n\nGreg Monroe led the Bucks with 12 points off the bench in the opening quarter, their highest-scoring period of the season.\n\n\"I was just trying to come in and bring some energy and continue what the first team did,\" Monroe said.\n\nAntetokounmpo also had eight rebounds and six assists after being limited by illness throughout the week. Monroe finished with 16 points and 11 rebounds.\n\n\"You go and beat a great team like San Antonio and then come back here and you have to protect your home court,\" Monroe said.\n\nGoran Dragic and Hassan Whiteside each had 19 points for the Heat, and Luke Babbitt added a season-high 16. They have lost 10 of 11 games, including the last four on their trip.\n\n\"The first half was what got us in trouble,\" Babbitt said. \"There is no excuse for us not to come out harder.\"\n\nAfter leading by as many as 21 points in the first half, the Bucks maintained a large lead throughout the third quarter, pushing it to 22 at one point.\n\n\"Our margin for error is very thin. We have to compete at a high level for 48 minutes,\" Heat coach Erik Spoelstra said.\n\nThe Bucks allowed the Heat to get within eight points midway through the fourth. Antetokounmpo , who declined to speak with reporters after the game, then scored six straight points and the Bucks quickly built the lead back to 14 with about five minutes remaining.\n\nMiami cut the lead to seven with 16 seconds remaining, but would get no closer.\n\n\"I think everybody is looking forward to getting home. Not that anybody was thinking about it today, but it is cold here,\" Spoelstra said. \"So it will be nice to get home and see some sunshine.\"\n\nCHANGING COURSE\n\nThe last time the teams met, in November, Miami held Milwaukee to a season-low 73 points in notching the victory. The Bucks surpassed that mark with 8:57 remaining in the third quarter.\n\nFREAKY FRIDAY\n\nAntetokounmpo had another highlight reel dunk in the first quarter. He took off from just inside the foul line for a double-pump slam. \"I never saw anything like it in my life,\" Monroe said. \"They call him the Greek Freak for a reason. That was the freak part.\" The dunk also left Kidd shaking his head. \"I don't know what he did. I know he jumped and then he did some things in the air,\" Kidd said. \"It was a heck of a play.\"\n\nSTARTER FOR NOW\n\nRookie Malcolm Brogdan made his eighth consecutive start for the Bucks, but he could soon relinquish that role. (Brogdan) has done quite well,\" Milwaukee coach Jason Kidd said. \"He's starting now until (Matthew Dellavedova) gets back into the swing of things. We'll address that here in a week or so. They are two guys who put the team first. As for Malcolm, he just wants to play. He deserves to play.\"\n\nTIP-INS\n\nHeat: Center Willie Reed sat out with a bruised sternum, leaving Miami with just 10 available players, all of whom played.\n\nBucks: Antetokounmpo logged 37 minutes after being limited to nine minutes at San Antonio on Tuesday night while struggling with an unspecified illness that also caused him to miss Sunday's home game against Washington.\n\nUP NEXT\n\nHeat: Host Houston on Tuesday in the first of two regular-season matchups. The Heat have won six of their last seven against the Rockets in Miami.\n\nBucks: Travel to Atlanta for a matinee matchup Sunday. The Hawks have won three consecutive games and six of the last eight against Milwaukee.",
  "source": "espn_api",
  "crawled_at": 1764995189.294831
}