{
  "game_id": "0021701059",
  "espn_id": "400975805",
  "date": "Mar 20, 2018",
  "matchup": "OKC @ BOS",
  "headline": "Marcus Morris' 3 lifts Celtics over Thunder, 100-99",
  "body": "BOSTON --  The Celtics have spent most of the past month short-handed, with several of their key players sidelined by injuries.\n\nIt didn't stop them from finding a way to stun one of the league's hottest teams.\n\nMarcus Morris made a 3-pointer with 1.2 seconds left and the Boston shocked the Oklahoma City Thunder 100-99 on Tuesday night.\n\n\"Probably my biggest (shot),\" Morris said. \"I've hit a couple to tie it up. But was my first actual to win it.\"\n\nJayson Tatum led the Celtics with 23 points and 11 rebounds. Morris added 21 points as Boston snapped the Thunder's six-game win streak.\n\nRussell Westbrook finished with 27 points, eight rebounds and seven assists for Oklahoma City, which fell apart in the closing minute.\n\nBoston took an 82-81 lead in the fourth quarter on a 3-pointer by Shane Larkin, who finished with 17 points off the bench.\n\nThe Thunder missed 15 of their first 21 3-point attempts before making four straight to go back in front 93-89.\n\nBoston closed to 99-97 on a 3 by Terry Rozier, and quickly fouled Carmelo Anthony with 7.7 seconds remaining. Anthony missed both attempts and the Celtics gathered the rebound.\n\nOut of the timeout, Tatum dribbled across the lane and found Morris on the wing for the go-ahead 3.\n\n\"It was a tough shot,\" Paul George said. \"We live with him taking that shot. He made it. Kudos to him for making big shots.\"\n\nWestbrook was able to get off a long 3-pointer on the Thunder's final possession, but it came up short at the buzzer.\n\n\"We hit a couple of big shots there and kind of opened up the gap a little,\" Anthony said. \"I missed those two free throws that could have easily sealed the game.\"\n\nTatum acknowledged that the game-winning play was actually the result of a busted play in which he missed an assignment.\n\nBut he was willing to take at least some credit, though. As Tatum walked past Morris as he was being interviewed by reporters he shouted, \"It was a really ideal pass! But, great shot, though!\"\n\nWith Kyrie Irving sitting out for the fourth straight game nursing a sore left knee and Jaylen Brown still in the concussion protocol, Tatum and Rozier continued to pick up the slack.\n\nBoth were active throughout. Rozier had probably the most electrifying stretch late in the second quarter when he scored eight straight points to give the Celtics their largest lead of the first half at 41-36.\n\nThe series included Rozier picking up an errant pass by Westbrook and then gliding in for one-handed dunk over Steven Adams on the ensuing fast break . Rozier finished with 14 points, six rebounds and six assists.\n\nWestbrook scored 12 points in the third quarter to give Oklahoma City a 75-65 cushion. But Boston closed the period with eight straight points, including a 3-pointer at the buzzer by Larkin.\n\nCeltics coach Brad Stevens said Tatum's role will only increase with guys still out.\n\n\"We're going to just keep throwing him to the wolves and keep going to him in those moments,\" Stevens said.\n\nTIP-INS\n\nThunder: Went 10 of 27 from the 3-point line. ... Were outrebounded 52-44.\n\nCeltics: Tatum has scored 15 or more points in four of his last five games. He had only one such game in his nine previous games.\n\nEXTRA MOTIVATION\n\nTatum, who finished with 20 points and 10 rebounds for the first time in his career, said the Celtics' double-overtime loss at home to Washington last week was on his mind in the closing minutes of Tuesday's win.\n\n\"I know what I was thinking about when we lost to the Wizards and how close a game that was,\" he said. \"With guys out we don't want to make excuses and especially after losing the game before, you don't want to lose two games in a row.\"\n\nINJURY UPDATES\n\nStevens said Irving will not accompany the team on its four-game road trip, which begins Friday at Portland.\n\nInstead, the All-Star point guard will be getting a second opinion on the knee, which has kept him sidelined since March 13.\n\n\"He's had some really good days recently,\" Stevens said. \"So I'm encouraged by it in the big picture.\"\n\nBrown did some light pregame shooting, though he remains in the NBA concussion protocol following his scary fall against the Timberwolves. Stevens said is to be determined whether he will go on the upcoming trip.\n\nUP NEXT\n\nThunder: Hosts Miami on Friday.\n\nCeltics: At Portland on Friday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993077.857381
}