{
  "game_id": "0022300822",
  "espn_id": "401585450",
  "date": "Feb 25, 2024",
  "matchup": "HOU vs. OKC",
  "headline": "Gilgeous-Alexander has 36 as Thunder win 5th straight with 123-110 victory over Rockets",
  "body": "HOUSTON -- — Shai Gilgeous-Alexander scored 36 points and Chet Holmgren added 29 to lead the Oklahoma City Thunder to a 123-110 victory over the Houston Rockets on Sunday night.\n\n\r\n              The Thunder won their fifth straight to move into a tie with Minnesota for first place in the Western Conference.\n\n\r\n              Oklahoma City coach Mark Daigneault was impressed with how his team responded after falling behind by 16 points in the second quarter. \n\n\r\n              “We had some poise, but it was more urgency,” he said. “I thought tonight was a recognition of, if we kept playing like that, they could have run us off the floor.”\n\n\r\n              Oklahoma City was up by eight points with less than seven minutes left before scoring the next nine points, capped by 3-pointers from Jalen Williams and Gilgeous-Alexander to push the advantage to 115-98 with 3 ½ minutes to go.\n\n\r\n              Fred VanVleet and Jabari Smith Jr. had 20 points apiece for the Rockets in the first of consecutive games between these teams. Alperen Sengun added 19 points and 12 rebounds, while Smith led the team with 17 boards.\n\n\r\n              “They tightened up a little bit and we didn't execute as well as we needed to,” VanVleet said. “That's the way it goes sometimes.”\n\n\r\n              The teams meet again Tuesday night in Oklahoma City.\n\n\r\n              The Thunder held a four-point lead to start the fourth and used a 12-2 run to push their advantage to 99-85 with 9 ½ minutes to go. Holmgren had the first nine points in that span and had two dunks and a 3-pointer.\n\n\r\n              Houston got within 104-95 a couple of minutes later. Dillon Brooks and VanVleet both made 3s for Houston to trim the deficit, but the Rockets were unable to get any closer.\n\n\r\n              “Once we got the ball churning and moving… that got us flowing,” Holmgren said. “But it started with defense, getting stops and allowing us to get out in transition.”\n\n\r\n              The Rockets were up by nine with about eight minutes to go in the third before Oklahoma City used a 16-2 run to take an 80-75 lead with less than three minutes left in the quarter.\n\n\r\n              “The physicality we really amped up midway through the second quarter,” Daigneault said. “That was the game right there and we really kept it going in the second half.” \n\n\r\n              Williams started the run with a 3-pointer and Isaiah Joe added a 3 in that stretch to allow the Thunder to go on top.\n\n\r\n              The Rockets scored the next six points to regain the lead, but Oklahoma City ended the quarter with a 7-2 run to take an 87-83 lead in the fourth. \n\n\r\n              “Obviously you have to execute better offensively to give yourself a chance,” VanVleet said. “Scoring 21 in the third hurt us a little bit momentum-wise.”\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995589.652308
}