{
  "game_id": "0021800662",
  "espn_id": "401071338",
  "date": "Jan 16, 2019",
  "matchup": "CLE @ POR",
  "headline": "Nurkic has triple-double and Blazers beat Cavaliers 129-112",
  "body": "PORTLAND, Ore. --  Trail Blazers big man Jusuf Nurkic finally got his triple-double.\n\nLess than a week of coming up just two assists shy of the feat, Nurkic got his first career first triple-double with 10 points, 10 rebounds and 10 assists in Portland's 129-112 victory over the Cleveland Cavaliers on Wednesday night.\n\nNurkic said he wasn't aware he was close until teammate Damian Lillard let him know.\n\n\"Dame was like, `one more,' Nurkic said.\n\nLillard got the ball to Nurkic, who it passed back to Lillard, who knocked down a 3-pointer -- giving Nurkic his final assist.\n\nWhen told that Lillard celebrated along with the crowd afterward, Nurkic laughed: \"He's my teammate. My brother. He should.\"\n\nLillard himself had 33 points to lead all scorers, and CJ McCollum had 19 points as Portland snapped a two-game losing streak. Nurkic added five blocks and was treated to a standing ovation when he left the game with 2:13 left.\n\nPortland finished with 16 3-pointers, led by Lillard with four.\n\nJordan Clarkson had 22 points off the bench for the Cavaliers, who were coming off a 101-95 victory over the Lakers that snapped a 12-game losing streak. The game against the Blazers was the fourth of a six-game trip for the Cavs.\n\nThe teams combined for only seven turnovers, the fewest in an NBA game since the league began to officially compile the stat in 1970-71. Portland had four and Cleveland finished with three.\n\nThe Blazers led by as many as 21 points in the third quarter, but Cleveland closed the gap to 112-102 midway through the fourth. It was as close as the Cavs could get.\n\n\"I just thought we kind of ran out of gas. They guys did a good job getting us back to within 10 but we just weren't able to sustain it.  When you get down and you have to fight back against a team like this it's tough. On the road you can't dig those types of holes. Not against a good team,\" Cleveland coach Larry Drew said.\n\nPortland was back at home after a winless two-game trip at Denver and Sacramento. The Blazers have won 19 at home to lead in the Western Conference.\n\nLillard started despite being listed as questionable going into the game with a right hand strain. It is unknown when he was injured.\n\nLillard opened the game with back-to-back 3-pointers and the Blazers had six 3s in the opening quarter to lead 30-26. Portland finished the first half with 11 3-pointers, while the Cavaliers had just two. Portland led 62-55 at the break.\n\nPortland stretched the lead to 70-59 on Jake Layman's 15-foot jumper in the third quarter. Lillard's 3-pointer made it 82-66 midway through the third and Portland went on to lead by as many as 21.\n\nRodney Hood added 20 points for the Cavaliers.\n\n\"They're just a well-oiled machine,\" Hood said about the Blazers. \"When I was playing with Utah I played against these guys four times a year. They know what they do. They know what they want to accomplish. They have probably the best scoring backcourt in the league.\"\n\nNurkic fell two assists shy of a triple-double last Friday Portland's 127-96 victory over the Charlotte Hornets. The 7-foot Bosnian had 11 points, 11 rebounds and tied career highs with eight assists and six blocks.\n\nPortland was without Maurice Harkless for the fifth straight game because of left knee soreness, which has hampered him at times throughout the season. There was no word on how long Harkless might be out.\n\nThe Cavaliers have been stung by injuries this season. David Nwaba was considered a possibility for Wednesday, but he was held out for a 11th straight game with a left ankle sprain. Larry Nance Jr. missed his fourth game with a right knee sprain.\n\nTIP INS\n\nCavaliers: Cleveland signed guard Cameron Payne to a second 10-day contract late Tuesday night. ... The victory over the Lakers was just the Cavs' fourth win on the road this season. ... Cleveland has won consecutive games just once this season. ... Cleveland's bench outscored Portland's 66-35.\n\nTrail Blazers: Portland had won their last five games at home against the Cavs. ... Portland had six players in double figures. ... It's been five years since Portland's last triple-double, by Nicolas Batum.\n\nBATUM TEXTS: Blazers coach Terry Stotts said he exchanged texts with Batum, who now plays for Hornets. Stotts joked that Batum was upset they'd left Nurk in the game against Charlotte to threaten his mark.\n\n\"Matter of fact, he texted me when Nurk didn't get his triple-double so now I texted him when he did,\" Stotts said. Asked if he'd heard from Batum about Nurkic finally getting one, Stotts said, \"Yeah, I won't tell you what he said.\"\n\nUP NEXT\n\nCavaliers: Cleveland visits the Jazz on Friday.\n\nTrail Blazers: Portland hosts the Pelicans on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994772.338947
}