{
  "game_id": "0021800728",
  "espn_id": "401071401",
  "date": "Jan 25, 2019",
  "matchup": "PHX @ DEN",
  "headline": "Nuggets overcome Jokic suspension to beat Suns 132-95",
  "body": "DENVER --  When the NBA handed down Nikola Jokic's one-game suspension Friday afternoon, Denver Nuggets coach Michael Malone called for two things: an explanation from the league and a second shootaround from his players.\n\nHe appreciated the first and was satisfied with the second after the Nuggets rallied around their star center's absence in routing the Phoenix Suns 132-95 on Friday night.\n\n\"The league was great, and I mean this,\" Malone said, adding the NBA apologized for not informing him of Jokic's suspension before the Nuggets' noon shootaround.\n\n\"They were just busting my chops in there because we brought them back in the afternoon just to walk through the plays once we knew who was in, who was out,\" Malone said after emerging from his victorious locker room. \"But, whatever it takes for a win.\"\n\nMason Plumlee laughed about the extra pre-game practice.\n\n\"I don't think anyone was happy\" about it, he said. \"Did we need it? I don't know. He can say it was the right move now because we played well.\"\n\nPaul Millsap had 20 points to lead eight Nuggets in double figures, and Denver held the Suns to 40 second-half points in handing Phoenix is seventh straight loss.\n\nJokic, the Nuggets' leader in points, rebounds and assists, was banished for a night by the NBA for leaving the bench during an altercation in Utah two nights earlier.\n\nAlthough the suspension forced him to juggle his lineup and rotations, Malone said it didn't \"change our focus at all because that should not change no matter who's playing in uniform. Obviously, when you are down your best player and an All-Star, other guys have to step up.\"\n\nThat, they did.\n\nPlumlee got the start in Jokic's absence and had 16 points, six assists and seven rebounds in 25 minutes.\n\n\"People forget, Mason Plumlee was a starter on a playoff team\" in Portland, Malone said. \"So, as much as we love Nikola, with Nikola not being here tonight, Mase is more than capable of taking those minutes and playing like Nikola.\"\n\nAll five starters reached double digits and so did reserves Malik Beasley (19 points), Monte Morris (17) and Trey Lyles (12).\n\n\"That's what good teams do,\" Malone said. \"When somebody's not here, somebody else steps up.\"\n\nJokic's absence sure didn't turn into a blessing for Phoenix.\n\n\"They didn't need him the way they played -- or the way we played,\" Suns coach Igor Kokoskov said.\n\nDevin Booker led the Suns with 35 points. They were without their own big man with DeAndre Ayton missing the game with a sprained left ankle.\n\n\"We know we didn't play well tonight,\" Booker said. \"It was kind of embarrassing.\"\n\nVANDERBILT DEBUT\n\nNuggets rookie Jarred Vanderbilt, a 19-year-old selected in the second round of the NBA draft out of Kentucky, made his pro debut in the waning minutes after recovering from ankle and foot injuries.\n\n\"I'm happy he got that first-game jitters out of the way,\" said Malone, who wants Vanderbilt to get his legs under him in the G-League.\n\nIn 3 minutes, Vanderbilt had a point, an assist on a full-court pass, a steal and three rebounds, then was doused by a couple of teammates with two cups of Gatorade.\n\n\"He's in the league now,\" Plumlee said.\n\nLIGHT WORK\n\nJamal Murray scored 13 points but rolled his troublesome ankle again. Malone said with the big lead, there was no reason to put him back in.\n\n\"That was the good thing about tonight as well: our starters, nobody played crazy minutes,\" Malone said. \"We were able to play a lot of guys with tomorrow being our third game in four nights, that's always important.\"\n\nTIP-INS\n\nSuns: Several of Ayton's teammates were out with him, including his backup, Richaun Holmes (right foot). Forward T.J. Warren (sore right ankle) and guard De'Anthony Melton (right ankle) also missed the game. ... The Suns fell to 4-21 on the road.\n\nNuggets: Denver outscored Phoenix 26-2 on second-chance points. ...  Denver won the season series 3-1. ... The Nuggets improved to 21-4 at home. ... The Nuggets closed out the first half on a 23-8 run for a 70-55 lead. ... Denver improved to 15-1 when holding opponents below 100 points.\n\nUP NEXT\n\nSuns: Visit the Los Angeles Lakers on Sunday night.\n\nNuggets: Host the Philadelphia 76ers on Saturday night when they get Jokic back.\n\n----\n\nFollow Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995119.7078888
}