{
  "game_id": "0022200203",
  "espn_id": "401468358",
  "date": "Nov 14, 2022",
  "matchup": "LAC @ HOU",
  "headline": "George scores 22 to lead Clippers to 122-106 rout of Rockets",
  "body": "HOUSTON -- — Paul George scored 22 points in three quarters to lead the Los Angeles Clippers to 122-106 rout of the Houston Rockets on Monday night. \n\n\r\n              George, who also had eight rebounds and five assists, spent the fourth quarter on the bench with the game in hand as coach Tyronn Lue didn’t play his starters in the final period on the front end of a back-to-back. \n\n\r\n              “It was good being able to finish the game the right way and give our starters some rest with a game tomorrow night,” Lue said. \n\n\r\n              Los Angeles led by 11 to start the fourth and the team’s reserves played well enough to not only hold the lead but pad it as the Rockets struggled.\n\n\r\n              “Our bench came in and really did a good job of making the right plays and finishing things,” Lue said. \n\n\r\n              The Clippers had a 13-point lead with about eight minutes remaining when Terance Mann and Norman Powell both converted three-point plays before another basket by Mann made it 108-87 about 90 seconds later. \n\n\r\n              Rockets coach Stephen Silas called a timeout to try and slow down the Clippers as fans started streaming toward the exits.\n\n\r\n              Kevin Porter Jr. made a basket out of the timeout for Houston. But then Powell hit a layup seconds later to start a 6-2 mini-run that made it 114-91 with 4 1/2 minutes left. \n\n\r\n              “That is a dangerous young team and anything can happen,\" Lue said. “So we wanted to make sure that we came out professional and played well.”\n\n\r\n              Jalen Green had 25 points and Porter added 20 for the Rockets, who shot 9 of 30 from 3-point range and dropped their third in a row. \n\n\r\n              Silas said he could sense some frustration from his team, and learning to overcome that is something his young players will need to learn.\n\n\r\n              “When you hit adversity, not letting the frustration get to you is something that young guys have to work on,” he said. \n\n\r\n              Reggie Jackson had 17 points and six assists to help the Clippers win for the third time in four games. \n\n\r\n              The Clippers led by 15 after a dunk by Ivica Zubac with about 4 1/2 minutes left in the third quarter. Houston then used a 12-6 spurt, with eight points from Green, to cut the lead to 87-78 three minutes later. Kenyon Martin Jr. capped the drive with a dunk but got a technical for yelling at Zubac to celebrate it.\n\n\r\n              George missed the technical foul shot, but Nicolas Batum added a jumper after that to leave the Clippers up 89-78 entering the fourth. \n\n\r\n              TIP-INS\n\n\r\n              Clippers: Kawhi Leonard, who hasn’t played since Oct. 23 while dealing with knee soreness, made the trip but Lue said he didn’t know if Leonard would play Tuesday night at Dallas. ... Marcus Morris had 15 points. Powell finished with 17, and Mann scored 14. \n\n\r\n              Rockets: Silas said Jae’Sean Tate, out since Oct. 31 with an ankle injury, will be sidelined at least two to three more weeks before he is re-evaluated. … Alperen Sengun had 16 points. ... The Rockets made 19 of 31 free throws. \n\n\r\n              STARS OUT \n\n\r\n              Rapper 50 Cent and Houston Astros shortstop Jeremy Peña, fresh off winning the World Series MVP award, sat courtside. \n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit the Dallas Mavericks on Tuesday night. \n\n\r\n              Rockets: Play at Dallas on Wednesday night. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994992.748208
}