{
  "game_id": "0021700881",
  "espn_id": "400975627",
  "date": "Feb 23, 2018",
  "matchup": "PHX vs. LAC",
  "headline": "Williams, Clippers rout sinking Suns 128-117",
  "body": "PHOENIX --  The Los Angeles Clippers made quick work of the Phoenix Suns, very quick.\n\nFive minutes into the game, the Clippers led 19-0 and the staggering Suns never recovered.\n\nSuper-sub Lou Williams had 35 points in 33 minutes -- including a 23-point second quarter -- and the Clippers and handed the Suns their eighth loss in a row, 128-117 on Friday night.\n\nTobias Harris added 30 points and 12 rebounds for the Clippers. They have won eight of 11.\n\nLos Angeles shot 63 percent in a 79-point first half, the franchise's highest-scoring half since the then-San Diego Clippers scored 87 against Utah 34 years ago.\n\nClippers coach Doc Rivers likes what he's seen out of his retooled squad.\n\n\"Everybody trusts everybody,\" he said. \"We kind have this feed the pig principle and if one guy gets going you stay with him.\"\n\nDevin Booker and T.J. Warren scored 27 apiece for the Suns, who have dropped 13 of their last 14 and 18 of their last 21 games. Alex Len had 14 points and 13 rebounds.\n\nThe 19-0 start to a game was the most on record for the Clippers and most for any team since Washington scored the first 20 against Brooklyn last April 11.\n\nLos Angeles' 79 points at the half were the most since the then-San Diego Clippers scored a franchise-record 87 against Utah on April 14, 1984.\n\n\"That was great,\" Rivers said. \"When you give yourself a cushion like that you can play awful in the third quarter and still win by a lot.\"\n\nPhoenix never cut the lead to single digits after that 19-0 start.\n\n\"When we get a lead like that you get in a little comfort zone but for us to get to where we want to get you can't fall in that trap,\" Harris said. \"We got to stay with it every single night, every single minute.\"\n\nJosh Jackson, who scored 19 points in the game, finally ended the drought with a driving layup with 7:09 to play in the quarter.\n\n\"Inexcusable,\" Suns interim coach Jay Triano said. \"We knew that they're an iso (isolate) team and they were going to put it down and drive it right at us and they did and we couldn't keep anyone in front of us.\"\n\nTriano said his young team practices harder than it plays.\n\n\"Why do we practice against each other harder than we play in front of 15,000 people?\" he said. \"We practice downstairs, we'll kill each other, we jump in front, we do everything. When the lights come on, I don't know if it's nerves, fear, experience, we just back up, back up and give in.\"\n\nAustin Rivers' step-back 3-pointer was the final basket of the first quarter and Los Angeles led 40-18.\n\nThat's when Williams heated up. After taking two shots, and missing them, in the first quarter, the scoring machine off the Clippers bench scored 23 in 23 minutes in the second quarter, making 9 of 12 shots, 3 of 5 3s.\n\nWilliams scored 16 in the final 4 1/2 minutes of the first half. His 16-foot fadeaway jumper with three seconds left gave Los Angeles its biggest lead of the night, 79-50, at the half.\n\nPhoenix cut it to 15 in the third quarter, 87-72, on Len's 13-footer with 3:20 left.\n\nThe closest the Suns got after that was the final 11-point margin.\n\n\"We can't come out with mindset here we have to get punched in the face and then fight back,\" Booker said. \"We've got to be the aggressors.\"\n\nTIP INS\n\nClippers: Los Angeles has won seven straight over the Suns and 16 of the last 18. ... Williams and Harris were second Clippers duo to top 20 points apiece in same games. Williams and Rivers have done it twice. ... Los Angeles won on second night of back-to-back games for only second time this season. ... Williams is on pace to be the highest-scoring reserve in the NBA since at least 1983-84, when the Suns' Eddie Johnson averaged 21.5 and won NBA Sixth Man Award.\n\nSuns: C Tyson Chandler (neck) did not play. ... Signed G Shaq Harrison to a 10-day contract. .... After the first five minutes of the game, Suns outscored Clippers 117-109. ... Phoenix remains tied with Atlanta for most losses in NBA at 42.\n\nUP NEXT\n\nClippers: At Denver on Tuesday night.\n\nSuns: Host Portland on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764993895.694687
}