{
  "game_id": "0022200524",
  "espn_id": "401468679",
  "date": "Dec 29, 2022",
  "matchup": "CLE @ IND",
  "headline": "Haliburton, Hield combine for 11 3s, Pacers top Cavs 135-126",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton scored 29 points, Buddy Hield made a 3-pointer three seconds into the game and added 25, and the Indiana Pacers beat the Cleveland Cavaliers 135-126 on Thursday night.\n\n\r\n              Haliburton was 6 for 8 from 3-point range and Hield, who leads the NBA in 3-pointers, was 5 for 6. The Pacers finished 19 of 31 from beyond the arc. \n\n\r\n              “You can't ask for much better shooting than that,” said Pacers forward Aaron Nesmith, who had 22 points. “They shoot the ball like that, it's going to be tough to beat us any night.”\n\n\r\n              Indiana trailed by seven early in the fourth quarter before rallying. Hield fed Nesmith for a go-ahead dunk to give the Pacers a 120-119 lead with 4:26 remaining. \n\n\r\n              “This is the most fun I’ve had playing basketball in a very long time,” said Nesmith, a third-year pro acquired from Boston in the offseason.\n\n\r\n              Haliburton converted a three-point play on the next possession and the Pacers never surrendered the lead. \n\n\r\n              “This game was about our defense, or the lack of it,” said Cavaliers coach J.B. Bickerstaff, whose team ranks No. 1 in fewest points allowed at 105.5 per game. “We decided we wanted to play Indiana Pacers basketball and that's their strength. We didn't play Cleveland Cavaliers basketball and play to our strength.”\n\n\r\n              Bennedict Mathurin scored 23 points and Myles Turner 14 as Indiana snapped a five-game losing streak against the Cavaliers, who have lost three in a row.\n\n\r\n              “Any time the ball is going into the basket like that, you feel good,” said Pacers assistant coach Lloyd Pierce, who took over after Rick Carlisle was ejected. \"But (the Cavaliers) are capable of doing that. And that's scary for us.\n\n\r\n              “When the ball goes into the basket, it makes you want to play that way. We have to play that way. And Ty is our leader. He's going to set the tone and the pace for us.\"\n\n\r\n              All-Star guard Donovan Mitchell scored 28 points to lead a balanced Cleveland offense with seven double-digit scorers. Mitchell sank five of the Cavaliers' 12 3-pointers.\n\n\r\n              “We kept giving up 3s,” Bickerstaff said. “The 3-ball is the way back into the game. It’s personnel-driven, understanding the person you’re guarding, being on high alert that that’s what they are looking for. I just didn’t think we had the focus on the defensive end of the floor because we were scoring points. We have to be able to do both.\"\n\n\r\n              Cleveland's Caris LeVert and Jarrett Allen each had 19 and All-Star guard Darius Garland finished with 18 points and eight assists.\n\n\r\n              The 3-point barrage began just three seconds in as the opening tip was batted directly to Hield, who turned and swished a shot that was the fastest 3-pointer recorded since play-by-play began in 1996-97. In the first half, the Pacers hit 9 of 15 from beyond the arc and the Cavaliers 7 of 13. The Cavaliers led 68-64 at halftime.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Dropped to 6-10 on the road. ... Forward Cedi Osman (back) was a last-minute inactive and center Robin Lopez (illness) missed his second consecutive game.\n\n\r\n              Pacers: Carlisle was assessed two technicals and ejected with 1:29 remaining in the third quarter after arguing that an off-balance Mitchell threw the ball off the backboard to himself. ... Mathurin leads the league in bench scoring at 17.6 points per game.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Chicago Bulls on Saturday.\n\n\r\n              Pacers: Host L.A. Clippers on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995243.4924412
}