{
  "game_id": "0021300904",
  "espn_id": "400489777",
  "date": "Mar 05, 2014",
  "matchup": "CHA vs. IND",
  "headline": "Al Jefferson powers Bobcats' upset of Pacers",
  "body": "CHARLOTTE, N.C. -- Al Jefferson had a pretty good inkling it was Charlotte's night when he banked in a 31-footer from well beyond the top of the key to beat the shot clock midway through the fourth quarter.\n\"I didn't call the bank, but I trusted my right hand,\" Jefferson said with a laugh.\nJefferson scored 34 points and the Bobcats stunned NBA-leading Indiana 109-87 Wednesday night, handing the Pacers just their second two-game skid of the season. Jefferson was 16 of 25 from the field and had eight rebounds for the Bobcats (28-33), who won their fifth straight at home to equal their combined win total from the previous two seasons.\n\"I'm not accepting that we're a team that guys look at on the schedule anymore and say, 'OK, we have the Bobcats (so) we can take the night off.\" Jefferson said.\nJefferson, whose 38-point, 19-rebound effort Monday night was overshadowed by LeBron James' career-high 61-point outing, has scored at least 20 points in 21 of his last 24 games.\n\"I think everybody needs to question the Eastern Conference voting on why Al Jefferson wasn't on the All-Star team because clearly he is one of the best in the game,\" Pacers coach Frank Vogel said. \"He showed it tonight. Give him credit.\"\nCharlotte was finishing a brutal four-game stretch, becoming the first team since the 2009-10 Knicks to play the NBA's top four teams in consecutive games. They previously lost to San Antonio, Oklahoma City and Miami on the road, but left no doubt about this this one.\nCharlotte jumped out to a 28-8 lead after the first quarter and never trailed.\nKemba Walker added 19 points and nine assists for the Bobcats, who have the seventh-best record in the Eastern Conference.\nBobcats coach Steve Clifford said he thought his team played well in the road losses to the Spurs, Thunder and Heat and that it carried over some confidence to Wednesday night.\n\"We played a lot of good basketball and you get nothing for it,\" Clifford said. \"To be honest, we took a day off (on Tuesday) and you could tell from our shootaround, not that we were going to win, but that we were going to play well.\"\nEvan Turner had 22 points for the Pacers (46-15), who lost back-to-back games for only the second time this season.\nCharlotte's Michael Kidd-Gilchrist said he was \"extra fired up\" to defend All-Star Paul George, two nights after James destroyed the Bobcats by knocking down 8 of 10 3-pointers.\nKidd-Gilchrist did his job, holding George without a field goal. George was 0 for 9 and finished with just two points.\nJefferson defended Kidd-Gilchrist's effort against Miami, saying he did the job asked of him against James.\n\"Against LeBron, the game plan was we didn't want him to get to the basket,\" Jefferson said. \"We want LeBron to shoot jumpers. If he hits 8 of 10 3-pointers, we can live with that.\"\nGeorge said he wasn't at the top of his game against Charlotte.\n\"I was sore,\" George said. \"I tried to play through it thinking it would loosen up. It was a tight night for me.\"\nThe Pacers had won 14 of their last 15 against the Bobcats coming in, including five straight by an average of nearly 18 points.\nBut Indiana was sluggish from the start, shooting 4 of 20 from the field in the opening quarter and turning the ball over six times, leading to 12 Charlotte points and a 20-point deficit.\nThe Pacers, shooting at the home end of the floor where some of the lights were out, were held to eight points -- the fewest allowed in a quarter this season by the Bobcats.\nWhile the Pacers were struggling on offense, Jefferson was at it again on the offensive end. He hit his first six shots and had 20 points at the break.\nThe Pacers would battle back to cut the lead to four in the second quarter, but the Bobcats never surrendered the lead and stretched the lead back to 18 again by the end of the third quarter.\nThe Bobcats shot 51 percent from the field against the NBA's top defensive team.\nThe 22-point loss was the third-largest of the season for the Pacers.\n\"Charlotte's a good basketball team,\" Vogel said. \"They're rested. We are coming in here in this situation in their house. We beat them pretty handily the first couple of times. So, we knew they were going to come out and we were going to have to play great and we didn't play great.\"\nGame notes\nChris Douglas-Roberts got the start in place of Gerald Henderson, who missed his second straight game with a strained calf. ... The only other time the Pacers lost back-to-back games this season came Dec. 16 and 18 against Detroit and Miami. ... The Bobcats are 14-3 at home when scoring at least 91 points.",
  "source": "espn_api",
  "crawled_at": 1764993149.089225
}