{
  "game_id": "0022301173",
  "espn_id": "401585801",
  "date": "Apr 12, 2024",
  "matchup": "CHA @ BOS",
  "headline": "Payton Pritchard scores a career-high 31 points as Celtics rest starters and cruise past Hornets",
  "body": "BOSTON -- — Payton Prichard scored a career-high 31 points and the Boston Celtics rolled to a 131-98 win over the Charlotte Hornets on Friday night. \n\n\r\n              Pritchard added 11 assists for his second double-double this season and helped the Celtics avoid losing three consecutive games in a season for the first time since 2010-11.\n\n\r\n              Luke Kornet finished with 16 points and 10 rebounds, and Sam Hauser and Neemias Queta both also had 16 points for Boston, which led by as many as 33 and had only six turnovers.\n\n\r\n              Pritchard will be counted on coming off the bench in the playoffs and coach Joe Mazzulla said his performance was indicative of how much he has grown and bought into his role this season.\n\n\r\n              “Just being a complete player from the standpoint of every game is going to be different,\" Mazzulla said. “He affects the game in many different ways. Obviously, having a consistent role for an entire season is really beneficial.” \n\n\r\n              The Celtics’ top six rotation players – Jayson Tatum, Jaylen Brown, Jrue Holiday, Derrick White, Kristaps Porzingis and Al Horford – all sat out with nagging ailments in what was essentially a rest night for them. Boston has already locked up the top seed in the Eastern Conference and home-court advantage throughout the playoffs.\n\n\r\n              They likely will get another rest day Sunday when Boston concludes its regular season schedule against Washington.\n\n\r\n              That also will probably mean another start Pritchard, who's looking to appear in all 82 regular-season games for the first time in his four-year career. \n\n\r\n              “It's definitely a big accomplishment for me,” Pritchard said. “To play 82 games is tough, but through the summer, the work that I put in to get my body ready for that (helped). But also just the journey of me, last year, my second year, of times when I didn't play at all, how frustrating that is and how much that hurt at times. But that just fueled me to keep working.”\n\n\r\n              Tre Mann led the Hornets with 19 points and eight assists. Nick Smith Jr. added 15 points.\n\n\r\n              The absences gave the Celtics the opportunity to give some playing time to rookie Jordan Walsh and call up two-way players Queta, JD Davison and Drew Peterson from the G League to fill in, a night after they all played with Maine at Oklahoma City in Game 2 the G League Finals. Maine hosts Oklahoma City Blue in Portland on Sunday to crown the G League champion.\n\n\r\n              The Hornets have been eliminated from playoff contention since March 23 and played without former Celtic Grant Williams, who was listed out with a sprained right ankle, and Nick Richards (right plantar fascia).\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At the Cleveland Cavaliers on Sunday in regular-season finale.\n\n\r\n              Celtics: Host the Wizards in their finale Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995927.546208
}