{
  "game_id": "0021800877",
  "espn_id": "401071550",
  "date": "Feb 22, 2019",
  "matchup": "DET @ ATL",
  "headline": "Pistons survive Blake Griffin's ejection, top Hawks 125-122",
  "body": "ATLANTA --  The Detroit Pistons were upset to see Blake Griffin ejected -- especially when they believed their best player didn't deserve the punishment.\n\nEven so, the Pistons answered their coach's call to add fuel to their playoff push.\n\nThon Maker sank a tiebreaking 3-pointer with 16.7 seconds remaining and the Pistons overcame Griffin's absence to beat the Atlanta Hawks 125-122 on Friday night.\n\nReggie Jackson scored a season-high 32 points, Andre Drummond had 26 points and 21 rebounds, but the Pistons struggled to overcome Griffin's third-quarter exit following his second technical foul of the period.\n\n\"The tape pretty much speaks for itself,\" Griffin said. \"I shouldn't have been back here (in the locker room), but it was an unbelievable job from our guys.\"\n\nGriffin drew his first technical following a brief battle for the ball with Dewayne Dedmon. After hitting a 3-pointer less than a minute later, Griffin yelled at the Hawks bench and drew the technical for taunting with 4:19 remaining in the period. With the second technical, the ejection was automatic -- much to the dismay of Griffin and coach Dwane Casey.\n\nCasey said each technical was \"questionable\" and said \"I've never seen that in my coaching career.\"\n\nHawks forward Vince Carter said he was too far down the court to hear what Griffin yelled.\n\n\"I don't know what he said, but he was barking and directed it at coach,\" Carter said.\n\nHawks coach Lloyd Pierce said he wasn't upset even if Griffin's taunt was directed his way.\n\n\"I don't know what he said, but it was aggressive and it was in front of the official and it was toward our bench, maybe toward me,\" Pierce said. \"Guys do it all the time. I don't take it personally. ... It's just the technicality of it, you can't taunt a bench when you have a tech already.\"\n\nGriffin scored 15 points, ending a streak of four straight games with at least 25.\n\nDrummond made two free throws to tie it at 122 with 43 seconds remaining. Trae Young, who led Atlanta with 30 points and 10 assists, missed on a short floater.\n\nThe 7-foot-1 Maker, playing in only his fourth game with Detroit following his Feb. 6 trade from Milwaukee, sank the go-ahead 3-pointer from the corner.\n\n\"It means a lot, but we shouldn't have to dig ourselves out of a hole like that,\" Maker said.\n\nYoung and Vince Carter each missed 3-pointers on Atlanta's final possession.\n\nDetroit led 88-77 when Griffin left the game. The Hawks immediately began to cut into the lead, pulling ahead 101-100 on Carter's 3-pointer early in the fourth quarter. Bruce Brown's three-point play gave the lead back to the Pistons.\n\nThe Hawks have lost five of six but seemed energized in their return from the All-Star break. Atlanta took a big first-half lead of 14 points at 59-45 with a 12-0 run. Young scored on an explosive drive; set up Dedmon's jam with a behind-the-back, through-the-legs dribble ; and sank a 3-pointer to cap the run.\n\nJackson had 15 second-quarter points -- matching Young -- as Detroit cut the Atlanta lead to 70-68 at halftime. The Pistons took the lead early on the second half on two free throws by Jackson.\n\nDedmon had 14 points and 12 rebounds.\n\nTIP-INS\n\nPistons: G Wayne Ellington had nine points on three 3-pointers in his first start since signing with the Pistons on Feb. 9. Ellington averaged 8.4 points with Miami this season before he was traded to Phoenix and then waived. Luke Kennard moved to the bench.\n\nHawks: G Kent Bazemore had 12 points as the fill-in starter for rookie Kevin Huerter (left ankle sprain). Huerter is not expected to play in Saturday night's game against Phoenix. ... Young leads all Eastern Conference rookies with 19 double-doubles.\n\nDRUMMOND'S DOUBLE-DOUBLES\n\nDrummond recorded his fifth straight game with at least 15 points and 15 rebounds. He leads the NBA with 20 games with 20 or more points and rebounds.\n\nPLAYOFF PUSH\n\nThe Pistons, who have won five of six, are eighth in the Eastern Conference's eight-team playoff standings, one-half game behind Charlotte. Casey said before the game, \"Our playoff push begins tonight.\"\n\nUP NEXT:\n\nPistons: At Miami on Saturday night.\n\nHawks: The Suns will take a 16-game losing streak into Saturday night's game and have won only four of 31 road games.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994674.1472902
}