{
  "game_id": "0022000509",
  "espn_id": "401267669",
  "date": "Feb 26, 2021",
  "matchup": "MEM vs. LAC",
  "headline": "Leonard has 30 points, Clippers beat Grizzlies for split",
  "body": "MEMPHIS, Tenn. -- — The Los Angeles Clippers' poor shooting from a night earlier improved to gain a split in a two-game set with the Memphis Grizzlies.\n\n\r\n                    And they added a strong defensive effort as well.\n\n\r\n                    Kawhi Leonard scored 30 points, Lou Williams added 17 and the Clippers beat the Memphis 119-99 on Friday night to split a two-game series.\n\n\r\n                    Terance Mann, Nicolas Batum and Paul George each had 13 points for the Clippers, 122-94 losers on Thursday night. A night after shooting 41% from the field, Los Angeles connected on 55% overall and 40% from 3-point range.\n\n\r\n                    “We wanted to come out tonight with a hit-first mentality,” Leonard said, adding: “It pretty well worked out for us.”\n\n\r\n                    Jonas Valanciunas led Memphis with 22 points and 11 rebounds. Ja Morant scored 20 points before he was ejected, receiving a pair of technical for arguing a no-call with 2:18 remaining. De’Anthony Melton scored 16 points.\n\n\r\n                    “They made a focus on the paint, limiting our paint touches,” Valanciunas said about Los Angeles' defense. “They did a great job of packing the paint. …They made some right adjustments.”\n\n\r\n                    It was evident from the start that the Clippers were going to be much more aggressive on both ends of the floor than they were a night earlier. While the teams played even in the first quarter, Los Angeles held the Grizzlies to 17 points in the second. Memphis was 7 of 22 from the floor, making only one of its 10 shots from outside the arc in the frame.\n\n\r\n                    “I thought we matched their intensity,” George said. “We looked like the fresher team tonight. I though our pace was great, and I just thought defensively, we shrunk the floor.”\n\n\r\n                    The Clippers concentrated on guarding the paint better than the previous game when Memphis amassed 72 paint points. Los Angeles was willing to see if the Grizzlies could make enough outside shots. Memphis still managed 54 points inside but was only 9 of 28 from 3-point range.\n\n\r\n                    “I thought we had great physicality in that first quarter,” Clippers coach Tyronn Lue said. “They still scored 30 points, but you can live with how they were scoring because we were aggressive. We were into them, and they had to work for everything they got.”\n\n\r\n                    The active Los Angeles defense contributed to more contested shots and turnovers by Memphis. Eventually, the pressure paid off as the Clippers closed the half on a 13-1 run for 63-47 lead at the break. The shooting struggles for Leonard and George from the previous night weren’t evident as they combined to shoot 11 of 16 from the floor for the first two quarters. \n\n\r\n                    The Grizzlies managed only 40% shooting in the half.\n\n\r\n                    “It’s hard to win an NBA game when you shoot 17 more shots than a team and don’t make them,” Memphis coach Taylor Jenkins said. “I thought we got great looks. They didn’t fall. I think our defense was average. …Your defense has got to be consistent night in and night out.”\n\n\r\n                    The second half continued the theme as the Los Angeles defense continued to thwart Memphis shooters, who were stuck in the 40% range. \n\n\r\n                    The Clippers never lost their double-digit lead in the second half, extending it to 20 on several occasions.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Williams passed Bob Kauffman for 17th on the franchise’s career points list. Kauffman had 4,850. … Leonard has 10 games of at least 30 points. … Are 23-3 when hold they 10-point lead this season. \n\n\r\n                    Grizzlies: Justise Winslow took off the second night of the back-to-back part of his recovery from a left hip injury. … Valanciunas, who took a knee to the left thigh in Thursday night’s win, was active after being listed as questionable pregame.\n\n\r\n                    POSTSEASON REMINDER\n\n\r\n                    Before the game Lue said playing the same team on consecutive nights is “sort of like a playoff game. You get a chance to go home and see what you did wrong. …Playing the same team back-to-back reminds you of the playoffs. So we’ve got to come out with a playoff mentality and do things better.”\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Continue their five-game trip Sunday at Milwaukee.\n\n\r\n                    Grizzlies: At Houston on Sunday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996961.895756
}