{
  "game_id": "0021900548",
  "espn_id": "401161190",
  "date": "Jan 07, 2020",
  "matchup": "DET @ CLE",
  "headline": "Rose's late shot leads Pistons past Cavaliers 115-113",
  "body": "CLEVELAND --  The Detroit Pistons, tired and dragging at the end of a long road trip, had every reason to look past the Cleveland Cavaliers.\n\nDerrick Rose and Andre Drummond wouldn't let that happen.\n\nRose hit the go-ahead shot with 27 seconds left, and Drummond finished with 23 points and 20 rebounds as the Pistons rallied to beat the Cavaliers 115-113 Tuesday night.\n\nRose, who scored 24 points, scored on a runner in the lane to give Detroit a 114-113 lead and cap a comeback that began with the Pistons trailing 100-91 early in the fourth quarter.\n\n\"I think it was a floater, a little floater,\" said Rose, who played a season-high 31 minutes. \"All I know is it went in.\"\n\nThe win provided some good news for the Pistons, who were playing the finale of a six-game trip. Star forward Blake Griffin had surgery on his left knee and will face an extended rehabilitation period. The Pistons said they have no timetable for his return.\n\nDetroit trailed by 15 points in the first half and seemed on the verge of getting a knockout punch several times, but the Pistons managed to persevere and finished 2-4 on its trip.\n\n\"We didn't want to end a trip like that,\" Rose said. \"We're just happy to get the win, especially after the way we played in the first half.\"\n\nDrummond's big night marked his 38th career game of 20 points and 20 rebounds.\n\n\"Use any superlative you have for him,\" Detroit coach Dwane Casey said. \"He played great.\"\n\nCleveland set up for a go-ahead shot after Rose's basket, but Collin Sexton was called for stepping out of bounds with seven seconds left. The ruling was overturned, but Sexton's shot in the lane didn't hit the rim and Detroit was awarded possession on a shot-clock violation.\n\nDrummond made one of two free throws with 1.6 seconds to play for a two-point lead. Drummond tipped away Kevin Love's long pass for Tristan Thompson and the clock ran out.\n\nLove matched a season high with 30 points, but had only two shots in the fourth quarter. Love made Cleveland's last basket, a 3-pointer with 2:57 to go, as the rebuilding Cavaliers continue to have problems closing out games.\n\n\"We've had moments where we've been able to do that and moments like tonight where we have to learn and look at tape and look at even just like a two minute drill and finding out what we could have done better,\" Love said.\n\n\"We were trying to get the ball away from Kevin Love,\" Casey said. \"We wanted to make him give it up to other guys.\"\n\nLove has been the center of attention for his recent behavior, which included an outburst on the bench in Toronto last week, and showing up his teammates and coaches during a loss to Oklahoma City on Saturday.\n\nLove spoke about the incidents at Tuesday's shoot-around,calling his actions \"childish.\" He was 12 of 15 from the field and gave the Cavaliers an extra possession when he dove on the floor for a loose ball in the fourth quarter.\n\nCleveland lost its fifth straight and was winless on its four-game homestand.\n\nTHAT'S A LOT OF PACKING\n\nDetroit completed its first trip with games in all four time zones since Dec. 5-16, 1979. The Pistons played both Los Angeles teams, Golden State, Utah and San Antonio.\n\nThe Cavaliers open a similar trip Thursday in Detroit that will also take them to play the Lakers, Clippers, Denver, Memphis and Chicago.\n\nTIP-INS\n\nPistons: Casey said that he hasn't been given any indication if Griffin will play again this season. ... G Reggie Jackson (spine stress reaction) was examined by his doctor in Los Angeles and is making good progress, according to a team spokesman. Jackson played in the first two games of the season before being injured.\n\nCavaliers: A flu bug has been going around the team. Thompson returned after missing Sunday's game, but G Dante Exum was out. ... G Matthew Dellavedova, who had made 7 of 56 3-pointers going into the game, hit from behind the arc in the second quarter.\n\nUP NEXT\n\nThe Pistons and Cavaliers meet for the second time in three days Thursday at Little Caesars Arena. It will be the first regular-season game for longtime University of Michigan coach John Beilein in Detroit.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996281.474955
}