{
  "game_id": "0022200633",
  "espn_id": "401468788",
  "date": "Jan 13, 2023",
  "matchup": "ATL @ IND",
  "headline": "Collins beats buzzer with tip-in, Hawks edge Pacers 113-111",
  "body": "INDIANAPOLIS -- — John Collins tipped in a missed shot with less than a second left to give the Atlanta Hawks a 113-111 victory over the Indiana Pacers on Friday night.\n\n\r\n              Trae Young scored 26 points and De’Andre Hunter had 25 for the Hawks. Young was 6 of 10 from 3-point range and Hunter 6 of 9. Hunter’s six 3-pointers were a career-high. The Hawks made 16 of 31 3-pointers overall. Onyeka Okongwu added 18 points and a career-high 20 rebounds.\n\n\r\n              Bennedict Mathurin scored 26 points and Buddy Hield had 18 points for Indiana. The short-handed Pacers who were without three starters.\n\n\r\n              After Dejounte Murray, who scored 18 points, stole the ball and scored to give the Hawks a 108-107 lead. Mathurin scored to put Pacers ahead 109-108 with 58 seconds left. He was fouled on the basket but missed the free throw.\n\n\r\n              Young made a 3-pointer to give the Hawks a 111-109 lead with 32 seconds remaining. Hield hit two free throws to tie it at 111 with 21.5 seconds to go.\n\n\r\n              “When we are hitting shots, we tend to play defense,” Hawks coach Nate McMillan said. “It was good to see some of those shots go down. Our last game (against Milwaukee) it was like something was over the rim and nothing would fall for anybody. Tonight those shots started to fall. De’Andre got hot and started to knock down shots and so do Trae. I thought our defense was really good to hold them to 22 points (in the fourth quarter).”\n\n\r\n              McMillan said he didn’t call a timeout in the final seconds because he liked the matchup on the floor. The Hawks got the final basket, thanks to two offensive rebounds. \n\n\r\n              “Trae was supposed to make a read, he missed the shot, Dejounte got another opportunity and John got the tip-in,\" McMillan said. \"We talk about making plays in the fourth quarter and we did that tonight.”\n\n\r\n              Okongwu said perseverance paid off for he and the team.\n\n\r\n              “We needed this game bad after our last game to Milwaukee,” Okongwu said. “The last game I wasn’t being aggressive. I got called out by people, family, friends, coaches. So this game I wanted to make an effort to be aggressive on both ends of the floor.”\n\n\r\n              The Pacers outrebounded the Hawks 51-50, but those last offensive rebounds were a killer.\n\n\r\n              “Rebounding has been a nemesis of ours and it got on the last play,” Pacers coach Rick Carlisle said.\n\n\r\n              Indiana was without point guard Tyrese Haliburton. He suffered a bone bruise on his left knee and elbow strain during the third quarter Wednesday in a loss to the New York Knicks. He is expected to be out at least two weeks. The Pacers were without starters Myles Turner (back spasms) and Aaron Nesmith (illness) for the second consecutive game.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Clint Capela missed his ninth consecutive game with right calf strain.\n\n\r\n              Pacers: Indiana coach Rick Carlisle said Myles Turner’s back injury isn’t likely to be a long-term issue, but he doesn’t expect Turner will play against Memphis on Saturday. Starting in Turner’s spot, Isaiah Jackson had a career-high seven blocked shots to go with 10 points and 10 rebounds. … Oshae Brissett, who missed Wednesday’s game with a hamstring injury, was able to play against the Hawks. He scored 17 points and had 10 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Toronto on Saturday night\n\n\r\n              Pacers: Host Memphis on Saturday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994829.840852
}