{
  "game_id": "0022200579",
  "espn_id": "401468734",
  "date": "Jan 05, 2023",
  "matchup": "DEN vs. LAC",
  "headline": "Murray's early exploits lead Nuggets to rout of Clippers",
  "body": "DENVER -- — Jamal Murray sparked Denver early by scoring 13 of his 18 points in the first quarter, and the Nuggets led by as many as 43 in cruising to a 122-91 win over the Los Angeles Clippers on Thursday night.\n\n\r\n              The Nuggets picked the perfect time to turn in one of their best performances of the season. In a nationally televised game, Denver was pushing the pace and showing why the team is tied with Memphis for the top spot in the Western Conference. The Nuggets shot 50.6% from the floor and finished with 28 assists.\n\n\r\n              “Wins like this give us a lot of confidence and build a lot of chemistry,\" Murray said. \"Sets a standard for us.” \n\n\r\n              It wasn't even Nikola Jokic doing most of the damage, either. The two-time reigning NBA MVP had 12 points, six rebounds and nine assists before taking the fourth quarter off.\n\n\r\n              Murray was one of seven Denver players to finish in double figures. He hit four of the team's 14 3-pointers. \n\n\r\n              Kentavious Caldwell-Pope helped fuel a 19-0 run in the second quarter to turn the game into a rout. \n\n\r\n              “I’ve been around people who would not allow themselves to enjoy the wins, to enjoy the moment. I’m not that guy,” Nuggets coach Michael Malone said. “But I’m also not going to party and celebrate.\n\n\r\n              \"That was a hell of a win for us. A convincing win, from beginning to end. Everybody contributed. We’re in first place in the Western Conference. We’re not there yet. But we’re on our way. I like where we’re at and, more importantly, I like who I’m going there with.”\n\n\r\n              Kawhi Leonard, Paul George and the rest of the Clippers had an off night shooting as they dropped their fourth straight game. They shot 37.4% from the floor, including 5 of 37 from 3-point range. \n\n\r\n              Leonard finished with six points while George, playing with a sore hamstring, had three. Neither played in the second half and they were a combined 3 of 16 from the field.\n\n\r\n              None of the Clippers' starters scored in double figures. Norman Powell led Los Angeles with 13 points.\n\n\r\n              “We didn’t have a defensive mindset to start the game and it kind of hurt us,” coach Tyronn Lue said. “We’ve got to be better defensively. We knew that coming into the game, or they embarrass you. Tonight was a tough game for us.” \n\n\r\n              Murray set the tone early with his 13-point opening quarter on 5-of-6 shooting. The dynamic point guard is off to an up-and-down start as he works his way back from a torn ACL that caused him to miss last season.\n\n\r\n              On the plane ride home from a loss in Minnesota this week, Malone sat next to Murray for a heart-to-heart chat. \n\n\r\n              “It was me just trying to reach out to a player and show him support,” Malone said. “That’s just the relationship that Jamal and I have. Constant communication, collaboration.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: F Nicolas Batum sat out with a sprained left ankle. ... G John Wall was inactive (left knee injury management). \n\n\r\n              Nuggets: Vlatko Cancar had 15 points and 12 rebounds off the bench. ... Bones Hyland scored 16.\n\n\r\n              DEFENSIVE STALWART\n\n\r\n              Michael Porter Jr. was picked as Denver's defensive player of the game. Malone cracked that Caldwell-Pope fell out of his chair. Porter is trying to make strides on the defensive end.\n\n\r\n              BACK-TO-BACK\n\n\r\n              Murray feels confident he can play Friday night against Cleveland on a back-to-back.\n\n\r\n              “I haven’t done that, so just another part of my recovery, part of the rehab that’s going well,\" he said.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Minnesota on Friday night.\n\n\r\n              Nuggets: Host Cleveland on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994708.549432
}