{
  "game_id": "0022200518",
  "espn_id": "401468673",
  "date": "Dec 28, 2022",
  "matchup": "MIA vs. LAL",
  "headline": "Heat get past Lakers 112-98, climb over .500 at 18-17",
  "body": "MIAMI -- — The math wasn't hard. The Miami Heat got a lot of points off turnovers, and nearly went the whole game without giving up any.\n\n\r\n              It was the difference.\n\n\r\n              Jimmy Butler scored 27 points, Bam Adebayo added 23 points and 14 rebounds and the Heat moved over .500 by topping the Los Angeles Lakers 112-98 on Wednesday night.\n\n\r\n              Miami led the Lakers 31-2 in points off turnovers, after forcing 26 while committing only six despite being without point guard Kyle Lowry — who was out for personal reasons.\n\n\r\n              “Certainly, the ball control was a big positive tonight,\" Heat coach Erik Spoelstra said.\n\n\r\n              LeBron James, who led the Lakers with 27 points, couldn't have agreed more — albeit from a different perspective. The turnovers led to a 92-77 discrepancy in field-goal attempts, that number obviously in Miami's favor.\n\n\r\n              “That's pretty much the game right there,\" James said.\n\n\r\n              The Lakers fell to 14-21. It’s the second-worst record for any of James’ teams through 35 games; Cleveland started 11-24 in his rookie season of 2003-04.\n\n\r\n              “I don’t want to finish my career playing at this level, from a team aspect,” James said. “I want to still be able to compete for championships because I know what I can still bring to any ballclub with the right pieces.”\n\n\r\n              Tyler Herro had 18 points and nine assists for the Heat (18-17). Caleb Martin scored 13 points and Gabe Vincent added 12 for Miami, which has won six of its last eight.\n\n\r\n              James, playing on the second night of a back to back, also had nine rebounds and six assists for the Lakers. Russell Westbrook and Dennis Schroder each had 15 for the Lakers.\n\n\r\n              The Heat led by 22 points at one point, their third-largest margin of the season and the biggest since Oct. 26.\n\n\r\n              And the 14-point final margin also represented Miami’s third-largest win of the season, though it didn’t come easily at the end.\n\n\r\n              The Lakers cut the lead to seven late in the fourth, before Herro connected on a left-wing 3-pointer with 2:01 to restore a double-digit lead. Miami got a stop on the Lakers’ next possession, and on the ensuing Heat trip Butler went down the lane for an easy layup with 1:15 remaining and that sealed the win.\n\n\r\n              “We kept the lead,” Adebayo said. “That was the biggest thing.”\n\n\r\n              It was James' final game as a 37-year-old; he turns 38 on Friday. James averaged 30.1 points in games played at 37, by far the most in NBA history. Karl Malone averaged 23.2 at 37; that’s second-best now.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: James played in his 1,393rd game, breaking a tie with Tim Duncan for 10th-most in NBA history. Next up is Jason Terry (1,410). ... Westbrook passed Charles Barkley for 28th place on the NBA’s scoring list. Barkley retired with 23,757 points; Westbrook has 23,767. ... Troy Brown Jr. scored 15 points on 5-of-6 shooting, 4 of 5 on 3-pointers.\n\n\r\n              Heat: It was Miami’s 54th and final home game of 2022. The Heat went 35-19 in those and won’t be home again until Jan. 8 against Brooklyn. ... Butler also had five steals and four assists, while shooting 11 for 18.\n\n\r\n              BACK IN MIAMI\n\n\r\n              It was the 14th time that James had scored at least 27 points in Miami — his former home — as an opponent. He's had at least that many in seven of eight appearances on the Heat home floor since he left the franchise and returned to Cleveland in 2014.\n\n\r\n              UD RETIREMENT\n\n\r\n              Udonis Haslem’s No. 50 jersey was retired by Miami High, his alma mater, on Tuesday night in a ceremony that several Heat players, coaches and staff attended. James offered his former teammate congratulations pregame Wednesday about the honor; both will have their jerseys — No. 40 for Haslem, No. 6 for James — retired eventually by the Heat as well.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Atlanta on Friday night.\n\n\r\n              Heat: At Denver on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993971.9356532
}