{
  "game_id": "0021800803",
  "espn_id": "401071476",
  "date": "Feb 05, 2019",
  "matchup": "POR vs. MIA",
  "headline": "Whiteside has 28 and the Heat hold off the Blazers 118-108",
  "body": "PORTLAND, Ore. --  Hassan Whiteside found his voice and the Miami Heat got a win.\n\nWhiteside had 28 points and 11 rebounds, and took on a vocal role as the Heat snapped a three-game losing streak with a 118-108 victory over the Portland Trail Blazers on Tuesday night.\n\n\"We heard his voice tonight talking to us on both ends of the floor, talking to us in the huddle. He was engaged,\" teammate Dwyane Wade said. \"His presence was known and when he plays that way, when he is that active, we are a good team.\"\n\nWade added 22 points and nine rebounds for Miami in the first of a five-game road trip.\n\nCJ McCollum had 33 points including seven 3-pointers for the Trail Blazers, who had won three straight but were coming off a five-day layoff. The loss snapped an eight-game winning streak for Portland at home.\n\nMiami led by 15 points heading into the final quarter but Portland rallied with a 9-2 run capped by Seth Curry's 3-pointer that pulled the Blazers to 96-88. Evan Turner's layup and free throw got the Blazers closer.\n\nMcCollum's 3-pointer closed the gap to 101-100 with 6:54 left. James Johnson answered with a 3 for Miami to momentarily slow Portland's momentum until Meyers Leonard's 3.\n\nWhiteside's basket and a pair of free throws from Johnson kept Miami in front 108-103, and the Heat were able to hold off the Blazers the rest of the way.\n\n\"McCollum started to get rolling and there wasn't too much more I told the guys we could do,\" Heat coach Erik Spoelstra said about Portland's late rally.  \"We were trapping him, bringing a third guy over and he was still getting in the seasons or getting open behind the arc. In those moments, you don't want to beat yourself. We were competitive and found a way to get a couple of stops and Whiteside had some big rebounds.\"\n\nMiami was coming off an 0-3 homestand, capped by a 95-88 loss Saturday to Indiana, The Heat had 24 turnovers in the loss.\n\nSpoelstra inserted Kelly Olynyk into the starting lineup, replacing Johnson. It was Olynyk's sixth start of the season.\n\nPortland was coming off a 132-105 victory at home over the Jazz last Wednesday. Jusuf Nurkic did not play because of right knee soreness, but he started against the Heat.\n\nRodney Hood, acquired by the Trail Blazers in a trade with Cleveland on Sunday, did not play. He arrived in Portland on Monday and had not had a workout with the team.\n\nThe Heat led by as many as nine points in the opening quarter. Tyler Johnson's layup gave Miami a 56-44 lead with 3:51 left in the first half. Whiteside's free throws stretched the advantage.\n\nThe Heat were up 55-62 going into the break, paced by Josh Richardson with 16 points. Jake Layman came off the bench and led the Blazers with 16.\n\nWhiteside's short jumper gave the Heat a 75-63 lead midway through the third period, making him 7 for 7 from the floor to that point.\n\nPortland began to close the gap a bit with McCollum's 3-pointer pulling the Blazers to 77-70 but Miami led 94-79 heading into the final quarter.\n\n\"For whatever reason, we didn't seem to have a lot of pop for most of the game,\" Portland coach Terry Stotts said. \"I don't know if it was the five days off or what, but it seemed pretty obvious most of the first three quarters, we just didn't make the energy plays, whether it was in transition or defensively.\"\n\nADDING HOOD\n\nHood met the media for the first time as a Trail Blazer before the game. He said it was no secret he wanted out of Cleveland, but it was kind of a surprise when he got the call as he was headed to a Super Bowl party.\n\nHe thought he'd be a deadline deal, and he never expected Portland. The Blazers sent Nik Stauskas, Wade Baldwin and two future second-round picks to the Cavaliers in exchange.\n\n\"It's a really good fit for me, personality-wise, game-wise, everything,\" hood said about the move. \"I'm looking forward to a fresh start here.\"\n\nStotts said he expects Hood to be available on Thursday when the Blazers host San Antonio.\n\nTIP INS\n\nHeat: Goran Dragic and Derrick Jones Jr., did not travel with the team. Dragic is recovering from right knee surgery and Jones has missed four games with a bone bruise in his right knee. ... Wade was treated to a standing ovation from many in the Moda Center crowd when he came into the game in the opening period.\n\nTrail Blazers: It became official on Tuesday, both Curry and Damian Lillard will take part in the 3-point contest at the All-Star game. \"I think it's a great opportunity for Seth to compete against his brother in Charlotte, that's awesome, and for Dame to get another shot at it, it's terrific,\" Blazers coach Terry Stotts said. ... Lillard finished with 13 points and 10 assists. ... Layman finished with 25 points.\n\nUP NEXT\n\nHeat: At Sacramento on Friday night.\n\nTrail Blazers: Host San Antonio on Thursday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995169.380089
}