{
  "game_id": "0022200211",
  "espn_id": "401468366",
  "date": "Nov 16, 2022",
  "matchup": "CHA vs. IND",
  "headline": "Haliburton, Pacers beat Hornets; Ball re-injures ankle",
  "body": "CHARLOTTE, N.C. -- — Tyrese Haliburton had 22 points and 11 assists, Myles Turner added 20 points and 10 rebounds and the Indiana Pacers beat Charlotte 125-113 on Wednesday on night in which Hornets All-Star guard LaMelo Ball re-injured his left ankle after stepping on a fan's foot.\n\n\r\n              Bennedict Mathurin had 20 points off the bench, including Indiana’s first 10 points of the fourth quarter, and the Pacers won for the sixth time in eight games. Buddy Hield added 19 points.\n\n\r\n              Ball finished with 26 points for the Hornets, but left with 1:34 left when he re-injured his left ankle — the same one that kept him out of the first 13 games of the season.\n\n\r\n              Ball was hurt attempting to save a ball from going out of bounds near where coach Steve Clifford was standing, but stepped on a fan's foot who was seated courtside and rolled his ankle as he attempted to brace himself from going into the crowd. He immediately limped toward the bench and then headed straight to the locker room.\n\n\r\n              There was no immediate word on the extent of the injury.\n\n\r\n              “He rolled it on a fan's foot is what I was told,” Clifford said. “Hopefully, it's not bad but I'm sure we won't know anything until tomorrow.\"\n\n\r\n              Ball was not made available for comment after the game.\n\n\r\n              It was Ball's third game back, but his first at home and he received a huge ovation during pre-game warmups.\n\n\r\n              While the Hornets have been plagued with injuries — Cody Martin, Gordon Hayward and Dennis Smith Jr. are also out — the Pacers (7-6) just seem to keep rolling along.\n\n\r\n              Although they were picked to finish near the bottom of the league, they've become one of the league's best offensive teams playing with solid chemistry that includes good ball movement, particularly on pick and rolls.\n\n\r\n              “We are not throwing any parties — we are above .500 for the first time in a long time, which is great,” coach Rick Carlisle said. “But this is work. If we are going to keep winning we are going to have to keep an edge. We are going to have keep giving each other energy and doing the simple things well.”\n\n\r\n              Haliburton said Indiana is a tightknit team with a bunch of guys who are playing with chips on their shoulders for various reasons.\n\n\r\n              “Everybody has something to prove,” Haliburton said. “Buddy and I got traded last year. Ben(nedict) feels like he should have been drafted higher. Jalen Smith got traded. Myles Turner, there's always trade rumors with him. So we have a lot of guys who have a lot of prove and a lot of guys that are hungry.”\n\n\r\n              P.J. Washington scored 24 points, and Kelly Oubre had 17 points and 13 rebounds for the Hornets. They've lost nine of their last 10 games.\n\n\r\n              The Pacers outscored the Hornets 21-9 in the final five minutes to break open a tie game. Haliburton, who is in the midst of a huge season, was big down the stretch, capping an 11-2 run with a step back 3-pointer over Ball's outstretched hand.\n\n\r\n              Mathurin was huge too, scoring Indiana's first 10 points of the fourth quarter to give the Pacers a 100-95 lead turning the momentum of the game.\n\n\r\n              Charlotte looked good early but couldn't sustain the lead.\n\n\r\n              The Hornets, who came into the night second-to-last in the NBA in 3-point field goal percentage at 31.2%, missed 11 of their first 12 shots from beyond the arc before Washington began to heat up. The forward had 11 points in the second quarter, helping Charlotte build a 13-point lead.\n\n\r\n              TIP INS\n\n\r\n              Pacers: Were outrebounded 43-34.\n\n\r\n              Hornets: Oubre had a career-high seven offensive rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Houston on Friday night.\n\n\r\n              Hornets: At Cleveland on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994284.734068
}