{
  "game_id": "0021800544",
  "espn_id": "401071220",
  "date": "Dec 31, 2018",
  "matchup": "MEM @ HOU",
  "headline": "Harden's 43 points, triple-double lead Rockets over Memphis",
  "body": "HOUSTON --  While Houston Rockets coach Mike D'Antoni and James Harden's teammates raved about his latest big game on Monday night, the Beard was busy critiquing himself and pointing out ways he could have played better.\n\n\"I did a poor job of just not controlling the basketball, basically giving them transition points by turnovers,\" he said. \"I have to take care of the ball more, but just continue to be aggressive and make plays for my team.\"\n\nHarden had 43 points, 10 rebounds and 13 assists in his fourth straight 40-point game, leading the Rockets over the Memphis Grizzlies 113-101 for their fifth consecutive victory.\n\nWhile Harden was unhappy with his nine turnovers, D'Antoni was effusive in his praise for the superstar, who has carried the team with fellow All-Star Chris Paul out with a hamstring injury.\n\n\"I don't know how you get any better than what he's playing,\" D'Antoni said. \"Defensively, too. He comes up with steals, triple-doubles like it's nothing. So yeah, he's playing at a different level.\"\n\nHarden set an NBA record with his eighth straight game with at least 35 points and five assists, besting Oscar Robertson, who twice had seven-game streaks. Harden finished with his fourth triple-double this season and 39th overall.\n\nHouston has won 10 of its last 11 to improve to 21-15.\n\nHarden continued his incredible run that has powered Houston's surge up the Western Conference standings after a slow start, making six 3-pointers and 21 of 27 free throws. He has made at least four 3-pointers in eight straight games has finished with 30 points or more in 10 games in a row.\n\nThe Rockets, who spent the early part of the season in the basement of the conference standings, are tied with the Clippers for fourth place in the West.\n\n\"It's a good feeling, it could be better though,\" Harden said. \"We're trying to get that No. 1 spot so we've got to continue to build.\"\n\nThe Grizzlies cut the lead to nine with about 90 seconds left. But P.J. Tucker made a free throw for Houston before Austin Rivers added a layup to make it 113-101 and seal the victory with about 35 seconds left.\n\nHarden grabbed his 10th rebound seconds after that to complete his triple-double.\n\nKyle Anderson had 20 points and Mike Conley added 19 for the Grizzlies, who lost for the seventh time in nine games.\n\nHouston was up by 13 to start the fourth and back-to-back baskets by Clint Capela made it 93-77 with about 9 minutes left. Harden made four straight free throws for the Rockets later in the fourth to leave them up 98-83.\n\nBut the Grizzlies scored four quick points, with the last basket coming when Anderson stole the ball from Harden, to cut it to 98-87 with 5 1/2 to go.\n\nGreen answered with a 3-pointer and Houston stretched the lead to 103-87 with about 4 minutes left.\n\nThe Rockets led by double digits for most of the night and were up by 23 after two free throws by Harden midway through the third quarter. Memphis closed out the third with a 14-3 run to get within 86-73 entering the fourth. Marc Gasol led the way in that stretch, scoring five points.\n\nThe Rockets led 61-38 at halftime behind 28 points from Harden. He capped his huge first half by making two 3s in the last 31 seconds of the half, capped by one that was well behind the line with Anderson in his face.\n\n\"James has been playing at a high level,\" Memphis coach J.B. Bickerstaff said. \"Some of the shots that he made in the first half, they are indefensible. I thought our guys showed a lot of character by the way they responded in the second half. They put a lot more pressure on him and forced him into some turnovers.\"\n\nTIP-INS\n\nGrizzlies: Gasol has at least one 3-pointer in 13 straight games, which ties a career high.\n\nRockets: James Ennis missed his 10th straight game with a strained right hamstring. Coach Mike D'Antoni said he should return for Houston's next game. ...Paul missed his fifth game with a strained left hamstring. He said Monday that he's doing better but doesn't know when he'll return. ... Green made four 3-pointers in the first quarter and finished with 18 points and six 3s.  ... Eric Gordon sat out with a bruised right knee.\n\nTHEY SAID IT\n\nTucker on how Houston's recent run: \"It's not great yet. We're winning some games. But they haven't been perfect. They haven't been all pretty. But we'll take `em. Wins are wins but it still isn't the level that we want to be at.\"\n\nUP NEXT\n\nGrizzlies: Host Detroit on Wednesday night.\n\nRockets: Visit Golden State on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994130.897574
}