{
  "game_id": "0022400253",
  "espn_id": "401704819",
  "date": "Nov 20, 2024",
  "matchup": "CHI @ MIL",
  "headline": "Antetokounmpo scores 41 points as Bucks beat Bulls 122-106 for 4th win in 5 games",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 41 points, nine rebounds and eight assists as the Milwaukee Bucks beat the Chicago Bulls 122-106 on Wednesday night.\n\n\r\n              Brook Lopez scored 21 points, Damian Lillard had 20 points and 10 assists, and AJ Green added 18 points to help the Bucks win for the fourth time in five games following a 2-8 start.\n\n\r\n              Zach Lavine scored 27 points to lead Chicago. Torrey Craig added 15, while Nikola Vucevic and Coby White had 14 each. \n\n\r\n              The Bucks led by 18 and seemed to be in control after a 16-0 run from the end of the first quarter and into the second, but the Bulls chipped away and pulled within one point in the third. The score remained close until midway through the fourth when the Bucks once again pulled away with Antetokounmpo dominating inside. \n\n\r\n              The Bucks held a 54-34 advantage in the paint. \n\n\r\n              Takeaways\r\n              Bulls: Lavine had 20 points in the first half, the only Chicago player in double figures to that point. However, he was held to seven points in the second half.\n\n\r\n              Bucks: After being held to 13 points in the first half, Antetokounmpo scored 25 of Milwaukee’s 29 points in the third quarter. Lopez scored 20 or more points for the third time in four games.\n\n\r\n              Key moment\r\n              Green swished a catch-and-shoot 3-pointer, his fifth of the game, from the corner with 6:49 left in the game to push the Bucks' lead to seven. Lillard and Lopez followed with 3s of their own to extend the Bucks' lead to 13.\n\n\r\n              Key stat\r\n              The Bucks' bench players outscored the Bulls' reserves 23-7 in the first half. Green set the pace from the start with 11 points in the first quarter.\n\n\r\n              Up Next\r\n              Bulls host Atlanta on Friday, and Bucks host Indiana.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997102.4065201
}