{
  "game_id": "0021901309",
  "espn_id": "401224784",
  "date": "Aug 13, 2020",
  "matchup": "POR @ BKN",
  "headline": "Lillard, Blazers escape Nets, advance to play-in series",
  "body": "LAKE BUENA VISTA, Fla. --  With the season threatening to slip away, Damian Lillard decided it was time to shoot, even though he was so far his foot was touching the logo near midcourt.\n\nA few minutes later, he flung his body to the floor near the same spot, coming up with a steal that was the biggest defensive play of the game.\n\nLillard did it all to give Portland a spot in the NBA's first play-in series, scoring 42 points to help the Trail Blazers escape with a 134-133 victory over the Brooklyn Nets on Thursday night.\n\n\"The urgency, the energy, the pace, everything, just felt like something was on the line,\" LIllard said.\n\nThe Trail Blazers secured the No. 8 seed in the Western Conference only after Brooklyn's Caris LeVert, who scored 37 points, missed a jumper just before time expired. Portland will play ninth-seeded Memphis on Saturday. If the Grizzlies win, the deciding game would be Sunday.\n\nThe winner of the play-in series gets the final spot in the West and a first-round series against the Los Angeles Lakers.\n\nPortland came into the day in eighth place, but would have fallen out of playoff position with a loss, thanks to victories earlier Thursday by Memphis and Phoenix. Had the Blazers lost, the Suns would have inched ahead of them into ninth.\n\nBut Lillard wouldn't let the Blazers fall, following his games of 51 and 61 points in the previous two games not only with more sensational scoring but also with a huge defensive play.\n\nHe chased down LeVert for a steal with Portland clinging to a two-point lead with 1:12 to play, setting up CJ McCollum's free throws that made it 134-130. LeVert came back with a three-point play and had a chance to win it after Carmelo Anthony missed a 3-pointer, but his jumper was off.\n\nUnlike the Grizzlies and Suns, who romped in their afternoon games, the Blazers needed to go all the way to the wire to beat the Nets. Portland scored 73 points in the first half, but led by only six after Brooklyn shot 59%.\n\nLeVert then scored 10 points in the first five minutes of the third quarter, part of what became a 17-3 run as Brooklyn turned an eight-point deficit into a 91-85 lead. A 3-pointer by Luwawu-Cabarrot extended the lead to 102-92 with 1:46 left in the period and the Nets took a 104-97 advantage to the fourth.\n\nLillard then hit a couple of 3s -- one with a foot touching the logo near midcourt  -- during a 12-4 surge that wiped out a seven-point deficit and put Portland back on top 112-111.\n\n\"Honestly the roll that he's been on, we were missing some shots and that's Dame,\" Blazers coach Terry Stotts said about Lillard's decision to launch from 36 feet with the Nets trying to force the ball out of his hands as soon as he crossed midcourt.\n\nBrooklyn would later go back on top by five before the Portland pulled it out.\n\nMcCollum had 25 points and Jusuf Nurkic had 22 points and 10 rebounds for the Blazers, who went 6-2 in the seeding games.\n\nJoe Harris and Timothe Luwawu-Cabarrot each scored 19 points for the Nets, who finished 5-3. They were already locked into a first-round series with defending champion Toronto but played their starters as if they needed the win.\n\n\"Like I said, we played a great eight games but now it's time to really lock in,\" LeVert said.\n\nTIP-INS\n\nTrail Blazers: Stotts confirmed that McCollum is battling an injury but wouldn't offer many details. \"He has the issue with his back, he's playing through it and that's about all I can say,\" Stotts said.\n\nNets: Brooklyn played its last night game for a while. The first three games of the series against Toronto are all afternoon starts. Game 4, set for Aug. 23, is a 6:30 p.m. EDT start. ... Chris Chiozza (right adductor tightness) and Donta Hall (right ankle sprain) sat out.\n\nHOPES FOR HARRIS\n\nGeneral manager Sean Marks, in an interview with Yes Network, said re-signing Harris will be at the top of the team's list this summer.\n\n\"Priority No. 1. It's that simple, yeah,\" Marks said. \"Joe, I think we've talked about plenty of times. We're obviously very proud of where Joe has come from and where he is today. And he still continues to get better. Still wants to work on his craft. So yeah, signing him and seeing him with this group will certainly be a priority for us.\"\n\nUP NEXT\n\nTrail Blazers: Play Memphis on Saturday.\n\nNets: Play Game 1 against Toronto on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996597.836925
}