{
  "game_id": "401809979",
  "espn_id": "401809979",
  "date": "Oct 28, 2025",
  "matchup": "MIA vs CHA",
  "headline": "Jaime Jaquez Jr. scores 28 points to spark high-scoring Heat in 144-117 win over Hornets",
  "body": "MIAMI -- — Jaime Jaquez Jr. scored 20 of his 28 points in the first half to keep up his hot-shooting start to the season, and the high-scoring Miami Heat beat the Charlotte Hornets 144-117 on Tuesday night.\n\n\r\n              Bam Adebayo had 26 points and Andrew Wiggins added 21 for the Heat, who won their third straight game after losing the season opener to Orlando. They played without leading scorer Norman Powell, who had 29 points in the win over New York on Sunday and was scratched because of a groin injury he felt during the morning shootaround.\n\n\r\n              Jaquez led the Heat to a 58-33 advantage in bench points, going 9 for 14 from the floor while posting a plus-43 rating. The third-year guard, drafted with the 18th pick by the Heat in 2023, is shooting 69% through four games (31 for 45). The Heat, who were just 24th in the NBA last season in scoring, are averaging 132 points.\n\n\r\n              Pelle Larsson started in place of Powell and pitched in 17 points and five rebounds for the Heat, who closed the first half on an 11-0 run over the final 3:13 to take a 76-60 lead. After the Hornets pulled within three, the Heat used a 23-7 surge that stretched into the fourth quarter to retake control.\n\n\r\n              LaMelo Ball, who had a triple-double for the Hornets in the previous game in a win over Washington, had 20 points, nine assists and eight rebounds, and rookie Kon Knueppel added 19 points. The Hornets played for the second straight game without starting forward Brandon Miller, who suffered a shoulder injury on Saturday at Philadelphia. Miller missed 55 games last season after wrist surgery.\n\n\r\n              Up next\r\n              Hornets: Host Orlando on Thursday.\n\n\r\n              Heat: Visit San Antonio on Thursday to start a four-game road trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042518.617593
}