{
  "game_id": "0021600821",
  "espn_id": "400900226",
  "date": "Feb 13, 2017",
  "matchup": "CHA vs. PHI",
  "headline": "Batum's guarantee falls short, 76ers beat Hornets 105-99",
  "body": "CHARLOTTE, N.C. -- Philadelphia 76ers guard Gerald Henderson sent a text message to his teammates before Monday night's game reminding them that Nic Batum had guaranteed a Charlotte Hornets victory.\nThe fired-up 76ers responded by beating the Hornets 105-99 behind 18 points and 11 rebounds from reserve Dario Saric for their third straight win.\n\"Everybody pays attention that stuff,\" said Henderson, who previously played in Charlotte. \"It's not the first guarantee that has ever been issued, but I thought it was something some guys on our team would look at and use it in the game.\"\nHenderson clearly viewed the guarantee as a slight against the young 76ers, who continue to surprise some around the league with their improved play.\n\"(It's) how other people view our team,\" Henderson said. \"I like to just worry about us and what we're doing, but when stuff like that happens, it's worth a look. We think about ourselves very different than most people.\"\nT.J. McConnell, who had 14 points and seven assists, called Batum's guarantee \"a little absurd.\"\n\"If you do, you should just back it up,\" McConnell said. \"I'm not taking a shot at anyone, but it's disrespectful toward our team and we responded well.\"\nBatum had 16 points on 5-of-12 shooting for the slumping Hornets, who have lost 10 of their last 11 games.\nBatum told the Charlotte Observer after Saturday night's loss to the Los Angeles Clippers that he was guaranteeing a win against Philadelphia. He felt like things got overblown from there, saying he has done that \"two or three times\" over the past couple seasons.\n\"And it worked three times -- just not this time,\" Batum said. \"I don't know why people are getting freaked out. ... I don't know why people are getting mad about it. The question was like `Are you going to win the next game?' I wasn't going to say we were going to lose the next game. ... I won't stop believing in my teammates.\"\nThe 76ers led by eight entering the fourth quarter, but extended it to 98-84 on a driving layup by McConnell.\nCharlotte would get it back to five with less than a minute to go when Kemba Walker buried a jumper. Batum had a chance to cut the lead to two when he stole the ball from Henderson in the backcourt, but his 3-point attempt from the corner hit the rim and bounced over the backboard and out of play.\nBatum bent over, slumping his head in his hand knowing he had missed a golden opportunity.\nWalker finished with 29 points.\nTIP-INS\n76ers: Joel Embiid (left knee contusion) and Jahil Okafor did not travel with the team.\nHornets: Frank Kaminsky started at center for Cody Zeller, who sat out with a quad contusion. ... General manager Rich Cho traded for Cleveland's Chris Andersen earlier in the day, then promptly released him. The Hornets gave up a protected second-round pick that will likely never be used for cash considerations from the Cavaliers. ... Miles Plumlee left the game in the second half with a strained right calf.\nSTRUGGLING WITH BIGS\nThe Hornets continue to struggle with Zeller out. The team recently traded away big men Roy Hibbert and Spencer Hawes for Miles Plumlee, but Plumlee has been slow rounding into shape.\n\"We miss Cody and Plumlee is new so we have no bigs,\" Batum said. \"So we have no screen game, no running game and no big inside so we miss that too.\"\nON THE GLASS\nThe 76ers controlled the boards, outrebounding the Hornets 51-33.\n\"They worked us over,\" Hornets coach Steve Clifford said. \"I didn't realize it was that bad. Tonight it was in the high pick-and-roll game. McConnell was really good tonight. He hit the biggest shot in the game. Some of it was rebounding, but a lot of it was our inability to keep it out of the paint.\"\nUP NEXT\n76ers: Travel to play the Celtics on Wednesday night.\nHornets: Travel to play the Raptors on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995489.446389
}