{
  "game_id": "0022200268",
  "espn_id": "401468423",
  "date": "Nov 23, 2022",
  "matchup": "DEN @ OKC",
  "headline": "Jokic has 39 points, Nuggets outlast Thunder 131-126 in OT",
  "body": "OKAHOMA CITY -- — Nikola Jokic scored 39 points, Aaron Gordon added 30 and Bruce Brown had a triple-double to help the depleted Denver Nuggets outlast the Oklahoma City Thunder 131-126 in overtime Wednesday night.\n\n\r\n              Brown had 17 points, 13 rebounds and 10 assists.\n\n\r\n              “He’s a winner. Those are the guys you want on your team. Some guys are in the foxhole with you, some guys have one foot out, one foot in. Bruce is all the way in,” Nuggets coach Mike Malone said. “He’s a guy that leaves his heart out there every night. And 17, 13 and 10 with four steals. That’s a pretty impressive stat line in 45 minutes of play.”\n\n\r\n              Playing without starters Jamal Murray and Michael Porter Jr., Jokic took it upon himself to dominate the opening period, hitting all five of his shots and scoring 14 points as the Nuggets took a 17-point lead into the second.\n\n\r\n              But Isiah Joe came off the Thunder bench to hit four-three pointers and Shai Gilgeous-Alexander scored 15 points in the second quarter as Oklahoma City put up 42 points and pulled within six at the half. Alexander finished with 31 points and 11 assists. Joe hit 7 of 10 3s for the game to finish with 21 points.\n\n\r\n              Lu Dort hit back-to-back 3s and rookie Jalen Williams also hit from distance to give Oklahoma City its first lead, 75-72 three minutes into the second half. The Thunder outscored the Nuggets 35-14 in the period to lead by 13.\n\n\r\n              But Jokic hit Gordon with a no look pass for a layup in the final minute to tie it game and neither team could score on their final possession, taking the game to overtime. Denver scored the first five points of the extra period.\n\n\r\n              “For us to come down from 15 in the fourth? That’s what they do,” Malone said. “OKC makes a habit of that. They’ve come back a lot of times from big deficits and tonight we were able to flip the script.”\n\n\r\n              “I gave Nikola about a minute forty-nine rest at the end of the third and he played the rest of the way. I played him 64 for minutes in a playoff game once, People don’t think he’s athletic, but he’s like Secretariat man. He can run for days.” \n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Porter. missed the game with a left heel injury, while Murray was held out for rest. Bones Hyland, Ish Smith, Jeff Green and Payton Watson had already been ruled out so, Denver had only had 10 players in uniform and only nine played, as DeAndre Jordon never got off the bench.\n\n\r\n              Thunder: Aleksej Pokusevski returned to the starting lineup after missing Monday’s game against the Knicks with an ankle injury. Mike Muscala was not in uniform after suffering a broken thumb Monday against the Knicks.\n\n\r\n              NEXT\n\n\r\n              Nuggets: At Los Angeles Clippers on Friday night.\n\n\r\n              Thunder: Host Chicago on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994729.391231
}