{
  "game_id": "0022300675",
  "espn_id": "401585303",
  "date": "Jan 31, 2024",
  "matchup": "CLE vs. DET",
  "headline": "Donovan Mitchell scores 45 points, Cavs hold off Pistons 128-121 in Darius Garland's return",
  "body": "CLEVELAND -- — Donovan Mitchell scored 20 of his 45 points in the fourth quarter, Darius Garland had 19 points in his return from a broken jaw and the Cleveland Cavaliers held off the NBA-worst Detroit Pistons 128-121 on Wednesday night.\n\n\r\n              Jarrett Allen had 14 points and 11 rebounds for his franchise-record 16th straight double-double and Isaac Okoro added 14 points for the Cavaliers. Cleveland won for the 11th time in 12 games and has the best record in the league since Dec. 16 at 16-4.\n\n\r\n              “You marvel at what Donovan does when the game is on the line,” Cavaliers coach J.B. Bickerstaff said. “We have a closer. Not a lot of teams can say that and it’s a huge advantage for us.”\n\n\r\n              Danilo Gallinari scored 20 points and went 4 of 4 on 3-pointers, and Cade Cunningham had 19 points and seven assists for the Pistons, who were seeking their first back-to-back wins since Oct. 27-28.\n\n\r\n              A seesaw fourth quarter saw Detroit take a 118-116 lead with 3:20 remaining on Jalen Duren’s layup. The Cavaliers answered with a 10-0 run, capped by four free throws by Mitchell, to complete their eighth consecutive win over the Pistons.\n\n\r\n              Mitchell matched his season high in scoring.\n\n\r\n              “We just didn’t execute with good coverage on Donovan, and that’s on me,” Detroit coach Monty Williams said. “This is the formula for us to win games, but we have to be much better. And that falls on me.”\n\n\r\n              Garland logged 20 minutes in his first action since Dec. 14, when he sustained the injury in a collision with Boston’s Kristaps Porzingis. The former All-Star was sidelined for 19 games, forcing Mitchell to slide over to point guard.\n\n\r\n              The Cavaliers, who are fourth in the East, had their projected starting lineup together for just the 12th time this season. Two days earlier against the Clippers, Evan Mobley returned from a 21-game absence after undergoing left knee surgery.\n\n\r\n              “It’s great to have DG and Evan back, that’s first and foremost,” Mitchell said. “The biggest thing now is to continue to figure it out. We have a deep, talented team and we’re continuing to build together.”\n\n\r\n              Cleveland went up 94-85 in the third, the largest lead by either team in a game that included 11 ties and 11 lead changes. Garland did not play in the final 7:30 because he's on a minutes restriction.\n\n\r\n              “It’s definitely been a long process with all the stuff I’ve been through in this last month,” Garland said. “Being back out there with the guys tonight was great.”\n\n\r\n              Jaden Ivey scored 14 points and Duren finished with 10 points and nine rebounds as Detroit had seven players score in double figures. Forward Mike Muscala left the game after four minutes with a head injury.\n\n\r\n              “Donovan Mitchell was tough and put a lot of pressure on us late,” Cunningham said. “He’s a really good player and he’s going to make plays.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host the Los Angeles Clippers on Friday night.\n\n\r\n              Cavaliers: Visit Memphis on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996732.302891
}