{
  "game_id": "0021800683",
  "espn_id": "401071359",
  "date": "Jan 19, 2019",
  "matchup": "ATL vs. BOS",
  "headline": "Irving has 32 as Celtics rally in 4th quarter, top Hawks",
  "body": "ATLANTA --  Kyrie Irving and the Boston Celtics found a way.\n\nNot bad for the second part of back-to-back games.\n\nIrving scored 32 points and the Celtics rallied to beat the Atlanta Hawks 113-105 on Saturday for their third straight win.\n\nAfter trailing for most of the night, Boston took the lead with a 9-0 fourth-quarter run, including a go-ahead 3-pointer by Jaylen Brown, who had 14 points.\n\nThe Celtics had been only 2-5 in the second game of back-to-backs. That made the comeback especially satisfying for coach Brad Stevens.\n\n\"We just were gritty ... We need that kind of response to what we've done the last few opportunities we had back-to-backs,\" Stevens said.\n\nA drive by Irving gave Boston the lead for good at 101-100. Al Horford made four free throws and a layup to help the Celtics increase their advantage to 109-100 with 1:11 left.\n\nKevin Huerter led Atlanta with 18 points, and fellow rookie Trae Young had 16.\n\nMinutes after he was called for his first technical following his fourth foul about three minutes into the third quarter, Boston's Marcus Smart was ejected following an altercation with Atlanta's DeAndre Bembry.\n\nWith Atlanta leading 76-69, Smart and Bembry had to be separated after they exchanged words as players lined up for a jump ball. After being restrained by teammates and coaches, Smart broke free and charged toward Bembry before being restrained again.\n\nSmart did not talk with reporters after the game.\n\n\"He lost his cool after the ref told him he's ejected,\" Bembry said. \"I think after that he just thought he had nothing else to lose.\"\n\nBembry said it wasn't unusual to see Smart lose control. Irving described Smart as fiery.\n\n\"We accept Marcus for who he is ... It's our responsibility to pick him up,\" Irving said.\n\nBembry also was called for a technical foul following a video review of the incident.\n\nBoston's Jayson Tatum opened the game with a three-point play. The Hawks scored the next 10 points and kept the lead until Brown's 3-pointer with 9:07 remaining gave Boston a 95-93 edge.\n\nTIP-INS\n\nCeltics: Tatum had 19 points and Horford had 13. ... Due to expected bad weather in the Boston area on Saturday night, there were tentative plans for a return flight on Sunday. Travel concerns also led to F Gordon Hayward remaining in Boston, where his wife is expecting the couple's third child.  \"With pending weather, there was no reason to make this trip,\" Stevens said of Hayward.\n\nHawks: John Collins and Alex Len each had 15 points. ... Collins (bronchitis-like symptoms) and Young (flu-like symptoms) started after being upgraded before the game. ... C Dewayne Dedmon (left ankle sprain) had six points in 24 minutes in his return after missing two games.\n\nKYRIE IN CONTROL\n\nOne night after scoring 38 points against Memphis, Irving went 5 for 8 from 3-point range. He pulled the Celtics back from a 50-34 deficit by scoring 15 of Boston's final 19 points of the first half, cutting the Atlanta lead to 67-60.\n\n\"The first-half defense just wasn't very good,\" Stevens said. \"Kyrie was special and he kept us in it.\"\n\nCOLD FINISH\n\nAfter leading 89-83 through three quarters, the Hawks were outscored 30-16 in the final 12 minutes while making only 6 of 20 shots from the field, including 1 of 11 3-pointers.\n\nHOT HUERTER\n\nHuerter continued to shine in his fill-in starting role while Kent Bazemore recovers from a sprained right ankle. Huerter has made 45.5 percent of his 3-point attempts to lead all NBA qualifying rookies. He made 4 of 10 3s against Boston.\n\nUP NEXT\n\nCeltics: Host Miami on Tuesday night.\n\nHawks: Host Magic on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995362.016684
}