{
  "game_id": "0021700255",
  "espn_id": "400975006",
  "date": "Nov 22, 2017",
  "matchup": "POR @ PHI",
  "headline": "Joel Embiid helps fast-starting 76ers rout Blazers 101-81",
  "body": "PHILADELPHIA --  It was anything but \"a regular block.\"\n\nJoel Embiid punctuated the Philadelphia 76ers' 101-81 victory over the Portland Trail Blazers on Wednesday night by spiking Damian Lillard's layup attempt out of bounds, volleyball style.\n\nIt capped a game-changing stretch by the Philadelphia center.\n\nPhiladelphia scored the game's first 16 points, led by 13 at halftime and again by 16 early in the third. After Lillard got the Blazers within nine late in the quarter, Embiid answered with a basket, block, slam, jumper -- and then the exclamation point. The emphatic rejection caused the frenzied crowd at the packed Wells Fargo Center to erupt.\n\n\"It was just a regular block,\" said Embiid, who finished with 28 points, 12 rebounds and two blocks.\n\nEmbiid's modest answer followed a bold claim.\n\n\"Not to be cocky, but I think I'm the best defensive player in the league right now,\" he said. \"I just want to keep on growing. I'm still getting better. My blocks are a little bit down, but I'm a better rebounder this year. ... I'm doing a lot of things to help the team win, and the guys around me do a lot of things to help me, too. I just want to keep on growing defensively and be the best defensive player in the league. Hopefully, this year I can win Defensive Player of the Year.\"\n\nPortland missed its first 13 shots before Shabazz Napier came off the bench and hit a jumper with 5:01 left in the first quarter. The Blazers never got closer than eight. It was the Blazers' lowest point total of the season and the fewest that Philadelphia has allowed.\n\n\"I would give us an A on defense and like a C-minus on offense,\" Sixers coach Brett Brown said. \"Turnovers (Philadelphia had 18), at times ratty shots. I thought we could have put them down a little bit earlier.\"\n\nPortland shot just 33.7 percent from the field and 58.3 percent from the line.\n\n\"I don't know if it was anything they did. We couldn't buy a basket early,\" Blazers coach Terry Stotts said.\n\nLillard finished with 30 points, hitting six 3s, but CJ McCollum had just five on 1-for-14 shooting.\n\n\"I think we defended hard. I think it was just another case of us struggling on the offensive end,\" Lillard said. \"We just weren't able to put up points.\"\n\nTIP-INS\n\nTrail Blazers: After scoring Portland's first points, Napier followed with a 3 and two free throws to account for the Blazers' first seven points. ... The crowd greeted former Sixer Evan Turner with a loud round of boos. The 76ers drafted Turner second overall in 2010. ... The Blazers had held seven of their last eight opponents under 100 points. ... Forward Al-Farouq Aminu (ankle) missed his ninth straight game.\n\n76ers:\n\nThe last time the Sixers took a 16-0 lead was Oct. 30, 2013, against Miami. They scored the game's first 19 points that night. ... Ben Simmons had three steals and has 35 on the season. Simmons finished with 16 points and nine assists.\n\nLILLARD UPSET\n\nLillard attempted just three free throws, making two.\n\n\"I go to the rim a lot,\" he said. \"I'm getting smacked in my head, smacked on my shooting hand when I'm going to the basket. Guys knocking me to the ground every other play -- like hard. And they know I'm trying to score man. It's impossible for me to shoot two or three free throws. It's impossible.\"\n\nWE WANT OKAFOR?\n\nIn the game's final minute, the fans chanted \"We want Okafor!\" Seldom used big man Jahlil Okafor, the third overall pick in the 2015 draft, didn't get in the game and has played only two games this season.\n\nUP NEXT\n\nTrail Blazers: At Brooklyn on Friday night.\n\n76ers: Host Orlando on Saturday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993446.2759922
}