{
  "game_id": "0022200598",
  "espn_id": "401468753",
  "date": "Jan 08, 2023",
  "matchup": "CHA @ IND",
  "headline": "Turner, Haliburton key Pacers’ 116-111 victory over Hornets",
  "body": "INDIANAPOLIS -- — Myles Turner scored 29 points, Buddy Hield had 21 and the Indiana Pacers capped the first half of their regular-season schedule with a 116-111 comeback victory over the Charlotte Hornets on Sunday.\n\n\r\n              Tyrese Haliburton finished with 16 points, 13 assists and five rebounds for the Pacers, who trailed by nine early in the fourth quarter and needed a series of clutch plays in the final minutes to improve their record to 23-18 at the midpoint.\n\n\r\n              “I’m just excited for us, excited that we’re overachieving,” Turner said. “We still have a lot of work to do. We can’t be satisfied.”\n\n\r\n              P.J. Washington had 22 points and five rebounds for the Hornets. Terry Rozier chipped in 19 points, six assists and six boards, and Mason Plumlee wound up with 18 points and 13 rebounds.\n\n\r\n              Plumlee attempted a dunk with 13 seconds left that would have brought Charlotte within a point, but Turner’s blocked shot sent the crowd into a frenzy. The 26-year-old rising star finished with nine rebounds and four blocks. His three-point play with 1:11 left had tied the game.\n\n\r\n              “Myles is in his prime,” Pacers coach Rick Carlisle said. “He’s playing the best he’s ever played. Down the stretch, he was tremendous. I coached Jermaine O’Neal here, and Jermaine had that. It was uplifting to his teammates.”\n\n\r\n              Two free throws from Aaron Nesmith made it 116-111 with 6.9 seconds left and secured Indiana’s eighth win in its last 10 games.\n\n\r\n              “Forty-one games: doesn’t feel like 41 games, but it is,” Carlisle said. “The next 41 will go by pretty fast, too. We’re getting a lot of clutch experience. We’re not perfect, but we’re gradually getting better, and we’ve got a great crowd that has helped us get over the hump in a lot of these games.”\n\n\r\n              Charlotte, which dropped to 11-30 at the halfway mark, has lost four of its last five. Top scorer LaMelo Ball fouled out in the final minute with 13 points and eight assists.\n\n\r\n              “It’s hard for us when (Ball) only plays 24 minutes,” Hornets coach Steve Clifford said. “That is just part of his growth. We had a couple really bad fouls. We put ourselves in a good place for three quarters. Our defense in the fourth wasn’t good enough.”\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Starting forward Gordon Hayward, a former All-Star, sat out a third straight game because of a sore hamstring. The injury cost the 12-year veteran a homecoming affair; he played collegiately at Butler and is a native of nearby Brownsburg. … Kelly Oubre Jr., the team’s third-leading scorer at 20.2 points per game, missed his fifth in a row due to a torn hand ligament that required surgery on Thursday.\n\n\r\n              Pacers: Indiana committed 16 turnovers but forced 18 by the Hornets. … The Pacers trailed 27-15 at the end of the first quarter but recovered for a 47-45 halftime advantage. It was 79-73 Indiana entering the final period. … Andrew Nembhard finished with 19 points and four steals, while Nesmith added 15 points, six rebounds and four steals.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Head to Toronto for a two-game set, Tuesday and Thursday.\n\n\r\n              Pacers: At the New York Knicks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994267.625704
}