{
  "game_id": "0021501072",
  "espn_id": "400828959",
  "date": "Mar 24, 2016",
  "matchup": "POR @ LAC",
  "headline": "Redick's buzzer-beater lifts Clippers past Blazers",
  "body": "LOS ANGELES --  Chris Paul used nutmeg pass typically used in soccer to help the Los Angeles Clippers get a win.\n\nWith a leaping, 6-foot-11 Mason Plumlee in his face along the right sideline, Paul bounced a pass between Mason's legs to J.J. Redick, who hit a 21-foot jumper as time expired to lift the Clippers to a 96-94 victory over the Portland Trail Blazers on Thursday night.\n\n\"Plumlee was jumping, and I really couldn't see J.J.,\" said Paul, who could see DeAndre Jordan setting the screen and just anticipated where Redick would be.\n\n\"(Plumlee) jumped high enough to where I could basically bounce-pass it between his legs.\"\n\nReddick said the Clippers have run this sideline inbounds play successful several times this season. With 1.1 seconds on the clock, they decided to run it again. Redick took the pass just inside the arc to the right of the foul circle, and buried the game-winner.\n\n\"Obviously I had to get open and D.J. had to screen,\" said Redick, \"but there was a moment when I could have gone over the screen, and at the last second I went under, and D.J. changed the angle. I was worried Chris was going to throw it like I was going over the top.\n\n\"I probably shouldn't have worried. He doesn't panic. He made a hell of a pass.\"\n\nPaul, unfamiliar with the term was puzzled when a reporter asked if it was the first time he'd won a game with a nutmeg. Once the soccer reference was explained to him, Paul said, \"Yeah, it may have been a first.\"\n\nPaul and Jamal Crawford each scored 25 points and Jordan added 12 points and 13 rebounds for Los Angeles, who needed a victory like this.\n\n\"It's all about confidence,\" said Paul. \"I think our spirit was right again today, like yesterday, but they were hitting some tough shots. You just need to know what it feels like to win again.\"\n\nDamian Lillard scored 18 points and C.J. McCollum added 17 to lead the Trail Blazers, who lost for the eighth time in 12 games. Ed Davis scored 12 points, Mason Plumlee had 11, and Maurice Harkless added 10 points and eight rebounds for Portland.\n\n\"We did a lot of good things tonight,\" Blazers coach Terry Stotts said, \"but we could not get a stop when we needed to. They scored about nine straight times at the end, and to win a close game like this on the road, you havea to able to come up with a stop, and we were not able to do that.\"\n\nThe loss cut the Blazers' lead to one game over Dallas and Utah for sixth place in the Western Conference with nine games to play.\n\nThe Clippers' four 3-pointers in the game equaled a season-low.\n\nAfter Lillard hit a 3 with 23 seconds to play to put Portland up 94-91, Crawford matched it to tie the score with 11 seconds to play. Harkless missed a short jumper in traffic, setting up the game's final play.\n\nHOME SWEET HOME\n\nThe Blazers ended a stretch playing 12 of 15 road games. In a battle with Dallas, Utah and Houston for the final three Western Conference playoff spots, the Blazers play their next four games at the Moda Center, where they are 22-12 this season, having won eight of their last nine.\n\nSTEPPING UP AT STAPLES\n\nThe Clippers improved their home record to 23-12. They are 21-15 on the road.\n\n\"I think we've had a nice year on the road,\" Rivers said prior to the game, \"but I don't think we've had a nice year at home.\"\n\nCLERICAL ERROR\n\nThis was the first Trail Blazers-Clippers game since the Blazers had to play on Jan. 6 without starting guard C.J. McCullum, who was healthy but listed as inactive on the pregame lineup sheet. The submission was due to a \"clerical error,\" according to the Portland public relations team.\n\nWhen asked before this game they triple-checked the active list, Blazers coach Terry Stotts responded, \"No comment.\"\n\nTIP-INS\n\nTrail Blazers: Portland's 39 points in the first half was the team's lowest halftime total since managing 34 on Jan. 4 against Memphis. The Blazers, third in the league in 3-point percentage, went 1 for 13 from beyond the arc in the first half, with only Gerald Henderson successful with 1:39 left in the first quarter. ... Meyers Leonard missed his 12th game with an injured left shoulder.\n\nClippers: No date yet for Blake Griffin's return, according to Clippers coach Doc Rivers. Griffin, who has resumed conditioning and shooting, has yet to practice with the team.\n\nUP NEXT\n\nTrail Blazers: Host Philadelphia on Saturday.\n\nClippers: Host Denver on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994499.676218
}