{
  "game_id": "0022301107",
  "espn_id": "401585735",
  "date": "Apr 03, 2024",
  "matchup": "MIL vs. MEM",
  "headline": "Jaren Jackson Jr. scores 35 points in Grizzlies' 111-101 win over Bucks",
  "body": "MILWAUKEE -- — Jaren Jackson Jr. scored 35 points to lead the Memphis Grizzlies to an 111-101 victory over the Milwaukee Bucks on Wednesday night.\n\n\r\n              The Bucks lost for the fourth time in their past five games as they've faltered while trying to hold on to the No. 2 seed in the Eastern Conference. \n\n\r\n              Jackson dominated in the second half, scoring 25 of his points while lifting the Grizzlies to their fifth straight victory over Milwaukee. He made 14 of 26 shots and a pair of critical 3-pointers in the fourth quarter.\n\n\r\n              “I was taking what the defense gives me,” Jackson said. “I've been working on my game a lot and I was glad to get the opportunity to get out there and show it a little bit.”\n\n\r\n              Brook Lopez paced the Bucks with 25 points and 10 rebounds while Giannis Antetokounmpo added 21 points, seven rebounds and eight assists. Bobby Portis had 19 points and Malik Beasley 10.\n\n\r\n              Bucks coach Doc Rivers was more concerned after the game about the health of Antetokounmpo, who played 32 minutes on the second night of a back to back after getting a triple-double in a loss to Washington on Tuesday.\n\n\r\n              “Honestly, and I'm not kidding, there were times in the middle of the third (quarter), I wanted to take him out of the game,” Rivers said. \"I thought he was running on fumes. As a coach, you have to make a judgment call sometimes.\n\n\r\n              “Medical makes the call. They kept saying he's OK. But I have eyes. I just didn't like the way he was moving. He kept asking to go back in. But I wish I had just said, no, honestly.”\n\n\r\n              Both teams were short-handed with the Grizzlies missing Ja Morant, Desmond Bane and Marcus Smart because of injuries and the Bucks playing without Damian Lillard, Khris Middleton and Patrick Beverley.\n\n\r\n              GG Jackson had 15 points and a game-high 12 rebounds and Brandon Clarke, recently returned from an Achilles tendon injury that cost him 72 games this season, scored 14 points for Memphis.\n\n\r\n              The Grizzlies outscored the Bucks in the paint 76-36 as they pounded the ball inside and relied on the 6-foot-11, 242-pound Jaren Jackson.\n\n\r\n              \"We got beat off the dribble a ton, and just not by their guards, by their bigs as well,\" Rivers said. “Jaren Jackson turned the whole game around.”\n\n\r\n              The Grizzlies went on a quick 9-0 run to grab a 98-90 lead with 4:17 remaining, sparked by seven points from Jaren Jackson. The Bucks did not get closer than a four-point deficit the rest of the way.\n\n\r\n              Antetokounmpo drew his fourth foul with 4:15 left in the third quarter and had to go to the bench, and the Grizzlies took advantage. Jaren Jackson scored nine points in the remainder of the quarter as Memphis outscored Milwaukee 15-8 to erase a six-point deficit and take a 79-78 lead into the final period.\n\n\r\n              Lillard missed his third consecutive game and second with a right groin injury, and Beverley sat out with a sprained right ankle suffered in the Bucks’ loss at Washington.\n\n\r\n              The Bucks also were without Middleton, who scored 24 points against the Wizards on Tuesday but has not normally played in back-to-back games this season.\n\n\r\n              Rivers said Lillard had a good workout Tuesday and could return Friday against Toronto.\n\n\r\n              “I think he’s closer,” Rivers said. “But that’s one, if he’s not 100% or 90th percentile or whatever, then no. That one, we’re just not going to take a chance. It’s not worth it.”\n\n\r\n              Since Rivers was hired as coach on Jan. 26 to replace Adrian Griffin, the trio of Antetokounmpo, Middleton and Lillard has played together only six times out of 40 games.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: host Detroit on Friday.\n\n\r\n              Bucks: host Toronto on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996100.397419
}