{
  "game_id": "0021800093",
  "espn_id": "401070774",
  "date": "Oct 29, 2018",
  "matchup": "MIN vs. LAL",
  "headline": "Butler shoots Timberwolves past James, Lakers 124-120",
  "body": "MINNEAPOLIS --  After a lethargic loss in their last game, the Minnesota Timberwolves came to life.\n\nLeBron James and the Los Angeles Lakers served as their spark plug.\n\nJimmy Butler hit five of Minnesota's eight 3-pointers in the fourth quarter to finish with 32 points on 12-for-20 shooting and help the Timberwolves hang on to beat the Lakers 124-120 on Monday.\n\n\"They were playing fast, which made us play with a lot of energy, so I guess their energy kind of helped ours,\" Butler said.\n\nKarl-Anthony Towns pitched in 25 points, a season-high 16 rebounds and four blocks for the Timberwolves (3-4), who played some clutch defense just in time to fend off a late push from James. The four-time MVP had 10 of his 29 points in the fourth quarter after missing his first five shots of the night, but the Lakers (2-5) went back to Los Angeles with another uneven performance.\n\n\"We've got to get better. We know that. We talk about patience, but we can't have reoccurrence of doing the same things over and over and over again and expecting a different result,\" said James, who added 10 rebounds and seven assists on the 15th anniversary of his professional debut. \"That's insanity.\"\n\nBrandon Ingram came back strong from his four-game suspension with 24 points for the Lakers. Kyle Kuzma, after scoring 11 points in the first five minutes, had only eight more over the rest of the night. The Lakers let the Wolves grab a season-high 20 offensive rebounds and committed 18 turnovers.\n\nAnthony Tolliver was perfect on four shots from the floor for the Timberwolves, including a 3-pointer to start the fourth quarter for a 96-94 lead. Butler's back-to-back swishes from behind the arc pushed the lead to 114-107. He added one more, his fifth in as many attempts in the final period, to make it 122-117. That preceded a corner miss with 16.3 seconds left by James, who had a costly turnover with 1:43 remaining when he lost the ball at the top of the key and let it drift into the backcourt.\n\n\"We've got to get better at the little things. One of those things is paying attention to details, following game plans. The game plan tonight: Keep them off the free throw line, and defensive rebounding,\" Lakers coach Luke Walton said. \"They hurt us with both of those.\"\n\nBETTER EFFORT\n\nRookie Josh Okogie, starting at shooting guard for the Wolves in place of the injured Andrew Wiggins, had a career-high 17 points. The defensive-minded Okogie was one of the catalysts for a team that lost at home to Milwaukee by 30 points on Friday night.\n\n\"Shots are going to fall. Shots aren't going to fall. But we have to have that energy every single night, and that's what's going to get us through those humps,\" said Okogie, who added four rebounds, three assists and three steals in 30 minutes.\n\nWolves coach Tom Thibodeau remained noncommittal on keeping Okogie as part of the rotation when Wiggins is back.\n\n\"He makes things happen,\" Thibodeau said. \"He's not perfect, but he's learning, he's eager and every day he comes in with a great attitude, and I like that he's taking advantage of when he does play.\"\n\nINGRAM IS IN\n\nThe Lakers went with a new starting lineup to maximize their length, sliding the 6-foot-9 Ingram back to the shooting guard spot and flanking James with the sharpshooting Kuzma at power forward. They entered the night with a league-leading 22 percent of their points coming on fast breaks, but the Wolves outscored them 21-15 in transition. Ingram was 9 for 18 from the floor.\n\n\"I didn't feel tired out there,\" Ingram said. \"That was surprising.\"\n\nTIP-INS\n\nLakers: Backup forward Michael Beasley was away from the team to tend to a personal matter. He has appeared in three games, logging a total of 10 minutes. He's with his seventh different team in his 11th NBA season. ... The largest lead for the Lakers, 90-85, came on Lance Stephenson's 3-pointer with 3:28 left in the third.\n\nTimberwolves: Wiggins took part in the morning shootaround but was held out for the third straight game with the strained right quadriceps that stopped his consecutive regular-season games played streak at 243. ... Rose had 11 points, seven rebounds and seven assists but missed 12 of 16 shots from the field. ... Taj Gibson had three of the team's 12 blocks, tying a season high.\n\nUP NEXT\n\nLakers: Host the Dallas Mavericks on Wednesday night.\n\nTimberwolves: Host the Utah Jazz on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994077.161057
}