{
  "game_id": "0022001060",
  "espn_id": "401307874",
  "date": "May 15, 2021",
  "matchup": "BKN vs. CHI",
  "headline": "Nets finally get Big 3 back together, beat Bulls 105-91",
  "body": "NEW YORK -- — Kevin Durant, Kyrie Irving and James Harden were on the floor together for the first time in three months.\n\n\r\n                    Barely two minutes later, they were back on the bench for a timeout, looking up a 12-0 deficit on the scoreboard.\n\n\r\n                    The Brooklyn Nets shook off that slow start Saturday, beat the Chicago Bulls 105-91 and remained confident there's enough time to turn into the team they expect. \n\n\r\n                    “It’s been a long season, full of ups and downs when it comes to lineups and having all our guys on the same page,” Durant said, “but it was good to get everybody healthy, get some minutes with everybody and we’re going to keep building from here.”\n\n\r\n                    The eighth appearance of the season for Brooklyn's Big Three wasn't particularly pretty. But the Nets had some sharp stretches and won their fourth straight, improving to 6-2 with their three All-Stars in the same game. \n\n\r\n                    Irving scored 22 points, but Durant shot just 4 for 17 and finished with 12 points, nine rebounds and six assists. Harden had seven assists, five points and five rebounds while playing 25 minutes in his second game back from a hamstring injury.\n\n\r\n                    But Brooklyn got 19 points and five 3-pointers from Jeff Green, while Bruce Brown had 16 points and 12 rebounds. The Nets ensured they would remain second in the Eastern Conference heading into the final day of the regular season. \n\n\r\n                    “Wasn’t a great game, we weren't very sharp but we got the job done and move on to tomorrow,” coach Steve Nash said. “One last game.”\n\n\r\n                    Patrick Williams scored 24 points for the Bulls, the highest total of his rookie season. Thaddeus Young added 19 points and 13 rebounds.\n\n\r\n                    Chicago was eliminated from contention for the play-in tournament Friday when Washington beat Cleveland, never mounting the run it hoped after acquiring Nikola Vucevic to pair with Zach LaVine.\n\n\r\n                    “So it wasn’t what we thought it would be obviously as far as the results in the end,\" Vucevic said. \"But I think that there were some positives for us to build upon and hopefully go into next year with these few months that we did spend together. However many games we played will give us a base to kind of see what we need and what we need to do going into next year to be better from the beginning.” \n\n\r\n                    Durant, Irving and Harden hadn't played together since Feb. 13, in a victory at Golden State. Durant began a 23-game absence with a left hamstring injury in the next game, and Harden just returned this week from his own right hamstring injury that sidelined him 18 games.\n\n\r\n                    They were far from their best, with Durant missing his first five shots and never really finding his stroke. The Nets then scored just 18 points on 8-for-22 shooting in the third quarter, when Durant and Irving were a combined 3 for 10.\n\n\r\n                    “It didn’t feel weird at all,” Harden said of playing with Durant and Irving again. “It's just a matter of us, I guess, getting more minutes together.”\n\n\r\n                    The Bulls trailed by only four after a 10-0 run early in the fourth quarter while the Big Three all rested, but the Nets promptly put it away with a 15-2 response, the last seven after Durant and Harden re-entered, to make it 100-83. \n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Chicago played without LaVine (right knee tendinitis), Daniel Theis (right hip), and Troy Brown Jr. and Tomas Satoransky (sprained left ankles). Coach Billy Donovan said LaVine had been feeling pretty sore and the team wanted to be protective of its leading scorer. \n\n\r\n                    Nets: Joe Harris missed his second straight game and won't play Sunday because of a left gluteal strain. Nash said it was a slight strain and Harris was expected to fully recover in time for the playoffs. ... Nicolas Claxton had 10 points and eight rebounds.\n\n\r\n                    DELAYED DEBUT\n\n\r\n                    It was the first time the Big Three played in front of its home crowd. Fans were not allowed inside Barclays Center until Feb. 23.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host Milwaukee on Sunday.\n\n\r\n                    Nets: Host Cleveland on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997468.391448
}