{
  "game_id": "0022300111",
  "espn_id": "401584739",
  "date": "Oct 30, 2023",
  "matchup": "ORL @ LAL",
  "headline": "D'Angelo Russell comes up big with 12 points in 4th quarter of Lakers' 106-103 win over Orlando",
  "body": "LOS ANGELES -- — D’Angelo Russell scored 12 of his 28 points in the fourth quarter, LeBron James added nine of his 19 in the final period, and the Los Angeles Lakers rallied for a 106-103 victory over the Orlando Magic on Monday night.\n\n\r\n              Anthony Davis had 26 points and 19 rebounds for the Lakers, who handed Orlando its first loss of the season by finishing on a 12-5 run in the final four minutes.\n\n\r\n              “What you guys see is a team figuring it out,” Russell said. “This isn’t the product that it will be in a month or two from now. Every game matters. Every clutch situation matters. Every practice matters. So we’re figuring it out.”\n\n\r\n              The Magic nursed a lead throughout the fourth quarter until James put the Lakers ahead by one on a 3-pointer with 2:27 to play. Jalen Suggs replied with his third 3-pointer of the night, but Russell hit another 3-pointer with 1:43 to go.\n\n\r\n              Both teams missed two shots apiece before Suggs’ shot in the lane was smothered by Davis and rebounded by Christian Wood with 13 seconds to play. After Russell hit two free throws, Franz Wagner and Suggs missed 3-point attempts in the final seconds, with James getting credit for a block on Wagner's shot.\n\n\r\n              The Lakers got a much-needed big game from Russell, the returning point guard who can carry some of the scoring load when James and Davis are weary. Russell added eight assists while hitting 10 of his 14 shots, including three 3-pointers.\n\n\r\n              Russell, James and Davis combined to score the Lakers' final 30 points over the last 13 1/2 minutes.\n\n\r\n              “We’re going to continue to get better,” James said. “I think we’re still a little trying to figure it out, which is OK. We’re four games in. We’re going to get a lot better throughout the season, but so far we like some of the things we see.”\n\n\r\n              Gary Harris Jr. scored 17 points with five 3-pointers for the Magic, who missed their final five shots. Wagner scored 16 points and Suggs had 15.\n\n\r\n              “I think our guys’ effort was there,” Orlando coach Jamahl Mosley said. “The intensity, the fight, the resiliency is what we’re asking of them, and we knew what it was going to be in this environment. For our guys to sustain that is a good sign. It didn’t just come down to those last couple of shots.”\n\n\r\n              Los Angeles looked sluggish at times after losing in overtime at Sacramento on Sunday night, and the Lakers grabbed only three offensive rebounds while getting beaten 20-4 in second-chance points.\n\n\r\n              “It just shows a resiliency that we have as a team, but also knowing that if we get in those situations, we know what to do,” Davis said. “Guys are not rushing shots or making bad plays. Just doing what we need to do for our teammates.”\n\n\r\n              Orlando hadn’t played since Friday in Portland, and the Magic looked sharper in the second half before fading in the final minutes.\n\n\r\n              “They force you to play and compete each and every possession on both sides of the ball,” Lakers coach Darvin Ham said of the Magic. “They never stop coming. You can see the growth in that team, albeit they're very young. They make you play, and they put a lot of pressure on you.”\n\n\r\n              The Lakers considered resting James with his left ankle tendonitis in the second game of their back-to-back set as part of their ongoing efforts to limit the minutes of the 38-year-old leading scorer in NBA history. James decided he would play anyway after going through his pregame workout.\n\n\r\n              Harris went 5 for 5 with four 3-pointers in the first half while the Magic rallied to a halftime lead after trailing by 11 early.\n\n\r\n              Rui Hachimura sat out for Los Angeles after injuring his eye in Sacramento. but new backup big man Wood provided another strong game for the Lakers with nine points, nine rebounds and three blocked shots.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Clippers on Tuesday.\n\n\r\n              Lakers: Host Clippers on Wednesday before opening a four-game trip in Orlando on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995752.372878
}