{
  "game_id": "0022400874",
  "espn_id": "401705440",
  "date": "Mar 02, 2025",
  "matchup": "LAC @ LAL",
  "headline": "Luka scores 29 points and LeBron adds 17 in the Lakers' 2nd straight win over the Clippers, 108-102",
  "body": "LOS ANGELES -- — Luka Doncic had 29 points and nine assists, LeBron James added 17 points and the Los Angeles Lakers hung on to beat the Los Angeles Clippers for the second time in three days, 108-102 on Sunday night.\n\n\r\n              Rookie Dalton Knecht scored 19 points for the Lakers, who won their sixth straight game despite playing without injured starters Austin Reaves and Rui Hachimura. The Lakers have won 16 of 19 overall.\n\n\r\n              Kawhi Leonard scored a season-high 33 points for the Clippers, who erased most of a late 21-point deficit before falling short in their fifth loss in six games.\n\n\r\n              Norman Powell scored four points in the first quarter before leaving with right hamstring soreness. The Clippers’ leading scorer was making his return from a five-game absence with a left knee injury.\n\n\r\n              Two days after the Lakers held off the Clippers 106-102, their second meeting also came down to the wire.\n\n\r\n              Leonard's 3-pointer trimmed the Lakers' lead to 107-102 with 1:40 to play, but the Clippers missed their final six shots.\n\n\r\n              Takeaways\r\n              Clippers: They looked downright terrible while failing to score in the final 7:35 of the first half, missing 10 straight shots with three turnovers. Their late rally was encouraging, but Powell's absence hurts.\n\n\r\n              Lakers: Something special might be brewing. Doncic looks more comfortable by the day, and they continue to get impressive results despite major injuries and a brutal schedule. They've jumped into second place in the Western Conference at 38-21.\n\n\r\n              Key moment\r\n              The Lakers led 86-66 when Doncic checked out with 2:20 left in the third quarter. The Clippers promptly began a 22-7 run.\n\n\r\n              Key stat\r\n              James is now a point shy of becoming the first player in NBA history to score 50,000 combined points in the regular season and the playoffs.\n\n\r\n              Up next\r\n              Both teams return Tuesday night. The Clippers visit the Suns, and the Lakers host the Pelicans.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997941.079749
}