{
  "game_id": "0022100817",
  "espn_id": "401360636",
  "date": "Feb 08, 2022",
  "matchup": "BKN vs. BOS",
  "headline": "Celtics romp to 126-91 win, star-less Nets drop 9th straight",
  "body": "NEW YORK -- — Jaylen Brown and Marcus Smart each scored 22 points and the Boston Celtics rolled to their sixth straight win, beating the star-less Brooklyn Nets 126-91 on Tuesday night.\n\n\r\n              Without Kevin Durant, James Harden and Kyrie Irving, the Nets weren't competitive in their ninth straight loss. Boston jumped to a 28-2 lead in a game that was never in doubt.\n\n\r\n              “I don’t know how often or if we’ve ever been so good to start like that before but it felt good,” Brown said. “We knew some of those guys were out. We wanted to just to take care of business early. We didn’t want to play around and give them confidence and let them linger into the game.” \n\n\r\n              Harden missed his third straight game with left hamstring tightness. Durant remains out with a sprained knee ligament and Irving is still ineligible to play home games because he isn't vaccinated against the coronavirus. \n\n\r\n              Jayson Tatum scored 19 points as the Celtics continued their strong stretch and moved past the Nets into seventh place in the Eastern Conference. \n\n\r\n              The Nets were considered the favorites to win the East with their Big Three, but they have lost 10 of 12 since Durant was hurt in the middle of January.\n\n\r\n              They just returned from a winless five-game trip to the West that ended with back-to-back blowouts in Utah and Denver without Harden.\n\n\r\n              Minutes into this one, it was clear they were headed toward another.\n\n\r\n              The Nets missed their first eight shots while Boston raced to a 14-0 lead on Brown’s 3-pointer. Blake Griffin’s jumper got the Nets on the board but the Celtics answered with another 14-0 run that made it 28-2 on Tatum’s second straight layup.\n\n\r\n              “Frankly, that’s a really good starting five that’s playing really good basketball playing against a reserve lineup, so we’re asking them to match a high, high-quality NBA starting five,” Nets coach Steve Nash said.\n\n\r\n              The first-half lead peaked at 67-39 on Smart’s 3-pointer and it was 69-43 at the break.\n\n\r\n              “We had a game plan that we wanted to go into and we followed it to the T,” Smart said. \n\n\r\n              Boston's starters played less than 30 minutes but piled up good stats anyway. Smart made six 3-pointers and Brown had nine assists and seven rebounds.\n\n\r\n              Jevon Carter scored 21 points on seven 3-pointers in Brooklyn's worst loss of the season.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Robert Williams had 12 points and 11 rebounds. ... Boston snapped a four-game skid against Brooklyn. \n\n\r\n              Nets: Cs LaMarcus Aldridge (sprained left ankle) and Nic Claxton (left hamstring tightness) remained out. ... Brooklyn is 5-13 without Durant. \n\n\r\n              TRADE TALK\n\n\r\n              Two days after saying the Nets wouldn't trade Harden before Thursday's deadline, Nash made it sound as if they wouldn't make any deals at all.\n\n\r\n              “Honestly, I think we’ll be exactly the same. I think the chances of trades or deals happening before the deadline are so slim, especially for our group,” Nash said. “So my mind and attention is on this group and putting this thing together as guys become healthy again and trying to build it for the stretch run.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Denver on Friday.\n\n\r\n              Nets: Visit Washington on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764993323.6751869
}