{
  "game_id": "0022001075",
  "espn_id": "401307889",
  "date": "May 16, 2021",
  "matchup": "ORL @ PHI",
  "headline": "Maxey leads 76ers past Magic 128-117 in meaningless finale",
  "body": "PHILADELPHIA -- — Tyrese Maxey had 30 points, seven rebounds and six assists, and the Eastern Conference champion Philadelphia 76ers beat the Orlando Magic 128-117 on Sunday night in a meaningless regular-season finale.\n\n\r\n                    Philadelphia didn’t play any of its usual starters after clinching the top spot in the East with Friday’s victory over the Magic. Joel Embiid (illness), Ben Simmons (back), Tobias Harris (right knee), Seth Curry (right hip) and Danny Green (left hip) were all sidelined.\n\n\r\n                    Maxey picked up the slack, going 11 of 19 from the field, including 3 of 4 from 3-point range, while making all five free throws. Paul Reed added 17 points and 12 rebounds.\n\n\r\n                    “They were really excited about playing today,” coach Doc Rivers said of Philadelphia’s reserves.\n\n\r\n                    The Sixers finished 49-23 overall and 29-7 at home. They will host a first-round playoff series against the second team to emerge from the league’s new play-in tournament.\n\n\r\n                    “We’re going to work on a lot of stuff that pertains to us,” Rivers said of this week’s practice sessions.\n\n\r\n                    Cole Anthony scored a career-high 37 points for the injury-plagued Magic, who were without several key players. Orlando ended the season on a seven-game skid and finished 21-51.\n\n\r\n                    “This is the toughest season I’ve ever been through,” said Orlando coach Steve Clifford, who missed time this year after contracting COVID-19.\n\n\r\n                    Philadelphia has the top seed for the first time since 2001, when Allen Iverson led the team to the NBA Finals. Those Sixers lost in five games to the Lakers, and Philadelphia hasn’t gotten past the East finals in 10 postseason appearances since.\n\n\r\n                    The Sixers will have home-court advantage at least until the NBA Finals. Their first-round opponent could be the Hornets, Pacers, Wizards or Celtics. Philadelphia went 11-1 against those teams in the regular season.\n\n\r\n                    Maxey showed why the 76ers made him the 21st overall pick in last year’s draft, going 10 of 11 from the field and hitting all three of his 3-point attempts in the first half. The speedy point guard out of Kentucky provided a highlight when he flew down the lane for a two-handed dunk with 5 1/2 minutes left in the third quarter.\n\n\r\n                    “I'm been watching film and finding different ways to get all the way to the rack,” Maxey said. “I've put in the work, just working every single day. That creates confidence. My role is to stay ready and do whatever it takes for us to win. To be here and be successful at the highest level of basketball is a great feeling.”\n\n\r\n                    Anthony, the 15th pick in the draft, made 10 of 25 shots and all 14 free-throw attempts. He also had six turnovers, something that perturbed the rookie.\n\n\r\n                    “I have to be better than that,” he said.\n\n\r\n                    BIG ENERGY\n\n\r\n                    Embiid sat courtside while sporting the “Big Energy” chain in the first half. The 76ers have used the extremely large piece of jewelry as a reward among teammates during workouts. Embiid removed it after halftime.\n\n\r\n                    GOING GOOD\n\n\r\n                    Rivers was asked before the game to sum up in a word what has made the 76ers so successful.\n\n\r\n                    “Honestly, good,” he said. “We’ve been very good all year; that’s why we’re the No. 1 seed. We’re a consistent defensive team, we’re a consistent offensive team, we move the ball, we play with pace, we hit the open guy, we’re executing better than we have. We’re a solid basketball team.”\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Sindarius Thornwell was ejected with 2:37 left in the third period for a Flagrant-2 foul on Reed. ... Wendell Carter Jr. (left eye abrasion) and Terrence Ross (back spasms) didn’t play. … Michael Carter-Williams (left ankle sprain), James Ennis III (sore right calf), Markelle Fultz (torn left ACL), Jonathan Isaac (left knee injury recovery), Chuma Okeke (left ankle sprain) and Otto Porter Jr. (left foot pain) were inactive. ... Anthony’s previous career high was 24 points.\n\n\r\n                    76ers: Matisse Thybulle (swelling left hand) missed his fourth straight game. ... Alex Trindle, a 23-year-old 76ers fan, rang the ceremonial Liberty Bell before the game. In a tweet that went viral and drew the attention of the team, Trindle wore a 76ers hoodie while ringing a bell after completing six months of chemotherapy on April 28.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997792.403116
}