{
  "game_id": "0022100429",
  "espn_id": "401360253",
  "date": "Dec 16, 2021",
  "matchup": "BKN vs. PHI",
  "headline": "Durant carries Nets past 76ers for another short-handed win",
  "body": "NEW YORK -- — With so much of his team missing, Kevin Durant probably needs to play great for the Brooklyn Nets to win.\n\n\r\n              He might be playing as well as ever.\n\n\r\n              Durant scored 34 points, making a four-point play with the game tied and 1:46 left, and the Nets beat the Philadelphia 76ers 114-105 on Thursday night for another short-handed victory.\n\n\r\n              The Nets were missing seven players because of coronavirus health and safety protocols but still had Durant, the NBA's leading scorer who added 11 rebounds and eight assists. \n\n\r\n              That follows games of 51 points, nine assists and seven rebounds, and 34 points, 13 rebounds and 11 assists in the previous two. \n\n\r\n              “It's a challenge knowing how you're going to come in to the games because a lot of these teams, they scheme for me a little different,” Durant said.\n\n\r\n              Whatever the 76ers' scheme was, it didn't work well enough.\n\n\r\n              “I mean, that’s what he does on a nightly basis,” guard Seth Curry said. \n\n\r\n              Blake Griffin and Nic Claxton both added a season-high 17 points for the Nets, who had just nine players available. Patty Mills scored 14 points in Eastern Conference-leading Brooklyn's fourth straight victory.\n\n\r\n              Joel Embiid had 32 points, nine rebounds and six assists in the 76ers' third straight loss, dropping them to 15-15. Curry scored 29 points for a team that was angry that Brooklyn wasn't called for any fouls in the fourth quarter.\n\n\r\n              “I don’t remember the last time that happened, but still had a chance there,” Curry said.\n\n\r\n              It was Brooklyn's second straight game without starters James Harden, LaMarcus Aldridge and DeAndre' Bembry, along with reserves Bruce Brown, Paul Millsap, Jevon Carter and James Johnson.\n\n\r\n              “We can all hoop,” Claxton said of the young players forced into extended action. “A lot of attention is going to KD so we’re just making plays.” \n\n\r\n              The Nets built a 20-point lead but the 76ers, playing for the second straight night, tied it at 103 on Embiid's basket with 1:55 to play. Durant answered with a 3-pointer while being fouled by Tobias Harris, who had a nightmarish game on both ends. \n\n\r\n              Griffin followed with a 3-pointer to make it 110-103 and rookie David Duke Jr. added two free throws to put it away. \n\n\r\n              The Nets shot 65% and led 39-25 after one and pushed it to 54-35 when Griffin, who had fallen out of the rotation entirely but is now starting, converted a three-point play. \n\n\r\n              The Sixers trailed 66-46 late in the half but outscored Brooklyn 31-19 in the third, with Embiid and Curry combining for 25, to cut it to 85-79.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Harris shot 3 for 17, missing all five 3-point attempts. ... Coach Doc Rivers said there was an organizational discussion about some unspecified policy changes to be more vigilant against the coronavirus. Embiid and Harris were among the Sixers who were sidelined by the virus earlier this season. “We want to be the team with the least (cases),” Rivers said. “We lead still, I think, in COVID games off. That one stretch was brutal for us and now other teams are going through it. So it’s no fun.”\n\n\r\n              Nets: Veteran guard Langston Galloway, signed to a 10-day contract Thursday, had three points in nine minutes. ... With Durant playing about 37 minutes a game, coach Steve Nash said there is a “lot of consideration” to getting the All-Star forward a break. The Nets play a home back-to-back against Orlando and Denver this weekend. \n\n\r\n              COVID-19 CONCERNS\n\n\r\n              Though their coronavirus issues are mostly behind them, they aren't over entirely for the 76ers. Georges Niang is in health and safety protocols and Rivers wondered if the league would have to take additional steps with cases rising — which it is, with more testing and mask-wearing coming later this month.\n\n\r\n              “We have to do something because at this rate I’m scared to turn on ESPN right now. Just, more guys are out,” Rivers said.\n\n\r\n              So many for the Nets, in fact, that they were close to being unable to have the minimum eight to start a game. Though they avoided having to postpone, it means the limited players available took on a heavy load. \n\n\r\n              “So is it better to be over the threshold than to not be playing until you have a healthy roster?” Nash said. “Or is it better to have enough to play but to be short-handed and the burden and the toll it takes on these guys and knowing that you're going to have guys coming back who haven’t been able to practice or play basketball. So it is definitely tricky to navigate.” \n\n\r\n              IN THE DIVISION\n\n\r\n              Brooklyn improved to 6-0 in games against the Atlantic Division. Philadelphia is 0-6.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host New Orleans on Sunday night.\n\n\r\n              Nets: Host Orlando on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993518.547083
}