{
  "game_id": "401809991",
  "espn_id": "401809991",
  "date": "Oct 29, 2025",
  "matchup": "MIN vs LAL",
  "headline": "Lakers fend off Timberwolves on Austin Reaves' buzzer-beater for 116-115 win",
  "body": "MINNEAPOLIS -- — Austin Reaves swished the 12-foot winner in the lane right before the buzzer to finish with 28 points and lift the Los Angeles Lakers to a 116-115 victory on Wednesday after the Minnesota Timberwolves had taken the lead with a late 14-2 run.\n\n\r\n              Reaves matched his career high with 16 assists, Jake LaRavia had 27 points on 10-for-11 shooting, and DeAndre Ayton added 17 points and 10 rebounds for the Lakers, who built a 20-point late in the third quarter and were up 112-101 after a 3-pointer by Reaves with 4:01 left.\n\n\r\n              Julius Randle, who led the Wolves with 33 points, capped the furious rally by dropping in the go-ahead finger roll with 10.2 seconds left. Jaden McDaniels added 30 points and seven rebounds for the Wolves.\n\n\r\n              The star power of this game was considerably diminished with Luka Doncic and LeBron James sidelined for the Lakers and Anthony Edwards out for the Wolves. Reaves, who had a career-high 51 points in a win over Sacramento on Sunday and 41 points in defeat by Portland on Monday, has had something to say with his play about that.\n\n\r\n              Edwards plopped himself in the middle of the bench and chatted up just about anybody within earshot including some back-and-forth trash talk with LaRavia after a couple of his corner 3s.\n\n\r\n              The Lakers were hardly themselves, missing four of their five primary ballhandlers with Doncic, James, Marcus Smart and Gabe Vincent all injured. Backup center Jaxon Hayes returned from a knee injury that kept him out the last two games. \n\n\r\n              Reaves sure took care of that, flying all over the court to craftily work the pick-and-roll with Ayton or finding LaRavia or Dalton Knecht (15 points) when the defense converged on him.\n\n\r\n              Up next\r\n              The Lakers play at Memphis on Friday. The Timberwolves play at Charlotte on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042527.4372742
}