{
  "game_id": "0022200259",
  "espn_id": "401468414",
  "date": "Nov 22, 2022",
  "matchup": "LAL @ PHX",
  "headline": "Suns hold on to win 115-105, Lakers' Beverley ejected",
  "body": "PHOENIX -- — Mikal Bridges and Devin Booker each scored 25 points to lead the Phoenix Suns to a 115-105 win over the Los Angeles Lakers on Tuesday night.\n\n\r\n              The Suns, playing without point guard Chris Paul for the seventh straight game, have beaten the Lakers five straight times in regular season play — eight counting the last three games of their 2020-21 playoff series. Anthony Davis had 37 points, 21 rebounds and five blocked shots for the Lakers, playing without LeBron James (left adductor strain) for the fifth straight game. They had won their previous three games without him.\n\n\r\n              Things got chippy in the fourth quarter. With 3:55 left in the game, the Lakers’ Patrick Beverley was ejected for shoving Phoenix’s Deandre Ayton following a foul called on Booker against Austin Reaves that was assessed a flagrant-1 after review. Booker later fouled out.\n\n\r\n              “It’s just happening too many times,\" Suns coach Monty Williams said of the incident. \"I think the league needs to take a look at those kinds of plays, it’s just unnecessary.”\n\n\r\n              After cooler heads prevailed, Williams said his team stayed composed.\n\n\r\n              “It was like, ‘Guys, let’s just win the game.’ Our guys got it back together,” he said. \"We got a few stops and that allowed to get out in transition a little bit.”\n\n\r\n              Booker said, “I would have a lot more respect if he just pushed him in the chest when the guy was facing him.”\n\n\r\n              Lakers coach Darvin Ham defended Beverley's action.\n\n\r\n              “From what I saw Ayton was standing there ready to walk over (Reaves),” Ham said. “I am not mad at (Beverley). He is there protecting his teammate and I am sure he will have to go through some type of consequence for that but that is who we have to be. Teams have to know they just can't push us around.”\n\n\r\n              Davis was 15 of 16 from the free-throw line, where Los Angeles held a big advantage (29-3) in points. But Phoenix hit 16 3-point attempts, five by Bridges. The Lakers were just 4 of 22 from behind the arc.\n\n\r\n              Davis was down after a collision with Booker in the second quarter, but eventually got up during a timeout and shot free throws.\n\n\r\n              “I guess I hit my funny bone and just lost feeling in my arm,” Davis said. “It is still a little numb right now.”\n\n\r\n              Lonnie Walker IV scored 24 points and Russell Westbrook came off the bench to score 21 for the Lakers (5=11). Reaves scored 11 and Beverley had 10 rebounds — but no points in 29 minutes.\n\n\r\n              Ayton had 14 points and 15 rebounds for Phoenix (11-6), which won consecutive games for the first time since a five-game winning streak ended Nov. 4. Reserve Duane Washington Jr. scored 15 for the Suns.\n\n\r\n              DAVIS STEPS UP\n\n\r\n              Davis has scored 30 points or more in the last four games, including a 38-point, 16-rebound night against Detroit on Friday. Davis entered Tuesday second to Minnesota’s Rudy Gobert in rebounding.\n\n\r\n              Williams coached Davis when both were in New Orleans.\n\n\r\n              “The last three games tell the tale,” the Suns coach said before the game. “This is the player that he’s always been. I know how talented he is.”\n\n\r\n              TRAINER’S ROOM\n\n\r\n              Lakers: Ham isn’t sure when James will play again but didn't rule out a return this weekend. \n\n\r\n              Suns: Besides Paul, G Landry Shamet (concussion protocol) missed his sixth. Shamet practiced Tuesday but Williams said only that he’s making progress. Cam Johnson has been out (right meniscus tear) since Nov. 4; the Suns are 5-4 without Johnson.\n\n\r\n              NEXT\n\n\r\n              Lakers: At San Antonio Friday.\n\n\r\n              Suns: Host Detroit Friday.",
  "source": "espn_api",
  "crawled_at": 1764995057.330861
}