{
  "game_id": "0021301162",
  "espn_id": "400490035",
  "date": "Apr 09, 2014",
  "matchup": "DET @ CLE",
  "headline": "Cavaliers eliminated from playoff contention despite rout of Pistons",
  "body": "CLEVELAND -- Their playoff chase, which somehow lasted longer than it probably should have, is officially over.\nThe Cavaliers came up short.\nOn a night when they finally put it all together, their hopes crumbled.\nDion Waiters scored 22 points and the Cavs played one of their best games this season, routing the Detroit Pistons 122-100 on Wednesday before being eliminated from the playoff race.\nTyler Zeller scored 18 and rookie Matthew Dellavedova had 14 points and 12 assists for Cleveland, which had its slim playoff hopes ended when Atlanta defeated Boston 105-97.\n\"It's an empty feeling now that your chances are done,\" said All-Star point guard Kyrie Irving, who has missed the postseason in each of his three years in the NBA. \"You think about things you could have done, you should have done. It's inevitable, especially as big a competitor as I am. It's definitely going to be on my mind.\n\"You always want to compete for something as special as the playoffs, but our chances were snapped tonight. It's disappointing.\"\nAs the Hawks were rallying to take down the Celtics, the Cavs played with passion and purpose -- two things missing too often earlier this season. Spencer Hawes added 15 points for the Cavs, who led by 32 at half and rolled to one of their best all-around performances in what has been an otherwise disappointing season.\nCleveland set a team record with 26 assists in the first half and finished with a season-high 41.\nBut the Cavs will watch the playoffs and spend the months ahead thinking about games they let slip away, losses that came back to haunt them.\n\"We put ourselves in this hole,\" said coach Mike Brown, who returned for a second stint with the club after being fired in 2010. \"I wish we could have a couple of those games back from early on. I can't fault anybody but ourselves.\"\nBrandon Jennings scored 17 after missing his first 10 shots for the Pistons, who played their second game in a row without forward Josh Smith, sidelined with knee tendinitis. Jonas Jerebko added 17 points for Detroit, which was coming off a surprising win in Atlanta.\n\"They outplayed us and outworked us,\" Pistons interim coach John Loyer said of the Cavs. \"We were embarrassed in the first half. This is an unforgiving league, and they didn't care that we beat Atlanta last night.\"\nCleveland's unexpected blowout win capped a turbulent few days. Earlier this week, Irving got into a public spat with Browns wide receiver Josh Gordon, an embarrassing squabble between two of the city's biggest sports stars. Irving had told Gordon \"to mind his own business\" about commenting on his supposed rift with Waiters.\nFollowing practice Monday, Irving and Waiters presented a united front and said they worked through any differences and were focused only on winning.\nMaybe the backcourt mates patching up their differences rubbed off on the rest of the Cavs, as Brown spent most of the game sitting as opposed to standing and yelling.\nThe Cavs had 14 assists on 14 field goals in the first quarter, which ended with them up 31-18. They were nearly as efficient in the second quarter, outscoring the Pistons 38-19 on the way to a 69-37 halftime lead.\n\"This is the way we want to play most of the time,\" said Brown, who tied Bill Fitch for the second-most wins in franchise history. \"It felt pretty good.\"\nFollowing the game, Atlanta's game was on the locker room TV as Irving waited to speak with reporters. The season didn't go as planned, but there's nothing more he can do.\n\"As a man and as a competitor, you've got to suck it up,\" he said. \"This is my third year. Obviously, things didn't go in a perfect way. But there's no perfect season. For me, it's just about continuing to grow and finish the season strong.\"\nGame notes\nBrown and Fitch have 304 wins, 12 behind Hall of Famer Lenny Wilkens. ... Irving is \"proud\" of friend and former high school teammate Derrick Gordon for coming out as the first openly gay player in Division I. \"He's a strong person. I think the way he did it is a true test of his character and it's big time,\" Irving said. \"I'm happy for him.\" Irving said he would not have any issue with a gay teammate. \"To see guys in sports coming out now is part of life,\" he said. \"I'm not a judgmental guy, not one bit. But I'm proud of Derrick and I'm proud of Jason Collins. It's a big step for everybody and every generation.\" ... Detroit has come to Cleveland with a different coach in each of its past three visits: Lawrence Frank last year, Maurice Cheeks earlier this season and now Loyer.",
  "source": "espn_api",
  "crawled_at": 1764993270.1518688
}