{
  "game_id": "0021900712",
  "espn_id": "401161354",
  "date": "Jan 29, 2020",
  "matchup": "HOU @ POR",
  "headline": "Lillard has triple-double and Blazers beat Rockets 125-112",
  "body": "PORTLAND, Ore. --  Damian Lillard laughed when asked about his first career triple-double.\n\n“It's about time,” he said.\n\nLillard had 36 points, 11 assists and 10 rebounds, and the Portland Trail Blazers spoiled James Harden's return after a two-game absence, beating the Houston Rockets 125-112 on Wednesday night.\n\nLillard scored 30-plus points for his sixth straight game, a franchise record.\n\n\"It took eight years,\" he said about his triple-double. “I think there's been plenty of times where I could have just hunted it -- I've been two rebounds or one assist away -- but it's just something I never wanted to go out there and just chase.”\n\nCJ McCollum had 22 points and Trevor Ariza, playing in just his third game as a Blazer after a trade with Sacramento, matched his season high with 21. Portland led by as many as 20 points in the second half.\n\nThe crowd roared at the Moda Center and gave Lillard a standing ovation when he got his final rebound on an offensive tip with under a minute left.\n\nRussell Westbrook led the Rockets with 39 points, extending his streak of games with 20-plus points to 21, and 10 rebounds. Harden, who was leading the league with 36.1 points a game this season, had 18.\n\n“Because they've got one of the best offensive players, that just broke us down,\" Rockets coach Mike D'Antoni said. ”You try to double, you try not to double, and he's shooting from almost half court.\"\n\nHarden was questionable for the game but started after missing two games with a thigh contusion. Clint Capela missed Monday's game against the Utah Jazz because of a right heel contusion, as did Westbrook, who was rested. With three starters missing, Eric Gordon took over and scored 50 points in the 126-117 win in Utah.\n\nEarlier this month, the Rockets fell at home to the Blazers 117-107. Lillard had 25 points in the victory.\n\nPerhaps no other player in the league has been as hot as Lillard recently. He was the reigning Western Conference Player of Week after averaging 52.7 points and 9.3 assists last week. He set a franchise record for points when he scored 61 against Golden State.\n\n“I didn't even know. I was wondering why he jumped that high for that rebound,” McCollum laughed. “He looked good. He's been locked in. This is the best basketball he's played in his career.”\n\nDanuel House Jr., had a 3-pointer that gave the Rockets an early 16-8 lead, but Portland's 8-0 run, capped by Lillard's layup and free throw, closed the gap.\n\nAlready beset by injuries this season, Portland got a scare in the opening quarter when center Hassan Whiteside was kneed and went to the locker room. He returned to the game.\n\nWestbrook's pull-up jumper and driving layup gave Houston a 46-38 lead. Portland used a 12-2 run, capped by a dunk by Ariza, to take a 61-50 lead.\n\nPortland closed the half with dunks by Ariza and Whiteside to take a 71-60 lead into the break. Lillard led all scorers with 25 points, while Westbrook had 19.\n\nMcCollum's wide open 3-pointer midway through the third quarter gave the Trail Blazers an 83-67 advantage. Lillard's 3-pointer from just inside the pinwheel logo at midcourt made the lead 97-80.\n\n“I’m happy for him. He’s been playing great, I’m glad they gave him that last tip as a rebound,\" Blazers coach Terry Stotts said about Lillard's night. \"To be honest, I’m surprised he hasn’t had one before now. He plays an all-around game, but to get your first triple double, on national TV against a really good team, it’s pretty cool.”\n\nTIP INS\n\nRockets: Houston's coaching staff wore Kobe Bryant Nikes for the game. It was the last of four road games in six nights for the Rockets. ... Harden and Westbrook were averaging 20-plus points this season, a first for the Rockets since Yao Ming and Tracy McGrady in the 2007-08 season. ... It was just the fifth time this season Harden had fewer than 20 points.\n\nTrail Blazers: Stotts and the Blazers' staff also wore Kobe Bryant Nikes for the game. ... Carmelo Anthony moved into 17th place on the NBA's scoring list, passing Kevin Garnett. ... Whiteside finished with 15 points, 10 rebounds and five blocks.\n\nDAD'S ADVICE\n\nLillard said he's never chased triple-doubles because of his father.\n\n“Just growing up, my dad would just always be on my case about playing the game the right way and letting it play out the way it's supposed to play out. So that's kind of been my approach to triple-doubles. Tonight, I was close but a lot of times I was like, alright, I can't walk off the court stuck at nine with all this time and everyone was like, `Get one rebound, get one rebound.'”\n\nUP NEXT\n\nRockets: Host the Dallas Mavericks on Friday.\n\nTrail Blazers: Visit Los Angeles on Friday for the Lakers' first game since the death of Kobe Bryant.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996627.060652
}