{
  "game_id": "0022300414",
  "espn_id": "401585042",
  "date": "Dec 26, 2023",
  "matchup": "CHA @ LAC",
  "headline": "Clippers end skid without Leonard, rally to beat Hornets 113-104",
  "body": "LOS ANGELES -- — James Harden scored 20 of his 29 points in the first half and the Los Angeles Clippers rallied for a 113-104 victory over the Charlotte Hornets on Tuesday night to end a two-game losing streak.\n\n\r\n              Paul George scored 25 points and Ivica Zubac added 18 points with 14 rebounds as the Clippers won for the first time in three games since Kawhi Leonard was sidelined with a left hip contusion. Los Angeles’ two-game skid had followed a nine-game winning streak.\n\n\r\n              The Clippers won three days after they absorbed a 37-point defeat at home against the Boston Celtics.\n\n\r\n              “I knew it was going to be a tough game but it was a good bounce-back win for us,” Clippers head coach Tyronn Lue said. “Defensively we were pretty good.”\n\n\r\n              Russell Westbrook helped fill the Leonard void with 14 points, 11 rebounds and six assists off the bench in 28 energetic minutes.\n\n\r\n              “Obviously (Leonard) is a big piece but we have structure within our defense and offense that we can plug guys in and they are required and expected to do what Kawhi does,” George said. “It's a collective for us to take on the load without Kawhi being in there, but within our team there (is the) structure.”\n\n\r\n              Miles Bridges scored 21 points with 11 rebounds, while Terry Rozier and P.J. Washington added 18 each for the Hornets, who lost their eighth game in a row. Charlotte is 1-10 in December, all without LaMelo Ball (ankle), who has not played since Nov. 26.\n\n\r\n              Nick Richards added 13 points and 10 rebounds for Charlotte. Rozier missed Saturday’s game against the Denver Nuggets with right knee soreness, while Brandon Miller (ankle) did not play Tuesday.\n\n\r\n              “We had a lot of mistakes toward the end of the fourth quarter which led to our loss, obviously, but for the most part, we played a great game,” Washington said. “We played a great third quarter. Obviously we have a lot to work on, but we did a better job than before.”\n\n\r\n              The Clippers led by as many as 10 points in the first half before the Hornets pulled within 55-50 at the break. Again, Los Angeles led by 10 points in the third quarter at 75-65 on a 3-pointer by George.\n\n\r\n              Charlotte stole the momentum by going on a 26-9 run to lead 91-84 with 9:29 remaining. The Hornets’ comeback included an 11-2 run to open the fourth quarter.\n\n\r\n              The Clippers showed a sense of urgency by hitting three 3-pointers during a 19-2 run to take a 103-93 lead with 3:58 remaining. Zubac scored six points in the run, including the last four.\n\n\r\n              A 3-pointer by George with 1:26 remaining gave the Clippers a 111-100 lead.\n\n\r\n              George made 5 of his 11 attempts from 3-point range, while Harden made 6 of 12. The Clippers went 14 of 34 (41.2%) from distance as a team.\n\n\r\n              “We're next man up, keep the ship going,” George said. “When (Leonard) comes back, he'll be healthy and we continue to rock. Regardless of who's in, who's out, our job is to continue to keep going.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Los Angeles Lakers on Thursday.\n\n\r\n              Clippers: Home vs. Memphis Grizzlies on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995980.341527
}