{
  "game_id": "0021500045",
  "espn_id": "400827932",
  "date": "Nov 01, 2015",
  "matchup": "LAL vs. DAL",
  "headline": "Mavs beat winless Lakers 103-93 behind Nowitzki's 25 points",
  "body": "LOS ANGELES --  Rick Carlisle is the only coach to guide the Dallas Mavericks to an NBA title, and now he's their career wins leader, too.\n\nDirk Nowitzki scored 25 points and the Mavericks held off a late rally by the winless Los Angeles Lakers for a 103-93 victory on Sunday night. It was Carlisle's 340th as their coach, breaking Don Nelson's franchise record in 29 fewer games. Nelson is the NBA leader with 1,335 victories, 282 more than Carlisle.\n\n\"Nellie is one of the all-time greats. He's a great friend, and in his honor tonight, I'm going to crack open a beer and drink one to him,\" Carlisle said. \"All the love and respect to Nellie for what he stood for in this game and how he's mentored so many of us younger guys along the way.\n\nDallas never trailed in their eighth straight victory over the Lakers and fourth in a row against them at Staples Center.\n\nThis is the first time in franchise history the Lakers have started 0-3 in consecutive seasons. They lost their first five games last season and ended with their worst record ever (21-61).\n\nThe Mavericks opened the game with a 15-0 blitz that included two 3-pointers each by Wesley Matthews and Nowitzki -- the latter has made more 3-point shots than any 7-footer in league history (1,580). The Lakers missed their first five shots before Julius Randle's dunk with 7:13 left in the first quarter.\n\nRandle posted his second consecutive double-double with 22 points and 15 rebounds. The 20-year-old broke his right leg 14 minutes into his NBA debut on opening night last year and missed the rest of the season after the Lakers picked him seventh overall in the 2014 draft.\n\nKobe Bryant had 15 points on 3-of-15 shooting. He missed his first seven shots before hitting a layup with 10:11 left in the third quarter to trim Dallas' lead to 56-49 after Dallas led by 16 points. The NBA's third all-time leading scorer is three games into his 20th season with the Lakers.\n\n\"I just can't make a shot,\" said Bryant, who is 16 for 51 from the field overall. \"I'm getting the shots I want. I'm just not making them.\n\n\"D'Angelo's putting me in the right spots and stuff like that. I've got to capitalize for him, that's all If I could make a damn shot, that would help. I suck right now.\"\n\nLou Williams had 13 points off the bench and cut Dallas' lead to six on a pair of free throws with 12:27 left, but Raymond Felton and J.J. Barea hit consecutive jumpers 34 seconds apart in the final 2:06 to ice it.\n\nTIP-INS\n\nMavericks: Point guard Deron Williams needs one more 3-point basket for 1,000 in the regular season. ... Nowitzki and Barea are the only players left on the roster from Dallas' 2010-11 NBA championship squad. ... The Mavericks tied a regular-season club record with 18 3-pointers against the Lakers last Nov. 21. They were 11 for 30 from behind the arc this time.\n\nLakers: L.A. gave up 40 points in the paint after surrendering a whopping 80 in its 132-114 loss at Sacramento on Friday night. ... F Brandon Bass suffered a corneal abrasion in his left eye. Bass had 10 points and five rebounds on the 10th anniversary of his NBA debut with the New Orleans Hornets -- then led by current Lakers coach Byron Scott. ... Larry Nance Jr., one of four rookies on the Lakers' roster, has yet to make his NBA debut. He was on the inactive list for the game after a brief bout with tendinitis in his right knee. ... Reserve C Tarik Black grabbed a career-high 19 rebounds against the Mavericks last April 4 at Staples Center, but spent all of this game on the bench.\n\nSLOW START\n\nThe only Lakers starter who had a field goal through the first 23 minutes was Randle, who was 5 for 9 to that point. Bryant, Jordan Clarkson and No. 1 draft pick D'Angelo Russell began a collective 0 for 14 until Clarkson hit a 3-pointer from the top of the key with exactly a minute left in the half.\n\nMILESTONE TREY\n\nBryant picked up his fifth foul with 5:09 to play, but sliced the Lakers' deficit to 96-89 about 1 1-2 minutes later with his 1,700th career 3-pointer.\n\nUP NEXT\n\nMavericks: Host Toronto on Wednesday night in their home opener.\n\nLakers: Host Denver on Tuesday night, the 19th anniversary of Bryant's NBA debut.",
  "source": "espn_api",
  "crawled_at": 1764994328.732779
}