{
  "game_id": "0021800148",
  "espn_id": "401070829",
  "date": "Nov 05, 2018",
  "matchup": "MIN @ LAC",
  "headline": "Clippers beat Wolves 120-109, drop Minnesota to 0-6 on road",
  "body": "LOS ANGELES --  Tobias Harris scored 22 points, Lou Williams added 20 and the Los Angeles Clippers defeated Minnesota 120-109 Monday night, dropping the Timberwolves to 0-6 on the road this season.\n\nLed by Jimmy Butler and Derrick Rose, the Wolves rallied in the fourth quarter when the duo combined to score 22 of the team's 25 points. Rose finished with 21 points and Butler had 16 of his 20 in the final period.\n\nKarl-Anthony Towns added 20 points and 12 rebounds for the Wolves.\n\nAfter resting Sunday in Portland, Butler scored Minnesota's first nine points of the fourth, twice getting the Timberwolves within one. The Clippers answered both times, with Williams hitting a basket and Montrezl Harrell scoring consecutive buckets for a 98-93 lead.\n\nDanilo Gallinari added 22 points for the Clippers, making all six of his free throws. Williams hit all five of his foul shots.\n\nThings got chippy twice in the fourth. Milos Teodosic was closely guarding Rose as he brought the ball up court and got called for a foul. Harrell ran up and started jawing at Rose.\n\nA few minutes later, Taj Gibson tripped over a sprawled Patrick Beverley on a rebound and Harrell knocked down Rose on a drive and got called for a foul on the other end. Security briefly came on the floor, and the play away from the ball was reviewed. Gibson received a technical foul.\n\nThe Clippers built an 11-point lead early in the third when Beverley came off the bench to hit a 3-pointer and make another basket.\n\nHelped by four straight points from Rose and a 3 by Andrew Wiggins, the Wolves trailed 92-84 heading into the fourth.\n\nThe teams played a tight first half, when they both shot 51 percent from the floor and neither led by more than six points.\n\nTIP-INS\n\nTimberwolves: Fell to 0-3 on their West Coast trip with two games remaining. ... All five starters finished in double figures. ... Rose started after sitting out Sunday with a sore left ankle.\n\nClippers: Snapped a six-game skid against the Timberwolves, ending their longest active losing streak against one opponent.\n\nUP NEXT\n\nTimberwolves: They get a day off in town before playing the Lakers on Wednesday.\n\nClippers: Visit Portland on Thursday in a quick one-game trip.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994074.6779609
}