{
  "game_id": "0022400697",
  "espn_id": "401705263",
  "date": "Feb 02, 2025",
  "matchup": "TOR vs. LAC",
  "headline": "RJ Barrett scores 20 points as Raptors beat Clippers 115-108 for 8th win in 10 games",
  "body": "TORONTO -- — RJ Barrett scored 20 points, Jakob Poeltl had 10 points and 10 rebounds and the Toronto Raptors beat the Los Angeles Clippers 115-108 on Sunday for their eighth win in the past 10 games.\n\n\r\n              Gradey Dick scored 18 points and Scottie Barnes had 15 as the Raptors snapped a five-game losing streak against the Clippers.\n\n\r\n              Ochai Agbaji had 12 points, Immanuel Quickley scored 11 and Ja’Kobe Walter scored 10 as seven Toronto players reached double digits.\n\n\r\n              James Harden had 25 points and Ivica Zubac scored 18 for the Clippers, who lost for the first time in three games.\n\n\r\n              Kevin Porter Jr. had 17 points for Los Angeles while Kawhi Leonard scored 14.\n\n\r\n              Harden shot 7 for 20 and made 2 of 9 from 3-point range. He went 9 for 9 at the free-throw line.\n\n\r\n              Before tipoff, some fans booed during the playing of the American national anthem. Similar reactions broke out Saturday night at NHL games in Canada.\n\n\r\n              Takeaways\r\n              Clippers: Harden shot 1 for 7 in the third and missed all four of his 3-point attempts. The Clippers combined to shoot 7 for 25 in the quarter, going 2 for 10 from long range.\n\n\r\n              Raptors: Toronto won for the second time in 11 games this season with Quickley in the lineup. The guard returned Friday after missing eight games because of an injured left hip.\n\n\r\n              Key moment\r\n              Poeltl’s dunk with 6:48 remaining in the third kicked off a 12-2 spurt for the Raptors, leading to a Clippers timeout. Toronto closed the quarter by outscoring Los Angeles 24-10, taking a 92-77 edge to the fourth.\n\n\r\n              Key stat\r\n              The Raptors shot 8 for 9 on fast-break opportunities in the third, outscoring the Clippers 17-2.\n\n\r\n              Up next\r\n              Both teams play Tuesday night, when the Raptors host the New York Knicks and the Clippers host the Los Angeles Lakers. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996955.034335
}