{
  "game_id": "0021900354",
  "espn_id": "401160996",
  "date": "Dec 10, 2019",
  "matchup": "MIA vs. ATL",
  "headline": "Jimmy Butler, Heat rally in OT after Trae Young says 'it's over'",
  "body": "MIAMI -- Trae Young figured the game was over.\nTurns out, Jimmy Butler and the Miami Heat were just getting started -- on one of the wildest stat nights in team history.\nDuncan Robinson tied a franchise record with 10 3-pointers, Butler and Bam Adebayo each had triple-doubles, and the Heat went on a late flurry to beat the Atlanta Hawks 135-121 in overtime Tuesday.\nThe Heat were down by six with 59 seconds left in regulation when Young took a celebratory walk to the Atlanta bench for a timeout, with Butler hearing him shout, \"It's over!\"\nMiami scored the next 22 points -- the final six of regulation and the first 16 of overtime -- to improve to 18-6 overall and 11-0 at home.\n\"I don't think anybody really thought the Heat were relevant,\" Adebayo said. \"We're making people watch us.\"\nKendrick Nunn scored a career-high 36 points, one off the Heat rookie single-game record. Robinson scored 34, a career high. Adebayo finished with a career-high 30 points, 11 rebounds and 11 assists. Butler had 20 points, a career-high 18 rebounds and 10 assists.\nAfterward, Butler couldn't resist a jab at Young on Instagram, writing: \"this man @traeyoung is a teller of the future. he was right. game WAS over!\" \nYoung also took to social media and acknowledged his mistake in a short tweet.\nButler praised his teammates, telling reporters, \"Everybody in this locker room has a confidence that they're the best player on the floor at any given time. Man, when you've got guys who think like that, nothing's ever over.\"\nIt was the NBA's widest margin of victory in an overtime game since Oct. 31, 2009, when Philadelphia beat New York 141-127.\nDe'Andre Hunter scored 28 points and Young added 21 points and nine assists for Atlanta, which fell to 0-3 against the Heat this season.\n\"What's tough is Robinson goes 10-for-14, a career high, two guys with triple-doubles, they played out of their minds a little bit with a couple guys, and we still had a six-point lead with under a minute to go,\" Hawks coach Lloyd Pierce said. \"I feel bad.\"\nVince Carter, in the 1,500th regular-season game of his career, scored 12 for the Hawks. Jabari Parker had 16 points and Cam Reddish added 14 for Atlanta.\nThe Hawks used a 13-0 run to take an eight-point lead early in the fourth before the Heat clawed back and tied the score 111-111 on a 3-pointer by Robinson with 3:11 left.\nAtlanta scored the next four to reclaim the lead, Butler missed a pair of free throws with 1:18 left, and Alex Len had a dunk on the next Hawks possession for a 117-111 lead.\nThe rest was all Heat.\n\"Our energy was dead as soon as overtime started,\" Young said.\nIn other words, it was over.\nTIP-INS\nHawks: Atlanta made 13 3-pointers in the first half, tying a team record set on three other occasions. The Hawks had only nine 2-pointers before intermission. ... Hunter returned to the starting lineup and Reddish played off the bench. ... Kevin Huerter (shoulder) remains on a minutes restriction of about 25 per night, though that isn't expected to last much longer. He played 26 in regulation, then didn't play in overtime.\nHeat: Miami again played without four of its six highest-paid players. Goran Dragic (groin strain), Justise Winslow (back strain), James Johnson (illness) and Dion Waiters (illness) were out. Dragic is working toward a return. Winslow has missed 14 of Miami's 24 games, Johnson has made only six appearances, and Waiters has yet to play.\nFAREWELL, VINCE\nBarring a playoff meeting or trade, this was Carter's final game in Miami. He appeared in Miami as an opponent 36 times including playoffs, tying Allan Houston for third most all time behind Paul Pierce's 42 and Patrick Ewing's 37. Carter's 714 points are fourth most of any opponent in Miami, behind Pierce's 867, Ewing's 754 and Michael Jordan's 722.\nSTAR WARS NIGHT\nThe Heat threw a Star Wars-themed celebration, replete with lightsabers on the court during the pregame delivery of the game ball, Darth Vader patrolling the arena and radio analyst Ruth Riley Hunter with her hair done like Princess Leia. Heat coach Erik Spoelstra is a fan of the sci-fi saga. \"Every summer, the whole family gets together in Hawaii, and we end up watching Star Wars,\" Spoelstra said.\nUP NEXT\nHawks: Visit Chicago on Wednesday.\nHeat: Host the Los Angeles Lakers on Friday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764995535.432535
}