{
  "game_id": "0021600988",
  "espn_id": "400900383",
  "date": "Mar 12, 2017",
  "matchup": "PHX vs. POR",
  "headline": "Lillard, McCollum lead Trail Blazers past Suns, 110-101",
  "body": "PHOENIX --  The Portland Trail Blazers are fighting to stay in the Western Conference playoff race, and they needed a win Sunday night after an overtime loss at the buzzer at home the night before.\n\nDamian Lillard helped deliver it.\n\nLillard scored 28 of his 39 points in the first half and the Blazers recovered to beat the Phoenix Suns 110-101 after blowing an 18-point second-half lead.\n\n\"Just being aggressive and the hungrier team. We really needed to come out that way especially after last night,\" Lillard said. \"We needed to throw ourselves into the game. That was kind of my focus.\"\n\nBoth teams were playing the second game of back-to-back nights, Phoenix having won a thriller at Dallas on Saturday.\n\nLillard scored just four points in the fourth quarter, but fellow guard C.J. McCollum added 26. The Trail Blazers pulled within 1 1/2 games of Denver for the eighth and final playoff spot in the Western Conference.\n\nDevin Booker led the Suns with 28 points, and Eric Bledsoe added 19.\n\nMcCollum's running hook shot put the Trail Blazers up 106-99 with 1:33 to play, and Lillard made a 21-foot pull-up jumper with 1:01 to go, giving Portland a nine-point lead and putting the game out of reach.\n\n\"I thought he pretty much willed us to the win,\" Portland coach Terry Stotts said. \"You could just tell by how he played, his demeanor. The way he fought through some of the adversity. I thought he really shouldered a lot of the responsibility.\"\n\nTyler Ulis' jumper gave Phoenix a 93-92 lead with 6:37 left, the Suns' first lead since the first quarter. They took one more one-point lead but couldn't maintain it.\n\n\"We weren't as aggressive as we usually are,\" said Ulis, who scored 10 points off the bench. \"They made some big shots, some tough shots late ... if you don't get stops you can't win the game.\"\n\nThe Suns trailed by 18 points, 68-50, early in the third quarter with the Blazers coming off a torrid first half of shooting. Phoenix rallied to tie it as Portland cooled off, with Bledsoe's 3 tying it at 77 with 2:55 to play.\n\nThe Suns outscored the Blazers 29-16 in the quarter and trailed 82-79 going into the fourth. Portland made just 6 of 23 shots in the quarter.\n\nLillard scored 15 points in the first quarter, leading the Blazers during a 15-0 run that saw them go from a 16-12 deficit to a 27-16 lead. Portland led 33-18 after one quarter.\n\nThe Suns trimmed Portland's lead to six in the second quarter, but the Blazers finished the first half strong, with Lillard's steal and layup giving his team a 66-50 lead with 23.8 seconds left.\n\nLillard made 9 of 14 first-half shots, including three 3-pointers. He made all seven of his free throws.\n\nThe Blazers' 63.4 field goal percentage was better than their free throw percentage at the half, 58.8.\n\n\"Can't say anything about the back-to-back,\" Suns coach Earl Watson said. \"We got in before they got in, so it's all a mindset.\"\n\nTIP-INS\n\nTrail Blazers: G Evan Turner is close to returning after being out 12 games with a broken right hand. ... F Ed Davis remains out with a left shoulder injury.\n\nSuns: C Tyson Chandler is away from the team for unspecified personal reasons, and hasn't played since before the All-Star break. ... C Alex Len didn't play due to a bruised right hip, his second straight game missed.\n\nGOING WITH THE KIDS\n\nThe Suns, for the second straight night, started the youngest lineup in franchise history. Bledsoe was the eldest at 27, with Marquese Chriss the youngest at 19. The average age of the starting five was 22 years, 64 days old, including 20-year-old Derrick Jones Jr., who made his second career NBA start.\n\nBIG MAN WITH HANDLES\n\nBlazers center Jusuf Nurkic turned in the play of the night when, in the first quarter, the 7-footer blocked a shot at one end, collected the loose ball and dribbled the length of the court for a dunk. Nurkic finished with 12 points and 11 rebounds, his fourth double-double in 10 games with the Blazers since being traded from Denver.\n\nBASEBALL AND 3s\n\nA pair of Arizona Diamondbacks baseball players took part in a 3-point competition between the first and second quarters, with infielder Chris Owings knocking down six 3s to five for pitcher Patrick Corbin, though Corbin did throw down a dunk.\n\nUP NEXT\n\nBlazers: At New Orleans on Tuesday night for the second game of a five-game trip.\n\nSuns: Host Sacramento on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995952.688502
}