{
  "game_id": "0022000486",
  "espn_id": "401267646",
  "date": "Feb 23, 2021",
  "matchup": "MIL vs. MIN",
  "headline": "Bucks win 139-112 in new Timberwolves coach Finch's debut",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo and the Milwaukee Bucks demonstrated the magnitude of the challenge facing new Minnesota Timberwolves coach Chris Finch.\n\n\r\n                    Antetokoumpo had 37 points, eight rebounds and eight assists as the Bucks won 139-112 on Tuesday to spoil Finch’s debut. The Timberwolves lost their fifth straight and ninth in their last 10 games as their record fell to an NBA-worst 7-25.\n\n\r\n                    “Every game’s a game to learn from,” Finch said. \"We’ve just got to try to up our physicality on defense. I think that’s what I’d like to see going into the next game.”\n\n\r\n                    Finch was working as an assistant coach with the Toronto Raptors before the Timberwolves hired him to replace Ryan Saunders,  who was fired Sunday night after a loss to the New York Knicks.\n\n\r\n                    His new team didn’t have nearly enough firepower to keep up with the Bucks, who shot 53.5% overall and went 20 of 42 from 3-point range.\n\n\r\n                    Antetokounmpo put up his huge numbers in just 29 minutes. The Bucks appeared intent on resting the reigning two-time MVP for the entire fourth quarter until putting him back in the game with 3:47 left after a 29-point lead had dropped to 16.\n\n\r\n                    Bryn Forbes added a season-high 23 points as the Bucks won their third straight and had seven players score in double figures.\n\n\r\n                    “I think the ball movement, the unselfishness stood out to me,” Bucks coach Mike Budenholzer said.\n\n\r\n                    Karl-Anthony Towns and Malik Beasley each scored 26 points for the Timberwolves. Towns also had eight rebounds and a career-high 11 assists.\n\n\r\n                    They helped Minnesota stay competitive early.\n\n\r\n                    The game went back and forth until Milwaukee went on a 21-3 run that began late in the second quarter and continued into the third period, turning a 62-59 edge into an 83-62 advantage.\n\n\r\n                    “Obviously we're starting at square one again,” Towns said. “I think that for us, having to learn a whole new coach, how he works and how can we complement his vision best and how can we make it come to life, it's an (adjustment). We have to continue to find ways to figure this out on the fly.”\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Minnesota recorded its highest first-quarter point total of the season, though it still trailed 38-36 at the end of the period. ... The Timberwolves were shooting over 60% with just over four minutes left in the first half but cooled off dramatically the rest of the way. Minnesota shot 34.7% (17 of 49) in the second half. \n\n\r\n                    Bucks: Budenholzer said Jrue Holiday has started working out on an individual basis, a sign the veteran guard might be approaching a return. Holiday missed a ninth consecutive game Tuesday to due to the NBA’s health and safety protocols. … Khris Middleton wasn’t included on the list of All-Star reserves announced Tuesday. Middleton had made the All-Star Game each of the last two seasons. “A little disappointing, not going to lie,” Middleton said. “But I definitely want to just say congrats to all the guys who did make it, especially the first-timers.”\n\n\r\n                    ANOTHER ADJUSTMENT\n\n\r\n                    Towns was the first Timberwolves player to publicly address the coaching change, saying on a Zoom call with reporters after Tuesday’s morning shootaround that the firing of Saunders was “a shocking thing.”\n\n\r\n                    Towns also stumped for assistant coach David Vanterpool, who is Black, in expressing his disappointment that he was passed over for the job. But the team’s franchise player doubled down on his commitment to the organization and said he’s eager to work with Finch in trying to help bring the Timberwolves out of the league basement.\n\n\r\n                    “One of my biggest weaknesses is loyalty,” Towns said, adding: “I want to build something great here.”\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: At Chicago on Wednesday in the third game of a four-game trip.\n\n\r\n                    Bucks: Host New Orleans on Thursday.  The Bucks lost to the Pelicans 131-126 in New Orleans on Jan. 29.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997395.153486
}