{
  "game_id": "0021500659",
  "espn_id": "400828546",
  "date": "Jan 23, 2016",
  "matchup": "CHI @ CLE",
  "headline": "Pau Gasol steers Bulls past Cavs to spoil Tyronn Lue's coaching debut",
  "body": "CLEVELAND -- They changed coaches. Everything else about the Cavaliers looked the same.\nAnd as if they don't have enough problems, new coach Tyronn Lue said they're out of shape.\nLue didn't make much of a difference in his coaching debut for Cleveland on Saturday night, when Pau Gasol scored 25 points to leading the Chicago Bulls to a 96-83 win over the Cavaliers.\nLue was promoted Friday, when David Blatt was shockingly fired despite taking the team to the NBA Finals last season and leading it to the best record in the Eastern Conference this season. Lue acknowledged being nervous about sliding into Blatt's seat, and while his team gave effort, the Cavaliers didn't win.\n\nIn fact, LeBron James, Kevin Love, Kyrie Irving and their teammates left the floor to a chorus of boos after shooting just 9-of-22 from the free throw line.\n\"I've been booed before, along with a lot of these guys,\" Lue said. \"Every time I go to Philly I get booed, so, you know, that's not a big deal. It's something I got to deal with.\"\nLue wants his team to play at a faster pace than it did under Blatt, but the Cavs aren't physically ready to up the tempo.\n\"I don't think we're in good enough shape,\" Lue said. \"Early, we wanted to push it, we wanted to open the floor, and we came out and did that, and then we just dropped off the map. We got tired. I just don't think we're in good enough shape right now to play in the style that we want to play.\"\nJames just missed his first triple-double this season, finishing with 26 points, 13 rebounds and nine assists. J.R. Smith added 18 points for the Cavs, who shot 37 percent from the field.\n\"It's a make-or-miss league, and tonight we couldn't make any shots,\" James said.\nJimmy Butler scored 20 points, Nikola Mirotic added 17 and Taj Gibson 15 for Chicago, which opened a 17-point lead in the third quarter and never let the Cavs get closer than eight in the fourth.\n\"This was a big game,\" Bulls coach Fred Hoiberg said. \"It's a great sign when you come into a place like this that was buzzing. We went out, and we were aggressive. We got that lead at the end of the first quarter and never looked back.\"\nBothered by a lack of cohesion and chemistry in the Cavs, general manager David Griffin fired Blatt, a surprising move that came just days after Cleveland suffered a humiliating 34-point home loss to the defending champion Golden State Warriors. But Griffin detected deeper issues and felt he had no choice but to remove Blatt and promote Lue, a top assistant and former point guard who won two NBA titles as a player.\nLue has got work to do, but he was mostly pleased with his team's effort.\n\"I thought our guys competed,\" he said. \"I thought they went out and played hard and we just couldn't make shots. I guess I consider this a big game, and in a big game, we haven't been able to make shots. Defensively, it was great, and just, offensively, we just didn't make shots. We didn't make free throws.\"\nPREGAME INTRODUCTIONS\nThe Cavs had been skipping the pregame introductions with the starters staying near the bench. Lue put an end to that.\n\"You can do what you want on the road because we don't care about the fans on the road, but at least at home, give our fans what they came to see,\" Lue said.\nJames didn't have a problem with Lue's decision.\n\"That's what the coach wants, and that's what we're doing,\" he said. \"There's no fighting, ifs, ands or buts.\"\nDOCTOR'S ORDERS\nLue spent several seasons coaching under Doc Rivers in Boston and with the Clippers. The two remain close, and Lue sought advice from his former boss.\n\"Doc just said, 'Embrace it. It's a tough time right now. I think you're ready, you're built for this. You've been groomed very well, just enjoy it. Don't put a lot of pressure on yourself, just enjoy the moment, embrace it and just have fun,'\" Lue said. \"That's what I'm going to try to do, and we'll see how it ends up.\"\nEYE WEAR\nGibson wore goggles after suffering a scratched cornea during Friday night's loss in Boston. He added eight rebounds.\n\"It was hard last night,\" Gibson said. \"I couldn't see. It's still a little blurry, but I wanted to play and help us win.\"\nTIP-INS\nBulls: F E'Twaun Moore injured his right hamstring in the first quarter and did not return. ... Hoiberg said he was sorry to learn of Blatt's firing. Hoiberg met Blatt in 2014 while on a recruiting visit for Iowa State. \"I think the world of David Blatt as a person,\" Hoiberg said. \"He's a hell of a basketball coach. It's a tough part of this business when something like that happens.\"\nCavaliers: Cleveland is 0-2 against Chicago this season. ... Smith played in his 800th career game. ... G Mo Williams, who found himself on the outside of Blatt's rotations, was on the floor in the first quarter but didn't play again. He sat out 10 of Cleveland's previous 13 games.\nUP NEXT\nBulls: Host Miami on Monday.\nCavaliers: Host Minnesota on Monday.",
  "source": "espn_api",
  "crawled_at": 1764993922.676969
}