{
  "game_id": "401810014",
  "espn_id": "401810014",
  "date": "Nov 03, 2025",
  "matchup": "NY vs WSH",
  "headline": "Towns scores season-high 33 points to lead the Knicks past the Wizards, 119-102",
  "body": "NEW YORK -- — Karl-Anthony Towns scored a season-high 33 points and grabbed 13 rebounds, leading the New York Knicks to a 119-102 victory over the Washington Wizards on Monday night.\n\n\r\n              Jalen Brunson and OG Anunoby each added 16 points, and Jordan Clarkson scored 15 off the bench. Josh Hart had 12 points and 10 rebounds.\n\n\r\n              Alex Sarr led the Wizards with 19 points. Bilal Coulibaly, Corey Kispert and Kyshawn George each had 15.\n\n\r\n              The Knicks are 4-0 at home this season and 0-3 on the road.\n\n\r\n              After shooting a sizzling 72.2% (13 for 18) in the first quarter, the Wizards took their biggest lead at 32-22 on Tre Johnson’s jumper to open the second.\n\n\r\n              The Wizards were still ahead 38-34 when the Knicks went on a 16-3 run and took a 50-41 lead.\n\n\r\n              Washington responded by scoring the next 13 points, which included a four-point play from Coulibaly.\n\n\r\n              However, Towns returned the favor with his own four-point play with less than a second to go and the Knicks walked off the court at halftime with a 57-54 lead.\n\n\r\n              Towns finished the half with 16 points and 10 rebounds.\n\n\r\n              New York continued to pour it on in the third quarter. Leading 74-65, the Knicks scored the next 17 points to take a 91-65 lead.\n\n\r\n              Washington’s scoreless streak finally ended on Marvin Bagley’s free throws with 2:47 remaining in the quarter.\n\n\r\n              The Knicks then took their biggest lead at 94-66 on Hart’s 3-pointer. \n\n\r\n              Landry Shamet had 11 points and Mikal Bridges scored 10 for the Knicks.\n\n\r\n              Up next\n\n\r\n              Wizards: Visit Boston on Wednesday.\n\n\r\n              Knicks: Host Minnesota on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042553.981869
}