{
  "game_id": "0022401007",
  "espn_id": "401705573",
  "date": "Mar 19, 2025",
  "matchup": "CHI @ PHX",
  "headline": "Booker scores 41 to lead Phoenix past Chicago 127-121",
  "body": "PHOENIX -- — Devin Booker scored 41 points, including 20 in the fourth quarter, and the Phoenix Suns held off the Chicago Bulls 127-121 on Wednesday night.\n\n\r\n              Kevin Durant had 26 points and eight assists and Nick Richards had 18 points, nine rebounds and three blocks as the Suns won for the third time in their last four games.\n\n\r\n              Coby White and Nikola Vucevic led the Bulls with 24 points each and Josh Giddey had 22.\n\n\r\n              Booker led the Suns by shooting 7 for 11 (3 for 4 from 3-point range) and 3 of 3 from the free-throw line on the way to his 20-point fourth quarter.\n\n\r\n              Takeaways\r\n              The win moved the Suns into 10th place in the Western Conference standings and into the play-in picture, critical as their next three games are against the iron of the East — Cleveland, Milwaukee and Boston.\n\n\r\n              The Bulls lost for just the second time in their last seven games but dropped to ninth in the Eastern Conference standings. White has now scored 20 or more points in 10 straight games.\n\n\r\n              Key moment\r\n              The Suns led by 18 early in the fourth quarter but the Bulls cut that to 121-117 on White’s 3-pointer with 27 seconds left. But Booker stepped up and scored seven points in the final moments, including a driving layup with 25 seconds left to give the Suns a 123-119 lead, followed by three clutch free throws. \n\n\r\n              Key stat\r\n              The Suns have won two in a row for the first time since January. The Suns outscored the Bulls by 10 points at the free-throw line, making 18 compared to 8 for the Bulls, and the Suns had a 26-9 advantage in second-chance points. The Suns have now won the last 11 meetings between the teams.\n\n\r\n              Up next\r\n              The Bulls visit Sacramento on Thursday night. The Suns play host to Cleveland on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997034.597048
}