{
  "game_id": "0022400955",
  "espn_id": "401705521",
  "date": "Mar 13, 2025",
  "matchup": "MIL vs. LAL",
  "headline": "Bucks withstand Doncic's 45-point effort and end 3-game skid with 126-106 victory over Lakers",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 24 points, 12 rebounds and nine assists, and the Milwaukee Bucks snapped a three-game skid with a 126-106 victory over the short-handed Los Angeles Lakers on Thursday night.\n\n\r\n              The Bucks withstood a 45-point, 11-rebound performance from Luka Doncic, who had 29 points by halftime. His 45 points matched a season high and were his most since joining the Lakers.\n\n\r\n              Austin Reaves added 28 points for the Lakers, who lost their third straight.\n\n\r\n              Milwaukee's Brook Lopez scored 23 points, while Damian Lillard and Kevin Porter Jr. each had 22. Lillard also had 10 assists and six rebounds.\n\n\r\n              Los Angeles’ LeBron James missed a second straight game due to a left groin strain. The Lakers also were missing Jaxson Hayes (right knee bruise) and Rui Hachimura (left patellar tendinopathy).\n\n\r\n              Lakers coach JJ Redick said all three players had flown back to California and also won’t play Friday at Denver, which concludes a four-game trip. They’ll be day to day when the Lakers return to California to start a five-game home stretch Sunday against Phoenix.\n\n\r\n              Takeaways\r\n              Lakers: Injuries left the Lakers at a distinct height advantage, causing them to give 7-footers Alex Len and Christian Koloko and 6-foot-9 veteran Markieff Morris more playing time than usual. They combined to score eight points in 46 minutes.\n\n\r\n              Bucks: Milwaukee bounced back two nights after one of its toughest losses of the season, a 115-114 defeat at Indiana that was decided by Tyrese Haliburton's four-point play with 3.4 seconds left.\n\n\r\n              Key moment\r\n              The Lakers trailed virtually the whole way but stayed close until Antetokounmpo scored 10 points during a 24-7 run that extended Milwaukee’s lead from 76-70 to 100-77 late in the third quarter.\n\n\r\n              Key stat\r\n              With Porter getting his 22 points in just 17 minutes, the Bucks had a 45-20 edge in bench scoring.\n\n\r\n              Up next\r\n              The Lakers visit the Denver Nuggets on Friday. The Bucks host the Indiana Pacers on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997825.4488618
}