{
  "game_id": "0021600171",
  "espn_id": "400899621",
  "date": "Nov 17, 2016",
  "matchup": "POR @ HOU",
  "headline": "James Harden has 3rd triple-double, Rockets beat Blazers",
  "body": "HOUSTON --  In the postgame locker room after the Houston Rockets' 126-109 victory over the Portland Trail Blazers on Thursday night, James Harden teased teammates, laughed about excess shower water caught in his beard and joked with reporters.\n\nIt was a stark contrast from the more solemn and stern version of Harden from last season.\n\n\"I've been having fun all year, even in games we lose,\" Harden said. \"This is a special group of guys, coaching staff included, and this locker room is definitely enjoying this ride right now.\"\n\nHarden had 26 points, 14 assists and 12 rebounds for his third triple-double of the season to help the Rockets overwhelm the Trail Blazers in their highest-scoring game of the season.\n\nHarden completed the triple-double in the third quarter. The Rockets rebounded a night after scoring just three points in the final 6 minutes of a 105-103 loss in Oklahoma City.\n\n\"It's the chemistry,\" Rockets coach Mike D'Antoni said. \"Everybody is feeling good about themselves. We're going to make mistakes, and we still have some improving to do, but as long as they come with that attitude every day and work at it and fix their mistakes, good things will happen.\"\n\nC.J. McCollum led Portland with 26 points, Maurice Harkless had 19, and Damian Lillard 18, his second-lowest output of the season.\n\n\"We kind of suck right now -- it's that simple,\" Lillard said. \"We're usually a pretty good offensive team. We've been bad on offense and bad on defense. We're trying hard, but we're not making the smartest plays -- just not good enough. We're not very good right now.\"\n\nBlazers coach Terry Stotts was much less harsh in his assessment of his team's second straight loss. Portland outscored Houston by a combined 12 points in the second and fourth quarters but was ultimately doomed by a 29-point deficit in the first and third quarters.\n\nThe game was tied at 62 at halftime, but Houston took a 100-83 lead into the fourth quarter.\n\n\"They're very good at what they do and Harden is key to that,\" Stotts said. \"Houston is a very good offensive team -- it's a challenge to guard them.\"\n\nRockets point guard Patrick Beverley made his season debut after missing the first 11 games following arthroscopic surgery on his left knee. Limited to 25 minutes, Beverley had 11 points, three assists and three blocks.\n\n\"Our defense is getting a lot better with him out there because of his toughness,\" D'Antoni said about Beverley. \"He is smart and plays with an edge. You've got to have that.\"\n\nPlaying without backup center Nene, Houston frequently featured smaller lineups with Montrezl Harrell filling in with interior defense while starting center Clint Capela was on the bench. Capela had 15 points, seven rebounds and two blocks, while Harrell added nine points and eight rebounds off the bench.\n\nTIP-INS\n\nTrail Blazers: McCollum made his first six field-goal attempts and had 19 points at the half. ... Portland was outrebounded 54-41 and outscored 56-48 in the paint. ... Mason Plumlee had eight rebounds and seven assists. ... Al-Farouq Aminu (calf) missed his fifth straight game.\n\nRockets: Despite posting a season-high 41 points in the first quarter, Houston was scoreless for the first 2 minutes. ... In the second game of a back-to-back veteran center Nene was given the night off for rest. ... Houston made 14 of 32 3-pointers (43.8 percent).\n\nBEVERLEY'S NEW LOOK\n\nIn his season debut, Beverley sported a shorter haircut and a slightly leaner frame than he did at the end of last season.\n\n\"Losing a lot of weight really helped me change my body,\" Beverley said. \"I felt strong, I felt fast and my wind is going to come. I felt really good and felt confident, too.\"\n\nWHOSE HOUSE? COOG'S HOUSE\n\nThe Toyota Center crowd erupted for the loudest ovation of the game early in the fourth quarter when highlights from the University of Houston's Thursday night game against No. 8 Louisville were shown on the videoboard alongside an up-to-date score showing the Cougars up 31-0. The games were played simultaneously three miles apart.\n\nUP NEXT\n\nTrail Blazers: Travel to New Orleans on Friday night.\n\nRockets: Host Utah on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995673.958693
}