{
  "game_id": "0021900540",
  "espn_id": "401161182",
  "date": "Jan 06, 2020",
  "matchup": "BKN @ ORL",
  "headline": "Markelle Fultz scores career-best 25 to lead Magic past reeling Nets",
  "body": "ORLANDO, Fla. --  Markelle Fultz had the best game of his career and the Orlando Magic needed it to get past the slumping Brooklyn Nets.\n\nFultz scored a career-high 25 points, including seven straight during a 15-1 run in the fourth quarter that lifted the Magic over the Nets 101-89 on Monday night.\n\n\"I was just out there playing in the flow of the game, being aggressive,\" said Fultz, the top pick in the 2017 NBA draft by the Philadelphia 76ers. \"I knew I had a shot or I could pass to my teammates. It just happened that I had open shots, so I took advantage of those.\"\n\nFultz was 11 for 20 from the field with four assists and two steals.\n\n\"I didn't like how much he got to the rim,\" Brooklyn coach Kenny Atkinson said. \"The 3s we'll live with, but all the rim attempts ... that was too much. He did a great job of driving it. He hurt us in transition. He played a great game.\"\n\nNikola Vucevic had 24 rebounds and 11 points for his 300th career double-double, and the Magic pulled away in the final seven minutes after going 9:20 without a field goal.\n\nJoe Harris and Spencer Dinwiddie scored 16 apiece for the Nets, who lost their sixth straight game after charging back from a 16-point deficit to take a lead in the fourth quarter. They shot 33% for the game.\n\nSeven players scored in double figures for the Magic. D.J. Augustin came off the bench to contribute 16 points and five assists.\n\nEven though Harris scored 13 points on 5-of-6 shooting, the Nets fell behind by 16 while shooting 29.8% (14 for 47) in the first half.\n\nOrlando led 52-39 at halftime, but Dinwiddie had 12 points in the third quarter and Dzanan Musa scored Brooklyn's last six points of the period to get the Nets back in it.\n\nWilson Chandler's short jumper with 8:57 left in the fourth pulled the Nets ahead, 78-76. Two free throws by Evan Fournier then launched a 15-1 surge for Orlando over the next 4 1/2 minutes.\n\nFultz followed with a layup, another layup and a 3-pointer from the corner.\n\n\"That was Markelle being aggressive and taking advantage of the transition and having the lane open,\" Fournier said. \"That's what he does every night, to be honest. It's just there was an open lane, he took it twice, and that shot in the corner was just the fruit of his work.\"\n\nTIP-INS\n\nNets: Signed G-F Justin Anderson to a 10-day contract. Anderson had been with Toronto's G-League team. ... G Caris LeVert (thumb) was inactive but is expected to be active Tuesday against the Thunder. ... G Kyrie Irving (shoulder) missed his 24th straight game.\n\nMagic: Vucevic was scoreless until the 6:23 mark of the third quarter. ... Fultz scored nine points in the first 3:38 of the game and then 12 in the fourth quarter. ... Augustin, who had missed 10 foul shots all season in 107 attempts, missed three against the Nets.\n\nLOOKS FAMILIAR\n\nThe Nets (16-19) and Magic (17-20) both finished 42-40 last season, and the Nets earned the sixth playoff seed in the Eastern Conference based on their 2-1 edge in the season series. Now the teams are in a virtual tie for seventh place with three games left to play head-to-head.\n\n\"Both of us have our reasons for where we are right now,\" Atkinson said, \"but we expect to be fighting with them at the end of the year.\"\n\nUP NEXT\n\nNets: Host the Oklahoma City Thunder on Tuesday night.\n\nMagic: Host the Washington Wizards on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996433.885812
}