{
  "game_id": "0022300885",
  "espn_id": "401585513",
  "date": "Mar 05, 2024",
  "matchup": "CHA vs. ORL",
  "headline": "Paolo Banchero scores 22 points as Magic beat Hornets for ninth win in 11 games",
  "body": "CHARLOTTE, N.C. -- — Paolo Banchero had 22 points, Cole Anthony scored 12 of his 14 points in the second half, and the surging Orlando Magic beat the Charlotte Hornets 101-89 on Tuesday night for their ninth win in 11 games.\n\n\r\n              Wendell Carter Jr. had 12 points and nine rebounds for the Magic (36-26), who moved 10 games above .500 for the first time since April 18, 2012.\n\n\r\n              The Magic haven't gotten a ton of national attention this season, but Anthony said if the team keeps winning, the recognition will follow.\n\n\r\n              “People are starting to slowly, but surely catch on,” Anthony said. “There are some good teams in this league and we are trying to build our way up into those ranks. And I feel like we are well on our way. The hype will come. We just have to keep doing what we've got to do.”\n\n\r\n              Magic coach Jamahl Mosley credited a change in mentality for Orlando's success.\n\n\r\n              “We are holding ourselves to a higher standard,\" Mosley said. “These guys have communicated what that standard is on both sides of the basketball. Offensively, we want to make sure we’re moving it and sharing it, playing the right way. ... Defensively, we want to make sure we’re communicating the right way and that we’re physical without fouling.”\n\n\r\n              Anthony was one of four reserves to score in double figures for Orlando, whose bench outscored Charlotte’s 46-23.\n\n\r\n              Vasa Micic, who got the start at point guard with LaMelo Ball and Cody Martin out with injuries, had a career-high 21 points for Charlotte (15-47). Tre Mann and Brandon Miller each scored 18 for the Hornets, who have lost five straight.\n\n\r\n              Micic has provided a boost since coming over in a trade from Oklahoma City.\n\n\r\n              “I thought he played well,” Hornets coach Steve Clifford said. “He was very much on the attack on his pick-and-rolls and had a lot of good finishes at the rim. And he's also a very good passer who is good at hitting the roller.”\n\n\r\n              The Magic led 45-43 at halftime as 52% shooting helped them overcome 12 turnovers.\n\n\r\n              Orlando began to create some separation near the end of the third quarter with Banchero knocking down a 3 and Anthony scoring on a driving layup high off the glass and connecting on a 3 from the top of the key to push the lead to nine entering the fourth.\n\n\r\n              Anthony stayed hot in the final period, scoring seven straight points to push Orlando's lead to 92-76 with seven minutes to play.\n\n\r\n              The Hornets never got within 10 again in a game that included several offensive fouls for moving screens.\n\n\r\n              “There was a level of poise with the guys,” Mosley said. \"It was a rocky game, back and forth, guys couldn’t really get a flow both offensively and defensively. It was physical, which we prefer. Our guys’ ability to stay poised, stay in the moment and just finding ways to win on the road was impressive.”\n\n\r\n              Charlotte's Miles Bridges, who entered averaging 21.4 points per game, was held to seven points on 3-of-16 shooting.\n\n\r\n              Clifford said he wants to get the ball in Miller's hands more.\n\n\r\n              “We’ll slow it down and get the ball in his hands because he’s too good,” Clifford said of the No. 2 overall pick in the 2023 draft. \"In the first half tonight he had taken five shots, and we can’t have that.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Washington on Wednesday night.\n\n\r\n              Hornets: At Washington on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995951.5165179
}