{
  "game_id": "0022200307",
  "espn_id": "401468462",
  "date": "Nov 28, 2022",
  "matchup": "PHX @ SAC",
  "headline": "Booker scores 44, Suns top Kings 122-117 for 5th straight",
  "body": "SACRAMENTO, Calif. -- — Devin Booker had 44 points, eight rebounds and six steals, and the Phoenix Suns extended their winning streak to five with a 122-117 victory over the Sacramento Kings on Monday night.\n\n\r\n              “That's kind of what I get paid to do,” Booker said. “I was worried about getting everyone else involved. Late in the game we got a lot of open shots.” \n\n\r\n              Deandre Ayton added 17 points and 12 rebounds for his ninth double-double of the season for Phoenix, which has won six of seven. \n\n\r\n              “That’s impressive,” Suns coach Monty Williams said. “We really wanted to win it tonight. I was proud of the way we responded... across the board, everyone made a huge contribution. That team is loaded.”\n\n\r\n              Booker closed out his second-highest point total of the season by knocking down a pair of free throws with 6.8 seconds left after Torrey Craig secured an offensive rebound. He scored 49 points in a loss to Utah earlier in the month. \n\n\r\n              “Book was doing Book,” Sacramento's Malik Monk said. “It’s kinda hard to stop an All-Star, especially when he’s rolling.”\n\n\r\n              Damion Lee scored 15 points off the bench, hitting three 3-pointers. Mikal Bridges finished with 13 points, eight rebounds and seven assists. He hit a three-pointer with just over a minute left to stretch the lead to 10.\n\n\r\n              Monk scored 30 points for the Kings, his fourth game over 20 points this season.\n\n\r\n              Domantas Sabonis finished with 17 points, 10 assists and nine rebounds. The Kings have lost three straight after a seven-game win streak.\n\n\r\n              “Next game, we’ve got to win,” Sabonis said. “We’ve got to figure it out. We can’t let these (losses) keep piling up. We’re at home and we’ve got to protect home court.”\n\n\r\n              Kevin Huerter scored 18 points and grabbed seven rebounds. Huerter’s dunk with 35 seconds left cut the Suns' lead to three.\n\n\r\n              Keegan Murray scored 11 points. The rookie from Iowa had scored in single digits in the Kings' last three games.\n\n\r\n              De'Aaron Fox scored 11 points, his second-lowest scoring night of the season.\n\n\r\n              “He's our guy,” Kings coach Mike Brown said. “I'm going to keep pressing him to step up.”\n\n\r\n              The first half featured 16 ties and eight lead changes. Phoenix opened the second half on a 14-2 run after trailing by one.\n\n\r\n              TIP-INS\n\n\r\n              Suns: G Chris Paul missed his 10th consecutive game with right heel soreness. … Booker was given a technical foul with 3:41 left in the first quarter.\n\n\r\n              Kings: F Trey Lyles was ruled out due to a non-COVID illness… Sabonis recorded his 12th double-double of the season, which is the second-most in the NBA. … The Kings have scored over 100 points in every game this season.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Chicago on Wednesday.\n\n\r\n              Kings: Host Indiana on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995090.9991019
}