{
  "game_id": "401810217",
  "espn_id": "401810217",
  "date": "Dec 07, 2025",
  "matchup": "PHI vs LAL",
  "headline": "Philadelphia plays Los Angeles, aims for 4th straight victory",
  "body": "Los Angeles Lakers (16-6, third in the Western Conference) vs. Philadelphia 76ers (13-9, seventh in the Eastern Conference)\n\n\r\n              Philadelphia; Sunday, 7:30 p.m. EST\n\n\r\n              BOTTOM LINE: Philadelphia will look to keep its three-game win streak alive when the 76ers take on Los Angeles.\n\n\r\n              The 76ers have gone 7-6 in home games. Philadelphia has a 4-3 record in one-possession games.\n\n\r\n              The Lakers have gone 9-3 away from home. Los Angeles averages 118.6 points and has outscored opponents by 2.1 points per game.\n\n\r\n              The 76ers' 13.5 made 3-pointers per game this season are just 0.9 fewer made shots on average than the 14.4 per game the Lakers give up. The Lakers average 11.8 made 3-pointers per game this season, 1.1 fewer made shots on average than the 12.9 per game the 76ers allow.\n\n\r\n              TOP PERFORMERS: Tyrese Maxey is averaging 31.6 points, 7.1 assists and 1.7 steals for the 76ers. Quentin Grimes is averaging 22.0 points over the last 10 games.\n\n\r\n              Luka Doncic is scoring 35.3 points per game and averaging 8.9 rebounds for the Lakers. Gabe Vincent is averaging 4.0 made 3-pointers over the last 10 games.\n\n\r\n              LAST 10 GAMES: 76ers: 6-4, averaging 115.0 points, 45.1 rebounds, 25.8 assists, 9.9 steals and 5.6 blocks per game while shooting 45.5% from the field. Their opponents have averaged 116.0 points per game.\n\n\r\n              Lakers: 8-2, averaging 121.8 points, 40.8 rebounds, 24.6 assists, 7.5 steals and 4.1 blocks per game while shooting 51.5% from the field. Their opponents have averaged 116.0 points.\n\n\r\n              INJURIES: 76ers: Trendon Watford: out (thigh), Kelly Oubre Jr.: out (knee), Joel Embiid: day to day (knee).\n\n\r\n              Lakers: Luka Doncic: day to day (personal), Marcus Smart: day to day (back), LeBron James: day to day (back).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042772.975181
}