{
  "game_id": "0021900467",
  "espn_id": "401161109",
  "date": "Dec 27, 2019",
  "matchup": "CHA vs. OKC",
  "headline": "Gilgeous-Alexander, Thunder hold off Hornets 104-102 in OT",
  "body": "CHARLOTTE, N.C. --  After 15 seasons in the NBA, Chris Paul said there's nothing that beats playing in the fourth quarter.\n\nAfter making some clutch plays in it Friday, he had enough left to come up big in overtime.\n\nShai Gilgeous-Alexander scored 27 points, Dennis Schroder added 24 off the bench and Paul had 10 of his 16 points after the third quarter as the Oklahoma City Thunder beat the Charlotte Hornets 104-102 for their fifth win in the last six games.\n\n\"I love it man,\" Paul said. \"I kept telling Shai, 'All right, it's the fourth quarter and we will turn it on.' And that's the thing that gets your blood flowing, those fourth-quarter situations.\"\n\nPaul didn't put up gaudy numbers in his nearly 35 minutes of action, finishing just 6 of 20 from the field. But he contributed seven rebounds, six assists and gave the Thunder the floor general and playmaker they needed down the stretch after his team let a 16-point lead slip away in the fourth quarter.\n\n\"He was great,\" said Thunder coach Billy Donovan. \"He made obviously some big shots and some big plays. ... He made some key shots coming down the stretch.\"\n\nPaul, a North Carolina native who was playing in front of his father, brother and grandparents who were sitting courtside, hit two jumpers in the final 1:06 of regulation. Then he knocked down a pull-up jumper in overtime to give the Thunder a five-point lead. He also had three rebounds in the extra period.\n\nSaid Hornets coach James Borrego: \"Chris Paul is a handful -- he's still a handful.\"\n\nTerry Rozier scored 26 points and Devonte Graham had 15 points and 13 assists for the Hornets, who finished 7 of 39 from 3-point range after missing their first 18 attempts from beyond the arc.\n\nSteven Adams tipped in a miss by Paul to give the Thunder a 103-99 lead in the extra period, but Graham answered with a quick 3 from the top of the key. The Hornets fouled Gilgeous-Alexander, who made one of two free throws with 8.4 seconds left, giving Charlotte a chance to win or send the game into a second overtime.\n\nBut Charlotte's inbounds play went awry as Graham slipped trying to get the ball.\n\nP.J. Washington improvised and drove to the basket and was fouled with 1.9 seconds left. But Washington missed the first free throw badly to the right and was forced to try to miss the second. Washington's second shot hit the front rim, but the Hornets were unable to corral the rebound and get a shot off as time expired.\n\n\"I think we came out really sluggish,\" Washington said. \"Missing shots, missing assignments on defense, just watching ball, watching the offense. We could have done a better job of that coming in, so we just have to get better from the start of the games and just have to maintain that for the whole game.\"\n\nThe Thunder got off to a slow start, failing to score until nearly five minutes into the game after missing their first eight shots from the field and both free throw attempts. But Oklahoma City still managed to build a 16-point lead in the first half largely because the Hornets struggled from long distance.\n\nTIP-INS\n\nThunder: Adams had 14 points and 12 rebounds. ... Bench outscored the Hornets' 47-26. Oklahoma City's bench has outscored its opponent's reserves in 24 of 31 games this season.\n\nHornets: Washington returned to the starting lineup after missing the last five games with a fractured finger on his right hand. ... Graham has increased his scoring output by 14.6 points over last season. No one else in the league is averaging more than an 8.4-point improvement.\n\nODD ENDING TO REGULATION\n\nOvertime started in an odd way with the Thunder getting a free throw after Rozier was assessed a technical foul for throwing the ball into the crowd at the end of regulation.\n\nDonovan said he'd never seen a technical free throw attempt before the start of an overtime period.\n\nRozier called it a \"silly technical\" on his part.\n\nGILGEOUS-ALEXANDER DOING MORE\n\nGilgeous-Alexander led Oklahoma City in scoring again, but Donovan was most impressed with his post defense late in the game when the Thunder went to four guards. He had two steals that helped change the momentum in the final three minutes of regulation.\n\n\"That was really critical because they had a lead at that point and time and those couple steals kind of got us back in control and we got some momentum,\" Donovan said. \"It was two consecutive steals on two post-ups, so those plays were big when we were small.\"\n\nUP NEXT\n\nThunder: Travel to Toronto to face the Raptors on Sunday night.\n\nHornets: Visit the Grizzlies on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764996079.143994
}