{
  "game_id": "0021800368",
  "espn_id": "401071049",
  "date": "Dec 07, 2018",
  "matchup": "CHA vs. DEN",
  "headline": "Walker scores 21, Hornets snap Nuggets' 7-game win streak",
  "body": "CHARLOTTE, N.C. --  Nic Batum knew exactly what was coming when fellow Frenchman Tony Parker raced down the court with a head of steam on a fast break.\n\nParker stopped momentarily planting his right foot, then spun 360 degrees to avoid a defender and scored on a layup on the other side of the rim.\n\nThe 36-year-old Parker proved again he can still make some pretty slick plays and is a valuable asset down the stretch of tight games, scoring 19 points to help the Charlotte Hornets snap the Denver Nuggets' seven-game win streak with a 113-107 victory on Friday night.\n\nKemba Walker had 21 points and eight assists, Marvin Williams added 14 points and 10 rebounds and the Hornets picked up their first win this season against a Western Conference opponent.\n\n\"I've seen that move so many times,\" said a grinning Batum, who also played with Parker on the French national team. \"I kind of laughed when he did it. I told him, `I've been waiting for that move.' They changed the rule in Europe because of that move. They now call it traveling over there.\"\n\nCoach James Borrego called it \"vintage Parker.\"\n\nParker, now in his 18th NBA season, made big plays throughout as the Hornets ended a three-game skid.\n\nCharlotte built a 64-53 halftime lead behind Parker, who had 13 points, three assists and a steal and provided a jolt of energy in a pivotal second quarter. And when the Nuggets rallied from 11 down with three minutes remaining and cut the lead to three with 1:13 left on a 3-pointer from Monte Morris, Parker drove the left side of the lane and hit a big step-back 17-foot jumper to make it a two-possession game.\n\n\"The bigger the moment the better he is,\" Williams said of Parker. \"He's a champion and he has experience in those situations and it's great to have a teammate like that.\"\n\nThe Nuggets looked to cut it back to three on the next possession, but Michael Kidd-Gilchrist had huge block against the glass on Juancho Hernangomez with 24 seconds left. Walker hit three free throws in the final 14 seconds to put the game away. Walker finished the game 11 of 12 from the free throw line, offsetting a tough 4-of-11 shooting night.\n\n\"Tony Parker made some tough shots on me down the stretch,\" Morris said. \"I mean I played great defense, got two good contests. I mean he's a vet, 17 years in the game, so that's his go-to move.\"\n\nDenver came in the with the best record in the Western Conference, but shot 39 percent from the field and 23 percent from 3-point range. The Hornets put the clamps on Nikola Jokic for most of the game, holding the 7-foot, 250-pound center to 16 points and 11 rebounds.\n\nJamal Murray led the Nuggets with 20 points.\n\nTIP INS\n\nNuggets: Will Barton, Gary Harris, Michael Porter Jr. and Isaiah Thomas did not play due to injuries. ... Torrey Craig had a rough night in his return to the Carolinas as the former South Carolina Upstate star was held scoreless and fouled out.\n\nHornets: Carolina Panthers defensive end Julius Peppers took in the game from courtside seats. A certain future NFL Hall of Famer, Peppers once played basketball for the North Carolina Tar Heels and remains a big basketball fan.\n\nMILLSAP LEAVES WITH FOOT INJURY\n\nNuggets forward Paul Millsap left the game with a foot injury, leaving his status for Saturday night's game at Atlanta up in the air.\n\n\"If Paul is unable to go tomorrow night that's an opportunity for somebody else,\" Nuggets coach Mike Malone said. \"And that means somebody else moves into the lineup and somebody else has got an opportunity off the bench.\"\n\nSTRONG BENCH\n\nThe Hornets bench outscored the Nuggets 59-40, as they got 16 points from Mail Monk and 11 from Frank Kaminsky.\n\n\"They've been huge for us all year,\" Williams said. \"I mean we wouldn't be winning games if we didn't have those guys. So many times the starters may not have had it early or may not have had it late, they've come in the game and made plays. It's been guy after guy.\"\n\nUP NEXT\n\nNuggets: At Hawks on Saturday night.\n\nHornets: At Knicks on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994412.7900338
}