{
  "game_id": "401810032",
  "espn_id": "401810032",
  "date": "Nov 05, 2025",
  "matchup": "DAL vs NO",
  "headline": "Saddiq Bey's 22 points, nine rebounds lead Pelicans past Mavericks 101-99",
  "body": "DALLAS -- — Saddiq Bey had season highs with 22 points and nine rebounds to lead the New Orleans Pelicans past the Dallas Mavericks 101-99 on Wednesday night.\n\n\r\n              Dallas rookie Cooper Flagg’s running shot down the lane with 2 seconds left banged off the back of the rim with New Orleans’ Trey Murphy III grabbing the contested rebound.\n\n\r\n              Jeremiah Fears and reserve Jose Alvarado each added 13 points for the Pelicans (2-6), who swept a back-to-back after beating Charlotte at home on Tuesday.\n\n\r\n              Flagg was the Mavericks’ leading scorer for the first time with 20 points to go with nine rebounds. P.J. Washington had 15 points and 11 rebounds for Dallas (2-6), which has lost three straight.\n\n\r\n              The Mavericks, who entered play last in the NBA averaging 107.3 points per game, introduced a new starting lineup. Flagg moved from point guard to small forward. D’Angelo Russell got his first start this season at the point. Klay Thompson came off the bench for the first time since March 2024 during the last of his 11 seasons with Golden State.\n\n\r\n              Thompson matched season highs with 11 points, including three 3-pointers, in 21 minutes. Russell had nine points, shooting 3 for 10.\n\n\r\n              The Pelicans used their seventh starting lineup in eight games. They played without power forward Zion Williamson (out for at least a week with a strained hamstring) and point guard Jordan Poole (sore knee).\n\n\r\n              The Mavericks played their third consecutive game without power forward Anthony Davis (calf strain) and fifth straight minus center Dereck Lively II (sprained knee).\n\n\r\n              Dallas rallied after missing its first seven shots from the floor and trailing by as many as 13 points in the first half.\n\n\r\n              The Pelicans held a 56-44 rebounding advantage yet were outscored 18-10 on second-chance points.\n\n\r\n              Up next\r\n              Pelicans: At San Antonio on Saturday.\n\n\r\n              Mavericks: At Memphis on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042568.497184
}