{
  "game_id": "0022000978",
  "espn_id": "401307781",
  "date": "May 03, 2021",
  "matchup": "ATL vs. POR",
  "headline": "Gallinari, Bogdanovic lead Hawks past Trail Blazers 123-114",
  "body": "ATLANTA -- — Danilo Gallinari made seven 3-pointers and finished with 28 points, leading the Atlanta Hawks to a 123-114 victory over the Portland Trail Blazers in a matchup Monday night of teams battling for playoff positioning in their respective conferences.\n\n\r\n                    The Hawks snapped Portland's four-game winning streak, which had come entirely on the road.\n\n\r\n                    Atlanta entered the night tied for fifth in the Eastern Conference, with the Trail Blazers holding the same spot in the West. Both teams are looking to avoid dropping as low as seventh, which would force them into the play-in tournament.\n\n\r\n                    After getting in early Monday from Boston, where they beat the Celtics the previous night, the Trail Blazers were forced from the hotel rooms to take refuge in a parking garage for about a half-hour by a tornado warning in Atlanta.\n\n\r\n                    They ran out of steam in the fourth quarter, ruining a 33-point night for Damian Lillard and a bit of history for Carmelo Anthony.\n\n\r\n                    The 36-year-old Anthony scored 14 points to surpass Elvin Hayes for 10th place on the NBA's career scoring list with 27,318.\n\n\r\n                    “This moment is a little bit special,” Anthony said. “I don't want to downplay it. I'm excited about it.\"\n\n\r\n                    The Hawks were excited about the win, especially with Gallinari providing a big lift off the bench.\n\n\r\n                    “It's very important,” coach Nate McMillan said. “You've got to have a first and second unit. He's a big part of how we play in that second unit.”\n\n\r\n                    \r\n                      Bogdan Bogdanovic provided the bulk of Atlanta's offense over the first two quarters, scoring 23 of his 25 points for the second highest-scoring half of his career. He also made seven 3s, one shy of his career best.\n\n\r\n                    \r\n                      Gallinari took over in the second half, scoring 21 points and hitting six of seven beyond the arc. \n\n\r\n                    As a team, the Hawks were 20 of 41 from 3-point range.\n\n\r\n                    After starting his career as more of a wing player, the 32-year-old Gallinari is often matched up now with bigger players in the post.\n\n\r\n                    Yet he's still got that outside touch.\n\n\r\n                    “It's just more of a mental change,” Gallinari said. “You need embrace it and just make best out of it..”\n\n\r\n                    MELO'S MARK\n\n\r\n                    Anthony moved into the Top 10 of the career scoring list early in the second quarter when he hit a 3-pointer and was fouled by Gallinari, knocking down the free throw to complete a four-point play.\n\n\r\n                    He was fully aware of how many points he needed to pass Hayes.\n\n\r\n                    “I knew this moment,” Anthony said. “I didn't know those other moments — 15, 13, 11. But 10 is something I knew. ... If you're in the Top 10 of anything of all time, it's a special moment. ”\n\n\r\n                    It looked like his career might be over after he played just 10 games during the 2018-19 season, but Anthony has found new life in Portland.\n\n\r\n                    In the past two seasons, he's passed nine players on the career scoring list. \n\n\r\n                    He knocked off Alex English, Kevin Garnett, John Havlicek and Paul Pierce last season; he’s taken down Tim Duncan, Dominique Wilkins, Oscar Robertson, Hakeem Olajuwon and now Hayes this season. \n\n\r\n                    Next up for the 36-year-old Anthony: Moses Malone at 27,409 points\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: CJ McCollum had 20 points. ... Norman Powell was able to play more than 32 minutes despite a sore right knee. He was listed as questionable but suited up and scored 15 points after playing 39 minutes the night before at Boston. \n\n\r\n                    Hawks: Have won six consecutive home games, one off their high for the season, and 14 of 16 at State Farm Arena. They won seven straight at home from Feb. 21 to April 6. ... Trae Young had 21 points and 11 assists. He went eight of eight at the foul line, moving past Walt Bellamy for the 24th spot in franchise history with 1,269 free throws made.\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Wrap up a six-game road trip against the Cleveland Cavaliers on Wednesday.\n\n\r\n                    Hawks: Host the Phoenix Suns on Wednesday, continuing a stretch where they are closing the regular season with seven of their last eight games at home.\n\n\r\n                    ------\n\n\r\n                    Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 His work can be found at https://apnews.com/search/paulnewberry\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997619.5150132
}