{
  "game_id": "0022200029",
  "espn_id": "401468184",
  "date": "Oct 22, 2022",
  "matchup": "IND vs. DET",
  "headline": "Pacers ended 12-game losing streak, beating Pistons 124-115",
  "body": "INDIANAPOLIS -- — Rookie Bennedict Mathurin scored 27 points, hitting three 3-pointers in a pivotal third quarter, and the Indiana Pacers beat the Detroit Pistons 124-115 on Saturday night to snap a 12-game losing streak dating to last season.\n\n\r\n              The Pacers dropped their first two games of the season at home this week.\n\n\r\n              “My first NBA win, I’m looking forward to many more,” Mathurin said. “It was really fun tonight.”\n\n\r\n              Mathurin, a 20-year-old Canadian forward selected sixth overall, made the three 3-pointers in a 2:20 span as the Pacers surged to an 88-79 lead after three quarters. Indiana outscored Detroit 36-23 in the quarter to erase a four-point halftime deficit.\n\n\r\n              “We have to start somewhere to get somewhere,” Mathurin said.\n\n\r\n              Mathurin’s fifth and final 3-pointer pushed Indiana ahead 108-97 with 3:57 remaining. The sixth man boosted the Pacers' edge in bench scoring to 58-29.\n\n\r\n              “He plays like a veteran,” Pacers coach Rick Carlisle said about Mathurin. “He's got a great feel and disposition for a scorer. He has a level of patience. Things didn't happen for him right away tonight. He was in the game several minutes before he even got a good look. During one of the early timeouts, I reminded him to get himself into the game defensively and by running, then other good things will happen.”\n\n\r\n              Pacers point guard Tyrese Haliburton scored 24 points and provided clutch plays on three consecutive possessions in the final minutes. He made 3-pointers on back-to-back possessions then fed Aaron Nesmith for another basket from beyond the arc to give Indiana its largest lead at 117-105 with 1:21 remaining.\n\n\r\n              “They came at us and made some plays,” Carlisle said. “But our answers were strong and decisive. It was great to see.”\n\n\r\n              Jalen Smith added 19 points and 15 rebounds for the Pacers.\n\n\r\n              Cade Cunningham led the Pistons with 22 points.\n\n\r\n              “We just have to learn from some of the things we have to learn,” Pistons coach Dwane Casey said, “as far as shot selection, how to switch, containing the basketball, transition defense, all those things.”\n\n\r\n              He specifically pointed to the Pacers' 15 blocked shots.\n\n\r\n              “Those blocked shots started their break,” Casey said. “And your offense is flat.”\n\n\r\n              The Pistons led by 14 points in the opening quarter before the Pacers rallied in the second quarter to cut it to 56-52 at the break. Indiana benefited from 32 bench points, 14 more than Detroit, in the first half.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Hit 18 of 41 3-pointers (.439), two more than the Pacers. ... F Bojan Bogdanovic, who played for the Pacers from 2017 to 2019, finished with 16 points on 5-of-16 shooting against his former team.\n\n\r\n              Pacers: Have trailed by double digits after the first quarter in all three games and allowed an average of 35.6 points. ... Took first lead of the season when Mathurin hit a 3-pointer for a 42-41 advantage with 6:30 remaining in the second quarter. ... C Myles Turner (left ankle sprain) has yet to make his season debut after landing on the foot of a ball boy during warmups before Wednesday's season opener.\n\n\r\n              IVEY HOMECOMING\n\n\r\n              Pistons rookie shooting guard Jaden Ivey had 17 points, 11 rebounds and five assists in returning to his Hoosier home state. He was doubled over in pain after taking a shot to the abdomen on an inside drive in the third quarter, but didn't come out of the game. The fifth overall pick was born in South Bend, went to high school in Marian and was a star at Purdue. His mother, Niele, is Notre Dame's women's basketball coach.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: At Washington on Tuesday night.\n\n\r\n              Pacers: At Philadelphia on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994346.704132
}