{
  "game_id": "0021801163",
  "espn_id": "401071836",
  "date": "Apr 02, 2019",
  "matchup": "SAC vs. HOU",
  "headline": "Harden scores 36, Rockets rout Kings 130-105",
  "body": "SACRAMENTO, Calif. --  The Houston Rockets weren't shy about trying to break their own NBA record for most 3-pointers in a game, heaving up five shots from long range in the final two minutes.\n\nAll five shots missed.\n\nJames Harden shrugged it off and was more impressed with how well the Rockets spread the ball around, passing for 30 assists for the fourth time this season.\n\nHarden had 36 points and 10 assists, Houston had 26 3-pointers and the Rockets beat the Sacramento Kings 130-105 Tuesday night.\n\nHouston (50-28) moved a half-game ahead of idle Portland for third place in the Western Conference. It's the fifth time in the six years that the Rockets have had at least 50 victories.\n\n\"The ball is moving, guys are getting shots, guys are getting opportunities and capitalizing on it,\" Harden said. \"It's going to be vital for us late in the stretch and heading into the postseason.\"\n\nComing off a 50-point, triple-double against the Kings on Saturday, Harden had another big night to help the Rockets complete a four-game season sweep of Sacramento.\n\nHarden scored 23 points in the first half, made three of his seven 3s during a two-minute span in the third quarter and had a long alley-oop pass to House for a dunk then added another 3-pointer in the fourth that made it 114-89.\n\nIn the four games against the Kings this season, Harden scored 156 points and had 29 assists and 24 rebounds.\n\nThat helped keep Houston rolling on a night when point guard Chris Paul had an off night scoring, finishing with seven points while going 1 of 7 from 3-point range. Paul, who had 12 assists, also had two steals to move past Alvin Robertson into ninth place all-time in the NBA. Paul has 2,113.\n\n\"We just tried to come out aggressive,\" Paul said. \"They made some runs but our defense was pretty locked in most of the game and we got out in transition.\"\n\nEric Gordon and Danuel House Jr. each scored 19 points, Kenneth Faried added 12 points and 11 rebounds, and P.J. Tucker scored 13. The Rockets have won 17 of 20.\n\nBuddy Hield had 20 points and seven rebounds for Sacramento. The Kings (38-40) have lost four of six.\n\n\"They do a good job of spreading it around,\" Sacramento coach Dave Joerger said. \"They got what they were looking for which is at the rim or 3-point shots, and we struggled. We've got to go harder than that.\"\n\nHouston led by 16 points at halftime, led 89-68 late in the third following a 4-point play by Harden, then made six consecutive 3s in the fourth to blow the game open.\n\nMANIMAL BACK IN FORM\n\nFaried's 14th double-double of the season came after he did not play in Houston's previous three games due to left knee soreness. \"He attacks on the rim and that really helps,\" Rockets coach Mike D'Antoni said.\n\nSECOND PLACE WITHIN REACH\n\nHouston trails second-place Denver by 1 1/2 games in the West. With four games left, the Rockets still have time to pass the Nuggets, but Paul isn't thinking about that. \"We said it all season long, for us it's about being healthy,\" Paul said. \"When you've been in this league long enough, at the end of the day you're going to have to play whoever's there. For us, it's playing the right way and we'll see who we have to play.\"\n\nTIP-INS\n\nRockets: It's the 16th time this season that Houston has made 20 or more 3-pointers. . The Rockets' biggest lead was 30 points late in the fourth when Chris Chiozza made a 3. . Houston's 30 assists were two shy of its season high of 32.\n\nKings: Marvin Bagley III had 19 points on 7-of-18 shooting and eight rebounds off the bench. . Harry Giles missed his seventh consecutive game with a left thigh contusion.\n\nUP NEXT\n\nRockets: Play the Clippers in Los Angeles on Wednesday.\n\nKings: Host the Cavaliers on Thursday.\n\n--\n\nMore AP NBA:https://apnews.com/tag/NBA andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994158.260579
}