{
  "game_id": "0021900638",
  "espn_id": "401161280",
  "date": "Jan 19, 2020",
  "matchup": "IND @ DEN",
  "headline": "Sabonis’ triple-double leads Pacers past Nuggets 115-107",
  "body": "DENVER --  Despite playing from behind for most of their game against the Denver Nuggets, Domantas Sabonis never felt the Indiana Pacers were out of it.\n\nSabonis had 22 points, 15 rebounds and 10 assists for his first career triple-double, Doug McDermott scored 18 of his 24 points in the fourth quarter and the Pacers rallied late to beat the Nuggets 115-107 on Sunday night.\n\n\"I just felt like we were always right there, down 5-6 points all game,\" Sabonis said. \"I felt like this was the game we needed to get to start the road trip right and just believed in my teammates that we could make that next step. And in the fourth quarter everybody stepped up and made big-time plays.\"\n\nIn one sequence with just under three minutes remaining, Sabonis helped protect the Pacers' late lead by fighting through traffic in the low post to grab three offensive rebounds before finishing with a tip-in.\n\n\"McDermott killed us. Sabonis killed us,\" Nuggets coach Michael Malone said. \"The fourth quarter, they had six offensive rebounds. The very few times they did miss, they just pushed us around, much more physical than us. Disappointing loss.\"\n\nMalcom Brogdon and T.J. Warren added 22 points each for the Pacers, who snapped a 10-game skid at Pepsi Center. They overcame a 30-point performance from the Nuggets' Nikola Jokic to win their fifth straight.\n\n\"We just played really well together out there in the fourth quarter,\" McDermott said. \"We had a lot of shots fall and I thought we did a good job on defense and rebounding.\"\n\nJerami Grant and Will Barton added 16 points apiece for the Nuggets, who were again without injured starters Paul Millsap, Gary Harris and Jamal Murray.\n\nDenver had the lead for most of the game but was outscored 41-26 in the fourth quarter. The Nuggets missed 10 of 32 free throws and were 3 of 23 from 3-point range while the Pacers connected on 13 of 29 from beyond the arc, including six 3-pointers by McDermott.\n\n\"I think we got real relaxed and we didn't play with a sense of urgency, especially in the second half,\" said Michael Porter Jr., who scored 10 points for Denver. \"I think we kind of gave that one away.\"\n\nBrogdon connected on a 3-pointer in the waning seconds of the third quarter and the Pacers pulled within 81-74 going into the final period.\n\nSuccessive 3-pointers by Aaron Holiday and McDermott followed by McDermott's layup evened the score at 91 with 6:59 left. The sides alternated scores in the closing minutes, with the Pacers taking their first lead, 98-97, with 4:13 remaining on a 3-pointer from the corner by McDermott.\n\nConsecutive baskets by Sabonis put Indiana in front 104-99 with 1:30 left and McDermott answered two free throws by Jokic with another 3-pointer as the Pacers pulled out to a six-point advantage with 1:08 remaining. The Nuggets could not close the gap.\n\nTIP-INS\n\nPacers: Missed nine of their first 10 shots six minutes into the game but trailed by just four points. ... Improved to 8-8 this season when playing teams with a better than .500 record.\n\nNuggets: Millsap missed a sixth consecutive game with a bruised left knee. ... Murray was out for a second game in a row because of a left ankle sprain. ... Harris remained sidelined for a third consecutive game because of a right adductor strain.\n\nUP NEXT\n\nPacers: Play the second of a back-to-back set on the road at Utah on Monday night.\n\nNuggets: Complete a back-to-back set on Monday night at Minnesota to start a three-game trip.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995846.804841
}