{
  "game_id": "0021800499",
  "espn_id": "401070235",
  "date": "Dec 25, 2018",
  "matchup": "PHI @ BOS",
  "headline": "Irving scores 40, leads Celtics to 121-114 win over Sixers",
  "body": "BOSTON --  Kyrie Irving extended the game with a clutch shot, then ended it with two more in overtime.\n\nIrving scored six of his 40 points in overtime, hitting back-to-back 3-pointers while leading Boston back from a five-point deficit as the Celtics beat the 76ers 121-114 on Tuesday night.\n\n\"Just competition at its highest. I love going against the best. It's not too often you get to do that in the regular season, especially on a holiday like Christmas,\" said Irving, who also pulled down 10 rebounds. \"I got to open presents with my family this morning then come into work. It was great.\"\n\nIt came very close to not being so great for Boston, which needed Irving's fadeaway jumper from 13-feet out to tie it at 108 with 20 seconds left in the fourth quarter, forcing the OT.\n\nThe Sixers, much improved from the team that lost here 105-87 in the season-opener, scored the first five points of OT, but could not stop Irving when they needed to -- again.\n\n\"There aren't many in his weight class,\" Philadelphia coach Brett Brown said. \"Inevitably, you've got to stop him.\"\n\nIrving hit a 3-pointer with 2:01 left to put Boston up 115-114, then struck again from 30-feet with 1:29 remaining in the OT and the Celtics held on to improve to 2-0 against Philadelphia this season.\n\nJayson Tatum and Marcus Morris scored 23 apiece for Boston and Terry Rozier had 10 points.\n\nJoel Embiid led Philadelphia with 34 points, making 12 of 12 free throws, and pulled down 16 rebounds. Jimmy Butler scored 24, JJ Redick had 17 points and\n\nBen Simmons added 11 points, 14 rebounds and eight assists for the Sixers.\n\nSimmons' two free throws with 2:15 left to put the Sixers up 114-112, but Philadelphia didn't score again.\n\n\"These are the type of games that challenge you mentally, and we made sure that we stayed with it and finished it,\" said Al Horford, who scored just four points but pulled down nine rebounds and helped mitigate the Sixers' size advantage inside.\n\nThe Celtics led 57-51 at halftime, but Philadelphia used a 15-2 run in the third while shooting 60 percent in the period and led 89-86 entering the fourth.\n\nPhiladelphia shot 60 percent in the third quarter, hitting five 3-pointers, and led 89-86 entering the final quarter.\n\nIt stayed tight through the end of the fourth. Chandler got open for a 3-pointer with 37 seconds left and the Sixers led 108-106, then Irving pulled up for a 13-foot jumper to tie it at 108 with 20 seconds left.\n\nRedick missed a jumper just before the buzzer and the game went into OT.\n\nGETTING BETTER\n\nThe Sixers-Celtics rivalry isn't quite back to where it once was, but it is getting closer. Boston beat Philadelphia 4-1 in the second round of the playoffs last season and won the first two meetings this season, although the Sixers had not yet picked up Butler in a trade with Minnesota before Boston's 105-87 win on Oct. 16.\n\nThe next two meetings are in Philadelphia.\n\n\"Obviously those guys have gotten better. It's definitely tougher -- no question,\" Horford said.\n\nCLUTCH KYRIE\n\nIrving said Butler had him covered well and forced him to put some extra arch on his game-tying fadeaway at the end of the fourth.\n\nButler agreed.\n\n\"He hit a tough shot. That's what he does. That's why he is the player that he is,\" Butler said.\n\nLACK OF OTs:\n\nThis was only the second game on Christmas Day since 2004 that went to overtime. Miami's win over New Orleans in 2015 was the only other one.\n\nTIP-INS:\n\n76ers: Wilson Chandler returned after missing Saturday's win over Toronto with a left quad contusion. He finished with 15 points . Philadelphia reserves did not score a point in the first half. . Redick got a technical after he was called for a foul with 7:32 left in the third. Irving made the free throw to put Boston up 70-63. ... G Markelle Fultz traveled with the team but did not dress. Fultz, the No. 1 overall pick in the 2017 draft, has missed the last 15 games with thoracic outlet syndrome.\n\nCeltics: Irving had 16 points and five rebounds in the first quarter. ... C Aron Baynes (broken finger) missed his third straight game. . Horford's minutes restriction was increased from 20 to 25 minutes in his second game back since missing seven in a row with a sore left knee.\n\nUP NEXT:\n\n76ers: At Utah on Thursday night.\n\nCeltics: Visit Houston on Thursday night, the first of three straight on the road.",
  "source": "espn_api",
  "crawled_at": 1764994043.57679
}