{
  "game_id": "0021500451",
  "espn_id": "400828338",
  "date": "Dec 26, 2015",
  "matchup": "PHX vs. PHI",
  "headline": "Lowly 76ers beat Suns 111-104 for second win of season",
  "body": "PHOENIX -- Ish Smith was just traded from New Orleans to Philadelphia, so he knows each win is special. And this one came against one of his former teams.\nSmith scored 14 points in the first game of his second stint with the lowly 76ers, who beat the Phoenix Suns 111-104 on Saturday night for just their second win of the season.\n\"I didn't come from a situation where we were winning a lot in New Orleans, either,\" Smith said. \"For me a win is a win and we have to keep coming closer together, through wins, through losses. If we do that, we will put us in a good position to win games.\"\nSmith, who played 25 games for Philadelphia last season and averaged 12 points and six assists, got the start and was 6 for 15 from the floor. He was acquired in a trade with the Pelicans on Christmas Eve.\nIsaiah Canaan scored 22 points and reserve Nik Stauskas had 17 for the 76ers, who went 12 for 27 from 3-point range. Carl Landry added 16 points, and Nerlens Noel added 14 points and 11 rebounds.\nPhiladelphia (2-30) snapped a 12-game losing streak with its first win since Dec. 1. The Sixers also stopped a 23-game road slide dating to last season.\nThe Suns lost leading scorer Eric Bledsoe to a sprained left knee in the first half. Coach Jeff Hornacek said Bledsoe had already left the arena for an MRI after the game but added team doctors didn't think it was a torn ACL.\nBrandon Knight led Phoenix with 21 points. Rookie Devin Booker scored a career-high 19 points, and Jon Leuer had 14 points and nine rebounds. The Suns have lost four in a row and six of seven.\nBledsoe got hurt with 7:40 left in the second quarter and had to be helped to the locker room. He entered Saturday averaging 20.9 points and had four when he left the game.\n\"Said a little prayer for him and hope for the best,\" Suns guard Ronnie Price said. \"Never like to see anyone going down on any side. Whatever it is, we'll be behind him and we'll support him through it.\"\nThe Sixers built a 16-point lead in the fourth quarter. The Suns got it down to a six-point deficit twice in the last two minutes, but Philadelphia was able to hang on.\nSmith hit a 20-foot jumper for a 99-88 lead. He got a steal and fed Stauskas for a dunk, and knocked down an 18-footer to help keep the Sixers in front.\n\"Everybody can see how dynamic a player Ish is,\" Sixers coach Brett Brown said. \"Giving a player of that caliber the ball at the end of the game was great for us.\"\nPhoenix rallied in the second quarter after Bledsoe's injury, getting seven straight points from Booker to cut the Sixers' lead to 40-36. But the Suns got no closer before halftime despite Booker scoring 11 points in the quarter after not playing in the first.\nThe Suns took their first lead since a 2-0 advantage when Knight knocked down a 22-foot jumper to make it 60-58 in the third quarter.\nBut Philadelphia reclaimed the lead behind Stauskas, who hit two key 3-pointers and a long jumper, the last bucket with 40 seconds left in the third. Kendall Marshall made a 3 with 0.9 seconds to go, giving the Sixers an 85-75 lead going into the fourth quarter.\nThe Suns (12-20) were left searching for answers after a loss to the team with the NBA's worst record.\n\"Obviously it's probably a low point for us,\" Hornacek said. \"This last stretch I think we lost a little bit of confidence. We're going to keep working and try to get to the point where we're winning some of these games.\"\nForward P.J. Tucker said it was an embarrassing loss.\n\"We're just flat-out losing games and something's got to change real quick,\" he said.\nALLEY `OOPS'\nThe Sixers got a lucky basket early in the game when Canaan attempted a lob to Noel that he couldn't catch in mid-air. The ball went off Noel's hands and the rim and bounced straight up, dropping into the net for two points.\nTIP-INS\nSixers: C Jahlil Okafor, the Sixers' leading scorer this season, sat out with right knee soreness, replaced in the starting lineup by Jerami Grant. ... The Sixers ended a streak of five straight losses to the Suns.\nSuns: F Markieff Morris served the first of his two-game suspension for conduct detrimental to the team. ... G Sonny Weems, who hadn't played since seeing six minutes of action on Dec. 16 at Golden State, had three points and three assists in 17 minutes. ... The Suns got another scare 30 seconds into the fourth quarter when Booker turned his left ankle after a shot and was helped to the bench. After a quick examination during a timeout he came back into the game.\nUP NEXT\n76ers: At Utah on Monday night.\nSuns: Host Cleveland on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994862.4031832
}