{
  "game_id": "0021500273",
  "espn_id": "400828160",
  "date": "Dec 02, 2015",
  "matchup": "CHI vs. DEN",
  "headline": "Gasol has double-double as Bulls beat Nuggets 99-90",
  "body": "CHICAGO -- Coming off an emotional win two nights earlier, facing the slumping Denver Nuggets had the makings of a trap game for Chicago. Thanks to Pau Gasol, the Bulls came out with another win.\nGasol had 26 points and 19 rebounds to lead Chicago to a 99-90 win over the Nuggets on Wednesday night. Gasol shot 12 for 19 from the field and had his fifth consecutive double-double as the Bulls, who beat San Antonio on Monday night, won for the third time in four games and improved to 7-1 at home.\n\"This is the type of game that you play against a team that has lost seven in a row and you think that you're going to probably win the game and it's not going to require your maximum effort,\" Gasol said. \"Sometimes teams do fall into that trap and for parts of the game we kind of were in that place, but I think we snapped out of it well and with enough time on the clock that we could make a run and win the game.\"\n\nThe Nuggets, who finished shooting 39 percent from the field, led 72-68 heading to the fourth quarter after limiting Chicago to 17 points in the third. Chicago regained the lead for good at 82-79 with 7:37 left on Doug McDermott's 3-pointer, and handed the Nuggets their eighth straight loss.\n\"I think tonight we hurt ourselves,\" Denver's Randy Foye said.\nThe Nuggets fell behind by eight but cut the lead to four on J.J. Hickson's dunk with 2:22 left. Chicago then rebuilt its lead and salvaged the win after outscoring the Nuggets 31-18 during the fourth, including 12 from Gasol.\n\"(Pau) did everything for us tonight when it wasn't our best energy game of the season,\" Bulls coach Fred Hoiberg said.\nJimmy Butler, playing through a lingering right heel contusion, scored 19 points in 39 minutes and Derrick Rose finished with 12 points on 3-for-17 shooting.\nWill Barton scored 16 points and Kenneth Faried had 14 points and nine rebounds for Denver, which was outrebounded 62-49, allowed 30 second-chance points and went 13 for 22 from the free-throw line.\n\"You give a team 30 points off offensive rebounds then you miss nine free throws in a close game, you're going to make it hard on yourself to pull that game out,\" Denver coach Michael Malone said.\nJoakim Noah came off the bench and added nine points and 11 rebounds for the Bulls, who played most of the game without Nikola Mirotic after he suffered a concussion and facial laceration during the first quarter. Mirotic was defending in the lane when he took an inadvertent right elbow to the face from a driving Emmanuel Mudiay, sending him to the floor.\nMirotic, who had three points and two rebounds, left the game immediately and went to the locker room for observation where he received stitches.\nDERRICK AND CAL\nKentucky's John Calipari, who coached Rose in college at Memphis, said on a national radio show that Rose doesn't have a high pain threshold. If he was bothered by that comment, Rose didn't say.\n\"He's like a father figure to me. I talk to Cal at least twice a month,\" Rose said. \"To hear that from him is nothing. It's nothing at all.\"\nROOKIE MOVES\nMalone is optimistic about the play of his two rookies. Nikola Jokic is averaging 7.7 points and 4.9 rebounds per game at center, while Mudiay is averaging 11.7 points.\nTIP-INS\nNuggets: Gary Harris (concussion) didn't play. ... Denver also dropped its fourth straight on the road. ... Five Nuggets scored in double figures.\nBulls: Kirk Hinrich (left hip pointer) didn't play. Aaron Brooks (left hamstring) was a game-time decision but played nine minutes. ... Butler had a steal to extend his streak with at least one to 24 games, the longest active in the NBA.\nUP NEXT\nNuggets: At Toronto on Thursday.\nBulls: Host Charlotte on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993966.265374
}