{
  "game_id": "0022200900",
  "espn_id": "401469055",
  "date": "Feb 24, 2023",
  "matchup": "CHI vs. BKN",
  "headline": "LaVine, DeRozan lead Bulls to 131-87 rout of Nets",
  "body": "CHICAGO -- — Zach LaVine scored 32 points on 12-of-17 shooting and the Chicago Bulls drubbed the Brooklyn Nets 131-87 on Friday night to snap a six-game skid.\n\n\r\n              Chicago held Brooklyn to a season low in points; its previous worst was 92 in a loss to Boston in December. The Nets lost by their biggest margin this season, one point worse than a defeat by the Celtics on Feb. 1.\n\n\r\n              Nikola Vucevic and Andre Drummond each had 13 points and 10 rebounds for the Bulls. All-Star DeMar DeRozan and Patrick Williams each scored 17 points.\n\n\r\n              The Bulls, who moved within 1 1/2 games of 10th place and the final play-in spot in Eastern Conference, stormed ahead early and never slowed down.\n\n\r\n              “I think that's what we have to do from here on out and throw everything at these last 22 games because we understand where we are,\" LaVine said. “We have to put that type of energy into it.”\n\n\r\n              The Bulls opened a 101-51 lead early in the fourth quarter.\n\n\r\n              “I thought collectively as a group, the group was pretty connected on both ends with the way they played,” Chicago coach Billy Donovan said.\n\n\r\n              Cam Thomas came off the bench to lead the Nets with 22 points. Seth Curry had 19 and Mikal Bridges scored 13.\n\n\r\n              Bridges, Cameron Johnson, Spencer Dinwiddie and Dorian Finney-Smith are trying to integrate as starters for the Nets, who acquired them earlier this month in the trades of All-Stars Kevin Durant and Kyrie Irving.\n\n\r\n              “We really have to be the hardest-playing team in the NBA,” Brooklyn coach Jacque Vaughn said. “When we don't, this can happen.\n\n\r\n              “I'm going to continue to challenge our guys that this is unacceptable as a group. I want them to own it and respond.”\n\n\r\n              The Bulls scored the first 11 points, built a 34-point lead at the half and thoroughly dominated the sloppy and cold-shooting Nets in the first game for both teams since the All-Star break.\n\n\r\n              \"I thought our effort to get out there and contest and challenge shots and try to make it difficult was good,\" Donovan said. “I thought the group that started the game was really good.”\n\n\r\n              The Bulls outshot the Nets 56.8% to 37% from the floor, dominated in the paint and out-rebounded them 57-31. Brooklyn, which has lost three of four, committed 13 turnovers and Chicago had six steals to fuel a wave of fast breaks.\n\n\r\n              DeRozan started after missing last two games with right quadriceps strain and was able to rest down the stretch. He scored eight points for Team Giannis in the All-Star Game last Sunday.\n\n\r\n              The Bulls led 63-29 in at the half, holding Brooklyn to its lowest output in a half this season and its worst-scoring quarter, 11 points in the second.\n\n\r\n              BEVERLEY COMES HOME\n\n\r\n              Veteran point guard Patrick Beverley scored eight points in his Bulls debut. The Chicago native was signed on Tuesday to help solidify the position with Lonzo Ball out for the season because of lingering discomfort in his surgically repaired left knee, and Donovan chose to start him.\n\n\r\n              “I thought maybe we needed a different energy, try to switch things up,” Donovan said. “I thought our team needed a jolt, so to speak.”\n\n\r\n              Beverley is a three-time All-NBA Defensive Team selection. He averaged 6.4 points in 45 games for the Lakers this season before getting dealt to Orlando, which waived him.\n\n\r\n              VAUGHN IN CHARGE\n\n\r\n              It was Vaughn’s first game since the team gave him a multi-year contract extension on Tuesday. He took over early this season after the Nets fired Steve Nash.\n\n\r\n              TIP-INS\n\n\r\n              Nets: G Ben Simmons missed the game and will sit out at least one more with left knee soreness. Simmons had practiced the last two days, but Vaughn said the team decided to put him “in a strengthening phase” to avoid a reoccurrence.\n\n\r\n              Bulls: G Goran Dragic sat out his third game with a left knee injury.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Atlanta on Sunday.\n\n\r\n              Bulls: Host Washington on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994476.844139
}