{
  "game_id": "0021900477",
  "espn_id": "401161119",
  "date": "Dec 28, 2019",
  "matchup": "CHI vs. ATL",
  "headline": "Lauri Markkanen scores 25 points, Bulls rout Hawks 116-81",
  "body": "CHICAGO --  Aside from the lingering effects of an illness, Lauri Markkanen was feeling just fine Saturday night.\n\nIt's a far cry from early in the season when the third-year forward was struggling to find his comfort level in a new offensive system.\n\nMarkkanen had 25 points, Zach LaVine added 19 and the Chicago Bulls nearly led wire-to-wire in a 116-81 victory over the short-handed Atlanta Hawks.\n\nBattling an illness and questionable until a few hours before the game, Markkanen was 8 for 14 from the field, making 4 of 9 3-pointers.\n\n\"I think he's starting to learn how we play, where he can get his shots,\" Bulls coach Jim Boylen said. \"We've been coaching him on getting ahead of the ball and being more active, and I think he's done it.\"\n\nAfter spending much of the previous two days in bed, Markkanen said he knew he could play after getting up and walking around in the afternoon.\n\n\"He looked fine to me,\" LaVine said. \"If he's gonna play like that, I think he should be sick more often. Once he knocked down the first couple, you have to look for him because we need to get in that rhythm.\"\n\nRookie Coby White had 18 points for Chicago. The Bulls have has won three of four.\n\nJohn Collins had 34 points for the NBA-worst Hawks. They have dropped 10 straight for the second time this season. Collins was playing his third game following a 25-game suspension for violating the league's doping policy.\n\nThe Hawks played without scoring leader Trae Young. He didn't make the trip after spraining his right ankle in the second quarter Friday night in a home loss to Milwaukee.\n\n\"The head of the snake is off,\" Collins said referring to Young. \"He brings all the pop, the swagger. Missed him tonight, for sure.\"\n\nThe Bulls sweep the three-game season series between the teams, winning all three by at least 20 points.\n\n\"Another rough night in Chicago,\" Hawks coach Lloyd Pierce said. \"Another back-to-back where we just didn't have it.\"\n\nAtlanta scored the first two baskets for a 4-0 lead, but Chicago answered with 14 straight points. Markkanen had seven points during the run and capped it off with a 3-pointer for the 14-4 advantage.\n\nThe Bulls led 35-19 at the end of the first quarter and increased it to 64-43 at halftime. Markkanen and LaVine combined for 31 points on 14-for-24 shooting, including 6 for 10 on 3-pointers.\n\nChicago led 83-65 after three quarters. White then opened the fourth with five quick points for an 88-65 edge.\n\n\"I know where I'm gonna get my touches and shots,\" Markkanen said. \"It's the same guys, the same system. Obviously, we work on it every day, so it has to become more comfortable.\n\n\"I think everyone is figuring out their role and doing a good job of it.\"\n\nTIP-INS\n\nHawks: Pierce said Young was feeling better Saturday, but he had no idea how long the second-year guard would be sidelined ... F Jabari Parker, a Chicago native and former Bull, missed his second straight game with a right shoulder impingement ... Alex Len returned after missing Friday's game with a sprained left ankle. He finished with 10 points in 20 minutes.\n\nBulls: C Wendell Carter Jr. was 2 for 3 on 3-pointers in the game. Before Saturday, he was 3 for 19 from behind the arc ... Chicago was 26 for 42 from the field in the first half, including 8 for 15 on 3-pointers.\n\nCARTER TRIBUTE\n\nThe United Center P.A. announcer gave Atlanta guard Vince Carter a special introduction when he entered the game midway through the first quarter. The scoreboard also showed a graphic listing a few of Carter's accomplishments during his 22 seasons in the NBA.\n\nBarring a trade, this was Carter's final regular-season game in Chicago. He received a loud ovation when he exited the game for the final time with under two minutes left.\n\nMOVING UP IN CLASS\n\nAfter facing the worst team in the league, the Bulls host the Milwaukee Bucks, Utah Jazz and Boston Celtics in three home games next week.\n\nUP NEXT\n\nHawks: At Orlando on Monday night.\n\nBulls: Host Milwaukee on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996351.3699331
}