{
  "game_id": "0022201216",
  "espn_id": "401469371",
  "date": "Apr 09, 2023",
  "matchup": "BOS vs. ATL",
  "headline": "Pritchard's triple-double leads Celtics past Hawks, 120-114",
  "body": "BOSTON -- — Payton Pritchard finished with his first career triple-double with 30 points, 14 rebounds and 11 assists and the Boston Celtics beat the Atlanta Hawks 120-114 on Sunday in a matchup of mostly reserves in the regular-season finale for both teams.\n\n\r\n              Derrick White was the only regular starter to play for Boston. In his 82nd game and starting for the 70th time, he played five minutes, going 1 of 2 on 3-point attempts.\n\n\r\n              De’Andre Hunter was the only starter to play for Atlanta, scoring 14 points.\n\n\r\n              Pritchard completed his triple-double with an assist on JD Davidson’s basket with just under eight minutes left. The crowd gave him a big hand when they showed Pritchard’s stat line on the video board.\n\n\r\n              He became just the third player in team history to reach 30 points, with 14 rebounds and 11 assists in a game, joining Hall of Famers Larry Bird and John Havlicek. \n\n\r\n              “Special crew to be a part of,” Pritchard said. “Definitely feel honored. ... It's an opportunity for me to go out and play and show what I'm capable of.” \n\n\r\n              Boston went 25 of 54 on 3-point attempts. Pritchard connected on 9 of 16, Mike Muscala went 4-for-7 on 3s and finished with 27 points and Sam Hauser was 8 of 14 on 3s with 26 points.\n\n\r\n              “The way his career has gone as far as playing time and not playing time, he's always handled it the right way,” Boston coach Joe Mazzulla said of Pritchard. “He has a competitiveness, a professionalism and work ethic about him.” \n\n\r\n              Garrison Mathews and Bruno Fernando led the Hawks with 19 points apiece.\n\n\r\n              Locked into the Eastern Conference’s eighth seed, the Hawks (41-41) will be at the Miami Heat on Tuesday in a play-in game.\n\n\r\n              “Our focus needs to go immediately to Miami and what we need to do to prepare for that game,” Hawks coach Quin Snyder said.\n\n\r\n              Coming off last season’s run to the NBA Finals where they lost to Golden State in six games, Boston, the East’s No. 2 seed, will face the winner of the Heat-Hawks series in the opening round.\n\n\r\n              The Celtics (57-25) sat usual starters Jayson Tatum, the team’s leading scorer at 30.1 points per game, Al Horford, Jaylen Brown (cut finger) and Marcus Smart. Also out were key reserves Malcolm Brogdon (lower back pain) and Robert Williams III.\n\n\r\n              Tatum finished the season as the first player in Celtics history to average 30 points per game in a season. Bird held the previous single-season record, averaging 29.9 points in 1987-88.\n\n\r\n              The Hawks played without their leading scorer Trae Young (right groin soreness), Dejounte Murray (sore left ankle), Clint Capela (right calf tightness), John Collins (tight lower back) and Bogdan Bogdanovic (sore right knee).\n\n\r\n              SPECIAL GUESTS \n\n\r\n              The Celtics hosted the family of former player and coach K.C. Jones, who died Dec. 25, 2020, at 88. The Hall of Famer was a part of eight Celtics’ titles in his first nine seasons of his career. He also coached the team when it won the 1984 and ’86 titles.\n\n\r\n              OOPS\n\n\r\n              For a few seconds, the scoreboard listed “Krejci” in the game for the Hawks. “Krejci”, is David Krejci, who plays for the Boston Bruins. They quickly changed it to “Bey” for Atlanta forward Saddiq Bey. \n\n\r\n              TIP-INS\n\n\r\n              Hawks: Young finished the regular season averaging a team-leading 26.2 points per game with 10.2 assists, and Capela was their rebounding leader at 11.0 per game. \n\n\r\n              Celtics: All 11 of their initial shots (six made) were from 3-point range. … They had 43 3-point attempts, making 21, after three quarters. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Miami in a play-in game on Tuesday.\n\n\r\n              Celtics: Face the Heat-Hawks winner in their opening-round series. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995163.864287
}