{
  "game_id": "0021800970",
  "espn_id": "401071643",
  "date": "Mar 06, 2019",
  "matchup": "PHI @ CHI",
  "headline": "LaVine scores 39, Bulls beat 76ers 108-107",
  "body": "CHICAGO --  Otto Porter Jr. was already in \"midstride\" taking a drug test when the Chicago Bulls got the word.\n\nThe game wasn't over, after all.\n\nWhile Porter remained in the back, the Bulls returned for one final play and preserved the victory they thought they had already secured.\n\nZach LaVine scored 39 points and hit the go-ahead layup in the closing seconds, and Chicago beat the Philadelphia 76ers 108-107 on Wednesday night in a game that featured two endings .\n\nLaVine scored 13 in the fourth quarter as the Bulls wiped out a 10-point deficit on their way to a victory they sure won't forget. Both teams were ordered back to the court as fans filed out of the arena because of a timekeeping error that led to a premature buzzer.\n\nBut by the time word got to Porter, it was too late.\n\n\"People were looking for me,\" he said. \"They couldn't find me. And then finally found me. By that time, it was too late. I grabbed my jersey, about to run out. Then, I looked and just turned right back around and finished the process.\"\n\nThe Bulls trailed 107-106 after Jimmy Butler hit two free throws for Philadelphia with 4.8 seconds remaining. After a timeout, LaVine inbounded to Robin Lopez and got fouled as he went past Mike Scott for the go-ahead layup with 1.6 seconds remaining.\n\nLaVine missed the free throw, but the Bulls came away with the win after one more twist. He broke up Ben Simmons' inbounds pass to Butler underneath the 76ers' basket, and that's when things really took an unusual turn.\n\nBoth teams walked off the court and fans started to file out. The problem was, the horn sounded before anyone touched the ball.\n\nAfter a review, the referees put 0.5 seconds back on the clock. But with one more chance, Philadelphia came up short when the inbounds pass skipped off Butler's hands.\n\n\"It was like losing twice,\" the Sixers' Tobias Harris said.\n\nPorter, meanwhile, couldn't remember being tested so soon after walking off the court. Wayne Selden subbed in for him on that final play, and the Bulls had a few laughs afterward.\n\nCoach Jim Boylen revealed during his postgame media session that Porter was being tested. He also vowed to take the \"clock guys\" to dinner, even though Philadelphia got a second chance.\n\n\"Our table started the clock early. That's like Utah in the old days,\" said Boylen, who coached the Utes from 2007-11. \"They did that all the time and got away with it. You know that. I'm taking our clock guys to dinner. That's how it's supposed to be, baby.\"\n\nButler scored 22 points in his second game against his former team. Simmons had 18 points, 11 rebounds and seven assists. But the 76ers fell a game behind Toronto for third place in the Eastern Conference. They are 4-3 since the All-Star break, with All-Star center Joel Embiid sidelined by a sore left knee.\n\nLaVine made 14 of 26 shots. Lopez added 19 points as the Bulls snapped a two-game skid.\n\n\"We didn't do what we were supposed to do down the stretch,\" Butler said. \"Then we got comfortable a little bit. We got away from what we said we were going to do and once again, the Bulls did a good job.\"\n\nTIP-INS\n\n76ers: Coach Brett Brown said the 76ers have not made a decision on Embiid's status for Friday's game at Houston. The 7-footer did not travel with the team. \"We've come this far in relation to rest after the All-Star break that, personally, I'm at a stage that if it requires more time, so be it,\" Brown said. \"The end game is obvious. It's trying to deliver him to the playoffs healthy. I do look up from time to time and pay attention to the NBA calendar and it's not like you have an abundance of time. But that is insignificant compared to what is most important, and that is getting him healthy, getting the spirit right and him healthy.\"\n\nBulls: Lauri Markkanen picked up two fouls in the first two minutes of the game and finished with 11 points. ... The Bulls were 6 of 23 on 3-pointers.\n\nUP NEXT\n\n76ers: Visit Houston on Friday.\n\nBulls: Host Detroit on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994003.889827
}