{
  "game_id": "0021900451",
  "espn_id": "401161093",
  "date": "Dec 23, 2019",
  "matchup": "PHX vs. DEN",
  "headline": "Murray's clutch shooting lifts Nuggets over Suns 113-111",
  "body": "PHOENIX --  Jamal Murray shot fearlessly in the final seconds, with only one thought on his mind: winning.\n\nDenver's been doing a lot of that lately.\n\n“I was just in a zone, not thinking about anything really,” Murray said. “Just in a zone. Everybody was locked in.”\n\nMurray made a tiebreaking jumper with 3.2 seconds left, Nikola Jokic finished with a triple-double and the Nuggets rallied for a 113-111 victory over the Phoenix Suns on Monday night.\n\nMurray finished with 28 points on 12-of-19 shooting from the field, including 4 of 8 shooting on 3-pointers. Jokic had 22 points, 12 rebounds and 10 assists for his seventh triple-double of this season.\n\nThe Nuggets extended their winning streak to seven games while the Suns have lost seven in row.\n\nThe teams traded clutch shots in the final moments. First it was Murray who hit a 3-pointer with 27 seconds left to push Denver ahead 111-108. Two seconds later, Devin Booker nailed a 3-pointer off an inbounds play to tie it.\n\nMurray had one more big shot in him, making a jumper just inside the 3-point line with 3.2 seconds left to give the Nuggets a 113-111 lead. Booker had a 3-point attempt blocked by Jerami Grant just before the final buzzer.\n\n“Down the stretch, (Murray) was phenomenal,” Denver coach Michael Malone said. “This wasn't our best game, but when you don't play your best on the road, you have to find ways and that is what I'm proud about.”\n\nThe Suns trailed for most of the night, falling behind by 16 points in the second quarter, but slowly fought their way back.\n\nThe Nuggets hit 12 of their first 17 3-point attempts but finally cooled off midway through the third quarter and missed their next seven from long range. That allowed Phoenix to make a push and Frank Kaminsky's short jumper early in the fourth quarter gave the Suns an 83-82 lead, their first since the first quarter.\n\nRookie Cameron Johnson hit two 3-pointers in a row -- one on a bank shot -- to put the Suns ahead 91-88 with about 9 minutes left in the game. Phoenix pushed that advantage to 101-92 but Denver rallied to tie it at 108 with 2 minutes left on Jokic's 3-pointer.\n\nThe Suns haven't won a game in two weeks and this one hurt more than most.\n\n“That was a tough one,” Johnson said. “I felt like we had a lot of momentum going into that fourth quarter, halfway through and that's a tough one. I really though we were going to pull that one out.”\n\nRicky Rubio scored 21 points for the Suns. Eight Phoenix players scored in double figures, but it wasn't enough to snap its lengthy losing streak.\n\n“It's the deep hurt that allows you to grow,” Suns coach Monty Williams said. “It's a life principle, and certainly in sports. We have to start closing these games out. I thought some of our possessions, we just missed shots or made passes that just weren't there. Five minutes to go in the game, that's a playoff game and everything has to be executed well.”\n\nDenver jumped out to a 34-22 by the end of the first quarter after shooting 67 percent from the field but the Suns were able to cut the deficit to 56-49 by halftime.\n\nMurray had 10 points in the first half. Rubio had 16 before the break on 7-of-10 shooting from the field.\n\nTIP-INS\n\nNuggets: Denver was playing its third game in four days. ... The Nuggets hit 10 of 15 3-pointers in the first half. ... The Nuggets improve their record to 21-9, matching last season and the 1976-77 season for the best 30-game start in the franchise's NBA history.\n\nSuns: Starting center Deandre Ayton missed a third straight game because of a sprained ankle. He's played in just two out of the team's first 30 games. ... Rubio returned to the starting lineup after missing Saturday's game against the Rockets because of an illness. ... The Suns fell to 1-6 this season in one-possession games.\n\nUP NEXT\n\nNuggets: Host the Pelicans on Wednesday.\n\nSuns: Travel to face Golden State on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996571.626472
}