{
  "game_id": "0022401153",
  "espn_id": "401705719",
  "date": "Apr 08, 2025",
  "matchup": "OKC vs. LAL",
  "headline": "Gilgeous-Alexander scores 42 as NBA-leading Thunder top Lakers 136-120 after Doncic ejection",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 42 points, and the Oklahoma City Thunder beat the Los Angeles Lakers 136-120 on Tuesday night after Luka Doncic was ejected.\n\n\r\n              Doncic scored 23 points before leaving the game in the fourth quarter following his second technical foul. The Thunder outscored the Lakers 29-12 the rest of the way.\n\n\r\n              Jalen Williams added 26 points for the Thunder, who bounced back from a 126-99 loss to the Lakers on Sunday.\n\n\r\n              Oklahoma City (65-14) inched closer to clinching the best record in the league and homecourt advantage throughout the playoffs. The Thunder have a two-game lead on the Cleveland Cavaliers with three games remaining. The team set a single-season franchise record for victories, surpassing the 1995-96 Seattle squad that went 64-18.\n\n\r\n              LeBron James scored 28 points and Austin Reaves added 24 for the Lakers.\n\n\r\n              Los Angeles is at Dallas on Wednesday in Doncic’s first game against the Mavericks since being traded to the Lakers for Anthony Davis on Feb. 2.\n\n\r\n              The Thunder led 80-72 at halftime after shooting 64.7% from the field. It matched the fourth-highest point total for an Oklahoma City team in a half. \n\n\r\n              The Lakers rallied, and a deep 3-pointer by Doncic put the Lakers ahead 88-86 with about five minutes left in the third. The Lakers took a 98-97 lead into the fourth.\n\n\r\n              Takeaways\r\n              Lakers: Will need to occasionally get over some of Doncic's antics if they are to make a deep playoff run.\n\n\r\n              Thunder: Was dominant when pushing the pace. The Thunder ran the whole first half, then allowed the Lakers to slow the game down in the third before cranking it up again in the fourth. \n\n\r\n              Key mome\r\n              nt\r\n              Gilgeous-Alexander hit a step-back 3-pointer to give the Thunder a 117-112 lead with about six minutes left.\n\n\r\n              Key stat\r\n              The Thunder shot 50% from the field.\n\n\r\n              Up next\r\n              The Lakers visit Dallas on Wednesday. The Thunder visit Phoenix on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997492.778711
}