{
  "game_id": "0021800991",
  "espn_id": "401071664",
  "date": "Mar 09, 2019",
  "matchup": "PHX @ POR",
  "headline": "McCollum has 26 points, Blazers beat Suns 127-120",
  "body": "PORTLAND, Ore. --  It didn't matter to CJ McCollum that the Trail Blazers were expected to beat the Phoenix Suns, winners of just 15 games this season.\n\nMcCollum scored 26 points and the Portland snapped the Suns' three-game winning streak with a 127-120 victory Saturday night.\n\n\"I just go out there and hoop, man,\" McCollum said. \"I don't worry about who we're playing against. They have some very capable players, they've got guys who are capable of winning the game and beating you by themselves. So you've got to be ready to play.\"\n\nSeth Curry had 22 points off the bench, while Damian Lillard had 18 points and nine assists. The Blazers, who had lost three of their previous four games as they jockey for playoff position in the Western Conference, led by as many as 29 points.\n\nDevin Booker led the Suns with 23 points.\n\n\"For us, it's a learning experience,\" Suns coach Igor Kokoskov said. \"We need everything a little more -- a little more discipline, a little more execution on both sides of the court.\"\n\nAfter the Blazers built a 111-89 lead in the final quarter, the Moda Center fans started heading for the exits. McCollum was the only starter who played in the fourth, and he headed to the bench with 5:25 left.\n\nJamal Crawford pulled Phoenix to within five at 123-118 with a 3-pointer with 10.5 seconds left, but the rally fell short. It was Portland's 10th straight victory over the Suns.\n\nBlazers coach Terry Stotts joked afterward: \"I'll talk about anything but the fourth quarter.\"\n\nBut he suggested it was good to get some of the lesser-used players some experience. The Suns outscored Portland 43-25 in the final period.\n\n\"Honestly, honestly, I mean we got beat by 18 in the fourth quarter, but it was good for those guys to get minutes,\" Stotts said. \"Meyers (Leonard) hasn't played in a while and he got some good minutes. Anfernee (Simons) got a lot, Seth (Curry) and Jake (Layman) played the whole fourth quarter. So not necessarily looking forward, but just from a maintenance standpoint, for them to get 12 straight minutes, it was good for them.\"\n\nThe Blazers (40-26) were coming off a wild overtime loss to the Oklahoma City Thunder on Thursday night, their first game home following a 5-2 road trip. Jusuf Nurkic got a second technical in the final minute of regulation and had to sit out of the extra period, and Portland lost 129-121.\n\nThe loss dropped the Blazers to fifth in the Western Conference standings behind the Thunder.\n\nThe Suns (15-52) sit at the bottom of the conference standings with the second-worst record in the league.\n\nTied at 25 early in the second quarter, the Blazers started to pull away. A dunk from Maurice Harkless put Portland up 49-36 and the Blazers went on to lead 66-47 at halftime. Portland had 42 points in the second quarter to tie a season high for the period.\n\nWith four 3-pointers early in the second half, Portland extended the lead to 80-56. Portland went up 102-77 to end the third quarter, capped by Anfernee Simons' 3-pointer. It was his first NBA 3.\n\nBooker, who had 41 points Wednesday in a 107-96 victory over the Knicks, had 14 points in the third quarter alone.\n\nKokoskov said the Suns had targeted McCollum, aware of his success beyond the perimeter and with mid-range contested shots.\n\n\"Based on the analytics, we were trying to take away those wide-open 3s, protect the rim and live with those contested 2s. But again, he's one of the best in the business,\" Kokoskov said.\n\nNurkic had 14 points and nine rebounds for Portland.\n\nTIP INS:\n\nSuns: Deandre Ayton had 12 points in the opening half, giving him 1,001 points in his 61st game. Only two Suns have reached 1,000 in fewer than 61: Walter Davis (43rd game) and Alvan Adams (53rd). ... The Suns haven't won at the Moda Center since Oct. 31, 2015.\n\nTrail Blazers: In the big second quarter, Portland outscored the Suns 42-24. ... Rodney Hood left the game with right hip soreness.\n\nKANTER SUPPORT: Blazers center Enes Kanter gained a supporter this week when Oregon Congressman Ron Wyden urged Secretary of State Mike Pompeo to tell Turkish leaders that retribution against Kanter for his criticism of their government is \"unacceptable.\"\n\nKanter, who has been outspoken in his disapproval of Turkish President Recep Tayyip Erdogan, did not travel with the Blazers to Toronto while on the road trip, fearing reprisal. Kanter's Turkish passport has been revoked.\n\n\"America cannot and must not stay silent in the face of such a blatant assault on free thought and expression,\" Wyden said in a statement.\n\nUP NEXT:\n\nThe Suns visit Golden State on Sunday.\n\nThe Trail Blazers visit the Los Angeles Clippers on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995054.6826482
}