{
  "game_id": "0022300257",
  "espn_id": "401584885",
  "date": "Nov 27, 2023",
  "matchup": "DEN @ LAC",
  "headline": "Former Clippers Jackson and Jordan carry Nuggets past Los Angeles 113-104 without Jokic",
  "body": "LOS ANGELES -- — The Denver Nuggets were undermanned, on the road and playing the second night of a back-to-back without Nikola Jokic.\n\n\r\n              Tell that to Reggie Jackson and DeAndre Jordan, a couple of former Clippers who light up when facing their former team.\n\n\r\n              Jackson had 35 points and 13 assists, and Jordan added 21 points and 13 rebounds in the Nuggets' 113-104 victory over Los Angeles on Monday night.\n\n\r\n              “Definitely one of the sweeter ones,” Jackson said. “We got our main guys out and it was really great for the team, a resilient group, the way we came together. I was just proud of the way we kept battling.” \n\n\r\n              Jackson and Jordan ran the pick-and-roll to near perfection, with Jordan soaring above the rim for vicious dunks.\n\n\r\n              “I might have been the one that was the recipient of the points,” Jackson said, “but my old head DJ getting on the rim, being back in this building looking like young Lob City a little bit. He drew all the defense in and everybody was open on the weak side.”\n\n\r\n              The duo combined for 20 points in the fourth, when the Nuggets trailed by 11 to start. Jackson began and ended a 22-6 spurt with 3-pointers that put the Nuggets ahead 99-94. In between, he fed Jordan for two slams.\n\n\r\n              “Tonight the lob was there. We made them pay on different things,” Jordan said. \n\n\r\n              The Nuggets were missing starters Jokic, Jamal Murray and Aaron Gordon, who average a combined 58.2 points. Jokic sat out the second game of a back-to-back because of low back pain. Murray has a right hamstring strain and Gordon has a right heel strain.\n\n\r\n              “When you can win games like this with some of your best players out, that speaks to your depth but also the belief in one another,” Nuggets coach Michael Malone said. “Tonight was special.”\n\n\r\n              Kawhi Leonard led the Clippers with 31 points and Ivica Zubac had 23 points and 14 rebounds. Paul George picked up his fourth and fifth fouls early in the fourth. He finished with six points on 2-of-13 shooting.\n\n\r\n              “It's a frustrating loss,” George said. “The guys stepped up over there, but a lot of the stuff we could have prevented. I thought just the energy there wasn't well enough to compete.”\n\n\r\n              The Clippers were limited to four field goals in the fourth, when they went 8 of 12 from the free throw line. Russell Westbrook airballed a free throw with the Clippers trailing 102-98. James Harden had two turnovers in the final minutes and George shot an airball in the closing seconds as the Clippers lost their eighth in a row to the Nuggets.\n\n\r\n              “Reggie just did a great job putting pressure on in the pick-and-roll, and DeAndre is one of the best still at getting out slipping and playing above the rim. They just had it working tonight,” George said.\n\n\r\n              The defending NBA champion Nuggets improved to 4-6 on the road. \n\n\r\n              The Clippers outscored Denver 32-19 in the third. Tied 72-all, Zubac scored six in a row to spark a 17-5 run that was capped by Westbrook's four straight points and sent the Clippers into the fourth leading 88-77.\n\n\r\n              The Clippers' reserves gave them an 11-point lead to open the second. Then Jackson took over, scoring 14 points in the quarter, including a free throw that sent the Nuggets into halftime leading 58-56.\n\n\r\n              Jackson and Jordan teamed for several scores in the game, reminding the home crowd of days gone by. Jordan converted Jackson's alley-oop pass into a dunk and he scored on a reverse dunk off a feed from Jackson in the first half.\n\n\r\n              The Clippers' Norman Powell hit a free throw in the second quarter that gave him 6,000 career points.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Houston on Wednesday.\n\n\r\n              Clippers: Visit Sacramento on Wednesday to begin a two-game trip to Northern California.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996768.9699829
}