{
  "game_id": "0021800613",
  "espn_id": "401071289",
  "date": "Jan 09, 2019",
  "matchup": "PHX @ DAL",
  "headline": "Doncic scores 30 points, Mavs end skid against Suns",
  "body": "DALLAS --  Luka Doncic connected on a 3-pointer to put Dallas ahead for good in the third quarter, then did a couple of other things that make the Mavericks believe they have something special in their 19-year-old rookie.\n\nFirst Doncic disrupted an attempted alley-oop for a steal before an assist on a jump-pass out of a double team from close to half court to DeAndre Jordan near the basket for a dunk to help the Mavericks take control.\n\nThe Slovenian guard scored 30 points to go with six rebounds, five assists and three steals and Dallas ended a seven-game losing streak against Phoenix with a 104-94 victory over the last-place Suns on Wednesday night.\n\n\"Luka does crazy stuff all the time,\" said Jordan, who had 11 points and seven rebounds. \"So I'm not surprised by anything he does.\"\n\nMaybe even a little too crazy at times, like the high-arching 3-point try from 32 feet -- one of a pair of a-bit-too-long attempts from deep that missed. He was an otherwise solid 8-of-14 shooting in his fourth game with at least 30 points.\n\nThe Slovenian guard still went 4 of 9 beyond the arc with a four-point play in the first half while finishing four points shy of his career high. Doncic made just 10 of his career-high 16 free-throw attempts as the Mavericks went to the line 45 times, a season high, making 32.\n\n\"He's very versatile. He's unselfish,\" said Phoenix coach Igor Kokoskov, who has coached Doncic on the Slovenian national team. \"A guy who's playmaking for his teammates and also scoring. I think his defense is getting better.\"\n\nT.J. Warren scored 20 points for the Suns, who led by eight in the first half before falling a night after ending a six-game losing streak with a 21-point rally in a 115-111 home victory over Sacramento. Scoring leader Devin Booker missed the Kings game and was out again in Dallas with back spasms.\n\nPhoenix is a combined 1-13 in back-to-back pairs -- 1-6 on the front end and 0-7 on the back. It was the Suns' first loss to Dallas since a 113-108 defeat in Mexico City almost two years ago. Two of their 10 wins this season came against Dallas at home, including the season opener.\n\nSuns rookie Deandre Ayton, drafted two spots ahead of Doncic as the No. 1 overall pick, spent the second half in foul trouble and finished with six points and five rebounds along with five fouls.\n\n\"For the first time, I think I ever, went scoreless in the first half and stuff like that just started to get to me a little bit,\" said Ayton, who was 1 of 7 from the field. \"It was just me being the bad egg today. I'm going to apologize to them about this, but yeah, it was a bad game for me.\"\n\nHarrison Barnes scored 17 points for Dallas, making all 10 of his free throws to offset 3-of-11 shooting. Wesley Matthews had 12 of his 14 points in the second half, including a banked-in 3 for a 96-84 lead with three minutes to go.\n\nTIP-INS\n\nSuns: Jamal Crawford didn't play, delaying him from becoming the 22nd player with 1,300 games for his career. ... The Suns shot 43 percent, ending a three-game streak of shooting at least 50 percent. The last four-game streak for Phoenix was in January 2015. ... Richaun Holmes had 16 points , six rebounds and five assists. Kelly Oubre Jr. scored 14 a night after matching his career high of 26.\n\nMavericks: Dirk Nowitzki was ill and missed his fourth game since his season debut at Phoenix on Dec. 13. Before setting an NBA record by appearing in his 21st season with the same franchise, the 40-year-old missed the first 26 games recovering from ankle surgery last April. ... G Dennis Smith Jr. was out with back tightness, the 13th game he's missed this season. Most were because of a right wrist sprain. ... Maxi Kleber had season highs of 13 points and nine rebounds.\n\nSTANDING ALONE\n\nDoncic is the only rookie with multiple 30-point games this season. Ayton, Jaren Jackson of Memphis (fourth pick) and Atlanta's Trae Young (fifth overall pick by Dallas in trade with Hawks) have one apiece.\n\nFOUL FEST\n\nThe Suns matched their season high with 34 fouls, the third time they've reached the mark. Two others besides Ayton had five in Josh Jackson and Elie Okobo, while guard De'Anthony Melton fouled out with 7:06 remaining. Jackson scored 17 points, but just two after halftime.\n\nUP NEXT\n\nSuns: Denver at home Saturday night before playing seven of the next nine games on the road.\n\nMavericks: At Minnesota on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995073.234574
}