{
  "game_id": "0021800827",
  "espn_id": "401071500",
  "date": "Feb 09, 2019",
  "matchup": "CHA @ ATL",
  "headline": "Walker, Williams lead Hornets past Hawks, 129-120",
  "body": "ATLANTA --  Kemba Walker loved Charlotte's quick pace to begin the game. The Hornets were moving the ball briskly to hit open shots and put the Atlanta Hawks away early.\n\n\"I think it gave us great confidence, but for the most part I thought we did a great job of just moving the basketball,\" Walker said. \"Whenever guys had two defenders on them, they got rid of it and made the right plays and the right passes to each other. We just knocked the shots down.\"\n\nWalker hit a season-high nine 3-pointers and scored 37 points, Marvin Williams added 27 points and Charlotte beat the Hawks 129-120 on Saturday night to snap a two-game skid.\n\nJeremy Lamb had 24 points to help the Hornets win for the eighth time in their last 13 games.\n\nWalker, a three-time All-Star guard, is averaging 34 points and eight assists in his last four games.\n\nJohn Collins had 21 points and Trae Young added 20 for the Hawks. They have lost four of six.\n\n\"Kemba was doing what he's done all season,\" said Young, a rookie point guard. \"I didn't do a good job on him. I don't think I did a good job of talking, getting everybody to be where they needed to be. I've got to be better at doing that on both sides of the ball.\"\n\nMiles Bridges' jumper, his sixth consecutive point, gave the Hornets their biggest lead at 19 in the final minute of the third before Devonte Graham's free throw made it 106-86.\n\nThe Hornets got off to quick start, going up 23-13 after hitting their first eight field-goal attempts, including five from 3. It was big turnaround from the end of the loss at Dallas earlier in the week when they scored just seven points on their last 14 possessions.\n\nCharlotte led 41-25 when Bridges blocked DeAndre' Bembry's dunk attempt, dribbled up the court and passed to Nicolas Batum, who assisted on Cody Zeller's layup. The Hornets' biggest advantage in the first half was 17 on Walker's 3, but the Hawks pulled within five in the final minute on Taurean Prince's 3.\n\nCharlotte stayed in seventh place in the Eastern Conference. They won the season series 3-1.\n\n\"We knew how much we needed this game,\" Williams said. \"I think everybody's jockeying for playoff position now in both conferences.\"\n\nTIP-INS\n\nHornets: G Tony Parker was sidelined by a back strain. He is listed as day-to-day, but coach James Borrego said he should return for the next two games. ... Charlotte improved to 1-8 without Parker. All the losses came on the road. ... Zeller had 10 points and eight rebounds in his first start since Dec. 31. It was Zeller's third game back since he missed 17 games with a broken bone in his shooting hand.\n\nHawks: Atlanta, rebuilding in hopes of getting a lottery pick, had no long-term answers on either end of the floor, but its defense was the biggest liability. After his team allowed 46 points in the first quarter and 73 in the first half, coach Lloyd Pierce called a timeout after his team pulled within two in third but left Lamb undefended on consecutive possessions that ended with a layup and a 3. The lead swelled to 11 a couple minutes later on Walker's 3, and Atlanta, despite pulling within eight of the lead midway through the fourth, didn't threaten again.\n\nUP NEXT\n\nHornets: At Indiana on Monday night.\n\nHawks: Host Orlando on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994369.050903
}