{
  "game_id": "0021900962",
  "espn_id": "401161604",
  "date": "Mar 10, 2020",
  "matchup": "CHI vs. CLE",
  "headline": "White scores 20, commits 9 TOs, Bulls beat Cavaliers 108-103",
  "body": "CHICAGO --  Coby White scored 20 points to help offset a career-high nine turnovers in his first NBA start, and the Chicago Bulls beat the Cleveland Cavaliers 108-103 on Tuesday night.\n\nThe Bulls won their 22nd game to match their total from last season, though they didn't think it would take this long. They expected to make a bigger jump sooner in the Eastern Conference.\n\nOne bright spot lately is White, the No. 7 overall draft pick. The rookie turned in his ninth straight game with at least 19 points.\n\n\"I thought he competed,\" coach Jim Boylen said. \"He was on (Collin) Sexton a lot. That guy's a hard guy to guard. He's fast, he's strong. I thought Coby was a two-way player tonight. I thought he showed his burst. ... That looked like Steve Francis. That's how Steve Francis used to do it -- that burst.\"\n\nWhite was \"excited\" to start.\n\n\"It was fun,\" he said. \"It's a blessing. It's a blessing to start in the NBA.\"\n\nWendell Carter Jr. chipped in with 17 points. Lauri Markkanen, Denzel Valentine and Otto Porter Jr. each scored 15. Shaquille Harrison grabbed 10 rebounds.\n\nThe Bulls outrebounded the Cavaliers 46-35 and made 12 3-pointers in holding off the Eastern Conference's last-place team. And they won for just the third time in 16 games, even though leading scorer Zach LaVine missed his fifth in a row because of a strained left quadriceps.\n\nThe Cavaliers announced a multiyear extension for coach J.B. Bickerstaff on Tuesday, then fell to 5-6 since he took over following John Beilein's resignation 54 games into his first season.\n\nCollin Sexton led Cleveland with 26 points, giving him 25 or more in seven of the past eight games. But he also had five turnovers -- two in the final 1:11.\n\nAndre Drummond scored 21, though he also gave the ball away six times. Kevin Love added 17 points despite making just 2 of 13 3-pointers. Larry Nance Jr. scored 16. But the Cavaliers came up short after winning tight games against Denver and San Antonio over the weekend.\n\nPULLING IT OUT\n\nTied at 83 early in the fourth quarter, Porter drove for a three-point play to start an 11-2 run that made it 94-85 with 6:54 remaining.\n\nPorter also hit a 3 to bump the lead to 97-87 before Cleveland's Matthew Dellavedova buried two of his own. Chicago's Thaddeus Young answered with a 3 to make it a seven-point game.\n\nThe Cavaliers hung in, with Love hitting from beyond the arc to cut it to 103-101 with 1:26 left. Carter then hit two free throws for Chicago.\n\nThe Bulls called their final two timeouts with 52 seconds remaining -- to avoid an eight-second violation and then advance the ball to halfcourt, Boylen said -- only to commit a turnover.\n\nThat led to a tip-in for Drummond. A soaring Harrison then rebounded a miss by White and hit two free throws with 13.2 seconds left to boost the Bulls' lead to 107-103.\n\n\"I know I was watching on the last play when Shaquille got the rebound,\" Sexton said. \"That probably cost us the game. When it's like that in crunch time, you have to make sure to box out.\"\n\nTIP-INS\n\nCavaliers: Bickerstaff turned 41 on Tuesday. ... The Cavaliers shot 6 of 24 on 3-pointers.\n\nBulls: LaVine hopes to return within the next few games and made it clear he does not want to be shut down for the remainder of the season. \"Just trying to find the right time to come back,\" he said. \"Obviously, I don't want to push it, come back too early and re-injure it, so it's going to be trying to find that nice balance. But I feel good right now.\" LaVine turned 25 on Tuesday. ... G Ryan Arcidiacono (right Achilles soreness) missed his third consecutive game.\n\nUP NEXT\n\nCavaliers: Visit Charlotte on Friday.\n\nBulls: Visit Orlando in Thursday.\n\n---\n\nMORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996341.332072
}