{
  "game_id": "0022000991",
  "espn_id": "401307793",
  "date": "May 05, 2021",
  "matchup": "CLE vs. POR",
  "headline": "Lilliard scores 32, Trail Blazers rout Cavaliers 141-105",
  "body": "CLEVELAND -- — Damian Lillard had 32 points and nine assists and Enes Kanter had 18 points and 13 rebounds, leading the Portland Trail Blazers to their highest point total of the season and a 141-105 rout of the Cleveland Cavaliers on Wednesday night.\n\n\r\n                    Lillard scored 16 points in the first quarter and 14 points in the third as Portland moved within one-half game of the Mavericks and Lakers for fifth place in the West. The Trail Blazers are seventh and would be the top seed in the play-in tournament.\n\n\r\n                    “We’re playing our best at the right time,” Lillard said. “We’ve had our ups and downs, but the feeling around our team is much better now. We were kind of searching for a while, but everything just clicked and came together.”\n\n\r\n                    Carmelo Anthony added 16 points off the bench, Jusuf Nurkic had 15 points, 11 rebounds and four blocks, and Canton, Ohio, native CJ McCollum scored 10.\n\n\r\n                    Portland, which has six games remaining, shot 57.6% from the field and went 5-1 on its longest road trip of the second half of the season.\n\n\r\n                    “Knowing where we are in the standings, I couldn’t have asked for anything more,” Trail Blazers coach Terry Stotts said. “With the tiebreakers that are involved, it’s going to be a pretty interesting end of the season.”\n\n\r\n                    Kevin Love had 18 points and Dean Wade scored 16 for the Cavaliers, who lost their eighth in a row and are 1-11 since April 15. Cleveland was outscored by 45 points in the 26 minutes that Love was on the court.\n\n\r\n                    The lowest plus-minus since the NBA began tracking the statistic in 2007-08 is minus-57 by Cavaliers guard Manny Harris at the Lakers on Jan. 11, 2011.\n\n\r\n                    Anderson Varejao had one point and six rebounds in his first game with Cleveland since Feb. 10, 2016. Varejao, who spent his first 11 1/2 seasons with the franchise, signed a 10-day contract Tuesday after not playing in the NBA in four years.\n\n\r\n                    “Honestly, it felt like I had never left when I went to check in and the fans were chanting Andy,” Varejao said. “Cleveland is home for me and my family was at the game — it was the first time playing in front of my daughter Serenee — so I’ll never forget this day.”\n\n\r\n                    The Cavaliers went 0-5 on their homestand, losing 134-118 in overtime to Phoenix on Tuesday and matching their most points allowed this season against the Trail Blazers. Collin Sexton scored 15 points and Cedi Osman had 14.\n\n\r\n                    “Our guys tried and they gave it all they had, but they were exhausted,” said Cleveland coach J.B. Bickerstaff, whose team was outscored 74-48 in the second half.\n\n\r\n                    WELCOME BACK\n\n\r\n                    The Trail Blazers will be permitted to host 1,998 fans at their remaining home games, which is 10% of the capacity of Moda Center. The announcement by the Oregon Health Authority was made one day after Lilliard criticized the state on Twitter for keeping the arena closed to spectators. “Mission accomplished,” Lillard said. “Our record is much better on the road for a good reason. Our fans care, so without them when we came home, it was an empty, dead building.”\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: G Norman Powell (right knee patellar tendinopathy) missed his first game since joining Portland in a March 25 trade with Toronto. … Lillard continues to nurse a left foot contusion. … Anthony is 75 points away from tying Moses Malone for ninth place in NBA history with 27,409. Since signing with the Trail Blazers on Nov. 19, 2019, Anthony has moved up from 19th place to 10th.\n\n\r\n                    Cavaliers: C Isaiah Hartenstein returned after a five-game absence with a concussion. … G Darius Garland (left ankle sprain) missed his third straight game and F Lamar Stevens (concussion) sat out his sixth in a row. … F Taurean Prince (left ankle surgery), F Larry Nance Jr. (right thumb fracture), G Matthew Dellavedova (neck strain) and F Dylan Windler (left knee surgery) will miss the rest of the season.\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Host the Lakers on Friday. Defending champion Los Angeles makes its only regular-season appearance in Portland.\n\n\r\n                    Cavaliers: Visit Dallas on Friday. The teams complete their home-and-home season series Sunday at Rocket Mortgage FieldHouse.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997865.423444
}