{
  "game_id": "0022200364",
  "espn_id": "401468519",
  "date": "Dec 07, 2022",
  "matchup": "BKN vs. CHA",
  "headline": "Irving, Durant help Nets outlast Hornets, 122-116",
  "body": "NEW YORK -- — Kyrie Irving scored 33 points, Kevin Durant had 29 and the Brooklyn Nets outlasted the Charlotte Hornets 122-116 on Wednesday night.\n\n\r\n              Seth Curry added 20 points on 8-for-11 shooting to help the Nets won for the fifth time in six games.\n\n\r\n              Irving scored 12-fourth quarter points.\n\n\r\n              “In the fourth quarter they were just playing with a lot of comfort, and we just got to be really prepared for other team’s best shots even if they’re coming in and not playing well as well throughout the season, they’re still talented,” Irving said. “We just got to pay our respects and play the game the right way.”\n\n\r\n              Terry Rozier scored 29 points and Kelly Oubre Jr. had 28 for the Hornets. They have lost three straight and seven of 10.\n\n\r\n              “We weren’t doing nothing we talked about this morning,” Rozier said. “They were (getting) too easy of looks, were getting down in the middle of the paint of our defense and just created all types of advantages for themselves.”\n\n\r\n              Brooklyn led by 23 points at the start of the third quarter, but was outscored 32-23 in the period. The Hornets cut it to 109-107 with 6:28 left in the game.\n\n\r\n              Durant then re-entered the game and hit his first shot, and Irving followed with a three-point play to extend the lead 113-107.\n\n\r\n              Oubre scored five consecutive points, including a 3-pointer that made it a one-point game. Durant then hit two 3-pointers to increase the Nets’ lead 118-114.\n\n\r\n              After a Brooklyn missed basket, Rozier scored on the ensuing possession to cut the lead to two points and then fouled Irving as he tried to swipe the ball away with 44 seconds left.\n\n\r\n              Charlotte coach Steve Clifford challenged the referee’s call, but the play stood after a replay review. Irving then hit both free throws to seal the victory.\n\n\r\n              “That call was the biggest call of the game. We would have had ball down two and it costs us a time out,” Clifford explained. “We were only going to the challenge there if we’re positive, we were positive. That’s why we did it. That’s the play of the game basically.\n\n\r\n              TIP INS\n\n\r\n              Hornets: Oubre has scored at least 20 points in six consecutive games, tying a career high set last season from Dec. 1-13. … Charlotte’s two-game winning streak at Barclays Center was snapped.\n\n\r\n              Nets: Brooklyn set a season high with 73 first-half points and tied a season high with 20 assists in the first half.\n\n\r\n               NOT A FAN OF THE MVP\n\n\r\n              Durant didn’t have much to say about Aaron Judge’s nine-year, $360 million contract agreement with the New York Yankees on Wednesday.\n\n\r\n              “I’m a (Washington) Nationals fan,” Durant said. “I really don’t care about Aaron Judge at all.”\n\n\r\n               UP NEXT\n\n\r\n              Hornets: Host New York on Friday night.\n\n\r\n              Nets: Host Atlanta on Friday night.\n\n\r\n               ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994883.527195
}