{
  "game_id": "0022000170",
  "espn_id": "401267330",
  "date": "Jan 13, 2021",
  "matchup": "LAL @ OKC",
  "headline": "LeBron James scores 26 points, Lakers roll past Thunder",
  "body": "OKLAHOMA CITY -- — LeBron James scored 26 points and the Los Angeles Lakers routed the Oklahoma City Thunder 128-99 on Wednesday night for their franchise-record seventh straight road victory to start the season.\n\n\r\n                    “We just have a bunker mentality on the road — just us,\" James said. \"But obviously, it’s even more just us because of the restrictions, COVID, everything that’s going on. So we've come together even closer.”\n\n\r\n                    Montrezl Harrell added 21 points, and Anthony Davis had 18 points and seven rebounds. The defending champion Lakers have won four straight to improve to an NBA-best 10-3. They surpassed the 1985-86 squad with the 7-0 road start.\n\n\r\n                    But the road is different this season with mostly empty arenas.\n\n\r\n                    “It’s all about execution and your level of focus,” James said. “You’ve got to be able to at times build up your own energy. Like tonight, we come off a back-to-back, three in four nights. For us to come off a back-to-back -- in Houston last night, getting in late to OKC and coming out to an arena with no fans — you’ve got to prosper your own energy from your group, yourself.”\n\n\r\n                    Shai Gilgeous-Alexander scored 17 points to lead Oklahoma City.\n\n\r\n                    The Lakers led by 24 in the second quarter before the Thunder cut it to 58-46 at halftime. James scored 15 points in the half.\n\n\r\n                    James hit a 3-pointer with Thunder defensive stopper Lu Dort in his face, then made a 3-pointer and was fouled by Isaiah Roby on the next possession. The free throw gave the Lakers a 74-50 lead. On the Lakers’ next possession, James made a layup to give him nine points in 66 seconds. James made 4 of 6 shots and scored 11 points in the third quarter to help the Lakers take a 93-71 lead.\n\n\r\n                    The Lakers’ biggest lead was 31 points in the fourth quarter. The Thunder never led.\n\n\r\n                    “It's one of 72 games, and they're all opportunities,” Thunder coach Mark Daigneault said. “They're all opportunities to compete and they're opportunities to learn, and we've just got to continue to use every experience to continue to grow and move forward.”\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: James extended his streak of games with at least 10 points to 1,008. ... Harrell was called for a technical foul in the third quarter. ... Markieff Morris scored 11 points and Kentavious Caldwell-Pope added 10.\n\n\r\n                    Thunder: C Al Horford rested because it was the second game of a back-to-back. ... Roby got his second start of the season in Horford's place and had 11 points, nine rebounds and four assists. ... G Hamidou Diallo hit a shot from just beyond halfcourt to end the third quarter. ... Rookie F Aleksej Pokusevski scored a season-high 10 points.\n\n\r\n                    WELCOME BACK\n\n\r\n                    Former Thunder guard Dennis Schroder scored 14 points for the Lakers. He averaged 18.9 points per game last season and helped Oklahoma City reach the playoffs.\n\n\r\n                    QUOTABLE\n\n\r\n                    James on looking into the stands after making a shot in the third quarter:\n\n\r\n                    “I don’t know. There was actually somebody up there, but I was actually looking for nobody. I mean, I’m just visualizing us having fans back in the building again at some point. It was great to see some fans in Houston.”\n\n\r\n                    STAT LINES\n\n\r\n                    Diallo, who had averaged 21.3 points in his previous three games for Oklahoma City, finished with 9 points on 4-for-6 shooting in 20 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Host New Orleans on Friday night.\n\n\r\n                    Thunder: Host Chicago and former Oklahoma City coach Billy Donovan on Friday night.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997330.173461
}