{
  "game_id": "401810063",
  "espn_id": "401810063",
  "date": "Nov 11, 2025",
  "matchup": "NY vs MEM",
  "headline": "Knicks have another big offensive night, beat Grizzlies 133-120 to improve to 7-0 at home",
  "body": "NEW YORK -- — Jalen Brunson had 32 points and 10 assists, Karl-Anthony Towns added 21 points and 13 rebounds, and the New York Knicks continued their sizzling offensive start under new coach Mike Brown by beating the Memphis Grizzlies 133-120 on Wednesday night to improve to 7-0 at home.\n\n\r\n              Mikal Bridges scored 22 for the Knicks, who have averaged 130.2 points during a five-game winning streak, all at home. They are off to their best start at Madison Square Garden since winning their first 10 in the 2012-13 season, when they won their last Atlantic Division title.\n\n\r\n              OG Anunoby had 16 points and Jordan Clarkson came off the bench for 13. The Knicks have scored at least 77 points in a half in three straight games.\n\n\r\n              Jaren Jackson Jr. and Santi Aldama each scored 19 points for the Grizzlies, who lost for the sixth time in seven games. Ja Morant had 16 points and 10 assists but shot 4 for 14.\n\n\r\n              The Knicks closed the first quarter with a 12-0 run, turning a 30-all tie into a 42-30 advantage on Brunson's basket with 0.5 seconds left. A 7-0 spurt to open the second extended it to 49-30 on Deuce McBride's 3-pointer. \n\n\r\n              Memphis got within 11 midway through the quarter, but the Knicks kept pushing the ball and got 10 points from Clarkson in the period to extend the lead to 77-54 at halftime. \n\n\r\n              The Knicks scored 83 points in the second half of their 137-114 victory over Minnesota last Wednesday, then followed that with a 77-point first half in a 134-98 rout of Brooklyn on Sunday.\n\n\r\n              The Grizzlies trimmed the Knicks' 28-point lead to 10 in the fourth quarter but Brunson made sure they were turned away. \n\n\r\n              The Knicks rested starting center Mitchell Robinson on the first night of back-to-back games.\n\n\r\n              Up next\r\n              Grizzlies: Visit Boston on Wednesday.\n\n\r\n              Knicks: Host Orlando on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042604.088593
}