{
  "game_id": "0021600644",
  "espn_id": "400900065",
  "date": "Jan 20, 2017",
  "matchup": "MEM vs. SAC",
  "headline": "Gasol, Conley lead Grizzlies to easy win over Kings",
  "body": "MEMPHIS, Tenn. -- The Memphis Grizzlies are relying on 3-pointers as an offensive weapon this season, and the green light even extends to their big men.\nCenter Marc Gasol and reserve power forward Zach Randolph used long-range shooting to key a strong third quarter, providing the Grizzlies a big lead en route to a 107-91 victory over the Sacramento Kings on Friday night.\nGasol, who finished with 28 points and nine rebounds, connected on a trio of 3-pointers in the third quarter and Randolph closed the frame with a 35-footer that gave the Grizzlies an 83-64 lead, an advantage large enough that Kings coach Dave Joerger gave the bulk of his starters the rest of the night off.\n\"I hadn't hit (a 3-pointer) in a long time, so I was long overdue,\" said Randolph, who finished with 20 points and 10 rebounds.\nGasol and Randolph were a combined 5 of 9 from outside the arc, part of Memphis connecting on 11 of 28 from 3-point range.\n\"When they're making shots, it makes us really hard to guard,\" said guard Mike Conley, who had 16 points, eight rebounds and eight assists. \"It opens up the paint for us. . I literally just kind of walked to the rim a few times. That's a byproduct of our big guys being able to space the court with their 3-point shooting.\"\nTony Allen had 13 points and 10 rebounds as six Memphis players reached double figures in scoring.\nDeMarcus Cousins led the Kings with 19 points and 10 rebounds, while Garrett Temple added 14 points and Ty Lawson had 13 for Sacramento, which has lost four straight and seven of its last eight.\nMemphis started slow, but rebounded in the middle of the game. The Grizzlies carried a 49-42 lead into the break. The second-quarter performance, coupled with Gasol's 15 points in the third, provided Memphis a 68-41 advantage spanning the middle two quarters.\n\"They were just getting easy shots coming down,\" Lawson said. \"We started the game off good, but then, after that, they were knocking down shots and getting into the pain. Just doing what they wanted to do.\"\nTIP-INS\nKings: Sacramento played its first game without starting F Rudy Gay, the team's second-leading scorer at 18.7 points a game, who sustained a season-ending Achilles tendon injury in Wednesday's loss to Houston. ... Cousins received a technical foul near the end of the first half, his 14th of the season. ... Cousins recorded his 21st double-double of the season.\nGrizzlies: Reserve G Troy Daniels left the game in the second quarter with a right knee injury and did not return. He said after the game he was unsure when the injury occurred. ... Memphis had 11 3-pointers. The Grizzlies have made at least 10 3-pointers in 21 games this season, including 12 of the last 16. ... Allen recorded his fourth double-double of the season.\nRANDOLPH FOR THREES\nRandolph's two 3-pointers marked the first time he has recorded multiple 3-pointers in a game since Feb. 7, 2009, when he hit all three shots from beyond the arc against the Atlanta Hawks when he was with the Clippers.\nLONG AND WINDING ROAD\nFriday's game in Memphis was the start of an eight-game road trip for Sacramento. Next stop on the journey: Chicago to face the Bulls on Saturday. This marks the second time in three years the Kings have had an eight-game trip. \"You just kind of go on tour,\" Joerger said. \"Play some games and go to the next place and play a game and `where do I sleep tonight' and `what hotel room number have I got.\"\nUP NEXT\nKings: Continue their eight-game road trip facing the Bulls in Chicago.\nGrizzlies: Memphis continues a three-game homestand with a Saturday game against the Houston Rockets -- a rare back-to-back of home games. Memphis last played consecutive games at home in April 2015.",
  "source": "espn_api",
  "crawled_at": 1764995599.9576268
}