{
  "game_id": "0021900555",
  "espn_id": "401161197",
  "date": "Jan 08, 2020",
  "matchup": "TOR @ CHA",
  "headline": "Davis, Ibaka lead Raptors past Hornets in OT, 112-110",
  "body": "CHARLOTTE, N.C. --  Every now and again, Terence Davis reminds himself that 30 NBA teams passed on him in the 2019 draft.\n\nWednesday was one of those nights.\n\nDavis made the most of his first NBA start with 23 points and 11 rebounds, Serge Ibaka made two free throws with 5.1 seconds left in overtime and also finished with 23 points and 11 rebounds, and the banged-up Toronto Raptors escaped with a 112-110 overtime win over Charlotte Hornets.\n\nDavis said going undrafted wasn't ideal, but \"it adds fuel to the fire.\"\n\n\"I told my family when I didn't get drafted, `Hey, those guys that got their name called still have to lace them up and go play in the Summer League,\" Davis said. \"... So did I. That was my mindset going into the draft night was just to get to the Summer League.\"\n\nDavis said he was \"surprised\" when coach Raptors coach Nick Nurse told him before the game he was going to start.\n\nThe Raptors were without Fred VanVleet, Pascal Siakam, Marc Gasol, Dewan Hernandez and Norman Powell due to injuries, leaving them depleted on the second night of a back-to-back.\n\n\"He was really good,\" Nurse said of Davis. \"This isn't that easy to figure out who to play with all these guys out constantly and trying to figure out some ways to keep guys ticking. When they are really fighting hard for minutes they play better. .... There are all kinds of things going on, but with me I am going to rattle your cage if you deserve to have it rattled.\"\n\nDavis picked up the slack for the Raptors, getting into a rhythm early with 13 points in the first quarter. The rookie from Mississippi also finished strong with two big 3-pointers in overtime.\n\n\"I was being aggressive without trying to force things,\" said Davis, a second-team All-Southeastern Conference selection last season. \"Guys were finding me and I knocked a couple shots down and got to the paint.\"\n\nOG Anunoby added 19 points and Kyle Lowry had 15 points and nine assists while having to play 43 minutes due to injuries in the backcourt. Patrick McCaw added 13 points and 11 assists as the Raptors bounced back from a home loss to Portland on Tuesday night.\n\nTerry Rozier led the Hornets with 27 points, but his 3-pointer at the buzzer in overtime that would have won the game fell just short.\n\nRozier exchanged words and pointed fingers at Davis on the court after the game and the two had to be separated by teammates before heading back to their respective locker rooms. Both players declined to discuss what was said after the game.\n\nMiles Bridges added 26 points and nine rebounds for Charlotte, and P.J. Washington had 12 points and 12 rebounds.\n\nThis was a much different game than on Nov. 18 when Toronto defeated Charlotte 132-96 at home.\n\nAfter leading by as many as 12 in the third quarter, the Raptors fell behind by 10 in the fourth quarter when Rozier hit a long 3 from the left wing with 5:25 remaining.\n\nBut the Raptors battled back to take the lead 100-99 with 17 seconds left when Lowry drove the lane and scored on a left-handed layup in traffic. On the Hornets' ensuing inbounds pass, Ibaka was called for a foul away from the ball after grabbing Washington's jersey. Rozier sank the automatic free throw to tie it, but Devonte Graham's runner at the buzzer was short, sending the game into overtime.\n\nIbaka scored the game's go-ahead points after grabbing an offensive rebound and drawing a foul on Rozier. Hornets coach James Borrego said he thought Ibaka might have traveled on the play, but added he would have to watch the film to be sure.\n\n\"You have to keep playing for 48 minutes and that's the bottom line,\" Borrego said. \"No matter if you're up or down, you have to keep playing.\"\n\nTIP INS\n\nRaptors: Had 34 assisted baskets. ... Davis was 8 of 16 from the field in his first start.\n\nHornets: Bench outscored Raptors' reserves 28-19 despite only playing eight players overall.\n\nROZIER STAYS HOT\n\nRozier has scored at least 27 points in four straight games for the Hornets. He started slow against the Raptors, but picked up the pace in the second half and in overtime, where he made a series of big plays, including a steal and an assist for Devonte Graham for a transition 3-pointer.\n\n\"I think he came back with a vengeance,\" Borrego said. \"He was terrific down the stretch. He had great will, just to chase down that transition possession for them was fantastic. He kept attacking the rim. He got to the rim. I liked the ball in his hands late.\"\n\nBACK-TO-BACK PROWESS\n\nThe Raptors have not lost on back-to-back nights since Dec. 26-27, 2017.\n\nLowry attributed that to the team's resiliency.\n\n\"We played hard and Coach Nurse has a good mentality,\" Lowry said. \"We have a lot of guys hurt right now and we got some guys coming back and we will just keep plugging away.\"\n\nBRIDGES OVER TROUBLED WATERS\n\nBridges knocked down a career-high six 3-pointers. \"I wasn't hesitating on the shots and the last few games I was hesitating,\" Bridges said. \"I was just shooting them.\"\n\nUP NEXT:\n\nRaptors: Get a three-day rest before hosting the Spurs on Sunday.\n\nHornets: Head west to face the Jazz in Utah on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995612.767742
}