{
  "game_id": "0022300967",
  "espn_id": "401585595",
  "date": "Mar 16, 2024",
  "matchup": "HOU vs. CLE",
  "headline": "Green scores 26 points as Rockets beat Cavaliers 117-103 for their fifth straight victory",
  "body": "HOUSTON -- — Jalen Green had 26 points and 11 rebounds, and the Houston Rockets beat the Cleveland Cavaliers 117-103 on Saturday for their fifth straight victory.\n\n\r\n              Jabari Smith Jr. added 20 points, Amen Thompson had 18 and Fred VanVleet finished with 13 points and 16 assists for the Rockets, who made 15 3-pointers and outscored Cleveland 56-46 in the paint.\n\n\r\n              Green added four assists while hitting 4 of 9 from 3.\n\n\r\n              “We started off pretty hot and were moving the ball,” Green said. “Once they were falling, it was a confidence builder. We were just doing what we’ve been doing, started hitting shots and did our thing.”\n\n\r\n              Houston led 70-54 at halftime and entered the fourth quarter with a 25-point lead.\n\n\r\n              “Early in the ballgame, you could see we were getting outworked and out-scrapped,” Cavs coach J.B. Bickerstaff said. “For us, the defense sets our tone and when we don’t do that, we don’t give yourself a chance to win.”\n\n\r\n              The Rockets have won seven of their last eight, pulling within three games of the Golden State Warriors for the final Western Conference play-in spot.\n\n\r\n              “The common theme is to just play good,” VanVleet said. “Everything else will take care of itself. If we’re playing good basketball and playing together, I think we’ll have a shot down the stretch. It’s right there for us, but we’ve just got to continue to stay on the track that we’re on.”\n\n\r\n              Caris LeVert scored 21 points for Cleveland. Georges Niang had 14 and Donovan Mitchell added 13.\n\n\r\n              “I think the switching affected them and forced them to play a lot more 1-on-1,” Rockets coach Ime Udoka said. “We did a good job with all the bodies we had. I loved our effort, defensively, from the start, and specifically in the third quarter to come out with that start and really kind of put it away early there. It was a great win for us.”\n\n\r\n              Mitchell was playing in his second game back from a seven-game absence with a left knee bruise. Mitchell appeared to sustain a bloody nose in the second half and sat much of the fourth quarter. The Cavs were without Max Strus (right knee sprain) and Evan Mobley (left ankle sprain).\n\n\r\n              “I mean, no disrespect to some guys, but I’m not really blowing by people right now, and that’s disappointing and it’s affecting me,” Mitchell said. \n\n\r\n              “I want to be out there, but it’s clear as day, even to myself. I can’t fool myself. We’ll get it right and be ready for when that time comes.”\n\n\r\n              Mitchell said he will likely rest the next game to allow his knee more time to heal.\n\n\r\n              “Donovan is giving it what he’s got,” Bickerstaff said. “He’s doing a great job of sharing the ball. Obviously, he missed some time and is working his way back in. I’m not concerned about Donovan’s game because I know when he’s on the floor, he’s giving us a chance to win.”\n\n\r\n              Cavs veteran center Tristan Thompson made his return from a 25-game NBA suspension for violating the league’s anti-drug policy by testing positive for performance-enhancing drugs. Thompson had five points and five rebounds in 16 minutes.\n\n\r\n              Cleveland hasn’t won back-to-back games since Feb. 25-27, going 4-6 since. The Cavs fell one game behind Milwaukee for second place in the Eastern Conference.\n\n\r\n              “This is a marathon,” Niang said. “We’re looking to play our best basketball going into the playoffs. Obviously, we have some injuries and some stuff we need to get figured out. As they say in the Boston Marathon, we’re at Heartbreak Hill. We’re climbing and clawing, and that’s what we’re going to do to keep improving and keep getting better.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Indiana on Monday night.\n\n\r\n              Rockets: Visit Washington on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995576.0368562
}