{
  "game_id": "0022300704",
  "espn_id": "401585332",
  "date": "Feb 04, 2024",
  "matchup": "ORL @ DET",
  "headline": "Franz Wagner dominates second half as Magic pulls away to beat Pistons 111-99",
  "body": "DETROIT -- — Franz Wagner scored 27 of his career-high-matching 38 points in the second half as the Orlando Magic defeated the Detroit Pistons 111-99 for their third straight win on Sunday.\n\n\r\n              “(Franz) was incredible. I thought he played with a high level of poise,” Magic coach Jamahl Mosley said. “He attacked the basket 22 times and scored 38 points without shooting a free throw. That's impressive.”\n\n\r\n              Paolo Banchero added 20 points for Orlando. The Magic got 58 points from three players who are very familiar to the Little Caesars Arena fans. Franz Wagner attended the University of Michigan, as did his brother Moritz Wagner who scored 10 points. Gary Harris, who went to Michigan State, also scored 10. \n\n\r\n              “We were down early, so I was trying to get into the paint and make some plays,” Franz Wagner said. “That is a lot easier when the other guys are hitting shots like they did today.”\n\n\r\n              Cade Cunningham and Jaden Ivey each scored 18 for Detroit (6-43).\n\n\r\n              The game was tied at 78 early in the fourth when the local players took over for the Magic. Franz Wagner and Harris combined for 15 points in the next five minutes and Moritz Wagner added two more.\n\n\r\n              Franz Wagner's 3-pointer made it 98-90 with 6:44 to play, and he shushed the crowd as Pistons coach Monty Williams called a timeout. He hit his first 10 shots of the second half, including three 3-pointers.\n\n\r\n              Detroit's offense came up empty on four straight possessions, needing Jalen Duren's put-back to stay within 103-97 with 3:07 to play.\n\n\r\n              “I like the way we played the game on the floor and didn't focus on Detroit's record,” Mosley said. “We were coming off a big win in Minnesota and we played the right way and did what it took to come away with another one.”\n\n\r\n              Franz Wagner's lay-up off a turnover put the Magic up eight, and Cunningham missed both free throws at the other end.\n\n\r\n              “We didn't do a good enough job of guarding the ball and we had too many costly turnovers,” Williams said. “That gave them some transition points, and there were plays where we got confused on the switches we were making when they went to the post and back outside.”\n\n\r\n              The Magic led 50-47 at the half, and Franz Wagner's 11 third-quarter points helped them expand the margin to as many as 12 midway through the third.\n\n\r\n              Ausar Thompson had nine points in the final eight minutes of the quarter, leaving Detroit down 78-75 at the end of the third quarter. \n\n\r\n              “I was comfortable out there,” said Thompson, who finished with 17 points and seven rebounds. “I was trying to be aggressive, but it would have been nice to finish it with a win.” \n\n\r\n              Alec Burks' three-point play tied it on the first possession of the fourth, but Orlando outscored the Pistons 33-21 in the rest of the quarter.\n\n\r\n              “In the second and fourth quarters, we just couldn't score the ball,” Williams said. “Give them credit, they are a big physical defense team and they get after you.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: At the Miami Heat on Tuesday night.\n\n\r\n              Pistons: At the Sacramento Kings on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996170.073477
}