{
  "game_id": "401809999",
  "espn_id": "401809999",
  "date": "Nov 01, 2025",
  "matchup": "IND vs GS",
  "headline": "Pacers snap season-opening 5-game losing streak with a 114-109 win over the Warriors",
  "body": "INDIANAPOLIS -- — Quenton Jackson scored 12 of his 25 points in the fourth quarter as the Indiana Pacers snapped a season-opening five-game losing streak with a 114-109 victory over the Golden State Warriors on Saturday night.\n\n\r\n              Aaron Nesmith scored 31 and Pascal Siakam added 27 for the Pacers.\n\n\r\n              Stephen Curry led the Warriors with 24 points. Jimmy Butler scored 20 points and Jonathan Kuminga 17 for Golden State.\n\n\r\n              After Indiana trailed by as many as 11 points in the fourth quarter, Jackson's 3-pointer with 1:09 left gave the Pacers a 109-107 lead. Butler dunked to tie the score at 109-all, but he failed to convert a three-point play.\n\n\r\n              Siakam hit a 3-pointer that put the Pacers ahead 112-109 with 37 seconds left. After a Kuminga missed, Jackson hit a pull-up jumper with 5.2 seconds left that extended the lead to 114-109.\n\n\r\n              Curry scored 18 points in the first half as the Warriors built a 58-55 halftime lead. Nesmith scored 18 and Siakam 16 to lead Indiana in the opening half.\n\n\r\n              Golden State shot 48% in the first half, while the Pacers shot 44%.\n\n\r\n              The Pacers led by as many as six points in the third quarter before the Warriors rallied for a 88-82 advantage heading into the fourth. Brandi Podziemski scored 10 of his 16 points in the third quarter for Golden State.\n\n\r\n              Indiana had been hard hit by injuries. Two-time All-Star Tyrese Haiiburton is expected to miss the entire season after tearing his Achilles tendon in Game 7 of the NBA Finals. On Friday, the Pacers announced that Obi Toppin will miss at least three months with a stress fracture in his right foot that requires surgery. Also sidelined for the Pacers are starters Bennedict Mathurin (foot) and Andrew Nembhard (left shoulder strain), along with key reserve player T.J. McConnell (left hamstring strain).\n\n\r\n              Up next\r\n              Warriors: Host the Phoenix Suns on Tuesday.\n\n\r\n              Pacers: Host the Milwaukee Bucks on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042540.483657
}