{
  "game_id": "0022000415",
  "espn_id": "401267575",
  "date": "Feb 14, 2021",
  "matchup": "MIL @ OKC",
  "headline": "Thunder overcome Antetokounmpo's triple-double, top Bucks",
  "body": "OKLAHOMA CITY -- — The Thunder finally got one.\n\n\r\n                    Justin Jackson scored a season-high 22 points and hit a critical 3-pointer in the final minute to help the Oklahoma City Thunder overcome Giannis Antetokounmpo's triple-double and beat the Milwaukee Bucks 114-109 on Sunday night.\n\n\r\n                    With Milwaukee making a late push, Jackson hit a 3-pointer with 14.9 seconds remaining to put the Thunder in control for good in just his second start of the season.\n\n\r\n                    The Thunder had been nearing a breakthrough. During their recent three-game road trip, they lost back-to-back overtime games to the Los Angeles Lakers and dropped a two-point game to the Denver Nuggets.\n\n\r\n                    “These games are all an opportunity to sharpen our blade, and they’re all a barometer of kind of where we’re at as a team,\" Thunder coach Mark Daigneault said. \"The only way you know how good you can be or how much you need to improve or where you need to improve is when you test yourself against the league’s best. Milwaukee -- we have high respect for them. They’re one of the league’s best, and we were able to improve as a result of being able to play them and compete with them tonight.”\n\n\r\n                    Al Horford had 20 points, nine assists and seven rebounds, Lu Dort scored 19 points and Darius Bazley added 18 for Oklahoma City. The Thunder won without leading scorer Shai Gilgeous-Alexander, who sat out with a sprained left knee.\n\n\r\n                    Antetokounmpo had 24 points, 17 rebounds and 10 assists for his fourth triple-double of the season. Khris Middleton scored 23 points and Bobby Portis added 21 for the Bucks. \n\n\r\n                    “Tonight, they were the team that wanted it more,\" Middleton said. \"It’s as simple as that.”\n\n\r\n                    Milwaukee closed out its six-game road trip with three losses after starting with three wins.\n\n\r\n                    “It felt like 12 days on the road — that’s what it’ s felt like and that’s what it looked like,\" Antetokounmpo said. \"Obviously, guys are tired playing every other day — the road trip started with a back to back. We haven’t had time to rest.”\n\n\r\n                    Milwaukee missed 14 of its first 15 shots to start the second quarter, and the Thunder took advantage to lead 52-41 at halftime. Middleton scored 17 points in the first half for the Bucks on 7-for-10 shooting, but the rest of the team went 10 for 38. Dort scored 16 points in the first half for Oklahoma City.\n\n\r\n                    “From the nine-minute mark in the first quarter to halftime, it was just an ugly game for us,” Bucks coach Mike Budenholzer said. “We just weren’t able to make enough plays — all of us.”\n\n\r\n                    Milwaukee rallied and took the lead on a jumper by Portis late in the third quarter. The Bucks made 67% of their field goals in the third, and the game was tied at 81 heading into the fourth.\n\n\r\n                    Consecutive buckets by Bazley and a 3-pointer by Jackson gave the Thunder a 101-93 lead midway through the final quarter, and Oklahoma City held on.\n\n\r\n                    Daigneault was proud of the way the Thunder bounced back after falling behind 8-0 at the start.\n\n\r\n                    “It was really just regrouping and refocusing everybody on what the blueprint was for the game on both ends of the floor,\" he said. \"We weren’t terrible the first few minutes, but against a team that good, you can’t be average or above average. You have to be great at it, and for the rest of the game, our execution was great.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Milwaukee scored the game's first eight points. ... Antetokounmpo had a double-double in the first half with 11 points and 11 rebounds. ... Donte DiVincenzo scored 17 points. ... Guard Jrue Holiday was out because of health and safety protocols. \n\n\r\n                    Thunder: Rookie guard Theo Maledon sat out because of health and safety protocols. ... Isaiah Roby's putback dunk with 1.2 seconds left in the first quarter tied the game at 24 heading into the second. ... Guard Hamidou Diallo tied a career high with 13 rebounds. ... Horford's nine assists were a season high.\n\n\r\n                    QUOTABLE\n\n\r\n                    Daigneault, offering perspective on the game: “I’ll throw this in the same bucket as the Lakers and Denver last week,” he said. “It’s less about the win. In order to even be in the game against these teams -- these are elite NBA teams -- they require 48 minutes of execution and attention to detail.”\n\n\r\n                    STAT LINES\n\n\r\n                    Jackson has averaged 16.3 points in his past four games while shooting 56.5% from the field. He scored 20 points in the loss to Denver,\n\n\r\n                    UP NEXT\n\n\r\n                    The Bucks host the Toronto Raptors on Tuesday.\n\n\r\n                    The Thunder host the Portland Trail Blazers on Tuesday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997399.022877
}