{
  "game_id": "0022400374",
  "espn_id": "401704940",
  "date": "Dec 20, 2024",
  "matchup": "MIL @ CLE",
  "headline": "Donovan Mitchell scores 27 as Cavs improve to 15-1 at home, roll over NBA Cup champion Bucks 124-101",
  "body": "CLEVELAND -- — Donovan Mitchell scored 27 points, Darius Garland added 16 and the Cleveland Cavaliers moved to 15-1 at home with a 124-101 win on Friday night over the Milwaukee Bucks, who played for the first time since winning the NBA Cup.\n\n\r\n              Cleveland is 3-0 this season against Milwaukee, which was without All-Star guard Damian Lillard because of a strained calf.\n\n\r\n              Evan Mobley scored 15 and Cleveland made 20 3-pointers while pushing its league-best record to 24-4.\n\n\r\n              Giannis Antetokounmpo had 33 points and 14 rebounds for the Bucks, who may need a couple more days to shake off their collective hangover after winning the Cup on Tuesday in Las Vegas.\n\n\r\n              With Lillard sidelined, the Bucks were missing their second-best player and 25.7 points per game. Milwaukee's starting guards — Andre Jackson Jr. and AJ Green — shot a combined 0 of 9.\n\n\r\n              Takeaways\r\n              Bucks: Coach Doc Rivers doesn't believe Lillard's injury is “severe” and the team is being cautious. ... Rivers said it was \"weird\" winning a tournament and resuming play. The turnaround didn't give Milwaukee's players much time to recover. Rivers hopes the league addresses the tight window in the future.\n\n\r\n              Cavaliers: Max Strus made his season debut after being sidelined with an ankle injury. He finished with nine points in 19 minutes.\n\n\r\n              Key moment\r\n              After Strus made a 3-pointer, Caris LeVert dropped a layup and then poked away Milwaukee's inbound pass. The ball got to Mitchell, who buried a 3-pointer with 1.1 seconds left in the third quarter to put the Cavs up 27.\n\n\r\n              Key stat\r\n              Antetokounmpo was named MVP of the Cup, the ninth trophy the eight-time All-Star and two-time league MVP has won during his career — the most for any player. Michael Jordan and LeBron James each won eight.\n\n\r\n              Up next\r\n              The Bucks host Washington on Saturday. It's also a back-to-back for the Cavaliers, who host Philadelphia.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997846.966793
}