{
  "game_id": "0022200146",
  "espn_id": "401468301",
  "date": "Nov 07, 2022",
  "matchup": "DET vs. OKC",
  "headline": "Bey scores 25, Pistons' big 2nd half beats Thunder 112-103",
  "body": "DETROIT -- — Saddiq Bey scored 25 points, Cade Cunningham had 21 points and 11 rebounds, and the Detroit Pistons beat the Oklahoma City Thunder 112-103 on Monday night.\n\n\r\n              Rookie Jaden Ivey had 15 points and 11 rebounds, while Isaiah Stewart had 11 points and 12 rebounds. The Pistons outscored the Thunder 64-40 in the second half.\n\n\r\n              “At halftime, we talked about the way we came out for the game and how we needed to pick it up in the first three minutes of the second half,” Bey said. “We focused on defense. We didn't worry about whether shots were going in, because we know if we can get stops, we'll get points.”\n\n\r\n              Shai Gilgeous-Alexander scored 33 points for the Thunder, but none of the other starters reached double figures.\n\n\r\n              “I was impressed with the level of intensity they brought to the second half of the game,” Thunder coach Mark Daigneault said. “I thought they were the aggressor from the jump. We made a couple of attempts to try to get ourselves back in there, but they were the better team.”\n\n\r\n              Detroit led 106-101 when Cunningham missed a 3-pointer with 1:55 left. Stewart, though, grabbed his 11th rebound and passed to Bey for a basket to put the Pistons up by seven.\n\n\r\n              After Kenrich Williams' layup, Cunningham was called for his fifth foul with 1:30 left. However, Pistons coach Dwane Casey successfully challenged the call and Bey hit two free throws on the ensuing possession.\n\n\r\n              The Thunder's defense was the difference in the first half, holding Detroit to 35.4% shooting, including 15.8% on 3-pointers. Gilgeous-Alexander had 21 points and three blocks in the half, while no Piston reached double figures.\n\n\r\n              The lead was 63-48 at the half, but Detroit started the third quarter with a 24-6 run to take a 72-69 lead. \n\n\r\n              “Our big adjustment is called energy,” Casey said. “They outran us and outhustled us in the first half, and once we decided to play at the level, we got ourselves back into the game.”\n\n\r\n              The Pistons expanded the edge to 77-71, but the Thunder led 85-84 at quarter's end.\n\n\r\n              The Pistons got off to another quick start in the fourth, outscoring Oklahoma City 10-2 in the first three minutes.\n\n\r\n              “They just imposed their will on us at the start of the second half and again at the start of the fourth quarter,” the Thunder's Mike Muscala said.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Oklahoma City came into the game with the NBA's best third-quarter point differential (+5.7), but Detroit outscored the Thunder 36-22 in the third.\n\n\r\n              “They came out and threw the first punch and beat us to every loose ball,” Gilgeous-Alexander said. “That's something we are always trying to do ourselves.”\n\n\r\n              Pistons: Detroit is 3-3 at home and 0-5 on the road. ... Monday was the second game this season where three Pistons have posted a double double.\n\n\r\n              HIGH-SPEED INTERNET\n\n\r\n              Casey said that the state-of-the-art internet at Little Caesars Arena helped him make the challenge on the late offensive foul on Cunningham.\n\n\r\n              “There are a lot of arenas where the internet is a lot slower than it is here,” he said. “I'm sure that's not an accident.”\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host the Milwaukee Bucks on Wednesday.\n\n\r\n              Pistons: Visit the Boston Celtics on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995273.040249
}