{
  "game_id": "0022000755",
  "espn_id": "401307546",
  "date": "Apr 04, 2021",
  "matchup": "BKN @ CHI",
  "headline": "Bulls beat Nets 115-107, snap 6-game skid",
  "body": "CHICAGO -- — Nikola Vucevic had 22 points and 13 rebounds, Zach LaVine added 25 points and the Chicago Bulls beat the Brooklyn Nets 115-107 on Sunday to snap a six-game losing streak.\n\n\r\n                    Tomas Satoransky had a season-high 19 points and 11 assists as Chicago won for the first time since acquiring Vucevic before the trade deadline.\n\n\r\n                    “We understand it’s going to take some time, and we’ve had some guys out of the lineup,” said Vucevic, who has played five games with the Bulls.\n\n\r\n                    “What I really like is it’s a motivated group of guys and they want to win. It’s all been positive. Hopefully, we can grow together and get some wins.”\n\n\r\n                    Kyrie Irving had 24 points and 15 assists to lead short-handed Brooklyn, which played without James Harden and Kevin Durant. Jeff Green added 21 off the bench. The Nets had won five straight and 10 of 12.\n\n\r\n                    “We couldn’t get as many stops as we needed,” Irving said. “In the second quarter, they created separation and we were playing catch-up.\n\n\r\n                    “You’ve got to give the Bulls credit. They came to play and they made shots.”\n\n\r\n                    Brooklyn led by as many as nine points in the first quarter, but Chicago closed the gap to 28-25 and then posted a 32-18 advantage in the second for a 57-46 halftime lead. The Bulls closed the first half with a 16-5 run with Satoransky leading the way with nine points.\n\n\r\n                    Chicago continued the surge early in the second half, extending the lead to 74-56 midway through the third quarter. The Bulls took an 89-72 edge into the fourth. \n\n\r\n                    Brooklyn pulled within seven points on a couple of occasions late, but LaVine sealed it with a 3-pointer with 1:22 remaining to make it 112-102.\n\n\r\n                    Chicago’s last four losses came during a road trip out West that concluded Friday night at Utah.\n\n\r\n                    “I thought that was a much-needed win,” Satoransky said. “It wasn’t easy because we got in at like 3 a.m. (Saturday) after the Utah game and it was an early start.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: G Tyler Johnson suffered an apparent lower right leg injury running back on defense early in the fourth quarter. He came up lame without contact and dropped to the floor after a couple of awkward steps. He couldn’t put any weight on the leg as he was helped off ... Harden (right hamstring tightness) and Durant (left hamstring strain) didn’t make the trip. Both were scheduled to work out Sunday in Brooklyn. Coach Steve Nash said Harden could return Monday night. Durant is hoping to return later in the week.\n\n\r\n                    Bulls: G Coby White sat out because of the COVID-19 health and safety protocols. “He has a test right now that they’re looking into,” coach Billy Donovan said. “We should know more in the next 24 hours.”\n\n\r\n                    TWO-MAN GAME\n\n\r\n                    The Bulls eventually expect Vucevic and LaVine to form a dynamic duo in the pick-and-roll game because of their versatile offensive abilities. “We’re still trying to figure out what to do with each other,” Vucevic said. “That’s just going to come with reps. It’s gotten better each game.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host New York Knicks on Monday night.\n\n\r\n                    Bulls: Visit Indiana Pacers on Tuesday night.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997481.399526
}