{
  "game_id": "0021900820",
  "espn_id": "401161462",
  "date": "Feb 20, 2020",
  "matchup": "MIL @ DET",
  "headline": "Antetokounmpo scores 33, leads Bucks to rout of Pistons",
  "body": "DETROIT --  Like many NBA coaches, Mike Budenholzer was worried about his Milwaukee Bucks needing a game or two to get back up to speed after the All-Star break.\n\nIt wasn't a concern for long Thursday night.\n\nThe Bucks had 70 points by halftime on their way to a 126-106 victory over the Detroit Pistons.\n\n\"That was a really impressive first half and I thought we did a lot of good things in the second half, too,\" Budenholzer said. \"Our energy had been good the last two days, but that doesn't always equate to good play. There were a lot of positives for the first game after the break.\"\n\nGiannis Antetokounmpo had 33 points and 16 rebounds as the Bucks led by as many as 34 points in the second half. Detroit trailed 70-41 at halftime and could never get enough stops to mount any significant rally in the final two quarters.\n\n\"We came out and played our game and played with pace and aggression,\" said former Piston Khris Middleton, who scored 28 points. \"That's how we have to play the rest of the way.\"\n\nEric Bledsoe added 19 points for the Bucks, who won for the 15th time in 17 games. Brook Lopez scored 18.\n\nThe Pistons have lost five straight since trading Andre Drummond to the Cleveland Cavaliers on Feb. 6 and were playing for the first time since buying out Reggie Jackson's contract.\n\n\"With a young team, it takes getting smacked upside the head a few times to wake them up a little bit,\" Pistons coach Dwane Casey said. \"Tonight showed everyone how far we still have to go when it comes to building our roster and developing our young players.\"\n\nChristian Wood, one of seven players in the game who has played for both teams, had 18 points and 11 rebounds. Bruce Brown finished with 16 points and 10 rebounds.\n\n\"`Those guys are like family, but once we touch the court, it is for blood,\" Wood said. \"I'm going to go right at Giannis and he's going to go right at me.\"\n\nThe game was lopsided early, with the Bucks leading by 14 at the end of the first quarter and 29 at the half. Detroit's 41 first-half points were only two more than Middleton (20) and Antetokounmpo (19) had on their own.\n\n\"It was big to come off the break and play good basketball and be up by almost 30 at the half,\" Antetokounmpo said. \"We picked up right where we left off.\"\n\nMilwaukee also had a 14-0 advantage in points off turnovers, many coming after Pistons drove into the lane before throwing away an attempted kick-out.\n\n\"That's the No. 1 team in the league when it comes to protecting the paint, so you have to have a plan before you get in there,\" Casey said. \"They have such unbelievable length that once you get in there, everything closes up in a hurry. You either have to get to the rim or know where you are passing the ball.\"\n\nTIP INS\n\nBucks: Antetokounmpo was called for a technical for arguing a third-quarter call with Milwaukee leading by 29. ... The win meant the Bucks still haven't lost back-to-back games this season.\n\nPistons: Detroit had two former Bucks, Tony Snell and Thon Maker, in the starting lineup and three more (Wood, Brandon Knight and John Henson) on the bench. Middleton started his career with Detroit and Ersan Ilyasova has also played for the Pistons.\n\nNEWEST BUCK\n\nMarvin Williams played the final 8:41 in his second game since joining the Bucks after being bought out by the Charlotte Hornets. Budenholzer said he left a few of his starters in the game to get them time alongside Williams.\n\n\"It was fortunate that he got to play a lot of the starters group, but we'll figure out what he's going to do on a night-to-night basis,\" he said. \"He's going to help us.\"\n\nBIG POSSESSION\n\nThe Bucks had a chance at a 7-point possession in the third quarter, thanks to Wood committing a flagrant foul on a made basket. Donte DiVicenzo finished the three-point play and Antetokounmpo added a free throw after a technical on Pistons coach Dwane Casey. Because of the flagrant foul, the Bucks retained the ball, but Antetokounmpo was called for an offensive foul.\n\nUP NEXT\n\nBucks: Host the Philadelphia 76ers on Saturday\n\nPistons: Visit the Portland Trail Blazers on Sunday",
  "source": "espn_api",
  "crawled_at": 1764996131.900235
}