{
  "game_id": "0021800039",
  "espn_id": "401070223",
  "date": "Oct 21, 2018",
  "matchup": "HOU @ LAC",
  "headline": "Led by bench, Clippers hang on to beat Rockets 115-112",
  "body": "LOS ANGELES --  Three games into his NBA career, Shai Gilgeous-Alexander is getting used to playing in crunch time.\n\nThe rookie is pretty good when it counts, too.\n\nMontrezl Harrell led a fourth-quarter charge by the Clippers' reserves with 17 points, Gilgeous-Alexander added 12 and Los Angeles defeated the Houston Rockets 115-112 on Sunday night.\n\nClippers coach Doc Rivers debated different offensive and defensive lineups in the fourth, and finally settled on having Gilgeous-Alexander help defend James Harden.\n\n\"It was scary,\" Rivers said, at the same time explaining that he trusts all of his players.\n\nGilgeous-Alexander's defense and his ball-handling skills give the Clippers greater options.\n\n\"We're all composed and not fazed by the moment,\" the rookie said. \"I'm always really confident in myself. I know how hard I work and it pays off.\"\n\nHarrell and the bench helped the Clippers erase a four-point deficit late in the third, with Luc Mbah a Moute's 3-pointer giving them the lead for good.\n\nTobias Harris led the Clippers with 23 points. Danilo Gallinari added 20 and Harrell had 10 rebounds.\n\nThe Rockets were without Chris Paul against his old team. He began serving a two-game suspension for his involvement in an on-court fight against the Lakers on Saturday.\n\n\"You know how much we miss him, that's obvious, but still we had enough to win,\" Houston coach Mike D'Antoni said. \"It shouldn't be an excuse. We should have played better.\"\n\nHarden had 31 points and 14 assists one night after getting shoved by the Lakers' Brandon Ingram in a move that started the incident involving Paul.\n\n\"It is what it is,\" Harden said of the suspensions and fines handed down by the league. \"I don't know how to decide how many games.\"\n\nHarden scored nine straight points to draw Houston within three with 29 seconds left. But his potential tying 3-pointer was short on the left side as time expired.\n\n\"He can really do everything on court so you have to try to make it difficult,\" Gilgeous-Alexander said.\n\nThe starless-Clippers earned their second win over one of the NBA's top teams, having beaten the Thunder without Russell Westbrook on Friday night.\n\n\"Two back-to-back really good efforts on the defensive end,\" said Lou Williams, who added 12 points.\n\nTeam owner Steve Ballmer exhorted the crowd of 16,149 to \"Get up!\" during a timeout with 3:17 remaining in the game, waving his arms with a fierce look on his face.\n\nHarden was subjected to some smothering defense by Patrick Beverley in the game's opening minutes. Harden went down after inadvertently getting hit in the head by Beverley and the Rockets called timeout. Another time, Harden was on a drive to the basket when Beverley committed a hard foul that knocked down the Rockets star.\n\nTrailing by four, the Clippers closed the third on a 19-6 run to lead 93-83. Mbah a Moute had eight points and Harrell added four. Harrell tipped the ball away from P.J. Tucker on the final play and scored, drawing the foul and shimmying his way into high-fives with two courtside fans.\n\n\"That hurt us,\" D'Antoni said. \"We were guarding well up until we just had some mental lapses defensively and they took advantage of it.\"\n\nGallinari scored 11 of the Clippers' first 20 points of the third, countering Eric Gordon, who had 10 points early in the period starting in place of Paul.\n\nTIP-INS\n\nRockets: Besides his suspension, Paul was fined a total of $491,782 for his role in the fracas. Paul wasn't at Staples Center on Sunday. ... They lost in the second game of their first back-to-back of the season. The Rockets were 10-3 in such situations last season.\n\nClippers: They ended a two-game skid against the Rockets.\n\nUP NEXT\n\nRockets: Host Utah on Wednesday.\n\nClippers: Visit New Orleans on Tuesday in their first road trip of the season.\n\n---\n\nMore AP NBA: www.apnews.com/tag/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995327.537904
}