{
  "game_id": "0021600689",
  "espn_id": "400900110",
  "date": "Jan 25, 2017",
  "matchup": "LAL @ POR",
  "headline": "Lillard, McColllum lead Trail Blazers over Lakers 105-98",
  "body": "PORTLAND, Ore. --  The Trail Blazers' celebration of the 40th anniversary of their 1977 NBA championship ended appropriately -- with a win.\n\nDamian Lillard and CJ McCollum scored 24 points apiece and Portland beat the Los Angeles Lakers 105-98 on Wednesday night, with players from the championship team looking on.\n\nIt was Portland's 11th straight victory in regular-season games against the Lakers.\n\nWith two consecutive wins, the Blazers look to build some much-needed momentum. They host Memphis on Friday night before Golden State on Sunday.\n\n\"I think it's a great opportunity for us,\" Lillard said. \"I just asked somebody in the locker room, `When was the last time we won three games in a row?' We had to look at the schedule to see.\"\n\nLos Angeles was led by Lou Williams with 31 points, including six 3-pointers. The Lakers were coming off a 122-73 loss at Dallas on Sunday, the most lopsided loss in franchise history.\n\nThe Lakers trailed by as many as 14 points in the third quarter, but Williams made three consecutive 3-pointers to get Los Angeles within three at 89-86 with just over nine minutes to go.\n\nAfter the Lakers got within a point, Allen Crabbe's pull-up jumper gave the Blazers a 91-88 lead with 6:38 left. Nick Young's 3-pointer tied it, quieting the crowds' `Beat L.A.' chant. Young made another 3 to give Los Angeles a 94-91 lead.\n\nLillard made three free throws after he was fouled by Jose Calderon to tie it, and Portland pulled in front on McCollum's 3-pointer. McCollum extended the lead with a reverse layup with 2:40 left. The Blazers led the rest of the way.\n\nMason Plumlee had 19 points and 13 rebounds for the Blazers, who defeated the Celtics in Boston 127-123 in overtime on Saturday to snap a four-game losing streak.\n\nPortland was without Ed Davis for the second straight game because of a left wrist injury, and also missed Maurice Harkless, who had a calf injury.\n\nThe Lakers didn't have D'Angelo Russell for the second straight game because of a sprained right knee and calf. He is expected to miss up to two weeks. Calderon started in his place.\n\n\"We had a great opportunity tonight, we had momentum,\" Lakers coach Luke Walton said. \"They did a good job of keeping their composure and making plays down the stretch. Ultimately, it just wasn't our night.\"\n\nThe Lakers held a 31-30 lead at the end of the first quarter, but Portland opened the second on a 9-2 run to go up 41-33 on Pat Connaughton's layup.\n\nWilliams' floater got the Lakers back within one at 45-44. They evened it at 52 on Ivica Zubac's dunk and took a lead on Young's free throw, but Portland had a 59-58 edge at halftime.\n\nWilliams led the Lakers with 16 points at the break, while McCollum had 16 for Portland. The team honored players from 1977 championship team at the half.\n\n\"I think we're playing much better. I think that's what we need to be focused on,\" Lillard said about the upcoming games. \"It's a great opportunity for us to show we're getting it together.\"\n\nTIP INS\n\nLakers: Jim Buss, the team's executive vice president of basketball operations, was in Portland for the game. ... The Lakers have lost seven of their last eight games.  ... The Lakers outrebounded the Blazers 30-22.\n\nTrail Blazers: It was the third of four meetings with the Lakers this season. ...  Portland's starting five scored 86 points.\n\nHONORING THE PAST\n\nPlayers from the 1977 championship team were feted with a banquet Tuesday night and a celebratory luncheon earlier Wednesday before a halftime ceremony for the fans. Blazers coach Terry Stotts wore a vintage plaid blazer in a nod to the late Jack Ramsay, coach of that team.\n\nIt was somewhat fitting that the Blazers were playing the Lakers because Walton is the son of Bill Walton, who was on that `77 team and included in the celebration. Luke Walton is named after `77 teammate Maurice Lucas, who was often greeted with cheers of \"Luuuuke!\"\n\n\"If he's out there in a Blazer jersey, I won't be upset,\" the younger Walton said about his dad's presence at the game. \"But I would hope he's rooting for us. He should. I'm his son.\"\n\nStotts said afterward: \"It was good to get the win when we're celebrating the championship team.\"\n\nUP NEXT:\n\nLakers: Play the second of a back-to-back at the Utah Jazz on Thursday.\n\nTrail Blazers: Portland hosts the Memphis Grizzlies on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995391.7676
}