{
  "game_id": "0021600252",
  "espn_id": "400899702",
  "date": "Nov 27, 2016",
  "matchup": "LAL vs. ATL",
  "headline": "Lou Williams leads Lakers to season sweep of Hawks, 109-94",
  "body": "LOS ANGELES -- The Los Angeles Lakers have the NBA's highest-scoring bench and remarkable balance throughout their roster, as the Atlanta Hawks discovered for the second time this month.\nJust 18 games removed from the worst season in franchise history, the Lakers are capable of handling the absence of two injured starters without a hitch.\nLou Williams scored 13 of his 21 points in the fourth quarter, Jordan Clarkson added 18 points and the Lakers beat the Hawks 109-94 on Sunday night without D'Angelo Russell or Julius Randle.\nNick Young scored 17 points as the Lakers swept their season series with Atlanta in a confident performance that featured 10 players getting significant minutes and eight players scoring at least seven points. That prolific group of reserves piled up 65 points, but coach Luke Walton was more pleased by its shutdown work in an 18-2 run shortly before halftime.\n\"The energy that the second unit brought on the defensive end in the second quarter changed the outcome of that game,\" Walton said. \"It's what we've been preaching all year, but it was really the first time that we saw all five guys on the court talking defensively. ... I think we carried the momentum through from that point on.\"\nKent Bazemore scored 21 points and Dwight Howard added 19 points and nine rebounds amid constant boos for the Hawks, who have lost five of six after a 9-2 start to the season.\n\"It's not going to happen overnight, but we showed signs of being able to do it,\" Bazemore said. \"That's the task for us now. I understand the ups and downs of it, and it's all about staying positive, staying together. Everybody knows we have the team and the personnel to get it done.\"\nThe Lakers won at Atlanta 123-116 earlier this month, with Williams scoring 16 of his 18 points in the fourth quarter in his home state against his former team. In the rematch, the Hawks couldn't match their strong start during the second half when the Lakers rolled out their depth.\n\"It's no longer a stroll through LA,\" Bazemore said. \"They're playing well. They've got a ton of pieces, and they all fit well together.\"\nUNCLE P RETURNS\nRandle missed his third game with a hip pointer, and Russell is out for at least two weeks to rest a sore left knee. But Young returned to the lineup after missing Friday's loss to Golden State with a sprained toe, and he immediately made another big impact in his resurgent season.\nYoung scored 12 points in the second quarter, hitting three of his four first-half 3-pointers while the Lakers swiftly turned a 13-point deficit into an 11-point lead.\nBOOING DWIGHT\nAlthough Howard wore a new uniform, he constantly received the same vociferous disdain that will follow him at Staples Center for his entire career. The big center spurned the Lakers in free agency in 2013 after one tumultuous season alongside Kobe Bryant, taking $20 million less than Los Angeles offered him and signing with Houston.\nHoward scored 13 points in the first quarter, but made little impact afterward.\n\"I didn't\" hear boos, Howard claimed. \"I closed my ears.\"\nGETTING IT TOGETHER\nLos Angeles (9-9) won for just the second time in six games during a brutal part of its schedule. The Lakers have a weird road swing with four games in five nights starting Tuesday.\n\"We are going from the south (New Orleans) to the north (Chicago) to the north (Toronto) back to the south (Memphis),\" Walton said. \"It makes zero sense.\"\nTIP-INS\nHawks: Bazemore spent 23 games with the Lakers late in the 2013-14 season after a trade with Golden State. He left as a free agent for Atlanta. ... Atlanta made its third stop on a five-game road trip.\nLakers: The club celebrated the 100th birthday of late broadcaster Chick Hearn with tributes throughout the game. ... Los Angeles played its 10th home game in the first 33 days of the season. The Lakers only have three home games in the next 27 days before a Christmas meeting with the Clippers. ... Thomas Robinson had a season-high nine points in his first start for the Lakers.\nUP NEXT\nHawks: At Golden State on Monday.\nLakers: At New Orleans on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995437.162498
}