{
  "game_id": "0022300163",
  "espn_id": "401584791",
  "date": "Nov 08, 2023",
  "matchup": "LAL @ HOU",
  "headline": "Jalen Green scores 28 points in 3 quarters as Rockets rout Lakers 128-94 for 4th straight win",
  "body": "HOUSTON -- — Jalen Green scored 28 points in three quarters and the Houston Rockets never trailed in a 128-94 rout of the Los Angeles Lakers on Wednesday night.\n\n\r\n              It’s the fourth straight win for the Rockets after they lost their first three games this season. They've won four in a row for the first time since winning seven consecutive games in late 2021.\n\n\r\n              “We’re taking the right steps,” first year coach Ime Udoka said. “We’re confident in what we’re doing and it’s gelling quicker than probably some thought already.”\n\n\r\n              The Rockets scored the game’s first eight points and led by 21 at halftime. They didn’t let up after the break and were up by 20 midway through the third period before using an 11-5 run to make it 90-64 with 3½ minutes left in the quarter.\n\n\r\n              Jabari Smith Jr. and Jae’Sean Tate made 3-pointers in that stretch to power the Rockets.\n\n\r\n              Green, who made 5 of 6 3-pointers, got hot soon after that, scoring all of Houston’s points during a 10-5 run that left the Rockets up 99-71 entering the fourth. Most of the starters for both teams, including Green and the Lakers' LeBron James, didn’t play in the fourth with the game out of hand.\n\n\r\n              Green is excited to see Houston's improvement in his third season after the Rockets were among the league's worst teams in his first two years.\n\n\r\n              “It’s a blessing,” he said. “I’m just happy about it. I’ve been in a losing category for so long. So it’s good just to see the results and the progression that the team is doing.”\n\n\r\n              Rui Hachimura scored 24 off the bench in his return after missing four games with a concussion as the Lakers lost their third straight. D’Angelo Russell added 22 points and James had a season-low 18 in a game in which Los Angeles was without Anthony Davis, who sat out with a groin injury.\n\n\r\n              The Rockets had a great offensive night, shooting 54.8% (51 of 93) overall and making 42.4% (14 of 33) of their 3-pointers. They also dominated on the boards with Davis out, outrebounding the Lakers 57-34.\n\n\r\n              “They're going to be a handful to deal with this year,” Lakers coach Darvin Ham said. “If they keep up at this rate, they'll be a handful not just for us, but the other 28 teams besides us.”\n\n\r\n              Tari Eason had nine points and nine rebounds in his season debut for Houston after missing the first six games with a leg injury.\n\n\r\n              STROUD’S SHOT\n\n\r\n              Houston Texans quarterback C.J. Stroud, who set a NFL rookie record by throwing for 470 yards this weekend, attempted a free throw for charity before tipoff Wednesday. The high school basketball star was confident that he’d swish it, but instead it bounced off the rim. The second-overall pick knows his teammates will get on him for the miss, but he isn’t worried about it.\n\n\r\n              “I don’t care. They’re haters anyway,” he said with a laugh. “But they love me on the field, so that’s all that matters.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Visit Phoenix on Friday night.\n\n\r\n              Rockets: Host New Orleans on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995552.904619
}