{
  "game_id": "0022400584",
  "espn_id": "401705150",
  "date": "Jan 17, 2025",
  "matchup": "CHI vs. CHA",
  "headline": "Ball and Bridges lead Hornets to wild 125-123 win over Bulls",
  "body": "CHICAGO -- — LaMelo Ball scored 26 points, Miles Bridges had 21 and the Charlotte Hornets held on for a wild 125-123 win over the Chicago Bulls on Friday night.\n\n\r\n              Mark Williams scored 19 points and grabbed 19 rebounds for the Hornets, who rallied to win a second straight game for just the second time this season. Charlotte has won three of four after a 10-game skid.\n\n\r\n              Charlotte won without Brandon Miller, the Hornets’ No. 2 scorer, and the team announced after the game he has a torn ligament in his right wrist. Miller, who’s averaging a career-high 21 points, will be out indefinitely.\n\n\r\n              Nikola Vucevic scored a season high 40 points — including 17 in the fourth quarter — and had 13 rebounds, but Chicago dropped a season-high fourth straight. \n\n\r\n              Zach Lavine scored 19 points and Coby White added 18 for the Bulls. Lonzo Ball, playing against his younger brother, had 6 points, three rebounds and three assists.\n\n\r\n              Charlotte opened the fourth quarter with a 21-2 run to build a 119-105 lead. Chicago then pushed back with a 12-0 streak of its own.\n\n\r\n              Chicago cut Charlotte's lead to one point — 122-121 — on Vucevic’s hook with 1:47 left, but Ball hit two free throws seconds later. Vucevic followed with a basket from the stripe to cut it to a 1-point deficit again before Vasa Micic hit one of two free throws with 12.6 seconds left.\n\n\r\n              Vucevic missed a 3-point attempt with 6 seconds left, then LaVine missed a shot off the rebound.\n\n\r\n              Takeaways\r\n              Hornets: Charlotte will need to continue to get contributions throughout the roster to help make up for the loss of Miller.\n\n\r\n              Bulls: Chicago showed some life following a 110-94 home loss to depleted Atlanta on Wednesday. \n\n\r\n              Key moment\r\n              The Hornets seemingly put it away with a 21-2 run to start the fourth quarter and took a 115-105 lead. Chicago didn't score in the quarter until Vucevic sank a hook 4:26 into the period.\n\n\r\n              The Bulls were down by as much as 12 in the first half before storming back to lead 103-98 after three quarters.\n\n\r\n              Key stat\r\n              Lonzo Ball, 27, played against younger brother LaMelo, 23, for the fourth time in the NBA.\n\n\r\n              Up next\r\n              Hornets: Host Dallas on Monday. \n\n\r\n              Bulls: Open a three-game trip at Portland on Sunday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997070.059677
}