{
  "game_id": "401810093",
  "espn_id": "401810093",
  "date": "Nov 16, 2025",
  "matchup": "DAL vs POR",
  "headline": "Washington and Flagg power Mavericks to a 138-133 OT win over the Trail Blazers",
  "body": "DALLAS -- — P.J. Washington Jr. and Cooper Flagg scored 21 points apiece and teamed up on a crucial basket late in overtime to help the Dallas Mavericks to a 138-133 victory over the Portland Trail Blazers on Sunday night.\n\n\r\n              Dallas led 130-129 with 1:39 remaining when Flagg grabbed the rebound of a missed 3-pointer by Portland’s Shaedon Sharpe and delivered an outlet pass to Washington for a jam during a 6-0 Dallas run.\n\n\r\n              Daniel Gafford added 20 points, including seven in overtime, and was one of seven Mavericks who scored in double figures. Dallas (4-10) snapped a three-game skid with the win. \n\n\r\n              Sharpe scored a season-high 36 points for the Trail Blazers (6-7), who have lost four of their last five games. Deni Avdija scored 29 before fouling out with 1:39 left on the play that resulted in Gafford hitting two free throws and putting Dallas ahead for good at 130-129.\n\n\r\n              Portland’s Jerami Grant scored 26 points in his first start this season in place of Jrue Holiday, who sat out with right calf soreness.\n\n\r\n              Dallas hit all seven of its field-goal attempts in overtime, all 2-pointers.\n\n\r\n              The Trail Blazers matched a season high by grabbing 22 offensive rebounds, seven by Donovan Clingan (11 total rebounds), resulting in a 32-10 advantage in second-chance points.\n\n\r\n              The Mavericks’ Anthony Davis missed his ninth consecutive game with a left calf strain. The team announced before the game that the 32-year-old, 10-time All-Star will be out at least another seven to 10 days. Davis has been sidelined by multiple injuries following the controversial Feb. 2 trade in which Dallas sent Luka Doncic to the Los Angeles Lakers and has missed 31 of a possible 47 games with the Mavs.\n\n\r\n              Davis’ bench attire was the jersey of Green Bay Packers quarterback Jordan Love, who beat the Dallas Cowboys 48-32 in the 2023-24 NFL wild-card playoffs.\n\n\r\n              Up next\r\n              Mavericks: Complete a back-to-back at Minnesota on Monday.\n\n\r\n              Trail Blazers: Host the Phoenix Suns on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042637.795375
}