{
  "game_id": "0022400358",
  "espn_id": "401704924",
  "date": "Dec 08, 2024",
  "matchup": "LAL vs. POR",
  "headline": "LeBron James misses 1st game this season, sidelined versus Portland due to left foot soreness",
  "body": "LOS ANGELES -- — LeBron James sat out the Los Angeles Lakers' 107-98 victory over the Portland Trail Blazers on Sunday due to left foot soreness, the NBA career scoring leader's first missed game of the season.\n\n\r\n              The 39-year-old James had been upgraded to probable early Sunday before being downgraded to doubtful less than two hours before tipoff. He officially was ruled out about 30 minutes before gametime.\n\n\r\n              Without James, a trio of Lakers took charge, with Anthony Davis scoring 30 points with 11 rebounds, D'Angelo Russell adding 28 points with a season-high 14 assists and Rui Hachimura finishing with a season-high 23 points.\n\n\r\n              “We found out LeBron was out right before the game so the coaches told me I had to step up tonight,” Hachimura said. \"I was ready for it. As a team, we were moving the ball well. (Russell) was great.\"\n\n\r\n              James did not speak to the media.\n\n\r\n              James played in the Lakers' first 23 games of the season, averaging 23.0 points with 9.1 assists and 8.0 rebounds. \n\n\r\n              Los Angeles got off to a 10-4 start, but had lost seven of nine games and three in a row before Sunday, including 134-132 in overtime at Atlanta on Friday. They are now 13-11 with the victory over the Trail Blazers.\n\n\r\n              James had his seventh triple-double of the season in the Atlanta loss, finishing with 39 points, 11 assists and 10 rebounds. It was the 119th triple-double of his career.\n\n\r\n              Lakers head coach JJ Redick put a positive spin on James’ absence, saying the night off “could be good for him,” because Los Angeles doesn’t play again until Friday at Minnesota.\n\n\r\n              The Lakers also were without Austin Reaves for the fifth consecutive game with a left pelvic contusion. Davis was active after he was listed on the team’s status report as probable with left plantar fasciitis.\n\n\r\n              James, in his record-tying 22nd NBA season, has averaged 27.1 points, 9.1 rebounds and 8.0 assists in 1,515 regular-season games. He has averaged 28.4 points, 9.0 rebounds and 7.2 assists in 287 career playoff games, while reaching the postseason 17 times.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997200.4015832
}