{
  "game_id": "0021200899",
  "espn_id": "400278619",
  "date": "Mar 06, 2013",
  "matchup": "CHA vs. BKN",
  "headline": "Nets ride big second half to overwhelm Bobcats",
  "body": "CHARLOTTE, N.C. --  The third quarter has been the Brooklyn Nets' Achilles' heel of late.\n\nHowever, on Wednesday night it proved to be their saving grace.\n\nThe Nets shrugged off a sluggish first half and turned a 10-point halftime deficit into a 99-78 blowout win over the Charlotte Bobcats, reminding everyone they still have the ability to flip that switch.\n\nDeron Williams had 20 points and eight assists, Joe Johnson added 22 points and the Nets limited the NBA-worst Bobcats 25 in the second half on 10-of-40 shooting. Brooklyn outscored Charlotte 28-9 in the third quarter.\n\n\n\n\"We hit shots and got stops in the second half, that was the main thing,\" Williams said. \"We had some good looks in the first half but we just didn't knock them down.\"\n\nBrooklyn (35-26) remains in the thick of Eastern Conference playoff race but needed a win to regain some momentum after losing four of its previous five games, including the previous two.\n\nThis was an expected win, but a needed win for the Nets.\n\nThey have a lengthy road trip later this month, so there's a belief in the locker room that every win they can get now will be important as they look ahead to the playoff seeding. They came in tied for the fifth-best record in the conference.\n\n\"It was good for us to get a win and bounce back,\" Williams said.\n\nThe Nets trailed by 53-43 at the half, but opened the third quarter with a 21-6 run led by Williams and Johnson, and never looked back. The Bobcats managed just nine points in the third quarter on 3-of-19 shooting and were outscored 56-25 in the second half to lose their eighth straight game.\n\nReggie Evans grabbed 16 rebounds and Brook Lopez had 16 points and five rebounds for the Nets.\n\n\"It was passion, not effort,\" said Nets coach P.J. Carlesimo. \"We didn't play with near the same passion that we did in the second half. Reggie was, I thought, unbelievable, not just in rebounding but the effort on the splits and the helping. Brook was contesting shots. Our guards did a much better job in the second half.\"\n\nRookie Michael Kidd-Gilchrist had 17 points and Ben Gordon added 16 for the Bobcats, who are 6-43 since starting the season 7-5.\n\nIt was almost as if the Bobcats didn't bother showing up for the second half.\n\nKemba Walker, Gerald Henderson and Gordon were a combined 4 for 21 from the field in the second half.\n\n\"It felt like a darn lid was on the rim,\" Henderson said. \"You know you can't win in this league if you can't score.\"\n\nSaid Bobcats coach Mike Dunlap: \"We had some good looks but we let (the missed shots) bleed into our defensive intensity. The cheap buckets for us are free throws. But we have to do a better job of creating that with our penetration game.\"\n\nWilliams, who had a career-high 57 points in his last appearance at Time Warner Cable Arena last season, scored 13 points in the second half and Johnson added 16 to lead the comeback.\n\nWilliams knocked down a 3-pointer with 6 minutes left in the third quarter to put the Nets ahead for good at 62-59. He's averaging 20 points per game over his past five games.\n\nStill there is room for improvement for the Nets, who committed 24 turnovers.\n\n\"I've never seen so many travels called in my life,\" Williams said. \"It must have been a point of emphasis tonight or something.\"\n\nFor a while it looked like the Nets might be in for another long night.\n\nCharlotte hit nine of its first 12 shots, including two dunks by Bismack Biyombo, to build an early 18-6 lead.  But Brooklyn cut the lead to three after three straight 3-pointers on three possessions, two of those by Keith Bogans.\n\nThings got a little testy midway through the second quarter when Gordon tripped Gerald Wallace as he was heading up the court on a fast break.\n\nGordon was whistled for a foul, but Nets assistant coach Mario Elie was slapped with a technical after arguing that Gordon should have been called for an intentional foul.\n\nGame notes Kris Humphries appears to have completely fallen out of the Nets' rotation. The high-priced forward didn't even play against the Bobcats. ...  Hall of famer Nate \"Tiny\" Archibold and Eric \"Sleepy\" Floyd attended Wednesday night's game. ... Walker, who has been hot of late for the Bobcats, had 10 points and eight assists in the loss. ... Gerald Wallace had a season-high five blocks.",
  "source": "espn_api",
  "crawled_at": 1764993660.47605
}