{
  "game_id": "0022000898",
  "espn_id": "401307697",
  "date": "Apr 23, 2021",
  "matchup": "MIA @ ATL",
  "headline": "Bogdanovich, Collins lead injury-depleted Hawks past Heat",
  "body": "ATLANTA -- — Bogdan Bogdanovich scored 21 points, John Collins added 20 and the injury-depleted Atlanta Hawks surprised the Miami Heat with a 118-103 victory Friday night.\n\n\r\n                    Atlanta played without its two best players, leading scorer Trae Young and NBA rebounding leader Clint Capela, but the Hawks still proved too much for Miami’s leaky defense. \n\n\r\n                    Interim coach Nate McMillan wrote the word “believe\" on the chalkboard before the game. He clearly had his entire team buying in.\n\n\r\n                    “For us to be short-handed and be able to do that tonight against a very good Miami team, again, believe in what you’re talking about,\" he said. “If we do and we do it together, you’re going to give yourself a chance to win games.\"\n\n\r\n                    The Hawks, who began the game No. 5 in the Eastern Conference, improved to 33-27 after winning for the 10th time in their last 12 games against the Eastern Conference and 10th time in the last 13 overall.\n\n\r\n                    Atlanta got a combined 47 points from reserves Brandon Goodwin, Danilo Gallinari and Lou Williams.\n\n\r\n                    Miami, which had won three straight following a three-game skid, dropped to 31-29 after making just three field goals in the fourth. The Heat began the game No. 7 in the East, but they trailed by 12, the game’s first double-digit lead, when Lou Williams hit a 3 with 9:45 remaining. Williams followed by stealing the ball and hitting a layup to make it 103-89, and the Heat were in trouble.\n\n\r\n                    “That has nothing to do with it,” Miami coach Erik Spoelstra said when asked about the absences of Young and Capela. “This has been somewhat of a trend with our basketball team. We did not have those multiple efforts that we had certainly the last game, but even the two games before that. And that doesn’t even necessarily guarantee you that we win, but I don’t think we imposed our will on this game, particularly on the defensive end.”\n\n\r\n                    Miami’s defense was lacking early as the Hawks led 62-61 at halftime, and the Heat trailed by as many as 16 when Brandon Goodwin hit a reverse fast-break layup with 8:45 left in the game.\n\n\r\n                    There were six lead changes in the third before Atlanta took charge in the fourth. The Hawks never trailed after Collins’ layup made it 79-78 at the 4:38 mark of the third.\n\n\r\n                    “We just knew this was a game we had to win,\" rookie center Onyeka Okongwu said after starting in place of Capela. “We needed this tiebreaker with Miami. The playoff race is so tight. We just did what we had to do to come together and just play good defense and play overall good basketball in the fourth quarter.\"\n\n\r\n                    Kendrick Nunn finished with 21 points, thanks for five 3-pointers, led the Heat. Jimmy Butler scored 18, and Bam Adebayo had 16 for Miami.\n\n\r\n                    “We really just couldn’t guard the ball, collectively as a group,\" Nunn said. “We were switching a lot but they just didn’t feel us tonight. We didn’t get into the ball enough, in all areas. It was a little bit of everything defensively.”\n\n\r\n                    Butler’s pair of free throws pulled the Heat within nine with 3:50 remaining. Solomon Hill answered with a layup for Atlanta, and the Hawks led by double digits the rest of the way.\n\n\r\n                    “You can’t explain it. It’s really unexplainable,\" Nunn said. “To have consistency it takes some discipline and a lot of focus, and I mean we didn’t we lock in and focus on that end of the floor tonight.”\n\n\r\n                    The Hawks reclaimed the lead at 29-28 on Nathan Knight’s dunk late in the first and were up 31-30 at the end of the period. Both teams got off to hot start with Miami shooting 66.7% and Atlanta 65.4% early in the second with Miami leading 42-40 on Tyler Herro’s 3.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Trevor Ariza had his first double-double of the season. ... Miami was coming off two straight 20-point victories, its first such streak since 2016-27. ... The Heat began the game leading the NBA in opponents’ points in the paint and fast-break points, but they couldn’t take advantage of Capela’s absence. ... Duncan Robinson, the only Heat player to appear in every game this season, has hit least two 3-pointers in 24 consecutive games, tying his own franchise-best record from last season.\n\n\r\n                    Hawks: Gallinari, who missed six straight games with right foot soreness, returned to score 17. ... Goodwin had 17, too. ... Atlanta has played much of the season without starters De’Andre Hunter and Cam Reddish, both of whom missed another game. ... McMillan didn’t have an immediate timetable on the potential returns of Young and Capela. ... Okongwu made his third start of the season in Capela’s spot and finished with six points and seven rebounds in 28 minutes. ... Atlanta has its best record through 60 games for the first time since 2016-17. \n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Host Chicago on Saturday.\n\n\r\n                    Hawks: Host Milwaukee on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996759.573034
}