{
  "game_id": "0021800140",
  "espn_id": "401070821",
  "date": "Nov 05, 2018",
  "matchup": "DET vs. MIA",
  "headline": "Richardson scores 27, leads Heat past Pistons 120-115 in OT",
  "body": "DETROIT --  Minus their big man, the Miami Heat were looking for someone to come up big.\n\nJosh Richardson answered the call.\n\nThe 6-foot-6 shooting guard scored 27 points to lead the short-handed Heat past the Detroit Pistons 120-115 in overtime Monday night.\n\nRichardson hit four free throws in the final 2.1 seconds to clinch it, ending Miami's three-game skid. Detroit has dropped five in a row.\n\n\"I was just being aggressive,\" Richardson said. \"I think I had a little lull in the fourth. I was just trying to get back and help us win. I was just taking my shots.\"\n\nThe Heat played without center Hassan Whiteside, who is second in the NBA in rebounding (14.6 per game) and blocked shots (2.75). Whiteside missed the game with an injured right knee.\n\nRichardson had nine of Miami's 15 points in overtime. It's the third time in four games he's put up at least 25, and the Heat can sense the fourth-year player growing into a role as their go-to scorer.\n\n\"It's the first time he's been called on to do this,\" Miami guard Dwyane Wade said. \"The shots he was taking in overtime and making, those were big-time shots. We want him to have the confidence to continue to take it to the next level, because we're going to need it.\"\n\nRichardson sought to downplay his success, both on this night and in the bigger picture.\n\n\"There's not really a defined go-to guy on our team,\" he said. \"Anybody on our team can hurt you late.\n\n\"If I get the ball, it happens to find me late, if guys give me the ball, I'll definitely take that on. But I think we have a lot of guys who are very confident.\"\n\nKelly Olynyk, filling Whiteside's spot on the floor, scored 10 of his 13 points in the second half. Goran Dragic had 21 points and Wade, playing his farewell NBA season, contributed 18 off the bench.\n\nAndre Drummond had 25 points for Detroit, and the NBA rebounding leader pulled down 24 boards. It was a putback by Drummond with 0.5 seconds left on the clock that sent the game to overtime.\n\n\"Drummond was tremendous on the glass,\" Heat coach Erik Spoelstra said. \"Every time we had a stop, or had bodies in front of the ball, he just has an incredible knack of second and third efforts.\n\n\"For a guy his size, the touch that he has to tip the ball in is pretty remarkable.\"\n\nReggie Jackson scored 25 and Langston Galloway added 21 off the bench.\n\nBlake Griffin, second in the league in scoring, had 24 points before fouling out in the fourth quarter.\n\n\"It is on us to continue to improve,\" Pistons coach Dwane Casey said. \"I know it's not showing in the record, but I do see improvement.\"\n\nWADE A MINUTE\n\nSo often a Detroit nemesis during his career, Wade was booed by Pistons fans who mocked him with chants of \"MVP!\" after he missed a free throw in the final minute of the first half. Wade, who has never won the NBA MVP award, responded to the taunting with a thunderous slam that tied the score at 51, one of three dunks he had in the game.\n\n\"I went to hot yoga this morning,\" Wade said. \"I think it was the yoga.\"\n\nAfter the game, a throng of fans holding Wade's No. 3 Heat jersey awaited him as he left the court.\n\n\"I definitely have always got a lot of love and respect here,\" Wade said. \"I got some boos and some other words here, too. That's just the game of basketball.\"\n\nTIP-INS\n\nHeat: It was Miami's first victory in Detroit's new Little Caesars Arena, which opened last season. ... Wade and forward Udonis Haslem were both part of the Heat team that beat the Pistons in the 2006 Eastern Conference final. ... Heat forward James Johnson (sports hernia surgery) and guard Dion Waiters (left ankle surgery) have yet to play this season.\n\nPistons: G Reggie Bullock missed his second straight game with an ankle sprain. G Luke Kennard (right shoulder separation) sat out his fifth successive game. ... Griffin and Milwaukee star Giannis Antetokounmpo are the only NBA players averaging at least 25 points, 10 rebounds and four assists. ... Pistons rookie guard Bruce Brown, who made his third start of the season, played college ball at Miami.\n\nUP NEXT\n\nHeat: Home against San Antonio on Wednesday night.\n\nPistons: At Orlando on Wednesday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994715.9653618
}