{
  "game_id": "401810201",
  "espn_id": "401810201",
  "date": "Dec 05, 2025",
  "matchup": "HOU vs PHX",
  "headline": "Durant reaches 31,000 career points as Rockets dominate Suns",
  "body": "HOUSTON -- — Kevin Durant had 28 points to become the eighth player in NBA history to score 31,000 career points as the Houston Rockets rolled to a 117-98 win over the Phoenix Suns on Friday night.\n\n\r\n              It was Durant's first game against his former team since a blockbuster seven-team trade that sent Jalen Green and Dillon Brooks to the Suns. Durant missed Houston's 114-92 win at Phoenix on Nov. 24 for personal reasons.\n\n\r\n              Amen Thompson scored a season-high 31 to help the Rockets to their fifth victory in six games. \n\n\r\n              Durant made two free throws for his first points of the night and hit jumper midway through the first quarter that gave the 15-time All-Star to reach the historic milestone. Durant, who didn't play in the fourth quarter, has 31,024 career points.\n\n\r\n              The Rockets trailed by as many as nine early but used a 44-point second quarter, powered by 17 points from Durant, to take the lead.\n\n\r\n              Houston was up by 11 with about 7 ½ minutes left in the third before using a 16-2 run to make it 92-67 with about two minutes left in the quarter. Thompson had six points in that stretch and Durant and Reed Sheppard both made 3-pointers for Houston. Phoenix had five turnovers during the spurt.\n\n\r\n              Brooks had 23 points to lead the Suns, who lost for the third time in four games.\n\n\r\n              Houston played without Alperen Sengun, who missed the game with an illness. Steven Adams started in his place and had four points and eight rebounds.\n\n\r\n              The Rockets played a tribute video for Brooks during pregame introductions and played one for Green, who is out due to a hamstring injury, between the first and second quarters. Both players received hearty ovations from the crowd at the end of their videos.\n\n\r\n              Green spent his first four seasons in Houston after being taken second overall by the club in the 2021 draft and Brooks spent the previous two seasons with the Rockets.\n\n\r\n              Up Next\r\n              Suns: Visit the Timberwolves Monday night.\n\n\r\n              Rockets: Visit the Mavericks Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042761.1901708
}