{
  "game_id": "0022200303",
  "espn_id": "401468458",
  "date": "Nov 28, 2022",
  "matchup": "TOR vs. CLE",
  "headline": "Siakam scores 18 in return, Raptors beat Cavaliers 100-88",
  "body": "TORONTO -- — Pascal Siakam had 18 points and 11 rebounds in his return from injury, O.G. Anunoby scored 20 and the Toronto Raptors beat the Cleveland Cavaliers 100-88 on Monday night.\n\n\r\n              Gary Trent Jr. added 14 points, Fred VanVleet had 13 and Scottie Barnes 11 as the Raptors improved to 8-2 at home.\n\n\r\n              Siakam returned after missing 10 games because of a strained right adductor. The All-Star forward was injured when he slipped and fell in the third quarter of a Nov. 4 loss at Dallas. Toronto went 5-5 in his absence.\n\n\r\n              “He was really good,” Raptors coach Nick Nurse said. “Looked really like he hadn’t missed a beat.”\n\n\r\n              Siakam shot 7 for 14 and made one of three from 3-point range.\n\n\r\n              “Watching Pascal play is just like, ‘Wow,’” Barnes said. “Every move he makes, the step-backs, the spin moves, double spin moves. It’s great to have him back out there on the floor.”\n\n\r\n              Barnes returned after missing two games because of a sprained left knee. Last season’s NBA Rookie of the Year came off the bench for the first time in a regular-season game.\n\n\r\n              Evan Mobley had 18 points and 15 rebounds and Darius Garland added 18 points and 10 assists, but the Cavaliers lost north of the border for the second time.\n\n\r\n              “They have to come see us twice at home, too,” Garland said. “Hopefully we get them back twice.”\n\n\r\n              Cleveland won eight straight following a season-opening loss at Toronto, and returned to Canada having won five of its past six.\n\n\r\n              But the Cavaliers shot 7 for 38 from 3-point range, their fewest made 3s of the season and their lowest percentage at .184.\n\n\r\n              “Shots just didn’t fall for us tonight,” coach J.B. Bickerstaff said.\n\n\r\n              Cleveland matched its previous season low with eight 3-pointers in Sunday’s win at Detroit.\n\n\r\n              Cleveland was 3 for 11 from long distance in the first quarter, 3 for 10 in the second and 0 for 8 in the third. Caris LeVert connected with 2:17 to play in the fourth, giving the Cavs their only 3-pointer in 17 second-half attempts.\n\n\r\n              Siakam made Toronto’s first two baskets and scored eight points in a seven-minute stint in the first quarter. The Raptors led 26-24 after one.\n\n\r\n              “He made tough shots in that first half,” Bickerstaff said. “That gave them energy, gave them a boost.”\n\n\r\n              Siakam scored nine points in the second and VanVleet added seven as the Raptors made four of six from 3-point range to lead 52-43 at halftime.\n\n\r\n              Toronto took an 80-67 lead into the fourth.\n\n\r\n              MITCHELL’S MISERY\n\n\r\n              Cavs guard Donovan Mitchell went 3 for 11 and scored a season-low eight points. Mitchell was held below 20 for the third time in 21 games.\n\n\r\n              “I just think he had a night,” Bickerstaff said. “That was it. Always give the Raptors credit. There were shots Donovan had that Donovan takes and makes typically. I think it was just one of those nights.”\n\n\r\n              BACK IN ACTION\n\n\r\n              LeVert returned after missing four games because of a sprained left ankle. He scored eight points in 29 minutes and shot 2 for 9.\n\n\r\n              “He’s got to get out and play,” Bickerstaff said. “It was good for him to get those reps down the stretch.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: C Jarrett Allen (sore lower back) sat out for the second consecutive game. F Lamar Stevens (non-COVID-19 illness) missed his third straight, while F Kevin Love (broken right thumb) missed his fourth in a row.\n\n\r\n              Raptors: Barnes was a reserve in Game 4 of Toronto’s first-round playoff series last season, when he was returning from an ankle injury. … Trent came off the bench, ending a streak of 85 consecutive starting appearances. … F Otto Porter Jr. (dislocated toe, left foot) missed his fifth straight game.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host the Philadelphia 76ers on Wednesday night.\n\n\r\n              Raptors: Visit the New Orleans Pelicans on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994089.784153
}