{
  "game_id": "0021501004",
  "espn_id": "400828891",
  "date": "Mar 16, 2016",
  "matchup": "CHA vs. ORL",
  "headline": "Hornets close strong homestand with 107-99 win over Magic",
  "body": "CHARLOTTE, N.C. -- Marvin Williams and Nicolas Batum each scored 26 points, and the Charlotte Hornets beat the Orlando Magic 107-99 on Wednesday night to finish their homestand with a 6-1 record.\nWilliams added nine rebounds and four 3-pointers, while Batum had nine assists and seven rebounds for the Hornets, who have won 14 of their last 17. Cody Zeller had his fourth double-double of the season with 13 points and 13 rebounds.\nKemba Walker chipped in with 16 points and eight rebounds.\nThe Hornets are one game behind Miami for the fourth-best record in the Eastern Conference.\nVictor Oladipo had 15 of his 25 points in the first quarter. Brandon Jennings chipped in with 16 points and Andrew Nicholson added 13 for the Magic, who have lost five of their last seven games.\nThe Hornets led by as many as 26 in the second half.\nCharlotte started off the game cold, a flashback to Monday night's horrible shooting performance in a loss to the Dallas Mavericks.\nBut Zeller's dunk of an alley-oop pass from Batum capped off a 16-0 run midway through the second quarter, giving Charlotte a 49-37 lead. The Hornets didn't let up, pushing the lead to 18 at the break behind Batum's 16 first-half points and eight assists.\nCharlotte outrebounded Orlando 31-21 in the first half behind Zeller and Al Jefferson's combined 15 boards.\nThe Hornets extended the lead in the third quarter as they started to knock down open 3-pointers, after starting the game missing 11 of their first 12 shots from beyond the arc.\nHowever, Orlando cut the lead to 105-99 with under 2 minutes left, with Andrew Nicholson taking over in the low post and Devyn Marble knocking down a pair of 3s. But Oladipo missed a pull-up jumper from 18 feet and Batum scored on a layup to push the lead to eight. Mario Hezonja missed a 3-pointer on the other end and the Hornets ran out the clock to improve to 26-10 at home.\nThe win sets up a big game Thursday night for the Hornets at Miami.\nMiami has won two of three against the Hornets this season, so the game could have potential tiebreaker implications in terms of playoff seeding.\nTIP-INS\nMagic: Oladipo had his 14th 20-point game of the season.\nHornets: Are 12-0 this season when they score at least 60 points in the first half.\nUP NEXT\nMagic: Host Cleveland on Friday night.\nHornets: Visit Miami on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994351.162741
}