{
  "game_id": "401810102",
  "espn_id": "401810102",
  "date": "Nov 17, 2025",
  "matchup": "NO vs OKC",
  "headline": "Holmgren scores 26 as the Thunder roll to a 126-109 win over the reeling Pelicans",
  "body": "NEW ORLEANS -- — Chet Holmgren scored 26 points and grabbed nine rebounds, and the Oklahoma City Thunder raced to an early double-digit lead they maintained throughout in a 126-109 victory over the reeling New Orleans Pelicans on Monday night.\n\n\r\n              Shai Gilgeous-Alexander scored 23 points and Lu Dort 17 for the Thunder, who set a franchise record for points in a quarter with 49 in the first. Isaiah Hartenstein added 16 points for Oklahoma City, which won its sixth straight for a 14th victory in 15 games to open the season.\n\n\r\n              Rookie guard Jeremiah Fears scored a season-high 24 and Trey Murphy III added 18 points for the Pelicans, who've lost six straight for the second time in their first 14 games, and two straight since interim coach James Borrego took over in the wake of Willie Green's firing on Saturday.\n\n\r\n              New Orleans played without Zion Williamson (hamstring) who missed his ninth game this season. Saddiq Bey (left ankle) also was scratched for New Orleans. Rookie Micah Peavy scored a season-high 16 points for the Pelicans in a reserve role. \n\n\r\n              Oklahoma City led by 10 less than three minutes into the game and by 20 before eight minutes had elapsed.\n\n\r\n              The Pelicans committed six turnovers in the first six minutes, at which point the Thunder, leading 24-8, had 13 points off turnovers.\n\n\r\n              When Brandon Carlson's free throws made it 36-11, Oklahoma City had scored on 15 of their previous 17 possessions.\n\n\r\n              After the first quarter closed with Oklahoma City leading 49-24, the second quarter was somewhat more competitive. The Pelicans, who shot 52.6% during the first 24 minutes, trimmed their deficit to 13 by halftime, at 69-56.\n\n\r\n              But the Thunder outscored the Pelicans 24-11 during the opening seven minutes of the third period, leading 93-67 after Holmgren followed up a 3 with a cutting dunk.\n\n\r\n              Up next\r\n              Thunder: Hosts the Sacramento Kings on Wednesday night.\n\n\r\n              Pelicans: Host the Denver Nuggets on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042646.066562
}