{
  "game_id": "0021600730",
  "espn_id": "400899366",
  "date": "Feb 01, 2017",
  "matchup": "ORL vs. IND",
  "headline": "Pacers hold on to beat Magic 98-88 on the road",
  "body": "ORLANDO, Fla. --  C.J. Miles is still growing into his role as a member of the Indiana Pacers' starting unit.\n\nEach possession, each game is a step in the process. The shooting guard took a major leap Wednesday night when he bounced back from a rough start to score 14 of his team-high 16 points after halftime and lead the Pacers over Orlando 98-88.\n\nPlagued by foul trouble in the first half, Miles converted 4 of 5 3-pointers during the final two quarters to help the Pacers extend their winning streak to four. Miles was inserted into the starting lineup ahead of Glenn Robinson III five games ago.\n\n\"I wouldn't say more comfortable,\" Miles said. \"I just feel like I've been able to add to that group what the coaching staff moved me for. They needed more space, not that (Robinson) isn't a threat.\"\n\nMiles knocked down timely 3-pointers in the second half to keep the Magic from making a comeback after several threats. His 3-pointer with 1:37 to play effectively sealed the win for the Pacers after Orlando had moved within 93-88 on two free throws by Nikola Vucevic.\n\nHis ability to knock down 3-pointers opened up the floor for power forward Thaddeus Young to do damage with mid-range jumpers and for point guard Jeff Teague to cause problems on the interior driving the ball to the basket.\n\n\"C.J. got in some foul trouble early, didn't drop his head, missed most of the first half,\" said Pacers coach Nate McMillan, whose team won consecutive road games for the first time this season. \"He was able to knock down some shots and get a rhythm coming in in the second half.\"\n\nThe win was significant because it came on a night when star player Paul George was off his game. After scoring 30 or more points in each of the Pacers last four games, George had just eight points (one point in the second half), while shooting just 3 of 14 from field and committing five turnovers.\n\nThe Pacers got big contributions from a variety of places to offset George's off night. Robinson came off the bench to score 14 points, while Young had 12 points and Teague added 13 points and nine assists.\n\n\"It's great for them to have my back, for them to take the load of me,\" George said.\n\nThe Magic dropped their fifth game in their last six outing and fell to 8-16 at home.\n\nOrlando was led by Serge Ibaka's 20 points. It shot just 40 percent from the field while Indiana converted 48 percent from the floor and 45 percent from 3-point range.\n\n\"We don't have a large margin for error,\" said Magic coach Frank Vogel, who has now lost to his former Indiana team by double digits three-straight times this season. \"Sometimes it's turnovers, sometimes it's poor defense, sometimes it's moving the basketball, getting a lot of good looks that we're not able to knock down.\"\n\nTIP-INS\n\nPacers: Rodney Stuckey returned to the lineup Wednesday after missing the previous 15 games with a hamstring injury. ... Indiana finished the month of January with a 9-4 record, which was the fifth highest in the NBA during the month.\n\nMagic: Starting guard Evan Fournier returned to the starting lineup for the first time in nine games. He missed eight games with a foot injury and returned to the floor during Monday night's loss at Minnesota. Watson returned to coming off the bench. ... Orlando went 4-12 during January.\n\nUP NEXT\n\nPacers: Indiana continues its road trip with a stop in Brooklyn to take on the last place Nets on Friday night.\n\nMagic: Last than week since stunning Toronto on the road, the Magic get to host the Raptors at Amway Center on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995840.213517
}