{
  "game_id": "0021800764",
  "espn_id": "401071437",
  "date": "Jan 31, 2019",
  "matchup": "DET vs. DAL",
  "headline": "Pistons edge short-handed Mavericks 93-89",
  "body": "DETROIT --  Free throws have dogged Andre Drummond throughout his NBA career, so when he stepped to the line with a two-point lead and 3.3 seconds remaining, Detroit's victory was far from certain.\n\nDrummond then calmly made both shots to seal the game for the Pistons.\n\n\"Closing it out with a rebound and getting those two free throws -- is huge,\" Drummond said. \"Got the win, so that's really good.\"\n\nDrummond had 24 points and 20 rebounds, and the Pistons rallied from a nine-point deficit in the fourth quarter to beat the short-handed Dallas Mavericks 93-89 on Thursday night.\n\nBefore the game, the Mavericks traded Dennis Smith Jr., DeAndre Jordan and Wesley Matthews to the New York Knicks in a seven-player deal . Dallas acquired injured star Kristaps Porzingis and others, but the Mavericks didn't have the players from the trade yet, and they were significantly undermanned for this game.\n\nIn addition to the players they dealt, the Mavericks also were without star rookie Luka Doncic, who sat out with left ankle soreness.\n\n\"It affects it, but this is the NBA. These things happen, and it's next man up,\" Dallas coach Rick Carlisle said. \"You play with what you got. I'm proud of the way we competed. I'm disappointed we couldn't quite get over the hump. Our guys certainly played well enough to get the win.\"\n\nDetroit had its problems with the depleted Mavericks, falling behind by 14 in the first half. The Pistons were down 74-65 in the fourth before going on a 14-4 run. The game was close the rest of the way.\n\n\"I'm totally disappointed in our approach. We have everything to play for, but looked down at the other bench and saw a lot of guys who don't play very often,\" Detroit coach Dwane Casey said. \"If you don't play with heart and grit, you can't win in this league, and especially not in Detroit. When I grew up in this game, the Pistons stood for grit, grime and hard work.\"\n\nOn this night, the Pistons' belated surge was enough to win. Up by three, Detroit fouled Jalen Brunson with 5.4 seconds left. Brunson made the first free throw and missed the second, and Drummond came up with the rebound and was fouled.\n\nDrummond shot 38 percent on free throws through his first five seasons. He improved last season, when he shot 61 percent, and he's at 54 percent this season after finishing Thursday's game in clutch fashion.\n\nMILESTONES\n\nBlake Griffin had 24 points for Detroit and finished with 445 in January, the highest-scoring month in team history. The previous record was held by Isiah Thomas, who had 442 points in March 1983.\n\nGriffin was announced as an All-Star reserve Thursday, but like Casey, he wasn't pleased with his team's overall showing.\n\n\"We talked after the game about how we won the game, but we can't be happy about that performance,\" Griffin said. \"We have to work tomorrow like we lost this game, because we didn't play well. We have to fix this ourselves. No one else is going to provide us with energy.\"\n\nDrummond passed Bill Laimbeer to become the Pistons' career leader in offensive rebounds with 2,431.\n\nTIP-INS\n\nMavericks: Dallas fell to 1-8 in the second half of back-to-backs.\n\nPistons: Reggie Jackson had 17 points, nine assists and seven rebounds. ... The Pistons went 9 of 33 from 3-point range, ending a franchise-record streak of 11 games with at least 10 3s.\n\nUP NEXT\n\nMavericks: Visit the Cleveland Cavaliers on Saturday night.\n\nPistons: Host the Los Angeles Clippers on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994683.937078
}