{
  "game_id": "0022200927",
  "espn_id": "401469082",
  "date": "Feb 28, 2023",
  "matchup": "LAL @ MEM",
  "headline": "Morant's third-quarter burst leads Grizzlies past Lakers",
  "body": "MEMPHIS, Tenn. -- — Ja Morant scored 28 of his 39 points in the third quarter and added 10 assists and 10 rebounds, and the Memphis Grizzlies beat Los Angeles 121-109 on Tuesday night in the Lakers' first game since LeBron James injured his right foot.\n\n\r\n              Morant made 10 of 12 shots in the highest-scoring quarter ever by a Grizzlies player.\n\n\r\n              “I was just feeling it,” Morant said. “I got going and was able to keep it rolling and put us in a good position to win the game.”\n\n\r\n              Xavier Tillman finished with 18 points and 11 rebounds for Memphis, while Jaren Jackson Jr. and Desmond Bane scored 16 points apiece.\n\n\r\n              “Obviously, Ja had a special third quarter,” Memphis coach Taylor Jenkins said. “He was just in attack mode.”\n\n\r\n              The Lakers matched their season high with 26 turnovers, leading to 41 Memphis points — a Grizzlies franchise record. Memphis also dominated the paint, outscoring Los Angeles 86-48 and added 33 fast-break points.\n\n\r\n              “A lot of that was cause and effect with our turnovers,” Los Angeles coach Darvin Ham said, adding: “They just forced their will on us in the paint.”\n\n\r\n              Anthony Davis led the Lakers with 28 points and 19 rebounds, while Lonnie Walker IV scored 21 points. Austin Reaves had 17, while matching his season high with four 3-pointers.\n\n\r\n              “The turnovers are what killed us,” Davis said.\n\n\r\n              Morant's burst broke open a close game and gave the Grizzlies a 93-84 advantage entering the fourth. He had made only three of his 14 attempts in the first half. He was 12 of 15 in the final two quarters.\n\n\r\n              “I wouldn't say it's flipping the switch,” Morant said. “It's just the shots I missed in the first half, I made in the second half.”\n\n\r\n              Memphis would click off eight straight points to take the first double-digit lead in the game as Brandon Clarke scored on a dunk off the Lakers' 22nd turnover with 9:14 left. The lead would eventually reach 106-92 with about nine minutes left.\n\n\r\n              But using a 3-point shooting streak, the Lakers cut the Memphis lead to 110-106 on a three-point play by Davis. Memphis answered by stretching the lead back to 118-106, enough to claim its second straight victory.\n\n\r\n              James' injury, suffered in Sunday's win over Dallas, left the Lakers without their leading scorer at 29.7 points per game. They don't know how long he will be out. \n\n\r\n              Los Angeles shot 37% and Memphis 33% in the first half. The Grizzlies held a six-point lead, the biggest of the half for either team.\n\n\r\n              “At halftime, my teammates just kept encouraging me. Just telling me to keep going,” Morant said. “I told them I wasn't going to miss too many more.”\n\n\r\n              TIP-INS\n\n\r\n              Lakers: In addition to James, G D'Angelo Russell missed his second game with a right ankle sprain. ...Recorded five blocks in the second quarter, ending the night with 10, including five by Davis.\n\n\r\n              Grizzlies: Have won five straight at home and are 26-5 at FedExForum. ...Jaren Jackson Jr. had four blocks in the game.\n\n\r\n              JAMES INJURY UPDATE\n\n\r\n              Ham said the Lakers continue to evaluate the right foot injury to James and he had no definite timetable for his return. But he said the team continues to strive for the postseason despite the injury. The Lakers are only a half-game out of the play-in game and 2 1/2 from sixth-place Dallas. “It's a huge blow to have LeBron injured,” Ham said. “We're going to keep going, and it's full steam ahead with the goals we set for ourselves.” The Lakers coach added that the organization would not return James to action until he is cleared by the medical staff.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Play Wednesday at Oklahoma City\n\n\r\n              Grizzlies: Travel to Houston to play the Rockets on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994115.7196531
}