{
  "game_id": "0022301060",
  "espn_id": "401585688",
  "date": "Mar 28, 2024",
  "matchup": "ATL vs. BOS",
  "headline": "Murray scores career-high 44 points, makes game-winning shot in OT as Hawks outlast Celtics 123-122",
  "body": "ATLANTA -- — After lapping the field in the Eastern Conference, the Boston Celtics have the luxury of using the homestretch of the regular season to prepare for the playoffs.\n\n\r\n              The Celtics now know they can't relax if they face the Atlanta Hawks in the first round.\n\n\r\n              Dejounte Murray scored a career-high 44 points, including a go-ahead jumper in the final second of overtime to power the Hawks to a 123-122 victory over the Celtics on Thursday night.\n\n\r\n              Murray scored all of Atlanta's 11 points in the extra period to give the Hawks their second win over Boston in four days in the matchup of teams currently holding the 1 and 10 seeds in the Eastern Conference.\n\n\r\n              “That’s a really good team,” Boston coach Joe Mazzulla said.\n\n\r\n              Jaylen Brown sank a go-ahead jumper with 6 seconds remaining in overtime to give Boston a 122-121 lead. Murray answered with the jumper over Jrue Holiday. That was the defensive matchup Mazzulla expected.\n\n\r\n              “We want nothing more than Jrue Holiday on Murray at that point of the game,” Mazzulla said.\n\n\r\n              Murray, who was listed as questionable with lower back soreness before the game, celebrated the go-ahead jumper before being grabbed from behind in a bear hug by teammate Garrison Mathews.\n\n\r\n              “I’m just built for those moments,” said Murray, who shot 18 for 44. “I’m a confident guy.”\n\n\r\n              Bogdan Bogdanovic scored 24 points and De'Andre Hunter had 21 points and 13 rebounds as Atlanta won its fourth straight game to match its longest streak of the season.\n\n\r\n              Jayson Tatum led Boston with 31 points and 13 rebounds. Kristaps Porzingis scored 20 points and Brown had 18.\n\n\r\n              Bogdanovic said he wasn't worried about Murray missing the game.\n\n\r\n              “He never quits,” Bogdanovic said. “Never. Whenever I see, like, he’s questionable I’m like, he’s good. He's good.”\n\n\r\n              On Monday night, the Hawks trailed by 30 points before rallying for a 120-118 win over the Celtics. It was Atlanta's biggest comeback win since at least the 1997-98 season.\n\n\r\n              The Celtics have the NBA's best record and have already clinched the No. 1 seed in the East.\n\n\r\n              Atlanta holds the final play-in spot in the East. The Hawks would face the Celtics in the first round of the playoffs if they make it through the play-in tournament with the ninth or 10th spot from the conference.\n\n\r\n              “We’re not tanking,” Murray said when asked about possibly missing the game due to his sore back. “We’re not trying to lose. We’re trying to win games and see how high we can get.”\n\n\r\n              Boston forward Al Horford (left big toe sprain) did not play.\n\n\r\n              The Hawks have won four straight with a depleted lineup. Forward Onyeka Okon gwu (left big toe sprain) missed his fourth consecutive game. The Hawks said forward Saddiq Bey, already ruled out for the season, had surgery Wednesday to repair the torn anterior crucial ligament in his left knee.\n\n\r\n              All-Star point guard Trae Young (finger) and forward Jalen Johnson (right ankle) have missed 17 and eight consecutive games, respectively. Young was called for a technical foul from his spot on Atlanta's bench in the second period following a 3-pointer by Murray.\n\n\r\n              A Hawks fan wearing a Hunter jersey sank a halfcourt shot at halftime to win $10,000.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visit New Orleans on Saturday night in the fifth game of a six-game trip.\n\n\r\n              Hawks: Host Milwaukee on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996264.617352
}