{
  "game_id": "0022300054",
  "espn_id": "401584142",
  "date": "Nov 28, 2023",
  "matchup": "TOR @ BKN",
  "headline": "Despite 115-103 win over Raptors, Nets knocked out of NBA In-Season Tournament",
  "body": "NEW YORK -- — Spencer Dinwiddie scored 23 points to lead the Brooklyn Nets to a 115-103 win over the Toronto Raptors on Tuesday night to win their third straight, but were knocked out of the NBA In-Season Tournament.\n\n\r\n              Dinwiddie was one of five players to finish in double-figure scoring for Brooklyn (9-8). \n\n\r\n              Mikal Bridges scored 22 points, Cameron Johnson and Royce O’Neale had 18 apiece, and Nic Claxton chipped in with 15.\n\n\r\n              “We just (ended) up making the right plays at the end (of the game),” Brooklyn coach Jacque Vaughn said. “Overall we had a good balance of attacking the rim and shooting 3s tonight.” \n\n\r\n              Brooklyn entered the last day of tournament group play needing to win by at least 15 points and for the Celtics to beat Chicago by less than 21 in order to clinch Group C and advance to the knockout round of the inaugural tournament. \n\n\r\n              While the Nets were engaged in their close fight with the Raptors, Boston routed Chicago 124-97. \n\n\r\n              Brooklyn could have earned a wild-card berth with a win and losses by the Cavaliers, Heat and Knicks. But New York blew out Charlotte 115-91 to clinch the wild card. \n\n\r\n              “It (would) have been nice to go to Vegas, but it is what it is,” Claxton said.\n\n\r\n              Despite having six players finish in double-figure scoring, Toronto dropped to 8-10. Pascal Siakam and Scottie Barnes had 17 each and Gary Trent Jr. finished with 15 off the bench. Dennis Schroder added 14, Chris Boucher contributed 13 and OG Anunoby had 10.\n\n\r\n              “I thought in the first half Scottie was settling quite a bit,” Raptors head coach Darko Rajakovic said, when asked about Barnes and Anunoby. \"He was taking some mid-range shots. We talked about it at halftime. He played a completely different game in the second half. So much more force.\n\n\r\n              “I thought OG started the game slow as well. But (in) the second half he gave us much more force.” \n\n\r\n              Trent tied the game at 94-all with a jumper in the lane with 4:30 remaining. On the next possession, Bridges converted a floater and knocked down a free throw to give Brooklyn a three-point lead. That was quickly cut to 97-96 on another Trent jumper. \n\n\r\n              After a timeout, Bridges knocked down a 3 from the left corner to extend Brooklyn’s lead. Two Johnson free throws stretched the advantage to six, before Barnes’ tip-in allowed the Raptors to close to 102-98.\n\n\r\n              The Nets went up by five on a Claxton free throw, only for Barnes to cut the deficit to three on a pair of free throws.\n\n\r\n              “Congratulations to Brooklyn,” Rajakovic said. “They played (a) great game. They were able to make shots down the stretch.”\n\n\r\n              Brooklyn was shorthanded as Ben Simmons (impinged left lower back nerve), Cam Thomas (sprained left ankle), Dennis Smith Jr. (sprained lower back) and Noah Clowney (right shoulder soreness) missed the game with injuries. \n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Phoenix on Wednesday night.\n\n\r\n              Nets: Host Charlotte on Thursday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995448.262878
}