{
  "game_id": "401809817",
  "espn_id": "401809817",
  "date": "Nov 28, 2025",
  "matchup": "OKC vs PHX",
  "headline": "Thunder win 11th straight to improve to 19-1, beating Suns 123-119 to move on in NBA Cup",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 37 points and eight assists and the Oklahoma City Thunder held on to beat the Phoenix Suns 123-119 on Friday night to reach the knockout round of the NBA Cup. \n\n\r\n              Gilgeous-Alexander scored 15 points in the final seven minutes on 4-of-5 shooting to help the defending champion Thunder win their 11th straight and become the fifth team in NBA history to start 19-1. They finished 4-0 in West Group A.\n\n\r\n              Chet Holmgren had 23 points and eight rebounds for Oklahoma City.\n\n\r\n              Jalen Williams had 11 points and eight assists in his return from wrist surgery. He played 29 minutes and made 3 of 12 shots. The All-Star guard/forward had surgery in July to repair a torn ligament in his right wrist and a follow-up procedure to remove a screw that was causing irritation.\n\n\r\n              Gilgeous-Alexander has scored at least 20 points in 92 consecutive games, matching Wilt Chamberlain for the second-longest streak in NBA history. Chamberlain is first with 126 straight games.\n\n\r\n              Collin Gillespie scored 24 points for Phoenix, which also advanced to the round of eight. Devin Booker had 21 and eight rebounds, and Dillon Brooks had 19 points.\n\n\r\n              The teams each made 15 3-point shots, most of them coming in a furious fourth quarter, when Phoenix cut the lead to one point multiple times. Gillespie's 3-pointer pulled Phoenix to 115-14, but Gilgeous-Alexander answered from beyond the arc to make it 118-114.\n\n\r\n              Up next\r\n              Suns: Host Denver on Saturday night.\n\n\r\n              Thunder: At Portland on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042710.751458
}