{
  "game_id": "0022300383",
  "espn_id": "401585011",
  "date": "Dec 22, 2023",
  "matchup": "BKN vs. DEN",
  "headline": "Murray, Jokic help defending champion Nuggets outlast Nets, 122-117",
  "body": "NEW YORK -- — Jamal Murray scored 32 points, Nikola Jokic had 29 points and 11 rebounds and the Denver Nuggets held off the Brooklyn Nets 122-117 on Friday night for their third straight victory.\n\n\r\n              Aaron Gordon added 18 points and Michael Porter Jr. had 15 to help the defending champion Nuggets improve to 20-10. \n\n\r\n              “The energy we need to start the game right,” Jokic said when asked why Denver has won four straight on the road. “I think we had a 14-7 run (to start the game) and we kind of slowed down a little bit. But (we need to) be the aggressor. We need the one to be the one (controlling) the game.”\n\n\r\n              Brooklyn has lost five in a row to fall to 13-15.\n\n\r\n              Cam Thomas led Brooklyn with 23 points. Cam Johnson had 17, Dorian Finney-Smith and Mikal Bridges each had 14, Royce O’Neale and Day’Ron Sharpe had 13 apiece and Nic Claxton finished with 10 points and 16 rebounds.\n\n\r\n              “It’s a pretty good recipe for us,” Brooklyn coach Jacques Vaughn said about the balanced scoring. “I think we had 18 assists at (halftime), over 30 to finish the game; seven dudes in double figures.” \n\n\r\n              Thomas’ four-point play with 19.4 seconds brought the Nets within one.\n\n\r\n              “Overall, a good effort from our guys,” Vaughn said. “I think we put ourselves in a position to try and win a ballgame. I thought our attention for the majority of the night was in the right place.\"\n\n\r\n              Following a timeout, Murray made three of four free throws to push the advantage to four. The teams then spent the final five seconds trading free throws.\n\n\r\n              “It worked out,” Murray said about his missed free throw with 18.1 seconds left.\n\n\r\n               The guard grabbed the offensive rebound and was immediately fouled by Thomas. He then knocked down both free throws to give the Nuggets a 118-114 lead. \n\n\r\n              The Nets did not have Ben Simmons (left lower back nerve impingement) and Lonnie Walker IV (strained left hamstring) due to injuries.\n\n\r\n              UP NEXT:\n\n\r\n              Nuggets: At Charlotte on Saturday night.\n\n\r\n              Nets: Hosts Detroit on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996356.680105
}