{
  "game_id": "0021800087",
  "espn_id": "401070768",
  "date": "Oct 29, 2018",
  "matchup": "POR @ IND",
  "headline": "Trail Blazers use 2nd-half charge to get past Pacers 103-93",
  "body": "INDIANAPOLIS --  The Portland Trail Blazers may not need to rely exclusively on their dynamic duo to throw scoring punches any longer.\n\nTheir new supporting cast trades jabs pretty well, too, and it could make a real difference to their long-term prospects.\n\nWith Damian Lillard struggling Monday and C.J. McCollum scoring just 17 points, the Blazers got 17 points from Zach Collins and the first career double-double from former Purdue star Caleb Swanigan to put away the Indiana Pacers 103-93.\n\n\"They've been great for us all season. They've been keeping us alive all season,\" McCollum said, referring to Portland's bench. \"They're the difference between us being an average team and a really good team.\"\n\nIt's a series Portland has dominated.\n\nThey've won three straight over Indiana and eight of the last nine, largely behind the play of Lillard who had scored at least 33 points in three of his six previous trips to Bankers Life Fieldhouse. And Lillard was coming off back-to-back 40-point games.\n\nThis time the All-Star guard missed his first five shots, didn't score until the final seconds of the first half and wound up with a season-low 16 points on 5 of 13 shooting with one rebound and two assists. McCollum was 7 of 15 with six rebounds and one assist and they combined for three 3-pointers.\n\nIn previous seasons, those numbers might have doomed Portland's chances.\n\nBut Swanigan softened up the Pacers with his early flurry and Collins delivered the knockout punch by repeatedly scoring in the fourth quarter to help Portland pull away.\n\n\"The second unit came in and played really well,\" said Collins, who matched his career high scoring total.  \"We ran the lead up and didn't let it go down. In the second half, we did our job.\"\n\nThe result: Indiana lost its first home game of the season with a lackluster performance.\n\nVictor Oladipo had 21 points, nine rebounds and seven assists while Darren Collison added a season-high 17. Thaddeus Young added 16 points and Myles Turner had 10 points and nine rebounds on a night coach Nate McMillan hoped to see a stronger performance on defense and on the glass.\n\nHe wasn't satisfied with much.\n\n\"We're still working on establishing ourselves as a team, what works for us as a team -- defending hard, rebounding the ball,\" McMillan said.\n\nThe Pacers appeared to be cruising early in the second half when they took a 57-49 lead.\n\nBut the Trail Blazers charged back quickly by scoring five straight points, retook the lead during a 10-2 run and extended their 71-69 advantage by starting the fourth quarter on an 8-2 run.\n\nIndiana didn't get closer than five the rest of the way as Swanigan had 11 points and 10 rebounds, both career bests.\n\nTIP-INS\n\nTrail Blazers: Evan Turner, who once played for Indiana, was one of seven players in double figures. He had 13 points. ... Portland committed 18 turnovers, their worst total this season in a non-overtime game, but went 17 of 18 from the free-throw line and had a 50-35 rebounding edge. ... The Blazers drew four offensive foul calls in the first six minutes of the game.\n\nPacers: The free-throw shooting woes continued as the Pacers went 13 of 20 from the line. They were also 6 of 19 on 3s. ... Turner had three blocks to tie James Edwards (391) for No. 8 on the franchise's NBA career list. ... Colts kicker Adam Vinatieri received a blue No. 4 jersey between the first and second quarters in honor of becoming the NFL's career scoring leader Sunday.\n\nTHEY SAID IT\n\nTrail Blazers: \"It was a junky, slow game,\" Lillard said.\n\nPacers: \"Those guys (Lillard and McCollum) can really score at a high level,\" Oladipo said. \"We kind of slowed them down. Unfortunately, we didn't get the win.\"\n\nUP NEXT\n\nTrail Blazers: Visit Houston on Tuesday, trying to snap a four-game losing streak in the series.\n\nPacers: Hope to snap a three-game losing streak at Madison Square Garden when they face the New York Knicks on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995207.743977
}