{
  "game_id": "0021600884",
  "espn_id": "400900290",
  "date": "Feb 27, 2017",
  "matchup": "MIL @ CLE",
  "headline": "LeBron shakes off strep throat, leads Cavs past Bucks 102-95",
  "body": "CLEVELAND --  LeBron James returned from sickness, and the Cavaliers felt a whole lot better.\n\nStill not quite himself, James came back after missing one game with strep throat and scored 24 points, Kyrie Irving added 25 and Cleveland capped a solid February with a 102-95 win over the Milwaukee Bucks on Monday night.\n\nJames sat out Saturday's loss to Chicago -- the Cavs fell to 0-4 this season without their superstar -- and was listed as questionable before arriving at Quicken Loans Arena and getting in a workout. He looked fit from the start, delivering an early dunk and adding one in the fourth that he capped by screaming, \"That's and one!\" at MiIwaukee's John Henson, who fouled him.\n\nHe wasn't 100 percent, but even at less than full speed, James can dominate.\n\n\"He brings so much to our team,\" Cavs coach Tyronn Lue said. \"He's just a winner. Anybody who goes to the Finals six straight times is a winner. He just makes everybody better, myself included. ... That's who he is. We needed his juice tonight.\"\n\nJames' dunk and three-point play triggered an 11-0 run that helped put away the Bucks, who were within 86-85 midway through the fourth.\n\nAfter spending much of the weekend recovering, James felt he had enough energy to play and helped the Cavs close the month with a 9-2 record after going 7-8 in January.\n\n\"I felt good enough to lace them up,\" James said.\n\nMalcolm Brogdon scored 20 points to lead Milwaukee, and All-Star Giannis Antetokounmpo scored just nine on 4-of-13 shooting.\n\nThe Bucks may have sustained a costly injury as forward Michael Beasley sprained his left knee in the first half. Beasley's knee buckled grotesquely as he tried to defend James on the baseline. He scored 11 points before going down and had to be helped to Milwaukee's locker room.\n\nBeasley left the building on crutches, and coach Jason Kidd said he will be examined when the team gets home.\n\n\"We'll see how he is,\" Kidd said. \"Hopefully it's not bad where he can get back because he's playing at a very high level for us.\"\n\nLooking to stay on top in the East, the Cavs signed free agent point guard Deron Williams before the game.\n\nThe three-time All-Star gives Cleveland depth, someone to lead its second unit and a reliable backup for Irving. Williams negotiated a buyout of his contract last week with Dallas before being waived and informing the Cavs he wanted to join them and try to win a title.\n\nCleveland is more than happy to add him to a bench that has improved in the last month with the additions of Kyle Korver and Derrick Williams, who combined for 27 points.\n\n\"Automatic leadership,\" James said when asked what Deron Williams brings to Cleveland. \"He's ran a franchise, multiple franchises before, so you know he knows how to run a ball club. He's played in big games before, so you know he won't shy away in the moment. And he can knock down shots and he can play make.\"\n\nON DECK\n\nThe Cavs are interested in signing free agent center Andrew Bogut, waived by Philadelphia after reaching a buyout on Monday. Deron Williams played with the big man in Dallas and has already been in contact with him.\n\nPASSING FANCY\n\nIrving became the eighth player in Cleveland history to reach 2,000 assists, then joked the knock that he's selfish.\n\n\"It's good from a guy who doesn't pass,\" he quipped. \"It's nice.\"\n\nTIP-INS\n\nBucks: Beasley started for G Khris Middleton, who didn't make the trip as part of the team's plan to rest him in back-to-back games. He missed three months with a torn hamstring. ... Antetokounmpo attempted just four free throws after getting 39 attempts over the first three meetings between the teams. ... Kidd enjoys watching Antetokounmpo develop. He's the only NBA player leading his team in points, rebounds, assists, blocks and steals. \"It's a great seat to have,\" Kidd said. \"When you're able to see for the last three years, his growth and understanding, how fast he picked up things and how much he wants to be good in this league.\"\n\nCavaliers: James said he was the only one in his household who fell ill. And while he was better, Lue was under the weather and awaiting results on a strep test. ... Deron Williams received a loud ovation when he was introduced during the fourth quarter. He has worn No. 8 throughout his career, but will don 31 for Cleveland. \"My first high school number was 31,\" he said. \"I wanted a single number, but all of them were pretty much taken.\"\n\nUP NEXT\n\nBucks: Host Denver on Wednesday.\n\nCavaliers: Begin a three-game trip Wednesday at Boston, currently the East's No. 2 team.",
  "source": "espn_api",
  "crawled_at": 1764995158.076546
}