{
  "game_id": "0022300773",
  "espn_id": "401585401",
  "date": "Feb 13, 2024",
  "matchup": "MIL vs. MIA",
  "headline": "Jovic scores career-high 24, Adebayo gets triple-double as Heat beat Bucks 123-97 without Butler",
  "body": "MILWAUKEE -- — Nikola Jovic kept on working and waiting for his chance even as he struggled to earn playing time over the last few weeks.\n\n\r\n              When Jovic returned to the Miami Heat's starting lineup Tuesday, the 20-year-old responded by scoring a career-high 24 points in a 123-97 victory over the Milwaukee Bucks.\n\n\r\n              Not bad for a player who entered having played a total of three minutes since Jan. 27.\n\n\r\n              “I know how much work I need to put in to be able to play,” Jovic said. “It feels great.”\n\n\r\n              Miami's Bam Adebayo had his second triple-double of the season with 16 points, 12 rebounds and 11 assists. Duncan Robinson scored 23 points for the Heat, who never trailed despite playing without Jimmy Butler, who remains on personal leave following the death of a relative.\n\n\r\n              The Heat also were missing Josh Richardson due to a dislocated right shoulder and Terry Rozier because of a sprained right knee.\n\n\r\n              “You talk about the guys we’re plugging in to play, they’ve all played a bunch of quality minutes,” Heat coach Erik Spoelstra said. “It’s not as if you’re playing guys where you’re not really sure whether they can impact winning. These guys have done that. They’ve earned that. They’ve proven that. We have a bunch of competitors in our locker room.”\n\n\r\n              That included Jovic, who started 10 straight games last month before falling out of the rotation. But the 2022 first-round pick never had delivered a performance like this one.\n\n\r\n              Jovic had 21 points by the midway point of the third quarter, surpassing the 2022 first-round pick’s previous career best of 18. Jovic shot 8 of 13 overall and made a career-high five 3-pointers on eight attempts. He also pulled down seven rebounds while playing 30 minutes.\n\n\r\n              “I thought he just completely changed the game tonight with his pace,” Robinson said.\n\n\r\n              Giannis Antetokounmpo had 23 points, 11 rebounds and eight assists for the Bucks but didn’t attempt a free throw all night. The last time Antetokounmpo appeared in a game without getting to the foul line was in a 128-99 victory over the Heat on Feb. 24, 2023, when he only played six minutes before leaving with a knee issue.\n\n\r\n              Khris Middleton missed a fourth straight game for the Bucks with a sprained left ankle.\n\n\r\n              The Bucks were playing one night after a 112-95 triumph over the reigning NBA champion Denver Nuggets. That followed a 120-84 blowout of the Charlotte Hornets, marking the first time all season the Bucks had allowed fewer than 100 points in consecutive games.\n\n\r\n              But Milwaukee and coach Doc Rivers didn’t have any answers for a Heat team playing at less than full strength. Miami shot 51.7% overall, went 19 of 40 from 3-point range and led by 31 points.\n\n\r\n              “They were quicker on everything on both ends,” said Rivers, who fell to 3-6 since taking over for the fired Adrian Griffin. “You have these nights, you have them, but it is what it is. I thought as bad as it looked defensively, I thought our offense was way worse tonight.\"\n\n\r\n              Tyler Herro and Kevin Love added 19 points each for the Heat. Damian Lillard, Malik Beasley and Bobby Portis had 16 points apiece for the Bucks.\n\n\r\n              Lillard scored 11 points in the first five minutes of the third quarter to get a 19-point deficit down to nine, but the Bucks got no closer. Jovic scored the next six points to start a 15-2 spurt that gave the Heat a 94-72 advantage with 2:20 left in the third.\n\n\r\n              Milwaukee didn't threaten again.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Philadelphia on Wednesday.\n\n\r\n              Bucks: At Memphis on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996115.226551
}