{
  "game_id": "401810098",
  "espn_id": "401810098",
  "date": "Nov 17, 2025",
  "matchup": "PHI vs LAC",
  "headline": "Tyrese Maxey and 76ers rally for 110-108 win over James Harden and Clippers",
  "body": "PHILADELPHIA -- — Tyrese Maxey scored 39 points, Paul George had nine points and seven rebounds in his season debut, and the Philadelphia 76ers rallied for a 110-108 victory over the short-handed Los Angeles Clippers on Monday night.\n\n\r\n              Quentin Grimes added 19 points and Andre Drummond had 14 points and 18 rebounds while filling in for Joel Embiid.\n\n\r\n              James Harden scored 28 points for the Clippers, who have lost eight of nine. Harden became the 11th player to eclipse 28,000 career points with a first-quarter layup.\n\n\r\n              Derrick Jones Jr. sat out after injuring his knee in Sunday’s 121-118 loss at Boston. The Clippers also were without Kawhi Leonard (ankle/foot sprain) for the seventh straight game.\n\n\r\n              Embiid (right knee injury management) sat out for the third straight game and eighth of 13 this season. \n\n\r\n              Los Angeles controlled the first 3 1/2 quarters and led 91-81 with 8:44 left on Ivica Zubac’s 10-footer. But Philadelphia used a 14-3 run over the next 2:49, capped by Maxey’s layup, to go in front 95-94. It was close from that point.\n\n\r\n              Drummond made two free throws to put the 76ers ahead 110-106 with 1:08 left. Kobe Sanders made a pair of free throws with 13.8 seconds left to pull the Clippers within two before officials whistled Kris Dunn for a foul on Maxey. But that was overturned to a steal by Dunn after a challenge by the Clippers, giving LA a chance to tie or win.\n\n\r\n              Harden misfired on two 3-point attempts in the final seconds.\n\n\r\n              In addition to Embiid, the 76ers were missing Kelly Oubre Jr. (left knee sprain) and Adem Bona (right ankle sprain).\n\n\r\n              George sat out the first 12 games while recovering from offseason left knee surgery. The nine-time All-Star played 21 minutes.\n\n\r\n              Up next\r\n              Clippers: At Orlando on Thursday night.\n\n\r\n              76ers: Host Toronto on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042642.495384
}