{
  "game_id": "0021500949",
  "espn_id": "400828836",
  "date": "Mar 08, 2016",
  "matchup": "LAL vs. ORL",
  "headline": "Lakers handle Magic 107-98 for rare back-to-back victories",
  "body": "LOS ANGELES -- Even with Kobe Bryant watching in a suit, there was no hangover for the young Los Angeles Lakers after their jaw-dropping victory over Golden State. Late in a miserable season, their impressive young core is getting better.\nD'Angelo Russell scored 27 points, Jordan Clarkson added 24 and the Lakers won consecutive games for the second time since Jan. 3, beating the Orlando Magic 107-98 Tuesday night.\nJulius Randle matched his career high with 23 points and had 11 rebounds in the Lakers' first game since stunning the defending champion Warriors on Sunday.\n\"It was important,\" Randle said. \"We've got to show that we've grown. We're not just satisfied with one game, but we're able to come back the next game and play that well again.\"\n\nBryant sat out to rest his sore right shoulder, but the Lakers didn't need their leader. Russell, Randle and Clarkson scored 20 points apiece in the same game for the first time as the three young stars gave a tantalizing glimpse of the Lakers' future late in the worst three-season stretch in the 16-time NBA champion franchise's history.\n\"The second half, we came out and played with the same fire and intensity and passion that we played with for 48 minutes against the Golden State Warriors,\" coach Byron Scott said. \"The last couple games, I'm pretty happy with the effort. Our attention to detail is much better. It's a very small sample, but these two games, if it's any indication on how we can play for the rest of the season, I think we'll all be pretty happy.\"\nVictor Oladipo scored 26 points and Evan Fournier had 23 for the Magic, who have lost three straight, including the first two stops on their four-game West Coast road trip. Orlando didn't really threaten down the stretch as the Lakers comfortably held on for their 14th win of the season.\n\"We played like we were tired, like we didn't want to win,\" Fournier said. \"On good nights, we're full of focus on what's going on on the floor. It's very frustrating. We should have won.\"\nBIG THREE IN THE THIRD\nRussell, Clarkson and Randle combined for 31 of the Lakers' 39 points in the third while the club matched its highest-scoring quarter of the season. Russell had 14 points on 6-for-9 shooting in the period, securing his sixth 20-point game in nine outings since the rookie No. 2 pick rejoined the starting lineup.\n\"They had the three best players on the floor tonight,\" Orlando coach Scott Skiles said.\nKEEP IT REAL\nThe Lakers improved to 6-24 since Jan. 3, but they still sit last in the Western Conference and second-worst in the overall NBA standings. The back-to-back wins will alarm the portion of the Lakers' fans hoping for another miserable season to maximize their chances of keeping their first-round pick, which will go to Philadelphia if it isn't among the top three after the May 17 lottery.\nLOW FLOW\nElfrid Payton said the Magic's energy was \"very low. We didn't have a lot of energy, and it kind of showed. If you look back a couple of games, we also lacked energy.\"\nNO KOBE\nBryant has skipped four of the last five home games in his farewell season, and Scott believes he's 50-50 to play against LeBron James and Cleveland on Thursday. Bryant's absence disappointed a crowd that included Novak Djokovic, Alex Ovechkin and Robbie Keane, although Ovechkin left with a Bryant jersey after posing for a photo with Djokovic and Bryant.\nTIP-INS\nMagic: Jason Smith started and scored 10 points despite being questionable with a bruised quadriceps muscle. ... USC product Nikola Vucevic, who hit the game-winning jumper to beat the Lakers in Orlando on Nov. 11, missed his second straight game with a groin strain.\nLakers: Metta World Peace appeared in three straight games for the Lakers for the first time in three months. The veteran forward hit his first 3-pointer since Jan. 10 while scoring four points. ... Djokovic has lost fewer tennis matches (46) since 2010 than the Lakers have lost games this season.\nUP NEXT\nMagic: At Kings on Friday.\nLakers: Host Cavaliers on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994253.1353211
}