{
  "game_id": "0021500701",
  "espn_id": "400828588",
  "date": "Jan 29, 2016",
  "matchup": "OKC vs. HOU",
  "headline": "Westbrook's triple-double leads Thunder past Rockets 116-108",
  "body": "OKLAHOMA CITY -- Russell Westbrook once again did a little bit of everything for the Thunder.\nHe finished Friday night with 26 points, 14 assists and 10 rebounds, his sixth triple-double of the season, the third in his past nine games and the 25th of the Oklahoma City point guard's career.\nIt also was the seventh time in nine games Westbrook has had 10 or more assists as the Thunder took advantage of center Dwight Howard's ejection and beat the Houston Rockets 116-108.\n\"It's part of my job, man,\" Westbrook said. \"Just trying to find guys, getting the ball where they can score, keep the pace up.\"\n\nHoward was ejected in the third quarter after picking up his second technical foul. Kanter scored 20 of his 22 points after that to help the Thunder gain control.\n\"Obviously, when you lose a guy of that caliber, they've got a guy they can counter with with Kanter, who's a really good low-post scorer,\" Houston interim coach J.B. Bickerstaff said. \"With Dwight in there, we can shut that down. He can guard guys one-on-one in the post. Kanter was able to get it going a little bit after Dwight went out.\"\nKevin Durant had 33 points and 12 rebounds for the Thunder, who have won 10 of 11 and six straight at home.\nJames Harden had 33 points, seven rebounds and seven assists, but he made just 2 of 10 field goals in the second half. Corey Brewer added 17 points for the Rockets, who shot 38 percent overall and made just 9 of 39 3-pointers and 27 of 43 free throws.\n\"They want to shoot threes and get layups, and I think we closed all of that off tonight,\" Durant said. \"We were there on the catch for them guys and we didn't just let them play freely. When we do that, we're a scary team.\"\nBickerstaff said shots simply weren't falling.\n\"We've got to take those shots with confidence and we believe in the guys that are taking those shots,\" he said. \"Tonight they didn't go. The past few weeks they've been falling and they'll go again. Guys work on it. They've got to trust their training, shoot them with confidence and we'll get them.\"\nThe Rockets led 58-55 at halftime. They led by as many as 12 points in the second quarter, but Howard made just 2 of 9 free throws in the period to help the Thunder creep back into the game.\nHoward was ejected with 7:06 left in the third quarter -- Bickerstaff said after the game he was told it was for something Howard said. The Thunder finally took the lead on a putback by Kanter, and a dunk by Durant on an assist from Westbrook put Oklahoma City ahead 80-76. The Thunder led 89-83 at the end of the third quarter.\nWestbrook got his triple-double on an assist to Kyle Singler, who scored and was fouled. Singler's free throw put Oklahoma City ahead 101-92.\nNOT FREE\nHoward missed 11 free throws in the game, despite leaving early. DeAndre Jordan of the Los Angeles Clippers and Andre Drummond of the Detroit Pistons are the only players in the league to have missed more than 11 free throws in any game this season. Drummond has done it three times and Jordan twice.\nQUOTABLE\nKanter on Thunder's emphasis on defense: \"We've been talking about it this morning, the day before, the day before and the day before, we've been talking about defense.\"\nSTAT LINES\nOklahoma City improved to 21-4 all-time when Westbrook gets a triple-double.\nTIP-INS\nRockets: Harden, a former Thunder player, was booed loudly during pregame introductions. ... Howard's first technical came after he put Singler in a headlock during a battle for a rebound in the second quarter. ... Howard finished with eight points and eight rebounds in 21 minutes.\nThunder: Houston Astros pitcher Dallas Keuchel was in the crowd. He is from Tulsa, Oklahoma. ... Cameron Payne (concussion) and Andre Roberson (right knee sprain) did not play. ... Dion Waiters, who started in Roberson's place, got a technical in the final seconds of the third quarter. He finished with 16 points. ... Oklahoma City scored at least 100 points for the seventh straight game. ... Steven Adams and Kanter each had 10 rebounds.\nUP NEXT\nRockets: Host Wizards on Saturday.\nThunder: Host Wizards on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994162.068623
}