{
  "game_id": "0022200305",
  "espn_id": "401468460",
  "date": "Nov 28, 2022",
  "matchup": "DEN vs. HOU",
  "headline": "Jokic, Murray lead Nuggets to 129-113 win over Rockets",
  "body": "DENVER -- — Nikola Jokic had 32 points and 12 rebounds, Jamal Murray scored a season-high 31 and the Denver Nuggets defeated the Houston Rockets 129-113 on Monday night.\n\n\r\n              The win was the Nuggets’ third in a row following a home loss last Tuesday against lowly Detroit.\n\n\r\n              “I also know this team has another level, another gear that we can get to,” Denver coach Michael Malone said. “Knowing that we had eight new guys coming in, knowing that we were bringing back a Jamal Murray and a Michael Porter, it wasn’t going to happen in the first 20 games, especially with all the injuries and COVID illnesses that we’ve had early on. When you account for the lack of continuity, the schedule, the injuries and the different lineups, I’m incredibly proud of our group for being where we are.”\n\n\r\n              Jokic and Murray combined to shoot 64.7% from the field. It marked the third time in the past four games Jokic scored more than 30 points. He finished two assists shy of his fourth triple-double this season. \n\n\r\n              Murray, one of the NBA's best outside shooters, was 11 of 17 from the floor and drained four of his eight 3-pointers after knocking down just 12 of 33 field goal attempts in two games since returning from health and safety protocols last Tuesday.\n\n\r\n              “I just missed the open shots,” Murray said. “Even the ones I tried to create, I just felt like I let us down because I didn’t make them. When I take them, I expect to make them. It was frustrating when I shoot and miss shots that everybody’s used to me making.”\n\n\r\n              Malone thinks Murray has a chance to be \"an all-NBA type player.” \n\n\r\n              “To do that, the scoring, rebounding, the playmaking and, most importantly, defense has to be there every night. But I think he’s really finding his offensive rhythm and his confidence. I’m happy for him. I care about Jamal. It’s been a long journey for that kid,\" Malone said.\n\n\r\n              The Nuggets outscored Houston 62-42 in the paint. Zeke Nnaji matched a season high with 15 points off the bench.\n\n\r\n              Alperen Sengun led five Rockets in double figures with 18 points.\n\n\r\n              Houston (5-15) has the worst record in the Western Conference, but had won three of its previous five games.\n\n\r\n              Murray's 3 with 4:33 remaining in the third quarter stretched the Nuggets’ lead to 96-84 and capped a 15-4 run. After the Rockets got within seven, Denver scored the final eight points of the period, finished off by Nnaji's 3 at the buzzer. \n\n\r\n              The Nuggets’ lead grew to 20 in the fourth quarter.\n\n\r\n              “I feel like we exerted a lot of energy in that third,” Rockets guard Kevin Porter Jr. said. “It’s already hard playing in Colorado and it definitely came in as a factor. I feel like we just ran out of gas in that third quarter.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: G Bones Hyland missed his third consecutive game with a non-COVID-19 illness. Hyland, a first-round draft pick in his second year with the team, is averaging 15 points per game this season. … F Michael Porter Jr. didn’t play as he continues to deal with a bruised left heel. It was the third straight game he missed. Malone said Porter “will come back when he’s ready.” Porter is averaging 16.4 points, tied for the third-highest mark on the team.\n\n\r\n              Rockets: G Jalen Green had 17 points and a team-high seven assists. … With his father, former Nuggets forward Kenyon Martin, in attendance, F Kenyon Martin Jr. had 15 points.\n\n\r\n              UP NEXT\n\n\r\n              The teams play in Denver again Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994726.156235
}