{
  "game_id": "0021800621",
  "espn_id": "401071297",
  "date": "Jan 11, 2019",
  "matchup": "PHI vs. ATL",
  "headline": "Hawks stun 76ers 123-121 on Collins' late jumper",
  "body": "PHILADELPHIA --  Jimmy Butler had 30 fateful seconds in the fourth to forget.\n\nThe Philadelphia 76ers star guard lost the ball in a tie game on a drive down the lane that led to Atlanta's John Collins finding separation and burying a fadeaway jumper with 25 seconds left for the lead.\n\nButler had a chance at atonement -- he was 12 for 12 at the free-throw line and had two shots with 2.4 seconds left.\n\nFirst shot, rattle and miss.\n\nSecond shot, clang off the back of the rim.\n\nWilson Chandler slipped under the basket on the second attempt and missed his gimmie tip-in at the horn that helped the Hawks hang on to beat the Sixers 123-121 on Friday night.\n\n\"I hope we're still together,\" Butler said. \"Nobody pointing fingers at anybody.\"\n\nThere were at least a few raised eyebrows after the hapless Hawks (13-29) sent the Sixers to just their fourth home loss of the season. The Sixers struggled with All-Star center Joel Embiid out with a sore ankle suffered in a loss to Washington on Wednesday. His presence was missed -- Embiid leads the 76ers with averages of 26.9 points and 13.4 rebounds in 40 games -- and the Hawks pounced.\n\nAtlanta crushed the Sixers with 62 points in the paint and outrebounded Philly 44-30.\n\n\"You can start all over the place and whether it's Joel or not Joel, you know we should be better defensively,\" coach Brett Brown said. \"It's where we anchored our program and at the moment, we are poor. Right now, lately, we have been poor.\"\n\nThe Hawks were happy to capitalize and hit 12 3s and shot 56 percent overall from the floor. Collins scored 25 points and Kevin Huerter hit five 3s and led the Hawks with 29 points.\n\n\"I had a pretty good rhythm in the fourth quarter and we just kind of kept running plays that were working for us,\" Huerter said.\n\nButler led the Sixers with 30 points and Ben Simmons had 23 points, 15 assists and 10 rebounds.\n\nThe game turned into a 3-point shootout late -- the teams combined for 23; seven in the fourth.\n\nJJ Redick, who missed the last two games with a sore back, led a comeback in the fourth with a pair of 3-pointers that tied the game each time. TJ McConnell put the 76ers ahead by one with 2:39 left. Huerter buried a 3 to tie it at 121.\n\nButler had his first major miscue when he lost the ball on a drive down the lane that was recovered by Atlanta. Collins hit the jumper and that was enough for the lowly Hawks.\n\n\"We just got to fix it,\" Butler said. \"I think we're going to be fine. All I know is, everybody's in there. We're in it together. We're not going separate ways.\"\n\nTIP-INS\n\nHawks: Coach Lloyd Pierce made a homecoming of sorts after spending five years on Brown's staff with the Sixers. Pierce said he owed Brown so much for helping him become a head coach. Brown said Pierce was one of his first hires as \"The Process\" began in 2013.\n\n\"It is not a me versus them, it's still us. It's about us,\" Pierce said.\n\n76ers: Brown said G Markelle Fultz (thoracic outlet syndrome) is undergoing therapy in Philadelphia and may rejoin the team soon. ... Justin Patton (broken foot) could return in early February. ... Zhaire Smith (foot) has individual workouts, but has not yet practiced with the team this season.\n\nFOMO\n\nThe 76ers will retire Moses Malone's No. 2 in a halftime ceremony of the Feb. 8 game against Denver. The Sixers also will unveil a Malone sculpture on their Legends Walk at team headquarters in New Jersey.\n\nMalone was a three-time NBA MVP, 13-time All-Star (12 times in NBA, once in ABA), Hall of Fame inductee and member of the 50 Greatest Players in NBA history. In 1983, he helped the Sixers roll through the playoffs and sweep the Lakers in the finals -- the last time they won a championship.\n\nBefore the playoffs that year, Malone was asked about the team's prospects. He is remembered as much for his answer to that question as he is for his dominance on the court.\n\n\"Fo', fo', fo',\" Malone said, predicting three straight sweeps.\n\nWHAT A DRAG\n\nLate in the third, Alex Len planted an elbow in Butler's face on the block that knocked the four-time All-Star to the ground. Butler remained seated and appeared to exchange words with Len. McConnell yanked Butler by the right shoulder and dragged him about 15 feet to the free-throw line to keep the tension from escalating. The refs threw it to New York for a review and Len was hit with a flagrant foul.\n\nUP NEXT\n\nHawks: Host Milwaukee on Sunday.\n\n76ers: Play Sunday at New York.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994033.930977
}