{
  "game_id": "0022300404",
  "espn_id": "401585032",
  "date": "Dec 25, 2023",
  "matchup": "MIA vs. PHI",
  "headline": "Jaime Jaquez Jr. scores 31, Spoelstra moves to 9-0 on Christmas as Heat top 76ers 119-113",
  "body": "MIAMI -- — The first thing Miami rookie Jaime Jaquez Jr. did when the schedule was released this summer was check to see when the Heat play in his hometown of Los Angeles.\n\n\r\n              The second thing was seeing if they played on Christmas.\n\n\r\n              “I was excited,” Jaquez said.\n\n\r\n              And it showed. Jaquez scored 31 points and got his first double-double, Bam Adebayo finished with 26 points and 15 rebounds and the Heat held on to beat the Philadelphia 76ers 119-113 on Monday night.\n\n\r\n              “Great to get a win, career night, Christmas,” Jaquez said. “I grew up watching these games and to be able to play and have a career night, I just go back to all the hard work, late nights in the gym, preparing for moments like this.”\n\n\r\n              Heat coach Erik Spoelstra improved to 9-0 on Christmas, the best record in NBA history for head coaches on the holiday.\n\n\r\n              “It’s an incredible honor and you don’t ever want to take it for granted,” Spoelstra said of playing on the holiday. “It really does mean something. You’re viewed as a contending team, typically, if you’re playing on Christmas.”\n\n\r\n              Reigning MVP and two-time defending scoring champion Joel Embiid missed the game for Philadelphia because of an ankle sprain.\n\n\r\n              Tobias Harris scored 27 points for the 76ers, and Kelly Oubre Jr. added 25. Mo Bamba scored 18, De’Anthony Melton had 15 and Tyrese Maxey — who shot 4 for 20 from the floor — finished with 12.\n\n\r\n              “They made him work,” 76ers coach Nick Nurse said of Maxey's night. “I do think that he got to some pretty good places and just kind of had one of those nights. ... Just one of those tough nights for him.”\n\n\r\n              Tyler Herro scored 22 points, Duncan Robinson added 16 and Kyle Lowry had 12 for the Heat in what became his first Christmas win. Jaquez also grabbed 10 rebounds for Miami, which held a 56-36 edge on the boards.\n\n\r\n              The Heat were again without Jimmy Butler (calf strain) and also ruled out Josh Richardson (back discomfort) and Haywood Highsmith (non-COVID illness) — then lost starting forward Caleb Martin in the first half to an ankle sprain.\n\n\r\n              It was 86-86 after three quarters, the sort of score that suggests it had been close for much of the way to that point.\n\n\r\n              That was not the case.\n\n\r\n              Philadelphia started hot, then Miami opened a huge lead — helped by Philly missing 14 straight shots in what became a 21-1 Heat first-half run — and the 76ers then not even needing a full quarter to erase what eventually was a 21-point Heat edge in the third.\n\n\r\n              But Jaquez and Adebayo each had 10 points in the fourth, and the Heat escaped.\n\n\r\n              Only six rookies in NBA history — Wilt Chamberlain (45), Walt Bellamy (35), LeBron James (34), Bill Cartwright (33), Patrick Ewing (32) and Oscar Robertson (32) — scored more on Christmas than Jaquez did Monday. Even Michael Jordan only managed 30 in his first Christmas game, which came in his third season with Chicago.\n\n\r\n              “He was tough,\" Nurse said of Jaquez. “He made a lot of big buckets, when they needed buckets.\"\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit Orlando on Wednesday.\n\n\r\n              Heat: Visit Golden State on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996680.3763149
}