{
  "game_id": "0022400603",
  "espn_id": "401705169",
  "date": "Jan 20, 2025",
  "matchup": "PHX @ CLE",
  "headline": "Donovan Mitchell scores 33 points and propels NBA-leading Cavaliers to easy 118-92 win over Suns",
  "body": "CLEVELAND -- — Donovan Mitchell scored 33 points — 23 in the second half — and Darius Garland added 16 as the Cleveland Cavaliers began the season's unofficial second half by dominating the Phoenix Suns 118-92 in a Martin Luther King Jr. Day matinee on Monday.\n\n\r\n              The Cavs, who opened the season with 15 straight wins, improved the NBA's best record to 36-6 — tied for the eighth-best start in history. They're also 21-2 at home and 13-1 against Western Conference teams.\n\n\r\n              Cleveland had little trouble handling the Suns despite missing three rotational players as forwards Evan Mobley (calf), Isaac Okoro (shoulder) and guard Caris LeVert (wrist) sat out with injuries.\n\n\r\n              Kevin Durant scored 23 to lead Phoenix, which had won five of six. Devin Booker added 15 — 10 below his average — and had six turnovers.\n\n\r\n              Suns guard Bradley Beal returned after missing the last two games with left ankle sprain and scored just five points in 25 minutes.\n\n\r\n              Takeaways\r\n              Suns: Booker never got going offensively and failed to reach 30 points for the first time in six games.\n\n\r\n              Cavaliers: Without Mobley, Cleveland was missing 18.8 points, 8.6 rebounds and his defensive presence. It put stress on Cleveland's front line, but Jarrett Allen scored 12 and backup Tristan Thompson gave coach Kenny Atkinson a season-high 10 rebounds in 26 minutes.\n\n\r\n              Key moment\r\n              With the Suns making a push in the third, Mitchell made consecutive 3-pointers in the final 36 seconds to give Cleveland a 93-70 lead.\n\n\r\n              Key stat\r\n              Garland’s first 3-pointer was the 803rd of his career, moving him past Mark Price (802) on the Cavs' all-time list. Only LeBron James (1,251) and Kevin Love (1,096) made more in Cleveland history.\n\n\r\n              Up next\r\n              The Suns visit Brooklyn on Wednesday, while the Cavaliers play in Houston that night. Cleveland is traveling a day early to get ahead of a winter storm forecast to hit Texas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764998236.327082
}