{
  "game_id": "0022201128",
  "espn_id": "401469283",
  "date": "Mar 27, 2023",
  "matchup": "MIN @ SAC",
  "headline": "Timberwolves win 119-115 to deny clinching party for Kings",
  "body": "SACRAMENTO, Calif. -- — Jaden McDaniels scored 20 points and the Minnesota Timberwolves spoiled Sacramento's hopes for a clinching party by beating the Kings 119-115 on Monday night.\n\n\r\n              The Kings were hoping to end the longest playoff drought in NBA history in front of their fans, but sent them home unhappy. \n\n\r\n              “Guys wanted to clinch a playoff spot at home and wanted to share it with our fans,” guard De'Aaron Fox said. “But at the end of the day, regardless of where we do it, I think people are going to be appreciative and people are going to love it.”\n\n\r\n              The Timberwolves won their fourth straight game and swept a back-to-back set at Golden State and Sacramento to tie the Warriors for sixth place in the Western Conference playoff race. The top six teams avoid the play-in tournament.\n\n\r\n              “These guys really like each other and love playing with each other,\" coach Chris Finch said. “They have lifted their game with the games being so big.”\n\n\r\n              Minnesota wasn't fazed by the frenzied sellout crowd and pulled away in the fourth quarter. \n\n\r\n              Naz Reid hit a 3-pointer to give the Timberwolves a six-point lead early in the fourth, and McDaniels' emphatic dunk made it 114-104 with about four minutes left.\n\n\r\n              The Kings had a chance to make it close late, but Keegan Murray missed a 3 from the corner that could have cut the deficit to three with 42 seconds left.\n\n\r\n              Reid added 18 points, Anthony Edwards scored 17 and Rudy Gobert had 16 points and 16 rebounds.\n\n\r\n              “We know we have the talent and the personnel to be able to beat anybody on any given night,\" Gobert said. \"Really out of urgency and consistency ... we play every game like it’s our last and we play every game like there’s no tomorrow. That’s the mindset that we need.” \n\n\r\n              Fox scored 29 points and Domantas Sabonis added 24 points and 10 rebounds for Sacramento. The Kings struggled from the outside, shooting just 5 of 26 on 3-pointers. \n\n\r\n              Sacramento now will look to clinch its first playoff berth since 2006 later this week, when the Kings travel to Portland for two games.\n\n\r\n              Sacramento's 16-year stretch without a playoff appearance is the longest in NBA history and the longest active postseason drought among any team in the NBA, NFL, NHL or Major League Baseball.\n\n\r\n              The excitement in Sacramento was palpable leading up to the game, with success-starved fans eager to have something consequential to celebrate.\n\n\r\n              The stakes might have contributed to a shaky start for the Kings, who fell behind by 13 in the first quarter. But led by an emphatic dunk for a three-point play by Sabonis and three baskets in the final minute of the half, the Kings took a 58-57 lead into the break. \n\n\r\n              The game stayed close from there until the Timberwolves pulled away in the fourth quarter.\n\n\r\n              “Obviously a missed opportunity tonight to get this game, but the season continues on,” Kings forward Harrison Barnes said. \n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Star big man Karl-Anthony Towns sat out the back end of a back-to-back as he deals with a lingering right calf strain. ... F Taurean Prince (illness) also missed the game.\n\n\r\n              Kings: Murray made one 3-pointer to give him 185 on the season, tied with Damian Lillard for the second-most ever by a rookie. Donovan Mitchell holds the record with 187 in 2017-18. ... Kings owner Vivek Ranadive missed the game because he was home sick with pneumonia.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Phoenix on Wednesday night.\n\n\r\n              Kings: At Portland on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995011.678184
}