{
  "game_id": "0021900657",
  "espn_id": "401161299",
  "date": "Jan 22, 2020",
  "matchup": "MEM @ BOS",
  "headline": "Tatum scores 23 before injury, Celtics down Grizzlies 119-95",
  "body": "BOSTON --  Jayson Tatum has been the Celtics' savior multiple times this season when his teammates have struggled offensively.\n\nHe did it again to help key Boston's rout of one of the league's hottest teams.\n\nTatum scored 23 points before leaving the game in the third quarter with a groin injury as the Celtics ran past the Memphis Grizzlies 119-95 on Wednesday night.\n\nDaniel Theis had 14 points, and Enes Kanter finished with 13 points and eight rebounds to help Boston win its second straight. Memphis has lost two in a row since posting a season-high, seven-game win streak. It was the Celtics' eighth straight win over the Grizzlies.\n\n“I thought our guys really dug in on the defensive end of the floor,\" Celtics coach Brad Stevens said. “Then (Tatum) scored a bunch of buckets there in a row and pushed it out. Our other guys were struggling to get any real rhythm offensively. He kind of got us going. Then in the third quarter every one of those guys picked up where he left off.”\n\nJonas Valanciunas led Memphis with 16 points and 13 rebounds. Jaren Jackson Jr. and Solomon Hill each added 13 points.\n\n“That's what their known for. We should have matched it better,\" Jackson said. \"They did some things differently. Credit to them for playing hard and playing feisty.”\n\nTatum limped to the locker room with a right groin strain with 4:43 left in the third. He returned to the bench at the start of fourth quarter with his right leg wrapped, but was still noticeably in pain and did not return.\n\nBut Boston didn't need him, using an 22-3 run -- capped by a 3-pointer by Gordon Hayward -- to increase their 12-point halftime lead to 87-54. Kemba Walker, Hayward and Marcus Smart scored 18 of Boston's first 20 points in the period. Boston was 6 of 7 from the 3-point line. It was the worst third quarter of the season for Memphis, which was outscored by 22 points.\n\nThe Celtics' lead grew as high as 38 points in the fourth.\n\n“I think we got a lot of deflections, we were active defensively and we were in the right spots,\" Hayward said. \"Because of that, we were able to run, and then we got out and got some easy ones.”\n\nStevens said Tatum would be checked out further, but doesn't think the injury is significant.\n\nBoston missed 13 of its first 17 field goal attempts, including going 1 of 8 from the 3-point line. Walker, Hayward and Smart scored just six points between them in the first half, combining to go just 1 of 16 from the field.\n\nIt helped Memphis, which had the highest scoring offense last month (118.7 per game since Dec. 9), to take a 42-35 lead in the second quarter.\n\nBut Boston got its footing and used a 23-0 run to take a 58-42 advantage. The Grizzlies went scoreless for 6:51 until Valanciunas scored with just 1.3 seconds left before halftime.\n\nTIP-INS\n\nGrizzlies: F Bruno Caboclo missed his third straight game with left knee soreness.\n\nCeltics: F Jaylen Brown sat out with a sprained right ankle. ... Tatum has scored in double figures for 33 consecutive games.\n\nSHARING THE BALL\n\nBoston finished with 32 assists on 44 made field goals. The Celtics had 31 assists in their 32-point win over the Lakers on Monday.\n\n“You can feel the last two games the way the ball's whipping around. That's who we have to be,” Stevens said. “I've been really encouraged by that the last two games.”\n\nINJURY UPDATE\n\nCeltics big man Robert Williams (left hip bone edema) was able to do some light running Tuesday. Celtics coach Stevens said he will have another scan done on the hip and will then see a specialist on Feb. 4.\n\nThe meeting with doctors will give the team a better idea of when Williams might be able to return. But it still won't be before the All-Star break, Stevens said. He hasn't played since Dec. 6.\n\nUP NEXT\n\nGrizzlies: Visit Detroit on Friday.\n\nCeltics: At Orlando on Friday.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995712.723998
}