{
  "game_id": "0021500435",
  "espn_id": "400828322",
  "date": "Dec 23, 2015",
  "matchup": "OKC @ LAL",
  "headline": "Thunder rout Lakers again, 120-85",
  "body": "LOS ANGELES -- The Oklahoma City Thunder and the Los Angeles Lakers appear to have become one of the most one-sided mismatches in the NBA. It used to be the other way around before the Thunder drafted Kevin Durant and Russell Westbrook.\nWestbrook had 23 points, eight assists and eight rebounds, and the Thunder steamrolled the Los Angeles Lakers for the second time in five days, 120-85 on Wednesday night.\n\"I knew after what happened in Oklahoma City, the Lakers would come out and really compete,\" rookie coach Billy Donovan said. \"I thought Kevin could have taken a lot more shots tonight, but he was really insistent on doing a great job of finding people, setting people up and making the game easy.\"\nOklahoma City has won 12 of the last 15 meetings with the Lakers, with all three losses coming at Staples Center. In the 15 meetings prior to that stretch, Oklahoma City lost 14 times. Needless to say, the arrival of Durant and Westbrook had everything to do with the reversal of fortunes.\n\nDurant added 21 points for the Thunder in a rematch of their game at Oklahoma City, when they trounced the Lakers 118-78 with runs of 18-0 and 17-2.\nKobe Bryant didn't play that night because of a sore right shoulder, but his presence made little difference this time, as the Thunder blew the game wide open with a 22-0 burst during the first 5:21 of the third quarter and build a 79-46 lead.\n\"It was like the starting gates opened up and the horses ran out,\" Bryant said. \"That third quarter, they just blitzed us, man. They got ahead with their athleticism and their speed and their length, and we we couldn't get the game under control.\"\nThe Thunder, whose string of six consecutive Northwest Division titles ended last season when they finished second behind Portland and missed the playoffs due to a rash of injuries, lead their division again with a 20-9 record under Donovan.\nBryant, who equaled a season high with 31 points Tuesday night in the Lakers' 111-107 win at Denver, played on consecutive nights for the fourth time this season and finished with 19 points on 7 for 22 shooting in 27 minutes.\n\"Listen, you have to be realistic about what we're facing and where we are right now as a team and as an organization,\" Bryant said after the Lakers' record dropped to 5-24. \"I mean, you can train a cat to bark all you want, but the damn cat's not going to bark. So there's no sense in yelling at it.\"\nThe Thunder, back at Staples Center two nights after beating the Clippers 100-99, won for the ninth time in 10 games. They've beaten the Lakers six straight times, matching the longest such streak by the Oklahoma City/Seattle SuperSonics franchise.\nOklahoma City led 57-46 at halftime after shooting 56 percent and ending the second quarter with a 14-2 run after the Lakers erased a 15-point deficit. Westbrook and Serge Ibaka each scored 14 points in the half, offsetting 17 by Bryant.\nBryant had a rough first quarter with Durant guarding him. He had a baseline jumper blocked by the 6-foot-9 forward and went 0 for 4 from 3-point range -- including an airball from in front of the Lakers' bench. Durant preserved Oklahoma City's win over the Clippers by blocking Chris Paul's 18-foot jumper as time expired -- right after scoring the go-ahead basket with 5.8 seconds left.\n\"I hadn't played against him in a while, and I forgot how long he was,\" Bryant said. \"He plays with no fear. I'd still like to see him post-up more. He'd be unstoppable in the block, at his size. But he's just a fantastic player. That's the type of stuff that I'll miss -- the competition That's the fun stuff.\"\nTIP-INS\nThunder: The Thunder outscored the Lakers 58-18 in the paint through the first three quarters before Donovan and Lakers coach Byron Scott each rested all of their starters throughout the fourth. . The Thunder are 14-2 against Western Conference teams.\nLakers: F Julius Randle did not play because of an ankle injury, and swingman Nick Young was sidelined because of gastroenteritis. ... Bryant, who turned 37 in August, will play in his 16th and final Christmas Day game on Friday -- an NBA record. He holds the record for most points on Christmas with 383, despite having sat out the previous two years because of injuries. ... The Lakers recalled C Tarik Black and F Ryan Kelly from the D-League's L.A. Defenders.\nUP NEXT\nThunder: Host Chicago on Friday.\nLakers: Will face the Clippers on Christmas for the first time since 1991.",
  "source": "espn_api",
  "crawled_at": 1764994187.301607
}