{
  "game_id": "0022401099",
  "espn_id": "401705665",
  "date": "Apr 01, 2025",
  "matchup": "CHI vs. TOR",
  "headline": "Coby White scores 28 and Bulls secure a spot in play-in tournament with 137-118 win over Raptors",
  "body": "CHICAGO -- — Coby White scored 28 points, Talen Horton Tucker had 27 points and the Chicago Bulls locked in a spot in the Eastern Conference play-in tournament with a 137-118 win over the Toronto Raptors on Tuesday night.\n\n\r\n              Nikola Vucevic shot 9 for 12, including 2 for 3 from 3-point range to finish with 22 points, while adding 10 rebounds and seven assists.\n\n\r\n              The Raptors were led by Ja’Kobe Walter, with 17 points while Immanuel Quickley added 17 points and nine assists .\n\n\r\n              The Bulls took the lead with 1:22 left in the first quarter and never looked back. The score was 70-57 by halftime. Horton-Tucker led the way with a team-high 18 second-half points.\n\n\r\n              Takeaways\r\n              The Raptors came in having won four straight and six of their last 10 to keep their faint hopes at the play-in tournament alive. This loss eliminated those hopes.\n\n\r\n              Bulls: This victory locked in a spot in the play-in tournament for Chicago. Hours after White was named the Eastern Conference player of the month for March, his 28 points came in 34 minutes.\n\n\r\n              Key moment\r\n              The Bulls trailed by 10 only to finish the first quarter on a 30-13 run. They led by as much as 28 thanks to a 32-22 edge in the third quarter when they used a 10-0 run to turn a 76-68 lead into an 86-68 lead with 5:31 to play in the quarter. Vucevic had six points in the run and White had four.\n\n\r\n              Key stat\r\n              Chicago dominated the paint, outscoring the Raptors 70-44 and outrebounding them 49-35. The Bulls also shot 23 of 27 from the line, while Toronto was 10 for 11.\n\n\r\n              Up next\r\n              The Raptors return home to play the Portland Trail Blazers on Thursday night. The Bulls play host to the Trail Blazers on Friday night.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997025.303261
}