{
  "game_id": "0022400669",
  "espn_id": "401705235",
  "date": "Jan 29, 2025",
  "matchup": "SAC @ PHI",
  "headline": "Maxey scores 30 points and 76ers top Kings 117-104 for their 4th straight victory",
  "body": "PHILADELPHIA -- — Tyrese Maxey scored 30 points to lead the Philadelphia 76ers past the Sacramento Kings 117-104 on Wednesday night for their fourth straight victory.\n\n\r\n              Maxey, who had his 12th consecutive game with 25 or more points, added eight assists. Kelly Oubre Jr. scored 15 points, Eric Gordon added 14 and Ricky Council IV 13 for the 76ers, who have rebounded from a seven-game skid.\n\n\r\n              Malik Monk scored 16 of his 21 points in the first half for the Kings. Domantas Sabonis had his second straight triple-double and eighth of the season with 13 points, 14 rebounds and 11 assists.\n\n\r\n              Takeaways\r\n              Kings: De’Aaron Fox, in the first game since an ESPN reported the Kings could be open to trading the All-Star guard, scored 19 points. The Kings are 1/3 on their six-game road trip after starting with 10 wins in their first 12 games under interim coach Doug Christie, who took over Dec. 27. \n\n\r\n              76ers: Got 37 points from their reserves, a struggle at times given the injuries they’ve suffered. Council led the way with 13 points and Kyle Lowry added 10 points and eight assists.\n\n\r\n              Key Moment\r\n              DeMar DeRozan committed a flagrant foul on Council with 42.1 seconds left in the third quarter. Council hit two free throws, then Reggie Jackson made a 3-pointer for a five-point possession, part of a 14-2 run that put the 76ers up for good.\n\n\r\n              Key Stat\r\n              The 76ers tied their season high with their fourth straight win. The other four-game streak ended on Jan. 1 when they allowed the Kings to score the final 15 points of a 113-107 loss in Sacramento.\n\n\r\n              Up Next\r\n              Kings: Play Saturday at Oklahoma City.\n\n\r\n              76ers: Continue a six-game homestand when they face Denver on Friday night.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997329.5395598
}