{
  "game_id": "0022300227",
  "espn_id": "401584855",
  "date": "Nov 22, 2023",
  "matchup": "ATL vs. BKN",
  "headline": "Trae Young scores season-high 43 points, Hawks outlast Nets 147-145 in overtime",
  "body": "ATLANTA -- — Trae Young scored a season-high 43 points, including 14 in overtime, and the Atlanta Hawks outlasted the Brooklyn Nets 147-145 on Wednesday in their second shootout in two nights. \n\n\r\n              A night after falling 157-152 to the Indiana Pacers, the Hawks showed no fatigue. Atlanta led 45-33 after one quarter and Young had 19 points and six 3-pointers, the most he has made in any period in his career.\n\n\r\n              “I want to impose my will on the game as much as I can when I go out and play,” Young said.\n\n\r\n              De’Andre Hunter had 25 points and 11 rebounds, and scored nine straight points for the Hawks in the fourth quarter. Clint Capela finished with 14 points and 15 rebounds as Atlanta snapped a three-game losing streak and got back to .500.\n\n\r\n              Mikal Bridges tied a career high with 45 points and grabbed 10 rebounds for the Nets. He had 11 points in overtime.\n\n\r\n              Young's 15-footer with 17 seconds left gave the Hawks the lead for good at 144-143. Onyeka Okongwu had a key blocked shot of Bridges' layup with 7 seconds left that kept Atlanta in front, and Lonnie Walker IV shot an airball on a 17-footer at the buzzer for the Nets.\n\n\r\n              “We gave up a lot of points, but when it mattered, we got some big stops,” Hawks coach Quin Snyder said.\n\n\r\n              The Nets, without injured starters Ben Simmons and Cam Thomas, and key reserve Dennis Smith Jr., have lost three straight.\n\n\r\n              Young forced overtime when he hit one of two free throws with a second to play after he was fouled on a drive by Spencer Dinwiddie. That tied the game at 131. Bridges missed a fallaway at the buzzer to end regulation.\n\n\r\n              “When I have a chance to put my team ahead and win the game, you don’t want to let your teammates down,” Young said. “You try to make up for it. I just wanted to be aggressive (in overtime) and not be the reason why we lost.”\n\n\r\n              Cam Johnson had 21 points for the Nets, making five 3-pointers. His tip-in with 3.3 seconds left in regulation gave the Nets a 131-130 lead before Young's free throw.\n\n\r\n              Nic Claxton had 22 points and 11 rebounds for the Nets before fouling out in overtime. Dinwiddie had 26 points and 12 assists. \n\n\r\n              UP NEXT\n\n\r\n              Nets: Host the Heat on Saturday in the first of a five-game homestand.\n\n\r\n              Hawks: At the Wizards on Saturday in the first of a five-game road trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996308.901334
}