{
  "game_id": "0022400036",
  "espn_id": "401703405",
  "date": "Nov 26, 2024",
  "matchup": "MIA vs. MIL",
  "headline": "Lillard scores 37 points and Giannis-less Bucks hold off Heat 106-103 to move to 3-0 in Cup play",
  "body": "MIAMI -- — Damian Lillard scored 37 points and handed out 12 assists, and the Milwaukee Bucks wasted a 22-point second-half lead before beating the Miami Heat 106-103 in an NBA Cup game on Tuesday night.\n\n\r\n              Brook Lopez scored 13 points and Bobby Portis had 11 for the Bucks, who have won five in a row and moved back to the .500 mark — 9-9 — for the first time since they were 1-1.\n\n\r\n              The Bucks (3-0 in Cup play) also moved a half-game ahead of Detroit (2-0) in the East Group B standings.\n\n\r\n              Jimmy Butler scored 23 points for Miami, which got 18 from Tyler Herro, 17 from Terry Rozier and 16 from Bam Adebayo. The Heat tied the game at 96-96 on a layup by Butler and got within one point on three later occasions, but never led.\n\n\r\n              The Heat — who were outscored 60-30 from 3-point range — fell to 1-2 in Cup play.\n\n\r\n              The Bucks played without Giannis Antetokounmpo, a late pregame scratch because of swelling in his left knee.\n\n\r\n              Takeaways\r\n              Bucks: Lillard finished with at least 35 points and 10 assists for the 30th time, pulling into a tie with Allen Iverson for ninth-most in NBA regular season history. Oscar Robertson has the record with 121.\n\n\r\n              Heat: Miami has faced deficits of 22 points or more in two of seven home games this season. It happened six times in 41 home games last season.\n\n\r\n              Key moment\r\n              AJ Green made back-to-back 3-pointers for Milwaukee in the final minutes, both of them coming immediately after Miami scored to get within one. His late 3s gave Milwaukee leads of 101-97 and 104-100.\n\n\r\n              Key stat\r\n              Lillard's 37 points were the second most by a Bucks player against Miami in regular-season play. Mo Williams scored 38 on Feb. 3, 2007.\n\n\r\n              Up next\r\n              Bucks: Host Washington on Saturday.\n\n\r\n              Heat: Visit Charlotte on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996928.310387
}