{
  "game_id": "401810082",
  "espn_id": "401810082",
  "date": "Nov 13, 2025",
  "matchup": "UTAH vs ATL",
  "headline": "Jalen Johnson leads the Hawks past the Jazz with a triple-double and a career-best effort",
  "body": "SALT LAKE CITY -- — Jalen Johnson had 31 points, 18 rebounds, 14 assists and seven steals, leading the Atlanta Hawks to a 132-122 victory over the Utah Jazz on Thursday night. \n\n\r\n              Johnson reached career highs in points and assists in his third career triple-double. \n\n\r\n              Playing without Trae Young, the Hawks (8-5) have won four straight and made 24 3-pointers, the most by any NBA team this season. \n\n\r\n              Onyeka Okongwu was 8 for 14 from 3-point range after never having made more than four in a game on his way to a career-high 32 points.\n\n\r\n              The Hawks set a franchise record with 15 3-pointers in the first half on 25 attempts, led by Vit Krejci’s 5-of-5 shooting from beyond the arc. Krejci made one 3 in the second half and finished with 20 points.\n\n\r\n              Lauri Markkanen scored 40 points on 15-for-25 shooting. Rookie Ace Bailey notched another career best with 21 points and Keyonte George added 19 for Utah (4-8), which has yet to post consecutive wins this season.\n\n\r\n              Atlanta clinched the game with an 8-0 late run that included steals by Johnson and Nickeil Alexander-Walker and was capped by Johnson's two free throws to make it 127-118 with 3:03 to play.\n\n\r\n              The Hawks led by as many as 18, but the Jazz mounted a comeback and took a 106-103 lead early in the fourth quarter on Markkanen's 3-pointer.\n\n\r\n              The Hawks have found success without many of their most important players. Young has missed two weeks with an MCL sprain and Kristaps Porzingis missed Thursday’s game to rest.\n\n\r\n              Without a ball-dominant point guard, the Hawks are spreading the ball around and racking up the assists (36 in this one) while they continue to win with a diminished roster. \n\n\r\n              The game was delayed more than 10 minutes while arena staff workers repaired one of the baskets.\n\n\r\n              Up next\r\n              Atlanta: Finish their four-game road trip at Phoenix on Sunday.\n\n\r\n              Jazz: Host Chicago on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042619.81625
}