{
  "game_id": "0021400381",
  "espn_id": "400578673",
  "date": "Dec 18, 2014",
  "matchup": "MIL @ SAC",
  "headline": "Bucks down Kings to spoil return of DeMarcus Cousins",
  "body": "SACRAMENTO, Calif. -- Despite the return of Sacramento Kings center DeMarcus Cousins, the undersized Milwaukee Bucks came up big.\nBrandon Knight scored 20 points, and the Bucks spoiled Cousins' return to the struggling Kings with a 108-107 victory Thursday night.\nWith their inside game lacking due to missing players, the young Bucks shot well from the perimeter for much of the night. Milwaukee, which won for the third time in four games, went 10-of-14 from 3-point range in the first half and made 13 overall from beyond the arc.\nMilwaukee was outscored 48-26 in the paint.\n\"We had to score the ball (from the outside) if we were going to have a chance to win tonight,\" said first-year Bucks coach Jason Kidd, whose team moved over the .500 mark with a 14-13 record.\nPrized rookie Jabari Parker, who tore the anterior cruciate ligament in his left knee Monday and is out for the season, was among the missing Milwaukee players.\nThe Bucks also were without center Larry Sanders, suspended one game by the NBA on Thursday for pushing Portland forward Nicolas Batum in the back as he elevated toward the basket Wednesday night.\nMilwaukee, which dressed 10 players, also was without power forwards Ersan Ilyasova (nasal fracture) and John Henson (sprained left foot).\n\"No one thought we would have this record but us,\" said O.J. Mayo, who scored 17 of his 19 points in the first quarter. \"We're a young, confident team that plays aggressive and with a lot of energy.\"\nJared Dudley scored 19 points, Jerryd Bayless had 10 of 17 in the fourth quarter and Giannis Antetokounmpo added 11.\nPlaying for the first time in more than three weeks due to viral meningitis, Cousins looked fatigued at times but still had 27 points, 11 rebounds and five assists in nearly 33 minutes for the Kings.\nHowever, the team's leading scorer and rebounder missed his most important shot of the game. Pressured on the perimeter by Zaza Pachulia, Cousins misfired on a jumper at the buzzer that would have won it.\n\"I kind of got pushed out a little further; ZaZa kind of played me to my right,\" Cousins said. \"I tried to go left, but Knight helped, so I crossed over and tried to take the best shot available with time running out. I think I got a good look, but it just didn't fall.\"\nCousins missed 10 straight games, and the Kings went 2-8 in his absence. He last played Nov. 26 at Houston.\nBen McLemore scored 22 points for Sacramento, Rudy Gay had 20 points and nine rebounds, and Darren Collison added 12 points.\nSacramento has dropped five straight and 10 of 12. The Kings were playing their second game since the surprise firing Sunday of coach Michael Malone, who was replaced by interim coach Tyrone Corbin.\n\"Thirteen 3-point shots they made, and in the first half I think they shot 75 percent,\" Corbin said. \"We did a better job in the second half, but they shot it well early. They threw us off with their lineup, and we had to match up with their small guys.\"\nTrying to play a more up-tempo game, the Kings were too sloppy and committed 21 turnovers that led to 17 Milwaukee points.\nA goaltend by Cousins led to a three-point play by Dudley, putting the Bucks ahead 101-91 with 6:41 left. Two free throws by McLemore tied the game at 107, but Pachulia converted one of two free throws for a one-point Milwaukee lead with 6.8 seconds left.\n\"Everybody had something to do with it tonight, offensively and defensively,\" Kidd said. \"It just showed us what we've been saying all along, that we're a team. We play hard. The guys did that on the road, and they've been giving us a chance to win.\"\nTIP-INS\nBucks: Mayo, who entered averaging 10.9 points per game, scored the team's first 12 points. ... Milwaukee is 3-0 against Pacific Division opponents.\nKings: Former Kings Peja Stojakovic and Scot Pollard watched the game from courtside seats. ... McLemore, who struggled last season as a rookie, had his fourth 20-point game.\nUP NEXT\nThe Bucks visit the Clippers on Saturday.\nThe Kings host the Lakers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764991816.025514
}