{
  "game_id": "0021500331",
  "espn_id": "400828218",
  "date": "Dec 10, 2015",
  "matchup": "OKC vs. ATL",
  "headline": "Durant's triple-double leads Thunder past Hawks, 107-94",
  "body": "OKLAHOMA CITY -- Four-time scoring champion Kevin Durant set up a rare triple-double with his passing.\nThe Thunder forward had five assists in the first quarter. He finished with 25 points, 12 rebounds and 10 assists in his seventh career triple-double, and Oklahoma City beat the Atlanta Hawks 107-94 on Thursday night.\nDurant approached this game differently than the Thunder's loss in Atlanta on Nov. 30. He took four fewer shots and had four more assists than that night.\n\"I just try to play the game and make it simple for myself,\" he said. \"I knew last time they were expecting me to be aggressive and score every time I got the ball, so I tried to switch the game up.\"\n\nRussell Westbrook had 23 points and 10 assists. It was just the second time both Durant and Westbrook had at least 10 assists in the same game, and the first time it happened in a win.\n\"I think it's contagious when your top guys do that,\" Durant said. \"Russell did a great job of setting the tone, and I was able to be aggressive and make some plays.\"\nDurant got his final assist on a pass to Westbrook for a 3-pointer with 1:14 remaining.\nSerge Ibaka matched a season high with 23 points and grabbed 10 rebounds for the Thunder, who won their third straight.\nKent Bazemore scored 22 points and Jeff Teague had 18 for the Hawks, who had won their previous two games. Kyle Korver added 12 and Thabo Sefolosha finished with 11.\nThe Thunder outrebounded the Hawks 52-34.\nOklahoma City led 60-49 at halftime behind 17 points from Ibaka and 14 from Westbrook. Durant had eight assists before the break, matching the most he's posted in the first half of a game in his career.\nBazemore scored 18 points in the first half on 6-for-6 shooting, including 4 for 4 from 3-point range.\nAtlanta got back into the game with its 3-point shooting in the third quarter. The Hawks made 4 of 6 3s in the first five minutes of the period to cut Oklahoma City's lead to 70-69.\nOklahoma City regained control in the final minute of the quarter when Anthony Morrow made a 3-pointer to bump the lead back up to 83-75.\nAnother 3 by Morrow early in the fourth quarter extended Oklahoma City's lead to 88-79. Later in the quarter, Durant pulled in a defensive rebound, then dribbled up the court and pulled up to make a transition 3-pointer that made it 95-85.\n\"I think we put ourselves in a little bit of a hole,\" Atlanta coach Mike Budenholzer said. \"At times, we weren't playing that well, and Oklahoma City was playing at a very high level.\"\nSTAT LINES\nIt was Westbrook's third straight game with at least 10 assists. He entered the game ranked second in the league in that category.\nON THE RISE\nBazemore posted the fourth-highest scoring total of his career, and his second-best of the season. He has not averaged more than 6.0 points in any of his three seasons, but he is averaging nearly 12 this season.\nQUOTABLE: Center Al Horford, on Bazemore: He kept us in the game with his aggressiveness. He just came out and he really kept us in the game, because it could have gotten ugly there early. He stepped up, he was solid for us, and that allowed us to come out in the second half and be more competitive.\"\nTIP-INS\nHawks: Sefolosha, a former Thunder player, started for Atlanta. He got a loud cheer during pregame introductions. ... shot 69 percent in the first quarter, yet trailed 35-28 at the end of the period. ... shot 37 percent in the second half.\nThunder: Durant presented a $35,000 check on Wednesday to Positive Tomorrows to fund the school's kitchen renovation project. It is the only elementary school in Oklahoma specifically for homeless children. ... Westbrook and Durant, two of the league's top six scorers, combined for six assists before either scored a basket.\nUP NEXT\nHawks: Host San Antonio on Saturday.\nThunder: Visit Utah on Friday.\n---\nFollow Cliff Brunt on Twitter (at)CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764994197.626624
}