{
  "game_id": "0022400596",
  "espn_id": "401705162",
  "date": "Jan 19, 2025",
  "matchup": "LAL @ LAC",
  "headline": "Powell and the Clippers beat James and the Lakers 116-102 in Lakers' first visit to Intuit Dome",
  "body": "INGLEWOOD, Calif. -- — Norman Powell scored 22 points, James Harden added 21 points and 12 assists and the Los Angeles Clippers defeated LeBron James and the Los Angeles Lakers 116-102 on Sunday night in the Lakers' first visit to the new Intuit Dome.\n\n\r\n              Kawhi Leonard had 19 points and Ivica Zubac had 21 points and 19 rebounds for the Clippers in the first meeting of the season between the former hallway rivals at Crypto.com Arena in downtown Los Angeles. \n\n\r\n              James had 25 points and 11 assists and Rui Hachimura added 19 points. Anthony Davis had 16 points and 10 rebounds in his return after missing a game with plantar fasciitis. The Lakers two-game winning streak ended.\n\n\r\n              Leonard tied his season high playing 24 minutes but none in the fourth as he continued under a minutes restriction in his fifth game of the season. He scored eight in a row to surpass 14,000 career points in the third, when the Clippers built their biggest lead of 26 points. \n\n\r\n              Takeaways\r\n              Lakers: Their only lead came on the game's first basket. They outscored the Clippers 13-2, including 11 in a row, to end the third trailing 92-77. During the spurt, their fans' sudden chants of “Let's go, Lakers!” filled the building and drowned out the home fans.\n\n\r\n              Clippers: They won their third in a row while starting a stretch of six games in nine days.\n\n\r\n              Key moment\r\n              The Clippers outscored the Lakers 32-23 in the second to lead 64-49 at halftime after shooting 58% from the floor. The teams each scored 28 points in the third and the Lakers outscored the Clippers 25-24 in the fourth. \n\n\r\n              Key stat\r\n              Both teams shot at least 50% from the floor. The Lakers made nine 3-pointers and the Clippers hit 11.\n\n\r\n              Up next\r\n              The Lakers host the Wizards on Tuesday. The Clippers host the Bulls on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997173.531105
}