{
  "game_id": "0022300780",
  "espn_id": "401585408",
  "date": "Feb 14, 2024",
  "matchup": "BKN @ BOS",
  "headline": "Celtics cruise past Nets 136-86 to give Joe Mazzulla his 100th win as head coach",
  "body": "BOSTON -- — Payton Pritchard scored 28 points and the NBA-leading Boston Celtics routed Brooklyn 136-86 on Wednesday night, giving Joe Mazzulla his 100th victory as head coach and handing the Nets the second-worst loss in franchise history. \n\n\r\n              Derrick White finished with 27 points. Jayson Tatum added 20 points, nine assists and seven rebounds for the Celtics, who beat the Nets on back-to-back nights and for the fourth time this season in both teams’ final game before the All-Star break. \n\n\r\n              Boston has won six straight and will enter the break with an NBA-best 43-12 record. The Celtics went 57-25 in Mazzulla's first year as coach last season. Wednesday marked the fifth 50-point win in team history. \n\n\r\n              Mazzulla said their success over the past two seasons “is a testament to the people you have around you.”\n\n\r\n              “I tell the players, ‘I can’t be who I am if they don’t let me,’\" Mazzulla said. \"I’m grateful for that.” \n\n\r\n              Porzingis thinks Mazzulla doesn’t always get credit, perhaps because it’s just his second season as a coach. But he thinks he should. \n\n\r\n              “He’s very underrated as a coach. And different. I think people really don’t see who he is and how he coaches,\" Porzingis said. \"He deserves a lot of credit.” \n\n\r\n              Porzingis left the game in the first half with a sprained ankle and didn't return. But he said he was available in the second half, but was held out with the game in hand. \n\n\r\n              Trendon Watford had 15 points for the Nets, who lost by a franchise-worst 52 points at Houston on Oct. 18, 1978. It was their worst loss since moving to Brooklyn in 2012. \n\n\r\n              The Nets enter the break losers five of their last six. They trailed by as many as 56 points in the fourth quarter. \n\n\r\n              “It's a great reminder...that we have work to do,” Brooklyn coach Jacque Vaughn said. “We have to be OK doing the work. But I do believe this team can do the work. So use this as a reminder that we got our tails kicked tonight and that after the break it won't be any easier. But we have to up for the challenge.”\n\n\r\n              The Celtics played without All-Star Jaylen Brown (bruised right shoulder) and Al Horford (sprained big toe). \n\n\r\n              But they controlled the game throughout, quickly jumping out to a double-digit lead and building a 37-point lead in the second quarter. It grew to 46 points in the third. Boston’s starters sat the entire final period. \n\n\r\n              The Nets did see a player return from injury for the second straight night, this time getting back Cam Johnson following his four-game absence with a strained adductor muscle. He came off the bench, entering for the first time late in the first quarter. He played 18 minutes and finished with four points on 1-of-5 shooting.\n\n\r\n              Johnson’s presence wasn’t nearly enough to slow down a Boston team that shot more than 64% in the opening period and connected on 22-of-44 3-pointers for the game. \n\n\r\n              Boston’s 68-32 halftime lead was its largest since Jan. 13, 2010, when it had a 36-point edge over the New Jersey Nets. Brooklyn’s 34 points Wednesday marked a season-low in the first half. \n\n\r\n              UP NEXT\n\n\r\n              Nets: At Raptors on Feb. 22. \n\n\r\n              Celtics: At Bulls on Feb 22.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996333.721104
}