{
  "game_id": "0022300396",
  "espn_id": "401585024",
  "date": "Dec 23, 2023",
  "matchup": "CHI vs. CLE",
  "headline": "Max Strus scores 26 points to lead injury-depleted Cavaliers past Bulls, 109-95",
  "body": "CHICAGO -- — Max Strus had 26 points and seven assists to help the injury-depleted Cleveland Cavaliers beat the Chicago Bulls 109-95 on Saturday night. \n\n\r\n              The Bulls lost for just the fourth time in 12 games since Zach LaVine was sidelined because of inflammation in his right foot.\n\n\r\n              DeMar DeRozan led the Bulls with 21 points, and Nikola Vucevic added 20 points and 12 rebounds.\n\n\r\n              Jarrett Allen had 19 points, 17 rebounds and Craig Porter Jr. added 19, eight assists and seven rebounds for the Cavaliers, who played without their top four scorers — Donovan Mitchell, Darius Garland, Evan Mobley, and Caris LeVert. The quartet combines to average 78 points.\n\n\r\n              “It's the grit, it's the physical and mental toughness and it's one of those things where a group of guys just don't want to disappoint one another, so they went out and played the game purely on both ends of the floor, but it just speaks volume of their character and commitment to each other,” Cleveland coach J.B. Bickerstaff said. \n\n\r\n              A four-time All-Star, Mitchell missed his third straight game due to an illness, while Garland (jaw fracture) and Mobley (knee surgery) are both expected to be out at least until February. LeVert, who was listed as questionable, missed the game because of left knee tendonitis. \n\n\r\n              Despite the injuries building up, Cleveland has won four of its last five.\n\n\r\n              “Next man mentality, had a lot of guys step up tonight, a lot of multiple efforts, and a rookie was sensational tonight,” said Strus. \n\n\r\n              The rookie Strus is referring to is Porter, who is currently on a two-way contract with the Cleveland Charge of the NBA G-League. \n\n\r\n              “Everybody stepped up,\" Strus said. \"When the ball was put in their hands they made a play. It's fun to play basketball like that. When guys are confident, when guys are moving, when everybody feels involved, that's how you win games.”\n\n\r\n              Strus scored 10 of Cleveland's last 16 points.\n\n\r\n              “I told him before everybody got hurt. If I am (out) there with you and I see even a little bit of a space I'm throwing you the ball and I'm expecting a shot,” Porter said. “He's one of those of those guys you just find him and he awards you every time.”\n\n\r\n              Cleveland was also missing Sam Merrill. Merrill didn’t score in 12 minutes Thursday night loss to New Orleans after getting a career-high 27 points while making eight 3-pointers Wednesday night in a win over Utah. Merrill was added to the injury report Thursday with a wrist issue after a fall against the Jazz. Before Saturday's game, he was listed as probable but was a late scratch with the wrist injury.\n\n\r\n              With 8:45 left in the third quarter, Strus, a former Bull, threw down on a dunk on Vucevic, sending Vucevic to the ground. Strus was originally called for an offensive foul. Cleveland challenged the call and the call was overturned, giving the Cavs a 65-60 lead. Vucevic, who was on the floor during the challenge, stayed in the game and responded with a 3-pointer. Later in the quarter, Strus made a 3, and Georges Niang followed with a basket to extend the Cleveland lead to 80-70 with 1:09 left in the quarter. \n\n\r\n              Porter had a chance at three-point play to start the third quarter with a three-point play but he missed his free free throw, but Tristan Thompson was there for the tip-in. Damian Jones followed with a 3 to extend the Cleveland lead to 89-72 with 10:55 left. \n\n\r\n              Patrick Williams did cut the Cleveland lead to 90-85 with 7:08, but Strus, the former DePaul star and South Suburban high school star answered with eight points straight. He bought a suite for friends and family.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Dallas on Wednesday night.\n\n\r\n              Bulls: Hosts Atlanta on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995906.400515
}