{
  "game_id": "0021500054",
  "espn_id": "400827941",
  "date": "Nov 03, 2015",
  "matchup": "DET vs. IND",
  "headline": "Pacers get first win, hand Pistons first loss this season",
  "body": "AUBURN HILLS, Mich. -- The Indiana Pacers were looking for anything that could spark them to their first win of the season.\nAs it turned out, coach Frank Vogel just had to look down the bench.\nRodney Stuckey scored 23 points against his former team to power Indiana's 43-2 advantage in bench points, and the Pacers beat the Detroit Pistons 94-82 on Tuesday night.\n\"Our second unit is all new this year, so we've been feeling ourselves out, but tonight was a great performance,\" Vogel said. \"Rodney has shown in the past he could do that -- he had a couple of 30-point games last year -- and (if) we got that kind of performance from our bench every night, we'd be really good this year.\"\nThe Pistons dropped to 3-1.\n\"It feels good to get off this losing streak,\" said Paul George, who finished with 16 points and eight rebounds.\n\nAndre Drummond had 25 points and a career-high 29 rebounds, becoming the first Piston with back-to-back 20/20 games since at least 1985, according to STATS.\n\"We had one guy play well tonight,\" Stan Van Gundy said. \"He was the one. That was a really, really good performance.\"\nThe Pistons led 30-22 late in the first quarter, and no one paid much attention when George hit two free throws to pull Indiana within six at the period's end.\nBy the time Van Gundy called timeout with 7:13 left in the half, the Pacers led 44-30, having scored 22 straight points, including the first 20 of the second quarter.\nThe Pistons had started the second quarter with their backups, as Van Gundy usually does, and they had gotten blown off the floor.\n\"We talked about it at the last two practices,\" Pacers guard George Hill said. \"Since I've been here, we've been one of the best defensive teams in the league, and tonight we showed why. The defense got us onto that streak, and we just kept going.\"\nDetroit's starters came back much earlier than usual and kept the Pistons within 47-39 at the half. That, though, meant the starters had played between 17-20 minutes in the half as the five reserves combined to go 0 for 6 from the floor while turning the ball over four times and grabbing just one rebound.\n\"As you can tell from the minutes they played, I went away from those guys as quickly as I could,\" Van Gundy said. \"It has only been four games, but we definitely need to rethink the whole bench. Either we have to figure out a way to score, or we have got to the change the rotation.\n\"I'm not sure what is going to work, but that's my job.\"\nIndiana's starters were much fresher after halftime. It showed, as they ran off 11 points in the first three minutes of the third, expanding their lead to 70-53.\nSpencer Dinwiddie scored Detroit's first bench points in the fourth quarter, cutting Indiana's lead to 87-71. The Pacers' bench had already scored 36 points, including 16 from Stuckey.\nDRUMMOND'S BIG NIGHT\nDrummond put up the second 25/25 game by a Piston in the last 30 years, matching the one he had in 2014. He also had his sixth game with at least 10 points, 10 offensive rebounds and 10 defensive rebounds, tying Tyson Chandler for the lead among active players.\nTIP-INS:\nPacers: Indiana avoided its first 0-4 start since the 1988-89 team went 0-9. . Stuckey was called for a flagrant foul against Stanley Johnson in the fourth, but Johnson missed both free throws and the Pistons didn't score on the ensuing possession.\nPistons: With the game getting out of hand in the third, Van Gundy inserted third-string point guard Dinwiddie for the first time this season. On Indiana's next possession, he fouled Stuckey on a made jumper, setting up a three-point play that gave the Pacers an 18-point lead.\nNO ENJOYMENT\nDrummond's record-setting game didn't bring him much pleasure. As his teammates showered after the game, he sat motionless in front of his locker, a towel draped over his head.\n\"He had a great game, but he wants a win,\" Stanley Jackson said.\nUP NEXT\nPacers: Visit Boston on Wednesday.\nPistons: Visit Phoenix on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994961.705764
}