{
  "game_id": "0021800268",
  "espn_id": "401070949",
  "date": "Nov 23, 2018",
  "matchup": "ATL vs. BOS",
  "headline": "Baynes, Tatum combine for 30 points in Celtics' easy win",
  "body": "ATLANTA --  Aron Baynes knew the Boston Celtics had a perfect opponent to improve their flow on offense.\n\n\"You know we have had a pretty dry spell,\" Baynes said. \"We have gotten good looks, but (shots) haven't been dropping, so to see it go through the hoop a few times tonight to begin the game was a good thing.\"\n\nBaynes scored a season-high 16 points, Jayson Tatum added 14 and the Celtics snapped a three-game skid with a 114-96 victory over the Atlanta Hawks on Friday night.\n\nAtlanta began the night with the NBA's second-worst record and dropped to 3-16 with its 10th straight loss.\n\nBoston, which had lost seven of 10, used a 45-point first quarter to put it out of reach early. Coming off their worst performance of the season in a home loss to the lowly New York Knicks, the Celtics led by 13 in the first when Kyrie Irving hit a dazzling fade-away 3.\n\nThe lead swelled to 29 midway through the second after Terry Rozier dunked and hit a 3. It was Boston's 10th trey, nine more than Atlanta had at that point.\n\n\"I just thought our pace was really good, starters and the bench,\" Celtics coach Brad Stevens said. \"Defensively, we were really locked in and engaged until the end of the game when we gave up those runouts.\"\n\nThe rebuilding Hawks were 1 for 17 beyond the arc before Alex Len's 3 late in the second. They just hit 17 percent of 35 3-point attempts.\n\nJeremy Lin finished with 19 points and 10 assists, and Len added 17 points in reserve roles for Atlanta. Hawks coach Lloyd Pierce was particularly pleased with the effort he got from Lin and guard DeAndre' Bembry, who scored a career-high 14 points.\n\n\"Those two guys are the examples in our locker room right now as we are searching and seeking and trying to find something positive,\" Pierce said. \"Those are the two guys that I'm looking at.\"\n\nBoston had a sloppy close to the second quarter with no field goals in the last 6:19 yet led by 16 at halftime. Tatum's 3, Brown's putback, Tatum's putback dunk and Baynes' hook shot pushed the lead back to 29 midway through the third.\n\nAtlanta went on a 16-2 run to close within 15 late in the third before Gordon Hayward hit a baseline jumper, and Smart stole the ball from John Collins and fed Semi Ojeleye for a lay-in.\n\nHayward opened the fourth by taking Daniel Theis' bounce pass and dunking for another 20-point lead. Theis followed with a 3 and Robert Williams III hit a reverse layup to finish off the Hawks with 10 minutes remaining.\n\n\"A lot of guys hit shots,\" Tatum said. \"That's key.\n\nNone of Boston's starters played over 24 minutes. Irving scored 11 of his 13 points in the first. Hayward added 11 points.\n\n\"We did what we were supposed to do,\" Irving said. \"Start of a business trip.\"\n\nTIP-INS\n\nCeltics: F Al Horford had a sore left knee and missed his first game of the season. Marcus Morris took his spot in the lineup, making his first start since last season, and finished with eight points. Horford was listed as probable with the same injury before the Knicks game but finished with 19 points, seven rebounds and five assists in 35 minutes. Coach Brad Stevens decided to rest him after Friday's shoot-around.\n\nHawks: G Kent Bazemore did not return after leaving with a left ankle sprain in the second. He went scoreless on two shots in 10 minutes. ... Rookie G Trae Young, the No. 5 overall draft pick, missed his five 3-point attempts and finished with five points, three turnovers and two assists in 19 minutes.\n\nBIG SCREEN\n\nThe Hawks showed a video tribute to Vince Carter midway through the first with congratulations from North Carolina coach Roy Williams and former Dallas teammate Dirk Nowitzki, among others. Carter, in his 21st season and first with Atlanta, became the 22nd NBA player to score 25,000 points in Wednesday's loss to Toronto. He went scoreless in 10 minutes against Boston.\n\nUP NEXT\n\nCeltics: Visit Dallas on Saturday and New Orleans on Monday.\n\nHawks: Host Charlotte on Sunday before beginning a three-game trip.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995378.406671
}