{
  "game_id": "0022000896",
  "espn_id": "401307695",
  "date": "Apr 22, 2021",
  "matchup": "CHA @ CHI",
  "headline": "Vucevic dominates as Bulls pound Hornets 108-91",
  "body": "CHICAGO -- — Nikola Vucevic scored 18 points and matched a season high with 16 rebounds, Coby White and Thaddeus Young scored 18 apiece, and the Chicago Bulls beat the struggling Charlotte Hornets 108-91 on Thursday night.\n\n\r\n                    The Bulls built a 14-point halftime lead and put this one out of reach in the third quarter on the way to their third win in four games. \n\n\r\n                    They are 6-10 since a shakeup at the trade deadline that landed Vucevic from Orlando, struggling to find some consistency and remain in the running for the play-in tournament that will determine the seventh and eighth seeds in the Eastern Conference.\n\n\r\n                    “With the limited time that we have left and the number of games that are on our schedule, can we every night just put our best foot forward with just physicality and the things that are gonna go into winning?” coach Billy Donovan said. “Hopefully, there's some lessons learned in that. But these guys are really good guys, I think they're professional and I think that they know when they don't play to a standard or level that they know that they're supposed to.”\n\n\r\n                    Held to a season-low nine points in a lopsided loss at Cleveland the previous night, the two-time All-Star center asserted himself in a big way. He shot 8 of 13 and had six assists.\n\n\r\n                    White hit four 3-pointers while playing turnover-free ball, and Young was 8 of 10 from the field.\n\n\r\n                    Devonte’ Graham led Charlotte with 16 points. Miles Bridges scored 13 as the Hornets lost for the sixth time in seven games.\n\n\r\n                    “It's just attention to detail,” forward Caleb Martin said. “I think we just need to come out with a certain fire that we haven't been in the last couple of games and just stay consistent in our starts in the first and second half. ... We've been struggling just starting off fast and not getting discouraged whenever they start to hit shots early on.”\n\n\r\n                    STRONG START\n\n\r\n                    The Bulls got off to a better start this time after falling into a big hole early on Cavaliers and grabbed a 58-44 halftime lead.\n\n\r\n                    They scored the game's first 10 points, with Vucevic hitting a jumper and a 3, and the final six of the second quarter, a layup by the big man bumping the lead to 14.\n\n\r\n                    It was 65-56 in the third when the Bulls went on a 13-0 run. A layup by Vucevic and two free throws by Daniel Theis made it 78-56 with 4:16 left in the quarter.\n\n\r\n                    “I think part of it is experience,” Vucevic said. “Part of it is just growing as a team, establishing an identity that you're just gonna bring night in and night out. We're just trying to figure all that out. It is the NBA. Sometimes, you have nights like we had last night. And some nights, you have nights like we had tonight.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: After attempting just eight free throws in Tuesday's loss at New York, the Hornets made 13 of 17. ... Charlotte was 8 of 31 on 3-pointers. ... G LaMelo Ball remains sidelined since fracturing his right wrist March 20 against the Los Angeles Clippers. The No. 3 overall pick in last year's draft, he was among the leading candidates for Rookie of the Year honors before the injury. ... G Malik Monk (sprained right ankle) missed his 11th game in a row, while F Gordon Hayward (sprained right foot) missed his 10th straight.\n\n\r\n                    Bulls: Donovan said Patrick Williams was dealing with a “personal issue” during the game. The rookie headed to the tunnel in the third quarter and a few teammates went to check on him. Williams returned to the game. ... All-Star Zach LaVine missed his fifth game in a row because of the league’s health and safety protocols, and Donovan had no timetable on his return. The NBA's sixth-leading scorer, he has not played since April 14. ... F Troy Brown Jr. had an MRI on his sprained left ankle and needs the swelling to go down before he returns. He missed his second consecutive game, and Donovan wasn't sure if he will be available at Miami on Saturday.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host Cleveland on Friday.\n\n\r\n                    Bulls: Visit Miami on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997347.743826
}