{
  "game_id": "0022401036",
  "espn_id": "401705602",
  "date": "Mar 23, 2025",
  "matchup": "OKC @ LAC",
  "headline": "Gilgeous-Alexander scores 26 as Thunder beat Clippers 103-101 for 6th straight victory",
  "body": "INGLEWOOD, Calif. -- — Shai Gilgeous-Alexander had 26 points and eight assists, Aaron Wiggins scored 19 points and the NBA-leading Oklahoma City Thunder extended their winning streak to six games by holding on to beat the Los Angeles Clippers 103-101 on Sunday night.\n\n\r\n              Alex Caruso scored 14 points, including the go-ahead 3-pointer with 1:54 remaining after Oklahoma City squandered a nine-point lead in the fourth quarter. Isaiah Hartenstein added 14 points and 10 rebounds, and Jaylin Williams scored 12 points.\n\n\r\n              The Thunder won despite missing Jalen Williams (hip) and Chet Holmgren (hip), their second- and third-leading scorers, respectively.\n\n\r\n              Kawhi Leonard had 25 points and 10 rebounds, and James Harden scored 17 points for the Clippers, who had their five-game win streak halted in head coach Tyronn Lue’s return to the bench. Lue missed the previous two games due to back pain.\n\n\r\n              Takeaways \r\n              Thunder: Even at less than full strength, the Thunder proved to be a force. In addition to missing Holmgren and Jalen Williams, Gilgeous-Alexander shot a season-worst 24.1% (7 of 29) from the field and Oklahoma still managed to beat the streaking Clippers.\n\n\r\n              Clippers: Even with Leonard back healthy, Los Angeles goes as Harden goes. Harden shot just 4 of 14 from the field, committed six turnovers and made a critical blunder in the final seconds, spoiling the Clippers' comeback attempt.\n\n\r\n              Key moment \r\n              The Clippers had the ball in the waning seconds down by a point, but Harden held the ball too late into the shot clock. He passed it off late to Leonard, who threw up a wild turnaround jumper that hit the back of the rim, ending the Clippers’ hopes.\n\n\r\n              Key stat \r\n              The Thunder went 4-0 against the Clippers this season.\n\n\r\n              Up next \r\n              The Thunder are at Sacramento on Tuesday. The Clippers visit New York on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997663.000731
}