{
  "game_id": "0022400970",
  "espn_id": "401705536",
  "date": "Mar 15, 2025",
  "matchup": "CHI @ HOU",
  "headline": "Jalen Green scores 28 and the Rockets down the Bulls 117-114",
  "body": "HOUSTON -- — Jalen Green scored 28 points and the Houston Rockets extended their winning streak to six straight games with a 117-114 victory over the Chicago Bulls on Saturday night.\n\n\r\n              Green also added six rebounds for the Rockets. Alperen Sengun scored 24 points while adding 15 rebounds. Fred VanVleet shot 8 for 20 (5 for 14 from 3-point range) and 2 of 4 from the free-throw line to finish with 23 points.\n\n\r\n              Coby White led the way for the Bulls with 23 points, seven rebounds and four assists. Tre Jones finished with 19 points and six assists for Chicago.\n\n\r\n              VanVleet put up 18 second-quarter points for the Rockets, who trailed 65-60 at halftime. The Rockets took the lead for good with 5:52 remaining in the fourth quarter on a 3-pointer from Green to make it a 100-98 game.\n\n\r\n              Takeaways\r\n              Bulls: The loss snapped a four-game winning streak. ... It was the opening game of a six-game road trip. ... Josh Giddy, day to day with an ankle injury, was out. But White (toe) started.\n\n\r\n              Rockets: With Tari Eason out because of injury management for his lower leg, Jabari Smith Jr. moved into the starting lineup. ... The Rockets improved to 25-10 at home. ... VanVleet had 21 first-half points for Houston, including a fadeaway 3-pointer at the buzzer to end the half. \n\n\r\n              Key moment\r\n              Green hit a 3-pointer that gave Houston a 100-98 lead with 5:52 left in the game, then followed it up with a layup and the Rockets never trailed again. \n\n\r\n              Key stat\r\n              The Rockets outrebounded the Bulls by 18 (54 to 36).\n\n\r\n              Next up\r\n              The Rockets will host the 76ers on Monday.\n\n\r\n              The Bulls visit the Jazz on Monday.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_api",
  "crawled_at": 1764997036.6186292
}