{
  "game_id": "0021600529",
  "espn_id": "400899950",
  "date": "Jan 04, 2017",
  "matchup": "OKC @ CHA",
  "headline": "Batum scores 28 points, Hornets beat Thunder 123-112",
  "body": "CHARLOTTE, N.C. -- Nicolas Batum says there is an art to drawing a foul on a 3-point shot.\n\"It's not easy,\" Batum said with a wide smile.\nBatum twice drew whistles on 3-pointers en route to a season-high 28 points in the Charlotte Hornets' 123-112 victory over the Oklahoma City Thunder. Batum was a regular at the foul line Wednesday night, converting 13 of 15 free throws. As a team, the Hornets made 40 of 49 foul shots to snap a two-game losing streak.\nBatum said he watched others like Kevin Durant and Reggie Miller work to perfect that art of drawing the foul, which includes reading the defender's movements.\n\"Sometimes it works and sometimes you throw up a really bad shot,\" Batum said.\nThunder coach Billy Donovan said Batum just has a good feel and understanding on how to play the game.\n\"He subtly, very calmly impacts the game,\" Donovan said. \"He lets it come to him. He has a great pace and tempo to his game. Obviously, he's very, very crafty in terms of understanding how to draw fouls. He's a really good passer.\"\nRussell Westbrook had 33 points and 15 rebounds, but fell two assists shy of his 17th triple-double of the season for Oklahoma City.\nThe MVP candidate was assessed a technical foul in the first half after he hit a referee in the head with a ball. After the Thunder called a timeout Westbook was retreating toward the bench and tossed an overhead pass toward the referee, who wasn't looking as the ball hit him in the side of the cranium. Another official came running into the Thunder huddle and called a technical. Westbrook reacted in utter disbelief, putting his hands over his face.\nDonovan said it was \"unintentional.\"\nEnes Kanter added 22 points, and Victor Oladipo and Steven Adams each had 18 for the Thunder.\nThe Thunder led by one after Kanter hit a 3-pointer from the top of the key to beat the buzzer at the end of the third quarter. But they couldn't sustain the momentum after erasing a double-digit deficit.\nThe Hornets took control with about six minutes left, outscoring the Thunder 22-11 the rest of the way.\nKemba Walker, who scored 34 and 37 points in his last two games while making an All-Star push, had nine points in the decisive final quarter. Frank Kaminsky carried the Hornets early, scoring all of 17 points in the first half as Charlotte took a 60-55 halftime lead.\nTIP INS\nThunder: Had beaten the Hornets 11 straight times before Wednesday night. ... Westbrook has 28 double-doubles on the season.\nHornets: Marco Belinelli returned to action after missing the last five games with a sprained left ankle. ... Roy Hibbert was called for a technical foul in the third quarter after exchanging words with Oklahoma City's Steven Adams.\nA BETTER FINISH\nBefore the fourth quarter, the Hornets gathered together in a huddle making sure they were all on the same page heading down the stretch.\n\"The fourth quarter has been an issue for us defensively and we really wanted to play as well as we can,\" Walker said. \"We did a good job. We wanted to clamp down as best as we can. And we have to continue to be that way.\"\nDEFENDING WESTBROOK\nHornets coach Steve Clifford said he felt Michael Kidd-Gilchrist did a solid job defending Westbrook. Even though he had 33 points, Westbrook shot just 10 of 31 from the field.\n\"There weren't a lot of easy (shots),\" Clifford said. \"I thought Mike played with great discipline and I thought our guys off the ball were great.\"\nClifford called Westbrook \"the MVP of our league right now.\"\nUP NEXT:\nThunder: At Houston on Thursday night.\nHornets: At Detroit on Thursday night in the first of five straight games on the road.",
  "source": "espn_api",
  "crawled_at": 1764995295.785996
}