{
  "game_id": "0021800109",
  "espn_id": "401070790",
  "date": "Oct 31, 2018",
  "matchup": "LAL vs. DAL",
  "headline": "James' free throw gives Lakers 114-113 win over Mavericks",
  "body": "LOS ANGELES --  LeBron James walked into Staples Center on Halloween dressed as Jason from the \"Friday the 13th\" movies. Five hours later, he saved the Los Angeles Lakers from a horrifying ending.\n\nThe four-time MVP scored 29 points and made the game-winning free throw with 2.1 seconds left Wednesday night as the Lakers held on for a 114-113 win over the Dallas Mavericks.\n\n\"I don't like the way we closed out the game, but for the majority of the game we played well,\" James said.\n\nLos Angeles led nearly throughout and was up 111-98 with 3:42 to go before the Mavericks went on a 15-2 run to pull even. Luka Doncic tied it at 113 with 7.2 seconds remaining on a jumper from the corner, but on the next trip down the floor James was fouled by Wesley Mathews while shooting a jump shot.\n\nJames missed the first free throw but made the second. J.J. Barea missed a 3-pointer for Dallas as time expired, and the Lakers (3-5) stopped a two-game skid.\n\n\"NBA games are never over and you have to play the game a certain way,\" Lakers coach Luke Walton said. \"If you mess with the game, the game will mess with you and I thought we did that a little bit. Hopefully we can learn the same lesson even if it was a win.\"\n\nJaVale McGee added 16 points and 15 rebounds, Kyle Kuzma scored 18 and Brandon Ingram had 17 for the Lakers.\n\nMatthews led Dallas with 21 points and Harrison Barnes scored 19. The Mavericks (2-6) have lost five straight.\n\n\"I love the fight. Our first quarter was very disappointing but we battled back,\" coach Rick Carlisle said. \"We were able to get stops in the fourth quarter and we were getting some momentum on offense.\"\n\nThe Lakers scored the first eight points and led by 18 in the first quarter as they went 15 of 23 from the field and made six 3-pointers.\n\nDallas trimmed the margin to 66-59 by halftime. Matthews' driving bank shot pulled the Mavericks to 70-64 before the Lakers went on a 17-4 run -- which included 10 points by James -- to open their largest lead at 87-68 with 4:40 remaining in the third.\n\nThe closest the Mavericks got in the first eight minutes of the fourth was 98-90 with 8:12 left.\n\nROAD WOES\n\nThe Mavericks, who dropped to 0-5 on the road, are one of seven teams in the NBA without a win away from home. They have lost 10 straight road games dating back to last season.\n\nTOUGH START, BETTER FINISH\n\nDoncic, the second pick in the 2018 draft, said before the game that he grew up idolizing James. The teenager from Slovenia, who scored 31 points Monday night at San Antonio and is averaging 20.4 points per game, might have been in awe a bit during his first game against James as he missed his first six shots.\n\nDoncic was able to shake off the slow start, though, as he made his final five shots from the field and finished with 14 points. James gave Doncic his jersey after the game.\n\nTALE OF TWO HALVES\n\nThe Lakers held the Mavericks to 37 percent from the floor in the first and third quarters (17 of 46), but Dallas shot 65 percent (26 of 40) in the second and fourth.\n\n\"The first and third quarters defensively we were pretty good and then we had two awful quarters. It is just about getting better with those things,\" Walton said.\n\nTIP-INS\n\nMavericks: DeAndre Jordan had 12 rebounds and 10 points. ... Barea (15 points) and Dwight Powell (12) came off the bench to score in double figures. ... The Mavericks were 14 of 19 from the field in the second quarter. ... G Devin Harris (left hamstring strain) missed his seventh straight game.\n\nLakers: Have won three straight against the Mavericks. ... McGee also had five blocked shots, making it his first game with at least 15 points, 15 rebounds and five blocks since Jan. 14, 2012, with Washington. The last Lakers player to accomplish that was Pau Gasol on Jan. 20, 2014, at Chicago. ... Kuzma scored 11 points in the first quarter. ... The 38 points were a season high for a first quarter. ... F Michael Beasley missed his second straight game due to personal reasons.\n\nUP NEXT\n\nMavericks: Host New York on Friday.\n\nLakers: At Portland on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995038.3237472
}