{
  "game_id": "0021300770",
  "espn_id": "400489643",
  "date": "Feb 11, 2014",
  "matchup": "CHA vs. DAL",
  "headline": "Al Jefferson leads way as Bobcats get rare win over Mavs",
  "body": "CHARLOTTE, N.C. -- The Charlotte Bobcats aren't content with just securing a playoff spot, they want to move up in the Eastern Conference before the playoffs.\nIf they play like they did on Tuesday night, they might just make it.\nAl Jefferson scored 30 points, Anthony Tolliver added 22, and the Bobcats had a franchise-record 42 assists to earn a rare win over the Dallas Mavericks, 114-89 on Tuesday night.\n\n\"These guys, you can see it in their eyes. Now, we're playing for something and trying to reach our goals,\" Jefferson said. \"I think we can have a chance to make a move when we come back from the All-Star break.\"\nFirst, there is the matter of playing the Brooklyn Nets on Wednesday night. The Nets are currently seventh in the East, 1½ games ahead of the Bobcats.\n\"It was really important to get this one and go to Brooklyn and beat a seed ahead of us,\" Jefferson said.\nThe Bobcats had lost 17 of 18 against the Mavericks, but scored 60 points in the paint and tied a season-high with 12 3-pointers. Charlotte's 42 assists on 45 field goals was the highest percentage (.933) in the NBA this season.\n\"We were able to make the right play and knock in some shots,\" said Josh McRoberts, who had a career-high 13 assists. \"We shared the ball pretty well, and it helps when you're making shots.\"\nCharlotte's relatively easy victory came on the night it was announced that the wife of Bobcats owner Michael Jordan gave birth to the couple's identical twin daughters.\nJordan's spokeswoman Estee Portnoy told The Associated Press on Tuesday night that Yvette Jordan gave birth to Victoria and Ysabel on Sunday in West Palm Beach, Fla.\nJordan missed his team's fine performance.\n\"I told them we couldn't lose concentration,\" Bobcats coach Steve Clifford said. \"We had games this year where we were down 16 or 18 points in the third quarter and we came back. In this league it happens all of the time.\"\nBut there was no comeback for the Mavericks.\nDallas' Dirk Nowitzki sprained his left ankle in the second quarter and was taken to the locker room for observation. He returned in the second half and finished with 16 points in 25 minutes.\nThe Bobcats went 12 of 24 from beyond the arc, led by Tolliver, who was 5 of 6.\nJefferson was 14 of 23 from the field and reached the 20-point plateau for the 14th time in 15 games. He has averaged 27 points per game during that span.\nCharlotte built a 58-44 lead at halftime behind 16 points each from Jefferson and Tolliver.\nGerald Henderson added 15 points, and Bismack Biyombo scored 10 points on 5 of 5 shooting and blocked a 3-point attempt by Vince Carter.\nNowitzki had been 16-0 against the Bobcats while averaging 26.1 points per game. But he had just two points in 10 minutes of action in the first half before rolling his ankle when he landed on McRoberts' foot.\nNowitzki said he will play Wednesday night at Indiana. He wasn't quite sure what went wrong in a game that was never close in the second half.\n\"They really got whatever they wanted,\" Nowitzki said. \"Jefferson on the block scored. When we doubled, he passed out and they shot the ball well. They broke us down on some penetrations. They had 40-something assists, which is unheard of.\n\"Every time there was a breakdown defensively, and they made us pay all night long.\"\nDallas' primary problem was stopping Jefferson in the paint.\nPlaying at the top of his game, the 10-year NBA veteran scored almost at will with a series of low post moves, pump fakes and up-and-under moves. And when he wasn't doing that he was moving the ball and helping create shots for his teammates.\nGame notes\nIt wasn't all good news for the Bobcats as point guard Kemba Walker left the game with tightness in his Achilles in the second half and didn't return. He is day to day. ... The Bobcats handed out a season-high 42 assists. ... Monta Ellis had 16 points and has reached double figures in six straight games for Dallas. ... The Bobcats honored six-time NASCAR Sprint Cup champion Jimmie Johnson.",
  "source": "espn_api",
  "crawled_at": 1764993158.5334668
}