{
  "game_id": "0022000640",
  "espn_id": "401307427",
  "date": "Mar 20, 2021",
  "matchup": "LAL vs. ATL",
  "headline": "LeBron hurt, Hawks beat Lakers 99-94 for 8th straight win",
  "body": "LOS ANGELES -- — LeBron James left in the second quarter with a high right ankle sprain that the Lakers said will sideline him indefinitely, and Los Angeles went on to fall 99-94 to the Atlanta Hawks on Saturday.\n\n\r\n                    Two hours after the game, the Lakers announced that James is out indefinitely. The defending NBA champions already are without All-NBA big man Anthony Davis, who has missed 14 consecutive games with a right calf injury and likely won't play again until April.\n\n\r\n                    “Nothing angers and saddens me more than not being available to and for my teammates!” James tweeted later Saturday. “I’m hurt inside and out right now. The road back from recovery begins now. Back soon like I never left.”\n\n\r\n                    James was hurt when he rolled his ankle under Solomon Hill, who was called for a foul as he reached awkwardly for a steal. The 36-year-old superstar screamed and fell to the court clutching at his ankle, yet he got up and briefly stayed in the game.\n\n\r\n                    “I haven’t necessarily seen him scream and squall like that, probably ever, not even with that groin,” said Kyle Kuzma, who was with the Lakers when James missed 17 games with a groin injury two seasons ago. “It had to hurt a little bit, for sure.”\n\n\r\n                    After the injury, James hit a corner 3-pointer that extended his NBA-record streak of games with at least 10 points to 1,036, but he called a timeout and left the court shortly afterward. James knocked over a chair in frustration as he went to the locker room.\n\n\r\n                    “The mood of the team is we’re disappointed we lost, and we’ve got to come back and get one tomorrow,” Lakers coach Frank Vogel said. “I won’t disclose what LeBron was like (in the locker room). It’s in-house.”\n\n\r\n                    John Collins had 27 points and a season-high 16 rebounds, and Trae Young added 14 points and 11 assists for the Hawks. They opened an eight-game trip with their eighth straight victory under new coach Nate McMillan — but only after their defending champion opponents lost their 17-time All-Star to an injury that could shake the NBA’s balance of power if it turns out to be serious.\n\n\r\n                    With James out, the remaining Lakers rallied and actually took a one-point lead to halftime, but missed their first 11 shots of the second half. Danilo Gallinari scored 14 of his 18 points after halftime for the Hawks, who are on their longest winning streak since January 2015.\n\n\r\n                    “That was the first thing I told the guys: We can’t relax because LeBron is out of the game,\" McMillan said. “We have to keep up the pressure, and I thought our guys did that.”\n\n\r\n                    James’ absence left the Lakers without three starters in the second half, and the Hawks capitalized for their first road victory over Los Angeles since March 2016. Along with Davis, Marc Gasol missed his seventh straight game since February after sitting out under the NBA’s health and safety protocols.\n\n\r\n                    “It’s different without (James), without AD,” Gallinari said. “Of course they’re a different team. But at the same time, all of the players that stepped up are all NBA veterans with experience, guys that won championships. I would say it’s anyway a very good win.”\n\n\r\n                    Montrezl Harrell had 23 points and 11 rebounds, while Dennis Schröder had 16 points and seven assists against his former team for the Lakers, whose four-game winning streak ended amid much bigger concerns.\n\n\r\n                    Harrell suggested Hill's actions during James' injury were “not a basketball play,” and said the officials should have considered giving him more than a personal foul.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: “It’s definitely a different type of game when Bron is out,” Young said. “Everything they do goes through him and AD.” ... Clint Capela had 16 rebounds.\n\n\r\n                    Lakers: Gasol has cleared the NBA's health and safety protocols, but coach Frank Vogel said the Spaniard wasn't ready to play because he hasn't practiced since February.\n\n\r\n                    RONDO RETURNS\n\n\r\n                    The Lakers played a tribute video to former guard Rajon Rondo, who had five assists in 14 minutes during his first trip to Staples Center since the Lakers’ championship run in the Florida bubble. Rondo, who already got his championship ring through the mail earlier this season, watched the video appreciatively.\n\n\r\n                    Rondo also stoked more nostalgia from Lakers fans when he got a technical foul in the third quarter for a weird bit of gamesmanship, inexplicably shoving the basketball into Schröder's face after a whistle.\n\n\r\n                    \"I love competitors who really try to compete against me on the court, but that’s not competing,\" Schröder said. \"I’m going to leave it at that.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: At Los Angeles Clippers on Monday night\n\n\r\n                    Lakers: At Phoenix on Sunday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997302.103307
}