{
  "game_id": "0021500066",
  "espn_id": "400827953",
  "date": "Nov 04, 2015",
  "matchup": "OKC vs. TOR",
  "headline": "DeRozan, Raptors beat Thunder 103-98 to remain unbeaten",
  "body": "OKLAHOMA CITY -- Toronto's fast start is no fluke.\nDeMar DeRozan scored 10 of his 28 points in the fourth quarter, and the undefeated Raptors overcame an eight-point deficit in the final 6 minutes to beat the Oklahoma City Thunder 103-98 on Wednesday night.\nToronto shot 42 percent but fought through that for its best win yet.\n\"I don't know how many games we're going to win, but I do know that we're going to scrap,\" coach Dwane Casey said. \"We're going to compete, play hard, get after people. Tonight, our shots weren't falling and we attacked the rim and got to the free throw line, made the officials make a decision and forced the defense to react.\"\n\nJonas Valanciunas had 17 points and 12 rebounds and Kyle Lowry added 17 points for the Raptors (5-0), who beat Dallas the night before.\nToronto benefited from 19 Oklahoma City turnovers and outscored the Thunder 32-12 at the foul line.\nOklahoma City lost its second straight despite shooting 48 percent. It was the first time this season the Thunder scored fewer than 100 points.\n\"It's all correctable stuff,\" star forward Kevin Durant said. \"I'm not worried at all. It's not like we just can't get a grip on what's going wrong. We turn the ball over and we foul. That's the game.\"\nRussell Westbrook scored 20 of his 22 points in the second half and finished with 16 assists. Durant had 27 points and Enes Kanter added 15 for the Thunder.\nMidway through the fourth quarter, Toronto's Bismack Biyombo was called for fouling Westbrook on a screen, then disagreed with the call and was issued a technical foul. Durant made the free throw, then Westbrook hit a 3-pointer to put the Thunder ahead 91-83.\nToronto clawed back into it, and a bank shot by DeRozan gave the Raptors a 99-97 lead with 47.3 seconds remaining. After Westbrook missed a layup, DeMarre Carroll made two free throws with 16.8 seconds left to make it a four-point lead.\nDurant missed the second of two free throws, but the Thunder scrambled and forced a jump ball. Toronto won the tip, and DeRozan made two free throws with 9.3 seconds to play to seal the game.\nThe Raptors held the Thunder to 5-for-20 shooting in the fourth quarter.\n\"We just missed shots,\" Durant said. \"We were getting downhill, we're getting into the paint and we missed shots. Dion (Waiters) missed a nice 3, wide-open 3, I missed a turnaround on the baseline, Russell missed a few layups getting to the rim. We make those shots, you say it's great offense. But it's a make-or-miss league and we missed them and they made them.\"\n---\nCLUTCH DEFENSE\nThe Raptors kept Oklahoma City's stars in check late. Westbrook shot 1 of 8 in the fourth quarter, while Durant only took two shots and made one.\nCasey said the goal was to make someone else try to beat them.\n\"I thought we accomplished that tonight,\" he said.\nSTAT LINES\nWestbrook scored 16 points on 6-for-6 shooting and had five assists in the third quarter.\nQUOTABLE\nCasey, on how the team should approach its trip to Orlando in the framework of the entire season: \"It's a marathon; it's not a sprint. We've got to maintain this. I told the guys, get off their feet. No running around shopping in Orlando or enjoying the sun. \"\nTIP-INS\nRaptors: DeRozan made 14 of 15 free throws. Oklahoma City's entire team hit 12 of 14. ... Toronto had more shots blocked (six) than it made (five) in the first quarter. ... Lowry was called for a technical with 4:05 remaining in the fourth. ... The Raptors outscored the Thunder 18-6 on second-chance points. ... Toronto outscored Oklahoma City by 22 points when Cory Joseph was on the floor.\nThunder: Oklahoma City held Toronto to 5-for-24 shooting in the first quarter. ... On one first-quarter possession, Steven Adams blocked three shots. He finished with four, and the Thunder had 10. ... Oklahoma City committed nine turnovers in the second quarter. ... Kanter's 3-pointer as time expired in the third gave the Thunder an 81-73 lead. ... The Thunder scored 42 points in the third quarter on 16-for-22 shooting. ... Westbrook's assist total was one off his career high of 17, set three times last season.\nUP NEXT\nToronto plays at Orlando on Friday; Oklahoma City plays at Chicago on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994223.091999
}