{
  "game_id": "0022000174",
  "espn_id": "401267334",
  "date": "Jan 14, 2021",
  "matchup": "PHI vs. MIA",
  "headline": "Milton sparks 76ers past undermanned Heat 125-108",
  "body": "PHILADELPHIA -- — Ben Simmons called trade rumors part of the NBA. With another triple-double, he showed why he's coveted around the league — and needed in Philly.\n\n\r\n                    Simmons had 10 points, 10 assists and 12 rebounds and Shake Milton returned from COVID-related issues and scored 31 points and lead the Philadelphia 76ers to a 125-108 win over the Miami Heat on Thursday night.\n\n\r\n                    “There’s far worse things going on in the world,” Simmons said of recent trade talk. \"If you tell me I’ll never play the game again, that would be a different story.”\n\n\r\n                    The Sixers swept the two-game home set against a Heat team that continues to play with a depleted roster because of issues related to the virus outbreak. Jimmy Butler, Bam Adebayo and Goran Dragic sat out, and the Heat were roughed up early by Milton, Tyrese Maxey and Tobias Harris.\n\n\r\n                    Consider, the 76ers led 73-58 at the break — with only nine combined points from All-Stars Joel Embiid and Simmons. Embiid has emerged early as one of the top players in the NBA, and a 45-point, 16-rebound game Tuesday against the Heat was one of his best. He had only nine points on Thursday, but was barely needed.\n\n\r\n                    Duncan Robinson led the Heat with 22 points and Gabe Vincent had 21.\n\n\r\n                    “I don’t want to hear anything about fatigue,\" Heat coach Erik Spoelstra said. \"Philly just outplayed us.”\n\n\r\n                    Simmons had his 30th career triple-double a day after he was dangled as trade bait to Houston in a potential deal for James Harden. Harden landed in Brooklyn in a trade that not only made the Nets the new favorites to win the Eastern Conference, it could ruffle the relationship between Simmons and the franchise that made him the No. 1 pick of the 2016 draft. Coach Doc Rivers talked it out with Simmons after trade rumors swirled earlier this season. Rivers and Simmons had a brief chat at shootaround, leaving the new Sixers coach to say everything was fine.\n\n\r\n                    “This is a business. Things like that happen,” Simmons said. \"The only thing I can control is how I approach my workouts, the games, and my day to day things. I’m just trying to be professional and do the right thing and help my team get wins.”\n\n\r\n                    The Sixers rolled early with the best record in the NBA until COVID issues sent them on a three-game losing streak -- including a loss last week when they had just seven players against Denver -- but have returned to form as more players returned to the active roster. Milton and Matisse Thybulle returned off the bench after a three-game break and Harris, who had 18 points, was back in the starting lineup. Only starting guard Seth Curry, who tested positive last week for coronavirus, remained sidelined against the Heat.\n\n\r\n                    The combination is good enough for Rivers.\n\n\r\n                    “I said it before, I like our team,” he said. “I like today after the trade that we are the same team.”\n\n\r\n                    Milton sank all three 3s and scored 19 points in the half and Maxey, a first-round pick out of Kentucky, continues to shine with his enthusiasm and floaters that made him an instant fan favorite. Sixers fans on social media were seemingly more outraged when Maxey, who scored 15 points, was rumored as part of a Harden deal more than how they felt about Simmons possibly leaving town.\n\n\r\n                    “As long as I’m here, I’m going to try to make Ben a better player,” Rivers said. “And to me, that is the most important part of our relationship.”\n\n\r\n                    EMBIID AND SIMMONS\n\n\r\n                    Embiid had a brief scare when he went up for a basket and slammed his head on the court when he was fouled by Chris Silva. Embiid came up holding the back of his head after the non-shooting foul. Sixers were yelling “He shot the ball! He shot it!” at the refs, to no avail. No worries, the Sixers kept possession and Maxey connected on an alley-oop to Simmons for a 61-47 lead.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: F/C Meyers Leonard sat out with a strained left shoulder. ... G Tyler Herro left the game early with back spasms.\n\n\r\n                    76ers: F Mike Scott left in the first half with a sore right knee. ... Milton was 11 of 15 from the floor with seven assists. ... G Isaiah Joe hit four 3s and scored 12 points.\n\n\r\n                    HE SAID IT\n\n\r\n                    “This is who we are and we have to develop those competitive habits.” — Spoelstra, on his undermanned team.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Return home for a Saturday game against Detroit.\n\n\r\n                    76ers: Play Saturday at Memphis.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997104.871593
}