{
  "game_id": "0021300782",
  "espn_id": "400489655",
  "date": "Feb 12, 2014",
  "matchup": "DET vs. CLE",
  "headline": "Kyrie Irving's 3-pointer in clutch carries Cavs past Pistons",
  "body": "AUBURN HILLS, Mich. -- Kyrie Irving's last-minute 3-pointer helped seal another victory for Cleveland -- and the Cavaliers' longest winning streak since LeBron James left.\nIrving connected from beyond the arc with 27.2 seconds remaining, and Cleveland went on to a 93-89 victory over the Detroit Pistons on Wednesday night. The Cavaliers have won four in a row for the first time since an eight-game streak in March 2010, not long before James departed for Miami.\n\"It's been fun,\" said Irving, who was drafted by Cleveland with the No. 1 pick in 2011. \"Four in a row -- this is the first time in my career. It's a big step.\"\nTristan Thompson scored 14 of his 25 points in the fourth quarter for Cleveland, overpowering Detroit's vaunted front line as the Cavs rallied from a 10-point deficit in the final period. The Pistons had their three-game winning streak snapped.\nAndre Drummond had 16 points and 17 rebounds for the Pistons, but he didn't do much in the fourth quarter, when Thompson took control inside.\nCleveland led by one in the final minute when Irving made his big 3-pointer as the shot clock expired to put the Cavs ahead 89-85.\nCleveland beat the Pistons for the first time in eight meetings.\nDetroit was playing its second game under interim coach John Loyer after Maurice Cheeks was fired Sunday, and this was a repeat of the problems the Pistons have had all season at home. Detroit has lost six games at The Palace when leading after three quarters.\n\"We didn't guard as well as we did in the first three quarters,\" Loyer said. \"They dominated the boards down the stretch. They got too many second shots. When you lead for 46 minutes, you expect to win the game.\"\nIt was 76-66 in the fourth when the Cavaliers cut into the lead with an 8-0 run capped by Thompson's dunk off a nice pass from Irving. Detroit tried to hold on, but Irving made two free throws with 2:06 remaining, giving Cleveland its first lead of the game at 82-81.\nJosh Smith spun to the basket for a dunk to put the Pistons back ahead, but Thompson came up with an offensive rebound and dunked to put the Cavs up 84-83. After Smith missed inside, a put-back dunk by Thompson at the other end made it 86-83.\nKyle Singler cut Cleveland's lead to one when he made two free throws with 51.4 seconds left, but with the Cavaliers' next possession seemingly going nowhere, Irving found enough space to make his second 3-pointer of the game -- and Detroit never recovered.\n\"I've got to be better down the stretch and make that final box-out -- that's what got them going,\" Drummond said. \"When Thompson got that put-back, and Kyrie hit that big 3 down the stretch, too, I've got to put that on my shoulders. That's on me.\"\nIrving finished with 23 points. Thompson had seven of his 15 rebounds in the fourth quarter.\nWith so much mediocrity in the Eastern Conference this season, hardly anyone is really out of the playoff race. Detroit trails Charlotte by a half-game for the eighth and final postseason spot. Cleveland is three back of the Bobcats.\n\"It was a big game for us -- especially the last game before the All-Star break,\" Thompson said. \"A lot of teams come out thinking about the beach and being on vacation, but for us, we wanted to finish out the week strong.\"\nDrummond had 10 offensive rebounds, but the Pistons' poor outside shooting finally caught up to them. Detroit went 9 for 38 outside the paint, including 4 of 23 from 3-point range.\nRodney Stuckey was limited to 12 minutes for Detroit because of dizziness, and Cleveland was without Anderson Varejao, who sat out a second straight game with a sore back.\nGame notes\nRookie Anthony Bennett, who had his first career double-double on Tuesday in a win over Sacramento, scored only two points against Detroit. ... Drummond had only two points and two rebounds in the fourth quarter.",
  "source": "espn_api",
  "crawled_at": 1764993303.2628639
}