{
  "game_id": "0022300710",
  "espn_id": "401585338",
  "date": "Feb 04, 2024",
  "matchup": "TOR @ OKC",
  "headline": "Thunder overcome 23-point deficit to beat Raptors 135-127 in double-overtime",
  "body": "OKLAHOMA CITY -- — Josh Giddey scored 24 points, Shai Gilgeous-Alexander had 23 and the Oklahoma City Thunder overcame a 23-point deficit to beat the Toronto Raptors 135-127 in double-overtime Sunday night.\n\n\r\n              Chet Holmgren and Lu Dort each added 22 points and Aaron Wiggins had 20 to help Oklahoma City improve to 35-15. The Thunder tied a team record with 23 3-pointers on 63 attempts.\n\n\r\n              “They made us uncomfortable in the first half,” Oklahoma City coach Mark Daigneault said. “You never know how a team’s going to play you, so it took us obviously a little bit to calibrate that. It was an impressive show of confidence by our team ... to go out there and get that one.”\n\n\r\n              RJ Barrett led Toronto with 23 points. Scottie Barnes, Jakob Poeltl and former Thunder guard Dennis Schroder each scored 19 points. The Raptors made 14-of 35 3-pointers.\n\n\r\n              Dort scored six points in the second overtime, hitting a 3-pointer to put the Thunder ahead 121-118 and converted a 3-point play later to make it 127-123.\n\n\r\n              Gilgeous-Alexander, who failed to score at least 30 points for the first time in 10 games, made a 3 to tie it 118 in the first overtime. He then blocked a shot by Gary Trent just before the buzzer that would have won it for Toronto (17-32).\n\n\r\n              “It was a gutsy win for sure,” Gilgeous-Alexander said. “What we brought in the second half was needed. In order to win in a sustainable way requires you to trust each other. The guys that we have in the locker room trust each other, so because of that we were able to win.”\n\n\r\n              Aaron Wiggins’ layup following a turnover by Barrett tied it at 110 with 4.7 seconds left in regulation, and Barrett missed a 3-pointer as time expired.\n\n\r\n              “Played on the road against a really good team, “Toronto coach Darko Rajakovic said. “I thought that the first half we did an outstanding job, both on offense and defense.\"\n\n\r\n              The Thunder missed 18 of 25 3-point shots in the first half and trailed by 16 points at the break. The Raptors led 76-53 in the third quarter before the Thunder went on a 17-2 run to pull to 78-72 with 3:02 remaining.\n\n\r\n              Oklahoma City played without forward Jalen Williams (sprained right ankle) and guard Isaiah Joe (bruised sternum) for the third straight game. Williams is the team’s No. 2 scorer and Joe leads the Thunder in 3-pointers.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At New Orleans on Monday night.\n\n\r\n              Thunder: At Utah on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995817.7139788
}