{
  "game_id": "401810125",
  "espn_id": "401810125",
  "date": "Nov 22, 2025",
  "matchup": "NO vs ATL",
  "headline": "Porzingis scores 29 as Hawks win 115-98 to hand Pelicans their 9th straight loss",
  "body": "NEW ORLEANS -- — Kristaps Porzingis scored 29 points and Vit Krejci added 21 off the bench on seven 3-pointers to propel the Atlanta Hawks to a 115-98 victory over the skidding New Orleans Pelicans on Saturday night.\n\n\r\n              Jalen Johnson had 18 points, 11 rebounds and nine assists for the Hawks, who stopped a two-game skid and won for the eighth time in 11 road games. Dyson Daniels, drafted in the first round by the Pelicans in 2022, provided 14 points and eight rebounds.\n\n\r\n              Playing its fifth game in seven nights, New Orleans lost its ninth straight overall and fell to 2-15 this season.\n\n\r\n              Porzingis shot 11 of 17 from the field and Krejci went 7 for 10 from 3-point range. \n\n\r\n              Atlanta overcame a sluggish start by outscoring the Pelicans 67-45 over the second and third quarters to erase an early deficit.\n\n\r\n              Johnson scored nine consecutive points to spark a 15-4 run that put the Hawks up 42-36 in the second.\n\n\r\n              Johnson had 11 points and Porzingis scored 14 in the quarter. Atlanta turned up its defensive pressure, forcing seven Pelicans turnovers in the period and outscoring them 35-21 to build a 56-46 halftime lead.\n\n\r\n              Because Zion Williamson sat out the second night of a back-to-back to rest his left hamstring and Herb Jones missed his first game of the season with a back injury, the Pelicans started three rookies for the first time this season: Derik Queen, Jeremiah Fears and Micah Peavy.\n\n\r\n              Queen averaged 25 points over the previous two games and finished with 20 this time. Fears added 11 points on 5-of-13 shooting.\n\n\r\n              Trey Murphy III had 19 points and Saddiq Bey scored 18 for the Pelicans.\n\n\r\n              Up next\r\n              Hawks: Host the Charlotte Hornets on Sunday night.\n\n\r\n              Pelicans: Host the Chicago Bulls on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042675.952796
}