{
  "game_id": "0021900374",
  "espn_id": "401161016",
  "date": "Dec 13, 2019",
  "matchup": "MIA vs. LAL",
  "headline": "Lakers snap Heat's home winning streak, top Miami 113-110",
  "body": "MIAMI --  LeBron James compared the game to a heavyweight fight.\n\nIf so, then the final punch was thrown by the Miami Heat -- and it missed.\n\nAnthony Davis scored 33 points, James had 28 while coming within a rebound of a triple-double and the Los Angeles Lakers held off the Heat 113-110 on Friday night.\n\n\"Two teams that are playing extremely well right now in this part of the season,\" James said. \"Two teams that play physical, play together, play hard. That's why they are where they are at this point in the season and that's why we are where we are.\"\n\nJames had 12 assists and nine rebounds and Davis grabbed 10 rebounds. The Lakers improved to 23-3 and remained tied with Milwaukee for the NBA's best record. They also extended the second-longest road winning streak in franchise history to 13 games and rallied from a double-digit deficit to win for the eighth time already this season.\n\nIt wasn't over until the very last second -- Jimmy Butler knocked over James on his way to getting free enough to take the last shot, but his 3-pointer over Davis' outstretched arm bounced off the rim.\n\n\"It's always great to go against a great competitor in our league,\" James said about Butler. Including playoffs, they've squared off 34 times -- going 17-17.\n\nButler led Miami with 23 points, Derrick Jones Jr. had 17, Kendrick Nunn added 16 and Kelly Olynyk had 15 . Bam Adebayo had 12 points and 12 rebounds for Miami, which had been 11-0 at home.\n\n\"All things being equal, these are two really good teams playing back and forth,\" Heat coach Erik Spoelstra said. \"We were able to create some separation in the first half, and then in the third quarter they were able to impose their will.\"\n\nThe Lakers outrebounded Miami 50-34, and the last of those was the biggest. Kentavious Caldwell-Pope missed a free throw with 8 seconds left to keep the Heat within two, but Miami couldn't get the rebound. Caldwell-Pope went back to the line with 4.2 seconds left, made one of two again and the Lakers' lead was pushed to three.\n\nButler took the last shot for Miami, a 3-pointer with about a second left. It hit the rim and bounced off, the Heat argued that he was fouled to no avail, and the Lakers survived in James' lone trip this season to the city where he won championships in 2012 and 2013.\n\n\"We were able to get that stop,\" Lakers coach Frank Vogel said.\n\nThe Lakers were down by as many as 14 in the first half. James connected on a deep 3-pointer with 8:21 left in the third to tie the game at 65-65, spinning halfway around afterward and punching himself in the chest with both fists as the Heat called time -- after what had been a 10-point lead a mere 3:05 earlier was gone in a flash.\n\nDavis hit a 3 on the next possession to put the Lakers on top, JaVale McGee threw down an alley-oop lob from James while getting fouled a few seconds later to push the lead to 71-65, and Los Angeles was suddenly in control.\n\nThe Lakers' lead got as big as 11 later in the third -- a 21-point turnaround from earlier in the quarter -- before Miami clawed back within three going into the fourth. But the Lakers held the lead the rest of the way.\n\nTIP-INS\n\nLakers: When Miami's Chris Silva made a pair of free throws with 4:02 left in the first half, the Lakers trailed 51-41 -- the team's first double-digit deficit on the road in their last 3 hours, 43 minutes and 33 seconds of play. ... James improved to 6-13 at Miami as a visitor. He went 163-35 in home games with the Heat.\n\nHeat: Celebrities at the matchup included Jennifer Lopez and Alex Rodriguez -- both with personalized Heat \"Vice\" jerseys -- along with Heat legend Chris Bosh, Gucci Mane and DJ Khaled. ... Not only had Miami been 11-0 at home, but the Heat also were 13-1 when leading at halftime and 14-1 in games where they had led by more than 10 points.\n\nSPO VS. VOGEL\n\nIt was the 50th time, including playoffs, that Spoelstra and Vogel went head-to-head -- the majority of those coming in the four-year span where James was in Miami and Indiana was an annual postseason problem. \"It's always a chess match,\" Vogel said. Spoelstra leads the head-to-head, 26-24.\n\nGOING HOME\n\nJames is headed to Columbus, Ohio, on Saturday for a high school game like no other. It pits his alma mater, St. Vincent-St. Mary's of Akron, against Sierra Canyon -- the team featuring, among others, his son Bronny and Dwyane Wade's son Zaire. James said he won't be conflicted. \"I'll be cheering for my son,\" James said.\n\nUP NEXT\n\nLakers: At Atlanta on Sunday.\n\nHeat: At Dallas on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995533.798835
}