{
  "game_id": "0022400449",
  "espn_id": "401705015",
  "date": "Dec 31, 2024",
  "matchup": "TOR @ BOS",
  "headline": "Jayson Tatum scores 23, Celtics rout Toronto 125-71 as Raptors' losing streak hits 11 games",
  "body": "BOSTON -- — Jayson Tatum scored 18 of his 23 points in Boston's dominant third quarter, and the Celtics routed Toronto 125-71 on Tuesday, extending the Raptors' losing streak to 11 games.\n\n\r\n              The Celtics outscored the Raptors 45-18 in the third, using an onslaught of 3-pointers to pull away and close out 2024 with a blowout. Boston made 10 of 12 shots from beyond the arc in the period. Tatum hit four 3s and Jrue Holiday and Sam Hauser each hit two as Boston shot 74% for the period.\n\n\r\n              Holiday returned after missing three games with a right shoulder injury, finishing with 14 points. Payton Pritchard scored 19, Derrick White had 16 and Hauser finished with 12 points. Jaylen Brown added 12 points and nine rebounds in the win.\n\n\r\n              Scottie Barnes led Toronto with 16 points and 13 rebounds. Jakob Poeltl grabbed 13 rebounds for the Raptors, who went 2-11 in the month of December. \n\n\r\n              Takeaways\r\n              Raptors: Toronto never recovered after committing 12 turnovers in the first half while shooting just 29.5% (13 for 44) in the first two periods. It only got worse in the third quarter as the Celtics more than doubled the Raptors’ scoring.\n\n\r\n              Celtics: Boston led 90-53 by the end of the third quarter and rested its starters in the fourth.\n\n\r\n              Key moment\r\n              After missing their first nine shots and falling behind 6-2 early, back-to-back 3-pointers by White and Holiday midway through the first quarter started the Celtics on an 8-0 run that put Boston in front for good.\n\n\r\n              Key stat\r\n              Boston forced 21 turnovers, while committing just 13. \n\n\r\n              Up next\r\n              The Raptors are home Wednesday against the Nets. The Celtics open 2025 on the road Thursday at the Minnesota Timberwolves. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996973.0969899
}