{
  "game_id": "0022400555",
  "espn_id": "401705121",
  "date": "Jan 14, 2025",
  "matchup": "OKC @ PHI",
  "headline": "Shai Gilgeous-Alexander scores 32 as the Thunder beat the short-handed 76ers 118-102",
  "body": "PHILADELPHIA -- — Shai Gilgeous-Alexander scored 32 points and Jalen Williams had 24 to lead the Oklahoma City Thunder to a 118-102 win over a Philadelphia 76ers team missing three All-Stars on Tuesday night.\n\n\r\n              Joel Embiid, Tyrese Maxey and Paul George sat out with injuries as the Sixers continued their slide down the Eastern Conference standings.\n\n\r\n              The Thunder built a 21-point lead and have won 18 of 19 games headed into Thursday's rematch against Cleveland in a matchup of teams with the best records in each conference.\n\n\r\n              With the stars out, Justin Edwards led the 76ers with 25 points, and Jeff Dowtin Jr. had 18.\n\n\r\n              Takeaways\r\n              Thunder: Gilgeous-Alexander entered the game with a share of the NBA scoring lead at 31.4 points and topped his average with a a pair of late free throws in the fourth that gave him 32. Isaiah Hartenstein had nine points and 16 rebounds.\n\n\r\n              76ers: Philadelphia is just not a good team when Embiid, George and Maxey don't play. The Sixers have lost three straight games, six of eight and at 15-23 are closer to a spot in the draft lottery than postseason play. Embiid missed his 25th game of the season. Embiid has played in just 13 games this season. The Sixers are 7-6 with Embiid and 8-17 without him. \n\n\r\n              Key moment\r\n              The Sixers closed within 91-87 in the fourth before Jalen Williams hit a 3 during a late 8-0 run that helped put the game away.\n\n\r\n              Key stat\r\n              The Thunder shot 70% (14 of 20) from the floor in the first quarter and never trailed in the game.\n\n\r\n              Up next\r\n              The Thunder host Cleveland on Thursday. The Cavaliers beat the Thunder 129-122 last week to end OKC’s 15-game winning streak in a matchup of NBA’s top teams. The 76ers host the Knicks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997510.7458382
}