{
  "game_id": "0022000638",
  "espn_id": "401307425",
  "date": "Mar 19, 2021",
  "matchup": "PHX vs. MIN",
  "headline": "Suns bounce back from loss, beat Timberwolves 113-101",
  "body": "PHOENIX -- — Chris Paul scored 20 points, Devin Booker added 16 and the Phoenix Suns bounced back from a loss to the Minnesota Timberwolves the night before by beating them 113-101 on Friday.\n\n\r\n                    Mikal Bridges scored 17 points and Langston Galloway added 14 off the bench for the Suns, who improved to 27-13 and have won 16 of their last 20 games. \n\n\r\n                    “Obviously, we wanted some type of revenge tonight,” Booker said. “We had a salty feeling in our mouths after the loss last night.\" \n\n\r\n                    Karl-Anthony Towns led the Timberwolves with 24 points. Ricky Rubio had 21 points and 10 assists for Minnesota, which fell to 10-32.\n\n\r\n                    Minnesota stunned Phoenix on Thursday night with a 123-119 comeback win. Towns and rookie Anthony Edwards combined to score 83 points in that one, but the Suns were ready for them this time.\n\n\r\n                    “The NBA is played a little like a chess game,” Rubio said. “You make a move and then they make a counter move.”\n\n\r\n                    The Timberwolves looked as though they might pull off another upset for a while on Friday. In the midst of a 10-0 Minnesota run during the second quarter that gave the Timberwolves a 45-43 lead, Suns coach Monty Williams was ejected after receiving two quick technicals for arguing with the officials. \n\n\r\n                    Williams said he was upset when Booker got “smacked in the face” and Bridges got “drilled” going to the basket and there was no foul call on either play. \n\n\r\n                    “That is not a tactic I use but tonight was one of those nights I felt like I had to stand up for our guys,” Williams said. “I wasn’t trying to make a point or anything like that. I was a bit upset about that many no-calls.”\n\n\r\n                    The ejection seemed to ignite the Suns, who went on a 17-2 spurt that gave Phoenix a 60-47 advantage late in the first half. The Suns led 64-54 at the break.\n\n\r\n                    The Timberwolves rallied in the second half, scoring the first 15 points to push ahead 69-64 with 7:39 left in the third quarter. The Suns regained their composure and took an 83-78 lead into the fourth. \n\n\r\n                    Minnesota didn't get any closer after the Suns opened the fourth period with an 11-3 surge to put the game away. Bridges had five points in that spurt. \n\n\r\n                    “Chris was amazing and the bench came in and gave us a big boost in the third and the beginning of the fourth,” Williams said. \n\n\r\n                    Edwards had 11 points one night after scoring a career-high 42. The No. 1 overall draft pick finished 4 of 18 from the field and committed seven turnovers.\n\n\r\n                    “I’ve got to be more consistent with my mid-range shot, my 3-ball, because everyone knows I want to get to the rim,” Edwards said.\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Malik Beasley (NBA suspension), Jordan McLaughlin (health and safety protocols) and D’Angelo Russell (left knee surgery) did not play. ... Minnesota fell to 44-73 against the Suns. \n\n\r\n                    Suns: Williams was ejected for the first time in two seasons with the Suns. In fact, he was whistled for his first two technical fouls over the same span. ... F Cam Johnson missed his sixth straight game because of the league’s health and safety protocol. \n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: Return home to face Oklahoma City on Monday.\n\n\r\n                    Suns: Host the Los Angeles Lakers on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997744.874377
}