{
  "game_id": "0021900272",
  "espn_id": "401160914",
  "date": "Nov 29, 2019",
  "matchup": "IND vs. ATL",
  "headline": "Jeremy Lamb, T.J. Warren lead Pacers past Trae Young, Hawks in OT",
  "body": "INDIANAPOLIS -- When the Indiana Pacers finally asserted themselves after a sluggish half, the Atlanta Hawks' Trae Young continually made shots to remind Indy that nothing would be easy.\nYoung tied a career high with 49 points, but the host Pacers overcame an 11-point halftime deficit as well as being pushed an extra five minutes for a 105-104 overtime triumph over the Hawks on Friday night.\nT.J. Warren hit the go-ahead 3-pointer with 1:13 remaining for the Pacers, and Jeremy Lamb had 20 points and sparked a quick start in overtime with a 20-foot jumper and an assist on a Myles Turner 3-pointer.\n\"It was just a little adversity,\" Turner said. \"I feel like we faced it well.\"\nBut back came the Hawks, trying to avoid a ninth consecutive loss, as Young scored eight of his team's 10 points in overtime, including a pair of 3-pointers.\n\"I guess it was good individually,\" Young said, \"but people who know me know I don't care at all. If we don't win, none of that matters. I didn't do enough.\"\nYoung's 49 points tied for the fourth-highest, single-game total in Bankers Life Fieldhouse history. He finished 16 of 28 from the floor, hitting 8 of 15 on 3-pointers.\n\"The head of the snake, Trae Young, he was great tonight,\" Lamb said. \"He was great, but we were able to get enough stops.\"\nWarren's only 3-pointer broke a 99-all tie. He finished with 16 points.\n\"We just kept grinding and finally got the lead late,\" Pacers coach Nate McMillan said. \"They found a way to get this game.\"\nAfter two quarters, McMillan was scratching his head with the Pacers trailing 54-43.\n\"I was thinking it was too much turkey,\" he said. \"We looked asleep in the first half.\"\nTurner, who along with Domantas Sabonis scored 17 points, sensed his team would respond based on how they've played recently.\n\"These past couple of games, we've started to come together a lot more,\" he said. \"We came back and responded well.\"\nWarren and Malcomb Brogdon had 16. Brogdon had a chance to win the game in regulation but his last-second bank shot was long.\nThe Hawks' DeAndre' Bembry and Alex Len added 15 points apiece off the bench.\nHawks coach Lloyd Pierce wishes his team had the balance of the Pacers. Aside from Young, the rest of the Hawks shot just 35.6 percent (23 of 63).\n\"We needed every bit of (Young's), whatever number, 49, 48, whatever he ended up with, we needed every bit of that,\" Pierce said. \"However, we've got to balance that. We were playing him heavy minutes.\"\nTIP-INS\nHawks: Forward Jabari Parker is averaging 17.8 points on 51.8%t shooting, one of just four NBA players to average 17 points with 20 3-pointers on 50%tshooting. ... Young became the franchise's second-youngest player, at 21 years and 69 days, to reach 2,000 career points on Wednesday.\nPacers: Brogdon is shooting a league-leading 96% at the line. ... The next five games are on the road, where Indiana is 3-4.\nMOVE OVER, MOE\nMcMillan tied Doug Moe for 24th on the NBA's list with 628 victories. McMillan, whose overall record is 628-566, recently passed Larry Bird (147) and Bob \"Slick\" Leonard (142) for fourth in career franchise victories now at 150.\nUP NEXT\nHawks: At Houston on Saturday night.\nPacers: At Philadelphia on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995873.6593971
}