{
  "game_id": "0022400816",
  "espn_id": "401705382",
  "date": "Feb 23, 2025",
  "matchup": "TOR vs. PHX",
  "headline": "Boucher has 23 points and 10 rebounds to help the Raptors beat slumping Suns 127-109",
  "body": "TORONTO -- — Immanuel Quickley, Chris Boucher,and RJ Barrett each scored 23 points and the Toronto Raptors made 20 3-pointers in a 127-109 victory over the Phoenix Suns on Sunday night.\n\n\r\n              Quickley made 5 of 7 3-pointers and the Raptors were 20 of 35 overall from long range in sending the Suns — coming off a victory Saturday in Chicago — to their fifth loss in six games.\n\n\r\n              Boucher also had 10 rebounds, and Scottie Barnes added 20 points for the Raptors. Toronto shot 8 for 8 from 3-point range in the fourth quarter to win for the second time in eight games.\n\n\r\n              Devin Booker scored 31 points and Bradley Beal had 30 for the Suns. Kevin Durant scored 15 points, but shot 5 for 15 overall, including 0 for 5 from 3-point range.\n\n\r\n              The Suns trimmed a 19-point deficit to two in the final five minutes before the Raptors sealed it with the late 3-pointers.\n\n\r\n              Takeaways\r\n              Suns: Phoenix missed its first five 3-point attempts and shot 2 for 13 from distance in the first half. The Suns finished 7 for 28 from outside, matching a season low for 3-pointers.\n\n\r\n              Raptors: Boucher finished a point shy of his season high set against Sacramento on Nov. 2.\n\n\r\n              Key moment\r\n              Greyson Allen’s 3-pointer cut it to 105-103 with 5:02 left in the fourth. Boucher and Quickley answered with back-to-back 3s for Toronto, and Quickley added another after Booker’s driving layup.\n\n\r\n              Key stat\r\n              Thanks to Boucher’s big performance, Toronto outscored Phoenix 42-18 in bench points.\n\n\r\n              Up next\r\n              Both teams play Tuesday night. Phoenix wraps up its five-game trip in Memphis, while Toronto hosts Boston. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996947.708618
}