{
  "game_id": "0021701225",
  "espn_id": "400975971",
  "date": "Apr 11, 2018",
  "matchup": "MIN vs. DEN",
  "headline": "Butler, Towns lead T-wolves past Nuggets in OT, to playoffs",
  "body": "MINNEAPOLIS --  The toughness that Jimmy Butler, Taj Gibson and the rest of the veterans brought to the Minnesota Timberwolves this season was on display from start to finish.\n\nFinally, after a 14-year absence, the long-languishing franchise is back in the playoffs.\n\nFittingly, it took until the last game and then some to get there.\n\nButler scored 31 points, Karl-Anthony Towns had 26 points and 14 rebounds, and the Timberwolves outlasted the Denver Nuggets 112-106 in overtime Wednesday night in the first final-day play-in game in the NBA in 21 years.\n\nNo team in the league had gone longer without a postseason appearance than the Timberwolves, who took Towns with the first overall pick in the 2015 draft and traded for Butler last summer to put themselves in position to return.\n\n\"I'll probably fall asleep tonight and wake up in the middle of the night and start crying,\" said Towns, who was 8 years old the last time the Wolves were in the playoffs. \"It'll hit me, what happened.\"\n\nThe Nuggets won six in a row to force this elimination game, including a 100-96 decision in Denver last week that was the last time the Wolves (47-35) played without Butler, and went 23-12 over their previous 35 contests.\n\nNikola Jokic locked in a classic big man battled with Towns, finishing with 35 points and 10 rebounds, but he missed six of his last eight shots after the third quarter as the valiant finish to this season fell just short. The Nuggets (46-36) haven't made the playoffs in five years.\n\nNow it's the Timberwolves who are moving on to play, gulp, the NBA-best Houston Rockets.\n\n\"I feel like our effort was outstanding. Theirs was too,\" said Will Barton, who had 24 points but shot just 3 for 12 after halftime. \"They just made the plays at the end. Give them credit.\"\n\nBarton's 3-pointer beat the shot clock for Denver's first lead, 104-103, since midway through the first quarter. After Gibson hounded Jokic to force an air-balled 3-point try, Jeff Teague swished a floater with 1:19 left in overtime to put the Wolves back in front for good.\n\nAndrew Wiggins sank two foul shots with 15 seconds remaining to make it 110-106 and finish with 18 points, and the Wolves were finally on their way to a celebration more than a decade in the making. Butler, who has not held back from openly challenging Wiggins and the other junior members of the team to play with more tenacity, walked up to Wiggins before the free throws with some forceful encouragement.\n\n\"I was like, `Wiggs, I know you can do this,\" Butler said. \"And he told me to move. He did. He's like, `Move!' I'm like, `OK, excuse me.' And he stepped up and hit both of them. So, from now on, stay in my lane.\"\n\nThe Wolves were ahead by as many as 10 points in the second quarter and took a 99-91 lead on Teague's 3-pointer with 4:26 left in regulation, but just like with this whole regular season the Nuggets wouldn't go away.\n\nJokic answered with a 3-pointer, and Butler missed both of his free throws. Back-to-back jumpers by Jamal Murray, the last one from 3-point range, tied it. Butler put the Wolves back in front with a 13-footer, but he missed twice more from the floor in the final two minutes. Murray's off-balance bank tied it at 101, so the Wolves needed Gibson's defense to save them down the stretch.\n\nHe forced Jokic into the baseline for a forced layup that missed badly. Then Gibson stripped the ball from the 7-foot Serbian in the corner to give the Wolves the ball back with 1.6 seconds remaining in regulation. Jamal Crawford's heave from just inside half court was on line, but it fell short.\n\n\"I just took one dribble,\" Jokic said, \"and Taj made a really good defensive play.\"\n\nPLAY NOW, REST LATER\n\nGibson played through a sore neck that forced him out of the last game in the first quarter, finishing with eight points in 35 minutes. Butler logged 42 minutes after playing 23 minutes apiece in his previous two games.\n\n\"He told me after the shootaround that he's from Brooklyn,\" coach Tom Thibodeau said, \"and he said he'd be fine.\"\n\nDRAMATIC FINISH\n\nThe game marked only the third time since the NBA's current 16-team format began in 1984 that two teams met on the last day of the regular season with the winner qualifying for the playoffs and the loser being eliminated. Washington beat Cleveland in 1997 and Denver beat Sacramento in 1995 to claim the final spots.\n\nDIVISION DOMINANCE\n\nWith the loss, the Nuggets finished last in the Northwest Division, a mere three games out of first. This was the first time in 14 seasons since the NBA realigned into six divisions of five times apiece that the last-place team was less than 11 games behind the leader.\n\nTIP-INS\n\nNuggets: Jokic posted his seventh 30-point game of the season, three of those in the last six games. ... Wilson Chandler went scoreless in 48 minutes. ... The Nuggets had 15 turnovers, turning into 24 points for the Wolves.\n\n\"You can't go on the road and beat yourself in the most important game of the season,\" coach Mike Malone said.\n\nTimberwolves: Towns finished the season with 68 double-doubles, the most in the NBA. His streak of 246 consecutive games played, every contest of his career, is the longest current run in the league. ... This was the 16th sellout crowd for the Wolves, their most since the 1991-92 season.\n\nUP NEXT\n\nThe Wolves will start the first round in Houston, on either Saturday or Sunday.\n\n---\n\nFor more AP NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992610.753141
}