{
  "game_id": "401810043",
  "espn_id": "401810043",
  "date": "Nov 08, 2025",
  "matchup": "SA vs NO",
  "headline": "Fox scores 24 points in season debut, Wembanyama has 18 points, 18 rebounds as Spurs top Pelicans",
  "body": "SAN ANTONIO -- — De’Aaron Fox scored 24 points in his season debut, Victor Wembanyama added 18 points and 18 rebounds, and the San Antonio Spurs beat the New Orleans Pelicans 126-119 on Saturday night.\n\n\r\n              Stephon Castle added 14 points and 14 assists as San Antonio won its second straight after two straight losses following a franchise-best 5-0 start.\n\n\r\n              Trey Murphy III scored 41 points on 15-for-22 shooting for the Pelicans. Murphy was 5 for 11 on 3-pointers, including a high-arcing 31-footer at the close of the third quarter to stun the sellout crowd. \n\n\r\n              Fox and Wembanyama played together for just the sixth time since San Antonio acquired the speedy point guard from Sacramento on Feb. 5 as part of a three-team trade with Chicago.\n\n\r\n              Fox’s season ended March 12 when he opted to undergo season-ending surgery to repair a torn tendon in his left pinky finger. Fox then sustained a right hamstring injury during the offseason as he prepared for his first full season with the Spurs.\n\n\r\n              Jeremiah Fears had 18 points and Herb Jones added 15 for the short-handed Pelicans, who were without Zion Williamson (strained left hamstring), Jordan Poole (strained left quad) and Yves Missi (illness).\n\n\r\n              After missing his first two attempts, Fox drained a stepback 3-pointer for his bucket of the season 2:21 into the second quarter. The 24-footer was the start of a personal 13-point run over 2 1/2 minutes for Fox to break a 32-all tie. He was 5 for 5 over that span, including a pair of 3-pointers to bookend the run.\n\n\r\n              New Orleans held Dallas to 99 points in a two-point victory Wednesday, the first time in 14 games an opponent scored less than 100. There would be no repeat Saturday as eight Spurs scored in double figures.\n\n\r\n              San Antonio held New Orleans to an opponent season-low 22 points in the opening quarter and never trailed.\n\n\r\n              Up next\r\n              Pelicans: Visit Phoenix on Monday.\n\n\r\n              Spurs: Host Orlando on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042586.960603
}