{
  "game_id": "0022401168",
  "espn_id": "401705734",
  "date": "Apr 10, 2025",
  "matchup": "IND vs. CLE",
  "headline": "Haliburton scores 23, Pacers secure top-four seed in East with 114-112 win over short-handed Cavs",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton scored eight of his 23 points during a key scoring run in the fourth quarter and Aaron Nesmith added 22 points to help the Indiana Pacers rally past the short-handed Cleveland Cavaliers 114-112 Thursday night.\n\n\r\n              Indiana won its sixth straight and secured a top-four seed and the home-court advantage in a playoff series for the first time since 2014. The Pacers are also one win away from their first 50-win season since 2013-14.\n\n\r\n              Haliburton added 10 assists, eight rebounds and three blocks while making four 3-pointers. Myles Turner had 13 points, seven rebounds and four blocks.\n\n\r\n              Cleveland's Ty Jerome finished with 24 points and six assists despite being held out of the fourth quarter. De'Andre Hunters had 23 points and 11 rebounds. And, Jaylon Tyson missed a midrange jumper at the buzzer that could have forced overtime.\n\n\r\n              Coach Kenny Atkinson rested four of his five starters because the Cavs had already clinched the No. 1 seed in the East. Center Jarett Allen grabbed 10 rebounds in the first half before joining the starters on the bench, and Atkinson was ejected after drawing consecutive technical fouls for arguing following a no-call with 58.6 seconds left in the third quarter.\n\n\r\n              Takeaways\r\n              Cavaliers: Even without their regulars, Atkinson's team delivered a strong performance. While Cleveland didn't win, its strong bench play sent a message to the rest of the league about what to expect in the playoffs.\n\n\r\n              Pacers: Indiana spent months chasing home-court advantage — and now they have it. The Pacers didn't earn many style points Thursday, but they were gritty enough to give coach Rick Carlisle a choice — rest his his players or chase the No. 3 seed.\n\n\r\n              Key moment\r\n              Haliburton made back-to-back 3-pointers to cap a 10-0 run that erased a 107-103 deficit and gave Indiana a 113-107 lead with about three minutes left.\n\n\r\n              Key stat\r\n              Indiana outscored Cleveland 23-9 on fast-break points.\n\n\r\n              Up next\r\n              The Cavaliers are at Neew York on Friday. The Pacers host Orlando on Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764998122.73492
}