{
  "game_id": "0022300506",
  "espn_id": "401585134",
  "date": "Jan 08, 2024",
  "matchup": "CHI @ CHA",
  "headline": "Coby White scores 27 as Bulls hold on to beat Hornets 119-112 in OT",
  "body": "CHARLOTTE, N.C. -- — Coby White scored 27 points in his return to his home state, Andre Drummond added 21 points and 15 rebounds and the Chicago Bulls overcame a 39-point performance from Terry Rozier to beat the Charlotte Hornets 119-112 in overtime on Monday night.\n\n\r\n              Nikola Vucevic added 21 points and nine rebounds in his second game back from an injury for the Bulls (17-21), who defeated the Hornets for the second time in four nights.\n\n\r\n              Rozier had seven 3-pointers and was 12-for-12 from the foul line for Charlotte (8-26), which has lost 13 of its last 14 games.\n\n\r\n              Miles Bridges added 24 points for the Hornets, who remain without starters LaMelo Ball, Mark Williams and Gordon Hayward and key reserves P.J. Washington and Cody Martin due to injuries.\n\n\r\n              White, who grew up in nearby Greensboro and played college ball at North Carolina, said he loves coming back to the state.\n\n\r\n              “It's always fun to come back home and see everybody who supported me throughout my career,” White said. \n\n\r\n              Chicago scored the first eight points points of overtime, but the Hornets wouldn't go away and had a chance to tie the game but Nick Smith Jr's 3-pointer from the top of the key rimmed out.\n\n\r\n              Bridges also missed two 3s in the final 20 seconds for the Hornets, who were 2 of 9 from the field in the overtime period.\n\n\r\n              Rozier, who had 21 points in the second half, was held scoreless in overtime going 0 for 2 from deep while guarded by Alex Caruso.\n\n\r\n              “The longer the game went on, they did what they did in Chicago — they committed the second defender to Terry in every situation and with the guys we have right now, it’s not easy,\" Hornets coach Steve Clifford said.\n\n\r\n              Said White of Rozier: “It is just so tough to contain him. He hit the back rim a couple times in overtime and I thought those shots were down. He gets buckets, that is what he does.”\n\n\r\n              The Bulls beat the Hornets 104-91 in Chicago on Friday night, and it looked like they might run away with this one after bolting to a 14-2 lead. The Hornets stormed back to take a 25-24 lead after the first quarter with Rozier and Bridges combining for 19 points.\n\n\r\n              The Bulls pushed the lead back to seven with 4:16 left in regulation before Rozier knocked down his seventh 3-pointer of the night and Bridges hit a turnaround jumper with 46 seconds left to play.\n\n\r\n              Rozier had a chance to give Charlotte the lead but his 3-ponter attempt came up short with eight seconds left as Clifford pleaded with officials for a foul call. DeMar DeRozan had a chance to win it the buzzer for the Bulls, but couldn't connect from deep, sending the game to overtime.\n\n\r\n              Bulls coach Billy Donovan said that once Vucevic and Zach LaVine are healthy enough they will return to the starting lineup.\n\n\r\n              “I appreciate what Andre has done in the absence of Zach and Vuc,” Donovan said. “It's always a little bit funky when you have guys coming back into the rotation. We got all of these guys coming back and we have to find a chemistry and cohesiveness.” \n\n\r\n              Chicago outscored Charlotte 62-42 in the paint.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host the Rockets on Wednesday night.\n\n\r\n              Hornets: Host the Kings on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995899.012989
}