{
  "game_id": "0021900664",
  "espn_id": "401161306",
  "date": "Jan 22, 2020",
  "matchup": "IND @ PHX",
  "headline": "Warren scores 25 points in Phoenix return, Pacers rout Suns",
  "body": "PHOENIX --  T.J. Warren's first game against his former team went about as well as possible. He scored a game-high 25 points, had three steals and played excellent defense against former teammate Devin Booker.\n\nMost importantly, he won.\n\nWarren was the star, Domantas Sabonis added 24 points and the Indiana Pacers rolled to a 112-87 victory over the Suns on Wednesday night.\n\n\"There were a lot of emotions but as soon as the ball went into the air it was time to play basketball,\" Warren said. \"That's all I was focused on.\"\n\nWarren was playing his first game against the Suns after being traded from Phoenix to Indiana during the offseason. The sixth-year forward -- who played his first five years with the Suns -- shot 11 of 18 from the field.\n\nThe 6-foot-8 Warren was one of the Suns' top scorers during his time in the desert, but the franchise struggled through five losing seasons. Things have been much different in Indiana, which looks like a lock for the playoffs with a 29-16 record and has won six of its last seven games.\n\n\"It's a lot of fun,\" Warren said. \"Just coming into a family-oriented organization, continuing to build and get better with these guys. Everyone compliments each other, everybody gets along. It's just great to be in an environment like that.\"\n\nSabonis added 13 rebounds. The Pacers bounced back from a lopsided loss to Utah 118-88 two days ago and now have a six-game winning streak in the series against the Suns.\n\n\"I love the way we responded,\" Pacers coach Nate McMillan said. \"I thought we were solid for 48 minutes.\"\n\nPhoenix never led and trailed by 25 by midway through the third quarter. The Suns missed their first 11 shots from 3-point range before Elie Okobo hit one late in the third.\n\nKelly Oubre Jr. led Phoenix with 17 points and nine rebounds. Booker added 16 points. The Suns shot 30 of 84 (36%) from the field and were held under 90 points for just the second time this season.\n\n\"Obviously, not a great output tonight of Suns' basketball, the way we want to play, and we've got to figure it out,\" Suns coach Monty Williams said.\n\nIndiana led 54-48 at halftime. Warren and Sabonis both scored 12 points for the Pacers before the break. Booker scored 14 points for the Suns. They lost both games of a two-game homestand after losing to the Pacers and dropping a 120-118 decision to San Antonio on Monday.\n\n\"It's one of those nights in the NBA that didn't go our way,\" Suns guard Ricky Rubio said. \"We didn't play good and we just have to respond.\"\n\nBROGDON MISSES SECOND HALF\n\nPacers guard Malcolm Brogdon didn't return to the game after leaving in the second quarter and getting three stitches for a cut on his forehead.\n\nBrogdon scored five points and had three assists. He came into the game averaging 17.4 points and 7.4 assists. T.J. McConnell started the second half in Brodgon's place and finished with 10 points and 11 assists.\n\nMcMillan said Brogdon was being checked out for a concussion and that he \"wasn't feeling good enough to come back.\"\n\nWHERE'S THE 3-BALL?\n\nThe Suns shot just 4 of 20 from 3-point range while the Pacers were 9 of 20 from long range. It was just the second game in the NBA this season where both teams attempted 20 or fewer 3-pointers. The only other game was on Jan. 9, when the Cavaliers and Pistons both shot 20 3s according to basketball-reference.com.\n\nHIT THE ROAD\n\nPhoenix plays six of its next seven games on the road. That might be a good thing for the Suns: They're 9-10 on the road and just 9-16 at home.\n\nTIP-INS\n\nPacers: Warren and the 32nd overall pick in the 2019 draft were traded to the Pacers on draft day. He averaged a career-high 19.6 points two years ago and was the 14th overall pick in the 2014 draft. .. The Pacers had 45 bench points. Doug McDermott had 12 points on 5-of-8 shooting.\n\nSuns: Rookie forward Cameron Johnson missed his third straight game with a right quad contusion. Johnson is averaging 7.8 points and 3.1 rebounds per game. ... Forward Aron Baynes (left hip soreness) missed his second straight game. He's averaging a career-high 11.5 points and 5.8 rebounds.\n\nUP NEXT\n\nPacers: At Golden State on Friday night.\n\nSuns: At San Antonio on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995845.6190562
}