{
  "game_id": "0021800327",
  "espn_id": "401071008",
  "date": "Nov 30, 2018",
  "matchup": "PHX vs. ORL",
  "headline": "Vucevic powers Magic over Suns 99-85",
  "body": "PHOENIX --  Nikola Vucevic knew he faced a challenge against Phoenix Suns rookie Deandre Ayton in the post on Friday night. He also knew he'd have an advantage on offense.\n\nVucevic deployed his veteran experience against this year's top overall draft pick and finished with 25 points and 15 rebounds as the Orlando Magic defeated the Suns 99-85.\n\n\"I was just trying to stay aggressive. For big men, it takes a little bit, especially on the defensive end, to kind of get a feel for it. The game is so fast,\" Vucevic said. \"He's going to be a real good player.\"\n\nTerrence Ross added 21 points off the bench, and Aaron Gordon finished with 18 points, despite a sore back. D.J. Augustin scored 16 points.\n\n\"I was just playing slow,\" Gordon said. \"Playing old man game, except for playing above the rim. I still dunked it.\"\n\nAyton scored 19 points and Jamal Crawford had 18 as the Suns lost their fourth straight and for the seventh time in eight games.\n\nRoss made the first three baskets of the fourth quarter to give the Magic an 81-71 lead, and Orlando built the lead from there. Vucevic hit a hook shot with two minutes to play that pushed the lead to 98-83.\n\nThe Suns were without their top two scorers, star guard Devin Booker and forward TJ Warren, both out with injuries. Josh Jackson, who started in place of Warren, struggled through a 5-for-21 shooting night and was hit with a technical foul late in the third quarter.\n\n\"I do definitely feel obligated to pick up the slack a little bit. We all do,\" Jackson said. \"We know whenever Devin or TJ doesn't play, our two leading scorers, we have a lot to make up for it.\"\n\nThe Magic went ahead by 10 early in the third quarter on a layup by  Vucevic, and his 3-pointer with 3:40 left gave the Magic a 73-61 lead.\n\nThe Suns closed within 75-71 when Crawford hit a jumper just before the third-quarter buzzer.\n\nRoss hit back-to-back 3-pointers gave the Magic a 27-25 lead in the second quarter after Orlando trailed by four at the end of the first. Ross scored 11 points in the quarter and Orlando led by as many as six, its largest lead of the first half.\n\n\"He takes the shots that he can make,\" Magic coach Steve Clifford said of Ross.\n\nCrawford's 3 with 29.7 seconds left in the half had the Suns trailing 51-48 at the intermission. Crawford made three 3-pointers and scored 11 points in the second quarter.\n\nPhoenix held an eight-point lead in the first quarter, its largest of the game, before the Magic rallied.\n\n\"Sometimes I wonder `How do we lose?' Ayton said. \"It feels like everybody is competing. It's kind of confusing because I know everybody was playing hard today, but we still lose.\"\n\nTIP-INS\n\nMagic: Orlando won its fourth straight against Phoenix. ... Vucevic has scored 20 or more points in four straight games.\n\nSuns: Crawford tied Charles Oakley for 25th in NBA history in career games played when he entered Friday's game. Crawford has appeared in 1,282 games. ... G Troy Daniels saw game action for just the sixth time this season, and second time this month. He tied a season high with eight points. ...  The Suns wore their purple \"Los Suns\" City Edition jerseys for the first time this season.\n\nSUN DUNKING\n\nThe dunk of the night came courtesy of Suns backup center Richaun Holmes, who caught Jackson's lob and slammed over Jerian Grant of the Magic for a 21-15 lead at the 1:55 mark of the first quarter.\n\nPhoenix threw down five dunks in the game.\n\nROOKIE MATCHUP\n\nAyton, the top overall pick in this year's NBA Draft, got the better of a lottery-pick matchup with fellow rookie Mo Bamba of Orlando. Bamba was the sixth overall pick and second center taken after Ayton, and finished with two points. Bamba had a powerful two-handed slam in the fourth quarter for his only basket.\n\nUP NEXT\n\nMagic: At the Miami Heat on Tuesday.\n\nSuns:  At the Los Angeles Lakers on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995096.519527
}