{
  "game_id": "0021800332",
  "espn_id": "401071014",
  "date": "Dec 01, 2018",
  "matchup": "TOR @ CLE",
  "headline": "Kawhi Leonard's 34 lead Kyle Lowry-less Raptors to eighth straight win",
  "body": "CLEVELAND -- Down an All-Star guard, there was no need for the Toronto Raptors to panic.\nNot against one of the NBA's worst teams, and not with Kawhi Leonard around.\nLeonard scored 34 points, Fred VanVleet added 15, and Toronto extended its win streak to eight games, despite missing Kyle Lowry, with a 106-95 victory over the Cleveland Cavaliers on Saturday.\nDanny Green and Pascal Siakam added 15 apiece as the Raptors improved the league's best record to 20-4, reaching the 20-win mark more quickly than at any other time in their history. Toronto also is a league-best 10-2 on the road.\nLowry missed his first game this season with an unspecified back injury. Raptors coach Nick Nurse didn't provide any details about Lowry's back other than to say it flared up earlier in the day.\nLeonard didn't learn until just before tip-off that Lowry, the league's assist leader, wouldn't play.\n\"I told him he should have let me know earlier because I would have slept 20 more minutes,\" Leonard joked. \"I needed that energy tonight.\"\nVanVleet started in place of Lowry, ran Toronto's offense and organized the Raptors defensively. He also made the game's biggest shot, dropping a back-breaking 3-pointer with 2:08 left to put Toronto up 10.\nVanVleet joked that he was the only one happy Lowry didn't dress.\n\"I didn't miss him at all,\" he said, chuckling. \"Any time I can get extra minutes and extra shots up, I'm happy.\"\nJordan Clarkson scored 18 points, and Tristan Thompson had 18 points and 19 rebounds for the Cavs. They hung around but lost their fourth in a row and dropped to 4-18.\nCleveland, which sustained its worst loss of the season on Friday in Boston, did get healthier, as starting guard George Hill returned after missing 11 games with a sprained right shoulder. He scored eight points in 19 minutes.\nToronto was making its first visit to Quicken Loans Arena since May, when the Raptors were swept in four games by Cleveland in the Eastern Conference semifinals. Of course, that Raptors team didn't have Leonard, who came over in a July trade from San Antonio for DeMar DeRozan and has given Toronto fans hope that this might finally be the year.\n\"It's not just Kawhi that makes them different,\" Hill said. \"You get another amazing defender in Danny Green, a laser 3-point shooter in him, and they got experience now. Losing a guy like DeMar is tough, but at the same time, you replace him with a guy of the same caliber like Kawhi, but also adding a guy like Danny, who is playoff-tested, championship-proven, that just makes them an overall better team.\"\nTIP-INS\nRaptors: Reached 20 wins in 26 games in 2014-15. ... Came in shooting a league-best 41 percent on 3-pointers the past five games but went only 7-of-26 behind the arc. ... Won a franchise-record 11 straight last season. ... G Norman Powell (left shoulder subluxation) missed his 12th straight game. ... Assistant coach Phil Handy was a member of the Cavaliers' staff the previous five years, including their 2016 NBA championship team. ... Won for just the second time in 13 games in Cleveland.\nCavaliers: All-Star F Kevin Love (foot surgery) made a brief appearance in the locker room before the game. Love, who is no longer required to wear a walking boot full-time joked, \"I'm walking. It's a miracle.\" The team is expected to update his status in the next few weeks. ... Cleveland was also without C Ante Zizic (knee), F Sam Dekker (ankle) and G David Nwaba (knee). ... Although Hill is back, coach Larry Drew will keep rookie Collin Sexton in the starting lineup. \"It gives us another ball handler on the floor, another guy who can make plays,\" Drew said. \"It gives us speed. It gives us quickness. I like Collin's ability to play off the ball, too.\"\nOH, CANADA\nThompson -- a member of the Canadian national team -- is having one of his best seasons. He came in averaging 11.1 points and a career-high 11.0 rebounds. \"The kid from Toronto is playing pretty well,\" Nurse said. \"He's been a great rebounder for a long time, and he is back to his highest level, or even exceeding it, as a complete player this season.\"\nUP NEXT\nRaptors: Host Denver on Monday night.\nCavaliers: At Brooklyn on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994283.357723
}