{
  "game_id": "0021400529",
  "espn_id": "400578821",
  "date": "Jan 07, 2015",
  "matchup": "DET @ DAL",
  "headline": "D.J. Augustin lifts Pistons past Mavericks to seventh straight win",
  "body": "DALLAS -- Stan Van Gundy had an explanation for his Detroit Pistons' dramatic turnaround:\nPractice.\nSpecifically, three days of practice from Dec. 22-24. Since then, a team that was 5-23 has become the NBA's hottest team, with a seven-game winning streak.\nOn Wednesday night, Detroit never trailed in beating the Dallas Mavericks 108-95. They also came in with a six-game winning streak.\n\"From then on, it's just been different,\" Van Gundy said. \"They've worked harder. They've been more attentive. A lot more together. We don't have guys that are getting concerned about who's in the game, or their playing time, or their shots.\"\n\nThey've had four different high scorers in their seven wins. On Wednesday, it was Greg Monroe, who had 18 rebounds in addition to 27 points for his 13th double-double this season.\nBut D.J. Augustin came off the bench to have an even greater impact, scoring 17 of his 26 points in the fourth quarter. He played only 22 minutes.\n\"We don't have a one-man team,\" Augustin said. \"We have different guys that can contribute every night. It's fun when we're playing together like this and we're winning.\"\nMavericks forward Chandler Parsons said the Pistons are a different team from the one Dallas beat in Detroit last month.\n\"Night and day,\" Parsons said. \"It's all confidence. They obviously always had the talent, same coach, same players, same system, but they're playing free and they're playing confident right now.\"\nThe Mavericks pulled within 81-77 with 8:10 to play, but after drawing a technical foul, Augustin made two 3-point shots to increase the lead to 10 points.\nBrandon Jennings added 14 points, and Jodie Meeks had 11 for Detroit. Andre Drummond had a game-high 19 rebounds for Detroit, which outrebounded the Mavericks 60-43.\nDallas' Dirk Nowitzki said,\n\"We have to all get in there and help Tyson (Chandler) out,\" Dallas' Dirk Nowitzki said. \"Tyson's been a stud on the boards, all year long, both ends of the floor.\"\nChandler had 15 of the Mavericks' 43 rebounds.\n\"We turned it over quite a bit and our shot-making wasn't great,\" Dallas coach Rick Carlisle said. \"When you can't mitigate a rebounding deficit with those two things in your favor, then it's going to be tough.\"\nNowitzki scored 19 points, while Monta Ellis had 16, Parsons 15 and Devin Harris 14.\n\"I give Detroit a lot of credit,\" Carlisle said. \"We just weren't good enough tonight. I just know that Detroit competed at a very high level, and we didn't match it.\"\nTIP-INS\nPistons: They were coming off a 105-104 victory Tuesday at San Antonio after trailing by 18 points in the second quarter. ... Detroit's most recent seven-game winning streak had come between Dec. 23, 2008, and Jan. 4, 2009. Five of the games in the current streak have been on the road.\nMavericks: They won the only other game between the teams this season, 117-106 at Detroit on Dec. 17. That was their sixth straight win over the Pistons. ... Dallas had won the previous 11 games against Eastern Conference opponents. ... The Mavericks had made 45 percent (43 for 95) of their 3-point attempts in the previous four games, but made just 27 percent (6 for 22) against Detroit. ... Dallas has been outrebounded in six of the last seven games.\nRENEWING THE RECORD\nThe Pistons have a five-game road winning streak for the first time since 2007-08. They hadn't won in San Antonio and Dallas in the same season since 1996-97.\nEach team was playing its third game in four nights.\nKEEPING UP WITH THE SMITHS\nOn Dec. 22, the Pistons waived Josh Smith, but Van Gundy indicated that the move wasn't connected with the hot streak.\n\"I had no problems with Josh at all,\" Van Gundy said. \"Josh worked hard. Josh's a 10-year vet. I wanted to give other people opportunities, and it was going to cut his time and take the ball out of his hands. I didn't really think it was fair (to him).\"\nUP NEXT\nPistons: Home vs. Atlanta on Friday.\nMavericks: At Los Angeles Clippers on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993790.4561112
}