{
  "game_id": "0022000572",
  "espn_id": "401307355",
  "date": "Mar 11, 2021",
  "matchup": "PHI @ CHI",
  "headline": "Harris scores 24, 76ers beat Bulls 127-105 without 2 stars",
  "body": "CHICAGO -- — Tobias Harris scored 24 points and the Philadelphia 76ers beat the Chicago Bulls 127-105 Thursday night even though they were missing stars Joel Embiid and Ben Simmons for contact tracing.\n\n\r\n                    With Harris and six other Sixers in double figures, the Eastern Conference leaders had more than enough to get by.\n\n\r\n                    “I don't know if it was the best (win) because I don't rate them, but definitely one of the big ones,” coach Doc Rivers said. “Heck, even at the All-Star break, listening to all the other guys, ‘Man, you guys are gonna be in trouble your first two.’ Well, we were not. And we played great.”\n\n\r\n                    Dwight Howard scored a season-high 18 and grabbed 12 rebounds, and Tony Bradley chipped in with a season-high 14 on 7-for-7 shooting. The 6-foot-10 center also got this shoutout on Twitter from Embiid during the game: “That’s it!!! I’ve seen enough. Build around Tony Bradley @sixers”.\n\n\r\n                    Furkan Korkmaz added 16 points, and the Sixers came out on top even though their stars were not available.\n\n\r\n                    “I think it shows how deep we are as a team, how connected we are,\" Howard said. “Missing our two best players, we still got the job done tonight. We believe in each other.”\n\n\r\n                    Embiid and Simmons both traveled to Atlanta for Sunday’s All-Star game, only to learn the night before they were flagged for contact tracing. Though neither player tested positive for COVID-19, the barber they visited before leaving did.\n\n\r\n                    Embiid, who scored a career-high 50 points and grabbed 17 rebounds in a win over the Bulls last month, is expected to return Friday at Washington. Simmons is to miss one more game.\n\n\r\n                    LISTLESS BULLS\n\n\r\n                    Lauri Markkanen, back from a sprained right shoulder, led Chicago with 23 points. The 7-footer from Finland made all seven 3-pointers in his first appearance since Feb. 5.\n\n\r\n                    All-Star Zach LaVine scored 19, and Coby White finished with 18 points. But coach Billy Donovan called it a “huge step backward\" for the Bulls.\n\n\r\n                    They were dominated in the paint 78-42 and committed 19 turnovers compared to just 11 for Philadelphia. It was just a listless effort overall.\n\n\r\n                    “We didn't deserve to win the game, and we didn't deserve to be in the game,\" Donovan said. “We just didn't. We didn't do anything that was of a high enough standard in terms of what winning requires. There was nothing. ... We didn't do anything well enough tonight to even think about deserving to want to win or be in a position to win.”\n\n\r\n                    PULLING AWAY\n\n\r\n                    Matisse Thybulle capped an 8-0 spurt with a 3-pointer to make it 84-69 with 5:43 left in the third quarter, and the 76ers remained in control the rest of the way.\n\n\r\n                    Milton hit a layup at the buzzer to start a 13-0 run, capped by a dunk by Howard's alley-oop dunk to make it 108-85 with 9:40 left in the game.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Rivers coached the team after missing practice the previous day because of an illness. ... Rivers said Embiid and Simmons have been working out on their own: “They feel great. I guess that's the most important thing.”\n\n\r\n                    Bulls: The Bulls were basically at full strength with Markkanen and Otto Porter Jr. available. Porter had three points in 18 minutes after being sidelined since Feb. 1 because of back spasms. “We just haven't been healthy for a good portion of the year,” Donovan said. “We haven't had the full complement of players, so it's good to have everybody back.” ... GM Marc Eversley was hired out of Philadelphia's front office last spring.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Visit Washington on Friday.\n\n\r\n                    Bulls: Host Miami on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997092.1036422
}