{
  "game_id": "0022000713",
  "espn_id": "401307502",
  "date": "Mar 29, 2021",
  "matchup": "OKC vs. DAL",
  "headline": "Doncic scores 25; Mavericks roll past Thunder 127-106",
  "body": "OKLAHOMA CITY -- — Luka Doncic scored 25 points to help the Dallas Mavericks roll past the Oklahoma City Thunder 127-106 on Monday night.\n\n\r\n                    The Mavericks outscored the Thunder by 13 in the second half to pull away. \n\n\r\n                    “Second half, I thought we played to our level and our capabilities against a team that’s undermanned, but very well coached, still skilled, hard playing, all those kinds of things,\" Dallas coach Rick Carlisle said. \"We were able to take care of business.”\n\n\r\n                    Doncic missed Dallas’ previous two games. He sat out Friday’s loss to Indiana with back soreness and Saturday’s loss to New Orleans with a non-COVID-19 illness.\n\n\r\n                    Kristaps Porzingis had 20 points and nine rebounds after missing the previous game with an injured right knee. He earned the team's defensive belt for helping to limit Oklahoma City's Moses Brown, a rising second-year player, to six points and nine rebounds.\n\n\r\n                    “I thought he was great,\" Carlisle said of Porzingis. \"I don’t like the word comfortable because I think you have to have a certain edge when you play in an NBA game, and I thought he had it tonight.”\n\n\r\n                    Tim Hardaway Jr. added 19 points for the Mavericks. Dallas shot 53% from the field and never trailed in snapping a two-game losing skid.\n\n\r\n                    “They’re an elite offense and obviously a really good team,” Thunder coach Mark Daigneault said. “I thought they played really well tonight. I thought they burned us for the mistakes we made. We’ve just got to learn the lessons from the game from an execution standpoint.”\n\n\r\n                    Aleksej Pokusevski led Oklahoma City with 21 points. Svi Mykhailiuk added 16 points in his first start for the Thunder since being traded from Detroit. Theo Maledon added 14 for the Thunder, who lost their third straight.\n\n\r\n                    Oklahoma City was down three starters -- Shai Gilgeous-Alexander (plantar fasciitis, right foot), Darius Bazley (left shoulder contusion) and Lu Dort (concussion).\n\n\r\n                    Dallas led 71-63 at halftime behind 16 points, seven rebounds and five assists from Porzingis. The Mavericks shot 55% before the break. \n\n\r\n                    Dallas closed the third quarter with a 12-4 run that pushed its lead to 100-83, and the Mavericks remained comfortably ahead the rest of the way.\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Center Willie Cauley-Stein sat out his sixth straight game because of health and safety protocols. ... Porzingis scored 12 points in the first quarter. \n\n\r\n                    Thunder: Center Tony Bradley played in his first game with the Thunder since being traded from Philadelphia. He had eight points and five rebounds in 14 minutes. ... Rookie Josh Hall scored a season-high 10 points. ... Shot 64% in the second quarter. ... Isaiah Roby had 12 points and nine rebounds.\n\n\r\n                    QUOTABLE\n\n\r\n                    Daigneault on the Thunder's weaknesses: “We’re not vulnerable with energy, we’re not vulnerable with competitiveness, we’re not vulnerable with team orientation. All of those things are tight with this group. That’s why it’s so enjoyable to coach this team. But where we are vulnerable is just in those details, and it shows up on both ends of the floor, and it takes time.”\n\n\r\n                    NICOLO MELLI\n\n\r\n                    Nicolo Melli played with the Mavericks for the first time since being traded from the New Orleans Pelicans. The 6-foot-9 big man had six points and three rebounds in 11 minutes.\n\n\r\n                    “Very impressed,” Carlisle said. “The thing I was uncertain about -- can he play both four and five positions? Can he guard some at the four position? I’ve seen him do it at the five. He played the four tonight very, very effectively.”\n\n\r\n                    STAT LINES\n\n\r\n                    Forward Dorian Finney-Smith had a +32 plus/minus score. He finished with 12 points on 5-for-8 shooting in 27 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Visit Boston on Wednesday.\n\n\r\n                    Thunder: Host Toronto on Wednesday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997083.062311
}