{
  "game_id": "0022101125",
  "espn_id": "401360944",
  "date": "Mar 28, 2022",
  "matchup": "MIA vs. SAC",
  "headline": "Heat snap 4-game losing streak by topping Kings, 123-100",
  "body": "MIAMI -- — The worst losing streak of Miami's season is over. Not only that, but the Heat returned to the top of the Eastern Conference.\n\n\r\n              And now a road trip with massive seeding implications awaits.\n\n\r\n              Jimmy Butler scored 27 points, Bam Adebayo added 22 points and 15 rebounds, and the Heat beat the Sacramento Kings 123-100 on Monday night to stop a four-game slide.\n\n\r\n              Tyler Herro had 20 for the Heat, who improved to 36-5 when scoring at least 110 points.\n\n\r\n              “Felt amazing to get back in the winning column,\" Herro said.\n\n\r\n              The Heat (48-28) are leading the East again, a game ahead of No. 2 Milwaukee and No. 3 Philadelphia (both 46-28, with the Bucks holding the tiebreaker edge there). Boston started the day No. 1 in the East; the Celtics (47-29) fell to fourth, percentage points behind the Bucks and 76ers after losing to Toronto.\n\n\r\n              “We got back to being who we are,\" Butler said.\n\n\r\n              Davion Mitchell scored 21 points for Sacramento, which got 17 from Harrison Barnes.\n\n\r\n              Miami's 23-point victory margin was its largest since a 24-point win at Atlanta on Jan. 12. And Miami looked exactly the way Kings coach Alvin Gentry expected — especially after the Heat had dropped their last four.\n\n\r\n              “I don’t read a whole lot into that,” Gentry said. “I think if you look at their team and the way they go out, they will be a huge factor when the playoffs start anyway. I think it’s a wakeup call.”\n\n\r\n              Sure looked like one. Sacramento scored the first six points, Miami scored the next nine and never trailed again.\n\n\r\n              Damian Jones had 15 points, Donte DiVincenzo 12 and Trey Lyles 11 for the Kings.\n\n\r\n              After spending most of March at home — the Heat have played 11 of their last 12 games in their own building — a three-game road swing starts Wednesday in Boston. It moves to Chicago on Saturday, then Toronto on Sunday for what will be a celebration of Kyle Lowry’s time with the Raptors and probably a game with significant seeding implications for both clubs.\n\n\r\n              “It’s always good to compete for something,” Heat coach Erik Spoelstra said. “It’s not the end-all, be-all. It’s a really competitive race in the East. This is what you always want. You want the games to have meaning and context and significance to them. That’s basically every game right now in the Eastern Conference. That makes it very compelling.”\n\n\r\n              Miami inserted Max Strus — celebrating his 26th birthday — into the lineup for Duncan Robinson. The move came with Robinson averaging 8.4 points on 32% shooting from 3-point range in his last seven games, one of several rough stretches he’s had this season.\n\n\r\n              “These are tough decisions,\" Spoelstra said.\n\n\r\n              But it worked wonders for Robinson. He had 15 points on 5-of-7 shooting from 3-point territory.\n\n\r\n              “Good to get back on track,\" Robinson said.\n\n\r\n              TIP-INS\n\n\r\n              Kings: Sacramento isn’t sure if De’Aaron Fox (sore right hand) and Domantas Sabonis (bruised left knee) will return this season. “They’re trying to get to the point where they can come back,” Gentry said. ... Sacramento went 10-20 vs. Eastern Conference teams this season. \n\n\r\n              Heat: Miami finished 18-12 against the Western Conference, its best mark since going 20-10 in 2013-14. ... The lineup shakeup led to Miami using its 19th different starting five this season. The Heat are 9-2 when Strus starts.\n\n\r\n              BEST (AND WORST)\n\n\r\n              Miami is 29-5 (.853) all-time at home against Sacramento, by far the best record the Heat have on their own floor against any opponent. The Kings franchise — including the Cincinnati and Kansas City days — struggles in Miami like nowhere else; its second-worst road record all-time comes on trips to Portland, where Kings teams have gone 19-90 (.174).\n\n\r\n              RESPECT\n\n\r\n              When Miami Hurricanes coach Jim Larrañaga was introduced and acknowledged cheers from his seat during a second quarter timeout, Spoelstra — who doesn’t always pay attention to what’s happening during stoppages in play — was among those who clapped and pointed his way. Larrañaga and the Hurricanes lost to Kansas in the Elite Eight on Sunday, ending the deepest NCAA Tournament run in school history.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit Houston on Wednesday.\n\n\r\n              Heat: Visit Boston on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992621.96334
}