{
  "game_id": "0021500697",
  "espn_id": "400828584",
  "date": "Jan 28, 2016",
  "matchup": "CHI @ LAL",
  "headline": "Bulls top Lakers 114-91 in Pau's last Staples date with Kobe",
  "body": "LOS ANGELES -- During seven seasons together with the Lakers, Pau Gasol and Kobe Bryant formed a bond that won't be broken by separation or retirement.\nWhen they played on the same court in Los Angeles for the final time, the Chicago Bulls won in a blowout that didn't mean a whole lot to two friends with memories of better days.\nJimmy Butler had 26 points and 10 assists, and the Bulls opened their longest road trip of the season with a 114-91 victory over the spiraling Lakers on Thursday night.\nGasol had 21 points, 12 rebounds and seven assists while facing Bryant for the last time at Staples Center. They hadn't played in the same game since the 7-foot Spaniard left the Lakers as a free agent in 2014, leaving behind a legacy of two NBA titles, three trips to the finals and countless incredible moments in LA.\n\n\"I just think of all the moments that we went through, and they kind of mix together,\" Gasol said. \"This building is extremely special. It's been my home for so long. I went through so much. Everything is just more intense in this city and with this team. I lived it very intensively.\"\nBryant scored 10 points on 4-for-13 shooting after sitting out the previous game for the Lakers, who lost their season-worst eighth straight game to drop to 9-39. Kobe hadn't been healthy enough to suit up against the Bulls since the 2012-13 season.\nBryant knows he had a special partnership with Gasol.\n\"It was his intelligence and his ability to communicate clearly,\" Bryant said. \"His ability to have extreme poise, his ability to put his arm around the guys, laugh at them, beat them up verbally, encourage them and bring them along. It's all those attributes. On top of that, he's just a great player.\"\nOnly the lopsided score likely prevented Gasol from dropping a triple-double on the Lakers after he was left off the Eastern Conference All-Star team earlier in the day.\n\"I didn't need any extra fire tonight,\" Gasol said. \"I wanted to play well. It's exciting for me to be back here on this floor. ... I don't need to prove myself at this point in my career. I think I'm still one of the elite players in this league, and I'll try to continue to be for as long as I can.\"\nJIMMY'S POINTS\nButler was similarly spectacular in his first game since his second All-Star selection. Butler made 11 of his 17 shots and adding five assists as Chicago opened its seven-game road trip with a laugher against the Western Conference's worst team.\nDoug McDermott added 15 points with three 3-pointers for the Bulls, who took an 18-point lead in the first quarter with a lengthy run that included three baskets and two steals in 29 seconds by Butler.\nLAKERS DOWN AGAIN\nJordan Clarkson scored 16 points and Nick Young had 14 for the Lakers, who played without starting guard Lou Williams due to a respiratory infection. Los Angeles has lost 12 of 13 since its only winning streak of the season.\nLOVING PAU\nThe crowd gave several loud ovations to Gasol, who got little love from many Lakers fans in his final years here. Bryant feels Gasol was scapegoated for the Lakers' failures to win another title, saying that \"the city of LA didn't appreciate what he did and what we had.\"\nALL-STAR TIMES TWO\nButler was grateful to learn of his second straight All-Star nod before the game. So what will be different about Butler's second All-Star weekend? \"I'll probably have more people with me this time,\" he said with a grin. \"I can probably afford it now.\"\nTIP-INS\nBulls: Derrick Rose added 16 points after sitting out the second half of the Bulls' loss to Miami on Monday with back and hamstring injuries. ... Bryant will bid farewell to Chicago and Gasol on Feb. 21.\nLakers: Tennis legend Jimmy Connors watched the game with Lakers executive Jeanie Buss. Connors played on the LA Strings, a World Team Tennis franchise run by Buss. ... Julius Randle took a hard fall under the basket in the second quarter, but got up gingerly. He finished with 14 points and eight rebounds.\nUP NEXT\nBulls: At Clippers on Sunday.\nLakers: At Clippers on Friday.",
  "source": "espn_api",
  "crawled_at": 1764993919.418956
}