{
  "game_id": "0022000127",
  "espn_id": "401267287",
  "date": "Jan 08, 2021",
  "matchup": "ORL @ HOU",
  "headline": "Wood scores 22 to lead Rockets to 132-90 rout of Orlando",
  "body": "HOUSTON -- — Christian Wood scored 22 points and tied a career high with 15 rebounds to lead the Houston Rockets to a 132-90 rout of the short-handed Orlando Magic on Friday night. \n\n\r\n                    Houston was up by 29 at halftime and had extended the lead to 81-43 after consecutive 3-pointers by John Wall and P.J. Tucker with about five minutes left in the third. \n\n\r\n                    “Obviously, they were very decimated... so we took advantage,\" Houston coach Stephen Silas said. “But we really played hard and it seems like our concepts are really sinking in more.\" \n\n\r\n                    The Magic looked nothing like the team that opened the season 6-2. Aaron Gordon sat out with a left hamstring injury in the team’s first game since guard Markelle Fultz sustained a season-ending knee injury in a win over Cleveland on Wednesday night. \n\n\r\n                    A disgusted coach Steve Clifford spoke for only about 30 seconds and left without taking any questions. But it was plenty long enough to get his point across.\n\n\r\n                    “This game had a lot more to do with a lack of readiness and a lack of professionalism and a lack of effort than it did talent,\" he said. \n\n\r\n                    He talked about the numerous mistakes his team made before punctuating his remarks with: “So that's your story, nothing else mattered,\" and leaving the podium. \n\n\r\n                    A 3-pointer by James Harden ended his night and left the Rockets ahead by 36 after three, and a 3 by Ben McLemore extended the lead to 103-63 with about nine minutes remaining.\n\n\r\n                    Houston’s starters didn’t play in the fourth quarter and Silas cleared the bench with about five minutes left and his team up 117-78. \n\n\r\n                    The Rockets had six players score at least 10 points on a night they made a season-high 22 3s to snap a two-game skid. \n\n\r\n                    Nikola Vucevic had 22 points and 12 rebounds for the Magic. Harden had 15 points and 13 assists, and Tucker added 15 points. \n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Clifford said Gordon would return on Saturday night. ... Orlando made just 8 of 29 3-pointers. \n\n\r\n                    Rockets: Danuel House missed his third straight game with back spasms. ... Houston had 34 assists.\n\n\r\n                    BEN IS BACK\n\n\r\n                    McLemore made his season debut on Friday after missing the beginning of the season in quarantine for COVID-19 reasons. He scored 15 points on 5-for-5 3-point shooting. Silas said he wasn't sure what to expect from McLemore, but is excited to see what he'll bring to the team this season after Friday's performance.\n\n\r\n                    “It just gives us a stone-cold shooter on the perimeter,\" Silas said. “As you can see from our previous games, we need that on the floor.\" \n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Visit Dallas on Saturday and return home to play the Bucks before embarking on a six-game road trip. \n\n\r\n                    Rockets: Host the Lakers on Sunday and Tuesday before going on the road for a pair of games against the Spurs. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997807.134051
}