{
  "game_id": "0021901316",
  "espn_id": "401224791",
  "date": "Aug 14, 2020",
  "matchup": "IND vs. MIA",
  "headline": "Heat's Derrick Jones Jr. injured in 109-92 loss to Pacers",
  "body": "LAKE BUENA VISTA, Fla. --  Doug McDermott scored 23 points and the Indiana Pacers beat Miami 109-92 on Friday in a game delayed for several minutes late in the third quarter when Heat forward Derrick Jones Jr. was carted off the court.\n\nJones was attempting to get around a screen when he collided with 6-foot-11 Indiana center Goga Bitadze and fell to the floor. Jones lay on his stomach with his right arm on the back of his head for several minutes before he was fitted for a neck brace and carted off the floor.\n\nThe Heat announced via Twitter on Friday night that Jones suffered a neck strain and had undergone an MRI, CT scan and concussion test. The Heat said Jones would be re-evaluated over the weekend.\n\nThe injury to the NBA's reigning slam dunk champion came on a day when both teams were trying to stay as healthy as possible for their upcoming first-round playoff matchup.\n\n\"That just takes the air out of the building,\" Heat coach Erik Spoelstra said. \"Even as competitors, you don't want it on either side. You just want to be able to get through this game and be able to have everybody available for the playoffs.\"\n\nThe Heat sat All-Stars Bam Adebayo and Jimmy Butler as well as Goran Dragic, Jae Crowder and Andre Iguodala. T.J. Warren, Domantas Sabonis, Victor Oladipo and Myles Turner didn't play for Indiana.\n\nSabonis, the Pacers' leading rebounder, hasn't played any games since the restart due to plantar fasciitis and is out indefinitely. Many of the other notable names who didn't play were simply getting some recovery time as they gear up for the postseason.\n\nMalcolm Brogdon had 16 points, six rebounds and six assists for the Pacers, who led nearly the entire way. Alize Johnson, a seldom-used 6-foot-9 forward, had 11 points and 17 rebounds to set career highs in both categories.\n\n\"He did what he always does,\" Pacers coach Nate McMillan said of Johnson's breakout performance. \"He's been in the G League a lot for us, but he has always been a guy that rebounds the ball. He plays a lot bigger than he is.\"\n\nAaron Holiday and Justin Holiday scored 11 points each. JaKarr Sampson added 10 points.\n\nKendrick Nunn scored 23 points, Solomon Hill added 21 and Tyler Herro had 16 for Miami.\n\nMiami and Indiana entered the day tied for fourth in the Eastern Conference at 44-28 records. In a typical season, this regular-season finale would have decided which team got home-court advantage in their first-round series that begins Tuesday.\n\nBut nobody has a home-court edge this year with the entire postseason taking place at Disney's Wide World of Sports, so nothing was really at stake Friday.\n\n\"Every time I get on that basketball court, I play to win,\" Justin Holiday said. \"That's just how I see it. That's the last game of the regular season. That's a game we're trying to win regardless of who's playing, who's out there or if we see this team again.\"\n\nTIP-INS\n\nHeat: Adebayo ended a string of 158 consecutive games played, the fourth-longest streak in Heat history. Glen Rice owns the team record after appearing in 174 straight games from March 1992 to April 1994. ... Udonis Haslem, the 40-year-old veteran of all three Heat championship teams, made his first start of the season. It was Haslem's 500th career start, but only his second over the last five seasons. The 17th-year pro also made just his fifth career 3-pointer. Haslem played 23 minutes Friday, exceeding his previous season total of 21.\n\nPacers: Aaron Holiday has made 33 starts this season and was available to play Friday, but McMillan chose to play him off the bench and gave the start to Edmond Sumner, who was making just his third start. \"I want to let Ed get some minutes,\" McMillan said before the game. \"I think it's important that some of these young guys we have in the rotation tonight get some good quality minutes because you just never know in the playoffs with injuries popping up. Everybody has to be ready to go.\"\n\nUP NEXT\n\nThe stakes will be much higher when the Heat and Pacers meet again Tuesday in the opening game of their best-of-7 series.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995824.6984692
}