{
  "game_id": "0022300915",
  "espn_id": "401585543",
  "date": "Mar 08, 2024",
  "matchup": "LAL vs. MIL",
  "headline": "D'Angelo Russell scores 44 points in LeBron-less Lakers' stunning 123-122 win over Bucks",
  "body": "LOS ANGELES -- — D'Angelo Russell scored 21 of his season-high 44 points in the fourth quarter and hit a go-ahead jumper with 5.9 seconds to play, and the Los Angeles Lakers overcame LeBron James' injury absence for a 123-122 victory over the Milwaukee Bucks on Friday night.\n\n\r\n              Spencer Dinwiddie blocked Damian Lillard's step-back jumper right before the buzzer to preserve a stirring win for the Lakers while James sat out to rest his sore left ankle, missing his ninth game of the season overall due to the persistent injury.\n\n\r\n              Los Angeles was carried by Russell, who tied his career high with nine 3-pointers while also handing out nine assists in a spectacular performance. He scored eight points in the final 1:13 while the Lakers rallied from a late deficit and improved to 5-4 without James.\n\n\r\n              “D-Lo just stepped up and won us the game, and obviously with Spence with the defense on that last possession,” said Austin Reaves, who scored 18 points for the Lakers. “Just seeing D-Lo take over the game, I constantly kept telling him in timeouts, ‘Take us home.’”\n\n\r\n              Russell again raised his offensive output when forced to play without James or Davis, shooting confidently while also distributing the ball effectively on offense. Russell was nearly as nonchalant afterward about his biggest game of the season, but he acknowledged that an NBA career including four trades and annual trade rumors swirling around him has honed his focus for tough situations.\n\n\r\n              “On the floor, I've always felt like I was capable of doing things, (and) getting hot makes it a little more exciting,” Russell said. “Off the floor, obviously you all know what I've been through. Public humiliation has done nothing but mold me into the killer that you all see today. I never lack confidence. I never fear confrontation. I want all the smoke. ... I just feel confident in what I bring to the basketball game, so whatever room I walk in, I'm confident.”\n\n\r\n              Giannis Antetokounmpo had 34 points, 14 rebounds and 12 assists for Milwaukee. Lillard scored eight of his 28 points in the fourth quarter, but the Bucks couldn't hang on in their second consecutive loss.\n\n\r\n              “It is a missed opportunity, but if we had won, that doesn’t change anything,” Milwaukee coach Doc Rivers said. “We’re trying to go and get better. I thought we had the game in our hands, and we let it go. That happens, and it’ll happen again, and we’ll win some the other way, too.”\n\n\r\n              Milwaukee took its first lead since early in the second quarter on Antetokounmpo’s jumper with 2:53 to play. Lillard converted a four-point play two possessions later, but Russell trimmed the Bucks' lead to one point on a three-point play with 39 seconds left.\n\n\r\n              Lillard missed a tough layup to give the Lakers a chance, and Russell hit a leaning 13-footer with 5.9 seconds to play. Dinwiddie, who was making his first start for his hometown Lakers, then smothered Lillard's final shot.\n\n\r\n              Rivers cited the Bucks' fourth-quarter performance as reason for optimism, even if his team didn't finish.\n\n\r\n              “You want to win all these games, but that’s the stuff that we’re going to keep doing more and more until it becomes us,” Rivers said. “There was a stretch where Damian and Giannis were playing a two-man game, and it was unstoppable. We want to encourage that more and more.”\n\n\r\n              Antetokounmpo had his 43rd career triple-double, his eighth of the season and his first since Jan. 24. Pat Connaughton scored a season-high 17 points and hit a key 3-pointer down the stretch.\n\n\r\n              Anthony Davis had 22 points — just two in the fourth quarter while playing with a left shoulder injury — and 13 rebounds for the Lakers, who have won 11 of 15 as they fight to gain any ground in the competitive Western Conference.\n\n\r\n              Davis said he couldn't move his shoulder after attempting to take a charge from Antetokounmpo. He will be evaluated Saturday.\n\n\r\n              James hobbled off the court with four minutes left in the Lakers’ loss to Sacramento on Wednesday night with the latest flare-up of an ankle injury that has bothered the leading scorer in NBA history throughout his 21st season.\n\n\r\n              Before the game, Rivers said Khris Middleton is “close” to returning from the sprained left ankle that has sidelined him for 13 games since Feb. 6.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Los Angeles Clippers on Sunday.\n\n\r\n              Lakers: Host Minnesota on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995493.877075
}