{
  "game_id": "0021900674",
  "espn_id": "401161316",
  "date": "Jan 24, 2020",
  "matchup": "SAC @ CHI",
  "headline": "Hield scores 21, Kings beat Bulls 98-81 to snap 6-game skid",
  "body": "CHICAGO --  After being pulled from the starting lineup, Buddy Hield proved his value to the Sacramento Kings.\n\nHield scored 21 points, Harrison Barnes added 19 and Sacramento beat the Chicago Bulls 98-81 on Friday night to snap a six-game losing streak.\n\nIn 23 minutes off the bench, Hield was 7 for 12 from the field -- including 5 of 9 on 3-pointers.\n\n\"I've got to give Buddy a lot of love,\" Kings coach Luke Walton said. \"What he did throughout the game, that third quarter when they went on a run, he really kept us in it.\n\n\"For him to be all about the team after we took him out of the starting lineup shows a lot, says a lot about him.\"\n\nEven though Walton tried to make it clear the move wasn't intended to punish the team's leading scorer, Hield acknowledged it was a challenge to view it that way.\n\n\"Of course, as a competitor you want to figure out what's the reason for that,\" he said. \"You never get a straight, clear-cut answer. But as a player, as a professional, you have to go in there, lock in and just do it.\n\n\"When he calls your number, just produce. That's all you can do.\"\n\nDe'Aaron Fox had 18 points, seven assists and six rebounds as the Kings led virtually wire-to-wire.\n\nZach LaVine scored 21 for the Bulls, who had won four of seven. Chicago was 8 for 37 (21.6%) on 3-pointers.\n\nThe Bulls played without forward Lauri Markkanen, who will miss four to six weeks with a right hip injury. The 7-footer from Finland had an MRI on Thursday after experiencing soreness for about a week. He had played in all 46 games this season before Friday, averaging 15 points and 6.5 rebounds.\n\nWithout Markkanen on the court, LaVine was more of a focus for the defense.\n\n\"I had to adjust going into the third quarter, but in the first quarter it seemed like I would drive and there would be somebody in the middle, so you swing it,\" said LaVine, who was 8 for 21 from the field. \"I still think I missed some easy ones. I'm used to it.\"\n\nThe Kings used a run of 11 straight points in the second quarter to snap a 33-all tie and take a 54-44 halftime lead.\n\nChicago opened the second half with a 12-2 run to tie the score at 56. Later in the third quarter, Denzel Valentine hit a runner in the lane to put the Bulls on top 69-68 -- their first lead of the game.\n\nThe Kings, though, scored the final seven points of the period (two layups by Fox and a 3-pointer by Hield) to take a 75-69 edge into the fourth.\n\nSacramento's lead was back up to 85-73 -- matching its biggest to that point -- on a basket by Bogdan Bogdanovic with seven minutes remaining. After taking the lead in the third, Chicago managed just four points in the next seven-plus minutes.\n\nBogdanovic put the game away with a five-point possession for a 92-75 lead with 4 1/2 minutes to go. First, he hit a pair of free throws after LaVine and Bulls coach Jim Boylen were assessed technical fouls. Bogdanovic then hit a 3-pointer.\n\nTIP-INS\n\nKings: Hield had started the first 44 games of the season. Bogdanovic started in Hield's place and had 12 points in 26 minutes.\n\nBulls: Markkanen joins a growing list of frontcourt players on the sidelines. Otto Porter Jr. (broken left foot) has been out since early November, Wendell Carter Jr. (sprained right ankle) likely will be out another month and rookie Daniel Gafford has missed the last five games with a dislocated right thumb. \"When it rains it pours, with all of our big men going down,\" said Thaddeus Young, who started in place of Markkanen at power forward.\n\nREJECTED\n\nThe highlight of the first half was a sensational, above-the-rim block by Sacramento's Harry Giles III on a dunk attempt by Shaquille Harrison. \"For me, it was just go and meet him with some force,\" Giles said.\n\nPLAYING IT SAFE\n\nMarkkanen said he had no doubt he could play through the pain at its current level, but understood that doing so could make the injury -- diagnosed as an early stress reaction -- worse. \"I really wanted to play, but at the same time I had to take a step back and think about what was smart,\" he said.\n\nUP NEXT\n\nKings: At Minnesota on Monday night.\n\nBulls: At Cleveland on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996399.633774
}