{
  "game_id": "0022100852",
  "espn_id": "401360671",
  "date": "Feb 12, 2022",
  "matchup": "CHI vs. OKC",
  "headline": "DeRozan scores 38, Vucevic dominates as Bulls beat Thunder",
  "body": "CHICAGO -- — It wasn't like the Chicago Bulls asked DeMar DeRozan to deliver yet another dominant performance. Then again, requests aren't needed.\n\n\r\n              DeRozan scored 38 points, Nikola Vucevic added 31 points and 15 rebounds, and the Chicago Bulls overcame a sluggish start to beat the Oklahoma City Thunder 106-101 on Saturday night.\n\n\r\n              Tied with Cleveland for second place in the Eastern Conference coming in, the Bulls turned things around after falling behind by 14 points in the second quarter. They made enough baskets down the stretch to come away with their third straight win. And their head-faking, midrange shot making star once again led the way.\n\n\r\n              “I give him a lot of credit because he works hard, he takes care of himself, he comes ready, he's incredibly professional,” said Bulls coach Billy Donovan, who had some pretty good ones like Kevin Durant, Paul George and Carmelo Anthony in Oklahoma City. “He’s as good a scorer as I’ve been around.”\n\n\r\n              DeRozan set a career high with his sixth straight 30-point game. The All-Star scored nine over the final five minutes.\n\n\r\n              “My sole purpose of playing the way I play is just to win,” DeRozan said after his fifth game in a row with at least 35 points. “And whatever accomplishments come with that, they just come with it.”\n\n\r\n              Vucevic made 14 of 25 shots, though he also committed six turnovers. He had five in the first half before finding his rhythm in the third, when he scored 15.\n\n\r\n              Coby White scored 16 and made four 3-pointers. He also grabbed a season-high nine rebounds, helping the Bulls pull out the win, even though Zach LaVine missed the game because of a sore left knee. The All-Star struggled in Friday’s win over Minnesota, and his status for the two remaining games before the All-Star break is in question.\n\n\r\n              Lu Dort led Oklahoma City with 31 points. Rookie Josh Giddey added 11 points, 12 rebounds and 10 assists for his second triple-double. Darius Bazley scored 17 as the Thunder lost their fifth straight.\n\n\r\n              “I don’t like the excuse that we’re young, inexperienced,” Bazley said. \"I really don’t care. ... I’m just frustrated that we lost. We had the game in a grip, and I thought we could have won it.”\n\n\r\n              PULLING AHEAD\n\n\r\n              The Thunder led 90-89 when Chicago went on an 8-0 run to grab the lead for good.\n\n\r\n              White got the decisive rally started when he nailed a 3 to put the Bulls on top with 5:36 remaining, and a cutting Vucevic punctuated it when he dunked to make it 97-90 with 3:19 left.\n\n\r\n              The Thunder were within four when White hit a 3-pointer to bump the lead to 104-97 with 1:10 remaining, and the Bulls hung on from there.\n\n\r\n              QUOTABLE\n\n\r\n              “Nobody can stop him. Everybody I know on the opposite team I'm cool with, they just seem for some odd reason to be matched up with him. I'm gonna let you know how bad of a night you're gonna have guarding him. I'm gonna talk my trash for him.” — Bulls F Derrick Jones Jr. on DeRozan.\n\n\r\n               TIP-INS\n\n\r\n              Thunder: G Aaron Wiggins played 19 minutes after missing the previous five games because of a sprained right ankle. ... The Thunder held out C Derrick Favors after the veteran played 28 minutes against Philadelphia on Friday.\n\n\r\n              Bulls: DeRozan made 14 of 16 free throws. He also had six rebounds and five assists. ... Donovan said it’ll be up to LaVine and the team’s medical staff to decide if he will participate in the All-Star festivities in Cleveland next weekend. Donovan also said the back issue LaVine has dealt with in recent weeks is “pretty good” and “kinda resolved, under control.” ... Jones played 23 minutes in his return from a broken right index finger. He had not played since he bruised his right knee against Brooklyn on Jan. 12. He broke his finger on his non-shooting hand two weeks later working out at the practice facility, and the team expected him to miss another six to eight weeks. “The healing process is gonna be six to eight weeks,\" Donovan said. “But him playing was really gonna be on how much discomfort he had to deal with and whether or not he could play with that discomfort.” ... F Javonte Green (sore right foot) missed the game. \n\n\r\n              UP NEXT\n\n\r\n              Thunder: Visit New York on Monday.\n\n\r\n              Bulls: Host San Antonio on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992947.6464362
}