{
  "game_id": "0022401045",
  "espn_id": "401705611",
  "date": "Mar 25, 2025",
  "matchup": "CHA vs. ORL",
  "headline": "Paolo Banchero scores 32 points to lead Magic to 111-104 win over Hornets",
  "body": "CHARLOTTE, N.C. -- — Paolo Banchero scored 32 points, Franz Wagner had 26 points and the Orlando used a late run for a 111-104 win over the Charlotte Hornets on Tuesday night.\n\n\r\n              LaMelo Ball led the Hornets with 25 points and nine assists, while Josh Green and Nick Smith Jr. had 13 points each.\n\n\r\n              Orlando’s Wendell Carter Jr. had a game-high 11 rebounds. Banchero also had seven rebounds and six assists.\n\n\r\n              Takeaways\r\n              Magic: Banchero scored at least 30 points for the fourth straight game. His surge has helped the Magic win five of seven. Orlando swept Charlotte in their four meetings this season.\n\n\r\n              Hornets: Another strong statistical game for Ball still ended with a loss for Charlotte, already eliminated from playoff contention. He made 9 of 13 shots and had nine assists, but that didn’t stop the Hornets from losing for the fifth time in six games.\n\n\r\n              Key moment\r\n              The Magic ended the game on a 7-0 run. After Smith tied it at 104-all with 2:18 to play, Black’s dunk with 1:58 remaining broke the tie and put the Magic ahead for good. Wagner then hit 5 of 6 free throws down the stretch. He was 9 for 10 from the line overall.\n\n\r\n              Key stat\r\n              The Magic committed just eight turnovers and shot 31% from 3-point range.\n\n\r\n              Up next\r\n              The Magic return home to take on the Dallas Mavericks on Thursday night. The Hornets play at the Toronto Raptors on Friday night.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997426.299267
}