{
  "game_id": "0022401093",
  "espn_id": "401705659",
  "date": "Mar 31, 2025",
  "matchup": "MEM vs. BOS",
  "headline": "Celtics beat Grizzlies 117-103 and complete the first 6-0 trip in franchise history",
  "body": "MEMPHIS, Tenn. -- — Jayson Tatum had 25 points and 14 rebounds, Al Horford scored 26 points and the Boston Celtics swept a six-game road trip for the first time in franchise history with a 117-103 win over the Memphis Grizzlies on Monday night.\n\n\r\n              Victories at Utah, Portland, Sacramento, Phoenix, San Antonio and Memphis eclipsed the previous road win streak of five in February 1973. The run also helped Boston tie a franchise record with 32 road wins, accomplished in 1972-73 and 1974-75) and trailing Chicago (33, 1995-96) and Golden State (34, 2015-16).\n\n\r\n              Kristaps Porzingis added 19 points as Boston won its ninth straight and closed out a 13-1 March.\n\n\r\n              Ja Morant scored 26 points, Santi Aldama 21 and Jaren Jackson Jr. added 20 points and 15 rebounds as the Grizzlies closed within seven points with three minutes left, but couldn't complete the comeback in losing for the sixth time in seven games.\n\n\r\n              The Celtics were without Jaylen Brown (right knee impingement) and Luke Kornet (ill).\n\n\r\n              The last two quarters were played with two officials after Matt Kallio did not return for the second half. The NBA said Kallio stayed in the locker room with an apparent injury.\n\n\r\n              Takeaways\r\n              Celtics: Boston is comfortably in second place in the East and the winning streak has solidified that position. \n\n\r\n              Grizzlies: Interim coach Tuomas Iisalo is looking for his first win after two games as Memphis (44-31) is getting dangerously close to the play-in game.\n\n\r\n              Key moment\r\n              With Memphis still within single digits, Boston opened the final frame shooting 4 of 6 from long distance and built its biggest lead midway through the fourth.\n\n\r\n              Key stat\r\n              Memphis was shooting 50% from 3-point distance midway through the second quarter when it built an 11-point lead. But the Grizzlies missed their last six 3-pointers in the half.\n\n\r\n              Up next\r\n              Boston hosts Miami on Wednesday. Memphis hosts Golden State on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997590.728895
}