{
  "game_id": "0021901233",
  "espn_id": "401224688",
  "date": "Jul 31, 2020",
  "matchup": "BKN vs. ORL",
  "headline": "Magic beat Nets 128-118 in restart opener, move up to 7th",
  "body": "LAKE BUENA VISTA, Fla. --  Evan Fournier scored 24 points, Nikola Vucevic had 22 and the Orlando Magic picked up where they left off before the NBA season was suspended, routing the Brooklyn Nets 128-118 on Friday in their first game of the restart.\n\nPlaying as the designated road team not far from their arena, the Magic looked right at home at Disney -- whose name they wear as their jersey patch. They extended their winning streak to four and moved back ahead of the Nets into seventh place in the Eastern Conference.\n\nThe Magic outscored the Nets 75-43 in the middle two quarters, allowing them to overcome some shaky defense at the start and finish.\n\n\"We've proven that we can play well at both ends of the floor. It's been a struggle for us to put both together and in the second and third quarter tonight that's what we did,\" Magic coach Steve Clifford said.\n\nPlayers and coaches from both teams knelt during the national anthem except for Orlando's Jonathan Isaac, who also was the only player not wearing a Black Lives Matter warmup shirt. Isaac, who was playing his first game since a left knee injury on Jan. 1, stood with his arms behind his back while wearing his regular jersey.\n\nClifford said Isaac discussed his decision with the Magic and was supported by his teammates.\n\nBrooklyn also won its last three before the stoppage, but the decimated team that returned is a shell of the one that beat the Lakers in Los Angeles in its final game.\n\nThe Nets are missing Spencer Dinwiddie, DeAndre Jordan and Taurean Prince after they tested positive for the coronavirus. They are already playing without Kevin Durant and Kyrie Irving, who had season-ending surgery.\n\nSo Brooklyn started two players who hadn't started an NBA game this season -- one who never had. The Nets looked good at the beginning, shooting nearly 70% in the first quarter, but the Magic blew by them in winning for the third time in three meetings this season.\n\n\"We wanted to come in and dictate the pace. If you look at the first couple of the minutes of the game that's how we really wanted to play and after that they just started to dictate it,\" said Brooklyn center Jarrett Allen, who was 5 for 5 for 10 points in the first quarter but had just four more.\n\nOrlando led by as much as 30 before the Nets had a late flurry that forced the Magic to put starters back in for the closing minutes.\n\n\"I thought it was a good response from us,\" Vucevic said. \"We didn't panic, we took our time and we did a good job also on the offensive end playing smart and making sure to take what the defense gives us.\"\n\nTimothe Luwawu-Cabarrot scored 24 points for the Nets and Caris LeVert had 17. Brooklyn lost for the first time in three games since Jacque Vaughn replaced Kenny Atkinson as coach on March 7.\n\nTIP-INS\n\nMagic: Isaac finished with 16 points on 6-for-7 shooting. ... Orlando's 36 points were a season high for a first quarter.\n\nNets: Chris Chiozza made his first career start at point guard. Veteran Lance Thomas, cut in the preseason, made his first start of the season. ... Veteran Jamal Crawford, signed as a substitute player after not playing in the NBA this season, did not play. ... Vaughn played for the Magic and coached them from 2012-15.\n\nCONTAINING CARIS\n\nLeVert averaged 27.4 points in five games in March, with a 50-point game and a triple-double. But the Magic keyed in on him and limited the guard to 7-for-17 shooting, including 0 for 4 from 3-point range.\n\nUP NEXT\n\nMagic: Play Sacramento on Sunday.\n\nNets: Play Washington on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996700.680442
}