{
  "game_id": "401810006",
  "espn_id": "401810006",
  "date": "Nov 02, 2025",
  "matchup": "CLE vs ATL",
  "headline": "Donovan Mitchell scores 37 points as Cavaliers down Young-less Hawks 117-109",
  "body": "CLEVELAND -- — Donovan Mitchell made eight 3-pointers and scored a season-high 37 points in his return to Cleveland's lineup, leading the Cavaliers to a 117-109 win on Sunday night over the Atlanta Hawks, who are navigating the early season without injured star guard Trae Young.\n\n\r\n              Mitchell was back after missing Friday's home loss to Toronto with hamstring tightness.\n\n\r\n              The six-time All-Star finished 8 of 15 from long range. He scored 24 points in the second half. It was Mitchell's 200th game with the Cavs, who are 139-61 when he's on the floor.\n\n\r\n              Jalen Tyson dropped a career-best five 3s and scored 18 points for Cleveland. De'Andre Hunter also had 18, and Evan Mobley finished with 14.\n\n\r\n              Jalen Johnson had 23 points and 13 rebounds for the Hawks. Kristaps Porzingis added 15 points and 12 boards.\n\n\r\n              Atlanta will be without Young for at least one month after he sprained his right medial collateral ligament on Wednesday at Brooklyn.\n\n\r\n              Coach Quin Snyder expressed relief that Young's injury was not more serious. The team said the 27-year-old will be reevaluated in about four weeks.\n\n\r\n              Cleveland also was short-handed, playing without starting center Jarrett Allen (broken finger) and guard Sam Merrill (bruised hip). Guards Darius Garland (toe surgery) and Max Strus (foot surgery) haven't played this season.\n\n\r\n              The Cavs were in control for most of the fourth quarter, but couldn't shake the Hawks, who were playing their fourth straight road game. Atlanta was still within 106-100 when Mobley, who went just 6 of 16 from the field, drained a 3-pointer with 1:24 left.\n\n\r\n              After a bucket by Porzingis, Tyson knocked down a 3-pointer from the corner to put the Cavs ahead by 10. They closed it out by making their free throws in the final minute.\n\n\r\n              Up next\r\n              Hawks: Host the Orlando Magic on Tuesday.\n\n\r\n              Cavaliers: Host the Philadelphia 76ers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042546.477797
}