{
  "game_id": "0021600866",
  "espn_id": "400900272",
  "date": "Feb 25, 2017",
  "matchup": "CHA @ SAC",
  "headline": "Kaminsky scores 23, Hornets end five-game losing streak",
  "body": "SACRAMENTO, Calif. --  Frank Kaminsky is getting his shot at center in the absence of teammate Cody Zeller, and he's become a bright spot for the struggling Charlotte Hornets.\n\nKaminsky had 23 points and 13 rebounds to help the Hornets beat the Sacramento Kings 99-85 on Saturday to end a five-game losing streak.\n\nWith the injured Zeller playing just once since Jan. 25 and backup Miles Plumlee also injured, Kaminsky has become the man in the middle after playing mostly power forward since entering the NBA last season.\n\nAgainst the Kings, Kaminsky was instrumental at both ends of the court.\n\n\"It's all about confidence. When it's high, you feel like you can do anything,\" Kaminsky said. \"I'm playing right now the way I've felt I can play. I've always been confident playing center.\"\n\nThe Hornets went ahead late in the first quarter and led the rest of the way for their second win in 14 games. The Kings never got going offensively, and Charlotte led by 23 points in the second half while ending their 12-game road skid.\n\nMarvin Williams scored 16 points and Nicolas Batum had 15 for the Hornets, who had squandered fourth-quarter leads in losing their three previous games.\n\n\"It's been disappointing. But we've still got a lot of guys in this locker room who want to win,\" Marvin Williams said. \"We have the right attitude and we're confident we can turn this thing around.\"\n\nBen McLemore led the Kings with 18 points and Buddy Hield had 15 in his second game since being acquired from New Orleans in a trade for DeMarcus Cousins. Anthony Tolliver and Tyreke Evans had 11 points each.\n\nSacramento had won five of its previous six games but trails eighth-place Denver by 1 1/2 games.\n\nIt's been a miserable past seven weeks for Charlotte, which had a 19-14 record on Dec. 29 after beating Miami. The Hornets went into a tailspin, losing 19 of 24 before defeating the Kings.\n\nKaminsky had been a bright spot of late, averaging 19.9 points in the last five games. Frequently left alone on the perimeter, Kaminsky made five 3-pointers and hit 9 of 18 shots overall.\n\n\"It's hard when you're playing a shooting big like that. You're trying to contain Kemba Walker, (Nicolas) Batum, you're trying to help your guard, and you've got a guy who is a flamethrower,\" Willie Cauley-Stein said about guarding Kaminsky.\n\nThe Kings were seeking their first five-game winning streak at home since the 2007. Sacramento shot 39 percent and were outscored 28-18 in the third quarter when Charlotte built a 79-58 lead.\n\nAfter a 16-point victory over Denver in their first game without Cousins, the Kings looked listless against the Hornets. The Kings missed their first six shots of the second half as Charlotte ran off 12 straight points for a 63-40 lead.\n\n\"We spent a lot of emotions on the game on the other night,\" Kings coach Dave Joerger said. \"Tonight was a situation where you got a veteran team, a physical team, and they pushed us around the court.\"\n\nTIPS-INS\n\nHornets: Charlotte scored the first 12 points of the game, only to have the Kings counter with a 15-point run. ... The seven-game road trip, their longest of the season, ends March 4 in Denver. ... Marco Belinelli had 13 points and Kemba Walker had 12.\n\nKings: Evans, who played four seasons in Sacramento, got his first start as a King since April of 2013. He was traded to New Orleans in the offseason. ... The bench had a season-high 72 points against Denver, but had 29 against the Hornets. ... Cauley-Stein had two points after getting a career-high 29 against Denver.\n\nUP NEXT\n\nHornets: The difficult road trip continues Sunday against the Los Angeles Clippers.\n\nKings: Minnesota comes to town Monday looking to gain ground on the Kings in the playoff hunt.",
  "source": "espn_api",
  "crawled_at": 1764995484.809789
}