{
  "game_id": "0022300636",
  "espn_id": "401585264",
  "date": "Jan 26, 2024",
  "matchup": "PHX @ IND",
  "headline": "Pacers rally to spoil Devin Booker's 62-point night, stun Suns 133-131",
  "body": "INDIANAPOLIS -- — The Indiana Pacers weathered Devin Booker's early scoring flurry Friday night. Then they stormed back late and stunned the Phoenix Suns.\n\n\r\n              Obi Toppin broke a tie with a putback with 3.4 seconds left, capping a 17-point comeback with a 133-131 victory and spoiling Booker's 62-point masterpiece.\n\n\r\n              “Great player,” Toppin said after finishing with 23 points and 11 rebounds when asked about Booker. “But that fourth quarter, we decided to hit and send another defender to get the ball out of his hands and just scramble out of that. They didn’t like it at all. I think it was their worst quarter.”\n\n\r\n              The adjustment certainly made a difference as the Suns managed just 17 points in the final 12 minutes after stringing together quarters of 40, 40 and 34 points.\n\n\r\n              Still, Booker broke his own Phoenix record for points in a quarter with 29 in the first and had a chance to win it at the buzzer. But he slipped on the inbounds pass and wasn't close with a contested 3-pointer. The Suns had won seven straight.\n\n\r\n              Booker had 50 or more points for the second time this season and seventh time in his career. He had a career-high 70 at Boston in March 2017. On Jan. 19, he had 52 at New Orleans. It just wasn't enough.\n\n\r\n              It's the first time since 1977-78 multiple players have scored 60 points in a loss. Minnesota's Karl-Anthony Towns had 62 in a loss Monday. George Gervin (63) and David Thompson (73) are the only other duo to suffer the same fate.\n\n\r\n              “Those are the shots I’ve been taking all season,” Booker said. “We’ve got some things to figure out, especially on the defensive end.”\n\n\r\n              The Suns extended the franchise record for consecutive games with 40-point scorers to five. Kevin Durant had 20 points, seven rebounds and six assists.\n\n\r\n              For the Pacers, it was a monumental 24-hour stretch.\n\n\r\n              Pascal Siakam scored 31 points as Indiana won for the second time in two nights — against Philadelphia and Phoenix — despite being without injured All-Star guard Tyrese Haliburton both games. \n\n\r\n              And this time, with Booker heating up, it looked as if Suns would run away.\n\n\r\n              But the NBA's highest-scoring team fought back from a 54-37 second-quarter deficit to close within 80-70 at halftime and then methodically spent the second half chipping away.\n\n\r\n              They finally cut the deficit to 129-127 when Andrew Nembhard scored on a short step-back jumper with 1:59 to go. Nembhard tied it with baskets on the next two possessions. Nembhard had 22 points and six assists.\n\n\r\n              Durant then missed a 3 and after the Pacers missed two on their final possession shots, Toppin grabbed the rebound and made the basket on what might have been the easiest play in a physical, frenetic and defensively challenging game for both teams.\n\n\r\n              “We needed points so our objective was just to get involved, crash the boards,” Toppin said. “I saw Bennedict (Mathurin) try to finish over someone and then Pascal was right in front of me, so I just grabbed the ball and put it in.”\n\n\r\n              Suns guard Bradley Beal left in the third quarter after drawing an offensive foul on Pacers center Myles Turner. Beal took a a shot to the nose and was helped immediately to the locker room. He returned early in the fourth quarter, with cotton stuffed up his nostrils.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Orlando on Sunday night.\n\n\r\n              Pacers: Host Memphis on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996654.813427
}