{
  "game_id": "401809988",
  "espn_id": "401809988",
  "date": "Oct 29, 2025",
  "matchup": "DAL vs IND",
  "headline": "Reserves Williams, Powell lead Mavericks past Pacers 107-105 in matchup of injury-depleted teams",
  "body": "DALLAS -- — Brandon Williams scored 20 and Dwight Powell scored 18 points as the Dallas Mavericks beat the Indiana Pacers 107-105 on Wednesday night in a matchup of injured-depleted teams.\n\n\r\n              Indiana had a chance to win when Aaron Nesmith grabbed an offensive rebound after RayJ Dennis intentionally missed a second free throw with 3.4 seconds left, but Nesmith’s desperation 3-pointer missed.\n\n\r\n              Dallas’ bench contributed a season-high 64 points as the Mavericks (2-3) completed a season-opening five-game homestand, the longest since a five-gamer by the 1983-84 Kansas City Kings.\n\n\r\n              The Mavericks’ Cooper Flagg, the No. 1 pick in last summer’s NBA draft, had his second double-double with 15 points (most among Dallas starters) and 10 rebounds.\n\n\r\n              Pascal Siakam had 27 points and 13 rebounds and Jarace Walker scored a career-high 20 points for the Pacers, who are 0-4 for the first time since they opened the 1988-89 season with nine losses.\n\n\r\n              Dallas’ Anthony Davis left late in the first quarter with lower left-leg soreness and didn’t return. Davis was listed as available in the pregame injury report with bilateral Achilles tendinopathy. Coach Jason Kidd said Davis tried to return but the team didn't want to take any chances and will see how he feels going forward.\n\n\r\n              Davis was making his second straight start at center instead of power forward with Dereck Lively II missing his second consecutive game with a knee sprain.\n\n\r\n              The Mavericks rallied from a 14-point deficit late in the half to take control with a 29-19 third period and led by as many as 12 points.\n\n\r\n              The Pacers finished a season-low 34.9% from the floor. They played without five of the regulars who helped them reach last season’s NBA Finals with Obi Toppin and Bennedict Mathurin added this week to a lengthy injury list.\n\n\r\n              Williams scored his first points this season after being unavailable for Dallas’ previous two games after being arrested Saturday at DFW Airport on a charge of marijuana possession.\n\n\r\n              Powell, a 12th-year Maverick relegated to a minor role in recent seasons after being Dallas' primary center, was serenaded with chants of “MVP! MVP!” while taking free throws down the stretch.\n\n\r\n              Up next\r\n              The Pacers will begin a four-game homestand on Friday against Atlanta.\n\n\r\n              The Mavericks will play away from Dallas for the first time this season on Friday, facing Detroit in Mexico City.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042525.534613
}