{
  "game_id": "0022200533",
  "espn_id": "401468688",
  "date": "Dec 30, 2022",
  "matchup": "MIL vs. MIN",
  "headline": "Antetokounmpo has 43 and 20, Bucks snap 4-game skid",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 43 points and 20 rebounds and the Milwaukee Bucks snapped a four-game losing streak with a 123-114 victory over the Minnesota Timberwolves on Friday night.\n\n\r\n              Antetokounmpo finished two points off his season high and also had five assists to join Wilt Chamberlain and Elgin Baylor as the only players in NBA history with back-to-back games of at least 40 points, 20 rebounds and five assists. Chamberlain did it five times and Baylor once, with Chamberlain the last to do it Jan. 6-7, 1966.\n\n\r\n              “It's a great compliment to be around those guys,” said Antetokounmpo, who has topped 40 points in four of the last six games. “I just want to win games so I just tried to go out there and do whatever I can to push myself to the limit.”\n\n\r\n              Bobby Portis added 22 points and 14 rebounds for Milwaukee, with 11 points coming in the opening quarter while most of his teammates were still trying to find their rhythm. \n\n\r\n              “If I get the ball on a nightly basis, I'm going to score,” Portis said. “That's what I'm good at: trying to put the ball in the hole and trying to pass the ball to the rim, like my coach growing up used to say.”\n\n\r\n              Anthony Edwards led Minnesota with 30 points on 10-of-20 shooting. Luka Garza and Jaylen Nowell each had 16 points in the Timberwolves' fifth straight loss.\n\n\r\n              Minnesota center Rudy Gobert sat out because of a non-COVID illness and star forward Karl Anthony-Towns did not play because of a strained right calf.\n\n\r\n              The Bucks struggled to connect through the first 24 minutes, shooting just 36% from the floor and 13.6% (2 of 22) from 3-point range. Minnesota led 61-50 at the half.\n\n\r\n              Milwaukee outscored Minnesota 39-22 in the quarter. Joe Ingles accounted for eight of those points, six on a pair of 3-pointers, then hit another 3 for Milwaukee's first points of the fourth. Ingles finished with 14 points and 10 assists. \n\n\r\n              “Joe's fingerprints were all over (the second half)”\" Bucks coach Mike Budenholzer said. “He gave us a big boost and a toughness that we needed.”\n\n\r\n              Minnesota made one last run, clawing within seven after Edwards recovered from a hard fall to make a pair of free throws with 4:13 left.\n\n\r\n              “We let them get back in the game and get confident,” Garza said. “It’s tough to stop the bleeding when that happens.”\n\n\r\n              EDWARDS FINISHES\n\n\r\n              Edwards played a team-high 40 minutes and managed to remain on the floor for the final 4:13 despite needing help just getting back to the bench after suffering what appeared to be a left leg injury when he took an akward fall while driving through the lane.\n\n\r\n              Edwards returned to the floor to sink two free throws and added six more points before time expired. The extent of his injury, as well as his availability for Minnesota's New Year's Eve meeting with the Pistons, was not known. \n\n\r\n              “There's always a concern,” Timberwolves coach Chris Finch said. “We'll just have to wait and see.”\n\n\r\n              TIP-INs\n\n\r\n              Timberwolves: Kyle Anderson returned to Minnesota’s starting lineup after missing the last five games because of back spasms. … The Timberwolves are 3-3 in the first game of back-to-backs this season. \n\n\r\n              Bucks: Jrue Holiday and George Hill were held out Friday night after coming down with a bug that’s been making its way through Milwaukee’s locker room. ... Antetokounmpo is averaging 38 points and 14.6 rebounds over his last six games. \n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Detroit on Saturday night.\n\n\r\n              Bucks: Host Washington on Sunday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994578.8751738
}