{
  "game_id": "0021500151",
  "espn_id": "400828038",
  "date": "Nov 15, 2015",
  "matchup": "LAL vs. DET",
  "headline": "Kobe Bryant, Jordan Clarkson lead Lakers past Pistons",
  "body": "LOS ANGELES -- Kobe Bryant's entire 37-year-old body is aching for an ice bath and a day off just 10 games into his 20th NBA season.\nBryant still put in the extra effort necessary to make sure those 10 games weren't the worst start to a season in Lakers history.\nBryant had 17 points, eight rebounds and nine assists to help Los Angeles beat the Detroit Pistons 97-85 Sunday night for its second win of the year.\n\nAndre Drummond had 17 points and 17 rebounds for the Pistons, who finished a six-game West Coast trip with their fourth consecutive loss.\nBryant went 6 for 19 from the field during a season-high 37 minutes, but finished with a season-high in assists. He stayed in until the Lakers' win was assured, even though it meant he won't play in the Lakers' game in Phoenix on Monday to rest.\n\"We've got to get this win here at home,\" Bryant said. \"(But) right now, I'm barely standing up. My back and my legs, it's killing me. I go home, and I'm looking forward to that ice bath and the stretch, and a full day of recovery tomorrow. ... I'm not looking forward to walking to the car. Seriously.\"\nJordan Clarkson scored 17 points and Los Angeles snapped a four-game skid in its return from a long East Coast trip. The Lakers are only 2-8, but that's one game better than last season's Lakers, whose 1-9 start led to the worst record in the franchise's history.\n\"We needed this one,\" Clarkson said. \"We really dug down defensively.\"\nREAL HEROES\nBryant was rewarded for his effort on a personally important night. When Bryant hit a 3-pointer to put the Lakers up 85-74 with 3:44 to play, he went to midcourt and high-fived Anthony Sadler, Spencer Stone and Alek Skarlatos, the three Americans who foiled an attempted assault on a French train in August.\n\"That was a great moment,\" Bryant said. \"They were encouraging me all game. I figured I'd get one to sit down and make sure I'd dap them up.\"\nWEARY PISTONS\nSpencer Dinwiddie scored 17 points for Detroit, which has lost 12 of its last 13 matchups with the lowly Lakers, including both meetings last season.\nHEROES HONORED\nBefore the terrorist attacks in Paris, the Lakers had already planned a first-half tribute to Stone, Skarlatos and Sadler, who was wearing a Lakers T-shirt when the trio helped subdue a gunman in August. Sadler wore the same shirt to this game. They received personalized Lakers jerseys and a lengthy standing ovation. Before the game, they also met Bryant, Sadler's favorite player.\nMANAGING KOBE\nScott has adjusted the times at which Bryant enters and exits games to keep him fresher while lessening the stiffness in his back. Scott echoed Bryant's thoughts about sacrificing Monday to win Sunday: \"We needed this.\"\nSAVING KOBE\nThe younger Lakers were grateful for Bryant's effort, even if they can't help clowning the old man. \"We're just going to take it easy on (Bryant) this season,\" Clarkson said. \"He's getting kind of old, so we want him to have his legs at the end of the game. We really want to thank his massage therapist.\"\nFACED UP\nLakers C Roy Hibbert said he broke his nose during the game, but he plans to play Monday night at Phoenix, likely wearing a mask. This is at least Hibbert's second broken nose. He said he had it broken by Bryant a couple years ago.\nTIP-INS\nPistons: They shot their first free throw with 3:26 left in the second quarter. ... Drummond got his 10th straight double-double, the league's longest season-opening streak for double-digit points and rebounds since Zach Randolph's 11 straight in 2012.\nLakers: First-round draft pick Larry Nance Jr. made his Staples Center debut in the first half and immediately energized the Lakers with six points in his first 5 minutes, including an alley-oop conversion from Bryant.\nUP NEXT\nPistons: Host Cavaliers on Tuesday night.\nLakers: At Suns on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994317.9733891
}