{
  "game_id": "0022000391",
  "espn_id": "401267551",
  "date": "Feb 11, 2021",
  "matchup": "IND @ DET",
  "headline": "Pacers snap 4-game skid with 111-95 win over Pistons",
  "body": "DETROIT -- — Domantas Sabonis had 26 points, eight rebounds and eight assists, and the Indiana Pacers snapped a four-game losing streak with a 111-95 victory over the Detroit Pistons on Thursday night.\n\n\r\n                    Malcolm Brogdon added 18 points and Jeremy Lamb scored 17 for the Pacers, who posted a season-low 94 points in a loss to Brooklyn on Wednesday. One night later, it was Detroit that struggled offensively, shooting 5 of 28 from 3-point range.\n\n\r\n                    “I thought we guarded the ball better tonight,” Pacers coach Nate Bjorkgren said. \"We were disruptive. I thought we were pressed up to their shooters on the catch.”\n\n\r\n                    Josh Jackson led Detroit with 18 points, and rookie Isaiah Stewart added 17 in his first start at center. Mason Plumlee missed the game for the last-place Pistons because of a right elbow issue.\n\n\r\n                    Detroit missed its first eight shots from beyond the arc, but the Pistons were effective enough inside that the game was tied 52-all at halftime. Then the Pacers outscored Detroit 30-18 in the third quarter. Brogdon had 10 points and Myles Turner added nine in that period for Indiana.\n\n\r\n                    The Pacers went on a 13-1 run during the third quarter to take a 70-59 lead. Sabonis, Brogdon and Turner did all the scoring during that stretch for Indiana.\n\n\r\n                    “I think for us, all it comes down to is defense and getting stops,\" guard T.J. McConnell said. \"When we’re really connected defensively, like we were tonight, we’re tough to beat.”\n\n\r\n                    Jerami Grant, coming off big games against the Lakers and Nets, shot 4 of 17 from the field and scored only nine points for the Pistons.\n\n\r\n                    “We’re getting bumped and hit and we didn’t respond in the proper way,\" Detroit coach Dwane Casey said. \"They played last night. I just didn’t think we had the proper disposition in the second half.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Turner had 14 points and eight rebounds. ... Indiana went 14 of 31 from 3-point range and shot 51% overall from the field. ... McConnell had seven points, seven assists and six rebounds.\n\n\r\n                    Pistons: Dennis Smith Jr. played his first game for Detroit since being acquired in a trade with the New York Knicks. He scored four points in a reserve role. ... Stewart made his first six shots from the field. ... Blake Griffin scored 16 points.\n\n\r\n                    SNAPPED\n\n\r\n                    Grant set a franchise record with 23 straight games with at least two 3-pointers. That streak ended Thursday when the Detroit forward went 1 of 6 from 3-point range. Griffin and Wayne Ellington were 1 of 6 as well.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Visit the Atlanta Hawks on Saturday night. Indiana went 2-1 against Atlanta in the 2019-20 regular season.\n\n\r\n                    Pistons: Visit the Boston Celtics on Friday night. The teams have split their first two games this season.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997149.8200488
}