{
  "game_id": "0021900230",
  "espn_id": "401160872",
  "date": "Nov 23, 2019",
  "matchup": "MIA @ PHI",
  "headline": "Richardson scores 32 to lead 76ers past Butler, Heat",
  "body": "PHILADELPHIA --  Jimmy Butler’s return to Philadelphia could be summed up in three letters: B-O-O.\n\nJosh Richardson scored 32 points and the 76ers led from start to finish in a 113-86 victory over Butler and the Miami Heat on Saturday night.\n\nButler struggled to 11 points, missing nine of 13 field goal attempts. He sat out the entire fourth quarter.\n\nThe star guard couldn’t buy a basket -- and the notoriously tough Philly fans relished every moment. They booed him loudly during introductions and every time he touched the ball in the first half.\n\nThey also cheered whenever he missed, and that was quite often.\n\n“To tell you the truth, I legit didn’t even pay attention,” Butler said. “I really don’t pay attention to it.”\n\nJoel Embiid added 23 points and 11 rebounds for the 76ers (11-5), who won their fourth straight overall while improving to 7-0 at home.\n\n“They played incredibly well,” Butler said.\n\nButler played 55 regular-season games for the Sixers last season, averaging 18.2 points after being acquired in a trade with Minnesota last November. He helped Philadelphia beat Miami in the first round of the playoffs before the 76ers were eliminated in the second round by Toronto.\n\nHe left Philadelphia in the offseason, inking a four-year, $142 million deal with the Heat in a sign-and-trade that brought Richardson to Philadelphia.\n\nButler shot 2 of 8 in the first quarter, the Heat failed to connect on 17 of 22 tries and Philadelphia was up 28-13. The pattern continued as the 76ers took a 55-35 halftime lead thanks to Miami’s 12-for-40 shooting in the first half, including 1 of 12 from behind the arc.\n\nBen Simmons spent much of the night guarding Butler. When asked how he thought he fared, Philadelphia’s All-Star guard said, “I think it went well, if you look at the boxscore.”\n\nPhiladelphia’s lead grew to 41 in the second half.\n\nAlthough Butler was embraced by the fan base during his stint in Philadelphia, everything wasn’t rosy.\n\nHe got heated during a film session last season with 76ers coach Brett Brown about the way he was being used in Brown’s offense, and there seems to be some lingering hard feelings.\n\nBrown was terse in his comments about Butler prior to Saturday’s game.\n\n“He had some great games for us,” Brown said. “We came close at the end. Sometimes things don’t work out. He’s in a good place.”\n\nBrown said he hasn’t been in contact with Butler and answered a follow-up question about the Heat star by saying, “I look forward to talking about the Miami Heat.”\n\nButler wasn’t much more forthcoming about the parting.\n\n“That’s something in the past,” he said. “I’ll leave it there.”\n\nTyler Herro had 20 points to pace the Heat (11-4), who had won five in a row.\n\nRICHARDSON’S RETURN\n\nRichardson, who played his first four seasons in Miami and averaged 16.6 points last season, made 11 of 15 shots and went 6 of 7 on 3-pointers. He had missed the previous two games with a hip injury.\n\n“Definitely a fun game,” Richardson said. \"I saw my first couple of shots go through and I just was staying aggressive.\"\n\nTIP-INS\n\nHeat: Miami was playing the second game of a back-to-back after winning 116-108 at Chicago on Friday night. … Finished 6 for 24 from 3-point range.\n\n76ers: It was the first of four matchups between the teams this season. They’ll next play Dec. 18 in Philadelphia.\n\nUP NEXT\n\nHeat: Host the Charlotte Hornets on Monday.\n\n76ers: At the Toronto Raptors on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995548.239553
}