{
  "game_id": "0022400169",
  "espn_id": "401704735",
  "date": "Nov 06, 2024",
  "matchup": "CHA vs. DET",
  "headline": "Brandon Miller's putback at the buzzer lifts Hornets to dramatic 108-107 victory",
  "body": "CHARLOTTE, N.C. -- — Brandon Miller scored off an offensive rebound at the buzzer to lift Charlotte Hornets to a thrilling 108-107 victory over the Detroit Pistons on Wednesday night.\n\n\r\n              Miles Bridges had 27 points and LaMelo Ball added 25 points on five 3-pointers for the Hornets, who snapped a three-game losing streak. Miller finished with 19 points.\n\n\r\n              Cade Cunningham had a triple-double for Detroit with 20 points, 10 rebounds and 10 assists. Jaden Ivey added 21 points for the Pistons.\n\n\r\n              Miller’s putback avenged a huge turnover just seconds earlier.\n\n\r\n              With the Hornets leading by one and trying to run out the clock, Miller got caught in a double team and the Pistons wrestled the ball away from him.\n\n\r\n              Ronald Holland picked up the loose ball and drove from halfcourt for a go-ahead layup with 6.3 seconds left to give the Pistons the lead, stunning the home crowd.\n\n\r\n              But on Charlotte’s final possession, Miller grabbed Grant Williams' missed 3-pointer on the left side of the lane and quickly put it back in off the backboard for the winner and was promptly mobbed by his teammates.\n\n\r\n              Takeaways\r\n              Pistons: Detroit had a big size advantage coming into the game with Charlotte centers Mark Williams and Nick Richards out with injuries, but that was quickly negated after Jalen Duren left the game in the first quarter with an ankle injury and did not return.\n\n\r\n              Hornets: They came into the season figuring the bulk of their scoring would come from Ball, Miller and Bridges. For the first time this season all three put up good numbers together. \n\n\r\n              Key moment\r\n              Ball knocked home a step-back 3-pointer with 55 seconds left to give the Hornets the lead, then scored 31 seconds later on a driving layup to push the lead to 106-103. \n\n\r\n              Key stat\r\n              The Pistons had 34 assists.\n\n\r\n              Up next\r\n              On Friday night the Pistons host the Hawks, while the Hornets host the Pacers.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997469.9293828
}