{
  "game_id": "0021901239",
  "espn_id": "401224714",
  "date": "Aug 01, 2020",
  "matchup": "MIA @ DEN",
  "headline": "Butler, Adebayo score 22 each as Heat top Nuggets 125-105",
  "body": "LAKE BUENA VISTA, Fla. --  Jimmy Butler and Bam Adebayo each scored 22 points to help the Miami Heat beat the Denver Nuggets 125-105 on Saturday in the first restart game for both teams.\n\nKelly Olynyk scored all of his 20 points in the fourth quarter for the Heat, who shot 56% from the field.\n\nIt was a positive step for Miami after an 18-point loss to Memphis in its final scrimmage on Tuesday. The Heat broke away with a strong second half on both ends.\n\n\"I think we really locked in and got stops in the second,\" Adebayo said. \"It always helps to make shots, don't get me wrong. But we started playing a lot harder in the second.\"\n\nNikola Jokic and Jerami Grant each scored 19 points for Denver.\n\nThe Nuggets played without guards Jamal Murray (hamstring), Will Barton (knee) and Gary Harris (hip). Murray ranks second on the team with 18.8 points per game.\n\nDenver also did not get a full training camp because of coronavirus cases on the team.\n\n\"It's still unacceptable,\" Nuggets guard Torrey Craig said. \"If you're out there, you have to play your best and you've got to compete. You don't make any excuses, no matter how many guys you have.\"\n\nHeat center Meyers Leonard stood during the national anthem, saying it was out of respect for the U.S. military, while all the coaches and players around him kneeled. His brother, Bailey Leonard, served two tours in Afghanistan with the Marines. Leonard wore a Black Lives Matter T-shirt over a jersey that said \"Equality.\"\n\nDenver led 57-56 at halftime, but Miami outscored the Nuggets 38-22 in the third quarter to lead 94-79 heading into the fourth.\n\nButler scored and was fouled on a layup with just under 10 minutes remaining, and his free throw put the Heat up by 20.\n\n\"I thought we had possessions tonight where I saw a lot of guys out there not playing hard,\" Denver coach Michael Malone said. \"Whether you have guys out with injuries or with coronavirus, that's unacceptable. If you turn the ball over and you walk down the floor because you're feeling sorry for yourself, that does not sit well with me. I like guys that play hard.\"\n\nTIP-INS\n\nHeat: Olynyk joined Dwyane Wade as the only players in Heat history to score at least 20 points in a fourth quarter. Olynyk shot 0 for 2 from the field in the first three quarters, then made 7 of 9 field goals and all four of his 3-pointers in the fourth. ... F Jae Crowder made his second start of the season.\n\nNuggets: The 1 p.m. Eastern start time -- 11 a.m. in Denver -- was the Nuggets' second earliest of the season. They had a 12:30 p.m. start at Detroit on Feb. 2, which was Super Bowl Sunday. ... Made just 8 of 35 3-pointers.\n\nBOL BOL\n\nBol Bol, who had some excellent moments in Denver's scrimmages at Disney, made his official NBA debut. The 7-foot-2 center finished with five points and five rebounds in 11 minutes. He scored his first NBA basket in the second quarter. Because he hasn't played much, he will be eligible for Rookie of the Year next season.\n\nWHAT'S IN A NAME?\n\nButler unsuccessfully lobbied the NBA for permission to wear no name or social justice message on his jersey. He stepped onto the court in a jersey with only the No. 22 on the back but had to change into one with his last name on it before the game could start. The NBA and NBPA worked to allow social messaging but never discussed blank jerseys.\n\n\"I didn't have my name on the back of the jersey, but I decided to change because my teammates probably needed me a little bit,\" Butler said.\n\nUP NEXT\n\nHeat: Play the Toronto Raptors on Monday.\n\nNuggets: Play the Oklahoma City Thunder on Monday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995481.331727
}