{
  "game_id": "0022400764",
  "espn_id": "401705330",
  "date": "Feb 11, 2025",
  "matchup": "TOR @ PHI",
  "headline": "Raptors drop 76ers to a season-worst 13 games under .500 with 106-103 victory",
  "body": "PHILADELPHIA -- — Scottie Barnes scored 33 points, Immanuel Quickley added 23 and the Toronto Raptors snapped a four-game losing streak with a 106-103 victory over the Philadelphia 76ers on Tuesday night.\n\n\r\n              Gradey Dick added 17 points, including a clutch late 3-pointer. Barnes fed Ochai Agbaji for a layup with 1:32 left to put the Raptors up for good.\n\n\r\n              Joel Embiid had 27 points and 12 rebounds, but the 76ers (20-33) fell a season-worst 13 games under .500. Jared Butler had 15 points off the bench, and Paul George added 12. \n\n\r\n              Tyrese Maxey had just five points on 1-for-9 shooting. He was 1 for 7 from 3-point range, where the 76ers finished 9 for 38 (23.7%).\n\n\r\n              Takeaways\r\n              Raptors: Before the game, the Raptors signed Brandon Ingram to a three-year, $120 million extension. He was acquired from New Orleans last week but hasn’t played since Dec. 7 due to an ankle injury.\n\n\r\n              76ers: The Sixers got plenty of bench scoring, with 15 points from Butler and 13 from Quentin Grimes. But it came on a night when Maxey ended a run of 18 straight games of 25 of more points.\n\n\r\n              Key moment\r\n              Embiid shot 4 for 13 in the second half and 2 for 6 in the fourth quarter. He committed a turnover with the 76ers down two and 8.1 seconds left, allowing Dick to hit a free throw for the final margin.\n\n\r\n              Key stat\r\n              In an overall poor shooting game, the Raptors were 3 for 9 from 3-point range in the fourth, just enough to get the win.\n\n\r\n              Up next\r\n              Toronto hosts Cleveland Wednesday. The 76ers visit Brooklyn, both playing their last games before the All-Star break.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996950.752556
}