{
  "game_id": "401809941",
  "espn_id": "401809941",
  "date": "Oct 22, 2025",
  "matchup": "PHX vs SAC",
  "headline": "Devin Booker scores 31 points, Suns overcome a 20-point deficit to beat Kings 120-116",
  "body": "PHOENIX -- — Devin Booker scored 31 points, Jordan Ott was victorious in his head coaching debut and the Phoenix Suns overcame a 20-point deficit to beat the Sacramento Kings 120-116 on Wednesday night.\n\n\r\n              Veteran guard Dillon Brooks added 22 points in his Suns debut and brought his usual swagger, irritating Kings star DeMar DeRozan with physical defense in the fourth quarter. Grayson Allen scored 18 points.\n\n\r\n              Booker — now in his 11th NBA season — made 10 of 19 shots and added five rebounds and five assists.\n\n\r\n              The Kings led by 17 points at halftime, but the Suns rallied to cut the deficit to 92-90 entering the fourth. Phoenix took its first lead of the second half when Royce O'Neale hit a 3-pointer with 10:31 left.\n\n\r\n              The Suns would push their advantage to 106-97 with 5:46 left, but the Kings scored the next seven points. Sacramento's Malik Monk hit a short jumper to tie it at 110 with 1:15 left.\n\n\r\n              Brooks was fouled while shooting a 3-pointer on the ensuing possession and made all three free throws to push the Suns ahead 113-110. They wouldn't trail again.\n\n\r\n              Zach LaVine led Sacramento with 30 points on 13-of-24 shooting. DeRozan added 29, and Monk had 19 off the bench. Nine-time All-Star guard Russell Westbrook — who signed with the Kings last week — finished with six points and six rebounds.\n\n\r\n              The Kings jumped to a 71-54 halftime lead after shooting 64.4% from the field. LaVine scored 22 points on 9-of-13 shooting, including a stepback 3-pointer with 2.2 seconds left before the break.\n\n\r\n              The Kings were playing without three-time All-Star Domantas Sabonis, who is out with a right hamstring strain. \n\n\r\n              The Suns were without projected starting guard Jalen Green (hamstring), who was acquired from the Rockets in the offseason in the trade for 15-time All-Star Kevin Durant.\n\n\r\n              Up next\r\n              Kings: Host Utah on Friday night.\n\n\r\n              Suns: At Los Angeles Clippers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042483.6656692
}