{
  "game_id": "0021601191",
  "espn_id": "400900569",
  "date": "Apr 08, 2017",
  "matchup": "MIL @ PHI",
  "headline": "Bucks snap losing skid, clinch second playoff berth in 3 years",
  "body": "PHILADELPHIA --  After leading his team to the NBA playoffs for the second time in three years, Milwaukee Bucks forward Giannis Antetokounmpo tried to act emotional.\n\n\"I'm just going to tear up,\" Antetokoumpo joked.\n\nAntetokounmpo, fighting a stomach bug, had 20 points, 10 rebounds and six assists as the Bucks beat the Philadelphia 76ers 90-82 to clinch a postseason berth.\n\n\"It feels good,\" he said. \"You work all season long for this moment right here. This is just the beginning. We want to go deep into the playoffs.\"\n\nThe playoff quest hadn't been easy. Milwaukee (41-39) lost forward Jabari Parker to a knee injury after 51 games, and was just 22-30 on Feb. 10. The Bucks also lost three straight entering Saturday's game.\n\nNone of that matters now, though.\n\n\"It's not going to be fun to play against us in the playoffs,\" Antetokounmpo said.\n\nThe Bucks began the day needing a victory and a loss by Chicago, Indiana or Miami to nail down a playoff spot. The Bulls lost 107-106 to Brooklyn.\n\nMilwaukee trailed the lowly Sixers at halftime, but Antetokounmpo notched eight of his points as the Bucks outscored Philadelphia 25-12 in the third quarter to take command.\n\nThe Bucks limited the Sixers to 22 percent shooting in the period (4 of 18) and 29.7 percent accuracy in the second half (11 of 37).\n\n\"Our energy and effort was a lot better in that second half,\" coach Jason Kidd said.\n\nGreg Monroe added 17 points off the bench for Milwaukee, while Matthew Dellavedova contributed 14.\n\nRichaun Holmes collected 17 points and 10 rebounds for Philadelphia, which dropped its sixth straight.\n\nThe Sixers, leading 52-46 early in the second half, missed eight of their next nine shots to fuel a 15-5 Milwaukee run, giving the Bucks a 61-54 lead.\n\nAntetokounmpo provided six points in that stretch, and a 3-pointer from the left corner by Tony Snell with 5:39 left in the period put the Bucks ahead to stay.\n\nMilwaukee, up 67-60 at the end of the period, extended its lead to as many as 12 in the fourth quarter, when Monroe and Dellavedova each scored eight points.\n\nTIP-INS\n\nBucks: Malcolm Brogdon missed his fifth straight game with back tightness, and John Henson sat out his 10th straight with a sprained left thumb. Both worked out Friday and Saturday, and Kidd hopes they can return Monday against Charlotte.\n\nSixers: Sergio Rodriguez, who had missed the previous six games with a strained left hamstring, has been ruled out for the last three of the regular season as well. Philadelphia has now lost six players to season-ending injuries. ... Saric, plagued by plantar fasciitis in his left foot, continues to be restricted to 24 minutes a night. ... Saric celebrated his 23rd birthday Saturday.\n\nROOKIE OF THE YEAR DEBATE\n\nThe teams feature three of the top Rookie of the Year candidates, though two of them -- Philadelphia center Joel Embiid and Milwaukee guard Malcolm Brogdon -- did not play. The third, Sixers forward Dario Saric, has been limited by foot problems of late.\n\nEmbiid leads all rookies in scoring (20.2) and rebounding (7.8), but appeared in just 31 games before a season-ending knee injury. Saric is second among rookies in scoring (12.8) and third in rebounding, while Brogdon is third among rookies in scoring (10.3) and first in assists (4.3).\n\nBrogdon missed his fifth straight game Saturday with back tightness. He is expected to return before the regular season ends.\n\nSixers coach Brett Brown said the award should be judged by body of work, and on that basis seemed to be leaning toward Saric, whose improvement has been \"very eye-popping\" in the coach's view.\n\nBut Brown would have no argument with Embiid winning, either.\n\n\"What I feel most strongly about is that's our trophy,\" Brown said. \"That's our award. It comes through Philadelphia.\"\n\nUP NEXT\n\nBucks: Milwaukee hosts Charlotte on Monday, in its final regular-season home game.\n\nSixers: Philadelphia closes out its home schedule against Indiana on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995122.9959948
}