{
  "game_id": "401810112",
  "espn_id": "401810112",
  "date": "Nov 19, 2025",
  "matchup": "MIA vs GS",
  "headline": "Powell scores 25, Adebayo adds 20 and Heat surge late to defeat short-handed Warriors 110-96",
  "body": "MIAMI -- — Norman Powell scored 25 points, Bam Adebayo returned to score 20 and the Miami Heat pulled away late to top the extremely short-handed Golden State Warriors 110-96 on Wednesday night.\n\n\r\n              Former Warriors forward Andrew Wiggins scored 17 and Kel'el Ware grabbed 16 rebounds for Miami, which outscored Golden State 38-22 in the fourth quarter.\n\n\r\n              The Warriors, at the end of a six-game, nine-day trip, were without their four highest-paid players: Stephen Curry (ankle), former Heat forward Jimmy Butler (back), Draymond Green (illness) and Jonathan Kuminga (knee), a group making about $162 million this season. Al Horford, who isn’t playing back-to-backs and appeared in Golden State’s loss at Orlando on Tuesday, also sat out.\n\n\r\n              Brandin Podziemski scored 20 for Golden State, which got 19 from Quinten Post and 18 from Buddy Hield. The Warriors gave up 23 turnovers that Miami turned into 34 points — 20 more than Golden State scored off Miami's 14 giveaways.\n\n\r\n              The teams combined to shoot 38.4%, the second-worst shooting game in the NBA so far this season. Toronto and Atlanta combined to shoot 37.4% in the Raptors' 109-97 win on Nov. 7.\n\n\r\n              Adebayo missed Miami's six previous games with a toe injury. The Heat are still without guard Tyler Herro, though he could make his season debut in the coming days after offseason ankle surgery.\n\n\r\n              The Warriors got into a 20-4 hole, their largest first-quarter deficit of the season. But Miami scored only 19 points in the next 12 minutes and Golden State chipped away, taking its first lead at 60-59 on a basket by Post midway through the third.\n\n\r\n              Then it was Golden State's turn to cool. The Warriors led 74-69 late in the third, before Miami went on a 21-4 run to pull away.\n\n\r\n              Up next\r\n              Warriors: Host Portland on Friday.\n\n\r\n              Heat: Visit Chicago on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042655.61617
}