{
  "game_id": "401810049",
  "espn_id": "401810049",
  "date": "Nov 09, 2025",
  "matchup": "MEM vs OKC",
  "headline": "Gilgeous-Alexander scores 35 as Thunder rally in the 2nd half and beat Grizzlies 114-100",
  "body": "MEMPHIS, Tenn. -- — Shai Gilgeous-Alexander scored 35 points, including a nine-point outburst in the fourth quarter, to help the Oklahoma City Thunder beat the Memphis Grizzlies 114-100 on Sunday.\n\n\r\n              Memphis was still within single digits with just more than four minutes left when Gilgeous-Alexander converted consecutive 3-pointers and completed a three-point play to stretch the lead to double-figures, helping seal the win for the defending NBA champions. Oklahoma City improved to 6-1 on the road and 10-1 overall, with its only loss coming Wednesday at Portland.\n\n\r\n              Chet Holmgren and Ajay Mitchell each scored 21 points for the Thunder. Isaiah Hartenstein finished with 18 points and 13 rebounds.\n\n\r\n              Jaren Jackson Jr. led Memphis with 17 points. Cedric Coward had 13 points and 10 rebounds, Jaylen Wells and Sant Aldama scored 12 apiece. Ja Morant was limited to 11 points on 3-for-18 shooting from the field.\n\n\r\n              Oklahoma City overcame poor shooting and a 19-point deficit in the first half by outscoring Memphis 34-18 in the third and erase the Grizzlies' advantage. The Thunder went on to outscore Memphis 63-38 in the second half.\n\n\r\n              Oklahoma City has won 14 straight games against Memphis, including a four-game sweep in the opening round of last season's Western Conference playoffs. \n\n\r\n              Memphis got off to a good start for a second straight game, shooting better than 50% for most of the half. Meanwhile, the Thunder were struggling at 39% shooting overall and 19% from beyond the arc. That included Gilgeous-Alexander going 5 of 14 from the field in the half.\n\n\r\n              The Grizzlies stretched their lead to 19 points before a 14-6 run by Oklahoma City to close the half left Memphis with a 62-51 advantage at the break. That rally continued at the start of the second half as the Thunder got back into the game.\n\n\r\n              Up next\r\n              Thunder: Host Golden State Warriors on Tuesday.\n\n\r\n              Grizzlies: Begin a four-game trip at the New York Knicks on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042592.134123
}