{
  "game_id": "0022400199",
  "espn_id": "401704765",
  "date": "Nov 09, 2024",
  "matchup": "BKN @ CLE",
  "headline": "Evan Mobley scores 23 points and Cavaliers rally past Nets 105-100 to remain perfect at 11-0",
  "body": "CLEVELAND -- — Evan Mobley had 23 points and 16 rebounds, and Donovan Mitchell scored 22 as the Cleveland Cavaliers rallied for a 105-100 win over the Brooklyn Nets on Saturday night, becoming the 12th team in NBA history to start a season 11-0.\n\n\r\n              Darius Garland scored eight of his 20 points in the fourth quarter for Cleveland, which trailed 82-68 with 35 seconds left in the third. Garland put the Cavaliers ahead for good at 97-96 with two free throws.\n\n\r\n              The 2015-16 Golden State Warriors hold the league record after winning their first 24 games. They lost to the Cavaliers in the NBA Finals.\n\n\r\n              Cam Johnson scored 23 points and Dennis Schroder and Cam Thomas had 22 apiece for the Nets. Brooklyn trailed by 15 in the second quarter, but held Cleveland to a season-low 13 points in the third with Johnson and Thomas combining for 19.\n\n\r\n              The Cavaliers failed to score 110 points for the first time, ending their NBA-record streak of doing so in 10 consecutive wins to open a season. Hall of Fame center Wilt Chamberlain and the 1960-61 Philadelphia Warriors had held the mark with nine.\n\n\r\n              Takeaways\r\n              Nets: Coming off a 108-104 overtime loss in Boston one night earlier, Brooklyn couldn’t stop the Cavaliers’ league-leading offense in the fourth quarter. Cleveland made 14 of 18 shots in the final period.\n\n\r\n              Cavaliers: New coach Kenny Atkinson admitted “there was a little extra” at stake for him facing Brooklyn for the first time since being fired by the Nets in 2020. Mobley took the message to heart, making 10 of 11 field goal attempts.\n\n\r\n              Key moment\r\n              After Johnson buried a 3-pointer with 4:23 left to extend Brooklyn’s lead to 96-89, the Cavaliers answered with 10 straight points. Garland scored four in a row, then fed Mobley for a dunk to complete the game-changing run.\n\n\r\n              Key stat\r\n              The Cavaliers are two victories from matching the longest streak in franchise history. Cleveland has won 13 in a row three times, all with franchise icon LeBron James on the roster, last doing so from Nov. 11 to Dec. 6, 2017.\n\n\r\n              Up next\r\n              The Nets wrap up a three-game trip Monday in New Orleans. The Cavaliers visit Chicago on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998003.738956
}