{
  "game_id": "0021600417",
  "espn_id": "400899859",
  "date": "Dec 19, 2016",
  "matchup": "DAL @ DEN",
  "headline": "Jokic has near triple-double as Nuggets beat Mavs 117-107",
  "body": "DENVER --  Foul trouble kept Nikola Jokic from playing more minutes the past two games. He showed what he can do when he stays on the floor.\n\nJokic had 27 points and 15 rebounds, Gary Harris scored a career-high 24 points and the Denver Nuggets beat the Dallas Mavericks 117-107 on Monday night.\n\nJokic finished an assist shy of his first career triple-double and tied his career high in points to help the Nuggets win their third straight game. Emmanuel Mudiay scored 18 points.\n\nJokic averaged only 20 minutes in the first two games of the homestand after committing five fouls each game. It derailed potential big nights, but he had just one foul against the Mavericks and dominated.\n\n\"Mike told me he was going to beat me if I made more stupid fouls,\" Jokic said of coach Michael Malone. \"I listened.\"\n\nDeron Williams led Dallas with 23 points and eight assists.\n\nDenver's recent offensive surge started after its 20-point loss in Dallas on Dec. 12. Malone shook up his starting lineup and the Nuggets have responded by scoring 30 or more points in eight of the last 12 quarters and are averaging 125.3 points since the change.\n\nThey've gotten it done with contributions from different players and Harris was a big contributor Monday. The third-year guard out of Michigan State is averaging 19.3 points since returning from a foot injury.\n\n\"He has three games back and I don't think it's a coincidence that we have won three games in a row,\" Malone said.\n\nHarris got the Nuggets started early, scoring 16 in the first half as Denver overcame a 16-point deficit to lead by two at the break. The lead grew to 12 in the third but Dallas made a run to get within six late in the fourth. Jokic hit a 3-pointer, a short jumper and fed Wilson Chandler for a layup for his ninth assist.\n\n\"When you have a guy playing that well you want him to get it,\" teammate Jameer Nelson said of the triple-double. \"That's a heck of an accomplishment for an individual. It means he's playing the game the right way.\"\n\nJokic had a chance for his 10th assist but Mudiay missed his only 3-pointer off a pass. Jokic wasn't concerned about missing out on the feat.\n\n\"It doesn't really matter,\" he said. \"The game is more important than your name.\"\n\nThe Mavericks ran out of gas after playing Sunday afternoon.\n\n\"They wore us down as the game went on,\" Williams said. \"They came out and hit a lot of 3s in the second half and got the lead. We battled but we couldn't outlast them.\"\n\nTIP-INS\n\nMavericks: G J.J. Barea returned to the lineup after missing a month with a strained right calf. He had 11 points in 13 minutes. ... Andrew Bogut (right knee) and Dirk Nowitzki (right Achilles) are hoping to return for the start of 2017.\n\nNuggets: G Jamal Murray played despite a sore right foot. He had three points in 14 minutes. ... C Jusuf Nurkic didn't play a game after logging just eight minutes.\n\nTALL TALE\n\nMavericks coach Rick Carlisle joked before Monday's game that Jokic was taller than his listed 6-foot-11.\n\n\"That's (ridiculous). He is probably like 7-4,\" Carlisle said. \"His arms are crazy long. He's a guy that's plays an on-the-floor game but he is some player. Some of his passing is ridiculously creative and he can make shots. We know he can grab it and put in the basket because he did it about six times last game.\"\n\nHe was equally impressed after Monday's performance.\n\n\"He kicked our (butt) last game too,\" he said. \"It's not a surprise; he's good.\"\n\nUP NEXT\n\nMavericks: At Portland on Wednesday night.\n\nNuggets: At the Los Angeles Clippers on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764996143.1865642
}