{
  "game_id": "0022200731",
  "espn_id": "401468886",
  "date": "Jan 26, 2023",
  "matchup": "BKN vs. DET",
  "headline": "Pistons beat Nets, first win in Brooklyn in almost 5 years",
  "body": "NEW YORK -- — Saddiq Bey scored 25 points and the Detroit Pistons won in Brooklyn for the first time in nearly five years, beating the Nets 130-122 on Thursday night.\n\n\r\n              Alec Burks added 20 for the Pistons, who snapped a four-game losing streak. They were playing for the first time since giving up 150 points in a loss to Milwaukee on Monday, when they were down 49-24 after one quarter.\n\n\r\n              “We just knew we had to start off better than that and just play better throughout the four quarters,” said Bey, who added nine rebounds. “So I think we were very eager just to nip that one in the bud and just keep going.”\n\n\r\n              The Pistons took advantage of a short-handed Nets team playing the second night of a back-to-back to win at Barclays Center for the first time since April 1, 2018, ending a six-game skid. They had lost seven in a row overall to the Nets.\n\n\r\n              Kyrie Irving scored 40 points for the Nets, tying his career high and the Nets NBA record with five straight games of 30 or more. Nic Claxton added a career-best 27 and Edmond Sumner had 24.\n\n\r\n              But the Nets, who lost 137-133 in Philadelphia on Wednesday, ran out of gas in the second half, falling into a hole by allowing the Pistons to score 43 points on 65% shooting in the third quarter.\n\n\r\n              “They have a tendency to come out in the third quarter and try to win that. We came out and we were flat,” Irving said. “When you do that and you are reacting to everything, every possession, it makes it difficult.”\n\n\r\n              The Nets lost Ben Simmons to left knee soreness in the period after he played 20 scoreless minutes.\n\n\r\n              The Pistons closed well in the third, pushing a five-point lead with 2 1/2 minutes to play into a 101-90 advantage headed to the fourth. Bey scored 15 points on 6-for-7 shooting in the period.\n\n\r\n              “We had a big third quarter,” Pistons coach Dwane Casey said. “The third quarter was at one time our nemesis coming out of the locker room. I think we’re graduating, we’re growing into being a competitive team out of the locker room.”\n\n\r\n              Irving tried to rally the Nets but the Pistons never let them get too close. He also scored 30 or more points in five straight games in March 2019 with the Celtics, and joined Kevin Durant, Stephon Marbury and John Williamson as the only Nets players to do it since the franchise joined the NBA. \n\n\r\n              Jalen Duren scored 17 points and Jaden Ivey and Killian Hayes each had 16 for the Pistons, who led 30-27 after one. The Nets inched ahead 59-58 at the half. \n\n\r\n              TIP-INS\n\n\r\n              Pistons: Isaiah Stewart returned after missing Monday's game with a sore left shoulder and had 11 points. ... Bojan Bogdanovic was held to 11 points on 4-for-15 shooting after scoring 20 or more in a career-best 10 straight games. \n\n\r\n              Nets: Seth Curry sat out with right knee soreness after scoring 32 points Wednesday, his best as a Net. ... The Nets returned home from a five-game trip and began a stretch where they play eight of nine at home. The Nets, who entered with a league-low 20 home games, leave New York just one more time in their 11 remaining games before the All-Star break, with one of their two road games at the Knicks. \n\n\r\n              ALL-STARS\n\n\r\n              With Durant and Irving selected, the Nets were the only team with two All-Star starters. They are the only Nets to be selected to start multiple NBA All-Star games, and Durant joined Jason Kidd (2002-04) and Vince Carter (2005-07) as the only ones to be selected to three in a row.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Houston on Saturday.\n\n\r\n              Nets: Host New York on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994868.384983
}