{
  "game_id": "0022400211",
  "espn_id": "401704777",
  "date": "Nov 10, 2024",
  "matchup": "TOR @ LAL",
  "headline": "LeBron gets 2nd straight triple-double, Anthony Davis injured in Lakers' 123-103 win over Raptors",
  "body": "LOS ANGELES -- — LeBron James recorded his second straight triple-double, and Anthony Davis scored 22 points before leaving with an eye injury in the third quarter of the Los Angeles Lakers ' 123-103 victory over the Toronto Raptors on Sunday night.\n\n\r\n              Davis was hit in the face by Jakob Poeltl’s off hand while he blocked the Toronto center’s dunk attempt with 5:16 left in the third quarter. The nine-time All-Star, who began the night leading the NBA in scoring, was ruled out after he went to the locker room.\n\n\r\n              James had 19 points, a season-high 16 assists and 10 rebounds in his third triple-double already this season and the 115th of his matchless 22-year career.\n\n\r\n              Austin Reaves scored 27 points for the Lakers, who improved to 5-0 at home. Los Angeles also beat Toronto for the second time in nine days.\n\n\r\n              Chris Boucher and RJ Barrett scored 18 points apiece for the Raptors, who have lost four straight and eight of nine.\n\n\r\n              Bronny James played the final 1:40.\n\n\r\n              Takeaways\r\n              Raptors: Immanuel Quickley scored 12 points and played back-to-back games in LA after missing eight straight with a pelvic bruise. Poeltl had 14 points and 10 rebounds while playing well against Davis on both ends.\n\n\r\n              Lakers: At 6-4, they have a winning record through 10 games for the first time in four seasons, but Davis' latest injury endangers everything.\n\n\r\n              Key moment\r\n              After trailing by double digits early, the Lakers finished the third quarter on a 16-5 run right after Davis' injury before roaring away. LA took the lead for good on rookie Dalton Knecht's 3-pointer.\n\n\r\n              Key stat\r\n              James has 13 triple-doubles since he turned 37 in December 2021. Only six other players in NBA history accomplished the feat after their 37th birthdays, doing it a combined eight times.\n\n\r\n              Up next\r\n              The Lakers host Memphis on Wednesday. The Raptors end their five-game trip in Milwaukee on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996997.814399
}