{
  "game_id": "0022400439",
  "espn_id": "401705005",
  "date": "Dec 29, 2024",
  "matchup": "HOU vs. MIA",
  "headline": "Herro leads Heat over Rockets in game marred by fight and ejections in final minute",
  "body": "HOUSTON -- — Tyler Herro scored 27 points before being one of seven people ejected, six for their roles in a fight in the final minute of the Miami Heat's 104-100 victory over the Houston Rockets on Sunday night.\n\n\r\n              Herro was thrown to the ground by the Rockets' Amen Thompson with 35 seconds left and the Heat leading 99-94. Players and coaches from both benches then came onto the court. \n\n\r\n              Both players were thrown out along with Rockets guard Jalen Green, coach Ime Udoka and assistant coach Ben Sullivan. Terry Rozier was also ejected for Miami.\n\n\r\n              Houston led 92-85 after Fred VanVleet's layup with 8:10 to play, but the Rockets missed their next 11 shots, allowing Miami to tie the game when Herro found Haywood Highsmith for a 3-pointer with 4:47 to play.\n\n\r\n              Herro’s jumper with 1:56 to play put the Heat on top for good. VanVleet was ejected in the final minute after appearing to make contact with referee Marc Davis, upset after being called for a 5-second violation that preceded the dustup with Thompson, Herro and others.\n\n\r\n              Takeaways\r\n              Heat: Playing the second night of a back-to-back and missing Jimmy Butler for a fifth straight game, Nikola Jovic finished with 18 points, seven rebounds, and six assists for the Heat. Highsmith added 15 points.\n\n\r\n              Rockets: After blowing a 15-point, fourth-quarter lead against the Wolves, Houston struggled offensively in the fourth quarter, shooting just 6 for 24 from the field. Dillon Brooks scored 22 points after missing the last three games with a right ankle effusion.\n\n\r\n              Key moment\r\n              Jovic’s 3 with 47 seconds left put Miami up 98-94.\n\n\r\n              Key Stat\r\n              Miami outscored Houston, the NBA’s best offensive rebounding team, 15-9 in second-chance points.\n\n\r\n              Up Next\r\n              The Rockets host Dallas on Wednesday and the Heat host New Orleans on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764997392.724305
}