{
  "game_id": "0022400294",
  "espn_id": "401704860",
  "date": "Nov 27, 2024",
  "matchup": "MIN vs. SAC",
  "headline": "Monk and Fox take over late to lead the Kings past the Timberwolves 115-104",
  "body": "MINNEAPOLIS -- — Malik Monk had 27 points, nine assists and eight rebounds, De'Aaron Fox added 26 points, eight assists and eight rebounds, and the Sacramento Kings rode a gritty performance underneath both baskets to a 115-104 victory against the scuffling Minnesota Timberwolves on Wednesday night.\n\n\r\n              Monk and Fox combined to outscore the Timberwolves 17-2 over the final five minutes. Domantas Sabonis had 27 points and 12 rebounds as Sacramento snapped a four-game losing streak.\n\n\r\n              Led by Sabonis, Sacramento outscored Minnesota 64-36 in the paint. The Kings also had 12 offensive rebounds to four for the Timberwolves.\n\n\r\n              Anthony Edwards led Minnesota with 29 points but went 9 for 24 from the field. After reaching the 2024 Western Conference finals and starting 6-3 this season, the Wolves have lost four in a row and seven of nine.\n\n\r\n              Takeaways\r\n              Kings: Monk appears to have fully recovered from the right ankle sprain that kept him out of seven games. The 2023-24 Sixth Man of the Year finalist made back-to-back 3-pointers with less than four minutes remaining as Sacramento erased a 12-point deficit in the fourth quarter.\n\n\r\n              Timberwolves: Even with Mike Conley back in the lineup after missing three games with a toe sprain, Minnesota continues to struggle with chemistry. The Karl-Anthony Towns trade haul of Julius Randle (21 points, nine rebounds) and Donte DiVincenzo (five points) has yielded mixed results as they attempt to gel with Edwards, Rudy Gobert and the rest of the Timberwolves' core.\n\n\r\n              Key moment\r\n              Jae Crowder, a 12-year NBA veteran who signed with the Kings earlier Wednesday, started in his first game since the 2024 playoffs with Milwaukee. His 3 at the first-quarter buzzer cut an early Wolves lead to 33-31; Crowder pointed at the home team's bench before joining his new teammates for the break.\n\n\r\n              Key stat\r\n              Edwards made his first four 3s and had 14 points in the first nine minutes. He entered Wednesday leading the NBA with 4.8 made 3s per game.\n\n\r\n              Up next\r\n              Both teams have NBA Cup group play games Friday night: Sacramento at Portland, and Minnesota at home against the Los Angeles Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998103.7834802
}