{
  "game_id": "0022401127",
  "espn_id": "401705693",
  "date": "Apr 04, 2025",
  "matchup": "DAL @ LAC",
  "headline": "Leonard scores 20 points to help Clippers rout Mavericks 114-91 for 3rd straight win",
  "body": "INGLEWOOD, Calif. -- — Kawhi Leonard scored 20 points, Ivica Zubac had 14 points and 13 rebounds and the Los Angeles Clippers routed the Dallas Mavericks 114-91 on Friday night for their third straight victory.\n\n\r\n              The teams will meet again Saturday in Inglewood.\n\n\r\n              Norman Powell added 14 points, James Harden had 13 points and Bogdan Bogdanovic and Devin Eubanks each scored 12 points. Los Angeles led by 25 points midway through the second quarter and pushed its lead to 35 points in the fourth before emptying its bench.\n\n\r\n              The Clippers are 13-3 in their last 16 games.\n\n\r\n              Naji Marshall scored 22 points to lead the Mavericks. Spencer Dinwiddie added 18 points, and Jaden Hardy had 16 points. Anthony Davis sat out with a left adductor strain.\n\n\r\n              Takeaways\r\n              Mavericks: Dallas’ season continues to unravel following the Luka Doncic trade with the Lakers. Without injured starters Davis and Kyrie Irving (torn ACL), the Mavericks were completely outmatched by the Clippers. They trailed by double digits less than nine minutes into the game and never got within three possessions again.\n\n\r\n              Clippers: Los Angeles continues to stay red-hot in its push to avoid the play-in tournament. The Clippers are tied with Minnesota and Memphis for the No. 6 seed in the Western Conference with five games left.\n\n\r\n              Key moment\r\n              Leonard scored seven straight points to start an early 21-8 Clippers run, and Dallas never got within 10 points again.\n\n\r\n              Key stat\r\n              The Mavericks shot 20% (4 for 20) from 3-point range, their second-worst mark of the season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997129.518551
}