{
  "game_id": "0022301176",
  "espn_id": "401585804",
  "date": "Apr 12, 2024",
  "matchup": "MIA vs. TOR",
  "headline": "Heat never trail on the way to a 125-103 win over Raptors, keeping playoff hope going",
  "body": "MIAMI -- — When the final whistle blows in Miami on Sunday, the Heat might be in the playoffs. They might also be back in the play-in tournament.\n\n\r\n              As long as they're clicking, Heat coach Erik Spoelstra will like their chances.\n\n\r\n              Nikola Jovic scored 22 points, Jaime Jaquez Jr. had 20 points and nine assists, and the Heat kept hope alive of escaping the play-in tournament by topping the Toronto Raptors 125-103 on Friday night.\n\n\r\n              Bam Adebayo scored 19 points, Tyler Herro scored 18, and Jimmy Butler and Kevin Love each scored 14 for the Heat (45-36). Miami still could get out of the play-in with a win in a rematch against the Raptors on Sunday and some help.\n\n\r\n              \"I'm focused on my team. All I’m focused on (is) we can get to a place where we’re connected and playing for each other and playing a spirited game where it’s to our identity,\" Spoelstra said. \"That’s all I care about right now, because when we get to that, we feel like we can beat anybody, anywhere, any time.”\n\n\r\n              It's the 14th time in Heat history that the team won 45 games in a season; all 13 of the previous squads made the playoffs.\n\n\r\n              RJ Barrett had 35 points and a season-high 11 rebounds for the Raptors, who lost for the 18th time in their last 20 games. Immanuel Quickley scored 15 points, Bruce Brown scored 14 and Kelly Olynyk grabbed 11 rebounds for Toronto.\n\n\r\n              “They're a good team. They were moving the ball. Our first and second efforts were good, actually,” Barrett said. “They just kept going all the way into the shot clock and somehow would find an open 3.”\n\n\r\n              The Heat made 17 3s on Friday, and now will wait until Sunday to learn their playoff — or play-in — fate.\n\n\r\n              Orlando, Indiana, Philadelphia and Miami will finish No. 5, No. 6, No. 7 and No. 8 in the Eastern Conference, in some order. The Magic, Pacers and 76ers are all 46-35; the Heat are 45-36 going into Sunday's finales.\n\n\r\n              Before the Heat-Raptors game went final on Friday, there were other outcomes that affected Miami's playoff possibilities. Philadelphia won its seventh straight game by topping Orlando but remained seventh in the East. Indiana lost to Cleveland, a game that allowed the Cavaliers to clinch a top-four spot in the East.\n\n\r\n              The Heat never trailed, building an 11-point lead after one quarter and stretching it to 19 before settling on a 66-50 lead at the half. The lead eventually reached 25 and no Heat player logged more than 32 minutes.\n\n\r\n              “It matters ... being able to rest, really recoup, get extra treatment, extra recovery and still cheer on your team,” Adebayo said.\n\n\r\n              The loss ensured that Toronto (25-56) will finish the season with the fifth-worst mark in franchise history, regardless of what happens in its finale at Miami on Sunday.\n\n\r\n              It’ll be Toronto’s worst season since going 22-60 in 2010-11.\n\n\r\n              UP NEXT\n\n\r\n              The teams meet again Sunday in Miami to end the regular season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995318.926698
}