{
  "game_id": "0021501211",
  "espn_id": "400829098",
  "date": "Apr 11, 2016",
  "matchup": "PHX vs. SAC",
  "headline": "'Other' Curry has big night in Kings victory over Suns",
  "body": "PHOENIX -- That \"other\" Curry is on quite a roll down the stretch.\nStephen Curry's younger brother Seth had 20 points and tripled his previous career best with 15 assists and the depleted Sacramento Kings beat the Phoenix Suns 105-101 on Monday night.\nCurry played 39 minutes -- eight more than he'd played in any NBA game before -- while the Kings left three of their top players home for \"rest\" -- DeMarcus Cousins, Darren Collison and Rajon Rondo. Curry topped his previous career best of five assists.\nIt was the first double-double of Curry's career, which has been played in the big shadow of his brother.\n\"Seth Curry, let's talk about him tonight,\" Sacramento coach George Karl said. \"Man, he had a highlight game, a highlight film in one game.\"\nIt was Curry's second consecutive 20-point game and third in the past six games.\n\"I had the ball, I was able to make some plays and show a different part of my game,\" he said, \"and guys were doing a great job screening for me, finishing shots, stuff like that so they made me look good.\"\nMirza Teletovic led Phoenix with 26 points. Devin Booker added 22, 18 in the second half when the Suns sliced Sacramento's 17-point lead to two.\nAs far as their chances in the draft lottery go, the Suns were better off losing. Phoenix (22-59) remained one game better than Brooklyn (21-60) in the competition for the fourth- and third-worst record in the league.\nThe Kings led almost all of the game in a matchup of two of the NBA's least successful teams in recent years. It's the sixth straight season the Suns and 10th straight year the Kings have missed the playoffs.\nTrailing 101-99, Phoenix had a chance to tie it after Ben McLemore missed two free throws with 21.3 seconds left, but Booker missed a 14-footer.\nBooker said that miss will stick with him for \"maybe a couple of weeks.\"\n\"A big shot in the game, stuff that I dream about,\" the rookie said. \"It's like failing a dream kind of, but hopefully I get another opportunity to do that. I feel like I need to take that shot. I'm just mad it didn't go in.\"\nSuns interim coach Earl Watson said he knows how upset Booker is about missing the big shot.\n\"We understand that he's 19,\" Watson said. \"Sometimes we forget that. We love Book. ... but he has to miss some shots, too. He can't make every shot.\"\nCurry had 10 points and four assists in the third quarter, when the Kings led by as many as 17.\nMcLemore's 3-pointer put Sacramento up 94-79 with 7:21 to play. But Phoenix responded with a 13-0 run to cut the lead to 94-92 on Teletovic's 3-pointer with 3:12 to play.\nTIP-INS\nKings: Sacramento won the season series 3-1, as it did in 2014-25. ... Curry was one point shy of his career high in points. ... The Kings had 25 assists, the 22nd time in the past 23 games they've had at least 20. ... Rondo leads the NBA in assists at 11.7 per game.\nSuns: Phoenix was without center Tyson Chandler (concussion protocol) and guard Archie Goodwin (left ankle sprain), Suns Ring of Honor member Dan Majerle presented the team's Dan Majerle hustle award to P.J. Tucker, the fourth year in a row Tucker has won the award. ... The 19-year-old Booker is the fourth-youngest player in NBA to score 1,000 points in a season. Only LeBron James, Kobe Bryant and Kevin Durant were younger.\nUP NEXT:\nKings: finish their season Wednesday night at Houston.\nSuns: completes the season by hosting the Los Angeles Clippers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994817.364676
}