{
  "game_id": "0022300624",
  "espn_id": "401585252",
  "date": "Jan 24, 2024",
  "matchup": "MIL vs. CLE",
  "headline": "Antetokounmpo gets triple-double as Bucks beat Cavs 126-116 in 1st game since Griffin was fired",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo made sure the Milwaukee Bucks delivered a win the night after their coach was fired.\n\n\r\n              Antetokounmpo recorded his third triple-double in his last four games and the Milwaukee Bucks defeated Cleveland 126-116 on Wednesday night to snap the Cavaliers’ eight-game winning streak. The victory capped an emotional couple of days following the dismissal of Adrian Griffin on Tuesday.\n\n\r\n              The two-time MVP scored 35 points, matched a season high with 18 rebounds and had 10 assists for his seventh triple-double of the season. Antetokounmpo is one assist shy of having four straight triple-doubles after having 31 points, 10 rebounds and nine assists Saturday in a 141-135 triumph at Detroit.\n\n\r\n              “For a coach like Griff, from Day 1, everything was about togetherness,” Antetokounmpo said. “He was always leading this group into the direction we set at the beginning of the year. Him not being here, at the end of the day, we’re humans. It hurts everybody. \n\n\r\n              \"But we’ve got to keep on moving forward. We have a goal in our head, which is to be the best basketball team that we can be.”\n\n\r\n              Griffin was fired despite going 30-13 in his lone season as coach. Joe Prunty, an assistant on Griffin’s staff, coached the Bucks on Wednesday while team officials were finalizing negotiations with Doc Rivers to eventually take over, a person with knowledge of the negotiations told The Associated Press.\n\n\r\n              “I think our experience really worked in our favor in this situation,” said Damian Lillard, who scored 28 points for the Bucks. “We've all experienced a lot of things. I think this was different for everybody, but I think we just understood we had a game tonight, and it was going to be a tough game against a really good team that kind of handled us the last time we played them.”\n\n\r\n              Prunty has plenty of experience in this role.\n\n\r\n              He went 21-16 with Milwaukee in 2017-18 and also coached the Bucks during their first-round, seven-game playoff loss to the Boston Celtics after the midseason firing of Jason Kidd. Prunty was 2-0 with Atlanta last season after the Hawks fired Nate McMillan and before they hired Quin Snyder.\n\n\r\n              “It’s not easy, but you do have a job to do,” Prunty said. “That’s one of the things that we talked about as a team, just talked about, ‘Look, we still have responsibilities. We still have roles. We still have jobs that we have to do on the court.’ So you just do. You move forward. But it’s not easy. It really isn’t.”\n\n\r\n              Milwaukee has the Eastern Conference’s second-best record, but the Bucks weren’t playing defense nearly as well for Griffin as they had under predecessor Mike Budenholzer.\n\n\r\n              The Bucks’ last loss in Griffin’s 43-game tenure was a 135-95 blowout – their most lopsided defeat of the season – at Cleveland a week ago while Antetokounmpo was out with a bruised right shoulder.\n\n\r\n              Milwaukee looked much better Wednesday while cooling the NBA’s hottest team.\n\n\r\n              Cleveland had trailed for just 35 seconds over its last five games and had three straight wire-to-wire victories, but the Cavaliers never led in this one.\n\n\r\n              “They are a prideful team,” Cavaliers coach J.B. Bickerstaff said of the Bucks. “There's champions over there in that locker room. So we did expect their intensity to be lifted today. Give them credit. They played well.”\n\n\r\n              Khris Middleton added 24 points for the Bucks.\n\n\r\n              Donovan Mitchell had 23 points and Jarrett Allen added 21 points and 12 rebounds for the Cavs. Georges Niang and Max Strus scored 14 points each, Sam Merrill 12 and Isaac Okoro 10.\n\n\r\n              The Cavaliers trailed by as many as 21 in the third quarter and were still behind 103-87 with nine minutes left before cutting the margin to six with 3:44 remaining. Antetokounmpo answered with a dunk to start a 6-1 run that gave the Bucks more breathing room. \n\n\r\n              Cleveland was playing for the first time since backup center Tristan Thompson received a 25-game suspension for violating the NBA’s anti-drug policy by testing positive for ibutamoren and SARM LGD-4033.\n\n\r\n              UP NEXT\n\n\r\n              The Cavaliers and Bucks meet again Friday in Milwaukee.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996127.546201
}