{
  "game_id": "0021800410",
  "espn_id": "401071091",
  "date": "Dec 12, 2018",
  "matchup": "MEM vs. POR",
  "headline": "Conley leads late rally as Grizzlies defeat Portland 92-83",
  "body": "MEMPHIS, Tenn. --  Portland averages 112 points per game. The Memphis Grizzlies' defense wasn't letting the Trail Blazers anywhere near that.\n\nMike Conley scored 23 points and keyed a fourth-quarter outburst as the Grizzlies pulled away for a 92-83 victory over Portland on Wednesday night.\n\nBut it was the Memphis defense that made the difference, as the Grizzlies held Portland well below its season average, with the 83 points marking Portland's season-low for a game -- by 13 points.\n\nLeading-scorer Damian Lillard was held to 14 points -- one of his worst games of the season -- and Portland barely avoided its lowest shooting percentage in a game, hitting only 36.2 percent of its shots.\n\n\"We had trouble scoring,\" Blazers coach Terry Stotts said. \"Part of it was their defense. I thought our offense never really got on track after the first quarter.\"\n\nCJ McCollum matched his season-high with 40 points, or things could have been even worse for Portland. McCollum made 16 shots in the game, half of the Trail Blazers' 32 field goals. Without McCollum, Portland would have shot 27 percent.\n\nBlazers players, like Stotts, acknowledged it was just a bad night.\n\n\"I played bad. I struggled,\" said center Jusuf Nurkic, a major contributor to the Trail Blazers low percentage, making only one of his 15 shots. \"Most of my shots were wide open, and I didn't make them.\"\n\nLillard added: \"They just grind you. They played physical and are a good defensive team. ... They come out aggressive and see what they can get away with.\"\n\nJaren Jackson Jr. finished with 14 points, and MarShon Brooks added 13 as the Grizzlies snapped a two-game losing streak.\n\nDespite the shooting woes, Portland had pulled within 79-78 on a reverse layup by Lillard with 5:27 left. But Memphis rattled off 13 straight points, including eight by Conley, stretching the lead to a game-high 14 points at 92-78, and the Grizzlies coasted home.\n\n\"We were focused and locked-in after we started a little slowly. We put a lot of focus on the defense,\" Jackson said.\n\nCONLEY LIMPING\n\nConley was questionable for the game with left hamstring soreness, and there were times he appeared at less than full speed. \"I don't want to full-on sprint out of nowhere, cause any further damage,\" the Grizzlies point guard said. \"So, I've just been trying -- especially tonight -- to play at a nice pace and save it for more half court. I'm not trying to get up and down and outrun you as much as I might want to.\"\n\nSECOND-QUARTER JOLT\n\nMemphis got out to a poor start, trailing by 11 early. Bickerstaff went to his bench and got a more-spirited performance. \"We got off to a little bit of a sluggish start, but our bench came in and really, really sparked us,\" Bickerstaff said. \"We had a ton of energy there, and everybody kind of fed off it.\" Portland coach Terry Stotts perception of it? \"Well, we had a really good first quarter. The rest of the three quarters were a grind.\"\n\nTIP-INS\n\nTrail Blazers: Maurice Harkless did not play, sitting out the game for rest. ... Portland is in the midst of playing three games in four nights. ... McCollum missed all five of his 3-pointers in Tuesday's loss to Houston. And he missed two more before connecting from long range late in the second quarter. That was only the second 3-pointer in the half for Portland. ... Lillard, the league's fourth-leading scorer, has reached double figures in every game this season.\n\nGrizzlies: Coach J.B. Bickerstaff drew a technical in the first quarter when he complained about a no-call he believed was goaltending. ... Marc Gasol started 2 of 11 from the field, and ended the game 4 of 15. ... The Grizzlies have held all but three opponents this season under their scoring average, including the Trail Blazers, who entered the game averaging 112 points a game.\n\nUP NEXT\n\nTrail Blazers: Host Toronto on Friday\n\nGrizzlies: Host the Miami Heat on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994935.094882
}