{
  "game_id": "0021900055",
  "espn_id": "401160697",
  "date": "Oct 30, 2019",
  "matchup": "CLE vs. CHI",
  "headline": "Love, Thompson lead Cavaliers past Bulls 117-111",
  "body": "CLEVELAND -- A year after losing their first six games, the Cleveland Cavaliers are putting a scare into other people during the first week of this season.\nKevin Love, who had 17 points and 20 rebounds in Cleveland's 117-111 over Chicago on Wednesday night, went with the Halloween theme while sitting at his locker talking to reporters following the game.\nLove donned a hockey mask in honor of Jason, the evil character from the \"Friday the 13th\" movies. He also arrived at the arena before the game wearing the mask.\n\"I know my scary movies,\" said Love. \"That's my favorite scary movie.\"\nCleveland, which has split its first four games didn't get its second win until its 13th game last season.\nLove and Tristan Thompson, who had 23 points 10 rebounds, have had double-doubles in each of Cleveland's four games.\n\"We're just feeding off each other,\" Love said. \"We talk every day that we need to set the tone for the rest of the team.\"\nLove's basket on a goal-tending call on Lauri Markkanen gave Cleveland a 91-90 lead early in the tightly played fourth quarter. His jumper from the left wing put the Cavaliers ahead 110-106 with just under a minute to play.\nCollin Sexton, who sat most of the third quarter because of foul trouble, scored 10 points in the final eight minutes, including a dunk over Chicago center Wendell Carter Jr. following an assist from Love on Cleveland's next possession.\nCleveland's first-year coach John Beilein's goal to establish a homecourt advantage for his rebuilding team is off to a good start. The Cavaliers won their home opener over Indiana and rallied to beat the Bulls.\n\"We talked about that today,\" Beilein said. \"We want it to be special for us. The goal always is to win at home. We want to continue that trend to have people watch us grow.\"\nSexton had 18 points, a day after the Cavaliers exercised his third-year contract option.\nMarkkanen and Zach LaVine each scored 16 points for Chicago, which has lost three straight. Carter and Otto Porter Jr. added 15 apiece.\nThe Bulls, who allowed 15 consecutive points in the fourth quarter of Monday's loss to New York, saw another game get away.\n\"As the game went on, their energy grew and ours didn't,\" coach Jim Boylen said. \"They drove it at us and they rebounded us and brought the physicality you need in the fourth quarter. We battled, but we haven't played as well in key moments as I hoped they would.\"\nChicago went on a 15-0 run to take a 21-11 lead in the first quarter, but led only 53-50 at halftime.\nSexton picked up his fourth foul early in the third quarter and sat out most of the period. Cleveland hit five 3-pointers, including three by Cedi Osman. Jordan Clarkson was fouled while making a 3-pointer from the corner and converted the free throw.\nTIP-INS\nBulls: F Chandler Hutchison (strained left hamstring), who is rehabilitating his injury with the G-League's Windy City Bulls, will rejoin the team Thursday in order to gauge his progress. ... C Cristiano Felicio was a healthy inactive for the fifth straight game. He is the only player on the roster not to play a minute this season.\nCavaliers: Love tied a franchise record for rebounds in a half with 16 in the first two quarters. ... Rookie G Dylan Windler has increased his activity as he returns from a stress reaction in his lower left leg that occurred before training camp. Windler, taken with the 26th pick of the first round, is shooting and participating in on-court drills.\nMAJOR SLAM\nSexton, who is listed at 6-foot-1, dunked over the 6-10 Carter during Cleveland's spurt that clinched the game, a highlight that surely will be replayed countless times.\n\"I was going to try and lay it in and I thought, I might as well dunk it,\" Sexton said.\nTIME TO WIN\nCarter started and played 27 minutes, despite waking up in the morning with eye inflammation.\n\"You hear people talking about us being a playoff team, but that's all people hollering about something that's really far away,\" he said after the Bulls fell to 1-4. \"We need to focus on winning the next game.\"\nUP NEXT\nBulls: Host Detroit on Friday. Chicago has only played once at home in its first five games this season.\nCavaliers: Travel to Indiana on Friday. Cleveland beat the Pacers 110-99 in its home opener Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996338.292477
}