{
  "game_id": "0022300857",
  "espn_id": "401585485",
  "date": "Mar 01, 2024",
  "matchup": "CLE @ DET",
  "headline": "Mobley, Garland lead short-handed Cavaliers past Pistons, 110-100",
  "body": "DETROIT -- — Darius Garland hit eight 3-pointers and scored 29 points, Evan Mobley had 22 points and 17 rebounds and the short-handed Cleveland Cavaliers held off the Detroit Pistons 110-100 on Friday night.\n\n\r\n              Playing without Donovan Mitchell (knee soreness) and Caris LeVert (elbow), Cleveland led 77-52 in the third quarter, but only scored 19 fourth-quarter points, allowing the Pistons to get as close as 107-100. The Cavaliers improved to 39-20.\n\n\r\n              Garland was 8 of 12 from 3-point range and 1 of 9 on 2-pointers.\n\n\r\n              “It felt really good coming out of my hand tonight,” Garland said. “We were missing two big pieces of our team, so I had to be super aggressive.”\n\n\r\n              Cade Cunningham led the Pistons with 21 points and 10 assists, and Isaiah Stewart had 16 points and nine rebounds. Detroit has lost seven of eight to fall to 9-50.\n\n\r\n              “I'm not happy with the outcome,” Pistons coach Monty Williams said. “There were a number of lapses with the second unit. I have to figure out a (bench) combination that can play the way we want to play.”\n\n\r\n              Cleveland led by 15 points at halftime and started the third quarter with a 14-4 run to go up 77-52. Garland hit two 3-pointers in the run, making him 8 for 9.\n\n\r\n              “When he's hitting like that, it means people have to chase him and make tough decisions,” Cavaliers coach J.B. Bickerstaff said. “If you want to trap him or if you want to switch, it creates advantages for us in other places.”\n\n\r\n              The Cavaliers led 91-70 at the end of the third, having hit 50% (16-32) of their 3-pointers and only 34% (11-32) of their 2-point attempts.\n\n\r\n              The Pistons cut it 103-93 with 4:53 to play, but couldn't get any closer until Jalen Duren's free throws pulled them within eight with 2:30 left.\n\n\r\n              Garland answered with his first 2-pointer of the game and the Cavaliers were able to run out the clock.\n\n\r\n              “You have to give them a ton of credit,” Bickerstaff said. “I think it is extremely difficult, what they are going through, but they play hard no matter the score.”\n\n\r\n              Cleveland dominated the first half from behind the arc. They outscored Detroit 39-9 on 3-pointers, including six from Garland, and led by as many as 26 points before the Pistons got within 63-48 at the half.\n\n\r\n              “I think we were too far back on him at times, but he hit some tough shots,” Pistons rookie Ausar Thompson said about Garland. “I didn't like that. I don't like feeling like that.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host New York on Sunday night.\n\n\r\n              Pistons: At Orlando on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996726.904501
}