{
  "game_id": "0021500398",
  "espn_id": "400828285",
  "date": "Dec 19, 2015",
  "matchup": "OKC vs. LAL",
  "headline": "Durant leads Thunder over Lakers 118-78",
  "body": "OKLAHOMA CITY -- Kobe Bryant may not have made the difference. Either way, the Oklahoma City Thunder had little trouble with the Los Angeles Lakers on Saturday\nWith Bryant out with a sore right shoulder, the Thunder stars had their way. Kevin Durant had 22 points and eight rebounds, Russell Westbrook had 13 points and 11 assists and Oklahoma City beat the Lakers 118-78 for its eighth straight home victory.\nEnes Kanter had 19 points and 14 rebounds, and Westbrook had his 18th double-double of the season for Oklahoma City. The Thunder won for the fifth straight time against the Lakers.\n\nThe Lakers' point total was their second-lowest this season and the lowest by an Oklahoma City opponent since the Thunder beat the Miami Heat 93-75 on March 22. The Thunder led by as many as 46 points and flirted with breaking their record for margin of victory, which is 45 points.\n\"We just tried to make the right play every time down and defensively, we just tried to cover for each other,\" Durant said. \"We came in at halftime and coach (Billy Donovan) said we've got to still stick with our principles and still play the game the right way and I think we did a good job.\"\nWith Bryant out, the Lakers started seldom-used rookie Anthony Brown in his place. Lou Williams scored 20 points and Jordan Clarkson added 15 for Los Angeles, but the Lakers lost for the 15th time in 17 games.\nBryant sat in street clothes on the Lakers' bench while Durant and Westbrook quickly took control for Oklahoma City.\nFacing the inexperienced Brown, Durant went 5 of 7 from the field in the first half and hit both of his 3-point attempts. His first came a little more than 3 minutes into the game to cap an 8-0 Thunder run.\nDurant scored 14 first-quarter points to help the Thunder lead 35-15 at the quarter's end. The Thunder had seven dunks in the first half, three of them alley-oops from Westbrook to Steven Adams. Meanwhile, the Lakers threw five passes out of bounds, and the Thunder led 67-41 at halftime.\nThe Lakers came no closer than 25 points in the second half and Westbrook and Durant spent the entire fourth quarter on the bench.\nLos Angeles coach Byron Scott said the Lakers looked \"scared\" and \"intimidated\" against Oklahoma City.\n\"The guys on the court have to learn from it,\" Scott said. \"They didn't play well at all and really just got embarrassed by the way we played tonight. Like I told them, I said it was pathetic in every area. We didn't come to compete. They just played harder than we did. It just looked like we were in awe of that team.\"\nTIP-INS\nLakers: Scott coached the then-New Orleans Hornets (now Pelicans) during their two-season stay in Oklahoma City (2005-06 and 2006-07) and said he has fond memories of that time. ... The Lakers' final road game of the season will be in Oklahoma City on April 11. ... Brown's first career start came in his sixth career appearance. He finished with four points on 2-of-9 shooting.\nThunder: The Thunder will play the Lakers in Los Angeles on Wednesday, two days after facing the Los Angeles Clippers on the road. ... Official Zach Zarba called a technical foul on the Thunder's Serge Ibaka with 26.9 seconds left in the second quarter and Kanter received a technical with 1:38 left in the game. ... The Thunder wore their alternate sleeved jerseys.\nKOBE SITS OUT\nThe Lakers announced about 90 minutes before the game that Bryant wouldn't play due to the sore shoulder. Bryant said afterward he'd played through the pain \"the last couple of games ... but this morning, I got up and it was pretty sore.\"\nThe 37-year-old Bryant dunked for the first time this season on Thursday night against the Houston Rockets. He said he thought the injury happened before that but added \"I'm sure that didn't help.\"\nThe soreness was in the same shoulder in which Bryant suffered a torn rotator cuff last season. But he doesn't think it will be a long-term problem and expects to play on Tuesday night against the Denver Nuggets.\n\"That was pretty heavy-duty surgery I had this summer, so I think it's kind of logical to expect it to be sore at some point,\" Bryant said. \"I've just got to get ahead of it, just rest it and come back.\"\nEven on the bench, Bryant remained the focus of conversation. Durant had dinner with Bryant on Friday night and said before the game that Bryant's 20-year NBA run, all with one team, was \"the type of career you want to have when you come into this league.\n\"For a guy to finish the way he wants to finish, more than half his life as an NBA player, that's an accomplishment in itself,\" Durant said. \"If he would've never won championships or MVPs, he still played 20 years in this league. It's amazing. Not too many people can say that.\"\nUP NEXT:\nLakers: Visit Denver on Tuesday night.\nThunder: Visit Los Angeles Clippers on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994191.0274482
}