{
  "game_id": "0022400350",
  "espn_id": "401704916",
  "date": "Dec 08, 2024",
  "matchup": "DEN @ ATL",
  "headline": "Nikola Jokic scores 48 points as Nuggets rout Hawks 141-111",
  "body": "ATLANTA -- — Nikola Jokic scored 48 points and the Denver Nuggets never trailed in their 141-111 win over the Atlanta Hawks on Sunday night.\n\n\r\n              The Nuggets snapped a two-game losing streak that included Saturday night's 122-113 loss at Washington, ending the Wizards' 16-game losing streak. Jokic scored a career-high 56 points in the loss.\n\n\r\n              Jokic kept up his hot shooting against Atlanta and added 14 rebounds and eight assists. Michael Porter Jr. matched his season high with 26 points.\n\n\r\n              De'Andre Hunter led Atlanta with 20 points. Hunter was escorted to the locker room midway through the third quarter after he was hit on his head on a blocked shot by Aaron Gordon, who was not called for a foul, but returned\n\n\r\n              Dyson Daniels added 18 points and Trae Young had 15 points and 10 assists for the Hawks.\n\n\r\n              Jamal Murray was sidelined with a hamstring injury.\n\n\r\n              Takeaways\r\n              Nuggets: Denver set season highs with 43 assists, including 11 by Russell Westbrook, and 62.9% shooting from the field (56 of 89). \n\n\r\n              Hawks: Hunter has scored at least 20 points in six of his last seven games, including four in a row.\n\n\r\n              Key moment\r\n              After trailing 45-25, the Hawks made a surge that cut Denver's lead to 51-39. The Nuggets used two of Porter's six first-half dunks to reclaim their momentum and led 71-48, their biggest lead of the game, at halftime.\n\n\r\n              Key stat\r\n              The Nuggets made 21 of 44 shots in the first half (61.4%). The Hawks, meanwhile, were on pace to match their worst shooting mark of the season by making 17 of 51 shots (33.3%).\n\n\r\n              Up next\r\n              Denver returns home to face the Los Angeles Clippers on Friday, and Atlanta plays at the New York Knicks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998261.383987
}