{
  "game_id": "0022200981",
  "espn_id": "401469136",
  "date": "Mar 07, 2023",
  "matchup": "BKN @ HOU",
  "headline": "Bridges has 30 points, Nets beat Rockets for 3rd straight",
  "body": "HOUSTON -- — Mikal Bridges scored 30 points, Spencer Dinwiddie added 23 and the Brooklyn Nets had a big third quarter to beat the Houston Rockets 118-96 on Tuesday night for their third straight victory. \n\n\r\n              Bridges has scored 30 or more points in three straight games and five times overall since coming over from Phoenix on Feb. 9 in the deal that sent Kevin Durant to the Suns. Bridges also had five assists, two blocks and a steal.\n\n\r\n              Brooklyn coach Jacque Vaughn raved about his new star.\n\n\r\n              “He is very unselfish,” Vaughn said. “He gives up his time, his knowledge in the locker room, during the games. So it's really been a joy to be around and learn him as an individual.” \n\n\r\n              Brooklyn has its longest winning streak since a season-high 12-game run from Dec. 7-Jan. 8. The Nets also had their third double-digit win in a row. \n\n\r\n              Jalen Green had 25 points for the Western Conference-worst Rockets, who were coming off consecutive wins over San Antonio.\n\n\r\n              “I was disappointed with the turnovers and with the assists frankly,” coach Stephen Silas said. “And some of our shot selection wasn't great. We've got to do better.” \n\n\r\n              Brooklyn was up by 14 after a 33-point third quarter and pushed it to 18 early in the fourth before a 3 by rookie Jabari Smith Jr. cut the lead to 96-81.\n\n\r\n              But Brooklyn scored the next seven points, with a 3 from Bridges and capped by an alley-oop dunk by Nic Claxton, to make it 103-81 with nine minutes left. \n\n\r\n              Brooklyn was up by 5 at halftime and used a 16-3 run to push the lead to 75-57 midway through the third quarter. Claxton had two dunks in that stretch and Dinwiddie had a 3-point play and a 3-pointer to allow the Nets to pull away. \n\n\r\n              The Nets had an 18-point lead later in the third quarter after a 3-pointer by Joe Harris before the Rockets used a 5-2 spurt, with a 3 from Smith, to cut the lead to 89-74. \n\n\r\n              Brooklyn was up 92-78 entering the fourth. \n\n\r\n              Houston led by many as 11 in the first half, but the Nets had taken a 59-54 lead by halftime. \n\n\r\n              “We made an adjustment as far as just shrinking the floor more, putting more bodies in front of the basketball,” Vaughn said. “So that was huge on our defensive end of the floor then that allows us to get out and run a little bit.” \n\n\r\n              TIP-INS\n\n\r\n              Nets: Ben Simmons missed his seventh straight game with left knee and back soreness. … Claxton had 18 points and 13 rebounds. … Royce O’Neal had 11 points and 11 rebounds off the bench. \n\n\r\n              Rockets: Alperen Sengun had 16 points and 12 rebounds. … Smith scored 15. … Houston made just 7 of 25 3-pointers. \n\n\r\n              UP NEXT\n\n\r\n              Nets: At Milwaukee on Thursday night.\n\n\r\n              Rockets: At Indiana on Thursday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994856.476585
}