{
  "game_id": "0022201183",
  "espn_id": "401469338",
  "date": "Apr 04, 2023",
  "matchup": "DEN @ HOU",
  "headline": "Rockets prevent Nuggets from clinching West with 124-103 win",
  "body": "HOUSTON -- — Jalen Green scored 32 points, six others scored in double figures and the last-place Houston Rockets prevented the Denver Nuggets from clinching the No. 1 seed in the Western Conference with a 124-103 victory in their home finale on Tuesday night.\n\n\r\n              Denver entered Tuesday three games ahead of Memphis for the top spot in the Western Conference with four games remaining for both teams. At 19-60 entering Tuesday, the Rockets stood 33 1/2 games behind Denver’s 52-26 record.\n\n\r\n              But none of that mattered to the upstart Rockets, hoping to end a rocky season on a positive note.\n\n\r\n              “When we stay together as a team, feed off each others’ energy and just play hard, the sky’s the limit,” Green said. “We competed with the best in the NBA.”\n\n\r\n              Denver had a sluggish start to the fourth quarter, making just one field goal in the first five minutes. Houston went on a 16-4 run in that stretch.\n\n\r\n              Running away with the game late, the young Rockets went on a dunking spree, firing up the Toyota Center crowd for the home finale. After the fourth dunk of the quarter, a thunderous, two-handed windmill dunk in transition from Tari Eason, Nuggets coach Michael Malone called timeout with 5:33 remaining in the game and pulled his starters.\n\n\r\n              “If that’s how we’re going to play, we’ll be out in the first round,” Malone said after the game. “When we don’t do our jobs, there’s accountability. And I speak the truth. I just called our team, ‘soft,’ and I dared someone to challenge me. No one did, because we as a group were soft tonight. I’m not saying we are soft, but tonight, we were.”\n\n\r\n              The Rockets outscored the Nuggets 38-18 in the fourth quarter.\n\n\r\n              Alperen Sengun had 20 points, 10 rebounds and seven assists, Kevin Porter Jr. had 20 points and nine assists, and Jabari Smith Jr. had 16 points and 13 rebounds. Eason added 11 points off the bench for Houston.\n\n\r\n              “There was a lot of defensive activity, the guys were in the right spots, they were making it hard on them,” Rockets coach Stephen Silas said. “I thought (Sengun) had the best defensive game of his career.”\n\n\r\n              Michael Porter Jr. led Denver with 23 points, and Nikola Jokic had 14 points and 10 rebounds in 25 minutes. After missing three games with right calf tightness, Jokic also added a sloppy eight turnovers and went 7 for 13 from the field. Aaron Gordon added 13 points, nine rebounds and four blocks.\n\n\r\n              “We started the game OK, but we just lost it,” Jokic said. “The whole game was in their favor. Even when we were finding open shots, we couldn’t make shots. We didn’t make free throws, they were blocking our shots, we had a huge amount of turnovers — it was a one-sided game.”\n\n\r\n              As for coming back from his brief absence, the two-time MVP said he “felt good — just didn’t play good.”\n\n\r\n              Nuggets guard Jamal Murray left the game early in the second quarter with a right thumb sprain. He was listed as questionable with the same injury and was ruled out late in the third quarter. In nine minutes, he had two points and four assists.\n\n\r\n              Malone said the team would be smart in deciding whether Murray can play again in the remaining three regular-season games.\n\n\r\n              With the Rockets finishing the last two games of the season on the road, Houston finished the season 14-27 at home.\n\n\r\n              Denver had won the previous 10 meetings.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Kentavious Caldwell-Pope had a team-low 23 points in the plus-minus category and Jokic was at -21. … PF Zeke Nnaji missed a second straight game with a right knee sprain.\n\n\r\n              Rockets: F Jae’Sean Tate remained out with left knee soreness.\n\n\r\n              HE SAID IT\n\n\r\n              “Fun level was at an all-time high. Before the game, we were talking about how we wanted to put on a show and end this home stretch with a win. Everyone had good energy, played hard and we came out with a dub.” -- Jalen Green\n\n\r\n              ¡GOL!\n\n\r\n              Soccer star Houston Dynamo FC midfielder Héctor Herrera made his pregame free throw, earning a $5,000 donation for the Rockets Clutch City Foundation. Herrera is captain of both the Dynamo and the Mexican national team.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Visit Phoenix on Thursday night. \n\n\r\n              Rockets: Finish the season with a road trip to Charlotte and Washington on Friday and Sunday, respectively.",
  "source": "espn_api",
  "crawled_at": 1764994673.76283
}