{
  "game_id": "0021500635",
  "espn_id": "400828522",
  "date": "Jan 20, 2016",
  "matchup": "HOU vs. DET",
  "headline": "Andre Drummond misses NBA-record 23 free throws in Pistons' win",
  "body": "HOUSTON -- Detroit's Andre Drummond wouldn't say whether he realized he set an NBA record by missing 23 free throws Wednesday night against the Houston Rockets.\nHe was more focused on the big picture than on his shortcomings.\n\"We won the game today,\" he said when asked about the record.\nKentavious Caldwell-Pope and Marcus Morris each scored 22 points, and the Pistons beat the Rockets 123-114, despite Drummond's 23 missed free throws.\n\nDrummond set a career high and franchise record by attempting 36 free throws on a night he was intentionally fouled 21 times. The previous record for most misses was 22, set by Wilt Chamberlain on Dec. 1, 1967. His 36 attempts were third-most in league history, behind two 39-attempt games by Dwight Howard.\nThe 23 misses were more than Stephen Curry has all season (22 on 237 attempts).\n\"It wasn't a chess match, it was just they wanted to foul and we let them foul,\" Pistons coach Stan Van Gundy said.\nThe Hack-A-Shaq tactic allowed the Rockets to take the lead in the third quarter, when they did it 12 straight times, but it didn't help them close the gap in the fourth, when Drummond went out for good with 5½ minutes left after seven hacks in the quarter and Detroit leading 107-94.\n\"It didn't work,\" interim coach J.B. Bickerstaff said. \"That's it. That's all I have to say about that.\"\nBut Van Gundy had plenty to say on the subject, talking for several minutes about the NBA and commissioner Adam Silver refusing to outlaw it.\n\"That's the game the league wants, so that's what fans get to watch,\" Van Gundy said.\nDrummond shot a little bit better in the fourth quarter than he did earlier in the game, making 6 of 12 attempts.\n\"I'm not going to miss them all,\" he said. \"I've worked on it enough where I'm going to build a rhythm, and over time I ended up getting one.\"\n\nJames Harden had his first triple-double of the season and seventh of his career, with 33 points, a career-high 17 rebounds and 14 assists in the loss.\nDrummond finished with 17 points and 11 rebounds.\nThe Rockets scored the first five points of the fourth quarter to cut the lead to one, but Detroit used a 14-2 run to push it to 99-86 with eight minutes left.\nHouston again resorted to intentionally fouling Drummond soon after that, hacking him seven times in the next 2½ minutes. He made 4 of 10 free throws in that stretch, and Morris added four points to keep the Pistons ahead 107-94.\nHouston was playing without starting point guard Patrick Beverley, who was out with an ankle injury, and lost Howard one minute into the game with a sprained ankle.\nThe Rockets opened the second half by intentionally fouling Drummond. They started it by having little-used K.J. McDaniels foul five straight times in the first nine seconds of the third quarter to get the Pistons into the bonus. Several Rockets took turns patting Drummond, who entered the game shooting 35.4 percent from the line, to get fouls called after that.\nAfter the 12th straight foul by the Rockets, Drummond went to the bench.\nHe made just 5 of 16 free throw attempts in that span, and Houston scored 13 points, with two 3-pointers from Corey Brewer, to shave a nine-point halftime deficit to 61-60.\nA hook shot by Clint Capela soon after that put the Rockets up 62-61 for their first lead of the night.\nThe Rockets led by 3 after a layup from Brewer midway through the third before Detroit scored nine straight points, capped by a 3-pointer from Caldwell-Pope, to take a 74-68 lead.\nTIP-INS\nPistons: Reggie Jackson added 17 points. ... Ersan Ilyasova had 18 points and six rebounds. ... The Pistons led by as many as 17.\nRockets: Beverley said his left ankle sprain is mild and that he hopes to return on Friday. ... Ty Lawson started in place of Beverley for his first start since Nov. 16 and had a season-high 18 points. ... Jones added 18 points.\nDEJA VU\nVan Gundy said that Wednesday night reminded him of one of the games where Howard attempted an NBA-record 39 free throws because of intentional fouls when the two were with the Magic.\n\"When Mark Jackson was in Golden State, Dwight shot 39 that night, so Andre was short of that,\" Van Gundy said with a laugh. \"So that game was like that, too. We won that one, too.\"\nHARDEN BIG NIGHT\nHarden's big game made him the first player to have at least 33 points, 17 rebounds and 14 assists in a game since Chamberlain had 53 points, 32 rebounds and 14 assists for Philadelphia against the Lakers on March 18, 1968, according to statistics provided by the Rockets from the Elias Sports Bureau.\nUP NEXT\nPistons: Visit New Orleans Thursday.\nRockets: Host Milwaukee Friday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994628.6944158
}