{
  "game_id": "0021900605",
  "espn_id": "401161247",
  "date": "Jan 15, 2020",
  "matchup": "BKN @ PHI",
  "headline": "Harris scores 34, leads Sixers past Nets 117-106",
  "body": "PHILADELPHIA --  At the start of the season, the Philadelphia 76ers said that they would bank their NBA title hopes on a “BullyBall” formula of physical defense and inside presence.\n\nIn a tight game in the fourth quarter on Wednesday night, that mixture worked to perfection.\n\nTobias Harris scored 34 points, including two big baskets in the final two minutes that proved to be the difference, as the 76ers beat the Brooklyn Nets 117-106.\n\nThe 76ers held the Nets to just 16 fourth-quarter points on 6-of-23 (26.1%) shooting.\n\n“When we got together in the huddle before the fourth quarter, we said that we were going to have to hold them to under 20 points to win the game,” said Harris, who scored 24 points in the second half on 9-of-13 shooting.\n\nOn the offensive end, Philadelphia was 10 of 19 from the floor and took advantage of a three-guard lineup that Brooklyn was forced to use.\n\nBen Simmons had 20 points and 11 assists for the 76ers, who improved to 19-2 at home. On the road, the 76ers are 7-14 and have lost six straight games -- a slide that has caused them to fall to the sixth spot in the Eastern Conference standings.\n\nMeanwhile, Brooklyn has lost nine of its last 11 overall and six straight away from home. The Nets were led by Spencer Dinwiddie’s 26 points and eight assists. Jarret Allen had 17 points.\n\n“That’s been the issue for us all year,” Nets head coach Kenny Atkinson said. Not being able to score in the fourth quarter efficiently. It follows a trend. We played well for three quarters and had a ton of good looks. We were getting to the rim, but we weren’t finishing.”\n\nNeither side was able to gain complete control of the game, with the largest lead being a seven-point Brooklyn advantage late in the first half.\n\nHarris, however, gave the Sixers offensive life in the second half. With the score 106-104 with two minutes to play, Harris hit a leaning 3-pointer that rattled in just as the shot clock ran out that proved to be a back-breaker.\n\n“I think every shot I throw up is going in,” Harris said. “But when I saw it go in, I was happy.”\n\nJosh Richardson had 15 points and Furkan Korkmaz added 15 off the bench. Al Horford had 14 points and eight rebounds for the Sixers.\n\nThe Nets received 15 points from Taurean Price and 14 from Kyrie Irving, who struggled in just his third game back from right shoulder impingement in going 6 of 21 from the floor and recording a minus-29 overall.\n\nTIP-INS\n\nSixers: Joel Embiid was on the floor for Philadelphia before the game, shooting shots with his right hand while wearing a big cast on his left hand to protect his torn radial collateral ligament. “He's engaged with his team,” Sixers head coach Brett Brown said. “What that means in relation to his time frame I don't know. But I don't think we're going overboard in relation to doing anything we haven't done in the past.” Embiid suffered the injury on Jan. 6 against Oklahoma City. He was originally scheduled to see a specialist in one to two weeks and could miss upwards of six weeks.\n\nNets: Center DeAndre Jordan was declared out at halftime after suffering a dislocated right middle finger late in the first half when he was going up to attempt to block a Ben Simmons layup. Jordan -- who had signed with Brooklyn in the off-season in part to offset the loss of Kevin Durant as the prized free agent rehabilitates from his right Achilles injury -- had scored four points and grabbed three rebounds in 10 minutes. “He’s going to be examined (on Thursday),” Atkinson said after the game. For the season, Jordan is averaging 8 points and 9.7 rebounds in 37 games.\n\nUP NEXT\n\nSixers: Hosts Chicago Bulls on Friday night.\n\nNets: Host Milwaulee Bucks on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996711.791088
}