{
  "game_id": "0022201172",
  "espn_id": "401469327",
  "date": "Apr 02, 2023",
  "matchup": "PHX @ OKC",
  "headline": "Kevin Durant scores 35 points, Suns roll past Thunder",
  "body": "OKLAHOMA CITY -- — Kevin Durant scored 35 points and the Phoenix Suns held off the Oklahoma City Thunder 128-118 on Sunday night for their fifth straight victory.\n\n\r\n              Durant — once a hero in Oklahoma City after leading the Thunder to the 2012 NBA Finals, but roundly booed nearly every time he touched the ball Sunday — scored 13 points in the fourth quarter and blocked a shot at the rim by Shai Gilgeous-Alexander. That helped Phoenix hold the lead after Oklahoma City cut a 15-point deficit to three as the Suns improved to 6-0 with Durant in the lineup.\n\n\r\n              Devin Booker added 22 points and 10 assists for Phoenix, which shot 56.8% from the field to match its season high. Deandre Ayton had 19 points and 11 rebounds and Chris Paul had 16 points and eight assists. Phoenix remained fourth in the Western Conference standings.\n\n\r\n              “There’s not a way that he can’t score,” Phoenix coach Monty Williams said about Durant. “Those kind of players – they want those (clutch) shots. They’re so used to having the ball in their hands. I wouldn’t call it a luxury, because I don’t want to disrespect those moments. Guys work their tails off to be ready for those shots and he and Booker are a case in point. That’s what Kevin does.”\n\n\r\n              Oklahoma City, which is battling for a spot in the NBA’s play-in tournament, lost for the third time in its last four games despite 39 points from Gilgeous-Alexander. The Thunder remained in the final play-in spot — 10th — a game ahead of the Dallas Mavericks, who lost to the Atlanta Hawks in overtime.\n\n\r\n              The Thunder led Phoenix seven points in the first quarter and were tied 27-27 entering the second quarter, but Oklahoma City surrendered a 42-point second quarter, matching the highest total by any opponent this season.\n\n\r\n              A 3-pointer by Isaiah Joe with 5:19 left pulled Oklahoma City to 109-106, but Durant hit a 3-pointer and Ayton followed with a put-back to make it 114-106 with 4:33 left. The Thunder came no closer than five points after that.\n\n\r\n              “We’ve got a week left in the regular season, and if (we) bring the same level of focus, competitiveness, physicality, execution (and) game plan … we’ll be able to lay our head on the pillow at night,” Oklahoma City coach Mark Daigneault said. “I just thought we played at a really high level today and they were just a better team on this day.”\n\n\r\n              HONOR AND GRATITUDE\n\n\r\n              Williams was an assistant for the Thunder on Feb. 10, 2016, when his wife, Ingrid, died in a traffic accident in Oklahoma City.\n\n\r\n              After his pregame news conference Sunday, Williams took time to thank members of the Thunder organization — including general manager Sam Presti and Ayana Lawson, the team’s vice president of community and lifestyle services — for their continued support.\n\n\r\n              “We lost my wife here, and this city, and in particular, this organization, wrapped their arms around me and my family and they continue to do so, led by Sam Presti, the ownership here and Ayana Lawson,” Williams said. “Today would have been my wife’s birthday and they chose to honor my wife today by not allowing anybody to sit in her seats.\n\n\r\n              “When I found out this morning, it really messed me up because it really speaks to how blessed I am to do what I do and work for the people I work for and other people that I know and how much they care. … For them to do that today really speaks to this organization and this city.”\n\n\r\n              QUOTABLE\n\n\r\n              Williams said he doesn’t understand why Oklahoma City fans continue to boo Durant, who left the Thunder in July 2016 to sign with the Golden State Warriors.\n\n\r\n              “I’m still surprised about (why) so many people boo him here,” Williams said. “This fan base is one that I respected for a long time. I get it, you lose a guy like Kevin, but I think. at some point, you have to appreciate what he meant to this organization. … He loves this city. He knows what Sam (Presti) and this organization meant to him. I hope someday that they can appreciate him.”\n\n\r\n              TIP-INS\n\n\r\n              Suns: Phoenix’s Damion Lee is one of 11 finalists for the NBA’s Twyman-Stokes Teammate of the Year Award, which recognizes the player deemed the best teammate based on selfless play, on- and off-court leadership as a mentor and role model to other NBA players, and commitment and dedication to team.\n\n\r\n              Thunder: Gilgeous-Alexander, one of the league’s top free-throw shooters at 90.6% entering the game, finished 17 of 17. ... Josh Giddey scored 16 points.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host San Antonio on Tuesday night.\n\n\r\n              Thunder: At Golden State on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995059.911508
}