{
  "game_id": "0021900550",
  "espn_id": "401161192",
  "date": "Jan 07, 2020",
  "matchup": "OKC @ BKN",
  "headline": "Paul carries Thunder in 4th and OT of victory over Nets",
  "body": "NEW YORK --  Chris Paul kept dribbling through traffic, always trying to get to that old familiar spot from where he has punished opponents for 15 years.\n\nEvery time he did, one of his teammates had the same thought.\n\n\"It's a bucket,\" reserve Abdel Nader said. \"He's been doing it all year, especially at the end of games.\"\n\nPaul scored 20 of his 28 points in the fourth quarter and overtime, leading the Oklahoma City Thunder to a 111-103 victory over the Brooklyn Nets on Tuesday night.\n\nThe game was tied at 103 before Paul made consecutive mid-range jumpers, the shot he repeatedly knocked down in the fourth quarter. The Nets never scored again. Shai Gilgeous-Alexander closed out the scoring with four free throws, after making a jumper to open OT.\n\nGilgeous-Alexander added 22 points for the Thunder, who bounced back from a loss Monday in Philadelphia to win for the sixth time in seven games. Steven Adams had 10 points and 18 rebounds as Oklahoma City wrapped up a 3-1 road trip without Danilo Gallinari, who rested a calf injury.\n\n\"We fought hard and we knew this was a big game,\" Paul said, \"and we always say you can't win them all without winning the first one or the second one or whatnot, and we wanted to go home 3-1. So, good win.\"\n\nTaurean Prince scored 21 points and Caris LeVert had 20 in his second game back from right thumb surgery, but the Nets dropped their seventh straight. Spencer Dinwiddie had 14 points, but he struggled early and late in a 6 for 21 night.\n\nThe Nets had a seven-point lead with under 3 1/2 minutes left in regulation before Paul scored 10 points in a 12-5 surge that tied it at 101 on his jumper with 47 seconds left. He lost the ball on a drive with 11 seconds remaining to give the Nets a chance, but Dinwiddie missed a free throw after getting fouled before the inbound pass, then was off on a short jumper before the buzzer.\n\n\"Obviously the two last shots are very disappointing because we had a chance to win. That's extremely disheartening,\" Dinwiddie said. \"My teammates trusted me to make those plays and I didn't. This one is on me for sure.\"\n\nPrince made his first five shots, including four 3-pointers, but the Thunder got the better of it when the teams went to their benches and opened an eight-point lead in the second quarter before taking a 49-48 lead to the locker room.\n\nDinwiddie, who started 0 for 7, and LeVert then scored eight apiece in the third, carrying Brooklyn to a 77-74 lead going to the final period. That was all ruined by 1-for-8 shooting in OT.\n\n\"We played some really good basketball. That's the shame about it,\" Nets coach Kenny Atkinson said. \"The defense was pretty good. Obviously, Chris Paul hit some tough, big shots at the end of the game. But we scored, I think, two points in overtime. Our offense is just not where it needs to be.\"\n\nTIP-INS\n\nThunder: Coach Billy Donovan said Gallinari was sore and he wanted to rest the forward for the busy month ahead. Oklahoma City plays 17 games in January and doesn't have a single stretch of more than one day off in between games. ... Dennis Schroder finished with 14 points but was just 5 for 15.\n\nNets: Kyrie Irving missed his 25th straight game with his right shoulder injury. Coach Kenny Atkinson said he and his point guard are on the same page about the injury, even though Irving said Saturday he had bursitis in the shoulder and Atkinson had previously denied a report that he did. ... The Nets began a stretch of seven home games out of eight, and won't even require a flight for the lone road game, a trip to Philadelphia for a Jan. 15 game.\n\nRUSSELL'S RETURN\n\nDonovan wasn't ready to ponder the thoughts of a rested Russell Westbrook making his first trip back to Oklahoma City on Thursday. Houston coach Mike D'Antoni plans to rest Westbrook on Wednesday in Atlanta so he'll be fresh for the second night of a back-to-back. \"We're worried about Brooklyn right now,\" he said before the game. \"We'll cross that bridge when we get there.\"\n\nTOO CHALLENGING?\n\nDonovan predicted that the coach's challenge, added this season on a one-year experimental basis, wouldn't return next season. He said it leaves coaches second-guessing themselves over when to use it, because they only get one even if their challenge was correct.\n\n\"My guess would be is you're probably going to have a lot of the league is going to vote to not have it, would be my guess,\" Donovan said.\n\nUP NEXT\n\nThunder: Return home to face Houston on Thursday.\n\nNets: Host Miami on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996226.715822
}