{
  "game_id": "0021600841",
  "espn_id": "400900247",
  "date": "Feb 15, 2017",
  "matchup": "HOU vs. MIA",
  "headline": "Whiteside helps Heat beat Rockets 117-109",
  "body": "HOUSTON --  Hours after getting a pep talk from former Heat center Alonzo Mourning, Hassan Whiteside came through with a big game on both ends of the court.\n\nWhiteside had 23 points, 14 rebounds and five blocks to help Miami beat the Houston Rockets 117-109 on Wednesday night.\n\nThe 27-year-old Whiteside said Mourning called him in the morning and told him he wanted to see him block as many shots as he could.\n\nHeat coach Erik Spoelstra liked what he saw from his young 7-footer.\n\n\"When he plays with that level of physicality and effort and focus, it's plain to see that we are a much different basketball team,\" Spoelstra said. \"He played at his highest level, imposing his size and physicality on both sides of the court.\"\n\nDion Waiters added 23 points, nine rebounds and seven assists, and Goran Dragic had 21 points for the Heat, who ended a two-game skid that followed a 13-game win streak. Miami got back to winning by defeating the same team where that long winning streak started Jan. 17.\n\n\"Guys are coming together,\" Whiteside said. \"Guys are a family and our hearts are in the right place. We've been jelling.\"\n\nDating back to last season, Whiteside has recorded at least 20 points, 10 rebounds and five blocks in a game eight times. Entering the day, no other player had more than three such games over that span.\n\n\"When you have a big fellow behind you and you know that he's going to block the shot or at least he's going to contest it, it helps,\" Dragic said. \"He just had an amazing night.\"\n\nJames Harden had 38 points 12 rebounds and 12 assists for his 15th triple-double of the season to lead the Rockets, who lost for the second time in seven games. For the first time all season, the Rockets played in a game where they never held a lead.\n\nMiami shot 13 for 35 on 3-pointers, while Houston was 13 for 40. The Rockets have lost eight of 12 this season when failing to make more 3-pointers than their opponent and 36-10 when having more.\n\n\"We just didn't shoot the 3s at all in the first half and dug ourselves in a big hole,\" Rockets coach Mike D'Antoni said. \"Then everything has to go right and you know, things don't go right, then the game's over. We're going to have clunkers and that was a clunker.\"\n\nThe Rockets' defense struggled without guard Patrick Beverley, who suffered a strained groin early in the second quarter. His backup, Corey Brewer, played 27 minutes and finished with four points.\n\nMiami led 58-45 at halftime and built a lead as big as 20 points in the third quarter before Houston started making shots and trimmed the deficit late.\n\nSpoelstra said the two straight losses entering Houston served as a timely eye-opener before the break.\n\n\"There's no easy way for this basketball team, but it started with everybody being open to the truth and holding each other accountable for the last two games,\" Spoelstra said. \"That has to be how we have to play and commit to that.\"\n\nMiami enters the break 25-32, two games behind Detroit for the final playoff spot in the Eastern Conference.\n\nAt 40-18, Houston holds the third spot in the West behind Golden State and San Antonio.\n\n\"We let a couple of games slip up, but we've got an opportunity for guys to get some rest and get their minds right and be ready to go for this push,\" Harden said.\n\nTIP-INS\n\nHeat: SG Josh Richardson remained sidelined with a sprained left foot but is expected to return for the first game after the All-Star break. ... Whiteside briefly greeted a courtside spectator, Rockets Hall of Famer Hakeem Olajuwon at midcourt before the game.\n\nRockets: Harden was honored during a brief pregame ceremony for being a starter for the Western Conference in this weekend's All-Star Game at New Orleans. ... PF Ryan Anderson was called for a technical foul for yelling at an official late in the fourth quarter on a play in the paint where his shot was blocked by Whiteside.\n\nBIG MEN GET NO RESPECT?\n\nAfter being told that Carmelo Anthony was announced as the replacement for the injured Kevin Love on the Eastern Conference All-Star team, Whiteside said he was hopeful that a center would have been picked.\n\n\"Big men are always going to be a big part of the game,\" Whiteside said. \"That's why I didn't understand that they took the center spot out. Whoever came up with that idea, I don't know why they came up with that.\"\n\nOTIS HONORED\n\nAs part of the Rockets' ongoing celebration of the franchise's 50th season, the team honored former big man Otis Thorpe. In six seasons in Houston between 1988-89 and 1994-95, Thorpe won one championship and played in an All-Star Game, averaging 15.6 points and 9.5 rebounds per game during his time with the Rockets.\n\nUP NEXT\n\nHeat: At Atlanta on Feb. 24 in their first game after the All-Star break.\n\nRockets: At New Orleans on Feb. 23.",
  "source": "espn_api",
  "crawled_at": 1764995755.43902
}