{
  "game_id": "0021900859",
  "espn_id": "401161501",
  "date": "Feb 25, 2020",
  "matchup": "OKC @ CHI",
  "headline": "Schroder helps Thunder top Bulls 124-122",
  "body": "CHICAGO --  When it comes to close games on the road, the Oklahoma City Thunder like their chances.\n\nIt helps to have a pair of guards like Chris Paul and Dennis Schroder.\n\nSchroder scored 21 points and made a huge defensive play in the fourth quarter, helping the Thunder top the Chicago Bulls 124-122 on Tuesday night for their fourth consecutive win.\n\nOklahoma City (36-22) blew a 24-point lead but recovered in time to earn its ninth straight victory on the road, breaking a Thunder record. Danilo Gallinari scored 24 points, Shai Gilgeous-Alexander had 21 points and 11 rebounds, and Paul finished with 19 points and nine assists.\n\n\"I think they understand that it's just not going to be smooth sailing on the road. There's going to be challenges,\" Oklahoma City coach Billy Donovan said, \"and I think that when it gets hard, our guys really, really kind of pull together.\"\n\nThe Thunder also improved to 17-9 in games decided by six points or less.\n\n\"We looked up at the clock around five minutes and we (were) like `All right, let's get to it,\" Paul said. \"Some of the better teams that I've been on, you sort of had that mentality.\"\n\nGallinari's driving dunk put Oklahoma City ahead to stay with 1:39 left. Schroder then drew a charge on Zach LaVine and Paul converted a layup to give the Thunder a 117-114 lead with 1:03 remaining.\n\nSchroder also had nine points in the final period on 3-for-5 shooting.\n\n\"Every game we're playing, we think we can win the game,\" he said. \"So if it's a close game, you know, everybody's engaged, try to get stops and that's what we did tonight.\"\n\nChicago had one more chance in the final seconds, but LaVine missed a 3-point attempt as time expired.\n\nThe Bulls wasted a pair of stellar performances from LaVine and rookie reserve Coby White. LaVine scored 27 of his 41 points in the second half, and White had a career-high 35 in his third consecutive game over 30 points.\n\nChicago (20-39) lost for the ninth time in 10 games.\n\n\"Teams are jumping on us, and we're not responding,\" LaVine said. \"Then we figure it out, but sometimes, it's too little, too late.\"\n\nOklahoma City committed 26 turnovers and trailed by as many as 26 in a 109-106 win over Chicago on Dec. 16. The Paul-led rally helped kick-start the Thunder season.\n\nThis time, Oklahoma City got off to a fast start.\n\nLed by Gallinari, the Thunder opened the game with a 20-4 run. They went 11 for 17 from 3-point range and led by as many as 24 on their way to a 72-55 lead at the break.\n\n\"We had a frustrated group at halftime and they responded, and I'm happy about that,\" Bulls coach Jim Boylen said.\n\nTIP-INS\n\nThunder: F Darius Bazley missed his fifth straight game with a bruised right knee. Donovan said there is no timetable for his return. ... It was Oklahoma City's highest-scoring first half of the season. ... Gallinari went 5 for 10 from beyond the arc in his team-best fourth game with at least five 3s.\n\nBulls: Shaquille Harrison scored 11 points, and Tomas Satoransky had 10 points and seven assists. ... The Bulls shot 53.6% (52 for 97) from the field.\n\nWORTH NOTING\n\nLaVine and White became the second pair of Chicago teammates to score at least 30 points in consecutive games, according to the Elias Sports Bureau, joining Bob Love and Chet Walker in 1969. White became the first reserve in team history to collect 30-plus points in three straight games.\n\n\"All the hard work is paying off, I guess,\" White said.\n\nUP NEXT\n\nThunder: Host Sacramento on Thursday night. The Thunder are 31-12 against the Kings since the franchise moved to Oklahoma City.\n\nBulls: Visit New York on Saturday. They split the first two games in the season series against the Knicks.\n\n---\n\nJay Cohen can be reached at https://twitter.com/jcohenap\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996201.451464
}