{
  "game_id": "0021800250",
  "espn_id": "401070931",
  "date": "Nov 20, 2018",
  "matchup": "MIA vs. BKN",
  "headline": "Russell, Nets add to Miami's home misery, top Heat 104-92",
  "body": "MIAMI --  The only 3-pointer that the Miami Heat made in the fourth quarter came with just about a minute to go, when Rodney McGruder connected from the right corner.\n\nProblem is, he stepped out of bounds first.\n\nAnd that sums up things right now for the Heat.\n\nThe Brooklyn Nets were more than happy to add to Miami's home woes. D'Angelo Russell scored 20 points, Jarrett Allen had 13 points and 14 rebounds and the Nets prevailed 104-92 on Tuesday night -- handing Miami a fifth consecutive home loss.\n\n\"We just played great defense the whole game,\" Nets coach Kenny Atkinson said. \"I know it wasn't pretty.\"\n\nHe's right.\n\nThen again, the Nets didn't need style points.\n\nSpencer Dinwiddie scored 16 points for Brooklyn, which held the Heat to 36 percent shooting. Joe Harris and DeMarre Carroll each added 11 for the Nets and Rondae Hollis-Jefferson scored 10 as Brooklyn avenged a home loss to Miami last week.\n\n\"We wanted to be the aggressor,\" Russell said. \"Honestly, we owed them one after they came out and gave it to us last time.\"\n\nHassan Whiteside had 21 points and 23 rebounds for Miami. No Heat team has ever had a home losing streak of five or more games and went on to make the playoffs.\n\n\"We still believe in ourselves,\" Whiteside said.\n\nThe Heat couldn't make much of anything all night, especially in the fourth quarter. They were 0 for 7 from 3-point range in the fourth, 7 for 13 from the free-throw stripe in that period -- and were 4 for 19 from the floor overall in those 12 minutes, with the game on the line. And for the game, Miami was just 25 for 60 inside the paint.\n\n\"Missed shots, those will happen,\" Heat coach Erik Spoelstra said. \"Again, that seemed like we missed quite a few in the paint. We had some point-blank opportunities.\"\n\nJosh Richardson scored 16 and McGruder finished with 15 for Miami. Justise Winslow added 10 and Dwyane Wade returned from a seven-game absence because of the birth of his daughter to score five points.\n\nMiami was leading 42-39 at halftime. To say either team was \"winning\" at that point would be a stretch.\n\nIt was the lowest-scoring half of the season for each team. The 81 combined points represented the lowest-scoring first half of any NBA game this season, and both teams went into intermission shooting 33 percent.\n\nThe Heat missed their first eight shots of the game, then opened the second quarter on a 14-0 run while the Nets missed nine consecutive shots. After three minutes of the second quarter, the Heat were shooting 25.7 percent -- which not only had them in the lead, it also outpaced the Nets' 22.2 percent rate to that point.\n\n\"You can definitely see guys not playing just free with their game,\" Wade said. \"We're overthinking at times. In this game, you don't want that. You just want to play.\"\n\nTIP-INS\n\nNets: Brooklyn's first five field-goal attempts were from 3-point range. ... The 13 points allowed by the Nets in the first quarter represented their low for any quarter this season. ... Russell also had nine rebounds and six assists.\n\nHeat: Miami was again without Goran Dragic (knee) and didn't have Tyler Johnson, who strained his hamstring in practice Monday. ... Winslow made his first four shots. ... Whiteside got the 10th 20-20 game of his career.\n\nCHILLY START\n\nThe 81 first-half points between the two teams doesn't even beat three separate quarters (Utah 47, Golden State 37; Minnesota 46, Dallas 37; and Golden State 46, Washington 37) in the NBA this season. And Golden State also had a 92-point half by itself against Chicago earlier this season.\n\nDINWIDDIE'S KICKS\n\nThe sneakers that Dinwiddie wore were a tribute to Wade, part of the Nets guard's seasonlong effort to raise money by playing with artwork on his feet. Tuesday's were a tribute to Wade -- with \"One Last Dance\" written across the tongues, as well as a No. 3 and some Miami-themed palm trees. Dinwiddie is auctioning off his game-worn shoes to benefit various charities that support youth causes all season.\n\nUP NEXT\n\nNets: Visit Dallas on Wednesday.\n\nHeat: Visit Chicago on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995262.37521
}