{
  "game_id": "401809995",
  "espn_id": "401809995",
  "date": "Oct 30, 2025",
  "matchup": "OKC vs WSH",
  "headline": "Gilgeous-Alexander scores 31 as the Thunder defeat the Wizards 127-108 and improve to 6-0",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 31 points, and the Oklahoma City Thunder improved to 6-0 by beating the Washington Wizards 127-108 on Thursday night.\n\n\r\n              Reserve Ajay Mitchell added 20 points for the Thunder. He made all six of his free throws and has been perfect on 19 attempts from the line this season.\n\n\r\n              Isaiah Joe, who missed Oklahoma City’s first five games with a knee bruise, scored 20 points and made five 3-pointers for a team that entered the night last in the league in 3-point percentage at 28.8%.\n\n\r\n              Oklahoma City forced 22 turnovers and had only six. Cason Wallace led the Thunder with four steals and Alex Caruso had three.\n\n\r\n              CJ McCollum had 19 points and Bilal Coulibaly added 16 for Washington, which lost its third straight and fell to 1-4.\n\n\r\n              Despite their perfect record, all isn't well for the defending NBA champion Thunder.\n\n\r\n              Oklahoma City general manager Sam Presti announced earlier in the day that guard Nikola Topic had been diagnosed with testicular cancer and is undergoing chemotherapy.\n\n\r\n              Other health issues have been present throughout the season, too. Oklahoma City was again without injured star forwards Chet Holmgren and Jalen Williams. Holmgren has missed the past two games with lower back soreness. Williams hasn’t played this season while recovering from offseason surgery on his right wrist.\n\n\r\n              As has been the case in these early weeks, Oklahoma City conducted business as usual.\n\n\r\n              The Thunder closed the first half on a 15-5 run to take a 59-49 lead at the break. Gilgeous-Alexander had 20 points in the first half and Joe added 14.\n\n\r\n              Washington cut its deficit to 83-81 late in the third, but Oklahoma City closed the quarter on a 9-3 run. A 3-pointer by Jaylin Williams in the final second of the period put the Thunder up 92-84.\n\n\r\n              Oklahoma City's largest lead was 24 points in the fourth quarter.\n\n\r\n              Up next\r\n              Washington: Hosts the Orlando Magic on Saturday.\n\n\r\n              Oklahoma City: Hosts the New Orleans Pelicans on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042530.498451
}