{
  "game_id": "0022300953",
  "espn_id": "401585581",
  "date": "Mar 13, 2024",
  "matchup": "ATL @ POR",
  "headline": "Simons has 36 and Ayton has 33 in Portland's 106-102 win over the Hawks",
  "body": "PORTLAND, Ore. -- — Anfernee Simons scored 36 points and the Portland Trail Blazers held off the Atlanta Hawks for a 106-102 victory on Wednesday night. \n\n\r\n              DeAndre Ayton added a season-high 33 points and 19 rebounds for Portland, which had lost four of its last five games. It was Ayton's sixth straight double-double. \n\n\r\n              “Coming into these games I'm trying to do everything,” Ayton said. “Not only just my requirement, my role for this team, but do a lot more. And that's where I'm at. I'm more dominant.”\n\n\r\n              Dejounte Murray had 40 points, one shy of his season high, for the Hawks in the first of an 11-day, five-game road trip, the team's longest of the season.\n\n\r\n              The Blazers trailed by as many as 16 points in the first half but closed the gap in the third quarter and led 82-75 going into the final period. \n\n\r\n              The Hawks pulled within 95-91 on Murray's 3-pointer. Simons' 3 gave Portland a 99-93 cushion, but Clint Capela answered with a dunk and a layup to make it 101-97. \n\n\r\n              After Murray's layup for Atlanta with 1:22 left, Simons missed a floater. Matisse Thybulle blocked Bogdan Bogdanovic on the other end, keeping Portland in front, and Simons made free throws with 22.2 seconds left to make it a four-point game. \n\n\r\n              Murray's 3-pointer got Atlanta within 103-102 with 17.1 seconds to go. Ayton made the first of two free throws and Portland hung on for the victory. \n\n\r\n              “Whether I'm like the bad guy or not, I'm trying to be great. I'm trying to be a winner in this league. I'm trying to be known as that guy,” Ayton said. You're around me, you're going to learn how to win.\" \n\n\r\n              The Hawks have been hit by injuries. The latest was Saddiq Bey, who tore the ACL in his left knee during Sunday night's 116-103 loss to New Orleans. In his second season with the Hawk, Bey was averaging 13.7 points and 6.5 rebounds. \n\n\r\n              Bogdan Bogdanovic played for Atlanta despite an illness the team announced earlier in the Day, and he finished 3-for-15 from the floor with eight points and seven rebounds. Jalen Johnson was out with a sprained right ankle. \n\n\r\n              Hawks coach Quin Snyder said in the third quarter the Blazers were able to make 3-pointers, while Ayton made mid-range jumpers and contested shots. Simons finished with five 3s. \n\n\r\n              “Obviously a tough loss, we came out in the game playing very well,\" Snyder said. \"You knew they were find a groove and start making some shots, and they made a lot of them.”\n\n\r\n              For Portland, Jerami Grant was out with a sore right hamstring, joining a list of absent Trail Blazers that included Malcolm Brogdon (right elbow) and Shaedon Sharpe (abdominal surgery). Rookie Scott Henderson was on a minutes restriction. \n\n\r\n              The Blazers were wrapping up a six-game homestand with back-to-back games against the Hawks and the New York Knicks on Thursday night. \n\n\r\n              De’Andre Hunter's layup capped a 15-0 run in the first half that gave the Hawks a 33-17 lead. Simons hit a 3-pointer that closed the gap to 52-47 at halftime. \n\n\r\n              Murray led all scorers in the first half with 24 points on 10 of-13 shooting. He had four 3-pointers and finished with six. \n\n\r\n              Dalano Banton's 3-pointer pulled Portland within 58-57 in the third quarter and the Blazers pulled ahead moments later on Ayton's jumper.\n\n\r\n              “Wasn't crazy about our first half, wasn't crazy about our start. But we talked about it at halftime, we looked at a few things, and we picked it up,” Blazers coach Chauncey Billups said. “Physicality, our defensive awareness picked up and offensively we were able to rebound and kind of run and break free a little bit. ”\n\n\r\n               UP NEXT\n\n\r\n              Hawks: Visit the Jazz on Friday night. \n\n\r\n              Trail Blazers: Host the Knicks on Thursday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996272.3112462
}