{
  "game_id": "0022401017",
  "espn_id": "401705583",
  "date": "Mar 21, 2025",
  "matchup": "OKC vs. CHA",
  "headline": "Shai Gilgeous-Alexander scores 30 and Thunder with 5th straight, 141-106 over Hornets",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 30 points and the Oklahoma City Thunder won their fifth in a row, 141-106 over the Charlotte Hornets on Friday night.\n\n\r\n              Gilgeous-Alexander, the NBA’s top scorer at 33.0 points per game, returned to the lineup after sitting out Wednesday night's lopsided win against Philadelphia. He made 13 of 18 shots to go with six rebounds and nine assists before sitting out the fourth quarter.\n\n\r\n              Chet Holmgren added 14 points, five rebounds and three blocks for Oklahoma City, which clinched the No. 1 seed in the Western Conference for the second consecutive season when Milwaukee beat the Lakers on Thursday. \n\n\r\n              Isaiah Hartenstein had 12 points and 10 rebounds for the Thunder, who played without injured starters Lu Dort and Jalen Williams. Oklahoma City led 66-49 at halftime after Kenrich Williams banked in a 29-foot shot at the buzzer, and 103-76 after three quarters.\n\n\r\n              Miles Bridges scored 20 points and Nick Smith Jr. added 14 for Charlotte, which played without injured starters LaMelo Ball (ankle) and Mark Williams (foot).\n\n\r\n              Ball and Williams combined for 44 points the night before in a win over the New York Knicks. The Hornets have lost six games by 30 or more points in the last month.\n\n\r\n              Takeaways\r\n              Hornets: Charlotte relied on the long ball to keep this one close until the third quarter, connecting on 19 of 41 from 3-point range (46.3%).\n\n\r\n              Thunder: Oklahoma City's depth helped the team surpass last season's win total and improve to 26-1 against the East.\n\n\r\n              Key moment\r\n              Charlotte pulled within 75-65 on a 3-pointer by DaQuan Jeffries. Following a timeout, Oklahoma City responded with a 20-3 run to make it 95-68 with 3:37 left in the third. \n\n\r\n              Key stat\r\n              Oklahoma City outscored the Hornets 64-26 in the paint.\n\n\r\n              Up next\r\n              The Hornets visit Miami on Sunday night, and the Thunder visit the Clippers the same day.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997498.3522189
}