{
  "game_id": "0022300887",
  "espn_id": "401585515",
  "date": "Mar 05, 2024",
  "matchup": "BKN vs. PHI",
  "headline": "Schroder and Finney-Smith each score 20 in Nets' 112-107 win over the short-handed 76ers",
  "body": "NEW YORK -- — The Brooklyn Nets were quickly down double digits to a Philadelphia team missing both its All-Stars.\n\n\r\n              They lost to a team decimated by injuries a night earlier. If they're serious about a playoff push, the Nets know they can't be losing winnable games.\n\n\r\n              “This is our fourth quarter of our season, so we have to challenge each other,” interim coach Kevin Ollie said. “We can’t let any games slip and we’ve got to take care of business.”\n\n\r\n              Dennis Schroder and Dorian Finney-Smith made sure they got Tuesday's game, scoring 20 points apiece in 112-107 victory over the 76ers.\n\n\r\n              Lonnie Walker IV added 19 points and Nic Claxton had 17 points and 10 rebounds for the Nets, who bounced back quickly after a poor performance Monday in a 106-102 home loss to Memphis. They took advantage of a short-handed Philadelphia team with guard Tyrese Maxey scratched early Tuesday because of a concussion. \n\n\r\n              Mikal Bridges scored 15 points and Finney-Smith had 12 in the fourth quarter for the Nets, who play their next six — and 10 of their next 11 — on the road, with Barclays Center hosting college basketball tournament games. \n\n\r\n              Kelly Oubre Jr. scored a season-high 30 points for the 76ers, who had won two straight. Tobias Harris added 18. \n\n\r\n              Maxey banged his head on a player's knee after slipping in the third quarter Sunday at Dallas and finished the game, but was then showing symptoms and was evaluated Tuesday. The team said he was diagnosed with a mild concussion.\n\n\r\n              So the starting backcourt was Cam Payne, who scored 15 points, and Kyle Lowry, who had 14 while making his third start after signing with his hometown team last month. The 76ers remain without leading scorer Joel Embiid after knee surgery.\n\n\r\n              “I think we did play pretty well and I keep saying in these kinds of circumstances — again, we’re still not super-organized for obvious reasons — you’re going to have to play good to give yourselves a chance,” 76ers coach Nick Nurse said. “We gave ourselves a chance tonight but again, you can’t make so many probably glaring mistakes like those were.” \n\n\r\n              Philadelphia led 92-84 after Oubre's 3-pointer with 8:45 remaining, but the Nets scored the next 11 points, with Claxton's dunk and free throw making it 95-92. Oubre ended the run with a basket, but Dennis Smith Jr. had a steal and 360-degree spin for a dunk, then Finney-Smith and Schroder combined for Brooklyn's next 11 points. \n\n\r\n              The Nets were without former 76ers All-Star Ben Simmons and Cam Thomas, then played the second half without starting forward Cam Johnson because of a sprained right ankle. He was hurt when he was fouled by Lowry while making a 3-pointer in the first quarter. \n\n\r\n              The 76ers made seven of their first eight shots and led by 14 early in the second. But a fired-up Schroder scored eight straight Brooklyn points after taking exception to a foul by Lowry and exchanging words with his counterpart, leading to technical fouls for both. \n\n\r\n              The last basket of his flurry gave the Nets a one-point lead and the 76ers were ahead 57-56 at halftime after Payne made two free throws with 1.1 seconds remaining. \n\n\r\n              “Coach’s been telling us to respond. That’s something he’s been challenging us to do, stick together when things get bad when things aren’t going our way and we’re not making shots,” Finney-Smith said. “And they came out and hit us in the face first, but we responded well. And sometimes you need stuff like that with Dennis and Lowry to get guys going, and it definitely got us going.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Memphis on Wednesday.\n\n\r\n              Nets: Visit Detroit on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996330.644296
}