{
  "game_id": "0022300786",
  "espn_id": "401585414",
  "date": "Feb 14, 2024",
  "matchup": "SAC @ DEN",
  "headline": "Fox scores 30 points, rallies Kings from 16 down for 102-98 victory over Nuggets",
  "body": "DENVER -- — De’Aaron Fox had 30 points, eight assists and eight rebounds, Domantas Sabonis had 20 points and 13 rebounds, and the Sacramento Kings rallied from a 16-point, second-half deficit to beat the Denver Nuggets 102-98 Wednesday night in the final game for both teams before the NBA All-Star break.\n\n\r\n              The win was the Kings’ second in a five-day stretch against the Nuggets, who they had defeated 135-106 last Friday in Sacramento.\n\n\r\n              “We know our destiny is still in our hands, but at the end of the day we’ve got to get it,” Kings coach Mike Brown said. “And when you have less than 30 games (left) in the season, things start to get tight and every game matters for us.”\n\n\r\n              Coming off a 40-point effort in a loss the previous night against the Phoenix Suns, Fox ignited his team’s comeback. He scored 15 points in the fourth quarter, including one stretch in the final 2:02 in which he had a personal 8-0 run that turned a one-point deficit into a seven-point lead.\n\n\r\n              It was Fox’s fifth game this season with at least 15 points in the fourth quarter, tied for the third-highest total in the league.\n\n\r\n              “When your entire bench and everybody out there on the court with you have that confidence in you for you to go make a play, I can’t help but have confidence in myself,” Fox said. “Sometimes, it doesn’t go my way. That’s fine, but tonight it went my way and we were able to grind out this win.”\n\n\r\n              It was Sabonis’ 37th consecutive game with at least a double-double. Harrison Barnes added 20 points for the Kings while making six of his nine field-goal attempts.\n\n\r\n              The reigning NBA champion Nuggets entered the game with a 21-4 record at home this season, the second-best mark in the league. The loss was their third in a row, matching their longest skid of the season.\n\n\r\n              Aaron Gordon had 25 points and season-high 15 rebounds for Denver. Nikola Jokic had an uncharacteristically poor night, missing 11 of his 17 shots and finishing with 15 points, his lowest scoring output in a game since Jan. 7.\n\n\r\n              “We have a bullseye on our back now,” Nuggets coach Michael Malone said. “For 82 games, we’re going to get everybody’s best, from a team in Sacramento or from teams that may be down in the standings. There are no easy nights for us.”\n\n\r\n              Aided by the cold shooting and carelessness of Sacramento, which shot 34.8% from the field and had 11 turnovers in the first half, the Nuggets stormed out to a 62-46 lead in the third quarter. The lead was down to three by the end of the period and Sabonis’ layup with 4:56 remaining in the game gave the Kings took their first lead of the night.\n\n\r\n              Denver was without starting guards Jamal Murray (tibia inflammation) and Kentavious Caldwell-Pope (hamstring tendinosis). Murray is the team’s second-leading scorer at 20.5 points per game and the team’s top 3-point shooter, making 41.1% of his shots from beyond the arc this season.\n\n\r\n              “We’re not healthy,” Malone said. “We have the best five-man starting unit in the league. The last three games we haven’t had those five guys together. I think it’s more of that.”\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host the Washington Wizards on Feb. 22\n\n\r\n              Kings: Host the San Antonio Spurs on Feb. 22\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996785.4517708
}