{
  "game_id": "401810213",
  "espn_id": "401810213",
  "date": "Dec 07, 2025",
  "matchup": "TOR vs BOS",
  "headline": "Celtics play the Raptors, seek 5th straight win",
  "body": "Boston Celtics (14-9, fifth in the Eastern Conference) vs. Toronto Raptors (15-9, third in the Eastern Conference)\n\n\r\n              Toronto; Sunday, 3:30 p.m. EST\n\n\r\n              BOTTOM LINE: Boston will attempt to extend its four-game win streak with a victory over Toronto.\n\n\r\n              The Raptors are 13-5 against Eastern Conference opponents. Toronto averages 116.5 points and has outscored opponents by 3.0 points per game.\n\n\r\n              The Celtics are 10-6 against Eastern Conference opponents. Boston ranks sixth in the Eastern Conference shooting 36.6% from 3-point range.\n\n\r\n              The Raptors make 48.6% of their shots from the field this season, which is 4.3 percentage points higher than the Celtics have allowed to their opponents (44.3%). The Celtics are shooting 47.3% from the field, 1.0% higher than the 46.3% the Raptors' opponents have shot this season.\n\n\r\n              TOP PERFORMERS: Brandon Ingram is shooting 46.2% and averaging 20.8 points for the Raptors. Immanuel Quickley is averaging 31.0 points over the last 10 games.\n\n\r\n              Jaylen Brown is averaging 29 points, 6.1 rebounds and 4.9 assists for the Celtics. Derrick White is averaging 5.0 made 3-pointers over the last 10 games.\n\n\r\n              LAST 10 GAMES: Raptors: 6-4, averaging 111.9 points, 42.7 rebounds, 29.7 assists, 10.0 steals and 3.9 blocks per game while shooting 47.0% from the field. Their opponents have averaged 111.1 points per game.\n\n\r\n              Celtics: 8-2, averaging 122.1 points, 43.4 rebounds, 25.5 assists, 8.2 steals and 5.4 blocks per game while shooting 50.6% from the field. Their opponents have averaged 113.0 points.\n\n\r\n              INJURIES: Raptors: RJ Barrett: out (knee), Ochai Agbaji: day to day (personal).\n\n\r\n              Celtics: Jayson Tatum: out (achilles).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042770.725704
}