{
  "game_id": "0022000065",
  "espn_id": "401267225",
  "date": "Dec 31, 2020",
  "matchup": "SAC @ HOU",
  "headline": "Wall makes Houston debut, Rockets beat Kings 122-119",
  "body": "HOUSTON -- — John Wall had 22 points and nine assists in his first game since 2018, James Harden had a big finish to score 33 points and the Houston Rockets beat the Sacramento Kings 122-119 on Thursday night.\n\n\r\n                    Late in the fourth, Wall found Harden in transition for a deep 3-pointer that gave Houston a one-point lead. The two celebrated with a high-five at midcourt.\n\n\r\n                    “It was cool,” said Wall, who cited the 735 days since his last game in postgame interviews. “It was great to get our first win. My job is to help James as much as possible and to try and make it easier for him.”\n\n\r\n                    Sacramento cut Houston’s lead to 118-117 with 22.4 seconds remaining on Tyrese Haliburton’s 3-pointer, but Harden answered with two free throws. Sacramento missed two close 3s in the final seconds.\n\n\r\n                    Harden also had eight assists and six rebounds in the first of a two-game set with the Kings. They will meet again Saturday in Houston.\n\n\r\n                    “We’ve just got to keep building now,” Harden said. “It’s very difficult to beat the same team two times in a row so we know how important it is to be locked in and stay focused.”\n\n\r\n                    The Rockets were playing their first game with Wall, DeMarcus Cousins and Eric Gordon, who missed the first two games due to COVID-19 health and safety protocols. Houston’s scheduled opener on Dec. 23 against Oklahoma City after COVID-19 quarantine protocols depleted the roster below the eight players required by the NBA to play a game.\n\n\r\n                    “We were kind of in and out of the game throughout the game,” said Rockets coach Stephen Silas, given the game ball by Wall after his first career win as head coach. “We had our highs and our lows but were keeping our composure and fighting back and dealing with adversity -- all of those things, we did tonight.”\n\n\r\n                    Wall, acquired from Washington for Russell Westbrook, scored his first points since Dec. 26, 2018, on a thunderous left-handed dunk in transition. Wall looked explosive on several drives to the basket and dunks in his first game back from a ruptured Achilles tendon.\n\n\r\n                    Cousins came off the bench and quickly drained a 3-pointer for his first basket since June 13, 2019. In 14 minutes, Cousins had eight points and three assists in his Rockets debut.\n\n\r\n                    Christian Wood had 21 points and 12 rebounds, and Gordon added 17 points.\n\n\r\n                    Harrison Barnes led the Kings with 24 points, De’Aaron Fox and Richaun Holmes each had 22, and Buddy Hield added 19.\n\n\r\n                    DOUBLE STUFFED\n\n\r\n                    Early in the third quarter, Harden threw an alley-oop in transition that appeared to be dunked through the basket simultaneously by both Wood and Danuel House Jr. The points were attributed to Wood.\n\n\r\n                    “He thought the points should’ve went to him,” Wood said. “If they could give them to both of us, I would’ve been happy with that, too.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: SG DaQuan Jeffries suffered a Grade 3 left ankle sprain during 4-on-4 play Tuesday and will miss at least six weeks, the Kings said Wednesday. . PF Jabari Parker (back stiffness) remained sidelined and has yet to make his season debut.\n\n\r\n                    Rockets: Houston was hosting its first regular-season home game since March 10, before COVID-19 derailed last season. There were masked fans in attendance, but far below 25% capacity and only about a dozen fans sitting courtside. ... KJ Martin and Ben McLemore remain away from the team and are self-isolating per COVID-19 protocols.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997202.7192562
}