{
  "game_id": "0022000387",
  "espn_id": "401267547",
  "date": "Feb 10, 2021",
  "matchup": "LAC @ MIN",
  "headline": "Clippers beat Timberwolves 119-112, spoil Towns' return",
  "body": "MINNEAPOLIS -- — Kawhi Leonard had a season-high 36 points and Lou Williams added 27 points off the bench as the Los Angeles Clippers defeated Minnesota 119-112 on Wednesday night and spoiled the return of Timberwolves star Karl-Anthony Towns.\n\n\r\n                    Leonard and Williams hit shots down the stretch, including a pair of late 3-pointers by Leonard, to thwart Minnesota’s comeback try. Los Angeles snapped its first two-game losing streak of the season.\n\n\r\n                    After trailing by six at halftime, the Clippers outscored Minnesota 33-20 in the third quarter as Los Angeles pulled away.\n\n\r\n                    “We kind of turned it up in that second quarter and third quarter,” Leonard said. “We needed a better fourth quarter, but I'm happy we got the win.”\n\n\r\n                    Towns had 18 points and 10 rebounds in his return to action after missing 13 games. Towns announced on Jan. 15 that he tested positive for COVID-19 and remained on the league’s health and safety protocol list until Wednesday, when coach Ryan Saunders said Towns was a game-time decision.\n\n\r\n                    “I thought he competed,” Saunders said. \"His wind was good; 18 and 10 coming back from a layoff like he did was a good night for him.”\n\n\r\n                    Towns detailed his bout with COVID in his postgame comments, noting that underlying conditions made his battle with the virus especially tough. His mother, Jacqueline, died from virus complications last April.\n\n\r\n                    “I'm a high-risk case. COVID did not treat me well whatsoever,\" Towns said. “A lot of scary nights. My dad called me 24/7.”\n\n\r\n                    Wednesday was Towns' first game in nearly a month. He last played on Jan. 13.\n\n\r\n                    “I was just smiling on the court, even when it got to the end, because I was just so proud of myself to get to this point,\" Towns said. “It's been a long process.”\n\n\r\n                    Naz Reid led Minnesota with 23 points off the bench, and Malik Beasley added 21. The Timberwolves have lost three in a row and eight of 10.\n\n\r\n                    Minnesota led by as many as 13 points in the first half before watching its lead disappear. The Timberwolves' bench built up the first-half lead behind strong efforts from Jaylen Nowell and rookie Jaden McDaniels.\n\n\r\n                    Trailing at the half, the Clippers used an 11-3 run to take the lead early in the third quarter. Leonard scored 10 of Los Angeles’ 33 points in the third and the Clippers carried an eight-point lead into the fourth quarter.\n\n\r\n                    “There’s a reason they’re the best third-quarter team in the league,” Saunders said. “They came out and they played like a team that’s a championship contender.”\n\n\r\n                    Patrick Beverley returned for the Clippers following an eight-game absence with a right knee injury. Beverley started Wednesday’s game and finished with six points\n\n\r\n                    The Clippers welcomed back Beverley's vocal leadership on the court, something they missed while he was out..\n\n\r\n                    “It was good seeing Pat back out there,” Lue said. \"He's our emotional leader. Just seeing how hard he plays every night and competes, we needed that.\n\n\r\n                    While Towns was back for the Wolves, guard D’Angelo Russell remained sidelined with left leg soreness. Towns and Russell have played just five games together since Minnesota acquired Russell in a trade on Feb. 6, 2020. Russell remains day-to-day.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Paul George missed his third straight game with a swollen right toe. George is second on the Clippers in scoring this year, averaging 24.4 points. ... Williams’ 27 points were a season high.\n\n\r\n                    Timberwolves: McDaniels had four blocks in the first half, a career high. … Reid posted his fourth career 20-point game and third of the season.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Los Angeles concludes its short trip Friday with a game in Chicago. The Clippers will be without Paul George again in Friday’s game.\n\n\r\n                    Timberwolves: Minnesota heads on the road to take on Charlotte on Friday. It’s the first of two meetings the Wolves have with the Hornets.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997691.98996
}