{
  "game_id": "0021601200",
  "espn_id": "400900578",
  "date": "Apr 09, 2017",
  "matchup": "HOU @ SAC",
  "headline": "James Harden posts 21st triple-double to lift Rockets past Kings",
  "body": "SACRAMENTO, Calif. -- James Harden had 35 points, 15 assists and 11 rebounds for his 21st triple-double of the season to lead the Houston Rockets to a 135-128 victory over the Sacramento Kings on Sunday.\nHarden is second to Oklahoma City's Russell Westbrook, who broke Oscar Robertson's 56-year-old NBA record with his 42nd triple-double Sunday in a win at Denver. Harden has scored 30 or more points and had double-digit assists in 29 games.\nRyan Anderson made six 3-pointers and had 21 points for Houston. Clint Capela and Lou Williams each had 18 points, and Bobby Brown made four 3-pointers and finished with 16 points. The Rockets made 18 of 43 3-pointers.\nSkal Labissiere had 25 for the Kings, and Ty Lawson had 20 points and 11 assists.\nThe Kings were swept in four games by the Rockets for the first time since the 1997-98 season. Houston has defeated Sacramento in 12 of the teams' past 13 meetings.\nThe Rockets, who had dropped four of their previous six games, have already secured third place in the Western Conference and will meet Oklahoma City in the opening round of the playoffs. The Rockets have two games remaining and conclude the regular season Wednesday against visiting Minnesota.\nHarden had the Rockets' high-powered offense going strong in the opening half when he scored 21 points. He added nine more in the third quarter, when the Rockets continued making 3-pointers and led 107-89 heading into the fourth.\nHarden had five 3-pointers and shot 9-of-22. He converted 12 of 13 free throws, played 36 minutes and departed for good with the Rockets comfortably in front late in the fourth quarter.\nHouston, which has already set a single-season record for 3-point baskets, had its offense going strong in the opening quarter. The Rockets made nine 3s and led 42-27. Getting little resistance from an uninspired Kings defense, the Rockets stretched their lead to 78-62 by halftime.\nThe Kings are 7-16 since they traded DeMarcus Cousins at the All-Star break.\nTIP INS\nRockets: Rested starter Trevor Ariza and key reserves Eric Gordon and Nene. ... Houston made 12 3-pointers and shot 64 percent in the opening half.\nKings: Veterans Arron Afflalo, Darren Collison, Tyreke Evans, and Kosta Koufos were given the day off. ... Sacramento missed 22 of 31 3s.\nUP NEXT\nRockets: Face the Los Angeles Clippers on Monday in their final road game of the regular season.\nKings: Play the Phoenix Suns in their last home game of the season.",
  "source": "espn_api",
  "crawled_at": 1764995731.0003352
}