{
  "game_id": "0022301057",
  "espn_id": "401585685",
  "date": "Mar 27, 2024",
  "matchup": "HOU @ OKC",
  "headline": "Jalen Green scores 37, Rockets beat Thunder 132-126 in overtime for 10th straight victory",
  "body": "OKLAHOMA CITY -- — The Houston Rockets didn’t care that they beat an Oklahoma City squad that was missing its best player, All-Star guard Shai Gilgeous-Alexander.\n\n\r\n              The Rockets celebrated loudly in the locker room after escaping with a win at one of the toughest venues in the league. Jalen Green scored 37 points and Houston won its 10th straight game, defeating the Thunder 132-126 in overtime on Wednesday night.\n\n\r\n              “It was lit, it was lit,” Green said. “Everybody was happy, celebrating, screaming. I mean, we fought for that one. We worked hard.”\n\n\r\n              Rockets coach Ime Udoka said it’s all about stacking victories. \n\n\r\n              “Ten in a row is 10 in a row, regardless if Shai is out or whatever the case may be,” Udoka said. “But it’s hard to do in the NBA. The guys are proud of that effort, and well deserved.”\n\n\r\n              Amen Thompson had 25 points and 15 rebounds and Dillon Brooks added 20 points for the Rockets. \n\n\r\n              Gilgeous-Alexander, who was out with a bruised right thigh, ranks third in the league with 30.4 points per game. \n\n\r\n              Josh Giddey matched a career-high with 31 points for the Thunder, one night after scoring a season-high 25 in a win at New Orleans. Jalen Williams added 23 points and 10 assists for Oklahoma City, which entered the night a half game behind the Western Conference-leading Denver Nuggets.\n\n\r\n              Oklahoma City coach Mark Daigneault made no excuses for the loss.\n\n\r\n              “Every night, there’s a combination of things you can control and things you can’t,” he said. “You want to be a team that looks at the stuff you can control. We just never want to turn a page and chalk an entire game up to luck or shot-making or refs or anything like that. You want a team that takes full accountability for what we can. We do that after wins, we do that after losses and we’ll do that after this one.”\n\n\r\n              The final minutes of regulation were hectic. Giddey hustled to the ball and got a shot to bounce in while sitting on the floor a few feet in front of the free-throw line, putting the Thunder ahead 103-102 with just under four minutes remaining.\n\n\r\n              Oklahoma City’s Williams made a contested 3-pointer with 4.7 seconds remaining to tie the score at 112. Green’s layup at the buzzer rolled away, forcing overtime. \n\n\r\n              “Had a decent look at a shot, but we felt OK, put it behind us and we just went after it,” Udoka said. \n\n\r\n              Brooks hit two 3-pointers early in the extra period to put the Rockets in control.\n\n\r\n              “It was big when Dillon came out and hit those two, and then we guarded even better until the end of the overtime,” Udoka said. \n\n\r\n              The game had a little extra flair from the start. Confetti from a previous event rained down on the floor right before the tip.\n\n\r\n              The Thunder trailed by double digits in the first quarter, but rallied to lead 50-49 at halftime.\n\n\r\n              The Thunder led 69-62 when Giddey fouled Jabari Smith Jr. Giddey tried to help him up and Brooks pushed Giddey away and was issued a technical foul. It was Brooks’ 14th of the season, putting him two short of a one-game suspension.\n\n\r\n              Oklahoma City took an 85-80 lead into the fourth quarter.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Visit the Utah Jazz on Friday night.\n\n\r\n              Thunder: Host the Phoenix Suns on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995569.656938
}