{
  "game_id": "0022200817",
  "espn_id": "401468972",
  "date": "Feb 07, 2023",
  "matchup": "BKN vs. PHX",
  "headline": "Ayton has 35, Suns hold off Thomas, Nets in Booker's return",
  "body": "NEW YORK -- — These aren't the Phoenix Suns that fell apart after Devin Booker was hurt. \n\n\r\n              The team he came back to is surging and doesn't expect that to change.\n\n\r\n              “We're going to have this thing rolling now,” Deandre Ayton said. “Suns basketball on the way for sure.”\n\n\r\n              Ayton matched his career high with 35 points, Booker scored 19 in his first game since Christmas and the Suns held off Cam Thomas and the Brooklyn Nets 116-112 on Tuesday night.\n\n\r\n              Booker missed 21 games with left groin strain. The Suns had a stretch of nine losses in 10 games early in his absence but hung in well at the end and have won nine of 11.\n\n\r\n              “Now we're back and we have our guy back, so he knows we're locked and loaded,” Ayton said. \n\n\r\n              The 21-year-old Thomas led a late charge and finished with 43 points, becoming the youngest player in NBA history with three straight 40-point games. He had 44 and a career-high 47 points in his previous two games, but the Nets are 1-2 during Thomas' run.\n\n\r\n              “Obviously I’d rather have the win because it sounds better when you have these 40-point games with the two (games) that we lost, but it’s just good to have my name in history,” Thomas said. \n\n\r\n              Mikal Bridges had 17 of his 21 points in the second half and played a key role in the defensive effort that cooled off Thomas just long enough for the Suns to use a 13-4 run to build a 109-97 lead with 2:25 remaining.\n\n\r\n              Booker scored six points and set up Ayton for another basket during that stretch.\n\n\r\n              “That’s all I want right there is just competition and being back out there with the band and just feeling that energy, feeling that presence,” Booker said. “The team has it rolling right now, so just insert myself in a way that wasn’t disruptive and try to keep the flow that they have.” \n\n\r\n              Thomas rallied the Nets mostly from the free-throw line, and his intentional miss with 4.1 seconds remaining left the Suns with a 114-112 lead. He then fouled Ayton, who finished it off with two free throws after going 14 for 18 from the field and grabbing 15 rebounds. \n\n\r\n              Nic Claxton and T.J. Warren had 17 points each for the Nets, who lost on back-to-back nights after trading Kyrie Irving and fell to 5-9 without the injured Kevin Durant. They opted not to play Spencer Dinwiddie and Dorian Finney-Smith, the players they acquired from Dallas in the trade for Irving.\n\n\r\n              Ben Simmons had two points and six assists after missing five games with left knee soreness. \n\n\r\n              TIP-INS\n\n\r\n              Suns: Chris Paul surpassed 2,500 steals, a mark reached by only John Stockton, Jason Kidd and Michael Jordan. He had nine points and 12 assists. \n\n\r\n              Nets: Brooklyn was also without Seth Curry (left adductor strain) and Yuta Watanabe (back tightness). ... Coach Jacque Vaughn said Durant continues to progress well in his recovery but still hasn't been involved in the any portions of practice where there is contact. Vaughn said he didn't know when Durant would take that step, and he won't play before he does. The Nets only have four games remaining before the All-Star break. \n\n\r\n              DINWIDDIE AND DORIAN\n\n\r\n              Dinwiddie spent five seasons with the Nets and recalled when he signed a multiyear deal in December 2016 after coming into the league as a second-round pick who battled to prove he was more than a G League player.\n\n\r\n              “My career’s been hard, and that right there kind of solidified knowing, like, my family’s going to be fine,” Dinwiddie said.\n\n\r\n              He said there was nostalgia being back in Brooklyn, where he averaged a career-best 20.6 points in 2019-20, and praised Finney-Smith's ability to be an important contributor to the team.\n\n\r\n              “Understanding that we may not be the best trade package, but we are the best-looking and the Nets needed some help in that department,” he joked. \n\n\r\n              ANOTHER TRADE\n\n\r\n              The Nets dealt forward Kessler Edwards to Sacramento for the rights to 2016 second-round pick David Michineau and cash. Edwards began last season on a two-way deal before playing well enough to earn a standard NBA contract, but had appeared in just 14 games this season.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Atlanta on Thursday.\n\n\r\n              Nets: Host Chicago on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994862.957184
}