{
  "game_id": "0021900112",
  "espn_id": "401160754",
  "date": "Nov 07, 2019",
  "matchup": "CHA vs. BOS",
  "headline": "Celtics beat Hornets 108-87 in Walker's return to Charlotte",
  "body": "CHARLOTTE, N.C. --  As he peered up at the videoboard suspended above the court, Kemba Walker broke into a wide smile and tears trickled down his cheeks.\n\nThe Hornets honored their all-time leading scorer with a highlight video Thursday night, giving the Boston Celtics point guard a hero's welcome in his return to Charlotte. As the tribute ended, the crowd erupted with a loud, one-minute standing ovation.\n\n\"It was special,\" Walker said. \"Just to be back here and the amount of love I have been getting today and leading up to this day. The video just topped it off. It made me really emotional. I was trying to hold it in, but I couldn't. I knew I wasn't going to be able to.\"\n\nJayson Tatum scored 23 points, and Walker got what he ultimately wanted -- a victory -- in his homecoming game as the Celtics soundly defeated the Charlotte Hornets, 108-87.\n\nIt was an underwhelming performance by Walker's standards.\n\nThe three-time All-Star who once scored 60 points on this court was held to 14 on 4-of-12 shooting, and didn't make his first field goal until three minutes into the third quarter.\n\nWalker said the video didn't impact his play on the court, but coach Brad Stevens believed it contributed.\n\n\"Yeah, it's really hard,\" Stevens said. \"He had the right idea coming into the game but you knew right after they played that video, that probably was going to be a tough start. That was really cool and a great tribute by the Hornets. I know how much he appreciated it.\"\n\nWalked played eight seasons in Charlotte before signing with the Celtics after Hornets owner Michael Jordan elected not to give Walker a five-year, $221 million supermax contract.\n\nBut he left on good terms with the organization and its fans. After the game, Walker stayed on the court hugging members of the organization, including some of the ushers.\n\n\"It's always great to see Kemba,\" Hornets coach James Borrego said. \"I love that guy. He has a great spirit. He's a great competitor and a wonderful person. I think it was a good night for him and for all of us. Both teams have moved on, but it's always good to see him.\"\n\nGordon Hayward added 20 points and 10 rebounds for the Celtics, who scored 17 points off 21 Charlotte turnovers.\n\nMiles Bridges had 18 points and 10 rebounds to lead the Hornets, who had their three-game win streak snapped. Charlotte was just 6 of 31 from 3-point range.\n\nTIP-INS\n\nCeltics: Stevens said center Enes Kanter is improving from a bruised left knee, but isn't quite ready to return.\n\nHornets: Bridges received a technical after mixing it up with Marcus Smart in the fourth quarter. ... The Hornets had nine blocks.\n\nSMART MOVE\n\nSmart was upset after picking up his fifth foul and clapped in disgust in the direction of the Celtics bench after a couple of coaches appeared to be yelling at him on the court.\n\nStevens said Smart's actions didn't bother him at all.\n\n\"This is the part about Marcus that I love -- his fire, his competitiveness,\" Stevens said. \"If there's a moment when he's upset with us, that's all part of it, we move on pretty quickly. We've been together a long time and I've been yelled at before and that's OK. I love him and I trust him and he'll get every opportunity.\"\n\nROZIER STRUGGLES\n\nTerry Rozier, signed by the Hornets to replace Walker, was hoping for a big game against his former team but struggled all night and was held to three points after shooting 1 of 11 from the field.\n\n\"He tried to play the right way but shots weren't falling,\" Borrego said. \"He competed tonight and he just has to stick with it. It's an emotional game. It's always an interesting game. I think Kemba felt the same way in the first half. I think Kemba was 0 for 6 in the first half and I think Terry was 0 for 6.\"\n\nWILLIAMS' RETURN\n\nCeltics rookie Grant Williams grew up about six minutes from the Spectrum Center -- and reminded his teammates of that on the way into Charlotte.\n\n\"When we were on the bus I was annoying because I was calling out interstates and talking about buildings like I'm a tour guide and everyone was telling me to shut up because it was 1 a.m.,\" Williams said with a laugh.\n\nUP NEXT\n\nCeltics: Boston takes its six-game win streak on the road Saturday to San Antonio.\n\nHornets: Wrap up a three-game homestand when they host the Pelicans on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996109.071692
}