{
  "game_id": "0022400468",
  "espn_id": "401705034",
  "date": "Jan 02, 2025",
  "matchup": "LAL vs. POR",
  "headline": "LeBron James, Max Christie carry Lakers past Blazers 114-106 for their 6th win in 8 games",
  "body": "LOS ANGELES -- — LeBron James scored 38 points, Max Christie had a career-high 28 and the Los Angeles Lakers overcame Anthony Davis' absence for a 114-106 victory over the Portland Trail Blazers on Thursday night.\n\n\r\n              James hit a season-high seven 3-pointers and Christie added five for the Lakers, who have won six of eight. Austin Reaves contributed 15 points, 11 assists and eight rebounds as Los Angeles hung on to beat Portland for the fifth straight time.\n\n\r\n              Davis sat out for only the second time this season to rest his sprained left ankle, which the star big man hurt on Christmas. Point guard Gabe Vincent also sat with a hip injury.\n\n\r\n              Anfernee Simons scored 11 of his 23 points in the fourth quarter for the Blazers, who have lost four of six. Shaedon Sharpe and Deni Avdija added 19 points apiece.\n\n\r\n              Jaxson Hayes had four points while starting in Davis’ spot in his return from a 15-game injury absence.\n\n\r\n              Dorian Finney-Smith scored three points and Shake Milton had four in the veterans' second game for the Lakers since arriving in a trade with Brooklyn.\n\n\r\n              Takeaways\r\n              Trail Blazers: The first and fourth quarters were promising, but they waited too long to get aggressive in the opener of a five-game road trip after going 3-9 in December.\n\n\r\n              Lakers: Christie is emerging as a key contributor in his third season. He has scored in double digits for the fourth time in five games, providing 3-and-D excellence.\n\n\r\n              Key moment\r\n              Portland trailed 99-86 with 6:13 to play, but made a 14-4 run. James and Christie combined for 11 points down the stretch, capped by James' seventh 3-pointer with 59 seconds left.\n\n\r\n              Key stat\r\n              14 of 24 — James' 3-point shooting over the past four games. He turned 40 midway through this torrid stretch.\n\n\r\n              Up next\r\n              The Lakers host Atlanta on Friday. The Blazers visit Damian Lillard and the Milwaukee Bucks on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997184.601043
}