{
  "game_id": "0022400404",
  "espn_id": "401704970",
  "date": "Dec 23, 2024",
  "matchup": "LAL vs. DET",
  "headline": "Pistons overcome LeBron's triple-double, beat Lakers 117-114 to sweep their season series",
  "body": "LOS ANGELES -- — Malik Beasley scored 21 points, Cade Cunningham had 20 points and 10 assists, and the Detroit Pistons held off the Los Angeles Lakers 117-114 Monday night to sweep the clubs' season series.\n\n\r\n              LeBron James had 28 points, 11 rebounds and 11 assists in the 120th triple-double of his career, but he missed a 3-point attempt right before the buzzer. Only Nikola Jokic (11) has more triple-doubles this season than the 39-year-old James (8).\n\n\r\n              Jaden Ivey scored 18 points for the Pistons, who have beaten Phoenix and Los Angeles on the road to win back-to-back games for the first time since Nov. 17 and just the third time all season. Detroit, which beat the Lakers at home last month, also snapped a seven-game road losing streak against the Lakers since 2017.\n\n\r\n              Detroit led 117-106 with 2 1/2 minutes to play, but the Lakers scored eight straight points capped by James' driving layup with 46 seconds left. After the Pistons got a foul overturned by video review with 28.9 seconds left, Cunningham missed a 3-pointer before James missed his open 30-footer.\n\n\r\n              Anthony Davis had 19 points and 10 rebounds for the Lakers.\n\n\r\n              Takeaways\r\n              Pistons: Detroit still has growing to do, but this young group has beaten New York, Miami, Phoenix and the Lakers this month. The Pistons were fired up to play on the big stage in Los Angeles, and it showed.\n\n\r\n              Lakers: Their 20 turnovers showed their inattention to detail, and the Pistons' 117 points showed their lack of defensive focus.\n\n\r\n              Key moment\r\n              Detroit made a 16-4 run catalyzed by Ivey and Beasley early in the fourth to blow it open.\n\n\r\n              Key stat\r\n              James hit his 847th 3-pointer for the Lakers, passing Derek Fisher for the second-most in franchise history. Only Kobe Bryant (1,827) made more.\n\n\r\n              Up next\r\n              The Lakers visit the Warriors on Christmas. The Pistons are in Sacramento on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997192.825332
}