{
  "game_id": "0021500330",
  "espn_id": "400828217",
  "date": "Dec 10, 2015",
  "matchup": "CHI vs. LAC",
  "headline": "Gasol scores 24, Bulls beat Clippers 83-80 to stop skid",
  "body": "CHICAGO -- This time, the Chicago Bulls dug in.\nThey let a big lead slip away in the second half, but made just enough plays down the stretch to win a game they needed in a big way.\nPau Gasol scored 24 points and the Bulls beat the Los Angeles Clippers 83-80 on Thursday night to snap a three-game losing streak.\n\"We have an opportunity here to do something special,\" Gasol said. \"I would hate if we would throw it away ourselves.\"\nThe Bulls caught a big break midway through the third quarter when Clippers All-Star Blake Griffin was ejected for a hard foul against Taj Gibson, and they came away with the win after blowing a 16-point lead.\nDerrick Rose banked in a floater with 45 seconds left to make it 83-77 before Los Angeles' Wesley Johnson buried a 3-pointer. The Clippers then rebounded a miss by Chicago's Jimmy Butler with 6 seconds left, but Chris Paul's tying 3-point attempt hit the rim just before the buzzer.\nGasol hit a career-high three 3-pointers.\nRose came on strong down the stretch, scoring nine of his 11 points in the fourth quarter. He also played the second half without the protective mask he has been wearing after fracturing his left orbital on the first day of practice.\nButler, coming off a career-high 36 points against Boston the previous night, scored 14 and had a season-high eight assists. Gibson finished with 12 points and eight rebounds.\nGriffin had 18 points and 11 rebounds for Los Angeles. Paul scored 12, while DeAndre Jordan added 10 points and 14 rebounds. The Clippers hit eight 3-pointers in the fourth quarter and were 10 of 22 for the game, but they came up short after winning three straight and six of seven.\nThe Bulls were leading by 14 when Griffin knocked Gibson to the floor with a blow to the face as he head-faked and went up for a shot inside with 5:59 left in the third.\nGriffin helped Gibson to his feet. But after a review, the officials called a flagrant foul 2, meaning an automatic ejection for Griffin.\n\"I wasn't trying to hit him in the face,\" Griffin said. \"There was no intent to hurt, or intent to even really hit him. I was going to try to hit the ball and he pump faked me.\"\nGibson, who called Griffin a \"great guy\" and said it's \"no big thing,\" made both foul shots to make it a 16-point game. But the Clippers came roaring back. The lead was down to 10 going into the fourth, and the Clippers tied it at 66-all on Josh Smith's 3-pointer with 7:19 remaining.\nBut the Bulls, outscored a combined 102-70 in the final quarter the previous three games, made the big plays Thursday.\nButler hit a jumper and took a charge from Lance Stephenson. Gibson threw down a thunderous put-back dunk off a missed 3 by Aaron Brooks and Rose nailed a 3 from the top to make it 73-66 with 5:15 left.\n\"I want to play like this every night,\" Rose said. \"We have to play with this consistency. We have to play with this urge and energy every night.\"\nMASKING IT\nRose said he was cleared a few days ago to play without the mask but decided to keep wearing it. He forgot it in the locker room at halftime and decided to go without it the rest of the way. He said he \"might\" wear it the next game.\nTHIBODEAU TALK\nClippers coach Doc Rivers was asked if he's spoken recently to his former assistant and ex-Bulls coach Tom Thibodeau. His answer was hardly a surprise. \"Other than every day, I would say no,\" Rivers said. Thibodeau assisted Rivers in Boston for three seasons, helping the Celtics win a championship, before coaching the Bulls the past five years. He was fired by Chicago in May and is out of the league.\nTIP-INS\nClippers: Los Angeles had won five straight in Chicago.\nBulls: The Bulls set season lows for points allowed, points given up in the paint (18) and fouls (12). ... Joakim Noah had 13 rebounds and Nikola Mirotic grabbed a season-high 11.\nUP NEXT\nClippers: At Brooklyn on Saturday.\nBulls: Host New Orleans on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993959.211227
}