{
  "game_id": "0021601116",
  "espn_id": "400900511",
  "date": "Mar 29, 2017",
  "matchup": "MEM vs. IND",
  "headline": "Conley scores 36 as Grizzlies rout Pacers 110-97",
  "body": "MEMPHIS, Tenn. --  Mike Conley wanted to set the tone for the Memphis Grizzlies.\n\nHe succeeded, in a big way.\n\nConley matched his career high with seven 3-pointers on his way to 36 points, helping the Grizzlies rout the Indiana Pacers 110-97 on Wednesday night.\n\nMemphis (41-34) had lost four in a row, all on the road.\n\n\"It was a must-win,\" Conley said, \"and I just wanted to make a statement, not only with my team, but to the coaches, the city that we're not playing the basketball we need to be playing right now, and we're better than this.\"\n\nVince Carter added 21 points and eight rebounds, and Zach Randolph finished with 17 points. Conley went 13 for 21 from the field.\n\nPaul George led the Pacers with 22 points. Aaron Brooks, who provided an early spark from outside the arc, scored 18 points, and Thaddeus Young had 16 points and a season-high 13 rebounds.\n\nIndiana lost for the fourth time in five games.\n\n\"We were supposed to come out here and make the game tough,\" George said, \"but to start the game off, they kind of did what they wanted, and it showed.\"\n\nMemphis played without All-Star center Marc Gasol, who missed his third straight game with a left foot strain. But Conley helped the Grizzlies get off the fast start, and Pacers were never able to catch up.\n\nMemphis led by as many as 22 in the second quarter and carried a 72-53 advantage into the break. Conley scored 22 points in the first half, and the Grizzlies went 10 for 17 from beyond the arc in the first two periods.\n\nBrooks made four 3-pointers and scored 14 in the first half for Indiana.\n\n\"They got off to a fast start,\" Pacers coach Nate McMillan said. \"Conley was pushing the ball. ... We weren't able to keep up with him, and they just kept the pressure on us throughout the game.\"\n\nThe Grizzlies led 96-79 after three, and the sliding Pacers never threatened in the fourth.\n\nIndiana (37-38) dropped into a tie with Miami for the last spot in the Eastern Conference playoff race. Both are two games behind Milwaukee and Atlanta.\n\nThe Heat, Bucks and Hawks all won Wednesday night.\n\nTIP-INS\n\nPacers: Brooks made a 3-pointer in the first quarter to reach 800 for his career. ... Indiana dropped to 0-8 in road games on the second night of a back-to-back.\n\nGrizzlies: JaMychal Green was out with left shoulder soreness. That caused Memphis to use its 22nd different starting lineup this season. ... Memphis has made at least 10 3-pointers in 36 games. ... In the third quarter, Carter passed Ray Allen (24,505) for 22nd in NBA history for career points scored. ... Reserve guard Andrew Harrison left in the third quarter with a right ankle injury.\n\nPACERS HOMECOMINGS\n\nYoung played high school basketball in Memphis and still lives there. Pacers guard Monta Ellis has a home in the Eads community east of Memphis.\n\nHOME STRETCH\n\nMemphis, which sits seventh in the Western Conference playoff race, has a beneficial schedule down the stretch. Of its seven remaining games, five are at home, and five are against teams with losing records.\n\nUP NEXT\n\nPacers: Visit Toronto on Friday.\n\nGrizzlies: Host the Dallas Mavericks on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995562.6042671
}