{
  "game_id": "0022300014",
  "espn_id": "401584102",
  "date": "Nov 10, 2023",
  "matchup": "LAC @ DAL",
  "headline": "Luka Doncic scores 44 points in Mavericks' 144-126 tournament win over Clippers",
  "body": "DALLAS -- — Luka Doncic scored 44 points and the Dallas Mavericks routed the Los Angeles Clippers 144-126 on Friday night in an NBA In-Season Tournament game, the Clippers’ third straight loss since James Harden joined the lineup.\n\n\r\n              Doncic was 17 of 21 from the field, going 6 of 9 from 3-point range. Kyrie Irving added 27 points, hitting 5 of 8 3-pointers, to help Dallas improve to 1-1 in the tournament after an opening loss at Denver.\n\n\r\n              “I keep saying, it’s not just us two,” Doncic said about himself and Irving. “We get stops. Everybody contributes. So, it’s not just two of us. Everybody helps us.”\n\n\r\n              The Mavericks took control with a 47-18 second period and a 33-4 run in the first half that included 17 consecutive points, eight to finish the first quarter and nine to begin the second quarter. Their largest lead was 32 points early in the third period. They reached 100 points with 4 1/2 minutes in the third and finished with their highest point total of the season.\n\n\r\n              Kawhi Leonard led the Clippers, who have dropped four straight overall, with 26 points in their tournament opener. Harden, who joined the team last week following a Nov. 1 trade from Philadelphia, had 14 points — all in the first quarter. Russell Westbrook also had 14.\n\n\r\n              “First quarter, felt really good on both ends of the ball,” Harden said. “From there, it just went downhill. Trying to find a balance of not trying to step on anyone’s toes but just trying to, like, still be aggressive myself.”\n\n\r\n              Harden stressed that it’s still early in his transition to the Clippers and he’s still trying to figure out “everything.”\n\n\r\n              “I didn’t have a training camp. I didn’t have a preseason,” Harden said. \"Everything is still moving fast speed for me. Need about a 10-game window, then kind of see where I am.”\n\n\r\n              Clippers coach Tyronn Lue said a key to Harden’s success will involve keeping a big man on the floor with him. Los Angeles currently uses more smaller lineups than usual with backup center Mason Plumlee lost for a period of months with an MCL sprain.\n\n\r\n              “Because of the way he runs pick and rolls,” Lue said. “He can get downhill and make every play.”\n\n\r\n              Los Angeles' Paul George was held to eight points. Leonard, Westbrook, Harden and George didn’t play in the fourth period.\n\n\r\n              The Clippers scored the first eight points and led 31-19 before the Mavericks took over. Dallas led 77-51 at the half, 10 points more than its previous highest-scoring first half.\n\n\r\n              The Mavericks came off their first home loss of the season, 127-116 to Toronto on Wednesday.\n\n\r\n              “I think it was a great bounce-back game,” Dallas coach Jason Kidd said. “Luka set the tone, Kai, those two set the tone tonight, and the guys followed.”\n\n\r\n              The game wasn’t played on the Mavericks’ special court for the tournament because of what the NBA called a “manufacturing issue” with the court.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Memphis on Sunday.\n\n\r\n              Mavericks: At New Orleans on Sunday night for a regular game and Tuesday night for a tournament game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996566.086198
}