{
  "game_id": "0022400942",
  "espn_id": "401705508",
  "date": "Mar 11, 2025",
  "matchup": "IND vs. MIL",
  "headline": "Pacers' Tyrese Haliburton converts last-second 'football play' into 4 points to stun Bucks",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton described it as “a football play” — and he converted the extra point, too.\n\n\r\n              With the Indiana Pacers needing a 3-pointer to tie the Milwaukee Bucks in the closing seconds Tuesday night, a streaking Haliburton took a handoff-style inbound pass along the left sideline, elevated over Giannis Antetokounmpo while fading out of bounds, and buried the 3 while being fouled.\n\n\r\n              Haliburton made the free throw for a stunning four-point play with 3.4 seconds left, and the Pacers held on for a 115-114 victory over the Bucks when Antetokounmpo missed a 3 at the buzzer.\n\n\r\n              “It’s like a football play,” Haliburton said, noting that his teammates ran crossing routes. “It was great to see it work. The first time we ever ran the play in training camp two years ago, I made the shot the same way. I haven’t got the ball since. I usually hate running the play.”\n\n\r\n              Haliburton said he wasn’t worried about stepping out of bounds.\n\n\r\n              “I’ve shot that shot enough to know where I am on the court,” Haliburton said. “It’s just a matter of getting it off. Just rose up. I jumped higher than I normally do. It just went in.”\n\n\r\n              Haliburton said Pacers coach Rick Carlisle and his staff are great at drawing up plays. Carlisle said assistant Jenny Boucek created the play and assistant Mike Weinar made some tweaks.\n\n\r\n              “An amazing sequence of events,” Carlisle said. “What a play and Reggie (Miller) was in the building. They’ll be talking about Tyrese’s shot for a lot of years.”\n\n\r\n              Miller, who played his entire Hall of Fame career for the Pacers, was working as a commentator for TNT.\n\n\r\n              “There’s definitely a lot of Reggie moments in this building,” Haliburton said. “I’m just trying to make my own.”\n\n\r\n              Haliburton had missed the previous three games with a hip injury — all Pacers losses. He was healthy enough to help Indiana draw even with fourth-place Milwaukee in the Eastern Conference standings, finishing with 14 points on 5-of-12 shooting and 10 assists.\n\n\r\n              “It’s the stuff you dream of,” Haliburton said. “I’m thankful my teammates trusted me. Down the stretch I made some boneheaded plays. I missed a 3-pointer over Brook (Lopez) and I traveled — suspect traveling call.”\n\n\r\n              Pascal Siakam, who led the Pacers with 25 points and 12 rebounds, was amazed by his teammate.\n\n\r\n              “Just impossible angle, over Giannis,” Siakam said. “I don’t think he can even see over him.”\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997488.0778382
}