{
  "game_id": "0021801077",
  "espn_id": "401071750",
  "date": "Mar 21, 2019",
  "matchup": "DET @ PHX",
  "headline": "Ellington, Drummond lead Pistons past Suns, 118-98",
  "body": "PHOENIX --  The Detroit Pistons turned up the defensive pressure in the second half and turned away the Phoenix Suns.\n\nWayne Ellington scored 23 points and the Pistons made 17 3-pointers in a 118-98 victory on Thursday night. Detroit held the Suns to 38 second-half points and limited Suns star Devin Booker to six points in the final 24 minutes.\n\n\"We locked in and flipped the switch,\" Pistons coach Dwane Casey said. \"Our guys became more disciplined as the game went on.\"\n\nThe Pistons turned a five-point lead early in the fourth quarter into a 13-point advantage in a span of less than two minutes, featuring two dunks by Andre Drummond. Drummond finished with 16 points and 19 rebounds.\n\nBlake Griffin, who was rested for Detroit's loss at Cleveland on Monday, returned and struggled with his shot, going just 4 of 17. But he finished with 17 points, eight rebounds and seven assists.\n\n\"Our energy level went up,\" Griffin said. \"We got some stops and got a couple of easy (baskets). And once you see a couple go through, I think that helps the rhythm. But defensively we were a lot better in the fourth.\"\n\nDetroit outscored Phoenix 31-18 in the fourth quarter. The Pistons have won three of four and are in sixth place in the Eastern Conference after 71 games.\n\nBooker scored 26 points for the Suns, who have lost four of five. Deandre Ayton added 20 points.\n\n\"This late in the season, people are playing for playoff seeding and we're playing just to get better,\" Booker said. \"I think they wanted it more and it showed in the last quarter.\"\n\nSuns forward Josh Jackson left the game with 5:45 remaining in the third quarter after leaping to block Thon Maker's shot attempt at the rim and landing awkwardly on his right ankle. Jackson got up and was helped off the court, and his injury was announced as a sprained ankle.\n\nThe Suns got off to a strong start, making 13 of 19 shots in the first quarter for a 32-29 lead. Booker scored 15 points in the quarter on 6-of-7 shooting.\n\nHe was just 2 of 10 after that, and showed some visible frustration.\n\n\"He cares about the team, he cares about winning. He's trying to win and you know, contain your composure, be positive,\" Suns coach Igor Kokoskov said.\n\nBack-to-back 3s from Luke Kennard off the Pistons bench gave Detroit an early second-quarter lead, but neither team led by more than five points throughout the first half. Kennard finished with 16 points.\n\nEllington, who earlier in the season was traded to the Suns but was bought out before ever suiting up in Phoenix colors, had 13 first-half points.\n\nAyton scored 14 first-half points on 6-of-8 shooting, and the Suns led 60-58 at the break.\n\nEllington's 3 over a double-team gave the Pistons an 81-72 lead with 3:32 left in the third quarter. The guard made six of his 10 3-point attempts.\n\n\"I don't think we had any forced 3s at all,\" Ellington said. \"Pretty open in the flow of the game. Give them to us and we're going to take them.\"\n\nThe Suns turned the ball over 19 times for the game, and one led to Drummond's transition dunk with 9:34 to play in the fourth quarter for a 93-84 lead.\n\n`BOOK' A SELFIE\n\nA fan sitting courtside got a perfectly timed photo of himself with the court in the background, and Booker -- walking by at the exact moment -- looking at the camera.\n\nCELEBRATING BASEBALL\n\nMembers of the Arizona Diamondbacks attended Thursday's game, with outfielders Adam Jones and Steven Souza Jr. taking part in a 3-point shooting contest for charity between the first and second quarters. Outfielder David Peralta also attended, sitting courtside.\n\nTIP-INS\n\nPISTONS: Detroit has won five straight against the Suns. ... Former Suns guard Ish Smith had 11 points in 24 minutes. ...  Griffin was assessed a technical foul early in the third quarter moments after he'd been called for an offensive foul.\n\nSUNS: F Kelly Oubre Jr. missed his second straight game with a left thumb sprain. ... G Tyler Johnson missed his fourth straight game with a sore right knee. ... F-C Richaun Holmes was cleared to play before the game and returned after missing two games with a strained quadriceps. He took a nasty spill trying to block Griffin's shot in the first quarter, landing neck-first on the court, but stayed in the game.\n\nUP NEXT\n\nPistons: At Portland Trail Blazers on Saturday night.\n\nSuns:  At Sacramento Kings on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994656.1647072
}