{
  "game_id": "0022400960",
  "espn_id": "401705526",
  "date": "Mar 14, 2025",
  "matchup": "LAC @ ATL",
  "headline": "Harden, Leonard each score 25 points as Clippers ride lopsided 3rd quarter to 121-97 win over Hawks",
  "body": "ATLANTA -- — James Harden and Kawhi Leonard each scored 25 points, with Harden scoring 13 in a dominant third quarter for Los Angeles, and the Clippers beat the Atlanta Hawks 121-98 on Friday night.\n\n\r\n              Leonard set a season high with five steals. Harden had eight rebounds and seven assists.\n\n\r\n              After trailing 61-53 at halftime, the Clippers outscored the Hawks 35-8 in a lopsided third quarter. \n\n\r\n              Clippers guard Bogdan Bogdanovic, making his return to Atlanta, scored 12 points and received an ovation and video tribute during a first-quarter timeout. \n\n\r\n              The Clippers acquired Bogdanovic and three second-round draft picks from the Hawks in exchange for Terance Mann and Bones Hyland on Feb. 6. The Hawks waived Hyland.\n\n\r\n              Onyeka Okongwu led Atlanta with 18 points and 10 rebounds.\n\n\r\n              Takeaways\r\n              Clippers: Coach Tyronn Lue joked “I'm playing 48 tonight” when asked if he was on a minutes restriction in his return after missing three games with lower back soreness. ... F/G Ben Simmons (left knee) scored two points with four assists in 18 minutes as a backup in his return after missing seven games.\n\n\r\n              Hawks: C Clint Capela (family reasons) did not play. ... Trae Young, who made all 21 free throws in a 123-110 win over Charlotte on Wednesday night, scored 17 points while shooting 3 of 4 from the foul line with seven assists and seven turnovers.\n\n\r\n              Key moment\r\n              After trailing 61-50 late in the first half, the Clippers scored 14 consecutive points. The streak began with Nicolas Batum's 3-pointer to end the first half and the first 11 points of the second half for a 64-61 lead. Following the last tie at 67, Los Angeles scored 19 consecutive points to lead 86-67.\n\n\r\n              Key stat \r\n              Atlanta's eight third-quarter points set a season low for a quarter.\n\n\r\n              Up next\r\n              Each team plays on Sunday, when the Clippers host Charlotte and the Hawks visit the Brooklyn Nets.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997883.435265
}