{
  "game_id": "0022300948",
  "espn_id": "401585576",
  "date": "Mar 13, 2024",
  "matchup": "CHI @ IND",
  "headline": "DeMar DeRozan's 46 leads Bulls past Pacers in OT",
  "body": "INDIANAPOLIS -- — DeMar DeRozan scored 46 points, including the go-ahead 3-pointer in overtime, to help the Chicago Bulls outlast the Indiana Pacers 132-129 on Wednesday night.\n\n\r\n              The All-Star forward's only 3-pointer at the 2:17 mark of overtime pushed the Bulls ahead 127-123. Pacers All-Star point guard Tyrese Haliburton missed a 3-pointer just before the final buzzer.\n\n\r\n              “It's like a survival mode that kicks in, in a fun way,” DeRozan said. “You embrace those moments. For me, I just thrive off those moments. I'm not scared to fail. I'm not scared to try to make something happen. I want those moments more than anything. It always reminds me of my childhood, being a kid and doing the little fake countdown, jumping on the bed, shooting the shot.”\n\n\r\n              The final 72 seconds of regulation were particularly entertaining as Pacers center Myles Turner hit 3-pointers on back-to-back possessions with 1:12 and 56.7 seconds remaining for a 3-point lead. But DeRozan sank a free throw and swished a baseline fadeaway jumper with 0.3 seconds remaining to force overtime.\n\n\r\n              “DeMar is an incredible closer,\" Bulls coach Billy Donovan said. “Give him a lot of credit and respect for that.”\n\n\r\n              The Bulls trailed by two when they inbounded the ball with 2.4 seconds remaining in regulation.\n\n\r\n              “I actually broke the play off,” DeRozan said. “The play was for me to come over top. But teams do a great job scouting and understanding what we're going to run. As soon as they checked the ball in, I just found an opening honestly.”\n\n\r\n              The teams traded the lead 12 times in the fourth.\n\n\r\n              “Our defense just wasn't good enough,” Turner said. “DeRozan hit some big shots, special player. But as a whole, I don't think we were there, just that last part. This time of year, there's no excuses. You've got to find a way to get it done.”\n\n\r\n              The Bulls’ Alex Caruso scored 23 and Ayo Dosunmu 20.\n\n\r\n              “What a game,” Pacers coach Rick Carlisle said. “So many ups and downs. We were one rebound away.”\n\n\r\n              Turner led the Pacers with 27 points and five 3-pointers. Pascal Siakam scored 17 points and grabbed nine rebounds. Haliburton had 17 points and 14 assists.\n\n\r\n              “It's a gut punch,” Carlisle said. “When you make minor mistakes at the wrong times, it can really bite you. There were a lot of 'em.”\n\n\r\n              Pacers reserves T.J. McConnell and Jalen Smith scored 16 and 15 as the Indiana bench owned a 47-16 advantage. \n\n\r\n              The Bulls outscored the Pacers 35-23 in the third quarter to take a 93-85 lead. Caruso contributed 14 points with four 3-pointers in the stretch. DeRozan added nine points.\n\n\r\n              The Pacers' bench provided 11 points in a 15-1 run to forge an eight-point lead midway through the second quarter. The advantage reached 11 before the Bulls closed the gap to 62-58 at the break. \n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host L.A. Clippers on Thursday.\n\n\r\n              Pacers: Host Brooklyn on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995869.782351
}