{
  "game_id": "0021600480",
  "espn_id": "400899922",
  "date": "Dec 28, 2016",
  "matchup": "CHI vs. BKN",
  "headline": "Butler scores 40, buzzer-beater lifts Bulls over Nets 101-99",
  "body": "CHICAGO --  With just under five minutes left, Jimmy Butler had to be helped to the bench and couldn't seem to put any weight on his right ankle.\n\nIt appeared his night was over. He was far from finished, though.\n\nButler matched his season high with 40 points and hit a 20-footer at the buzzer Wednesday to give the Chicago Bulls a 101-99 comeback victory over the Brooklyn Nets.\n\nButler scored nine points in the final 2 1/2 minutes to rally Chicago. He finished 11 for 11 from the free throw line and grabbed 11 rebounds as the Bulls overcame a seven-point deficit in the final three minutes for their second consecutive win.\n\n\"He was phenomenal, obviously,\" Chicago coach Fred Hoiberg said. \"He put the team on his shoulders. He willed them to the finish line.\"\n\nButler also willed himself because he acknowledged his ankle -- hurt when he landed on the foot of Brooklyn's Randy Foye -- still was aching after the game. But with Dwyane Wade already in the locker room due to a migraine, Butler never doubted he would return.\n\n\"When the adrenaline kicks in and the crowd's getting into it, I was ready to go,\" he said.\n\nBrook Lopez had 33 points -- including a career-high five 3-pointers -- as the Nets dropped their 12th straight road game.\n\n\"Chicago made a great push; they hit a lot of tough shots,\" Lopez said. \"I'm disappointed in myself. I definitely should have converted on a few of those last possessions, but I let them get back in the game.\"\n\nLopez had 19 first-half points to spark Brooklyn to a 49-46 halftime lead. The 7-footer was 4 for 5 on 3-pointers in the first 24 minutes and celebrated by holding up three fingers as he ran down the court following each one.\n\nBrooklyn had a 97-90 lead with just more than two minutes to play and appeared headed for a comfortable win, but Chicago stormed back. Michael Carter-Williams tied the game at 97 with 1:22 left.\n\nFollowing a Nets turnover, Butler gave the Bulls their first lead of the second half with a 15-footer with 27.7 seconds to go. Lopez, though, tied it with 12.6 seconds left on a dunk over his brother, Robin Lopez.\n\nThat set the stage for Butler's step-back winner.\n\n\"That was a big-time shot,\" Wade said. \"I'm just proud of him.\"\n\nTIP-INS\n\nNets: There's no timetable yet for how long G Jeremy Lin (strained left hamstring) will be sidelined, but expectations are it will be a long absence. He missed 17 games earlier in the season with the same injury and has only played in 12 games this season. ... G Joe Harris, who sat out with a hip pointer, is listed as day-to-day.\n\nBulls: F Doug McDermott returned after missing one game with a left shin injury. That meant all the team's players were healthy for the first time since Oct. 31. \"It's good to have your full roster available to play,\" Hoiberg said.\n\nHEAD GAMES\n\nWade didn't play in the final 8:22 because of the migraine. \"I lost a little vision,\" he said. \"I went on the court and couldn't see the rim and decided to come out and put some ice on it.\"\n\nROAD WOES\n\nBrooklyn dropped to 1-15 on the road. The team's only win away from home was a 122-104 victory in Phoenix on Nov. 12.\n\n\"We were down a few guys and on the road,\" coach Kenny Atkinson said. \"Our guys had a lot of resilience, and I feel bad we didn't get the win.\"\n\nSLOW START\n\nHoiberg was happy with the win, but didn't gloss over the fact his team dug itself a deep hole against a team with eight wins.\n\n\"It was disappointing; I'm not going to lie to you,\" he said. \"The way they came out and were the aggressors, it seemed like we were fighting uphill.\n\n\"We finally strung together some stops and got the win.\"\n\nUP NEXT\n\nNets: At the Washington Wizards on Friday. The Wizards won the first meeting, 118-113, on Dec. 5 at Brooklyn.\n\nBulls: At the Indiana Pacers on Friday, four days after a 90-85 win over Indiana at home.",
  "source": "espn_api",
  "crawled_at": 1764995068.368326
}