{
  "game_id": "0022300914",
  "espn_id": "401585542",
  "date": "Mar 08, 2024",
  "matchup": "MIA @ OKC",
  "headline": "Gilgeous-Alexander has big 2nd half to help Thunder rally past Heat, 107-100",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 23 of his 37 points in the second half and the Oklahoma City Thunder overcame a 14-point deficit to beat the Miami Heat 107-100 and take the Western Conference lead Friday night.\n\n\r\n              Gilgeous-Alexander made 13 of 25 field goals and 9 of 11 free throws. The NBA's No. 2 scorer was greeted with “M-V-P! M-V-P!” chants when he went to the line in the fourth quarter as he helped Oklahoma City take control.\n\n\r\n              The Thunder moved a half-game ahead of Minnesota for the West lead, with the Timberwolves falling in overtime at Cleveland. \n\n\r\n              Some of Gilgeous-Alexander's shots were taken from awkward angles. Thunder coach Mark Daigneault said the All-Star has gotten better at figuring out when to take those kinds of shots. \n\n\r\n              “The shot making is great,\" Daigneault said. \"He’s had the talent from day one. But what I’m most impressed with is the restraint he’s showing and the his ability to see the big picture, to leverage that talent for the good of the team while he’s still trying to accomplish individual things.”\n\n\r\n              Jalen Williams scored 15 points and Josh Giddey added 11 points, nine rebounds and six assists for the Thunder. Gilgeous-Alexander said his teammates deserve credit, too.\n\n\r\n              “We have guys like that across the board that do the little things that add up at the end of the night ... Everybody has a role and on this team everyone takes pride and does their role to the best of their ability,\" Gilgeous-Alexander said. \"And that’s what I love about them.”\n\n\r\n              Miami rookie Jaime Jaquez Jr. scored 25 points. Jimmy Butler added 20 points, 10 rebounds and eight assists. Bam Adebayo finished with just five points, though he grabbed 10 rebounds.\n\n\r\n              Miami lost both games of its back-to-back. The Heat lost 114-108 at Dallas on Thursday night.\n\n\r\n              Heat coach Erik Spoelstra said the team remains on track, despite the losses.\n\n\r\n              “We’ll get better from this,” Spoelstra said. “There were a lot of good things to take away. None of us want to talk about it or feel that or whatever right now because we’re competitors. But by the time we get back to Miami, even the head coach can see that there are some good things happening in our locker room.” \n\n\r\n              Miami led Oklahoma City 57-47 at halftime behind 50% shooting. Jaquez scored 17 points on 6-for-7 shooting before the break.\n\n\r\n              The Heat extended the lead to 65-51 the third quarter, but Oklahoma City erased its deficit four minutes later. Gilgeous-Alexander tied it at 65 on a free throw after a basket midway through the period. The Thunder took a 68-65 lead on a 3-pointer by Williams that Gilgeous-Alexander assisted to close out a 17-0 run.\n\n\r\n              The Thunder led 77-73 at the end of the third after holding Miami to 5-for-17 shooting in the period. Gilgeous-Alexander scored 11 points in the quarter to help Oklahoma City outscore Miami 30-16.\n\n\r\n              Gilgeous-Alexander took his usual rest to start the fourth, and Oklahoma City led 87-85 when he subbed back in with 7:16 remaining. He scored 12 points the rest of the way to keep the Thunder in control.\n\n\r\n              Daigneault said the win meant a little more than usual because of the opponent.\n\n\r\n              “They’re the competitive standard of the NBA, and so we have great respect for them and we know how much you have to earn a win against them,” Daigneault said. “So we’re really happy with that win.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Washington on Sunday night.\n\n\r\n              Thunder: Host Memphis on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995338.361425
}