{
  "game_id": "0021600459",
  "espn_id": "400899901",
  "date": "Dec 25, 2016",
  "matchup": "OKC vs. MIN",
  "headline": "Westbrook has 31 points, Thunder beat Timberwolves 112-100",
  "body": "OKLAHOMA CITY --  Russell Westbrook often has taken over as a scorer in the second half when his team has needed scoring punch.\n\nThis time, he pushed his Oklahoma City Thunder over the top as a facilitator. Westbrook still scored 31 points, but he had 10 of his 15 assists in the second half of a 112-100 win over the Minnesota Timberwolves on Sunday night.\n\nSteven Adams scored 22 points and Enes Kanter added 20 for the Thunder. Westbrook enjoyed helping them get baskets.\n\n\"I just go out and have fun,\" he said. \"I don't know if it's the most fun I've had, but it's definitely at the top because the group of guys we have -- everybody is so unselfish. Everybody is willing to do great things, and everybody wants to get better.\"\n\nWestbrook fell short of becoming the first Thunder player to score at least 40 points in four straight games, but he still dominated. Adams, who scored 12 points in the third quarter, said Westbrook makes his job easy.\n\n\"It was cool,\" Adams said. \"It's cool just getting layups and stuff. It was all Russ. I just finished it off. Can't take credit for that one.\"\n\nThe Thunder shot 51.2 percent while winning their third straight.\n\nKarl-Anthony Towns scored 26 points and Andrew Wiggins had 23 points for the Timberwolves. Minnesota had won three of five, including wins at Chicago and Atlanta.\n\nTowns kept Minnesota ticking in the first half with 16 points on 6-for-10 shooting. Adams put up more resistance after the break, and Towns had 10 points on 4-for-10 shooting in the second half.\n\n\"With those players, you just have to make them take the shots that you want,\" Adams said. \"If he makes it, you've just got to live with it. He's pretty much got the whole repertoire -- drives, put it on the ground, 3s, whatever. So as long as you just try to keep him within a box, and that's the lowest percentage shot he can get, that's what you have to live with.\"\n\nSemaj Christon's 3-pointer at the halftime buzzer gave the Thunder a 57-53 lead.\n\nWestbrook had 17 points at halftime, then made 4 for 6 shots and dished out five assists in the third quarter. His driving layup and free throw pushed the Thunder's advantage to 99-86 midway through the fourth, and his lob to Adams for a one-handed dunk pushed Oklahoma City's lead to 16.\n\n\"He's the MVP leader right now, so you've got to try and slow him down,\" Minnesota coach Tom Thibodeau said of Westbrook. \"He draws so much attention -- you know we've got to watch out for him. We've just got to stay solid and keep our assignments. We broke down a little in the second half.\"\n\nTIP INS\n\nTimberwolves: Shot 55 percent in the first quarter to take a 27-23 lead. ... Zach LaVine, who scored 40 points and hit seven 3-pointers Friday against Sacramento, finished with 16 points on 5-of-11 shooting, including 3 of 5 on 3-point tries. ... Minnesota was outrebounded 42-36. ... Guard Ricky Rubio had 10 assists.\n\nThunder: Guard Victor Oladipo missed his seventh straight game with a right wrist sprain. ... Rookie F Domantas Sabonis, who had a season-high 20 points Friday at Boston, finished with three points. ... Westbrook was called for a technical foul with 1:34 left in the first half.\n\nSTAT LINES\n\nAdams and Kanter, known as the `Stache Brothers, combined to score 42 points on 17-for-22 shooting.\n\nQUOTABLE\n\nAdams, on Westbrook's moods: \"You can't judge him by his face because it's going all over the place,\" he said. \"You can't tell his emotions.\"\n\nUP NEXT\n\nTimberwolves: Host the Atlanta Hawks on Monday night.\n\nThunder: Play at Miami on Tuesday night.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764995302.0545301
}