{
  "game_id": "0022300191",
  "espn_id": "401584819",
  "date": "Nov 13, 2023",
  "matchup": "CLE @ SAC",
  "headline": "De'Aaron Fox's return sparks Kings to 132-120 victory over Cavs as Mike Brown earns 400th win",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox had 28 points and six assists in his return after missing two weeks with an ankle injury, and the Sacramento Kings gave coach Mike Brown his 400th career victory with a 132-120 win over the Cleveland Cavaliers on Monday night.\n\n\r\n              Domantas Sabonis added 23 points, 10 assists and nine rebounds for the Kings, who swept the Cavs a season ago. Keegan Murray had a season-high 25 points with five 3-pointers.\n\n\r\n              “It felt like tonight was kind of a night we’ve kind of been waiting on, where we put it together on the same night,” Murray said. “It felt like it flowed really well and it felt good for everyone.”\n\n\r\n              Donovan Mitchell led the Cavs with 22 points despite going scoreless in the first quarter. Caris LeVert had 21 points and Max Strus scored 19.\n\n\r\n              Sacramento had six players in double figures but the night belonged to Fox, who was repeatedly serenaded with “MVP! MVP!” chants in the second half.\n\n\r\n              Fox made an immediate impact in his first game back, scoring the first points of the night on a driving layup 11 seconds into the game. A first-time All-Star last season, Fox later scored on a reverse and sank a 3-pointer to help the Kings to a 33-25 lead.\n\n\r\n              “It felt good just to be able to go out there and contribute,” said Fox, who tested his ankle in practice this week and during shootaround. “When I got up today and wasn’t sore, I felt I was good to go.\n\n\r\n              \"I felt well enough to go out there and affect the game.”\n\n\r\n              That he did.\n\n\r\n              Fox came out strong again in the second quarter, then went cold late before giving Sacramento’s offense another spark in the third quarter. He had eight points, including an emphatic one-handed dunk off a bounce pass in the key from Malik Monk.\n\n\r\n              “His play and our play is going to start getting him the recognition he deserves,” Brown said of Fox. “The crazy part is he’s just scratched the surface of who he can be. When he gets there, look out.”\n\n\r\n              Brown, who led the Kings to the 2023 playoffs in his first season with the team, improved his coaching record to 400-254. The milestone win came against one of his former teams, as Brown coached Cleveland from 2005-10 and in the 2013-14 season.\n\n\r\n              “You feel all of the emotions: Fortunate, blessed, lucky,” said Brown, who thanked the Cavs, Lakers and several of the players he coached. “It has a lot to do with the people all around me. \n\n\r\n              \"It for sure is an honor to be a part of something like that in this league.”\n\n\r\n              Cleveland got within 126-115 late in the fourth quarter before Fox’s three-point play with 1:26 remaining helped secure the win.\n\n\r\n              “We didn’t execute the game plan,” Cavs coach J.B. Bickerstaff said. “If you allow teams like this, with the firepower that they have, to play freely, they’re going to get it going.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Portland on Wednesday. \n\n\r\n              Kings: Visit the Los Angeles Lakers on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996740.5564768
}