{
  "game_id": "0021900254",
  "espn_id": "401160896",
  "date": "Nov 27, 2019",
  "matchup": "CHA vs. DET",
  "headline": "Hornets beat Pistons for 8th straight time, 102-101",
  "body": "CHARLOTTE, N.C. --  Nothing seems to help the Charlotte Hornets shake out of a slump better than the Detroit Pistons.\n\nBismack Biyombo scored 19 points, Devonte Graham had 16 points and a career-high 15 assists and the Hornets beat the Pistons for the eighth straight time with a 102-101 victory on Wednesday night.\n\nRookie P.J. Washington added 17 points, Miles Bridges had 15 and Nic Batum 13 for Charlotte (7-11), which snapped a five-game losing streak. The Hornets haven't lost to the Pistons since the 2017-18 season.\n\nBlake Griffin scored 26 points for Detroit.\n\nCharlotte has only had three longer winning streaks against an opponent. The Hornets won 13 in a row over Orlando from 2016-18, 11 straight over the Pistons from 1993-95 and nine consecutive over the Chicago Bulls from 1999-01.\n\n\"We just shared the ball, played for each other and we care about each other,\" said Biyombo, who was making his second start of the season. \"I think that's the most important thing because at the end of the day we are all we got. The guys embraced the challenge from the coach yesterday as we came in.\"\n\nCharlotte coach James Borrego said that challenge was improve on the defensive end.\n\n\"Well, the last 24 hours, 48 hours, we talked about our defense,\" said Borrego, whose team entered the game 21st in the NBA in scoring defense at 113.9 points per game. \"I thought we got off to a good start defensively. We really did.\n\n\"Tonight was about our defense. That's what got it done.\"\n\nThe Hornets withstood a final Detroit possession that didn't end with a shot attempt despite three inbounds attempts in the final 12.3 seconds.\n\nAfter the final one with 7.9 seconds to play, Derrick Rose drove into the lane before passing to Luke Kennard on the left baseline. But Kennard couldn't get a shot off before the buzzer.\n\n\"I got it at the top,\" said the veteran Rose, who is playing his first season with Detroit. \"It was the spacing that was messed up. You live and you learn. First year with the team so you figure it out.\"\n\nPistons coach Dwane Casey knew it was a missed opportunity.\n\n\"Would've, could've, should've,\" said Casey, whose team lost 109-106 at Charlotte in the teams' first meeting on Nov. 15 on Malik Monk's 3-pointer at the buzzer. \"It always looks like it comes down the last play and the execution of it. Just scoring a little quicker and that comes from being together and understanding what we are doing. I can't fault anybody on that last play but just go a little quicker. We got what we wanted and were about to get what we wanted but just (go) a little sooner.\"\n\nCharlotte scored the game's first six points and led 25-14 with 5:11 left in the first quarter before the Pistons closed out the quarter strong to take a 32-31 lead.\n\nDetroit maintained a 60-55 halftime lead before Charlotte retook the lead for good at 82-80 late in the third quarter.\n\nA pair of 3-pointers by Griffin in the final 4:13 cut the Hornets' lead to 95-94 with 4:13 to play and then 102-101 with 41 seconds left.\n\nTIP-INS:\n\nPistons: Guard/forward Tony Snell played in his first game since Nov. 15 after missing four games with a left hip strain. Snell, who entered averaging 9.2 points, came off the bench and went scoreless in 19 minutes. He missed both field goal attempts, including one 3-pointer.\n\nHornets: Center Cody Zeller didn't play after a left hip injury in Monday's 117-100 loss at Miami. It was the second game this season that Zeller has missed; he missed the Oct. 25 loss to Minnesota due to personal reasons. Since Zeller's rookie year of 2013-14 when he played in all 82 games, he has missed 20, nine, 20, 49 and 33 games, respectively, in the previous five seasons.\n\nUP NEXT\n\nBulls: Host Charlotte on Friday.\n\nHornets: Visit Detroit on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996099.1534238
}