{
  "game_id": "0021900287",
  "espn_id": "401160929",
  "date": "Dec 01, 2019",
  "matchup": "LAL vs. DAL",
  "headline": "Luka gets 27, Mavs snap Lakers’ 10-game win streak 114-100",
  "body": "LOS ANGELES --  Luka Doncic dribbled up to LeBron James, stepped back and coolly drained a 3-pointer from well behind the line. The Dallas Mavericks’ driving force then threw a telling stare toward Dirk Nowitzki at courtside before he headed off to wrap up a major win.\n\nWhen the Mavs visited Staples Center a year ago, Doncic was nervous before he faced his boyhood idol, and he sought an autographed jersey afterward.\n\nAlthough the Slovenian youngster still admires the veteran star, Doncic is showing he belongs in the same galaxy.\n\nDoncic scored 21 of his 27 points in a dynamic second half, and the Mavericks snapped the Los Angeles Lakers’ 10-game winning streak with a 114-100 victory Sunday.\n\nDoncic also had 10 assists and nine rebounds in Dallas’ seventh victory in eight games. The Mavs erased a halftime deficit with a 28-5 run in an excellent third quarter led by Doncic, who had 16 points and five assists in the third after going 2 for 9 in a self-described “awful” first half.\n\n“It’s a great win that means a lot to us,” Doncic said. “It shows that we can play against big teams, too. We just need to keep it rolling.”\n\nThe Mavs comfortably maintained their big lead in the fourth, and Doncic provided some late showmanship by hitting that fourth 3-pointer over James and staring toward Nowitzki, who had center court seats.\n\n“He hit a couple of hellacious shots,” Dallas coach Rick Carlisle said. “There’s just a small handful of guys in the whole world that can hit them. LeBron James is one of them. He’s one of them. Those step-back 30-footers, it’s hard to describe how difficult the shot is, and how easy he makes it look.”\n\nDelon Wright had 17 points and nine assists, and Kristaps Porzingis added 15 points as Dallas underlined its status as a likely title contender with an inspired second half on the road against the NBA-leading Lakers, who had lost only once in 18 games since their season opener.\n\n“It means that we had a good day and did a lot of good things, but we need to stay humble,” Carlisle said. “Every time we have a game like this, people are more than ever throwing their best game at us. There’s a certain responsibility you have when you get on a roll like this. We need to understand it and keep our eye on the ball.”\n\nJames had 25 points, nine rebounds and eight assists for the Lakers, who dropped to 17-3 by losing this matchup between two of the NBA’s highest-scoring teams. The Lakers’ longest winning streak in 10 years ended with their largest defeat of the young season.\n\n“It’s one game,” said Anthony Davis, who had 27 points and 10 rebounds. “We’re not going to get down over this loss. We know what type of team we are, we know now. We played well. And they beat us, but we beat ourselves with the rebounding, so we know what we’ve got to do better.”\n\nLos Angeles had won six straight over Dallas, but neither team much resembles the rosters that played the last few seasons in these jerseys. After a year of impressive moves by both franchises, the Mavs and Lakers are positioned to be back among the NBA’s best.\n\nExactly one month after the Lakers earned an overtime victory in Dallas, the Mavs responded with an impressive all-around effort at Staples Center. The Lakers had their worst day of the young season -- or at least their worst quarter while Dallas outscored them 35-17.\n\n“They scored a few buckets, and we had a couple calls that went against us,” said Lakers coach Frank Vogel, who got a technical foul along with Kentavious Caldwell-Pope for arguing in the third. “I think our guys got consumed with that a little bit. But we didn’t really have an offensive pop the whole quarter, coming out of halftime. We’ve been really sharp and really consistent, but during that stretch we weren’t, and it cost us the game.”\n\nTIP-INS\n\nMavericks: Nowitzki got a standing ovation from the Staples Center crowd after the Lakers played a tribute video on the scoreboard during a timeout in the second quarter. ... Dwight Powell had 15 points and nine rebounds, and Justin Jackson scored 15 points.\n\nLakers: Kyle Kuzma played 21 minutes and scored four points despite spraining his ankle Friday against Washington. ... NL MVP Cody Bellinger and Dodgers teammate Kenley Jansen watched the game from courtside. ... Alex Caruso had 10 points and four rebounds.\n\nGETTING TOUGHER\n\nThe Lakers’ revamped roster just completed one of the best months in franchise history, going 14-1 in November while soaring to the top of the NBA standings. Davis and James have meshed seamlessly, while their supporting cast has embraced new coach Frank Vogel’s commitment to defense.\n\nBut the Lakers’ schedule gets much tougher in December, starting with this showdown and a three-game road trip in the upcoming week to Denver, Utah and Portland. James and Davis both expect to know more about their roster by January, and this opening game underlined the importance of a consistent effort, particularly on defense.\n\nUP NEXT\n\nMavericks: At New Orleans on Tuesday night.\n\nLakers: At Denver on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996024.088301
}