{
  "game_id": "0022000045",
  "espn_id": "401267205",
  "date": "Dec 28, 2020",
  "matchup": "LAL vs. POR",
  "headline": "Lillard, Trent shoot Blazers past champion Lakers, 115-107",
  "body": "LOS ANGELES -- — Damian Lillard scored 21 of his 31 points in the second half, and CJ McCollum had 20 points and 11 assists in the Portland Trail Blazers' 115-107 victory over the Los Angeles Lakers on Monday night.\n\n\r\n                    “Hopefully we can build on it,” Portland coach Terry Stotts said. “We realize that we can be a good team. We just beat the defending champs, and they’re a great team.\"\n\n\r\n                    Gary Trent Jr. matched his career high with seven 3-pointers while scoring 28 points in the Blazers' second straight win over the Lakers at Staples Center.\n\n\r\n                    “It makes us just a little bit more confident to be coming on the road and continuing to grow, continuing to build on our effort,” Lillard said. “We’re just getting more comfortable with each other, and we’re bringing our energy.”\n\n\r\n                    LeBron James had 29 points, nine rebounds and six assists for the NBA champions, who finished 2-2 on their season-opening homestand. Dennis Schröder added 24 points, but the Lakers' streak of 59 straight victories when taking a lead into the fourth quarter was snapped.\n\n\r\n                    Trent went 10 of 14 from the field while finishing two points off his career high in an impressive response after playing less than six minutes in Portland's win over Houston last Saturday.\n\n\r\n                    “I would assume any young player who was coming off the kind of season he had last season would expect to be in the rotation for more than six minutes,” Lillard said. “When that happened, I was like, ‘Let’s see how he responds.’ I think it says a lot about him that he came out and had this type of performance. It speaks to how tough he is mentally and how locked in he is to this season.”\n\n\r\n                    Los Angeles kept it close with strong games from James and Schröder, who clearly relishes his matchups with Lillard. But their teammates largely struggled on the second night of a back-to-back.\n\n\r\n                    “We were kind of stuck in mud a little bit,” Lakers coach Frank Vogel said. “I don’t know (why). We just had trouble sustaining that intensity.”\n\n\r\n                    The Lakers made a 15-0 run early in the second half and took a one-point lead into the fourth, but Lillard and McCollum traded big shots down the stretch. Portland finished on a 12-6 surge.\n\n\r\n                    TIP-INS\n\n\r\n                    Blazers: Carmelo Anthony and Nassir Little missed the game under the NBA's health protocols. ... Zach Collins sat out with a left ankle injury.\n\n\r\n                    Lakers: Alex Caruso missed the game under the NBA's health protocols. ... Los Angeles got just 23 bench points, led by Montrezl Harrell's nine.\n\n\r\n                    AD QUIET\n\n\r\n                    Anthony Davis had 13 points and 10 rebounds in a tentative return from a one-game absence due to a bruised calf. He managed just two points in 17 minutes in the first half, and went 1 for 4 in the second half.\n\n\r\n                    “We just weren’t moving the ball that well,” Vogel said. “I’ve got to make sure I get (Davis) the ball in opportunities where he can be aggressive.”\n\n\r\n                    UP NEXT\n\n\r\n                    Blazers: At Clippers on Wednesday.\n\n\r\n                    Lakers: At Spurs on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997942.3054411
}