{
  "game_id": "0021700947",
  "espn_id": "400975693",
  "date": "Mar 04, 2018",
  "matchup": "MIL vs. PHI",
  "headline": "Antetokounmpo scores 34 points, Bucks beat 76ers 118-110",
  "body": "MILWAUKEE -- The Milwaukee Bucks wouldn't quit.\nGiannis Antetokounmpo scored 14 of his 35 points in the third quarter and the Milwaukee Bucks snapped a four-game losing streak, scoring 36 points off the Philadelphia 76ers' season-high 26 turnovers in a 118-110 victory Sunday night.\n\"We came into this game with the mentality that we have to win no matter what\" Antetokounmpo said. \"They were up 19. They were up 20. We kept chasing.\"\nThe Bucks are the first team since Oklahoma City on March 4, 2015, against Philadelphia to come back from two deficits of at least 15 points in a game.\nEric Bledsoe added 22 points, and Jabari Parker had 13 to keep Milwaukee in seventh place in the Eastern Conference -- a half-game game behind the sixth-place 76ers.\nThe Bucks were down 86-72 to start the third, but quickly erased that deficit. Antetokounmpo scored 14 points to spark a 21-0 run to close out the quarter for a 93-86 lead. Milwaukee also capitalized on Philadelphia's nine turnovers, including five during the surge, for 11 points.\n\"We kept turning the ball over,\" Ben Simmons said. \"Offensively, we didn't make any plays. Didn't execute.\"\nSpeeding up the game was a key, according to Antetokounmpo.\n\"We had (Joel) Embiid on the floor,\" Antetokounmpo said. \"It is hard for him to play a fast pace. That's what I told the guys to do. That's what we did. That's why we were able to get a lead there.\"\nDario Saric scored 15 of his 25 points in the first quarter, Embiid had 19, JJ Redick 17 and Simmons 12 and 15 assists for the 76ers, but it wasn't enough. Antetokounmpo and the miscues were too much to overcome.\n\"It's just not the way we play. Not the way we should be playing,\" Simmons said. \"Everybody knows that. Once we're all are on the same page coming into games, I think we'll be fine.\"\nTurnovers, fouls and poor shooting by Philadelphia helped the Bucks chip away at their 20-point first-quarter lead. John Henson's 3-point play with 6:09 left in the second tied it at 51. The 76ers' T.J. McConnell hit a jumper to start a 21-9 run capped by Redick's 3-pointer for a 72-60 halftime lead.\nRobert Covington's 3 pulled Philadelphia to 102-98 in the fourth, but the Bucks responded with a 3 by Bledsoe and a jumper by Antetokounmpo to pull away. Philadelphia never got closer.\nThe Bucks' victory gives them a 2-1 edge in the series. They finish the season against each other April 11 in Philadelphia.\nTIP-INS\n76ers: Embiid banged his left knee in a scramble late in the first quarter. Embiid limped off the court, but returned to start the second. ... Philadelphia had 2½ sections of boisterous fans in the upper bowl.\nBucks: Tyler Zeller got knocked flat on his back after scoring on a dunk. Embiid sent him sprawling by brushing against him. It was a Flagrant 1 foul. Zeller eventually got up, made the free throw and then left for the locker room. He said his entire right-side hurts, but he should be fine. ... G Tony Snell started after missing the previous two games with a bruised right thigh.\nSIMMONS SIZZLES\nSimmons had 12 points, five rebounds and 15 assists. It was the rookie's 41st game with at least 10 points, five boards and five assists in his first 61 games. That's the most such games over that span of a player's career since at least 1963-1964, including nine more than Alvan Adams and 10 more than Hall of Famer Michael Jordan.\nEARLY BONUS\nThe Bucks put the 76ers into the bonus with four quick fouls in the first 54 seconds of the third quarter.\nBUCKS MOVES\nThe Bucks signed G/F Shabazz Muhammad waived by Minnesota on March 1. He appeared in 32 games, averaging 3.8 points, 1.4 rebounds in 9.4 minutes for the Timberwolves. Milwaukee recalled their 2017 first-round pick forward D.J. Wilson from the Wisconsin Herd of the NBA G League.\nUP NEXT\n76ers: At Charlotte on Tuesday night.\nBucks: At Indiana on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764992995.169398
}