{
  "game_id": "0022000897",
  "espn_id": "401307696",
  "date": "Apr 22, 2021",
  "matchup": "LAL @ DAL",
  "headline": "Doncic, Mavs beat Lakers 115-110 as LA star Davis returns",
  "body": "DALLAS -- — Anthony Davis is back for the Los Angeles Lakers. Now the Dallas Mavericks have to see how long they might without their big man, Kristaps Porzingis.\n\n\r\n                    Luka Doncic scored 30 points, leading the Mavericks to a 115-110 victory over the Lakers on Thursday night as Davis was rusty after missing 30 games with right calf and heel issues, the longest absence of the eight-time All-Star's career.\n\n\r\n                    Porzingis left in the third quarter and didn't return to the first of two consecutive games against the Lakers after spraining his left ankle.\n\n\r\n                    “I'm not sure where to begin on this one,” said Dallas coach Rick Carlisle, who said Porzingis hadn't been ruled out for the rematch Saturday, also on national TV just like this meeting. “A lot of ups and downs.”\n\n\r\n                    Playing for the first time in nearly 10 weeks, Davis scored four points on 2-of-10 shooting while limited to 17 minutes in the first half only. Coach Frank Vogel said the plan was 15 minutes, but Davis said the range was actually up to 20.\n\n\r\n                    Davis' final act in the final minute of the first half was forcing Josh Richardson to miss in the lane despite not even challenging the shot. Earlier he blocked a shot by the 7-foot-3 Porzingis and forced Doncic to throw up an air ball by closing on him.\n\n\r\n                    “He impacts the game on both ends, but his defense was great,” Vogel said. “He picked up right where he left off. He's one of the best defensive players in the league when he's got his legs under him and his conditioning.”\n\n\r\n                    Davis, who had four rebounds, also missed two free throws while settling for jumpers but also failing to convert at the rim. His first bucket was a jumper from the top of the key after five misses.\n\n\r\n                    Davis was shut down after a 122-105 loss at Denver on Feb. 14, when the 28-year-old in his ninth season played just 14 minutes to start an LA slide of five losses in six games.\n\n\r\n                    With Davis on the bench for the rest of the game and fellow star LeBron James also watching from there with his sprained right ankle, the Lakers erased an 11-point halftime deficit and were within four with three minutes remaining but Dallas held on.\n\n\r\n                    “It was better than expected,” Davis said. “I felt really good. It’s tough when you have to watch the whole second half and not be able to contribute on the floor.”\n\n\r\n                    With James expected to miss at least two more weeks, the Lakers dropped to 7-10 since his injury. The defending NBA champs are fifth in the Western Conference, one spot out of home-court advantage in the first round of the playoffs.\n\n\r\n                    Porzingis, playing a back-to-back for just the third time this season as the Mavericks try to protect him after offseason knee surgery, scored 19 points before limping to the bench and eventually off the court after his latest injury.\n\n\r\n                    The Latvian missed the first nine games after the procedure on his right knee. Porzingis was out another three in a row with back tightness and has missed 19 games this season.\n\n\r\n                    Kentavious Caldwell-Pope scored a season-high 29 points, Dennis Schroder had 25 and 13 assists and Andre Drummond had 14 points and 19 rebounds for the Lakers.\n\n\r\n                    After Caldwell-Pope pulled LA within 110-106 with a 3, Dorian Finney-Smith answered with one after the teams traded misses. The Mavericks won their second straight at home after four consecutive losses at American Airlines Center.\n\n\r\n                    “For us, it’s playing hard, playing with high energy,” said Doncic, who had nine rebounds and eight assists with the Mavericks trying to climb about of the No. 7 seed and avoid the play-in portion of the postseason. “The games we lose, I think our energy wasn’t there, and we didn’t play hard. So I think those two things are the key to the playoff.”\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Drummond’s 19 rebounds were his most since joining the Lakers three weeks ago. ... Montrezl Harrell scored 14 points on 7-of-8 shooting\n\n\r\n                    Mavericks: All five Dallas starters finished in double figures. Josh Richardson scored 13 points, and Finney-Smith and Dwight Powell had 10 apiece. ... The Mavericks were dominated in rebounding in a loss to the Lakers in LA the second game of the season, but kept better pace this time. LA had a 45-38 edge.\n\n\r\n                    PERFECT PROPOSAL\n\n\r\n                    The Mavericks recognized North Texas senior softball pitcher Hope Trautwein, who earlier this month struck out all 21 batters in the first perfect seven-inning game in NCAA Division I history when every out was a strikeout.\n\n\r\n                    Trautwein even got a ring at the game, an engagement ring from her longtime boyfriend who proposed with some help from the Mavericks. The couple was part of a segment between quarters when pictures unscrambled on the video board revealed answers to trivia questions. The last one started as a question of who was the first general manager of the Mavericks, but the picture came into focus as the couple with “Will You Marry Me?” on the screen. She said yes.\n\n\r\n                    During an earlier timeout, Trautwein and her teammates were welcomed and shown while details of her April 11 performance against Arkansas-Pine Bluff were being announced.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997283.659551
}