{
  "game_id": "0022400585",
  "espn_id": "401705151",
  "date": "Jan 17, 2025",
  "matchup": "LAL vs. BKN",
  "headline": "Austin Reaves scores a career-high 38 points as Lakers hold on for 102-101 victory over Nets",
  "body": "LOS ANGELES -- — Austin Reaves scored a career-high 38 points, LeBron James had 29 and the Los Angeles Lakers held on to beat the Brooklyn Nets 102-101 on Friday night.\n\n\r\n              The Nets, who lost 126-67 to the LA Clippers on Wednesday night in a franchise-record 59-point defeat, had a chance to win it, but D’Angelo Russell missed a 3-pointer with 2.6 seconds remaining. James got the rebound as the Lakers won their second straight. \n\n\r\n              Reaves was 13 for 23 from the floor and 8 for 8 from the foul line. His previous career high was 35 points, accomplished twice, including Dec. 31 against Cleveland. Reaves had 15 points in the fourth quarter, including three 3-pointers.\n\n\r\n              Russell, traded by the Lakers to the Nets, had 19 points in his first game against his former team while Zaire Williams and Tosan Evbuomwan scored 15 apiece.\n\n\r\n              Takeaways\r\n              Nets: Had a 49-15 advantage in bench scoring, which included three players in double figures — Russell, Evbuomwan and Jalen Wilson (11).\n\n\r\n              Lakers: Reaves and James supplied more than half of the Lakers' points with Anthony Davis a late scratch due to plantar fasciitis in his left foot. Jaxson Hayes started in Davis’ place and scored six points along with nine rebounds.\n\n\r\n              Key moment\r\n              Reaves had an alley oop to James on a fast break to give the Lakers a 102-95 lead with 2:32 remaining. It ended up being their last basket of the game.\n\n\r\n              Key stat\r\n              The Lakers were 12 for 19 shooting in the fourth quarter, including five 3-pointers.\n\n\r\n              Up next\r\n              Nets visit Oklahoma City on Sunday to finish a six-game trip, and Lakers play at the Los Angeles Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997174.718729
}