{
  "game_id": "0022300836",
  "espn_id": "401585464",
  "date": "Feb 27, 2024",
  "matchup": "PHI @ BOS",
  "headline": "Jaylen Brown scores 31, Celtics pull away in fourth to beat 76ers 117-99",
  "body": "BOSTON -- — Celtics coach Joe Mazzulla doesn’t mind if his team struggles at times, if it learns and adapts along the way. \n\n\r\n              Boston had to do that against a 76ers team that limited the 3-pointers the Celtics often use to overwhelm opponents.\n\n\r\n              The result was what Mazzulla said afterward was one of its best games of the season. \n\n\r\n              Jaylen Brown scored 31 points and the Celtics earned their ninth straight win, powering past Philadelphia 117-99 on Tuesday night. \n\n\r\n              Brown said the victory was an example of how this team has grown this season. \n\n\r\n              “There’s a multitude of ways you can win throughout the course of a game,” Brown said. \"We got to the free-throw line, we got downhill, made some points in the paint that helped us. ...They got like 20 more shots than us, but if you make free throws and you’re aggressive, it can balance out.” \n\n\r\n              Jayson Tatum added 29 points, including 15 in the fourth quarter, to help the NBA-leading Celtics post their 25th consecutive home win over an Eastern Conference opponent. \n\n\r\n              Boston won despite connecting on just 5-of-22 3-pointers and committing 14 turnovers. But the Celtics outscored Philadelphia 64-48 in the second half and dominated with a 56-28 rebounding edge.\n\n\r\n              “We were able to win a different way,” Mazzulla said. “We've never said we have to win (shooting 3s). We always take what the defense gives us and we're one of the best teams doing that. And that's kind of our offensive philosophy — take the best shot and find the best shot.”\n\n\r\n              Mazzulla said he also enjoyed this game because it was an example of how Brown's game “is being defined by playmaking in general.”\n\n\r\n              “He’s just always in attack mode. I love what Jaylen is doing,\" Mazzulla said. \"He’s really reading the game and taking advantage of it.” \n\n\r\n              Tyrese Maxey led the 76ers with 32 points and five assists. Philadelphia has lost four of its last five and is just 4-8 since Joel Embiid was sidelined with a knee injury. \n\n\r\n              The 76ers cut what had been a 14-point deficit to 11 entering the fourth and made another surge to trim Boston’s lead to 91-89 with 8:49 to play.\n\n\r\n              The Celtics responded with 17 straight points, including eight from Tatum, to give themselves a 107-89 cushion with 4:31 remaining. \n\n\r\n              “A few missed shots led to transition for them and that opened up the game right there,” Philadelphia's Tobias Harris said. \n\n\r\n              Boston took a 53-51 edge into halftime, keyed by Brown’s 18 points in the opening 24 minutes. \n\n\r\n              Derrick White had three blocks in first quarter, part of a defensive effort that limited the 76ers to 39% shooting in the half. \n\n\r\n              The 76ers have slowly been getting players back from injury since sputtering into the All-Star break by losing five out of seven games. \n\n\r\n              Nicolas Batum (hamstring), De’Anthony Melton (back) and Kyle Lowry (conditioning) all were in action but were on minutes restrictions. \n\n\r\n              It didn’t prevent Melton from exiting in the second half with back spasms. He went 0 for 2 from the field and registered a rebound and assist over nine minutes. \n\n\r\n              In Lowry’s case it was just his third appearance since being bought out by Charlotte and being signed by the 76ers on Feb. 13.\n\n\r\n              The extra bodies did give Philadelphia an energy boost early, as it jumped out to an 11-4 lead to open the game. But Boston quickly erased it, responding with an 11-0 run. \n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Hornets on Friday.\n\n\r\n              Celtics: Host Mavericks on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996417.342738
}