{
  "game_id": "0022000789",
  "espn_id": "401307582",
  "date": "Apr 08, 2021",
  "matchup": "DET @ SAC",
  "headline": "Joseph scores 24, Pistons beat Kings 113-101",
  "body": "SACRAMENTO, Calif. -- — Cory Joseph had a season-high 24 points and seven assists in his first game against his former team, Jhalil Okafor made a timely return after missing nearly two months following knee surgery, and the short-handed Detroit Pistons beat the Sacramento Kings 113-101 on Thursday night.\n\n\r\n                    Isaiah Stewart added 16 points and 13 rebounds in place of injured Mason Plumlee for the Pistons. Okafor, who had missed 27 games following left knee surgery, scored 11 points. Killian Hayes also had 11.\n\n\r\n                    “I felt like it was very important that we come out from the start and throw the first punch and play hard throughout the whole game,” Stewart said. “We were diving on the floor in the first quarter. That’s the way it has to be every game.”\n\n\r\n                    Detroit entered an East-worst 15-16 but led comfortably against slumping Sacramento after going up by 22 early in the third quarter.\n\n\r\n                    It’s the Pistons second win on their five-game road trip. Detroit still has to go to Portland and Los Angeles to face the Clippers.\n\n\r\n                    “The one thing that the guys set the tone was our fight and our intensity,” Pistons coach Dwane Casey said. “The second thing that happened was our ball movement. That set the tone even with our two starters out. Attention to detail defensively was huge for us and had them playing catch-up the entire night.”\n\n\r\n                    The Pistons were without starters Plumlee (concussion evaluation) and Jerami Grant (sore right knee) but did get Okafor back.\n\n\r\n                    Joseph was the difference after spending two seasons with the Kings before getting traded to Detroit along with two second-round picks at the deadline in exchange for Delon Wright. The veteran guard hadn’t scored more than 17 since then but broke out in his return to Golden 1 Center.\n\n\r\n                    Joseph shot 10 of 14 and scored six of Detroit’s final eight points after the Kings had pulled to 105-94.\n\n\r\n                    “Obviously playing against my former team, you want to get the,” Joseph said. “We had a complete game. We have a lot of young guys, a lot of young talent and they’re just soaking it up. It’s lovely to see. That’s an organization that is going in the right direction.\n\n\r\n                    De’Aaron Fox had 23 points, seven assists and nine rebounds for the Kings. Sacramento has lost five straight. On Monday the Kings fell to the Minnesota Timberwolves, who have the worst record in the West.\n\n\r\n                    “That was absolutely unacceptable,” coach Luke Walton said. “It’s not OK. It’s frustrating. We’re making a lot of the same mistakes.”\n\n\r\n                    Buddy Hield added 15 and Harrison Barnes scored 13. \n\n\r\n                    Joseph made a three-point play following Buddy Hield’s third foul to put the Pistons up by 17 late in the first half then later added a layup just before the buzzer to make it 62-44.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Hamidou Diallo scored 10 points. \n\n\r\n                    Kings: Fox picked up his fourth foul with seven minutes left in the third and had only one the rest of the game. … Sacramento was outrebounded 43-38. \n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: At Portland on Saturday. The Trail Blazers have won two straight in the series, dating to last season.\n\n\r\n                    Kings: At Utah on Saturday. Sacramento hasn’t won in Salt Lake City since Nov. 21, 2018.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997908.306134
}