{
  "game_id": "0022400850",
  "espn_id": "401705416",
  "date": "Feb 28, 2025",
  "matchup": "DEN @ DET",
  "headline": "Jokic has a triple-double to help Denver snap Detroit's 8-game winning streak, 134-119",
  "body": "DETROIT -- — Nikola Jokic had 23 points, 17 rebounds and 15 assists, Jamal Murray scored 31 points, and the Denver Nuggets ended the Detroit Pistons' eight-game winning streak with a 134-119 win on Friday night.\n\n\r\n              Michael Porter Jr. scored 28 points and Christian Braun matched Jokic with 23 for Denver, which has won 11 of its last 13 games.\n\n\r\n              Malik Beasley had 16 points as Detroit's sixth man, but the Pistons' starters were outscored 113-54. Cade Cunningham finished with 11 points on 3-for-12 shooting and only had five assists and three rebounds. \n\n\r\n              The Nuggets led 107-87 going into the fourth quarter and Detroit never made a significant run, although they cut the deficit from 25 to 15 in garbage time.\n\n\r\n              Takeaways\r\n              Nuggets: Denver scored 39 points in the first quarter and 39 again in the third as they scored 134 against Detroit for the second time this season.\n\n\r\n              Pistons: The Pistons went 9-3 in February after going 10-6 in January. Before that, they had gone an NBA-record 37 straight months without a winning record.\n\n\r\n              Key moment\r\n              Detroit was only down 68-63 at halftime, but Denver started the third quarter with a 27-9 run. Murray scored 12 points while Jokic had four assists and six rebounds. The Nuggets shot 71.4% (10 for 14) during the run while Detroit was at 21.4% (3 for 14).\n\n\r\n              Key stat\r\n              Despite going 1 for 5 from the floor, Jokic had 10 points, eight rebounds and eight assists in the first half. He made eight of nine free throws and drew enough whistles to put Pistons centers Jalen Duren and Isaiah Stewart on the bench with foul trouble.\n\n\r\n              Up next\r\n              The Pistons finish a back-to-back by hosting the Brooklyn Nets on Saturday, while the Nuggets finish a four-game road trip on Sunday against the Boston Celtics.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998345.346508
}