{
  "game_id": "0022300234",
  "espn_id": "401584862",
  "date": "Nov 22, 2023",
  "matchup": "CHI @ OKC",
  "headline": "Gilgeous-Alexander scores 40, Thunder beat Bulls for sixth straight victory",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 40 points and 12 assists, Chet Holmgren added 18 points, 13 rebounds and four blocked shots, and the Oklahoma City Thunder beat the Chicago Bulls 116-102 on Wednesday night for their sixth straight victory.\n\n\r\n              Isaiah Joe scored 20 points for the Thunder (11-4), on their longest winning streak since the 2018-19 season.\n\n\r\n              Gilgeous-Alexander raised his average to 30 points for the season and was showered with “MVP! MVP!” chants as he closed out the game with six free throws down the stretch.\n\n\r\n              In his fifth season with the Thunder, Gilgeous-Alexander moved up to third on the Oklahoma City scoring list, behind Kevin Durant and Russell Westbrook. \n\n\r\n              “Stuff like that is always cool. It’s what you dream of as a kid. Obviously the list has some heavy hitters on it,” Gilgeous-Alexander said. “We won tonight and that’s all that really matters.”\n\n\r\n              Gilgeous-Alexander is seeing more double-teams as opponents try to get the ball out of his hands and he credits that for being able to rack up more assists. He accounted for 71 of the Thunder's 116 points Wednesday.\n\n\r\n              “It’s been a process. I feel like I’m getting better at it. The best players to ever play go through it,” Gilgeous-Alexander said. “Coach (Mark Daigneault) has been great with helping me. My teammates have been really good, knowing it’s coming as well getting ready in spots knowing the ball is coming out of the trap to make plays and make the next basketball play.”\n\n\r\n              Daignault was as impressed with Gilgeous-Alexander’s defense as well as his offense and commended his star player and the team for being gritty down the stretch.\n\n\r\n              “It’s not football, where you just play quarterback,” Daignault said. “To have a guy as engaged and smart as he is, obviously with his length he gets deflections and blocks. He was a two-way player tonight, not just with his scoring. I thought he took what they gave him as far as early passes, getting his teammates involved.\"\n\n\r\n              DeMar DeRozan, after making just one basket in the first half, led the Bulls with 25 points.\n\n\r\n              After being held to 14 points in the first quarter, the Bulls (5-11) got five 3-pointers from Coby White in the second period, but the Bulls still trailed 50-39 at the half. White finished with 23 points, including a season-high seven 3-pointers.\n\n\r\n              Chicago chipped away at the Thunder’s 11-point halftime lead, tying the game midway through the third quarter on a bucket and free throw from DeRozan before Oklahoma City got back-to-back 3s from Joe and Kenrich Williams to give the Thunder the lead they never relinquished.\n\n\r\n              “It’s a struggle when you lose, but I see them fighting and trying,” said Bulls coach Billy Donovan. “We just haven’t been consistent enough, and we haven’t been consistent in shooting the basketball. I felt our guys were really trying. We just have these stretches where we dig ourselves somewhat of a hole. We just have to keep fighting through and being more consistent.”\n\n\r\n              The Bulls, playing without Zach LaVine because of a sore right foot, could get no closer than three in the final period before Gilgeous-Alexander finished the contest with eight straight points.\n\n\r\n              Oklahoma City won both meetings against the Bulls this season. \n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Toronto on Friday.\n\n\r\n              Thunder: Host Philadelphia on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995916.248538
}