{
  "game_id": "0021900797",
  "espn_id": "401161439",
  "date": "Feb 10, 2020",
  "matchup": "SAC @ MIL",
  "headline": "Middleton, Bledsoe help Bucks beat Kings minus Antetokounmpo",
  "body": "MILWAUKEE --  The Milwaukee Bucks presented Giannis Antetokounmpo a victory as a baby gift.\n\nKhris Middleton and Eric Bledsoe scored 28 points apiece to pace Milwaukee past Sacramento 123-111 on Monday night as the Bucks won without new father Antetokounmpo.\n\nAntetokounmpo, the reigning MVP, missed the game after he and his girlfriend welcomed their first child, which he announced earlier Monday on his Twitter account.\n\n\"They are a good team. They are very balanced, they play a really good system,\" said Kings guard Buddy Hield. \"Bledsoe leading the charge tonight, him and Middleton. Giannis was out, but those guys were able to get going. They are tough covers. We got to do a better job just containing them and making things uncomfortable for them but we didn't do that and in the third and fourth quarter and they got it going. \"\n\nMilwaukee trailed 90-88 after three quarters, but opened the final period with 13 consecutive points as Sacramento missed its first five shots. Bledsoe capped the run with back-to-back 3 pointers to put the Bucks up 101-90.\n\n\"We were saying going into the fourth, whoever starts playing defense, starts getting stops is going to take the game away,\" Bucks center Brook Lopez said. \"That's what that group did who was out there at the beginning of fourth. It fueled us and we continued to ride on that through the whole fourth quarter.\"\n\nBogdan Bogdanovic hit two free throws to pull the Kings within 103-97 with 5:58 remaining. Sacramento had a chance to cut it to four, but Middleton came up with a steal and scored on a breakaway jam.\n\n\"Khris knocks the ball away, gets the deflection, and then gets out and gets the break,\" Bucks coach Mike Budenholzer said. \"I think it was a six-point game right then and they had the ball and a chance to maybe cut it to four, instead we're back up to eight and feel more confident.\"\n\nDonte DiVincenzo's 3-pointer pushed the Bucks' lead to 111-100 with 3:35 left.\n\nHarrison Barnes had 23 points and De'Aaron Fox added 17 for the Kings, who had won four of their previous five.\n\nLopez added 20 points for the Bucks, who improved their NBA-best record to 46-7. Milwaukee is 4-6 when trailing after three quarters. The Bucks also are 5-0 in games without Antetokounmpo this season.\n\nSacramento, which trailed 38-24 after one quarter, took its first lead at 57-56 on Nemanja Bjelica's layup with 37 seconds left in the half. After making 16 of 31 shots in the first quarter, including 5 of 12 from beyond the arc, the Bucks were just 6 of 21 in their 19-point second quarter.\n\n\"We gave ourselves a chance,\" Kings coach Luke Walton said. \"Obviously the start of the fourth quarter really hurt. The start of the game, I just thought we had too many turnovers that were unforced. Sloppy ones, that if you are going to win on the road in the NBA you can't have.\"\n\nTIP-INS\n\nKings: Forward Jabari Parker, acquired at the trade deadline from Atlanta -- where he missed 20 of his last 21 games with a right shoulder impingement -- was inactive Monday for the third consecutive game with Sacramento. Coach Luke Walton said there is a chance Parker could play Wednesday at Dallas.\n\nBucks: Milwaukee signed veteran forward Marvin Williams on Monday and waived forward Dragan Bender. Williams, in his 15th season, averaged 6.7 points and 2.7 rebounds in 41 games with Charlotte this season. The 6-foot-8 Williams, the second overall pick in the 2005 draft by the Atlanta Hawks, has averaged 10.3 points and 5.2 rebounds over his career. Bender averaged 3.7 points in seven games with the Bucks and also played in 13 games for the Wisconsin Herd of the NBA G League.\n\nUP NEXT\n\nKings are at Dallas on Wednesday.\n\nBucks are at Indianapolis on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996391.3765628
}