{
  "game_id": "0021800933",
  "espn_id": "401071606",
  "date": "Mar 01, 2019",
  "matchup": "SAC vs. LAC",
  "headline": "Clippers hold off Kings 116-109 to improve playoff position",
  "body": "SACRAMENTO, Calif. --  The Los Angeles Clippers finally gained some ground in the crowded Western Conference playoff race, although coach Doc Rivers knows it's still too early to make much of it.\n\nIf nothing else, Rivers realizes his squad has an important tiebreaker against Sacramento after dealing a serious blow to the Kings' bid at ending the NBA's longest active playoff drought.\n\nLandry Shamet scored eight of his 20 points in the fourth quarter, Lou Williams made two free throws with 7.9 seconds left and the Clippers held off the Kings 116-109 on Friday night.\n\nDanilo Gallinari had 19 points and nine rebounds, Shai Gilgeous-Alexander scored 15 and Ivica Zubac added 10 points and 10 rebounds to help the Clippers complete a season sweep of the Kings in a game that was critical for both teams' postseason hopes.\n\n\"This was an important game for sure,\" Shamet said. \"You pay attention to the playoff standings, where teams are. You don't want to look too far ahead but they're right with us. Definitely the playoff race adds motivation.\"\n\nLos Angeles moved a half-game ahead of San Antonio for seventh place in the West. Sacramento, which has lost four of five since the All-Star break, is two games behind the Spurs for the final postseason spot in the conference.\n\n\"Our guys responded to their runs,\" Rivers said. \"They had the lead at halftime and guys just kept playing. They played the game like they were going to win the game. That was on their mind. They didn't know how we were going to win but they wanted to win and we played like that.\"\n\nIt wasn't easy.\n\nThe Kings trimmed a 13-point deficit to 110-107 with 1:16 remaining following back-to-back dunks from Harrison Barnes and Cauley-Stein.\n\nWilliams made a short jumper then added two free throws after De'Aaron Fox scored on a layup. Montrezl Harrell added a pair of free throws with 1.5 seconds left.\n\nThe Clippers have won nine straight against the Kings, including all four matchups this season. That gives Los Angeles a critical advantage should the teams finish the regular season in a tie.\n\nShamet thought the playoff atmosphere of this game will help the Clippers prepare for the stretch run.\n\n\"You don't ever want to be comfortable,\" he said. \"If you can build that mentality now, especially at the end of the season going into the playoffs and then you already have it at that point, it's definitely an advantage.\"\n\nBuddy Hield had 23 points for Sacramento. Fox added 12 points and 12 assists, and Willie Cauley-Stein had 16 points and 12 rebounds.\n\n\"They have been a tough team for us and a tough matchup for us all year,\" Kings coach Dave Joerger said. \"They got a lot of loose balls and it seems like we didn't make a lot of shots. They just made more plays.\"\n\nNeither team gained much of an advantage during a back-and-forth first half. The Clippers led by 10 midway through the first quarter but Harry Giles made back-to-back shots and Hield added three free throws to put the Kings ahead 56-52 at halftime.\n\nTIP-INS\n\nClippers: Los Angeles grabbed a season-high 58 rebounds and improved to 27-5 when beating opponents on the boards. . The Clippers had seven players score in double figures. . Zubac's double-double was his fifth of the season. ... Wilson Chandler sat out his ninth game with a quad injury.\n\nKings: Giles had 15 points off the bench on 7-of-13 shooting. ... Rookie forward Marvin Bagley III will be sidelined indefinitely with a left knee strain sustained during Wednesday's 141-140 loss to Milwaukee. Bagley, the second pick in last year's draft, underwent an MRI that was negative. He will be re-evaluated within the next two weeks.\n\nSTREAKING IN SACRAMENTO\n\nThe Clippers have won 13 straight games in Sacramento dating to 2013, a franchise record for most consecutive road wins against one team.\n\nLOU TIME\n\nWilliams scored 17 points in 28 minutes, 10 coming in the fourth quarter. Williams led the NBA in fourth-quarter scoring last season and is second this season behind Houston star James Harden. \"Fourth-quarter Lou, that's basically what he was tonight,\" Rivers said. \"He didn't have his rhythm but he found it when we needed it at the end of the game.\"\n\nUP NEXT\n\nClippers: Host the New York Knicks on Sunday.\n\nKings: Host the New York Knicks on Monday.\n\n---\n\nMore AP NBA:https://apnews.com/tag/NBA andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994868.918695
}