{
  "game_id": "0022200243",
  "espn_id": "401468398",
  "date": "Nov 20, 2022",
  "matchup": "MEM @ BKN",
  "headline": "Irving returns, Simmons scores 22 as Nets beat Grizzlies",
  "body": "NEW YORK -- — Kyrie Irving was playing again. Ben Simmons was playing like an All-Star again.\n\n\r\n              The Brooklyn Nets, who rarely get to enjoy normalcy for too long, could savor a night Sunday when things actually looked like they drew them up.\n\n\r\n              “It’s always nice to just focus on the game,” Kevin Durant said. \n\n\r\n              Irving returned from his suspension with 14 points, Simmons tuned up for his trip back to Philadelphia with a season-high 22 and the Nets beat the short-handed Memphis Grizzlies 127-115 on Sunday night. \n\n\r\n              Durant scored 26 points, giving him at least 25 in all 17 games this season. That's the longest streak to start a season since Rick Barry did it in 25 straight in 1966-67.\n\n\r\n              But it was the surprise scoring of others who sparked the Nets in this one. Simmons had his first 20-point game since for playing for the 76ers in the 2021 playoffs, and Yuta Watanabe had 16.\n\n\r\n              The Nets announced Irving would be available to play Sunday morning, after he apologized to anyone who felt threatened or hurt when he posted a link to a documentary with antisemitic material on his Twitter page. They suspended him days later after he had refused to apologize or clarify his beliefs, and he missed eight games.\n\n\r\n              Irving got a good ovation after resuming his spot as the last player announced during starting lineups, then made a 3-pointer on his first shot attempt. He missed his other four shots in 13 first-half minutes.\n\n\r\n              “Felt good, felt good,” Irving said. “Just missed my teammates, missed the coaching staff.” \n\n\r\n              Dillon Brooks scored 31 points for the Grizzlies, who were without All-Star Ja Morant, Desmond Bane and Jaren Jackson Jr. But they trailed by only three after three quarters before Brooklyn opened the fourth with an 18-5 spurt, featuring four 3-pointers from Watanabe, to break it open at 114-98.\n\n\r\n              “It was, I thought, a heck of a first three quarters,” Memphis coach Taylor Jenkins said. “Three-point game, just didn’t make enough plays in the fourth quarter. They got hot.” \n\n\r\n              Simmons returned to the starting lineup with center Nic Claxton out for personal reasons. Coming off his best game of the season Thursday in Portland, he was even better in this one, shooting 11 for 13 with eight assists and five rebounds. \n\n\r\n              Coming off back surgery that kept him from playing last season, Simmons didn't even have a double-figure scoring game until his 10th game this season.\n\n\r\n              “I know what I can do. I know what I’m capable of. I’m not surprised,” Simmons said. \n\n\r\n              The No. 1 pick in the 2016 draft is set to face the 76ers on Tuesday for the first time since they granted his trade request last February. \n\n\r\n              Brooks had 17 points at halftime as Memphis led 62-57, but Durant scored 14 points in the third and Simmons made all four shots for eight more as Brooklyn tied a season best with 39 points, taking a 96-93 edge to the fourth.\n\n\r\n              Morant and Bane both scored 38 points when the Grizzlies beat the Nets on Oct. 24. But Morant has a sprained left ankle and Bane a sprained right big toe.\n\n\r\n              Jaren Jackson Jr. also sat to rest after playing in two games following a 14-game absence to begin the season while recovering from right foot surgery.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Memphis had its seven-game winning streak against the Nets snapped. ... Steven Adams had 15 points and 10 rebounds, but shot 1 for 8 at the free throw line. \n\n\r\n              Nets: Watanabe has reached double figures in four straight games for the first time in his career. ... Brooklyn was playing one of only two home games in a 12-game stretch. The Nets returned from a four-game West Coast trip for this game, then go right back on the road for three in a row starting Tuesday at Philadelphia. \n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Sacramento on Tuesday.\n\n\r\n              Nets: At Philadelphia on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994230.1210508
}