{
  "game_id": "0021900224",
  "espn_id": "401160866",
  "date": "Nov 22, 2019",
  "matchup": "HOU @ LAC",
  "headline": "Leonard hits winner to lift Clippers over Rockets 122-119",
  "body": "LOS ANGELES --  Down five points with a minute to go, the Los Angeles Clippers turned to a trio of veterans.\n\nKawhi Leonard, Paul George and Lou Williams combined to outscore the Houston Rockets 10-2 the rest of the way and Leonard hit the winning jumper with 15 seconds remaining for a 122-119 victory Friday night.\n\n\"We made shots, got stops, we played with confidence,\" said Williams, who led the Clippers with 26 points -- all in the second half.\n\nLeonard finished with 24 points and George added 19 in the superstars' second game together. Montrezl Harrell had 18.\n\n\"We fight hard. We leave it all out there on the court,\" Harrell said. \"We never feel like we're out of a game.\"\n\nP.J. Tucker's turnaround hook put the Rockets up by five with a minute left. George hit a 3-pointer to trim the margin to two, and JaMychal Green blocked Clint Capela's shot at the other end. Williams then drained a 3 from the right corner that gave the Clippers a 118-117 lead with 30 seconds remaining.\n\nJames Harden made a pair of free throws for a one-point Houston lead before Leonard's pull-up jumper gave Los Angeles the lead for good.\n\n\"Lou set a great pick,\" Clippers coach Doc Rivers said. \"All Kawhi needs is an inch and he got it.\"\n\nRussell Westbrook missed at the other end and George got the rebound while getting fouled. He made both free throws with one second left to complete a wild finish and help the Clippers improve to a franchise-best 10-1 at home with their fourth win in a row overall.\n\n\"You got Lou, Kawhi and Paul George. They're going to be composed,\" Rivers said. \"They've been in big games. Each one made a big shot down the stretch.\"\n\nHarden scored 37 points, making a career-high 11 3-pointers and sinking 14 of 18 free throws. He also had 12 assists.\n\nWestbrook added 22 points before fouling out late, and Capela had 17 points and 19 rebounds. Those three plus Tucker had at least four fouls.\n\n\"We didn't finish the way we needed to, obviously, but we were very, very confident,\" Harden said.\n\nThe teams traded leads in the fourth with neither leading by more than four until the final 1 1/2 minutes.\n\nThe Clippers are still honing their chemistry, having just gotten Leonard and George together in games.\n\n\"We're basically learning within these games, but there comes a time in the game where it feels like we find a way,\" George said. \"We execute at the right times. We find the stops we need at the right times.\"\n\nBecause of their schedule, the Clippers haven't been able to have full practices. Most of their work gets done at game-day shootaround.\n\n\"I think probably we get in a little rhythm in the fourth quarter,\" Leonard said. \"Not being able to practice with each other, when we go out there we start seeing what the opponent's doing on both ends of the floor and kind of just get into a rhythm. We play our best basketball in the fourth quarter. Everyone's trying to make shots, execute and play great defense.\"\n\nThere were none of the theatrics that marked their last meeting, an overtime win by the Rockets in Houston on Nov. 13. Harden scored 47 points, Rivers got ejected with his rival son Austin egging on the referees and Westbrook disparaged Patrick Beverley's defense on Harden.\n\nBeverley and Ivica Zubac were in foul trouble for the Clippers.\n\nThe Rockets took their first lead of the game on Harden's 3-pointer during a 16-2 run, including 11 straight points, early in the third. He got fouled and made the free throw before hitting another 3 and Westbrook followed with one of his own that helped put the Rockets up 70-59.\n\nThe Clippers regrouped and finished off the quarter on a 21-14 spurt to trail 84-80 going into the fourth. Williams scored 14 points in the period.\n\nThe Clippers led by 14 in the second. That's when Houston closed on a 19-9 run to trail 55-51 at halftime.\n\nTIP-INS\n\nRockets: They fell to 5-4 on the road. ... Harden and Westbrook are averaging 20-plus points per game. The last time Houston had two players averaging that many in a season was 2007-08 with Yao Ming (22.0) and Tracy McGrady (21.6). ... Daniel House Jr. missed his fourth straight game with a sacral contusion.\n\nClippers: Landry Shamet is off crutches but remains out with a high ankle sprain.\n\nNO TIME OUT\n\nThe Rockets were annoyed that Doc Rivers was on the court trying to call a timeout during a play that resulted in a 3 in the closing seconds for Los Angeles.\n\n\"No one saw me,\" the coach said, referring to the referees.\n\nRockets coach Mike D'Antoni said, \"We had three officials and nobody saw him out there so it is what it is. The whole team saw him out there. Everyone saw him out there. That was a big play.\"\n\nNEW LOOK\n\nThe Clippers wore their new city edition jerseys for the first time. They feature Los Angeles in an Old English font inspired by L.A. artist Mister Cartoon. The jersey is mostly white and black with hints of blue and red, a nod to the team's main colors. The city's name appeared on the court in Old English font and the court featured Los Angeles geography woven into its black border through lines mapping out the city's roads and highways. The Clippers will wear the uniforms at 16 other games this season, including on Christmas against the Lakers. \"I like them a lot,\" Williams said.\n\nUP NEXT\n\nRockets: Host Dallas on Sunday to begin a three-game homestand that closes out the month.\n\nClippers: Host New Orleans on Sunday to conclude a stretch of five straight home games.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996649.713482
}