{
  "game_id": "0022000145",
  "espn_id": "401307826",
  "date": "May 09, 2021",
  "matchup": "MIA @ BOS",
  "headline": "Butler strong down stretch, Heat hold off Celtics 130-124",
  "body": "BOSTON -- — Jimmy Butler had 26 points and 11 assists to help the Miami Heat hold off the Boston Celtics 130-124 Sunday as the teams fight for position in the tight Eastern Conference playoff race. \n\n\r\n                    Duncan Robinson added 22 points and Bam Adebayo finished with 20 for Miami, which increased its lead over Boston to two games for sixth place in the standings. The Heat (37-31) now have the same record as fifth-place Atlanta, but the Hawks own the head-to-head tiebreaker. \n\n\r\n                    It is the first of two straight games between Miami and Boston, which meet for the final time during the regular season on Tuesday. \n\n\r\n                    “It always feels great win,” Butler said. “But I don't think that we closed the game like we're supposed to or capable of either. So at the same time we've got to be better.\"\n\n\r\n                    Evan Fournier scored 30 points to lead the Celtics (35-33), who have lost three out of four as they try to avoid the play-in round of the playoffs. Jayson Tatum added 29 points and Kemba Walker finished with 18. \n\n\r\n                    Boston struggled offensively without All-Star Jaylen Brown, who missed his third straight game with a sprained right ankle. Big man Robert Williams III tried to play through turf toe in his left foot, scoring four points in 11 minutes in the first half. But he labored on it at times and was scratched for the second half. \n\n\r\n                    “When we’re not completely engaged for whatever reason, we’re just not good,\" Celtics coach Brad Stevens said. \"When we’re completely engaged, we’re a good basketball team. When we’re not, we’re not even close to being able to compete with anybody, let alone a team like Miami.” \n\n\r\n                    Miami led by as many as 26 in the first half before Boston stormed back, opening the third quarter on a 22-8 run to get within 12 points. \n\n\r\n                    The Celtics kept chipping away and cut it all the way to 113-107 with 4:51 to play on a layup by Walker.\n\n\r\n                    It was 118-109 when Fournier got free in the corner for a 3. But Robinson answered with his own 3 on Miami’s ensuing possession to push the lead back to 121-112. \n\n\r\n                    Walker turned it over on Boston’s next trip and Adebayo scored on a put back to get the lead back to double digits. \n\n\r\n                    Miami was able to close things out at the free-throw line. \n\n\r\n                    Despite having its lead eroded in the second half, Heat coach Erik Spoelstra he liked the early effort. \n\n\r\n                    “The menu was diverse and a lot fo guys felt like they were in rhythm and involved. That’s when we’re at our best. When there's a lot of different threats,\" Spoelstra said.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Robinson has now a 3-pointer in 44 consecutive games. He set the franchise record, connecting on 57 consecutive 3s last season. … Victor Oladipo remained sidelined with right knee soreness, missing his 16th consecutive game. He’s appeared in only four games for the Heat since being acquired at the trade deadline by Miami.\n\n\r\n                    Celtics: The 79 points allowed in the first half was a season high by an opponent. … Have now allowed 70 or more points in a half three times over their last five games (Portland 71, San Antonio 77). \n\n\r\n                    EARLY ACTION\n\n\r\n                    The Heat controlled the pace early and shooting 75 percent (15 of 20) in a key second quarter in which they outscored the Celtics 43-20\n\n\r\n                    Defensively Miami tried to take the ball out of Tatum’s hands as much as possible, sending multiple double-teams his way and limiting him to just two field goal attempts in the opening 12 minutes. Tatum’s teammates combined to shoot just 7 of 17 from the field and 1 for 8 from 3.\n\n\r\n                    It set the tone for a half in which several of Boston’s empty offensive possessions turned into 14 fast break points for Miami. \n\n\r\n                    Boston left the floor at halftime to a chorus of boos from the pandemic-limited TD Garden crowd. \n\n\r\n                    INJURY UPDATE\n\n\r\n                    Stevens said Williams wasn't comfortable enough to keep going at halftime. His status will be closely monitored by the medical staff. Stevens said he will be a game-time decision for the immediate future.\n\n\r\n                    UP NEXT\n\n\r\n                    Meet for their final matchup on Tuesday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996749.256384
}