{
  "game_id": "0021500402",
  "espn_id": "400828289",
  "date": "Dec 19, 2015",
  "matchup": "MEM vs. IND",
  "headline": "Gasol, Barnes lead Grizzlies past Pacers 96-84",
  "body": "MEMPHIS, Tenn. --  Even as the Memphis Grizzlies transition into a small-ball style team, they realize defense is still the key to their success.\n\nMemphis forced Indiana into 17 turnovers and 39 percent shooting in a 96-84 victory over the Pacers on Saturday night.\n\n\"I thought defensively, we were much more consistent, as we are supposed to be,\" said center Marc Gasol, who had 19 points, 12 rebounds and six assists for Memphis. \"We're still not going to score 125 points a game, that I'm pretty sure of. Defensively, we need to do the things we're supposed to do.\"\n\nMatt Barnes finished with 15 points and 10 rebounds, while Mike Conley added 20 points and eight assists as the Grizzlies snapped a two-game skid. Mario Chalmers had 12 points for Memphis and Jeff Green added 11.\n\n\"Guys are going to get used to it,\" Conley said of the offensive transition that began five games ago. \"We have enough talent in this locker room to win regardless of how we are playing -- slowing the ball down or running in transition.\"\n\nPaul George led the Pacers with 29 points, despite going 8 of 22 from the field. Monta Ellis scored 13 points and Rodney Stuckey had 11. Jordan Hill finished with 10 points and 13 rebounds.\n\nThe loss snapped Indiana's three-game winning streak, and the 84 points were well under the Pacers' average of 103.8 points, best in the Eastern Conference.\n\nMemphis shot 45 percent. Neither team shot well from outside the arc, Memphis converting 5 of 19, while the Pacers were 5 of 28 for 18 percent -- a season-low for Indiana on 3-point percentage.\n\n\"We didn't shoot the ball well,\" Indiana coach Frank Vogel said. \"We didn't play well enough in any area. We didn't defend well enough, we didn't run well enough, we didn't cover for each other on the defensive end well enough.\"\n\nMemphis pulled away in the fourth quarter, outscoring Indiana 26-18 as the Pacers converted only 5 of 15 shots in the period.\n\nThe Grizzlies, who at times have struggled in the third quarter, extended their 44-43 halftime lead to double digits this time. The advantage reached 12 points as Memphis connected on 50 percent of its shots through the bulk of the quarter.\n\nBut Indiana put together a 14-4 rally to pull to 66-64 before Memphis managed to carry a 70-66 lead into the final period.\n\nMemphis would build the lead back to double digits near the midway point of the fourth. The Pacers converted five straight free throws -- four of them by George -- to move closer at 88-80 -- but could not cut the lead further.\n\n\"We had a lot of good open shots that just weren't falling,\" Ellis said. \"I think it was more that our shots weren't falling, and (the Grizzlies) made some plays.\"\n\nTIP-INS\n\nPacers: Indiana's 16 first-quarter points matched its season low for points in an opening period. ... C.J. Miles, who had reached double figures in seven of the last eight games, was held scoreless, missing all nine of his shots. ... Of the Pacers 17 turnovers, seven were committed by George. ... It was Jordan Hill's sixth double-double of the season, and the first time Indiana has lost when the reserve center posts a double-double.\n\nGrizzlies: Memphis G Tony Allen missed his fifth straight game with a right knee injury. ... It was Barnes' second double-double of the season, and Gasol's seventh. ... Memphis outscored Indiana in the paint, 44-34.\n\nWISDOM WORRIES\n\nPacers center Jordan Hill is dealing with a wisdom tooth issue that currently is being treated with antibiotics. \"He's in a lot of pain, and he's fighting through it,\" Vogel said. \"At some point, he'll have to have it removed.\"\n\nREST OVERRATED?\n\nOf Memphis' 15 wins this season, about half have come on the second night of a back-to-back. The Grizzlies, who lost in Dallas on Friday night, are now 7-1 on second nights.\n\nUP NEXT\n\nPacers: visit San Antonio Spurs on Monday.\n\nGrizzlies: face the 76ers in Philadelphia on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994457.23197
}