{
  "game_id": "0021500779",
  "espn_id": "400828666",
  "date": "Feb 08, 2016",
  "matchup": "TOR @ DET",
  "headline": "Raptors beat Pistons 103-89, have won 14 of 15",
  "body": "AUBURN HILLS, Mich. --  When Andre Drummond's shot from about 80 feet dropped straight through the net to end the third quarter, Toronto's lead was down to five points, and it looked like this game against the Detroit Pistons might come down to the wire.\n\nInstead, Kyle Lowry and the Raptors put it out of reach pretty quickly.\n\n\"That shot could have gave them some momentum, but we had the ball coming up the court, and we had to be aggressive,\" Lowry said.\n\nLowry began the fourth quarter with a three-point play, and the Raptors went on an 11-2 run to pull away for their 14th victory in 15 games, 103-89 over Detroit on Monday night. Terrence Ross added 18 points for the Raptors.\n\nToronto led 70-65 at the start of the fourth after Drummond's long shot, but the Atlantic Division-leading Raptors eventually turned the game into a rout, to the delight of the many Toronto fans in attendance at the Palace.\n\nDrummond had 12 points and 13 rebounds for the Pistons.\n\n\"I liked the way we competed. We were just playing a great team that played extremely, extremely well and every mistake we made, they put the ball in the basket,\" Detroit coach Stan Van Gundy said. \"I'm not angry with my players. I'm angry with myself, because we competed that hard and I couldn't find a way to help them.\"\n\nVan Gundy said before the game that defense was a point of emphasis for his team, and the Pistons responded well initially, taking a 24-19 lead after one quarter. Toronto was up 49-43 at the half, and although the Raptors looked like they were in control at 62-49 in the third, Detroit scored nine straight points to get back in it.\n\nDrummond actually had to maneuver around Toronto's Patrick Patterson before flinging the ball from near his own free throw line at the end of the third quarter. The ball went in for only the third 3-pointer of his career, but the Pistons couldn't build on that highlight. Lowry and Patterson made 3s early in the fourth to give Toronto an 81-67 advantage, and Detroit was never closer than nine after that.\n\nToronto led by as many as 21 points.\n\nDeMar DeRozan scored 17 points for the Raptors, ending a streak of five games with at least 20.\n\nErsan Ilyasova led the Pistons with 17 points.\n\nSLOWED DOWN\n\nToronto outscored the Pistons 16-3 in fast-break points. The Raptors had only two offensive rebounds but shot 56 percent from the field and did a good job getting back when they missed.\n\n\"They don't crash the offensive glass, and they didn't miss a lot of shots, so it is tough,\" Detroit guard Reggie Jackson said. \"We had a few chances to run out on them, but they just made all their shots.\"\n\nFRIENDLY CROWD\n\nPlaying just a quick drive from the U.S.-Canada border, the Raptors had plenty of supporters in Michigan.\n\n\"This team is playing for playoff position, and we had just as many fans here as they did,\" Raptors coach Dwane Casey said. \"We have very impressive fans ... not just in Toronto, all across the country.\"\n\nTIP-INS\n\nRaptors: Toronto was without F DeMarre Carroll (right knee) and F James Johnson (left ankle). ... The Raptors have won 23 consecutive games when allowing fewer than 100 points.\n\nPistons: Detroit was missing G Kentavious Caldwell-Pope (core muscle strain) and G Jodie Meeks (right foot).\n\nUP NEXT\n\nRaptors: At Minnesota on Wednesday night.\n\nPistons: Host Denver on Wednesday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994719.2425668
}