{
  "game_id": "0021400341",
  "espn_id": "400578633",
  "date": "Dec 13, 2014",
  "matchup": "CHA vs. BKN",
  "headline": "Johnson leads hot-shooting Nets over Hornets",
  "body": "CHARLOTTE, N.C. -- Brooklyn coach Lionel Hollins felt Joe Johnson had a size matchup he could exploit against Gerald Henderson.\nJohnson, nearly two inches taller and 30 pounds heavier than Henderson, took full advantage.\nThe Nets went to the 13-year NBA veteran in the low post early and often, and Johnson responded with 14 of his 22 points in the first quarter as Brooklyn built a big lead and rolled to an easy 114-87 victory over the Charlotte Hornets on Saturday night.\n\"They didn't have a good matchup for Joe,\" Hollins said. \"... They had to come help on him and Joe had it going early.\"\nJohnson was 9 of 16 from the field and 4 of 6 from 3-point range as the Nets shot 16 of 23 from beyond the arc as a team.\n\"I was trying to be more aggressive and make plays and I got into a little rhythm early,\" Johnson said. \"It just tried to ride that wave in the first quarter.\"\nThe Nets would end up riding it all game, building their lead to 26 points at the end of the third quarter and as many as 34 in the fourth.\nBrooklyn moved the ball extremely well on offense, finishing with 29 assists while shooting a torrid 16 of 23 from 3-point range. The Nets had 25 assists the night before in an 88-70 win over Philadelphia.\n\"That shows that we moving the ball a little better from side-to-side,\" Hollins said.\nThe Hornets' 3-point defense has been sorely lacking of late, allowing opponents to make 62 of 132 attempts over the past six games.\nCoach Steve Clifford said his undersized team has focused on packing the lane in recent games to help with rebounding, which has contributed to their struggles defending the 3-point shot.\nIt didn't help that the Hornets were coming off a double-overtime loss the night before in Memphis and didn't get back in to Charlotte until the early morning hours. Clifford said Al Jefferson, in particular, \"looked tired\" after playing 45 minutes on Friday night.\nDeron Williams had 18 points and 10 assists, and Mason Plumlee outplayed Jefferson and finished with 11 points and 13 rebounds for the Nets (10-12), who eclipsed 100 points for the first time in 11 games.\nAlan Anderson was 4 of 5 from 3-point range and scored 17 points. Anderson and Bojan Bogdanovic combined to shoot 8 of 10 off the bench from 3-point range.\nMichael Kidd-Gilchrist had 15 points to lead the Hornets (6-17), who shot 36 percent from the field in their second straight loss.\nThe game was never close.\nThe Nets took control from the onset, jumping out to a 30-12 lead behind Johnson.\nThe Nets often isolated the 6-foot-7, 240-pound Johnson on Henderson in the low post and played through him on nearly every offensive possession. Johnson was 6 of 9 from the field early, twice stepping out beyond the 3-point line to knock down open jumpers.\n---\nTIP-INS\nNets: Kevin Garnett got a night to rest on the second night of a back-to-back. Rookie Cory Jefferson started, as the Nets started their sixth different starting lineup in the last six games.\nHornets: The Hornets were the latest team to wear \"I Can't Breathe\" shirts during warmups. Charlotte joins a growing list of teams who have shown support for the family of Eric Garner. He died in July when an arresting New York police officer placed him in a chokehold.\nGOOD FIRST START\nCory Jefferson filled in nicely for Garnett, scoring a career-high 11 points on 5-of-5 shooting.\nUP NEXT\nNets: Host Miami on Tuesday night.\nHornets: At Cleveland on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764992304.071127
}