{
  "game_id": "0022300792",
  "espn_id": "401585420",
  "date": "Feb 22, 2024",
  "matchup": "ORL @ CLE",
  "headline": "Moritz Wagner scores 22, Magic reserves shine in 116-109 win over Cavs without All-Star Mitchell",
  "body": "CLEVELAND -- — Moritz Wagner had 22 points, his younger brother, Franz, added 14 and the Orlando Magic returned from the All-Star break to beat Cleveland 116-109 on Thursday night, handing the Cavaliers just their third loss in 21 games.\n\n\r\n              The Cavs, who have been the NBA's hottest team since mid-December, played without leading scorer and All-Star Donovan Mitchell.\n\n\r\n              But that was no excuse as an inexperienced but improving Orlando team simply outplayed Cleveland from start to finish.\n\n\r\n              The Magic were tougher, stronger and more focused.\n\n\r\n              “The real teams start to play now,\" said Moritz Wagner, who added seven rebounds in 24 physical minutes. \"As a young team that hasn’t really been there (in a playoff push), we need to embrace that and go there.”\n\n\r\n              Mitchell, who has been instrumental in Cleveland's rise to second in the Eastern Conference, sat out with an unspecified illness. The 27-year-old participated in the 3-point contest and played in his fifth All-Star game last weekend at Indianapolis. He was in the Cavs' locker room following the game.\n\n\r\n              Orlando played the final 22 minutes without starting guard Jalen Suggs, who went out midway through the third quarter with a head injury and didn’t return. The team said Suggs was hit accidentally by teammate Wendell Carter Jr.\n\n\r\n              But the Magic's reserves stepped up in the second half, especially backup guard Cole Anthony, who had 13 points and six assists in 18 minutes while taking Suggs' spot.\n\n\r\n              Orlando's bench outscored Cleveland's 63-24.\n\n\r\n              “Our bench unit was fantastic,” Magic coach Jamahl Mosley said. “They came out ready to compete defensively early on, and there is a high level of trust they have with each other.”\n\n\r\n              Moritz Wagner's 3-pointer put the Magic ahead 107-95 with 4:41 left before the Cavs went inside to center Jarrett Allen for two straight buckets, and Evan Mobley's basket pulled Cleveland within 111-103.\n\n\r\n              That's when 0rlando All-Star Paolo Banchero, who went just 4 of 15 from the field, hit a 3-pointer from the right wing to put the Magic up by 11. The Cavs scrapped, but couldn't get closer than seven in the final two minutes and fell to 23-6 since Dec. 16.\n\n\r\n              Allen finished with 18 points and 10 rebounds. Darius Garland added 18 points and 10 assists for the Cavs, who made too many mistakes.\n\n\r\n              “Kudos to them,” Allen said. “They did play an excellent game. It’s also on us, we had 17 turnovers. That’s unacceptable for what we’re trying to do. It was a lot of just throwing the ball out of bounds. I had a couple where I just lost the ball. We were just all making mistakes.\"\n\n\r\n              Moritz Wagner punished the Cavs.\n\n\r\n              The 6-foot-11 center pushed his way to the rim on several occasions. He was also animated throughout the game, even drawing a technical in the second half.\n\n\r\n              “Don’t let his build fool you, Mo’s strong,” Anthony said. \"He’s a force. He threw the first punch — shoulders, elbows — and was initiating contact. He set the tone with how physical he was.” \n\n\r\n              The loss begins a grueling stretch for the Cavs, who will play five games in seven nights and nine in the next 14 days. Cleveland's daunting schedule over the final six weeks of the regular season includes seven back-to-backs.\n\n\r\n              “It’s only one game,” Cavs guard Max Strus said. “So first game back from the break, obviously we would’ve liked to play a little tougher and better on the defensive end, but there’s a lot of ways that we could have improved. Can’t let this continue to be a thing.”'\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Detroit on Saturday.\n\n\r\n              Cavaliers: At Philadelphia on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996168.5712159
}