{
  "game_id": "0022200950",
  "espn_id": "401469105",
  "date": "Mar 03, 2023",
  "matchup": "CHI vs. PHX",
  "headline": "Booker, Durant, Okogie lead Suns to 125-104 romp over Bulls",
  "body": "CHICAGO -- — Kevin Durant sees a loaded roster and all the possibilities that come with it for the Phoenix Suns.\n\n\r\n              It's up to them to make it happen. And they're off to a good start with their shiny new star.\n\n\r\n              Devin Booker scored 35 points and matched his career high with six 3s, Durant added 20 points in his second game with Phoenix and the Suns beat the Chicago Bulls 125-104 on Friday night.\n\n\r\n              Josh Okogie scored 25 points and made five 3-pointers, and the Suns improved to 2-0 with Durant in the lineup.\n\n\r\n              “We've got a lot of big names,” Durant said. “We've got a lot of guys that have done so much in this league so far. But it's about how we come together as a group, and I think this is a tightknit group, a tightknit organization. We'll figure it out along the way.”\n\n\r\n              The Suns, fourth in the Western Conference, put themselves in position to finish the season on a strong note when they landed Durant from Brooklyn in a blockbuster trade three weeks ago. They need some time to mesh the way they would like. But they're looking good so far.\n\n\r\n              Phoenix dominated the second half against Chicago, outscoring the Bulls by a combined 65-40 after trailing by four at the break. The Suns withstood big efforts by DeMar DeRozan and Zach LaVine, and won for the eighth time in 11 games.\n\n\r\n              “We have (18) games left to find this chemistry and communication before playoffs start,” Booker said. “We're trying to not take any day off. We've had extended practices every day, going over both sides of the ball and game plans and schemes — things that we've been doing for a few years here.\"\n\n\r\n              Booker made 6 of 10 3-pointers, and Okogie hit 5 of 10.\n\n\r\n              Durant continued to make a seamless transition following the trade from Brooklyn and once again showed no lingering issues from a sprained right knee that sidelined him for seven weeks. The 34-year-old star took just 10 shots. He had nine rebounds and six assists, helping the Suns win their seventh in a row against Chicago.\n\n\r\n              DeRozan led the Bulls with 31 points. LaVine had 27, but the 3-point discrepancy continued to be a big issue. Chicago was 7 of 23 from beyond the arc, while Phoenix made 20 of 47.\n\n\r\n              “I think we have to take more 3s,” coach Billy Donovan said. “We've to change our shot profile when you go against an elite team. They took twice as many 3s as we did, and they made nearly three times as many as we did.\"\n\n\r\n              BURYING BULLS\n\n\r\n              The Suns went from leading by 13 in the first half to trailing by four at the break. But they outscored Chicago 34-21 in the third and reeled off 10 in a row midway through the fourth to break open a seven-point game.\n\n\r\n              Durant scored seven straight early in the third to put the Suns back on top, 70-67. Cameron Payne gave Phoenix a double-digit lead when he hit a 3 to make it 88-78 with 3:41 left in the quarter.\n\n\r\n              It was 107-100 midway through the fourth when Chris Paul nailed a 3 to start a 10-0 run that buried the Bulls.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Donovan said he expects Durant and Paul to be “great” together. Donovan had both superstars in Oklahoma City, albeit on separate occasions and not as teammates. “You've got two guys that are very driven, very motivated, very detailed, put the work in in every aspect possible to be the best they can be,\" he said. \"And everything is done from a perspective of how they can influence, impact winning.” ... F Terrence Ross (sore right toe) missed his second game in a row.\n\n\r\n              Bulls: The Bulls have not beaten the Suns since March 18, 2019. ... Donovan said DeRozan feels “really, really good” since his return from a strained right quadriceps that kept him out of back-to-back games prior to the All-Star break. The six-time All-Star averaged 20 points in four games prior to Friday's contest. ... The Bulls signed G Carlik Jones from their Windy City G League affiliate.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Dallas on Sunday.\n\n\r\n              Bulls: Host Indiana on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994474.5656059
}