{
  "game_id": "0022000329",
  "espn_id": "401267489",
  "date": "Feb 03, 2021",
  "matchup": "IND @ MIL",
  "headline": "Antetokounmpo gets triple-double as Bucks top Pacers 130-110",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo didn't play at all in the fourth quarter and still had a triple-double while helping the Milwaukee Bucks roll to a lopsided victory.\n\n\r\n                    The reigning two-time MVP had 21 points, 14 rebounds and 10 assists in the Bucks' 130-110 rout of the Indiana Pacers on Wednesday night. Antetokounmpo shot 7 of 8 from the floor and 7 of 8 from the line. \n\n\r\n                    “He's playing really, really unselfishly,\" Bucks coach Mike Budenholzer said. “He's seeing things and making the right read and the right passes. I just think he's in a great place mindset-wise. He's aggressive and attacking when it's needed. He's finding his teammates and finding opportunities for everybody else when it's needed.”\n\n\r\n                    Over his last two games, Antetokounmpo has shot a combined 15 of 19 from the floor and hasn't attempted a 3-pointer. Antetokounmpo is making just 28% of his 3-point attempts this season.\n\n\r\n                    Antetokounmpo completed his third triple-double of the season in the final minute of the third quarter when he got his 10th assist, setting up Bobby Portis for a corner 3-pointer that capped a 10-0 run and gave the Bucks a 34-point advantage.\n\n\r\n                    Milwaukee led by as many as 40 in the fourth quarter over a Pacers team that had beaten the Memphis Grizzlies 134-116 one night earlier.\n\n\r\n                    “We just didn't come out with enough urgency on both ends,” Pacers forward Doug McDermott said. “It's something we've got to clean up. We've got to come out with that mindset that just because we played the night before doesn't give us an excuse to kind of lay an egg.”\n\n\r\n                    Milwaukee never trailed and shot 21 of 48 from 3-point range in its last home contest before beginning a six-game trip. The Bucks have gone 42 of 90 on 3-point attempts over their last two games.\n\n\r\n                    The Bucks have made at least 20 3-pointers in five of their 21 games this season. Before this season, the Bucks had made as many as 20 3-pointers in a game just four times in franchise history.\n\n\r\n                    Bryn Forbes, who scored 20 points and shot 4 of 7 from beyond the arc, said the Bucks' exceptional long-range production is a credit to their passing abilities.\n\n\r\n                    “I think there's a lot of guys that don't get credit for their ability to facilitate and pass the ball,” Forbes said. “It helps us get easy shots and open shots, which boosts the percentage up a lot.”\n\n\r\n                    Indiana’s Domantas Sabonis scored a career-high 33 points and had 12 rebounds and six assists, delivering a big performance for a second straight night. Sabonis had matched a career high with 32 points Tuesday against the Grizzlies.\n\n\r\n                    The Bucks had balanced scoring. Portis scored 18, Donte DiVincenzo 16 and Khris Middleton 12. Jrue Holiday and Brook Lopez scored 11 points each.\n\n\r\n                    Justin Holiday had 15 points for the Pacers. McDermott had 13, Malcolm Brogdon 12 and Aaron Holiday 11.\n\n\r\n                    TIP INS\n\n\r\n                    Pacers: Center Myles Turner played through a sore right shoulder that left him questionable, but he had just three points, two rebounds, two steals and one block in 23 minutes. Turner entered the night averaging 14.5 points, 6.9 rebounds and a league-high 4 blocks.\n\n\r\n                    Bucks: Milwaukee assigned three players to NBA G League teams earlier in the day. They assigned Jordan Nwora to the Salt Lake City Stars and Sam Merrill to the Memphis Hustle while transferring two-way forward Mamadi Diakite to the Lakeland Magic. The Bucks’ own G League affiliate, the Wisconsin Herd, opted against participating in the league’s modified season.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host the New Orleans Pelicans on Friday. The Pacers beat the Pelicans 118-116 in overtime at New Orleans on Jan. 4.\n\n\r\n                    Bucks: Begin a six-game road swing with back-to-back matchups at Cleveland on Friday and Saturday. The Bucks swept their three meetings with the Cavaliers last season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997154.297122
}