{
  "game_id": "0021600227",
  "espn_id": "400899677",
  "date": "Nov 25, 2016",
  "matchup": "DAL @ CLE",
  "headline": "Love, Irving lead Cavaliers to 128-90 rout of Mavericks",
  "body": "CLEVELAND --  LeBron James pulled down a full-court pass from Kevin Love, threw down a dunk and gave the touchdown signal on his way up the court.\n\nTimes are good for the defending NBA champions.\n\nLove scored 27 points, Kyrie Irving added 25 and the Cleveland Cavaliers led by as many as 45 points in a 128-90 rout of the Dallas Mavericks on Friday night.\n\nLove hit seven 3-pointers while Irving, who made his first 10 shots, scored 19 points in the first quarter. Irving's big quarter came two nights after Love scored an NBA-record 34 in the first against Portland.\n\nJames, playing in his 1,000th regular-season game, had 19 points and 11 assists. The game's signature moment came when Love found James streaking down the right side of the court for the play that thrilled the crowd.\n\n\"I've been in that position quite a lot,\" said James, who played wide receiver in high school. \"Kev's been doing those outlet passes. It's up to him. He's the quarterback. I'm just the receiver.\"\n\nThe highlight-reel play came the day before the entire Cavaliers team will attend the college football game between Ohio State and Michigan.\n\nThe Cavs faced little resistance from the team with the league's worst record. Dallas scored the game's first basket before the Cavaliers turned the game into a rout. Cleveland led 36-16 after one quarter and was ahead 68-28 late in the second.\n\n\"It was a horrible performance by us and a great performance by them,\" Mavericks coach Rick Carlisle said. \"We simply must be better and compete better. It's very disappointing.\"\n\nCleveland led 110-65 early in the fourth quarter. The Cavaliers made 20 of 43 3-point attempts and have made at least 10 3-pointers in every game this season.\n\n\"Guys are really starting to come along,\" coach Tyronn Lue said. \"When we shoot the ball like this we're hard to beat.\"\n\nCleveland scored 137 points Wednesday, hitting a team-record 21 3-pointers. Love has made 15 of 21 3-point attempts in the last two games.\n\n\"I'm shooting the shots that are there, not hesitating and catching a rhythm,\" he said. \"It's been there the last two games and all season long.\"\n\nDirk Nowitzki, who appeared in only his fifth game of the season because of an injured right Achilles, scored 15 points for Dallas. The Mavericks (2-13) have lost eight straight.\n\nMavericks guard Deron Williams (strained left calf) returned after missing the last four games. He scored four points in 15 minutes and didn't play in the second half.\n\nCavaliers forward Channing Frye has been excused from the team following the death of his father, Thomas, on Thanksgiving. Frye's mother, Karen Mulzac-Frye, passed away last month following a battle with cancer.\n\nTIP-INS\n\nMavericks: The game marked only the third time this season Dallas has started its projected lineup. ... G Seth Curry was booed when he entered the game in the first quarter. Curry's brother, Stephen, has been booed frequently during the NBA Finals when Cleveland played Golden State the last two seasons.\n\nCavaliers: James became the 11th active player to appear in 1,000 games, with 706 coming with Cleveland. ... Love fell on top of a fan chasing a loose ball in the third quarter. He slapped hands with the fan during the next stoppage of play.\n\nTOUGH STRETCH\n\nNot only have the Mavericks been riddled by injuries, their recent schedule has added to the problems. Dallas played San Antonio (13-3) on Sunday and the Los Angeles Clippers (14-3) on Tuesday before losing to the Cavaliers (12-2). After playing New Orleans on Sunday, the Mavericks meet the Spurs again on Wednesday.\n\nUP NEXT\n\nMavericks: Host New Orleans on Sunday. Dallas is 22-3 all-time against the Pelicans at home, but lost their last meeting by a 105-98 score on Jan. 2.\n\nCavaliers: Travel to Philadelphia for the second time this season Sunday. Cleveland edged the 76ers 102-101 in Philly on Nov. 5.",
  "source": "espn_api",
  "crawled_at": 1764996153.3063848
}