{
  "game_id": "0022200341",
  "espn_id": "401468496",
  "date": "Dec 03, 2022",
  "matchup": "MIN vs. OKC",
  "headline": "Gilgeous-Alexander, Thunder post physical win over T-Wolves",
  "body": "MINNEAPOLIS -- — Shai Gilgeous-Alexander scored 33 points in his return to action and the Oklahoma City Thunder took advantage of Rudy Gobert's early ejection to post a chippy 135-128 win over the Minnesota Timberwolves on Saturday night.\n\n\r\n              The teams were called for a combined eight technical fouls, five on Minnesota.\n\n\r\n              “The frustrations boiled over,” Timberwolves head coach Chris Finch said. “It was not the most mature effort by us.”\n\n\r\n              Thunder head coach Mark Daigneault, meanwhile, praised the team's “poise.\" Gilgeous-Alexander was the catalyst for that. \n\n\r\n              “He empowers the environment, he empowers the team and that’s what you saw tonight,” Daigneault said.\n\n\r\n              The NBA's third-leading scorer with a 31-point average, Gilgeous-Alexander sat out one game earlier this week with a bruised hip. But he had no trouble getting physical against Minnesota, making 10 of 17 shots and all 12 of his free throws.\n\n\r\n              “Felt good playing basketball again,” Gilgeous-Alexander said. \n\n\r\n              Josh Giddey had 21 points and 12 assists for his eighth double-double of the season. Lu Dort scored 18 points as seven Thunder players reached double digits. \n\n\r\n              D’Angelo Russell led the Timberwolves with 27 points. Anthony Edwards added 26 points — he's scored more than 20 in nine of his last 10 games. Jaylen Nowell added 21 points.\n\n\r\n              Tensions flared in the second quarter when Gobert was ejected for tripping Kenrich Williams. The two got tangled up on the ground after both fell as Williams made a layup with 9:22 remaining in the quarter.\n\n\r\n              As Williams attempted to get up, Gobert lifted up his right foot and tripped the Thunder forward. Gobert was called for a flagrant-2 foul while Williams received a technical.\n\n\r\n              “I trust that they got it right,” Daigneault said of the officials' ruling. \n\n\r\n              Minus their center, the Timberwolves allowed the Thunder to shoot 51.6% from the field and score 66 points in the paint. The Timberwolves were also without Karl-Anthony Towns, who remains out with a calf strain. \n\n\r\n              Finch bemoaned his team's defensive intensity and its turnovers on the other end. Minnesota turned the ball over 23 times. \n\n\r\n              “Sometimes we might have bonehead turnovers that we’re better than,” said Timberwolves center Naz Reid, who played a season-high 30 minutes and grabbed a career-high 18 rebounds in Gobert's absence. “Things like that cost us the game. We just got to be better moving forward.”\n\n\r\n              The Thunder orchestrated an 18-3 run to go from trailing by one point to leading 125-113 with 4:14 to play.\n\n\r\n              “The end of the third quarter it seemed like the wheels were coming off and we stabilized and closed the last minute well and then the group that started the fourth quarter built a nice little cushion for us,” Daigneault said. \n\n\r\n              TIP-INS\n\n\r\n              Thunder: Center Mike Muscala (broken finger) was available off the bench for the first time since Nov. 21 but did not play. ... No. 2 overall pick Chet Holmgren went through a workout pregame as he recovers from a season-ending Lisfranc injury. Holmgren grew up five miles from Target Center. \n\n\r\n              Timberwolves: Gobert’s ejection was the fifth of his career and first since arriving in Minnesota. ... Forward Jaden McDaniels (illness) returned from a three-game absence, started at power forward and scored eight points. ... Backup point guard Jordan McLaughlin (strained calf) also returned after a five-game absence and scored eight points. ... Forward Taurean Prince (shoulder) missed his fifth consecutive game.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Atlanta on Monday night.\n\n\r\n              Timberwolves: Host Indiana on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995179.945835
}