{
  "game_id": "0021600920",
  "espn_id": "400900315",
  "date": "Mar 04, 2017",
  "matchup": "MIL vs. TOR",
  "headline": "Middleton's season-high 24 points lead Bucks past Raptors",
  "body": "MILWAUKEE --  Spencer Hawes didn't see a single minute of action in the first 11 games after he was acquired by the Milwaukee Bucks from the Charlotte Hornets last month.\n\nHe turned in a game-changing performance on Saturday night, scoring 14 second-quarter points, including back-to-back 3-pointers and an acrobatic layup while drawing a foul, to spark the Bucks to a 101-94 win over the Toronto Raptors.\n\nHawes, who got onto the court for the first time with his new team on Friday night with a late three-minute stint, played all 12 minutes in the quarter as the Bucks tallied 41 points, their best second-period output of the season.\n\n\"I've been fortunate to be in this league a long time now,\" Hawes said. \"That experience kind of teaches you ups, downs, staying ready, being professional when your number's called.\"\n\nHe finished with 16 points, two shy of his season high, and eight rebounds in 17 minutes.\n\n\"He hasn't had the opportunity to play, but he comes to practice every day, ready to go,\" Bucks coach Jason Kidd said.\n\nToronto coach Dwane Casey offered a blunt assessment of Hawes' impact.\n\n\"It was a killer,\" he said. \"Spencer Hawes came in and changed the game with his 3-point shooting.\"\n\nKhris Middleton scored a season-high 24 points and Giannis Antetokounmpo had 21 for the Milwaukee, which halted a seven-game losing streak to Toronto.\n\nSerge Ibaka led Toronto with 19 points.\n\nToronto led 19-12 after the first quarter, with Milwaukee making just four of 22 shots (18 percent). It marked the Bucks' lowest first-quarter point total of the season.\n\nSparked by Hawes, the Bucks grabbed a 53-42 lead at the half.\n\nThe Bucks entered the fourth quarter with a 13-point lead, but the Raptors got within four about halfway through the period. Back-to-back baskets by Antetokounmpo put Milwaukee back in control.\n\nBACK-TO-BACK\n\nMiddleton played on back-to-back nights for the first time since returning last month from a torn hamstring. Middleton missed the first 50 games of the season while recovering from surgery to repair the injury.\n\n\"This is a step forward in his comeback,\" Kidd said. \"He'll be tired, but it just shows how much we missed him early in the season.\"\n\nINSIDE INFORMATION\n\nDeMar DeRozan struggled to score and didn't reach double figures until the waning moments of the game. Teams have been focusing their attention on DeRozan with Kyle Lowry out of the lineup with a wrist injury.\n\n\"It was extremely aggressive,\" DeRozan said of Milwaukee's defense. \"Playing against (Jason Kidd's) teams, going back to the Brooklyn days, he's got a great feel playing against me with different defensive schemes. And they have Eric Hughes, an assistant coach that used to be with us. He knows me.\"\n\nTIP-INS\n\nRaptors: DeMarre Carroll left the game in the third quarter with a sprained left ankle. ... DeRozan, who scored 32 points in Friday night's win over Washington, didn't attempt a shot from the field and was held scoreless in the first quarter. He finished with 11 points, well off his season average of 27.9. ... Ibaka and Milwaukee's Greg Monroe were whistled for a double technical foul with about 2 minutes left in the game.\n\nBucks: Milwaukee connected on just two of its first 18 shots and missed its first eight shots from 3-point range, including two airballs. ... F Terrence Jones was signed for the remainder of the season. New Orleans waived Jones on Feb. 23 after acquiring All-Star center DeMarcus Cousins. Jones averaged 11.5 points and 5.9 rebounds with New Orleans. \"You look at a very talented young man who can play multiple positions,\" Kidd said. \"We'll spend some time with him (on Sunday) getting him through the system, both offense and defense, and see if we can get him some minutes in Philly (on Monday).\"\n\nUP NEXT\n\nRaptors: Play at New Orleans on Wednesday. The Raptors beat the Pelicans 108-106 in overtime in Toronto in the teams' only other meeting this season.\n\nBucks: Visit Philadelphia on Monday. The 76ers have won the first two of a four-game season series, including a 114-109 victory in Milwaukee on Jan. 25.",
  "source": "espn_api",
  "crawled_at": 1764995153.109969
}