{
  "game_id": "0022000021",
  "espn_id": "401267181",
  "date": "Dec 26, 2020",
  "matchup": "MEM vs. ATL",
  "headline": "Young leads Hawks to second win, 122-112 over Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Trae Young scored eight straight points down the stretch and finished with 36 points as the Atlanta Hawks beat the Memphis Grizzlies 122-112 Saturday night.\n\n\r\n                    Kevin Huerter added 21 points for the Hawks, who won their second straight. De’Andre Hunter finished with 15 points and rookie Nathan Knight added 14 points, going 4 of 5 from the field and 2-for-3 shooting from 3-point range.\n\n\r\n                    Ja Morant led Memphis with 28 points and seven assists, and Kyle Anderson finished with 20 points and 14 rebounds. Dillon Brooks added 19 points before fouling out in the closing seconds.\n\n\r\n                    Huerter said the goal was to stop the Grizzlies’ transition game and keep them out of the paint, where they are one of the best teams in the league.\n\n\r\n                    “For the most part, I think we did a pretty good job at that. We tried to turn a lot of them into shooters,” Huerter said, later adding: “Trying to keep them out of the paint, and we did our thing offensively.”\n\n\r\n                    The game was a showdown between two of the league’s top young point guards in Young and Morant, both of whom had big season-openers. Young had 37 points in the Hawks’ 124-104 win at Chicago, while Morant scored a career-high 44 in a home loss to San Antonio.\n\n\r\n                    Young, who was limited to 12 points in the first half, scored 10 points in the final 2:40 against the Grizzlies, starting with the eight straight to keep Memphis from overtaking Atlanta.\n\n\r\n                    “I think shots just went down,” Young said of the second half. “I was getting some really good looks in that first half. Shots just weren’t going in. For all of us. … I think we got the rust off (in the first half) and played really well as far as scoring throughout the rest of the game.”\n\n\r\n                    The young guards carried their teams through the first half, with the Hawks also getting an early burst from Huerter, who had 13 points at the break, hitting all five of his shots. \n\n\r\n                    The Hawks held a 58-56 lead at the half.\n\n\r\n                    “We’re both young talents trying to be the face of the league,” Morant said. “We’ve played against each other many times. ... The sky’s the limit for (Young).”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Split a pair of preseason games against the Grizzlies in Memphis. …Starting frontline player Danilo Gallinari did not play due to a left foot contusion. … Knight, who signed a two-way contract with the Hawks after a four-year career at William & Mary, scored his first NBA points in the first quarter.\n\n\r\n                    Grizzlies: Reserve G De’Anthony Melton was a late scratch Saturday morning due to health and safety protocols. “In terms of a return date, I’m new to this process,” Memphis coach Taylor Jenkins said, adding: “We don’t have a firm timeline yet. It’s to be determined.” ... Kyle Anderson reached 2,000 career points in the first quarter. … Morant reached 500 assists in the second quarter. \n\n\r\n                    INJURY KNOWLEDGE: When asked about the availability of certain Hawks injured players, coach Lloyd Pierce candidly said he can only coach the ones available. And that’s how he approaches it.\n\n\r\n                    “I never pretend to know about injuries,” the Hawks coach said. “I’ve never sustained an injury in my life, so I don’t pretend to know what an ACL or and MCL or anything else or foot or ankle. I don’t know anything about it, so I don’t try to pretend to know.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Play their home opener against the Detroit Pistons on Monday.\n\n\r\n                    Grizzlies: Begin the first road trip of the season on Monday in Brooklyn against the Nets.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996995.920353
}