{
  "game_id": "0021801210",
  "espn_id": "401071883",
  "date": "Apr 09, 2019",
  "matchup": "DET vs. MEM",
  "headline": "Pistons beat Grizzlies 100-93 and cling to playoff hopes",
  "body": "DETROIT --  The Detroit Pistons are still clinging to the final spot in the Eastern Conference playoffs thanks to their biggest second-half comeback in three decades.\n\nAndre Drummond had 20 points and 17 rebounds and Ish Smith matched a season high with 22 points, helping Detroit rally to beat the Memphis Grizzlies 100-93 Tuesday night.\n\nThe Pistons can clinch a postseason bid by closing the regular season with a win at New York, or if Charlotte loses at home to Orlando, on Wednesday night.\n\n\"I'm just happy that we still control our own destiny,\" Detroit's Reggie Jackson said.\n\nThe Pistons put their postseason position in peril by losing four straight before rallying to beat the short-handed Grizzlies, who led by as many as 22 points.\n\nDetroit's comeback from a 19-point halftime deficit was its largest since rallying from being down 23 points to beat Seattle on March 31, 1989.\n\nPistons star Blake Griffin was limited to five points and two rebounds in 18-plus minutes, barely playing in the second half because of his injured left knee.\n\n\"I wasn't able to help us,\" Griffin said. \"We're going to take it day by day.\"\n\nDetroit's Luke Kennard scored 12 of his 15 points off the bench in the second half.\n\nJackson had all 12 points of his points in the first half and went to the bench as Smith flourished in the final quarter.\n\n\"He was unstoppable,\" Jackson said.\n\nDetroit opened the fourth with a 16-3 run to pull within three points. Smith made a game-tying 3-pointer and a go-ahead jumper midway through the quarter.\n\nDrummond made two free throws with 2:33 left to put the Pistons up 91-89. Smith made a jumper to give Detroit a five-point lead with 50 seconds left and a runner to put it ahead 97-93 with 28 seconds remaining.\n\nDelon Wright and Bruno Caboclo each scored 15 points and Tyler Dorsey added 12 points for the Grizzlies, who used just four reserves. Banged-up players such as Mike Conley, Joakim Noah and rookie Jaren Jackson were out with injuries.\n\n\"I thought our guys scrapped and competed,\" coach J.B. Bickerstaff said. \"We showed a lot of heart, but you saw in the fourth quarter a Pistons team that was desperate and turned it up offensively and defensively.\"\n\nEven though Detroit had a lot to play for -- its first playoff berth in three years and second in a decade -- the Grizzlies played with more effort and led 32-20 after the first quarter and 57-38 at halftime.\n\n\"I think everything was free and easy in the first half,\" Memphis center Tyler Zeller said.\n\nDetroit's fans made it loud and clear they were unhappy with the performance.\n\n\"I deserved to be booed and so did our guys,\" coach Dwane Casey said. \"I just hope none of our fans hurt their ankles jumping back on the bandwagon. I even saw some of our fans leaving the building, but I hope they saw the fire and competitive spirit we showed in the second half.\"\n\nCONFIDENT COACH\n\nBickerstaff said he hasn't heard any of the talk about his future with the franchise and believes he has done enough to earn another opportunity to coach the team next season\n\n\"Yeah, there's no doubt about it,\" he said.\n\nBickerstaff replaced fired coach David Fizdale early in the 2017-18 season. He was 15-48 last season and is 32-39 this season.\n\nTIP-INS\n\nGrizzlies: Zeller fouled out midway through the fourth quarter with 13 points and six rebounds\n\nPistons: Team owner Tom Gores attended the game, cheering for his team and complaining about calls to officials.\n\nUP NEXT\n\nGrizzlies: Close regular season against Golden State on Wednesday.\n\nPistons: End regular season at New York on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994643.084385
}