{
  "game_id": "0021600662",
  "espn_id": "400900083",
  "date": "Jan 22, 2017",
  "matchup": "LAL @ DAL",
  "headline": "Nowitzki starts Mavericks toward 122-73 rout of Lakers",
  "body": "DALLAS --  Dirk Nowitzki and the Dallas Mavericks had something to prove on Sunday following two straight tough losses.\n\nComing off a three-point effort in an overtime loss on Friday, Nowitzki scored all 13 of his points in the first half and Dallas gave the Los Angeles Lakers the worst loss in their history, 122-73.\n\n\"We didn't show up to play,\" Lakers coach Luke Walton said. \"It's embarrassing for us as a team and for us as an organization. The effort just wasn't there tonight, which I don't understand.\"\n\nThe 49-point defeat just edged Los Angeles' two previous worst losses at 48 points, most recently 123-75 at Utah on March 28, 2016.\n\nThe Mavericks' winning margin was the third-largest in their history.\n\nIt was Dallas' 13th straight win over the Lakers, who have lost six of their last seven games overall.\n\nAfter a season-best three-game winning streak, the Mavericks had blown a nine-point halftime lead at Miami on Thursday and lost to Utah on Friday.\n\nNowitzki was 1 for 13 against the Jazz, including a missed 3-pointer that would have tied the game in overtime.\n\n\"I looked sluggish the other night on that back-to-back,\" Nowitzki said, \"but took a day off yesterday, didn't do anything. Felt a lot better today.\"\n\nThe game was close for 10 minutes, with Dallas leading 23-22 before the Mavericks scored the next 15 points to blow it open. Nowitzki had seven points during the run. He played just 20 minutes.\n\nJustin Anderson led seven Mavericks in double figures with a game-high 19 points in 16 minutes, his most playing time since Dec. 27.\n\nThe Mavericks led 67-33 at the half and never looked back. They both scored their most points and allowed the fewest in a half and a game this season. The 34-point halftime lead was the third-largest in franchise history.\n\nThe Lakers scored their fewest points in a quarter, a first half and a game.\n\n\"What's deflating is that we didn't guard anybody tonight,\" Lakers forward Julius Randle said.\n\nLou Williams led the Lakers with 15 points.\n\nDallas' Seth Curry scored 14 points, including seven straight in the first quarter.\n\nWesley Matthews and Deron Williams also had 13 points. Devin Harris and Pierre Jackson scored 10 each. Rookies Jackson and Nicolas Brussino (eight points) each reached career highs.\n\nTIP-INS\n\nLakers: They played without D'Angelo Russell, second on the team at 14.3 points per game. An MRI taken Saturday showed a mildly sprained right MCL and strained right calf. That left the Lakers with rookie Brandon Ingram starting at point guard, and they had a season-low 10 assists. ... Larry Nance Jr. (bone bruise, left knee) returned after missing 16 games and scored four points.\n\nMavericks: Dallas' record winning margin was 123-70 win at home over the 76ers on Nov. 13, 2014. They beat the Knicks 128-78 in New York on Jan. 24, 2010. ... J.J. Barea missed his 26th game this season because of a strained left calf aggravated on Friday. Coach Rick Carlisle said he didn't expect Barea back until after the All-Star break (Feb. 24 at the earliest). Andrew Bogut (strained right hamstring) could return this week, according to Carlisle.\n\nLENDING A HAND\n\nMavericks G Deron Williams moved into 20th place in NBA history with 6,715 assists, passing Kevin Johnson. Williams has had at least seven assists in seven straight games; on Sunday, he had eight, seven by halftime.\n\nLONG-RANGE\n\nNowitzki tied J.R. Smith for 15th place in 3-point field goals by making one for a total of 1,729.\n\nUP NEXT\n\nLakers: Travel to Portland for the second game of a three-game trip on Wednesday night.\n\nMavericks: Complete a three-game homestand on Wednesday night against New York.",
  "source": "espn_api",
  "crawled_at": 1764995394.1263309
}