{
  "game_id": "0021600595",
  "espn_id": "400900016",
  "date": "Jan 13, 2017",
  "matchup": "MEM @ HOU",
  "headline": "Allen has season-high 22 as Grizzlies down Rockets 110-105",
  "body": "HOUSTON -- The Memphis Grizzlies have developed a knack for beating the best in the West.\nThey did it again on Friday night, rallying from a 15-point, third-quarter deficit for a 110-105 victory over the Houston Rockets.\nTony Allen scored a season-high 22 points and Mike Conley added 17 as the Grizzlies, who are sixth in the West, improved to 4-0 combined against the Houston Rockets and Golden State Warriors this season.\n\"We've just got to start treating everybody like they're those teams,\" Conley said. \"I think we get up for the good teams somehow and seem to lay eggs when we feel like we should win games. We've just got to come with a better mindset for games that we feel like we should win. We know we can play with anybody, we've proven that. But for us to get to that next level we've got to be consistent no matter who we're playing.\"\nMemphis led by two late in the fourth quarter before scoring the next five points, capped by a 3-pointer by Troy Daniels, to make it 110-103 with 26 seconds left. A dunk by James Harden came next, but Houston missed two shots after that to allow the Grizzlies to hold on for their third win in four games.\nHarden had 27 points and nine assists for the Rockets, who have lost consecutive games for the first time this season.\n\"We just missed shots. That's all,\" Harden said. \"We make those shots we go up nine or it's a different ballgame. But obviously that's a scrappy team.\"\nMemphis was up by one in the fourth when Conley tossed a ball from about halfcourt as he fell into the front row of seats to Allen for a dunk.\n\"I didn't know who it was going to go to,\" Conley said. \"I kind of just threw it up. I knew there were two people back there and luckily it landed in (Allen's) hands.\"\nConley hit a 3-pointer a few seconds later to push the lead to 101-95 with about 5 minutes left.\nThe Grizzlies scored the first nine points of the fourth quarter, with five from Zach Randolph, to go on top for the first time in the second half, 92-85. Houston got going after that, scoring the next seven points to tie it with about 8 minutes left.\nThe Rockets led by 15 after an alley-oop dunk by Montrezl Harrell with about 9 minutes left third quarter. The Grizzlies then used a 9-1 run to cut the lead to 71-64 with about three minutes later.\nHouston hadn't scored a basket in almost four minutes when Harrell made a jumper with about 5 minutes left. Consecutive 3-pointers by Eric Gordon helped leave Houston ahead 79-68.\nIt didn't take long for Memphis to start another run as Gasol hit a 3-pointer after that to start a 15-5 spurt that got the Grizzlies within 84-83 with about a minute left in the third. Daniels had two 3s in that stretch and Randolph added one.\nHouston made just 2 of 14 3-pointers in the third quarter and shot just 25 percent overall in the period, while the Grizzlies made 5 of 10 3s and shot 65 percent to close the gap.\nHouston led 64-51 at halftime.\nTIP-INS\nGrizzlies: Allen fouled out with 3:35 remaining. ... Randolph finished with 16 points and 12 rebounds. ... Daniels scored 13 points.\nRockets: Gordon returned after missing two games with a toe injury and had 13 points. ... Harrell scored 10 points for his ninth double-digit scoring game in the last 13. ... Coach Mike D'Antoni received a technical foul early in the second quarter. ... Houston has scored 100 points or more in 28 straight games.\nNO LOVE\nMemphis forward Chandler Parsons did not get a warm welcome in his return to Houston, getting booed loudly every time he touched the ball. Parsons was drafted by the Rockets in 2011 and played three seasons in Houston before leaving for Dallas. He spent two seasons there before joining the Grizzlies this season. He finished with five points, two rebounds and two steals.\nTHEY SAID IT\nAllen on coach David Fizdale's halftime speech: \"He told guys we need to stop lying to ourselves. We were not playing hard ... and guys took it to heart the second half and you could tell by the way we played down the stretch.\"\nUP NEXT\nGrizzlies: Host Chicago on Sunday.\nRockets: Visit Brooklyn on Sunday.\n---\nThis story has been corrected to show that the Grizzlies have won three of four, not four straight.",
  "source": "espn_api",
  "crawled_at": 1764995603.049563
}