{
  "game_id": "0022300466",
  "espn_id": "401585094",
  "date": "Jan 03, 2024",
  "matchup": "MIL @ IND",
  "headline": "Pacers pull away with 47-point 3rd quarter, beat Bucks 142-130 for 5th straight win",
  "body": "INDIANAPOLIS -- — All-Star guard Tyrese Haliburton wanted to reinforce that Indiana's success against Milwaukee wasn't a fluke.\n\n\r\n              So on Wednesday night, the budding, young star made sure of it — again.\n\n\r\n              Haliburton had 31 points and 12 assists and helped spur a 47-point third quarter to lead the Pacers past the Bucks 142-130 for their fifth consecutive victory.\n\n\r\n              “I think as a young group when you play good teams, you want to be as prepared for them as you can for them,” Haliburton said. “But I think part of the maturation of this group has to be to continue that competitiveness and being up for games that aren't against the Bucks.”\n\n\r\n              It's been a lopsided series this season. Just two days after ending Milwaukee's 15-game home court winning streak, they opened the second half on a 21-6 run and never trailed again to improve to 4-1.\n\n\r\n              Giannis Antetokounmpo had 26 points, 11 rebounds and eight assists for Milwaukee, falling just short of his fourth triple-double this season. Damian Lillard added 23 points and five assists, and Khris Middleton overcame a sprained right wrist and a sore right knee to add 19 points and seven assists. \n\n\r\n              \r\n                For the Bucks, it's been a series filled with frustration.\r\n              \n\n\r\n              The Central Division foes have gotten awfully familiar, playing five times in 54 days — including the In-Season Tournament semifinal in Las Vegas. Four games have produced combined scoring totals of at least 247 points.\n\n\r\n              “I think the embarrassing part is that we're just so much better than what we've shown in the games against them,\" Lillard said. “I also don't look at it like ‘Oh, it’s just the regular sesason.' We wanted to win these games.”\n\n\r\n              The final outcomes were only part of what defined the series. It also became emotional and, at times, chippy.\n\n\r\n              A dispute over a missing game ball led to a bizarre postgame scene in December when Antetokounmpo sprinted toward the Indiana locker room. Bucks forward Bobby Portis was ejected from one game and in Las Vegas, Haliburton drew the ire of some for imitating Lillard by pointing toward his wrist after making a late 3-pointer as the Bucks were about to be eliminated.\n\n\r\n              The final regular-season game in this series only added fuel to the fire.\n\n\r\n              Indiana fans repeatedly counted the seconds it took Antetokounmpo took to shoot free throws, the Milwaukee bench was called for a technical in the third quarter and Lillard and Bennedict Mathurin were talking between the third and fourth quarters. Mathurin had 16 points. \n\n\r\n              Then in a foul-prone fourth as Pacers swingman Buddy Hield threw a pass off the backboard to the trailing Isaiah Jackson for a dunk to make it 118-100 with 9:41 to play and following a Milwaukee timeout, Antetokounmpo was knocked hard to the ground. Players gathered near the basket and after an official review for a hostile act Milwaukee rookie Andre Jackson Jr. and Obi Toppin both were assessed technical fouls.\n\n\r\n              But the difference in this game was Indiana's third-quarter eruption.\n\n\r\n              Milwaukee emerged from a back-and-forth first half with a 68-66 lead, but the Pacers opened the second half on a 21-6 run, extended the lead to 113-97 after three quarters and the Bucks couldn't get closer than 10 the rest of the game.\n\n\r\n              “I would just say we did a good job of digging down and getting stops when we needed them,” Haliburton said. “When we play in transition, were a really tough team to beat.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At San Antonio on Thursday night.\n\n\r\n              Pacers: Host Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996138.589876
}