{
  "game_id": "0021900915",
  "espn_id": "401161557",
  "date": "Mar 03, 2020",
  "matchup": "LAL vs. PHI",
  "headline": "Anthony Davis scores 37, leads Lakers past Sixers 120-107",
  "body": "LOS ANGELES --  Shortly before halftime, 6-foot-10 Anthony Davis coolly dropped a crossover dribble and a Eurostep layup on the 76ers.\n\nAnd then shortly after halftime, 35-year-old LeBron James walked the ball upcourt and casually drilled a 3-pointer from the \"R\" inside the Lakers' half-court logo.\n\nThe superstar duo had another full night of doing things that blow people's minds.\n\nAgainst an undermanned but lively Sixers lineup, Los Angeles needed most of that magic to win again.\n\nDavis scored 18 of his 37 points during a phenomenal second-quarter surge, and the Lakers held off injury-depleted Philadelphia 120-107 on Tuesday night.\n\nJames had 22 points, 14 assists and seven rebounds for the Lakers, who moved to 47-13 with their ninth win in 10 games. His 40-footer was a stylish flourish on an entertaining all-around game from the Lakers' two All-Stars, and it came at the end of a 44-10 run in roughly 10 minutes spanning halftime.\n\n\"That was a great stretch for our team, for our season,\" Lakers coach Frank Vogel said. \"To see us be able to take over a game like that was a positive sign.\"\n\nJames and Davis had to carry them past the Sixers, who played without injured starters Joel Embiid, Ben Simmons and Josh Richardson. To James, the Lakers can learn from their slow start and big surge as they prepare to make a run at a championship in several weeks.\n\n\"We've lost to teams that were missing starters this year, but everyone here is an NBA player,\" James said. \"We all got here for a reason, so you don't ever disrespect that. You don't ever disrespect the game. They're a very good team no matter what.\"\n\nDavis hit four 3-pointers while grabbing 13 rebounds and going 13 of 19 from the field, with no basket prettier than his crossover to ditch Al Horford. He made all seven of his shots in the second quarter while the Lakers played some of their prettiest basketball of the year.\n\n\"I started off really slow and missed some shots that were wide open,\" Davis said. \"I was just trying to figure out how I could get myself going. Once one of us got it going, it got contagious until all of us got going.\"\n\nGlenn Robinson III matched his career high with 25 points and Tobias Harris had 18 for the Sixers, who have lost nine consecutive road games since Jan. 20.\n\nPhiladelphia lost twice at Staples Center to start its four-game California road trip despite this persistent effort against the powerhouse Lakers.\n\nPhilly's role players and backups got off to an impressive start, taking an early 13-point lead. That's when Davis took control with a dazzling quarter that included three 3-pointers. The Lakers made 17 of their 19 shots at one point.\n\n\"Obviously we played two really good teams here,\" Harris said. \"I felt like we had a good start, and then that second quarter hurt us. I think where the game really slipped was they picked up their defensive intensity, and from there it rushed us.\"\n\nTIP-INS\n\n76ers: Richardson is in the NBA's concussion protocol after colliding with teammate Alec Burks in Sunday's loss to the Clippers. ... Embiid missed his third straight game with a sprained left shoulder. ... Simmons missed his fifth straight game with a lower back injury.\n\nLakers: Alex Caruso missed his second straight game with a sore right hamstring. ... Los Angeles plays its next six games at Staples Center, with a \"road\" game against the Clippers on Sunday. ... Davis played despite a sore right knee that kept him out of LA's last game. ... Dwight Howard had 11 points without missing a shot at the line or in the field.\n\nFROM DOWNTOWN\n\nJames' 3-pointer from the logo both put the Lakers up by 19 and set off a raucous standing ovation at Staples Center. When the Sixers quickly called a timeout, Davis joined JaVale McGee and Danny Green at midcourt to comically inspect the spot from which LeBron launched the shot.\n\n\"That was pretty funny,\" James said with a smile.\n\nEVEN SPLIT\n\nThe teams split their season series. The 76ers beat the Lakers 108-91 on Jan. 25 while James passed Kobe Bryant for third place on the NBA's career scoring list. Bryant died in a helicopter crash the next morning, several hours after congratulating James on the accomplishment.\n\nFOR KOBE\n\nPhiladelphia coach Brett Brown and his assistants wore Bryant's sneakers on the bench. Bryant graduated from high school outside Philadelphia. \"It's a very small way, but it's our way of showing the level of respect and appreciation and gratitude for everything he did for the sport, what he meant to this city and this building,\" Brown said. \"And, as I say, it's a small thing, but it's our thing, and I'm thrilled we could show some level of consideration.\"\n\nUP NEXT\n\n76ers: Visit the Sacramento Kings on Thursday night.\n\nLakers: Host the Milwaukee Bucks on Friday night in a showdown of conference leaders.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996739.535222
}