{
  "game_id": "0022200863",
  "espn_id": "401469018",
  "date": "Feb 13, 2023",
  "matchup": "ORL @ CHI",
  "headline": "Banchero, Wagner, Fultz lead Magic over Bulls 100-91",
  "body": "CHICAGO -- — The Orlando Magic were sailing along with what appeared to be a comfortable lead before things tightened up in the closing minutes.\n\n\r\n              Just when it looked like they might be in trouble, they regrouped and found a way to pull out a win over Chicago.\n\n\r\n              Paolo Banchero scored 22 points, Franz Wagner and Markelle Fultz added 18 points apiece and the Magic beat the cold-shooting Bulls 100-91 on Monday night.\n\n\r\n              Fultz just missed a triple-double with 10 rebounds and nine assists. Wendell Carter Jr. scored 15 points against his former team as the Magic won for the fourth time in six games.\n\n\r\n              Coming off an overtime loss at home to Miami, Orlando led by 13 midway through the fourth and hung on after Chicago got within five. \n\n\r\n              “We know what we need to do,” Fultz said. “I think today we did a great job as players, just talking amongst each other and understanding that we're gonna be in a situation and we've got to find a way to get through it. I think that's what you saw tonight. We just all talked to each other, continued to push each other and not get too frustrated when they got it down to five.\"\n\n\r\n              The Bulls matched a season high by dropping their fourth in a row, thanks to another horrendous shooting performance. They missed their first 16 3-pointers before Coby White hit one late in the third and 18 of 21 in all. Chicago is 26 of 125 from long range over its past five games.\n\n\r\n              Coach Billy Donovan said all those misses led to some poor decisions and, in turn, difficulties hanging onto the ball. The Bulls committed 16 turnovers.\n\n\r\n              “I think it's just normal instinct — let's just drive the ball in there, let's drive it to the basket,” Donovan said. “What happened is two times we had charges and a few times we had spray-outs that weren't there, that weren't open, that we turned the ball over.\"\n\n\r\n              Zach LaVine led the Bulls with 26 points, and DeMar DeRozan scored 19 even though a hip issue that's been bothering him the past six weeks or so flared up.\n\n\r\n              “It's been bad,” he said. “I'm never gonna want to complain or make any type of excuses. It's just been something I've been dealing with for a while.”\n\n\r\n              Former Magic star Nikola Vucevic finished with 13 points and 13 rebounds.\n\n\r\n              MAGIC HANG ON\n\n\r\n              Orlando led 89-76 after Banchero hit a 12-footer with just over five minutes remaining. DeRozan cut for a layup to pull Chicago within 91-86 with 3:34 left. But Carter answered with a three-point play following a timeout and the Magic remained in control the rest of the way.\n\n\r\n              “We had that problem in two of the last couple games, where we had the lead the whole game and gave it away in the last couple minutes,\" Wagner said. “All (coach Jamahl Mosley) said was stay composed, keep pushing the pace because that's what helped us early on in the game.”\n\n\r\n              TAKING CONTROL\n\n\r\n              Orlando took control early in the third, when 3-pointers by Gary Harris Jr. and Wagner made it 60-50.\n\n\r\n              The Bulls' next three possessions ended with Patrick Williams missing badly on a tip-in, Ayo Dosunmu getting blocked by Fultz on a fast-break layup and LaVine getting called for traveling. DeRozan then made a turnaround jumper. But Wagner nailed a 3 and Carter scored, making it 65-52 midway through the third.\n\n\r\n              It was 73-63 with less than two minutes remaining in the quarter when White hit the first 3 for Chicago. A reverse layup by Dalen Terry pulled Chicago within five. Orlando's Moritz Wagner hit a 3 to make it 76-68 with 30 seconds remaining in the quarter.\n\n\r\n              TIP-INS\n\n\r\n              Magic: The Magic signed C Goga Bitadze on Monday. Drafted by Indiana with the No. 18 overall pick in 2019, Bitadze averaged 4.8 points over four seasons before getting released by the Pacers last week. ... G Cole Anthony (sore right wrist) missed the game. ... The Magic have made at least one 3-pointer in 1,269 consecutive games, the fifth-longest active streak in the NBA and the fifth-longest in league history.\n\n\r\n              Bulls: Chicago is on its third four-game losing streak. ... F Derrick Jones Jr. (strained left adductor) left the game. ... G Alex Caruso (sore left foot) sat out for the third time in six games.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Visit Toronto on Tuesday.\n\n\r\n              Bulls: Visit Indiana on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994618.5060632
}