{
  "game_id": "0021701141",
  "espn_id": "400975887",
  "date": "Mar 31, 2018",
  "matchup": "BKN @ MIA",
  "headline": "Nets deny Heat a clincher, beat Miami 110-109 in OT",
  "body": "MIAMI --  On the court, it was a bad night for the Miami Heat.\n\nAnd postgame, it got worse.\n\nRondae Hollis-Jefferson scored 20 points, Caris Levert scored to put Brooklyn up for good with about a half-minute left in overtime, and the Nets beat the Heat 110-109 on Saturday night -- a game where Dwyane Wade thought he got fouled on the final shot of the night, and followed by Miami center Hassan Whiteside complaining about how little he played.\n\n\"A good old-fashioned brawl,\" Nets coach Kenny Atkinson said.\n\nHe wasn't kidding.\n\nWade's right arm was aching postgame, from his shoulder to his wrist, after taking an array of hits. Hollis-Jefferson needed stitches to close a cut near his left eye, a souvenir from a wild final few seconds that saw bodies flying everywhere. Tempers flared on both sides, and the Heat expect the NBA to tell them Sunday that some calls were missed.\n\n\"Thanks for nothing,\" Heat coach Erik Spoelstra said.\n\nIf the league agrees that calls were missed, it won't matter. The loss will stick. And the Heat have bigger problems anyway.\n\nNot only did Miami miss a chance to clinch a playoff spot, but their center -- and their highest-paid player -- asked out of the game early in the first quarter, and wound up not playing at all in the fourth quarter or overtime. Whiteside, who just came back from a nine-game absence because of what was described as left hip pain, went on an expletive-filled rant postgame.\n\n\"We got one of the best centers in the league,\" Whiteside said. \"Why we matching up? A lot of teams don't have a good center. So they're going to use their strength. It's (expletive). It's really (expletive), man. There's a lot of teams that could use a center.\"\n\nThe Nets didn't need one. They played small-ball most of the night and put seven players in double figures for the second straight game -- something that franchise hadn't done in 29 years. Levert finished with 19, Brooklyn's six-game overtime losing streak ended, and the Nets went 3-1 against the Heat this season.\n\n\"This was huge,\" said Brooklyn's Spencer Dinwiddie, who finished with 12 points. \"Obviously, we're not going to the playoffs but we're trying to build for next season and every win we can get is important.\"\n\nJames Johnson and Goran Dragic each scored 18 for Miami, which got 16 from Kelly Olynyk and 14 from Whiteside. Wade and Josh Richardson each had 13 for the Heat, whose magic number for clinching remained one.\n\nMiami came out flying, taking a quick 30-16 lead when Wade hit a 3-pointer. The lead was still 11 early in the second, and it looked like a bit of comeuppance -- clinching a spot against a Nets team that offered no resistance in Game 82 at Chicago last season, a Bulls win that eliminated the Heat from the postseason -- was on the way.\n\nNot quite.\n\nBrooklyn took the lead midway through the third, and answered the challenge when Miami went ahead late in the fourth and twice more in overtime.\n\n\"The basketball gods weren't here tonight,\" Wade said. \"It's a loss. This team, there are certain matchups that are tough for you. This team has been one.\"\n\nTIP-INS\n\nNets: D'Angelo Russell started for Brooklyn, played the first 6 1/2 minutes, missed all five of his shots while turning the ball over twice and never saw the floor again. ... Brooklyn has had a great year against the Southeast Division. The Nets are 12-6 against Miami's division -- and 13-45 against the other five divisions, including 1-13 against their Atlantic rivals.\n\nHeat: Miami remains one win shy of clinching its 18th winning record in Pat Riley's 23 seasons with the organization. Only San Antonio has more winning seasons (22) in that 23-year stretch. ... The Heat have scored at least 90 points in 26 consecutive games, tying the third-best streak in team history. They've done it in 37 straight games on two other occasions.\n\nSCORING RECORD\n\nThe Heat finished March averaging 111.7 points for the month -- the best for any full month in team history.\n\nMUTUAL RESPECT\n\nSpoelstra said he can see, and respects, how the Nets are trying to create a winning culture. Atkinson took that as high praise -- knowing \"culture\" is a very significant word to the Heat. \"From Erik to Pat Riley, they've been doing it for a long time. They're a team that we imitate,\" Atkinson said.\n\nUP NEXT\n\nNets: Host Detroit on Sunday.\n\nHeat: Visit Atlanta on Tuesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993805.734304
}