{
  "game_id": "0022400157",
  "espn_id": "401704723",
  "date": "Nov 04, 2024",
  "matchup": "ATL vs. BOS",
  "headline": "Jayson Tatum's big first half leads Celtics to 123-93 rout of Hawks",
  "body": "ATLANTA -- — Jayson Tatum scored 26 of his 28 points in the first half, and the Boston Celtics routed the Atlanta Hawks 123-93 on Monday night for their third straight win.\n\n\r\n              Tatum also had nine assists and six rebounds and did not play in the fourth quarter with the Celtics comfortably in front.\n\n\r\n              Hawks guard Trae Young left the game in the third quarter with a right rib strain. He was 1 for 10 from the floor and finished with two points and six assists in 23 minutes.\n\n\r\n              Derrick White had 21 points and six assists for Boston. Payton Pritchard scored 18 points off the bench.\n\n\r\n              The Celtics lost both games in Atlanta last season, blowing a 30-point lead in one game and losing the other in overtime.\n\n\r\n              The Celtics have won 16 straight when Jaylen Brown does not play. Brown has missed the last two games with a left hip flexor strain.\n\n\r\n              Takeaways\r\n              Celtics: At 7-1, the Celtics are off to their best start since 2019-20, when they started 10-1. They wrapped up a four-game road trip at 3-1, with the loss coming in overtime at Indiana.\n\n\r\n              Hawks: Jalen Johnson continues to take a step forward after a slow start to the season with 20 points and 11 rebounds, giving him over 20 points in four of his last five games.\n\n\r\n              Key moment\r\n              The Celtics went on a 19-4 run to close the second quarter, pushing a seven-point lead to 22. Tatum and White had seven points each during the run. The Hawks were never within 19 points in the second half.\n\n\r\n              Key stat\r\n              The Celtics hit 18 3-pointers, including 15 in the first half, and outscored the Hawks 54-18 from behind the 3-point line. The Hawks entered the game allowing an NBA-worst 41.4% shooting from deep.\n\n\r\n              Up next\r\n              The Celtics return home to face the Warriors on Wednesday, and the Hawks will host the Knicks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997930.930308
}