{
  "game_id": "0021600981",
  "espn_id": "400900376",
  "date": "Mar 11, 2017",
  "matchup": "MEM vs. ATL",
  "headline": "Prince scores 17 as Hawks rout Grizzlies 107-90",
  "body": "MEMPHIS, Tenn. --  With three straight wins, the Atlanta Hawks think they are setting themselves up nicely to carry momentum into the postseason.\n\nMeanwhile, the Memphis Grizzlies can do absolutely nothing right.\n\nTaurean Prince had a season-best 17 points, the Hawks used a balanced scoring attack in shooting 50 percent and sent the Grizzlies to their fifth straight loss with a 107-90 victory over Memphis on Saturday night.\n\n\"I think that's every team's goal -- to be on a roll going into the postseason,\" said Prince, a rookie from Baylor, who made five of his six shots, including shooting 3 of 4 from outside the arc. \"That's what we want to do. We want to keep this streak going.\"\n\nDennis Schroder and Paul Millsap finished with 16 points each for Atlanta. Millsap added 11 rebounds, while Schroder had seven rebounds and eight assists as the Hawks moved within a game of the Toronto Raptors for the fourth seed in the East.\n\nThe Hawks played without center Dwight Howard, who took the night off to rest in the second game of a back-to-back for Atlanta, which defeated Toronto 105-99 on Friday night.\n\nMemphis has no momentum right now. The loss dropped the Grizzlies into the seventh spot in the Western Conference. The Grizzlies defense, once the team's staple, has allowed all five opponents in the losing streak to surpass 100 points.\n\n\"We're just bad right now,\" first-year coach David Fizdale said. \"We've looked at everything. Lineups, getting them out early to warm up, everything you could think of. For some reason right now, we are not coming out of the locker room with any pop.\"\n\nJaMychal Green led Memphis with 20 points and 11 rebounds, while Mike Conley scored 16. Brandan Wright finished with 10 points.\n\nMemphis, which has not shot better than 45 percent in the last four games, finished the night at 38 percent from the field and converted only five of 29 shots outside the arc.\n\nShooting woes plagued the Grizzlies throughout the game, and Memphis fell in love with the 3-pointer, despite hitting only two of its first 21.\n\nAt the midway point of the third, the Hawks were still hitting half their shots overall and half their 3-pointers, allowing Atlanta's lead to stretch to 24 points.\n\nThe Hawks would hold a 77-57 lead entering the fourth. No Memphis player was in double figures at that point.\n\n\"We need to get back to trusting each other on the defensive end, and it starts from there,\" Memphis guard Tony Allen said.\n\nTIP-INS\n\nHawks: Howard missed his sixth game this season, including three with back tightness. It marked the third time this season he sat out on the second night of a back-to-back. ... Millsap had scored 20 or more points in a career-best five straight games before Saturday night. ... Schroder had made 24 consecutive free throws before a miss in the second quarter. ... Jose Calderon finished with 14 points, all in the fourth quarter.\n\nGrizzlies: Memphis missed nine of its first 10 shots and was 2 of 16 as the Hawks built an early nine-point lead. ... Conley was the first Memphis player to reach double figures converting a trio of free throws with 9:58 left.\n\nPLAYOFF REGULARS: The Hawks and Grizzlies, who both appear headed back to the playoffs, have two of the longest continuous postseason streaks. Atlanta has been in the playoffs nine straight years, while Memphis has made six consecutive postseason appearances. Only San Antonio, with a run of 20 straight, has more than the Hawks and Grizzlies.\n\nANOTHER SHUFFLE: Fizdale shuffled his lineup for the third straight game, inserting Green and James Ennis along with Parsons, Marc Gasol and Conley. \"This will be the first time looking at this one,\" Fizdale said. \"I'm looking forward to seeing those guys out there together.\"\n\nUP NEXT\n\nHawks: Head to San Antonio on Monday to face the Spurs.\n\nGrizzlies: Host Milwaukee on Monday, the final game of a four-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764995571.267736
}