{
  "game_id": "0021500219",
  "espn_id": "400828106",
  "date": "Nov 25, 2015",
  "matchup": "TOR vs. CLE",
  "headline": "Lowry, DeRozan lead Raptors past Cavaliers, 103-99",
  "body": "TORONTO -- After a long road trip, the Toronto Raptors looked like a fresh team back home.\nKyle Lowry scored 27 points and DeMar DeRozan added 20 as the Raptors beat the Cleveland Cavaliers 103-99 on Wednesday night for their third straight victory.\nThe Raptors played five road games on a nine-day trip that ended Sunday.\n\"I think it's just good to be home,\" Lowry said.\n\n\"Every time you come off a West Coast road trip, it's a little bit harder to get that first game under your belt. We did a good job keeping ourselves focused.\"\nLeBron James had 24 points, eight assists and six rebounds for the Cavaliers (11-4), who lost their third straight road game. Kevin Love added 21 points and 13 rebounds.\n\"They're a good team,\" Love said. \"We also, on a lot of plays, executed our offense but just missed some shots that we normally make and that happened down the stretch and that is never a good time for that.\"\nIt was a tight contest for much of the night, as the lead changed hands 16 times. It was tied seven times.\nThe Raptors went up for good with 7:45 to go in the fourth. Cleveland missed eight straight shots during the pivotal stretch and was just 7 for 20 in the fourth.\n\"I thought fatigue played a big part in it,\" Cleveland coach David Blatt said.\n\"I thought we got tired, for obvious reasons. We're very short-handed. Our guys played hard. I thought we just ran out of gas. It's not an excuse. It's just an observation.\"\nThe Cavs are playing without the injured Kyrie Irving, Timofey Mozgov, Matthew Dellavedova and Iman Shumpert, but James rejected suggestions fatigue was a factor.\n\"It's not an excuse,\" he said. \"We need to hold each other more accountable.\n\"We got to play better, and we will. But I don't think we improved tonight.\"\nAfter missing their first five shots of the fourth quarter, the Raptors scored nine straight points over a two-minute span to open a 91-84 lead with 5:38 to go.\nPatrick Patterson and Lowry book-ended the run by hitting 3-pointers to the delight of a sellout crowd of 19,800 at Air Canada Centre.\nJames hit a pair of free throws with 2:52 to go to cut the Toronto lead to five, but the Raptors then went on a 7-2 run, including a pair of huge buckets by Bismack Biyombo to close it out.\nBiyombo, taking the place of an injured Jonas Valanciunas, scored six points over the final 2:29. He finished with 11 points and 12 rebounds.\n\"He set the tone for us defensively,\" Toronto coach Dwane Casey said. \"Protecting the paint, talking, being physical, being a deterrent at the rim and that was big for us as far as protecting the paint.\"\nCasey said the Raptors won't \"get caught up in one game\" after beating the Eastern Conference champions.\n\"We're excited about the win, no question,\" he said. \"But we can't go over the moon and lose our focus and lose sight of continuing to improve in a lot of areas.\"\nThe Raptors took an 82-80 lead into the fourth. It appeared that lead would be five when Lowry's layup capped his 14-point third quarter, but Cleveland's Mo Williams hit a shot from halfcourt at the buzzer.\nThe game was deadlocked at 49 at halftime as the teams combined for eight lead changes, with the Raptors up by as many as 10 points and the Cavaliers stretching their biggest lead to seven points.\nThe teams were tied at 25 after one quarter as Luis Scola shot 7 for 9 to lead all scorers with 15 points.\nTIP-INS\nCavaliers: The Cavaliers, who are a perfect 8-0 at home, are now 3-4 away from Cleveland. .The Cavaliers went 14 for 29 from 3-point range and have made at least 11 from beyond the arc in seven of their last eight games. ... Williams returned after missing two games with a right ankle injury, scoring 15 points 31 minutes.\nRaptors: It was the Raptors' third annual Drake Night in honor of the Toronto rapper, who is also the team's Global Brand Ambassador. The Raptors wore black and gold jerseys inspired by his OVO record label. .Tristan Thompson and Raptors' guard Cory Joseph both grew up in the Toronto area and were teammates at Findlay Prep in Las Vegas and then the University of Texas.\nLEBRON CLIMBS ALL-TIME LIST:\nJames passed former Indiana Pacers guard Reggie Miller for 18th on the NBA scoring list. With his 24 points on the night, James now has 25,298 in his career.\nQUOTABLE:\n\"You've got to have a bunker mentality when you go on the road. We've got to understand that it is our guys versus everyone else, versus the fans, versus the opposing group.\" -- James, on the Cavaliers' struggles on the road so far this season.\nDRAKE NIGHT:\nThe singer, sitting courtside with his mom, announced Toronto's starting lineup. The Raptors are 3-0 in their Drake games.\nUP NEXT\nCavaliers: Visit Charlotte on Friday.\nRaptors: Visit Washington on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994760.922194
}