{
  "game_id": "0022201171",
  "espn_id": "401469326",
  "date": "Apr 02, 2023",
  "matchup": "LAL @ HOU",
  "headline": "Davis has 40, James a triple-double as Lakers beat Rockets",
  "body": "HOUSTON -- — Anthony Davis scored 40 points, LeBron James had 18 points, 11 assists and 10 rebounds to tie Jason Kidd for fourth place with his 107th triple-double and the Los Angeles Lakers beat the Houston Rockets 134-109 on Sunday night.\n\n\r\n              The Lakers (40-38) moved two games over .500 and into a tie for seventh with the New Orleans Pelicans in the Western Conference with four games to go. Los Angeles has won six of its last seven games and owns the tiebreaker over the Pelicans.\n\n\r\n              “We just want to put ourselves in the position to compete for a championship,” James said. “It’s a journey and obviously we don’t have as much chemistry as a lot of other teams that have aspirations to win a championship, but we’ve been building over the last month or so.\n\n\r\n              \"These last four games are very important for our team, not only wins and losses but also the chemistry side as well. We need to continue to build what we’ve been building over the last month or so. We’ll see what happens.”\n\n\r\n              Davis scored 27 in the first half en route to his first 40-point performance since scoring 55 against the Washington Wizards on Dec. 4 and his third of the season.\n\n\r\n              “We always say we want to get stronger as the season gets longer and be playing our best basketball at the right time,” Lakers coach Darvin Ham said. “Well, the time is definitely right and everybody’s in a good rhythm starting with (Davis) first and foremost. He understands wholeheartedly what we need him to do and he’s coming out and trying to do that.”\n\n\r\n              Davis has scored 38 points or more in three straight games and at least 37 in four of the last five.\n\n\r\n              “I’m in a great rhythm, feeling good,” Davis said. “Feel like I’m back to myself before the injury. We are all playing well. The guys are making it easy for me.”\n\n\r\n              Lakers starter D’Angelo Russell, who has started every game since being acquired in a three-team trade from the Minnesota Timberwolves on Feb. 9, did not return to play in the second half due to left foot soreness. Russell had six points, four assists and three rebounds in 15 minutes.\n\n\r\n              “It was definitely precautionary,” Ham said of sitting Russell for the second half. “He could have continued the game if we needed him to. The bodies we have available to us now, we just didn’t want to risk it.”\n\n\r\n              Ham said Russell will be reevaluated and see how he feels on Monday. \n\n\r\n              Alperen Sengun notched his third straight double-double with 18 points and 15 rebounds, Jalen Green scored 24 points and Kevin Porter Jr. chipped in 20 points. Prior to this stretch, Sengun had one double-double over the previous nine games played.\n\n\r\n              “That’s an experienced group over there that really needed the win,” Rockets coach Stephen Silas said. “And then a bunch of young guys who are trying to figure it out, who fought and tried. Hopefully learned something tonight.”\n\n\r\n              The Lakers owned a 70-60 halftime lead, which the Rockets cut to six with 9:38 to go in the third quarter on a reverse layup by Green.\n\n\r\n              With 30.3 seconds left in the third quarter, James got a roar from the Lakers fans with an emphatic one-handed tomahawk dunk to bring the Lakers’ lead back to 16. That was a part of a 20-7 run by Los Angeles to extend the lead to 117-90 with 7:56 to go.\n\n\r\n              “You know a guy his size, his ability to get downhill and also make those quick reads, I mean you see it on TV and people can tell you about it, but being actually in the game setting and that’s your matchup,” Kenyon Martin Jr., who scored 11 points, said. “It’s something you got to experience, so that’s the tough thing about guarding (James).”\n\n\r\n               TIP-INS\n\n\r\n              Lakers: Rui Hachimura scored 20 points and had a season-high 12 rebounds … Austin Reaves scored 16 points … Malik Beasley scored 13 points off the bench.\n\n\r\n              Rockets: All five starters scored in double digits. … Houston Texans new coach DeMeco Ryans was introduced prior to the game and did the Rockets “First Shot”.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Visit the Utah Jazz on Tuesday night.\n\n\r\n              Rockets: Host the Denver Nuggets on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994112.056509
}