{
  "game_id": "401810179",
  "espn_id": "401810179",
  "date": "Dec 03, 2025",
  "matchup": "CLE vs POR",
  "headline": "Deni Avdija scores 27 points to help the Trail Blazers beat the Cavaliers 122-110",
  "body": "CLEVELAND -- — Deni Avdija scored 27 points, Caleb Love and Shaedon Sharpe added 20 apiece off the bench and the Portland Trail Blazers snapped a three-game losing streak, beating the Cleveland Cavaliers 122-110 on Wednesday night.\n\n\r\n              Donovan Mitchell led Cleveland with 33 points, and Evan Mobley had 23 points and 10 rebounds. The Cavaliers have dropped four of five and this was their first loss this season against a team with a losing record.\n\n\r\n              The Trail Blazers had six players in double figures as they went 34 of 39 from the foul line. Avdija was 16 of 17.\n\n\r\n              Portland led by 10 at halftime and two minutes into the fourth quarter before it went on a 14-6 run that included 10 straight points by Toumani Camara. The third-year forward is 9 of 15 from beyond the arc in the last three games.\n\n\r\n              The Trail Blazers were 6 of 10 on 3-pointers in the third quarter.\n\n\r\n              Cleveland, which had an eight-point lead in the first quarter, went on a 13-4 run in the fourth quarter as Mobley's 3-pointer got the Cavaliers within 113-108 with 2:37 remaining. Avdija countered with a 12-foot turnaround jumper in the paint and Mobley missed from the perimeter to end any further hopes of a comeback.\n\n\r\n              The short-handed Cavaliers were missing Jarrett Allen (finger strain), Larry Nance Jr. (calf strain) and Sam Merrill (hand sprain).\n\n\r\n              It was the 13th 30-point game for Mitchell, whose 30.7 points per game average makes him fourth in the league in scoring.\n\n\r\n              Up next\r\n              Trail Blazers: At Detroit on Friday. night\n\n\r\n              Cavaliers: Host San Antonio on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042741.744417
}