{
  "game_id": "0022000685",
  "espn_id": "401307474",
  "date": "Mar 26, 2021",
  "matchup": "MIL vs. BOS",
  "headline": "Tatum, Smart help Celtics end Bucks' winning streak",
  "body": "MILWAUKEE -- — Jayson Tatum scored 34 points, Marcus Smart had 23 and the Boston Celtics beat Milwaukee 122-114 on Friday night to snap the Bucks’ eight-game winning streak and spilt the two-game series.\n\n\r\n                    The Celtics, who led 60-55 at the half, hit nine of 14 3-pointers in the third quarter to push the lead to 103-89 entering the final period.\n\n\r\n                    “It felt good to get a win. A lot of guys played well. Especially after what happened yesterday, losing a couple of my teammates,” Tatum said, referring to deadline trades. “So, it just happened to come together today. It was only one win, but maybe this can be the start of something good.”\n\n\r\n                    Bryn Forbes’ 3-pointer pulled Milwaukee to 112-97, but newly acquired Moe Wagner and Smart countered from beyond the arc to extend the lead to 118-97.\n\n\r\n                    Kemba Walker added 21 points, and Jaylen Brown had 18 for the Celtics.\n\n\r\n                    “Boston played really, really well tonight on both ends of the court,” Bucks coach Mike Budenholzer said. “They were excellent. We didn’t play our best. When a team plays that well and you’re not clicking, you’re not playing your best or kind of matching that execution both offensively and defensively, that’s just to me what I saw. They played really well and we weren’t as good as them tonight.”\n\n\r\n                    Boston finished 22 of 47 from beyond the arc. Smart was 7 for 10, and Brown and Tatum added four apiece.\n\n\r\n                    “We want layups. We want to get to the rim, but Milwaukee’s one of the best at closing down the paint,” Celtics coach Brad Stevens said. “And certainly we saw saw some bad rim reads hurt us in the first half. It got them going in transition, because we tried to shoot it over people and through people instead of kicking it out.”\n\n\r\n                    For the second straight game, the Celtics held Giannis Antetokounmpo in check, holding him to 16 points, well below his 28.6 average. Khris Middleton had 19 points and Jrue Holiday 17 for the Bucks.\n\n\r\n                    “They hit a lot of 3s,” Antetokounmpo said. “We tried to make it as tough as possible, but they hit open 3s. They hit contested 3s. That’s what they do. That’s what they did. Especially guys like Tatum, Brown, Kemba, Smart, when they get themselves going and feel good, it’s hard. To beat a team like the Celtics, you’ve got to be able to stop them from the 3-point line.”\n\n\r\n                    The Celtics, who had lost five of their previous six, erased most of a 25-point second-half deficit in a 121-119 loss at Milwaukee on Wednesday night, missing a chance to win when Daniel Theis missed a 3-pointer at the buzzer. \n\n\r\n                    Antetokounmpo was held to 13 points in that game.\n\n\r\n                    With Milwaukee unable to close the gap, reserves played much of the fourth quarter.\n\n\r\n                    “We just didn’t play good enough tonight – all of us – so it just felt like the right thing to do,” Budenholzer said. “I thought those bench guys were great. A lot of positives. Those guys work and prepare all the time. I was happy with how they finished the game. Sometimes you’ve got to go with that.”\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Boston’s recent slump dropped it below .500 so much depends on the acclimation of trade-deadline acquisitions of Evan Fournier, Moe Wagner and Luke Kornet, especially Fournier, who was averaging a career-best 19.7 points with Orlando.\n\n\r\n                    Bucks: Reserve forward Bobby Portis was out Friday due to COVID-19 protocols, the first game he’s missed this season. Portis is averaging 11.0 points, 6.8 rebounds in 21 minutes per game.\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: At Oklahoma City on Saturday night.\n\n\r\n                    Bucks: Host New York on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764997385.925579
}