{
  "game_id": "401809951",
  "espn_id": "401809951",
  "date": "Oct 24, 2025",
  "matchup": "LAL vs MIN",
  "headline": "Luka Doncic scores 49 to extend his sizzling season start in Lakers' 128-110 win over Timberwolves",
  "body": "LOS ANGELES -- — Luka Doncic scored 49 points and became the fourth player in NBA history to begin a season with back-to-back 40-point performances, leading the Los Angeles Lakers to a 128-110 victory over the Minnesota Timberwolves on Friday night.\n\n\r\n              Doncic followed his 43-point game in an opening-night loss to Golden State with his highest-scoring effort yet in a Lakers jersey, going 14 for 23 with five 3-pointers while adding 11 rebounds and eight assists.\n\n\r\n              The Slovenian superstar also made 16 of his 19 free throws, yet he missed his final two field goal attempts and a late free throw to fall just short of his eighth career 50-point game.\n\n\r\n              Michael Jordan, Wilt Chamberlain and Anthony Davis have also started NBA seasons with a pair of 40-point games. Doncic was traded to LA for Davis last winter.\n\n\r\n              Anthony Edwards scored 31 points and Julius Randle had 26 for Minnesota, which couldn't slow the Lakers' offense in a rematch of last season's first-round playoff series won in five games by the Wolves.\n\n\r\n              Austin Reaves added 25 points, 11 assists and seven rebounds, while Rui Hachimura scored 23 and Deandre Ayton had 15 for the Lakers.\n\n\r\n              LeBron James watched from the Lakers’ bench while wearing the Arizona Wildcats jersey of his younger son, Bryce. The top scorer in NBA history is out until at least mid-November with sciatica.\n\n\r\n              Doncic mildly injured his groin in the Lakers' opener, and he hurt his left hand in the opening moments against Minnesota, grabbing at it repeatedly while bent over in pain.\n\n\r\n              He still scored 23 points on 8-of-12 shooting with four 3-pointers in the first quarter, matching Kobe Bryant and Kyle Kuzma for the Lakers' most prolific opening quarter in the past 30 years.\n\n\r\n              Doncic had 32 points by halftime, and he added seven quick points early in the fourth quarter as the Lakers pulled away by 20.\n\n\r\n              Bronny James made his season debut for the Lakers, playing the final 3:14.\n\n\r\n              Up next\r\n              Timberwolves: Host Indiana on Sunday night.\n\n\r\n              Lakers: At Sacramento on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042495.144641
}