{
  "game_id": "0022000544",
  "espn_id": "401267704",
  "date": "Mar 03, 2021",
  "matchup": "ATL @ ORL",
  "headline": "Young scores 32 as Hawks rally from 19 down to beat Magic",
  "body": "ORLANDO, Fla. -- — Trae Young and the Atlanta Hawks haven’t had much to smile about this season — until now.\n\n\r\n                    The star guard scored 32 points and hit the go-ahead free throws with eight seconds remaining as Atlanta rallied from 19 down in the second half to beat the Orlando Magic 115-112 on Wednesday night.\n\n\r\n                    Coupled with Tuesday’s win in Miami, the Hawks improved to 2-0 under interim coach Nate McMillan and won consecutive games for the first time in 5 1/2 weeks. McMillan took over Monday when Atlanta fired Lloyd Pierce following a 14-20 start.\n\n\r\n                    “It feels good and I think this is my first win going into the All-Star break, and for us it’s good momentum,” said Young, who had 20 points after halftime to lead the Hawks back from a 61-42 deficit. “We were talking, wanting to finish out strong and saying, `Don’t start the break too early.’ For us, you could tell how much it meant to us to win that game.”\n\n\r\n                    All-Star center Nikola Vucevic, who had 29 points and nine rebounds, briefly put Orlando ahead 112-111 with a follow-up layup with 18 seconds to play.\n\n\r\n                    Seconds later, Atlanta put the ball in Young’s hands and he was fouled by Michael Carter-Williams on a drive to the rim. All night long, it was Young who had trouble with hard drives by Carter-Williams (20 points). This time, Young got the last laugh.\n\n\r\n                    Terrence Ross, who made his second start in three seasons and scored 28 points, missed a runner in the lane in the closing seconds. The Magic lost their fifth straight after Atlanta outscored them 73-51 in the second half.\n\n\r\n                    “We talk all the time about playing 48 minutes and it took all 48 minutes of playing this game to get it,” McMillan said after the Hawks improved to 2-5 on the second night of a back-to-back. “Our guys did not give up and it’s a testament of our character. It took all 48 minutes, but we got it.”\n\n\r\n                    Atlanta shot 9 of 13 on 3-pointers in the fourth quarter and made 21 of 45 from beyond the arc overall. Danilo Gallinari hit five 3s and scored 15 of his 23 points in the second half. \n\n\r\n                    John Collins had 15 points and Kevin Huerter added 13. All five Hawks starters made at least three 3s. Young was 4 of 7 on 3s and sank 10 of 11 free throws.\n\n\r\n                    “Our defense wasn’t at the level that it was at for three quarters,” Vucevic lamented.\n\n\r\n                    Atlanta took its first lead at 111-110 when Tony Snell drilled a corner 3 off a feed from Young with 1:09 to play.\n\n\r\n                    “It’s no statement to anybody but ourselves that we can win games,” Young said. “We can all go out there and make plays. If it’s a statement to anybody it’s to us that we can win some games.”\n\n\r\n                    TIP- INS\n\n\r\n                    Hawks: Clint Capela, the NBA’s leading rebounder (14.2 per game), didn’t play because of a sore foot. McMillan said Capela was inadvertently kicked in his heel Tuesday at Miami and the injury worsened. … Snell had 11 points and three 3s.\n\n\r\n                    Magic: Evan Fournier missed his 15th game, this time because of a groin strain sustained Monday while scoring 26 points. Fournier previously missed 14 games with back spasms. The Magic are 10-11 with Fournier, but 3-12 when he’s out. … Orlando set a franchise record by making all 27 of its free throws, topping the previous mark of 22 without a miss in April 2019 at Boston.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Face the Toronto Raptors in Tampa on March 11.\n\n\r\n                    Magic: Play in Miami on March 11.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997642.044106
}