{
  "game_id": "0022200523",
  "espn_id": "401468678",
  "date": "Dec 29, 2022",
  "matchup": "CHA vs. OKC",
  "headline": "LaMelo Ball has 27 points to help Hornets beat Thunder",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball had 27 points, 10 rebounds and nine assists and the Charlotte Hornets beat the Oklahoma City Thunder 121-113 on Thursday night for just their third victory in the last 14 games.\n\n\r\n              P.J. Washington added 25 points on 10-of-13 shooting and Charlotte got a promising effort from rookie center Mark Williams with career highs of 17 points and 13 rebounds to go along with two blocks.\n\n\r\n              Mason Plumlee added 14 points and nine rebounds for the Hornets. They outscored the Thunder 18-10 in the final 4:14 to break open a tie game.\n\n\r\n              “I'm just taking what the defense gives me,” said Ball, who was 5 of 10 from 3-point range and is shooting 38.5% from the beyond the arc since returning from a sprained ankle.\n\n\r\n              Shai Gilgeous-Alexander had 28 points for Oklahoma City. Luguentz Dort added 22 and Josh Giddey had 21 points and 10 rebounds. The Thunder had won four of their last five.\n\n\r\n              The 7-foot Williams gave the Hornets a promising look into their future.\n\n\r\n              The 15th overall pick in the draft out of Duke has spent the majority of the season in the G League and recovering from an ankle injury. He'd never crested double digits in points or rebounds in his previous five NBA games, but made a big impression in front of Hornets fans in his first home game.\n\n\r\n              “It felt great,” said Williams, who was 7 of 7 from the floor. “I'm playing to my strengths — running the floor, setting screens and protecting the rim, rebounding. ... just doing all the winning things and trying to provide the team a little boost.”\n\n\r\n              Hornets coach Steve Clifford chose to use Williams as his backup center over Nick Richards.\n\n\r\n              “That means a lot and I want to show it was the right decision,” Williams said.\n\n\r\n              Said Clifford: \"He has the basic background to be a very effective NBA player – he protects the rim, he’s smart, he’s good with coverages. He has to work on his screening and rolling. For somebody like ’Melo, Gordon (Hayward) or Terry (Rozier), if they get a good pick with a solid roll, we’re going to get a good shot. It’s an important part of the NBA game.” \n\n\r\n              Clifford said the Williams “showed what he's capable of” but now wants to see if he can do it on a consistent basis.\n\n\r\n              \"What it gets back to in this league is you have to do it three or four times a week and you have to do it against different types of players and different types of coverages,” Clifford said.\n\n\r\n              The Hornets, who returned home after a six-game trip, shot 72.7% in the first quarter and led the entire first half until Mike Muscala hit down a corner 3 at the buzzer to give the Thunder its first lead of the game at halftime, 60-57.\n\n\r\n              With the game tied at 103, Ball hit a floater in the lane to put the Hornets up for good and Washington knocked down a 3 off a dish from Rozier. Rozier added two free throws and Plumlee tipped in a rebound to make it 112-103 with 1:35 remaining.\n\n\r\n              Ball put the game away with a 3-pointer from the wing and a lookahead pass to Rozier.\n\n\r\n              “They had 66 points in the paint tonight,\" said Thunder coach Mike Daigneault. \"A lot of why we’ve had some success lately, defensively especially, has been because of our ability to protect the paint. And we certainly didn’t do that well enough.”\n\n\r\n              TIP INS\n\n\r\n              Thunder: Were outrebounded 52-41. ... Tre Mann had 17 points off the bench.\n\n\r\n              Hornets: Shot 54.8% from the field. ... Kelly Oubre Jr. returned to action after missing a game with a left hand sprain but left early after getting hit in the hand. He played 14 minutes. \n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Philadelphia on Saturday night.\n\n\r\n              Hornets: Host Brooklyn on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994272.99672
}