{
  "game_id": "0022400260",
  "espn_id": "401704826",
  "date": "Nov 21, 2024",
  "matchup": "CHA vs. DET",
  "headline": "Miller scores 38 and Ball adds 35 to lead Hornets past Pistons 123-121 in OT",
  "body": "CHARLOTTE, N.C. -- — Brandon Miller scored eight of his career-high 38 points in overtime, and the Charlotte Hornets hung on to beat the Detroit Pistons 123-121 on Thursday night.\n\n\r\n              Miller was 8 for 12 from 3-point range — two of those coming in overtime — and LaMelo Ball had 35 points and nine assists before fouling out one second into OT as Charlotte prevailed after squandering a 20-point lead in the third quarter.\n\n\r\n              Detroit's Cade Cunningham had 27 points and 10 assists before leaving the game with a hip injury with 48 seconds remaining in regulation after being fouled by Grant Williams. Cunningham made two free throws before leaving the game.\n\n\r\n              Ball, who has struggled with foul trouble issues this season, picked up three in the first quarter and took a on the bench. He returned to score 13 of Charlotte’s 15 points in a stretch of the third quarter.\n\n\r\n              The Pistons stormed back and took the lead on Cunningham's free throws. Ball tied the game with a floater and Malik Beasley missed two short-range shots. Ball had a chance to win the game at the end of regulation but his floater didn't fall.\n\n\r\n              Takeaways\r\n              Pistons: Jalen Duren was a non-factor for most of the game, finishing with five points and nine rebounds despite facing a Hornets team playing without centers Mark Williams and Nick Richards.\n\n\r\n              Hornets: Charlotte said Williams (foot tendon strain) and Richards (rib fracture) have “returned to group and team activities,” and are getting close to returning to action.\n\n\r\n              Key moment\r\n              Miller drained his career-best eighth 3-pointer with 32 seconds left in overtime to give Charlotte a six-point lead.\n\n\r\n              Key stat\r\n              Miller and Ball became the first Hornets to score 35 points in the same game in franchise history.\n\n\r\n              Up next\r\n              Pistons visit the Orlando Magic on Saturday night, while the Hornets travel to face the Milwaukee Bucks.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997460.109793
}