{
  "game_id": "0022200394",
  "espn_id": "401468549",
  "date": "Dec 10, 2022",
  "matchup": "MIN @ POR",
  "headline": "Lillard has 36 points, Trail Blazers beat Timberwolves",
  "body": "PORTLAND, Ore. -- — Damian Lillard had 36 points and eight assists, Anfernee Simons added 31 points and the Portland Trail Blazers beat the Minnesota Timberwolves 124-118 on Saturday night.\n\n\r\n              Portland overcame a 10-point deficit in the second half to beat Minnesota in the opener of a two-game set. They will meet again in Portland on Monday night.\n\n\r\n              Jerami Grant added 17 points for Portland, and Jusuf Nurkic had 15 rebounds. Drew Eubanks scored 10 points, two on a ferocious dunk on Rudy Gobert.\n\n\r\n              “I was just like Drew is bouncy, but Rudy Gobert like he’s so tall and long, he always get to it. He always kind of stands under the rim so I said, `Let’s see how this one go,’” Lillard said about Eubanks' slam. “And he got ’em!”\n\n\r\n              Anthony Edwards led Minnesota with 26 points, and Gobert and D’Angelo Russell had 24 points apiece.\n\n\r\n              Portland’s third-quarter rally started on the defensive end, but there was no big strategic adjustments. Rather, it was the players who sparked the defensive change in themselves. \n\n\r\n              “I think it was our guys in the huddle challenging each other,” Blazers coach Chauncey Billups said about what changed defensively. “They were pretty upset with each other giving up baskets so easily. By the way, (Minnesota) can do that to you. They can make you look that way. But at the same time our guys had a lot of pride. It was really them. It wasn’t me, it was them talking to each other.”\n\n\r\n              “We know we had to pick it up, that’s the biggest thing,” Blazers guard Josh Hart said about Portland’s defense. “We know they made shots but you got to be better defensively. That’s how we we’re going to win games, that’s how we play fast and we’re a tough team to beat when we do that.”\n\n\r\n              The Trail Blazers rallied to take a 94-92 advantage into the fourth quarter. Lillard was a big reason why, scoring 12 points in the third quarter.\n\n\r\n              Lillard was 15 of 15 from the free-throw line as the Blazers outscored Minnesota 25-18 at the foul line. \n\n\r\n              “There were a bunch of times where we didn’t have to foul,” Minnesota’s Naz Reid said after the game. \n\n\r\n              The Blazers also had a massive advantage in second-chance points, 22-4. \n\n\r\n              After scoring 40 points Thursday night in a loss to Denver, Lillard was hot again, scoring 11 points in the first quarter to help the Blazers take a 32-27 lead.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Minnesota guard Jordan McLaughlin sat out because of a strained calf. Coach Chris Finch said McLaughlin’s status is “day-to-day.”\n\n\r\n              Trail Blazers: Guard Gary Payton II has yet to play this season in a comeback from core muscle surgery. Payton is participating in 3-on-3, but does not have a designated date to return. “He was pretty sore after he plays, but I’m just happy to see him on the court,” Blazers coach Chauncey Billups said. “I’m happy to see him on the court, which means obviously he’s getting closer.”\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995178.630688
}