{
  "game_id": "0022000268",
  "espn_id": "401267428",
  "date": "Jan 26, 2021",
  "matchup": "LAC @ ATL",
  "headline": "Young's 38 points lead Hawks past depleted Clippers, 108-99",
  "body": "ATLANTA -- — Trae Young scored 38 points and the Atlanta Hawks beat the depleted Los Angeles Clippers 108-99 on Tuesday night, ending the Clippers’ seven-game winning streak.\n\n\r\n                    The Clippers were without three starters. Leading scorers Kawhi Leonard and Paul George were ruled out due to health and safety protocols. Guard Patrick Beverley missed the game with right knee soreness.\n\n\r\n                    “It’s tough. It’s just how this year is going to go,” said Los Angeles center Ivica Zubac, who noted the Clippers had not been impacted by the coronavirus pandemic before this week.\n\n\r\n                    “We were lucky to have everyone so far, but it is what it is,\" Zubac said. \"We’ve got to adjust. It’s going to be this type of season for everyone and we’re not the exception.”\n\n\r\n                    Reggie Jackson led the Clippers with 20 points, eight assists and seven rebounds. Serge Ibaka had 15 points.\n\n\r\n                    De’Andre Hunter had 22 points for Atlanta. Clint Capela collected 13 points and 19 rebounds.\n\n\r\n                    Three free throws by Young gave the Hawks a 95-85 lead. Jackson’s three-point play trimmed the advantage to 101-96, but Kevin Huerter answered with his third 3-pointer of the fourth period.\n\n\r\n                    Ibaka had 13 first-half points to help the Clippers to a 48-43 lead at the break. Young’s 14 points in the third quarter sparked the Hawks’ second-half surge.\n\n\r\n                    “I think we just upped our intensity and just played a little bit harder,” Young said. “For us, coming into the game we weren’t necessarily locked in from the beginning. ... We just need to do a better job of attacking the first half the same way we do the second.”\n\n\r\n                    Teams are not allowed to reveal if players in the health and safety protocol have tested positive for COVID-19. Contact tracing and inconclusive test results also could place players in the protocol.\n\n\r\n                    Coach Tyronn Lue said before the game Leonard and George “are feeling well.”\n\n\r\n                    Leonard is averaging 25.9 points and George is right behind at 23.9, leaving a significant scoring void. \n\n\r\n                    “Our guys are up for the challenge,” Lue said. “No excuses. ... Hopefully they can get back and join the team soon.”\n\n\r\n                    The Clippers’ patchwork lineup struggled early on with perimeter shooting. Los Angeles made only two of its first 11 3-point shots and 8 of 26 overall.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Lue said he was eager to see his backups have an opportunity to make a bigger contribution. G Terance Mann had 10 points in his first start of the season. Jackson made his second start and Luke Kennard had 13 points. \n\n\r\n                    Hawks: Young (back spasms) and Capela (sore right hand) returned after missing one game. F Cam Reddish (right Achilles tightness) was held out. ... The team wore its new City Edition MLK jerseys for the second time, honoring Atlanta native Dr. Martin Luther King’s legacy. ... John Collins had 11 points with 11 rebounds and set a career high by blocking five shots.\n\n\r\n                    STRONG FINISH\n\n\r\n                    Huerter gave the Hawks a fourth-quarter push by scoring each of his 13 points in the final period. Huerter sank consecutive 3-pointers after Los Angeles pulled even at 79-all, giving Atlanta the lead for good. \n\n\r\n                    “That fourth quarter in a lot of ways I felt more in rhythm and was just taking better shots,” Huerter said. “I got back to the strongest part of my game.”\n\n\r\n                    WELCOME BACK\n\n\r\n                    Approximately 1,300 Hawks season-ticket holders attended the game, less than 10% capacity of State Farm Arena. It was the Hawks’ first move toward a gradual return of fans. Tarps continued to cover seats on the side of the arena behind the teams.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Six-game road trip continues on Thursday at Miami.\n\n\r\n                    Hawks: Remain home to play Brooklyn Nets on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997698.6912441
}