{
  "game_id": "0021800570",
  "espn_id": "401071246",
  "date": "Jan 04, 2019",
  "matchup": "MEM vs. BKN",
  "headline": "Russell, Carroll lead surging Nets past Grizzlies, 109-100",
  "body": "MEMPHIS, Tenn. --  The Brooklyn Nets had the right formula for a winning start to their road trip.\n\n\"Defense, defense, defense. I thought we were outstanding defensively,\" Brooklyn coach Kenny Atkinson said.\n\nD'Angelo Russell had 23 points and 10 assists, DeMarre Carroll added 20 points, including five 3-pointers, and the Nets beat the Memphis Grizzlies 109-100 on Friday night.\n\nThe Nets limited Memphis to 45 percent shooting, including 5 of 24 (21 percent) from outside the arc, and won for the 11th time in their last 14 games. That came after the Nets lost eight in a row, quite a reversal that has moved Brooklyn into the Eastern Conference's eighth playoff spot.\n\n\"One game at a time,\" Russell said. As for the change of play during the recent span, Russell said: \"It's the focus, defense. I would say everybody coming into their place. Everybody's realizing their roles, and it's leading to wins.\"\n\nJoe Harris added 18 points for the Nets, who had six players in double figures. Spencer Dinwiddie scored 13 points and Jarrett Allen had 12 points and 12 rebounds, including five off the offensive glass.\n\nMike Conley, held scoreless in Wednesday's loss to Detroit, led the Grizzlies with 31 points. Jaren Jackson Jr. added 19 and Kyle Anderson managed a triple-double with 11 points, 11 rebounds and 10 assists.\n\nMarc Gasol had 13 points, nine rebounds and seven assists.\n\nWhile the Nets relished in their reversal of fortunes, the Memphis malaise continued. The Grizzlies have lost four in a row, 11 of their last 14 and the frustration led to a locker room fracas after Wednesday's loss to the Detroit Pistons.\n\nWhile tempers cooled, the tussle didn't seem to lead to better energy or results for the Grizzlies.\n\n\"We have to stick together obviously, but there's no more talking to do,\" Anderson said. \"You have to go out there and perform.\"\n\nThe Nets led 48-47 at intermission, but pulled away in the fourth with a 9-2 run in the latter half of the quarter. That gave Brooklyn a 106-94 cushion and Memphis never got closer than six points the rest of the way.\n\n\"I do think there's a little bit of self-doubt,\" Memphis coach J.B. Bickerstaff said of his team's mindset. \"When times get tough, and you're going through these situations, that can start to creep in.\n\n\"But we've got to find a way to get it done. No one is come to save us.\"\n\nTIP-INS\n\nNets: Rondae Hollis-Jefferson missed his second straight game with a right adductor strain. ... Carroll's previous season high for 3-pointers was four on two other occasions. . ... The victory gave the Nets three straight road wins over the Grizzlies, matching the longest against the Grizzlies since the team was in Vancouver in late 1990s. ... Carroll's 20 points helped Brooklyn's reserves outscore Memphis' 51-20.\n\nGrizzlies: Conley was listed as questionable with left shoulder soreness from an injury suffered in Wednesday night's loss to the Pistons. ... Justin Holiday, acquired in a trade with the Chicago Bulls, was not with the team yet. ... Anderson recorded his first career triple-double and 13th in franchise history. ... Memphis had five blocks and nine steals, four of the steals by Conley.\n\nREVENGE\n\nThe Brooklyn victory avenged a 131-125 double-overtime loss to Memphis on Nov. 30. This time, the Nets outscored the Grizzlies in the fourth to make sure and avoid overtime. \"We owed them one,\" Russell said. \"I felt like we gave it away to them last time, so we had to learn from it and not do that this time.\"\n\nOUTSIDE THE ARC ADVANTAGE\n\nThe Nets finished 13 of 34 from 3-point range, the 10th game in the last 11 that a Memphis opponent has made double-digit 3-pointers. Over the last 10 games, opponents are averaging 13.5 made 3-pointers. \"We're giving up too many 3s,\" Grizzlies guard Garrett Temple said, adding that the weakside help seems confused right now. \".I don't know because the game plan is clear. But we have to find way to run guys off (the 3-point line).\"\n\nUP NEXT\n\nNets: Visit the Chicago Bulls on Sunday.\n\nGrizzlies: Visit San Antonio on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994127.645994
}