{
  "game_id": "0022300063",
  "espn_id": "401584691",
  "date": "Oct 25, 2023",
  "matchup": "CHA vs. ATL",
  "headline": "PJ Washington scores 25, rookie Brandon Miller provides spark as Hornets top Hawks 116-110 in opener",
  "body": "CHARLOTTE, N.C. -- — Victor Wembanyama has commanded a lot of the headlines in the NBA offseason.\n\n\r\n              But fellow rookie Brandon Miller proved in the season opener that he can play a little, too.\n\n\r\n              P.J. Washington scored 25 points, Miller provided a huge spark with eight of his 13 points in the fourth quarter and the Charlotte Hornets held on to defeat the Atlanta Hawks 116-110 on Wednesday night.\n\n\r\n              Miller, the No. 2 overall pick in the draft behind San Antonio's Wembanyama, was the first man off the bench for the Hornets and knocked down a 3 from the left wing on his first shot attempt, drawing a roar from the home crowd. But the Alabama product picked up his third foul midway through the second quarter and had to sit most of the first half.\n\n\r\n              He returned and started to heat up in the fourth quarter, converting a step-back 3-pointer from the corner and a reserve layup before burying another 3 from the top of the key to give the Hornets a 101-99 lead they never surrendered over the final 4:19.\n\n\r\n              “He's not like most guys his age,” Hornets coach Steve Clifford said. “He gets in foul trouble and some guys wouldn't be able to come back from that. He had a couple calls that didn't go his way. But then he made some huge plays in the fourth quarter. If you watch him, he has great self-confidence.”\n\n\r\n              Miller called his step-back 3 from corner that beat the shot clock his best play and what got him going.\n\n\r\n              “It definitely hasn’t settled in yet,\" said Miller, who played 24 minutes in his first NBA game. “I think tonight it’s probably going to settle in when I go to sleep. I’m definitely going to feel it tomorrow morning.”\n\n\r\n              Washington and Terry Rozier hit runners to push Charlotte's lead to six with about a minute to play.\n\n\r\n              Trae Young closed the gap to three with his first 3 of the game, but Rozier answered with a short pull-up jumper from the baseline to make it a two-possession game with 22 seconds left to help secure the win.\n\n\r\n              Rozier added 24 points for the Hornets and LaMelo Ball shook off a rough first half and finished with 15 points and 10 assists. Mark Williams chipped in with 13 points and 15 rebounds for Charlotte.\n\n\r\n              Ball, playing in his first regular-season game since breaking his ankle eight months ago, struggled throughout the first half, missing all eight shots from the field. But he bounced back with four 3-pointers in the second half, turning the momentum of the game.\n\n\r\n              Clifford said Ball is still working into basketball shape after just being cleared to play about a month ago.\n\n\r\n              “He's just not in rhythm yet,\" Clifford said. “Its nobody's fault. He was rehabbing all summer. He will get there. But I loved the way he competed. He wanted to win.”\n\n\r\n              Young had 23 points to lead the Hawks, but shot 1 for 9 from 3-point range. Jalen Johnson had a career-high 21 points.\n\n\r\n              The Hawks were just 5 of 29 from beyond the arc.\n\n\r\n              “Sometimes when a team struggles like we struggled from the 3-point line.... it becomes really difficult to defend in transition,” Hawks coach Quin Snyder said. “Layups and threes, I think we have a team that can make both of those, (but) it’s very common when you’re not having a good shooting night to stop defending.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Knicks on Friday night in their home opener.\n\n\r\n              Hornets: Host Pistons on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995673.670246
}