{
  "game_id": "0021900023",
  "espn_id": "401160665",
  "date": "Oct 25, 2019",
  "matchup": "PHX @ DEN",
  "headline": "Murray helps Nuggets hang on to beat Suns 108-107 in OT",
  "body": "DENVER --  This was Jamal Murray's overriding emotion after watching his teammate block a last-second shot to preserve the win, after seeing another teammate called for a foul on a half-court shot to send the game into overtime and after his clutch baskets in the closing moments:\n\n\"Tired,\" the point guard said.\n\nA fitting feeling following such a crazy contest.\n\nMurray scored seven of his 27 points in OT and the Denver Nuggets regrouped to beat the Phoenix Suns 108-107 in their home opener Friday night after Ricky Rubio tied the game late in regulation when he was fouled on a half-court shot.\n\n\"It was definitely a game of different emotions,\" Torrey Craig said.\n\nThe final emotion? Relief.\n\nMurray hit two free throws with 19.4 seconds remaining in overtime to give the Nuggets the lead. Devin Booker took a last-second shot for Phoenix, but Craig glided over from the opposite side to get a hand on the jumper.\n\n\"Sometimes you need games like that,\" said Craig, who had four blocked shots. \"You can learn from it.\"\n\nNikola Jokic finished with 23 points, 14 rebounds and 12 assists to help the Nuggets escape after leading by nine with 3:10 remaining in the fourth.\n\nRubio extended the game in improbable fashion when he dribbled up the court and launched a 3-pointer as Malik Beasley grabbed his arm with 1.8 seconds remaining in regulation. He made all three free throws.\n\n\"Just an immature play by me. I've got to learn time and score,\" Beasley said. \"We still pulled it out and still made great plays.\"\n\nIn overtime, Murray took control. His game-winning free throws came soon after Gary Harris swatted the ball away from Frank Kaminsky down low.\n\nRubio, Aron Baynes and Kelly Oubre Jr. all fouled out in OT. Oubre led the team with 23 points.\n\n\"We fought hard all night,\" Booker said. \"Couple of things we need to clean up on, but we faced adversity tonight and we responded well to it.\"\n\nEspecially at the line, where the Suns went a combined 31 of 32. Kaminsky was 11 of 11, Rubio 7 of 7 and Oubre 6 of 6.\n\n\"If we keep playing like that it's going to be a good season,\" Rubio said.\n\nBefore Beasley's unnecessary foul, he was having quite a fourth quarter -- scoring eight straight points for Denver during a critical stretch. Jerami Grant also came up big in the fourth with a crowd-energizing, one-handed dunk off a missed 3-pointer.\n\nThe Nuggets have improved in each season under coach Michael Malone, going from 33 wins his first season to 40, 46 and 54 last season when the team earned the No. 2 overall seed in the West. A big reason for their success was an NBA-best 34-7 mark at home in 2018-19. Malone has challenged them to improve that record.\n\n\"Let's hold ourselves to an even higher standard,\" he said.\n\nSuns big man Deandre Ayton missed the first of 25 games after being suspended Thursday for violating the terms of the NBA/NBPA Anti-Drug Program after testing positive for a diuretic. Baynes had 15 points in place of the second-year center.\n\n\"We know things are going to happen, so when your name's called up you've got to perform,\" Rubio said.\n\nTIP-INS\n\nSuns: F Cameron Johnson missed a second straight game with left calf soreness. \"He's close,\" Suns coach Monty Williams said. ... Kaminsky had 19 points and 11 boards.\n\nNuggets: Denver had 12 blocked shots. ... Denver was misfiring from long range all game after making 18 3-pointers in a season-opening win at Portland. The team was 7 of 27 against Phoenix.  ... Trailing by as many as 14 points, the Nuggets took their first lead of the game, 57-55, on Jokic's three-point play at 4:16 of the third quarter.\n\nLOCAL AIRING\n\nAltitude TV purchased air time with a local station to broadcast the Nuggets home opener. Altitude Sports remains in negotiation with three former Altitude cable and satellite carriers -- Comcast, DIRECTV and DISH Network. The companies have dropped Altitude from its lineups. Altitude also broadcasts the Colorado Avalanche.\n\nTIGHT RELATIONSHIP\n\nWilliams holds Malone in high esteem. The feeling is mutual.\n\nMalone was a member of Williams' staff in 2010-11 when Williams was the head coach in New Orleans. Malone remembers an important lesson Williams imparted -- family first.\n\n\"He was kicking me out of office, telling me to go home,\" Malone recalled. \"He understood the importance of family.\"\n\nUP NEXT\n\nSuns: Host Kawhi Leonard and the Los Angeles Clippers on Saturday night. The Suns have lost 12 straight to the Clippers.\n\nNuggets: At Sacramento on Monday. The Nuggets were 3-0 against the Kings last season.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996595.993877
}