{
  "game_id": "0022000982",
  "espn_id": "401307785",
  "date": "May 03, 2021",
  "matchup": "LAL vs. DEN",
  "headline": "Davis scores 25 as short-handed Lakers defeat Nuggets 93-89",
  "body": "LOS ANGELES -- — Anthony Davis scored 25 points and had key plays on both ends of the floor in the final minute as the short-handed Los Angeles Lakers snapped a three-game losing streak with a 93-89 victory over the Denver Nuggets Monday night.\n\n\r\n                    The Lakers led by 14 points midway through the fourth quarter before the Nuggets got within 89-87 with a late rally. Davis hit a jumper with 41.8 seconds remaining to give the Lakers a four-point lead. Nikola Jokic hit a pair of free throws to cut it in half but Talen Horton-Tucker hit a reverse layup with 15.1 seconds left to push the advantage up to 93-89.\n\n\r\n                    After a Denver timeout, Davis blocked Facundo Campazzo's 3-point attempt to end any hopes of a Nuggets' comeback and end their five-game winning streak.\n\n\r\n                    The Lakers — who had lost six of their last seven going into the game — won without two key pieces. LeBron James did not play in the second game of a back-to-back after he ankle soreness during the fourth quarter of Sunday’s loss Toronto. Dennis Schröder will be out more than a week after entering the NBA’s health and safety protocol.\n\n\r\n                    Jokic led the Nuggets with 32 points and Michael Porter Jr. added 19.\n\n\r\n                    Los Angeles was up by five going into the fourth quarter when it started period on a 13-4 run with Wesley Matthews leading the way with eight points, including a pair of 3-pointers.\n\n\r\n                    The Nuggets trailed 87-73 with 6:09 remaining when they rallied with a 14-2 run. Porter Jr. had nine points, including a running layup to get them within a basket with 1:37 remaining, and Jokic supplied the other five. \n\n\r\n                    The Nuggets led most of the first half, but the Lakers closed the second quarter on an 11-3 run, including six points by Kentavious Caldwell-Pope, to go into halftime with a 45-42 advantage.\n\n\r\n                    A pair of Jokic free throws gave the Nuggets a 56-55 lead midway through the third quarter when the Lakers responded with a 9-2 spurt to go up by six.\n\n\r\n                    TIP INS\n\n\r\n                    Nuggets: G PJ Dozier was injured in early in the fourth quarter. He was taken to the locker room with left hip tightness and did not return. ... With Portland's loss, Denver is assured of finishing in the top six in the conference and will not have to worry about the Play-In Tournament. ... JaVale McGee received his 2020 NBA champions ring from the Lakers before the game. McGee signed with Cleveland during the offseason and was traded to Denver on March 25. This was his first trip back to Staples Center this season. He had eight of his 10 points in the second quarter.\n\n\r\n                    Lakers: Marc Gasol, who had not played in two of the past three games, entered in the second half and played 17 minutes. He had 10 points with all three of his field goals coming from the perimeter. ... Alex Caruso started for the second straight game and scored 11 points.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Host the Knicks on Wednesday.\n\n\r\n                    Lakers: Will be the visiting team against the Clippers at Staples Center on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997278.119282
}