{
  "game_id": "0022200878",
  "espn_id": "401469033",
  "date": "Feb 15, 2023",
  "matchup": "MIA @ BKN",
  "headline": "Mikal Bridges scores career-high 45, Nets beat Heat 116-105",
  "body": "NEW YORK -- — In his third game since arriving in the Kevin Durant trade, Mikal Bridges had an electrifying scoring stretch to rival even the superstar he replaced.\n\n\r\n              Bridges scored a career-high 45 points, including 15 in a row for Brooklyn to break open a game that had been close for 3 1/2 quarters, and the Nets beat the Miami Heat 116-105 on Wednesday night in the final game for both teams before the All-Star break.\n\n\r\n              “I just had it going and my teammates found me every time,” Bridges said. \n\n\r\n              The Nets led only 90-89 before Bridges went to work with an array of drives, 3-pointers and jumpers over the next three minutes. That pushed the lead to nine and when another Nets player finally scored, it was a 3-pointer by fellow former Phoenix player Cam Johnson that pushed it to 108-96.\n\n\r\n              Bridges scored 17 points in the final quarter to blow by his previous career best of 34 points. He was 17 of 24 from the field, 4 of 6 on 3s and 7 of 7 at the line, and also had eight rebounds and five assists.\n\n\r\n              “I think overall just his spirit and energy and juice, even at our walkthrough today, like he had the mindset it seemed like he wasn’t going to let us lose,” Nets coach Jacque Vaughn said. \n\n\r\n              Bridges was the runner-up for Defensive Player of the Year last season whose offensive game is growing. He said after the blockbuster trade last week that he understood why the Suns would trade him for Durant, and still does after averaging 25 points since while earning the nickname “Brooklyn Bridges.” \n\n\r\n              “You traded a future Hall of Famer that averaged damn near 30 for his career, so I’m just trying to continue to get better and get to a point where I can score a little more,” Bridges said. \n\n\r\n              Cam Thomas added 19 points and Johnson had 18 for the Nets, who won for the first time since the two former Suns joined them in the lineup.\n\n\r\n              Bam Adebayo had 24 points, 13 rebounds and six assists for the Heat. Max Strus scored 18 points. \n\n\r\n              The Heat fell behind New York into seventh place in the Eastern Conference, out of guaranteed playoff position, and will hope missing regulars Tyler Herro, Kyle Lowry and Victor Oladipo get healthy during the break. \n\n\r\n              “We've got 23 to go to get to where we need to get to,” Heat star Jimmy Butler said. “It’s all about being healthy, which is what going into this break is going to do for us, come out swinging for the fences in the right way.” \n\n\r\n              Bridges scored on a jumper with 0.2 seconds left to give the Nets an 83-80 lead after three quarters in which neither team led by more than six points. \n\n\r\n              Duncan Robinson had six points in his first game since Jan. 4 surgery to repair a finger ligament. \n\n\r\n              TIP-INS\n\n\r\n              Heat: Lowry missed his sixth straight game with left knee soreness. Oladipo has missed seven in a row with a sprained right ankle. ... Miami began a four-game road trip around the break. The Heat don't play at home again until March 1. \n\n\r\n              Nets: Ben Simmons was booed when he checked in four minutes into the game. He finished with two points, four rebounds and four assists in 20 minutes. ... Seth Curry was scoreless in 10 minutes after missing five games with a left adductor strain. ... Brooklyn plays nine of its first 11 games after the All-Star break on the road. \n\n\r\n              HURTING HERRO\n\n\r\n              Herro missed his second straight game with a bruised left knee but is still scheduled to fly to Salt Lake City and compete in the 3-point contest at All-Star weekend. \n\n\r\n              “You’re not burning any calories in that and you’re certainly not colliding or jumping or doing anything,” Heat coach Erik Spoelstra said. “He is making progress. He definitely is not ready to be able to play in an NBA game tonight and then we’ll just see how he feels the next two days with his treatment, whether he’ll be able to do that. I know that he really wants to.” \n\n\r\n              UP NEXT\n\n\r\n              Heat: At Milwaukee on Feb. 24.\n\n\r\n              Nets: At Chicago on Feb. 24.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993939.24525
}