{
  "game_id": "0021900448",
  "espn_id": "401161090",
  "date": "Dec 23, 2019",
  "matchup": "CHI @ ORL",
  "headline": "Ross scores 26, leads Magic to 103-95 victory over Bulls",
  "body": "ORLANDO, Fla. --  Terrence Ross scored a season-high 26 points Monday night to help the Orlando Magic break a three-game losing streak with a 103-95 victory over the Chicago Bulls.\n\nZach LaVine led Chicago with 26 points on 8-of-26 shooting, but the Bulls managed only 14 points in the fourth quarter. Tomas Satoransky added 20 points and was 4 of 5 on 3-point shots.\n\nNikola Vucevic had 21 points and seven rebounds for Orlando, which blocked 13 shots and held the Bulls to 31 percent shooting in the second half. Jonathan Isaac finished with 13 points, nine rebounds, five assists, four steals and three blocks.\n\nRoss, who made six 3-pointers, hit a short jumper and a 3-pointer on a 7-0 Magic run early in the fourth quarter to put Orlando ahead to stay.\n\nWith LaVine hitting two free throws and a 3-pointer, the Bulls scored the first nine points of the game.\n\nLauri Markkanen and LaVine made two 3-pointers apiece in the last 4:15 of the first half to leave Chicago with a 54-51 lead at the break.\n\nTIP-INS\n\nBulls: Daniel Gafford left the game early in the second quarter with a cut above his right eye. He returned in the third quarter. ... Before Kris Dunn got fouled with 5:59 left in the third quarter, the Bulls were looking at a 21-2 deficit in free throw attempts.\n\nMagic: Michael Carter-Williams did not play due to a shoulder injury sustained Friday night. ... The Magic were outrebounded (48-46) for the ninth straight game. ... Markelle Fultz gave sneakers and game tickets to 20 Orlando area students as a holiday surprise.\n\nUP NEXT\n\nBulls: Play at home against Atlanta on Saturday night.\n\nMagic: Play at home against Philadelphia on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996352.9670558
}