{
  "game_id": "0022400220",
  "espn_id": "401704786",
  "date": "Nov 13, 2024",
  "matchup": "PHI vs. CLE",
  "headline": "Cavs beats Sixers 114-106 to become 6th NBA team to start a season 13-0",
  "body": "PHILADELPHIA -- — Donovan Mitchell scored 11 of his 23 points in the final three minutes of the game and the Cleveland Cavaliers became the sixth team in NBA history to start a season 13-0 with a 114-106 win over the Philadelphia 76ers on Wednesday night. \n\n\r\n              Mitchell also grabbed 13 rebounds and added nine assists as Cleveland became the first team since the 2015-16 Golden State Warriors to win 13 straight to begin a season. That Warriors team holds the record for most wins to begin a campaign at 24 straight.\n\n\r\n              Darius Garland scored 25 points while Evan Mobley had 14 points with seven rebounds.\n\n\r\n              Jared McCain had a career-high 34 for the 76ers, who played without Paul George and Joel Embiid on the second night of a back-to-back as part of left knee injury maintenance. Kelly Oubre Jr. had 20 points while Caleb Martin added 18 for the Sixers.\n\n\r\n              Takeaways\r\n              Cavaliers: On a night when Cleveland didn’t come with its best game, the team had enough firepower to hold off a gritty bunch of young Sixers who played perhaps their best all-around game of the season. \n\n\r\n              76ers: The best news of the day for the Sixers came pre-game when both George and Embiid were cleared to play on Friday night in Orlando. Head coach Nick Nurse said George’s minutes restriction would be lifted. \n\n\r\n              Key moment\r\n              Mitchell hit three 3-pointers with less than three minutes to play to extend Cleveland's lead to seven, seemingly taking the starch out of the Sixers final push.\n\n\r\n              Key stat\r\n              The Cavaliers have won 13 in a row for the fourth time in franchise history. The other three times — in 2009, 2010 and 2017 — were when they had LeBron James on the roster.\n\n\r\n              Up next\r\n              Cavaliers: Play hosts to Chicago on Friday night. \n\n\r\n              76ers: Play at Orlando on Friday night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998226.405747
}