{
  "game_id": "0022400290",
  "espn_id": "401704856",
  "date": "Nov 27, 2024",
  "matchup": "HOU @ PHI",
  "headline": "Jalen Green's 41 points lead Rockets to 122-115 overtime win over 76ers",
  "body": "PHILADELPHIA -- — Jalen Green scored a season-high 41 points, Alperen Sengun added 22 points and 14 rebounds and the Houston Rockets beat the Philadelphia 76ers 122-115 in overtime on Wednesday night.\n\n\r\n              Tyrese Maxey scored 39 points, including 28 in the second half, in the loss for Philadelphia, which played without Paul George and Joel Embiid and fell to 3-14. Maxey, who tied the game with three free throws with just over 11 seconds left, was held scoreless in overtime.\n\n\r\n              Green rode the hot hand during the first quarter, scoring 18 points on 6-of-8 shooting. However, it was Sengun, the 6-foot-11 center from Turkey, who took over late against an undersized Philadelphia lineup that was collapsing on Green.\n\n\r\n              Amen Thompson had 19 points and 13 rebounds, while Tari Eason added 14 for Houston (14-6). Guerschon Yabusele had 22 in the losing cause for the Sixers.\n\n\r\n              Takeaways \r\n              Rockets: Houston’s ability to hit the boards is one of its biggest advantages. The Rockets entered Wednesday leading the league with 49.9 rebounds a game and outrebounded the Sixers 52-42.\n\n\r\n              76ers: Philadelphia continues to search for offensive answers other than Maxey with both George and Embiid out. Yabusele provided some of that spark on Wednesday, but Jared McCain was held to 15 on 6-of-19 shooting.\n\n\r\n              Key moment\r\n              After Yabusele opened the overtime with a corner 3 to give the Sixers a three-point lead, the Rockets went on a 9-0 run with Sengun hitting three layups after Green’s three free throws tied the game.\n\n\r\n              Key stat\r\n              Through 17 games, Philadephia has just one win in regulation.\n\n\r\n              Up next \r\n              The Rockets host Oklahoma City on Sunday, and the 76ers are at Detroit on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997402.2294662
}