{
  "game_id": "0022000193",
  "espn_id": "401267353",
  "date": "Jan 16, 2021",
  "matchup": "MEM vs. PHI",
  "headline": "Morant returns, Grizzlies top 76ers 106-104 for 4th straight",
  "body": "MEMPHIS, Tenn. -- — Ja Morant returned to the Memphis lineup after missing eight games with an ankle injury and scored 17 points, leading the Grizzlies to a 106-104 win over the Philadelphia 76ers on Saturday night. \n\n\r\n                    Morant, who sprained his left ankle Dec. 28 at Brooklyn, added six assists. Rookie Xavier Tillman added 15 points and Grayson Allen had 12 as the Grizzlies won their fourth straight game.\n\n\r\n                    “It felt good, starting with just being able to get back out there on the floor after being out almost three weeks,” Morant said. “I was really just itching to get back out there.”\n\n\r\n                    Shake Milton, who had 31 points in the Sixers win over Miami on Thursday, helped rally Philadelphia from a 13-point deficit in with a burst in the fourth quarter, scoring 15 of his 28 points in the period, while going 6 of 11 from the field in the frame.\n\n\r\n                    Tobias Harris added 21 points for Philadelphia, including six straight to pull the Sixers within 105-104 on a 12-footer with 1:25 left. But Harris stepped out of bounds in the closing seconds, turning the ball over.\n\n\r\n                    Tyrese Maxey missed a 3-pointer at the buzzer, and Memphis took the win.\n\n\r\n                    “It was just a very undisciplined, sloppy basketball game. Turned the ball over down the stretch the last two times,” Philadelphia coach Doc Rivers said, adding: “Disappointing loss to me. Very winnable game, and just didn’t get it done.”\n\n\r\n                    Ben Simmons fell just short of a triple-double with 11 points, a season-high 16 rebounds and nine assists.\n\n\r\n                    The Grizzlies benefited from Morant’s return, while the Sixers played without center Joel Embiid, who was rested due to right knee pain. It was yet another game where Philadelphia was without one of its starters.\n\n\r\n                    “At the end of the day, we do need each other. … When we are together, the five starters, we complement each other,” Harris said.\n\n\r\n                    Neither team led by more than six points in a closely played first half. Harris led balanced scoring from Philadelphia with 10 points. Morant led Memphis with 12 points.\n\n\r\n                    Memphis stretched the lead to 11 points near the midway point of the third quarter and eventually held an 88-76 lead heading into the fourth.\n\n\r\n                    The win marked the eighth straight game Memphis has held an opponent under 110 points.\n\n\r\n                    “Over the last eight games, these guys have just really embraced the opportunity to get better on both sides of the ball,” Memphis coach Taylor Jenkins said “Defensively, that’s a lot of credit to (the players).”\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: C Dwight Howard started his third game of the season in Embiid’s place. … Despite Embiid’s absence, Philadelphia had 11 blocks in the game, six in the first quarter, including three by Danny Green.\n\n\r\n                    Grizzlies: Have won seven straight home games in the series. Have not lost to the Sixers in Memphis since Dec. 26, 2012. … Counting the Brooklyn win when Morant was injured, the Grizzlies went 5-4 during his absence. … Brandon Clarke struggled in the first half, hitting only 1 of 9 shots. Dillon Brooks was 3 of 10 in the half.\n\n\r\n                    JA LOCKED IN\n\n\r\n                    The previous two games, the Grizzlies had hinted on Morant’s return, moving his status to questionable. But even before his return Saturday, he has stayed engaged while recovering from the ankle sprain.\n\n\r\n                    “He’s super locked-in on the sidelines, coaching from the sidelines,” Jenkins said. “So, we know his mind’s locked in. What he’s doing with his body to get back healthy, it’s been really impressive.”\n\n\r\n                    TOO MANY TURNOVERS\n\n\r\n                    Rivers was particularly bothered by his team’s turnovers. The 76ers committed 22 in the game.\n\n\r\n                    “If you play that way, you deserve to (lose),” Rivers said. “I would say of the 22 (turnovers), 15 were unforced. Just sloppy. Driving into traffic, cross-court passes, interior passes” that resulted in turnovers.\n\n\r\n                    UP NEXT\n\n\r\n                    Sixers: Travel to Oklahoma City for a game against the Thunder on Sunday.\n\n\r\n                    Grizzlies: Scheduled to host the Phoenix Suns in the annual Martin Luther King Jr. Day game on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996979.890241
}