{
  "game_id": "401810173",
  "espn_id": "401810173",
  "date": "Dec 02, 2025",
  "matchup": "PHI vs WSH",
  "headline": "Tyrese Maxey scores 20 of his 35 points in the 3rd quarter and the 76ers beat the Wizards 121-102",
  "body": "PHILADELPHIA -- — Tyrese Maxey scored 20 of his 35 points in the third quarter, Andre Drummond had 12 points and 10 rebounds, and the Philadelphia 76ers beat the Washington Wizards 121-102 on Tuesday night.\n\n\r\n              Maxey, who was coming off a 44-point performance, was 13 of 26 from the field to score 20-plus for the 20th straight game this season. He also had six assists and four steals in 29 minutes.\n\n\r\n              Philadelphia had its 66-54 halftime lead trimmed to five after Washington scored the first seven points of the third quarter. But the 76ers scored 11 of the next 13 points to rebuild a double-digit lead at 77-63.\n\n\r\n              Maxey scored 20 points in the third quarter, while the Wizards had just 23 after going 7 of 22 from the floor. Maxey did not play in the fourth quarter.\n\n\r\n              Philadelphia hit 100 points with 32.1 seconds left in the third on a free throw by Maxey. The 76ers extended the lead to 115-79 after starting the fourth on a 14-2 run.\n\n\r\n              Washington dropped to 1-11 on the road this season. \n\n\r\n              Jared McCain added 14 points for Philadelphia and fellow reserve Jabari Walker had 10 points and 12 rebounds. Paul George scored 11. \n\n\r\n              Washington had seven players score in double figures, led by Tristan Vukcevic with 16 points. Marvin Bagley III, Justin Champagnie and Will Riley each had 13 points. \n\n\r\n              Maxey scored 15 points in the first half, McCain added 11 and the 76ers went 9 of 21 behind the arc, while the Wizards shot 38% overall by halftime.\n\n\r\n              Philadelphia was without Quentin Grimes, who is third on the team with 17 points per game, for the first time this season.\n\n\r\n              Up next\r\n              Wizards: Host the Boston Celtics on Thursday. \n\n\r\n              76ers: Stay home to play the Golden State Warriors on Thursday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042735.940887
}