{
  "game_id": "0021301024",
  "espn_id": "400489897",
  "date": "Mar 21, 2014",
  "matchup": "OKC @ TOR",
  "headline": "Kevin Durant scores 51 as OKC overcomes Russell Westbrook's exit",
  "body": "TORONTO -- Kevin Durant had 51 points and 12 rebounds, All-Star guard Russell Westbrook limped off in the third quarter with a sprained right knee, and the Oklahoma City Thunder survived to beat the Toronto Raptors 119-118 in double overtime on Friday night.\nDurant hit a go-ahead 3 with 1.7 seconds left in the second overtime, Reggie Jackson scored 25 and Serge Ibaka had 13 as the Thunder won their fourth straight and finished off a 3-0 road trip that also included wins at Chicago and Cleveland.\nThe Thunder are 12-2 on the road against Eastern Conference opponents.\nDeMar DeRozan scored 33 points and Amir Johnson had 25 points and 12 rebounds for the Raptors. Kyle Lowry scored 25 and Greivis Vasquez fouled out after scoring 21.\nToronto led 118-110 after a pair of free throws by Lowry with 49 seconds left, but Durant banked in a 3 and Derek Fisher also connected from long range.\nToronto's John Salmons missed a pair from the line with 9.7 seconds left, setting up Durant for his winning shot.\nDeRozan had one final chance for Toronto, but his shot came up well short.\nDurant has scored 25 or more in 34 straight games, the league's longest streak since Michael Jordan did it in 40 consecutive games in 1986-87. Durant connected on 15 of 32 attempts, including 7 of 12 from 3-point range, and went 14 for 19 at the free throw line. He also had seven assists.\nWestbrook scored 15 points before leaving at 7:37 of the third after injuring his knee in a collision with Lowry.\nWestbrook, who sat out Thursday's win at Cleveland to rest the knee that was surgically repaired for the third time earlier this season, was injured when Lowry collided with him on a pump-fake near the sideline. Westbrook immediately turned and called timeout, bending over in pain. He hobbled along the sideline for a few steps and was tended to briefly by the trainer before walking off with help from center Hasheem Thabeet.\nWestbrook's knee problems began in April 2013, when he tore his meniscus in the second game of the Western Conference playoffs, sidelining him for the remainder of the postseason and all but ending Oklahoma City's chances of reaching the NBA Finals.\nHe had a second arthroscopic surgery as the Thunder were preparing for training camp after developing inflammation in the knee, but missed only two regular-season games before returning.\nThe three-time All-Star had surgery for a third time in late December and has been on a minutes restriction since returning Feb. 20 after a 27-game absence. He came in averaging 21.4 points, 7.8 rebounds and 5.8 assists in 36 games this season.\nDurant hit a tiebreaking 3 with 57 seconds left in the fourth quarter, putting the Thunder up 96-93, but Toronto tied it again when DeRozan made one of two from the line and Johnson scored a layup after grabbing the rebound on Lowry's missed jumper with 17 seconds left.\nOklahoma City inbounded the ball and let the clock run down to five seconds before getting the ball to Durant near midcourt. He passed to Fisher, but the veteran guard couldn't get a clean shot before the buzzer.\nLowry tied it at 107-107 on a 3 with seven seconds left in overtime. Jeremy Lamb missed a 3 with three seconds left and Durant came up short on a buzzer-beating jumper, sending it to a second overtime.\nDurant started 1 for 6 against the Cavaliers on Thursday and was slow off the mark again in Toronto, missing six of his first seven field goal attempts. But he finished the first with a flourish, hitting a buzzer-beating jumper to give the Thunder a 22-20 lead after one.\nThe entire Thunder team went cold to start the second, missing eight straight shots as Toronto took the lead with a 10-0 run. Jackson stopped the drought with a pull-up jumper at 7:59.\nOklahoma City hit six of 25 attempts in the second, with Durant going 1 for 4. DeRozan scored seven for Toronto while Lowry and Johnson had six each, but a 3 by Westbrook with one second left cut Toronto's halftime lead to 46-42.\nDurant scored 14 points in the third as the Thunder overcame Westbrook's departure to take a narrow 72-71 lead into the fourth.\nGame notes\nToronto is 1-6 in overtime. ... Durant was called for a technical with 27 seconds left in the second after tangling with Toronto's Jonas Valanciunas on a free throw. It was Durant's 15th of the season, leaving him one away from a suspension. ... Valanciunas returned to Toronto's starting lineup after sitting out Wednesday's win at New Orleans with a sore lower back. He finished with 13 rebounds. ... The Raptors were seeking to sweep a season series against a sixth Western Conference opponent. Toronto won both ends against Dallas, Memphis, Minnesota, New Orleans and Utah. ... Canadian Olympic figure skater Patrick Chan attended the game.",
  "source": "espn_api",
  "crawled_at": 1764992837.302913
}