{
  "game_id": "0021800826",
  "espn_id": "401071499",
  "date": "Feb 09, 2019",
  "matchup": "CLE @ IND",
  "headline": "Bogdanovic leads Pacers past Cavaliers for 5th straight win",
  "body": "INDIANAPOLIS --  The Indiana Pacers are sending a message to the rest of the NBA: Team basketball still wins games.\n\nBojan Bogdanovic scored 23 points and the Pacers extended their winning streak to five with a 105-90 victory over the Cleveland Cavaliers on Saturday night.\n\nDarren Collison added 18 points, Myles Turner had 14 points and eight rebounds and Domantas Sabonis came off the bench to score 13 points and grab 10 rebounds for the Pacers, who led by as many as 21 points.\n\nIndiana is third in the Eastern Conference standings. And, the Pacers have been doing this lately without Victor Oladipo, their lone All-Star who was lost for the season with a knee injury on Jan. 23.\n\n\"You can't just count on one player,\" Collison said. \"That's what's making us successful this year.\"\n\nCollison pointed out the Pacers' reserves as having a big impact overall.\n\n\"You've got a guy like Cory Joseph, who you probably don't even notice, but he comes in the game and he has an impact,\" Collison said. \"Aaron (Holiday) has an impact. TJ (Leaf) who hasn't played, he has an impact. You've got a lot of guys that can have an impact on the game. Really underrated players.\"\n\nJoseph had 10 points, 10 assists and nine rebounds, falling one board short of a triple-double. Holiday had 4 points in 14 minutes, while Leaf added 8 points in just 8 minutes.\n\nJordan Clarkson led the Cavaliers with 18 points, Larry Nance Jr. scored 16 points and grabbed 10 rebounds and Collin Sexton added 16 points for Cleveland.\n\nBogdanovic and Turner shared the scoring load for Indiana to start the game, combining for 26 of the Pacers' 54 first-half points. Turner started off the game scoring eight of the Pacers' first 12 points, forcing Cleveland into an early timeout with back-to-back 3-pointers.\n\nThe Pacers scored 30 points in the first quarter and led by 12 points at the half and never looked back.\n\nEarlier this week, Pacers coach Nate McMillan credited Indiana's ability to get back into a groove and play their style of basketball, which begins with good ball movement accompanying physical defense.\n\n\"We're moving the ball more, and I've always said when you have ball movement you're going to get good looks,\" McMillan said. \"We've been getting good ball movement. Guys have been kicking the ball out, they've been looking for each other, and that's how we want to play.\"\n\nIndiana outscored Cleveland 54-32 in points in the paint. The Pacers used transition basketball to gain an advantage, outscoring the Cavs 16-9 in fastbreak points.\n\n\"(Indiana) makes it tough on you,\" Cavaliers coach Larry Drew said. \"They're a good team and they understand the magnitude of certain games and wanting to come out and play hard. They wanted to make a statement. I thought (Indiana) came out with a tremendous amount of energy and intensity in our last meeting (in Cleveland). I just kind of felt like they were (doing that) in tonight's game to try and set the tone.\"\n\nDELAYED DEBUT\n\nVeteran swingman Wesley Matthews has cleared waivers, but as of Saturday, he had not yet officially signed with Indiana, his preferred destination, according to multiple reports. Matthews was waived by the Knicks following a deal that sent Kristaps Porzingis to Dallas.\n\nSCARY MOMENT\n\nJust two weeks after Indiana lost Oladipo, Turner gave Pacers fans an all-too familiar fright. At the beginning of the third quarter, Turner appeared to injure his right leg, holding his knee when he landed. Turner gently limped off the floor under his own power and was taken to Indiana's locker room for several minutes before returning to the Pacers bench, eventually re-entering the game at the end of the third quarter.\n\nTIP-INS\n\nCavs: Channing Frye is seven rebounds away from reaching 4,000 for his career. ... The Cavs are 3-12 since Jan. 2. ... Nance has recorded a double-double in five straight games.\n\nPacers: For the third straight game, the Pacers scored at least 30 points in the first quarter. ... Indiana is two wins away from tying its largest winning streak of the season at seven games. ... Bogdanovic has scored in double figures in 32 straight games and scored 20 points or more in five of Indiana's last six games. ... Doug McDermott did not play due to bruised ribs.\n\nUP NEXT\n\nCavs: Host the Knicks on Monday night.\n\nPacers: Host the Hornets on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994756.9272268
}