{
  "game_id": "0022400474",
  "espn_id": "401705040",
  "date": "Jan 03, 2025",
  "matchup": "CLE @ DAL",
  "headline": "Evan Mobley scores 34 as Cavaliers beat short-handed Mavericks 134-122, run win streak to 9 games",
  "body": "DALLAS -- — Evan Mobley had 34 points and 10 rebounds as the Cleveland Cavaliers ran their winning streak to nine games by beating the short-handed Dallas Mavericks 134-122 on Friday night.\n\n\r\n              The NBA-leading Cavs improved to 30-4, swept a four-game Western Conference road trip and are now 10-0 against the West. All nine wins in the streak have been by double digits.\n\n\r\n              The Mavericks played without both of their All-Star guards, Luka Doncic and Kyrie Irving. Irving missed the game because of illness while Doncic has been sidelined since suffering a calf strain during the Mavericks’ Christmas Day loss to Minnesota.\n\n\r\n              Caris LeVert scored 17 off the bench for Cleveland.\n\n\r\n              Quentin Grimes scored 26 points, 20 in the third period, to lead the Mavericks, who have lost four straight to match a season long losing streak. Jaden Hardy added 17 off the bench and Klay Thompson scored 16, all in the first half.\n\n\r\n              The Cavaliers used a 20-point run to go from a 21-17 deficit late in the first period to a 37-21 lead early in the second. Their largest lead was 27 points.\n\n\r\n              Takeaways\r\n              Cavaliers: Six players have averaged double figures in scoring this season. They had seven in this game.\n\n\r\n              Mavericks: The defending West champions went into Christmas Day 4 1/2 games behind first-place Oklahoma City and now trail by 9 1/2.\n\n\r\n              Key moment\r\n              Back-to-back 3s by Thompson pulled the Mavericks within 64-53 with 44 seconds left in the half. But the Cavaliers closed with five straight points, LeVert getting a friendly bounce on a left-corner 3 with four seconds left, to lead 69-53 at halftime.\n\n\r\n              Key stat\r\n              The Cavaliers outscored the Mavericks 18-0 in first-half turnover points and matched a season low with eight overall, two in the first half.\n\n\r\n              Up next\r\n              The Cavaliers will host the Charlotte Hornets on Sunday night. The Mavericks visit the Memphis Grizzlies on Monday night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998317.367535
}