{
  "game_id": "0021901247",
  "espn_id": "401224722",
  "date": "Aug 02, 2020",
  "matchup": "SAC @ ORL",
  "headline": "Magic build big lead, stay on roll in 132-116 win over Kings",
  "body": "LAKE BUENA VISTA, Fla. --  The Orlando Magic got a big win and a big loss Sunday.\n\nNikola Vucevic had 23 points and 11 rebounds, Aaron Gordon scored 19 of his 22 points in the first half and the Magic continued a strong restart with a 132-116 victory over the Sacramento Kings.\n\nBut the Magic lost Jonathan Isaac again when he tore the ACL in his left knee, the same one he hurt Jan. 1 that kept him out until the restart. The third-year player was taken off the court in a wheelchair after crumpling to the floor in pain in the fourth quarter as the knee appeared to buckle on a drive.\n\n\"It looked bad, obviously,\" said coach Steve Clifford, who was hopeful it wasn't what it appeared to be.\n\nHours later, an MRI confirmed the worst.\n\nTerrence Ross scored 25 points as the Magic won a season-best fifth straight game going back to before the pandemic-forced shutdown in March. Orlando won the last three before the hiatus and beat Brooklyn, the team it is battling for the seventh seed in the Eastern Conference, to open the restart.\n\nDe'Aaron Fox scored 13 points after a career-high 39 in the restart opener for the Kings, who have lost both games in the bubble as they try to get in position for a shot at the final playoff spot in the West. Harry Giles III led Sacramento with a career-high 23 points.\n\n\"For us that's two games in a row that the other team kind of had their way at the rim,\" coach Luke Walton said. \"Just not physical enough in either game so far.\"\n\nMarkelle Fultz beat the buzzer in the first quarter by draining a three-quarter court shot that tied the franchise record for first-quarter points and gave Orlando a 44-26 lead. Fultz finished with 14 points.\n\nGordon scored seven of the first nine points for the Magic, who shot 63% in the first half while building a 24-point halftime lead. They led by as many as 36 points in the second half.\n\nOrlando shot 52% for the game and matched a season high with 18 3 pointers while shooting 47% from long range.\n\nTIP-INS\n\nKings: Sacramento fell behind 7-0 in just 75 seconds and went down by double digits for good with 3 minutes left in the first quarter. ... Four players scored 12 points apiece: Harrison Barnes, Richaun Holmes, Bogdan Bogdanovic and Buddy Hield.\n\nMagic: D.J. Augustin had a game-high eight assists and scored 10 points. ... Vucevic scored 12 points in the third quarter, when the Magic surged to their biggest lead.\n\nORLANDO'S DOWNER\n\nThe Magic had considered not letting Isaac play in the seeding games because the sixth overall pick from 2017 is considered such a big part of their future. He was in the game with four other reserves and the Magic leading by 28 when he went down.\n\n\"My whole heart goes out to him,\" Gordon said. \"He's such a great guy, such a great person. I hope it's just something that kind of shocked him. But it was sad, man. It brought tears to my eyes.\"\n\nIsaac made headlines Friday by being the first player to not kneel for the national anthem at Disney, saying he chose to stand because he did not believe the gesture of kneeling and wearing a Black Lives Matter T-shirt actually equated to helping Black lives.\n\nUP NEXT\n\nKings: Play Dallas on Tuesday.\n\nMagic: Play Indiana on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996378.416991
}