{
  "game_id": "0022201109",
  "espn_id": "401469264",
  "date": "Mar 25, 2023",
  "matchup": "MIL @ DEN",
  "headline": "Nuggets beat Bucks 129-106 in clash of conference leaders",
  "body": "DENVER -- — Nikola Jokic had 31 points and 11 assists, Jamal Murray finished with 26 points and nine assists, and the Denver Nuggets beat the Milwaukee Bucks 129-106 on Saturday night in a late-season showdown of the NBA’s conference leaders.\n\n\r\n              Michael Porter Jr. scored 19 points for West-leading Denver (50-24), which outscored East-leading Milwaukee 68-40 in the second half.\n\n\r\n              Giannis Antetokounmpo scored 31 points -- just seven in the second half -- and grabbed nine rebounds for the Bucks (53-20).\n\n\r\n              “It’s better to win games, but our goal is to do something in a playoffs,” Jokic said.\n\n\r\n              The battle of the top teams in each conference -- and two strong MVP candidates -- was more competitive than the teams’ first meeting, won by the Bucks 107-99. Then, the Nuggets held out four starters -- Jokic, Murray, Porter and Kentavious Caldwell-Pope -- in the game in Milwaukee on Jan. 25. Denver had played the night before in New Orleans and opted to rest its stars.\n\n\r\n              The circumstances were reversed, with the Bucks having played in Utah on Friday night.\n\n\r\n              “We still play, still got to be better, there’s no excuses about that,” Khris Middleton said. “But I’m sure for a lot of fans, a lot of people out there, they’d love to see healthy teams, or not coming off back to backs.”\n\n\r\n              Antetokounmpo scored 24 points on 11-for-14 shooting in the first half, with all but one of those field goals coming at the rim. Murray (20 points) and Jokic (17 points) kept Denver within three at the break, and then the Nuggets outscored Milwaukee 34-19 in the third quarter to take a 97-85 lead.\n\n\r\n              Jeff Green dunked on Antetokounmpo to open the fourth as the Nuggets’ lead swelled to 15 points. Grayson Allen hit a 3-pointer to cut it to 103-91 with 9:54 left, but Milwaukee went scoreless for 4:10 while Denver built a 111-91 lead.\n\n\r\n              “It was an amazing dunk,” Jokic said of Green’s dunk. “I didn’t think he was going to do it. He almost fell down, so it was a really nice dunk.”\n\n\r\n              Antetokounmpo went to the bench with 5:54 left and didn’t return.\n\n\r\n              GETTING TECHNICAL\n\n\r\n              The Bucks lost some composure in the third quarter. Bobby Portis Jr. was called for a take foul on Jokic and, immediately after, a technical. Denver hit both free throws and Bruce Brown hit a 3-pointer for a 84-76 lead. Minutes later, Brook Lopez got a technical while sitting on the bench.\n\n\r\n              Antetokounmpo picked up Milwaukee’s third technical with 6:41 left in the game.\n\n\r\n              “It was a night where we were grumpy, and it happens,” coach Mike Budenholzer said.\n\n\r\n              TAKE ONE FOR THE TEAM\n\n\r\n              Denver coach Michael Malone got a technical late in the first quarter, and it was to prevent Jokic from getting one. Jokic was frustrated by the physical play, so during a timeout Malone told him he would get the technical.\n\n\r\n              “I can get kicked out, he can’t. I understand the pecking order here,” Malone said.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Middleton finished with 13 points and six rebounds after missing Friday’s game for injury management. ... It was Milwaukee’s fourth loss since Jan. 21.\n\n\r\n              Nuggets: Green was down on the court for several minutes after fouling Antetokounmpo with 11:14 left, but returned to the game.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Detroit on Monday night.\n\n\r\n              Nuggets: Host Philadelphia on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994553.079506
}