{
  "game_id": "0021900745",
  "espn_id": "401161387",
  "date": "Feb 03, 2020",
  "matchup": "ATL vs. BOS",
  "headline": "Tatum leads Celtics past Hawks 123-115 for 4th straight win",
  "body": "ATLANTA --  The Celtics turned up the defensive pressure on Trae Young, and turned to Grant Williams for a key basket at the end.\n\nIt wasn't a masterpiece by any stretch, but it was good enough for Boston's fourth straight win.\n\nJayson Tatum scored 28 points and the Celtics held on for a 123-115 victory over the Atlanta Hawks on Monday night.\n\n\"It was ugly,\" Jaylen Brown said, \"but we figured it out.\"\n\nTrailing 117-113, the Hawks had a shot when a video review overturned a call along the baseline that initially gave Boston the ball.\n\nBut Brown came up with a steal off Young's deflected pass at the other end, giving the Celtics a chance to finish it off. They milked the shot clock before Williams took off down the lane, speeding past the Hawks defense to bank one in with 37.6 seconds remaining.\n\nBoston coach Brad Stevens knew his team got away with one.\n\n\"I don't think throwing the ball all over the gym is a recipe for a win,\" he said, referring to 15 turnovers and some sloppy play down the stretch.\n\nWith ailing Kemba Walker watching from the bench, Gordon Hayward scored 24 points and Brown chipped in with 21 for the Celtics.\n\nYoung led Atlanta with 34 points, his 25th game with at least 30 points this season. Kevin Huerter had 23 points, including five 3-pointers, and John Collins notched his fourth straight double-double with 22 points and 11 rebounds.\n\nPlagued by injuries, the Hawks were forced to go with a small lineup that didn't have a whole lot of chemistry. That was evident by the struggles of their All-Star point guard, who matched his career high with nine turnovers.\n\n\"There were a lot of times when I was jumping in the air and passing, expecting someone to be in the corner, and it just wasn't there,\" Young said. \"I turned it over way too many times tonight. That's a big part of why we lost.\"\n\nWith Young putting up 23 points by halftime, the Hawks held a 62-60 lead at the break.\n\nThe Celtics scored the first seven points of the third quarter and steadily pushed their edge to as high as 13 points. They were up 95-84 heading to the final period.\n\nThe Hawks got as close as two, and were still hanging around after back-to-back 3s by Huerter. But Boston never ceded the lead.\n\nTIP-INS\n\nCeltics: C Enes Kanter returned after missing five games with a right hip contusion. He had eight points and nine rebounds in just under 16 minutes. ... Walker missed his second straight game with a sore left knee. ... Williams had 13 points. ... Hayward started the game as the point guard. \"It really didn't feel that much different,\" he said. \"I had to remind myself to come back and get the ball.\" ... Tatum finished 10 of 20 from the field, including 5 of 9 from beyond the arc.\n\nHawks: G Evan Turner played for the first time since Dec. 28. He has been recuperating from both Achilles and hamstring injuries over the past month. Turner didn't do much, tallying two points and two assists in 21 minutes. ... Atlanta started the game with two points guards, as Jeff Teague joined Young in the makeshift lineup. Teague had 18 points. ... Only 10 players suited up for Atlanta. ... The injured list included rookie F Cam Reddish, who went into the league's concussion protocol after taking a blow to the head in Saturday's loss at Dallas.\n\nTHEIS GOES DOWN\n\nBoston forward Daniel Theis went down in the third quarter, landing awkwardly on his right foot after leaping high attempting to block a shot by Atlanta's Treveon Graham.\n\nTheis collapsed to the court writhing in pain, and had to be helped to the locker room. After also being checked for a possible concussion, he was cleared to return to the game.\n\nBut Stevens decided not to take any chances, so Theis finished with nine points in 19 minutes.\n\nGOING IT ALONE\n\nCollins looked like a one-man show on the inside, often going it alone with the Hawks missing injured big men Alex Len and Bruno Fernando.\n\nThe Celtics finished with a 44-32 edge on the boards, including 11 offensive rebounds  that contributed greatly to 19 second-chance points.\n\n\"The bumps and bruises of the seasons were wearing on us tonight,\" Collins said. \"That's what happens when you play small. You give up some offensive rebounds.\"\n\nUP NEXT\n\nCeltics: Return home to face Orlando on Wednesday night.\n\nHawks: Travel to Minnesota on Wednesday to face the Timberwolves.\n\n--\n\nFollow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 and find his work at https://apnews.com\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996672.376553
}