{
  "game_id": "0022000585",
  "espn_id": "401307368",
  "date": "Mar 12, 2021",
  "matchup": "IND @ LAL",
  "headline": "Kuzma leads Lakers' late surge for 105-100 win over Pacers",
  "body": "LOS ANGELES -- — Kyle Kuzma scored 15 of his 24 points in the fourth quarter, LeBron James added 18 points and 10 assists, and the Los Angeles Lakers rallied late for a 105-100 victory over the Indiana Pacers on Friday night.\n\n\r\n                    Montrezl Harrell had 17 points and Kuzma added 13 rebounds as the defending NBA champions returned from the All-Star break with just their fourth win in 11 games.\n\n\r\n                    Los Angeles trailed by 12 points early in the fourth quarter before Kuzma led a strong rally to keep the Pacers winless against the Lakers at Staples Center since November 2015. Kuzma went 5 for 8 with two 3-pointers and four rebounds in the fourth.\n\n\r\n                    “It’s all about growth, and the game has just slowed down every year for him,” James said. \"He knows his role with this team and he does it to a high level, and tonight was another example of that.”\n\n\r\n                    Malcolm Brogdon scored 23 of his 29 points in the first half for the Pacers, who opened a three-game road trip with their 11th loss in 16 games. Domantas Sabonis added 20 points, 14 rebounds and eight assists, but Indiana wilted down the stretch.\n\n\r\n                    “I thought there was a four-minute stretch there where we let it get away from us,” Pacers coach Nate Bjorkgren said.\n\n\r\n                    The Pacers still had the ball at midcourt down 103-100 with 9.9 seconds left, but Kentavious Caldwell-Pope stole Brogdon's inbounds pass and hit two free throws to ice it.\n\n\r\n                    “I saw the opening to get the steal, so I tried to get in front of him,” Caldwell-Pope said. “We needed stops. They kept going on their runs, and we needed more energy. Rebounding the ball and getting out in transition is what we’re best at. I think we did it over the last few minutes.”\n\n\r\n                    “They knew the play,” Brogdon said. “They switched to deny it. I just threw a bad pass.”\n\n\r\n                    Brogdon lit up the Lakers for 18 points in the first quarter. Indiana had an 86-74 lead early in the fourth, but the Lakers made a 22-4 run and seized the lead on Kuzma's back-to-back 3-pointers.\n\n\r\n                    Los Angeles won without starters Anthony Davis and Marc Gasol. Davis missed his 10th consecutive game and will be out for at least two more weeks with leg injuries, while Marc Gasol is still out under the NBA’s health and safety protocols.\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Indiana went 7 for 20 with seven turnovers in the fourth quarter. ... LA-area native Justin Holiday went 1 for 10 on 3-pointers, scoring five points.\n\n\r\n                    Lakers: Alex Caruso was sidelined with a bruise on his head during the first half. ... Damian Jones scored seven points in his second start for Los Angeles. The big man signed a second 10-day contract Thursday.\n\n\r\n                    LEVERT'S RETURN\n\n\r\n                    After the game, Caris LeVert said he will make his Pacers debut Saturday at Phoenix.\n\n\r\n                    LeVert underwent surgery in late January to remove a cancerous growth from his kidney nine days after he was traded to Indiana from Brooklyn in the James Harden/Victor Oladipo trade. The Pacers have been cautious with LeVert's recovery, but he is eager to help his struggling new team.\n\n\r\n                    “It’s been a while, and I miss the game for sure,” LeVert said. “I always saw the light at the end of the tunnel. I knew the pain I was feeling after the surgery, that wouldn’t last forever. I knew this day would come where I felt up to playing again. I’ve got a great support system with my family and my teammates. ... It’s just going to be a joy to play the game tomorrow. I’m sure it’ll be a great night for all of us.”\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: At Suns on Saturday.\n\n\r\n                    Lakers: At Warriors on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997145.211859
}