{
  "game_id": "0021600754",
  "espn_id": "400900159",
  "date": "Feb 03, 2017",
  "matchup": "DAL @ POR",
  "headline": "Ferrell leads Mavericks to 108-104 win over Trail Blazers",
  "body": "PORTLAND, Ore. --  Rarely does a game between two losing teams feel so good for one player. But that's the kind of night it was for Yogi Ferrell.\n\nThe undrafted point guard playing on a 10-day contract scored 32 points to help the Dallas Mavericks beat the Portland Trail Blazers 108-104 on Friday.\n\n\"We've got a special group, a special group of guys and they really welcomed me into the team. I was thankful for that,\" Ferrell said. \"That doesn't happen often. It happened very quickly, so I'm just out there having a lot of fun and living the dream.\"\n\nFerrell, who signed a 10-day deal with the Mavericks last weekend, had 22 points by halftime -- shattering his previous career high. He has scored 71 points in four games this week, all wins for Dallas against the Spurs, Cavaliers, 76ers and Trail Blazers.\n\nDallas built its lead up to 22 before Portland rallied to within one. Ferrell answered with a 3-pointer with 19 seconds left to give the Mavericks a cushion and a win on national television.\n\n\"He's an opportunistic guy and it's pretty clear that he's out to prove a point,\" Dallas coach Rick Carlisle said.\n\nThe moment for Ferrell, who was in the NBA Development League six days before, even tugged at the heartstrings of his opponents.\n\nBlazers coach Terry Stotts paid his dues in the old Continental Basketball Association and can appreciate a story like Ferrell's, even given the circumstances.\n\n\"Anybody can come in and have a game, but he's had an impact on four games,\" Stotts said. \"Being a minor league guy, I'm happy for him. You get an opportunity to get a 10-day, you get an opportunity to make the most of it. As disappointing as this loss is, I root for those kind of guys.\"\n\nFerrell became just the third undrafted rookie in NBA history to have a 30-point game within his first 15 games, joining Connie Hawkins (twice) and Anthony Morrow, according to the Elias Sports Bureau.\n\nFormer Blazers guard Wesley Matthews added 27 points for the Mavericks.\n\n\"Wes is so into it when we come here, it's just hard to keep his emotions under control,\" Carlisle said. \"He's just so aggressive and exerting so much energy.\"\n\nMatthews, who like Ferrell went undrafted out of college, likes what he sees from the rookie.\n\n\"His demeanor is not that of a guy in his situation,\" Matthews said. \"He plays extremely confident, he plays poised and he plays like he loves the game. He's got some toughness to him.\"\n\nFerrell, a 28 percent 3-point shooter coming in, made Portland pay for going under ball screens by hitting nine 3-pointers.\n\nSeth Curry scored nine points in the fourth quarter to help the Mavericks seal the win.\n\n\"The guy put on a 1-on-1 clinic the last four minutes of the game,\" Carlisle said.\n\nCJ McCollum scored 28 points, including buzzer-beaters at the end of the second and third quarters, to lead the Trail Blazers. Evan Turner added 24.\n\nAfter a 4-17 start to the season, the Mavericks have won four straight and eight of 11 to move within 2 1/2 games of Denver for the final playoff spot in the Western Conference. The Blazers are one game behind the Nuggets.\n\n\"It's great that we've put ourselves in a position for these games to be meaningful,\" Carlisle said.\n\nTIP-INS\n\nMavericks: Carlisle is the president of the NBA Coaches Association. Over the past few weeks, NBA coaches have worn bow ties to honor the passing of Executive Director Michael Goldberg. Coaches will wear pins to salute Goldberg for the rest of the season. \"It will be a reminder of the yearlong tribute to a great man. A great advocate for coaches in the NBA,\" Carlisle said. \"A guy who was a key part of history, like the NBA-ABA merger in 1976. He's done so many important, groundbreaking things for coaches of the last 37 years that will be felt for decades.\"\n\nTrail Blazers: Portland is 4-3 since moving Turner and Noah Vonleh into the starting lineup. \"The starting lineup has been very effective, especially defensively. That's a nice byproduct of that,\" Stotts said. ... Stotts started Al-Farouq Aminu in Vonleh's place to begin the second half. ... Portland's Ed Davis returned to the lineup for the first time since missing six games with a left wrist injury. He played 17 minutes.\n\nUP NEXT\n\nMavericks: At the Denver Nuggets on Monday night.\n\nTrail Blazers: At the Oklahoma City Thunder on Sunday afternoon.",
  "source": "espn_api",
  "crawled_at": 1764996122.573696
}