{
  "game_id": "0022000493",
  "espn_id": "401267653",
  "date": "Feb 24, 2021",
  "matchup": "CHI vs. MIN",
  "headline": "LaVine scores 35 as Bulls beat Timberwolves 133-126 in OT",
  "body": "CHICAGO -- — Zach LaVine is an All-Star for the first time, and he wants more. Same for the rest of the surging Chicago Bulls.\n\n\r\n                    LaVine scored 35 points against his original NBA team, helping the Bulls beat the Minnesota Timberwolves 133-126 in overtime Wednesday night.\n\n\r\n                    Chicago shot 59% from the field and had seven players score in double figures. Coby White had 20 points, and Wendell Carter Jr. finished with 17 points and 10 rebounds.\n\n\r\n                    The Bulls (15-16) won for the fifth time in six games, but felt they should have played better against the lowly Timberwolves (7-26). Looking for the franchise's first playoff appearance since 2017, just winning isn't enough anymore.\n\n\r\n                    “These guys have worked really, really hard, but I don't think that we played to the level of standard that we want to play to,” coach Billy Donovan said.\n\n\r\n                    LaVine, named an All-Star reserve Tuesday night, made 14 of 21 shots in his 16th game this season with at least 30 points. The dynamic guard was selected by Minnesota in the first round of the 2014 draft and spent three seasons with the Timberwolves before he was traded to the Bulls in June 2017.\n\n\r\n                    “You always want to go and play good against the team that traded you, but also have love for them as well,” LaVine said.\n\n\r\n                    Minnesota lost for the 10th time in 11 games despite a gutsy second-half rally while playing for the second straight night. New coach Chris Finch is winless in two games since taking over after Ryan Saunders was fired Sunday night. \n\n\r\n                    Malik Beasley scored 25 points for the Timberwolves, and Karl-Anthony Towns had 24 points, eight rebounds and five assists. Anthony Edwards added 21 points, and Jarred Vanderbilt matched his career high with 16.\n\n\r\n                    Towns fouled out on a questionable call with 12.3 seconds left in regulation, and the Timberwolves missed his presence in overtime.\n\n\r\n                    “We're not playing the best defensively right now, and we've got to find ourselves,” Towns said.\n\n\r\n                    Minnesota was down 119-116 when veteran guard Ricky Rubio was fouled by White on a 3-point try with 4.9 seconds remaining. Rubio calmly made all three foul shots and LaVine missed a 3 as time expired, sending the game to overtime.\n\n\r\n                    “I felt like I fouled him well before the shot,” White said. “He didn't even know I was fouling him. I fouled him, they called it five seconds later after he threw the ball.”\n\n\r\n                    Chicago responded with a 7-0 run. LaVine capped the spurt with a 3-pointer, making it 126-119 with 3:27 left.\n\n\r\n                    White made two free throws with 15.1 seconds remaining to help the Bulls hold on.\n\n\r\n                    Minnesota trailed by 14 early in the second half, but Towns had 15 points in the third quarter and Josh Okogie's layup trimmed Chicago's lead to 98-97 with 8:59 left in the fourth.\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Jarrett Culver (left ankle sprain) missed his 17th straight game. The No. 6 overall pick in the 2019 draft was listed as probable. ... Rubio finished with nine points and 10 assists.\n\n\r\n                    Bulls: F Lauri Markkanen (sprained right shoulder) isn't expected to return until after the All-Star break. He got hurt during a 123-119 loss at Orlando on Feb. 5. “He makes progress, but he has not done anything contact-wise,” Donovan said. “He’s done nothing that at this point in time would show us that he’s going to be back within the next week.” ... White and LaVine each committed seven turnovers.\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: At Washington on Saturday night. The Timberwolves lost 130-109 to the Wizards on Jan. 1.\n\n\r\n                    Bulls: Host the Phoenix Suns on Friday night.\n\n\r\n                    ------\n\n\r\n                    Jay Cohen can be reached at https://twitter.com/jcohenap\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997593.2306812
}