{
  "game_id": "0021600282",
  "espn_id": "400899443",
  "date": "Dec 02, 2016",
  "matchup": "ORL @ PHI",
  "headline": "Gordon powers Magic past slumping Sixers, 104-88",
  "body": "PHILADELPHIA --  Orlando Magic coach Frank Vogel had a simple trick to help his team get over a brutal loss in Memphis the previous night.\n\n\"I let them sleep in,\" Vogel said.\n\nAaron Gordon scored a season-high 20 points, Nikola Vucevic had 12 points, 11 rebounds and five assists and the Magic awoke from its slumber to cruise by the Philadelphia 76ers 105-88 in a matchup of slumping Eastern Conference teams Friday night.\n\nSerge Ibaka, Evan Fournier and Jeff Green all added 16 points for the Magic (8-12), who had lost five of six coming in, including a one-point loss to the Grizzlies on Thursday in which they blew a 14-point fourth-quarter lead.\n\n\"I thought we played well last night and we just didn't close the game out,\" Vogel said. \"We're continuing to show we have one of the top defenses in the league. We're going to be a great defensive team and we're going to score enough to win.\"\n\nBismack Biyombo had 13 rebounds for the Grizzlies, who shot 50 percent from 3-point range and 47.4 percent from the field.\n\nThe Sixers (4-15) lost their fifth straight despite 25 points and 10 rebounds from rookie Joel Embiid. It was his fifth double-double of the season.\n\nJahlil Okafor, who saw extended action with Embiid for the first time this season, also had a double-double with 16 points and 13 rebounds.\n\nNobody else scored in double figures for the Sixers, who shot 37.9 percent from the field. They missed 20 of their 26 shot attempts in the first quarter and allowed the Magic to go on an early 16-0 run to fall behind for good.\n\n\"Sometimes you read so much into back-to-backs,\" Sixers coach Brett Brown said. \"You assume people are tired or depressed because they lost at the buzzer. I give them credit. They came in and played with great energy. I don't know how to explain that.\"\n\nThe game was the first for the rested Sixers in four days after Wednesday's scheduled matchup against the Sacramento Kings was postponed because of moisture on the Wells Fargo Center court.\n\nTIP-INS\n\nMagic: Orlando was back in the same building where it overcame an 18-point deficit in a 103-101 win over the Sixers a little more than a month ago. The Magic have won four straight vs. Philly. ... The Magic have two games left of a five-game trip.\n\n76ers: Robert Covington left in the fourth quarter with a left knee sprain after logging nine points and six rebounds. ... PG Jerryd Bayless missed his third straight game with left wrist soreness after previously sitting out the first 13 games.\n\nTHE EMBIID-OKAFOR EXPERIMENT\n\nEmbiid and Okafor looked sharp when paired together as the crowd roared in delight watching the two cornerstones of the franchise's rebuilding effort. In the second quarter, Embiid hit a 3-pointer, fed Okafor for a basket and then hit a jumper to pull the Sixers within 23-21.\n\nDuring their second stint together in the fourth quarter, the two centers produced 12 of the team's 19 points while combining to shoot 5 for 5 from the field in just over 7 minutes.\n\n\"I thought we had our moments,\" said Embiid, who had his minutes restriction increased from 24 to 28 two days after being named the NBA's Eastern Conference Rookie of the Month for October/November. \"We made shots. Obviously we need to play more together.\"\n\nMEEKS' BIG RETURN\n\nMagic guard Jodie Meeks made his season debut after a foot injury held him out for the first 19 games. He finished with 10 points and three steals in 17 minutes, while shooting 2 for 3 from 3-point range.\n\nVogel didn't think it was a coincidence that the sharpshooter's return coincided with Orlando's best shooting night of the season.\n\n\"It's contagious, I guess,\" Vogel said. \"It was good to see him back out there. He was a little rusty in certain areas but that's to be expected. But he looked a lot less rusty than I thought he would.\"\n\nCLUTCH SHOOTING (AND PASSING)\n\nThe Magic put the game away in the third quarter thanks to consecutive 3s from D.J. Augustin followed by one from Gordon -- shots Vogel called \"pivotal.\"\n\nGordon, who shot 9 for 14 from the field and 2 for 4 from 3-point range, credited the team's passing for all of the baskets.\n\n\"I think our passing was very good tonight,\" he said. \"We were on time and on target.\"\n\nUP NEXT\n\nMagic: At Detroit on Sunday night.\n\n76ers: Host Boston on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995872.183527
}