{
  "game_id": "0021500572",
  "espn_id": "400828459",
  "date": "Jan 12, 2016",
  "matchup": "HOU @ MEM",
  "headline": "Harden scores 25 to lead Rockets past Grizzlies, 107-91",
  "body": "MEMPHIS, Tenn. -- Once the Memphis Grizzlies caught Houston in the fourth quarter, the Rockets took off on one more major push.\nFueled by James Harden and Terrence Jones, the Rockets broke open a tie game with a 16-2 rally, eventually built an 18-point and beat the Grizzlies 107-91 on Tuesday night.\n\"Our guys didn't give in,\" Rockets interim coach J.B. Bickerstaff said, later adding: \"(Our) guys didn't lose their composure. They kept competing and kept playing.\"\n\nHarden led the Rockets with 25 points, while Jones had 10 of his 20 points in the fourth.\nDwight Howard finished with 17 points, converting all five of his free throws, four of them in the final 3 minutes as Memphis intentionally fouled the Houston center. Howard also had 14 rebounds as the Rockets won their fourth straight.\nThe Rockets limited Memphis to only eight points after the teams were deadlocked at 83-all.\nJones made 4 of 6 shots in the second half, including a pair of 3-pointers in the fourth.\n\"If he's open, he's going to shoot it,\" Bickerstaff said.\n\"It's because of repetition and confidence,\" Jones said. \"My teammates believe in me to shoot the open 3, and I just want to go out there and make us better.\"\nMarcus Thornton had 16 points, and Trevor Ariza finished with 10 for the Rockets.\nMarc Gasol led Memphis with 20 points, while Tony Allen added 17. Courtney Lee finished with 16.\nThe Rockets connected on 18 of 35 from outside the arc compared to only 7 of 18 for Memphis. Houston dominated the boards 42-31, including 18 from the offensive glass. That led to a 28-12 advantage in second-chance points.\n\"It seemed like every time they got an offensive rebound, it was a 3-pointer and not just a put-back,\" Memphis coach Dave Joerger said.\nMemphis, which trailed 51-44 at the break, opened the second half with a 13-2 rally to erase the Rockets lead.\nThe Grizzlies couldn't maintain the advantage as the Rockets controlled the boards and capitalized on Memphis turnovers, six of them in the fourth quarter.\nVince Carter tied the game at 83 on a three-point play with 7:35 remaining. But the Memphis offense stalled as Jones and Harden carried the Rockets.\nAllen, who guarded Harden most of the night, said Houston made hustle plays and others provided strong supporting efforts for the Houston offense.\n\"Guys like Terrence Jones, Thornton, those guys definitely played a big role in those guys getting the win,\" Allen said. \".We have to be able to match their intensity, and I thought we did a bad job of that down the stretch.\"\nTIP-INS\nRockets: Howard recorded his 17th double-double of the season. . Houston had lost the first two games in the season series. . Rockets G Ty Lawson did not play, serving the last game of a three-game suspension by the league. . Howard took a total of only 13 shots in the first two games between the teams this season. He took 10 Tuesday night. . Houston's 18 3-pointers matched the most in a game by a Grizzlies opponent this season.\nGrizzlies: Memphis played without starting G Mike Conley, who missed his fourth straight game with sore left Achilles, and F Matt Barnes, who sat out his first with a right thumb injury. . Randolph moved past Larry Bird (8,974) into 50th place on the career rebounding list in the third quarter. . Allen's 17 points were a season high.\nJEFF GREEN ABSENCE\nMemphis forward Jeff Green, who started the game, did not play in the second half. Joerger said he was not injured. \"That's my decision for various reasons, but I'm not going to go into it,\" Joerger said of Green not playing. \"It wasn't a disciplinary thing at all.\"\nUP NEXT\nRockets: Host Minnesota on Wednesday.\nGrizzlies: Host Detroit on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994635.14329
}