{
  "game_id": "0021500735",
  "espn_id": "400828622",
  "date": "Feb 03, 2016",
  "matchup": "CHA vs. CLE",
  "headline": "Lin scores 24 as Hornets rally to beat Cavaliers 106-97",
  "body": "CHARLOTTE, N.C. -- Even without their leading scorer, the Charlotte Hornets finally found a way to beat LeBron James.\nJeremy Lin scored 24 points and the Hornets rallied in the second half for a 106-97 victory over James and the Eastern Conference-leading Cleveland Cavaliers on Wednesday night.\nMichael Kidd-Gilchrist had 11 points and 13 rebounds, and three other players finished in double figures for the Hornets, who played without ailing point guard Kemba Walker.\n\nWith some tough second-half defense, Charlotte overcame a nine-point halftime deficit to snap a four-game losing streak against the Cavaliers.\n\"Kemba, honestly, is irreplaceable. We all know that,\" said Lin, who also had eight assists. \"(But) we feel like if everyone can chip in a little bit, we can try to make up for his absence.\"\nThe Hornets ended James' personal 21-game winning streak against the franchise. The team's last victory against him before Wednesday came on Feb. 19, 2010, during James' first stint with the Cavaliers.\n\"Tonight, we were just trying to stay aggressive and take the fight to them,\" Lin said.\nMarvin Williams added 16 points, Frank Kaminski had 15 off the bench and Nicholas Batum scored 10 for Charlotte, which trailed 58-49 at halftime.\nBut the Hornets outscored Cleveland 33-17 in the third quarter to take an 82-75 lead. They went on to lead by as many as 15 late in the fourth.\n\"We fought hard, and the bench play in both halves was really good,\" Charlotte coach Steve Clifford said. \"We were much more balanced than we've been.\n\"We've won some games where we were good on offense and some where we were really good on defense, but tonight we were good on both.\"\nKyrie Irving had 26 points and James added 23 for the Cavaliers, who had won five straight. J.R. Smith scored 14 and Kevin Love had 12 points and 12 rebounds.\nIrving gave the Cavaliers their final lead, hitting a layup with 6:36 left in the third quarter that put Cleveland up 69-67. Lin followed with a three-point play 28 seconds later to put the Hornets ahead to stay.\n\"That's the third game in a row where we have struggled to come out in the third quarter,\" Cavaliers coach Tyronn Lue said. \"We have to do something to adjust that situation.\"\nCharlotte's biggest lead came with less than 5 minutes remaining, when Kidd-Gilchrist knocked down a jumper to put the Hornets up 98-83. The Cavaliers got no closer than six the rest of the way.\n\"We're (terrible) in the third quarter right now,\" James said. \"We need to figure it out. I don't know what it is. I know Coach and the coaching staff are trying to pinpoint what the case may be.\n\"We're doing a good job of playing great basketball in the first half, but our third quarters are pretty awful right now. We've got to figure that out.\"\nTIP-INS\nCavaliers: Cleveland is 5-2 since Lue replaced David Blatt as head coach on Jan. 22. . Cleveland had zero turnovers in the first half, but turned the ball over eight times in the second half. ... G Matthew Dellavedova was inactive with a sore left hamstring.\nHornets: Charlotte outrebounded Cleveland 49-28, with an 11-3 advantage on the offensive boards. . The Hornets outscored the Cavaliers in three offensive categories: points in the paint (44-34), second-chance points (13-5) and fast-break points (19-12).\nENDING THE KING'S STREAK\nJames is 41-6 against Charlotte, covering the time he's spent with Cleveland and the Miami Heat.\nHORNETS GETTING HEALTHY\nWalker sat out with a sore left knee, but Charlotte had three other players return to the lineup after missing playing time over the past week.\nBatum had missed four of the past six games with a sprained right toe, C Cody Zeller the past six games with a strained right shoulder, and G Jeremy Lamb had missed five straight games with a strained right toe.\nThe only other key Charlotte player still out of the lineup is C Al Jefferson, who has been sidelined since Dec. 31 while recovering from surgery on his right knee. But he was cleared to begin non-contact and conditioning drills last week.\nUP NEXT\nCavaliers: At the Celtics on Friday night.\nHornets: Host the Heat on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994377.032317
}