{
  "game_id": "401810066",
  "espn_id": "401810066",
  "date": "Nov 11, 2025",
  "matchup": "UTAH vs IND",
  "headline": "Jazz score season-high 152 points in dominant win over Pacers",
  "body": "SALT LAKE CITY -- — Lauri Markkanen scored 35 points, rookie Ace Bailey added 20 points and the Utah Jazz scored the most points in an NBA game this season with a 152-128 win over the reeling Indiana Pacers on Wednesday night.\n\n\r\n              Bailey, the No. 5 pick in this summer's draft, started the season slowly as he recovered from illness but had his full repertoire of dunks, midrange jumpers and 3-pointers on display in his second start.\n\n\r\n              Svi Mykhailiuk had 20 points for the Jazz.\n\n\r\n              The injury-ravaged Pacers, last season's Eastern Conference champions, fell to 1-10 and matched the 1988-89 team for the worst start in franchise history. Pascal Siakam, who had 27 points, and Aaron Nesmith, who scored 17, returned after missing Indiana’s last game.\n\n\r\n              Indiana’s T.J. McConnell played his first game of the season and scored 12 points but was limited to 11 minutes as he recovers from a hamstring injury. \n\n\r\n              Indiana has the worst offensive rating in the league and came into the game as the only team shooting under 40% from the field for the season. The Pacers actually shot a season-best 46.5% but allowed the Jazz to shoot 55.4%.\n\n\r\n              The Pacers scored the first 10 points of the game but allowed the Jazz to score 38 points in the first quarter and take the lead that they wouldn’t relinquish.\n\n\r\n              Without an interior defensive presence, the Pacers allowed the Jazz to continually drive the lane and pass to open shooters. Isaiah Collier had 11 of Utah's 38 assists.\n\n\r\n              Indiana coach Rick Carlisle used every one of his timeouts in futile attempts to stop Utah's runs.\n\n\r\n              Though the Jazz were playing a back-to-back, they consistently beat the Pacers to loose balls and outrebounded the visitors 45-35.\n\n\r\n              Up Next\r\n              \r\n              Pacers: Visit Suns on Wednesday night.\n\n\r\n              Jazz: Host Hawks on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042606.2200398
}