{
  "game_id": "0021600157",
  "espn_id": "400899607",
  "date": "Nov 15, 2016",
  "matchup": "LAL vs. BKN",
  "headline": "Russell, Randle push surging Lakers past Nets, 125-118",
  "body": "LOS ANGELES --  Coach Luke Walton claimed his Los Angeles Lakers never really got into an offensive flow, even if the 125 points they dropped on the Brooklyn Nets suggested otherwise.\n\nImagine what might happen if Walton's surprising young squad actually finds its groove.\n\nD'Angelo Russell scored 32 points and Julius Randle added 17 points, 14 rebounds and 10 assists for his second career triple-double in Los Angeles' 125-118 victory Tuesday night.\n\nTimofey Mozgov had 20 points and six rebounds for the Lakers, who maintained a steady lead down the stretch of their fourth win in five games at Staples Center this season. With six wins in eight games overall, the Lakers (7-5) are two games above .500 for just the second time since April 2013.\n\n\"We all love to play this game together, even on nights when it isn't all clicking,\" said forward Tarik Black, who had 12 points and nine rebounds in just 13 minutes. \"We didn't care what people were saying about this team before the season started. It's about this locker room. We knew what we had.\"\n\nRussell hit seven 3-pointers and had eight rebounds for the Lakers, who didn't win seven games until New Year's Day last season, the worst in the 16-time NBA champion franchise's history.\n\nRussell had the highest-scoring individual performance by any player this season for the Lakers, whose 10-deep player rotations and balanced production have made them particularly tough to play. Russell lit up Brooklyn again after scoring a career-high 39 on the Nets last year, including eight 3-pointers that prompted his now-famous \"Ice in My Veins\" celebration of big shots.\n\nWhile Mozgov had his highest-scoring game for his new team, Randle added another balanced floor game in his first triple-double since March 25.\n\n\"He is continuing to get better and really realize what he is capable of doing,\" Walton said of Randle.\n\nBrook Lopez had 30 points and 10 rebounds for the Nets. Bojan Bogdanovic scored 29 points as Brooklyn rebounded solidly from a 32-point thrashing delivered by the Clippers in the same building one night earlier while Lopez sat out to rest.\n\n\"We bounced back from last night's tough loss,\" Nets coach Kenny Atkinson said. \"We just have to sustain it a little longer and do a little better on the defensive end.\"\n\nBut the Lakers shot 43 free throws to the Nets' 20, and Los Angeles solidly controlled the boards.\n\n\"Down the stretch, I don't want to comment too much on the calls, but we did foul too much and put them on the line,\" said Lopez, who hit four 3-pointers. \"That made it tough for us. We still had great looks. I want our guys to take those shots. They just didn't go down.\"\n\nBENCH BATTLE\n\nThe NBA's two most productive benches had big games. Led by Jordan Clarkson's 13 points, the Lakers' reserves outscored the Nets' bench 43-40. Yogi Ferrell led the Brooklyn bench with 11 points.\n\nBLOCK PARTY\n\nLopez became the Nets' franchise leader in blocked shots, passing George Johnson's 863 blocks with three against the Lakers. Johnson played for the franchise from 1977-80 and 1984-85. Lopez has blocked at least three shots in four consecutive games. He has accomplished that feat in five straight games just once, in November 2012.\n\nSTEEP SCHEDULE\n\nThe Lakers just returned from a road trip that showcased their young roster's potential and limitations. They won at Sacramento and New Orleans, but were then routed by Minnesota on Sunday after their third long-distance flight in four nights.\n\nThe Lakers will have to get used to learning on the court: Starting Friday, they will play 18 games in 30 days with five back-to-backs and no consecutive days off.\n\nTIP-INS\n\nNets: Former Lakers G Jeremy Lin missed his sixth straight game with a hamstring injury. ... Former Nets forward Andrei Kirilenko watched the game from courtside.\n\nLakers: Clarkson had a career-high five steals. ... LA has beaten Brooklyn three straight times. ... The Lakers scored 120 points for the fourth time this season after managing the feat just three times in the previous two seasons combined.\n\nUP NEXT\n\nNets: The road trip ends Friday at Oklahoma City.\n\nLakers: After their final back-to-back days off for an entire month, they host San Antonio on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995441.930617
}