{
  "game_id": "0021800493",
  "espn_id": "401071174",
  "date": "Dec 23, 2018",
  "matchup": "OKC vs. MIN",
  "headline": "Wiggins scores 30, leads Timberwolves past Thunder 114-112",
  "body": "OKLAHOMA CITY --  The struggling Minnesota Timberwolves pulled off perhaps their best win of the season Sunday night.\n\nAndrew Wiggins scored a season-high 30 points and hit the go-ahead layup with 14 seconds remaining to help the Timberwolves defeat the Oklahoma City Thunder 114-112.\n\nIt was Minnesota's first road win against a Western Conference team this season, and it came against a squad that entered the night tied for the best record in the West.\n\n\"It's very important,\" Wiggins said. \"We have been very solid at home this year, but on the road is what's killing us. Hopefully, this will keep us going and we can build on it and continue to rise and get better.\"\n\nWiggins made 11 of 20 shots and had six rebounds and five assists. Karl-Anthony Towns scored 18 points and Robert Covington added 13 for the Timberwolves, who shot 49 percent from the field and made 14 of 27 3-pointers against one of the league's top defensive teams.\n\n\"Wig (Wiggins) had a monster game for us, and then we had a number of guys step up and make real timely plays,\" Minnesota coach Tom Thibodeau said.\n\nOklahoma City's Paul George had 31 points and 11 rebounds, but he missed a 3-pointer at the buzzer that would have won it.\n\nRussell Westbrook had 23 points, 11 rebounds and 10 assists for the Thunder, his ninth of the season and the 113th of his career, who had won four straight, including a victory at Utah on Saturday night.\n\nWith the Thunder down 113-112 after Wiggins' late layup, Westbrook attacked the rim and found Alex Abrines for an open corner 3-pointer. Abrines missed, and Wiggins got the rebound.\n\n\"I shot three layups in a row,\" Westbrook said. \"They collapsed. Alex was wide open. I made the right play. Whoever it is I always make the right play no matter the results.\"\n\nWiggins made one of two free throws with 7.3 seconds left before George's final miss.\n\nThe Timberwolves led for most of the first half, but the Thunder rallied and took a 63-53 lead into the break. George, who sat out part of the first quarter with two fouls, scored 15 points in the second.\n\nMinnesota outscored Oklahoma City 33-17 in the third quarter to take an 86-80 advantage into the fourth. The Timberwolves pushed the lead up to 10 as Westbrook returned to action with about eight minutes remaining. George hit a jumper to tie it at 104 with just under three minutes left in regulation to set up the finish.\n\nTIP-INS\n\nTimberwolves: G Derrick Rose sat out with a sore left ankle. He left Friday's game against San Antonio in the second quarter and did not return. ... Wiggins scored 15 points in the first quarter. ... F Dario Saric was called for a technical foul in the second quarter.\n\nThunder: C Steven Adams fell to the ground after getting hit with an inadvertent knee to the groin area by Towns in the second quarter. The play was reviewed, but nothing was called on Towns. ... Starting G Terrance Ferguson left the game in the first half due to illness and did not return. ... Westbrook fouled out with 7.3 seconds to play. It was only his second time fouling out this season.\n\nM-V-P!\n\nGeorge got M-V-P chants during the game, something normally reserved for Westbrook. He had scored 43 points in each of his previous two games. He has scored at least 30 points in seven of his 11 games.\n\nHE SAID IT\n\nThibodeau on getting the win against the Thunder: \"They are a very tough team. Their record tells you how good they are. To win on the road you have to bring toughness. You have to get stops. We've still got a lot of work to do defensively, but I thought offensively, our guys were terrific.\"\n\nUP NEXT\n\nTimberwolves: At Chicago on Wednesday.\n\nThunder: At Houston on Tuesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994600.978265
}