{
  "game_id": "0022200489",
  "espn_id": "401468644",
  "date": "Dec 23, 2022",
  "matchup": "DEN vs. POR",
  "headline": "Murray, Jokic lead Nuggets to 120-107 win over Trail Blazers",
  "body": "DENVER -- — Jamal Murray returned to the lineup with 25 points and a season-high 12 assists, Nikola Jokic had 29 points and 11 assists, and the Denver Nuggets beat the Portland Trail Blazers 120-107 on Friday night.\n\n\r\n              Murray, who finished two rebounds shy of a triple-double, sat out Tuesday’s win over Memphis with soreness in his surgically repaired left knee, and the four-day break seemed to reinvigorate him. He scored 19 points in the second half as Denver erased a six-point deficit early in the third quarter to take a double-digit lead.\n\n\r\n              “The scoring, Jamal does that in his sleep. The rebounding, eight boards tonight, the playmaking, 12 assists, three turnovers — that’s outstanding,” Nuggets coach Michael Malone said. “When you score like that, you rebound, your playmaking, you defend, that makes you a hell of a player on a really good team.”\n\n\r\n              Murray, who logged a season-high 39 minutes, said he's still working his way back from tearing the ACL in his left knee on April 12, 2021.\n\n\r\n              “I’ve accepted it,” Murray said. “It’s you guys that haven’t accepted it because every time I have a bad game, ‘Oh, my goodness. Oh, he’s not shooting well.’ I know I’m going to have those days.”\n\n\r\n              Michael Porter Jr. scored 18 points in his first game after missing 13 with a left heel strain, an injury he said is unrelated to previous back injuries that have been an issue since college and early in his NBA career. He hit Denver’s first basket and scored five quick points.\n\n\r\n              Porter added five rebounds in 27 minutes to help the Nuggets stay atop the Western Conference standings.\n\n\r\n              “Michael got on the floor for a loose ball,” Malone said. “He was flying around out there, and so when you’re doing that and you are 6-foot-10 and you are long, you have an impact.”\n\n\r\n              Damian Lillard had 34 points and eight assists, Jerami Grant scored 20 and Jusuf Nurkic added 11 before fouling out for the Blazers, who ended their six-game road swing with three straight losses. Portland was 2-4 on the trip.\n\n\r\n              “I think going back 2-4 is a missed opportunity. I feel like we underachieved,” Lillard said. “We could’ve walked away from this with a much better ending.”\n\n\r\n              The Blazers rallied from 13 down in the second quarter to lead by seven early in the third. Murray scored 12 points in 6:20 of the third, including a pair of 3-pointers, to help Denver build a 93-80 lead heading into the fourth.\n\n\r\n              Jokic’s three-point play made it 102-87. A 3-pointer from Lillard got the Blazers within seven, but they couldn’t get any closer.\n\n\r\n              “There’s no excuse and I can’t really put my finger on it,” coach Chauncey Billups said. “We have these really good stretches in all these games, but it’s hard for us to sustain.”\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: F Justise Winslow (left ankle sprain) was inactive. He was injured in Wednesday’s loss at Oklahoma City. “We still don’t know how long, but he’s walking around on crutches right now,” Billups said. ... The team’s flight home was delayed out of Denver.\n\n\r\n              Nuggets: Murray’s career high in assists is 15, accomplished in December 2018 against Dallas. ... Kentavious Caldwell-Pope had 14 points and Aaron Gordon 13 to put all five starters in double figures.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host the Charlotte Hornets on Monday night.\n\n\r\n              Nuggets: Host the Phoenix Suns on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994716.065465
}