{
  "game_id": "0022300634",
  "espn_id": "401585262",
  "date": "Jan 26, 2024",
  "matchup": "ATL vs. DAL",
  "headline": "Doncic scores franchise-record 73 points, tied for 4th in NBA history, as Mavs edge Hawks 148-143",
  "body": "ATLANTA -- — Dallas coach Jason Kidd had no worries about Luke Doncic's scoring spree disturbing the Mavericks' game plan.\n\n\r\n              “He is the game plan,” Kidd said.\n\n\r\n              On a record-setting night, it was a winning plan.\n\n\r\n              Doncic scored a franchise-record 73 points, tied for the fourth-most in NBA history and surpassed only by Wilt Chamberlain and Kobe Bryant, to power the Mavericks to a 148-143 win over the Atlanta Hawks on Friday night.\n\n\r\n              Doncic blew past his personal best and team-record 60 points after scoring a team-record 41 points in the first half. \n\n\r\n              His record night came only four days after Philadelphia's Joel Embiid scored a franchise-record 70 points, then the most in the NBA this season, in the 76ers' 133-123 win over San Antonio on Monday night.\n\n\r\n              Through it all, Doncic kept looking for his teammates and contributing more than points. He grabbed a game-high 10 rebounds and led the Mavericks with seven assists.\n\n\r\n              “The three assists are what he's probably thinking about in the locker room to have a triple-double,” Kidd said.\n\n\r\n              Doncic insisted the win was the biggest reason to celebrate after he overcame constant extra attention from Atlanta's defense.\n\n\r\n              “You've got to continue to play and have trust in your teammates,” Doncic said.\n\n\r\n              A three-point play with 2:58 remaining gave Doncic 70 points. With Dallas leading 140-136, Doncic added another three-point play to cap his night.\n\n\r\n              Against the team that drafted him in 2018, Doncic joined Chamberlain and David Thompson among players who scored 73 points. Chamberlain, who owns the NBA record with 100 points, also had a 78-point game, while Bryant finished with 81 points.\n\n\r\n              “Those names are special,” Doncic said. “It's unbelievable.”\n\n\r\n              Doncic's teammates doused him with a water shower in the locker room, as cheers were heard from the hallway.\n\n\r\n              The Mavericks rode Doncic's big game to end their three-game losing streak while handing the Hawks their fourth straight loss. Doncic made 25 of 33 shots from the field, 8 of 13 3-pointers and 15 of 16 free throws. The field goals made set another personal record.\n\n\r\n              “He was hot. He was going,” said Trae Young, who led Atlanta with 30 points. “We were trying everything. We were trying to trap him.”\n\n\r\n              Josh Green scored 21 points for Dallas, but Doncic carried the offense.\n\n\r\n              “I've never seen anything like that,” Green said. \n\n\r\n              Young's 3-pointer with 5 seconds remaining trimmed the Dallas lead to 146-143. Jalen Johnson added 25 points and Bogdan Bogdanovic had 24 for Atlanta.\n\n\r\n              Doncic scored 23 points in the second quarter after opening with 18 in the first.\n\n\r\n              Doncic, who averages 33.6 points, nailed a 3-pointer with 4:48 remaining in the third quarter, giving him a season-high 51 points. He then took aim at his career high of 60 points, also the Dallas record, set against the New York Knicks on Dec. 27, 2022.\n\n\r\n              The Hawks had no answer for Doncic. Jalen Johnson opened as Atlanta's primary defender on the 6-foot-7 guard. Saddiq Bey, Dejounte Murray and others tried without success to slow Doncic's high-scoring pace.\n\n\r\n              Doncic's milestone game came in his original NBA home — at least for a few minutes.\n\n\r\n              Doncic was selected by the Hawks with the No. 3 overall pick in the 2018 NBA draft before having his draft rights traded to Dallas for Young with the No. 5 pick and a 2019 first-round pick used to select Cam Reddish.\n\n\r\n              Doncic scored 41 points in the first half to set a franchise record for points in any half. He made 17 of 22 shots from the field, including 6 of 9 3-pointers, in the half.\n\n\r\n              The Mavericks’ previous high mark for points in a half was 34 by Dirk Nowitzki in the second half against Utah on Nov. 3, 2009.\n\n\r\n              Mavericks guard Kyrie Irving missed his second consecutive game with a sprained right thumb. He was injured against Boston on Monday.\n\n\r\n              Dallas forward Derrick Jones Jr. sprained his left wrist with 30 seconds remaining in the first half and did not return. \n\n\r\n              Young cleared the concussion protocol after missing two games.\n\n\r\n              The rematch between the teams, originally scheduled for April 5 in Dallas, has been moved to April 4, the league announced Friday.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Sacramento Kings on Saturday. The Kings, who are one spot ahead of eighth-place Dallas in the Western Conference, won the first meeting between the teams, 129-113, on Nov. 19 at Dallas.\n\n\r\n              Hawks: Host Toronto on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996289.036067
}