{
  "game_id": "0021901272",
  "espn_id": "401224747",
  "date": "Aug 06, 2020",
  "matchup": "POR @ DEN",
  "headline": "Lillard's 11 3's lift rising Portland past Denver, 125-115",
  "body": "LAKE BUENA VISTA, Fla. --  Damian Lillard wasn't off to a great shooting start inside the NBA's so-called bubble.\n\nIf it was a slump, it seems to be over now.\n\nLillard tied his franchise record with 11 3-pointers and scored 45 points, and the Portland Trail Blazers moved closer to the No. 8 spot in the Western Conference by beating the Denver Nuggets 125-115 on Thursday night.\n\nLillard was 11 for 18 from 3-point range, plus had 12 assists for Portland. The Blazers (32-38) closed to within a half-game of Memphis in the race for eighth in the West, where a play-in series for the last playoff berth -- and the right to face the Los Angeles Lakers in the opening round -- now seems almost certain.\n\n\"We haven't been playing games, a lot of live action, and it just takes time,\" said Lillard, who was 10 for 30 on 3's in Portland's first three games at Walt Disney World. \"But it felt good. I knew eventually it would click.\"\n\nGary Trent Jr. had 27 off the bench and Jusuf Nurkic scored 22 for Portland.\n\nMichael Porter Jr. scored 27 points and grabbed 12 rebounds for Denver (45-24), which remained in the West's No. 3 spot. The Nuggets played most of the fourth quarter with reserves on the floor, limiting Nikola Jokic to 24 minutes.\n\n\"I thought our second-half effort was tremendous,\" Nuggets coach Michael Malone said. \"I thought our guys competed. ... (Portland was) playing for their playoff lives with all their starters in, we've got guys who haven't played a lot of minutes in the NBA and we're giving them all they can handle.\"\n\nJokic finished with eight points, five rebounds and 13 assists. Jerami Grant scored 18 for Denver, which -- even with the reserve lineup -- got within six on a 3-pointer by PJ Dozier with 1:16 left. But Nurkic got free for a dunk, Denver threw the ball away on the ensuing possession and Portland would hang on from there.\n\nLillard is the second player to have multiple games with at least 10 3-pointers this season, Houston's James Harden being the other. Lillard had 11 3's against Golden State on Jan. 20, the night he scored an NBA season-high 61 points.\n\n\"Obviously, he had an outstanding game scoring the ball, assists ... but more than anything else, his leadership tonight, his will to win was palpable,\" Portland coach Terry Stotts said of Lillard. \"You could just feel it, how important this was to him.\"\n\nTIP-INS\n\nTrail Blazers: Blazers forward Carmelo Anthony hasn't had the best experiences against the Nuggets, the team he spent parts of eight seasons with to start his career. When he's played, his teams had been 4-12 overall, 1-9 in their last 10 outings against Denver before Thursday. ... Lillard had seven points in a 24-second span of the third quarter -- a 3-pointer while getting fouled, the free throw, then another 3 on the next possession.\n\nNuggets: Denver won the season series between the clubs, 3-1. ... The Nuggets have games against Utah, the Los Angeles Lakers, the Los Angeles Clippers and Toronto left before the playoffs -- all contenders, but they could also catch some breaks. The Lakers have clinched the No. 1 seed out West, and Toronto could easily be locked into the No. 2 seed in the East by the time that matchup rolls around.\n\nHAPPY ANNIVERSARY\n\nFriday is the eighth anniversary of Portland hiring Stotts to coach the team. Only San Antonio's Gregg Popovich, Miami's Erik Spoelstra and Dallas' Rick Carlisle have held their current NBA job longer than Stotts' stint with the Blazers.\n\nHOT START\n\nPorter had 10 first-quarter points, giving him three consecutive games of at least that many in the opening period in the bubble -- all in a span of four days. He didn't have more than seven points in any of his other 38 first-quarter appearances this season.\n\nUP NEXT\n\nTrail Blazers: Face the L.A. Clippers on Saturday.\n\nNuggets: Face Utah on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996604.8735418
}