{
  "game_id": "0022400935",
  "espn_id": "401705501",
  "date": "Mar 10, 2025",
  "matchup": "MEM vs. PHX",
  "headline": "Ja Morant scores 29 and Grizzlies climb out of early hole to beat Suns 120-118",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 29 points and 12 assists, and the Memphis Grizzlies rallied from an early 16-point deficit to beat the Phoenix Suns 120-118 on Monday night.\n\n\r\n              Cam Spencer, a rookie on a two-way contract, added a career-high 16 points for Memphis, including a pair of free throws with 14.4 seconds left that sealed the Grizzlies' third straight win.\n\n\r\n              Kevin Durant scored 35 points and Devin Booker added 26 for the Suns, who jumped out to a 25-9 lead that evaporated before halftime. The game was close throughout the fourth quarter and Durant missed a potential game-winning 3-pointer just before the buzzer.\n\n\r\n              Both teams were coming off victories a night earlier. The Suns' Bradley Beal was sidelined for left calf injury management, while the Grizzlies continued to play without leading scorer Jaren Jackson Jr., who missed his fourth straight game with a left ankle sprain.\n\n\r\n              Takeaways\r\n              Suns: Phoenix is trying to work its way up to the 10th spot in the Western Conference to make the play-in tournament. The Suns entered the game trailing the depleted Dallas Mavericks by 1 1/2 games for the final postseason spot.\n\n\r\n              Grizzlies: Eight of their last 10 games have been decided by seven points or fewer, with Memphis going 4-4 in those close contests.\n\n\r\n              Key moment\r\n              Spencer hit a 3-pointer from the left corner in the last second of the third quarter. There were words between Spencer and Durant, who closed out on the shot. Durant then tried to leg sweep Spencer going down the court, and both players were assessed technical fouls.\n\n\r\n              Key stat\r\n              Phoenix went 20 of 38 (52.6%) from 3-point range, led by Durant, who was 7 of 9.\n\n\r\n              Up next\r\n              Both teams play Wednesday. The Suns play at Houston, while the Grizzlies host Utah.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997597.798484
}