{
  "game_id": "0021701072",
  "espn_id": "400975818",
  "date": "Mar 22, 2018",
  "matchup": "MEM @ CHA",
  "headline": "Walker scores 46, Hornets rout Grizzlies 140-79",
  "body": "CHARLOTTE, N.C. --  Kemba Walker was surprised to learn his Charlotte Hornets had just recorded the sixth-largest win in NBA history.\n\n\"That's not something you see every day,\" Walker said after his 46 points led the Hornets to a 140-79 victory Thursday night over the Memphis Grizzlies. \"We played well. We knew these guys were short-handed with no Mike Conley and Marc Gasol, who are two awesome players. But we just handled our business.\"\n\nDid they ever.\n\nWith Walker leading the charge with the ninth 40-point game of his career, the Hornets roared ahead 12-2 in the first 4  1/2 minutes, were ahead 37-14 after one quarter, 75-42 at halftime and by a game-high 65 points (137-72) with 1:45 left before taking the 61-point win.\n\nOnly Cleveland's 68-point win over Miami in 1991, Indiana's 65-point victory over Portland in 1998, the Los Angeles Lakers' 63-point rout of Golden State in 1972, Golden State's 62-point win over Sacramento in 1991 and the old Syracuse Nationals' 62-point win over the New York Knicks in 1960 were larger in league history.\n\nCharlotte's largest previous win in franchise history came by 52 points (136-84) at home against Philadelphia on Feb. 27, 1992.\n\nThe Hornets did so on a night in which they were without the suspended Dwight Howard.\n\nWalker scored 17 points in the first quarter, 18 in the second quarter and 11 in the third quarter before he was replaced for the final time with 1:48 left in the third. He hit 13 of 18 shots overall, including 10 of 14 on 3-pointers, and was 10 of 10 on free throws in 28 minutes.\n\n\"Tonight I shot the ball really well,\" Walker said. \"My teammates did a great job of getting me open. We just had to pick up our games because we knew Dwight wasn't playing. I thought we did a great job doing that.\"\n\nIt came one day after Howard's 32-point, 30-rebound performance helped Charlotte rally from a 23-point deficit to win 111-105 at Brooklyn. But in the process, Howard was whistled for his 16th technical foul of the season, which meant he had to serve a one-game suspension on Thursday night.\n\nIt was Walker's third-highest scoring game of his career; The 6-foot-1 two-time NBA All-Star had a career-high 52 points against Utah in a 124-119 double-overtime win in January 2016, and had 47 points in a 123-120 loss at Chicago in November 2017.\n\nMarvin Williams and Dwayne Bacon each scored 15 points for Charlotte.\n\n\"Two nights in a row it was fun,\" Charlotte coach Steve Clifford said of seeing the efforts of Howard and then Walker. \"I mean what Dwight did last night and what Kemba did tonight was just fun to watch. It's deserving for both guys.\"\n\nWayne Selden scored 18 points for Memphis (19-53). Conley (left heel) and Gasol (rest) remain out with injuries for the Grizzlies.\n\n\"Tonight we put on a performance that no one should be proud of and you can't defend it,\" interim coach J.B. Bickerstaff said.\n\nThe Hornets delighted the crowd of 15,033 at Spectrum Center -- and themselves -- in rolling to the big victory.\n\n\"They were out there just laughing,\" Memphis guard Tyreke Evans said of the Hornets. \"It was embarrassing. The whole thing. We've got to just wash this one away and just come back next game and be ready to play.\"\n\nTIP INS:\n\nGrizzlies: Bickerstaff was on the Charlotte coaching staff when the city returned to the NBA in 2004 and nicknamed Bobcats. Then a 25-year-old assistant coach to his father Bernie Bickerstaff, J.B. Bickerstaff was the youngest coach in the NBA at that time.\n\nHornets: Howard is one of only three players in the last 20 years (Andrew Bynum on April 11, 2012, and Kevin Love on Nov. 12, 2010) to get 30 rebounds in a game.\n\nLOOKING AT HISTORY\n\nBickerstaff was a Minnesota Timberwolves assistant in 2010 when Love was the last player to record a 30-30 NBA game before Howard did so on Wednesday night in Brooklyn. \"I was actually with Kevin Love in Minnesota when he had the 31 (points) and 30 (rebounds) versus the Knicks and its mind blowing to think that it can happen,\" Bickerstaff said before Thursday's game. \"And the effort that you have to put in to go it because people know what you're doing at that point. So there are two guys that are boxing you out, three guys that are chipping at you, small guys on your legs. So you have to be relentless and you have to be motivated to go out and get it done -- and then to go score 30 points on top of that. There's an energy level that's exhausting, but elite guys can do it.\"\n\nNOT TRYING FOR FIFTY?\n\nWalker came out with 1:48 left in the third quarter and didn't return, though Spectrum Center fans broke in \"Kemba!\" chants the rest of the game. Was there a chance he would return? \"Nah,\" Walker said. \"I was tired and it was a back-to-back.\"\n\nUP NEXT\n\nKnicks: Host Lakers on Saturday night.\n\nHornets: Visit Mavericks on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764992717.19243
}