{
  "game_id": "0022000026",
  "espn_id": "401267186",
  "date": "Dec 26, 2020",
  "matchup": "CHI vs. IND",
  "headline": "Sabonis posts triple-double, Pacers rout Bulls 125-106",
  "body": "CHICAGO -- — Domantas Sobonis had 22 points, 11 assists and 10 rebounds, and the Indiana Pacers used big scoring runs in the second and third quarters to cruise to a 125-106 victory over the Chicago Bulls on Saturday night.\n\n\r\n                    T.J. Warren scored 23 points and Victor Oladipo added 22 as Indiana beat its Central Division rivals for a 10th straight time, including five straight at the United Center.\n\n\r\n                    Sabonis, who had a career-high 32 points in the season-opening win against New York, finished 8 for 11 from the field before fouling out with just over five minutes remaining.\n\n\r\n                    “My teammates really helped me,” Sabonis said. “All game long they were reminding me where to be and helping me keep my energy up. In these games, with no fans out there, that's really important.”\n\n\r\n                    Zach LaVine scored 17 points and Lauri Markkanen had 16 points and nine rebounds for Chicago, which dropped its second straight to start the season.\n\n\r\n                    After getting off to a horrid start in the season-opening loss to Atlanta, the Bulls started fairly well on Saturday, building a 40-34 advantage early in the second quarter.\n\n\r\n                    But the game quickly turned as Indiana ran off 21 straight points to grab a 55-40 lead. Chicago went scoreless for five minutes and fell apart at both ends.\n\n\r\n                    The Bulls went 0-for-8 from the field with six turnovers during the drought — with three of the turnovers coming in the backcourt against Indiana's full-court trap. Defensively, they broke down repeatedly and allowed easy baskets.\n\n\r\n                    “Whatever the run was in the second quarter, we have to be able to stop it sooner than that,” Chicago coach Billy Donovan said. “They don't handle it — they don't handle it at all. They internalize it and try to do it themselves. They have to do it together.\n\n\r\n                    “The bottom line is this is pro basketball and you have to be able to handle it.” \n\n\r\n                    LaVine agreed with his coach's assessment. “We have to fight,\" he said. \"We can't let those lapses go that long.”\n\n\r\n                    The Pacers had a 66-56 halftime lead and started the third quarter with 18 straight points for an 84-56 edge to essentially put the game away. Chicago missed its first seven shots of the quarter and didn't score until a Markkanen layup with 7:12 left.\n\n\r\n                    “In the third quarter, we knew we had to come out and change things,” Sabonis said. \n\n\r\n                    The Bulls rallied, trimming the deficit to 114-103 with just under four minutes to play, but Warren converted a layup and Oladipo added a 3-pointer to build the lead up to 119-103.\n\n\r\n                    TIP-INS \n\n\r\n                    Pacers: C Goga Bitadze (right ankle sprain), F Brian Bowen II (right groin) and G Jeremy Lamb (left knee) each missed a second straight game.\n\n\r\n                    Bulls: G Tomas Satoransky and G Garrett Temple, who each missed much of the preseason because of COVID-19 protocols, returned to contribute off the bench. Satoransky finished with six points and nine assists in 25 minutes, while Temple had six points in 20 minutes. ... F Thaddeus Young (lower left leg infection) missed his second straight game.\n\n\r\n                    INSIDE GAME\n\n\r\n                    Indiana took advantage of Chicago's defensive lapses for a 76-34 edge in points in the paint.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host the Boston Celtics on Sunday night. Indiana has dropped nine of its last 13 games against the Celtics.\n\n\r\n                    Bulls: Host the Golden State Warriors on Sunday night. Chicago has dropped six straight games against the Warriors.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997609.8760939
}