{
  "game_id": "0021500322",
  "espn_id": "400828209",
  "date": "Dec 09, 2015",
  "matchup": "MEM @ DET",
  "headline": "Barnes makes desperation 3, Grizzles top Pistons 93-92",
  "body": "AUBURN HILLS, Mich. -- Detroit sports fans can be excused if the last week has ruined their holiday mood.\nSix days after Aaron Rodgers beat the Lions with a 60-yard Hail Mary pass as time expired at Ford Field, the Pistons were on the wrong end of a similar finish 30 miles north at the Palace of Auburn Hills.\nThis time, it was Matt Barnes knocking down a halfcourt shot with 1.1 seconds to play that gave the Memphis Grizzlies a 93-92 victory over Detroit.\n\"I knew I was ahead of a lot of people, and I wasn't sure what the time was, but I had space to get a clean look and I shot it,\" Barnes said. \"It was a crazy, lucky shot to hit and win a game.\"\nMarc Gasol pulled Memphis to 92-90 by making one of two free throws with 29.4 seconds to play, and Grizzlies coach Dave Joerger chose to play defense rather than foul. Marcus Morris missed a contested shot, and the ball was knocked away from Ersan Ilyasova before Andre Drummond missed a tip.\nPistons coach Stan Van Gundy shook his head when asked if Ilyasova had been fouled.\n\"After losing a game on a halfcourt shot, I'm going to get myself a huge fine from the league?\" he asked. \"No.\"\nAs Memphis grabbed the rebound, Joerger started to call a timeout, but stopped when he saw his team breaking up the floor. Barnes could have gotten closer -- he let fly from halfcourt with time left on the clock -- but the shot rattled home. Once again, a Detroit crowd fell silent as a visiting team celebrated.\n\"The play we called if they missed was to dribble three times and shoot it with 4 seconds left from halfcourt,\" Joerger joked. \"We executed it very well.\"\nDetroit still had 1.1 seconds left, and managed to anger its coach as Morris missed another tough shot.\n\"Instead of running the play, we broke it off after the first option,\" a frustrated Van Gundy said. \"I told them that I still don't know if the play works, because we didn't run it in Washington and we didn't run it again tonight.\"\nZach Randolph led Memphis with 21 points and 16 rebounds, while Gasol had 19 points and 12 rebounds. Courtney Lee came off the bench to score 14.\nDrummond had 18 points and 19 rebounds for the Pistons. Reggie Jackson added 18 points and seven assists.\n\"It's the toughest loss all season,\" Jackson said. \"It was a good basketball game, just with something unimaginable and unexplainable happening at the end.\"\nThe Pistons had led for the entire second half, and Randolph missed a pair of free throws that could have tied the game with 3:43 to play. Jackson's 3-pointer made it 92-87, but Randolph made it a three-point game with a tip-in.\nThe Pistons were then called for a shot-clock violation with 1:12 to play, and after the teams traded misses, Gasol made it 92-90 from the line, setting up the frantic final seconds.\nDetroit might have had a bigger lead with a better start to the game.\nThe Pistons struggled to hit shots early, trailing by as many as nine points, but rallied to take the lead late in the second quarter. Detroit outscored Memphis 30-19 in the period and led 47-43 at halftime.\nMuch of the half was a battle between Gasol and Drummond. Drummond finished the half with seven points and nine rebounds, while Gasol had eight points and seven rebounds.\nThe Pistons expanded the lead to 58-49 early in the third, but the Grizzlies were within 74-67 by quarter's end, and narrowed the gap to one early in the fourth.\nTIP-INS\nGrizzlies: Gasol played despite spraining his left ankle in Tuesday's lopsided loss to Oklahoma City. ... Randolph, who helped Michigan State to the 2001 Final Four, received his usual warm ovation from the Palace crowd. Grizzlies assistant coach Shawn Respert also played at Michigan State, and is still the school's leading scorer.\nPistons: Jackson appeared to injure his leg on the last play of the first half and limped slowly back to the locker room. He came out for the second half with a brace on his right knee, but took the floor at the beginning of the third quarter.\nUP NEXT\nGrizzlies: Host Charlotte on Friday.\nPistons: At Philadelphia on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994463.507843
}