{
  "game_id": "0021501121",
  "espn_id": "400829008",
  "date": "Mar 30, 2016",
  "matchup": "LAL vs. MIA",
  "headline": "Randle hits big shot in Lakers' 102-100 OT win over Heat",
  "body": "LOS ANGELES -- After all the drama of another miserable day for the Los Angeles Lakers, Julius Randle's graceful spin move for the winning basket was a splash of pure beauty.\nThese young Lakers make plenty of mistakes -- some more embarrassing than others.\nThey're also finishing a lousy season with reasons to be optimistic about their future.\n\nRandle hit a tiebreaking hook shot in the paint with 1.9 seconds left in overtime, and the Lakers rallied late in a tumultuous day for a 102-100 victory over the Miami Heat on Wednesday night.\nJordan Clarkson scored six of his 26 points in overtime for the Lakers, who snapped a four-game skid with just their 16th win of the season. Los Angeles hung on for its second win in 10 games when Joe Johnson badly missed a 3-pointer at the buzzer.\n\"Adversity is always tough, especially with a group of young guys,\" said Kobe Bryant, who played only nine minutes in the first quarter before sitting out with general soreness. \"There's always light, even when it's the darkest. Even when you can't see it at all.\"\nD'Angelo Russell scored five of his 16 points in overtime after receiving light boos from Lakers fans at several points early in the night. The rookie guard apologized profusely before the game for recording an unflattering video of teammate Nick Young, the latest tawdry controversy in a tedious season.\nRussell played splendidly down the stretch, and he dabbed with his teammates afterward.\n\"I felt like we had a whole bunch of motivation to pull one out,\" Russell said. \"It was tough to a certain extent, but we've got a guy like Kobe that's been through everything, and he was like, `You've got to just play. You've got to just play.' I just ran with it.\"\nRussell said he has no idea how the video appeared on social media. Young, who was taped in a discussion of being with women other than his fiancee, didn't play for the Lakers for the 11th straight game.\nDwyane Wade had 26 points and 10 rebounds for the Heat, who wasted a chance to move to the brink of a playoff berth in the opener of a three-game road trip. Luol Deng had 22 points and 11 rebounds, but Miami committed 18 turnovers and missed 11 free throws, allowing the Lakers to stick around.\n\"It was just total disrespect to the opponents tonight,\" Wade said. \"Those guys are good players, and you have to play them the same way you play an opponent you fear. We didn't do that, and that's why they got the win.\"\nAfter Randle hit two free throws with 1:04 left in overtime to put the Lakers up, Wade evened it with a layup. The Lakers ran down the clock for Randle, who executed his slick spin move and buried a left-handed hook.\nRandle finished with 13 points for the Lakers, who rebounded from a team record-tying, 48-point loss at Utah on Monday with a strong effort against the Heat.\n\"You typically get what you deserve in this league and we did not deserve this game,\" Miami coach Erik Spoelstra said. \"The road is real. It doesn't matter who you play.\"\nKOBE AND D-WADE\nBryant and Wade faced up briefly in the first quarter, with Wade blocking one of Bryant's shots. Wade then crashed Bryant's postgame news conference, urging him to hurry up so they could meet Wade's wife, actress Gabrielle Union.\nKOBE'S CAMEO\nBryant hit his first shot, but missed his next six. He got treatment on the Lakers' bench after checking out during the first quarter, and he had heavy ice wraps on both knees and his shoulder later in the half. \"I just couldn't go,\" Bryant said. \"There was no hope tonight.\"\nODOM RETURNS\nLamar Odom watched the game from a baseline courtside seat, wearing dark sunglasses. The former Lakers and Heat forward apparently is in improving health after he was found unconscious in a Nevada brothel last October. Odom was invited by Bryant to attend his first Lakers game since his near-fatal scare. Odom got a loud ovation from Lakers fans when he was shown on the scoreboard during the third quarter, and he checked in with Hall of Famer Kareem Abdul-Jabbar.\n\"Tremendous is an understatement,\" Bryant said. \"It's a miracle.\"\nTIP-INS\nHeat: Justise Winslow played through right knee tendinitis, getting eight points in 29 minutes. ... Goran Dragic also played through an illness, getting 11 points and nine assists as a starter.\nLakers: They played just their second overtime game of the entire season, and their first at home. ... Johnny Manziel, Nick Jonas, John McEnroe, Floyd Mayweather and Jaguars WR Marqise Lee were among the celebrities near courtside.\nUP NEXT\nHeat: At Kings on Friday.\nLakers: Host Celtics on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994239.3879108
}