{
  "game_id": "0022300406",
  "espn_id": "401585034",
  "date": "Dec 26, 2023",
  "matchup": "BKN @ DET",
  "headline": "Pistons set single-season record with 27th straight loss, as Cunningham's 41 not enough against Nets",
  "body": "DETROIT -- — The Detroit Pistons set an NBA single-season record with their 27th straight loss Tuesday night, as Cam Johnson scored 24 points and Mikal Bridges added 21 to lead the Brooklyn Nets to a 118-112 victory.\n\n\r\n              Cade Cunningham scored 41 points but the Pistons (2-28) broke a tie with the 2010-11 Cleveland Cavaliers and 2013-14 Philadelphia 76ers. The 76ers hold the overall mark at 28, a skid that started in the 2014-15 season and carried over into 2015-16. \n\n\r\n              “A lot of this load is trusted to me, on the court and in the locker room,” Cunningham said. “Every day, I try to lead the squad, and I haven't been successful at that — 2-28. It's only right that I speak for it and be the face of it.”\n\n\r\n              Cunningham scored 37 in the second half and shot 15 for 21 from the field, but Bojan Bogdanovic was the only other Pistons player with more than 15. Cunningham's teammates shot 36.2% (25 for 69), including 28.6% (6 for 21) on 3-pointers.\n\n\r\n              “You have to be real about where we are,” Pistons coach Monty Williams said. “Nobody wants something like this attached to them, and the bottom line is it is my job. Coaches are graded on their records.”\n\n\r\n              Nic Claxton and Day'Ron Sharpe each added double-doubles for the Nets, who beat the Pistons for the second straight game.\n\n\r\n              “I didn’t sleep very well last night, anticipating how tough this game was going to be,” Nets coach Jacque Vaughn said. “Any time you play a team back-to-back like that, it is really tough to (win).”\n\n\r\n              Dorian Finney-Smith's 3-pointer capped a 13-0 run that put the Nets up 105-97 with 4:53 to play. Cunningham missed a pair of free throws, but came back with a 3-pointer and a three-point play to pull Detroit within 109-106 with 1:54 left.\n\n\r\n              After Johnson's 3-pointer, a pair of layups from Cunningham made it 112-10. Finney-Smith, though, hit a baseline 3 to put the Nets up 115-110 with 38 seconds left.\n\n\r\n              “We had a little bit of execution and composure down the stretch,” Johnson said. “It didn't always go our way, but we were able to pull it out.”\n\n\r\n              Alec Burks missed a 3-pointer, and the Nets clinched the game from the free-throw line as fans chanted “Sell the team! Sell the team!\"\n\n\r\n              Brooklyn took an 11-point lead early in the third quarter, but the Pistons responded with an 11-0 run to tie the game at 71. Cunningham scored 18 of Detroit's 31 points in the period, keeping Detroit within 88-85 going into the fourth.\n\n\r\n              The Pistons started the game with a 22-8 run, giving hope to a large crowd, but the Nets outscored them 53-32 in the rest of the first half.\n\n\r\n              “To have a start like that and then kind of let it go in the second quarter — that's the quarter that put us in the hole,\" Williams said. “I think we had six turnovers in the second quarter. That's something that has plagued us all year long.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Milwaukee on Wednesday\n\n\r\n              Pistons: At Boston on Thursday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996355.434943
}