{
  "game_id": "0021800790",
  "espn_id": "401071463",
  "date": "Feb 04, 2019",
  "matchup": "DET vs. DEN",
  "headline": "Pistons pour it on this time, rout Nuggets 129-103",
  "body": "DETROIT --  For the second straight game, the Detroit Pistons had a big third-quarter lead at home.\n\nThis time, they kept pouring it on.\n\nAndre Drummond scored 14 of his season-high 27 points in the third and the Pistons snapped Denver's six-game winning streak, beating the Nuggets 129-103 on Monday night.\n\nDetroit blew a 25-point lead in a loss to the Los Angeles Clippers on Saturday, but the Pistons never allowed Denver to make much of a run in the second half. Blake Griffin added 17 points for Detroit, and Reggie Jackson scored 14.\n\n\"Played with the same energy we had in that Clippers game, but sustained it for the full game,\" Drummond said. \"That last game really hurt.\"\n\nTrey Lyles had 20 points for the Nuggets, who dropped out of a tie with Golden State for the best record in the Western Conference.\n\nDenver was without forward Paul Millsap, sidelined by right ankle soreness, and the Nuggets were also missing Gary Harris (right adductor strain) and Jamal Murray (left ankle sprain). Denver looked sharp early, scoring 36 points in the first quarter, but the Nuggets managed only 19 in the second and trailed 68-55 at halftime.\n\n\"Regardless of how many bodies we had, we didn't defend at all,\" coach Michael Malone said. \"Andre Drummond completely dominated us all game. He's an outstanding player, but 14 points and eight rebounds is a really good game for most players, and he had that in the third quarter.\"\n\nDrummond's work was done after three quarters. None of the Pistons' starters played in the fourth, and the backups extended the lead.\n\nDetroit's collapse against the Clippers began toward the end of the third, but that didn't happen this time. The Pistons were up 97-83 after three. Stanley Johnson then opened the fourth with a three-point play and a 3-pointer, and Luke Kennard added a 3 of his own to push the lead to 23.\n\nDEPTH\n\nDetroit's bench was outscored 80-17 in the loss to the Clippers, but the Pistons turned that around in a big way against the short-handed Nuggets. Detroit's reserves finished with a 60-28 edge. Johnson scored 21 points, and Langston Galloway added 18 for the Pistons. Kennard finished with 14.\n\n\"Tonight our bench was huge,\" Pistons coach Dwane Casey said. \"If we get that from them every night, we're not sitting here out of the playoff race. We're in the middle of the pack somewhere.\"\n\nThe Pistons trail Miami by 1 1/2 games for the last playoff spot in the East.\n\nFIZZLING OUT\n\nThe Nuggets scored nearly a quarter of their points in the first 5 1/2 minutes. They led 25-18 after a 3-pointer by Malik Beasley -- but their offense slowed considerably after that.\n\n\"We were missing shots, so they were running, and then they killed us on the glass,\" Beasley said. \"They've got Andre and Blake and Zaza (Pachulia), so they are going to be tough, but we weren't making it hard enough for them.\"\n\nTIP-INS\n\nNuggets: All five Denver starters scored in double figures, led by Monte Morris with 18 points. Beasley and Nikola Jokic had 16 each.\n\nPistons: Drummond surpassed his previous season high of 26 points. ... Detroit also set a season best with 32 assists, and the 60 points by the bench marked a season high.\n\nUP NEXT\n\nNuggets: Visit the Brooklyn Nets on Wednesday night.\n\nPistons: Visit the New York Knicks on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994680.217897
}