{
  "game_id": "0022400531",
  "espn_id": "401705097",
  "date": "Jan 10, 2025",
  "matchup": "BKN @ DEN",
  "headline": "Jokic, Westbrook have triple-doubles and Nuggets beat Nets 124-105",
  "body": "DENVER -- — Nikola Jokic had 35 points, 15 assists and 12 rebounds in his return to the lineup, Russell Westbrook had 25 points, 11 rebounds and 10 assists and the Denver Nuggets beat the Brooklyn Nets 124-105 on Friday night.\n\n\r\n              It was the 145th career triple-double for Jokic, who missed Denver's previous two games due to an illness.\n\n\r\n              It was Westbrook's 202nd career triple-double. It was the second time this season they have had triple-doubles in the same game, and according to the NBA they are the first teammates in NBA history to have triple-doubles in the same game multiple times in a single season.\n\n\r\n              Westbrook has the most career NBA triple-doubles and Jokic is third. Oscar Robertson is second with 181.\n\n\r\n              Ben Simmons played for the first time since Jan. 1 and had 10 points and six assists for Brooklyn, which has dropped four straight and 12 of its last 15. Keon Johnson had 22 points and Tyrese Martin had 19 points for Brooklyn.\n\n\r\n              The Nuggets used a late second-quarter run to take the lead for good, then opened the second half with a 25-9 spurt that made it 90-68.\n\n\r\n              The Nets got within 97-92 before Denver pulled away.\n\n\r\n              Takeaways\r\n              Nets: Played with just eight players against Detroit on Wednesday but Simmons returned from a four-game absence. Cam Johnson (right ankle sprain) and D’Angelo Russell (right shin contusion) are still out.\n\n\r\n              Nuggets: Jamal Murray didn’t play in the second half due to right knee soreness. Jokic entered Friday leading the NBA in scoring at 31.5 points a game.\n\n\r\n              Key moment\r\n              Johnson’s corner 3-pointer made it 101-95 midway through the fourth but Denver recovered and went on a 16-5 run to lead 117-100 with 2:48 left.\n\n\r\n              Key stat\r\n              The Nuggets committed nine turnovers by 2:09 into the second quarter and just five in the last 35:51.\n\n\r\n              Up next\r\n              The Nets continue their six-game road trip at Utah on Sunday night. The Nuggets play two straight games in Dallas, starting Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997985.8254158
}