{
  "game_id": "0022100839",
  "espn_id": "401360658",
  "date": "Feb 11, 2022",
  "matchup": "IND vs. CLE",
  "headline": "LeVert's strong finish helps Cavs rally past Pacers 120-113",
  "body": "INDIANAPOLIS -- — Indiana Pacers fans welcomed back Caris LeVert with a loud ovation during pregame introductions. His newly former team even honored him with a highlight reel during the first timeout of the game.\n\n\r\n              Then, he went out and did what he does best — play winning basketball.\n\n\r\n              LeVert scored 22 points, had five assists and delivered lockdown defense late in the game to help the Cleveland Cavaliers rally for a 120-113 victory on what had been his home court last week.\n\n\r\n              “Tonight had a little more on it since I was just here a week ago,\" said LeVert, who was traded to Cleveland on Sunday. “It was definitely weird energy, just being here a couple days ago. But it is what it is, you can get traded any day in the NBA — especially around the trade deadline. But it was definitely good to get the win.\"\n\n\r\n              The Cavs needed everything LeVert could muster with All-Star guard Darius Garland out with a sore back. And just like a week earlier when LeVert scored a season-high 42 points for the Pacers, he didn't disappoint. \n\n\r\n              Cleveland won its fifth straight to stay within striking distance of the Eastern Conference's top seed. Jarrett Allen wound up with 22 points and 14 rebounds, and Kevin Love scored 14 points to give him 7,001 since joining the Cavs. He needs 10 more to reach 14,000 in his career.\n\n\r\n              But it was LeVert's combination of offense and defense that helped Cleveland overcome an 18-point deficit over the final 15 1/2 minutes.\n\n\r\n              “This is why they wanted him and why they were willing to give up multiple draft picks and expiring contracts and all that stuff to get him,\" Pacers coach Rick Carlisle said. “I know it’s not fun losing that to that guy, but I know what he’s capable of.\"\n\n\r\n              The Pacers, who made three key trades this week, looked like a different team. Tyrese Haliburton ran the point and had 23 points and six assists in his Pacers debut and Indiana opened the game by making 10 of 12 from 3-point range while scoring an NBA franchise record 47 points in the first quarter.\n\n\r\n              It didn't last.\n\n\r\n              Despite controlling the entire first half and still leading 94-76 late in the third, the Cavs swung the game with their vaunted defense by forcing turnover after turnover in the fourth. Love, LeVert and Rajon Rondo repeatedly made Indiana pay.\n\n\r\n              Love's basket with 6:58 left cut Cleveland's deficit to four. LeVert made it a two-point game with 4:46 remaining and Rondo's 3 with 4:06 to go finally gave Cleveland the lead at 110-109.\n\n\r\n              LeVert followed that one with back-to-back baskets. and the Pacers only got as close as one point the rest of the game.\n\n\r\n              “Caris is a complete player,\" Cavs coach J.B. Bickerstaff said. “He's not just an offensive player. He knew what we needed to get it done. We needed to get stops in those moments to get back in the game.\"\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Love made three baskets in the first quarter, giving him 1,401 in his career. He finished 4 of 8 from the field. ... Rondo had 17 points, Cedi Osman had 14 points and Dean Wade had 13. ... Evan Mobley finished with eight points and one rebounds after being held scoreless and without a rebound in the first half.\n\n\r\n              Pacers: Chris Duarte had 18 points while Buddy Hield had 16 points and nine rebounds. ... Jalen Smith had 12 points and Isaiah Jackson added 11. ... The Pacers finished 18 of 38 on 3s. ... Olympic champion and retired sprinter Justin Gatlin received a Pacers jersey during the second quarter.\n\n\r\n              QUOTABLE\n\n\r\n              “He was one of the hardest people I’ve ever had to trade,” Pacers president of basketball operations Kevin Pritchard said about LeVert before the game. “He is a special person and I want to thank Caris. He’s probably going to go score 50 tonight.”\n\n\r\n              MYLES INCHING CLOSER\n\n\r\n              Pacers coach Rick Carlisle said he expects center Myles Turner to return to the lineup shortly after the All-Star break. Carlisle did not establish a target date for the league's defending blocks champion to return. Turner has not played since Jan. 14 because of a stress reaction in his left foot — an injury that may have kept him with the team that drafted him at the trade deadline.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Philadelphia on Saturday.\n\n\r\n              Pacers: Host Minnesota on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993025.008262
}