{
  "game_id": "0022300204",
  "espn_id": "401584832",
  "date": "Nov 18, 2023",
  "matchup": "MIA @ CHI",
  "headline": "DeMar DeRozan scores 23 as Bulls erase 21-point deficit and end Heat's winning streak at 7 games",
  "body": "CHICAGO -- — DeMar DeRozan scored 23 points and the Chicago Bulls rallied to beat Miami 102-97 on Saturday night, halting the Heat’s winning streak at seven games.\n\n\r\n              For the third straight game, the Bulls fell behind by double digits and were forced to try to mount a comeback. Despite trailing 22-1 midway through the first quarter, with boos reigning down from the home fans, the Bulls managed to snap their three-game losing streak with a furious fourth-quarter rally.\n\n\r\n              “We’ve been here before,” Zach LaVine said was the message Bulls players had for each other after another slow start. “It’s a trend that we don’t want to have. We’re going to have to nip it in the bud sooner than later. We haven’t figured it out on why it’s multiple times coming from behind.”\n\n\r\n              Alex Caruso scored 11 points and all five Chicago starters reached double figures. Nikola Vucevic added 15 points, Coby White scored 14 and LaVine contributed 13.\n\n\r\n              Jimmy Butler scored 25 for the Heat, who didn’t trail in the game until the final minute. But Butler missed a pair of 3-point attempts in the final seconds. Bam Adebayo had 24 points and 10 rebounds for his seventh double-double of the season. Duncan Robinson added 17.\n\n\r\n              “We started out great,” Butler said. “We’re known for doing that. And then we let it get easy on them. They made shots, as they’ve done in the past against us and against multiple other teams. We let one get away.”\n\n\r\n              Caruso’s 3-pointer in front of the Heat bench with 51.8 seconds remaining gave the Bulls their first lead of the game, before DeRozan’s turnaround 18-foot fadeaway put Chicago up for good with 22 seconds left.\n\n\r\n              “I was trying to bait (Butler) into coming, but I knew he wasn’t going to leave off Zach,” DeRozan said of setting up his decisive shot. “It definitely felt good to see it go (in), get the crowd reaction especially with how we started.”\n\n\r\n              Despite a shooting performance that began miserably from the line and the field, DeRozan hit two free throws with five seconds left to put the game out of reach.\n\n\r\n              The Bulls missed their first 10 shots and fell behind 22-1 before LaVine broke the shooting drought with a running jumper more than seven minutes into the first quarter.\n\n\r\n              “It was 20-1, right? There’s nothing good going on when that’s happening,” said Bulls coach Billy Donovan, who noted a season-high 45 3-point attempts as part of the comeback. “We talked about it at the walkthrough today. I put up not a lot, but enough clips of guys passing up shots. They need to shoot the basketball when they’re open.”\n\n\r\n              This was the first matchup between the teams since the Heat rallied from a late fourth-quarter deficit to win a Play-In Tournament game over the Bulls in April. From there, the Heat entered the playoffs and launched their improbable run to the NBA Finals.\n\n\r\n              UP NEXT\n\n\r\n              The teams play again on Monday, again at the United Center in Chicago.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995385.965153
}