{
  "game_id": "0022201195",
  "espn_id": "401469350",
  "date": "Apr 05, 2023",
  "matchup": "SAC @ DAL",
  "headline": "Mavs keep play-in hopes alive with 123-119 win over Kings",
  "body": "DALLAS -- — Kyrie Irving had already sparked a rally to put the Dallas Mavericks in front when he hit a gravity-defying shot that helped seal a victory to keep their postseason hopes alive.\n\n\r\n              Irving capped a 19-point fourth quarter with a high-arching 3-pointer to finish with 31 points, and Dallas stayed in the race for the final play-in spot in the Western Conference playoffs with a 123-119 victory over the Sacramento Kings on Wednesday night.\n\n\r\n              The corner 3 from Irving finished his 25-point second half and put the Mavericks up 120-114 with two minutes remaining. Dallas trailed by 13 early in the third quarter.\n\n\r\n              “He made it rain. Uncle Drew,” Dallas coach Jason Kidd said. “His difficulty of shots, he makes look easy. But that was a big 3.”\n\n\r\n              Luka Doncic had 29 points and 10 rebounds as the Mavericks (38-42) matched Oklahoma City’s record for the 10th seed in the West with two games remaining. \n\n\r\n              The Thunder own the tiebreaker, so Dallas, which reached the West finals last year, needs at least one Oklahoma City loss to have a chance at another playoff run.\n\n\r\n              Facing the brink of postseason elimination with a loss, the Mavericks rallied in the third quarter, when Irving started and finished a 12-0 run with 3-pointers for an 82-78 lead.\n\n\r\n              Doncic and Tim Hardaway Jr., who scored 24 points, had the other two 3s on the run as Doncic and Irving won for the fifth time in 16 games together since the blockbuster trade that brought Irving from Brooklyn.\n\n\r\n              Dallas ended a three-game losing streak with just its second victory in its past nine games.\n\n\r\n              “We’ve been feeling the sense of desperation for the last couple of games now,” Hardaway said. “Just happy that we were able to come out on top for one of them, at least. Now it’s picking up where we left off.”\n\n\r\n              De'Aaron Fox scored 28 points and Domantas Sabonis had a triple-double with 19 points, 11 rebounds and 11 assists for the Kings, who have already ended a 16-year playoff drought and are all but locked in to the third seed in the West.\n\n\r\n              Sacramento matched its biggest lead in the opening moments of the third quarter, but the Mavericks went back in front 79-78 on a 3 by Doncic with seven minutes left in the third.\n\n\r\n              “Our sense of urgency, our physicality, our pace, all of that stuff was really, really good in the first half,” Kings coach Mike Brown said. “They came out in the second half and took it to us. The game was basically reversed in that area.”\n\n\r\n              Sacramento had a season-high 22 offensive rebounds for a 30-14 edge in second-chance points, but the Mavericks had the biggest one of the game when Christian Wood grabbed a miss from Irving and five seconds later hit a 3-pointer for a 123-114 lead with a minute to go.\n\n\r\n              Wood scored 14 points despite 5-of-15 shooting. \n\n\r\n              Irving was 4 of 5 from 3-point range in the fourth quarter and 7 of 11 overall.\n\n\r\n              “Not every fourth quarter is like that for me,” Irving said. “You look back to the last few games, I wish I could have played as well as I did tonight. Just desperation basketball. It's not like it's the first time I've been in a must-win game, so it felt good.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: All five starters scored in double figures. Harrison Barnes had 16 points against his former team, Kevin Huerter scored 14 and Keegan Murray added 11.\n\n\r\n              Mavericks: Starters Reggie Bullock and Dwight Powell combined for just five points on just four shots. ... Josh Green had 10 points and nine rebounds.\n\n\r\n              COOL, BUT DIDN'T COUNT\n\n\r\n              With the outcome decided as the final seconds ticked off, Doncic casually flipped a three-quarter-court shot that went in. Officials stopped long enough to confirm it was after the buzzer.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Golden State in home finale Friday.\n\n\r\n              Mavericks: Chicago visits Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995278.823456
}