{
  "game_id": "0021600113",
  "espn_id": "400899563",
  "date": "Nov 09, 2016",
  "matchup": "PHX vs. DET",
  "headline": "Bledsoe, Dudley lead Suns past Pistons 105-99",
  "body": "PHOENIX --  The last 24 hours weren't easy on the Phoenix Suns, but they pulled together and got a win.\n\nThe team landed at 3 a.m. from a close loss at Portland on Tuesday night, having already learned before that game that center Tyson Chandler's mother had died. Chandler was away from the team Wednesday as well.\n\nThey trailed by as many as 11 points, but Eric Bledsoe scored 14 of his 21 in the fourth quarter to help the Suns to a 107-100 victory over the Detroit Pistons on Wednesday night.\n\nBledsoe added 11 rebounds and eight assists for the Suns (3-6), who got a season-high 19 points off the bench from Jared Dudley. Alex Len added 16 points and 14 rebounds.\n\n\"The guys came out and they played for a bigger purpose beyond basketball,\" coach Earl Watson said.\n\n\"My team needed me,\" Bledsoe said. \"All of us are a family. You don't ever want to see one of your brothers go down like that.\"\n\nKentavious Caldwell-Pope led the Pistons (4-4) with a season-high 27 points, making 5 of 10 3-point attempts, but he missed a potential tying 3 with 1:35 to play and the Suns up 99-96. Andre Drummond added 18 points and 14 rebounds.\n\nThe Pistons went on a 14-0 run between the end of the third quarter and early in the fourth to take an 87-81 lead. Former Sun Jon Leuer scored six of the points and finished with 11 points and nine rebounds.\n\nPhoenix went back ahead 92-90 when Dudley fed Len for a dunk with 5:02 to play. Dudley's fourth 3 of the game made it 99-93.\n\n\"That's been my role the last couple of years, the trailing jump shot,\" Dudley said. \"Once you hit one, your teammates start looking for you.\"\n\nThe Pistons led by as many as 11 points in the first quarter and 28-19 going into the second. Caldwell-Pope scored nine points in the first.\n\nThe Suns made only 6 of 22 shots in the first quarter.\n\nPhoenix rallied in the second quarter, going on a 16-4 run. Dudley then knocked down three 3s as part of his 15 points in the quarter and gave the Suns a 49-47 lead with 3:17 left.\n\nSuns leading scorer Devin Booker didn't make his first field goal until early in the third quarter, but his three-point play with 6:15 to go gave the Suns a 66-60 lead.\n\nBooker had scored 100 points in his previous three games. He had 11 on Wednesday.\n\nLen had seven points in the third quarter, two on a power move inside to give the Suns a 78-69 lead at the 1:02 mark. But Caldwell-Pope hit a 26-footer at the third-quarter buzzer to cut the Suns' lead to 81-76.\n\n\"We couldn't get stops the last of the fourth quarter,\" Caldwell-Pope said. \"We just kept trading baskets and that wasn't what we wanted to do.\"\n\nTIP-INS\n\nPistons: G Reggie Jackson remained out with a left knee injury ...  F Marcus Morris, a former Sun, was roundly booed when introduced as a starter and when he touched the ball. He did have the dunk of the night in the second quarter when he flew in for a one-handed slam.\n\nSuns: Len recorded his first double-double of the season. ... The Suns' bench totaled 41 points, compared to 21 for Detroit.\n\nVAN GUNDY RIPS TRUMP\n\nPistons coach Stan Van Gundy went on a near 6-minute rant about the election of Donald Trump before Wednesday's game. \"I don't think anybody can deny this guy is openly and brazenly racist and misogynist and ethnocentric, and say that's OK, we're going to vote for him anyway,\" Van Gundy told reporters. \"We have just thrown a good part of our population under the bus.\"\n\nVan Gundy said what the country has done to women and minorities in electing Trump is \"despicable,\" and that he'd never been ashamed of the United States until Wednesday.\n\nLOVE FOR BOOKER\n\nVan Gundy said a case can be made that Booker is the best player in his draft class at present. \"He doesn't have a lot of holes in his offensive game at all,\" Van Gundy said.\n\nWINLESS ON THE ROAD\n\nDetroit is 0-4 on the road this season. \"We're not bringing enough at either end of the floor so we've got to get it changed around,\" Van Gundy said.\n\nBACK-TO-BACK AT HOME\n\nThe Suns won consecutive home games for the first time since Dec. 13 and 18 of last season.\n\nUP NEXT\n\nPistons: At San Antonio on Friday night.\n\nSuns: Host Brooklyn on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764996010.812512
}