{
  "game_id": "0022200761",
  "espn_id": "401468916",
  "date": "Jan 30, 2023",
  "matchup": "DET @ DAL",
  "headline": "Doncic scores 53 in return, Mavericks beat Pistons 111-105",
  "body": "DALLAS -- — Luka Doncic had 53 points in his return to the lineup and Spencer Dinwiddie scored 10 of his 12 in the fourth quarter as the Dallas Mavericks rallied to beat the Detroit Pistons 111-105 on Monday night.\n\n\r\n              Four of Doncic’s five career 50-point games have come this season. He scored a career-best 60 against the New York Knicks in a game that went to overtime on Dec. 27.\n\n\r\n              His 53 points tied for second-most in Dallas history with Dirk Nowitzki’s total against the Houston Rockets on Dec. 2, 2004.\n\n\r\n              Doncic had 24 points in the first quarter and 18 in the third. Second in the NBA going in with an average of 33 points per game, he returned after spraining his left ankle three-plus minutes into last Thursday’s game at Phoenix and then missing Saturday’s game at Utah.\n\n\r\n              Usually animated and vocal on the court, Doncic was particularly involved in a running conversation with Pistons assistant coach Jerome Allen.\n\n\r\n              “From the first quarter, he was just chirping,” Doncic said. “I don’t want to say the words. I have no problem with that. It’s basketball. It gets me going, for sure.”\n\n\r\n              The Mavericks (27-25) moved into sixth place in the Western Conference, a half-game ahead of the four-team play-in positions.\n\n\r\n              Bojan Bogdanovic had 29 points and Saddiq Bey scored 18 — including five 3-pointers — for the Pistons (13-39), who have lost six of seven.\n\n\r\n              Doncic’s final basket was a shot that bounced off the front rim and dropped in to put Dallas ahead 109-105 with 46 seconds left. On the Pistons’ next possession, Bogdanovic missed a long 3-pointer near the right sideline amid traffic and landed on his backside out of bounds.\n\n\r\n              “We thought Bojan got fouled,” Detroit coach Dwane Casey said. “You still have to play in all those situations and close out the game, because we put ourselves in a situation to win.”\n\n\r\n              The Pistons were called for 31 fouls to the Mavericks’ 18. Doncic was 14 of 18 at the free throw line while Detroit went 19 for 27. \n\n\r\n              Detroit led by 11 in the third quarter and 84-83 going into the fourth. Dallas opened the period on a 9-2 run with Doncic on the bench, as Dinwiddie scored six points on his first three field goals of the game.\n\n\r\n              Dinwiddie’s 12 points followed his two highest-scoring games of the season — 36 and 35 points in Doncic’s absence.\n\n\r\n              The Pistons shook off a 10-0 deficit nearly three minutes in and grabbed their first lead with 4:41 to play in the first quarter. They led 57-53 at halftime. \n\n\r\n              ONE-MAN BAND\n\n\r\n              Doncic had 18 of Dallas’ first 20 points and 24 of the Mavericks’ 30 in the first quarter, the highest-scoring opening period for an NBA player this season. It was his fourth quarter with at least 20 points this season, tying Brooklyn guard Kyrie Irving for most in the NBA.\n\n\r\n              “You couldn’t ask for a better quarter,” Mavericks coach Jason Kidd said.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Bogdanovic has scored at least 20 points in each of his last 10 games, the longest streak of his career and tied for the fourth-longest active streak in the NBA. … Reserve guard Hamidou Diallo, who averages 17 minutes per game, was out with a stomach flu.\n\n\r\n              Mavericks: Kidd said the team expects a medical update later this week on starting center Christian Wood, who missed his sixth consecutive game with a broken left thumb. … Theo Pinson was assessed a technical foul late in the first quarter while sitting near the end of the bench.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Begin a three-game homestand Wednesday against Washington.\n\n\r\n              Mavericks: Host the New Orleans Pelicans on Thursday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995263.9666822
}