{
  "game_id": "0021600423",
  "espn_id": "400899865",
  "date": "Dec 20, 2016",
  "matchup": "MIL vs. CLE",
  "headline": "James lifts Cavs past Bucks in OT, 114-108",
  "body": "MILWAUKEE -- LeBron James had a big night beyond the arc and capped it with three pivotal points.\nJames buried a go-ahead 3-pointer with 24 seconds left in overtime and the Cleveland Cavaliers held on for a 114-108 victory over the Milwaukee Bucks on Tuesday night to avenge a late November loss.\n\"It's something I practice before the game, it's something I do on practice days and I was shooting the ball extremely well tonight from the perimeter,\" said James, who matched his season high with five 3-pointers. \"So, I just trust it. I trust in what I've been doing and the work I've been putting into it and knock it down.\"\nMilwaukee took a 108-107 lead on a tip-in by Giannis Antetokounmpo with 1:12 left. Cleveland's Kyrie Irving missed a 3-pointer from the left corner on the next possession, but Jabari Parker's lay-in attempt at the other end curled out.\nJames was fouled on the rebound by Antetokounmpo, his sixth. James then hit the deep 3-pointer to put Cleveland up 110-108.\n\"That 3 hurt us,\" Parker said. \"He's the best player in the world. He doesn't care how far it is. You've got to respect him.\"\nParker was fouled on a layup attempt on the ensuing possession but missed both free throws. Irving hit a pair of free throws with 15.7 seconds left to make it 112-108.\nJames had 34 points and Irving 28 for Cleveland, which had lost at Milwaukee 118-101 on Nov. 29. Parker had 30 points and Antetokounmpo added 25. The two teams meet again Wednesday night in Cleveland.\n\"Jabari took advantage of some of our smaller guys when we had them on him, getting to the basket, kind of being physical,\" Cavaliers coach Tyronn Lue said. \"So we've got to do a better job with that matchup.\"\nThe Bucks scored the final seven points of regulation to send it into overtime tied at 100.\nParker scored on a drive to put Milwaukee up 104-102, but Richard Jefferson was fouled on a 3-point attempt and hit all three free throws to put Cleveland back ahead 105-104. Antetokounmpo answered with a short jumper from the lane to put the Bucks in front 106-105.\nJefferson scored on a baseline drive, but Antetokounmpo made a tip-in to give the Bucks the 108-107 lead with 1:12 left.\nThe Cavaliers took a 100-93 lead on Irving's 3-pointer with 2:32 left in regulation, but Greg Monroe's inside basket and Tony Snell's 3-pointer cut it to 100-98 with 47 seconds remaining.\nAfter a missed 3-pointer by James, Parker scored on an inside spin move from the left side to tie it at 100 with 15.5 seconds left. Irving missed a 3-pointer from the top of the key with 1 second left.\n\"We get them again tomorrow in Cleveland,\" Bucks coach Jason Kidd said. \"We can watch video, clean up some mistakes and give them another run tomorrow. Understanding that small plays mean everything. Coming up with loose balls, being able to finish plays on the defensive end and, hopefully, a couple more shots go down for us tomorrow.\"\nTIP-INS\nCavaliers: Cleveland was without F Kevin Love, sidelined with a bruised left knee. Jefferson started in his place. Love (22.3 points per game and team-high 10.7 rebounds per game) is questionable for Wednesday's game against the Bucks in Cleveland\nBucks: Reserve F Michael Beasley (8.3 points per game), one of the top contributors off the bench, was out for the third straight game with a sprained left foot.\nJAMES PASES MALONE\nJames moved past Moses Malone (27,409 points) into eighth place on the NBA career scoring list with his first basket of the game. James' 34 points boosted his career total to 27,442. Next up is Shaquille O'Neal with 28,956 points. Earlier this season, James passed Hakeem Olajuwon and Elvin Hayes.\nSMITH INJURES THUMB\nCavaliers G J.R. Smith injured his right thumb late in the first half and did not return. He is scheduled to be examined Wednesday in Cleveland.\nLONG-RANGE CAVALIERS\nCleveland's 17 3-pointers matched the most given up by the Bucks this season. The Cavaliers were 17 of 40 beyond the arc, while the Bucks were 7 of 27. It's the sixth time this season the Cavaliers have made 15 or more 3-pointers in a game, second-highest in the NBA this season. James' five 3-pointers tied his season high.\nUP NEXT\nCavaliers: At home against the Bucks on Wednesday night.\nBucks: Milwaukee, coming off back-to-back wins against Chicago, completes its second consecutive home-and-away at Cleveland.",
  "source": "espn_api",
  "crawled_at": 1764995201.4103749
}