{
  "game_id": "0022300476",
  "espn_id": "401585104",
  "date": "Jan 03, 2024",
  "matchup": "ORL @ SAC",
  "headline": "Kings outlast short-handed Magic in double overtime behind triple-double from Domantas Sabonis",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 22 points, 23 rebounds and 12 assists, Malik Monk scored 37 off the bench and the Sacramento Kings outlasted the Orlando Magic 138-135 in double overtime Wednesday night.\n\n\r\n              Sabonis finished with his seventh triple-double this season as Sacramento overcame a hot shooting night by the short-handed Magic, who made 25 3-pointers to break the franchise record. That helped them come back from a 13-point deficit in the third quarter to take the lead in the fourth. \n\n\r\n              Paolo Banchero had a career-high 43 points to lead the Magic but missed a potential tying 3 as the final buzzer sounded. Jalen Suggs scored 24.\n\n\r\n              “For our guys to fight the way they fought and find a way in two overtimes, I applaud them because there were a handful of times we could have just cashed in,” Kings coach Mike Brown said.\n\n\r\n              De’Aaron Fox made two field goals in the second overtime, including a jumper that put the Kings ahead 137-135 with under a minute to play after the teams had furiously traded baskets. \n\n\r\n              In overtime, Sabonis gave the Kings a 126-125 lead with 17.1 seconds left on a dunk off a pass by Monk, who had nine assists in 46 minutes. Monk then made one of two free throws with 7.1 seconds remaining. But after an overturned out-of-bounds call gave the ball to the Magic, Banchero tied the score at 127 on a layup off an inbounds play with 1.1 seconds left to send the game to double OT.\n\n\r\n              With the Magic down by one and time running down in regulation, Banchero drilled a contested 3-pointer to give Orlando a two-point lead with 16 seconds to go. Monk answered for Sacramento with a layup to tie the game at 118. \n\n\r\n              “Just wanted to do whatever I could,” Banchero said. “Just be aggressive. Really just doing whatever we can to get the win. We’ve taken some tough losses. We’re fighting right now.”\n\n\r\n              Brown said the game plan was to protect the paint and allow Orlando to shoot from distance. The Magic took advantage with a record-setting night from beyond the arc. \n\n\r\n              “We did exactly what (Brown) wanted us to do,\" Monk said. “They were just hitting shots tonight. They hit a lot of shots tonight. Hats off to them.”\n\n\r\n              Sabonis entered as one of seven players with multiple triple-doubles this season, and completed the feat Wednesday early in the third quarter. It was his fifth triple-double in the last nine games.\n\n\r\n              Keegan Murray had 28 points for Sacramento.\n\n\r\n              The Kings have won five in a row over the Magic, and responded a night after losing at home to the Charlotte Hornets, who had dropped 11 straight coming into the game.\n\n\r\n              The Magic have lost four of five, and are winless in the first three games of a four-game West Coast swing. Both teams were coming off losses and playing the back end of a back-to-back.\n\n\r\n              “We played a hell of a game,” Banchero said. “Despite everything that happened with injuries, we gave ourselves a shot and that’s all we can ask for.”\n\n\r\n              Sacramento took a double-digit lead in the second quarter behind a 15-2 run after falling behind 34-27. The Kings made seven straight 3-point attempts, with Monk hitting five 3s in under four minutes, setting a career high for 3-pointers in a quarter.\n\n\r\n              The Kings led 67-55 at halftime.\n\n\r\n              “Throughout the season, we’ve overcome adversity,” Murray said. “I feel like we’re a team that handles it well when it happens, and today was no different. All of our guys are calm and just stuck with it throughout the whole game.”\n\n\r\n              The Magic, already short-handed with Cole Anthony (bruised right quad), Jonathan Isaac (hamstring), Markelle Fultz (knee) and Joe Ingles (ankle) out, saw three more key players sustain injuries on Wednesday.\n\n\r\n              Franz Wagner, the Magic’s second-leading scorer, appeared to hurt his right ankle in the first quarter after landing on it while contesting a shot. Gary Harris left the game with a right calf strain, and Banchero sprained his right ankle but returned to the game. \n\n\r\n              Orlando coach Jamahl Mosley said Wagner will be re-evaluated when the team gets to Denver for a game against the Nuggets on Friday.\n\n\r\n              “I can’t say enough about the group,” Mosley said. “Every person that was available played, contributed, fought, battled. And they had to dig down deep. I’m so proud of the way in which they competed. Never got away from them.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: Visit the Denver Nuggets on Friday.\n\n\r\n              Kings: Host the Toronto Raptors on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995716.1876879
}