{
  "game_id": "0021700065",
  "espn_id": "400974816",
  "date": "Oct 26, 2017",
  "matchup": "ATL @ CHI",
  "headline": "Markkanen helps Bulls top Hawks 91-86 for 1st win",
  "body": "CHICAGO --  The Chicago Bulls needed a big play, and Lauri Markkanen wanted the ball.\n\nNothing timid about this rookie.\n\nMarkkanen made a key 3-pointer with 48.5 seconds left in his fourth NBA game, helping the Bulls beat the Atlanta Hawks 91-86 on Thursday night for their first win of the season.\n\n\"I'm not afraid of big moments,\" Markkanen said. \"Even though my shot wasn't falling early on, I still believe every shot I shoot, I believe it's going in.\"\n\nThe 7-foot forward finished with 14 points and 12 rebounds, leading a dominant rebounding effort for Chicago. Robin Lopez had 16 points and eight rebounds, and reserve David Nwaba finished with 15 points and 11 boards, helping the Bulls to a whopping 62-40 advantage on the glass.\n\n\"I think in the past few games we had struggled to close out possessions,\" Lopez said. \"We had solid defensive possessions, but we let the opposing team get offensive rebounds and tonight I thought we did a great job of getting rebounding, of team rebounding.\"\n\nMarco Belinelli made five 3-pointers on his way to 23 points for Atlanta, which went 1-4 on the franchise's longest road trip to begin a season. Kent Bazemore scored 16 points and Mike Muscala finished with 14 points and 10 boards.\n\nBelinelli made a 3 to give Atlanta an 86-85 lead with 1:48 left, but the Hawks never scored again. Lopez passed to Justin Holiday for a reverse layup and Jerian Grant found Markkanen for his big 3 in the final minute, making it 90-86.\n\n\"It was a tough way to end,\" Muscala said.\n\nGrant added a free throw in the final seconds, helping Chicago close it out. Holiday had 13 points and 10 rebounds, and Grant finished with 11 points and seven assists.\n\nRookie John Collins had 13 points on 5-for-6 shooting for the Hawks, who won three of four against the Bulls last season. Playing without point guard Dennis Schroder, who missed his second straight game with a sprained left ankle, Atlanta did not attempt a free throw in the fourth quarter, while Chicago went 9 for 12 at the line in the final period.\n\n\"They basically won the game at the free-throw line,\" coach Mike Budenholzer said. \"That's the difference. And both teams are struggling to score, we just kind of gifted them with free throws.\"\n\nMarkkanen, the seventh overall pick in the June draft, made five 3-pointers and scored 19 points in Tuesday's 119-112 loss at Cleveland, drawing praise from LeBron James for his shooting skills. He got off to a slow start against Atlanta, going 1 for 8 from the field in the first half, but he got back on track by putting the ball on the floor.\n\nHe drove to the rim for a dunk and a three-point play with 8:33 left in the third. He added a slick driving layup with 6:48 to go, giving the Bulls a 49-44 lead after they trailed by as many as seven in the first half.\n\nBRITNEY FAN\n\nLopez has a framed picture of pop star Britney Spears in his locker. He said he found it after Chicago's season-opening loss to Toronto at the Air Canada Centre last Thursday.\n\n\"You've got to respect Britney,\" he said.\n\nTIP-INS\n\nHawks: F Ersan Ilyasova was active, but did not play due to a left knee strain. Ilyasova got hurt during Sunday's 116-104 loss at Brooklyn. \"Just giving it one more day makes a lot sense for him and us,\" Budenholzer said.\n\nBulls: F Paul Zipser was sidelined by a bruised right knee. Denzel Valentine replaced him in the starting lineup. ... G Kris Dunn (left index finger dislocation) could make his Bulls debut Saturday against Oklahoma City. He got hurt during an Oct. 6 preseason game. \"It's still very swollen, so we'll get a good practice with him tomorrow and then make that determination on Saturday,\" coach Fred Hoiberg said.\n\nUP NEXT\n\nHawks: Host Denver on Friday night. The Hawks swept their two-game series against the Nuggets last season.\n\nBulls: Host Oklahoma City on Saturday night. The Bulls and Thunder split two games last season, with each team winning on the road.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap\n\n---\n\nMore AP NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993789.250379
}