{
  "game_id": "0022301073",
  "espn_id": "401585701",
  "date": "Mar 29, 2024",
  "matchup": "SAC vs. DAL",
  "headline": "Dante Exum hits late 3-pointer, Kyrie Irving scores 30 in Mavericks' 107-103 win over Kings",
  "body": "SACRAMENTO, Calif. -- — Dante Exum hit the winning 3-pointer with 27.5 seconds to go, Kyrie Irving had 30 points and the Dallas Mavericks beat the Sacramento Kings 107-103 on Friday night for their sixth straight win. \n\n\r\n              Exum’s wide-open shot, set up by P.J. Washington, made it 106-103 and capped a second-half comeback for the Mavericks, who trailed by 15. Fourteen of Irving's 30 points came in the fourth quarter, and Luka Doncic added 26 for Dallas.\n\n\r\n              Harrison Barnes missed a potential game-tying 3-point attempt, and then committed a backcourt violation after the Kings got the offensive rebound. The late shot was a redeeming moment for Exum, who was 1 of 4 from beyond the arc prior to that attempt. He had missed open threes, but with all the attention on Irving and Doncic, the ball repeatedly found Exum in crunch time with room and time.\n\n\r\n              “In Exum we trust,” coach Jason Kidd said.\n\n\r\n              Exum, a former lottery pick a decade ago who was out of the league for a couple of years before signing with the Mavericks in the offseason, has reestablished himself as a role player on a deep Dallas team. He said there is a running joke with coaches that he is shooting 50% from deep this season.\n\n\r\n              “So if I miss one, the next one’s in,” Exum said. “I would just always have that mindset.”\n\n\r\n              Exum said after his misses, he'd look to the bench and find nothing but encouragement from his teammates. \n\n\r\n              Irving in particular looked him in the eye and told him: “We're going to be fine.”\n\n\r\n              “Honestly, just even the ball to get to me and to have the trust to pass it is an amazing thing,\" Exum said. “I think that’s hopefully what’s going to take this team far.”\n\n\r\n              Dallas also rallied from a nine-point deficit to start the fourth quarter, going on a 12-0 run to take its first lead of the game midway through the quarter.\n\n\r\n              Dallas, which has won 10 of its last 11 games, moves two games ahead of the Kings for the sixth spot in the Western Conference that would avoid the play-in tournament. Sacramento remains in the eighth spot in the West. \n\n\r\n              The Mavericks have also won back-to-back games over the Kings after blowing out Sacramento by 36 points on Tuesday.\n\n\r\n              Domantas Sabonis led the Kings with 13 points, 12 rebounds and 10 assists for his league-leading 26th triple-double. Sabonis also had his 56th consecutive double-double, passing Jerry Lucas for the longest streak in franchise history. De'Aaron Fox scored 23 points and Barnes had 20.\n\n\r\n              Kings coach Mike Brown said the Mavericks played like an experienced team in the fourth quarter, putting Sabonis through ball screens and creating a mismatch. \n\n\r\n              “Their execution was at a high, high, high, high level down the stretch and Exum finally hit a big 3,” Brown said. “I applaud our guys for the effort they gave, and this one’s tough to let slip away.”\n\n\r\n              Both teams shot 47% from the field in the first half, but the Kings were 8 of 17 from beyond the arc to lead by 15 points. Barnes had 17 points to help the Kings take a 60-51 advantage into halftime.\n\n\r\n              The Kings will be without starting guard Kevin Huerter for the rest of the season, after Brown confirmed that Huerter will undergo left shoulder surgery to repair a torn labrum. Keon Ellis, who had 16 points on Friday, will take Huerter’s place in the starting lineup. \n\n\r\n              Malik Monk left the game in the first quarter with a right knee injury after Doncic landed on him on a drive to the basket.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Visit the Rockets on Sunday night.\n\n\r\n              Kings: Host the Jazz on Sunday night.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996782.7500942
}