{
  "game_id": "0022400958",
  "espn_id": "401705524",
  "date": "Mar 14, 2025",
  "matchup": "MIA vs. BOS",
  "headline": "Celtics add to Miami's misery, pull away in 4th for a 103-91 win over Heat",
  "body": "MIAMI -- — Jayson Tatum scored 28 points, Jrue Holiday added 25 and the Boston Celtics pulled away in the fourth quarter to beat the freefalling Miami Heat 103-91 on Friday night.\n\n\r\n              Derrick White added 18 for Boston, which made 19 3-pointers. The Celtics outscored Miami 25-14 in the fourth quarter and their victory, combined with Atlanta's loss to the Clippers, clinched a playoff spot for the defending NBA champions.\n\n\r\n              The Heat, who dropped their sixth straight and fell a season-low eight games below .500, got 23 points from Andrew Wiggins, 19 from Tyler Herro and 13 from Jaime Jaquez Jr.\n\n\r\n              Miami has scored 89, 85 and now 91 points in its three games against Boston this season — all double-figure losses — and just finished off a winless homestand of five games or more for the first time in team history.\n\n\r\n              It was the fourth time this season Miami managed 14 points or less in a fourth quarter. The Heat are 0-4 in those games.\n\n\r\n              Takeaways\r\n              Celtics: Jaylen Brown (right knee) and Kristaps Porzingis (viral illness) sat out for Boston. Since the All-Star break Brown has followed the same script of games — play three, then sit one. He's now done that three times since Feb. 20.\n\n\r\n              Heat: Miami used a new starting lineup with Duncan Robinson in for Davion Mitchell and Jaquez in for Kel'el Ware, those two joining Wiggins, Herro and Bam Adebayo. That fivesome had not played a second together this season entering Friday.\n\n\r\n              Key moment\r\n              Boston went on a 10-0 run early in the fourth, turning a one-point deficit into a nine-point lead with 9:19 left.\n\n\r\n              Key stat\r\n              Boston made four 3s in the first 2:27. The last time Boston got to four 3s faster to start a game was a playoff contest at Philadelphia on May 5, 2023 — getting there 2:25 into that matchup.\n\n\r\n              Up next\r\n              A back-to-back awaits both Saturday, with Boston at Brooklyn and Miami at Memphis.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998286.644028
}