{
  "game_id": "0022300666",
  "espn_id": "401585294",
  "date": "Jan 29, 2024",
  "matchup": "ORL @ DAL",
  "headline": "Luka Doncic and Tim Hardaway Jr. lead the Mavericks past the Magic 131-129",
  "body": "DALLAS -- — Luka Doncic had 45 points and 15 assists and Tim Hardaway Jr. added 36 points as the Dallas Mavericks beat the Orlando Magic 131-129 on Monday night.\n\n\r\n              The duo accounted for 54 of Dallas’ 70 points in the second half, including 27 of 35 points in the fourth quarter, when there were 10 of the game’s 13 lead changes.\n\n\r\n              Dallas shot a season-best 62.3% from the floor, 64.7% during the second half.\n\n\r\n              The Magic led 77-61 at halftime, four points short of the franchise record for points in a first half, before Dallas went on a 31-9 run — in part by going to zone defense — and led 96-89 going to the final period.\n\n\r\n              “They did a phenomenal job in the first half reading our scouting report,” Hardaway said. “All we did was go in at halftime, talk through it and came back out and set the tone and got the win.\"\n\n\r\n              Mavericks coach Jason Kidd agreed.\n\n\r\n              “We had a great conversation at halftime,” Kidd said. “Luka was Luka. We solved some of the problems.”\n\n\r\n              Dereck Lively II had 20 points and 11 rebounds, and Jalen Hardy scored 18 of his season-high 20 points in the first half for the Mavericks.\n\n\r\n              Doncic, who scored a franchise-record 73 points on Friday at Atlanta and had a 28-point game in a loss to Sacramento on Saturday, played 43 minutes — his third consecutive game with at least 43 minutes — and was in the entire second half.\n\n\r\n              Paolo Banchero scored 36 points to lead the Magic, who split a back-to-back after beating Phoenix on Sunday at home.\n\n\r\n              Franz Wagner scored 21 points and rookie Anthony Black, who starred for multiple high schools in the Dallas area before playing one season at Arkansas, scored 20 off the bench for the Magic.\n\n\r\n              The Magic led 119-118 with 2:23 to play after being outscored 35-12 in the third quarter before Dallas went ahead for good by scoring four straight points on free throws. Cole Anthony fouled Lively under Dallas’ basket and Wendell Carter Jr. was called for a flagrant foul on Lively after the whistle. Lively hit two of four free throws and, on the Mavericks’ subsequent possession, Hardaway was fouled on a baseline drive and sank both free throws for a 122-119 lead.\n\n\r\n              With the Magic trailing by three points, Banchero went to the line with 3.6 seconds left. After hitting the first free throw, Banchero fired a shot off the front of the rim and the ball caromed well past the free-throw line. Wagner recovered the loose ball near midcourt, and his heave from about 33 feet clanged off the rim.\n\n\r\n              “It was just a back-and-forth game, especially in the fourth quarter,” Banchero said. “You’ve got to take a lesson with every loss.”\n\n\r\n              The Mavericks were missing eight-time all-star Kyrie Irving and starters Derrick Jones Jr. and Dante Exum. Irving missed his fourth consecutive game with a thumb injury.\n\n\r\n              The Magic played without Markelle Fultz, who has rested during the second games of back-to-back sets since returning in early January after missing 27 games with knee tendinitis.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At San Antonio on Wednesday.\n\n\r\n              Mavericks: At Minnesota on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995699.875802
}