{
  "game_id": "0022300533",
  "espn_id": "401585161",
  "date": "Jan 12, 2024",
  "matchup": "IND @ ATL",
  "headline": "Pacers overcome Haliburton's absence to beat Hawks 126-108",
  "body": "ATLANTA -- — Buddy Hield and Obi Toppin each scored 18 points and the Indiana Pacers overcame star Tyrese Haliburton's absence with balanced scoring, beating Atlanta 126-108 on Friday night to continue their season dominance over the Hawks.\n\n\r\n              Indiana scored at least 150 points while winning each of its first two games of the season against Atlanta, including a 150-116 rout on Jan. 5 at Indianapolis. Due to those two games, Pacers coach Rick Carlisle was braced for a “haymaker” from the Hawks.\n\n\r\n              Instead, the Pacers were dominant again even without Haliburton en route to their third straight victory. Indiana, fourth in the Eastern Conference, has won nine of its last 10.\n\n\r\n              Haliburton, the NBA assists leader, missed his second straight game because of a strained left hamstring.\n\n\r\n              “Two wins without Tyrese, that's really important,” Carlisle said.\n\n\r\n              Bennedict Mathurin added 15 points for Indiana, which had eight players in double figures. The Pacers shot a season-high 67.1% from the field, making 53 of 79 shots and had a 44-28 rebounding advantage. T.J. McConnell had a season-high 14 assists.\n\n\r\n              The Pacers had 41 assists.\n\n\r\n              “I think that's our MO, really, on offense,” said Andrew Nembhard, who had 10 points and seven assists. Nembhard said the ability “to have a lot of guys score some points, we get to be ourselves.”\n\n\r\n              The Pacers outscored the Hawks 76-48 in the paint.\n\n\r\n              “One of the things we do is score in the paint,” Nembhard said.\n\n\r\n              Atlanta coach Quin Snyder described the inability to defend near the basket as “the most glaring thing” in the loss.\n\n\r\n              The Pacers made 63.8% of their shots in the Jan. 5 runaway win, which was then the highest percentage allowed by the Hawks this season. Indiana topped that mark Friday.\n\n\r\n              “I'm not a big stats guy,” Carlisle said. “It's what you're feeling from the vibe of the group. Right now we really understand everyone in that room.”\n\n\r\n              Dejounte Murray, the subject of NBA trade deadline speculation, led the Hawks with 29 points. Saddiq Bey had 17 and Jalen Johnson added 16. \n\n\r\n              Atlanta’s Trae Young, second in the All-Star voting behind Haliburton among Eastern Conference guards, had 13 points and six assists. He was 4 of 17 shots from the field.\n\n\r\n              “He's a great player and we're giving him a lot of attention,” Carlisle said about Young. “He had some looks that he normally makes that didn't go in. ... He's one of the real surgeons in our game offensively. He can dice you up so many ways.”\n\n\r\n              Young and Bogdan Bogdanovic, who had 10 points, became the first teammates to each make their 1,000th career 3-pointer in the same game.\n\n\r\n              After leading 68-62 at halftime, the Pacers outscored the Hawks 31-19 in the third period.\n\n\r\n              “The third quarter was tremendous to create separation that we needed,” Carlisle said.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Denver on Sunday.\n\n\r\n              Hawks: Host Washington on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996195.979817
}