{
  "game_id": "0022200980",
  "espn_id": "401469135",
  "date": "Mar 07, 2023",
  "matchup": "MIN vs. PHI",
  "headline": "Embiid scores 39; Harden-less 76ers beat Wolves 117-94",
  "body": "MINNEAPOLIS -- — Joel Embiid scored 39 points, Tyrese Maxey added 27 and the Philadelphia 76ers beat the Minnesota Timberwolves 117-94 on Tuesday night, despite playing without star James Harden.\n\n\r\n              Harden, the team’s second-leading scorer and NBA assist leader, was held out with left foot soreness. Embiid made up for Harden’s absence, scoring 22 points in the third quarter as Philadelphia pulled away and wrapped up its five-game road trip with a 4-1 mark.\n\n\r\n              “I take pride every single time I step on the floor, no matter who’s guarding, I feel like I’m unguardable,” Embiid said. “I want to show them that it’s not that easy to guard me.”\n\n\r\n              De’Anthony Melton scored 11 for the 76ers, who recovered from a slow start on the second night of a back-to-back.\n\n\r\n              Anthony Edwards scored 32 points for Minnesota, which returned home following a 3-1 West Coast trip. The Timberwolves shot a season-low 39.5% from the field and were 11 of 36 from 3-point distance.\n\n\r\n              “We’ve been hitting shots,” Edwards said. “We’ve been shooting great from the 3-ball. Nights like this are bound to happen. You got to get over it, look to the next game. Hopefully, we’re back to ourselves.”\n\n\r\n              Philadelphia’s defense had allowed at least 126 points in three previous games, and gave up 143 in a win against Indiana a night earlier.\n\n\r\n              But the 76ers, who entered the game eighth in the league in defensive rating, harassed Edwards and Minnesota.\n\n\r\n              “We just kept guys in front of us,” Philadelphia coach Doc Rivers said. “I think, what are they, third or fourth in the league in the paint and we kept them out of the paint, and I thought that was the difference in the game for us.”\n\n\r\n              The 76ers opened the day four games behind Milwaukee and two behind Boston in the Eastern Conference.\n\n\r\n              Embiid and lock-down defense was a good formula Tuesday, even without Harden.\n\n\r\n              Philadelphia ended the first half on a 27-9 run for a 58-45 lead, and pushed the advantage to as many as 28 points in the second half.\n\n\r\n              “We were pretty good. Nothing else to say,” Embiid said of the team’s defense. “When you’re able to stop the ball, you can be a good defensive team. Last night, we couldn’t stop the ball.”\n\n\r\n              The Wolves, who came back for wins against the Los Angeles Clippers, Lakers and Sacramento Kings to end the road trip and boost their playoff chances, started the day sixth in the Western Conference. The first game back at home was one of their worst offensive performances of the season.\n\n\r\n              “Shot selection, I thought, in the second quarter was poor,” Minnesota coach Chris Finch said. “And then when we did get shots, we couldn’t knock one down. I thought we played slow. We played the game at their speed most of the night. We talked about wanting to play with a lot more pace than we did.”\n\n\r\n              ROAD WARRIORS\n\n\r\n              Finishing the road trip with three straight wins, Philadelphia now has 19 road wins this season, which is fourth in the league. The 76ers are 19-12 on the road. After two upcoming home games, they have seven of eight on the road.\n\n\r\n              “We’re road warriors,” Maxey said. “We always pack our attitude, pack our defense and pack our will on the road. It’s good for us. We know we can do it at home with Wells Fargo (Center) behind us and South Philly behind us, but you got to be able to win road games in the playoffs.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: Tobias Harris (left calf contusion) and P.J. Tucker (back spasms) returned to the starting lineup after missing Monday’s game. Harris had 10 points and a team-high 14 rebounds. … Embiid was 4 for 4 from 3-point distance and 13 of 22 overall before sitting out the fourth.\n\n\r\n              Timberwolves: Jaylen Nowell missed his fifth straight game with left knee tendinopathy. … Mike Conley, the team’s key pickup at the trade deadline, was 1 of 6 from the field and had six points and three assists in 24 minutes. ... Edwards scored 15 points in the first quarter.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Portland on Friday.\n\n\r\n              Timberwolves: Host Brooklyn on Friday. ------",
  "source": "espn_api",
  "crawled_at": 1764995016.089888
}