{
  "game_id": "0021600390",
  "espn_id": "400899832",
  "date": "Dec 16, 2016",
  "matchup": "ORL vs. BKN",
  "headline": "Fournier takes over late as Magic beat Nets 118-111",
  "body": "ORLANDO, Fla. --  Evan Fournier seemed oblivious to the trash talk and choice words Brooklyn Nets newcomer Sean Kilpatrick sent his way in the final 3 minutes Friday night.\n\nInstead of firing back with nothing more than his mouth, the Orlando guard silenced Kilpatrick with a dominant performance down the stretch. Fournier scored 11 straight points -- hitting all eight of his free throws and a clutch 3-pointer -- as the Magic beat Brooklyn 118-111 to snap their six-game home losing streak.\n\n\"It's part of the game. I love it. I really love the trash talking,\" said Fournier, who finished with 21 points. \"I'm usually not the one starting it, but when it's on it's on.\"\n\nFournier's outburst broke open a game that was tied at 106. He converted four consecutive free throws and then drained a 3-pointer that gave Orlando a 113-108 lead with 1:53 remaining.\n\nIt was a remarkable finish considering Fournier's early struggles, which led to a brief benching in the third quarter.\n\n\"He's done that before, where hasn't been shooting the basketball well but still has the confidence to hit big shots down the stretch,\" Magic coach Frank Vogel said. \"As long as he is making the right reads -- when he makes the right reads he shoots a remarkable 3-point percentage. He is a big reason why we pulled away with the victory.\"\n\nIn a game that was close throughout, the Magic came up with key baskets and big stops down the stretch. The Nets had no offense outside of point guard Jeremy Lin during the final 3 minutes.\n\nOrlando, meanwhile, received key contributions from its big men, with Serge Ibaka, Bismack Biyombo and Nikola Vucevic combining for 11 blocked shots. The trio also was important in giving the Magic several second-shot opportunities. The Magic outscored the Nets 10-4 on second-chance points as a result of 13 offensive rebounds.\n\n\"They absolutely have an athletic group and we knew they were committed to crashing the glass beforehand,\" said Nets center Brook Lopez, who had 22 points and five blocked shots. \"They went out and did it. Maybe we need to recommit.\"\n\nNET GAIN\n\nVucevic seems to save some of his best performances for Lopez and the Nets.\n\nFriday night was certainly no different. After missing three games with a back injury, Vucevic had 21 points, 10 rebounds and a big blocked shot off the bench against Lopez.\n\n\"I think we both play really well against each other. I think we both just enjoy going against each other. You get fired up for a matchup like that,\" he said.\n\nGETTING TECHNICAL\n\nThe third quarter featured five technical fouls, four on the Magic and one on Nets coach Kenny Atkinson.\n\nBut going into the fourth, Vogel let his players know it was time to get their heads back in the game.\n\n\"I told everybody to stop getting techs,\" said Vogel, assessed one of the technicals himself for arguing a no-call. \"We said our peace. We didn't like what we were seeing. We said our peace and move on.\"\n\nTIP-INS\n\nNets: Lin returned to the lineup after missing Wednesday's game due to lower back tightness. He scored 17 points on 7-of-13 shooting. ... The Nets are 1-11 on the road this season.\n\nMagic: Orlando has assigned rookie center Stephen Zimmerman and guard C.J. Wilcox to the Erie BayHawks of the NBA Development League. ... The Magic are 5-9 at home.\n\nUP NEXT\n\nNets: At the Philadelphia 76ers on Sunday.\n\nMagic: Host the Toronto Raptors on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995862.650929
}