{
  "game_id": "0022300162",
  "espn_id": "401584790",
  "date": "Nov 08, 2023",
  "matchup": "CHI vs. PHX",
  "headline": "Suns outlast Bulls 116-115 in OT in Bradley Beal's season debut",
  "body": "CHICAGO -- — Jusuf Nurkic powered to the basket for a layup with 7.3 seconds left in overtime and Phoenix outlasted the Chicago Bulls 116-115 on Wednesday night in Bradley Beal's Suns debut.\n\n\r\n              Grayson Allen scored 26 points, hitting a career-high eight 3-pointers, and Kevin Durant added 25 points to help the Suns improve to 4-4 with their second straight straight victory. \n\n\r\n              “I was just proud of our guys,” Phoenix coach Frank Vogel said. “We got down in the the overtime and could have given up on the game or lost confidence, but we stayed the course.”\n\n\r\n              DeMar DeRozan's jumper with 1:18 left in OT put Chicago ahead 115-111 in a physical contest. But Keita Bates-Diop hit a 3 just 12 seconds later before Nurkic put Phoenix ahead for good.\n\n\r\n              Nurkic scored 20 points and had 16 rebounds and eight assists.\n\n\r\n              “I was just tired of making mistakes in certain ways, like turnovers,” said Nurkic, who surrendered the ball six times to Chicago's aggressive defenders. “And like, `Let me go finish.' And it turned out well.”\n\n\r\n              Nurkic failed to ice it with a pair of free throws with 0.4 seconds left — missing the first, then missing the rim on the second when he was trying to miss.\n\n\r\n              Beal had 13 points after sitting out the first seven games of the season because of a back injury. Acquired from Washington in June, the three-time All-Star guard played 23:33. The Suns still await Devin Booker’s return from a calf injury.\n\n\r\n              “He was good in stretches and you could tell he was a little bit rusty in stretches, which was to be expected,” Vogel said. “A difficult opponent.”\n\n\r\n              Vogel said the team determined before the game that Beal wouldn't play in an overtime.\n\n\r\n              Beal said he was frustrated, but added, “I'm glad we pulled out the win. That's why we have a great team with a lot of depth.”\n\n\r\n              Nikola Vucevic scored 26 points for Chicago, which used a pair of gritty comebacks to make it a contest. Zach LaVine and DeRozan each had 22, and Alex Caruso came of the bench to add 19.\n\n\r\n              Caruso, known for his defense, hit four point of five 3-point attempts.\n\n\r\n              “It's what I get paid to do,” Caruso said. “I'm a helluva defensive player and I think I've taken strides offensively to be a really good player on that end.”\n\n\r\n              Allen scored 17 points in the second half, but Phoenix never could take charge.\n\n\r\n              DeRozan tied it at 107 on a layup with 15 seconds left as the Bulls pushed back to set up a wild finish and send it to OT. Durant missed on a last-second shot in regulation as he was defended by Caruso. \n\n\r\n              The Bulls used a 16-0 run late in the third an early in the fourth quarter to take a 92-88 lead, capped by Jevon Carter's 3-point jumper 1:16 into the fourth. \n\n\r\n              The Bulls fought back from an early 18-point deficit to tie it 57 at halftime.\n\n\r\n              “They came out a lot more aggressive than us,” LaVine said. “We were able to fight back, but obviously you don't want to start that way.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host the Los Angeles Lakers on Friday night in an NBA In-Season Tournament game.\n\n\r\n              Bulls: Host Detroit on Sunday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995918.341256
}