{
  "game_id": "0022201215",
  "espn_id": "401469370",
  "date": "Apr 08, 2023",
  "matchup": "LAC vs. POR",
  "headline": "Clippers beat Blazers to bolster hopes of avoiding play-in",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 27 points, Norman Powell added 23 and the Los Angeles Clippers solidified their hopes of avoiding the play-in game with a 136-125 victory over the Portland Trail Blazers on Saturday.\n\n\r\n              Russell Westbrook had 20 points for the Clippers, who have won four of their last six and hold the fifth spot in the Western Conference.\n\n\r\n              Wins by LA and Minnesota on Saturday ensured the Clippers can finish no lower than seventh. Their best hope of avoiding the play-in game though is beating Phoenix on Sunday in what could be a preview of a first-round series.\n\n\r\n              While the Suns are expected to sit most of their starters, which they also did Friday night against the Los Angeles Lakers, coach Tyronn Lue said he will play everyone that he can.\n\n\r\n              “I hope they sit all five guys. I’ll take it however I can get it,” Lue said. “My main focus is doing what we have to do to get into the playoffs. It doesn't matter what seed.”\n\n\r\n              The Clippers need a win in the final regular-season game to avoid landing in the play-in for the second straight season. They were the eighth seed last season and lost to Minnesota and New Orleans to miss the playoffs.\n\n\r\n              “We have to win. That’s the focus,” Leonard said.\n\n\r\n              The Clippers would be assured of a top six seed if the Timberwolves beat the Pelicans on Sunday afternoon. A win would wrap up the fifth seed while a loss and Golden State win would drop them to sixth.\n\n\r\n              However, if the Pelicans win, the Clippers could fall into the seventh spot and host the play-in game on Tuesday with a loss. The only way they would avoid it in that scenario is if Portland beat Golden State and the Lakers defeated Utah.\n\n\r\n              “The parity in the West is incredible this year. I’ve seen some tough races, but this may be the toughest I’ve seen. Just all the way down to today and tomorrow, guys need to win. It’s some tough situations,\" Portland coach Chauncey Billups said. \"I hate that we are not participating in it, but there’s been a lot of learning experiences this year because of that.”\n\n\r\n              Kevin Knox II had 30 points, Shaedon Sharpe 26 and Trendon Watford 24 for the Trail Blazers, who have dropped three straight and eight of their last nine.\n\n\r\n              “We played against a very desperate team. they are fighting and clawing for every win and they need it,” Portland coach Chauncey Billups said. “Our group came out and got it going. They made some adjustments in the second half when they needed to.”\n\n\r\n              Portland led 70-64 at halftime before the Clippers went on a 14-2 run early in the third quarter to gain control. \n\n\r\n              The Trail Blazers rallied to get within 86-85 on a 3-pointer by Knox before the Clippers put it away for good with a 23-7 spurt.\n\n\r\n              Leonard had 13 points in the third quarter as the Clippers were 15 of 24 from the field, including eight 3-pointers.\n\n\r\n              “It wasn’t a great first half because we didn’t play the right way. That’s why they came out and played like they did in the third quarter,” Lue said.\n\n\r\n              Los Angeles' largest lead was 19 in the fourth quarter.\n\n\r\n              TIP INS\n\n\r\n              Trail Blazers: In the first half, Sharpe had 21 points on 8-for-12 shooting; while Watford added 18 while going 7 of 9. ... Shaquille Harrison had a career-high 11 assists.\n\n\r\n              Clippers: Ivica Zubac had 14 points and 10 rebounds for his 27th double-double, which is new career high in a season.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host Golden State Sunday in the season finale.\n\n\r\n              Clippers: Travel to Phoenix Sunday in what could be a first-round preview.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994946.050403
}