{
  "game_id": "0022200924",
  "espn_id": "401469079",
  "date": "Feb 28, 2023",
  "matchup": "MIL @ BKN",
  "headline": "Giannis returns, Bucks beat Nets 118-104 for 15th straight",
  "body": "NEW YORK -- — Giannis Antetokounmpo had 33 points and 15 rebounds, and the Milwaukee Bucks extended their winning streak to 15 games by beating the Brooklyn Nets 118-104 on Tuesday night.\n\n\r\n              Jrue Holiday had 14 points and eight assists for the Bucks, who went 10-0 in February and have passed the Boston Celtics for the best record in the NBA. They got Antetokounmpo back after he missed their home victory over Phoenix on Sunday with a bruised right quadriceps.\n\n\r\n              Brook Lopez added 13 points and 10 rebounds, and Khris Middleton had 18 points off the bench. Milwaukee held Brooklyn to 42 second-half points, dealing the Nets their third straight loss and seventh in their past nine games.\n\n\r\n              “I think the players adjusted,” Bucks coach Mike Budenholzer said. “The challenge for those guys is to make good decisions, good reads and more often than not they’re going to do that. We didn’t in the first half, but you know, those guys figured it out.”\n\n\r\n              Mikal Bridges led Brooklyn with 31 points. Spencer Dinwiddie had 26 points and eight assists, and Cam Johnson added 19 points and seven rebounds.\n\n\r\n              “Our approach at the beginning of the game was really good. We gave ourselves a chance at halftime,” Nets coach Jacque Vaughn said. “We’ve got to be able to sustain it.”\n\n\r\n              Trailing by 10 at halftime, the Bucks outscored the Nets 66-42 in the second half, using a 14-4 third-quarter run to pull even at 68. Bridges answered Milwaukee’s run with his own personal 10-0 spurt, but the Bucks outscored the Nets 39-23 in the third, including 18-7 over the final 5:04 after Antetokounmpo went to the bench after picking up his fourth foul.\n\n\r\n              “I think we went 12-2 to start, and then they went back on a 10-0 run, and it felt like it was back to a 10-point game,” Budenholzer said. “The guys, to go on that run to finish the quarter (was) impressive.”\n\n\r\n              Then the Bucks, who rank No. 1 in the NBA in defensive rating and fourth in the league by allowing 111.2 points per game, turned up the defense in the fourth. Brooklyn was just 7 of 23 in the fourth, missing nine straight over a span of 4:23.\n\n\r\n              “I think we did a good job of trying to take (3-pointers) away from them as best as possible,” Holiday said. “Because we play defense so well, that kind of propelled our offense.”\n\n\r\n              Bridges said the Nets “just weren’t there” late in the game. \n\n\r\n              “We weren’t in our shifts and transitions, not getting back as hard and then Giannis got it going, got to the line, got the and-one and dunking and got them going,” Bridges said.\n\n\r\n              Brooklyn was aggressive against Antetokounmpo and the Milwaukee offense early, forcing seven first-quarter turnovers and 12 in the first half. Antetokounmpo had the same number of field goals and turnovers in the first quarter (2), and the Nets turned that defense into offense, using a 17-2 run to build a 15-point advantage. \n\n\r\n              “I think we were competing, but we weren’t competing hard enough,” Antetokounmpo said. “Sometimes when you play teams like (Brooklyn), they force turnovers and get wide-open 3s.”\n\n\r\n              Bridges had 18 points, Johnson had 15 and six rebounds and Dinwiddie scored 13 and had six assists in the first half, helping Brooklyn take a 62-52 lead at halftime.\n\n\r\n              TIP-INS Bucks: Made just 4 of 12 free throws (33.3%). … Milwaukee’s win streak is the longest in the NBA this season and the fourth-longest in team history. Brooklyn has the second-longest win streak this season (12, Dec. 7-Jan. 2).\n\n\r\n              Nets: Forward Ben Simmons (left knee soreness) missed his third straight game, and guard Edmond Sumner (personal) and forward Yuta Watanabe (back tightness) were also unavailable.\n\n\r\n              UP NEXT Milwaukee: Host Orlando on Wednesday Brooklyn: At Knicks on Wednesday",
  "source": "espn_api",
  "crawled_at": 1764994562.7106
}