{
  "game_id": "0022300904",
  "espn_id": "401585532",
  "date": "Mar 07, 2024",
  "matchup": "MIA @ DAL",
  "headline": "Luka Doncic records fifth consecutive 30-point triple-double in Mavs' 114-108 win over Heat",
  "body": "DALLAS -- — Luka Doncic had 35 points, 11 rebounds and 11 assists to become the second NBA player to record five consecutive 30-point triple-doubles, and the Dallas Mavericks rallied past the Miami Heat 114-108 on Thursday night.\n\n\r\n              Doncic matched Russell Westbrook, who had five consecutive 30-point triple-doubles in 2017 for Oklahoma City. The All-Star, who leads the league in scoring, also became the first player in history with four straight 35-point triple-doubles.\n\n\r\n              This was the first of those games that Dallas won, however. The Mavericks snapped a three-game skid.\n\n\r\n              “It’s great, especially when it comes with a win,” Doncic said.\n\n\r\n              Doncic shot 12 of 24 overall and 7 of 13 on 3-pointers in 40 minutes.\n\n\r\n              “I’ve always said we can’t take that young man for granted,” Mavericks coach Jason Kidd said. “You’re seeing something as rare as a Picasso.”\n\n\r\n              Kyrie Irving added 23 points for Dallas. The Mavericks trailed 101-100 before a 10-4 run that included 3-pointers by Doncic, Dante Exum and Irving.\n\n\r\n              Exum began the run with a 3 that just beat the shot clock. Doncic’s turnaround, step-back 3 also barely beat the buzzer after a wild scramble for the ball. After Terry Rozier hit from deep to pull Miami within 106-104, Irving made his 3 after a missed Dallas shot was touched by multiple players.\n\n\r\n              “The 3 (by Doncic) with no time on the shot clock — everybody just knows he was going to make it,” Kidd said. “But that doesn’t happen for everybody.”\n\n\r\n              Doncic said he saw the rim “a little bit” as he released the ball. “Once I let it go, I knew it was going in,” he said.\n\n\r\n              “Doncic — I’ve seen that play a lot at the buzzer,” Heat coach Erik Spoelstra said. “And Irving hit one as well on a three-yards-and-a-cloud-of-dust on a rebound, kind of bobbled, tipped, and, of course, it ended up in his hands wide open. And that just kind of gave them a little more separation.”\n\n\r\n              Rozier had 27 points and 11 assists, his highest-scoring game since being acquired from Charlotte in late January. Duncan Robinson, making a sixth straight start in place of the injured Tyler Herro, scored 19 points, 14 in the first half, and Jimmy Butler finished with 14.\n\n\r\n              The Heat were 17 of 38 on 3-pointers, hitting 10 in the first half, after coming in averaging 12.4 per game. Rozier and Robinson were each 5 of 8 behind the arc.\n\n\r\n              Miami came in having won seven of eight.\n\n\r\n              Butler extended his streak of games with at least one steal and one 3-pointer to 15, the longest of his career and tying the franchise record set by Rafer Alston in 2004.\n\n\r\n              Miami reserve forward Kevin Love missed his fourth straight game with a heel injury.\n\n\r\n              The Heat announced that reserve guard Josh Richardson will miss the rest of the season because of a shoulder injury that sidelined him beginning Feb. 11.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Complete a back-to-back at Oklahoma City on Friday.\n\n\r\n              Mavericks: At Detroit on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995339.852024
}