{
  "game_id": "0021600867",
  "espn_id": "400900273",
  "date": "Feb 25, 2017",
  "matchup": "ORL vs. ATL",
  "headline": "Ross provides spark for Magic in 105-86 win over Hawks",
  "body": "ORLANDO, Fla. --  In the last week, the Orlando Magic have undergone a dramatic shift.\n\nOnly Terrence Ross is new, but his presence has allowed coach Frank Vogel to move players to their more natural position and to play at a faster pace. The new-look Magic offered a glimpse of how potent they can be during a 105-86 win over the Atlanta Hawks on Saturday night.\n\nWith Aaron Gordon back at power forward, Evan Fournier shifting to small forward and Ross inserted at shooting guard, the Magic upped the tempo and took advantage of defensive mismatches while dominating a top five Eastern Conference team.\n\n\"Earlier in the season, we were trying to play too big, and we were too slow at multiple positions and it was costly early on,\" said Vogel, whose team snapped a two-game skid. \"I like where guys are at right now in terms of their roles.\"\n\nWhile Gordon had his moments at small forward this season, his superior speed and quickness was a difference maker Saturday. He consistently drove to the basket on Paul Millsap, scoring 18 points on 7-of-11 shooting and 4-of-4 shooting from the free-throw line.\n\nRoss was the real catalyst in just his second game since coming over from Toronto in last week's trade for Serge Ibaka. Acquired to give the Magic better shooting, Ross knocked down big shots on the perimeter and in the lane on the way to a game-high 24 points.\n\nRoss looked far more comfortable Saturday than he did in his Orlando debut Thursday night, when he scored 13 points on 4-of-17 shooting.\n\n\"The first game is kind of unexpected, you don't know what to expect when you're playing,\" said Ross, who hit 10 of 15 from the field and 4 of 7 from 3-point range against the Hawks. \"The second game, I kind of felt more comfortable with the plays and the tendencies of the other players. So it was a little easier tonight.\"\n\nIn addition to Ross and Gordon, the Magic also received big contributions from Nikola Vucevic and embattled point guard Elfrid Payton. Vucevic had 16 points and 14 rebounds, while Payton was just shy of his fourth career triple-double with 15 points, nine assists and nine rebounds in three quarters. He also had just one turnover.\n\nThe Hawks lost their third straight game. They had a brief nine-point lead in the second quarter, but then allowed a three-point halftime deficit to grow to 24 points in the second half.\n\nTim Hardaway Jr. led five Hawks in double figures with 15 points, while Dwight Howard added 11 points and 14 rebounds but picked up four fouls in the first half.\n\n\"We're just now playing well on defense, not playing very offensively,\" coach Mike Budenholzer said. \"Coaching, all of us collectively need to find a way to be better, and it's important that it starts quickly.\"\n\nTIP-INS\n\nHawks: Point guard Dennis Schroder returned to the court Saturday after serving a one-game suspension for not reporting back from the All-Star break on time. He was late to the team bus, though, so he did not start. Malcolm Delaney started in his place at point guard.\n\nMagic: Vucevic had a double-double by halftime with 10 points and 12 rebounds. He now has a team-high 27 double-doubles on the season and 185 career double-doubles.\n\nAIR GORDON\n\nGordon, who struggled with his perimeter shot at small forward, used his athleticism to get to the rim for big dunks Saturday night.\n\n\"He is a tremendously and athletically gifted,\" Ross said. \"He can really score and his athleticism is a big factor and he uses it to his advantage.\"\n\nUP NEXT\n\nHawks: Travel to face Boston on Monday.\n\nMagic: Host the New York Knicks on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995829.579005
}