{
  "game_id": "0021800898",
  "espn_id": "401071571",
  "date": "Feb 25, 2019",
  "matchup": "CLE vs. POR",
  "headline": "Trail Blazers hold off Cavaliers' rally for 123-110 win",
  "body": "CLEVELAND --  CJ McCollum and Damian Lillard made sure Portland didn't turn an easy win into a crushing loss.\n\nMcCollum scored 35 points, including 11 in the fourth quarter, and Lillard hit two crucial 3-pointers down the stretch as the Trail Blazers hung on to defeat the Cleveland Cavaliers 123-110 on Monday night.\n\nThe Blazers led 71-48 at halftime, but needed a 14-0 run late in the fourth quarter to finally put away a game that looked like a rout in the first half.\n\nMcCollum finished the night hitting 12 of 18 shots, including 7 of 8 3-pointers. Lillard scored eight of his 21 points in the final period.\n\nMcCollum, a native of Canton, Ohio, played in front of a large contingent of family and friends.\n\n\"I had about 60-100 people here,\" he said. \"They spent a lot of money on tickets and drove in for the game, so I figured I had to give them something tonight.\"\n\n\"CJ carried us on the offensive end,\" Lillard said. \"We tried to just keep that rolling because it seemed like he was making every shot. When a scorer gets in that rhythm, it's important not to cool him off.\"\n\nCleveland cut the lead to 88-84 going into the fourth and was behind 105-102 with 4:42 left, but Portland's backcourt duo took over from there.\n\nCleveland coach Larry Drew was asked about the pair before the game. His words turned out to be hauntingly accurate for the Cavaliers.\n\n\"They can change a game,\" he said. \"They can make big shots. Either guy can have not a big night, but a huge night. They're going to score. They're just that good.\"\n\nCedi Osman scored 27 points for the Cavaliers, who were attempting to win three straight for the first time this season. Kevin Love, playing his fifth game since returning from foot surgery, had 18 points and 12 rebounds in 28 minutes.\n\nThe Blazers, coming off road wins over playoff contenders Brooklyn and Philadelphia, seemed to be on their way to a comfortable win against the Cavaliers, who have the league's third-worst record.\n\nPortland scored the game's first 14 points and continued to pour it on in the second quarter. Cleveland rallied in the third, and Matthew Dellavedova's 3-pointer with a second left cut the lead to 88-84.\n\n\"We were saying how it didn't feel like a double-digit loss,\" Love said. \"It just got away from us a little bit there at the end.\"\n\nCleveland appeared to tie the game early in the fourth, but Larry Nance Jr.'s 3-pointer was waved off after the Blazers were charged with a common foul on a screen set by Dellavedova.\n\nSeth Curry hit all five 3-point attempts and finished with 15 points for Portland, which is in fourth place in the Western Conference.\n\nTIP-INS\n\nTrail Blazers: McCollum had his jersey retired Sunday at Lehigh, where he starred in college. ... Portland is 13-15 on the road. ... F Evan Turner (left knee) missed his second game in a row.\n\nCavaliers: Jordan Clarkson scored 19 points. ... Rookie guard Collin Sexton scored 11 points. He was 3 of 14 from the field and had one assist. ... Love was the only starter to score in the first quarter. He was 5 of 14 from the field for the game.\n\nLESSON LEARNED\n\nThe Blazers weren't pleased about letting the Cavaliers back into the game\n\n\"In the first half we tried to set the tone,\" Lillard said. \"In the second half we took for granted all of the things we were doing to get out front.\"\n\n\"Obviously the first half was fun to watch,\" coach Terry Stotts said. \"In the second half they played harder than us. But I like the way we finished.\"\n\nNOT YET\n\nDrew said forward Tristan Thompson hasn't been cleared to go through a full-court practice with contact and won't return until he does.\n\n\"If he passes that test he'll be deemed ready to play,\" Drew said. \"That has to happen.\"\n\nThompson missed his 16th straight game with a sore left foot and has been out for a total of 26 games because of the injury.\n\nUP NEXT\n\nTrail Blazers: Visit Boston on Wednesday.\n\nCavaliers: Visit New York on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994749.531344
}