{
  "game_id": "0022300093",
  "espn_id": "401584721",
  "date": "Oct 28, 2023",
  "matchup": "MIN vs. MIA",
  "headline": "Naz Reid leads Timberwolves in 106-90 takedown of short-handed Heat in home opener",
  "body": "MINNEAPOLIS -- — Naz Reid relished the roar from the Minnesota crowd roar during introductions and the fast chant of his name late in the game, further affirmation he's in the right place even though he comes off the bench. \n\n\r\n              Reid scored 25 points on 10-for-14 shooting in 28 minutes, sparking the Timberwolves to a 106-90 victory in their home opener over the short-handed Miami Heat on Saturday.\n\n\r\n              “Each and every year, I’ve gotten better so there was definitely no reason for me to leave, you know?” said Reid, who signed a three-year, $42 million contract to return in a backup role to Rudy Gobert and Karl-Anthony Towns. \"I appreciate all the love.”\n\n\r\n              Anthony Edwards finished with 19 points after a late flurry for the Wolves (1-1), who outscored the Heat 24-4 over a 7:45 stretch in the fourth quarter that lasted into the final minute.\n\n\r\n              Tyler Herro scored 22 points on 8-for-23 shooting and Bam Adebayo added 19 points for Miami, which played without starting forwards Jimmy Butler (rest) and Kevin Love (bruised left shoulder) on the second half of a back-to-back set of games. \n\n\r\n              “The guys competed really hard, and then you have these moments of truth where it can swing either way,” Heat coach Erik Spoelstra said. “It just turned into an avalanche.”\n\n\r\n              Reid, who became a cult hero last season and routinely gets the loudest cheers at Target Center, had his imprint all over this game. He had eight rebounds and went 4 for 7 from deep. He gave the Wolves their first lead (24-23) with a short jumper. He had more playing time in the fourth quarter than Towns and Gobert combined, hitting back-to-back 3-pointers during an 11-0 spurt.\n\n\r\n              “He’s a tough cover, too. He’s an animal. He’s everywhere,\" Herro said. \"He’s a big that can stretch the floor. He’s also a great offensive rebounder. He can cut, slash and he’s making plays.\"\n\n\r\n              Reid started the run with a layup initially waved off for charging, but the ruling was changed to a foul on Adebayo after a replay review challenge that ignited the crowd and sent the Wolves on their way. \n\n\r\n              “You can see why they valued him to sign him, because he brings a lot of intangibles to what they want to do,\" Spoelstra said. \"He made some big plays down the stretch.”\n\n\r\n              Gobert (14 points, 14 rebounds) and Towns (12 points, 10 rebounds) also played their parts in a dominant performance by the Minnesota big men. The Wolves had a 58-38 advantage in points in the paint.\n\n\r\n              “I'm trying to put my imprint on every game, whether it’s hustling, scoring, rebounds or diving on the floor, whatever the case may be,” Reid said.\n\n\r\n              With three reserves on the injured list, too, the Heat put their last two first-round draft picks, Jaime Jaquez Jr. (2023) and Nikola Jovic (2022), in the starting lineup and let it rip. \n\n\r\n              Herro, who had 28 points in the loss to Boston on Friday, went 4 for 11 from 3-point range. Duncan Robinson was just 2 for 10 from deep, an area of concern for the Heat (1-2) this season beyond Herro following the departure of Max Strus and Gabe Vincent.\n\n\r\n              High hopes for the Wolves yielded to some humility in the opening loss at Toronto, where the ball stopped moving on offense in a familiar problem from the past. They played again without forward Jaden McDaniels, whose strained left calf has so far prevented him from showcasing the $136 million contract extension he signed on the eve of the season.\n\n\r\n              This time the passing was on point, and the defense was even sharper.\n\n\r\n              “We have size. We have guys that can move their feet. We have guys that are dogs, competitors,\" Gobert said. \"Those three things, you put them together, why wouldn’t you want us to be the best defensive team in the league with all those weapons?\"\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Milwaukee on Monday. \n\n\r\n              Timberwolves: At Atlanta on Monday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996503.4579132
}