{
  "game_id": "401810053",
  "espn_id": "401810053",
  "date": "Nov 10, 2025",
  "matchup": "CHA vs LAL",
  "headline": "Doncic scores 38 points as Lakers use strong third quarter to earn 6th win in last 7 games",
  "body": "CHARLOTTE, N.C. -- — Luka Doncic had 38 points, Rui Hachimura scored 13 of his 21 points in a pivotal third quarter and the Los Angeles Lakers pulled away in the second half to beat the Charlotte Hornets 121-111 on Monday night.\n\n\r\n              Austin Reaves added 24 points for the Lakers, who have won six of their past seven games.\n\n\r\n              Miles Bridges had 34 points on seven 3-pointers and rookie Kon Knueppel flirted with his first career triple-double before finishing with 19 points, 10 rebounds and nine assists for the Hornets, who continued to struggle without their top two scorers in LaMelo Ball and Brandon Miller.\n\n\r\n              The Lakers broke open a close game by outscoring the Hornets 31-15 in the third quarter behind Hachimura, who knocked down three 3s with Charlotte focused on blitzing Doncic, the five-time NBA All-Star.\n\n\r\n              Doncic thrilled the crowd with five 3-pointers and some dazzling passes, but even got himself hyped when he drove down the lane for a flying two-handed dunk in which he hung on the rim in traffic.\n\n\r\n              He even flicked the ball from three-quarters and swished it moments after the Lakers called a timeout in the fourth quarter, drawing a roar from the Lakers contingent.\n\n\r\n              Charlotte cut the lead to eight with 4 1/2 minutes left behind Bridges and Knueppel, but Doncic scored on a drive down the right side of the lane and drew a foul to complete a three-point play.\n\n\r\n              Marcus Smart added a dagger 3 with 2 1/2 minutes remaining to put the Lakers up by 14.\n\n\r\n              The Hornets started strong with Bridges scoring 16 points in the first quarter behind four 3s. But the Hornets cooled off in the third quarter, quickly running out of answers on offense while struggling to stop the methodical scoring presence of Doncic.\n\n\r\n              Up next\r\n              Nets: At Oklahoma City on Wednesday night.\n\n\r\n              Hornets: Host Milwaukee on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042595.8068109
}