{
  "game_id": "0021900498",
  "espn_id": "401161140",
  "date": "Dec 31, 2019",
  "matchup": "IND vs. PHI",
  "headline": "Sabonis scores 23 points to lead Pacers over 76ers 115-97",
  "body": "INDIANAPOLIS --  Domantas Sabonis wasn't taking any chances despite Indiana's big lead before halftime.\n\nSabonis scored 11 of his 23 points in the third quarter and finished with 10 rebounds and five assists to push the Pacers over the Philadelphia 76ers 115-97 Tuesday.\n\n\"We know in this league it doesn't matter how many points you're up,\" Sabonis said. \"Teams come back and win.\"\n\nThe 76ers couldn't overcome a 36-point deficit, especially without injured center Joel Embiid. The two-time All-Star, who leads the team 23.7 points and 12.4 rebounds per game, was out with a sore left knee.\n\nT.J. Warren had 21 points and Myles Turner added 14 for the Pacers, who ended a three-game losing streak in the series and improved to 22-12 overall.\n\nJosh Richardson had 20 points and Ben Simmons had 18 points and 10 rebounds for the 76ers, who have lost three straight with a game remaining in a four-game trip. Philadelphia dropped to 23-13, including losses in six of the last nine games.\n\n\"I think, in general, after coming out of Miami (a 117-116 loss in overtime) and losing two games prior to being here, that's a disappointing performance,\" 76ers coach Brett Brown said. \"I do give Indiana credit as it relates to us missing shots. We certainly had people down. They were some of our better players. Just didn't have the performances that they're used to having and sometimes that happens.\"\n\nThe Pacers used a big second quarter to put the game away, outscoring Philadelphia 38-16 in the period to take a 67-43 halftime lead.\n\nIndiana guard Malcolm Brogdon returned to the starting lineup for the first time after missing the last three games with a sore left hamstring. He went to the bench in the first half with a sore lower back and didn't return.\n\nThe Pacers evened the regular season series after losing 119-116 at Philadelphia on Nov. 30. They went on a 15-2 run to start the second quarter and took a 46-29 lead with Warren's layup with 6:24 to go. Indiana went ahead by 26 points at one point. Doug McDermott scored to put the Pacers ahead 65-39 with 1:02 remaining in the quarter.\n\nThe two teams meet again in two weeks at Indianapolis with the final game in the four-game regular season series March 14 at Philadelphia.\n\n\"We played great basketball,\" Pacers coach Nate McMillan said. \"We established our defense, got stops and were able to get into transition. With 35 assists we were making their defense move and work. I just loved the tempo we established at the defensive end of the floor as well as the offensive end.\"\n\nIndiana led by 36 -- it's largest lead of the game -- after another big run that came in the third quarter.\n\nSabonis made a 3-pointer and two other baskets in a 14-2 spurt. He capped off the string with a layup on an alley-oop pass from Jeremy Lamb to make it 87-51 with 6:29 remaining in the third.\n\nTIP-INS\n\n76ers: Philadelphia shot just 20% (5 of 20) from the field in the second quarter after shooting 52.4% in the first quarter. ... Richardson also finished with five assists. ... G Matisse Thybulle was out with a right knee sprain.\n\nPacers: Reserve T.J. McConnell had 11 points and 10 assists. ... Lamb had 13 points and six assists. ... Turner was 3 for 5 on 3-pointers.\n\nWINNING AT HOME\n\nThe Pacers won after dropping the last two meetings with the 76ers in Indianapolis. Overall, Indiana is on a season-best six-game winning streak at home and are 15-3 in home games this season.\n\nUP NEXT\n\n76ers: Visit Houston on Friday.\n\nPacers: Host Denver on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995857.5545049
}