{
  "game_id": "0021600277",
  "espn_id": "400899367",
  "date": "Dec 01, 2016",
  "matchup": "MIL @ BKN",
  "headline": "Antetokounmpo leads Bucks over Nets, 111-93",
  "body": "NEW YORK --  The Greek Freak put on a show in Brooklyn.\n\nGiannis Antetokounmpo had 23 points, eight rebounds and eight assists, Jabari Parker scored 22 points and the Milwaukee Bucks beat the Nets 111-93 on Thursday night.\n\n\"You have special players that we come across, LeBron James, Kobe Bryant, Michael Jordan,\" Bucks coach Jason Kidd said. \"You've got different players that are rare and I think Giannis is one of those rare birds that we'll be able to enjoy for a long time.\"\n\nMalcolm Brogdon and Tony Snell each added 13 points for the Bucks, who followed their impressive victory over Cleveland with their third straight win.\n\nBrook Lopez scored 15 points, Sean Kilpatrick had 14 and Bojan Bogdanovic added 13 for the Nets, who outlasted the Los Angeles Clippers in overtime on Tuesday and were trying to win consecutive games for the first time this season.\n\n\"If you're going to come out flat, that's how it's going to happen, especially in the NBA,\" Kilpatrick said. \"That's all the stuff that happens, especially if you come out flat and you're not playing with no type of energy. Once a team sees that, it's like being in the ocean and you're bleeding. A whole bunch of sharks keep jumping on you if they see that.\"\n\nThe Bucks continued their dominance of the Nets since Kidd left Brooklyn for the Milwaukee coaching job.\n\nMilwaukee led by one in the third quarter when the Bucks went on a 14-2 run to go up 77-64. Milwaukee took a 90-78 lead into the fourth quarter, led by Antetokounmpo's 11 points in the third, and never looked back.\n\n\"I think we got the ball moving, but it all starts with our defense,\" Kidd said. \"We got stops and got out into the open court. We started to share the ball. I thought the ball moved a lot better in that second half.\"\n\nAntetokounmpo sat out the entire fourth quarter and missed a chance at a triple-double with Milwaukee hosting Brooklyn on Saturday.\n\n\"It's a long season,\" Antetokounmpo said. \"It doesn't matter for me. The only thing that matters to me is getting the win. We play them in two days so I think (Kidd) made a good decision sitting me in the fourth quarter because we've got to get the win in two days. It's a must-win game again.\"\n\nFor Brooklyn, the third quarter woes continue.\n\n\"At the end of the day it's going to continue being that way if we don't play hard enough and if guys don't come out with the right energy,\" Kilpatrick said.\n\nTIP-INS\n\nBucks: Kidd believes Antetokounmpo is just beginning to show his potential. \"He's only 21 years old,\" Kidd said. \"That's the most underrated thing about him. He's 21 years old doing a lot of things that a lot of us can't do. I think that's special and I think that is overlooked a lot of times.\" ... Steve Novak and Khris Middleton were inactive.\n\nNets: Coach Kenny Atkinson said the team is going to \"build up\" Rondae Hollis-Jefferson's minutes after an ankle injury. ... Jeremy Lin (strained left hamstring) and Caris LeVert (left foot rehab) were inactive.\n\nSPEAKING THE TRUTH\n\nTwo days after Paul Pierce played his final game in Brooklyn, Kidd was asked how would remember a long-time adversary and later a player he coached.\n\n\"I think he's a true pro, a true warrior and a champion,\" Kidd said. \"Being able to coach him, to see his work ethic at a very high level. (He) respects the game and is a true vet. As a player who's played against him, he is not afraid of having the ball late in the game. He always wanted to deliver that winning shot.\"\n\nCOURTSIDE CELEBRITIES\n\nFormer President Bill Clinton was courtside with Bucks co-owner Marc Lasry. New York Giants safety Landon Collins and running back Bobby Rainey were also on hand at Barclays Center.\n\nUP NEXT\n\nBucks: Host Brooklyn on Saturday.\n\nNets: Visit Milwaukee on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995211.781655
}