{
  "game_id": "0021800196",
  "espn_id": "401070877",
  "date": "Nov 12, 2018",
  "matchup": "OKC vs. PHX",
  "headline": "George scores 32 as Thunder roll past Suns, 118-101",
  "body": "OKLAHOMA CITY --  Once the Oklahoma City Thunder got going, the Phoenix Suns couldn't stop them.\n\nPaul George matched his season high with 32 points and went 6 of 10 from 3-point range, Dennis Schroder added 20 points and nine assists, and the Thunder beat the Suns 118-101 on Monday night.\n\nOklahoma City scored 22 straight points in the first quarter, holding the Suns scoreless for nearly seven minutes, to take a 24-5 lead. The Thunder never trailed again and led by as many as 28 points in the second quarter before settling for a 64-40 halftime lead. The Suns whittled that margin down to seven points in the fourth quarter but came no closer.\n\n\"As a group, I thought we sensed the energy,\" George said. \"I felt we were the more aggressive team. . I thought we just jumped on them. Once you get one stop, you get another, and at that point, we were just in a groove. We felt good out there.\"\n\nThe Thunder have won eight of their last nine games after a 0-4 start while the Suns have lost four straight and 11 of their last 12. Two of those losses have come in Oklahoma City.\n\nThe Thunder were 13 of 27 on 3-point attempts.\n\nThe Thunder played a fourth straight game without star guard Russell Westbrook, who sat out with a sprained left ankle on his 30th birthday. They didn't need him against Phoenix, thanks to George, Schroder and Steven Adams, who had 18 points, seven rebounds, three steals and two blocked shots.\n\nT.J. Warren led the Suns with 21 points while Devin Booker had 19 points and six assists.\n\n\"The way we opened the game, no presence, no life whatsoever,\" Phoenix coach Igor Kokoskov said. \"We were behind 20 points in the first quarter. That's hard. It put us in a situation that we have to compete and play the whole game and every possession has got to be perfect. You're looking for that spark, looking for that energy to bring us back in the game. I'm glad we found it. We were competing. We never quit.\"\n\nSchroder -- who started the game 1 of 11 from the field -- hit consecutive 3-pointers off passes from George (who had six assists and eight rebounds) to give the Thunder a 78-55 lead in the third quarter.\n\nPhoenix scored 12 straight points, though, and trailed only 86-75 at the end of the period. A 3-pointer by Jamal Crawford pulled the Suns within 93-86 with 7:56 left, but the Thunder had a 15-4 run and weren't challenged again.\n\n\"When we get out and go, we're a really good team,\" George said. \"When we get a little stagnant is when we struggle. That's all it came down to.\"\n\nThe Thunder are 16-4 against the Suns at home (after once being 0-3) and have won 23 of their last 29 games overall against Phoenix. The teams will play again Saturday in Phoenix and will wrap up their season series on Dec. 28, also in Phoenix.\n\nTIP-INS\n\nSuns: Phoenix's 13 first-quarter points were the lowest by a Thunder opponent in an opening quarter this season . Warren has 20 3-pointers this season in 13 games after making 20 in 65 games last season.\n\nThunder: George's six 3-pointers were the most in a game by a Thunder player this season . Schroder received a technical foul in the third quarter . The two boxers who will fight at Chesapeake Energy Arena on Friday for the WBO welterweight title, reigning champ Maurice Hooker and Alex Saucedo of Oklahoma City, both attended the game.\n\nMASTER CLASS\n\nAdams often got the best of Phoenix rookie Deandre Ayton, leaving him befuddled at both ends of the court, particularly during the first half. Ayton finished with 14 points, but only four in the first half as Oklahoma City built a 28-point lead.\n\nAdams, who routinely scored around and over Ayton, was charitable when discussing the rookie.\n\n\"He's good, mate. He'll be fine. He's just a rookie. He's figuring his way. He'll be a good player.\"\n\nUP NEXT\n\nSuns: Host the San Antonio Spurs on Wednesday.\n\nThunder: Host the New York Knicks on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994627.436674
}