{
  "game_id": "0021800905",
  "espn_id": "401071578",
  "date": "Feb 25, 2019",
  "matchup": "SAC @ MIN",
  "headline": "Towns leads T-wolves past Kings 112-105",
  "body": "MINNEAPOLIS --  Karl-Anthony Towns took full advantage of his unexpected weekend off.\n\nThere won't be any more breaks down the stretch for him or the Minnesota Timberwolves.\n\nTowns had 34 points and 21 rebounds in his return from the concussion protocol, helping the Timberwolves stave off the Sacramento Kings 112-105 on Monday.\n\nDerrick Rose added 20 points and Tyus Jones pitched in 16 points, eight assists and three steals for the Timberwolves, who split the previous two games without Towns, while he recovered following a highway crash last week involving the car he was riding in . The accident ended Towns' streak of 302 consecutive starts to begin his NBA career.\n\n\"You're so used to just grinding your body to dust every single day, and you don't get a chance to realize how much you appreciate being there,\" Towns said. \"I've always wanted to be available for my teammates, be available for the Wolves, but when you sit out you're looking at a different perspective.\"\n\nRookie Marvin Bagley III had 25 points and 11 rebounds and De'Aaron Fox scored 23 points for the Kings (31-29), who like the Timberwolves (29-31) are just below the cut for the Western Conference playoffs along with the Los Angeles Lakers (29-31). The Kings, who haven't reached the postseason since 2006, began the night tied in the loss column with the seventh-place San Antonio Spurs and Los Angeles Clippers.\n\n\"We've got to set a different intensity, a different edge, a different animal,\" said Towns, who went 13 for 18 from the floor and also had five assists. \"This is the time. We've got to make a push.\"\n\nThe fast-breaking Kings wore down the Wolves, who had Jones in the starting lineup at point guard for the injured Jeff Teague, as they whittled away at a 17-point deficit in the third quarter. After Andrew Wiggins bricked a 3-pointer -- he went 1-for-7 from behind the arc and finished with only eight points -- to bring boos from the home crowd, Harrison Barnes sank two free throws for his first points of the game that cut the lead to 106-101 with 3:43 remaining. Bagley's 3-pointer brought the Kings within 108-104 with 3:05 left.\n\nThe Wolves had 22 turnovers, one off their season high, but Jones stole the ball from Fox on consecutive possessions in the closing minutes. Rose sank the game-sealing jumper with 29 seconds left to push the lead back past two possessions.\n\n\"We're growing, and it's the level of experience that is required,\" Kings coach Dave Joerger said. \"They've got a lot of older guys that have been through it.\"\n\nJoerger slid Barnes back to the small forward spot, sent Bogdan Bogdanovich to the second unit and gave the 6-foot-11 Bagley, the second overall pick in the draft last summer, just his second start of the season in the desire for a bigger lineup. Still, Towns took over the game with an 18-point second quarter.\n\nThe Kings actually led by as many as 13 points late in the first quarter, a start fueled as much by a 0 for 10 start by the Wolves from 3-point range, but Taj Gibson sparked the rally with his usual grinding work underneath before Towns got going. The two-time All-Star who's just 23 years old made three 3-pointers and a windmill dunk to finish a fast break during a 20-1 run by the Wolves that put them up 48-39.\n\n\"He was fresh,\" Gibson said.\n\nBENCHED BUDDY\n\nBuddy Hield, who had 18 points on 7-for-16 shooting and five turnovers, was on the bench for the final 5:42. Joerger declined to elaborate on his decision, other than declaring Hield had \"a tough night.\" He posted a minus-18 rating.\n\n\"I'm not going to lie to you. It's hard,\" Hield said. \"It's hard to watch. You want to be out there. But you've still got to respect the guys out there, too.\"\n\nTIP-INS\n\nKings: Barnes finished with just two points on 0-for-4 shooting from the floor, his lowest total since a one-point game for Golden State on March 31, 2015. In six games since arriving in a trade with Dallas, Barnes is just 21 for 65 from the field and 7 for 30 from 3-point range for 62 points. ... Bagley had his 13th double-double.\n\nTimberwolves: This was the seventh 30-point, 20-rebound, five-assist game in franchise history, the second by Towns. ... Rose hit a 3-pointer with 3:56 left in the third quarter for an 86-70 lead, ending a 0-for-22 stretch from long range. Having missed six games to an ankle injury over that stretch, Rose's last make was on Jan. 15.\n\nUP NEXT\n\nKings: Start a four-game homestand on Wednesday against Eastern Conference-leading Milwaukee.\n\nTimberwolves: Begin a three-game trip on Wednesday at Atlanta.\n\n---\n\nMore AP NBA coverage: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994175.960851
}