{
  "game_id": "0021600849",
  "espn_id": "400900255",
  "date": "Feb 16, 2017",
  "matchup": "CHI vs. BOS",
  "headline": "Butler lifts Bulls to 104-103 victory over Celtics",
  "body": "CHICAGO --  Jimmy Butler and Isaiah Thomas should have plenty to talk about when they see each other in New Orleans this weekend.\n\nButler made two free throws with 0.9 seconds left, sending the Chicago Bulls to a 104-103 victory over Thomas and the Boston Celtics on Thursday night.\n\nButler's clutch foul shots capped a memorable duel with fellow All-Star Thomas in the NBA's final game before the break. Butler and Thomas both finished with 29 points and seven assists.\n\nButler was touched on the right elbow by Marcus Smart on a turnaround jumper as the horn sounded, drawing a foul. Butler calmly patted his elbow and then walked toward the line while an incredulous Smart danced up the court in disbelief.\n\n\"He got a piece of the elbow,\" Butler said. \"People are going to say `Aw, he didn't foul him,' but he did. So at the end of the day they made the right call.\"\n\nSaid Thomas: \"That's horrible when it costs you a game you should have won. That's a bad call.\"\n\nAfter Butler's free throws, Al Horford air-balled a baseline jumper on the Celtics' last shot, giving Chicago (28-29) consecutive wins against Eastern Conference powers Toronto and Boston (37-20).\n\n\"I'm excited about these two wins over two very good teams,\" coach Fred Hoiberg said. \"Hopefully, we can build off of these coming back off the break.\"\n\nBobby Portis had a season-high 19 points for the Bulls, who went 22 for 22 at the line. Robin Lopez had 15 points and eight rebounds, and Taj Gibson finished with 12 points and nine boards.\n\n\"It's big for us. It's going to propel us to the second half of the season, which our team really needs,\" Portis said.\n\nThomas went 8 for 18 from the field in his 41st straight game with at least 20 points, breaking the team record set by John Havlicek during the 1971-72 season. He made two free throws with 1:30 left to make it 103-100, but he was blocked by Butler on a layup attempt and missed a jumper down the stretch.\n\nBoston also was outrebounded 51-31, leading to a 22-4 deficit in second-chance points.\n\n\"They were bigger than us at almost every position and then we didn't do a good job running down balls. So rebounding was an issue,\" coach Brad Stevens said.\n\nKelly Olynyk had 17 points and seven boards for the Celtics, who had won four in a row and 11 of 12. Terry Rozier made three 3-pointers and finished with 11 points.\n\nThe Bulls played without guard Dwyane Wade and forward Paul Zipser due to injuries. Wade has been hampered by a bruised right wrist, and woke up Thursday with an illness. Zipser is dealing with left ankle tendinitis.\n\nThe break will give the 35-year-old Wade a couple weeks of rest between games.\n\n\"It'll be two full weeks since he had the wrist injury, so again, hopefully we'll get him back full strength when we return,\" Hoiberg said.\n\nAvery Bradley remained out for Boston, and rookie forward Jaylen Brown missed his third straight game with a right hip strain. Bradley, who is averaging 17.7 points, hasn't played in a month because of a sore right Achilles.\n\nFROM DEEP\n\nBoston made 10 of its 14 3-point attempts on its way to a 58-52 halftime lead. The Celtics have made 10-plus 3s in 15 consecutive games.\n\nTIP-INS\n\nCeltics: Amir Johnson scored all of his 10 points in the first quarter. ... Boston has dropped two of three against Chicago. They close out the season series on March 12 in Boston.\n\nBulls: PG Rajon Rondo rolled his left ankle in the second quarter, but returned to the game in the third. ... Hoiberg said Nikola Mirotic (back spasms) was available before the game, but the 6-foot-10 forward did not play.\n\nUP NEXT\n\nCeltics: Visit the Toronto Raptors next Friday night. Boston has dropped two of three against Toronto this season.\n\nBulls: Host the Phoenix Suns next Friday night. Chicago lost 115-97 at Phoenix last Friday night.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764995038.417931
}