{
  "game_id": "0022400554",
  "espn_id": "401705120",
  "date": "Jan 14, 2025",
  "matchup": "IND vs. CLE",
  "headline": "NBA-leading Cavaliers end Pacers' 6-game winning streak with a 127-117 victory",
  "body": "INDIANAPOLIS -- — Donovan Mitchell scored 35 points and the NBA-leading Cleveland Cavaliers beat the Indiana Pacers 127-117 on Tuesday night.\n\n\r\n              Darius Garland scored 24 points and Evan Mobley added 22 points and 13 rebounds for the Cavaliers.\n\n\r\n              Pascal Siakam scored 23 points and Bennedict Mathurin 19 for the Pacers, who had their six-game winning streak halted. Myles Turned added 17 points.\n\n\r\n              The Cavaliers led 82-77 in the third quarter before going on a 10-0 run that included 3-pointers by Max Strus, Georges Niang and Mobley. Cleveland led 100-89 after three periods.\n\n\r\n              Indiana cut its deficit to 111-106, but could get no closer.\n\n\r\n              With Indiana trailing 120-111, Mathurin lost his cool and was ejected after drawing his second technical with 3:58 left. Mitchell sank both technical free throws and Mobley hit one of two free throws.\n\n\r\n              The Pacers had ended the host Cavaliers’ 12-game winning streak with a 108-93 victory on Sunday night.\n\n\r\n              Indiana played without All-Star point guard Tyrese Haliburton, who was sidelined with left groin strain. \n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland was able to bounce back from their first loss since Dec. 8 with a 49-37 rebounding edge. The Cavaliers shut down Siakam in the second half, limiting him to two points and five shots.\n\n\r\n              Pacers: Indiana missed Haliburton, and his replacement, Ben Sheppard, had just two assists and shot 1 for 6.\n\n\r\n              Key moment\r\n              After the Pacers closed the deficit to 115-109, Garland sank a 27-foot, 3-pointer to put Cleveland ahead 118-109 with 4:48 left.\n\n\r\n              Key stat\r\n              The Cavaliers sank 26 of 31 free throws. That was nine more free throws than the Pacers (17 of 22). Both teams shot 48% from the field.\n\n\r\n              Up next\r\n              The Cavaliers are at Oklahoma City on Thursday in a matchup of the East and West conference leaders. The Pacers are at Detroit on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764998139.9334111
}