{
  "game_id": "0022400564",
  "espn_id": "401705130",
  "date": "Jan 15, 2025",
  "matchup": "MIL vs. ORL",
  "headline": "Lillard scores 30 as Bucks roll to a 122-93 victory over Magic",
  "body": "MILWAUKEE -- — Damian Lillard scored 30 points and Giannis Antetokounmpo had 26 points and 11 rebounds as the Milwaukee Bucks capitalized on a fast start for the second straight night and trounced the Orlando Magic 122-93 on Wednesday.\n\n\r\n              The Bucks (22-17) passed Orlando (23-19) to take over fourth place in the Eastern Conference. The Bucks are 3-0 against the Magic, with the finale of the season series scheduled for March 8 at Milwaukee.\n\n\r\n              Milwaukee led 34-16 at the end of the first quarter and rolled to its most lopsided victory of the season. The Bucks were playing one night after racing to a 47-26 advantage in the opening period of a 130-115 victory over Sacramento that snapped the Kings' seven-game win streak.\n\n\r\n              Paolo Banchero scored 22 points for Orlando.\n\n\r\n              Bucks guard Andre Jackson Jr. didn’t play in the second half after bruising a hip.\n\n\r\n              Takeaways\r\n              Magic: Five nights after losing 109-106 to the Bucks in a game that went down to the wire, the Magic never had a chance in this one due to their shooting woes. Orlando shot 34.7% from the field, the lowest percentage the Bucks have allowed in any game this season.\n\n\r\n              Bucks: One night after posting their highest point total of the season, the Bucks shot a season-high 62.5% while continually getting open looks in the paint.\n\n\r\n              Key moment\r\n              Milwaukee scored 19 straight points in the first quarter to open a 27-9 lead. Lillard scored nine points during that spurt, including a 3-pointer from over 30 feet away.\n\n\r\n              Key stats\r\n              Orlando went 12 of 46 while Milwaukee was 7 of 12 from 3-point range. According to Sportradar, the Bucks had the fewest 3-point attempts by a team in any NBA game this season.\n\n\r\n              Up next\r\n              Both teams play again Friday, with the Magic visiting the Boston Celtics and the Bucks hosting the Toronto Raptors.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997839.879217
}