{
  "game_id": "0022200552",
  "espn_id": "401468707",
  "date": "Jan 02, 2023",
  "matchup": "CHI @ CLE",
  "headline": "Mitchell scores 71 points, Cavs beat Bulls 145-134 in OT",
  "body": "CLEVELAND -- — Already an All-Star, Donovan Mitchell added his name to one of the NBA’s most rarefied lists Monday night.\n\n\r\n              Mitchell set a Cleveland record with 71 points, most by any player in 17 years, and the Cavaliers rallied from 21 down to beat the Chicago Bulls 145-134 in overtime.\n\n\r\n              Mitchell’s total matched the eighth-highest in league history and marked the most points by an NBA player since Lakers great Kobe Bryant scored 81 against Toronto on Jan. 22, 2006. Wilt Chamberlain owns the NBA record with 100 for Philadelphia against New York on March 2, 1962, at Hershey, Pennsylvania.\n\n\r\n              “To be there in the record book with guys like Wilt is truly humbling,” said Mitchell, acquired from Utah in the offseason. “I always believed I could be one of the best players in the league. I’m speechless and blessed to be in the company of that greatness.”\n\n\r\n              As the final seconds of OT ticked off the clock, Mitchell waved his arm for the Cleveland crowd, which has embraced him in his short time with the Cavs, to make more noise and then soaked in their applause.\n\n\r\n              Seconds later, Mitchell was doused with water by his teammates and forward Cedi Osman grabbed a microphone on the floor to lead an “M-V-P, M-V-P,” chant.\n\n\r\n              Mitchell scored 13 points in the extra session after forcing OT by grabbing his own intentionally missed free throw and making a circus shot with three seconds left in regulation, tying the game at 130 and breaking the Cleveland record with 58 points.\n\n\r\n              In OT, Mitchell became the seventh player in the 70-point club. Chamberlain did it six times, while Bryant, David Thompson, Elgin Baylor, David Robinson and Devin Booker reached the figure once apiece.\n\n\r\n              “We were treated tonight to one of the greatest performances in the history of the game,” Cleveland coach J.B. Bickerstaff said. “Every single play that he made was a play that was necessary.\n\n\r\n              “Donovan has never put himself above the team, so how can you not root for a guy like that? I told everyone else to get out of the way.”\n\n\r\n              Mitchell also had a career high-tying 11 assists and eight rebounds in 50 minutes. He set career bests with 20 free throws made and 25 attempted. He scored five points in the first quarter, 11 in the second, 24 in the third and 18 in the fourth.\n\n\r\n              “I think I had a game like that once playing NBA2K, but I don’t think I shot that efficiently,” Mitchell joked of his video-game skills. “But that was in a loss, so this feels that much better.”\n\n\r\n              Mitchell went 22 of 34 from the field and made 7 of 15 3-pointers in carrying the Cavaliers, who were without All-Star guard Darius Garland (right thumb sprain) and forward Evan Mobley (right ankle soreness) for the second straight game.\n\n\r\n              DeMar DeRozan scored 44 points, Zach LeVine had 26 points and Nikola Vucevic added 20 points and 13 rebounds for Chicago, which did not trail in regulation.\n\n\r\n              During his postgame news conference, Mitchell was almost in disbelief when it was mentioned he joined the list of NBA legends to surpass 70 points.\n\n\r\n              “It’s humbling,” he said. “I’m speechless. For me, not only did I do that, but I did it an effort when we came back and won and it’s how we won. It’s nuts.\"\n\n\r\n              TIP-INS\n\n\r\n              Bulls: G Javonte Green (right knee soreness) was unavailable after appearing in the previous three games. Green has missed nine total games with the injury and will undergo a thorough examination Tuesday in Chicago. “He was making some headway, then it flared up again,” coach Billy Donovan said. … G Lonzo Ball (left knee surgery), who last played on Jan. 14, is lightly jogging and doing limited on-court work.\n\n\r\n              Cavaliers: Cleveland posted winning records in each of the first three months of the season for the first time since 2016-2017. The latter wrapped up a run of 16 straight winning months with All-Stars LeBron James, Kyrie Irving and Kevin Love. … G Ricky Rubio (left knee rehabilitation), F Dean Wade (left shoulder sprain) and G Dylan Windler (right ankle sprain) remain out. Rubio could return to action within two weeks.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit Philadelphia on Wednesday night.\n\n\r\n              Cavaliers: Host Phoenix on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994495.703564
}