{
  "game_id": "0022300821",
  "espn_id": "401585449",
  "date": "Feb 25, 2024",
  "matchup": "ORL @ ATL",
  "headline": "Dejounte Murray steps up in place of injured Trae Young as Hawks trounce Magic 109-92",
  "body": "ATLANTA -- — Dejounte Murray had 25 points, 11 assists and nine rebounds, finishing just short of his first triple-double of the season, and the Atlanta Hawks trounced the Orlando Magic 109-92 on Sunday night to snap a three-game skid.\n\n\r\n              Murray, whose 11 assists tied a season high, helped offset the loss of All-Star guard Trae Young, who will undergo surgery on his left hand Tuesday and be re-evaluated in four weeks. Young is averaging 26.4 points and 10.8 assists.\n\n\r\n              “We don’t have any excuses. This is the NBA,” Murray said. “Obviously, we want him to get back as soon as he can. But while he’s out, next man up. That’s it. There’s opportunities for guys to show why they are in the NBA.”\n\n\r\n              Jalen Johnson had 21 points and nine rebounds for the Hawks after a scoreless first quarter. De'Andre Hunter added 18 points off the bench.\n\n\r\n              Franz Wagner had 19 points to lead the Magic, who had won eight of their last 10 but fell to 1-7 when playing the second game of a back-to-back on the road. Wendell Carter Jr. finished with 18 points and 10 rebounds. \n\n\r\n              Orlando forward Paulo Banchero, the Magic's leading scorer, missed his first game of the season with an illness after making the winning shot Saturday night against the Pistons. \n\n\r\n              The 92 points allowed were the Hawks' fewest given up this season — by seven points.\n\n\r\n              “We want to focus on things we can control, and (defensive) communication is a big part of that,\" Hawks coach Quin Snyder said. “It was good to see. We weren’t perfect, but there was definitely focus on the defensive end.”\n\n\r\n              The Magic hurt themselves at the foul line, where they made just eight of 18 shots.\n\n\r\n              After shooting just 38% from the floor during a sluggish first half, the Hawks shot 54% in the third quarter on their way to 38 points.\n\n\r\n              The Hawks took control of a tight game with an 18-1 run to close the third quarter. Murray had 12 of the 18 points while the Magic missed their final eight field goal attempts in the period. Murray had 16 in the quarter.\n\n\r\n              “(The key was) getting stops on the defensive end,” Murray said. “The best offense is when you can get stops and get on a run. I think that’s what it was.”\n\n\r\n              Hawks first-round pick Kobe Bufkin saw his first action at point guard with Young injured. He backed up Murray and finished with 2 points, three assists, a steal and a block in 11 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Open a three-game homestand against the Brooklyn Nets on Tuesday.\n\n\r\n              Hawks: Host the Utah Jazz on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995692.841581
}