{
  "game_id": "0021600527",
  "espn_id": "400899451",
  "date": "Jan 03, 2017",
  "matchup": "PHX vs. MIA",
  "headline": "Booker, Chriss lead Suns past short-handed Heat, 99-90",
  "body": "PHOENIX -- The last time the Phoenix Suns beat the Miami Heat, Devin Booker was 13 years old and rookie Marquese Chriss was 12.\nSo the Suns' 99-90 victory Tuesday night was a long time coming.\nBooker scored 27 points -- 18 in the second half -- and Chriss added a career-best 18 as Phoenix handed the undermanned Heat their sixth consecutive loss.\nThe Suns snapped a 12-game losing streak against Miami. Phoenix hadn't beaten the Heat since Nov. 3, 2009.\nGoran Dragic, who missed three of the previous four games with lower back spasms, scored 22 in the first half for Miami before his back tightened up in the second.\n\"I felt like I didn't move so well anymore,\" he said.\nDragic finished with 24 points. He just about had to play, though, because he was one of Miami's eight available players.\nWillie Reed had 22 points and 18 rebounds for the Heat, both career highs.\nEric Bledsoe added 17 points for the Suns, who stretched a four-point halftime lead to 19 in the second half.\nPhoenix, playing on consecutive nights after a road loss to the Clippers on Monday, wore down Miami in the second half.\n\"That was the game plan going in,\" Booker said. \"But we couldn't take them lightly. They started out with a short lead but we kept fighting, we kept pushing and finally came out with the win.\"\nBooker shot 3 of 7 in the first half and 6 of 12 in the second, including 3 for 5 on 3-pointers.\n\"Just trying to find the flow,\" he said. \"I came in at halftime, everybody thought I was being passive. I just tried to be a little more aggressive, at the same time always trying to make the right play, which is tough. You've got to go through trial and error in this league.\"\nMiami scored 14 points in the third quarter.\n\"That's the type of effort we need,\" Phoenix coach Earl Watson said. \"We understand that defense has to be our foundation in order to change our culture, in order to achieve something greater than just scoring points and having our name in the paper.\"\nThe Heat led by nine early and were up 42-37 on Dragic's inside basket with 8:34 left in the first half, but Bledsoe and Chriss sank consecutive 3s in a 9-0 spurt that put Phoenix up 46-42 when Booker made one of two free throws 3:13 before the break.\nDragic cut the lead to 54-52 with a left-handed driving layup with 9.3 seconds left before Bledsoe's two free throws with 4.2 seconds remaining put the Suns up 56-52 at the break.\nThe Suns opened the second half with an 11-3 run and were up 79-62 when Booker sank a 28-foot 3-pointer with 1:59 left in the third quarter. Phoenix led 83-66 entering the fourth.\n\"We struggled to score. We struggled to get good looks,\" Heat coach Erik Spoelstra said. \"I am not absolving us from that, but what I want to see us do is be able to defend during that stretch and be able to hold them to under 40 percent -- make it ugly and be a stone's throw away in the fourth quarter.\"\nWayne Ellington's 3 cut the Suns' lead to 85-74 with 8:13 to play, but Booker sank a 3-pointer with 6:36 remaining to boost the lead back to 14. Miami cut it to eight in the final two minutes but got no closer.\nLONG LIST\nThe list of missing Miami players was long: James Johnson (food poisoning), Tyler Johnson (migraine), Dion Waiters (pectineus tear), Hassan Whiteside (right retinal contusion), Justise Winslow (right shoulder), Josh McRoberts (left foot stress fracture). That doesn't include Chris Bosh, who has not played all season.\nTIP-INS\nHeat: Miami last lost to the Suns in Phoenix on Jan. 5, 2007. ... Heat players not named Dragic were 13-of-34 shooting in the first half. ... Reed's previous career highs were 14 points and 11 rebounds.\nSuns: G Brandon Knight was out with a sprained right wrist. ... Phoenix is 8-4 against Eastern Conference foes, 7-2 at home. ... Phoenix improved to 3-4 on the second night of back-to-back games. ... The Suns have won three consecutive home games.\nUP NEXT\nHeat: Miami plays at Sacramento on Wednesday night in the second stop of a six-game road trip.\nSuns: Phoenix travels to Dallas to face the Mavericks on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995978.4569018
}