{
  "game_id": "0021900247",
  "espn_id": "401160889",
  "date": "Nov 25, 2019",
  "matchup": "CHI vs. POR",
  "headline": "Anthony scores 25, Trail Blazers beat Bulls 117-94",
  "body": "CHICAGO --  After waiting a year for an opportunity to return to the NBA, Carmelo Anthony proved he’s still capable of a big performance.\n\nAnthony scored 25 points in just his fourth game of the season, CJ McCollum added 21 and the Portland Trail Blazers beat the Chicago Bulls 117-94 on Monday night.\n\nAnthony was 10 for 20 from the field, including 4 of 7 on 3-pointers. He had averaged 13 points on 15-for-44 (34.1%) shooting in his first three games.\n\n“It’s a humbling situation for me, but it’s a testament to the work I’ve been putting in,” he said. “My body feels good, mentally I feel good.”\n\nBesides sharp shooting behind the 3-point line, the 10-time All-Star featured his usual mid-range game and even had a dunk.\n\n“Vintage,” McCollum said. “We pulled out some old, good wine in there. Getting to his spots, hitting 3s, he got a dunk and he was talking like he always does on defense.”\n\nAnthony now has 25,615 career points to move ahead of Alex English (26,613) into 18th place on the NBA’s career scoring list.\n\n“You don’t want to take none of that stuff for granted,” he said. “When you’ve been away from the game, these small (milestones), they start to mean more and more.”\n\nDamian Lillard had 13 points and 12 assists as Portland snapped a four-game losing streak.\n\nZach LaVine had 18 points for Chicago, which has dropped two of three. LaVine was just 1 for 5 on 3-pointers two days after making 13 of 17 while scoring a career-high 49 points Saturday at Charlotte.\n\n“We played against a good half-court defensive team,” LaVine said. “We need to get out on transition more. They just killed us on the other end. We couldn't keep up.\"\n\nAnthony, who signed with the Trail Blazers on Nov. 19, got off to a fast start with 12 points in the first 6½ minutes of the game.\n\nChicago led 28-27 at the end of the first quarter before Portland took command early in the second. The Blazers led by as 13 points before the Bulls scored 11 straight to pull within 50-48.\n\nPortland closed the first half with a 12-6 spurt for a 62-54 halftime advantage.\n\nThe Trail Blazers further stretched the lead in the third, taking a 90-68 advantage -- their biggest to that point -- on Anthony’s three-point play with 1:27 to go in the quarter.\n\nEarly in the fourth, Anthony hit a 3-pointer to move past English and give Portland a 100-77 lead.\n\nThe 35-year-old exited the game for good shortly after that. The United Center crowd started chanting “We want Melo! We want Melo!” midway through the fourth.\n\n“From fans that are Chicago Bulls fans, that’s a big moment,” he said. “To hear that chant, with me on another team, Portland, that’s out West, they didn’t have to do that.”\n\nThe Trail Blazers led by as much as 28 points.\n\nTIP-INS\n\nTrail Blazers: C Hassan Whiteside returned after missing the previous two games with a right hip contusion. He had 13 points and 12 rebounds in 22 minutes ... G Gary Trent Jr. sat out with a right hamstring strain.\n\nBulls: F Chandler Hutchison missed two games last week with soreness in both shins. Coach Jim Boylen said Hutchison was available to play Saturday against Charlotte, but he opted not to play him. Hutchison didn’t enter Monday until the fourth, long after the game had been decided ... G Denzel Valentine played in just his fourth game of the season and had seven points in four minutes in the second quarter. He finished with 11 points.\n\nHOMECOMING?\n\nAnthony technically was a Bull for 10 days last season following a trade made for salary cap purposes. He never played in a game before being waived a short time later.\n\n“At the end of the day, I will always be connected to Chicago some way, somehow,” he said. “For years and years, my name was always connected with the Chicago Bulls.”\n\nWhen asked if he would have considered playing for the Bulls then, Anthony said, “They didn’t ask.”\n\nUP NEXT\n\nTrail Blazers: Host the Oklahoma City Thunder on Wednesday night.\n\nBulls: At Golden State on Wednesday night to begin a three-game West Coast trip.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996363.75084
}