{
  "game_id": "0022000461",
  "espn_id": "401307631",
  "date": "Apr 14, 2021",
  "matchup": "IND @ HOU",
  "headline": "Indiana sends Houston to 4th straight loss, 132-124",
  "body": "HOUSTON -- — Caris LeVert scored 27 points, Domantas Sabonis added 22 and Malcolm Brogdon fell just short of a triple-double as the Indiana Pacers beat the Houston Rockets 132-124 on Wednesday night. \n\n\r\n                    LeVert was involved in the blockbuster January trade that sent James Harden from Houston to Brooklyn and Victor Oladipo from Indiana to Houston. While Oladipo struggled during his brief tenure in Houston, LeVert has starred with the Pacers, scoring at least 20 points in five of his last seven games. \n\n\r\n                    Sabonis was dominant in the paint, making 10 of 18 shots from the field while also grabbing 11 rebounds and adding seven assists. \n\n\r\n                    Brogdon fell one assist shy of his second career triple-double and his first since his rookie season in 2016-2017. He had 23 points, nine assists and 14 rebounds, one shy of his career high. \n\n\r\n                    “It’s just chemistry,” Brogdon said of the team’s latest improvements. “It’s guys learning how to play with each other and learning our strengths and weaknesses. When you add a huge playmaker and scorer and a great player like Caris LeVert, it’s going to take some time to get used to his style of play and for him to get used to how we play.”\n\n\r\n                    Indiana has won five of its last seven games and is 5-3 in April following a 6-8 record in March. \n\n\r\n                    “I just thought that we were playing very well and together,” Pacers coach Nate Bjorkgren said. “I thought we had that initial force right out of the gate. And there were some guys that really stepped up off the bench, too.” \n\n\r\n                    Houston has lost four straight and nine of 10. \n\n\r\n                    The Rockets were led by John Wall’s 31 points and nine assists. Christian Wood had 25 points and 13 rebounds, and Kelly Olynyk added 25 points, including 14 in the third quarter. \n\n\r\n                    Rockets coach Stephen Silas blamed the team’s continued struggles on a lack of effort, particularly at the start of the game. \n\n\r\n                    “It’s the same story, right? We get off to a bad start and then we have to try harder in the second half,” Silas said. “That’s not how we should play, that’s not how we should represent the Rockets, and that’s not how we’re going to be as a group. We’re going to fix it.”\n\n\r\n                    The Pacers led 33-24 at the end of the first quarter and took a 75-55 lead into halftime. The Rockets outscored Indiana 39-31 in the third quarter and pulled within seven with three minutes remaining before Indiana pulled away. \n\n\r\n                    Houston never led in the game. \n\n\r\n                    The Pacers have won three straight against Houston following a five-game losing streak in the series. \n\n\r\n                    HE SAID IT\n\n\r\n                    “Continuing to get on the guys about it, continuing to tell them about it. We’ve got to learn from it, and I’m not one to shy away from it -- we’ve got to be better. We’re just going to keep hammering it and letting them know.” -- Silas on improving the team’s effort\n\n\r\n                    PORTER AT THE BUZZER\n\n\r\n                    Rockets guard Kevin Porter Jr. wowed the Toyota Center crowd with a shot at the end of the first quarter that he made off the glass from nearly half court. The only problem was, the shot was released about a half-second after the buzzer and didn’t count. Porter got his revenge at the end of the third quarter, making a put-back layup in the nick of time. \n\n\r\n                    EARLY RISERS\n\n\r\n                    The Pacers will play their next two games in the early afternoon, first in Utah on Friday and then in Atlanta on Saturday. Bjorkgren was asked about what challenges the unique afternoon back-to-back set may pose.\n\n\r\n                    “It’s the schedule,” Bjorkgren said. “We want to take advantage of it the best we can. We’ve had early games before, and we’ll just worry about the next game and go from there.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Doug McDermott and Myles Turner missed the game with left ankle sprains. ... Former Rockets player Jeremy Lamb scored 18 points in 30 minutes off the bench. ... Indiana’s bench outscored Houston’s reserves 48-13. \n\n\r\n                    Rockets: D.J. Augustin (left ankle sprain) and Sterling Brown (left knee soreness) remained sidelined. Of the eight Rockets who played in the first game at Indiana on Jan. 6, only Wall and Jae’Sean Tate were still with the team and available to play Wednesday night. \n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Visit Utah on Friday night for the middle leg of a three-game trip. \n\n\r\n                    Rockets: Host the Denver Nuggets on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997124.44692
}