{
  "game_id": "0022300619",
  "espn_id": "401585247",
  "date": "Jan 24, 2024",
  "matchup": "CHA @ DET",
  "headline": "Bojan Bogdanovic and Jalen Duren help rally Pistons to a 113-106 win over the Hornets",
  "body": "DETROIT -- — Bojan Bogdanovic scored 34 points and Jalen Duren's dunk in the final minute punctuated a late 10-2 run, helping the Detroit Pistons to a 113-106 win over the Charlotte Hornets on Wednesday night.\n\n\r\n              Bogdanovic hit a game-tying 3-pointer with 1:46 left. Duren finished with 14 points and eight rebounds, and Alec Burks scored 15 for Detroit, which snapped a three-game losing streak and won for the third time in 41 games.\n\n\r\n              “Yesterday, we talked about competing, poise and execution,” Pistons coach Monty Williams said. “We had done those three things, but we hadn't closed. Tonight, we closed.”\n\n\r\n              Brandon Miller led the Hornets with 23 points, and Nick Richards added 21 points and 10 rebounds. \n\n\r\n              “We stopped moving the ball in the fourth quarter,” Hornets coach Steve Clifford said after his team scored 14 points in the final period. “We had done a good job with ball movement in the first three quarters, and that's what we have to do to win. We play pick-and-roll and move the ball.”\n\n\r\n              LaMelo Ball, playing his sixth game after an ankle injury, scored 17 points on 6-for-21 shooting and 1-for-8 sniping from 3-point range.\n\n\r\n              “He had a lot of open shots, but he is still finding his rhythm,” Clifford said. “He missed a lot of time, and you can't expect to come back and play great right away. There are going to be nights like this.”\n\n\r\n              The Hornets were playing for the first time since trading Terry Rozier to Miami for Kyle Lowry and a draft pick. Rozier had led the team in points and assists. \n\n\r\n              Detroit's last three wins have come against teams which had just made a trade.\n\n\r\n              A dunk by Richards gave the Hornets a 102-100 lead with 3:43, and another gave Charlotte a 106-103 lead with 2:02 to play.\n\n\r\n              Bogdanovic answered with a 3-pointer, and after a turnover by Ball, a tip by Duren tip gave Detroit a 108-106 lead with 1:12 left.\n\n\r\n              Ball missed inside and Duren's dunk with 37 seconds left made it 110-106.\n\n\r\n              Monte Morris, making his season debut after a quadriceps injury, led a 10-0 run that put Detroit up 76-68 midway through the third quarter. But Miller scored nine points in a 17-5 run that gave Charlotte the lead.\n\n\r\n              “Last night, it was hard for me to even sleep wondering if I was even going to get a bucket,” said Morris, who grew up north of the city in Flint. “This is just me getting my feet wet. I can get better.”\n\n\r\n              P.J. Washington's buzzer-beating 3-point gave the Hornets a 92-89 lead at the end of the quarter. But Charlotte missed its first four shots of the fourth, including three by Ball. That allowed the Pistons to build a five-point lead before going scoreless on nine straight possessions.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host the Houston Rockets on Friday.\n\n\r\n              Pistons: Host the Washington Wizards on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995650.97768
}