{
  "game_id": "0022300999",
  "espn_id": "401585627",
  "date": "Mar 20, 2024",
  "matchup": "TOR vs. SAC",
  "headline": "Sabonis has 24th triple-double as Kings rout short-handed Raptors 123-89",
  "body": "TORONTO -- — Domantas Sabonis had 13 points, 17 rebounds and 10 assists for his NBA-leading 24th triple-double of the season, De’Aaron Fox scored 20 points and the Sacramento Kings routed the short-handed Raptors 123-89 on Wednesday night, extending Toronto’s season-worst losing streak to eight.\n\n\r\n              Sabonis, who played fewer than 28 minutes, has recorded at least a double-double in 51 consecutive games, matching Kareem Abdul-Jabbar and Moses Malone for the 14th-longest streak in NBA history.\n\n\r\n              “What Domas does for us every single night, it’s impressive,” Sacramento’s Harrison Barnes said. “To be able to be a force, go to the glass, facilitate the way he does, score the way he does, draw the attention that defenses put towards him, it’s something that you always have to bring attention to. \n\n\r\n              \"His continued strong play is definitely All-NBA worthy.”\n\n\r\n              Kings coach Mike Brown said Sabonis deserves MVP consideration for his run of impressive performances.\n\n\r\n              “It’s a shame, but that’s who he is,” Brown said. “He’s a walking triple-double machine. I say it’s a shame because it should be celebrated a ton, but that’s what he does. When he doesn’t get a triple-double, you expect a double-double. He’s getting one of the two, and that’s why he should be in the conversation for MVP.”\n\n\r\n              Malik Monk scored 17 points and Barnes added 16 as the Kings won their second straight and fourth of five. Chris Duarte scored 14 points and Keegan Murray had 10 for the Kings, whose biggest lead was 38 points.\n\n\r\n              Fox has scored at least 20 points in each of his past five games.\n\n\r\n              Gary Trent Jr. scored 18 points and Ochai Agbaji and Jordan Nwora each had 13 for the Raptors, who are 1-9 in March.\n\n\r\n              The Raptors made 22 turnovers, leading to 33 points for the Kings.\n\n\r\n              Raptors guard Immanuel Quickley missed the game because of personal reasons, joining a lengthy list of absentees that also included All-Star forward Scottie Barnes (left hand), center Jakob Poeltl (left pinkie), forward RJ Barrett (personal), forward Chris Boucher (right knee) and guard DJ Carton (right ankle), \n\n\r\n              Toronto center Jontay Porter left after the first quarter because of an illness. \n\n\r\n              “We’re pretty thin right now,” Raptors coach Darko Rajakovic said.\n\n\r\n              Before the game, Rajakovic said there is no timetable for Quickley’s return.\n\n\r\n              “It’s a family matter,” Rajakovic said. “We’ll stay in touch with him and go day by day.”\n\n\r\n              Kings guard Kevin Huerter sat because of a dislocated left shoulder. Huerter left Monday night’s game against Memphis 1:51 into the first quarter following a collision with Desmond Bane.\n\n\r\n              Sacramento led 32-27 after one. Five different Kings players scored in an 11-0 run to end the first half, giving Sacramento a 68-45 edge at the intermission.\n\n\r\n              The Kings took a 99-65 edge to the fourth.\n\n\r\n              The Raptors fell to 13-21 at home, guaranteeing they will finish with a losing record on their home court this season.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit the Washington Wizards on Thursday night.\n\n\r\n              Raptors: Host the Oklahoma City Thunder on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996190.1327648
}