{
  "game_id": "0021801109",
  "espn_id": "401071782",
  "date": "Mar 26, 2019",
  "matchup": "MIA vs. ORL",
  "headline": "Magic win 6th straight, top Heat 104-99 in East showdown",
  "body": "MIAMI --  There was no raucous celebration by the Orlando Magic.\n\nGetting to eighth place now, that's not their goal. Being there -- or higher -- in two weeks is what matters, and on Tuesday night the Magic looked very much like a team poised to end a long postseason drought.\n\nNikola Vucevic scored 24 points and grabbed 16 rebounds, Jonathan Issac added 19 and the Magic extended their longest winning streak in eight years to six games by topping the Miami Heat 104-99.\n\n\"This time of year is when it's the most important,\" Vucevic said. \"We're fighting for a playoff spot and to win six is really huge and it gives us a big advantage right now so we've got to keep it up.\"\n\nD.J. Augustin scored 17 points and Aaron Gordon finished with 14 points and 10 rebounds for the Magic (37-38), who won the season series with Miami 3-1 and moved past the Heat (36-38) into eighth in the Eastern Conference playoff race.\n\nEvan Fournier scored 11 points for Orlando, which hasn't had a winning streak this long since January 2011.\n\n\"It's really encouraging. It's fun,\" Gordon said. \"There's an energy, there's a buzz in the gym when we come in, and it's just a beautiful thing.\"\n\nDion Waiters scored 26 points for Miami, which lost on the night the Heat raised Chris Bosh's No. 1 jersey to the rafters in a halftime retirement ceremony. Dwyane Wade scored 22 points and Josh Richardson added 17 for the Heat, who are assured of a losing home record this season -- they're 17-21 with three games left in Miami.\n\n\"You're going to feel great joy from wins and you're going to feel great pain from losses,\" Heat coach Erik Spoelstra said. \"That's how you want to be measured.\"\n\nOrlando dominated Miami on the backboards, outrebounding the Heat 55-39.\n\nWaiters made a 3-pointer with 14 seconds left to get Miami within three, but Augustin made a pair of foul shots to seal the win.\n\nThe Heat led by 17 in the first half, settling for a 51-42 lead at the break -- a 35-minute halftime in real time, because of the length of the ceremony paying tribute to Bosh.\n\nOrlando clearly wasn't deterred by the longer-than-usual intermission. The Magic controlled the third quarter, taking their first lead of the game with 5:11 left in the period on a 3-pointer by Issac. Orlando shot 57 percent in the quarter, held the Heat to 30 percent from the floor in those 12 minutes, outscored Miami by 15 points and took a 76-70 lead into the fourth.\n\nOrlando pushed the lead out to eight early in the fourth, before a 10-2 Heat run -- fueled in part by a four-point play from Wade -- tied the game at 82. Unbothered yet again, Orlando scored nine of the next 11 points and went up 91-84 on a 3-pointer by Vucevic with 5:56 remaining.\n\nMiami has eight games left, which would be the last eight games of Wade's career if the playoffs are missed.\n\n\"We're in the fight,\" Wade said. \"We've got a chance.\"\n\nTIP-INS\n\nMagic: This game started a four-game trip against East playoff contenders, with stops left in Detroit, Indiana and Toronto. \"We're going to have to go on the road and do it, but we have more than enough talent,\" Orlando coach Steve Clifford said. ... This was the 14th and final back-to-back of the season for the Magic. They were 10-4 in openers, 6-8 in second games.\n\nHeat: Wade played against Orlando for the 53rd and presumably final time. He's faced the Magic more times in the regular season than he has any other team. ... Justise Winslow turned 23 on Tuesday and sat out his sixth consecutive game with a thigh bruise. The Heat were also missing Rodney McGruder (knee). ... Kelly Olynyk played 23 minutes and is now 88 shy of 1,700 for the season -- and a $1 million bonus.\n\nMILESTONE\n\nWade now has 23,004 points in his career, the 30th NBA player to cross that threshold. He still has a chance of catching Elgin Baylor (23,133) for 29th on the league's career list.\n\nCONSISTENT\n\nThe Magic have used the same starting lineup in 28 straight games, going back to Jan. 23. To put that in some perspective, since Jan. 23 the Heat have used eight different starting lineups.\n\nPECULIAR\n\nThe Heat are now 2-2 in jersey-retirement games. They won when retiring jerseys for Shaquille O'Neal and Tim Hardaway, but lost when hoisting one for Alonzo Mourning -- also against Orlando, and also in the 74th Heat game of the season, just like Tuesday night.\n\nUP NEXT\n\nMagic: Visit Detroit on Thursday.\n\nHeat: Host Dallas on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995222.634772
}