{
  "game_id": "0021600115",
  "espn_id": "400899565",
  "date": "Nov 09, 2016",
  "matchup": "POR @ LAC",
  "headline": "Clippers roll past Blazers 111-80, improve to NBA-best 7-1",
  "body": "LOS ANGELES --  The Clippers are playing stingy defense and having fun doing it.\n\nBlake Griffin had 22 points and 13 rebounds, Chris Paul added 19 points and Los Angeles rolled past the Portland Trail Blazers 111-80 on Wednesday night to improve to an NBA-best 7-1 with its fourth straight victory.\n\n\"When you play defense the way we have been, it's a lot of fun,\" Griffin said. \"We enjoy getting stops and look forward to getting stops. Guys are just flying around, and even if someone makes a mistake, there's another guy to cover up for them. When you are playing basketball like that, it's a blast.\"\n\nIt was the second time the Clippers beat the Trail Blazers this season.\n\nThis one was never close.\n\nThe Clippers stunned Portland from the opening tip, shooting 59 percent in the first quarter. They built a 32-point lead in the first half, when Griffin had 17 points.\n\nLos Angeles' bench opened the second quarter on a 14-2 run to go up 50-18 before extending the lead to 61-32 at halftime.\n\n\"We got our (rear ends) whupped,\" Blazers guard Damian Lillard said. \"They had a lot of energy and they wanted it more than we did. They hurt us on the glass and we didn't take anything away from them.\"\n\nLillard, the NBA's second-leading scorer at 32.8 points per game, was held to eight. CJ McCollum, who was averaging 22.9 points, also scored eight for the Blazers.\n\nThey didn't have anyone in double figures until Shabazz Napier hit a 3-pointer with under 2 minutes left. He led the team with 11 points.\n\nDeAndre Jordan had 16 points and nine rebounds and J.J. Redick added 10 points for the Clippers, who sat their starters for good at 3:54 of the third quarter while owning a 44-point lead.\n\nIt was the fourth straight game that the Clippers had at least an 18-point lead in the first half.\n\n\"We kept telling each other to not play the score and respect the game,\" Jordan said of keeping up the defensive pressure. \"We wanted to make shots they took tough.\"\n\nBefore the starters left, they began the quarter with a 17-3 run that stretched the Clippers' lead to 78-35. Each of the five starters scored in the spurt. Paul and Luc Mbah a Moute each had a 3-pointer, and Jordan slammed down a two-handed, fast-break dunk off Griffin's alley-oop pass.\n\nIt was one of three signature dunks by Jordan in a period that ended with consecutive 3-pointers by reserves Marreese Speights and Austin Rivers, leaving the Clippers ahead 93-50.\n\nLos Angeles held Portland to 35 percent shooting. The Blazers shot just 6 of 30 on 3-pointers as their three-game winning streak was snapped.\n\n\"The Clippers beat us at both ends,\" coach Terry Stotts said. \"They were good at the rim, good on the free throw line, good at passing, good on defense, good in transition.\"\n\nTIP-INS\n\nTrail Blazers: They failed to score at least 100 points for the first time in nine games. ... They were held to 16 points in the first, a season low for a quarter. ... Portland was playing the second half of a back-to-back, having won at Phoenix by three points on Tuesday.\n\nClippers: With his fifth rebound in the first quarter, Griffin reached 4,000 in 417 career games, the second-fastest player since 1983-84 to reach 8,500 points, 4,000 rebounds and 1,500 assists. Chris Webber did so in 408 games. ... Jordan played his 600th career game, joining Randy Smith (715) and Eric Piatkowski (616) as the only players in franchise history to do so.\n\nALL IN\n\nEveryone on Portland's roster saw action except Al-Farouq Aminu and Festus Ezeli, who are injured. All but Ed Davis scored. The only Clipper not to play was Paul Pierce, and all 12 of their players scored.\n\nSECOND UNIT\n\nThe Clippers' second unit was led by Speights with 12 points. The fourth was the only quarter won by the Blazers, who outscored the Clippers' reserves 30-18.\n\nUP NEXT\n\nTrail Blazers: Host Sacramento on Friday, a team that's lost to the Blazers in six straight games and 10 of the last 12 matchups.\n\nClippers: Visit Oklahoma City on Friday, the only team they have lost to so far. The Thunder won by two points in L.A. last week.",
  "source": "espn_api",
  "crawled_at": 1764995675.5187252
}