{
  "game_id": "401809993",
  "espn_id": "401809993",
  "date": "Oct 30, 2025",
  "matchup": "CHA vs ORL",
  "headline": "Wagner scores 21 and the Magic snap a 4-game skid with a 123-107 win over the Hornets",
  "body": "CHARLOTTE, N.C. -- — Franz Wagner scored 21 points and the Orlando Magic snapped a four-game losing streak with a 123-107 victory over the Charlotte Hornets on Thursday night. \n\n\r\n              Paolo Banchero had 18 points, nine rebounds and nine assists for the Magic, who led by as many as 20 points in their second win of the season. Wagner was questionable with a left heel contusion going into the game but started.\n\n\r\n              LaMelo Ball had 17 points and 13 assists for the Hornets, his third double-double of the season. \n\n\r\n              The Magic were playing the second of a back-to-back, after falling 135-116 loss to the Pistons on Wednesday. \n\n\r\n              Ball was fined $35,000 by the NBA earlier in the day for making an obscene gesture during the fourth quarter of a 144-117 loss to Miami on Tuesday night. Ball is averaging 26.3 points, 9.5 assists and 8.3 rebounds this season. \n\n\r\n              Charlotte started three rookies for the first time in its history with Kon Knueppel, Sion James and Ryan Kalkbrenner. Knueppel, who made 16 3-pointers through his first four games and had five in the loss to Miami, was held to one by Orlando. \n\n\r\n              Orlando went up 53-40 with 7:04 left in the first half on Desmond Bane's basket and led by 71-58 at the break. It was the Magic's most first-half points this season. \n\n\r\n              Kalkbrenner's layup got Charlotte within 83-76 with 5:11 to go in the third quarter. Miles Bridges got the Hornets even closer with a short jumper that made it 88-85 and Orlando held a 92-85 lead going into the final period. \n\n\r\n              Tristan da Silva's 3-pointer stretched Orlando's lead to 104-87. \n\n\r\n              Last season, Orlando swept its four meetings with Charlotte.\n\n\r\n              Up Next\r\n              Magic: Visit the Washington Wizards on Saturday. \n\n\r\n              Hornets: Host the Minnesota Timberwolves on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042529.1802099
}