{
  "game_id": "0022200974",
  "espn_id": "401469129",
  "date": "Mar 06, 2023",
  "matchup": "MIA vs. ATL",
  "headline": "Butler scores 26, Heat bench adds 59 in 130-128 win vs Hawks",
  "body": "MIAMI -- — Miami got the breathing room it needed over Atlanta. And now the Heat will take a bit of momentum into trying to chase down others in the Eastern Conference.\n\n\r\n              Jimmy Butler had 26 points, Victor Oladipo and Caleb Martin combined to score 43 off the bench, and the Heat held off the Atlanta Hawks 130-128 on Monday night.\n\n\r\n              Butler also had nine rebounds and nine assists for Miami (35-31), which swept a two-game set from the Hawks and moved 2 1/2 games clear of Atlanta in the race for No. 7 in the East. The Heat took the season series 3-1, so they hold the tiebreaker as well.\n\n\r\n              “Our guys are competitors. They love these kind of games,” Miami coach Erik Spoelstra said. “It gets my stomach twisting and turning and everything. But these guys just love it. It was important to get this two-game set. We knew the context of it.”\n\n\r\n              Bam Adebayo scored 16 points, Duncan Robinson had 14, Tyler Herro finished with 13 and the Heat set a season high with 59 bench points. They also made 16 3-pointers, their most in a game since Dec. 15.\n\n\r\n              “We grinded it out,” said Martin, who had 21 points, one fewer than Oladipo. “That's what we do.”\n\n\r\n              The Heat rallied to win from 15 or more points down for the fourth time this season, and improved to 14-8 in games decided by three points or less.\n\n\r\n              Trae Young scored 25 for Atlanta, which got 23 from Dejounte Murray and 17 apiece from Saddiq Bey and John Collins.\n\n\r\n              “We've been really moving the ball, scoring,” Young said. “We've just got to make a little more effort on the defensive end.”\n\n\r\n              The Heat led for 1:07 in the very early going, but Atlanta had control by the end of the opening quarter. The Hawks shot 76% (19 for 25) in the first 12 minutes, led by as many as 15 and took a 43-30 edge into the second. It was the most points allowed by Miami in any quarter this season.\n\n\r\n              Coming off an off day Sunday, Atlanta was flying at the start.\n\n\r\n              “I want us to be the best team we can be by the end of the year,\" Hawks coach Quin Snyder said. “And that’s really what it comes down to, how can we keep improving? Obviously, we want to win — record, standings, playoffs — but I think we’ll be better off if we continue to improve. And in order to do that, sometimes you need to have an off day.”\n\n\r\n              Atlanta kept the lead until the fourth, with the Heat chipping away. Martin had 16 points in the second quarter off the bench to help Miami get within 68-63 at halftime, and the Hawks’ lead was 96-92 entering the fourth.\n\n\r\n              A pair of free throws by Adebayo gave Miami the lead for the first time since those opening moments with 9:38 left, the start of five lead changes in a four-minute span.\n\n\r\n              De'Andre Hunter scored 14, while Clint Capela and Bogdan Bogdanovic each had 12 for Atlanta.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: The 43-point first quarter was the most Atlanta had ever scored in 601 quarters all-time against Miami. It was also the Hawks' second-highest scoring quarter of the season; they had 49 in the second quarter against Cleveland on Feb. 24. ... Monday marked the sixth time this season the Hawks had seven players in double figures, and they were all there by the midpoint of the third quarter. They’re now 3-3 in those games.\n\n\r\n              Heat: PG Kyle Lowry missed his 13th consecutive game with left knee soreness and is still hopeful of a return later this week. ... PF Kevin Love (bruised right rib) missed the game, his first absence since signing with the Heat. He did an on-court workout pregame and is day-to-day.\n\n\r\n              ANOTHER SERIES\n\n\r\n              The Hawks and Heat played a two-game set in Miami, and now another two-game, one-place set awaits both clubs. Atlanta goes to Washington for its next two games, while Miami plays host to Cleveland for two.\n\n\r\n              CELEB WATCH\n\n\r\n              Among those in the crowd: Kate Upton and Justin Verlander, seated with Heat managing general partner Micky Arison, and Floyd Mayweather.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Visit Washington on Wednesday.\n\n\r\n              Heat: Host Cleveland on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993929.479926
}