{
  "game_id": "0022400861",
  "espn_id": "401705427",
  "date": "Mar 01, 2025",
  "matchup": "BKN @ DET",
  "headline": "Cunningham breaks out of slump to lead Pistons past Nets 115-94",
  "body": "DETROIT -- — Cade Cunningham broke out of a slump by scoring nine of his 15 points in the fourth quarter and the Detroit Pistons pulled away to beat the Brooklyn Nets 115-94 on Saturday night.\n\n\r\n              Cunningham scored a season-worst 11 points Friday in a 134-119 loss to Denver and only had six points through three quarters against the Nets, but had a 3-pointer and two three-point plays. \n\n\r\n              Tobias Harris, Malik Beasley and Jalen Duren all scored 18 points for the Pistons, who had their eight-game winning streak snapped by the Nuggets.\n\n\r\n              Tyrese Martin came off the bench to score 23 points for the Nets, who have lost four straight. Brooklyn's starters were outscored 73-47.\n\n\r\n              The Nets were within six at the start of the fourth, but Cunningham scored six points in a 16-6 run that made it 95-81 with 7:33 left.\n\n\r\n              Takeaways\r\n              Nets: PG Killian Hayes played the first four years of his career with the Pistons before being waived in February 2024. He signed with the Nets last summer, was waived before the season and rejoined them on a 10-day contract last week. He was booed loudly by a crowd that saw him as a symbol of the 67-219 (.234) record during his time with the team. \n\n\r\n              Pistons: After starting slowly in the loss to Denver, Detroit shot 68.2% (15 for 22) from the floor while outscoring the Nets 39-22 in the first quarter. That included 77.8% (7 for 9) on 3-pointers.\n\n\r\n              Key moment\r\n              The Pistons led 68-43 at halftime, but collapsed offensively in the third quarter. They shot just 26.3% (5 for 19) from the floor, missed nine of 10 3-pointers and turned the ball over five times. \n\n\r\n              Key stat\r\n              With a chance to get back into it, the Nets missed 14 of their first 16 shots in the fourth, including all six 3-point attempts.\n\n\r\n              Up next\r\n              The Pistons are at Utah on Monday night, while the Nets visit San Antonio on Tuesday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997972.002911
}