{
  "game_id": "0022300985",
  "espn_id": "401585613",
  "date": "Mar 18, 2024",
  "matchup": "PHI vs. MIA",
  "headline": "Tyrese Maxey, Kelly Oubre Jr. post double-doubles and lead 76ers past Heat 98-91",
  "body": "PHILADELPHIA -- — Kyle Lowry hustled after a loose basketball and launched himself over the scorer's table and into the lap of the public address announcer.\n\n\r\n              Lowry turns 38 next week and joked that at his age, he has “no brakes.” But his feet flying in the air is just the way the 76ers' guard plays — no extra incentive needed, not even in his first game against his former Heat teammates.\n\n\r\n              “I think the juice was that we understood it was a big game for the standings,” Lowry said. “I love and admire those guys so much. I still root for them, except when we play against them. There was no added juice.”\n\n\r\n              Tyrese Maxey had 30 points and 10 assists and Kelly Oubre Jr. had 22 points and 11 rebounds to help Philadelphia hold off Miami 98-91 Monday night in a potential preview of an NBA play-in tournament game.\n\n\r\n              Lowry shot 6 of 12 and scored 16 points for the Sixers in his first game against the Heat since they traded him in January.\n\n\r\n              “He was being a little ornery at shootaround today and he hasn't been yet,” said coach Nick Nurse, who won an NBA title with Lowry in Toronto. “I feel like he's getting back to more of his normal self.”\n\n\r\n              Bam Adebayo had 20 points and 13 rebounds for the Heat. Terry Rozier III scored 20 points.\n\n\r\n              The Heat trailed by 14 points entering the fourth, before going on a 20-8 run and tying the game at 85 on Caleb Martin’s dunk. Buddy Hield snapped the tie with 3-pointer and Lowry hit a 3, helping the Sixers avoid a collapse in a game they needed to win.\n\n\r\n              The Eastern Conference champion Heat are again in play-in mode with 14 games left this season, falling to eighth in the standings — they finished seventh a year ago when Jimmy Butler sparked an improbable run to the NBA Finals. With Indiana's loss, the 76ers are barely in sixth at 38-30 — Indiana is 38-31; the Heat 37-31. \n\n\r\n              The Sixers had been in an ugly spiral after spending most of the season as a surefire conference contender, until losing Joel Embiid to a knee injury in late January.\n\n\r\n              Butler (right foot contusion) and Embiid (who continues to rehab) missed Monday’s game. Sixers forward Tobias Harris (right ankle sprain) also missed this one, and Miami's Duncan Robinson was forced out of the game with a bad back, leaving both teams devoid of star power — except for Maxey.\n\n\r\n              Nurse remained optimistic Embiid could return before the end of the season.\n\n\r\n              “I think he kind of rounds back into shape and rhythm pretty quickly,” Nurse said. “I think obviously the more games we have him, the better. I also think we want to get to a point where he’s as healthy as he can be at playoff or play-in time.”\n\n\r\n              At this pace, the Heat and Sixers could play each other in the play-in tournament. In the fourth year of the format, the No. 7 seed plays No. 8. The winner is in, and gets the No. 7 seed for the playoffs. The loser has a second chance.\n\n\r\n              “We’re going to try and fight like heck to finish as high as we can,” Nurse said.\n\n\r\n              Because of injuries, the Heat have used a franchise-record 32 starting lineups. They are trying to find consistency down the stretch and stave off a potential second straight run that starts with the play-in.\n\n\r\n              “We’re not thinking about last year, not thinking about any of the narratives,” Heat coach Erik Spoelstra said. \n\n\r\n              Without Embiid, Maxey steadied the Sixers and dropped 18 points in the first half to help the Sixers win their second straight game following a skid in which they dropped seven of 10. \n\n\r\n              UP NEXT \n\n\r\n              Heat: Play Wednesday at Cleveland.\n\n\r\n              76ers: Harris will join the team as it opens a four-game trip in Phoenix on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996413.24442
}