{
  "game_id": "0022401106",
  "espn_id": "401705672",
  "date": "Apr 02, 2025",
  "matchup": "MIA @ BOS",
  "headline": "Heat extend winning streak to 6 games and snap Celtics' 9-game streak with 124-103 victory",
  "body": "BOSTON -- — Tyler Herro had 25 points and nine assists and the Miami Heat extended their season-best winning streak to six games with a 124-103 victory over the Boston Celtics on Tuesday night. \n\n\r\n              Bam Adebayo had 21 points for Miami, which had seven players finish in double figures to cap a 3-0 road trip.\n\n\r\n              The Heat's run of wins come after a stretch last month during which they lost 10 consecutive games. They played without Andrew Wiggins (hamstring), Duncan Robinson (back) and Kevin Love (personal reasons). \n\n\r\n              Jaylen Brown had 24 points and nine rebounds for the Celtics, who had their season-best nine-game win streak snapped. Jayson Tatum and Derrick White both added 16 points apiece.\n\n\r\n              Boston trimmed a 22-point deficit to 91-87 in the fourth quarter. But the Heat responded with a 22-9 spurt to rebuild their cushion. \n\n\r\n              Takeaways\r\n              Heat: Miami showed why it will again be a scary play-in matchup, getting solid contributions up and down its roster with key players out.\n\n\r\n              Celtics: They weren’t as sharp coming off their 6-0 road trip. But coach Joe Mazzulla did get to experiment with some different rotations with Jrue Holiday (shoulder), Kristaps Porzingis (rest) and Al Horford (toe sprain) all sitting out. \n\n\r\n              Key moment\r\n              The Heat built on a strong first half by opening the third quarter on a 10-3 run to take their 22-point lead. But Boston roared back, using a 16-1 run to trim the deficit to three late in the period. \n\n\r\n              Key stat\r\n              Heat coach Erik Spoelstra got the 785th win of his regular-season career, breaking a tie with Gene Shue for 17th on the NBA’s all-time list. Next up: No. 16 Cotton Fitzsimmons, with 832 wins.\n\n\r\n              Up next\r\n              The Heat host the Grizzlies on Thursday. The Celtics host the Suns on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998265.689787
}