{
  "game_id": "0022200120",
  "espn_id": "401468275",
  "date": "Nov 04, 2022",
  "matchup": "CLE @ DET",
  "headline": "Love, Allen lead short-handed Cavaliers to rout of Pistons",
  "body": "DETROIT -- — Kevin Love had 21 points, 10 assists and eight rebounds as the short-handed Cleveland Cavaliers beat the Detroit Pistons 112-88 on Friday night for their seventh straight win.\n\n\r\n              Jarrett Allen scored 22 points and Cedi Osman added 15 as the Cavaliers had a 54-21 edge in bench scoring and a 58-24 edge in points in the paint.\n\n\r\n              The Cavaliers played without guards Darius Garland (knee) and Donovan Mitchell (ankle), who were both injured in an overtime win over the Boston Celtics on Wednesday.\n\n\r\n              “We obviously have a ton of respect and appreciation for Darius and Donovan, but we've got some really good basketball players that are with them,” Cavaliers coach J.B. Bickerstaff said. “Tonight showed we've got a really good, deep basketball team.”\n\n\r\n              Evan Mobley added 11 points, eight rebounds and a career-high eight blocks.\n\n\r\n              “It wasn't just eight blocks — it was eight blocks that retained possession and he did it without committing a foul,” Bickerstaff said. “That's old school Bill Russell stuff we're talking about.”\n\n\r\n              Cade Cunningham had 19 points for Detroit, but scored only three in the second half. Bojan Bogdanovic, who came into the game leading the Pistons in scoring at 21.8 points, scored six on 2-for-9 shooting. \n\n\r\n              “We lost our composure — when they turned up the defense, we lost our minds,” Pistons coach Dwane Casey said. “We have to get back to the fundamentals. When a good team gets after us, we can't forget what we've been working on.”\n\n\r\n              The Pistons have lost three straight and eight of nine. Their last three games have come against teams with a combined record of 17-1.\n\n\r\n              Without Garland and Mitchell, the Cavaliers took their offense inside, outscoring Detroit 34-10 in the paint in the first half. Both teams were under 30 percent on 3-pointers in the half, but Cleveland's ability to get to the rim let it lead by as many as 21 points on the way to a 57-39 halftime advantage. \n\n\r\n              “My main goal tonight was to bring the same kind of energy that we get from two stars,” Allen said. “We knew we had to win as a team, which meant sharing the ball, making sure everyone got their touches and that we played together.”\n\n\r\n              The Cavaliers led 90-68 at the end of the third quarter and Love added a four-point play on the first possession of the fourth to end any doubt.\n\n\r\n              PASSING ON PADDING HIS STATS\n\n\r\n              Love only played 3:34 in the fourth quarter despite only needing two rebounds for a triple double.\n\n\r\n              “That shows you what kind of player Kevin is,” Bickerstaff said. “I discussed it with him, and he told me to do what was best for the game, and that was to give some minutes to our younger guys.”\n\n\r\n              TIP INS\n\n\r\n              Cavaliers: Mitchell and Garland combined for 54 points, 16 assists and nine rebounds in 86 minutes against the Celtics, but Cleveland didn't miss a beat without them against Detroit. ... Cleveland is 7-3 in its last 10 games against the Pistons. \n\n\r\n              Pistons: Isaiah Livers scored 11 of Detroit's 21 bench points. No other reserve had more than one field goal. “We lost a big piece in Marvin (Bagley III), but we have good players on the bench,” Livers said. “That's not what it is. It's a matter of how we play.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit the Los Angeles Lakers on Sunday.\n\n\r\n              Pistons: Host the Oklahoma City Thunder on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995257.955025
}