{
  "game_id": "0021600722",
  "espn_id": "400900143",
  "date": "Jan 30, 2017",
  "matchup": "DAL vs. CLE",
  "headline": "Barnes, last-place Mavs topple James, Love-less Cavs",
  "body": "DALLAS -- Yogi Ferrell was hours away from playing in an NBA Development League game when he got a call that Dallas wanted to sign him.\nThree days, two games and about 1,500 miles later, Cleveland stars LeBron James and Kyrie Irving, along with the defending champion Cavaliers, know a little more about the rookie guard from Mavericks owner Mark Cuban's alma mater.\nFerrell scored a career-high 19 points while helping cool off Irving, and the last-place Mavericks knocked off a title contender for the second straight night in a 104-97 win Monday over the Cavaliers, who were missing Kevin Love because of recurring back spasms .\nFerrell, the former Indiana player with the given first name of Kevin, outscored Irving in the second game of a 10-day contract, a night after hitting clinching free throws in the final seconds of a win at San Antonio.\n\"Was it in Erie or Buffalo?\" Mavericks coach Rick Carlisle asked while trying to remember where the Long Island Ducks were playing when Ferrell got the call because of Dallas' injury issues at point guard. \"I don't know. Nobody knows. Nobody knows where he came from.\"\nIt was Erie, and Ferrell helped limit Irving to 7-of-21 shooting to end a six-game streak of at least 20 points during which the Cavs All-Star averaged 30 points.\n\"I am living the dream right now,\" said the 23-year-old Ferrell, who spent four seasons with the Hoosiers, went undrafted and played 10 games for the Brooklyn Nets before getting waived in December.\nJames led the Cavaliers with 23 points, but combined with Irving for just one point in the fourth quarter, 2-of-14 shooting from 3-point range and 11 of their team's 17 turnovers. Dallas had just nine turnovers.\nCleveland was showing signs of settling down, winning two straight after a tumultuous eight-game stretch that included six losses and James questioning whether the front office was satisfied with one title.\nBut the Cavaliers finished 7-8 in January by falling behind for good early in the second quarter against a team that was 0-9 on the second night of back-to-backs and lost by 38 in Cleveland in November.\nThat was the largest winning margin of the season for the Cavaliers and the most lopsided loss for Dallas.\n\"I don't even remember November,\" said James, who had nine rebounds and nine assists. \"Play every game. It doesn't matter what you did in the game before.\"\nHarrison Barnes led Dallas with 24 points and a season-high 11 rebounds for his second double-double of the season. Wesley Matthews scored 21 points.\nFerrell hit a 3-pointer and a driving layup to give the Mavericks their biggest lead at 102-85 with 3:52 remaining. At the next timeout, with the Cavaliers down by 15, coach Tyronn Lue pulled James and Irving after they had each missed their only two shots of the fourth quarter.\n\"For me, it's one of those games where they were faster than us,\" Lue said. \"They were attacking the basket. They just ran faster and harder than us.\"\nTIP-INS\nCavaliers: The Cavaliers dropped to 3-6 on the second night of back-to-backs and 3-3 without Love. ... Channing Frye scored 11 of his 13 points in the fourth quarter, with three 3-pointers. ... Cleveland's biggest lead was eight in the first quarter after a 22-5 run.\nMavericks: Seth Curry scored 16 points, and Dwight Powell had 14 points and eight rebounds. ... C Andrew Bogut was out again with a right hamstring strain after playing just eight minutes a night earlier in San Antonio. He had played the past three games after missing the previous six.\nLOVE UPDATE\nAn MRI revealed no structural damage in the All-Star reserve forward's back, but he will miss Wednesday's game at home against Minnesota. He could be out longer.\nA LITTLE TONIC\nInjuries played a big role in Dallas getting off to a 3-15 start, the worst for the franchise in the past two decades. But the Mavericks are 7-3 in their last 10, and beat the defending champs to follow their first regular-season win in San Antonio since 2010. \"With the things that we've gone through this year, to win two games like this gives you energy,\" Carlisle said.\nUP NEXT\nCavaliers: After hosting the Timberwolves, four straight on the road, capped by a visit to Oklahoma City 11 days after a 16-point home win over Russell Westbrook's crew.\nMavericks: At home against Philadelphia on Wednesday, the first of four straight against teams with losing records, including a home-and-home with Portland four days apart.",
  "source": "espn_api",
  "crawled_at": 1764996125.659899
}