{
  "game_id": "0022400701",
  "espn_id": "401705267",
  "date": "Feb 03, 2025",
  "matchup": "ATL @ DET",
  "headline": "Young's fadeaway with 1.6 seconds left lifts Hawks to slump-busting 132-130 win over Pistons",
  "body": "DETROIT -- — Trae Young made a 23-foot fadeaway with 1.6 seconds left and scored 17 of his 34 points in the fourth quarter, lifting the Atlanta Hawks to a 132-130 win over the Detroit Pistons on Monday night.\n\n\r\n              Young helped the Hawks end an eight-game losing streak.\n\n\r\n              Cade Cunningham had 30 points and 14 assists for the Pistons, who failed to attempt a shot on their final possession.\n\n\r\n              Atlanta's De’Andre Hunter had 20 points and rookie Zaccharie Risacher added 17 points.\n\n\r\n              Detroit's Tobias Harris scored 22, Jalen Duren had 18 points and nine rebounds and Malik Beasey scored 18.\n\n\r\n              Takeaways\r\n              Hawks: Young was listed as probable with right Achilles tendonitis, but left no doubt he was healthy enough to lead a banged-up team without Jalen Johnson. Young was 9 of 16 overall, 4 of 8 on 3-pointers and made 12 of 14 free throws, including some late in the game to seal a much-needed victory for his slumping team.\n\n\r\n              Pistons: Beasley has been a bargain with a $6 million, one-year contract. He's on pace to break the team's single-season record for 3-pointers. Beasley made six shots beyond the arc against the Hawks to give him 191 3-pointers this season to tie Alan Houston (1995-96) and close in on Saddiq Bey's franchise-record 211 set three years ago.\n\n\r\n              Key moment\r\n              Daniels poked the ball away from Cunningham, who had a costly turnover with 35 seconds left when Detroit was down one point.\n\n\r\n              Key stat\r\n              Atlanta's Dyson Daniels had 19 points, six rebounds, seven assists, four steals and three blocks. He became the first Hawk since Paul Millsap eight years ago to have more than 15 points, five rebounds, five assists, three steals and three blocks in a game — and the 21-year-old Australian did it in three quarters.\n\n\r\n              Up next\r\n              The Pistons play the NBA-leading Cleveland Cavaliers at home and the Hawks host San Antonio on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997922.674273
}