{
  "game_id": "401810010",
  "espn_id": "401810010",
  "date": "Nov 02, 2025",
  "matchup": "LAL vs MIA",
  "headline": "Lakers beat Heat 130-120 behind Doncic's triple-double",
  "body": "LOS ANGELES -- — Luka Doncic had 29 points, 11 rebounds and 10 assists, Austin Reaves scored 26 points, and the Los Angeles Lakers beat the Miami Heat 130-120 on Sunday night to extend their winning streak to three games.\n\n\r\n              Jamie Jaquez Jr. scored 31 points for the Heat and Bam Adebayo and Pelle Larsson added 17 points each.\n\n\r\n              The Heat never led. The Lakers jumped to a 8-0 lead and led by 18 points in the first half.\n\n\r\n              Jake LaRavia had 25 points off the bench for LA and Jaxson Hayes scored a season-high 15 points. He made all seven of his shots and his first 3-pointer as a Laker. \n\n\r\n              LaRavia had a big left-handed dunk early in the fourth quarter and Reaves set him up in the fourth quarter with an alley-oop pass that led to another dunk and a 118-110 lead with just under five minutes left.\n\n\r\n              The Lakers again played short-handed. LeBron James has yet to play this season because of sciatica on his right side and DeAndre Ayton was out with back spasms. James is targeted to return this month. \n\n\r\n              He got up off the bench when his son Bronny James converted a dunk off an alley-oop pass from Reaves in the first quarter. Reaves was setting up his teammates nicely and finished with 11 assists.\n\n\r\n              LA's Marcus Smart earned his 1,000th career steal.\n\n\r\n              Dodgers owner Mark Walter sat courtside one day after the Dodgers won the World Series in Game 7 in Toronto. It’s been a big week for Walter, who also finalized the purchase of a majority stake in the Lakers. \n\n\r\n              Up next\r\n              Heat: At Clippers on Monday night.\n\n\r\n              Lakers: At Portland on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042550.0672
}