{
  "game_id": "0021800615",
  "espn_id": "401071291",
  "date": "Jan 09, 2019",
  "matchup": "CHI @ POR",
  "headline": "McCollum scores 24 points, Trail Blazers beat Bulls 124-112",
  "body": "PORTLAND, Ore. --  The Trail Blazers are taking advantage where the schedule allows.\n\nCJ McCollum had 24 points and the Portland Trail Blazers pulled away in the final quarter to send the Chicago Bulls to their fifth straight loss, 124-112 on Wednesday night.\n\nJusuf Nurkic had 18 points and eight rebounds but got into foul trouble and came up just short of his fifth straight game with 20 or more points. Portland has won three straight and five of its last six games.\n\nDamian Lillard, who leads the team in scoring, said he's been good with letting others take some of the load. Lillard finished with 16 points and 10 assists for his fifth double-double of the season.\n\n\"We had a stretch we played against all playoff teams. Not looking down on any of our past few opponents but they've been teams where we've been able to get things that we might not have been able to get against those other teams because we're so familiar with them, their style,\" Lillard said. \"So I've just kind of been letting the game happen, making the right plays and guys have been playing really well.\"\n\nWendell Carter Jr. had 22 points to lead the Bulls in the first of a five-game road trip.\n\nAfter a tight first half, the Blazers led by as many as 11 points in the third quarter but the Bulls kept the margin from getting any wider until Meyers Leonard's dunk put Portland up 106-94 with just under eight minutes left in the game.\n\nA pair of consecutive 3-pointers from McCollum and Seth Curry put the Blazers up 112-96 and Portland went on to lead by as many as 19 points down the remaining stretch.\n\n\"Rebounding and our pick and roll coverage wasn't the best tonight,\" Carter said. \"It was just an effort thing, we didn't stick to the game plan like we were supposed to. We're learning and growing. I have no regrets about what we did tonight. We learn and move on.\"\n\nBulls coach Jim Boylen said before the game that Bobby Portis would be on a 24-minute restriction. Portis returned Sunday from a sprained right ankle that kept him out of seven straight games. He finished with 15 points in 19 minutes against the Blazers.\n\nPortland was without Maurice Harkless, because of left knee soreness. Jake Layman started in his place. Harkless, who had surgery on the knee last March, has missed 14 games this season because of the knee.\n\nThe Blazers held a 30-29 edge after a close first quarter but they began to pull away in the second, going up 41-35 after Nic Stauskas' 3-pointer. Portland briefly extended the lead to 10 points and 54-45 but led 56-51 at halftime. CJ McCollum led the Blazers with 12 points at the break, while Zach LaVine had 12 for the Bulls.\n\nNurkic was called for his fourth foul with 6:30 left in the third quarter and headed for the bench. Portland began to pull away late in the quarter, with Seth Curry's 3-pointer putting the Blazers up 95-85.\n\nIn his seven previous games, Nurkic he averaged 21.9 points and 11.9 rebounds. He had 20 points in Portland's 111-101 victory over the Knicks on Monday.\n\nChicago, which had six players in double figures, fell to the Nets 117-100 on Sunday before embarking on the five-game road trip.\n\nThe last time the Bulls were in Portland, in January last year, McCollum had 50 points in a 124-108 Blazers' victory.\n\nTIP-INS\n\nBulls: Forward Jabari Parker has played in only one of the Bulls' last six games, and has been a coach's decision DNP in eight total games. It has led to speculation that Chicago is seeking to trade the four-year veteran out of Duke. Parker signed a two-year, $40 million deal with the Bulls last July. He has appeared in 30 games with the Bulls this season, with 17 starts, and is averaging 14.9 points and 6.8 rebounds.\n\nTrail Blazers: It was the first of two meetings with the Bulls. Portland won both of the games against Chicago last season. ... Lillard was holding his left arm when he came of the court at the end of the third quarter but Portland's trainers did not attend to him, so it did not appear to be serious. \"I went up for an offensive rebound and my arm got caught up and I turned my elbow a little bit,\" he said.\n\nBENCH RULES: Portland's bench outscored Chicago's bench 56-41. The Blazers improved to 6-0 when the bench has at least 50 points.\n\n\"I liked the activity, more than anything else. I liked the activity and the flow of the second unit,\" `Blazers coach Terry Stotts said.\n\nUP NEXT\n\nBulls: Visit Golden State on Friday night.\n\nTrail Blazers: Host Charlotte on Friday night in the last game of a five-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994817.734694
}