{
  "game_id": "0022200857",
  "espn_id": "401469012",
  "date": "Feb 13, 2023",
  "matchup": "CHA vs. ATL",
  "headline": "LaMelo Ball leads Hornets to wire-to-wire victory over Hawks",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball had 30 points and 15 assists, Terry Rozier added 29 points and the Charlotte Hornets held off the Atlanta Hawks 144-138 on Monday night to snap a seven-game losing streak.\n\n\r\n              Gordon Hayward scored 26 points and P.J. Washington chipped in with 22 as the Hornets shot 63% from the field. Ball had six 3-pointers and Rozier hit five as Charlotte tied a season high with 20 made 3s.\n\n\r\n              Rookie center Mark Williams finished with 15 points and a huge block on Trae Young's 3-point attempt in the final minute.\n\n\r\n              Ball put on a show, finishing 12 of 19 from the field and 6 of 10 from beyond the arc. When he wasn't scoring, he was creating off the dribble and finding open teammates. He had four turnovers, but the good far outweighed the bad.\n\n\r\n              “One thing about Melo is he’s a gamer,” Rozier said. “He can be having any type of day, good or bad, but once he’s in that game he just hoops. Nothing that he does surprises me anymore. He’s a true gamer.”\n\n\r\n              It was the second-highest point total in Hornets franchise history, behind the 158 they scored against Indiana last season.\n\n\r\n              “I thought they were the more aggressive team from start to finish,\" Hawks coach Nate McMillan said. \"They averaged 30-plus points each quarter. We never really established defensively that we could get stops consistently, and 21 fast-break points, they basically just got to their tempo and were the aggressive team.” \n\n\r\n              Young finished with 25 points and 14 assists for the Hawks, who had their two-game win streak snapped. Clint Capela added 22 points, DeAndre Hunter had 21 and Dejounte Murray scored 20 for Atlanta.\n\n\r\n              Charlotte entered tied for the most losses in the NBA with 43, but the Hornets never trailed in this one as they raced to a 14-point lead behind 21 first-half points from Hayward.\n\n\r\n              Charlotte extended its advantage to 17 early in the fourth quarter when Ball found Washington in the left corner for a wide-open 3. But the Hawks wouldn't quit, cutting the deficit to two with 2:22 left when Young knocked down a 3 from the right wing.\n\n\r\n              A few possessions later, Young had a chance to tie the game on a step-back 3, but the 7-foot Williams stepped out to block the shot with his long wingspan.\n\n\r\n              Hayward gathered the loose ball and fired a lookahead pass to Williams, who avoided a defender and scored on a Euro step with 52.8 seconds to go, bringing the crowd to its feet.\n\n\r\n              “He has great hands and great agility for a man his size,” Hornets coach Steve Clifford said. “That was a big-time play.”\n\n\r\n              Williams entered the starting lineup when the team traded Mason Plumlee to the Los Angeles Clippers on Thursday. Williams has become a solid shot blocker, but Clifford wants to see him continue to improve on the defensive end.\n\n\r\n              “He just has to keep learning,” Clifford said. “He is super talented. The hardest thing for him (and backup Nick Richardson) in a game like this is the pick-and-roll stuff where they tattooed us.\"\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Saddiq Bey, acquired in a trade with Detroit, made his first start for the Hawks with John Collins out due to a sore hip flexor. Bey was quiet in the first quarter but finished with 12 points, including three 3s.\n\n\r\n              Hornets: Ball set a franchise record by making a 3-pointer in his 47th straight game. ... Charlotte was 20 of 37 from 3-point range.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host the New York Knicks on Wednesday night.\n\n\r\n              Hornets: Wrap up a three-game homestand Wednesday night vs. San Antonio.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994250.580152
}