{
  "game_id": "0021501109",
  "espn_id": "400828996",
  "date": "Mar 29, 2016",
  "matchup": "CHA @ PHI",
  "headline": "Batum's triple-double leads Hornets past 76ers, 100-85",
  "body": "PHILADELPHIA --  The Hornets moved a little closer to clinching a playoff spot, though they are not satisfied with just making the postseason.\n\nNicolas Batum had 19 points, 12 rebounds and 12 assists for his second triple-double of the season, leading Charlotte to a 100-85 victory over the Philadelphia 76ers on Tuesday night.\n\nCody Zeller added 18 points and 11 boards for Charlotte, which set a franchise record for wins in a month with its 13th victory in March.\n\nThe Hornets, who entered the game in sixth place in the Eastern Conference, also inched closer to their first playoff spot in two years and just second postseason berth in the last 13 years.\n\n\"Right now we're just preparing ourselves to be ready for (the playoffs),\" Batum said. \"We don't play just to get into the playoffs. We're trying to get ready to be effective in the playoffs and don't just do one-and-done.\"\n\nIf the Hornets are able to win a playoff series for the first time since 2002, Batum will be a big reason.\n\n\"I think he showed why he's one of the elite wings in the NBA,\" Philadelphia coach Brett Brown said.\n\nSaid Charlotte coach Steve Clifford, \"Every time we needed a big play, he made it.\"\n\nShort-handed Philadelphia, which dressed just 10 players, lost its 10th straight game and 23rd in the last 24.\n\nRobert Covington had 18 points for Philadelphia.\n\nThe 76ers were playing without top big man Nerlens Noel, who missed his fourth straight game with a right knee contusion. Also out for Philadelphia were forwards Jerami Grant (right knee/quad) and Richaun Holmes (Achilles'). Rookie Jahlil Okafor is sidelined for the season with a torn right meniscus.\n\n\"With the group we had, I'm not unhappy with their effort,\" Brown said. \"The team we're looking at is not the team we started with.\"\n\nPhiladelphia dropped to 9-66 and still can match the 1972-73 76ers, who finished 9-73, for the worst NBA record over an 82-game season. Of the 76ers' seven remaining games, four are against teams that began play on Tuesday with losing records and out of the playoffs. Perhaps Philadelphia's best chance for a victory will coming next week when hosting the Pelicans (27-46), Knicks (30-45) and Bucks (30-44) in succession.\n\nKemba Walker drained a 3-pointer from the top of the key with 1.3 seconds remaining in the second quarter to give Charlotte a comfortable 16-point lead at the half. Philadelphia never cut the deficit under 10 points in the second half.\n\nWalker finished with 16 points.\n\nNO QUIT\n\nPhiladelphia veteran forward Elton Brand, forced into action, had seven points and nine rebounds in 19 minutes. Brand showed his competitive drive by diving into the scorer's table during one sequence, drawing cheers from 76ers fans.\n\n\"There's no quit,\" Brand said. \"You can't represent Philadelphia and quit. It's tough but we have to keep fighting for wins. We have to fight for the city.\"\n\nCOLLEGE CONNECTION\n\nThree of the four teams that competed in the NCAA East Regional in Philadelphia over the weekend were represented by 76ers and Hornets. Charlotte's Marvin Williams and Tyler Hansbrough and Philadelphia's Kendall Marshall went to North Carolina; the Hornets' Frank Kaminsky attended Wisconsin; and Charlotte's Zeller played at Indiana. Neither team had any players from Notre Dame.\n\nLET'S DO IT AGAIN\n\nThe teams both have off until Friday, when they will play again in Charlotte for the fourth and final meeting of the season.\n\nRAINING 3s\n\nPhiladelphia attempted a franchise-high 44 3-pointers while tying a franchise record by making 16 of them.\n\n\"That's a high volume of 3s,\" Brown said. \"I think if you look at our guys, the best chance to win, we had to catch fire.\"\n\nTIP-INS\n\nHornets: The Hornets lead the season series 3-0, having also defeated the 76ers 119-99 on March 2 in Philadelphia and 113-88 on Nov. 2 in Charlotte. ... The Hornets finished 3-1 on a four-game road trip that included wins over Milwaukee and Brooklyn and a loss to Detroit. ... G Jeremy Lin (sore back) didn't play. . Batum's triple-double was the sixth of his career. ... The Hornets committed just seven fouls.\n\n76ers:  Okafor was in the locker room on crutches before the game. ... Retiring referee Joe Crawford was in attendance.\n\nUP NEXT\n\nHornets: Host Philadelphia Friday night.\n\n76ers: At Charlotte Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994342.490933
}