{
  "game_id": "0022300969",
  "espn_id": "401585597",
  "date": "Mar 16, 2024",
  "matchup": "CHA @ PHI",
  "headline": "Maxey shakes off bloody nose from flagrant foul, leads 76ers over Hornets, 109-98",
  "body": "PHILADELPHIA -- — Tyrese Maxey shook off a bloody nose caused by Brandon Miller's flagrant foul to score 30 points, Kelly Oubre Jr. chipped in 22 and the Phladelphia 76ers withstood a fourth-quarter charge to beat the Charlotte Hornets 109-98 on Saturday night.\n\n\r\n              “I'm all right,” Maxey said of the second-quarter hit. “I tell everyone that I'm a soldier, so it is what it is. But I'm going to take UFC lessons, though.”\n\n\r\n              Buddy Hield had 14 points and Paul Reed added 11 for the 76ers (37-30), who have struggled with an 8-13 record since Joel Embiid's meniscus injury at the end of January to fall into seventh place in the Eastern Conference after Saturday night, putting them in danger of having to take part in the play-in tournament. \n\n\r\n              “I thought Buddy kept us going there for stretches in the second half,\" Philadelphia coach Nick Nurse said. “He got some good spots and got some good looks. We only scored 109 points, but I thought the offense was really good.”\n\n\r\n              Tre Mann had 21 points, Davis Bertans had 16 and Miles Bridges added 14 as six players scored in double figures for Charlotte (17-51), which has lost six straight to Philadelphia and nine of its last 12 overall. \n\n\r\n              “We were right there with three and a half minutes left,” Hornets coach Steve Clifford said. “We had a couple blown sets where we got a little disorganized there, but we got back into the game and I would say that we played well for about 43 minutes. The second quarter, we had a couple minutes there where the ball didn't hit the paint and we took a couple OK shots and put a lot of pressure on the defense.”\n\n\r\n              The Hornets had trailed for most of the night, but took an 89-88 lead after two free throws by Bridges capped an 18-9 run with about five minutes remaining. After that point, Maxey and Oubre took control on the offensive end, driving to the basket and through the Hornets defense. \n\n\r\n              “It usually comes down to shot-making and stop-making,” Nurse said. “We were able to do both consecutively there in the last three minutes of the game. We had a couple of good shots, got an and-one and got to the foul line at the end of the game. And then we were good enough at the defensive end to make some stops there at the end of the game.”\n\n\r\n              Without Embiid, the Sixers have struggled to close out games with most of the burden falling on Maxey, the guard who made his first All-Star team. \n\n\r\n              “I need to be aggressive and find a way to get my teammates involved as well,” Maxey said. “I need to tell them to take the shots they have and to keep bring aggressive in all four quarters. There's been a few times in the fourth quarter (without Embiid) where I wasn't able to close the game out because I exerted a lot of energy in the first three quarters. Now, I have to find a way to be the best player I possibly could be for all 48 minutes.”\n\n\r\n              Philadelphia was also without power forward Tobias Harris, who was sidelined with a left ankle injury sustained on Thursday night in a 114-105 loss at Milwaukee.\n\n\r\n              Charlotte played the second half without Miller, the No. 2 pick in the draft, who was ejected following a Flagrant 2 in the second quarter for an elbow that connected with Maxey's head on the offensive end of the floor. Miller finished with six points and three fouls in 15 minutes.\n\n\r\n              Maxey said later he “knew that Brandon Miller didn't do that on purpose.”\n\n\r\n              UP NEXT Hornets: At Orlando on Tuesday night\n\n\r\n              76ers: Hosts Miami on Monday night\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995943.346626
}