{
  "game_id": "0021900389",
  "espn_id": "401161031",
  "date": "Dec 15, 2019",
  "matchup": "IND vs. CHA",
  "headline": "Pacers beat Hornets 107-85 for 3rd straight victory",
  "body": "INDIANAPOLIS --  Aaron Holiday didn’t offer much of an explanation for his recent scoring surge that has helped the Indiana Pacers win three consecutive games.\n\nBut there’s no denying the second-year reserve guard has had a hot hand lately.\n\nOn a Sunday when the Pacers relied heavily on their bench, Holiday scored 12 of his game-high 23 points in the final quarter of a 107-85 victory over the Charlotte Hornets.\n\nHoliday, who entered with a 9.3-point average, had his third consecutive double-digit game and was a point shy of a career high set last month at Brooklyn. He was coming off games of 18 and 13 points.\n\n“I’m just playing,” he said. “My teammates did a good job of finding me in the right spots and I was able to knock some shots down for them.”\n\n When asked if this three-game stretch is the best of his young career, Holiday just shrugged and reiterated, “I don’t know, I’m just out there playing.”\n\nIf he was certain of anything, it was that his team needed to regroup entering the fourth quarter after almost blowing a 15-point halftime lead. The cold-shooting Hornets managed to trim their deficit to 70-66 with a 22-13 third quarter.\n\n“Once they cut the lead down, we just had to calm down and get back to playing the basketball we were playing before, push the pace and play defense,” Holiday said.\n\nThe Pacers finished the final frame with a 35-19 edge. Thirty-one of their points came from the bench, which provided 55 for the game. Reserve guard T.J. McDonnell also had 12.\n\n“Those guys have been playing good since getting their opportunity,” Pacers coach Nate McMillan said of his bench players. “They’ve been a spark for us this short season, bringing energy to the game, a pace that speeds us up.”\n\nDoug McDermott, a reserve guard who had not scored in three quarters, helped with a pair of 3-pointers early in the fourth. By the time Holiday hit his second 3-pointer of the game, the Pacers had a 93-75 lead with 4:54 remaining.\n\nThe Pacers held the Hornets to a season-low in points and shooting percentage (30.8). The visitors had a three-game winning streak snapped.\n\n“They’re a very good team, they’re deep, their bench is one of the strengths so they played well, give them credit,” Hornets coach James Borrego said. “They made shots and unfortunately we just didn’t get enough stops there down the stretch.”\n\nPacers center Myles Turner scored 14 points with 10 rebounds. Domantas Sabonis added 12 points and 12 rebounds.\n\nHornets forward Cody Zeller, a Hoosier native who typically plays well in front of family and friends, had 19 points and 12 rebounds. He accounted for eight of the team’s 20 points in the opening quarter.\n\n“If you would have told us we’d win three in a row, I think we’d be happy with that,” Zeller said. “It will be good to go back home off a pretty good road trip.”\n\nUP NEXT\n\nHornets: Host Sacramento on Tuesday night.\n\nPacers: Host Los Angeles Lakers on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995863.3581471
}