{
  "game_id": "0022300854",
  "espn_id": "401585482",
  "date": "Feb 29, 2024",
  "matchup": "HOU @ PHX",
  "headline": "Devin Booker scores 35 points, Kevin Durant adds 24 to help the Suns beat the Rockets, 110-105",
  "body": "PHOENIX -- — Phoenix All-Star Devin Booker and Houston rookie Cam Whitmore got into a minor scuffle midway through the fourth quarter Thursday night and both players were called for a technical foul.\n\n\r\n              With a couple big blocks on the ensuing possession, Suns center Jusuf Nurkic was there to back his star teammate.\n\n\r\n              Booker scored 35 points, Kevin Durant added 24 and the Suns held off the Rockets 110-105, with the teams set to meet again in Phoenix on Saturday night.\n\n\r\n              Nurkic had 16 points, 13 rebounds and three blocks before fouling out. His biggest moment came in the fourth, when he stuffed Whitmore twice on the possession following the scuffle, drawing huge roars from the Phoenix crowd.\n\n\r\n              “Very important — that's the team sticking together,” Booker said. “That goes a long way. That's what you need when things get tough, it gets to the thick of things and the energy is high. You want to know you have people on your team that are built like that.”\n\n\r\n              Booker scored 20 points in the first quarter to help give the Suns an 18-point lead they would never relinquish. He has scored at least 20 points in an NBA-high six quarters this season.\n\n\r\n              Three-time All-Star Bradley Beal missed his fifth straight game because of a hamstring injury.\n\n\r\n              The Suns took an 86-75 lead into the final quarter. Houston cut the advantage to six midway through the fourth, but Booker responded immediately with a 3-pointer to push the lead back to nine.\n\n\r\n              That led to the brief skirmish between Booker and Whitmore. Tempers stayed hot over the next few minutes — Houston's Alperen Sengun fouled out and then got two quick technicals, earning an ejection.\n\n\r\n              Booker hit both of the technical free throws, Nurkic followed with his two free throws from Sengun's foul, and that pushed the Suns' lead to 99-84. The Rockets would cut the lead to four with 16.9 seconds left, but Royce O'Neale hit two free throws to end the threat.\n\n\r\n              Jalen Green led Houston with 34 points. Fred VanVleet added 21. The Rockets connected on just 11 of 45 3-pointers and shot 33.3% from the field overall, which was their worst percentage of the season.\n\n\r\n              “It wasn't one of our better nights as far as guys getting open looks and making the extra pass,” Rockets coach Ime Udoka said. “We had a few guys who had it going, but a few guys who were struggling.”\n\n\r\n              Phoenix has won seven of its past 10 — and nine in a row at home — as it tries to stay in the top six of the Western Conference playoff race and avoid the play-in tournament. The sliding Rockets have lost eight of 10.\n\n\r\n              “We're getting confident in this building,” Suns coach Frank Vogel said.\n\n\r\n              Booker's big first quarter pushed the Suns to a 33-17 lead. The four-time All-Star made 8 of 10 shots from the field, including a 33-foot 3-pointer in the final seconds.\n\n\r\n              Phoenix settled for a 64-53 halftime lead. Booker had 26 points before the break while Green led Houston with 21.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995586.459181
}