{
  "game_id": "0022300732",
  "espn_id": "401585360",
  "date": "Feb 07, 2024",
  "matchup": "SAC vs. DET",
  "headline": "Jaden Ivey scores a career-high 37 points to lead Pistons past Kings, 133-120",
  "body": "SACRAMENTO, Calif. -- — Jaden Ivey scored 19 of his career-high 37 points in the fourth quarter and the Detroit Pistons, playing without their two top scorers, stunned the Sacramento Kings 133-120 on Wednesday night.\n\n\r\n              Ivey added seven assists and six rebounds as Detroit improved to 3-20 on the road this season, 7-43 overall.\n\n\r\n              “I talked to myself before the game, just focus in on the fourth quarter where I can attack and be aggressive,” Ivey said. “If I have my shot, just take it and be confident in it.”\n\n\r\n              Alec Burks had 25 points and seven rebounds off the bench, and Jalen Duren had 20 points, 15 rebounds and six assists. Marcus Sasser added 18 points.\n\n\r\n              “For (Ivey) and Sass and all of our young guys to make plays in moments like that on the road, that expands your capacity,” Detroit coach Monty Williams said. “You can only grow from these types of experiences.”\n\n\r\n              The Pistons were without Cade Cunningham (left knee injury management) and Bojan Bogdanovic (left calf soreness), who both average more than 20 points per game.\n\n\r\n              “Just a great game overall,” Ivey said. \"I feel like everybody used their gifts to the best of their abilities and gave it all that they had with some guys out. I’m so proud of them.”\n\n\r\n              Domantas Sabonis led Sacramento with 30 points and 12 rebounds for his 33rd consecutive double-double.\n\n\r\n              Malik Monk added 23 points and 10 assists off the bench as the Kings heard boos from their fans throughout the game.\n\n\r\n              “There’s nothing to change up (structurally on defense) right now because we’re not doing our job,” Sacramento coach Mike Brown said. “We didn’t do our job tonight, for sure.”\n\n\r\n              The Pistons closed the first half on a 17-5 run, capped by Killian Hayes’ 3-pointer at the buzzer, to build a 70-63 lead. The 70 first-half points matched their season high.\n\n\r\n              Detroit extended the lead to 87-72 midway through the third quarter, but the Kings responded with a 27-10 run to take a 99-97 lead into the fourth.\n\n\r\n              The Pistons outscored Sacramento 36-21 in the final quarter and won despite losing the turnover battle.\n\n\r\n              “That team can score in bunches on everybody in the league,” Williams said. “So for us to hold them to 21 points in the fourth quarter, that’s the difference.”\n\n\r\n              Detroit shot a season-best 56% from the field and made 17 of 31 3-pointers. The Pistons were 22 of 22 at the free-throw line and outrebounded the Kings 48-33.\n\n\r\n              Sacramento's Kevin Huerter received consecutive technical fouls with 1:40 remaining and was ejected.\n\n\r\n              TRADE ALERT\n\n\r\n              Detroit made a pair of trades ahead of Thursday’s NBA trade deadline, according to an AP source. The Pistons acquired Simone Fontecchio from the Utah Jazz for a second-round draft pick and dealt Monte Morris to the Minnesota Timberwolves for Shake Milton, Troy Brown and a second-round selection.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: At Portland on Thursday night.\n\n\r\n              Kings: Host Denver on Friday night.\n\n\r\n              —-\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996789.97168
}