{
  "game_id": "0021301039",
  "espn_id": "400489912",
  "date": "Mar 22, 2014",
  "matchup": "DET @ LAC",
  "headline": "Chris Paul has double-double as Clippers hand Pistons 5th straight loss",
  "body": "LOS ANGELES -- The Clippers' success isn't just because of Blake Griffin's scoring and Chris Paul's playmaking. The dramatic improvement in rebounding has been an integral part as well.\nPaul had 28 points and 15 assists, Griffin added 25 points, and the Clippers held their own on the glass against one of the NBA's top teams in that department en route to a 112-103 victory over the Detroit Pistons on Saturday night.\nDeAndre Jordan had 12 rebounds for the Pacific Division leaders, who have had at least one player with double-digit rebounds in a franchise-record 46 consecutive games. The previous mark was 44, by the 1977 Buffalo Braves.\n\n\"We'll take it,\" Jordan said. \"But we've got to keep building on it, because that was the knock on us last year. We gave up too many rebounds and too many offensive boards. But now, I feel like we're getting better as a team. We can't get out and score the way we can without controlling the glass. They're a big team, so we knew we had to be physical early.\"\nAndre Drummond had 16 points and 12 boards during an intense matchup of the league's top two players in rebounding and field goal percentage. Jordan came in leading Drummond in both categories, and is trying to join Wilt Chamberlain and Dwight Howard as the only players in NBA history to finish a season that way. Chamberlain did it eight times, and Howard did it in 2009-10 with Orlando.\n\"I'd be in great company, and it would be a great accomplishment for me,\" Jordan said. \"But at the same time, we have a bigger goal. So I just want to continue to play the way that I'm playing and build on that.\"\nJordan acknowledged how much he was looking forward to this latest Andre vs. DeAndre showdown -- and the next one.\n\"It's not just the fact that we're one and two, but anytime there's a young big out there who's playing well and there's going to be competition, I love that,\" Jordan said.\nThe Clippers, coming off a 110-100 loss at Denver that ended their 11-game overall winning streak, extended their home winning streak to seven. They shot 54 percent from the field and improved to 24-1 when finishing at 50 percent or better.\n\"We just knew that we needed to come back in here and try to get another streak started,\" Paul said. \"We didn't want to come out flat, and I think we did all right.\"\nJonas Jerebko tied a career high with 22 points off the bench and had nine rebounds for the Pistons, who have lost five in a row and 13 straight on the road.\n\"It's tough to lose the game and I can't be too happy about it,\" Jerebko said. \"But at least I saw the ball go through the rim a couple of times. It made the game come a lot easier to me.\"\nThe Pistons have lost the last six meetings with the Clippers, including a 112-103 decision on Jan. 20 at Detroit despite Rodney Stuckey's season-high 29 points. Stuckey had six points in the rematch, making three of eight shots.\nDanny Granger's four-point play gave the Clippers a 92-81 remaining after Jerebko fouled him with 7:53 remaining. The Pistons got it down to 100-94 with 3:53 left after back-to-back layups by Greg Monroe. But Paul responded with seven points in the final 2:44 to close it out.\nLos Angeles got 15 points from Paul and 13 by Griffin before intermission. Detroit fell behind by 13 late in the first quarter before taking its first lead, 42-41, on an alley-oop dunk by Drummond that was set up by Will Bynum with 7 minutes left in the second quarter. Jerebko capped the 24-7 run about 2 minutes later with a 16-footer for a 47-43 advantage.\nGame notes\nThe Pistons, who entered the game with a league-worst 66.6 free throw shooting percentage, attempted only two in the first three quarters compared to 20 by the Clippers. ... Paul got his 6,000th career assist in the regular season when he set up Griffin's 21-footer in the final minute of the first quarter. Detroit's Brandon Jennings scored his 6,000th career point on a 3-pointer in the third. ... The Pistons had 50 points in the paint, after coming in with a league-best average of 52.6. ... Griffin has scored at least 20 points in a career-high 28 straight games, starting with the 25 he had at Detroit. ... The Clippers are 28-0 at home when leading after three quarters. ... Clippers reserve G Willie Green is a product of Detroit's Mercy High School and played his college ball at Detroit Mercy. ... The Pistons, who began the day averaging a league-best 14.3 offensive rebounds, had 16 against the Clippers and 16 second-chance points. ... The Pistons' next and final stop on their four-game trip is Utah, where they have lost 10 in a row.",
  "source": "espn_api",
  "crawled_at": 1764993283.960248
}