{
  "game_id": "0022400141",
  "espn_id": "401704707",
  "date": "Nov 02, 2024",
  "matchup": "CHA vs. BOS",
  "headline": "Tatum scores 29 points, Celtics beat Hornets 113-103 to sweep back-to-back in Charlotte",
  "body": "CHARLOTTE, N.C. -- — Jayson Tatum scored 29 points, Payton Pritchard had 22 points on six 3-pointers and the Boston Celtics beat the Charlotte Hornets 113-103 for the second straight night at the Spectrum Center on Saturday.\n\n\r\n              Derrick White added 18 points and eight rebounds for the Celtics, who beat the Hornets 124-109 on Friday night. Boston improved to 6-1.\n\n\r\n              Charlotte’s LaMelo Ball eclipsed the 30-point barrier for the fourth time this season, finishing with 36 points on 15-of-26 shooting before fouling out for the second straight game. Brandon Miller had 16 points in his return from a strained glute,\n\n\r\n              Tatum was just 1 of 9 from beyond the arc, but converted 14 of 17 free throws.\n\n\r\n              There were no incidents on the court Saturday night after Boston player Grant Williams was assessed a flagrant-two foul and ejected after plowing over Tatum at midcourt.\n\n\r\n              Takeaways\r\n              Celtics: No Jaylen Brown, no problem for the deep Celtics. Brown sat out with a hip flexor strain, but Boston didn't miss a beat, bolting to a 19-point lead in the second quarter. White stepped up his scoring and Jrue Holiday made big play after big play. \n\n\r\n              Hornets: LaMelo Ball has to find a way to stay out of foul trouble. Ball picked up two quick fouls and had to be replaced and watch as the Celtics built a 21-9 first quarter lead. He's far too valuable to the Hornets to be sitting on the bench.\n\n\r\n              Key moment \r\n              After the Hornets came out on fire in the third quarter, Jrue Holiday hit a 3 to end the rally and Boston quickly pushed the lead back to double digits.\n\n\r\n              Key stat\r\n              The Celtics outrebound the Hornets 44-34 with Charlotte playing without its top two centers Mark Williams and Nick Richards. \n\n\r\n              Up next \r\n              The Celtics head down Interstate-85 to face Atlanta at Monday night. The Hornets are at Minnesota on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997472.633176
}