{
  "game_id": "0022300366",
  "espn_id": "401584994",
  "date": "Dec 20, 2023",
  "matchup": "ORL vs. MIA",
  "headline": "Tyler Herro scores 28 points as the Miami Heat beat the Orlando Magic 115-106",
  "body": "ORLANDO, Fla. -- — Tyler Herro had 28 points, eight rebounds and seven assists, helping the Miami Heat beat the Orlando Magic 115-106 on Wednesday night.\n\n\r\n              Bam Adebayo had 18 points and seven rebounds for Miami, which scored 32 points in a 6 1/2-minute stretch of the second quarter and won for the fourth time in six games.\n\n\r\n              Playing in his 10th game of the season, Herro was 10 for 17 from the field. He went 4 for 5 from 3-point range.\n\n\r\n              “I feel like the more games I play, the more comfortable I’m going to be,” Herro said. “I’m not in midseason form yet. I would like to say there’s another level I can take it to.”\n\n\r\n              Haywood Highsmith, one of four Miami reserves who scored in double figures, made four of the Heat's 15 3-pointers and finished with a season-high 15 points.\n\n\r\n              “Our bench really drove us to this win,” coach Erik Spoelstra said. “They finished the second quarter and they finished the game, for the most part.”\n\n\r\n              Miami played without Jimmy Butler, who has a strained left calf, and Kevin Love, who is out with an illness.\n\n\r\n              Cole Anthony led the Magic with 20 points. Franz Wagner added 15 points, and Paolo Banchero had 10 points on 2-of-12 shooting to go along with eight rebounds and eight assists.\n\n\r\n              Orlando center Wendell Carter Jr. returned to the lineup after missing 20 games with a fractured left hand. He got hurt in the final seconds of the Magic’s fifth game of the season on Nov. 2.\n\n\r\n              Carter played 23 minutes, finishing with eight points and six rebounds.\n\n\r\n              The Heat made their final 12 shots of the first half, including a couple of 3-pointers by Highsmith and one each by Herro, Duncan Robinson and Josh Richardson. Highsmith’s back-to-back 3s came during a 17-0 run that lifted Miami to a 58-40 lead.\n\n\r\n              That stretch doomed the Magic, according to Anthony.\n\n\r\n              “We didn’t get back on defense. We were in a constant scrambling mode and they made us pay,” he said. “We’ve got to grow up as a unit. We had a good run for a while and we’ve hit a rough patch. We can’t handicap ourselves like that and then expect to dig ourselves out. That’s called beating ourselves.”\n\n\r\n              Miami hit 8 of 12 3-point shots in the big second period and had only three turnovers in the first half. \n\n\r\n              “We're disappointed. We should be disappointed,” Magic coach Jamahl Mosley said after his team lost a third straight game for the first time this season. “Give Miami credit for what they did, but our guys know what we can do and we have to hold ourselves accountable for that.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Atlanta on Friday.\n\n\r\n              Magic: Visit Milwaukee on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995723.955033
}