{
  "game_id": "0022400626",
  "espn_id": "401705192",
  "date": "Jan 23, 2025",
  "matchup": "SAC @ DEN",
  "headline": "Nikola Jokic has 5th straight triple-double to help the Nuggets beat the Kings, 132-123",
  "body": "DENVER -- — Nikola Jokic had his fifth straight triple-double before the fourth quarter, finishing with 35 points, 22 rebounds and a season-high 17 assists to help the Denver Nuggets beat the Sacramento Kings 132-123 on Thursday night.\n\n\r\n              Jokic has an NBA-leading 20 triple-doubles this season, 14 before the fourth quarter. He had 20 points and 20 rebounds before the end of the third quarter.\n\n\r\n              The Nuggets led by 22 at halftime and used a 14-5 run at the end of the third, capped by Jokic’s 66-foot heave at the buzzer, to take a 25-point lead.\n\n\r\n              Domantas Sabonis had 23 points and 17 rebounds for Sacramento. The Kings lost for the third time in 13 games since Doug Christie took over as the interim coach.\n\n\r\n              The Kings scored the first 14 points of the fourth and got as close as 126-121.\n\n\r\n              Takeaways\r\n              Kings: Faced a tough back-to-back after beating Golden State at home Wednesday night. They had a furious rally to make it close but could not make up a 25-point deficit.\n\n\r\n              Nuggets: Jokic, voted an All-Star starter, had 12 points in the fourth quarter. Christian Braun had 21 points and Michael Porter Jr. 20 points for Denver, which has won four straight.\n\n\r\n              Key moment\r\n              The Kings could have packed it in after Jokic’s basket from three-quarter court but they got after Denver at the start of the fourth. It brought Jokic back in instead of taking off another fourth quarter.\n\n\r\n              Key stat\r\n              Doug McDermott, who was taken by the Nuggets in 2014 and traded to Chicago on draft night, was 5 of 7 from 3-point range in the fourth quarter to get the Kings within two possessions.\n\n\r\n              Up next\r\n              The Kings continue their six-game trip at New York on Saturday night. The Nuggets begin a five-game trip at Minnesota on Saturday.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_api",
  "crawled_at": 1764997333.724381
}