{
  "game_id": "0021800394",
  "espn_id": "401071075",
  "date": "Dec 10, 2018",
  "matchup": "SAC @ CHI",
  "headline": "Fox sparks 2nd-half rally, Kings beat Bulls 108-89",
  "body": "CHICAGO --  De'Aaron Fox put together another impressive offensive display on Monday night. And all he wanted to talk about was defense.\n\nFox scored 23 of his 25 points in the second half, helping the Sacramento Kings rally for a 108-89 victory over the lowly Chicago Bulls.\n\nThe speedy Fox went 8 for 11 from the field after missing each of his first five shots in the first half. Bogdan Bogdanovic and Marvin Bagley III added 16 points apiece as Sacramento closed out a 3-1 road trip.\n\nFox said two steals he made in the third quarter were a big part of Sacramento's turnaround.\n\n\"That's what started me,\" the second-year guard said. \"After those two steals, the whole momentum of the game just changed. After that, we never looked back.\"\n\nKings coach Dave Joerger agreed.\n\n\"What he did from the first half to the second half was awesome,\" Joerger said. \"He really was a leader out there not just scoring the basketball, but he picked up his defensive pressure.\"\n\nChicago led by as many as 14 in its ninth loss in 10 games. The Bulls were coming off a franchise-record 133-77 loss to the Boston Celtics on Saturday.\n\nZach LaVine led Chicago with 19 points, and Lauri Markkanen had 13.\n\n\"We got stung in the third quarter,\" coach Jim Boylen said. \"I thought their energy went up and our energy went down as the game went on. That's something we talked in there as a team, and that's something we need to fix.\"\n\nAfter falling behind 17-0 on Saturday, the Bulls got off to a better start in this one. They led 33-26 at the end of the first quarter and 56-45 at halftime.\n\nChicago had a 66-57 lead in the third before Sacramento closed the quarter with a 24-8 run.\n\nFox started the key stretch with a pair of free throws and then registered steals on back-to-back possessions. He converted a dunk off the first steal and Iman Shumpert hit a 3-pointer following the second.\n\nThe Bulls shot 22 for 41 (53.7 percent) from the field in the first half, but were just 6 for 16 (37.5 percent) in the third.\n\nSacramento kept up the intensity in the fourth and Chicago never made a serious push.\n\nTIP-INS\n\nKings: Buddy Hield and Shumpert each scored 14 points. Willie Cauley-Stein had 11 points and 16 rebounds. ... Sacramento improved to 14-12. It's the latest point in a season it has been above .500 since the 2005-06 season. The Kings finished 44-38 that year in their most recent playoff appearance.\n\nBulls: G Kris Dunn (sprained left knee) and F Bobby Portis (sprained right knee) returned to the lineup after sitting out nearly seven weeks. Dunn finished with nine points in 20 minutes, and Portis had nine points in 19 minutes. ... G Justin Holiday went 1 for 6 on 3-pointers. He has made at least one 3 in 39 consecutive games dating to last season. He's the only NBA player with at least one 3 in every game this season.\n\nTIPPING POINT\n\nLess than a week into his tenure, Boylen faced a crisis over the weekend. Following the loss to the Celtics, Boylen planned to practice on Sunday even though the Bulls had played back-to-back games.\n\nSome players reportedly discussed not showing up. Instead of a practice session, a lengthy team meeting was held.\n\nBefore Monday's game, Boylen said everything was fine and he would continue to push hard.\n\n\"I expected something like yesterday to happen,\" he said. \"I've been waiting on it, I was prepared for it, I took it head on.\"\n\nSaid LaVine: \"I think everything made us closer. Good, bad or ugly, I think that ordeal was good for the team.\"\n\nSLOPPY\n\nThe Bulls finished with a season-high 27 turnovers, which led to 31 Sacramento points.\n\nUP NEXT\n\nKings: Host the Minnesota Timberwolves on Wednesday night.\n\nBulls: Play the Orlando Magic in Mexico City on Thursday night to begin a three-game trip.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994208.089273
}