{
  "game_id": "0021500737",
  "espn_id": "400828624",
  "date": "Feb 03, 2016",
  "matchup": "DET @ BOS",
  "headline": "Thomas scores 17 as Celtics stave off Pistons' rally, 102-95",
  "body": "BOSTON -- As one of the NBA's top defensive teams this season, the Celtics have inevitably found themselves with some big leads.\nThey're still mastering how to play with those cushions.\nIsaiah Thomas had 17 points and seven assists to help Boston hold off the Detroit Pistons 102-95 on Wednesday night.\n\nDetroit fell behind by as many as 24 in the third quarter before cutting the deficit to seven, but the Celtics strung together enough late baskets to preserve the win.\nAvery Bradley added 15 points for Boston, which has won six straight home games and seven of eight overall.\n\"It's hard to play up,\" Celtics coach Brad Stevens said. \"You play a little bit more free when you're down. But we need to play well all the time.\"\nReggie Jackson led the Pistons with 17 points. Andre Drummond added 16 points and 13 rebounds.\nThe Pistons came back despite playing the second half without guard Kentavious Caldwell-Pope, who left with a right groin strain after he appeared to slip on a wet spot on the court late in the second quarter.\nDetroit coach Stan Van Gundy said Caldwell-Pope will have an MRI on Thursday but will \"almost certainly be out\" against New York.\nAs for the game, Van Gundy said his team never recovered from its slow start.\n\"We weren't ready to play at the beginning. They were right into us,\" he said. \"We didn't handle their pressure well at all. Their defense took us out of everything. They did a great job, and we didn't respond to it.\"\nThe Celtics took advantage of the Pistons' poor shooting and took a 20-point lead into halftime. Boston shared the ball in the first two quarters, amassing 18 assists on 23 field goals.\nAll 10 Celtics who played in the first half scored, including 21 points from the bench.\nBoston's Evan Turner, who finished with 14 points off the bench, said part of the reason for his team's lull in the second half can be attributed to the length of the game. It was extended thanks to 42 fouls.\n\"We just tried to execute down the stretch. Keep our poise. We thought after a while the whistles stopped blowing a little bit,\" he said. \"But we just tried to battle back and weather the storm. Fortunately enough, we did.\"\nTIP-INS\nPistons: Caldwell-Pope has played in 208 consecutive games, the second-longest active streak in the NBA. ... Detroit is 11-16 on the road this season. ... The Pistons finished 1-2 on their road trip.\nCeltics: Boston is 24-12 when scoring 100 or more points.\nTUNNEL VISION\nThe Celtics have been bandied about this week in bevy of rumors surrounding the upcoming trade deadline. But from Stevens' vantage point, it's noise he's blocking out.\nWhen he was a first-year coach, Stevens said he was guilty of following up on \"every third rumor.\" This season he's yet to do so. Stevens said he and president of basketball operations Danny Ainge have had general discussions, but nothing specific regarding the deadline.\n\"I'm not losing sleep over what might happen, what's not going to happen, what's not real, what's real -- any of that stuff,\" Stevens said. \"If something happens, it happens.\"\nWHAT A BARGAIN\nJackson was one of the Pistons' trade-deadline acquisitions last year, and Van Gundy said they are pleased with how the guard has fit in. Jackson has started every game during his first full season in Detroit. \"I tell people if you look at all those point guards moved last year at the deadline -- Brandon Knight, Isaiah Thomas -- you had to give up first-round picks to get all of those guys, and we didn't,\" Van Gundy said.\nUP NEXT\nThe Pistons host the Knicks on Thursday.\nThe Celtics play at Cleveland on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994913.3927329
}