{
  "game_id": "0022301159",
  "espn_id": "401585787",
  "date": "Apr 10, 2024",
  "matchup": "CHA @ ATL",
  "headline": "Hornets spoil Young's return, beating Hawks 115-114 on Bridges' late layup",
  "body": "ATLANTA -- — Miles Bridges made a layup with 3.8 seconds left and the Charlotte Hornets beat Atlanta 115-114 on Wednesday night to spoil Hawks star Trae Young's return from a finger injury.\n\n\r\n              After missing 23 games because of a torn ligament in his left pinkie, Young had 14 points and 11 assists in 21 minutes while making each of his five shots from the field. He didn't play in the fourth quarter.\n\n\r\n              “It feels good, my hand feels good,” Young said.\n\n\r\n              Brandon Miller led the Hornets with 27 points. Bridges had 18 as the Hornets rallied after trailing by 18 points, including a 92-77 deficit entering the final period.\n\n\r\n              Hornets coach Steve Clifford, who announced April 3 he is stepping down following the season, said his message entering the final period was “Just keep going, possession by possession. They did a good job. They kept their poise and made a bunch of plays late.”\n\n\r\n              Bogdan Bogdanovic and Vit Krejci each had 19 points for Atlanta, which suffered its fourth straight loss. Trent Forrest missed a last-second jumper as the Hawks, 10th in the Eastern Conference, missed an opportunity to move within a half-game of No. 9 Chicago in the race for a home game to open the play-in tournament.\n\n\r\n              The Hornets led 111-108 before Forrest scored the next six points for Atlanta, his only points of the game, to give the Hawks a 114-111 lead with 34 seconds remaining. Two free throws by Miller cut the lead to one point.\n\n\r\n              Young was injured on Feb. 23, had surgery on Feb. 27 and was cleared for practice Monday. Coach Quin Snyder monitored Young's minutes closely.\n\n\r\n              “He seemed comfortable to me,” Snyder said, adding Young's 21 minutes through three periods was a cap as set by the team's training staff.\n\n\r\n              Young wore a black brace on his left hand that covered the surgically repaired finger. He gave the first indication the wrap would not affect his shooting when he sank a long shot while seated on the Hawks’ bench during pregame drills.\n\n\r\n              Young's first basket, less than two minutes into the game, was a drive and left-handed layup.\n\n\r\n              “I didn't do that on purpose,” Young said. “Well, I guess I did. It was natural to me.”\n\n\r\n              Young said his goal is to work up to a normal load of minutes by the team's final regular-season game.\n\n\r\n              Bogdanovic made five 3-pointers, giving him a team-record 235 for the season. Young held the previous record with 233 3s in the 2021-22 season.\n\n\r\n              “Could you not tell I was trying to get him to pass me?” Young asked, referring to his assists.\n\n\r\n              Dylan Windler set season highs with 12 points and four 3-pointers for the Hawks.\n\n\r\n              Tre Mann scored 16 points with seven assists and a career-high seven steals for the Hornets.\n\n\r\n              Charlotte snapped a two-game losing streak. \n\n\r\n              Even with Young back in the starting lineup, the Hawks were shorthanded. Guard Dejounte Murray (right quad contusion) and forwards De’Andre Hunter (rest) and Jalen Johnson (right ankle sprain) did not play.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At at Boston on Friday night before closing their season at Cleveland on Sunday.\n\n\r\n              Hawks: At Minnesota on Friday before visiting Indiana on Sunday to close the regular season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995928.7832131
}