{
  "game_id": "0022300565",
  "espn_id": "401585193",
  "date": "Jan 15, 2024",
  "matchup": "LAL vs. OKC",
  "headline": "LeBron James, Anthony Davis lead the Lakers to a 112-105 win over the Oklahoma City Thunder",
  "body": "LOS ANGELES -- — Anthony Davis had 27 points and 15 rebounds, LeBron James scored 25 and the Los Angeles Lakers snapped the Oklahoma City Thunder's four-game winning streak with a 112-105 victory Monday night.\n\n\r\n              D'Angelo Russell had 14 points and seven assists as the Lakers held off the powerhouse Thunder in the fourth quarter for only LA's sixth victory in 18 games, with two of those wins coming against Oklahoma City.\n\n\r\n              “When we have high-assist games where guys are feeling in a rhythm, it's a pretty good game for us,” James said. “We've got to try to look at this and be more consistent with that.”\n\n\r\n              Shai Gilgeous-Alexander scored 16 of his 24 points in the first half while playing through a right knee sprain for Oklahoma City, which had its lowest offensive output in 19 games since Dec. 6. The Lakers are responsible for two of the Thunder's four losses in their last 16 games.\n\n\r\n              Jalen Williams scored 25 points, but Chet Holmgren and Josh Giddey both struggled offensively to a combined 17 points for the Thunder, who opened a key four-game swing against some of the West’s other top teams. Oklahoma City also faces the Clippers and the conference-leading Timberwolves on its road trip.\n\n\r\n              “I thought (the Lakers) had a good plan,” Thunder coach Mark Daigneault said. “They did a really good job of game-planning and execution. They deserved to win. We didn’t shoot the ball great. We didn’t generate a great rhythm offensively. Some of that was them, some of that was us, so it was certainly not our best game, but certainly something to learn from.”\n\n\r\n              James returned from his fourth missed game of the season due to injury and scored 17 points in the second half. His driving layup with 8:53 to play staked Los Angeles to the game’s first double-digit lead at 93-82.\n\n\r\n              The Thunder got within six on Gilgeous-Alexander's dunk with 2:05 left, but James drove the lane and dished to Davis for a two-handed slam that essentially sealed the victory with 50 seconds to play.\n\n\r\n              “That's five years of playing together,” Davis said. “LeBron is a great passer. Me and him just have that connection. ... Just a lot of time and effort, blood and sweat we put into the game to have that connection.”\n\n\r\n              The Lakers are beginning a two-week stretch in which they won't have to leave Los Angeles, and Davis said last weekend that this six-game sequence will be vital to their hopes of being a playoff contender. They've been stumbling since they won the inaugural In-Season Tournament in early December, unable to overcome a series of injuries or to generate consistent tertiary scoring around James and Davis.\n\n\r\n              “I think it starts with us defensively to make that push,” Davis said. “We're a good team when we're defensive-minded, and when we show what we can do defensively on the floor, we tend to win those games.”\n\n\r\n              Cam Reddish sat out with knee swelling, and the Lakers went back to a starting backcourt of Russell and Austin Reaves, who scored 15 points.\n\n\r\n              Davis’ aggressiveness and Holmgren’s early foul trouble contributed to a 64-44 advantage for the Lakers on points in the paint.\n\n\r\n              “The Lakers have size all across the board as well as athleticism,” Holmgren said. “They’re going to bring the intensity, so when they hit you, you’ve got to hit them back. Otherwise, they’re just going to try and punk you, if you let them.”\n\n\r\n              NBA Commissioner Adam Silver attended the game one day before a scheduled news conference at the Los Angeles Clippers’ under-construction Intuit Dome in Inglewood, which could be announced as the host of the 2026 NBA All-Star weekend.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Clippers on Tuesday.\n\n\r\n              Lakers: Host Dallas on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995519.2977011
}