{
  "game_id": "0022401149",
  "espn_id": "401705715",
  "date": "Apr 08, 2025",
  "matchup": "ORL vs. ATL",
  "headline": "Banchero has 33 points and 10 rebounds as Magic turn back Hawks 119-112",
  "body": "ORLANDO, Fla. -- — Paolo Banchero had 33 points and 10 rebounds and the Orlando Magic beat the Atlanta Hawks 119-112 on Tuesday night, taking command of the four-team play-in tournament race in the Eastern Conference.\n\n\r\n              Franz Wagner scored 22 points for the Magic, while Wendell Carter Jr. added 17 points, nine rebounds and six steals and Kentavious Caldwell-Pope had 15 points.\n\n\r\n              Onyeka Okongwu matched his career high with 30 points for the Hawks and added 14 rebounds and three steals. Trae Young scored 28 points and had 10 assists for Atlanta, which has lost four of its last five games.\n\n\r\n              Takeaways\r\n              Hawks: Locked into a play-in position with three games left in the regular season, the Hawks will probably have to win all three, including Sundays season finale against Orlando, to claim the No. 7 spot. They have lost two of three games to the Magic and six of their last eight overall.\n\n\r\n              Magic: Having won seven of their last nine, the Magic took a two-game lead over Atlanta and a 2 1/2-game lead over Chicago in the race for the seventh spot and homecourt advantage in the play-in tournament. \n\n\r\n              Key moment\r\n              Easy layups by Wagner, Banchero and Cory Joseph, surrounding a technical foul on Okongwu, turned a six-point Magic lead into double figures late in the fourth quarter.\n\n\r\n              Key stats\r\n              The Hawks had 18 turnovers and made just 14 of 41 3-point shots while the Magic were 14 of 34 from deep.\n\n\r\n              Up next\r\n              Hawks: Play at Brooklyn on Thursday night.\n\n\r\n              Magic: Play Boston at home on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997868.955049
}