{
  "game_id": "401810020",
  "espn_id": "401810020",
  "date": "Nov 04, 2025",
  "matchup": "TOR vs MIL",
  "headline": "Barnes and Barrett each score 23 points as Raptors win third straight, rout Bucks 128-100",
  "body": "TORONTO -- — Scottie Barnes and RJ Barrett each scored 23 points, Immanuel Quickley and Sandro Mamukelashvili both had 15 and the Toronto Raptors won their third straight game by thumping the Milwaukee Bucks 128-100 on Tuesday night.\n\n\r\n              Gradey Dick scored 14 points and Brandon Ingram had 13. Toronto posted its biggest margin of victory of the season, eclipsing a 20-point win at Atlanta on Oct. 22.\n\n\r\n              Giannis Antetokounmpo scored 22 points, Kyle Kuzma had 18 and Cole Anthony 12 as the Bucks lost for the second time in three games. \n\n\r\n              It was Milwaukee’s most lopsided loss of the season, easily exceeding the five-point margin in a 118-113 defeat at Cleveland on Oct. 26.\n\n\r\n              Ryan Rollins scored 11 points for the Bucks and Myles Turner had 10. \n\n\r\n              Milwaukee shot 11 for 38 from long range, its fewest made 3-pointers of the season. The previous low of 13 came in that Oct. 26 loss to the Cavaliers.\n\n\r\n              Barnes left midway through the second quarter because of a strained left thumb. After X-rays at halftime showed no sign of a fracture, Barnes had his thumb taped up and returned to start the second half. He shot 9 for 16 and 3 for 5 on 3-pointers.\n\n\r\n              Toronto’s Jakob Poeltl returned after missing the previous three games because of a sore lower back. He finished with eight points and nine rebounds in 20 minutes.\n\n\r\n              The Bucks couldn’t complete a sweep in the second game of a road back-to-back. Milwaukee won Monday when Antetokounmpo’s 17-foot buzzer-beating jumper secured a 117-115 victory at Indiana.\n\n\r\n              The Bucks were trying to win north of the border for the second time this season after spoiling Toronto’s Oct. 24 home opener with a 122-116 win. \n\n\r\n              Up next\r\n              Bucks: Host Chicago on Friday.\n\n\r\n              Raptors: Begin a five-game road trip at Atlanta on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042559.151066
}