{
  "game_id": "0022001053",
  "espn_id": "401307865",
  "date": "May 13, 2021",
  "matchup": "PHX vs. POR",
  "headline": "Booker hits late free throws, Suns top Trail Blazers 118-117",
  "body": "PHOENIX -- — Devin Booker wasn’t at his best Thursday night. Regardless, there was no question he was getting the ball with the game on the line.\n\n\r\n                    Booker received the inbounds pass, was fouled and made two free throws with 2.4 seconds left to give the Phoenix Suns a 118-117 victory over the Portland Trail Blazers.\n\n\r\n                    Booker scored 18 points on just 5-of-17 shooting, but coach Monty Williams put the game in his hands after Portland's Robert Covington missed two free throws with 4.4 seconds left and the Trail Blazers up by one.\n\n\r\n                    Booker got the ball off a screen and was fouled by Norman Powell. Two free throws later, the Suns had secured the win, which moved them within one game of the Utah Jazz for the No. 1 seed in the NBA and the Western Conference with two games remaining.\n\n\r\n                    “It takes mental toughness, stamina, all the things we talk about to make a play in those moments after you haven’t shot it well,” Williams said. “It happens, but the great ones have a short memory. I think he knew I was going to come to him in that moment, either him or Chris Paul) and he produced.”\n\n\r\n                    C.J. McCollum missed a 3-point shot at the buzzer for Portland.\n\n\r\n                    Paul led Phoenix with 26 points on 11-of-14 shooting and Mikal Bridges had a double-double with 21 points and 11 rebounds.\n\n\r\n                    Damian Lillard scored a game-high 41 points on 16-of-23 shooting for Portland, which had its five-game winning streak stopped. McCollum had 27 points. But Portland’s bench scored just 14 points on 5-of-13 shooting. Carmelo Anthony scored five points while shooting 1 of 7.\n\n\r\n                    The Trail Blazers, who were playing the second of a back-to-back after beating Utah on Wednesday night, dropped into the No. 6 seed in the Western Conference, a half-game back of Dallas with two games to play.\n\n\r\n                    The Suns, who had lost three of four coming in, avoided their first three-game skid of the season.\n\n\r\n                    Phoenix played without center Deandre Ayton, who missed his first game of the season with a sore left knee. Williams declined to provide any details about Ayton’s injury before the game, saying only that he “came in sore today.\" The Suns started Dario Saric in Ayton’s place, yet Phoenix outrebounded Portland 42-33 and allowed the Trail Blazers to grab just one offensive rebound.\n\n\r\n                    “It speaks to the toughness of our guys and ability to lock into a game plan,” Williams said. “It also speaks to how rebounding translates into winning when you don’t give a team extra possessions, especially how lethal this team is.”\n\n\r\n                    The Suns turned what had been a tight game into an 85-77 lead heading into the fourth quarter, thanks to reserve forward Torrey Craig, who scored 10 points in the final 2:07 of the third quarter. Craig hit back-to-back 3-pointers to spark the run.\n\n\r\n                    Backup point guard Cam Payne scored 21 points for the Suns, including\n\n\r\n                    11 in the third quarter, and also collected six rebounds and five assists.\n\n\r\n                    “I was just being aggressive,” Payne said. “I knocked down some big-time shots. That just comes from being aggressive and having confidence every night.”\n\n\r\n                    TIP-INS\n\n\r\n                    Blazers: Forward Nassir Little was out with back spasms. ... McCollum and Lillard combined for 35 points and eight assists in the first half.\n\n\r\n                    Suns: In addition to Ayton not being available, Phoenix was without forwards Cam Johnson (wrist) and Abdel Nader (knee). ... The Suns need one win to reach the 50-win mark for the first time since the 2009-2010 season.\n\n\r\n                    UP NEXT\n\n\r\n                    Blazers: Return home to host the Nuggets on Sunday.\n\n\r\n                    Suns: Travel to face the Spurs on Saturday and Sunday to close the regular season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997775.535583
}