{
  "game_id": "0021800631",
  "espn_id": "401071307",
  "date": "Jan 12, 2019",
  "matchup": "MEM @ MIA",
  "headline": "Heat hang on late, top Grizzlies 112-108",
  "body": "MIAMI --  Shelvin Mack drove on Dwyane Wade, with the game on the line.\n\nMack's layup attempt never got near the rim.\n\nOnly a few days shy of his 37th birthday, Wade can still block shots -- even in the biggest moments of a game. Justise Winslow scored 26 points, Wade delivered the block and won the ensuing jump ball with 4 seconds left, and the Miami Heat beat the Memphis Grizzlies 112-108 on Saturday night.\n\n\"If he would have won that jump ball, I would have been highly disappointed in myself,\" said Wade, whose birthday is Thursday. \"I was very confident going into that jump ball that I could muster up just enough to get it.\"\n\nHe had just enough. Wade tapped the crucial jump to Josh Richardson, who made a pair of free throws to seal it for Miami with 1.1 seconds left.\n\nRichardson and Tyler Johnson each scored 14 for the Heat, who hit midseason at 21-20. Bam Adebayo and Derrick Jones Jr. scored 11 apiece, and Wade finished with 10 as the Heat survived despite wasting a 13-point lead midway through the third quarter.\n\n\"It's not always going to be pretty for us,\" Heat coach Erik Spoelstra said.\n\nJaMychal Green scored 24 points and grabbed 11 rebounds for the Grizzlies, who went 0-2 this season against Miami -- losing the two games by a total of seven points. Mike Conley scored 22 and Marc Gasol had 15 for the Grizzlies.\n\nConley banked in a 65-footer as time expired, though it was waved off and would have been irrelevant anyway.\n\n\"We still had an opportunity down the stretch,\" Memphis coach J.B. Bickerstaff said. \"They just made a couple more plays than we did.\"\n\nNo lead was safe: Memphis blew a pair of double-digit leads in the first half, and Miami was up by 13 midway through the third before finding itself scratching and clawing at the end. Conley's 3-pointer with 6:31 left knotted the game at 99, ending a 12-minute stretch where the Grizzlies outscored the Heat 32-19.\n\nIt was tied twice more after that as well, but the Grizzles never reclaimed the lead.\n\nConley tried a runner for the lead with 56 seconds left, and Gasol had a wide-open 3-point try as the shot clock was running down with 32 seconds remaining. Both missed -- Conley's bounced off and Gasol's missed everything, going wide left.\n\nWith Miami up one, Wade missed a jumper with 14 seconds left and Richardson grabbed the rebound for Miami before getting fouled. He made one of two free throws, and Memphis called time with 9 seconds left.\n\nThat brought on the play where Mack tried to drive on Wade, to no avail.\n\n\"It just came down to getting stops at the end,\" Green said.\n\nTIP-INS\n\nGrizzlies: Memphis opened on a 19-7 run, then had a 17-4 run later in the half -- yet still went into the break down 63-61. ... It was the first game at Miami for Joakim Noah since Dec. 6, 2016. ... During the game, Justin Timberlake tweeted out a video showing him making half-court shots on the Grizzlies' practice court in Memphis. He had a concert in their building Saturday night. ... Mack and Jaren Jackson each had 13 points for Memphis.\n\nHeat: It was kids' day at the Heat game, and Spoelstra got into the act by holding his 9-month-old son Santiago as he stood for the national anthem. \"One of the coolest things I've experienced,\" Spoelstra said. ... Hassan Whiteside (ill) missed the game. ... Miami made 15 3-pointers, and has 33 in its last two games.\n\nCHASING MICHAEL\n\nWade now has 865 blocked shots, 28 away from matching Michael Jordan's career record for a guard. Add in playoffs, and Wade has 1,040 -- 11 shy of Jordan's record.\n\nANDERSON HURT\n\nMemphis lost starting forward Kyle Anderson to a sprained left ankle in the first half. X-rays were negative, and Bickerstaff said he will have an MRI on Sunday.\n\nDAUNTING SCHEDULE\n\nMiami plays only four home games in the next six weeks -- and three of those are in a four-day span between Jan. 30 and Feb. 2. After that, the next Heat home game is Feb. 23. In all, 12 of Miami's next 16 are on the road and 11 of those games are against likely playoff teams.\n\nTURKEY TURNAROUND\n\nAt Thanksgiving, Memphis was 12-5 and leading the Western Conference. The Grizzlies are 7-18 since, and have fallen to 14th in the West.\n\nUP NEXT\n\nGrizzlies: Visit Houston on Monday. Both of Memphis' games against Miami this season were followed by one with the Rockets.\n\nHeat: Visit Milwaukee on Tuesday. It's the start of a four-game trip for the Heat, who are 10-8 on the road so far this season.",
  "source": "espn_api",
  "crawled_at": 1764994925.704285
}