{
  "game_id": "0022300580",
  "espn_id": "401585208",
  "date": "Jan 18, 2024",
  "matchup": "TOR vs. CHI",
  "headline": "Vucevic and DeRozan each score 24 points to help Bulls beat Raptors 116-110",
  "body": "TORONTO -- — Nikola Vucevic had 24 points and 14 rebounds, DeMar DeRozan scored 24 points against his former team and the Chicago Bulls beat the Toronto Raptors 116-110 on Thursday night.\n\n\r\n              Coby White added 23 points to help the Bulls snap a four-game losing streak in Toronto. Patrick Williams scored 12 points, and Alex Caruso and Ayo Dosunmu each had 10. Chicago outscored Toronto 74-50 on points in the paint.\n\n\r\n              “I knew I had a little bit of a size advantage and I was trying to take advantage of it,” said Vucevic, who connected on 12 of 17 attempts from inside the 3-point line and had seven assists.\n\n\r\n              Bulls guard Zach LaVine scored eight points, connecting on three of seven shot attempts, in 24 minutes. \n\n\r\n              LaVine left the court after rolling his right ankle early in the third quarter but returned for a four-minute stint later in the period. The two-time All-Star played just over two minutes in the fourth.\n\n\r\n              “He rolled his ankle, that’s all I heard,” Bulls coach Billy Donovan said. “I didn’t get a chance to see it on tape.”\n\n\r\n              LaVine returned Jan. 5 after missing 17 games because of inflammation in his right foot.\n\n\r\n              “I could just tell when he was back in there, I didn’t feel like he was moving great,” Donovan said. “I know he was trying. I think he wanted to keep going, just to keep himself fresh.”\n\n\r\n              Raptors forward Scottie Barnes had 31 points, one shy of his career best. RJ Barrett added 17 points but Toronto fell to 2-6 on the second night of a back-to-back.\n\n\r\n              The Raptors shot a season-worst 4 for 32 from long range Monday in a loss to Boston, then made a season-high 20 on Wednesday in a win over Miami. Toronto went cold again Thursday, missing nine straight from distance to begin the game. \n\n\r\n              “We missed six or seven straight 3s that were good open shots and it just spiraled with us, affected our defense there,” Raptors coach Darko Rajakovic said.\n\n\r\n              Toronto finished 10 for 38 on 3-pointers.\n\n\r\n              Bruce Brown scored 15 points in his Raptors debut, a day after being part of the trade that sent two-time All-Star Pascal Siakam to Indiana.\n\n\r\n              “I didn’t know the plays,” Brown said. “I was just trying to be in the right spots.”\n\n\r\n              Fellow Toronto newcomers forward Jordan Nwora and guard Kira Lewis Jr. were both active but neither played.\n\n\r\n              Toronto trailed 38-27 after the first quarter but rallied to cut the gap to five points, 63-58, at the half. Barnes scored nine points in the third, but the Bulls took a 90-86 lead to the fourth.\n\n\r\n              Toronto center Jakob Poeltl missed his sixth straight game because of a sprained left ankle.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Memphis on Saturday night.\n\n\r\n              Raptors: At New York on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995419.312583
}