{
  "game_id": "0022200757",
  "espn_id": "401468912",
  "date": "Jan 30, 2023",
  "matchup": "LAL @ BKN",
  "headline": "Irving has 26, Nets beat Lakers 121-104 as James, Davis sit",
  "body": "NEW YORK -- — Kyrie Irving had 26 points, seven rebounds and six assists to lead the Brooklyn Nets to a 121-104 victory Monday night over the Los Angeles Lakers, who played without LeBron James and Anthony Davis. \n\n\r\n              Irving had scored 30 or more in a career-best six straight games but didn’t have to carry as heavy a load with some good play from Brooklyn's backup guards. \n\n\r\n              “It's nothing but joy in my eyes when I see them get rewarded for the hard work they’ve put in,” Irving said. “It makes my job a lot easier.” \n\n\r\n              Patty Mills and Cam Thomas added 21 points apiece for the Nets, who won their second straight and are 4-6 since Kevin Durant sprained a ligament in his right knee. They won just five times in 21 games last season when he sprained the other knee. \n\n\r\n              “I think from a big-picture standpoint we’ve just worked out how to navigate the ship, I guess,” Mills said, “and it definitely does feel a lot different than last year in that sense.” \n\n\r\n              Lakers coach Darvin Ham said James was experiencing “really significant soreness” in his left foot and would be evaluated Tuesday to see if he could play at the New York Knicks that night.\n\n\r\n              James, who is 117 points shy of passing Kareem Abdul-Jabbar for the NBA's career scoring record, sat at the end of the Lakers bench. \n\n\r\n              It was a planned day off for Davis so he didn’t play both ends of a back-to-back after returning last week from a 20-game absence due to a right foot injury,\n\n\r\n              Thomas Bryant had 18 points and nine rebounds for the Lakers, while Russell Westbrook finished with 17 points, 10 assists and eight rebounds. The 2017 NBA MVP moved past Gary Payton into 10th place on the career assists list, something he never would have imagined when he was younger.\n\n\r\n              “In the NBA, I never dreamt of being in this position, nor getting to the point to where I’m next to some of the greats,” Westbrook said, “and I’m just truly grateful and thankful for an opportunity to keep playing at the highest level and I don’t take any of it for granted.” \n\n\r\n              The Lakers trailed by 12 at halftime but opened the third quarter with a 14-0 run for a 60-58 lead. Irving finally got the Nets going, but the Lakers built a seven-point lead later in the period after some strong work from Wenyen Gabriel, who scored nine straight Los Angeles points. Brooklyn recovered to close the period with a 10-0 spurt to grab an 85-82 lead.\n\n\r\n              Mills and Thomas made consecutive 3-pointers after the Lakers cut it to two in the fourth, and Brooklyn went on to lead by 14 before putting this one away.\n\n\r\n              The Lakers missed 11 of their first 14 shots and the Nets soon led 19-6. Brooklyn extended it to 19 points a few times in the second quarter but didn't close the half well, allowing the Lakers to pull within 58-46.\n\n\r\n              The Lakers were hoping to move on after an infuriating loss in Boston, when referees acknowledged they missed James being fouled on his drive to the basket at the end of regulation. \n\n\r\n              But it was clear early on they hadn't fully left their frustrations behind. Patrick Beverley, who got a technical foul in overtime Saturday, got another one in the first quarter Monday when he was called for a foul on Irving's 3-point attempt. Referee Ben Taylor then walked away from Beverley to the other side of the court to avoid having to call another one and issue an ejection.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: With James and Davis out, Rui Hachimura made his first start for Los Angeles and scored 16 points. It was his third game with the Lakers since being acquired from Washington. ... Troy Brown Jr. had 11 points and 17 rebounds.\n\n\r\n              Nets: Brooklyn was also short-handed, as Ben Simmons missed his second consecutive game with left knee soreness. Nets coach Jacque Vaughn said the hope is Simmons can return Wednesday. ... Day'Ron Sharpe grabbed 14 rebounds and Nic Claxton had 12.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At the New York Knicks on Tuesday.\n\n\r\n              Nets: At Boston on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994121.540303
}