{
  "game_id": "0021700264",
  "espn_id": "400975015",
  "date": "Nov 22, 2017",
  "matchup": "PHX vs. MIL",
  "headline": "Eric Bledsoe booed in return to Phoenix, scores 30 as Bucks win",
  "body": "PHOENIX -- Eric Bledsoe expected the boos from Phoenix fans and he heard them. Amid the fans' wrath for the way his time with the Suns ended, the veteran guard went out and had his best game as a member of the Milwaukee Bucks.\nKhris Middleton scored 40 points and Bledsoe added 30 in his return to the desert 15 days after being traded, leading the short-handed Bucks to a 113-107 overtime victory over the Suns on Wednesday night.\n\"My teammates did a hell of a job. I couldn't credit them any more. As much as I wanted to win this game, they had my back,\" Bledsoe said. \"It is what it is. They're just cheering for their team, doing what they are supposed to do. You can't blame them for that.\"\nDevin Booker led the Suns with 23 points and hit a long 3-pointer as time expired in the fourth quarter to force overtime. But the Suns had four of their season-high 29 turnovers in overtime and shot 1-for-8 in the extra period.\nSuns coach Jay Triano said the mistakes were the difference in the game, and Booker agreed.\n\"From the first half on they were just really physical,\" Booker said of the Bucks' defensive pressure. \"We had 29 turnovers, it's hard to win a game like that ... but we didn't execute down the stretch.\"\nBooker missed a chance to tie it with 7.5 seconds left in the extra session, and Middleton made four free throws to seal the Bucks' ninth victory of the season.\n\"Playing hard, getting stats when we need to, and rebounding,\" Middleton said. \"On the offensive end it was just grind it out, try to get the best shot.\"\nThe teams played a back-and-forth final quarter with Phoenix leading by as many as four. Milwaukee tied it at 99 on Thon Maker's jumper with 1:11 to play.\nThe Suns trailed by 15 points in the third quarter against a Milwaukee team missing leading scorer Giannis Antetokounmpo and four other players.\nAntetokounmpo was listed as having right knee soreness. The star forward, second in the NBA in scoring at 29.7 points per game, had played at least 35 minutes in each of his past five games.\nBledsoe was traded to Milwaukee on Nov. 7 in the deal that brought center Greg Monroe to the Suns. Monroe had 22 points and 15 rebounds.\n\"I felt comfortable. I was just trying to be aggressive every time I touched the ball,\" Monroe said.\nT.J. Warren added 20 points with 11 rebounds for the Suns.\nBledsoe scored 11 of his 17 first-half points in the second quarter, and Middleton had 18 at halftime. Milwaukee led 54-44 at the break.\nThe Suns rallied and took a 70-69 lead on the second of back-to-back 3s from Dragan Bender at the 4:02 mark of the third quarter. But the Bucks went on a 15-5 run helped by a technical foul on Booker, who was unhappy with an offensive foul call for his fourth personal, and took an 84-75 lead into the fourth quarter.\nBOOS FOR 'BLED'\nBledsoe was directed to stay away from the Suns in October after a tweet that seemed to indicate a desire to not be with the team, and he was eventually traded. Suns fans greeted Bledsoe with a mixture of cheers and boos when he was introduced in the starting lineup, and he received a round of boos when he touched the ball.\nSeveral fans sitting near courtside held large signs with messages that took shots at Bledsoe.\n\"I thought he did great,\" Bucks coach Jason Kidd said. \"It's not easy to come back where you played so soon.\"\nMONROE MAKES GOOD\nMonroe came off the bench for the Suns and said he felt he had an advantage inside against his former team.\n\"I think he felt he was pretty confident he could score inside against these guys,\" Triano said. \"We knew they would have a hard time stopping him.\"\nTIP-INS\nBucks: Antetokounmpo is expected to return to action Saturday at Utah. \"His minutes have been a little high early on and we've got to look at our bench,\" Kidd said. ... The Bucks were also without G Matthew Dellavedova (left knee), F John Henson (eye procedure) and another former Sun, F Mirza Teletovic (left knee). ... Second-year pro Gary Paton II made his first start of the season, but injured an ankle.\nSuns: F Jared Dudley (right knee) missed his sixth straight game. ... Tyson Chandler got the start at center after missing the past three games due to illness. ... The Suns and Bucks are both in their 50th seasons as NBA franchises, and will play each other in January on the 50th anniversary of the two cities being awarded teams.\nUP NEXT\nBucks: At Utah on Saturday night.\nSuns: Host New Orleans on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764993919.584873
}