{
  "game_id": "0022201122",
  "espn_id": "401469277",
  "date": "Mar 27, 2023",
  "matchup": "DET vs. MIL",
  "headline": "Middleton leads short-handed Bucks past decimated Pistons",
  "body": "DETROIT -- — Khris Middleton scored a season-high 34 points against the team that drafted him, and the Milwaukee Bucks beat the Detroit Pistons 126-117 without Giannis Antetokounmpo on Monday night.\n\n\r\n              “With Giannis out, I knew I had to be aggressive,” said Middleton, who added eight rebounds and five assists. “I had to get to my spots and when I got there, I've either got to shoot or find the open man.”\n\n\r\n              Milwaukee improved to an NBA-best 54-21 despite the absences of Antetokounmpo (knee), Jrue Holiday (personal) and Jae Crowder (calf). Goran Dragic made his Bucks debut after signing with the team on March 4, but didn't score in nine minutes.\n\n\r\n              “Chris has looked really good since he came back from the injury,” Bucks coach Mike Budenholzer said. “He's obviously going to be shooting it, but he's doing a lot of good things defensively right now.” \n\n\r\n              Brook Lopez had 24 points and 14 rebounds, Bobby Portis added 21 points and 14 rebounds, and Jevon Carter scored 22.\n\n\r\n              “I was really out there trying to crash the boards,” Portis said. “Even when you get blocked out, and I got blocked out a lot tonight, you might help free up someone else. It's just about playing with energy.”\n\n\r\n              The Pistons got a career-high 32 points, eight rebounds and eight assists from rookie Jaden Ivey, but lost their sixth straight game and 17th of 18. They are 1-13 against Central Division opponents.\n\n\r\n              “We know Jaden is going to be able to score the ball, but I'm happy with all the other things he's doing,” Pistons coach Dwane Casey said. “He's growing as a player, especially on the defensive end.”\n\n\r\n              Detroit continued to use a roster that would fit in the Summer League, with Bojan Bogdanovic (achilles), Cade Cunningham (leg), Hamadou Diallo (ankle), Isaiah Stewart (shoulder) and Alec Burks (foot) all sidelined.\n\n\r\n              The Pistons were within 117-110 when Middleton missed a jumper with 2:09 to play. However, Lopez tipped in the rebound, and after Ivey missed a 3-pointer, Middleton's three-point play made it a 12-point game.\n\n\r\n              Milwaukee led 55-40 with three minutes left in the second quarter, but the Pistons narrowed the gap to 57-51 at halftime. Middleton had 17 points against his former team while Ivey scored 11 for Detroit.\n\n\r\n              The Bucks led 94-90 at the end of the third, but Joe Ingles was called for a technical foul between quarters and Cory Joseph hit the free throw to make it a three-point game.\n\n\r\n              The Bucks moved back in front 106-95, but Lopez missed the free throw on a possible three-point play with 8:43 to go. Detroit had several 3-pointers go in and out, and Carter hit a 3 to make it 111-97 with 6:48 left.\n\n\r\n              “They are a great team and they know what it takes to win a game like that,” Ivey said. “They were doing all the little things and we didn't.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Middleton was selected by the Pistons in the second round (No. 39 overall) of the 2012 draft and played 27 games as a rookie. After the season, he was traded to Milwaukee along with Brandon Knight and Viacheslav Kravtsov for Brandon Jennings. \n\n\r\n              Pistons: Detroit plays five of its final seven games on the road. The team's only remaining home games are on back-to-back nights — April 4 against Miami and April 5 against Brooklyn. ... The Pistons lost all four games to Milwaukee this season.\n\n\r\n              CLEANING THE GLASS\n\n\r\n              Despite rotating three post players — Marvin Bagley III, Jalen Duren and James Wiseman — the Pistons were only successful on 69% of their defensive rebounding chances, marking the ninth time in 10 games they have been under 75%. \n\n\r\n              “We can't keep letting teams extend possessions,” Ivey said. “We've got to find a way to grab the defensive rebounds and turn them into transition points.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit the Indiana Pacers on Wednesday.\n\n\r\n              Pistons: Visit the Oklahoma City Thunder on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994355.484653
}