{
  "game_id": "0022000939",
  "espn_id": "401307742",
  "date": "Apr 28, 2021",
  "matchup": "MEM vs. POR",
  "headline": "McCollum, Powell help Trail Blazers defeat Grizzlies 130-109",
  "body": "MEMPHIS, Tenn. -- — CJ McCollum had 26 points and six assists, and Norman Powell added 24 points, helping the Portland Trail Blazers solidify their hold on seventh place in the West with a 130-109 victory over the Memphis Grizzlies on Wednesday night.\n\n\r\n                    Damian Lillard finished with 23 points and Carmelo Anthony scored 18 as Portland moved two games ahead of Memphis and San Antonio, which lost 116-111 at Miami on Wednesday night.\n\n\r\n                    “We (were) definitely ready to play,” Anthony said. “You could sense it. You could feel it that we were locked in, and we knew how important this game was for us.”\n\n\r\n                    Jonas Valancuinas led Memphis with 19 points, and Dillon Brooks had 18. Jaren Jackson Jr. scored 13 points and Ja Morant added 10 points and eight assists, but was 3 of 11 from the field as the Grizzlies lost their second straight.\n\n\r\n                    “We had a hard time getting in the paint and finishing,” said reserve forward Brandon Clarke, who had eight points. “We had a harder time with our pace.”\n\n\r\n                    The Grizzlies made a slight dent in what was once a 33-point lead in the first half, getting the deficit to 17 in the third quarter, but Portland was really never threatened after halftime. \n\n\r\n                    The game was the third in six days between the teams maneuvering for the postseason play-in positioning with hopes of possibly moving into the Western Conference’s top six seeds.\n\n\r\n                    While the previous two games were close, Memphis won both last weekend in Portland, leaving the Trail Blazers with a sense of revenge. McCollum and Anthony both recalled that those two losses were on Portland’s home court.\n\n\r\n                    “We came on their court and kicked their (butts),” McCollum said.\n\n\r\n                    The Trail Blazers came out with accurate shooting, particularly from Lillard, McCollum and Powell, who combined to go 18 of 27 from the field in the first half. Portland was still shooting about 55% in the second quarter as it built the 33-point lead.\n\n\r\n                    Meanwhile, the Portland defense forced Memphis into poor shots and out-of-sync offense. The Grizzlies struggled to shoot better than 35%.\n\n\r\n                    “To me, it’s a five-man defense so everybody has to do their jobs,” Portland coach Terry Stotts said, adding. “For me, the first half was about team defense and that includes transition defense.”\n\n\r\n                    All of those factors were a recipe for a 74-46 Portland lead at the break, matching the most points by a Memphis opponent in a first half. The Trail Blazers never lost control after that.\n\n\r\n                    Despite Wednesday’s route and a 120-96 loss at Denver on Monday to wrap up a seven-game road trip, Memphis coach Taylor Jenkins saw that last two games as a minor setback compared to the rest of the season.\n\n\r\n                    “If you look at the two (Portland wins) before these last two, we played extremely well,” Jenkins said. “… These aren’t reflective of what we’ve been able to accomplish this season. We’re in a great spot. 31-30. If anyone is raising alarms, or concerns, I don’t know what y’all are watching.”\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: Announced earlier Wednesday that they have signed F Rondae Hollis-Jefferson for the remainder of the season. … Had lost four straight road games in the series, and had not won at FedExForum since Nov. 20, 2017. \n\n\r\n                    Grizzlies: G Grayson Allen left the game in the first quarter with a left hand injury. He returned in the second quarter. … Justise Winslow recorded his 100th career block in the first quarter. … Indiana scored 74 points against the Grizzlies in the first half on April 11.\n\n\r\n                    NOT STARTING YET\n\n\r\n                    Grizzlies forward Jaren Jackson Jr. played his fourth game of the season after rehabbing left meniscus surgery most of the season. Jackson continued to come off the bench rather than starting. “As we’re getting (Jackson) integrated back, the number one thing is just what’s medically best for him,\" Jenkins said. \"He’s played in a couple games now, and he’s got a lot of games ahead of him. We want to do what’s smart to on-ramp him.”\n\n\r\n                    LAST WORD\n\n\r\n                    Asked if he thought his players knew of Grizzlies swingman Dillon Brooks comments about trying to sweep the Trail Blazers, Stotts replied: “I think our player knew about it, yeah.”\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Continue a six-game road stretch on Friday, facing the Brooklyn Nets.\n\n\r\n                    Grizzlies: Host the Orlando Magic on Friday in the first of a back-to-back, home-and-home series between the teams.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996922.5334918
}