{
  "game_id": "0021700526",
  "espn_id": "400975272",
  "date": "Dec 29, 2017",
  "matchup": "MIL @ OKC",
  "headline": "Antetokounmpo's late basket lifts Bucks past Thunder 97-95",
  "body": "OKLAHOMA CITY --  Even though he stepped out of bounds on the play, Giannis Antetokounmpo's basket with 1.3 seconds left counted, and that's all that mattered to the Milwaukee Bucks.\n\nAntetokounmpo scored 23 points -- including what proved to be a questionable game-winning basket which he scored over Russell Westbrook- and the Bucks ended Oklahoma City's six-game winning streak, beating the Thunder 97-95 on Friday night.\n\nReplays clearly showed Antetokounmpo stepped on the baseline on his drive. After a desperation heave by Westbrook fell short, Thunder coach Billy Donovan and several of his players pleaded for a review, but officials Derek Stafford, Ben Taylor and Leon Wood refused. Stafford later told a pool reporter that the play wasn't reviewable.\n\n\"In any reviewable matter, there has to be a whistle called on the floor,\" Stafford said. \"There was no whistle blown for the play, so we couldn't review it.\"\n\nDonovan said the official told him they couldn't' review the play.\n\n\"I look at things totally differently,\" Donovan said. \"The league and the officials have to deal with that. That's what they're in control of or not. I'm more concerned about the fact that we didn't play well in the first quarter. There were some things that we needed to do better. Obviously, he stepped out of bounds. Everybody knows that. I did not get a chance to personally see the replay. I was trying to ask for a review. They couldn't review it, but that's something they have to deal with and the league has to deal with. I think the things I try to focus on is, what do we have to do to get better?\"\n\nAntetokounmpo said he hadn't yet seen the replay and wasn't aware that he'd stepped out of bounds.\n\n\"It was his ball to come up with a play for himself or make a play for someone else and we did the right thing,\" Milwaukee coach Jason Kidd said of Antetokounmpo's basket. \"I don't understand the whole protest. I can only worry about the score and then them trying to put time on the clock, getting the guys prepared to have a last-second play.\"\n\nWestbrook led Oklahoma City with 40 points, 14 rebounds and nine assists and hit a game-tying 3-pointer with 4.7 seconds left. The Thunder had gone 11-3 in December before playing Friday without one of its stars, Paul George, who sat out with left knee soreness.\n\nThunder players and their coach seemed resigned to their fate.\n\n\"I guess we'll see something on the ticker that says the referees missed that one,\" said Carmelo Anthony, who scored 12 points. \"We can't do nothing about that at this point, so we might as well forget about it and move on and get ready for ... who do we play Sunday? Dallas? Get ready for Dallas.\"\n\nKhris Middleton scored 20 points and John Henson added 18 points for the Bucks, who completed a sweep of the Northwest Division's top two teams on consecutive nights. Milwaukee rallied from 20 points down in the third quarter on Thursday to beat Minnesota, then jumped to a 22-point first-half lead against Oklahoma City and held on.\n\nOklahoma City had won four straight home games against Milwaukee and five of their last six overall against the Bucks, but the Thunder started the game by making just one of their first eight shots as the Bucks raced to a 16-2 lead.\n\nMilwaukee led 41-19 less than 30 seconds into the second quarter. Oklahoma City cut its deficit to 58-44 by halftime and pulled within 65-62 on Josh Huestis' 3-pointer with 4:33 left in the third quarter, but Westbrook missed a 3-point attempt that would have tied the game.\n\nOklahoma City was within 76-69 with 10:47 left, but Middleton scored seven straight points to rebuild Milwaukee's lead to 14 points. The Thunder made one last run, tying the game at 95 on Westbrook's 3-pointer with 4.7 seconds left.\n\nTIP-INS\n\nBucks: Milwaukee's streak of scoring 100 or more points ended at 17 games, its longest since doing so in 22 straight games in the 1986-87 season ... The Bucks' 38 points tied the most by a Thunder opponent in the first quarter this season, matching Toronto, which did so Wednesday. ... Eric Bledsoe committed four first-half fouls in eight minutes ... Antetokounmpo, who also had 12 rebounds, has 17 double-doubles this season.\n\nThunder: Alex Abrines started in place of George. It was Abrines' fifth start of the season, but he was scoreless in 10 first-half minutes. Josh Huestis started the second half in his place. ... Westbrook scored his 16,000th career point, making him the 112th NBA player to do so.\n\nUP NEXT:\n\nBucks: Visit Toronto on Monday, the first of two games in five days for Milwaukee against the Raptors, with a home game against Indiana in between on Wednesday.\n\nThunder: Host Dallas on Sunday to wrap up a four-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764993025.291065
}