{
  "game_id": "0022200831",
  "espn_id": "401468986",
  "date": "Feb 09, 2023",
  "matchup": "ORL vs. DEN",
  "headline": "Subs Anthony, Bol key Magic's win over West-leading Nuggets",
  "body": "ORLANDO, Fla. -- — Reserves Cole Anthony and Bol Bol each scored 17 points to lead the Orlando Magic to a 115-104 win over the Western Conference-leading Denver Nuggets on Thursday night.\n\n\r\n              Wendell Carter Jr. led seven Magic scorers in double figures with 19 points, and Orlando's bench outscored the Nuggets' reserves 56-10.\n\n\r\n              “This second group is starting to really figure it out,” said Cole, who had seven rebounds and seven assists. “As a unit we’re just really locking in on that defensive end and trying to let our defense spark our offense.”\n\n\r\n              Aaron Gordon had a season-high 37 points and 14 rebounds to lead the Nuggets. Nikola Jokic had 29 points, 11 rebounds and six assists, and combined with Gordon to score all 29 of Denver's points in the third quarter.\n\n\r\n              But after a shaky start, the Magic, who stand 13th in the Eastern Conference at 23-33, had their way.\n\n\r\n              “Our guys know and get that we can play with anybody in the league, and that’s what we’re going to continue to prove,” Magic coach Jamahn Mosley said. “That’s how we’re going to continue to play on a nightly basis.”\n\n\r\n              After missing their first five shots and falling behind 12-0, the Magic shot 63% (27 for 43) for the rest of the first half. They led by 16 points before Gordon and Jokic helped Denver cut its deficit to 10 points — 65-55 — halftime.\n\n\r\n              “The message was simple at halftime — we’re not playing hard enough, we’re not playing physical enough,” said Denver coach Michael Malone. “They’re outworking us, they’re diving on the floor for loose balls and we’re bending over, trying to pick them up.”\n\n\r\n              Gordon (17 points) and Jokic (12) handled all the scoring for the Nuggets in the third quarter, and a 3-pointer by Gordon pulled them to within three late in the period.\n\n\r\n              But Gordon and Jokic spent the first 3:34 of the final period on the bench, and Anthony and Bol led a rally that pushed Orlando's lead back to 107-88 with 6:05 remaining.\n\n\r\n              “I didn't do the job tonight,” said Ish Smith, who went scoreless in 14-plus minutes off the Denver bench. “When they are rolling and getting 50/50 balls, getting second shots, and playing with a lot of energy, you have to match their energy, and we didn't do the job.” \n\n\r\n              Bol scored 12 straight points before leaving the game with 4:36 remaining. Anthony finished with 17 points, seven rebounds and seven assists.\n\n\r\n              “I think Cole was fantastic tonight,” said Mosley. “He did such a great job or us being able to push the pace ... a big part is him just being himself, being aggressive early, attacking, and being able to break the defense down.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: G Jamal Murray missed a third game with right knee inflammation, and coach Michael Malone indicated it is unlikely Murray will play again until after the All-Star break. ... F Zeke Nnaji missed a second game with a strained right shoulder. . . . Jokic had seven of Denver's 16 turnovers. . . . After scoring 49 points in the first quarter of a 146-112 wn Tuesday night, the Nuggets scored 49 in the second half Thursday.\n\n\r\n              Magic: G Jalen Suggs started his first game since Nov. 25, replacing Gary Harris (groin) in the starting lineup. ... The Magic shot 9 for 27 from 3-point range and are 23 for 75 (31%) over the last three games, including two wins.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Charlotte on Saturday.\n\n\r\n              Magic: Host Miami Heat on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994619.696775
}