{
  "game_id": "0021801009",
  "espn_id": "401071682",
  "date": "Mar 12, 2019",
  "matchup": "LAL @ CHI",
  "headline": "James scores 36 points in Lakers' 123-107 win over Bulls",
  "body": "CHICAGO --  Less than a week after passing Michael Jordan for fourth on the NBA's career scoring list, LeBron James delivered a memorable night at the arena Jordan first made famous.\n\nJames had 36 points and 10 rebounds, and the Los Angeles Lakers overcame a 20-point deficit to beat the Chicago Bulls 123-107 on Tuesday night and end a five-game losing streak.\n\nJames played 33 minutes and showed no signs of letting up with the Lakers barely hanging on in the playoff race. He took over after the Lakers' 14-point lead was cut to four with 8:38 left, making a jumper and then on the next possession going through the lane for a thunderous dunk.\n\nJames didn't stop there, hitting a 3-pointer over 7-footer Robin Lopez and capping it off when Josh Hart passed the ball off the backboard to James, who finished with a reverse dunk to put the Lakers up 115-101 with 5 minutes remaining.\n\nJames was asked if he had any special thoughts returning to the United Center.\n\n\"Not really, but I definitely recognize the greatness Mike had in this city,\" James said. \"Pretty much every time I play here I look up at the rafters, look up at the jersey retired and then when the starting lineups come up, when I was a kid watching that starting lineup watching the Bulls run through the city and Jordan's name and number getting called, I always have that feeling.\"\n\nIt was James' highest-scoring game since Dec. 18.\n\nKyle Kuzma added 21 points after missing two games with an ankle injury. Kentavious Caldwell-Pope scored 24 points off the bench for the Lakers, who outscored the Bulls 43-24 in the third quarter.\n\nLopez had 20 points and seven rebounds, and Otto Porter Jr. finished with 19 for the Bulls.\n\nWith Lonzo Ball and Brandon Ingram ruled out for the season, James put on a show at United Center like he did so many times as a member of the Cavaliers and Heat.\n\nThe Bulls outscored the Lakers 11-1 after he checked out in the first quarter to lead 34-16 at the end of the period.\n\nThen something finally start to click for the Lakers.\n\n\"We started to have fun,\" Kuzma said. \"Everybody had a joy for the game, happy for each other. Everybody was moving the ball, passing it. It felt like everybody got shots tonight.\"\n\nThe Bulls led 60-55 at the half. Ryan Arcidiacono and Lopez led Chicago with 12 apiece. James finished with 16 points and seven rebounds in the half and Caldwell-Pope added 11 points.\n\nJames continued the momentum in the third quarter. He scored the first six points for Los Angeles, including a breakaway reverse dunk from Kuzma. The Lakers took a 66-64 lead when James found Kuzma for a layup with 8:49 in the third quarter. Kuzma, who scored 12 points in the period, made a 3 to ignite a 16-0 run late in the quarter. Rajon Rondo buried a 3 to give the Lakers a 98-84 lead going to the fourth.\n\n\"We got defensive stops and we made some shots. We were very in-tune with what we needed to do defensively and our second-unit guys came in with energy and effort,\" James said.\n\nLauri Markkanen struggled again with his shot. He was 4 of 17 for 11 points.\n\n\"To say something is wrong with him I think would be premature and not correct. To say, we need him to play better for us to have a chance to win is the way to say it,\" Bulls coach Jim Boylen said. \"Whether it is rebounding the ball and bringing it, which he needs to do more of. He was playing well, he was doing more of that. And he needs to, obviously, make open shots.\"\n\nTIP-INS\n\nLakers: Coach Luke Walton has not made a decision on if he will rest James in one of the back-to-back games on Thursday and Friday in Toronto and Detroit. Before the game, Walton was asked what would've been his reaction if he was told they would have the same record (30-36) as they did after 66 games last season.\n\n\"I would've assumed that we got hit with a lot of injuries. If you told me we were healthy, I would've told you there is something wrong. But it is where we are at right now as a group and it is our job to continue to come out and give everything we can to get better to win what games we do have left,\" Walton said.\n\nBulls: Boylen expects Zach LaVine, who missed his second straight game, to return this season. There is no timetable on LaVine's return. He is out with a right patellar strain. \"I'm optimistic. I'm not eyeing a return date, but I'm optimistic,\" Boylen said. \"Our training/medical is optimistic so he wants to play. He was in a nice groove, nice rhythm. I think he wants to get back at it. He's done his treatment, he's been early he's stayed late to do his stuff, so he's working at it.\" . Wayne Selden was hit with consecutive technicals late in the third quarter to get ejected.\n\nUP NEXT\n\nLakers: Visit Toronto on Thursday.\n\nBulls: Visit the Los Angeles Clippers on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994322.956974
}