{
  "game_id": "401810153",
  "espn_id": "401810153",
  "date": "Nov 29, 2025",
  "matchup": "GS vs NO",
  "headline": "Butler leads Curry-less Warriors past Pelicans, 104-96",
  "body": "SAN FRANCISCO -- — Jimmy Butler had 24 points, 10 assists and eight rebounds, and the Golden State Warriors beat the New Orleans Pelicans 104-96 on Saturday night playing without Stephen Curry after he bruised his left quadriceps muscle Wednesday night in a home loss to Houston.\n\n\r\n              Zion Williamson scored 25 points on 8-for-16 shooting and grabbed seven rebounds and Saddiq Bey added 21 points to lead New Orleans. Jeremiah Fears had 16 points and six rebounds before being ejected with 44.6 seconds left with his second technical foul.\n\n\r\n              Jonathan Kuminga hit back-to-back 3s midway through the fourth and finished with 10 points after returning from a seven-game absence with tendinitis in both knees. He received a warm ovation when checking into the game for the first time at the 7:40 mark of the opening quarter and scored moments later.\n\n\r\n              Brandin Podziemski had 15 points, six assists and five rebounds while Gary Payton II scored 12 of his 19 points in the first half and contributed 11 rebounds in just the second win by Golden State over its last six, a stretch that included a 124-106 defeat at New Orleans on Nov. 16. \n\n\r\n              Without Curry, Golden State went 1 for 19 from 3-point range to start the game and was 2 of 22 by halftime with a season-low 42 points for a first half. The 3-point shooting those two quarters matched the Warriors' worst percentage in 367 games with 20 or more attempts during coach Steve Kerr's tenure. They wound up 12 for 47 from deep.\n\n\r\n              With 2:26 before halftime, Butler took a hard hit from Micah Peavy and limped toward the bench while the play was reviewed and determined it was a Flagrant 1. Butler remained in the game to take his free throws.\n\n\r\n              New Orleans forward Trey Murphy, the Pelicans' second-leading scorer averaging 19.7 points, sat out because of right elbow soreness.\n\n\r\n              Up next\r\n              Pelicans: Visit the Los Angeles Lakers on Sunday night to complete the road back-to-back.\n\n\r\n              Warriors: Host Oklahoma City on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042718.434415
}