{
  "game_id": "0021900807",
  "espn_id": "401161449",
  "date": "Feb 12, 2020",
  "matchup": "ATL @ CLE",
  "headline": "Cavaliers end 12-game home skid, beat Hawks 127-105",
  "body": "CLEVELAND --  The Cleveland Cavaliers finally had some fun on their home court Wednesday night.\n\nTristan Thompson scored 27 points and grabbed 11 rebounds, Larry Nance Jr. had a career-high 23 points, and the Cavaliers broke a 12-game home losing streak, defeating the Atlanta Hawks 127-105.\n\nCleveland was coming off the worst home loss in franchise history, a 133-92 rout by the Los Angeles Clippers on Sunday. The Cavaliers won at home for the first time since beating the Hawks on Dec. 23.\n\n\"It's a happy locker room again,\" Cavaliers coach John Beilein said. \"It's been a long time in Rocket Mortgage FieldHouse for us to have a happy locker room.\"\n\nAndre Drummond scored 14 points and had 15 rebounds. Drummond, acquired from Detroit at the trade deadline, has had a double-double in both games with Cleveland.\n\n\"I know these guys hadn't won since Christmas,\" he said of Cleveland's home streak. \"It's good we came with so much energy.\"\n\nThompson hit three 3-pointers, a career high in a game for the 6-foot-9 center. He participated in a long-range shooting contest with Nance and Drummond during the team's morning shootaround.\n\n\"Guards do shooting games in practice, so why not the bigs?\" Thompson said. \"Sometimes you make, sometimes you miss. It's fun. It's good big man competition.\"\n\nThe Cavaliers, who had lost 13 of 14 overall, went ahead midway through the first quarter and led by 23 points in the third. Atlanta cut the lead to nine in the fourth, but got no closer.\n\nNance, starting in place of the injured Kevin Love, had 12 rebounds. Collin Sexton, who was added to the Rising Stars roster this week, had 23 points.\n\nTrae Young scored 27 points and had 12 assists for the Hawks, who rallied after trailing 86-63 midway through the third quarter.\n\nAtlanta's All-Star guard was 8 of 17 from from the field. John Collins scored 23 points and rookie Cam Reddish had 16.\n\nThe Hawks (15-41) are trying to hold off the Cavaliers (14-40) for the worst record in the Eastern Conference. Both teams played their final game before the All-Star break.\n\n\"Everybody is thinking about where they're going and when their plane is going to leave (for the break), so it happens sometimes,\" Young said.\n\nThe Cavaliers had highlight-reel plays that brought Cleveland's bench players and the crowd to their feet several times.\n\nThompson added a personal flurry in the second quarter. He hit 3-pointers from the top of the key on back-to-back possessions and ran upcourt with his arms in the air. He drove into the lane and finished with a resounding dunk the next time down the court.\n\nDrummond later dribbled upcourt after grabbing a rebound, passed to Darius Garland, who made an underhand lob pass to Nance for a dunk.\n\nThompson added another 3-pointer in the closing minutes. Rookie Kevin Porter Jr. scored 18 points\n\nHawks center Dewayne Dedmon made his first start since being acquired from Sacramento on Feb. 6, but was limited to 18 minutes and had four fouls.\n\nTIP-INS\n\nHawks: Dedmon's return moved C Damian Jones to a reserve role. ... C Clint Capela (plantar fasciitis) and F Skal Labissiere (left knee) were out.\n\nCavaliers: Love didn't play because of a sore right Achilles. Beilein said he slightly injured the Achilles last week and played with the soreness Sunday. ... Thompson is 7 for 23 on 3-pointers in his career..\n\nHALL OF FAME SALUTE\n\nHawks forward Vince Carter, likely playing his final game in Cleveland, was given a long ovation during a photo presentation on the video board before the second quarter. Carter waved to the crowd and pointed to Cleveland's bench, exchanging hugs with several players.\n\nSIMPLE EXPLANATION\n\nHawks coach Lloyd Pierce got right to the point when asked about what happened to his team.\n\n\"Their effort was great and ours wasn't,\" he said. \"Not a pretty game. They just played harder than us.\"\n\nUP NEXT\n\nHawks: host Miami on Feb. 20.\n\nCavaliers: visit Washington on Feb. 21.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996665.190602
}