{
  "game_id": "0021400178",
  "espn_id": "400578470",
  "date": "Nov 21, 2014",
  "matchup": "OKC vs. BKN",
  "headline": "Nets hold on to beat Thunder 94-92",
  "body": "OKLAHOMA CITY --  Reggie Jackson sat silently in the locker room, slumped down in a chair with his arms crossed, a towel over his shoulders and ice on his knees.\n\nMinutes earlier, he missed what would have been a game-winning 3-pointer at the buzzer, and the Brooklyn Nets held on for a 94-92 win over Oklahoma City on Friday night. The Thunder lost their fifth straight and now have the league's second-longest losing streak.\n\nJackson, who led the Thunder with 21 points and eight assists, had played one of his better games of the season before the miss. He went for the 3-pointer and the win instead of the two and overtime.\n\n\"Tonight wasn't a bad shot,\" Oklahoma City coach Scott Brooks said. \"We probably could have gotten something at the basket. We were in the bonus and down two and had shooters on the court. I thought he could have had an opportunity to drive, but he did get a good look. He got a clean look and a clean three. The ball went in and out.\"\n\nIt was the kind of good fortune that has eluded the Nets in a 5-7 start. The Nets held on with defense, limiting the Thunder to 27 percent shooting in the fourth quarter.\n\nJarrett Jack scored 23 points off the bench, Deron Williams scored 17 points and Brook Lopez had 16 points and 10 rebounds to help the Nets snap a five-game losing streak.\n\n\"We came in with the mindset we were going to win, and even when we were behind, we stuck together and pushed through,\" Lopez said. \"I think there was just a lot of effort. We did a good job getting rebounds as a team. All five were crashing the boards, boxing out, so I think it made it easier.\"\n\nSerge Ibaka had 16 points and 10 rebounds, Anthony Morrow had 11 points and Steven Adams added 10 for Oklahoma City.\n\nThe Thunder, besieged by injuries all season and at times limited to eight active players, finally got some depth. Andre Roberson started after playing limited minutes the previous game and missing the seven games before that with a sprained left foot. Brooks used 10 players in the first half, and Oklahoma City led 53-49 at the break.\n\nThe Thunder led 63-60 early in the second half when Jackson drove to the hoop and threw down a hammer dunk on both Lopez and Kevin Garnett that got the crowd energized. Oklahoma City continued the charge and expanded its lead to nine, but the Nets cut the deficit to three in the final seconds of the third quarter.\n\nBrooklyn led 93-85 after a 3-pointer by Jack with just over 2 minutes to play. But the Thunder rallied, and a pair of free throws by Jackson cut the Nets' lead to 93-90 with 46 seconds remaining.\n\nOklahoma City got a stop, then Jackson scored on a bank shot with 5.5 seconds left. Johnson was fouled with 4.9 seconds left, and he made one of two to give the Thunder the ball, down two with 4.6 seconds left, before Jackson's miss.\n\nTIP-INS\n\nThunder: Brooks said injured stars Kevin Durant (broken right foot) and Russell Westbrook (broken right hand) are coming along well in their recoveries from injuries. Both are able to do limited work in practice, but neither are participating in contact drills. ... Thunder shot 67 percent in the first quarter to take a 27-21 lead.\n\nNets: Brooklyn shot 54 percent in the first half. ... The Nets lost their previous game to Milwaukee in triple overtime. ... Bojan Bogdanovic, who entered the game second among rookies in scoring (11.3 per game), finished with three points on 0-for-5 shooting.\n\nQUOTABLE\n\nLopez, on Jack's performance: \"He was fantastic. You know, he was getting in the paint, making plays for everyone, scoring, D-ing up. He was really doing everything for us, and he was a huge sparkplug for us.\"\n\nROUGH FINISHES\n\nIt was Oklahoma City's fifth loss by four or fewer points. The Thunder have made just 29 of 81 shots (36 percent) in the final three minutes of the fourth quarter this season and 3 of 11 in overtime.\n\nUP NEXT\n\nOklahoma City plays host to Golden State on Sunday\n\nBrooklyn plays at San Antonio on Saturday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764991931.857794
}