{
  "game_id": "0022400477",
  "espn_id": "401705043",
  "date": "Jan 03, 2025",
  "matchup": "LAL vs. ATL",
  "headline": "LeBron James breaks Jordan's record for 30-point games in Lakers' 119-102 win over Hawks",
  "body": "LOS ANGELES -- — LeBron James scored 30 points to become the NBA's career leader in 30-point games, surpassing Michael Jordan's record during the Los Angeles Lakers' 119-102 victory over the Atlanta Hawks on Friday night.\n\n\r\n              James hit an 18-foot jumper midway through the fourth quarter to secure the 563rd 30-point game of his 22-year career, breaking the record set in 2003 by his childhood idol.\n\n\r\n              James had nine points in the fourth quarter for the Lakers, who showed little fatigue while pulling away in the final minutes of their third home game in four nights..\n\n\r\n              Austin Reaves scored 20 points, and Anthony Davis had 18 points and 19 rebounds after sitting out the Lakers' 114-106 victory over Portland on Thursday night to rest his sprained left ankle.\n\n\r\n              Los Angeles has won seven of nine to move into fourth place in the Western Conference.\n\n\r\n              Trae Young had 33 points and nine assists for the Hawks, who lost their second straight at the midway point of a six-game trip. Jalen Johnson scored 19 points.\n\n\r\n              Bronny James played the final 1:41 in his first NBA action since Dec. 8.\n\n\r\n              Takeaways\r\n              Hawks: They played active defense all night, but couldn't shoot. Zaccharie Risacher, Dyson Daniels, De'Andre Hunter, Bogdan Bogdanovic and Garrison Matthews combined to go 2-for-21 on 3-pointers.\n\n\r\n              Lakers: Even 18 turnovers couldn't stop Los Angeles' improved play since losing in overtime in Atlanta last month.\n\n\r\n              Key moment\r\n              The Hawks were still hanging around until James hit back-to-back turnaround jumpers midway through the fourth quarter, making a couple of shots that resembled a key part of Jordan's repertoire.\n\n\r\n              Key stat\r\n              James also played in his 1,523rd career regular-season game, passing Dirk Nowitzki for fourth in NBA history.\n\n\r\n              Up next\r\n              The Hawks take the 110 freeway to the 91 to face the Clippers on Saturday. The Lakers are in Houston on Sunday to open a two-game Texas trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997182.837076
}