{
  "game_id": "0022200435",
  "espn_id": "401468590",
  "date": "Dec 16, 2022",
  "matchup": "MIN @ OKC",
  "headline": "Reid scores 28 as Timberwolves top Thunder, snap 3-game skid",
  "body": "OKLAHOMA CITY -- — Naz Reid loves playing against Oklahoma City.\n\n\r\n              The fourth-year big man scored a season-high 28 points and the shorthanded Minnesota Timberwolves beat the Thunder 112-110 on Friday night to snap a three-game losing streak.\n\n\r\n              Making his first start of the season, Reid finished one point short of his career high set last season against Oklahoma City. His NBA rebounding high of 18 was established earlier this month versus the Thunder, too.\n\n\r\n              “He’s had a lot of really good games against Oklahoma City,” Minnesota coach Chris Finch said. “I don’t know what it is. He feels extremely comfortable, confident.”\n\n\r\n              Austin Rivers scored 20 points and Anthony Edwards added 19 points, 11 rebounds and seven assists for the Timberwolves. Minnesota was without injured starters Rudy Gobert (sprained left ankle), Karl-Anthony Towns (right calf strain) and D’Angelo Russell (bruised left knee).\n\n\r\n              Reid helped offset those absences by making 11 of 18 field goals and grabbing nine rebounds.\n\n\r\n              “We fought through a lot of things out there, adversity,” Finch said. “Some of it self-imposed, some of it environmental. But guys stuck with it. Could have easily got their heads down, but they kept battling.”\n\n\r\n              Shai Gilgeous-Alexander scored 35 points and Josh Giddey added 11 points, 13 rebounds and six assists for the Thunder, who dropped their fifth straight. Oklahoma City lost to the Miami Heat by two on Wednesday night.\n\n\r\n              “When you lose, it sucks and the emotion of it can get to you,\" Thunder coach Mark Daigneault said. \"But you never are as far away as you think you are when you lose, you never are as good as you think you are when you win by two. So we’ve just got to stay head down, improving and building the right habits and moving forward here.”\n\n\r\n              Reid scored 16 points in the first half to help the Timberwolves take a 63-50 lead. \n\n\r\n              Gilgeous-Alexander, who entered the night as the NBA's third-leading scorer with 31 points per game, had just nine in the first half before getting the Thunder back into it by scoring 23 in the third quarter. He hit a short jumper while fading sideways to his right in the closing seconds of the period to tie it at 88. Oklahoma City's Lindy Waters stole Minnesota's inbounds pass, then Aaron Wiggins hit from nearly 30 feet to close the quarter and give the Thunder the lead.\n\n\r\n              The game remained tight throughout the fourth. Reid missed the first of two free throws with 4.9 seconds left and made the second to put the Timberwolves up 112-109. Gilgeous-Alexander was fouled on the floor before launching a 3-pointer. He made the first free throw and missed the second intentionally, but the Thunder were called for a lane violation.\n\n\r\n              On the other end, Edwards missed two free throws and the Thunder secured the rebound on the second miss with 2.6 seconds remaining. But Oklahoma City was out of timeouts, and Giddey's heave from about 50 feet missed badly as time expired.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Minnesota outscored the Thunder 11-1 on free throws in the first half, but Oklahoma City outscored Minnesota 17-14 from the line in the game. ... Rivers was issued a technical foul in the fourth quarter. ... Minnesota shot 50% from the field in the first half and went 6 of 13 on 3-pointers.\n\n\r\n              Thunder: F Darius Bazley (illness) and F/C Jeremiah Robinson-Earl (right ankle sprain) sat out. ... C Mike Muscala hit a buzzer-beating 3 from the right corner at the end of the first quarter to trim Minnesota's lead to 30-28.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Chicago Bulls on Sunday.\n\n\r\n              Thunder: Host the Memphis Grizzlies on Saturday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995176.104047
}