{
  "game_id": "0022300991",
  "espn_id": "401585619",
  "date": "Mar 19, 2024",
  "matchup": "ORL vs. CHA",
  "headline": "Surging Magic clinch at least a play-in spot with 112-92 win over Hornets",
  "body": "ORLANDO, Fla. -- — Cole Anthony scored 17 of his 21 points in the second quarter and the Orlando Magic routed the Charlotte Hornets 112-92 on Tuesday night to clinch at least a play-in berth in the Eastern Conference playoffs.\n\n\r\n              Jalen Suggs survived a couple of physical confrontations in the second period to finish the game with 16 points, six assists and three steals. Paolo Banchero added 13 points and five assists for the Magic, who led 67-32 at halftime.\n\n\r\n              Orlando (41-28) is fifth in the East and can't be caught by 11th-place Brooklyn with 13 games left in the season. The Magic have secured only their second non-losing season since 2011-12. They went 42-40 in 2018-19.\n\n\r\n              “We set out to be playing our best basketball in March and April, and that’s what we’re going to continue to do,” Magic coach Jamahl Mosley said.\n\n\r\n              The Magic have won 12 of their last 15 games, but their last 10 wins have come against losing teams. Their next four opponents, all at home, have winning records.\n\n\r\n              “I think we continue to to focus on one game at a time, continue to build our habits the right way and stick to our standard, knowing we’re there but not being satisfied with that,” Mosley said.\n\n\r\n              The Hornets, who have lost 10 of 12, were led by two rookies: Brandon Miller with 21 points and Vasilije Micic with 20.\n\n\r\n              “Their defense was really good and we didn’t handle that as well as we should have,” Charlotte coach Steve Clifford said.\n\n\r\n              Suggs' defensive persistence turned the game into a rout in the second period.\n\n\r\n              “First-team All-Defense. That’s what that looked like,” Mosley said. “I think (Suggs) had a couple situations where he just stole the ball and you think it’s a foul because of how aggressive he was, and he’s doing it because he’s beating guys to spots. He’s so disruptive, and he’s capable of doing it on a consistent basis.”\n\n\r\n              Charlotte forward Davis Bertans was ejected after drawing a Flagrant-2 foul with 4:40 left in the first half. With the Hornets down 51-23, Bertans caught Suggs in the face with his elbow, an action officials determined was “unnecessary and excessive” after reviewing video.\n\n\r\n              Less than a minute later, Suggs and and Grant Williams were assessed technical fouls, after which Orlando ran off 12 straight points to lead 67-26.\n\n\r\n              “I've got no bad blood towards Grant or any of those other guys. It's all basketball, you know,\" Suggs said. “We're all competitive. We all want to win. They're not going to just let us blow them out so I expect nothing less, honestly.”\n\n\r\n              The Magic shot 65% in the first half and outscored the Hornets 40-9 in the second quarter before Micic closed out the half with a couple 3-pointers.\n\n\r\n              “They know what to do defensively, and of course we did not have the right response,” Micic said. “That's the key. You have to have the same energy or even better to compete in an away game.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit Atlanta on Saturday night.\n\n\r\n              Magic: Host New Orleans on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995683.3567948
}