{
  "game_id": "0022301125",
  "espn_id": "401585753",
  "date": "Apr 05, 2024",
  "matchup": "MIN @ PHX",
  "headline": "Suns score game's 1st 15 points, cruise past Timberwolves 97-87",
  "body": "PHOENIX -- — Grayson Allen scored 23 points, Kevin Durant had 22 and the Phoenix Suns raced to a 15-0 lead in a 97-87 victory over the Minnesota Timberwolves on Friday night.\n\n\r\n              Bradley Beal had 14 points for the Suns, who have won four straight home games. Devin Booker, coming off games with 52 and 40 points, finished with 13 points and 13 assists. His only 3-pointer of the night gave the Suns a 94-72 lead with 4:02 remaining. \n\n\r\n              Jusuf Nurkic, who was a game-time decision with a left calf injury, played 26 minutes and had 11 points, 15 rebounds and six assists.\n\n\r\n              It was only the fourth time the Suns didn't score 100 points in a game, but it was the first time in those games that they won.\n\n\r\n              “This was one of our best communication games of the season,” Allen said abou the Suns' defensive effort. “Just great all around.”\n\n\r\n              All five Suns starters scored in the 15-0 run, capped by Beal with a dunk. Minnesota finally scored when Mike Conley made two free throws with 7:35 left in the quarter.\n\n\r\n              “We had eight turnovers in the first quarter. We fought the game the whole time,” Timberwolves coach Chris Finch said. “We didn’t make the easy pass when it was there and when we did have opportunities at the rim we didn’t finish strong. A complete breakdown offensively.”\n\n\r\n              “We’ve been playing better than this offensively, and it was on us to be able to finish some of the opportunities we did create, and I got to do a better job of giving these guys some solutions too.”\n\n\r\n              The Suns led 32-20 after the first quarter, 57-41 at halftime and were never in danger after that, with Minnesota scoring the final 13 points of the game to make the final score closer. Phoenix (46-31) held on to the No. 6 position in the Western Conference. Minnesota (53-24) is tied with Denver for the best record in the West.\n\n\r\n              Anthony Edwards struggled from the field, making just 6 of 19 shots and finishing with 17 points. Durant had most of the coverage on the All-Star guard.\n\n\r\n              “He’s tough. He moves so smooth and effortlessly,\" Durant said about Edwards. \"We did a solid job of forcing tough shots, not putting him on the free-throw line, and getting out and running.”\n\n\r\n              Nickell Alexander-Walker was the only other Timberwolves player in double figures with 13 points. Naz Reid had 11 rebounds.\n\n\r\n              Neither team was especially efficient — Minnesota had 19 turnovers and Phoenix had 18. The Suns scored 24 points off the Timberwolves' mistakes.\n\n\r\n              The Suns won the teams’ previous meeting, 133-115 Nov. 15 in Phoenix — the most points the Timberwolves have allowed in a game this season. This time, Minnesota's 87 points marked the lowest total by the Timberwolves as well as the fewest permitted by the Suns this season.\n\n\r\n              “We just keep improving,” Suns coach Frank Vogel said. “We don't want to be a good defense, we want to be a great defense. Guys have responded. (Nurkic) has really grown throughout the season as a rim defender, blocking everything that's coming to the basket, trusting his teammates to go attack.”\n\n\r\n              Minnesota is still without Karl-Anthony Towns (left meniscus tear), who the Timberwolves hope will be back before the end of the regular season. He last played March 4.\n\n\r\n              Each team has five games remaining after tonight. The teams finish the season against each other April 14 in Minneapolis.\n\n\r\n              NEXT\n\n\r\n              Timberwolves: At Los Angeles Lakers on Sunday night.\n\n\r\n              Suns: Host New Orleans on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996447.048548
}