{
  "game_id": "0022400510",
  "espn_id": "401705076",
  "date": "Jan 08, 2025",
  "matchup": "CHI @ IND",
  "headline": "Pascal Siakam scores 26 points in the Pacers' 129-113 victory over the Bulls",
  "body": "INDIANAPOLIS -- — Pascal Siakam scored 26 points, Thomas Bryant added a season-high 22 and two-time All-Star Tyrese Haliburton had 16 points and 13 assists in the Indiana Pacers' 129-113 victory over the Chicago Bulls on Wednesday night.\n\n\r\n              Siakam made 11 of 17 shots from the field to help Indiana win its fourth straight, all by 10 or more points. Bryant had eight rebounds as the Pacers continued climbing the Eastern Conference standing with their 10 win in 13 games.\n\n\r\n              Zach LaVine led the Bulls with 31 points. Coby White had 19 points and five assists as Chicago lost for the first time in three games and just the second time in six.\n\n\r\n              Indiana led 36-18 early in the second quarter. Chicago never got within single digits again.\n\n\r\n              The Pacers led by 34 in the third quarter. Chicago cut the deficit to 14 several times in the fourth quarter.\n\n\r\n              Takeaways\r\n              Bulls: Chicago played its way back into the playoff mix with its recent resurgence. But trying to out-tempo the lightning quick Pacers wasn't bound to work, especially in Indianapolis. It didn't and now the Bulls trail 2-0 in the season series.\n\n\r\n              Pacers: Indiana has played its best stretch of basketball over the past month, and this time the Pacers didn't even need center Myles Turner to keep the momentum going. Turner missed the game with an illness, but the Pacers continued rolling.\n\n\r\n              Key moment\r\n              When Haliburton left late in the first quarter, it appeared as if Chicago might dig itself out of a 23-18 deficit. Instead, the Pacers poured it on, charging to a 36-18 early in the second quarter, forcing Chicago to play catch-up for the rest of the game.\n\n\r\n              Key stat\r\n              The Bulls had 14 first-half turnovers, compared to four for Indiana. They only had four in the second half, but to put it in full contest Haliburton now has 51 assists and five turnovers in Indiana's last six games.\n\n\r\n              Up next\r\n              The Bulls begin a five-game homestand Friday night against Washington. The the Pacers host Golden State on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997076.484252
}