{
  "game_id": "401810195",
  "espn_id": "401810195",
  "date": "Dec 05, 2025",
  "matchup": "ATL vs DEN",
  "headline": "Jokic scores 39 points as Nuggets use big fourth quarter to rally for 134-133 win over Hawks",
  "body": "ATLANTA -- — Nikola Jokic scored 39 points and the Denver Nuggets rallied from 23 points down with a big fourth quarter to beat the Atlanta Hawks 134-133 on Friday night.\n\n\r\n              Jamal Murray had 23 points and 12 assists, and Tim Hardaway Jr. scored 17 points for the Nuggets, who have won nine straight road games.\n\n\r\n              The Hawks had a chance for a tying 3-pointer on their final possession, but Murray blocked the attempt by Nickeil Alexander-Walker. The loose ball led to a layup by Alexander-Walker with 2 seconds left, and the Nuggets quickly inbounded the ball and ran out the clock.\n\n\r\n              Jalen Johnson had 21 points, 18 rebounds and a career-high 16 assists for the Hawks, who have lost three straight. Johnson, who missed Wednesday’s game with a strained calf, became the first Hawks player in the play-by-play era to record a triple-double by halftime. He had 11 points, 10 rebounds and 12 assists at the break.\n\n\r\n              Alexander-Walker finished with 30 points and Kristaps Porzingas had 25.\n\n\r\n              Jokic shot 2 for 13 in the first half, but ended 13 for 26 and had nine rebounds and eight assists.\n\n\r\n              The Nuggets trailed 103-94 at the end of the third quarter, but opened the fourth with a 23-3 blitz, all with Jokic on the bench. Cam Johnson had three 3-pointers during the run and the Nuggets hit their first seven 3-pointers of the fourth.\n\n\r\n              The Hawks took a big lead in the first quarter. Atlanta hit 13 of its first 15 shots and had 13 assists by quarter's end, a season-high for a single quarter. The Hawks led 41-23 at the quarter and their lead topped out at 63-40 in the second quarter.\n\n\r\n              Up next\r\n              Nuggets play at Charlotte on Sunday for the third of a four-game trip. Hawks visit Washington on Saturday in their fifth back-to-back this season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042756.174273
}