{
  "game_id": "0021800540",
  "espn_id": "401071216",
  "date": "Dec 30, 2018",
  "matchup": "PHI @ POR",
  "headline": "McCollum leads Trail Blazers in 129-95 rout of 76ers",
  "body": "PORTLAND, Ore. --  The Portland Trail Blazers weren't concerned about guard C.J. McCollum's recent shooting slump.\n\nMcCollum broke out of a six-game funk on Sunday night, hitting 13 of 18 shots in a 35-point performance as the Trail Blazers defeated the Philadelphia 76ers 129-95.\n\nIn his six previous games, McCollum was 35 percent from the floor, while shooting 16 percent from 3-point range.\n\n\"I don't think there's any question that he was going to break out at some point,\" Portland coach Terry Stotts said. \"Good for him. Good for us.\"\n\nMcCollum's white-hot night was felt throughout the team, as the Blazers shot a season-high 59 percent in routing Philadelphia. Al-Farouq Aminu had 16 points, Damian Lillard 15 and Jusuf Nurkic 14 for Portland.\n\nBen Simmons scored 19 points to lead the 76ers, who were without center Joel Embiid due to soreness in his left knee. Embiid leads Philadelphia in scoring (26.5 points) and rebounds (13.3).\n\nMcCollum gave signs of a turnaround during a five-minute stint of the first quarter, hitting his first three shots. McCollum then played the entire second quarter and continued to sizzle, making 7 of 11 shots.\n\nFrom McCollum's viewpoint, nothing changed Sunday from the previous six games -- other than the ball going through the basket on a regular basis.\n\n\"I've been getting some of the same looks I've been getting my entire life, and I wasn't making them. But I understand how I approach the game, how much time I put in. . I figured the tide would turn eventually,\" McCollum said.\n\n\"I felt good the last few games. I just tried to get into a rhythm. I made some shots and that made it a little easier for everyone else.\"\n\nMcCollum's shooting rebound was part of the puzzle for Portland. Without Embiid inside, the Blazers handled Philadelphia on the boards 59-36.\n\nSeveral 76ers said the energy wasn't there defensively. Philadelphia coach Brett Brown said the loss of Embiid was a blow.\n\n\"I've said it before, and I'll say it again: I think he's a defensive player of the year,\" Brown said. \"Whether you look at points in the paint, whether you look at the rebounding margin. . The guys that we had, we just struggled defending them.\"\n\nEarly on, it appeared as though Philadelphia might get by without Embiid. The 76ers hit their first four shots and led 13-7. Nothing went right the rest of the first half for Philadelphia, however, as Portland quickly erased the deficit and ran away from the 76ers.\n\nThe Blazers had runs of 12-1 and 8-0 to take a 31-20 lead after the first quarter. It was a warmup act for Portland's 39-point second quarter, where the Blazers started by scoring the first 12 points. McCollum scored 19 of his 26 first-half points during the second quarter, as the Blazers built a 70-41 halftime lead.\n\nAfter making its first four field goal tries, Philadelphia hit just 4 of its next 27 shots. It was no match for Blazers, who shot 67 percent (29 of 43) during the first half.\n\nPortland's defense that caught Stotts' eye as much as the sharp shooting.\n\n\"We didn't let the fact that we were playing good offense take away from our defense. I thought the effort was consistent throughout,\" Stotts said.\n\nNURKIC BREAKING OUT\n\nNurkic, Portland's center, is on a dominant run in the post of late. During his past three games, including two against Golden State, Nurkic has made 25 of 43 shots and is averaging 20.7 points and 9.7 rebounds.\n\n\"It's very encouraging,\" Stotts said. \"It's part of his growth. But he's got to continue it.\"\n\nTIP-INS\n\n76ers: Coach Brett Brown said Embiid was held out of Sunday's game as a precaution. \"It's not anything we're concerned about,\" Brown said. ... Replacing Embiid was Amir Johnson, who made his second start of the season.\n\nTrail Blazers: Forward Maurice Harkless (knee) didn't play. Evan Turner replaced Harkless in the starting lineup. ... The 34-point margin is Portland's most lopsided win of the season.\n\nUP NEXT\n\n76ers: At Los Angeles Clippers on Tuesday night.\n\nTrail Blazers: At Sacramento on Tuesday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994039.1173382
}