{
  "game_id": "0021800164",
  "espn_id": "401070845",
  "date": "Nov 08, 2018",
  "matchup": "PHX vs. BOS",
  "headline": "Irving, Celtics rally from 22 down to top Suns 116-109 in OT",
  "body": "PHOENIX --  When their shots finally started to fall, the Boston Celtics couldn't be stopped.\n\nKyrie Irving scored 18 of his season-high 39 points in the fourth quarter and overtime, and Boston rallied from a 22-point deficit for a 116-109 win over the Phoenix Suns on Thursday night.\n\nIrving scored Boston's first six points in the extra period, and Marcus Morris finished with 17 against his former team -- including the tying 3-pointer with 1.1 seconds left in regulation off a feed from Irving.\n\nMorris hit from the top of the arc to tie it at 100. Jaylen Brown added 17 points, all after halftime, for the Celtics (7-4).\n\n\"Guys like Kyrie, he is going to have all the focus on him,\" Morris said. \"I worked on my 3-pointers extensively.\"\n\nDevin Booker paced the Suns (2-9) with a season-high 38 points, and T.J. Warren had 29.\n\nThe Celtics ended a two-game skid, while the Suns have lost nine of 10.\n\nBooker scored 12 points in the fourth quarter and seven in OT, but Phoenix couldn't hold onto a 16-point lead with 6:13 to play in regulation.\n\nThe Suns led 92-76 when Booker dropped in a short fadeaway.\n\n\"We just fell apart down the stretch. Kept giving up quick buckets. Miscommunications on defense. A little bit of everything,\" Booker said.\n\nBoston recovered from an ice cold start and won despite shooting 40.2 percent from the field. The Celtics trailed by double digits for much of the second half until a furious late rally.\n\nSuns rookie Deandre Ayton had 14 points and 10 rebounds.\n\nIrving hit a 3 with 35.1 seconds to go in the fourth, then his steal led to Brown's layup that cut the Suns' lead to 98-97 with 7.3 seconds to play. Warren hit two free throws, then Morris took a pass from a double-teamed Irving for the tying 3.\n\n\"We just learned a lot about being resilient,\" Irving said. \"We had to make adjustments.\"\n\nSuns coach Igor Kokoskov thought fatigue caught up to his team late in the game. He also wanted a foul against Irving on the Celtics' last possession of the fourth quarter.\n\n\"You take the blame and responsibility as a coach,\" Kokoskov said.\n\nWarren, starting for the first time since Oct. 31, scored 14 first-quarter points as the Suns took advantage of Boston's shooting woes. Phoenix led 32-13 after 12 minutes.\n\nAfter making their first shot of the game, a 3 by Irving, the Celtics missed their next 12 attempts and the Suns raced out to a 15-3 lead.\n\nAron Baynes' putback with 5:04 left in the first quarter was the Celtics' second basket of the game, and they shot just 4 of 22 in the quarter.\n\nBoston got the lead down to 14 in the second, but a 3 from Booker gave the Suns a 48-26 advantage with 4:31 left in the half.\n\nThe Celtics trailed 55-35 at the break.\n\nConsecutive baskets by Booker put the Suns in front 75-58 in the third quarter.\n\n\"I told Igor we didn't deserve to win the game, but it was a great individual performance by Kyrie, certainly,\" Celtics coach Brad Stevens said.\n\nTIP-INS\n\nCeltics: The team's 13 points in the first quarter were a season low. ... Irving was the only starter to make a field goal in the first half. Jayson Tatum, Al Horford, Gordon Hayward and Brown were a combined 0 for 15. ... G Marcus Smart surpassed 1,000 rebounds and 400 steals for his career.\n\nSuns: Warren made his third start this season. Ryan Anderson came off the bench. ... Booker has 146 points in his last three games against the Celtics, including the career-high 70 he scored in Boston on March 24, 2017. ... A game after playing a season-low seven minutes, 2017 first-round draft pick Josh Jackson played only five.\n\nANALYZING AYTON\n\nStevens called Ayton a \"special talent\" when asked about the rookie before the game. \"He brings everything to the table you would think a really good player at that position brings,\" Stevens said.\n\nJAYLEN JAM\n\nBrown's first basket was a high-flying, one-handed dunk in transition at the 10:10 mark of the third quarter. Smart provided the assist.\n\nUP NEXT\n\nCeltics: At the Utah Jazz on Friday in their second set of back-to-back games this season.\n\nSuns: At the New Orleans Pelicans on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995103.224183
}