{
  "game_id": "0021600344",
  "espn_id": "400899786",
  "date": "Dec 09, 2016",
  "matchup": "LAL vs. PHX",
  "headline": "Eric Bledsoe scores 30, Suns hold off Lakers 119-115",
  "body": "LOS ANGELES --  Not even Lou Williams' latest party-crashing performance could ruin Eric Bledsoe's birthday festivities with the Phoenix Suns.\n\nBledsoe had 30 points and nine assists on his 27th birthday, Leandro Barbosa added 21 points and the Suns snapped their three-game losing streak with a 119-115 victory over the slumping Los Angeles Lakers on Friday night.\n\nDevin Booker had 15 points before fouling out for the Suns, who hit a season-high 13 3-pointers and withstood a late rally by the short-handed Lakers. Phoenix blew nearly all of its 18-point lead in the second half, but hung on for just its seventh victory of the season after losing five of its previous six.\n\n\"My team needed it,\" Bledsoe said after hitting three 3-pointers and getting three steals. \"We had lost a couple of bad ones in a row, but this was one of the best wins we've had all season.\"\n\nWilliams hit six 3-pointers and scored 35 points in his fourth consecutive big game, but the Lakers have lost five straight after a promising start to their season. Nobody else in purple and gold managed more than 14 points.\n\nLakers rookie Brandon Ingram hit a 3-pointer with 17 seconds left to trim Phoenix's lead to 115-113, but Bledsoe and Brandon Knight each hit two free throws in the closing moments.\n\n\"I'm just playing and trying to lead by example, playing as hard as I can,\" Williams said. \"Usually when you score a ton of points, you're going to get some wins out of it, and we haven't had that. ... Losing is losing. For me, it's trying to do everything I can to try to help us win games, and it's still not enough.\"\n\nLos Angeles has faltered during a busy portion of its December schedule while playing without four injured regulars: D'Angelo Russell, Nick Young, Tarik Black and Jose Calderon.\n\n\"The shots we missed the previous game, we had the same shots this game,\" Phoenix coach Earl Watson said. \"The guys just made them. It's a positive reinforcement.\"\n\nAlex Len had 14 points and 13 rebounds for the Suns.\n\nSWEET LOU\n\nWilliams has three 30-point performances while scoring 137 points over the Lakers' last four games. That's the biggest four-game scoring performance by a reserve since the NBA began keeping track of starts in 1970, according to the Elias Sports Bureau. Williams is only coming off the bench to provide a boost to the Lakers' thin lineup, but his impact has been remarkable. \"He's dynamic,\" Watson said. \"He's one of the best scorers in the league. You're not ever going to stop him. You just want him to be not as efficient.\"\n\nANGRY DEVIN\n\nBooker dropped a career-high 39 points on the Lakers at Staples Center last month. He fouled out of the rematch on an offensive screen with 3:49 to play, receiving a technical foul as well on his way to the bench.\n\nTIP-INS\n\nSuns: Bledsoe had made 29 straight free throws before missing one with 5:29 to play. ... T.J. Warren hasn't played since Nov. 18 due to a minor head injury, but is expected to return to practice Saturday.\n\nLakers: They played their 13th game in 22 days as part of a rugged stretch. They haven't had back-to-back days off since mid-November, and won't have consecutive days off again until next weekend. ... Russell missed his 11th straight game with a sore left knee, but has returned to non-contact practice. Russell is eager to get back in uniform and seems likely to be cleared soon.\n\nUP NEXT\n\nSuns: Host the Pelicans on Sunday.\n\nLakers: Host the Knicks on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995429.0316212
}