{
  "game_id": "0021800066",
  "espn_id": "401070747",
  "date": "Oct 25, 2018",
  "matchup": "LAL vs. DEN",
  "headline": "LeBron's triple-double leads Lakers past Nuggets 121-114",
  "body": "LOS ANGELES --  When Kobe Bryant took a courtside seat in the first quarter, Staples Center buzzed with excitement for the mere sight of the most popular athlete in this building's history.\n\nThe crowd even started a \"Kobe! Kobe!\" chant in the fourth quarter -- and it was immediately drowned out by cheers when LeBron James hit a 3-pointer.\n\nWith the symbol of the Los Angeles Lakers' past watching in approval, James and the Lakers' young core proved that their present and future is pretty tantalizing, too.\n\nJames had 28 points, 11 assists and 11 rebounds while leading a late rally for his first home victory with the Lakers, 128-111 over the previously unbeaten Denver Nuggets on Thursday night.\n\nLeBron and Kobe didn't get a chance to talk, but the longtime friendly rivals likely both left happy with the Lakers' new direction after James' first triple-double for LA.\n\n\"Of course I noticed him sitting right on the baseline over there,\" James said. \"One of the all-time Laker greats. What he's done for this franchise in his 20-plus years here speaks wonders for me. To be able to compete against him all those years, and for me to be able to share a jersey, the same jersey as him at this point, is pretty special.\"\n\nWith Bryant in attendance for the first time since LeBron's arrival in LA, Kyle Kuzma scored 22 points and JaVale McGee added 21 to complement James' 74th career triple-double.\n\nBut the result was even more impressive: The Lakers trailed by eight points with six minutes left in the fourth quarter before Lance Stephenson, who finished with 12 points, started a 15-2 rally with back-to-back 3-pointers.\n\n\"The first couple of games, when we fell behind, we stayed behind,\" James said. \"Tonight when we fell behind, we learned from our mistakes, and that's one of the most important things in life.\"\n\nJames got Staples Center rocking on a go-ahead dunk with 3:31 to play before Lonzo Ball made an artful step-back 3-pointer. Kuzma added two huge dunks down the stretch of Los Angeles' second win in two days after an 0-3 start.\n\n\"LeBron is doing what he always does,\" Denver coach Michael Malone said. \"And LeBron is bringing all those guys their confidence way up. You're seeing Kyle Kuzma and LeBron, their chemistry growing.\"\n\nNikola Jokic scored 24 points for the Nuggets, who were off to their best start since the 2009-10 season. Jamal Murray scored 22 points and Monte Morris had 20, but Denver couldn't answer the Lakers' rally led by James, who posted his third career triple-double in Staples Center for his third different team.\n\n\"We just came out on the short end today, but we've got a couple of days off to revamp ourselves,\" said Morris, who added seven assists in just his eighth NBA game.\n\nOne night after earning their first win of the LeBron era in Phoenix, the Lakers beat the Nuggets at Staples for the fourth straight time.\n\nTIP-INS\n\nNuggets: Isaiah Thomas attended the game, but didn't play while recovering from offseason hip surgery. The compact guard finished last season with the Lakers, averaging 15.6 points in 17 games after getting traded by James' Cavaliers. ... Will Barton missed his third straight game with a hip injury.\n\nLakers: Rookie Svi Mykhailiuk had four points. The Ukrainian guard scored his first NBA points one night earlier in Phoenix. ... Fans near courtside besides Bryant included actor Michael B. Jordan, Dodgers slugger Yasiel Puig and NFL rushing leader Todd Gurley.\n\nMISSING GUYS\n\nThe Lakers played their third straight game without suspended starters Brandon Ingram and Rajon Rondo. Ingram will miss one more game for his role in the Lakers' brawl with the Houston Rockets last weekend, while Rondo can return Saturday in San Antonio.\n\nKOBE'S HOUSE\n\nBryant sat with Lakers GM Rob Pelinka, his former agent, in a rare visit since the 20-year Lakers veteran retired in 2016. Bryant spoke to a group of season ticket holders before the game about his forthcoming book.\n\n\"That's one of my favorite players,\" a visibly excited Stephenson said afterward. \"He was like, `Good game,' after the game, so I was a little hyped.\"\n\nLANCE BOILS\n\nStephenson provided an enormous boost for the Lakers on both ends of the court, in his usual inimitable style. The veteran said he came off the bench with a specific plan in mind: \"Aggressive defense, and attack the big man (Jokic). We felt like their big man couldn't match our intensity, so when I got in there, I was like, `Man, I'm going to attack the big man.\"\n\nUP NEXT\n\nNuggets: Host New Orleans on Monday.\n\nLakers: At San Antonio on Saturday.\n\n---\n\nMore AP NBA: www.apnews.com/tag/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995040.801378
}