{
  "game_id": "0022300814",
  "espn_id": "401585442",
  "date": "Feb 24, 2024",
  "matchup": "ORL @ DET",
  "headline": "Paolo Banchero has 3-point play in final second to lift Magic past Pistons, 112-109",
  "body": "DETROIT -- — Paolo Banchero broke a tie on a three-point play with 0.8 seconds left and finished with 15 points in the Orlando Magic's 112-109 victory over the NBA-worst Detroit Pistons on Saturday night.\n\n\r\n              “We wanted to get the last shot,” Banchero said. “When I got the ball, I was looking at the clock and wanted to get it down to the last possible second.”\n\n\r\n              Orlando's star made an 18-foot baseline jumper and a free throw after missing two free throws with 17.9 seconds left, allowing Detroit to stay within two points.\n\n\r\n              “That’s what great players do,” Magic guard Jalen Suggs said. “He's an All-star for a reason.”\n\n\r\n              Cade Cunningham had a tying layup with 12.4 seconds to go and, with a chance to send the game to overtime, he hit the rim on 70-plus-foot shot at the buzzer.\n\n\r\n              “I was proud of the way we hung in there,” Pistons coach Monty Williams said. “Our defense in the second half is a benchmark of how we want to play, (giving up) 47 points to a team that was having their way in the first half, that says a lot about what we can do.”\n\n\r\n              Orlando, vying with Miami to win the Southeast Division, has won three straight and eight of its last 10.\n\n\r\n              “These are the types of games you have to win down the stretch,” Magic coach Jamahl Mosley said.\n\n\r\n              The Magic's starters all scored in double digits, including Suggs and Franz Wagner, who scored 14 points each, and had plenty of support from the bench with three reserves scoring at least 12 points.\n\n\r\n              “That’s our superpower,” Suggs said. “When we can have the second group come in and dominate their bench, that’s a huge plus for us.”\n\n\r\n              Cunningham had 26 points for the Pistons. They have lost five straight and have matching 4-24 records at home and on the road.\n\n\r\n               “They are not their record,\" Mosley said. “They’re a team that plays hard. They’ve been in the majority of their games.”\n\n\r\n              The Pistons had a game at Little Caesars Arena for the first time since a loss to Orlando on Feb. 4, four days the NBA trade deadline that reshaped the team with the league's worst record and put some players in a home uniform with the franchise for the first time.\n\n\r\n              Simone Fontecchio, acquired from Utah, scored 17 points and Evan Fournier, acquired from the New York Knicks, had 13 points.\n\n\r\n              “Our new guys are starting to figure out the way we want to play,” Williams said.\n\n\r\n              Detroit was without center Isaiah Stewart for the second of three games as he serves a suspension for punching and pushing Phoenix Suns center Drew Eubanks hours before a game in Arizona.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Atlanta on Sunday night.\n\n\r\n              Pistons: At New York on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995694.083839
}