{
  "game_id": "0021501159",
  "espn_id": "400829046",
  "date": "Apr 05, 2016",
  "matchup": "MIL vs. CLE",
  "headline": "J.R. Smith scores 21, hot-shooting Cavs beat Bucks 109-80",
  "body": "MILWAUKEE -- The Cleveland Cavaliers worked the ball around the perimeter with speed and precision until they found the open man.\nMore often than not in the first half, that player was J.R. Smith, the kind of shooter who doesn't often miss when given time and room.\nSmith scored 21 points and went 7 of 11 from 3-point range, and Cleveland tied a season high with 18 3s in a 109-80 victory on Tuesday over the Milwaukee Bucks.\n\"It was one of our most complete games of the season as far as offense and defense and having both of those for the whole game,\" Cavs coach Tyronn Lue.\n\nKevin Love added 17 points and shot 3 of 6 from behind the arc for the Cavaliers, who maintained a 3 1/2-game lead over Toronto for the best record in the Eastern Conference.\nLeBron James finished with 17 points and shot 7 of 9 from the field to go with nine assists. He watched the entire fourth quarter from the bench on an easy night for Cleveland, which led by 24 by halftime.\n\"It's my type of basketball. I love if the ball is moving. I could care less how many shots I get,\" James said.\nGiannis Antetokounmpo led the Bucks with 22 points and 14 rebounds.\nHe couldn't keep up with Cleveland. The 18 3s allowed were a season-worst for Milwaukee.\n\"They're the best team in the East and they played at a very high level early. Good teams, when they see a team come out a little slow, they want to end that early and they did,\" coach Jason Kidd said.\nMilwaukee did at least have franchise cornerstones Antetokounmpo and Jabari Parker making their typical share of highlight-reel dunks. Parker finished with 19 points on 7-of-19 shooting.\nCATCHING UP\nThe efficient Cavaliers shot 66 percent in the first half and 55 percent for the night. They had 30 assists on 41 buckets.\nSmith was the biggest beneficiary of the ball movement after going 7 of 9 from 3 in the first half. It looked at times as if the Cavs were in cruise control with their big lead.\nIt was just the way that Cleveland hoped to start a three-game road swing, their final trip of the regular season.\nBUCKS SHOTS\nAntetokounmpo, a 6-foot-11 forward who became the primary ball-handler after the All-Star break, added eight assists, falling short of his sixth career triple-double. Making a rare start with leading scorer Khris Middleton sidelined by a strained left thigh, forward Johnny O'Bryant added 12 points on 6-of-10 shooting.\nThe Bucks outscored the Cavaliers 54-28 on points in the paint.\nBut 3-point shooting, once again, was a big problem for Milwaukee on both ends of the court.\nThat's a weakness especially against Cleveland, which was tied for second in the league with Portland with 817 3s coming into Tuesday. Only Golden State had more.\nO'Bryant pointed to a lack of communication as one of the main culprits for the problematic perimeter defense.\n\"We didn't do a good job of making guys uncomfortable from the 3-point line or running them off,\" O'Bryant said.\nNot having the 6-8-Middleton, who has the versatility to defend forwards and guards, also hurt.\nTIP-INS\nCavaliers: With his third 3 of the night with 6:33 left in the first quarter, Smith set the franchise mark for single-season 3-pointers with 193. Wesley Person had the previous mark with 192 in 1997-98. According to Lue, James told Smith that he was going to get him the record in the first quarter. \"Everybody's happy for him and he shot the ball great tonight,\" Lue said. ... Kyrie Irving returned after missing a game with a sprained ankle and finished with 15 points in 27 minutes.\nBucks: The normally durable Middleton said he planned to play again this season after missing his second straight game. Milwaukee had four games remaining after Tuesday. ... G Jerryd Bayless (right knee) missed a third straight game.\nUP NEXT\nCavaliers: At Indiana Pacers on Wednesday.\nBucks: At Boston Celtics on Friday.\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764993998.756777
}