{
  "game_id": "0021600012",
  "espn_id": "400899412",
  "date": "Oct 26, 2016",
  "matchup": "PHX vs. SAC",
  "headline": "Cousins, Gay lead Kings past young Suns 113-94",
  "body": "PHOENIX --  Dave Joerger is off to a winning start with the Sacramento Kings.\n\nThe Kings gave the former Memphis coach a 113-94 season-opening victory over the Phoenix Suns on Wednesday night, led by 24 points from DeMarcus Cousins and 22 from Rudy Gay.\n\nThe Kings won an opener for the first time in three years and gave Joerger a victory in his Sacramento debut.\n\nThe Kings used an 18-1 run from its second unit to take control in the first half and was up by as many as 26 points in the third quarter.\n\n\"First we kind of came out a little rusty,.\" Cousins said. \"The second group came in with incredible energy and really opened the game up and really got energy going. Basically, there was no looking back from there.\"\n\nJoerger brings a defensive mindset to the Kings.\n\n\"They got after it on defense,\" Joerger said of his second unit in the big run. \"The key for our defense is to set it. We executed offensively and didn't turn it over. When we did that, we were able to set our defense. `'\n\nGay said the Kings are buying in.\n\n\"We're helping each other,\" Gay said. \"That was one of the things at camp we worked on. We have to help each other and play as a team.\"\n\nDevin Booker, plagued by foul trouble, scored 18 points for the Suns. Eric Bledsoe added 16 and T.J. Warren had 14. Dragan Bender, the 18-year-old fourth overall pick in this year's draft, scored 10 points for Phoenix, all in the second half.\n\n\"We've got some adjustments to do,\" said Bledsoe, in his first game since injuring his knee last December. \"They went on a run, we could never bounce back from it. It's the first game.\"\n\nA lineup featuring all three Phoenix draft picks -- first-rounders Bender and Marquese Chriss and second-rounder Tyler Ulis -- got the Suns back within 10. Bender hit his second 3-pointer of the quarter and Chriss scored inside to slice it to 86-76 with 9:07 to play.\n\n\"It was fun to watch,\" Suns coach Earl Watson said. \"Dragan came in and gave us great minutes. Marquese is Marquese. I think the biggest surprise out of the second unit was Tyler. His defense on the ball was aggressive and we need that energy.\"\n\nBut Gay scored seven points and Matt Barnes had five in a 12-1 outburst to put the Kings back firmly in control 98-77.\n\nSacramento's reserves dominated their Phoenix counterparts to give the Kings their big first-half lead.\n\nBen McLemore scored six points and Garrett Temple and Willie Cauley Stein added four apiece in a 16-1 run to end the first quarter, with the Kings leading 30-19. Anthony Tolliver made a 6-foot floater to open the second quarter to make it an 18-1 run and a 32-19 lead.\n\nTemple's 17-footer with 2.8 seconds left in the half gave Sacramento its biggest lead of the game thus far, 57-39.\n\nKIDS CORPS\n\nWhen Bender entered the game in the third quarter, Phoenix became the first team to have three teenagers appear in a game. Chriss is 19 and Booker barely made it. He turns 20 on Sunday.\n\nMcCOY HONORED\n\nSuns owner Robert Sarver took the microphone and told Suns longtime broadcaster Al McCoy that he would be added to the Ring of Honor on March 3. The 83-year-old McCoy has been the Suns radio announcer for 40 seasons.\n\nTIP-INS\n\nKings: Cousins scored 10 straight Sacramento points in the third quarter. ... Sacramento last won a season opener in 2013, beating the Denver Nuggets.\n\nSuns: The Suns won 23 games last season, second-worst record in the team's 48-year history. ... Phoenix has missed the playoffs the last six seasons. ... Chriss drew a flagrant foul with 5:37 left in the third quarter. ... Booker got in early foul trouble and had a brief shoving match with Cousins in the second quarter.\n\nUP NEXT\n\nKings: Play their home opener Thursday night against the San Antonio Spurs.\n\nSuns: Travel to Oklahoma City for the Thunder's home opener on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764996018.182663
}