{
  "game_id": "0022300862",
  "espn_id": "401585490",
  "date": "Mar 01, 2024",
  "matchup": "MIN vs. SAC",
  "headline": "Malik Monk scores 39 to lead Kings past Timberwolves in overtime",
  "body": "MINNEAPOLIS -- — Malik Monk scored 35 of his 39 points after halftime and the Sacramento Kings defeated the Minnesota Timberwolves 124-120 in overtime on Friday night.\n\n\r\n              Anthony Edwards, Minnesota's leading scorer, had 11 points in the first half but did not play after halftime due to personal reasons, according to team officials.\n\n\r\n              Minnesota led 120-117 midway through the overtime period before Monk hit back-to-back 3-pointers. The Wolves had a chance to tie it with 17.5 seconds to play, but Naz Reid missed a corner 3 and Trey Lyles hit a free throw to clinch the victory.\n\n\r\n              Sacramento's Domantas Sabonis had 21 points, 15 rebounds and eight assists before fouling out in overtime.\n\n\r\n              Keegan Murray scored 17 points, Davion Mitchell had 16 and Harrison Barnes had 14 for the Kings, who were missing leading scorer De’Aaron Fox, who missed his second straight game with a left knee contusion. \n\n\r\n              Monk made 16 of 29 shots, including 5 of 8 3-pointers, to make up for the absence of Fox's 26.9 points per game.\n\n\r\n              “The great teams always have two or three guys like that where, sometimes you don’t have to call a play, you just say, ‘Here’s the ball — go make a play, for yourself or for your teammates,’\" Kings coach Mike Brown said. “And Malik did that. Especially with Fox out, down the stretch we needed somebody to stand up for us and Malik was the guy that did.”\n\n\r\n              Jaden McDaniels led the Timberwolves with 26 points. Karl-Anthony Towns scored 19 points, Reid had 18 points and Rudy Gobert had 16 points and 16 rebounds.\n\n\r\n              Playing against a much bigger team, the Kings turned the game with 14 offensive rebounds, which led to 20 second-chance points. \n\n\r\n              “A lot of times we did a great job defensively and then they get those rebounds, they get a kick-out 3, and that hurts,” Gobert said. “Instead of (us) getting a stop, they get a wide-open shot.”\n\n\r\n              Monk scored 11 of Sacramento's last 13 points of the third quarter, to stretch a one-point lead into a 91–82 advantage.\n\n\r\n              “I had to get it going at some point,” Monk said of his second-half surge. “I was getting to the rim and my midrange and floater opened things up for me.”\n\n\r\n              The Wolves opened the fourth on a 14-4 run for a 96-95 lead on McDaniels' 3-pointer. But Monk responded with a driving layup and a breakaway dunk to put the Kings back on top.\n\n\r\n              Gobert hit one of two free throws with 40.1 seconds to play to tie the score at 115-115 and send it into overtime.\n\n\r\n              For the second straight game, the Wolves dug themselves a hole early. Two nights after falling behind Memphis 14-0, Minnesota started 1 for 4 with three turnovers on its first seven possessions. Meanwhile, the Kings hit four of their first six 3-point attempts and raced to an 18-4 lead.\n\n\r\n              “Tonight, I think our slow start and the offensive rebounding were the things that sunk us,” Minnesota coach Chris Finch said. \n\n\r\n              The Wolves' offense also stagnated at the worst possible time. After taking their three-point lead in overtime, they came up empty on six consecutive possessions.\n\n\r\n              “We were trying to put bodies on bodies all night,\" Brown said. “We have to have a level of physicality in order to win games, because we're not going to be able to score 125 points every game.” \n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Bulls on Monday night.\n\n\r\n              Timberwolves: Host Clippers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996463.633981
}