{
  "game_id": "0021500263",
  "espn_id": "400828150",
  "date": "Dec 01, 2015",
  "matchup": "LAL @ PHI",
  "headline": "76ers stop record skid with win over Lakers in Kobe's final game in hometown",
  "body": "PHILADELPHIA -- Kobe Bryant breezed through the Philadelphia 76ers' locker room and said to no one in particular, \"Keep it going, guys.\"\nHis homecoming game spoiled, Bryant said one final goodbye to Philly, which is winless no more.\nThe 76ers said good riddance to the longest losing streak in major U.S. professional sports. The team was winless in 28 games dating to last season and 0-for-18 to begin this one.\nWith the spotlight on Bryant during the final game of his career in his hometown, the Sixers stole the show and defeated the Los Angeles Lakers 103-91 on Tuesday for their first victory of the season.\n\nThe Sixers remain tied with the 2009-10 New Jersey Nets, who also opened 0-18, for the worst start in NBA history.\nIt was the first win for the Sixers since March 25 at Denver.\n\"Finally,\" forward Nerlens Noel said.\nCoach Brett Brown's team has long languished at the bottom of the NBA standings and has reeled off two losing streaks of at least 26 games in his three seasons. For one night, in front of a sellout crowd of 20,510 that came to cheer Bryant, the streaks hardly mattered.\n\"I'm pleased for the city,\" Brown said. \"We don't want this streak continuing.\"\nHours earlier, Bryant felt the love in Philadelphia as soon as he entered the arena.\nHe took selfies with fans who might never see him play again, and his presence injected a playoff atmosphere into a city that has lost much of its passion for NBA basketball.\nWith a packed crowd standing and roaring in appreciation, Bryant was lauded like a hometown hero, not the \"Hometown Zero\" he once was labeled in Philadelphia tabloids.\nBryant, who will end his 20-year career this season, opened the first leg of his farewell tour in his hometown and was feted with the kind of reverence and gratitude normally reserved for a Sixers great.\n\"I wasn't expecting that type of reaction -- ovation,\" he said. \"Deeply appreciative beyond belief. It was really, really special.\"\nPlaying with the shot selection of a pickup artist, Bryant tried to deliver a special performance in his finale. He buried a step-back 3-pointer off the opening tip. He hit another 3 on the next possession.\nBryant made it 3-for-3 and had the Philly crowd chanting \"M-V-P!\" as he turned back the clock to his championship form.\n\"It was a little spurt of old-school Kobe,\" Noel said.\nBryant said he could tell the start made the Sixers a little starstruck -- most were babies when he started his career.\n\"I could sense they were like, 'I really don't want to touch him.' ... 'Is this going to be an 81 type of situation?'\" Bryant said. \"I'm just playing possum because I know my legs ain't going to carry this energy for 48 minutes.\"\nBryant scored 20 points on 7-of-26 shooting and made four 3s.\nBy the fourth quarter, the Philly fans had turned their attention to the home team and were chanting, \"Beat L.A.!\" when beleaguered rookie Jahlil Okafor made a layup for a 94-80 lead.\nOkafor, the No. 3 overall pick out of Duke, has been attached to a string of off-the-court incidents that included reckless driving and a fight in Boston. Brown said Okafor, who has apologized for his recent decisions, likely will be accompanied by team security on public outings. Bryant said he would simply tell the 19-year-old to stay focused on basketball.\nThe Sixers stayed focused and finally finished the job after taking an 80-75 lead into the fourth.\nThe 76ers had led after three quarters three other times this season: Nov. 21 at Miami (led 74-67, lost 96-91), Nov. 25 at Boston (led 62-57, lost 84-80) and Nov. 29 at Memphis (led 67-64, lost 92-84), according to STATS.\nRobert Covington scored 23 points, and Jerami Grant and Noel had 14 for the Sixers.\nThe win belonged to Philadelphia. The night belonged to Bryant.\nBRYANT'S HOMECOMING\nBryant's homecoming game came with a rare emotional tug for the player fans loved to boo through the years. He waved to the crowd and bowed his head in appreciation as a \"Kobe! Kobe! Kobe!' chant filled Wells Fargo Center.\nHe was greeted at midcourt by his Lower Merion high school coach, Gregg Downer, and 76ers great Julius Erving. Bryant hugged both in front of a crowd filled with purple-and-gold No. 24 jerseys.\nHe smiled after every shot and bantered with fans, some of whom made \"Thank you, Kobe\" signs.\nIn a reference to the sorry state of the Philly sports scene, one fan held a sign that read, \"Why Can't Chip Kelly Retire Instead.\"\nBryant smirked in the third quarter when a brief scuffle broke out among Lakers center Roy Hibbert, who appeared to push a referee, and Philadelphia's Isaiah Canaan and JaKarr Sampson. All three were hit with technical fouls.\nBryant thumped his chest, waved to the fans, blew a kiss and was serenaded with \"Kobe!\" chants as he walked off Philadelphia's court for the final time.\n\"You can't script this stuff -- I can't,\" he said. \"The amount of respect and appreciation and adoration I have for the city, and to be able to have this moment here, just means everything to me.\"\nTIP-INS\nLakers: Los Angeles is 2-15 and has the worst record in the Western Conference. ... The Lakers opened an eight-game road trip Tuesday.\nSixers: Moses Malone, the late 76ers star named one of the NBA's 50 greatest players, was honored at halftime. Malone, who died in September at age 60, was the NBA Finals MVP in 1983, when he led the Sixers to the title. His No. 2 was on the back of Philadelphia's warm-up jerseys, with \"Chairman of the Boards\" on the front. The Sixers will retire his number next season.\nTEAM EFFORT\nGrant had four blocked shots. Noel had nine rebounds. T.J. McConnell had six assists.\nUP NEXT\nLakers: At the Washington Wizards on Wednesday.\nSixers: At the New York Knicks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994306.866986
}