{
  "game_id": "0022400454",
  "espn_id": "401705020",
  "date": "Dec 31, 2024",
  "matchup": "LAL vs. CLE",
  "headline": "Cavaliers beat Lakers 122-110 for 8th straight win and spoil LeBron's first game since turning 40",
  "body": "LOS ANGELES -- — Jarrett Allen scored a season-high 27 points, Donovan Mitchell added 26 and the Cleveland Cavaliers won their eighth straight, defeating the Los Angeles Lakers 122-110 Wednesday night and spoiling LeBron James' first game after turning 40.\n\n\r\n              James, who celebrated his birthday on Monday, scored 23 points as he became the first player in NBA history to appear in a game in his teens and 40s. Coincidentally, the milestone game came against the team that drafted James first overall in 2003 and where he spent 12 seasons in two stints.\n\n\r\n              The Akron, Ohio, native helped lead the Cavaliers to their first NBA championship in 2016.\n\n\r\n              Evan Mobley added 20 points for Cleveland, which enters the new year with an NBA-best 29-4 record, including a 9-0 against the Western Conference.\n\n\r\n              Austin Reaves had a season-high 35 points with 10 assists and nine rebounds for the Lakers. Anthony Davis added 28 points and 13 rebounds.\n\n\r\n              Los Angeles goes into 2025 with an 18-14 mark, seventh in the Western Conference.\n\n\r\n              Takeaways\r\n              Cavaliers: Sam Merrill sprained his right ankle during the second quarter and did not return. Darius Garland had a season-high 14 assists.\n\n\r\n              Lakers: Dorian Finney-Smith and Shake Milton made their Los Angeles debuts after being acquired in a trade with Brooklyn on Monday. Milton scored six points and Finney-Smith two. \n\n\r\n              Key moment\r\n              Cleveland led 96-80 less than three minutes into the fourth quarter before Los Angeles started to rally. The Lakers got within 112-107 before the Cavaliers closed the game on a 10-3 run. Allen's dunk with 1:58 remaining gave Cleveland a 116-107 advantage, putting it out of reach.\n\n\r\n              Key stat\r\n              The Cavaliers made 18 3-pointers, the seventh straight game they have had at least that many from beyond the arc.\n\n\r\n              Up next\r\n              The Cavaliers wrap up their road trip at Dallas on Friday, while the Lakers host Portland on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997187.975221
}