{
  "game_id": "0022000220",
  "espn_id": "401267380",
  "date": "Jan 20, 2021",
  "matchup": "TOR vs. MIA",
  "headline": "Nunn leads Heat past Raptors 111-102",
  "body": "TAMPA, Fla. -- — The Miami Heat were missing a lot of firepower Wednesday night. They did have Kendrick Nunn and a zone defense that the Toronto Raptors couldn't figure out\n\n\r\n                    Nunn scored 28 points and the injury-plagued Heat pulled away in the second half for a 111-102 win.\n\n\r\n                    Bam Adebayo had 14 points, 13 rebounds and seven assists for Miami, and Kelly Olynyk came off the bench with 15 points, eight rebounds and eight assists.\n\n\r\n                    Despite missing four key players — including Jimmy Butler, Tyler Herro, Avery Bradley and Meyers Leonard — the Heat (6-7) won their second straight.\n\n\r\n                    “I don't know what percentage of our scoring wasn't here tonight, but we have a lot of guys who can score 20 points,” Heat coach Erik Spoelstra said. “In this (injury) situation, either you put your tail between your legs or you rise to the occasion for your team.”\n\n\r\n                    Fred VanVleet had 24 points and nine assists for the Raptors (5-9), whose three-game winning streak ended. Pascal Siakam and OG Anunoby scored 18 points each for Toronto, which shot 30.2% (13 for 43) in the second half and 39.8% (35 for 88) overall.\n\n\r\n                    “It seemed like we were stuck on 85 for a long stretch late in the game,” VanVleet said. “We'll have to get some better looks instead of shooting 3s all the time. When you don't make shots against a zone it has a snowball effect. They get more aggressive and it makes it harder.”\n\n\r\n                    After scoring Toronto's first seven points of the game, Kyle Lowry finished with eight points, 10 rebounds and seven assists.\n\n\r\n                    Nunn, who had scored just 33 points all season before his 18-point game Monday night, came off the bench and shot 9 of 12 and grabbed eight rebounds in 35 minutes. \n\n\r\n                    Nunn scored on a layup and a 3-pointer to put the Heat up by 11 early in the second quarter, but Terence Davis scored twice during a 9-0 run that got the Raptors quickly back in it.\n\n\r\n                    Nunn hit two more 3-pointers and Olynyk scored eight points on a 21-9 Miami spurt in the third quarter, and the Heat took an 88-83 lead into the fourth quarter.\n\n\r\n                    Two straight 3-pointers by Goran Dragic gave Miami a double-digit lead in the closing minutes.\n\n\r\n                    “It's irrelevant what the (defensive) scheme is,” Spoestra said of the Heat's effective zone defense. “Our man defense was good as well. I was more looking to whether we were committed to multiple efforts and we had those tonight.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Herro missed a third game with neck spasms. ... Butler and Bradley missed their fifth straight games while in coronavirus protocol. Leonard sat out a fifth game with a shoulder injury. ... Adebayo entered the game as the only NBA player averaging at least 19.5 points, nine rebounds, 5.1 assists, 1.2 blocks and one steal.\n\n\r\n                    Raptors: Lowry needs 14 points to reach 10,000 for his career with Toronto. Only five other active NBA players have scored 10,000 points with their current team. Lowry scored another 3,732 points in stints with Houston and Memphis. ... Chris Boucher's franchise-tying record of six straight games of 15 or more points off the bench ended.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Play the Raptors again Friday night in the second game of a four-game road trip.\n\n\r\n                    Raptors: Friday's game against Miami will conclude a five-game homestand at Amalie Arena.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996889.211893
}