{
  "game_id": "0021500042",
  "espn_id": "400827929",
  "date": "Nov 01, 2015",
  "matchup": "MIL @ TOR",
  "headline": "Dwane Casey gets 157th win as Raptors coach; team off to 3-0 start",
  "body": "TORONTO -- Dwane Casey has had 50 players since taking over as Toronto's coach in 2011-12. Only one has been along for the whole ride, and that one helped get Casey a milestone win on Sunday.\nBacked by 15 points from DeMar DeRozan, Casey got his franchise-record 157th win as coach of the Raptors with a 106-87 victory over the Milwaukee Bucks.\nAfter the game, Casey paid special tribute to DeRozan, who has been with Casey since he inherited a last-place Atlantic Division team. Casey has improved the club's record in each of the four seasons since, and Toronto has won back-to-back division titles the past two years.\n\"DeMar DeRozan has been here through the whole number of wins,\" Casey said. \"As Drake said, we started at the bottom [but] we're not there yet. We started 30th in the league in defense, [we've done] a lot of building, and we're still building.\"\nCasey took the milestone from current Minnesota Timberwolves coach Sam Mitchell. Casey broke the record in just his 315th game in charge.\nThe victory boosted Toronto's record to 3-0, just the third time in team history that it has been perfect through the season's opening three games, and the first time since 2008-09.\nJonas Valanciunas continued his solid start to the season with a team-high 19 points to go with eight rebounds. Point guard Kyle Lowry also chipped in with 15 points and seven assists, and the Raptors beat the Bucks for the seventh time in their past eight meetings.\n\"I think we just went out there tonight and played our game,\" Lowry said. \"We are getting a lot more comfortable with each other, feeling out where we are going to be and the spots on the floor where we need to be at.\"\nThe Bucks dropped to 0-3 with the loss, despite a game-high 20 points from Giannis Antetokounmpo.\nTIP-INS\nMilwaukee led only once all game, and that lead lasted for just 2:48. ... Greivis Vasquez went 5-for-5 from the free throw line and had nine points in his first game against Toronto since the draft-night trade that sent him from the Raptors to Milwaukee in exchange for a pair of draft picks. ... Bucks G O.J. Mayo (hamstring) missed his third straight game, while F/C John Henson (Achilles) was not available.\nTOUGH START\nThis is the first time the Bucks have started a season with three consecutive losses since 1976-77, when they dropped five straight. Milwaukee previously had the longest streak in NBA history without starting 0-3 at 38 years.\nBENCH BOSSES\nTerrence Ross' 3-pointer, one of three he hit off the bench in the fourth, and another from Patterson keyed a 14-point Toronto run to push the lead to 20 points, snuffing any chance of a Bucks victory. Ross had 11 of those 14 points, and Toronto's bench combined to score 21 of the team's 25 points in the final quarter.\nMVP IN THE HOUSE?\nToronto FC and Italian national soccer team forward Sebastian Giovinco took in the game courtside. He recently claimed the Golden Boot as the top scorer in Major League Soccer with 22 goals and 16 assists. The diminutive striker is likely the front-runner to win the MLS MVP award this season after leading Toronto to the playoffs for the first time.\nIDOL WORSHIP\n\"Obviously he beat us my first year here in Toronto and then growing up, obviously, he was an idol of mine, and now he's my coach, so I'm really going to take advantage of that, and I feel it's really going to benefit my game.\" -- Former Toronto guard Vasquez on playing for Bucks coach Jason Kidd.\nUP NEXT\nThe Bucks visit Brooklyn on Monday night. The Raptors visit Dallas on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994113.318624
}