{
  "game_id": "0021800138",
  "espn_id": "401070819",
  "date": "Nov 04, 2018",
  "matchup": "POR vs. MIN",
  "headline": "Nurkic scores 19, Trail Blazers defeat Timberwolves 111-81",
  "body": "PORTLAND, Ore. --  Life is good for the Portland Trail Blazers 10 games into the season.\n\nJusuf Nurkic had 19 points and 12 rebounds and led the Trail Blazers to a 111-81 victory over the Minnesota Timberwolves on Sunday night.\n\nto improve to 7-3 on the season.\n\n\"When everything go well, it go well,\" Nurkic said after the win pushed the Blazers to 7-3. \"We came ready after back-to-back and a bad loss.\"\n\nBlazers star guard Damian Lillard said the team's start likely has surprised some.\n\n\"To be sitting where we are now, I'm sure people didn't expect it,\" Lillard said. \"I think we're playing good basketball. We've been pretty consistent with the things that we need to do to win games and it's showing.\"\n\nMeyers Leonard had a double-double with 15 points and 12 rebounds off the bench. Following a game Saturday in which their bench struggled against the Los Angeles Lakers, the Trail Blazers' reserves bounced back Sunday and outscored the Wolves subs 44-23.\n\n\"I was happy for Meyers,\" Blazers coach Terry Stotts said of his reserve big man. \"Got a little chant going, that was fun. I thought in the first half he played very well.\"\n\nKarl-Anthony Towns finished with 23 points for Minnesota. It was his fourth straight game scoring 20 points or more. But scoring was not the issue for the Wolves on Sunday, as the Blazers got plenty of points at the free-throw line.\n\n\"Defensively, the penetration really hurt us,\" Wolves coach Tom Thibodeau said.\n\nPortland, the league's best free-throw shooting team, took advantage of its free-throw attempts in the first two quarters for a 61-45 halftime lead. In the game, the Trail Blazers shot 28 for 32 from the line.\n\nThe Blazers continued the onslaught in the third quarter, pushing their lead to as many as 28 points.\n\nFor the second straight game, the Blazers struggled from beyond the arc (7 for 28), but it didn't matter against the Wolves.\n\nThe timeout helped as Minnesota stormed back, even taking a brief two-point lead on a 3-pointer from rookie guard Josh Okogie.\n\nPortland, however, took control of the game on the strength of their subs.\n\nTowns already had his knees wrapped up before the 4th quarter even started, knowing his night was over.\n\nTIP-INS\n\nTrail Blazers: In each of last three seasons, Portland's CJ McCollum has averaged over 20 points per game. But despite a league-wide scoring boom, McCollum has actually seen his scoring average drop to 19 points. While McCollum is sacrificing some individual glory, the Blazers have a 7-3 record and entered Sunday with the third-ranked offense in the NBA.\n\n\"I think obviously having Evan (Turner) out there with them, playing more minutes with Damian (Lillard) affects how much the ball is in his hands. His numbers are probably down a little bit but not significantly,\" Blazers coach Terry Stotts said of the adjustment for McCollum. \"The emphasis this year was, again, passing and incorporating the team more and less off the dribble. That's how we are playing right now. I think everybody was on the same page. Not just talking to him but to everybody.\"\n\nTimberwolves: Disgruntled Wolves forward Jimmy Butler sat out of Sunday night's game in Portland, due to what the team deemed \"precautionary rest.\"\n\nButler did not play in the Wolves game Wednesday, but did play Friday at Golden State\n\nThibodeau did confirm to reporters before the game that Butler was with the team, clearly trying to downplay Butler's absence in light of the star forward's trade request.\n\nThe Wolves were also without point guard Derrick Rose on Sunday, who was a late-scratch after being deemed a game-time decision by his coach.\n\nUP NEXT\n\nTrail Blazers: Home against the Milwaukee Bucks on Tuesday.\n\nTimberwolves: On the road against the Los Angeles Clippers on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995203.300721
}