{
  "game_id": "0022000814",
  "espn_id": "401307608",
  "date": "Apr 11, 2021",
  "matchup": "MIA @ POR",
  "headline": "Adebayo has 22 points, Heat down Blazers 107-98",
  "body": "PORTLAND, Ore. -- — Bam Adebayo scored 22 points and Jimmy Butler added 20 to lead the Miami Heat to a 107—98 victory over the Portland Trail Blazers on Sunday night. \n\n\r\n                    The Heat, who have won six of their last seven games, led by as many as 20 points early in the fourth quarter.\n\n\r\n                    CJ McCollum and Norman Powell each finished with 17 points for the Blazers, who were hurt by 17 turnovers. Miami's aggressive defense held Damian Lillard to just 12 points on an off night when he made just three shots from the field, all 3-pointers.\n\n\r\n                    Adebayo said it was important to set a tone to start a four-game road trip. \n\n\r\n                    “We were just trying to really hone in on defense. We just really felt with this team that’s how you win,\" Adebayo said. \"We were able to get stops and get into transition and get a few dunks. That’s why we won by a lot.”\n\n\r\n                    The Heat were without Victor Oladipo indefinitely because of right knee soreness. Oladipo, acquired by the Heat on March 25 in a trade with Houston, was injured in the fourth quarter of Miami's victory over the Los Angeles Lakers on Thursday. \n\n\r\n                    Kendrick Nunn started in Oladipo's place. Nunn, who didn't play in six straight games after injuring his ankle early in a March 26 game against Charlotte, finished with 15 points. \n\n\r\n                    “We know on the road we have to be able to defend at a high level,” Heat coach Erik Spoelstra said. “Our defense has to travel. It’s a key to our success.” \n\n\r\n                    The Blazers started Jusuf Nurkic, who sat out of Saturday night's victory over the Detroit Pistons due to injury management of knee inflammation. In his place, Enes Kanter set a franchise record with 30 rebounds in the game, which the Blazers dominated 118-103. \n\n\r\n                    Blazers coach Terry Stotts said he was hesitant to blame Portland's lackluster performance on the back-to-back. The Heat hadn't played since Thursday. \n\n\r\n                    “To be honest, I thought we looked a step slow and they looked like a rested team,” he said. “I don't say that very often.”\n\n\r\n                    Nurkic, who was on a minutes restriction against the Heat, picked up two quick fouls and went to the bench with 7:02 left in the first quarter. With about 3:50 left in the opening half, Nurkic left the court, his hand on his lower back. But he returned to start the second half and said after the game that the X-rays were negative. \n\n\r\n                    Derrick Jones Jr.'s 3-pointer put Portland up 29-19 early in the game but the Heat closed the gap in the second quarter and went into the break with a 56-48 lead. The Heat stretched their advantage to 65-50 early in the third quarter. \n\n\r\n                    Portland got another scare in the third quarter when Kanter went down after knocking heads with another player. But he also returned. \n\n\r\n                    TIP INS\n\n\r\n                    Heat: It was the first of a four-game road trip. Tyler Herro was listed as questionable for the game because of right foot soreness, but played. KZ Okpala remained out because of health and safety protocols. \n\n\r\n                    Trail Blazers: It was the second of two meetings with the Heat this season. Portland won the first 125-122 in Miami on March 25. ... With a 3-pointer in the third quarter, Lillard passed Dirk Nowitzki on the NBA's career made 3s list. \n\n\r\n                    FRUSTRATION\n\n\r\n                    Portland has lost four of its last six games. But the Blazers looked especially out of sorts against the Heat. \n\n\r\n                    “I understand the frustration with the fans and everybody, but sometimes it’s frustrating for us too,” Nurkic said. “I know the coaches, no matter what they tell us, they can’t go out there and change it. I get that, everybody gets that, but at some point, something’s got to happen.”\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Visit the Phoenix Suns on Tuesday. \n\n\r\n                    Trail Blazers: Host the Boston Celtics on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764996767.601142
}