{
  "game_id": "0021600966",
  "espn_id": "400900361",
  "date": "Mar 10, 2017",
  "matchup": "CHI vs. HOU",
  "headline": "Harden leads the way as Rockets pull away from Bulls, 115-94",
  "body": "CHICAGO --  Although the Houston Rockets put up big offensive numbers in the second and third quarters, their work on the defensive end dominated the discussion in the postgame locker room.\n\n\"We just locked it in,\" James Harden said. \"We stuck to our principles. We knew if we gang rebounded and got out in transition, we had a chance.\"\n\nHarden had 19 points, 13 assists and seven rebounds, and Houston rallied from an early double-digit deficit for a 115-94 victory over the Chicago Bulls on Friday night.\n\nCoach Mike D'Antoni earned his 500th career win.\n\n\"I've been around for a long time,\" he said. \"I've had some good teams and this is one of my best.\"\n\nRyan Anderson added 21 points as the Rockets avoided their first three-game losing streak of the season.\n\n\"We had a big emphasis on defense and running the ball,\" Anderson said. \"That's when we're at our best, when we get stops and run.\"\n\nHouston outscored Chicago 69-30 in the middle two quarters to take control.\n\nDwyane Wade had 21 points in 25 minutes for the Bulls after missing the previous two games with a left quad strain. Chicago has dropped four straight.\n\n\"That first quarter, we jumped out to a double-digit lead and then they go on a big run and we tried to get it all back at once,\" coach Fred Hoiberg said. \"Obviously, they are a team that can get going in a hurry and get hot.\"\n\nDespite not having played in nearly a week, Wade was sharp at the start. He scored 12 points in seven minutes -- making all five of his field-goal attempts -- to help Chicago to a 33-23 lead at the end of the first quarter.\n\nThe Bulls were still up 49-47 with just under three minutes to go in the second when things fell apart. Houston scored the final nine points of the first half for a 56-49 halftime edge and then had the first eight of the third for a run of 17 straight and a 64-49 lead.\n\nThe lead was 80-51 with just under five minutes to go in the third. The rout was on and the United Center crowd serenaded the home team with boos.\n\n\"Once we started making some shots, it was deflating for them,\" Anderson said.\n\nTIP-INS\n\nRockets: Harden scored seven of his 13 first-half points in the final 2:08, including an impressive four-point play. He was fouled as Chicago's Michael Carter-Williams fought through a screen. Despite being knocked off balance, Harden flung the ball toward the basket and banked it in.\n\nBulls: In the previous four games, they averaged 15.8 points (on 28.6 percent shooting) in the fourth quarter. Hoiberg is hopeful the return of Wade will improve those numbers, although the point was moot with the blowout Friday. \"He's been one of the guys in the fourth quarter that's been able to take over games at times,\" Hoiberg said.\n\n500 CLUB\n\nD'Antoni is the fifth active coach with 500 wins, joining Gregg Popovich, Doc Rivers, Rick Carlisle and Nate McMillan.\n\nMVP TALK\n\nWith a little more than a month to go in the regular season, the race for the NBA's MVP award is becoming a hot topic. To no one's surprise, D'Antoni believes Harden is most deserving.\n\n\"You probably could make the case for three or four guys,\" D'Antoni said. \"But when you're a league All-Star and lead the league in assists ... I mean, he creates a lot of points, not just for him. He reads the game. His (shooting) percentages are up. He's efficient. He has cut down his turnovers lately. He has upped his defense this year. We wouldn't be anywhere without him, obviously.\"\n\nUP NEXT:\n\nRockets: Host the Cleveland Cavaliers on Sunday night.\n\nBulls: Visit the Boston Celtics on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995024.749574
}