{
  "game_id": "0021500595",
  "espn_id": "400828482",
  "date": "Jan 15, 2016",
  "matchup": "PHX @ BOS",
  "headline": "Thomas, Smart lead Celtics past Suns, 117-103",
  "body": "BOSTON -- Isaiah Thomas said he didn't have Boston's game against Phoenix circled on his calendar. He certainly played like he did.\nThomas scored 19 points against his former team, Marcus Smart had his first career triple-double and the Celtics beat the skidding Suns 117-103.\nThomas was acquired from the Suns in a trade last Feb. 19. Four days later in his only other game against Phoenix since the deal, he had 21 points and seven assists.\n\n\"The first time I played against them, it was more of a try to prove something, but tonight was just another game, another opponent,\" Thomas said.\nSmart had 10 points, 11 assists and 11 rebounds, becoming the first Celtics player to record a triple-double off the bench since Art Williams on Jan. 6, 1971.\nKelly Olynyk added 21 points and nine rebounds and hit four of the Celtics' 14 3-pointers.\n\"We needed a night where we shot the ball well from 3, so it was good to see the ball go through the net some,\" Celtics coach Brad Stevens said.\nMirza Teletovic led Phoenix with 22 points, and Brandon Knight had 16. The Suns have lost 12 of 13 to drop to 13-28.\n\"We let teams do what they want,\" Suns coach Jeff Hornacek said. \"Until we got a tougher mindset, it will be more of the same.\"\nBoston improved to 21-19. The Celtics finished three points shy of their season-high points total, never letting the lead dip below 13 points in the second half.\nTIP-INS:\nSuns: Knight was 7 of 15 from the floor in his return after missing Phoenix's loss Tuesday night in Indiana because of food poisoning. \"I kind of had some issues with it,\" Knight said, \"but just got to play through it especially right now when our team is in need of a ball handler.\"\nCeltics: Jared Sullinger took the microphone before the game to remind fans to celebrate Martin Luther King Jr. Day on Monday. \"Without him, none of this would be possible,\" Sullinger said. ... Thomas' emphatic block of Devon Booker's shot late in the third quarter excited the crowd, but he was called a foul. \"That was all ball,\" Thomas joked after the game. \"That was going to be my third block in three games. I'm a shot blocker now.\"\nHONORING ANDREW\nButler University established a scholarship fund Friday to honor Andrew Smith, the former player who died this week at age 25 after a two-year battle with cancer.\n\"I know how much he loved Butler and I know his wife (Samantha) appreciates that,\" said Stevens, who coached Smith to back-to-back national title game appearances at Butler.\nWILD, WILD WEST\nThe suns are five games out of eight place in the Western Conference. \"Since I've been coach, it's strange -- we win 48 games (in 2013-14) and can't even get in the playoffs,\" Hornacek said. \"Now we're (five games out).\"\nUP NEXT:\nPhoenix is at Minnesota on Sunday.\nBoston is at Washington on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994851.396971
}