{
  "game_id": "0021301032",
  "espn_id": "400489905",
  "date": "Mar 22, 2014",
  "matchup": "POR @ CHA",
  "headline": "Al Jefferson, Bobcats blitz Blazers to halt 2-game slide",
  "body": "CHARLOTTE, N.C. -- After two disappointing losses, the Charlotte Bobcats bounced back in a big way.\nAl Jefferson scored 28 points and two others finished with more than 20 as the Bobcats routed the Portland Trail Blazers 124-94 on Saturday night.\nKemba Walker added 26 and Gerald Henderson 23 for Charlotte, which posted season bests in points and margin of victory to snap a two-game losing streak.\n\"It's a good win for us, and a good bounce back,\" Bobcats coach Steve Clifford said. \"They're an exceptional offensive team, but you could tell our guys were ready to play from the start of the game. When guys came in off the bench, they were ready as well.\"\nThe Bobcats shot 52 percent from the field (49 of 94), outscored the Trail Blazers in the paint 54-32 and held a 50-36 rebounding advantage over Portland, which had won its last four games against Charlotte.\nBut the Trail Blazers, playing without leading scorer LaMarcus Aldridge, could never get on track against the Bobcats, trailing by as many as 34 points late in the second half in losing for the first time in their last three games.\n\"That's when we're at our best,\" Jefferson said. \"If you look at all the big wins we've had, especially at home, we had a great start. You could tell in shootaround today that we were focused, we were locked in and we knew that we needed this win tonight.\"\nDamian Lillard scored 20 points, Dorell Wright added 17 and Wesley Matthews 15 for Portland, which shot 40.5 percent (34 of 84) and made just 9 of 27 3-pointers.\nThat allowed the Bobcats to bolt to an early double-digit lead, extend it to as many as 26 points late in the first half, then weather a half-hearted Trail Blazers comeback attempt early in the third quarter.\n\"They shot the ball well, passed the ball well, rebounded the ball well, defended well and basically outplayed us,\" Portland coach Terry Stotts said. \"We certainly could have played better, but they were clicking on all cylinders.\n\"You don't want to just dismiss it as one of those games. You want to learn from it. But losing by 30 points, we don't have the luxury not to play better.\"\nDown 69-46 at the half, the Trail Blazers cut Charlotte's lead to 17 points three times in the third quarter, the last at 77-60 on Matthews' layup with 6:22 left. But Jefferson hit a jumper, followed by a 3-pointer by Walker to push the Bobcats' lead back past the 20-point mark, and Portland never challenged again.\nCharlotte took its biggest lead of the game in the final two minutes behind its reserves, with Jannero Pargo's 3-pointer with 1:22 remaining putting the Bobcats ahead 122-88.\nBehind Jefferson, Walker and Henderson, who combined for 48 points, Charlotte put together two of its best quarters this season in taking command of Saturday's game.\nAfter missing its first two shots of the game, the Bobcats hit 11 straight -- four by Jefferson, three by Michael Kidd-Gilchrist, and two each from Henderson and Walker -- to pull ahead 23-9 with 5:03 remaining in the first quarter.\n\"We wanted to double Big Al and take away his post-ups,\" Lillard said. \"Sometimes we didn't even get a chance to double him, and he's already scoring or making good passes out of the post. We were just scrambling the whole time.\"\nThe Trail Blazers cut the Bobcats' lead to 10 points four times late in the quarter, the last at 31-21 on Mo Williams' jumper with 54 seconds remaining, and were down 11 points at the end of the quarter.\nBut Charlotte opened the second quarter with 11 unanswered points, with Josh McRoberts' two free throws with 10:03 left putting the Bobcats up 42-22, their first 20-point lead of the half.\nCharlotte took its biggest lead of the half at 26 points late in the second quarter, with Jefferson's layup with 1:43 left capping a 10-3 run for a 67-41 bulge.\n\"We're going to have a good chance to win if all three of us are playing well offensively,\" Henderson said, referring to Jefferson and Walker. \"We're not always going to score that every night, but if we can play the kind of defense that we did tonight, we should have a good chance to win.\"\nGame notes\nStotts had no update on the return of Aldridge, who leads the team in scoring (23.4 points) and rebounding (11.1 per game). He has missed Portland's last five games with a low back contusion. ... The Bobcats (34-36) are in seventh place in the Eastern Conference standings, 1½ games ahead of Atlanta (31-36) and 1½ games behind sixth-place Washington (36-33) with 12 games remaining.",
  "source": "espn_api",
  "crawled_at": 1764992942.630326
}