{
  "game_id": "0022200612",
  "espn_id": "401468767",
  "date": "Jan 10, 2023",
  "matchup": "DET @ PHI",
  "headline": "Embiid scores 36 points, Harden has triple-double for 76ers",
  "body": "PHILADELPHIA -- — Joel Embiid says if he can walk, he can play.\n\n\r\n              With an injured left foot feeling better, Embiid got to put the hurt on the Detroit Pistons.\n\n\r\n              Embiid rocked braids and had 36 points and 11 rebounds, James Harden added a second straight triple-double and the Philadelphia 76ers routed the Pistons 147-116 on Tuesday night.\n\n\r\n              “We didn't want to mess around,” Embiid said. “I wanted to make sure that we were all together and on the same page that it was going to be a three-quarter game.”\n\n\r\n              Harden did his part and finished with 16 points, 15 assists and 12 rebounds — in three quarters.\n\n\r\n              Embiid returned from a three-game absence with a sore left foot with a new look. But it was the same dominant performance out of last season’s NBA scoring champion. Embiid is chasing a second straight scoring crown — his 33.5 average entering the game was just a tick behind Dallas’ Luka Doncic’s 34.0 average — and he’s trying to pass Wilt Chamberlain (33.5; 1965-66) for highest season-scoring average in team history.\n\n\r\n              Embiid might even set the marks in braids.\n\n\r\n              “Just wanted to change things up,\" he said, laughing.\n\n\r\n              Two days after Harden also had a triple-double in the 76ers’ victory at Detroit, the Sixers raced to a 24-point lead in the first half. The Pistons have the worst record in the Eastern Conference. The Sixers have done their part in putting Detroit there. The 76ers beat the Pistons 123-111 on Sunday.\n\n\r\n              This was only seventh time all season their regular lineup of Embiid, Harden, Tyrese Maxey, PJ Tucker and Tobias Harris started the game. The Sixers won for the 13th time in 16 games.\n\n\r\n              “It's a lineup that we're still evaluating defensively,” coach Doc Rivers said. “Clearly, it's a good offensive lineup. We just haven't seen it a lot. We've had no ‘in-a-rows’ where they played six, seven, eight, nine in a row.”\n\n\r\n              Saddiq Bey, Jaden Ivey and Rodney McGruder each scored 17 points for the Pistons.\n\n\r\n              Harden got his triple-double in only 26 minutes, 2 seconds of playing time, his fastest time at securing that feat.\n\n\r\n              Maxey hit a 3 for a 38-29 lead in front of the Pistons bench and coach Dwane Casey tossed his hands in the air and called for a timeout.\n\n\r\n              Whatever was drawn up, it didn’t work: Philadelphia came out of the timeout and scored the next 10 points. The 76ers scored 42 points in the third and sat their starters in the fourth.\n\n\r\n              Some of the final numbers came straight out of a bad pickup game in the park. \n\n\r\n              The Sixers needed only 11 3-pointers to reach their fifth-highest total since the 1976-77 NBA-ABA merger. The 76ers scored a whopping 82 points in the paint and shot 61% overall from the floor. \n\n\r\n              Maxey scored 16 points. Harris had 14 points and was a plus-40 in 27 minutes.\n\n\r\n              “We know how dominant we are. We know how great we can be,” Harris said.\n\n\r\n              GROWING PAINS\n\n\r\n              The Pistons have won just 11 games in yet another difficult season under Casey. \n\n\r\n              “I can see the growth on a daily, game-to-game basis. but then I have to come in and explain to everybody why we didn’t win. and that’s what’s tough,” Casey said. \"The easy part, the fun part is the daily, in the laboratory, coaching, teaching, film sessions, watching guys grow, listen to questions.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Isaiah Stewart (left shoulder soreness) was a late scratch. Former 76er Nerlens Noel got the start.\n\n\r\n              76ers: Harden leads the NBA with five games of at least 15 assists. It’s the most for any 76er since Mo Cheeks had five in 1987-88. \n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Minnesota on Wednesday night.\n\n\r\n              76ers: Host the Thunder on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995268.062025
}