{
  "game_id": "0022000741",
  "espn_id": "401307532",
  "date": "Apr 02, 2021",
  "matchup": "MEM vs. MIN",
  "headline": "Valanciunas leads Grizzlies past Timberwolves 120-108",
  "body": "MEMPHIS, Tenn. -- — Jonas Valanciunas had 19 points and 11 rebounds, eight Grizzlies scored in double-figures and Memphis used a second-half burst for a 120-108 victory over the Minnesota Timberwolves on Friday night.\n\n\r\n                    Grayson Allen added 15 points for Memphis, and De’Anthony Melton keyed the second-half rally with 14 points, going 4 of 6 from 3-point range in the game, including connecting on all three 3-pointers after halftime.\n\n\r\n                    The Grizzlies had nine players convert 3-pointers as the team shot 49% from beyond the arc.\n\n\r\n                    “It just makes it that much harder to guard us,” said reserve Xavier Tillman, who had 12 points and one of the 3-pointers. “You can’t just keep one player in the paint (defensively). Everybody being a lethal threat from the perimeter opens up a lot of stuff.”\n\n\r\n                    Karl-Anthony Towns led the Timberwolves with 30 points and 16 rebounds, while rookie Anthony Edwards added 22 points and six assists, while shooting 9 of 14 from the field.\n\n\r\n                    Minnesota went about five minutes without scoring in the third, and Memphis led 92-84 after closing the quarter with a 12-3 rally.\n\n\r\n                    “Our defense really clamped down in the second half,” Memphis coach Taylor Jenkins said. “I thought we did a better job of getting stops in a row, came up with 50-50 balls. Our defense really ignited us. Great production up and down the roster.”\n\n\r\n                    The Grizzlies outscored the Timberwolves 12-4 opening the fourth for a 16-point lead with eight minutes left, and the rally turned into a 35-9 run for a 25-point lead.\n\n\r\n                    “Our ball movement and our defensive rebounding really hurt us,” Timberwolves coach Chris Finch said.\n\n\r\n                    Memphis scored a franchise-record 80 points in the paint in the previous game between the teams — a 118-107 Grizzlies win on Jan. 13. This time, Minnesota’s defense collapsed on Valanciunas when he got the ball in the post. That allowed the Wolves to outscore Memphis 44-38 in the paint, but the Grizzlies made up the offensive difference from outside the arc.\n\n\r\n                    “We knew they were going to get shots,” Finch said of the 3-pointers. “The problem was they got a lot of them early that were uncontested in transition, and they got their rhythm going.”\n\n\r\n                    Towns acknowledged the game plan was to try and minimize the Grizzlies scoring inside.\n\n\r\n                    “We tried not to give them too many looks at 3-pointers,” Towns said. “Just try to protect the paint as best as possible. We also didn’t say give them 49% from 3.\n\n\r\n                    \"We did what we said we wanted to do — protect the paint. But we’ve also got to make sure we don’t give everything else up.”\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Have not won consecutive games since the opening two of the season. ... G Ricky Rubio was a late scratch with back spasms. He was replaced by John McLaughlin, who made his first start of the season and third of his career. ... G Josh Okogie returned after missing five games due to coronavirus protocol. ... Towns grabbed his 1,200th offensive rebound in the first quarter.\n\n\r\n                    Grizzlies: Have won five straight in the series. ... Allen (sore left hip) and Brandon Clarke (personal reasons) returned to the active roster, Allen to the starting lineup. ... G Ja Morant was limited to four points in the first half, going 1 for 4 from the field. He finished with 11 points and seven assists.\n\n\r\n                    WINSLOW INJURY\n\n\r\n                    Grizzlies reserve forward Justise Winslow missed his third game with right thigh soreness. But Memphis coach Taylor Jenkins doesn’t expect Winslow to miss much time. “It’s short-term for sure,” Jenkins said. “Just a little lingering soreness that we want to manage and get behind and get out of the woods of, but nothing long-term to worry about.”\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: At Philadelphia on Saturday\n\n\r\n                    Grizzlies: At Philadelphia on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996942.377172
}