{
  "game_id": "0021600111",
  "espn_id": "400899561",
  "date": "Nov 09, 2016",
  "matchup": "CHI @ ATL",
  "headline": "Sefolosha, Howard spark Hawks to 115-107 win over Bulls",
  "body": "ATLANTA --  Thabo Sefolosha loves it when the Atlanta Hawks get so many players contributing on offense.\n\nEight of the Hawks' 10 players scored in double figures Wednesday night, led by Sefolosha, whose primary role is a defensive specialist off the bench.\n\n\"Everybody can play on this team,\" he said. \"On different nights, a different guy steps up. It's a huge plus to have that.\"\n\nSefolosha scored 20 points, Dwight Howard added 18 and Atlanta beat the Chicago Bulls 115-107 for its third consecutive victory.\n\nPaul Millsap had 16 points and 11 rebounds for the Hawks, and Dennis Schroder scored 13. Howard grabbed 10 boards as Atlanta outrebounded Chicago 49-30.\n\nJimmy Butler finished with 39 points and Dwyane Wade had 25 for the Bulls, who have lost four of five.\n\nThe output was Butler's highest since he scored a career-high 53 points against Philadelphia on Jan. 14 last season.\n\n\"They got what they wanted, and then we decided to start playing -- once again,\" Butler said. \"Defense is all about effort, let's get that straight. We've got to man up and guard, take it personal. We'll be fine, but we've got to guard.\"\n\nAtlanta carried over some momentum from Tuesday's rare victory at Cleveland. The defending NBA champion Cavaliers had won 11 straight in the series, including two playoff sweeps.\n\nSefolosha sparked the Hawks when he entered late in the first quarter, scoring 16 of their 21 points in a 3:44 stretch that spanned the first two periods to help Atlanta take a 45-31 lead.\n\nSefolosha loved how Hawks coach Mike Budenholzer changed the defense to keep Butler and Wade in check.\n\n\"In the second half we switched it up a little bit,\" Sefolosha said. \"They're good players, so we're not going to stop them every time, but we got just enough stops and we had good offense at the end to pull through.\"\n\nThe Hawks led by 17 early in the second on Millsap's jumper, but Chicago pulled within three early in the third. Kent Bazemore was called for a technical foul after slamming into Butler near the rim on a fast break, and Butler hit three free throws.\n\nAfter Wade's jumper put the Bulls up 74-73, Chicago took its biggest lead at five on Doug McDermott's fast-break dunk before Tim Hardaway Jr.'s runner put Atlanta up 86-85 late in the third.\n\nThe Hawks led the rest of the way, pushing the margin to 11 when Hardaway hit a straightaway 3-pointer. McDermott's short jumper made it 103-101 with 4:54 remaining, but the Bulls didn't get any closer.\n\n\"Our depth in the entirety of the roster is something we have a lot of faith and belief in,\" Budenholzer said. \"Tonight you kind of saw that.\"\n\nBACK IN TOWN\n\nWade will return to Miami on Thursday for the first time with an opposing team. The 12-time All-Star, who helped the Heat win three NBA titles in 13 seasons, had 23 points at the end of the third but went 1 for 4 from the field in the fourth.\n\nX-RAYS NEGATIVE\n\nBazemore jammed his right pinkie against the backboard on his hard foul. X-rays were negative, but he wore a protective sleeve on the finger. He said he got the technical for slamming his mouthpiece to the floor.\n\nSTAYING CLOSE\n\nBulls G Michael Carter-Williams made the two-game road trip even though he's sidelined four to six weeks with a bruised left knee. Chicago coach Fred Hoiberg said Carter-Williams is \"moving around well,\" but his timetable hasn't changed.\n\nUP NEXT\n\nBulls: Visit Miami on Thursday.\n\nHawks: Host Philadelphia on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995106.5657358
}