{
  "game_id": "0022301129",
  "espn_id": "401585757",
  "date": "Apr 06, 2024",
  "matchup": "MEM vs. PHI",
  "headline": "Embiid has 30 points and 12 rebounds in 23 minutes to lead the 76ers past the Grizzlies, 116-96",
  "body": "MEMPHIS, Tenn. -- — Joel Embiid had 30 points and 12 rebounds in just 23 minutes, Kelly Oubre Jr. added 17 points and the Philadelphia 76ers pulled within a half-game of seventh place in the Eastern Conference by beating the short-handed Memphis Grizzlies 116-96 on Saturday night.\n\n\r\n              Embiid was 9 of 13 from the floor, making both of his 3-point attempts. He checked out with seven minutes left in the third quarter and coach Nick Nurse saw no reason for him to return as Philadelphia maintained a comfortable lead in the second half en route to its fourth consecutive win.\n\n\r\n              “I like some of the things. We obviously got to run a bunch of different kinds of formations for him,” Nurse said, adding: “He's working his way back.”\n\n\r\n              Embiid, who was playing his third game after left knee meniscus surgery, said he is still feeling some rust from the inactivity. His points in each game continue to rise since his return, but he is not quite at full performance.\n\n\r\n              “I was still very sloppy,” he said. “I'm not used to the pace (like) before I got hurt. I've just got to get used to that pace.”\n\n\r\n              Scotty Pippen Jr. led the Grizzlies with 24 points, while GG Jackson finished with 17. Jordan Goodwin added 15 for Memphis, which had its three-game winning streak snapped. Maozinha Pereira had 13 points and 11 rebounds.\n\n\r\n              The Grizzlies had little answer for Embiid in the first half. The Philadelphia center collected 22 points on 7-of-10 shooting from the floor, plus 10 rebounds as the 76ers built a 62-42 halftime advantage. Memphis was just 2 of 12 from outside the arc, part of the Grizzlies shooting 37%.\n\n\r\n              “I think them getting in transition, and we started missing some shots,” Pippen said of the second-quarter Philly burst. \"They were able to go on a run. It was a nine-point game, and they pushed it to almost 20.\n\n\r\n              “They let Embiid get going, and the game got away from us.”\n\n\r\n              Philadelphia outscored Memphis 34-19 in the second quarter and the Grizzlies could make little headway to start the second half, never cutting the deficit into single digits. The pieces the Grizzlies had cobbled together didn't have the offensive firepower, and they still trailed by 86-70 after the third.\n\n\r\n              “Good effort by our group,” Memphis coach Taylor Jenkins said. “Just couldn't find any chemistry on the offensive side. The ball was bouncing all over the place.”\n\n\r\n              While the depleted Grizzlies had 13 players who did not dress against the 76ers, Philadelphia has gotten healthier with Embiid's return and is trying to avoid the play-in games. Besides being a half-game behind Miami for the No. 7 spot, the Sixers also moved within one game of Indiana for sixth place in the East and a guaranteed playoff spot. \n\n\r\n              But Embiid said the Sixers aren't concerned with whether they avoid the play-in game.\n\n\r\n              “We don't care,” he said. “We just want to play good basketball, win and get a good rhythm. Get guys healthy. Wherever we fall, we're fine with that.”\n\n\r\n              While the season has featured few highlights for the Grizzlies, the franchise did hold a celebration Saturday night with the retirement of former center Marc Gasol's jersey. Gasol, who played 11 seasons with Memphis, was an anchor on the grit and grind era that took the franchise to the postseason for seven consecutive seasons, including reaching the Western Conference finals in 2013. \n\n\r\n              UP NEXT:\n\n\r\n              76ers: Visit San Antonio on Sunday.\n\n\r\n              Grizzlies: Host San Antonio on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764996252.9445848
}