{
  "game_id": "0022300068",
  "espn_id": "401584696",
  "date": "Oct 25, 2023",
  "matchup": "MIA vs. DET",
  "headline": "Heat waste almost all of 19-point lead, scramble to hold off Pistons 103-102",
  "body": "MIAMI -- — To open a new season, the Miami Heat revisited their go-to move from last season: winning close games.\n\n\r\n              Bam Adebayo scored 22 points, Jimmy Butler finished with 19 points and 13 rebounds and the Heat held off the Detroit Pistons 103-102 on Wednesday night in the season opener for both clubs. The Heat led by 19 with 9:07 left, went scoreless in the final 2:57 and survived when a 30-footer by Detroit’s Cade Cunningham missed as time expired.\n\n\r\n              “I loved it,” Heat coach Erik Spoelstra said. “I loved the emotion tonight. I loved the energy. A lot of good things.”\n\n\r\n              Tyler Herro scored 16 points, Duncan Robinson added 15 and Kevin Love had 13 points and 10 rebounds for the reigning Eastern Conference champion Heat. Miami was 14-8 in games decided by three points or less last season, 16-9 when adding in the playoffs — and now, 1-0 this season.\n\n\r\n              “Hopefully, this isn't the start of another season where we're going to be playing a clutch game every night,” Herro said. “But it is fun.”\n\n\r\n              Cunningham had 30 points and nine assists for the Pistons. Jalen Duren had 17 points, 14 rebounds, four assists and four blocks for Detroit, Isaiah Stewart had 14 points and 14 rebounds and Killian Hayes scored 10.\n\n\r\n              “The way that our team as a whole competed throughout, that's something we can build off of, for sure,” Cunningham said.\n\n\r\n              Detroit put together a 14-0 run — spanning only 2:43 — to get within 94-89, the closest the Pistons had been to the lead since midway through the second quarter. And they didn't stop there: back-to-back scores off turnovers, the second of them a 3-point by Cunningham, got the Pistons within one.\n\n\r\n              Detroit had four shots in the final 64 seconds for the lead. All missed, and Miami escaped.\n\n\r\n              “A win is a win, as Spo would tell you, as I would tell you, as anybody in that locker room would tell you,” Butler said.\n\n\r\n              Miami improved to 20-16 all-time in openers, 10-6 under Spoelstra. Detroit fell to 38-40 in openers and dropped the first game of the Monty Williams coaching era with the Pistons.\n\n\r\n              “We have a resilient group,” Williams said. “The guys believe in what we're doing. They believe in each other. ... I think that stuff is really important.”\n\n\r\n              The Heat led most of the way and needed every bit of that lead to survive in the end. By halftime, Miami had a 21-4 lead in points off turnovers (it was 21-0 late in the half), a 9-0 lead in fast-break points and a 30-12 lead on points in the paint.\n\n\r\n              And the Heat lead was just 58-47 at the break. The reason: Cunningham.\n\n\r\n              He was brilliant, shooting 8 of 11 for 18 points in the first two quarters. But his teammates shot only 10 of 30 in the opening half, while Miami was far more balanced — three players in double figures, five with at least seven points by the break.\n\n\r\n              The Heat outscored Detroit 32-18 in the second. Take the other three quarters, the Pistons outscored the Heat 84-71.\n\n\r\n              “We played the kind of basketball we played for three quarters,” Williams said. “We had a bad second quarter.”\n\n\r\n              Luis Arraez, the 2023 batting champion from the Miami Marlins, and actor Sylvester Stallone were in the sold-out crowd. There were a pair of tributes — one in-game for longtime Heat season-ticket holder Jimmy Buffett, the singer-songwriter who spent decades of his life in the Florida Keys, and the other a pregame moment for longtime Heat stat crew chief Jim Cox. Both died in September.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit Charlotte on Friday.\n\n\r\n              Heat: Visit Boston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995402.305702
}