{
  "game_id": "0021800882",
  "espn_id": "401071555",
  "date": "Feb 23, 2019",
  "matchup": "PHI vs. POR",
  "headline": "Jusuf Nurkic scores 24, Blazers beat Sixers 130-115",
  "body": "PHILADELPHIA --  Jusuf Nurkic and Enes Kanter took advantage of Joel Embiid's absence.\n\nNurkic scored 24 points and grabbed 10 rebounds, Kanter had 16 and eight, and the Portland Trail Blazers beat the Philadelphia 76ers 130-115 on Saturday.\n\n\"It was an early game. Whoever wakes up first wins,\" Nurkic joked of the 1 p.m. start.\n\nThe Sixers struggled in their second game without Embiid, the All-Star center who is expected to miss at least a week with a sore left knee. Ben Simmons had 29 points and 10 assists and Tobias Harris scored 20.\n\n\"They're not the same team without Embiid, obviously, he's a big part of what they do,\" Portland coach Terry Stotts said. \"I thought we really played well defensively.\"\n\nThe Blazers had a 53-33 rebounding edge, including 19 offensive boards. Damian Lillard had 17 points as seven players reached double figures.\n\n\"We just didn't rebound well enough against a team like this,\" Simmons said. \"It's a group effort rebounding. I think just all of us combined, I don't think we did enough.\"\n\nWithout Embiid, the Sixers couldn't keep up in a matchup between the fourth-place teams in each conference. The Blazers (36-23) have won three in a row, including a 22-point victory over Golden State before the All-Star break. Philadelphia (38-22) is 4-4 this month.\n\n\"Obviously, once you have Joel out here you slow the game down a little bit and feed him the ball, you let him do his thing,\" Simmons said. \"But it's obviously different playing without him and trying to find a flow and to not really get that.\"\n\nPortland opened the second half on a 17-6 run to build a 76-62 lead. Maurice Harkless had consecutive dunks and CJ McCollum also had a dunk in that stretch. Jake Layman's dunk off an alley-oop pass from Lillard extended the lead to 99-80, and the Blazers were up 100-82 going into the fourth.\n\nThe Sixers never challenged in the final quarter, scoring more than two straight points only once after they were already down 21.\n\nPortland, which won at Brooklyn on Thursday night, has five more road games before returning home to play the Thunder on March 7.\n\n\"It's a long road trip,\" Kanter said. \"We are 2-0, but I think now we just learn from it and move forward. We know we can score the ball. For us to get to the next level, we have to do it on the defensive end.\"\n\nThe game was back and forth in the first half until the Blazers outscored Philadelphia 16-7 over the last four minutes of the second quarter to take a 59-56 halftime lead. Nurkic had 10 of the 16.\n\nTIP-INS\n\nTrail Blazers: Improved to 12-15 on the road. ... Kanter played in his second game with his team after being waived by the Knicks. ... G Evan Turner sat out because of left knee soreness. Turner was the No. 2 overall pick by Philadelphia in the 2010 NBA draft. ... Al-Farouq Aminu and McCollum each had 15 points.\n\n76ers: Fell to 24-8 at home. ... Veteran Amir Johnson played four minutes and scored two points, one day after volunteering to play for the Delaware Blue Coats of the G League because he hadn't appeared in a game since Jan. 26. ... JJ Redick shot 1 of 10.  ... Jimmy Butler had 15 points.\n\nUP NEXT\n\nTrail Blazers: Visit Cleveland on Monday night.\n\n76ers: Visit New Orleans on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994011.659198
}