{
  "game_id": "0021800467",
  "espn_id": "401071148",
  "date": "Dec 20, 2018",
  "matchup": "MIA vs. HOU",
  "headline": "Rockets lose Paul, Heat escape with 101-99 victory",
  "body": "MIAMI --  The plan for the Miami Heat on the game's final play was simple: Do not let James Harden win the game for Houston.\n\nDwyane Wade and the Heat pulled it off.\n\nWade ran at Harden and got him to give the ball up as the clock ran down, Eric Gordon missed a 3-pointer -- one that Wade said he tipped ever so slightly -- as time expired, and the Heat held off the Rockets 101-99 on Thursday night for their first three-game winning streak of the season.\n\n\"If somebody else hit it, we would deal with it,\" Wade said. \"But it wasn't going to be James Harden.\"\n\nHarden scored 35 for the Rockets, whose five-game winning streak was snapped. The worst part of the night for Houston, however, will likely be the loss of point guard Chris Paul in the second quarter to a strained left hamstring.\n\nAll the Rockets know, for now, is that Paul will miss time. He will undergo an MRI on Friday to determine the severity and likely timetable for returning.\n\n\"We lose a guy of the magnitude of Chris, now we're fighting again,\" Rockets coach Mike D'Antoni said. \"And the flaws that we have are going to come out again and we've got to overcome those.\"\n\nJosh Richardson scored 22 points and Tyler Johnson added 19 for the Heat, who were up by 16 early, then wasted an 11-point lead in the fourth before rallying.\n\nGordon's 3-pointer with 37 seconds left got Houston within two, and the Rockets got a stop on a long ensuing Heat possession. Wade missed, Hassan Whiteside got the offensive rebound and Wade wound up missing again, with the Rockets finally corralling the ball with 3.8 seconds left.\n\nThe last play eventually went to Gordon, and his 3 -- Houston's 54th attempt of the night from beyond the arc -- was off, and Miami escaped. The Heat are 4-4 this season when shooting under 40 percent; the rest of the NBA, combined, is 9-103 in such games.\n\n\"Our identity is trying to make it ugly,\" Tyler Johnson said. \"A lot of teams aren't used to that.\"\n\nDerrick Jones Jr. scored 15 for Miami, which got 11 from James Johnson and 10 from Wade. Gordon scored 20 for the Rockets, who got 14 from PJ Tucker and 10 from Danuel House Jr.\n\nThe Rockets set an NBA record with 26 makes from 3-point range in Washington on Wednesday, and connected on another 18 in this one. The 44 made 3s in a two-game span are second-most in NBA history over such a stretch -- Houston made 46 in a two-game stretch of the 2016-17 season -- and are the most ever posted in consecutive days.\n\nBut in this one, the Rockets needed one more.\n\n\"In those situations you've always got to be ready and I've hit those shots many of times,\" Gordon said. \"It just didn't go in for me.\"\n\nHouston led by 16 early, then used a 13-1 run to erase an 11-point deficit in the fourth.\n\nTyler Johnson got a layup to snap Miami's six-minute field-goal drought, then blocked a layup try by Harden and followed that with a 3 for a four-point edge. And with 1:20 left, Wade used the same move he's used for 16 seasons -- the shot fake on the wing -- to induce Gordon into a foul that he turned into two free throws for a 101-96 lead.\n\nTIP-INS\n\nRockets: Houston led 45-38 when Paul went to the locker room. ... Houston is 1-7 this season when Paul and Harden aren't together, and going back to last season the Rockets have lost nine in a row when Paul isn't on the floor. ... Harden had 12 assists, and was 15 for 18 from the foul line.\n\nHeat: Justise Winslow (sore right ankle) didn't play. ... The Heat held Houston to 35 percent shooting and outrebounded the Rockets 62-41.\n\nSTREAK ENDS\n\nWhiteside didn't record a blocked shot, ending a 26-game streak going back to last season.\n\nKNIGHT HOMECOMING\n\nHouston's Brandon Knight was born in Miami and played his high school ball in nearby Fort Lauderdale. Thursday marked his first appearance in an NBA game at Miami since March 2, 2015. Knight didn't play last season after tearing his ACL in a summer pro league game at Miami in July 2017.\n\nUP NEXT\n\nRockets: Host San Antonio on Saturday.\n\nHeat: Host Milwaukee on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995253.396283
}