{
  "game_id": "0021900184",
  "espn_id": "401160826",
  "date": "Nov 17, 2019",
  "matchup": "SAC vs. BOS",
  "headline": "Kings snap Celtics' 10-game winning streak",
  "body": "SACRAMENTO, Calif. -- The Boston Celtics were an unlucky bounce away from extending an historic start to their season.\nInstead, the Sacramento Kings walked away with a huge victory.\nBuddy Hield scored a season-high 35 points, Richaun Holmes hit two free throws with 13.3 seconds remaining to give Sacramento the lead, and the Kings snapped the Celtics' 10-game winning streak with a 100-99 victory Sunday.\nMarcus Smart had a chance to win it for Boston, but his runner in the lane bounced around the rim before trickling off as the buzzer sounded.\n\"The ball just felt like it sat on the rim forever,'' Smart said. \"I thought it was going in. I think everybody thought it was going in and it just rolled out. It was just one of those games.''\nThe Celtics (10-2) lost for the first time since their Oct. 23 opener at Philadelphia. The only other team in NBA history to drop its opener and then rattle off 10 consecutive wins was the 1979-80 Milwaukee Bucks.\nHarrison Barnes had 13 points and Bogdan Bogdanovic added 12 points and 10 assists for the Kings (5-7), who lost a similarly close game two nights earlier to the Lakers in Los Angeles.\nHield hit seven 3-pointers and finished just two points off his career high. But Kings coach Luke Walton was most fired up about Hield's defense on a day Sacramento held Boston to 42% shooting (34-for-82) and just 18 points in the first quarter.\n\"Buddy obviously was spectacular,'' Walton said. \"We all know he can score, and he's going to have nights like this. But I thought he was so committed to the team winning. The way he was defending, just his all-around game.''\nJaylen Brown scored 18 points and Kemba Walker had 15 for Boston. Jayson Tatum and Daniel Theis each added 14.\nDown four to start the second half, the Celtics outscored the Kings 29-21 in the third quarter to take a 75-71 advantage entering the fourth.\nWith 13 seconds remaining and Boston up 99-98, Holmes and Smart went to the floor battling for a rebound and Smart was called for a foul that set up Holmes for the free throws.\nCeltics coach Brad Stevens challenged the foul call but it was upheld upon a replay review.\nTIP-INS\nCeltics: Tatum came in having scored 20-plus points in seven of the first 11 games. He had just four over the first three quarters Sunday. In the fourth, he did convert a three-point play and drilled a 3-pointer during a sequence that gave Boston a 93-88 lead.\nKings: Before the game, Walton didn't offer much reaction to the NBA announcing that a key foul on Barnes on Friday, which sent LeBron James to the line to sink two free throws that helped the Lakers pull out the win, should have been called an offensive foul on James. \"I don't care, I don't look at it,'' Walton said. \"Our mindset is 'What's next? What are we doing next?'''\nYOU FORGOT SOMETHING\nKings center Dewayne Dedmon checked into the game in the first quarter and took the court, only to realize he hadn't removed his warm-up pants. Dedmon quickly discarded them and enjoyed a nice game off the bench with seven points, four rebounds and a block.\nBOGDANOVIC'S BIG DAY\nWith point guard De'Aaron Fox out with a severe ankle sprain, Bogdanovic takes on a more crucial role in Sacramento's backcourt. Along with his 12 points and 10 assists, he didn't commit a single turnover in 31 minutes.\nUP NEXT\nCeltics: Boston continues its four-game road swing through the West with a Monday night matchup at Phoenix.\nKings: Sacramento returns to the court Tuesday to host the Suns, who will be on the second night of a back-to-back stretch.",
  "source": "espn_api",
  "crawled_at": 1764996419.574239
}