{
  "game_id": "0022400691",
  "espn_id": "401705257",
  "date": "Feb 01, 2025",
  "matchup": "SAC @ OKC",
  "headline": "Wiggins scores career-high 41 and Thunder outrebound Kings 70-37 in 144-110 rout",
  "body": "OKLAHOMA CITY -- — Aaron Wiggins had a career-high 41 points and 14 rebounds, and the Oklahoma City Thunder rolled past the Sacramento Kings 144-110 on Saturday night.\n\n\r\n              Shai Gilgeous-Alexander added 29 points and nine assists for the Thunder (38-9), who set a season best for points and rebounds (70), including 14 by center Isaiah Hartenstein, 13 by Jaylin Williams and 11 by Kenrich Williams.\n\n\r\n              Wiggins, starting in place of injured forward Jalen Williams, made 16 of 30 field goal attempts and shot 6 of 14 on 3-pointers. He scored 14 points in the fourth quarter. \n\n\r\n              Lu Dort had 20 points and eight rebounds for Oklahoma City, which scored 82 points in the first half to take control.\n\n\r\n              De’Aaron Fox had 20 points for the Kings (24-24). Malik Monk added 19 points and seven assists, and DeMar DeRozan scored 17. \n\n\r\n              Gilgeous-Alexander had 23 points in the first half to help Oklahoma City build an 82-55 halftime lead. The 82 points were the most scored by the Thunder in one half this season and fell one point short of a team record for any half.\n\n\r\n              Oklahoma City led 36-31 after one period and then outscored the Kings 46-24 in the second. The lead grew to 30 on a 3-pointer by Dort early in the third.\n\n\r\n              Takeaways\r\n              Kings: All five starters scored in double figures, but Sacramento went just 11 of 44 on 3s (25%). \n\n\r\n              Thunder: Oklahoma City played without Jalen Williams, an All-Star selection, and guard Alex Caruso but still outrebounded and outshot the Kings.\n\n\r\n              Key moment\r\n              Sacramento cut the deficit to 53-44 on a layup by Domantas Sabonis, but Oklahoma City went on a 29-11 run to make it 82-55 at the break.\n\n\r\n              Key stat\r\n              Oklahoma City had a 70-37 rebounding edge.\n\n\r\n              Up next\r\n              The Kings visit Minnesota on Monday. The Thunder host Milwaukee on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997328.122858
}