{
  "game_id": "0022000840",
  "espn_id": "401307636",
  "date": "Apr 15, 2021",
  "matchup": "MIL @ ATL",
  "headline": "Giannis returns, Bucks cool off surging Hawks 120-109",
  "body": "ATLANTA -- — Giannis Antetokounmpo scored 15 points in his return to the Milwaukee lineup and got plenty of help from his teammates as the Bucks cooled off the surging Atlanta Hawks 120-109 Thursday night.\n\n\r\n                    Antetokounmpo had missed six games with an ailing left knee before getting cleared to play in Atlanta, where he starred in the NBA All-Star Game last month.\n\n\r\n                    He played 25 minutes in his return, hitting 7 of 12 shots to go along with five rebounds, three steals, two assists and a block. He didn't have to carry too much of a load as the Bucks put seven players in double figures, led by Jrue Holiday with 23 points.\n\n\r\n                    “Watching this team play six games, I realize this team is really, really good,” Antetokounmpo said. “I just want to help as much as I can.”\n\n\r\n                    While the Bucks had won their last two games without Antetokounmpo, they were thrilled to have him back on the court.\n\n\r\n                    “He's our best player,” Holiday said. “That's the caliber of team we want to be, especially now going into the end of the season. Seeing Giannis out there, he's so dominant, he attracts so many people. He makes the game easier for everybody else.”\n\n\r\n                    The Hawks got as close as 113-105 with just over two minutes remaining, but the Bucks sealed the victory with a sequence in which they claimed three straight offensive rebounds, the last leading to a put-back dunk by Brook Lopez. \n\n\r\n                    Pat Connaughton finished off Atlanta with a 3-pointer.\n\n\r\n                    Bogdan Bogdanovic led the Hawks with 28 points, hitting six 3-pointers. Trae Young returned after missing two games with a calf injury but had a terrible night, connecting on just 3 of 17 shots. \n\n\r\n                    “That was the key to the game plan,” said Holiday, one of those charged with guarding the Atlanta star. “I think we did a pretty good job of not giving him any easy, open looks.”\n\n\r\n                    The Hawks lost for only the sixth time in 22 games since Nate McMillan took over as interim coach.\n\n\r\n                    Antetokounmpo added another good memory from State Farm Arena. He was MVP of the All-Star Game, hitting all 16 of his shots for 35 points — the most baskets without a miss in the history of the midseason showcase.\n\n\r\n                    The Bucks stretched their lead for third place in the Eastern Conference to 5 1/2 games over the fourth-place Hawks.\n\n\r\n                    “We ran into a team with championship ambitions,” said Solomon Hill, who scored 18 points for Atlanta.\n\n\r\n                    Milwaukee led by as many as 14 in the first half, settling for a 64-52 edge at the break.\n\n\r\n                    Getting hot from long range, Atlanta quickly erased the deficit in the third. Bogdanovic knocked down a 3-pointer to put the Hawks ahead 74-73 near the midway point of the period — Atlanta's first lead since the opening minutes.\n\n\r\n                    But, in a game of spurts, Milwaukee quickly regained the momentum and pushed the margin at the end of the third to exactly where it stood at halftime, 94-82. \n\n\r\n                    The Bucks wrapped up a stretch in which they played nine of 10 on the road.\n\n\r\n                    SQUANDERED CHANCE\n\n\r\n                    The Hawks, who last made the playoffs in 2017, were eager to show how much improvement they've made this season — especially making a rare appearance on national television.\n\n\r\n                    They looked a bit blinded by the TNT spotlight.\n\n\r\n                    “It's our first time really understanding the moment and the implications that it has,” Hill said. “We just lacked it.”\n\n\r\n                    While the Hawks are fourth in the tightly bunched East, Hill noted they could easily drop back to a spot that would force them to take part in the play-in tournament ahead of the playoffs.\n\n\r\n                    “We need these games,” he said “It's going to be a dogfight all the way through.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Lopez had 19 points and 12 rebounds. ... Connaughton made four 3-pointers and finished with 14 points. ... Milwaukee had a 58-46 edge on the boards.\n\n\r\n                    Hawks: F Danilo Gallinari missed his third straight game with a foot injury. ... Atlanta also played again without John Collins, De'Andre Hunter and Cam Reddish, all out with longer-term injuries. ... C Clint Capela had 16 points and 16 rebounds, but no other Hawks player had more than six rebounds. \n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Return to Milwaukee on Saturday for just their second home game in the past three weeks. They will host the Memphis Grizzlies to start a four-game homestand..\n\n\r\n                    Hawks: Host the Indiana Pacers on Sunday.\n\n\r\n                    ------\n\n\r\n                    Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 His work can be found at https://apnews.com/search/paulnewberry\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997381.960114
}