{
  "game_id": "0021600013",
  "espn_id": "400899415",
  "date": "Oct 26, 2016",
  "matchup": "LAL vs. HOU",
  "headline": "Young Lakers roar past Rockets 120-114 to win Walton's debut",
  "body": "LOS ANGELES --  Before his official head coaching debut, Luke Walton cautioned the Los Angeles Lakers about the long, difficult road from the start of this rebuilding season to sustained success.\n\n\"The outcome is less of a concern than how we play, and how we get after it,\" Walton said.\n\nAlthough these young Lakers won't be judged by wins and losses, their first victory together still felt awfully sweet.\n\nJordan Clarkson scored 12 of his 25 points in the fourth quarter, and the Lakers held off the Houston Rockets 120-114 on Wednesday night to win Walton's debut.\n\nD'Angelo Russell scored 20 points and Julius Randle added 18 points, seven rebounds and six assists as the Lakers got off to an exciting start in the franchise's first season without Kobe Bryant since 1995. With a revamped roster coming off the worst season in the 16-time champion team's history, Los Angeles surged in the fourth quarter while the Rockets tired.\n\n\"It wasn't pretty, but it got the job done,\" Russell said. \"Everybody did their part tonight, and it showed in the results.\"\n\nThe Lakers played an up-tempo offensive game under the 36-year-old Walton, and nobody seized the moment better than Clarkson, who came off the bench in his first game since signing a $50 million contract. His 3-pointer put Los Angeles up 116-112 with 1:48 left, and the Lakers hung on while the Rockets missed a series of open shots in the final minute.\n\nJames Harden had 34 points, a career-high 17 assists and eight rebounds for the Rockets, who lost in former Lakers coach Mike D'Antoni's debut on the Houston bench. The Rockets missed 15 of their 16 3-point attempts in the second half on admittedly weary legs.\n\n\"I told them, `Look, the only thing that's been determined tonight is we're not going to win 82 games,\" D'Antoni said. \"We know that. You just throw it away and go to the next one. It's a marathon, a long time, and our legs will come to us.\"\n\nAfter matching the franchise record with 14 first-half assists, Harden tied his career high with his 16th early in the third quarter. The Los Angeles native managed only six points in the fourth quarter, going 1 for 5, and his teammates were a combined 5 for 16.\n\n\"We were scoring so easily that we just didn't get stops,\" Harden said. \"It gave them confidence early in the game to where they made shots at the end. But we're not going to get down.\"\n\nFIRST TIMES\n\nBrandon Ingram scored nine points in the No. 2 pick's debut for the Lakers. Timofey Mozgov had 12 points and eight rebounds, and Luol Deng had seven points in solid Lakers debuts for the veteran free agents.\n\nIngram got a loud ovation when he checked in for his debut midway through the first quarter. The lanky wing scorer's first NBA basket was a 3-pointer from the corner near the Lakers' bench with the shot clock winding down.\n\nLUKE'S DEBUT\n\nAfter leading the Golden State Warriors to a 39-4 start last season while filling in for Steve Kerr, Walton finally has an actual game on his coaching record. His wins in Oakland were attributed to Kerr, but Walton captured the attention of the NBA and the Lakers, who brought him back to the city where he won two NBA title rings as a player.\n\nHall of Famer Bill Walton proudly wore a purple Lakers T-shirt to his son's big night. Walton's mother and three brothers also attended the game. \"The Walton force will be strong tonight,\" Luke said.\n\nD'ANTONI RETURNS\n\nThe Lakers fired D'Antoni after he went 27-55 in 2013-14, the first of a franchise-record three straight non-playoff seasons. When D'Antoni was asked before the game about reflecting on his time in LA, the coach quickly quipped: \"I try not to. ... No, I loved it. I actually did.\"\n\nTIP-INS\n\nRockets: Eric Gordon scored 19 points. ... Clint Capela, the 6-foot-9 Swiss forward, replaced Dwight Howard in the middle of the lineup with 16 points and nine rebounds.\n\nLakers: Metta World Peace began his 17th NBA season, picking up three fouls in his first two minutes while guarding Harden. ... Jack Nicholson, Denzel Washington, director Peter Berg, YG, Kendall Jenner, Karlie Kloss, Dodgers president of baseball operations Andrew Friedman and NBA Commissioner Adam Silver attended the game.\n\nUP NEXT\n\nRockets: At Dallas on Friday in the opener of a home-and-home series.\n\nLakers: Open a four-game road trip at Utah on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995455.3202
}