{
  "game_id": "0021500831",
  "espn_id": "400828718",
  "date": "Feb 21, 2016",
  "matchup": "LAL @ CHI",
  "headline": "Bulls beat Lakers 126-115 to spoil Kobe's Chicago farewell",
  "body": "CHICAGO -- Pau Gasol said it was special to face Kobe Bryant one last time on Sunday night.\nAnd even better to win the final matchup against his former teammate.\n\"Without a question,\" Gasol said. \"It's always better to win.\"\n\nDerrick Rose and E'Twaun Moore had 24 points apiece to lead the Chicago Bulls to a 126-115 victory over the Los Angeles Lakers in Bryant's final game at the United Center.\nMoore, who was 10 for 14 from the field, tied his career high. Gasol had 21 points, Mike Dunleavy and Bobby Portis each scored 17 and Doug McDermott added 16 as the Bulls won their second straight.\nBryant finished with 22 points on 8-for-20 shooting in 27 minutes.\n\"Not many players have played 20 years in this league, especially as aggressive as he plays every night,\" Gasol said.\nThe Bulls played a video tribute to Bryant as the Lakers' starters were introduced. Rose referred to Bryant as his generation's Michael Jordan, and the salute ended with Gasol introducing his former Los Angeles teammate.\nBryant received a standing ovation and the crowd broke into a \"Kobe! Kobe!\" chant.\nHe has received similar tributes in other cities during his farewell tour, but said this one was different because it's where Jordan, his idol, played for so long.\n\"It's always been different from the first time I played here,\" Bryant said. \"There's such an air. You can feel the electricity in the building, to feel the championships and the history.\"\nEarly in the third quarter, Bryant hit back-to-back jumpers to tie the score at 66. Gasol answered with a 3-pointer to spark a string of eight straight points for a 74-66 Chicago lead.\nThe Bulls had a 98-81 lead at the end of the third quarter and stretched it to 100-81 in the opening minute of the fourth.\nBryant started the period on the bench and the United Center fans -- sensing he might not return -- chanted his name on a few occasions.\nBefore Bryant returned, Los Angeles made a run, cutting the lead to 108-105 on Nick Young's 3-pointer midway through the fourth. The Lakers, though, couldn't get any closer.\nBryant returned with 3:08 remaining and the score 117-110. He left with 45.3 seconds left and the Bulls up 124-113.\nAfter the game, Bryant said it was strange watching Gasol introduce him because he thought they would retire together on the same team.\n\"That's the last time I'm going to face him,\" Bryant said. \"That's weird ... unless we play pick-up ball in Barcelona somewhere.\"\nTIP-INS\nLakers: F Anthony Brown (sprained right ankle) missed his third straight game. ... Bryant played with a dislocated middle finger on his right hand. \"It's a little numb but I still feel the ball pretty well,\" he said.\nBulls: Jimmy Butler (sprained left knee) and Nikola Mirotic (appendicitis) are still at least two weeks from returning to action, according to coach Fred Hoiberg. \"He's still not able to do much running; he still has pain in that abdomen,\" Hoiberg said of Mirotic.\nCHICAGO MEMORIES\nBefore the game, Bryant was asked what stands out from the games he played in the United Center against Jordan.\n\"Getting schooled for a baseline dunk the first time I faced him,\" Bryant said, referring to a game during his rookie season in 1996. \"That was pretty cool. It really was. I knew he was going to do it because I had seen him do it so many times. But the timing is different on TV and in the game.\"\nLAST FLIGHT?\nDuring the game, Bryant said a fan sitting courtside yelled at him to \"give me one dunk.\"\n\"I said, `Dude, if I could I would,\" Bryant said.\nNEW STARTER\nLakers rookie D'Angelo Russell moved back into the starting lineup and coach Byron Scott said after the game Russell will start the rest of the season.\nUP NEXT\nLakers: Visit the Milwaukee Bucks on Monday.\nBulls: Host the Washington Wizards on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994260.934046
}