{
  "game_id": "0022400873",
  "espn_id": "401705439",
  "date": "Mar 02, 2025",
  "matchup": "MIN @ PHX",
  "headline": "Edwards scores 44 points, Randle adds 20 in return to help the Timberwolves beat the Suns 116-98",
  "body": "PHOENIX -- — Anthony Edwards scored 44 points, Julius Randle added 20 in his first game since missing more than a month with an injury and the Minnesota Timberwolves beat the Phoenix Suns 116-98 on Sunday night.\n\n\r\n              Edwards scored 17 points in the third quarter as the Timberwolves took control, turning a two-point halftime deficit into a 83-72 lead heading into the fourth. Minnesota never trailed in the final quarter, winning for just the third time in the past nine games.\n\n\r\n              Donte DiVincenzo scored 24 points on eight 3-pointers. Randle was in the lineup for the first time since Jan. 30 after missing 13 games with a right groin strain.\n\n\r\n              The sliding Suns have lost 11 of their last 14. Kevin Durant led the team with 26 points.\n\n\r\n              Phoenix led for nearly the entire first half and took a 51-49 advantage into halftime. Randle led all scorers with 16 points while Devin Booker had 12 for the Suns and finished with 17.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota has struggled over the past few weeks but Randle's return helped spark a quality road victory. The Timberwolves look poised to make a move in the Western Conference playoff race with the No. 6 seed there for the taking.\n\n\r\n              Suns: It's more of the same for the Suns, who had a full roster of healthy players and still couldn't beat another playoff-caliber team. Phoenix needs a minor miracle to make the playoffs at this point and it doesn't look like one is coming.\n\n\r\n              Key moment\r\n              Randle dunked over Suns rookie Ryan Dunn and then Dunn threw away the ensuing inbounds pass, which was stolen by Jaden McDaniels who scored an easy layup. The two buckets gave the Timberwolves a 95-78 lead with 8:21 left.\n\n\r\n              Key stat\r\n              Minnesota scored 40 points off of 22 Phoenix turnovers.\n\n\r\n              Up next\r\n              Timberwolves host the 76ers on Tuesday; Suns host the Clippers on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998083.208717
}