{
  "game_id": "401809936",
  "espn_id": "401809936",
  "date": "Oct 22, 2025",
  "matchup": "BOS vs PHI",
  "headline": "Maxey scores 40 points as 76ers rally to beat Celtics 117-116",
  "body": "BOSTON -- — Tyrese Maxey scored 40 points and VJ Edgecombe added 34 in his NBA debut to help the Philadelphia 76ers rally to beat the Boston Celtics 117-116 in their season opener Wednesday night. \n\n\r\n              Edgecombe scored the most points in an NBA debut since Wilt Chamberlain had 43 on Oct. 24, 1959.\n\n\r\n              Philadelphia led by four with 22 seconds left, but it was down to one when Edgecombe missed a pair of foul shots with 9.1 seconds to play. Payton Pritchard had two shots for the winner and missed both.\n\n\r\n              Joel Embiid played for the first time since February, scoring four points on 1-of-9 shooting. The 2023 NBA MVP and a two-time league scoring champion had six rebounds in 20 minutes as he returns after a 2024-25 season when he was limited to 19 games because of a sprained left foot, a sinus fracture and arthroscopic surgery on his left knee.\n\n\r\n              Jaylen Brown returned from a hamstring injury in the preseason finale to score 25 points. The 2024 NBA Finals MVP is expected to carry a heavier load this year with fellow All-Star Jayson Tatum, who watched the game from the bench in street clothes, recovering from a ruptured Achilles tendon.\n\n\r\n              Derrick White scored 13 points of his 25 points in the third quarter, when the Celtics scored 16 straight points to turn a five-point deficit into an 11-point lead. The Celtics led 94-84 with nine minutes remaining before the Sixers scored eight straight points to make it close. \n\n\r\n              Up next\r\n              76ers: Host Charlotte on Saturday. \n\n\r\n              Celtics: At New York on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042478.6150908
}