{
  "game_id": "0022400280",
  "espn_id": "401704846",
  "date": "Nov 25, 2024",
  "matchup": "ATL vs. DAL",
  "headline": "Kyrie Irving's big second half leads Mavericks past Hawks 129-119",
  "body": "ATLANTA -- — Kyrie Irving had 32 points, six assists and seven rebounds, and the Dallas Mavericks beat the Atlanta Hawks 129-119 on Monday night without star Luka Doncic.\n\n\r\n              Jaden Hardy had a season-high 23 points in his first start of the season for Dallas, which has won five of six. Naji Marshall and Spencer Dinwiddie had 22 points each.\n\n\r\n              Irving had 10 points at halftime after being stifled by Hawks guard Dyson Daniels but heated up in the second half, including a stretch where he hit five consecutive field goals.\n\n\r\n              Doncic missed his third straight game with a right wrist strain.\n\n\r\n              Jalen Johnson had 28 points and 10 rebounds for the Hawks, who have lost four of five. Trae Young had 18 points and 16 assists.\n\n\r\n              Takeaways\r\n              Mavs: Dallas lost in overtime at Miami on Sunday night and is in the middle of a 15-game stretch that includes 11 away games. Klay Thompson (plantar fascia) and Quentin Grimes (illness) also sat. Still, they had enough to win without Doncic, who scored 73 points in the Mavs' lone visit to Atlanta last season.\n\n\r\n              Hawks: After a series of early-season injuries, the Hawks had a full complement of players and two days of rest, but they still couldn't get past a team that was playing the second half of a back-to-back.\n\n\r\n              Key moment\r\n              Irving scored 14 points in a three-minute stretch in the fourth quarter, during which the Mavs went from trailing 104-103 to leading 118-109.\n\n\r\n              Key stat\r\n              Marshall and Hardy, late additions to the starting lineup for the Mavs, combined for 45 points and nine rebounds.\n\n\r\n              Up next\r\n              The Hawks will face the NBA-best Cavaliers in their next two games — at Cleveland on Wednesday and at Atlanta on Friday. The Mavs will host the New York Knicks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997956.243444
}