{
  "game_id": "0021800453",
  "espn_id": "401071134",
  "date": "Dec 18, 2018",
  "matchup": "LAL @ BKN",
  "headline": "Nets hold off Lakers to extend winning streak to 6 games",
  "body": "NEW YORK --  LeBron James and the Los Angeles Lakers were rallying, trying to send themselves home on a winning note.\n\nThe hottest team in the NBA wouldn't allow it.\n\nThe Brooklyn Nets ran their longest winning streak in nearly four years to six games with a 115-110 victory Tuesday night, emphatically stopping James on his first shot and then holding him off down the stretch.\n\nD'Angelo Russell had 22 points and a career high-tying 13 assists against his former team as Brooklyn continued its recovery from an eight-game skid by hanging on in front of a loud, large sellout crowd of 17,732 that alternated cheering when the Lakers seized the momentum and when the Nets regained it.\n\n\"It's a great feeling,\" Russell said. \"I personally have never been in that position at this level to win six in a row. Definitely not satisfied.\"\n\nJames bounced back from his lowest-scoring game of the season with 36 points, 13 rebounds and eight assists, but the Lakers finished 1/3 on their road trip. Kyle Kuzma had 22 points and 11 rebounds, while Lonzo Ball scored 23.\n\n\"We could've had a pretty good road trip but 1/3 is definitely not the way we would like to have it,\" James said.\n\nJoe Harris added 19 points and Spencer Dinwiddie scored 18 for the Nets, who last won six in a row from March 25 to April 3, 2015. Rondae Hollis-Jefferson finished with 17 points and Jared Dudley made some big baskets down the stretch to score 13.\n\n\"It's amazing, man,\" Hollis-Jefferson said. \"Just to see the hard work we put in, all the resiliency we had, it's amazing to be able to say we put together some wins.\"\n\nBrooklyn led 100-87 with 7 1/2 minutes to play before back-to-back 3-pointers by Kuzma and Ball. James then scored inside, blocked a shot on the other end and scored again to make it 100-97.\n\nDudley and Dinwiddie answered with drives, and Dudley hit two more baskets to settle the Nets before Russell's 3-pointer made it 113-107 with 22 seconds remaining.\n\nThe Nets had scored 70 points in the first halves of their last two games, and were almost on pace in this one after taking a 33-32 lead after one quarter. They led 62-57 at halftime.\n\n\"That's why this team has won six games in a row. They have a lot of different guys that can hurt you,\" Lakers coach Luke Walton said.\n\nBrooklyn then used a 12-0 run to take its largest lead at 79-65 on Hollis-Jefferson's three-point play with 7:27 remaining in the third quarter. The Nets led 90-83 going to the fourth.\n\nJames was limited to 13 points on 5-of-16 shooting in a loss to Washington on Sunday and things started rough for him in this one, as Jarrett Allen denied his attempt at a dunk with a sensational block.\n\n\"He's in his 20s, I'm in my 30s,\" James said. \"Takes me a little longer to get warmed up.\"\n\nJames was called for traveling the next time he had the ball before finding his groove.\n\nTIP-INS\n\nLakers: JaVale McGee missed his second straight game with flu-like symptoms. ... The Lakers were 5 of 6 from 3-point range in the first quarter, with Ball going 3 of 3. Then they went 1 for 10 in the second.\n\nNets: G Allen Crabbe missed his third straight game because of a sore right knee. ... The Nets snapped an eight-game skid against West teams with their first win since Nov. 9 at Denver.\n\nHELP ON THE WAY\n\nRajon Rondo (right hand surgery) and Brandon Ingram (sprained left ankle) were recalled from the South Bay Lakers, where they were on rehab assignments. Walton said Ingram was still limited at practice Tuesday but Rondo wasn't, adding the hope was that both could go full speed when they rejoin the Lakers in practice on Thursday.\n\nRondo has missed 17 games and Ingram has sat out seven.\n\nSINGING STRUGGLES\n\nBritish singer and actress Cynthia Erivo struggled through her performance of the national anthem. She appeared to forget the words at one point and stopped singing. After pausing to refocus, she began again from the start of the song, got the same word wrong she did the first time and then skipped a couple of lines. But the crowd was supportive of her strong finish and gave her a nice ovation afterward.\n\nUP NEXT\n\nLakers: Host New Orleans on Friday.\n\nNets: Visit Chicago on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995013.787935
}