{
  "game_id": "0022401165",
  "espn_id": "401705731",
  "date": "Apr 09, 2025",
  "matchup": "SAC vs. DEN",
  "headline": "Jokic has 32nd triple-double to lead Nuggets past Kings 124-116 in Denver's 1st game without Malone",
  "body": "SACRAMENTO -- — Nikola Jokic had his 32nd triple-double of the season with 20 points, 12 rebounds and 11 assists and Denver beat the Sacramento Kings 124-116 on Wednesday night in the Nuggets' first game since head coach Michael Malone was fired.\n\n\r\n              Christian Braun scored 25 points and Aaron Gordon and Michael Porter Jr. each had 21 points to help Denver end a four-game losing streak and complete a season series sweep of Sacramento.\n\n\r\n              With two regular-season games remaining, the Nuggets (48-32) are tied with the Clippers for the No. 4 playoff seed in the Western Conference.\n\n\r\n              Malone, the winningest coach in franchise history who guided the Nuggets to their only NBA championship in 2023, was fired Tuesday along with general manager Calvin Booth. David Adelman is serving as Denver's interim coach.\n\n\r\n              Zach LaVine had 27 points and 11 assists for the Kings, whose three-game winning streak ended. DeMar DeRozan added 22 points for Sacramento, which holds the No. 9 spot in the West.\n\n\r\n              The Nuggets led by 16 before the Kings made a run and got within 113-108 on Keon Ellis' jumper with 2½ minutes remaining. Jalen Pickett made a mid-range jumper for Denver and Jokic made two free throws to help secure the win.\n\n\r\n              Key moment\r\n              The Nuggets closed the first half on a 13-5 run and then began the third quarter with a 18-10 spurt to sustain their momentum.\n\n\r\n              Key stat\r\n              Denver starters Braun (16), Porter (14), Gordon (14) and Jokic (10) combined for 54 of the Nuggets’ 66 points in the first half.\n\n\r\n              Up next\r\n              The Kings host the Clippers on Friday, and the Nuggets face the Grizzlies in Denver on Friday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997301.27976
}