{
  "game_id": "0022400123",
  "espn_id": "401704689",
  "date": "Oct 30, 2024",
  "matchup": "CHI vs. ORL",
  "headline": "Bulls hold on to beat Magic 102-99 after both teams struggle in 4th quarter",
  "body": "CHICAGO -- — Coby White scored 21 points, Josh Giddey added 20 and the Bulls beat the Magic 102-99 on Wednesday night.\n\n\r\n              Nikola Vucevic added 18 points and 14 rebounds in Chicago's second-straight win.\n\n\r\n              Paolo Banchero scored 31 points for Orlando two days after scoring 50 against the Pacers, but it wasn't enough. Jalen Suggs, who missed a fading jump shot in the final seconds, had 17.\n\n\r\n              The Bulls shot 3 for 15 in the fourth quarter but held on after Orlando shot 4 for 22 in the final quarter. Both teams combined for 28 points in the fourth.\n\n\r\n              The Magic led by as many as 20 points in the first half, but Chicago came back with a 12-3 run late in the second quarter. Banchero had 20 in the first half to help the Magic take a 62-52 lead to intermission.\n\n\r\n              Takeaways\r\n              Magic: Forward Franz Wagner left the game early in the fourth quarter due to illness and never returned. It seemed to hamper Orlando near the basket at both ends of the floor.\n\n\r\n              Bulls: Chicago missed point guard Lonzo Ball as he recovers from a wrist injury. Most of the Bulls' 15 turnovers came on entry passes or at the top of the circle.\n\n\r\n              Key moment\r\n              The Bulls led 98-97 in the final minute before Giddey found Patrick Williams at the top of the key. The forward knocked down the 3-pointer to make it a two-possession game, securing the win for Chicago.\n\n\r\n              Key stat\r\n              The Bulls and Magic went over seven minutes without a made field goal in the fourth quarter. Ayo Dosunmu's 2-pointer broke the dry spell for Chicago.\n\n\r\n              Up next\r\n              The Magic continues its five-game trip at Cleveland on Friday, the same night the Bulls visit the Nets.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997117.068871
}