{
  "game_id": "0021400667",
  "espn_id": "400578959",
  "date": "Jan 25, 2015",
  "matchup": "LAL vs. HOU",
  "headline": "James Harden gets 37, Rockets rout spiraling Lakers 99-87",
  "body": "LOS ANGELES -- After James Harden lit up the Los Angeles Lakers for the first three quarters, he returned in the final minutes to keep the Houston Rockets focused on their finish.\nKobe Bryant used to do that job for the Lakers, and they might find out Monday whether he'll do it again this year.\nHarden had 37 points and eight rebounds, and the Rockets rolled to a 99-87 victory without Dwight Howard on Sunday night, sending Los Angeles to its eighth straight defeat.\nHarden hit four 3-pointers, and the NBA's leading scorer added five assists in the Rockets' third victory in four games. He thought he had earned an early night off, but didn't mind returning to the court after Los Angeles trimmed a 25-point lead to 11 in the final minutes.\n\n\"It's my job to be not only a scorer, but a facilitator,\" said Harden, who scored at least 33 points in his fourth straight game. \"Make sure everybody is happy, getting good shots. We've got to do a better job closing out games. It's definitely getting there. We're more than capable of being the best defensive team in the league, but we've got to focus on it every game.\"\nJosh Smith and Jason Terry had 11 points apiece as Houston cruised to its fourth straight road victory over the Lakers even without Howard, who sat out after injuring his right ankle two days ago.\n\"I thought in the first half, we ran a lot more,\" Houston coach Kevin McHale said. \"I think our focus kind of waned later on in the game.\"\nCarlos Boozer scored 18 points for the Lakers, who are on their longest losing streak in nearly 10 years.\nThe Lakers weren't terribly competitive until the fourth quarter of their latest game without Bryant, who could be out for the season after tearing his right rotator cuff last week.\nLos Angeles, which committed 21 turnovers and went 1 for 13 on 3-pointers, hadn't lost eight straight games since March 2005. The Lakers missed the playoffs that season for the only time in Bryant's career before last year.\n\"The effort, that hasn't been an issue,\" coach Byron Scott said. \"The turnovers, that has been an issue. When we're turning the ball over at that high of a rate, we're not giving ourselves a chance.\"\nThe Lakers could find out Monday whether Bryant needs season-ending surgery. Scott hasn't given up optimism for an eventual return by the third-leading scorer in NBA history.\n\"I think we all hold out hope that it goes well, (and) they say he doesn't need surgery or anything like that,\" Scott said. \"Maybe rehabilitation for a few weeks or a month or whatever the case may be. But that's the positive part of me hoping that happens.\"\nTIP-INS\nRockets: Joey Dorsey started in Howard's place, scoring four points. ... McHale is uncertain when Howard will return to the lineup. At least his absence spared him the relentless booing he'll likely face from Lakers fans for the rest of his career after he spurned the club in free agency in 2013. ... Harden is a Los Angeles native who attended Artesia High School.\nLakers: Scott showed up slightly late to Staples Center after forgetting that the Lakers' Sunday game time is an hour earlier than every other night. The 53-year-old coach claimed he \"had a senior moment.\" ... Rookie big man Tarik Black, who was waived by Houston last month, had three points and five rebounds for the Lakers. He had missed the last two games with a sprained right ankle.\nSWAGGY SAD\nNick Young played just nine minutes for the Lakers and went scoreless, getting benched for the entire second half. The entertaining shooting guard gave an unsatisfactory answer to a halftime question about a defensive assignment from Scott, who said Young \"looked to me like he didn't want to be here.\" Young hadn't played in a game without scoring since he joined his hometown team before last season. Young left Staples Center without speaking to reporters.\nPOINT GUARD POP\nRookie Jordan Clarkson had eight points on 2-for-10 shooting and five turnovers in his second start for the Lakers, while Jeremy Lin had 14 points and six assists off the bench after being a healthy scratch in Friday's loss at San Antonio. Scott intends to keep his current starting lineup together for the next 15 games or so.\nUP NEXT:\nRockets: Host Dallas on Wednesday.\nLakers: Host Washington on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764991999.5016901
}