{
  "game_id": "401809780",
  "espn_id": "401809780",
  "date": "Nov 07, 2025",
  "matchup": "SAC vs OKC",
  "headline": "Hartenstein has 33 points and 19 rebounds to help the Thunder rout the Kings",
  "body": "SACRAMENTO, Calif. -- — Isaiah Hartenstein had a career-high 33 points along with 19 rebounds and the Oklahoma City Thunder beat the Sacramento Kings 132-101 on Friday night.\n\n\r\n              The 7-foot Hartenstein made 14 of 17 shots and had three assists and three blocks. \n\n\r\n              Shai Gilgeous-Alexander added 30 points to help the Thunder (9-1) bounce back two nights after suffering their only loss of the season in Portland.\n\n\r\n              Cason Wallace scored 15 points and Isaiah Joe added 13 as the Thunder won their first game of the NBA Cup tournament.\n\n\r\n              Oklahoma City led by 23 and took advantage of the absence of Sacramento big man Domantas Sabonis, outscoring the Kings 60-34 in the paint. Sabonis sat out his second consecutive game with sore ribs.\n\n\r\n              Sacramento’s Russell Westbrook, who spent his first nine NBA seasons with the Thunder and is the franchise’s leading scorer, had 24 points and nine assists against his former team.\n\n\r\n              The Thunder beat the Kings for the second time in 11 days, having won 107-101 in Oklahoma City on Oct. 28.\n\n\r\n              In that game the Kings had a healthy Sabonis while the Thunder played without Chet Holmgren.\n\n\r\n              It was a complete reverse this time. Sabonis watched from the bench in street clothes while Holmgren had 10 points and seven rebounds.\n\n\r\n              The Kings trailed by 11 midway through the first quarter but Monk made a pair of 3s in the final two minutes as Sacramento rallied to lead 32-30.\n\n\r\n              Hartenstein helped the Thunder regain the lead in the second quarter. He scored 15 points on 7-of-7 shooting and exchanged words with Kings center Drew Eubanks after a three-point play in the second quarter.\n\n\r\n              Up next\r\n              Thunder: At Memphis on Sunday night.\n\n\r\n              Kings: Host Minnesota on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042581.857261
}