{
  "game_id": "0021900837",
  "espn_id": "401161479",
  "date": "Feb 22, 2020",
  "matchup": "ATL vs. DAL",
  "headline": "Collins, Hawks get hot late, rally past Mavericks 111-107",
  "body": "ATLANTA --  John Collins was in no mood to feel sorry for the Dallas Mavericks and their short-handed roster.\n\n“I feel like I definitely took advantage of the mismatches I had tonight,\" Collins said. “As you guys know, I can crash the basket pretty well, so I think I definitely took advantage of that and made the most of it.\"\n\nCollins had 35 points and 17 rebounds, Trae Young scored 13 of his 27 points in the fourth quarter and the Atlanta Hawks rallied late to beat the Mavericks 111-107 on Saturday night.\n\nCollins' follow shot, credited after a goaltending call was overturned, sealed it with 8.4 seconds remaining.\n\nTim Hardaway Jr. scored 20 of his season high-tying 33 points in the first half and Seth Curry added 22 for Dallas, which couldn't overcome a lack of depth.\n\nThe game was billed as a showdown between Luka Doncic and Young, two second-year All-Stars linked together since a draft-night trade in 2018, but the matchup never materialized.\n\nDoncic, who led Dallas to a win over Orlando the night before, was held out so he could rest his ankle, meaning that he and Young won't face each other again until next season. Doncic missed a 123-100 Mavericks victory against Atlanta earlier this month in Dallas with a similar injury.\n\n“Obviously I love playing against the best players in our league and Luka is obviously up there,\" Young said. “For me, it's tough not getting to play against him, but for him, I want him to get healthy.\"\n\nThe Mavericks were also without Kristaps Porzingis, sidelined to rest his knee, and Willie Cauley-Stein, who missed the game for personal reasons.\n\nYoung had a sluggish start two nights after scoring a career-high 50 in a stirring home win over Miami, but he got hot in time to keep Dallas from moving over .500 for the first time since February 2015. The Hawks took their first lead of the game with 5:24 remaining on Dewayne Dedmon's basket. Hardaway hit a 3 to put Dallas back ahead before Young hit a long 3 and Collins had two free throws to give the Hawks a 107-104 lead with 1:13 remaining.\n\nHardaway tied it at 107-all with a 3, but Young hit a layup with 57.5 seconds remaining.\n\n“We gave up over 30 points in the second quarter again and we let up in the fourth,” Hardaway said. “We were up double digits going into the fourth. We let up. It's hard to see, but it happened.\"\n\nThe Mavericks led by as many as 16 midway through the second on Delon Wright's layup before the Hawks pulled within four on Collins' alley-oop dunk at the 9:06 mark of the third.\n\nThe Hawks, who rank last in 3-point shooting, missed 10 of their first 11 shots beyond the arc and finished at 21.6% on 31 attempts.\n\nTIP-INS\n\nMavericks: Dropped to 19-9 on the road, but they're still among the league leaders away from home after winning a combined 18 road games over the two seasons combined.\n\nHawks: Collins, who tied a career high in scoring, leads the NBA this month with six games of at least 20 points and 10 boards. ... F De'Andre Hunter missed the game for personal reasons.\n\nFURTHER EVIDENCE\n\nThe Mavericks were livid that Collins' shot counted in the closing seconds. Dorian Finney-Smith appeared to be called for goaltending on Young's layup attempt, and a whistle blew. Collins grabbed the ball and then scored with play apparently stopped. Officials then reviewed the play on video.\n\n“There was an inadvertent whistle that came after the putback,\" team owner Mark Cuban said. “Everybody who said they were watching it said it came before the putback. There's neither here nor there because if it's an inadvertent whistle and it's a goaltend with an inadvertent whistle, then you stop play, but then they went and reviewed it and they reviewed it for a goaltend.\"\n\nDallas coach Rick Carlisle, asked by reporters if the officials gave him an explanation, said, “Not a sufficient one. Just a very disappointing way to end the game. Our guys fought their butts off from start to finish. My understanding, if it's a good block on a goaltend that's called and reversed, if there's no control or the other team gets it, it's a jump ball, so I don't know. It's baffling. It's disappointing.\"\n\nOfficiating crew chief Rodney Mott told a pool reporter that “the original call on the floor was a goaltend” and that Collins' basket was allowed because “the ball was blocked and reviewed. The ball hit the rim, so it was deemed an inadvertent whistle. It's Rule 2. Because (Collins) was in his shooting motion when my whistle blew, it's deemed continuation, so therefore the basket counts.\"\n\nAILING\n\nGuard Jalen Brunson became the latest Mavericks player to get hurt, leaving with a right shoulder sprain on the first possession of the game.\n\nDallas already was without its two leading scorers when Brunson was fouled by Dedmon while driving for a layup. He went straight to the locker room after shooting a free throw and was soon ruled out.\n\nThat left the Mavericks, tied for the sixth spot in the Western Conference, with 10 available players, all of whom played in the first quarter.\n\nBrunson and Curry started in place of Doncic and Porzingis as Carlisle went with a three-guard lineup.\n\nDoncic was held out in the second night of a back-to-back to rest the right ankle he has sprained twice, an injury that sidelined him both times. Porzingis missed his third straight back-to-back to rest his surgically repaired left knee.\n\nCurry was questionable before the game with right knee soreness that kept him out of consecutive games earlier this month.\n\nDwight Powell was lost for the season to a ruptured right Achilles last month.\n\nUP NEXT\n\nMavericks: Host Minnesota on Monday.\n\nHawks: At Philadelphia on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996663.4054499
}