{
  "game_id": "0021200391",
  "espn_id": "400278111",
  "date": "Dec 22, 2012",
  "matchup": "CHI @ ATL",
  "headline": "Al Horford, Hawks rout Bulls to snap 2-game losing skid",
  "body": "ATLANTA -- Larry Drew knew why his Atlanta Hawks blew out the Chicago Bulls on Saturday, he just couldn't explain why they looked so different one night after being beaten handily in Philadelphia.\n\nAl Horford had 20 points and 10 rebounds, and every Atlanta starter scored in double figures in a 92-75 win on Saturday. The Hawks (16-9) and Bulls (15-11) played role reversal from their performances on Friday night.\n\nAtlanta looked nothing like the squad that lost 99-80 in Philadelphia, and Chicago didn't resemble the team that dominated the Knicks in a 110-106 win in New York.\n\n\n\nDrew said several times that \"energy\" enabled the Hawks to break a two-game losing streak. Trying to figure out how his team had so much of it Saturday and so little Friday was perplexing.\n\n\"I wish I had the answer to that, to be perfectly honest,\" Drew said after pushing his career record to 100-73. \"I don't care what our strategy is, or what the game plan is. If we don't play with good energy we're not going to be successful.\n\n\"That's the thing that will have you pulling your hair out ... it was a complete opposite.\"\n\nIt took a while to see a difference in the teams. The Bulls led 21-17 after one quarter, and neither club scored for the first three-plus minutes.\n\nChicago led 31-28 before Atlanta took off on a 25-6 run over the final 6:58 of the second quarter to build a 53-37 lead by halftime. The Bulls never recovered.\n\nFrom the middle of the second quarter, the Bulls looked as though they were emotionally gassed by the game in New York. The Bulls and Knicks combined for nine technical fouls and four ejections in that one.\n\nLuol Deng paced Chicago with 11 points, and Joakim Noah -- who was ejected on Friday -- had 10, but they were the only Bulls to score in double figures. Atlanta starters outscored Chicago starters 72-39.\n\nThe Bulls were outrebounded 45-31.\n\n\"Tough loss. The highs and lows of this thing are unbelievable,\" Noah said. \"One night you feel great because you won a big game, and then the next night you come out with the wrong mindset and you lose. Our energy was bad.\"\n\nIn his first start for the Hawks, guard Lou Williams scored 11 of his 16 points in the second quarter, when Horford added 10. Atlanta held Chicago without a fastbreak point in the first half.\n\nLike his coach, Horford is not sure how to predict how much energy his team will play with on a given night, but the Hawks center had a partial theory on why Atlanta was pumped up more on Saturday: The Hawks had lost two straight and three of four.\n\n\"What I've learned with this team is that until we're on the floor and we get going, we really won't know how we're feeling,\" Horford said after making 9 of 12 shots. \"It's just a matter of us coming out with that energy, and I think our backs were against the wall. We needed to come out strong.\"\n\nWilliams started at shooting guard, but began the second quarter playing point guard in place of starter Jeff Teague, and scored 11 points in the period. The Hawks outscored the Bulls 25-6 over the final 6:58 of the half.\n\nThe third quarter was more of the same as Atlanta built a 72-47 lead.\n\nBulls coach Tom Thibodeux sat his starters in the final period.\n\n\"We got beat in every facet,\" he said after Chicago's two game winning streak was snapped. \"Our defense wasn't any good, our rebounding was poor, and you're on the road. You've got to play 48 minutes. You look at Atlanta, they played (Friday), too. They were on the road. It's a will game.\"\n\nGame notes Hawks guard Devin Harris missed his third straight game because of a sore left foot. ... Chicago rookie guard Marquis Teague entered the game in the third quarter, and was at times matched up against his brother Jeff Teague. The younger Teague scored eight points with three assists. Jeff Teague had 11 points and eight assists. ... Atlanta rapper T.I. (Clifford Harris Jr.) performed at halftime. ... Former heavyweight boxing champion Evander Holyfield, and singer-songwriter Ne-Yo (Shaffer Chimere Smith) were in the crowd.",
  "source": "espn_api",
  "crawled_at": 1764993386.5099578
}