{
  "game_id": "0022300354",
  "espn_id": "401584982",
  "date": "Dec 18, 2023",
  "matchup": "TOR vs. CHA",
  "headline": "Siakam scores 27 points as Raptors beat Hornets team missing four starters, including Bridges",
  "body": "TORONTO -- — Pascal Siakam scored eight of his 27 points in the fourth quarter, Gary Trent Jr. had a season-high 22 points and a career-high 10 rebounds for his first career double-double, and the Toronto Raptors beat Charlotte 114-99 on Monday night, rallying past a Hornets team missing Miles Bridges and three other starters.\n\n\r\n              Bridges was denied entrance to Canada due to his past legal problems, a person familiar with the situation told The Associated Press.\n\n\r\n              “We definitely could have used him,” Hornets center Nick Richards said. “He brings a great presence to our team in scoring, rebounding, even defending. We definitely missed him tonight. He’s definitely one of our key options. He could have helped us a lot.”\n\n\r\n              Hornets coach Steve Clifford did not comment on the reason for Bridges’ absence.\n\n\r\n              Charlotte was already without injured starters LaMelo Ball (right ankle), Gordon Hayward (illness) and Mark Williams (back), plus key reserve Cody Martin (left knee).\n\n\r\n              Toronto’s Scottie Barnes scored 10 of his 22 points in the fourth and matched his career high with 17 rebounds. Dennis Schroder scored 13 points and Precious Achiuwa had 12. \n\n\r\n              Trent had eight points in the fourth as the Raptors outscored the Hornets 35-18 in the final period.\n\n\r\n              “We competed great,” Clifford said. “Their defense in the fourth quarter was really good. We struggled to get good shots.”\n\n\r\n              Raptors coach Darko Rajakovic praised Trent for his role in Toronto’s comeback.\n\n\r\n              “He did a great job,” Rakakovic said. “Obviously, having him and his shooting there on the court really helped us to keep moving the scoreboard.”\n\n\r\n              Terry Rozier led Charlotte with 22 points, P.J. Washington Jr. had 15, and Bryce McGowens and Brandon Miller each had 14.\n\n\r\n              “A lot of guys stepped up in the positions they were in and played really well,” McGowens said.\n\n\r\n              The Hornets scored 23 points off 19 Toronto turnovers but couldn’t avoid a fifth straight loss. \n\n\r\n              Washington and Rozier both started. Washington (left shoulder) sat out Saturday’s 135-82 loss to Philadelphia, while Rozier left Charlotte’s franchise-worst defeat in the third quarter after being elbowed in the nose.\n\n\r\n              Bridges is currently serving three years of probation after pleading no contest in exchange for no jail time in a June 2022 domestic violence case involving the mother of his two children, who accused Bridges of assaulting her in front of them.\n\n\r\n              Bridges most recently turned himself in on Oct. 13 after an arrest warrant was issued for an alleged protection order violation. That case is still pending.\n\n\r\n              Bridges was suspended by the NBA for the first 10 games of the season after sitting out all of last season. He is averaging 19.6 points and 7.2 rebounds in 12 starts since his return.\n\n\r\n              Rookie center Nathan Mensah, who is from Ghana, also was not with the Hornets Monday, Clifford said.\n\n\r\n              Former Raptors coach Dwane Casey attended the game.\n\n\r\n              Toronto had as many turnovers (seven) as made baskets in the first quarter, and Charlotte led 27-19 after one.\n\n\r\n              The Hornets were up 52-48 at the half, but Siakam scored 10 points in the third as Toronto cut the gap to 81-79 heading to the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit Indiana Wednesday night.\n\n\r\n              Raptors: Host Denver on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995438.833162
}