{
  "game_id": "0022301206",
  "espn_id": "401616460",
  "date": "Dec 06, 2023",
  "matchup": "MEM @ DET",
  "headline": "Desmond Bane scores career-high 49 points, Grizzlies send Pistons to 18th straight loss",
  "body": "DETROIT -- — Desmond Bane scored 32 of his career-high 49 points in the second half and the Memphis Grizzles handed the Detroit Pistons their 18th straight loss, 116-102 on Wednesday night\n\n\r\n              Detroit is 2-19, with the losing streak the longest in one season in franchise history and second-longest overall behind a 21-game slide at the end of the 1979-80 season and start of 1980-81. \n\n\r\n              “There's the personal pride to guard the ball and not let a guy get to the basket,” Pistons coach Monty Williams said. \"I had to call a timeout, because we got the lead and Bane got to the basket three straight times. \n\n\r\n              “That's not making baskets or scheme, that's just the ability to get back in transition and guard.”\n\n\r\n              The streak is the longest in the NBA since Houston lost 20 straight in 2020-21. The Philadelphia 76ers hold both NBA records, setting the single-season mark at 26 in a row in 2013-14 and the overall mark at 28 at the end of 2015-16 and start of 2016-17.\n\n\r\n              “They've been in a lot of these games, especially recently, and we knew they were going to be in attack mode,” Grizzlies coach Taylor Jenkins said. “They've got a lot of guys who can attack and they can hurt you on the boards.”\n\n\r\n              Bane was 19 of 31 from the field, hitting 4 of 8 3-pointers, and made seven free throws without a miss. He also had eight assists and six rebounds. His previous scoring high was 38 against Brooklyn on Oct. 24, 2022.\n\n\r\n              “I've been trying to become a more complete player,” Bane said. “Being able to play make and score from all areas of the court. That wins games.”\n\n\r\n              Jaren Jackson Jr. added 24 points for the Grizzlies in their third victory in four games. The Grizzlies are without star guard Ja Morant while he serves a 25-game suspension to start the season. He was penalized for a second online video showing him flashing a handgun.\n\n\r\n              Morant holds the franchise record with 52 points against the San Antonio Spurs on Feb. 28, 2022. He also scored 49 against Houston on Oct. 21, 2022.\n\n\r\n              Bojan Bogdanovic scored 22 points for Detroit. Jalen Duren had 17 points and 11 rebounds before leaving because of a left leg injury with 1:58 to play. There was no postgame update about the injury.\n\n\r\n              “It's tough — I feel like he was just getting his groove back,” Williams said of Duren, who has missed seven games this season. \n\n\r\n              The Pistons led 69-61 midway through the third quarter, but Bane scored the next seven points. He finished with 19 points in the period, with Detroit taking an 84-82 lead into the fourth.\n\n\r\n              With Bane on the bench, Memphis started the quarter with a 14-2 run to take a 96-86 lead. Detroit went 1 for 8 with two turnovers in the first five minutes of the quarter.\n\n\r\n              “That was huge,” Jenkins said. “(Bane) was obviously carrying a big load for us offensively, and that (group) really set a tone for our defense. That allowed us to get out and run and really just play free.\"\n\n\r\n              The Pistons were outscored 34-18 in the fourth quarter.\n\n\r\n              “We couldn't make a shot,” Williams said. “We had wide-open 3s.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Minnesota on on Friday night.\n\n\r\n              Pistons: At Orlando on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996036.389007
}