{
  "game_id": "0022000580",
  "espn_id": "401307363",
  "date": "Mar 12, 2021",
  "matchup": "MEM vs. DEN",
  "headline": "Nikola Jokic helps Nuggets hold off Grizzlies 103-102",
  "body": "MEMPHIS, Tenn. -- — Nikola Jokic led the Denver offense, but it was his defensive play in the closing seconds that preserved the Nuggets' fifth straight victory.\n\n\r\n                    Jokic had 28 points, 15 rebounds and seven assists, and his defense thwarted Memphis guard Ja Morant at the rim with about three seconds left as Denver escaped with a 103-102 victory over the Grizzlies on Friday night.\n\n\r\n                    Jokic had scored the final five Denver points for the 103-102 advantage, but Memphis had a chance to re-take the lead in the closing seconds when Morant went to the rim against Jokic but came up short against the Denver center. The Nuggets then ran out the clock for the victory.\n\n\r\n                    The Grizzlies were upset about Morant not getting a call on the drive, but official Rodney Mott said there was no foul.\n\n\r\n                    “On Morant’s drive to the basket, the defender, Jokic, jumps vertical and maintains a legal guarding position and there was no foul on the play,” Mott told a pool reporter.\n\n\r\n                    “As far as the last play of the game, I’ll look for the 2-minute report,” Memphis coach Taylor Jenkins said.\n\n\r\n                    Will Barton and Michael Porter Jr. had 21 points each for Denver. Jamal Murray was held to a season-low three points, missing 13 of 14 shots.\n\n\r\n                    “We won that game and Jamal Murray was 1 for 14,” Porter said. “I think that just shows how good of a team we are because Jamal is one of our best players, one of our best scorers. \n\n\r\n                    “If we can scrape out wins when one of us doesn’t play well, that’s really encouraging.”\n\n\r\n                    Brandon Clarke and Dillon Brooks led Memphis with 20 points each, Clarke adding three blocks. Morant had 16 points — on 5-of-16 shooting — and nine assists, and Jonas Valanciunas added 14 points and 11 rebounds.\n\n\r\n                    Playing its first game after the All-Star break, Denver used a strong defensive effort in the third quarter to force poor Memphis shooting and sloppy ballhandling. The combination led to the Nuggets outscoring Memphis 28-22 in the third, including a 20-7 run that led to Denver’s first double-digit lead and eventually an 81-77 advantage.\n\n\r\n                    “When we win game, we win third quarters,” Nuggets coach Michael Malone said. “I think there’s a definite correlation to that. That first 10 minutes of that third quarter were really impressive.”\n\n\r\n                    The Nuggets entered the game 14-2 when leading after three quarters this season and still held the advantage midway through the fourth until Memphis began connecting on 3-pointers. \n\n\r\n                    It was tied at 95 before a 3-pointer by Barton with 2:08 left, and Denver never trailed again.\n\n\r\n                    “It was a heckuva basketball game,” Jenkins said. “Two team playing at a very, very high level, especially (going down the stretch). We regrouped, came back and did a lot of great things there at the end of the game. …I thought we executed beautifully on a number of possessions to stay within striking distance.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Ended a five-game trip (split by All-Star break) 5-0. …F JaMychal Green, who was listed as questionable with a left shoulder sprain, was a late scratch with a stomach illness. …Murray reached 1,250 career assists in the second quarter. …Jokic went down holding his ankle in the third quarter, causing some concern as he left the game. After treatment on the sideline, he returned a minute later.\n\n\r\n                    Grizzlies: Valanciunas passed Hakim Warrick for 14th on the Grizzlies career rebounding list. Warrick had 1,326. …G Grayson Allen returned to active roster after missing four game under concussion protocol. However, he did not play. … Morant’s 42-footer to end the third quarter pulled the Grizzlies to 81-77.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Host Dallas on Saturday.\n\n\r\n                    Grizzlies: At Oklahoma City on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996955.721927
}