{
  "game_id": "0022400570",
  "espn_id": "401705136",
  "date": "Jan 15, 2025",
  "matchup": "LAL vs. MIA",
  "headline": "Hachimura and Davis help Lakers end 3-game skid with a 117-108 win over the Heat",
  "body": "LOS ANGELES -- — Rui Hachimura scored 23 points and Anthony Davis had 22 points and 11 rebounds as the Los Angeles Lakers snapped a three-game skid with a 117-108 victory over the Miami Heat on Wednesday night.\n\n\r\n              LeBron James finished with 22 points and nine assists and Austin Reaves added 14 points and 14 rebounds as the Lakers won for the first time since having two games postponed due to the deadly wildfires in Southern California.\n\n\r\n              Tyler Herro shot 7 for 12 from 3-point distance and scored 34 points for the Heat, who lost both games of a Los Angeles swing after falling to the Clippers on Monday. Haywood Highsmith and Nikola Jovic each scored 12 points.\n\n\r\n              The Lakers trailed by 12 points at the break and moved in front at 88-87 with 10:47 remaining after going on a 15-4 run.\n\n\r\n              Takeaways\r\n              Heat: Miami went 3-3 on its West Coast trip without Jimmy Butler, who has now completed his seven-game suspension for what the team called “conduct detrimental to the team.\"\n\n\r\n              Lakers: The three-game losing streak that ended Wednesday matched the team’s longest of the season. Two other three-game skids came when Los Angeles went 2-7 from Nov. 21-Dec. 6.\n\n\r\n              Key moment\r\n              The Lakers’ Jaxson Hayes came away with a steal, fed the ball to Reaves near half court to start a fast break then trailed the play to score on a dunk off a feed from Reaves and give Los Angeles a 90-87 lead with 10:27 remaining.\n\n\r\n              Key stat\r\n              Herro was 7 of 8 from the floor in the first half, including 5 of 5 from 3-point range and 3 for 3 from the line, for 22 points. \n\n\r\n              Up next\r\n              The Heat host the Denver Nuggets on Friday. The Lakers host the Brooklyn Nets on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997176.3246589
}