{
  "game_id": "0022200111",
  "espn_id": "401468266",
  "date": "Nov 02, 2022",
  "matchup": "CHI vs. CHA",
  "headline": "Green scores 17 as Bulls cruise past Hornets 106-88",
  "body": "CHICAGO -- — On an off night for two of Chicago's biggest stars, Javonte Green and the rest of the Bulls picked up the slack.\n\n\r\n              Green scored 17 points on 7-for-7 shooting, leading a strong performance by Chicago's reserves and helping the Bulls beat the Charlotte Hornets 106-88 on Wednesday.\n\n\r\n              Patrick Williams had 16 points and Nikola Vucevic added 14 points and 13 rebounds as Chicago cruised to its second straight win despite a sluggish performance by DeMar DeRozan and Zach LaVine.\n\n\r\n              “I think that having everybody involved is going to help our team grow,” coach Billy Donovan said, “and it also takes the pressure off those guys, where if they don't have a great shooting night, you're still giving yourself an opportunity to win.”\n\n\r\n              Led by Green and Goran Dragic, who had 16 points, Chicago's reserves outscored Charlotte's bench 49-28.\n\n\r\n              “Just giving the starters that extra energy that we're supposed to give them,” Green said. “They played a lot of minutes last night, so try to give them a break.”\n\n\r\n              Kelly Oubre Jr. led Charlotte with five 3-pointers and 24 points. Mason Plumlee had 11 points and 13 boards.\n\n\r\n              “When you slow down their star players and then the other players kind of affect the game, those are the type of games that we don't want to have,” Oubre said.\n\n\r\n              Playing for the second straight night for the first time this season, LaVine scored 10 points for Chicago on 4-for-16 shooting. The All-Star guard had left knee surgery in May, and the team is closely monitoring his workload.\n\n\r\n              DeRozan finished with a season-low nine points, but it didn't matter all that much.\n\n\r\n              The Bulls grabbed control with a 13-2 run in the third quarter, opening an 84-68 lead on Derrick Jones Jr.'s two foul shots with 1:24 left. Green sparked the decisive stretch with a rebound dunk after LaVine's fast-break shot was blocked by James Bouknight.\n\n\r\n              Williams, Alex Caruso and LaVine each hit a 3-pointer to help Chicago open a 20-point lead at 96-76 with 8:04 remaining in the game.\n\n\r\n              Charlotte lost for the fourth time in five games. The Hornets shot 7 for 32 from 3-point range.\n\n\r\n              “I don’t think that we came as locked in as we should have been for 48 minutes,” Oubre said.\n\n\r\n              Hornets forward P.J. Washington was held to eight points on 3-for-10 shooting. He scored a total of 59 points in his previous two games.\n\n\r\n              CLIFFORD AND NASH\n\n\r\n              Charlotte coach Steve Clifford said he talked to Steve Nash on Tuesday night after he departed from his coaching job in Brooklyn. Clifford was an assistant with the Los Angeles Lakers when Nash played for the team, and Clifford was a consultant for the Nets last season.\n\n\r\n              “The thing that happens is that coaches get credit a lot of times for things that maybe you don’t necessarily should get credit for, but you get blamed for a lot of stuff that’s out of your control,\" Clifford said. “This year is this year, you know, but last year was a disappointment and the No. 1 thing, the reason why we didn’t do as well last year was games missed.”\n\n\r\n              TIP-INS\n\n\r\n              Hornets: F Gordon Hayward (left shoulder soreness) didn't play in the second half. ... G LaMelo Ball (left ankle sprain), F Cody Martin (left quad soreness) and G Terry Rozier (right ankle sprain) remained out with injuries. Ball has yet to play this season. Martin has been out since the Oct. 19 opener. Rozier has appeared in two games. \n\n\r\n              Bulls: C Andre Drummond (sprained left shoulder) missed his third straight game, and G Coby White (left quad) was out for the second straight game. Donovan said Drummond had an MRI and there is no timetable for his return. “I do think every day that's gone by he's felt better,” Donovan said. “But his range of motion is not great and he's limited in certain things he can do.\"\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Memphis on Friday night. The Hornets and Grizzlies split two games last season.\n\n\r\n              Bulls: At Boston on Friday night. The Bulls beat the Celtics 120-104 on Oct. 24 in their first meeting this season.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994515.5525298
}