{
  "game_id": "0022000454",
  "espn_id": "401267614",
  "date": "Feb 19, 2021",
  "matchup": "TOR @ MIN",
  "headline": "Raptors score last 11 to defeat Timberwolves 86-81",
  "body": "MINNEAPOLIS -- — Norman Powell and the Toronto Raptors used one final push to slip by the Minnesota Timberwolves.\n\n\r\n                    Powell scored a season-high 31 points and the Raptors topped the Timberwolves 86-81 on Friday night, closing the game with an 11-0 run.\n\n\r\n                    Toronto (15-15) earned its third straight win to reach .500 for the first time after starting the season 1-6. \n\n\r\n                    Powell is averaging 22.8 points over his last 14 games, including four games of 28 or more points. Even though his offensive contributions are making headlines, Toronto coach Nick Nurse said Powell is doing a lot more than just scoring.\n\n\r\n                    “He’s been a prime-time player. He’s been at his very best since he’s been here,” Nurse said of the sixth-year guard. “That means as a two-way player. He’s playing great, his shooting’s great, he’s exploding to the rim, but he’s also been put on some tough matchups as well and he’s handled those. ... His all-around game has been good.\"\n\n\r\n                    Karl-Anthony Towns led Minnesota with 19 points and 13 rebounds. Malik Beasley scored 13 and Jordan McLaughlin had 11.\n\n\r\n                    Minnesota dropped its third in a row since winning at Toronto on Sunday. In that victory over the Raptors, the Timberwolves overcame a four-point halftime deficit with a 37-point blitz in the third quarter.\n\n\r\n                    On Friday, they made a comeback that was even more dramatic.\n\n\r\n                    After trailing by as many as 19, the Wolves clawed their way back into the game with a 16-0 run midway through the third quarter. Jake Layman had a dunk and a 3-pointer during the stretch, which tied the game at 57.\n\n\r\n                    Minnesota led 81-75 with 3:30 to play when Toronto took over. Fred VanVleet hit a pair of free throws, Powell scored on a transition layup, and Pascal Siakam threw down a tying dunk.\n\n\r\n                    On Minnesota’s next possession, Towns was called for a moving screen, and on the other end, Terence Davis hit his third 3-pointer of the quarter to make it 84-81 with 30 seconds to play.\n\n\r\n                    The Wolves had a chance to tie it, but Beasley’s 3-pointer was short, and Davis hit two free throws for Toronto.\n\n\r\n                    The Timberwolves came up empty on their last eight possessions, and VanVleet noted that it was refreshing to win a game with strong defense\n\n\r\n                    “Our offense has been carrying us most nights, but it’s probably harder to win that way,” VanVleet said. “If that score would have been 120 to 125, I don't know which way it goes. But I like the fact that we were able to clamp down.” \n\n\r\n                    Playing a second straight game without point guard Kyle Lowry (sprained thumb), the Raptors dominated the first half, thanks in part to Minnesota’s cold shooting. At one point the Wolves missed 18 straight 3-pointers before hitting their last two of the second quarter to finish the half 3 for 22 from behind the arc.\n\n\r\n                    BRINGING THE THUNDER\n\n\r\n                    Minnesota rookie Anthony Edwards, the No. 1 pick in the 2020 draft, had a dunk for the ages near the end of the third quarter. \n\n\r\n                    After corralling a pass on the left wing, Edwards saw a clear path to the basket along the baseline. Two dribbles later, he reached the lane, where he was met by Toronto's Yuta Watanabe. \n\n\r\n                    No problem. Edwards skied over the defender and threw down a vicious right-handed dunk. \n\n\r\n                    “That’s probably the best dunk I’ve ever seen with my own eyes ever,” Timberwolves forward Jaden McDaniels said.\n\n\r\n                    Edwards didn't want to talk about the dunk. He was distressed about Minnesota's loss and his 3-for-14 night from the field, including missing on all seven of his 3-point attempts. Once his media duties were finished, the rookie went back onto the Target Center court and spent an extra 15 minutes working on his jump shot.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Nurse said he didn’t anticipate an extended absence for Lowry, who is averaging 17.7 points and 6.4 assists per game. ... Forward Patrick McCaw was available for the first time in 11 months after recovering from surgery to remove a benign mass from his leg. He entered the game midway through the second quarter, receiving a standing ovation from his teammates on the bench.\n\n\r\n                    Timberwolves: Layman, who started Minnesota’s first three games of the season, had seen his playing time dry up of late. He got off the bench for the first time in the six games, finishing with eight points in 13 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    The Raptors return to their temporary home in Tampa, Florida, on Sunday for the first of two straight against the 76ers. The teams will meet again Tuesday, also at Amalie Arena.\n\n\r\n                    The Timberwolves travel to New York to take on the Knicks on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996863.097827
}