{
  "game_id": "0021500912",
  "espn_id": "400828799",
  "date": "Mar 04, 2016",
  "matchup": "CHA vs. IND",
  "headline": "Walker, Batum lead Hornets over Pacers 108-101",
  "body": "CHARLOTTE, N.C. -- Kemba Walker may not have been selected to the All-Star Game, but the Charlotte Hornets' fifth-year point guard is playing like he should have been.\nWalker continued his torrid pace, scoring 33 points and handing out 10 assists as the Hornets defeated the Indiana Pacers 108-101 on Friday night for their ninth win in the last 11 games. Nicolas Batum added 31 points in the win.\nBut it was Walker who again carried the Hornets through crunch time.\nHe was 9 of 17 from the field and made all 11 free throws for his 10th 30-point game of the season as the Hornets swept the Pacers for the first time in franchise history. Walker is averaging 29.6 points during Charlotte's current three-game win streak.\n\"There is a little motivation from not making it, but I just want to show everyone I am good as well,\" Walker said of the All-Star snub. \"I'm trying to make a name for myself.\"\nAnd trying to get the Hornets to the playoffs, he said.\nIt was a big win for the playoff-minded Hornets.\nIndiana entered the night a half-game behind the Hornets for the sixth place in the Eastern Conference standings. Instead of leapfrogging the Hornets, the Pacers fell another game behind.\n\"Kemba's a difficult cover,\" Pacers coach Frank Vogel said. \"But I don't think they just have our number. They're playing as one of the best teams in the league right now and they've been too much for us.\"\nPaul George scored 35 points and Ian Mahinmi had 10 points and 14 rebounds to lead the Pacers. It was George's 19th 30-point game, most in the Eastern Conference.\nWalker continued to shoot the ball with supreme confidence, launching some off-balanced shots without giving a second thought.\n\"Kemba is just on a roll,\" coach Steve Clifford said. \"Literally, when he misses, you're surprised.\"\nWalker, who entered the night tied for 16th in the league in scoring, was averaging 23.8 points and 5.5 assists in his previous 10 games. He had 26 points against Phoenix and 30 points versus Philadelphia in wins on Tuesday and Wednesday night, respectively.\nHe has set the tone all season for the Hornets.\nThe 6-foot-1 point guard entered the night averaging 23.5 points per game in the team's 31 wins and 17.7 points in its 28 losses.\n\"He's an All-Star,\" Batum said of Walker. \"I told you I thought he should be an All-Star. He's one of the most underrated guys in the NBA. He's a great player.\"\nAl Jefferson chipped in with 13 points for Charlotte, which shot 48.1 percent for the game to improve to 21-9 at home.\nThe Pacers led 82-80 entering the fourth quarter behind George's 29 points.\nBut Jefferson came alive, scoring on back-to-back possession in the low post against Jordan Hill to give the Hornets the lead for good and set the tone for the fourth quarter.\nCharlotte extended the lead to 11 with less than five minutes to play when Walker hit a fadeaway jumper over Mahinmi and Marvin Williams knocked down a 3-pointer.\nThe Hornets were 10 of 20 from the field in the fourth quarter.\n\"We failed to get stops and failed to score,\" Vogel said. \"We couldn't control Al Jefferson. They are bringing basically an All-Star center off the bench.\"\nTIP-INS\nPacers: George connected on four 3-pointers, his 22nd game with four-or-more 3s this season.\nHornets: Hornets announced 19,099 in attendance. It marks the 10th sellout of season and one shy of the Time Warner Cable Arena record of 11 set last season.\nFRANCHISE IN THE HOUSE\nCarolina Panthers cornerback Josh Norman took in the game from courtside. Norman was tagged earlier this week as Carolina's franchise player.\nDOUBLE 30s\nWalker and Batum each had surpassed 30 points, marking the first time two Charlotte players have achieved that feat in the same game since Walker and Gerald Henderson did it on March 27, 2013.\nLONG RANGE\nThe Hornets had 13 3-pointers, marking the 36th time this season they have had at least 10 3s in a game -- tied for second-most in the NBA.\n\"That's what they do,\" Vogel said. \"That's what they excel at. ... They move the basketball well and they space and they shoot a ton of 3s. They got hot tonight.\"\nUP NEXT\nPacers: Visit Washington on Saturday night.\nHornets: Host Minnesota on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994360.7297652
}