{
  "game_id": "0021801111",
  "espn_id": "401071784",
  "date": "Mar 26, 2019",
  "matchup": "MIL vs. HOU",
  "headline": "Bledsoe scores 23 to lead Bucks past Rockets, 108-94",
  "body": "MILWAUKEE --  Eric Bledsoe stole the show in a marquee matchup between the Milwaukee Bucks and Houston Rockets on Tuesday night.\n\nWith top-billing going to MVP front-runners Giannis Antetokounmpo and James Harden, the feisty Bucks' guard turned in one his best all-around performances of the season as the Bucks pulled away for a 108-94 victory on Tuesday night.\n\nBledsoe poured in 23 points, including 16 in a decisive third quarter, and tightly guarded Harden for most of the game.\n\n\"I just try to play to my strengths,\" Bledsoe said.\n\nBucks coach Mike Budenholzer praised Bledsoe's all-around performance.\n\n\"To do what he did on both ends of the court, pretty special,\" Budenholzer said. \"I think he loves that challenge. I think he's an incredible defender.\"\n\nAntetokounmpo had 19 points and 14 rebounds for Milwaukee, which improved to an NBA-best 56-19.\n\nHarden scored 23 points and Chris Paul had 19 for Houston, which lost for just the third time in 17 games. Harden shot just 9 of 26, including 1 for 9 from 3-point range with Bledsoe closely guarding him throughout most of the game.\n\n\"We had our open shots. We couldn't know them down,\" Harden said. \"We competed but they went on a run in that third quarter and that was it.\"\n\nAfter a tightly contested first half, the Bucks grabbed control in the third, sparked by Bledsoe's clutch shooting. Leading by five at halftime, Milwaukee built a 19-point lead in the third. Bledsoe went 4 of 5 on 3-pointers in the period after missing his only two attempts in the first half. His third-quarter output, which included a single-handed 11-0 run, nearly matched the 18 points scored by Houston.\n\n\"Everybody got energy out of that and we played even harder,\" Antetokounmpo said.\n\nMilwaukee held the Rockets at bay for most of the final quarter, maintaining a double-digit lead throughout before clearing the bench with about a minute left.\n\nThe Rockets jumped out early, building a 10-point first-quarter lead without Harden doing the bulk of the scoring. Danuel House Jr. paced Houston with nine points in the period, making all three of his 3-point attempts. The Bucks struggled in the opening period, shooting just 8 of 25, including 3 for 13 from deep. Khris Middleton missed all six of his shots in the first quarter.\n\nMilwaukee fought back in the second and eventually grabbed the lead. A key sequence came midway through the quarter when, after a basket by Ersan Ilyasova, Bledsoe stole the inbounds pass, scored and then stood face-to-face with Harden under the basket as the crowd roared.\n\nThe Bucks led 58-53 at the break, paced by Antetokounmpo's 13 points and eight rebounds.\n\nHouston coach Mike D'Antoni blamed an uncharacteristic rash of turnovers in the second quarter for allowing the Bucks to grab the lead.\n\n\"We got sloppy,\" D'Antoni said. \"We turned the ball over four times in transition, errant passes that they capitalized on.\"\n\nINJURY BUG\n\nThe Bucks have been beset with injuries that have altered their lineup. When starting guard Malcolm Brogdon went down with a partial plantar fascia tear earlier this month, Budenholzer replaced him with Nikola Mirotic, who then injured his left thumb and likely is sidelined for the rest of the regular season. Tony Snell, who stepped in for Mirotic, is out with a sprained ankle. Sterling Brown, who sat out 13 games with right wrist soreness before returning to the lineup last week, started against the Rockets. And now, rookie Donte DiVincenzo is expected to miss the rest of the regular season and playoffs due to heel bursitis that has forced him to miss 28 games. DiVincenzo, the 17th overall pick in the draft, is expected to get an injection to address the problem.\n\nTIP-INS\n\nRockets: Gordon started despite dealing with an injured right ankle sustained Sunday. ... F/C Kenneth Faried sat out with a sore left knee. ... G/F Gerald Green is expected to be out for seven to 10 days with a strained adductor.\n\nBucks: G Donte DiVincenzo (bilateral heel bursitis), C Pau Gasol (left ankle soreness) remained out, along with Mirotic and Brogdon.\n\nUP NEXT\n\nRockets: Host the Denver Nuggets on Thursday.\n\nBucks: Host the Los Angeles Clippers on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994454.47413
}