{
  "game_id": "0021500110",
  "espn_id": "400827997",
  "date": "Nov 10, 2015",
  "matchup": "MIL vs. BOS",
  "headline": "Thomas leads Celtics to 99-83 win over Bucks",
  "body": "MILWAUKEE -- Thanks to their defense, the Boston Celtics turned a one-point lead into a rout rather quickly.\nIsaiah Thomas scored 20 points to lead Boston to a 99-83 victory over the Milwaukee Bucks on Tuesday night.\nDavid Lee and Evan Turner each added 13 points, and Jared Sullinger finished with 11 points and 10 rebounds for the Celtics.\n\nBoston scored 18 of the final 20 points in the third quarter to win consecutive games after losing three in a row.\n\"I just thought we were in good position,\" Boston coach Brad Stevens said. \"It wasn't like we were out in denial. We weren't trying to full-court (press), we weren't trying to do anything crazy. We were just trying to be really tough to play against within 25 feet.\"\nBoston's Avery Bradley sat out the second half with a bruised lower left leg. The starting guard was 1 of 6 from the floor for two points.\n\"I don't know what the long-term prognosis is,\" Stevens said. \"We're dealing with some bruises this year so far.\"\nMilwaukee's four-game winning streak ended despite 17 points and 14 rebounds from Greg Monroe. He already reached a double-double in the opening half (14 points, 11 rebounds) and had 10 points with five rebounds in the first 5 minutes.\nGiannis Antetokounmpo scored 16 points for the Bucks.\nA 16-0 run late in the third quarter was the difference.\nBoston made all six shots during the stretch of nearly three minutes and Milwaukee turned the ball over four times, missed both shots and clanked two free throws.\nBoston held a 58-57 lead with 4:17 remaining when it got back-to-back 3-pointers from Jonas Jerebko and Jae Crowder. The run was capped when Antetokounmpo's bad pass was intercepted by Turner, who broke free for a dunk and a 74-57 lead with 1:12 to go.\n\"We had a good pace on offense and we were getting stops,\" Crowder said. \"That's all I can really tell you. Great pace, we were moving, the ball was moving and we were playing our game.\"\nThe closest Milwaukee would get was 82-71 after a layup by Jabari Parker with 8:25 left in the fourth.\n\"With a team that moves the ball as well as they do, that puts a lot of pressure on your defense,\" Milwaukee coach Jason Kidd said. \"When they attack the paint and you're in the bonus, the ball is going against you. They got some free throws, they capitalized on some turnovers and we just didn't capitalize on the offensive end.\"\nTIP-INS\nCeltics: Boston began a stretch of playing five games in seven days. ... The Celtics had 46 points at halftime after putting up 72 in the first half -- their most at home since Jan. 25, 2009, -- in their last game Friday. ... Marcus Smart, who has a sprained left big toe, missed his third game in a row.\nBucks: Milwaukee jumped out to an 18-6 lead but then allowed Boston to go on a 29-9 run. ... Michael Carter-Williams missed his fourth consecutive game with a strained left ankle. ... Four of the Bucks' next five games are on the road.\nADAPTING TO THE BENCH\nLee has a total of 25 points on 10-of-16 shooting coming off the bench the last three games. He started the first three and scored a total of 16 points by going 5 for 20.\n\"David Lee was really good tonight,\" Stevens said.\nSTRUGGLING BUCK\nGreivis Vasquez managed just two points on three shots after missing all 10 shots, including seven from 3-point range, for just one point Saturday against Brooklyn.\nPREPARING FOR DEBATE\nOhio Gov. John Kasich, in town for the GOP debate Tuesday night, attended Milwaukee's shootaround in the morning. He even put up a few shots.\nUP NEXT\nCeltics: Hosts Indiana on Wednesday.\nBucks: Visits Denver on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994105.498237
}