{
  "game_id": "0021600971",
  "espn_id": "400900366",
  "date": "Mar 10, 2017",
  "matchup": "DAL vs. BKN",
  "headline": "Nowitzki, sluggish Mavs put away Nets 105-96 after 30K night",
  "body": "DALLAS --  Now that Dirk Nowitzki has joined the exclusive 30,000-point club, the Dallas Mavericks can get on with the business of trying to finish a turnaround season with an improbable playoff berth.\n\nThey took the next step despite a bit of a 30K hangover.\n\nHarrison Barnes scored 21 points, Nowitzki had 13 after a slow start in his first game since reaching the milestone and the sluggish Mavericks beat the lowly Brooklyn Nets 105-96 on Friday night.\n\nThe Mavericks, three nights after a raucous in-game celebration for Nowitzki, trailed in the fourth quarter with the NBA's worst team missing leading scorer Brook Lopez because of an ankle injury. But they pulled away and matched a season best with a fourth straight win.\n\n\"We struggled because they were playing well and they were playing harder than us,\" Dallas coach Rick Carlisle said.  \"At halftime we talked about it and I thought we had a better second half.\"\n\nNowitzki, who missed his first four shots after making the first six on his historic night , had a pair of 3-pointers early in the fourth, the first putting Dallas ahead to stay at 77-75.\n\nIsaiah Whitehead scored 24 points for the Nets (11-53), who have dropped 36 of 40 games but were coming off a pair of strong showings against likely playoff teams -- a win at Memphis and a loss at Atlanta. Brooklyn finished a season-high, eight-game road trip.\n\n\"I just think we hit a wall as a team, but I'm proud of the guys for their effort tonight,\" said Jeremy Lin, who had 18 points. \"I think everyone in here, probably everyone who has been on this road trip, is feeling it a little bit.\"\n\nSeth Curry made three of four from 3-point range and scored 18 points for the Mavericks, who held on to 10th place in the Western Conference and stayed within 1 1/2 games of eighth-place Denver, which beat Boston at home.\n\nDallas (28-36) won its sixth straight home game and improved to 17-9 since dropping a season-worst 16 games under .500 with a loss at Minnesota on Jan. 9.\n\nThe Mavericks, riddled by injuries early in the season, are 6-2 since the All-Star break as they chase what would be their 16th playoff trip in 17 seasons.\n\n\"The hope was we get to a point where we could get healthy and give ourselves a chance,\" Carlisle said. \"We appear to be in that position. Now there's virtually zero margin for error.\"\n\nThe Mavericks were without new center Nerlens Noel, who was held out because of left knee soreness. He came from Philadelphia at the trading deadline.\n\nTIP-INS\n\nNets: Coach Kenny Atkinson said he didn't expect Lopez to be out long. He said Lopez sprained his left ankle early against the Hawks but played through it. ... Trevor Booker scored 15 points with a team-high seven rebounds, but the Nets were outrebounded 47-35.\n\nMavericks: Carlisle said Noel would be re-evaluated to see if he's available after missing the front end of a back-to-back. ... J.J. Barea had nine points and three assists in 14 minutes in his return after missing 20 games with a left calf strain. He has missed 42 games because of injuries, 37 because of the recurring calf issue.\n\nYOGI'S FORMER TEAM\n\nDallas rookie Yogi Ferrell had 17 points in his first game against the team he played 10 games for early in the season. Ferrell was with Brooklyn's Long Island team in the NBA Development League when the Mavericks signed him in late January because they didn't have a healthy point guard.\n\nANOTHER FAMILIAR FACE\n\nWhile Ferrell faced the team that gave him his first shot at the NBA, Nets forward Quincy Acy played against his hometown team, where he started the season before the injury issues at point guard forced the Mavericks to waive him. The former Baylor standout smiled widely after hitting a 3-pointer 19 seconds into the game and finished with 12 points. \"I wish we could have kept him here,\" Carlisle said.\n\nUP NEXT\n\nNets: Host the Knicks on Sunday, their first home game in nearly a month.\n\nMavericks: Seeking a 5-0 finish to the homestand against Phoenix on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996109.9913678
}