{
  "game_id": "0021800402",
  "espn_id": "401071083",
  "date": "Dec 11, 2018",
  "matchup": "POR @ HOU",
  "headline": "Harden scores 29 to lead Rockets past Blazers 111-104",
  "body": "HOUSTON -- The Houston Rockets' bench came to the rescue twice Tuesday night, and the second time made the difference.\nJames Harden had 29 points and seven Rockets scored in double-figures as Houston used a big second-half run and snapped a three-game losing streak with a 111-104 victory over the Portland Trail Blazers.\nChris Paul added a triple-double with 11 points, 11 rebounds and 10 assists. Clint Capela had 13 points and seven rebounds before fouling out with five minutes left, and Eric Gordon, who started in place of James Ennis, had 14 points for the Rockets, who shot 49 percent from the field.\n\"We did a good job of just competing, playing harder,\" Harden said. \"That was really it -- playing harder and got into them. We were a little more aggressive. Good things seem to happen when you play harder.\"\nHouston's bench played a key role in a 24-6 first-half run that erased a 15-point deficit, and then led a charge in the second half. Gerald Green had 13 points, and Danuel House had 12 off the bench.\n\"They won the game for us,\" Houston coach Mike D'Antoni said of the bench. \"They turned it around when we were down 15, and they came in, and Nene, Danuel House and Gerald put a lot of energy.\"\nDamian Lillard had 34 points, CJ McCollum scored 23 points and Jusuf Nurkic added 15 points and 10 rebounds for Portland, which shot 44 percent after starting the game by making seven of its first nine shots.\n\"I thought Houston played pretty aggressive defense on us,\" Portland coach Terry Stotts said. \"We took some possessions for granted and some turnovers led to their transition. Obviously, their bench came in and hand an impact on the game. . They just outplayed us in the second half.\"\nHouston used a 25-5 run to end the third and start the fourth quarters, and opened a 100-83 lead on 3-pointer by Harden with 6:48 left. House and Green each had five points in the run.\n\"I think you could really tell the difference (in) the second half,\" Green said. \"I thought that we didn't give up a lot of offensive rebounds that was really killing us in the first half. Our pace was really good tonight. I feel like we were playing faster. We were getting out in transition a lot more than we did in the last few games. I think it was something we can build on.\"\nThe Blazers responded with a 14-2 run and cut the lead to 102-97 when Nurkic made a pair of free throws with three minutes left.\nAfter trading baskets, Houston pushed the lead to 107-99 on a free throw by Harden and two free throws by Paul. After Lillard missed a layup, Paul hit two more free throws to push the lead back to 10 with 1:38 left. Portland got no closer than eight the rest of the way.\n\"We dug ourselves into a hole, and with the style that they play, you're going to have a chance to get back into it, but it's a tough battle when you have to fight back into the game,\" Lillard said.\nTIP-INS\nTrail Blazers: Al-Farouq Aminu had 10 points and 15 rebounds. . Portland shot 17 of 21 from the free throw line. . The Blazers shot 10 of 25 from 3-point range.\nRockets: Houston's bench outscored Portland's 37-13. Nene had 10 points. . The Rockets shot 18 of 27 from the free-throw line. . Coach Mike D'Antoni said Brandon Knight (knee) could see playing time early next week. . Ennis left the game with a strained right hamstring.\nCLEAN UP ON THE FLOOR\nPJ Tucker dove for a loose ball during the second quarter, landing in front of Houston Astros third baseman Alex Bregman and Astros owner Jim Crane, who were seated courtside, and splashing their drinks on them. Bregman and Crane were given towels to help dry off.\nUP NEXT\nTrail Blazers: Travels to Memphis on Wednesday.\nRockets: Host the Lakers on Thursday.\n---\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995185.996724
}