{
  "game_id": "0022400223",
  "espn_id": "401704789",
  "date": "Nov 13, 2024",
  "matchup": "MIL vs. DET",
  "headline": "Antetokounmpo scores 59 and Bucks beat Pistons 127-120 in overtime",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 59 points to pace the Milwaukee Bucks to a 127-120 overtime victory over the Detroit Pistons on Wednesday night.\n\n\r\n              It was a league-high for points by an NBA player this season and the second-highest single-game total for Antetokounmpo, who had 64 against Indiana last season.\n\n\r\n              Antetokounmpo hit 21 of 34 shots and 16 of 17 free throws and added 14 rebounds and seven assists as the Bucks rallied from an 18-point second-half deficit.\n\n\r\n              Brook Lopez added 29 points for the Bucks. Cade Cunningham led Detroit with 35 points and Malik Beasley had 26 against his former team.\n\n\r\n              Detroit's Ron Holland II was fouled by Antetokounmpo with one second left in regulation and the score tied at 111, but Holland missed both free throws.\n\n\r\n              The Pistons were without starters Jaden Ivey and Tim Hardaway Jr. Ivey was out with a toe injury and Hardaway missed the game after taking stitches to the head following a fall in Tuesday’s game against Miami.\n\n\r\n              Milwaukee played without Damian Lillard (concussion protocol), Ryan Rollins (left shoulder instability) and Bobby Portis (right elbow contusion).\n\n\r\n              Takeaways\r\n              Pistons: Beasley was hot from 3-point range, hitting 4 of 5 in the first half as Detroit shot 61.5% from beyond the arc (8 of 13). He finished 8 of 16.\n\n\r\n              Bucks: Antetokounmpo made every basket for Milwaukee in the first quarter, hitting 7 of 10 field-goal attempts and all eight of his free throws for 22 of the team’s 24 points.\n\n\r\n              Key moment\r\n              Detroit's Isaiah Stewart pulled down Antetokounmpo by the jersey and was assessed a flagrant foul 2 and ejected with 3:02 left in the third quarter. Antetokounmpo made both free throws.\n\n\r\n              Key stat\r\n              The Bucks improved to 22-1 against Detroit since the 2018-19 season and won their 10th straight in the series.\n\n\r\n              Up next\r\n              The Pistons visit Toronto on Friday night and the Bucks visit Charlotte on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997857.900953
}