{
  "game_id": "0021600343",
  "espn_id": "400899785",
  "date": "Dec 09, 2016",
  "matchup": "DAL vs. IND",
  "headline": "Matthews gets 26, Barnes 25 to lead Mavs past Pacers 111-103",
  "body": "DALLAS --  A night after a 31-point home loss that embarrassed Wesley Matthews and his teammates, they all showed up at a charity event hosted by the Dallas shooting guard.\n\nCoach Rick Carlisle called it a team-building moment for the unit with the worst record in the Western Conference. Matthews couldn't really disagree.\n\n\"I'll have an event every night if that's what we're going to do,\" Matthews said after matching a season high with 26 points as the injury-plagued Mavericks answered their lowest point in a difficult season with a 111-103 victory over the Indiana Pacers on Friday night.\n\nA listless second half in a 120-89 loss to Sacramento prompted a team meeting. Two nights later, the Mavericks started the third quarter with a 10-2 run for their first double-digit lead in just their third win in 15 games. Harrison Barnes scored 25 points.\n\n\"That game, I think it ate at a lot of people, as it should,\" said Matthews, who was 8 of 16 from the field and 5 of 10 from 3-point range. \"I was embarrassed. I think a lot of other people were, too.\"\n\nIndiana had 10 3-pointers in the first quarter and a half, including four from Dallas high school product C.J. Miles. But the Pacers couldn't sustain it against the NBA's worst defensive team at the arc, finishing 14 of 25.\n\nPaul George scored 22 points to lead the Pacers (11-12), who failed for the third straight time with a chance to get above .500. Indiana hasn't had a winning record since dropping Game 2 at Brooklyn after beating Dallas at home in overtime in the opener.\n\n\"It's real disappointing,\" said George, who had just nine points after the first quarter. \"I don't know what it is. I don't have the answers for that.\"\n\nMatthews outscored the Pacers by himself during a 32-11 spurt that turned a 50-42 deficit into a 74-61 lead. He had 16 points during the run , capped by a 3-pointer midway through the third quarter.\n\nThe Mavericks (5-17) shot 58 percent in the third quarter, making six of 12 from long range and outscoring the Pacers 31-25. In a 120-89 loss to Sacramento on Wednesday, Dallas was outscored 29-12 in the third.\n\nDallas is without starters Dirk Nowitzki (strained right Achilles tendon) and Andrew Bogut (right knee injury) and key backup guard J.J. Barea (left calf strain).\n\n\"We are in desperate need of wins,\" Carlisle said. \"We really played a solid game tonight.\"\n\nTIP-INS\n\nPacers: Indiana made its first 24 free throws before Jeff Teague missed the first of two with 1:34 remaining. The Pacers finished 25 of 26. ... Myles Turner, who grew up in the Dallas area, scored 18 points. He had 30 in the first meeting. ... Miles scored 18 points, going 6 of 9 from long range.\n\nMavericks: G Seth Curry returned after missing four games with a right knee sprain. He matched Deron Williams for the team lead with six assists and scored four points. Williams scored 16. ... Matthews has all three of his 26-point outings in the past six games. Two of them were wins.\n\nGOOSE EGG\n\nFormer Dallas guard Monta Ellis was scoreless on 0-for-5 shooting. It's the first time he was held without a point since Feb. 9, 2015, during his final season with the Mavericks when he played just 4 minutes and missed his only shot. \"Monta is just trying to figure out his role within what we have going on,\" George said. \"We're all trying to figure this out.\"\n\nCAREER NIGHT\n\nUndrafted Dallas rookie Dorian Finney-Smith had career highs with 12 points and eight rebounds, the latter a game high along with Barnes. His scoring included a running one-handed dunk on a fast break. \"I put in the work so I deserve to go out there and shoot it with confidence and that is what I've been doing,\" Finney-Smith said.\n\nUP NEXT\n\nPacers: After the first of two five-game trips, a season high, Indiana plays a pair of home games against Portland (Saturday) and Charlotte (Monday) before three more away from home.\n\nMavericks: A visit to Houston on Saturday is followed by home games against Denver (Monday) and Detroit (Wednesday) with Dallas in a stretch of seven out of nine at home.\n\n---\n\nStory corrects previous versions with 74-61 lead for Dallas after 32-11 run instead of 74-71.",
  "source": "espn_api",
  "crawled_at": 1764996148.518954
}