{
  "game_id": "0021800507",
  "espn_id": "401071183",
  "date": "Dec 26, 2018",
  "matchup": "CHI vs. MIN",
  "headline": "Rose returns to Chicago, leads T-Wolves over Bulls 119-94",
  "body": "CHICAGO --  For much of his seven seasons with the Bulls, Derrick Rose was a favorite son of Chicago. He was native born and virtually universally beloved.\n\nThings, though, soured towards the end as injuries mounted. The former franchise player was traded in 2016 and serenaded with boos upon his return a few months later.\n\nThe 30-year-old is hoping Wednesday night began a new chapter in his relationship with his hometown.\n\nRose had 24 points and eight assists in just his second career game in the United Center against his former team, lifting the Minnesota Timberwolves to a 119-94 victory.\n\nHe was cheered loudly throughout by the sellout crowd of 21,852.\n\n\"It was great, man,\" he said. \"I didn't expect it to be like this -- overwhelming at some points. You can tell the support is still here.\"\n\nRose, the top pick in the 2008 draft, was named the NBA's most valuable player in 2011. He had missed Minnesota's previous game with a sore left ankle.\n\nBecause of an assortment of injuries, this was just his fourth career game against the Bulls. He said he got 50 tickets for family and friends.\n\n\"I'm happy I didn't change throughout this whole process,\" he said. \"I remained myself. I stayed true to my family. There was a lot of people that jumped off the boat when I was going through things. I (saw) who they were. I know what's fake love and what's real love.\"\n\nKarl-Anthony Towns had 20 points and 20 rebounds as the Timberwolves won their second straight on the road.\n\nZach LaVine had 28 points in 26 minutes off the bench and Lauri Markkanen added 16 for Chicago, which had won two straight and three of five before Wednesday. LaVine had missed the previous five games with a sprained left ankle.\n\n\"I thought he looked good and aggressive,\" Bulls coach Jim Boylen said of LaVine. \"I like when he drives the ball. He attacked on his first two touches and sometimes that can get you going.\"\n\nBoth Rose and fellow former Bull Taj Gibson received loud ovations when they were announced during player introductions.\n\nTowns scored the game's first basket, but it was Rose who set the tone early. He repeatedly attacked the basket -- showing the form of earlier in his career before the rash of leg injuries -- and had 10 points (5-for-8 shooting) and five assists in the first quarter as Minnesota took a 29-18 lead.\n\nThe Timberwolves' advantage was up to 60-37 at halftime.\n\nRose had 19 points through three quarters as Minnesota took an 83-65 edge into the fourth.\n\nThe Bulls pulled within 91-74, but Rose stopped the momentum with a jumper and Dario Saric added a 3-pointer on the next possession for a 96-74 lead with just over seven minutes remaining.\n\nLater in the fourth, the UC crowd started chanting, \"MVP... MVP... MVP...\" when Rose stepped to the foul line to complete a 3-point play.\n\n\"I had to crack a smile a little bit,\" he said. \"It made me reminisce about some of the old days and how grateful I was to be in that position at a young age.\n\n\"With the year I'm having, it's very special to come back here and play.\"\n\nGOOD HEALTH\n\nWolves coach Tom Thibodeau said Rose (averaging 18.7 points on 48.9 percent shooting) is playing at an All-Star level. When asked if he thought that was possible when Minnesota picked up the guard late last season -- after he was waived by Utah -- Thibodeau said:\n\n\"I did. The thing that people forget about Derrick is he was MVP at 22. He was still young and that was the biggest thing. I always felt if he got back to being healthy that he could be very productive.\"\n\nTIP-INS\n\nTimberwolves: Gibson finished with 16 points in 26 minutes . G Jeff Teague missed his fifth straight game with a left ankle injury.\n\nBulls: LaVine had been sidelined since injuring the ankle late in the Bulls' 97-91 loss to the Orlando Magic in Mexico City on Dec. 13. He originally was expected to be sidelined two to four weeks. \"Ankle hurt a little bit,\" he said. \"I got tired of sitting down. It still hurts a little bit, but I'll be OK.\"\n\nUP NEXT\n\nTimberwolves: Host the Atlanta Hawks Friday night.\n\nBulls: At the Washington Wizards Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994825.723886
}