{
  "game_id": "0021300795",
  "espn_id": "400489668",
  "date": "Feb 18, 2014",
  "matchup": "CHA @ DET",
  "headline": "Jefferson leads Bobcats to 108-96 win over Pistons",
  "body": "AUBURN HILLS, Mich. --  Al Jefferson beat up the Detroit Pistons in a key game in the chase for the final playoff spot in the Eastern Conference.\n\nThe Pistons are hardly the first team he has punished.\n\nJefferson scored more than 30 points for the sixth time in nine games and led the Charlotte Bobcats to a 108-96 victory over Detroit on Tuesday night.\n\nHe added 12 rebounds and seven assists, and sent Andre Drummond and Greg Monroe to the Pistons bench with foul trouble.\n\n\"He's a bad matchup for the entire league right now,\" interim Pistons coach John Loyer said. \"We knew exactly what we was going to do -- they ran the same plays they always run -- but there's not much you can do to stop him.\"\n\nJefferson had 24 points and 14 rebounds on Dec. 20 when the Bobcats rallied from a 20-point deficit to beat Detroit 116-106.\n\n\"These games are what it is all about, especially with the Pistons chasing us,\" Jefferson said. \"If you had told us before the season that we would be in this position, we would have been very satisfied. There are 28 games left, and we're in the hunt.\"\n\nKemba Walker scored 22 points, and Josh McRoberts added 14 points and 10 rebounds to help the Bobcats extend their lead over the Pistons to 1 1/2 games for eighth place in the Eastern Conference.\n\n\"Our guys talked about it before the break, and said that everyone needed to do something to get ready for the rest of the season,\" Bobcats coach Steve Clifford said. \"Whatever they did, they were all ready to go tonight, and it was obviously a factor.\"\n\nThe teams will conclude the home-and-home set at Charlotte on Wednesday night.\n\nDrummond, coming off his MVP performance in the Rising Stars game on Friday, had 16 points, 11 offensive rebounds and 11 defensive rebounds for Detroit. That wasn't enough to overcome a terrible shooting performance by his teammates.\n\n\"We didn't have the energy and concentration that I would have expected,\" said Loyer, who is 1-2 after replacing Maurice Cheeks last week. \"That's very disappointing. You can't let a good NBA team, and I think Charlotte is a good team, post that kind of start.\n\n\"We had two good practices after the break, but it didn't carry over into tonight's game.\"\n\nDetroit got double-doubles from all three post players. Monroe finished with 18 points and 10 rebounds, and Josh Smith added 12 points and 11 rebounds. The Pistons shot just 39.8 percent, with Smith making only 5 of 17 attempts.\n\nThe Bobcats got off to a quick start, making their first seven shots. Only four missed free throws by Michael Kidd-Gilchrist kept Detroit from digging itself a bigger hole.\n\nEven when Charlotte missed a shot, the Bobcats got the offensive rebound and found McRoberts for an open 3-pointer.\n\n\"It was very important to us to have a great start,\" Jefferson said. \"We know how important these games are, and we were able to start off the game by setting the tone.\"\n\nThe Bobcats' free-throw shooting didn't get any better -- they missed 11 of their first 14 attempts -- but they maintained a double-digit lead for most of the second quarter. Charlotte was ahead 54-43 at halftime.\n\nDetroit could have gotten a point at the start of the second half, following a technical foul called on Walker as the teams left the court for the break. Jennings, though, missed the free throw.\n\nDetroit was outshot 58 percent to 36 percent in the first half, but Charlotte's struggles from the line and eight offensive rebounds in the second quarter kept the Pistons in the game.\n\nThe Bobcats quickly moved ahead 67-49 within the first 5 minutes of the third quarter, but Drummond was active enough on the offensive boards to pull Detroit within 79-67, heading to the fourth period.\n\nHe went to the bench with his fifth foul with 9:47 to play, ending the Pistons' run. Detroit also started missing its free throws, going 1 for 7 to start the second half.\n\nGame notes The Bobcats are 2-0 this season against the Pistons with both wins coming at the Palace. ... Detroit's Rodney Stuckey, a subject of trade rumors because of his expiring contract, went 1 for 9 from the floor in the first half and finished with two points in 17 minutes. ... Jefferson pulled off a rare feat when he was able to talk an official into changing a call. Tony Brown whistled Jefferson for a delay-of-game violation, but after a brief discussion, the call was overturned.",
  "source": "espn_api",
  "crawled_at": 1764993155.415243
}