{
  "game_id": "0022001007",
  "espn_id": "401307814",
  "date": "May 07, 2021",
  "matchup": "CLE @ DAL",
  "headline": "Doncic, Mavs cruise past Cavs 110-90 to stay in 5th in West",
  "body": "DALLAS -- — Luka Doncic scored 24 points in 23 minutes and the Dallas Mavericks kept the prime spot in a tight race to avoid the Western Conference play-in tournament with a breezy 110-90 victory over the Cleveland Cavaliers on Friday night.\n\n\r\n                    Tim Hardaway Jr. added 20 points for the Mavericks, who didn't trail after going ahead 4-2 while the undermanned Cavaliers lost their ninth consecutive game, one short of their longest skid of the season. The teams play again Sunday in Cleveland.\n\n\r\n                    The already injury-riddled Cavaliers had to play without Kevin Love, who was sidelined after banging knees with Portland's Enes Kanter two nights earlier in a 141-105 loss to the Trail Blazers. Collin Sexton scored 27 points for the Cavaliers.\n\n\r\n                    Dallas (39-28) stayed a game ahead of Portland (38-29) in fifth place in the West. The Trail Blazers broke a sixth-place tie with the Lakers (37-30) and clinched that season series with a 106-101 victory over Los Angeles on Friday night. The odd team out among the three will be forced into the play-in scenario as the No. 7 seed. \n\n\r\n                    The Mavericks clinched the Southwest Division title, which would give them the fifth seed in a three-way tie with the Lakers and Blazers. Portland won the season series 2-1 against Dallas and LA.\n\n\r\n                    “I think it's something that's always worthwhile,” said coach Rick Carlisle, who passed Cotton Fitzsimmons for 15th on the career list with his 833rd victory. “It shows that you're one of the better teams. It's big and we'll take it. It's important to get this win, try to get through this game unscathed and get ready for Sunday.”\n\n\r\n                    \r\n                      Trey Burke hit a half-court shot at the buzzer in the first quarter for a 33-19 lead, and Doncic converted a three-point play in the final seconds before the half for a 62-37 margin while Dallas held Cleveland to 31% shooting before the break.\n\n\r\n                    “I thought the first half in part and the shooting let us down,” Cavs coach J.B. Bickerstaff said. “We had some open looks and didn't knock them down.”\n\n\r\n                    With seven points in the first four minutes, the 22-year-old Doncic became the fourth-youngest in NBA history to reach 5,000 points. LeBron James, Kevin Durant and Carmelo Anthony were each 21 when reaching the milestone. \n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: The official diagnosis for Love was a left knee contusion. ... Anderson Varejao played the final 4:37 two nights after ending a four-year absence in his first game with Cleveland since Feb. 10, 2016. Varejao, who spent his first 11½ seasons with the Cavs, signed a 10-day contract this week. ... The second-worst 3-point shooting team in the NBA was 6 of 29 (21%) from deep. Cedi Osman scored 22 but was 2 of 10 from beyond the arc.\n\n\r\n                    Mavericks: Kristaps Porzingis went through a pregame shootaround before missing his fifth consecutive game and eighth in the past nine with right knee soreness. The 7-foot-3 Latvian had to leave early in the only game he did play in that stretch. ... Maxi Kleber missed his third straight game with a sore right Achilles heel.\n\n\r\n                    TAKING CARE OF BUSINESS\n\n\r\n                    Doncic had one assist, a season low, to leave him one short of 1,500 for his career. The Mavericks didn’t need that part of their career triple-double leader’s game.\n\n\r\n                    Doncic sat the final 16 minutes as the Mavericks led by as many as 29 points while taking care of a team in the mix for the worst record in the East. Similar matchups have been far from automatic lately for Dallas, which is 9-3 in the past 12 games with all three losses to Sacramento. The Kings started the day 12th in the West.\n\n\r\n                    TOUGH STRETCH\n\n\r\n                    The Cavaliers are in the middle of a 10-game stretch to end the season against teams in contention for at least play-in spots. Cleveland has allowed an average of 127 points in the past four games, with an average losing margin of 22. But one of those was in overtime to Phoenix, the No. 2 team in the West, when the Suns outscored the Cavs 20-4 in the extra period.\n\n\r\n                    UP NEXT\n\n\r\n                    Dallas takes a five-game winning streak in the series into Sunday's meeting.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997864.025764
}