{
  "game_id": "0021800104",
  "espn_id": "401070785",
  "date": "Oct 31, 2018",
  "matchup": "DET @ BKN",
  "headline": "Dinwiddie hits late 3, Nets beat Pistons 120-119 in OT",
  "body": "NEW YORK --  Spencer Dinwiddie and his teammates are trying to change the perception of the Brooklyn Nets. That is why what transpired at Barclays Center on Wednesday night was so important to the fourth-year guard.\n\n\"Because of what we're fighting for. We're trying to be a good team and trying the change the tide of the Nets' teams in the past. You got to know how to get out of rut fast,\" Dinwiddie said after making a 3-pointer with 7.1 seconds left in overtime to help the Brooklyn Nets beat the Detroit Pistons 120-119.\n\n\"(Losses) can string together and it can affect morale and all that other stuff,\" Dinwiddie said.\n\nDinwiddie finished with a season-high 25 points. He was 8 of 15 from the field, including 5 for 9 from 3. Four of his five 3s came in the fourth quarter or overtime.\n\n\"I was able to hit a couple shots and help our team win,\" Dinwiddie said.\n\nJoe Harris added a season high 23 points, Caris LeVert and Jarrett Allen had 19 each, and Jared Dudley finished with 11. The Nets snapped a three-game losing streak to improve to 3-5.\n\n\"We've been in this experience a lot,\" Harris said. \"A lot of close (games) last year. A lot of close games to start the season. For us to close one out (and) execute down the stretch-take care of the ball and execute defensively-this is huge in terms of confidence for us and (this is) just a big morale boost whenever you get a win like this.\"\n\nThe Pistons have dropped three straight to fall to 4-3.\n\n\"When we were 4-0 nobody was cheering for us and nobody is going to feel sorry for us when we lose three in a row,\" Pistons coach Dwane Casey said. \"We're in a situation where we have each other. We have to pull together and take care of the mental mistakes we're making, and I have to make sure we're getting better shots for our guys where we can execute better offensively.\"\n\nBlake Griffin led Detroit with 25 points, Andre Drummond had 24 points and 23 rebounds, and Reggie Jackson scored 21 points.\n\nAfter Dinwiddie's late 3-pointer, Griffin missed a fadeaway.\n\n\"We just have to lock in,\" said Griffin. \"It's just an effort thing or a concentration thing.\"\n\nThe Nets trailed by as much as 10 in the third quarter, and entered the fourth down 83-77. Brooklyn ended up outscoring the Pistons 33-27 in the fourth quarter, with Dinwiddie hitting a 3-pointer with 32 seconds left to force overtime.\n\n\"Thank God for Spencer Dinwiddie,\" Dudley said.\n\nTIP-INS:\n\nPistons: Reserve Jose Calderon's 3-pointer with a second left in the first half gave Detroit a 60-54 lead. Calderon finished with eight points, two rebounds, a steal and a blocked shot.\n\nNets: In his second game of the season, Nets power forward Rondae Hollis-Jefferson had eight points and seven rebounds while playing a reserve role. Backup big man Ed Davis had with 10 points and 10 rebounds.\n\nNOT PASSING THE BOARDS\n\nDuring his pregame press conference, Nets coach Kenny Atkinson bemoaned his team's performance on the glass in a 115-96 loss to the New York Knicks on Monday night. In the loss to their crosstown rivals, the Nets were out rebounded 53-32. And Atkinson focused on his guards, who combined for eight rebounds. \"A lot of times our bigs are locked in or boxing out a big, and our guards are not pursuing the ball like they should.\" Against the Pistons, Nets guards had 18 rebounds.\n\nMIDDLE OF THE ROAD\n\nHistorically, defense and the Detroit Pistons have been synonymous terms. Through seven games of the Casey Era, Detroit is in the middle of the pack defensively, allowing 111.3 points per game. Offensively, they entered the game scoring 109.7 points per game. \"In today's NBA, scoring is at a premium,\" Casey said before the game. \"The pace is way up. Teams attempting the 3 is way up, so I would say scoring offensively is huge.\"\n\nUP NEXT\n\nPistons: At Philadelphia on Saturday.\n\nNets: Host Houston on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994719.486874
}