{
  "game_id": "0022300806",
  "espn_id": "401585434",
  "date": "Feb 23, 2024",
  "matchup": "HOU vs. PHX",
  "headline": "Fred VanVleet, Jabari Smith Jr. help Rockets hold off Suns, 114-110",
  "body": "HOUSTON -- — Fred VanVleet scored 23 points, Jabari Smith Jr. had 22 points and 16 rebounds and the Houston Rockets withstood Phoenix's late surge to beat the Suns 114-110 on Friday night.\n\n\r\n              “There’s a lot of different ways to win in the NBA and we’re finding that out and learning that as a group and tonight was a good night for us,” VanVleet said. \n\n\r\n              Kevin Durant had 28 points, 11 rebounds and eight assists for Phoenix, coming off a loss in Dallas the night before. Fellow All-Star Devin Booker added 25 points and Bol Bol had season highs of 25 points and 14 rebounds.\n\n\r\n              Durant moved past Carmelo Anthony (28,289) into ninth place on the NBA scoring list with 28,296 points. \n\n\r\n              “He’s one of the best to ever do it and it’s really special for me to be part of these milestones with him,” Phoenix coach Frank Vogel said. \n\n\r\n              Phoenix was without starters Bradley Beal, who missed a third straight game with tightness in his left hamstring, and Jusuf Nurkic, who has a sprained right ankle.\n\n\r\n              Vogel wouldn't blame being short-handed for Phoenix's inability to make plays late.\n\n\r\n              “We were not playing a good basketball game,” he said. “We came out strong in the first quarter … but didn’t sustain it.” \n\n\r\n              Houston led by double-digits to start the fourth, but the Suns took the lead with about five minutes to go.\n\n\r\n              The Rockets regained the lead soon after that and rookie Amen Thompson made 1 of 2 free throws for Houston to make it 110-108 with 17 seconds to go, but the Suns knocked the ball out of bounds fighting for the rebound on the miss. Smith made 1 of 2 free throws to make it 111-108 with nine seconds remaining.\n\n\r\n              Booker made two free throws to get the Suns within one again with seven seconds left. This time, Smith made both free throws to leave Houston up 113-110.\n\n\r\n              Smith then intentionally fouled Durant and his first shot rolled in and out of the basket before the Suns were called for a lane violation on the second attempt.\n\n\r\n              VanVleet missed a free throw with four second left, but Houston got the rebound. Alperen Sengun made 1 of 2 free throws to make it 114-110 and seal the victory.\n\n\r\n              “I think the execution was decent,” Houston coach Ime Udoka said. “We like to get it to specific guys for the foul shots and we couldn't quite get it to Fred sometimes. But other guys stepped up and made them.”\n\n\r\n              Phoenix trailed by 13 to start the fourth and was down by 10 before going on a 12-2 run to tie it at 96. Bol, who had made just four 3-pointers all season, made two in that stretch to help the Suns close the gap.\n\n\r\n              Vogel raved about the performance of Bol, who came a point and a rebound shy of matching his career bests in both categories.\n\n\r\n              “He was great,” Vogel said. “There’s no other way to put it. We’re trying to find the right environments where he can thrive. He came in and took advantage of his minutes. He just made play after play after play.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Los Angeles Lakers on Sunday.\n\n\r\n              Rockets: Host Oklahoma City of Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995590.739058
}