{
  "game_id": "0022000967",
  "espn_id": "401307770",
  "date": "May 02, 2021",
  "matchup": "MIL vs. BKN",
  "headline": "Antetokounmpo's 49 points pace Bucks past Nets",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo played how he wants to play, and it was enough to overcome a terrific effort by Kevin Durant.\n\n\r\n                    Antetokounmpo scored 49 points and Khris Middleton had 26 points and 11 rebounds, leading the Milwaukee Bucks to a 117-114 victory over Durant and the Nets on Sunday.\n\n\r\n                    Antetokounmpo also had eight rebounds, four assists and three blocked shots. The two-time reigning NBA MVP went 21 for 36 from the field, including a 4-for-8 performance from 3-point range.\n\n\r\n                    “I’ve been working on a jump shot my whole life,” Antetokounmpo said. “I know eventually one day it’s all going to click.\n\n\r\n                    “Tonight that picture I created, that’s who I want to be moving forward. It doesn’t matter if I score 49 points. I don’t care about that. What I care about is how I slowed down, how I was able to find my teammates. How if I missed one, missed a second one, missed a third one and still be able to come down and shoot another one. This is what I believe I can be.”\n\n\r\n                    The Bucks (40-24) won for the third time in four games to pull within 2 1/2 games of the Nets (43-22) in the three-way battle for the top spot in the Eastern Conference. Philadelphia is on top at 42-21 heading into its matchup with San Antonio on Sunday night.\n\n\r\n                    Milwaukee hosts Brooklyn again on Tuesday night.\n\n\r\n                    “Every day you wake up is about your craft,” Durant said. “We’ve just got to stay locked in mentally to what we’re trying to do as a group.”\n\n\r\n                    Durant had 42 points and 10 rebounds for the Nets, but he missed a difficult fadeaway 3-pointer at the buzzer. Kyrie Irving scored 20 points, and Landry Shamet finished with 17.\n\n\r\n                    Durant was 7 of 13 from 3-point range and 16 of 33 overall while playing a game-high 40 minutes.\n\n\r\n                    “You’ve got a guy who is pretty much the same size as Giannis, with unlimited range,” Middleton said. “KD is a guy who will just pull up in your face like you’re not there.”\n\n\r\n                    Antetokounmpo finished three points shy of his career high, set against Philadelphia in March 2019.\n\n\r\n                    A slick move by Antetokounmpo gave the Bucks a 117-112 lead, and Irving answered with a layup. But Durant and Middleton traded 3-point misses before the final attempt by Durant.\n\n\r\n                    “I was not going back and forth with KD,” Antetokounmpo said. “There’s nobody in this world who can go back and forth with him. He’s one of the greatest players to ever play this game.\n\n\r\n                    “You’ve got to be able to do it as a unit, to guard him and make it tough on him. I was just trying to do my job, get to my spot and execute and help my team win.”\n\n\r\n                    Jrue Holiday had 18 points for Milwaukee, and Bryn Forbes finished with 12.\n\n\r\n                    Antetokounmpo scored the Bucks’ first 16 points of the third quarter, and his personal streak stopped when he passed to Forbes for a 3-pointer. He had 18 points in the third, and the game was tied at 90 heading to the fourth.\n\n\r\n                    Durant lifted the Nets with 13 points in the quarter, including three 3-pointers.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: James Harden missed his 14th straight game with a right hamstring injury, but Durant (hamstring tightness) returned after missing Friday’s 128-109 loss to Portland. ... Guard Bruce Brown also returned after missing three games with a sore right knee. ... Coach Steve Nash said the two-game series against the Bucks is “a great rehearsal” for a possible playoff matchup. Nash said he didn’t think the Nets would be keeping any secrets in the two games. “We’re still growing,” Nash said. “We’re still learning. We’re trying to get there, let alone start hiding things.”\n\n\r\n                    Bucks: Antetokounmpo was cleared to play and started after spraining his right ankle in the opening minute of the Bucks’ loss at Houston on Thursday. He missed the Bucks’ 108-98 win in Chicago on Friday. “They’ve put him through quite a bit of testing and work,” coach Mike Budenholzer said. “Giannis is very familiar with his body and these type of injuries. At some point you pass the test, you feel good, you go.” … Donte DiVincenzo returned after missing the Bulls game because of right big toe soreness. ... Forward Bobby Portis, who posted double-doubles in the previous two games, was sidelined with a stomach illness.\n\n\r\n                    UP NEXT\n\n\r\n                    The Bucks and Nets conclude their two-game series in Milwaukee on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764997372.9520252
}