{
  "game_id": "0022201114",
  "espn_id": "401469269",
  "date": "Mar 26, 2023",
  "matchup": "CHI @ LAL",
  "headline": "Bulls spoil LeBron's return with 118-108 win over Lakers",
  "body": "LOS ANGELES -- — LeBron James scored 19 points off the bench in his return from a monthlong injury absence, but Zach LaVine scored 32 points to lead the Chicago Bulls to a 118-108 victory over the Los Angeles Lakers on Sunday.\n\n\r\n              DeMar DeRozan added 17 points for the Bulls, who easily overcame James' return for their seventh win in nine games. LaVine hit 11 of his first 14 shots to lead an offensive effort that snapped the Lakers' three-game winning streak despite the return of the NBA's career scoring leader.\n\n\r\n              James sat out 13 games with right foot soreness, missing four weeks during the Lakers' run at a playoff berth. The team provided few updates on his recovery, and his return came with little advance warning.\n\n\r\n              “I felt confident in the workouts that I had this week,” James said. “And the day after the workouts, when I woke up, stepped out down off the bed, I could possibly play today. And after my workout early before the game today, I knew I could play.”\n\n\r\n              For only the second time in his 20-year, 1,958-game NBA career, James wasn't a starter. He came in as a reserve midway through the first quarter, doing his standard pregame chalk toss while receiving a standing ovation from Lakers fans. James got a field goal in every quarter, and he finished with eight rebounds, three assists and five turnovers in 30 minutes.\n\n\r\n              “You could see him getting his rhythm, his timing, his finishes, all of that,” Lakers coach Darvin Ham said. “He's a savvy veteran, one of the greatest ever to do it, so it's not going to take all that much.\"\n\n\r\n              Chicago largely controlled play despite James’ return, streaking to a 20-point lead in the second quarter. Los Angeles briefly got the lead down to single digits down the stretch, but got no closer.\n\n\r\n              “There are going to be swings, and that was the encouraging part,” Bulls coach Billy Donovan said. “I'm seeing a response back competitively.”\n\n\r\n              Patrick Beverley had 10 points and five assists in his first game against the Lakers since they traded him last month. Beverley has been outspoken about his desire to hurt the Lakers’ playoff hopes during this home-and-home series between the teams, but Davis and the other Lakers just smiled at his provocative talk.\n\n\r\n              When Beverley made a little hook shot with 1:12 left to boost Chicago’s lead back to double digits, Beverley slapped the floor and made the dismissive “too small” gesture sometimes used by NBA players to taunt their opponents, in this case James.\n\n\r\n              “I was just playing basketball,\" Beverley said. \"Obviously it's good to see some old teammates, old coaching staff.”\n\n\r\n              Troy Brown Jr. and Malik Beasley scored 18 points apiece, but Anthony Davis managed just 15 points and nine rebounds as the Lakers (37-38) failed to get above .500 for the first time since Jan. 9, 2022.\n\n\r\n              The Lakers were without D’Angelo Russell, who missed his second straight game with a right hip injury. Los Angeles went 8-5 in James’ absence, but his return will force an adjustment of the chemistry built by his teammates in his absence.\n\n\r\n              “We came out a little flat, turned the ball over early, just weren't aggressive enough, physical enough,” Ham said.\n\n\r\n              VOOCH TOSSED\n\n\r\n              The Bulls largely controlled Davis even after Nikola Vucevic was ejected in the second quarter with two quick technical fouls when he argued what appeared to be a good call against him. Donovan jokingly wondered how Vucevic could be ejected when he was arguing in his native Serbian.\n\n\r\n              “Obviously it was a bad decision by me to react the way I did,” Vucevic said. “My mistake. I'm just glad my teammates came through for us. I obviously overreacted, for sure.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: DeRozan sat out Friday’s win in Portland with a strained quadriceps He will attempt to play in both back-to-back games in Los Angeles, Donovan said. ... Alex Caruso played against his former team through foot soreness. ... Javonte Green missed his second straight game with residual soreness in his return from right knee surgery.\n\n\r\n              Lakers: Russell has missed eight games with two injuries since joining the Lakers last month. He has played with James only twice. ... Wenyen Gabriel scored two points on his 26th birthday.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Clippers on Monday.\n\n\r\n              Lakers: At Chicago on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994465.868673
}