{
  "game_id": "0022000301",
  "espn_id": "401267461",
  "date": "Jan 30, 2021",
  "matchup": "MIA vs. SAC",
  "headline": "Welcome back: Butler scores 30, Heat hold off Kings 105-104",
  "body": "MIAMI -- — Jimmy Butler returned, and made sure the Miami Heat got back to their winning ways.\n\n\r\n                    Butler scored a season-high 30 points after missing 10 games because of the NBA’s virus-related protocols, including the go-ahead layup with 42.1 seconds left, and the Heat defeated the Sacramento Kings 105-104 on Saturday night to end a five-game losing streak.\n\n\r\n                    “You simply cannot put a modern-day analytic to Jimmy’s will to win,” Heat coach Erik Spoelstra said. “He was not going to let us lose, no matter what it took.”\n\n\r\n                    Butler played 34 minutes, finishing with eight assists and seven rebounds.\n\n\r\n                    “We're going to build off of this,\" Butler said. “So much to get better at, but we can do it. We're going to turn this around.\"\n\n\r\n                    De’Aaron Fox scored 30 for Sacramento, 17 of those coming in the fourth. Buddy Hield had 18 for the Kings — including a steal that he turned into a go-ahead 3-pointer with 1:44 left, putting the Kings up 104-103.\n\n\r\n                    Butler had the night’s final score, though, and the Heat escaped.\n\n\r\n                    “Great player,\" Sacramento's Harrison Barnes said. “He definitely gives that team a different look, a different lift.\"\n\n\r\n                    Sacramento had a last-ditch chance at the end, but Richaun Holmes' jumper got deflected by Miami's Bam Adebayo. Butler had a big say in that play as well, helping force the ball out of Fox's hands with a double-team.\n\n\r\n                    “They made a big-time play at the end,\" Kings coach Luke Walton said of the Heat.\n\n\r\n                    Adebayo had 18 points and 13 rebounds for Miami, which got 15 points from Tyler Herro and 14 from Duncan Robinson. Kelly Olynyk scored 11 for the Heat, who were still without Goran Dragic and used their 14th lineup in 19 games this season.\n\n\r\n                    Marvin Bagley scored 17 for Sacramento, which was playing its third game in four nights and saw its three-game winning streak snapped. Barnes scored 11 for the Kings.\n\n\r\n                    Butler scored 20 points by halftime, 14 of them coming in the second quarter. The Heat trailed most of the first half, briefly held the lead late and went into intermission down 59-57 after Tyrese Haliburton beat the halftime buzzer with a 3-pointer.\n\n\r\n                    Miami outscored the Kings by nine in the third, taking an 84-77 lead into the final period and led nearly the entire fourth — until Hield's late 3, but Butler ensured Miami's slide would finally end.\n\n\r\n                    “We've just got to go out there and do our job,\" Butler said. “It starts now.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Sacramento was 5 for 11 from the foul line, while Miami was 22 for 26. ... When the Kings fell behind by 10 early in the fourth quarter, it was the first time they faced a double-digit deficit in their last four games.\n\n\r\n                    Heat: It was also milestone night for Butler, who scored his 10,000th point and grabbed his 3,000th career rebound, both in the first half. ... The Heat are 5-5 at home. They were 27-5 in their building last season.\n\n\r\n                    TESTING ISSUES\n\n\r\n                    Herro revealed postgame that he learned a housemate has tested positive for COVID-19; he got that news at halftime. And Miami didn't play Kendrick Nunn because he was awaiting a COVID-19 test result when the game started. Nunn was cleared by the second quarter and could have played, but Spoelstra elected to not use him.\n\n\r\n                    O CANADA\n\n\r\n                    Olynyk’s first basket gave him 5,000 career points, making him the fourth Canadian-born player to hit that NBA milestone after Andrew Wiggins, Rick Fox and Tristan Thompson. Denver’s Jamal Murray will be next; he’s 36 points away. Steve Nash, the two-time NBA MVP and now Brooklyn Nets coach -- generally considered the best Canadian player ever -- was born in South Africa.\n\n\r\n                    BUDDY BALL\n\n\r\n                    Hield extended the NBA’s longest active streak of games with a 3-pointer to 85, four shy of matching Dana Barros for the fourth-longest in league history. The record belongs to Golden State’s Stephen Curry, who had one in 157 consecutive games.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Visit New Orleans on Monday.\n\n\r\n                    Heat: Host Charlotte on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996810.793708
}