{
  "game_id": "0022300155",
  "espn_id": "401584783",
  "date": "Nov 06, 2023",
  "matchup": "ATL @ OKC",
  "headline": "Gilgeous-Alexander scores 30 as Thunder ease past Hawks 126-117",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 30 points to help the Oklahoma City Thunder defeat the Atlanta Hawks 126-117 on Monday night.\n\n\r\n              The Thunder's leading scorer sat out Friday against the Golden State Warriors with a sprained left knee. He bounced back quickly, making 11 of 20 shots and getting eight rebounds and six assists.\n\n\r\n              Gilgeous-Alexander was impressed with the way the Thunder played on offense in the 141-139 loss to Golden State, so he was careful not to disrupt things. \n\n\r\n              “I just tried to fit in with the group, do what was necessary, and then pick my spots accordingly,” said Gilgeous-Alexander, who has scored at least 30 points in four of his six games. “I feel like we played pretty good basketball last game and wanted to carry it over to this game.”\n\n\r\n              Jalen Williams scored 21 points, Lu Dort added 19 and Chet Holmgren had 16 points and 12 rebounds for the Thunder, who were coming off losses of four points to New Orleans and two points to the Warriors.\n\n\r\n              Dejounte Murray scored 29 points for the Hawks, and Trae Young added 22 points and 11 assists not far from the campus where he starred for Oklahoma for a season.\n\n\r\n              Thunder coach Mark Daigneault said the Thunder did a solid job against Young, who was 5 of 18 from the field. Dort was the primary defender, and blocked a 3-point attempt from Young with the Thunder up six in the final two minutes.\n\n\r\n              “I thought there were a couple of plays where the decisions were difficult for him, which is, I think, something that you have to do is keep him on his toes,” Daigneault said. “Don’t give him the same dose of the same defense over and over again, because obviously, he's a savvy player.”\n\n\r\n              In the second quarter, the 7-foot-1 Holmgren grabbed a rebound for Oklahoma City, then brought the ball up the court on the fast break. He found rookie Cason Wallace with a behind-the-back pass for a layup that put the Thunder ahead 36-30.\n\n\r\n              Dort was fouled by Young on a desperation 3-pointer with 0.1 seconds left in the first half. Dort made all three free throws for a 58-50 halftime lead for Oklahoma City. He led the Thunder with 13 points before the break.\n\n\r\n              In the third, a block by Holmgren started a fast break. Giddey drove and found Gilgeous-Alexander in the corner for a 3-pointer that put the Thunder up 73-62 and led to a Hawks timeout.\n\n\r\n              Oklahoma City's Isaiah Joe made three 3-pointers in a 50-second span to give his team an 88-73 lead, and the Thunder took a 96-77 advantage into the fourth quarter.\n\n\r\n              Atlanta was down seven in the final two minutes when Dort blocked a 3-pointer by Young, leading to Gilgeous-Alexander's alley-oop lob to Williams for a dunk and a 118-109 lead.\n\n\r\n              “It’s not trying to focus on the positive. I guess it is to a degree,” Atlanta coach Quin Snyder said. “The fact that we continued to take our shots, we continued to offensive rebound ... we were down 19 and just scratched and clawed and made it a game late.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Orlando on Thursday.\n\n\r\n              Thunder: Cleveland at home Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996313.931434
}