{
  "game_id": "0021900443",
  "espn_id": "401161085",
  "date": "Dec 22, 2019",
  "matchup": "LAL vs. DEN",
  "headline": "Nuggets beat LeBron-less Lakers 128-104 for 6th win in row",
  "body": "LOS ANGELES --  Buoyed by a perfect five-game homestand, the Denver Nuggets hit the road and kept on winning.\n\nPaul Millsap scored 21 points and the Nuggets dominated the second half in defeating the Los Angeles Lakers, who were without LeBron James, 128-104 on Sunday night for their sixth win in a row.\n\n\"Our last homestand gave us confidence to come on the road and win,\" Millsap said. \"We have so many weapons.\"\n\nThe Nuggets had six players in double figures. Gary Harris added 19 points, Nikola Jokic had 18 points, Malik Beasley had 16 points and Will Barton III had 14 points and a career-high-tying 13 rebounds for the Nuggets, who pulled away to a 23-point lead early in the fourth.\n\n\"It feels good to get a win in L.A. even if LeBron wasn't playing,\" Jokic said.\n\nJames missed his first game of the season because of a thoracic muscle strain. That left the Lakers without his 25.8 point average and 10.6 assists.\n\n\"It's kind of hard to next-man-up LeBron,\" said Kyle Kuzma, the only other Laker in double figures with 16 points. \"He does so much. Shots come easier when he's on the floor because everyone just looks at him.\"\n\nWith James looking on in street clothes, Anthony Davis did his best to make up for it with 32 points and 11 rebounds. He scored 11 points playing all 12 minutes of the first quarter.\n\n\"It's tough when he's out but we still got to find ways to win,\" Davis said. \"We lost our energy defensively. We got to continue to defend and once we get that edge back we'll be fine.\"\n\nDavis slipped and tweaked his right leg in the third quarter, but felt good enough to play 7 1/2 minutes in the fourth.\n\n\"Hopefully nothing significant happens,\" he said.\n\nThe Lakers can't afford to have Davis go down at the same time as James with a Christmas game against the Clippers looming. The Western Conference-leading Lakers have lost three in a row since winning seven straight.\n\nKuzma returned after missing five games with a sprained left ankle.\n\n\"This is probably the healthiest I've been all season,\" he said. \"Just got to get my legs back a little bit.\"\n\nMillsap was questionable to play because of a left knee contusion, but he consistently scored with Davis and Kuzma in the lineup late in the second quarter. His 3-pointer put the Nuggets up 55-53 at the break.\n\nDenver scored 73 points in the second half while holding the Lakers to 51 points.\n\n\"It was the best game we've had from start to finish this season,\" Nuggets coach Michael Malone said. \"Our starters played well and our second unit played outstanding. When we do that we are hard to beat.\"\n\nThe Lakers successfully challenged a goaltending call against Davis midway through the third that took a basket away from the Nuggets. But Denver responded with a 23-11 run to take a 91-78 lead into the fourth. Seven players scored during the spurt, led by Millsap with seven.\n\n\"We came out more aggressive in the second half and got rebounds and knocked down our shots and played excellent defense,\" Millsap said.\n\nThe Nuggets opened the fourth with a 17-7 run with Harris and Beasley doing all the scoring that gave them a 108-85 lead. Beasley had nine points, making two 3-pointers, and Harris had eight.\n\n\"We played a great team basketball game,\" Jokic said.\n\nTIP-INS\n\nNuggets: Improved to 4-0 in the first game of a back-to-back. ... Their three-game road skid ended.\n\nLakers: They fell to 10-3 at home. ... Rajon Rondo made his first start of the season and had five points and eight assists. ... There was a pregame moment of silence for JoAnn Buss, the former wife of late Lakers owner Jerry Buss and mother of their four children, who now own the franchise. The team said she died last Monday at 86. Jerry Buss died in 2013.\n\nUP NEXT\n\nNuggets: At Phoenix on Monday in the second game of a back-to-back to conclude a two-game trip.\n\nLakers: Host the Clippers on Christmas in a match-up of the top teams in the West standings. The Clippers won by 10 points as the home team on opening night in October.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996010.293161
}