{
  "game_id": "0021900586",
  "espn_id": "401161228",
  "date": "Jan 12, 2020",
  "matchup": "ATL @ BKN",
  "headline": "Irving returns with 21 points, Nets pound Hawks 108-86",
  "body": "NEW YORK --  Kyrie Irving hadn't played in two months and all he did in his return was make 10 of 11 shots in the best shooting night of his career.\n\nHe knows it won't always be that easy.\n\n“I mean, I’m not going to shoot 10 for 11,\" he said with a laugh. “I hope I can shoot 10 for 11 every night.\"\n\nThe Brooklyn Nets will take whatever they can get after seeing how much a healthy Irving means to them.\n\nThe point guard scored 21 points in 20 minutes in his return from an injured right shoulder, leading the Nets to a 108-86 victory over the Atlanta Hawks on Sunday.\n\nIrving made a career-best 90.9% of his shots after missing 26 games with an impingement. The shoulder looked fine and his handle looked as good as ever while he dribbled his way around a hopeless Atlanta defense.\n\nEnergized by his return that still seemed a ways away just a week ago, the Nets led by 39 points and won their second straight after dropping seven in a row.\n\n“We had a certain confidence about us tonight that I think we were missing during that streak,\" Nets coach Kenny Atkinson said. “So great, great timing having him back.\"\n\nCam Reddish scored 20 points for the Hawks, who played without star guard Trae Young because of a left hamstring injury and lost their fourth straight.\n\nThe Nets made it such an easy night that their fans didn't need to worry about the scoreboard as they roared for Vince Carter's two 3-pointers in the fourth quarter. The 42-year-old former Nets star finished with eight points in his final road appearance against the franchise.\n\n“Obviously to come back here, and some of the other stops I’ve played for, and just kind of to receive a standing O for one last time is just great,” Carter said.\n\nIrving began feeling pain in his shoulder early in the season, and he took himself out of the lineup after a game in Denver on Nov. 14. The Nets held up well without him for a while thanks mostly to Spencer Dinwiddie's strong play, but had faltered recently, especially in crunch time.\n\nIrving got a cortisone shot on Dec. 24 and returned to full practice this week, just in time to return on his sister's birthday.\n\n“It’s not really a surprise for me,\" Irving said of his performance. “I put in the work and when I do that I feel like the results will come.\"\n\nHe started alongside Dinwiddie to share the playmaking responsibilities and did most of his scoring near the basket, making the only 3-pointer he attempted. The Nets were already leading 70-46 at halftime before he went 5 for 5 for 10 points in a dazzling six-minute stretch of the third quarter.\n\nTIP-INS\n\nHawks: Coach Lloyd Pierce said Young got treatment in Washington, where the Hawks practiced Saturday, and was still sore Sunday. Brandon Goodwin started in his place.\n\nNets: Brooklyn has won the last eight meetings. That's only halfway to the longest winning streak in the series, as Atlanta won 16 straight from 1986-89. ... Brooklyn's previous biggest lead in a game this season was 26 points against Philadelphia on Dec. 15.\n\nCHEERING CARTER\n\nCarter got a nice ovation when he checked in and a loud one when he checked out for good. He spent 4 1/2 seasons with the franchise when it was in New Jersey and is third on the Nets' scoring list. His old team was a bit premature with its goodbye, playing a tribute video for Carter when the Hawks played here last year, though he had given no indication he planned to retire. He ended up coming back and became the first player to play 22 NBA seasons.\n\nIrving grew up in New Jersey as a fan of Carter and the Nets, and said he had Carter's jersey in his bag.\n\n“That was a kid’s dream to go see Vince Carter and Jason Kidd play, but specifically Vince Carter. He used to do some amazing things,\" Irving said. “It was incredible as a kid to watch. I don’t want to take it for granted how much he’s given up his life to sacrifice his time with his family and friends to be playing basketball for this long.\"\n\nFAN FAVORITES\n\nYoung and Irving are the leading vote-getters among Eastern Conference guards after the second returns of fan balloting for the NBA All-Star Game. Young had received 1,389,628 votes in totals announced Thursday, and Irving had 1,351,997.\n\nSTATEMENT SHIRTS\n\nThe Nets warmed up in shirts reading “No Place for Hate.\" The shirts were designed in collaboration with the Anti-Defamation League after a number of anti-Semitic attacks in Brooklyn over the past few months.\n\nUP NEXT\n\nHawks: Host Phoenix on Tuesday.\n\nNets: Host Utah on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764996681.878658
}