{
  "game_id": "0021700228",
  "espn_id": "400974979",
  "date": "Nov 18, 2017",
  "matchup": "CHA vs. LAC",
  "headline": "Walker, Hornets beat Clippers 102-87 to snap 6-game skid",
  "body": "CHARLOTTE, N.C. --  Kemba Walker exhaled loudly as he pulled up a chair and sat down in front of his locker.\n\n\"We really needed that win,\" Walker said.\n\nWalker had 26 points, Dwight Howard added 16 points and 16 rebounds and the Charlotte Hornets snapped a six-game losing streak with a 102-87 victory over the struggling Los Angeles Clippers on Saturday night.\n\nWalker, who was coming off a 47-point performance in a loss to the Chicago Bulls on Friday night, was 8 of 17 from the field and 6 of 9 from 3-point range despite a sprained wrist. He has made 11 of 17 3-pointers over the past two games.\n\nHe said he's finally regaining his stroke.\n\n\"I have been struggling to start the season with shooting the 3, but I am trying to stay positive and confident in my shot,\" Walker said. \"I just want to continue to be consistent.\"\n\nJeremy Lamb added 17 points for Charlotte.\n\nMeanwhile, the misery continues for the Clippers, who've lost eight straight games.\n\nLou Williams had 25 points, and Blake Griffin added 19, but the Clippers seemed to run out of gas in the fourth quarter on the second night of a back-to-back.\n\n\"I thought we were a little worn down tonight to be honest with you,\" said Clippers point guard Austin Rivers. \"Our effort could've been better but guys were just tired.\"\n\nCoach Doc Rivers said the Clippers are still trying to find their identity.\n\nThe Hornets led 73-71 entering the fourth quarter, but limited the Clippers to 6-of-20 shooting in the fourth quarter while forcing five turnovers.\n\nThe Hornets began to pull away midway through the fourth quarter.\n\nWalker extended the lead to eight when knocked down a 3-pointer from the left wing with 3 minutes to play.\n\nTIP INS\n\nClippers: DeAndre Jordan had 10 points and 14 rebounds. ... Shot 8 of 29 from 3-point range.\n\nHornets: Jeremy Lamb left the game with a right hamstring strain. ... Only had one turnover in the first half.\n\nBEVERLY EXPECTED BACK: Austin Rivers said he's hoping that getting Patrick Beverly back for the team's next game will give a shot in the arm to a team in need of one.\n\n\"It will help because it's another guard in there, but we'll figure it out. We're about 15 games in now, so we've got to get this going.\"\n\nCHECKING IT OUT: After committing a foul in the second quarter against Jordan, an unhappy Howard grabbed a television monitor located underneath the basket in hands waiting for the replay. Displeased with the call, Howard shook his head and returned to the court to line up for Jordan's foul shots.\n\nHoward had a funny moment earlier in the game when he accounted for Charlotte's only first half turnover when he inadvertently passed the ball to a wide open coach Steve Clifford. Clifford didn't seem to be expecting the rock.\n\nCARTER-WILLIAMS PLAYS MORE: Michael Carter-Williams returned after not playing in the last two games and logged 14 minutes.\n\nThat came at the expense of rookie Malik Monk, who did not play.\n\n\"We've been waiting for him to get his conditioning up and get up to speed on everything,\" Hornets coach Steve Clifford said. \"You lose six in a row, the defense has been bad -- and it's not Malik's fault -- it's just that's his position and you could see tonight he's a difference maker defensively, that's his strength. We've struggled with ball pressure.\"\n\nMonk could see more time in Lamb can't play against the Timberwolves.\n\nUP NEXT\n\nClippers: At New York on Monday night.\n\nHornets: Host Minnesota on Monday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993374.184007
}