{
  "game_id": "0021800247",
  "espn_id": "401070928",
  "date": "Nov 19, 2018",
  "matchup": "SAC vs. OKC",
  "headline": "Buddy Hield helps Kings turn back Russell Westbrook, Thunder",
  "body": "SACRAMENTO, Calif. -- The Kings sprinted out to a big lead and used their up-and-down style to put Oklahoma City on its heels. Then they got a big lift from Buddy Hield's perimeter shooting to finish off the Thunder.\nDave Joerger also got a bit of love from the Golden1 Center crowd after reports surfaced over the weekend that the Sacramento coach was at odds with management over the direction of the team.\nHield made three consecutive 3-pointers late in the fourth quarter and scored 25 points, Marvin Bagley III had his first career double-double and the Kings beat the Thunder 117-113 on Monday night to spoil Russell Westbrook's return.\n\"We're a hard-playing team and that's what our reputation going around the league is,\" Joerger said. \"In the first half we played maybe as fast as we've played since at Miami (on Oct. 29). We like to play that fast but we got tired. But we kept at it and kept battling.\"\nIman Shumpert scored 21 of his 23 points in the first half, Bogdan Bogdanovic added 16 points and the Kings beat the Thunder for the second time this season. Bagley, the second overall pick in the draft, had 15 points and 13 rebounds, while De'Aaron Fox had 13 assists.\nWestbrook had 29 points and 13 assists in his first game back in Billy Donovan's lineup since Nov. 5. The seven-time All-Star had missed five games with a left ankle sprain, then left the team Saturday to welcome the birth of twin daughters that same night. He flew to Sacramento and rejoined the Thunder on Monday morning.\n\"They were coming at us with their pace and we were kind of always backpedaling,\" Donovan said. \"We were never able to generate any force coming back.\"\nThe Kings blew a 19-point lead and were up 98-96 when Hield went on a tear from the perimeter. His first 3 extended the lead to 101-96. After Jerami Grant's floater for the Thunder, Hield made back-to-back shots beyond the arc.\nOklahoma City cut the gap to 115-113 on Paul George's fourth 3-pointer with 6.6 seconds remaining. Fox then made a pair of free throws to seal it for Sacramento.\n\"Right spots, right time,\" Hield said. \"Just trying to pick spots where I could read the defense and the stuff they were giving up.\"\nGeorge added 27 points and nine rebounds. Steven Adams had 11 points and 15 rebounds for Oklahoma City, which had been an NBA-best 10-1 over its previous 11 games.\n\"We didn't shoot well,\" George said. \"They sped the game up. We were winning at one point and we didn't finish this game out.\"\nThings got chippy early in the third quarter after Willie Cauley-Stein was fouled hard from behind by Westbrook while going for a layup. As he was going out of bounds Cauley-Stein appeared to shove Westbrook, who stumbled back before going after the Kings' 7-foot center. Adams intervened and grabbed Cauley-Stein, who then shoved Adams while the two were underneath the basket.\nCauley-Stein and Adams were called for offsetting technical fouls.\nTIP-INS\nThunder: Terrance Ferguson missed his second straight game for personal reasons. No timetable has been given for his return. ... Nerlens Noel sat out with an illness.\nKings: Sacramento was held to a season-low 15 points in the third quarter. The previous low was 17 against Miami on Oct. 29. The Kings had 10 assists on 15 buckets in the first quarter. ... Shumpert had 26 points in the Kings' 131-120 win over the Thunder in Oklahoma on Oct. 21. ... Kosta Koufos sat out a fourth consecutive game with right calf soreness.\nVOCAL SUPPORT\nJoerger received a standing ovation from the crowd of 16,250 during pregame introductions. Joerger was the subject of a story by Yahoo Sports that suggested the coach was in hot water with Kings management over his handling of the team's younger players, specifically Bagley, who has come off the bench in all 17 games this season.\n\"I love it here,\" Joerger said. \"Listening to the ovation tonight, that was really cool. I appreciated the pregame.\"\nUP NEXT\nThunder: Play at Golden State on Wednesday.\nKings: Play at Utah at Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994218.072607
}