{
  "game_id": "0022400779",
  "espn_id": "401705345",
  "date": "Feb 12, 2025",
  "matchup": "HOU vs. PHX",
  "headline": "Amen Thompson's triple-double helps Rockets rally for 119-111 win over Suns",
  "body": "HOUSTON -- — Amen Thompson had 18 points, 11 assists and 10 rebounds for his fourth career triple-double and the Houston Rockets used a big run late to get a 119-111 win over the Phoenix Suns Wednesday night.\n\n\r\n              It was the second triple-double this month after the second-year player also had one on Feb. 3. \n\n\r\n              The game was tied after a 3-pointer by Bol Bol before the Rockets used an 11-2 run to take a 115-106 lead with just more than a minute to go.\n\n\r\n              Jalen Green scored the first five points in that stretch before Dillon Brooks made consecutive 3-pointers to allow Houston to pull away.\n\n\r\n              Kevin Durant had 37 points for the short-handed Suns, who were missing Devin Booker, who sat out with a bruised lower back. The Suns lost their third in a row and for the sixth time in seven games. \n\n\r\n              They led by 8 entering the fourth quarter before Houston rallied for the victory. \n\n\r\n              Alperen Sengun had 17 points and 13 rebounds after sitting out most of Sunday’s game dealing with back spasms to help the Rockets win a second straight. Tari Eason added 25 points for Houston and Green had 22. \n\n\r\n              Takeaways \r\n              Suns: Durant continues to play at a high level, but the Suns need to get their other stars healthy to take some pressure off the 36-year-old.\n\n\r\n              Rockets: The Rockets used a balanced scoring attack to get the win with all five starters finishing with at least 17 points. \n\n\r\n              Key moment\r\n              A dunk by Durant got the Suns within 3 late before the two 3-pointers by Brooks put the game away.\n\n\r\n              Key stat\r\n              The Rockets scored 25 points off 17 Phoenix turnovers. \n\n\r\n              Up next\r\n              The Rockets host the Warriors on Thursday night and the Suns are off until they visit the Spurs after the All-Star break on Feb. 20.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997368.0679429
}