{
  "game_id": "0021800891",
  "espn_id": "401071564",
  "date": "Feb 23, 2019",
  "matchup": "MIL vs. MIN",
  "headline": "Middleton, Antetokounmpo lead Bucks past T-Wolves 140-128",
  "body": "MILWAUKEE --  Despite his team's latest win, Milwaukee Bucks coach Mike Budenholzer thought it was a subpar performance.\n\nKhris Middleton scored 20 of his 28 points in the second half, Giannis Antetokounmpo had 27 points and 10 rebounds, and the NBA-leading Bucks pulled away for a 140-128 victory over the short-handed Minnesota Timberwolves on Saturday night.\n\nThe Bucks (45-14) have won 10 of 11 and 16 of 18 to move a season-high 31 games over .500. They also surpassed last season's victory total.\n\n\"Our focus, our effort, everything wasn't to our standards,\" Budenholzer said. \"I feel from start to finish (it wasn't good defense), except in the fourth quarter.\"\n\nAntetokounmpo felt the same way.\n\n\"At the end of the day, we cannot just rely on our talent,\" he said. \"The past couple of games, we haven't been ourselves.\"\n\nMilwaukee just slipped by Boston 98-97 on Thursday when Kyrie Irving missed a potential game-winner in the lane as time expired.\n\n\"Not every night are we going to score 140 points,\" Antetokounmpo said. \"We have to play better defense. Hopefully, moving forward we can pick it up defensively.\"\n\nDerrick Rose had 23 points for the Timberwolves, who played without Karl-Anthony Towns for the second consecutive game.\n\nAfter the score was tied at 113, the Bucks finally pulled away in the fourth quarter with a decisive 16-2 run capped by Nikola Mirotic's driving layup and two free throws from Middleton that gave Milwaukee a 129-115 advantage with 4:58 to play.\n\nMinnesota never threatened after that as the Bucks dialed up their energy and improved to 25-5 at home.\n\n\"We just ran out of gas in the fourth quarter,\" Timberwolves coach Ryan Saunders said.\n\nBrook Lopez had 19 points for the Bucks and a technical foul for scowling at a prone Dario Saric after a dunk in the closing minutes.\n\nTaj Gibson scored a season-high 20 points for Minnesota, one better than his previous best set in Friday's night win over New York. Andrew Wiggins had 18 points and nine rebounds, and Anthony Tolliver finished with 17 points.\n\nThe Timberwolves overcame the first missed game of Towns' career to beat the Knicks 115-104 on Friday, but not the second.\n\nTowns' streak of 303 consecutive starts ended when he was placed in concussion protocol after being involved in a car accident Thursday on the way to the airport. He was cleared to fly to New York, but ruled out after further medical examination Friday. He accompanied the team to Milwaukee, but was unable to play due to the league's concussion program.\n\nThe 2015 No. 1 draft pick's streak of starts was the longest to begin a career since 1970-71. He just played in his second All-Star Game last weekend and is the team's leading scorer, averaging 23.1 points and 12 rebounds per game.\n\nWith Towns watching in street clothes, the Timberwolves' bench came up big, outscoring the Bucks' reserves 37-20 and hustling their way to a 70-69 Minnesota lead at halftime.\n\nTolliver, averaging 4.3 points, had 14 in the first half. Gibson and Wiggins each scored 12 and Rose had 10, including a floater in the lane that put Minnesota ahead at the break.\n\nRose scored seven points in the third, including a three-point play at the end of the period that gave Minnesota a 109-107 lead. Middleton scored 13 straight points in the quarter to keep the Bucks close.\n\nThe Timberwolves fell to 9-21 on the road.\n\nTIP-INS\n\nTimberwolves: Before the game, Towns took some initial steps toward being cleared to return. ... G Tyus Jones played in his third consecutive game after missing 13 with a sprained left ankle.\n\nBucks: G George Hill exited with a left adductor strain in the first half and did not return. ... The last time the teams met in October, the Bucks routed the Timberwolves 125-95 for Minnesota's worst home loss since 2011.\n\nSTAT LINE\n\nIt was the fifth time the Bucks have scored 140 points this season, a franchise record. Milwaukee is 5-0 in those games. Prior to this season, the Bucks had scored 140 or more points four times in 30 seasons.\n\nTAKE THAT\n\nTolliver stuffed Antetokounmpo's driving dunk attempt with 11 minutes left in the second quarter.\n\n\"It felt good,\" Tolliver said. \"I mean, he's dunked on me plenty of times in his career. Finally, I was able to get one back on him. He spun, and I jumped, and it worked out.\"\n\nAntetokounmpo was shocked.\n\n\"I didn't expect that, but he's a solid defender,\" he said. \"I looked at the tape. Maybe I didn't get as high as I thought. I hope next year he's not underneath the basket because I'm going to make sure that next time, I'm going to get it done.\"\n\nQUOTABLE\n\n\"We're missing him a lot,\" Wiggins said of Towns' absence. \"He's our rim protector. He challenges a lot of shots. He changes the game in a lot of different ways. We're definitely missing him.\"\n\nUP NEXT\n\nTimberwolves: Host the Sacramento Kings on Monday night.\n\nBucks: At the Chicago Bulls on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994468.313482
}