{
  "game_id": "0021600431",
  "espn_id": "400899873",
  "date": "Dec 21, 2016",
  "matchup": "MEM @ DET",
  "headline": "Gasol ties career high with 38, Grizzlies beat Pistons 98-86",
  "body": "AUBURN HILLS, Mich. --  Marc Gasol knew his shot would come back eventually.\n\nIt didn't take long.\n\nAfter shooting 29 percent during a three-game losing streak, Gasol went 14 for 17 and matched a career high with 38 points as the Memphis Grizzlies beat the Detroit Pistons 98-86 on Wednesday night.\n\n\"I knew I just had to keep shooting and keep trying to help the team as much as I could until things starting falling,\" said Gasol, who went 18 for 62 during the slump. \"Tonight I got going, and my teammates kept finding me. When you are making shots, everything seems easier.\"\n\nMemphis coach David Fizdale wasn't surprised that his team turned things around one night after losing in overtime to the Boston Celtics.\n\n\"This group never stays down for long,\" he said. \"It's a tough-minded team and all I have to do is keep them coming back.\"\n\nDetroit dropped its fourth straight, all by double figures.\n\n\"I was getting good looks, but everything was going in and out, which happens in this league,\" said Marcus Morris, who was 1 for 11 from the floor and guarded Gasol. \"Marc's a bad boy. He's 7-foot-1 and he's pump-faking before hitting 3s. That's tough to guard.\"\n\nDetroit's defense, which had infuriated coach Stan Van Gundy over the last three games, improved against Memphis. The Grizzlies shot 42.7 percent from the field, but hit 40 percent of their 3-pointers and added 22 points on 17 Pistons turnovers.\n\n\"I thought the defense was good enough to win, even with Marc having a career night,\" Van Gundy said. \"So that was a positive, and I thought we got good looks. But we couldn't put the ball in the basket and we turned it over way too many times, so we're still frustrated on offense.\"\n\nMemphis was boosted by the return of Chandler Parsons, who missed the previous 17 games with a bone bruise on his left knee. He had two points and two rebounds in 15 minutes.\n\nGasol was the only Grizzlies player to reach double figures until JaMychal Green got there with 1:03 to play.\n\nVan Gundy had planned to change his starting lineup after three straight losses, but Jon Leuer missed shootaround after being in a car accident. Leuer played, scoring 18 points, but Van Gundy decided to hold off on starting him until Friday against Golden State.\n\n\"Jon's been our most consistent player lately, so we wanted him on the floor as much as we could,\" Van Gundy said.\n\nReggie Jackson also scored 18 for the Pistons, while Andre Drummond had 13 points and 19 rebounds.\n\n\"This was definitely a step in the right direction,\" Jackson said. \"We need to get better, but we battled tonight. The effort was better than it has been. We just made too many mistakes.\"\n\nFor much of the first half, it looked as though the Pistons were headed for another blowout loss, as they trailed by as many as 18 points. A 16-2 run cut the deficit to 42-38, but Memphis pushed it back to nine at halftime.\n\nDetroit made another run in the third quarter, but was never able to get enough stops to pose a serious threat. Gasol scored 14 in the period -- his second double-digit quarter -- and Memphis took a 79-63 lead into the final 12 minutes.\n\nTIP-INS\n\nGrizzlies: Gasol gave Van Gundy a friendly pat on the backside after hitting a fadeaway jumper to give Memphis an 11-point lead late in the third. . The Grizzlies are 8-0 in the second game of back-to-backs.\n\nPistons: Despite the accident, Leuer played 17:21 in the first half, including the entire second quarter. ... Memphis' 22 points off Detroit turnovers were the most the Pistons have allowed this season.\n\nCONCERN OVER JACKSON\n\nJackson left the early in the first quarter with soreness in his left knee -- the one that caused him to miss the first 21 games of the season. He returned in the second period and played 23:31, but Van Gundy said the team will keep an eye on any continued problems with the knee. \"I thought I felt something in there, so I wanted to make sure everything was good, then I got back out there,\" Jackson said.\n\nFIRE DAMAGE\n\nThe game was played less than 36 hours after several local fire departments were called to put out a kitchen fire at the Palace of Auburn Hills. The blaze was extinguished quickly enough to prevent damage to game-day operations. The Pistons are leaving the Palace at season's end to move to Little Caesars Arena in downtown Detroit.\n\nUP NEXT\n\nGrizzlies: Host the Houston Rockets on Friday.\n\nPistons: Host the Golden State Warriors on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995612.670922
}