{
  "game_id": "0021300955",
  "espn_id": "400489828",
  "date": "Mar 11, 2014",
  "matchup": "OKC vs. HOU",
  "headline": "Kevin Durant, Russell Westbrook help Thunder get best of Rockets",
  "body": "OKLAHOMA CITY -- Russell Westbrook wouldn't say he wanted payback against Patrick Beverley.\nHis play said otherwise.\nDuring last year's playoffs, Beverley dived for the ball and ran into Westbrook's right knee as a timeout was being called, causing the injury that ended Westbrook's season and cost him about half of this season. In their first meeting since the incident, Westbrook had 24 points, seven assists and four steals to help the Oklahoma City Thunder defeat the Houston Rockets 106-98 on Tuesday night.\nBeverley finished with two points and five fouls in 25 minutes while being booed by a spirited crowd. His matchup with Westbrook highlighted a game filled with shoving, technical fouls, talking and even a flagrant foul.\n\"Two great teams that want to win: It's that simple,\" Houston's James Harden, who scored 28 points, said. \"When you get that anytime in the NBA, things are going to get physical.\"\nThe chippiness started early. Beverley swiped the ball away from Westbrook after a timeout with 6:10 left in the first quarter. Beverley and Westbrook had to be separated, and Beverley issued a technical foul. Beverley and Westbrook got tangled up again about a minute later, but again, Westbrook kept his cool. Durant said Westbrook's ability to turn the energy into a strong performance was impressive.\n\"He just went out there and played to win,\" Durant said. \"That's how Russell always plays -- with an edge, with that intensity, and tonight was no different.\"\nBeverley said he wasn't trying to get inside of Westbrook's head.\n\"That's how I play against everybody,\" he said. \"No personal battles out there today. I had to go out there and fight and do what I do to try to help our team win a basketball game today.\"\nIf anything, the intensity initiated by the Rockets worked against them.\n\"I think if we just stick to what we do and do it to the best of our abilities, no matter what's going on, we'll be good,\" Harden said. \"Sometimes we kind of veer off, kind of get distracted a little bit.\"\nDurant scored 42 points and Serge Ibaka had 12 points, 16 rebounds and four blocks for the Thunder, who had lost two straight.\nChandler Parsons scored 19 and Dwight Howard had nine points and 10 rebounds for the Rockets. Houston had won five straight, including victories over Miami, Indiana and Portland.\nMidway through the second quarter, Harden and backup Oklahoma City point guard Reggie Jackson had to be separated.\nWestbrook spent the rest of the second quarter dominating Beverley. Westbrook blew past him for a layup, then lost him on a screen and made a 3-pointer to put the Thunder up 49-32. Westbrook drew Beverley's third foul on a 3-point attempt with 2:50 left in the first half. Westbrook scored 11 points in the final 6:19 of the quarter to help the Thunder take a 56-41 lead at the break. Oklahoma City held Houston to 35 percent shooting in the first half.\nHoward committed his third and fourth fouls in the first two minutes of the third quarter, and Beverley committed his fourth with 8:52 left in the third as the Thunder maintained control.\nOklahoma City led by 18 at one point in the third quarter, but the Rockets chipped away late in the period and trailed 77-67 heading into the fourth.\nHouston rallied, and a 3-pointer by Francisco Garcia and a dunk by Omer Asik cut Oklahoma City's lead to 77-72 early in the fourth. Durant answered with five straight points to put the Thunder back in control.\nThe game remained chippy. Garcia got hit in the face by Durant, drawing a technical. Harden hit a 3-pointer with Derek Fisher in his face to trim Oklahoma City's lead to 97-92 with 2:23 to go.\nWestbrook drew Beverley's fifth foul on a 3-point attempt, drawing a cheer from the crowd. Westbrook drained all three free throws to put the Thunder up 102-94 with 1:31 to play. Durant said the Thunder closed the game the right way after Houston's surge.\n\"Stay calm,\" he said. \"Stay cool. Try not to panic.\"\nGame notes\nThunder coach Scott Brooks said before the game that C Kendrick Perkins (left groin strain) and Thabo Sefolosha (left calf strain) are a ways from being ready to play. Perkins was hurt Feb. 20 against Miami. Sefolosha was injured Feb. 28 against Memphis. ... Durant scored 12 points in the first quarter. ... Oklahoma City's post players combined to commit seven fouls in the first quarter. ... Howard was called for a technical foul in the second quarter after disagreeing with an offensive foul call. ... Oklahoma City center Steven Adams was called for a flagrant 1 for making contact with Harden's head.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764992843.112694
}