{
  "game_id": "0021800511",
  "espn_id": "401071187",
  "date": "Dec 26, 2018",
  "matchup": "SAC @ LAC",
  "headline": "Bench helps Clippers hang on for 127-118 win over Kings",
  "body": "LOS ANGELES --  With a 27-point lead quickly disappearing, Los Angeles Clippers coach Doc Rivers was left with little choice.\n\nIt was time to put his five best players back on the floor for the final three minutes.\n\n\"I had to,\" Rivers said after the Clippers held off the hard-charging Sacramento Kings 127-118 on Wednesday night. \"The concern level was, can they muster it up? My guess was that somebody had probably taken their (ankle) tape off. Who knows? But they were ready to play and they took care of business as they should.\"\n\nLou Williams scored 24 points, Montrezl Harrell added 22 and the Clippers' reserves led the way even though every Los Angeles starter reached double figures for the first time this season. Tobias Harris had 17 points and Avery Bradley scored 15.\n\nDe'Aaron Fox finished with 19 points and Bogdan Bogdanovic had 13 for the Kings, who put together a 19-0 run in the fourth quarter to give the Clippers a scare. Buddy Hield scored 11, ending his seven-game streak with 20 or more.\n\n\"We've got to do a better job defending,\" Kings coach Dave Joerger said. \"We struggled to defend again. We allowed 71 points in the first half, too many points in the paint, they shot 50 percent and had 14 offensive rebounds. That's too high a number. Too many straight-line drives to the basket.\"\n\nAnd yet the Kings made a run just as the Clippers thought they might. Sacramento overcame 19-point deficits to win each of its previous two games.\n\n\"We know that is a team that fights from being down a lot,\" Harrell said. \"We know this team has been down 19, 20-plus points before and they made runs to come back. We give them credit for what they do well. We put the bench in and guys didn't go in ready.\"\n\nHarrell and Williams technically are members of that bench as well. But in the fourth quarter, with games on the line, both see playing time. And even that unit had trouble stopping the momentum supplied mostly by Sacramento's backups.\n\n\"All those guys were ready for their opportunities and they got it today,\" Fox said. \"Everybody was ready. Guys just came out to play. Our starting group, the guys that play a lot, we cheer for them. That's just the type of group we are.\"\n\nYogi Ferrell's jumper with 2:14 left pulled the Kings to 119-115, but Harrell scored inside on the Clippers' next trip down the floor for the first Los Angeles field goal since Williams hit a 3-pointer with 8:14 to go.\n\nFrank Mason's 3-pointer got the Kings to 121-118 with 1:12 left, but Williams followed with a fadeaway with 42 seconds remaining and the Clippers sealed the game from the free throw line.\n\nDanilo Gallinari had 14 points, Shai Gilgeous-Alexander scored 12 and Boban Marjanovic added 11 for the Clippers, who have won three of four.\n\nIman Shumpert scored 12 points for the Kings. Nemanja Bjelica and Willie Cauley-Stein each added 11.\n\n\"They played with a lot of energy. They came in and were an aggressive team,\" Gallinari said. \"They were shooting all of their shots and most of them were open shots. It's OK, we got the win.\"\n\nThe Clippers opened a 39-27 lead after one quarter and held a comfortable margin until the closing minutes. Harrell had 15 points in just 13 first-half minutes as Los Angeles took a 71-56 lead into halftime.\n\nJUST LIKE CHUCK\n\nRivers compared Harrell to another high-motor guy he used to play against: Charles Barkley. The comparison was fitting after Harrell had nine rebounds, five blocked shots and two steals.\n\n\"He's so relentless and at one point with the rebounds under the basket, he reminds you of Barkley at times,\" Rivers said. \"When you played against Barkley, you felt like it was his ball, like he was due the basketball. It was almost like he was entitled to it and that's how (Harrell) plays.\"\n\nHarrell appreciated the comparison.\n\n\"It's a blessing, man,\" Harrell said. \"That's one of the game's greats as a power forward. He was an undersized guy who definitely competed and he was a force to be reckoned with. It's a blessing that my coach feels that way about me, but I can't stop there. I have to keep working.\"\n\nTIP-INS\n\nKings: Sacramento opened 0 of 9 from 3-point range and went 1 for 13 in the first half. ... The Kings have given up 71 points in the first half to the Clippers in each of the past two games between the teams.\n\nClippers: Gilgeous-Alexander reached double figures 10:50 into the game after failing to score 10 points in seven of 13 games this month. ... Williams played 22 minutes despite residual swelling in his left eyelid after he was injured Sunday against the Warriors.\n\nUP NEXT\n\nKings: Host the Los Angeles Lakers on Thursday.\n\nClippers: At the Los Angeles Lakers on Friday.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994877.8219368
}