{
  "game_id": "0022200580",
  "espn_id": "401468735",
  "date": "Jan 06, 2023",
  "matchup": "IND vs. POR",
  "headline": "Turner, Haliburton leads Pacers past Trail Blazers 108-99",
  "body": "INDIANAPOLIS -- — Indiana Pacers guard Tyrese Haliburton cranked up the offense during Friday night's final stretch. Everyone else embraced doing the dirty work on defense.\n\n\r\n              Together, it was an unbeatable combination.\n\n\r\n              With Haliburton scoring seven of his 15 points in the final six minutes, Myles Turner protecting the rim and Aaron Nesmith stealing extra possessions, the Pacers used shutdown D to rally past the Portland Trail Blazers 108-99.\n\n\r\n              “We were flying around,” coach Rick Carlisle said. “You have to double-team (Damian) Lillard and we trapped him in the backcourt a couple times. But the one constant is Myles around the basket. There are very few guys who have that presence around the rim and allow you to play with a smaller lineup. Myles was always there.”\n\n\r\n              Even if the numbers weren't eye-popping.\n\n\r\n              On a night when Bennedict Mathurin scored 19 points and Haliburton had 12 assists, Turner finished with 17 points and eight rebounds as Indiana scored the final nine points and finished the game on a 15-2 run.\n\n\r\n              The surprising Pacers have won five straight home games and seven of their last nine overall.\n\n\r\n              Portland was led by Anfernee Simons with 20 points. Lillard had 19 points and eight assists, and Jusuf Nurkic added 14 points and 19 rebounds — not enough for the Trail Blazers to avoid their third loss in four games.\n\n\r\n              “We just haven't been good enough down the stretch in this stretch of games,” Lillard said. “We haven't made shots, we've had turnovers, and teams have been able to outplay us in those closing runs. That's when we have to be our sharpest.”\n\n\r\n              Instead, it was the Pacers who took advantage after Portland overcame an eight-point deficit in the third quarter to take an 82-81 lead into the fourth. The Trail Blazers started that period fast, too, jumping ahead 88-83.\n\n\r\n              And when the Pacers tied the score at 93 on Mathurin's layup with 7:54 to go, Portland answered with four straight points.\n\n\r\n              That's when Indiana turned up the pressure, allowing just two free throws and no baskets over the final six minutes. Haliburton broke a 97-all tie with a short runner and, after Lillard's free throws tied it, Nesmith's basket with 2:06 to go gave Indiana the lead for good.\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Josh Hart fell just short of his first career triple-double. He had 12 points, 10 rebounds and eight assists. ... Portland had a 52-42 rebounding advantage, which was offset by 18 turnovers. ... The Trail Blazers went 9 of 33 on 3-pointers after entering the game tied for the NBA's third-best 3-point shooting percentage.\n\n\r\n              Pacers: Isaiah Jackson finished with 12 points. ... Buddy Hield scored 11 and made two 3s, his 17th consecutive game with multiple 3s. ... Backup forward Jalen Smith did not play. ... Indiana has won a league-high nine times this season after trailing by double digits.\n\n\r\n              “Basically, we needed our best perimeter defenders in the game and that's (Andrew) Nembhard and Nesmith,” Carlisle said. “Fortunately, Nesmith got his hands on some balls for us.”\n\n\r\n              HOME COURT\n\n\r\n              Indiana is 14-7 at home, a dramatic improvement over the past two seasons. And with one of this season's bigger crowds watching Friday night, Carlisle thought it made a difference.\n\n\r\n              “When you're a team like us, playing in Portland three or four weeks ago, or them playing here and the crowd really gets into it, it's hard,” Carlisle said. “It's really, really hard.”\n\n\r\n              SECOND LOOK\n\n\r\n              Portland coach Chauncey Billups essentially said he would re-evaluate his late-game strategies after losing for sixth time in eight games — this time by the largest margin during that span. But Lillard said it's not Billups who needs to make changes.\n\n\r\n              “I think as a player, you take responsibility for what happens,” he said. “A lot of it is not new. We know what it takes to win games, it's just not easy.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Make their final stop on a three-game trip Sunday at Toronto.\n\n\r\n              Pacers: Host the Charlotte Hornets on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994327.546386
}