{
  "game_id": "0021500024",
  "espn_id": "400827911",
  "date": "Oct 30, 2015",
  "matchup": "TOR @ BOS",
  "headline": "Raptors roll over Celtics 113-103",
  "body": "BOSTON -- Strong defense helped Toronto weather an ugly first half. Then the Raptors dominated the second.\nDeMar DeRozan scored 23 points and Terrence Ross had 13 of his 21 in the fourth quarter as the Raptors took command in the final two quarters and beat the Boston Celtics 113-103 on Friday night.\n\"We were playing great defense. Our offense wasn't clicking,\" said DeMarre Carroll, who led Toronto's second-half resurgence with 10 of his 21 points in the third quarter. \"We just got more aggressive. We got out and kept running.\"\nAfter Carroll got the Raptors' offense going in the third quarter, it was Ross' turn in the fourth. Ross hit six of his first seven shots in the final period to help the Raptors secure the lead they built in the third quarter by capitalizing on Boston's many mistakes.\n\nToronto blew open a 54-all tie at halftime, outscoring Boston 30-21 in the third quarter and pulling away to a 19-point lead in the fourth.\n\"Terrence Ross got going,\" said Avery Bradley, who had 13 points for Boston. \"You can't let that happen. We at least have to be aware of that and I don't even think we knew he got going.\"\nIsaiah Thomas had 25 points and seven assists for Boston, which never recovered after Toronto took off early in the third quarter. The Raptors forced the Celtics into a sequence of turnovers and missed shots while holding Boston without a field goal for nearly 5 minutes.\n\"We had an opportunity to get some stops, get out in transition,\" Toronto coach Dwane Casey said.\nCarroll hit consecutive 3-pointers and Luis Scola made a layup and a 3-pointer during a 13-2 run that gave Toronto an 82-68 lead.\nBoston went without a field goal from Amir Johnson's 3-pointer with 6:05 left in the period until Thomas drove for a layup with 52 seconds left.\n\"We had a lot of misses. Some of them were good looks, some of them weren't,\" Boston coach Brad Stevens said. \"We have to move the ball better and continue to probe for better shots.\"\nTORONTO ON TOP\nToronto has won the Atlantic Division the last two seasons and gave the Celtics an early lesson in what it will take to dethrone the Raptors.\n\"It's Game 2. We're not as good as these guys right now. I think that was pretty evident and clear for everyone to see,\" Stevens said.\nROSS' ROLE\nRoss said he's fine being one of the Raptors' top reserves, leaving the starring roles to players like DeRozan and Carroll.\n\"Coming off the bench helps me because you see what the team needs to work on,\" Ross said. \"It helps you focus on what you can do. I actually like it a little better.\"\nTIP-INS\nRaptors: Kyle Lowry finished with 14 points and nine assists. ... Jonas Valanciunas pulled down 10 rebounds and Toronto outrebounded Boston 53-38. ... Toronto made just 13 field goals in the first half, but seven were 3-pointers.\nCeltics: Thomas scored 27 points in the Celtics' win over Philadelphia in the season opener. His 52 points through two games are twice as much as Boston's second-leading scorer, Johnson, with 26. ... Kelly Olynyk and Johnson scored 11 points apiece for Boston while Tyler Zeller added 10.\nUP NEXT\nRaptors: Host Milwaukee on Sunday night.\nCeltics: Host San Antonio on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994775.684763
}