{
  "game_id": "0021700563",
  "espn_id": "400975309",
  "date": "Jan 03, 2018",
  "matchup": "PHX @ DEN",
  "headline": "Gary Harris scores 36 points, Nuggets beat Suns 134-111",
  "body": "DENVER --  The Phoenix Suns didn't get to Denver until around 2 p.m. Wednesday because of plane trouble.\n\nThey can thank Gary Harris for making their trip even more unbearable.\n\nHarris scored 28 of his 36 points in the first half and the Nuggets used a big third quarter to beat Phoenix 134-111 on Wednesday night.\n\nHarris tied his career high for points, finishing 14 of 17 from the field. Nikola Jokic added 14 points, nine rebounds and eight assists to help the Nuggets stop a two-game slide and improve to 13-4 at home this season.\n\n\"You see how he's aggressive?\" Jokic said of Harris. \"That's how he's supposed to be. That's how he's supposed to play.\"\n\nWilson Chandler added 17 points, Trey Lyles had 16 and Jamal Murray 13.\n\nDenver used a 37-18 third quarter to take control.\n\nDevin Booker led Phoenix with 17 points. Greg Monroe filled in for starting center Tyson Chandler and had 16 points and 10 rebounds. Marquese Chriss added 16 points, Josh Jackson scored 14 and TJ Warren had 13.\n\nThe Suns had some issues getting to Denver after their 104-103 comeback victory over the Atlanta Hawks in Phoenix on Tuesday night. Waiting at Sky Harbor International Airport until 2 a.m., the Suns were finally sent home as mechanical problems delayed their flight until noon.\n\n\"We try not to make no excuses,\" said Phoenix guard Isaiah Canaan, who had 11 points off the bench. \"Obviously, it was a tough travel day. It's part of the game and it's our job. We've got to come out and play no matter what the circumstance is.\"\n\nHarris hit his first eight shots and finished the opening quarter 9 of 10 from the field. He had 20 points in the first 10:34, including a nifty reverse layup that fooled two defenders. His driving layup late in the quarter put the Nuggets up 34-22.\n\nThe Suns responded, though, outscoring Denver 45-27 in the final 13:09 of the half. They shot 16 of 21 from the field in the second and led 67-61 at the break.\n\n\"They scored so easy,\" Denver coach Michael Malone said. \"I told our guys at halftime, 76 percent, 41 points, a team that had just played three games in four nights -- that is embarrassing. We should all be embarrassed by that. Now let's go do something about it.\"\n\nDenver took over after that, as the Suns hit only five of their first 28 shots in the third.\n\nTIP-INS\n\nSuns: Chandler (rest) sat out, while Monroe got the start for his first game action since Dec. 21. ... Jackson, the Suns' first-round draft pick, logged 24 minutes after not playing for the first time this season Tuesday.\n\nNuggets: Monroe blocked Warren at the basket in the final seconds of the first half and Jokic picked it up and heaved a full-court pass to Harris, who tapped in a layup at the buzzer. Harris finished the half 12 of 13 from the field. ... SG Will Barton played despite illness and had 12 points. ... PF Juancho Hernangomez (coach's decision) missed his fourth straight game. The 22-year-old Spaniard has logged only 3 minutes of playing time in the team's last nine games. ... Broncos general manager John Elway sat courtside. ... PF Kenneth Faried had four points and two rebounds in his first action since Dec. 15.\n\nEASY CONNECTION\n\nWith Elway in the house, Jokic showed off an electric passing game of his own. Off a Phoenix turnover late in the third, Jokic flipped a behind-the-back pass down the court to Malik Beasley, who finished it with a wide-open slam. The two also connected on a few other highlight-reel breaks in the half.\n\n\"He said to me, `I'm going to run so just find me,\" Jokic said. \"You could see he was running fast.\"\n\nJET LAG\n\nAfter a 41-point second quarter, the Suns scored only 44 the rest of the way.\n\n\"We didn't execute as well,\" Chriss said. \"Lacking energy and being at this altitude you need to lock in a little bit more and we didn't play the way we wanted to play.\"\n\nUP NEXT\n\nSuns: At San Antonio on Friday night.\n\nNuggets: Host Utah on Friday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993908.579773
}