{
  "game_id": "0022000754",
  "espn_id": "401307545",
  "date": "Apr 03, 2021",
  "matchup": "MIL @ SAC",
  "headline": "Bucks slip past Kings 129-128 without Antetokounmpo",
  "body": "SACRAMENTO, Calif. -- — Jrue Holiday scored a season-high 33 points to go with 11 assists and seven rebounds, and the Milwaukee Bucks overcame the absence of Giannis Antetokounmpo to beat the Sacramento Kings 129-128 on Saturday night.\n\n\r\n                    Brook Lopez had 26 points and Donte DiVincenzo added 12 points, seven assists and a season-best 14 rebounds for Milwaukee. The Bucks have won three straight following consecutive losses to the Celtics, Knicks and Clippers.\n\n\r\n                    “(Holiday) did a lot of things for us,” Bucks coach Mike Budenholzer said. “We kind of needed every bit he gave us. I think he used up the whole tank tonight. We kind of got a little shaky down the stretch but he bailed us out and was relentless. He wasn’t going to let us lose.”\n\n\r\n                    De’Aaron Fox scored 27 points for Sacramento, and Terence Davis had a season-high 27 off the bench. Buddy Hield scored 19 and Tyrese Haliburton added 12 points and 11 assists. \n\n\r\n                    Antetokounmpo was held out because of left knee soreness, one night after the reigning two-time MVP scored 47 points in a 127-109 win over Portland.\n\n\r\n                    Minus their leading scorer, the Bucks led most of the way but needed six points from Holiday in the final 2:23 and a heads-up timeout by Khris Middleton to hold on. \n\n\r\n                    “I know when Giannis is in the game he is always in the paint and he is always putting pressure on the defense,” Holiday said. “When he wasn’t playing tonight (I was) just doing the same thing and trying to make plays for other people. I took more opportunities to attack the basket.”\n\n\r\n                    Middleton struggled with his shot most of the night and was boxed in by two defenders near the baseline by the Kings’ bench with 13.4 seconds remaining and the Bucks up by four. Just before going out of bounds, Middleton called a timeout. The referees gave it to him as several Sacramento coaches yelled in protest.\n\n\r\n                    “That’s what’s special about our team,” DiVincenzo said. “Giannis doesn’t play and somebody steps up.”\n\n\r\n                    Kings coach Luke Walton called it part of a frustrating night for his team.\n\n\r\n                    “We really have to understand that, and we should get this by now, it takes to as close of 48 minutes of hard competing, high intensity to win games,” Walton said. “In these last three games we’re only finding that for parts of that. Some teams can do that. We’re not one of them.”\n\n\r\n                    Pat Connaughton, who started in place of Antetokounmpo, made three free throws over the final nine seconds to help Milwaukee hang on.\n\n\r\n                    The Bucks have won 10 straight against the Kings.\n\n\r\n                    WHERE’S THE DEFENSE?\n\n\r\n                    The Kings have had one of the top offenses in the league all season and went into the game seventh in the NBA in scoring. It’s the other side of the ball where Walton’s team is having its biggest problems.\n\n\r\n                    “We can’t stop people,” Walton said. “How we play offense, we want to play defense the same way. As of right now, it’s anything but that. For the most part it feels like take what you want from us on that end.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Middleton missed 11 of his first 12 shots. … DiVincenzo has four double-doubles this season.\n\n\r\n                    Kings: Marvin Bagley III (broken finger) remains out. … Reserve guard DaQuan Jeffries was waived. Jeffries averaged 3.5 points in 18 games this season. \n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Visit the Warriors on Tuesday. Milwaukee has won two straight against Golden State, including a 138-99 victory this season.\n\n\r\n                    Kings: Face the Timberwolves in Minnesota on Monday. The teams will play a back-to-back in Sacramento later this month.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997655.602758
}