{
  "game_id": "0022300807",
  "espn_id": "401585435",
  "date": "Feb 23, 2024",
  "matchup": "MEM vs. LAC",
  "headline": "Kawhi Leonard and Terance Mann lead Clippers to 101-95 victory over Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Kawhi Leonard scored 24 points, Terance Mann had a season-high 23 points and 12 rebounds and the Los Angeles Clippers pulled away in the fourth quarter for a 101-95 victory over the Memphis Grizzlies on Friday night.\n\n\r\n              Paul George added 14 points for Los Angeles and Ivica Zubac finished with 10 points and 10 rebounds before fouling out in the fourth quarter. Mann's 12 rebounds were two short of his career best.\n\n\r\n              “We were able to get stops at the end and make shots,” Leonard said of the Clippers play to pull out the victory.\n\n\r\n              Jaren Jackson Jr. led Memphis with 29 points. GG Jackson had with 11 points, Ziaire Williams scored 10 and Vince Williams had eight assists for his sixth straight game with at least seven.\n\n\r\n              Through three quarters, the game remained close as neither team led by double digits and there were 11 lead changes and eight ties at that point. The Clippers carried a 79-75 lead into the fourth, after outscoring Memphis 26-16 in the third. But things remained close in the fourth. \n\n\r\n              The 17th — and final — lead change came with 1:35 left when Leonard converted a turnover by Memphis into a dunk. Mann rebounded a miss for a dunk 24 seconds later to put the Clippers up 96-93. A 3-pointer by James Harden with 46.2 seconds left, his only basket of the night, put the game out of Memphis' reach.\n\n\r\n              “That's what great players do,” Clippers coach Tyronn Lue said of Harden's basket. “Made that big 3 down the stretch. That was huge for us.”\n\n\r\n              Despite the Clippers' rush at the end, Memphis pushed Los Angeles, which remained in third place in the Western Conference. Some Grizzlies turnovers and some offensive rebounds by Los Angeles, such as Mann's follow-up dunk, hurt Memphis' chances.\n\n\r\n              “I think we should have won, honestly,” said Memphis reserve Lamar Stevens, who finished with eight points and eight rebounds, along with a block. “I don't really like the moral victory stuff. I think we should have won. I think we kind of gave that one away down the stretch.”\n\n\r\n              The game, which included 11 ties, was the first after the All-Star break for the Grizzlies. The Clippers came off a 129-107 loss at Oklahoma City when they returned to action Thursday night.\n\n\r\n              The Clippers had 14 turnovers in the loss to Oklahoma City, a number that concerned Lue. Then they added 21 against Memphis, including five by George and six by Leonard. That was compared to 20 assists. The Clippers coach said part of the problem was the Grizzlies' physical play and the pressure Memphis put on Los Angeles. That took the Clippers out of their offensive rhythm.\n\n\r\n              “We've got to be able to handle that pressure,” Lue said. “To have more turnovers than you have assists, it's hard to win a game like that.”\n\n\r\n              Clippers forward P.J. Tucker, who was fined $75,000 by the league earlier this month for publicly demanding a trade, played in his first game since Nov. 27 when he entered in the first quarter. He finished with three rebounds and no points in 14 minutes.\n\n\r\n              A tightly played first half turned into a 59-53 Grizzlies lead at intermission thanks to a 12-2 run by Memphis late in the second quarter. The Clippers were stymied by a dozen first-half turnovers — Leonard with four and George and Russell Westbrook with three each.\n\n\r\n              For Memphis, the win snapped a two-game winning streak, but was a continuation of the short-handed Grizzlies giving some of the league's better teams a tough time. Even before the winning steak, Memphis had played teams close. \n\n\r\n              “In the great words of Confucius, ‘You have to see beauty in everything,’” veteran Memphis guard Derrick Rose said. “That's what we are doing right now.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Home against Sacramento on Sunday.\n\n\r\n              Grizzlies: Host Brooklyn on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996009.594271
}