{
  "game_id": "0021901269",
  "espn_id": "401224744",
  "date": "Aug 06, 2020",
  "matchup": "MIL vs. MIA",
  "headline": "Bucks clinch top see in East with 130-116 win over Heat",
  "body": "LAKE BUENA VISTA, Fla. --  Giannis Antetokounmpo and Khris Middleton scored 33 points each, and the Milwaukee Bucks overcame a huge early deficit to get a 130-116 win over the Miami Heat on Thursday to clinch the top seed in the Eastern Conference.\n\nThe Heat led by as many as 23 points in a first half where the team piled up 73 points despite playing without Jimmy Butler and Goran Dragic. Miami cooled off after the break and the Bucks took the lead in the third quarter but were down by 6 to start the fourth.\n\nAntetokounmpo sat out about five minutes of the fourth quarter after collecting his fifth foul with 11 minutes to go. Milwaukee trailed by 1 with about five minutes remaining before using a 20-0 run, with three dunks from Antetokounmpo, to make it 130-111 with less than a minute to go and cruise to the victory.\n\n\"They were just getting everything they wanted in the first half,\" Milwaukee coach Mike Budenholzer said. \"We just felt like we made it more difficult on them in the second half. We wore them down.\"\n\nAntetokounmpo and Middleton played 30 and 34 minutes respectively after the stars both sat out the entire second half of their last game on Tuesday.\n\nDuncan Robinson had 21 points for the Heat, who lost to Milwaukee for the first time this season after winning the first two meetings.\n\nIt's the second straight year the Bucks have had the best record in the East.\n\n\"It's a tribute to our players and what they've done every night and how they've brought it ... (but) we have a lot more work to do,\" Budenholzer said.\n\nThe Heat led by 6 with about 11 minutes left in the fourth quarter when Antetokounmpo picked up his fifth foul on a charge and headed to the bench. Andre Iguodala made a 3 for Miami before the Bucks scored the next 13 points, capped by a 3 from Bledsoe, to take a 107-103 lead with about seven minutes remaining.\n\nRobinson made a 3-pointer to end a scoring drought of almost four minutes for Miami with about 6  1/2 minutes to go and Antetokounmpo re-entered the game soon after that.\n\nThe Heat led by 12 with about 10 minutes left in third quarter before Milwaukee used a 16-3 run to take an 82-81 lead with five minutes left in the quarter. Antetokounmpo and Wesley Matthews each had five points each in that span to help close the gap.\n\nThe Bucks cut the lead to 3 with a dunk by Antetokounmpo late in the third. But the Heat wrapped up the quarter with a 5-2 spurt to take a 98-92 lead into the fourth.\n\n\"It's not like we were up 40. The way the NBA game is now you have to play consistently for 48 minutes,\" Heat coach Erik Spoelstra said. \"There's going to be a lot of ebbs and flows back and forth. You have to give them credit. They stepped up their pressure. We felt that more in the second half.\"\n\nTIP-INS\n\nHeat: Butler missed his second straight game with a sore right ankle. ... Dragic sat out with a sprained left ankle after injuring it Tuesday. ... Miami had 19 turnovers.\n\nBucks: Bledsoe had nine points and five assists in his second game back after missing the first two games in the bubble after testing positive for the coronavirus. ... It's the second straight game where Milwaukee allowed 73 points in the first half after the Nets also had 73 before halftime en route to a 119-116 win on Tuesday.\n\nUP NEXT\n\nHeat: Play the Suns on Saturday night.\n\nBucks: Play Dallas on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996120.589173
}