{
  "game_id": "0022301104",
  "espn_id": "401585732",
  "date": "Apr 03, 2024",
  "matchup": "ATL vs. DET",
  "headline": "Jalen Johnson has 28 points, 14 rebounds, Hawks clinch play-in berth with 121-113 win over Pistons",
  "body": "ATLANTA -- — Jalen Johnson had 28 points, 14 rebounds and 11 assists for his first career triple-double and the Atlanta Hawks overcame a 50-point effort by Detroit's Malachi Flynn for a 121-113 win over the Pistons on Wednesday night that clinched a berth in the Eastern Conference play-in tournament.\n\n\r\n              “It is always good to have an opportunity to play in the postseason,” Hawks coach Quin Snyder said. “If we’re ninth, 10th, sixth, whatever it is. Hopefully we can continue to get better and we’ll cross that bridge when we come to it.”\n\n\r\n              De’Andre Hunter scored 26 points and Dejounte Murray finished with 24 points and 11 assists for the Hawks, who have won six of their last seven games.\n\n\r\n              Flynn, whose previous career high was 27, was 18 for 25 from the floor and 9 for 12 at the line. The 50 points was a franchise record for a reserve. He also had a season-high six rebounds, five assists and five steals in 34 minutes. \n\n\r\n              The Pistons have lost 10 of their last 11 games.\n\n\r\n              “Right now, its tough because at the end of the day you want to win,” Flynn said. “But it does feel good to kind of take in the moment. I’m sure a couple of days from now, it will feel really good.”\n\n\r\n              Jalen Duren and Marcus Sasser had 11 points each for the Pistons.\n\n\r\n              Johnson's 11 assists were a career high. His best was a second-quarter alley-oop to Murray that capped a fast break and led to a Pistons timeout.\n\n\r\n              “He’s a basketball player,” Snyder said. “He can shoot, pass, handle. He doesn’t predetermine what he is going to do. ... He played a really, really impressive game.”\n\n\r\n              Cade Cunningham, who averages 22.7 points per game, was a late scratch with left knee injury after initially being listed in the starting lineup for Detroit.\n\n\r\n              The Hawks were 1 for 11 from 3-point range to start the game, but still managed to build a 59-50 halftime lead. Every time the Hawks started to pull away, Flynn helped the Pistons respond with buckets from all over the floor.\n\n\r\n              “He was making contested shots and he got to the foul line, which got him going,” Snyder said. “We tried to get more aggressive on him and impact him, and he still made plays. He played great.”\n\n\r\n              The Pistons pulled to within five points late in the fourth quarter, but could get no closer.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit the Grizzlies on Friday night.\n\n\r\n              Hawks: At the Mavericks on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996263.1166668
}