{
  "game_id": "0021800405",
  "espn_id": "401071086",
  "date": "Dec 12, 2018",
  "matchup": "CHA vs. DET",
  "headline": "Malik Monk scolded by MJ after early celebration nearly costs Hornets",
  "body": "CHARLOTTE, N.C. -- The Hornets celebrated too soon and then weren't sure whether they'd be celebrating at all. Meanwhile, team owner Michael Jordan chewed out one of his own players.\nJeremy Lamb's first NBA buzzer-beater was no ordinary game-winning shot.\nLamb knocked down a 22-foot jumper from the right wing with three-tenths of a second left, then had to wait to see whether it counted after the Hornets were assessed a technical foul for having too many players on the floor. The basket was upheld, and the Hornets escaped with a 108-107 win over the Detroit Pistons on Wednesday night after trailing by 10 late in the fourth quarter.\nAs Lamb thrust out his chest and yelled, and the crowd erupted with screams, officials quickly blew the whistle and gathered at the scorer's table to check the replay monitor.\nReplays showed Malik Monk and later Bismack Biyombo had come off the bench and run several yards onto the floor in anticipation of Lamb making the shot at the other end.\n\"I thought they were going to call like three techs, get three free throws -- something like that,\" Lamb said.\nAs Monk, a second-year player from Kentucky, retreated to the bench, he got chewed out by Jordan, a six-time NBA champion who was sitting at the end of the bench. Jordan playfully slapped at the back of Monk's head -- twice. Monk smiled with a touch of embarrassment.\n\nThe Pistons, trailing by two at the time, were only given one technical foul shot, which they made. Detroit's ensuing long inbounds pass was intercepted as time expired.\n\"My heart stopped for a second there,\" said Hornets coach James Borrego, who noted that he had never previously seen that call made in professional basketball.\nThe Associated Press requested clarification on the call after the game, but the officials already had left the arena and were unavailable for comment.\nThe Pistons weren't upset over the ruling.\nDetroit guard Langston Galloway was more irritated that the Pistons went almost six minutes without a field goal late in the fourth quarter, surrendered a 10-point lead and allowed Lamb to make the jumper on a simple drive-and-kick from Kemba Walker.\n\"I can't get into the he said, she said,\" Galloway said. \"We just have to take away that basket and not allow him to get a good shot like that.\"\nWalker led the Charlotte comeback.\nHe finished with 31 points and had nine assists and eight rebounds for the Hornets, who won their third straight and moved into sixth place in the Eastern Conference -- a half-game ahead of Detroit.\nBlake Griffin had 26 points, 10 rebounds and 7 assists for the Pistons, who have lost six in a row.\nTrailing by 10 with 6:23 left in the fourth quarter, Walker put his team on his shoulders.\nWalker scored 11 of the game's next 13 points to put the Hornets up 104-101 with 47 seconds left as part of a 13-0 Charlotte run. Walker was 4-of-18 from the field in the first three quarters but was 4-of-7 in the fourth.\nAndre Drummond broke the nearly six-minute drought for Detroit when he answered with a three-point play in the low post to tie the game with 35 seconds left.\nBoth teams missed opportunities -- including Griffin, who missed two free throws -- before Lamb connected.\nTIP-INS\nPistons: Reggie Jackson had 18 points for the Pistons. ... Detroit outrebounded Charlotte 49-42.\nHornets: Michael Kidd-Gilchrist did not play for personal reasons. ... Charlotte got a big lift off the bench in the first quarter from Willy Hernangomez, who had nine points in final four minutes as the Hornets built a 37-25 lead.\nDOUBLING DOWN\nThe Hornets came up with a pair of turnovers against Griffin by doubling him in the low post and swatting the ball away.\n\"We were active,\" Borrego said. \"We had a swarming mentality.\"\nGUARDING KEMBA\nBruce Brown called Walker a \"great player, a great scorer.\"\n\"You just have to try to contain him,\" Brown said. \"He's going to get his buckets some way, but you just have to try and hold him below his average and not foul him when he gets to the rim.\"\nUP NEXT\nPistons: Host the Boston Celtics on Saturday night.\nHornets: Host the New York Knicks on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994410.135477
}