{
  "game_id": "0021900748",
  "espn_id": "401161390",
  "date": "Feb 03, 2020",
  "matchup": "MEM vs. DET",
  "headline": "Valanciunas scores 26, leads Grizzlies over Pistons 96-82",
  "body": "MEMPHIS, Tenn. --  Jonas Valanciunas relishes the chance to battle a worthy big man under the basket.\n\n“It’s always a pleasure to fight down low, and not chase the guys on the 3-point line,” the Memphis center said with a laugh.\n\nIn a battle with Detroit's Andre Drummond, Valanciunas had 26 points and 17 rebounds to lead the Grizzlies to a 96-82 victory over the Pistons on Monday night, sweeping the season series.\n\nDillon Brooks added 15 points and Jaren Jackson Jr. finished with 14 points. Tyus Jones added 13. Valanciunas also had four blocks.\n\n“There’s not a lot of big guys left,” Valanciunas said. “It’s always fun to go against a big guy. (Drummond's) a good guy. He’s a good player and it’s just a pleasure for me to go against him.”\n\nDrummond held up his end of the showdown with 25 points and 18 rebounds. Langston Galloway and Christian Wood added 17 points each off Detroit's bench. Drummond was 4 of 11 after halftime as the Grizzlies defenders collapsed on him.\n\n“It just seems like he was getting knocked around and banged around,” Detroit coach Dwane Casey said. “And again, it’s sad that officials don’t reward size and physicality.”\n\nWhile the Grizzlies' offense put the game out of reach in the fourth quarter with a 19-point lead, the defense caused headaches for Detroit throughout the night. Only a 3-pointer by Wood in the closing seconds kept the Pistons from recording a season-low in points. Their 34.7% shooting was also close to a season low.\n\nReggie Jackson finished the game 1 of 16 from the field, and Sekou Doumbouya was 2 of 15. The Grizzlies had a season-high 12 blocks. The Grizzlies held the Pistons to 3 of 25 in the third resulting in a mere 10 points -- a season-low for any Pistons quarter.\n\n“Ugly. Ugly is the best word I can use,” Casey said of the anemic third. “It was just the opposite of the way we moved the ball (Sunday in an overtime win over Denver).”\n\nMemphis beat the Pistons 10 days ago, 125-112, with Drummond out. This time, the Pistons had Drummond but were without leading scorer Derrick Rose and Markieff Morris. That left the Pistons playing a rotation of eight players.\n\nThe win was only the second time since early December that the Grizzlies did not reach 100 points, and they still had enough to put away a short-handed Detroit squad.\n\n“It’s obviously kind of a funky game, both teams kind of struggling through it,” Memphis coach Taylor Jenkins said. “Our defense wasn’t where it needed to be in the first half, especially that first quarter. ... Our guys locked in in that second half.”\n\nTIP-INS\n\nPistons: Rose missed his eighth game of the season with a left hip adductor strain. Rose left Sunday’s victory over Denver with the injury. ... Morris also sat out with right hip strain. ... Their season low for points is 81 at Utah on Dec. 30. ... Their season-low on field goal percentage was 33.7% at Chicago on Nov. 20. ... Drummond grabbed at least 15 boards for the fourth time in the last six games.\n\nGrizzlies: Jackson and Marko Guduric returned from one-game suspensions handed down by the NBA for leaving the bench during last week’s fracas against the Knicks in New York. ... Earlier Monday, Grizzlies coach Taylor Jenkins was named Western Conference coach of the month for January. ... The Grizzlies previous season high on blocks was 11 on Jan. 28 against Denver. ... The Grizzlies had 68 points in the paint.\n\nTHIS SHOULD BE INTERESTING\n\nThe trade deadline is approaching this Thursday and Andre Iguodala is speculated to be available. He hasn’t played with the Grizzlies all season.\n\nStarting Memphis guard Dillon Brooks didn’t hold back his feelings when asked about Iguodala in the postgame.\n\n“I can’t wait ‘til we find a way to trade him so we can play him and show him really what Memphis is about,” Brooks said.\n\nUP NEXT\n\nPistons: Face the Phoenix Suns at home on Wednesday night.\n\nGrizzlies: Face the Mavericks in Dallas on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995702.733189
}