{
  "game_id": "0021900137",
  "espn_id": "401160779",
  "date": "Nov 10, 2019",
  "matchup": "BKN @ PHX",
  "headline": "Devin Booker scores 27 points, Suns blow out Nets",
  "body": "PHOENIX --  Ricky Rubio is a pass-first point guard. Sunday night, he showed he can score when the shots are there as well.\n\nRubio had a season-high 22 points, the most he's had since February of last season with Utah, and added 12 of the Phoenix Suns' 37 assists in a 138-112 rout of the Brooklyn Nets.\n\nDevin Booker led the Suns with 27 points, shooting 10 of 14 from the field and making 4 of 5 3-pointers to go with nine assists.\n\n\"We moved the ball. We played super unselfish,\" Rubio said. \"That is super fun to play.\"\n\nKelly Oubre Jr. added 18 points, rookie Cameron Johnson had a career-high 15. The Suns trailed just once, at 1-0.\n\nThe Suns shot 54 percent through three quarters, hitting 16 of 34 on 3-pointers, and cruised in the final period. They won for the fourth time in five games and ended the Nets' four-game winning streak in Phoenix.\n\nSpencer Dinwiddie led the Nets with 18 points. Kyrie Irving finished with 15 points on 7-of-16 shooting.\n\n\"I don't think I shot one free throw, which is a tell-tale sign of just how aggressive I am not in the game,\" Irving said. \"A lot of the accountability falls on me and really the game plan of guarding Ricky and not being in the right spots.\"\n\nThe Suns made 10 of their first 11 shots, including 4 of 5 3-pointers. Phoenix led by 20 points in the quarter.\n\nCenter Aaron Baynes hit two 3s inside the first 3 minutes and had two dunks.\n\nThe flustered Nets trailed by 19 points, 32-13, with 4:35 left in the first quarter, having turned the ball over five times and been whistled for six fouls. Coach Kenny Atkinson was called for a technical foul for going out on the court to vent at the officials.\n\nThat seemed to stir the Nets, who cut it to 37-30 by the end of the quarter.\n\nThe Nets made it 42-40 on the third of Garrett Temple's three 3s off the bench as the Suns cooled off until the last half of the second quarter. Up only two, 46-44 at the 6-minute mark, Phoenix finished the quarter on a 22-6 run for a lead.\n\nOubre capped it off with a 3 from the top of the arc at the buzzer -- part of his 16 points in the half -- then jogged off the court with his arms raised.\n\n\"We came out connecting on all cylinders,\" Oubre said. \"We move it around, it doesn't matter who scores as long as everybody touches it.\n\n\"Nights like this, it's scary,\" he added.\n\nThe Suns built on their lead in the third. Dario Saric knocked down a 3 with 6:32 to make it 85-59, and went up 102-73 on Booker's 31-foot 3-pointer at the 2:06 mark.\n\n\"What's not to like?\" Suns coach Monty Williams said. \"It was a big-time effort on our part to do what we do, share the ball. I thought Ricky set the tone.\"\n\nOUBRE PUMPS UP\n\nOubre, known for his energetic style of play, got the home crowd going after he took a hard foul from Jordan with 58 seconds to play in the first half and tumbled to the floor. Instead of getting up immediately, he did a couple of push-ups, then walked to the free throw line and made both shots.\n\nSEVEN FOR 3\n\nSunday was the first game in Suns history where seven different players made two or more 3-pointers, according to the Elias Sports Bureau. That included all five starters.\n\nROAD TRIP ROLLS ON\n\nBrooklyn played the second game of a five-game trip, which will be the Nets' longest of the season.\n\nAtkinson was asked about staying locked in while away from home for so long. \"You have to bring the physicality and the energy. Then it's your mental focus, focusing on the game plan, understanding that and what the heck we are doing, our principles,\" Atkinson said. \"And then, can you take a punch?\"\n\nTIP-INS\n\nBrooklyn: C DeAndre Jordan returned from a sprained left ankle that forced him out of the Nets' win over the Portland Trail Blazers on Friday night. He finished with 16 points and 12 rebounds. ... Irving's streak of 20-plus points to start a season, eight games, came to an end. ... G Theo Pinson scored his first two points of the season.\n\nPhoenix: Coach Monty Williams' 6-3 start matches the best through the first nine games by a Suns first-year head coach, tying Paul Westphal, Terry Porter and Alvin Gentry. ... The Suns turned it over just  times, a season low. ... Phoenix made 19 3-pointers, a season high.\n\nUP NEXT\n\nNets: At Utah on Tuesday night.\n\nSuns: Host the Los Angeles Lakers on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996440.786071
}