{
  "game_id": "0021600224",
  "espn_id": "400899674",
  "date": "Nov 23, 2016",
  "matchup": "OKC @ SAC",
  "headline": "Cousins scores 36 in Kings' 115-101 win over Thunder",
  "body": "SACRAMENTO, Calif. --  While the Sacramento Kings enjoy a modest two-game winning streak, the Oklahoma City Thunder are wondering what happened the past two weeks.\n\nDeMarcus Cousins had 36 points and 13 rebounds, leading the Kings to a 116-101 victory over the slumping Thunder on Wednesday night.\n\nThe Kings had a 36-point third quarter and gradually pulled away in the fourth in dealing the Thunder their third straight loss and seventh in nine games. The Thunder opened the season with a 6-1 record,\n\n\"We've got to be ready to play. That's plain and simple. Figure it out,\" Russell Westbrook said.\n\nGoing to a smaller lineup the last two games, it appears the Kings may have figured something. But they're still making sure their All-Star center gets plenty of touches.\n\nCousins made three 3-pointers, hit 14 of 28 shots and proved a handful for the Thunder to contain.\n\n\"DeMarcus is one of the best, if not the best center in the game,\" teammate Kosta Koufos said. \"He can do it all, shoot the 3, post up, put it on the floor. You name it, he can do it.\"\n\nCousins received considerable help, especially in the second half from Darren Collison and Rudy Gay. Gay said he fought through a stomach virus in scoring 15 of his 17 points in the final two quarters.\n\nCollison scored 10 of his season-high 21 points in the fourth quarter and added six assists. Both Gay and Collison connected on three 3-pointers after intermission. The Kings had 12 3-pointers in evening their home record at 4-4.\n\n\"I think it was just finding our spots (in the second half),\" Gay said. \"I don't know, maybe I was more aggressive. I know Darren was more aggressive, I can tell you that. We were stagnant in the first half. I felt we pushed through in the second half.\"\n\nWestbrook nearly had his sixth triple-double of the season, getting 31 points, 11 rebounds and nine assists. Victor Oladipo made three 3-pointers and scored 18 points.\n\n\"It's not necessarily one player. We just got to keep working,\" Thunder coach Billy Donovan said. \"I think we got a great group of guys in the locker room that are trying and working. We just got to continually understand the importance of a lot of the little things in the course of 48 minutes.\"\n\nKoufos led the productive Sacramento reserves with nine points and 10 rebounds. Ben McLemore scored all nine of his points during a productive first-half stretch and Ty Lawson added eight and four assists.\n\n\"I thought our bench in the first half was fantastic,\" Kings coach Dave Joerger said. \"They picked up the pace, the ball was moving, slinging around the floor. It's fun to play (like that.)\"\n\nCousins scored on a variety of shots in the third quarter and had 13 points in helping Sacramento build its lead to 87-65 heading into the fourth.\n\nTIP-INS\n\nThunder: Westbrook made all 11 of 12 free throws and had 20 points in the opening half. ... The Thunder are 2-4 on the road. .. Oklahoma City committed only nine turnovers, but shot 42 percent.\n\nKings: The Kings went to Cousins early and he responded with 16 first-quarter points. .. Gay, the Kings' second-leading scorer, didn't have a basket until making a 3-pointer early in the third quarter.\n\nRAPTORS PROTEST KINGS' VICTORY\n\nThe Toronto Raptors filed a protest with the league office regarding a controversial 3-point shot that was disallowed following a video replay in Sunday's loss to the Kings. The shot by Terrance Ross would have sent the game into overtime.\n\n\"I've been through it before. There are advantages and disadvantages of the replay system,\" Joerger said. \"But at the end of the day what it's there for is to get it right. You can argue one side or the other, but whatever side you're on, whether it benefits you or it doesn't benefits you, the biggest thing is that our league can get it right.\"\n\nUP NEXT\n\nThunder: Conclude three-game road trip Friday at Denver.\n\nKings: Host James Harden-led Houston on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995322.0713758
}