{
  "game_id": "0021801088",
  "espn_id": "401071762",
  "date": "Mar 23, 2019",
  "matchup": "PHI @ ATL",
  "headline": "Young's last-second jumper lifts Hawks past 76ers 129-127",
  "body": "ATLANTA --  Trae Young wants to be known as a player his Atlanta teammates can look to when the game is on the line.\n\nThe rookie made the most of his chance to be that go-to player.\n\nYoung scored 32 points, including a last-second, go-ahead floater, to give the Hawks a 129-127 win over Philadelphia on Saturday night, ending the 76ers' six-game winning streak.\n\nWith 3.5 seconds remaining, Young took the inbound pass from Kevin Huerter and dribbled past Jimmy Butler before lifting the short, soft jumper from near the free-throw line. The shot dropped through the net with 0.1 seconds remaining.\n\n\"Those are the type of plays you live for, with the clock counting down,\" Young said. \" ... I just wanted to get to my strong suit and get to my pull-up, that mid-range floater I have.\"\n\nYoung's game-winner left 76ers center Joel Embiid stunned. After most of his teammates had showered and dressed, Embiid still sat at his locker in his uniform, staring at the final stats.\n\nAtlanta has won two of three from the 76ers, including a split of two games at Philadelphia. Butler said the 76ers still came in too confident, thanks to the winning streak.\n\n\"I think it's the fact that we think that we're a good team so we can just come in and do whatever we're going to do and think that we're still gonna win,\" Butler said. \"... I'm telling you, I think that's what it was.\"\n\nThe 76ers still have a solid hold on third place in the Eastern Conference, three games ahead of Indiana and four games ahead of Boston. Philadelphia's six-game winning streak included a win over Boston on Wednesday night.\n\nButler missed a long attempt after the final buzzer sounded.\n\nTaurean Prince had 23 points for Atlanta.\n\nEmbiid had 27 points and 12 rebounds, and Butler had 25 points for Philadelphia.\n\nAfter snapping Utah's five-game winning streak by beating the Jazz 117-114 on Thursday night, the Hawks dropped another streaking playoff-bound team.\n\nYoung's long 3-pointer with 1:15 remaining gave Atlanta a 125-123 lead.\n\n\"Those two buckets effectively won the game,\" said 76ers coach Brett Brown, who said Young \"was unique tonight.\"\n\nButler, who tied the game with a layup, sank two free throws to give Philadelphia a 127-125 lead. Prince answered with a tying layup.\n\nThe Hawks were left with 3.5 seconds after the 76ers' 24-second violation, with Butler's miss waved off as coming too late.\n\nAtlanta's John Collins had a short description of the decisive play. \"Give the ball to Trae, and he takes off,\" Collins said.\n\nAtlanta led 74-68 at halftime and stretched the lead to 12 points, at 97-85, on Alex Len's three-point play. The 76ers closed the gap with 10 straight points and pulled even at 100-all on JJ Redick's 3-pointer to end the third period.\n\nTIP-INS\n\n76ers: Ben Simmons had 21 points with nine assists. Tobias Harris had 13 points and nine rebounds. ... T.J. McConnell left the game with a bloody nose late in the third period. Brown was upset there was no foul called, even after a video review, on contact which caused the bloody nose. McConnell returned midway through the fourth.\n\nHawks: Young had 11 assists. ... Atlanta matched its season high for most points in a first half. The Hawks also scored 74 points in the first half against Miami in a 123-118 win on Nov. 3. The 74 points were the most allowed in a first half by the 76ers this season.\n\nANOTHER DOUBLE-DOUBLE\n\nEmbiid posted his 16th straight double-double and 54th overall this season. He had 37 points and a career-high 22 rebounds in the win over the Celtics on Wednesday night.\n\nANOTHER 30-10 FOR YOUNG\n\nYoung has five games with at least 30 points and 10 assists. According to research provided by the Hawks, Young is tied with Stephen Curry and Michael Jordan for the second-highest total of those games among rookies. Only Oscar Robertson, with 24 games with at least 30 points and 10 assists, had more as a rookie.\n\nLONG-AWAITED 3\n\nPhiladelphia's Boban Marjanovic, left unguarded in the corner, sank his first career 3-pointer in the first quarter. It was only the fourth career 3-point attempt in six seasons for the 7-foot-3 native of Serbia.\n\nUP NEXT\n\n76ers: At Orlando on Monday night.\n\nHawks: At New Orleans on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764993992.000057
}