{
  "game_id": "401810101",
  "espn_id": "401810101",
  "date": "Nov 17, 2025",
  "matchup": "MIN vs DAL",
  "headline": "Timberwolves win for the 5th time in 6 games, beating the short-handed Mavericks 120-96",
  "body": "MINNEAPOLIS -- — Naz Reid scored a season-high 22 points and the Minnesota Timberwolves beat the short-handed Dallas Mavericks 120-96 Monday night.\n\n\r\n              Reid scored 10 points in the first quarter and led all scorers with 19 points in the first half. He hit a 3-pointer just before the end of third quarter, capping his 22-point game and sending Minnesota into the fourth quarter with a 32-point lead.\n\n\r\n              Six Timberwolves scored in double figures, including all five starters. Jaden McDaniels and Rudy Gobert scored 15 points apiece and star Anthony Edwards had a relatively quiet night with 13 points on 5-for-14 shooting.\n\n\r\n              Top draft pick Cooper Flagg and Brandon Williams each had 15 points for Dallas, which fell to 1-2 in the second game of back-to-backs this season. The Mavericks were coming off a win over Portland on Sunday.\n\n\r\n              Dallas was without two of its big men who were being rested for injury management in the second game of a back-to-back. Daniel Gafford sat out Monday’s game with an ankle injury, while Dereck Lively II was held out with a knee injury. Anthony Davis also remains sidelined for the Mavericks, giving rookie big man Moussa Cissé his first career start.\n\n\r\n              The Mavericks hung around early in the second quarter, trailing by seven points before the Timberwolves extended their lead to 17 points, at 61-44, at the break.\n\n\r\n              Minnesota continued to control the game in the second half. McDaniels hit three straight 3-pointers to push the Wolves’ lead to 30 points at 85-55 in the third quarter. Minnesota shot under 33% from deep for the fourth straight game, finishing at 32% (14 for 44).\n\n\r\n              The Mavericks also struggled from 3-point range, connecting on 9 of 30 shots. Dallas entered the game with the second-worst 3-point percentage in the league (31.1%).\n\n\r\n              Up next\r\n              Dallas: Hosts the New York Knicks on Wednesday. \n\n\r\n              Minnesota: Hosts the Washington Wizards on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042645.144265
}