{
  "game_id": "0022000111",
  "espn_id": "401267271",
  "date": "Jan 06, 2021",
  "matchup": "MIA vs. BOS",
  "headline": "Pritchard's putback pushes Celtics past Heat, 107-105",
  "body": "MIAMI -- — Rookie guard Payton Pritchard wasn't there last season when the Boston Celtics lost to the Miami Heat in the Eastern Conference finals.\n\n\r\n                    He helped Boston get a measure of revenge Wednesday.\n\n\r\n                    Pritchard's putback with two-tenths of a second left capped a wild finish, and the Celtics — who strongly considered not playing the game in response to the latest Jacob Blake decision and the scene at the U.S. Capitol on Wednesday — beat the Heat 107-105 in the first matchup this season of last year's East finalists.\n\n\r\n                    “To be honest ... I didn't think we were playing,\" said Celtics coach Brad Stevens, who emerged from a pregame team meeting to call his wife about a half-hour before game time and tell her the same. “And then coaches left the room, players finished talking and chose to play.\"\n\n\r\n                    Jayson Tatum scored 27 points and Jaylen Brown had 21 for the Celtics, who wasted an early 17-point lead and a 10-point lead in the final minute before winning.\n\n\r\n                    “Sports is often used as a way to lift people up and spread some joy,\" Brown said.\n\n\r\n                    Jimmy Butler had 26 points for Miami, which got 16 points from Duncan Robinson, 15 points from Bam Adebayo and 14 from Goran Dragic.\n\n\r\n                    \r\n                      The teams knelt for the national anthem in response to the decision earlier in the week to not charge the police officer who shot Blake last year — as well Wednesday’s developments at the Capitol, where a violent mob loyal to President Donald Trump delayed Congress from certifying the results of November’s election.\n\n\r\n                    “Tip your hat to all the pros in both locker rooms,\" Heat coach Erik Spoelstra said. “It's legitimate that everybody does have a lot on their mind and heavy hearts, disappointment, discouragement, all of these different emotions.\"\n\n\r\n                    The Celtics went on a late 13-0 run to go up 10 with 1:17 left — only to see the Heat score 10 points in 55 seconds to tie the game on a pair of 3-pointers by Robinson, one while getting fouled, and another from Dragic.\n\n\r\n                    “Obviously, there, the urgency is heightened,\" Robinson said. “It just shows how capable we are.\"\n\n\r\n                    Marcus Smart missed a layup on Boston's last possession, but Pritchard swooped in for the rebound and gamewinner. Miami's last-ditch try was knocked away as time expired and the Heat have now alternated losses and wins in all seven games this season.\n\n\r\n                    “We've got to figure this out before it's too late,\" Adebayo said.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Stevens called Spoelstra before the game to alert him of the Celtics' meeting and consideration of not playing. ... Jeff Teague (sprained left ankle) remained out and Smart returned after a one-game absence with a sprained right thumb.\n\n\r\n                    Heat: Miami’s streak of a different starting five in every game this season ended; the Heat used the same opening lineup as they did Monday against Oklahoma City. ... The Heat play their next four games on the road and aren’t back home until facing Detroit on Jan. 16.\n\n\r\n                    FASTEST 300\n\n\r\n                    Robinson made his 300th 3-pointer in his 95th career game, 22 games faster than anyone else in NBA history. Portland’s Damian Lillard and Dallas’ Luka Doncic both got there in 117 games.\n\n\r\n                    FIRST 48\n\n\r\n                    It was the 48th time, including playoffs, that the teams have met at AmericanAirlines Arena. Each team has won 24 times.\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Host Washington on Friday.\n\n\r\n                    Heat: Visit Washington on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996813.3330271
}