{
  "game_id": "0022200702",
  "espn_id": "401468857",
  "date": "Jan 22, 2023",
  "matchup": "DEN vs. OKC",
  "headline": "Gilgeous-Alexander hits winner, lifts Thunder past Nuggets",
  "body": "DENVER -- — Shai Gilgeous-Alexander banked in a decisive 8-foot jumper with 9.2 seconds remaining and finished with 34 points as the Oklahoma City Thunder snapped Denver’s league-leading nine-game win streak and beat the Nuggets 101-99 Sunday night.\n\n\r\n              After Denver’s Zeke Nnaji hit two free throws to tie the game at 99 with 30 seconds left, Gilgeous-Alexander got the ball out of a timeout and hit the mid-range jumper to give the Thunder the lead. The Nuggets’ Jamal Murray missed a fadeaway 14-foot shot in the final seconds.\n\n\r\n              “He’s got some poise in those situations,” Thunder head coach Mark Daigneault said of Gilgeous-Alexander. “The game slows down for him. He’s got great confidence and he’s always at his pace, even in the most pressure situations.”\n\n\r\n              Oklahoma City’s victory ended the Nuggets’ 16-game home win streak — the franchise’s longest run in 10 years.\n\n\r\n              Josh Giddey had 18 points and a team-high nine rebounds for the Thunder, who earned their seventh win in nine games.\n\n\r\n              Denver center Nikola Jokic missed his second straight game while dealing with tightness in his left hamstring. The two-time reigning NBA MVP had recorded a triple-double in five of his last six games. Nuggets acting head coach David Adelman said expects that Jokic’s return is “going to be very soon.”\n\n\r\n              “I think it’s much easier to switch one through five with us,” Adelman said. “When Nikola is on the floor, it’s virtually impossible to do that and it’s virtually impossible to zone us. They did those two things and they’re smart things to do.”\n\n\r\n              Forward Michael Porter Jr. also missed the game for “personal reasons,” leaving Denver without two of its top four scorers. Porter’s younger brother, Coban, a sophomore guard at the University of Denver, was arrested Sunday on suspicion of vehicular homicide and reckless driving after he was involved in a fatal crash.\n\n\r\n              Without Jokic and Porter, Murray shouldered much of the offensive load, finishing with a team-high 26 points and nine assists, two nights recording his first career triple-double.\n\n\r\n              “They doubled me,” Murray said. “We kind of expected that. We knew from what we went through in walk-throughs what they’d most likely do. We prepared for it. We got what we wanted. We didn’t finish like you’re accustomed to seeing us finish. That’s just on us. That hurts, knowing we did everything we could and we didn’t get over the hump.”\n\n\r\n              Denver made 51.5% of its free throws, losing out on precious points in a narrow loss. Oklahoma City, meanwhile, shot 87.5% from the line, with Gilgeous-Alexander going 7 for 8. \n\n\r\n              Gilgeous-Alexander, who entered averaging 30.6 points, shot 13 for 21 from the field.\n\n\r\n              “It feels good,” Gilgeous-Alexander said. “We’ve put a lot of work in, a lot of guys have been on the team for a little bit, and we try to enjoy wins as much as possible and not take them for granted. When we see guys make a play at the end of the game, the close ones are the most fun ones, the emotions are a little bit higher and it feels a little bit better.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: G Bones Hyland was scoreless in 11 minutes after missing the second half of Denver’s 134-11 victory Friday against the Indiana Pacers with a sprained left finger. … F Vlatko Cancar was scoreless in 10 minutes after missing Friday’s game with a non-COVID illness.\n\n\r\n              Thunder: Oklahoma City had lost its previous three matchups against the Nuggets this season. … F Kenrich Williams had 11 points, six rebounds and four assists.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host the Atlanta Hawks on Wednesday.\n\n\r\n              Nuggets: At New Orleans on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994700.253372
}