{
  "game_id": "0022200712",
  "espn_id": "401468867",
  "date": "Jan 23, 2023",
  "matchup": "MEM @ SAC",
  "headline": "Kings use early 3s, big 4th quarter to top Grizzlies 133-100",
  "body": "SACRAMENTO, Calif. -- — Trey Lyles scored a season-high 24 points, Harrison Barnes had 15 of his 20 in Sacramento's record-tying first quarter and the Kings beat the short-handed Memphis Grizzlies 133-100 on Monday night.\n\n\r\n              The Kings tied the NBA record with 12 3-pointers in the first quarter — in just 13 attempts — and scored 47 points. But Sacramento didn't put away the game until outscoring Memphis 33-10 in the fourth quarter.\n\n\r\n              Lyles was 6 for 8 from 3-point range for the Kings (27-19), who have won seven of their last eight games.\n\n\r\n              “It’s nice,” Lyles said. “We have another game on Wednesday. Let’s see if we can do it again.”\n\n\r\n              Domantas Sabonis finished with 14 points, 11 assists and 10 rebounds for his sixth triple-double of the season. Sabonis leads the NBA in double-doubles with 36.\n\n\r\n              Keegan Murray also finished with 20 points and De’Aaron Fox had 17 points and 10 assists.\n\n\r\n              “Great team win,\" Kings coach Mike Brown said. \"I thought defensively in the second half, we were good.”\n\n\r\n              Desmond Bane scored 21 points for Memphis (31-16), which played without Ja Morant and Steven Adams. The Grizzlies have lost three straight following an 11-game winning streak.\n\n\r\n              “They shot the ball really well tonight,” Brandon Clarke said. “We didn’t have an answer.”\n\n\r\n              Jaren Jackson Jr. finished with 19 points and Dillon Brooks scored 13 points and added six assists. The Grizzlies visit Golden State on Wednesday.\n\n\r\n              “We have to focus on getting better and playing better against Golden State,” Grizzlies coach Taylor Jenkins said. “Just continue to play hard and play together and just try and find a groove.”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Tyus Jones started in place of Morant and had 12 points, eight assists and six rebounds.\n\n\r\n              Kings: Sacramento was without C Chimezie Metu because of a left knee bone bruise. …the Kings committed a season-high 25 turnovers.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Toronto on Wednesday.\n\n\r\n              Grizzlies: Travel to face the Warriors on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994195.4398139
}