{
  "game_id": "0022300385",
  "espn_id": "401585013",
  "date": "Dec 22, 2023",
  "matchup": "HOU vs. DAL",
  "headline": "Sengun has 22 points and 15 rebounds to help Rockets rout Luka-less Mavericks 122-96",
  "body": "HOUSTON -- — Alperen Sengun had 22 points and 15 rebounds and the Houston Rockets took advantage of the absence of injured Dallas stars Luka Doncic and Kyrie Irving to rout the Mavericks 122-96 on Friday night.\n\n\r\n              Doncic sat out because of a strained left quad, while Irving was out for a seventh straight game with a right heel contusion. It was the first time they’ve missed the same game this season.\n\n\r\n              Houston snapped a three-game losing streak to improve to 14-12. Dallas fell to 16-12 with its third straight loss.\n\n\r\n              “We knew they were missing some players so I started aggressive and finished the game earlier so we could get ready for tomorrow’s game,” Sengun said.\n\n\r\n              The Rockets did most of their damage in the paint, outscoring the Mavericks 66-50. Jabari Smith Jr. had 21 points and eight rebounds, and Jalen Green added 17 points.\n\n\r\n              “They complement each other well and have good versatility,” Rockets coach Ime Udoka said about Sengun and Smith. “They’ve been together for a few years, and you can see some chemistry building there. They play off of each other well.”\n\n\r\n              Olivier-Maxence Prosper led Dallas with 20 points off the bench. Dexter Dennis had 18 and Richaun Holmes and Tim Hardaway Jr. each had 16.\n\n\r\n              Houston was in control from the start, leading by 38 in the third quarter. Sengun had 20 points and 10 rebounds in the first half. Dallas struggled mightily from the field, making just 15 of 54 shots for a 27.8% clip, while going 3 of 24 from beyond the arc.\n\n\r\n              “When you can’t put the ball in the basket, you’ve got to get stops, and we just didn’t do that tonight,” Mavericks coach Jason Kidd said. “Being shorthanded puts things into perspective of how important Luka is to the team and how much he creates for everyone. If he can’t go tomorrow, we’ve got to find a way to create shots.”\n\n\r\n              Houston had a season-high 29 fast-break points.\n\n\r\n              The Rockets led 56-39 at halftime and 89-60 entering the fourth quarter.\n\n\r\n              Thirteen of 14 Rockets players scored in the game, while fan-favorite Boban Marjanovic did not play despite Toyota Center chants of his name.\n\n\r\n              The Mavericks were also without Dante Exum (left lower leg contusion), while the Rockets were missing Tari Eason (left lower leg soreness).\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host San Antonio on Saturday night.\n\n\r\n              Rockets: At New Orleans on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995617.357343
}