{
  "game_id": "0021600624",
  "espn_id": "400900045",
  "date": "Jan 17, 2017",
  "matchup": "CHI vs. DAL",
  "headline": "Mavericks edge Bulls 99-98 for 3rd straight win",
  "body": "CHICAGO --  Wesley Matthews was mad at himself after Jimmy Butler's clutch shot in the final minute. He exacted his revenge on the other side of the court.\n\nMatthews made a go-ahead 3-pointer from the wing with 12 seconds left, and the Dallas Mavericks beat the Chicago Bulls 99-98 on Tuesday night for their first three-game winning streak of the season.\n\n\"We've been struggling, it's been tough for 2 1/2 months, but guys kept hanging in and believing in each other,\" coach Rick Carlisle said. \"Games like this give us even more confidence.\"\n\nSix players scored in double figures for the Mavericks (14-27), including all five starters. Harrison Barnes had 20 points, Seth Curry added 18 and Dirk Nowitzki finished with 10 points and 10 rebounds.\n\nDallas trailed 98-96 after Butler's long jumper over Matthews in a matchup of Marquette products with 23 seconds left, but Carlisle decided against a timeout and Deron Williams drove into the lane before kicking out to Matthews for the 3.\n\n\"Jimmy came down and made a great play. He went over the top of me and shot,\" Matthews said. \"And I can't really take much credit for the other end of the court. D-Will came down in transition. I think everyone was expecting a timeout, which was a good play by Coach to not do that.\n\n\"D-Will made a great play, he found me, and I just had to knock it down.\"\n\nMatthews then prevented Butler from getting a shot off in the final seconds, and Dwyane Wade missed a potential game-winning jumper from the corner on his 35th birthday.\n\n\"They did a good job of pressuring on us, making us make tough shots,\" Wade said. \"Wes Matthews is a great defender and he did a great job of just pressuring Jimmy and making us get to other things at the end.\"\n\nButler finished with 24 points, 12 assists and nine rebounds for the Bulls, who had won two in a row. Robin Lopez scored 21, and Wade had 17 on 8-for-21 shooting.\n\nWade's fadeaway jumper gave the Bulls a 94-90 lead with 3:18 remaining, but they struggled to score down the stretch of another disappointing performance at home. Chicago (21-22) dropped to 13-9 at the United Center, including home losses to the under-.500 Knicks, Lakers, Trail Blazers, Timberwolves and Mavericks.\n\n\"We've just got to be better, man,\" Butler said. \"It's the same mistakes over and over again.\"\n\nChicago played without forward Taj Gibson, sidelined by left ankle soreness. Paul Zipser, a second-round pick in last year's draft, started in Gibson's spot and finished with five points and three rebounds in his 13th game of the season.\n\nGibson, averaging 12 points and 7.3 rebounds, could return Friday night at Atlanta. He had played in every game this season.\n\nDallas put together a 15-4 run spanning halftime to open a 64-51 lead on Barnes' turnaround jumper with 8:38 left in the third. But Chicago kept chipping away at the deficit, and Lopez's three-point play off a pass from Butler trimmed the Mavericks' lead to 76-74 heading into the fourth.\n\nBULLISH AGAINST THE BULLS\n\nThe Mavericks earned their fourth consecutive win against the Bulls, including a 107-82 victory in their first meeting this season. They swept the series against Chicago for the second consecutive season for the first time since 2002-03 and 2003-04.\n\nTIP-INS\n\nMavericks: C Andrew Bogut missed his third straight game with a right hamstring strain. ... Williams had 11 points, nine assists and six rebounds, and reserve J.J. Barea scored 12 points. Matthews went 3 for 5 from 3-point range and finished with 11 points.\n\nBulls: Butler received his Olympic championship ring during a pregame ceremony. He helped the U.S. win gold in Rio de Janeiro last summer. ... F Doug McDermott, who scored a career-high 31 points in Chicago's 108-104 victory at Memphis on Sunday night, finished with seven points on 3-for-10 shooting.\n\nUP NEXT\n\nMavericks: Visit Miami on Thursday night. The Mavericks have lost nine of their last 10 regular-season games against the Heat.\n\nBulls: Visit Atlanta on Friday night. The Bulls have dropped five in a row against the Hawks, including a 115-107 defeat at Atlanta on Nov. 9.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764995054.7097442
}