{
  "game_id": "0022400907",
  "espn_id": "401705473",
  "date": "Mar 07, 2025",
  "matchup": "MIN @ MIA",
  "headline": "Conley, Reid and DiVincenzo lead the Timberwolves to 106-104 victory over the Heat",
  "body": "MIAMI -- — Mike Conley, Naz Reid and Donte DiVincenzo each scored 15 points each and the Minnesota Timberwolves beat the Miami Heat 106-104 on Friday night for their fourth straight victory.\n\n\r\n              Anthony Edwards, Jaden McDaniels and Julius Randle finished with 13 each. Edwards, who averages 27.5 points per game, attempted a season-low 10 shots and made four. Nickeil Alexander-Walker was Minnesota's seventh double-figure scorer with 12 points.\n\n\r\n              Edwards split two free throws with eight seconds left to put Minnesota ahead 106-101. Duncan Robinson’s 3-pointer with three seconds got Miami within two.\n\n\r\n              Conley’s errant inbounds pass allowed the Heat a chance for a tying shot or go-ahead 3-pointer, but Bam Adebayo’s 3-pointer bounced off the rim.\n\n\r\n              Adebayo had 29 points and 13 rebounds. Tyler Herro added 22 points and Robinson finished with 15 for the Heat.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota avoided being swept by Miami for the first time 2016-17. Since then, Minnesota has swept four series and split three in the annual two-game set with the Heat.\n\n\r\n              Heat: Miami began a five-game homestand in a March schedule heavily tilted at Kaseya Center. Miami has 12 home dates, including another five-game stretch later in the month, and five on the road.\n\n\r\n              Key moment\r\n              Reid hit a 3-pointer with 4:42 remaining in the fourth that put Minnesota ahead for good at 98-95. He then extended the lead with a hook shot with 4:03 left.\n\n\r\n              Key stat\r\n              McDaniels made 6 of 12 shots, giving him five straight games of shooting 50% or better.\n\n\r\n              Up next\r\n              The Timberwolves host San Antonio on Sunday. The Heat host Chicago on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998080.4629812
}