{
  "game_id": "0022200975",
  "espn_id": "401469130",
  "date": "Mar 06, 2023",
  "matchup": "TOR @ DEN",
  "headline": "Murray scores 24 points, Nuggets rally past Raptors 118-113",
  "body": "DENVER -- — Jamal Murray scored 24 points, Michael Porter Jr. had 20 and the Denver Nuggets scored the last six points of the game to pull out a 118-113 victory over the Toronto Raptors on Monday night.\n\n\r\n              Aaron Gordon added 19 points for the Nuggets, who won their ninth in a row at home. They improved to 24-1 in their last 25 games at Ball Arena. Nikola Jokic finished an assist shy of another triple-double. He had 17 points and 13 rebounds.\n\n\r\n              “It was a great win, all business” Murray said. “We move on to the next. We did what we had to do and I think that’s part of the reason we’re so successful; just move on to the next game and take care of business.”\n\n\r\n              Fred VanVleet had 21 points for the Raptors. Pascal Siakam added 19.\n\n\r\n              Siakam’s jumper with 2:20 remaining gave the Raptors a six-point edge, but the Nuggets rattled off seven straight points to go up 112-111 with 1:15 left. \n\n\r\n              VanVleet hit a pair of free throws as Toronto regained a one-point lead, but Denver scored the final six points, all on free throws, to secure the win. Murray converted a free throw in that final stretch after Scottie Barnes was called for a technical following a foul by Jakob Poeltl and ejected by referee Scott Foster.\n\n\r\n              “I was just saying something to myself and I guess he took offense to it, so just kicked me out of the game,” Barnes said. \n\n\r\n              Foster said Barnes was ejected with just one technical foul for using verbiage which “directly questioned the integrity of the crew.” Denver outscored Toronto 35-25 in the final quarter. “It was another example of our defense stepping up when the game was on the line,” coach Michael Malone said. “We had timely stops, big baskets, big free throws, winning the challenge (that reversed a foul call on Jokic in the late going) and then winning that jump ball and getting to the free throw line on a technical. A lot of things went our way at the end. We were down the whole game but we stayed with it.” The Raptors finished with more second-chance points (20) than the Nuggets (14) and maintained a lead for most of the game. Toronto coach Nick Nurse said a similar effort on most any other night would produce a win.\n\n\r\n              “We play like that, we’re probably going to be able to beat anybody,” he said. “We probably outplayed them and executed really well and all those things. We just didn’t quite get it done at the very, very end.”\n\n\r\n              The Raptors led by as many as 10 points in the first half but Denver closed the second quarter with a 7-0 run to pull to 61-58 at the break. The burst included a 3-pointer by Porter and a dunk by Gordon off Jokic’s alley-oop pass in the final minute of the period.\n\n\r\n              Murray scored 12 points in the third quarter, including a 3-pointer midway through the period that put the Nuggets up 72-69 for their first lead of the game. But the Raptors fought back to take an 88-83 lead into the fourth quarter and led 101-93 when Siakam converted a hook shot with 7:08 left to play.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: All five starters scored in double figures, the fifth time that has happened this season. ... VanVleet also had 14 assists.\n\n\r\n              Nuggets: F Zeke Nnaji remains sidelined indefinitely by a right shoulder injury. ... The Nuggets are a league-best 30-4 at home this season. ...Jokic’s streak of 10 straight triple-doubles at home was snapped. He has finished an assist or rebound shy of a triple-double nine times this season. … Murray made five of his 10 3-point tries and now has 803 in his career, one shy of the Nuggets’ franchise mark held by Will Barton, who was in the arena as a member of the Raptors.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Continue their five-game road trip Wednesday in Los Angeles against the Clippers. \n\n\r\n              Nuggets: Close out a three-game homestand Wednesday night against the Chicago Bulls.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994025.986303
}