{
  "game_id": "0022300149",
  "espn_id": "401584777",
  "date": "Nov 06, 2023",
  "matchup": "MIL @ BKN",
  "headline": "Giannis Antetokounmpo has 36 points and 12 rebounds, Bucks beat Nets 129-125",
  "body": "NEW YORK -- — Giannis Antetokounmpo had 36 points and 12 rebounds to help the Milwaukee Bucks beat the Brooklyn Nets 129-125 on Monday night.\n\n\r\n              Damian Lillard added 21 points, and Jae Crowder had 15. Milwaukee improved to 4-2 with its first road victory of the season.\n\n\r\n              “We got stops when we needed,” Bucks coach Adrian Griffin said. “That’s an important thing that we can build on and continue to get better.”\n\n\r\n              Cam Thomas scored 45 points for Brooklyn in his fourth 30-point game of the season. Mikal Bridges had 31 points, and Lonnie Walker IV added 19 points. Brooklyn fell to 3-4 overall and 0-3 at home.\n\n\r\n              “We executed really well, we just missed the shots at the end,” Thomas said. “This is game seven. We’ve got another one Wednesday. Flush this, and move onto Wednesday.”\n\n\r\n              Antetokounmpo entered with more points in his career against Brooklyn than any other opponent (817), and the Nets were without center Nic Claxton and forward Cam Johnson for the sixth straight game. \n\n\r\n              Despite trailing by 10 in the second half, the Bucks appeared poised to pull away after taking the lead with a 17-5 third-quarter-closing run, then building a nine-point advantage by scoring 12 of the first 17 points in the fourth.\n\n\r\n              “We knew they wanted to play one on one and try to get to the rim or shoot an open three,” Antetokounmpo said. “I think guys did a great job just containing as much as they could.”\n\n\r\n              Brooklyn roared back, led by Thomas who scored seven of the points on his team’s 12-0 run that gave the Nets a 115-12 lead with five minutes left.\n\n\r\n              “I think he (Thomas) can score the basketball against anyone in this league,” Nets coach Jacque Vaughn said. “He has the confidence to do that, and we’re going to try to put him in positions where he’s helping us win whether that’s creating for himself or for us.”\n\n\r\n              But the Bucks scored 17 of the final 27 points, keyed by Antetokounmpo’s nine points in the span and two crucial blocks in the game’s final minute.\n\n\r\n              “I was fortunate to be in the right spot down the stretch and be able to get those blocks,” Antetokounmpo said. “When I’m locked in I know I can impact the game defensively too.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Detroit on Wednesday night.\n\n\r\n              Nets: Host Los Angeles Clippers on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996161.398347
}