{
  "game_id": "0022201045",
  "espn_id": "401469200",
  "date": "Mar 16, 2023",
  "matchup": "MIL vs. IND",
  "headline": "Pacers rally late, beat Eastern Conference-leading Bucks",
  "body": "MILWAUKEE -- — Andrew Nembhard scored 24 points and Aaron Nesmith hit six 3-pointers and finished with 22 points as the Indiana Pacers rallied late and beat the Central Division- and Eastern Conference-leading Milwaukee Bucks 139-123 Thursday night.\n\n\r\n              Indiana (32-38) shot 22 for 46 from 3-point distance, including 13 of 19 in the second half, and shot 56.5% overall despite playing without All-Star point guard Tyrese Haliburton (ankle), as well as guards Kendall Brown, Chris Duarte and Trevelin Queen.\n\n\r\n              The absences didn’t seem to matter as Indiana had seven players score in double-figures. Buddy Hield scored 20 and T.J. McConnell 19, while George HIll and Jordan Nwora added 15 and 12, respectively, against their former team.\n\n\r\n              “There was a good togetherness about us in the second half,” Nembhard said. “We put up a good fight, and showed good aggression. It was like we had nothing to lose in this moment. It was good for the team to do that and a big win for us.”\n\n\r\n              Giannis Antetokounmpo led the Bucks with 25 points. Jrue Holiday added 19 and Khris Middleton finished with 16 for Milwaukee (50-20), which shot 52.8%, went 11 for 32 from beyond the arc and gave up 13 points off 12 turnovers.\n\n\r\n              The Bucks hit 18 of their first 29 shots, including 4 of 9 from 3-point distance to take a 40-30 lead after one period. The Bucks missed five of their first six shots to open the second as Indiana closed within five points, helped by an 8-0 run that was capped off by back-to-back 3-pointers from Hill.\n\n\r\n              The Bucks recovered and took a 64-55 lead into the break.\n\n\r\n              Another 8-0 run, this time with back-to-back 3’s by Nesmith, pulled the Pacers within four points with 4:08 left in the third.\n\n\r\n              Nesmith fouled Bobby Portis with 3:15 left in the quarter, putting the Bucks in the bonus. Portis and Joe Ingles each knocked down a pair of free throws to stretch the lead to nine. Indiana stayed within striking distance with its 3-point shooting and after Hill turned a Wesley Matthews turnover into an easy layup, Nwora drained a 3 to put the Pacers up 102-101 with a minute to play.\n\n\r\n              McConnell’s jumper with 26 seconds left put Indiana up three points and an 11-4 run to open the fourth gave the Pacers a 112-105 lead with 10:27 remaining.\n\n\r\n              “They played well tonight, particularly in the second half.,” Bucks coach Mike Budenholzer said. “They made a lot of 3s, got out in transition. There were a lot of areas where we needed to be better, but a ton of credit to the Pacers tonight.\n\n\r\n              Nesmith’s sixth 3-pointer of the game made it a 122-111 game with 7:08 left and the Pacers never looked back.\n\n\r\n              “It was not a great first half but that was really a special second half,” Carlisle said. “Just in terms of understanding how we needed to play and what it would take to have a chance to get a win here.\n\n\r\n              \"This was our franchise’s first-ever win in this building so to have an opportunity to break through with some of our younger players was special. It was a great win.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Thursday was supposed to be a homecoming of sorts for Haliburton, who grew up just north of Milwaukee in Oshkosh, Wisconsin. But he was unavailable and will miss at least two more games after suffering an ankle injury at practice Wednesday. Haliburton also missed Indiana’s last two games because of a knee injury. \n\n\r\n              Bucks: Antetokounmpo appeared in his 711th career game for the Bucks, trying him with Junior Bridgeman (1975-84) for the most appearances in franchise history. … Center Brook Lopez was held out after injuring his ankle Tuesday night at Phoenix, while guard Grayson Allen missed his second straight game because of right plantar fascia soreness. … With Lopez out, Bobby Portis made his 19th start of the season.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Philadelphia on Saturday.\n\n\r\n              Bucks: Host Toronto on Sunday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994555.363345
}