{
  "game_id": "0021600167",
  "espn_id": "400899617",
  "date": "Nov 16, 2016",
  "matchup": "MEM @ LAC",
  "headline": "Grizzlies beat Clippers 111-107 on Gasol's late 3-pointer",
  "body": "LOS ANGELES --  In his ninth NBA season, Marc Gasol is becoming a 3-point shooter.\n\nThe 7-foot center hit a go-ahead 3 from the left corner with 14 seconds left , and the Memphis Grizzlies hung on to beat the Clippers 111-107 on Wednesday night, snapping Los Angeles' seven-game winning streak.\n\nMike Conley scored 30 points , Gasol added a season-high 26 and Memphis equaled a season high with 15 3-pointers, including a career high-tying seven by Conley.\n\n\"They are the best team in the league right now, so for us to get a signature win like this is huge,\" Conley said.\n\nGasol made four 3-pointers, the same number he hit in helping Memphis rally for a win over Washington last month. He's made 16 3s this season after hitting just 12 in his first eight seasons.\n\n\"We stay in the moment and it's been good so far,\" Gasol said. \"We made the right plays and we are lucky the ball went in.\"\n\nJ.J. Redick scored a season-high 29 points, Blake Griffin added 25, and DeAndre Jordan had 14 rebounds for the Clippers, who still have the NBA's best record at 10-2. Both of their losses have come at home.\n\n\"I don't like that,\" Clippers coach Doc Rivers said about the home defeats. \"We had enough points, we didn't have enough defense.\"\n\nLos Angeles came in outscoring opponents by an average of 16.6 points, fourth-highest in NBA history, but the Grizzlies built a 16-point lead in the first half and were ahead by seven going into the fourth.\n\nIn the end, it was the Grizzlies' defense that preserved the victory.\n\nWith 23 seconds left, Griffin inbounded to Jamal Crawford, who got blocked by Gasol.\n\nAfter Gasol's 3-pointer put Memphis ahead 109-107, Redick had the ball stolen by Conley, who got fouled and made both free throws to close out the win.\n\nJordan blamed himself for not being in the right spot when Gasol shot from the left wing.\n\n\"I made a bad read, saw Mike turn the corner and thought I needed to help,\" Jordan said. \"I should have stayed on the corner.\"\n\nRedick's seventh 3-pointer gave the Clippers a 101-100 lead in the fourth, their first since early in the second quarter.\n\nBut Conley answered with his seventh 3 and Zach Randolph hit a turnaround bank hook, putting the Grizzlies back in front 105-101 and forcing the Clippers to call a timeout.\n\nLos Angeles regrouped and scored six unanswered points for a 107-105 lead. Crawford put back his own miss, Jordan tipped in Paul's miss and Paul hit a pullup jumper while the Grizzlies missed on consecutive possessions.\n\nRandolph added 18 points off the bench and Vince Carter had 12.\n\nTIP-INS\n\nGrizzlies: Conley scored 30 against the Clippers in a 99-88 home loss on Nov. 4. ... G-F Tony Allen missed his fourth straight game with a right groin injury.\n\nClippers: F Wesley Johnson sat out his third game in a row with a left heel contusion.\n\nHE SAID IT\n\n\"He's too far gone for me to teach him how to dance, but now every time he makes one he has to dance.\" -- Conley on Gasol's shimmy moves after hitting the game-winner.\n\nHUSTLE PLAY\n\nIn the third, Paul had the game's best hustle play even though the Clippers failed to score. He got blocked by Harrison on a running layup and Conley grabbed the rebound. But Paul stole it back and fed Redick, who missed a 3-pointer. Green rebounded, but Conley lost the ball to Paul again and Griffin missed a layup.\n\nAGELESS CARTER\n\nAt 39, Vince Carter is the league's oldest active player. He scored 20 points on Nov. 8 against Denver, becoming the oldest in league history to score 20 or more off the bench.\n\nHe also had 20 against Utah on Nov. 14. He had 12 points in 26 minutes Wednesday.\n\n\"He was a superstar in this league and now he still wants to play,\" Clippers coach Doc Rivers said. \"He's a teacher and a leader. He's still playing because he's smart.\"\n\nMemphis coach David Fizdale called Carter \"one of the great guys\" in the NBA.\n\n\"You should see his house in Orlando; it's like a workout factory,\" he said. \"He takes it serious.  He takes pride in his physique and his diet, so I'm not surprised how well he is playing.\"\n\nUP NEXT\n\nGrizzlies: Visit Dallas on Friday to close out a four-game trip. The Grizzlies have lost three in a row to the Mavericks.\n\nClippers: Visit Sacramento on Friday and return home Saturday to host the Chicago Bulls in the second game of a back-to-back, their fourth of the season.",
  "source": "espn_api",
  "crawled_at": 1764995626.621032
}