{
  "game_id": "0022401115",
  "espn_id": "401705681",
  "date": "Apr 03, 2025",
  "matchup": "MIL @ PHI",
  "headline": "Giannis' NBA 1st of 35 points, 20 assists, 17 rebounds sends Bucks past 76ers 126-113",
  "body": "PHILADELPHIA -- — Giannis Antetokounmpo became the first player in NBA history to have 35 points, 17 rebounds and a career-high 20 assists as the Milwaukee Bucks beat the Philadelphia 76ers 126-113 Thursday night.\n\n\r\n              Antetokounmpo helped the Bucks shoot 51.6% from 3-point range. The Bucks are coming off a win Tuesday against Phoenix in which they shot 68.9% from the field, the highest in an NBA game since 1998, and 58.6% from 3-point range.\n\n\r\n              Brook Lopez scored 17 points, Kyle Kuzma had 16 and AJ Green hit four 3-pointers for 12 points. Bucks coach Doc Rivers left the bench in the first half, citing an illness, and watched from the locker room as assistant Darvin Ham took over.\n\n\r\n              Rookie Adem Bona led the 76ers with a career-high 28 points on 13-for-15 shooting. Quentin Grimes had 24 points with 10 assists, and Guerschon Yabusele added 22 points.\n\n\r\n              Takeaways\r\n              Bucks: The Bucks played their eighth game without Damian Lillard, sidelined with a calf injury later diagnosed as deep vein thrombosis. Rivers said the team got a great report on the nine-time All-Star’s treatment response and, “we have much more hope today than we did three days ago” about him returning this season.\n\n\r\n              76ers: Philadelphia has lost 10 straight and is 3-25 since Feb. 5. Already without Tyrese Maxey, Joel Embiid and Paul George, reserve guard Lonnie Walker IV limped off in the third quarter. Coach Nick Nurse was ejected in the fourth.\n\n\r\n              Key Moment\r\n              The 76ers led 39-25 after one quarter, but a 15-0 Bucks run to start the second erased that. The teams went back and forth until an 11-2 run to end the third broke an 85-all tie.\n\n\r\n              Key Stat\r\n              The win was Rivers’ 1,156th regular-season coaching victory, breaking a tie with Phil Jackson for seventh in NBA history. He picked up 236 with the 76ers from 2020-23. \n\n\r\n              Up next\r\n              Both teams play Saturday. The 76ers host Minnesota, while Milwaukee continues a three-game trip in Miami.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997816.6528482
}