{
  "game_id": "0021500119",
  "espn_id": "400828006",
  "date": "Nov 11, 2015",
  "matchup": "HOU vs. BKN",
  "headline": "Nets notch 1st victory of season behind Bojan Bogdanovic's 22 off bench",
  "body": "HOUSTON -- Coach Lionel Hollins and the Brooklyn Nets have been working hard all season with nothing to show for it.\nThat work finally paid off Wednesday night with their first win of the season.\nBojan Bogdanovic came off the bench to score a season-high 22 points with nine rebounds and lead the Nets to a 106-98 victory over the Houston Rockets.\nThe Nets entered the game 0-7, and the Rockets had won four straight after opening the season 0-3.\n\"When you get a win, it validates all the preaching and all the working that you're doing,\" Hollins said. \"When you do get a victory, you can say: 'Hey, this is what we're talking about.' Because in that victory, there's a lot of things that I've been preaching and other coaches have been preaching.\"\n\nBrooklyn scored six straight points to turn a tie game into a 99-93 lead with 3 1/2 minutes remaining. Thomas Robinson led the way in that stretch, scoring four points highlighted by a dunk after a steal.\nMarcus Thornton made a 3-pointer for Houston, but Bogdanovic hit one with 1:37 left to stretch the lead to 102-96.\n\"It was the first time we didn't have black holes in our game,\" Bogdanovic said. \"That's the biggest reason why we won.\"\nJames Harden led Houston with 23 points, cooling off after scoring 43 and 46 in the previous two games.\nThe victory was Brooklyn's first in Houston since March 13, 2006, ending an eight-game skid.\nJoe Johnson added 16 points and 10 assists for Brooklyn. Brook Lopez had 14 points and 12 rebounds.\n\"We responded to their runs,\" Lopez said. \"We played our most complete game of the season. Obviously it's good to get that first one. It's a breakthrough.\"\nThe Nets scored nine consecutive points, capped by a 3-pointer by Wayne Ellington, to take a 91-87 lead with 6 1/2 minutes remaining. Dwight Howard missed two layups on consecutive possessions to leave Houston empty-handed.\nHoward had 10 points, 17 rebounds and five blocks.\n\"I'm worried about our team right now,\" Houston coach Kevin McHale said. \"We haven't caught a rhythm yet. I've said it all since we've been together. We haven't been able to put together long runs of just good, solid basketball.\"\nA layup by Trevor Ariza ended a drought of more than three minutes for the Rockets after that. That was the start of a 6-2 run that tied it at 93-93 with less than five minutes left.\nThe Rockets trailed by six at halftime but used an 18-6 run to take a 79-68 lead with just more than three minutes left in the third quarter. Harden, Ariza, Thornton and Patrick Beverley all made 3-pointers for Houston in that span.\nAn 11-4 spurt by Brooklyn cut the lead to 83-79 entering the fourth quarter.\nBrooklyn scored the last six points of the first half to lead 55-49.\nTIP-INS\nNets: Rookie Rondae Hollis-Jefferson started and played the first 7:49 of the game before sitting out until the fourth quarter. He finished with four rebounds and an assist. .... Thaddeus Young added 13 points.\nRockets: F Terrence Jones returned after missing the previous five games with a cut on his right eyelid. He had four rebounds. ... Beverley returned after missing the previous two games with a concussion. ... G/F K.J. McDaniels was assigned to Houston's D-League Rio Grande Valley on Wednesday. ... McHale said rookie Sam Dekker is dealing with a back problem but likely will join McDaniels with Rio Grande Valley when he gets healthy.\nTRAFFIC TROUBLE\nBeverley was arrested and briefly detained Wednesday on a misdemeanor warrant for a Houston-area traffic violation before being released when he paid a $321 fine. The team said Beverley, who missed the Rockets' morning shootaround, has resolved issues related to vehicle registration and an electronic toll road pass. Beverley said an expired credit card was linked to his toll tag.\n\"They were charging me for my old credit card, and it became a warrant,\" he said. \"And that's why I went to jail.\"\nQUOTABLE\nBogdanovic, on Brooklyn shooting 47.1 percent from 3-point range Wednesday after entering the game last in the league at just 23.6 percent: \"I already saw that we were one of the worst teams in the league on 3-point shots. So I hope that now things are going to change.\"\nUP NEXT\nNets: Visit Sacramento on Friday.\nRockets: Visit Denver on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994671.815265
}