{
  "game_id": "0022400010",
  "espn_id": "401703379",
  "date": "Nov 15, 2024",
  "matchup": "ORL vs. PHI",
  "headline": "Magic win 98-86 in NBA Cup game, dropping 76ers to 2-10 overall",
  "body": "ORLANDO, Fla. -- — Franz Wagner had 31 points and 11 rebounds, Jalen Suggs added 19 points and seven rebounds, and the Orlando Magic pulled away in the fourth quarter to a 98-86 win over the Philadelphia 76ers in an NBA Cup game Friday night.\n\n\r\n              Joel Embiid, playing 33 minutes in his second game this season for the 76ers (2-10), had 20 points and eight rebounds. Rookie guard Jared McCain scored 29 points, his fourth straight game of 23 or more, before fouling out with 4:56 remaining. Paul George added 13 points on 4-of-15 shooting.\n\n\r\n              Mo Wagner, Jonathan Isaac and Anthony Black sparked a 9-0 charge that concluded the third quarter and put Orlando ahead to stay. \n\n\r\n              The Magic are 2-0 in NBA Cup Group A play, while Philadelphia dropped to 0-2. \n\n\r\n              Takeaways\r\n              76ers: Having played their first 12 games without their trio of stars (Embiid, George and Tyrese Maxey) intact, the 76ers have fallen into a big hole in the Eastern Conference standings.\n\n\r\n              Magic: Have won all seven of their home games this season and 14 in a row going back to March 30. Their next three games will be on the road, where they are 2-14 since that date.\n\n\r\n              Key moment\r\n              During a 9 1/2-minute span of the second half, the 76ers scored only four points — on Caleb Martin's 3-pointer and a technical foul assessed to injured Magic forward Paolo Banchero. Orlando scored 20 during that stretch and took a nine-point lead.\n\n\r\n              Key stats\r\n              The 76ers shot 40.3% overall and 10 of 31 (32.3%) from 3-point range.\n\n\r\n              Up next\r\n              The 76ers play at Miami on Monday night. The Magic open a three-game trip at Phoenix on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997578.0621629
}