{
  "game_id": "401809939",
  "espn_id": "401809939",
  "date": "Oct 22, 2025",
  "matchup": "MIL vs WSH",
  "headline": "Giannis Antetokounmpo scores 37 points as Bucks open their season with 133-120 win over Wizards",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 37 points and 14 rebounds, and the Milwaukee Bucks never trailed in a 133-120, season-opening victory over the Washington Wizards on Wednesday night.\n\n\r\n              Milwaukee’s Kevin Porter Jr. scored 10 points before leaving with a sprained left ankle late in the first quarter.\n\n\r\n              Porter was heading backward as Washington’s Cam Whitmore was driving into the paint. Porter appeared to trip over the foot of teammate Bobby Portis, fell down and laid on the floor in pain before heading to the locker room.\n\n\r\n              Washington's Khris Middleton scored 23 points in his first game at Milwaukee since the Bucks dealt the three-time All-Star at last season's trade deadline. Middleton, a key player on Milwaukee's 2021 championship team, received a standing ovation during pregame introductions and another hearty round of applause after the Bucks played a video tribute to him during the first timeout.\n\n\r\n              Milwaukee's Gary Trent Jr. scored 17 points. Myles Turner had 11 points, eight rebounds and five assists in his Bucks debut.\n\n\r\n              Kyshawn George had 21 points for Washington.\n\n\r\n              Milwaukee led the NBA in 3-point percentage (.387) last season but ranked 18th in 3-point attempts, so coach Doc Rivers spent training camp telling his players to fire away from beyond the arc more often. \n\n\r\n              Sure enough, the Bucks went 5 of 6 from 3-point range in the first five minutes and ended up 18 of 44 from beyond the arc.\n\n\r\n              After Milwaukee led by 22 points in the second quarter, Middleton’s 14-footer capped a 12-0 run to start the third period as Washington got the margin down to 72-65. The Wizards made it a seven-point game again later in the third.\n\n\r\n              But every time the Wizards got within striking distance, the Bucks responded. Antetokounmpo scored 10 straight points during a 12-2 run in the fourth quarter.\n\n\r\n              Up next\r\n              Wizards: At Dallas on Friday.\n\n\r\n              Bucks: At Toronto on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042481.3700962
}