{
  "game_id": "0022000090",
  "espn_id": "401267250",
  "date": "Jan 03, 2021",
  "matchup": "CHI vs. DAL",
  "headline": "LaVine scores 39, Bulls beat Doncic-less Mavericks 118-108",
  "body": "CHICAGO -- — Zach LaVine had 39 points and Coby White scored 21 of his 23 points in the second half to lead the Chicago Bulls to a 118-108 victory over the Dallas Mavericks on Sunday night.\n\n\r\n                    Jalen Brunson, starting in place of the injured Luka Doncic, had 31 points for the Mavericks.\n\n\r\n                    Otto Porter Jr. added 15 for the Bulls, who were without starter Lauri Markkanen and reserves Tomas Satoransky, Chandler Hutchison and Ryan Arcidiacano. Chicago has won three of four and won for the first time in four home games.\n\n\r\n                    “I thought Zach was very aggressive, which we need him to be,” Bulls coach Billy Donovan said. “He was big for us tonight. He had half our points in the first half. I told him he needs to remain aggressive, and that just doesn't mean scoring.”\n\n\r\n                    Doncic sat out because of a left quadriceps contusion. He was injured Friday night in the second quarter of a home victory over Miami Heat. He continued to play and finished with season highs of 27 points and 15 rebounds. He’s listed as day-to-day, with his status Monday night at Houston uncertain.\n\n\r\n                    “We’ll see how he is tomorrow,” Dallas coach Rick Carlisle said. “We don’t think this is a long-term thing.”\n\n\r\n                    The 21-year-old Slovenian star is off to a relatively slow start this season. He’s averaging 24.4 points, 7.6 rebounds and 6.4 assists, shooting 43.2% overall and 16.1% on 3-pointers in five games.\n\n\r\n                    Dallas led 60-59 at halftime despite LaVine scoring 29. LaVine was 9 for 13 from the field while the rest of the Bulls were 10 for 27.\n\n\r\n                    Brunson had 18 first-half points on 7-for-8 shooting for the Mavericks.\n\n\r\n                    “I had a little more opportunity and tried to help my team win,” Brunson said. “We came up a little short. We're capable of doing so much better.”\n\n\r\n                    Chicago scored the final seven points of the third quarter to take an 86-81 lead into the fourth.\n\n\r\n                    The Bulls stretched the lead to 100-91 with just over 8 minutes on a pair of free throws by White — the largest lead to that point by either team to that point.\n\n\r\n                    The Mavericks pulled to within 103-98 on a basket by Josh Richardson with just under 5 minutes to go. Porter Jr. answered on the end with a 3-point play on an offensive rebounds to build the lead back up to 106-98.\n\n\r\n                    Dallas responded with six straight points (four by Brunson) to make it 106-104 with 3 1/2 minutes to play.\n\n\r\n                    LaVine then was fouled at other end and hit two free throws. Following a defensive stop, LaVine fed Porter Jr. for a layup to make it 110-104 with 2:50 remaining.\n\n\r\n                    “Otto does a great job of reading the play,” LaVine said. “Otto made a quick backdoor cut and I hit him with it. It was a smart play.”\n\n\r\n                    White hit a 3-pointer with 1:33 left for a 113-105 lead. \n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: F Kristaps Porzingis (right knee surgery) has been cleared for full contact, but there is no timetable for his return. He is expected to participate when the team holds its next practice session on Wednesday. “There's nothing imminent with him playing (in a game),” Carlisle said. “But we're a lot closer than we were.” \n\n\r\n                    Bulls: Markkanen, Satoransky, Hutchison and Arcidiacono each missed his third straight game under the NBA's health and safety protocols. Satoransky and Hutchison have tested positive for COVID-19. None of the four is expected back until at least the end of the upcoming four-game West Coast trip.\n\n\r\n                    WINNING PLAY\n\n\r\n                    LaVine has scored a lot of points the previous two seasons for a losing team, but Donovan wants him to focus on doing things to help the Bulls win.\n\n\r\n                    “I think he wants to learn,” the coach said. “He's a bright guy. I think he is learning. I've seen a lot of growth in him. He wants to win.” \n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: At Houston on Monday night. \n\n\r\n                    Bulls: At Portland on Tuesday night to begin a four-game West Coast trip.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997605.793607
}