{
  "game_id": "0021500809",
  "espn_id": "400828696",
  "date": "Feb 19, 2016",
  "matchup": "TOR @ CHI",
  "headline": "McDermott scores 30, Bulls halt losing slide, beat Raptors",
  "body": "CHICAGO -- Chicago Bulls coach Fred Hoiberg pulled Doug McDermott aside Friday between practice and their game against the Toronto Raptors.\nHe told McDermott that he had a lot of confidence in McDermott's shot -- the one he had as the nation's leading scorer at Creighton -- and that he needed him to put the ball up.\n\"I told him every time he shoots the ball, I think it's going in,\" Hoiberg said. \"And to go out there and play his game, and play with confidence.\"\n\nMcDermott did just that, scoring a career-high 30 points off the bench to lead the Bulls to a 116-106 win over the Atlantic-leading Raptors, putting an end to their five-game slide.\n\"We needed that,\" said the Bulls' Derrick Rose. \"Doug came out and played aggressively ... we needed that.\"\nRose scored 26 and Pau Gasol added 18 points and 11 rebounds for the injury-depleted Bulls, who won for just the fifth time in their last 20 games. Kyle Lowry had 27 points to lead the Raptors. Jonas Valanciunas had 25 points and 12 rebounds for Toronto and DeMar DeRozan added 22.\nThe Raptors, playing their first game since returning from the All-Star break, led most of the first half but squandered it in the third quarter. Coach Dwayne Casey said his team's poor defense made things easy for McDermott and the Bulls.\n\"We had no semblance of defensive presence,\" Casey said. \"You give up a 37-point third quarter ... give a kid a career high. If we think we're going to go anywhere playing like that, we're kidding ourselves.\"\nHoiberg said McDermott just seemed to need a confidence booster to play like the guy drafted 11th overall last year out of Creighton, where he was the leading scorer in the nation. But like the Chicago team as a whole, McDermott had struggled recently.\n\"It just looked to me like he had lost a little bit of confidence, and you know, he's such a good player, such a good shooter,\" Hoiberg said.\nToronto was up by as much as 13 before McDermott sparked the run that put Chicago in control. He gave the Bulls a 70-69 lead on a pull-up jumper on a fast break with 6:14 to go in the third quarter.\nThe Bulls seemed to come alive after that, and McDermott continued his strong play in the fourth. He finished 13 for 17 from the field, and 4 for 5 from 3-point range.\nMcDermott said his talk with Hoiberg was short, but good.\n\"Coach showing that he has confidence in you means a lot as a player,\" McDermott said.\n\"It was a long-time coming,\" McDermott said of his performance. \"There's been a lot of ups and downs, so far, and I just stayed with it. It's just one game so I'm not going to get too high on myself, but it's definitely a good start for my confidence. ... Hopefully I can build off it.\"\nIt was the eighth straight time the Bulls have beaten the Raptors going back to late 2013.\nChicago was playing without Jimmy Butler, Nikola Mirotic and Joakim Noah because of injuries.\nTIP-INS\nBulls: The Bulls led the league in rebounds per game with 47.94 coming into Friday night's game. ... F Taj Gibson is the only Chicago player to appear in all 54 games this season. ... It could have been worse for Toronto: the last time they played the Bulls, Butler scored 40 points in the second half as part of a 42-point night.\nRaptors: DeRozan is one game short of tying Chris Bosh and Morris Peterson for the most wins by a player in franchise history. DeRozan has played in 231 wins over 495 games during six-plus seasons. ... Luis Scola, who is averaging 9.4 ppg, was held to just two points.\nUP NEXT\nRaptors: Host the Memphis Grizzlies on Sunday.\nBulls: Host the Los Angeles Lakers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994716.322447
}