{
  "game_id": "0021800189",
  "espn_id": "401070870",
  "date": "Nov 11, 2018",
  "matchup": "LAL vs. ATL",
  "headline": "James' dunk lifts Lakers to 107-106 win over Hawks",
  "body": "LOS ANGELES --  Tyson Chandler had quite a week with the Lakers.\n\nPlucked from last-place Phoenix, Chandler played a key defensive role in his first three games with his new team, helping them win three straight for the first time this season.\n\nLeBron James dunked for the winning basket with 15 seconds to go and Chandler blocked Trae Young's driving layup to preserve a 107-106 victory over the Atlanta Hawks on Sunday night.\n\nJames shouted and hugged Chandler in celebration of the Lakers' fifth win in six games.\n\n\"I find myself acting like a kid in a candy store again,\" said Chandler, who couldn't hear James amid the din of music and cheering.\n\n\"I said, `That's my dawg,\" James yelled across the Lakers' locker room.\n\nChandler's defense helped the Lakers prevail in wins against Minnesota and at Sacramento after having his contract bought out and coming to Los Angeles on Tuesday.\n\n\"He's been big,\" Lakers coach Luke Walton said. \"Not only the way he is on court but the way he talks in the huddles. Very happy to have him.\"\n\nJames scored 26 points and Kyle Kuzma added 18 points. Chandler had three blocks.\n\nKuzma's layup tied the game at 104-all with 1:34 to go.\n\nKent Bazemore was called for a technical for yelling at the referees at the end of that play and Kuzma made the free throw for a 105-104 lead.\n\nVince Carter dunked to put the Hawks back up 106-105.\n\n\"Vince is every bit of half man and half amazing. Whoever coined that years ago was right on,\" Hawks coach Lloyd Pierce said. \"Who knew he'd still be able to impact games at 41 years old?\"\n\nJames got fouled at the other end and missed both. But the Lakers got the offensive rebound and several of them batted the ball around trying to get it to the rim.\n\nKuzma charged into the paint amid three defenders for a shot from the left side. It missed.\n\nJames was waiting on the right, dunking for a 107-106 lead.\n\n\"All of a sudden, the beast comes out of nowhere for the win,\" Chandler said.\n\nTaurean Prince led the Hawks with 23 points, Bazemore added 21 and Trae Young had 20 for Atlanta, which still has just one road win on the season.\n\n\"It was a battle for sure. The way the whole game went, back and forth,\" Young said. \"They made a lot of plays, we made a lot of plays. I feel like I could have done a little bit more to help get my team the win.\"\n\nAlex Len's dunk started a 7-0 run that put Atlanta ahead 102-98 in the fourth.\n\nJames' basket drew the Lakers within one, but then he missed two long jumpers on the same possession.\n\nThe Hawks trailed by nine to start the fourth. Their first three baskets in the fourth came on 3-pointers by Prince (two) and Young (one).\n\nThe Lakers dominated the third, outscoring Atlanta 32-22 to take an 84-75 lead into the fourth.\n\nJames' dunk that tied the game midway through the second quarter got started with Rajon Rondo. He tossed up an alley-oop pass that Brandon Ingram batted back as he ran out of bounds to a trailing James, who provided the thunderous finish.\n\nTIP-INS\n\nHawks: They haven't beaten the Lakers at Staples Center since March 4, 2016. ... Prince was called for a flagrant-1 foul on James in the first quarter. ... C Dewayne Dedmon wasn't with the team while awaiting the birth of his first child.\n\nLakers: James earned his 768th career victory, overtaking Reggie Miller for 21st on the NBA's all-time victories list. ... They've won five in a row against the Hawks and are 24-5 against them at home since 1991.\n\nMOMENT OF SILENCE\n\nThe Lakers had a moment of silence to honor the 12 people killed in the bar shooting in ThousandOaks earlier in the week. Public address announcer Lawrence Tanter read each name and both teams wore T-shirts with \"Enough\" on the front and the victims' names on the back, something started by the Bucks and Clippers a day earlier.\n\nUP NEXT\n\nHawks: Visit Golden State on Tuesday.\n\nLakers: Host Portland on Wednesday. The teams split their first two meetings.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995035.0261471
}