{
  "game_id": "0021401120",
  "espn_id": "400579412",
  "date": "Apr 01, 2015",
  "matchup": "OKC vs. DAL",
  "headline": "Dallas digs deep to overcome OKC, Russell Westbrook's triple-double",
  "body": "OKLAHOMA CITY -- Dallas coach Rick Carlisle has been in the NBA as a player or coach for most of the past 30 years.\nHe's seen few games like the one Wednesday night.\nMonta Ellis scored 26 points, and Carlisle's Mavericks withstood a triple-double from Russell Westbrook to beat the Oklahoma City Thunder 135-131.\n\"It was a great basketball game,\" Carlisle said. \"Every once in a while, you stand over there and you say, 'This is an unbelievable game to be a part of,' and it was. The extreme momentum swings back and forth -- the shot making was breathtaking.\"\nWestbrook finished with 31 points, 11 rebounds and 11 assists. It was his 10th triple-double of the season, the 17th of his career and his eighth since the All-Star break. Anthony Morrow scored 32 points and Enes Kanter added a career-high 30 points and 16 rebounds for the Thunder.\n\nAccording to STATS, it was the first time a team had three players score at least 30 points in a game since Westbrook, Kevin Durant and James Harden did it for Oklahoma City on March 7, 2012. The Thunder became the first team to lose with three players scoring at least 30 since Portland lost to Phoenix in four overtimes in 1997, and the first to lose in regulation since Portland went down to Seattle on in 1995.\nDallas shot 61.5 percent from the field, the highest percentage Oklahoma City has allowed this season. The Mavericks made an astonishing 52 of 76 shots inside the 3-point line.\n\"I think we just got beat on a lot of pick-and-rolls, and I think we just have to work on it,\" Kanter said.\nChandler Parsons scored 22 points, Dirk Nowitzki and Amare Stoudemire scored 18, Tyson Chandler had 14 points and 10 rebounds, Al-Farouq Aminu scored 12 points and Rajon Rondo had 10 points and 10 assists for the Mavericks.\nThe Mavericks led 132-129 and had the ball in the final minute, but they turned it over. Westbrook made two free throws to cut Dallas' lead to a point, but Parsons hit a turnaround in the lane with 13 seconds left to push the Mavericks' lead back to three.\nWestbrook missed a wild 3-pointer while trying to draw a foul, hustled to get his own rebound, then ran to the corner and missed another three. Dallas rebounded, and Ellis made a free throw at the other end to clinch the win for the Mavericks.\nThe Mavericks moved four games ahead of the Thunder in the race for the No. 7 spot in the Western Conference standings with seven games remaining. The top eight teams make the playoffs.\n\"When you get two teams that desperately want to win a game like this, in this kind of environment, special things happen,\" Carlisle said. \"We survived.\"\nMorrow made a 3-pointer as time expired in the first half, but the Mavericks led 66-63 at the break. Westbrook scored just five points in the first half, but had six assists and five rebounds. Kanter scored 20 points before the break.\nParsons scored 13 points in the fourth quarter to help the Mavericks claim the victory.\n\"Being patient and staying aggressive and just trying to make some big plays down the stretch for our team,\" Parsons said. \"We all know how important this game was. We needed this win in a bad way.\"\nTIP-INS\nMavericks: The theme song from the popular 1980s television show, \"Dallas,\" played during the Mavericks' player introductions. ... Dallas shot 68 percent in the second quarter.\nThunder: F Nick Collison (left ankle sprain), G Andre Roberson (left ankle sprain) and F Serge Ibaka (right knee surgery) sat out. ... Kanter scored 15 points in the first quarter for the third time in his past five games.\nSTAT LINES\nWestbrook made just 2 of 11 3-pointers. It was the most threes he has attempted in a game in his seven-year career. The Thunder are 0-5 this season when he attempts at least seven threes. Oklahoma City is 6-13 when he attempts at least five threes, and 31-10 when he shoots four or fewer.\nQUOTE OF THE NIGHT\nCarlisle on Morrow, who made 6 of 9 3-pointers: \"Morrow had one of the best shot-making nights I've ever seen a shooter have. If you were to put a stopwatch on the amount of time from when it touched his hand to letting go, it's some of the quickest releases I've ever seen.\"\nUP NEXT\nMavericks: Host Houston on Thursday.\nThunder: At Memphis on Friday.",
  "source": "espn_api",
  "crawled_at": 1764991865.814772
}