{
  "game_id": "0022200273",
  "espn_id": "401468428",
  "date": "Nov 25, 2022",
  "matchup": "ORL vs. PHI",
  "headline": "Shake Milton helps short-handed 76ers beat Magic 107-99",
  "body": "ORLANDO, Fla. -- — Shake Milton had 24 points, a career-high 10 assists and nine rebounds, and the short-handed Philadelphia 76ers beat the Orlando Magic 107-99 on Friday night. \n\n\r\n              Tobias Harris added 23 points for Philadelphia, and reserve Georges Niang made five 3-pointers on his way to 18 points. It was the Sixers’ ninth straight win against the Magic.\n\n\r\n              “Georges is a one-man culture-changer, and he comes in with that positive attitude and he has such a great feel for the game of basketball,” Harris said of Niang. “He knows how to play basketball the right way. He’s been amazing for our whole team.”\n\n\r\n              Despite playing without injured stars Joel Embiid and James Harden and blossoming guard Tyrese Maxey, Philadelphia shook off a slow start and outscored Orlando 30-20 in the game-changing third quarter. The 76ers made 11 of 21 shots with four 3-pointers in the third.\n\n\r\n              Milton led the turnaround in the second half with 12 points and six assists after intermission.\n\n\r\n              Orlando closed to 96-91 and 103-98 late in the fourth, but the Sixers stayed in control with clutch play down the stretch.\n\n\r\n              “For us, it’s just an energy thing and it’s contagious,” Milton said. “(Georges) hits a big 3 and then Tobias does too, and it’s a momentum thing. With us being down as many players as we are, we need those loose-ball plays to get us going.”\n\n\r\n              The Sixers improved to 9-1 this season when leading after three periods. Philadelphia also broke a two-game road losing streak and evened its road record at 4-4.\n\n\r\n              Franz Wagner scored 24 points for Orlando, and Bol Bol had 18 points, eight rebounds and four blocked shots. The Magic haven’t beaten the Sixers since Dec. 27, 2019.\n\n\r\n              Magic forward Paolo Banchero, one of the NBA’s top rookies, played for the first time since Nov. 7 after missing seven games with a sprained left ankle. He finished with 19 points, four rebounds and three assists in 36 minutes.\n\n\r\n              Orlando has dropped three straight and five of six overall.\n\n\r\n              “They had some key offensive rebounds and they hit some timely shots,” Wagner said. “Overall, our energy and toughness haven’t shown in some of those key moments. That was the key moment – us reacting to what they were doing.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: P.J. Tucker, who defended Banchero well in the first half, didn’t played in the fourth quarter because of ankle soreness. ... Harden has missed six straight games with a right foot tendon strain. Maxey has missed four in a row because of a fractured left foot. Embiid has missed three straight with a left foot sprain. ... The 76ers are in a stretch of six road games in a seven-game span.\n\n\r\n              Magic: Coach Jamahl Mosley sponsored a Thanksgiving breakfast for more than 400 people at the Coalition of the Homeless on Thursday. It was the 30th consecutive year of the Magic hosting such an event on the holiday. ... All four Orlando-Philadelphia games this season are being played in the home-home schedule option. Orlando goes to Philadelphia on Jan. 30 and Feb. 1. ... With Wendell Carter Jr. (plantar fasciitis) still out, the Magic started the 7-foot-2 Bol at power forward alongside 7-foot center Mo Bamba. … Moritz Wagner, who had been out since Oct. 14 with a mid-foot sprain, made his season debut.\n\n\r\n              UP NEXT\n\n\r\n              The teams meet again Sunday in Orlando.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994654.0611572
}