{
  "game_id": "0021801110",
  "espn_id": "401071783",
  "date": "Mar 26, 2019",
  "matchup": "TOR vs. CHI",
  "headline": "Powell scores 20 as Raptors beat struggling Bulls 112-103",
  "body": "TORONTO --  Already undermanned when the game began, the Chicago Bulls lost another key player at halftime of their latest loss.\n\nNorman Powell scored 20 points, Serge Ibaka had 16 and the Toronto Raptors beat Chicago 112-103 on Tuesday night, their eighth consecutive win over the struggling Bulls.\n\nChicago forward Lauri Markkanen left after shooting 2 for 10 in 16 first-half minutes. Bulls coach Jim Boylen said Markkanen was suffering from fatigue.\n\n\"He was feeling a little sluggish,\" Boylen said. \"We just felt it was the right thing to do to keep him out the second half. He's been practicing hard, he's been playing hard.\"\n\nMarkkanen's departure further weakened a Bulls lineup that was already without leading scorer Zach LaVine (bruised right thigh, right knee tendinitis) and forward Otto Porter Jr. (strained right rotator cuff). LaVine sat for the third straight game and Poerter missed his fourth straight.\n\n\"It's no secret we're short-handed but I was really proud of our guys for battling and competing,\" Boylen said. \"We hung in there.\"\n\nToronto suffered its own injury setback when forward OG Anunoby left with 4:10 remaining in the fourth after he was accidentally hit in the head in a collision with Chicago's Brandon Sampson. Anunoby stayed down for a few moments before being helped to the locker room. Anunoby, who scored 10 points in 25 minutes, said he felt dizzy following the hit but added that he felt \"fine\" after the game.\n\nThe Raptors said Anunoby passed the concussion protocol and will be evaluated again Wednesday.\n\nKawhi Leonard and Kyle Lowry each scored 14 points before sitting out the final quarter, and Pascal Siakam had 13 points. The Raptors never trailed and avoided their first three-game home losing streak of the season. After losing to Oklahoma City last Friday, Toronto lost to Charlotte on Sunday on a half-court buzzer-beater by Jeremy Lamb.\n\nThe Raptors improved to 30-9 at home. It's the second straight season they've won at least 30 home games, and the fourth time in franchise history they've reached the mark.\n\nAll 12 Raptors players scored at least two points as Toronto coach Nick Nurse gave his bench plenty of minutes against the lowly Bulls.\n\n\"There wasn't a lot of juice in the game but we've got to play them,\" Nurse said.\n\nPowell said the game gave Toronto an opportunity to fine-tune some things before the playoffs.\n\n\"We've got to take advantage of these games and really work on some things with lineups, foundational defense, our offensive flow, pace, to get ready for the postseason,\" he said.\n\nWayne Selden scored 20 points and Shaquille Harrison had 15 as the Bulls lost for the seventh time in nine games. Chicago has lost two straight following a modest two-game winning streak.\n\nAfter making 2 of 16 attempts from 3-point range in their previous game, a 31-point loss to Utah, Chicago fared better from long range in this one, connecting on 8 of 23 attempts.\n\nToronto led 56-41 at halftime and took an 85-72 lead into the fourth.\n\nTIP-INS\n\nBulls: Boylen is unsure if Markkanen will be able to play Wednesday against Portland. ... G Kris Dunn (back) did not dress. ... Markkanen missed his first seven shot attempts. Marakkanen made 6 of 20 attempts in Saturday's loss to Utah.\n\nRaptors: Toronto signed G Jodie Meeks for the remainder of the season. Meeks appeared in two games with the Raptors last month while on a 10-day contract. ... This was the first of three straight games against opponents who have at least 50 defeats. Toronto plays at New York on Thursday and visits Chicago Saturday. It's the first time in Raptors history they've faced three consecutive 50-loss teams.\n\nFINE AT THE LINE\n\nThe teams combined to make 33 of 36 free throw attempts. Toronto made all 16 of its foul shots, while Harrison, Markkanen and Sampson each missed one.\n\nTHIEVERY\n\nLeonard matched his season-high with six steals. His career-high is seven.\n\nTOO MANY MISTAKES\n\nThe Bulls committed 18 turnovers, leading to 25 points for the Raptors.\n\n\"Too many turnovers for us,\" Boylen said.\n\nUP NEXT\n\nBulls: Host Portland on Wednesday night.\n\nRaptors: At New York on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994242.6787572
}