{
  "game_id": "0022200133",
  "espn_id": "401468288",
  "date": "Nov 05, 2022",
  "matchup": "BKN @ CHA",
  "headline": "Durant scores 27, leads Nets past Hornets 98-94",
  "body": "CHARLOTTE, N.C. -- — Kevin Durant scored 27 points and the Brooklyn Nets erased a double-digit deficit in the fourth quarter to beat the short-handed Charlotte Hornets 98-94 on Saturday night, improving to 2-0 since Kyrie Irving’s suspension.\n\n\r\n              Cam Thomas added 21 points for the Nets and Nic Claxton had 11 points and nine rebounds.\n\n\r\n              Terry Rozier returned from a seven-game absence and led Charlotte with 25 points on six 3-pointers. P.J. Washington and Kelly Oubre Jr. each had 18 points for the Hornets, who've lost four straight since beating the defending champion Golden State Warriors.\n\n\r\n              The Nets followed a romp in Washington by pulling out the victory on the second night of a road back-to-back.\n\n\r\n              “I think we have rallied around each other,” Durant said. “It's been a tough week for us and it's good just to get back to the game. Once the ball is tipped (everything else) goes out the window. We were just waiting to get back to playing. We showed some pride.\" \n\n\r\n              Thomas had only played 15 minutes in the Nets’ first eight games of the season. But the second-year guard has stepped up big the last two games, combining for 38 points, nine assists and seven rebounds in Irving’s absence.\n\n\r\n              “It was a rough first two weeks of the season for me, so for Coach to have trust in me to close the game out and play me a good amount of minutes the last two games, I can't thank him enough for that,” Thomas said.\n\n\r\n              The Hornets outscored the Nets 17-6 to open the fourth quarter to take an 11-point lead and appeared ready to pull away.\n\n\r\n              Rozier knocked down 3-pointers on back-to-back possessions, Nick Richards added a three-point play and Rozier made a free throw after Claxton was assessed a technical foul for disputing a call.\n\n\r\n              But the Nets came storming back behind Durant and Thomas. They trimmed the lead to two on a corner 3 from Joe Harris, then tied the game when Thomas stole a pass at midcourt and was fouled on a layup attempt. He connected on both free throws with 2:39 remaining.\n\n\r\n              Thomas gave the Nets the lead on a drive before Washington knocked down a 3 from the top of the key to give Charlotte a 92-91 lead with about a minute to play.\n\n\r\n              But Durant took over from there.\n\n\r\n              The 12-time NBA All-Star made a big 3 from the right wing to give the Nets the lead for good and added a baseline jumper to push Brooklyn's lead to four. Several of Brooklyn's points came off second-chance points off offensive rebounds and kickouts.\n\n\r\n              Mason Plumlee got an offensive rebound off a tipped Rozier 3-pointer with 27 seconds left to cut the lead in half before Thomas knocked home two free throws to make it a two-possession game with 14 seconds left.\n\n\r\n              Rozier missed two 3s on the other end and the Nets (4-6) escaped with the win.\n\n\r\n              “It hurts,” Oubre said of losing a double-digit lead in the fourth quarter. “We have to watch the film and grow from it and learn from it.\"\n\n\r\n              TECHNICAL DIFFICULTIES\n\n\r\n              Many of the statistics for the game still weren't available more than an hour after the completion of the game after the league's stat recording system, Genius Stats, crashed midway through the third quarter at the Spectrum Center and were never restored.\n\n\r\n              Hornets public relations officials scrambled to secure as many stats as they could by hand by watching film.\n\n\r\n              After the game, Durant was talking about his team's solid defense and said, “I wish I had a stat sheet in front of me,\" to which a reporter responded, “Yeah, so do we.\"\n\n\r\n              TIP-INS\n\n\r\n              Nets: Seth Curry returned to action while Ben Simmons was out for the fourth straight game with left knee soreness.\n\n\r\n              Hornets: Dennis Smith Jr., who has been filling in admirably at point guard in the absence of Rozier and LaMelo Ball, left the game in the first half with a sprained left ankle and did not return. Ball has missed nine games and Rozier was out seven with sprained ankles of their own. “I'm super excited to get him back and I miss him,” Oubre said of Ball. “He is another element to our team. ... But I want him to be healthy because he has a long career ahead of him.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Dallas on Monday night.\n\n\r\n              Hornets: Host Washington on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994896.2405472
}