{
  "game_id": "0021600728",
  "espn_id": "400900149",
  "date": "Jan 31, 2017",
  "matchup": "CHA @ POR",
  "headline": "Lillard has 27 and the Blazers beat slumping Hornets 115-98",
  "body": "PORTLAND, Ore. --  Damian Lillard says the Trail Blazers have reached the point of the season where it's all on the players.\n\nLillard scored 27 points and Portland handed the Charlotte Hornets their fifth straight loss with a 115-98 victory on Tuesday night.\n\nAllan Crabbe added 21 points off the bench for the Blazers, who are six games below .500 but have won four of their last five games.\n\n\"We've gotten to the point where, our coaches, they've spent a lot of time at the practice facility, watching film and giving us different things we need to look for and preparing us. At this point of the season, as players, it's our turn to take it over,\" Lillard said. \"We've got to make the changes within us, within our group and on the court, and we've got to go take what we want for ourselves the rest of the season.\"\n\nKemba Walker scored 22 points for the Hornets and moved into third place on the team's career scoring list. Nicolas Batum, who spent his first seven seasons in Portland, added 18 points and eight rebounds.\n\nMaurice Harkless dunked with 9:37 left in the game to give Portland a 94-72 lead and the Bobcats never challenged down the stretch. Portland led by as many as 24 points and had five players in double digits.\n\n\"We got crushed. I mean, we got crushed,\" Hornets coach Steve Clifford said.\n\nThe Blazers have won nine consecutive home games against the Hornets.\n\nCharlotte, playing the first game of a three-game road trip, was coming off a 109-106 loss at home to the Sacramento Kings.\n\nThe Blazers were coming off a 113-111 loss to the Golden State Warriors. But Portland had won its previous three games, and the team appears to be solving the defensive woes that have marked the first half of the season.\n\nThe Blazers missed their first eight shots, a run that was broken by Lillard's 3-pointer. He had 14 points in the opening quarter as the Blazers took a 30-23 lead. Crabbe's 3-pointer extended Portland's advantage to 37-24.\n\nBatum's fadeaway jumper pulled the Hornets to 46-40, but Al-Farouq Aminu answered with a 3-pointer for Portland. The Blazers took a 56-50 lead into the break, led by Crabbe with 16 points.\n\nPortland opened the second half with an 11-2 run and pushed the margin to 78-60 after Lillard's 3-pointer.\n\nWith his fifth point of the night, Walker passed Larry Johnson (7,405) and now has 7,423 points. Walker became a first-time All-Star this season when he was selected as an Eastern Conference reserve.\n\nIt doesn't get easier for the Hornets, who were headed off to play Golden State the next night.\n\n\"It's one of the things about the NBA, you don't have much time to dwell on the rough times,\" said Marvin Williams, who finished with 10 points. \"We have a very, very good team tomorrow night, so it might just be what we need to bring out our competitive spirit a little more.\"\n\nTIP-INS\n\nHornets: Clifford has eight technical fouls this season. ...Walker has had a 3-pointer in 27 straight games. He has 35 games with 20-plus points this season.\n\nTrail Blazers: Lillard has scored 20-plus points in each of his 10 career games against the Hornets. ... Lillard has made a 3-pointer in 30 straight games, a career best. ... Ed Davis missed his fifth straight game with a wrist injury, but could return Friday against the Mavericks.\n\nMISSING ZELLER\n\nThe Hornets were without Cody Zeller, who missed his fourth straight game with a thigh injury. Charlotte is 1-10 without him.\n\n\"We miss him,\" \"Batum said. \"We need him back as soon as possible.\"\n\nIMPROVING DEFENSE\n\nPortland has been focusing lately on defense, and it seems to be paying off. The Blazers improved to 10-4 this season when keeping opponents below 100 points.\n\n\"Besides the 3-pointers, I think we guarded them pretty well,\" center Mason Plumlee said. \"(There were) a couple of blow-bys too where they got to the rim, but overall I thought it was much improved from the last time we played them.\"\n\nThe Hornets beat the Blazers 107-85 on Jan. 18 in Charlotte in the other meeting this season.\n\nUP NEXT:\n\nHornets: Charlotte visits Golden State on Wednesday.\n\nTrail Blazers: Portland hosts the Dallas Mavericks on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995497.3698602
}