{
  "game_id": "0021600907",
  "espn_id": "400900302",
  "date": "Mar 02, 2017",
  "matchup": "CHA @ PHX",
  "headline": "Chriss has 17 points, hot-shooting Suns beat Hornets 120-103",
  "body": "PHOENIX --  The Phoenix Suns were 20th in the NBA in field goal percentage, making 45 percent of their shots on the season.\n\nOn Thursday night, they got hot.\n\nMarquese Chriss scored 17 points and the Suns shot a season-best 59.7 percent in a 120-103 victory over the Charlotte Hornets.\n\nChriss made 6 of 9 shots and missed roughly a full quarter after straining a calf early in the first period.\n\nT.J. Warren added 16 points and eight rebounds, and Alan Williams had 16 points and 12 rebounds, including a layup with 2:46 to play that made it 114-99.\n\nThe Suns held the Hornets to 12 points in the fourth quarter and got 53 points from their bench. Phoenix made 39 of 58 two-point shots (67 percent).\n\n\"Our second unit played phenomenal,\" coach Earl Watson said.\n\n\"We've got to play consistent like that. Moving the ball, screening away,\" Suns guard Eric Bledsoe said.\n\nLeandro Barbosa also had 16 points, and Devin Booker had 15 points, nine assists and six rebounds. The Suns are 8-4 against Eastern Conference teams at home this season.\n\nKemba Walker led Charlotte with 26 points.\n\n\"We never got them under control. Penetration, transition, we let them play to their strengths,\" Hornets coach Steve Clifford said.\n\nThe Suns lost their halftime lead briefly early in the third quarter, but went on an 11-0 run that featured Chriss' corner 3 to take an 80-70 lead with 7:15 to play.\n\nPhoenix led by as many as 12 points in the third, but the Hornets whittled the deficit to 87-85 on Walker's 3-pointer at the 2:53 mark.\n\nThe Suns led 94-91 entering the fourth after Marvin Williams was fouled by Booker with 0.4 seconds left and made three free throws.\n\nWarren scored 12 points in the third quarter.\n\nMichael Kidd-Gilchrist's six steals were a career high for the Hornets forward.\n\nThe Suns trailed by as many as 10 points in the first quarter but cut the Hornets' lead to four by the time it ended. Williams had 13 points in the quarter for Charlotte.\n\nAfter being behind for much of the first half, Phoenix took a 52-50 lead with Barbosa's short bank shot with 3:22 left in the second quarter. Barbosa scored 10 points in the quarter after not playing in the first.\n\nWalker had 18 first-half points for the Hornets, who trailed 61-58 at halftime after Phoenix made 13 of 19 shots in the second quarter.\n\n\"We just play in spurts,\" Walker said. \"We're not making those effort plays that need to be made out there, which is getting back in transition.\"\n\nTIP-INS\n\nHornets: It took 61 games, but the Hornets finally played the Suns this season and will host them later this month. \"It's extra film work, little bit extra preparation,\" Clifford said. ... C Miles Plumlee missed his sixth straight game with a right calf strain.\n\nSuns: Radio broadcaster Al McCoy will be inducted into the team's Ring of Honor during a halftime ceremony Friday night when the Suns host Oklahoma City. McCoy has called games for 44 seasons. ... The Suns played at home for the first time since Feb. 15. The All-Star break and three road games filled the schedule since then.\n\nKAMINSKY INJURED\n\nHornets center Frank Kaminsky took a blow to his upper left arm colliding with Alan Williams in the fourth quarter and was taken to the locker room. He did not return and finished with 16 points. No update was given on Kaminsky's condition but he had a wrap over his left shoulder after the game.\n\nTWO TAKEOFFS FOR `AIRPLANE MODE'\n\nDerrick Jones Jr., the runner-up in the NBA dunk contest at All-Star Weekend, took flight early in the fourth quarter with a jam off an alley-oop pass from Tyler Ulis. A few minutes later, the pair connected again for another lob that Jones, nicknamed \"Airplane Mode,\" threw down with his left hand. It gave the Suns a 105-97 lead with 7:43 to play.\n\nGAME CHANGER\n\nUlis had eight points and a career-high eight assists in 23 minutes, the rookie from Kentucky earning praise from his coach. \"Tyler Ulis changed the game,\" Watson said, noting his defensive pressure and hustle to tire out Charlotte's guards.\n\nUP NEXT\n\nHornets: At Denver on Saturday, the finale of seven straight on the road.\n\nSuns: Host Oklahoma City on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995481.024422
}