{
  "game_id": "0022200161",
  "espn_id": "401468316",
  "date": "Nov 09, 2022",
  "matchup": "ORL vs. DAL",
  "headline": "Magic limit Luka Doncic to 24 points, beat Mavericks 94-87",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 22 points and the Orlando Magic held Luka Doncic under 30 points for the first time this season in a 94-87 win over the Dallas Mavericks on Wednesday night.\n\n\r\n              Doncic, the NBA's leading scorer, finished with 24 points after scoring 30 or more in each of the Mavericks' first nine games. He shot 9 for 29 overall and 2 for 11 from 3-point range.\n\n\r\n              Spencer Dinwiddle scored 29 points for the Mavericks, who were outrebounded 49-29 in losing for the first time in five games.\n\n\r\n              “Every NBA team can beat you and I played terrible, but I think as a group we didn't play good,” Doncic said. “We have to approach the game better.”\n\n\r\n              The Magic played for the first time without rookie Paolo Banchero, who sprained his ankle Monday night. He was replaced in the starting lineup by Chuma Okeke, who drew the assignment of defending Doncic in his first start of the season.\n\n\r\n              “Luka was our focus coming into the game. He’s one of the best in the league, scoring, passing, all of that,” said Okeke, who had eight points and seven rebounds. “We had a specific game plan of what we wanted to do, which was pressure him, not make anything easy. That was the game plan for the whole game.”\n\n\r\n              The Magic held the Mavericks to 37.9% shooting and 87 points after giving up 126 and 134 points in consecutive losses to Sacramento and Houston.\n\n\r\n              “We have everything to prove as a group and also as individual players,” Wagner said. “We weren’t satisfied with our performance the other day against Houston ... we want to be a resilient team. We have to get better at finishing games, playing through mistakes and stuff like that.”\n\n\r\n              Dinwiddie's layup early in the second quarter put Dallas up 34-24, the Mavs' only double-digit lead of the game.\n\n\r\n              Dallas led 83-82 when Dinwiddie scored with 6:02 remaining, but the Magic answered with eight straight points in a 3 1/2-minute stretch in which Doncic missed two free throws.\n\n\r\n              A jumper and two free throws by Wagner put Orlando up 94-85 with 56.7 seconds left.\n\n\r\n              “We just missed open shots. In this league you can't miss open shots,” Dallas coach Jason Kidd said. “We got a lot of good looks. We've just got to make them.”\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: The start of the game was moved up by 90 minutes due to the approach of Hurricane Nicole. Dallas planned to bus to Tampa, away from the worst of the approaching storm, to fly to Washington for Thursday night's game against the Wizards. ... F/C Christian Wood missed his first game of the season with a sprained left knee. ... G Tim Hardaway Jr., who left Monday's game at Brooklyn with a left hip strain, played 22 minutes.\n\n\r\n              Magic: Okeke, Bol Bol and Jalen Suggs had seven rebounds each. . . The Magic are hopeful that Banchero, who leads NBA rookies in scoring (23.5) and rebounds (8.3), will miss only one game. ... G Kevon Harris sat out the game with a left rib contusion.\n\n\r\n              WILT'S 60-YEAR-OLD RECORD IS SAFE FOR NOW\n\n\r\n              Other than Doncic, the only player to open an NBA season with nine games of 30 points or more was Wilt Chamberlain, who scored 30 or more points in the first 23 games of the 1962-63 season.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Play at Washington on Thursday night.\n\n\r\n              Magic: Host Phoenix on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994790.391667
}