{
  "game_id": "0022400971",
  "espn_id": "401705537",
  "date": "Mar 15, 2025",
  "matchup": "MEM vs. MIA",
  "headline": "Jackson, Bane lead Grizzlies to 125-91 victory over Miami, Heat's 7th straight loss",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 31 points, Desmond Bane added 22 points, 10 rebounds and eight assists as the Memphis Grizzlies led from start to finish in a 125-91 victory over the Miami Heat on Saturday night.\n\n\r\n              Jackson shot 13 of 18 from the field as the Grizzlies won for the fifth time in their last six games. Zach Edey and Brandon Clarke added 12 each for Memphis.\n\n\r\n              Kel'el Ware led the Heat with 19 points and 11 rebounds, while Bam Adebayo added 18 points. Kyle Anderson and Jaime Jaquez Jr. had 13 points each as the Heat lost their seventh straight.\n\n\r\n              With Ja Morant, sitting out with a lingering sore right shoulder, Memphis relied on Jackson, who had 23 points at the half. The Grizzlies' lead reached 18 before Memphis carried a 63-48 lead into the locker room at the half.\n\n\r\n              Memphis was still shooting 55% from the field midway through the fourth quarter as the lead continued to swell. \n\n\r\n              Takeaways\r\n              Heat: Miami continues to maneuver into position in the play-in postseason despite the recent losing streak. The Heat entered the night in ninth behind Orlando and ahead of the Bulls. \n\n\r\n              Grizzlies: After Friday night's loss to Cleveland, the Grizzlies looked much better to open the game, closing the first half on a 21-9 run.\n\n\r\n              Key moment\r\n              The special moment for Memphis fans came during a first-quarter timeout when they showed former Memphis forward Tony Allen in a suite. The team retired Allen's No. 9 jersey in a postgame ceremony.\n\n\r\n              Key stat\r\n              Tyler Herro was 3 of 12 from the field and 1 of 4 from deep for eight points, ending his string of 93 straight games in double figures.\n\n\r\n              Up next\r\n              The Heat travel to New York to play the Knicks on Monday night. Memphis opens a five-game road trip on Monday night in Sacramento.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997594.585883
}