{
  "game_id": "0022000281",
  "espn_id": "401267441",
  "date": "Jan 27, 2021",
  "matchup": "PHX vs. OKC",
  "headline": "Thunder rally for 102-97 win over Suns, ruining Paul's night",
  "body": "PHOENIX -- — Chris Paul reminded the Oklahoma City Thunder what they were missing after trading him during the offseason. Then the Thunder turned around and reminded the Phoenix Suns and Paul why they're a team that appears on the rise.\n\n\r\n                    Al Horford had 21 points and 11 rebounds, Shai Gilgeous-Alexander also scored 21 points and Oklahoma City rallied to beat Phoenix 102-97 on Wednesday night.\n\n\r\n                    Paul scored a season-high 32 points in his first game against Oklahoma City since the trade. The 10-time All-Star played well during his only season with the Thunder, averaging 17.6 points and 6.7 assists.\n\n\r\n                    He had one of his best games this season at Oklahoma City’s expense on Wednesday. The point guard shot 12 of 21 from the field and scored 13 points during a seven-minute stretch in the fourth that accounted for a big chunk of the team’s offense.\n\n\r\n                    But the young and improving Thunder hung close throughout the fourth and rallied in the final minutes. Lu Dort made a 3-pointer with 2 minutes left that put Oklahoma City up 96-95 and the Thunder didn’t trail again. \n\n\r\n                    “Defensively, our mental focus was very good,” Horford said. “I was really happy with how into it we all were. We continued to get stops down the stretch and get rebounds.”\n\n\r\n                    It was a see-saw game that featured Phoenix blowing a 17-point lead in the first half and Oklahoma City coughing up a 13-point lead in the second half before the Thunder locked down with defense in the final possessions. \n\n\r\n                    Gilgeous-Alexander added eight assists and seven rebounds.\n\n\r\n                    “It was a 48-minute game,” Oklahoma City coach Mark Daigneault said. “We didn’t start great. They had a rough second quarter and then we just stayed the course.”\n\n\r\n                    Paul had a chance to tie the game with about 10 seconds left on a 3-pointer, but missed badly for an airball.\n\n\r\n                    “We are just not playing well enough right now,” Paul said. “I am not saying we are not good enough. We are just not playing well enough right now.”\n\n\r\n                    Phoenix played without All-Star guard Devin Booker, who missed his second straight game with a sore hamstring. The Suns have lost three straight. Jae Crowder added 17 points for Phoenix, which shot just 38% from the field.\n\n\r\n                    “Until this team understands consistency for four quarters we are going to feel like this a lot,” Suns coach Monty Williams said. “We can try to get everybody to feel sorry for us. It ain't going to work. We've got to be consistent. This is on us, period.”\n\n\r\n                    Oklahoma City took advantage of some cold shooting from Phoenix — which missed 16 straight 3-pointers during a stretch — and took a 59-46 lead early in the third quarter. The Suns eventually shook loose from the slump and pulled within 73-71 heading into the fourth.\n\n\r\n                    The Suns jumped out to a 32-17 lead in the first quarter after getting 17 points from their bench. But the offense collapsed in the second and they scored just 10 points while missing all 11 3-point attempts. That helped the Thunder grab a 45-42 halftime lead.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Horford was back in the lineup after missing six straight games because of personal reasons. ... Veteran guard George Hill didn't play because of a sprained thumb. \n\n\r\n                    Suns: Backup guard Cameron Payne missed didn't play because of a sore foot. ... Forwards Dario Saric and Damian Jones both missed the game because of the league's health and safety protocols but were on the bench.\n\n\r\n                    WILLIAMS RETURNS\n\n\r\n                    Williams was on the bench for the Suns after missing the past two days of practice because of personal reasons.\n\n\r\n                    “I don’t like missing days,” Williams said pregame. “It’s not part of my career over my time in the league. I haven’t missed days. So that’s always hard for me, but there’s just certain things in my life that I have to attend to. I may have to do it a few more times going forward, but I certainly appreciate the level of concern and respect for my privacy. At the right time, I’ll let everyone know what’s going on, but for now it’s a private matter.”\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Starts a five-game homestand with a game against the Nets on Friday.\n\n\r\n                    Suns: Host the Warriors on Thursday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997762.2515671
}