{
  "game_id": "0021800003",
  "espn_id": "401070693",
  "date": "Oct 17, 2018",
  "matchup": "CHA vs. MIL",
  "headline": "Antetokounmpo scores 25, Bucks top Hornets 113-112",
  "body": "CHARLOTTE, N.C. --  Tony Parker said he'd never seen anything like it in his 18 seasons in the NBA.\n\nThe Charlotte Hornets went small ball -- like really, really small ball -during a stretch to start the fourth quarter and nearly overcame a 20-point deficit before falling 113-112 to Giannis Antetokounmpo and the Milwaukee Bucks on Wednesday night in the season opener for both teams.\n\nAntetokounmpo had 25 points, 18 rebounds and eight assists and made two free throws with 23.7 seconds left for the go-ahead score as the Bucks held off late rally and a 41-point performance from Hornets point guard Kemba Walker to earn the win.\n\n\"We can't give them the chance to believe that they can come back, they have a great team they have guys that can knock down 3's and get the crowd into it and comeback,\" Antetokounmpo said.\n\nHornets first-year coach James Borrego turned to what Parker called an \"unorthodox approach\" with his team down 10 entering the fourth quarter. He sent out a lineup that included the 6-foot-1 Walker, Parker (6-2), Malik Monk (6-3), Michael Kidd-Gilchrist (6-7) and Nic Batum (6-8). Kidd-Gilchrist and Batum, who were guards last season, spent time covering Antetokounmpo on defense.\n\nAnd it worked.\n\nLed by Walker, the Hornets caught fire from the outside and got easy looks in transition. They stuck with it for most of the fourth quarter and took their only lead of the game with 36.3 seconds on a pair of free throws by Walker.\n\nBut Walker missed a driving layup with 3.4 seconds left. The loose ball got kicked outside, where Batum misfired on a 3-pointer from the left wing at the buzzer.\n\n\"That lineup was small, super small,\" Parker said with a laugh. \"But we came back.\"\n\nWalker said he had never played with a unit that small before. Batum laughed and said it was the first time he's ever played center.\n\n\"We tried to counter and go big and there were some possessions where big looked good,\" said Bucks new coach Mike Budenholzer. \"But then I think we lost track of some shooters.\"\n\nWhen asked if that type of lineup is sustainable, Parker said, \"It depends on the matchups. Some nights we can do it. Some nights we won't be able to do it.\"\n\nTIP INS\n\nBucks: Khris Middleton had 19 points and Eric Bledsoe added 17 as the Bucks set out on the quest to reach the playoffs for the fourth time in five seasons. ... Brook Lopez 14 points in his debut for the Bucks after signing a one-year contract in the offseason.\n\nHornets: Malik Monk had 18 points, while Parker had eight points and seven assists in his first game with the Hornets after 17 seasons with the Spurs.\n\nBUCKS SHOOTING:\n\nBudenholzer stressed spacing and perimeter shooting to open up more 1-on-1 opportunities for the 6-foot-11 Antetokounmpo to drive the lane. It certainly opened up some 3-point chances as the Bucks used that spacing to knock down 11 of 22 3-point attempts in the first half to build a 67-54 halftime lead.\n\n\"Love the way we started the game, loved the way we played a lot in the first half, just got to find a way to do that for 48 minutes,\" Budenholzer said.\n\nWALKER BUMMED\n\nDespite setting a franchise record for points scored in a season opener, Walker was mad at himself after the game for missing the potential winning layup. \"I just missed it,\" Walker said. \"I took my eyes off the rim. I'm (upset). It's going to eat me up tonight.\"\n\nBut Eric Bledsoe, who covered Walker most of the game, was certainly impressed with the two-time All-Star's effort.\n\n\"He had what, 41 points?  I guess I didn't do too good\" guarding him, Bledsoe joked. \"He's a tough guard man.  I thought everybody locked in on him down the stretch and kind of helped me out a little bit.  It's a team game.\"\n\nCELEBRATING 30 YEARS\n\nCharlotte wore its throwback white jerseys with pinstripes and they celebrated 30 years of basketball. Several members of the original 1988-89 team were introduced before the game, including Muggsy Bogues, Dell Curry, Rex Chapman and Kelly Tripucka.\n\nUP NEXT\n\nBucks: Host Indiana on Friday night.\n\nHornets: At Orlando on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994446.163046
}