{
  "game_id": "0022301110",
  "espn_id": "401585738",
  "date": "Apr 03, 2024",
  "matchup": "CLE @ PHX",
  "headline": "Booker scores 40, Durant adds 32, Suns improve playoff position with a 122-101 win over Cavs",
  "body": "PHOENIX -- — Devin Booker scored 40 points, Kevin Durant added 32 and the Phoenix Suns beat the Cleveland Cavaliers 122-101 on Wednesday night. \n\n\r\n              The Suns have won six of their past eight, moving up to the No. 6 spot in a crowded Western Conference playoff race, which would allow them to avoid the play-in tournament.\n\n\r\n              Booker — coming off a 52-point night in a win against New Orleans on Monday — shot 13 of 25 from the field, including 5 of 9 from 3-point range. Durant shot 13 of 23 and added seven assists.\n\n\r\n              “I think it's just the energy throughout our whole team, understanding what's at stake and what time of year it is,” Booker said. “The ball's hopping around, we're defending at a high level.\"\n\n\r\n              It's just the second time this season that Booker and Durant have both scored at least 30 in the same game. Royce O'Neale scored 17 points, making five 3-pointers, while Bol Bol added 15 points off the bench.\n\n\r\n              The 7-foot-3 Bol has earned more time in the Suns' rotation over the past few months. He barely played during the season's first few months, but is averaging about seven points per game since the All-Star break, shooting about 60% from the field, including 43% from 3-point range.\n\n\r\n              “He's growing every single time he gets on the floor,” Durant said. “He's understanding more and more what his job is and he's a great shotmaker as well. It's all about building on these performances and continuing to get better.”\n\n\r\n              Cleveland’s Donovan Mitchell played against the Suns one night after resting the sore left knee that's caused him to miss much of March. The five-time All-Star finished with 24 points. Jarrett Allen and Evan Mobley both added 20.\n\n\r\n              “We've just got to find that consistently,” Mobley said. “We had some good things in there we can definitely pull from, but we've just got to put it all together.”\n\n\r\n              The Suns rolled to a 72-47 lead by halftime, making 12 of 18 3-pointers. Booker led all scorers with 19 points before the break while Durant had 17.\n\n\r\n              “The first half, you give up 72 points, it's hard to come back from,” Cavs coach J.B. Bickerstaff said. \"I was proud of the guys' effort in the second half. I thought we competed at a much higher level.\"\n\n\r\n              Cleveland cut that deficit to 77-66 on Allen's layup midway through the third, but the Suns bounced back to take a 98-77 lead heading into the fourth.\n\n\r\n              The Suns would avoid the play-in tournament if the season ended today, but there's plenty of work to do. The Mavericks, Suns, Pelicans, Kings and Lakers — who currently occupy the five through nine spots in the West — are separated by just two games in the standings.\n\n\r\n              The Cavaliers are trying to protect the No. 3 seed in the Eastern Conference, but the Magic and Knicks are right behind them. Cleveland has an 11-15 record since Feb. 12.\n\n\r\n              The Suns played without starting guard Grayson Allen, who missed the game with left hip soreness.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Lakers on Saturday.\n\n\r\n              Suns: Host Minnesota on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996719.901995
}