{
  "game_id": "0021800295",
  "espn_id": "401070976",
  "date": "Nov 26, 2018",
  "matchup": "CLE vs. MIN",
  "headline": "Covington, Towns lead Timberwolves past Cavs, 102-95",
  "body": "CLEVELAND --  There's no question the Minnesota Timberwolves have been better since trading disgruntled star Jimmy Butler.\n\nMonday night's 102-95 victory over the Cleveland Cavaliers improved Minnesota's record to 6-2 since the trade two weeks ago that sent Butler to Philadelphia.\n\nThe victory moved Minnesota within a game of .500. The Timberwolves haven't been at the break-even mark since the fourth game of the season.\n\n\"We have a long way to go, but we keep improving,\" coach Tom Thibodeau said. \"We're still not playing as well as we can. We can't be satisfied.\"\n\nRobert Covington, one of three players acquired in the Butler trade, scored 24 points and Karl-Anthony Towns added 21, giving Minnesota its second win in 10 road games this season.\n\nCovington bounced back from a horrendous game Saturday against Chicago in which he scored four points, was 1 of 18 from the field and missed all 10 of his 3-point attempts. He was 8 of 12 from the field and hit 4 of 7 3-pointers Monday.\n\n\"The second that clock hit zero (Saturday), that game was out of my mind,\" Covington said. \"That's what happens when you're a shooter.\"\n\nDerrick Rose came off the bench to score 10 of his 12 points in the fourth quarter. Towns hit two baskets in the final two minutes, including a fadeaway jumper on the baseline, after Cleveland cut the lead to 91-86.\n\nCleveland beat Philadelphia and Houston last week for its first back-to-back wins of the season, but couldn't make it three straight.\n\nKyle Korver scored 22 points, including six 3-pointers for Cleveland. Rodney Hood added 20 points while Tristan Thompson had 16 points and 11 rebounds.\n\nCleveland shot 8 of 21 and committed five turnovers in the fourth quarter. Hood thought the lack of ball movement down the stretch was a key factor.\n\n\"We get stagnant and then it turns into -- I don't want to say bad basketball -- but it makes it tougher for us to score,\" he said.\n\nTowns turned in a highlight-worthy play in the second quarter. The 7-footer picked up an errant pass from Larry Nance Jr. near midcourt, drove around two defenders in the lane and scored on a thunderous dunk.\n\nAndrew Wiggins scored 11 points after going 0 for 12 from the field and being held scoreless Saturday. Wiggins was 4 of 11 from the field.\n\nThe Timberwolves led 75-71 heading into the final period after the Cavaliers cut into a 12-point deficit. Rose hit three baskets and assisted on Covington's 3-pointer, pushing the lead to 86-74 and prompting Cleveland coach Larry Drew to call timeout with 8:26 to play.\n\nCleveland rallied again and cut the lead to 88-84 with five minutes to play, but Rose scored in the lane and Towns hit his two big baskets.\n\nRose played 16 games with Cleveland last season, but battled injuries and was traded in February.\n\nHUGE NUMBERS\n\nDrew is a big fan of Towns, who is averaging 20.8 points and shooting 49 percent from the field. He also averages 12.1 rebounds and had 10 boards Monday. Towns has made 39 of his 96 3-point attempts.\n\n\"He's now shooting it from the 3,\" Drew said \"He's got a good mid-range game. He can put it on the floor. He's a terrific passer. For a big man he has a tremendous feel for the game. Every game it seems like he gets better and better.\"\n\nTOUGH STRETCH\n\nMinnesota finished a stretch of three games in three cities over four nights.\n\n\"Tonight was a grinding game,\" Rose said. \"Tonight felt like a back-to-back-to-back. We were tired, to be honest. It builds your character as a team.\"\n\nSTILL LEARNING\n\nRookie Collin Sexton, taken by the Cavaliers with the No. 8 pick in the draft, scored 11 points but was 5 of 19 from the field, with four assists and four turnovers.\n\nTIP-INS\n\nTimberwolves: Jeff Teague was the fifth player in double figures with 13 points. ... Thibodeau was hit with a technical foul with 24 seconds left in the game. ... Minnesota started 3 of 10 from the field and the first basket was Covington's 18-foot bank shot.\n\nCavaliers: F David Nwaba was out with a sore right knee after starting the previous four games. Nance, who tweaked his right ankle in the fourth quarter Saturday and had to come out of the game, started. ... G George Hill (sprained right shoulder) has begun contact drills during on-court workouts.\n\nUP NEXT\n\nTimberwolves: Host San Antonio on Wednesday.\n\nCavaliers: At Oklahoma City on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994796.627593
}