{
  "game_id": "0021600140",
  "espn_id": "400899590",
  "date": "Nov 13, 2016",
  "matchup": "CHA @ CLE",
  "headline": "James, Frye rally Cavaliers past Hornets, 100-93",
  "body": "CLEVELAND -- LeBron James played with a different supporting cast down the stretch, but the result looked familiar.\nJames, Cleveland's only starter on the floor in the fourth quarter, scored 11 of his 19 points in the final period and the Cavaliers rallied for a 100-93 victory over the Charlotte Hornets on Sunday.\n\nChanning Frye scored a season-high 20 points and played the entire fourth quarter, along with James, Iman Shumpert, Richard Jefferson and Jordan McRae.\n\"Our second guys did a great job,\" James said. \"It was good we were able to close the game out. We got stops and we made shots.\"\nKyrie Irving scored 19 points and Kevin Love added 17, but coach Tyronn Lue stuck with the group that helped Cleveland take control of the game. J.R. Smith, who starts at shooting guard, was sidelined with a sore right ankle.\n\"They were playing great,\" Lue said. \"Kevin and Kyrie said, `Let it roll.' They understood and we got the win.\"\nThe Cavaliers set an NBA record by hitting at least 10 3-pointers in each of the first nine games of the season.\nJames scored eight points on 4-of-15 shooting through three quarters before taking over in the fourth, when he also had five assists.\nKemba Walker scored 21 points for the Hornets, who have lost two straight after starting the season 6-1.\nCharlotte led 72-71 after three quarters, but Frye's 3-pointer off James' assist put the Cavaliers ahead 77-74.\nJames blocked a shot by Frank Kaminsky that led to Jefferson's basket and scored in the lane, putting Cleveland ahead 81-76. He also hit a 3-pointer and found Frye for another 3 that stretched the lead to 89-80 midway through the quarter.\nCharlotte cut the margin to 94-90, but James hit a 3-pointer and a free throw as Cleveland put away the game.\nFrye was 7 of 15 from the field, including 6 of 12 on 3-pointers.\n\"They're so good and they made the plays they needed to win,\" Hornets coach Steve Clifford said. \"They're a great team.\"\nCharlotte forward Michael Kidd-Gilchrist scored 11 points after missing Friday's game against Toronto with a sore back.\nTIP-INS\nHornets: C Spencer Hawes missed a breakaway dunk as time ran down in the second. ... G Jeremy Lamb (strained left hamstring) is participating in non-contact drills and could play Friday when Charlotte hosts Atlanta. He has missed six games.\nCavaliers: G Mike Dunleavy started in place of Smith and scored two points on 1 of 6 from the field. ... Irving was replaced after picking up his second foul midway through the first quarter ... Cleveland made 12 of 22 shots in the first quarter.\nTOUGH ONE TO TAKE\nWalker sat in front of his locker for more than 20 minutes after the game.\n\"I think we just let the game get away from us,\" he said. They made some great plays and just found guys when they needed to. We had a few mental mistakes that didn't help, as well.\"\nIT'S OK WITH US\nIrving and Love jumped off the bench several times in the fourth quarter and didn't have a problem with not returning to the game.\n\"It's about the growth of the team,\" Irving said. \"The reliance isn't on the normal guys every night. It's an exciting time.\"\nLove scored 15 points in the first quarter.\n\"Everybody was making plays in different ways,\" he said. \"LeBron always is, but especially with that unit he was the quarterback out there.\"\nIrving averages a team-high 23.9 points while Love scores 20.6 a game, the third-highest total. James is second with a 22.9 average.\nUP NEXT\nHornets: Visit Minnesota on Tuesday. Charlotte has won five straight over the Timberwolves, including two on the road.\nCavaliers: Host Toronto on Tuesday. Cleveland, which beat the Raptors in six games to win the 2016 Eastern Conference finals, defeated Toronto 94-91 in the second game of the season.",
  "source": "espn_api",
  "crawled_at": 1764995544.49982
}