{
  "game_id": "0022200350",
  "espn_id": "401468505",
  "date": "Dec 04, 2022",
  "matchup": "CHI @ SAC",
  "headline": "Monk, Sabonis, Kings overcome LaVine's 41 points, beat Bulls",
  "body": "SACRAMENTO, Calif. -- — Malik Monk scored 20 points off the bench and the Sacramento Kings overcame Zach LaVine's 41 points to beat the Chicago Bulls 110-101 on Sunday.\n\n\r\n              Domantas Sabonis had 11 points, 17 rebounds and 10 assists for the Kings. Sabonis recorded the first Kings triple-double since the 2018-19 season.\n\n\r\n              “Just a fantastic, fantastic, fantastic night by Domas,\" coach Mike Brown said. \"He was huge.”\n\n\r\n              Monk has scored 20 or more points six times this season for Sacramento. The Kings have won three straight after a three-game skid.\n\n\r\n              This is Sacramento’s best 22-game start since the 2004-05 season. The Kings started 15-7 that season. The Kings have won 11 of their last 16 games.\n\n\r\n              “I feel like the last few games we’ve really shown what we can do defensively as a team,\" said De'Aaron Fox, who scored 16 points.\n\n\r\n              LaVine scored 15 points in the third quarter to cut into the Kings' 18-point lead. The Bulls cut it to two points in the fourth quarter.\n\n\r\n              “We have to figure it out one way or another,” LaVine said. “Or we are going to keep being down. That's just the name of the game. We play good when we are behind.\"\n\n\r\n              Harrison Barnes had 17 points, Kevin Huerter added 12 and rookie Keegan Murray finished with 11. All five Kings starters scored in double figures.\n\n\r\n              Nikola Vucevic had 12 points and Patrick Williams finished with 10 for Chicago. Williams started in place of Javonte Green, who didn’t play because of right knee soreness.\n\n\r\n              The Bulls have lost 10 of 14 games.\n\n\r\n              “We had some opportunities, but we didn’t show it well late,” Billy Donovan said. “We have to make the extra pass and move the ball... it's hard playing like that.\"\n\n\r\n              TIP-INS\n\n\r\n              Bulls: DeRozan was given a Flagrant-1 foul in the third quarter. ... LaVine also received a technical foul with 2:32 left.\n\n\r\n              Kings: G Terence Davis was ruled out with low back soreness. ... Fox was given a technical foul with 10:47 left in the fourth. ... Kings have scored over 100 points in every game this season. ... The Kings have won eight of the last 11 matchups against the Bulls.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Washington on Wednesday.\n\n\r\n              Kings: Start a six-game road trip at Milwaukee on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994502.554396
}