{
  "game_id": "0022400979",
  "espn_id": "401705545",
  "date": "Mar 16, 2025",
  "matchup": "ORL @ CLE",
  "headline": "Magic end Cavaliers' winning streak at 16 games as Banchero scores 24 points in 108-103 victory",
  "body": "CLEVELAND -- — Paolo Banchero scored 24 points, Franz Wagner added 22 and the Orlando Magic stunned Cleveland 108-103 on Sunday to end the Cavaliers' winning streak at 16 games.\n\n\r\n              The Cavs lost for the first time since Feb. 4 as the Eastern Conference leaders were unable to put away the Magic in the final minutes. Cleveland missed five shots — three by All-Star Donovan Mitchell — in the final minute.\n\n\r\n              Banchero's 16-foot jumper put the Magic ahead 104-103, and after a badly missed 3-pointer by Cleveland's De'Andre Hunter, Kentavious Caldwell-Pope made two free throws with 31 seconds left to give Orlando a three-point lead.\n\n\r\n              Max Strus missed a potential tying 3-pointer on Cleveland's next possession and Orlando's defense swarmed Mitchell, who misfired on a pair of 3s.\n\n\r\n              Banchero shot just 6 of 22 but added 11 rebounds and seven assists. Wendell Carter Jr. added 16 points and 14 rebounds for Orlando.\n\n\r\n              Mitchell returned after missing two games with a sore groin and finished with 23 points. Jarrett Allen added 20 points and 12 rebounds for the Cavs, who were denied becoming the first team since Phoenix in 2021 to win 17 straight.\n\n\r\n              The NBA-leading Cavs played without All-Star forward Evan Mobley, who has been dealing with a bruised foot.\n\n\r\n              Takeaways\r\n              Magic: Orlando may not resemble the same team that took Cleveland to seven games in last year's playoffs due to season-ending injuries for Mo Wagner and Jalen Suggs. But the Magic showed plenty of grit in handing the Cavs just their second loss in 22 games.\n\n\r\n              Cavaliers: Cleveland's late-game execution hasn't been great and needs to be addressed before the playoffs.\n\n\r\n              Key moment\r\n              Leading by eight late in the third quarter, the Cavs committed three turnovers in 27 seconds. Given new life, the Magic ripped off 10 straight points.\n\n\r\n              Key stat\r\n              Hunter lost for the first time in 14 games with Cleveland since coming over in a deadline trade from Atlanta.\n\n\r\n              Up next\r\n              The Magic host the Rockets on Wednesday. The Cavaliers start a five-game trip against the Clippers on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews",
  "source": "espn_api",
  "crawled_at": 1764997524.7133288
}