{
  "game_id": "0021500002",
  "espn_id": "400827889",
  "date": "Oct 27, 2015",
  "matchup": "CHI vs. CLE",
  "headline": "Pau Gasol stuffs LeBron James' would-be tying layup as Bulls hold off Cavs",
  "body": "CHICAGO -- For all the talk about their fast-paced offense, defense once again lifted the Chicago Bulls in their season opener.\nPau Gasol's block of LeBron James and a pass deflection in the closing seconds helped preserve the win for new coach Fred Hoiberg. And that had to please the president.\nNikola Mirotic scored 19 points and Derrick Rose added 18 to lead the Bulls to a 97-95 victory over the Cleveland Cavaliers with President Barack Obama watching on Tuesday night.\nAfter Gasol blocked James' potential tying layup in the closing seconds, Jimmy Butler then broke up an inbounds pass intended for James as time expired.\n\nObama sat courtside for most of the game as his beloved Bulls got contributions from a variety of players to knock off the defending Eastern Conference champions and give Hoiberg a narrow win in his first game.\n\"That is how we are going to win every game,\" Rose said. \"It kind of feels good going into every game knowing you have the possibility of winning. You have a chance of winning every game because we are so good and deep.\"\nJames scored 25 points and grabbed 10 rebounds, but the Cavaliers came up short against the team they knocked out in the conference semifinals last season.\nThe Bulls, playing a more open offense with Hoiberg than they did under Tom Thibodeau, did not exactly light it up. But they came away with a promising win.\nRose, playing with a mask to protect his fractured left orbital, shot just 8 of 22 after missing almost the entire preseason.\nMirotic, starting over Joakim Noah, nailed three 3-pointers.\nButler added 17 points and two steals to go with that deflected pass. Gasol blocked six shots.\nThe Cavaliers got 19 points and seven assists from Mo Williams, filling in while Kyrie Irving recovers from a fractured left kneecap. Kevin Love added 18 points and eight rebounds.\n\"We gave ourselves a chance to win,\" James said. \"That's all you can ask.\"\nThe Cavaliers took an 83-82 lead on a floater by James with 5:32 left in the game.\nMirotic immediately converted a three-point play after getting fouled by Tristan Thompson on a baseline floater. That started an 11-2 run that put Chicago back on top 93-85 with 2:42 left.\nBut just when it looked like the lead was safe, the Cavaliers came roaring back again.\nLove nailed back-to-back 3-pointers to make it 97-95 with 33 seconds remaining. After a miss by Rose with 10 seconds remaining, a driving James got swatted by Gasol.\nThe ball bounced out along the baseline. The Bulls had no doubt this time that James was getting the final shot.\nThey probably thought the same thing at the end of Game 4 of the conference semifinals in Chicago. In that one, Cavaliers coach David Blatt designed a play that had James taking the ball out. He vetoed it and drained a corner jumper at the buzzer to give Cleveland the victory.\nThings didn't turn out so well this time for the Cavaliers. Butler broke up Williams' inbound pass.\nObama, in his hometown to speak to the International Association of Chief of Police and attend a Democratic fundraiser, had not sat courtside to watch the Bulls since they visited the Washington Wizards in February 2009.\nBut with his favorite team taking on the best player on the planet in a rematch of last season's second round, Obama decided to take in this game.\nSecret Service agents started blanketing the United Center in the morning and all eyes turned toward the tunnel as Obama entered the arena late in the first quarter. He greeted some people at courtside as he made his way to his seat opposite the scorer's table.\n\"I think it's very promising,\" Obama told TNT. \"You've got a new coach, he's opening up the offense a little bit. The question is going to be can they hang on to the defense, with the new offense?\"\nNOAH HURT\nNoah played just 17 minutes and was not available at the end because of a knee problem. \"I tried to put him in, but the trainer would not let me,\" said Hoiberg, who thought Noah's knee was bruised.\nMILESTONE WATCH\nJames now has 24,938 points. Only 19 players have scored 25,000.\nTIP-INS: There was a moment of silence before the game in honor of Flip Saunders. The Minnesota Timberwolves coach and team president died Sunday after battling cancer. ... The Bulls have won five straight season openers at the United Center.\nUP NEXT:\nCavaliers: Visit Memphis on Wednesday.\nBulls: Visit Brooklyn on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993989.3098261
}