{
  "game_id": "0021400165",
  "espn_id": "400578457",
  "date": "Nov 19, 2014",
  "matchup": "DET vs. PHX",
  "headline": "Bledsoe lifts Suns past Pistons, 88-86",
  "body": "AUBURN HILLS, Mich. --  The Phoenix Suns aren't known for winning games with defense.\n\nOn Wednesday night, though, they pulled it off.\n\nThe Suns held Detroit to 37.9-percent shooting, including just 7 for 25 on 3-pointers, to pick up an 88-86 victory over the Pistons.\n\n\"It was an ugly game, especially in the first half, but we'll take it,\" Phoenix coach Jeff Hornacek said. \"We've had some games where we thought we could win them at the end, and this time we almost let one get away, but we just want to win games any way we can.\"\n\nPhoenix appeared to have the game locked up when they led 85-77 with 1:52 to play, but Kentavious Caldwell-Pope and Brandon Jennings combined to hit three straight 3-pointers to give Detroit the lead with 35 seconds left.\n\n\"We hit some big shots and got some big stops in that stretch,\" Pistons coach Stan Van Gundy said. \"Then they got an easy one to win it.\"\n\nOn the first possession after Caldwell-Pope had put Detroit ahead, Eric Bledsoe sliced through the Pistons defense for an easy basket.\n\n\"That felt good,\" said Bledsoe, who led Phoenix with 18 points. \"My coaches and my teammates let me get the ball and make the play. That gives you confidence.\"\n\nPhoenix then knocked away a pass and blocked a shot before Caldwell-Pope missed a desperate 3-pointer on Detroit's final possession and Bledsoe hit a free throw with 1.3 seconds left.\n\n\"You are always going to have frustration when you lose, but games like this are even tougher,\" Greg Monroe said. \"We just needed one more play, out of all the plays tonight.\"\n\nP.J. Tucker added 16 points for the Suns, who have won four of their last six.\n\nBrandon Jennings scored 19 points to lead Detroit, who is already on its third three-game losing streak after just 12 games of the season.\n\nThe game was played on the 10th anniversary of Pacers-Pistons brawl at the Palace of Auburn Hills that was started when Ron Artest went into the crowd after being hit by a thrown beer. The closest thing to a repeat came in the second quarter, when Markieff Morris and Caldwell-Pope exchanged shoves.\n\nPhoenix dictated the tempo in the first half, forcing the Pistons to play outside their comfort zone, but weren't able to take advantage. The Suns outshot Detroit in the half, but couldn't keep them off the boards at either end. Detroit used its nine offensive rebounds to trail just 44-43 at the intermission.\n\nThe Suns frustrated the Pistons in the third quarter -- Monroe and Jennings picked up technicals for arguing the same call -- and led by as many as nine, but couldn't finish them off. Jennings finished with 13 in the quarter, and the Suns still only led by one heading to the fourth.\n\nWith Jennings on the bench, Phoenix moved the lead back to seven before he returned to start Detroit's late rally.\n\nTIP INS\n\nSuns: Phoenix struggled to keep post players in the game, as both Miles Plumlee and Alex Len had five fouls in the fourth quarter, while Markieff Morris had four. ... The Suns have won nine of their last 12 against Detroit, and snapped a three-game losing streak at the Palace.\n\nPistons: Tayshaun Prince, now with Memphis, is the only player who played for the Pistons in the brawl game that is still in the league. He was also the only player on either team who didn't leave the bench during the initial confrontation between Artest and the Pistons' Ben Wallace.\n\nUP NEXT\n\nPhoenix: At Philadelphia on Friday.\n\nDetroit: At Atlanta on Friday.\n\nIN THE PAINT\n\nThe Pistons continued to struggle at one of the game's simplest skills -- scoring in the paint. For the second time this season, Detroit missed 30 inside shots, going 23 for 53 (43 percent). Phoenix, on the other hand, was able to score easily inside, hitting two-thirds of their shots (21 for 32). Detroit averages 48 percent inside this season, one of the worst percentages in the league, while their opponents average 54 percent.",
  "source": "espn_api",
  "crawled_at": 1764993819.2533948
}