{
  "game_id": "0021300665",
  "espn_id": "400489538",
  "date": "Jan 27, 2014",
  "matchup": "MIL vs. LAC",
  "headline": "Blake Griffin, Clippers wrap up road trip with rout of Bucks",
  "body": "MILWAUKEE -- These days, there's no place like this Midwest outpost for NBA teams to end a long road trip on a high note.\nBlake Griffin dominated the paint with 20 points, Jamal Crawford scored 25 and the Clippers ended their nearly two-week journey away from Los Angeles with a 114-86 win Monday night over the Milwaukee Bucks.\nForced to travel more than 11,000 miles through the air during the trip because the Staples Center was occupied by the Grammy Awards, Griffin looked right at home in Milwaukee.\nAfter Griffin capped off a decisive 21-2 run in the second quarter with a three-point play, about the only drama left was to count up how many dunks Lob City's stars would throw down the rest of the night.\n\"When we were flying yesterday, flying here, I remember guys saying they can't wait to get home, stuff like that,\" Griffin said. \"But we knew we still had a game to play, some business to take care of.\"\nLos Angeles finished its trip 5-2, a franchise best for their annual Grammy sojourn. Darren Collison added 15 points and seven assists.\nErsan Ilyasova had 16 points and eight rebounds for the Bucks, an NBA-worst 8-36.\n\"Against a team like the Clippers, you have to be clicking on all cylinders,\" coach Larry Drew said. \"They're playing extremely, extremely well. The low-post game has been really good.\"\nThe 6-foot-10 Griffin alone was a handful in the second quarter. He backed down Ilyasova in the post, and then followed with a steal and breakaway dunk for a 49-36 lead with 3:32 left after Ilyasova mishandled a pass on the other end.\n\"The defense is what gave us those 114 points. There in the second quarter, middle of the second quarter, we got stops,\" Griffin said.\nAt one point in the run, Griffin got into a brief shoving match with Khris Middleton (14 points) in a scramble for a loose ball. Each player was assessed a technical fouls.\nThe fray only seemed to rile up the Clippers' big man, who finished 8 of 13 from the field.\n\"I don't think (Blake) needs the anger to do it. He just does it,\" coach Doc Rivers said. \"He has been our go-to guy down the stretch.\"\nLater, Bucks guard Luke Ridnour lost the ball on a drive into the lane and Los Angeles went on the break. Griffin in transition hit a layup around two defenders and got fouled for the three-point play to cap the big run.\nBy that time it was 57-36 with 1:33 in the second quarter. At least the dedicated fans that stuck around were treated to free hot chocolate on the concourse, a team promotion to fill the arena while arctic cold gripped the region.\nThe Clippers then led by as much as 39, and the lead fell below 20 just once in the second half.\nMilwaukee did play with more energy two nights after Drew closed the locker room and challenged players' lackadaisical style in a 25-point loss to the Hawks.\nThe Bucks just couldn't keep up with the faster and more athletic Clippers. Drew said his team simply missed shots during the decisive run -- including some good looks -- and couldn't answer the opponent's momentum plays.\n\"You just have to stay the course. When things happen, sometimes you have plays that are rather deflating,\" Caron Butler (11 points) said. \"Take the ball out, continue to get out in transition, keep the momentum and try to play our style of basketball.\"\nIlyasova was 6 of 22 from the field, and the Bucks shot just 38 percent on the evening.\nThings looked promising early for Milwaukee, in desperate need of a spark to make something out of this wayward season. Middleton's jumper with 9:58 in the second got the Bucks within 34-32.\nBut as often has been the case this season, a spurt of turnovers and sloppy play spelled big trouble for Milwaukee.\nGame notes\nRivers said guard Chris Paul (separated shoulder) was running and starting to shoot again, but there was otherwise no change in his timetable to return around the All-Star break next month. Asked if he played a role in deciding when Paul was ready, Rivers answered \"I never have anything to do with that. I'm not a real doctor, as you know. I thought you knew that.\" ... Bucks starting center Larry Sanders and veteran guard O.J. Mayo each sat out a second game in a week due to flu-like symptoms.",
  "source": "espn_api",
  "crawled_at": 1764992763.588133
}