{
  "game_id": "0021600232",
  "espn_id": "400899682",
  "date": "Nov 25, 2016",
  "matchup": "MIL vs. TOR",
  "headline": "DeRozan scores 26, Toronto tops Milwaukee 105-99",
  "body": "MILWAUKEE --  When DeMar DeRozan finds his spot, the Milwaukee Bucks learned just how hard he is to stop.\n\nDeRozan scored 26 points, including a contested jumper with 16 seconds left over Tony Snell and Giannis Antetokounmpo, to lead the Toronto Raptors to a 105-99 victory over the Bucks on Friday night.\n\n\"The mid-range, that's his hot spot,\" Snell said. \"It was a tough shot (against) good defense.\"\n\nDeRozan again tormented Milwaukee and Kyle Lowry scored 19 as Toronto hit a season-high 14 3-pointers to continue its dominance against the Bucks. The Raptors have won 11 of the last 12 meetings, and six straight in Milwaukee.\n\n\"I'm not concerned about our offense,\" Raptors coach Dwane Casey said. \"But until we commit to the defensive end, we're kidding ourselves.\"\n\nAntetokounmpo scored 29 points and added 11 assists, while Snell had a season-high 16 points.\n\nBut with the game on the line, Lowry hit from 27 feet out with 1:06 left and DeRozan knocked down a 16-foot jumper over Snell and Antetokounmpo to make it 101-97.\n\n\"We tried to throw different bodies at him, show him different looks, and he made the shot that counted,\" Bucks coach Jason Kidd said.\n\nWhat did DeRozan see with two defenders bearing down?\n\n\"The basket,\" he said.\n\nTIP-INS\n\nRaptors: DeRozan, who has scored 25 points or more in 13 of 16 games, also finished with four assists, the eighth straight game he's had at least four. . . . Toronto also hit six 3-pointers in the first quarter.\n\nBucks: Milwaukee recalled guard Rashad Vaughn from the NBA Development League, but did not play. \"The D-League didn't have practice for three days, so we had to bring him back,\" Kidd said. \"It was not a vacation.\" . . . It was the first of four `Fear the Deer' games this season, featuring black jerseys and an alternate court design. . . . Milwaukee's last lead came at 29-27 in the second quarter.\n\nTHREE-POINT PROWESS\n\nTwo nights after the Raptors made 12 3-pointers in a win at Houston, they went 14 of 31 from behind the arc against the Bucks, who came in with the No. 1 defensive 3-point percentage in the league at 30.6 percent.\n\n\"We aren't forcing anything,\" DeRozan said. \"We have guys who can penetrate and kick, and guys who can make wide open shots.\"\n\nGREAT TRIP\n\nThe Raptors completed their longest road trip with a 3-2 record, also including wins at Houston and Denver.\n\n\"We need to get all the wins we can on a road trip,\" said Terrence Ross, who finished with eight points. \"It is going to feel good to be back in front of the home crowd, getting to sleep in our own beds.\"\n\nMONROE SIGHTING\n\nRarely seen Bucks big man Greg Monroe, who signed a $50 million, three-year max deal in 2015, scored eight points and adding 10 rebounds in 19 minutes of play.\n\nHe had received just 20 minutes in the previous four games combined, scoring just eight total points and grabbing eight rebounds.\n\nUP NEXT\n\nRaptors: Host Philadelphia on Monday to start a season-high stretch of six home games in 11 days.\n\nBucks: At Orlando on Sunday following Tuesday's 93-89 victory against the Magic, when Antetokounmpo notched his first triple-double of the season.",
  "source": "espn_api",
  "crawled_at": 1764995216.5124512
}