{
  "game_id": "0021701134",
  "espn_id": "400975880",
  "date": "Mar 30, 2018",
  "matchup": "DAL vs. MIN",
  "headline": "Towns, Crawford help Wolves edge Mavs 93-92",
  "body": "DALLAS --  Karl-Anthony Towns was ready to set the pick to free Jamal Crawford for the game-clinching shot.\n\nCrawford waved him off and made the shot anyway.\n\nTowns had 21 points and 20 rebounds, Crawford scored 24 points and the Minnesota Timberwolves held off the Dallas Mavericks 93-92 on Friday night to gain ground in the tight Western Conference playoff race.\n\nCrawford scored 13 in the fourth quarter, none bigger than his 17-footer with 9.6 seconds left to put his team up by four.\n\n\"That was a cold-blooded shot,\" Towns said. \"That was one of the coldest shots I've ever seen. There was more than adequate time to set a pick, but when you're in a zone like that . it was his gym tonight.\"\n\nAfter Minnesota shot just 34 percent in the first half and trailed until midway through the third quarter, Crawford hit three consecutive shots, including a 3, over a 1:14 stretch of the fourth quarter to give Minnesota a 74-68 lead. Nemanja Bjelica, scoreless for the first three quarters, hit two 3s to extend it to 85-73.\n\nThe Mavericks got within 91-89 on the second of consecutive layups by Dennis Smith Jr. off a steal with 28.3 seconds to play, before Crawford posted up the smaller Yogi Ferrell and drained his jumper.\n\n\"(Coach Tom Thibodeau) and those guys put me in great situations,\" Crawford said. \"I had the easy part, just making shots.\"\n\nFerrell hit a 3 with 1.3 seconds left, but the Mavericks were not over the limit in fouls and could not foul the Wolves twice in the remaining time.\n\nHarrison Barnes had 19 points, and Smith had 17 for Dallas, which is using its remaining games to build lineups around its two young stars.\n\n\"I feel like the more I learn to play with H that would be better for the future, so we're trying to build that chemistry as soon as possible,\" Smith said.\n\nMinnesota entered the night in seventh place in the bunched-up Western Conference but moved into fifth with losses by Oklahoma City and New Orleans. Just three games separated fourth place from 10th in the West.\n\nAfter trailing by as many as nine in the first half, the Wolves scored five points in the final 2.3 seconds of the half to get within 46-44 at the break. Crawford hit a 3-pointer off Towns' offensive rebound, and then Towns scored just before the buzzer after Dallas' Maxi Kleber inbounded the ball right to him.\n\n\"We made some hustle plays at the end of the half,\" Thibodeau said. \"A hustle play can trigger a run, and I thought that gave us good life coming out (after halftime).\"\n\nBUTLER CLEARED FOR CONTACT\n\nWolves guard Jimmy Butler made the trip to Dallas and has been cleared for contact drills, using a brace on his right knee.\n\n\"He had a good workout, did the shoot-around and stayed and played after,\" Thibodeau said. \"He's been diligent with the rehab, going twice a day. He went through the non-contact great, didn't have any problems. This was the next step.\"\n\nThibodeau didn't put a timeline on Butler's return. Butler had meniscus surgery on Feb. 25, and Minnesota is now 8-7 in the games he has missed.\n\nWhile Butler did not talk to reporters, he stood by Crawford's side in the locker room and commented on some of his teammate's statements.\n\nOne example: When Crawford praised Butler for being a virtual coach on the sidelines as he recovers from his injury, Butler chimed in: \"Jimmy gets on my nerves all the time.\"\n\nTIP-INS\n\nTimberwolves: Wolves assistant coach Rick Brunson will stay in Texas to watch his son Jalen lead Villanova in the NCAA national semifinals against Kansas on Saturday in San Antonio. ... The Wolves swept the season series from the Mavs, 4-0. ... The Wolves play seventh-place Utah on Sunday and play 10th-place Denver twice over their final five games.\n\nMavericks: Nowitzki set an NBA record by playing in his 75th game this season, the most by a player in his 20th season in the league. ... G J.J. Barea sat out for personal reasons.\n\nUP NEXT\n\nTimberwolves: Host Utah on Sunday.\n\nMavericks: At Cleveland on Sunday. Dallas plays four of its final six on the road.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993936.188104
}