{
  "game_id": "0021600104",
  "espn_id": "400899554",
  "date": "Nov 08, 2016",
  "matchup": "LAL vs. DAL",
  "headline": "Mavericks hold off Lakers 109-97 without Dirk, Deron",
  "body": "LOS ANGELES --  After four seasons in the Golden State Warriors' supporting cast, Harrison Barnes is seizing his opportunity to be the main man in Dallas.\n\nBarnes scored 31 points, Seth Curry added 23 and the Mavericks won their second straight game after an 0-5 start, 109-97 over the Los Angeles Lakers on Tuesday night.\n\nTwo days after Barnes scored a career-best 34 in the Mavs' victory over Milwaukee, he hit 11 of 18 shots at Staples Center while leading Dallas past the Lakers for the 11th consecutive time since April 2, 2013. Barnes scored seven consecutive points after Los Angeles took a lead with 7 1/2 minutes to play, and his teammates finished it off.\n\n\"I'm just being aggressive,\" Barnes said. \"That was the biggest thing in my first few games (with the Mavs), figuring out when to be aggressive and when not to. You just kind of have to leave the switch on, and if you fail, fail aggressively.\"\n\nIt's working: Barnes has scored 30 points three times in Dallas' last six games after hitting that mark once in his first four seasons with Golden State.\n\nAfter getting their first win of the season Sunday against Milwaukee, the Mavs won again without injured Dirk Nowitzki and Deron Williams. Nowitzki missed his second straight game with a sore Achilles tendon, while Williams missed his second straight game with a strained calf muscle.\n\nDallas used only eight players in LA, but it was enough.\n\n\"This is two team efforts, just scrappy and grinding,\" Barnes said. \"Everyone is getting in the mix offensively and defensively. It's not always pretty basketball, but we're getting it done, and that's the most rewarding thing about it.\"\n\nJJ Barea had 18 points, seven rebounds and eight assists for the Mavericks, who beat the Lakers on the road for the sixth straight time.\n\n\"Our guys stuck to a game plan of tempo and patience and discipline, and they won the game,\" Dallas coach Rick Carlisle said.\n\nTIP-INS\n\nMavericks: Carlisle shared a quick pregame moment with Lakers F Metta World Peace, who played for Carlisle in Indiana a decade ago. Carlisle, who still calls him Ron, said World Peace has reached out to him to ask questions about coaching. ... Mavs rookie Dorian Finney-Smith had five points in his first NBA start.\n\nLakers: Luke Walton coached Barnes and Curry as an assistant with Golden State. ... Luol Deng scored two points in 30 minutes, going 1 for 5. ... Julius Randle had 15 points and 10 rebounds, but also committed six turnovers.\n\nLAKERS LOSS\n\nJordan Clarkson scored 22 points and Nick Young had 20 as the Lakers' three-game winning streak ended with 17 turnovers and some late-game struggles. Lou Williams scored 15 points for Los Angeles, which rallied from an 11-point deficit in the second half before failing to execute in the final minutes.\n\n\"I thought we did a little better job in the second half fighting,\" Walton said. \"I thought we were a little soft in the first half. We had our chances.\"\n\nYoung scored 13 points in the first 3:15, staking the Lakers to an early lead. Dallas scored the final 11 points of the half to move ahead 58-54.\n\nHEADING BACK\n\nBarnes had his latest monster game one night before he returned to Oakland to take on the Golden State Warriors for the first time since leaving as a free agent during the summer. Barnes was a key player on the Warriors' 2015 championship team and last season's runner-up, but left after the Warriors renounced his rights when they landed Kevin Durant.\n\nWhen asked if the homecoming was anything special, Barnes said: \"Nah. ... It's another game. We're 2-5, so it's another game. Trying to 3-5 and go back home.\"\n\nSHORT-LIVED\n\nThe Lakers (4-4) had moved above .500 for just the second time since Dec. 6, 2013, with a victory over Phoenix on Sunday. Los Angeles also hadn't won three straight games since the 2012-13 season, but couldn't make it four.\n\nUP NEXT\n\nMavericks: At Golden State on Wednesday.\n\nLakers: At Sacramento on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764995447.8082151
}