{
  "game_id": "0022100904",
  "espn_id": "401360723",
  "date": "Feb 25, 2022",
  "matchup": "LAC @ LAL",
  "headline": "Clippers edge Lakers 105-102 for 6th straight rivalry win",
  "body": "LOS ANGELES -- — Terance Mann had 19 points and 10 rebounds, Amir Coffey added 12 of his 14 in the fourth quarter and the Los Angeles Clippers returned from the All-Star break with a 105-102 victory over the Los Angeles Lakers on Friday night.\n\n\r\n              Luke Kennard scored 18 points as the Clippers earned their sixth consecutive victory over the Lakers in the latest meeting between Los Angeles’ two underachieving, injury-plagued NBA franchises while they begin the next push to salvage their seasons.\n\n\r\n              The Clippers also moved one game ahead of the Lakers in the loss column while clinching the season series victory in this local derby. Both advantages could be important at playoff time for two teams that appear headed for the play-in tournament if they make the postseason at all.\n\n\r\n              “When we got down five or six, we just kept our composure, kept our poise and kept playing,” Clippers coach Tyronn Lue said. “In that third quarter, I thought we let the game get away from us, but to keep our composure and come back and get a win, I thought it was big for us.”\n\n\r\n              Carmelo Anthony missed a long go-ahead jumper with 4 seconds to play and LeBron James missed a tying 3-point attempt at the buzzer for the Lakers, who fell five games under .500 with their fourth loss in five games.\n\n\r\n              James had 21 points and 11 rebounds while Anthony and Russell Westbrook scored 18 points apiece for the Lakers, who trailed by 16 points late in the first half before nursing a small lead for most of the fourth quarter. Anthony hit four 3-pointers in his first game since Feb. 3 after missing three weeks with a strained hamstring.\n\n\r\n              After Coffey’s free throws put the Clips ahead with 1:05 to play, the Lakers went back ahead on Austin Reaves’ two free throws, but Marcus Morris drilled a jumper under tight defense. After two lengthy replay reviews, the Clippers committed an 8-second violation with 17.8 seconds left, but Anthony missed a 3-pointer from well behind the line with 4 seconds to play.\n\n\r\n              The first review left Lakers coach Frank Vogel steamed by the decision that James had been out of bounds on the baseline. Lue and the Clippers emphatically thought the review was correct.\n\n\r\n              “I couldn't disagree more strongly with the ruling,” Vogel said. “It's wrong. It should have been our ball in that situation.”\n\n\r\n              Reggie Jackson hit two free throws, and James couldn't tie it with his final heave. Jackson scored 17 points for the Clippers, who won three of four going into the break despite being without likely their three best players: Kawhi Leonard, Paul George and newly acquired Norman Powell.\n\n\r\n              “We’re going to do everything we can to keep it going and put it on their shoulders when they get back,” Jackson said. “The thing about this team is, we understand the light is at the end of the tunnel and they’re going to be back at some point.”\n\n\r\n              Talen Horton-Tucker scored all 16 of his points in the second half, while Dwight Howard had season-highs of 14 points and 16 rebounds as the Lakers began yet another stretch without Anthony Davis, who sprained his right foot in their final game before the break nine days ago. Davis will be out for at least another month after missing 21 of the Lakers’ first 58 games with other woes.\n\n\r\n              The Lakers were down 49-33 with three minutes left in the first half, but they rallied to take a 72-70 lead on Horton-Tucker's 3-pointer with two minutes left in the third quarter.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: The city rivals’ season series concludes Wednesday night with a “home” game. ... Seven players in the nine-man rotation scored in double figures.\n\n\r\n              Lakers: Reaves scored six points in his first career start. The undrafted rookie out of Oklahoma also catalyzed the Lakers' biggest surge when he dramatically blocked Jackson's shot in the third quarter. ... They missed their first 10 3-point attempts, all in the first quarter.\n\n\r\n              HE LOVES LA\n\n\r\n              James' All-Star weekend heroics were overshadowed by various comments perceived as suggestions of discontent with the Lakers' front office. James and his agent, Rich Paul, both strived to curb those narratives Friday, with James reaffirming his commitment to the Lakers and their championship aspirations both this season and beyond.\n\n\r\n              “I don't understand how some of my comments over the weekend was taken to a whole different area,” James said, later adding: “I see myself being in the purple and gold as long as I can play.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Houston on Sunday night.\n\n\r\n              Lakers: Host New Orleans on Sunday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993580.855337
}