{
  "game_id": "0022000936",
  "espn_id": "401307739",
  "date": "Apr 28, 2021",
  "matchup": "CHA @ BOS",
  "headline": "Celtics rebound behind Brown, Tatum, beat Hornets 120-111",
  "body": "BOSTON -- — Jaylen Brown scored 38 points, Jayson Tatum added 35, and the Boston Celtics rebounded from an embarrassing loss a night earlier with a 120-111 victory over the Charlotte Hornets on Wednesday night. \n\n\r\n                    Brown has reached 30 points in three of his last five games. \n\n\r\n                    “They came in and made it hard for us to be beat tonight,” Boston coach Brad Stevens said of his two stars.\n\n\r\n                    The Celtics remained tied with Miami for sixth in the Eastern Conference. The top six teams avoid a seven-through-10 play-in for the playoffs. Boston plays the Heat at home on May 9 and 11. The Celtics won the only meeting this season.\n\n\r\n                    “That’s what it’s all about,” Brown said. “Turning it up a notch, hitting the next level. The season’s on the line. I feel like every leader wants to do that.”\n\n\r\n                    Tristan Thompson chipped in with 12 points and 13 rebounds for Boston, which had lost four of its last five following a six-game winning streak.\n\n\r\n                    Devonte’ Graham led Charlotte with 25 points, and P.J. Washington and Miles Bridges each had 19.\n\n\r\n                    “You have to give them credit,” Graham said. “Jaylen and Jayson came out hot and they were pretty much comfortable getting anything they want.”\n\n\r\n                    Hornets’ leading scorer Terry Rozier was held to 15 points on 4-for-18 shooting, collecting nine in the final quarter. He entered averaging 20.4 points.\n\n\r\n                    “Just being human and being a basketball player, you're going to have slumps when your shot doesn't fall,” said Rozier, who hit only 4 of 17 against Milwaukee in a loss at home on Tuesday.\n\n\r\n                    Celtics guard Marcus Smart missed the game after being suspended by the league for a game following “threatening language” he directed at a referee Tuesday night.\n\n\r\n                    Coming off a 39-point effort in Boston’s loss that halted the Oklahoma City Thunder’s franchise-record tying, 14-game losing streak on Tuesday, Brown hit a 3 at the buzzer, capping his 20-point opening quarter that carried the Celtics to a 39-19 lead after one.\n\n\r\n                    The Hornets blew out Boston, 125-104, in the teams’ last meeting Sunday in Charlotte.\n\n\r\n                    The Hornets nearly erased all of a 20-point, first-half deficit, slicing it to 99-96 on Rozier’s 3-pointer with 7:23 to play. Brown and Aaron Nesmith each hit a 3-pointer during a 9-2 run that gave Boston a comfortable lead.\n\n\r\n                    “I thought we responded well,” Hornets coach James Borrego said. “Poor first quarter. Give them credit. They made shots.\"\n\n\r\n                    The NBA did not provide many specifics in a news release about Smart, beyond saying the incidents with him occurred “during and after the Celtics’ 119-115 loss to the Oklahoma City Thunder.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: G LaMelo Ball (right wrist), G Malik Munk (sprained right ankle) and F Gordon Hayward (sprained right foot) were all out. Ball and Monk could be cleared to play soon. Ball last played on March 20, when he broke his wrist in a game at the Clippers and Monk sprained his ankle April 1. … Former Celtic Rozier got a nice hand during pregame introductions.\n\n\r\n                    Celtics: G Kemba Walker (left oblique strain) missed his second straight game, but Robert Williams III (left knee soreness) returned after being sidelined the previous seven. … Brown banked in his first basket of the game — a 3-pointer from the top. … G Payton Pritchard had to leave the game with a bloody nose early in the fourth quarter.\n\n\r\n                    DADDY’S HERE\n\n\r\n                    Tatum trotted across the court and gave his 3-year-old son Deuce, seated in the front row across from Boston’s bench, a kiss after the star forward was announced in pregame introductions.\n\n\r\n                    OWNERS TOGETHER\n\n\r\n                    Patriots owner Robert Kraft was seated midcourt alongside Celtics owner Wyc Grousbeck. Kraft pulled down his mask and mouthed “Let’s Go’’ when he was shown on the Jumbotron. Fans at the TD Garden are required to wear masks, except while actively eating or drinking.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host the Pistons on Saturday night.\n\n\r\n                    Celtics: Host the Spurs on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997341.860312
}