{
  "game_id": "0022300338",
  "espn_id": "401584966",
  "date": "Dec 16, 2023",
  "matchup": "IND @ MIN",
  "headline": "Towns scores 40 and Edwards has 37 as Timberwolves top short-handed Pacers 127-109",
  "body": "MINNEAPOLIS -- — Karl-Anthony Towns scored a season-high 40 points and grabbed 12 rebounds, Anthony Edwards added 37 points and the Minnesota Timberwolves pulled away in the second half to dominate the short-handed Indiana Pacers 127-109 on Saturday night.\n\n\r\n              Naz Reid added 17 points and Kyle Anderson had 10 assists for Minnesota, now 11-1 at home and tied with Boston for the league’s best record at 19-5.\n\n\r\n              Towns had his highest scoring total since a career-best 60 points March 14, 2022. Edwards finished one point shy of his season high. The pair combined for 54 of the Wolves’ first 75 points: 27 apiece.\n\n\r\n              “He’s been like that since I’ve been here,” Edwards said of Towns. “He’s always been efficient, gets us points. Tries to do everything he can to help us win. He’s always been like that. It’s not impressive to me, I’m used to seeing it. That’s KAT.”\n\n\r\n              Minnesota shot a season-high 55.8% from the field, including a season-best 60% with a season-high 18 makes from outside the arc.\n\n\r\n              “This is one of the best teams on the planet,” said Indiana coach Rick Carlisle. “… It’s a good experience to battle these guys. Our young guys got some great experience tonight.”\n\n\r\n              Bruce Brown and Aaron Nesmith scored 17 points for the Pacers. Miles Turner, T.J. McConnell and Isaiah Jackson also scored in double figures as Indiana shot 50% but lost three in a row for the first time this season.\n\n\r\n              Playing its third road game in four nights and fourth in six, Indiana was without top scorer Tyrese Haliburton, who sustained a bruised left knee Friday in a 137-123 loss at Washington. Additionally, the Pacers did not arrive in Minnesota until Saturday afternoon after aircraft mechanical issues forced them to stay in Washington on Friday night.\n\n\r\n              “No excuses,” Brown said. “I’m just happy to go home.”\n\n\r\n              The team’s leading scorer at 25.7 points per game and league leader in assists with 12 per game, Haliburton is shooting 51.5% from the field and 43.5% from 3-point range. Carlisle did not provide a timetable on how long Haliburton would be out.\n\n\r\n              Towns had 20 points midway through the second quarter, but the balanced Indiana attack had the Pacers up by six before Edwards took over.\n\n\r\n              He scored 14 of his 18 second-quarter points in the final four minutes, including a quartet of 3s and a reverse layup in the final seconds for a 57-55 intermission lead.\n\n\r\n              Edwards had just nine points on 3-for-19 shooting and 0-for-3 from deep in Thursday’s 119-101 win at Dallas.\n\n\r\n              Two 3-pointers apiece by Reid and Troy Brown Jr. sandwiched around Rudy Gobert’s block of Nesmith’s layup attempt highlighted a 12-4 surge to put Minnesota up 87-71 midway through the third quarter. A three-point play by Towns in the quarter’s final minute pushed the lead to 19.\n\n\r\n              Minnesota outscored Indiana 39-23 in the 12 minutes. The Timberwolves entered the game allowing a league-low 105.7 points.\n\n\r\n              “Our defense did a good job getting us into this game tonight. Offensively, it’s great to hit some shots, but being able to fall back on our identity and our standards defensively found our way to the win,” Towns said. \n\n\r\n              Minnesota starting forward Jaden McDaniels left the game with a bruised tailbone.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Home against the Los Angeles Clippers on Monday.\n\n\r\n              Timberwolves: At Miami on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996202.284529
}