{
  "game_id": "0021500528",
  "espn_id": "400828415",
  "date": "Jan 06, 2016",
  "matchup": "DET @ BOS",
  "headline": "Reggie Jackson's 24 points lead Pistons past Celtics, 99-94",
  "body": "BOSTON -- Reggie Jackson's sparkling play in the fourth quarter carried the Detroit Pistons to their latest strong finish.\nThe 6-foot-3 point guard, who shined for three seasons at Boston College before turning pro in 2011, scored nine of his 24 points in the final period and Detroit rallied for a 99-94 win over the Boston Celtics on Wednesday night.\n\"We've had a lot of these type of games this year,\" Pistons coach Stan Van Gundy said. \"The problem with it is, as I just said to them, is we've done this so many times, I think we're starting to fall into, `We don't need to play until the fourth quarter,' and that can be dangerous because these games can start to turn on you.\"\n\nKentavious Caldwell-Pope finished with 20 points for the Pistons. Andre Drummond was in early foul trouble and had an off night, scoring 13 and grabbing a season-low five rebounds. Detroit has won three of four.\n\"It was a tough, hard-fought win,\" Jackson said. \"We didn't really come out and defend the way we wanted to at the beginning, had some shots not go in. After that first quarter, we really felt like we locked in. The second unit did a great job of picking us up.\"\nIsaiah Thomas led the Celtics with 22 points, scoring their final 15 over the last 7:24 after missing 14 of his first 15 shots. Evan Turner scored 17, and Amir Johnson and Jae Crowder each had 16.\nThe Celtics have lost three of four, and Johnson knows how important losses are in the log-jammed Eastern Conference.\n\"Big time,\" he said. \"We definitely realize where we are. We have to try to get some of these games before the break.\"\nThomas scored seven straight to erase a four-point Pistons lead. His spinning drive in the lane put Boston ahead 89-88, but Jackson nailed a 3-pointer from the left wing on the ensuing possession.\nJackson hit two free throws before Thomas' basket in the lane cut it to 93-91 with 1:43 left.\nAfter Thomas made one of two free throws, Stanley Johnson hit a 3.\nThomas made two of three free throws, but Aron Baynes sank a pair from the line to give the Pistons a comfortable lead in the closing seconds.\nJackson's one-handed flip gave Detroit its first lead, 83-82, with 6:01 to play. Anthony Tolliver hit a 3-pointer and Jackson followed with a fallaway, pushing it to 88-82 with 4:08 left.\n\"We didn't bring it in the second half,\" Crowder said.\nThe Pistons trailed by nine entering the fourth, but opened by scoring 13 of the initial 17 points, tying it on Drummond's spinning power drive.\nBoston led 55-48 at halftime and pushed it to 13 midway through the third before ending the quarter with a 75-66 edge despite shooting just 22.7 percent (5 for 22) in the period.\nComing off a season-high 26-point win at home against Orlando on Monday, Detroit looked sluggish in the first half -- mainly because of Drummond's early foul trouble.\nDrummond picked up his third foul early in the second and had just two points and two rebounds in the opening half. Coming into the game, the 6-foot-10 center had an NBA-leading 30 double-doubles.\nTIP-INS\nPistons: Van Gundy had an interesting assessment of Drummond's game. \"What Andre needs to develop more than anything is a real consistent approach to the game where he brings great energy and intensity to the game every night,\" he said. \"When he does that then he's going to impact the game in a big way no matter what else happens.\"\nCeltics: G Avery Bradley missed his second straight with a hip pointer. \"The hope is he'll be able to give it a go on Sunday,\" coach Brad Stevens said. \"He's improving, but he still hasn't run yet. That'll be the next hurdle to get.\"\nTROUBLE AT HOME\nThe Celtics fell to 9-10 at home. They're 10-6 away from TD Garden.\n\"It's kind of been the story of this team -- win on the road and come up short at home,\" Johnson said.\nTROUBLE AT THE LINE\nDrummond went 1 of 5 on free throws, dropping him to 36.2 percent this season.\n\"He can go in the gym every day and shoot 70 percent-plus, but right now it doesn't translate into the game,\" Van Gundy said.\nUP NEXT\nPistons: Host Brooklyn on Saturday.\nCeltics: At Chicago on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994927.660021
}