{
  "game_id": "0022001013",
  "espn_id": "401307821",
  "date": "May 08, 2021",
  "matchup": "DET @ PHI",
  "headline": "Embiid scores 29, 76ers beat Pistons for 8th straight win",
  "body": "PHILADELPHIA -- — Joel Embiid scored 29 points, Tyrese Maxey added 22 and the Philadelphia 76ers won their eighth straight game, 118-104 over the Detroit Pistons on Saturday night.\n\n\r\n                    Embiid again put up the kind of numbers that have him in the thick of MVP consideration — he entered the game third in the NBA in scoring at 29.2 points per game and 10th in rebounding with 10.8 boards per game. The number that may matter most to voters, though, could be games played: 49 out of 68, possibly not enough compared to other candidates.\n\n\r\n                    “I think it would be a feel-good thing for the entire locker room,” coach Doc Rivers said. “It would mean that we not only have the MVP, but we have players, we have a good team and we’re being a successful group.”\n\n\r\n                    The Sixers moved closer to clinching the top spot in the Eastern Conference and securing home court in the East playoffs. Tobias Harris added 18 points for Philadelphia, which played without All-Star Ben Simmons (back) and starting guard Seth Curry (hip) and easily held off the last-place Pistons.\n\n\r\n                    It's all good with Embiid in the lineup.\n\n\r\n                    Embiid hit a 3 for a 69-52 lead in the third quarter, which gave him 23 points. At that point, Pistons backup big man Jahlil Okafor had scored only four points. It’s impossible for a Sixers fan to watch a game featuring the two one-time lottery picks and not think about how the Process — the Sixers' often-dissected rebuild — could have gone off the rails had Embiid not blossomed into an All-Star.\n\n\r\n                    “He has all the tricks,\" Pistons coach Dwane Casey said.\n\n\r\n                    Embiid was the No. 3 pick of the 2014 draft and missed the entire season with a broken right foot. Hedging their bets in case Embiid couldn’t get healthy, former executive Sam Hinkie drafted Okafor out of Duke with the third pick of the 2015 draft. Embiid missed a second straight season with injuries, and Okafor averaged 17.5 points in a rookie season that included a string of off-court headaches. The following season, Okafor never really meshed with Embiid, piled up games in which he didn't play and was traded in December 2017. Okafor is already on his fourth team and a backup to Mason Plumlee.\n\n\r\n                    Embiid, meanwhile, is the face of Philly sports and hears “MVP!” chants on a nightly basis.\n\n\r\n                    “I think it would be an achievement for everybody,” Rivers said of the award.\n\n\r\n                    The Sixers gave Embiid plenty of help against a Pistons team that dropped to 7-29 on the road. Matisse Thybulle had three steals in the first half and Maxey went coast-to-coast on a dunk in the fourth, making the most of their starts for Simmons and Curry. They provide the depth the Sixers need if they want to make a serious run in the playoffs.\n\n\r\n                    “We will not blink at playing 11 guys if we need to,\" Rivers said. \"We are that deep. We are that talented.”\n\n\r\n                    Casey said Rivers has put his stamp on the Sixers and made them contenders.\n\n\r\n                    “Doc has done a good job throughout his career as far as establishing a defensive identity,” he said. “He’s got a lot of good pieces to work with and implement his system in.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Saddiq Bey and Jerami Grant each scored 14 points. Plumlee scored 12.\n\n\r\n                    76ers: Dwight Howard moved into 11th on the NBA’s career rebounds list. He had 19 points and 14 rebounds and leads NBA reserves this season with 11 double-doubles. He hit a 3 to close the third and give the Sixers an 89-72 lead. ... The Sixers are on their longest winning streak since they closed the 2017-18 season with 16 straight victories. ... Raised more than $500,000 for their youth foundation with a team sneaker auction.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host Chicago on Sunday.\n\n\r\n                    76ers: Play Tuesday at Indiana.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997900.1579242
}