{
  "game_id": "0022000365",
  "espn_id": "401267525",
  "date": "Feb 07, 2021",
  "matchup": "PHX vs. BOS",
  "headline": "Suns hang on for 100-91 victory over the Celtics",
  "body": "PHOENIX -- — Suns coach Monty Williams isn't usually demonstrative on the sideline so when he angrily called a timeout in the middle of the fourth quarter and visibly chided forward Deandre Ayton, it was a bit of a surprise.\n\n\r\n                    Ayton didn't look thrilled by the outburst. But there was no doubt the message had been sent.\n\n\r\n                    “He didn’t like me getting on him,” Williams said. “But he took it the right way.”\n\n\r\n                    Ayton responded with a few buckets and a blocked shot down the stretch, Devin Booker added 18 points and 11 assists and Phoenix stayed on a roll by beating the Boston Celtics 100-91 on Sunday.\n\n\r\n                    Mikal Bridges led a balanced Suns offense with 19 points. Cam Johnson added 17 points off the bench while Ayton finished with 16 points and 11 rebounds. Phoenix improved to 13-9 this season and has won five of its past six games. \n\n\r\n                    “Guys are just playing hard, it’s a good recipe,” Johnson said.\n\n\r\n                    Williams made it clear after the game that Ayton has “unreal talent” and he wasn't calling him out. He's just trying to get the former No. 1 overall pick to play to his full potential the entire game. Ayton had a stretch early in the fourth when he had the ball knocked out of his hands a few times, couldn't finish shots at the rim and was out of position on defense.\n\n\r\n                    The wake-up call from Williams during the timeout ended those problems in a hurry.\n\n\r\n                    “It’s a great sign of growth and he doesn’t get enough credit for that,” Williams said. \n\n\r\n                    Phoenix built a 17-point lead midway through the third quarter, but Boston rallied to cut the deficit to 76-68 entering the fourth. Backup guard Payton Pritchard gave the Celtics a lift with two 3-pointers during the run.\n\n\r\n                    Boston stayed fairly close for most of the game despite a rough shooting performance. Kemba Walker shot just 4 of 20 from the field but hit a 3-pointer with about 2:30 left that pulled the Celtics to within 91-86.\n\n\r\n                    Pritchard added a long 3-pointer with about a minute left that brought Boston to within 94-91, but Booker quickly responded with a contested 15-foot jumper and the Suns were able to hang on for the win.\n\n\r\n                    “Tonight wasn't our night shooting the ball,” Celtics coach Brad Stevens said. “I told the team just now that I am more encouraged than discouraged because you are going to have days like this. That could have been easily worse the way we shot the ball.”\n\n\r\n                    Jayson Tatum led Boston with 23 points and seven assists. Walker added 14 while Pritchard and Daniel Theis had 12.\n\n\r\n                    “We've got to make it easier for guys and Kemba to get some easy ones instead of relying on jump shots,” Theis said.\n\n\r\n                    The Suns jumped out to a 27-19 lead in the first quarter after the Celtics shot just 7 of 26 (27%) from the field. Boston tied the game late in the second, but Booker hit a 3-pointer with 0.8 seconds left to give Phoenix a 52-49 halftime advantage.\n\n\r\n                    Booker led the Suns with 13 points before the break while Bridges had 12. Tatum led the Celtics with 12.\n\n\r\n                    HELLO FANS\n\n\r\n                    For the first time this season, the Suns hosted a small crowd at newly renovated Phoenix Suns Arena.\n\n\r\n                    Free tickets were given to health care workers, who were grouped in pods of two to four seats throughout the arena. The crowd was limited to 1,500 fans, and masks were required.\n\n\r\n                    Johnson came to half-court before the game and thanked the health care workers for their work during the COVID-19 pandemic.\n\n\r\n                    “It was awesome,” Williams said. “To come out there and see people in the stands and not cardboard imitations of people, it’s new for us.”\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Boston was playing without forward Jaylen Brown (knee soreness) and guard Marcus Smart (calf). ... Tatum and Walker both got technical fouls in the third quarter for arguing with referees. \n\n\r\n                    Suns: Phoenix was without several players, including forwards Abdel Nader (ankle), Jae Crowder (foot) and Dario Saric (ankle) and guard Cameron Payne (foot).\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Play the final game of their five-game road trip against Utah on Tuesday.\n\n\r\n                    Suns: Continue their seven-game homestand by hosting the Cavaliers on Monday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997755.5285041
}