{
  "game_id": "0021800274",
  "espn_id": "401070955",
  "date": "Nov 23, 2018",
  "matchup": "CHA @ OKC",
  "headline": "Westbrook scores 30 as Thunder hold off Hornets",
  "body": "OKLAHOMA CITY --  When Oklahoma City needed a defensive stop, the Thunder -- led by Russell Westbrook -- came up with two of them.\n\nWestbrook had 30 points, 12 rebounds -- including two in the 11.2 seconds -- and eight assists and the Thunder held off a late rally by Charlotte to win 109-104 on Friday night, completing a regular-season sweep of the Hornets.\n\nDennis Schroder, who was paired with Westbrook in the starting lineup for the first time this season, scored 23 points and Paul George added 17 points, seven rebounds and six assists for Oklahoma City, which has won 12 of its last 14 games after an 0-4 start.\n\n\"Russell Westbrook did a great job putting pressure on the rim, getting fouls and heading to the free-throw line,\" Schroder said. \"I think on the defensive end, even if we didn't score, we locked up and got some stops. I think that was the key. . We missed shots down the stretch, but we always got some stops on the defensive end. That's what we try to focus on, to be a defense-first team.\"\n\nKemba Walker had 25 points and eight assists for Charlotte, but the NBA's leader in made 3-pointers went 2 of 10 from behind the arc. With the Hornets down 105-104, he drove and passed to Marvin Williams, who missed a 3-point jumper from the corner. Westbrook rebounded and hit two free throws with 11.2 seconds left.\n\nWalker \"made the right play,\" Charlotte coach James Borrego said. \"We had a great look to take the lead by two. We trust Marvin to shoot that shot. We got the look we wanted. I thought we executed it very well.\"\n\nWalker missed a 3-pointer from the right wing with 2.4 seconds left and Westbrook again rebounded and hit two free throws to seal the win for the Thunder.\n\n\"I thought we had some really good looks,\" Borrego said. \"Our last two threes were great looks for us. We had a wide-open one to take the lead and had another one to tie the game. We will continue to trust our guys, trust the three ball and move on.\"\n\nCharlotte rallied from a 13-point third-quarter deficit to close within 93-92 on a put-back by Jeremy Lamb with 5:38 left and was within 97-95 after Walker hit a 3-pointer with 3:49 left. Westbrook answered with a three-point play and Oklahoma City pushed its lead to six points before Williams hit a 3-pointer with 37.1 seconds left to pull Charlotte within 105-104.\n\nWestbrook threw ball away with 20.5 seconds left, giving the Hornets a chance to take the lead.\n\nLamb scored 18 points for Charlotte.\n\nTIP-INS:\n\nHornets: Reserve G Tony Parker missed the game with bruised ribs. Borrego said Parker was day-to-day .  F Michael Kidd-Gilchrist missed his fifth straight game with a right ankle sprain . Frank Kaminsky recorded a season scoring high for the second straight game, finishing with 12 points after scoring 11 against Indiana on Wednesday . Williams' 10 points gave him 10,002 for his career .  Lamb tied his career high for made free throws, going 8 for 8.\n\nThunder: Coach Billy Donovan said G Terrance Ferguson, who sprained his left ankle in a win Wednesday at Golden State, will be reevaluated in 10 to 12 days. The Thunder said Thursday rookie G Hamidou Diallo, who also sprained his left ankle during that game, would be reevaluated in seven to 10 days .. Two-way player Deonte Burton scored a career-high 11 points.\n\nM(asterisk)A(asterisk)S(asterisk)H UNIT\n\nIn addition to the injuries to Ferguson and Diallo, the Thunder's usual starting shooting guard, Andre Roberson, still is working his way back from a torn left patellar tendon he suffered in January. Alex Abrines, who had missed the previous four games due to a viral illness, came off the bench for the Thunder but played only seven minutes.\n\nWith all of the injuries, depth was an issue for the Thunder's backcourt, which is one reason Donovan chose to start Westbrook and Schroder -- who was coming off a 32-point outing against Golden State -- together. Timothe Luwawu-Cabarrot, usually a deep reserve, was the first player off the bench for the Thunder, and Burton played 21 minutes.\n\nEven with substitutions patterns significantly different than they were used to, the Thunder didn't seemed flustered at all.\n\n\"We're still going to play the same way, regardless of who's in or who's out,\" George said. \"I think we've got a certain style that we've got to play at. It's just up-tempo, fast, and defensively we're just going to get after it. Regardless of who is in the lineup, we've got principle we stick to.\"\n\nUP NEXT:\n\nHornets: Wrap up a two-game road swing on Sunday at Atlanta.\n\nThunder: Continue a four-game homestand on Saturday against Denver.",
  "source": "espn_api",
  "crawled_at": 1764994423.826001
}