{
  "game_id": "0022200486",
  "espn_id": "401468641",
  "date": "Dec 23, 2022",
  "matchup": "MIA vs. IND",
  "headline": "Haliburton hits winning 3, scores 43 as Pacers beat Heat",
  "body": "MIAMI -- — Tyrese Haliburton hit a 3-pointer in the final seconds and finished with a career-high 43 points, helping the Indiana Pacers to a 111-108 win over the Miami Heat on Friday night.\n\n\r\n              Haliburton’s winning shot with just over four seconds left was his team-record 10th 3-pointer of the game. He was coming off a 33-point game in a win at Boston on Wednesday.\n\n\r\n              Against the Heat he shot 14 for 20 from the field and 10 for 16 from long distance. Haliburton also earned a bit of redemption by overcoming his worst offensive outing of the season against Miami on Dec. 12, when he scored one point.\n\n\r\n              “That was in my mind coming into today,” Haliburton said. “I knew I had to respond the right way if I want to be the player I think I am and others think I am.”\n\n\r\n              The Heat rallied from a 12-point deficit early in the fourth quarter and tied it at 108 on Tyler Herro’s 3-pointer with 10 seconds left. \n\n\r\n              Haliburton took the inbounds pass, then dribbled to his left and took an uncontested shot several feet behind the 3-point line.\n\n\r\n              “Coaches drew up a good play and trusted me to make the shot,” Haliburton said. “That’s my job, to help us win games. It’s just exciting to share this moment with my teammates.”\n\n\r\n              Buddy Hield finished with 21 points — all on 3-pointers — and Jalen Smith had 14 points and 11 rebounds for the Pacers.\n\n\r\n              “Great players find a way to get that shot off,” Pacers coach Rick Carlisle said of Haliburton’s winner. “He made a move that created a pocket of space and allowed him to get his feet set. I was standing right behind it and it looked good all the way.”\n\n\r\n              Haliburton’s week started with Knicks analyst Wally Szczerbiak, working for MSG Network, calling the Pacers guard “Mr. Supposed Wannabe Fake All-Star.” Szczerbiak later apologized for the comment. Haliburton has been on a tear since. He’s averaging 38 points in the two games since Szczerbiak’s line, with 16 3-pointers in those contests.\n\n\r\n              Herro scored 28 points, Kyle Lowry had 21 and Jimmy Butler 20 for Miami. Butler sat out the fourth quarter because of a sprained right ankle. The Heat’s leading scorer sustained the injury in the first quarter and it began tightening up at halftime. He will be evaluated on Saturday, the Heat said.\n\n\r\n              “My luck’s not the greatest right now,” said Butler, who missed Tuesday’s home loss against Chicago because of a gastrointestinal illness. “You’ve got to take it in stride, man. It’s part of this game, part of this league. But I’ll be back.”\n\n\r\n              The Heat have lost three of four at home.\n\n\r\n              Indiana led 100-88 after a 16-4 spurt early in the fourth quarter. Haliburton’s jumper with 6:03 left capped the run.\n\n\r\n              “I don’t think it has anything to do with us but he’s going to come in highly motivated,” Heat coach Erik Spoelstra said of Haliburton’s performance. “And he did.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Haliburton’s first five baskets were 3-pointers. His first field goal inside the arc was a 19-foot jumper early in the third quarter. ... Guard Aaron Nesmith (right ankle sprain) didn’t play. The ex-Celtic scored 15 points in the Pacers’ 117-112 win at Boston on Wednesday.\n\n\r\n              Heat: The loss dropped Miami to 9-8 at home. The Heat had a 29-12 home record last season. … Bam Adebayo had 18 points and seven rebounds, ending his double-double string at four.\n\n\r\n              MORE LIKE IT\n\n\r\n              The Pacers reached 100 points for the 31st time this season. Their loss against Miami on Dec. 12 was the second game the Pacers were held under 100.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Conclude a three-game road stretch at New Orleans on Monday.\n\n\r\n              Heat: Host Minnesota on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993973.548617
}