{
  "game_id": "0021600211",
  "espn_id": "400899661",
  "date": "Nov 22, 2016",
  "matchup": "OKC @ LAL",
  "headline": "Young's late 3-pointer pushes Lakers past Thunder, 111-109",
  "body": "LOS ANGELES --  Nick Young's thievery prevented Russell Westbrook from pulling an even bigger heist during the Los Angeles Lakers' latest win.\n\nYoung hit a go-ahead 3-pointer with 5 seconds to play, and the Lakers blew a 14-point lead in the final minutes before snatching a 111-109 victory over the Oklahoma City Thunder on Tuesday night.\n\nWith the dramatic flair and boundless confidence that have characterized his entire unique career, Young improvised one of his biggest moments in a Lakers uniform.\n\n\"The play was designed to ... someone else,\" Young said with a sheepish grin. \"Yeah, I think they should have given me a steal for that.\"\n\nLou Williams had just come free on the perimeter and set up to catch Brandon Ingram's pass so he could take the Lakers' final shot, but Young slipped in front of him, swiped the ball and drained a 3-pointer in one fluid move.\n\n\"I told him, `If you're going to steal a pass, you better make the shot,\" Lakers coach Luke Walton said. \"It was a pretty incredible shot by him. Obviously one of the reasons we like Nick on the court at the end of the game is because he is not afraid of the moment. He loves the moment.\"\n\nYoung finished with 17 points and Jordan Clarkson had 18 as the Lakers (8-7) somehow withstood a monster performance by Westbrook, who scored 17 of his 34 points in a 5-minute span of the fourth quarter to trim the Lakers' big lead to one point.\n\nSteven Adams scored on a go-ahead putback of Westbrook's miss with 13.9 seconds to play to put Oklahoma City up 109-108, setting the stage for Williams to get upstaged.\n\n\"If he missed the shot, the narrative would have been different,\" said a smiling Williams, who had 13 points. \"He's never serious, but he made a big shot, apologized, and we're going to move on.\"\n\nBIG RUSS\n\nWhile taking over the NBA's scoring lead with his sixth consecutive 30-point game, Westbrook also had 13 assists and eight rebounds. He barely missed the sixth triple-double of his amazing season, but he also missed five of his final six shots while attempting to drag the Thunder to another win.\n\nWestbrook missed a long shot right before the buzzer, and the Los Angeles native sat motionless at his locker for a long time after the game.\n\n\"We get down by 14 points, and we get two quick scores and cut it to 10 and all of a sudden he goes crazy and gives us a chance to win the game,\" Oklahoma City coach Billy Donovan said. \"We were a little bit dead there, and his 3s gave us a chance.\"\n\nAdams had 20 points, including two baskets in the final minute, for the Thunder, who have lost six of eight.\n\nTEAMWORK\n\nTimofey Mozgov scored 16 points for the Lakers, who ended a two-game skid with their seventh win in 11 games overall.\n\nJose Calderon hit four 3-pointers and scored a season-high 12 points while filling in for D'Angelo Russell, who will miss at least two games to rest his sore knee.\n\nD-LO SIDELINED\n\nRussell sat out for the second time in three games to rest his knee, which prevents him from playing at full speed. He won't play Wednesday, and the Lakers aren't sure whether he'll return Friday or Sunday or later. Calderon has played sparingly in his first season with Los Angeles, but the Spanish guard excelled in this spot start.\n\nTIP-INS\n\nThunder: G Semaj Christon missed his second straight game with a concussion. ... Westbrook committed a flagrant-1 foul in the second quarter, hitting Luol Deng around the head and neck. The veterans exchanged words and had to be separated.\n\nLakers: Young also hit a long 3 at the halftime buzzer. ... Julius Randle had three points in 21 minutes while playing with a hip bruise that nearly kept him out of the lineup. ... Williams converted a four-point play in the first quarter.\n\nUP NEXT\n\nThunder: The road trip continues at Sacramento on Wednesday.\n\nLakers: At Warriors on Wednesday to begin a home-and-home miniseries around Thanksgiving.",
  "source": "espn_api",
  "crawled_at": 1764995323.4942348
}