{
  "game_id": "0021800698",
  "espn_id": "401071373",
  "date": "Jan 21, 2019",
  "matchup": "MIA @ BOS",
  "headline": "Irving's 26 points, 10 assists carries Celtics past Heat",
  "body": "BOSTON --  Kyrie Irving moved closer to some elite Boston Celtics company with his latest double-double. It was his three driving baskets, though, that helped seal the victory.\n\nIrving had 26 points and 10 assists, Al Horford added 16 points and 12 rebounds and the Celtics beat the Miami Heat 107-99 Monday night for their fourth straight win.\n\nIrving has had 20 or more points and 10 or more assists in 10 games. Hall of Famer Larry Bird accomplished the feat 11 times in 1986-87.\n\nBoston led by 19 points entering the final quarter, before Miami rallied and closed within 99-94 with 4 1/2 minutes to play.\n\nIrving then hit three spinning, driving baskets in the paint on the Celtics' next three possessions to secure the win.\n\n\"He just has a great ability to find those seams and finish,\" Boston coach Brad Stevens said. \"He's obviously got unbelievable touch. We were just trying to get simple slips and screens for him and let him do his thing. He's pretty special at that.\"\n\nIrving downplayed it as: \"That's what I'm supposed to be doing, be aggressive. That's pretty much it.\"\n\nJayson Tatum added 19 points and Marcus Morris 17 for the Celtics, who won their ninth straight at home and improved to 18-5 at TD Garden.\n\nDerrick Jones Jr. and Dion Waiters led the Heat with 18 points apiece.\n\nMiami coach Erik Spoelstra knew stopping Irving would be the key.\n\n\"We were able to inch our way back into the game, and pretty much you have to play perfectly offensively when you're dealing with Kyrie Irving on the other end,\" he said. \"It seemed like he made every single play when we were trying to get the ball out of his hands. He was just brilliant there at the end.\"\n\nThe building was somewhat quiet for most of the game, until the Celtics broke it open in the third quarter.\n\nBoston shot a torrid 72.7 percent (16 of 22) in the third, outscoring the Heat 37-18.\n\nThe teams were tied at the half before Boston opened the third with a 9-0 run over a 1:39 stretch.\n\nFollowing a 3-pointer by Miami's Tyler Johnson, the Celtics took charge by scoring 11 of the next 14 points, pushing their lead to 70-56. Tatum and Horford each had a pair of buckets before Morris closed it with a three-point play.\n\nThe Celtics used a late 12-3 run to move in front 87-68 after three periods.\n\nTIP-INS\n\nHeat: It was Spoelstra's 849th game, tying him with Pat Reilly for most in franchise history. . G Dwayne Wade, mainly seen as a rival player to Boston fans, got a nice ovation from the crowd when he checked in midway into the opening quarter. \"Did not expect it,\" he said. \"I said it, I think, earlier in the year, I was like: `One city will probably not give me an ovation.' I actually said Boston. So, it was cool.\"\n\nCeltics: Stevens earned his 250th win with the team. . It was the first of three straight home games, culminating with defending champion Golden State in a nationally-televised matchup Saturday night. . C Robert Williams, the team's top draft pick last spring, was inactive. Stevens said they're considering sending him to the G-League for playing time.\n\nSHOWING RESPECT\n\nStevens praised another local professional sports team, discussing the Patriots' victory in the AFC title game Sunday.\n\n\"It was amazing. I think being in this and knowing how hard it is to win a single game, I was telling my son you're living the 60's Celtics, the 60's and 70's UCLA,\" he said. \"That's the kind of thing we're talking about with what the Patriots have accomplished.\"\n\nSPEAKING PRAISE\n\nIrving addressed the crowd about the late Martin Luther King Jr. just before tipoff.\n\n\"Tonight, we celebrate and honor the life and legacy of Dr. Martin Luther King, a man who truly embodies what it means to be a leader, a visionary and a dreamer,\" he said. \"But I think what we most remember him for is for his stance and his action. He fought for justice, equality and, most importantly, peace for all. So, on behalf of the Celtics organization with everybody here, we honor Dr. Martin Luther King today.\"\n\nUP NEXT\n\nHeat: Host the Clippers on Wednesday.\n\nCeltics: Host the Cavaliers on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995240.912662
}