{
  "game_id": "0022300916",
  "espn_id": "401585544",
  "date": "Mar 08, 2024",
  "matchup": "HOU @ POR",
  "headline": "Jalen Green scores 27 points, the Rockets beat the Trail Blazers 123-107",
  "body": "PORTLAND, Ore. -- — Jalen Green had 27 points, including two statement dunks in the third quarter, and the Houston Rockets pulled away to beat the Portland Trail Blazers 123-107 on Friday night.\n\n\r\n              Fred VanVleet added 18 points and 10 assists for the Rockets, who had lost four of their previous six games and were coming off a 122-116 loss to the Los Angeles Clippers on Wednesday night. Alperen Sengun finished with 19 points. \n\n\r\n              Dalano Banton had a career-high 30 points for the Trail Blazers in their third straight loss.\n\n\r\n              “It's a big energy booster,” Green said about his momentum-shifting dunks. “The team with our sidelines, standing there yelling. I just get chills to the body. ... It just changes the whole atmosphere.”\n\n\r\n              Portland (17-45) led by 12 points, but Houston pulled in front in the third quarter and stretched its lead to 99-88 on Jock Landale's 3 pointer with 8:45 left. The Rockets (28-35) led by 18 points down the stretch. \n\n\r\n              Rockets coach Ime Udoka said he didn't like the start, so he challenged the team at halftime. \n\n\r\n              “I love the way they came out and responded to the challenge, to come out and hold them them to 24 in the third, 20 in the fourth. Really used the defense to ignite our game in general, so the energy was better, and they responded to it well,\" Udoka said. \n\n\r\n              The Blazers were without DeAndre Ayton, who missed his fifth straight game with a sprained right wrist. Rookie Scoot Henderson and Malcolm Brogdon were also sidelined by longer-term injuries.\n\n\r\n              Jerami Grant, who missed Monday's game at Minnesota but returned for Portland's 128-120 loss to Oklahoma City, on Wednesday, was again unavailable because of right hamstring soreness. Jabari Walker sat out with a right hip contusion.\n\n\r\n              Toumani Camara, who missed Wednesday's game because of illness, played for Portland.\n\n\r\n              “It’s frustrating,” Blazers coach Chauncey Billups said. “The good thing is, we’re trying to develop. So it does give the young guys an opportunity to get some game minutes. But what happens is you lose so many opportunities for chemistry and synergy with the starters and you’re players that you depend on the most. So it’s kind of a double-edged sword.”\n\n\r\n              The Blazers led by 11 points in the first quarter but Jabari Smith Jr.'s 3-pointer tied it at 42 for Houston in the second. The Rockets moved in front briefly before halftime, but Portland took a 63-55 lead into the break.\n\n\r\n              Portland had 12 first-half 3-pointers but finished with 16. \n\n\r\n              Green followed up a steal and dramatic dunk over Simons with a layup to get the Rockets within 70-65. Green dunked again to close the gap to 77-76 and Cam Whitmore's basket gave the Rockets the lead.\n\n\r\n              Portland kept it close, trailing by just 92-87 going into the final period.\n\n\r\n              “Those dunks Jalen had, just playing defense, locking up and spreading out. It tuns the momentum in our favor,\" said Amen Thompson, who finished with 16 points of the bench for Houston. \n\n\r\n              It was the second of four meetings between the two teams. The Blazers won the first in January.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Sacramento on Sunday night. \n\n\r\n              Trail Blazers: Host Toronto on Saturday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995581.307449
}