{
  "game_id": "0021600753",
  "espn_id": "400900158",
  "date": "Feb 03, 2017",
  "matchup": "PHX @ SAC",
  "headline": "Booker nets 33, hits winning jumper to lift Suns over Kings",
  "body": "SACRAMENTO, Calif. --  After patiently waiting for the clock to wind down, Devin Booker launched a high-arching jumper at the buzzer that gave the struggling Phoenix Suns a victory Friday night.\n\nBooker scored 11 of his 33 points in the fourth quarter, sending the Suns to a 105-103 win over the Sacramento Kings.\n\nThe talented second-year guard banked in a 20-foot fadeaway over Matt Barnes to snap Phoenix's five-game losing streak. The Suns, who trailed by seven with 4:22 remaining, had dropped their previous four meetings with Sacramento.\n\n\"I know Matt Barnes is a really good defender and I saw he was on me coming out of the timeout,\" Booker said. \"I didn't want to do too much with the ball and I wanted it to be our last shot. I knew it wasn't a great look, but it went in.\"\n\nWhen asked if he wanted to bank it, Booker said with a smile: \"I don't have to answer that.\"\n\nBooker made four 3-pointers and had 26 points in the second half, including 15 in the third quarter. He has scored 20 or more in 15 straight games.\n\n\"It's a tough night and tough to take this loss,\" Kings coach Dave Joerger said. \"The guy took a contested 20-footer and it was defended well. Only he can tell if he hit it off the glass on purpose.\"\n\nDeMarcus Cousins had a triple-double with 22 points, 12 rebounds and 12 assists for the Kings. Darren Collison scored 19, and Ty Lawson and Ben McLemore added 18 points apiece. Sacramento has lost three straight games and is 8-14 at home.\n\nIt was Cousins' sixth career triple-double and second this season.\n\nCousins picked up his fifth foul at the 9:22 mark and went to the bench for six minutes in the fourth quarter.\n\nTJ Warren had 21 points and Eric Bledsoe scored 20 for the Suns. Brandon Knight added 12.\n\nP.J. Tucker made a 3-pointer to give Phoenix a 103-101 lead. Following a timeout, Collison tied the game on a short, baseline jumper with 8.2 seconds remaining.\n\nSacramento, which went a dismal 1-6 on its last homestand, played the first of six straight games at home. The Kings play 11 of their next 13 at Golden 1 Center.\n\nA starter earlier in the season, McLemore had 16 first-half points, exceeding his season high of 14. In the previous 15 games, he played just 37 minutes and scored six points.\n\nROUGH HOMECOMING\n\nPlaying his first NBA game in his hometown, Suns rookie Marquese Chriss had four fouls in his first 10 minutes while guarding Cousins. Chriss finished with two points in 16 minutes.\n\nThe 19-year-old Chriss said he gave out 20-plus tickets to friends and saw his Pleasant Grove High School coach in the stands, along with some teachers, friends and relatives. He was matched up against Cousins, a player he had watched many times as a spectator.\n\n\"He's big, talented, strong and physical, and he knows how to work the angles,\" Chriss said. \"But I want to be thrown into the fire and learn.\"\n\nTIP-INS\n\nSuns: Prior to taking a lead in the opening minutes, Phoenix hadn't led for the previous 119 minutes. ... The Suns made 12 of 29 3-pointers.\n\nKings: Sacramento was without Garrett Temple (partial hamstring tear), Arron Afflalo (stomach virus) and Omri Casspi (calf strain). Second-leading scorer Rudy Gay is out for the season with a ruptured Achilles. ... Cousins reached the triple-double late in the third quarter with a full-court pass that found Barnes for a fast-break layup.\n\nUP NEXT\n\nSuns: Return home Saturday to host Milwaukee.\n\nKings: No rest for Sacramento, with Golden State coming to town Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995960.186559
}