{
  "game_id": "0021300732",
  "espn_id": "400489605",
  "date": "Feb 05, 2014",
  "matchup": "OKC vs. MIN",
  "headline": "Kevin Durant sends OKC past short-handed Wolves",
  "body": "OKLAHOMA CITY -- The Oklahoma City Thunder showed Wednesday night that they don't always need to have Kevin Durant score in the fourth quarter to win a close game.\nDurant scored just two of his 26 points in the final 12 minutes and his teammates -- including Derek Fisher, Jeremy Lamb and Reggie Jackson -- stood in the gap, helping Oklahoma City pull away for a 106-97 win over a Minnesota Timberwolves team without Kevin Love and two other starters.\nJackson added 20 points (seven in the fourth quarter) and nine assists for the Thunder, who won for the 12th time in their last 13 games and became the NBA's first team this season to 40 wins. The Thunder won for the ninth straight time at home against Minnesota, which entered the game 3½ games behind Dallas in the race for the eighth and final playoff spot from the Western Conference.\nThe Thunder have won eight straight home games and are 15-1 this season against Western Conference foes at Chesapeake Energy Arena.\n\"We just focus on doing our job every night and living with the results and they've been pretty good for a while now,\" Oklahoma City coach Scott Brooks said. \"We have expectations to a standard that we want to play at and I think we've done a good job with that going into the All-Star break.\n\"This is funky time for a lot of teams because a lot of players are probably thinking about the break and what they're doing, getting their plans together. We've never been a team that has done that and I don't anticipate that happening this year.\"\nLove, an All-Star forward, sat out with a stiff neck after taking a hard fall Tuesday in a win over the Los Angeles Lakers. Center Nikola Pekovic (ankle injury) and forward Corey Brewer (family leave) also didn't play for the Timberwolves. Minnesota coach Rick Adelman said he was proud of the way his undermanned team fought.\n\"I think it shows that these guys compete,\" Adelman said. \"They weren't afraid to go play them with three starters out. It gave the other guys an opportunity to play. I couldn't be prouder of the way they competed. We just ran a little bit out of gas at the end.\"\nWith Minnesota devoting its defensive energies to stopping Durant, other Thunder players made the key plays in the final minutes.\nThe score was tied in the closing seconds of the third quarter when Fisher attempted a 3-pointer from the corner that appeared to be long, but Minnesota's Gorgui Dieng accidentally tapped it into the basket to give the Thunder an 80-77 lead. Fisher finished with 13 points, his second-best offensive outing of the season.\n\"I've never seen that before,\" Durant said of the goaltending call on Dieng. \"That guy is a rookie . so I'm sure he's going to learn from that one. But that gave us a boost and at the start of the fourth those guys came out and played extremely hard and that's what we needed.\"\nLamb opened the fourth quarter with another 3-pointer to push Oklahoma City's lead to six points. The Thunder finished off the 16-4 run with a dunk by Lamb with 7:17 left that made it 93-81, but Oklahoma City suddenly went cold from the field.\nDurant was called for a technical foul with 4:39 left after protesting a no-call, but Ricky Rubio missed the ensuing free throw, leaving the score at 93-86. Minnesota pulled within 95-89 after a 3-pointer by Robbie Hummel with 3:45 left, but the Timberwolves came no closer.\n\"We came into the game aggressive and we fought all the way through, but in the last five minutes, I think we missed too many free throws and easy shots while they made shots at the end,\" said Rubio, who had 19 points, eight rebounds and five assists.\nThabo Sefolosha, who missed his first seven 3-point attempts, made one from the corner with 1:43 left to extend the Thunder's lead to 100-90 and Minnesota came no closer than nine points the rest of the way.\n\"They're NBA players, too,\" Durant said of his teammates. \"It's not like I've been scoring every point in the fourth. We play off each other. Guys hit big shots and we got stops. . We play a team game here.\"\nDurant, who also had nine rebounds and seven assists, continued his strong play against the Timberwolves. He had a triple-double in a home win over the Timberwolves on Dec. 1 and scored 48 points in a win at Minnesota on Jan. 4 before his outburst Wednesday.\nThe Timberwolves led by as many as six points in the second quarter, but Oklahoma City took a 56-54 lead after Durant swished a 3-pointer at the buzzer. Durant had 16 points, six rebounds and five assists by halftime.\nDante Cunningham added 18 points on 9-of-13 shooting for Minnesota. Serge Ibaka had 14 points and seven rebounds for the Thunder.\nGame notes\nBrewer didn't travel with the team following the birth of his son on Tuesday. The Timberwolves say he's expected to return for Friday's game at New Orleans. Luc Richard Mbah a Moute replaced Brewer in the starting lineup. ... Durant was the Western Conference player of the month for January. He averaged 35.9 points per game while shooting 54.9 percent during the month, leading Oklahoma City to a 10-game winning streak. He scored 30 or more points in 12 straight games. ... Olympic gold-medal winning gymnasts Bart Conner and Nadia Comaneci, who live in nearby Norman, attended the game. ... Hummel saw his first action since Jan. 6 at Philadelphia. He played 17 minutes and scored five points. ... Oklahoma City C Kendrick Perkins matched his season high with 12 rebounds.",
  "source": "espn_api",
  "crawled_at": 1764992861.616555
}