{
  "game_id": "0021900038",
  "espn_id": "401160680",
  "date": "Oct 27, 2019",
  "matchup": "POR @ DAL",
  "headline": "Lillard's late layup sends Trail Blazers past Mavs 121-119",
  "body": "DALLAS --  Damian Lillard helped the Portland Trail Blazers a few ways on Sunday night. He scored the eventual winning basket and talked his coach into making a replay challenge, all in the closing seconds.\n\nLillard's twisting layup with 26 seconds remaining proved to be the winner as the Trail Blazers beat the Dallas Mavericks 121-119.\n\nLillard scored 26 of his 28 points in the second half, including a basket that gave the Blazers a 120-119 lead.\n\nThe Blazers' CJ McCollum had a game-high 35 points.\n\nKristaps Porzingis led Dallas with 32 points.\n\nAfter Lillard's score, the Mavericks' Luka Doncic missed a 3-point attempt and Portland won a challenge of a call that would have sent the Mavericks' Dorian Finney-Smith to the foul line after he'd grabbed a rebound and attempted a shot with eight seconds left.\n\nThe foul was called on Lillard.\n\nInstead, there was a jump ball.\n\nCrew chief Courtney Kirkland explained how a one-year experimental rule applied to this review.\n\n\"Once Portland challenged the play and we were able to go and look at replay, we were able to have clear, conclusive evidence that Damian Lillard legally deflected the ball from Dorian Finney-Smith. The ball was loose when the whistle blew, which led to an inadvertent whistle. Therefore, we ended up having a jump ball.\"\n\nLillard had insisted to coach Terry Stotts that he should challenge the call, even though losing it would have cost the Blazers' last timeout.\n\n\"If we lose the challenge, they are on the (foul) line and we are down one (point), but (Lillard) was pretty adamant, so I trusted him,\" Stotts said.\n\nDallas still seemed likely to win the jump with 7-foot-3 center Kristaps Porzingis. Portland center Hassan Whiteside had fouled out and 7-footer Zach Collins left the game with an injury.\n\n\"I was thinking we don't even have a five man in the game, so how are we going to win a jump ball?\" McCollum said. \"Then Porzingis tipped it to us, so it worked out.\"\n\nThe Blazers' Kent Bazemore got the ball and was fouled. He made the first of two free throws. Doncic rebounded and passed to Tim Hardaway, whose shot from about midcourt rattled off the front of the rim as time expired.\n\nLillard, who scored 67 points in Portland's first two games, had only two points in the first half on 1-for-7 shooting.\n\n\"I didn't feel bad,\" he said. \"I didn't feel like I was just missing terrible shots.\"\n\nPorzingis said the Mavericks discussed at halftime trying to keep Lillard in check.\n\n\"We knew we couldn't let him get going. Then in the second half, Damian really got going.\"\n\nFor Portland, Rodney Hood had 20 points, Bazemore 11 and Zach Collins 10.\n\nDoncic finished with 29 points, 12 rebounds and nine assists. Teammate Maxi Kleber had 14 points, Seth Curry 12 and Hardaway 11.\n\nPortland never held the lead through the first three periods but rallied to tie the game at 95 on one of two free throws by Lillard eight seconds before the end of the third quarter.\n\nDallas struggled through a 2-for-19 shooting spell and fell behind by as many as six points before Curry hit a 3-pointer that tied the game at 107.\n\nKleber, who had totaled only eight points in the Mavericks' first two games, scored eight in the first 2:49 with two 3-pointers and a dunk.\n\nDallas led at halftime 71-59.\n\nOWNER'S TWEET-MENT\n\nMark Cuban tweeted about Portland's successful challenge.\n\n\"I'm a fan of the nba challenge rule, but if a play is overturned and they don't show the replay that justifies overturning a call along with an explanation then it's going to have real problems. From the angles we saw in arena it looked like a clean strip but body contact first.\"\n\nGOOD TIME, LONG TIME\n\nDallas' Kristaps Porzingis' 32 points marked the 15th time he has scored 30 or more, and the first since December 2017.\n\nFor Portland, McCollum's 35 points were his most in a game since he scored 40 on Dec. 12, 2018.\n\nTIP-INS\n\nBlazers: F Zach Collins left the court holding his right shoulder in the third quarter. ... F/C Pau Gasol still hasn't played in his 18th season because of an injured left foot. Coach Terry Stotts said: \"The only thing he's really doing on the court is spot-shooting, post moves, stuff like that but no contact.\"\n\nMavericks: Dallas had trailed after the first quarter in each of the first two games. ... Coach Rick Carlisle celebrated his 60th birthday Sunday. . F/C Dwight Powell (strained left hamstring) missed his third straight game\n\nUP NEXT\n\nBlazers: At San Antonio on Monday in the third of a four-game trip.\n\nMavericks: At Denver Nuggets on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996609.768342
}