{
  "game_id": "0022000118",
  "espn_id": "401267278",
  "date": "Jan 07, 2021",
  "matchup": "BKN vs. PHI",
  "headline": "Nets, without Irving and Durant, beat NBA-leading 76ers",
  "body": "NEW YORK -- — The Brooklyn Nets couldn't put Kyrie Irving and Kevin Durant into those throwback blue tie-dye jerseys from 30 years ago.\n\n\r\n                    The NBA's leading team still couldn't come close to beating them. \n\n\r\n                    Joe Harris scored a season-high 28 points and the Nets shook off the absence of their two superstars to beat the Philadelphia 76ers 122-109 on Thursday night.\n\n\r\n                    Brooklyn jumped out quickly and had a double-digit lead for much of the second half while winning its second straight, both without Durant.\n\n\r\n                    “Obviously it’s a totally different team when those guys are out here,” guard Caris LeVert said, “but I think we’ve done a great job of having a next-man-up mentality, guys stepping into those roles and fulfilling what we need as a team.” \n\n\r\n                    LeVert had 22 points, 10 assists and seven rebounds, and Jarrett Allen added 15 points and 11 boards for the Nets.\n\n\r\n                    Irving was ruled out Thursday afternoon for personal reasons, though coach Steve Nash said before and after the game he hadn't spoken to his point guard and didn't know the reason for his absence, calling it a personal matter. LeVert said Irving texted his teammates before the game and they supported his absence. The Nets said Irving would not travel with the team to Memphis on Thursday night.\n\n\r\n                    The Nets already knew they’d be without Durant for a second consecutive game because of the NBA’s health and safety protocols. Nash said Durant would be able to return Sunday if he continues to test negative for the coronavirus until then.\n\n\r\n                    Nash said he didn't think the strong performance without them sent a message to the rest of his players.\n\n\r\n                    “I think the message is for the whole group that when we play connected and we have that fighting spirit, we give ourselves a great chance every night no matter who’s available,” he said. \n\n\r\n                    The 76ers came in at 7-1 and off their best performance of the season, when they shot an NBA season-high 61.7% in a 141-136 victory over Washington on Wednesday. \n\n\r\n                    But they couldn't duplicate that, with Joel Embiid starting slowly before finishing with 20 points and 12 rebounds. Shake Milton had a season-high 24 points in his first start of the season in place of Seth Curry, who had a sore left ankle, but Ben Simmons was limited to 11 points, four rebounds and two assists.\n\n\r\n                    Milton said he didn't believe the Sixers had a letdown because of the Nets' absent stars.\n\n\r\n                    “I don’t think that was it at all,” he said. “It’s the NBA and it was a back-to-back, but guys in the NBA know they can play. So if you don’t come out and you’re not on top of your game and you’re not ready to go, not mentally locked in, you can get beat by anybody.” \n\n\r\n                    The Sixers quickly fell into a 20-8 hole, but recovered to move into the lead early in the second quarter. The Nets broke away again late in the period, going up by 16 before taking a 65-51 lead to the locker room, and were never seriously threatened afterward. \n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Dwight Howard had an eventful night, totaling nine points, 12 rebounds and six fouls in just 16 minutes. ... Coach Doc Rivers said he believed Curry was hurt late in Wednesday's victory, when the guard scored a season-high 28 points. Rivers didn't believe the injury was severe but said it was best to rest Curry. \n\n\r\n                    Nets; Brooklyn was also without G Tyler Johnson because of the health and safety protocols. Nash said he believed it was due to contact tracing. ... Jeff Green scored 14 points.\n\n\r\n                    OLD JERSEY\n\n\r\n                    Irving, who grew up in New Jersey, missed the chance to wear the Nets’ uniforms they wore while playing there. Their blue uniforms were a throwback to the tie-dye ones they wore during the 1990-91 season. The franchise switched to black and white after moving to Brooklyn in 2012.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Host the Denver Nuggets on Saturday.\n\n\r\n                    Nets: Visit the Memphis Grizzlies on Friday to complete their second back-to-back set of the season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997522.503816
}