{
  "game_id": "0022400201",
  "espn_id": "401704767",
  "date": "Nov 10, 2024",
  "matchup": "HOU @ DET",
  "headline": "Alperen Sengun scores 27 to lead Rockets to 101-99 win over Pistons",
  "body": "DETROIT -- — Alperen Sengun scored five of his 27 points in the final 2:28 to lead the Houston Rockets to a 101-99 victory over the Detroit Pistons on Sunday.\n\n\r\n              Trailing 101-99 with six seconds left, Pistons' guard Cade Cunningham intentionally missed a free throw and Jaden Ivey got the offensive rebound. His shot missed, but Tobias Harris was fouled on the rebound.\n\n\r\n              With a chance to tie the game with one second to go, Harris missed the first free throw. He intentionally missed the second, but Ivey fell out of bounds trying to secure the rebound.\n\n\r\n              Sengun added 10 rebounds, and Tari Eason scored 10 of his 18 points in the fourth quarter.\n\n\r\n              Cunningham had 26 points, nine assists and eight rebounds, falling just short of becoming the first Pistons player to record four straight triple-doubles.\n\n\r\n              Sengun's putback gave the Rockets a 96-95 lead with 2:28 to play, and Jaden Ivey was called for an offensive foul on the next possession. Houston got another putback, this one a dunk from Dillon Brooks, before Sengun scored Houston's third straight basket off an offensive rebound to make it 100-95.\n\n\r\n              Takeaways\r\n              Rockets: Houston was able to stay in the game in the first half despite shooting 18.8% (3 of 16) on 3-pointers by recording nine offensive rebounds. \n\n\r\n              Pistons: Cunningham had 14 first-half points on 5-of-10 shooting, but his teammates only managed 31 on 36.3% (12 of 33) from the floor.\n\n\r\n              Key moment\r\n              The Rockets led 84-72 with nine minutes left, but Malik Beasley hit three 3-pointers in a 16-3 run that put Detroit up 88-87 with 5:16 left.\n\n\r\n              Key stat\r\n              Houston forced seven third-quarter turnovers that led to eight points and held the Pistons to 36.8% shooting. Detroit missed all five 3-point attempts, including three by Tim Hardaway Jr.\n\n\r\n              Up next\r\n              The Rockets host the Wizards on Monday, while the Pistons host the Heat on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997414.146729
}