{
  "game_id": "0022300082",
  "espn_id": "401584710",
  "date": "Oct 27, 2023",
  "matchup": "TOR @ CHI",
  "headline": "Caruso nails 3 in overtime to give the Bulls a wild 104-103 win over Raptors",
  "body": "CHICAGO -- — Alex Caruso knows his main job is to create havoc with his defense. He can hit the big shots, too.\n\n\r\n              Caruso nailed a 3-pointer with 2.3 seconds remaining in overtime and the Chicago Bulls beat the Toronto Raptors 104-103 on Friday night.\n\n\r\n              Caruso hit the winner off a feed from Zach LaVine after stripping Pascal Siakam as he attempted a runner just inside the Raptors foul line. He finished with 13 points, 13 rebounds and two steals.\n\n\r\n              DeMar DeRozan scored 33 points — 18 in the fourth quarter. Coby White added 17, and the Bulls came out on top in a game filled with wild swings.\n\n\r\n              “It's all about how you bounce back and respond,” DeRozan said. “We had some lulls throughout the game, but we never gave in. We stuck with it to the end and gave ourselves an opportunity to win.”\n\n\r\n              They went from leading by 19 in the second quarter to trailing by 11 in the third before tying it late in that quarter.\n\n\r\n              Toronto went on a 14-2 run in the fourth to go up by 19. But the Bulls pulled even, with DeRozan leading a huge push near the end of regulation.\n\n\r\n              He did, however, miss three free throws in the final 12.7 seconds of regulation, including one at the end that would have won it.\n\n\r\n              Toronto was up 103-99 with about 30 seconds left in overtime when DeRozan scored on a layup. Caruso then blocked Siakam and LaVine pushed the ball up the court. With three defenders collapsing on him as he drove toward the basket, he passed to an open Caruso in the left corner for the go-ahead 3, giving Chicago the win after an ugly season-opening loss to Oklahoma City on Wednesday.\n\n\r\n              “I got a good strip,” Caruso said. “I saw Zach was boxing out and got the ball from (Chris) Boucher or somebody. Then, there was eight seconds left or something like that so I was just trying to space the floor. Zach made a great read. He had to trust me doing what I’m supposed to do — get to the corner. The shot went in.”\n\n\r\n              Caruso was confident the shot was good when it left his hand. He got mobbed after it went in.\n\n\r\n              “It's amazing, the effort that he puts (in), the sacrifice that he plays with, throwing his body around,” DeRozan said. “His instincts. It's amazing to watch. It's kind of like letting the cheetah out of the cage. He's running wild. He makes it look pretty.”\n\n\r\n              Scottie Barnes had 22 points, 10 rebounds and 10 assists in his second career triple-double for Toronto. Siakam scored 18 points, but Toronto lost for the first time under coach Darko Rajakovic, after opening with a win over Minnesota.\n\n\r\n              Toronto was up 91-88 with 20 seconds remaining when Caruso came away with a steal against Barnes in the backcourt following a timeout. He got the loose ball and — from the floor — fed DeRozan, who took one dribble and banked in a floater with 12.7 seconds remaining. DeRozan got fouled on the play, only to miss the potential tying free throw.\n\n\r\n              The ball got tipped around and the Raptors eventually came away with it after a goaltending against Barnes got overturned.\n\n\r\n              Siakam hit two free throws to make it 93-90 with nine seconds left in regulation. DeRozan then got fouled attempting a 3 with 3.5 left and made the first two before missing the third.\n\n\r\n              Toronto got the ball, but an offensive foul by Siakam against Caruso kept the Bulls in it. DeRozan caught a crosscourt pass off the inbounds and got fouled again. With another chance to put Chicago on top, he made the first free throw to tie it at 93 with 0.7 seconds left, only to miss the second attempt, sending the game to overtime.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Philadelphia on Saturday.\n\n\r\n              Bulls: Visit Detroit on Saturday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995470.701447
}