{
  "game_id": "0022401062",
  "espn_id": "401705628",
  "date": "Mar 27, 2025",
  "matchup": "ATL @ MIA",
  "headline": "Herro scores 36, Heat shake off slow start to beat Hawks 122-112 for 3rd consecutive victory",
  "body": "MIAMI -- — Tyler Herro scored 36 points, Davion Mitchell and Andrew Wiggins each added 16 and the Miami Heat beat the Atlanta Hawks 122-112 on Thursday night for their third straight win.\n\n\r\n              Bam Adebayo had 12 points and 10 rebounds for Miami, which trailed by 14 in the first quarter but controlled the second half.\n\n\r\n              Trae Young had 29 points and 12 assists for the Hawks, who got 17 points from Caris LeVert and 15 from Oneyka Okongwu.\n\n\r\n              The win moved the Heat (32-41) within three games of Atlanta (35-38) for the No. 7 seed in the Eastern Conference, both having nine games left to play. Miami's win also clinched a playoff berth for the New York Knicks and eliminated the Brooklyn Nets from postseason contention.\n\n\r\n              Takeaways\r\n              Hawks: Young's 11th assist moved him past Wilt Chamberlain (4,643) for 85th on the NBA's career list. Young is on pace to lead the NBA in total assists for the third time in the last four seasons. \n\n\r\n              Heat: Herro is 31 for 46 (.674) from the field in Miami’s last three games, along with 10 of 15 (.667) from 3-point range. He’s averaging 28.3 points in that span.\n\n\r\n              Key moment\r\n              The biggest shot of the night for Miami might have been Herro's 3-pointer with 2:18 left, coming one possession after Atlanta got within five — the closest the Hawks had been in the second half.\n\n\r\n              Key stat\r\n              Mitchell had a quirky streak end. He had scored exactly 12 points in each of his last five Heat games. He was the second player with such a streak in NBA history; the other was Benoit Benjamin in 1988. But Mitchell's 3-pointer with 8:11 left gave him 13 points Thursday.\n\n\r\n              Up next\r\n              Atlanta finishes a three-game road trip Sunday in Milwaukee. Miami starts a three-game trip Saturday in Philadelphia.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997913.305282
}