{
  "game_id": "0022200179",
  "espn_id": "401468334",
  "date": "Nov 11, 2022",
  "matchup": "TOR @ OKC",
  "headline": "Omoruyi scores career-high 22 as Thunder top Raptors 132-113",
  "body": "OKLAHOMA CITY -- — Eugene Omoruyi scored a career-high 22 points to help the Oklahoma City Thunder beat the Toronto Raptors 132-113 on Friday night to snap a four-game losing streak.\n\n\r\n              Omoruyi, a two-way player from the Toronto area, acknowledged that the game against his hometown team “definitely meant a little more.\" He made the most of the opportunity by making 8 of 10 field goals, including 5 of 6 3-pointers.\n\n\r\n              Omoruyi spent last season on the G-League’s Texas Legends, averaging 15.8 points and 6.6 rebounds per game as a rookie. This season, he’s played in two of three games for the Oklahoma City Blue — the Thunder G-League affiliate — and has averaged 26.5 points and 4.0 rebounds. \n\n\r\n              He looked comfortable after moving up, and he looks forward to more chances.\n\n\r\n              “It’s been a different journey for me, but I’m loving it every step of the way,” Omoruyi said. “It’s a long journey, but it doesn’t happen overnight, and I’ve just got to keep staying ready, and that’s what I keep doing.”\n\n\r\n              Part of his success Friday came from toning things down a bit.\n\n\r\n              “He’s competitive and he wants to prove himself, and he gets amped up and tries to force something,” Thunder coach Mark Daigneault said. “He did a really good job tonight in just letting the offense work for him, and he ends up getting open looks.”\n\n\r\n              Omoruyi highlighted a Thunder squad that had eight players score in double figures for the first time in franchise history.\n\n\r\n              Shai Gilgeous Alexander scored 20 points, and Josh Giddey added 15 points, nine rebounds and five assists for the Thunder, who posted their largest margin of victory this season.\n\n\r\n              Though Gilgeous-Alexander had his second-lowest point total of the season, other players were able to get going for the Thunder. \n\n\r\n              “He was just very content with choosing his spots, and letting his teammates make the plays,” Daigneault said. “It empowers everybody else and really allows us to develop our team.”\n\n\r\n              Pascal Siakam, Toronto’s top scorer, sat out with a right adductor strain. Chris Boucher led the Raptors with 20 points and 12 rebounds in a reserve role and Scottie Barnes and Fred VanVleet each added 15 points.\n\n\r\n              Oklahoma City rolled out to a 70-56 halftime lead. The Thunder led by 17 points early in the third quarter and didn’t look back, holding at least a 15-point lead through the remainder of the game and pushing the advantage to 32 points in the fourth quarter. \n\n\r\n              QUOTABLE\n\n\r\n              Daigneault, on Gilgeous-Alexander: “He sees the bigger picture at a pretty elite rate for a young player, and that benefits him and us in terms of the long term. And it also benefits you in a game where teams clearly are going to try to scheme to take him out and try to frustrate him. And the worst thing you can do against that tactic is like try to jam the ball in there. You know, it’s deflating, quite frankly. And he’s gone up against it many times and showed great poise tonight.” \n\n\r\n              TIP-INS\n\n\r\n              Raptors: C Precious Achiuwa did not play. He is out indefinitely with an ankle injury. ... Shot 43.2% from the field. ... No starter scored more than 15 points.\n\n\r\n              Thunder: Wore their City Edition uniforms for the first time this season. ... F Aleksej Pokusevski had 14 points, five rebounds and five blocks. ... G Lu Dort scored nine points in the first quarter and finished with 13 points and seven rebounds. ... G Jalen Williams recorded a double-double with 10 points and 10 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Visit the Indiana Pacers on Saturday.\n\n\r\n              Thunder: Visit the New York Knicks on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994096.639665
}