{
  "game_id": "0022401015",
  "espn_id": "401705581",
  "date": "Mar 21, 2025",
  "matchup": "HOU @ MIA",
  "headline": "VanVleet scores 37 as surging Rockets beat sliding Heat 102-98",
  "body": "MIAMI -- — \n\n\r\n              Fred VanVleet scored 37 points and the surging Houston Rockets won their ninth straight, beating the Miami Heat 102-98 Friday night.\n\n\r\n              VanVleet shot 13 for 17 from the field and made a season-high 9 of 11 3-pointers as the Rockets extended the league’s longest active winning streak. Houston also snapped a nine-game skid against Miami, which lost its 10th straight. It is the Heat’s longest skid since they lost 11th straight in 2007-08.\n\n\r\n              Amen Thompson returned after missing the last six games because of a sprained left ankle and finished with 18 points and seven steals while Dillon Brooks and Jabari Smith each added 11 points for the Rockets.\n\n\r\n              Houston rallied from an 11-point deficit early in the third quarter and got to 80-78 on Jalen Green’s jumper to close the period.\n\n\r\n              Miami’s Andrew Wiggins scored 30 points, his highest total since the Heat acquired him from Golden State for Jimmy Butler on Feb. 6. Kel’el Ware had 16 points and 14 rebounds, while Bam Adebayo also scored 16 points for the Heat.\n\n\r\n              Takeaways\r\n              Rockets: Houston remained second in the Western Conference.\n\n\r\n              Heat: Miami squandered its 20th double digit lead that led to a loss. Wiggins’ jump shot two minutes into the third period put the Heat ahead 65-54 before Houston rallied.\n\n\r\n              Key moment\r\n              VanVleet went on a personal 9-2 run to start the fourth that put the Rockets ahead for good. He hit two 3-pointers, a lay-up and made 1 of 2 free throws that gave Houston an 87-84 lead.\n\n\r\n              Key stat\r\n              The Rockets outrebounded the Heat 46-34 for their eighth consecutive game of winning the rebounding edge against their opponent.\n\n\r\n              Up next\r\n              Rockets host Denver on Sunday, and Heat host Charlotte.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997351.710946
}