{
  "game_id": "0022300511",
  "espn_id": "401585139",
  "date": "Jan 08, 2024",
  "matchup": "LAC vs. PHX",
  "headline": "Clippers rout Suns 138-111 for 2nd time in 5 days behind George and Zubac",
  "body": "LOS ANGELES -- — Paul George scored 25 points, Ivica Zubac added 19 and the Los Angeles Clippers beat the Phoenix Suns 138-111 for the second time in five days on Monday night.\n\n\r\n              James Harden had 19 points, seven rebounds and 10 assists for the Clippers, who won 131-122 in Phoenix last Wednesday and have won six of seven overall. Kawhi Leonard added 17 points.\n\n\r\n              The Clippers were coming off a three-point loss to the Lakers on Sunday that snapped their five-game winning streak.\n\n\r\n              “Losing that game really woke us up,” Clippers coach Tyronn Lue said. “Offensively, the ball moved and we created easy shots for one another.”\n\n\r\n              The Clippers scored 100 points through three quarters.\n\n\r\n              “This team is full of vets,” Leonard said. “We just got to throw that game away and come out next game with a better mindset.”\n\n\r\n              Kevin Durant scored 20 of his 30 points in the first half for the Suns. They dropped their second in a row playing in a back-to-back. Devin Booker finished with 20 points and Bradley Beal had 15 points.\n\n\r\n              George and Harden had 15 points apiece in the first half when the Clippers shot a season-best 67% to lead 71-63 at the break. The Suns shot 51% but never led by more than five points. \n\n\r\n              The Clippers stretched their lead to 15 points in the third, when they made six 3-pointers by four different players. For the game, they shot 62% and had all five starters in double figures. \n\n\r\n              Zubac shot 8 of 9 from the floor, had eight rebounds, three assists and a steal.\n\n\r\n              “Right now we're playing at a high level and everyone is confident,” he said.\n\n\r\n              Grayson Allen and Durant, the NBA’s top two 3-point percentage shooters, were a combined 4 of 9 from long range. \n\n\r\n              Last week's game was a contentious one in which both teams complained about the officiating. This time it was all about getting shots up.\n\n\r\n              The Clippers shot 53 of 85, made 15 3-pointers and hit 17 of 23 free throws. They controlled the boards 44-25 and outscored the Suns in the paint 62-42 while improving to 15-4 at home.\n\n\r\n              “They got three Hall of Famers that are really hard to guard,” Suns coach Frank Vogel said. “They got a complete team.”\n\n\r\n              The Clippers dominated the fourth, opening with a 17-5 run including 15 in a row, to go up 118-96. Five different players scored, including Norman Powell who finished with 14 points off the bench.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Visit the Los Angeles Lakers on Thursday.\n\n\r\n              Clippers: Host the Toronto Raptors on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996553.258852
}