{
  "game_id": "0021800111",
  "espn_id": "401070792",
  "date": "Nov 01, 2018",
  "matchup": "CHA vs. OKC",
  "headline": "Thunder rally from 19 down in 3rd, top Hornets 111-107",
  "body": "CHARLOTTE, N.C. --  James Borrego wasn't upset Russell Westbrook put up 29 points, 10 assists and eight rebounds against his team Thursday night. He expected that from the seven-time All-Star.\n\nWhat bothered Charlotte's first-year coach is that Alex Abrines had 25 points on five 3-pointers and Dennis Schroder was able to get to the rim effectively and add 21 more, helping the Oklahoma Thunder overcame a 19-point deficit to beat Borrego's Hornets 111-107 for their third straight win.\n\nBorrego called it \"game plan errors.\"\n\nPaul George had a different explanation: that's just the way Westbrook impacts games. He called the seven-time All-Star \"one of the baddest dudes in the league.\"\n\nAbrines deflected praise for his big game to Westbrook, saying all he had to do was make open shots.\n\n\"The defense has two options -- come in and help and leave me open or stay attached to me and (Westbrook) is going to get layups,\" Abrines said. \"Sometimes you just stay in the corner and wait for the pass to come.\"\n\n\"Alex has to be ready to shoot the ball, he's a shooter and he knows how to play the game of basketball,\" Westbrook said.\n\nWestbrook did his part, hurting the Hornets in transition, with pull-up jumpers and in pick and rolls, a few of which resulted in highlight reel dunks. He also helped limit Kemba Walker to 21 points.\n\nThe Thunder made a concerted effort to slow down Walker, who came in averaging 30 points per game. Walker failed to make a field goal before the break and had just three points, although the Hornets still led 48-44 at halftime.\n\nWalker came to life in the third with 10 straight points to help the Hornets push their lead to 19.\n\nWestbrook led the Thunder back.\n\nWith 1:12 left, he drove and found an open Dennis Schroder with a crosscourt pass for an open 3-pointer. After a Charlotte miss, Westbrook used a screen from Steven Adams to get by Michael Kidd-Gilchrist for a layup to push the lead to 108-102. Westbrook punctuated the win with a ferocious dunk with 13 seconds left off a fast break before stopping to glare at the crowd.\n\nTIP INS\n\nThunder: Were 8 of 37 from 3-point range.\n\nHornets: Charlotte entered with 104 3-pointers, tied for the second most ever through eight games behind last season's Golden State Warriors (107). ... Marvin Williams now has 500 career blocks. ... Tony Parker went down hard on his left elbow but remained in the game. Borrego said he is fine.\n\nGEORGE'S DEAD FOOT\n\nGeorge had a rough night, shooting 4 of 20 from the field and finishing with 11 points. After the game, George revealed he's been dealing with a peroneal nerve palsy or \"dead foot.\"\n\n\"I am just trying to play through that,\" George said. \"It's nothing major or that is going to hurt me. It's just something that is going to come back when it feels right.\"\n\nSTRATEGY ON WALKER\n\nThunder coach Billy Donovan joked he wasn't giving away his strategy for slowing down Walker in the first half since they have to play the Hornets again.\n\n\"It was a collective team effort and we did a really good job,\" Donovan said. \"You have to do a good job in pick and roll coverage and you have to be persistent because he's really shifty. He looks like he is giving up on the play and you bail out and there he goes.\"\n\nSaid Walker: \"They were blitzing me the whole game, so I kind of got a few of my baskets early in the third in transition. But yeah everyone is switching now, but for the most part in the pick and roll they were blitzing me.\"\n\nWESTBROOK'S TECH\n\nWestbrook got a technical foul early for screaming \"and one\" after a driving layup after the foul wasn't called. He appeared not to like the call very much because on the next possession he split two Charlotte defenders and threw down a dunk.\n\nUP NEXT\n\nThunder:  Visit Washington on Friday night.\n\nHornets: Host Cleveland on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994436.496937
}