{
  "game_id": "0021600809",
  "espn_id": "400900214",
  "date": "Feb 11, 2017",
  "matchup": "MIL @ IND",
  "headline": "Giannis Antetokoumpo leads Bucks past Pacers, 116-110",
  "body": "INDIANAPOLIS --  Milwaukee's backups made all the difference against Indiana.\n\n\"Their spirit, their energy, you could see was extremely high,\" Bucks coach Jason Kidd said after the 116-110 victory Saturday night. \"I thought our bench was great, the starters were good, the ball was moving. It was a team effort and that's what it takes to win.\"\n\nGiannis Antetokoumpo had 20 points, 10 assists and eight rebounds to lead the Bucks, and the reserves combined for 55 points in Milwaukee's second straight road victory after losing seven in straight away from home last month.\n\nMirza Teletovic made five 3-pointers and had 19 points, and Malcolm Brogdon and Greg Monroe each added 17, and the Bucks won for just the third time in 15 games.\n\nC.J. Miles had six 3s and scored 23 points, and Monta Ellis and Myles Turner each had 18 points for the Pacers. They have dropped three straight after a season-best seven-game winning streak.\n\n\"I thought we just didn't have a motor for whatever reason,\" Pacers coach Nate McMillan said. \"They pretty much did whatever they wanted. We made a couple shots to get back in the game and then they made some plays to get that momentum back.\"\n\nAfter Indiana tied it at 62 early in the second half, the Bucks went on a 12-2 run and took a 74-64 lead on Monroe's dunk with 5:21 remaining in the third quarter.\n\nMiles then converted a 3-point play and Tony Snell made back-to-back 3-pointers to extend Milwaukee's lead again.\n\n\"\"We just stayed composed. We stuck with the game plan. We just had to keep fighting. Every team is going to make their run, especially at home, so we just kept playing.\"\n\nThe Pacers entered the game with the third-best home record in the Eastern Conference, and Saturday's loss was just the eighth all year. Now, after losing to Cleveland at home Wednesday, Indiana has lost consecutive home games for just the second time this season.\n\nIndiana opened the second half with a 10-0 run and tied it at 62 on Miles' 3-pointer with 9:13 to go in the third before Milwaukee pulled away again.\n\nIt was Indiana's second loss to the Bucks this season. Milwaukee beat the Pacers 125-107 back on Nov. 3. The two divisional opponents meet again March 10 before completing the four-game season series April 6.\n\nIt's been a tough stretch of the schedule for the Pacers going into the All-Star break next week. Three of their last four games were against teams either leading or second in their division standings. And coming up, Indiana will face division leaders in the next three games before the break, first against San Antonio before rematches with Cleveland and Washington.\n\nLONG RANGE ATTACK\n\nTeletovic made five 3-pointers and Snell, who finished with 13 points, made four 3s. Overall, the Bucks finished with a season-high 17 3-point field goals, which tied for the most allowed by the Pacers in a regulation game this season.\n\nTABLES TURNED\n\nIndiana entered the game No. 2 in the league in forced turnovers (15.5) and steals per game (8.6). Against Milwaukee, it was the Pacers who struggled to take care of the ball. They turned it over 14 times and forced the Bucks to just six. The Pacers also finished with just two steals.\n\nTIP-INS\n\nBucks: Monroe, who entered the game scoring 7.0 points a game, had nine in the first quarter. ... Roy Hibbert didn't play in his second trip to Indianapolis this season, where he played from 2008-15. He was in Indy for a game in December while playing for Charlotte before he was acquired by the Bucks in a trade this month.\n\nPacers: F Thaddeus Young was inactive, missing his fifth straight game with a sprained left wrist. ... Turner made 10 of 11 free throws and had six assists.\n\nUP NEXT\n\nBucks: Host the Detroit Pistons on Monday.\n\nPacers: Host the San Antonio Spurs on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995165.767043
}