{
  "game_id": "0022000666",
  "espn_id": "401307455",
  "date": "Mar 23, 2021",
  "matchup": "BKN @ POR",
  "headline": "Harden has 25 points, 17 assists, Nets beat Blazers 116-112",
  "body": "PORTLAND, Ore. -- — James Harden had 25 points and 17 assists to lead the Brooklyn Nets to a 116-112 victory over the Portland Trail Blazers on Tuesday night. \n\n\r\n                    Jeff Green finished with 20 points, 15 in the first half and a pair of free throws to close it out with 4.8 seconds left. Nicolas Claxton had 16 points and nine rebounds off the bench for Brooklyn, which played without Kevin Durant and Kyrie Irving. \n\n\r\n                    The Nets also were nearly without Harden, who said he was close to sitting out with a sore neck. But Harden, who has played more games than anyone in the NBA since entering the league in 2009 with 871, takes great pride in being available for his team.\n\n\r\n                    “That’s just who I am, that’s just how I’m built,” Harden said. “If this thing was done tomorrow, I know I gave everything I had. I know I didn’t shortcut at any point. It will be over one day but me in the back of my mind knowing, I have peace knowing I did that. I can live with that.”\n\n\r\n                    Enes Kanter had 19 points, 19 rebounds and six assists, while Damian Lillard had 22 points and nine assists for the Trail Blazers. Lillard and has backcourt partner McCollum had a tough night against the Nets, going to a combined 10 for 35 (28%) from the field. \n\n\r\n                    “I think both teams played real good basketball, both teams competed throughout the beginning of the game, throughout the whole fourth quarter. They just made some extra couple of shots end of the quarter,” Kanter said.\n\n\r\n                    The Nets held the Blazers to just 21 points in the fourth quarter and held Lillard scoreless in the final period. \n\n\r\n                    “Our sense of urgency and intensity on the defensive end has to be there, no question,” Harden said. “I’m proud of the guys in the fourth quarter, because that’s what won us the game. We have to have the intensity to be as great as we can be.”\n\n\r\n                     Kanter nearly had a double-double in the first quarter, with 13 points and eight rebounds to help Portland take a 41-37. Portland led 66-65 at halftime. \n\n\r\n                    Harden's pass to Claxton gave the Nets a 92-91 lead after three quarters. A layup by Blake Griffin, on Harden’s 13th assist, gave the Nets a 105-97 lead, forcing another Blazers timeout with 8:08 remaining. \n\n\r\n                    Back-to-back 3-pointers by Robert Covington cut the Brooklyn lead to 105-103. With the Nets leading 114-111, the Blazers successfully challenged a call to set up a jump ball at the center circle. \n\n\r\n                    Derrick Jones Jr. won the tip for Portland, which led to a Brooklyn foul against Covington with 7.8 seconds remaining. \n\n\r\n                    Covington missed the first but made the second, making it 114-112, before Green made his finishing free throws. \n\n\r\n                    TIP-INS\n\n\r\n                    Blazers: After suffering the worst home loss in franchise history on Sunday, the Blazers believe it was the product of a rare poor shooting night. “We’ve been a good shooting team all year. I think that was a little bit of an anomaly of Dame and CJ and (Carmelo Anthony) not making a 3. I think the offense will be better and that will help our defense.” ... The Blazers had two players removed from the lineup just before tip-off, with Anfernee Simons and Nassir Little both entering the league’s health and safety protocols. \n\n\r\n                    Nets: Durant, who has been out since Feb. 15 and has missed 18 games since Feb. 6, is closer to a return. Nets coach Steve Nash says that Durant is working out on the floor, but that he is in a “crucial” part of his rehabilitation that would not be improved by flying across the country. “He has to close that critical last stage of his rehab. He is on the court every day and looks great. But he’s making sure that strength is there. We need to make sure he’s coming back to play safely. If this was the playoffs, there’s a chance he would be back very soon. But there’s no point in taking a big risk at this point in the season.“ ... Harden was a game-time decision with a sore neck. “I would play Jesus tonight if I could,” Nash said before the game.\n\n\r\n                    BRINGING GRIFFIN ALONG\n\n\r\n                    Griffin played in his second game with the Nets. He remains on a minutes restriction, with Nash saying any increase in Griffin’s workload will be “very, very gradual.” \n\n\r\n                    “I definitely don’t want to get excited,” Nash said. “We have to remember he’s played one game in basically a month. He could play more minutes but I don’t want to jeopardize his long term health.” \n\n\r\n                    Griffin finished with eight points and five rebounds in 19 minutes. \n\n\r\n                    UP NEXT\n\n\r\n                    Blazers: Start a four-game Eastern Conference road trip against Miami on Thursday. \n\n\r\n                    Nets: Visit the Western Conference-leading Utah Jazz on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764997488.437857
}