{
  "game_id": "0021900058",
  "espn_id": "401160700",
  "date": "Oct 30, 2019",
  "matchup": "MIL @ BOS",
  "headline": "Walker scores 32 points, Celtics rally to beat Bucks 116-105",
  "body": "BOSTON --  The Bucks exploited gaps in the Celtics' defense on their way to beating Boston in five games last season in the Eastern Conference semifinals.\n\nThe Celtics used a balanced, barrage of offense to return the favor in their first matchup this season.\n\nKemba Walker had 21 of his 32 points in the second half and Boston rallied to beat Milwaukee 116-105 on Wednesday night.\n\nJayson Tatum added 25 points, Gordon Hayward had 21 points and 10 rebounds, and Marcus Smart finished with 19 points and six assists. Boston shot 54% from the field over the final two quarters.\n\n\"We've got so many talented guys on this team everybody should be chipping in to be the team we want to be,\" Tatum said.\n\nMilwaukee dominated in the first half, leading by 19 at one point. But the Celtics responded in the third quarter, using a 26-7 run over the final 6:38 of the period to take an 80-76 edge into the fourth.\n\n\"They got going pretty good,\" Bucks coach Mike Budenholzer said. \"Kemba's a great player, but they played through Hayward a little bit. Tatum made some big shots, tough shots. They mixed and matched well -- those three tonight.\"\n\nBoston kept that momentum, beginning the final period with an 11-4 run to open a 91-80 lead.\n\n\"I think it started on the defensive end,\" Hayward said. \"We kept getting stops, our energy picked up and that kind of turned it around for us in the second half.\"\n\nKhris Middleton led the Bucks with 26 points. Giannis Antetokounmpo had 22 points and 14 rebounds, but the reigning MVP lost his composure late, first picking up a hard foul on Smart and then a technical foul in the final minute.\n\nAntetokounmpo said there was no malicious intent on the play with Smart.\n\n\"Nothing,\" Antetokounmpo said. \"I tried to go for the rebound. He tried to go for the rebound. Two guys that play hard and we both ended up on the floor.\"\n\nThe Celtics started Daniel Theis at center and the defensive-minded Smart at guard with Jaylen Brown out with an illness and Enes Kanter sidelined for the third straight game with a bruised left knee.\n\nIt did little to stop the much bigger Bucks front line from getting in the paint early on as Milwaukee sliced through Boston's interior and hit nine 3-pointers on their way to a 58-42 halftime lead\n\nTIP-INS\n\nBucks: Antetokounmpo had his third straight double-double. ... Milwaukee had a 37-8 edge in bench scoring.\n\nCeltics: Walker, Tatum and Hayward were a combined 7 of 26 from the field in the first half.\n\nAIR MAIL\n\nAntetokounmpo airballed a pair of free throws with 1:46 left in the second quarter, igniting a chorus of cheers from the home crowd.\n\nBut Antetokounmpo, who entered the night shooting just 54 percent from the line, bounced back at the end of the half by connecting on all three of his free throw attempts after being fouled by Smart with one second to play.\n\nFIRST IMPRESSION\n\nOne of the memories that still stands out for Celtics coach Brad Stevens about serving as Eastern Conference All-Star Game coach in 2017 is what Antetokounmpo -- then a first-time All-Star -- told him before the game.\n\n\"I remember him telling me, `I'm going to play hard,\" Stevens recalled. \"I'm like, `You might be one of a few.' But that's the deal, right? He just plays really hard.\"\n\nAntetokounmpo finished with 30 points, six rebounds, three steals and a block that night.\n\nUP NEXT\n\nBucks: At Orlando on Friday night.\n\nCeltics: Host New York on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996185.223655
}