{
  "game_id": "401809996",
  "espn_id": "401809996",
  "date": "Oct 30, 2025",
  "matchup": "SA vs MIA",
  "headline": "Wembanyama leads Spurs to their first 5-0 start with 27 points and 18 rebounds in win over the Heat",
  "body": "SAN ANTONIO -- — Victor Wembanyama had 27 points, 18 rebounds, six assists and five blocked shots, and the San Antonio Spurs improved to 5-0 for the first time in franchise history by beating the Miami Heat 107-101 on Thursday night.\n\n\r\n              San Antonio won four straight to open a season on three previous occasions, most recently 2017. The Spurs, Heat and Sacramento Kings were the only franchises never to open a season 5-0. Miami couldn't prevent San Antonio from exiting that club despite a determined effort.\n\n\r\n              Bam Adebayo had 31 points, 10 rebounds and three assists for the Heat in a matchup of All-Star centers.\n\n\r\n              The Heat were without Norman Powell (strained groin), Tyler Herro (ankle), Kasparas Jakucionis (strained groin) and Nikola Jovic (bruised hip), but the depleted roster made a strong push in the fourth quarter before Miami's three-game winning streak was snapped.\n\n\r\n              The Heat had a 17-1 run in the first 4:35 of the final quarter, with Wembanyama’s second free throw the lone point. The Heat had a 29-20 scoring advantage in the final quarter but the Spurs closed the game on an 8-3 run to preserve their winning streak. \n\n\r\n              San Antonio had six players score in double figures, including 21 points from Stephon Castle. Castle added eight assists and six rebounds, and Devin Vassell added 17 points.\n\n\r\n              Wembanyama has had at least one block in 90 straight games, the fourth-longest streak in league history.\n\n\r\n              Wembanyama exhorted the fans to get out of their seats and cheer after he rose from the court following a foul by Andrew Wiggins with 14.6 seconds remaining in the game. The fans didn't need any persuading as they had already been standing to watch team history.\n\n\r\n              Up next\r\n              Heat: Visit the Los Angeles Lakers on Sunday.\n\n\r\n              Spurs: Visit Phoenix on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042531.3907058
}