{
  "game_id": "0022400559",
  "espn_id": "401705125",
  "date": "Jan 14, 2025",
  "matchup": "DEN @ DAL",
  "headline": "Jamal Murray scores 32 of his season-high 45 points in the 1st half as Nuggets beat Mavs 118-99",
  "body": "DALLAS -- — Jamal Murray scored 32 of his season-high 45 points in the first half and led the Denver Nuggets to a 118-99 victory over the Dallas Mavericks on Tuesday night.\n\n\r\n              Murray easily surpassed his previous season-best of 34 points, scored against Detroit on Dec. 28.\n\n\r\n              Murray shot 18 for 26 from the floor, including 5 of 9 from 3-point distance, and added six assists and two steals. He headed to the bench with just under four minutes remaining, five points shy of his career high of 50 points against Cleveland on Feb. 19, 2021.\n\n\r\n              Michael Porter Jr. scored 13 points and Nikola Jokic had 10 points and 14 rebounds in the win.\n\n\r\n              Kyrie Irving was back in the lineup after missing five games with a lumbar back sprain. He finished with 11 points on 4-for-18 shooting for Dallas. Daniel Gafford scored 13 points and Naji Marshall had 11.\n\n\r\n              Takeaways\r\n              Nuggets: Denver, which beat the Mavs by 11 on Sunday in Dallas, have won four straight and eight of their last 10. In each of the eight wins, Denver has won by 10 or more points. \n\n\r\n              Mavericks: Dallas absorbed its second-worst loss of the season. The 19-point loss was behind a 23-point setback to the Clippers on Dec. 19.\n\n\r\n              Key moment\r\n              Dallas' Dereck Lively II left the game with a right ankle sprain with eight minutes remaining in the first quarter and did not return. \n\n\r\n              Key stat\r\n              Jamal Murray was 12 of 15 from the field, including 4 of 6 from 3-point range, for 32 points in the first half. It’s the third-highest point total in the first half in the NBA this season.\n\n\r\n              Up next\r\n              Both teams play Wednesday. The Nuggets host the Houston Rockets, and the Mavericks are at the New Orleans Pelicans.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998256.908146
}