{
  "game_id": "0021701002",
  "espn_id": "400975748",
  "date": "Mar 12, 2018",
  "matchup": "MEM vs. MIL",
  "headline": "Middleton has 24, Bucks send Grizzlies to 18th straight loss",
  "body": "MEMPHIS, Tenn. --  Brandon Jennings feels a sense of urgency in trying to prove he belongs back in the NBA after signing a 10-day contract with the Milwaukee Bucks.\n\nJennings, who joined the team on Sunday, took a huge step in that direction Monday night, finishing with 16 points, 12 assists and eight rebounds as the Bucks sent Memphis to its 18th consecutive loss with a 121-103 victory.\n\n\"We wanted more,\" interim Bucks coach Joe Prunty said with a twinkle in his eye. \"He was very good. Obviously, the 12 assists were great. .Overall, a really positive night from him. A lot of things that were really good.\"\n\nKhris Middleton scored 24 points and Giannis Antetokounmpo added 20 for the Bucks, while Eric Bledsoe finished with 14 points, including a trio of baskets to stem a fourth-quarter Memphis rally. But it was Jennings, who last week was playing with the Bucks' G League team after playing in China earlier this year, who was the talk of the locker room.\n\nFor Jennings, there was some nervousness in returning to the NBA. He acknowledged he has finally recovered from what some thought was a career-ending left Achilles tendon injury suffered in 2015 when he was with the Detroit Pistons.\n\n\"I felt like it was my first rookie game again,\" said Jennings, who was the Bucks' first-round draft pick in 2009. \"Just to put on that jersey was a blessing, and I was just grateful.\"\n\nMarc Gasol led the Grizzlies with 17 points, while Jarell Martin, Dillon Brooks and Ben McLemore scored 16 apiece.\n\nJennings provided an early spark in the second quarter, scoring 11 points and handing out five assists in the period, helping the Bucks take a 64-50 lead into the break. The advantage would stretch to 19 for Milwaukee in the third. Although Memphis was able to pull within 97-91 near the midway point of the fourth, Bledsoe scored six of the Bucks' next eight points, then added an assist to Antetokounmpo, running the lead back to 12 with 4:09 left. That was enough of a buffer for the Bucks to claim their second straight win.\n\n\"We keep digging ourselves in a hole,\" Brooks said. \"We're going to make runs, and we keep making runs, 7-0 run, 8-0 run, 9-0 run, and they make a 5-0 run we we're back down 15. We can't create these holds and try to fill them up because it's too late.\"\n\nTIP-INS\n\nBucks: Middleton has reached double figures in 61 of 67 games this season and reached at least 20 points in 34 games. ... Shot 56 percent for the first half, including 53 percent from 3-point range. . The Bucks had 33 assists on 47 made field goals.\n\nGrizzlies: Hit nine of their first 10 shots. ... Have lost seven straight at home. ... Brooks entered the game averaging 21.3 points in the previous four games. ... Used its 27th starting lineup of the season. ... The 18-game losing streak is the longest during the Memphis era of the franchise. The Grizzlies moved from Vancouver in 2001.\n\nLONG OPENING NIGHT\n\nJennings said he expected to play 10, maybe 12 minutes. Instead, foul trouble had him on the floor for just under 24 minutes in his return. \"I was a little tired,\" he said. \"I kept telling (Bledsoe), `Don't foul. Stop fouling. I'm tired.' My nerves was running and everything like that. But it was good.\"\n\nFINAL WORD\n\nMemphis interim coach J.B. Bickerstaff on the 18-game losing streak: \"As professionals, our job is to show up every day and give our best effort. I don't think they need to be reminded of that. Through and through, they haven't laid down yet, and I don't expect them to.\"\n\nUP NEXT\n\nBucks: Visit the Orlando Magic on Wednesday night.\n\nGrizzlies: Host Chicago on Thursday in the middle of a three-game homestand.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992725.66684
}