{
  "game_id": "0022300335",
  "espn_id": "401584963",
  "date": "Dec 16, 2023",
  "matchup": "CHA vs. PHI",
  "headline": "Joel Embiid scores 42 points as 76ers hand Hornets worst loss in franchise history, 135-82",
  "body": "CHARLOTTE, N.C. -- — Joel Embiid scored 42 points and grabbed 15 rebounds, and the Philadelphia 76ers handed the injury-depleted Charlotte Hornets their worst loss in franchise history, 135-82 on Saturday night.\n\n\r\n              Tyrese Maxey added 21 points for the 76ers (18-7), who shot out quickly when Embiid outscored the Hornets by himself in the first quarter, built a 29-point halftime lead and were never challenged.\n\n\r\n              The 53-point drubbing topped the Hornets' previous largest loss, a 137-87 defeat to the Milwaukee Bucks on Jan. 10, 2000.\n\n\r\n              “I mean the overall story of the game would be more guys who didn’t play, than the guys that did,” Hornets coach Steve Clifford said.\n\n\r\n              Charlotte played without three starters in LaMelo Ball, Gordon Hayward and Mark Williams, two key reserves in P.J. Washington and Cody Martin, and then lost top scorer Terry Rozier in the third quarter when he caught an elbow to the nose.\n\n\r\n              Rozier, who averaged more than 28 points over the previous seven outings, was never ruled out, but did not return to the game. The injury is not believed to be serious and he did not need stitches.\n\n\r\n              Embiid set the tone early with 18 points and nine rebounds in the first quarter as the 76ers built a 33-17 lead en route to their sixth straight victory.\n\n\r\n              A fired-up Embiid scored at will on uncontested mid-range jumpers against Nick Richards, who allowed 10 easy points before heading to the bench with his second foul five minutes into the game.\n\n\r\n              Embiid said he was upset at the beginning of the game because of a foul call that didn't go his way. He used that as motivation the rest of the game.\n\n\r\n              “I was going to be aggressive anyway, but the fact that I didn't get (the call), I felt that I had to go harder and be more aggressive,\" Embiid said.\n\n\r\n              Maxey hit five 3-pointers in the second quarter and Embiid had 25 points and 10 rebounds at the break as the 76ers extended their lead to 73-44.\n\n\r\n              Embiid finally exited the game to chants of “MVP! MVP!” with 19.8 seconds left in the third quarter with the 76ers leading by 41. Embiid, who was 18 of 23 from the field, did not play in the fourth quarter.\n\n\r\n              “When he just brings the ball up the court and plays 1-on-1, there’s really not much you can do,” Clifford said. “He does it out of the flow. Centers are having to do something they normally don’t have to do (on defense). I feel like the only guy like that at all would be (Nikola) Jokic.”\n\n\r\n              Sixers coach Nick Nurse said he likes how Embiid is shooting the ball.\n\n\r\n              \"I just think he’s just really feeling confident about it,\" Nurse said. “Obviously, I love the rhythm he is taking it in. It hits his hands, it’s going up.”\n\n\r\n              Brandon Miller led the Hornets (7-17) with 14 points despite shooting 4 of 16 from the floor.\n\n\r\n              The Hornets are on the outside of the playoff picture looking in — and the road ahead is only going to get tougher.\n\n\r\n              Over the next eight games, Charlotte will face the defending NBA champion Denver Nuggets twice, as well as the Los Angeles Lakers, Indiana Pacers, Los Angeles Clippers, Phoenix Suns and Sacramento Kings. \n\n\r\n              “We have to get our guys back,” Clifford said. “This is a brutal stretch, the next two weeks. There are no easy weeks in this league, but if you look at the upcoming schedule it's going to be hard. And we're not sure when those guys will come back.”\n\n\r\n              The 76ers, who are tied for second place in the East, have a much easier schedule over the remainder of the calendar year and a chance to move up in the standings.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Chicago on Monday night.\n\n\r\n              Hornets: At Toronto on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995984.401191
}