{
  "game_id": "0021900369",
  "espn_id": "401161011",
  "date": "Dec 12, 2019",
  "matchup": "DET vs. DAL",
  "headline": "Doncic's triple-double lifts Mavs past Pistons in Mexico",
  "body": "MEXICO CITY --  Luka Doncic’s Spanish was flawless. His game was pretty good, too.\n\nDoncic scored 41 points and posted his eighth triple-double of the season, Seth Curry added a season-high 30 points off the bench and the Dallas Mavericks topped the Detroit Pistons 122-111 on Thursday night in the opener of the NBA Mexico Games.\n\nDoncic finished with 12 rebounds and 11 assists for the Mavericks, who at 17-7 are off to their best 24-game start since posting the same mark at this point of the 2014-15 season.\n\n“He picked us apart,\" Pistons coach Dwane Casey said.\n\nCurry scored 18 points in the second quarter alone for Dallas. The Mavericks trailed by seven late in the first half, then went on a 14-0 run before intermission and eventually led by as many as 24.\n\nCurry became the first Dallas reserve to score 30 off the bench since Jason Terry had 34 against San Antonio on Jan. 29, 2012.\n\n“Even when Detroit was playing zone, our guys were making an effort to drive-and-kick, drive-and-kick and find Seth ultimately for the shot,\" Mavericks coach Rick Carlisle said. “Real happy for him. He did everything. He drove it. He shot it. He made a couple good plays on the breaks. He made a couple good passes. He was a huge contributor tonight.\"\n\nDoncic’s eight triple-doubles already match his total from last season. Kristaps Porzingis added 20 points for the Mavericks, who outrebounded Detroit 52-34.\n\n“I think we're getting better and better every day,\" Doncic said. “He's going to get better. I'm going to get better. And with us two, the team is going to get way better.\"\n\nAndre Drummond led the Pistons with 23 points and 15 rebounds. Derrick Rose scored 19 points and Markieff Morris added 16 for Detroit, which got 12 from Tony Snell and 10 apiece from Christian Wood and Blake Griffin.\n\n“Back to the drawing board,\" Casey said. “Dallas is a great team. Rick's done a heck of a job with that team. But we missed a lot of shots that we normally make. And then defensively, I thought we missed a lot of rotations.\"\n\nIt was the 29th game in Mexico since 1992, the most of any country other than the U.S. or Canada in that span and came on a night where the NBA announced that Capitanes -- a Mexico City-based team in that country’s top pro league -- will be joining the G League starting next season.\n\n“Playing out here was incredible,\" Drummond said. “The atmosphere was outstanding.\"\n\nDoncic addressed the Mexico City crowd pregame -- to their delight -- in flawless Spanish, before turning the microphone over to Griffin. “Hola, Mexico,” was the extent of Griffin’s Spanish offering, as he grinned and a very amused Doncic looked on standing a few feet away.\n\nThe night didn't get much easier for Griffin from there: He shot just 3 for 16, and 1 for 10 from 3-point range.\n\nDoncic, meanwhile, went on to post his second 40-point triple-double of the season. He’s the first player in NBA history to have multiple 40-point triple-doubles before turning 21; he doesn’t celebrate that birthday until Feb. 28.\n\nTIP-INS\n\nMavericks: It was the third time Dallas played a regular-season game outside of the U.S. or Canada -- the Mavs played Houston in 1997-98 and Phoenix in 2016-17, both in Mexico City. ... NBA Commissioner Adam Silver misspoke before the game at a news conference, introducing deputy commissioner Mark Tatum as “Mark Cuban” -- the Mavs’ owner.\n\nPistons: Before Thursday, Detroit’s only other regular-season game outside of the U.S. or Canada was Jan. 17, 2013 -- a loss to New York in London. ... This was only Detroit’s second chance at a three-game winning streak so far this season. The Pistons had won two straight before losing to Milwaukee on Dec. 4, and had won two straight again before Thursday.\n\nAVOCADO WOES\n\nDrummond was a game-time decision because the Pistons said he had an allergic reaction to an avocado. He had swelling around his eyes Wednesday, but played as planned.\n\nSECOND GAME\n\nSan Antonio plays Phoenix in Mexico City on Saturday. It’ll count as a home game for the Suns. This is the first time that the NBA has brought four teams to the Mexico games.\n\nUP NEXT\n\nMavericks: Host Miami on Saturday.\n\nPistons: Visit Houston on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996293.543083
}