{
  "game_id": "0022200504",
  "espn_id": "401468659",
  "date": "Dec 26, 2022",
  "matchup": "CHA @ POR",
  "headline": "Nurkic rallies Blazers past Hornets on Lillard's big night",
  "body": "PORTLAND, Ore. -- — Jusuf Nurkic scored 27 points, including a career-high five 3-pointers, to go with 14 rebounds and six assists as the Portland Trail Blazers defeated the Charlotte Hornets 124-113 on Monday night. \n\n\r\n              Jerami Grant led all scorers with 32 points for Portland. Damian Lillard had 17 points and nine assists on a night when he was honored for becoming the leading scorer in Trail Blazers history.\n\n\r\n              “I don’t know how to describe it. It made me feel old a little bit,” Lillard said. “Just the appreciation from my teammates. I don’t big bro them even though a lot of them are much younger than me and probably grew up watching me in the NBA when they were in high school. But tonight to hear them say congratulations, it was almost admiration in their voice and respect. I knew it was there but tonight I felt it even more.” \n\n\r\n              Most of the crowd stuck around for the postgame ceremony, as well. \n\n\r\n              “Even from the crowd, them sticking around and clapping every 10 words. These are the people that have cheered me on all along,” Lillard said. “They’ve seen my first preseason game all the way up to this point. I was just sitting there thinking about it. I was just like, I’ve gone from a 21-year-old to a 32-year-old right in front of these peoples' eyes.”\n\n\r\n              LaMelo Ball paced the Hornets with 25 points. \n\n\r\n              Portland trailed by 14 in the second quarter but Nurkic sparked the turnaround, finishing with 21 points, 10 rebounds and four assists after halftime.\n\n\r\n              “He had 20-10 in the second half,” Blazers coach Chauncey Billups said. “It was impressive. Obviously, he had the 3-ball going, but he got every rebound in his area. Defensively he was good. He had a night.”\n\n\r\n              Nurkic hit his career-best fourth 3 with 8:55 left to give the Trail Blazers a 108-99 lead that Portland pushed as high as 15 before it was over. \n\n\r\n              \"Nurk Fever,” Lillard said. \n\n\r\n              Grant’s dunk with 1:42 remaining in the second quarter ignited the Blazers and their crowd, helping them close the first half on an 8-2 spurt. \n\n\r\n              Charlotte led 67-61 at halftime. \n\n\r\n              A 3-pointer by Nurkic tied it at 67, the first tie since the first quarter. A layup by Josh Hart put Portland up 72-70, prompting a Hornets timeout early in the third period. \n\n\r\n              “They played all zone,” Charlotte coach Steve Clifford said of Portland’s second-half surge. “It was one of the differences. We scored 28 (third-quarter points) but we couldn’t stop them. They kept running. They ran out of their zone and they changed the game.” \n\n\r\n              Portland led by 13 in the third, but a pair of 3s by Ball to close the quarter cut it to 101-95 heading into the fourth.\n\n\r\n              LILLARD HONORED\n\n\r\n              It was Portland’s first home game since Lillard surpassed Clyde Drexler as the leading scorer in team history. Lillard was saluted with a standing ovation in the first quarter, as well as video messages from former teammates, coaches and current NBA players, including Stephen Curry and Kevin Durant. The Trail Blazers held a ceremony for Lillard on the court after the game. \n\n\r\n              TIP-INS\n\n\r\n              Hornets: A replay challenge by Clifford took two points off the board for Portland with 3:36 left. ... Charlotte took advantage of eight Blazers turnovers in the first quarter to build a 34-30 lead. ... Reserve big man Nick Richards missed his first game of the season. While the Hornets are without a key piece, they’re thankful he’s not out for longer. “Right after the game, it looked like it could be longer,” Clifford said. “I think actually they feel good about that. I don’t know day to day, but I do think he’s making good progress.” ... Clifford also said guard Dennis Smith Jr. has been practicing with contact, but added he didn’t know an exact date for his return. \n\n\r\n              Trail Blazers: Nurkic also had two steals and two blocks. ... Justise Winslow will be sidelined for two weeks with an ankle sprain. Winslow was injured last week in a loss to Oklahoma City. “He does so much for us on both sides of the floor,” Billups said. “It (stinks) to lose him for that amount of time. I think we all feel a little relieved because it could have been worse.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host the Golden State Warriors on Tuesday night.\n\n\r\n              Trail Blazers: Visit the Warriors on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994275.215086
}