{
  "game_id": "0021601059",
  "espn_id": "400900454",
  "date": "Mar 22, 2017",
  "matchup": "CHA @ ORL",
  "headline": "Hornets rally in the fourth quarter for 109-102 win",
  "body": "ORLANDO, Fla. --  The Charlotte Hornets aren't sure they have enough time to climb into the Eastern Conference playoff picture, but the feeling is whatever chance they have is giving them purpose down the stretch.\n\nThe Hornets certainly looked the part of a team on a mission Wednesday night as they fought back from an early fourth-quarter deficit to defeat Orlando 109-102 for their third straight victory. Charlotte also swept the four-game season series with the Magic.\n\n\"It just gives us a chance, it gives us a reason to keep fighting,\" said Charlotte guard Kemba Walker, who finished with 22 points and seven assists. \"A lot of teams are not in the same position as us.\"\n\nThe Hornets (32-39) entered the night in 11th place in the Eastern Conference standings but just three games out of eighth place. It will be difficult to make up that much ground with just 11 regular season games to go.\n\n\"I think when you get to these 15 or 16 games they know what we are playing for,\" Charlotte coach Steve Clifford said.\n\nCharlotte played like a team fighting for a playoff berth as it came back from a 10-point deficit with torrid run that began late in third and continued into the fourth as it took over the lead. The Hornets' bench played a huge role in the comeback with Frank Kaminsky coming in to score 13 of his 18 points in the fourth quarter.\n\nDuring a key 5-minute stretch late in the fourth quarter Kaminsky scored 11 points, knocking down three 3-pointers, to help the Hornets outscore Orlando 20-10 to rally and take a nine-point lead with 2:14 remaining in the game.\n\n\"I just kept shooting the same shots I was getting the whole game and they went in,\" said Kaminsky, who was 6 of 13 from the field and 4 of 7 from behind the 3-point arc.\n\n\"That was difference.\"\n\nIn addition to Kaminsky, the Hornets also got major points on the bench from Marco Belinelli, who finished with 20 points after a big first half in which he hit three of four 3-point attempts. Charlotte's bench outscored the Magic's 46-32.\n\n\"They held it down for us, even in the second half they brought the game right back and tied it up,\" Walker said of the bench. \"We were able to go into the game and finish it off.\"\n\nIt was another frustrating night for the Magic, who seemed to run out of energy in the fourth quarter when they were outscored 32-20 after ending the third quarter with a five-point lead.\n\n\"I do think we played well,\" said Orlando coach Frank Vogel, whose team's slim playoff chances continue to fade as the Magic fell to 26-46. \"It's the best game we played against these guys, but you've got to make plays down the stretch.\"\n\nTIP-INS\n\nHornets: Kaminsky came into Wednesday night's game averaging 16 points in the previous three games since returning from a shoulder injury. ... Walker has pushed his career-high average to 22.7 per game this season, which ranks him No. 2 in Hornets history in per game average.\n\nMagic: After Wednesday night's 14 points and 12 rebounds, Nikola Vucevic has recorded a team-high 32 double-doubles and has 190 in his career. ... Reserve power forward Jeff Green did not suit up Wednesday night due back spasms.\n\nRESERVE UNIT\n\nCharlotte's bench has had its problems this season but with Kaminsky back healthy after missing five games with a shoulder injury, that has changed the last few games.\n\nAgainst the Magic, it was the reserves led by Belinelli that cut the 10-point deficit in half in the second quarter. Then in the fourth, Kaminsky led the comeback that ultimately led to the win.\n\nUP NEXT\n\nHornets: Charlotte returns home to take on the Eastern Conference-leading Cleveland Cavaliers on Friday. The Cavs are 3-0 against the Hornets this season.\n\nMagic: Orlando finishes a three-game home stand against Detroit on Friday night. The Magic and Pistons are 1-1 on the season.",
  "source": "espn_api",
  "crawled_at": 1764995469.5290592
}