{
  "game_id": "0022000501",
  "espn_id": "401267661",
  "date": "Feb 25, 2021",
  "matchup": "MEM vs. LAC",
  "headline": "Tyus Jones, defense lead Grizzlies past Clippers, 122-94",
  "body": "MEMPHIS, Tenn. -- — The Memphis Grizzlies clamped down on the Los Angeles Clippers.\n\n\r\n                    Tyus Jones scored a career-high 20 points, Memphis slowed Kawhi Leonard and Paul George and the Grizzlies beat the Clippers 122-94 on Thursday night.\n\n\r\n                    Dillon Brooks finished with 19 points for Memphis, and Jonas Valanciunas and Ja Morant had 16 each, with Valanciunas adding 15 rebounds. Jones was 9 of 11 from the floor, including 2 of 3 from outside the arc.\n\n\r\n                    Leonard scored 17 points, and George and Serge Ibaka had 13 points each, although George was stymied by a 3-for-12 shooting night, part of the Clippers connecting on 41%.\n\n\r\n                    The Clippers were held to 12 of 34 (35.3%) shooting from outside the arc, below their 42% for the season.\n\n\r\n                    “Just urgency to defend the 3-point line,” Memphis coach Taylor Jenkins said about the defense. “That’s been something that has come in waves with our group over the course of the season.\n\n\r\n                    “ying to deter catch-and-shoot 3s. Teams are still going to shoot it at a high rate. They still got 34 off, but we can upset those a little bit more.”\n\n\r\n                    The teams will complete the two-game set Friday night at FedExForum. \n\n\r\n                    “Absolutely,” Clippers forward Paul George said when asked if it helped ease the loss by playing the same team the next night, later adding: “They got stops. They shrunk the floor on defense. It’s a young team. You can’t give a young team life to play in transition. They got out. They ran the floor. They just showed their athleticism.”\n\n\r\n                    The Grizzlies, who lead the league in points in the paint, concentrated on that factor in the first half to build a lead, then carried it through the game finishing with 72 paint points.\n\n\r\n                    Leonard said the Grizzlies post play and passing to their bigs was a major factor.\n\n\r\n                    “You’ve got to give them credit,” Leonard said.\n\n\r\n                    While the Clippers are one of the strongest teams in the third quarter, it was Memphis that extended its lead to 17 in the third as the Grizzlies continued to shoot above 55%.\n\n\r\n                    Memphis managed to hold off a couple of pushes from the Clippers and take an 89-75 lead into the third.\n\n\r\n                    When the Clippers cut it to 92-83 with 10 minutes left, Memphis rattled off a 12-2 run for a 104-85 advantage with 6:27 left.\n\n\r\n                    “I feel like our energy was there,” Morant said. “I feel like we were all locked in and out there competing. I feel like our talk was very high level. We knew our teammates had our back while guarding the ball. That led to some stops and we were able to get out and run.”\n\n\r\n                    ASSISTS VS. POINTS\n\n\r\n                    Earlier this season, Jones recorded a career-high in assists with 14 against San Antonio. Now he has added a career-high 20 points. Asked which was better, the reserve guard replied: “That’s tough. Personally, the assists. I’m a team guy. I think anyone will tell you that.” Morant said it is just Jones’ make-up. “I feel like we need that from Tyus every game, but he’s a smart player. He knows when to attack and he’s aggressive and he knows to look for his teammates. Smart point guard.”\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: After shuffling through 12 different lineups for various reasons, Los Angeles has returned to the Patrick Beverley-George-Leonard-Nicolas Batum-Ibaka starters the last four games. …Missed their first eight 3-point attempts. …Entered the night with eight games of shooting at least 50% from 3. …Reggie Jackson had 12 points off the Los Angeles bench.\n\n\r\n                    Grizzlies: Had 42 points in the paint at halftime marking the 76th consecutive game where they have reached at least 40 paint points, the longest streak on record since the NBA began tracking play-by-play data in 1996-97. …Jones’ previous high was 19 points against Dallas on Feb. 5, 2020. …Jones became the 10th different player to lead the team in scoring this season. … Brooks returned to the starting lineup after missing three games with right thigh soreness. …The Grizzlies, who were held to 15 and 13 points in the first quarter the last two games, scored 24 in the opening frame. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996963.246434
}