{
  "game_id": "0022301111",
  "espn_id": "401585739",
  "date": "Apr 04, 2024",
  "matchup": "MIA vs. PHI",
  "headline": "Maxey scores 37, Embiid has 29 and Philadelphia rallies past Miami 109-105 to tighten East race",
  "body": "MIAMI -- — Philadelphia opened a big lead, wasted it all, opened another big lead, wasted that one as well, then found itself in trouble midway through the fourth quarter.\n\n\r\n              No problem. The 76ers had one last run in them — and it was the only one that mattered.\n\n\r\n              Tyrese Maxey scored 37 points, Joel Embiid added 29 and the 76ers topped the Miami Heat 109-105 on Thursday night to tighten the already-muddled race in the Eastern Conference for the last guaranteed playoff spot.\n\n\r\n              “It was a super-competitive game,” 76ers coach Nick Nurse said. “Always is. I think it's always an intense, physical, lots-of-energy-expended by everybody that's out there. And it was really going back and forth. Big run by us, big run by them, really back and forth.”\n\n\r\n              That's an understatement. A 15-3 run by Philly ended it, on a night that was really nothing but wild runs by either side.\n\n\r\n              — The 76ers started the game on a 17-2 spurt.\n\n\r\n              — Miami took the lead later in the first half after a 25-6 run.\n\n\r\n              — The 76ers came right back with a 20-1 burst.\n\n\r\n              — The Heat went on a 17-0 run midway through the second half, and led by eight with 6:28 left.\n\n\r\n              “We're right next to each other in the standings so that’s what games are going to be like — back and forth, back and forth, back and forth,” Heat coach Erik Spoelstra said. “We'll go on a run, they'll go on a run, it just keeps on going that way and they made the final run.”\n\n\r\n              Maxey was one rebound shy of a triple-double, finishing with 11 assists and nine boards for Philadelphia. Kelly Oubre Jr. scored 18 points for the 76ers, who moved within a half-game of Miami for No. 7 in the East.\n\n\r\n              “Every game matters,” Maxey said. “Every game is a playoff game at this point. Honestly, we’re like in a March Madness situation. You know, every game is not an elimination game, but every game is important.”\n\n\r\n              Terry Rozier scored 22 points before appearing to be dealing with some knee pain in the final moments and Jimmy Butler added 20 for Miami, which entered the night No. 6 in the East but ceded that spot back to Indiana. Bam Adebayo had 14, Haywood Highsmith scored 12, Kevin Love had 11 points and 16 rebounds off the bench and Nikola Jovic added 11 points for Miami.\n\n\r\n              Embiid, in his second game back after missing two months following surgery on the meniscus in his left knee, shot 11 for 25, and the 76ers were outscored by 19 points in his 32-plus minutes.\n\n\r\n              Embiid checked out with 7:33 remaining and the Heat leading 100-93. It only seemed like the 76ers were in trouble.\n\n\r\n              By the time Embiid returned, Philadelphia had the lead for good. Oubre hit a corner 3-pointer with 3:30 left to put Philly back on top. Rozier hit a 3-pointer to get Miami within two, Butler missed what would have been a go-ahead 3 with 5.2 seconds left, and the 76ers escaped on a night when Miami could have taken a big step toward escaping the play-in tournament.\n\n\r\n              “There's no time for emotion right now,” Adebayo said. “We've got a game tomorrow, so on to the next, focus on that.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit Memphis on Saturday.\n\n\r\n              Heat: Visit Houston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995326.1652339
}