{
  "game_id": "0021800125",
  "espn_id": "401070806",
  "date": "Nov 03, 2018",
  "matchup": "DET @ PHI",
  "headline": "Embiid scores 39 points in Philadelphia's win over Detroit",
  "body": "PHILADELPHIA --  Philadelphia star big man Joel Embiid revels in the chances to go against Detroit center Andre Drummond. And Embiid doesn't stop going at Drummond when the game is over.\n\nEmbiid scored 32 of his 39 points in a dominating first half and had 17 rebounds and then let Drummond know about it afterward, leading the 76ers to a 109-99 victory over the Pistons on Saturday.\n\nEmbiid made 10 of 18 field goals and 18 of 23 free throws to help Philadelphia improve to 6-0 at home.\n\nDrummond and Embiid have butted heads throughout their careers, with Embiid recently saying he \"owns real estate\" in Drummond's head after Detroit's big man was ejected in the Pistons' 133-132 overtime victory on Oct. 23.\n\n\"He's a fun matchup,\" Embiid said. \"I feel like I dominate every game, especially against him.\"\n\nPistons coach Dwane Casey and Drummond questioned the officiating. Drummond and backup center Zaza Pachulia were in foul trouble early trying to guard Embiid, and the teams combined for 63 fouls and 92 free-throw attempts.\n\n\"I don't understand how the game was being called,\" Casey said.\n\nSaid Drummond, \"It's like you have to play with your hands behind your back; you can't really touch nobody. That's the way they're calling the game right now. I have to figure a way to adjust. It's hard to play like that.\"\n\nEmbiid's first-half numbers were astounding. He made 8 of 9 shots, including his only 3-point attempt, and 15 of 17 free-throw attempts with eight rebounds and two blocks in 17 minutes in a one-sided duel with Drummond.\n\nDrummond went scoreless in four foul-plagued minutes in the opening half and finished with eight points and nine rebounds in 21 minutes.\n\nEmbiid went right at Drummond early on Saturday, drawing a foul just 1:24 into the contest and then a second on Drummond 1:16 later. The Philadelphia big man held up two fingers after that one, letting everyone know Drummond had picked up his second, and Drummond exited to the bench for Pachulia.\n\nPachulia was no match for Embiid either, drawing four fouls in 10 first-half minutes.\n\nThe 76ers' lead grew to as many as 24 points, 58-34, when rookie Landry Shamet converted a three-point play after draining a 13-foot jumper and the ensuing free throw.\n\nThe Pistons scored the first 13 points of the second half over 3:55 as Philadelphia went 0-for-5 with three turnovers to start the third period. That surge cut Detroit's deficit to nine, 69-60, but the 76ers' advantage built up in the opening 24 minutes proved to be too great.\n\nDetroit got as close as down five with 4:48 remaining before an Embiid layup and J.J. Redick 3-pointer pushed the lead to a comfortable 10 points.\n\nSECOND-HALF SURGE\n\nCasey said the Pistons have to start contests like they began the second half on Saturday.\n\n\"Our starts have been atrocious,\" Casey said. \"If we come out at the start of the game like the second half, we're a pretty good team. I loved our defensive effort in the second half.\n\nSECOND-HALF SLIDE\n\nAfter shooting 53 percent from the field (19-for-36), including 43 percent from the arc (6-for-14) in the opening 24 minutes, Philadelphia slipped to 27 percent (9-for-33) and 20 percent (3-for-15), respectively, after halftime.\n\nTIP-INS\n\nPistons: Guards Reggie Bullock (ankle) and Luke Kennard (shoulder) did not play. . Langston Galloway, who starred collegiately at nearby Saint Joseph's University, had 13 points off the bench. . Griffin had a career-high 50 points in the Oct. 23 win.\n\n76ers: Embiid had 41 points in Philadelphia's 122-113 win over the Clippers on Thursday. ... Director M. Night Shyamalan was in attendance as were Philadelphia Eagles TE Zach Ertz and WR Alshon Jeffery. ... F Wilson Chandler made his debut, going scoreless with four rebounds in 10 minutes. Chandler missed the first nine games with a hamstring injury. ... Simmons didn't play in the Oct. 23 loss due to back tightness.\n\nUP NEXT\n\nPistons: Host Miami Monday.\n\n76ers: At Brooklyn Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994717.7180731
}