{
  "game_id": "0022000452",
  "espn_id": "401267612",
  "date": "Feb 19, 2021",
  "matchup": "MEM vs. DET",
  "headline": "Morant leads Grizzlies in late rally to defeat Detroit",
  "body": "MEMPHIS, Tenn. -- — Ja Morant scored 21 of his 29 points in the second half, Jonas Valanciunas added 17 points and 15 rebounds and the Memphis Grizzlies rallied for a 109-95 victory over the Detroit Pistons on Friday night.\n\n\r\n                    Kyle Anderson added 16 for Memphis as the Grizzlies won their second straight.\n\n\r\n                    “He’s able to see what’s kind of going on in the first three quarters,” forward Brandon Clarke said about Morant. “The fourth quarter, he can kind of read it. By the time Ja gets there in the fourth quarter, he pretty much knows what the defense is trying to do to guard him.”\n\n\r\n                    Jerami Grant and Delon Wright led the Pistons with 16 points each, while Josh Jackson added 15. Rookie Saddiq Bey finished with 14 points for Detroit. \n\n\r\n                    Grant, coming off a 43-point performance in Wednesday’s loss to Chicago, made only one of his eight shots in the first half and was 5 of 20 in the game, including 2 of 10 from outside the arc.\n\n\r\n                    Morant’s scoring pulled Memphis away in the third when Detroit made a run. Then the Grizzlies shut down the Detroit offense in the fourth, keeping the Pistons from scoring a field goal over six minutes after Detroit pulled to 90-89 with 6:26 left.\n\n\r\n                    Part of the problem throughout the game was the Pistons inability to hold on to the ball. Detroit committed 21 turnovers in various ways from bad passes to offensive fouls to throwing the ball into the stands. \n\n\r\n                    “You can’t turn the ball over 21 times for 24 points,” Pistons coach Dwane Casey said. “As much as we were soft in the first half defensively, the second half, it was mostly our offensive turnovers.”\n\n\r\n                    Part of that came when Wright left the game in the fourth quarter with a right groin injury. That led to more disorganization on the offensive end for Detroit. When the Pistons got within 90-89 in the fourth, the turnovers cost them a chance to overtake Memphis.\n\n\r\n                    “It was huge because he was playing well,” Casey said about Wright’s injury. “Offensively, he got us into stuff, was making plays, making shots. That did slow us down a little bit.”\n\n\r\n                    Memphis benefitted from a poor-shooting first quarter by the Pistons and eventually built the lead to 21 points before settling in for a 53-42 lead at the half.\n\n\r\n                    The Grizzlies were working inside with Valanciunas and controlling the paint with drives to the basket. Memphis would finish the night with 66 paint points.\n\n\r\n                    “Our team is really good at getting to the paint and finishing,” said Clarke, who finished with 12 points and seven rebounds.\n\n\r\n                    Wright’s 4-of-5 shooting, including a trio of 3-pointers, helped keep the Pistons hopes alive at the half.\n\n\r\n                    The optimism got higher as Detroit converted a quartet of 3-pointers to open the second half. But Memphis, led by Morant’s 13 points in the third helped the Grizzlies lead 84-73 heading to the fourth.\n\n\r\n                    “I felt like I missed some shots. Got to be better from behind the arc,” Morant said, adding: “Even though I was plus-14, I give myself a 6.5 on tonight’s performance. I’ve got to be better.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Shot only 29% in the first quarter, while scoring 17 points. …Entered the game first in NBA in bench scoring at 41.6, but managed only 29 against Memphis. …Grant has reached double-figure scoring in all but two games this season. … Have lost eight of the last 10 games in Memphis. … F Sekou Doumbouya played after missing the past three games under concussion protocol. …Are now 1-16 when trailing after three quarters.\n\n\r\n                    Grizzlies: After having no fans for Wednesday’s game against Oklahoma City because of inclement weather, a limited number of spectators were allowed to attend Friday’s game. …G/F Dillon Brooks sat out with right thigh soreness. G De’Anthony Melton returned after missing six games with left shoulder soreness. … G Desmond Bane returned after missing the previous four games because of the death of a relative. He scored 10 points. …Valanciunas recorded his 14th double-double of the season.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Travel to Orlando to face the Magic on Sunday.\n\n\r\n                    Grizzlies: Close a four-game homestand facing Phoenix on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997614.989762
}