{
  "game_id": "0021800408",
  "espn_id": "401071089",
  "date": "Dec 12, 2018",
  "matchup": "BKN @ PHI",
  "headline": "Dinwiddie scores career-best 39, Nets top 76ers 127-124",
  "body": "PHILADELPHIA --  Spencer Dinwiddie put on his best Stephen Curry impersonation.\n\nDinwiddie scored a career-high 39 points off the bench and Allen Crabbe had 20 to lead the Brooklyn Nets to a 127-124 victory over the Philadelphia 76ers on Wednesday night.\n\n\"If I had two 3s in a row, I feel like Steph,\" Dinwiddie said. \"I wasn't about to stop shooting after that. I don't know if I was in a zone, but if I hit two in a row, I'm hot and they know it.\"\n\nJoel Embiid had 33 points and 17 rebounds and Ben Simmons scored 22 for Philadelphia, which played without Jimmy Butler because of a strained groin.\n\nIt was Brooklyn's second victory over Philadelphia (19-10) in three meetings. Dinwiddie had 31 in a 25-point win over Philadelphia last month.\n\n\"We seem to make every guard look like a freakin' Hall of Famer,\" Embiid said.\n\nDown 11 in the fourth quarter, the Sixers closed to 111-105 on Embiid's free throws and a 3-pointer with 3:24 left. Dinwiddie's basket extended the lead to 115-105.\n\nLandry Shamet hit consecutive 3s in the final minute to cut Brooklyn's lead to 123-118 with 22.9 seconds left. The Nets (11-18) got a pair of free throws from Dinwiddie before Shamet nailed another 3. But Dinwiddie made two more free throws to ice Brooklyn's third consecutive win.\n\n\"It's just so evident, you can't take him out and he's playing great basketball,\" Nets coach Kenny Atkinson said of Dinwiddie. \"Obviously, he's our engine right now, especially in the second half.  All the work he's done, he's come a long way. He deserves it.\"\n\nThe Nets outscored the Sixers 19-3 over a 4 1/2- minute stretch in the third quarter to build an 87-75 lead. Dinwiddie had 12 of those points for Brooklyn, including a pair of 3-pointers.\n\n\"I think when you look at the bench scoring, we got hurt there,\" Sixers coach Brett Brown said. \"I give Brooklyn a lot of credit. I think that they are a good team to begin with. I do not feel like their record reflects how good they are. I especially know that no matter what their record said, we struggle with that type of team and we did tonight. It doesn't discount for me that we do struggle with that type of team.\"\n\nA 10-2 run gave the Nets a 49-41 lead in the second quarter, but the Sixers closed to 57-56 at halftime.\n\nT.J. McConnell's alley-oop lob to Simmons for a one-handed dunk highlighted Philadelphia's second-quarter comeback that was capped by Embiid's long 3-pointer.\n\nUNDERMANNED SIXERS\n\nMissing Butler and Mike Muscala hurt Philadelphia, especially with its communication.\n\n\"You get used to a guy being there and then two guys are out that you're used to having in there,\" Simmons said. \"Just means that the other guys need to step up and fill that role, whether it's coming in on defense and rebounding. Could be little things, but I think everybody just needs to be accountable; myself and everybody.\"\n\nTIP-INS\n\nNets: Dinwiddie's previous career high was 31. He did it twice, including in a 25-point win over Philadelphia last month. Dinwiddie shot 11 of 18, including 4 of 6 from beyond the arc.  ... Joe Harris had 14 points.\n\n76ers: Muscala was out of the lineup because of an upper respiratory infection. ... Furkan Korkmaz made his first career start in Muscala's absence and tied his career best with 18 points. ... Butler hit a winning 3-pointer to beat the Nets 127-125 on Nov. 25.\n\nUP NEXT\n\nNets: Host Washington on Friday night.\n\n76ers: Host Indiana on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995420.168385
}