{
  "game_id": "0021601074",
  "espn_id": "400900469",
  "date": "Mar 24, 2017",
  "matchup": "ORL vs. DET",
  "headline": "Payton's triple-double helps Magic rout Pistons 115-87",
  "body": "ORLANDO, Fla. --  The late-season shift to a smaller and quicker lineup has seemed to benefit all of the remaining Orlando Magic players, especially Elfrid Payton.\n\nThe third-year player has been on an impressive run since Frank Vogel made the change to small ball just before All-Star break, and his latest impressive performance further damaged Detroit's playoff hopes.\n\nPayton continued his impressive run Friday night with 14 points, 11 rebounds and 10 assists -- his fourth triple-double in the last 10 games and seventh of his career -- in helping the Magic rout the slumping Pistons 115-87.\n\n\"He was scoring the ball on one-on-one plays in the paint, trusting the pass and he is doing a good job of creating and obviously the rebounding is about hustle,\" Vogel said. \"He was terrific tonight and he is on a good run right now, a good rhythm the last three, four or five weeks or so.\"\n\nPayton says the shift in style of play, which was triggered when the Magic traded Serge Ibaka to the Toronto Raptors for guard Terrence Ross, has been good for the entire team and should the Magic well going into next season.\n\n\"I think it benefits everyone in the locker room and it's starting to show,\" Payton said.\n\nThe Magic turned in what was easily their best and most dominant performance of the season as they moved the ball well and consistently made the extra pass for the best shot. Ross led all scorers with 18 points on the strength of 5-of-6 shooting from 3-point range. But all five starters scored in double figures on a night when the team shot nearly 52 percent from the field and 46 percent from 3-point range while finishing 36 assists on 47 field goals for the night.\n\n\"This was our best win of the year, our most complete game,\" said Vogel, whose team has won three of its last four. \"It's important that these young guys learn to play the right way and that we find some chemistry within our group here going into next year. How we finish is important.\"\n\nAs an impressive of a win as it was for the Magic, it was an even more deflating loss for the Pistons. Detroit is fighting for an Eastern Conference playoff berth and entered the night just one game out of eighth place.\n\nBut the Piston played without much of a sense of urgency as the trailed throughout the game and fell behind by as many as 33 points. Tobias Harris was the lone starter to score double figures as Detroit lost its third straight game and sixth of its last seven.\n\n\"I don't know,\" Detroit coach Stan Van Gundy said when asked if his team has given up. \"You'd have to ask them.\"\n\nTIP-INS\n\nPistons: Ish Smith started ahead of Jackson at point guard for the second straight game. ... Marcus Morris was 1 for 7 from the field and had just four points in the first half. ...Detroit shot just 28.6 percent from the field in the first quarter.\n\nMagic: Jeff Green missed his second straight game due to back spasms. ... When the Magic took a 90-60 lead on Mario Hezonja's two free throws with 1:46 left in the third quarter, they surpassed their biggest lead of an opponent this season, which was 29.\n\nBOTTOMING OUT\n\nFor a team that is trying to make playoff run, the last three losses are particularly trouble to the Pistons. They've lost three in a row to three teams on the outside of the top eight seeds in the East, including Chicago and last-place Brooklyn.\n\n\"These last three games we played the bottom half of the league, games where we don't have to play that many guys and be able to compete,\" said Marcus Morris. \"But we are playing everybody and getting the (crap) beat out of us.\"\n\nUP NEXT\n\nPistons: Detroit takes on the New York Knicks at Madison Square Garden on Monday.\n\nMagic: Orlando hits the road to take on the Toronto Raptors at Air Canada Centre on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995815.5479412
}