{
  "game_id": "0021801119",
  "espn_id": "401071792",
  "date": "Mar 27, 2019",
  "matchup": "OKC vs. IND",
  "headline": "OKC rallies vs. Indy on NBA season-best 24-0 run",
  "body": "OKLAHOMA CITY -- Paul George wasn't interested in losing to his former team again.\nOklahoma City's All-Star forward scored seven of his 31 points during a decisive 24-0 run, and the Thunder beat the Indiana Pacers 107-99 on Wednesday night.\nThe Thunder slogged through the first half and trailed by nine at the break. By the end of the third quarter, they led 76-69.\n\"We knew it wasn't enough coming into the half,\" George said. \"We needed to change things, and we came out and executed.\"\nSteven Adams had 25 points and 12 rebounds for the Thunder, and Russell Westbrook added 17 points, 12 assists and 11 rebounds for his 29th triple-double of the season.\nIt was a reversal of the previous matchup, when Indiana rallied at home to stun Oklahoma City 108-106 on March 14.\nThis time, the Pacers scored at 10:48 of the third quarter and didn't score again until the 3:57 mark. They missed 14 consecutive shots during that 24-0 burst by Oklahoma City, the longest run without a point allowed in the NBA this season, according to ESPN Stats & Information research.\n\"That was the game,\" Pacers coach Nate McMillan said. \"We knew they were going to come out aggressive. Paul and Westbrook came out aggressive, attacking the basket, scoring. They made their run and were able to get the momentum and just really take control of the game.\"\nIt was a critical win for the Thunder, who had lost five of six.\nBojan Bogdanovic scored 28 points, and Domantas Sabonis added 18 points and 10 rebounds for the Pacers.\nIndiana led 54-45 at the break behind 14 points from Bogdanovic.\nAdams scored 14 points in the first half for the Thunder.\nThe Thunder closed the gap early in the third quarter. A floater by Adams cut Indiana's lead to one, then a 3-pointer by Jerami Grant finally put the Thunder ahead midway through the period. George and Westbrook followed with 3s to put Oklahoma City up 66-58. By the end of the run, the Thunder led 72-58.\nWestbrook clinched his triple-double on a lob to Terrance Ferguson for a dunk that put the Thunder up 88-79.\nGeorge scored on a high floater and was fouled. He made the free throw with just under four minutes remaining to put the Thunder up 10.\nThe Pacers offered one last surge, but a layup and a 3-pointer by Grant kept the Pacers at a safe distance heading into the final minute.\nThe Thunder felt they got good shots in the first half but were not converting. That changed in the third quarter.\n\"Keep shooting,\" Ferguson said. \"It's as simple as that. First half got to us. We have a 48-minute game. We stuck together and stayed confident in each other, and we came out with the win and had fun with it.\"\nTIP-INS\nPacers: G Darren Collison returned to the starting lineup after missing three games with a right quad contusion. ... G Wesley Matthews was called for a technical in the third quarter. ... Bogdanovic scored 35 points in his previous game, a win over Denver on Sunday.\nThunder: Shot just 39 percent in the first half. ... Held the Pacers to 8-for-25 shooting in the third quarter. ... Westbrook has 133 triple-doubles in his career. ... Grant scored 19 points.\nHE SAID IT\nGeorge on the defense during the 24-0 run: \"Honestly, I notice the stops more than us scoring. I noticed we were getting stops and we were getting out. I felt the pace was on our side and I felt the momentum was on our side.\"\nADAMS' DOMINANCE\nAdams made 11 of 14 shots and fell two points short of his career high.\n\"I just think they were taking what the defense gave them,\" McMillan said. \"When you have a lot of attention on Westbrook and Paul, sometimes, you're leaving that big open. They do a good job of playing the two-man game, hitting him in the paint. Weak side wasn't connected tonight, and they did a good job of executing.\"\nUP NEXT\nPacers: At the Boston Celtics on Friday.\nThunder: Host the Denver Nuggets on Friday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994549.302111
}