{
  "game_id": "0021300935",
  "espn_id": "400489808",
  "date": "Mar 09, 2014",
  "matchup": "OKC @ LAL",
  "headline": "Lakers overcome Kevin Durant's triple-double, trip up Thunder",
  "body": "LOS ANGELES -- From Jodie Meeks' big day to the final result, this was definitely a surprise.\nMeeks scored 24 of his career-high 42 points in the second half, and the Los Angeles Lakers beat Oklahoma City 114-110 on Sunday despite a triple-double by Thunder star Kevin Durant.\n\nPau Gasol added 20 points and 11 rebounds for the injury-ravaged Lakers, who had lost 29 of their previous 37 games. Meeks was 11 of 18 from the field and 14 for 14 at the line while becoming the third player to reach the 30-point mark this season for last-place Los Angeles (22-42).\n\"The most important thing is that we keep going out there and fighting and not giving up,\" Meeks said. \"The season isn't going the way that we planned, but we still have 18 games left. So we'll play them hard and see what happens.\"\nMeeks is averaging 19.2 points in 11 games since returning from a sprained right ankle. Before the injury, he was averaging 14.4.\n\"He got on fire,\" coach Mike D'Antoni said. \"He has really improved his game. Defensively, he was out of sight on Russell Westbrook the whole time. He put out a lot of energy in this game, but he has been doing that on a pretty consistent basis. Jodie has been our most consistent performer. It's really fun to watch someone get better.\"\nDurant had 27 points, 10 rebounds and 12 assists for his third triple-double this season. Serge Ibaka had 21 points and 15 boards for Oklahoma City.\nThe Thunder (46-17) began the day in a three-way tie with San Antonio and Indiana for the NBA's best record. The Pacers played at Dallas on Sunday night and the Spurs were idle.\n\"We lost. In some games, someone will have 40 points on you that is not supposed to have 40,\" Durant said. \"We pressure hard so high out on the pick-and-roll that it opened everything up, and they exploited it. They were hitting the pocket passes and going through the lane to get the ball to their shooters. But that is how we play, so we have to figure out how to make second and third efforts.\"\n\nAfter giving up an average of 136 points over their previous three games while losing to New Orleans, the Clippers and Denver, the Lakers trailed the Thunder by as many as 18 in the second quarter before taking their first lead on a pair of free throws by Meeks that made it 71-70 with 4:35 left in the third.\n\"I was trying to get my teammates involved, and they did a great job finding me in transition and in some set plays. So I give credit to those guys for helping me out with a big game,\" Meeks said. \"Being in a rhythm like that is fun, but getting a win is also fun. That was most important thing. We were down 18, so I was trying to do anything I could to help the team get back in the game.\"\nThe Thunder are 3-5 since beating the Lakers 107-103 at Staples Center on Feb. 13 behind 43 points by Durant, who is vying for his fourth scoring title in five seasons.\nThe Lakers took a 12-point lead into the fourth quarter and increased it to 95-77 on Jordan Farmar's 3-pointer with 9:42 remaining. Durant then fueled a 20-7 run with 10 points and former Laker Derek Fisher capper the rally with back-to-back 3s 24 seconds apart, pulling the Thunder to 102-97 with 4:36 to play.\nRussell Westbrook, who had 20 points, seven rebounds and eight assists for the Thunder, narrowed the gap to 110-107 on a driving dunk with 57.3 seconds on the clock. But he missed everything on another 3-point try 24 seconds later and newly acquired Kent Bazemore helped put it away with a driving layup -- two of his seven points in the final 2:02.\nWestbrook finished 7 for 23 from the field and tied a season worst with eight turnovers.\n\"We need to have a sense of urgency, knowing that teams are coming at us every night,\" Westbrook said. \"I missed some shots, but I do not think the game is all about shooting.\"\nGame notes\nNick Young had 31 points for Los Angeles in an overtime loss at Chicago on Jan. 20, and Farmar scored a career-high 30 on Feb. 28 in a home win against Sacramento. ... Durant has scored 25 or more points in 28 consecutive games -- one shy of his career-best streak, which occurred in 2009-10. No other NBA player has had a longer streak of 25-point games in the last 25 years. ... Fisher, second on the Lakers' career list for 3-pointers behind Kobe Bryant, shot 51.3 percent (39 for 76) from behind the arc in his previous 22 games before going 2 for 4 Sunday. ... This was the first game of the Lakers' home-and-home set against Oklahoma City, which will be followed by a home-and-home set against the Spurs. ... Lakers point guard Kendall Marshall played 27 scoreless minutes -- the fifth time in eight games that he has failed to score. ... The Lakers have trailed after three quarters in 47 of their 64 games.",
  "source": "espn_api",
  "crawled_at": 1764992844.3683908
}