{
  "game_id": "0022300124",
  "espn_id": "401584752",
  "date": "Nov 01, 2023",
  "matchup": "CHI @ DAL",
  "headline": "Williams, Hardaway lead unbeaten Mavericks to 114-105 victory over Bulls",
  "body": "DALLAS -- — Grant Williams tied career highs with 25 points and seven 3-pointers and the Dallas Mavericks beat the Chicago Bulls 114-105 on Wednesday night to improve to 4-0 for the first time since 2004-05.\n\n\r\n              Tim Hardaway Jr. added 24 points and seven 3-pointers off the bench for Dallas, which led 99-98 with 4:08 left and put it away with a 10-2 run.\n\n\r\n              Luka Doncic, who went into play leading the NBA with a 39-point average, had 18 points and 10 rebounds. Doncic was 1 for 8 behind the arc. Kyrie Irving missed his second consecutive game because of a sprained left foot.\n\n\r\n              Zach LaVine scored 22 points for Chicago but five in the second half. Nikola Vucevic had 21 points and a season-high 20 rebounds.\n\n\r\n              The Mavericks and Boston Celtics are the NBA’s only unbeaten teams.\n\n\r\n              “It’s difficult to say he wasn’t super-human because passing out of double teams and those plays for us still were incredible,” Williams, who was acquired from Boston in the offseason, said about Doncic. “He draws all that attention and allows guys like us to play 4 on 4, 4 on 3 sometimes.”\n\n\r\n              Jalen Hardy took advantage of some of those double teams in scoring all nine of his points for the Mavericks in the second half, including a 3-pointer from the right corner that capped the late run for a 109-100 lead with 56 seconds left.\n\n\r\n              Dallas rookie center Dereck Lively II had 13 rebounds, his second double-digit effort in four games, including seven offensive rebounds. One of Lively’s most important boards was an offensive tip to Hardaway midway in the fourth period with the Bulls leading 92-90. Hardaway hit a 26-foot 3-pointer and, fouled on the shot by Alex Caruso, converted the four-point play for a 94-92 lead.\n\n\r\n              “My job is doing the dirty work,” said Lively, who played 33 minutes and scored seven points.\n\n\r\n              The Mavericks were 20 for 48 from long range, while the Bulls were 11 for 33. Chicago did much of its damage down low, outscoring Dallas 54-24 in the paint.\n\n\r\n              There were 22 lead changes, 10 in the third quarter, before the Mavericks pulled away late.\n\n\r\n              Williams scored 10 of Dallas’ first 17 points and hit all four of his 3-pointers in the first half.\n\n\r\n              Maxi Kleber, Dallas’ backup center, was limited to four first-half minutes because of an injured left foot.\n\n\r\n              The American Airlines Center crowd erupted in the closing seconds learning the Texas Rangers padded their ninth-inning World Series lead. Thousands remained to watch the remainder of the game on the arena’s videoboard as the Rangers wrapped up their first title, beating Arizona in five games.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Brooklyn on Friday night in an in-season tournament game.\n\n\r\n              Mavericks: At Denver on Friday night in their tournament opener.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995923.459278
}