{
  "game_id": "0022401052",
  "espn_id": "401705618",
  "date": "Mar 25, 2025",
  "matchup": "SAC vs. OKC",
  "headline": "Thunder beat the Kings 121-105 for their 7th straight win",
  "body": "SACRAMENTO, Calif. -- — Shai Gilgeous-Alexander scored 32 points to lead the Oklahoma City Thunder to their seventh straight win and 60th of the season with a 121-105 victory over the Sacramento Kings on Tuesday night.\n\n\r\n              Chet Holmgren added 18 points and 10 rebounds, and Alex Caruso scored 15 to give the NBA-leading Thunder their 14th win in 15 games.\n\n\r\n              Keegan Murray scored 28 points with nine 3-pointers and Zach LaVine added 19 to lead the Kings. Sacramento has dropped four straight games.\n\n\r\n              The Thunder broke out to a big lead in the first half that grew to 24 points. The Kings scored 16 straight early in the third quarter to get the deficit back into single digits but were never able to get closer than six the rest of the way.\n\n\r\n              Oklahoma City then pulled away in a dominant fourth quarter.\n\n\r\n              Takeaways\r\n              Thunder: Oklahoma City is the first NBA team to 60 wins this season and it matched the 2012-13 team for the most wins for the club since leaving Seattle following the 2007-08 season. The franchise record for wins is 64 in 1995-96. \n\n\r\n              Kings: Sacramento fell to 2-4 on a seven-game homestand and is in serious danger of missing the play-in tournament. The Kings fell into a tie with Phoenix for ninth place in the Western Conference and have only a half-game lead over Dallas for the final play-in spot.\n\n\r\n              Key moment\r\n              The Thunder opened the second quarter with a 14-4 run to take a 20-point lead and were never seriously threatened after that. \n\n\r\n              Key stat\r\n              Oklahoma City made 12 of 21 attempts from 3-point range in the first half, with eight players draining at least one from long range.\n\n\r\n              Up next\r\n              The Kings finish their homestand Thursday night against Portland. The Thunder return home to face Memphis on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997310.0845509
}