{
  "game_id": "0022300134",
  "espn_id": "401584762",
  "date": "Nov 04, 2023",
  "matchup": "LAL @ ORL",
  "headline": "Franz Wagner scores 26, leads Magic over Lakers 120-101",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 26 points, Paolo Banchero added 25 points, 10 assists and seven rebounds and the Orlando Magic blasted the Los Angeles Lakers 120-101 on Saturday night.\n\n\r\n              Anthony Davis had 28 points, 13 rebounds and seven blocks for the Lakers, who took a 51-40 drubbing on the boards while playing without five injured players. The Magic turned 17 Laker turnovers into 22 points and led by 25 points late in the third quarter.\n\n\r\n              “That’s definitely been our trend — offensive rebounds and points off turnovers,” said LeBron James, who finished with 24 points, nine rebounds and five assists. “We'll do a good job of getting a stop and then an offensive rebound allows them to score.”\n\n\r\n              “It definitely helps when you have bigger bodies,” James said. “We have three of our bigger bodies out right now with injuries. ... It would help, but that’s definitely one of the ways we have to look at to get better.”\n\n\r\n              Rookie Anthony Black scored 11 points in his first start for the Magic, who were missing three players. Goga Bitadze started at center and finished with 10 points, 10 rebounds and five blocks.\n\n\r\n              “They're down bodies, we're down bodies and so the game basically comes down to mental approach,” said Laker coach Darvin Ham. “Their energy, their effort, they outworked us.”\n\n\r\n              Wagner scored seven straight points early in the game and Banchero hit a 3-pointer and a 19-foot jumper during a 13-0 run that put Orlando up for good in the first quarter. They led by 16 points at halftime.\n\n\r\n              Davis, who averaged a league-leading 40.2 minutes in the Lakers' first five games, was called for his fourth foul when Banchero drove for a power dunk just 1:25 into the third period. \n\n\r\n              Banchero scored five points and Black added a three-point play on a 9-0 Orlando run, and Cole Anthony's 3-pointer stretched the lead to 99-74 before the end of the third quarter.\n\n\r\n              Coming five days after the Lakers' 106-103 win over the Magic in Los Angeles, the victory broke Orlando's seven-game losing streak against the Lakers.\n\n\r\n              “We don't look at any other team and think we can't match up,” said Banchero.\n\n\r\n              The NBA's Rookie of the Year last season gave much of the credit to Black, who was thrust into the starting lineup by the injuries to guards Markelle Fultz (knee) and Gary Harris (groin).\n\n\r\n              “Plus-32 for my dawg right here,” said Banchero, referring to Black's plus/minus ratio in 30 minutes. “Plus-32 is nuts. He just stepped up right away.”\n\n\r\n              “He wasn't afraid,” said Magic coach Jamahl Mosley. “”He embraces moments, and he's willing to make the easy play, the easy pass and the right decision.\"\n\n\r\n              The Lakers used an eight-man rotation for a second straight game until emptying their bench in the final four minutes. They played without Rui Hachimura (concussion protocol), Taurean Prince (knee), Gabe Vincent (knee), Jalen Hood-Schifino (knee) and Jarred Vanderbilt (knee).\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Visit Miami on Monday.\n\n\r\n              Magic: Host Dallas on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995554.1783738
}