{
  "game_id": "0021600088",
  "espn_id": "400899538",
  "date": "Nov 06, 2016",
  "matchup": "MEM vs. POR",
  "headline": "McCollum matches career high, Blazers beat Grizzlies 100-94",
  "body": "MEMPHIS, Tenn. --  Damian Lillard had his lowest-scoring game of the season. CJ McCollum made up the difference by matching the best game of his career.\n\nMcCollum scored 37 points, 16 in the fourth quarter, to help the Portland Trail Blazers beat the Memphis Grizzlies 100-94 on Sunday.\n\n\"I just went into the game being aggressive,\" McCollum said.\n\nMcCollum had 10 straight Portland points in the closing minutes put the game away, and also matched his career best with six 3-pointers. Lillard added 19 points and seven assists, and Maurice Harkless finished with 18 points.\n\n\"He was big-time,\" Lillard said about McCollum. \"That's who he is. We see him get hot like that all the time. ... As a point guard, and as somebody that knows how capable he is of taking over a game, you go to it.\"\n\nMarc Gasol led Memphis with 21 points, and Mike Conley added 16 points and seven assists. Zach Randolph had 15 points and seven rebounds.\n\nThe game was close with 13 lead changes and 12 ties before Portland pulled away late behind McCollum hitting 6 of 9 shots in the fourth.\n\n\"He had a good rhythm,\" Portland coach Terry Stotts said. \"I thought he took (shots) in rhythm. He got within the context and flow of the game.\"\n\nConley's 3-pointer from 31 feet at the horn, gave Memphis a 51-47 lead at the break, but the Grizzlies struggled in the second half.\n\n\"We can't seem to find a level of consistent play throughout the game, and that's really hurting us right now,\" Memphis coach David Fizdale said after his team's second straight loss.\n\nTIP-INS\n\nTrail Blazers: Lillard entered the game ranked second in the league in scoring, averaging 34.2 points. His previous low-scoring game this season was 27 at Phoenix Wednesday. ... Portland has scored at least 100 in all seven of its games. ... McCollum's performance marked the first time this season someone other than Lillard led Portland in scoring.\n\nGrizzlies: Memphis G Tony Allen left in the second quarter with a right hip injury. He returned in the second half. ... Gasol has made a 3-pointer in all six games he's played this season. ... Conley, who entered the game ranked second in the league in 3-point shooting at 59.3 percent, was 1 of 5 from outside the arc.\n\nLADIES and GENTLEMEN, CHANDLER PARSONS\n\nParsons, the Grizzlies biggest off-season acquisition, started in his season debut Sunday and missed all eight of his shot in just under 22 minutes. Parsons, signed by Memphis during the offseason for four years, $94 million, did not play in the preseason or in the first six regular season games, recovering from right knee surgery. \"I expected him to be rusty,\" Memphis coach David Fizdale said. \"The guy hasn't played in I don't know how long.\"\n\nDAME DINGED UP\n\nLillard injured his left thumb in the second quarter, but didn't leave the game although he kept shaking the hand the rest of the half. While the thumb was swollen, he didn't anticipate any long-term affects. Lillard also rolled his ankle. \"It would take more than that to keep me out of the game,\" he said.\n\nSTILL ADJUSTING\n\nWith Parsons debut, Memphis employed its fifth different starting lineup in the first seven games as first-year coach David Fizdale searches for consistency.\n\nUP NEXT\n\nTrail Blazers: Portland returns home to face the Phoenix Suns on Tuesday night. The Trail Blazers lost to Phoenix 118-115 in overtime last Wednesday\n\nGrizzlies: Memphis closes out a four-game homestand on Tuesday night against the Denver Nuggets.",
  "source": "espn_api",
  "crawled_at": 1764995630.646834
}