{
  "game_id": "0022400544",
  "espn_id": "401705110",
  "date": "Jan 12, 2025",
  "matchup": "ORL vs. PHI",
  "headline": "Anthony and Banchero lead the Magic past the 76ers 104-99",
  "body": "ORLANDO, Fla. -- — Cole Anthony had 27 points, Paolo Banchero scored seven points in the final 1:32 and the Orlando Magic beat the Philadelphia 76ers 104-99 on Sunday night.\n\n\r\n              Banchero finished with 20 points, eight rebounds and six assists in his second game back after being sidelined by a torn oblique.\n\n\r\n              Tyrese Maxey led Philadelphia with 29 points. Paul George had 25 points, 10 rebounds and six assists before fouling out with the 76ers leading 94-91 with 2:49 left.\n\n\r\n              Orlando also got a lift from reserve Jonathan Isaac, who had 20 points and 11 rebounds in his first double-double since 2019. Anthony Black finished with 17 points, six rebounds and six assists.\n\n\r\n              Takeaways\r\n              76ers: The loss completed a long weekend for the 76ers, who were once again without center Joel Embiid after losing rookie Jared McCain (surgery on a torn meniscus) for the season on Thursday and losing at home to New Orleans on Friday. Embiid missed his fourth straight game with a sprained left foot. \n\n\r\n              Magic: The Magic reached the midway point of an injury-riddled season at 23-18, fifth in the Eastern Conference. Rookie forward Tristan da Silva left the game after 61 seconds due to an illness.\n\n\r\n              Key moment\r\n              A 3-pointer by Maxey accounted for Philadelphia's only points over the final 2:32, during which a three-point lead turned into a five-point loss.\n\n\r\n              Key stat\r\n              Led by Isaac and Black, Orlando had a 48-11 advantage in bench points.\n\n\r\n              Up next\r\n              The 76ers host Oklahoma City on Tuesday. The Magic are at Milwaukee on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997547.245604
}