{
  "game_id": "0021600329",
  "espn_id": "400899771",
  "date": "Dec 07, 2016",
  "matchup": "PHX vs. IND",
  "headline": "Paul George leads Pacers past Suns, 109-94",
  "body": "PHOENIX --  Paul George had some big numbers -- and shut down high-scoring Devin Booker.\n\nGeorge had 25 points and 13 rebounds and the Indiana Pacers pulled away in the fourth quarter to beat the struggling Phoenix Suns 109-94 on Wednesday night.\n\nGeorge defended Booker and helped hold the second-year guard to 13 points on 4-of-13 shooting. Booker also committed four turnovers.\n\n\"He's young and really good and has got a lot to learn playing with the physicality,\" George said about Booker. \"Tried to get him out of his spots, tried to get him uncomfortable. That's what you have to do with guys that are so good with getting into a rhythm.\"\n\nMyles Turner added 20 points, and Jeff Teague had 19 points and a season-high 11 assists.\n\nIndiana had a 9-0 run midway through the fourth quarter to open a 97-87 lead.\n\n\"We were able to get stops. We were able to get out in transition,\" George said. \"We did a great job of just getting good looks. Not any shot we took was bad, I thought.\"\n\nEric Bledsoe led Phoenix with 15 points, and Tyson Chandler had 10 points and 10 rebounds. The Suns shot 40 percent from the field and made only 9 of 33 3-pointers. They have lost five of six.\n\nIndiana has won four of six. The Pacers haven't won or lost more than two games in a row this season.\n\n\"We have a young group,\" Suns coach Earl Watson said. \"We have to set the tone and identity on how we want to play. From now on, moving forward, defensively aggressive is how we have to play.\"\n\nRodney Stuckey's 12-foot turnaround with 17 seconds left in the third quarter gave Indiana its largest lead of the game to that point, five, at 82-77. But Jared Dudley hit a 3 at the quarter buzzer on the next possession to make at 82-80 to start the fourth.\n\nThe Pacers led 23-22 at the end of the first quarter, which saw four lead changes, five ties and neither team leading by more than four points.\n\nThe Suns struggled with their shooting for all but the final few minutes of the second quarter. They led 53-49 at halftime thanks to a pair of 3s from Marquese Chriss and one from Booker. Turner and George had 12 first-half points each.\n\nThe Pacers made 45 percent of their shots and the two teams combined to commit 39 turnovers.\n\n\"We made shots, we made plays when we needed to,\" Pacers coach Nate McMillan said. \"It was a grind game for us.\"\n\nTIP-INS\n\nPacers: McMillan, on his team's 36-point loss to Golden State on Monday night in which Klay Thompson scored 60 points: \"It wasn't a good film to watch. We talked about that, but we do have to move on.\" ... George missed a free throw in the second quarter, ending his streak at 31.\n\nSuns: Suns F P.J. Tucker spoke to the crowd, thanking military members and veterans moments before ceremonies commemorating the 75th anniversary of Pearl Harbor. Officers took the court with Suns players during starting lineup introductions. ... F T.J. Warren missed his ninth straight game due to a minor head injury.\n\nA COOL GRAND\n\nChandler played in his 1,000th game, the 122nd NBA player ever to reach that milestone. Twenty-seven players played one of their 1,000 games as a Sun, but only three hit No. 1,000 in a Phoenix uniform -- Chandler, Danny Ainge and Steve Nash.\n\nFREE THROW DIFFERENCE\n\nThe Pacers made 32 of 41 free throws, the Suns 17 of 18. That wasn't lost on Watson. \"I don't know how you compete in a game when free throws, the difference is that big of a gap,\" he said. \"Of course I am biased but I don't think every one of those fouls are fouls.\"\n\nLOB CONNECTION\n\nChandler and Booker connected for a pair of crowd-pleasing alley-oop dunks, one in the first quarter and another in the second.\n\nUP NEXT\n\nPacers: At Dallas on Friday night in the finale of a five-game trip.\n\nSuns: At the Los Angeles Lakers on Friday night, then home for the next three.",
  "source": "espn_api",
  "crawled_at": 1764995993.145563
}