{
  "game_id": "0021400070",
  "espn_id": "400578362",
  "date": "Nov 06, 2014",
  "matchup": "POR vs. DAL",
  "headline": "LaMarcus Aldridge, Blazers breeze past Mavs on third-quarter surge",
  "body": "PORTLAND, Ore. -- First, the Trail Blazers held LeBron James to just 11 points. Two nights later they held Dirk Nowitzki to 17.\nAnd just like that, Portland is pointing to an improved defense for two key wins.\nThe latest was on Thursday night when Portland overwhelmed the Dallas Mavericks with a 35-18 third quarter en route to a 108-87 victory. LaMarcus Aldridge had 20 points before sitting down for the entire fourth.\nDamian Lillard finished with 18 points, including 10 over a stretch of just under six minutes in the fourth before he also took a seat.\nPortland trailed 50-46 at the half before a decisive 18-4 run in the third quarter.\n\n\"I think the best part about it was that we won on both ends of the floor,\" Lillard said. \"We defended really well in the first half, we just couldn't really get ourselves going like we would have liked to offensively. The second half, we put both ends together and that's why we were able to pull away.\"\nDallas went into the game averaging nearly 112 points in their first four games of the season. Nowitzki was averaging nearly 21.\nBut Nowitzki said it was the Mavericks' defense that failed them against the Blazers.\n\"We couldn't get the stops we needed as the game turned into a walk-up-the-court game and that's not us,\" he said. \"We've got to get stops to get the ball moving.\"\nThe game was delayed several minutes midway through the fourth quarter when a fan collapsed. The woman was rushed across the court by stretcher as a paramedic performed CPR. She was taken by ambulance to a local hospital, but there was no immediate information about her condition.\nNicolas Batum had eight points, nine rebounds and nine assists, but he too rested in the fourth quarter after the Blazers had built a sizable lead. Batum has four career triple-doubles.\nThe Trail Blazers were coming off a confidence-boosting 101-82 victory over the visiting Cleveland Cavaliers that snapped a brief two-game losing streak. Lillard broke out of a season-opening funk with 27 points, and Portland held James to just 11 points, his lowest total in 115 games.\nAsked if he thought the team's defense was better this season, Blazers guard Welsey Matthews said: \"I think it is. And I think it has to be.\"\nThe Mavericks lost their season opener at San Antonio but went on to win their next three, including a 118-113 victory over Boston on Monday.\n\"We've been doing a lot of good things but our defense has been inconsistent,\" Mavs coach Rick Carlisle said. \"We have to make a stand there. I have to look closely at what we're doing and make sure we're doing the right things and have the right guys in at the right times. We don't have a lot of time to sit around and mope.\"\nIt is the first of back-to-back road games for the Mavericks, who visit the Utah Jazz on Friday night.\nThe Mavericks double-teamed Aldridge from the start, but he led all scorers with 10 points in the first quarter.\nThe Blazers pulled ahead 28-24 with 10:10 left in the first half on consecutive 3-pointers from CJ McCollum off the bench. Monta Ellis' layup gave Dallas a 35-33 lead.\nNowitzki hit a 19-foot-jumper from out front, then added a 3-pointer over Aldridge, and the Mavericks took a 45-38 lead. Nowitzki had 12 points in the second quarter and Dallas was up 50-46 at the half.\nRobin Lopez's dunk pulled the Blazers within 52-51, and they took the lead on Aldridge's fadeaway jumper. Wesley Matthews pumped both fists and yelled after his 3-pointer made it 71-59.\nBut Chandler Parsons, who had scored just two points in the first half, hit consecutive baskets and narrowed it to 71-66.\nChris Kaman's put-back layup gave the Blazers an 88-70 lead in the fourth quarter as the rout was on. Kaman scored 12 off the bench.\n---\nTIP-INS\nMavericks: Owner Mark Cuban is interviewed in the latest edition of Rolling Stone and reveals his greatest mistake was letting Steve Nash go. He also says that \"losing hurts far more than winning feels good.\" ... Nowitzki scored 12 points in the second quarter alone, but the Blazers held him to just two points in the second half. ... Parsons had scored 20 or more points in the past three games; the Blazers held him to 11.\nTrail Blazers: F Joel Freeland was available after missing the past two games with a left foot sprain. ... Portland had lost seven of the last 10 to Dallas going into the game.\nTHIRD QUARTER WOES\nNowitzki says he's not sure why the Mavericks have been having trouble coming out after the half. \"We better figure it out pretty quick. Seems like we don't come out with any energy. That's really unfortunate, we have got to correct that. Teams are coming out in the second half determined to pick up the pressure and we have not responded.\"\nBENCH SCORING\nPortland's bench outscored the Mavericks' 52-35. The reserves made seven of 12 3-point attempts and shot just over 57 percent from the field. \"That's what we need them to do. You never know when you're going to be called, but you have to be ready. And they were ready,\" Matthews said.\nUP NEXT\nMavericks: At Utah on Friday night.\nTrail Blazers: At the Los Angeles Clippers on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764992115.288702
}