{
  "game_id": "0022200867",
  "espn_id": "401469022",
  "date": "Feb 13, 2023",
  "matchup": "LAL @ POR",
  "headline": "Blazers hit 23 3-pointers, beat LeBron-less Lakers 127-115",
  "body": "PORTLAND, Ore. -- — Damian Lillard had 40 points, including eight 3-pointers, to lead the Portland Trail Blazers to a 127-115 victory over the Los Angeles Lakers on Monday night. \n\n\r\n              LeBron James, the NBA’s all-time leading scorer, missed his third straight game for the Lakers with a sore left ankle. He hasn't played since breaking Kareem Abdul-Jabbar's scoring record last Tuesday in a loss to Oklahoma City. \n\n\r\n              The Blazers led by as many as 27 and made a season-best 23 3-pointers, including a franchise-record 17 in the first half. \n\n\r\n              When Lillard went to the bench for good with seven minutes left, he got a standing ovation from many in the crowd. \n\n\r\n              “I think the number one thing is just being aggressive,\" Lillard said. \"That’s the mentality, because I’m not going out there saying I want to score points — I’m just applying pressure. I’m going to attack coverages, take opportunities that are there, try to create opportunities.\"\n\n\r\n              Anthony Davis had 19 points and 20 rebounds for the Lakers, who have lost four of five. \n\n\r\n              Lakers coach Darvin Ham said his team had no answer for Lillard, who has 11 games this season with 40 or more points. \n\n\r\n              “Aside from stealing his sneakers, I don’t know what else you could do,\" Ham said. \n\n\r\n              Both teams continued to integrate players acquired at the trade deadline last week. Matisse Thybulle, obtained from Philadelphia in a four-team deal, made his debut for the Blazers and started. He had 14 points and four 3-pointers. \n\n\r\n              D’Angelo Russell, who the Lakers got as part of the trade that sent Russell Westbrook to Utah, started for the second straight game and finished with 16 points. Malik Beasley, who came over from the Jazz, had 22 points off the bench. \n\n\r\n              Mo Bamba, traded to the Lakers from the Orlando Magic at the deadline, continues to serve a four-game suspension for an on-court fight with Minnesota guard Austin Rivers during a game on Feb. 3. \n\n\r\n              The Blazers went on a 20-2 run in the opening quarter that ended with Nassir Little's 3-pointer that made it 25-16. Portland made 10 3-pointers in the quarter, including Lillard's 3 from distance at the buzzer that stretched the lead to 34-19. \n\n\r\n              Lillard had 30 points and eight 3s to lead all scorers at halftime, and the Blazers led 65-46. \n\n\r\n              Portland led 101-79 going into the final quarter. \n\n\r\n              “We’ve gotten spoiled here, being able to see this guy, night in and night out, just dominate and score 30 in a half or 60 in a game,” Blazers coach Chauncey Billups said about Lillard. “I mean, it’s been incredible. He’s been so dang good.”\n\n\r\n              It was the fourth and final scheduled meeting between the teams this season. The Lakers won the previous two after a Portland win to open the series. \n\n\r\n              TIP-INS\n\n\r\n              Lakers: The Lakers are 5-9 in games James has missed this season. ... The Lakers shot 1 of 10 on 3-point attempts in the opening quarter. \n\n\r\n              Trail Blazers: The Blazers were without Jerami Grant after he entered the concussion protocol this past weekend. Grant was averaging 20.8 points for Portland. ... Jusuf Nurkic hasn't played since Feb. 1 because of a left calf strain. Portland's big man is not expected back until after the All-Star break. \n\n\r\n              HISTORY\n\n\r\n              Lillard was encouraged by Thybulle's first start with the Blazers, but he's known for a while what he's capable of. Thybulle worked out with Lillard a bit when he was playing at the University of Washington. \n\n\r\n              “I’ve always liked him as a player. I trained with him since he was in college — we’ve got the same agent,\" Lillard said. “We just encourage him, shoot the ball when you're open. Shoot it with confidence. Everything that we need to bring defensively, we have to be willing to give him those opportunities, and he’s got to take them and have confidence. I thought for the first game, that he did that. I think the more comfortable he gets, we’ll see him continue to blossom for us.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host the New Orleans Pelicans on Wednesday night. \n\n\r\n              Trail Blazers: Host the Washington Wizards on Tuesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994117.0576909
}