{
  "game_id": "0021301091",
  "espn_id": "400489964",
  "date": "Mar 29, 2014",
  "matchup": "MIL vs. MIA",
  "headline": "Heat bully Bucks to wrap up 3-game road swing",
  "body": "MILWAUKEE -- Short-handed and a little disheveled with the ball, the Miami Heat finished off their three-game swing through the Midwest with a sterling performance on the other end of the floor.\nThe Heat shut down the Bucks with defense Saturday night as Chris Bosh scored 14 points, LeBron James had 13 and Miami throttled Milwaukee 88-67, holding an opponent to a season low in points.\n\"In the playoffs, we're going to have to rely on our defense,\" Bosh said.\nJames Jones added 10 for Miami in place of star guard Dwyane Wade, sidelined a second straight game with a sore hamstring. The Heat also played without Ray Allen and Mario Chalmers.\nDidn't matter against the team with the NBA's worst record. Milwaukee tried to match Miami's energy, but couldn't keep with the more talented opponent -- even one without two All-Stars.\nDefense was the difference. The Heat led 46-29 at halftime and held the Bucks to a season low for points in a half and in a game.\nThe Bucks shot 34 percent, the fourth straight time that Miami held a foe to under 40 percent from the field.\n\"We did a poor job off the dribble with that next pass, hoping that next pass would lead to a ... good look at the basket,\" coach Larry Drew said.\nNot so much.\nThe Heat led by as much as 21. They were never threatened past the first quarter.\nJohn Henson had 12 points and 10 rebounds for Milwaukee, while Ramon Sessions had a game-high 15 points.\n\"I just didn't feel like we had that pep in our step,\" Drew said. \"We were talking about getting out in transition. \"Against a good team, you can't rely on your half court every possession.\"\nOn paper, this was a mismatch from the opening tip -- the two-time defending NBA champions against a young, undermanned squad that fell to 14-59 on the season.\nBut it wasn't the prettiest of games. Perhaps Miami was a little worn from their third straight road game and fourth in five contests.\n\"We came in with a workmanlike attitude,\" coach Erik Spoelstra said. \"There was a commitment to it. You could tell from the beginning we weren't trying to take the easy way out.\"\nJames extended his consecutive-game streak of double-digit scoring to 564, the fourth-longest run in NBA history. But James only got to 10 with about 5:16 left in the third quarter on a 3.\nFresh off recording a triple-double in a 110-78 blowout win Friday night in Detroit, James had nearly as many turnovers (three) as points (four) in the first half. His two early buckets, though, came off open dunks that thrilled the crowd, a few of whom were wearing James jerseys.\nMiami opened the game 3-of-14 from the field. The shooting improved, and the Heat clamped down on the other end and held the Bucks to 12-of-39 shooting (30 percent) in the first half.\nThe road trip ended with two straight wins after losing Wednesday in Indiana. Just like Friday night, James spent the fourth quarter on the bench with a victory well in hand.\n\"It was a great trip overall, just how we bounced back with all the adversity as far as guys in and out of the lineup,\" James said.\nThe only real drama in the second half was when James would get to double digits in scoring.\nA dunk with 6 minutes left in the third gave Milwaukee a 54-38 lead. Khris Middleton missed a jumper, and James corralled the rebound before spotting up at the wing for his 3 to get to double figures.\nLater, James got another defensive rebound and then threw a long outlet pass to a streaking Udonis Haslem down court for a layup.\nJames clapped, slapped his right hand on his thigh and waited down court on defense. His night was just about over.\nBothered by a sore hamstring, Wade watched in a gray suit and white sneakers in returning to the arena in which he played college ball at Marquette.\nGame notes\nAllen, sidelined with a stomach virus, played in Milwaukee from 1996 through part of the 2002-03 season. He holds the franchise record for most 3-point field goals in a game at home with 10. ... Chalmers missed the game with a bruised quad, and Greg Oden was also sidelined by back spasms. ... The Bucks have yet to win consecutive games all season. They were coming off a 108-105 win Thursday over the Lakers.",
  "source": "espn_api",
  "crawled_at": 1764992722.674337
}