{
  "game_id": "0021600941",
  "espn_id": "400900336",
  "date": "Mar 06, 2017",
  "matchup": "CHA vs. IND",
  "headline": "Kemba Walker leads Hornets past Pacers, 100-88",
  "body": "CHARLOTTE, N.C. --  Just before the first-quarter buzzer sounded, Nicolas Batum heaved up a long shot. The 29-foot toss banked off the glass and fell through the net.\n\nThat was when the Charlotte Hornets knew things were going their way Monday.\n\nKemba Walker scored 28 points, Batum added 21, including that improbable 3-pointer, and the Hornets beat the Indiana Pacers 100-88.\n\nReturning home after their victory Saturday in Denver, the Hornets notched consecutive wins for the first time since Jan. 20-21.\n\n\"This is was an important win for us,\" Walker said. \"To come off the road and come home and have a big game like this was a much-needed win.\"\n\nThey did it while fending off Paul George's 36 points on 15-of-25 shooting, and thwarting the Pacers' second-half comeback attempt.\n\nCharlotte (28-35) used a fast start to provide enough cushion to cruise to the victory, despite a third quarter where the Pacers outscored the Hornets 29-16.\n\n\"We started this game flat,\" Pacers coach Nate McMillan said. \"Not a lot of energy at all, and we dug ourselves a deep hole.\"\n\nAdding to the woes: The Pacers attempted just three free throws the entire game.\n\nStill, Indiana was able to cut Charlotte's lead to 82-75 with 8:12 remaining, but that was the closest they could come.\n\nJeremy Lamb sank a 3-pointer and a layup for the Hornets to keep the Pacers at bay.\n\nFive players scored in double digits for the Hornets, including 14 from Lamb, 13 points and 11 rebounds from Cody Zeller, and 11 points and 13 rebounds from Michael Kidd-Gilchrist.\n\nThe Hornets' lead grew to as large as 24 points late in the second quarter before Indiana began to rally.\n\nThe Pacers started the second half scoring 10 unanswered points, and hit 5-of-8 3-point attempts.\n\nBut by then, it was too late. Indiana was felled by an inability to score in the first half paired with sharp Charlotte shooting.\n\nThe Hornets struck early, using a 9-0 run to push their lead to 18-11 with 3:44 left in the first quarter. In that stretch, Batum sank two 3-pointers and a free throw, and Zeller had a layup on a pass from Batum.\n\nWalker drained 6-of-13 first-half attempts for 17 points.\n\n\"They (Walker and Batum) set the tone obviously,\" Hornets coach Steve Clifford said. \"That's how it's going to have to be. The ball's going to be in their hands and if we're going to make a run here (toward the playoffs), it's going to have to start with those two guys.\"\n\nThe Pacers' 37 points in the first half matched a season-low for a Hornets opponent; Charlotte also held Brooklyn to 37 first-half points Feb. 7.\n\nTIP-INS\n\nPacers: Forward Lavoy Allen missed his second straight game with a sore left knee. ... Center Al Jefferson, who played three seasons in Charlotte, spent the first few minutes of warmups hugging former Hornets teammates midcourt. He received hearty cheers from the crowd when he checked in the game late in the first quarter. . Indiana was 3-2 on its trip. . This marked the second time this season the Pacers have appeared on TNT.\n\nHornets: Walker was chosen Eastern Conference Player of the Week on Monday. He averaged 27.7 points, 6.3 assists and 4.3 rebounds from Feb. 27 to March 5, and the Hornets were 2-1. It is the fifth such award Walker has won in his career. . Charlotte signed Johnny O'Bryant to a second 10-day contract Monday. O'Bryant appeared in two games for the Hornets before the extension, averaging 8.5 points on 80 percent from the field, and 3.0 rebounds in 8.5 minutes per game. . This was the only Hornets game broadcast on TNT this season.\n\nKEEPING PLAYOFF HOPES ALIVE\n\nThe Hornets' up-and-down season has them three games below the eighth and final playoff spot in the Eastern Conference, but they haven't given up hope.\n\n\"There's no quit in us, we're going to fight to the end,\" Walker said. \"I think we've got a chance, still, so we've got to take care of these (remaining) games, especially at home.\"\n\nFREE THROW-LESS GEORGE\n\nGeorge, who had 34 points a night earlier against Atlanta, shot no free throws. That marked just the fourth game this season where a player has scored 35 points or more without attempting a free throw.\n\nIn all, the Pacers attempted just three free throws against Charlotte.\n\n\"Three free throws is not good at all,\" McMillan said. \"(But) I think they do a good job of defending the paint and playing D without fouling.\"\n\nUP NEXT\n\nPacers: Indiana hosts Detroit on Wednesday.\n\nHornets: Charlotte travels to Miami on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995478.162248
}