{
  "game_id": "0021400056",
  "espn_id": "400578348",
  "date": "Nov 04, 2014",
  "matchup": "LAL vs. PHX",
  "headline": "Gerald Green, Suns hold off winless Lakers despite Kobe Bryant's 39",
  "body": "LOS ANGELES -- Kobe Bryant took over the Los Angeles Lakers' offense and tried to take over the game, digging back into his famed history and carrying his undermanned team to the brink of its first victory.\nThe Phoenix Suns answered with all the balance and big shots that Kobe and the Lakers lacked.\nGerald Green scored 26 points off the bench, Markieff Morris had 23 points and 10 rebounds, and the Suns overcame Bryant's 39-point performance to keep the Lakers winless with a 112-106 victory Tuesday night.\nIsaiah Thomas scored 22 points in a reserve role for Phoenix, which survived a dicey fourth quarter to beat the Lakers for the second time in seven days.\n\nWhile the Suns respected the five-time NBA champion's game-deciding ability, they proved better than the supporting cast currently assembled around Bryant.\n\"The difference down the stretch was the fact that we picked up our intensity,\" Green said. \"Once we started seeing that they were making a run, then we were fighting for our lives. When we've got teams down, we've got to keep stepping on their throats and keep it up. We didn't do that tonight, but we got a win.\"\nBryant went 14 for 37 for the Lakers, who are off to their first 0-5 start since the 1957-58 Minneapolis Lakers lost their first seven games.\nWith a four-day break before the Lakers' next game, coach Byron Scott gave 44 minutes to Bryant, who played the entire second half. In his fifth game back from injury, Bryant earned 12 free throws and launched 23 shots in the second half alone.\n\"I was just being aggressive,\" Bryant said. \"I played with a lot of energy today. It's easy to look at it and say 37 shots, but you don't see how hard I was working to get easy opportunities, offensive rebounds and transition shots. Some of the easy ones I missed, but if you play with a lot of energy and are relentless, you'll get a lot of opportunities.\"\nBryant's third 3-pointer trimmed Phoenix's lead to 106-104, but Eric Bledsoe hit two free throws before P.J. Tucker punctuated his season debut with the decisive 3-pointer in front of the Lakers' bench with 19 seconds left.\n\"When Kobe is out there, you never know what's going to happen,\" Phoenix coach Jeff Hornacek said. \"He can get it going, and he made some big plays at the end. But we made some free throws, and Tuck hit the big 3 in the corner. They played pretty decent, and we were lucky to win that game.\"\nScott sees frustration in his winless team, and Bryant hopes the youngsters and castoffs populating Los Angeles' roster will follow his lead in effort, if not shot volume.\n\"Just get a damn win,\" Bryant said. \"You can't listen to what everybody says. You can't listen to people. You've got to be stubborn as a mule. You've got to keep chipping away. Got to keep competing and going after it, and this thing will turn around. Just as easily as we lost five in a row, we can turn around and win five in a row.\"\nTIP-INS\nSuns: Tucker returned from his three-game suspension for an offseason DUI conviction. His last-minute 3-pointer was his only basket in 20 minutes. ... Phoenix has won six of seven in its series with the Lakers.\nLakers: Ryan Kelly made his season debut, playing seven minutes. He was out with hamstring injuries. ... Rookie Julius Randle was at Staples Center for the first time since breaking his leg on opening night. He is on crutches but in relatively little pain. The seventh overall pick will miss the entire season but hopes to use the time to \"become an extreme student of the game.\"\nHIGH JUMPER: Bryant decided to hurdle the entire front row of courtside seats in pursuit of a loose ball in the third quarter, landing safely with the flair and foolishness of a player half his 36 years. \"I try not to do it, but I didn't have much of a choice on that one,\" he said.\nONE HAND: Thomas continued his scoring binge off the Suns' bench, and he threw a jaw-dropping, one-handed alley-oop pass to Green in the second quarter.\nUP NEXT\nSuns: Host Memphis on Wednesday to open a five-game homestand.\nLakers: Host Charlotte on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764992022.317965
}