{
  "game_id": "0022000311",
  "espn_id": "401267471",
  "date": "Jan 31, 2021",
  "matchup": "CLE @ MIN",
  "headline": "T-Wolves snap 3-game slide with 109-104 win over Cavaliers",
  "body": "MINNEAPOLIS -- — Malik Beasley scored 23 points and rookie Anthony Edwards finished with 23 in his second straight start as the Minnesota Timberwolves held on to beat the Cleveland Cavaliers 109-104 on Sunday night.\n\n\r\n                    D’Angelo Russell added 19 points for Minnesota, which snapped a three-game losing streak and won for just the third time in 17 games.\n\n\r\n                    The Timberwolves used their 3-point shooting to overcome a dominant game inside by Andre Drummond and Cleveland. The Timberwolves connected on a season-high 16 3s, converting 40% from beyond the arc.\n\n\r\n                    “They’re big; 72 points in the paint is a lot,” Minnesota coach Ryan Saunders said. “I liked a number of things that these guys did and I thought that was a definition of a team win. But you can’t be satisfied because games come quick and we run it back tomorrow.”\n\n\r\n                    Drummond had 25 points and 22 rebounds — his third 20-20 game of the year — and the Cavaliers scored a season-high 72 points in the paint. Collin Sexton added 16 points as Cleveland lost for the fourth time in five games.\n\n\r\n                    The Cavaliers had a season-high 19 turnovers, resulting in 29 points for Minnesota.\n\n\r\n                    “There’s been instances these last two games, in my mind, that we have not played to the standard of being the most competitive team and the most selfless team on the floor,” Cleveland coach J.B. Bickerstaff said. “I think that was the case for a lot of tonight. I thought we got to a place where we built a lead and we got away from being who we are.”\n\n\r\n                    With Karl-Anthony Towns and backup center Naz Reid out due to COVID-19 and a wrist injury, respectively, the Wolves had no match for Drummond inside.\n\n\r\n                    Going to the big man early allowed Cleveland to build a double-digit advantage as Drummond bullied his way to the rim against Minnesota’s smaller defenders. Drummond had 10 points and six rebounds in the first quarter, while the Cavaliers shot 70% from the field in the quarter.\n\n\r\n                    The Wolves closed the gap to 61-55 at halftime on a pair of 3s by Russell and Beasley, and then took control early in the third. The tantalizing scoring ability of Edwards, the No. 1 pick, was on display with 11 points in the third.\n\n\r\n                    Edwards was aggressive, getting to the rim with a variety of spin moves and driving layups. He also shot 4 of 7 from long range.\n\n\r\n                    “Twenty-three points from a 19-year-old rookie is fantastic,” Saunders said. “But we’re not asking them to do that every night. We’re just asking him to continue to grow and he’s doing that.”\n\n\r\n                    Russell hit a 3 to put Minnesota ahead 95-90 and walked to the bench with both arms raised following a Cleveland timeout. Cavaliers forwards Larry Nance and Cedi Osman stood near where Russell shot, arguing about defensive coverages.\n\n\r\n                    The Wolves held Cleveland to 18 points and 30.4% shooting in the fourth.\n\n\r\n                    “We had each other’s backs tonight,” Beasley said. “I heard a lot of talk, more than usual. In the paint in the second half, we made an emphasis of let’s not let them squash in the paint. We executed on the defensive end tonight.”\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: With three points early in the game, Drummond became the fifth active player with 9,000 points and 8,000 rebounds in his career, joining LeBron James, Dwight Howard, Tyson Chandler and LaMarcus Aldridge. Drummond began the day as the only player this season with at least 300 points and 250 rebounds. … Darius Garland had 17 points and five assists.\n\n\r\n                    Timberwolves: Reid missed his second straight game with a right wrist sprain. Saunders said Reid worked out before the game and was a game-time decision. Towns’ absence stretched to eight games since testing positive for COVID-19. … Juancho Hernangomez also missed his eighth straight game while in the league’s health and safety protocols. Jarrett Culver has missed the past three games with a left ankle sprain. … Guard Jaylen Nowell tied his career-high with 12 points off the bench.\n\n\r\n                    HOBBLED BUT EFFECTIVE\n\n\r\n                    Sexton left the game in the second quarter and appeared to aggravate the left ankle sprain that caused him to miss five games. He went down awkwardly after a jump shot and hopped away, but stayed in the game momentarily. \n\n\r\n                    He later went to the locker room before returning and working on the ankle with a trainer near the bench. Sexton played 32 minutes in his seventh game back since missing time with the injury.\n\n\r\n                    STILL SCORING\n\n\r\n                    Kevin Love missed his 18th game this season with a right calf strain, but had some news of his own to announce. Love took to Instagram to announce his engagement to Kate Bock, a Canadian model who has appeared in the Sports Illustrated swimsuit issue.\n\n\r\n                    Love wrote, “’Souls tend to go back to who feels like home.’ My Fiancé. The Joy of My Life,” on Instagram.\n\n\r\n                    UP NEXT\n\n\r\n                    The teams finish a home-and-home, back-to-back Monday in Cleveland.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997891.689968
}