{
  "game_id": "0022000285",
  "espn_id": "401267445",
  "date": "Jan 28, 2021",
  "matchup": "LAC @ MIA",
  "headline": "Clippers rally from 18 points down, top ailing Heat 109-105",
  "body": "MIAMI -- — Actual ticketholders were back at a Miami Heat game for the first time since March. The Los Angeles Clippers had many of them deciding to leave early.\n\n\r\n                    Nicolas Batum scored 18 points and the Clippers used a 20-2 run in the third quarter to help fuel what became a 109-105 victory over the short-handed and reeling Heat on Thursday night. \n\n\r\n                    Lou Williams had 17 points for the Clippers, who were again without Kawhi Leonard and Paul George because of the league’s virus protocols and Patrick Beverley with right knee soreness.\n\n\r\n                    “Big win for us tonight,\" Batum said.\n\n\r\n                    The Clippers won despite trailing by 18 early, the franchise’s biggest comeback win since rallying from 31 down to beat Golden State in a playoff game on April 15, 2019.\n\n\r\n                    “We just continue to keep playing, kept fighting, kept competing, just trying to play the right way,\" Clippers coach Tyronn Lue said.\n\n\r\n                    Tyler Herro returned after missing seven games with neck spasms and scored 19 points for Miami, which dropped its fifth straight and is 6-12 after going to the NBA Finals last season. The Heat welcomed back about 1,500 fans, all of whom had to get past virus-sniffing dogs or pass a rapid coronavirus test, for the first time since last season was suspended on March 11 as the pandemic was beginning.\n\n\r\n                    “This group is good in this locker room,\" Herro said. “And we're going to figure it out soon.\"\n\n\r\n                    Miami got 30 points from its two-way contract players, Gabe Vincent (18) and Max Strus (12). Bam Adebayo finished with 16 points, 13 rebounds and seven assists for Miami.\n\n\r\n                    The Heat were without seven players. Jimmy Butler was listed as questionable Thursday afternoon but was eventually downgraded to out and missed his 10th consecutive game because of the league’s virus protocols. Also out: Avery Bradley, Goran Dragic, Moe Harkless, Meyers Leonard, Chris Silva and Andre Iguodala, all injured.\n\n\r\n                    Miami had 33 points in the first 11 minutes — and 36 points in the next 25 minutes. The Clippers were within 50-48 at the half, then Batum had four 3-pointers in a third quarter where Los Angeles would outscore Miami 40-19.\n\n\r\n                    The Heat got within three in the final seconds, but the Clippers survived.\n\n\r\n                    “In a perfect world, we'd like to be in a better place than we are right now — but we're not,\" Heat coach Erik Spoelstra said. “We just have to continue to grind.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Reggie Jackson and Marcus Morris each had 16 for the Clippers. ... If the Clippers win Friday in Orlando, they’d be 15-5 and match the team’s best 20-game start in the L.A. era. The 1974-75 Buffalo Braves were 16-4. ... The Clippers improved to 5-0 after losses this season. ... They were assessed a technical with 27.5 seconds left for calling too many time-outs.\n\n\r\n                    Heat: Miami — playing game No. 18 — used its 13th starting lineup, tying Houston for the NBA’s most. The Heat used 15 regular-season lineups a year ago. ... Iguodala turned 37 on Thursday, sharing a birthday with Heat assistant Octavio de la Grana.\n\n\r\n                    WILD SWINGS\n\n\r\n                    The Heat won the first quarter by 14 points and fourth quarter by 15. The Clippers won the second by 12 and third by 21.\n\n\r\n                    WELCOME BACK\n\n\r\n                    It was a return for Clippers associate head coach Dan Craig, who spent 17 years with Miami before leaving after last season. Craig also won a G League championship with Miami’s affiliate, the Sioux Falls Skyforce.\n\n\r\n                    FORAN HONORED\n\n\r\n                    Longtime Heat strength and conditioning coach Bill Foran was announced Thursday as the inaugural recipient of the National Basketball Strength & Conditioning Coaches Association Lifetime Achievement Award. It will bear Foran’s name.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Visit Orlando on Friday.\n\n\r\n                    Heat: Host Sacramento on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997697.572192
}