{
  "game_id": "0021900489",
  "espn_id": "401161131",
  "date": "Dec 29, 2019",
  "matchup": "SAC @ DEN",
  "headline": "Barton, Porter each score 19 as Nuggets beat Kings 120-115",
  "body": "DENVER --  Michael Porter Jr. found out just before the opening tip he was getting his first career start. The rookie wasted little time making an impact.\n\nPorter scored a career-high 19 points while filling in for injured Gary Harris to help the Denver Nuggets hold off the skidding Sacramento Kings 120-115 on Sunday night.\n\nWill Barton also scored 19 points, including two free throws with eight seconds left on another night when Denver nearly lost a big lead in the fourth quarter.\n\n\"We got the stops we needed and got to the free throw line,\" Jamal Murray said.\n\nPorter sat out last season recovering from back surgery after being taken 14th overall in the draft, and he has been in and out of the rotation this year. He immediately took advantage of his opportunity Sunday, scoring six points in the first quarter, and nearly had his previous season high of 15 by halftime.\n\n\"I was just wanting to blend with that starting group and do what I could on the court,\" Porter said. \"I feel less nervous starting just because you go straight from warming up into the game instead of sitting down and watching. It felt pretty natural.\"\n\nThe Nuggets have won nine of 10 and finished their three-game homestand with two wins, coming back after a disappointing loss to New Orleans on Christmas. Nikola Jokic had a triple-double in the win over Memphis on Saturday night but was quieter against the Kings with 17 points and eight rebounds. He sat for most of the first half with three fouls and finished with five points.\n\nDe'Aaron Fox returned to the Kings lineup with 18 points and 13 assists. Nemenja Bjelica scored 27 but couldn't prevent Sacramento from losing its seventh in a row.\n\n\"We weren't guarding people from the beginning of the game,\" Buddy Hield said. \"We didn't keep the man we were guarding in front of us. This is the way we've played the past seven games.\"\n\nDenver gave up 42 fourth-quarter points to the Grizzlies and nearly gave away the game against the Kings. The Nuggets led by 14 midway through the final period but Sacramento hit four 3-pointers, two by Bjelica and one by Hield, who finished with 20 points and eight assists, to make it a three-point game.\n\nDenver sank six free throws down the stretch and held on. The Nuggets were 28 of 31 from the line, outscoring Sacramento by 16 on free throws.\n\n\"You give up 31 free throws to a playoff team, on their home court on a back end of a back-to-back, it's going to be a hard game to win,\" Kings coach Luke Walton said.\n\nJerami Grant scored 18 points and Mason Plumlee, a 54% free throw shooter, was 9 of 10 from the foul line to finish with 15.\n\nTIP-INS\n\nKings: Fox (lower back spasms) missed the loss to Phoenix on Saturday night and played just two minutes against Minnesota on Thursday. \"I felt all right. I felt obligated to go out and do what I need to do. It doesn't matter that I was in pain,\" Fox said. ... Marvin Bagley III was out for the second consecutive game with a sprained left foot.\n\nNuggets: Porter last started a game on Nov. 10, 2017, when he was playing for the University of Missouri. ... Harris missed his first game of the season with a bruised shin. ... Paul Millsap missed his second straight game with a bruised left knee.\n\nBIRD MAN\n\nJokic gets praise for his passing and shooting but he showed off some Larry Bird-like ballhandling skills in the third quarter when he dribbled behind his back twice to shake two different defenders and score on a layup.\n\n\"He can do everything,\" Murray said.\n\nUP NEXT\n\nKings: Host the Los Angeles Clippers on Tuesday night.\n\nNuggets: At the Houston Rockets on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996404.4760041
}