{
  "game_id": "0021600236",
  "espn_id": "400899686",
  "date": "Nov 25, 2016",
  "matchup": "PHX vs. MIN",
  "headline": "Wiggins, Timberwolves rally to beat Suns 98-85",
  "body": "PHOENIX --  A furious fourth quarter made Minnesota a winner on the road for just the second time this season.\n\nAndrew Wiggins scored 25 points, Karl-Anthony Towns added 22 and the Timberwolves rallied from a 10-point, fourth-quarter deficit to beat the Phoenix Suns 98-85 on Friday night.\n\nEric Bledsoe scored 23 for the Suns, who were just back from a six-game road trip.\n\nMinnesota used a 27-6 outburst to quickly erase the Phoenix lead and pull away, snapping a three-game losing streak.\n\nThe Timberwolves outscored Phoenix 31-10 in the fourth quarter.\n\n\"I think that was our best fourth quarter of the year,\" Minnesota coach Tom Thibodeau said.\n\nPhoenix's last field goal was Bledsoe's driving layup with 9:06 to play.\n\nThe Suns committed a season-high 26 turnovers, resulting in 23 Minnesota points.  Phoenix also was just 6 of 26 from 3-point range.\n\n\"Turnovers, defense, you know, the whole nine,\" Bledsoe said. \"We did everything possible to lose this game tonight.\"\n\nAll five Timberwolves starters reached double figures.\n\n\"They searched and they searched until they found something that worked,\" Suns coach Earl Watson said, \"and they stayed with it, which was Wiggins in pick-and-roll coverage.\"\n\nBrandon Knight added 15 points for Phoenix but only two in the second half. Devin Booker scored 11.\n\nFor much of the game, it looked like the Timberwolves were headed for another loss in what has been a disappointing start to the season.\n\n\"I think it's just us coming to a point where we didn't want the same story written about us,\" Towns said. \"I think we're all tired of reading the same articles and hearing the same chatter from everyone how our third and fourth quarters are a problem.\"\n\nPhoenix led by as many as 11 in the third quarter and was up 77-67 early in the fourth. But the Suns missed four of six free throws while the Timberwolves went on a 16-3 run. Towns grabbed a loose ball and scored inside to cap the surge and give Minnesota an 83-80 lead with 5  1/2 minutes to play.\n\nThe Timberwolves stretched it to 90-83 with 3:58 remaining when Wiggins' string of 15 consecutive missed 3-pointers came to an end.\n\n\"Things weren't going well in that game,\" Thibodeau said, \"but the fight was there and we just kept working the game and the game turned.\"\n\nPhoenix had been in control, although never by much, until its fourth-quarter collapse.\n\nKnight scored the last five points of the half to put Phoenix up 52-47. He made a 3-pointer from the corner as the shot clock expired with 34 seconds left and sank two free throws with 10.6 seconds to play until halftime.\n\nBledsoe scored all of the Suns' points in a 9-1 third-quarter run. His driving reverse layup capped the spurt and put Phoenix ahead 69-58 with 5:01 left in the quarter. The Suns led 75-67 entering the fourth.\n\nTIP-INS\n\nTimberwolves: The Timberwolves missed 14 of their first 15 shots in the second quarter. ... 6-foot-5 guard Zach LaVine had a soaring dunk over 7-1 Alex Len. ... Wiggins and Towns each scored seven in the fourth quarter\n\nSuns: Forward T.J. Warren missed the game with what the team called a mild head injury. ... Watson got his first technical of the season. ... Phoenix has won two in a row for the second time this season.\n\nTHREE AMIGOS\n\nFor the third game in a row, the Suns started a three-guard lineup that included Bledsoe, Knight and Booker. Phoenix is 1-2 with that trio as starters.\n\nUP NEXT\n\nTimberwolves: Minnesota wraps up a three-game trip at Golden State on Sunday.\n\nSuns: Phoenix plays a rare afternoon game, hosting Denver on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764996002.180704
}