{
  "game_id": "0022400762",
  "espn_id": "401705328",
  "date": "Feb 10, 2025",
  "matchup": "DAL vs. SAC",
  "headline": "DeRozan scores 42 points, including OT winner, as Kings edge depleted Mavericks 129-128",
  "body": "DALLAS -- — DeMar DeRozan scored a season-high 42 points, including a baseline floater with 2 seconds left in overtime, and the Sacramento Kings beat the depleted Dallas Mavericks 129-128 on Monday night.\n\n\r\n              Zach LaVine and Malik Monk each scored 17 points for the Kings in the opener of a three-game trip. Domantas Sabonis had 16 points and 15 rebounds.\n\n\r\n              The Mavericks lost center Daniel Gafford to a sprained right knee after he had a knee-to-knee collision with Monk early in the second quarter.\n\n\r\n              Dallas already was playing without power forwards Anthony Davis and P.J. Washington, and centers Dereck Lively II and Dwight Powell — all because of injuries.\n\n\r\n              Kyrie Irving scored 30 points for the Mavericks. Irving was added to the All-Star roster earlier in the day, replacing Davis.\n\n\r\n              Takeaways\r\n              Kings: Improved to 14-8 under interim coach Doug Christie after going 13-18 under Mike Brown, who was fired Dec. 27. Sabonis leads the NBA with 47 double-doubles in 50 games.\n\n\r\n              Mavericks: On the night when Luka Doncic made his Los Angeles Lakers debut after he was part of the Feb. 1 trade that brought Davis to Dallas, multiple fans were escorted out of American Airlines Center from a group that chanted his name during multiple free-throw situations.\n\n\r\n              Key moment\r\n              The Mavericks’ final possession ended with Spencer Dinwiddie called for an offensive foul at midcourt.\n\n\r\n              Key stat\r\n              The Kings led 18-5 in second-chance points and outrebounded the Mavericks 50-33.\n\n\r\n              Up next\r\n              On Wednesday, the Kings will play the first of back-to-back games at New Orleans to finish their play before the All-Star break while the Mavericks will host Golden State.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997159.245419
}