{
  "game_id": "0022301218",
  "espn_id": "401616472",
  "date": "Dec 08, 2023",
  "matchup": "ATL @ PHI",
  "headline": "Embiid shakes off late leg injury to lead 76ers to a 125-114 win over Hawks",
  "body": "PHILADELPHIA -- — Joel Embiid had 38 points and 14 rebounds and shook off an injury scare late as the Philadelphia 76ers held off the Atlanta Hawks 125-114 on Friday night.\n\n\r\n              Tyrese Maxey added 30 points, including a backbreaking 3-pointer with 1:20 to play in a 13-0 run that broke open a nip-and-tuck game as the Sixers improved to 14-7 with their second straight victory.\n\n\r\n              “He was great,” Embiid said of Maxey. “I keep reminding him that he has to be aggressive. And he got to the free-throw line and got his open shots.”\n\n\r\n              De’Andre Hunter led the Hawks with 24 points while Bogdan Bogdanovic and Dejounte Murray each added 20. Atlanta played without Trae Young, who missed the game with what the team described as an illness. Jalen Johnson missed his sixth straight game with a left wrist fracture.\n\n\r\n              “The NBA provides you times of the season where there is adversity,” Hawks coach Quin Snyder said. “I thought without Trae and J.J., our guys really competed. Obviously, the game didn't finish on a high level for us. But I don't necessarily think that the score was indicative about how hard we played through portions of the game and we got great efforts from the bench as well.”\n\n\r\n              Embiid appeared to injure his left leg on a drive down the lane with just over 4 1/2 minutes left as he tried to make a move in the lane with Atlanta ahead 109-108. Even while hunched over and walking with a limp, Embiid remained in the game and scored six points in the final moments. “I'm not sure what happened,” Embiid said. “I've got to go and watch the play. I just twisted it.”\n\n\r\n              Maxey and De'Anthony Melton picked up more of the scoring load during the run that put the game away.\n\n\r\n              “A couple of plays, (Embiid) said to be a little more aggressive so he could get a little break,” Maxey said. “And then, we got into the two man game where we got a couple shots. But he's always on me about shooting and being aggressive because he feels if I'm aggressive, it opens up more looks for him.”\n\n\r\n              Maxey scored 16 of his 30 points in the fourth quarter when he played for long stretches with Embiid on the bench. \n\n\r\n              “I wanted the ball at the beginning of the fourth because I wasn't happy with how I played at the beginning of the second quarter” Maxey said, referring to the other prolonged time when Embiid was off the floor.\n\n\r\n              Atlanta had taken a 68-62 lead at the half thanks to an 45-27 second quarter keyed by Bogdanovic and Hunter with 13 each.\n\n\r\n              “We found a groove with each other and a rhythm of the game and the ball moving around,” Murray said. “We made stops and were getting out running. And then, when we got to the last five or six minutes we stopped executing.”\n\n\r\n              Melton had 15 points while Tobias Harris added 13 for the Sixers. \n\n\r\n              Saddiq Bey scored 16 for Atlanta while Clint Capela added 15 points and grabbed a game-high 16 rebounds.\n\n\r\n              UP NEXT Hawks: Return home to face Denver on Monday night.\n\n\r\n              76ers: Hosts Washington on Monday night\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996302.027217
}