{
  "game_id": "0021700116",
  "espn_id": "400974867",
  "date": "Nov 01, 2017",
  "matchup": "DAL @ LAC",
  "headline": "Clippers roll to easy 119-98 victory over Mavericks",
  "body": "LOS ANGELES --  Clippers coach Doc Rivers keeps saying that with nine new players and so many injuries, he hasn't had time to install much of a half-court offense.\n\nSo his early message has been simple -- keep moving the ball and run at every opportunity.\n\nThat worked well enough Wednesday night, when the Clippers beat the Dallas Mavericks 119-88 to snap a two-game losing streak.\n\n\"This is the first game in three games that we got our pace back,\" Rivers said. \"When our guards are going downhill, then that tells you our pace is back.\"\n\nThe Clippers are adjusting to life without point guard Chris Paul (traded to the Rockets) and his replacement, the injured Milos Teodosic.\n\nIt doesn't hurt their cause that they have several players who excel at passing the ball, from holdovers Blake Griffin and Austin Rivers, to newcomers Danilo Gallinari, Patrick Beverley and Lou Williams.\n\n\"We have more fast, athletic guys than we had last year,\" Austin Rivers said. \"When we play at that speed, it's hard to guard us.\"\n\nThe Clippers were given a lesson in speed in their previous game Monday, a 141-113 pasting by the NBA's premier running team, the champion Golden State Warriors.\n\nThe Mavs are hardly in the class with the Warriors right now, falling to 1-8 with their fourth consecutive loss. On Wednesday, they started veteran guard Devin Harris in a failed effort to add some spark.\n\n\"Everything is an attempt to try and get out of this rut,\" Harris said. \"We have to get back to playing simple basketball.\"\n\nThe Clippers spread their offense around. Griffin had 20 points, seven assists and six rebounds. Austin Rivers added 19 points, Williams 17 points and Gallinari 14 points, six rebounds and four assists.\n\nThe Clippers outscored the Mavs 48-26 in the paint and outrebounded them 48-38.\n\n\"We had a couple of catastrophic turnovers that got them going in their building,\" Mavericks coach Rick Carlisle said. \"Before you knew it, we're playing out of a hole again. Our margin for error is extremely slim.\"\n\nRookie Dennis Smith Jr. led Dallas with 18 points despite shooting just 6 for 15 from the field. Harrison Barnes added 14 points and Dirk Nowitzki had 13 points and eight rebounds.\n\nTIP-INS\n\nMavericks: Averaged only 98.3 points per game during their first eight games. Said Carlisle: \"When you keep losing the possession game, it's very tough to win. We have to get consistency with rebounding and turnovers. We have to get better in all areas.\"\n\nClippers: After shooting 29.9 percent in his first five games with Los Angeles, Gallinari was 8 for 15 against the Warriors on Monday. Doc Rivers said he was playing it low key with his new forward: \"All I told him was to keep shooting it. Nobody ever told me that.\"\n\nAFTERNOON DELIGHT\n\nThe Clippers next play back-to-back 12:30 p.m. games at Staples Center on Saturday and Sunday. Doc Rivers is less than thrilled.\n\n\"Those are tricky games,\" Rivers said. \"We have to be ready for them. They're tough. They sneak up on you so quick.\"\n\nRivers said he had asked the league not to schedule back-to-back afternoon games.\n\n\"We did, and it worked so well,\" he said. \"I had one request after the season -- no back-to-back afternoon games. And they said, OK. And they gave it to us anyway. My pull isn't what it used to be.\"\n\nLOSING START\n\nDallas' 1-8 start is the worst in the NBA, but it has a long way to go before approaching the franchise record for futility.\n\nThe 1993-94 Mavs started 1-23.\n\nNEXT UP\n\nMavericks: Return home Friday to host the Pelicans.\n\nClippers: Play their fourth of five consecutive home games on Saturday against the Grizzlies.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993975.911482
}