{
  "game_id": "0022200186",
  "espn_id": "401468341",
  "date": "Nov 12, 2022",
  "matchup": "DET vs. BOS",
  "headline": "Tatum scores 43, Celtics beat Pistons for 6th straight win",
  "body": "DETROIT -- — Jayson Tatum scored 28 of his season-high 43 points in the first half as the Boston Celtics beat the Detroit Pistons 117-108 on Saturday night for their sixth straight win.\n\n\r\n              Tatum also had 10 rebounds, Grant Williams had 19 points and 10 rebounds and Marcus Smart added 18 points and 10 assists in Boston’s second win against Detroit in four days. The Celtics won 128-112 at home on Wednesday.\n\n\r\n              “That was a chaotic, hectic game, and that's what I thrive on,” Smart said. “We were short-handed tonight, but a lot of guys stepped up and made it a real team effort.”\n\n\r\n              Bojan Bogdanovic scored 28 points to lead Detroit, and rookie Jaden Ivey added a season-high 26. Marcus Bagley III made his season debut after missing the first 13 games with a sprained knee and finished with four points and four rebounds in 17 minutes.\n\n\r\n              “Great players are going to do what they do,” Pistons coach Dwane Casey said. “You can account for that, but you can’t let role players have big nights.”\n\n\r\n              Both teams were missing one of their most important players. The Pistons' Cade Cunningham will be out for at least a week with shin soreness, while the Celtics' Jaylen Brown got the night off to deal with a knee contusion.\n\n\r\n              “With it being the second half of a back-to-back, and (Brown's) knee having less than 24 hours to heal, we decided it was the best move to get him out for tonight,” Celtics coach Joe Mazzula said. “We're hoping he'll be ready for Monday.”\n\n\r\n              Bogdanovic had 15 points in the first half, including a pair of free throws with 0.1 seconds left in the second quarter that gave Detroit a 57-55 lead. The Pistons shot 47.4% (9-19) on 3-pointers in the half, but only 32% on 2-pointers.\n\n\r\n              Tatum had 15 points for Boston, who had a 20-12 edge in points in the paint, but only hit seven of 24 3-pointers in the opening half.\n\n\r\n              Tatum and Bogdanovic kept scoring after halftime. Bogdanovic finished with nine of Detroit’s 24 points in the third quarter, but Tatum had 15 of Boston’s 34. That put the Celtics up 89-81 going into the final 12 minutes.\n\n\r\n              TIP IN\n\n\r\n              Celtics: Luke Kornet picked up a technical foul in the third quarter for leaving the bench when it appeared Derrick White had been injured in a collision with Ivey. White remained on the floor for about a minute before being helped up by Ivey and Blake Griffin. ... Griffin was loudly booed whenever he touched the ball, as he has been since he was bought out by the Pistons in the 2020-21 season and signed with Brooklyn.\n\n\r\n              Pistons: Detroit wore their black jerseys with blue and red trim, as they often do at home, but Hamadou Diallo’s last name was spelled “Daillo” on the back of his No. 6 jersey. \n\n\r\n              A SPECTACULAR MISS\n\n\r\n              Smart and Tatum nearly teamed up for the dunk of the year, but just missed. With Smart heading in for an uncontested fast-break dunk, he threw the ball off the backboard instead. Tatum mishandled the rebound, turning an easy two points into a turnover.\n\n\r\n              “When I'm going in and Jayson or Jaylen are yelling me to throw it off the backboard, I'm going to do it,\" Smart said. “I was a little mad, because I thought it might cost me a 10-assist night, but I got there in the end.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host the Oklahoma City Thunder on Monday.\n\n\r\n              Pistons: Host the Toronto Raptors on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: www.apnews.com/hub/NBA and www.twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994393.8978088
}