{
  "game_id": "0021800593",
  "espn_id": "401071269",
  "date": "Jan 07, 2019",
  "matchup": "HOU vs. DEN",
  "headline": "Harden, Capela help Rockets over Nuggets 125-113",
  "body": "HOUSTON --  With James Harden getting double-teamed almost every time he had the ball Monday night against the Denver Nuggets, he looked for other Houston Rockets to step up and make plays.\n\nChief among them was Clint Capela, who set a career high with 31 points as the Rockets beat the Nuggets 125-113.\n\n\"He did what he was supposed to do,\" said Harden, who had 32 points. \"He finished. He played extremely well. Played hard.\"\n\nP.J. Tucker set a career high with seven 3-pointers and scored a season-high 21 points to help Houston win for the 12th time in 14 games. Capela had 19 points by halftime as Harden fed him again and again.\n\n\"Whenever I'm under the rim and you put a little on me what's going to happen is that 99 or 100 percent of the time I'm going to dunk the ball,\" Capela said. \"This is what happened tonight and I did a great job of finishing aggressive under the rim.\"\n\nHouston was up by 11 after two free throws by Torrey Craig with about 5 1/2 minutes left before Tucker and Harden made 3-pointers on consecutive possessions to make it 117-100 about a minute later.\n\nGerald Green had 21 points and made six 3s on a night Houston made 22 3s for its sixth game this season with at least 20.\n\n\"We're just a real tough team when we're knocking down shots like that,\" Green said.\n\nNikola Jokic scored 24 points for the Nuggets, who had a five-game winning streak snapped.\n\n\"Give them credit,\" Nuggets coach Michael Malone said. \"You know Harden is going to get his, but when P.J. Tucker and Gerald Green score the amount of 3s that they made, I believe 13 combined, that's a tough one to overcome.\"\n\nHarden had 14 assists, six 3-pointers and scored at least 30 points for the 13th straight game.\n\n\"He's probably the hardest guy in the NBA to guard,\" Malone said.\n\nCoach Mike D'Antoni enjoys watching the different things Harden does to help his team win night after night.\n\n\"Whatever they throw at him, he'll find the best play,\" D'Antoni said. \"He'll also find a way to score. He'll find his way, but he'll also get everyone involved.\"\n\nTIP-INS\n\nNuggets: Malone said Will Barton (hip) is making progress and could return in the next couple of weeks. ... Morris added 21 points off the bench.\n\nRockets: Houston traded Michael Carter-Williams and cash considerations to the Chicago Bulls on Monday for a protected second-round pick in the 2020 draft. The Bulls then waived the guard following the trade. ... Chris Paul missed his eighth game in a row with a strained left hamstring. ... Eric Gordon missed his fourth straight game with a bruised right knee.\n\nWHAT A PLAY\n\nThe Rockets led 70-60 at halftime after Harden made two 3-pointers in the last 90 seconds of the second quarter. The first of those shots is sure to show up on highlight reels, as Murray slipped and fell to the court trying to guard him before Harden stepped back for the basket.\n\nMAGIC NUMBER?\n\nWith Monday's win the Rockets improved to 59-2 when scoring at least 120 points under D'Antoni.\n\nTHEY SAID IT\n\nJokic on Denver's struggles against Houston, which has won nine straight in the series: \"They beat us at our place and they beat us here. Last year, we didn't win one time, so that team gives us a problem, but we have to find a way to beat them and play (better) against them.\"\n\nUP NEXT\n\nNuggets: Visit the Miami Heat on Tuesday night.\n\nRockets: Host Milwaukee Bucks on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995301.462821
}