{
  "game_id": "0021600419",
  "espn_id": "400899861",
  "date": "Dec 20, 2016",
  "matchup": "LAL @ CHA",
  "headline": "Walker leads Hornets past hot-shooting Lakers, 117-113",
  "body": "CHARLOTTE, N.C. --  After watching the Los Angeles Lakers set a season high in points in a half, knock down 12 of 18 3-pointers and seize a 73-59 advantage at intermission, Hornets coach Steve Clifford was unusually calm at halftime.\n\n\"I was surprised because he wasn't mad, actually,\" Charlotte guard Nicolas Batum said. \"He just told us to wake up.\"\n\nThe Hornets did. Led by 15 third-quarter points from guard Kemba Walker, 11 fourth-quarter points from Marco Belinelli and even a little bit of defense in the second half, the Hornets rallied from a 19-point deficit to beat the Lakers 117-113 on Tuesday night.\n\nWalker had 28 points and 10 assists and also contributed a key offensive rebound with 27.9 seconds left to set up a tiebreaking jumper by Batum with 13 seconds remaining.\n\nBatum had 23 points on 8-of-12 shooting and added 10 assists. Belinelli finished with 13 points.\n\nJordan Clarkson paced the Lakers with 25 points behind 7-of-9 3-point shooting, and Nick Young added 24 points while hitting 5 of 10 from 3-point range.\n\nLos Angeles made 16 of 33 3-point attempts (48.5 percent), but the Hornets still secured their second straight victory.\n\nThe Lakers, meanwhile, fell for the 10th time in their last 11 games.\n\nLos Angeles made four 3-pointers, including three from Clarkson, during a 15-0 run bridging the first and second quarters to lead 53-35. Clarkson made five 3-pointers before missing a shot from beyond the arc while the Lakers constructed that big halftime advantage.\n\nLos Angeles coach Luke Walton knew his team couldn't coast, though.\n\n\"You've got to know that when you're playing a playoff team that building up a lead in the first half doesn't really mean much,\" Walton said \"They're not going to fold. There's a reason they've had success the last couple years. You've got to be ready to match that intensity.\"\n\nIn the third quarter, the Lakers' lead evaporated when the Hornets mirrored the 15 unanswered points to close to 77-75 with 8:00 left in the quarter. Batum and Walker each had six points in that stretch.\n\nWalker made 7 of 11 shots in the third, helping the Hornets lead 88-83 with 4:15 left in the quarter. It quickly disappeared after an 11-point spurt by the Lakers.\n\nBelinelli made 3 of 5 3-point attempts in the fourth quarter to help the Hornets close the deficit, including a 3-pointer with 2:22 remaining to knot the score 113-113.\n\n\"It should have never been that close,\" Young said. \"It hurts.\"\n\nTIP-INS\n\nLakers: The Lakers' 16 3-pointers matched a season high. ... D'Angelo Russell returned after missing one game with a sore left knee. He had missed 12 games with the injury before returning Dec. 11. ... Forward/center Tarik Black missed the game with a sprained ankle.\n\nHornets: Batum logged his eighth double-double of the season. . The Hornets have now twice overcome 19-point deficits for victories this season. They also did so Oct. 28 at Miami. . Charlotte held a moment of silence before the game for TNT sideline reporter Craig Sager, who died this week from leukemia.\n\nNANCE HURT\n\nForward Larry Nance Jr. limped off the court holding his left knee with 4:15 left in the third quarter after scrambling for a loose ball. He did not return.\n\nWalton had no updates afterward, but was worried about the possibility of Nance missing time with the injury.\n\nINGRAM HOMECOMING\n\nRookie forward Brandon Ingram hails from Kinston, about a four-hour drive from Charlotte. More than 500 people from his hometown made the trip to watch his first appearance in North Carolina since he played at Duke. Kinston's population is about 21,000. Ingram scored his first bucket of the game on a driving spin move with 3:01 left in the second quarter, earning a loud chorus of oohs and cheers from the Spectrum Center crowd.\n\nUP NEXT\n\nLakers: Play at Miami on Thursday night in the sixth stop on a seven-game trip.\n\nHornets: Host the Chicago Bulls on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995420.329769
}