{
  "game_id": "0021600435",
  "espn_id": "400899877",
  "date": "Dec 21, 2016",
  "matchup": "PHX vs. HOU",
  "headline": "Harden, Gordon lead Rockets to 125-111 win over Suns",
  "body": "PHOENIX --  A night after their 10-game winning streak came to a halt with a two-point loss at home to San Antonio, the Houston Rockets looked ready to start a new run of victories.\n\nThe Rockets went from making 38 percent of their shots, including just 6 of 38 3-pointers, to a 53.5 field goal percentage and 18 made 3s on 38 attempts. It added up to a 125-11 win over the Phoenix Suns on Wednesday.\n\nJames Harden had 27 points and 14 assists, and the Rockets earned their 11th victory in 12 games.\n\n\"We've been playing good basketball. (Tuesday against) San Antonio is just a different animal,\" Rockets coach Mike D'Antoni said. \"It's a good bounce-back win, back-to-back, and the guys showed some heart.\"\n\nEric Gordon added 24 points off the Rockets' bench, shooting 7 of 13 on 3s. Patrick Beverley finished with a season-high 18 points, nine assists and nine rebounds.\n\nHarden's biggest shot came with 4:19 left, a pull-up 3 for a 120-100 lead. He bent down and moved his arms in a swimming motion in celebration as he ran back to the bench.\n\n\"He just knows when to pick the spots and he knows what he has to do, and he controls the whole game,\" D'Antoni said.\n\nDevin Booker's 28 points led the Suns, who have lost four in a row. T.J. Warren added 19 and Brandon Knight 17.\n\nGordon hit back-to-back 3s midway through the fourth quarter, the second one at the 6:39 mark for a 110-95 lead.\n\n\"It's tough to really slow us down, knocking the 3s down and also making layups,\" Gordon said. \"Teams just have to pick their poison against us.\"\n\nThe Rockets led by as many as 13 in the third, only to see the Suns cut it to 86-84 on a tip-in by P.J. Tucker with 1:19 left. Harden drew a questionable foul call against Tucker on a 3-point try with 4.3 seconds left and made all three free throws to give Houston a 91-84 lead entering the fourth.\n\nThe Rockets led 30-26 after the first quarter, when the Suns struggled to get back in transition. Houston scored 12 fast-break points in the period.\n\nHarden took only two shots in the quarter but excelled as a passer, handing out seven assists.\n\n\"Stopping people in transition, it's mostly on the defense. It's something we have been working on in practice but in game time we still are not doing,\" Booker said. \"Obviously, James being the playmaker, he finds the open man. When they have so many shooters on the floor, it's tough to guard.\"\n\nGordon hit four 3s in the second quarter, Harden drove for a layup with 0.3 seconds left and Houston took a 61-55 lead into halftime.\n\nTIP-INS\n\nRockets: Before the game, D'Antoni reminisced about his time in Phoenix, where he was once a popular head coach. He received some applause when he was introduced. \"It's special, there's no doubt,\" D'Antoni said. \"It was special to live here, and the people and the fans, it was a good time.\" ... F Montrezl Harrell made his first start of the season and second of his career. He scored 17 points, tying a career high.\n\nSuns: Tucker has become the de facto \"stopper\" on defense, asked to limit the opposing team's best player. He faced Harden on Wednesday. \"You go through and ask every (NBA) player, if you were to ask them about P.J. Tucker, I guarantee you every one would say he's one of the top defenders in the league,\" Suns coach Earl Watson said. ... The crowd of 18,055 marked the second home sellout of the season for the Suns.\n\n`BOOKED' FOR FLIGHT\n\nBooker, on the night of his bobblehead giveaway, had three dunks in the first quarter. Two came when he cut to the hoop and took feeds from Tyson Chandler and Tucker, respectively, before elevating to the basket. But Booker's best came with 29.1 seconds left in the game, when he jammed over the Rockets' Kyle Wiltjer.\n\nHARDEN'S DIMES\n\nThe NBA's leading assist man, Harden didn't fail to disappoint. He fed Harrell with a behind-the-back pass for a layup in the first quarter, then did it again in the third, flipping another trick pass to Beverley for an easy basket.\n\nUP NEXT\n\nRockets: At Memphis on Friday. Houston will play the Suns for the second time in five days next Monday.\n\nSuns: Host Philadelphia on Friday before hitting the road for four of the next five.",
  "source": "espn_api",
  "crawled_at": 1764995987.413776
}