{
  "game_id": "0021801085",
  "espn_id": "401071758",
  "date": "Mar 22, 2019",
  "matchup": "MIL vs. MIA",
  "headline": "Antetokounmpo scores 27, Bucks beat Heat 116-87",
  "body": "MILWAUKEE --  Giannis Antetokounmpo and the Milwaukee Bucks won the game. Dwyane Wade countered with a classy move as the Miami Heat trudged off the court.\n\nAntetokounmpo scored 27 points, had eight rebounds and seven assists after missing two games with a sprained right ankle and helped the NBA-leading Bucks to an easy 116-87 victory over the Heat on Friday night.\n\nWade and Antetokounmpo gave each other their respective jerseys after the game. Khris Middleton peeled off his uniform top and handed it to Wade, too.\n\n\"Big moment for me,\" Antetokounmpo said of the exchange. \"I had a chance to talk to him a little bit, thank him for everything he did for the game. (He's a) Hall of Famer, three-time champ, one of the best players to ever play the game. Just him giving me his jersey and me giving my jersey, it is big.\"\n\nAntetokounmpo wasn't shy about getting his game-used jerseys signed.\n\n\"You know, I sent it back to D-Wade so he can sign them,\" Antetokounmpo said. \"He sent it back to me signed.\"\n\nWade said he enjoyed watching football and soccer players swap jerseys after the game.\n\n\"It's a sign of respect,\" Wade said. \"(With this being,) my last year, I wanted to do something that's kind of cool and show a sign of respect.\"\n\nWade, who's in his 15th season with Miami and the final of 16 seasons overall, hustled back to the Heat locker room, grabbed a spare jersey and sent it over to Middleton in the Bucks' locker room.\n\nMiddleton was touched by Wade's move.\n\n\"He is definitely a mentor, somebody I watch from afar,\" Middleton said. \"(He's) one of my favorite players growing up. Still one of my favorite players to this day.\"\n\nWade was honored with a video tribute of his days starring at Marquette (2001-03) during a timeout in the first quarter. He tapped his heart and smiled when he was shown on the video display. He also got a standing ovation from the sellout crowd.\n\n\"It was cool when they flashed to me,\" Wade said. \"They caught me smiling and reminiscing on highlights.\"\n\nUnfortunately for the Heat, there was little else to celebrate.\n\n\"Being on the floor with Giannis and his ability to drive and the shooters they put around him make them tough to guard,\" Wade said. \"We haven't cracked the code yet.\"\n\nOn the other hand, the Bucks had an answer for whatever the Heat tried.\n\n\"We're an attack-the-paint team and they basically shut that off,\" Heat head coach Erik Spoelstra said. \"It obviously required one of our better games and it was probably one of pour poorer games we've had in a while.\"\n\nMiddleton added 18 points and 10 assists for a career-best three consecutive games with a double-double for Milwaukee, which improved to (29-6) for the second-best home record in the NBA behind the Denver Nuggets (30-6) and secure their most home victories since 2000-01.\n\nThe Bucks (54-19) clinched their first Central Division title since 2000-01 on Thursday night when the Golden State Warriors beat the Indiana Pacers.\n\nThe win came with a brief scare for the Bucks: Antetokounmpo went down in a mix of players after stealing a pass from Goran Dragic early in the second quarter. Milwaukee immediately called a timeout and after a few moments, Antetokounmpo limped to the bench favoring his right leg. A short rest got him right back on the court.\n\nHassan Whiteside came off the bench to score 14 points and grab 10 rebounds, Kelly Olynyk added 13 and Bam Adebayo and Wade each had 12, but it wasn't nearly enough as the Bucks took the season series 3-1 for their 16th series win of the season out of a possible 22, including its 11th straight against Eastern Conference opponents.\n\nLast Friday night, the Bucks staged a historic comeback in their 113-98 win over the Heat in Miami. Down 20 points at the half, Milwaukee outscored the Heat 71-36 in the second and won by 15 points. It was the first time in NBA history that a team was down by 20 at halftime and went on to win by at least 15.\n\nSince that loss, the Heat (35-37) had won three straight and are clinging to the eighth spot in the playoffs. The Orlando Magic (35-38) beat the Memphis Grizzlies 123-119 to keep the pressure on Miami.\n\nLeading 63-51, George Hill hit a 3-pointer that gave the Bucks an 11-point lead midway through the third and the Bucks slowly built it up to a 25-point margin. James Johnson knocked Ersan Ilyasova into the first row of courtside seats with a hard foul in the closing seconds. A quick review determined it had been a three-point attempt. Ilyasova made two of the three foul shots and gave Milwaukee a 94-69 lead heading into the final quarter.\n\nTIP-INS\n\nHeat: Whiteside had three blocked shots in the first half. ... F/G Justise Winslow (right thigh bruise) and G/F Rodney McGruder (left knee soreness) did not play.\n\nBucks: The Bucks were 9-1 in February, but March has been a struggle. They are 7-5 in the first 12 games.\n\nSTAT LINES\n\nThe Bucks improved to 22-1 when shooting 50 percent or better. Milwaukee was 50.6 percent (43 of 85) against the Heat, who shot 37.6 percent (32 for 85). The Bucks have outshot their opponents in 54 games this season and are 52-2 in those games. Milwaukee is 7-0 this season when they shoot 50 percent or better and hold the opponent under 40 percent.\n\nUP NEXT\n\nHeat: Play at Washington on Saturday.\n\nBucks: Host the Cleveland Cavaliers on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994457.540218
}