{
  "game_id": "0022400297",
  "espn_id": "401704863",
  "date": "Nov 27, 2024",
  "matchup": "PHX vs. BKN",
  "headline": "Tyrese Martin scores a career-high 30 points, leading the Nets past the Suns 127-117",
  "body": "PHOENIX -- — Tyrese Martin scored a career-high 30 points, Dennis Schroder added 29 and the injury-depleted Brooklyn Nets beat the Phoenix Suns 127-117 on Wednesday night.\n\n\r\n              The Nets have won four of their last five games. The Suns have lost seven of nine.\n\n\r\n              Martin shot 10 of 13 from the field, including 8 for 10 from 3-point range, in his best NBA performance by a wide margin. He had scored just 33 points in 21 career games before Wednesday.\n\n\r\n              Ben Simmons had 14 points, nine rebounds and eight assists for Brooklyn. \n\n\r\n              Devin Booker led the Suns with 31 points. Kevin Durant had 30 points against his former team, but also seven turnovers.\n\n\r\n              The Nets used a 17-3 run to take an 80-66 lead midway through the third quarter. Brooklyn had a 96-84 lead entering the fourth.\n\n\r\n              It was 63-all at halftime. Martin scored 17 points before the break, making 5 of 6 3-pointers. \n\n\r\n              The Nets were without several key players, including leading scorer Cam Thomas (hamstring) and forwards Nic Claxton (back) and Noah Clowney (ankle). \n\n\r\n              Takeaways\r\n              Nets: Brooklyn looked just fine without Thomas, who is averaging nearly 25 points per game. Martin's big game was obviously helpful, and Trendon Watford added 18 points off the bench. Simmons was also a bright spot with a good all-around game.\n\n\r\n              Suns: It was a sloppy game for Phoenix, which gave up 24 points off 17 turnovers.\n\n\r\n              Key moment\r\n              Martin was fouled by Durant while shooting a 3-pointer with 0.1 seconds left in the third quarter. Martin made two of three free throws to give the Nets a 12-point cushion heading into the fourth.\n\n\r\n              Key stat\r\n              Martin's career high in points was six before Wednesday. He was a second-round draft pick by the Warriors in 2023 and spent last season in the G League.\n\n\r\n              Up next\r\n              The Nets host the Magic on Friday. The Suns host the Warriors on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998243.337325
}