{
  "game_id": "0022200459",
  "espn_id": "401468614",
  "date": "Dec 19, 2022",
  "matchup": "LAL @ PHX",
  "headline": "Paul scores season-high 28, Suns roll past Lakers 130-104",
  "body": "PHOENIX -- — It looked like Father Time might be making some gains on the 37-year-old Chris Paul over the past few months.\n\n\r\n              The 12-time All-Star proved on Monday night he's not going down without a fight.\n\n\r\n              Paul scored a season-high 28 points, Deandre Ayton added 21 points and 11 rebounds and the Phoenix Suns rolled past the Los Angeles Lakers 130-104. \n\n\r\n              The Suns did just about everything well in the blowout win. They shot 50% from the field, made 20 3-pointers, had a 51-36 rebounding advantage and just eight turnovers.\n\n\r\n              “When we play like that, it's tough to stop us,” Paul said.\n\n\r\n              The game was almost more notable for who wasn’t playing instead of the action on the court. The Lakers were missing their All-Star trio of LeBron James (left ankle soreness), Anthony Davis (right foot soreness) and Russell Westbrook (left foot soreness).\n\n\r\n              The Suns were missing six players, including three-time All-Star Devin Booker (right groin soreness), who scored a season-high 58 points in Saturday’s win over the Pelicans.\n\n\r\n              Paul had his best scoring game of the season in Booker's absence, shooting 9 of 18 from the field, including 3 of 5 from 3-point range. The point guard had a slow start to the year, coming into the game averaging a career-low 11.1 points per game, but he's been more productive over the past few weeks since returning from a heel injury.\n\n\r\n              Paul's built his stellar career on passing the basketball and not necessarily scoring, but with Booker on the bench, the Suns needed his production.\n\n\r\n              “I was happy to see him aggressive, knocking down shots and taking shots,” Suns coach Monty Williams said. “Everyone on the team, we tell Chris to shoot the ball. It's the most unbelievable thing ever — having to tell a Hall of Fame player to shoot.”\n\n\r\n              Paul said he doesn't mind that Williams and his teammates are always bugging him to shoot.\n\n\r\n              “I guess it could be worse,” Paul said laughing. “They could tell me not to shoot.”\n\n\r\n              The Suns have won three straight, bouncing back after dropping five in a row. All five starters scored at least 15 points.\n\n\r\n              Phoenix also has a six-game winning streak over the Lakers during the regular season.\n\n\r\n              Phoenix led by 26 points early in the third quarter, but the Lakers cut that advantage to 91-77 late in the third. The Suns responded with back-to-back 3-pointers from Ish Wainright and Landry Shamet and took a 99-77 lead into the final quarter.\n\n\r\n              “That is a well-oiled machine over there,” Lakers coach Darvin Ham said. “They took care of business over there tonight and I felt that our guys competed to best of their ability.”\n\n\r\n              Dennis Schroder led the starless Lakers with a season-high 30 points. He shot 12 of 19 from the field. Kendrick Nunn scored 17 points off the bench. Lonnie Walker IV and Thomas Bryant both added 16 points.\n\n\r\n              “End of the day, it is the next man up mentality,” Schroder said. “Everybody has to be ready to play and compete at the highest level. You can’t control if someone is going to be out.”\n\n\r\n              The Suns jumped out to a 38-24 lead, shooting 66.7% in the first quarter. Paul scored 14 points. Torrey Craig made a wide-open 3-pointer just before the halftime buzzer to give the Suns a 68-44 advantage.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: G Austin Reaves (right ankle sprain) and G Juan Toscano-Anderson (right ankle sprain) were not available.\n\n\r\n              Suns: Ayton returned after missing two games. ... Along with Booker, F Cameron Johnson (right meniscus tear), F/C Jock Landale (concussion), G Cameron Payne (right foot strain) and G Duane Washington Jr. (left hip muscle strain) were not available. ... Hosted a 43rd consecutive sellout crowd. ... Craig scored 17 points on his 32nd birthday.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Travel to face Sacramento on Wednesday.\n\n\r\n              Suns: Host Washington on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994144.285541
}