{
  "game_id": "0022400402",
  "espn_id": "401704968",
  "date": "Dec 23, 2024",
  "matchup": "DEN vs. PHX",
  "headline": "Jokic scores 32 points and the Nuggets rout the Suns 117-90",
  "body": "DENVER -- — Nikola Jokic scored 13 of his 32 points in a decisive third quarter, and the Denver Nuggets routed the scuffling Phoenix Suns 117-90 on Monday night.\n\n\r\n              Michael Porter Jr. had 24 points on 10-of-12 shooting for Denver, which played without guard Jamal Murray (sprained left ankle). The Nuggets have won four of five and they handed Phoenix its third straight loss.\n\n\r\n              The Suns were missing guards Devin Booker (left groin) and Grayson Allen (concussion protocol). They struggled to find scoring outside of Kevin Durant and Bradley Beal, both of whom had 23 points.\n\n\r\n              Denver led by four at halftime and outscored Phoenix 45-28 in the third. Jokic, Porter and Russell Westbrook combined to shoot 13 of 17 from the field in the period, and the team was 18 of 28.\n\n\r\n              The Suns missed eight of their first 12 shots in the third and trailed by 24.\n\n\r\n              Takeaways\r\n              Suns: Jusuf Nurkic has had success guarding Jokic but got into quick foul trouble against his former teammate. Nurkic had four fouls and played just 9:15 in the first half and was ineffective.\n\n\r\n              Nuggets: With Murray out, coach Michael Malone dipped deeper into his bench and gave little-used guard Jalen Pickett minutes. Pickett scored a career-high 11 points and played 22 minutes after logging a total of 41 in the first 26 games.\n\n\r\n              Key moment\r\n              Phoenix scored eight straight points to cut into a 24-point deficit before Jokic was fouled on a layup. He missed the free throw, but the Nuggets grabbed the rebound and Hunter Tyson hit a corner 3-pointer to give Denver a 100-79 lead heading into the fourth.\n\n\r\n              Key stat\r\n              The Nuggets are 4-0 on the second night of back-to-back games.\n\n\r\n              Up next\r\n              The teams meet again on Christmas night in Phoenix.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_api",
  "crawled_at": 1764998259.951064
}