{
  "game_id": "0021700009",
  "espn_id": "400974705",
  "date": "Oct 18, 2017",
  "matchup": "ATL @ DAL",
  "headline": "Hawks, Schroder spoil Smith's debut, top Mavericks 117-111",
  "body": "DALLAS --  Dennis Schroder's first game as the front man for the Atlanta Hawks just happened to be the night that countryman Dirk Nowitzki joined Kobe Bryant as the only players to reach 20 seasons with the same team.\n\nThe young guard showed Germany's aging icon that maybe he can be the face of a franchise as well.\n\nSchroder scored 28 points, fellow Euro standout Marco Belinelli added 20 in his first game for Atlanta and the rebuilding Hawks spoiled rookie Dennis Smith Jr.'s solid Dallas debut, beating the Mavericks 117-111 in the opener Wednesday.\n\n\"He is about to retire,\" Schroder said of the 39-year-old Nowitzki. \"And to have a battle against him and compete against him is always a good feeling.\"\n\nBelinelli, a familiar face for the Mavericks as a former rival with San Antonio, was 4 of 6 from 3-point range to help the Hawks in their first game after letting Paul Millsap leave in free agency and dumping Dwight Howard.\n\n\"I've seen him in Europe doing his thing for Italy, and he did it tonight,\" said Schroder, who led the Hawks with seven assists. \"I was excited when I heard he's here. It's just great to have somebody like that coming off the bench and looking for his shots.\"\n\nSmith, the first Dallas rookie to start an opener since 34-year-old teammate Devin Harris in 2004, scored his first NBA points on an alley-oop dunk to open the Dallas scoring and finished with 16 points and a game-high 10 assists.\n\nNowitzki scored 10 points on 4-of-14 shooting, and the surest sign yet that he's putting the franchise in younger hands came late. The 7-footer who led the Mavericks to their only championship in 2011 sat during the back-and-forth final minutes.\n\nDewayne Dedmon followed a miss by Schroder for a layup to put Atlanta up 113-111 with 58 seconds left. Taurean Prince rebounded a missed 3 from Belinelli with the shot clock off and made both free throws for a four-point lead.\n\n\"I think it was just a couple of blown coverages,\" Smith said of the Mavs getting outscored 6-0 in the final minute. \"Stuff that shouldn't have happened but it did unfortunately. It's stuff that we can fix.\"\n\nSchroder was 13 of 26 from the field, with all but three of his shots coming inside the 3-point line as the 24-year-old in his fifth season attacked the basket repeatedly.\n\n\"He's kind of our engine,\" coach Mike Budenholzer said. \"When he's aggressive, that's when he's at his best and we're at our best.\"\n\nNerlens Noel matched Smith with 16 points, his most since coming to Dallas at the trading deadline last season, and had 11 rebounds. Wesley Matthews scored all of his 15 points in the second half. Harrison Barnes scored 14 but was 3 of 13 from the field.\n\nTIP-INS\n\nHawks: Won their eighth straight against the Mavericks, a streak that goes back to Oct. 30, 2013. ... Prince, a former Baylor standout playing 100 miles up the road from his college home, had 10 points and 10 rebounds.\n\nMavericks: G Seth Curry, Golden State star Stephen Curry's younger brother, missed the opener with a stress fracture in his lower left leg. He's out indefinitely. ... Noel had two double-doubles in 22 games with Dallas last season.\n\n`OTHER' FIRST-ROUNDER\n\nThe 19-year-old Smith, the ninth overall pick and Dallas' most important draft choice since Nowitzki 19 years ago, wasn't the only first-round rookie to play well. Atlanta's John Collins, the 19th pick, scored 14 points .\n\nBRIEF BREAK\n\nSmith asked out of the game and limped through the tunnel in the second quarter after landing awkwardly on his left leg when he was fouled on a dunk. He returned later in the quarter, and said after the game it was just a \"quick breather\" after a hard collision.\n\nUP NEXT\n\nHawks: At Charlotte on Friday night.\n\nMavericks: Sacramento at home Friday night in a \"20-20\" matchup: Vince Carter, Nowitzki's former teammate, is also in his 20th season.\n\n---\n\nCorrected from earlier version with Nowitzki's age as 39, not 38.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993795.6038988
}