{
  "game_id": "0022000684",
  "espn_id": "401307473",
  "date": "Mar 26, 2021",
  "matchup": "TOR vs. PHX",
  "headline": "Paul, Ayton lead Suns past Raptors for 30th victory",
  "body": "TAMPA , Fla. -- — The Phoenix Suns couldn't hit a shot down the stretch Friday night. They did just enough of everything else to hold off the Toronto Raptors 104-100.\n\n\r\n                    The Suns made only two of their last 14 field goal attempts, and none over the final 3:50. A 14-point lead dwindled to two and Toronto might have had a chance to to win if Mikal Bridges had not run down an offensive rebound with 7.3 seconds left.\n\n\r\n                    Bridges got the ball to Chris Paul, and Devin Booker's two free throws sealed it. “We don’t run a lot of plays for him but we wouldn’t be in this position without him,” Suns coach Monty Williams said about Bridges, who had 11 points and seven rebounds. \".He’s one of those guys who can find different way to affect the game.\n\n\r\n                    Paul and Deandre Ayton each scored 19 points. Paul and Booker converted four free throws in the final 42 seconds for the Suns' only points in the final minutes. Booker had 16 points to help the Suns improve to 30-14.\n\n\r\n                    Paul also had eight assists, and Ayton had nine rebounds and two blocks — the last block on Siakam in the final minutes. \n\n\r\n                    Siakam had 26 points and 11 rebounds for the Raptors, and Fred VanVleet had 22 points. They fell two days after beating Denver to end a nine-game losing streak.\n\n\r\n                    The Suns shot 48% overall, making only 9 of 36 3-pointers.\n\n\r\n                    The Suns' biggest lead was 14 midway through the third quarter. Ayton's jump hook with 3:50 left put them up 100-91, but they never made another shot.\n\n\r\n                    Gary Trent Jr., acquired Thursday in the trade that sent Norman Powell to Portland, started for Toronto and played 31 minutes, scoring eight points.\n\n\r\n                    “I'm diving in head-first,\" said Trent, who made 4 of 11 shots. “As of now my focus is learning the offense aas best I can. After that everything will take care of itself.”\n\n\r\n                    The Raptors played without DeAndre Bembry and Paul Watson Jr. after they entered the NBA's health and safety protocol Friday. \n\n\r\n                    Thirteen members of the Toronto entourage, including seven players and head coach Nick Nurse, have missed games due to COVID since Feb. 26, and two games have been postponed.\n\n\r\n                    “We've got to figure out a way to get some wins out of this thing,” said VanVleet, “but I'm happy with the group we've got.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: The Suns are an NBA-best 15-6 on the road. . . . F Abel Nader missed a third straight game with a sore right knee.\n\n\r\n                    Raptors: Rodney Hood, who came in the same trade as Trent, entered with 5:40 left in the first quarter and had two points in 18 minutes. ... Toronto made 12 of 45 3-pointers.\n\n\r\n                    SEE YOU SOON\n\n\r\n                    The Raptors will see Powell again Sunday when the Blazers visit Amalie Arena just three days after the trade. “We’re going to miss Norman. He was a great Raptor and a great dude,\" said Nurse. \"We wish him nothing but the best except for Sunday.” \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: At Charlotte on Sunday night.\n\n\r\n                    Raptors: Vs. Portland in Tampa on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764996842.4697442
}