{
  "game_id": "0021801108",
  "espn_id": "401071781",
  "date": "Mar 26, 2019",
  "matchup": "CLE vs. BOS",
  "headline": "Celtics beat Cavs 116-106 without Kyrie to snap 4-game slide",
  "body": "CLEVELAND --  The Boston Celtics keep finding ways to win without Kyrie Irving.\n\nJayson Tatum and Marcus Smart each scored 21 points, and the Celtics broke away from a fourth-quarter tie to defeat the Cleveland Cavaliers 116-106 on Tuesday night.\n\nIrving (rest) didn't play, yet Boston snapped a four-game losing streak and improved to 11-2 without its leading scorer. The Celtics let a 12-point lead slip away but took over after the Cavaliers tied the game early in the final period.\n\n\"We responded the right way and we answered every run of theirs,\" said Al Horford, who had 19 points, including eight in the fourth quarter and the go-ahead layup. \"Obviously, we weren't perfect, but I was happy with the focus tonight.\"\n\nThe Celtics ended the game with a 24-14 run also sparked by three-point plays from Smart and Marcus Morris to pull away.\n\nCollin Sexton led Cleveland with 24 points and Jordan Clarkson scored 18.\n\nThe Celtics' slide dropped them to fifth in the Eastern Conference with seven games to play in the regular season. Boston also lost four straight Feb. 21-27.\n\nCleveland trailed 82-70 late in the third quarter, but Sexton scored nine points and Marquese Chriss' 3-pointer tied the game at 92 with 9 minutes to play.\n\nBoston seized back the momentum. Horford had a basket in the lane and Gordon Hayward scored on a layup off a turnover. Horford's 3-pointer pushed the lead to 100-94.\n\n\"I felt like when we tied it, they scored and the energy left the building a little bit,\" Sexton said.\n\nCeltics coach Brad Stevens also thought his team's quick response was crucial.\n\n\"When Marquese Chriss made that 3 to tie the score, we came right back down to Al,\" Stevens said. \"Al going down the court within 5 seconds of Chriss' 3 really helps you get right back at them.\"\n\nTatum returned after missing Sunday's loss to San Antonio because of a bruised back and scored all his points in the first half.\n\nHorford missed the two previous games with a sore left knee.\n\nIrving played his first six seasons with Cleveland. The six-time All-Star demanded a trade following the 2016-17 season and was dealt to Boston. He hasn't played in Cleveland since the 2017-18 opener.\n\nKevin Love entered 27 points short of 12,000 in his career. He scored 10 points and had 11 rebounds, but was scoreless at halftime and finished 3 of 13 from the field.\n\n\"In the first half I didn't give the guys what I should have,\" Love said. \"I have to bring it every single night for the entire game.\"\n\nThe arena's Humungotron went out late in the first quarter, forcing the teams and fans to use the upper-corner scoreboards to keep track of things. The video and numbers returned soon after halftime and drew a loud ovation from the crowd.\n\nTIP-INS\n\nCeltics: Hayward had 15 points and Morris added 14. ... G Terry Rozier, a Northeast Ohio native who played high school basketball in suburban Shaker Heights, scored 11 points.\n\nCavaliers: Cedi Osman had 15 points and Larry Nance Jr. added 13. ... Coach Larry Drew said G Matthew Dellavedova, who has been out since March 6 because of a concussion, could miss the rest of the season. Dellavedova returned from a recent road trip because he wasn't feeling well and has yet to go through any on-court activity.\n\nBIG MOVES\n\nStevens thought his players came through with a team effort in ending the losing streak. Morris was moved to the bench, with Horford and Aron Baynes starting in the frontcourt.\n\n\"Jayson went on that run early,\" Stevens said. \"We really need Al. For Morris to take on that responsibility, it shows the professional he is. He could have easily thrown a fit about it, but he didn't.\"\n\nLOVE TO BE RECOGNIZED\n\nLove will receive an award at Carnegie Hall on May 1 after being chosen as a winner of Change Maker Awards given by the Child Mind Institute. He wrote an essay last season for the Players' Tribune revealing his decision to seek therapy because of his struggles with anxiety and depression.\n\nThe five-time All-Star started The Kevin Love Fund to promote awareness. Love will be presented with the Champion Award.\n\nThe Change Maker event celebrates individuals and organizations that raise awareness in the area of children's mental illness and early prevention.\n\nUP NEXT\n\nCeltics: Host the Indiana Pacers on Friday.\n\nCavaliers: At the San Antonio Spurs on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994733.868437
}