{
  "game_id": "401810149",
  "espn_id": "401810149",
  "date": "Nov 29, 2025",
  "matchup": "CHA vs TOR",
  "headline": "Bridges scores 35 points as Hornets overcome 17-point deficit to beat Raptors 118-111 in OT",
  "body": "CHARLOTTE, N.C. -- — Miles Bridges scored 10 of his 35 points in overtime and the Charlotte Hornets overcame a 17-point first half deficit to beat Toronto 118-111 on Saturday night, ending the Raptors' nine-game winning streak.\n\n\r\n              Rookie Kon Knueppel had 20 points, including a leaning 3-pointer from the corner to tie the game with 10 seconds left in regulation and a key pass to set up a Bridges dunk in OT to ice the victory for Charlotte, which won on consecutive nights for its first winning streak of the season.\n\n\r\n              Collin Sexton came off the bench to score 18 points and handled most of the point guard duties after LaMelo Ball went to the bench early in the fourth quarter for what coach Charles Lee said was a “minutes restriction” while playing on back-to-back nights.\n\n\r\n              Scottie Barnes had 30 points and 12 rebounds to lead the Raptors, whose last loss came on Nov. 8 against Philadelphia. Brandon Ingram and Immanuel Quickley each scored 22 points for Toronto.\n\n\r\n              Bridges was huge for the Hornets in a game in which the team's other top scorers — Ball and Brandon Miller — struggled and didn't play key minutes in the fourth and overtime. Bridges finished 13 of 23 from the field and carried the team in the overtime period scoring 10 of Charlotte's 14 points.\n\n\r\n              Toronto built a 26-9 lead in the first half, but Charlotte pulled into a tie with one minute remaining when Sion James scored on an offensive rebound.\n\n\r\n              In a frantic final few seconds of regulation, Knueppel got the ball in the corner and, with a defender draped over him, hit a leaning 3 to tie the game, causing the Spectrum to erupt in screams.\n\n\r\n              Toronto initially took the lead in overtime, but then it was all Bridges.\n\n\r\n              He finished 4 of 4 from the field in the extra period, including a huge 3-pointer to make it a two-possession game.\n\n\r\n              Brandon Miller, who had 27 points in Charlotte's win over the Chicago Bulls on Friday night, managed just seven points on 1-of-13 shooting. Ball was 6 of 16 and finished with 14 points. Even as fans screamed at Lee to put Ball back in the game in the fourth quarter, he kept the star on the bench.\n\n\r\n              Up next\r\n              Toronto: At Knicks on Sunday night.\n\n\r\n              Charlotte: At Nets on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA\n\n\r\n              .",
  "source": "espn_direct_latest",
  "crawled_at": 1765042715.27574
}