{
  "game_id": "0022000796",
  "espn_id": "401307589",
  "date": "Apr 09, 2021",
  "matchup": "CHA @ MIL",
  "headline": "Bridges leads Hornets to 127-119 win over short-handed Bucks",
  "body": "MILWAUKEE -- — Miles Bridges scored 26 points to lead the Charlotte Hornets to a 127-119 victory over the Milwaukee Bucks, who were playing Friday night without all five of their usual starters.\n\n\r\n                    The Hornets (27-24) are three games above .500 for the first time since January 2017. Charlotte finished that 2016-17 season with a 36-46 record.\n\n\r\n                    “I'm proud of our guys, that they've put us in this position to be where we're at,\" Hornets coach James Borrego said. \"I love that and I'm proud of them. But we can't be complacent. We haven't done anything. We haven't accomplished anything yet.\"\n\n\r\n                    Charlotte had five players score at least 18 points. Terry Rozier and Devonte’ Graham each scored 20 points. Jalen McDaniels had 19 and PJ Washington added 18.\n\n\r\n                    Milwaukee lost its third straight as it rested its top players one night after closing a six-game trip with a 116-101 loss at Dallas.  Jordan Nwora, a rookie second-round pick from Louisville, scored a career-high 24 points to lead the Bucks. \n\n\r\n                    Reigning two-time MVP Giannis Antetokounmpo missed a fourth straight game with a sore left knee that has kept him out of six of the Bucks’ last 11 contests. The Bucks also were missing Jrue Holiday (bruised left knee), Donte DiVincenzo (bruised right hip), Brook Lopez (sore back), Khris Middleton (sore right knee) and reserve forward P.J. Tucker (strained left calf).\n\n\r\n                    “We didn't know until like before the game, probably like 45 minutes before the game or something like that,” McDaniels said. “But it's still the same mentality. If they're playing or not, we're still going out there to compete, play hard and come out with the win.”\n\n\r\n                    Tucker has missed the Bucks’ last nine games. DiVincenzo, Holiday, Lopez and Middleton all had played Thursday.\n\n\r\n                    Bucks coach Mike Budenholzer was unsure how soon they could return.\n\n\r\n                    “We’ll see how they feel over the next day or two,” Budenholzer said before the game. “I think we’re hopeful, with maybe P.J. being the exception, that these guys could all be on the shorter end of it. But Giannis has missed several games, so we’ve got to see how he feels. These guys are a little banged up.”\n\n\r\n                    Charlotte also was missing some key players.\n\n\r\n                    The Hornets announced last Saturday that Gordon Hayward would miss at least four weeks with a sprained right foot. LaMelo Ball  hasn’t played since March 20 because of a fractured right wrist. Malik Monk has a sprained right ankle and hasn’t played since April 1.\n\n\r\n                    “We always say it doesn't matter who's on the floor,” said Graham, who shot 6 of 12 from 3-point range. “The expectations stay the same.\"\n\n\r\n                    Charlotte pulled ahead for good on a Bridges 3-pointer midway through the first quarter and led by as many as 21.\n\n\r\n                    Jeff Teague scored 19 and Bryn Forbes added 18 for the Bucks, who had seven players in double figures. \n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Improved to 2-0 against the Bucks this season. The Hornets beat the Bucks 126-114  at Charlotte on Jan. 30. Before this season, the Hornets had lost their last five meetings with the Bucks.\n\n\r\n                    Bucks: This was the Bucks' lone home contest in a 10-game stretch. They visit Orlando, Minnesota and Atlanta in their next three games. ... Zora Stephenson became the first woman to work play-by-play duties in a regular-season game on a Bucks broadcast crew Friday. Stephenson, typically the sideline reporter on Bucks broadcasts, was substituting for Jim Paschke. \n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host Atlanta on Sunday in the first of three straight home games. The Hornets will attempt to complete a sweep of their three-game, regular-season series with the Hawks.\n\n\r\n                    Bucks: At Orlando on Sunday to start a three-game trip. The Bucks won 121-99 at Orlando on Jan. 11 in their only previous matchup this season.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997354.510432
}