{
  "game_id": "0022300116",
  "espn_id": "401584744",
  "date": "Nov 01, 2023",
  "matchup": "TOR vs. MIL",
  "headline": "Dennis Schroder's 24 points and 11 assists lead the Raptors past the Bucks 130-111",
  "body": "TORONTO -- — Dennis Schroder’s 24 points and 11 assists were season highs, Scottie Barnes scored 21 points and matched his season-best with 12 rebounds and the Toronto Raptors snapped a three-game losing streak with a 130-111 win over the Milwaukee Bucks on Wednesday night.\n\n\r\n              Pascal Siakam scored a season-best 26 points, O.G. Anunoby had 16 and Jakob Poeltl added 14 points and 11 rebounds for the Raptors, who led by as many as 27 points.\n\n\r\n              Giannis Antetokounmpo scored 16 points and Damian Lillard had 15 for the Bucks. Antetokounmpo shot 5 for 11, while Lillard was 4 for 9. Malik Beasley led Milwaukee with 20 points and Khris Middleton had 11.\n\n\r\n              “We need days like this to realize that we have to get better,” Antetokounmpo said. “We are not there yet. We’ve got to keep on coming together as a team.”\n\n\r\n              Lillard echoed Antetokounmpo’s opinion about Milwaukee’s need for more time to come together.\n\n\r\n              “Obviously it’s frustrating,” Lillard said. “We’re still trying to learn each other, we’re trying to learn a new staff.”\n\n\r\n              Toronto outscored Milwaukee 26-5 on fast-break points and 66-40 on points in the paint. The Raptors set a season-high for points and topped 100 in regulation for the first time.\n\n\r\n              “Sometimes getting embarrassed is good because it forces you to focus on doing the right things consistently,” Bucks coach Adrian Griffin said.\n\n\r\n              Toronto’s 35 assists were also a high mark in the young season. The Raptors finished with 50 rebounds, while Milwaukee had 29.\n\n\r\n              “They’re built for that,” Griffin said of Toronto’s rebounding. “It was something we were expecting, we just didn’t execute it.”\n\n\r\n              Griffin became the second former member of Raptors’ staff to return to Toronto this week. Griffin spent five years as an assistant to Nick Nurse, whose Philadelphia 76ers beat the Raptors on Saturday.\n\n\r\n              Antetokounmpo had as many made baskets (one) as fouls in the opening quarter. Siakam scored nine points in the first and Schroder added six assists as Toronto opened a 31-18 lead.\n\n\r\n              The Raptors made five 3-pointers in the first quarter, one more than they had in 29 attempts in Monday’s home loss to Portland.\n\n\r\n              Siakam missed all six of his 3-point attempts against the Trail Blazers but was 5-for-8 shooting against the Bucks.\n\n\r\n              “We were flat as a team (against Portland) and we can’t afford to do that with our roster,” Siakam said.\n\n\r\n              Milwaukee missed all seven of its 3-point shots in the first quarter and 14 of its first 15 attempts from long distance. The Bucks finished 13 for 34 from beyond the arc.\n\n\r\n              Barnes scored 10 points in the second quarter as Toronto stretched its lead to 66-44 at halftime. Antetokounmpo did not score in the second, missing his only field goal attempt.\n\n\r\n              Antetokounmpo had 10 points in the third, but Schroder answered with 11 for the Raptors. Toronto took a 95-79 lead to the fourth.\n\n\r\n              Raptors forward Precious Achiuwa missed his second straight game because of a strained left groin. Achiuwa left Saturday’s loss to the 76ers and has not played since.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the New York Knicks on Friday.\n\n\r\n              Raptors: Visit the Philadelphia 76ers on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995466.700403
}