{
  "game_id": "0022300720",
  "espn_id": "401585348",
  "date": "Feb 06, 2024",
  "matchup": "BKN vs. DAL",
  "headline": "Kyrie Irving scores 36 points in return to Brooklyn, leads Mavericks to 119-107 win over Nets",
  "body": "NEW YORK -- — Kyrie Irving was traded away a year ago, but he's never fully left New York. \n\n\r\n              Not when he grew up in the area as a Nets fan, and not when so many family and friends were in attendance when he came back Tuesday night.\n\n\r\n              He gave them quite a show.\n\n\r\n              Irving scored 36 points, leading the Mavericks to a 119-107 victory and then spending time signing autographs and greeting his old fans in the stands.\n\n\r\n              “Just like any other basketball game, but it felt like I was home tonight,” Irving said. \n\n\r\n              Luka Doncic had 35 points, 18 rebounds and nine assists as the Mavericks' guard tandem took turns hitting some deep 3-pointers in the second half when the Nets were trying to make a run. Doncic quickly shed the mask he began the game with to protect a nasal contusion and just missed his 10th triple-double of the season.\n\n\r\n              Irving was booed when he touched the ball in the early going, though he turned those to cheers after finishing one of his fancy drives for a reserve layup or hitting one of his six 3-pointers — and especially when when he rose high to slam down a lob pass in the third quarter.\n\n\r\n              \"That was amazing. That was impressive,\" Doncic said of the play that Irving said he called for himself, telling Josh Green he could get up to catch the pass. \n\n\r\n              Irving, who is second to Vince Carter in Nets franchise history with his 14 40-point games, nearly got one against Brooklyn after returning from a six-game absence with a sprained right thumb for Monday’s victory at Philadelphia.\n\n\r\n              Mikal Bridges scored 28 points and Royce O'Neal had 18 for the short-handed Nets, who trimmed a 23-point deficit to 107-101 with about five minutes remaining before Irving knocked down two straight 3-pointers for a 113-101 lead. \n\n\r\n              “It’s tough. Ky has the extreme ability to shot-make versus anyone and I thought he had some timely buckets for that group,” Nets coach Jacque Vaughn said. \n\n\r\n              Brooklyn's Ben Simmons had nine points, nine rebounds and seven assists after sitting out a loss to Golden State on Monday.\n\n\r\n              Mavericks coach Jason Kidd said Irving has been a calming presence for the young Dallas players, though calm certainly wasn't the word to define his time in Brooklyn. He played in just 143 games in his 3 1/2 seasons, missing time during one season after taking a leave of absence, nearly all the home games another season because of his refusal to get vaccinated against against COVID-19 as mandated in New York City, and then getting suspended by the team last season when he refused to apologize for posting a link to an antisemitic work on social media.\n\n\r\n              The relationship with the team deteriorated to the point that Irving wanted the homecoming to be over by the middle of last season. The Nets, who had already passed on giving him a contract extension the previous summer, then traded away Kevin Durant days after moving Irving, ending an era that had so much promise when the All-Stars came together in 2019.\n\n\r\n              There was no tribute video, which Durant received when he returned for the first time last week. Rather, the Nets showed photos of Irving, Seth Curry and Markieff Morris on the overhead videoboard, welcoming the three former Nets back to Brooklyn before starting lineups were announced. \n\n\r\n              Dallas led 31-24 after one quarter, before Irving made his first four shots, including two 3-pointers, for 10 points in the second as the lead quickly reached double digits. The Mavs took a 65-47 lead to the break.\n\n\r\n              The Mavericks then scored the first five of the second half, with Vaughn taking a timeout just 46 seconds after play began when his players allowed Irving a wide-open 3-pointer that made it 70-47.\n\n\r\n              The Nets had it down to nine late in the third quarter, but Doncic hit consecutive 3s listed at 30 and 36 feet, and Dallas had it back up to 95-77 after three. \n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Visit New York on Thursday.\n\n\r\n              Nets: Host Cleveland on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996337.774108
}