{
  "game_id": "0021500789",
  "espn_id": "400828676",
  "date": "Feb 10, 2016",
  "matchup": "CHA @ IND",
  "headline": "Hornets take advantage of Pacers' poor defense in 117-95 win",
  "body": "INDIANAPOLIS --  Kemba Walker and Jeremy Lamb got a chance to reminisce Wednesday night.\n\nWith Walker exploiting open lanes to the basket and Lamb making open shots from outside, the two former college teammates recreated the combination that helped UConn win a national championship five years ago.\n\nThis time, Walker finished with 25 points and seven rebounds, Lamb scored 16 and together they led the Charlotte Hornets to a 117-95 blowout of the Pacers for their third consecutive win -- and first at Indiana in almost 7 1/2 years.\n\n\"I don't know much about (Indiana), but I do feel like we really wanted it and came out with a great intensity early on,\" Walker said. \"We executed our game plan.\"\n\nIncredibly easily, too.\n\nCharlotte broke a 25-all tie by starting the second quarter on a 17-4 spurt and didn't allow the Pacers to even close the deficit to single digits over the final 28 minutes.\n\nWalker and Lamb took advantage of their opportunities all night. Walker made 10 of 21 shots, while Lamb went 7 of 8 from the field and 2 of 3 on 3-pointers.\n\nCharlotte, which started the night near the bottom of the NBA in field-goal percentage, shot a season best 51.7 percent, had six players in double figures and was an impressive 12 of 28 from beyond the arc.\n\nThe Hornets (27-26) have won six of seven and head into the All-Star break above the .500 mark.\n\n\"I thought Kemba set the tone this morning at shootaround,\" coach Steve Clifford said. \"I thought our guys had good energy and were ready to play.\"\n\nIndiana was not.\n\nPaul George finished with 22 points, eight rebounds and six assists but didn't get nearly enough help. George Hill scored 12 points and Monta Ellis and Myles Turner each had 10.\n\nThe bigger problem showed up on defense.\n\nIndiana struggled to stay in front of Walker, struggled to contest outside shots and looked as though it was already taking a break.\n\nCoach Frank Vogel, who started the night talking about the need to stay hot after winning two in a row and four of six, wasn't pleased.\n\n\"Tonight, we weren't able to get stops and that affected us on the offensive end,\" he said. \"We've got to figure this out.\"\n\nBut Charlotte had all the answers.\n\nFive players made multiple 3s and Jeremy Lin scored half of his 14 points during the second-quarter run that changed the game. Charlotte extended its lead to 60-43 at halftime and never let the Pacers threaten in the second half.\n\nTOUGH NIGHT\n\nHornets forward Michael Kidd-Gilchrist left in the third quarter after dislocating his surgically repaired right shoulder. Clifford said Kidd-Gilchrist will have an MRI on Thursday. He has been limited to seven games this season since having surgery on the shoulder. ... Pacers forward Jordan Hill also left early. He dislocated his right ring finger in the first half and did not return.\n\nTRADE TALK\n\nWith next Thursday's trade deadline looming and the Pacers maybe in the market for a move, speculation has swirled around George Hill. But before Wednesday's game, Vogel said he has ignored the rumor mill and expects his players to do the same -- though he did not feel it was necessary to have that conversation with his team.\n\nBREAKING POINT\n\nIndiana has tried to turn up the tempo all season. On Wednesday, the Pacers got burned doing it. The Hornets outscored Indiana 18-7 in fast-break points, converting all eight of their chances while the Pacers scored on only two of seven chances.\n\nTIP-INS\n\nHornets: Marvin Williams made two 3s to give him 90 this season -- five short of the career high he set last season. ... Former Indiana University star Cody Zeller finished with 11 points and 11 rebounds in his latest return to his home state.\n\nPacers: The 22-point loss matched Indiana's most lopsided defeat of the season. ... Since Turner entered the starting lineup, Indiana has been outrebounded in only two of eight games. ... Backup guard Rodney Stuckey has missed 15 consecutive games with a sprained right foot and a bone bruise. Vogel hopes Stuckey can return to practice next week.\n\nUP NEXT\n\nCharlotte visits Milwaukee on Feb. 19.\n\nIndiana visits Oklahoma City on Feb. 19.",
  "source": "espn_api",
  "crawled_at": 1764994371.6864882
}