{
  "game_id": "0022000190",
  "espn_id": "401267350",
  "date": "Jan 16, 2021",
  "matchup": "BKN vs. ORL",
  "headline": "Harden debuts with triple-double, Durant scores 42, Nets win",
  "body": "NEW YORK -- — James Harden and Kevin Durant needed a little while to remember how to play together again.\n\n\r\n                    Once they did, the Brooklyn Nets really got rolling — and they might still get to another gear when Kyrie Irving rejoins them.\n\n\r\n                    “The sooner we can be on the court together, it's going to be scary hours,” Harden said.\n\n\r\n                    They look pretty fearsome already.\n\n\r\n                    Harden delivered 32 points and a triple-double in his Brooklyn debut, Durant scored a season-high 42 points in his first game back with his former teammate, and the Nets showed off their potent potential in a 122-115 victory over the Orlando Magic on Saturday night.\n\n\r\n                    Harden had 14 assists and 12 rebounds after being cleared to play earlier in the afternoon after all the players in the blockbuster trade that brought him from Houston had completed their physicals. Harden also had nine turnovers and Durant had six, with some sloppiness while Harden got used to his new teammates.\n\n\r\n                    “Early on I felt like we all were overpassing, trying to make everybody comfortable,” Durant said, “and then he just got into his mode of being aggressive to score and that opened up the whole game for others.”\n\n\r\n                    Harden had no practice time with the Nets and sure didn't need it, becoming the first player in franchise history to have a triple-double in his debut.\n\n\r\n                    Durant made five 3-pointers in his 10th game back following an 18-month layoff after rupturing his Achilles tendon in the 2019 NBA Finals. He hiked his average to 30.7 points, which would be his highest since he scored a league-leading 32 per game and won NBA MVP honors for Oklahoma City in 2014.\n\n\r\n                    That was a couple years after he and Harden helped lead the Thunder to the NBA Finals and their new pairing could have similar possibilities. The Nets might still reach another level when they get back Irving, who missed his sixth straight game after leaving the team last week for personal reasons.\n\n\r\n                    “I think it’s going to be an adjustment for everyone, but it’s an incredible problem to have and something I think we’ll relish trying to decipher,” coach Steve Nash said.\n\n\r\n                    Nikola Vucevic had 34 points, 10 rebounds and seven assists for the short-handed Magic, who lost their fifth straight. They were much more competitive than the others, including a 124-97 loss in Boston on Friday, but didn't have enough answers for Durant or Harden.\n\n\r\n                    “I mean, they’re whatever, they're, two of the four, five best offensive players in the world,” coach Steve Clifford said.\n\n\r\n                    Harden didn't score until making a pair of free throws with 6.8 seconds left in the first quarter and didn't make his first basket until a layup with 10:07 remaining in the half. But his playmaking was on track from the start, pushing up the floor to find teammates rather than often dribbling down the shot clock in Houston. \n\n\r\n                    He got his shot going during an 11-point third quarter, capping it with a deep 3-pointer just before the buzzer to give Brooklyn an 84-83 lead. \n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Clifford successfully challenged a foul called on the Magic with 8.6 seconds left and his team trailing by seven. He improved to 5 for 5 on coach's challenges this season. ... Terrence Ross scored 23 points. Rookie Cole Anthony tied his season high with 16.\n\n\r\n                    Nets: Durant has scored 25 or points in nine straight games, setting a new franchise record. ... Nash said F/C Nicolas Claxton, who has been out all season with a right knee injury, likely wouldn't return until later in the first half of the season, probably in February. \n\n\r\n                    CLOSING IN ON KYRIE?\n\n\r\n                    Nash said Irving was hopefully close to returning, but said no date has ben determined. He wants the point guard to have proper time to ramp up his activities accordingly following his layoff. He said Irving has been working out on is own and could do so with a group of players Sunday during a day off. \n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Visit New York Knicks on Monday.\n\n\r\n                    Nets: Host Milwaukee on Monday.",
  "source": "espn_api",
  "crawled_at": 1764997518.58125
}