{
  "game_id": "0022200242",
  "espn_id": "401468397",
  "date": "Nov 20, 2022",
  "matchup": "DET @ SAC",
  "headline": "Kings beat Pistons 137-129, extend winning streak to 6 games",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox had 33 points and seven assists and the Sacramento Kings extended their winning streak to six games with a 137-129 win over the Detroit Pistons on Sunday night.\n\n\r\n              “This is the best basketball he’s played in his career,\" Harrison Barnes said of his teammate. \"He’s playing at an All-Star level. He’s doing it on the offensive end, the defensive end ... it’s a credit to him and the amount of work he put in this summer.”\n\n\r\n              Fox scored 10 points in the fourth quarter, including a pair of free throws with 22.6 seconds remaining that extended Sacramento's lead to six points. The Kings have won eight of their last 10 games after starting the season 0-4.\n\n\r\n              Sacramento closed the game on a 15-5 run. \n\n\r\n              “We can score with the best of them,” Kings coach Mike Brown said. “We have to figure out a way to get stops and not just in the last three minutes.”\n\n\r\n              Barnes had a season-high 27 points with nine rebounds. He hit two free throws with 14.6 seconds left to help secure the victory.\n\n\r\n              “We’re kind of clicking,\" Barnes said. “We have that continuity that, at the beginning of the year, we didn’t have. It’s amazing that the offense has clicked on that end.”\n\n\r\n              Kevin Huerter hit four 3-pointers and finished with 24 points as all of the Kings' starters scored in double figures. Domantas Sabonis had 15 points and 13 rebounds.\n\n\r\n              “He had another big game for us,” Brown said. “He had a tough (defensive) assignment tonight. He did a good job.”\n\n\r\n              Pistons rookie Jaden Ivey, the fifth overall pick in the 2022 NBA draft, had 24 points. \n\n\r\n              “Ivey is aggressive when you need him to be,” Cory Joseph said. “He has great confidence for a rookie.”\n\n\r\n              Bojan Bogdanovic added 21 points for Detriot, which has lost seven consecutive games and 10 of its last 11.\n\n\r\n              “They’re playing their hearts out,” Pistons coach Dwane Casey said. “I see growth and improvement ... we have to stay together and stay positive.”\n\n\r\n              Alec Burks had 16 points off the bench and Marvin Bagley lll added 15 for the Pistons.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: G Cade Cunningham (left shin injury) didn’t play Sunday and has been out since Nov. 11. ... F Marvin Bagley lll returned to Sacramento for the first time. Bagley was selected by the Sacramento Kings in the 2018 Draft. He was traded to Detroit at last season’s trade deadline. ... Detroit outscored the Kings reserves 55-25.\n\n\r\n              Kings: Murray returned to the starting lineup after missing the last game against San Antonio with back soreness. ... Malik Monk was given a technical foul with 5:32 left in the third quarter and picked up his second with 7:26 left. He was ejected. ... Sabonis recorded his ninth double-double of the season.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Continue a five-game trip at Denver on Tuesday.\n\n\r\n              Kings: Travel to Memphis on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994389.818644
}