{
  "game_id": "0021500992",
  "espn_id": "400828879",
  "date": "Mar 14, 2016",
  "matchup": "HOU vs. MEM",
  "headline": "Motiejunas and Ariza help Rockets to 130-81 win over Memphis",
  "body": "HOUSTON -- The Houston Rockets got an easy win and some much-needed rest for their overused stars.\nDonatas Motiejunas scored 18 points, Trevor Ariza had 16 and the Rockets coasted to their most lopsided victory of the season, 130-81 over the injury-ravaged Memphis Grizzlies on Monday night.\nThe Rockets, who never trailed, were up by 24 at halftime and used a 32-point third quarter to extend the lead to 97-54. Houston cleared the bench to start the fourth quarter with the game well in hand.\nJames Harden, who had played more than 40 minutes in seven of the last 13 games, was glad to get a breather by playing just over 25 minutes.\n\n\"It felt good,\" Harden said with a smile. \"I felt like I didn't even go out there and play tonight. Happy to get the win and looking forward to Wednesday.\"\nHarden added 15 points, eight assists and seven rebounds for the Rockets, who won for the fourth time in five games.\nThe largest margin of victory in franchise history is 52 points and the Rockets almost tied it on Monday, but JaMychal Green made a 3-pointer with 5.2 seconds left to cut the lead to 49 and make it the third-largest ever by Houston.\n\"We knew that they were short-handed,\" Ariza said. \"We didn't want to come out and play around at all, we wanted to get straight to it and that's what we did tonight.\"\nLance Stephenson missed the game with a sprained right wrist, joining a bevy of other players sitting out with injuries including Mike Conley, Zach Randolph, Marc Gasol, Chris Andersen, Brandan Wright and Vince Carter.\nJarell Martin led the Grizzlies with 17 points and Matt Barnes had 14.\nBarnes talked about the challenge of playing with so many guys out.\n\"Half our team is D-League,\" Barnes said. \"But nobody is going to feel bad for us ... we play hard and that's the one thing I tell these guys, no matter what the outcome of the game is or whether or not the shots are falling, you can always control your effort.\"\nHouston had a 24-point lead early in the third quarter when a 15-3 run made it 80-45 with 7 1/2 minutes left in the period. Harden made three free throws to start that spurt and added five more in that span to help the Rockets put it out of reach. Memphis missed seven shots as Houston padded the lead, with one of the misses coming when Dwight Howard blocked a jump shot by Ryan Hollins.\nMemphis managed just 13 points in the third, making just 5 of 25 shots and committing five turnovers in the period.\nThe Rockets made three 3-pointers in the first two minutes of the game to jump out to a 9-2 lead. Ariza had eight points in a row later in the first quarter, capped by a pair of 3-pointers, to push Houston's lead to 21-6.\nThe Grizzlies got within 10 with about 10 minutes left in the second quarter before the Rockets scored the next eight points to make it 46-28. Houston used another big run a couple of minutes later, this one 10-0, to pad the lead to 56-32.\nThe Rockets led 65-41 at halftime.\nTIP-INS\nGrizzlies: Carter was out with a strained left calf. ... Randolph has a sore right knee. ... Conley is out for three to four weeks with Achilles tendinitis in his left foot.\nRockets: Michael Beasley missed the early part of the third quarter after getting hit in the left eye just before halftime and receiving five stitches to close a gash on his eyelid ... Howard got a flagrant 1 foul in the first quarter when he pulled Martin down hard by the shoulders while the pair fought for a rebound. ... F Terrence Jones missed his sixth straight game with an upper respiratory infection.\nUNFAMILIAR ROLE\nMemphis guard Tony Allen is trying to adjust to the changing dynamic of the team that has left Allen and Barnes as its leaders.\n\"Our leaders are hurt and out and this is a new role for me,\" he said. \"I'm trying to adapt personally. Each game is going to have to be a big game for us.\"\nUP NEXT\nGrizzlies: Host Minnesota on Wednesday.\nRockets: Host the Clippers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994610.830008
}