{
  "game_id": "0022400823",
  "espn_id": "401705389",
  "date": "Feb 24, 2025",
  "matchup": "CHI @ PHI",
  "headline": "Giddey scores 25 points as the Bulls snap a 6-game skid with a 142-110 rout of the 76ers",
  "body": "PHILADELPHIA -- — Josh Giddey had 25 points, 16 rebounds and six assists as the Chicago Bulls ended a six-game skid by routing the Philadelphia 76ers 142-110 on Monday night.\n\n\r\n              Kevin Huerter scored 23 points, Zach Collins added 19 and Matas Buzelis 17 as the Bulls led by as many as 50 points in the fourth quarter and sent Philadelphia to its eighth straight loss.\n\n\r\n              The Bulls entered having lost 11 of 15. They hold the 10th and final play-in tournament spot in the Eastern Conference. Philadelphia is in 12th place, 2 1/2 games back.\n\n\r\n              Paul George and Kelly Oubre Jr. each scored 19 points and Tyrese Maxey added 13 as Philadelphia lost for the 10th time in 11 games.\n\n\r\n              Takeaways\r\n              Bulls: The Bulls set season-highs for first-half points (75) and points in a game. They did it with Lonzo Ball, who scored six points in eight minutes, leaving with a head laceration. Forward Nik Vucevic was a late scratch with left calf tightness.\n\n\r\n              76ers: The Sixers played without Joel Embiid, who was getting his troublesome left knee examined. Embiid has been limited to 19 games this year. Maxey played despite a right finger injury. Their injury woes got worse when Guerschon Yabusele had to be helped off the court early in the third quarter and didn’t return after getting hit in the face. Quentin Grimes exited with knee soreness.\n\n\r\n              Key moment\r\n              The Bulls hit three of their first four shots from 3-point range, opening up a 21-12 lead. They shot 52% from the field in the first half.\n\n\r\n              Key stat\r\n              Slow starts have killed the 76ers recently. They gave up 40 points in the first quarter Saturday to Brooklyn and 72 in the first half to Boston last Thursday. Monday, they allowed 39 in the first.\n\n\r\n              Up next\r\n              Both teams play Wednesday. Philadelphia visits New York Knicks and Chicago hosts the Los Angeles Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997049.572628
}