{
  "game_id": "0021500748",
  "espn_id": "400828635",
  "date": "Feb 04, 2016",
  "matchup": "TOR @ POR",
  "headline": "Raptors hold off Blazers for 110-103 victory",
  "body": "PORTLAND, Ore. --  Kyle Lowry credited backcourt teammate DeMar DeRozan for Toronto's latest win.\n\nLowry had 30 points, DeRozan added 29 and the Toronto Raptors snapped Portland's five-game winning streak with a 110-103 victory over the Trail Blazers on Thursday night.\n\n\"DeMar was aggressive and stayed aggressive throughout the game,\" Lowry said. \"His aggressiveness really helped set the tempo and set the standard for us throughout the game.\n\nDamian Lillard had 27 points and 11 assists, while CJ McCollum added 21 points for Portland in the matchup between two of the league's dynamic backcourts.\n\nThe Raptors, who have lost only one of their last 14 games, led by as many as 16 points in the first half. But the Blazers chipped away in the third quarter and came within 85-81 on Meyers Leonard's jumper in the fourth. Lowry answered with a 3-pointer and Portland couldn't get closer.\n\nToronto extended its lead to 94-81 on Lowry's 3 with 6:52 left in the game. The Raptors made 12 of 19 3-point attempts in the game, with Lowry scoring seven of them to match his career high.\n\nLillard hit a jumper and Allen Crabbe made a pair free throws to pull Portland within 106-101 with 55.3 seconds left, but McCollum missed a 12-foot jumper and Toronto hit free throws to end the threat.\n\n\"We understood it was going to be a challenge tonight,\" DeRozan said. \"They've got a great backcourt that plays extremely hard and it's a team that's fighting for something so we had to meet the challenge tonight.\"\n\nAfter a loss at home to the Denver Nuggets on Monday that snapped their franchise-best 11-game winning streak, the Raptors rebounded with a 104-97 victory over the Suns.\n\nThe Raptors' game against the Blazers was the third of a six-game road trip.\n\nPortland was without starting forward Noah Vonleh, who injured his left ankle in the Blazers' 107-95 victory over Milwaukee. Maurice Harkless, who had played a combined seven minutes in the last five games, was the surprising starter in Vonleh's place.\n\nGoing into the game, Lillard and McCollum were averaging a combined 44.9 points per game, ranked third in the league, but DeRozan and Lowry were close behind and averaging 44.\n\nBefore the game, Blazers coach Terry Stotts joked about the matchup: \"Let's play two-on-two.\" Raptors coach Dwane Casey, who used to work with Stotts on Rick Carlisle's Mavericks staff, replied: \"I'll go with that.\"\n\nA fast-break dunk by DeRozan put the Raptors up 18-10 in the first quarter, and he would lead all scorers with 12 points in the period.\n\nBoosted by eight 3-pointers, Toronto led by as many as 16 points in the first half. But a late 8-0 run pulled the Blazers within 53-47 and the Raptors led 59-51 at the half.\n\nMcCollum's 3-pointer closed Portland within 73-69, but Lowry answered with his own and Toronto was able to keep the Blazers for gaining ground.\n\n\"They play well together,\" Lillard said. \"You can see it, you can hear it in how they communicate with each other. They're a group, they're a unit.\"\n\nLeonard was charged with a flagrant foul on Bismack Biyombo after a review late in the game.\n\nTIP INS\n\nTrail Blazers: Lillard and McCollum are one of three duos in the NBA who have at least 1,000 points each, joining Oklahoma City's Kevin Durant and Russell Westbrook, and Toronto's DeRozan and Lowry. ... McCollum was selected Thursday to take part in the Skills Challenge at the All-Star Game next week.\n\nRaptors: Toronto had lost seven consecutive games in Portland. \"To get that continuous losing streak off our back feels good,\" DeRozan said. It was the first win at the Moda Center since December 2006.\n\nLILLARD'S SLOW START\n\nAfter just six points total in the first half, Lillard came alive, and scored 15 in the final quarter. It was his also his eighth game of the season with 20-plus points and 10-plus assists.\n\n\"They play good defense,\" he said. \"I thought I had a few looks there that I know I'm more than capable of knocking down that didn't go in. And when the ones you should make don't go in, it makes the ones that are contested and in traffic, it makes those a little bit harder.\"\n\nON 13 of 14\n\nCasey was asked to explain the Raptors' success of late. \"Cohesion, chemistry, continuity,\" he said. \"We're not a finished product; we've got to stay hungry, we've got to stay focused. But I think those have been the keys to us winning.\"\n\nUP NEXT:\n\nBlazers: visit Houston on Saturday.\n\nRaptors: visit Detroit on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994720.572373
}