{
  "game_id": "0021800412",
  "espn_id": "401071093",
  "date": "Dec 12, 2018",
  "matchup": "ATL @ DAL",
  "headline": "Mavs extend home streak, end skid vs. Hawks in 114-107 win",
  "body": "DALLAS --  Luka Doncic can call himself even with Trae Young for now.\n\nThe Dallas Mavericks can finally say their puzzling losing streak against the Atlanta Hawks is over.\n\nHarrison Barnes scored 25 points, Doncic added 24 and the Mavericks extended their home winning streak to 11 games while ending a 10-game skid against Atlanta in a 114-107 victory over the Hawks on Wednesday night.\n\nJ.J. Barea had 18 points before leaving with a sprained left ankle as the Mavericks finally beat the Hawks after blowing a 26-point lead in October, when Young had a strong fourth quarter in his home debut to help the Hawks rally to a 111-104 win.\n\nYoung matched Doncic with 24 points and added 10 assists in the second meeting between players traded for each other on draft night. Doncic went third overall to the Hawks, who sent him to Dallas while the Mavericks picked Young at No. 5 for Atlanta.\n\n\"He's a really good player and we can only hope to contain him,\" Young said of Doncic, who was just 5 of 14 from the field but had his second career double-double with 10 rebounds while adding a team-high six assists. \"He didn't get too many good looks.\"\n\nInstead of wilting in the fourth quarter, the Mavericks took control with a 7-0 opening run for a 10-point lead and eventually went up by as many as 15 before the Hawks made it closer with an 11-1 run late.\n\nThe home winning streak is the longest for the Mavericks since a 12-game run in 2007-08, and their most recent win over Atlanta was on Oct. 30, 2013. Dallas had won 21 of the previous 29 meetings with the Hawks before the 10-game skid.\n\nThe rematch reiterated the opposite directions both teams are headed after ending the first meeting at 2-2. The Mavericks are 13-9 since then and among the current playoff teams in the rough Western Conference. The Hawks have gone 4-19.\n\nThe Mavericks played most of the second half without coach Rick Carlisle, who was ejected on two quick technicals when he thought Barnes got fouled without a call. Dallas went on a 16-5 run right after the ejection.\n\n\"He got them going,\" said assistant Stephen Silas, who took over for Carlisle. \"His energy got them going, and I tried to continue that energy with the group. They did a really good job after Rick got thrown out of the game.\"\n\nKent Bazemore scored 22 for Atlanta, and John Collins had 20 points and a career-high 17 rebounds.\n\nRole players got the fourth moving for Dallas, starting with Maxi Kleber on a dunk as he went on to score all seven of his points in the fourth quarter. Dorian Finney-Smith's free throw gave Dallas its first 10-point lead, and he finished with 11 points.\n\nTIP-INS\n\nHawks: Vince Carter, Nowitzki's former teammate also in his 21st season, got a nice ovation when he entered the game in the first quarter. The 41-year-old scored his only points on a 3 in the first quarter. ... Collins had nine offensive rebounds, most by a Dallas opponent this season, in his sixth double-double.\n\nMavericks: PG Dennis Smith Jr. missed his fourth straight game with a sprained right wrist. ... Doncic was 12 of 15 from the line as Dallas attempted a season-high 43 free throws. ... DeAndre Jordan had his 16th double-double with 11 points and 11 rebounds.\n\nNO DIRK YET\n\nDirk Nowitzki was inactive after being listed as questionable for the first time as the longer-than-expected recovery from left ankle surgery delays him from officially becoming the first NBA player with 21 seasons for one franchise. Carlisle said the designation meant the 40-year-old Nowitzki was getting closer to returning, but didn't want to discuss his status further before the game.\n\nGETTING CHIPPY\n\nDoncic stared down Bazemore after the Atlanta guard blocked his shot before and after the first-half buzzer, ultimately sending the 19-year-old crashing to the floor. Players from both benches mingled as they headed to their locker rooms, with coaches and officials trying to keep them separated. There weren't any scuffles, and officials looked at a replay before ruling there were no fouls.\n\nThere were two double-technicals late in the fourth quarter. The first pair was called on Young and Jordan, with both appearing to plead with officials that they were having a friendly exchange. Doncic and former Maverick Justin Anderson got double techs 16 seconds later.\n\nUP NEXT\n\nHawks: At Boston on Friday.\n\nMavericks: At Phoenix on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995374.706835
}