{
  "game_id": "0022401130",
  "espn_id": "401705696",
  "date": "Apr 05, 2025",
  "matchup": "MIN @ PHI",
  "headline": "Edwards and Gobert power the Timberwolves to a 114-109 win over the struggling 76ers",
  "body": "PHILADELPHIA -- — Anthony Edwards scored 37 points, Rudy Gobert added 23 points and 19 rebounds and the Minnesota Timberwolves extended their winning streak to five games with a 114-109 victory over the Philadelphia 76ers on Saturday night.\n\n\r\n               Julius Randle chipped in 15 points and Donte DiVincenzo 13 for the Timberwolves, who won for the sixth time in seven games.\n\n\r\n              Quentin Grimes led Philadelphia with 28 points on 10-for-18 shooting, including 6 for 10 from long distance. Guerschon Yabusele scored 19 points, Lonnie Walker IV had 18 and Jared Butler 16 as the Sixers lost their 11th straight game and for the 14th time in 15 games. Philadelphia last won on March 16, at Dallas.\n\n\r\n              After Philadelphia rallied to within 111-109 with just under 15 seconds remaining, Edward fought off a double-team, rising up to hit a 3-pointer at the shot-clock buzzer, making it 114-109. Yabusele missed a 3-pointer with 5 seconds left and Edwards grabbed the rebound, sealing the win.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota got a scare. But it had 15 turnovers, went 21 of 29 at the free-throw line and struggled to put this one away. The win keeps them in a logjam for the top six playoff spots in the West.\n\n\r\n              76ers: Philadelphia, with eight injured players and three All-Stars sitting out, challenged last season’s Western Conference runner-up down to the wire.\n\n\r\n              Key moment\r\n              Edwards shot that gave Minnesota a 114-109 lead was his sixth 3, making him the third player in league history to post 300 3s in just 75 games. The others are Stephen Curry, who did it twice, and James Harden.\n\n\r\n              Key stat\r\n              Philadelphia's 11 straight losses matches the 15th-longest skid in franchise history. It’s also the Sixers' longest since a 12-game skid in March and April 2016.\n\n\r\n              Up next\r\n              The Timberwolves play the fourth of a five-game trip on Tuesday against Milwaukee. The Sixers are at Miami on Monday.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998070.810668
}