{
  "game_id": "0021801127",
  "espn_id": "401071800",
  "date": "Mar 28, 2019",
  "matchup": "MIL vs. LAC",
  "headline": "Giannis paces Bucks with 34, exits with hurt ankle",
  "body": "MILWAUKEE -- Giannis Antetokounmpo wants to fight through the right ankle injury that has hampered him the past two weeks.\nBut the Milwaukee Bucks forward might need some rest to get healthy before the playoffs start in mid-April. His status was of prime concern after the Bucks' 128-118 victory over the LA Clippers on Thursday.\nAntetokounmpo scored 34 points and grabbed nine rebounds before aggravating his ankle injury in the fourth quarter as the Bucks snapped LA' six-game winning streak. Milwaukee (57-19) reduced its magic number for clinching home-court advantage throughout the playoffs to two.\nAntetokounmpo went to the floor and held his right ankle after dunking with 7:46 left in the game, and he immediately went to the bench and didn't return. He missed two games last week with a sprain of the same ankle, initially suffered March 17 vs. Philadelphia.\n\"I'm definitely working on it, trying to get it healthy, stronger,\" Antetokounmpo said. \"I'm trying to get my mobility back. It's not going to be easy.\n\"Usually when you sprain your ankle, you stay out for two, three, four games. But I don't like missing games. I've got to work through it while playing. I'll be ready to play until Coach [Mike Budenholzer] tells me not to play.\"\nThe Bucks open a three-game trip on Sunday in Atlanta before finishing the season with three home games.\n\"I think we all are hoping he can push through and be healthy going forward,\" Budenholzer said. \"We'll see how he's feeling after tonight and either bring out the bubble wrap or keep playing.\"\nKhris Middleton had a season-high 39 points, with eight rebounds and five assists, as Milwaukee won its fourth straight. Eric Bledsoe added 15 points, seven rebounds and eight assists, and Sterling Brown finished with 15 points.\nMiddleton hit 16 of 24 shots from the field, including 4-of-7 from 3-point range.\n\"I'm feeling good,\" Middleton said. \"The Houston game was just a dud. I had a lot of great shots and air-balled most of them, I felt like. Tonight, I came out with the same mentality, just being aggressive and pick my spots. I was just trying to find a rhythm.\"\nShai Gilgeous-Alexander led the Clippers (45-31) with 21 points, and JaMychal Green added 16 and Wilson Chandler 15. LA finished its road trip 3-1.\nClippers coach Doc Rivers was impressed by Antetokounmpo's play and joked that the Bucks star and Houston's James Harden should share the MVP award so \"everybody in the world is happy.\"\n\"The thing I like about Giannis the most is his temperament,\" Rivers said. \"He is not messing around. He is not there to put on a show. Every game is a competition for him. I love that. For me, of all the things he does, that is the No. 1 thing that stands out with me.\"\nThe Bucks led 67-46 at halftime, as Antetokounmpo had 23 points on 7-of-12 shooting. Middleton added 15 points and Brown 10 as Milwaukee shot 55.8 percent from the field (24-of-43).\n\"I think the second quarter stood out,\" Budenholzer said after his team outscored the Clippers 39-21 in the period. \"We were able to get quite a bit of separation and weather the storm in the second half.\"\nLA went on an 8-1 run to open the second half, cutting its deficit to 14 and forcing Budenholzer to call a timeout.\nThe Bucks led 79-69 before going on a 9-2 run capped by a 3-pointer by Pat Connaughton, putting them ahead 88-71 with 2:49 left in the third quarter.\nMiddleton completed a 4-point play late in the quarter and had 13 points in the period as the Bucks took a 100-77 lead entering the fourth.\nTIP-INS\nClippers: Veteran guard Patrick Beverley was out with a right hip pointer suffered in the Clippers' 122-111 victory over Minnesota on Tuesday. ... Bench stalwart Lou Williams was out for rest. Rivers called Beverley \"unstat-able\" because his box score numbers do not always do justice to his impact on the court. Rivers pointed to a game in which Beverley did not score but was plus-22 in his time on the court. \"You really can't quantify what he does at times,\" Rivers said. \"He gives us our heart and our soul, for sure.\" ... Landry Shamet returned to the lineup after missing Tuesday's game with a left ankle injury and had 13 points. ... Former Bucks player Luc Mbah a Moute, who played in just four games with the Clippers this season, underwent surgery on his left knee Wednesday in New York. He will not return this season and will not be able to return to basketball activities for eight weeks.\nBucks: The NBA announced Thursday that the Bucks will face the Charlotte Hornets in Paris on Jan. 24, 2020, marking the first regular-season league game in France. Milwaukee last played in Europe in January 2015 when it beat the New York Knicks in London. ... Tony Snell missed his second straight game with a left ankle sprain. Budenholzer said Snell is expected to be ready for the playoffs. ... Rookie guard Donte DiVincenzo will not play again this season (heel bursitis). His total of missed games will be 43 due to injury/illness.\nUP NEXT\nClippers: Host Cleveland on Saturday afternoon.\nBucks: At Atlanta on Sunday afternoon.",
  "source": "espn_api",
  "crawled_at": 1764994452.7300851
}