{
  "game_id": "0022300010",
  "espn_id": "401584098",
  "date": "Nov 10, 2023",
  "matchup": "BKN @ BOS",
  "headline": "Jaylen Brown scores 28 points, Celtics hit 19 3s and beat Nets 121-107 in NBA tournament play",
  "body": "BOSTON -- — Celtics coach Joe Mazzulla didn’t have any extra discussion with his team about its first In-Season Tournament game. It was just 1 of 82 games as far as he was concerned.\n\n\r\n              His team sure played like it mattered a little more. \n\n\r\n              Jaylen Brown scored 28 points, making five of his team’s 19 3-pointers, to lead Boston to a 121-107 win over the Brooklyn Nets on Friday night.\n\n\r\n              Jayson Tatum added 23 points and 10 rebounds to help the Celtics snap a two-game skid and earn a victory in their tourney opener.\n\n\r\n              “It’s a learning curve. We’re still figuring stuff out. ... Learning from one another,\" Brown said. \"Long season to go, and it’s all about building trust, building chemistry out there. “ \n\n\r\n              Boston’s bench, which had struggled in back-to-back losses, contributed 37 points, getting 15 from Sam Hauser and 13 from Payton Pritchard.\n\n\r\n              Mazzulla said Pritchard's impact was felt all over the court. \n\n\r\n              “To me, he changed the game for us,” Mazzulla said. “It's easy to look at the scoring on the bench and feel like they're not producing. But it's so much other stuff that they do for us on a daily basis. ... Tonight we got to see the other side of that.”\n\n\r\n              Lonnie Walker IV led the Nets with 20 points and seven rebounds. Trendon Watford added 14 points. Mikal Bridges and Spencer Dinwiddie both finished with 12 points. Brooklyn dropped to 1-1 in East Group C play. \n\n\r\n              Cam Johnson, who had been dealing with a strained calf, scored 11 points on 4-of-13 shooting in his first game since the opener. \n\n\r\n              “I think you see he gives us just a different dynamic,” Nets coach Jacque Vaughn said. “His ability to stretch the floor, to guard multiple positions. That's with him not having a bunch of game minutes underneath his belt. He'll continue to get minutes, continue to knock off some of that rust a little bit.”\n\n\r\n              Brooklyn outscored Boston 30-27 in the third quarter to trim what had been an 18-point deficit to just nine points entering the fourth. But Boston opened the final period with an 18-6 run to get it back up to 111-90 with just under seven minutes to play. \n\n\r\n              TD Garden gave up its trademark parquet floor for the night, flipping to an NBA-mandated tournament-themed look, complete with an image of the new NBA Cup trophy beneath “Boston” in green letters at midcourt.\n\n\r\n              The makeover didn’t take away the energy in the building. \n\n\r\n              The Celtics led by as many as 17 in the opening 24 minutes as they pushed the pace and also sizzled from the outside, knocking down 12 3s. Boston also took care of the ball with just two turnovers.\n\n\r\n              It added up to a 66-54 halftime edge.\n\n\r\n              Brooklyn played short-handed but did its best to match Boston’s early surge, getting 60 points on the night from its bench.\n\n\r\n              Ben Simmons missed his second straight game with hip soreness. Leading scorer Cam Thomas also was out as he begins rehabilitation on his sprained left ankle. It left the Nets short on designated ball handlers and made for at times choppy play in the halfcourt. \n\n\r\n              But they stayed close thanks to 11 first-half 3-pointers. \n\n\r\n              After winning six of their first eight games, Celtics guard Jrue Holiday said he likes how his team is accepting the challenge of finding ways to improve. \n\n\r\n              “I think it’s always good to know that we can get to another level,\" he said. \"Execution. Toughness. Effort. That’s things we can kind of hang our hats on every night.” \n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Wizards on Sunday.\n\n\r\n              Celtics: Host Raptors on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996610.2644658
}