{
  "game_id": "0022401192",
  "espn_id": "401705758",
  "date": "Apr 13, 2025",
  "matchup": "MIL vs. DET",
  "headline": "Connaughton has career-high 43 points as Bucks beat Pistons 140-133 in OT to close regular season",
  "body": "MILWAUKEE -- — Pat Connaughton had a career-high 43 points and a season-high 11 rebounds as the Milwaukee Bucks defeated the Detroit Pistons 140-133 in overtime on Sunday to close the regular season on an eight-game winning streak.\n\n\r\n              Milwaukee’s Giannis Antetokounmpo, Detroit’s Cade Cunningham and several other regulars didn't play with both teams already locked into their playoff positions. The fifth-seeded Bucks face Indiana and the sixth-seeded Pistons take on New York in the opening round of the playoffs.\n\n\r\n              Milwaukee's lone usual starter to play was Kyle Kuzma, who scored 22 points in the first quarter before sitting out the rest of the game. Tyler Smith added 20 points and Pete Nance had 19 for the Bucks.\n\n\r\n              Malik Beasley scored 23 points to lead six Pistons in double figures. Lindy Waters III and Marcus Sasser each added 18 points. Sasser also had 10 assists.\n\n\r\n              Takeaways\r\n              Pistons: Beasley went 7 of 11 from beyond the arc to end the regular season with a career-high 319 3-pointers, but he fell one shy of the NBA lead. Minnesota's Anthony Edwards also made seven 3-pointers later Sunday in a 116-105 victory over the Utah Jazz to finish with an NBA-high 320.\n\n\r\n              Bucks: All that mattered to Milwaukee was staying healthy for the playoffs. The Bucks accomplished that by resting most of their main guys.\n\n\r\n              Key moment\r\n              With both teams deep into their benches, the Pistons erased an eight-point deficit in the last 15 seconds of regulation to force overtime. Waters tied the game by sinking a 3-pointer with 1.9 seconds remaining in the fourth quarter.\n\n\r\n              Key stat\r\n              The list of players with career scoring highs Sunday included Milwaukee's Jamaree Bouyea (15), Connaughton, Nance and Smith as well Detroit's Bobi Klintman (15) and Tolu Smith (14). Klintman had never scored a point in an NBA game before Sunday. Tolu Smith also had eight rebounds in his NBA debut.\n\n\r\n              Up next\r\n              The Pistons and Bucks will begin their respective first-round playoff series either Saturday or Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998028.319712
}