{
  "game_id": "0021500047",
  "espn_id": "400827934",
  "date": "Nov 02, 2015",
  "matchup": "MIL @ BKN",
  "headline": "Bayless scores 26 points, Bucks beat Nets 103-96",
  "body": "NEW YORK -- The Milwaukee Bucks and Brooklyn Nets both went into Monday night winless, then played a back-and-forth game for 45 1/2 minutes.\nThen the Bucks scored the final nine points and got their first win.\nJerryd Bayless scored 26 points, Greg Monroe had 23 points and 13 rebounds and Milwaukee beat Brooklyn 103-96, ending a three-game skid to open the season.\n\"(Bayless) gave us everything he did and it was all huge for us,\" Milwaukee's Greg Monroe said. \"He made some big shots coming down the stretch.\"\n\nGiannis Antetokounmpo scored 21 points and Khris Middleton had 17 for the Bucks.\nBrook Lopez had 18 points and nine rebounds, and Jarrett Jack scored 15 points for the Nets.\n\"We scratched and clawed,\" Nets coach Lionel Hollins said. \"It was a game we could've had.\"\nBrooklyn led 96-94 after Shane Larkin's 8-footer with 2:45 left. After Monroe tied it with 2:24 remaining, Michael Carter-Williams stole the ball from Bojan Bogdanovic at the 1:30 mark, leading to Middleton's 18-foot jumper for a 98-96 Bucks' lead.\n\"I was just trying to make a hustle play,\" Carter-Williams said. \"I wasn't scoring the ball too much. I was trying to really get guys involved and I was trying to do the little things. Whatever it took for us to win the game, I'm willing to do.\"\nBrooklyn's Joe Johnson missed a 3, and Carter-Williams then attacked the rim and drew a foul on Thomas Robinson. Carter-Williams converted one of two free throws to extend the lead to 99-96.\nWith 23 seconds remaining, Jack missed a layup and Monroe corralled the rebound. Bayless made two free throws with 19 seconds left.\nAntetokounmpo put the exclamation point on the win by blocking Jack's layup attempt at the rim with 13 seconds left.\nTIP-INS\nBuck: Bayless tied a career high with six 3s. ... Jabari Parker (left knee), John Henson (sore left Achilles), O.J. Mayo (right hamstring strain) and Tyler Ennis (right shoulder) sat.\nNets: Jack has now scored in double figures in 25 of his 30 career starts for the Nets. ... Brooklyn was missing Chris McCullough (right knee rehab) and Willie Reed (right thumb).\nCHAMPIONSHIP PLAY\nThe theft by Carter-Williams with 1:30 left was a major turning point in the game.\n\"That was a championship play,\" Bucks coach Jason Kidd said. \"We had guys getting on the floor. Carter-Williams runs him down from behind and makes a heck of a play.\"\nPARKER TO RETURN\nParker will return for the Bucks at home against the 76ers on Wednesday. According to Kidd, Parker will be limited to 15-20 minutes a night and may not play in back-to-backs. \"That sounds pretty good,\" Parker said. \"Even 20 is a big number. I just go with what I'm given.\"\nKIDD LOOKS BACK\n\"It's just another place,\" Kidd said. \"This is a great place. When you talk about New York, you talk about Brooklyn. For me, the Nets will always have a special place because I played and we had a lot of good things that have happened here. It's always good to see the Nets.\"\nCLINTON IN HOUSE\nFormer President Bill Clinton was on hand courtside at Barclays Center for the game. Hillary Clinton's campaign headquarters are located in Brooklyn.\nUP NEXT\nBUCKS: Milwaukee hosts the 76ers on Wednesday night.\nNETS: Brooklyn is on the road against the Hawks on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994111.669764
}