{
  "game_id": "0021900432",
  "espn_id": "401161074",
  "date": "Dec 21, 2019",
  "matchup": "DET vs. CHI",
  "headline": "Bulls outlast short-handed Pistons 119-107",
  "body": "DETROIT --  The Detroit Pistons swept the season series with Chicago in 2018-19. Now the Bulls are a win away from returning the favor.\n\nChicago can only hope that becomes relevant in a few months, if both teams are competing for a playoff spot.\n\nZach LaVine scored 33 points and Coby White added 19 to help the Bulls outlast the short-handed Pistons 119-107 on Saturday night. Chicago is 3-0 against Detroit this season.\n\nThe Bulls (12-19) and Pistons (11-19) are 10th and 11th in the Eastern Conference standings, but Chicago trails eighth-place Orlando by only one game.\n\n\"We see it, and that's our goal -- get into the eighth place,\" Chicago's Kris Dunn said. \"We've got to go in Monday against Orlando and do what we do.\"\n\nThe Pistons were without Blake Griffin and Derrick Rose, and the Bulls pulled away late thanks to LaVine's outside shooting. He and White made five 3-pointers apiece.\n\nDetroit has lost four straight.\n\n\"I thought we competed in the first half, but we ran out of gas in the second half,\" Pistons coach Dwane Casey said. \"We were trying to get guys in and out and give them a blow, but it is a 48-minute game.\"\n\nThe Pistons led 59-53 at halftime but allowed 40 points in the third quarter. Chicago led 93-83 late in the period, but Markieff Morris made two 3-pointers in the last 10 seconds to cut the margin to four.\n\nLaVine broke a 96-all tie in the fourth with a 3-pointer. Then with the Bulls up by four, Detroit challenged a foul call on Tony Snell with 4:21 left. The call was overturned, but Chicago controlled the ensuing jump ball, and LaVine made another 3 to make it 106-99.\n\nAndre Drummond had 19 points and 14 rebounds for the Pistons. Griffin has been dealing with an illness, and Rose missed the game with left knee soreness.\n\nChicago was 18 of 35 from 3-point range.\n\nTURNOVERS AND REBOUNDS\n\nThe Pistons had 25 turnovers in a 114-93 loss at Boston on Friday night. Then they had to face a Chicago team that entered the game forcing a league-high 18.6 turnovers per game.\n\nDetroit had only 16 turnovers to Chicago's 21 on Saturday, but the Bulls made up for that by outrebounding the Pistons 46-29.\n\n\"We won the boards, which I think you have to do in this building to have a chance to win,\" Bulls coach Jim Boylen said. \"I didn't like the turnovers, but when you make 18 3s you have a little margin for error.\"\n\nQUOTEABLE\n\nDunn on LaVine's offensive efficiency:\n\n\"It's almost like setting up the table. You just can't make food and then think you're just going to eat it out of the pot. You've got to put the plates down, you've got to put the forks down, you've got to put the glasses down. That's what he's doing. He's not scoring, scoring, scoring, scoring. That's easy to guard. You're getting your team involved, you still stay aggressive, and when the fourth quarter comes, be you.\"\n\nTIP-INS\n\nBulls: Wendell Carter Jr. had 12 rebounds, surpassing 600 in his 75th career game. He's the fifth player in team history to reach 600 rebounds in his first 75 games, joining Tom Boerwinkle, Elton Brand, Charles Oakley and Clifford Ray.\n\nPistons: Thon Maker scored seven points, surpassing 1,000 for his career. ... Christian Wood (left knee) missed the game in addition to Griffin and Rose. ... Morris scored 23 points with seven 3-pointers.\n\nUP NEXT\n\nBulls: Visit the Orlando Magic on Monday night.\n\nPistons: Host the Philadelphia 76ers on Monday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996288.120982
}