{
  "game_id": "0021900858",
  "espn_id": "401161500",
  "date": "Feb 25, 2020",
  "matchup": "TOR vs. MIL",
  "headline": "Antetokounmpo leads Bucks by Raptors in East finals rematch",
  "body": "TORONTO --  Giannis Antetokounmpo and the Milwaukee Bucks took down Toronto, wiping away some of the bad memories from a painful trip north of the border in last year’s playoffs.\n\nAntetokounmpo had 19 points and 19 rebounds, Khris Middleton scored 22 points and the Bucks beat the Raptors 108-97 on Tuesday night in a matchup between the top teams in the Eastern Conference.\n\nEric Bledsoe scored 17 points and Brook Lopez had 15 as the NBA-leading Bucks won their fourth straight and 18th of 20. Milwaukee (50-8) was playing the second game of a back-to-back after winning in overtime at Washington Monday.\n\nBehind by 12 points late in the second quarter, the Bucks rallied to beat the Raptors in their first game in Toronto since losing Game 6 of the Eastern Conference finals last May, completing a disappointing collapse after winning the first two games of that series at home.\n\n“You always remember the last time you played here, the feelings you had,” Antetokounmpo said. “It was definitely on my mind.”\n\nAntetokounmpo finished with eight assists, narrowly missing a triple-double. The reigning NBA MVP said Tuesday’s game had a playoff feel to it.\n\n“You expect that,” Antetokounmpo said.\n\nThe Bucks beat the Raptors 115-105 when the teams met in Milwaukee on Nov. 2. They’ll face each other again in consecutive games on April 1 and 3.\n\nPascal Siakam scored 22 points and Fred VanVleet had 14 as the defending NBA champion Raptors lost for the second time in 19 games. Toronto was beaten at home for the first time since Jan. 12 against San Antonio, ending a nine-game run.\n\nIt was a rough night for Raptors starters Serge Ibaka and Kyle Lowry. Ibaka made 2 of 15 shots and Lowry shot 2 for 12. Ibaka went 1 for 10 from 3-point range while Lowry was 1 for 7.\n\n“Tonight it just didn't go in,” Raptors coach Nick Nurse said. “Serga had like 21 straight great games. You’re going to have that one once in a while and tonight wasn’t his night.”\n\nLowry, Terence Davis and Chris Boucher all scored 10 points for the Raptors.\n\nToronto trailed 84-71 to begin the fourth, but Davis scored five points as the Raptors closed the gap with a 7-0 spurt over the first 90 seconds of the final quarter.\n\nVanVleet’s four-point play with 2:23 left cut it to 101-94, and the Raptors forced a steal on Milwaukee’s next possession but VanVleet missed a 3. Antetokounmpo hit a 3 at the other end, restoring the double-digit advantage.\n\nToronto was up 51-39, its biggest lead of the game, after OG Anunoby dunked over Antetokounmpo with 2:58 to go in the second. Milwaukee closed the quarter with an 11-1 spurt, cutting the deficit to 52-50 at halftime.\n\n“Obviously the end of the second quarter was really big for us,” Budenholzer said. “We were not having a very good half.”\n\nAfter missing 10 of 11 attempts from 3-point range in the second, the Bucks hit three in a row from distance during their closing surge. All five of Antetokounmpo’s points in the quarter came during that stretch.\n\nMiddleton made just one of five shots in the first half but went 3 for 3 in the third and scored nine points as the Bucks outscored the Raptors 34-19 to take an 84-71 lead into the fourth.\n\nTIP-INS\n\nBucks: Milwaukee is 8-0 in the second game of a back-to-back. … C Brook Lopez returned to the starting lineup after sitting out Monday’s overtime win at Washington because of a sore back. … The Bucks topped 100 points for the 82nd consecutive game but failed to score at least 110 for the first time in 19 games, snapping the longest such streak in the league this season.\n\nRaptors: C Marc Gasol (left hamstring) missed his 11th straight game while G Norman Powell (broken finger, left hand) missed his ninth. Powell is set to be re-examined next week, Nurse said … F Patrick McCaw sat for the third straight game because of flu-like symptoms but could return Friday against Charlotte, Nurse said. … Toronto made 17 turnovers, leading to 19 points for the Bucks.\n\nBOARD MAN\n\nAntetokounmpo had a season-high 20 rebounds against Philadelphia on Feb. 6. His career high is 21.\n\nT FOR TWO\n\nAfter Lopez was called for a technical foul in the second, Lowry was standing at the line waiting to shoot the free throw when Nurse was called for technical, wiping out Lowry’s attempt.\n\nLONG DISTANCE\n\nToronto set a franchise record with 52 3-point attempts.\n\n“Let’s say 40 of them were probably decent,” Nurse said.\n\nThe Raptors made 18 shots from beyond the arc. Siakam led the way, going 5 for 9.\n\nUP NEXT\n\nBucks: Host Oklahoma City on Friday.\n\nRaptors: Host Charlotte on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995586.766026
}