{
  "game_id": "0021600248",
  "espn_id": "400899698",
  "date": "Nov 27, 2016",
  "matchup": "MIL @ ORL",
  "headline": "Henson scores 20 as Bucks beat Magic, 104-96",
  "body": "ORLANDO, Fla. --  Milwaukee and Orlando switched their starting lineups, and changed worked for the Bucks.\n\nFor the Magic, not as much.\n\nJohn Henson returned to the Bucks' starting lineup and had 20 points and seven rebounds as in the Milwaukee's 104-96 victory on Sunday night.\n\nGiannis Antetokounmpo added 18 points and nine rebounds and the Bucks got double-figure scoring from three reserves in beating Orlando for the second time in a week. Michael Beasley scored 13 points, Malcolm Brogdon added 12 and Greg Monroe had 11 points and seven rebounds.\n\nHenson, who had started five straight games, didn't play at all in the Bucks' 105-99 loss to Toronto on Friday, but was back in against Orlando and scored his season high.\n\n\"That's what we're used to seeing from John when he does play,\" Milwaukee coach Jason Kidd said. \"He was great on both sides of the ball. He's the total package both offensively and defensively.\"\n\nHenson didn't argue with the coach's decision to bench him.\n\n\"It's a long season with too many opportunities to get stressed about it,\" Henson said. \"(Kidd) said all the roles are open and you've got to be ready for whatever comes at you. Hopefully, I can keep this going.\"\n\nOrlando coach Frank Vogel, whose team has stumbled early in games most of the season, tried three new starters -- D.J. Augustin, Aaron Gordon and Bismack Biyombo -- but still lost its fourth straight.\n\nAugustin had 11 points and five assists. Biyombo had four points and four rebounds. Gordon had eight rebounds, but was 0 for 12 from the field and didn't score.\n\n\"It was an attempt to give us a different feel, create a little bit of a different identity and see if it would work because things have not been working,\" Vogel said. \"There were some things that were good about and some that weren't. We've got to keep looking at ways to get better.\"\n\nEvan Fournier led the Magic with 27 points and seven assists. Serge Ibaka scored 19 points, Nikola Vucevic added 17 points and 16 rebounds, and Elfrid Payton had 16 points.\n\nThe last Orlando run came in the middle of the fourth quarter, when Vucevic nailed a 3-pointer to cut the Magic's deficit to 89-86 with 6:38 to play.\n\nHenson responded with a layup, Mirza Teletovic contributed a 20-foot jumper and Henson followed with a dunk to make it 95-86 and the rally was over. Orlando never got closer than six points the rest of the game.\n\nTIP-INS\n\nBucks: Milwaukee's reserves, led by Brogdon's 10 points, outscored the starters 19-17 in the first period. ... Antetokounmpo is averaging 24.5 points, 7.8 assists and 7.3 rebounds in his last four games. ... SF Jabari Parker already has made more 3-pointers this season (17) than he made in his first two seasons (13) in the NBA.\n\nMagic: SF Jeff Green shot 28.8 percent from the field (17 of 59) and 13.2 percent (3 of 22) from 3-point territory in his eight games in the starting lineup. ... Orlando has scored over 100 points only four times this season. The Magic are 3-1 in those games.\n\nVUCEVIC RESPONDS\n\nVucevic has started 284 of his 289 games in an Orlando uniform, including all 16 this season, before Vogel's switch Sunday.\n\n\"Obviously I wasn't happy with the decision they made,\" Vucevic said. \"I don't think that there was a good reason for me to go to the bench. All I can do is control what I can control, play to the best of my ability, help the team win and stay professional.\"\n\nUP NEXT:\n\nBucks: Home against Cleveland on Tuesday. It's PG Matthew Dellavedova's first game against his former team.\n\nMagic: Travel to San Antonio on Tuesday. The Magic have lost 10 straight games to the Spurs.",
  "source": "espn_api",
  "crawled_at": 1764995215.105184
}