{
  "game_id": "0022300370",
  "espn_id": "401584998",
  "date": "Dec 20, 2023",
  "matchup": "LAL @ CHI",
  "headline": "DeMar DeRozan stars as the Chicago Bulls knock off the Los Angeles Lakers 124-108",
  "body": "CHICAGO -- — DeMar DeRozan had 27 points, nine assists and seven rebounds, and the Chicago Bulls beat LeBron James and the Los Angeles Lakers 124-108 on Wednesday night.\n\n\r\n              Chicago shot 54.5% from the field and had eight players score in double figures. Coby White had 17 points and reserve Ayo Dosunmu added 14. Nikola Vucevic had 13 points and 10 rebounds for his 16th double-double of the season.\n\n\r\n              “We was going through it,” DeRozan said of the Bulls’ 5-14 start to the season. “Sometimes you’ve got to go through it so you can find a different type of motivation that you can come together with. The best relationships come out of that.”\n\n\r\n              Despite the continued absence of All-Star guard Zach LaVine due to right foot inflammation, the Bulls opened a six-game homestand with their third win in four games. They also played without forward Torrey Craig after they announced Tuesday that he could miss up to 10 weeks with a right plantar fascia injury.\n\n\r\n              “Anytime you lose a really, really great player, and a talented player, gifted player like Zach, I think it always hurts you,” said Bulls coach Billy Donovan, whose team is 7-3 since LaVine’s injury. “I’m certainly hopeful when he gets himself healthy he can get back to where he was. I think with what he was dealing with his foot for a long period of time, I’m not so sure that he was ever right.”\n\n\r\n              James had 25 points, 10 rebounds and nine assists for Los Angeles, falling just shy of a second consecutive triple-double. Anthony Davis had 19 points and 14 rebounds in his hometown.\n\n\r\n              The Lakers have dropped four of five since winning the NBA In-Season Tournament.\n\n\r\n              Trailing by as many as 18 points early in the second quarter, Los Angeles repeatedly trimmed the deficit to as low as two as late as halfway through the third quarter, but couldn’t overtake DeRozan and Chicago.\n\n\r\n              “We all hate losing,” said Davis, who had his sore left ankle wrapped postgame. “There’s no break coming. No help coming. There’s no cavalry. We’ve got to do it within this locker room. We’ve got everyone back now. We just got to find a way to get in the win column.”\n\n\r\n              The Bulls have put together their best stretch of perimeter shooting all season since losing the sharpshooting LaVine. After hitting 18 of 34 3-point attempts against the Lakers, the Bulls have averaged over 14 3-pointers per game over their last 10 contests, which would rank near the top of the NBA over a full season.\n\n\r\n              “Playing a lot faster has opened up a lot for us in that regard,” White said. “Transition 3s and not playing against a set defense.”\n\n\r\n              Despite an early flurry when James scored or assisted on the first nine Lakers points, the Bulls opened a 48-30 lead early in the second quarter behind hot outside shooting. Both defenses came into the night among the league’s worst in allowing 3-pointers, but it was the Bulls who had the most success from deep. Alex Caruso scored 15 points and was one of four Bulls who made three or more 3-pointers.\n\n\r\n              A Vucevic corner 3 helped send the Bulls to halftime up 61-55. The Bulls never trailed after the first two minutes of the first quarter, and both teams emptied their benches for the final minutes.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At the Minnesota Timberwolves on Thursday night.\n\n\r\n              Bulls: Host the Spurs on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995531.48803
}