{
  "game_id": "0021600916",
  "espn_id": "400900311",
  "date": "Mar 03, 2017",
  "matchup": "OKC @ PHX",
  "headline": "Suns upend Thunder on broadcaster Al McCoy's big night",
  "body": "PHOENIX -- Phoenix native Alan Williams walked up the court with a few seconds left and looked over at the broadcast table, a victory in hand for his Suns.\n\"That's for you, Al!\" Williams shouted and pointed toward radio broadcaster Al McCoy.\nIt was a fitting tribute to the man Williams, as a kid, heard calling games on the radio. The Suns beat the Oklahoma City Thunder 118-111 on Friday night after McCoy's induction into the team's Ring of Honor.\n\"It's not often that you can write a script like this,\" Williams said. \"It's a privilege and an honor to be able to play the game that he's getting inducted to after growing up listening to him. I don't know how many guys have gotten the chance to do that.\"\nOklahoma City star Russell Westbrook had 48 points, 17 rebounds and nine assists, but couldn't offset the Suns' quick pace that wore out the fatigued Thunder.\n\"We just put ourselves in a hole, man, not getting stops when we needed to, and obviously not finishing the game like we wanted to,\" Westbrook said.\nEric Bledsoe led the Suns with 18 points, Williams added 14 points and 13 rebounds for Phoenix, and Tyler Ulis had a season-high 14 points to go with seven assists. The Suns won their third straight home game and ended a six-game losing streak to the Thunder.\n\"Great night for Al, couldn't be a better night with a bigger win,\" Suns coach Earl Watson said.\nOklahoma City made a late push, trimming the Suns' lead to four on Alex Abrines' 3s, but the Suns made free throws to put it away. The Thunder lost both games of a back-to-back that ended in Phoenix after winning the previous four.\nThe 83-year-old McCoy was honored at halftime. He's in his 45th season calling Suns games. Eight of 14 other Suns Ring of Honor inductees were present, including Charles Barkley, who offered brief remarks and introduced McCoy's son.\nFans were give placards that read \"Thank You Al!\" and players and staff wore purple T-shirts bearing McCoy's catch phrase, \"Shazam!\" Former Suns stars Steve Nash and Jason Kidd offered congratulations via scoreboard video during timeouts.\n\"If you'll keep accepting me, and God keeps smiling on me, I'm just going to keep going,\" McCoy said, concluding his acceptance speech amid cheers.\nThen he looked up to see his name and likeness revealed on the arena facade below the second deck. After the game, Suns players and coaches approached McCoy to shake his hand.\nThe Thunder looked fairly fresh early after an early morning arrival in Phoenix, the second stop in less than 24 hours following a loss at Portland late Thursday night. Oklahoma City took a 24-12 lead with 2:53 left in the first quarter when Enes Kanter scored, was fouled and made a free throw.\nThe Suns cut it to 28-23 at quarter's end, despite making just 6 of 22 shots in the first 12 minutes.\nPhoenix went ahead 33-32 on a reverse layup by Williams at the 7:51 mark of the second quarter. Then things got a little testy.\nWestbrook and Suns rookie Derrick Jones Jr. shoved each other in front of the Phoenix bench during a stoppage in play, and both were given technical fouls. That energized the fans, who booed Westbrook and rose to their feet with a roar when Ulis and Marquese Chriss connected for an alley-oop layup.\nJones refused to back down defensively against the snarly Westbrook, and his one-handed putback slam of Williams' miss gave the Suns a 42-36 lead with 5:22 left in the half.\nThe Suns led by as many as eight late in the half, but Westbrook made a 3-pointer with a second left and the Thunder trailed 58-55. Westbrook had 20 first-half points.\nThe Suns took their largest lead, 14 points, in the third quarter, only to see the Thunder cut it to three. Jared Dudley's 3 with 4.6 seconds left had the Suns in front 87-79 after 36 minutes.\nTIP-INS\nThunder: G Victor Oladipo remained out with back spasms. He's missed the past five games. ... Head coach Billy Donovan was issued a technical foul in the second quarter.\nSuns: Coach Earl Watson on McCoy: \"I get interviewed by him every game, so for me it is more intimate. ... He's seen it all. His vision, his jokes, everything about his presence is legendary.\" ... Jones, on rankling Westbrook: \"I don't think I got under his skin, it's just the heat of the game, it happens. I was just playing defense, that's what Coach told me to do ... His elbow was up and I just moved it out of the way.\"\nSPRING TRAINING AND HOOPS\nA number of major league baseball players attended the game, including two-time American League MVP Mike Trout and Cincinnati Reds star Joey Votto.\nUP NEXT\nThunder: At Dallas on Sunday.\nSuns: Host Boston on Sunday in popular former Suns guard Isaiah Thomas' return.",
  "source": "espn_api",
  "crawled_at": 1764995265.2196212
}