{
  "game_id": "0021600027",
  "espn_id": "400899477",
  "date": "Oct 29, 2016",
  "matchup": "CHA vs. BOS",
  "headline": "Bradley hits 8 3s, Celtics beat Hornets 104-98",
  "body": "CHARLOTTE, N.C. --  Avery Bradley said his goal coming into the season was to expand his game.\n\nSo far, so good.\n\nBradley had 31 points on a career-high eight 3-pointers and grabbed 11 rebounds, and the Boston Celtics defeated the Charlotte Hornets 104-98 Saturday night.\n\nBradley was 8 of 11 from beyond the arc as the Celtics shot 75 percent from the field in the fourth quarter to pull away.\n\nBradley is averaging 21.3 points and nearly nine rebounds through three games this season.\n\n\"That's my mindset this year -- I'm trying to rebound, pass the ball and make plays for others,\" Bradley said. \"I work on my game every single summer and know I'm trying to put it in the game.\"\n\nIsaiah Thomas had 24 points and seven assists and Al Horford added 14 points for the Celtics, who trailed by one entering the fourth quarter.\n\nBoston finished 15 of 31 from 3-point range, while the Hornets were just 9 of 32.\n\nCoach Brad Stevens left Bradley in the game with the second team to start the fourth quarter and the strategy paid off. Bradley was 5 of 7 from the field in the final 12 minutes and made all three 3-point attempts.\n\n\"We've been starting or playing early in those quarters -- the second or fourth -- either Isaiah or Avery to try to keep one of our guards in with the second unit,\" Stevens said. \"I did think he was gassed at about the seven-minute mark. That's why we took him back out for a couple of minutes.\"\n\nHornets coach Steve Cliffford said Bradley was terrific.\n\n\"Especially in the stretch where they got a little bit of cushion (in the fourth quarter) which ended up being the difference in the game,\" Clifford said. \"They're a good team and they played well. You can see why people are saying they'll be top two or three in the East.\"\n\nWalker led the Hornets in their home opener with 29 points, while Frank Kaminsky had 11 points and four rebounds in his first regular season action.\n\nThe Hornets spent most of the game trying to claw even with the Celtics after falling behind early. They finally took the lead on a 7-foot jumper by Nicolas Batum on the final possession of the third quarter. But the lead was short-lived as Bradley started to heat up in the fourth quarter and the Celtics built a 93-79 lead.\n\nTIP-INS:\n\nCeltics: G Marcus Smart is making progress from his left ankle sprain, but Stevens said he's not sure if Smart will play Wednesday vs. Chicago. \"I anticipate that he'll at least go through some of Monday's practice, but I don't know if he'll be live,\" Stevens said. ... Amir Johnson received a flagrant 1 foul when he elbowed Cody Zeller in the head on a post-up move.\n\nHornets: Owner Michael Jordan took in the team's home opener from the end of the bench. ... C Roy Hibbert, who has had a strong start to the season, missed the game with soreness in his right knee. ... G Jeremy Lamb left the game in the second quarter with a strained left hamstring and did not return. ... The Hornets took 22 free throws in the first half; Boston just two.\n\nTOO MANY TURNOVERS:\n\nStevens wasn't real happy with his team's 13 turnovers that led to 13 points for the Hornets.\n\n\"They're one of the best teams in the NBA at packing the paint,\" Stevens said. \"We tried to thread the needle a little bit too much.\"\n\nPOOR DEFENSE:\n\nClifford didn't like his team's effort on defense, particularly in the second half where they allowed 60 points.\n\n\"When you play defense, there's a way you do it. You have the right stance, you have the right talk, you have the right organization,\" Clifford said. \"That gives you a chance. When guys start making their own stuff up, you've got no shot against a good team. And that's what happened tonight.\"\n\nUP NEXT:\n\nCeltics: Host Chicago on Wednesday before heading on the road to face LeBron James and Cavaliers on Thursday.\n\nHornets: Host Philadelphia on Wednesday, part of five home games during a six-game stretch.",
  "source": "espn_api",
  "crawled_at": 1764995553.297029
}