{
  "game_id": "0021500636",
  "espn_id": "400828523",
  "date": "Jan 20, 2016",
  "matchup": "OKC vs. CHA",
  "headline": "Durant's 26 points lead Thunder past Hornets",
  "body": "OKLAHOMA CITY -- Russell Westbrook put on a quite a show with his unselfish play -- again.\nKevin Durant scored 26 points, but Westbrook controlled the action as the Oklahoma City Thunder beat the Charlotte Hornets 109-95 on Wednesday for their sixth straight win. Westbrook collected 16 points, 15 assists, eight rebounds and five steals in 27 minutes before sitting out the entire fourth quarter because the Thunder were in control.\nWestbrook set the tone for the night with six assists in the first quarter. Durant had 15 points in the opening period, matching his highest total for a first quarter this season.\n\n\"First quarter, he's going out of his way to get assists,\" Durant said. \"He's playing a video game. Trying to get all the assists early and trying to get everybody involved early, and it's helping us out.\"\nWestbrook dominated, despite shooting 5 for 14 from the field.\n\"With the weapons we have, the best way for us to play and the best way for myself to play is to find those guys, get those guys shots, and I can score when I need to,\" Westbrook said.\nSteven Adams had 10 points and 10 rebounds for the Thunder, who have won 21 of their past 25 games.\nCharlotte's Kemba Walker, who scored 52 points Monday in a win over Utah, led the Hornets with 21 points. Jeremy Lin scored 16 points and Frank Kaminsky added 15.\nCharlotte shot just 42 percent from the field and was outrebounded 51-34 in its 10th loss in 12 games.\nDurant scored 17 points and Westbrook had 11 assists in the first half to help the Thunder to a 52-45 lead at the break. Walker scored 15 points to keep the Hornets in it.\nThe Thunder created distance in the first half of the third quarter. Westbrook found Serge Ibaka in the right corner for a 3-pointer and a 70-56 lead. Singler's back-to-back 3-pointers made it 88-68 late in the third quarter. Westbrook had 10 points and four assists in the period.\n\"He's a great player,\" Walker said. \"Great players, when they're not having a great shooting night, they find other ways to impact the game. He's been doing that all year. Whenever he's not shooting well, he's making assists, making plays, rebounding -- that's why he's such a great player. When he doesn't have to score huge every night for their team to win, he can make plays, and that's what he did tonight.\"\nSTAT LINES\nWestbrook has recorded at least 10 assists in each of his last four games. In the five games he has completed during the win streak (he was ejected once), he is averaging 18 points, 12.6 assists and 8.2 rebounds with two triple-doubles.\n\"He just picks and chooses his spots,\" Durant said. \"He knows when to go rebound, knows when to score, knows when to make the right play. He's playing at a nice level right now.\"\nON THE RISE\nThunder forward Kyle Singler scored a season-high 11 points. The reserve has played more than 20 minutes in two of the past three games.\n\"He's playing great basketball, playing confident basketball,\" Durant said, \"and we've got to just keep pumping him up and giving him confidence and believing in him and he's going to start to get better for us. He's been playing well, and we're going to need him to continue to do so.\"\nMASH UNIT\nCharlotte center Al Jefferson is out after having knee surgery. He has missed much of the season with injuries and an NBA suspension. The Hornets are 12-7 when he is in the lineup and 7-16 without him.\nTIP-INS\nHornets: Charlotte had assists on just eight of its 18 baskets in the first half and 17 of its 34 buckets overall. ... G Nicolas Batum started and was scoreless in 24 minutes. ... Coach Steve Clifford was called for a technical foul during a timeout in the third quarter.\nThunder: Dion Waiters and Lin were called for double fouls in the fourth quarter, and Waiters also was issued a technical. .. Ibaka got a technical in the fourth quarter. He finished with 11 points and eight rebounds. ... The Thunder are 3-1 when they commit 20 or more turnovers.\nUP NEXT\nHornets: At Magic on Friday.\nThunder: At Mavericks on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994166.370976
}