{
  "game_id": "0021601190",
  "espn_id": "400900568",
  "date": "Apr 08, 2017",
  "matchup": "ORL vs. IND",
  "headline": "Pacers win 3rd straight, move into sole possession of 7th",
  "body": "ORLANDO, Fla. -- The Indiana Pacers are surging at just the right time.\nPaul George scored 37 points, Myles Turner had 23 points and 10 rebounds, and the Pacers beat the Orlando Magic 127-112 on Saturday night.\nThe Pacers pulled a game ahead of Chicago and Miami for seventh place in the Eastern Conference and climbed back to .500 with their third straight victory.\n\"This was huge,\" George said. \"We're going in the right direction, beating who we're supposed to beat and playing some of our best basketball all season. This really feels good.\"\nIndiana has won by an average margin of 16 points during the streak, while cutting its magic number for clinching a playoff berth to two. Thaddeus Young scored 14 points and Kevin Seraphin and CJ Miles had 11 apiece for Indiana.\nIndiana toyed with Orlando most of the game, getting layup after layup against a Magic team unable to guard the basket. The Pacers' starting frontcourt of George, Turner and Young were a combined 20 of 24 in the first half when Indiana built a 68-59 lead. The trio finished the game 31 of 43 (72.1 percent) from the field.\nWhen the Magic defense adjusted in the second half, Indiana hit 8 of 13 3-pointers, most of them wide-open shots.\n\"We know we're in a situation where we have to win games and we're responding,\" Pacers coach Nate McMillan said. \"We were able to execute offensively and we continued to elevate our game each quarter, which is what you need to do this time of year.\"\nTerrence Ross scored 29 points, Evan Fournier added 23 and Aaron Gordon had 17, but the Magic never could keep pace with Indiana.\nOrlando coach Frank Vogel, who coached the Pacers for five seasons, didn't hide his disgust with his current team's defense against a team he knows very well.\n\"We were terrible on the defensive end,\" Vogel said. \"They were challenged to raise their level at every timeout, every huddle and at halftime, but we never got them under control. Credit the Pacers for playing a great game.\"\nOrlando did shoot its way back in the game early in the second half, cutting the deficit to 84-80 with 3:49 left in the third quarter, but that was as close as the game would get. Indiana responded with a 15-2 run to close out the quarter and when Miles nailed a 3-pointer to start the final period, the lead was back to 20.\n\"I thought we did a good job of screening and freeing up each other all night long,\" McMillan said. \"When you're sharing the ball like that, it's just a matter of knocking down shots you practice every day.\"\nTIP-INS\nPacers: Indiana had lost eight straight road games by an average of 11.9 points before beating Orlando. ... The Pacers have won six straight road games in Orlando. ... Young is averaging 14.6 points in the last six games. ... The Pacers outscored the Magic 38-20 in the paint in the first half and 64-38 for the game.\nMagic: Elfrid Payton is averaging 15.2 points, 10.6 assists and 6.6 rebounds in the last five games. ... Gordon is averaging 21.1 points and 9.2 rebounds in the same stretch. ... Orlando shot only 41.1 percent in its meetings with Indiana this season.\nHELP FROM LANCE\nLance Stephenson has been with Indiana for only a week and George can see what a difference he makes. Stephenson had eight points, six rebounds and three assists in a reserve role. \"Lance definitely has given us life, a new excitement to this team,\" George said. \"He's helped take a lot of the burden off me.\"\nUP NEXT\nPacers: Travel to Philadelphia for a Monday game. Indiana has won 11 of the last 13 meetings with the Sixers.\nMagic: Play at Chicago on Monday night, a second straight game against a team battling for one of the last two playoff spots.",
  "source": "espn_api",
  "crawled_at": 1764995805.905503
}