{
  "game_id": "0021600325",
  "espn_id": "400899767",
  "date": "Dec 07, 2016",
  "matchup": "MIL vs. POR",
  "headline": "Antetokounmpo gets triple-double, Bucks beat Blazers 115-107",
  "body": "MILWAUKEE --  Giannis Antetokounmpo is emerging as a dynamic player and precocious leader -- and at 22 years old, he's already closing in on one of Kareem Abdul-Jabbar's franchise records.\n\nAntetokounmpo got his second triple-double of the season to lead the Milwaukee Bucks over the Portland Trail Blazers 115-107 on Wednesday night.\n\nAntetokounmpo had 15 points, 12 rebounds and 11 assists for his seventh career triple-double -- second-most with the franchise behind Abdul-Jabbar's eight. Antetokounmpo is the only NBA player averaging at least 20 points, eight rebounds, five assists, two blocks and two steals this season.\n\n\"Maybe it wasn't a fluid game for Giannis, but this is what he does,\" Milwaukee coach Jason Kidd said. \"He fills up the stat sheet. ... He is a winner and he helped his team find a way to win tonight by getting other guys involved. That is the maturity of a 22-year-old, that you can see a leader is growing right in front of us.\"\n\nJabari Parker added 27 points for Milwaukee, which rebounded from a one-point home loss to San Antonio on Monday to win for the fifth time in six games.\n\n\"The team is rolling right now, feeling good,\" Antetokounmpo said. \"Jabari is a beast right now.\"\n\nThe Bucks entered holding opponents to a NBA-best .311 shooting percentage from 3-point range, but Portland drilled 17 of them on 40 attempts -- both season highs.\n\nDamian Lillard made five and scored a team-high 30 points to go with seven rebounds and six assists.\n\nC.J. McCollum added 23 points, including four 3-pointers, as the Blazers continued a nine-game stretch of playing eight times on the road.\n\n\"That's one of the things we do,\" Portland coach Terry Stotts said. \"We shoot a lot of 3s when we move the ball.\"\n\nMilwaukee led 101-90 with 5:27 left after two free throws from Antetokounmpo, but then Portland hit three straight 3s in 56 seconds to trim the deficit to two.\n\nThe Bucks responded with the next three baskets to take a 107-99 lead after a jumper from Parker with 2:03 to go.\n\nAnother 3 from Allen Crabbe trimmed the margin to 109-105 with 56 seconds remaining, but that is as close as Portland got.\n\nTIP-INS\n\nTrail Blazers: The team's 12 3-pointers in the first half tied the franchise high. The last time it had that many was 2002. ... Mason Plumlee became the fastest Portland player to tally 150 rebounds and 100 assists (23 games) since Scottie Pippen in 1999-2000 (22 games).\n\nBucks: Jason Terry played his 1,300th career game. ... Antetokounmpo was called for a 10-second violation when attempting a free-throw in the third quarter. ... Miles Plumlee, the older brother of Mason, sat out for the third straight contest.\n\nONE WAY TO LOSE\n\nPortland had eight of its 15 turnovers in the final quarter, including three in a stretch of 1:13 midway through the frame.\n\n\"I don't know if I'd say it was sloppy,\" Stotts said. \"Not all turnovers are sloppy. (Crabbe) stepped out of bounds -- that's a turnover. We had a 24-second shot clock (violation) -- that's a turnover. But I was probably more concerned with some of our shots.\"\n\nQUOTE OF THE NIGHT\n\nKidd, when asked about Lillard's play: \"He is one of the top guards in the world,\" he said. \"His range is once he gets past half court.\"\n\nMONROE SCORING AGAIN\n\nGreg Monroe had 15 points -- one shy of his season high. Since a two-point game at Brooklyn on Thursday night, he is averaging 12.3 points per game in three outings.\n\nUP NEXT\n\nTrail Blazers: Visit Memphis on Thursday night after winning there Nov. 6.\n\nBucks: Host Atlanta on Friday night for the first time this season.",
  "source": "espn_api",
  "crawled_at": 1764995207.242583
}