{
  "game_id": "0021600214",
  "espn_id": "400899664",
  "date": "Nov 23, 2016",
  "matchup": "ORL vs. PHX",
  "headline": "Alex Len, Eric Bledsoe lead Suns past Magic, 92-87",
  "body": "ORLANDO, Fla. --  Phoenix Suns coach Earl Watson views his team as young and still a work in progress.\n\nThe Suns, however, seemed to take a critical step on the defensive end Wednesday night in a 92-87 victory over Orlando that concluded an otherwise disappointing road trip.\n\nWith Devin Booker, Eric Bledsoe and Alex Len leading the way, Phoenix limited the Magic to just 36 percent shooting from the field and only 28 percent shooting from 3-point range.\n\nOur defensive presence was on point tonight,\" said Watson, whose team snapped a two-game losing streak and finished the six-game trip 2-4. \"We got two wins, we could have gotten more. We're not content with anything.\n\n\"We're a young team, we're working, we're headed in the right direction. That was a total team effort tonight.\"\n\nLen had 17 points and 12 rebounds to go along with two blocked shots in the paint. Bledsoe had 16 points as all five starters finished in double figures -- and P.J. Tucker came off the bench to put 10 points.\n\nThe victory didn't salvage the road trip but it certainly allowed the Suns to feel like they have momentum as they head home.\n\n\"This was a must-win for us,\" Bledsoe said. \"We came up short in Washington and Philly. This one we had to cap off before heading back home.\"\n\nThe most impressive part stepping up on defense, where Phoenix (5-11) has been among the NBA's worst. But Wednesday night they had solid help defense and gave Orlando's shooters few open shots.\n\nEvan Fournier led the Magic (6-9) with 25 points and Nikola Vucevic added 21 points, but none of the other starters hit double figures. Jeff Green went 0 for 7 from the field and Serge Ibaka was just 2 for 5 from the field and finished with only five points.\n\n\"I'm very pleased with how unselfish we were,\" Watson said. \"They played selfless and it showed on the defensive end.\"\n\nFor the Magic it was another frustrating night shooting the ball. With Green now in the starting lineup in place of Aaron Gordon, the only consistent scoring off the bench has come from D.J. Augustin, who had 12 points Wednesday.\n\n\"We just had a number of guys have bad nights,\" Magic coach Frank Vogel said.\n\nTIP-INS\n\nSuns: Forward T.J. Warren missed his second straight game with what coach Earl Watson described as a head injury. ... Chandler is still missing from the team after the death of his mother. ...The Suns will now play their next three games at home. They don't hit the road again until Dec. 3 when they face Golden State.\n\nMagic: Coming into Wednesday night's game, the Magic had held their previous six opponents to a combined 92.3 points per game and 41 percent shooting from the field. .. .With the addition of center Bismack Biyombo this season, the Magic are averaging 5.57 blocks, which ranks sixth in the NBA.\n\nDOMINATING THE PAINT\n\nLen had a particularly strong performance for the Suns in the paint. He was 6-for-10 from the field, hit 5 of 6 free throws and four of his 12 rebounds came on the offensive end.\n\n\"He's amazing,\" Watson said. \"He's growing every game. We absolutely love him.\"\n\nMISSING THE POINT\n\nFor second straight game, Magic point guard Elfrid Payton was sitting on the bench for much of the critical fourth quarter while Augustin played the bulk of the minutes. Payton logged just 4:30 minutes in the final quarter.\n\n\"We needed some shooting out there, so I left D.J. in there longer than usual,\" Vogel said.\n\nUP NEXT\n\nSuns: Phoenix hosts Minnesota on Friday.\n\nMagic: Orlando hosts Washington on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995876.7212958
}