{
  "game_id": "0022401006",
  "espn_id": "401705572",
  "date": "Mar 19, 2025",
  "matchup": "DEN @ LAL",
  "headline": "Luka Doncic scores 31 after a big 1st quarter, and the Lakers rout the depleted Nuggets 120-108",
  "body": "LOS ANGELES -- — Luka Doncic had 31 points, nine rebounds and seven assists in just three quarters of work, and the Los Angeles Lakers routed the Denver Nuggets 120-108 on Wednesday night in a matchup of injury-depleted Western Conference contenders.\n\n\r\n              Nikola Jokic (elbow) and Jamal Murray (ankle) missed their second straight games for Denver, while LeBron James (hamstring) and Rui Hachimura (knee) continued their longer-term absences for Los Angeles.\n\n\r\n              Austin Reaves had 22 points and eight assists for the Lakers, who have won nine consecutive home games and three straight since finishing their 0-4 road trip last Friday with a loss at Denver.\n\n\r\n              Aaron Gordon scored 26 points for the Nuggets.\n\n\r\n              The Lakers scored a season-high 46 points in the first quarter led by Doncic, who scorched Denver for 21 points in his highest-scoring quarter of the season. He missed the Lakers’ 131-126 loss to Denver last Friday, when the Lakers nearly won without him and James.\n\n\r\n              Los Angeles led by 28 after three quarters, allowing Doncic to get extra rest amid five home games in seven days.\n\n\r\n              Bronny James played the final 3:58.\n\n\r\n              Takeaways\r\n              Nuggets: Even without Jokic and Murray, offense wasn't the problem. Los Angeles made 60% of its shots in the first three quarters.\n\n\r\n              Lakers: Doncic dominated early, but they're thriving with balance. Six Lakers scored in double figures, and big men Jaxson Hayes and Christian Koloko played solid defense.\n\n\r\n              Key moment\r\n              Doncic was afire from the opening tip, scoring nine points in less than three minutes and 20 points in about eight minutes. He led an 18-2 run midway through the first quarter with three 3-pointers and three assists before cooling off.\n\n\r\n              Key stat\r\n              Doncic scored 30 points for the 200th time in his NBA career. He's done it eight times in 16 games with LA.\n\n\r\n              Up next\r\n              The Nuggets visit the Trail Blazers on Friday. The Lakers host the Bucks on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998338.896522
}