{
  "game_id": "0021901299",
  "espn_id": "401224774",
  "date": "Aug 11, 2020",
  "matchup": "PHX @ PHI",
  "headline": "Booker's 35 points help streaking Suns beat 76ers 130-117",
  "body": "LAKE BUENA VISTA, Fla. --  Devin Booker scored 35 points and the Phoenix Suns protected their playoff hopes by beating the Philadelphia 76ers 130-117 on Tuesday to remain undefeated in the NBA restart.\n\nMikal Bridges added 24 points and Ricky Rubio had 16 points with 10 assists as the Suns pulled into a ninth-place tie in the Western Conference with Memphis, a half-game behind new No. 8 Portland.\n\n\"We know we're not totally in control of our fate but we put ourselves in a good position,\" Suns coach Monty Williams said. \"No one would have guessed the Phoenix Suns would be in this position before all of this started.\"\n\nPhoenix is 7-0 as the only undefeated team in the restart and an unlikely factor in the tight race for a spot in this weekend's play-in for the final playoff spot. Still, the Suns know even an 8-0 finish in the bubble may not be enough to earn a playoff spot.\n\n\"That's life, man,\" Booker said. \"We're controlling what we can control and that's the eight games they gave us. ... I don't think there's going to be any sad faces around here, whether we make the playoffs or not.\"\n\nPhoenix pulled away late after leading only 105-102 following back-to-back baskets by Alec Burks, who led the 76ers with 23 points.\n\nA dunk by Cameron Johnson capped a 10-3 run that stretched the lead to 115-105.\n\nThe Suns continued their high-scoring play in the bubble after averaging 120 points in the first six games.\n\nPhiladelphia, No. 6 in the East and already assured of a playoff spot, is attempting to prepare for the postseason after losing Ben Simmons to a knee injury.\n\nShake Milton was Philadelphia's only healthy starter against the Suns. The 76ers also were without Joel Embiid (left ankle), Tobias Harris (sore right ankle) and Al Horford (sore left knee). Josh Richardson was rested.\n\n76ers coach Brett Brown said he was satisfied his short-handed team achieved the goal \"to connect some of the dots on things that will be transferable to the playoffs.\"\n\nA FAMILY SURPRISE\n\nPhoenix players were all smiles as they were surprised by having family members provide personalized introductions of the players  before the game. All the players turned and watched the introductions while crowding around each player during his time in the spotlight.\n\nThe video also has been played before other \"home\" games in the bubble.\n\n\"It's unbelievable,\" Booker said. \"I think the first time it caught us off-guard. All the sacrifices we make in our lives, we do it for those people.\"\n\nTIP-INS\n\nSuns: After making each of his 14 free throws in Monday's win over Oklahoma City, his third straight game of making every free throw, Booker was less than perfect from the charity stripe. He missed an attempt early in the third period and finished 11 of 12. He is tied for second in the league with his 91.9% free-throw shooting.\n\n76ers: Burks posted his third straight game with at least 20 points. Raul Neto had 22 points. Mike Scott had 17.\n\nNEAR TRIPLE-DOUBLE\n\nPhiladelphia center Kyle O'Quinn finished one point away from a triple-double. He had nine points, 11 assists and 10 rebounds.\n\n\"I can't tell you how much respect I have for him in the way that he's handled this whole season,\" Brown said. \"He hasn't received a lot of minutes and when I see him in the locker room and in a team meeting and how he carries himself -- he stays in great shape. ... He really cares. He talks, he communicates, he's in great shape. He maintains that fitness base.\"\n\nMILESTONE\n\nBooker became the Suns' career leader with his 91st 30-point game, breaking a tie with Walter Davis. Booker has had 28 30-point games this season, including three straight.\n\nUP NEXT\n\nSuns: Play the Dallas Mavericks on Thursday.\n\n76ers: Play the Toronto Raptors on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996534.301095
}