{
  "game_id": "0022300817",
  "espn_id": "401585445",
  "date": "Feb 25, 2024",
  "matchup": "MIL @ PHI",
  "headline": "Bucks beat 76ers 119-98 in Doc Rivers' return to Philadelphia",
  "body": "PHILADELPHIA -- — Giannis Antetokounmpo scored 30 points, Damian Lillard added 24 and the Milwaukee Bucks beat the 76ers 119-98 on Sunday in Doc Rivers’ return to Philadelphia.\n\n\r\n              Rivers was fired by Philadelphia after last season. He coached the 76ers from 2020-23, never getting past the second round of the playoffs, and Sunday was 12th game since taking over in Milwaukee.\n\n\r\n              “It was awesome,” Rivers said of his return. “I had three good years here, and I’m not talking about basketball, I’m talking about life. I enjoyed my stay here. I have made friends for life. The fans were good, too. There were a couple hilarious comments. One guy told me that Larry David was looking for me to golf. I thought that was pretty funny.”\n\n\r\n              Rivers was greeted by a chorus of boos from the sellout crowd during introductions, but his team quickly took the crowd out of the game with a blistering first quarter.\n\n\r\n              Lillard scored the first seven points for the Bucks and finished with 11 points in the quarter as Milwaukee built a 14-point lead. \n\n\r\n              “I thought we were consistent,” Lillard said. \"We got into the paint, we were willing to make the extra pass to find the open guy and we got quality looks. To play good offense you find quality shots and have a lot of mix. I thought that’s what we did.”\n\n\r\n              Antetokounmpo, who also finished with 12 rebounds and nine assists, wrapped up the first half with a flourish, hitting a driving layup and also making a full-court pass to Brook Lopez for a dunk as the horn sounded to give Milwaukee its largest lead at 21 points. Philadelphia never got closer than 12 points in the second half.\n\n\r\n              Antetokounmpo went to the free throw line more times himself (12) than the entire 76ers team (11).\n\n\r\n              Rivers credited that to his team’s defense.\n\n\r\n              “We had been putting such an emphasis on defense,” Rivers said. “The last few games we’ve been terrific. When you have Giannis on your team, if you can get stops and get him in transition, Giannis in transition is a problem for everybody.”\n\n\r\n              Malik Beasley added 20 points and Bobby Portis Jr. had 17 as Milwaukee won its second straight game coming out of the All-Star break after going 3-7 in Rivers’ first 10 games as coach.\n\n\r\n              \"It all comes down to communicating,” Beasley said. “Today was one of the first times we all were communicating. (Before) we were getting mixed up making sure we stay with our own guy or switch. We did a great job with that today.”\n\n\r\n              Tyrese Maxey had 24 points and De’Anthony Melton added 16 for the 76ers, who have dropped eight of 12 games since losing reigning MVP Joel Embiid to a left knee injury in January. \n\n\r\n              “We have a lot of guards and a big man shortage,” Philadelphia coach Nick Nurse said. “We’re trying to figure some things out. But we still have to do a little bit better of a job of ‘drive and kick’ style basketball with this group of guys. We’ve got to get organized. We’ve got to be more organized on the offensive end.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Charlotte on Tuesday.\n\n\r\n              76ers: Travel to Boston on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996112.349231
}