{
  "game_id": "0022301191",
  "espn_id": "401585819",
  "date": "Apr 14, 2024",
  "matchup": "ORL vs. MIL",
  "headline": "Magic beat Bucks 113-88 to finish fifth in East, will play Cavaliers in first round of playoffs",
  "body": "ORLANDO, Fla. -- — Paolo Banchero scored 26 points, Franz Wagner added 25 and Jonathan Isaac headed a shutdown defensive effort in his second start of the season for the Orlando Magic, who secured the No. 5 spot in the Eastern Conference on Sunday with a 113-88 win over the Milwaukee Bucks.\n\n\r\n              The Magic snapped a three-game skid with the win in their season finale and finished at 47-35. They will face fourth-seeded Cleveland in the first round of the East playoffs. A loss would have dropped Orlando into a play-in spot.\n\n\r\n              “We looked at this as a do-or-die game,” Wagner said. “Most guys here haven’t been in the playoffs. Most have been in 20-win seasons and stuff like that. It means a lot to the whole group.”\n\n\r\n              It will be the Magic's first playoff appearance since 2020 and only their third in 12 years. They have not won a playoff series since 2011.\n\n\r\n              “I thought we did a great job of understanding the moment, but knowing that we were going to do it defensively first,” Magic coach Jamahl Mosley said. “And then offensively we let it flow. They trusted each other, made some big passes, some big plays, but it was our defense that sparked everything.”\n\n\r\n              Orlando also won the Southeast Division by one game over Miami.\n\n\r\n              Khris Middleton and Bobby Portis scored 17 points each for Milwaukee. Damian Lillard added 16 points on 2-of-14 shooting for the Bucks, who finished third in the East at 49-33. They will play Indiana in the first round.\n\n\r\n              “I feel good about it,” Lillard said. “I think the one thing about the playoffs this season is everybody can beat everybody. Happy that we got home court, and it's a team we are familiar with.”\n\n\r\n              Isaac started at center in place of Wendell Carter Jr., who had back spams but played 14 minutes off the bench and was a big factor in a second-half Magic rally that put the game away. Isaac played 26 minutes, one short of his season high, and finished with 10 points, eight rebounds and three blocks.\n\n\r\n              “Jonathan Isaac changed the game for them,” Bucks coach Doc Rivers said. “He's long, he's effective and we just kept setting pick-and-rolls with him instead of other guys.”\n\n\r\n              “I just think we allowed the wrong guy to be in the play too many time,” Lillard said.\n\n\r\n              The Bucks played again without Giannis Antetokounmpo, who has a lower leg strain that's left his availability for the playoffs in question.\n\n\r\n              “I honestly don’t know one way or the other,” Rivers said. “I just know he’s doing all the work. We’re getting great reports. Yesterday he did everything so that was positive.”\n\n\r\n              The Bucks led 39-28 when Portis hit a 3-pointer with 7:06 left in the second quarter. It was their last field goal of the half. Wagner scored six points and Isaac hit a 3-pointer during an 11-0 Orlando run that quickly tied it, and the Magic led 47-42 at halftime. Milwaukee shot 0 for 11 with three turnovers in the final seven minutes of the half, scoring only three points on free throws by Khris Middleton.\n\n\r\n              “They scored 12 points in the second quarter. That was our defense really locked in,” Wagner said. “That’s when we got the lead and got a better rhythm offensively too.”\n\n\r\n              Banchero and Carter led the Magic on a 14-4 run late in the third quarter, and Cole Anthony hit three shots during an 11-0 spurt to open the fourth quarter that put Orlando up 91-71.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995675.426322
}