{
  "game_id": "0021900005",
  "espn_id": "401160627",
  "date": "Oct 23, 2019",
  "matchup": "CLE @ ORL",
  "headline": "Magic, Vucevic beat Cavaliers in season opener",
  "body": "ORLANDO, Fla. --  Markelle Fultz's first show in Orlando was a big hit.\n\nFultz had 12 points and six assists, helping the Magic beat the Cleveland Cavaliers 94-85 on Wednesday night in the season opener for both teams.\n\n\"He was the difference in the game in the second half,\" coach Steve Clifford said.\n\nFultz was selected by Philadelphia with the No. 1 overall pick in the 2017 draft. The 21-year-old guard played 33 games in two seasons with the 76ers before he was traded to Orlando in February.\n\nHe was the first Magic player off the bench with 7:10 left in the first quarter. He made his first four shots.\n\n\"Anytime you have a chance to see the ball go in the hoop, the basket just keeps getting bigger and bigger,\" he said. \"It just gave me more confidence. It made me say: `Hey, it's back. I'm good. Let's just keep moving.\"\n\nNikola Vucevic led the Magic with 21 points and nine rebounds. Evan Fournier scored 16 points.\n\nKevin Love had 11 points and 18 rebounds for Cleveland, which trailed by as many as 20 points. Collin Sexton and Tristan Thompson each scored 16 points in John Beilein's first game as Cavs coach.\n\nDarius Garland finished with eight points on 3-for-9 shooting in his NBA debut. Garland was drafted by Cleveland with the No. 5 overall pick in this year's draft.\n\nFournier scored to give Orlando a 53-33 lead with 2:37 left in the first half, but Cleveland battled back in the third quarter.\n\nSexton made a 3-pointer and Thompson had two straight buckets to trim the Magic's lead to 59-54 with 7:31 left.\n\nThe Cavaliers were down 73-67 early in the fourth when Terrence Ross and Mo Bamba each made a 3 to help the Magic pull away.\n\n\"There were a few key moments when we had wide-open shots and missed them, and they had wide-open shots and made them,\" Beilein said. \"We get it to five and then all of a sudden it's 12. Then we get it back to five or six and all of a sudden it's 12 or 14.\"\n\nHOW TO GET BETTER\n\nBeilein figures the Cavaliers will get better just by playing.\n\n\"There's nothing like being in game shape,\" Beilein said before the game. \"How do you get in game shape? You play games. You'll improve exponentially once you start playing games, and that's where the improvement should really spike now.\"\n\nREBOUNDING DEFICIENCY\n\n\"We did a lot of good things, but the rebounding game was a problem,\" Clifford said. \"We haven't rebounded in preseason and we didn't rebound tonight. And turnovers. We were just really sloppy with the ball and that was really impacting how we play.\"\n\nTIP-INS\n\nCavaliers: Love (18), Larry Nance Jr. (14) and Thompson (11) led Cleveland to a 54-46 rebounding edge. ... Garland also had five assists.\n\nMagic: Fultz shot 6 for 12. He missed all three of his 3-point attempts. ... The Magic have won five of eight against the Cavaliers since losing 17 straight.\n\nUP NEXT\n\nCavaliers: Home opener Saturday against the Indiana Pacers.\n\nMagic: Play at Atlanta on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996339.702124
}