{
  "game_id": "0022101095",
  "espn_id": "401360914",
  "date": "Mar 24, 2022",
  "matchup": "TOR vs. CLE",
  "headline": "Siakam matches season high with 35, Raptors top Cavs 117-104",
  "body": "TORONTO -- — Pascal Siakam matched his season high with 35 points, Chris Boucher scored 17 and the Toronto Raptors tightened the Eastern Conference playoff race by beating the Cleveland Cavaliers 117-104 on Thursday night.\n\n\r\n              “It was a good game, it was a big game,\" Siakam said. “I think every game is a big game.”\n\n\r\n              OG Anunoby returned from injury to score 14 points, Scottie Barnes had 11 and Fred VanVleet and Precious Achiuwa each added 10 as Toronto (41-32) snapped a three-game home losing streak and tied Cleveland for the sixth-best record with nine games to go in the regular season.\n\n\r\n              “You’ve got a choice of fighting or you’ve got a choice of running, and our guys don’t run,” Cleveland coach J.B. Bickertaff said. “We’ll lay it out there. But again, we’re in a position where we just have to take care of business. We take care of business, we’ll be fine.”\n\n\r\n              Cleveland had won all three previous meetings with the Raptors this season, meaning the Cavs hold the tiebreaker over Toronto and retain possession of the No. 6 seed in the East. That is the last guaranteed postseason spot, with teams finishing in the Nos. 7-10 spots headed for the play-in tournament.\n\n\r\n              Siakam’s six made 3-pointers matched his career high. He shot 6 for 7 from long range.\n\n\r\n              “He was feeling it, that’s for sure,” Raptors coach Nick Nurse said.\n\n\r\n              Anunoby started for the Raptors, returning to the lineup after missing 15 games because of a fractured right ring finger. He shot 4 for 11 in 26 minutes, finishing 4 for 8 from behind the arc.\n\n\r\n              “It was a good start,” Anunoby said. “It’s been a while, so even just being out there was fun. I missed playing.”\n\n\r\n              Nurse said it was “a big deal” to get Anunoby’s defense and shooting back, and highlighted the interplay between Anunoby and Siakam.\n\n\r\n              “Pascal made some great reads really late, I thought, at the rim,” Nurse said. “He was getting collapsed on and he spring up out of there and found OG. It was good to see them play off each other like that.”\n\n\r\n              Toronto went 16 for 37 from 3-point range. The Raptors have made a season-high 18 3-pointers five times this season, most recently Feb. 28 at Brooklyn.\n\n\r\n              “We talked about the corner 3s, how they’re a really good team, and they shot the lights out from there,” Cleveland’s Lauri Markkanen said. “We’ve got to do a better job. We always try to protect the paint, but we’ve got to fan out to those shooters as well.”\n\n\r\n              Markkanen scored 20 points and Lamar Stevens had 16 for the Cavaliers, who have lost two straight and three of five. Darius Garland had 18 points and 10 assists, and Kevin Love added 12 points and 10 rebounds. Cavs rookie Evan Mobley scored 11 points on 5-for-7 shooting and had eight rebounds.\n\n\r\n              “He did a good job of patrolling the paint for us,” Bickerstaff said. “I thought he shared the ball well when he had his opportunities. I thought he was good.”\n\n\r\n              Toronto missed six of seven attempts to start the game but made seven of its next 13, helping turn a 15-10 deficit into a 25-17 lead after one. The Raptors had assists on seven of their eight baskets in the first, including a no-look pass from Barnes to Siakam, who scored 12 in the quarter.\n\n\r\n              “They were really driving it at us, getting in the paint, making plays,” Stevens said.\n\n\r\n              Thad Young and Boucher combined for 19 points in the second and the Raptors led 58-48 at halftime.\n\n\r\n              Garland scored nine points in the third but Siakam answered with 11 as Toronto took an 83-75 lead to the fourth.\n\n\r\n              “They outplayed us,” Bickerstaff said. “Give them credit where credit is due. There was a level of physicality that we had a hard time breaking through.”\n\n\r\n              NO RUST\n\n\r\n              Siakam said Anunoby looked good despite his long layoff.\n\n\r\n              “I was really impressed with the fact that he hasn’t played and he came back and played like he did today,” Siakam said. “Good job to OG.”\n\n\r\n              DOUBLING HIS PLEASURE\n\n\r\n              Garland has recorded double-doubles in nine of his past 11 games.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Caris LeVert scored 11 points. … Stevens topped 15 points for the third consecutive game. … C Jarrett Allen (broken finger) missed his ninth straight game … G Rajon Rondo (sprained ankle) and F Dean Wade (knee soreness) each sat for the sixth straight game.\n\n\r\n              Raptors: G Gary Trent Jr. (left big toe) sat for the second straight game. … Anunoby last played Feb. 16 at Minnesota. … Play seven of their final nine at home, where they are 18-16. … Outscored Cleveland 18-4 in fast-break points. … Siakam’s career-high is 44, set three times.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Chicago on Saturday night.\n\n\r\n              Raptors: Host Indiana on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992703.694059
}