{
  "game_id": "0021500582",
  "espn_id": "400828469",
  "date": "Jan 13, 2016",
  "matchup": "OKC vs. DAL",
  "headline": "Durant scores 29, Thunder beat Mavericks; Westbrook ejected",
  "body": "OKLAHOMA CITY -- Russell Westbrook's final line against Dallas: zero baskets, zero foul shots, one ejection.\nWestbrook got tossed early after tangling with J.J. Barea, but Oklahoma City had little trouble Wednesday night. Kevin Durant had 29 points and 10 rebounds as the Thunder, helped when the Mavericks sat out their usual starters, romped 108-89.\nWestbrook was ejected in the second quarter after getting his second technical foul following skirmishes with Barea.\n\nWestbrook shot 0 for 3 from the field and 0 for 4 on free throws. He had eight assists and seven rebounds in 14 minutes.\nAsked about what happened, Westbrook wouldn't answer questions about Barea or their skirmish.\n\"I thought we did a good job tonight. Great win for us. The Dallas team came in without a lot of their guys. They did a good job competing,\" he said.\nIt was only the second time in his career that Westbrook didn't score in a game, and the first since March 21, 2010, against Indiana.\nA game that rarely was competitive after the opening minutes quickly turned chippy, with six technical fouls and two ejections. Barea and Westbrook were at the center of it all.\n\"It's a physical game and it's emotional and both teams compete, so things like this happen,\" Dallas coach Rick Carlisle said. \"The officials got it cleaned up to some degree and we finally got the game over with.\"\nWith the Mavericks on the second night of a back-to-back after an overtime loss to Cleveland on Tuesday, Carlisle chose not to play his five regular starters -- Dirk Nowitzki, Wesley Matthews, Chandler Parsons, Deron Williams and Zaza Pachulia.\nSerge Ibaka posted his fourth double-double of the season with 20 points and 11 rebounds for the Thunder. They are 13-1 this season at home against Western Conference opponents.\nBarea scored 18 points, Salah Mejri had 17 -- the first points of his NBA career -- and Raymond Felton added 14 to lead Dallas. Charlie Villanueva started for the Mavericks and was ejected.\nThe trouble began with 5:17 left in the second quarter when Barea appeared to throw a blind elbow toward Westbrook, which led to pushing, shoving and jawing among all 10 players on the court. No bench players came onto the court, but many coaches and security officials from both teams helped the game officials break up the scrum.\nAfter an officials' review, Barea, Westbrook and Ibaka each received a technical foul and Villanueva drew two technicals and was tossed. Barea was loudly booed every time he touched the ball the rest of the game.\nAbout four minutes later, Barea was guarding Westbrook closely on a fast-break situation and Westbrook pushed away Barea's arm while uttering an expletive. Barea was called for a personal foul while Westbrook received his second technical and was ejected for only the third time in his eight-season career.\nOklahoma City coach Billy Donovan and Durant said they didn't agree with the second technical.\n\"Barea was arguing with the ref and coach Carlisle was arguing with the ref to give (Westbrook) a tech,\" Durant said. \"You knew it was going to come after what happened early on. If that whole thing didn't happen before, that wouldn't have even been a tech. I guess they had to kind of control the game, but it was unfortunate. I'll end it there.\"\nBarea didn't see it that way. Of the first skirmish with Westbrook, he said. \"I was there and I wasn't backing down. He started pushing. I started grabbing and he grabbed me and then he threw his arms.\"\nAnd the second?\n\"Same thing. I fouled him and then he went crazy again and threw his arms all over the place and the ref walks right in front of him, so he called it that time,\" Barea said.\nDallas cut what had been a 29-point deficit to 83-69 on a 3-pointer by Barea with 10:14 left. The Thunder quickly built the lead back to 22.\nDion Waiters scored 18 points for Oklahoma City.\nTIP-INS\nMavericks: Joining Villanueva in the starting lineup were JaVale McGee, Barea, Jeremy Evans and Felton . Nowitzki needs one more appearance to tie Elvin Hayes for 15th place on the NBA's all-time games played list at 1,303. Only 17 NBA players have played in 1,300 or more games . Mejri made only his sixth NBA appearance and had attempted only one field goal in his career before going 7 of 8 on Wednesday.\nThunder: In seven January games, Thunder center Steven Adams is shooting 74.3 percent (26 of 35) from the field Oklahoma City is 3-4 on the second night of back-to-backs this season. ... Former heavyweight boxing champion Evander Holyfield attended the game ... Reigning NASCAR Xfinity Series champion Chris Buescher also attended the game and his No. 34 Sprint Cup Series car was on display on the arena concourse. ... Rookie Cameron Payne started the second half in place of Westbrook.\nUP NEXT\nMavericks: At Chicago on Friday.\nThunder: Host Minnesota on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994173.030015
}