{
  "game_id": "0021900760",
  "espn_id": "401161402",
  "date": "Feb 05, 2020",
  "matchup": "OKC vs. CLE",
  "headline": "Schroder scores 30, leads Thunder past Cavaliers 109-103",
  "body": "OKLAHOMA CITY --  Chris Paul told Dennis Schroder to take over, and his backcourt mate listened.\n\nSchroder scored 30 points to help the Oklahoma City Thunder beat the Cleveland Cavaliers 109-103 on Wednesday night.\n\nSchroder had six points in a critical 43-second span late in the game that helped the Thunder grab control. Paul, an All-Star who usually is a primary scoring option late in close games, willingly deferred.\n\n\"Chris, he handled it well because he'd seen that I was aggressive, made a couple of shots, free throws, so he was like, `Oh, you have it. Close the game,\" Schroder said. \"When Chris Paul tells you that, it keeps you engaged, you get more energy, you're getting a little hyped, and I finished it off.\"\n\nIt was Schroder's eighth straight game with at least 20 points. He was a reserve in seven of those games, including this one.\n\n\"He's really playing at a high level and he's done a really, really good job for us and he's been a great spark off the bench,\" Thunder coach Billy Donovan said.\n\nShai Gilgeous-Alexander had 23 points and Danilo Gallinari added 15 for the Thunder, who have won eight of nine.\n\nGallinari was the subject of trade speculation throughout the day. He chose to focus on the game.\n\n\"My parents told me a great thing when I was a little kid -- to not read newspapers or follow media,\" Gallinari said. \"I really don't follow any kind of stuff, especially game day.\"\n\nCollin Sexton scored 23 points and Kevin Love had 20 for the Cavaliers, who have lost 12 of 13.\n\n\"Executing,\" Love said. \"That's our next evolution, is to keep trending that way. And then I believe on the defensive end, just really getting our coverages down. We had some slip-ups tonight where we're kind of looking at each other talking about the game plan, and we just need to make sure that we lock in on that 100 percent.\"\n\nThe Thunder led 61-53 at halftime behind 15 points from Schroder and 12 from Gilgeous-Alexander and Gallinari. Oklahoma City shot 52.4% before the break.\n\nCleveland led briefly in the third quarter after an early rally, but the Thunder took an 84-81 lead into the fourth.\n\nLarry Nance Jr.'s dynamic dunk cut Oklahoma City's lead to 89-87.\n\nSchroder was whistled for a technical after he disagreed with an offensive foul call against him with 3:42 remaining and the Thunder leading 95-94. The play was reviewed and the offensive foul was reversed, but the technical still stood. Cleveland tied the game at 95 on a free throw by Love.\n\nSchroder hit two free throws with just under a minute left to put Oklahoma City up by three. After a turnover by Cleveland, Schroder hit a corner 3-pointer with 28.3 seconds remaining to push the lead to 106-100.\n\n\"It felt good,\" Schroder said. \"Everybody was standing up already, so I had to make it. It's a lot of pressure, but it felt great.\"\n\nSchroder made one of two free throws with 20.1 seconds left. A few seconds later, he forced Sexton into a turnover that sealed the game.\n\n\"I think a lot of people will look at the offensive play that he made, the 3 and all that, but that steal that he got on Collin was the play of the game,\" Paul said.\n\nTIP-INS\n\nCavaliers: F/C Tristan Thompson sat out with a sore right quadriceps. John Henson got the start and finished with 11 rebounds. ... Sexton scored 12 points in the first quarter. ... Nance grabbed 10 rebounds as a reserve.\n\nThunder: G Terrance Ferguson missed eight straight games for personal reasons and returned to practice this week. Lu Dort got the start, but Ferguson entered in the first quarter. ... Dort finished with four points. Ferguson did not score in 11 minutes.\n\nQUOTABLE\n\nPaul, on reporters asking Ferguson about coming of the bench:\n\n\"Y'all asking him about not starting tonight? That's tough. Don't do that to him, you know what I mean? Selfless guy like that who wants to win and stuff like that. So if y'all can -- and I know y'all got a job to do -- but respect him, too, to not try to put him against his teammate like that.\"\n\nFerguson had started all 36 games he had played in this season.\n\nUP NEXT\n\nCavaliers: Host the Los Angeles Clippers on Sunday.\n\nThunder: Host the Detroit Pistons on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996210.7282848
}