{
  "game_id": "401809796",
  "espn_id": "401809796",
  "date": "Nov 21, 2025",
  "matchup": "HOU vs DEN",
  "headline": "Jokic scores 34, Nuggets beat Rockets 112-109",
  "body": "HOUSTON -- — Nikola Jokic had 34 points, 10 rebounds and nine assists, and Jamal Murray added 26 points and 10 assists as the Denver Nuggets held on to beat the Houston Rockets 112-109 on Friday night.\n\n\r\n              Jokic, who scored 24 points in the second half, finished 11 of 20 from the field. Tim Hardaway Jr. had 12 points off the bench for the Nuggets, who shot 53%.\n\n\r\n              Denver improved to 2-1 in NBA Cup play with one game remaining on Nov. 28 at home against the Spurs, while the Rockets dropped to 1-2 in NBA Cup play, with one game left at the Warriors on Wednesday.\n\n\r\n              Reed Sheppard scored a career-high 27 points to lead the Rockets, who had their five-game winning streak snapped. He had 20 points in the first half on 8-for-11 shooting, including 4 of 6 on 3-pointers.\n\n\r\n              Amen Thompson added 22 points and seven rebounds, Jabari Smith Jr. had 21 points and 11 rebounds, Alperen Sengun had 14 points and Kevin Durant finished with 13 points for Houston, which shot 44%.\n\n\r\n              Trailing 92-87 with 9 minutes remaining, Denver went on a 20-9 run to take a six-point lead on two free throws by Murray with 23 seconds remaining. Houston scored 8 of the next 11 points to cut the lead to 110-109 on a 3-pointer by Smith with 5 seconds remaining. Jokic made two free throws with just under 3 seconds left, and Sengun’s halfcourt heave at the buzzer missed.\n\n\r\n              Aaron Gordon exited with a right hamstring strain less than 3 1/2 minutes into the first quarter after falling to the court while driving. Gordon, who missed the Nuggets’ last game Wednesday at the Pelicans due to injury, was slow to get up and limped to the locker room.\n\n\r\n              Up next\r\n              Nuggets: Hosts the Kings on Saturday night.\n\n\r\n              Rockets: At the Suns Monday to begin a four-game road trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042671.228141
}