{
  "game_id": "0022400030",
  "espn_id": "401703399",
  "date": "Nov 22, 2024",
  "matchup": "CHI vs. ATL",
  "headline": "LaVine, Dosunmu and White power the Bulls to a 136-122 win over the Hawks",
  "body": "CHICAGO -- — Zach LaVine scored 26 points, Ayo Dosunmu and Coby White each had 20 and the Chicago Bulls beat the Atlanta Hawks 136-122 on Friday night in an NBA Cup game.\n\n\r\n              Nikola Vucevic had 18 points and 13 rebounds for his 11th double-double and Josh Giddey scored 18 as all five Chicago starters — and two bench players — reached double figures. The Bulls shot a season-high 57% (49 of 86) from the floor\n\n\r\n              The Bulls beat Atlanta for the second time this season and improved to 1-1 in NBA Cup play. Chicago won in the in-season tournament after going 0-4 last season.\n\n\r\n              Trae Young had 25 points and 13 assists for Atlanta, while Jalen Johnson finished with 25 points and 13 rebounds. Clint Capela had 21 points and 11 rebounds as the Hawks closed out a four-game trip at 1-3.\n\n\r\n              Atlanta is 2-1 in NBA Cup play. \n\n\r\n              Takeaways\r\n              Hawks: Bogdan Bogdanovic came off the bench to score 16 points, including four 3-pointers, to give Atlanta a lift.\n\n\r\n              Bulls. Forward Patrick Williams missed a second straight game with inflammation in his left foot, and Dosunmu took his place in the starting lineup. Coach Billy Donovan didn’t have a timeline for Williams’ return. Williams missed the second half of last season with acute bone edema in the foot, then a stress reaction that required surgery.\n\n\r\n              Key Moment\r\n              Jalen Smith came of the bench to hit three straight 3-pointers early in the fourth to make it 109-90. Smith finished with 13 points.\n\n\r\n              Key Stat\r\n              Atlanta had 14 offensive rebounds to five for Chicago. That helped the Hawks generate second chances to keep it close early.\n\n\r\n              Up next\r\n              The Hawks play Dallas in Atlanta on Monday. The Bulls host Memphis on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997100.880967
}