{
  "game_id": "0021800097",
  "espn_id": "401070778",
  "date": "Oct 30, 2018",
  "matchup": "CLE vs. ATL",
  "headline": "Cavaliers end season-opening slide, beat Hawks 136-114",
  "body": "CLEVELAND --  The Cavaliers played unselfishly, aggressively and together for the first time this season.\n\nThey almost always do for Larry Drew.\n\nRodney Hood scored a season-high 26 points, Cedi Osman added 20 and Cleveland ended its six-game losing streak to start the season, beating the Atlanta Hawks 136-114 on Tuesday night in the Cavs' first game since coach Tyronn Lue was fired.\n\nCleveland came in as the NBA's only winless team, and Lue paid the price for club's slow start in its first season since LeBron James left the Cavs for the second time.\n\nBut with Drew serving as their \"acting\" coach while he tries to get the team to restructure his contract, the Cavs played a complete game -- Cleveland had seven players in double figures -- and avoided their first 0-7 start since 1995-96.\n\n\"I really didn't know what was going to happen tonight,\" Drew said. \"I just wanted these guys to try and put the first six games behind them as quickly as they could and be ready to turn the chapter with a new season. They came out and took the challenge.\"\n\nThe Cavs improved to 10-1 in the past two years under Drew, who filled in last season while Lue battled health issues.\n\nBefore the game, Drew said he was \"very disappointed\" the Cavs had not yet agreed to his request to redo his deal if he's going to lead them through what promised to be a challenging season. If Cleveland owner Dan Gilbert or GM Koby Altman needed further proof that Drew has his players' attention, they got it.\n\n\"L.D. always has had a voice,\" Hood said. \"Not as big a voice, but he's a guy who's been through the wars and he knows how to put guys in position to be successful. I think it was more about us forgetting the first six games and coming out, just playing well. Regardless of the results, let's just play well. Tonight was a good step in that.\"\n\nGeorge Hill and rookie Collin Sexton scored 17 apiece, and Tristan Thompson had 13 rebounds for Cleveland.\n\nRookie Trae Young scored 24 and Alex Len 22 for the Hawks. Young scored a season-high 35 against the Cavs on Oct. 21, wrecking their home opener.\n\nBut Atlanta made 22 turnovers and the Hawks' defense was poor in the second half when the Cavs scored 78 points.\n\n\"Tale of two halves,\" Young said. \"Started out the game, matched their effort, matched their intensity. We had a really good first half and then they made adjustments. We weren't ready to play and couldn't finish it out.\"\n\nThe Cavs played their third straight game without forward Kevin Love, who could miss several weeks with a painful left toe injury that has bothered him since the preseason opener. The five-time All-Star said doctors are still trying to decide the best course of treatment, and to this point he has not been told he'll need surgery.\n\nUntil Love's back, the Cavs will have to replace his 19 points and 13.5 rebounds per game. Someone needs to pick up the scoring slack, and Hood could be the guy.\n\nHe struggled after coming over to Cleveland at the trading deadline from Utah and never found his groove. But he had his best game for Cleveland against the Hawks, attacking the basket and knocking down all four 3-pointers.\n\n\"That's the Rodney Hood that I know,\" Drew said. \"Rodney is a passive guy by nature. That's who he is, but he is a very talented and very skilled guy and when he's aggressive like that, he's hard to defend. He can make the 3, turn the corner and get to the basket. When he gets his mid-range game, he really elevates. But I thought he really started with an aggression that carried all the way throughout the game.\"\n\nTIP-INS\n\nHawks: Atlanta made 15 3-pointers. The Hawks dropped a franchise-record 22 shots from deep on their previous visit. ... Young entered the game second among rookies in scoring average (18.3) and first in assists (7.0). ... Played back-to-back games for the first time this season.\n\nCavaliers: Sexton added eight rebounds and three assists. ... Drew said he'll consider playing Thompson and Larry Nance Jr. together. It's an experiment with a pair of big men that comes with risks. \"One of them guys is going to have to make some shots,\" Drew said. \"But I wouldn't completely rule it out.\" ... F Kyle Korver reached 11,000 career points.\n\nSMITH SITS\n\nCavs forward J.R. Smith didn't play at all, the third time he hasn't gotten on the floor. Smith sat at the end of the bench with his warmup hood pulled over his head.\n\nALL-STAR SELECTION\n\nThe Cavs will host the 2022 NBA All-Star Game, a person familiar with the selection told The Associated Press.\n\nThe league will make the announcement later this week. Cleveland submitted a bid to host an earlier event, but ongoing construction at Quicken Loans Arena made that impossible.\n\nCleveland last hosted the All-Star Game in 1997.\n\nUP NEXT\n\nHawks: Host Sacramento on Thursday.\n\nCavaliers:  Host Atlanta on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994808.5430012
}