{
  "game_id": "401810007",
  "espn_id": "401810007",
  "date": "Nov 02, 2025",
  "matchup": "TOR vs MEM",
  "headline": "RJ Barrett scores 27 as Raptors beat Grizzlies 117-104 for first back-to-back wins",
  "body": "TORONTO -- — RJ Barrett scored 27 points, Brandon Ingram added 26 and the Toronto Raptors won consecutive games for the first time this season by beating the short-handed Memphis Grizzlies 117-104 on Sunday night.\n\n\r\n              Memphis was without two-time All-Star guard Ja Morant, who was suspended one game Saturday for what the Grizzlies described as conduct detrimental to the team.\n\n\r\n              Scottie Barnes had 19 points and 12 rebounds, and rookie Collin Murray-Boyles scored 15 as the Raptors won their second straight after losing the previous four. Toronto beat Cleveland 112-101 on Friday.\n\n\r\n              Jaren Jackson Jr. led Memphis with 20 points, and Santi Aldama scored 15 but the Grizzlies lost back-to-back games for the first time this season.\n\n\r\n              Jock Landale and Vince Williams Jr. each scored 14 points for the Grizzlies, while Cedric Coward and Kentavious Caldwell-Pope both had 12.\n\n\r\n              Memphis lost 117-112 at home to the Lakers on Friday, with Morant scoring eight points in 31 minutes. He missed all seven of his shot attempts in the second half.\n\n\r\n              Toronto led 53-47 at the half Sunday, then opened the third quarter with an 8-0 run and closed the period with a 7-0 run to take a 84-71 edge to the fourth.\n\n\r\n              Barnes had eight assists and five of Toronto’s seven blocked shots.\n\n\r\n              Both teams struggled with long-distance shooting. Toronto finished 11 for 37 from 3-point range, while Memphis went 11 for 35.\n\n\r\n              The Raptors outscored the Grizzlies 25-11 in fast break points.\n\n\r\n              Toronto’s Jakob Poeltl (sore lower back) sat for the third straight game.\n\n\r\n              Up next\r\n              Grizzlies: Host Detroit on Monday night.\n\n\r\n              Raptors: Host Milwaukee on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042547.6002371
}