{
  "game_id": "0021800704",
  "espn_id": "401071377",
  "date": "Jan 22, 2019",
  "matchup": "DAL vs. LAC",
  "headline": "Smith returns as starter, Mavericks hold off Clippers 106-98",
  "body": "DALLAS --  Dennis Smith Jr. faked a pass and hit a layup in one sweeping motion a few minutes before Luka Doncic dribbled behind his back at the free-throw line and drove for a left-handed layup.\n\nThe Dallas Mavericks are back to trying to figure out how to make the two young stars fit in the same backcourt.\n\nSmith had 17 points and eight rebounds in his return after a week away from the team amid trade talk, and the Mavericks beat the Los Angeles Clippers 106-98 on Tuesday night.\n\nSmith had two of his four assists on a layup and alley-oop dunk in the fourth quarter for DeAndre Jordan, who had 13 points, 16 rebounds and four blocks in his third game against the team with which the 6-foot-11 center from Texas spent his first 10 seasons.\n\n\"I thought he was great, just really tremendous, and everything we needed: speed, attacking, shot-making, a couple of amazing assists,\" coach Rick Carlisle said of Smith. \"It has been tough for him, being away from his teammates, and he played one of his best games since he has been here.\"\n\nA 21-year-old in his second season, Smith's future and role with the Mavericks is already in doubt because of the sudden emergence of Doncic.\n\nSmith was the unquestioned starting point guard during a solid rookie season, but Doncic brings many of the same qualities, more polished because of the 19-year-old rookie sensation's experience as a young pro in Europe. The Slovenian is Dallas' leading scorer.\n\nAfter missing six games under increasingly questionable circumstances with trade talk percolating, Smith returned -- and was immediately restored as a starter by Carlisle alongside Doncic, who matched Smith with 17 points.\n\n\"It shouldn't happen,\" Doncic said of the absence of a teammate he considers a friend. \"It's bad for a team.\"\n\nSmith stayed away for three games -- the previous home game last Wednesday and a two-game road trip. Back stiffness was the official reason for the first three games Smith missed, but that changed to illness while he was absent. Carlisle said on his radio show last week that he believed Smith's representatives were advising him to stay away.\n\n\"It was tough,\" Smith said, changing the topic to the game for each question about his absence. \"But you know things happen. We got a win tonight and that's the important thing.\"\n\nPatrick Beverley scored 16 points while Avery Bradley and Lou Williams had 15 apiece for the Clippers, who lost for the sixth time in seven games coming off a win in San Antonio that ended a season-long five-game losing streak.\n\nThe Clippers missed 16 straight shots in the second half, including their last 15 of the third quarter. But they still led 88-83 in the fourth before going 4 of 16 to finish the game. They shot 36 percent overall.\n\n\"We had wide-open shots tonight. They just didn't go in,\" coach Doc Rivers said. \"So every once in a while you'll have that game.\"\n\nHarrison Barnes stopped a recent 3-point shooting slump by making three of five from long range, including one for the biggest Dallas lead at nine points with less than a minute remaining. Barnes scored 20 points in just the third win in 10 games for the Mavericks.\n\nSmith and Doncic shared the floor for the final 2:14, with Smith starting that stretch with a long pass to Jordan for the dunk. Soon after, Doncic worked methodically for a jumper for a 101-93 lead with 1:22 to go.\n\nTIP-INS\n\nClippers: Williams returned after missing two games with a hamstring issue. He was 5 of 16 from the field, including 1 of 6 from 3. ... Leading scorer Danilo Gallinari missed his second straight game with back spasms.\n\nMavericks: G Wesley Matthews made one of four from 3-point range and needs two more to become the first undrafted player with 1,500 career 3-pointers. ... Doncic had seven rebounds and six assists. ... Dirk Nowitzki, in his record 21st season with the same franchise, made two of four from long range and finished with eight points. The 40-year-old played 10 minutes, right on his season average.\n\nROUGH SHOOTING IN WIN\n\nDoncic and Smith struggled from long range, combining to go 1 of 14 with several shots that missed the rim. Doncic had his third straight rough shooting night, going 5 of 15 to put him at 14 of 46 (30 percent) over the past three games. Smith was 6 of 17.\n\nUP NEXT\n\nClippers: At Miami on Wednesday, with LA trying to avoid getting swept in two-game season series for second straight year.\n\nMavericks: Both of this season's meetings with the Pistons are in the coming week, Friday in Dallas and Jan. 31 in Detroit.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995449.471497
}