{
  "game_id": "0022000972",
  "espn_id": "401307775",
  "date": "May 02, 2021",
  "matchup": "OKC vs. PHX",
  "headline": "Booker scores 32 as Suns hold off Thunder 123-120",
  "body": "OKLAHOMA CITY -- — Devin Booker scored 32 points, and the Phoenix Suns held off the Oklahoma City Thunder 123-120 on Sunday night.\n\n\r\n                    Former Thunder guard Chris Paul had 18 points and 11 assists, and Torrey Craig added 18 points and 10 rebounds for the Suns, who shot 54%. Phoenix entered the night one-half game behind Utah for the best record in the Western Conference.\n\n\r\n                    Phoenix led 119-103 with 3:29 remaining before the Thunder closed the game on a 17-4 run. Oklahoma City was coming off a 152-95 loss to the Indiana Pacers on Saturday night, the worst home loss in NBA history.\n\n\r\n                    “It is what it is,” Paul said. “At this point in the season, you’re trying to pile up wins. It wasn’t our prettiest game, it wasn’t the prettiest finish. Them guys are probably just like us. They knew they was going to come out with a lot of pride after that game last night. We got the win and we’re going to move on.”\n\n\r\n                    Darius Bazley had 19 points and nine rebounds and Theo Maledon added 18 points for the Thunder, who have lost 20 of 22.\n\n\r\n                    “Sadly, it didn’t end up the way we wanted, but we really did a great job turning the page from last game and really competing all 48 minutes -- something we really want to put in our DNA,\" Maledon said. \"I felt like that was something that, even though we didn’t get the win, that was very positive.”\n\n\r\n                    Booker scored 16 points in the first half to help Phoenix take a 64-57 lead. Craig had 13 points on 6-for-7 shooting to help the Suns shoot 58% before the break.\n\n\r\n                    Phoenix led 98-85 after three quarters. Booker scored 14 points on 5-for-6 shooting from the field in the period.\n\n\r\n                    Paul hit a contested 3-pointer from beyond the top of the key as the shot clock expired to give the Suns a 110-94 lead with just over 7 minutes to play.\n\n\r\n                    Oklahoma City made a final surge. Isaiah Roby dunked and was fouled with just under a minute to play. He made the free throw to make it a 121-116 game. \n\n\r\n                    Booker was called for an offensive foul, giving the Thunder the ball back. Booker was called for a technical for disagreeing with the call, and Maledon made the free throw to make it 121-117. \n\n\r\n                    Oklahoma City's Lu Dort was sent to the line after apparently being fouled while shooting a 3-pointer with 16 seconds remaining. Phoenix challenged and it was successful, leading to a jump ball. Phoenix won the jump ball, and a scramble for the ball ran the clock down to six seconds before Mikal Bridges made two free throws to put the game out of reach. \n\n\r\n                    “It certainly wasn’t the way we wanted to close out the game,\" Suns coach Monty Williams said. \"It’s something we talked about at the end. All our players felt it. We could have executed a lot better down the stretch.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Beat Oklahoma City 140-103 in their previous meeting on April 2, the start of a 14-game Thunder losing streak. ... Booker scored 12 points in the first quarter. ... Opened the second quarter on a 14-1 run. ... Bridges scored 17 points.\n\n\r\n                    Thunder: Shot 57% in the first quarter to take a 33-27 lead. ... Forward Aleksej Pokusevski returned after missing Saturday’s game against Indiana with a bruised left knee, then left Sunday's game with the same injury. The rookie finished with four points and two assists in 10 minutes. ... Ty Jerome and Kenrich Williams each scored 15 points.\n\n\r\n                    GAMBLE PAYS OFF\n\n\r\n                    Williams said the moment was right for the challenge in the final minute. “Those things are hit or miss, man. I’d like to tell you that I’m that smart. ... In that last situation, I had two timeouts. We had the lead. I thought it was the right time to use it and it just worked out for us.”\n\n\r\n                    ROUGH RETURN\n\n\r\n                    Dort returned after missing Saturday's game with a strained right hip. He scored 10 points but made just 4 of 19 shots, including 2 of 9 3-pointers. He averaged 24.4 points in April while making 46% of his shots in seven games.\n\n\r\n                    QUOTABLE\n\n\r\n                    Williams on the final minutes: “I don’t think it was cruise mode, but I think it was some focus lapses, then they started hitting some threes. Any team in the NBA, if you give them confidence, they can get it going.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Visit the Cleveland Cavaliers on Tuesday.\n\n\r\n                    Thunder: Host the Sacramento Kings on Tuesday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997063.5060039
}