{
  "game_id": "401810051",
  "espn_id": "401810051",
  "date": "Nov 09, 2025",
  "matchup": "GS vs IND",
  "headline": "Jimmy Butler scores 21 points to lead Warriors past short-handed Pacers 114-83",
  "body": "SAN FRANCISCO -- — Jimmy Butler had 21 points, nine rebounds and seven assists, Quinten Post contributed 14 points and seven rebounds, and the Golden State Warriors beat the short-handed Indiana Pacers 114-83 on Sunday night.\n\n\r\n              Stephen Curry missed his third straight game with a bad cold and had been listed as questionable with an illness. He was set to go through a workout Sunday and again Monday, then travel with the team in hopes he would return Tuesday at Oklahoma City.\n\n\r\n              Al Horford added 12 points and four rebounds off the bench and Golden State used a 13-0 spurt spanning the third and fourth quarters and 21-7 run to pull away down the stretch.\n\n\r\n              Andrew Nembhard scored 14 points and dished out four of his nine assists in the second quarter for Indiana. \n\n\r\n              Indiana rested power forward Pascal Siakam for the second game of a tough road back-to-back and also missed forward Aaron Nesmith after he bruised his right forearm going for a rebound in a 117-100 defeat Saturday at Denver. Nesmith scored a career-best 31 points on 10-for-19 shooting in the earlier matchup with the Warriors.\n\n\r\n              The Warriors improved to 5-0 at home, where they had lost the last six to the Pacers — the only remaining team yet to lose in the team's seventh-year Chase Center. Golden State last beat Indiana at home on March 21, 2019, at Oracle Arena.\n\n\r\n              Indiana had won four straight matchups in the series overall, including 114-109 at home on Nov. 1.\n\n\r\n              Isaiah Jackson had a foul upgraded to a Flagrant 1 against Brandin Podziemski midway through the second and Indiana (1-9) lost its fourth in a row since the team's only victory against Golden State. Podziemski finished with 14 points and six rebounds.\n\n\r\n              The Pacers missed their initial eight 3-point attempts before Monte Morris connected at the 1:49 mark of the opening period.\n\n\r\n              Up next\r\n              Pacers: Continue a four-game trip at Utah on Tuesday night.\n\n\r\n              Warriors: Visit the Thunder on Tuesday to begin a six-game trip that matches the team's longest of the season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042593.5273678
}