{
  "game_id": "0022000022",
  "espn_id": "401267182",
  "date": "Dec 26, 2020",
  "matchup": "CHA vs. OKC",
  "headline": "Gilgeous-Alexander jumper lifts Thunder past Hornets 109-107",
  "body": "CHARLOTTE, N.C. -- — After watching his team surrender a 13-point lead in the final two minutes, Shai Gilgeous-Alexander said he needed to clear his head.\n\n\r\n                    He did, and then he went to work.\n\n\r\n                    Gilgeous-Alexander knocked down a tiebreaking jumper with 1.4 seconds left and finished with 24 points, helping the Oklahoma City Thunder hold off a furious rally by the Charlotte Hornets to win their season opener 109-107 Saturday night.\n\n\r\n                    Taking the last shot is a role the third-year player said he's become comfortable with.\n\n\r\n                    “The greats do it,” he said. “It’s a role I'm blessed to have. But I work extremely hard and I want to take full advantage of it.”\n\n\r\n                    The Thunder led 102-89 with 1:50 to go, but Miles Bridges spurred Charlotte with 11 of his 14 points in the final 1:06 — including a trio of 3s in the last 25 seconds. His final 3 tied it at 107 with 10.3 seconds left. \n\n\r\n                    Gilgeous-Alexander then took the inbound pass, brought the ball up the floor and pulled up from 23 feet to drain a contested jumper over Caleb Martin from the top of the key.\n\n\r\n                    “He understood how much time he had and got to his spot,\" said Mark Daigneault, who won in his debut as Oklahoma City's coach.\n\n\r\n                    George Hill was 8 of 9 from the field and finished with 21 points, and Darius Bazley and Luguentz Dort each had 15 points for the Thunder after their first scheduled game against the Rockets was postponed earlier in the week.\n\n\r\n                    “When coach drew it up, he told Shai to go at six, I was like, he’s hitting the shot,” Bazley said.\n\n\r\n                    Hill said he liked what he saw from the new-look Thunder.\n\n\r\n                    “This season is a going to have a lot of ups and downs, some wins and losses, but the more we can stay together and be resilient, we will be fine,\" Hill said.\n\n\r\n                    Terry Rozier, who had 42 points on 10 3-pointers in Charlotte’s loss to the Cavaliers to open the season, had 19 points to lead the Hornets, but his desperation heave at the buzzer fell short.\n\n\r\n                    P.J. Washington added 18 points and rookie LaMelo Ball scored 13 points off the bench.\n\n\r\n                    Ball was held scoreless in the NBA regular season debut against the Cavaliers but scored nine in the first quarter Saturday, including two 3s. He later got a floater to fall from 13 feet and added a dunk off a steal, finishing the first half 5 of 6 from the floor for 13 points to give the Hornets a 59-57 lead at the break. However, he did not score in the second half, missing all four shots from the field.\n\n\r\n                    “I thought LaMelo played extremely well tonight,” Hornets coach James Borrego said. “There may be more minutes for him. Tonight was a good step for him.”\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Outrebound the Hornets 54-47 behind 13 boards from Al Horford. \n\n\r\n                    Hornets: Charlotte shot 6 of 31 from the field in the third quarter after shooting 50% in the first half. ... Bismack Biyombo started at center for Cody Zeller, who is out at least four weeks after breaking a bone in his left hand in the team's season-opening loss at Cleveland.\n\n\r\n                    CLOSING THE DEAL\n\n\r\n                    The Thunder struggled with putting the game away in the final 2 minutes, missing free throws and turning the ball over. Daigneault said that will be an area the team must improve upon.\n\n\r\n                    “We could have handled it better,” Daigneault said. “Hopefully we learn from it and handle it better next time.”\n\n\r\n                    As for his own performance in his coaching debut, Daigneault said he gave himself a “C-plus.\"\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Will host the Jazz on Monday night in their home opener. \n\n\r\n                    Hornets: Will be tested as they host Kevin Durant and the Nets in a back-to-back at home Sunday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997055.424903
}