{
  "game_id": "0021900644",
  "espn_id": "401161286",
  "date": "Jan 20, 2020",
  "matchup": "SAC @ MIA",
  "headline": "Heat rally late, top Kings 118-113 in overtime",
  "body": "MIAMI --  The Miami Heat never led in the fourth quarter.\n\nAnd they won anyway.\n\nKendrick Nunn scored 25 points, James Johnson added 22 on 9-for-11 shooting and the Heat improved their NBA-best home record to 19-1 by beating the Sacramento Kings 118-113 in overtime on Monday.\n\nGoran Dragic scored 18 and Bam Adebayo finished with 16 points and 11 rebounds for the Heat, who also lead the NBA with a 7-0 overtime record this season. The Heat have already matched last season's home win total -- Miami was 19-22 at home a season ago.\n\n\"I keep saying it,\" Adebayo said. \"We've got a lot of grit. We've got a lot of determination. That's the kind of guys who you want in your locker room.\"\n\nDragic found Adebayo with a lob that set up a basket with .8 seconds left in regulation, and Adebayo -- a strong All-Star candidate -- scored the first four points of overtime for Miami.\n\nThe Kings scored the next six to reclaim the lead, before Miami ended the game on a 7-0 run. Sacramento still had a chance to tie the game after a turnover with about a minute left, but Johnson blocked Bogdan Bogdanovic's 3-point try and Nunn sealed the win with a pair of free throws.\n\n\"This was one of the more important wins of the season,\" Heat coach Erik Spoelstra said.\n\nNemanja Bjelica scored 22 points for Sacramento, which is 2-16 in its last 18 trips to Miami. Buddy Hield had 20 points for the Kings, and Marvin Bagley III finished with 15 points and 15 rebounds.\n\n\"An unfortunate loss,\" said Kings coach Luke Walton, whose team didn't trail in the final 13:19 of regulation. \"Give Miami credit. They hit a lot of big shots down the stretch and into overtime.\"\n\nThe Kings were 13 of 51 from 3-point range, the most attempts from beyond the arc in franchise history. Miami was without Jimmy Butler, who missed the game with right hip soreness.\n\nThe Heat played zone defense -- a staple of their game this season -- for long stretches. Sacramento accepted the challenge, taking 25 3-pointers in the first half, 21 in the second half and five in overtime.\n\nThe 5 p.m. local start meant the Kings didn't have time for a traditional on-court shootaround. Instead, they put tape down on the floor of a ballroom in their hotel and discussed concepts there.\n\n\"We talked about how much they like to play zone and that we have to make sure that we don't let that zone get us stagnant,\" Walton said.\n\nThey went 1 for 13 on 3s in the third quarter and emerged with the lead anyway. A two-point lead at the half was still a two-point lead for Sacramento going into the fourth, 78-76.\n\nSacramento led by as many as eight in the fourth, but couldn't finish.\n\n\"This is like the sixth game we had like this, up by two or up by three and lost the game,\" Hield said. \"It's depressing but it's basketball. You have to figure out ways to win.\"\n\nTIP-INS\n\nKings: This was the second game of a season-long five game road trip for the Kings. ... There was a group of Heat fans from the Bahamas seated behind the Sacramento bench, a tribute to Hield -- a native of the island nation. Also in the crowd: Hield's mom. \"I'm blessed,\" Hield said.\n\nHeat: Miami had its run of seven consecutive winning first quarters end, trailing 24-21 after 12 minutes Monday. The last time the Heat had a longer streak of after-one-quarter leads was an 11-game run from Jan. 31 through Feb. 24, 2011. ... Derrick Jones Jr. was lost late in the third quarter after he took an inadvertent poke to both eyes from Sacramento's Cory Joseph. He said postgame that he was feeling better. ... Dragic hosted a group of players from his native Slovenia, who got a postgame arena tour.\n\nBUTLER'S HIP\n\nSpoelstra said there wasn't a specific incident that caused Butler's hip soreness and didn't sound overly concerned that it would be a lingering issue. \"I think a couple days of treatment will serve him really well,\" Spoelstra said.\n\nSHORT-HANDED KINGS\n\nSacramento is still waiting for its trade with Portland to become official, so the Kings were without Trevor Ariza, Wenyen Gabriel and Caleb Swanigan -- who are about to become Trail Blazers. Kent Bazemore and Anthony Tolliver will be joining Sacramento, likely on Tuesday.\n\nUP NEXT\n\nKings: Visit Detroit on Wednesday.\n\nHeat: Host Washington on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995891.3057332
}