{
  "game_id": "0022400020",
  "espn_id": "401703389",
  "date": "Nov 15, 2024",
  "matchup": "MIN @ SAC",
  "headline": "Edwards, Timberwolves beat Kings 130-126 in OT despite franchise-record 60 points from De'Aaron Fox",
  "body": "SACRAMENTO, Calif. -- — Anthony Edwards had 36 points, and the Minnesota Timberwolves beat the short-handed Sacramento Kings 130-126 in overtime on Friday night despite a franchise-record 60 points from De’Aaron Fox.\n\n\r\n              Fox had 26 points in the fourth quarter and overtime, but it wasn’t enough for a Kings team without DeMar DeRozan (lower back tightness) and Malik Monk (ankle). Julius Randle had the go-ahead basket on a driving layup with under a minute to play to put the Timberwolves ahead by two.\n\n\r\n              Minnesota made its first four shots in the extra session – including five straight by Edwards after Fox opened the scoring with a 3-pointer.\n\n\r\n              Randle added 26 points, and Naz Reid had 16 for Minnesota. Domantas Sabonis added 23 points and 12 rebounds for Sacramento.\n\n\r\n              The Timberwolves gave up a 20-point lead in the second half after the Kings began the fourth on a 14-0 run. Fox had 21 points in the first half, but Minnesota led 62-54 after jumping out to a double-digit advantage in the first quarter.\n\n\r\n              Takeaways\r\n              Timberwolves: Seven Minnesota players and all five starters finished in double figures, as the Timberwolves showed resilience after Sacramento’s fourth-quarter comeback. \n\n\r\n              Kings: Sacramento couldn’t overcome the loss of DeRozan, its second-leading scorer, despite an all-time game from Fox. \n\n\r\n              Key moment\r\n              Fox missed a floater that would have tied the game after Randle’s layup. Edwards grabbed the rebound and then made a deep 2-pointer on the other end to push the lead to four with 14.1 seconds to play.\n\n\r\n              Key stat\r\n              Fox recorded the first 50-point game for the Kings since 2016, when DeMarcus Cousins scored 56. Jack Twyman had 59 points for the Cincinnati Royals in 1960, which was the prior franchise record.\n\n\r\n              Up next\r\n              Timberwolves host the Suns on Sunday, and the Kings host the Jazz on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998107.1646888
}