{
  "game_id": "0021900301",
  "espn_id": "401160943",
  "date": "Dec 03, 2019",
  "matchup": "MIA @ TOR",
  "headline": "Jimmy Butler takes over in OT, posts triple-double as Heat win",
  "body": "TORONTO -- Jimmy Butler delivered a triple-double to beat Toronto, then turned his focus to Miami's next opponent with an unbeaten home record.\nButler had 22 points, 13 rebounds and 12 assists, Duncan Robinson scored 22 points and the Heat spoiled Kyle Lowry's return to Toronto's lineup by beating the Raptors 121-110 in overtime Tuesday.\n\"I'm not going to say that this one is more special than any other one,'' Butler said of Miami's third consecutive victory and second straight on the road. \"Just two good teams going at it. We were fortunate enough to do our job.''\nButler scored eight consecutive points in 55 seconds to begin the extra session as the Heat recovered after blowing a seven-point lead in the final two minutes of the fourth quarter.\n\"When it's closing time, he just makes whatever play is needed,'' Heat coach Erik Spoelstra said.\nMiami also won at Milwaukee on Oct. 26, a 131-126 overtime victory. The Heat are the only road team to beat the Bucks this season.\nMiami closes its three-game road trip at Boston on Wednesday. The Celtics (7-0) are one of three NBA teams yet to lose at home this season. Philadelphia (10-0) and Miami (8-0) are the others.\n\"We talked about it: We've got one more to win,'' Butler said. \"We'd better get over this one fairly quickly.''\nButler became the 10th player in Heat history to post a triple-double, achieving the feat for the fifth time.\n\"He was doing even more stuff that you won't see in the box score: encouraging guys, talking, being in gaps defensively,\" Miami's Justise Winslow said. \"He was fantastic for us.''\nBam Adebayo scored 18 points, Winslow had 17 and Kelly Olynyk 16 as the Heat snapped the Raptors' season-high winning streak at seven games, and became the first visitors to win north of the border this season.\n\"Those guys are exhausted in there,'' Spoelstra said, gesturing to his team's locker room. \"They earned their ice.''\nPascal Siakam had 15 points and 12 rebounds, Norman Powell scored 23 points and Fred VanVleet had 19 for Toronto, which had won a franchise-record nine straight home games to begin the season.\n\"We didn't have the greatest energy, I didn't think, especially in the first half,'' Raptors coach Nick Nurse said.\nToronto missed all nine of its field goal attempts in overtime, eight of them from 3-point range.\nLowry returned after missing 11 games because of a fractured left thumb. The five-time All-Star missed his first 11 shot attempts, including seven from 3-point range, before making a layup with 8 minutes, 40 seconds to go in the fourth. He finished 2-for-18, including 0-for-11 from 3-point range. Lowry had 12 points and 11 assists in 41 minutes.\n\"That was terrible,\" Lowry said, blaming his poor performance on rust. \"I'm sure I'll be better next game. It's nothing to be concerned or worried about.''\nToronto trailed 107-100 after Winslow's layup with 1:59 to go in the fourth. Powell hit a 3, Lowry made a pair at the line and, after a missed jumper by Winslow, Powell connected from the corner to give the Raptors a 108-107 lead, their first of the final quarter.\nButler tied it by splitting a pair of free throws and Siakam saw his shot blocked at the other end, giving the Heat the ball with just under 20 seconds remaining. Miami advanced the ball before Spoelstra called timeout with 9.3 seconds to go. Butler pulled up for a 3 over Powell, but his shot bounced off the rim, sending it to overtime.\nTIP-INS\nHeat: Miami was without guard Goran Dragic (strained right groin). Dragic, who was injured in the first half of Sunday's win at Brooklyn, is also expected to miss Wednesday's game in Boston. ... G Dion Waiters was in uniform for the first time this season. Waiters was suspended for 11 of the Heat's first 18 games, costing him about $920,000, pending appeals.\nRaptors: Toronto swept the season series against Miami last season, just the second time it has done so. ... Lowry missed all eight of his field goal attempts in the first half, including five shots from 3-point range. His only points came on a pair of free throws with 3:40 left in the second. ... The Raptors went 9-2 without Lowry.\nBOARD BATTLE\nMiami outrebounded Toronto 55-48. The Heat are 13-0 when they outrebound their opponent.\nUP NEXT\nHeat: At Boston on Wednesday.\nRaptors: Host Houston on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764995541.605356
}