{
  "game_id": "0021300813",
  "espn_id": "400489686",
  "date": "Feb 20, 2014",
  "matchup": "OKC vs. MIA",
  "headline": "LeBron James leads win over Thunder with 33, leaves bloodied",
  "body": "OKLAHOMA CITY -- LeBron James sat silently in front of his locker with a towel draped over his head, not wanting to reveal the effects of a hit to his nose that prematurely ended his night.\nHis Miami Heat teammates finished off a 103-81 win over the Oklahoma City Thunder without him on Thursday night.\nMiami's star forward went down with 5:50 remaining after he was struck by Oklahoma City's Serge Ibaka on a drive to the basket. James finished the dunk, but he was bloodied and he left the court with a towel over his face.\n\n\"I'm like everybody else, you're used to seeing him like Superman, get up and sprint back even after tough hits and tough falls,\" Heat coach Erik Spoelstra said. \"So we knew something was up.\"\nJames landed the hardest blow long before that. He scored 16 of his 33 points in the first quarter to put the Thunder in a bind, and the Heat rolled to a lopsided win.\nJames passed a concussion test, but some damage was done.\n\"He has a swollen nose right now. It's bleeding,\" Spoelstra said. \"We'll evaluate him when we get back to Miami, but it's sore.\"\nThe Thunder were the ones shaken up after James made his first five shots and scored 12 points in the first 4:11.\n\"It was flawless,\" Wade said. \"He was aggressive defensively, he was able to play passing lanes and be who he is. That was a great start on the road by our leader. It was something that we needed.\"\nWade had 24 points and 10 assists, and Chris Bosh added 24 points for Miami, which won its fourth straight and avenged an earlier loss to Oklahoma City. It was a good step for the Heat, who are trying to catch Indiana for the top record in the Eastern Conference.\n\n\"You can see the resolve,\" Wade said. \"You can see the chemistry. You can see a team that's gearing up for the second half of the season.\"\nKevin Durant scored 28 points for Oklahoma City, which lost at home for the first time since Jan. 5.\nDurant has been the popular favorite to win the NBA MVP award, but Wade said James is still in the hunt.\n\"It's not decided,\" Wade said. \"I don't think that was a message. That was LeBron James being LeBron James. He loves the matchup, just like KD loves the matchup. The MVP is long, long from over.\"\nRussell Westbrook, who had missed the previous 27 games after having surgery on his right knee, started and scored 16 points in 24 minutes. He made 4 of 12 shots.\n\"I'm just going to keep getting him better, and as the season goes along, as he gets more comfortable in game shape, we're going to see a better Russell every night,\" Thunder coach Scott Brooks said.\nThe Thunder overcame an early 18-point deficit on Jan. 29 to roll past the Heat 112-95 in Miami, and the home fans hoped for a regular-season sweep against the team that beat Oklahoma City in the 2012 finals.\nInstead, they saw a rare inefficient game from the Thunder.\n\n\"When you don't have good rhythm, normally the three-ball can get you back into the game,\" Brooks said. \"We didn't have shot makers tonight. We've had them for a while now. We didn't have them tonight.\"\nThe crowd erupted as Westbrook was introduced as a starter. His first minute of action was furious and had the fans on their feet. His first basket was a two-handed, fast-break dunk 37 seconds into the game, and he got a steal 17 seconds later.\nThe excitement quickly evaporated. James scored 10 points in the first 3:11 and Miami made 13 of its first 14 shots to take a 28-13 lead. The Heat were ahead 34-17 at the end of the first quarter.\nThey extended their lead to 19 points in the second quarter before the Thunder rallied behind Westbrook. He scored nine points in the final 1:55 of the first half, including a dunk in the closing seconds, to trim Miami's lead to 54-47 at the break.\nMiami took control early in the third quarter. James scored six points during a 10-0 run that helped the Heat take a 64-49 lead. The advantage grew to 75-53 on a 3-pointer by James with just over five minutes left in the frame.\nDurant scored seven points in the final 2:46 of the quarter to trim Miami's edge to 76-65 heading into the fourth.\nMiami reasserted itself in the opening minutes of the final period. Bosh hit a 3-pointer to bump the Heat's lead to 19 with just under 10 minutes to go.\nThe Heat won for the fifth time during their six-game road trip. Miami beat the Los Angeles Clippers, Phoenix, Golden State and Dallas before closing with a win against the team with the league's best record.\n\"It's good to finish it this way,\" Spoelstra said.\nGame notes\nThunder G Reggie Jackson, who started while Westbrook was out, entered the game in the first quarter. ... Durant scored just two points on 1-for-5 shooting in the first quarter. ... Miami shot 76 percent in the first quarter but made just 7 of 17 shots in the second and was outscored 30-20. ... Oklahoma City's Kendrick Perkins left the game in the third quarter with a left groin strain and didn't return.",
  "source": "espn_api",
  "crawled_at": 1764992854.8903081
}