{
  "game_id": "0022000780",
  "espn_id": "401307572",
  "date": "Apr 07, 2021",
  "matchup": "MEM @ ATL",
  "headline": "Allen has 30 to help streaking Grizzlies beat Hawks, 131-113",
  "body": "ATLANTA -- — Grayson Allen scored 17 of his season-high 30 points in a dominant third quarter, leading the Memphis Grizzlies to a 131-113 win over the short-handed Atlanta Hawks on Wednesday night.\n\n\r\n                    Ja Morant added 14 of his 19 points in the Grizzlies' decisive third quarter. Memphis outscored Atlanta 43-23 in the period to break open a close game.\n\n\r\n                    “Our guys just took it to another level,” Memphis coach Taylor Jenkins said. “I know those guys weren’t satisfied. They weren’t pleased with how we started the game.”\n\n\r\n                    Allen's big game came one night after Dillon Brooks also set a season high with 28 points in a 124-112 win at Miami.\n\n\r\n                    “A lot of different guys can just give us a spark of offense in any given moment,” Allen said.\n\n\r\n                    Jonas Valanciunas had 19 points and 11 rebounds in the Grizzlies' fourth consecutive win. Atlanta's four-game winning streak ended. \n\n\r\n                    Bogdan Bogdanovic led Atlanta with 24 points. Trae Young had 14 points and 11 assists.\n\n\r\n                    With Clint Capela and Danilo Gallinari added to Atlanta's already lengthy injury list that also includes De'Andre Hunter and John Collins, the Hawks were without four of their top five scorers for the season. Only Young remained from that top-five list.\n\n\r\n                    Rookie center Onyeka Okongwu, who made his second start, and forward Solomon Hill had the difficult assignment of leading Atlanta's inside defense against Valanciunas. Okongwu set career highs with 13 points and 11 rebounds.\n\n\r\n                    One night after finishing with 10 points and 10 assists in the win at Miami, Morant was scoreless before his layup with 1:29 remaining in the first half. Morant was fouled but missed the free throw.\n\n\r\n                    Morant turned up the offense in the third quarter and helped the Grizzlies pull away. Memphis led only 67-64 at halftime before opening the quarter with a 29-11 run, stretching the lead to 96-75. Morant had seven of the Grizzlies' first 11 points of the period.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: PG De’Anthony Melton (sore left leg) and F Brandon Clarke (sore left calf) were held out for the second consecutive game. F Justise Winslow (sore right quadriceps) has missed six consecutive games. ... Morant wasn't on the pregame injury report after experiencing tightness in his back in the fourth quarter on Tuesday night. ... Memphis took its fifth consecutive win by double digits.\n\n\r\n                    Hawks: The Hawks' seven-game home winning streak ended. Five wins in the streak came against Western Conference teams. ... After making 20 of 31 3s against New Orleans, the Hawks made only 10 of 28, including four of eight by Bogdanovic.\n\n\r\n                    CONFIDENCE BOOST\n\n\r\n                    Morant said the winning streak “gives us a lot of confidence.”\n\n\r\n                    “Not saying we were lacking that before,” Morant said. “I feel it’s just showing us what we’re capable of.” \n\n\r\n                    HAWKS HURTING\n\n\r\n                    Interim coach Nate McMillan said Capela, the NBA’s rebounding leader, was held out with a recurrence of left Achilles soreness and Gallinari “tweaked” his left ankle in Tuesday night’s 123-107 win over New Orleans. McMillan said Gallinari’s ankle is “pretty sore” but he doesn’t expect either injury to be a long-term concern.\n\n\r\n                    Collins (sprained left ankle) missed his fifth consecutive game. Hunter was averaging 16 points before persistent right knee soreness forced him to miss more than half the season.\n\n\r\n                    PLAYOFF PREVIEW\n\n\r\n                    The Hawks led 25-11 but couldn’t maintain the pace.\n\n\r\n                    McMillan said the Grizzlies gave the Hawks, who began the night fourth in the Eastern Conference, a preview of the physical style they can expect in the playoffs.\n\n\r\n                    “They were scraping, they were physical,” McMillan said of the Grizzlies. “That’s playoff basketball. That is what we’re going to see. That is coming.”\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Complete four-game road trip at New York on Friday night.\n\n\r\n                    Hawks: Complete four-game homestand against Chicago on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996939.2847118
}