{
  "game_id": "0022200566",
  "espn_id": "401468721",
  "date": "Jan 04, 2023",
  "matchup": "ORL vs. OKC",
  "headline": "Paolo Banchero, Magic turn back Thunder 126-115",
  "body": "ORLANDO, Fla. -- — Paolo Banchero had 25 points, eight rebounds and seven assists, and the Orlando Magic beat the Oklahoma City Thunder 126-115 on Wednesday night.\n\n\r\n              Orlando, playing without four suspended players, broke a three-game losing streak.\n\n\r\n              Gary Harris and Terrence Ross each scored 18 points for the Magic. Wendell Carter Jr. added 13 points and 13 rebounds in his first start since Nov. 18.\n\n\r\n              Shai Gilgeous-Alexander, back in the lineup after missing Tuesday’s 150-117 win at Boston due to a non-COVID-19 illness, scored 33 points for the Thunder.\n\n\r\n              In setting their franchise scoring record Tuesday night, the Thunder scored 70 points in the paint. The Magic held them to 30.\n\n\r\n              “That’s our calling card as a team,” Banchero said. “If we’re playing good defense, we’re usually playing good offense. Tonight keeping them out of the paint was the biggest thing we had to do. They hit some 3s, but at the end of the day they kill teams in the paint. That was our main focus and we did a good job.”\n\n\r\n              Banchero scored the first five points in a 10-0 run that lifted Orlando's lead into double figures midway through the second quarter. Caleb Houston hit a couple of 3-pointers late in the period and scored on a putback with two seconds left, leaving the Magic with a 70-53 halftime lead.\n\n\r\n              “There was definitely a conscious effort on their part to attack and protect the paint. They did in the first half and they built a 17-point cushion,” Oklahoma City coach Mark Daigneault said. “We tried to fight back into the game in the second half but it was a hard deficit to overcome, a small margin for error.”\n\n\r\n              Three free throws by Harris stretched the lead to 80-58 with 8:11 left in the third.\n\n\r\n              Gilgeous-Alexander and Isaiah Joe scored the final nine points of the third to get the Thunder back within seven at 95-88. But the rally fizzled from there.\n\n\r\n              “Consistency is something we’ve got to get better at,” said Josh Giddey, who scored 16 for the Thunder. “Last night we beat one of the better teams in the league comfortably, and then we come in here and lose by 15.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: C Jaylin Williams left with a left ankle sprain early in the second half. ... After shooting 59.5% on Tuesday night, the Thunder shot 40.9% against Orlando. ... Gilgeous-Alexander went 17 for 18 at the free-throw line.\n\n\r\n              Magic: G Franz Wagner, G Kevon Harris and F Admiral Schofield were sidelined by one-game suspensions, and C Mo Wagner sat out the second game of his two-game suspension for their involvement in an altercation in a game at Detroit on Dec. 29. ... F Bol Bol missed his first game of the season after entering the NBA's health and safety protocol. ... The Magic had a 49-32 rebounding edge.\n\n\r\n              PASSING IT ON\n\n\r\n              Magic coach Jamal Mosley appreciated Banchero's seven assists.\n\n\r\n              “The great part about him is his ability to trust his teammates to find the open man, to want to make the right play,” Mosley said. “Anytime he's out there he's looking to make and create for his team, and make winning plays.”\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Play at home against Washington on Friday night.\n\n\r\n              Magic: Play at home against Memphis on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994634.8498402
}