{
  "game_id": "0021601086",
  "espn_id": "400900481",
  "date": "Mar 25, 2017",
  "matchup": "POR vs. MIN",
  "headline": "McCullum has 32, Blazers beat Timberwolves 112-100",
  "body": "PORTLAND, Ore. --  CJ McCollum seems to have a knack for playing well against the Minnesota Timberwolves.\n\nMcCollum had 32 points and the Portland Trail Blazers continued their push for the playoffs with a 112-100 victory on Saturday night.\n\nIt was his second strong performance against the team. On New Year's Day, he had a career-high 43 points in a 95-89 victory in Minneapolis.\n\nIn fact, he's had four straight games with 20 or more points against the Timberwolves.\n\n\"I just try to take advantage of some of the opportunities I've had against them,\" McCollum said. \"I think over the course of my career I've played well against the teams that didn't draft me.\"\n\nLillard added 21 points for the Blazers, who have won 10 of their last 13 games. Portland has seven of its last 10 games at home.\n\nThe Blazers pulled within a game of the Denver Nuggets for the eighth and final playoff spot in the Western Conference.\n\nAndrew Wiggins had 20 points for Minnesota, which lost its sixth consecutive game overall and seventh straight on the road. The Timberwolves, who trailed by as many as 24 points in the second half, are six games behind Portland in the West.\n\nBoth teams sat most of their starters in the final minutes.\n\n\"We wanted to win in the third quarter,\" Blazers coach Terry Stotts said. \"It's been a long season and we've had situations like that before, but I thought this was one of our better games as far as building the lead, maintaining the lead, making good decisions and being able to rest everybody, keeping everybody under 30 minutes.\"\n\nIt was the first of three games the Blazers will play against the Timberwolves over the next two weeks. The Blazers will play at Minnesota on April 3, a game that was originally scheduled for March 6 but was postponed because of condensation on the court at the Target Center. It was caused by the ice under the court for a hockey tournament and an ice show.\n\nThe teams will return to Portland for another game on April 6.\n\nPortland was coming off a 110-95 victory over the Knicks. The Blazers turn around and visit the Lakers on Sunday night.\n\nPortland built a 23-15 lead in the first quarter and stretched it to 60-46 at the break. McCollum led all scorers in the first half with 21 points.\n\nJusuf Nurkic's layup off a pass from Lillard stretched Portland's lead to 69-51 in the third quarter. Lillard's 3-pointer extended it to 94-72 before the quarter was over and Minnesota was never able to mount much of a rally.\n\nFollowing the game, Timberwolves coach Tom Thibodeau was asked if he sensed his team was fatigued.\n\n\"Every team plays the same amount of games, they go through the same things you're going through,\" he said. \"You get into stuff together, you get out of stuff together and you have to be mentally tough. There are games that we've let get away that we should've won,\" he said. \"That's part of it. Learn from it and get ready for the next one.\"\n\nMinnesota was coming off a 130-119 overtime loss to the Lakers in Los Angeles the night before.\n\nTIP INS\n\nTimberwolves: For the record, McCollum was the 10th overall pick by the Blazers in the 2013 NBA Draft. Minnesota had the ninth pick and went with Trey Burke. ... It was Wiggins' sixth straight game with 20 or more points.\n\nTrail Blazers: One of the loudest cheers of the night came when the final seconds of Oregon's Elite Eight victory over Kansas was played on the video scoreboard. ... Allen Crabbe has at least one 3-pointer in 14 straight games.\n\nYOU TALKIN' ABOUT PRACTICE\n\nAll of the Blazers recently had a practice that was devoted to shooting. It looks to have paid off, because Portland shot 62.5 percent for the game.\n\n\"It was one of those coach Terry specials where we do a lot of different shooting drills, midrange, some 3s, just different drills where were going for a certain amount of points, just trying to get our reps. He does a great job of mixing up the practice schedules,\" McCollum said.\n\nUP NEXT\n\nTimberwolves: Minnesota plays at Indiana on Tuesday.\n\nTrail Blazers: Portland visits the Lakers at the Staples Center on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764995644.512736
}