{
  "game_id": "0022200834",
  "espn_id": "401468989",
  "date": "Feb 09, 2023",
  "matchup": "LAL vs. MIL",
  "headline": "Bucks win 9th straight, hold off LeBron-less Lakers 115-106",
  "body": "LOS ANGELES -- — Giannis Antetokounmpo had 38 points and 10 rebounds, and the Milwaukee Bucks rallied in the second half for their ninth consecutive victory, 115-106 over the Los Angeles Lakers without LeBron James on Thursday night.\n\n\r\n              James sat out to rest his sore left ankle and foot two nights after he passed Kareem Abdul-Jabbar to become the NBA’s career scoring leader. The Bucks still fell behind by 11 in a tepid first half and never pulled away from an opponent with only nine players in uniform, but Antetokounmpo racked up 23 points in the second half.\n\n\r\n              Khris Middleton scored 22 points and Jrue Holiday added 18 for the Bucks, who matched their longest winning streak since their 9-0 start to this season. Milwaukee is primed for the stretch run to the postseason after adding veteran Jae Crowder to its talented core at the trade deadline.\n\n\r\n              “Our offense has been better for this stretch,” coach Mike Budenholzer said. “Tonight we did not shoot it well, but I think generally speaking, we've been shooting the ball better. I think it's been our unselfishness, the way the ball has moved, the pop that we're playing with. Getting Khris healthy makes a big difference, so it's a little bit of everything. It's hard to keep a stretch like this going, but we want to keep pushing.”\n\n\r\n              Dennis Schröder had 25 points and 12 assists in a standout performance at point guard for the Lakers, who had only four reserves after their flurry of trades in the past two days.\n\n\r\n              Los Angeles shipped out Russell Westbrook, Patrick Beverley, Thomas Bryant, Juan Toscano-Anderson and Damian Jones while adding D’Angelo Russell, Malik Beasley, Jarred Vanderbilt, Mo Bamba and Davon Reed.\n\n\r\n              Russell, Vanderbilt and Beasley sat on the Lakers’ bench to watch this game with their new teammates.\n\n\r\n              “We’ve just got to put everything together,\" said Anthony Davis, who had 23 points and 16 rebounds while battling foul trouble. \"Obviously we know what we have on paper. We’ve got to put it to the floor. We’re behind the 8-ball, so we’ve got to do it with some urgency. These guys coming in are ready to get going.”\n\n\r\n              The Lakers are 25-31 after their third straight loss, and they're in desperate need of a winning surge if they hope to avoid missing the playoffs for the second straight season.\n\n\r\n              James missed his 12th game of the season with an injury that has required constant maintenance. The Lakers honored his achievement with a pregame ceremony in which he thanked his fans and his family while describing the week as “surreal.”\n\n\r\n              Despite using their 28th starting lineup in 56 games this season, the short-handed Lakers improbably took a 58-50 halftime lead while Milwaukee missed 23 of its 28 3-point attempts.\n\n\r\n              THE REAL STORY\n\n\r\n              Davis ended a surge of internet speculation about why he was curiously sitting on the Lakers' bench instead of watching the moment James broke the scoring record Tuesday: He didn't realize LeBron was about to make history.\n\n\r\n              “We were losing to the Oklahoma City Thunder in a game that we needed, and I was (ticked) off that we were losing,” Davis said. “It's very simple. It's nothing had to do with Bron. He knows that.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Crowder is unlikely to join the team before it returns home to Milwaukee, Budenholzer said. The Bucks gave up George Hill, Serge Ibaka, Jordan Nwora and three future second-round picks to get the defense-minded, playoff-tested Crowder, who played at Marquette. “I just feel like Jae is a winner,” Budenholzer said. “His toughness, his defense, what he brings on that end of the court is special.”\n\n\r\n              Lakers: Coach Darvin Ham said James had “imaging” done on his foot, but it didn't show “anything extensive, just normal wear and tear.” ... Ham is hoping all five newcomers are available for their next game Saturday. “All those guys bring unique skill sets that we need,” Ham said.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At LA Clippers on Friday.\n\n\r\n              Lakers: At Golden State on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994119.01504
}