{
  "game_id": "0021301169",
  "espn_id": "400490042",
  "date": "Apr 09, 2014",
  "matchup": "CHI @ MIN",
  "headline": "Joakim Noah records 4th triple-double as Bulls roll past Wolves",
  "body": "MINNEAPOLIS -- D.J. Augustin's career was swirling down the drain when the Toronto Raptors waived him in December, and the former No. 9 overall pick seemed destined to join the long list of promising prospects that just never made it in the NBA.\nFour days later, the Chicago Bulls signed him in an attempt to add some scoring punch to a defense-first team. Augustin has flourished in Chicago, one of the big reasons the surprising Bulls have been able to weather Derrick Rose's injury and the trade of Luol Deng to stay in the hunt in the Eastern Conference.\n\"We needed him,\" Bulls coach Tom Thibodeau said, \"and he needed us.\"\nAugustin had another big game Wednesday night, scoring 21 points to lead Chicago to a 102-87 victory over the Minnesota Timberwolves.\nJoakim Noah added 15 points, 13 rebounds and 10 assists for his fourth triple-double, moving into a tie with Indiana's Lance Stephenson for the most in the NBA this season. Kirk Hinrich scored 16 points on 7-of-9 shooting and the Bulls hit 11 of 21 3-pointers to stay right on Toronto's heels for the third seed in the Eastern Conference.\n\"We wouldn't be in this position without D.J.,\" Noah said. \"His passing ability, his scoring ability, just the way he plays the game. ... I feel like I have really good chemistry with him and I think the rest of this team feels that way, too. We're going to need him down the stretch.\"\nKevin Love had 17 points and 10 rebounds for the Timberwolves. But he hyperextended his right elbow in the first half and only made 7 of 20 shots, including 2 of 8 3-pointers. Ricky Rubio added 15 points and six assists, but the Wolves were just 4 for 17 from long distance.\n\"I should've made a lot of those open shots that I missed,\" said Love, who also had a large bloody scratch on his chest after getting tied up with Carlos Boozer. \"Yeah it was bothering me a little bit. But that's no excuse for the poor shooting.\"\nThe Bulls entered the night with the same record as Toronto, with the tiebreaker going to the Raptors and only five games to play before the playoffs begin. The schedule certainly favors the Raptors, who beat the 76ers on Wednesday night and finish the season with two games against the Knicks and one each against the Pistons and Bucks.\nThanks to the raggedy East, the Bulls don't have it much tougher with the Pistons, Knicks and Magic coming up before the season finale at playoff-bound Charlotte. That made this game against short-handed Timberwolves a crucial one.\nThe Timberwolves played without Nikola Pekovic (right foot), Chase Budinger (right ankle), Kevin Martin (right heel), Shabazz Muhammad (right knee) and J.J. Barea (back and neck), leaving them with only 10 healthy players, and without three of their better offensive players to go at the tenacious Bulls defense.\nBut even though the Wolves have been eliminated from playoff contention, they've put up quite a fight against some of the best teams in the league down the stretch. Last week Minnesota beat Memphis at home and won at Miami. The Wolves then throttled the Spurs at Target Center on Tuesday night and shot 52.6 percent to take a 53-48 lead over the Bulls at halftime.\nEventually that Bulls defense started squeezing the Wolves and grinding the game down. The Wolves missed eight of their first 10 shots of the second half and scored only 17 points in the third quarter. They shot 33 percent and managed just 34 points in the second half.\n\"It looked like we ran out of gas in the second half,\" Wolves coach Rick Adelman said.\nOn the other end, the 3s kept falling. Mike Dunleavy, who had 15 points, hit one to give the Bulls a 65-62 lead they would never relinquish.\nAugustin hit two more in the fourth to help the Bulls pull away. Even bigger were his 14 points on 6-of-9 shooting in the first half, when the Bulls were struggling to get their offense going.\n\"I'm just getting a chance to play, period,\" Augustin said. \"Just getting an opportunity and trying to make the best of it.\"\nGame notes\nBulls F Taj Gibson finished with 13 points and five rebounds. He picked up a technical foul in the fourth quarter for gesturing angrily after not getting a foul call under the basket. ... Little-used PG Alexey Shved had nine points and a season-high five assists in 16 minutes for Minnesota. ... The Wolves host their former coach and GM Kevin McHale and the Houston Rockets on Friday night in their third home game of the week.",
  "source": "espn_api",
  "crawled_at": 1764992614.343819
}