{
  "game_id": "0021900419",
  "espn_id": "401161061",
  "date": "Dec 19, 2019",
  "matchup": "HOU @ LAC",
  "headline": "Westbrook scores 40 as Rockets rally to defeat Clippers",
  "body": "LOS ANGELES --  Russell Westbrook has had his share of big games at Staples Center in front of family and friends. The Houston Rockets All-Star guard had one of the best outings of his career Thursday night.\n\nThe Lawndale native and former UCLA standout scored 40 points and grabbed 10 rebounds as the Rockets rallied for a 122-117 victory over the Los Angeles Clippers.\n\n\"It's fun to come in here and get a big win, but the win is the main thing,\" Westbrook said.\n\nIt is the most points Westbrook has scored in 45 NBA games at Staples and his 12th with 30 or more. It is also the 44th 40-point game of his 11-year career, which ties him with Karl Malone for 22nd on the career list.\n\n\"When you give so much attention to (James) Harden you forget the other MVP that is on their team,\" Clippers coach Doc Rivers said. \"You have to respect him and play him the right way. We lost our discipline a lot on him tonight, especially in transition. Once he gets in front of you, you're not going to catch him, and that happened a lot during the second half.\"\n\nWestbrook is the first Rocket other than Harden to have a 40-point game since Kevin Martin scored 45 against Portland on Jan. 5, 2011. He is also the first Houston player besides Harden to have consecutive games with 30 or more points since Jeremy Lin in 2013.\n\nHouston rallied from a large deficit for the second straight game. It was down 16 three minutes into the third quarter before coming back to take the lead at the end of the quarter. The Rockets trailed by 25 on Monday night against San Antonio before winning by two, marking the largest comeback in franchise history.\n\nThe Rockets -- who have won two of three against the Clippers this season -- are 7-6 when trailing by double digits this season.\n\nWestbrook scored 14 points during a wild fourth quarter that saw both teams lead by at least six. The Rockets led by three at the start of the quarter before extending it to 101-89. Los Angeles went on a spurt of its own to lead 113-107 with 4:29 left. The Rockets closed on a 15-4 run to snap the Clippers' 10-game home winning streak.\n\nHarden scored nine of his 28 points during the final six minutes, including a 3-pointer with 2:57 remaining to put the Rockets up for good at 116-113.\n\n\"We kept plugging and the difference in the final 3 minutes was that James hit a few daggers and took his game to a higher level,\" Rockets coach Mike D'Antoni said. \"(PJ Tucker's) defense on (Kawhi) Leonard was unbelievable and Russ was really good out there all night.\"\n\nPaul George led the Clippers with 34 points and Leonard added 25. Los Angeles shot 56.7% from the field during the first half (27 of 48) but made just 41% (16 of 39) over the final 24 minutes.\n\nClippers guard Patrick Beverley had yet another tense night against Westbrook and was ejected with 2:52 remaining after receiving his second technical. Westbrook was also given a technical for taunting Beverley as he left the floor.\n\n\"We had a chance to knock them out and we didn't,\" Rivers said. \"In the fourth quarter our problem was more of our composure. I just thought we lost it as a team. It happens. It shouldn't, but this is a good learning lesson for us.\"\n\nThe Clippers led by 15 at halftime and extended their lead to 77-61 three minutes into the third quarter before the Rockets went on a 14-2 run. They scored nine of the last 10 points in the period to lead 90-87 going into the fourth.\n\n\"We lost that aggression in the third quarter that we started the game with and that was it,\" George said. \"Russ made some big shots when James was struggling and he was ultra aggressive.\"\n\nMILESTONE\n\nGeorge grabbed his 4,000th career rebound during the second quarter. He is one of 10 active players that has at least 12,000 points, 4,000 rebounds, 2,000 assists and 1,000 steals.\n\nTIP-INS\n\nRockets: Harden recorded 10 assists and has 4,412 with Houston, passing Calvin Murphy (4,402) for the most in franchise history.\n\nClippers: Lou Williams was ejected with 11:05 remaining in the fourth quarter after receiving two technicals for arguing a foul. It is the second ejection of Williams' 14-year career. ... This was the 4,000th regular season game in franchise history.\n\nUP NEXT\n\nRockets: Travel to Phoenix on Saturday. Houston has won 12 straight in the series.\n\nClippers: Travel to San Antonio on Saturday. Los Angeles won the first meeting 103-97 on Oct. 31.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996642.298264
}