{
  "game_id": "0022000786",
  "espn_id": "401307579",
  "date": "Apr 08, 2021",
  "matchup": "MIL @ DAL",
  "headline": "Doncic, Porzingis lead bounce-back Mavs over Bucks 116-101",
  "body": "DALLAS -- — Kristaps Porzingis got two quick shots on purpose and another by accident in the fourth quarter while putting Dallas in front of Milwaukee for good a night after appearing unhappy over not getting any looks late in a loss to lowly Houston.\n\n\r\n                    Those eight consecutive points helped put quite the bookends on arguably the worst loss of the season for the Mavericks: victories over NBA-leading Utah and the Eastern Conference-contending Bucks. \n\n\r\n                    Luka Doncic scored 27 points, Porzingis had 26 points and 17 rebounds playing on consecutive days for the first time in two months and the Mavericks beat the Bucks 116-101 on Thursday night.\n\n\r\n                    Porzingis scored 11 points in the fourth quarter, including consecutive 3-pointers right after returning to the game before Milwaukee's Pat Connaughton and Donte DiVincenzo collided on a rebound and the loose ball fell to the 7-foot-3 Latvian for an easy dunk.\n\n\r\n                    “I thought that was a big play, too,” Bucks coach Mike Budenholzer said. “It was a little bit of things happen.”\n\n\r\n                    DiVincenzo scored 22 points and Bobby Portis had 20 points and a season-high 14 rebounds for the Bucks. They dropped to 1-2 without reigning two-time MVP Giannis Antetokounmpo, out with left knee soreness. \n\n\r\n                    The big finish for Porzingis came a night after he didn't get a shot in the fourth despite an efficient scoring effort and had a cryptic post-game reply in a 102-93 loss to the Rockets that ended a season-best five-game winning streak.\n\n\r\n                    “It felt good,” said Porzingis, who was 10 of 20 and made all four attempts in the fourth, three from long range. “To just come in right away and hit that pump-fake 3. After you hit one like that, you feel in good rhythm and got a couple more.”\n\n\r\n                    Porzingis finished a rebound off his season high, and his only assist set up a corner 3-pointer by Dorian Finney-Smith for a 110-97 lead with 2:17 remaining. \n\n\r\n                    Already missing their star, the Bucks had rough shooting nights from Khris Middleton (14 points) and Jrue Holiday (13), who were a combined 12 of 43 from the field. Milwaukee shot 38% while finishing its second six-game road trip, the longest of the season, with the same 3-3 record as the first.\n\n\r\n                    “There's a little bit more of a load on both Jrue and Khris,” Budenholzer said. “I think they're learning to take that. Playing without Giannis, he can't play 48 minutes. I think there's going to be good stretches for us in learning from these experiences playing without him.”\n\n\r\n                    Dallas took control with a 13-2 run that included an overturned call when Finney-Smith blocked a dunk attempt by Middleton and immediately signaled to the bench to challenge the foul.\n\n\r\n                    The Bucks finished the third quarter on a 12-0 run for an 84-80 lead, all after Doncic checked back in with 1:45 remaining in the quarter and the Mavericks holding their biggest lead of the game to that point at eight.\n\n\r\n                    DiVincenzo capped the run with the fifth of his six 3-pointers after Tim Hardaway Jr.’s inbound pass was intercepted with 21 seconds remaining. The other three Dallas turnovers in the final 90 seconds were by Doncic, who also drew his 12th technical foul. The Slovenian star is four away from an automatic one-game suspension.\n\n\r\n                    “He's an emotional competitor,” coach Rick Carlisle said. “It all comes from the right place. He's smart. He knows where the count is. If he's going to get 16, he'll get it in a situation where it's time for a day of rest anyway.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Coach Mike Budenholzer said Antetokounmpo didn't do any pregame work and didn't indicate when the five-time All-Star would return. ... Portis' double-double was his second straight and seventh of the season. He had five last season. ... Brook Lopez rounded out all five starters scoring in double figures with 16 points. \n\n\r\n                    Mavericks: Porzingis had missed the previous two games before the back-to-back, the first for rest on the second night of a back-to-back and the second for a right wrist sprain the big man says he will be dealing with the rest of the season. Coach Rick Carlisle said the two missed games and a two-day break after the visit from the Bucks were also factors in letting Porzingis play. ... Carlisle said G Trey Burke was available, but he was listed in the boxscore as out with a left calf strain. Burke missed his third straight game. \n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Charlotte visits Friday to complete Milwaukee's back-to-back before the Bucks go back on the road for three more games. The Hornets ended Milwaukee's five-game winning streak in the series with a 126-114 victory Jan. 30.\n\n\r\n                    Mavericks: San Antonio visits Sunday with Dallas looking for the first season sweep of its Texas rival in the 41-year history of the franchise. The Mavericks won by five in San Antonio in January and by 11 in Dallas last month. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997653.2001889
}