{
  "game_id": "0021801115",
  "espn_id": "401071788",
  "date": "Mar 26, 2019",
  "matchup": "DET @ DEN",
  "headline": "Murray saves Nuggets from collapse in 95-92 win over Pistons",
  "body": "DENVER --  On a positive note, Jamal Murray came through in the clutch for the Denver Nuggets.\n\nOn a negative one, Murray needed to come through in the clutch after they nearly squandered a 27-point lead.\n\nMurray scored 33 points, including six in the final minute, and the Nuggets held off the Detroit Pistons 95-92 on Tuesday night to reach the 50-win mark.\n\nTrailing 66-39 at halftime, Detroit cut it to one on a 3-pointer by Reggie Jackson with 11.2 seconds remaining before Murray hit a pair of free throws to extend the lead. Blake Griffin's last-gasp 3-point attempt bounded away.\n\n\"It was a great win. So let's not make it a downer,\" Murray said. \"We closed the game like we do most times.\"\n\nAt 50-23, the Nuggets moved into a tie with Golden State for the top spot in the Western Conference. It's the first 50-win season for Denver since the 2012-13 squad went 57-25.\n\nComing off a 36-point loss at Indiana on Sunday, Denver coach Michael Malone challenged his team to show more energy. The Nuggets responded by jumping out to a 27-9 lead after the first quarter and extending it by the break. The Pistons outscored Denver 53-29 in the second half to make a game out of a contest that looked all but over.\n\n\"The first, we were dominating. The second, they were dominating us,\" said Nikola Jokic, who finished with 23 points and 15 rebounds for his 51st double-double this season. \"We were lucky we won the game.\"\n\nAnd the Pistons were left lamenting their first-half effort.\n\n\"It makes me even more mad that we played the way we should have played in the second half,\" Pistons coach Dwane Casey said. \"We executed well in the second half but against great teams you can't ease your way into a game.\"\n\nGriffin had 29 points and 15 rebounds for the playoff-chasing Pistons, who finished a 1-4 road trip. Andre Drummond had 13 points and 18 rebounds before fouling out.\n\n\"The second half, that was winning basketball,\" Griffin said. \"Us in the first half, I don't know who that was.\"\n\nThis was how well things were going for Denver in the first half: With a second left, Jokic hit a fadeaway at the buzzer to increase the lead to 66-39. The Nuggets would end up needing it.\n\nIt was a forgettable opening quarter for the Pistons, who missed their first 11 shots and wound up 4 of 29. The nine points were the fewest Denver has permitted in a quarter this season.\n\nIn the second half, Denver committed 10 of its 14 turnovers as the Pistons chipped away at the lead.\n\n\"Give them credit,\" Malone said. \"But we allowed them to get back in the game.\"\n\nTIP-INS\n\nPistons: Jackson had 17 points. ... The Pistons had more fast-break points (8-2). The teams each had 44 points in the paint.\n\nNuggets: G Malik Beasley missed the game for personal reasons. ... Denver leads the West with a 31-6 home mark. ... Murray was 6 of 7 from the free throw line. He's 32 of 33 in March. ... Mason Plumlee had 10 points and 11 rebounds, while Paul Millsap added 10 points and 13 rebounds. ... The Nuggets are 23-1 when holding teams under 100 points.\n\nTOUGH STRETCH\n\nOf Denver's final nine games, seven are against teams currently in playoff position. Plumlee appreciates the tough schedule.\n\n\"You want what's going to be reality in the playoffs. That's what we'll get -- a lot of good teams,\" Plumlee said. \"It's going to be a good look going into the playoffs.\"\n\nNO PRESSURE\n\nCasey is relishing the playoff chase. No pressure, either.\n\n\"Everybody had us eighth or ninth or whatever, anyway,\" Casey said. \"Again, our goal is to build. You're not going to do it fast, wave a wand. ... I know what the big picture is, what's in front of us, what we want to do for this team now that I've been here for a year.\"\n\nSECOND-HALF BLUES\n\nIt was the 15th time Denver scored 29 points or fewer in a half -- and the first time the Nuggets won one of those games, according to the team.\n\n\"On the positive, we were able to pull the game off,\" Millsap said.\n\nUP NEXT\n\nPistons: Start a two-game homestand Thursday against Orlando.\n\nNuggets: At Houston on Thursday and in Oklahoma City the next night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994651.950038
}