{
  "game_id": "0021800989",
  "espn_id": "401071662",
  "date": "Mar 09, 2019",
  "matchup": "LAL vs. BOS",
  "headline": "Kyrie's 30 propel Celtics past LeBron's Lakers, 120-107",
  "body": "LOS ANGELES --  LeBron James put up a triple-double in less than 28 minutes, and it still wasn't enough to keep his patchwork Los Angeles Lakers competitive against Kyrie Irving and the surging Boston Celtics.\n\nIrving was the biggest reason for that disappointment during a fairly predictable chapter of this storied rivalry between two franchises heading in opposite directions.\n\nIrving scored 30 points and Marcus Smart had 16 in the Celtics' 120-107 victory over the short-handed Lakers on Saturday night, propelling Boston to its third consecutive win on its California trip.\n\n\"I feel for him,\" Irving said, citing the Lakers' injuries around James. \"LeBron has always been a championship contender. Not to qualify for the playoffs is hard. I can only imagine.\"\n\nIrving didn't make the playoffs with the Cleveland Cavaliers until James returned for the 2014-15 season, so he can do more than imagine. But playoff qualification won't be a problem for his Celtics, whose up-and-down regular season has hit a high on the West Coast during a strong trip that concludes Monday against the Clippers.\n\n\"The stuff that happens in the regular season, you can barely remember it in the playoffs,\" Irving said with a shrug.\n\nBoston was challenged while James racked up his 80th career triple-double in a makeshift Lakers lineup missing three injured starters, but Irving hit a series of big shots down the stretch to seal it. After missing Wednesday's win at Sacramento with a bruised thigh, Irving added seven rebounds and seven assists.\n\nMarcus Morris had 16 points and seven rebounds for the Celtics, and Gordon Hayward added 15 points.\n\n\"I feel like we're on the right track,\" Hayward said. \"Certainly winning three in a row helps that. Certainly we can improve, too. We just want to be playing our best basketball come playoff time.\"\n\nJames had 30 points, 12 assists and 10 rebounds in his seventh triple-double for the Lakers, who have lost five straight in a playoff chase that looks futile at this point.\n\n\"I did like the way we played,\" James said. \"I thought we shared the ball. I thought we defended them for the majority of the game. That's a very good team over there. Their hopes are very, very high in the Eastern Conference.\"\n\nRajon Rondo, whose buzzer-beating jumper beat his former team in Boston last month, had four points, nine assists and six rebounds for the Lakers.\n\nTIP-INS\n\nCeltics: Boston shot 51.6 percent and his 14 3-pointers. ... Al Horford and Terry Rozier added 10 points apiece.\n\nLakers: LA was 5-for-27 on 3-pointers, including 1-for-5 by James. ... Lance Stephenson also sat out for the fourth time in five games to rest his sprained toe. ... James, Ingram and Ball have played together in only 23 games this season, and the Lakers went 15-8.\n\nCOMPOUNDED INJURIES\n\nThe Lakers played without Brandon Ingram, Lonzo Ball and Kyle Kuzma after receiving another round of discouraging injury news before the game. Ingram was ruled out for the season with a blood clot in his upper body , a potentially serious problem.\n\nKuzma also wasn't ready to return from the sprained ankle that sidelined him for a second straight game, and Ball will miss at least two more weeks with a sprained ankle that hasn't improved enough since he was injured Jan. 19. Ball has missed big chunks of his first two NBA seasons due to injuries.\n\nCombined with coach Luke Walton's decision to closely monitor James' minutes over the final month, the 10th-place Lakers are already looking toward the summer and LeBron's second season in Hollywood.\n\nAUF GEHTS\n\nMoe Wagner scored a career-high 22 points in his first start for Los Angeles, which has lost nine of 11 overall. The German rookie went 7 for 13 and grabbed six rebounds.\n\n\"Under no circumstances is it fun to lose,\" Wagner said. \"I told Luke after the game, it hurts to fight like that and to come away with another loss.\"\n\nFRESH START\n\nJohnathan Williams added career bests of 18 points and 10 rebounds in the undrafted rookie from Gonzaga's ninth appearance for the Lakers, who will get plenty of chances to show off the franchise's impressive acumen in scouting and personnel development down the stretch of another lost season.\n\nUP NEXT\n\nCeltics: At Clippers on Monday night.\n\nLakers: At Chicago on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994324.659744
}