{
  "game_id": "0022201160",
  "espn_id": "401469315",
  "date": "Mar 31, 2023",
  "matchup": "DEN @ PHX",
  "headline": "Durant has 30 points, Suns beat Nuggets for 4th straight win",
  "body": "PHOENIX -- — The Phoenix Suns are starting to string together some wins now that Kevin Durant is healthy.\n\n\r\n              Even so, they're far from a well-oiled machine.\n\n\r\n              Durant scored 30 points, Devin Booker added 27 and the Suns won their fourth straight game by beating the short-handed Denver Nuggets 100-93 on Friday night.\n\n\r\n              The Suns improved to 5-0 with Durant in the lineup despite nearly blowing a 27-point lead. Phoenix traded for the 13-time All-Star in a deadline deal back in February.\n\n\r\n              “I like how we played in the first half, but it was a bad second half for us,\" Durant said. “We just let our foot off the gas a little and they were playing extremely hard. ... We've just got to do a better job of sticking with it.”\n\n\r\n              The Nuggets rested a big chunk of their starting lineup, including reigning MVP Nikola Jokic, guards Jamal Murray and Kentavious Caldwell-Pope and forward Michael Porter Jr. But they still showed fight after trailing 60-40 at halftime.\n\n\r\n              “I am immensely proud,” Nuggets coach Michael Malone said. “You are down 27 points on the road, second half, second night in a row. Every reason just to roll over and play dead and get ready for Sunday at home. Guys just wouldn't do it.”\n\n\r\n              The Suns pushed their advantage to 27 midway through the third quarter, but the Nuggets pulled to 84-74 heading into the fourth quarter. Denver cut it to 97-93 in the final minute, but Josh Okogie nailed a corner 3 to seal it for the Suns. Okogie had 14 points on 5-of-8 shooting, including four 3-pointers, and Chris Paul had 13 assists.\n\n\r\n              Aaron Gordon had 26 points, nine rebounds and six assists to lead the Nuggets. Bruce Brown scored 16 points and Reggie Jackson had 13. The overmatched but feisty Nuggets got 22 points from the bench.\n\n\r\n              “It was our energy and our effort,” backup guard Peyton Watson said. “We know we were missing guys but that doesn’t change the culture here. We always want to play hard, get stops.”\n\n\r\n              Durant shot 11 of 15 from the field in a dominant performance two days after a rough shooting night in his home debut against Minnesota. The 34-year-old star has battled knee and ankle injuries over the past few months, but appears to be getting healthy as the Suns continue to cling to the No. 4 spot in the Western Conference playoff race.\n\n\r\n              The Suns scored just 16 points in the fourth quarter on Friday, but managed to hang on for the victory.\n\n\r\n              “We're trying to find that rhythm and trying to get wins at the same time,” Booker said.\n\n\r\n              KD ON CLARK\n\n\r\n              Part of the Suns' postgame chatter in the locker room had nothing to do with beating the Nuggets. Instead, Durant and Paul were discussing how good Caitlin Clark's been for Iowa in the women's NCAA Tournament.\n\n\r\n              Clark scored 41 points on Friday night to lead the Hawkeyes over top-ranked South Carolina 77-73. \n\n\r\n              “Incredible run that she's on,” Durant said. “She's playing phenomenal basketball, her team is rallying around her, so it's going to be a good championship game.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Ish Smith shot just 1 of 10 from the field. ... DeAndre Jordan had 12 rebounds.\n\n\r\n              Suns: Hosted a 64th straight sellout crowd. ... Bismack Biyombo blocked three shots.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Golden State on Sunday night.\n\n\r\n              Suns: At Oklahoma City on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994676.2224169
}