{
  "game_id": "0022000811",
  "espn_id": "401307605",
  "date": "Apr 11, 2021",
  "matchup": "MEM vs. IND",
  "headline": "Pacers hang on to beat Grizzlies behind LeVert, Brogdon",
  "body": "MEMPHIS, Tenn. -- — Caris LeVert scored 34 points, Malcolm Brogdon and Domantas Sabonis fell just short of triple-doubles and the Indiana Pacers held on for a 132-125 victory over the Memphis Grizzlies on Sunday night.\n\n\r\n                    Brogdon had 29 points, matched his season-high with 11 assists and had nine rebounds. Sabonis finished with 18 points, 15 rebounds and nine assists, part of the Pacers grabbing a season-high 53 rebounds en route to their third straight victory.\n\n\r\n                    Memphis center Jonas Valanciunas matched his career high with 34 points and his season high with 22 rebounds. Valanciunas had 16 points and 12 rebounds to lead the Memphis second-half rally.\n\n\r\n                    Ja Morant added 23 points for Memphis.\n\n\r\n                    Memphis got within a single point twice in the final 1:46 but could never overtake the Pacers in the closing minutes. Holding onto leads down the stretch has been a change for Indiana in recent games.\n\n\r\n                    “It’s poise offensively,” LeVert said when asked about the change. “A lot of poise. I feel like once you get one game down, the confidence level goes up, and you feel like you’re supposed to win those games. I feel like that’s where we are right now as a team.”\n\n\r\n                    After Indiana led by 18 in the third, Memphis rallied to bring the deficit to single digits in the fourth but never completely erased the Indiana advantage set in the first half.\n\n\r\n                    “We’ve gotten some timely stops on the defensive end, but we’ve been more patient down there late,” Pacers coach Nate Bjorkgren said. “And you hit some big shots. It’s on the guys. They’re doing a great job of sharing the ball.”\n\n\r\n                    Jenkins said that while his team fought back from the terrible first quarter, mistakes down the stretch kept them from overtaking the Pacers.\n\n\r\n                    “Great fight for the majority of the game, winning the last three quarters,” Jenkins said, “but you can’t give up 40-plus points in the first quarter and dig yourself out of that hole.”\n\n\r\n                    As for the end: “Multiple offensive rebounds (by Indiana). You have a chance to win a ballgame. Those are losing plays. You can’t have those.”\n\n\r\n                    Memphis, which blew an eight-point lead in the closing 2:19 of regulation before losing to the New York Knicks in overtime Friday night, looked terrible on defense early in the game.\n\n\r\n                    Sabonis led the Pacers to an early advantage, Indiana scoring 45 points in the first quarter — the most in any period against Memphis this season.\n\n\r\n                    “We had a terrible start to the game,” Jenkins said. “Very unacceptable on our part. Not reflective of who we are, so we’ve got to be better there.”\n\n\r\n                    Sabonis wasn’t the only Indiana player hurting the Grizzlies. The Pacers shot more than 60% through the first half.\n\n\r\n                    Still, Valanciunas and the Grizzlies were able to cut into the lead before a late flurry gave the Pacers a 74-63 lead at the break.\n\n\r\n                    Valanciunas already had 18 points and 10 rebounds at the half. Sabonis was looking at a triple-double with 11 points, 11 rebounds and a handful of assists.\n\n\r\n                    But LeVert also was getting untracked, scoring 19 before intermission.\n\n\r\n                    LeVert and Brogdon each scored 11 points in the third as Indiana held on for a 106-97 lead entering the fourth..\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Have their first three-game winning streak since starting 3-0. … Announced on Sunday they have signed 6-foot-7 forward Oshae Brissett to a second 10-day contract. ... Sabonis had nine assists, moving past Billy Knight for 23rd on the Pacers career list. Knight had 968.\n\n\r\n                    Grizzlies: Valanciunas has 21 straight games with at least 10 rebounds. … Memphis has lost eight of the last 10 to the Pacers. …Morant reached 2,000 career points in the first quarter. \n\n\r\n                    LAST WORD\n\n\r\n                    “Nobody likes to lose, especially when you’re a possession away from the game. … Starting out slow, allowing them to score 40-something points in the first quarter, that’s unacceptable.\" — Memphis guard Ja Morant\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host the Los Angeles Clippers on Tuesday night.\n\n\r\n                    Grizzlies: Host Chicago on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996937.0303931
}