{
  "game_id": "0022000466",
  "espn_id": "401267626",
  "date": "Feb 21, 2021",
  "matchup": "CLE vs. OKC",
  "headline": "Oklahoma City deals Cavaliers 10th straight loss, 117-101",
  "body": "CLEVELAND -- — Shai Gilgeous-Alexander had 31 points and nine assists as the Oklahoma City Thunder beat Cleveland 117-101 on Sunday night, handing the Cavaliers their 10th consecutive loss.\n\n\r\n                    Al Horford had 16 points and eight rebounds, and Hamidou Diallo scored 15 points off the bench for the Thunder, who snapped a five-game road losing streak and three-game overall skid.\n\n\r\n                    Gilgeous-Alexander is averaging career highs of 22.6 points and 6.5 assists in his third season. Western Conference coaches will vote for the All-Star Game reserves Monday.\n\n\r\n                    “Most nights, I feel like we’ve got the best player on the court in Shai -- and that seems like an All-Star to me,” Oklahoma City coach Mark Daigneault said. “I certainly feel like he’s deserving of consideration.”\n\n\r\n                    Collin Sexton scored 27 points and Jarrett Allen shot 11 for 11 and finished with a career-high 26 points and 17 rebounds for the Cavaliers. Cleveland hasn’t won since beating Minnesota on Feb. 1, and is 1-12 since Jan. 27.\n\n\r\n                    The Cavaliers have three double-digit losing streaks since LeBron James left the franchise for the second time in 2018 via free agency for the Los Angeles Lakers.\n\n\r\n                    Cleveland lost 12 in a row from Dec. 19, 2018-Jan. 11, 2019, and dropped 11 straight from March 22-Oct. 23, 2019.\n\n\r\n                    “We just have to be better,” Cavaliers coach J.B. Bickerstaff said. “We’ve got to make open shots in order to survive. We’ve got to guard better and be more physical. We have to be better.”\n\n\r\n                    Oklahoma City took its largest lead at 104-84 on a 3-pointer by Horford early in the fourth quarter. The Thunder made 13 of 28 3-pointers with Gilgeous-Alexander perfect on three 3-point shots.\n\n\r\n                    “Shai is an All-Star,” Oklahoma City forward Mike Muscala said. “He had another great game tonight.”\n\n\r\n                    Darius Garland had 21 points and eight assists for the Cavaliers, who never got closer than six points in the second half. Cleveland missed 27 of its 35 shots from beyond the arc, with Cedi Osman missing all eight 3-point attempts.\n\n\r\n                    Oklahoma City held a 62-51 lead at the break on the strength of 16 points by Gilgeous-Alexander and 12 from Diallo. Allen had 10 points and 11 rebounds over the first two periods.\n\n\r\n                    “They were all pretty locked in and played together for 48 minutes,” Daigneault said. “And when it was time to shift into that next gear, Shai was outstanding.”\n\n\r\n                    DELLY DOWN\n\n\r\n                    Cavaliers G Matthew Dellavedova, who has yet to play this season because of a concussion, underwent an appendectomy Saturday. The fan favorite experienced abdominal pain while at Cleveland’s training facility earlier in the day. “The first thing Delly told me was, ‘I’m going to have a run of good luck here soon,’” Bickerstaff said. “He’s in good spirits and is optimistic.”\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Rookie G Theo Maledon is averaging 10.0 points over 31.3 minutes in four contests since returning from a five-game absence under the NBA’s health and safety protocols. “The whole year has been a nice trajectory with Theo,” Daigneault said. “He’s somebody who can fit in, no matter what four-man unit he’s out there with.” … G George Hill (right thumb surgery) missed his 15th straight game.\n\n\r\n                    Cavaliers: F Larry Nance Jr. (left hand fracture) and F Taurean Prince (left ankle soreness) remain out, but were active for Cleveland to meet the NBA game minimum. … F Kevin Love (right calf strain) was held out of team drills Saturday after experiencing soreness. The five-time All-Star last played on Dec. 27. … Bickerstaff started the same lineup after they didn’t grab a rebound in the first 20:34 against Denver. \n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Host Miami on Monday. Oklahoma City has a 14-10 record against the Heat since moving from Seattle, but lost 118-90 in Miami on Jan. 4.\n\n\r\n                    Cavaliers: Host Atlanta on Tuesday. Cleveland continues its final homestand of the first half of the season, playing the third game in a four-game set.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997884.35127
}