{
  "game_id": "0021500510",
  "espn_id": "400828397",
  "date": "Jan 03, 2016",
  "matchup": "LAL vs. PHX",
  "headline": "Williams scores 30, Lakers beat Suns 97-77 without Kobe",
  "body": "LOS ANGELES --  The Los Angeles Lakers have won three straight games for the first time since last February, which is decidedly more significant to them than the fact that they've done it against teams with a combined winning percentage of .311.\n\nLou Williams scored a season-high 30 points and the Lakers sent Phoenix to its ninth consecutive loss with a 97-77 rout of the cold-shooting Suns on Sunday night.\n\nComing off victories over Boston and Philadelphia, the Lakers have matched their longest streak since beating the Celtics, Jazz and Bucks in succession.\n\n\"Once you win one, and then you win two, the next thing you know you start paying attention to the things that got you to that point,\" Williams said. \"So now guys are communicating more and trusting that your teammates are going to make plays for you, instead of the ball just sticking in every guy's hands once he gets it.\"\n\nLakers rookie Larry Nance Jr. had 15 points and tied a season high with his second straight 14-rebound game. He made seven of 10 shots in his first start against the team his dad starred for during his first 6 1/2 NBA seasons.\n\n\"Larry's been given the 15-17-foot jump shots by most of the guys he's played against,\" coach Byron Scott said. \"He was very reluctant to take them earlier in the season, but now he's knocking them down on a consistent basis.\n\n\"He's still got to work on his ball-handling -- being able to get by people or just create space for himself. But he's definitely a guy who can stretch the floor -- partly on what he's demonstrating right now.\"\n\nNance's soaring, two-handed dunk in the opening minutes was oh-so-reminiscent of his old man.\n\n\"He's very poised when he's out there,\" Scott said. \"Larry Sr., in all the years I played against him, we never saw him get rattled. He was one of those guys who was even-keeled all the way through the game, no matter if they were up or down. And Junior's the same way. He has a lot of his dad in him, as far as his demeanor on the court.\"\n\nKobe Bryant sat out his second straight game because of a sore right shoulder, the same one he had surgery on last January to repair a torn rotator cuff.\n\nThe league's third all-time leading scorer, Bryant turned 37 in August and is averaging 17.2 points in 29 games. He announced on Nov. 29 that this will be the final season of his 20-year NBA career.\n\nBrandon Knight had 25 points, nine assists and three rebounds for the Suns, who shot 36 percent from the field and trailed by as many as 38 en route to their 21st loss in 27 games since beating the Lakers at Phoenix on Nov. 16.\n\nPhoenix center Tyson Chandler, ejected midway through the third quarter of Saturday's 142-119 loss at Sacramento, played only 19 minutes and missed his first five shots before finishing with two points on 1-for-6 shooting.\n\nThe Suns were playing their fourth game in five nights and looked tired, making only nine of 46 shots in the first half (19.6 percent) and scoring just 10 points in the opening quarter before the Lakers built their lead to 43-22 by intermission.\n\nThat was the lowest first-half total in Suns history and a Lakers record for fewest points allowed in the first half.\n\n\"Guys were tentative, and we basically laid an egg early,\" Suns coach Jeff Hornacek said. \"We couldn't throw it in from anywhere. I mean, 9 for 46 in the first half. We settled for shots, we rushed them, and we didn't attack the basket.\"\n\nThe Suns had won nine of their previous 10 meetings with the Lakers. But despite this loss, they still have a three-game lead over Los Angeles in the race to stay out of the Pacific Division cellar.\n\nTIP-INS\n\nSuns: Phoenix (12-25) is 0-15 when scoring fewer than 100 points. ... C Alex Len, limited to 6 1/2 minutes of playing time Saturday because of a sore left hand, came off the bench for the third straight game and had six points and nine rebounds in 28 minutes. ... The Suns are 0-10 when an opposing player has scored 30 or more points.\n\nLakers: A fan won $95,000 for hitting a halfcourt shot after the third quarter. ... Nance came off the bench against the Suns the first time he faced them, playing 23 scoreless minutes with three rebounds. . Williams ended his 11-point second quarter with a buzzer-beating 3-pointer off an inbounds pass after the Lakers took a 20-second timeout with 1.1 seconds on the clock.\n\nUP NEXT\n\nSuns: Host Charlotte on Wednesday night.\n\nLakers: Host Golden State on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994287.431492
}