{
  "game_id": "0022300020",
  "espn_id": "401584108",
  "date": "Nov 14, 2023",
  "matchup": "ORL @ BKN",
  "headline": "Nets pull away in fourth quarter for a 124-104 victory over Magic in the In-Season Tournament",
  "body": "NEW YORK -- — Spencer Dinwiddie had 29 points, nine assists and five rebounds, leading the Brooklyn Nets to a 124-104 victory over the Orlando Magic on Tuesday night in Eastern Conference Group C of the NBA In-Season Tournament.\n\n\r\n              Mikal Bridges chipped in 21 points, five rebounds and four assists, while Cam Johnson scored 20 points as Brooklyn put six players in double figures. Day’Ron Sharpe finished with 11 points and 10 rebounds before fouling out, and the Nets won their second straight overall and improved to 2-1 in the tournament.\n\n\r\n              “A really good response and effort from our guys,” Nets coach Jacque Vaughn said. “We talked about being better tonight on both ends of the floor, and our guys were definitely better.”\n\n\r\n              The Nets will close their round-robin slate with a home game against Toronto on Nov. 28.\n\n\r\n              Franz Wagner had 21 points, eight rebounds and five assists for their Magic in their tournament opener. Orlando fell to 4-16 all-time at Barclays Center.\n\n\r\n              “I think the game was a little closer than it ended up being,” Wagner said. “I think (there were) a lot of turnovers, and they got open shots in transition. Offensively, we lost our flow a bit.”\n\n\r\n              After closing the third quarter with a 15-7 run, Brooklyn pulled away with a 22-9 spurt to start the fourth. Dinwiddie scored 12 in the quarter.\n\n\r\n              “Just playing some pick-and-roll and getting some mismatches,” Dinwiddie said. “I was fortunate enough to hit some shots.”\n\n\r\n              Royce O’Neale added seven in the fourth and the Nets made 7 of 10 3-pointers while outscoring Orlando 36-18 in the period.\n\n\r\n              “Obviously (Dinwiddie) had a great quarter,” Johnson said. ”Really gave us a big lift with some timely buckets. That kind of hurts the other team’s confidence. Guys played well across the board.”\n\n\r\n              The Magic shot just 6 of 21 in the fourth, and Brooklyn recorded a season-high 13 steals and turned 16 turnovers into 27 points, which also was its most points off turnovers thus far. \n\n\r\n              “Give credit to Brooklyn. I think they did a great job of turning up the heat,” Magic coach Jamahl Mosley said. “But we talked about not beating ourselves, and 16 turnovers for 27 points is not going to get the job done. You turn the ball over 16 times for 27 points, and you lose by 20, you’re not giving yourself a chance there.”\n\n\r\n              Brooklyn made seven of its first 10 field goals and six of its first 11 3-pointers. The Nets used an 8-0 first-quarter run to build a 14-point lead, keyed by Sharpe’s six points and five rebounds off the bench after center Nic Claxton got in early foul trouble.\n\n\r\n              “I thought (Sharpe’s) minutes were very valuable tonight for our group on both ends of the floor,” Vaughn said.\n\n\r\n              But Orlando rallied behind Joe Ingles’ 11 first-quarter points and Wagner’s half-court buzzer beater to end the first quarter. The Magic used their size advantage to force four first-half fouls against Claxton, and outscored the Nets 28-7 over a span of just over eight minutes to build a seven-point advantage.\n\n\r\n              “We’re resilient,” Mosley said. “That second unit did a great job of getting us back into it. We didn’t allow the shot-making or missing to affect us early.”\n\n\r\n              Orlando shot 52.6% from the field and got 13 points from Paolo Banchero to lead 60-57 at halftime.\n\n\r\n              “I think in all of our games we’re getting leads, and that’s a good thing,” Wagner said. “I think we’ve improved a lot from last year.”\n\n\r\n              UP NEXT\n\n\r\n              Orlando: At Chicago on Wednesday.\n\n\r\n              Brooklyn: At Miami on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995745.317173
}