{
  "game_id": "0021801059",
  "espn_id": "401071732",
  "date": "Mar 19, 2019",
  "matchup": "PHI @ CHA",
  "headline": "Simmons, Redick lead 76ers past pesky Hornets 118-114",
  "body": "CHARLOTTE, N.C. --  JJ Redick's last triple-double came in high school.\n\n\"Does high school even count?\" Redick said with a grin. \"I mean we all have our high school stories.\"\n\nRedick was two assists shy of his first NBA triple-double in 761 career games, finishing with 27 points, 10 rebounds and eight assists as the Philadelphia 76ers held on to beat the Charlotte Hornets 118-114 on Tuesday night for their fifth straight victory.\n\n\"I didn't realize it until T.J. (McConnell) came over at the 5:46 timeout and said, `Dude, you have nine rebounds and eight assists. But I will just be happy with a double-double. If you play long enough, 10 rebounds will fall in your lap.\"\n\nPerhaps there was some leftover magic in Redick's locker.\n\nHe occupied the same locker stall at the Spectrum Center that Zion Williamson, another famous Duke player, had this past weekend at the ACC Tournament championship. Williamson grabbed MVP honors, helping the Blue Devils beat Florida State in the championship game.\n\nBen Simmons led the 76ers (46-25) with 28 points, Jimmy Butler added 23 points and nine assists, and Tobias Harris chipped in with 22 points and 12 rebounds.\n\nRedick finished with seven 3-pointers, one shy of his career high.\n\nJeremy Lamb led the Hornets with 26 points and 11 rebounds, but missed a floater that would have sent the game into overtime. Kemba Walker had 21 points for the Hornets (31-39), who have dropped four of their last five and continue to fall out of playoff contention.\n\nThe Hornets didn't make it easy on the 76ers.\n\nAfter a Butler missed a jumper with 33 seconds left, Harris grabbed a key offensive rebound leading to an open 3-pointer jumper in left corner for James Ennis. Lamb followed with three free throws at the other end, cutting the lead to one with 12.1 seconds left.\n\nHarris made 1 of 2 free throws with 8.2 seconds left, giving the Hornets one last chance to tie or win the game before Lamb's shot with 2 seconds left rimmed out. Harris then added two free throws for the final margin.\n\n\"We have to keep searching for answers and keep digging,\" Hornets coach James Borrego said. \"That's all we can do. In the fourth quarter we were right there again, we just have to find a way to close out games and make shots down the stretch.\"\n\nRedick was the story of the first half, pouring in 21 points with five 3-pointers.\n\nThe Hornets were able to stay close, trailing 62-59 at the break despite Walker only playing six minutes after picking up three fouls in the first quarter. Charlotte's bench was a big reason why, outscoring the 76ers 31-4 before intermission.\n\n\"We thought we got lucky with Kemba (Walker) getting three fouls in the first half, but we really did not create the separation that we had hoped,\" 76ers coach Brett Brown said. \"I give them credit, they fought like heck.\"\n\nTIP INS\n\n76ers: Mike Scott fouled out with 5 minutes left after playing just 15 minutes and failing to score. ... Ennis had 14 points off the bench on 6-of-9 shooting.\n\nHornets: Michael Kidd-Gilchrist left the game late in the third quarter with a head injury after a collision with Amir Johnson in the backcourt as Kidd-Gilchrist was attempting to bring the ball up the court. Kidd-Gilchrist did not return. ... Cody Zeller also sat out with soreness in his left knee.\n\nRESTING EMBIID\n\nAmir Johnson got the start at center with Joel Embiid sitting out to rest in advance of Wednesday night's game against the Celtics.\n\n\"Even without having Joel there are some positives we can take from it, obviously some things we can get better at,\" Harris said. \"But we've got to be locked in and ready to play against a great team (in the Celtics) that's had our number for a while now.\"\n\nGOING WITH THE STARTERS\n\nThe 76ers won despite their bench getting outscored 61-14.\n\nPart of that the result of Brown playing his starters extensively with Simmons and Harris both playing 38 minutes, while Butler and Redick played 37 minutes. Brown said he didn't want to do that, especially on the first night of a back-to-back but felt he needed to.\n\n\"As the game is unfolding I'm thinking two things: we're here to win, and we're here to win -- really,\" Brown said intentionally repeating himself. \"You can't have it all. It's not like we feel like we have a really deep bench.\"\n\nBACON TIME\n\nBorrego's trust in second-year player Dwayne Bacon is increasing. Bacon was on the floor again in the game's final minutes and was aggressive in the taking the ball to the rim.\n\n\"It feels good, especially knowing where I came from earlier in the season,\" said Bacon, who has bounced back and forth from the G League to the Hornets. \"... He's been trusting me and I've just got to keep building on it.\"\n\nUP NEXT\n\n76ers: Host Celtics on Wednesday night.\n\nHornets: Host Timberwolves on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764993995.9491572
}