{
  "game_id": "0021600677",
  "espn_id": "400900098",
  "date": "Jan 24, 2017",
  "matchup": "CHI @ ORL",
  "headline": "Bulls ride Wade and Butler to win over Magic",
  "body": "ORLANDO, Fla. --  Dwyane Wade trusts his natural feel for the game when it's time to defer and allow Jimmy Butler to take over down the stretch.\n\nThe 14-year veteran guard also knows when his new team needs more of him late in the games. He sensed it Tuesday night, scoring seven of his 21 points in the fourth quarter to propel the Chicago Bulls to 100-92 road win over the struggling Orlando Magic.\n\nIt was the second straight game that Wade took over in the fourth quarter to lead Chicago to victory.\n\n\"Each game is different and it calls for something different,\" Wade said of how he and Butler play off each other. \"Like I said earlier in the year, I think we are both more dynamic when we are both able to score.\"\n\nBoth took turns in the fourth as the Bulls pulled away in otherwise close game. Butler scored six of his 20 points in the fourth quarter as they took turns pulling up for jumpers and driving to the basket against a Magic team that was playing without three of its top four guards.\n\nBut Wade just seemed to have a little more energy as he played the role of scorer and facilitator in setting up his teammates for easy baskets throughout the fourth quarter.\n\n\"He's been huge lately,\" Butler said. \"He's taking and making shots, tough ones at that, passing the ball to the open guy. Me and him both decided to miss a couple of wide-open layups tonight, that's part of it. But he has been huge.\"\n\nHis performance took a little pressure off Jerian Grant, who was inserted back into the starting lineup at point guard before the game. Wade's vision also played a part in backup center Cristiano Felicio's 12-point, 10-rebound performance.\n\n\"He is obviously a guy who can get it going at any time,\" Chicago coach Fred Hoiberg said of Wade. \"He had three big buckets going into halftime to get him some confidence and little rhythm and then was awesome in the fourth quarter to close the game.\"\n\nTIP-INS\n\nBulls: Chicago shook up its point guard position before Tuesday night's game. Grant replaced Carter-Williams in the starting lineup. Hoiberg said Carter-Williams, who didn't play, has been demoted and will come off the bench and did not immediately name a backup, although Rajon Rondo was the first off the bench.\n\nMagic: Injuries caused the Magic to shuffle their starting lineup for the second game in a row. With Augustin out with an ankle injury from Sunday's loss to Golden State, Vogel shifted C.J. Watson, who started at shooting guard Sunday, to backup point guard and coming off the bench. Jeff Green and Aaron Gordon both started at the wings to match up better against Butler and Wade, Vogel said. Fournier, the starting shooting guard, missed his sixth straight game with a sore right foot. ...The MRI on Augustin's sprained ankle came back negative but he is listed as day-to-day. ... Meeks had surgery on his right thumb Tuesday morning and is out indefinitely.\n\nDEPLETED BACKCOURT\n\nWith Evan Fournier, Jodie Meeks and D.J. Augustin all out with injuries, the Magic's backcourt struggled.\n\nThat was most evident in the 19 turnovers the team committed. Point guard Elfrid Payton, who had to play 38 minutes because of the lack at the position, committed eight of the costly turnovers.\n\n\"Well, they're good at turning teams over and we know we can't over penetrate,\" said Orlando coach Frank Vogel.  \"But we're missing our shooting guards so it's a little bit of a challenge with what we have in terms of perimeter shooting.\"\n\nMAN IN THE MIDDLE\n\nFelicio, who struggled with catching the ball in the paint early in the season, thrived underneath most of the night when Chicago went to its smaller lineup.\n\nHe defended Nikola Vucevic decently in the paint and when Butler and Wade found him for lobs inside he made good, converting four of six.\n\nUP NEXT\n\nBulls: Chicago returns home to take on the Atlanta Hawks on Wednesday night.\n\nMagic: Orlando hits the road for a three-game stretch with Boston as the first stop on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995049.770643
}