{
  "game_id": "0021500471",
  "espn_id": "400828358",
  "date": "Dec 29, 2015",
  "matchup": "MEM vs. MIA",
  "headline": "Gasol's overtime performance sends Grizzlies past Heat 99-90",
  "body": "MEMPHIS, Tenn. --  Marc Gasol didn't let an injured left ankle slow him down in overtime.\n\nHe scored seven of his 23 points in the extra period to help Memphis pull away for a 99-90 victory over the Miami Heat on Tuesday night.\n\nMike Conley and Jeff Green had 16 apiece, and Mario Chalmers scored 12 points. Gasol would add eight rebounds, six assists and four blocks, including a pair of rejections in the closing minutes, despite tweaking his left ankle near the end of the game.\n\n\"Marc Gasol, all night long with what he did on both ends of the floor, was tremendous,\" Memphis coach Dave Joerger said.\n\nGasol's overtime performance included a stumbling move in the lane where he flipped the ball to the basket as he was fouled. The shot bounced through, Gasol converted the ensuing free throw and the Grizzlies were up 96-88 with 1:22 left -- a lead Memphis would not relinquish.\n\n\"Marc playing like that is big,\" said Zach Randolph, who finished with 17 points. \"He's our catalyst. How he goes is how we go.\"\n\nChris Bosh led Miami with 22 points, but was 3 of 14 after halftime. Dwyane Wade finished with 19, and Goran Dragic had 16 points.\n\nThe teams were tied at 83 at the end of regulation.\n\n\"We showed some grit to get to that point,\" Miami coach Erik Spoelstra said. \"Then we had a couple of decent looks at the end of regulation and just couldn't put them down.\"\n\nMiami was able to tie the game by holding Memphis without a field goal after Randolph converted a hook with 6:33 left to match the Grizzlies' largest lead at 81-72.\n\nMemphis would manage only two free throws the rest of the fourth quarter -- by Randolph with 5:58 remaining -- allowing the Heat to pull even on Hassan Whiteside's hook with just under 3 minutes left in regulation.\n\nMiami had a chance to win in regulation, but Bosh's 11-foot shot as time expired bounced off the rim, sending the game to overtime.\n\n\"It was just one of those shots where you only have one try,\" Bosh said. \"It's a different speed, and we got a shot at the basket.\"\n\nSeveral Grizzlies said their defense enabled them to withstand the fourth quarter scoring drought.\n\n\"We played good D,\" Gasol said. \"When you have that safety net that you are playing good defense and you're getting stops, that gives you confidence.\"\n\nTIP-INS:\n\nHeat: The game marked the return of guard Beno Udrih, who played parts of three seasons with Memphis. He, along with Jarnell Stokes, was traded to the Heat on Nov. 10 for Chalmers and James Ennis. ... Wade connected on a 3-footer with 5:14 left in the first quarter for his 7,000th made field goal in his career. . Tyler Johnson finished with 13 points for the Heat, converting 4 of 8 from the field, including 3 of 6 outside the arc. .The Heat are 9-2 against Western Conference teams. Their previous loss was 103-91 to the Minnesota Timberwolves on Nov. 17.\n\nGrizzlies: With the win, Memphis finished December 8-8, the 12th consecutive month Memphis has had at least a .500 record. ...Ryan Hollins, signed by Memphis earlier Tuesday, played just under 9 minutes and did not score.\n\nMLK HONREES: The Grizzlies announced earlier Tuesday that a pair of former NBA players and a WNBA star will be honored with the 11th Annual National Civil Rights Museum Sports Legacy Awards. Jalen Rose and Spencer Haywood, along with Tamika Catchings, will be recognized in ceremonies during the team's annual MLK Day game celebrations on Jan. 18 against the New Orleans Pelicans.\n\nNO BARNES, GAME ONE: Memphis played without F Matt Barnes, who served the first game of a two-game suspension for his altercation with Knicks coach Derek Fisher in October. Randolph started in Barnes' spot, his first start in 10 games.\n\nUP NEXT\n\nHeat: Host Dallas Mavericks on Friday\n\nGrizzlies: Visit Utah Jazz on Saturday",
  "source": "espn_api",
  "crawled_at": 1764994452.22052
}