{
  "game_id": "0021900382",
  "espn_id": "401161024",
  "date": "Dec 14, 2019",
  "matchup": "CHI vs. LAC",
  "headline": "LaVine scores 31 points, Bulls rally to beat Clippers",
  "body": "CHICAGO --  After blowing several late leads to lose games, the Chicago Bulls were able to flip the script Saturday night.\n\nZach LaVine scored 31 points and converted a decisive three-point play in the Bulls' 109-106 victory over the short-handed and weary Los Angeles Clippers.\n\nChicago trailed by five points with less than two minutes to go. Tied at 106, the Bulls inbounded with 5.4 seconds left. LaVine got the ball near the 3-point line, drove to his right and was fouled by Montrezl Harrell as he scored with 2 seconds left.\n\nPaul George then missed a 3-pointer at the buzzer.\n\n\"We made big plays,\" LaVine said. \"I think that's what it comes down to, making plays.\n\n\"We've been playing good, but we just haven't been able to get that win in the last two minutes, three minutes of the game. Hopefully, we can start stringing some together.\"\n\nLauri Markkanen had 13 points and 17 rebounds, Thaddeus Young scored 17 points, and Denzel Valentine had 16 for the Bulls.\n\nHarrell had 30 points and George had 27 for Los Angeles. The Clippers had won four in a row.\n\nBesides playing for the third time in four days at the end of a six-game trip, the Clippers were without Kawhi Leonard (injury management, left knee soreness), Lou Williams (right calf), Patrick Beverly (concussion) and JaMychal Green (tailbone contusion).\n\nThis was the eighth game Leonard has missed. He scored 42 points Friday night at Minnesota.\n\nGeorge was asked if the poor finish was a result of fatigue. \"Not necessarily,\" he said. \"This isn't new. We just got outplayed tonight.\"\n\nLos Angeles led by 15 points midway through the second quarter before Chicago closed the first half with a 19-6 run to pull to 57-55.\n\nThe Bulls continued the surge early in the third, scoring 17 straight points for a 75-61 lead. The 75 points were two more than Chicago scored Friday night in an 83-73 home loss to Charlotte.\n\nThe Clippers answered with a 12-1 run to trim the deficit to 76-73 and pulled to 81-79 in the final minute of the third on a three-point play by Harrell. LaVine then hit a 3-pointer to give Chicago an 84-79 lead entering the fourth.\n\nIn the final three minutes, George hit a pair of free throws to break a tie at 98 and Landry Shamet hit a 3-pointer for a 103-98 Clippers lead with 2 1/2 minutes remaining. With L.A. up by five a minute later, LaVine and Valentine hit 3-pointers on back-to-back possessions -- sandwiched around one of two free throws by George -- for a tie at 106 with 47.9 seconds left.\n\nTIP-INS\n\nClippers: G Shamet returned after missing a month (17 games) with a high right ankle sprain. He finished with 11 points in 21 minutes.\n\nBulls: F Chandler Hutchison (right shoulder sprain) missed his ninth straight game. He hasn't been cleared for contact and there is no timetable for his return. \"He shot earlier today, he got some three balls up, so that was encouraging,\" coach Jim Boylen said.\n\nWINNING PLAY\n\nThe Bulls had planned to hold for the last shot, but that changed when George got caught out of position, clearing the path for LaVine.\n\n\"I just saw the one-on-one with Montrezl, so just go in there with a strong finish, try to get to the line,\" he said. \"I was able to come up with the and-one.\"\n\nWhen asked what created the lane, Clippers coach Doc Rivers said: \"It was created by bad defense.\"\n\nQUICK TURNAROUND\n\nThe start of Friday night's game at Minnesota was pushed back nearly two hours to accommodate national TV, so the Clippers had less recovery time than a typical back-to-back.\n\n\"Our league has been great, but today's game, in my opinion, should not be played or happen,\" Rivers said. \"When you play basically an 8:45 p.m. game and then have to fly and get to your hotel at 3:45 and go to bed at 5, you probably shouldn't be playing basketball the next day -- especially if they're talking about our health.\"\n\nHE SAID IT\n\nWhen asked if an 82-game regular-season schedule was too much, Rivers said: \"I don't know. If you see me walk, clearly 82 games is not healthy.\"\n\nUP NEXT\n\nClippers: Host Phoenix on Tuesday night.\n\nBulls: At Oklahoma City on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996355.262333
}