{
  "game_id": "0022200539",
  "espn_id": "401468694",
  "date": "Dec 31, 2022",
  "matchup": "CHA vs. BKN",
  "headline": "Irving and Durant lead Nets past Hornets for 11th win a row",
  "body": "CHARLOTTE. N.C. -- — Kyrie Irving scored 18 of his 28 points in the first half, Kevin Durant added 23 points and the Brooklyn Nets ran their winning streak to 11, beating the Charlotte Hornets 123-106 on Saturday night.\n\n\r\n              Brooklyn never trailed and led by 10 points in the first quarter, 15 in the second, 18 in the third and 22 in the fourth to improve to 24-12.\n\n\r\n              “We held them to 22 points in the first quarter, so we put our stamp on the game in a hurry,” Nets coach Jacque Vaughn said. “I think we were able to use or rotations and depth to extends our leads a little bit.\n\n\r\n              “We wanted to come out with the right mindset, which we did.\n\n\r\n              Royce O’Neale and Nic Claxton added 14 points apiece for Brooklyn, Yuta Watanabe had 11 and T.J. Warren 10.\n\n\r\n              LaMelo Ball had 23 points, seven rebounds and 11 assists for Charlotte. Mason Plumlee added 22 points. The Hornets dropped to 10-27.\n\n\r\n              After Charlotte cut it to 71-65 early in the third quarter, Irving and Durant combined to score 11 of the Nets’ next 13 points and sparked Brooklyn’s 28-14 surge for a 97-79 lead entering the fourth quarter.\n\n\r\n              “We knew that this team could get hot,” Durant said about Charlotte. “They hit some 3s there in the first half so we knew they could get hot there in the third quarter. And they did. They cut it to six.\n\n\r\n              “We’ve been in this position before so we knew what to do. And the first play out of the timeout, we executed and finished with a win.”\n\n\r\n              Plumlee said Hornets coach Steve Clifford’s discussed in pregame about how well the Nets had been playing — and some nothing to change his mind.\n\n\r\n              “Coach said they were the hottest team in the league right now,” Plumlee said. “So we knew that. And I thought we did pretty well after that first quarter.”\n\n\r\n              TIP-INS\n\n\r\n              Nets: Guard/forward Joe Harris missed his fourth straight game Saturday because of soreness in his left knee.\n\n\r\n              Hornets: Charlotte coach Steve Clifford had no timetable for Kelly Oubre Jr. to return to his lineup. Oubre missed his second game out of three Saturday with a sprained left hand.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host San Antonio on Monday night.\n\n\r\n              Hornets: Host Los Angeles Lakers on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994271.754955
}