{
  "game_id": "0022400077",
  "espn_id": "401704643",
  "date": "Oct 25, 2024",
  "matchup": "ORL vs. BKN",
  "headline": "Franz Wagner scores 29 points, Magic beat Nets 116-101 in home opener",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 29 points, brother Mo Wagner added 18 and the Orlando Magic won their home opener, beating the Brooklyn Nets 116-101 on Friday night.\n\n\r\n              Paolo Banchero had 15 points and nine assists after failing to make a field goal in the first half. Wendell Carter had 10 rebounds.\n\n\r\n              Cam Thomas scored 24 points for Brooklyn, and Dennis Schroeder added 20.\n\n\r\n              Brooklyn had its biggest lead at 53-49 after Ben Simmons scored the first seven points of the second half.\n\n\r\n              Takeawtays\r\n              \r\n              Nets: Thirty-seven turnovers and a free-throw differential of minus-33 made it difficult for the Nets to compete on the road in their first two games.\n\n\r\n              Magic: With big contributions from their bench in both games, the Magic showed they can win when Banchero is not at his best — at least at home. Since March 30, including their first-round playoff loss to Cleveland, the Magic have won eight straight at home while losing seven of eight on the road.\n\n\r\n              Key moment\r\n              Franz Wagner made two free throws with 5:14 left in the third quarter break a 65-65 tie, opening a 13-0 run during which Simmons went to the bench with his fifth foul. The Nets never again got closer than eight.\n\n\r\n              Key stat\r\n              After finishing last in the NBA with only 11 3-pointers per game last season, the Magic have hit 33 in their first two games while shooting 41.8%. Ten players hit at least one 3-pointer against the Nets.\n\n\r\n              Up next\r\n              \r\n              The Magic play at Memphis on Saturday night. The Nets will play their home opener Sunday night against Milwaukee.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997586.249109
}