{
  "game_id": "0021500429",
  "espn_id": "400828316",
  "date": "Dec 23, 2015",
  "matchup": "DET @ ATL",
  "headline": "Teague, Millsap pace Hawks in 107-100 win over Pistons",
  "body": "ATLANTA --  Al Horford believes the Atlanta Hawks are starting to look more like last season's 60-win team.\n\nHard work in practice has paid off as the Hawks have moved into second place in the Eastern Conference.\n\n\"The first month and a half or so we weren't very good,\" Horford said. \"I think that we're starting to play more like ourselves.\"\n\nJeff Teague scored 23 points, Paul Millsap added 18 and Atlanta beat the Detroit Pistons 107-100 Wednesday night for their fifth straight win.\n\nHorford finished with 15 points and Dennis Schroder added 14 for the Hawks.\n\nAndre Drummond led the Pistons with 25 points and 12 rebounds. His hook shot cut the lead to eight with 1:52 remaining, but he was called for goaltending with 41 seconds to go, pushing Atlanta back up by 10.\n\nMarcus Morris had 22 points and Reggie Jackson scored 19 points as Detroit ended a three-game winning streak.\n\nThe Pistons led by one on Kentavious Caldwell-Pope's fastbreak dunk at the 7:14 mark of the second before the Hawks went on a 24-6 run to take a 59-42 lead on Teague's layup in the final minute of the period.\n\nIn Tuesday's win at Miami, the Pistons erased an 18-point deficit in the second quarter to win 93-92, but they didn't get enough stops to disrupt Atlanta's fluid passing attack.\n\nThe Pistons struggled from the field, missing 27 of their first 41 shots and finishing less than 43 percent from the field.\n\nDrummond's struggles at the foul line were a big hindrance. He began the night hitting less than 38 percent of his free throws and missed 11 of his first 16 attempts before hitting his last two.\n\nThe 6-foot-11, 279-pound center wasn't surprised that Atlanta forced him to the line.\n\n\"It worked,\" he said. \"They won the game. I've just got to make free throws. That's the tactic they took and it worked for them tonight.\"\n\nThe Hawks weren't the first team to force Drummond's hand.\n\n\"I'm not crazy about it, but it's just the way it is,\" Horford said. \"It's something that you know is there and sometimes you need to use it.\"\n\nPistons coach Stan Van Gundy is getting exasperated with Drummond's recurring problem.\n\n\"He's going to have to shoot the ball better at the line in order to stay in the game,\" Van Gundy said. \"He can't continue to shoot under 50 percent. He just can't.\"\n\nThe Hawks improved to 15-1 when scoring at least 100 points and they improved to 39-1 since last season when beginning the fourth quarter with a lead.\n\n\"We're getting closer to playing a complete game,\" Atlanta coach Mike Budenholzer said.\n\nTIP-INS\n\nPistons: Caldwell-Pope, the 2013 Southeastern Conference player of the year at Georgia, had 12 points and suffered a lower left leg strain. Bulldogs coach Mark Fox watched the game from the stands spoke with his former star afterward.\n\nHawks: Schroder has averaged 16.8 points in his last five games in which he's taken at least 10 shots. ... C Tiago Splitter, who spent the last five seasons with San Antonio, scored a season-high 11 in his 22nd Hawks game.\n\nLONG NIGHT\n\nFog kept the Pistons' charter at the airport Tuesday as the team returned to its hotel and spent another night in Miami. After doing Wednesday's walkthrough at the hotel, they left for Atlanta, arriving at noon.\n\nUP NEXT\n\nPistons: Host Boston on Saturday.\n\nHawks: Host New York on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994936.839712
}