{
  "game_id": "0021401137",
  "espn_id": "400579429",
  "date": "Apr 04, 2015",
  "matchup": "CHA vs. PHI",
  "headline": "Henderson's layup lifts Hornets past 76ers 92-91",
  "body": "CHARLOTTE, N.C. -- Gerald Henderson was determined to turn an \"awful night\" into a memorable one.\nThe sixth-year guard overcame a 2-of-12 shooting night when he scored on a driving layup with 6 seconds left to propel Charlotte to a 92-91 win over the Philadelphia 76ers on Saturday night, keeping alive the Hornets' slim playoff hopes.\n\"Coach drew the play up and I just said in my mind, `I'm going to win the game,\" Henderson said. \"It wasn't a great shooting night for me but I wanted to win the game. And the lane opened up and I finished.\"\nCoach Steve Clifford said Henderson was actually the last option on the play.\n\"The others, they were defended well,\" Clifford said. \"But he got the switch and he made a good decision to use his size and quickness to try to get to the basket.\"\nKemba Walker had 24 points and Mo Williams added 18 as the Hornets won despite playing without three starters, including center Al Jefferson. The win pulls the Hornets within 1 1/2 games of Boston for eighth place in the Eastern Conference standings.\nHenderson finished with seven points for Charlotte (33-43).\nAfter Ish Smith missed two free throws with 10.6 seconds to go, Henderson took an inbounds pass at midcourt, drove past Smith on the right side of the lane and made a one-handed layup off the glass over a leaping Furkan Aldemir for the lead.\nSmith had a chance to win it for the 76ers, but his driving left-handed layup at the buzzer was too strong.\nHenderson finished with just seven points, and the Hornets overcome a 1 of 13 shooting night from beyond the 3-point arc.\n\"It was ugly but we don't care,\" Henderson said. \"It was a win.\"\nSmith and Robert Covington each had 15 points for the 76ers, who've lost 19 of their last 20 games on the road.\nPhiladelphia (18-59) had plenty of chances to close it out.\nLeading by one, Smith missed a 3-pointer from the right corner with 25 seconds left that would have made it a two-possession game.\nAfter Williams misfired on an open look from the right corner with 17 seconds left, the Hornets were forced to foul Smith. However, Smith missed both free throws, setting up Henderson's winning shot.\nSmith left feeling like he'd let his teammates down.\n\"The 3-ball I missed in the corner, the free throws I missed and then the last shot,\" Smith said. \"I think we played 47 minutes and 30 seconds of good basketball and then at the end, that's what takes you to another level. And I didn't do it tonight.\"\nWith Jefferson out, rookie Noah Vonleh saw more action in the middle and had a one-handed dunk over Nerlens Noel. He finished with six points and six minutes.\nThe Hornets entered the night two games behind Miami for eighth place in the Eastern Conference and desperate for a win to keep alive their slim playoff hopes.\nThey won despite Jefferson sitting out with a right knee injury that has plagued him for weeks.\nCharlotte turned 15 Philadelphia turnovers into 22 points and converted 19 of 21 free throws.\n---\nTIP-INS\n76ers: Smith had scored in double figures in five straight games, the longest stretch of his career. .... Registered a season-high 14 blocked shots, six by Jerami Grant.\nHornets: The Hornets have won three of their last four games at home. ... Williams has scored in double figures in 20 of his 24 games with the Hornets.\nNOEL INJURED\nNoel suffered a cut on his right eyelid in the second quarter and did not return to the game. Noel had been playing well for the 76ers with six double-doubles in his last eight games. He finished with two points and two rebounds in 10 minutes.\nCoach Brett Brown said Noel experienced blurry vision.\n\"It was clear he was not coming back in the game,\" Brown said. \"He got hit pretty good and his right eye is still swollen. No stitches. But you can see the cut.\"\nBrown said it's unclear if Noel will play Sunday against the Knicks.\nUP NEXT\n76ers: At New York on Sunday night.\nHornets: At Miami on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764992249.806606
}