{
  "game_id": "0022300405",
  "espn_id": "401585033",
  "date": "Dec 25, 2023",
  "matchup": "PHX vs. DAL",
  "headline": "Doncic scores 50 points to eclipse 10,000 for career, Mavericks beat Suns 128-114",
  "body": "PHOENIX -- — The Phoenix Suns ran double teams at Luka Doncic and the Dallas star picked them apart to set up easy baskets.\n\n\r\n              It was even worse when the Suns left Doncic in one-on-one coverage.\n\n\r\n              Luka Doncic scored 50 points to eclipse 10,000 for his career and had 15 assists, lifting the Dallas Mavericks to a 128-114 win over the Phoenix Suns on Monday night.\n\n\r\n              “He’s one of the best in the world,” Mavericks coach Jason Kidd said. “As I’ve always said, we can’t take him for granted. When he’s feeling it, you’re just trying to get him the ball as much as possible.”\n\n\r\n              They sure did against the Suns and Doncic made them pay for it.\n\n\r\n              Doncic capped a Christmas Day full of NBA games with a stellar performance, hitting 8 of 16 from 3 and all 12 of his free throws. He eclipsed 10,000 career points in the first quarter to reach the milestone in 358 career games, seventh fastest in NBA history. \n\n\r\n              The rest of the Mavericks chipped in when Doncic passed out of double teams.\n\n\r\n              Dereck Lively II had 20 points and 10 rebounds after missing four games with an ankle sprain and Tim Hardaway Jr. added 18 points in Dallas' ninth straight game without Kyrie Irving (heel).\n\n\r\n              After allowing Phoenix to take the lead, Dallas went on a 17-4 run midway through the fourth quarter and pulled away from there.\n\n\r\n              “That was a tough road game and outside of the 10K and 50 points, we won the game so I’m really happy,” Doncic said.\n\n\r\n              The Mavericks did their best to limit the effectiveness of Devin Booker and Kevin Durant, holding them to 25 combined shots.\n\n\r\n              With Phoenix's two stars surrounded by defenders all night, Chimezie Metu and Grayson Allen gave the Suns a lift off a bench that's been a weak spot at times this season. \n\n\r\n              Allen scored 19 of his 32 points in the third quarter to help the Suns rally from a 15-point deficit and went 8 of 17 from 3. Metu had 23 points and a career-high 19 rebounds with big man Jusuf Nurkic missing his second straight game due to personal reasons. \n\n\r\n              The Suns have lost nine of 11.\n\n\r\n              “We weren’t stopping them in the fourth, so we were taking the ball in the basket,” Suns coach Frank Vogel said. “Double teaming Luka, they were hurting us and when we weren’t doubling, he was hurting us as well and I think that took us out of our rhythm offensively some.”\n\n\r\n              Doncic had a 39-point triple-double in a win over San Antonio his last game and got off to a sizzling start in the desert.\n\n\r\n              He welcomed Lively back by setting him up with two easy baskets at the rim. Doncic started looking for his shot after that, scoring 17 points on 5-of-6 shooting in the first quarter to give the Mavericks a 36-24 lead.\n\n\r\n              Doncic returned in the second quarter to hit a step-back 3-pointer and found Derrick Jones Jr. for a soaring alley-oop. Doncic had 24 points and eight assists to give Dallas a 64-54 halftime lead.\n\n\r\n              The Suns were disjointed offensively most of the first half, missing 13 straight shots starting late in the first quarter. Phoenix kept Dallas within reach behind Metu's 13 points by getting to the line, hitting 12 of 14 free throws in the first half.\n\n\r\n              “I trust the players on this team,” said Booker, who had 20 points and 10 assists. “I’m throwing it to them every time, but the first half we were just missing them.”\n\n\r\n              The Suns had better ball movement to open the third quarter, using penetration to get open looks while cutting Dallas' lead to 75-71. Phoenix took the lead on Allen's 3-pointer and things got testy late in the third quarter when Dallas' Grant Williams pulled Booker by his jersey.\n\n\r\n              The Mavericks used their big run to go up eight and stretched it to 14 on Doncic's runner in the closing seconds to push him to 50 points, capping his special Christmas night.\n\n\r\n              UP NEXT\n\n\r\n              Dallas: Hosts Cleveland on Wednesday.\n\n\r\n              Phoenix: Plays at Houston on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996663.9398441
}