{
  "game_id": "0021901266",
  "espn_id": "401224741",
  "date": "Aug 05, 2020",
  "matchup": "TOR @ ORL",
  "headline": "Magic's Gordon hurt, Raptors continue to roll in 109-99 win",
  "body": "LAKE BUENA VISTA, Fla. --  Fred VanVleet had 21 points and 10 assists, and the Toronto Raptors held on to beat the Orlando Magic 109-99 on Wednesday night.\n\nPascal Siakam added 15 points and Kyle Lowry finished with eight points, nine rebounds and 10 assists.\n\nToronto (49-18) has won its last seven dating back to before the hiatus and three straight games since the restart.\n\nThe Magic (32-37) missed an opportunity to clinch a playoff spot following Washington's loss to Philadelphia earlier Wednesday. But they maintained their 7 1/2-game lead over the Wizards for the eighth seed with four seeding games to play.\n\nThey also may be without forward Aaron Gordon for an undetermined amount of time after he left the game in the third quarter with a left hamstring injury after taking a hard foul from Lowry.\n\nGordon was going up for a dunk and was hit on the arm as Lowry went to strip the ball. Gordon's left leg extended high in the air before he crashed to the floor and immediately reached for his left hamstring. He was able to shoot the ensuing free throws but then struggled to run down the court. He went to the locker room on the next timeout.\n\nLowry received a Flagrant 1 foul after a review by officials. Gordon had nine points and 11 rebounds at the time of his injury.\n\nEvan Fournier and Terrence Ross each had 15 points for Orlando.\n\nDespite Gordon's exit, the Magic cut into the Raptors' 20-point halftime lead, trimming it to 78-71 in the opening minute of the fourth quarter.\n\nBut that would be as close as they would get to rest of the way.\n\nThe Raptors spaced the floor well early, building a 24-8 lead in the opening period. They also were active on the defensive end, limiting Orlando to 5-of-20 shooting (0 for 9 from 3-point line). Orlando finished the quarter with 11 points, a season low by a Toronto opponent.\n\nToronto carried its momentum into the second quarter, taking a 51-30 lead late on the second of back-to-back 3-pointers by Lowry. The Raptors held a 55-35 advantage at halftime.\n\nTIP-INS\n\nRaptors: Patrick McCaw (left knee soreness) and Oshae Brissett (right knee soreness) both missed their third straight game.\n\nMagic: The 35 points they scored in the first half were a low for any half this season. . Michael Carter-Williams sat with a sore left foot.\n\nUP NEXT\n\nRaptors: Play Celtics on Friday.\n\nMagic: Play 76ers on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995576.0423172
}