{
  "game_id": "0022300593",
  "espn_id": "401585221",
  "date": "Jan 20, 2024",
  "matchup": "CHA vs. PHI",
  "headline": "Joel Embiid scores 33 points, 76ers beat Hornets 97-89 for 5th straight victory",
  "body": "CHARLOTTE, N.C. -- — Joel Embiid had 33 points to extend his franchise-record run of 30 or more to 20 games and the Philadelphia 76ers beat the Charlotte Hornets 97-89 on Saturday night for their fifth straight victory.\n\n\r\n              The reigning NBA MVP Embiid also had 10 rebounds. He was 11 of 23 from the field and made 11 of 12 free throws.\n\n\r\n              Tobias Harris added 21 points and Tyrese Maxey had 16 points and eight assists to help Philadelphia improve to 28-13. The 76ers — coming off a victory Friday night at Orlando — trailed by four entering the fourth quarter, then held the Hornets to 16 points in the final period.\n\n\r\n              Miles Bridges had 25 points and 11 rebounds for Charlotte. No. 2 overall pick Brandon Miller added 23. The Hornets are 9-31. \n\n\r\n              Embiid proved to be too much for a Charlotte team playing without top centers in Mark Williams and Nick Richards. Charlotte was forced to defend Embiid with P.J. Washington, who fouled out, and Nathan Mensah, creating a big size mismatch for the 76ers’ 7-foot, 280-pound center.\n\n\r\n              “We knew they were down guys and had a smaller team tonight, so we had to exploit those type of mismatches out there,” Harris said.\n\n\r\n              The Hornets were forced to double team Embiid most of the game.\n\n\r\n              “We just had to make the right play,” Harris said. “It was a pretty simple game plan for us. I thought in the fourth quarter we did a great job of executing it.”\n\n\r\n              Charlotte coach Steve Clifford felt the Hornets did a decent job on Embiid, considering he scored 42 points against them Dec. 16 and the team was without its own two 7-footers.\n\n\r\n              “I mean, he’s a brutal guy to defend,\" Clifford said. \"We did a lot better than we did last time.”\n\n\r\n              The Hornets played without LaMelo Ball, who sat out because of soreness in his right ankle after helping the Hornets beat San Antonio on Friday night. Terry Rozier had 19 points and nine assists at the point guard spot for Charlotte.\n\n\r\n              The Hornets led 73-69 after the third quarter, but the 76ers went on a 13-2 run to open the fourth with Embiid on the bench. Harris and Danuel House combined for 11 points during the stretch.\n\n\r\n              Embiid checked back into the game with 6:52 left with the 76ers up by four and they outscored the Hornets 15-9 the rest of the way. Embiid's fallaway jumper with 2:42 remaining put the 76ers up by 10 and they were never seriously threatened again.\n\n\r\n              The 76ers are in the midst of a stretch that includes seven of eight games on the road. So far, they're 2-0.\n\n\r\n              Philadelphia coach Nick Nurse was pleased with his team's defense in the fourth quarter, limiting the Hornets to 5-of-16 shooting from the field.\n\n\r\n              “You could notice the difference in our energy level in that last quarter,” Nurse said. \"I thought Tobias (Harris) really sparked us there as well, finally somebody was scoring and we got some transition buckets. I was happy with our loose ball recovery tonight, we started knocking a few guys diving on the floor picking them up, so it was not a thing of beauty but it was hard fought and the result is what we’re after.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host San Antonio on Monday night.\n\n\r\n              Hornets: At Minnesota on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995971.885321
}