{
  "game_id": "0022200298",
  "espn_id": "401468453",
  "date": "Nov 27, 2022",
  "matchup": "MIL vs. DAL",
  "headline": "Allen's hot start helps Bucks defeat Mavericks 124-115",
  "body": "MILWAUKEE -- — Grayson Allen's sizzling start for Milwaukee meant the Dallas Mavericks couldn't stop their recent cold spell.\n\n\r\n              Allen went 7 of 7 from 3-point range in the game's first 17 1/2 minutes, and the Bucks never trailed in a 124-115 victory Sunday night that sent the Mavericks to their fourth straight loss.\n\n\r\n              “The hoop looked huge,” Allen said.\n\n\r\n              Giannis Antetokounmpo led all scorers with 30 points as the Bucks shot 55.8% overall and went 17 of 37 from beyond the arc, matching a season high for 3-point baskets.\n\n\r\n              Allen was largely responsible for that 3-point barrage. He apparently got all of his misses out of the way before the game.\n\n\r\n              “I think my 10-minute shooting time pregame took like 13 or 14 minutes because I was missing so much,” Allen said. \n\n\r\n              Once the game started, Allen could do no wrong.\n\n\r\n              Allen's 7-of-7 start from beyond the arc tied his career high for 3-pointers in a game. Allen matched the highest total for made 3-pointers in a half without any misses over the last 25 seasons, according to ESPN Stats.\n\n\r\n              “He was on fire,” Mavericks coach Jason Kidd said. “We gave him a lot of great looks and he knocked them down. Giannis put pressure on the rim and we just couldn’t get to their shooters.”\n\n\r\n              Allen finished with a season-high 25 points while shooting 8 of 10 overall and 7 of 8 on 3-point attempts.\n\n\r\n              “He's not just a good shooter,” Antetokounmpo said. “If you're sleeping and you're being lazy, he's going to drive the ball, drive the close-out and go and dunk it. It just makes him dangerous. As much as they respect the 3, they've got to respect the drive also.\"\n\n\r\n              Dallas' Luka Doncic had 27 points, 12 assists and five rebounds, but he also committed a season-high six turnovers. Spencer Dinwiddie scored 22 points and Christian Wood added 21.\n\n\r\n              The Mavericks shot 51.3% but couldn't stop Antetokounmpo or any of the shooters surrounding him.\n\n\r\n              “It’s hard to go against a guy like that,” Doncic said of Antetokounmpo. “He’s the best player in the NBA right now.”\n\n\r\n              Dallas was playing for a second straight night after losing 105-100 at Toronto on Saturday.\n\n\r\n              Jrue Holiday scored 16 points for the Bucks, and Bobby Portis had 15. Antetokounmpo grabbed 11 rebounds and Portis added 10 boards as Milwaukee improved to 6-1 against Western Conference teams.\n\n\r\n              Milwaukee made its first seven shots of the night, including four from 3-point range. The Bucks led 73-62 at the break after posting their highest point total in any half this season. \n\n\r\n              Dallas cut the Bucks’ lead to 86-85 on Dinwiddie’s layup midway through the third quarter, but Jevon Carter responded with a 3-pointer that started a 10-0 run. Milwaukee scored 11 straight points early in the fourth quarter to extend its lead to 115-97. \n\n\r\n              “Certainly it’s one of the things we’ve talked about in the locker room, to kind of take a punch, steady ourselves and then finish it,” Bucks coach Mike Budenholzer said. \n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Reggie Bullock sat out as the Mavericks chose to rest him rather than having him play for a second straight night. Bullock has shot just 4 of 23 from 3-point range over his last five games. ... Tim Hardaway Jr. made his first start of the season.\n\n\r\n              Bucks: Pat Connaughton played his third game of the season after sitting out the Bucks' 117-102 victory over Cleveland Cavaliers on Friday due to a non-COVID-19 illness. Connaughton missed Milwaukee's first 15 games with a right calf strain. ... Khris Middleton was assigned to the NBA G League's Wisconsin Herd for a second time as the three-time All-Star works his way back from offseason wrist surgery. … The Bucks have been at home for 13 of their first 19 games this season. They’ll be on the road for 11 of their next 15 contests. \n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Hosts Golden State on Tuesday.\n\n\r\n              Bucks: At New York on Wednesday. The Bucks beat the Knicks at home 119-108 on Oct. 28.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994594.0575209
}