{
  "game_id": "0022200733",
  "espn_id": "401468888",
  "date": "Jan 26, 2023",
  "matchup": "CLE @ HOU",
  "headline": "Garland scores 26 as Cavaliers race past Rockets 113-95",
  "body": "HOUSTON -- — Darius Garland scored 26 points and Evan Mobley added 21 as the Cleveland Cavaliers routed the short-handed Houston Rockets 113-95 Thursday night despite missing Donovan Mitchell. \n\n\r\n              Garland, the fifth overall pick in the 2019 draft who turned 23 on Thursday, also had nine assists and four rebounds for the Cavs. \n\n\r\n              “Darius has continued to grow,” Cleveland coach J.B. Bickerstaff said. “This is a place where we’ve seen him grow the most is understanding the moment, understanding each game and how it’s different and what it takes from him to be a tone-setter.”\n\n\r\n              The Cavaliers led by 26 at halftime after scoring 74 points in the first two periods. The Rockets cut it to 22 on a basket by rookie Jabari Smith Jr. with 9½ minutes left in the third. But Cleveland scored the next 10 points, with 3s by Garland and Dean Wade, to extend the lead to 89-57 midway through the quarter.\n\n\r\n              “Everything has been that hunt for consistency,” Bickerstaff said. “We’ve had leads before and we get a little lax and loose with the ball and things like that. But I thought they had the right approach for the majority of the game tonight.”\n\n\r\n              The Rockets ended the quarter with an 11-3 run, with five points from rookie TyTy Washington, but they still trailed 97-74 entering the fourth. \n\n\r\n              Tari Eason opened the fourth with a tip-in shot for the Rockets before Garland and Cedi Osman made consecutive 3-pointers to push Cleveland’s advantage to 103-76.\n\n\r\n              The Cavaliers scored five straight points, capped by a 3 from Wade, to make it 111-89 with about 3 1/2 minutes left, and Cleveland's starters sat down after that. \n\n\r\n              Mitchell sat out for the fourth time in five games with a groin strain. He returned Tuesday night after missing three games, but aggravated it near the end of that game to keep him out Thursday. Mitchell, who ranks ninth in the NBA by averaging 28.3 points a game, was named a starter for the Eastern Conference in next month’s NBA All-Star Game.\n\n\r\n              Eason had 18 points and 11 rebounds to lead Houston. The Rockets were without Eric Gordon, Jae’Sean Tate and Kevin Porter Jr. as they lost their second straight since snapping a 13-game skid Monday night. \n\n\r\n              The Rockets, who have the NBA’s worst record at 11-38, committed 22 turnovers and made just five of 21 3-pointers. Jalen Green, the second overall pick in the 2021 draft, was 2 of 9 for six points after scoring a career-high 42 points in Houston’s win over Minnesota on Monday. \n\n\r\n              “They're one of the best defensive teams in the league, so the fact that they forced 22 turnovers wasn't super surprising since going in knowing we didn’t have three of our main guys who handle the basketball,\" Silas said. \n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Kevin Love sat out with back spasms. … Wade scored 15 off the bench. ... Jarrett Allen had 14 points and 10 rebounds. \n\n\r\n              Rockets: Gordon missed the game with right knee soreness. … Tate was out as part of injury management after returning from an ankle sprain. … Porter missed his eighth straight game with a bruised left foot. \n\n\r\n              ALL-STAR MITCHELL\n\n\r\n              In the wake of Mitchell's selection as an All-Star game starter, Bickerstaff raved about how he's approached his job in his first season in Cleveland after an off-season trade from Utah. \n\n\r\n              “I think it’s the respect piece and just a compliment to the job that he’s done,” Bickerstaff said. “To be able to come into a completely new environment and quite possibly have the best year so far in his career says a lot about him.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Oklahoma City on Friday night. \n\n\r\n              Rockets: Visit Detroit on Saturday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995239.94291
}