{
  "game_id": "0021800347",
  "espn_id": "401071028",
  "date": "Dec 03, 2018",
  "matchup": "TOR vs. DEN",
  "headline": "Jokic triple-double leads Nuggets past Raptors 106-103",
  "body": "TORONTO --  Nikola Jokic got his second triple-double of the season to help the injury-riddled Denver Nuggets overcome another key absence.\n\nJokic capped a big night with three free throws in the final seven seconds, Kyle Lowry missed a 3-pointer at the buzzer and the Nuggets survived the loss of leading scorer Gary Harris to beat the Toronto Raptors 106-103 on Monday night.\n\n\"To beat the number one team in the East means a lot to us,\" Jokic said.\n\nJokic made it 104-103 with a free throw with 7.0 seconds left, then hit two more foul shots with 5.6 seconds remaining before Lowry bounced a 26-footer off the rim.\n\nJokic had 23 points, 15 assists and 11 rebounds, Jamal Murray scored 21 points, and Malik Beasley and Juan Hernangomez each scored 15 points for Denver. The Nuggets won their sixth straight and halted Toronto's winning streak at eight.\n\n\"He does everything,\" Murray said of Jokic. \"He passes, rebounds, handles the ball. There's nothing he really can't do, except jump.\"\n\nRaptors coach Nick Nurse said he doesn't see much missing from Jokic's toolbox.\n\n\"I was kind of hoping we'd be able to disrupt him with a little bit more pressure,\" Nurse said. \"He just seemed to handle it. We worked hard on him, we tried to put him under some duress with the ball but it just didn't faze him.\"\n\nKawhi Leonard scored 27 points, Serge Ibaka had 15 and Pascal Siakam 14 for the Raptors.\n\nHarris scored three points in the opening quarter but did not play after the first because of a sore right hip. He came in averaging a team-high 17.3 points per game. Harris is expected to undergo an MRI on Tuesday before the Nuggets leave Toronto for Orlando, where they play Wednesday.\n\n\"Hopefully we can get him back really soon,\" coach Michael Malone said. \"Gary is such a big part of what we're trying to do, big loss.\"\n\nLowry returned after sitting out Saturday's loss at Cleveland because of an unspecified back injury, the first game he'd missed this season. He shot 1 for 7, missing 5 of 6 from 3-point range. Lowry left without speaking to reporters. Leonard was also unavailable because he was working out.\n\nToronto shot 11 for 41 from outside the arc.\n\n\"They wanted to win more than we did,\" Siakam said. \"We didn't bring the energy we usually have.\"\n\nThe game pitted Leonard, the Eastern Conference player of the week, against Denver's Paul Millsap, the Western Conference award winner.\n\n\"A win is a win, it doesn't matter who it's against, but it does mean a little bit more to win against a top team like the Raptors,\" Millsap said.\n\nThe Nuggets led 86-78 to begin the fourth, but Toronto tied it at 94 on Ibaka's dunk at 4:41.\n\nIbaka made a pair of free throws and Leonard drained a jump shot with 54 seconds left to put Toronto up 101-100, its first lead of the second half.\n\nJokic restored Denver's lead with 40 seconds remaining before Danny Green missed twice at the other end. Hernangomez was fouled grabbing the rebound on Green's second miss and made one of two from the free-throw line, but Leonard answered with a jumper, tying it 103-all with seven seconds left.\n\nTIP-INS\n\nNuggets: Jokic had seven assists in the first. His career high is 17, set Feb 15, 2018 at Milwaukee. ... Jokic has 18 career triple-doubles. ... Denver is 5-2 in games decided by three or fewer points.\n\nRaptors: Nurse was named NBA Coach of the Month for October and November. He's the fourth coach in Raptors history to win the award, joining Dwane Casey, Sam Mitchell and Lenny Wilkens. ... The last rookie coach to win the award was Luke Walton, who did so as interim head coach of the Golden State Warriors in November 2015. ... The Raptors shot 1 for 10 from 3-point range in the second. ... Lowry had 11 assists.\n\nSICK BAY\n\nDenver is also without long-term absentees G Will Barton (core muscle surgery), F Michael Porter Jr. (back surgery), G Isaiah Thomas (right hip surgery) and F Jarred Vanderbilt (right foot surgery).\n\nSECOND CHANCE SPREAD\n\nDenver outscored the Raptors 23-2 on second-chance points and had 15 offensive rebounds to Toronto's seven.\n\n\"It's tough,\" Nurse said. \"They're a good offensive rebounding team and they were chasing them down.\"\n\nUP NEXT\n\nNuggets: Visit Orlando on Wednesday night.\n\nRaptors: Host Philadelphia on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994281.8135219
}