{
  "game_id": "0022000519",
  "espn_id": "401267679",
  "date": "Feb 27, 2021",
  "matchup": "BKN vs. DAL",
  "headline": "Mavs end Nets' 8-game run as Porzingis returns, Irving sits",
  "body": "NEW YORK -- — With one star back for Dallas and another one sidelined for Brooklyn, the NBA's longest winning streak was halted rather easily.\n\n\r\n                    Luka Doncic scored 27 points, Kristaps Porzingis added 18 in his return from injury and the Mavericks snapped the Nets' eight-game run with a 115-98 victory Saturday night.\n\n\r\n                    James Harden had 29 points for the Nets, but only four after halftime while playing as Brooklyn's solo superstar with Kevin Durant and Kyrie Irving sidelined.\n\n\r\n                    “Obviously, they had two great players out but he’s an amazing player. It’s very tough to stop him,” Doncic said. “We did a great job in the second half. I think it was way better.” \n\n\r\n                    Durant missed his seventh straight game with a left hamstring strain and Irving rested his surgically repaired right shoulder. That took more than 56 points per game away from the NBA's highest-scoring team and Brooklyn managed just 34 points after halftime. \n\n\r\n                    “Look, I know they’re down a couple of superstars, but to hold them to 18 and 16 in the second half is pretty damn good,” Mavs coach Rick Carlisle said. \n\n\r\n                    Porzingis missed last three games with lower back tightness and shook off his rust after halftime to help Dallas break open the game. \n\n\r\n                    Leading by four at halftime, the Mavericks came out for the third quarter focused on throwing the ball inside to the 7-foot-3 Latvian, who has 7 inches on any starter in the Nets’ small-ball starting lineup. He responded with 10 points in the quarter, including a three-point play that capped an 11-2 spurt and pushed Dallas’ lead to 85-74.\n\n\r\n                    It became 91-76 when Dorian Finney-Smith blocked Harden’s shot to lead to Tim Hardaway Jr.’s basket. Dallas put it away with 12 straight points early in the fourth, making it 106-84 and soon after Harden was removed for good.\n\n\r\n                    “That second half we just didn’t have any legs,” Harden said. \n\n\r\n                    Jalen Brunson scored 14 points for the Mavericks, who split games against the East's top teams after losing at Philadelphia on Thursday, when they committed a season-high 22 turnovers. They had only nine Saturday.\n\n\r\n                    Doncic and Harden each scored 15 points in the first quarter, but the Mavs gave more help to their point guard and led 38-26 after shooting 61%. Brooklyn cut it to 68-64 at halftime, when Harden had 25.\n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Doncic turns 22 on Sunday. He had seven assists and six rebounds. ... Hardaway had 13 points.\n\n\r\n                    Nets: It was a historically late night in Brooklyn for the NBA's Saturday night game of the week. The Nets said that going back 30 years — as far as Elias has tracked game time records — it was the first time they tipped off a home game at 8:30 p.m. EST or later. ... Brooklyn had won nine straight against West teams.\n\n\r\n                    IRVING'S INJURY\n\n\r\n                    Coach Steve Nash said he didn't believe Irving's injury was serious, calling it a maintenance issue. It's the second game Irving has sat out to rest the shoulder, which limited him to 20 games last season.\n\n\r\n                    “I would expect him to play next game and if not, I don’t think this is a thing that will linger into the All-Star break,” Nash said.\n\n\r\n                    NASH AND NOWITZKI\n\n\r\n                    Nash and Dirk Nowitzki, former Mavericks stars who are close friends, were supposed to attend the BNP Paribas Open tennis tournament in Indian Wells, California, together with their families last March. Nash was already in California because Nowitzki canceled his trip and the tournament became the first major sports event called off in the U.S. because of coronavirus concerns.\n\n\r\n                    “You could kind of sense it coming and it was one of those things I think where we all had that kind of disbelief that this was actually going to snowball into this, but here we are a year later and it’s more real than ever,” Nash said. “So tough, tough time for everyone. We’ve lost a lot of people and we’re not through this thing in the slightest yet.” \n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Visit Orlando on Monday night.\n\n\r\n                    Nets: Visit San Antonio, where they have lost 17 straight games, on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764997498.382498
}