{
  "game_id": "0022400597",
  "espn_id": "401705163",
  "date": "Jan 19, 2025",
  "matchup": "CHI @ POR",
  "headline": "Scoot Henderson scores 25 points, Trail Blazers beat Bulls 113-102 to end 5-game skid",
  "body": "PORTLAND, Ore. -- — Scoot Henderson had 25 points and the Portland Trail Blazers snapped five-game losing streak with a 113-102 victory over the Chicago Bulls on Sunday night. \n\n\r\n              Zach LaVine had 27 points for the Bulls. They have lost five straight. \n\n\r\n              Portland stretched its lead to 97-82 on Shaedon Sharpe's 3-pointer with 7:36 left. Patrick Williams' dunk got the Bulls within single digits at 110-102 with 1:26 left. Deni Avdija answered with a layup for Portland to end the threat. \n\n\r\n              Sharpe came off the bench for the Blazers after coach Chauncey Billups told him his defense needed to improve to return to a starting role. Sharpe finished with 23 points. \n\n\r\n              The Bulls led by as 15 points in the first half. Henderson made back-to-back 3-pointers that got the Blazers to 43-42. \n\n\r\n              Portland tied it at 45 on Jerami Grant's 3 and it was even at 53 going into the break. \n\n\r\n              Portland, playing the second of a back-to back, pulled ahead early in the second half, leading by as much as 65-57 on Avdija's 3-pointer. Ayo Dosunmu made a 3 for the Bulls that tied it at 75 but Chicago wasn't able to pull in front. \n\n\r\n              Avdija finished with 20 points and 12 rebounds. \n\n\r\n              Takeaways\r\n              Bulls: Lonzo Ball (right thigh contusion/injury management), Jevon Carter (illness) and Chris Duarte (personal reasons) were unavailable for the Bulls. \n\n\r\n              Trail Blazers: Anfernee Simons did not play for the Blazers because of a right elbow strain. But both Avdija (right ankle) and Deandre Ayton (lower back) were available. \n\n\r\n              Key moment\r\n              Henderson pulled down a defensive rebound and sprinted downcourt under pressure before passing it off to Sharpe for the layup, giving the Blazers an 87-77 lead going into the final quarter. \n\n\r\n              Key stat\r\n              Portland ended up a disappointing 1-4 on its homestand. \n\n\r\n              Up next\r\n              The Bulls are at the Los Angeles Clippers on Monday night. The Trail Blazers are at Miami on Tuesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997068.821169
}