{
  "game_id": "0022400774",
  "espn_id": "401705340",
  "date": "Feb 12, 2025",
  "matchup": "TOR vs. CLE",
  "headline": "East-leading Cavaliers rout Raptors 131-108 for 8th win in 9 games",
  "body": "TORONTO -- — Donovan Mitchell scored 21 points and the East-leading Cleveland Cavaliers beat the Toronto Raptors 131-108 on Wednesday night for their fourth straight victory and eighth in the last nine games.\n\n\r\n              Tempers flared at the final buzzer after Cleveland’s Tristan Thompson dunked with four seconds left. Toronto’s Scottie Barnes and Jamal Shead confronted Thompson near center court for an exchange of words.\n\n\r\n              De’Andre Hunter scored 18 points, Sam Merrill had 16 and Darius Garland 15 for the Cavaliers in the final game for both teams before the All-Star break. Jarrett Allen added 13 points and 10 rebounds and Evan Mobley had 12 points and 15 rebounds \n\n\r\n              Hunter’s 3-pointer with 5:19 left in the third put the Cavs up 95-56. The 39-point edge was Cleveland’s biggest of the game.\n\n\r\n              RJ Barrett scored 27 points for Toronto after missing four games while he was in the concussion protocol. Barnes had 16 points and 11 rebounds. The Raptors have lost five of six.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland completed a four-game season sweep of Toronto. Three of the four meetings were double-digit wins and the combined margin of victory was 73 points.\n\n\r\n              Raptors: Toronto trailed 68-43 at the intermission, its biggest halftime deficit of the season.\n\n\r\n              Key moment\r\n              Max Strus scored nine of his 14 points as Cleveland took control of the game with a 23-4 run midway through the first quarter. The Cavs led 41-17 after one.\n\n\r\n              Key stat\r\n               Cleveland improved to 19-6 on the road. Only Boston (22-6) has a better road record.\n\n\r\n              Up next\r\n              Cleveland is at Brooklyn on Feb. 20 in its first game following the break. The Raptors will host Miami on Feb. 21.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997610.413186
}