{
  "game_id": "0021700918",
  "espn_id": "400975664",
  "date": "Feb 28, 2018",
  "matchup": "MEM vs. PHX",
  "headline": "Booker, Jackson help Suns end skid with win over Grizzlies",
  "body": "MEMPHIS, Tenn. --  For the first time in a month, the Phoenix Suns were able to celebrate a win, this time at the expense of the equally-hapless Memphis Grizzlies.\n\nIn a game featuring two teams looking at the bottom of the standings instead of the top, Devin Booker scored 34 points, Josh Jackson added a career-best 29 and the Suns snapped a 10-game losing streak beating the Memphis Grizzlies 110-102 on Wednesday night.\n\nMeanwhile, the Grizzlies lost their 11th straight, going winless for February. Phoenix won for the first time since defeating the Dallas Mavericks 102-88 on Jan. 31. Elfrid Payton had 19 points and 10 assists for the Suns in the win over Memphis.\n\n\"I'm happy for the players, I really am,\" Phoenix interim coach Jay Triano said, later adding: \"It's nice for them to get rewarded with a win.\"\n\nThe smiles among the Suns were in contrast to the misery for Memphis, which continues to struggle. Marc Gasol led the Grizzlies with 22 points and 13 rebounds, while Andrew Harrison scored 20 points. Jarell Martin finished with 16 points.\n\nThe game featured two of the worst teams in the league, both entering with 10-game losing streaks and looking more at their draft position than any long-lost hope of the postseason. The Suns victory gave them 19 wins, one more than Memphis, but Phoenix has two more losses in the race to the bottom. Some statistics were reflective of both teams' troubles. Memphis committed 20 turnovers and shot 38 percent for the game, while the Suns had 16 miscues and connected on 46 percent.\n\nThe Grizzlies are not only losing, but really not getting close. They have lost their last four by an average of 17 points.\n\n\"We haven't really been on track all season,\" Harrison said. \"We've got to continue to play better.\"\n\nTIP-INS\n\nSuns: Veteran C Tyson Chandler sat out with back spasms, missing his sixth game in the last seven. .Jackson's previous season-high was 23 against Charlotte on Feb. 4. .Booker, Jackson and Payton combined for 82 of the Suns 110 points.\n\nGrizzlies: Last win was the Jan. 29, 120-109 victory over Phoenix. ... Matched their season-high 11 straight losses, the first time from Nov. 11-Dec. 2 . ... JaMychal Green recorded his fourth straight double-double with 12 points and 12 rebounds. .Harrison is averaging 17.6 points over the last five games.\n\nHISTORICAL MATCHUP\n\nThe game marked the sixth time in NBA history where two teams entered a game on double-digit losing streaks, according to STATS LLC. The Vancouver Grizzlies were the last winning team in such a situation, snapping a 13-game losing streak, 88-77, on Jan. 20, 1998 against the Denver Nuggets, who entered that game on a 20-game slide.\n\nFRUSTRATING FEBRUARY\n\nThe last time the Grizzlies recorded a winless full calendar month was when the Vancouver Grizzlies lost all 17 of their contests in March 1996 during the franchise's inaugural season. \"We should've won some of the games in the month of February,\" Gasol said. Interim coach J.B. Bickerstaff added: \"You go back and look through the month, we had opportunities to win games. We had games that came down to the stretch where we just weren't able to make enough plays.\"\n\nTURNOVER HEADACHES\n\nThe Grizzlies problems started almost immediately as Memphis committed six turnovers in the first 3 minutes. \"Turnovers got the best of us early,\" Bickerstaff said. \".I think we had nine turnovers in the first quarter, and some of those were careless turnovers.\"\n\nLAST WORD\n\nGasol on coping with the losses: \"Red wine helps at night.\"\n\nUP NEXT\n\nSuns: Host Oklahoma City on Friday\n\nGrizzlies: Entertain the Denver Nuggets on Friday\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992736.416696
}