{
  "game_id": "0022401060",
  "espn_id": "401705626",
  "date": "Mar 27, 2025",
  "matchup": "DAL @ ORL",
  "headline": "Hardy, Davis lead Mavericks past Magic 101-92",
  "body": "ORLANDO, Fla. -- — Jaden Hardy scored 22 points, Anthony Davis added 15 points and seven rebounds and the Dallas Mavericks beat the Orlando Magic 101-92 on Thursday night.\n\n\r\n              Paolo Banchero had 35 points and 10 rebounds for the Magic, who shot 5 of 30 from 3-point range. Franz Wagner added 20 points and nine rebounds.\n\n\r\n              Hardy came off the bench and made 5 of 6 3-point shots, three of them in a span of 90 seconds in the third quarter.\n\n\r\n              Brandon Williams and Max Christie, also off the Dallas bench, scored 14 and 12 points respectively. Klay Thompson also scored 12. \n\n\r\n              Takeaways\r\n              Mavericks: Davis, playing for only third time in 25 games since his trade from the Los Angeles Lakers on Feb. 2, exceeded his 24-28-minute restriction by 51 seconds to help Dallas win for only the fourth time in 14 games. The Mavs moved a half game ahead of Phoenix into 10th place in the Western Conference. \n\n\r\n              Magic: Entering the game with the same 35-38 record as the Mavericks, the Magic remained eighth in the Eastern Conference, losing for the seventh time in their last eight home games. Banchero scored 30 (or more) for the ninth time in 14 games, during which he has averaged 31.3 points on 52% shooting. \n\n\r\n              Key moment\r\n              With the Mavericks clinging to a six-point lead, a 3-pointer by Hardy took a wild bounce and dropped in with 1:53 remaining.\n\n\r\n              Key stats\r\n              The Mavericks shot 47.8% (11 for 23) from 3-point range to the Magic's 16.7%, and the Dallas bench scored 57 points to Orlando's 19.\n\n\r\n              Up next\r\n              The Mavericks take on the Bulls in Chicago and the Magic play host to the Kings on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997133.7281651
}