{
  "game_id": "0022200339",
  "espn_id": "401468494",
  "date": "Dec 03, 2022",
  "matchup": "MIL @ CHA",
  "headline": "Giannis-less Bucks cruise to 105-96 win over Hornets",
  "body": "CHARLOTTE, N.C. -- — Bobby Portis scored 20 points and the Milwaukee Bucks beat the Charlotte Hornets 105-96 on Saturday night, despite missing star forward Giannis Antetokounmpo.\n\n\r\n              “Everybody gives themselves up for the betterment of the team,” Portis said of Milwaukee’s depth. “Everybody sacrifices and works extremely hard on this team. There are no egos.”\n\n\r\n              Antetokounmpo, a two-time MVP, sat out with left knee soreness, one night after scoring 40 points in a home loss to the Los Angeles Lakers.\n\n\r\n              Jordan Nwora added 17 points and Brook Lopez and Jevon Carter each scored 14 for the Bucks.\n\n\r\n              Terry Rozier led the Hornets with 26 points. Jalen McDaniels scored 21 and Kelly Oubre Jr. 20 for Charlotte, which had its three-game home winning streak halted. Mason Plumlee finished with 13 points and 11 rebounds.\n\n\r\n              “We can’t win like that,” Oubre Jr. said of Charlotte’s 14 turnovers. “If we’re turning the ball over and the other team is capitalizing on those mistakes, that’s a recipe for disaster.”\n\n\r\n              McDaniels scored Charlotte’s first eight points in the second half, pulling the Hornets within 56-53. Milwaukee extended its lead to double digits (77-66) on a basket by Lopez in the third. \n\n\r\n              Both teams were playing the back end of back-to-back games. Both went 1-1, with Charlotte winning Friday against Washington, despite LaMelo Ball and Gordon Hayward missing time with injuries.\n\n\r\n              “You can’t fool players in this league,” Clifford said. “They know we need those guys back. … They also know when we’ve played well, we’ve won or given ourselves a chance to win.”\n\n\r\n              McDaniels made a layup that cut the lead to 95-89 with 3:18 left, but Charlotte couldn’t get closer.\n\n\r\n              “We called a few timeouts and coach told us, ‘We’re playing one-on-one, we’ve got to get back to moving the ball, set plays,’ McDaniels said. “I felt myself take a few bad shots … you’ve just got to limit them and just work on executing.”\n\n\r\n              BUCKS INJURIES\n\n\r\n              Milwaukee coach Mike Budenholzer has seen minutes pile up for Antetokounmpo and Jru Holiday, and the dings that come with that time. Both sat against Charlotte.\n\n\r\n              “With the quick turnaround and with the back-to-back, a little bit of an early game, and just taking into account the big picture,” Budenholzer said. “They’re probably not happy with me, but I think, hopefully, they know we’re always trying to think about the big picture and try to keep them as healthy and kind of durable for the entirety of the season.”\n\n\r\n              WATCHING OUT FOR PORTIS\n\n\r\n              The versatility forward Bobby Portis brought to Milwaukee’s short-handed lineup wasn’t lost on Hornets coach Steve Clifford.\n\n\r\n              “They’re playing him at the four, where he’s also a problem on the glass, he still goes in the post, and he can guard all those guys,” Clifford said. “He’s tough enough and physical enough to guard most five men, but he can also guard out on the perimeter. So, a lot of their schemes and stuff, he gives them good versatility on the defensive end.”\n\n\r\n              NOTES\n\n\r\n              Bucks: Jrue Holiday (left knee) missed the game. … Brook Lopez hit a 3-pointer at the first-quarter buzzer to give Milwaukee a 30-24 lead.\n\n\r\n              Hornets: Guard LaMelo Ball joined the team for pregame warmups, but missed his seventh consecutive game with a left ankle sprain. He has missed 20 games this season. … Charlotte had won its last three home games in which Rozier scored 20 or more points. He finished with 26 in the loss.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Orlando on Monday night.\n\n\r\n              Hornets: Host Los Angeles Clippers on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994904.8816268
}