{
  "game_id": "0022200246",
  "espn_id": "401468401",
  "date": "Nov 20, 2022",
  "matchup": "DEN @ DAL",
  "headline": "Rare buzzer-beater helps outmanned Nuggets beat Mavs 98-97",
  "body": "DALLAS -- — Denver coach Michael Malone was looking for any kind of help on a two-game swing through Dallas with two-time MVP Nikola Jokic and two other starters missing.\n\n\r\n              He probably didn't expect it to come from the replay center in New Jersey while the Nuggets were sitting in the locker room at halftime Sunday night. \n\n\r\n              Vlatko Cancar hit a buzzer-beater from beyond midcourt when the final 2 seconds of the first half were replayed after the break, and the outmanned Nuggets went on to beat the Mavericks 98-97.\n\n\r\n              The Nuggets went to the locker room thinking they were down seven on a buzzer-beating 3-pointer by Dallas star Luka Doncic that appeared to finish a 14-2 half-ending run for the Mavericks.\n\n\r\n              This two nights after Denver was blown out in Dallas, and again missing Jokic, Jamal Murray and Aaron Gordon with one of the replacements, Jeff Green, out for the night with a right knee injury.\n\n\r\n              Instead, Doncic's Slovenian countryman brought the Nuggets within a point, and the six-point swing paid off when Michael Porter Jr. hit the deciding 3-pointer with 55 seconds remaining in the game.\n\n\r\n              “Practice makes perfect,” Cancar said, emphasizing he tries such shots a lot in workouts. \n\n\r\n              A video review showed Doncic stepped out bounds before his second-quarter step-back 3, and since the teams were already off the court, the game had to be picked up from that point after the break.\n\n\r\n              Denver coach Michael Malone put Cancar in the game, and he hit the running 53-footer from near the right sideline after taking the inbound pass. Denver trailed 56-55 at halftime instead of 59-52.\n\n\r\n              “We call him half-court Vlatko,” Malone said. “That’s why I put him in. The guy is uncanny with his ability to make those shots. For him to do it in a game setting like tonight, I really felt like it changed the game.”\n\n\r\n              Bones Hyland scored a career-high 29 points, and Porter Jr. had 12 with his only made 3-pointer in five attempts providing the final scoring.\n\n\r\n              Josh Green had a career-high 23 points for Dallas, but his only miss on an 8-of-9 night, including 6 of 7 from 3, was from long range with the Mavericks leading by two in the final 70 seconds.\n\n\r\n              Doncic scored 22 with a miss on a long 3-pointer at the buzzer, securing an improbable split of the two games in Dallas for the Nuggets.\n\n\r\n              Doncic disagreed with the reversal on his bucket, and said Cancar's improbable shot didn't decide the game.\n\n\r\n              “I saw some videos,” Doncic said. “It doesn't seem like it even touched the line. My heel was up.”\n\n\r\n              The Mavericks were out of sorts in the third quarter after the strange sequence, going down by 10 before rallying in the closing minutes.\n\n\r\n              “We still have the lead,” coach Jason Kidd said. “We just came out flat in the third. They took advantage of that, took control of the game.”\n\n\r\n              Denver had lost its first two games without Jokic and Gordon. Murray missed both in Dallas after joining Jokic in the health and safety protocols. Gordon has been out with a non-COVID-19 illness.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Cancar had another buzzer-beating 3 in the first quarter of the first meeting. ... DeAndre Jordan had a season-high 17 rebounds. \n\n\r\n              Mavericks: F Maxi Kleber missed a third consecutive game with a lower back injury after he was upended onto his back in the previous game. ... Davis Bertans scored 12 of his 15 points in the second quarter, when he was 3 of 4 from 3-point range.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Detroit at home Tuesday. \n\n\r\n              Mavericks: A three-game trip starts Wednesday at Eastern Conference-leading Boston. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994730.8368042
}