{
  "game_id": "0021600938",
  "espn_id": "400900333",
  "date": "Mar 06, 2017",
  "matchup": "CHI @ DET",
  "headline": "Jackson's big second half lifts Pistons over Bulls, 109-95",
  "body": "AUBURN HILLS, Mich. --  This season has been a struggle for Reggie Jackson, the point guard in whom the Detroit Pistons have invested so much.\n\n\"At times, you start feeling sorry for yourself,\" Jackson said. \"You can't do that. You've just got to go out here and play -- good, bad or indifferent.\"\n\nJackson scored 24 of his 26 points in the second half -- making all 10 of his field goal attempts after halftime -- and Detroit pulled away down the stretch for a 109-95 victory over the Chicago Bulls on Monday night. The Pistons climbed into a tie for the No. 7 spot in the Eastern Conference with the Bulls, who were playing without the injured Dwyane Wade and Rajon Rondo.\n\nJackson's performance has been spotty this season, and at times backup Ish Smith has seemed like a better option late in games. But Jackson was instrumental in helping the Pistons take control in a game Monday that was tied at 79 after three quarters.\n\nAfterward, Jackson was reflective on a difficult season that began with knee problems that kept him out until December. He's been plagued by inconsistency since returning.\n\n\"I think what helped me for the most part was watching the team still play well. Throughout my struggles, they kept picking me up and find a way to get wins,\" he said. \"I just thank them.\"\n\nDetroit started the fourth with a 12-3 run and held Chicago to 16 points in the quarter. A hanging jumper by Jackson from near the elbow turned into a three-point play when he was fouled, and that gave the Pistons a 102-88 lead with 3:13 to play.\n\n\"We did get stagnant. We missed a couple of good looks early in the quarter that I thought affected us, but you've got to continue to play through it,\" Bulls coach Fred Hoiberg said.\n\nJimmy Butler scored 27 points for Chicago.\n\nDetroit trailed 26-14 after a lackluster first quarter, but the Pistons cut it to just four at halftime. Jackson scored Detroit's first eight points of the third quarter, including two 3-pointers.\n\nFOULING DRUMMOND\n\nDetroit's Andre Drummond went 4 of 8 on free throws, and Chicago fouled him plenty in the third quarter. One foul with 1:50 left in the quarter was initially announced as one shot plus possession for the Pistons. Then it was changed to a regular foul.\n\n\"I thought it was a very good tackle on Robin Lopez's part,\" Detroit coach Stan Van Gundy cracked. \"Good solid hit -- he had his head up, like they teach you, and wrapped him up. I thought that was a good, solid hit. ... I was tempted to try the same thing on Jimmy Butler and see if the interpretation was the same.\"\n\nTIP-INS\n\nBulls: Wade was out with a left quadriceps strain, and Rondo with a right ankle sprain. Paul Zipser took Wade's spot in the starting backcourt, making his sixth start of the season. Zipser scored four points.\n\nPistons: Tobias Harris surpassed the 5,000-point milestone for his career. He scored 13 points and now has 5,004.\n\nPOOR FINISH\n\nThe Bulls managed only 30 points in the second half in a 101-91 loss to the Los Angeles Clippers on Saturday. Monday wasn't much better toward the end.\n\n\"We've just got to lock in on the offensive end as well as on the defensive end,\" Butler said. \"We just have to figure out a way to get stops throughout the game, but definitely in the fourth, because in the fourth, if a team starts to pull away like that, it's hard to come back.\"\n\nLOOKING BACK\n\nThis was Chicago's last scheduled visit to The Palace, with the Pistons set to move downtown next season. Former Pistons Bill Laimbeer and Rick Mahorn were on hand for a halftime ceremony in which they had a chance to share memories with the crowd.\n\nUP NEXT\n\nBulls: Visit the Orlando Magic on Wednesday night. Chicago won its first two meetings with the Magic this season.\n\nPistons: Visit the Indiana Pacers on Wednesday night. The Pistons are 1-2 against Indiana.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764995029.2441542
}