{
  "game_id": "0022000597",
  "espn_id": "401307381",
  "date": "Mar 14, 2021",
  "matchup": "ATL vs. CLE",
  "headline": "Collins, Gallinari lead streaking Hawks past Cavs, 100-82",
  "body": "ATLANTA -- — John Collins scored 22 points, Danilo Gallinari had 20, including a 3-pointer that helped Atlanta extend its lead in the fourth quarter, and the Hawks beat the Cleveland Cavaliers 100-82 on Sunday night for their fifth consecutive win under interim coach Nate McMillan.\n\n\r\n                    The Hawks have their first five-game winning streak in more than four years.\n\n\r\n                    McMillan said the Hawks are learning to finish games, including against Cleveland. The Hawks lost close games in the first two meetings of the season.\n\n\r\n                    “We continue to show growth,\" McMillan said. “We continue to understand how to finish, how to win these games and play in the fourth quarter.\"\n\n\r\n                    The Hawks led only 69-66 before opening the final quarter with 12 consecutive points to stretch the advantage to 15 points. Gallinari's 3-pointer during the run gave Atlanta its first double-digits lead at 77-66.\n\n\r\n                    “When you win a couple of close games, three or four in a row, it gives you confidence to keep doing that,\" Gallinari said. “... You’ve got to believe you can do it every night.\"\n\n\r\n                    Gallinari said it's too soon to say the Hawks, still one game under .500 at 19-20, are playing like a team ready to have success in the playoffs.\n\n\r\n                    “It's still a long process and a long season,\" Gallinari said. “When you think about the strides we’ve made since the start of the season ... the fact we’ve been winning those close games we were losing at the start of the season is a huge step.\"\n\n\r\n                    Collins set a season high with 13 rebounds. Trae Young scored 14 points.\n\n\r\n                    Collin Sexton had 15 points for the Cavaliers, who have a three-game losing streak. Darius Garland added 11 points.\n\n\r\n                    Cavaliers forward Kevin Love, making only his second start after missing 33 games with a right calf strain, played only two minutes and didn't attempt a shot. The Cavaliers reported Love “didn't feel right” and didn't want to risk a setback.\n\n\r\n                    “When a guy leaves that early in the game, it’s always concerning,\" Cavaliers coach B.J. Bickerstaff said.\n\n\r\n                    Love played 10 minutes and scored four points in his return, a 116-82 loss at New Orleans on Friday night.\n\n\r\n                    Forward Larry Nance Jr., who also returned against New Orleans after missing 12 games with a left hand injury, had four points in 26 minutes.\n\n\r\n                    The Hawks led 49-46 at halftime and kept that margin into the fourth.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Garland (groin) returned after missing Friday's loss to New Orleans. ... Rookie Isaac Okoro was drawn into two fouls in the first four minutes, each from Young's fakes on jumpers, and was shaking his head as he walked to the bench. Okoro finished with three fouls and scored six points. ... F Taurean Prince (sprained left shoulder) did not play.\n\n\r\n                    Hawks: Atlanta's last five-game winning streak came in the 2016-17 season, from Dec. 28, 2016 to Jan. 10, 2017. ... Atlanta ended Cleveland's streak of four consecutive wins in the series, including the first two games of the three-game season series. ... The Hawks continue to play without forwards De’Andre Hunter (right knee surgery) and Cam Reddish (right Achilles).\n\n\r\n                    KNIGHT SHINES\n\n\r\n                    Atlanta rookie center Nathan Knight, playing on a two-way contract, seized an unusual opening for playing time to set career highs with 16 points and nine rebounds. Centers Clint Capela (left heel pain) and Onyeka Okongwu (right adductor soreness) were held out on the second game of a back-to-back.\n\n\r\n                    Even without Capela, the NBA's rebounding leader, the Hawks claimed a 48-34 advantage on the boards.\n\n\r\n                    CHARITY DISPARITY\n\n\r\n                    Atlanta outscored Cleveland 24-10 from the free-throw line. The Hawks made 24 of 26 free throws. The Cavaliers made only 12 of 23, including 5 of 12 by center Jarrett Allen.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: At Miami on Tuesday night.\n\n\r\n                    Hawks: At Houston on Tuesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997640.5717728
}