{
  "game_id": "0021800360",
  "espn_id": "401071041",
  "date": "Dec 05, 2018",
  "matchup": "MEM vs. LAC",
  "headline": "Conley, Green lead Grizzlies past Clippers 96-86",
  "body": "MEMPHIS, Tenn. --  Mike Conley and the Memphis Grizzlies gave the Los Angeles Clippers a taste of how tough they can be on defense.\n\nThe Grizzlies held Los Angeles to 34 percent shooting, caused 19 turnovers and limited the Clippers to a season-low in points in a 96-86 win Wednesday night.\n\n\"That's been the answer for years for us,\" Conley said of the defense. \"Regardless of what we do on the offensive end, we give ourselves a chance to win every night with the defensive performances we get from each individual guy.\"\n\nConley led Memphis with 22 points, while JaMychal Green had 19 points and 11 rebounds as the Grizzlies pulled away in the fourth quarter.\n\n\"We got the game won by playing defense and moving the ball as a team,\" Green said.\n\nBoban Marjanovic led the Clippers with a season-high 19 points, while Danilo Gallinari added 17 points. Shai Gilgeous-Alexander and Lou Williams contributed 12 points apiece, with Williams hit 2 of 8 shots.\n\n\"It was the Grizzlies,\" coach Doc Rivers said of the poor shooting. \"They just defended us well. This is the first night that I can say that we got our butts kicked.\"\n\nDespite the shooting woes, the Clippers were within 75-74 with just under nine minutes left, but Memphis rattled off eight straight points for an 83-74 lead, ending Los Angeles' hopes.\n\nThe Clippers endured terrible first-half shooting, converting only 27 percent from the field, including 3 of 12 from outside the arc. That allowed Memphis to lead by as many as 15 in the second quarter before holding a 51-42 lead at the break.\n\nDespite the second-half push, Memphis was the one that imposed its will and pace in the game.\n\n\"We turned the ball over, just bad turnovers,\" Rivers said. \"We couldn't even run a 4-on-1 break.\"\n\nTIP-INS\n\nClippers: Tobias Harris missed all 10 of his shots through three quarters before connecting on a 3-pointer early in the fourth. \"I had shots that I normally make, and they just didn't fall,\" he said. ... Gallinari, among the league-leaders in free throw percentage, missed consecutive foul shots in the third and was 4 of 8 for the game. ... Montrezl Harrell had eight points, ending his streak of 13 straight games scoring at least 14 points off the bench.\n\nGrizzlies: Conley or Marc Gasol have led the Grizzlies in scoring in 12 of the last 13 games. .Kyle Anderson had six assists, one short of his season-best. .The 19 points and 11 rebounds were Green's first double-double of the season.\n\nWELCOME NOAH\n\nJoakim Noah played his first game since signing with the Grizzlies earlier this week after he was released by the Knicks at the start of the season. Noah played 13 minutes and scored four points.\n\nGrizzlies players said he brought an energy to the team in his first practice Tuesday.\n\n\"He came to practice yesterday giving us a spark,\" Green said.\n\nConley added: \"It was fun playing alongside him for once because I've always been the recipient of all his screens. Now, that's a tool for me.\"\n\nAs for Noah, he was low-key in his comments.\n\n\"I'm really happy,\" Noah said. \"I don't expect anything anymore. I've been in this league for a while now, and sometimes you kind of take it for granted.\"\n\nUP NEXT\n\nClippers: Host Miami on Saturday.\n\nGrizzlies: Play at New Orleans on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994941.0460212
}