{
  "game_id": "0021700507",
  "espn_id": "400975253",
  "date": "Dec 27, 2017",
  "matchup": "DAL @ IND",
  "headline": "Nowitzki, Mavericks beat Pacers to end eight-game road skid",
  "body": "INDIANAPOLIS --  The Dallas Mavericks finally have another road win.\n\nDirk Nowitzki scored 15 points, Harrison Barnes made the tiebreaking free throw with 37.7 seconds left and the Mavericks snapped an eight-game road losing streak with a 98-94 victory over the Indiana Pacers on Wednesday night.\n\nNowitzki, the franchise's career leading scorer in his 20th season, scored six points in the final quarter to help the Mavericks rally for their third win in 17 road games.\n\n\"I'm real happy for the guys with the way the season's gone. It's been a tough go,\" Mavs coach Rick Carlisle said. \"This group has a ton of character and a lot of fight. It's the first time we've won consecutive back-to-back games, which is a big deal. So, we want to try to take this momentum and continue it.\"\n\nBarnes and Yogi Ferrell each scored 13 points. Ferrell, an Indianapolis native, hit a key 3-pointer to take a four-point lead with 2:09 remaining.\n\nThe Pacers led 90-84 with 5 minutes remaining.\n\n\"We never got down on ourselves, especially in the first half when they were shooting the heck out of the ball,\" Ferrell said. \"We just brought it right back at them and tried to score and in the second half we just wanted to make it a lot harder for them to make shots.\"\n\nLance Stephenson, Myles Turner and Darren Collison had 16 points apiece for the Pacers, who played without injured leading scorer Victor Oladipo for the first time and struggled down the stretch.\n\n\"We were right there,\" Stephenson said. \"I'm not going to say (the loss) was because (Oladipo) was out. We were right there.\"\n\nStephenson's layup tied it at 94, but he committed a costly turnover on the Pacers' next possession with 28 seconds remaining that the Mavericks converted into an uncontested layup.\n\n\"We just couldn't get shots that we needed down the stretch to convert,\" Collison said.\n\nThe Mavericks rallied from an early seven-point deficit as reserve center Dwight Powell scored 11 first-half points. The visitors led for much of the third quarter before the Pacers surged behind Bojan Bogdanovic and Turner to take a 74-71 lead entering the final quarter.\n\nTIP-INS\n\nMavericks: Nowitzki is expected to make his 14,000th start Friday. He's sixth on the career wins list at 886 and is 14 free throws behind Hall of Famer Jerry West for sixth on that list. ... Ten of the Mavs' 11 wins have come when they've limited an opponent to fewer than 100 points.\n\nPacers: The NBA leaders in 3-point percentage (.387) were 10-0 at home when hitting at least 10 3-pointers and 15-3 overall, but made 10 of 25 and lost. ... Reserve forward Domantas Sabonis was questionable with a sore left big toe, but played in his normal rotation. ... Reserve guard Joe Young sank two 3-pointers in the first half. He had made just two in 18 previous games this season.\n\nNO OLADIPO\n\nOladipo missed his first game of the season to rest a sore right knee. The league's eighth-leading scorer (24.9 ppg) scored a season-low 13 points in Tuesday's 107-83 loss at Detroit. Oladipo had started each of the Pacers' 33 games.\n\nMOVING ON UP\n\nMavericks coach Rick Carlisle, who coached the Pacers for three seasons through 2006-07, needs two wins to tie John MacLeod for 17th place on the league's career list. He has a record of 705-545, which includes 181-147 while with the Pacers. He won his 700th career game on Dec. 2.\n\nNEXT UP\n\nMavericks: Visit New Orleans on Friday.\n\nPacers: Visit Chicago on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993956.542325
}