{
  "game_id": "0021500286",
  "espn_id": "400828173",
  "date": "Dec 04, 2015",
  "matchup": "LAL @ ATL",
  "headline": "Horford, Hawks spoil Bryant's last game in Atlanta",
  "body": "ATLANTA --  Kobe Bryant wanted to give his Atlanta fans one last epic performance.\n\nThe retiring NBA star had to settle for average instead.\n\n\"We played well, came out in the second half and competed well and got within striking distance,\" Bryant said. \"Unfortunately, the game slipped away from us in the last three minutes.\"\n\nAl Horford scored 16 points, Paul Millsap and Kent Bazemore each added 15 and the Hawks beat the Los Angeles Lakers 100-87 Friday night to spoil Bryant's last game in Atlanta.\n\nIn the third game since announcing his retirement plans earlier this week, Bryant scored 14 points on 4-for-19 shooting. Lou Williams topped the struggling Lakers, who never led, with 18 points.\n\nBryant showed a few flashes of his once-dominant skills, holding up three fingers on each hand after hitting consecutive 3-pointers to bring the loudest cheers of the night from the capacity Philips Arena crowd midway through the third.\n\nThe second basket cut the lead to seven, and the Lakers pulled within four with 5:59 left in the game when Bryant assisted on Williams' 3.\n\nAfter the game ended, Bryant walked to midcourt to give a smile and a hug to Kyle Korver, a 13th-year veteran, in an exchange of mutual admiration.\n\n\"It's fun to get out there and play,\" Bryant said. \"Even though my body is sore, this moment is not coming again. Pulling up to the arena, getting ready for the game. It's not going to happen again. Walking down the tunnel and so forth. It's important to enjoy these moments as much as possible.\"\n\nThe game's outcome was hardly unexpected given Bryant's age and the state of his underperforming team, but Hawks coach Mike Budenholzer still showed respect by putting his best defender, Thabo Sefolosha, on the 17-time All-Star.\n\nBryant struggled much of the night to get separation on the perimeter, but his pull-up jumper in the lane over Sefolosha cut the lead to 87-83 with 4:46 to go.\n\nHe showed his age on the next sequence as Sefolosha blocked a shot out of bounds and was defending the arc when Bryant tossed up an air ball from the right side.\n\nD'Angelo Russell had 16 points and 10 assists for the Lakers, who dropped to 3-16, worst in the Western Conference and second-worst overall.\n\nMike Scott scored 14 points and Jeff Teague added 13 for Atlanta, which improved to 13-9 and has the next five days off.\n\nBudenholzer talked about the special aura of the night before the game to make sure his players were prepared for a Kobe lovefest.\n\n\"You kind of accept it,\" Horford said. \"We briefly addressed it before the game. We said we'll go out there and play our game and that's what we did.\"\n\nSHOW OF RESPECT\n\nThe Hawks showed a brief video tribute of Bryant before start of the second quarter. The five-time NBA champion smiled and waved to the capacity crowd, but did not watch the one-minute segment. Hawks legend Dominique Wilkins said, \"I'll see you in the Hall\" during the tribute.\n\nSURPRISE FOR SCOTT\n\nLakers coach Byron Scott said before the game that Bryant first told him of retirement plans before the start of the third quarter last Saturday at Portland. Scott didn't exactly have an easy time blocking out the news with his team on the court in the second half.\n\n\"It was probably the weirdest game I've ever coached,\" Scott said.\n\nTIP-INS\n\nLakers: Williams, a former Hawk who grew up in the Atlanta suburbs, drew plenty of cheers through the night.\n\nHawks: Teague handed out five assists to pass Wilkins on the franchise career list. ... Atlanta finished with 24 assists, one less than their season average that ranks second in the NBA.\n\nUP NEXT\n\nLakers: Visit Detroit on Sunday.\n\nHawks: Visit Denver on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994304.109023
}