{
  "game_id": "0022200373",
  "espn_id": "401468528",
  "date": "Dec 07, 2022",
  "matchup": "PHX vs. BOS",
  "headline": "Tatum, Brown lead Celtics to easy 125-98 win over Suns",
  "body": "PHOENIX -- — The hardest task these days for the Boston Celtics might be staying humble.\n\n\r\n              Jayson Tatum and Jaylen Brown each scored 25 points, Malcolm Brogdon added 16 off the bench and the rolling Celtics embarrassed the sloppy Phoenix Suns 125-98 on Wednesday night.\n\n\r\n              “You enjoy the moment, but you've got to understand why you did it,” Celtics coach Joe Mazzulla said. “Then you've got to know that it's a long year. This could happen to us. It might not, but we're going to go through some type of obstacles throughout the year.”\n\n\r\n              For now, the Celtics are making it look easy.\n\n\r\n              Boston won for the eighth time in nine games, improving its NBA-best record to 21-5. The Suns — who came into the game with the best record in a crowded Western Conference race — lost for the third time in four games. \n\n\r\n              Tatum said that after a couple rough trips to Phoenix over the past couple years that ended in losses, there was a particular emphasis on this game.\n\n\r\n              “We remembered that,” Tatum said. “That was fresh on our minds. We wanted a different outcome.”\n\n\r\n              The expected showdown between two of the league's top teams never materialized with the Celtics leading by 45 points. The Celtics took a 31-21 lead after one quarter over the cold-shooting Suns, who missed all eight of their 3-point attempts.\n\n\r\n              It only got worse for Phoenix.\n\n\r\n              “We didn’t compete the way we needed to compete tonight,” Suns center Deandre Ayton said. \n\n\r\n              Boston continued to build its lead in the second, taking a 69-42 lead into the break. Brown led the Celtics with 17 points in the first half, while Tatum had 14. Grant Williams and Brogdon both added 12.\n\n\r\n              “Phoenix is a great team and I thought the way we played showed the respect we had for them,” Mazzulla said.\n\n\r\n              The second half was essentially an afterthought. Tatum hit a free throw with 7:01 left in the third to push Boston's advantage to 40.\n\n\r\n              Phoenix's night was summed up in the third quarter when Mikal Bridges, Chris Paul and Devin Booker all tried to grab a loose ball, only to collectively bobble it away into the hands of Boston's Marcus Smart, who scored an easy layup.\n\n\r\n              “It feels like that game should count as two losses, but the good thing is it is still only one,” Booker said. \n\n\r\n              Later, the three-time All-Star added: “You can’t blame scheme, you can’t blame rotation or anything on coach. We have to look at the mirror as a team and we have to fix it.”\n\n\r\n              The Suns welcomed back Paul, who missed the past 14 games with a sore right heel. That's good news for the team's long-term prognosis, but having the 12-time All-Star on the court didn't help much on Wednesday. \n\n\r\n              Josh Okogie led the Suns with a career-high 28 points off the bench, while Booker added 17. Paul finished with four points, four rebounds and four assists in 24 minutes.\n\n\r\n              The Celtics have another big game ahead of them on Saturday, when they travel to face the Warriors. Boston lost to Golden State in six games in the Finals last season.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: F Al Horford missed the game after entering the league's health and safety protocol ... Brogdon returned after missing one game because of a non-COVID illness. ... Luke Kornet had 12 points on 6 of 6 shooting. Grant Williams also made all six of his shots and finished with 14 points.\n\n\r\n              Suns: F Torrey Craig (right groin) was back in the starting lineup after missing three games. ... Hosted a sellout crowd for the 41st consecutive game. ... Shot just 8 of 32 (25%) from 3-point range. ... Okogie made 8 of 14 shots, including 4 of 6 from 3-point range.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Golden State on Saturday night.\n\n\r\n              Suns: At New Orleans on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995086.989287
}