{
  "game_id": "0021800542",
  "espn_id": "401071218",
  "date": "Dec 31, 2018",
  "matchup": "ATL @ IND",
  "headline": "Pacers beat Hawks 116-108 for 5th consecutive victory",
  "body": "INDIANAPOLIS --  Myles Turner provided the Indiana Pacers with a more physical presence over the past month.\n\nThey're hoping he keeps it up -- with a revamped look.\n\nTurner scored 20 points, grabbed eight rebounds and blocked four shots in less than 24 minutes Monday, helping to lead the Indiana Pacers past Atlanta 116-108 before breaking his nose midway through the third quarter.\n\n\"Luckily it wasn't anything major,\" All-Star guard Victor Oladipo said after scoring 22 points. \"He'll be back. He'll be fine. He'll be all right with the mask but he's going to have to get used to it.\"\n\nTurner departed with 4:44 left in the third quarter and did not return.\n\nWhile his status for Friday's game, at Chicago, remains uncertain there's little doubt Turner had been playing the best basketball of his four-year career. His scoring had increased, his rebounding became more consistent and after finishing third in blocks each of the past two years, Turner had moved into the NBA lead.\n\nHe helped the Pacers weather Oladipo's 11-game absence and has played a key role in a seven-game winning streak that ended in mid-December and the five-game streak Indiana is currently on.\n\nIf there is good news, though, it's this: Oladipo may have delivered his most complete game since returning from a knee injury Dec. 12, and the Pacers have a solid supporting cast.\n\nOladipo was 9 of 19 from the field, had four rebounds and seven assists and four steals. Domantas Sabonis, Turner's replacement, wound up with 20 points and eight rebounds as Indiana became the third NBA team to record 25 wins this season.\n\n\"We're confident, we just have to keep the confidence rolling,\" Turner said, downplaying the injury. \"Just keep being ourselves, don't try to do too much and keep our defensive efforts high.\"\n\nAtlanta was led by John Collins finished with 22 points and 16 rebounds while rookie Kevin Huerter scored 22 points and made six 3-pointers, both season highs. The Hawks have lost only two of their last seven, both to Indiana in the last week.\n\nTurner's 3-pointer at the end of the half broke a 60-60 tie and Indiana opened the second half with back-to-back baskets to take a 67-60 lead.\n\nThey started pulling away when Turner and Bojan Bogdanovic made consecutive 3s to extend the lead to 87-76 and appeared to seal the victory by scoring the final eight points of the quarter to make it 97-81.\n\nInstead, Atlanta steadily cut the deficit and got as close as 114-108 but didn't score another point against the league's top defense.\n\n\"We get it to a two-possession game, we just picked the wrong time to turn the ball over,\" Hawks coach Lloyd Pierce said. \"We struggled to execute down the stretch and didn't give ourselves the opportunity to make shots.\"\n\nTIP-INS\n\nHawks: All three of Atlanta's losses to Indiana this season have come by eight points. ... The Hawks have lost five straight at Indianapolis with their last win coming 23, 2016. ... Daniel Hamilton scored eight points in place of the injured Kent Bazemore. ... Collins has six straight double-doubles. ... Alex Len had 19 points and seven rebounds while Trae Young had 16 points and seven assists. ... The Hawks had a 53-39 rebounding advantage.\n\nPacers: Finished the calendar year as the NBA's only team that did not lose three straight games. ... Indiana is 19-5 against Eastern Conference teams and 11-2 at home against the East. ... The Pacers have won 12 of their last 14 with all each of those wins coming by six or more points. ... It marked the first time this season the Pacers had three players score 20 at least points in the same game this season. ... Bogdanovic scored 16 points, extending his streak of consecutive double-figure games to 28.\n\nSHORT-HANDED HAWKS\n\nBazemore is expected to miss at least two weeks with a sprained right ankle. He was injured during the third quarter of Saturday's victory over Cleveland.\n\nAtlanta also played without center Dewayne Dedmon, who has a sore left knee.\n\n\"It's been described to me as similar to tendinitis in the knee,\" Pierce said.\n\nUP NEXT\n\nHawks: Make their second stop on a three-game road trip Wednesday at Washington.\n\nPacers: Head to Chicago on Friday, seeking their fourth straight win in the series.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995365.468701
}