{
  "game_id": "0021800025",
  "espn_id": "401070709",
  "date": "Oct 19, 2018",
  "matchup": "OKC @ LAC",
  "headline": "Clippers beat Thunder 108-92 for 1st win of season",
  "body": "LOS ANGELES --  These new-look Clippers like each other.\n\nWith stars Blake Griffin, Chris Paul and DeAndre Jordan cleared out, Los Angeles is looking to compete with a mix of veterans and youngsters who came together to earn their first win of the season.\n\nDanilo Gallinari and Tobias Harris scored 26 points each and the Clippers rallied in the fourth quarter for a 108-92 victory over the Oklahoma City Thunder on Friday night.\n\n\"They just want to win and they're over themselves,\" Clippers coach Doc Rivers said.\n\nThe Thunder fell to 0-2 without Russell Westbrook, who has a right knee issue.\n\n\"He's missed everywhere,\" said guard Raymond Felton, who had 10 points off the bench.\n\nLou Williams, last season's Sixth Man of the Year, added 17 points off the bench. He hit a clutch 3-pointer to snap a 90-all tie and give the Clippers the lead for good midway through the fourth.\n\nThe Clippers outscored the Thunder 37-15 in the final quarter, when 7-foot-3 Boban Marjanovic scored 10 of his 13 points and Gallinari led the cheers from the bench.\n\n\"When you see the energy and the fans on our side, we were just having fun,\" Gallinari said.\n\nPaul George led the Thunder with 20 points before fouling out with 1:13 remaining in the game. He was 7 of 27 from the field in part because of the defense of Avery Bradley and Luc Mbah a Moute.\n\n\"They made it a hard night on George,\" Rivers said.\n\nSteven Adams had 17 points and 18 rebounds, including 12 on the defensive glass for the Thunder.\n\n\"We've got to execute better, we've got to run offense, and we're not going to be able just to rely on guys just trying to create and manufacture shots,\" Thunder coach Billy Donovan said. \"We have to do it together.\"\n\nThe Clippers led by 17 points in the first quarter. They were up by two at halftime before the Thunder took a nine-point lead in the third.\n\nLos Angeles opened the game on a 16-0 run while the Thunder missed their first six shots. But Oklahoma City never took the lead despite twice pulling into a tie.\n\nThe Thunder gained their first lead of the game, 49-48, on a 3-pointer by Patrick Patterson to start the third. George took over offensively for a stretch, highlighted by a 3-pointer in which he got fouled and made the free throw, that helped Oklahoma City lead by nine.\n\nTIP-INS\n\nThunder: Westbrook had only controlled contact at practice while he and the medical staff assess how his knee feels. ... George scored 27 points in an eight-point loss to defending champion Golden State in the opener.\n\nClippers: Rookie G Shai Gilgeous-Alexander had two points in following up his 11-point NBA debut against Denver. ... Without any stars, the team has replaced individual player photos with nighttime shots of the city along with one of hands raised in a team huddle to cover up the Lakers championship banners in Staples Center.\n\nGEORGE'S URGENCY\n\nWestbrook had an arthroscopic procedure to treat stiffness and inflammation in his knee on Sept. 12. He averaged 25.4 points, 10.1 rebounds and 10.3 assists last season.\n\nWhile he's gone George is putting some pressure on himself.\n\n\"I've still got to get this group ready to go,\" he said. \"I've got to get this group ready to win games regardless if Russ is out there or if Russ is not.\"\n\nMVP\n\nMarjanovic drew \"MVP\" chants in the fourth and it made the Serbian smile.\n\n\"Thank you for that but everybody knows it's not real,\" he said. \"It's fun because people support me.\"\n\nRivers laughed, too, noting similar chants had been heard in Toronto and Utah. \"It's Game 2,\" he said. \"It must be the new chant around the league. Early voting.\"\n\nUP NEXT\n\nThunder: Host Sacramento in their home opener on Sunday. The Thunder won three of the four meetings last season.\n\nClippers: Host Houston on Sunday in the return of Chris Paul, the Clippers' career assists leader.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994639.1977012
}