{
  "game_id": "0022401220",
  "espn_id": "401736814",
  "date": "Dec 15, 2024",
  "matchup": "LAL vs. MEM",
  "headline": "Anthony Davis scores 40 points, LeBron James has 18 in return to help Lakers beat Grizzlies, 116-110",
  "body": "LOS ANGELES -- — Anthony Davis had 40 points and 16 rebounds, LeBron James added 18 points in his return and the Los Angeles Lakers beat the Memphis Grizzlies 116-110 on Sunday night.\n\n\r\n              James also had eight rebounds, eight assists and five turnovers in 34 minutes after missing the previous two games because of a left foot injury. He was away from the team most of last week due to personal reasons.\n\n\r\n              Austin Reaves scored 19 points for Los Angeles. The Lakers never trailed and led by 23 points in the second half.\n\n\r\n              Jaren Jackson Jr. scored 25 points for Memphis, which had won four in a row. Ja Morant had 20 points, Zach Edey added 13 points and 10 rebounds and Luke Kennard had 12 points.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis entered as the NBA’s highest-scoring offense but trailed 64-46 at the half and was down by at least two possessions the entire second half.\n\n\r\n              Lakers: James’ return energized Los Angeles, but Davis continues to carry the team. The 31-year-old power forward had 22 points and 10 rebounds in the first half. He briefly left in the third quarter because of shoulder injury, then returned in the fourth and scored 12 critical points down the stretch.\n\n\r\n              Key moment\r\n              James scored his first points on a running one-handed dunk just over two minutes into the first quarter. He followed immediately with a block and added tip-in basket on the Lakers’ ensuing offensive possession to give Los Angeles a 9-2 lead.\n\n\r\n              Key stat\r\n              Davis has had at least 30 points and 10 rebounds in three of his last four games.\n\n\r\n              Up next\r\n              Both teams are back in action Thursday night. The Grizzlies host Golden State, and the Lakers are at Sacramento.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997197.399148
}