{
  "game_id": "0021801198",
  "espn_id": "401071871",
  "date": "Apr 07, 2019",
  "matchup": "CHA @ DET",
  "headline": "Walker-led Hornets top Pistons 104-91, holding playoff hopes",
  "body": "DETROIT --  Kemba Walker is keeping the Charlotte Hornets in the postseason picture\n\nWalker scored 20 of his 31 points in the first half to help Charlotte build a big lead and they went on to beat the Detroit Pistons 104-91 Sunday in a possibly pivotal game with just two games remaining in the regular season for the playoff-hopeful teams.\n\nThe Hornets (38-42) have won three straight to cling to their chances of rallying for a playoff spot in the Eastern Conference.\n\n\"I'm happy to still be playing for something,\" Walker said.\n\nThe Pistons have a lot at stake as well and yet they still seemed to lack effort at times, leading to some boos from their fans and criticism from at least one player.\n\n\"We didn't play for 48 minutes like we understood the implications and what this season is coming down to,\" Detroit star Blake Griffin said.\n\nDetroit (39-41) has lost four in a row to possibly plummet from being a sixth-seeded team to missing the postseason for a third consecutive year and the ninth time in a decade.\n\n\"Desperate, sense of urgency, whatever you want to call it, that's how we have to play,\" Griffin said. \"We can somewhat control our destiny these next two games.\"\n\nDetroit coach Dwane Casey said before the game his team had to slow down Walker.\n\nThe electric point guard is used to being the focus of opponents' game plans.\n\n\"I know that I'm the guy that every team is trying to stop,\" he said.\n\nAnd, the Pistons simply couldn't do it as Walker had 11 points in the first quarter and nine in the second, lifting the Hornets to a 60-42 lead.\n\n\"We lost that game in the first half,\" Casey said.\n\nWalker did take 29 shots, making just 11, but he also had seven assists and only one turnover.\n\n\"It all starts with Kemba as always,\" teammate Frank Kaminski said. \"He can make any play out of the pick and roll.\"\n\nKaminski took advantage of the open shots Walker created, scoring a season-high 24 points and making three 3-pointers.\n\n\"Frank changed the game himself because of his range,\" Walker said.\n\nCharlotte's Jeremy Lamb had 17 points off the bench, Dwayne Bacon had 14 points and rookie Miles Bridges added 10 points.\n\nDetroit was led by reserve point guard Ish Smith, who scored 20 points, for a team struggling offensively. Griffin had 16 points on 5 of 18 shooting, hobbling for much of the game. Andre Drummond had 15 points and 23 rebounds and Wayne Ellington scored 14 points.\n\nPLAYING HURT\n\nGriffin played with a relatively bulky brace protecting his left leg, which was covered by a white sleeve, but refused to make an excuse about his injury.\n\n\"Everybody's banged up,\" he said. \"It's our job to give everything we can.\"\n\nGriffin played with plenty of intensity, going to the floor more than once.\n\n\"One of the things I loved was Blake Griffin, playing on one leg, diving on the floor for loose balls,\" Casey said. \"He's obviously limited, but he's out there giving us everything he's got.\"\n\nTIP-INS\n\nHornets: Forward Michael Kidd-Gilchrist missed the game for personal reasons and forward Marvin Williams was out for a third straight game because of his injured right foot.\n\nPistons:  Drummond broke his own single-season franchise record with his 67th double-double and leads the league in the category. He had at least 20 rebounds for an 18th game, a total that leads the NBA.\n\nWELCOME BACK\n\nMany members of the 2004 NBA champions , including Chauncey Billups and coach Larry Brown, attended the game and were honored during timeouts and a halftime ceremony.\n\nSERIES SWEPT\n\nCharlotte won all four meetings against the Pistons for the first time since the 2013-14 season.\n\nUP NEXT\n\nHornets: Close regular season at Cleveland on Tuesday and at home against Orlando on Wednesday.\n\nPistons: End regular season against Memphis on Tuesday and at New York on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994340.8185642
}