{
  "game_id": "0021900529",
  "espn_id": "401161171",
  "date": "Jan 04, 2020",
  "matchup": "CHI vs. BOS",
  "headline": "Tatum scores 28, Celtics hold off Bulls 111-104",
  "body": "CHICAGO --  Out of sync the previous night, Jayson Tatum sure was locked in this time.\n\nTatum scored 28 points, Gordon Hayward added 24 and the Boston Celtics beat the Chicago Bulls 111-104 on Saturday.\n\nThe Celtics hung on for their eighth win in nine games after a 16-point lead dwindled to three in the fourth quarter. Tatum hit a long 3-pointer with just over a minute left to bump the lead to seven, and the Atlantic Division leaders came out on top after rallying from 18 down to beat Atlanta on Friday.\n\nTatum went hard at the rim right from the start and hit 12 of 15 shots following a 2-of-16 performance against the Hawks.\n\n\"That's the good thing about this league,\" he said. \"If you play good or play bad, you need to forget about the last one.\"\n\nJaylen Brown scored 19 for the Celtics, and Enes Kanter had 17 points and 12 rebounds. Boston overcame 20 turnovers to win again even though flu-ridden star Kemba Walker missed his second straight game.\n\nZach LaVine scored 35 to lead Chicago and nailed five 3-pointers. Lauri Markkanen had 15 points, though he walked gingerly off the court with about four minutes left after a driving Marcus Smart landed on his left ankle. The Bulls lost for the fourth time in five games.\n\nThe Celtics led 93-77 early in the fourth. But instead of cruising the rest of the way, they had to withstand a big push by Chicago.\n\nLATE RALLY\n\nThe Bulls cut it to 95-92 with 7:21 remaining on a 3 by LaVine and a layup by Kris Dunn. It stayed tight until Tatum nailed a 3 from the right side with Dunn giving him little room to make it 108-101 with 1:06 left. LaVine then missed two free throws and a pull-up 3, helping seal the win for Boston.\n\n\"He made a lot of great plays,\" Dunn said. \"A lot of great plays. Even the 3 toward the end, I thought I had good defense, good hands, but he was so far out, he was almost out of bounds, but he knocked it down.\"\n\nCeltics coach Brad Stevens noticed a more aggressive Tatum, right from the start.\n\n\"I thought today, when he caught it, he didn't dance in the first half,\" Stevens said. \"He caught it on the run and drove it to the rim and made a number of good plays. Got some finishes to go. Felt a little better about himself probably and then at the end made an incredible shot. That was really tough.\"\n\nSHORTENED ROTATION\n\nChicago used just eight players rather than the usual 10 or 11 after coach Jim Boylen said before the game he wouldn't change his approach with the Celtics playing their second game in two nights.\n\n\"They have three 6-8 guys that handle the ball,\" he said, referring to the 6-foot-6 Brown, 6-7 Hayward and 6-8 Tatum. \"It's a good team to give it a look.\"\n\nTIP-INS\n\nCeltics: Stevens said Walker is improving, though he would have to feel \"much better\" Sunday to meet the team in Washington. Stevens said that remained a possibility. ... Stevens said scans on C Robert Williams (left hip bone edema) showed improvement and he will meet Tuesday with a specialist. Williams has not played since Dec. 6. ... Kanter had to get his chin stitched following Friday's win over Atlanta. \"He was bragging about his scar,\" Stevens said.\n\nBulls: F Chandler Hutchison (right shoulder) missed his 17th consecutive game, after playing for the G League's Windy City Bulls on Friday. He has not appeared in a game for Chicago since Nov. 27.\n\nUP NEXT\n\nCeltics: Visit the Washington Wizards on Monday.\n\nBulls: Visit the Dallas Mavericks on Monday. ---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996349.8422341
}