{
  "game_id": "0022300232",
  "espn_id": "401584860",
  "date": "Nov 22, 2023",
  "matchup": "PHI @ MIN",
  "headline": "Edwards scores 31 as Wolves beat Embiid-less 76ers 112-99",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 31 points, Karl-Anthony Towns added 23 points and 11 rebounds and the Minnesota Timberwolves pulled away in the fourth quarter for a 112-99 win against the Philadelphia 76ers, who were playing without MVP center Joel Embiid, on Wednesday.\n\n\r\n              Embiid missed his first game of the season for Philadelphia with left hip soreness after playing 38 minutes with 38 points and 12 rebounds in the 76ers’ 122-119 overtime loss at Cleveland a night earlier. Philadelphia is also without Kelly Oubre Jr. due to a fractured rib.\n\n\r\n              Without Embiid, the Sixers had no answer for Minnesota’s two-big lineup of Towns and Rudy Gobert. Gobert had 13 points and 11 rebounds for the Timberwolves, who won their third straight and have won 10 of 11.\n\n\r\n              “Same way we approach every game nowadays,\" said Minnesota center Naz Reid, who had 13 points off the bench. “Whether their star player is playing or not, we’re going out there to win. We’re going to play to the best of our abilities and put our best effort forward. That’s what we do every night.”\n\n\r\n              Minnesota was playing its first game without forward Jaden McDaniels, who the team announced would be out two to three weeks due to a Grade 1 right lateral ankle sprain sustained in Monday’s win against New York.\n\n\r\n              Marcus Morris Sr. started for Embiid and scored 16 points. Tyrese Maxey and De’Anthony Melton each had 16 points for the Sixers, who’ve lost four of six.\n\n\r\n              “I think we put ourselves a little bit behind it with the start that we had,” Philadelphia coach Nick Nurse said. \"We turned it over. We only end up with 15 for the game, but I think six of them early, like really early.\"\n\n\r\n              The Wolves, who started the day second in the league in defensive rating, raced out to a quick advantage in the first with many of Philadelphia’s regulars tallying high minutes in the previous night’s overtime game.\n\n\r\n              Minnesota hit 8 of its first 11 shots, while the Sixers had seven first-quarter turnovers as the Wolves led by as many as 19 in the first. The Sixers pulled within four in the second, but Edwards scored 13 of his points in the third, including 3 of 4 from 3-point territory.\n\n\r\n              Philadelphia finished with 15 turnovers and shot 39.1% from the field. Minnesota, meanwhile, held a 19-4 edge in fast-break points.\n\n\r\n              “I thought it was a real good professional effort,” Wolves coach Chris Finch said. “Fortunately, Ant hit enough big, tough shots to kind of keep them at bay, so they could never really get a run together. We were able to always re-focus, have one more push in us, which was good.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Play at Oklahoma City on Saturday.\n\n\r\n              Timberwolves: Host Sacramento on Friday as part of the in-season tournament.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764996436.1429062
}