{
  "game_id": "0021800436",
  "espn_id": "401071117",
  "date": "Dec 16, 2018",
  "matchup": "ATL @ BKN",
  "headline": "Russell scores 32, Nets beat Hawks 144-127 for 5th straight",
  "body": "NEW YORK --  Brooklyn coach Kenny Atkinson watched the Nets let a 21-point lead slip to two and was reminded of the offensive flaws that sent the team spiraling on an eight-game skid a few weeks ago.\n\nNeeding a spark on the offensive end, Atkinson made sure D'Angelo Russell led the way.\n\nRussell scored 32 points, Rondae Hollis-Jefferson had 18 and the Nets beat the Atlanta Hawks 144-127 on Sunday for their fifth straight win.\n\nJoe Harris had 16 points and Spencer Dinwiddie added 15 off the bench for the Nets, who last won five straight March 25-April 2, 2015.\n\nAtkinson noticed a different team to start the third quarter as the ball moved and the Nets pushed toward the basket more.\n\n\"I was worried at halftime. I said this game is too loose. It's too up and down,\" Atkinson said. \"They play fast, and we knew we had to start that third quarter with an edge, and I felt we did.\"\n\nAtlanta cut Brooklyn's 21-point lead down to 66-64 when Kent Bazemore capped a 6-0 run with two free throws late in the first half. But the Nets pulled away in the third quarter with an 11-5 run to make it 108-92 after Russell found Ed Davis cutting to the basket for a dunk.\n\nRussell then found Jared Dudley for a 3 to extend the lead to 111-94 with 14 seconds left in the third, one of 34 assists by the Nets. That matched a season high set last Friday against Washington.\n\n\"I think just our commitment for wanting to see each other do better,\" said Russell, who finished with seven assists and no turnovers, becoming the first Net with that line since Vince Carter on March 19, 2008 against the Hawks.\n\n\"Like I said, everybody is aggressive at the appropriate time but still wanting to make that extra pass for the next guy, still having your teammates' back on the defensive end, that rotation,\" Russell added. \"We're making those plays.\"\n\nBrooklyn also notched a season-high 12 steals.\n\nJohn Collins scored 29 points and Dewayne Dedmon had 24 points and 12 rebounds for the Hawks, who have lost three straight and seven of their last eight.\n\nAtlanta stumbled in the first quarter and trailed 42-23 at the end of it. The Hawks shot 10 for 23 from the field while the Nets connected on 16 of 26, including 7 for 14 from the 3-point line.\n\n\"It's all about figuring a way to get us going,\" said Bazemore, who finished with 20 points.\n\nThe Hawks have lost their last five on the road, dropping to 2-14 away from home this season.\n\nTIP-INS\n\nHawks: Rookie point guard Trey Young had 13 points and 10 assists. ... Atlanta had 38 assists on 47 baskets.\n\nNets: The Nets had their highest scoring game ever at the Barclays Center, topping the 131 they scored against Philadelphia on March 15, 2016. ... Brooklyn has posted at least 70 points in the first half of its last two games, a feat it had not accomplished since the 1983-84 season. The Nets scored 70 points through two quarters against Washington on Friday and had 72 at the half against Atlanta. ... The Nets have scored at least 100 points through the first three quarters in consecutive games for the first time in franchise history. ... The 144 points in a regulation game were the second-most in franchise history behind a 147-132 win at Detroit on April 17, 1982.\n\nBITTERSWEET RETURN\n\nFormer Nets guard Jeremy Lin returned to Brooklyn and said he wished things had ended differently. Lin was surprised and upset with the trade that sent him to Atlanta on July 12 after two years and just 37 games in Brooklyn due to injuries.\n\n\"Honestly, coming in the building, just thankful,\" said Lin, who was averaging 10.8 points and 41 percent shooting from the 3-point line in 25 games. \"As sad as it is when I think of Brooklyn, obviously, I just think of a lot of injuries and things like that. It's quite a contrast to being healthy, being able to participate in a game.\"\n\nUP NEXT\n\nHawks: Host the Washington Wizards on Tuesday night.\n\nNets: Host the Los Angeles Lakers on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995371.6820521
}