{
  "game_id": "0021800672",
  "espn_id": "401071348",
  "date": "Jan 18, 2019",
  "matchup": "DET vs. MIA",
  "headline": "Pistons hold on without Drummond, beat Heat 98-93",
  "body": "DETROIT --  Dwane Casey wants the Detroit Pistons to react a little better when they hit a rough stretch.\n\nFriday night against Miami was another test.\n\nBlake Griffin had 32 points and 11 rebounds, and the Pistons overcame an early exit by injured Andre Drummond to beat the Heat 98-93. Detroit blew a 16-point lead and scored only 12 in the third quarter, but the Pistons rebounded in the fourth and have won consecutive games for the first time since early December.\n\n\"We've got to stop dropping our shoulders, dropping our head, or letting whatever is bothering us, bother us,\" said Casey, in his first season as Detroit's coach. \"Whether it's officials -- whatever it is, we've got to get to the next play, and we're going to be a better team for it.\"\n\nDwyane Wade scored 20 points for the Heat, but missed badly on an off-balance 3-pointer in the final seconds that could have tied the game.\n\nDetroit led by 16 in the first half and was up 53-39 at halftime, but the Pistons were down by four by the time the third period was over. Luke Kennard scored eight points in the fourth to help them pull through.\n\nDrummond left with a nasal injury after being hit in the face in the first quarter by the arm of Miami's James Johnson. Drummond finished with no points in 7:14, and backup Zaza Pachulia scored only two -- on a tip-in that put Detroit up 94-91 with 26.7 seconds remaining.\n\nCasey said Drummond had a nasal contusion and will be re-evaluated Saturday morning.\n\nThe Heat were done in by their abysmal foul shooting. They went 5 of 19 at the line, with center Hassan Whiteside missing all eight of his attempts.\n\n\"We work on them all the time. Maybe we should stop working on them,\" coach Eric Spoelstra said. \"Hassan works on them as hard as anyone, and he's got good technique. He's had stretches like this before and he'll get it back.\"\n\nKennard scored 22 points for the Pistons, and Reggie Bullock added 19. Griffin finished an assist shy of a triple-double.\n\nDetroit beat Golden State on Dec. 1 to cap a five-game winning streak. The Pistons, who defeated Orlando on Wednesday, have won back-to-back games for the first time since then.\n\nTRIBUTE\n\nWade received a nice ovation when he checked into the game in the first quarter, and a message went up on the scoreboard congratulating him on his career. This is Wade's final NBA season, and the Heat won't come to Detroit again unless the teams meet in the playoffs.\n\n\"It was cool to get that kind of love here, because we had a lot of great battles with the Pistons,\" Wade said. \"I wasn't surprised, though. The people here have always been good to me, even when it was a rivalry.\"\n\nMOVING ON?\n\nDion Waiters scored two points in 8:37 for Miami. The Heat fined Waiters an undisclosed amount for expletive-laden comments about playing time earlier this week. He played 11:56 on Tuesday in a 38-point loss at Milwaukee.\n\nLOOKING TO SHOOT\n\nKennard went 8 of 17 in a reserve role. It was his third straight game with at least 10 points.\n\n\"You get open shots when you play hard, when you play fast,\" Kennard said. \"I think that has been helping me out a little bit.\"\n\nTIP-INS\n\nHeat: Miami was without G Josh Richardson (illness).\n\nPistons: G Ish Smith, who missed 19 games after a right adductor tear in December, left with adductor tightness in his third game back.\n\nUP NEXT\n\nHeat: Visit the Chicago Bulls on Saturday night.\n\nPistons: Host the Sacramento Kings on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994688.700345
}