{
  "game_id": "0021900629",
  "espn_id": "401161271",
  "date": "Jan 18, 2020",
  "matchup": "DET @ ATL",
  "headline": "Rose, Mykhailiuk spark Pistons to easy win over Hawks",
  "body": "ATLANTA --  Derrick Rose has been rolling lately, and in a good way.\n\nThe 11th-year point guard, in his first season with the Detroit Pistons, is easily handling the minutes load and producing at a high clip.\n\nRose has battled injuries through much of his career, but the Pistons' decision to hold him back earlier in the season is paying off.\n\n\"I feel like they were being cautious,\" Rose said. \"I keep showing them. I'm coming in, doing what I'm supposed to do, taking care of my body. I've been prepping for this all summer, so it's finally just coming full circle.\"\n\nRose had 27 points and nine assists, Svi Mykhailiuk added 25 points in a reserve role, and Detroit won its second straight game with an easy 136-103 victory over the Atlanta Hawks on Saturday night.\n\nThe Pistons had a season high in points and shot 59.3% from the field, two nights after shooting one percentage point better, a season high, in a win at Boston.\n\nMarkieff Morris finished with 22 points off the bench, and Andre Drummond had 16 points, 17 rebounds and five steals as the Pistons won consecutive games for the first time since Dec. 9. They had gone 5-13 during that stretch.\n\nThe loss spoiled Jeff Teague's first game back with the Hawks. Teague, who finished with 15 points and seven assists in 25 minutes, was traded from Minnesota to Atlanta two days eaerlier, returning to his adopted hometown team.\n\nJohn Collins scored 20 and De'Andre Hunter added 19 for the Hawks, who dropped to an Eastern Conference-worst 10-33 and rank third-worst overall in opponents' scoring average. They lacked energy after winning the night before at San Antonio for the first time in 21 years.\n\n\"We knew how they were going to attack us,\" Collins said \"We just didn't execute our plan well. We came out a little slow and they hit us first, and we really didn't respond too well.\"\n\nSpurred on by Rose having his eighth straight game of at least 20 points and a bench that totaled 76 points, the Pistons were never threatened in the second half, leading by 23 on Sekou Doumbouya's 3 and Drummond's layup at the 8:19 mark of the third. The lead soon swelled to 97-69 on two free throws by Morris and stood at 120-89 on Mykhailiuk's 3 with 6:08 left in the game.\n\nRose was the catalyst throughout, looking like his vintage self when he picked off Trae Young, the NBA's leader in turnovers and the league's third-leading scorer, to feed Mykhailiuk for a layup that made it 112-78 with 10:21 remaining.\n\n\"I told him the other day he's looking like his (2011) MVP season, man,\" Morris said. \"He's quick. He's making great decisions on the ball. He can play either off the bench or as a starter. Obviously we need to him to start because he's scoring at a high level and leading this team.\"\n\nDetroit took its first double-digit lead on Morris' 3 at the 4:30 mark of the first. The Pistons went up 65-45 with 3:42 left before halftime on a pair of free throws by Langston Galloway.\n\nTIP-INS\n\nPistons: At 16-27, Detroit is ninth in the East and three games out of the final playoff spot. ... Rose, who went 12 for 17 from the field in 26 minutes, started his second straight game. ... Morris, who scored 23 points at Boston, went 7 for 10 against Atlanta and is 16 for 24 from the field in his last two games. ... F Blake Griffin, a six-time All-Star, was out for the 25th game because of left knee surgery. ... G Reggie Jackson missed his 41st game with a lumbar stress reaction.\n\nHawks: Young scored 16 points, 13 less than his season average. He was 6 for 16 from the field as Bruce Brown teamed with Rose and Tim Frazier to frustrate him throughout. ... C Alex Len missed his third straight game with lower back pain. ... F Jabari Parker is still sidelined by a right shoulder impingement. ... Atlanta has lost 25 of 27 when trailing after the third.\n\nCAN'T STAND IT\n\nHawks coach Lloyd Pierce, a native Californian and lifelong Oakland Raiders fan, said he won't allow himself to watch the San Francisco 49ers play Sunday for a trip to the Super Bowl.\n\n\"There's nothing worse than the Niners being really good right now,\" Pierce said. \"I'm (perturbed). I don't know what I'm doing tomorrow, but I don't want to watch the game. I want to watch football, but I don't want to watch because I don't want to see them win. I'm afraid they're going to win.\"\n\nPierce said he plans to see a couple of games next season when the Raiders open their new home in Las Vegas.\n\n\"I think Vegas is the absolute perfect destination for a Raiders team,\" Pierce said. \"I really fear for the city. I think Vegas is rough enough as it is. It's going to be a lot rougher with Raiders being there every weekend.\"\n\nUP NEXT\n\nPistons: At the Washington Wizards on Monday.\n\nHawks: Host the Toronto Raptors on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996274.324918
}