{
  "game_id": "0021600030",
  "espn_id": "400899480",
  "date": "Oct 29, 2016",
  "matchup": "CHI vs. IND",
  "headline": "Butler, Wade, Rondo lead Bulls to 118-101 rout of Pacers",
  "body": "CHICAGO --  With nine new players, including three starters, the Chicago Bulls seemed likely to struggle with cohesion early in the season.\n\nHowever, one of those newcomers -- Rajon Rondo -- has been credited by his teammates with fueling Chicago's fast start.\n\nDoug McDermott had 23 points, Jimmy Butler added 16 on 6-of-9 shooting and Rondo had 13 assists to lead the Bulls to a 118-101 rout of the Indiana Pacers on Saturday night, Chicago's second straight victory to open the season.\n\nMcDermott scored 11 points in the fourth quarter as coach Fred Hoiberg gave his veteran starters -- Butler, Rondo and Dwyane Wade, who had 14 points -- the rest of the night off after the third quarter.\n\nRondo, who has 22 assists in the two games, likely could have racked up a much higher number if he wasn't limited to 25 minutes.\n\n\"He pushes the ball up the floor and he gets it out, so he makes you run to get in front of him,\" Wade said.\n\nPlaying with Rondo means you have to be alert at all times.\n\n\"I always tell those guys to understand that, `If you don't think I see you, I probably see you, so be ready for the pass,\" Rondo said.\n\n\"Who doesn't want the ball? Everybody wants the ball and everybody wants to score.\"\n\nTaj Gibson had 12 points and eight rebounds, and Robin Lopez added 12 points for the Bulls.\n\nPaul George and Myles Turner had 20 points apiece to lead the Pacers (1-2), who were coming off a loss at Brooklyn on Friday.\n\n\"The message is loud and clear: we need to get to work,\" Indiana coach Nate McMillan said.\n\n\"We have a talented team,\" George said, \"but it's going to take us a couple games to get our chemistry. We'll get through our battle wounds early.\"\n\nThe Bulls had a 24-20 lead at the end of the first quarter before breaking things open with a dominant second. They scored 38 points on 14-for-18 (77.8 percent) shooting in the quarter to race out to a 62-41 halftime lead.\n\nIndiana seemingly sleep-walked on defense throughout much of the second quarter -- especially in transition where the Bulls had a 19-0 edge in fast-break points. McDermott had seven points in seven minutes, and five players scored at least five points. Rondo added six assists.\n\nChicago maintained its intensity in the third quarter and stretched the lead to 92-67 entering the fourth.\n\nThe Bulls lead by as many as 29 points in the final quarter (102-73) before Indiana made a futile run in garbage time to trim the deficit to 112-101 with two minutes to play.\n\nTIP-INS\n\nPacers: Aaron Brooks (sore right knee) and Rodney Stuckey (right hamstring) sat out with injuries. Stuckey is scheduled to undergo an MRI on Monday.\n\nBulls: Wade said he's feeling fine but sat out Friday's practice after playing 32 minutes in the opener on Thursday. The 13-year veteran said he will take regular days off to stay healthy and fresh. \"Certain days (are) better to be mental days than physical days,\" he said.\n\nBENCH WOES\n\nThrough three games, the Pacers have been outscored by a total of 33 points in the second quarter. That's mainly an indictment of the reserves.\n\n\"Our bench's got to get some chemistry.\" McMillan said. \"We need to get that (second) team some time on the floor, and they just haven't had it.\"\n\nCUBS FEVER\n\nWith the Bulls idle Friday night, Wade attended Game 3 of the World Series at Wrigley Field.\n\n\"I noticed that everybody in my family that was at the game, everybody had on Cubs gear -- and I know everybody's not a Cubs fan,\" he said. \"But it's just about being a part of the moment. It's a historic thing for the city of Chicago and a lot of people just want to say they've been to a World Series.\"\n\nUP NEXT\n\nPacers: Host Los Angeles Lakers on Tuesday.\n\nBulls: At Brooklyn on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995117.244288
}