{
  "game_id": "0021900469",
  "espn_id": "401161111",
  "date": "Dec 27, 2019",
  "matchup": "MIL @ ATL",
  "headline": "Bucks cruise past Hawks without injured Antetokounmpo",
  "body": "ATLANTA --  Khris Middleton scored 23 points, Ersan Ilyasova had season highs of 18 points and 17 rebounds and the NBA-leading Milwaukee Bucks overcame Giannis Antetokunmpo's absence to beat the Atlanta Hawks 112-86 on Friday night.\n\nAntetokunmpo, the league MVP last season and second-leading scorer this season, sat out because of back soreness.  He watched from the bench as his teammates helped Milwaukee improve to 28-5 overall and 13-3 on the road.\n\nThe Hawks lost their ninth straight to drop to a league-worst 6-26. They lost guard Trae Young, the NBA's fourth-leading scorer, to a right ankle sprain late in the second quarter. He had to be helped off the floor  and was ruled out for the rest of the game.\n\nBrook Lopez had 19 points for Milwaukee to match his season high.\n\nAllen Crabbe led the Hawks with 20 points in a reserve role. Starting forward John Collins, Atlanta's second-leading scorer, finished with nine points and missed 10 of 14 shots from the field.\n\nIlyasova's 3 at the 6:25 mark of the third put the Bucks up 78-46. With his team trailing by 30 a couple of minutes later, Atlanta's DeAndre' Bembry stole the ball and missed a dunk.\n\nThe Bucks improved to 26-3 since Nov. 1 and are 2-0 without Antetokoumpo, who missed a Dec. 11 win over New Orleans with right quad tendon soreness.\n\nMiddleton, Lopez and Ilyasova, who started in Antetokounmpo's spot, sat out the fourth quarter with a comfortable lead.\n\nTIP-INS\n\nBucks: It was unclear before the game how time Antetokounmpo will miss. He wore a blazer and slacks and cheered his teammates from the bench. .... G Eric Bledsoe, the team's third-leading scorer, missed his seventh straight game with a right shin injury. Coach Mike Budenholzer said Bledsoe will not play Saturday. ... Milwaukee is the only team to score at least 100 points in each game this season. The Bucks have hit the century mark in 57 straight.\n\nHawks: F Jabari Parker, the team's third-leading scorer, was out with a right shoulder impingement. ... C Alex Len missed the game with a left ankle sprain.\n\nSERIES\n\nMilwaukee has won 10 of its past 11 games against Atlanta and is 3-0 this season to wrap up its third straight season series win over the Hawks.\n\nIN THE HOUSE\n\nFloyd Mayweather Jr., whose boxer Gervonta Davis fights for the WBA's secondary lightweight title Saturday at State Farm Arena, watched the game from a courtside seat.\n\nUP NEXT\n\nBucks: Host Orlando on Saturday.\n\nHawks: At Chicago on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996447.763199
}