{
  "game_id": "0021601013",
  "espn_id": "400900408",
  "date": "Mar 15, 2017",
  "matchup": "MIL @ LAC",
  "headline": "Bucks hold off Clippers 97-96 when Griffin misses late",
  "body": "LOS ANGELES --  For a team fighting to make the playoffs, the absence of its second-leading scorer could have presented a huge problem.\n\nMilwaukee was 22-29 when it lost Jabari Parker and his 20.1 points per game to a season-ending knee injury last month. Yet after escaping with a 97-96 victory Wednesday night over the Los Angeles Clippers, the Bucks are a surprising 11-5 since Parker got hurt and they sit in seventh place in the Eastern Conference.\n\n\"It's that group,\" Milwaukee coach Jason Kidd said. \"It's their chemistry. They're just pros. They've worked extra hard and they're a team. They don't rely on one person and that was evident tonight.\"\n\nSix players scored in double figures for the Bucks, led by 16 points apiece from Khris Middleton and Giannis Antetokounmpo. Perhaps the biggest basket of the night was a 3-pointer by Matthew Dellavedova that gave them a 97-91 lead with 1:17 to play.\n\nMilwaukee didn't score again, and the Clippers got five points from DeAndre Jordan (22 points, 17 rebounds) down the stretch. After a timeout with 5.2 seconds left, Blake Griffin drove the lane and put up a short shot that rolled around the rim and out.\n\n\"Decent look,\" Griffin said. \"Wish we had two more seconds to let it develop a little bit, but got it up on the rim, which is what I was hoping for, but it didn't fall.\"\n\nGriffin finished with 18 points and seven rebounds, but star teammate Chris Paul had an off night. He shot just 2 of 10 while scoring six points and turning the ball over six times. He had seven assists.\n\n\"He is human,\" Clippers coach Doc Rivers said. \"He had one of those games, but I don't think it was anything more than that.\"\n\nJoining Middleton and Antetokounmpo in double figures for the Bucks were Greg Monroe and Dellavedova with 12 points apiece. Malcom Brogdon and Mirza Teletovic each scored 11.\n\nTIP-INS\n\nBucks: Antetokounmpo ranks in the NBA's top 20 in total points, rebounds, assists, steals and blocks. No player in history has managed that for an entire season.\n\nClippers: Have won four of seven but are 5-7 in their last 12 games. Rivers doesn't think his team is struggling, though. \"It's just a point in the season. Cleveland's lost four of five, but if we do that it's a different (reaction). Maybe because they won a world championship. I have a lot of confidence in where we're headed,\" he said.\n\nDEFENSIVE STAND\n\nThe 6-foot-10 Griffin found himself being guarded by the 6-4 Dellavedova on a switch on the final play. Dellavedova stayed close to help take Griffin's legs away and then Brogdon contested the shot. \"I don't think he saw the basket -- that's why he missed,\" Antetokounmpo said. \"Usually he makes those shots.\"\n\nSTAYING HOME\n\nRivers said Griffin and Jordan will remain home to rest Thursday when the team plays in Denver. Said Griffin: \"I don't like sitting out no matter what, and I know he (Jordan) doesn't, either. But at the end of the day you do what is best for the team, or what the team thinks is best for the team.\"\n\nMIRROR IMAGE\n\nMany have compared UCLA star freshman guard Lonzo Ball's style of play to that of Kidd. The Bucks coach said he's seen Ball play once. \"He's a basketball player. He plays under control and can see when things open up. The main thing is, he has a winning mentality. He doesn't have to score,\" Kidd said.\n\nUP NEXT\n\nBucks: Return to Staples Center to play the Lakers on Friday. Despite a career-high 41 points by Antetokounmpo, the Lakers defeated the Bucks 122-114 in Milwaukee last month in their only previous meeting this season.\n\nClippers: Visit the Denver Nuggets on Thursday hoping to even the season series at two games apiece. The Nuggets are trying to hold onto the eighth and final playoff spot in the West and have won three straight.",
  "source": "espn_api",
  "crawled_at": 1764995143.616408
}