{
  "game_id": "0022400085",
  "espn_id": "401704651",
  "date": "Oct 25, 2024",
  "matchup": "LAL vs. PHX",
  "headline": "Anthony Davis scores 35 points, the Lakers rally in second half to beat the Suns 123-116",
  "body": "LOS ANGELES -- — Anthony Davis scored 35 points, Austin Reaves added 26 and the Los Angeles Lakers rallied to beat the Phoenix Suns 123-116 on Friday night for their first 2-0 start since 2010-11.\n\n\r\n              LeBron James had 17 of his 21 points in the second half for the Lakers, who trailed by 22 points in the second quarter.\n\n\r\n              Kevin Durant led Phoenix (1-1) with 30 points. Devin Booker had 23.\n\n\r\n              The Lakers were down 61-52 at halftime, then outscored Phoenix 35-24 in the third quarter to take the lead as Davis and James each scored 11 in the period.\n\n\r\n              Los Angeles led by 12 points in the fourth quarter.\n\n\r\n              Takeaways\r\n              Suns: Made 21 of their first 30 shots, including nine straight 3-pointers, before going 21 of 52 the rest of the game. Phoenix was 24 of 39 from the field in the first half, but 9 of 27 in the third quarter. The Suns led 38-23 after the first quarter.\n\n\r\n              Lakers: JJ Reddick is the first Los Angeles coach to win his first two games since Phil Jackson in 1999.\n\n\r\n              Key moment\r\n              The Lakers trailed 81-74 with three minutes left in the third quarter before scoring nine straight points to grab the lead. That was part of a 20-6 run during a nearly five-minute span from late in the third to early in the fourth.\n\n\r\n              Key stat\r\n              The Lakers were 14 of 27 on 3-pointers. Reaves was 5 of 7 from beyond the arc while James, Dalton Knecht and Rui Hachimura made two apiece.\n\n\r\n              Up next\r\n              Both teams have home games Saturday night. The Suns will face Dallas, and the Lakers take on Sacramento.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997221.8718479
}