{
  "game_id": "0022400996",
  "espn_id": "401705562",
  "date": "Mar 20, 2025",
  "matchup": "MIL @ LAL",
  "headline": "Antetokounmpo and Bucks pull away from short-handed Lakers for comfortable 118-89 win",
  "body": "LOS ANGELES -- — Giannis Antetokounmpo scored 28 points and the Milwaukee Bucks defeated the short-handed Los Angeles Lakers 118-89 on Thursday night.\n\n\r\n              Gary Trent Jr. had 23 points off the bench, Kyle Kuzma added 20 and the Bucks swept the season series with two comfortable wins eight days apart. \n\n\r\n              Bronny James had 17 points to reach double figures for the first time in 22 NBA games, but the Lakers had their nine-game home winning streak snapped.\n\n\r\n              Los Angeles was without its top four scorers and five of its top six. Luka Doncic and Austin Reaves didn't play in the second game of a back-to-back because of sprained right ankles, joining starters LeBron James and Rui Hachimura on the injury report. Key reserves Dorian Finney-Smith (left ankle) and Jarred Vanderbilt (right groin strain) were also held out.\n\n\r\n              Milwaukee, which didn't have Damian Lillard available because of a calf injury, created separation by closing the first quarter on a 20-5 run that proved to be enough the rest of the way.\n\n\r\n              Takeaways\r\n              Bucks: Having lost five of their previous seven, this was a gift Milwaukee couldn't give away if it hopes to secure home-court advantage in the first round of the playoffs.\n\n\r\n              Lakers: Dalton Knecht (17 points) and Gabe Vincent (9 points) struggled to help make up for so much missing offense, combining to shoot 8 for 26 (30.8%).\n\n\r\n              Key moment\r\n              Los Angeles came up empty on an extended offensive possession in the last two minutes of the first half, and Trent knocked down a 3-pointer on the other end to push Milwaukee’s lead back to 11 at the break.\n\n\r\n              Key stat\r\n              Trent picked up the slack while the rest of the Bucks struggled from 3, going 6 for 10 (60%) as the rest of the team was a lackluster 20% (5 for 25).\n\n\r\n              Up next\r\n              The Bucks visit Sacramento on Saturday, and the Lakers host Chicago on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997822.6220548
}