{
  "game_id": "0021900635",
  "espn_id": "401161277",
  "date": "Jan 18, 2020",
  "matchup": "OKC vs. POR",
  "headline": "Paul's 30 lead Thunder past short-handed Portland 119-106",
  "body": "OKLAHOMA CITY --  Chris Paul had become annoyed with Oklahoma City's recent slow starts, so he did something about it.\n\nHe scored 21 of his 30 points in the first half, and the Oklahoma City Thunder beat the short-handed Portland Trail Blazers 119-106 on Saturday night.\n\nForward Danilo Gallinari, Oklahoma City's No. 2 scorer, rested. That prompted Paul to look for his shot more.\n\n“Just trying to be aggressive,\" he said. \"You know, without Danilo, we've got to find scoring. So I tried to come out and pick my spots early and made a few shots early.”\n\nPortland coach Terry Stotts has seen it all before during Paul's 15-year NBA career.\n\n“Paul was a really good player tonight,” Stotts said. “Well, he's been a really good player for his career, but he had a really good game tonight. He managed the game, scored.”\n\nShai Gilgeous-Alexander had 22 points and 10 rebounds and Dennis Schroder and Nerlens Noel each added 15 points for Oklahoma City.\n\nThe Trail Blazers had just eight players available. Portland's Kent Bazemore and Anthony Tolliver were not with the team, and coach Terry Stotts declined comment amid reports that the players were to be traded to Sacramento in exchange for Trevor Ariza, Wenyen Gabriel and Caleb Swanigan.\n\nPortland guard C.J. McCollum was out with a sprained left ankle. He ranks second on the team, averaging 21.5 points.\n\nDamian Lillard, who played despite dealing with an upper respiratory illness, led the Trail Blazers with 34 points. Gary Trent Jr. scored a career-high 30.\n\nThe Thunder led 64-57 at halftime, a switch from recent games with big deficits against the Los Angeles Lakers, Toronto Raptors and Miami Heat.\n\n“We just didn't have to play from behind,\" Gilgeous-Alexander said. \"We knew what we needed to do going into this game. We are coming off a back-to-back. We knew it would be a little bit tough, but if we wanted to win, we had to do it, and we did it tonight.”\n\nLillard scored 24 points in the first half to keep the Trail Blazers in it, but Oklahoma City pushed its lead to 87-77 after three quarters and cruised in the fourth. Stotts wasn't sure if his team wore out.\n\n“That's possible,\" he said. \"You know, we were hanging close. They made some runs. I don't know if we ran out of gas or not. The minutes were kind of under control, but like I said, I thought it was mostly Chris Paul's impact on the game more than anything else.”\n\nTIP-INS\n\nTrail Blazers: Bazemore, a forward, has started 21 games this season, including Portland's loss to the Dallas Mavericks on Friday. He averages 7.9 points and 4.0 rebounds. Tolliver has started nine games this season. He played 17 minutes against Dallas. ... Carmelo Anthony, who played one season with the Thunder, got a warm reception from the fans. ... Assistant coach Jim Moran was called for a technical foul in the third quarter.\n\nThunder: C Steven Adams returned to action after sitting out Friday with a right knee contusion. ... Thunder G Terrance Ferguson sat out with an illness. ... Thunder C Justin Patton was a late scratch because of illness. ... G Hamidou Diallo got his second start of the season. He scored four points. ... C Nerlens Noel was called for a technical foul in the third quarter. ... G Dennis Schroder scored all 15 of his points in the second half. ... Rookie Darius Bazley had a career-high 13 rebounds.\n\nNEW LEVEL\n\nTrent’s 30 points obliterated his previous best of 19 points. The second-year guard out of Duke made 12 of 18 shots, including 5 of 9 3-pointers, in 36 minutes.\n\nHis father, Gary Sr., played nine years in the league and only scored more than 30 points twice -- 33 and 32 points for the Dallas Mavericks during the 1998-99 season.\n\nCUTTING IT CLOSE\n\nThings could have been even worse for the Trail Blazers -- with only three active reserves. Nassir Little and Jaylen Hoard finished with five fouls.\n\nQUOTABLE\n\nGilgeous-Alexander on Paul's performance: “Chris has been doing this at a very high rate for a very long time. I expect nothing less from him.\"\n\nUP NEXT\n\nTrail Blazers: Host Golden State on Monday.\n\nThunder: At Houston on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996221.2215402
}