{
  "game_id": "0021800585",
  "espn_id": "401071261",
  "date": "Jan 06, 2019",
  "matchup": "LAL @ MIN",
  "headline": "Wiggins, Towns lead Timberwolves past Lakers, 108-86",
  "body": "MINNEAPOLIS --  Slowly but surely, the Minnesota Timberwolves have begun to find their way behind franchise cornerstones Karl-Anthony Towns and Andrew Wiggins.\n\nThe next step in their development will be adjusting to another new coach.\n\nWiggins scored 25 of his 28 points in the first half and Towns had 28 points and 18 rebounds, helping the Timberwolves take charge from the opening tipoff and breeze by the LeBron James-less Los Angeles Lakers 108-86 on Sunday before coach Tom Thibodeau was fired .\n\nJeff Teague scored all of his 15 points in the first half and finished with 11 assists for the Wolves, who raised their home record to 14-6, including 8-2 against Western Conference foes.\n\nDespite the team's fourth-largest margin of victory in 2018-19, Thibodeau was dismissed about an hour afterward near the halfway point of his third season in charge that started with turmoil surrounding the discontent of All-Star Jimmy Butler.\n\nThe Wolves (19-21) moved into 11th place in the conference, two games behind the eighth-place Lakers (21-19). The Wolves are 15-12 since Butler was traded to Philadelphia. Their defense produced season bests in points (86) and field goal percentage (36.8) allowed.\n\n\"Every game now counts,\" said Wiggins, whose five highest point totals this season have all come in the last 20 games. \"You never know what position you're going to be in at the end so every day you have to play like you're fighting for your life.\"\n\nLance Stephenson had 14 points for the Lakers, who fell to 1-5 without James since he strained his groin during the Christmas Day win at Golden State. With backup point guard Rajon Rondo (right ring finger surgery) and power forward Kyle Kuzma (bruised lower back) missing again, too, the leftovers for the Lakers produced a mostly lethargic performance. This was their largest losing margin in 20 games since a 117-85 defeat at Denver on Nov. 27.\n\n\"We weren't physical enough,\" point guard Lonzo Ball. \"That's a big, strong team over there, and I don't think we brought the fight tonight.\"\n\nLakers coach Luke Walton subbed the 7-foot-1 Ivica Zubac in the starting lineup for Kuzma next to 7-footer JaVale McGee, and the experiment led to a 15-1 deficit before Michael Beasley replaced Zubac. The Lakers missed their first eight shots from the floor, until Beasley's baseline reverse layup.\n\nThe Wolves built their first-half lead as large as 21 points, when a slick over-the-shoulder backward flip pass by Towns in the post on a give-and-go set up Wiggins for a soaring dunk and a 28-7 advantage. He went even higher in the second quarter to catch a textbook lob from Tyus Jones after sneaking behind Zubac with a backdoor cut for the slam and a 39-21 lead.\n\n\"We've got to play with some passion and fire,\" Walton said. \"It's hard to win in this league when you're healthy. You've got to give double that effort when guys are down.\"\n\nWIGGINS, FOR THE WIN\n\nWiggins, whose first season on his maximum-salary contract as a $25 million player has been hit and miss to match the so-far uneven trajectory of his career, has been exhibiting an abundance of confidence in his jumpers lately, and that trust clearly paid off for him and the Timberwolves in this matinee.\n\nHe made five shots from 15 feet or further before halftime, picking up a loose ball and calmly dribbling to the perimeter to sink a 3-pointer with 12 seconds remaining to make it 64-45.\n\n\"It's awesome,\" Towns said. \"You've got a front-row seat to watch `Maple Jordan' go to work. It's always great when he's going off. When he's doing what he was doing in the first half tonight, it makes it easier for all of us offensively.\"\n\nTIP-INS\n\nLakers: The starting lineup was outscored 91-34, with Brandon Ingram (13 points) and Josh Hart (10 points) going a combined 8 for 28 from the floor. ... Beasley had 11 points on 5-for-8 shooting, his second game in double digits this season.\n\nTimberwolves: Wiggins raised his career average against the Lakers to 23 points per game, his fourth-highest against the rest of the league. His best is against the club that drafted and traded him, Cleveland (25.6), and after that is Toronto (24.0), his hometown team. Sacramento (23.7) is his third-highest. ... The Wolves are 5-0 when holding opponents below 40 percent shooting from the field.\n\nSTILL OUT\n\nThe Timberwolves remained short-handed, too, with two of their top four scorers in Robert Covington (right knee bone bruise) and Derrick Rose (sprained right ankle) still out with injuries. Covington, who missed his third straight game, is out indefinitely, with more clarity on his status not expected next week, according to Thibodeau. Rose sat for the fifth consecutive contest, but he was listed as questionable and considered close to a return, Thibodeau said.\n\nUP NEXT\n\nLakers: Play at Dallas on Monday night, finishing their ninth of 13 sets of back-to-back games this season.\n\nTimberwolves: Visit Oklahoma City on Tuesday night.\n\n---\n\nMore AP NBA coverage: https://apnews.com/NBA and https://twitter.com/AP-NBA",
  "source": "espn_api",
  "crawled_at": 1764995009.643144
}