{
  "game_id": "0021501065",
  "espn_id": "400828952",
  "date": "Mar 23, 2016",
  "matchup": "LAL @ PHX",
  "headline": "Bryant scores 17 in Phoenix finale but Lakers lose again",
  "body": "PHOENIX -- Kobe Bryant was the villain in Phoenix for many big games. Not so in his desert finale Wednesday night.\nBryant said farewell to Phoenix, scoring 17 points while backed by a loud, pro-Laker crowd, but Los Angeles lost to the Suns 119-107.\nBryant played for the 47th time in Phoenix, capping his final visit with a pair of 3-pointers in the fourth quarter -- all to wild cheers.\n\"You can't dream this as a kid,\" Bryant said. \"You can't tell me at 6 years old that I'd play 20 years with my favorite basketball team and when I retire get this type of response from city to city. There's just no way. It's surreal and I just feel extremely, extremely blessed to be able to have the opportunity to go through this.\"\n\nThe 37-year-old five-time NBA champion left the game with 1:05 to play, hugging the Suns' P.J. Tucker and waving to the cheering crowd as he headed to the bench.\nDevin Booker, the Suns' 19-year-old rookie, scored 28 in his one and only game against Bryant, who sat out the previous three meetings against Phoenix this season.\n\"That is the first and last time I got to play against him,\" Booker said. \"That is the memory that I get to tell everybody and there is going to be proof of it. Thank God it wasn't an off night and I would have had to remember it as one of my worst games. Luckily I played pretty well and we came out with a win. I am 1-0 versus Kobe.\"\nBrandon Knight added 25 and Jon Leuer had 23 points and a career-high 14 rebounds.\nJulius Randle scored 19 for the Lakers, who lost in Phoenix for the 10th time in a row. The Suns won the season series between two of the NBA's bottom feeders who are a combined 35-106 this season.\nMirza Teletovic scored 11 points of his 17 points, going 3 of 3 on 3-pointers, when the Suns took control of the game in the third quarter.\nThe crowd, many in Bryant's No. 24 jersey, gave him a standing ovation at his introduction and another thunderous cheer after a tribute video was shown on the big screen during a first-period timeout.\nThere were chants of \"Kobe! Kobe!\" throughout the night.\nThings weren't always so friendly and Bryant acknowledged he hated the Steve Nash-led Suns.\n\"They stopped me from getting a championship -- twice,\" he said. \"Damn right I hated them. At the same time I loved them because they brought out the best in me and my teammates. The relationship was love-hate.\"\nThe only time Bryant was defending Booker, the young Suns sensation tried one of Bryant's well-known moves.\n\"He went straight to my move,\" Bryant said, laughing. \"You're not going to beat me on my move, man. But it was great to see. It was absolutely great to see. I did the same thing with M.J. (Michael Jordan).\"\nBryant gave Booker encouragement and a pair of autographed shoes, marveling at the fact the Suns rookie wasn't even born when Bryant started playing.\nBRYANT'S HISTORY\nBryant memorably was felled by a clothesline foul by Raja Bell in the 2006 Western Conference semifinals. Bell was suspended for a game.\nBryant scored 2,330 points against the Suns in his career, second only to Kareem Abdul-Jabbar (3,029). His average of just under 27 points per game- regular season and playoffs -- is the highest of any player who faced the Suns in at least 35 games.\nBryant's 51 points on April 7, 2006, remains the most scored at Talking Stick Resort Arena in a non-overtime game.\nBryant and Jordan are the only players with multiple 50-point games against Phoenix. They had two apiece.\nTIP-INS\nLakers: Bryant has five more farewell road games, including one against the Los Angeles Clippers at Staples Center, the court the two teams share. ... Bryant and Kevin Garnett are the only active players who played in an NBA game against Booker's father, Melvin. ... Bryant scored 24 points the last time the Lakers won in Phoenix on Jan. 5, 2011.\nSuns: Tyson Chandler was out with back spasms. ... At 36, Phoenix interim coach Earl Watson is a year younger than Bryant.\nUP NEXT\nLakers: host Denver Friday night.\nSuns: at Sacramento Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994244.369023
}