{
  "game_id": "0022300304",
  "espn_id": "401584932",
  "date": "Dec 11, 2023",
  "matchup": "POR @ LAC",
  "headline": "Clippers hold off short-handed Trail Blazers 132-127 for 4th straight win",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 34 points and the Los Angeles Clippers beat the short-handed Portland Trail Blazers 132-127 on Monday night for their fourth straight win.\n\n\r\n              Paul George had 20 points, eight rebounds and eight assists for the Clippers, and James Harden added 20 points, seven rebounds and seven assists. Ivica Zubac scored 18 as Los Angeles improved to 9-3 since a season-worst six-game skid.\n\n\r\n              Leonard has 75 points in his last two games. \n\n\r\n              “The biggest thing is health and finally getting his rhythm with PG and James starting,” Clippers coach Tyronn Lue said. \n\n\r\n              Portland was without Deandre Ayton, who missed his third straight game, and Malcolm Brogdon, who sat out his second in a row. Both have right knee soreness.\n\n\r\n              Anfernee Simons scored a season-high 38 points and Shaedon Sharpe added 27 for the Blazers, who fell to 0-8 against the West on the road. \n\n\r\n              “I knew it was going to be a tough game for us,” Lue said. “Defensively, we couldn't get stops. They scored every way.”\n\n\r\n              Simons was perfect at the free-throw line, making a career-high 13 in his fourth game of the season. He returned last week after missing 18 games with a ligament tear in his right thumb.\n\n\r\n              The Blazers made a season-high 19 3-pointers. Simons had five and Sharpe had four.\n\n\r\n              “We played good, man,” Blazers coach and former Clipper Chauncey Billups said. “We just keep scrapping no matter what.”\n\n\r\n              Sharpe's basket gave Portland its first lead of the fourth, 121-120, after trailing by six. \n\n\r\n              The teams traded one-point leads, with Terance Mann hitting a pair of free throws to put the Clippers ahead, 124-123. George scored and Leonard hit two more free throws for a five-point lead.\n\n\r\n              Simons got fouled by George and made both to pull the Blazers within three with 16 seconds left. Simons' dunk left Portland trailing 130-127 before George hit two free throws to seal the win.\n\n\r\n              “My team's in a good rhythm, that's all I care about,” Leonard said. “Tonight the ball found me and I made shots.” \n\n\r\n              The Clippers closed a high-scoring third on a 12-5 run that gave them a 105-99 lead. \n\n\r\n              The Blazers hit 10 3-pointers in the period, including five in a row to start, but never led by more than five points. Russell Westbrook scored seven straight in the Clippers' run that gave them back control.\n\n\r\n              Portland erased a double-digit deficit in the second and took its first lead on a basket by former Clipper Moses Brown that capped an 8-0 run. George's basket put the Clippers ahead 66-65 going into halftime.\n\n\r\n              The Clippers shot 79% in the first quarter, building a 14-point lead behind Zubac's 14 points. \n\n\r\n              HARDEN DUNKS\n\n\r\n              Harden threw down a one-handed dunk in the third, his first since joining the Clippers 1 1/2 months ago.\n\n\r\n              “Let's get this clear. I can still dunk,” the 34-year-old 10-time All-Star said. “I got guys who can do it better.”\n\n\r\n              HE SAID IT\n\n\r\n              “When you’re trying to build something, there’s going to be some pain in that. It’s not easy because I love to win everything I do.” — Billups.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host the Utah Jazz on Thursday to open a five-game homestand.\n\n\r\n              Clippers: Host the Sacramento Kings on Tuesday to complete a back-to-back.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996592.7836611
}