{
  "game_id": "0021600598",
  "espn_id": "400900019",
  "date": "Jan 13, 2017",
  "matchup": "POR vs. ORL",
  "headline": "Vucevic's season-high 30 lead Magic past Blazers, 115-109",
  "body": "PORTLAND, Ore. --  It's not the start but the finish that matters, though the Orlando Magic did both well.\n\nNikola Vucevic hit 13 of 18 shots, scored a season-high 30 points and grabbed 10 rebounds to lead the Magic to a 115-109 victory over the Portland Trail Blazers on Friday night.\n\nElfrid Payton scored 19 points and hit a key 3-pointer with 1:17 remaining that gave Orlando some breathing room. D.J. Augustin added 15 points, while Serge Ibaka had 13 points and 10 rebounds as the Magic snapped a four-game losing streak.\n\n\"We needed that,\" Vucevic said. \"We needed a game like that to see that we can do it. We've had a lot of games where we were playing pretty well, and the (other) team would make a run and we would kind of fall apart.\"\n\nOrlando couldn't have plotted a better start to the game, as the Magic hit their first nine shots, while the Blazers missed their first nine, on the way to an 18-1 lead five minutes into the game.\n\nBut it came down to the final eight minutes, with the score tied at 90. Vucevic and Payton combined to score 15 of Orlando's final 25 points to lead the finishing charge.\n\n\"I was very happy with how we started the game but even more proud of how we responded to their runs,\" Orlando coach Frank Vogel said.\n\nPortland coach Terry Stotts thought the Blazers, who had won three of four and were coming off a 16-point win over Cleveland, lost a long-range shooting contest.\n\n\"It was a perimeter game, and they ended up making more shots than we did,\" Stott said.\n\nAs for the sluggish start, Stotts said, \"It happens. I thought we had good shots. We had shots around the basket. But the ball wasn't going in.\"\n\nDamian Lillard scored 34 points and C.J. McCollum had 26, extending his streak to eight consecutive games with at least 25 points, the Trail Blazers' longest in nearly 30 years.\n\nAfter Orlando's fast start, Lillard scored 15 first-quarter points as the Blazers got as close as three points during the first half. Orlando led 54-49 at halftime.\n\nTwo minutes into the third quarter, Portland grabbed its first lead at 57-56 on a drive by Lillard. But Orlando bounced back, as Ibaka hit back-to-back 3-pointers to lead the Magic to an 82-78 lead heading into the fourth quarter.\n\nLillard pulled Portland to 105-103, but Payton silenced the Blazers crowd with a 3-pointer at the end of the shot clock, putting the Magic in front 108-103 with 1:17 left.\n\n\"You get up 18-1 against a team like that and it's not always a good thing. We knew they were going to come after us and they did, but we were able to respond by getting shops late in the game, and hitting big shots,\" Vogel said.\n\nTIP-INS\n\nMagic: There were a couple family reunions for Magic coaches. Assistant David Adelman returned to Portland where his father Rick, a longtime and now retired NBA coach, lives. Todd Forcier, the brother of Orlando assistant Chad Forcier, is a sports performance specialist for the Blazers. ... Ibaka returned to the lineup after missing the Magic's last game with a right shoulder injury. ... Vucevic has scored at least 20 points in five consecutive games against Portland.\n\nTrail Blazers: Starting small forward Maurice Harkless was a late scratch due to a calf strain. Allen Crabbe started in his place. ... Portland guard Tim Quarterman, who on Thursday was assigned to the Windy City Bulls of the NBA Development League, is expected to rejoin the Blazers sometime during the team's four-game road trip next week. Quarterman has appeared in 12 games for Portland this season. ... McCollum's streak of leading Portland in scoring ended at nine games.\n\nMCCOLLUM FINISHES FAST\n\nIt took almost all of 48 minutes, but McCollum scored at least 25 points for an eighth consecutive game, the third-longest in Portland history. Only Geoff Petrie (11 games) and Clyde Drexler (9) have longer streak among Blazer players. McCollum missed his first seven shots, and had only five points at halftime. But a 12-point fourth quarter did the job and he scored his final basket with 15 seconds remaining.\n\nUP NEXT\n\nMagic: Orlando plays at Utah on Saturday.\n\nTrail Blazers: Portland travels to Washington to play the Wizards on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995658.069066
}