{
  "game_id": "0021900950",
  "espn_id": "401161592",
  "date": "Mar 08, 2020",
  "matchup": "MIL @ PHX",
  "headline": "Booker, Rubio help Suns race past Giannis-less Bucks",
  "body": "PHOENIX --  Devin Booker scored 20 of his 36 points in Phoenix's 47-point first quarter and the Suns beat the NBA-leading Milwaukee Bucks 140-131 on Sunday night,\n\nThe Bucks played without MVP Giannis Antetokounmpo because of a minor knee sprain. Injured Friday night in a loss at the Los Angeles Lakers, he'll also sit out Monday night at Denver.\n\nRicky Rubio had a triple-double for the Suns with 25 points, 13 assists and 13 rebounds, becoming the first Suns player since Steve Nash on March 30, 2005, with at least a dozen points, assists and rebounds.\n\n\"It is an honor for me,\" Rubio said of being in the same statistical realm of Nash, a player he has long admired.\n\nAron Baynes added 24 points, and Mikal Bridges had 21.\n\nKhris Middleton scored 39 points for Milwaukee. Former Suns guard Eric Bledsoe had 28.\n\n\"It is hard to win three quarters and lose a game by nine,\" Milwaukee coach Mike Budenholzer said. \"Still, it was a huge hole. They did a lot of things well.\"\n\nAfter the Bucks cut their deficit to eight points, Baynes threw down a dunk, banked in a layup and nailed a 3-pointer. Milwaukee rallied to close with within six, 134-128, and the Suns finished it off at the free-throw line.\n\n\"I just thought we executed; didn't panic,\" Suns coach Monty Williams said. \"And that's what you have to do against a team that maybe is the favorite to win a title.\"\n\nOn the heels of Baynes' unprecedented 9-of-14 3-point night against Portland, the Suns made eight of their first 10 and 9 of 14 overall to take a 19-point lead with their biggest quarter of the season.\n\n\"Tough first quarter for us,\" Budenholzer said. \"Phoenix's aggressiveness on both end of the court put them in a position where they could maintain a lead and take it home. `'\n\nBooker was 7 of 8 from the field, going 4-for-4 on 3-pointers, in the quarter. He finished 13 of 17 from the field, 4 of 6 on 3s, made 6 of 7 free throws and had eight assists.\n\n\"It's the highest form of respect for me,\" Booker said of the box-and-one defense the Bucks attempted. He credited his teammates with foiling it, as six Suns players scored in double figures.\n\n\"You could just tell right from the start of the game,\" Booker said. \"The energy, the aura around the locker room and the passion everyone showed. Even when we were up a lot, we are playing the right way, and when they make a run, we are playing the right way.\"\n\nSALUTE TO WOMEN\n\nBooker addressed the fans before the game, accompanied by Mercury stars Diana Taurasi and Skylar Diggins-Smuth, to celebrate International Women's Day.\n\nFAN WINS\n\nA fan swished a half-court shot and won a Kia.\n\nTIP-INS\n\nBucks: George Hill returned after a groin injury. He played 16 minutes and scored two points.\n\nSuns: C Deandre Ayton was sidelined by a left ankle sprain. F Cameron Johnson was not with the team, due to an illness.\n\nUP NEXT\n\nBucks: At Denver on Monday night.\n\nSuns: At Portland on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996454.4413881
}