{
  "game_id": "0021900513",
  "espn_id": "401161155",
  "date": "Jan 02, 2020",
  "matchup": "BKN @ DAL",
  "headline": "Doncic helps Mavs pull away in 4th for 123-111 win over Nets",
  "body": "DALLAS --  With Luka Doncic resting and Dallas' other two top scorers out with injuries, Seth Curry kept the Mavericks even with Brooklyn until the 20-year-old phenom could take over again.\n\nCurry scored 15 of his 25 points with Doncic sitting the last half of the third quarter, before the 2019 Rookie of the Year had 15 of his 31 in the fourth as the Mavericks pulled away for a 123-111 victory over the Nets on Thursday night.\n\nDallas avoided its first three-game losing streak of the season in the second straight game without 7-foot-3 forward Kristaps Porzingis and shooting guard Tim Hardaway Jr., who together have been good for about 30 points a night.\n\nCurry made all five of his 3-pointers and was 9 of 13 overall in the fourth game with at least 20 points this season for the younger brother of Stephen Curry.\n\n\"A lot of guys can make plays and we never know who's going to get the touches or the shots that night other than Luka,\" Curry said. \"It's fun to play. Every night it seems like somebody different is making a big impact.\"\n\nMaxi Kleber scored a season-high 18 points, making his first three 3-pointers and finishing 3 of 4 as the Mavericks shot 46% from long range (18 of 29) to open a six-game homestand, their longest of the season.\n\nDoncic remained tied with Jason Kidd for the franchise record for triple-doubles in one season with nine. That's in part because he had seven assists while taking more of the scoring load. Doncic had a game-high 13 rebounds.\n\nPorzingis is nursing a sore right knee -- not the one he injured in what ended up being his final game for the Knicks almost two years ago -- and Hardaway is working back from a hamstring strain.\n\nSpencer Dinwiddie led seven Brooklyn players in double figures with 19 points, but the Nets shot 33% while getting outscored 30-18 in the fourth quarter and losing their fourth straight game for the first time this season.\n\n\"We didn't get a stop,\" Dinwiddie said. \"Obviously, that's what kind of ballooned their lead and we obviously didn't make enough shots to keep pace.\"\n\nDoncic started a decisive 13-4 run with a 3-pointer midway though the fourth quarter and capped it with layup for a 116-104 lead with 3:48 remaining.\n\nCurry replaced Doncic midway through the third and made five of six shots, including all three of his 3s.\n\n\"The style we play offensively is very empowered to the players,\" coach Rick Carlisle said. \"When you get a guy like Seth that's hot, they just need to find him.\"\n\nBrooklyn's Dzanan Musa scored a career-high 14 points. Taurean Prince, Joe Harris, Wilson Chandler and Theo Pinson had 11 apiece.\n\nTIP-INS\n\nNets: G Garrett Temple missed his first game of the season with a right knee contusion. \"I think it's a short-term thing,\" coach Kenny Atkinson said. \"We collectively decided to use this game as our chance to rest it.\" ... Prince was called for a first-half technical for pushing Kleber, but a review showed Kleber knocking center Jarrett Allen to the floor by leaning in with a shoulder before Prince's shove. Kleber was assessed a technical as well.\n\nMavericks: Carlisle said there wasn't a timetable for the return of Porzingis and Hardaway. ... G/F Ryan Broekhoff is out indefinitely after fracturing his lower left leg in the final minute of Sunday's 108-95 loss to the Lakers. ... With J.J. Barea (10 points) and Justin Jackson making their first starts of the season, Broekhoff is the only Dallas player without a start.\n\nJORDAN'S QUIET RETURN\n\nDeAndre Jordan didn't hear any of the boos he used to in his first visit to Dallas since the Mavericks sent him to New York in the blockbuster seven-player trade that brought Porzingis and Hardaway almost a year ago.\n\nJordan, who had 10 points and 10 rebounds in his fourth start, signed with the Nets in the offseason. He spurned the Mavericks in free agency after agreeing to a deal with them and was booed incessantly each time the Los Angeles Clippers visited. But he joined Dallas three years after that eventful summer of 2015 when he took a buyout from the Clippers.\n\nGETTING DEFENSIVE\n\nThe Nets missed nine of their 13 shots during the decisive Dallas run in the fourth. Brooklyn was at 50% shooting for the game before the cold fourth. \"It all came down to whether we could put together a quarter of solid defense,\" Carlisle said. \"That's the game right there.\"\n\nUP NEXT\n\nNets: Toronto at home on Saturday.\n\nMavericks: Charlotte at home on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996713.160733
}