{
  "game_id": "0021800776",
  "espn_id": "401071449",
  "date": "Feb 02, 2019",
  "matchup": "CHA vs. CHI",
  "headline": "Walker's 37 points lift Hornets past Bulls 125-118",
  "body": "CHARLOTTE, N.C. --  Kemba Walker calls it \"messing with the bigs' timing.\"\n\nTime and time again, Walker found a way to get to basket on Saturday night and get shots off -- and make them -- among 7-footers in clutch situations, a rare trait for a 6-foot-1 point guard that has made him a three-time All-Star.\n\nWalker has come as close as you can to perfecting the art of stopping and starting on his drives and finding ways to freeze much taller defenders for just a moment, long enough to get up a layup off the glass.\n\n\"I try to do my best to throw them off as much as possible. That is what I have to do at my size,\" Walker said. \"It's a lot of different things. Using my body, timing. A lot of times they just can't time my jumps. Just trying to be as crafty as I can.\"\n\nThen he laughed and said, \"but I do get my shot blocked a lot honestly.\"\n\nBut the Chicago Bulls couldn't stop him on Saturday night.\n\nWalker had 15 of his 37 points in the fourth quarter, and the Charlotte Hornets pulled away late to defeat Chicago 125-118 for their fifth straight win at home.\n\nWalker, an All-Star game starter for the first time, had 10 assists and finished 5 of 6 from the field in the fourth quarter, sparking an 18-4 run to hand the Bulls their fifth loss in six games.\n\n\"He's so crafty that you never know which direction he's going,\" said Bulls 7-foot forward Lauri Markkanen, who struggled to defend Walker on switches. \"He's got so many moves and counters and counters. He uses his body real well to draw fouls and protect the ball.\"\n\nMalik Monk added 18 points and Nic Batum added 16 for the Hornets, who pulled back to .500 for the first time since Jan. 2.\n\nCharlotte trailed 100-99 with eight minutes remaining before Walker scored nine straight points, including a drive through the lane where he lowered his head and got past Zach LaVine before flipping up a contested right-handed layup and drawing a foul for an old-fashioned three-point play.\n\nBulls coach Jim Boylen called Walker a \"monster\" before the game, saying he has a way of making big shots that are \"depressing\" for an opposing defense.\n\n\"If he gets even with you (on his drive), then it's over,\" Boylen said. If you're not chest-to-chest with him, if you get side-saddle with him, it's over.\"\n\nTIP INS\n\nBulls: LaVine returned to the starting lineup after sitting out Chicago's win over Miami on Wednesday night with a sprained right ankle. He had 18 points and five rebounds. He appeared to lack some of his explosiveness, but did have a dunk after driving around Walker.\n\nHornets: Walker has 14 30-point games this season, the same number he had all of last season and one shy of his career-high of 15 in 2016-17.\n\nBIG NIGHT FOR PORTIS\n\nThe Hornets overcame 33 points from Chicago's Bobby Portis and 30 from Lauri Markkanen. Both had nine rebounds.\n\nIt was Portis who put on a show in the first half.\n\nThe 6-foot-11, third-year forward from Arkansas scored 22 points off the bench in the second quarter alone, and eclipsed his previous season high before halftime with 28 points. Portis was 12 of 16 from the floor in the first half with four 3-pointers, but limited to five points in the second half after the Hornets began double-teaming him.\n\n\"It's something he's got to learn to play with as a team,\" Boylen said of countering the double teams. \"We talked about it, our spacing. It's a learning moment for us and we'll get better at it.\"\n\nMONK ON A ROLL\n\nHornets second-year guard Malik Monk is heating up, averaging 17 points while shooting 46 percent from the field over the last four games.\n\n\"I'm in the gym working so I know it's going to come at some point,\" Monk said of his shooting.\n\nUP NEXT\n\nBulls: Host Pelicans on Wednesday night.\n\nHornets: Host Clippers on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994375.2128031
}