{
  "game_id": "0021500573",
  "espn_id": "400828460",
  "date": "Jan 12, 2016",
  "matchup": "CHI @ MIL",
  "headline": "Antetokounmpo scores 29, Bucks rally to beat Bulls 106-101",
  "body": "MILWAUKEE -- After being held to single digits in back-to-back games, Giannis Antetokounmpo broke out of his scoring slump.\nAntetokounmpo connected on 10 of 14 shots, hit key free throws down the stretch and scored 29 points, tying his second-best career performance, in sparking the Milwaukee Bucks past the Chicago Bulls 106-101 on Tuesday night.\n\"I was just trying to be aggressive and make plays\" Antetokounmpo said.\nAntetokounmpo also contributed 10 rebounds for his fourth double-double of the season.\n\"That's what we need from him,\" said Greg Monroe, who added 17 points and 12 rebounds for Milwaukee. \"He's at his best when he's attacking the rim and getting into the lane.\"\n\nTurnovers played a big part in the outcome. Milwaukee scored 30 points off of 17 Chicago turnovers. The Bucks had just five turnovers, easily besting the team's previous season-low of 10.\n\"We took care of the ball. We were strong with it,\" Milwaukee's interim head coach Joe Prunty said. \"The effort we made to take care of it was outstanding.\"\nIt marked the team's lowest turnover total in a regular season game since committing four against Atlanta on April 12, 2010.\n\"The turnovers were big. That's the game,\" said Jimmy Butler, who scored 30 points to lead Chicago. \"There's nothing else to say.\"\nNikola Mirotic and Tony Snell added 17 apiece for Chicago, which used a 25-9 run late in the third quarter and early into the fourth to seemingly gain control of the game.\nThe Bulls, who have lost three straight, have scored 100 or more points for 12 consecutive games. But Chicago has allowed at least 100 points in eight of those games.\nThe Bucks used an 8-0 run to tie the game at 91 in the fourth. Monroe's three-point play with 2:58 remaining gave the Bucks a 96-95 lead. Khris Middleton hit a 3-pointer from the corner to extend the lead to four.\nButler got the Bulls within two with a pair of free throws, but then Middleton made a jumper, and after Butler missed a reverse layup, Antetokounmpo snared the rebound with 8.7 left and sank both free throws to grow Milwaukee's lead to 104-98.\nThe Bulls sprinted to an early 11-point lead and held a 29-20 margin after the first quarter. Milwaukee shot 32 percent in the period.\nMilwaukee trailed 51-46 at the half. The Bulls outrebounded the Bucks 35-19 in the first half, including 14 offensive boards. Snell had 12 first-half points off the bench for Chicago.\nTIP-INS\nBulls: Derrick Rose, who briefly went to the locker room late in the first quarter, left the game again in the third with left patellar tendinitis. He returned in the fourth, before departing again. \"With my jumpers, it just didn't feel right. I'm not concerned. I'm just trying to be smart,\" Rose said. ... Butler, who played at Marquette University in Milwaukee, wore blue and gold high-top shoes adorned with a Marquette Golden Eagle logo.\nBucks: Guard Jerryd Bayless missed a fourth consecutive game with a sprained left ankle. . Guard O.J. Mayo returned after missing one game with a sore left hamstring. ... For the second time this season, the Bucks used an alternate court, the only one in the league, and uniforms that featured jerseys with only the team's logo against a black backdrop.\nREMEMBERING J.J.\nA moment of silence was held for John \"J.J.\" Johnson, a high school basketball star in Milwaukee who later played on the Seattle SuperSonics' only NBA championship team. Johnson died last week at the age of 68. A two-time all-star with the Cleveland Cavaliers, Johnson scored 11,200 points in a 12-year career that ended in 1982.\nIN THE HOUSE\nMilwaukee Brewers manager and local native Craig Counsell attended the game.\nUP NEXT\nBulls: At Philadelphia on Thursday night.\nBucks: At Washington on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764993931.936633
}