{
  "game_id": "0021900609",
  "espn_id": "401161251",
  "date": "Jan 15, 2020",
  "matchup": "TOR @ OKC",
  "headline": "Powell's 23 help Raptors hold off Thunder 130-121",
  "body": "OKLAHOMA CITY --  Norman Powell doesn't need to work his way back into form.\n\nThe Toronto guard missed 11 games with a left shoulder injury before returning to action this week. In his second game back, he scored 23 points, and the Raptors held off a furious rally to beat the Oklahoma City Thunder 130-121 on Wednesday night.\n\nPowell scored 20 points on Sunday against the San Antonio Spurs in his first game back, then followed up with another strong performance. He made 9 of 11 shots, including 3 of 4 3-pointers.\n\n\"I've just tried to come back and assert myself and be aggressive in the flow of the offense and play my game and continue to take what the defense is giving me,\" Powell said.\n\nPascal Siakam and O.G. Anunoby each added 21 points for the Raptors, who shot a season-high 61.2% from the field.\n\nDennis Schroder scored 25 points, Danilo Gallinari scored 23 and Shai Gilgeous-Alexader added 21 for the Thunder, who cut a 30-point deficit to three before Toronto held on.\n\n\"Just calmed down a little bit,\" Toronto guard Kyle Lowry said. \"Just got a little bit more patient. Got the ball in the guy's hands that we need to have the ball in. That's what we need to do. We find a way, but we can't put ourselves in those positions all the time.\"\n\nToronto led 73-43 in the second quarter before the Thunder closed the first half on a 12-0 run. Gilgeous-Alexander hit a 3-pointer as time expired in the second quarter to cut Toronto's lead to 73-55. Former Thunder player Serge Ibaka scored 13 points on 6-for-6 shooting before the break. The Raptors led 97-83 heading into the fourth, and had a 21-point lead with 6:39 to play.\n\nOklahoma City made a huge comeback try late. Gallinari threw down a monster dunk and was fouled with 2:39 to play. The free throw cut Toronto's lead to three, but Toronto closed the game on an 8-2 run.\n\nThe Raptors remained composed during Oklahoma City's run.\n\n\"You don't want to go outside yourself,\" Powell said. \"When they go on a run like that, you just try to get everybody on the same page.\"\n\nThe Thunder have made several big rallies this season, but like Saturday against the Los Angeles Lakers, a large deficit was too much to overcome.\n\n\"I think to start the game, we don't bring it every game,\" Gilgeous-Alexander said. \"When we do bring it, we're tough to beat and can play with anybody. But obviously, you guys see that when we don't, we get down against a lot of teams. That's something we'll fix and we'll get better at. I'm not worried about that.\"\n\nTIP-INS\n\nRaptors: Coach Nick Nurse said G Fred VanVleet should be ready to play this weekend. VanVleet has missed four consecutive games with a right hamstring strain. ... C Marc Gasol returned after missing 12 games with a left hamstring pull. He finished with 15 points in 31 minutes. ... Had five players score in double figures in the first half. ... G Kyle Lowry was called for a technical in the third quarter.\n\nThunder: C Nerlens Noel missed his sixth straight game with a left ankle sprain. ... C Steven Adams left the game in the first half with a right knee contusion and did not return. ... C Justin Patton scored 45 points in a G-League game on Tuesday. ... G Chris Paul had 16 points and 11 assists.\n\nSTAT LINES\n\nThunder center Mike Muscala had a season-high 17 points while filling in for Adams and Noel. He made 6 of 11 shots in a season-high 30 minutes.\n\nThe seventh-year player from Bucknell fell two points short of his career scoring high.\n\nHE SAID IT\n\nPaul on the rally: \"We just started scrapping and fighting. Those are the ones (games) we used to talk about early in the season. We can't wait that long to impose our will.\"\n\nUP NEXT\n\nRaptors: Host the Washington Wizards on Friday.\n\nThunder: Host the Miami Heat on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995957.7002828
}