{
  "game_id": "0022000340",
  "espn_id": "401267500",
  "date": "Feb 04, 2021",
  "matchup": "MEM vs. HOU",
  "headline": "Wall, Gordon lead Rockets past Grizzlies 115-103",
  "body": "MEMPHIS, Tenn. -- — John Wall scored 22 points, Eric Gordon added 20 and the Houston Rockets beat the Memphis Grizzlies 115-103 on Thursday night.\n\n\r\n                    Jae’Sean Tate had a season-high 19 points for Houston, while Christian Wood scored 17 points on 7-of-10 shooting before rolling his right ankle in the third quarter. He did not return and left the arena in a wheelchair.\n\n\r\n                    Wall said the veteran Rockets have told Tate, a rookie, to stay within his game and take advantage of his shots, particularly corner 3s.\n\n\r\n                    “He listened to the veterans, so we’re fine with those,” Wall said.\n\n\r\n                    Rookie Desmond Bane led the Grizzlies with 16 points, while Ja Morant added 15. Tyus Jones and Brandon Clarke finished with 13 each as Memphis lost its second straight.\n\n\r\n                    Both teams lost by big margins in their previous games, ending extended winning streaks. But Houston showed no carryover from its 17-point loss at Oklahoma City on Wednesday. After shooting 26% from 3-point range against the Thunder, the Rockets were 19 of 45 (42.2%) against Memphis.\n\n\r\n                    Tate said that the loss to the Thunder “was a great wakeup call to us. We figured we came into a team that jumped on us from the gate.”\n\n\r\n                    “We just realized that we’re not that team that can just walk into games and not be ready from the jump.”\n\n\r\n                    The game got away from the Grizzlies late in the first half as the Rockets used an 18-4 run to carry a 60-47 lead into the break. The Grizzlies endured stretches of poor shooting in the half as Houston connected on 51% of its shots, including 9 of 18 from outside the arc.\n\n\r\n                    “Regardless of how we shoot the ball, we’ve got to be able to defend,” Bane said. “That’s got to be our constant and our consistent thing that we can hang our hat on. Tonight, we weren’t good enough.”\n\n\r\n                    Now, the Rockets must deal with the questions about Wood’s ankle.\n\n\r\n                    “We’ve just got to keep rolling and keep playing,” Wall said.\n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: Houston went 3-1 on its four-game trip. ... G Victor Oladipo sat out, officially for recovery from a right quad injury.\n\n\r\n                    Grizzlies: C Jonas Valanciunas and G Grayson Allen remained out due to the league’s health and safety protocol. ... The Grizzlies shot 42.5% for the game. ... Jones and Bane were each 5 of 8 from the field. ALL-\n\n\r\n                    ALL-STAR JA\n\n\r\n                    Morant is in fourth place for Western Conference guards in the first returns in All-Star voting. He sits behind Stephen Curry, Luka Doncic and Damian Lillard. “Ja means so much to us, and I think people are recognizing not just the individual talent that he is, but the impact he has on winning and playing in that All-Star consideration,” Grizzlies coach Taylor Jenkins said.\n\n\r\n                    MORE FANS IN STANDS\n\n\r\n                    The Grizzlies moved into their third phase Thursday of allowing fans back into games on a limited basis. Previously, the team had a limited number of fans to socially distant courtside seats in groups of two to four. Later, suite holders and club box seats were allowed to attend. For the Houston game, select groups of season ticket holders were added to the previous groups, meaning up to 2,000 people or about 11% of capacity. FedExForum is allowed up to 20% capacity.\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Host the San Antonio Spurs on Saturday.\n\n\r\n                    Grizzlies: At New Orleans on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996973.6036968
}