{
  "game_id": "0022000530",
  "espn_id": "401267690",
  "date": "Mar 01, 2021",
  "matchup": "PHI vs. IND",
  "headline": "Korkmaz, Milton come off bench, spark 76ers rout of Indiana",
  "body": "PHILADELPHIA -- — Shake Milton shook off a defender with a crossover that sent the 76ers into a frenzy, and Furkan Korkmaz buried 3-pointers that sent them on their way toward a romp.\n\n\r\n                    This win belonged to the bench.\n\n\r\n                    Milton scored 26 points, Korkmaz had 19 and the reserves sparked the Philadelphia 76ers to 130-114 win over the Indiana Pacers on Monday night.\n\n\r\n                    “The ball was hopping,\" Milton said. “Everybody was getting a feel for it.”\n\n\r\n                    The Sixers followed one of their worst losses of the season to the struggling Cleveland Cavaliers on Saturday with a smackdown of the mediocre Pacers. Joel Embiid had 24 points and 13 rebounds on a sore left ankle. Ben Simmons had 18 points and six rebounds.\n\n\r\n                    The All-Stars got their numbers.\n\n\r\n                    The reserves got their highlights.\n\n\r\n                    Milton sank three 3-pointers and Korkmaz hit six 3s in a game in which they got some time, turning it into a rout.\n\n\r\n                    Korkmaz and Milton blew the game open for the Sixers in the second quarter and built a 20-point lead. Korkmaz, averaging 7.6 points, and Milton 13.4, about crushed those numbers in the quarter. Milton was 4 of 6 for nine points; Korkmaz sank four 3-pointers and scored 13.\n\n\r\n                    “It's what we need,” 76ers coach Doc Rivers said. “We’re still working with that group, trying to figure out what we can run that fits us the best.”\n\n\r\n                    Embiid passed out of a couple of double-teams to find Korkmaz -- nicknamed both Furky and Korky, you pick -- and he buried 3s that opened up a double-digit lead.\n\n\r\n                    Milton -- in a move that would have made Allen Iverson proud -- hit a crossover on Myles Turner that left him stumbling toward the basket. Milton buried the 21-footer that sent the bench into a towel-waving frenzy. Public address announcer Matt Cord even chuckled when he said Milton’s name for the basket.\n\n\r\n                    Matched up mostly against Embiid, the bad night continued for Turner when he was roasted by Embiid.\n\n\r\n                    “I say this respectfully, but that’s a matchup I’ve dominated since I got to the league,” Embiid said.\n\n\r\n                    Milton hit fellow reserve Matisse Thybulle on an alley-oop and found Embiid for an 11-footer to give the Sixers a 72-55 lead at the break. The Sixers' bench scored 26 of their 39 points in the second and made five of their six 3s.\n\n\r\n                    The Pacers had no answers.\n\n\r\n                    “When a bad play happens, we can't let it snowball and let if affect other things that we do,” Pacers coach Nate Bjorkgren said.\n\n\r\n                    The Sixers, who still have the best record in the East at 23-12, were stunned by the Cavs in OT on Saturday. Rivers said the Sixers treated that one like a “walkthrough.”\n\n\r\n                    They woke up against a Pacers team that has lost four straight games. Malcolm Brogdon returned from a one-game absence because of a sore right knee and led the Pacers with 20 points.\n\n\r\n                    “This is not a losing team or a losing culture,” Brogdon said. “This is not what we’re used to.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Doug McDermott left the game with a broken tooth. ... Jeremy Lamb sat out with a sore left knee.\n\n\r\n                    76ers: Tobias Harris, who averages 20.2 points, sat out a second straight game with a bruised right knee. He could return for Wednesday's game against Utah.\n\n\r\n                    FAN APPRECIATION\n\n\r\n                    Pennsylvania eased restrictions Monday on large gatherings to reflect a sustained slide in new COVID-19 cases, hospitalizations and deaths. The Wells Fargo Center said it would quickly allow fans into Flyers and 76ers games if city officials give the go-ahead. Under the relaxed gathering limits announced by Gov. Tom Wolf, indoor occupancy will be 15% of maximum capacity, regardless of venue size.\n\n\r\n                    “We want to see our fans here,” Rivers said. “We have proven here in Philadelphia that it is a home court. Our fans are phenomenal. We need them here. It would be awesome in the second half of the season if we could have fans. It could really boost us.”\n\n\r\n                     UP NEXT\n\n\r\n                     Pacers: Play Wednesday at Cleveland.\n\n\r\n                     76ers: Host Utah on Wednesday in what could be a matchup of teams with the best record in each conference.\n\n\r\n                     ----------\n\n\r\n                     More AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997093.4975722
}