{
  "game_id": "0021800667",
  "espn_id": "401071343",
  "date": "Jan 17, 2019",
  "matchup": "PHI @ IND",
  "headline": "Embiid, Butler lead 76ers' 120-96 rout of Pacers",
  "body": "INDIANAPOLIS --  If the Philadelphia 76ers are going to move up in the Eastern Conference standings, they might do it on the strength of their passing.\n\nJoel Embiid had 22 points, 13 rebounds and eight assists Thursday night to lead the Sixers to their seventh win in nine games, a 120-96 blowout of the Indiana Pacers.\n\nJimmy Butler added 27 points and eight assists as Philadelphia shot 53 percent and finished with 38 assists, the most by an Indiana opponent this season.\n\n\"We had 40 assists the last time we played at home,\" 76ers coach Brett Brown said. \"We backed that up with 38. To come into Indianapolis and be able to set the table with our defense but also share the ball the way we did, that's a statement we're proud of. That set the table for a good night.\"\n\nPhiladelphia ranks third in the league in assist rate and tops the league with 17 games of at least 30 dimes.\n\nBen Simmons (eight assists), J.J. Redick (five) and T.J. McConnell (five) also showed their passing prowess.\n\n\"The fact that it's (spread out) amongst our group, that's a huge statement,\" Brown said. \"I'm proud of us sharing.\"\n\nIn a matchup of two of the top teams in the Eastern Conference, the 76ers improved to 2-1 in the four-game season series. The road team has won all three games. Philadelphia moved within percentage points of Indiana for third place in the East.\n\n\"We're learning the offense,\" Simmons said. \"We're learning where guys are without the ball, and we're having fun out there.\"\n\nRedick contributed 20 points. Indiana's starting backcourt of Darren Collison and All-Star Victor Oladipo was limited to 21 combined points on 9-of-30 shooting.\n\nWhat had been a competitive game turned into a rout in the third quarter. The 76ers led 28-25 after the first quarter and 54-48 at halftime, but a quick 8-0 run put them up 66-55 and prompted Pacers coach Nate McMillan to call timeout. Redick hit two 3-pointers assisted by handoffs from Embiid, and Embiid scored in the lane during the burst.\n\nT.J. McConnell's driving bank shot in the final seconds of the quarter pushed the lead to 15 for the first time. Philadelphia carried that 86-71 advantage to the fourth.\n\nRedick's sixth 3 made it an 18-point lead. Indiana replied with a 10-0 run, but back-to-back 3s from Embiid and his backup, Mike Muscala, quieted the crowd and forced yet another Indiana timeout.\n\nMuscala had 11 points and seven rebounds.\n\nIndiana, held to 40 percent shooting, never challenged again. Ex-Sixer Thaddeus Young had 27 points and six rebounds. Oladipo ended up with 15 points and seven assists.\n\n\"From start to finish, they ran their stuff, passed and scored,\" Oladipo said. \"Their big dogs were big. It should be a wake-up call for us.\"\n\nTIP-INS\n\n76ers: Embiid was third and Butler fifth among Eastern Conference frontcourt players in fan votes for the All-Star Game when the league announced the third set of ballot returns Thursday. Simmons was fourth among guards. ... Listed as questionable to play because of back tightness, Embiid stretched on a foam roller during one rest.\n\nPacers: Reggie Miller, back where he played his entire 18-year NBA career, served as an analyst on TNT's broadcast and toured the Pacers' new practice facility near Bankers Life Fieldhouse. Miller ranks second on the NBA's career 3-point list at 2,560, though Stephen Curry is on his heels at 2,313. ... Oladipo was fifth among East guards in All-Star voting as of Thursday.\n\nUP NEXT\n\n76ers: Return home to face Oklahoma City on Saturday.\n\nPacers: Continue a five-game homestand Saturday night against Dallas.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994028.672245
}