{
  "game_id": "0021800351",
  "espn_id": "401071032",
  "date": "Dec 04, 2018",
  "matchup": "MIA vs. ORL",
  "headline": "Gordon scores 20, Magic run away to top Heat 105-90",
  "body": "MIAMI --  Aaron Gordon and the Orlando Magic added to Miami's rising level of frustration.\n\nGordon scored 20 points and grabbed 13 rebounds, Nikola Vucevic finished with 19 points and 10 rebounds and the Magic rode the strength of a big third quarter to take control and beat the Heat 105-90 on Tuesday night.\n\nGordon had 16 of his points in the third as Orlando outscored Miami 30-12, the Magic turning what was a four-point halftime deficit into a 14-point lead. Most Miami fans started heading to the exits with a few minutes left, and Heat center Hassan Whiteside left for the locker room with 40.5 seconds remaining.\n\n\"Probably extremely upset, like we all are right now,\" Heat coach Erik Spoelstra said, after his team dropped to 9-14.\n\nWhiteside wasn't available for comment after the game. A team official said Whiteside went upstairs to the team's practice court after the game to shoot free throws after going 0 for 2 on Tuesday -- dropping him to a staggering 4 for his last 28 from the foul line over the last six-plus games, a 14.3 percent clip.\n\nHis free throws aren't why Miami lost Tuesday, but merely just one of many things going wrong for the Heat right now.\n\n\"I thought our offense just stunk tonight,\" Heat guard Dwyane Wade said.\n\nMiami had won two straight, but Wade said the same approach that the Heat had in those victories over New Orleans and Utah wasn't there against Orlando.\n\n\"It didn't feel like a game,\" Wade said. \"It didn't feel like the last two games felt, when we needed wins because we were struggling. After winning two, I felt like we relaxed for some reason, like we've got enough wins around here. We've got to go. It's go time, man. You don't want to get too far behind.\"\n\nTerrence Ross added 19 off the bench for the Magic, who were 14 for 28 from 3-point range. Evan Fournier scored 13 and DJ Augustin had 11 for Orlando.\n\n\"We just picked it up on the defensive end,\" Gordon said. \"Stops on the defensive end, playing the whole court and being aggressive.\"\n\nJustise Winslow scored 14 for Miami, which still hasn't had a three-game winning streak this season. Kelly Olynyk scored 13, Whiteside had 12 and Wade and James Johnson each added 11 for the Heat.\n\nMiami was only 2 for 5 from the foul line in the game, as opposed to Orlando's 15 for 20. The two free throws made in a game tied a record-low in Heat history, and the five attempted ties for the second-lowest.\n\nLulls have doomed Miami all season, and a third-quarter one was the difference.\n\nThe Magic were 1-10 this season in games in which they weren't winning at halftime, but outscored the Heat 30-12 in the third quarter to grab control. It was Miami's lowest-scoring quarter of the season -- one point less than its opening quarter against Brooklyn on Nov. 20 -- and the worst quarter the Heat had against Orlando since an 11-point third on Feb. 8, 2012.\n\n\"It's our inability to sustain,\" Spoelstra said. \"That's it. ... There's a flagrant inconsistency that we keep bumping into.\"\n\nOrlando held the Heat to 24 percent shooting in the third (5-21) and the Magic didn't commit a turnover in the period.\n\n\"Obviously Aaron Gordon was tremendous in the third quarter, both his offense and the defense,\" Magic coach Steve Clifford said. \"Our defense was better and they missed some open shots also.\"\n\nTIP-INS\n\nMagic: Orlando is 2-0 against the Heat this season and 7-2 in the last nine meetings. ... The Magic have posted three quarters with a score differential of plus-18 or better this season -- and all have been on the road, against New York (20), Golden State (18) and Miami (18).\n\nHeat: Tyler Johnson returned after missing six games with a hamstring strain. Goran Dragic (knee), Derrick Jones Jr. (hamstring) and Dion Waiters (ankle rehab) remained sidelined. ... It was Miami's last home game until Dec. 20.\n\nSOUTHEAST WOES\n\nOrlando is now atop the Southeast Division at 12-12. The five teams in Southeast are a combined 47-71 this season.\n\nMO' WADE BLOCKS\n\nWade added another 7-footer to his blocked-shot collection, when he rejected Orlando rookie Mo Bamba at the rim in the fourth quarter. No player who stands 6-foot-4 or less has more blocks in their career than Wade.\n\nUP NEXT\n\nMagic: Host Denver on Wednesday.\n\nHeat: Visit Phoenix on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995257.273481
}