{
  "game_id": "0022400137",
  "espn_id": "401704703",
  "date": "Nov 01, 2024",
  "matchup": "TOR vs. LAL",
  "headline": "Davis scores season-high 38, Lakers beat Raptors 131-125 for first road win of the season",
  "body": "TORONTO -- — Anthony Davis scored a season-high 38 points and had 12 rebounds, LeBron James had 27 points and 10 assists, and the Los Angeles Lakers never trailed in a 131-125 win over the Toronto Raptors on Friday night.\n\n\r\n              Austin Reaves scored 20 points and D’Angelo Russell had 19 as the Lakers built a lead that the Raptors were unable to overcome.\n\n\r\n              Los Angeles led by as many as 26 in its fourth consecutive win over Toronto before the Raptors battled back in the second half.\n\n\r\n              RJ Barrett had a season-high 33 points and a career-high 12 assists, but Toronto lost its fourth straight. Gradey Dick scored a career-high 31 points and Jakob Poeltl had 19 points and 12 rebounds.\n\n\r\n              After scoring his first career basket in Wednesday’s loss at Cleveland, Lakers rookie Bronny James checked in for the final 7.6 seconds. \n\n\r\n              Takeaways\r\n              Lakers: Following back-to-back losses at Phoenix and Cleveland, Los Angeles won on the road for the first time this season.\n\n\r\n              Raptors: Rookie guard Ja’Kobe Walter made his season debut and completed a three-point play early in the second quarter for his first career points. He shot 1 for 8 and finished with five points in 20 minutes. Toronto’s first-round pick missed training camp and the start of the season with a sprained right shoulder.\n\n\r\n              Key moment\r\n              Toronto cut the deficit to 104-98 in the fourth, but Max Christie made two free throws and Rui Hachimura connected on consecutive corner 3s to restore the Lakers’ double-digit edge.\n\n\r\n              Key stat\r\n              Los Angeles tripled Toronto's free throw attempts, shooting 36 for 41 while the Raptors finished 11 for 13.\n\n\r\n              Up next\r\n              The Raptors will retire Vince Carter’s jersey in a halftime ceremony when they host Sacramento on Saturday night, and the Lakers visit Detroit on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997006.295579
}