{
  "game_id": "0022000615",
  "espn_id": "401307400",
  "date": "Mar 16, 2021",
  "matchup": "LAL vs. MIN",
  "headline": "LeBron gets 99th triple-double, Lakers rout Wolves 137-121",
  "body": "LOS ANGELES -- — LeBron James had 25 points, 12 rebounds and 12 assists in his 99th career triple-double, leading the Los Angeles Lakers to a 137-121 victory over the Minnesota Timberwolves on Tuesday night.\n\n\r\n                    Montrezl Harrell scored 25 points in another big game for the defending NBA champions, who picked up their third straight victory on the second night of a back-to-back set. James also recorded a triple-double Monday night at Golden State while Harrell scored 27 points.\n\n\r\n                    “He’s obviously the best reader of pick-and-roll action in the game, and Trez is a dynamic roller,” Lakers coach Frank Vogel said. “Minnesota had a hard time figuring it out, and we have a mindset with our stuff that if a play works, we keep running it.”\n\n\r\n                    Dennis Schröder had 16 points and seven assists, while Kyle Kuzma and Talen Horton-Tucker scored 16 points apiece and excelled in the second half as the Lakers pulled away from NBA-worst Minnesota in the fourth quarter with 35 points on 14-for-23 shooting, particularly out of James' pick-and-rolls.\n\n\r\n                    The Lakers had 37 assists against Minnesota after racking up 36 at Golden State, giving them 35 or more assists in back-to-back games for the first time since 1996.\n\n\r\n                    “I'm just trying to dictate play, and whatever the defense gives us, just put the ball on target at the right times and make the right reads,” James said. “I was able to do that, especially in the fourth quarter.”\n\n\r\n                    The undersized Harrell had another strong game in the paint as the Lakers kept winning without starting big men Anthony Davis and Marc Gasol. Davis missed his 12th straight game with a right calf injury likely to sideline him until April.\n\n\r\n                    Karl-Anthony Towns and Anthony Edwards scored 29 points apiece for the Timberwolves, who had won two of their last three games for the first time since December.\n\n\r\n                    “When a young team like we are gets tired, bad habits kick in,” said Ricky Rubio, who scored 14 of his 19 points in the first half. “One of those is you settle for a jumper or a pull-up 3 instead of attacking to the rim. That’s why experience in this league is so important. With a veteran team like the Lakers, in the fourth quarter when the fatigue kicks in, they get even better. We’ve got to learn from that.”\n\n\r\n                    Minnesota made 52% of its shots against one of the NBA's best defensive teams, but allowed eight Lakers to score at least eight points apiece.\n\n\r\n                    “I thought we came out and started great, and then our shot selection got away from us,” Minnesota coach Chris Finch said. “We took a bunch of half-baked shots ... and that allowed them to come back to tighten the game up again.”\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Jordan McLaughlin missed his fourth straight game under the NBA's health and safety protocols. ... Former Lakers guard D'Angelo Russell is expected to rejoin the team this week. He had arthroscopic knee surgery a month ago.\n\n\r\n                    Lakers: Gasol missed his fifth straight game under the NBA's health and safety protocols. He hasn't played since February. ... Alex Caruso missed his second straight game in the NBA's concussion protocol. He worked out on the court before the game.\n\n\r\n                    LEBRON MESSED AROUND\n\n\r\n                    Midway through the fourth quarter, James secured his fifth triple-double of the season — and his second straight after a 22-point, 11-assist, 10-rebound performance in San Francisco on Monday.\n\n\r\n                    “I honestly don’t think (James) has been playing that differently than what he was doing leading into the break,” Vogel said. “I just think our shooters have come alive. I think we hit a little bit of a wall coming into the break, and then our shooters got their legs under them a little bit, and in the last three games they’ve been hitting shots, so his assist totals are up.”\n\n\r\n                    Only four players in NBA history have recorded 100 triple-doubles, and they include Lakers assistant coach Jason Kidd (107). Oscar Robertson holds the record with 181, but Russell Westbrook is up to 157. Lakers great Magic Johnson is third with 138.\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: At Suns on Thursday.\n\n\r\n                    Lakers: Host Hornets on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997935.98461
}