{
  "game_id": "0022300498",
  "espn_id": "401585126",
  "date": "Jan 07, 2024",
  "matchup": "BKN vs. POR",
  "headline": "Simons scores 38, Trail Blazers nearly flawless in overtime to beat the Nets 134-127",
  "body": "NEW YORK -- — Anfernee Simons had 38 points and 11 assists, Malcolm Brogdon scored eight of his 18 points during Portland’s nearly flawless overtime, and the Trail Blazers beat the Brooklyn Nets 134-127 on Sunday.\n\n\r\n              Jerami Grant added 27 points, Duop Reath had 15 points and 13 rebounds, and Shaedon Sharpe chipped in 21 points off the bench for the Blazers. Portland (10-25) snapped its four-game losing streak and won for the first time in eight road games.\n\n\r\n              “We definitely needed it,” Brogdon said. “To pull a win like this out, this is a team competing for a playoff spot, it’s a really good win for us.\n\n\r\n              “I think we’re a young team, we’re inexperienced to put a full 48 minutes together. Tonight we were able to put 53 minutes together, so I’m proud of this group.”\n\n\r\n              Mikal Bridges scored 42 points and made the tying jumper with 1.5 seconds remaining in regulation. But Portland then shot 6 for 7 in overtime, with Brogdon hitting all three shots, including two 3-pointers.\n\n\r\n              “We played great,” Simons said. “We got stops when we needed to. Malcolm came up big for us. I’m just proud of the guys today.”\n\n\r\n              Nic Claxton had 16 points, 11 rebounds and four blocks for the Nets (16-21), who have lost 11 of their last 14 games and play their next one in Paris on Thursday against Cleveland.\n\n\r\n              “For us not to win this basketball game (is) very disappointing,” Nets coach Jacque Vaughn said.\n\n\r\n              The Trail Blazers did not lead until the fourth quarter, and trailed by as many as 10 in the second half, yet appeared poised to snap their lengthy skid on Sharpe’s driving layup that made it 115-113 with 5.5 seconds left in regulation.\n\n\r\n              “Shaedon was locked in,” Blazers coach Chauncey Billups said. “With them trying to take away (Simons), if they’re going to put two on the ball, we’ve got to be comfortable wherever that ball lands.”\n\n\r\n              Bridges answered with a fall-away jumper that forced overtime, then scored seven of the Nets’ 12 points in the extra session.\n\n\r\n              “Just getting to spots and making (shots),” Bridges said of his success scoring. “But I don’t really care too much, especially after an ‘L.’”\n\n\r\n              But the Trail Blazers had an 11-2 run in the extra period, with Simons scoring six points.\n\n\r\n              “Ant was really doing all the hard work for us,” Brogdon said. “For me, it’s a matter of what I do every day, which is shoot the ball. That’s my comfort zone; Ant was making the right reads every single time down the floor, and we had to help him out.”\n\n\r\n              UP NEXT:\n\n\r\n              Trail Blazers: Visit New York on Tuesday.\n\n\r\n              Nets: Play Cleveland in Paris on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996348.453803
}