{
  "game_id": "0022300745",
  "espn_id": "401585373",
  "date": "Feb 09, 2024",
  "matchup": "CHA @ MIL",
  "headline": "Rivers wins No. 1,099 as Bucks trounce Hornets 120-84 to send Charlotte to its 10th straight loss",
  "body": "MILWAUKEE -- — Doc Rivers won his 1,099th regular-season game to move into eighth place on the NBA's list, Damian Lillard scored 26 points in his return from a two-game injury absence and the Milwaukee Bucks cruised past short-handed Charlotte 120-84 on Friday night to send the Hornets to their 10th straight loss.\n\n\r\n              Malik Beasley made seven 3-pointers on nine attempts and finished with 21 points for Milwaukee, which improved to 2-5 under Rivers, who replaced Adrian Griffin. Rivers moved past Larry Brown on the regular-season victories list.\n\n\r\n              Giannis Antetokounmpo had 15 points and 15 rebounds in just 24 minutes, and Bobby Portis added 18 points and seven rebounds.\n\n\r\n              The Bucks led by 28 points at halftime and increased their lead to as many as 42 in the second half.\n\n\r\n              Lillard missed the previous two games — both losses — with a sprained left ankle but showed no ill effects Friday and said he felt good. He shot 9 of 18 and added eight assists in 29 minutes, but he was most pleased with the way the Bucks played defense.\n\n\r\n              “We were just more physical,” Lillard said. “Doc just challenged us. He checked us on what we say we want to do versus what we've been doing. To be a team that is considered a contender and what we want to accomplish, we've got to start acting like it.”\n\n\r\n              The Bucks limited Charlotte to 17 points in the first quarter and the Hornets shot just 34.2% from the field (27 of 79) overall.\n\n\r\n              “I thought we set a tone defensively,” Rivers said. “We were flying around tonight. Our energy was high. I didn't see our guards get picked tonight. We've just got to keep working on it.”\n\n\r\n              Brandon Miller and Nick Richards each scored 16 points for the Hornets (10-41), who had just 10 available players and used all of them after making several moves at the trade deadline Thursday.\n\n\r\n              It was the 13th game this season that Beasley made five or more 3-pointers, breaking a Bucks franchise mark set by Ray Allen during the 2001-02 season. Beasley had struggled from 3-point range against Minnesota on Thursday, going 0 for 9 in the Bucks’ lopsided loss to the Timberwolves.\n\n\r\n              “Last night, I knew going in I had a chance to break the record, and I put too much pressure on myself thinking about my shot,” Beasley said. “And tonight I did the opposite. I focused on defense and not getting screened.”\n\n\r\n              Beasley shot 5 of 6 from beyond the arc in the first half against the Hornets, leading the Bucks to a 66-38 halftime lead. Beasley sank a 3 with less than a second remaining to give the Bucks their biggest lead of the half.\n\n\r\n              Milwaukee made 12 of 28 shots from 3-point range in the half, and Beasley led the way with 15 points while Portis had 13, Antetokounmpo 12 and Lillard 11. \n\n\r\n              The Bucks finished 18 of 52 from 3-point range (34.6%).\n\n\r\n              Veteran guard Patrick Beverley made his Bucks debut after being acquired in a trade with Philadelphia on Thursday. He checked in to a loud ovation with 2:28 left in the first quarter and drilled a 3-pointer from the corner on his first shot. He finished with six points and four assists in 12 minutes.\n\n\r\n              Beverley said it was important for him to play even though he arrived about 10 hours earlier.\n\n\r\n              “I ain't going to lie. I didn't want to meet (the) Denver Nuggets on my first game,\" Beverley said. \"OK, cool, let me see what's going on with Charlotte. Let me get my routine under me. I have eight suitcases in the hotel still unpacked. Just trying to learn off the go.”\n\n\r\n              Rivers and Beverley have a close relationship from their years in Los Angeles with the Clippers, and Beverley said it meant a lot to be reunited following the trade Thursday.\n\n\r\n              “He's just positive energy,\" Rivers said. “He holds his teammates and himself accountable and he really just wants to win. I think our guys see that.”\n\n\r\n              Beverley was acquired to help bolster the Bucks' perimeter defense, which has struggled to stop opposing guards this season. \n\n\r\n              The Hornets were depleted after making several deals at the trade deadline, including acquiring Seth Curry and Grant Williams from Dallas on Thursday. Curry and Williams were scheduled to join the team in Charlotte, where the Hornets will play Memphis on Saturday night.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Denver on Monday.\n\n\r\n              Hornets: Host Memphis on Saturday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995965.015717
}