{
  "game_id": "0021400864",
  "espn_id": "400579156",
  "date": "Feb 27, 2015",
  "matchup": "MEM vs. LAC",
  "headline": "Paul, Jordan lead Clippers past Grizzlies 97-79",
  "body": "MEMPHIS, Tenn. -- The Los Angeles Clippers believe with more consistency, particularly on defense, they can start making a move in the Western Conference playoff race.\nThe Clippers showed a physical, stout defense Friday night, holding Memphis to 38 percent shooting in defeating the Grizzlies 97-79.\n\"We've been saying it all year, it's all about being consistent,\" said Chris Paul, who had 19 points and 13 assists. \"We have spurts like this where we defend. We have to go into (a Sunday game at Chicago) with the same mindset and don't let this be a one-game thing.\"\nJamal Crawford also had 19 points, and J.J. Redick finished with 18. DeAndre Jordan continued his inside dominance of this month, scoring 15 points and grabbing 22 rebounds. He entered the game averaging 16.1 points and 16.7 rebounds in February.\nThe score would indicate a game more in the Grizzlies' methodical approach, but it was the Clippers who stymied Memphis' offensive rhythm.\n\"I thought for the most part, (the Grizzlies) earned their baskets,\" Clippers coach Doc Rivers said. \"When they made a shot, they made a shot. We had very few breakdowns defensively.\"\nZach Randolph led Memphis with 20 points and 10 rebounds, while connecting on 10 of 18 shots. Courtney Lee added 12 points, while Marc Gasol scored 11 as the Grizzlies lost their second straight.\nDespite Randolph's shooting, Memphis struggled, including Gasol going 5 of 12 and point guard Mike Conley missing nine of his 11 shots. Jeff Green missed all six of his shots.\nMeanwhile, Los Angeles finished at 46 percent, including Redick, Paul and Crawford connecting on half their shots. The Clippers were 9 of 26 from outside the arc, including 7 of 12 in the second half, when they built a double-digit advantage.\nThe first half was played at slow, low-scoring pace contributing to a 41-all deadlock at halftime.\n\"They really set the tone aggressively early and throughout the course of the game,\" coach Dave Joerger said.\nThe Clippers' defense early in the second half stalled the Grizzlies, sending Memphis late into the shot clock and out of rhythm on offense. Memphis missed its first four shots of the half and committed a trio of early turnovers.\nMeanwhile, the Clippers were hitting seven of their first 10, including all five from outside the arc, giving Los Angeles a 62-47 lead before maintaining a 69-62 advantage entering the fourth.\n\"They hit shots, man. That's what it was,\" Randolph said of the second-half difference.\nThe Clippers not only kept Memphis shooting under 40 percent after halftime, but forced nine of the Grizzlies 16 turnovers in the game, leading to Los Angeles outscoring Memphis 56-38 in the final two quarters.\n\"We can see how consistent we can be,\" reserve forward Glen Davis said. \"We have so much talent on this team. If we can translate it into defense, offense and have that energy, we can get hot and do some real damage.\"\nTIP-INS:\nClippers: Los Angeles played its second game of a four-game road trip covering six days. ... Jordan recorded his seventh consecutive game with at least 15 rebounds.\nGrizzlies: Memphis recorded its 11th sellout of the season. ... Memphis entered having won its last eight against teams from Los Angeles (5-0 against Lakers, 3-0 against Clippers). ... Memphis had won eight of the last nine in the series with the Clippers, including the postseason.\nHALFTIME SHOWDOWN: Paul said there weren't any real adjustments at halftime. \"Only thing that happened at halftime is I was playing one-on-one with (reserve Dahntay Jones') son,\" Paul said. \"He got me going. I made a couple of shots on him.\"\nDON'T LISTEN TO ME: Rivers said he emphasizes to his team to make the extra pass, but noted four occasions when they did it inside leading to turnovers. \"At halftime, I said: `Guys, if you're next to the basket, let's just shoot the ball,\" Rivers said.\nUP NEXT:\nClippers: visit Bulls on Sunday\nGrizzlies: visit Timberwolves on Saturday",
  "source": "espn_api",
  "crawled_at": 1764992138.464858
}