{
  "game_id": "0021800739",
  "espn_id": "401071411",
  "date": "Jan 27, 2019",
  "matchup": "TOR @ DAL",
  "headline": "Leonard scores 33 as Raptors beat Doncic, Mavericks 123-120",
  "body": "DALLAS --  Even as a 19-year-old rookie, Dallas' Luka Doncic continues to make his case for an NBA All-Star spot.\n\nKawhi Leonard is already one, and came through to spoil Doncic's career-best game Sunday night.\n\nLeonard, voted last week to start the All-Star Game for the third time, scored 33 points to help the Toronto Raptors overcome a triple-double from the Dallas rookie in a 123-120 win over the Mavericks.\n\nDoncic, who will turn 20 on Feb. 28, finished with a career-high 35 points, 12 rebounds and 10 assists to become the first teenager in NBA history with two triple-doubles.\n\nHowever, he and his teammates faltered down the stretch, losing a seven-point, fourth-quarter lead after coming back from 12 down at halftime.\n\n\"For me, what matters is the victory,\" Doncic said. \"(The triple-double) was special for sure, but it would be even more if we got the win.\"\n\nPascal Siakam's three-point play snapped a 108-all tie with 3:56 remaining as the Raptors recovered from a poor third quarter and a 92-85 deficit early in the fourth.\n\nDanny Green's floater in the lane extended Toronto's lead to 116-112 with 1:34 remaining. Harrison Barnes missed two critical free throws for the Mavericks, and Leonard scored on a driving lay-up and then converted a free throw after a turnover by Doncic. The Raptors iced the game at the line.\n\nLeonard credited the team's switch to a zone defense in the fourth quarter to help slow the Mavs down.\n\n\"I think it just helps us communicate more,\" Leonard said. \"We're not too consistent in communicating when we're guarding man to man, but the zone it makes us talk and make us get into positions to be in the help spots.\"\n\nKyle Lowry scored 19 points for Toronto and Siakam had 14.\n\nTrailing 70-58 at the half, Dallas turned the game around by outscoring Toronto 30-15 in the third quarter, one in which the Raptors missed their first 10 shots enroute to making only 4 of 19 field goals. Toronto was also assessed four technical fouls in the quarter -- three for defensive 3-second violations.\n\n\"The third quarter, we got stagnant.\" Leonard said. \"Our defense got stagnant.\"\n\nMAKING HIS CASE\n\nDoncic came in second to LeBron James in the fan voting for All-Star starters in the Western Conference but was not selected as a starter once media and player votes were counted. He once again turned the fourth quarter into a case for his inclusion, scoring 13 points, including a coast-to-coast dunk that gave Dallas a 99-93 lead.\n\nWhen the Raptors pulled to 101-99, Doncic answered with a long 3 to reach 30 points for the sixth time this season. Doncic got his 10th assist to complete the triple-double by feeding DeAndre Jordan for an alley-oop dunk with 3:29 left in the fourth.\n\n\"We couldn't get him out of rhythm because he was low and strong and crossing over,\" Toronto coach Nick Nurse said. \"Then, with a burst he was into the paint. And when we did get enough help there, he'd hang in the air until the last second and throw that incredible two-handed pass out to the right corner. He's something else.\"\n\nWINNING AT THE LINES\n\nThe Raptors made 17 of 34 3s to the Mavericks' 11 for 36. And despite playing on the road, Toronto converted 32 of 38 free throws, while Dallas shot 23 of 34.\n\nEvery Mavericks player who attempted at least one free throw missed one, and even Dirk Nowitzki, a career 88 percent shooter from the stripe, missed 2 of 3.\n\n\"We certainly have guys that are capable of making free throws,\" coach Rick Carlisle said. \"It's a bit of an uncharacteristic thing.\"\n\nTIP-INS\n\nRaptors: Leonard has scored 20 or more points in 22 straight games but has been inactive eight times during his scoring streak.\n\nMavericks: Barnes scored 14 for the Mavericks and Dennis Smith Jr. and Dorian Finney-Smith had 13 each. ... Wesley Matthews became the first undrafted player in NBA history -- and 31st overall -- to make 1,500 3-pointers when he hit his second of the game with 5:36 left in the first quarter. ... Smith received a technical foul in the first quarter when, after scoring a lay-up over a Serge Ibaka, flexed his muscles over the fallen Raptors player.\n\nUP NEXT\n\nRaptors: Host Milwaukee on Thursday night in a matchup of the East's top two teams.\n\nMavericks: At New York on Wednesday night to open a three-game trip.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994263.279445
}