{
  "game_id": "0021800879",
  "espn_id": "401071552",
  "date": "Feb 22, 2019",
  "matchup": "MEM vs. LAC",
  "headline": "Montrezl Harrell scores 30, Clippers beat Grizzlies 112-106",
  "body": "MEMPHIS, Tenn. --  Danilo Gallinari went on a scoring spree midway through the fourth quarter Friday to make sure the Los Angeles Clippers maintained their hold on the last playoff spot in the Western Conference.\n\nGallinari scored 23 points, including 10 straight in the fourth quarter, Montrezl Harrell matched his career high with 30 points, and the Clippers beat the Memphis Grizzlies 112-106.\n\n\"I was just reading the defense, and my team needed me to be aggressive,\" Gallinari said of the scoring outburst. \"I was just trying to control the game as much as possible on the offensive and defensive end.\"\n\nLou Williams was 6 for 15 from the field and finished with 18 points, while Harrell was 11-for-14 shooting. The two reserves have become a dynamic pair for the Clippers running the pick-and-roll. Harrell said the Grizzlies' defense hedged toward Williams, taking his shot away and opening opportunities for Harrell.\n\n\"That's definitely what (the Grizzlies defense) did,\" Harrell said of Memphis concentrating on Williams. \"Every pick-and-roll we were in, whether it was the four or the five, they jumped down and showed as hard as they can. . Now, you've got me rolling down the middle of the floor and low guys trying to roll over and replace and step up for that spot.\"\n\nClippers coach Doc Rivers added: \"(Harrell) and Lou Williams had the pick-and-roll going.\"\n\nThe victory left the Clippers in eighth place in the West, two games up on Sacramento.\n\nMike Conley scored 25 points and Joakim Noah had 22 as the Grizzlies lost their third straight. Avery Bradley scored 17.\n\nMemphis was within 108-104 with less than 20 seconds left when Bradley got a steal. But Noah couldn't handle the pass on the fast break, ending Grizzlies' chances.\n\n\"I think we were able to make shots, but first you have to get stops in order to get the ball to be able to make shots,\" Bradley said of the Grizzlies remaining competitive down the stretch. \"That's what we were able to do.\"\n\nTIP-INS\n\nClippers: The game marked the return of Garrett Temple and JaMychal Green, traded by the Grizzlies at the deadline for Bradley. . Harrell also scored 30 points earlier this season, on Nov. 26 at Houston. ... Los Angeles was 6 of 25 from outside the arc.\n\nGrizzlies: F Chandler Parsons, who hadn't played since the third game of the season, returned to the rotation, playing almost 20 minutes and scoring three points, hitting one of his seven shots. . Noah also had 11 rebounds, recording his third double-double of the season. ... Bradley has scored at least 15 points in three out of four games since joining Memphis.\n\nDIPLOMATIC DOC\n\nRivers was asked before the game about Thursday night's rift between the Houston Rockets and the officials, although the question didn't specify the players or official. Rivers said there are times when a call goes against you and your first impression is someone has it out for you. \"That doesn't mean the official's doing anything wrong,\" he said. Then he added: \"Look at me, defending the officials. I'm so proud of myself right now, I don't know what to do. It's the after-the-All-Star-Break version of me.\"\n\nJAREN JACKSON UPDATE\n\nMemphis coach J.B. Bickerstaff said after the game, that rookie Jaren Jackson Jr., who sat out with right quad soreness, aggravated the injury in practice Thursday. He said the team would be cautious before he returns from the \"deep bruise.\" Jackson missed a Feb. 1 game at Charlotte with the same right quad issue. \"There must have been a moment (Thursday) in practice where he re-aggravated it,\" Bickerstaff said. As for his return, the Memphis coach said Jackson could have played, but the team didn't want to risk further injury. \"At this point for him, it's not something we are willing to risk, so we'll be cautious with him,\" Bickerstaff said.\n\nUP NEXT\n\nClippers: At Denver on Sunday\n\nGrizzlies: At Cleveland on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994909.962733
}