{
  "game_id": "0021500017",
  "espn_id": "400827904",
  "date": "Oct 28, 2015",
  "matchup": "LAL vs. MIN",
  "headline": "Karl-Anthony Towns: 'Sixth man on floor' helped Wolves pull out win",
  "body": "LOS ANGELES -- With heavy hearts and occupied minds, the Minnesota Timberwolves hung on to win one for Flip.\nRicky Rubio had a career-high 28 points and 14 assists and the Timberwolves rallied from a 16-point deficit in the second half to beat the Los Angeles Lakers 112-111 on Wednesday night in their first game since Flip Saunders' death.\nWhen Lou Williams somehow missed a 4-foot runner at the buzzer, Minnesota hugged and celebrated a fortunate break in a cathartic victory. Kevin Martin scored 23 points for the Timberwolves three days after they lost Saunders, the longtime coach and team president who battled Hodgkin's lymphoma.\n\n\"I think we had a little help today,\" Rubio said. \"It's been a tough week. It's hard to explain. Everybody went through a lot of pain. But even though Flip's gone, he will stay with us forever.\"\nSaunders' recent death and a pregame moment of silence put both teams in a somber mood in their season opener. Both wore warm-up shirts honoring the coach. The Timberwolves' shirts bore the slogan \"WE,\" while the Lakers' said \"FLIP.\"\nMinnesota led 111-102 with 2:11 left, but the Lakers finished on a 9-1 run. Williams hit a 3-pointer with 31 seconds left to trim Minnesota's lead to one point. Martin missed a jumper before Williams missed his leaner.\n\"We stayed together as a team, something that we've been doing a lot this week,\" said Karl-Anthony Towns, who had 14 points and 12 rebounds in his NBA debut. \"(We're) working together as a family and doing a great job of keeping his vision alive. We just seemed to have Coach Saunders on our side, especially with Lou Williams shooting a floater for the game. Nine times out of 10, he hits that. But I think we had a sixth man on the floor.\"\nKevin Garnett had four points and seven rebounds to begin his 21st NBA season, becoming just the third player in league history to last that long. Garnett, who was persuaded to return to Minnesota by Saunders last season, left the locker room without speaking to reporters.\nWhile No. 1 draft choice Towns had a solid debut for Minnesota, No. 2 pick D'Angelo Russell had four points and three turnovers in a quieter debut for the Lakers.\nKobe Bryant scored 24 points in the first game of his 20th season with the Lakers, breaking John Stockton's NBA record for the most seasons with one team. Bryant largely appeared to be his usual spry and aggressive self in his first game since January after his third straight season ended early due to injury, but he missed his final eight shots down the stretch as Minnesota rallied.\n\"That timing will come back,\" Bryant said. \"I haven't played in a minute.\"\nWilliams scored 21 points in his first game with Los Angeles. The Lakers returned from the worst season in franchise history with a taste of their potential, but more disappointment when Williams' shot missed.\n\"When I let it go, I thought it was a bucket,\" Williams said. \"It's a routine play for me.\"\nJULIUS REDUX\nJulius Randle returned to the Lakers' lineup with 15 points and 11 rebounds. Last summer's No. 7 pick broke his leg in last year's opener and missed the rest of the season, but has looked strong and sharp all year.\nYOUNG AND OLD\nExtremes of youth and experience met at Staples Center: The top two picks faced off in their regular-season debuts for the first time in the 50-year common draft era, while two players with at least 20 seasons of experience faced each other for the first time in NBA history. Both Garnett and Bryant played alongside their current coaches, Sam Mitchell and Byron Scott.\nTIP-INS\nTimberwolves: Mitchell, who took over in Saunders' absence, coached his first game for Minnesota. \"It's been a tough last couple of days, but the guys, they get a safe haven playing basketball,\" he said. ... NBA Commissioner Adam Silver attended the game and addressed the Timberwolves in their locker room beforehand.\nLakers: Roy Hibbert had 12 points and 10 rebounds in his first appearance with L.A., making all 10 of his free throws. ... Nick Young had 14 points, including a 3-pointer from 41 feet to beat the first-quarter buzzer.\nUP NEXT\nTimberwolves: At Denver on Friday.\nLakers: At Sacramento on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994332.053613
}