{
  "game_id": "0021900518",
  "espn_id": "401161160",
  "date": "Jan 03, 2020",
  "matchup": "MIA @ ORL",
  "headline": "Magic turn back cold-shooting Heat, 105-85",
  "body": "ORLANDO, Fla. --  The Heat went cold in the fourth quarter Friday night, matching the lowest point total for a quarter by an NBA team in more than two years.\n\nTerrence Ross scored 25 points, Nikola Vucevic added 20 points and 11 rebounds and the Orlando Magic held Miami to six points over the final 12 minutes on their way to a 105-85 victory.\n\n\"They shut down the paint, they shut down our layups, shut down a lot of the things we're used to getting and shut down our normal threes,\" Miami coach Eric Spoelstra said. \"There was a possession when they must have run us off five straight 3s on their close-outs and did a tremendous job with making multiple efforts, and we weren't really doing that on the other end. They deserved to get that win.\"\n\nMiami shot 3 for 19 from the field and missed all 10 3-point shots while committing six turnovers in the period.The last team team to score only six points in a quarter was Portland against Toronto in October 2017.\n\nJimmy Butler had 23 points and 10 rebounds for the Heat. Bam Adebayo, with 14 points and 10 rebounds, was the only other Miami player in double figures.\n\nAaron Gordon had 16 points and eight rebounds for the Magic, and Evan Fournier scored 15 points despite spending most of the game in foul trouble.\n\n\"It was the defensive spirit that was really good,\" Fournier said. \"That was the key tonight. Six points in the fourth quarter, that is how we've got to play every night.\"\n\nOne day after holding Toronto to 6-of-42 shooting from 3-point range in a victory at Miami, the Heat shot 7 for 37 from long range and 37.5% overall.\n\nAfter Vucevic and Gordon combined for three 3-pointers in quick succession to give the Magic to a 67-49 lead early in the third quarter, the Heat responded with a 14-3 run.\n\nMeyers Leonard then hit a pair of 3-pointers to cut Orlando's lead to four.\n\nBut Miami wet scoreless for more than 3 1/2 minutes at the outset of the fourth quarter. Another 3-pointer by Gordon and a short jump hook by Vucevic pushed the margin to 18 points with 4:29 left.\n\n\"A lot of teams are going to circle us on their calendar,\" Meyers said, \"but of course Orlando -- this is an in-state rivalry or whatever you want to call it. You have to expect that . . . so it's simply understanding at this point that we definitely have a bit of a target on our back, and we have to raise our level of intensity and understand that every night it's going to be a battle.\"\n\nThe loss, only the second in eight games for the Heat, dropped them to 25-10 on the season.\n\n\"I thought our defense was good, I thought our purpose was good. Obviously that's a good win against a really good team,\" Magic coach Steve Clifford said.\n\nTIP-INS\n\nHeat: F Justise Winslow missed his 14th straight game with a lower back bruise. . . . It was the first of four meetings between the intrastate rivals this season and the 120th regular-season meeting. Miami leads the series 65-55.\n\nMagic: F Jonathan Isaac, generally considered Orlando's best defensive player, is expected to miss two months with a left knee injury. . . G Michael Carter-Williams, who missed a sixth game with a left shoulder injury, is \"quite a ways away\" according to Clifford . . . The Magic came into the game as the lowest-scoring team in the NBA (103.4 ppg) and the fewest turnovers (12.76 per game).\n\nHEAT D WAS HOT THURSDAY NIGHT\n\nThe Heat have given up 100 or more points in 22 of their last 23 games, the glaring exception being Thursday night's 84-76 win over Toronto. \"Right now it's about our disposition,\" Spoelstra said before the game.\n\nUP NEXT\n\nHeat: Host Portland on Sunday night.\n\nMagic: Host Utah on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995518.7181902
}