{
  "game_id": "0021500603",
  "espn_id": "400828490",
  "date": "Jan 16, 2016",
  "matchup": "MIL @ CHA",
  "headline": "Middleton helps Bucks beat Hornets 105-92",
  "body": "CHARLOTTE, N.C. --  Khris Middleton and the Milwaukee Bucks are hoping to build on two consecutive nights of solid play.\n\nMiddleton scored 24 points on 11-of-16 shooting, and the Bucks beat the Charlotte Hornets 105-92 on Saturday.\n\nGreg Monroe had 19 points and 10 rebounds for Milwaukee, and Giannis Antetokounmpo finished with 14 points and 11 boards. Jabari Parker scored 15 points.\n\nOne night earlier, Middleton had 26 points in the Bucks' 108-101 overtime victory over the Hawks.\n\n\"It's a tremendous win,\" Milwaukee interim coach Joe Prunty said. \"It's a tremendous, gutty win by everybody. But it's the NBA. So we're proud of the guys, but we have to do it again.\"\n\nCharlotte was coming off a 109-107 loss at New Orleans on Friday night, and the Bucks used a burst of energy to outscore the Hornets 33-19 in the second quarter. Middleton and Rashad Vaughn each had eight points in the second.\n\nThe Bucks carried the momentum into the third period. Johnny O'Bryant and John Henson each hit two foul shots to make it 84-68 with 1:12 left.\n\nMiddleton is averaging 23 points on 50-percent shooting over the last six games, and the Bucks have won four of those contests.\n\n\"I've been in a rhythm,\" Middleton said. \"Coaches and the guys are letting me play with the ball in my hands more, and allow me to make plays for them. They trust me to try to make the right play for the team.\"\n\nCharlotte has lost nine of 10. Center Al Jefferson has been sidelined by a knee injury, and key reserve Jeremy Lamb missed his second straight game Saturday with a toe injury.\n\n\"To be honest, when we get those guys back, I think there could be some (lineup) decisions to make,\" Hornets coach Steve Clifford said. \"Right now, I don't see anything. You've got to start the game with guys who have a chance at both ends of the floor. I don't know what an option would be.\"\n\nMilwaukee shot 54.2 percent (39 for 72) from the field. The Bucks also had a 46-35 rebounding edge.\n\nJeremy Lin had 15 points for Charlotte, which shot just 38 percent (33 for 87) from the field. Marvin Williams scored 14 points.\n\n\"We've just got to keep plugging away,\" Williams said. \"Everybody's still confident in our abilities and what we can be because we have shown what we can be on both ends on the floor. We can be tough and scrappy on defense and we've got a lot of guys that can score the ball and make plays on offense. We've just gotten away from that the last three or four weeks.\"\n\nTIP-INS\n\nBucks: G Jerryd Bayless played his first game after missing six in a row with a sprained left ankle. He had three points on 1-for-5 shooting and six assists. ... O.J. Mayo (sore left hamstring) did not travel with the team. ... F Damian Inglis was assigned to the NBA Development League's Westchester Knicks. ... The Bucks played the first game in a four-game road trip.\n\nHornets: G Jeremy Lamb missed his second game with a strained right big toe. ... The Hornets had topped the Bucks in eight of their last 10 meetings prior to Saturday.\n\nCONSTANT CONTACT\n\nMilwaukee coach Jason Kidd might not be with his team every day as he recovers from December hip surgery, but that doesn't mean he doesn't communicate with his coaching staff.\n\nAs in, constantly.\n\n\"We talk every day,\" Prunty said. \"I won't necessarily talk to him (during games), specifically, but we're corresponding. We're definitely in touch with one another.\"\n\nUP NEXT\n\nBucks: Visit Miami on Tuesday night.\n\nHornets: Host Utah on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994055.341717
}