{
  "game_id": "0021601038",
  "espn_id": "400900433",
  "date": "Mar 19, 2017",
  "matchup": "DET vs. PHX",
  "headline": "Pistons finish strong, beat short-handed Suns 112-95",
  "body": "AUBURN HILLS, Mich. --  Stan Van Gundy wants his Detroit Pistons to play with energy in the middle of a playoff race.\n\nThe problem is that sometimes urgency leads to frustration -- especially if a game against a weaker opponent becomes more difficult than it should be.\n\n\"You've got to learn to deal with the pressure,\" said Van Gundy, Detroit's coach. \"You can't say there's no pressure, because there is, there's pressure on these games. But if you want to play at a high level in the NBA, you have to play with pressure.\"\n\nThe Pistons finally shook out of their funk late in the third quarter and routed the short-handed Phoenix Suns 112-95 on Sunday. Kentavious Caldwell-Pope scored 23 points for playoff-chasing Detroit.\n\nThe Suns were without several top players, but they still led 65-53 in the third quarter. Detroit (34-36) finished strong in that period and then built a double-digit lead of its own in the fourth.\n\n\"It don't matter who you put out there,\" Caldwell-Pope said. \"It was a game we needed.\"\n\nAndre Drummond had 18 points and 18 rebounds for the Pistons, and Aron Baynes had 13 points and 17 rebounds.\n\nTyler Ulis had 17 points and 11 assists for the Suns.\n\nPhoenix was without guard Devin Booker (right ankle), guard Ronnie Price (left leg), guard Leandro Barbosa (illness) and forward Dragan Bender (right ankle). The Suns (22-48) have also been playing without Eric Bledsoe , Brandon Knight and Tyson Chandler, choosing instead to give young players more time.\n\nDetroit went on a 16-0 run in the first quarter but was only up by one point at the end of the period. The Suns were ahead 49-47 at halftime.\n\nThe Pistons scored the final six points of the third quarter, then began the fourth with five in a row to lead 82-75. A 3-pointer by Reggie Jackson made it 88-77.\n\n\"I think we got a little exhausted during the game but at the same time it's no excuse,\" Ulis said. \"You've got to try and finish out that game no matter what the circumstances are.\"\n\nTIP-INS\n\nSuns: Phoenix signed forward Jarell Eddie to a 10-day contract before the game. He scored 13 points.\n\nPistons: Caldwell-Pope had eight of Detroit's 26 assists. ... Detroit recalled forward Henry Ellenson from the D-League. He did not play.\n\nYOUTH MOVEMENT\n\nOn Wednesday against Sacramento, Phoenix started its youngest lineup in team history, according to information provided by the Suns from the Elias Sports Bureau. That lineup of Booker, Ulis, T.J. Warren, Alex Len and Marquese Chriss averaged 21 years, 258 days.\n\nSunday's starting group was even younger, with Derrick Jones replacing Booker. Jones turned 20 in February, while Booker turned 20 in October.\n\nSuns coach Earl Watson joked before the game that he might need to suit up because so many players would be out.\n\n\"Tyson and I was in the same draft, so it's possible,\" said Watson, who played collegiately at UCLA.\n\nVan Gundy was asked more generally about teams going with younger players down the stretch.\n\n\"I think everybody does what they need to do. I think everybody in this league -- every situation's different and everybody's trying to do what's best for their team and their organization,\" Van Gundy said. \"Especially when you get into these last 20 games, everybody's in a little bit of a different place.\n\n\"There's people playing young guys, there's people who want to lose, there's people who are trying to make the playoffs, there's teams near the top that want to rest guys to be ready for the playoffs. Every night's different.\"\n\nPLAYOFF PICTURE\n\nDetroit pulled even with Miami for the final playoff spot in the Eastern Conference. Milwaukee is a half-game in front of the Heat and the Pistons.\n\nUP NEXT\n\nSuns: Visit the Heat on Tuesday night in the second game of a six-game road trip.\n\nPistons: Visit the Brooklyn Nets on Tuesday night. Detroit's next three games are against last-place teams, but they're all on the road. The Pistons face Chicago and Orlando after taking on Brooklyn.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764996028.53707
}