{
  "game_id": "0022301144",
  "espn_id": "401585772",
  "date": "Apr 09, 2024",
  "matchup": "CHA vs. DAL",
  "headline": "Luka Doncic scores 39 in triple-double as Mavs beat Hornets 130-104, clinch playoff spot",
  "body": "CHARLOTTE, N.C. -- — Luka Doncic had 39 points, 12 rebounds and 10 assists, and the playoff-bound Dallas Mavericks continued their late-season surge, beating the Charlotte Hornets 130-104 on Tuesday night for their 15th win in 17 games.\n\n\r\n              Dallas secured a guaranteed playoff spot among the top six in the Western Conference later Tuesday when Phoenix lost to the visiting Los Angeles Clippers. The Mavs (49-30) are likely to end up as the fifth seed.\n\n\r\n              Doncic, the NBA’s leading scorer, had 21 points and made five 3-pointers in the first quarter as the Mavericks bolted to a 36-14-point lead. He finished 8 of 17 from beyond the arc in his 21st triple-double of the season and 77th of his career, which tied James Harden for eighth all-time. He also set a Mavericks franchise record for points in a season with 2,341, surpassing Mark Aguirre's 2,330 in 1983-84.\n\n\r\n              “It means a lot,” Doncic said. “This is the franchise that drafted me and they gave me the set of the keys. I'm just glad I'm here.”\n\n\r\n              Doncic is averaging a 33.9 points per game.\n\n\r\n              “It's incredible what Luka has done,” Mavericks coach Jason Kidd said. “He's going to rewrite the record books for the Mavericks and also for the NBA. For him to pass Mark is incredible because Mark is a legend for the Mavs. It shows what Luka has done and how much better he has gotten year to year.”\n\n\r\n              Daniel Gafford finished 12 of 12 from the field and scored 26 points, and Kyrie Irving added 18 points, nine assists and eight rebounds for Dallas.\n\n\r\n              Miles Bridges scored 22 points and Brandon Miller 21 for the Hornets, who wrapped up a franchise-long eight-game homestand with a 2-6 record.\n\n\r\n              After Doncic dominated the first quarter, Irving took over in the second, helping Dallas take a 22-point lead at halftime.\n\n\r\n              P.J. Washington, acquired in a midseason trade with the Hornets, struggled in his return to Charlotte, missing all seven shots and making one free throw. \n\n\r\n              Doncic toyed with the Hornets most of the night, creating space to shoot 3s and finding big creases in the defense on drives. His most impressive play wasn't a basket, but rather a one-handed lob to Gafford for an alley-oop.\n\n\r\n              “He comes down and gets whatever he wants on a night-to-night basis,” Gafford said.\n\n\r\n              “He came out and didn't wait, and he was aggressive,\" Kidd said of Doncic. “It looked like Luka was going to have one those 40-point quarters.”\n\n\r\n              Hornets coach Steve Clifford said his team was flat.\n\n\r\n              “Luka was great. He made five 3s in the first quarter, and I think four of them were just isos,” Clifford said. “We’re playing from a hole. To me, we never really, really got going in the game. We made a run at it but we didn’t play with nearly the intensity level that we have been.”\n\n\r\n              Charlotte cut the lead to 11 in the fourth quarter, but Doncic rifled a pass to Gafford for another dunk, igniting a 13-0 run.\n\n\r\n              The win all but assures the Mavericks will avoid the play-in tournament.\n\n\r\n              “We sure need some rest,” Doncic said. “We are playing some of our best basketball of the season on the defensive end as well right now. That is the key for us.”\n\n\r\n              Miller had three 3-pointers for the Hornets, giving him 178 for the season and moving him past Saddiq Bey for the fourth-most 3s by a rookie in NBA history. He trails Keegan Murray (206), Donovan Mitchell (187) and Damian Lillard (185).\n\n\r\n              Clifford before the game with a framed jersey. Clifford is stepping down after the season, his seventh with the Hornets in two separate stints.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Miami on Wednesday night.\n\n\r\n              Hornets: Finish up with three away games, beginning Wednesday night at Atlanta.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995930.3582962
}