{
  "game_id": "401810092",
  "espn_id": "401810092",
  "date": "Nov 16, 2025",
  "matchup": "NO vs GS",
  "headline": "Moses Moody scores 32 as Warriors cruise past Pelicans 124-106",
  "body": "NEW ORLEANS -- — Moses Moody hit a career-high eight 3-pointers and scored a career-high 32 points, and the Golden State Warriors beat New Orleans 124-106 on Sunday night in what was also James Borrego's debut as Pelicans interim coach.\n\n\r\n              Jimmy Butler added 18 points and 10 assists for the Warriors, who led by as many as 25 points in the second half and whose arrival in New Orleans a day earlier coincided with Pelicans' firing of fifth-year coach Willie Green.\n\n\r\n              Brandin Podziemski scored 19 points, Al Horford added 11 points and Draymond Green grabbed 10 rebounds during a performance in which he also had a brief confrontation with a fan along the baseline.\n\n\r\n              Trey Murphy III scored 20 for New Orleans, while Jose Alvarado added 18 points and Jeremiah Fears 17. \n\n\r\n              Golden State shot 42.9% (24 of 56) from 3-point range, while the Pelicans went just 8 of 29 (27.6%) from deep. And the Warriors won comfortable despite Stephen Curry — who'd scored 46 and 49 points in his previous two games — going an uncharacteristic 2-of-11 shooting for nine points.\n\n\r\n              The Warriors opened up a 17-point lead in the first quarter, when Moody hit seven 3s — setting his career high from deep for an entire game.\n\n\r\n              The Pelicans were able to trim their deficit back to single digits in the second quarter, however, pulling to 53-49 on Herb Jones' free throws, capping a 10-0 run that also included Murphy's dunk and two layups by Fears.\n\n\r\n              Moments before Jones' free throws, Green got into a near chest-to-chest verbal exchange with a fan on the baseline near the Golden State goal. Officials pulled Green away without calling a foul, while ushers converged on the fan and spoke to him briefly without ejecting him.\n\n\r\n              Meanwhile, the Warriors closed the half with eight straight points, capped by Butler's steal and breakaway dunk to put the Golden State up 61-49 at halftime.\n\n\r\n              Up next\r\n              Warriors: Visit the Orlando Magic on Tuesday night.\n\n\r\n              Pelicans: Host the Oklahoma City Thunder on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042637.0948591
}