{
  "game_id": "0022101110",
  "espn_id": "401360929",
  "date": "Mar 26, 2022",
  "matchup": "CHI @ CLE",
  "headline": "LaVine's 25 lead Bulls to 98-94 win over young Cavaliers",
  "body": "CLEVELAND -- — When things got tight down the stretch, the Bulls' experience — and their All-Star power — showed up.\n\n\r\n              The Cavaliers caved.\n\n\r\n              Zach LaVine scored 26 points, DeMar DeRozan added 20 and Chicago stayed alone in the No. 5 spot in the Eastern Conference with a 98-94 win Saturday night over Cleveland, which didn't wake up until the second half.\n\n\r\n              The Bulls held the Cavs to just 35 points in the first half, then held off Cleveland's comeback in the fourth quarter to win on the road for the first time since March 9.\n\n\r\n              Chicago came in holding a one-game lead over Cleveland for the fifth playoff spot. The Bulls were determined not to give it up.\n\n\r\n              “We played desperate tonight and it showed,” said center Nikola Vucevic, who had 16 points and nine rebounds. \"We needed to. It goes to our approach, knowing how important these games are.”\n\n\r\n              With the loss and Toronto's win, the Cavs fell into seventh place — one of the play-in positions — and are one game behind the Raptors, who beat Indiana 131-91.\n\n\r\n              “Reality is what reality is. We've got young guys who are trying to figure it out and you never figure it out until you’re in those positions,” said Cavs coach J.B. Bickerstaff. “I’m proud of our guys because it didn’t take them the whole game to figure it out.”\n\n\r\n              Darius Garland scored 28 points and Caris LeVert had 17 in his second start for Cleveland since coming over in a February trade.\n\n\r\n              Down by 18 at halftime, the Cavs woke up and kept chipping away. They got within 10 several times before finally making a run and closing to 83-80 on LeVert's dunk — off a nice dish from Garland — with 5:35 left.\n\n\r\n              The Cavs were still within four when the Bulls reeled off eight straight points on buckets by LaVine, DeRozan and two by rookie Ayo Dosunmu to open a 95-83 lead, sending many in the sellout crowd at Rocket Mortgage FieldHouse toward the exits.\n\n\r\n              DeRozan missed the Bulls' previous game with a groin strain, and spent a good chunk of the first half on the bench in foul trouble. But when Chicago needed a bucket, the All-Star forward came through with a mid-range jumper or drive.\n\n\r\n              “DeMar DeRozan is one of the best small possession offensive players we have in this league,” Bickerstaff said. \"His efficiency, his ability to get a two-point make is top tier. You put yourself in that position and you put the ball in his hands, he’s a guy who can close on you and we saw that tonight.”\n\n\r\n              The Cavs came out flat, sloppy and disconnected defensively in their biggest game so far in this turnaround season.\n\n\r\n              They weren't much better on the offensive end, committing eight turnovers and going 1 of 18 on 3-pointers in scoring 35 points — matching a season low — in the first half.\n\n\r\n              “We allowed them to keep pushing, pushing, pushing and at no point in the first half did we say, ‘Enough is enough’ and push back,” Bickerstaff said.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: G Alex Caruso added 10 points, eight rebounds and seven assists. ... F Tristan Thompson was fined $20,000 by the NBA for directing profane language at a game official Thursday in New Orleans. ... Chicago plays five of its final eight games at home and owns the season-ending tiebreaker over Toronto.\n\n\r\n              Cavaliers: Rookie F Evan Mobley had 11 rebounds. ... Kevin Love made his 1,000th 3-pointer with Cleveland, joining LeBron James (1,251) as the only players in team history to reach the plateau. ... Love didn't play in the fourth quarter. ... Dropped to 6-1 in home games against Central Division opponents. ... All-Star C Jarrett Allen missed his 10th straight game with a broken finger. Bickerstaff said Allen's pain has decreased, which has allowed him to do more on-court activity without risking further injury.\n\n\r\n              CELEBRATING THE CAVS\n\n\r\n              World B. Free, a flashy scoring guard who kept the Cavs relevant in the 1980s, was honored with a spot on the team’s Wall of Honor along with former owner Gordon Gund, Hall of Famer Lenny Wilkens and forward Campy Russell.\n\n\r\n              Free only played four seasons in Cleveland, and was the only good thing for a franchise during some lean years and one that nearly moved.\n\n\r\n              Gund stopped that, buying the Cavs from Ted Stepien. He was the team’s principal owner from 1983-2005.\n\n\r\n              Wilkens has the most coaching wins (316) in team history. Russell was a member of Cleveland’s “Miracle of Richfield” team in the 1970s.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit New York on Monday night.\n\n\r\n              Cavaliers: Host Orlando on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993170.119989
}