{
  "game_id": "0021601206",
  "espn_id": "400900584",
  "date": "Apr 10, 2017",
  "matchup": "CHI vs. ORL",
  "headline": "Bulls embarrass Magic 122-75, near playoff berth",
  "body": "CHICAGO -- The on-again, off-again Chicago Bulls are on again. Whether that's enough for a postseason berth won't be known until the final day of the regular season.\nEmergency starter Jerian Grant had 17 points and a career-high 11 assists on Monday night, and the Bulls routed the Orlando Magic 122-75 in their largest margin of victory this season.\nThe Bulls will be guaranteed a playoff spot if they beat the Brooklyn Nets in their finale.\n\"I just want everyone to lock in and realize how important this game is,\" All-Star Jimmy Butler said. \"We're not counting on anyone else. We control our own destiny.\"\nChicago remained No. 8 in the Eastern Conference, one game behind Indiana after the Pacers beat the 76ers in Philadelphia. They own the tiebreaker against the Pacers as a result of a better division record.\nThe Bulls (40-41) also would advance in the event of a tie with the Pacers (41-40) and Heat (40-41), which outlasted the Cleveland Cavaliers in overtime in Miami.\n\"If we don't win on Wednesday, we don't deserve to be in,\" Dwyane Wade said. \"It is as simple as that.\"\nThe victory was the sixth for Chicago in its last eight games. Fifth-place Orlando lost for the seventh time in its last eight.\nChicago scored 14 of the first 16 points en route to a 34-13 lead at the end of one quarter. Grant led the way with seven points, four assists and one steal.\n\"Just making sure guys were involved, getting guys good looks,\" said Grant, who replaced the injured Rajon Rondo in the lineup. \"Pretty much it's win or go home.\"\nRobin Lopez scored 18 points for the Bulls and Butler added 17.\nEvan Fournier and Nikola Vucevic each scored 14 points for the listless Magic, who shot 36 from the field in the first half and 34.5 overall.\n\"We just had no effort on the defensive end,\" coach Frank Vogel said. \"Offensively, we were terrible.\"\nTIP-INS\nMagic: Vucevic grabbed 10 rebounds to move ahead of Shaquille O'Neal into second place in franchise history. Only Dwight Howard has more. ... The team had its streak of 100-or-more points snapped at 11 consecutive games, its longest since the 1994-95 season. ... F Jeff Green (sore lower back) sat out an eighth straight game.\nBulls: F Nikola Mirotic entered the contest with an average of 15.6 points per game in March and April compared to 9.3 before then. ... The team hopes to avoid consecutive years out of the playoffs for the first time since the 1998-99 to 2003-04 seasons.\nRONDO IN LIMBO\nRondo (sprained right wrist) sat out a third consecutive game but reported some improvement after a pregame workout.\n\"It's better,\" reported Rondo, who met with a hand specialist earlier in the day.\nCoach Fred Hoiberg called the injury \"significant\" with a \"a lot of swelling.\"\n\"He'll be able to increase activity to the point that he tolerates the pain,\" Hoiberg said. \"He's not ready yet.\"\nWAIT `TIL NEXT YEAR\nVogel said it was a bit strange to be out of the playoffs for the second time in his seven seasons as a head coach.\n\"What do you say about it?\" Vogel said. \"It's not a place that I want to be in ever again.\"\nUP NEXT\nMagic: Host the Detroit Pistons in their season finale on Wednesday.\nBulls: Close their regular season versus the Nets at home on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995001.454371
}