{
  "game_id": "0022400620",
  "espn_id": "401705186",
  "date": "Jan 22, 2025",
  "matchup": "LAC vs. BOS",
  "headline": "Brown and Tatum lead Celtics past Clippers 117-113 in overtime with both teams missing starters",
  "body": "INGLEWOOD, Calif. -- — Jaylen Brown scored 25 points, Jayson Tatum added 24 and the Boston Celtics rallied past the Los Angeles Clippers 117-113 in overtime on Wednesday night when both teams were missing key players.\n\n\r\n              Derrick White added 20 points and Sam Hauser had 15, tying his season high with five 3-pointers. The defending NBA champions played without Jrue Holiday and Kristaps Porzingis. \n\n\r\n              Derrick Jones Jr. scored a career-high 29 points, 17 in the first quarter, to lead the Clippers. Kevin Porter Jr. added a season-high 26 and Amir Coffey had 24. LA's Kawhi Leonard, James Harden, Norman Powell and Ivica Zubac were all sidelined.\n\n\r\n              The Clippers trailed by seven in the fourth, but Coffey dunked and then Jones stole the ball from Brown and scored with 4.2 seconds remaining to tie the game at 103-103 and force overtime.\n\n\r\n              The Celtics opened the five-minute extra session with 3-pointers by White, Tatum and Brown that stretched the lead to 112-105. The Clippers twice cut the deficit to two points, the last time on Coffey's three-point play with 30 seconds to go.\n\n\r\n              After the Celtics worked the ball downcourt, Neemias Queta scored underneath and time expired.\n\n\r\n              Takeaways\r\n              Celtics: They trailed for much of the third quarter before hitting four 3-pointers in the fourth, when Tatum had just five points.\n\n\r\n              Clippers: They got to see some of their younger players step up against the Celtics, who are second in the East. \n\n\r\n              Key moment\r\n              The Celtics turned it around in the fourth after trailing by six early. They ran off 13 straight points, including three consecutive 3-pointers, two by White and one from Tatum, to pull ahead by seven.\n\n\r\n              Key stat\r\n              The game featured 16 ties and 25 lead changes. \n\n\r\n              Up next\r\n              The Celtics visit the Los Angeles Lakers on Thursday night. The Clippers host NBA-worst Washington on Thursday night to finish their second back-to-back this week.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997884.862259
}