{
  "game_id": "0021801146",
  "espn_id": "401071819",
  "date": "Mar 31, 2019",
  "matchup": "OKC vs. DAL",
  "headline": "Without Doncic, Mavericks stun Thunder 106-103",
  "body": "OKLAHOMA CITY --  Without their best player and supposedly playing out the string of a disappointing season, the Dallas Mavericks figured to be one of the less-difficult opponents as playoff-bound Oklahoma City looked to improve its postseason seed.\n\nThe Mavericks were having none of that.\n\nTrey Burke had 25 points and eight assists, Dwight Powell scored the winning basket on a dunk with 21 seconds left and Dallas stunned the Thunder 106-103 on Sunday despite the absence of star rookie Luka Doncic, who missed the game with a right thigh contusion.\n\nJalen Brunson had 18 points, Devin Harris added 15 and Dirk Nowitzki -- playing perhaps his final game in Oklahoma City -- grabbed a season-high 13 rebounds to go with seven points for the Mavericks, who were 3-17 over their previous 20 games.\n\nThe result \"says that we're growing,\" Burke said. \"We've been in a lot of close games, at least since I've been here. A lot of them we couldn't pull out but (today) we found a way. ... With Luka not playing tonight and them having their full team, we definitely were counted out, but we didn't let that get between our ears. We came out with a chip on our shoulder and got the win.\"\n\nRussell Westbrook had 25 points, 11 rebounds and 11 assists for his 30th triple-double of the season and Paul George had 27 points and 11 rebounds for the Thunder, who had sealed a Western Conference playoff spot Saturday when the Sacramento Kings lost. But Oklahoma City has struggled since the All-Star break, going 7-13.\n\nAsked what the mood of the Thunder is, George said, \"That's among this locker room.\"\n\nOne explanation for the Thunder's woes is their shooting struggles. They hit 38.8 percent from the field and 25.6 percent (11 of 43) from 3-point range against Dallas, which hit 16 of 44 3-point attempts (36.4 percent)\n\n\"We're not shooting as well,\" George said. \"The ball is not going in at the high clip that we've been shooting it. ... The fact of the matter is, we're still playing past April 10. These games (are) just to fine-tune. We're not even looking toward matchups. It's going to be a battle regardless of who we play. We just want to play the right way going down the stretch.\"\n\nDallas led 93-84 after Burke made one of two free throws with 6:50 left, but Oklahoma City used a 14-4 run and went ahead 98-97 with 1:59 left on two free throws by George, the first of six lead changes in the final two minutes.\n\nBurke scored on a tough, driving basket with 1:15 left to put Dallas back up 100-98, but George answered with a 3-pointer with 1:09 left. Brunson hit a 17-foot jumper with 49.1 seconds and the Mavericks went ahead 102-101 before Jerami Grant's layup -- off an inbounds pass from Westbrook -- put Oklahoma City up 103-102 with 32.8 seconds left.\n\nBrunson passed to Powell for the dunk with 21 seconds left and Dallas again took the lead. Dennis Schroder and George each missed a 3-point attempt for the Thunder before Dallas' Ryan Broekhoff made two free throws with 4.2 seconds left to make it 106-103. Westbrook missed a 38-foot shot just before the buzzer.\n\n\"We were just grinding away, obviously,\" Nowitzki said. \"They didn't have a great shooting night. But we kept grinding. We wanted to slow the game down and not make tons of mistakes -- at the offensive end, keep moving the ball and looking for the open guy, and defensively, just compete.\n\n\"They've got a lot of great players. All you can do is try to make it hard on them and keep people in front of them and rebound with them.\n\n\"Down the stretch, you need to be a little lucky. We dodged a few bullets there. They had some good looks. Sometimes to win a big game on the road, you have to be a little lucky.\"\n\nSteven Adams added 20 points and 15 rebounds and Grant had 14 points for Oklahoma City, while Powell had 11 points and nine rebounds for the Mavericks.\n\nDoncic missed the game with a right thigh contusion.\n\nAn 11-0 spurt over 91 seconds of the second quarter -- which included two 3-pointers from Harris -- gave the Mavericks a 51-37 lead with 5:05 left in the half, but Oklahoma City closed the half on a 19-7 run to pull within 58-56.\n\nTIP-INS:\n\nMavericks: Coach Rick Carlisle, who played on Virginia's Final Four team in 1984, began his pregame news conference wanting to discuss his alma mater's win over Purdue on Saturday that sent the Cavaliers to the national semifinals for the first time since 1984. ... Nowitzki received a loud ovation when he was introduced as part of the starting lineup. ... Courtney Lee started in place of Doncic. ... Harris received a technical foul with 11:48 left for arguing an out of bounds call.\n\nThunder: Westbrook, who already has served a one-game suspension for accumulating too many technical fouls, picked up another one in the third quarter, his 17th of the season. Another technical would result in a second one-game suspension. ... Westbrook's triple-double was the 134th of his career. He's four behind Magic Johnson (138) for second place in NBA history in that category.\n\nUP NEXT:\n\nMavericks: Host Philadelphia on Monday to begin a three-game homestand.\n\nThunder: Host the Los Angeles Lakers (without LeBron James) on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994546.018555
}