{
  "game_id": "0022400316",
  "espn_id": "401704882",
  "date": "Dec 02, 2024",
  "matchup": "MIA @ BOS",
  "headline": "Brown scores 29, Pritchard adds 25 bench points to lead Celtics past Heat 108-89",
  "body": "BOSTON -- — Jaylen Brown scored 29 points, Jayson Tatum had 18 points and 11 rebounds and Payton Pritchard scored 25 off the bench on Monday night as the Boston Celtics beat the Miami Heat 108-89.\n\n\r\n              Derrick White added 19 points as the defending NBA champions won for the eighth time in nine games. \n\n\r\n              Jaime Jaquez Jr. had 19 points and 10 rebounds and Tyler Herro scored 19 for Miami. Herro was 2 for 10 from 3-point range, and the Heat shot 23% from beyond the arc and 36% from the field. \n\n\r\n              Both teams were without key players for the second night of a back-to-back after losing on Sunday.\n\n\r\n              Miami played without Jimmy Butler, who has missed five of the first 19 games with a knee injury. The Celtics were without Jrue Holiday, Al Horford and Kristaps Porzingis. \n\n\r\n              Miami scored the first seven points and then went cold while the Celtics ran off 17 of the next 19 points to take the lead. Boston made it a double-digit lead early in the second quarter and went up by 20 in the third.\n\n\r\n              Takeaways\r\n              Heat: Keshad Johnson made his NBA debut and scored two points in seven minutes. \n\n\r\n              Celtics: Have not lost back-to-back games all season. \n\n\r\n              Key moment \r\n              Pritchard, who hit two half-court buzzer-beaters in the NBA Finals, beat the third-quarter buzzer on Monday night when he dribbled through the lane and sidestepped defender Pelle Larsson and laid in a left-hander off the backboard to give Boston a 22-point lead — their biggest in the game to that point.\n\n\r\n              Key stat \r\n              Pritchard became the first NBA player this season to score 20 or more bench points in four straight games. He's the first Celtic to do it since Isaiah Thomas in 2015.\n\n\r\n              Up next \r\n              Both teams are home on Wednesday night, with the Celtics hosting Detroit and the Heat hosting the Lakers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998154.783086
}