{
  "game_id": "0021600486",
  "espn_id": "400899928",
  "date": "Dec 29, 2016",
  "matchup": "CHA vs. MIA",
  "headline": "Third-quarter dominance leads Hornets past Heat, 91-82",
  "body": "CHARLOTTE, N.C. -- Nicolas Batum isn't sure what has been happening in third quarters lately for his Charlotte Hornets, though he'd like to bottle it up for whenever it's needed.\n\"We're just really good,\" Batum said. \"If we could start the game the same way we start the third quarter, we'd be a really, really good team.\"\nThanks to another dominating third quarter Thursday night, Charlotte beat the Miami Heat 91-82.\nBatum had 16 points, 13 rebounds and eight assists, and sparked the Hornets with nine points, five rebounds and four assists in the third period, when they outscored Miami 31-17.\nKemba Walker led Charlotte with 22 points on 8-for-20 shooting. The Hornets improved to 19-14, and have won five of their last six games.\nJosh Richardson led Miami with 20 points on 8-for-14 shooting. The Heat fell to 10-23.\nThe Hornets' third-quarter dominance has become habit. One night earlier, they outscored the Orlando Magic 35-13 in the period to grab a lead they held onto until the end.\nCharlotte began the third with an 8-0 run and never relented. Though they shot 38.7 percent overall, the Hornets connected on 13-of-23 attempts (56.5 percent) in the third.\n\"I have no idea (why),\" Hornets coach Steve Clifford said of his team's third-quarter performances.\nClifford is more concerned with Charlotte's fourth-quarter defense. Limiting the Heat to 16 fourth-quarter points was a major victory in Clifford's eyes.\n\"It's been a problem, and tonight it was much better,\" he said.\nMiami, meanwhile, is struggling to find its footing overall and used its 12th different starting lineup of the season. The Heat had 17 turnovers, which led to 21 points for the Hornets.\n\"We just weren't coherent, didn't get organized and made some sloppy turnovers and we paid the price for it,\" Miami coach Erik Spoelstra said.\nRichardson seemed to have a breakthrough when he had 13 points in the second quarter on 5-for-7 shooting to lead the Heat to a 49-42 halftime edge. Miami outscored Charlotte 13-6 in the final 4:15 of the quarter, a span that included eight points, including two 3-pointers, from Richardson.\nRichardson was just two points shy of his career high of 22 points set earlier this season.\nHassan Whiteside, from nearby Gastonia, North Carolina, had eight points and 10 rebounds for Miami. Justise Winslow had one point and did not sink any of his nine field goal attempts.\n\"The ball wasn't going for me but I tried to defend, rebound and make plays for other guys,\" Winslow said. \"When your shot's not falling, you try to still make an impact on the game. It was just one of those nights.\"\nTIP-INS:\nHeat: Goran Dragic started, although he had been questionable with lower back spasms. He missed Tuesday's game against Oklahoma City. \"Goran probably shouldn't have been out there,\" Spoelstra said. \"But he wanted to be out there for his team. He was probably about 50-60 percent.\" ... Miami's 10-22 record after 32 games is the worst for the franchise since the Heat began 2007-08 with 24 losses in that same span. The Heat lost 67 games that season.\nHornets: Walker recorded his 7,000th point with the Charlotte franchise when he hit a 3-pointer with 4:16 left in the first quarter. Walker is the fourth player in franchise history to reach that mark, and became the second-quickest by doing so in his 396th game. Larry Johnson passed the mark in his 355th career game with the Hornets. ... Marco Belinelli missed his third straight game with a sprained left ankle.\nTRIPLE THREAT\nOnly Anthony Mason (seven) and Larry Johnson (five) have logged more career triple-doubles with the Hornets than Batum, who has three with Charlotte and seven in his career.\nUP NEXT:\nHeat: Travel to Boston on Friday.\nHornets: Host the Cleveland Cavaliers for a New Year's Eve tipoff Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995514.891086
}