{
  "game_id": "0021900167",
  "espn_id": "401160809",
  "date": "Nov 15, 2019",
  "matchup": "CHA vs. DET",
  "headline": "Monk hits 3-pointer at buzzer, Hornets beat Pistons 109-106",
  "body": "CHARLOTTE, N.C. --  Things haven’t always gone the way Malik Monk hoped during his first two seasons with the Charlotte Hornets.\n\nBut coach James Borrego said the third-year shooting guard never stopped working -- and now he’s starting to see some big results.\n\nMonk knocked down a 3-pointer at the buzzer to give the Charlotte Hornets a 109-106 victory over the Detroit Pistons on Friday night, helping snap a four-game losing streak.\n\n“Every game is getting better and better, so hopefully I just keep going up,” said Monk, who finished with 19 points on 8-of-12 shooting. “I’ve been working hard for these two or three years and I’ve been waiting for my moment.”\n\nIt came after Pistons point guard Derrick Rose drove the lane and threw the ball away with a second left. Monk, who was the third option on the inbounds play from midcourt, came flying around a screen, caught the pass from Cody Martin and buried the jumper with a smooth stroke.\n\nDevonte Graham, who had 18 points and 10 assists in his second start, said Monk asked coach James Borrego in the huddle to run a play for him.\n\nThat didn’t surprise Borrego, who has seen Monk’s confidence grow as the season has progressed. He’s gone from a player who didn’t see any action at all in some games last season to one that is starting to be ultra-aggressive, as evidenced by three coast-to-coast layups in traffic.\n\n“He’s starting to shine more and more, and that comes with confidence and maturity,” Borrego said. “You’re starting to see signs of why we drafted him. Give him a lot credit because he’s stuck with it and is getting better. Things haven’t worked in his favor the last couple of years, but he’s owned that and he’s improved.”\n\nLangston Galloway had a career-high 32 points on seven 3-pointers for Detroit, and Andre Drummond added 16 points and 20 rebounds.\n\nThe Pistons have lost four straight.\n\n“This is the second time this team got us at the buzzer here, so it’s tough,” Galloway said. “It’s a tough one to swallow.”\n\nTIP INS\n\nPistons: Bruce Brown and Cody Zeller had to be separated after getting tied up underneath the basket midway through the fourth quarter. They were called for double fouls.\n\nHornets: Graham got his second straight start with Dwayne Bacon (sore right knee) still out. ... Coach James Borrego got a technical when he argued an offensive foul against Miles Bridges when he accidentally elbowed Griffin in the head.\n\nGRIFFIN’S RETURN\n\nBlake Griffin had 19 points on 6-of-19 shooting after missing the last three games with left hamstring and posterior knee soreness.\n\nROSE’S TURNOVER\n\nPistons coach Dwane Casey said the team’s final play was designed to have Rose kick the ball out to the corner, but instead the veteran point guard dished to the wing. However, nobody was there and the ball sailed out of bounds.\n\nIt hurt a lot, but I’ll take the blame for tonight,” Rose said. “Late turnovers and I’ll figure it out.”\n\nCasey said he doesn’t fault Rose.\n\n“He got in the paint and got where he wanted to go,” Casey said. “He just didn’t make the right decision on his kickout.”\n\nANOTHER SLOW START\n\nIn what has become a disturbing trend for the Hornets, they started slow and dug themselves an 11-2 hole after missing six of their first seven shots. Charlotte (5-7) has trailed by double digits in all 12 games this season.\n\n“I don’t know why we keep coming out so flat -- 9-0 starts and getting down 10, 12, 15 and then start to ramp it up,” Graham said. “We need to be able to come out with that same energy that we play with when we’re down 15.”\n\nUP NEXT\n\nPistons: At Chicago on Wednesday night.\n\nHornets: At New York on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996104.6394272
}