{
  "game_id": "0022200417",
  "espn_id": "401468572",
  "date": "Dec 14, 2022",
  "matchup": "TOR vs. SAC",
  "headline": "Fox has 27 points and 10 assists, Kings beat Raptors 124-123",
  "body": "TORONTO -- — De’Aaron Fox had 27 points and 10 assists, Domantas Sabonis added 21 points and 20 rebounds and the Sacramento Kings held on to beat the Toronto Raptors 124-123 on Wednesday night.\n\n\r\n              Malik Monk scored 24 points and Terence Davis had 19 against his former team as the Kings overcame a 16-point second-quarter deficit to beat the struggling Raptors.\n\n\r\n              Kings coach Mike Brown was ejected after picking up two technicals with 9:09 left in the third quarter. Brown left the bench and ran onto the court to argue with the officials after guard Fox was called for a technical foul.\n\n\r\n              “He has our back,” Sabonis said about Brown. “That was big time. I feel like that kind of changed the whole mood.”\n\n\r\n              Harrison Barnes scored 12 points and Keegan Murray had 10 as all five Sacramento starters reached double figures.\n\n\r\n              Sacramento came in having lost three of four on its current Eastern Conference road trip but recovered from loss Tuesday night at Philadelphia, a game that saw the Kings surrender 80 points in the first half.\n\n\r\n              “I’m just proud of everyone,” Barnes said. “Coming off a back-to-back and being able to get this win, I think that’s huge for us.”\n\n\r\n              Fred VanVleet scored a season-high 39 points for Toronto, but missed a 3-pointer that would have tied it with four seconds to go.\n\n\r\n              Scottie Barnes had 27 points and 10 assists and Pascal Siakam scored 19 points for the Raptors. They dropped to 10-4 at home and have lost three straight for the first time this season. The Raptors were swept at Orlando over the weekend.\n\n\r\n              “This was a very winnable game,” Toronto’s Barnes said. “I feel like we should have won this one.”\n\n\r\n              Sacramento attempted a season-high 46 3-pointers and made 17, with Davis and Monk each hitting five.\n\n\r\n              “We got the right spots, we let it fly and we saw it go in,” said Kings associate head coach Jordi Fernandez, who took over for Brown.\n\n\r\n              Toronto shot 6 for 21 from 3-point range, matching its fewest made 3-pointers of the season.\n\n\r\n              Raptors forward O.G. Anunoby missed his second straight game because of a sore left hip.\n\n\r\n              Fox split a pair of free throws with six seconds left in the fourth, putting Sacramento up 124-121.\n\n\r\n              After a timeout, VanVleet got open but missed a 3-pointer, leading to a layup for Siakam.\n\n\r\n              VanVleet scored 13 points in the first and the Raptors led 31-23 after one. Toronto scored the first eight points of the second to lead 39-23, but the Kings cut it to 62-59 by halftime.\n\n\r\n              VanVleet scored nine of his 16 third-quarter points at the free throw line, including five straight when Brown was ejected. Toronto took a 94-88 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Kings: G-F Kevin Huerter (left ankle) was not available. Huerter had started all 26 games for Sacramento prior to Wednesday. … Sabonis finished with seven assists.\n\n\r\n              Raptors: Barnes had seven rebounds. … F Juancho Hernangomez returned after missing the past four games because of a sprained right ankle. … Toronto used its 15th different starting lineup in its 28th game of the season.\n\n\r\n              TAKE CARE\n\n\r\n              The Raptors didn’t turn the ball over in the first half, just the second time in franchise history they’ve done that. It also happened April 13, 2016 at Brooklyn. Toronto finished with seven turnovers.\n\n\r\n              ATLANTIC AND PACIFIC\n\n\r\n              Sacramento became the first non-Atlantic Division opponent to win in Toronto this season. Brooklyn, Boston and Philadelphia have all won north of the border.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Detroit on Friday night.\n\n\r\n              Raptors: Host Brooklyn on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994078.8654022
}