{
  "game_id": "0022301002",
  "espn_id": "401585630",
  "date": "Mar 20, 2024",
  "matchup": "PHI @ PHX",
  "headline": "Grayson Allen scores 32, ties career high with 9 3-pointers, Suns beat sliding Sixers 115-102",
  "body": "PHOENIX -- — Grayson Allen scored 32 points and tied a career high with nine 3-pointers, leading the Phoenix Suns past the Philadelphia 76ers 115-102 on Wednesday night.\n\n\r\n              Allen made 10 of 17 shots from the field, including 9 of 15 from long range. He's made at least eight 3-pointers in seven games this season, which is second in the NBA behind Golden State’s Stephen Curry.\n\n\r\n              “A lot of them were passes from (Devin) Booker and his pick and rolls tonight, early kick aheads, head up in transition,\" Allen said. \"I told him thank you when we were sitting on the bench after the game. I got a lot of good looks.\n\n\r\n              “Missed a few early, but the ball kept finding me and I just continued to let it fly.”\n\n\r\n              Kevin Durant added 22 points for the Suns while Booker had 18 points, nine rebounds and 11 assists, falling just shy of his first regular-season triple double.\n\n\r\n              It wasn't always a pretty game for the Suns — they had 23 turnovers — but Durant wasn't complaining.\n\n\r\n              “It's about getting wins, man. We just want to win games,” Durant said. “I know it's about how you win sometimes, but at this point of the season, we just need to add wins.”\n\n\r\n              The Sixers trailed by 26 points early in the fourth but cut the Suns' lead to 102-91 with 5:15 left. Durant and Allen hit 3s on back-to-back possessions to turn back the rally.\n\n\r\n              Allen hit back-to-back 3s, sandwiched around a Durant bucket, to give the Suns an 81-64 lead with 4:32 left in the third. Phoenix finished the quarter on a 17-2 run for a 90-66 advantage heading into the fourth.\n\n\r\n              Philadelphia was led by Kelly Oubre Jr. with 18 points while Cameron Payne and Jeff Dowtin Jr. scored 12 each off the bench. The Sixers made just 7 of 18 (38%) free throws.\n\n\r\n              The Sixers continued their extended slide — they have a 9-18 record since Jan. 25. It's a stretch that roughly mirrors the time seven-time All-Star center Joel Embiid has missed since surgery on his left knee.\n\n\r\n              “We just didn't seem to be moving with the energy we needed to be,\" Sixers coach Nick Nurse said. “We know they can devastate you from 3, and we talked about trying to limit their attempts tonight, and we just couldn't get it done.”\n\n\r\n              Durant, a 14-time All-Star, passed Shaquille O'Neal for eighth place on the NBA's career scoring list. The 35-year-old has 28,610 points. Next up on the list is Wilt Chamberlain, who has 31,419.\n\n\r\n              The Suns had a rough start, missing their first eight shots while turning the ball over four times. They recovered in a hurry, using a 23-6 run in the second quarter to push to a 60-47 halftime advantage despite 13 turnovers.\n\n\r\n              The Suns shot 10 of 20 (50%) from 3-point range and had a 34-18 rebounding advantage before the break. Allen led the way with 13 points, making 4 of 7 3-pointers.\n\n\r\n              “He's always a threat to do what he did tonight,” Suns coach Frank Vogel said. \n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Atlanta on Thursday night.\n\n\r\n              Suns: At Lakers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996411.815819
}