{
  "game_id": "0022000035",
  "espn_id": "401267195",
  "date": "Dec 27, 2020",
  "matchup": "PHI @ CLE",
  "headline": "Cavs win 3rd straight to open season, rout 76ers 118-94",
  "body": "CLEVELAND -- — Andre Drummond scored 24 points, grabbed 14 rebounds and made three steals as the Cleveland Cavaliers won their third straight game to start the season, 118-94 over the Philadelphia 76ers on Sunday night.\n\n\r\n                    Collin Sexton added 22 points and Darius Garland had 14 points and seven assists for Cleveland, which finished with the second-worst record in the NBA last season at 19-46. The Cavaliers are 3-0 for the first time since winning six in a row to begin 2016-2017.\n\n\r\n                    “We want it. We want it bad,” said Drummond, who is averaging 20.3 points and 14.7 rebounds per game. “We play hard each and every time, and guys are ready when their number is called. We have a long season ahead of us and we’ll celebrate tonight, but we’ll be ready for our next game.”\n\n\r\n                    Tobias Harris had 16 points, nine rebounds and five assists for Philadelphia, which fell to 2-1 and played without center Joel Embiid (back tightness). Ben Simmons scored 15 points and Dwight Howard had nine points and four fouls filling in for Embiid.\n\n\r\n                    “Joel was planning on going, but when he went out on the floor, he had some stiffness,” 76ers coach Doc Rivers said. “He was such a late scratch, we couldn’t even add another big man to the active list.”\n\n\r\n                    Cavaliers power forward Kevin Love (right calf strain) left in the second quarter and did not return. Love missed the season opener with the same injury and will undergo an MRI on Monday.\n\n\r\n                    Cleveland, which shot 52.7% from the field, took its largest lead at 108-76 on Cedi Osman's driving layup with 8:30 left. Osman scored 14 points off the bench and Larry Nance Jr. had 13 points and five assists.\n\n\r\n                    “I still don’t think we’ve put our best four quarters together yet, but that’s our goal,” Cavaliers coach J.B. Bickerstaff said. “Playing agenda-less basketball, that’s what the guys have bought into.”\n\n\r\n                    Drummond, who has three double-doubles, netted 15 points and 10 rebounds in the first half as Cleveland carried a 64-50 advantage into the break.\n\n\r\n                    The Cavaliers forced 22 turnovers, six by Simmons, and turned them into 35 points.\n\n\r\n                    “I thought our spacing was bad,” Rivers said. “I want Ben to attack the basket, but I also want him to make plays and have a good balance. We won two games, but we just didn’t play well tonight.”\n\n\r\n                    Both teams completed their first back-to-back set of the season. Cleveland beat Detroit 128-119 in double overtime Saturday, while Philadelphia won 109-89 in New York.\n\n\r\n                    “It was a good back-to-back win because I am exhausted,” Drummond said, laughing.\n\n\r\n                    WAITING GAME\n\n\r\n                    Cavaliers G Kevin Porter Jr. (personal reasons) has yet to dress for a game as the front office mulls whether to discipline him for an offseason arrest. The second-year pro was expected to serve as Cleveland’s sixth man. “We’re still having those conversations, still working through the plan, organizationally,” Bickerstaff said.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Embiid, a three-time All-Star, averaged 28 points and 12 rebounds in the first two games, leading the team in both categories against Washington and New York. … Howard committed a flagrant foul against Dante Exum in the second. … F Danny Green spent his rookie season with the Cavaliers, appearing in 20 games in 2009-10.\n\n\r\n                    Cavaliers: Rookie F Isaac Okoro (left foot sprain) did not play after being injured at Detroit. The No. 5 overall draft pick started the first two games. … G Matthew Dellavedova (concussion) and rookie F Dylan Windler (broken left hand) also were inactive. … Cleveland debuted its rock-and-roll themed black alternate uniforms.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Host Toronto on Tuesday. Philadelphia dropped three of four games to the then-NBA champion Raptors last season, but won the only matchup at Wells Fargo Center.\n\n\r\n                    Cavaliers: Host New York on Tuesday. Cleveland then heads on the road for six games — its longest trip of the season — before returning home to play Memphis on Jan. 22.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997109.6525729
}