{
  "game_id": "0022300150",
  "espn_id": "401584778",
  "date": "Nov 06, 2023",
  "matchup": "MIA vs. LAL",
  "headline": "Adebayo has triple-double, Butler scores 28, Heat hold off LeBron and the Lakers 108-107",
  "body": "MIAMI -- — Bam Adebayo took charge. Kyle Lowry took a charge.\n\n\r\n              Both were absolutely required for the Miami Heat to hold off LeBron James and the Los Angeles Lakers on Monday night.\n\n\r\n              Adebayo had the first 20-rebound triple-double in Miami history, Jimmy Butler scored 28 points and the Heat survived a big offensive drought at the end to beat the Lakers 108-107 — a game in which no points were scored in the final 2:38.\n\n\r\n              Adebayo had 22 points, 20 rebounds and 10 assists for Miami in his sixth regular-season triple-double. Tyler Herro also scored 22 for the Heat and Duncan Robinson added 12 for Miami — which won despite having no field goals in the final 4:14.\n\n\r\n              “Kudos to Miami,” James said. “They played some really good ball tonight. We were able to match their intensity. We played some really good ball as well.\"\n\n\r\n              James led all scorers with 30 points for the Lakers, who fell to 0-4 on the road. Austin Reaves was an assist shy of a triple-double, finishing with 23 points, 10 rebounds and nine assists.\n\n\r\n              “Bron was phenomenal. ... That's a tough team to go against,” Lakers coach Darvin Ham said.\n\n\r\n              The Lakers didn’t have Anthony Davis for the final 14 minutes; he left the game twice with a left hip spasm and finished with nine points and six rebounds.\n\n\r\n              “Let it calm down, get treatment, get ready to suit up on Wednesday,” Davis said.\n\n\r\n              Adebayo was called for traveling with 8.9 seconds remaining, giving the Lakers a final chance. The inbounds pass went to James, who drove right and found a wide-open Cam Reddish for what would have been a game-winning corner jumper.\n\n\r\n              It bounced off the rim, Butler secured the rebound and time expired.\n\n\r\n              “LeBron's going to be LeBron and pass the ball to the open man,” Butler said. “He did that. He literally whipped it to the corner ... Cam shot it and missed it. Good for us.”\n\n\r\n              Another huge play late: Lowry taking a charge against James with 1:57 left, with the listed difference in height and weight among those players being nine inches and 55 pounds.\n\n\r\n              “In those kind of moments, he’ll figure out how to make a winning play,\" Heat coach Erik Spoelstra said of Lowry.\n\n\r\n              Lakers guard D’Angelo Russell got ejected with 7:52 left for picking up a pair of technical fouls for arguing, and the free throws by Herro put the Heat up 100-88 — just 32 seconds after the Lakers had a chance to get within three points.\n\n\r\n              Taurean Prince missed a 3-pointer that would have cut Miami’s six-point lead in half, and the game quickly changed. Jaime Jaquez Jr. had a layup, then Russell had a turnover, and Jaquez Jr. had another layup. Adebayo had assists on both of those scores by Jaquez, giving him the triple-double, and Russell was ejected for arguing after the second basket.\n\n\r\n              Ham also got a technical late in the third, and the Lakers had a delay-of-game technical — those free throws all proving costly in a one-point loss.\n\n\r\n              “All I want is an explanation sometimes,” Ham said. “To not get that for the rest of the game once I got my technical ... Miami plays a physical brand of basketball. We're not complaining about how physical they are. We just want balance and consistency. That's it.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Houston Rockets on Wednesday.\n\n\r\n              Heat: At Memphis Grizzlies on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995394.930773
}