{
  "game_id": "0021700730",
  "espn_id": "400975476",
  "date": "Jan 27, 2018",
  "matchup": "DAL @ DEN",
  "headline": "Jokic has triple-double as Nuggets beat Mavericks 91-89",
  "body": "DENVER --  The Denver Nuggets' offense has carried them most of the season, but this time they leaned on their defense -- and Nikola Jokic -- to hold off the Dallas Mavericks.\n\nJokic completed his second triple-double with a late jumper to put Denver ahead, and the Nuggets held on for a 91-89 victory Saturday night.\n\nJokic had 11 points, 16 rebounds and 11 assists. Gary Harris scored 24 to help Denver rally from nine points down in the fourth quarter for its third straight win.\n\nThe 91 points were the fifth-fewest Denver has scored in a game this season, and it came two nights after the Nuggets put up 130 in a win over New York.\n\n\"You never know how the game is going to go so we adjust to what the game gives us,\" Jokic said. \"We missed open shots and layups, but that's the kind of game it was.\"\n\nNuggets point guard Jamal Murray was healthy but did not start after violating a team rule, coach Michael Malone said after the game. After averaging 26.7 points in his previous three games, Murray struggled early Saturday before scoring all 15 of his points in the second half.\n\n\"My whole tempo was off,\" Murray said. \"Normally I start games with up tempo and I didn't come out talking and with the same energy I normally do.\"\n\nThe Mavericks were missing guards J.J. Barea (oblique strain) and Devin Harris (personal reasons) but played well without them even though it was the second of back-to-back games. They faltered down the stretch, going 4:27 without a field goal late in the game.\n\nHarrison Barnes had 22 points and Dennis Smith Jr. had 13 points, six rebounds and six assists for Dallas. The Mavericks have lost three in a row.\n\nDallas trailed by 13 early but quickly erased the deficit and took a three-point lead in the second quarter. The Mavericks went on a 16-1 run to end the third and take a 74-66 lead.\n\nDenver rallied to get back into it, and Jokic drained a jumper from the top of the key to give the Nuggets a 91-89 lead with 1:12 left. Barnes missed a 3-pointer, but an offensive foul was called on Jokic with 12.7 seconds left. After Mason Plumlee blocked Smith's layup out of bounds, Wesley Matthews missed a 3 at the buzzer.\n\n\"We got the ball back and we did get a look on the last shot,\" Mavericks coach Rick Carlisle said. \"The thing was a fraction of an inch to the left and we are having a party right now. They got lucky. They dodged a bullet tonight.\"\n\nTIP-INS\n\nMavericks: Carlisle said he hopes Barea's oblique injury is not a long-term issue. \"I hope it's a one-nighter,\" he said. \"It happened on a freakish play (Friday) night where he was reaching for the ball.\" ... Harris missed his second straight game for personal reasons and fourth in a row overall. He had missed the previous two games with a concussion.\n\nNuggets: Malone said F Wilson Chandler left in the first half with symptoms of a migraine. He did not return. ... F Tyler Lydon had arthroscopic surgery on his left knee Friday and is expected to miss the rest of the season. Lydon was hurt Wednesday while playing for the Rio Grande Valley Vipers in a G League game.\n\nTHROWBACK SATURDAY\n\nThe Nuggets hosted 1990s alumni Tom Hammonds, Reggie Williams and Robert Pack as part of their 50th anniversary season. They were honored at halftime, and before the game reminisced about the 1994 first-round upset of the Seattle SuperSonics.\n\n\"We were underdogs. Nobody expected us to do anything,\" Pack said. \"We not only won, but we won on their court against the No. 1 seed.\"\n\nThe flight home from Seattle after the Game 5 win was as memorable for Hammonds as the 3-2 series win.\n\n\"We're flying back across the Rockies and we hit some bad turbulence,\" he said. \"I said, `We just made NBA history and now we're getting ready to die!' The plane was going up and down, up and down, but we finally made it back.\"\n\nUP NEXT\n\nMavericks: Host the Miami Heat on Monday night.\n\nNuggets: Host the Boston Celtics on Monday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993948.8125372
}