{
  "game_id": "0021500642",
  "espn_id": "400828529",
  "date": "Jan 21, 2016",
  "matchup": "MEM @ DEN",
  "headline": "Gasol scores 27 as Grizzlies hold off Nuggets, 102-101.",
  "body": "DENVER --  With the game on the line, the Memphis Grizzlies leaned on Marc Gasol.\n\nAnd the All-Star center came through.\n\nGasol had 27 points, including a go-ahead three-point play with 12.2 seconds left, and Memphis beat the Denver Nuggets 102-101 on Thursday night.\n\nMike Conley had 20 points as the Grizzlies won their fourth in a row -- in front of NBA Commissioner Adam Silver.\n\nGasol has become more aggressive offensively and it showed against Denver. He had 18 points in the second half and the key bucket in the final seconds, when the defense collapsed on Conley at the top of the 3-point circle.\n\nWith Memphis trailing by one, Gasol hit a driving layup and was fouled. His free throw put Memphis ahead 100-98.\n\n\"It's a play that we run pretty often,\" Gasol said. \"Mike saw the pocket, his man went over the screen, my man had to help and he put it there.\"\n\nDanilo Gallinari, who led Denver with 17 points, missed a 3-pointer with 3.9 seconds left and Conley followed with two free throws.\n\nThe Nuggets kept forward Zach Randolph in check two weeks after he had 24 points off the bench in a seven-point Memphis win. Randolph scored just 13 points this time, but Denver couldn't contain Gasol.\n\n\"We did a better job on Zach tonight and Marc played a better game than he did the last time we played him,\" Nuggets forward Darrell Arthur said.\n\nSilver kept a low profile, stopping to take a picture with a fan near the tunnel to the Denver locker room in the second quarter.\n\nKenneth Faried also scored 17 to go with 12 rebounds for the Nuggets and Will Barton scored 10 of his 14 points in the fourth quarter. Rookie Emmanuel Mudiay had 14 points and eight assists for Denver, which came up short after rallying to take the lead.\n\n\"It gets so old when you hear, `Hey, great game, great comeback.' We're paid to win games,\" Nuggets coach Michael Malone.\n\nThe Grizzlies led by 18 in the second quarter but were down 59-58 early in the third. Denver increased its lead to 69-66 on Gary Harris' 3-pointer, but Gasol scored 10 points in a 13-4 run that gave Memphis the lead heading into the fourth.\n\n\"He's definitely a smart player,\" said Arthur, who played five years alongside Gasol. \"He can facilitate if he wants to, score if he needs to. He's been saying he's going to be more aggressive scoring the basketball and he was a beast down low.\"\n\nThe Grizzlies stretched the lead to seven early in the final quarter before Denver rallied to tie it at 91 on Barton's 3-pointer with 2:27 left.\n\nGasol split a pair of free throws with 53 seconds remaining to put Memphis ahead 97-96, but Barton's layup gave Denver the lead with 41 seconds to play.\n\nMatt Barnes missed a 3-pointer but Conley got the offensive rebound and the Grizzlies called a timeout to set up the last possession.\n\n\"It wasn't always pretty,\" Memphis coach Dave Joerger said. \"Different guys carried us at different times and I thought we executed down the stretch. Marc and Mike put us on their shoulders.\"\n\nTIP-INS\n\nGrizzlies: Tony Allen was a late scratch from the lineup. The Grizzlies had just 10 players available. ... Memphis signed C Ryan Hollins to a 10-day contract. It is his third stint with the Grizzlies this season. He had four points and four rebounds in 13 minutes.\n\nNuggets: Jameer Nelson missed his third straight game with a sprained right wrist. ... C Jusuf Nurkic returned after missing three games with a knee injury. He was available Tuesday but didn't play.\n\nINJURED OFFICIAL\n\nReferee Scott Wall tripped over a cameraman along the sidelines and rolled his ankle midway through the second quarter. He was down on the court for a few minutes but walked off without help. He returned before halftime.\n\nUP NEXT\n\nGrizzlies: visit Minnesota on Saturday night.\n\nNuggets: host Detroit on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994447.559561
}