{
  "game_id": "0021800626",
  "espn_id": "401071302",
  "date": "Jan 11, 2019",
  "matchup": "DAL @ MIN",
  "headline": "Doncic leads Mavs past Timberwolves in Saunders' home debut",
  "body": "MINNEAPOLIS --  Luka Doncic nearly recorded a triple-double, falling just two rebounds short. The final score was the only set of numbers he was focused on.\n\nDoncic scored 29 points and hit the go-ahead 3-pointer to lead the Dallas Mavericks over the Minnesota Timberwolves 119-115 on Friday night, spoiling rookie coach Ryan Saunders' home debut.\n\nDoncic, who helped secure the win by scoring seven of Dallas' final nine points, also finished with 12 assists and eight rebounds.\n\n\"I don't care about that,\" Doncic said of nearly getting the triple-double. \"We've just got to win. That's all that matters.\"\n\nHarrison Barnes scored 23 points, while JJ Barea and Dwight Powell came off the bench to score 16 and 15 points, respectively, for the Mavericks. Dallas (20-22) had entered the game 4-11 in its previous 15 games and was 3-18 on the road.\n\n\"We showed a lot of resilience,\" Dallas coach Rick Carlisle said. \"Tough game, tough crowd. The road's been a challenge for us all year. I loved the way we hung in. I really did.\"\n\nKarl-Anthony Towns had 30 points and 11 rebounds for the Timberwolves (20-22), who were playing their first home game since Saunders was named interim coach.\n\nTaj Gibson gave Minnesota the lead at 115-114 with a tip-in of Jeff Teague's miss with 35.7 seconds left. But with 22.9 to play, Doncic hit a pull-up 3 to put the Mavericks ahead for good.\n\n\"That's what he does so far for us,\" Dallas' Dirk Nowitzki said. \"He's been a great closer for us.\"\n\nDerrick Rose scored 21 points for Minnesota, while Andrew Wiggins added 17 and Josh Okogie hit a season-high four 3s, finishing with 15 points.\n\nThe Timberwolves trailed most of the game after shooting only 36.4 percent from the floor in the first half. But a 12-2 run in the fourth quarter tied the game. And with 1:41, left Towns gave Minnesota its first lead since the first quarter with a jump hook.\n\n\"We played the tempo we wanted in the second half, got ourselves back in the game, played well,\" Towns said. \"Just some things didn't go our way throughout the night and it led to our demise. We also hurt ourselves, too.\"\n\nDoncic took over down the stretch. Before the winning 3, he hit a tough runner and put down a dunk in traffic. All three gave the Mavericks the lead and all three came in the final 1:28.\n\n\"He's a talent,\" Saunders said. \"Big-time players make big-time plays. He made one tonight and we're feeling it.\"\n\nSaunders, who received a loud ovation from the Target Center crowd before the game, took over as coach after Tom Thibodeau was relieved of his duties Sunday. He won his first game in charge Tuesday at Oklahoma City. Saunders is the son of the late Flip Saunders, the winningest coach in Timberwolves history. A banner hangs in the Target Center rafters in honor of Flip Saunders, who died in 2015.\n\n\"Obviously, disappointing, especially in front of the home crowd,\" Ryan Saunders said. \"We had a lot of easy looks, I thought. They just didn't fall for us early. The second half, we didn't do a great job in terms of communicating as a team. So, that's something we've got to get better with moving forward.\"\n\nDerrick Rose scored 21 points, Andrew Wiggins scored 17 points and Josh Okogie scored 15 and hit a season-high four 3s for Minnesota.\n\nFOLLOWING IN DAD'S FOOTSTEPS\n\nCarlisle called it emotional to see Saunders coaching the Timberwolves. Before Friday's game, Carlisle recalled borrowing Mavericks owner Mark Cuban's plane to attend Flip Saunders' funeral along with fellow NBA coaches including Doc Rivers and Scott Brooks.\n\nCarlisle and Ryan Saunders have talked often since Flip Saunders' death.\n\n\"You never know what's going to happen,\" Carlisle said. \"But this opportunity is something that is great for him. He's built so similarly to his dad in terms of his character, in terms of his amazing way with people and his positive view on everything.\"\n\nTIP INS\n\nMavericks: Barea left with what Carlisle called a lower-leg injury. Carlisle said Barea would undergo an MRI on Saturday. ... The Mavericks' seven turnovers were their fewest of the season. ... Had Doncic gotten his triple-double, he would have tied Philadelphia's Markelle Fultz as the youngest player to record one at 19 years, 317 days. ... G Dennis Smith Jr. did not play because of mid back tightness. It was the 14th game he's missed this season.\n\nTimberwolves: Towns briefly went to the locker room in the first half with an ankle injury. ... Rose had missed the previous six games with a sprained right ankle. ... F Robert Covington missed his fifth consecutive game with a bruised right knee. ... The Timberwolves' 11 offensive rebounds in the first quarter were tied for the most by a team in one quarter since 1996-97.\n\nUP NEXT\n\nMavericks: host the Golden State Warriors on Sunday night.\n\nTimberwolves: host New Orleans Pelicans on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995454.473603
}