{
  "game_id": "0022200984",
  "espn_id": "401469139",
  "date": "Mar 07, 2023",
  "matchup": "MEM @ LAL",
  "headline": "Anthony Davis leads Lakers past Grizz without Ja, 112-103",
  "body": "LOS ANGELES -- — Anthony Davis had 30 points and 22 rebounds, Dennis Schröder added 17 points and nine assists and the Los Angeles Lakers moved into ninth place in the Western Conference with a 112-103 victory over the Memphis Grizzlies on Tuesday night.\n\n\r\n              Rui Hachimura and Austin Reaves scored 17 points apiece in the sixth win in eight games for the Lakers, who are surging since the trade deadline despite missing LeBron James and D'Angelo Russell to injury.\n\n\r\n              “It's good, but we're not satisfied,” Davis said about the Lakers' highest spot in the standings since their 2-10 start to the season. “We don't want to stop there. We want to get greedy.”\n\n\r\n              Davis turned in a superstar performance against the Grizzlies, hitting 11 of his 17 shots and repeatedly making big plays down the stretch while wearing a bandage on his nose from a first-half cut. He also blocked two shots, and Los Angeles held Memphis to 46 points in the second half of another strong defensive effort.\n\n\r\n              “Guys out there are confident, and when you play basketball like that, it leads to victories,\" Davis said.\n\n\r\n              Jaren Jackson scored 26 points and Tyus Jones had 16 for the Grizzlies, who dropped to 0-2 without Ja Morant with their third straight loss overall.\n\n\r\n              “The margin for error is really small right now,” coach Taylor Jenkins said. “It's our third rough patch of the year. We always find a way to respond.”\n\n\r\n              Morant missed his second straight game since the Memphis superstar apparently took a gun into a strip club on the road and then flaunted it on social media last weekend. The two-time All-Star and the Grizzlies' leading scorer is the target of two NBA investigations and a reported probe by Denver police.\n\n\r\n              Jenkins wouldn't say when Morant will return from what was initially announced as a two-game absence.\n\n\r\n              “We're in touch with him every single day,” Jenkins said. “He's still a huge part of what we do. As I said the other day, we love him. We want what's best for him. We support him. ... It's a healing process, so if everyone expects something to change overnight, we've got to (do) due diligence and be respectful in that. We're talking about Ja being in a better place personally and also professionally, so to put a timetable on it is disrespectful, in my opinion.”\n\n\r\n              The Lakers made a 17-4 run down the stretch with Davis excelling on both ends of the court. Troy Brown Jr., who scored 13 points, made a clutch 3-pointer with 1:12 to play before Davis adroitly tipped in a miss in the final minute to clinch it.\n\n\r\n              Dillon Brooks scored 13 points for Memphis, while Desmond Bane had seven points on 3-for-14 shooting in his lowest-scoring performance of the season.\n\n\r\n              “My confidence is high,” Jenkins said. “Our guys are confident. They’re together. You’re going to take your lumps every now and then. We’re taking those now right now, but our guys trust the work they’re putting in..”\n\n\r\n              MISSING STARS\n\n\r\n              Russell missed his sixth straight game with an ankle injury, but coach Darvin Ham said the Lakers are targeting Friday for his return. James is out for at least two more weeks with a right foot injury that has cost him five games.\n\n\r\n              FELICIDADES PAU\n\n\r\n              The Lakers retired Pau Gasol’s No. 16 jersey at halftime, honoring the dominant Spanish 7-footer who reached three NBA Finals and won two titles after joining Los Angeles in a trade with Memphis in 2008. Gasol spent his first seven NBA seasons with the Grizzlies, and he chose this night for his jersey retirement because both of his teams could be involved.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Brooks returned from his one-game suspension for an accumulation of technical fouls. ... Brandon Clarke missed his second straight game since tearing his left Achilles tendon. ... Bane, who is averaging 21.5 points per game, missed his first nine shots and didn't score until the final seconds of the third quarter.\n\n\r\n              Lakers: Mo Bamba is out with a sprained left ankle, leaving Los Angeles with Davis as its only player taller than 6-foot-9. ... Davis spent several minutes in the locker room during the second quarter after his nose was cut and bloodied by a foul from David Roddy.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Golden State on Thursday night.\n\n\r\n              Lakers: Host Toronto on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994176.605592
}