{
  "game_id": "0021600584",
  "espn_id": "400900005",
  "date": "Jan 11, 2017",
  "matchup": "ORL @ LAC",
  "headline": "Clippers beat Magic 105-96, improve to 5-0 in new year",
  "body": "LOS ANGELES --  The Los Angeles Clippers are still without Blake Griffin. The way they've started 2017, it's hard to tell.\n\nJ.J. Redick had 22 points and hit five 3-pointers in the fourth quarter to help the Clippers hold off the Orlando Magic 105-96 on Wednesday night, improving to 5-0 since the year began.\n\n\"We feel like we can keep piling up wins,\" said Chris Paul, who added 18 points.\n\nMarreese Speights scored 10 of his 13 in the fourth, including three 3-pointers, on a night when the Clippers committed 21 turnovers. DeAndre Jordan grabbed 20 rebounds (to go with 10 points) for his NBA-leading sixth game with 20 or more.\n\n\"Mo plays with a lot of energy and excitement, and we feed off that and it gets everybody going,\" said Paul, who had five turnovers.\n\n\"I can't stand them,\" he said. \"That's five opportunities we didn't get to score. It could have hurt us down the stretch.\"\n\nAaron Gordon had 28 points, 18 in the first half, to lead Orlando, which has lost four in a row and six of seven. Nikola Vucevic had 16 points and 12 rebounds for his team-high 18th double-double.\n\nGordon scored 33 points in 40 minutes, both career highs, in a win over the Clippers on Dec. 14.\n\n\"This is a game that I thought we should have won by the way that we played,\" he said. \"We had a couple of breakdowns here and there, a couple of lapses in defensive execution, a few too many turnovers and it leads to a loss.\"\n\nThe teams kept it close in the fourth, when the Clippers never led by more than nine. Their bench carried them, with Redick and Paul the only starters who scored in the period.\n\n\"It felt like we just couldn't get away from them,\" Los Angeles coach Doc Rivers said. \"We just kind of hung in there.\"\n\nWith his team down 75-73, Jamal Crawford got fouled on a 3-pointer and made all three shots.\n\n\"That was huge,\" Paul said, \"and then we started getting some stops.\"\n\nThe Magic got to 92-90 on Gordon's 3-pointer before Speights and Redick answered with consecutive 3s. That steadied the Clippers, who got seven points from Paul down the stretch.\n\n\"We're playing with the right spirit and a lot of energy,\" said Paul, who recently returned from a strained hamstring.\n\nOrlando controlled the first 1 1/2 quarters behind Gordon's scoring and the Clippers' early turnovers.\n\nLos Angeles took over with a 20-8 run to close the half leading 56-51. Paul got the offense going with back-to-back baskets, Redick hit consecutive 3s and Jordan had two one-handed dunks in a row. His first came on Paul's alley-oop pass, and on the second he took Austin Rivers' pass and went flying through the lane.\n\n\"We have to have a defensive identity,\" Orlando coach Frank Vogel said. \"We have to rely on our defense and that can carry you when shots are not going. We are continuing to try to establish that, but it hasn't taken shape yet.\"\n\nTIP-INS\n\nMagic: F/C Serge Ibaka sat out with a sprained right shoulder. ... G Elfrid Payton started despite a bruised right quadriceps.\n\nClippers: Paul surpassed 13,000 minutes played in a Clippers uniform in the first quarter, the 10th player in team history to do so. ... Austin Rivers was back in the starting lineup after missing Sunday's game with flu-like symptoms. The elder Rivers also returned after missing Tuesday's practice for what he said was the first time in his career with similar symptoms.\n\nGRIFFIN'S PROGRESS\n\nGriffin is on track to return to the Clippers this month after having knee surgery.\n\nThe elder Rivers said Griffin \"feels great\" and his return is still based on the team's original estimate of four to six weeks.\n\nGriffin was averaging 21.2 points, 8.8 rebounds and 4.7 assists before having arthroscopic surgery to remove loose bodies from his right knee on Dec. 20.\n\nUP NEXT\n\nMagic: Visit the Portland Trail Blazers on Friday in the third of six games on their road trip.\n\nClippers: Host the Los Angeles Lakers on Saturday, a team they lost to by nine points on Christmas.",
  "source": "espn_api",
  "crawled_at": 1764995851.028003
}