{
  "game_id": "0021501003",
  "espn_id": "400828890",
  "date": "Mar 16, 2016",
  "matchup": "OKC @ BOS",
  "headline": "Durant's 28 points leads Thunder to 130-109 win over Celtics",
  "body": "BOSTON -- Kevin Durant stepped to the free throw line with his Thunder clobbering the Celtics, and the home crowd let him know how they felt.\n\"Come to Boston! Come to Boston!\"\nDurant will be a free agent in July and showed Celtics fans how good he would look in green.\n\nDurant had 28 points, nine assists and seven rebounds in just over three quarters, and the Oklahoma City Thunder beat the Celtics 130-109 on Wednesday night.\n\"We just have to ride this wave now and see where it takes us,\" Durant said after the Thunder posted their second straight victory of 20-plus points.\nThe Thunder were in control for most of the night, quieting the TD Garden crowd for most of Boston's most lopsided home loss of the season until the 6-foot-9 forward's free throws in the third quarter. He said he didn't hear the chant.\nRussell Westbrook scored 24 points and Enes Kanter had 17 points and 12 rebounds for the Thunder, who had lost six of their last 10 games.\n\"We have confidence in each other defensively,\" Durant said \"We have to stay with each other. Offensively, the first and second units are doing a great job of finding each other and making the game simple.\"\nIsaiah Thomas led Boston with 29 points, and Tyler Zeller had 16. The Celtics lost their third straight after winning six of seven.\n\"It's hard to guard a team like that with two very good players, as in, Westbrook and Durant,\" Celtics guard Avery Bradley said.\nDurant has scored 20 or more points in 60 of the 61 games he's played this season, including 53 straight. He came out with just under nine minutes to play.\nAdding Westbrook's solid play to Durant was too much for Boston.\n\"Those guys really played great and it was good to see them in timeouts when they kind of made a run at us, they kind of stopped it,\" Thunder coach Billy Donovan said.\nIt was Boston's second straight loss at TD Garden following a 14-game home winning streak.\nBefore the game, Boston coach Brad Stevens said that Durant's ability to score is \"ridiculous.\"\nThe star then went out and scored on his team's first three possessions, hitting a 3-pointer from the right wing before consecutive turnarounds over 6-foot-4 guard Marcus Smart.\nOklahoma City, which never trailed, led by 11 at halftime and built it up to 28 points late in the third quarter.\nThe Celtics scored the first basket in the second half before the Thunder went on an 11-0 run over the ensuing 2:32. Serge Ibaka started the spree with consecutive jumpers, the second a 3 that made it 71-57.\nOklahoma City made it 98-71 on Westbrook's 3-pointer that capped a 10-0 run with 2:59 left in the third.\nOklahoma City hit eight of 16 shots from behind the 3-point line in the first half en route to a 66-55 lead at intermission.\nTIP-INS\nThunder: G Dion Waiters played for the first time after leaving the team last Wednesday to attend the funeral of his younger brother, Demetrius Pinckney. He was killed in South Philadelphia on March 8. Waiters tapped his chest near his heart and pointed to the sky after making his only shot, a 3 from the left wing early in the second quarter.\nCeltics: F Kelly Olynyk returned after missing 12 straight games with an injured right shoulder. ... F Jae Crowder missed his second in a row with a sprained right ankle that's expected to keep him sidelined for at least two weeks. ... F Jonas Jerebko missed the game with a sore ankle. ... They wore their green uniforms in honor of St. Patrick's Day.\nTIZZY\nDurant spoke highly of the city of Boston during his team's shootaround, sending the local sports talk shows into an afternoon of chatter about him coming to the Celtics.\nBut Donovan said it's just how his star is as a person.\n\"I think Kevin has always been respectful,\" Donovan said before the game. \"He's a great guy. I don't think Kevin would ever say anything derogatory about another team or a player. That's just who he is.\"\nUP NEXT\nThunder: At Philadelphia on Friday.\nCeltics: At Toronto on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994136.794809
}