{
  "game_id": "0021601029",
  "espn_id": "400900424",
  "date": "Mar 18, 2017",
  "matchup": "POR @ ATL",
  "headline": "Lillard has 27 as Trail Blazers start fast, top Hawks 113-97",
  "body": "ATLANTA --  Portland's dominant first quarter gave the Trail Blazers a big lead over Atlanta they never lost.\n\nDamian Lillard said it was especially encouraging to see the focused Blazers turn back the Hawks' comeback attempt.\n\nLillard scored 27 points and Portland kept up its playoff push by beating the Hawks 113-97 on Saturday night.\n\nC.J. McCollum had 22 points and Allen Crabbe added 16 for Portland, which raced out to a 17-3 lead that grew to 22 points by the end of the opening period.\n\n\"Usually for us, if we have fast starts we allow teams to get back into the game,\" Lillard said. \"But tonight, I thought we were able to sustain our focus on both ends of the floor. Even when shots stopped falling offensively we still played physical and we helped each other out on the defensive end. That allowed us to hold onto the lead.\"\n\nPortland, which has won seven of nine, began the night 2 1/2 games behind Denver for the Western Conference's final playoff spot.\n\nThe Hawks have lost three straight, including the last two at home. They fell three games behind fourth-place Toronto in the East.\n\nAtlanta held out four-time All-Star forward Paul Millsap after he experienced tightness in his left knee during pregame warmups.\n\n\"As a group, you have to kind of step up when a teammate goes down,\" coach Mike Budenholzer said. \"We didn't do that in the first quarter.\"\n\nErsan Ilyasova, who started for Millsap, had 23 points. Tim Hardaway Jr. scored 22.\n\nThe Trail Blazers took command with a strong start, making 11 of their first 12 shots from the field. A jumper by Lillard pushed the advantage to 32-12. Portland outscored the Hawks 40-18 in the quarter -- its biggest margin in any period this season.\n\nThe Hawks twice cut the deficit to 11 early in the fourth, including at 89-78 following a layup by Malcolm Delaney. The Trail Blazers quickly answered with a layup by McCollum.\n\nBudenholzer immediately called a timeout, charged onto the court and confronted Dwight Howard, apparently about the center's lack of defense on the play.\n\nThe Hawks' comeback attempt never regained its momentum. Lillard had a 3-pointer and three free throws in a 10-0 run that increased the lead to 101-80.\n\nTIP-INS\n\nTrail Blazers: Portland outscored Atlanta 48-30 in the paint and outrebounded the Hawks 54-35. ... Instead of returning to Portland, the Trail Blazers flew to Atlanta following Wednesday night's 110-106 win at San Antonio. ... Noah Vonleh had 10 points and 10 rebounds. Jusuf Nurkic had 12 points and nine rebounds.\n\nHawks: Howard had 14 points and 10 rebounds. ... Dennis Schroder shot 2 of 14 from the field for nine points. ... Kent Bazemore, who had 12 points, left in the fourth quarter with a bruised right knee.\n\nTURNER RETURNS\n\nPortland forward Evan Turner had two points and eight rebounds in 18 minutes after missing 14 games with a broken right hand. He played with a protective brace on his hand.\n\n\"It felt fine,\" Turner said. \"I just tried to get to the point where I don't really worry too much about the brace.\"\n\nThe Blazers were 7-7 without Turner, who got hurt on Feb. 7.\n\nOSCAR NOMINATION\n\nHoward said Nurkic was acting when he fell to the floor and rubbed his chin on a play that earned Howard a technical foul midway through the third quarter. Nurkic fell after Howard swung his elbow, but Howard insisted he didn't hit Nurkic's face.\n\n\"When you look at the review, there's no way I got him in his face,\" Howard said, adding Nurkic \"did a good job of acting it out. He should find a way to make it in Hollywood. They're doing films in Atlanta now, so he can find a good film right here and do some acting. That's what it was.\"\n\nUP NEXT\n\nTrail Blazers: At the Miami Heat on Sunday.\n\nHawks: At the Charlotte Hornets on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995647.341161
}