{
  "game_id": "0022400947",
  "espn_id": "401705513",
  "date": "Mar 12, 2025",
  "matchup": "PHI @ TOR",
  "headline": "Lawson, Rhoden and Robinson help Raptors beat 76ers 118-105 for 5th win in 6 games",
  "body": "TORONTO -- — AJ Lawson scored 28 points, Jared Rhoden set career highs with 25 points and 12 rebounds and the Toronto Raptors beat the Philadelphia 76ers 118-105 on Wednesday night in a matchup of short-handed teams.\n\n\r\n              Orlando Robinson scored a career-high 25 points and matched his career high with 12 rebounds to help the Raptors win for the fifth time in six games.\n\n\r\n              Andre Drummond returned after sitting out Monday night in a loss at Atlanta due to illness but the 76ers were without eight players including Joel Embiid (left knee), leading scorer Tyrese Maxey (back/finger), Paul George (left groin) and former Raptors star Kyle Lowry (right hip).\n\n\r\n              Toronto’s list of nine absentees included Scottie Barnes (right hand), leading scorer RJ Barrett (personal) and Immanuel Quickley (rest). \n\n\r\n              Quentin Grimes scored 29 points and Jeff Dowtin Jr. had a career-high 20 against his former team, but the 76ers lost for the fifth time in seven games following a nine-game losing streak. \n\n\r\n              Philadelphia shot 7 for 35 from 3-point range. The 76ers have lost eight straight on the road.\n\n\r\n              Takeaways\r\n              76ers: Lonnie Walker IV played just 20 seconds, exiting after hitting the back of his head on the court in a hard fall in the first quarter. Walker was able to leave without assistance but did not return.\n\n\r\n              Raptors: Colin Castleton had a career-high 14 rebounds in his first NBA start.\n\n\r\n              Key moment\r\n              The 76ers shaved a 14-point halftime deficit to three points after three quarters but Toronto used a 12-2 spurt at the start of the fourth to restore its double-digit edge.\n\n\r\n              Key stat\r\n              The Raptors shot 8 for 12 from 3-point range in a 40-point second quarter. One of the four misses was Lawson’s 34-foot heave at the halftime buzzer.\n\n\r\n              Up next\r\n              Both teams play Friday night. Philadelphia hosts Indiana, and Toronto begins a four-game trip at Utah. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998205.243768
}