{
  "game_id": "0021600999",
  "espn_id": "400900394",
  "date": "Mar 14, 2017",
  "matchup": "DET @ CLE",
  "headline": "James has triple-double, Cavs beat Pistons 128-96",
  "body": "CLEVELAND --  LeBron James got his 52nd career triple-double Tuesday, and that doesn't even count perhaps his most notable assist of the night.\n\nJames had 16 points, 11 rebounds and 12 assists, Kyrie Irving had 26 points and the Cleveland Cavaliers used a blazing start to overpower the Detroit Pistons 128-96.\n\nJames was overpowering at moments, sometimes even against his own teammates. He flattened Irving while grabbing a rebound in the third quarter, but helped him to his feet before dribbling the ball up the floor.\n\nJames said he was surprised to see Irving in his path.\n\n\"I'm not going to let him stay on the floor,\" James said. \"I gotta get my guy up and make sure I get the ball up the court before the eight-second violation.\"\n\nCleveland had lost four of five, so a few laughs were welcome. Cavaliers coach Tyronn Lue chuckled at the mention of his two best players colliding.\n\n\"When we're up and we're winning and feeling good, we'll do anything, so who knows,\" he said.\n\nJames picked up his 10th triple-double of the season and third in the last four games at the 3:45 mark of the third quarter and played only 28 minutes.\n\nCleveland's hot shooting buried Detroit early. The Cavaliers made their first 10 3-pointers and started by hitting 22 of 25 shots for a 60-33 lead early in the second quarter.\n\n\"They were great and we were terrible,\" Detroit coach Stan Van Gundy. \"That's how you get a lopsided game.\"\n\nIman Shumpert scored a season-high 18 points for Cleveland, which is 3-5 in March but still leads Boston by 2 1/2 games for the best record in the Eastern Conference.\n\nTobias Harris led Detroit with 17 points. The Pistons are seventh in the East but are in a tight battle with several teams for a playoff spot.\n\nDetroit used a fourth-quarter rally to beat Cleveland last week at the Palace of Auburn Hills. The Cavaliers went ahead four minutes into the game and smothered any chance of another surprise comeback.\n\nAndre Drummond had 14 rebounds and Marcus Morris scored 13 points for the Pistons.\n\nCleveland made 19 of 30 3-pointers and shot 60 percent from the field.\n\nLarry Sanders, signed by the Cavaliers on Monday, played the final 1:58 and missed his only shot attempt while recording two fouls.\n\nThe Cavaliers also received encouraging news before the game about Kevin Love. The forward, who had knee surgery last month, is expected to return during the team's road trip that begins Saturday.\n\nGOOD TIMING\n\nLue said building a big lead early was something the Cavaliers needed after struggling this month.\n\n\"It's been a while since we actually came out and put a team away early in the third quarter where guys could sit in the fourth quarter,\" he said.\n\nTIP-INS\n\nPistons: Harris (bruised left knee) did not practice Monday but made his third straight start. Harris has appeared in all 67 games this season. ... Detroit was 17 of 52 from the field in the first half.\n\nCavaliers: GM David Griffin said before the game that Sanders will probably spend two weeks at Canton of the NBA Development League to work on his conditioning. Since the veteran was dressed, Lue wanted to get him into the game for a couple of minutes. Lue said he sent a ball boy to check with Griffin before putting Sanders in. ... G Kyle Korver (sore left foot) participated in on-court drills Tuesday. He's missed the last three games.\n\nUP NEXT\n\nPistons: Host Utah on Wednesday. The Jazz beat Detroit 110-77 on Jan. 13 in Salt Lake City.\n\nCavaliers: Host Utah on Thursday. Cleveland is 15-6 against the Jazz at Quicken Loans Arena.",
  "source": "espn_api",
  "crawled_at": 1764996032.5354722
}