{
  "game_id": "0021900879",
  "espn_id": "401161521",
  "date": "Feb 28, 2020",
  "matchup": "TOR vs. CHA",
  "headline": "Rozier hits tiebreaking FT, Hornets beat Raptors 99-96",
  "body": "TORONTO --  For the first time in more than two months, the Toronto Raptors are on a losing streak.\n\nTerry Rozier hit a tiebreaking free throw with 2.1 seconds remaining and the Charlotte Hornets beat Toronto 99-96 on Friday night, handing the Raptors their second consecutive loss and just their third in 20 games.\n\nBismack Biyombo had 13 points and 11 rebounds against his former team, and Devonte Graham scored nine of his 18 in the fourth quarter as the Hornets won their second straight and beat short-handed Toronto for the third time in 10 meetings.\n\n\"Probably one of our best wins of the season,\" Hornets coach James Borrego said of beating the defending champs on their home court. \"They're a fantastic team, a well-coached team, they know what they're doing. It was a big-time win for us.\"\n\nRozier scored 18 points, Miles Bridges had 17 and P.J. Washington 15 as all five Hornets starters finished in double figures.\n\n\"They've got a great group,\" Rozier said about the Raptors. \"We just dug deep and we stayed with it and we pulled it out.\"\n\nCharlotte has won five of seven after losing 13 of the previous 14.\n\n\"We're heading in the right direction. Our young guys are growing,\" Biyombo said.\n\nPascal Siakam had 24 points, Norman Powell returned from injury to score 22 and Kyle Lowry had 21 for the Raptors.\n\nToronto, which lost 108-97 to NBA-leading Milwaukee on Tuesday, dropped back-to-back games for the first time since losing at Indiana on Dec. 23 and at home to Boston on Christmas Day.\n\n\"We just didn't have the complete effort tonight,\" Lowry said. \"It hurts. You don't want to ever lose but you've got to grow from it, you've got to learn from it.\"\n\nIt's just the fourth time this season the defending champions have dropped consecutive games. Toronto lost three in a row between Dec. 3 and 8, losing at home to Miami and Houston before a defeat in Philadelphia.\n\nRaptors guard Fred VanVleet sat out because of a sore left shoulder, while forward Serge Ibaka was inactive because of a sore left knee.\n\nPowell returned to the starting lineup after missing nine games because of a broken finger on his left hand. Rondae Hollis-Jefferson started for Ibaka and fouled out with four points. Hollis-Jefferson missed six of eight field goal attempts but had nine rebounds.\n\nDown 73-66 through three quarters, Toronto took its first lead of the second half on Lowry's 3-pointer with 2:29 remaining. Lowry's big shot came after the Raptors grabbed the rebound on their All-Star guard's missed free throw.\n\nRozier answered with a 3, and Graham made one of two at the line to push Charlotte's lead to 93-90. Lowry connected from deep again to tie it, then scored on a driving layup to give the Raptors a 95-93 lead with 1:14 remaining.\n\nBridges hit a 3 for the Hornets, but Lowry tied it again by making the second of two free throws.\n\nAfter a missed shot by Graham, Toronto had two chances to break the tie, but Powell and Lowry both missed, giving the Hornets the ball with 2.1 seconds to play. Hollis-Jefferson fouled Rozier before the ball was inbounded, and the Hornets guard broke the tie by making one free throw.\n\nCharlotte kept the ball and Siakam fouled Graham, who made both to push the lead to 99-96 with 1.2 seconds left. Powell's attempted tying shot bounced off the rim at the buzzer.\n\nDown 25-23 after one, Toronto missed 13 of its first 15 field goal attempts in the second and shot a dismal 6 for 27 in the quarter. Charlotte led 52-41 at halftime.\n\n\"We've got to be a little bit better offensively,\" Lowry said. \"I think we got great shots, we just missed a lot.\"\n\nTIP-INS\n\nHornets: Outrebounded the Raptors 58-45. ... The Hornets had an 18-9 edge in bench points.\n\nRaptors: C Marc Gasol (left hamstring) missed his 12th straight game. . F Patrick McCaw returned after missing three games because of flu-like symptoms. He shot 0 for 6. . The Raptors have held their opponents below 100 points an NBA-leading 18 times. . Toronto's five turnovers were a season low.\n\nRARE FEAT, PART 1\n\nCharlotte won on the road against an opponent with a winning record for the second time this season. The Hornets also won at Dallas on Jan. 4.\n\nRARE FEAT, PART 2\n\nRozier, in his fifth season, won at Toronto for the first time. He'd lost every visit in his previous four years with Boston.\n\nSTREAK SNAPPED\n\nThe Hornets shot 13 for 30 from 3-point range, becoming the first Raptors opponent in 28 games to miss fewer than 20 shots from beyond the arc. Toronto's streak was the NBA's longest since the 3-point era began in 1979-80.\n\nUP NEXT\n\nHornets: Host the Milwaukee Bucks on Sunday.\n\nRaptors: Begin a five-game road trip at Denver on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995585.194464
}