{
  "game_id": "0021400143",
  "espn_id": "400578435",
  "date": "Nov 16, 2014",
  "matchup": "MIL @ MIA",
  "headline": "Bucks hold off struggling Heat, 91-84",
  "body": "MIAMI --  Brandon Knight looked right at home.\n\nMakes sense, considering he was born in Miami.\n\nKnight made three 3-pointers in the final 3 minutes to cap his 20-point effort, and the Milwaukee Bucks downed the slumping Heat 91-84 on Sunday night.\n\n\"We want to continue to build off it,\" Knight said.\n\nJabari Parker added 13 points for the Bucks (5-5), who started 5-21 last season. Larry Sanders, Giannis Antetokounmpo and Zaza Pachulia each scored 11.\n\nMilwaukee beat Miami for the first time in the teams' last 10 meetings, including playoffs.\n\nMario Chalmers scored 18 for Miami (5-5), which was again without Dwyane Wade and lost its third straight. Shawne Williams had 13 points for the Heat, who got 11 from Norris Cole and 10 apiece from Luol Deng, Chris Bosh and Shabazz Napier.\n\n\"We have to figure it out,\" Heat coach Erik Spoelstra said.\n\nBosh shot 2 for 17 from the field, dropping him to 12 for 49 in his last three games. In games where he's taken at least 10 shots, Bosh has shot worse only once -- a 1-for-18 night at Chicago in 2011.\n\n\"To say sit back and the game will come to you, I don't think that's a wise decision on my part,\" Bosh said. \"Yeah, I'm going to press. I'm going to press until I get over the hump.\"\n\nThe Heat struggled again from the foul line, shooting 13 for 22 and are now 21 for 40 from the stripe in their last two home games.\n\nMiami led by 12 in the first half and went up 49-41 early in the third on a 3-pointer by Chalmers, who started because Wade missed his second straight game with a bad hamstring.\n\nMilwaukee outscored Miami 35-16 over the next 14 minutes, holding the Heat to 5-for-20 shooting -- including 1-for-12 to open that stretch. Pachulia's jumper made it 76-65 with 8:40 left.\n\nThe Heat closed to 78-74 on Williams' third 3-pointer of the night with 3:41 left. But Miami couldn't get a stop on the ensuing trip and after Bosh blocked Antetokounmpo's shot near the rim, Milwaukee controlled the rebound and got the ball to Knight.\n\nKnight made a 3, the lead was back to seven and he punched the air.\n\n\"You can't get complacent,\" Parker said. \"We're doing some good things early in the season, but that doesn't put us in the playoffs.\"\n\nTIP-INS\n\nBucks: Coach Jason Kidd is now 5-0 against Miami in regular-season games. His Brooklyn team swept four meetings with the Heat last season, and then lost a playoff series to Miami in five games. ... Antetokounmpo made his first start of the season. He started 23 of his 77 appearances with Milwaukee a year ago.\n\nHeat: Wade will accompany the team on its trip to Brooklyn and is day to day. Wade has been doing \"corrective exercises,\" something that recently hired Heat assistant athletic trainer Wes Brown emphasized when he worked with players at the University of Miami. ... Monday's game at Brooklyn completes Miami's fourth back-to-back in a span of just over two weeks.\n\nKIDS' NIGHT\n\nWith Wade out and Danny Granger, Justin Hamilton and Josh McRoberts also sidelined, the Heat got a first-half boost from their rookies. James Ennis and Napier combined to make 7 of 8 shots and score 17 points in the first 24 minutes.\n\nSHOWING DEPTH\n\nThe Bucks used 12 players. Milwaukee's bench has outscored opposing reserves in every game, including 36-22 on Sunday. \"We believe we're a deep team,\" Kidd said.\n\nUP NEXT\n\nBucks: Host New York on Tuesday.\n\nHeat: Visit Brooklyn on Monday.",
  "source": "espn_api",
  "crawled_at": 1764991841.200945
}