{
  "game_id": "0022300415",
  "espn_id": "401585043",
  "date": "Dec 27, 2023",
  "matchup": "ORL vs. PHI",
  "headline": "Maxey, Harris, Melton help 76ers beat Magic 112-92 without Embiid",
  "body": "ORLANDO, Fla. -- — The 76ers didn't have their All-Star center Wednesday night, but they brought their defense.\n\n\r\n              Tyrese Maxey scored 23 points and Tobias Harris and De’Anthony Melton added 22 each for Philadelphia, which beat the Orlando Magic 112-92 while playing without reigning MVP Joel Embiid.\n\n\r\n              “We got deflections, got a lot of runouts. It was our first time trying some different things out there defensively,” Maxey said. “It really worked, really helped us.”\n\n\r\n              Paul Reed had 15 points, 10 rebounds and three blocks for the Sixers while starting at center for Embiid, the league's leading scorer who missed a second straight game with a sprained right ankle. Philadelphia has won nine of its past 11 games.\n\n\r\n              “I think we certainly got to find another style to play because it’s so different when he’s there, and the first couple (games) weren’t great,” Sixers coach Nick Nurse said. “Playing well enough to give ourselves a chance to win is the main thing without Joel.”\n\n\r\n              Franz Wagner scored 24 points for the Magic, who were held to a season low in scoring and have lost five of seven. Jalen Suggs added 20 points and Paolo Banchero added 19 points and nine rebounds for Orlando, which shot 9 for 33 from 3-point range.\n\n\r\n              Banchero struggled all night and finished 6 of 21 from the field.\n\n\r\n              “I thought they did a really good job of plugging the paint and our ability to navigate that,” Magic coach Jamahl Mosley said. “You have to give them credit for recognizing the game plan and executing it at a high level.”\n\n\r\n              The Magic, who have hit less than 28% of their 3s in each of their last three losses, got some open looks from behind the arc, and Suggs said they had to take them.\n\n\r\n              “They're great looks. We wouldn't trade any of those,” he said. “Those are shots we’re living with and we’ll take those every time. If you don’t take them, that looks crazy.”\n\n\r\n              Harris scored twice during a 9-0 run that gave the Sixers the first of three 11-point leads they held in the third period. Suggs responded with a dunk and a 3-pointer before being called for his fourth foul with 7:04 left in the quarter.\n\n\r\n              Back-to-back 3-pointers by Banchero and Caleb Houstan got the Magic back within three with 9:36 remaining, but Harris and Melton hit 3s for the 76ers and Orlando never threatened again. The Magic scored only 17 points in the fourth quarter.\n\n\r\n              Maxey, coming back from a 4-for-20 shooting performance in a Christmas Day loss at Miami, scored 14 points in the first half despite sitting out the final eight minutes of the first quarter with two fouls.\n\n\r\n              “I stayed aggressive, let the game come to me a little more tonight,\" he said. “The shots fell, the same shots I've been making all year.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit Houston on Friday.\n\n\r\n              Magic: Host New York on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995720.487854
}