{
  "game_id": "0021301071",
  "espn_id": "400489944",
  "date": "Mar 27, 2014",
  "matchup": "POR @ ATL",
  "headline": "LaMarcus Aldridge paces Blazers to victory over Hawks in return",
  "body": "ATLANTA -- Portland coach Terry Stotts and his staff were having an informal meeting in the hallway outside their locker room when LaMarcus Aldridge returned from a postgame TV interview.\nThe assistants greeted Aldridge with compliments and high fives. Stotts had only one word for his high-scoring forward: \"Thanks.\"\nAldridge had 25 points and 16 rebounds in his return after missing seven games with a lower back contusion, and the Trail Blazers beat the Atlanta Hawks 100-85 on Thursday night to end a three-game losing streak.\n\"It felt good to be back,\" Aldridge said. \"I didn't feel 100 percent but I did what I could do and luckily I made shots.\"\nDamian Lillard added 21 points for the Trail Blazers, who had lost seven of 10 and were in danger of falling out of the fifth spot in the Western Conference playoff standings.\nLillard said Aldridge, who posted his team-leading 37th double-double of the season, made the difference.\n\"We're a whole different team with him,\" Lillard said. \"He's our best player. He brings balance to our team. We had an inside presence and we were able to play inside-out, like we have all year. I just think with him out there we just got more quality shots.\n\"Having him back allows everybody to fall into place. The game just comes easier for everybody.\"\nAldridge said the win was \"very important, just for our mental psyche, our confidence ... the standings.\"\nThe Hawks have lost five straight. They lead the Knicks by only 1 1/2 games in the race for the eighth and final playoff spot in the Eastern Conference.\nJeff Teague, who was scoreless in Wednesday night's loss at Minnesota, led the Hawks with 22 points. Lou Williams had 16 points, including 13 in the final period when Atlanta closed the deficit to six points.\nAtlanta's Kyle Korver missed his fifth straight game because of back spasms and center Pero Antic sat out after he twisted his right ankle at Minnesota.\nThe Trail Blazers led 53-37 at halftime. The Hawks narrowly avoided their season low for points in the opening half.\nAtlanta opened the second half with a 15-5 run, capped by DeMarre Carroll's 3-pointer, to trim the lead to 58-52.\nWilliams had eight points in Atlanta's 10-0 run that again cut Portland's lead to six points at 80-74. A three-point play by Aldridge pushed the lead back to double digits at 87-76.\nKorver, the 3-point specialist, has not played since March 18, when Atlanta beat Toronto for its fifth straight win. The Hawks have not won since losing Korver.\nIt's only the latest in a string of ugly losing streaks for Atlanta the last two months. Atlanta has lost 19 of 25 and had streaks of eight and six straight losses in that span before the latest slump.\nHawks coach Mike Budenholzer said \"there were stretches where we really competed\" against the Trail Blazers.\n\"We cut some leads and got it to six at one point,\" Budenholzer said.\n\"The whole group, in trying times and trying circumstances, has given a lot. Jeff Teague's energy throughout the game allowed us to be close. We're finding ourselves. We need to be disciplined and focused. In those stretches where we're not, it can hurt us and it can bite us.\"\nPortland closed each of the first three periods with 3-pointers -- by Mo Williams, Wesley Matthews and Lillard. Officials needed a review to confirm there was time remaining in the first half when Matthews launched his long 3.\nNicolas Batum had 12 points for Portland and Robin Lopez and Matthews each had 11. Mo Williams had 11 assists and eight points.\nGame notes\nThe Trail Blazers, who beat Atlanta 102-78 in Portland on March 5, won their first season series over the Hawks since the 2007-08 season. ... Seattle Seahawks QB Russell Wilson attended the game. ... Elton Brand had 11 points and 12 rebounds as the fill-in starter for Antic... The Hawks' season low for first-half points was 34 against San Antonio on Jan. 24. ... The Hawks are 10-20 against the Western Conference.",
  "source": "espn_api",
  "crawled_at": 1764992936.942661
}