{
  "game_id": "0021500196",
  "espn_id": "400828083",
  "date": "Nov 22, 2015",
  "matchup": "TOR @ LAC",
  "headline": "DeRozan, Raptors beat Clippers 91-80",
  "body": "LOS ANGELES -- The Toronto Raptors shut down Blake Griffin and Chris Paul, and then had enough to hold off the Los Angeles Clippers at the very end.\nDeMar DeRozan had 21 points, DeMarre Carroll scored each of his 21 points in the first half, and the Raptors held Griffin and Paul scoreless through the first 20-plus minutes of a 91-80 victory over the Clippers on Sunday.\n\"We respect Griffin and Paul because they're All-Stars, but it's not the first time we've played them,\" center Bismack Biyombo said after making his first start of the season for the injured Jonas Valanciunas. \"Today our guards and our bigs did a pretty good job of taking them out of the game. We started the game the right way, and that helped.\"\nLuis Scola added 20 points and Kyle Lowry had 13 points and 10 assists for the Raptors (9-6), who closed out a 2/3 road trip. They shot just 37 percent from the field, but outrebounded the Clippers 46-42 and forced 19 turnovers.\nJ.J. Redick scored 17 points for Los Angeles (6-7), which has lost three straight and seven of nine after starting the season 4-0. The only other time the Clips were under .500 during Doc Rivers' two-plus seasons as coach was after his first game on the job, which they lost to the Lakers before winning their next three.\n\"We're pretty frustrated,\" Griffin said. \"It's been three in a row, so I think it's pretty normal to be frustrated. But we can't let that frustration affect us negatively, moving forward.\"\nThe Clippers, who blew a 23-point lead in a 124-117 home loss to the Warriors on Thursday, sliced a 29-point deficit against the Raptors to 73-67 with a 17-2 run capped by Austin Rivers' short jumper with 9:26 to play. But that was as close as they got.\n\"The hardest thing to do in the NBA is play with a big lead, because human nature says you're going to let down,\" Raptors coach Duane Casey said. \"You've got to come out in the third with the same energy, and that's very difficult to do in this league. It was a good win, and we'll take it, but we're not satisfied with it. We've got so much room for improvement on the offensive end.\"\nGriffin, who picked up three fouls in his first 10 1/2 minutes on the floor, scored his first points on a 20-footer 31 seconds into the third quarter. He finished with nine points and six rebounds.\nPaul recorded five of his 11 assists before getting his first field goal on his fifth attempt, a 21-footer with 3:36 left in the second period. Neither Paul nor Griffin made a trip to the free-throw line in the first half.\n\"We have to get off to better starts, and it starts with me,\" Paul said.\nBiyombo had 14 rebounds in 31 minutes in place of Valanciunas, who broke his left hand during Friday night's 102-91 win over the Lakers.\n\"Nothing changes. It's just going out there and doing my job,\" Biyombo said.\nValanciunas, averaging 9.3 rebounds through the team's first 14 games, has decided to rehab the injury instead of undergoing surgery. On Aug. 20, the 7-footer signed a four-year contract extension worth more than $15 million.\nCARROLL'S DAY\nCarroll was 8 for 8 in the first half to help the Raptors build a 63-34 lead. But he was 0 for 5 the rest of the way.\n\"When the ball moves, it finds the open man. And it was finding him in the first half,\" Casey said. \"He had some open looks. He's a good shooter, he works hard at it in practice.\"\nTIP-INS\nRaptors: Terrence Ross, who scored a career-high 51 points against the Clippers at Toronto on Jan. 25, 2014, played 16 scoreless minutes in this one. ... The Raptors missed their first nine shots in the fourth quarter. ... Lowry's steal with 7:43 left in the first quarter gave him at least one in each of the team's first 15 games, eclipsing his longest such streak at any point of a season. Lowry also has converted 38 consecutive free throws. ... Toronto was 4 for 17 from 3-point range after going 15 for 33 against the Lakers.\nClippers: Since Rivers became coach, the Clippers are 68-9 when allowing fewer than 100 points. . Griffin played 30 minutes. Since the start of the 2010-11 season, only two players in the league have played more total than he has -- Monta Ellis and LeBron James. ... DeAndre Jordan had 13 points and 15 rebounds.\nUP NEXT\nRaptors: Host Cleveland Wednesday night.\nClippers: At Denver Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994762.447582
}