{
  "game_id": "0022000911",
  "espn_id": "401307712",
  "date": "Apr 25, 2021",
  "matchup": "CHA vs. BOS",
  "headline": "Graham scores 24 as Hornets rout Celtics 125-104",
  "body": "CHARLOTTE, N.C. -- — When Hornets coach James Borrego talks to his players about how he wants them to play, he'll point back to Sunday's game.\n\n\r\n                    This win “set the standard,” Borrego said.\n\n\r\n                    Devonte Graham had 24 points and nine assists, P.J. Washington chipped in with 22 points and 12 rebounds and Charlotte had a season-high 39 assists to defeat the Boston Celtics 125-104.\n\n\r\n                    Terry Rozier had 21 points and 11 assists and Miles Bridges stayed hot with 20 points as the Hornets avenged a 30-point loss to the Celtics earlier this season and pulled within 1 1/2 games of Boston for the sixth spot in the East.\n\n\r\n                    “When we play this hard and together and unselfish, this is the result,” Borrego said. “This is what winning basketball looks like. This is Hornets basketball and this is what it has to look like for us.”\n\n\r\n                    The Hornets have been using a small ball lineup with Washington starting at center and it seems to be working, depending on the matchup. The team's five starters each had at least 13 points and combined for 33 assists.\n\n\r\n                    “It creates a lot of disadvantages for defenses,\" Rozier said. \"We have guys that can play all over the floor and that makes us very unpredictable.”\n\n\r\n                    Kemba Walker and Jaylen Brown had 20 points and Jayson Tatum added 19 points and 11 rebounds for Boston, which has dropped two straight games after winning seven of its previous eight. The Celtics were held to 38.6% shooting.\n\n\r\n                    “They didn’t let us get into any rhythm and they made shots,” Walker said. \n\n\r\n                    The Hornets came out by hitting 10 of 12 shots to start the game, including 6 of 7 from 3-point range to build a 26-12 lead.\n\n\r\n                    They never let up.\n\n\r\n                    Charlotte moved the ball well and finished with a season-high 39 assists while playing aggressive defense.\n\n\r\n                    Bridges beat the buzzer with a 40-foot pull-up jumper at the end of the third quarter.\n\n\r\n                    Graham connected on a behind-the-back pass to Washington for a dunk and Bridges came up with a ferocious block that led to Rozier's 3 at the other end helping extend Charlotte's lead to 17.\n\n\r\n                    After Graham knocked down an open 3 off a 4-on-1 Hornets fast break to push the lead to 20, Celtics coach Brad Stevens had seen enough and emptied his bench with 3:30 remaining.\n\n\r\n                    “They came out and smacked us,\" Brown said. \"We didn’t match their energy and the Hornets played extremely well. ... We weren’t as prepared as they were.”\n\n\r\n                    Borrego had written “be unselfish” on the whiteboard in the locker room before the game — and his team listened. The Hornets moved the ball around the perimeter quickly and the extra passes created plenty of open looks.\n\n\r\n                    “We played the right way from the beginning until the end,\" Graham said.\n\n\r\n                    “We had to be the more aggressive physical team for 48 minutes and today we were,” Borrego said. “It started at minute one and finished at minute 48.”\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Were outscored 46-36 in the paint. \n\n\r\n                    Hornets: Starters were a combined 12 of 18 from 3-point range in the first half. ... Hornets had 22 assists on 24 baskets in the first half. ... Shot 48.8% from 3-point range (21 of 43). ... Cody Martin had 13 points and 10 rebounds.\n\n\r\n                    WALKER'S SCARE\n\n\r\n                    The Celtics got a scare when Walker ran to the locker room midway though the second quarter after appearing to injure his left side as he came to a jump stop while closing out on a corner 3 by Rozier. He returned later in the quarter and finished the game, playing 30 minutes.\n\n\r\n                    “I felt some pain in my side, I can’t really explain it,” Walker said, adding that he hopes to be fine moving forward.\n\n\r\n                    WALKER GIVES A VISIT\n\n\r\n                    Walker became the Hornets' all-time leading scorer before he signed with the Celtics. But he maintains great relationships with the Hornets organization and spent time in their locker room after the game.\n\n\r\n                    “He's a great guy and great person to be around,” Graham said. “You heard fans cheering for him. He's a brother and that will never go away.”\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Host Thunder on Tuesday night.\n\n\r\n                    Hornets: Host Bucks on Tuesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997344.895367
}