{
  "game_id": "0022301217",
  "espn_id": "401616471",
  "date": "Dec 08, 2023",
  "matchup": "ORL vs. DET",
  "headline": "Magic send Pistons to 19th straight loss with 123-91 home victory",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 27 points, Paolo Banchero added 24 and the Orlando Magic handed the Detroit Pistons their 19th straight loss, 123-91 on Friday night.\n\n\r\n              Detroit is 2-20, with the losing streak the longest in one season in franchise history and second-longest overall behind a 21-game slide at the end of the 1979-80 season and start of 1980-81.\n\n\r\n              “We lost back to back games and it didn't feel good, so coming into this game we knew we had to take them seriously,” said Magic center Goga Bitadze, who had 13 points, eight rebounds and four blocks. “I think we did a good job of that tonight and we got the win.”\n\n\r\n              The streak is the longest in the NBA since Houston lost 20 straight in 2020-21. The Philadelphia 76ers hold both NBA records, setting the single-season mark at 26 in a row in 2013-14 and the overall mark at 28 at the end of 2014-15 and start of 2015-16.\n\n\r\n              Cade Cunningham led Detroit with 21 points, and Killian Hayes had 16 points and seven rebounds.\n\n\r\n              After making eight of their first 12 shots, the Pistons shot 26 for 69 (37.7%) for the rest of the game, failing to score 100 points for the first time this season.\n\n\r\n              “They're a good defensive team but we missed a lot of open shots,” Pistons coach Monty Williams said. “They take away the paint, force you to play outside. We generated only 30 threes and just didn't hit a good percentage (6 or 30). We just had a hard time putting the ball in the basket tonight.” \n\n\r\n              Cole Anthony added 16 points and six assists for the Magic. They shot 55.1% in winning for the 10th time in 12 games. \n\n\r\n              The Magic had a 14-0 run to take a 28-21 lead late in the first quarter. Gary Harris, starting for the injured Jalen Suggs, started the run with a steal and layup, and Joe Ingles finished it with a 3-pointer.\n\n\r\n              “I think that's what makes us a good team, that if somebody's out, the other guys can step up,” Wagner said. “Everybody stepped up and helped fill that void because Jalen is a big part of what we're doing. I thought Goga played with great energy and we need that.\"\n\n\r\n              Bitadze made six of seven shots and had a plus-minus of plus-26.\n\n\r\n              Wagner scored his first six points in a 10-0 spurt midway through the second quarter to help push Orlando's lead to 15. Detroit never got the margin under 13 in the second half.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Indiana on Monday night.\n\n\r\n              Magic: Host Cleveland on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995730.5713542
}