{
  "game_id": "0021900662",
  "espn_id": "401161304",
  "date": "Jan 22, 2020",
  "matchup": "HOU vs. DEN",
  "headline": "Westbrook, Harden lead Rockets past Nuggets, 121-105",
  "body": "HOUSTON --  Houston saw what potential it could achieve when Russell Westbrook, James Harden and Eric Gordon play well on the same night.\n\nWestbrook had 28 points, 16 rebounds and eight assists, Harden added 27 points and the Rockets snapped a four-game losing streak with a 121-105 victory over the short-handed Denver Nuggets on Wednesday night.\n\n\"If we can get everybody together like tonight -- you know, James has a good game, Eric has a good game and Russell has a good game,\" Rockets coach Mike D'Antoni said. \"If we get those three to have a good game, we're going to be tough; we're good. We've just struggled with that.\"\n\nWestbrook shot 11 of 25 from the field and had four steals. He just missed his second straight triple-double.\n\n\"We're playing our game,\" Westbrook said. \"We can't get discouraged one bit. . Tonight, we did a good job of playing our game defensively leading out, getting out on the break, attacking the basket, doing what we do.\"\n\nHarden scored 20 points in the first half. He shot 2 of 6 on 3-pointers after going 1 for 17 on 3s on Monday night against Oklahoma City.\n\nHarden connected on 13 of 15 from the free throw line. Houston shot 47%, including 13 of 29 on 3-pointers.\n\n\"The potential is always there,\" Harden said. \"It's just a matter of us doing it. Tonight, we played well. Obviously, they're missing a few of their players. It's a confidence builder, and we'll just try to do all the right things.\"\n\nGordon scored 25 points on 6-of-8 shooting on 3-pointers, and Clint Capela had 14 points and 11 rebounds to help Houston win its eighth straight against the Nuggets in Houston.\n\nNikola Jokic led the Nuggets -- down five players, including three starters -- with 19 points, 12 rebounds and 10 assists for his eighth triple-double of the season. Denver shot 46%, including 10 of 28 on 3-pointers.\n\nJerami Grant added 17 points and seven rebounds, and Torrey Craig had 14 points and seven rebounds.\n\n\"We missed bodies, but that's not an excuse,\" Jokic said. \"We need to go out there and compete and we did. We need to do a better job of rebounding. I need to do a better job of throwing the ball around, not having turnovers, just to lead the team a little bit better.\"\n\nDenver coach Michael Malone refused to use the injuries as an excuse for the loss, instead pointing to rebounding where Houston held a 53-40 advantage and had 18 offensive rebounds.\n\n\"To me, that's the one area, I don't care who's available, that has nothing to do with talent,\" Malone said. \"The guys that are shooting up and being called upon to play can go out there and rebound the basketball.\"\n\nHouston outscored the Nuggets 31-10 to take a 56-36 lead with 3 1/2 minutes left in the first half. The Rockets led 60-43 at the half. Denver never got closer than 13 in the second half.\n\nTIP INS\n\nNuggets: F Michael Porter Jr. missed the game with back tightness, and C Mason Plumlee was out of the lineup with a cuboid injury in his right foot. F Paul Millsap (sprained/bruised left knee) missed his eighth consecutive game. G Gary Harris (right adductor strain) was out for a fifth straight game, and G Jamal Murray (left ankle sprain) missed his fourth straight game. . PJ Dozier had 15 points, Monte Morris scored 11 points and Malik Beasley had 12 points.\n\nRockets: G Austin Rivers returned after missing the last two games with a right thumb sprain. He finished with 11 points and 3 of 4 on 3-pointers. . Westbrook was whistled for a technical foul to start the fourth quarter.\n\nD'ANTONI MOVES UP COACHING CHARTS\n\nD'Antoni earned his 200th win as the coach of the Rockets on Wednesday, joining Rudy Tomjanovich (503) and Bill Fitch (216) as the only other coaches in franchise history with 200 or more wins. D'Antoni also moved past Flip Saunders for 21st most wins in NBA history with 655.\n\nUP NEXT\n\nNuggets: At New Orleans on Friday night.\n\nRockets: At Minnesota on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764996632.674028
}