{
  "game_id": "0022400732",
  "espn_id": "401705298",
  "date": "Feb 06, 2025",
  "matchup": "SAC @ POR",
  "headline": "Simons has 30 and Blazers win sixth straight with 108-102 win over Kings",
  "body": "PORTLAND, Ore. -- — Anfernee Simons had 30 points, including eight 3-pointers, and the Portland Trail Blazers won their sixth straight game with a 108-102 victory over the Sacramento Kings on Thursday night. \n\n\r\n              Shaedon Sharpe added 24 points for the Blazers, who have won 10 of their last 11. \n\n\r\n              DeMar DeRozan had 22 for the Kings, who have lost six of their last eight. \n\n\r\n              It was close from the start. Sacramento pulled in front 91-90 on DeRozan's jumper and free throw with 6:36 left, but Sharpe answered with a 3-pointer that gave the Blazers back the lead for good.\n\n\r\n              Jonas Valanciunas made his Kings debut in the first quarter. The center was acquired in a trade Wednesday from the Washington Wizards. He finished with six points and five rebounds. \n\n\r\n              Neither team managed to lead by double digits. The game was tied at 27 after the first quarter and the Blazers had a 54-50 edge at the break. Zach LaVine, acquired by the Kings in a trade on Sunday, made a 3-pointer that gave the Kings a 60-58 lead in the third quarter. \n\n\r\n              Takeaways\r\n              Kings: The Kings added depth by adding Jake LaRavia from the Memphis Grizzlies at Thursday's deadline. ... Domantas Sabonis fouled out. \n\n\r\n              Trail Blazers: Portland did not make any moves before the deadline. “We’re always looking for ways to participate, use windows and find guys that can help us be better. But this time around, we just didn’t find the value,” Blazers GM Joe Cronin said. \n\n\r\n              Key Moment\r\n              Sharpe hit a 3-pointer that put Portland up 79-77 with 11.2 seconds left in the third quarter. Simons hit back-to-back 3-pointers to push Portland's lead to 85-79. \n\n\r\n              Key Stat\r\n              Two 3-pointers were overturned by the replay center during the game, one by Scoot Henderson in the first half and another by DeRozan in the second. \n\n\r\n              Up Next\r\n              Kings: Host New Orleans on Saturday. \n\n\r\n              Trail Blazers: Visit the Timberwolves on Saturday. \n\n\r\n              --------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997323.9183118
}