{
  "game_id": "0021801094",
  "espn_id": "401071767",
  "date": "Mar 23, 2019",
  "matchup": "SAC vs. PHX",
  "headline": "Hield sets franchise season record for 3s, Kings beat Suns",
  "body": "SACRAMENTO, Calif. --  Buddy Hield wasn't even supposed to be in Sacramento's lineup at the beginning of the season. Now he's one of the top 3-point shooters in the NBA, with a spot in the Kings' record book, as well.\n\nHield had 25 points and set the franchise season record for 3-pointers, and Sacramento beat the Phoenix Suns 112-103 on Saturday night.\n\nHield made 7 of 14 from beyond the arc, giving him 245 3-pointers this season. That surpassed the mark of 240 set by Peja Stojakovic in 2003-04 -- Stojakovic is now an assistant general manager with Sacramento.\n\n\"It feels good,\" said Hield, whose 43-percent 3-point clip ranks eighth in the NBA. \"My teammates found me in good spots. Some ones I had I wish I could get back but it's a part of the game. It was fun, man. Peja's been a big part of my success this year.\"\n\nHield's record-setting game came five nights after he went 0 for 8 from the perimeter. Hield came back with seven 3s against Dallas on Thursday and matched that against Phoenix.\n\n\"He's having a terrific year,\" Kings coach Dave Joerger said. \"A large part of our success has been his ability at different points in games where we're struggling to score, he can go create his own offense. Couldn't be happier for him.\"\n\nThe Kings made 17 3s overall. Harrison Barnes scored seven of his 25 points over the final three minutes, Nemanja Bjelica had 13 points and 17 rebounds, and De'Aaron Fox added 13 points and nine assists for Sacramento. Marvin Bagley III put up 16 points and 11 rebounds.\n\nDevin Booker scored 32 points and Deandre Ayton had 19 points and 11 rebounds for Phoenix.\n\nThe Suns led early after a 19-0 run in the first quarter but couldn't hold on.\n\n\"We've just got to sustain that lead and not get complacent,\" Booker said. \"When you have a 15-point lead, build on it. We didn't do that tonight.\"\n\nThe Kings (36-36) maintained their slim playoff hopes and pulled within 5  1/2 games of eighth-place San Antonio in the West. Sacramento has won three of four against Phoenix this season.\n\nThe Suns (17-57) trailed most of the game but pulled within 96-95 following two free throws by Troy Daniels. The Kings answered with two free throws and pulled away behind Barnes.\n\nAcquired from Dallas before the deadline, Barnes scored on a driving layup and later made a 3-pointer. After Hield scored on a layup, Phoenix scored twice before Barnes' emphatic dunk made it 107-101.\n\nBarnes later had an assist on Bagley's three-point play as Sacramento closed on a 12-6 run.\n\nPhoenix was without Kelly Oubre Jr. (left thumb sprain), Josh Jackson (right ankle sprain) and Tyler Johnson (sore right knee). T.J. Warren also missed his 25th straight game with right ankle soreness, leaving coach Igor Kokoskov with a depleted bench.\n\nThe short-handed Suns still got off to a fast start. Booker scored on a three-point play and a layup as part of a 19-0 run in the first quarter, flexing toward the crowd each time. Booker made back-to-back 3s then fed Ayton for a dunk.\n\nHield helped Sacramento get back into the game with his perimeter shooting. He made three 3s in the second quarter, including the record-setting shot.\n\nTIP-INS\n\nSuns: Ayton's double-double is his 37th this season, tying Alvan Adams' franchise rookie record set in 1975-76.\n\nKings: Harry Giles was held out because of a left thigh contusion.\n\nBACK IN THE NBA\n\nJimmer Fredette played four minutes and was 0-for-1 shooting for Phoenix in his return to the NBA after spending the past three seasons playing in the Chinese Basketball Association. Fredette was the 10th overall pick in the 2011 draft and played for four teams over five seasons.\n\n\"I was just excited to get back out there and try to help the team in any way that I can,\" Fredette said. \"It's the end of the season, but it's my job to come in and try to keep these guys positive. Be that veteran guy, be aggressive, and do what I do out on the floor.\"\n\nUP NEXT\n\nSuns: Play at Utah on Monday.\n\nKings: Play the Lakers in Los Angeles on Sunday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994166.139636
}