{
  "game_id": "0021600189",
  "espn_id": "400899639",
  "date": "Nov 19, 2016",
  "matchup": "PHX @ PHI",
  "headline": "Embiid scores career-high 26 as Sixers rout Suns 120-105",
  "body": "PHILADELPHIA --  Up until the start of Saturday's game, it seemed unlikely that Joel Embiid would play at all.\n\nHe ended up having the best game of his short NBA career.\n\nFighting through a sprained left ankle, Embiid scored a career-high 26 points in 20 minutes, and the Philadelphia 76ers routed the Phoenix Suns 120-105 for their most convincing win of the season.\n\n\"I felt great,\" Embiid said. \"When you play, you don't really pay attention to those kind of things. During the game, I was fine. Even now, it's fine.\"\n\nNik Stauskas added a season-high 21 points on 8-for-9 shooting for the Sixers, who have split their last six games after starting the season with seven straight losses. Sergio Rodriguez had eight points, 11 assists and eight rebounds.\n\nEric Bledsoe led Phoenix (4-10) with 27 points. The Suns have lost three of their first four on their six-game road trip.\n\n\"You give any team confidence at home and they can get rolling,\" Suns coach Earl Watson said. \"They have a lot of confidence here. The crowd was energetic and Embiid in limited minutes was more than effective.\"\n\nEmbiid was 3 for 5 from 3-point range and 9 for 14 from the field overall. He also grabbed seven rebounds and blocked two shots, including a ferocious one on Devin Booker in the second quarter that got the crowd roaring.\n\nThe 7-foot-2 center, playing in just his ninth NBA game after a pair of foot surgeries sidelined him for his first two seasons, reached his career high on a jumper with 8:30 left.\n\nAfter a three-point play from Bledsoe got Phoenix within six midway through the third quarter, the Sixers reeled off a 10-0 run to open an 82-66 lead. They led by double figures the rest of the way against a banged-up Phoenix team playing the second end of a back-to-back.\n\n\"We got stops, we made some shots and we took off again,\" Sixers coach Brett Brown said.\n\nEmbiid and Booker were game-time decisions due to sprained ankles. Each of them started and Embiid, hurt two nights earlier, jumped all over the Suns, scoring Philly's first eight points and 10 in the first three minutes, including a pair of 3-pointers.\n\nLater in the first quarter, Embiid had eight points in a 10-0 run that helped Philadelphia to a 31-17 advantage, capping the spurt with his third 3 from the top of the key.\n\n\"That's what makes him so tough to stop,\" Stauskas said. \"Obviously he's a dominant force down low but sometimes the bigs aren't willing to step up to the line to guard him. And he's making people pay right now with that top-of-the-key 3-pointer.\"\n\nBooker finished with 10 points on 4-for-13 shooting.\n\nTIP-INS\n\nSuns: The Suns were without T.J. Warren (illness) and Tyson Chandler (mother's funeral). ... Phoenix recalled rookie forward Derrick Jones Jr. from D-League affiliate Northern Arizona before the game.\n\n76ers: After shooting 1 for 5 from the field, slumping sharpshooter Robert Covington has missed 27 of his last 31 shots, leading to plenty of boos from the crowd. ... The Sixers have won three straight at home, but dropped their last 21 on the road -two away from matching a franchise record.\n\nTHE EMBIID PROCESS\n\nEmbiid, who already has missed four games this season as the Sixers slowly ease him back, was limited to 24 minutes or less. Jahlil Okafor, who platoons with him at center, was under the same minutes restriction because of knee surgery last season.\n\n\"I hope to play those two together,\" Brown said. \"With the minutes restriction, it's kind of impossible right now.\"\n\nBOOKER GUTS IT OUT\n\nWatson said Booker \"struggled\" after returning from his own ankle injury. But the Suns coach was impressed that the second-year rising star was able to play at all.\n\n\"He gave us all he had,\" Watson said. \"He knew he wanted to play because we didn't have T.J. He sacrificed his body. That's just the type of person he is. You could see he could barely move.\"\n\nBOMBS AWAY\n\nThe Sixers matched a franchise record with 17 3-pointers.\n\nUP NEXT\n\nSuns: Visit Washington on Monday.\n\n76ers: Host Miami on Monday night. The Heat have won five straight against Philadelphia.",
  "source": "espn_api",
  "crawled_at": 1764996003.7235909
}