{
  "game_id": "0021800624",
  "espn_id": "401071300",
  "date": "Jan 11, 2019",
  "matchup": "TOR vs. BKN",
  "headline": "Leonard has 20 points, 11 rebounds, Raptors top Nets 122-105",
  "body": "TORONTO --  The Brooklyn Nets needed one more victory to match their best stretch in four years.\n\nInstead, they stumbled in Toronto -- again.\n\nKawhi Leonard had 20 points and 11 rebounds, Pascal Siakam scored 16 points and the Raptors beat the Nets 122-105 on Friday night for their second seven-game home winning streak of the season.\n\n\"I rarely say this about our team, but I didn't love the effort tonight,\" Nets coach Kenny Atkinson said. \"To beat an elite team on the road, our effort and execution was nowhere near where it needed to be. I think we got dominated all around.\"\n\nBrooklyn entered with 13 wins in their previous 17 games, a run that began with a 106-105 overtime victory over Toronto on Dec. 7. The Nets last won 14 of 18 in the 2013-14 season.\n\nToronto has won 13 of the past 14 meetings with the Nets, including seven straight north of the border. Brooklyn hasn't won in Toronto since Feb. 4, 2015.\n\n\"We've made strides but we have a long way to go,\" Atkinson said. \"This is a little bit of a humble pie, going up against an elite team like this.\"\n\nBrooklyn's past four losses have all been double-digit defeats.\n\nSerge Ibaka added 14 points, OG Anunoby and Norman Powell each had 13, Delon Wright had 12 to help Toronto improve to 18-4 at home. They last lost at home Dec. 9 to Milwaukee.\n\nToronto set a season high with 105 shots and had 32 assists on 48 baskets. The Raptors are 8-0 when they have 30 or more assists.\n\n\"It's what we're looking for, a total team effort,\" said guard Fred VanVleet, one of five Toronto reserves to score at least 10 points. The Raptors finished with 60 bench points, two shy of a season-high.\n\nToronto has won four straight overall and six of seven. Its only loss in that span was Jan. 3 at San Antonio.\n\n\"They capitalized on our turnovers, they capitalized on our missed shots,\" said Brooklyn guard D'Angelo Russell, who led the Nets with 24 points.\n\nShabazz Napier added 15 points for Brooklyn, and Jarrett Allen had 12 rebounds.\n\nLeonard was working out following the game and did not speak to reporters.\n\nRussell scored 12 points in the first and the Nets closed the quarter with a 14-3 run to lead 35-28 after one. It was Brooklyn's highest-scoring first quarter on the road this season.\n\nToronto turned the tables in the second, overcoming a one-point deficit by outscoring Brooklyn 15-3 over the final 2:55. The Raptors outscored the Nets 36-18 in the second and led 64-53 at halftime.\n\n\"The rest of the game they dominated us, basically,\" Atkinson said.\n\nSiakam scored nine points and Ibaka had eight as the Raptors pulled away in the third, connecting on 16 of 32 shots. Toronto took a 99-75 lead into the fourth.\n\nTIP-INS\n\nNets: Russell had six rebounds in the first, the most he's ever had in a quarter. ... Russell finished with nine assists. ... Napier extended his streak of games with at least 10 points to a career-high eight. ... F Jared Dudley was inactive. Dudley left Wednesday's win over Atlanta because of a sore left hamstring. ... F/C Alan Williams made his Brooklyn debut after signing with the Nets earlier Friday. ... The Nets have lost two straight on the road.\n\nRaptors: G Patrick McCaw was inactive after signed with Toronto on Thursday. ..  Kyle Lowry led Toronto with eight assists. ... Toronto outscored Brooklyn 35-10 on fast-break points.\n\nACCORDING TO PLAN?\n\nBrooklyn's first basket of the game came when Allen's missed dunk rebounded all the way to a wide-open Russell, who made a 3-pointer.\n\nSTREAKING\n\nLeonard reached 20 points for the 18th consecutive game, extending his career-best streak.\n\nFIVE SPOT\n\nThis was the second time the Raptors have had five bench players score 10 or more points. Toronto also did it against the Knicks on Feb. 8, 2018.\n\nUP NEXT\n\nNets: Host Boston on Monday night.\n\nRaptors: At Washington on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994110.619427
}