{
  "game_id": "0021500827",
  "espn_id": "400828714",
  "date": "Feb 21, 2016",
  "matchup": "CHA @ BKN",
  "headline": "Walker, Jefferson help Hornets run win streak to 5",
  "body": "NEW YORK --  The Charlotte Hornets have finally figured out the road, though Kemba Walker has long known about winning in New York.\n\nWalker scored 28 points, Al Jefferson added 18 in his second game back from right knee surgery, and the Hornets extended their winning streak to a season-high five games with a 104-96 victory over the Brooklyn Nets on Sunday night.\n\nWalker scored 12 points in the third quarter and then heated up again when the Nets cut the lead to 95-91. The Bronx native drove for a layup with about 4 1/2 minutes left and his 3-pointer with 1:46 to play essentially put it away at 102-91.\n\n\"The bigger the stage obviously, right? From the time I think he's been a young kid ... from Rice (High School) to obviously UConn to here, and I just think the bigger the game, but I think he likes to come home,\" Hornets coach Steve Clifford said.\n\nThe Hornets also posted a season-best fourth straight win on the road, a winning streak they will bring to Eastern Conference-leading Cleveland on Wednesday.\n\nCharlotte was just 6-17 away from home before this road run.\n\n\"We're just very conscious of it now, we know that we have to play better on the road and that's what we're trying to do,\" Walker said.\n\nNicolas Batum had 16 points, eight assists and seven rebounds for Charlotte, which improved to 6-1 in February and is up to seventh place in the Eastern Conference.\n\n\"The only thing about the NBA, though, win or lose, that moment only can last for a short period of time because you've got to get ready for the next game,\" Jefferson said. \"It's a great feeling as of right now, we're playing well, especially winning games on the road, but we've still got a long road trip to go.\"\n\nCharlotte's Jeremy Lin scored 11 points, and Marvin Williams had nine points and 12 rebounds.\n\nJoe Johnson scored 17 points for the Nets in their final game before a nine-game road trip. Brook Lopez had 16 points, including his first 3-pointer to beat the third-quarter buzzer. He added 10 rebounds and six assists, his most in a game in nearly six years.\n\nJefferson came off the bench to make his first five shots and finished 9 for 13 with seven rebounds. He missed 23 games before returning for Charlotte's 98-95 win at Milwaukee on Friday.\n\nCourtney Lee started and scored five points for the Hornets in his first game after being acquired from Memphis before the trade deadline.\n\nThe Hornets opened a 15-point lead in the second quarter while holding the Nets to a lengthy drought without a field goal, but Brooklyn got it down to 55-48 by halftime.\n\nWalker then made 5 of 6 shots in the third as Charlotte opened its biggest lead at 86-70 on the play before Lopez's desperation 3-pointer.\n\nTIP-INS\n\nHornets: With 10 3-pointers, the Hornets have 569 this season and moved past the 560 they hit in 1994-95 and into third place in team history. Their single-season record is 591 in 1996-97 and they made 584 the previous season. Charlotte came in averaging 10.4 3s per game, trailing just Golden State (12.9) and Houston (10.9). ... F/C Spencer Hawes missed his second straight game with a sore lower back and Clifford said he could be out a while so as to avoid any setbacks.\n\nNets: Charlotte was the last Eastern Conference team to visit Brooklyn this season. The only other NBA club the Nets haven't hosted this season is New Orleans.\n\nBYE, BARCLAYS\n\nThe Nets start their trip with a game Tuesday in Portland and don't play back at home again until hosting Milwaukee on March 13, as they yield Barclays Center to the circus and the Atlantic 10 Conference tournament.\n\n\"We're definitely going to have to stick together being on the road so long and just take it a game at a time,\" Lopez said.\n\nLOPEZ NOTES\n\nLopez hadn't had six assists since a seven-assist game against Milwaukee on April 7, 2010. His 3-pointer was only his second in a regular-season game, to go with one in the 2013 playoffs.\n\nUP NEXT\n\nHornets: Visit Cleveland on Wednesday.\n\nNets: Visit Portland on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994369.901495
}