{
  "game_id": "0022201136",
  "espn_id": "401469291",
  "date": "Mar 29, 2023",
  "matchup": "MIL @ IND",
  "headline": "Holiday has career-high 51 points, Bucks beat Pacers 149-136",
  "body": "INDIANAPOLIS -- — Jrue Holiday scored a career-high 51 points, Giannis Antetokounmpo had 38 points in a triple-double and the NBA-leading Milwaukee Bucks beat the Indiana Pacers 149-136 on Wednesday night.\n\n\r\n              “Obviously, I'm happy about it,” Holiday said. “It took me 14 years to get 50 points. It came in a game that we needed to win, so I couldn't be happier.”\n\n\r\n              Antetokounmpo added 17 rebounds and 12 assists to help the Bucks improve to 55-21. The two-time NBA MVP was an assist shy of a triple-double at halftime with 20 points, 10 rebounds and nine assists. He returned after sitting out Monday night in a victory at Detroit because of a sore knee.\n\n\r\n              “It's hard to come up with the superlatives to describe them,” Bucks coach Mike Budenholzer said of his top scorers. “They were phenomenal. Giannis set the tone with his aggressive attacking. Then Jrue for the whole game to have 51, that's hard to do in an NBA game.”\n\n\r\n              Holiday had 18 points in the third quarter, when the Bucks scored a season-high 46 points to build a 12-point lead. He was 20 of 30 from the field with three 3-pointers and hit 8 of 10 free throws. His previous best was 40 points in an overtime victory over visiting Boston on Feb. 14.\n\n\r\n              “Together with Giannis with 38, those two guys were special, they put us on their backs,” Budenholzer said.\n\n\r\n              The 6-foot-5 Holiday scored 30 points in the paint.\n\n\r\n              “I felt like Giannis,” Holiday said with a smile. “No dunks though.”\n\n\r\n              Brook Lopez added 21 points for the Bucks. \n\n\r\n              Rookie Bennedict Mathurin led Indiana — playing without its top three scorers — with 29 points. Aaron Nesmith had 22 and Jordan Nwora 18. Jalen Smith fouled out early in the fourth with 17. Rookie Andrew Nembhard had 15 points and 15 rebounds.\n\n\r\n              “It starts with Giannis, one of the best players in the world,” said Nwora, acquired from the Bucks on Feb. 9. “It's always tough playing a guy like him who is so different. You have to really lock into him. Then other guys get going, Jrue comes in and gets 51. It's tough to beat them on a night like that.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Forward Khris Middleton (knee) was inactive. He's averaging 15.5 points. ... Averaged 136.2 points in winning season series 3-1.\n\n\r\n              Pacers: Five inactives included All-Star point guard and leading scorer Tyrese Haliburton (ankle/elbow), center and second-leading scorer Myles Turner (back), and guard Buddy Hield (illness), the NBA's 3-point leader.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Boston on Thursday night.\n\n\r\n              Pacers: Host Oklahoma City on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports\n\n\r\n              ------ More AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994551.5181398
}