{
  "game_id": "0021700612",
  "espn_id": "400975358",
  "date": "Jan 10, 2018",
  "matchup": "ATL @ DEN",
  "headline": "Schroder, Hawks beat Nuggets 110-97, snap 10-game road skid",
  "body": "DENVER --  The Atlanta Hawks were savoring a rare win during a tough season. The Denver Nuggets were lamenting a missed opportunity to improve their postseason hopes.\n\nDennis Schroder had 19 points and 10 assists, Taurean Prince scored 16 and the Hawks beat Denver 110-97 on Wednesday night, ending a 10-game road losing streak.\n\nAtlanta wrapped up a five-game trip with its first road win since Dec. 2 at Brooklyn.\n\n\"It feels good to win a game -- period,\" guard Malcolm Delaney said. \"We've been battling. It's been tough for us, losing a lot of close games. Just to pull one out and finish how we did feels pretty good.\"\n\nKent Bazemore scored 14 points and Ersan Ilyasova had 10 points and nine rebounds for the Hawks, who never trailed after the first quarter.\n\nAtlanta (11-30) has the worst record in the NBA and entered the night tied for the fewest road wins. The Hawks posted their fourth road victory this season.\n\nDenver had won 11 of 13 home games since early November and now has its first three-game losing streak of the season.\n\n\"I'm not going to use the word embarrassing because that would be disrespectful to Atlanta. You've got to give them credit,\" Nuggets coach Michael Malone said. \"They came in here and beat us. But for us to come out with the lack of energy, lack of a sense of urgency, was really disappointing. At the end of the day I put this loss on me.\"\n\nThe Hawks had twice lost by one point during their Western Conference swing. They closed out this win by outscoring Denver 28-19 in the fourth quarter, forcing five turnovers in the period.\n\nGary Harris had 25 points but was the only Denver player to shoot well from the field. Nikola Jokic had nine points, 12 rebounds and seven assists but was 4-of-21 shooting and missed all eight of his 3-pointers.\n\n\"It was probably just a little bit of one of those nights for him,\" Atlanta coach Mike Budenholzer said. \"He's normally going to make a few more of those shots, so he had a little bit of an off night.\"\n\nDenver trailed by 10 in the third and got within two late in the period but missed its first six shots of the fourth. The Hawks extended the lead to 93-81 on a layup and jumper by Delaney. He also assisted on Ilyasova's 3-ponter that sparked an 11-3 run to start the fourth.\n\nThe Nuggets made a small run to get within eight but Atlanta responded with a 9-2 surge to lead 102-87 with 3:29 left. Denver never got closer than nine the rest of the way.\n\nThe loss dropped the Nuggets to 21-20.\n\n\"It's not about them, it's about us,\" Harris said. \"We know what we've got to do. If we come out there and play hard, that doesn't happen.\"\n\nDenver shot just 6 of 24 on 3-pointers in the first half and 37.3 percent from the field overall. Atlanta took advantage and led by as many as 10 and 54-46 at halftime.\n\nTIP-INS\n\nHawks: Schroder has 3,994 career points. ... Prince, who came in second on the team in scoring at 13 points per game, has not scored 20 in consecutive games. ... Atlanta had six players score in double figures and two more finish with nine points.\n\nNuggets: Denver finished 9 of 37 from 3-point range. ... F Paul Millsap had the cast removed from his left wrist. Millsap had surgery in November to repair ligament damage in the joint, and Malone said the target date for his return is \"right around the All-Star break. It could be a while after that. Who knows?\" ... Denver Broncos LB and Super Bowl MVP Von Miller sat near center court.\n\n200 AND COUNTING\n\nThe win was Budenholzer's 200th as a head coach -- all with Atlanta. He led the Hawks to the postseason in each of his first four seasons but they appear headed to the lottery this year.\n\nThat hasn't diminished his enjoyment.\n\n\"I feel very fortunate to have had a lot of great players, including this group,\" he said. \"I love coaching them, and very fortunate to be where I am. Hopefully there's a lot more to come.\"\n\nUP NEXT\n\nHawks: Host the Brooklyn Nets on Friday night.\n\nNuggets: Host the Memphis Grizzlies on Friday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993762.4195058
}