{
  "game_id": "0021601198",
  "espn_id": "400900576",
  "date": "Apr 09, 2017",
  "matchup": "OKC @ DEN",
  "headline": "Westbrook sets triple-double record, Thunder beat Nuggets",
  "body": "DENVER --  First, Russell Westbrook broke Oscar Robertson's record for most triple-doubles in a season. Then, he broke the Denver Nuggets' hearts.\n\nWestbrook's 36-foot dagger at the buzzer gave Oklahoma City a 106-105 victory, eliminating the Nuggets from playoff contention and capping an historic Sunday afternoon in which he scored 50 points to go with 16 rebounds and 10 assists.\n\nWestbrook's 42nd triple-double is one more than the \"Big O\" had for the Cincinnati Royals in 1961-62, a mark that many in the NBA had considered unbreakable until Westbrook's incredible run.\n\nThe crowd gave Westbrook a standing ovation after he broke Robertson's record with his 10th assist with 4:17 remaining.\n\nThen, those same fans stood in stunned silence after watching Westbrook score his team's final 15 points, including the game-winner after Steven Adams took the inbounds pass from Kyle Single with 2.9 seconds left and dished to Westbrook, whose long jumper ringed through the iron as the horn sounded.\n\n\"It was a good defense,\" lamented Nuggets guard Gary Harris. \"He's had a hell of a season. I think he might have just locked up the MVP with that one right there.\"\n\nWestbrook insisted his buzzer beater wasn't a low-percentage prayer.\n\n\"I practice that shot everyday pregame,\" he said.\n\nSame spot. And, he said, usually the same result.\n\n\"So, I definitely feel confident in shooting that shot,\" he said.\n\nDO-IT-YOURSELF\n\nWestbrook had a double-double by halftime but didn't get his triple-double until feeding Semaj Christon in the right corner for a 3-pointer that pulled the Thunder to 101-91 with more than four minutes left.\n\nWith his 10th assist and his record in the books -- after four tries at that final assist -- Westbrook took care of the scoring himself the rest of the way.\n\nHe followed a pair of layups with six free throws -- half of them coming after Nikola Jokic was whistled for a flagrant foul and a technical -- then added another layup.\n\n\"It was like a video game,\" Christon said. \"I loved watching it.\"\n\nWestbrook's biggest bucket was his last.\n\n\"Pure adrenaline, emotions running high, game-winning shot, it is something you dream about as a little kid to be able to do that on the road especially from that distance,\" Westbrook said. \"It is something you definitely will never forget.\"\n\nTAKING OVER\n\nWestbrook scored the game's final eight points overall as Denver's shooters went cold when one more bucket would have iced it.\n\n\"I give him credit, he is a hell of a player and an MVP candidate,\" Nuggets coach Michael Malone said. \"(But) I really feel that we lost this game. Our turnovers in the fourth quarter, we had six turnovers for 10 points. Down the stretch, we had a lack of poise, lack of execution, we picked up a technical foul. Everything that could go wrong went wrong.\"\n\nHOT AND COLD\n\nDanilo Gallinari scored 22 of his season-high 34 points in the third quarter to lead the Nuggets, who were hoping to take the race with Portland for the final Western Conference playoff spot down to the final two games.\n\nBut Gallo didn't score at all in the fourth quarter, when the Nuggets managed just 14 points.\n\nWAIT FOR IT\n\nWestbrook nearly had his 10th assist with two minutes left in the third quarter but Enes Kanter lost the handle going up for the basket and Westbrook took a seat until the fourth quarter.\n\nUpon his return, Westbrook again fed Kanter, who took several steps on his way to the basket and was whistled for traveling with 8:20 left.\n\nWith the crowd again on its feet anticipating history, Westbrook passed to Domatas Sabonis, whose jumper rimmed out at 7:16. Sabonis missed another short jumper with 5:39 left that would have given Westbrook the record.\n\nFinally, Westbrook fed Christon for the 3-pointer to put Roberton's record to rest.\n\n\"He always tells us, if you're open, shoot the ball,\" Christon said of Westbrook. \"I was open and let it go.\"\n\nTIP-INS\n\nThunder: Westbrook's three career 50-point triple-doubles all came this season and are the most by any player in NBA history. ... F Doug McDermott was a late scratch with a sore left knee. ... Coach Billy Donovan said it'll be up to Westbrook if he wants to rest during one or both of the Thunder's final two games.\n\nNuggets: Denver, which has lost nine straight to the Thunder, was without F Kenneth Faried (back) and G Jameer Nelson (right calf).\n\nUP NEXT\n\nThunder: Wrap up their four-game trip at Minnesota on Tuesday night before finishing regular season against Denver at home.\n\nNuggets: Visit Dallas Tuesday on the first night of a back-to-back to end their season.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton",
  "source": "espn_api",
  "crawled_at": 1764995240.3290508
}