{
  "game_id": "0021900026",
  "espn_id": "401160668",
  "date": "Oct 26, 2019",
  "matchup": "MIL vs. MIA",
  "headline": "Heat spoil Bucks' home opener, rally to 131-126 win in OT",
  "body": "MILWAUKEE --  The Milwaukee Bucks had a 21-point lead in the third quarter at home and lost. That's not what good teams do, and Giannis Antetokounmpo knows it.\n\nGoran Dragic scored 25 points off the bench, Bam Adebayo added 19 points and 13 rebounds, and the Miami Heat rallied to beat Antetokounmpo and the Bucks in overtime 131-126 on Saturday night.\n\nAntetokounmpo finished with 29 points, 17 rebounds and nine assists, but last season's MVP also had eight turnovers and fouled out with 2:31 to play in overtime. Antetokounmpo also fouled out Thursday night in Houston.\n\n\"Obviously, we've got to learn from tonight's game,\" Antetokounmpo said. \"We were up 21 and we allowed them to come back into the game. We cannot let that happen. Good teams don't let that happen. Definitely, we're going to learn from this.\"\n\nAfter trailing 74-53 with less than 11:00 to play in the third quarter, the Heat outscored Milwaukee 78-52 the rest of the way, including 49-33 in the fourth quarter and overtime.\n\n\"A tremendous amount of perseverance and guts,\" said Heat coach Erik Spoelstra. \"Our guys made some really big-time plays in the second half. Our level of intensity, urgency went up. If you are going to try to beat one of these teams on their home floor, you are going to have to play a lot harder than we did in the first half. It was one inspiring play after another.\"\n\nDuncan Robinson hit a 3-pointer for the Heat to tie the game at 105 with 7:00 to play in regulation. Dragic then added a pair of free throws to give Miami its first lead since 2-0.\n\nKelly Olynyk, who had 14 points off the bench, hit back-to-back 3-pointers to put the Heat ahead 113-107 with 4:52 to play.\n\nWith Miami up 121-119 with 3 seconds to go in regulation, Khris Middleton shot an air ball and Antetokounmpo tipped it in at the buzzer to send the game into overtime.\n\nAdebayo sank four free throws in the extra period and Dragic scored six points in overtime to lift Miami to its second win.\n\n\"We were down and we never quit,\" Dragic said. \"We fought back. We could make our job a little bit easier if we hit all those free throws. But in the end, a great comeback. When Giannis hit that layup (at the horn), a lot of teams in this league would just quit and we didn't. I'm proud of the guys.\"\n\nKendrick Nun scored 18 points before fouling out for the Heat, who had seven players score in double figures. Justise Winslow had 10 points, 13 rebounds and seven assists, and Miami rookie Tyler Herro, a Milwaukee native, finished with 14.\n\n\"I didn't really know what to expect, but I was happy to hear the crowd cheer for me,\" Herro said.\n\nMiddleton added 25 points for the Bucks.\n\nHeat guard Jimmy Butler missed his second straight game after he and his girlfriend welcomed a baby on Wednesday.\n\nThe Bucks hit 14 3-pointers in the first half -- the most the Heat have ever allowed in a first half -- en route to building a 70-53 lead at halftime. Milwaukee finished 17-for-54 from beyond the arc.\n\n\"Sometimes you're going to go 2-for-24 but if you don't allow 39 points in the fourth quarter, you probably have a decent chance to be on the other side of the score,\" Bucks coach Mike Budenholzer said. \"The offense definitely needs to be better, but 39 is the number that stands out to me.\n\nTIP-INS\n\nHeat: Derrick Jones left the game with a left groin strain.\n\nBucks: Antetokounmpo came one assist shy of becoming the fourth player in NBA history to record a triple-double in consecutive games to start a season (Magic Johnson in 1981 and '82, Jerry Lucas in '72 and Oscar Robertson in '61).\n\nUP NEXT\n\nHeat: Play at the Timberwolves on Sunday.\n\nBucks: Host the Cavaliers on Monday.\n\n---\n\nFollow Keith Jenkins on Twitter: https://twitter.com/MrKeithJenkins\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-NBA",
  "source": "espn_api",
  "crawled_at": 1764996188.491225
}