{
  "game_id": "0022301017",
  "espn_id": "401585645",
  "date": "Mar 22, 2024",
  "matchup": "LAC @ POR",
  "headline": "Clippers sweep 2-game set in Portland, beating the Trail Blazers 125-117",
  "body": "PORTLAND, Ore. -- — Paul George scored 31 points, Kawhi Leonard had 22 and the Los Angeles Clippers swept a two-game set in Portland, beating the Trail Blazers 125-117 on Friday night.\n\n\r\n              At 44-25, the Clippers have a 1 1/2-game lead over New Orleans for the fourth seed in the Western Conference playoff race.\n\n\r\n              “We’re not looking at them,” George said about the Pelicans. “It’s more about us. We’ve got to play well and we’re in the driver’s seat. So it’s more about us.”\n\n\r\n              Scoot Henderson had 24 points and 10 assists for Portland in its fifth straight loss. The Trail Blazers were without starting center Deandre Ayton and lost scoring leader Anfernee Simons midway through the third quarter because of a left knee injury.\n\n\r\n              Portland coach Chauncey Billups said there was “no update” on Simons after the game.\n\n\r\n              The Clippers shot 42% from 3-point range and were 56% overall. George was 10 of 14 from the field, and Leonard 9 of 15.\n\n\r\n              “When you play a team like that, they’re going to hit shots,” Henderson said. “You’ve just got to deal with it, move onto the next play and you’ve got to match that and try to get a stop again. If they keep hitting shots, it just is what it is. You’ve got to deal with it.”\n\n\r\n              Los Angeles’ largest lead was 26 points, with Leonard and George sitting out the fourth quarter.\n\n\r\n              “I just want us to lock in and be healthy,” Clippers coach Tyronn Lue said. “The West is tough anyway, no matter who we play or where you play. Whether you start at home, start on the road, it’s going to be tough. So it doesn’t really bother me or phase me in any way. We’ve just got to be healthy.” \n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Philadelphia on Sunday.\n\n\r\n              Trail Blazers: Host Denver on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996540.039859
}