{
  "game_id": "0021800539",
  "espn_id": "401071215",
  "date": "Dec 30, 2018",
  "matchup": "OKC @ DAL",
  "headline": "Doncic, Smith key Mavs' late surge to beat Thunder 105-103",
  "body": "DALLAS --  Dennis Smith Jr. was coming off a last-second gaffe in a Dallas loss when the second-year guard came through with two critical plays in a win over Oklahoma City: one at each end of the court.\n\nThe 21-year-old hit the go-ahead layup before defending on a miss by Paul George , and the Dallas Mavericks surged past the Thunder late in a 105-103 victory Sunday night.\n\nSmith's key moments came two nights after he failed to get a shot off before the buzzer -- and missed it anyway -- in a 114-112 loss at New Orleans. It was his first game back after missing 11 with a sprained right wrist.\n\nThe loss to the Pelicans was the second of two straight games against them, with Dallas winning the first. Now the Mavericks will play two in a row against the Thunder, this time in a back-to-back at Oklahoma City on Monday night.\n\n\"I am just trying to earn my respect in this league,\" said Smith, who scored 14 points while backcourt mate and 19-year-old rookie sensation Luka Doncic led Dallas with 25 points.\n\nGeorge scored the last 13 points for Oklahoma City and finished with 36, but he missed the pull-up jumper with Smith defending with 2 seconds left.\n\nThe Thunder still had a chance with 1.7 seconds left, but Russell Westbrook missed a corner 3-pointer at the buzzer to wrap up a rough shooting night for the 2017 MVP. He was 4 of 22 for nine points with nine rebounds and eight assists.\n\nIt was the first time since April 12, 2017, that Westbrook didn't finish in double figures in at least one of those three categories.\n\n\"We got lucky because he had an off shooting night,\" Dallas coach Rick Carlisle said. \"And knowing him, I'm not looking forward to tomorrow night.\"\n\nThe Thunder led by as many as six in the final two minutes fueled by a pair of 3s from George, but the Mavericks chipped away thanks to missed shots and turnovers by Oklahoma City.\n\nSmith's layup for a 104-103 lead came after he dribbled away from the basket and reversed course to the hoop, easily speeding past Dennis Schroder and hitting the shot over a leaping Westbrook.\n\n\"I think there were some times where we did a great job defensively, and obviously there were some other times we broke down,\" Thunder coach Billy Donovan said.\n\nDeAndre Jordan, who had 12 points and 17 rebounds, pulled Dallas to 101-99 with a thunderous dunk. The Thunder turned it over but Westbrook knocked away Harrison Barnes' pass to Doncic. Trailing the play, Jordan grabbed the loose ball and dunked without taking a dribble.\n\nGeorge was 12 of 24 from the field but just 3 of 11 from 3 as the Thunder shot 24 percent from beyond the arc. Westbrook missed all eight of his attempts from long range.\n\nThe Mavericks took their first 10-point lead on a 3 from Doncic while the Thunder went without a field goal for more than six minutes to start the third quarter. The lead reached 13 in the final minute of the third on a 3 from J.J. Barea.\n\nThe Dallas lead was gone less than four minutes into the fourth quarter, with Oklahoma City getting even at 86 on a floater from Schroder, who scored 19 points.\n\nTIP-INS\n\nThunder: Lost for first time with George scoring at least 30 points after winning the first five this season. ... Westbrook got a technical after he didn't get a call on a bump from Maxi Kleber when he drove for a layup that was short. ... Jerami Grant and Patrick Patterson scored 10 points apiece while Steven Adams had nine rebounds and eight points.\n\nMavericks: Won their 13th out of last 14 home games to improve to 15-3 at American Airlines Center. ... Barnes had 16 points, and Dorian Finney-Smith added 10. ... G Wesley Matthews missed his second game with right foot soreness. ... Smith got a technical for complaining going into a timeout about a no-call when Westbrook made contact with his face.\n\nRUSS DUD\n\nIt was the fourth time this month that Westbrook has shot less than 25 percent of the field. \"Missing and making shots is part of the game, but I got to do a better job and that's on me,\" Westbrook said.\n\nDUELING GERMAN 3s\n\nThe first of Dirk Nowitzki's six points came on a 3 with 34 seconds left in the first quarter, but the fellow German Schroder hit one in transition 5 seconds later to finish the scoring in an entertaining first quarter. Oklahoma City led 28-27 after the first.\n\nUP NEXT\n\nThe teams finish a back-to-back against each other Monday in Oklahoma City.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994595.999052
}