{
  "game_id": "0021700847",
  "espn_id": "400975593",
  "date": "Feb 13, 2018",
  "matchup": "TOR vs. MIA",
  "headline": "DeRozan scores 27, Raptors hold off Heat 115-112",
  "body": "TORONTO --  The Toronto Raptors were too disappointed with their performance to celebrate a win that guaranteed them the best record in the Eastern Conference at the All-Star break.\n\nDeMar DeRozan scored 27 points, Kyle Lowry had 22 and Toronto beat the Miami Heat 115-112 on Tuesday night for its sixth straight victory.\n\nThe Raptors improved their NBA-best home record to 24-4 despite being outscored 31-17 in the fourth quarter and missing their final eight field-goal attempts.\n\n\"It was terrible,\" DeRozan said. \"It was a terrible win. We can't close out games like that.\"\n\nToronto (40-16) plays its final game before the break on Wednesday night.\n\nSerge Ibaka had 14 points and 10 rebounds for the Raptors, who also won six straight between Nov. 25 and Dec. 10 and again between Dec. 13 and 23.\n\nC.J. Miles added 11 points, but the Raptors failed to extend its franchise-record five-game streak of winning by 15 or more points.\n\n\"I think we all were displeased,\" Lowry said of the finish. \"We could have closed it out better.\"\n\nGoran Dragic scored 28 points and James Johnson had 16 for the Heat, who lost for the sixth time in seven games.\n\n\"We feel we're a good team but we have some work to do,\" Heat coach Erik Spoelstra said.\n\nMiami fell a half-game behind idle Philadelphia for seventh in the East. The Heat visit the 76ers on Wednesday.\n\n\"We definitely understand where we are in the standings,\" Dwyane Wade said. \"Coach makes sure we see the standings every day.\"\n\nWade had 10 points and 11 rebounds for the Heat, and Hassan Whiteside collected 10 points and 10 boards.\n\nToronto led 112-96 with 4:42 left but back-to-back baskets by Dragic capped a 13-0 spurt that made it 112-109 with 56 seconds left.\n\n\"Closing out games has been an issue for us,\" Raptors coach Dwane Casey said. \"We had a comfortable 15-point lead and then we got comfortable.\"\n\nDeRozan stopped the run when he was fouled and missed the first free throw before making the second.\n\nAfter a Miami timeout, Dragic missed a 3 and Toronto's Pascal Siakam grabbed the rebound. Lowry was fouled and made one, putting Toronto up five with 27 seconds left, but a 3 by Wayne Ellington made it 114-112 with six seconds remaining.\n\nMiles split a pair of free throws before Josh Richardson's last-chance 3 went wide.\n\nDragic scored 16 points in the third but the game turned after he went to the bench. DeRozan scored 19 points in the quarter, nine of them in a 21-4 run over the final 4:34 as the Raptors took a 98-81 lead into the fourth.\n\n\"They just seemed to score every time down going the other way and we weren't able to hold the fort,\" Spoelstra said.\n\nTIP-INS\n\nHeat: F Kelly Olynyk (left shoulder) missed his third straight game. ... Miami made 16 turnovers, leading to 28 points for Toronto. .. The Heat have lost a season-worst four straight on the road.\n\nRaptors: F OG Anunoby started after leaving Sunday's win at Charlotte because of a sprained right ankle. ... Fred VanVleet had 10 points, extending his career-long streak of double-digit games to eight.\n\nAERIAL ACROBATICS\n\nDeRozan had the dunk of the game, a one-handed finish on an alley-lop pass from Lowry.\n\nNOTHING'S FREE\n\nThree of Toronto's five missed free throws came in the final 41 seconds. Toronto shot 18 for 23 at the foul line.\n\nRARE FEAT FOR HEAT\n\nMiami is one of four teams to win in Toronto this season, beating the Raptors 90-89 on Jan. 9 when Ellington scored a last-second layup. Golden State, Utah and Washington also won at Air Canada Centre.\n\nUP NEXT\n\nHeat: Visit the 76ers on Wednesday. Miami lost at Philadelphia on Feb. 2.\n\nRaptors: Visit Chicago on Wednesday. Toronto has won its past four meetings with the Bulls.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992856.4477282
}