{
  "game_id": "0022000406",
  "espn_id": "401267566",
  "date": "Feb 13, 2021",
  "matchup": "PHI @ PHX",
  "headline": "Suns keep rolling, top 76ers 120-111 for 5th straight win",
  "body": "PHOENIX -- — Devin Booker lost plenty of games in his first five NBA seasons. That's part of what makes these past few weeks even more sweet.\n\n\r\n                    Booker scored 36 points, Chris Paul added 18 points and 10 assists and the rising Phoenix Suns beat the Philadelphia 76ers 120-111 on Saturday for their fifth straight victory.\n\n\r\n                    “It's so nice, man,” Booker said. “We’re deep. I feel like we’re 15 deep. Everyone can play and everyone’s ready to go.”\n\n\r\n                    The Suns have won eight of their past nine games and improved to 16-9. They got a big game from their bench against Philadelphia, especially from Dario Saric, who scored 15 points in his first game back after missing 13 straight.\n\n\r\n                    Saric missed about a month because he was in the league's COVID-19 health and safety protocol and also dealt with a sore ankle.\n\n\r\n                    “Now to be finally back, play with this group of guys who are really talented and positive minded, it’s just a pleasure,” Saric said.\n\n\r\n                    Joel Embiid had 35 points on 12-of-23 shooting for the Sixers, who have lost two in a row but still hold the top spot in the Eastern Conference at 18-9. Ben Simmons and Tobias Harris both added 18 points.\n\n\r\n                    The game was tied 53-all at halftime after a tight second quarter when there were nine lead changes and five ties. Booker took control in the third quarter, when he scored 16 points to give Phoenix an 86-81 lead going into the fourth.\n\n\r\n                    Saric and Jae Crowder each hit 3-pointers to open the fourth quarter and extend the Suns' lead to 92-81. The closest the Sixers would get was 102-97 after Embiid's bucket with 5 1/2 minutes remaining. The Suns had an 11-2 run which gave them a 113-99 lead with 3:15 left to close out the win.\n\n\r\n                    The 76ers' offense wasn't great down the stretch but the real problem was defense. Phoenix shot 60.8% from the field and got 49 points from the bench.\n\n\r\n                    “We know we’re not going to stop teams every possession, teams are going to score, but we’ve got to make it tough,” Simmons said. \n\n\r\n                    Booker has scored 30-plus points in each of the last three games overall and has scored 30-plus in each of his last seven games against Philadelphia. That is the longest streak ever by a Suns player against a single opponent. \n\n\r\n                    “More than anything, Devin will take the wins over stats every time and that’s what I love about him,” Suns coach Monty Williams said. “He and I are growing with our relationship and communication. He’s just scratching the surface.”\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: The Sixers fell to 7-7 on the road. … Embiid extended his streak of scoring at least 25 points to 11 games. That puts him alongside the Hall of Fame trio of Wilt Chamberlain, Allen Iverson and Charles Barkley as the only players in franchise history to accomplish the feat. He has scored at least 33 points in nine of those 11 contests. … Mike Scott returned to the lineup after missing 18 of the last 19 games with a knee injury. The forward was scoreless in 11 minutes … Shake Milton sat out with a left ankle injury. \n\n\r\n                    Suns: The Suns are 9-4 on their home court. … Cameron Payne returned to action after missing 10 straight games. Payne, who had a foot injury, played 15 minutes and scored four points.\n\n\r\n                    BENCH BOOST\n\n\r\n                    Saric wasn’t the only Suns reserve who produced. E’Twaun Moore had 11 points on 5-of-6 shooting, Cam Johnson had nine points and Crowder added eight points and four rebounds. The bench combined to make 19 of its 29 shots.\n\n\r\n                    “Our bench came in and gave us unreal production,” Williams said.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Wrap up their four-game road trip in Utah on Monday.\n\n\r\n                    Suns: Continue their seven-game homestand against Orlando on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997096.961785
}