{
  "game_id": "0022400536",
  "espn_id": "401705102",
  "date": "Jan 11, 2025",
  "matchup": "POR vs. MIA",
  "headline": "Herro leads Heat with 32 points in a 119-98 win at Portland",
  "body": "PORTLAND, Ore. -- — Tyler Herro had 32 points, including seven 3-pointers, and the Miami Heat downed the Portland Trail Blazers 119-98 on Saturday night. \n\n\r\n              Nikola Jovic added 21 points and eight rebounds off the bench for the Heat, who have won three straight after a three-game losing streak. \n\n\r\n              Miami led by 20 points at the half but Portland closed the gap in the third quarter, getting within 68-64 on Anfernee Simons' off-balance jumper and free throw. Simons had 17 in the quarter and led the Blazers with 28. \n\n\r\n              Miami took a 94-83 lead into the final quarter and led the rest of the way. \n\n\r\n              The Heat would not discuss the ongoing drama with forward Jimmy Butler, who is serving a seven-game team suspension for conduct detrimental to the team. Butler was suspended by the Heat on Jan. 3 after he suggested he wouldn't be able to find joy playing with Miami. \n\n\r\n              Portland, back home after a five-game road trip, played without Jerami Grant (facial contusion), Deandre Ayton (calf) and Robert Williams III (illness). \n\n\r\n              Takeaways\r\n              Heat: Josh Richardson, who has been out since November with a heel injury, was ruled out for the game after being initially listed as questionable.\n\n\r\n              Trail Blazers: Portland said Matisse Thybulle continues to rehab a right ankle injury and will be re-evaluated in two weeks.\n\n\r\n              Key moment\r\n              Jovic and Terry Rozier made back-to-back 3-pointers to put the Heat up 52-39 and Miami went on to lead 66-48 at halftime. The Heat had 13 3-pointers in the first half alone. \n\n\r\n              Key stat\r\n              Herro has hit at least one 3-pointer in all of the games he's played this season. \n\n\r\n              Up next\r\n              Heat: The Heat are set to play at the Los Angeles Clippers on Monday. The game was still scheduled as of Saturday night despite the devastating fires in Southern California. The Trail Blazers host the Brooklyn Nets on Tuesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998180.39236
}