{
  "game_id": "0021800912",
  "espn_id": "401071585",
  "date": "Feb 27, 2019",
  "matchup": "ATL vs. MIN",
  "headline": "Young, Collins power Hawks past Timberwolves, 131-123 in OT",
  "body": "ATLANTA --  Trae Young and John Collins showed a glimpse of the Atlanta Hawks' long-range plan.\n\nIn the process, they helped make it more difficult for Minnesota to realize its playoff dream this year.\n\nYoung matched the career high he set earlier in the week with 36 points, Collins had 34 and the Hawks beat the Timberwolves 131-123 in overtime Wednesday night.\n\nYoung, a rookie, and Collins, in his second season, are the foundation of the Hawks' rebuilding effort with first-year coach Lloyd Pierce.\n\nVeteran Vince Carter, still playing important minutes at 42 -- 10 years older than Timberwolves coach Ryan Saunders -- said he's enjoying watching the kids grow into winners.\n\n\"It's just great to see two guys having wonderful games like that while still making plays for others,\" said Carter, who scored 17 points, including a 3-pointer to open overtime. \"That's what it's all about.\"\n\nCollins scored 18 points in the fourth quarter as Atlanta, which trailed by 13 points late in the third period, rallied to force the extra period.\n\nKarl-Anthony Towns led the Timberwolves with 37 points and 17 rebounds. Andrew Wiggins had 21 points.\n\nIt was a damaging loss for Minnesota, which fell four games behind San Antonio and the Los Angeles Clippers, in an eighth-place tie in the Western Conference playoff race.\n\n\"We hope that one game isn't gonna affect our chances at the end but you can point to a lot of one games,\" Saunders said. \"We just need to bounce back.\"\n\nThe Timberwolves (29-32) fell to 9-22 on the road.\n\n\"We made it tough on ourselves,\" Towns said. \"It was that simple. ... We made the same mistakes. Costs us every time. So we'll learn, we'll learn one day.\"\n\nAtlanta's DeAndre Bembry scored six of his 16 points in overtime, including back-to-back baskets for a 125-118 lead.\n\nFollowing a timeout, Towns had a jam and a 3-pointer -- his season-high fifth of the game. Bembry, who had only 10 points through regulation, answered with his third basket of the extra period, giving the Hawks a 127-123 advantage.\n\nEach team missed last-second shots in regulation.\n\nAfter Young's basket tied it at 118, Derrick Rose missed a short jumper for Minnesota.\n\n\"Derrick is one of the best point guards that ever lived so I'm OK with him taking that shot, but obviously I wanted the ball so I could shoot,\" Towns said.\n\nAtlanta called timeout with 0.5 seconds remaining. Young made a jumper off the inbounds pass from Carter, but a video review confirmed the shot came after the buzzer.\n\nJosh Okogie, the Timberwolves' rookie from Georgia Tech, had 15 points in his return to Atlanta.\n\nTIP-INS\n\nTimberwolves: F Luol Deng did not return after leaving with a sore left Achilles in the first half. ... F Robert Covington was sent to G League Iowa as he moves closer to his return from a bone bruise on his right knee. He has missed 23 consecutive games since suffering the injury on Dec. 31. Covington is expected to practice only at Iowa while the Timberwolves are on the road. ... F Cameron Reynolds was signed to a 10-day contract.\n\nHawks: Dewayne Dedmon had seven points and 10 rebounds before fouling out with 3:06 remaining. ... Kent Bazemore's frustration grew as he missed each of his 12 shots through three quarters. He complained when no foul was called on a miss late in the period and drew a technical foul. He missed two shots -- a 3-pointer and a layup -- on Atlanta's next possession and didn't attempt another shot. ... Bembry also had a double-double with 14 rebounds.\n\nTEAGUE STILL SORE\n\nTimberwolves point guard Jeff Teague missed his second straight game with a sore left knee. Tyus Jones had 11 assists and seven points as the fill-in starter.\n\nBALANCE, SORT OF\n\nYoung and Collins were Atlanta's only starters to score in double figures. Young, who scored a career-high 36 points in a loss at Houston on Monday night, stayed hot with 20 first-half points. He had help; every Atlanta starter had scored by the time the Hawks led 19-10.\n\nUP NEXT\n\nTimberwolves: Continue three-game trip at Indiana on Thursday night.\n\nHawks: Host Chicago on Sunday.\n\n---\n\nMore AP NBA coverage: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995350.495316
}