{
  "game_id": "0021801080",
  "espn_id": "401071753",
  "date": "Mar 22, 2019",
  "matchup": "MEM @ ORL",
  "headline": "Ross, Fournier help Magic rally past Grizzlies in overtime",
  "body": "ORLANDO, Fla. --  If the Memphis Grizzlies are playing for NBA draft lottery pingpong balls this time of year, you'd have a hard time convincing the Orlando Magic.\n\nThe Magic, trying to reach the playoffs for the first time in seven years, rallied to beat Memphis 123-119 in overtime for their fourth straight victory behind 31 points from Terrence Ross and 27 from Evan Fournier.\n\nNikola Vucevic had 25 points and D.J. Augustin added 20 points and eight assists for Orlando, which staged its biggest comeback of the season after trailing the Grizzlies by 17 points in the third quarter.\n\nOrlando weathered seven lead changes in overtime, before finally putting the Grizzlies away when Vucevic drove through the heart of the Memphis defense for a layup to make it 121-118 with 35 seconds left. Fournier finished the scoring with a pair of free throws 11 seconds later.\n\nMemphis, which has no chance of reaching the playoffs in the Western Conference, beat Orlando 105-97 almost two weeks ago and had the Magic down 14 to start the fourth quarter.\n\n\"I know what I'm talking about when I say you play loose and free when you have nothing to play for, and that's how they played,\" said Fournier, who has been with the Magic the last five years. \"Memphis was very organized, they made shots and put up a really good fight.\"\n\nOrlando's fourth-quarter rally was sparked by Ross' offense -- he hit three 3-pointers in the first six minutes of the final period -- and an aggressive defensive effort from the entire team. Orlando limited Memphis to 27.8 percent shooting (5 of 16) in the fourth quarter, after allowing the Grizzlies to shoot 57.5 percent the first three quarters.\n\n\"The things you have to do to play well defensively in an NBA game, we were terrible at until the fourth quarter,\" Magic coach Steve Clifford said. \"Terrence Ross kept us in the game singlehandedly, but it was really our defense that won the game. We just did our jobs better in the fourth quarter. We played the way we had to play.\"\n\nMemphis got 29 points from Tyler Dorsey, who replaced Mike Conley in the lineup. Conley didn't play because of what the team called \"general soreness.\" Jonas Valanciunas had 23 points and 24 rebounds, and Justin Holiday scored 22 for the Grizzlies. Chandler Parson had 17 points.\n\n\"It was a heck of a duel going down the stretch,\" Memphis Coach J.B. Bickerstaff said. \"Guys were making plays, making shots, they just made one more play than we did.\"\n\nMemphis trailed 121-118 in the overtime when Dorsey was fouled on a 3-point attempt with 24 seconds left and made the first free throw, but missed the next two.\n\nFournier then hit two free throws to extend the Magic's lead to 123-119 and Memphis couldn't connect on any of three 3-point shots in the final seconds.\n\nThe Magic rallied from 14 down in the fourth quarter, tying the game at 110 on Fournier's driving layup with 17.7 seconds left in the game.\n\nDorsey missed a 15-foot jumper that would have put the Grizzlies back in front. Michael Carter-Williams got the rebound for Orlando with 1.7 seconds to play. He had teammate Wes Iwandu wide open for a breakaway layup, but Magic coach Steve Clifford called for a timeout and Williams never got the pass off.\n\nFournier missed a 3-pointer at the buzzer to send the game to overtime.\n\nTIP-INS\n\nGrizzlies: C Joakim Noah (sore knee) sat out the game. ... Conley averaged 29.5 points in the last six Grizzlies' games. ... Memphis was 5 of 12 (41.7 percent) from the free throw line in the first half. ... Memphis is 3-3 in overtime games this season.\n\nMagic: Orlando has won six straight home games for the first time in eight years. ... The Magic missed their first eight shots of the game to fall behind 13-1. ... Orlando is 1/3 in overtime games this season.\n\nUP NEXT\n\nGrizzlies: Host Minnesota in second game of back-to-back Saturday.\n\nMagic: Finish five-game homestand Monday against Philadelphia.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995335.6648371
}