{
  "game_id": "0022000758",
  "espn_id": "401307549",
  "date": "Apr 04, 2021",
  "matchup": "MEM @ PHI",
  "headline": "Allen helps lead Grizzlies past short-handed 76ers",
  "body": "PHILADELPHIA -- — Grayson Allen had 11 of his 15 points during a game-changing third quarter, lifting the Memphis Grizzlies to a 116-100 victory Sunday night over the short-handed Philadelphia 76ers, who were without All-Star center Joel Embiid.\n\n\r\n                    Dillon Brooks scored 17 points and Jonas Valanciunas had 16 points and 12 rebounds for the Grizzlies, who began play ninth in the Western Conference. Memphis had seven players in double-figures and totaled 30 assists.\n\n\r\n                    “It’s a beautiful stat sheet, for sure,” coach Taylor Jenkins said.\n\n\r\n                    The Grizzlies had the advantage for most of the first half and took control with a 14-4 run over the first two minutes of the third quarter. Allen hit three 3-pointers during the spurt that pushed Memphis’ lead to 66-46 with 10 minutes left in the period.\n\n\r\n                    “When the ball is moving around like that, everyone is getting a piece, everyone is getting points,” Allen said. “It’s beautiful offense and great for our team spirit.”\n\n\r\n                    The Grizzlies kept their foot on the gas and continued to expand the margin, which reached 28 when Tyus Jones hit a 3 with 33.8 seconds left in the third.\n\n\r\n                    Memphis ended its impressive period ahead 97-71. The Grizzlies made 16 of 22 field goals, including 7 of 12 3-pointers, in the quarter.\n\n\r\n                    “We came out and played great Grizzlies basketball,” Jenkins said.\n\n\r\n                    Philadelphia fans booed several times throughout the quarter, including after Brooks’ layup that made it 75-53 with 6:13 left and after Desmond Bane’s 3 put the Grizzlies ahead 88-61 with 2:33 remaining. But they really let the 76ers hear it at the end of the quarter when an arena at about 25% capacity sounded more like a sold-out crowd raining down boos.\n\n\r\n                    Tobias Harris scored 21 points for the 76ers, who have played 11 of their last 12 games without Embiid. Philadelphia remained tied with Brooklyn, which lost to Chicago earlier on Sunday, atop of the Eastern Conference standings.\n\n\r\n                    Coach Doc Rivers said besides missing Embiid, Philadelphia was worn down from their recent schedule. The 76ers returned from a six-game, 12-day road trip on Friday and turned around to play home games on consecutive nights. They’ll head back out on the road for the first of four on Tuesday at Boston.\n\n\r\n                    “We’re human,” Rivers said. “We played a lot of games during this stretch. We didn’t stand a chance and not a lot we could do about it.”\n\n\r\n                    MISSING EMBIID\n\n\r\n                    Embiid returned from a 10-game absence due to a bone bruise in his left knee in Saturday night’s 122-113 victory over the Minnesota Timberwolves, but he didn’t play in the second game of a back-to-back in order to recover from that outing.\n\n\r\n                    “Any player who has been out three weeks and then plays in a game, you probably don’t play him in a (back-to-back), it’s just smart,” Rivers said. “This one was pretty simple. This wasn’t a hard decision for any of us.”\n\n\r\n                    Embiid had 24 points and eight rebounds against the Timberwolves. He is averaging 29.8 points and 11.3 rebounds in 32 games this season.\n\n\r\n                    The 76ers certainly could’ve used even a rusty Embiid against Memphis.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Justice Winslow (right thigh soreness) missed his fourth straight game but is getting closer to a return. He’s considered day-to-day, coach Taylor Jenkins said. ... Improved to 12-9 on the road.\n\n\r\n                    76ers: Rookie Tyrese Maxey (health and safety protocols) didn’t dress. Rivers said he had an inconclusive COVID-19 test. ... Rivers said veteran G George Hill, acquired by the 76ers on March 25, is progressing from a thumb injury that has sidelined him since Jan. 24. There still is no timetable for his return. ... Rising welterweight Jaron “Boots” Ennis rang the ceremonial Liberty Bell prior to the contest. Ennis (26-0, 24 KOs) of Philadelphia fights former world champion Sergey Lipinets on Saturday night in Uncasville, Conn.\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: At Miami on Tuesday.\n\n\r\n                    76ers: Start a four-game road trip at Boston on Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996941.137059
}