{
  "game_id": "0022200532",
  "espn_id": "401468687",
  "date": "Dec 30, 2022",
  "matchup": "DET @ CHI",
  "headline": "LaVine scores season-high 43 as Bulls beat Pistons 132-118",
  "body": "CHICAGO -- — Zach LaVine scored a season-high 43 points, and the Chicago Bulls pulled away in the closing minutes to beat the Detroit Pistons 132-118 on Friday night.\n\n\r\n              LaVine looked more like his old explosive self than the guy managing his left knee following offseason surgery. And the Bulls ended the game on a 17-3 run after getting all they could handle from the team with the NBA’s worst record.\n\n\r\n              “Nothing surprising. That's the Zach we all know,” DeMar DeRozan said.\n\n\r\n              LaVine had the crowd roaring when he capped an 18-point first quarter with a thunderous, right-hand alley-oop from Coby White just before the buzzer and let out a primal scream. He was also on target from the outside, making 5 of 9 3-pointers and 15 of 20 shots in the game.\n\n\r\n              DeRozan, who went off for 42 points against Milwaukee, shrugged off a slow start to score 22. Nikola Vucevic added 19 points and nine rebounds, and the Bulls won for the fifth time in six games.\n\n\r\n              The Pistons were down two players, with guard Killian Hayes starting a three-game suspension for striking Orlando’s Moritz Wagner in the back of the head in Wednesday’s win and forward Hamidou Diallo serving a one-game punishment for his role in the altercation.\n\n\r\n              Jaden Ivey led Detroit with 22 points. Bojan Bogdanovic scored 20, and Alec Burks added 19. Isaiah Stewart finished with 16 points and 10 rebounds.\n\n\r\n              STRONG FINISH\n\n\r\n              The Bulls, coming off an overtime win over Milwaukee following an embarrassing loss to Houston, found themselves deadlocked at 115-all before putting away the Pistons.\n\n\r\n              “I think we did a good job on the defensive end there, getting a lot of offensive rebounds,” LaVine said. “They made some tough shots, too. I think the last four, five minutes, we were really locked in and we got some good stops.”\n\n\r\n              DeRozan made two free throws with 4:10 remaining to start the game-ending run and Jalen Duren got called for goaltending trying to block a fast-break layup by LaVine. After Ivey made a free throw, Chicago's Alex Caruso nailed a corner 3 off a pass from LaVine. \n\n\r\n              The Pistons got called for a shot-clock violation. LaVine drove for a three-point play to make it a nine-point game.\n\n\r\n              Caruso blocked Ivey's 3 and Vucevic hit one from the right to bump the lead to 128-116 with 1:39 remaining.\n\n\r\n              BIG OUTINGS\n\n\r\n              Asked about DeRozan and then LaVine scoring more than 40 in consecutive games, Chicago's Billy Donovan mentioned Oklahoma City visiting Orlando in his second game as an NBA coach during the 2015-16 season.\n\n\r\n              “In the same game, Durant and Westbrook both had 50-plus,” he said. “It was a double-overtime game. DeMar and Zach and Vooch are really unselfish guys. DeMar had it going in an incredible way the other night. And you know what? Zach's totally fine, Vooch is totally fine with that. Zach got it going today. And you know what? Everybody's fine.”\n\n\r\n              Donovan was almost correct. Russell Westbrook scored 48 and Kevin Durant added 43 points to lead the Thunder to a 139-136 double-overtime win. Vucevic, incidentally, scored 26 for the Magic.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Coach Dwane Casey said the NBA “did the right thing by everyone” with the punishments against Hayes and Diallo that were handed down by executive vice president Joe Dumars — the former Pistons star player and executive. “Anything you do, whether it's on the court or in life, there's consequences for it and I preach that every day,” he said. Wagner was suspended two games and eight Magic players one game apiece.\n\n\r\n              Bulls: PG Lonzo Ball has been making some progress lately as he recovers from his latest surgery on his left knee. Donovan said he has been shooting, jumping and doing some light jogging. “It is progressing. It's just really slow,” he said. “There has definitely been some improvement.” Ball has been sidelined all season following surgery in September — his second on the knee in less than a year and third since he entered the NBA with the Lakers in 2017. ... F Derrick Jones Jr. (sprained left ankle) missed his fifth consecutive game.\n\n\r\n              UP NEXT \n\n\r\n              Pistons: Visit Minnesota on Saturday.\n\n\r\n              Bulls: Host Cleveland on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994370.43235
}