{
  "game_id": "0021800518",
  "espn_id": "401071194",
  "date": "Dec 28, 2018",
  "matchup": "DET @ IND",
  "headline": "Sabonis' double-double leads Indiana past Detroit",
  "body": "INDIANAPOLIS --  The Indiana Pacers have taken adversity and used it to their advantage during a breakout December.\n\nThat run continued Friday night, when Domantas Sabonis got his league-leading 15th double-double as a reserve, Collison scored 19 points and the Indiana Pacers beat the Detroit Pistons 125-88.\n\nAt the start of the month, the Pacers were without All-Star guard Victor Oladipo and spinning their tires with a 13-10 record. Indiana struggled when Oladipo was injured last season. This year, they used his absence to figure out how to compete without him, and that paid off Friday when Oladipo had a quiet night from the field.\n\n\"We fixed things (while) playing without Vic,\" Darren Collison said. \"We didn't play as well last year (without Oladip)) so we took it upon us to play well until he got back, and now we're playing even better.\"\n\nOladipo has been back in Indiana's lineup since Dec. 12, but against Detroit he scored only seven points. The Pacers, much like they did in his absence, relied on an onslaught of scoring from their other four starters and key contributions off of the bench.\n\nSabonis had 19 points and 12 rebounds, and Thaddeus Young and Myles Turner each had 17 points. Bojan Bogdanovic and Doug McDermott each scored 12 points.\n\nIndiana is a league best 11-3 since Dec. 1 and has the third-best record in the NBA.\n\nThe Pacers are 7-2 since Oladipo's return, but it was a 4-1 stretch prior to his return that gave the Pacers the confidence and know-how to pull out games without a major contribution from their best player. Oladipo chalked up the lackluster Friday to his gradual return to form, but noted a win is all he's ever concerned with.\n\n\"I'm comfortable with winning. I love it,\" Oladipo said. \"I've got to find other ways to score and be effective, make the right play. My flow, my rhythm will come back.\"\n\nThe Pacers scored the first eight points of the game and led Detroit 32-21 at the end of the first period. Indiana worked with a double-digit lead for the rest of the game and led by 37 during the fourth quarter.\n\nDetroit's two big men had quiet nights by their standards. Blake Griffin had 18 points and six rebounds, and Andre Drummond had 12 points and 12 rebounds.\n\nThe Pistons came out flat, contributing to a stale first few minutes. Unlike Indiana, which had seven players in double figures, Detroit didn't have someone step up to ignite the offense. The Pistons shot only 37 percent from the floor.\n\n\"I first want to apologize to the fans of the Detroit Pistons,\" Pistons coach Dwane Casey said. \"That's one of the worst exhibitions we've put out on the floor. We've gotta have more pride than what we played with tonight.\"\n\nUSING A SCREEN\n\nGriffin brought a tablet onto the court to argue a call with official J.T. Orr during the second half. It's unclear which call Griffin was disputing, but Orr patiently watched the replay on Griffin's device before appearing to offer an explanation to the Pistons star.\n\nTIP-INS\n\nPistons: Drummond entered the game leading the league with 15.4 rebounds per game. He got his 28th double-double of the season. ... The Pistons are 5-14 against teams at or above .500. ... Detroit's 88 points tied for the second fewest the Pacers have allowed this season.\n\nPacers: The Pacers shot 71 percent from the floor during the first quarter, recording 12 assists on 15 baskets. ... Turner has at least three blocks in 15 of his last 22 games.\n\nUP NEXT\n\nPistons: At Orlando on Sunday.\n\nPacers: Host Atlanta on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994699.607151
}