{
  "game_id": "0021800490",
  "espn_id": "401071171",
  "date": "Dec 23, 2018",
  "matchup": "CLE vs. CHI",
  "headline": "Lauri Markkanen scores 31 points, Bulls beat Cavs 112-92",
  "body": "CLEVELAND --  Lauri Markkanen put up big numbers again, but wasn't interested in his statistics.\n\nChicago's rising star had something more important on his mind.\n\n\"We knew we haven't had a winning streak yet, so we wanted to break that,\" he said.\n\nMarkkanen scored 31 points and the Bulls won consecutive games for the first time this season, beating the Cleveland Cavaliers 112-92 on Sunday night.\n\nMarkkanen followed up on his a season-high 32 points Friday night in a victory over Orlando.\n\n\"I don't know why you want to talk to me again tonight,\" he said. \"I say the same thing every game. I'm just trying to stay aggressive.\"\n\nMarkkanen had 14 points in the third quarter, including a four-point play late in the period that sparked an 18-5 run in the game between the teams that began the game tied for last in the Eastern Conference.\n\nThe 6-foot-10 forward from Finland hit a 3-pointer from the left wing and made the free throw after being fouled by David Nwaba. Justin Holiday had a 3-pointer on the next possession, extending the lead to 84-72.\n\nCavaliers coach Larry Drew told his players following the game he was disappointed they didn't play with more energy, particularly when Chicago took control after Cleveland led 67-66 midway through the third period.\n\n\"It just seems when we hit a bump in the road things get really rocky real fast,\" he said. \"It's something we have to learn how to play through.\"\n\nThe Bulls shot 64 percent in the second half, leaving forward Larry Nance Jr. to point out that the Cavaliers are one of the worst defensive teams in the league.\n\n\"It's heart,\" he said. \"It's will. We're letting guys have career nights on us. That's something we have to take personally. We've got to man up.\"\n\nKris Dunn added 17 points, and Holiday had 15 for Chicago.\n\nNance led Cleveland with 20 points, and Cedi Osman and Jordan Clarkson each had 17. Rookie point guard Collin Sexton was 3 of 16 from the field and scored six points. Cleveland has lost five of six.\n\nNwaba sprained his left ankle when he fell awkwardly in the fourth quarter. He was down for several moments and was helped to the locker room by his teammates.\n\nMarkkanen made 11 of 18 shots and had five 3-pointers. He hit two 3-pointers and had 10 points in the first five minutes of the third quarter.\n\nThe Bulls are 4-6 under Jim Boylen. He took over when Fred Hoiberg was fired Dec. 3.\n\n\"We're thankful for the win,\" Boylen said. \"I'm proud of them. We're in this together. You have to credit the guys for being coachable and teachable, and they're becoming reliable. It's fun.\"\n\nSTILL ON THE BENCH\n\nJabari Parker, who was taken out of the Bulls' regular rotation last week, didn't play for the fifth straight game. Boylen said the 6-foot-8 forward was available after dealing with a stomach illness that caused him to miss two games.\n\n\"He needs to lock into practicing hard, playing hard and honoring the values of the team, which I have set forth for the team,\" Boylen said. \"Every day is an opportunity to do that. Every guy has to do that, just not him.\"\n\nParker is averaging 15.2 points and 6.9 rebounds in 29 games.\n\nANOTHER INJURY\n\nCleveland guard Rodney Hood, who averages 12.9 points, missed the game with a sore left Achilles. Drew doesn't know how long Hood will be sidelined.\n\nKevin Love (left foot surgey) and Tristan Thompson (sprained left foot)  could return in January.\n\nTIP-INS\n\nBulls: Holiday hit a 3-pointer less than two minutes into the game. His franchise-record of making a 3-pointer in 43 straight games ended Friday. ... G Cameron Payne (strained right calf) missed his second straight game. ... Boylen said G Zack LaVine, who missed his fifth straight game with a sprained left ankle is showing improvement every day and could return soon.\n\nCavaliers: Sexton was knocked to the floor driving to the basket in the second quarter, but remained in the game ... Drew has taken to calling an early timeout when his team shows a lack of effort on the defensive end. Chicago scored on its first four possessions, and Drew called time with 10:06 remaining in the first quarter.\n\nUP NEXT\n\nBulls: Host Minnesota on Wednesday night.\n\nCavaliers: At Memphis on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994786.640503
}