{
  "game_id": "0021800259",
  "espn_id": "401070940",
  "date": "Nov 21, 2018",
  "matchup": "MIL vs. POR",
  "headline": "Antetokounmpo leads Bucks to 143-100 rout of Trail Blazers",
  "body": "MILWAUKEE --  Giannis Antetokounmpo figured the Portland Trail Blazers might be tired on the second night of a back-to-back. He was right.\n\nAntetokounmpo matched his season high with 33 points and finished an assist short of a triple-double in three quarters as the Milwaukee Bucks defeated Portland 143-100 on Wednesday night.\n\nAntetokounmpo added 16 rebounds and nine assists in 30 minutes as the Bucks avenged an early season loss to Portland in a rematch of teams off to fast starts.\n\n\"We did the job tonight setting the tone for the entire team,\" Antetokounmpo said. \"We know they were coming off a back-to-back, so we wanted to come out with energy and get an early lead.\"\n\nMilwaukee, which lost at Portland 118-103 on Nov. 6, led the entire way and picked up its 13th win in 17 games. The Blazers were coming off a 118-114 victory Tuesday night in New York against the Knicks.\n\nCJ McCollum and Damian Lillard each had 22 points for the Trail Blazers, who entered with the best record in the Western Conference and slipped to 12-6.\n\n\"We're professionals,\" Lillard said. \"We're not the first team on a trip like this and it's not our first time. We aren't going to lean on that and make an excuse about being tired. It's early in the season. We haven't even played 20 games yet. There were a lot of things that we could've done to be much better, whether we were tired or not.\"\n\nMilwaukee led 31-20 after one quarter and extended it to 72-50 at the half. The Bucks led 109-79 entering the final period. The 43-point margin of victory was the Bucks' largest since defeating Charlotte by 50 point, 137-87, on Jan. 10, 2000.\n\nKhris Middleton had 21 points and Malcom Brogdon and Eric Bledsoe added 16 points apiece for the Bucks, who outrebounded Portland 59-39.\n\nThe Bucks gained control early, scoring the first six points en route to a 26-7 lead. Portland trimmed the lead to 31-20, but the Bucks used a 9-0 run to boost the advantage to 53-32 with 4:56 left in the half.\n\nAntetokounmpo, who had 25 first-half points on 11-of-14 shooting, sandwiched a pair of baskets around a Portland turnover in the final 2.9 seconds to put the Bucks up 72-50 at the break.\n\n\"We just came out and played hard,\" Brogdon said. \"That was a very good team tonight. We caught them back-to-back, so I'm guessing they were a little bit tired. I thought we took advantage of that and we executed at a high level.\"\n\nTIP-INS\n\nTrailblazers: Coach Terry Stotts was denied his 400th career victory.\n\nBucks: Milwaukee, which opened the season with six consecutive victories, has won three straight since losing four of seven.\n\nBUCKS HOT START\n\nMilwaukee is 9-1 in the new Fiserv Forum, the best start at home since 1990-91, when the team won its first 18 home games. The Bucks' 13-4 record is the best 17-game start to a season since 1980-81, which was also 13-4.\n\nUP NEXT\n\nPortland:  Travels to Golden State on Friday for the first of four games against the Warriors.\n\nMilwaukee: Host Phoenix on Friday in the fifth game of a six-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994519.221795
}