{
  "game_id": "0021600752",
  "espn_id": "400900157",
  "date": "Feb 03, 2017",
  "matchup": "MIL @ DEN",
  "headline": "Jokic gets triple-double as Nuggets beat Bucks 121-117",
  "body": "DENVER --  Nikola Jokic has flirted with a triple-double a few times this season. He picked a good night to finally pull it off.\n\nJokic returned to the lineup with the first triple-double of his career, and the Denver Nuggets held off the skidding Milwaukee Bucks 121-117 on Friday.\n\n\"This will be the first of many triple-doubles,\" Nuggets coach Michael Malone said.\n\nJokic had 20 points, 13 rebounds and 11 assists after missing three games with a strained left hip. He nearly had his triple-double in the first three minutes of the second half, but went without another assist until late in the fourth quarter.\n\nMalone gave him the game ball in the locker room afterward, and the 6-foot-10 Serb had his teammates sign it. He also embraced his coach.\n\n\"Yeah, and I hugged him,\" Jokic said. \"I was naked and I hugged him. That's true.\"\n\nWilson Chandler scored 23 points and Kenneth Faried had 19 points and 11 rebounds for the Nuggets.\n\nThe loss was Milwaukee's 10th in 11 games and came after a big rally in the second half. Jabari Parker had 27 points and 11 rebounds, and Giannis Antetokounmpo scored 23 for the Bucks.\n\n\"Guys came back in that second half and played the way we should have started the game,\" Milwaukee coach Jason Kidd said. \"When you dig a hole that big you have to be perfect.\"\n\nThe game was tied at 44 midway through the second quarter when Denver took control. Jokic had nine points in the final 6:38 of the period and grabbed four rebounds to reach a double-double by halftime.\n\nDenver led by as many as 22 in the third quarter, but Milwaukee rallied to cut the deficit to nine heading into the fourth.\n\nAntetokounmpo's block of Darrell Arthur's jumper in the lane prevented Jokic from getting his 10th assist and led to a layup by Parker that made it 107-105.\n\nFaried followed his own shot and then scored on a fast-break dunk -- off Jokic's assist -- to give the Nuggets a six-point lead.\n\nArthur's reaction to the pass and dunk was disbelief, and it was captured on the giant scoreboard.\n\n\"That was an NFL pass and that was a crazy finish,\" Arthur said. \"That's top 10 for sure. I've never seen anything like it.\"\n\nAntetokounmpo made it 113-112 with a 3-pointer, but Denver went on an 8-2 run to seal it.\n\nTIP-INS\n\nBucks: Milwaukee centers Roy Hibbert and Spencer Hawes, both acquired from Charlotte for Miles Plumlee on Thursday, were undergoing physicals Friday and were not with the team. They are expected to join the Bucks when they play in Phoenix on Saturday.\n\nNuggets: F Danilo Gallinari is expected to miss at least two games with a left groin strain sustained Wednesday. An MRI on Thursday revealed only a strain, but the Nuggets don't want to rush him back.\n\nMISSING YOU\n\nNuggets center Jusuf Nurkic was not on the bench in the second half. Nurkic's role has diminished with Jokic's play, but Malone said it was a medical issue.\n\n\"For him, unfortunately with the knee, his size, I think the knee is always a concern and it's been bothering him,\" Malone said. \"I'll talk to our medical guys and see what the issue is. I don't think it's anything serious by any means.\"\n\nRUMOR MILL\n\nMalone addressed the subject of trade rumors, specifically ones surrounding Chandler and Emmanuel Mudiay. Malone said Chandler has never asked him to be traded, and the team isn't shopping the 20-year-old Mudiay.\n\n\"In speaking with (general manager) Tim Connelly, I can say he is not actively shopping Emmanuel Mudiay,\" Malone said. \"The one caveat to that is, everybody's tradeable in this league. We're a young team and we have a lot of these valuable, young assets, but it's not like Tim Connelly is out there trying to get rid of these guys. We really think we have a bright future and Emmanuel Mudiay is one of our young players we value.\"\n\nUP NEXT\n\nBucks: At the Phoenix Suns on Saturday night.\n\nNuggets: At the San Antonio Spurs on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995172.562926
}