{
  "game_id": "0022000637",
  "espn_id": "401307424",
  "date": "Mar 19, 2021",
  "matchup": "CHI @ DEN",
  "headline": "Murray scores 34 points, Nuggets beat Bulls 131-127 in OT",
  "body": "DENVER -- — Jamal Murray scored 34 points, including a tying 3-pointer in the final second of regulation and a crucial jumper in the final seconds of overtime, lifting the Denver Nuggets past the Chicago Bulls 131-127 on Friday night.\n\n\r\n                    Nikola Jokic had 34 points, 15 rebounds and nine assists in helping the Nuggets to their eighth win in nine games. Michael Porter Jr. added 19 points for the Nuggets, who extended their home winning streak against the Bulls to 13.\n\n\r\n                    Zach LaVine had 32 points to lead the Bulls. Otto Porter Jr. added 22 points. “That’s the most fun part of the game,” Murray said of delivering in the clutch. “When the adrenaline is rushing and everybody is running around, that’s when we’re at our best. And I’ve always been that way. I’ve always been that kind of closer. \n\n\r\n                    \"But it wasn’t just me. We kind of picked our spots. Still found Joker, still found Mike and we had some amazing defense.”\n\n\r\n                    Trailing by eight heading into the fourth quarter, the Nuggets fell behind 103-89 after Coby White hit a 3-pointer with 8:05 remaining. But Denver strung together an 8-0 run to narrow the deficit to 103-97. A dunk by Porter and 3 by Murray around a Chicago turnover put Denver up 108-107 with 2:41 left. Bulls coach Billy Donovan, who had seen his young team blow another fourth quarter lead in Wednesday’s loss to San Antonio, called a timeout and in an animated huddle urged his frustrated players to stay in the fight. \n\n\r\n                    “I was really, really upset in that timeout because I felt in that moment we were letting go of the rope,” Donovan said. “And that really bothered me. I thought when (Porter) came back in, he made a couple shots and we made a couple stops and we kind of got brought back to life, so to speak. But then we didn’t make enough plays down the stretch. We don’t have the margin of error to do that.”\n\n\r\n                    Chicago fought back to reclaim the lead, getting a 3-pointer by Porter and a basket by LaVine for a four-point edge with 1:14 to play. Chicago added another basket before Jokic hit a 3-pointer. After a steal by Facundo Campazzo off LaVine, Murray drove in for a layup to pull the Nuggets to within 114-113 with 18.3 seconds left.\n\n\r\n                    The Nuggets fouled LaVine, who made both free throws with 16 seconds left but Murray connected from the corner on a 3 with .04 seconds left in regulation, sending the game into overtime with the score tied at 116.\n\n\r\n                    With the Nuggets clinging to a 2-point lead, Murray connected on a jumper with 10.3 seconds left in the extra period to secure the win.\n\n\r\n                    The Bulls got off to a solid start and led 55-47 at the half. Chicago took an 89-81 lead into the fourth quarter.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: G Garrett Temple remains sidelined by a sprained left ankle that he sustained a week ago against Miami, though he has been steadily increasing physical activity. “He’s been able to do different things on the court,” Donovan said. “He actually, today at shootaround, was doing some shooting, which was good to see. I think he’s definitely progressing.”\n\n\r\n                    Nuggets: The team’s backcourt remains depleted. Rookie G RJ Hampton has been out the last three weeks due to health and safety protocols. G Gary Harris remains sidelined by a left abductor strain, while G Monte Morris has missed time due to a quad injury. \n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Head to Detroit for a matchup with the Pistons on Sunday night. \n\n\r\n                    Nuggets: Conclude a four-game homestand Sunday against the New Orleans Pelicans. \n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997587.173068
}