{
  "game_id": "0021500814",
  "espn_id": "400828701",
  "date": "Feb 19, 2016",
  "matchup": "HOU @ PHX",
  "headline": "James Harden leads Rockets past free-falling Suns, 116-100",
  "body": "PHOENIX -- The Houston Rockets were in disarray going into the All-Star break. They had high expectations but had dropped three straight and fallen below .500. Interim coach J.B. Bickerstaff labeled them a \"broken team.\"\nThat feeling seemed to dissipate Friday night. James Harden had 27 points, 10 rebounds and seven assists and Houston got a convincing 116-100 win over the free-falling Phoenix Suns in the first game after the break for both teams.\nThe Rockets moved back to .500 at 28-28 and are still in position for a playoff spot.\n\"We've got an opportunity in the second half to make a push,\" Harden said. \"That's one of (26) left. A good start.\"\n\nHouston had 16 steals in the game and attempted 56 free throws, tying a season high with 35 makes.\n\"We didn't give up on the defensive end of the floor. We kept competing, and then the shots started falling,\" Bickerstaff said. \"We talked about it before the game. We talked about the place that our guys are in right now. We feel like we're in a really good place.\"\nTrevor Ariza added 25 points and six rebounds, and Patrick Beverley had 18 points and six rebounds for the Rockets. The Suns have lost 10 straight, their longest losing streak of the season, and 25 of their last 27.\nHouston led by 25 points in the third quarter after taking control in the first half. The Rockets had lost three straight games by double figures heading into the break.\nMirza Teletovic had a season-high 25 points and added eight rebounds for Phoenix a day after the Suns traded Markieff Morris to Washington.\nJon Leuer started at forward in place of Morris and scored seven of his 16 points and blocked two shots in the first quarter to help the Suns take at 24-21 lead into the second. Teletovic hit two 3-pointers in the opening 12 minutes.\nThe Rockets broke out in the second quarter, taking a 37-36 lead on Dwight Howard's dunk off a lob from Harden with 4:34 left. Houston went on an 11-0 run to go up 56-41, with Ariza and Beverley hitting 3-pointers and Harden making three free throws.\n\"Their players just took over,\" Suns interim coach Earl Watson said. \"They went into the break (with) coaches questioning their attitude. They responded against us.\"\nThe Rockets built on their lead in the third quarter, outscoring the Suns 15-4 over the first 4 minutes. Suns rookie Devin Booker drew his first career technical foul during the stretch and struggled through a 3-for-11 shooting night against an aggressive defense.\nHouston has won seven of the last eight meetings between the two teams.\nHOWARD HAS SOME FUN\nHoward, still a Rocket after the trade deadline passed, was playful during the game. Kept from checking in by official Justin VanDuyne during a first-quarter stoppage, he smiled and feigned a kick to the backside of VanDuyne, who was looking the other way. Later, Howard shouted two Suns players' names while frantically waving his arms as they tried to inbound the ball.\n`HUMP' DAY\nNewly acquired big man Kris Humphries made the most of his Suns debut a day after arriving in the Morris deal from Washington. Aside from some solid defense on Howard, Humphries finished with 18 points and 12 rebounds, becoming the 13th Suns player to have a double-double in his debut. He got extended minutes because of center Tyson Chandler's shoulder injury. \"I've always been kind of a hustle player, rebound, defend, run the floor, and I can bring that to this team and just play hard and do whatever the coaches ask me to do,\" Humphries said.\nTIP-INS\nRockets: F Terrence Jones did not play due to a concussion. F Sam Dekker was assigned to Rio Grande Valley of the D-League on Friday. ... The Rockets' starters outscored the Suns' first five 88-47.\nSuns: Chandler grabbed his right shoulder and winced in pain after a collision with 6:32 left in the second quarter. He left with what was later announced as a sprain and did not return. ... C-F DeJuan Blair, also picked up in the trade with the Wizards, was inactive. ... G Ronnie Price was active for the first time since toe surgery on Jan. 15 and played 23 minutes. He didn't score and was called for a technical foul. ... C Alex Len did not play due to a right ankle sprain.\nUP NEXT\nRockets: At Utah on Tuesday night.\nSuns: Host San Antonio on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994619.941529
}