{
  "game_id": "0022300629",
  "espn_id": "401585257",
  "date": "Jan 25, 2024",
  "matchup": "BKN vs. MIN",
  "headline": "Towns scores 27 points, Edwards gets 24, Timberwolves hang on for 96-94 win over Nets",
  "body": "NEW YORK -- — Karl-Anthony Towns scored 27 points, Anthony Edwards added 24 and the Western Conference-leading Minnesota Timberwolves held on for a 96-94 win over the Brooklyn Nets on Thursday night.\n\n\r\n              Minnesota led by as many as 17 points in the third quarter and was still ahead by 10 midway through the fourth quarter.\n\n\r\n              An 8-0 Nets run, capped by Mikal Bridges’ short jumper with 3:34 left, made it 91-89. \n\n\r\n              Cam Thomas’ free throws with 1:11 left tied the game 94-94.\n\n\r\n              “We made some mistakes in the fourth quarter and they punished us for that,” Towns said. “It was a good game. They did a good job at the end and we did a really poor job trying to close it out.”\n\n\r\n              Rudy Gobert put down an alley-oop from Towns with 58 seconds remaining to put the Timberwolves back in front.\n\n\r\n              “They have a really good connection,” said Timberwolves’ coach Chris Finch. “(Towns) is a phenomenal passer. Good court vision. He looks for him naturally. And, Rudy really did a helluva job because the pass was a little off target.”\n\n\r\n              Bridges was fouled by Jaden McDaniels with two seconds left, giving the Nets a chance to tie the score. He missed the first and the Nets were called for a lane violation on his ensuing intentional miss.\n\n\r\n              After a timeout, Minnesota successfully inbounded the ball and ran out the clock.\n\n\r\n              The Nets have now lost three straight, seven of eight and 12 of their last 14.\n\n\r\n              “We were down but we fought back,” Thomas said. “We played well. It’s encouraging that we just kept fighting. It just came down to the last possession and that was it.”\n\n\r\n              Gobert finished with 10 points and 13 rebounds, while Mike Conley also scored 10. Towns added 10 rebounds.\n\n\r\n              Thomas led the Nets with 25 points and Bridges had 21. Nic Claxton finished with 16 points and 11 rebounds, and Spencer Dinwiddie scored 14.\n\n\r\n              The Nets led by as many as eight points midway through the first quarter. Minnesota used a 12-4 run to tie the game at 21-all before Brooklyn ended the quarter on a 10-3 streak for a 31-24 lead.\n\n\r\n              The Timberwolves scored the first nine points of the second quarter to take the lead.\n\n\r\n              Thomas followed with a pair of free throws to tie the game, and after his jumper put Brooklyn up 40-37, Minnesota scored the next 12 points and never trailed again.\n\n\r\n              Mike Conley’s 3-pointer in the final seconds gave the Timberwolves a 60-48 lead at halftime.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Minnesota visits San Antonio on Saturday night.\n\n\r\n              Nets: Brooklyn hosts Houston on Saturday night.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996342.924949
}