{
  "game_id": "0022200427",
  "espn_id": "401468582",
  "date": "Dec 15, 2022",
  "matchup": "LAC vs. PHX",
  "headline": "Suns snap 5-game skid with 111-95 win over depleted Clippers",
  "body": "LOS ANGELES -- — Mikal Bridges scored 27 points, Chris Paul added 15 points and 13 assists and the Phoenix Suns snapped a five-game losing streak with a 111-95 victory over the depleted Los Angeles Clippers on Thursday night.\n\n\r\n              Devin Booker scored 14 points in his return from a two-game absence with a hamstring injury for the Suns, whose longest skid in three years ended with a blowout of a Clippers lineup missing most of its important players. Phoenix took a 27-point lead in the first half and maintained a comfortable double-digit margin while closing out just its second win in eight games in December.\n\n\r\n              “Ain't no easy nights in this league,” said Bridges, who went 11 for 18. “I know they were missing some players, but they're still in the league. We came out here and we played hard. Felt good to make some shots early.”\n\n\r\n              Kawhi Leonard, Paul George, Norman Powell, Reggie Jackson and Ivica Zubac didn't play, leaving Los Angeles without its top three scorers, four of its starters Wednesday in a victory over Minnesota, and five regular rotation players averaging a combined 74.5 points and 28.4 rebounds per game.\n\n\r\n              The Suns also were depleted: Deandre Ayton couldn’t play after injuring his ankle in the first half of Phoenix’s loss at Houston on Tuesday, and Cameron Payne sat out with a foot injury that incurred in the same game.\n\n\r\n              “I'm happy we finally got a win out of this road trip, and we're going to try to keep this train moving,\" Paul said.\n\n\r\n              Although Booker struggled with his shot from all ranges, going 6 for 22 and missing eight of his nine 3-point attempts, Bridges rebounded sharply from a 4-for-24 shooting effort against the Rockets.\n\n\r\n              “He's a prideful player,” Suns coach Monty Williams said. “He needed a forklift to get his lip off the ground the other night, he was so down about his performance. ... When he's shooting the ball like (tonight), we're a pretty good team.”\n\n\r\n              Terance Mann scored a season-high 22 points for the Clippers, whose three-game winning streak ended. John Wall had 12 points and five assists in his second start for LA after sitting out Wednesday’s game with knee soreness.\n\n\r\n              “In the second half, we did a better job of attacking the paint and trying to make a play,” Clippers coach Tyronn Lue said. “We didn't do that in the first half. I'm just proud of our guys to keep competing and keep trying to play the right way.”\n\n\r\n              Leonard sat out for the 21st time this season to rest his surgically repaired right knee. George sat for the ninth time this season, citing left knee soreness after playing in the previous six games.\n\n\r\n              Without their dynamic duo, the Clippers couldn’t come close to the standard they set in two home games over the previous three days, beating the NBA-leading Boston Celtics and the Timberwolves.\n\n\r\n              “It's definitely real frustrating when we had a good thing going, had a nice little rhythm, figuring stuff out again, about to start a nice little win streak, I thought, and this happens,” Mann said. “We've just got to figure it out from here now.”\n\n\r\n              TIP-INS\n\n\r\n              Suns: Bismack Biyombo had five points, five rebounds and five fouls while starting in place of Ayton. ... Cameron Johnson missed his 21st straight game while recovering from knee surgery. ... Jock Landale had 15 points and 10 rebounds.\n\n\r\n              Clippers: Zubac left Wednesday's game with left knee pain. ... Powell hasn't played since November due to a groin injury. ... Jackson sat out for the second time in four games with a left Achilles injury.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host New Orleans on Saturday night\n\n\r\n              Clippers: Host Washington on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994981.567877
}