{
  "game_id": "0021500430",
  "espn_id": "400828317",
  "date": "Dec 23, 2015",
  "matchup": "MIL vs. PHI",
  "headline": "Bucks shoot 60 percent, drop 76ers to 1-30 with 113-100 win",
  "body": "MILWAUKEE -- Instead of a handshake or a pat on the back, Giannis Antetokounmpo received a text message from Milwaukee Bucks coach Jason Kidd.\nAntetokounmpo made his first 11 shots to finish with 22 points, Khris Middleton added 21 on 8-of-9 shooting and the Bucks beat the hapless Philadelphia 76ers 113-100 on Wednesday night.\nIt was Milwaukee's first game since Kidd took a medical leave. He is expected to miss four to six weeks while recovering from hip surgery Monday.\nAntetokounmpo said he spoke with Kidd before the shootaround and later received a congratulatory text after Milwaukee set season highs for field goal percentage (60 percent) and assists (34).\nFilling in is assistant Joe Prunty, who also ran the team Nov. 25 when the Bucks lost at home to Sacramento while Kidd was suspended for a game.\n\"We all love Joe,\" said Milwaukee's John Henson, who had a season-best six blocks. \"He comes to work every day with a smile on his face, so this is big for him to get this win under his belt. We want to play hard for him, make him look good.\"\nPrunty, however, downplayed his victory.\n\"This isn't about me,\" he said. \"All of us are competitors and we want to win. A game like tonight is all the things we've been working on, all the things Coach Kidd has instilled in this team.\"\nPhiladelphia fell to an astonishing 1-30, including 0-18 on the road, and lost its 12th straight game. The 76ers were led by Jahlil Okafor's 17 points and eight rebounds.\n\"It is my greatest discomfort when our team doesn't guard,\" coach Brett Brown said. \"The sting in our defense must be reclaimed.\"\nAntetokounmpo, who missed the previous game with a left knee injury, was 11 of 13 from the floor to give Milwaukee back-to-back wins for only the second time in the last 23 games.\nMichael Carter-Williams added 18 points and nine assists for the Bucks, who shot 51 for 85 from the field.\nThe last time Milwaukee played at the Bradley Center was Dec. 12, a 108-95 victory over Golden State after the Warriors set an NBA record by winning their first 24 games of the season.\nAfter a 1/3 road trip out West, Milwaukee returned home and led the entire game against Philadelphia. The 76ers called timeout 54 seconds into the game, and the Bucks scored the first 10 points.\nPhiladelphia had nine turnovers in the first 8:34 and Milwaukee shot 71.4 percent (15 for 21) in the opening quarter.\nThe Bucks' biggest lead was 25 thanks to a layup by Greg Monroe for a 63-38 advantage with 2:42 left in the second quarter.\nThe closest the 76ers got the rest of the way was the final margin on a 3-pointer by Isaiah Canaan with 50 seconds to go.\nTIP-INS\n76ers: Carl Landry made his season debut after having surgery on his right wrist in June. The Milwaukee native had six points in 11 minutes. ... Kendall Marshall had five points and six assists after sitting out Tuesday against Memphis to rest his injured right knee.\nBucks: The team had 20 assists in the first half; it was the third time it had at least that many this season. ... Milwaukee has played eight games on Wednesdays and won for just the second time.\nNOT IN MY HOUSE\nWith 10:38 left in the second quarter, Henson blocked a shot by Okafor in the lane. Okafor got the ball back and immediately put up another shot, only to watch Henson swat that one well out of bounds.\nWINNING CONTINUES\nMilwaukee won its eighth straight game against Philadelphia, its longest active streak against any opponent. The Bucks are 2-0 this season and also face the 76ers on April 10.\nUP NEXT\n76ers: Saturday at Phoenix.\nBucks: Saturday against Toronto.",
  "source": "espn_api",
  "crawled_at": 1764994072.664371
}