{
  "game_id": "0021800735",
  "espn_id": "401071408",
  "date": "Jan 27, 2019",
  "matchup": "CLE @ CHI",
  "headline": "Cavs rally past Bulls 104-101, snap 6-game skid",
  "body": "CHICAGO --  Cleveland Cavaliers coach Larry Drew looked at a rare victory as a learning experience.\n\nJordan Clarkson and Alec Burks each scored 18 points, Cedi Osman added 17 and the Cavaliers ended a six-game losing streak, rallying to beat the Chicago Bulls 104-101 on Sunday.\n\n\"We haven't been in that situation often,\" Drew said. \"But when we do get there, I think it is important moving forward that we learn how to play down the stretch, learn how to execute, we learn how to, defensively, get the stops that we need.\"\n\nNBA-worst Cleveland improved to 10-41 after dropping 18 of 19. Matthew Dellavedova had 16 points, and Rodney Hood added 14.\n\nBurks had a follow basket with 17 seconds left to put Cleveland up 102-101. After Chicago's Kris Dunn missed at the rim at the other end, Dellavedova hit a pair of free throws to close out the scoring.\n\nThe Bulls' Zach LaVine missed a 3-point attempt at the buzzer. Cleveland's defense held Chicago to one field goal in the final 3:50.\n\nLauri Markkanen led Chicago with 21 points and 15 rebounds, and LaVine had 17 points and 12 rebounds. The Bulls have lost three straight and 13 of 14.  They've also lost to the 15-win Atlanta Hawks during that span.\n\n\"It's frustrating, but we just have to keep our heads up,\" Markkanen said. \"That's the beauty of this league. We have the next one coming up in two days. Nobody's going to feel sorry for us. We're going to show up for work and try to get better.\"\n\nCleveland had a 12-2 run early in the fourth quarter to take a 91-83 lead. Clarkson had seven points during the run.\n\nThe Bulls answered with a run of their own, with Markkanen tying it at 94 with a three-point play with 5 1/2 minutes to go. Robin Lopez put Chicago back on top at 98-96 with 3:50 remaining. After the Cavaliers took a 100-98 lead, Wayne Selden Jr. hit a 3-pointer to give the Bulls a 101-100 edge with 1:07 left, setting up the finish.\n\n\"We're growing, guys are starting to pick up on things,\" Clarkson said. \"What are we 50 (games) in? It's got to start showing now, and I think guys are starting to pick up on things.\"\n\nTIP-INS\n\nCavaliers: F Larry Nance Jr. was scoreless in 17 minutes off the bench in his second game back from a sprained right knee. ... Cleveland let go G Cameron Payne after declining to sign him for the remainder of the season. Payne's second 10-day contract expired Saturday. He averaged 8.2 points and 2.6 assists in nine games with Cleveland.\n\nBulls: Rookie F Chandler Hutchinson will be sidelined for at least a month with a fractured bone in his right foot. Hutchinson will be in a walking boot for two to four weeks and will be reevaluated following next month's all-star break. The 22nd pick of the 2018 draft has played in 44 games (14 starts), averaging 5.2 points and 4.2 rebounds in 20.3 minutes.\n\nPLAYING HURT\n\nHutchinson was injured late against the Hawks on Wednesday night, but thought it was just minor soreness. He practiced the following day and had a career-high-tying 12 points and a career-high 12 rebounds in 41 minutes two nights later against the Los Angeles Clippers before the injury was discovered.\n\n\"You play a whole game, you think just some ice, some stim and treatment and you'll be good,\" Hutchinson said. \"To have to be out for multiple weeks is kind of a bummer.\"\n\nSTREAK SNAPPED\n\nThe Bulls had won the first three meetings between the teams this season, including a 104-88 win in Cleveland six days earlier.\n\nUP NEXT\n\nCavaliers: Host Washington on Tuesday night.\n\nBulls: At Brooklyn on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994763.53426
}