{
  "game_id": "401810042",
  "espn_id": "401810042",
  "date": "Nov 08, 2025",
  "matchup": "MIA vs POR",
  "headline": "Nikola Jovic's career-high 29 points lead the Heat past the Trail Blazers 136-131",
  "body": "MIAMI -- — Nikola Jovic scored a career-high 29 points off the bench and finished with nine rebounds and seven assists as the Miami Heat edged the Portland Trail Blazers 136-131 on Saturday night.\n\n\r\n              Norman Powell scored 22 points for Miami, which got 16 points from Pelle Larsson, 15 from Andrew Wiggins and a 14-point, 12-rebound, seven-assist effort from Jaime Jaquez Jr. Kel’el Ware added 12 rebounds for the Heat.\n\n\r\n              Jovic's previous career-best was 24 points.\n\n\r\n              Deni Avdija — now averaging 25.3 points so far this season — scored 33 points for Portland, which was playing the first game of a five-game trip. The Trail Blazers got 21 points from Shaedon Sharpe, plus 18 apiece from Jrue Holiday and Jerami Grant.\n\n\r\n              It came down to a back-and-forth fourth quarter, one in which neither team led by more than four until the final moments. Holiday connected on a 3-pointer with 3:26 left to tie the game at 123-all, setting the stage for the finish.\n\n\r\n              Wiggins' 3-pointer with 1:32 left gave Miami a 132-127 lead and the Heat held on from there, improving to 4-0 at home this season. Miami also moved to 6-2 when it scores at least 115 points; the Heat are 0-2 when scoring less than 115.\n\n\r\n              The Heat, who set a franchise record with 53 first-quarter points on Friday, had an icy cold start on Saturday — missing 14 of their first 15 shots and getting into a quick 15-3 deficit.\n\n\r\n              They didn't stay cold for long. The Heat managed 69 points in the final 19 minutes of the first half, taking a 72-65 lead into the break.\n\n\r\n              Miami played its second straight game without starting center Bam Adebayo, sidelined by a sprained left big toe.\n\n\r\n              Up next\r\n              Trail Blazers: Visit Orlando on Monday.\n\n\r\n              Heat: Host Cleveland on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042586.107351
}