{
  "game_id": "0021801026",
  "espn_id": "401071699",
  "date": "Mar 15, 2019",
  "matchup": "LAL @ DET",
  "headline": "Pistons handle LeBron-less Lakers 111-97",
  "body": "DETROIT --  After beating the Lakers while LeBron James sat out, Detroit coach Dwane Casey was asked if he wished his Pistons had been able to face a Los Angeles team that was closer to full strength.\n\nPlease.\n\n\"I wish we could play G League teams or high school teams,\" Casey said. \"We've got to play who's here. I've been through that over the years, and teams have different visions and focuses, and still, how you look at tonight's schedule, I guarantee somebody's going to have a tough game against one of those teams. Those guys get paid twice a month.\"\n\nAndre Drummond had 19 points and 23 rebounds , and the Pistons took advantage of James' absence, beating Los Angeles 111-97 on Friday night. The Lakers, who have fallen well off the pace in the Western Conference playoff race, have been managing James' minutes, and he sat out this game entirely. Los Angeles played at Toronto the previous night .\n\nThe Lakers were also without Lonzo Ball (left ankle), Tyson Chandler (neck), Brandon Ingram (right arm) and Lance Stephenson (toe), but they trailed by only four in the third quarter before Detroit went on a 13-0 run to make it 73-56. Reggie Jackson started that stretch with two 3-pointers and a jumper.\n\n\"We had to play with pretty much everyone we had, we were down in bodies,\" Lakers coach Luke Walton said. \"We played hard enough to win, but we didn't make enough shots to win.\"\n\nThe Pistons were coming off losses of 28 and 34 points to the Nets and Heat, but the win Friday put Detroit percentage points ahead of Brooklyn for the No. 6 spot in the East. Langston Galloway scored 23 points and Jackson had 20 for the Pistons.\n\n\"I know everybody was excited to see LeBron, but we're here for a different reason,\" Casey said. \"No matter who goes, whoever's on load management, we can't control that. I still say those teams are going to come out and compete, and that doesn't mean automatic win at all.\"\n\nSTILL THE STAR\n\nJames hadn't missed an entire game since Feb. 2. He didn't suit up for this one, but there was certainly a buzz among the fans behind one of the baskets when he emerged around the midway point of the first quarter and walked over to the bench to join his team. He went back toward the locker room at the start of the fourth.\n\nNOT THRILLED\n\nBlake Griffin was rather subdued after his team's victory over the undermanned Lakers.\n\n\"I don't know that we've had the right spirit over this stretch of games,\" Griffin said. \"Even tonight, we put together a win, but I don't think we've been great.\"\n\nGriffin didn't have a great game himself, scoring 15 points on 3-of-12 shooting.\n\n\"I'm not saying I'm not a part of the problem,\" he said. \"I am. My energy hasn't been great, I haven't made the plays I should and gone the extra mile. If anybody notices that, we should speak up.\"\n\nTIP-INS\n\nLakers: Rajon Rondo had 15 points, eight rebounds and seven assists, and Kyle Kuzma had 12 points and 10 assists.\n\nPistons: Drummond is four rebounds away from posting a sixth straight season with at least 1,000 points and 1,000 rebounds. Only seven players have accomplished that: Wilt Chamberlain (10 years), Bill Russell (10), Bob Pettit (nine), Elvin Hayes (seven), Walt Bellamy (six), Dwight Howard (six) and Jerry Lucas (six).\n\nUP NEXT\n\nLakers: Visit the New York Knicks on Sunday.\n\nPistons: Host the Toronto Raptors on Sunday.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994321.3780532
}