{
  "game_id": "0022200645",
  "espn_id": "401468800",
  "date": "Jan 14, 2023",
  "matchup": "MIN vs. CLE",
  "headline": "Edwards, bench lift Wolves to 110-102 victory over Cavs",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 26 points and the Minnesota Timberwolves got a huge boost from their bench in a 110-102 victory over the Cleveland Cavaliers on Saturday night.\n\n\r\n              Naz Reid scored 17 of Minnesota’s 56 bench points, while Jalen Nowell had 16. Luka Garza added nine for the short-handed Wolves. \n\n\r\n              Minnesota was without Rudy Gobert for the second half due to right groin soreness, and Jaden McDaniels picked up his fifth foul just 2:37 into the second half.\n\n\r\n              That presented opportunities for Minnesota's other big men to play a bigger role.\n\n\r\n              “I thought Naz really came alive in that second half,” Timberwolves coach Chris Finch said. “I thought he played well all game, but he really stepped up in Rudy’s absence, gave us some emotional play as well with the big dunks.”\n\n\r\n              Evan Mobley and Jarrett Allen both scored 19 points for Cleveland, and Darius Garland added 15. Donovan Mitchell, who was questionable for Saturday’s game with an illness, finished with 14 points on 5-of-16 shooting.\n\n\r\n              Cleveland led 80-77 after three, but the Wolves controlled the fourth quarter and led by as much as 13. Minnesota fed off the energy of Reid, who had three big dunks to bring Target Center fans to their feet.\n\n\r\n              Garza joked postgame that Reid dunked on Cleveland's entire roster Saturday.\n\n\r\n              “Put the ball in the rim. If I’ve got to put them in the rim, they've got to go in the rim, too,” Reid said. “The mentality is to win, so if that's what I've got to do to win, that's what I'm going to do.”\n\n\r\n              Garza provided a lift down low for Minnesota, playing tough defense against Mobley. Garza also hit a 3-pointer early in the third to tie the game at 80, eliciting chants from the home crowd.\n\n\r\n              “The crowd feeds into it, and I try to pick up off that momentum and help us continue what they started on that run,” Garza said.\n\n\r\n              The Wolves have won six of their last seven games, including two straight on back-to-back nights.\n\n\r\n              Cleveland finished 2/3 on its five-game road trip.\n\n\r\n              “I just think tonight, we had too many mental lapses,” said Cavaliers coach J.B. Bickerstaff. “We didn't play well enough to win. The Timberwolves outplayed us. I think it's that simple.\"\n\n\r\n              After the Wolves got within three early in the third, Cleveland went on an 11-2 run to take a 65-53 lead. Minnesota later used a 10-0 run of its own to cut Cleveland’s lead to 69-65. Austin Rivers and Edwards both hit from 3-point range during that stretch. \n\n\r\n              “I think this is one of our more mature wins,” Finch said.\n\n\r\n              Minnesota outscored Cleveland in the paint, 60-52. The Cavs entered Saturday's game with the best defensive rating in the league (109.2) but struggled against the Wolves' offense down the stretch.\n\n\r\n              “Those were just breakdowns,” Bickerstaff said. “Giving up 33 points in the fourth quarter, our defense wasn't at its usual.”\n\n\r\n              STANDING O FOR LOVE AND RUBIO\n\n\r\n              Former Timberwolves Ricky Rubio and Kevin Love checked into Saturday’s game together and received a nice ovation from the crowd in Minneapolis. Love spent his first six seasons in Minnesota, while Rubio — playing in his second game of the season after returning from a torn ACL — played seven total seasons with the Wolves. That included a one-year return during the 2020-21 season, Finch’s first as coach.\n\n\r\n              “He was great to coach, a true professional,” Finch said. “I know he made a lasting impression on Anthony (Edwards). He still talks about some of the things that Ricky had said to him. Loved coaching him.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Mobley was slow to get up in the second quarter after drawing a charge from Edwards and was helped to the bench, but he later returned.\n\n\r\n              Timberwolves: Edwards was charged with a technical foul late in the third quarter. … Saturday was the 11th game this season for Edwards with at least 20 points, five rebounds and five assists.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host New Orleans on Monday.\n\n\r\n              Timberwolves: Host Utah on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995171.752733
}