{
  "game_id": "0022201108",
  "espn_id": "401469263",
  "date": "Mar 25, 2023",
  "matchup": "MIA vs. BKN",
  "headline": "Nets embarrass Heat, roll to 129-100 win, move back into 6th",
  "body": "MIAMI -- — All the Brooklyn Nets needed, coach Jacque Vaughn insisted, was one win.\n\n\r\n              They got it, and made it look easy.\n\n\r\n              Mikal Bridges scored 27 points, and the Nets opened the third quarter on a 31-6 run on the way to rolling past Miami 129-100 on Saturday night and leapfrogging the Heat back into the No. 6 spot in the Eastern Conference.\n\n\r\n              Cam Johnson added 23 points and Spencer Dinwiddie scored 15 for the Nets (40-34), who snapped a five-game slide. They’re only a half-game up on Miami (40-35) in the race for the sixth and final guaranteed playoff berth, but swept the Heat 3-0 this season and would also own a head-to-head tiebreaker.\n\n\r\n              “We had the mindset coming in that this was a playoff game,” Johnson said.\n\n\r\n              Max Strus scored 23 for the Heat, all of them in the first half. Tyler Herro scored 23, Jimmy Butler had 18 and Bam Adebayo finished with 16 for the Heat. Miami was outscored 64-31 after halftime.\n\n\r\n              “We have not been defending at a world-class level, the way we're capable of ... and the second half just became an avalanche,” Heat coach Erik Spoelstra said.\n\n\r\n              Strus came off the bench and made his first nine shots, one of them putting Miami up 51-37 midway through the second quarter. Over the next 14 minutes, the Nets outscored Miami 54-24 — completely turning the game around, eventually leading by 32 and, for now, putting Brooklyn in position to escape the play-in tournament that’ll decide the final two East playoff berths.\n\n\r\n              “You see how this March Madness is and you’re one and you’re done,” Vaughn said. “And that’s part of it. I have not discussed any of the standings with this group. Really, we have gone day to day and tried to get a win.\"\n\n\r\n              The Heat could have moved 1 1/2 games up on Brooklyn for sixth with a win.\n\n\r\n              \"There has been nothing easy about this season and that doesn't necessarily mean that has to be a negative thing,\" Spoelstra said. “You have to embrace the struggle. You have to figure out ways to stay together ... but we just got categorically outplayed tonight.”\n\n\r\n              It was Brooklyn’s second trip to Miami this season. The first was Jan. 8 — which ended up being the last time Kevin Durant played for the Nets, and the last time Durant and Kyrie Irving played together. Durant left that game with a knee injury, then got traded to Phoenix, and Irving has since been dealt to Dallas, as well.\n\n\r\n              The Nets were 27-13 after that night, second in the East, just a game behind Boston for the best record in the NBA. They’re 13-21 since, yet still have the Heat looking up at them in the standings — which Vaughn insists he hasn’t discussed with his team.\n\n\r\n              “You need the momentum, the confidence, the reassurance that you can get it done,” Vaughn said. “So, haven’t tried to complicate it more than that.”\n\n\r\n              TIP-INS\n\n\r\n              Nets: Brooklyn has six wins in March and erased double-digit deficits in three of them. The Nets trailed Boston by 28 on March 3, trailed Minnesota by 12 on March 10, and were down by 14 on Saturday. ... The Nets were without Seth Curry (personal reasons) and Ben Simmons (back). The Nets don’t expect Simmons to return this season, though that decision has not been finalized.\n\n\r\n              Heat: Kyle Lowry turned 37 on Saturday. He’s the 12th player to appear for the Heat at the age of 37 or higher. ... The last time a Heat player had more points off the bench before halftime than Strus did on Saturday was Feb. 27, 2019, when Goran Dragic had 25. ... Miami shot 81% in the first quarter, the first time the Heat shot that well in any quarter since March 11, 2020, against Charlotte – also in a loss.\n\n\r\n              NOVA NATION\n\n\r\n              Spoelstra watched Nova Southeastern — located in Davie, Florida, about a half-hour north of Miami — win the Division II national championship Saturday, with the Sharks finishing 36-0. “That was a year for the ages and something they’ll take for the rest of their lives,” said Spoelstra, who visited the Sharks and watched some practices before the season.\n\n\r\n              CLEVELAND WAITS\n\n\r\n              Brooklyn’s win meant Cleveland will have to wait until at least Sunday to clinch its first playoff berth since 2018 — and its first without LeBron James on the roster since 1998.\n\n\r\n              UD NIGHT\n\n\r\n              Miami’s primary area code is 305, and Heat captain Udonis Haslem — a Miami native who is in his 20th and final season with the team — now has his own section at the arena that he called home for his entire NBA career. Section 305 was dedicated in Haslem’s honor Saturday.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Visit Orlando on Sunday.\n\n\r\n              Heat: Visit Toronto on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993917.1747258
}