{
  "game_id": "0022100737",
  "espn_id": "401360556",
  "date": "Jan 28, 2022",
  "matchup": "ATL vs. BOS",
  "headline": "Collins, Young help streaking Hawks beat Celtics 108-92",
  "body": "ATLANTA -- — John Collins and Trae Young each scored 21 points, and the Atlanta Hawks beat the Boston Celtics 108-92 on Friday night for their sixth straight victory.\n\n\r\n              Bogdan Bogdanovic scored 19 points for Atlanta, and Danilo Gallinari had 14 on 5-for-5 shooting from the field. The Hawks shot 46.1%, compared to 34.9% for the Celtics.\n\n\r\n              Jaylen Brown had 26 points and 12 rebounds for Boston, which had won two straight and seven of 10. Jayson Tatum scored 20 points.\n\n\r\n              The Celtics were coming off the second-largest margin of victory in franchise history, a 128-75 victory over Sacramento on Tuesday. They pulled within one on Tatum's jumper with 9:42 left, but the Hawks then pulled away for good.\n\n\r\n              “We just got stops,\" Young said. “We just played defense and really fought. Shots weren't going, especially for me. I shot the ball (badly) tonight, but it was a great defensive game for us against a team that can really score a lot of points. For us to hold them to 92 points was great.\"\n\n\r\n              Gallinari's two foul shots sparked an 18-2 run for Atlanta. Bogdanovic made a 3-pointer and Collins converted a foul shot to make it 103-86 with 2:56 left.\n\n\r\n              “We got back in the game by guarding and got some ball movement,” Celtics coach Ime Udoka said. “It seemed evident, coming right out in the third, that we penetrated and got some open 3s to Marcus (Smart), but I felt like we went a little iso-heavy and got stagnant. The turnovers hurt us as well.\"\n\n\r\n              Led by Bogdanovic, Atlanta’s reserves outscored Boston’s 46-17.\n\n\r\n              The Celtics, who began the night eighth in the Eastern Conference, started 1 for 13 on 3s before Josh Richardson connected with 4:27 left in the second. Boston pulled within five late in the second, but Atlanta, which began the night 12th in the East, went on a 10-0 run and led 62-47 at halftime.\n\n\r\n              For Young, State Farm Arena is starting to feel as comfortable as it did last year when the Hawks made a run to the Eastern Conference finals.\n\n\r\n              “We're starting to get everybody healthy and we've had a couple of games now where nobody's been on the injury report,\" he said. “That's a good sign. We're starting to gel. We've just got to keep it going and not get satisfied for winning a couple of games.\"\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Brown and Tatum combined for 12 turnovers. ... Missed 14 of 16 shots beyond the arc in the first half. ... F Al Horford played a season-low 16 minutes and scored one point. Udoka said the reason was the Hawks were going with a smaller lineup and Boston didn't need two big men on the floor much of the game. ... Richardson was called for a technical foul for knocking down Young after an Atlanta basket late in the third. Young pushed the lead to 77-71 with a free throw. ... The team will remain in New Orleans after the game Saturday night because of a winter storm moving into Boston. Plans are to fly home on Sunday.\n\n\r\n              Hawks: F De’Andre Hunter was a game-time decision with a sore back. He finished with nine points. ... Gallinari was a game-time decision after waking up with an irritated eye. He wore safety glasses during warmups but not during the game. ... Young, the NBA points leader, has joined Dominique Wilkins, Dikembe Mutombo, Eddie Johnson, Pete Maravich and Lou Hudson as the only players in franchise history with more than one All-Star start. ... Atlanta had six steals and seven blocked shots in the first half.\n\n\r\n              STEPPING UP\n\n\r\n              Udoka liked that Tatum stepped up after the morning shootaround and addressed the team, not something that he does regularly.\n\n\r\n              “I wouldn’t say often,” Udoka said. “He speaks when he has something on his mind. I echoed his statement after he said it and said, ‘Well said,’ and to his point we’re playing well in certain areas now, but we’ve been here at times before this year and had some slip-ups, so it was great for him to step up and say that.\n\n\r\n              “It’s something we want more of, and I appreciate it. It’s a sign of growth for him.”\n\n\r\n              BETTER DEFENSE\n\n\r\n              The Hawks have been maligned on defense most of the season, but opponents were shooting 43.3% during the last five games. That’s been a relief to coach Nate McMillan, who has harped on defensive improvement throughout the year.\n\n\r\n              “I would say urgency,” McMillan said. “We’re getting pressure on the ball. We’re doing a better job of containing the ball. I feel like our defense is connected out on the floor. We’ve been pretty consistent with how we’ve played.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At New Orleans on Saturday.\n\n\r\n              Hawks: Host the Lakers on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993496.983119
}