{
  "game_id": "0022401203",
  "espn_id": "401734903",
  "date": "Dec 10, 2024",
  "matchup": "OKC vs. DAL",
  "headline": "Gilgeous-Alexander scores 39 as Thunder beat Mavericks 118-104, advance to NBA Cup semifinals",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 39 points, and the Oklahoma City Thunder beat the Dallas Mavericks 118-104 on Tuesday night in an NBA Cup quarterfinal.\n\n\r\n              Jalen Williams scored 18 points and Isaiah Hartenstein added 10 points and 13 rebounds for the Thunder, who will play Wednesday's Golden State-Houston winner in a semifinal on Saturday in Las Vegas.\n\n\r\n              Oklahoma City's largest lead was 20 points in a rematch of last season's Western Conference semifinals series that Dallas won 4-2. \n\n\r\n              The Thunder and their collection of elite perimeter defenders held Luka Doncic to 16 points on 5-for-15 shooting. Lu Dort led the effort, with Alex Caruso and Cason Wallace among the primary helpers. \n\n\r\n              Naji Marshall and Klay Thompson each scored 19 points and Kyrie Irving added 17 for the Mavericks.\n\n\r\n              P.J. Washington, a thorn in Oklahoma City's side during the playoffs last season and in Dallas' victory last month, missed the game with an illness.\n\n\r\n              Oklahoma City led 57-54 at halftime behind 18 points from Gilgeous-Alexander. Doncic had two points on 1-for-7 shooting at the break.\n\n\r\n              Gilgeous-Alexander scored 16 points on 7-for-8 shooting in the third quarter to help the Thunder take control. Isaiah Joe's deep 3-pointer at the buzzer gave Oklahoma City a 90-73 lead heading into the fourth.\n\n\r\n              Takeaways\r\n              Mavericks: Dallas made too many mistakes to have a chance. The Thunder scored 36 points off the Mavericks' 19 turnovers.\n\n\r\n              Thunder: Oklahoma City brought in the 7-foot, 255-pound Hartenstein as a free agent in the offseason to provide bulk and rebounding. It paid off — the Thunder outrebounded the Mavericks 52-44. \n\n\r\n              Key moment\r\n              Oklahoma City opened the second half on a 13-2 run. Gilgeous-Alexander scored nine points during that stretch to help the Thunder take a 70-56 lead.\n\n\r\n              Key stat\r\n              The Mavericks made just 6 of 19 field goals in the third quarter after shooting 50% from the field in the first half.\n\n\r\n              Up next\r\n              Mavericks: Host the Los Angeles Clippers on Dec. 19.\n\n\r\n              Thunder: Will play Golden State or Houston in the NBA Cup semifinals Saturday in Las Vegas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997515.927684
}