{
  "game_id": "0021600342",
  "espn_id": "400899784",
  "date": "Dec 09, 2016",
  "matchup": "DET @ MIN",
  "headline": "Pistons thump Timberwolves, 117-90",
  "body": "MINNEAPOLIS --  Andre Drummond flexed his muscles, bowed his back and enforced his will on the Minnesota Timberwolves.\n\nAnd the free-falling pups showed they wanted nothing to do with Detroit's monster in the middle, raising alarm bells all over Minnesota.\n\nDrummond had 22 points and 22 rebounds for his second straight 20-20 game and the Pistons cruised to a 117-90 victory over the Timberwolves on Friday night.\n\n\"His energy was great,\" Pistons coach Stan Van Gundy said. \"He was dominant. He was all over the boards.\"\n\nMarcus Morris had 15 points and seven rebounds and the Pistons had their way with Minnesota's struggling defense, hitting 14 of 29 3-pointers. Detroit came into the game second-to-last in the NBA averaging just 7.1 made 3s per game.\n\nAndrew Wiggins scored 16 points and Karl-Anthony Towns had 14 points and 12 rebounds for the Wolves.\n\nDrummond had his third 20-20 game of the season and 10th since 2014-15, the most in the NBA during that span, and Detroit won for the fourth time on the road in the last five games after starting the season 1-8 away from home.\n\n\"I give my all every night,\" Drummond said. \"When the ball's falling the right way like that, my energy kept going up more and more as the game went on because everything was kind of going the right way that night.\"\n\nVan Gundy has been harping on Drummond to give more consistent effort night-in and night-out, and he beamed that he has gotten three straight strong performances from his All-Star center.\n\nTimberwolves coach Tom Thibodeau is having even more difficulty squeezing energy out of his team and said he was \"very concerned\" that his message is not getting through to a team that is 6-17.\n\n\"I'm going to keep coming. I don't go away,\" Thibodeau vowed. \"I'm going to look at everything, re-examine. Something's being missed. It's got to change.\"\n\nDetroit broke the game open in the third quarter, hitting six 3s during a 31-10 run that bled into the fourth and prompted boos from a sparse Target Center crowd.\n\nReggie Jackson scored 16 points in his fourth game back from a left knee injury.\n\nREELING WOLVES\n\nMinnesota has lost seven of its last eight games and has not won at home since Nov. 17.\n\n\"We can accept making mistakes and don't make shots,\" said Ricky Rubio, who had 10 points. \"Playing with no heart, with no desire, it's just awful. Right now, it's just bad.\"\n\nThibodeau said \"everything is on the table\" as he looks to fix things, including lineup changes.\n\n\"Something is not right,\" he said. \"We have to find the answer to that.\"\n\nLONG DISTANCE\n\nThe Wolves started out the season as the best 3-point shooting team in the NBA, an enormous improvement from recent seasons when they have languished near the bottom of the league. They have steadily regressed to the mean, however, and made just 3 of 16 3s on Friday night. They went through a stretch of 13 straight misses before Brandon Rush made one, his first since Nov. 1, in garbage time.\n\nHOMECOMING\n\nPistons rookie Henry Ellenson is from Rice Lake, Wisconsin, a two-hour drive from Target Center. Ellenson said more than 150 people were making the trip for his first game in Minnesota. It was such an anticipated night that Rice Lake High School rescheduled its boys and girls basketball games so more people from the town could make it.\n\nThe Rice Lake High School band also played during pregame warmups.\n\nThe vocal contingent cheered \"Put in Henry!\" as the game got out of hand in the fourth, and cheered wildly when he finally entered with four minutes to play.\n\nTIP-INS\n\nPistons: F Jon Leuer, a native of Orono, also made a homecoming. He scored 17 points. ... Drummond air-balled a free throw in the first quarter.\n\nTimberwolves: F Adreian Payne was ejected in the fourth quarter for elbowing Morris. ... F Nemanja Bjelica missed the game with a sore right ankle. ... Gorgui Dieng had 13 points and seven rebounds.\n\nUP NEXT\n\nPistons: Detroit heads home to host Philadelphia on Sunday.\n\nTimberwolves: Minnesota stays home to host the Golden State Warriors, who will be playing the second night of a back-to-back, on Sunday.\n\n---\n\nThis story has been corrected to show that Drummond has three 20-20 games this season, not five.",
  "source": "espn_api",
  "crawled_at": 1764996071.929323
}