{
  "game_id": "0021601131",
  "espn_id": "400900526",
  "date": "Mar 31, 2017",
  "matchup": "MEM vs. DAL",
  "headline": "Grizzlies clinch playoff spot with 99-90 win over Mavericks",
  "body": "MEMPHIS, Tenn. -- Mike Conley can't quite remember what it feels like to miss the Western Conference playoffs. He doesn't have to think about the Memphis Grizzlies missing this year, either.\nConley scored 28 points, Zach Randolph added 22 points and 12 rebounds off the bench, and Memphis clinched a playoff spot with a 99-90 victory over the Dallas Mavericks on Friday night.\nMemphis' win, coupled with Denver's 122-114 loss at Charlotte earlier Friday night, earned the Grizzlies their seventh straight postseason berth.\n\"It's seems so long ago that this time of the year didn't mean anything to us,\" Conley said after the Grizzlies' second straight win. \"It's a heck of an accomplishment to have it seven years in a row.\"\nThe final step to the postseason started out easy as Memphis held a double-digit lead through most of the third quarter and still maintained a 15-point advantage with about 8 minutes left.\nBut Memphis had to weather a 3-point shooting rally in the closing minutes. Dallas made six of its first nine 3-point attempts in the fourth, a jumper by Wesley Matthews cutting Memphis' advantage to 94-90 with just over a minute left.\nDallas could get no closer, dropping its fourth straight.\nTroy Daniels finished with 21 points for Memphis, shooting 7 of 12 from outside the arc.\nThe win also means Grizzlies coach David Fizdale will reach the postseason in his first year as a head coach. He became the Memphis leader after serving as an assistant for the Miami Heat.\n\"I was glad to get the monkey off my back,\" Fizdale said. \"I don't want to be the first coach not to make the playoffs (after six straight years).\"\nSix Mavericks finished in double figures, led by 13 points each from Dirk Nowitzki, Matthews and J.J. Barea.\n\"It shows we have some fight, but we have to show more fight from the beginning of games,\" Mavericks coach Rick Carlisle said of the closing minutes. \"It's just a matter of force.\"\nThe first half put the Mavericks in a deep hole. Memphis led 55-34 at intermission. Dallas was stymied by shooting a mere 22 percent.\n\"The whole first half was not good,\" Carlisle said.\nAfter halftime, Memphis struggled to hit shots, setting off a 16-4 rally by Dallas. But the Grizzlies countered with eight straight points and eventually held a 74-62 lead entering the fourth.\nThe fourth-quarter shooting, when Dallas made six of its first nine from outside the arc, made things a bit interesting in the closing minutes.\n\"We obviously showed them in the second half that we can do it, and that we can get some stops,\" Nowitzki said.\nHarrison Barnes added: \"We fought back, had a chance and lost it because of offensive rebounds.\"\nTIP-INS\nMavericks: The NBA announced Friday that G Devin Harris was fined $25,000 for his actions after ejection from Wednesday's game at New Orleans. ... The Mavericks recorded 15 assists, breaking a string of nine straight games of at least 20 assists.\nGrizzlies: With its seventh straight playoff berth, Memphis has the third-longest streak of postseason appearances behind Atlanta and San Antonio. ... The win assured Memphis (42-34) of its seventh consecutive winning season.\nGASOL RETURN UNKNOWN\nFizdale said the timetable for the return of center Marc Gasol, who missed his fourth game with a sore left foot, remains unclear. \"He did work out (Friday), which was good,\" Fizdale said. \"He moved on it. There's still some soreness there.\"\nTAKING A LOOK\nWith the Mavericks virtually eliminated from the last Western Conference playoff spot, Carlisle seems to be turning to younger players down the stretch. \"This is an important time for us to look at these guys,\" Carlisle said. \"I'd rather look at them playing against guys like Conley or Randolph instead of undrafted free agents in the summertime.\"\nUP NEXT\nMAVERICKS: Dallas is in the midst of a five-game road trip and plays at Milwaukee on Sunday.\nGRIZZLIES: Memphis heads out on its final road trip of the season, playing the Lakers in Los Angeles on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995561.021643
}