{
  "game_id": "0022400878",
  "espn_id": "401705444",
  "date": "Mar 03, 2025",
  "matchup": "MEM vs. ATL",
  "headline": "LeVert's last-second bucket gives Hawks a 132-130 win over the Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Caris LeVert made a layup as time expired, finishing with 25 points as the Atlanta Hawks rallied to beat the Memphis Grizzlies 132-130 on Monday night.\n\n\r\n              Desmond Bane had has first career triple-double for Memphis, but Dyson Daniels stole the ball from him with 3.8 seconds remaining. LeVert got the ball and streaked down the floor for a layup that beat the horn, confirmed after an officials' review. \n\n\r\n              LeVert had 16 points in the fourth quarter.\n\n\r\n              Zaccharie Risacher scored 27 points for Atlanta. Onyeka Okongwu had 16 points and 12 rebounds, while Trae Young had 12 points and 15 assists.\n\n\r\n              Bane led Memphis with a season-high 35 points, 10 rebounds and 10 assists. Luke Kennard had 17 points.\n\n\r\n              The Grizzlies, already with Santi Aldama and Ja Morant sitting out with injuries, lost Jaren Jackson Jr. less than two minutes into the game when he went down with a left ankle injury after trying to block a shot by Daniels.\n\n\r\n              Atlanta scored the final seven points over 2:37 for the victory.\n\n\r\n              Takeaways\r\n              Hawks: Atlanta is jockeying for play-in position in hopes of making the playoffs. The Hawks sit in ninth place with a 5 1/2-game buffer to stay in the Eastern Conference's top 10 teams. \n\n\r\n              Grizzlies: Memphis has been in a skid lately, losing six of eight and dropping in the Western Conference standings.\n\n\r\n              Key moment\r\n              LeVert's final basket marked the third straight Memphis loss when the opponent scored the winner in the closing seconds. The Grizzlies lost over the weekend to the New York Knicks and the San Antonio Spurs.\n\n\r\n              Key stat\r\n              The Hawks scored a season-high 82 points in the paint.\n\n\r\n              Up next\r\n              Atlanta hosts the Bucks on Tuesday. Memphis wraps up a five-game homestand hosting Oklahoma City on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997903.826015
}