{
  "game_id": "0021601186",
  "espn_id": "400900564",
  "date": "Apr 07, 2017",
  "matchup": "OKC @ PHX",
  "headline": "Westbrook secures triple-double average, falls short of 42nd",
  "body": "PHOENIX -- Russell Westbrook joined Oscar Robertson as the only players in NBA history to average a triple-double for a season.\nThat didn't make him feel much better about his or his team's awful Friday night, when Westbrook failed for the second game in a row to break Robertson's 55-year-old, single-season record for most triple-doubles.\nThe dynamic Thunder guard fell two assists shy of what would have been his 42nd in the Oklahoma City Thunder's 120-99 loss to the Phoenix Suns.\nOf averaging a triple-double for the season, Westbrook said, \"You could never say in a million years that I would think that was even possible.\"\nAnd as for not getting 10 assists?\n\"My main goal since I got here, especially this season, is to win a championship,\" Westbrook said. \"If I wanted to get 10 assists, I could get 10 assists. Everybody wants to see the record broke, but it's bigger than that for our team and for me.\"\nOn a rough night all around, Westbrook had 23 points (on 6-of-25 shooting, 2 of 12 3-pointers), 12 rebounds and eight assists, along with eight turnovers before coach Billy Donovan pulled him with 2:34 to play.\nDevin Booker scored 21 of the Suns' 25 points in the fourth quarter and finished with 37 as Phoenix snapped a 13-game losing streak.\n\"From the start of the game, Russ was chasing history,\" Booker said. \"... Unbelievable player. I'm sure he's going to get it. I'm happy it wasn't here but we locked in defensively.\"\nWestbrook did get the six assists he needed to assure that he'd join Robertson as the only players to average a triple-double for a season. Robertson averaged 30.8 points, 12.5 rebounds and 11.4 assists for the Cincinnati Royals in the 1961-62 season.\nAfter the game, Westbrook went straight to the practice court and stayed there for nearly an hour.\n\"Get your mind right,\" he explained. \"You understand how important a game is and you want to make sure I'm playing the best that I need to play for my teammates. Tonight I felt like I let them down.\"\nWestbrook stayed in the game long after the outcome seemed certain. Donovan said he hadn't given up on being able to win the game.\n\"No, I wasn't trying for the triple-double,\" the coach said. \"I've seen enough miraculous things this year -- at Dallas and Orlando -- and I thought about taking him out at the stoppage of play around 3:40, 3:45. I just said, you know what, he gets hot around the 3-point line, we make a couple of shots. ... I just wanted to give our team every opportunity.\"\nEnes Kanter added 17 points for the Thunder, who shot just 37 percent. T.J. Warren scored 23 for Phoenix.\nWestbrook had probably his worst shooting first half of the season and his teammates didn't show much interest in the contest as the Suns opened a 28-point lead.\nHe missed his first 11 shots before sinking a 17-footer with 50.4 seconds left in the half. He followed that quickly with a three-point play on an acrobatic drive to the basket.\nBut his halftime stats were ugly: 2-for-13 shooting, 0 for 4 on 3s, 7 rebounds, 3 assists, 6 turnovers.\nPhoenix, meanwhile, shot 61 percent in the first half, led by Warren's 15 points on 7-of-10 shooting, to Oklahoma City's 39 percent and led 71-48 at the half.\nWestbrook earned assists on Oklahoma City's first three baskets in the opening minute of the second half, the third in that spree, and sixth for the game, assured he would average a triple-double for the season.\nTIP-INS\nThunder: Oklahoma City is three games behind the Los Angeles Clippers for the No. 5 spot in the West. ... The season series finished tied 2-2.\nSuns: Booker leads the NBA with six 20-point quarters. Westbrook and Stephen Curry each have five. ... The 13 straight losses had tied a franchise record set last season. ... Suns won for the first time since they shut down a healthy Eric Bledsoe for the season. ... Phoenix's 71 points was its highest-scoring first half of the season.\nTHREE MORE CHANCES\nWestbrook has three more chances for that 42nd triple-double, two of them against Denver.\nOklahoma City plays at Denver on Sunday and at Minnesota on Tuesday. The Thunder wrap up their regular season at home against the Nuggets next Wednesday.\nHe had seven straight triple-doubles before failing to get there the last two times.\nUP NEXT\nThunder: Oklahoma City plays at Denver on Sunday.\nSuns: Phoenix is home against Dallas on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995241.9895868
}