{
  "game_id": "0021601156",
  "espn_id": "400900534",
  "date": "Apr 04, 2017",
  "matchup": "ORL @ CLE",
  "headline": "LeBron, Love lift Cavaliers past Magic, 122-102",
  "body": "CLEVELAND -- The defense was tenacious. The offense flowed like it hasn't in months, with crisp ball movement leading to a deadly volley of 3-pointers that lit up the scoreboard.\nFor 12 glorious minutes, the Cavaliers were themselves again. Everything was in place.\nNo drama, no disagreements.\n\"That's us,\" Kevin Love said.\nLeBron James notched his second straight triple-double, Love scored 28 and Cleveland warmed up for a big game in Boston by dropping 18 3-pointers in a 122-102 win over the Orlando Magic on Tuesday night.\nKyrie Irving added 24 points and J.R. Smith 19 for the Cavs, who made nine 3s and scored 43 in a dazzling third quarter to turn a tight game into a blowout and beat Orlando for the 17th straight time.\nThere were no on-court issues following Sunday's emotional and exhausting, double-overtime victory as the defending champions moved into a tie with the Celtics atop the Eastern Conference. The teams will meet Wednesday for first place and temporary ownership of the top seed and home-court advantage until the NBA Finals.\nAs regular-season games go, it's significant. James, though, isn't making too much of the matchup.\n\"Their crowd is going to be great and it's a very good team we're going to be playing against,\" he said. \"We know that. Taking nothing from them, they've been playing some great ball, but I'm not one to get caught up in the regular season. I'm sorry. I've been to six straight Finals, man. I'm the last person to ask about a regular-season game.\"\nEvan Fournier scored 21 for Orlando, which has lost five in a row and six of seven.\nThe Magic led by two at halftime, but were simply overwhelmed in the third when the Cavs put it all together.\n\"Nobody can survive that,\" Magic coach Frank Vogel said. \"The bottom line is you have to bring help to elite players. Kyrie and LeBron had 13 assists in that quarter. That triggers their championship-level ball movement. That's why they're champs. They were at their best in that quarter.\n\"Too much for us.\"\nThe Cavs became the third team in league history to reach 1,000 3s in a season, joining Golden State (1,077 last season) and Houston, which has dropped 1,109 this season.\nFocusing on their defense, the Cavs got some early stops and came out firing -- from deep -- in the third to quickly spin the game in their favor.\nSmith, who has rediscovered his shooting touch after missing 36 games following thumb surgery, made four 3s in the first 3:12 and Cleveland started 6 of 7 on 3s -- with James getting assists on five of them.\n\"When we get out and run and play with pace, nobody can beat us and we know that,\" Cavs coach Tyronn Lue said.\nJames finished with 18 points, 11 rebounds and 11 assists before checking out with 5:11 left. On Sunday, he apologized for an argument with center Tristan Thompson, a flare-up that raised questions about the Cavs' chemistry.\nThe mood was much more upbeat after Cleveland's third straight win, with James saying he's feeling good about his team.\n\"I like everything,\" he said. \"I love my brothers.\"\nTIP-INS\nMagic: G Jeff Green missed his seventh straight game with a sore back. ... Swingmen Patricio Garino and Marcus Georges-Hunt made their debuts during garbage time in the fourth after both signed Monday.\nCavaliers: F Kyle Korver returned after missing 11 games with a sore left foot and scored 11 in 12 minutes. Lue thinks he can play against the Celtics. ... James scored in double figures in his 788th consecutive game, breaking a tie with Kareem Abdul-Jabbar for the second-most in history. Michael Jordan scored at least 10 in 866 straight. Those numbers didn't impress Lue. \"They should be able to score 10 points,\" Lue said laughing. \"I averaged 10 points for four years. I mean, the best player in the world, he better be able to score 10 points.\"...\nDRAMA KINGS\nAfter going 7-10 in March, when they played 12 road games, the Cavs are 3-0 in April. Lue was asked if he feels better than he did a week ago.\n\"I feel good about this team all the time,\" he said. \"It's like a soap opera, but I love this team. We know what we're capable of doing.\"\nThe Cavs have had more than their share injuries and off-the-floor intrigue, which has kept things interesting, to say the least.\n\"It's just who we are,\" Lue said. \"We love the drama.\"\nUP NEXT\nMagic: Return home to host Brooklyn on Thursday.\nCavaliers: Cleveland is 2-1 against Boston this season. The Celtics won the most recent meeting, 103-99 on March 1.",
  "source": "espn_api",
  "crawled_at": 1764995809.1394
}