{
  "game_id": "0021400910",
  "espn_id": "400579202",
  "date": "Mar 05, 2015",
  "matchup": "POR vs. DAL",
  "headline": "Blazers win fifth straight with 94-75 victory over Mavericks",
  "body": "PORTLAND, Ore. -- The mood was somber in the Trail Blazers' locker room following their victory over the Dallas Mavericks. The win had come at a cost, with Wesley Matthews lost for the season because of a ruptured Achilles tendon.\n\"I make that same cut a hundreds of thousands of times in my life,\" Matthews said. \"I felt the initial pop. And you guys could probably tell on the replay. I looked back -- it feels like someone's kicked you. I was praying. I was praying someone was back there.\"\nLaMarcus Aldridge had 17 points and 12 rebounds and the Blazers pulled away in the second half for a 94-75 victory for their fifth straight victory.\nBut shortly after came the news about Matthews, who had started every game this season. Matthews was averaging 16.1 points and 3.7 rebounds for the Blazers going into the game.\n\n\"It's tough, man. He's the heart and soul of this team, he brings a lot to this team,\" Aldridge said. \"I've played with him seven, eight years now, so not having him out there is going to be tough.\"\nNicolas Batum added 15 points and a season-high 12 rebounds for Portland, which had four players in double figures despite coming off back-to-back games.\nMonta Ellis and Amare Stoudemire each had 12 points for the Mavericks, who saw the return of veteran center Tyson Chandler after a three-game absence.\nChandler, who was out with a left hip injury, finished with four points and 14 rebounds.\n\"This is a difficult matchup, period,\" Mavericks coach Rick Carlisle said. \"We've got to stick together when it's not going well. We've got to fight through this.\"\nThe Mavericks remained without Chandler Parsons, who continues to nurse a left ankle injury that has kept him out of six games so far and should also cause him to miss Friday night's matchup against the Warriors.\nHowever, the Mavericks said he could make his return Sunday when the team visits the Lakers. In his absence, Dallas continued to lean on veteran Richard Jefferson.\nPortland went up 80-63 on Alonzo Gee's fourth-quarter dunk and Dallas could not catch up. The Blazers were coming off a come-from-behind 98-93 overtime victory against the Clippers in Los Angeles the night before.\n\"Our defense throughout the game was locked in as far as what we wanted to accomplish individually and collectively,\" coach Terry Stotts said about the game. \"The defense really spurred our offense in the third quarter and helped us build a lead.\"\nThe teams had kept close throughout the first half. Dallas went ahead 23-17 late in the first quarter on Devin Harris' short jumper, but couldn't extend the margin. Charlie Villanueva's put-back layup gave the Mavericks a 33-28 lead in the second, but Portland pulled in front 38-36 on Matthews' jumper and led 40-36 at the break.\nEarly in the third quarter, Matthews was helped from the court.\nThe game was tied at 40 when he left, and the Blazers responded with a 12-4 run capped by Batum's layup to go ahead 52-44. Portland extended the lead to 69-55 on Dorell Wright's 3-pointer.\n\"I thought out defense was very solid, so if we could ever get our offense going we could make things very difficult for them. But our offense never really got going,\" Chandler said.\nDallas was coming off a 102-93 victory at home against New Orleans, paced by Ellis with 20 points.\nPortland and Dallas had split the previous two meetings this season.\nTIP-INS\nMavericks: It was the first of a three-game Western road swing for the Mavs. ... Dallas had won two of the previous three games at the Moda Center. ... The Mavericks scored just 13 points in the second quarter, a season low.\nTrail Blazers: Aldridge made a 3-pointer in the first quarter to snap 20 straight misses from the perimeter. ... Portland improves to 26-6 at home. ... It was Aldridge's 30th double-double this season.\nLOOKING AT THE STADINGS\nPortland remained in third place in the Western Conference, a half-game up on Houston with 20 games to go. The Mavericks sat in the sixth spot behind the Clippers.\n\"We're always a couple of games away from third and a couple of games away from seventh,\" Chandler said. \"We've got to find a way to climb the ladder. We're a veteran group so I believe we'll find a way to do that.\"\nUP NEXT\nMavericks: Visit the Golden State Warriors on Friday night.\nTrail Blazers: Visit the Minnesota Timberwolves on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764992052.499229
}