{
  "game_id": "0021800321",
  "espn_id": "401071002",
  "date": "Nov 30, 2018",
  "matchup": "DET vs. CHI",
  "headline": "Drummond, Griffin lead Pistons to 107-88 rout of Bulls",
  "body": "DETROIT --  The Detroit Pistons had every reason to look past Friday night's game against the Chicago Bulls.\n\nThe Bulls were coming in with a 4-17 record, having lost four in a row, and Detroit was to host the Golden State Warriors one night later. To make that matchup even more distracting, the Warriors expected Stephen Curry to return to the lineup on Saturday.\n\nBut the Pistons kept their focus. Reggie Jackson set the early tone with eight points in the first four minutes, and Detroit never trailed in a 107-88 victory.\n\n\"We have to play with urgency every night,\" Blake Griffin said. \"We can't worry about if we're playing the next night or who we might be playing. We have to go out there and win the game we're playing.\"\n\nJackson scored 17 of his 20 points in the first half, impressing his coach in the process.\n\n\"We know Reggie isn't 100 percent after sitting out so long with that (ankle) injury,\" Pistons coach Dwane Casey said. \"He didn't really start working out until July, and he didn't have any contact until training camp. He's not going to be at full speed until Christmas or New Year's.\"\n\nDetroit also got big nights from their two post players as they won their fourth straight game. Andre Drummond had 19 points and 19 rebounds and Griffin added 20 points and 10 rebounds.\n\nCasey was able to use his reserves for most of the fourth quarter, but he wasn't worried about fatigue against the Warriors.\n\n\"Energy isn't usually a problem when you are playing that team at home,\" he said. \"They are the champs and they've got a ton of talent, especially with Steph coming back.\"\n\nWendall Carter scored a career-high 28 points for the Bulls, who lost their fifth straight. Chicago also plays Saturday, traveling to Texas to face the Houston Rockets.\n\nDetroit led 55-40 at the half, but the Bulls adjusted at the start of the third quarter, running their offense through pick-and-rolls for Zach LeVine and Carter.\n\n\"Wendell was hot, so I had to get him the ball,\" LeVine said. \"He had a career night with all those points and with good defense, but the rest of us didn't play well enough to win.\"\n\nCarter had 15 points in the first 4:40 of the third quarter, with LeVine adding seven assists. That got Chicago within 62-57, but Carter committed his second and third fouls in the process.\n\n\"I give our guys credit for getting back into the game when our outside shots weren't falling,\" Chicago coach Fred Hoiberg said. \"Wendell was terrific. I was proud of the way he went out there and got us back into the game.\"\n\nCarter stayed in the game, but the Pistons began collapsing on him and were able to push the lead back to 79-61 before he scored again.\n\n\"We had a lapse for a few minutes there, but that young man also made a lot of plays,\" Casey said. \"(Drummond) has to be a little quicker sliding over in front of him, but we were mainly forcing him to take shots that we're happy to give him. He just knocked them down. He's going to be a good player in this league.\"\n\nDetroit led by as many as 23 points in the fourth quarter.\n\n\"We did a good job defensively, and that made it a lot easier for us on the offensive end,\" Griffin said. \"We were getting stops, getting out on the break and getting easy baskets. That's always good to see.\"\n\nPISTONS HOPING FOR MORE BIG CROWDS\n\nThe Pistons are expecting a rare sellout on Saturday for the Warriors, and Casey hopes there will be more big crowds to come.\n\n\"It is easy to get fans to come out on a Saturday night to watch that team,\" he said. \"What we need to do is win enough games to get the respect of our fans so they will come out and watch us play anyone, even on a Monday or Tuesday. That's when you need to have a hot gym.\"\n\nTIP INS\n\nBulls: Chicago coach Fred Hoiberg said forward Lauri Markkanen practiced with the team on Thursday and took part in Friday's shootaround. Markkanen has missed the entire season with a sprained right elbow. ... The Bulls missed 17 of their first 19 3-point attempts.\n\nPistons: Blake Griffin scored 20-plus points for the 15th time in 19 games this season, while Drummond had his 10th game with at least 15 points and 15 rebounds.\n\nUP NEXT\n\nBulls: At Houston on Saturday.\n\nPistons: Host Golden State on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994708.549657
}