{
  "game_id": "401810096",
  "espn_id": "401810096",
  "date": "Nov 17, 2025",
  "matchup": "CLE vs MIL",
  "headline": "Mitchell's 37 points power Cavaliers to victory over Bucks as Antetokounmpo exits with injury",
  "body": "CLEVELAND -- — Donovan Mitchell scored 37 points and the Cleveland Cavaliers rallied for a 118-106 victory over the Milwaukee Bucks, who saw All-Star forward Giannis Antetokounmpo leave Monday night's game due to injury.\n\n\r\n              Antetokounmpo immediately went to the locker room with 3:03 remaining in the second quarter and did not return due to a left groin strain. The 14-year veteran came into the game tied for second in the league and leading the Eastern Conference in scoring at 32.6 points per game.\n\n\r\n              Coach Doc Rivers said there would further testing for Antetokounmpo on Tuesday.\n\n\r\n              Antetokounmpo was listed as probable on the injury report due to left knee patellar tendinopathy, but finished with 14 points, five rebounds and four assists in 13 minutes.\n\n\r\n              Mitchell, second in the Eastern Conference in scoring at 30.4 points per game, had 25 points in the first half. It is the fifth time this season he has had at least 35 points in a game.\n\n\r\n              Sam Merrill added 20 points, including six 3-pointers, for the Cavaliers, who have won three of their last four. Merrill had 11 points in the final 12 minutes as Cleveland took control.\n\n\r\n              The Bucks, who have dropped three of four, had seven players in double figures. Ryan Rollins led the way with 22 points and Myles Turner added 15.\n\n\r\n              The game was tied at 88 before Cleveland took control with a 12-3 run late in the third and early in the fourth quarter. The Cavaliers' largest lead was 14 points late in the game.\n\n\r\n              Milwaukee jumped out to a 30-16 advantage with three minutes remaining in the first quarter before Cleveland began rallying back.\n\n\r\n              Cleveland has won seven straight over Milwaukee and is 19-4 against Central Division foes since March 2024.\n\n\r\n              Up Next\r\n              Bucks: Host Philadelphia on Thursday.\n\n\r\n              Cavaliers: Host Houston on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042640.86015
}