{
  "game_id": "0021900060",
  "espn_id": "401160702",
  "date": "Oct 30, 2019",
  "matchup": "TOR vs. DET",
  "headline": "Siakam scores 19 of 30 in 3rd, Raptors beat Pistons 125-113",
  "body": "TORONTO --  Raptors forward Pascal Siakam scored 30 points five times last season, when he played in 80 games.\n\nThanks to a huge third quarter Wednesday night, Siakam already has an NBA-leading three 30-point performances in five games this season.\n\nSiakam finished with 30 points, including 19 in the third, and Fred VanVleet had 13 points and 11 assists as Toronto beat the Detroit Pistons 125-113 for its fourth victory in five games.\n\nSiakam made eight of 12 shots in the third, including three of four from 3-point range, as the defending NBA champions outscored Detroit 37-27 to take a 101-85 lead into the fourth.\n\n\"I feel comfortable,\" Siakam said. \"The more I get in situations like that, the more comfortable I get. Just having the coach trust me to have the ball in my hands, and my teammates also, it feels good.\"\n\nRaptors coach Nick Nurse said Siakam is becoming \"a prime-time scorer.\"\n\nSiakam took half of Toronto's 24 shots in the third.\n\n\"He wanted the ball every possession,\" Toronto guard Kyle Lowry said.\n\nLowry scored 20 points, Serge Ibaka and Norman Powell each had 19 and OG Anonuby added 13 for the Raptors. Toronto shot 59% from the field (51 for 86), its best mark of the season. Siakam finished 13 of 21, Ibaka went 9 for 15 and Powell was 7 for 10.\n\n\"Our individual defense was lacking,\" Pistons coach Dwane Casey said. \"Whoever was out there, we weren't guarding them.\"\n\nDetroit also committed 20 turnovers, leading to 29 points for Toronto.\n\n\"You can't survive that,\" Casey said.\n\nAndre Drummond had 21 points and 22 rebounds for the Pistons, who have lost three of four. Derrick Rose added 16 points and 10 assists.\n\nLangston Galloway scored 17 points and Markieff Morris had 16 as Casey finished on the losing end of a Pistons-Raptors game for the first time in three seasons.\n\nCasey coached Toronto to four wins over Detroit during the 2017-18 season but was fired after the Raptors lost in the second round of the playoffs.\n\nAfter being chosen NBA Coach of the Year for his 59-win regular season with Toronto, Casey ended up being hired by the Pistons. Detroit won all three meetings with the Raptors last season, including a 106-104 victory north of the border last November in Casey's return to Toronto.\n\nSiakam scored nine points in the first as the Raptors led 37-28 after one.\n\nMorris scored nine points in the second but Lowry and Powell each had six for the Raptors, who led 64-58 at halftime.\n\nSiakam had seven straight points as Toronto outscored Detroit 15-4 over the first 4:11 of the second half, turning a six-point edge into a commanding 79-62 lead.\n\nTIP-INS\n\nPistons: G Reggie Jackson (lower back tightness) did not accompany the team to Toronto. ... F Sekou Doumbouya (concussion protocol) missed his fifth straight game. ... F Blake Griffin (hamstring and knee injuries) traveled with the team to Toronto and participated in the morning shootaround.\n\nRaptors: C Marc Gasol banged his left knee in a first-quarter collision but returned in the second. ... Anunoby made his first five shots.\n\nFAST AND FURIOUS\n\nToronto outscored Detroit 23-11 on fast-break points. It's the fourth time in five games Toronto has scored 20 or more fast-break points.\n\n20-20\n\nDrummond had 20 or more points and 20 or more rebounds in the same game for the second time this season and 34th time in his career.\n\nSPECIAL BOND\n\nLowry said he still shares a bond with Casey.\n\n\"He's always going to be real special to me, no matter where he is or what part of life we're both in,\" Lowry said.\n\nMAKING HIS CASE\n\nCasey hadn't been the losing coach in a meeting between the teams since a 102-101 Detroit win in Toronto on Feb. 12, 2017, when Stan Van Gundy coached the visitors.\n\nMILESTONE MOMENT\n\nThis was the 5,000th game in Pistons history. They are 2,422-2,578 since their 1957 debut.\n\nUP NEXT\n\nPistons: Visit the Chicago Bulls on Friday.\n\nRaptors: At the Milwaukee Bucks on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995665.006818
}