{
  "game_id": "0022300164",
  "espn_id": "401584792",
  "date": "Nov 08, 2023",
  "matchup": "MIA @ MEM",
  "headline": "Bam Adebayo scores 30 points, Jaime Jaquez Jr. hits late 3-pointer as Heat beat Grizzlies 108-102",
  "body": "MEMPHIS, Tenn. -- — Bam Adebayo had 30 points and 11 rebounds and the Miami Heat held off the Memphis Grizzlies 108-102 on Wednesday night for their first road victory of the season.\n\n\r\n              Adebayo had 16 points in the fourth as Miami weathered a pair of Memphis rallies. The Grizzlies cut it to 105-102 on Santi Aldama's 3-pointer with 35.5 seconds left, but Miami rookie Jaime Jaquez Jr. countered with a 3 from the left corner with 18.4 left to seal it.\n\n\r\n              “I knew I was going to get an opportunity because of the way (the Grizzlies) were playing me. Not looking at me as a threat,” said Jaquez, the 18th overall pick in this year's draft. \"When I got the shot, I just continue to have confidence in my ability. I work too hard to not have faith in myself to shoot that shot.”\n\n\r\n              Kyle Lowry had 17 points, 11 rebounds and nine assists for Miami, and Jimmy Butler added 15 points.\n\n\r\n              Jaren Jackson Jr. led Memphis with 28 points. Desmond Bane had 15 points and Luke Kennard 13 as the Grizzlies remained winless at home. Bane, the Grizzlies leading scorer was 4 of 16 for the game and only 2 of 8 from outside the arc.\n\n\r\n              “We didn't have a lot of guys play well,” Memphis coach Taylor Jenkins said. “Credit the Heat. Their physicality really bothered us. I think we were frantic at times. Just couldn't get a rhythm going.”\n\n\r\n              Although Memphis occasionally chipped away at the Miami advantage, particularly in the third quarter, the Heat would craft a run each time. But Memphis pulled to 77-76 heading into the fourth.\n\n\r\n              That was part of a 17-4 run spanning the third and fourth quarters where Memphis overtook the Heat. At that point, the teams settled into a pattern of exchanging leads. But Miami had its own rally to build a large advantage. Miami coach Erik Spoelstra noted Adebayo's play, but also from Jaquez, the rookie from UCLA, on both ends of the floor.\n\n\r\n              “He has some poise, some savviness about him defensively,” Spoelstra said of Jaquez, “so he can play with the vets. ... even though he's a rookie.”\n\n\r\n              The Heat lost starting guard and leading scorer Tyler Herro when he rolled his right ankle on a first-quarter drive. He limped to the locker room and didn't return.\n\n\r\n              In the locker room after the game, Herro was on crutches with a wrap around the injured ankle. He grimaced in pain as he dressed. He called it “unfortunate” that he stepped on Jaren Jackson Jr.'s foot, causing his ankle to roll. He said he will probably be out “a couple of weeks.”\n\n\r\n              “It was something I felt right away when it happened,” Herro said. “I heard something crunching and cracking in my ankle.”\n\n\r\n              While Miami won its third straight and ended its road woes at least for one night, Memphis continued to suffer through a miserable start to the season. The Grizzlies, who were dominant at home last season, still haven't chalked up a home win and have started the season 1-7.\n\n\r\n              “We have a group that fights to the very end,” Kennard said. \"It was a little too late there at the end. Three were spurts in the game that we were kind of out of it, and they go on runs.\n\n\r\n              “We stayed with it to the end of the game. It's definitely a tough loss. Being 1-7 isn't where we want to be.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Atlanta on Saturday.\n\n\r\n              Grizzlies: Host Utah on Friday in the NBA In-Season Tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995393.4720619
}