{
  "game_id": "0022200419",
  "espn_id": "401468574",
  "date": "Dec 14, 2022",
  "matchup": "MIA @ OKC",
  "headline": "Herro makes 9 3s, scores 35 points to lead Heat past Thunder",
  "body": "OKLAHOMA CITY -- — Tyler Herro made a career-high nine 3-pointers, hit the go-ahead jumper and scored 35 points in the Miami Heat’s 110-108 victory over the Oklahoma City Thunder on Wednesday night.\n\n\r\n              Herro made a mid-range jumper to finish the scoring with 4.9 seconds left. “The play was drawn up for me to shoot it,” Herro said. “It was one-on-one, so I felt like I had an advantage.”\n\n\r\n              Oklahoma City’s Shai Gilgeous-Alexander missed a mid-range jumper, and Josh Giddey’s putback rimmed out at the buzzer.\n\n\r\n              “I thought I felt contact,” Gilgeous-Alexander said. “I guess the ref didn’t think so. It was tough.”\n\n\r\n              The Heat made a season-high 24 3-pointers — with Herro going 9 of 17 — in sending the Thunder to their fourth straight loss. Miami star Jimmy Butler sat out to rest his right knee.\n\n\r\n              “There’s been a little bit more intent of getting to our actions and finding the open guy without missing the moment,” Miami coach Erik Spoelstra said. “We were finding our open shooters in those open windows that close very quickly in this league.”\n\n\r\n              Gilgeous-Alexander led Oklahoma City with 27 points.\n\n\r\n              Herro began the second quarter with a personal 11-0 run to help Miami pull away. He capped the scoring spree with a corner 3-pointer.\n\n\r\n              Miami led by 21 points in the second quarter and was up 64-52 at the half.\n\n\r\n              Oklahoma City opened the third quarter on a 10-0 run and led 78-77 at the 3:42 mark. Miami regained control to take an 86-84 lead into the fourth quarter.\n\n\r\n              “I thought the way we attacked in the second half was excellent,” Oklahoma City coach Mark Daigneault said. “Our defense was much better and more alert in the second half. It was not a perfect 48 minutes, but I thought our team really course corrected tonight and gave ourselves a great chance to win the game against a high-quality team.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: F/C Darius Bazley made his first start of the season. He scored 12 points. … F/C Jeremiah Robinson-Earl sat out with a sprained right ankle. … F Kenrich Williams missed his fifth straight game with a sprained right knee.\n\n\r\n              Heat: Duncan Robinson played after he missed the previous two games with a sprained left ankle. He scored 14 points.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Minnesota on Friday night.\n\n\r\n              Heat: At Houston on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995195.805588
}