{
  "game_id": "0022200047",
  "espn_id": "401468202",
  "date": "Oct 24, 2022",
  "matchup": "CHI vs. BOS",
  "headline": "DeRozan, Vucevic lead way as Bulls beat Celtics 120-102",
  "body": "CHICAGO -- — The Chicago Bulls looked as if they were on their way to a blowout loss to the Boston Celtics. The game turned out to be a romp, just not the kind that it looked like it would be.\n\n\r\n              DeMar DeRozan scored 25 points, Nikola Vucevic added 18 points and 23 rebounds, and Chicago wiped out a big early deficit to beat Boston 120-102 on Monday night.\n\n\r\n              The Bulls went from trailing by 19 in the first quarter with Jayson Tatum providing an early spark for Boston to leading by 16 near the end of the half. They then went on another big run after the lead dwindled to three early in the third and handed the Celtics their first loss after a 3-0 start.\n\n\r\n              “It's a step toward what we've been trying to build,” said Vucevic, who turned 32 on Monday. “Obviously, I don't think our identity's been established yet. I think there's still a ways to go. We have to work on it. We're gonna handle adversity many times more in the future. We have to try to find a way to respond each time.”\n\n\r\n              Ayo Dosunmu scored 22. Zach LaVine, playing his second game after missing the first two, added 19 points, helping the Bulls stop a two-game skid and pick up their first win since the opener at Miami.\n\n\r\n              Tatum, averaging an NBA-leading 34.7 points coming in, scored 26. The three-time All-Star had 15 in the first quarter. Jaylen Brown added 21 points on his 26th birthday. But interim coach Joe Mazzulla and Grant Williams got ejected.\n\n\r\n              TECHINICAL-LY SPEAKING\n\n\r\n              Mazzulla picked up two technicals with just under five minutes left in the third quarter. Vucevic fouled Brown attempting to block a shot. But there was no technical against Vucevic when he swung the ball as he held it with both hands above his head.\n\n\r\n              Mazzulla went onto the court and made “unsportsmanlike comments\" that led to the first technical, crew chief Marc Davis told a pool reporter. Davis said he got a second technical because he “continued to point and complain.\"\n\n\r\n              Mazzulla said he was trying to get the referee's attention and needs to do a better job keeping his composure. He also said he did not use any obscenities.\n\n\r\n              Williams got tossed early in the fourth after he was called for an offensive blocking foul. He jumped in protest, and Davis said he made “intentional physical contact” with referee Cheryl Flores.\n\n\r\n              BULLS RESPOND\n\n\r\n              Marcus Smart cut it to 69-66 with a 3-pointer to finish a 17-4 run that started just before halftime. But the Bulls responded with a 15-2 run. DeRozan hit both technical free throws to make it 84-68 after Mazzulla got ejected. \n\n\r\n              The Celtics looked like they were on their way to an easy win, leading 35-16 with about 3:30 to go in the opening quarter after Marcus Smart pulled up for a 3. But Chicago turned it around in a huge way.\n\n\r\n              The Bulls led 65-49 in the final minute of the half before Smart drove for a layup and banked in a 3 at the buzzer.\n\n\r\n              “It's just all about the mentality, staying resilient, continuing to go, continue to trust in our defensive capabilities and just keep playing,” Dosunmu said. “They made a run. But we knew we were gonna make a run, too.”\n\n\r\n              TIP-INS\n\n\r\n              Celtics: C Al Horford was not listed on the injury report after missing a game because of low back stiffness. \n\n\r\n              Bulls: The Bulls' ability to develop cohesion in the early going could be hamstrung by LaVine's left knee issue. Besides missing games during busy stretches, the two-time All-Star might be limited in shootarounds and practices at least for now, after he had surgery in May. “We've got to manage his health,” coach Billy Donovan said. “That's the most important thing. I think for us, it's getting into that routine of what is best to keep him at a place where he's feeling good. Certainly, the more load that he has away from games, that's the part that's got to be managed.” \n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Cleveland on Friday.\n\n\r\n              Bulls: Host Indiana on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994299.075349
}