{
  "game_id": "0022300115",
  "espn_id": "401584743",
  "date": "Nov 01, 2023",
  "matchup": "DET vs. POR",
  "headline": "Shaedon Sharpe has big second half in Trail Blazers' comeback victory over Pistons",
  "body": "DETROIT -- — Shaedon Sharpe scored 26 of his 29 points in the second half and the Portland Trail Blazers overcame an 18-point deficit to beat the Detroit Pistons 110-101 on Wednesday night.\n\n\r\n              Sharpe was forced to pick up his offensive game with Scoot Henderson missing the second half because of sprained right ankle.\n\n\r\n              “They beat up on us in the first half, and I challenged my guys at halftime,” Trail Blazers coach Chauncey Billups said. “We turned it around and Shaedon was incredible. He had to carry us and he did it.”\n\n\r\n              Former Piston Jeremi Grant added 24 points for the Trail Blazers, and Deandre Ayton had 16 points, 11 rebounds five steals and a block in his first game against Pistons coach Monty Williams since they both left the Phoenix Suns.\n\n\r\n              Cade Cunningham had 30 points for Detroit, but missed 16 of 27 shots and turned the ball over six times. Detroit had 10 turnovers in the second half, including five from Cunningham.\n\n\r\n              “The turnovers are starting to get concerning because of the timeliness,” Williams said. “I might be playing guys too many minutes because they looked tired.”\n\n\r\n              The Pistons shot 37.8% in a 42-point second half.\n\n\r\n              “Cade really hurt us in the first three quarters, but Toumani (Camara) came in and was able to match up with physically,” Billups said. “He stayed with him step by step and made him work for everything.”\n\n\r\n              Portland trailed by 12 at halftime, but outscored the Pistons 36-25 to pull to 84-83 at the end of the third. Sharpe had 15 points in the quarter as the Trail Blazers shot 68.2%.\n\n\r\n              “He had a really good second half, and I got too relaxed on defense a couple times,” Pistons rookie Ausar Thompson said. “I've got to be better than that, because I know what he's capable of doing.”\n\n\r\n              Cunningham had five points in the first two minutes of the fourth. but the Trail Blazers took a 94-93 lead on Grant's 3-pointer with 6:51 to play. Portland moved the margin to four on Sharpe's free throws with 2:43 left,\n\n\r\n              Cunningham missed a layup that would have cut it to 104-103 with 1:23 to play, and Camara grabbed an offensive rebound, drew a foul and made both free throws. After Joe Harris' miss, Malcolm Brogdon put it away with a short jumper.\n\n\r\n              Detroit led by 18 in the second quarter before setting for a 59-47 halftime lead.\n\n\r\n              Billups said after the game that he didn't know the severity of Henderson's ankle injury. Pistons guard Alec Burks missed the game with left forearm soreness.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host Memphis on Friday and Sunday nights.\n\n\r\n              Pistons: At New Orleans Pelicans on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995799.277802
}