{
  "game_id": "0021801117",
  "espn_id": "401071790",
  "date": "Mar 27, 2019",
  "matchup": "POR @ CHI",
  "headline": "Blazers get emotional boost from Nurkic, then win",
  "body": "CHICAGO -- The Portland Trail Blazers enjoyed a feel-good moment before the game when they got in some FaceTime with Jusuf Nurkic and followed that up with an easy victory. Considering the circumstances, it was definitely not a bad night.\nSeth Curry scored a season-high 20 points and the Trail Blazers beat the Chicago Bulls 118-98 Wednesday evening.\nStill shaken by Nurkic's gruesome leg injury that resulted in a fractured left tibia and fibula two nights earlier in a double-overtime home victory over the Brooklyn Nets that secured Portland's sixth straight playoff appearance, the Blazers made it look easy against a short-handed team.\nCurry made four 3-pointers, Rodney Hood added 15 points and Enes Kanter and Zach Collins each had 13 points. Portland won its fifth in a row, even though Damian Lillard scored a season-low 11.\nSeeing Nurkic gave them just the lift they needed, even if there were some audio issues.\n\"It was cool,\" Curry said. \"It was a little awkward. Unfortunately, we couldn't hear. The volume wasn't working, so we couldn't hear what he was saying. But it was good to let him know we were thinking about him before we headed out there. That pregame huddle was a good moment for everybody.\"\nChicago's Shaquille Harrison set career highs with 21 points and 10 rebounds. Robin Lopez had 15 points and nine rebounds. But with mostly reserves in the lineup, the Bulls lost for the eighth time in 10 games.\nChicago announced afterward that forward Lauri Markkanen will miss the remainder of the season after experiencing a rapid heart rate and fatigue.\nMarkkanen remained overnight in Toronto after exiting Tuesday night's loss to the Raptors. He was evaluated in the training room by the Bulls' medical staff and Toronto's team physician and underwent more tests at a hospital. He also was examined Wednesday in Chicago, and he will miss the remaining six games.\nMarkkanen joins a long list of unavailable Bulls players. Wendell Carter Jr., Chandler Hutchison and Denzel Valentine all had season-ending injuries.\nLeading scorer Zach LaVine (bruised right thigh, right knee tendinitis), Otto Porter Jr. (strained right rotator cuff) and Kris Dunn (back) also were unavailable for the Bulls on Wednesday.\n\"[It's] very tough, because you got some of our core guys that's out right now,\" Harrison said. \"But it's the NBA. And the next guy is the reason why these guys are on a roster, the reason why I'm on a roster. Because when your time is called, it's time to step up. And you can't really complain about much and keep it forward and try to get some wins.\"\nEARLY LEAD\nThird in the Western Conference behind the Golden State Warriors and Denver Nuggets, the Trail Blazers led 27-14 after the first quarter. They went on a 13-3 run to turn a 12-9 lead into a 25-12 advantage, with Hood capping it with a 16-footer and 3-pointer.\nIt was the lowest-scoring first quarter for the Bulls, and things didn't get better after that.\nCurry and Kanter made 3s for Portland in an 8-0 run to start the second quarter, and the Blazers took a 59-41 lead to the locker room.\n\"Obviously, Chicago is undermanned,\" Portland coach Terry Stotts said. \"That's a game we should have won and did.\"\nTIP-INS\nTrail Blazers: The Trail Blazers completed a two-game sweep, and they have won 13 of the past 16 against Chicago. ... Portland held the Phoenix Suns to nine points in the first quarter on Dec. 6.\nBulls: Coach Jim Boylen said Markkanen was in his office at 2 p.m. and wanted to play against Portland. ... The Bulls' previous season low for points in the first quarter was 16 against the Orlando Magic on Jan. 2. Their low for any quarter was seven against the Houston Rockets on Nov. 3.\nUP NEXT\nTrail Blazers: At the Atlanta Hawks on Friday night.\nBulls: Host the Raptors on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995156.363111
}