{
  "game_id": "0022401097",
  "espn_id": "401705663",
  "date": "Apr 01, 2025",
  "matchup": "ATL vs. POR",
  "headline": "Sharpe and Avdija lead the Trail Blazers to a 127-113 win over the Hawks",
  "body": "ATLANTA -- — Shaedon Sharpe had 33 points and 10 rebounds and Deni Avdija finished with 32 points, 15 rebounds and 10 assists as the Portland Trail Blazers beat the Atlanta Hawks 127-113 on Tuesday night.\n\n\r\n              Toumani Camara scored 18 points and Donovan Clingan and Dalano Banton added 11 points apiece as Portland snapped a four-game skid.\n\n\r\n              Trae Young had 29 points and 15 assists for Atlanta. Dyson Daniels had 22 points and 10 rebounds, Vit Krejci scored 13 points and Onyeka Okongwu 12 in the loss.\n\n\r\n              The Trail Blazers took the lead with 8:26 remaining in the second quarter and never looked back. Portland led 57-54 at halftime behind 16 first-half points by Avdija. \n\n\r\n              Sharpe led the way in the second half, scoring 17 points in the last two quarters.\n\n\r\n              Takeaways\r\n              Trail Blazers: Portland is four games back of idle Sacramento for the 10th and final spot in the play-in tournament that starts April 15. The Trail Blazers won both their games against the Hawks.\n\n\r\n              Hawks: With Atlanta’s loss, the Indiana Pacers clinched a playoff spot. The Pacers, second in the Central Division behind Cleveland, are in fourth place in the Eastern Conference standings at 44-31. The Hawks have secured a postseason berth.\n\n\r\n              Key moment\r\n              Portland led 57-54 at halftime and took control with a 40-30 third-quarter. The Trail Blazers led by as many as 18 points.\n\n\r\n              Key stat\r\n              The Trail Blazers had a 66-58 scoring edge in the paint.\n\n\r\n              Up next\r\n              Portland plays the fourth game of a five-game trip on Thursday in Toronto. Atlanta is at Dallas on Wednesday.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997911.942413
}