{
  "game_id": "0022400314",
  "espn_id": "401704880",
  "date": "Dec 01, 2024",
  "matchup": "LAC vs. DEN",
  "headline": "Harden scores 37 and Clippers overcome Jokic's triple-double to beat Nuggets 126-122",
  "body": "INGLEWOOD, Calif. -- — James Harden scored 39 points — making all 13 of his free throws — and the Los Angeles Clippers overcame Nikola Jokic’s triple-double to beat the Denver Nuggets 126-122 on Sunday night.\n\n\r\n              Jokic finished with 28 points, 14 rebounds and 11 assists for his eighth triple-double of the season. \n\n\r\n              Harden narrowly missed a triple-double of his own, finishing with nine rebounds and 11 assists.\n\n\r\n              Norman Powell added 28 points for the Clippers in his return after missing six games because of an injury.\n\n\r\n              Harden made three 3-pointers in the first half, giving him 3,000 in his career.\n\n\r\n              The Clippers made three consecutive 3-pointers early in the fourth to lead by seven. Jokic hit a 3-pointer and fed Aaron Gordon for a dunk to draw the Nuggets within one. \n\n\r\n              After the Clippers went up by seven, Harden turned the ball over under pressure by Gordon in his return from injury. The Nuggets missed their first shot, got the offensive rebound and Christian Braun scored, leaving them trailing 123-121 with 19 seconds remaining.\n\n\r\n              The Nuggets opened the third with a 21-11 run to put the Clippers down 10. But Los Angeles rallied behind six 3-pointers — three each by Harden and Powell — to lead 92-90 going into the fourth.\n\n\r\n              Takeaways\r\n              Nuggets: They've now lost twice to the Clippers.\n\n\r\n              Clippers: They twice owned leads of 11 points in the first two quarters only to watch Denver tie it at halftime. But they stayed steady down the stretch, making 8 of 9 free throws.\n\n\r\n              Key moment\r\n              Jokic was 2 of 4 from the free-throw line, missing a crucial one with 9 seconds to go and the Nuggets down by three. \n\n\r\n              Key stat\r\n              The Clippers made 17 3-pointers while the Nuggets only attempted 21 from long range. \n\n\r\n              Up next\r\n              Nuggets host Golden State and Los Angeles hosts Portland in NBA Cup games on Tuesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998048.387537
}