{
  "game_id": "0022100469",
  "espn_id": "401360293",
  "date": "Dec 21, 2021",
  "matchup": "PHX @ LAL",
  "headline": "Booker, Ayton push Suns past Lakers 108-90",
  "body": "LOS ANGELES -- — Devin Booker continued to distance himself from a hamstring injury that cost him seven games, scoring 24 points with nine rebounds and seven assists as the Phoenix Suns earned a 108-90 victory Tuesday night over the Los Angeles Lakers.\n\n\r\n              Booker played 32 minutes and went 8 of 16 from the field one game after he was on the court for 26 minutes in his return Sunday during a blowout victory over the Charlotte Hornets.\n\n\r\n              “I feel great, man, and I think every game it’s going to feel better,” Booker said. “I’m just getting some runs up under me but we have a good team that makes it easy to mesh with and get back with. When you have the support of all 15 guys, plus the coaching staff, it gives you a lot more confidence when you’re out there.”\n\n\r\n              Deandre Ayton had 19 points and 11 rebounds, and Mikal Bridges scored 14 as the Suns won their fourth consecutive game and improved to 2-2 on the road since the end of their 18-game winning streak Dec. 3.\n\n\r\n              LeBron James scored 34 points for the Lakers, who lost their third game in a row as coach Frank Vogel remained in health and safety protocols for the second straight. Four Lakers players also are in protocols, including starting guard Avery Bradley.\n\n\r\n              “Obviously, we are in a rough patch right now with guys in and out of protocol, guys who are injured,” James said. “We just have to stay together until we become whole, or as whole as possible. But I love our fight. I thought we had a good fight tonight, we just couldn’t make enough plays.”\n\n\r\n              Russell Westbrook had 22 points and 10 rebounds for the Lakers, who were without star Anthony Davis for the second consecutive game. Davis is expected to miss at least four weeks with an MCL sprain in his left knee.\n\n\r\n              James injured his left ankle with 6:05 remaining in the third quarter when he came down on the right foot of the Suns’ Jae Crowder. He remained in the game but looked hobbled the rest of the way.\n\n\r\n              “Yeah, I’ll be ready for next game,” James said.\n\n\r\n              Losing Booker for 2 1/2 weeks could have sent the Suns spiraling backward, but they found success and still hold the best record in the NBA as Christmas approaches.\n\n\r\n              “I think a big part of it comes down to our team culture, how guys step into situations and we remain ourselves,” said Cameron Johnson, who also had 14 points. “You can see our identity on the court when we have everybody. It’s a group of guys that likes playing together and we play for each other.”\n\n\r\n              After a slow start and a 54-52 lead at halftime, the Suns led by as many as 13 in the third quarter on two occasions and carried an 85-73 lead into the fourth. The Lakers’ Carmelo Anthony was ejected in the third period when he argued a non-call after a shot attempt and received his second technical.\n\n\r\n              Phoenix’s lead reached 20 points for the first time at 100-80 with 5:17 remaining on Johnson's 3-pointer.\n\n\r\n              Chris Paul had 11 points and nine assists for the Suns, who face the Oklahoma City Thunder at home Thursday before their Christmas showdown in Phoenix against the Golden State Warriors. JaVale McGee had 10 points and 10 rebounds.\n\n\r\n              Veteran guard Isaiah Thomas scored three points on 1-of-11 shooting in his third game since signing with the Lakers on Friday. Talen Horton-Tucker had three points on 1-of-13 shooting for Los Angeles in his first game back from health and safety protocols.\n\n\r\n              “Yesterday was my first day out of the protocol and really today was my first (full) official day,” said Horton-Tucker, who entered averaging 11.3 points per game. “I’m just trying to get back into the groove of things.”\n\n\r\n              In just his second game of the season, Trevor Ariza had 12 points for the Lakers.\n\n\r\n              TIP-INS\n\n\r\n              Suns: After the Suns opened 0 of 9 from 3-point range, Booker made their first basket from long distance with 1:42 remaining in the first quarter. Phoenix missed 19 of its first 22 attempts from behind the arc before halftime. … Bridges opened 0 of 8 from the field but still reached double digits in points with 4:38 remaining in the first half.\n\n\r\n              Lakers: In addition to Horton-Tucker, C Dwight Howard also was activated from health and safety protocols. Kent Bazemore, Malik Monk and Austin Reaves remained in protocols, along with Bradley. … Vogel flew back Tuesday from Chicago where he was in quarantine after the Lakers played the Bulls on Sunday. … G Chaundee Brown was waived after playing in the previous two games and G Mason Jones was signed to a two-way deal.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Home vs. the Oklahoma City Thunder on Thursday.\n\n\r\n              Lakers: Home vs. the San Antonio Spurs on Thursday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993675.1967869
}