{
  "game_id": "0022300945",
  "espn_id": "401585573",
  "date": "Mar 12, 2024",
  "matchup": "MIL @ SAC",
  "headline": "De'Aaron Fox scores 29 points and the Kings snap a 15-game skid against the Bucks with a 129-94 win",
  "body": "SACRAMENTO, Calif. -- — De'Aaron Fox scored 29 points and the Sacramento Kings beat Milwaukee 129-94 on Tuesday night for their first win over the Bucks in more than eight years.\n\n\r\n              Sacramento had not defeated Milwaukee since Feb. 1, 2016, with the 15-game losing streak being the longest active streak for any team.\n\n\r\n              “I think defensively we did a great job,” Fox said. \"I think that fueled our offense. Obviously we scored 130 points, but even if we didn’t play that well offensively, if we have even below-average game, score 110, we still win this game by 15. ... I think this was one of the most complete games that we’ve played this year.\"\n\n\r\n              This game was never in doubt. The Kings never trailed and led by double digits since the midway point of the second quarter and built the lead to 30 points in the fourth quarter. \n\n\r\n              Domantas Sabonis had 22 points and 11 rebounds, setting a Kings single-season record with his 47th consecutive double-double. Jerry Lucas had set the mark in 1967-68.\n\n\r\n              “Night in, night out, he's come up big for us,” Fox said. “I think people are immune to it. No one outside of basically us talks about it. But that’s obviously a hard thing to do and there's not many people have done it. He comes ready to play every night.”\n\n\r\n              Malik Monk added 25 points off the bench.\n\n\r\n              The Kings have won three of four and trail Phoenix by just a half-game in the race for sixth place in the Western Conference. \n\n\r\n              Giannis Antetokounmpo had 30 points and 13 rebounds for the Bucks, who went 1/3 on a four-game California swing. Milwaukee shot 36.6% for the game and missed 32 of 39 from 3-point range.\n\n\r\n              “We deserved it tonight,” coach Doc Rivers said. “It's my fault. I didn’t get them prepared the way I should mentally. At shootaround, guys were talking about planes leaving. As a staff, we talked about it after shootaround that if our focus is not better than this morning, it’s going to be a long day. And it was a long day. So that’s on us.”\n\n\r\n              The one highlight for Milwaukee was a putback dunk in the closing minutes by rookie Andre Jackson Jr., whose head got above the rim on the play.\n\n\r\n              The Kings started fast offensively by making eight 3-pointers in the first quarter and building on the lead from there. Sacramento shot 66% in the first half and opened a 20-point lead late in the second quarter on a dunk by Sabonis. \n\n\r\n              The Kings led 75-56 at the half and were in control the rest of the way. \n\n\r\n              Both teams were short-handed, with Keegan Murray missing the game for Sacramento after spraining his left ankle on Sunday in Houston and Khris Middleton missing his 15th straight game for Milwaukee with a sprained left ankle. \n\n\r\n              Rivers said that Middleton has resumed practicing and is getting closer to making a return.\n\n\r\n              MarJon Beauchamp was also out for Milwaukee with back spasms and Sacramento's Trey Lyles left in the second quarter with a left knee injury and didn't return.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Philadelphia on Thursday night.\n\n\r\n              Kings: Host Los Angeles Lakers on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996108.573468
}