{
  "game_id": "401810116",
  "espn_id": "401810116",
  "date": "Nov 19, 2025",
  "matchup": "OKC vs SAC",
  "headline": "Gilgeous-Alexander scores 33 points, Thunder beat Kings to improve to 15-1",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 33 points and the Oklahoma City Thunder won their seventh straight game to improve to 15-1, beating the Sacramento Kings 113-99 on Wednesday night. \n\n\r\n              Chet Holmgren had 21 points and Lu Dort scored all 14 of his points in the second half, including 11 in the fourth quarter for the defending champion Thunder. They have won all three matchups with the Kings.\n\n\r\n              Dennis Schroder scored 21 points and DeMar DeRozan added 17 for the Kings, who lost their seventh straight. Kings big man Domantas Sabonis sat out because of soreness in his left knee. \n\n\r\n              The Thunder started the season with a pair of double-overtime wins and had some close calls before finally losing to Portland. Since the loss, they have won every game — with an average margin of 20.3 points. All have been by double digits. Included in the run is a 24-point victory over Golden State and a 29-point win over the Los Angeles Lakers on back-to-back nights last week at home.\n\n\r\n              Former Thunder star Russell Westbrook, as usual, got a warm reception from the Oklahoma City crowd during starter introductions. He was the league MVP in 2017 and a two-time scoring champion with the Thunder. He had another solid game in the familiar surroundings, posting seven points, 10 rebounds and six assists.\n\n\r\n              Sacramento's Zach LaVine made a shot from beyond halfcourt as the first half expired, but it was ruled that he shot it after the buzzer, and the Thunder maintained a 58-50 lead at the break.\n\n\r\n              Gilgeous-Alexander worked some magic late in the third quarter. He banked in a mid-range jumper from near the right side of the free throw line and was fouled and made the free throw to put the Thunder up 83-67. Oklahoma City took an 83-69 advantage into the fourth.\n\n\r\n              Up next\r\n              Kings: At Memphis on Thursday night.\n\n\r\n              Thunder: At Utah on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042658.244373
}