{
  "game_id": "401810004",
  "espn_id": "401810004",
  "date": "Nov 02, 2025",
  "matchup": "BKN vs PHI",
  "headline": "Kelly Oubre Jr. scores 29 points as 76ers defeat Nets 129-105",
  "body": "NEW YORK -- — Kelly Oubre Jr. scored 29 points, Tyrese Maxey had 26, and the Philadelphia 76ers defeated the Brooklyn Nets 129-105 on Sunday night.\n\n\r\n              Oubre made 9 of 11 field goals and had 22 points in the first quarter, but limped off the court after injuring his ankle at the buzzer in the third. The forward was cleared to return to the bench with 10 minutes remaining in regulation but did not reenter the game.\n\n\r\n              Quentin Grimes added 22 off the bench and VJ Edgecombe had 16 points for the 76ers, who have won five of their first six games to start the season.\n\n\r\n              Philadelphia played without Joel Embiid (left knee), who was held out due to injury management two nights after scoring 20 points in 25 minutes in a loss at Boston.\n\n\r\n              The 76ers fared well without their All-Star center, shooting 52% from the field and leading by as many 28 points.\n\n\r\n              Philadelphia started the third quarter with a 3-pointer from Maxey to go up 76-55 before the Nets went on an 18-7 run to cut the deficit to 83-73 with 3:07 left.\n\n\r\n              Grimes scored the next three baskets for the 76ers to increase the lead 90-78 at the end of the quarter. Philadelphia then started the fourth quarter with a 9-0 run, capped by a floater from Maxey with 9:39 left in regulation and put the game out of reach.\n\n\r\n              Cam Thomas had 29 points and Michael Porter Jr. and Terance Mann each had 17 for the struggling Nets, who fell to 0-6.\n\n\r\n              It is Brooklyn’s worst start since the 2015-16 season when they lost their first seven games.\n\n\r\n              Up next\r\n              76ers: Continues their three-game road trip at Chicago on Tuesday.\n\n\r\n              Nets: Host Minnesota to conclude their three-game homestand on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042545.420425
}