{
  "game_id": "0022400088",
  "espn_id": "401704654",
  "date": "Oct 26, 2024",
  "matchup": "MIA @ CHA",
  "headline": "Jimmy Butler's scores 13 of 26 points in fourth quarter as Heat hold off pesky Hornets 114-106",
  "body": "CHARLOTTE, N.C. -- — Jimmy Butler scored 13 of his 26 points in the fourth quarter, Tyler Herro added five 3-pointers and 22 points and the Miami Heat spoiled the Charlotte Hornets’ home opener with 114-106 victory on Saturday night.\n\n\r\n              Terry Rozier had 19 points and Bam Adebayo finished with 12 points and 11 rebounds for Miami (1-1). Butler added eight assists and eight rebounds.\n\n\r\n              LaMelo Ball had 27 points, eight rebounds and seven assists for the Hornets on an emotional night when they honored their late longtime public address announcer Pat Doughty, and showed livestream feeds on the arena scoreboard of a star-studded benefit concert for victims of Hurricane Helene taking place less than a mile away at Bank of America Stadium. One of the performers at the concert was musician Eric Church, a Hornets minority owner.\n\n\r\n              The Hornets (1-2) looked out of sync with 20 turnovers, and twice were whistled for 5-second calls after failing to get the ball in on side inbound plays.\n\n\r\n              Takeaways\r\n              Heat: After struggling in their season opener, the Heat began to put things together down the stretch, thwarting three different rallies by the Hornets with Butler, Herro and Duncan Robinson all hitting big 3s.\n\n\r\n              Hornets: Three games into the season and Charlotte's depth is already being tested with three starters — Brandon Miller, Mark Williams and Josh Green — all sidelined with injuries.\n\n\r\n              Key moment\r\n              After Tre Mann's pull-up jumper cut Miami's double-digit, fourth-quarter lead to three with 1:36 left, Herro knocked in a clutch 3-pointer from the top of the key. Ball's turnover led to two free throws for Butler. Rozier then added another 3 to seal the win.\n\n\r\n              Key stat\r\n              The Heat had 33 assists on their 40 baskets.\n\n\r\n              Up next\r\n              The Heat host Detroit on Monday night, while the Hornets host Toronto on Wednesday night. \n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996942.430002
}