{
  "game_id": "0022301040",
  "espn_id": "401585668",
  "date": "Mar 25, 2024",
  "matchup": "MEM @ DEN",
  "headline": "Jokic scores 29, Western Conference-leading Nuggets beat Grizzlies 128-103",
  "body": "DENVER -- — Nikola Jokic had 29 points, 11 rebounds and eight assists, Christian Braun scored 17 and the Denver Nuggets beat the Memphis Grizzlies 128-103 on Monday night.\n\n\r\n              Jokic, who exited with 27 seconds remaining in the third quarter and Denver leading by 21, finished two assists shy of his 23rd triple-double this season.\n\n\r\n              “I think his mindset is he’s going to play this game, but he’s also going to enjoy trying to help some of these other guys that maybe don’t get regular minutes and to make sure we’re getting the most out of everybody’s minutes,” Nuggets coach Michael Malone said. “He makes everyone better. That’s why he’s truly a great player.”\n\n\r\n              Lamar Stevens matched a season high with 19 points for the Grizzlies. Scotty Pippen Jr. added 17.\n\n\r\n              In the last two games between the teams, both in Denver, the Nuggets have won by a combined 62 points.\n\n\r\n              “We’re trying to get the 1 seed the same way — understanding the importance of every game and understanding the importance of how big the 1 seed was for us last year,” Braun said. “We’re still approaching each game the same way. That’s the good thing about this organization. We try to win every game. Guys aren’t sitting, guys aren’t throwing games. We’re going out here to win every game. We’re playing the right way, no matter who’s on the court.”\n\n\r\n              Even without injured starters Jamal Murray (left ankle sprain) and Aaron Gordon (fascia strain), Denver shot 53.3% from the field and 46.9% from 3-point range. The Nuggets improved to 15-2 since the All-Star break.\n\n\r\n              Reggie Jackson added 15 points and eight assists for Denver. Peyton Watson came off the bench to finish with 10 points and 10 rebounds.\n\n\r\n              The Nuggets came out firing, building a 16-6 advantage 4:20 into the game and extending their lead to 18 in the first quarter. In the opening period, Jokic had 16 points, four rebounds and three assists.\n\n\r\n              After trailing by 25 at halftime, Memphis cut its deficit to 15 with 5:48 remaining in the third quarter. But after a quick timeout by Malone, the Nuggets went on a 14-2 run to quash any realistic hopes of a comeback.\n\n\r\n              “Tonight we caught a break with them having so many guys out, but we took advantage of it,” Malone said. “We didn’t mess around with the game.”\n\n\r\n              The reigning NBA champion Nuggets are in first place in the Western Conference, one game ahead of idle Oklahoma City. The Grizzlies, meanwhile, fell to 24-48 in a trying season in which they’ve been without their franchise player, guard Ja Morant, for all but nine games and their big offseason addition, Marcus Smart, since Jan. 9.\n\n\r\n              “Obviously, we’ve fallen quite a bit throughout this season, but the spirit of this group has been great,” coach Taylor Jenkins said. “I just lean into that. What are the opportunities for us as a coaching staff to get better and the players individually and collectively? The dialogue has been great on what we can build on for the rest of the season and going into next year.”\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host the Phoenix Suns on Wednesday.\n\n\r\n              Grizzlies: Host the Los Angeles Lakers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995991.2383392
}