{
  "game_id": "0022300420",
  "espn_id": "401585048",
  "date": "Dec 27, 2023",
  "matchup": "CLE @ DAL",
  "headline": "LeVert scores 29 points, hits go-ahead 3 as Cavs rally in 4th to beat Mavs 113-110",
  "body": "DALLAS -- — Jarrett Allen and the Cleveland Cavaliers are counting the games until Donovan Mitchell returns from a longer-than-expected absence from an illness for a team short-handed well beyond the star guard.\n\n\r\n              The Cavs are finding ways to win them, too.\n\n\r\n              Caris LeVert scored 29 points, hitting the go-ahead 3-pointer late in the fourth quarter, and Cleveland rallied from 20 points down in the first half to beat the Dallas Mavericks 113-110 on Wednesday night.\n\n\r\n              The Mavericks went five minutes without scoring in the fourth quarter as a nine-point lead turned into a 111-105 deficit with 1:13 remaining.\n\n\r\n              Allen had 24 points and 23 rebounds, one off his career high, and Isaac Okoro scored 22 points as the Cavs improved to 3-1 in the four consecutive games Mitchell has missed with an illness. He was on the bench in street clothes, chatting up teammates during timeouts.\n\n\r\n              Cleveland is also missing its Nos. 2 and 3 scorers with long-term injuries to Darius Garland (broken jaw) and Evan Mobley (knee surgery). And yet the Cavs are 5-1 since a three-game losing streak.\n\n\r\n              “It’s a big lift for us,” Allen said. “As long as we can hold down the fort until we get healthy again, that’s what we’re looking forward to. You can’t just discount this team. We’re going to step to every single matchup and give it our all.”\n\n\r\n              Luka Doncic scored 39 points for Dallas to get to at least 30 for the 14th time in 15 games, nine of them in the 10 straight games All-Star sidekick Kyrie Irving has missed with a right heel injury.\n\n\r\n              With Irving out, the Mavs rested Doncic longer than usual to start the fourth — almost six minutes — but they couldn't score after the four-time All-Star returned. Cleveland's 15-0 run for the lead started as soon as Doncic came back.\n\n\r\n              LeVert, Allen and Max Strus scored at the rim before a two-minute scoreless drought for both teams ended with two free throws from LeVert, who scored 15 points in the fourth after missing the previous game with a knee injury.\n\n\r\n              Seth Curry scored a season-high 19 points for Dallas, but he and Doncic combined to go 2 of 11 from the field in the fourth. \n\n\r\n              “We got some good looks,” coach Jason Kidd said. “We just didn’t make them. Luka had looks. Curry had looks. Everybody had looks. They just didn’t go down for us.” \n\n\r\n              The Mavs trailed by six with 21 seconds left but still had a chance to tie on a final possession after Georges Niang missed two free throws with eight seconds remaining.\n\n\r\n              Cleveland trapped Doncic near midcourt after he caught the inbound pass, and Curry's desperation 3 at the buzzer was blocked by Strus.\n\n\r\n              “We've got to get stops, and at the end, we didn't get the look we wanted,” Kidd said. “We’ve got to be better late game.”\n\n\r\n              Niang scored 16 points, and Craig Porter Jr. had nine points and 12 rebounds. \n\n\r\n              Allen had 20 more points and 19 more rebounds than rookie counterpart Dereck Lively II of Dallas. The seven-year veteran also had six assists, one off his season high.\n\n\r\n              “He’s relentless. It was impressive,” Cleveland coach J.B. Bickerstaff said. “It was a refusal to let us lose in so many different ways. We asked him to do so many things out there defensively. And then offensively we put the ball in his hands and let him make the right basketball play.”\n\n\r\n              Josh Green returned for Dallas after missing 12 games with a right elbow sprain, scoring two points with five assists in 21 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Milwaukee on Friday night.\n\n\r\n              Mavericks: At Minnesota on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996733.6678941
}