{
  "game_id": "0021900572",
  "espn_id": "401161214",
  "date": "Jan 10, 2020",
  "matchup": "LAL @ DAL",
  "headline": "James, Kuzma lead Lakers over frustrated Mavericks 129-114",
  "body": "DALLAS --  LeBron James drove for easy layups or quick passes to open shooters at the 3-point line early in another meeting with Dallas phenom Luka Doncic.\n\nThe 20-year-old Mavericks star played the last few minutes of the first half with a jersey he ripped into a V-neck look on a frustrating night against the player he admired growing up.\n\nJames had 35 points and 16 rebounds, Kyle Kuzma scored a season-high 26 points starting in place of injured star Anthony Davis, and the Los Angeles Lakers went up big early in a 129-114 victory over the Mavericks on Friday night.\n\nThe four-time MVP scored or assisted on seven of the first nine LA baskets to help build a 22-point lead in the first half, while Doncic missed five free throws while ending up a team-worst minus-24 in scoring margin before halftime.\n\nHence, the torn jersey.\n\n\"I played really bad,\" said Doncic, the 2019 Rookie of the Year. \"I felt like I don't know how to play basketball. It wasn't me. I gotta get better. A lot.\"\n\nJames was 14 of 25 from the field to help the Lakers shoot 53%, and his 16 rebounds were a season high in LA's seventh consecutive win.\n\n\"It's not about how many you can win in a row,\" James said. \"It's just how you continue to get better every individual game and I thought we did that here.\"\n\nDallas coach Rick Carlisle was as flummoxed as his young star, getting ejected after his second technical early in the fourth quarter when he exploded over the Lakers getting to challenge an out-of-bounds call after he thought the Mavericks had thrown the ball in.\n\nDoncic, who had played James just about even while the Lakers took two of first three in the season series, had 25 points and 10 rebounds. But Dallas trailed by double digits for all but the first five-plus minutes.\n\n\"Those are emotions and feelings that are about winning and losing,\" Carlisle said. \"I get it. He's going through a lot this year. He's going through a lot of different situations.\"\n\nDavis missed the first game of a road back-to-back after taking a nasty fall in a 117-87 win over the Knicks in Los Angeles on Tuesday night. An MRI exam showed no major concerns, although Davis was extremely sore.\n\nKuzma filled in just fine in his second start, scoring 11 points in the first quarter after totaling just 13 in the first three meetings with Dallas. He ended up 9 of 22 from the field, 2 of 8 from long range.\n\n\"It's not any extra motivation,\" said Kuzma, whose previous season high was 25. \"I'm just confident, especially when I know, being I'm a rhythm player, when my minutes are high, just trying to be myself.\"\n\nBoth leading men -- James and Doncic -- were without their star sidekicks for the final regular-season meeting as both fell short of a triple-double after both had one in the previous meeting in Dallas. They had seven assists apiece.\n\nMavericks forward Kristaps Porzingis has already been ruled out for the final two games of a six-game homestand because of a sore right knee. It's not the knee the 7-foot-3 Latvian injured in his final game for the Knicks almost two years ago.\n\nThe Mavericks got within 91-81 late in the third quarter when Doncic found Tim Hardaway, who scored 22 points, for a 3-pointer. It was the closest Dallas had been since 19-9 midway through the first.\n\nDallas never did get the deficit back to single digits, and James hit a 3 to open the fourth quarter to push the lead back to 16.\n\nTIP-INS\n\nLakers: LA led 45-27 after the first quarter, topping the previous season high for any quarter of 43 in the first quarter of a 117-017 win over Phoenix on New Year's Day. With a halftime lead of 79-58, the Lakers topped their previous best of 77 in the first half of a 136-113 win over Portland on Dec. 6. ... Rajon Rondo scored 10 points\n\nMavericks: Dropped to 2/3 on a season-long six-game homestand, putting them at 11-10 at home compared to 12-5 on the road. ... Assistant coach Stephen Silas filled in for Carlisle after the ejection. ... Boban Marjanovic had 14 points and 10 rebounds.\n\nFLAGRANT AND TECHS\n\nDwight Howard was called for a flagrant foul for shoving Maxi Kleber 33 seconds after entering the game in the first quarter, prompting a five-point possession for Dallas that ended with a goal-tending call against Howard.\n\nThe foul was called as Hardaway hit a jumper. Hardaway missed one of the two free throws awarded for the foul, then Howard grabbed Seth Curry's runner on its way down. Howard got his fifth foul midway through the third quarter, but had already scored all 10 of his points by then.\n\nLakers coach Frank Vogel matched Carlisle in the first half with a technical foul. Kuzma was called for one in the third quarter.\n\nUP NEXT\n\nThe second night of a back-to-back for both teams Saturday, the Lakers in Oklahoma City and the Mavericks at home against Philadelphia.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996000.34919
}