{
  "game_id": "0021800670",
  "espn_id": "401071346",
  "date": "Jan 17, 2019",
  "matchup": "OKC vs. LAL",
  "headline": "Kuzma scores 32 as Lakers top Thunder in OT without LeBron",
  "body": "OKLAHOMA CITY --  The young Los Angeles Lakers matured on Thursday night.\n\nWith four-time MVP LeBron James still sidelined by a left groin strain, Kyle Kuzma scored 32 points to help the Lakers beat the Oklahoma City Thunder 138-128 in overtime.\n\nJames missed his 12th straight game, yet against a veteran team loaded with All-Star talent, the Lakers rolled to a 16-6 advantage in the extra period.\n\n\"That was a really nice, big win for our group,\" Lakers coach Luke Walton said. \"We got contributions from everybody. This is a really hard place to win at. It's a playoff team. For our guys to keep coming in and different people making plays -- it's how we have to compete.\"\n\nIvica Zubac scored a career-high 26 points and Lonzo Ball added 18 points and 10 assists for the Lakers, who improved to 5-7 without their injured star.\n\nPaul George scored 27 points and Terrance Ferguson added 21 for Oklahoma City. Russell Westbrook had 26 points, 13 assists and nine rebounds but shot just 7 of 30.\n\nThe Thunder lost despite making a franchise-record 21 3-pointers and leading by 17 in the first half. They have dropped five of six.\n\nWestbrook missed two layups in the final minute but was fouled by Ball on a 3-pointer with 2.9 seconds remaining and the Lakers up 122-119. Westbrook, a 64 percent free throw shooter, made all three foul shots to tie the score. Kuzma missed a 3 at the buzzer, and the game went to overtime.\n\nNBA crew chief Tom Washington acknowledged that Westbrook should never have been awarded free throws.\n\n\"Upon being able to see the review of the play, we realized that the illegal contact happened prior to his upward motion, so it should have been a side-out,\" Washington said.\n\nBall took responsibility for the situation.\n\n\"It's my fault that he hit the free throws,\" he said. \"Maybe I should have fouled him earlier. But I had to wash it off.\"\n\nBall bounced back with five points, two rebounds and an assist in overtime. Walton was impressed with his second-year point guard's overall effort, especially late in the game.\n\n\"For him to do that against Westbrook -- I'm sure a player he watched growing up as one of the great point guards in our league -- not only to score those points, but a couple of big assists to Zu coming down the lane, a big-time rebound. He can do a little bit of everything,\" Walton said.\n\nTIP-INS\n\nLakers: G Rajon Rondo missed his 11th straight game since having surgery on his ring finger. ... F Michael Beasley tried to check into the game in the first quarter while wearing practice shorts. ... The Lakers made their first 11 free throws. ... F Brandon Ingram had a career-high 11 assists.\n\nThunder: Backup center Nerlens Noel returned after sitting out three games while in concussion protocol. ... G Alex Abrines has missed the past eight games for personal reasons. ... Ferguson shot 5 of 6 on 3-pointers in the first half. ... G Raymond Felton was called for a technical foul in overtime while on the bench.\n\nSTAT LINES\n\nThe Thunder attempted a franchise-record 54 3-pointers, shattering the previous mark of 44 set last season against Denver.\n\nFADING DEFENSE\n\nThe Thunder, among the best defensive teams in the league during the first half of the season, have allowed an average of 130.2 points in their past six games.\n\n\"Just slight lack of awareness,\" Noel said. \"Things like backdoors, small things. I think we just have to do a better job of guarding the ball 1-on-1.\"\n\nHE SAID IT\n\nWalton on Zubac's performance: \"He was big around the rim and he has a really nice, soft touch down there. Some of it is his teammates looking for him. But when he gets that ball around the rim, he's pretty good at finishing. But where he's really grown is at becoming more physical.\"\n\nUP NEXT\n\nLakers: At the Houston Rockets on Saturday.\n\nThunder: At the Philadelphia 76ers on Saturday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994583.498445
}