{
  "game_id": "0022200295",
  "espn_id": "401468450",
  "date": "Nov 27, 2022",
  "matchup": "DET vs. CLE",
  "headline": "Mitchell, Mobley lead Cavaliers to 102-94 win over Pistons",
  "body": "DETROIT -- — Donovan Mitchell scored 32 points, Evan Mobley added 20 and the Cleveland Cavaliers rallied late to beat the Detroit Pistons 102-94 on Sunday.\n\n\r\n              “He’s really being aggressive,” Mitchell said about Mobley. “He was the reason we stayed in the game for the first three quarters.”\n\n\r\n              Cleveland trailed for much of the game, but outscored the Pistons 29-16 in the fourth quarter.\n\n\r\n              “It wasn't a terrible game, but we missed a lot of shots we usually make,” Cavaliers coach J.B. Bickerstaff said. “We did a good job of creating those shots, but they just didn't go in. Credit the guys for finding a way to win us the win.”\n\n\r\n              Darius Garland added 16 points for Cleveland, which has won five of six.\n\n\r\n              “We didn't want to put everything on Donovan and Darius, which is why Evan was so important on both ends of the floor,” Bickerstaff said. “He saved us when everyone was struggling.”\n\n\r\n              Marvin Bagley III had 19 points for the Pistons, who were missing starters Bojan Bogdanovic (ankle), Jaden Ivey (knee), Isaiah Stewart (foot) and Cade Cunningham (shin).\n\n\r\n              “It has been like this all week,” said Saddiq Bey, who scored 15 points after dealing with an ankle injury. “Everyone came in and contributed, which was good to see. We just need to be a little more disciplined down the stretch.”\n\n\r\n              The Cavaliers took a 94-90 lead when Mobley split a pair of free throws with 3:32 left. It was Cleveland's second miss from the line in the game, while the Pistons had missed 12.\n\n\r\n              “Some of the time, it is just that simple — you have to make your free throws,” Pistons coach Dwane Casey said. “Our guys worked hard to get to the line, but you have to score when you get there.”\n\n\r\n              After a Detroit miss, Mobley missed two more free throws, allowing Killian Hayes to make it 94-92, but Mitchell answered with a 3-pointer, followed by a pair of free throws on the next possession.\n\n\r\n              Detroit led 56-51 at the half, thanks to 15 points from Bagley and 11 from Alec Burks. Mitchell had 15 for Cleveland.\n\n\r\n              Cleveland was still within 78-73 at the end of the third quarter despite shooting just 31.8% in the third quarter, and took an 86-85 lead on Mitchell's 3-pointer with 7:45 to play.\n\n\r\n              “They have one of the best defenses in the NBA, and they really stepped it up in the fourth quarter,” Casey said, “The baskets we were getting in the first quarter weren't there in the fourth and we didn't do enough to adjust.”\n\n\r\n              TIP INS\n\n\r\n              Cavaliers: Hit just three of 14 3-point attempts in the first half, then went 0 for 7 in the third quarter. ... Mobley went 2 for 5 from the free throw line while his teammates went 26 of 28.\n\n\r\n              Pistons: Shot 53.8% in the first half, including 45.5% on 3-pointers. However, they missed six of 15 free throws.\n\n\r\n              TIME TO UNPACK\n\n\r\n              The Pistons were playing their first game in the Eastern Time Zone since losing at home to the Toronto Raptors on Nov. 14. Detroit played six games in nine nights on a West Coast trip and only had one day off before hosting the Cavaliers. \n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit the Toronto Raptors on Monday.\n\n\r\n              Pistons: Host the New York Knicks on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994384.8817978
}