{
  "game_id": "0021600194",
  "espn_id": "400899644",
  "date": "Nov 20, 2016",
  "matchup": "POR @ BKN",
  "headline": "McCollum scores 33 points, Trail Blazers beat Nets 129-109",
  "body": "NEW YORK --  C.J. McCollum took over in the third quarter for the Portland Trail Blazers to victory.\n\nMcCollum scored 33 points, Evan Turner had 19 and the Trail Blazers beat the Brooklyn Nets 129-109 on Sunday. Portland snapped a three-game losing streak and extended Brooklyn's skid to four.\n\nDamian Lillard added 18 points for the Trail Blazers, and Allen Crabbe had 14. Crabbe signed a four-year, $75 million restricted free-agent offer sheet with Brooklyn before Portland matched in the offseason.\n\nBrook Lopez had 21 points for the Nets. Trevor Booker had 16, and Bojan Bogdanovic 15.\n\nMcCollum made four 3-pointers and scored 12 points in the third quarter to help the Trail Blazers take a 99-84 lead into the fourth.\n\nMcCollum extended Portland's lead to 22 by making a driving layup and then sinking a free throw to give the Trail Blazers a 110-88 lead with 8:08 remaining in the fourth quarter. Portland never looked back.\n\n\"I had some good looks,\" McCollum said. \"Guys did a great job moving the ball and finding the weak side. It was like throwing rocks in the ocean.\"\n\nPoor third quarters are becoming a trend, according to Lopez.\n\n\"I think one of the things that is difficult for us is the third quarters,\" Lopez said. \"I think there are usually games where we've come out and teams have made a run and come out and hit first. It is tough to come back from that playing behind the rest of the night.\"\n\n\"I just think we come out flat. I think it's on us 100 percent. I mean, I don't think you can look at the other teams. We've had a variety of different guys, and they play differently. I think that one is on us for sure.\"\n\nTIP-INS\n\nTrail Blazers: Coach Terry Stotts praised the growth of Mason Plumlee as a playmaker. \"What we use the most is his playmaking ability, his passing. We give him the freedom to get a rebound and take it up. We play through him out on the perimeter because he's a good passer. He sees the game. I think he helps our perimeter guys get better shots because of his playmaking, passing and rolling, rolling to the weak side.\" ... Al-Farouq Aminu (left calf) and Festus Ezeli (left knee) were inactive.\n\nNets: Coach Kenny Atkinson left the door open for former No. 1 overall pick Anthony Bennett to have an expanded role going forward. \"That was a pleasant surprise to see Anthony come in and help us out. We'll keep looking at it. We're going to keep looking at our rotations and, really, we want to give guys opportunity. When we see something in practice, when we see another guy might need a rest, I think we're always looking at giving our guys opportunities. Yes, you'll see him and other guys thrown in there at times.\" ... Jeremy Lin (strained left hamstring) and Caris LeVert (left foot rehab) were inactive.\n\nLIN RETURN?\n\n\"Jeremy is progressing well,\" Nets coach Kenny Atkinson said. \"I can't give you a timetable or an update in terms of a specific day he's back. I just think he's progressing on schedule.\"\n\nUP NEXT\n\nTrail Blazers: Visit New York on Tuesday night. Portland heads to New York as losers of three of its last four.\n\nNets: Host Boston on Wednesday night. Brooklyn hope to snap a four-game losing streak against Boston.",
  "source": "espn_api",
  "crawled_at": 1764995671.574534
}