{
  "game_id": "0022400041",
  "espn_id": "401703410",
  "date": "Nov 29, 2024",
  "matchup": "ATL vs. CLE",
  "headline": "De'Andre Hunter scores 23 points as the Hawks beat the NBA-best Cavs again, 117-101",
  "body": "ATLANTA -- — De'Andre Hunter scored 23 points off Atlanta's bench and the Hawks beat Cleveland 117-101 on Friday in the NBA Cup, handing the Cavaliers a loss for the second time in three days.\n\n\r\n              The Cavaliers (17-3) still boast the NBA's best record but they once again couldn't match the Hawks' scoring depth. Trae Young had 21 points and 11 assists, and Jalen Johnson added 17 points, nine rebounds and seven assists as Atlanta finished with six scorers in double figures.\n\n\r\n              Darius Garland led Cleveland with 29 points and Evan Mobley added 24 points, including seven dunks.\n\n\r\n              Atlanta won 135-124 at Cleveland on Wednesday night as Young set a career high with 22 assists. Young leads the NBA in assists 12.5 per game.\n\n\r\n              Later Friday night, the Hawks clinched East Group C in the NBA Cup when Chicago lost to visiting Boston.\n\n\r\n              Takeaways\r\n              Cavaliers: Donovan Mitchell was primarily defended by Dyson Daniels as he missed his first 10 shots from the field before sinking two 3-pointers late in the first half. Mitchell made only 5 of 23 shots and finished with 12 points and 11 rebounds. ... After missing four games for left knee injury management, G Caris LeVert had eight points.\n\n\r\n              Hawks: Led by Hunter, Atlanta's bench outscored Cleveland's reserves 50-28. \n\n\r\n              Key moment\r\n              After leading 52-50 at halftime, Clint Capela helped the Hawks pull away in the third quarter. Capela had three consecutive baskets as the Hawks stretched the lead to 67-57.\n\n\r\n              Key stat\r\n              The Hawks matched their scoring high for a quarter this season by outscoring the Cavaliers 39-23 in the third period. They also scored 39 points in the second quarter of a 121-116 win over the New York Knicks on Nov. 6.\n\n\r\n              Up next\r\n              The Cavaliers will host Boston on Sunday. Atlanta visits Charlotte on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997953.158232
}