{
  "game_id": "0021900714",
  "espn_id": "401161356",
  "date": "Jan 30, 2020",
  "matchup": "TOR @ CLE",
  "headline": "Raptors win 9th straight, beat Cleveland 115-109",
  "body": "CLEVELAND --  Toronto's ninth straight win didn't come easily.\n\nThe Raptors nearly let a big lead slip away in the fourth quarter before holding on to defeat the Cleveland Cavaliers 115-109 on Thursday night.\n\nSerge Ibaka scored 26 points, Kyle Lowry had 23 and Norman Powell made big plays down the stretch after Cleveland cut a 14-point deficit to 105-104.\n\nPowell came through with eight consecutive points in the final minute, hitting a 3-pointer, scoring on a layup after making a steal and sinking three foul shots to seal the win.\n\n\"That was anybody's game from start to finish, to be honest,\" Raptors coach Nick Nurse said. \"You've just got to grind it out and find a way.\"\n\nPowell's late-game flurry helped the Raptors stifle a comeback bid by the Cavaliers, who trailed 90-76 early in the fourth quarter.\n\nCleveland trimmed its deficit to one on three occasions and had a chance to tie the game, but Darius Garland missed the second of two free throws with 1:18 to play, leaving Toronto's lead at 105-104.\n\nLowry was selected as a reserve on the Eastern Conference All-Star team Thursday, the sixth time he'll appear in the game. Pascal Siakam, named an All-Star starter last week, scored 19 points and Powell had 16.\n\nThe Raptors held a postgame celebration to honor Lowry's selection.\n\n\"It was cool, man, because I wouldn't be here without my teammates,\" he said. \"Those guys literally let me lead them and I love them for it. Being there with P (Siakam), it's going to be awesome.\"\n\nLowry said he was pushed by fan when he dove into the stands for a loose ball in the fourth quarter. Video showed Lowry landed on two fans and one appeared to press his hand on the guard's back as he returned to the floor.\n\nLowry, who turned and looked at the fan as play continued, was pushed by a minority owner of the Goldden State Warriors in last season's NBA Finals when he dove into the stands under similar circumstances.\n\n\"I got pushed, and that's the second time it's happened to me,\" Lowry said. \"The next time it happens, I don't know if I'll be able to control myself. Fans like that shouldn't be able to lay any hands on you and shouldn't be a part of our game.\"\n\nThe Raptors are 34-14 despite losing Kawhi Leonard from last season's NBA championship team. Toronto trails only Milwuakee in the Eastern Conference.\n\n\"It wasn't just a tremendous player like Kawhi,\" Cavaliers coach John Beilein said. \"They have a lot of the pieces that you need to win at the level they've been winning at.\"\n\nIbaka started in place of Marc Gasol, who is out indefinitely after re-injuring his left hamstring Tuesday against Atlanta.\n\nKevin Love and Collin Sexton each scored 23 points for Cleveland, which has lost nine of 10 overall and nine in a row at home.\n\nToronto scored 11 straight points late in the third quarter to go ahead 88-75. Lowry converted a three-point play, and Ibaka and Powell hit 3-pointers.\n\nToronto pushed the lead to 100-90 before Cleveland rallied again. The Cavaliers haven't won at home since Dec. 23 when they defeated Atlanta.\n\nCleveland committed 23 turnovers, with the most crucial coming on Powell's steal of a bad pass by Kevin Porter Jr. and fast-break basket, which pushed the lead to 110-104.\n\nThe teams played twice in Toronto, with the Raptors winning both games by 20 points.\n\nTIP-INS\n\nRaptors: Gasol missed 12 games with the hamstring injury from Dec. 20 to Jan. 12. ... Ibaka made his 15th start of the season. . Toronto will end January with a winning record, marking the 21st straight month it has done so. The Raptors' last losing month was January 2017.\n\nCavaliers: Garland scored 16 points after sitting out for rest purposes Tuesday. Beilein said Garland informed the staff that his legs had been feeling tired after starting the first 47 games. Garland played in just five games in his only season at Vanderbilt because of a knee injury.\n\nMAJOR PROGRESS\n\nSiakam averages a team-high 23.7 points per game and has made 37% of his 3-point attempts. The 6-foot-9 forward averaged 6.0 points a game over his first two seasons before scoring 16.9 last season.\n\n\"He shows shades of Durant-like stuff out there at that size,\" Beilein said. \"I watched the San Antonio game and he started out with five 3s. That's something he didn't even do until last year. He can pass the ball. He defends. He's doing a lot of everything.\"\n\nUP NEXT\n\nRaptors: Visit Detroit on Friday. Toronto is 2-0 against the Pistons this season.\n\nCavaliers: Host the Golden State Warriors on Saturday. The teams met in the NBA Finals every year from 2015-18, but have two of the worst records in the league this season.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995605.326821
}