{
  "game_id": "0021400017",
  "espn_id": "400578309",
  "date": "Oct 30, 2014",
  "matchup": "DET @ MIN",
  "headline": "Young, Wolves hold off Pistons 97-91",
  "body": "MINNEAPOLIS --  The Minnesota Timberwolves' youth movement is in full effect, with Andrew Wiggins and Co. ushering in a new era in the wake of Kevin Love's departure.\n\nWhen it came to winning time on Thursday night, however, it was all veterans on the floor. And that's what makes coach Flip Saunders believe the rebuilding effort won't be as drastic as some people expect.\n\nThaddeus Young scored 19 points and hit a big 3-pointer with 90 seconds to play to lift the Timberwolves to a 97-91 victory over the Detroit Pistons, making Saunders a winner in his first home game as Timberwolves coach since 2005.\n\n\"We're trying to develop, but we also need some positive reinforcement and that's by getting some wins,\" Saunders said.\n\nNikola Pekovic had 17 points and 10 rebounds, and Ricky Rubio added 11 points, eight assists and seven boards.\n\nCaron Butler scored 24 points and D.J. Augustin had 20 points and six assists for the Pistons, who have opened the season with two straight losses on the road under first-year coach Stan Van Gundy.\n\nAndre Drummond had 11 points and 12 rebounds, but he was limited in the second half by foul trouble and the Timberwolves held off a late charge from Butler and the Pistons.\n\nPekovic wasn't able to play much basketball during the summer while he recovered from bursitis in his foot that plagued him for almost the entire second half of last season. The Wolves have tried to develop a program to keep their $60 million center healthy and it has been centered on a plan to measure his minutes much more closely this season.\n\nPekovic labored in the early going against the burly Drummond. He was just 2 for 6 from the field with three turnovers in the first half, but really started to assert himself in the third quarter.\n\n\"It was like two grizzly bears fighting each other,\" Young said.\n\nPekovic had nine points and five rebounds in the quarter and drew three fouls on Drummond in the first five minutes of the period to put him on the bench. With no presence in the paint, the young Wolves stormed out to a 19-point lead.\n\n\"Right now, I'm just worried about the whole mental state of our team,\" Van Gundy said. \"What happened in the third quarter was inexcusable. It really is. If you're a professional athlete, it was inexcusable.\"\n\nButler responded with a binge of his own, scoring 12 straight for the Pistons to start the fourth quarter and cut Minnesota's lead to 80-74. His 3-pointer with 1:43 to play tied the game at 80, but Young hit a big one on the other end to hold the Pistons off.\n\nTIP-INS\n\nPistons: Greg Monroe served the second of a two-game suspension stemming from an arrest last February on a DUI allegation. ... The Pistons shot just 42 percent, with Drummond, Josh Smith and Kentavious Caldwell-Pope combining to go 15 for 43.\n\nTimberwolves: Kevin Martin made his season debut after missing the opener with a sore left ankle. Normally a starter, he came off the bench and had 12 points in 19 minutes. ... The Timberwolves and Rubio have until 11:59 on Friday night to reach agreement on an extension of his rookie contract. If they don't, Rubio will become a free agent next summer.\n\nWIGGINS' DEBUT\n\nAndrew Wiggins, the No. 1 overall pick who headlined the trade that sent Love to Cleveland, had eight points and four rebounds in 24 minutes in his first home game. He had an impressive flurry in the third quarter, scoring on a soaring layup in traffic, hitting a jumper from the wing and adding a beauty of a turnaround fade-away jumper over Butler.\n\n\"Seeing the ball go in the hoop one time, that got me going,\" he said.\n\nTROUBLE BREWING\n\nFor the second straight game, Pistons point guard Brandon Jennings did not play at all in the fourth quarter as Van Gundy rode Augustin. \"I'm not frustrated. It is what it is. I don't make the decisions,\" Jennings said before quickly leaving.\n\nUP NEXT\n\nPistons: Host Brooklyn on Saturday.\n\nTimberwolves: Host Chicago on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993826.385479
}