{
  "game_id": "0022200934",
  "espn_id": "401469089",
  "date": "Mar 01, 2023",
  "matchup": "DET vs. CHI",
  "headline": "LaVine scores 41, Bulls top Pistons 117-115 after TO blunder",
  "body": "DETROIT -- — Zach LaVine scored 41 points and the Detroit Pistons called one too many timeouts, helping the Chicago Bulls hold on for a 117-115 win Wednesday night.\n\n\r\n              The Pistons were trailing by two points with 9.7 seconds left when rookie Jaden Ivey called a timeout — one more than they had — to trigger a technical foul that gave LaVine a free throw that he made.\n\n\r\n              “That was the first,” said 33-year-old DeMar DeRozan, who scored 21 points, including two at the line on the extra possession Detroit gave the Chicago due to the timeout blunder. “I've never seen that.\"\n\n\r\n              Pistons coach Dwane Casey said the loss was not Ivey's fault.\n\n\r\n              “He panicked, but the game wasn’t won or loss on that one play,” Casey said. “It was lost in the first quarter. With the laissez-faire approach we had defensively, they got whatever they wanted. It’s such a mountain to climb when you get behind in this league.”\n\n\r\n              Chicago led Detroit by at least 15 points in each of the first three quarters, and by as much as 21 in a game that suddenly got close in the final minutes.\n\n\r\n              The Pistons pulled into a tie three times in the final 3:04, but couldn't stop LaVine from driving into the lane and drawing a foul with 48.9 seconds left that gave him two free throws that he made to restore a two-point lead.\n\n\r\n              \"Zach had a big play when he drove and drew that foul,” Chicago coach Billy Donovan said.\n\n\r\n              Chicago (29-34) has won three of four overall this season, clinging to hopes of rallying into a spot in the playoffs.\n\n\r\n              “We just got to be more focused and locked in and understand these games are our season,” DeRozan said. “We got to treat it like that.”\n\n\r\n              Coby White had 14 points, Nikola Vucevic scored 12 points and Patrick Williams added 11 for the Bulls, who have won 14 straight against Detroit.\n\n\r\n              Bojan Bogdanovic scored 34 for the Pistons, who have dropped six straight games for the third time this season.\n\n\r\n              “They were the ones that got back in the game,” Donovan said. “I don’t want to make it seem like they did nothing.\n\n\r\n              “They were putting the ball in Bogdanovic's hands as much as they could.”\n\n\r\n              Detroit (15-48) has the worst record in the Eastern Conference and is contention with Houston and San Antonio for the No. 1 pick in the NBA draft, expected to be 7-foot-3 French phenom Victor Wembanyama.\n\n\r\n              The Pistons were without three injured players — Jalen Duren, Isaiah Stewart and Isaiah Livers — and the Bulls took advantage for three-plus quarters.\n\n\r\n              LaVine made his first five shots and helped Chicago lead by 15 in the opening quarter. After Detroit rallied to pull within two points, White scored nine in the second quarter to help to turn a slim lead into a 69-54 cushion.\n\n\r\n              “We have to show a sense of urgency coming out of halftime, especially when we have a lead,” DeRozan said. “Teams are not going to lay down and just let us win. They're going to come out swinging as well.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: The team's last loss in the series was March 10, 2019. ... LaVine entered the game averaging 20 points in 24 games against the Pistons, who allowed him to score a season-high 43 points in December. \n\n\r\n              Pistons: Ivey had 18 points, two assists and four turnovers, reserve Hamidou Diallo scored 19, Killian Hayes and Alec Burks each scored 11 points. ... Duren (ankle) missed his third straight game, Stewart (hip) was out for a second game in a row and Livers (ankle) sat out after leaving the previous game with an injury.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Phoenix on Saturday night.\n\n\r\n              Pistons: Play at Cleveland on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994366.007228
}