{
  "game_id": "0021500940",
  "espn_id": "400828827",
  "date": "Mar 07, 2016",
  "matchup": "MIL @ CHI",
  "headline": "Butler sits with knee soreness while Bulls beat Bucks 100-90",
  "body": "CHICAGO -- Jimmy Butler was sidelined by swelling in his left knee, and then Aaron Brooks and Bobby Portis left with two more injuries.\nWhile the health woes mounted in the second half, the banged-up Chicago Bulls just kept passing to the open man.\nLed by Pau Gasol's ninth career triple-double, the Bulls had a season-high 35 assists on 39 baskets and beat the Milwaukee Bucks 100-90 on Monday night.\n\"We've got a good recipe for having a lot of assists,\" said Mike Dunleavy, who made four 3-pointers and scored 18 points. \"We've done that pretty well the last few weeks. Right now, with the guys we have, that's the best way for us to play.\"\nThe Bulls shot 50 percent from the field and put six players in double figures in their second straight win after a four-game slide. Gasol had 12 points, 17 rebounds, 13 assists and five blocked shots, and Derrick Rose scored 22 points.\n\"I love moving the ball. I love finding my open teammates,\" Gasol said. \"I love making the right play, and lately I've been more on the top of the floor being able to make those plays and those passes.\"\nJerryd Bayless scored 20 points for Milwaukee, which has dropped five of seven. Jabari Parker and Khris Middleton had 18 points apiece, and Giannis Antetokounmpo finished with 12 points, 10 assists and five rebounds.\n\"We've got to communicate, we have to talk,\" coach Jason Kidd said. \"We had breakdowns defensively. We can fix that.\"\nButler missed 11 games before he returned for Chicago's 108-100 victory over Houston on Saturday night. But the All-Star guard had some stiffness in his back on Sunday and then developed some swelling in his knee on Monday, prompting the Bulls to hold him out.\nThen Brooks left in the first half with right patellar tendinitis, and Portis was poked in the left eye late in the third period.\n\"I mean at this point it's borderline comical,\" Dunleavy said. \"We just can't stay healthy for whatever reason.\"\nCoach Fred Hoiberg said the Bulls will know more about Butler on Tuesday.\n\"The doctor said structurally he was OK,\" Hoiberg said.\nGreg Monroe's turnaround hook shot got Milwaukee within two with 4:53 left, but Chicago responded with an 8-1 run. E'Twaun Moore and Dunleavy each made a 3-pointer before Gasol connected on two free throws to make it 93-84 with 1:49 remaining.\nGasol added a driving layup and Rose made two foul shots with 27 seconds left to help the Bulls hold on for their second win in three games against the Bucks this season.\n\"We just have to lock in at the end of the game,\" Monroe said. \"We put ourselves in position to win the game. When it gets to be crunch time, we have to focus. It's something we can clean up.\"\nMoore had 16 points and seven assists for Chicago, which had allowed at least 100 points in 16 straight games. Taj Gibson added 12 points and 10 rebounds, and Nikola Mirotic scored 14 points.\nABOUT THE BUCKS\nMilwaukee point guard Michael Carter-Williams missed his fifth straight game, and the team said he is scheduled for season-ending left hip surgery on Thursday in Colorado. He averaged 11.5 points, 5.1 rebounds and a team-high 5.2 assists in 54 games this season, including 37 starts.\nCarter-Williams had been coming off the bench before he was sidelined by hip and knee soreness, giving Antetokounmpo more opportunities to handle the ball. The 6-foot-11 forward has made the most of the additional responsibility, averaging 20.3 points, 10.6 rebounds and 8.7 assists in his previous seven games, including three triple-doubles.\n\"As big as he is and as well as he can do the things he does, he has a chance to be something really special,\" Bayless said.\nBut Antetokounmpo was mostly held in check by the Bulls, with Dunleavy, Mirotic and Gibson leading the charge. He was 5 for 13 from the field and had three turnovers.\nNICE COMPANY\nGasol, who turns 36 in July, has two triple-doubles this season. He is only the fourth player 35 years or older with multiple triple-doubles in a season, joining Kidd, Kobe Bryant and Paul Pierce.\nTIP-INS\nBucks: Monroe finished with 11 points and 14 rebounds. ... Parker also had 11 boards as the Bucks outrebounded the Bulls 48-44.\nBulls: Gibson blocked three shots as the Bulls finished with a season-high 11.\nUP NEXT\nBucks: Host Miami on Wednesday night.\nBulls: Visit San Antonio on Thursday night.\n---\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764994019.777741
}