{
  "game_id": "0021800689",
  "espn_id": "401071365",
  "date": "Jan 20, 2019",
  "matchup": "PHX @ MIN",
  "headline": "Derrick Rose lifts Wolves with 29 in second half, last-second winner",
  "body": "MINNEAPOLIS -- Derrick Rose and the Minnesota Timberwolves needed this one.\nWith 30 seconds left, Rose missed the first of two free throws and was kicking himself for failing to give his team the lead.\n\"I kept saying, 'You're going to get another shot,'\" Taj Gibson said he told his longtime teammate. Twenty-nine seconds later, Rose proved Gibson prophetic.\nRose hit an 18-footer with 0.9 seconds left to give the Wolves a 116-114 victory over the Phoenix Suns on Sunday night. He carried his team by scoring 29 of his 31 points in the second half to help Minnesota overcome an 11-point deficit.\nGibson dunked to pull Minnesota within one with less than a minute to play. Karl-Anthony Towns intercepted a bad pass from Booker, and Rose hit the second of two foul shots to tie it at 114 with 30.5 seconds remaining.\nAfter giving Rose his pep talk, Gibson grabbed the loose ball after Devin Booker lost it on Phoenix's next possession. With the shot clock off and the crowd on its feet, Rose calmly dribbled down the clock against Mikal Bridges before pulling up and hitting the final shot.\n\"I missed a lot. It was all up to my teammates and the coaches for giving me that confidence, putting the ball in my hands and just believing in me,\" Rose said.\nIt was a good confidence boost for both the oft-injured guard and a team that had lost two of its last three home games by a combined seven points.\n\"He needed that shot, you know what I'm saying?\" Gibson said. \"He's been putting in so much work in, we've been in that situation a couple times this year and it didn't go his way.\"\nRose picked up the slack for Towns, who had 30 points but only two after halftime. He went 13-of-13 from the free throw line in the half, but struggled against Phoenix's double-teams in the second.\n\"We just stepped it up in the second half,\" said Dragan Bender, the main man charged with defending Towns. \"We came out, tried to double him, try to get the ball out of his hands and make the other players make plays.\"\nWith Towns struggling against double-teams in the second half, Rose kept the Wolves in the game on 11-for-18 shooting in the half.\nSLUMPING SUNS\nT.J. Warren led Phoenix with 21 points, and Booker and Kelly Oubre Jr. each added 18. Warren's last-second corner 3 hit off the side of the backboard.\n\"I think we played well enough to deserve to win this game, but again, we didn't find a way to close the game,\" Suns coach Igor Kokoskov said. \"It's just a bad taste in our mouth after this loss, but we have to learn from mistakes.\"\nThe Suns lost all four on their trip to fall to 4-20 on the road this season. A night after losing by 20 in Charlotte, Phoenix shot 46 percent, but went 22-of-32 from the line.\n\"We had a lot of mistakes that hurt us,\" Warren said. \"We've got to be smarter and value the ball more and just convert.\"\nCOACH CONNECTIONS\nKokoskov recounted his first memories of Wolves coach Ryan Saunders when serving on Flip Saunders' coaching staff in Detroit through 2008. \"Good things happen to good people, and very well-deserved,\" Kokoskov said. \"Sometimes it's hard when you're coming from a basketball background and a coach's background. It puts a lot of pressure on guys like Ryan because he was in the shadow of Flip. ... I'm really, really happy for Ryan. I think he's going to be a very good coach for a long time in this league\nTIP-INS\nSuns: With C Deandre Ayton (ankle) and F Richaun Holmes (foot) out injured, Bender made his first start of the season and had 12 points and 10 rebounds. \"Drag was phenomenal,\" Warren said. \"I'm happy for him.\" ... Veteran guard Jamal Crawford, who played last season in Minnesota, was active and on the bench for his 1,300th career game. He missed the previous three games with a sore left knee. \"His experience, his voice, his presence, the wisdom he's sharing in the locker room when the coaches are not around, it's priceless for the group, and we're thrilled to have him,\" Kokoskov said before the game.\nTimberwolves: Towns notched his 10th career game with 10 or more made free throws. He also matched his career high with four steals. ... F Robert Covington (bruised knee) and G Tyus Jones (ankle) remained out.\nUP NEXT\nThe teams meet again Tuesday night in Phoenix.",
  "source": "espn_api",
  "crawled_at": 1764995124.333188
}