{
  "game_id": "0021801133",
  "espn_id": "401071806",
  "date": "Mar 29, 2019",
  "matchup": "OKC vs. DEN",
  "headline": "Murray scores 27; Nuggets top Thunder 115-105",
  "body": "OKLAHOMA CITY --  All season, Western Conference teams have been chasing Golden State.\n\nNow they're chasing Denver, too.\n\nJamal Murray scored 27 points, Nikola Jokic added 23 points and 16 rebounds, and Denver beat the Oklahoma City Thunder 115-105. With Golden State's loss to Minnesota, Denver is tied with the Warriors for the best record in the Western Conference.\n\nThe Nuggets huddled around Isaiah Thomas' phone to watch the conclusion of the Warriors-Timberwolves game.\n\n\"It's fun,\" Murray said. \"It's been a fun journey, especially when you are winning.\"\n\nThe Nuggets won all four meetings with Oklahoma City, a potential playoff opponent, this season.\n\n\"It doesn't mean much,\" Denver forward/center Mason Plumlee said. \"If we see them in the playoffs it will be a whole new matchup. They are a good team and we know that and we respect them and we are just looking forward to the next game.\"\n\nMurray made 11 of 20 shots and had nine assists without a turnover.\n\n\"I liked his poise, his leadership and his maturity,\" Denver coach Michael Malone said. \"That's not easy to do against that team and this building. They turn people over and they can make you look really bad in a heartbeat, but just Jamal's control -- he never got sped up, he was always in control, running his team and being vocal, and I was excited watching him play.\"\n\nRussell Westbrook had 27 points, nine rebounds and nine assists, and Paul George had 25 points and nine rebounds for the Thunder.\n\n\"I think it was good for the most part for spurts,\" Westbrook said. \"Not enough to be sustainable.\"\n\nDenver led 56-52 at halftime behind 13 points from Murray and 12 points and 12 rebounds by Jokic.\n\nOklahoma City's Jerami Grant hit a 3-pointer to tie it at 68, but Denver responded with a 14-2 run and took an 86-75 lead into the fourth quarter.\n\nDenver led 95-81 in the final period before Oklahoma City scored five quick points to force Denver to call timeout.\n\nWestbrook went down hard to the ground after being fouled in the fourth quarter, and he got up and started jawing with the Nuggets bench. He scored six points in the next minute, but Murray hit a dagger 3-pointer with just under 2 minutes to play.\n\n\"They made some tough ones down the stretch,\" Westbrook said. \"That's what the good teams do.\"\n\nTIP-INS\n\nNuggets: Shot 56.5 percent overall. ... Outrebounded Oklahoma City 39-35. ... Shot 59 percent from the field in the third quarter.\n\nThunder: George was questionable with left shoulder soreness, but the team announced right before the tip that he would start. George has had issues with his right shoulder, too. During his pregame media availability, Thunder coach Billy Donovan actually got confused about which shoulder was hurt. ... Oklahoma City has lost six of eight, though the wins were against Eastern Conference powers Toronto and Indiana.\n\nSECOND HALF SHOOTING\n\nDenver shot 62.5 percent in the second half overall and 47.1 percent from 3-point range. The Nuggets scored 59 points in the second half despite making just one free throw.\n\nHE SAID IT\n\nMalone on the top seed: \"If we are two, three, four, I really don't care. I believe in our group, and I know that if we have home-court advantage, we have the best fans in the NBA and will make it a very tough place to come in and pay against the Nuggets at the Pepsi Center. But if we wake up in first, we will enjoy it for five minutes.\"\n\nEFFICIENT ADAMS\n\nSteven Adams was the only Oklahoma City player with a positive plus/minus score (plus-2). He scored 16 points on 8-for-12 shooting.\n\nUP NEXT\n\nNuggets: Host the Washington Wizards on Sunday.\n\nThunder: Host the Dallas Mavericks on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994547.519558
}