{
  "game_id": "0022400558",
  "espn_id": "401705124",
  "date": "Jan 14, 2025",
  "matchup": "SAC @ MIL",
  "headline": "Antetokounmpo gets 50th career triple-double as Bucks win 130-115 to end Kings' 7-game win streak",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 30 points, 13 assists and 11 rebounds for his 50th career triple-double as the Milwaukee Bucks beat Sacramento 130-115 on Tuesday night to snap the Kings’ seven-game win streak.\n\n\r\n              Antetokounmpo’s triple-double was his fifth of the season. He had a sixth in the Bucks’ NBA Cup championship victory over Oklahoma City, but players’ statistics from that game aren’t official.\n\n\r\n              Damian Lillard had 24 points, Brook Lopez 21 and A.J. Green 16 for the Bucks, who never trailed and led by as many as 28.\n\n\r\n              DeMar DeRozan scored 28, De'Aaron Fox 20 and Keon Ellis 18 for Sacramento. Domantas Sabonis had 16 points, 10 rebounds and nine assists.\n\n\r\n              Sacramento’s Malik Monk didn’t play due to a sore right groin. The Bucks didn’t have Khris Middleton (ankle injury management) or Gary Trent Jr. (hip flexor strain).\n\n\r\n              Takeaways\r\n              Kings: Sacramento dropped to 7-2 under interim head coach Doug Christie. Sacramento hadn't lost since a 132-122 road defeat against the Los Angeles Lakers on Dec. 28, the day after Mike Brown was fired.\n\n\r\n              Bucks: Milwaukee posted its highest point total of the season and led by as many as 28 points early in the second quarter, as the Bucks bounced back two nights after a 140-106 loss at New York. \n\n\r\n              Key moment\r\n              In a play that exemplified Milwaukee's dominant first quarter, Lillard got just his fifth block of the season as he leaped and extended his left hand to thwart a layup attempt from Ellis. Sacramento’s Keegan Murray got the rebound but missed a putback attempt, then Lopez hit a 3-pointer on the other end of the floor to extend the Bucks’ lead to 15-11.\n\n\r\n              Key stats\r\n              The Bucks took control by going on a 21-2 spurt late in the first quarter.\n\n\r\n              Up next\r\n              The Kings host the Houston Rockets on Thursday, while the Bucks stay home to face the Orlando Magic on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997337.981802
}