{
  "game_id": "0021900242",
  "espn_id": "401160884",
  "date": "Nov 25, 2019",
  "matchup": "MEM @ IND",
  "headline": "Warren scores 26 to lead Pacers over Grizzlies, 126-114",
  "body": "INDIANAPOLIS --  T.J. Warren's aggressive approach led the Indiana Pacers to their biggest offensive night of the season.\n\nWarren scored 26 points on 11-of-15 shooting, and the Pacers beat the Memphis Grizzlies 126-114 on Monday night.\n\n\"I just want to stay aggressive when I'm out there,\" Warren said. \"We have a lot of potential. We're clicking right now, so we just have to keep it up and get ready for the next one.\"\n\nJeremy Lamb had 19 points and Aaron Holiday added 16 points off the bench for the Pacers (10-6), who have won three straight and seven of nine games.\n\nIndiana's 126 points were a season-best. The Pacers shot 54.3% from the field and 54.5% on 3-pointers. Their 18 3s were also a season high and one shy of the franchise record.\n\n\"I thought we did a good job of executing, getting out and pushing the ball,\" Pacers coach Nate McMillan said. \"We had 29 assists, so we had good ball movement. But we were trading baskets. We gave up 62 points in the paint and that's way too many points.\"\n\nJared Jackson Jr. scored a season-high 28 points -- including a career-high six 3-pointers -- Ja Morant had 19 points and 10 rebounds, and Brandon Clarke scored 17 points on 8-of-9 shooting for the Grizzlies (5-11), who have lost four straight.\n\n\"The biggest takeaway is that we didn't come in with an urgency to start the game,\" Grizzlies coach Taylor Jenkins said. \"We started selling the game a little bit, but a little too late for us when we started settling in.\"\n\nThe Pacers led by as much as 29 after T.J. McConnell scored and Holiday made back-to-back 3-pointers, including one to give Indiana a 112-83 lead with 10:45 remaining.\n\nJackson hit two 3s, Morant twice made layups and Solomon Hill scored in a 12-0 spurt in the fourth quarter by the Grizzlies, but Memphis couldn't put enough together to overcome such a big deficit.\n\nThe Pacers took a 16-point lead in the first half after a 12-2 run that ended with a free throw by Domantas Sabonis that made it 65-49 with 2:02 to play in the second quarter.\n\nMorant made a layup and Jae Crowder a 3-pointer to close out the half. The Pacers led 67-56 at halftime.\n\nTIP-INS\n\nGrizzlies: Clarke was 5 for 5 from the field with 11 points in the first quarter. . C Jonas Valanciunas finished with 14 points and 11 rebounds. . Memphis shot 47.4% from the field, including 13 of 29 on 3-pointers.\n\nPacers: G Malcolm Brogdon had 14 points, six rebounds and eight assists. . Sabonis had 13 points, 13 rebounds and six assists. . F JaKarr Sampson was inactive for a second straight game with a sore back.\n\nSTARTING FIVE\n\nA number of injuries have left the Pacers short-handed many times this season, forcing McMillan to use seven different lineups so far. Against the Grizzlies, Indiana used its opening night starting five for just the third time and is now 2-1 using that combination.\n\nBIG BLOCKING\n\nMyles Turner, who finished with seven points and four rebounds, blocked a season-high five shots -- the most by a Pacers player in a single game this season.\n\nUP NEXT\n\nGrizzlies: Host the Los Angeles Clippers on Wednesday.\n\nPacers: Host Utah on Wednesday for the third of four straight home games.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995751.838015
}