{
  "game_id": "0022200728",
  "espn_id": "401468883",
  "date": "Jan 25, 2023",
  "matchup": "TOR @ SAC",
  "headline": "Pascal Siakam scores 26, Raptors top Pacific-leading Kings",
  "body": "SACRAMENTO, Calif. -- — Pascal Siakam had 26 points and 11 rebounds as the Toronto Raptors beat the Pacific Division-leading Sacramento Kings 113-95 on Wednesday night.\n\n\r\n              “I like him shooting all those perimeter shots,” Raptors coach Nick Nurse said of Siakam. “He just got back in command of the game.”\n\n\r\n              Fred VanVleet scored 17 points and O.G. Anunoby added 11 for the Raptors, who had lost four of their last six games entering the contest. Precious Achiuwa added 19 points and Chris Boucher came off the bench to score 16.\n\n\r\n              “We looked good and felt good,” VanFleet said. “We were locked in. We have had our struggles this year.”\n\n\r\n              Kevin Huerter scored 21 points to lead the Kings (27-20), who entered the game with seven wins in their last eight games. Keegan Murray hit four 3-pointers and added 16 points, while De’Aaron Fox finished with 16 points and eight assists.\n\n\r\n              The Kings Domantas Sabonis finished with nine points and eight rebounds and saw his 22-game double-double streak come to an end.\n\n\r\n              “I have to play better,” said Sacramento's Malik Monk, who shot 2 for 7 overall. “That’s it ... shot’s just not going in. They’re going to start falling.”\n\n\r\n              The Raptors led by a point after the first quarter and seized control by outscoring Sacramento 34-27 and 26-17 in the second and third periods, respectively. The Kings closed within 12 points in the fourth quarter before Toronto pulled away.\n\n\r\n              Toronto shot 48 for 97 (49.5%) in the game, while Sacramento went 35 for 73 (48%).\n\n\r\n              “They kicked our behind on the glass,” Kings coach Mike Brown said. “It’s hard to beat a team when a team gets 25 more shots than you do.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Anunoby returned to the starting lineup after being sidelined with an ankle injury.\n\n\r\n              Kings: Chimezie Metu returned to the lineup after missing Monday’s game with a bone bruise in his left leg. ... The Kings failed to score 100 points or more for the second time this season.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Open a seven-game trip at Minnesota on Saturday.\n\n\r\n              Raptors: At Golden State Warriors on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994050.110135
}