{
  "game_id": "0021600149",
  "espn_id": "400899599",
  "date": "Nov 14, 2016",
  "matchup": "HOU vs. PHI",
  "headline": "Harden's big first propels Rockets over Sixers 115-88",
  "body": "HOUSTON --  The Houston Rockets were determined to get off to a fast start and keep the pressure on Philadelphia after seeing the 76ers rally after trailing big on several occasions this season.\n\nThey executed that plan perfectly.\n\nJames Harden scored 23 of his 33 points in the first quarter, and the Rockets cruised to a 115-88 win over the 76ers on Monday night.\n\n\"We came in, made shots and defensively really locked in and didn't give them any confidence early in the game,\" Harden said. \"They've had a couple of games where they've lost down the stretch against some really good teams, especially at home. So it was important for us to go out there and take advantage of the opportunity.\"\n\nHarden, who posted a triple-double in his previous two games, added nine assists and seven rebounds.\n\nThe Rockets had a three-point lead with five minutes left in the first quarter when Harden took over, scoring all of Houston's points in a 17-9 surge to make it 35-24. Harden, who was named Western Conference Player of the Week on Monday, made a pair of 3s, all three shots after being fouled on a 3-pointer and a nifty reverse layup in that span.\n\nHe made each of the eight shots he attempted in the quarter to set a career high for points in a period.\n\n\"The first quarter was ridiculous,\" Houston coach Mike D'Antoni said.\n\nThe Sixers were led by Joel Embiid and Ersan Ilyasova, who had 13 points apiece.\n\nHarden cooled off after his huge first quarter and didn't score in the second period, but the Rockets still had a 65-52 lead at the break.\n\nThe 76ers made just five of 19 shots in the third quarter, and Houston stretched its lead to 93-68 entering the fourth.\n\n\"We felt like it was still in us to make this into a game, but the game got away from us,\" coach Brett Brown said. \"We saw a great player dominate the first period and we dug ourselves a hole from the beginning.\"\n\nHarden is off to a stellar start this season in his first season in D'Antoni's fast-paced offense. He has scored at least 24 points in each of Houston's first 10 games this season.\n\nTIP-INS\n\n76ers:  Embiid, who returned after sitting out the last game to rest, led Philadelphia with 10 rebounds. ... Nik Stauskas scored 12 points, and Dario Saric and Gerald Henderson each had 11.\n\nRockets: The Rockets made 17 3-pointers and have made at least 10 3s in nine straight games, which ties a franchise record. ... Nene had 13 points for his third double-digit game this season. He added a block to give him at least one in six straight games. ... Clint Capela had 13 rebounds.\n\nBLOCK PARTY\n\nThe Rockets had a season-high 10 blocks. Capela led the way with a career-high five and five other players, including Harden, had one apiece. Harden raved about the work of Capela, who took over for Dwight Howard at center this season.\n\n\"If he plays like that we're going to be really good,\" Harden said.\n\nTHEY SAID IT\n\nPhiladelphia's Robert Covington on the struggles of the 76ers, who have won just one game: \"We are still trying to figure things out. A lot of guys haven't played a lot of basketball together. We see a lot of what we're capable of, it's just a matter of time before all things come together.\"\n\nBEVERLEY'S RETURN\n\nHouston guard Patrick Beverley is nearing a return after missing all season after arthroscopic surgery on his left knee. D'Antoni said he expects him to play sometime this week and there is a possibility he could make his debut as early as Thursday. D'Antoni said he would start when he returns.\n\nBeverley averaged 9.9 points, 3.5 rebounds and 3.4 assists in 71 games last season.\n\nUP NEXT\n\n76ers: Host Washington on Wednesday as the team begins a stretch of four of the next five at home.\n\nRockets: Will make a one-game road trip to Oklahoma City on Wednesday before returning for two at home against Portland and Utah.",
  "source": "espn_api",
  "crawled_at": 1764995793.820531
}