{
  "game_id": "0021901271",
  "espn_id": "401224746",
  "date": "Aug 06, 2020",
  "matchup": "LAC @ DAL",
  "headline": "Leonard's 29 points lead Clippers past Mavericks, 126-111",
  "body": "LAKE BUENA VISTA, Fla. --  Kawhi Leonard scored 29 points to help the Los Angeles Clippers beat the Dallas Mavericks 126-111 on Thursday night in a possible playoff preview.\n\nPaul George scored 24 points and Ivica Zubac added 21 points on 10-for-10 shooting and 15 rebounds for the Clippers, who strengthened their hold on the No. 2 spot in the Western Conference standings.\n\nThe Clippers entered the night a just half game ahead of Denver, but they shot 54% against the Mavericks to improve to 2-2 in the restart.\n\nKristaps Porzingis scored 30 points and Luka Doncic added 29 for Dallas, which fell to 1/3 in the restart. Dallas likely will finish as the No. 7 seed, making a first-round matchup with the Clippers a strong possibility.\n\n\"That's obviously going to be a tough matchup,\" Porzingis said. \"They're one of the favorites to win it all. They have multiple guys that have been there already. But we're looking forward to the challenge and getting experience in that.\"\n\nDoncic was coming off a monster game -- 34 points, 20 rebounds and 12 assists against the Sacramento Kings on Tuesday. He made 10 of 21 shots against the Clippers, including 6 of 13 3-pointers.\n\n\"Luka's just a handful,\" Clippers coach Doc Rivers said. \"It takes a whole team to guard him. I thought our guys did a pretty good job overall. We lost him a couple times, which you can never do. So there's a lot of room for improvement.\"\n\nThe Clippers led Dallas by 12 in the third quarter before the Mavericks rallied and tied the game at 101 midway through the fourth. Los Angeles responded with a 9-0 run to regain control. The Clippers shot 62% in the fourth quarter to pull away.\n\n\"I just liked how we played overall,\" Rivers said. \"We played like a team tonight, on both ends.\"\n\nThough the Mavericks fell to 1/3 in the restart, Doncic remained confident.\n\n\"We're a great team,\" he said. \"We've always got chances, no matter what. I think some people count us out, but we're not out. We'll give our max.\"\n\nTIP-INS\n\nClippers: Patrick Beverley out with a left calf strain. He was injured against Phoenix on Tuesday. ... Outrebounded the Mavericks 45-37. ... Marcus Morris had 16 points on 5 for 7 shooting.\n\nMavericks: Seth Curry sat out his second straight game with a right leg injury. ... Made 17 of 48 3-pointers.\n\nSTEPPING UP\n\nThe Clippers said Zubac tied a franchise record for most field goals made without a miss. The 7-foot-1 center tied the mark set by Charles Smith against Denver in April 1992.\n\n\"I just kept doing my job of rolling and sealing in the paint, and my teammates kept finding me,\" he said. \"They had confidence in me. Got some easy offensive rebounds, putbacks. It felt good.\"\n\nThe Clippers also said Zubac became the first player in franchise history to have at least 20 points and 15 rebounds in under 25 minutes played. He posted season highs in points and rebounds in just over 24 minutes.\n\nQUOTABLE\n\nPorzingis, talking about recovering from layoff and knee injury: \"I still feel like I'm only about 75, 80% back in the rhythm of the game and the feel for all those little details and things like that. So I'm still on my way there.\"\n\nSTAT LINES\n\nThe Mavericks are allowing 126.5 points per game in the restart and have allowed at least 110 points in all four games.\n\nUP NEXT\n\nClippers: Play the Portland Trail Blazers on Saturday.\n\nMavericks: Play the Milwaukee Bucks on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996485.442368
}