{
  "game_id": "0022300947",
  "espn_id": "401585575",
  "date": "Mar 13, 2024",
  "matchup": "ORL vs. BKN",
  "headline": "Paolo Banchero scores 21, leads Magic over Nets 114-106",
  "body": "ORLANDO, Fla. -- — Paolo Banchero handled the finesse part and let his Orlando teammates handle the physicality.\n\n\r\n              He made all six of his shots and eight of nine free throws, finishing with 21 points, and had nine assists Wednesday night in the Magic's 114-106 win over the Brooklyn Nets.\n\n\r\n              “I give a lot of credit to Paolo,” said Magic center Wendell Carter Jr., who had 15 points and eight rebounds. “I’ve seen him kind of set the tone for everyone else before, and that was his approach tonight. We were a lot more physical than they were tonight.”\n\n\r\n              Six other Orlando players scored in double figures including Jalen Suggs, who scored 11 of his 14 points in the first quarter to help the Magic take a 17-point lead. They would lead the remainder of the game.\n\n\r\n              After sitting out Sunday's loss to Indiana with a right thigh contusion, Suggs established the Magic's physicality from the start, especially on the defensive end.\n\n\r\n              “He’s willing to do what a lot of guards do not want to do, and that is pick up full court and be a pest,” said Jonathan Isaac, who hit three 3-pointers and had two of Orlando's six blocks. “It definitely takes our team to a new level. We feed off that physicality, that energy.”\n\n\r\n              “That's a physical team,” said Nets interim coach Kevin Ollie. “They just did a really good job of taking the physicality to us, and we just cannot allow a team to do that, especially a team that good.”\n\n\r\n              Cam Thomas led the Nets with 21 points and eight rebounds.\n\n\r\n              Mikal Bridges scored all 17 of his points in the second half for Brooklyn, and Dennis Schroeder and Cam Johnson added 13 points each.\n\n\r\n              Suggs hit three 3-pointers and Orlando shot 67% in the first quarter to grab a 33-16 lead.\n\n\r\n              Thomas and Dennis Smith led a 16-5 run to close out the first half with Brooklyn behind just 61-54.\n\n\r\n              “We have to show a physicality, a toughness, and we just didn’t do it tonight,” Ollie said. “We had spurts, got back in the game, but you can’t get down by 15 and 18 in the first quarter, especially on the road.”\n\n\r\n              The Nets were down by eight early in the third quarter when Nic Claxton was called for a technical foul after his right elbow caught Suggs on the jaw. The first of three technicals on the Nets opened a 19-8 spurt that pushed the Magic's lead back to double figures.\n\n\r\n              Schroeder scored five points of a 9-0 Brooklyn run that got the Nets back to within 98-90. But Joe Ingles responded with a 3-pointer that bounced high off the board and dropped in with 7:14 remaining.\n\n\r\n              “They just hit some tough shots, some lucky shots,” said Thomas. \"But you just have to live with shots like that. It's an 11-point lead at that point, so you just have to try to get the lead back down again.”\n\n\r\n              The Nets never did, losing for the second time in four games against the Magic this season.\n\n\r\n              The Magic shot 51.9% for the game, moving to 20-1 on the season when they shoot 50% or better.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Visit Indiana on Saturday night.\n\n\r\n              Magic: Visit Toronto on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995686.334273
}