{
  "game_id": "0021900293",
  "espn_id": "401160935",
  "date": "Dec 02, 2019",
  "matchup": "CHA vs. PHX",
  "headline": "Oubre’s late 3s lift Suns past Hornets 109-104",
  "body": "CHARLOTTE, N.C. --  It didn’t matter to Kelly Oubre Jr. that he missed his first seven shots from beyond the arc.\n\nOubre learned a long time ago how important it is to keep on shooting.\n\nOubre made his last two 3s, both coming in the final 55 seconds, and finished with 23 points as the Phoenix Suns overcame a seven-point deficit in the final minute to beat the Charlotte Hornets 109-104 Monday night.\n\n“I was 0 for 7 at the time, but I just knew I could shoot the ball,” Oubre said. “I knew if I kept at it with the right mechanics they would fall.”\n\nOubre said he’s worked tirelessly on his jump shot, eager to prove he can be a consistent 3-point shooter.\n\n“People say that is one of my flaws,” Oubre said. “They say I can be a more consistent jump shooter. But at the end of the day, I am getting better.”\n\nDevin Booker added 23 points and Dario Saric had 16 points and 10 rebounds for the Suns, who snapped a three-game skid.\n\nMarvin Williams led the Hornets with a season-high 22 points. Devonte Graham finished with 15 points and 12 assists but was just 1 of 10 from beyond the 3-point arc and had four turnovers, including a big one late in the game.\n\nThe Suns led by 20 at the break but squandered that lead and trailed by five in the final minute. That’s when Oubre knocked down back-to-back 3s to put the Suns ahead with 19.8 seconds left.\n\nThe Hornets were setting up for the potential winning shot when P.J. Washington’s handoff went off Graham’s leg with Oubre defending the play. Ricky Rubio added two free thows to push the lead to 107-104.\n\nGraham had a chance to tie it but airballed a shot from the top of the key with 9 seconds left.\n\nA series of mistakes in the final minute left Hornets coach James Borrego upset after the game.\n\n“We know our job on a free throw box out,” Borrego said. “I don’t care if you’re 18, 20 or 40 years old out there. You know what we’re supposed to do. You know what we do on our coverages down the stretch. If you miss a shot, so be it. You may have a turnover once in a while, but there are some things that happened down the stretch that are inexcusable and just poor basketball.”\n\nTIP-INS\n\nSuns: Were outrebounded 53-37. ... Booker was 3 of 10 from 3-point range. ... Frank Kaminsky had 12 points in his return to Charlotte. ... Ty Jerome made his NBA debut. He had four points and four assists in 12 minutes.\n\nHornets: Nic Batum left the game in the first half with hand discomfort. It’s the same hand that kept Batum out of 11 games earlier this season. ... Bismack Biyombo got a rise and a lot of laughs from his teammates when he successfully executed a Euro-step on a fast break.\n\nSLOW STARTS\n\nBefore the late-game collapse, it appeared the Hornets were going to overcome a horrible first half in which they committed 15 turnovers and scored just 39 points while going 4 for 16 from 3-point range.\n\nWilliams said he wonders how good the Hornets could be if they played with the same sense of urgency early in games as they down when they fall behind.\n\n“That’s the big question around here,” Williams said. “It feels like we never really play as hard as we can until we get down by 5, 10 or 15.”\n\nTIGHT COACHES\n\nMonty Williams and Borrego once worked together in the film room for the San Antonio Spurs.\n\nOn Monday night they got to coach against each other.\n\n“We got close, our families got close and when I got the job in New Orleans, Pop (Gregg Popovich) gave me a call and said one of the best things you could do was hire JB, and it was,” Williams said of his friendship with Borrego. “We’ve been pretty tight ever since. ... We’ve been together for a while and I’m just happy that he’s getting to run his own program, because he’s a good dude.\n\nCHALLENGE THAT\n\nBoth coaches won challenges and had foul calls overturned.\n\nCELEBRITY WATCH\n\nLongtime Spurs guard Tony Parker, who finished his NBA career with the Hornets, was on hand for the game.\n\nSo was North Carolina Tar Heels basketball coach Roy Williams.\n\nUP NEXT\n\nSuns: Travel to face Orlando on Wednesday night.\n\nHornets: Host the Warriors on Wednesday night. Charlotte won 92-87 at Golden State on Nov. 2.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996093.682119
}