{
  "game_id": "0022000023",
  "espn_id": "401267183",
  "date": "Dec 26, 2020",
  "matchup": "DET vs. CLE",
  "headline": "Sexton scores 32 points, Cavs beat Pistons 128-119 in 2 OT",
  "body": "DETROIT -- — The Cleveland Cavaliers took full advantage of Detroit's inability to close out games.\n\n\r\n                    Collin Sexton scored 32 points and three of his teammates had at least 21 points, helping Cleveland  beat Detroit  128-119 in two overtimes Saturday night.\n\n\r\n                    “Multiple opportunities where we could’ve given in, multiple opportunities that we could've lost the fight,\" Pacers coach J.B. Bickerstaff said. “Every player, to a man, decided that was not going to happen. We will not quit and that’s a testament to those guys and building our identity.\"\n\n\r\n                    While the Cavs improved to 2-0, the rebuilding Pistons dropped to 0-2 after also struggling down the stretch in their season-opening loss at Minnesota.\n\n\r\n                    “The positive is we put ourselves in a position to win two straight games,\" Detroit coach Dwane Casey said.\n\n\r\n                    Cleveland center Andre Drummond had 23 points, 16 rebounds, five assists, four steals and three blocks against his former team.\n\n\r\n                    “A lot of memories just rushed into my head,\" said Drummond, who was drafted No. 9 overall by Detroit in 2012 and traded to the Cavs last season.\n\n\r\n                    Darius Garland added 21 points and a career-high 12 assists, setting the tone for a young backcourt with Sexton that combined to score 49 points in the season-opening win over Charlotte.\n\n\r\n                    “Our two young guards carried us and put us in a position to win,\" Bickerstaff said.\n\n\r\n                    Cleveland reserve Cedi Osman had 22 points, Kevin Love scored 15 points after missing the opener with a calf injury and JaVale McGee had 11 points off the bench.\n\n\r\n                    Jerami Grant had 14 of his 28 points in the third quarter, when the Pistons took control before blowing it, and Blake Griffin finished with 26 points.\n\n\r\n                    Detroit's Derrick Rose had 13 points, missing 11 of 15 shots, and had some costly turnovers.\n\n\r\n                    Cleveland led 59-53 at halftime with three scorers — Sexton, Osman and Garland — already in double figures. Griffin had 18 points at halftime, scoring all his points on 3-pointers with just two misses beyond the arc.\n\n\r\n                    Detroit closed the third with a 14-0 run, capped by Grant’s 3-pointer from the team’s logo at midcourt, after the Cavs led by 11 earlier in the quarter.\n\n\r\n                    The Pistons were ahead 101-93 with three-plus minutes left in regulation and allowed the Cavs to score the final eight points — five on Drummond's free throws — in the quarter to extend the game.\n\n\r\n                    Rose helped the Pistons take a nine-point lead in overtime. He later lost opportunities to seal the victory with an unforced turnover while being guarded by Drummond with 13 seconds left and by losing the ball by dribbling it off Drummond's foot to give it back to the Cavs with 1.2 seconds left.\n\n\r\n                    “I’ll take Derrick Rose going to the basket,\" Casey insisted.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavs: Forward Isaac Okoro, the No. 5 overall pick in this year, was 0 for 4 and scoreless in 42 minutes ... Cleveland was without Matthew Dellavedova due to a concussion, Dylan Windler, who broke his left hand in the season-opening win over Charlotte and 2019 first-round pick Kevin Porter Jr., who faces charges of improperly handling firearms in a vehicle. ... Bickerstaff has a 7-6 record with the Cavs, who had him take over in February when former Michigan coach John Beilein resigned during his first season.\n\n\r\n                    Pistons: Team owner Tom Gores acknowledged the franchise is rebuilding with a revamped roster and he hopes fans are patient with the young team during a pregame news conference on a Zoom call. “It’s too early to talk about the playoffs,\" Gores said. “This is a very young team.\" ... Detroit was allowed to have up to 250 spectators in the stands and there were about 100 family members of players and coaches, team employees and invited guests in attendance.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Host Philadelphia on Sunday night.\n\n\r\n                    Piston: Play at Atlanta on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997926.707644
}