{
  "game_id": "0021600112",
  "espn_id": "400899562",
  "date": "Nov 09, 2016",
  "matchup": "OKC vs. TOR",
  "headline": "DeRozan scores 37, leads Raptors past Thunder 112-102",
  "body": "OKLAHOMA CITY --  DeMar DeRozan won a shootout with Russell Westbrook, scoring 37 points to lead the Toronto Raptors to a 112-102 victory over the Oklahoma City Thunder on Wednesday night.\n\nDeRozan, the NBA's leading scorer with a 34.1 average heading into the game, made 13 of 22 field goals and 11 of 15 free throws.\n\n\"You know, sometimes you've got to tip your hat, and good offense can beat great defense,\" Thunder coach Billy Donovan said. \"He had that happen several times where he made some very, very difficult shots.\"\n\nWestbrook had 36 points, seven rebounds and seven assists, but he made just 9 of 26 shots and committed eight turnovers.\n\n\"I thought everybody that guarded him did a decent job, but it was a five-man job,\" Raptors coach Dwane Casey said. \"Not one guy is going to stop him, and I say that all the time. It's on the team.\"\n\nKyle Lowry added 19 points, 13 assists and nine rebounds and Patrick Patterson had 13 points for the Raptors. Toronto, which shot 51.8 percent from the field, has won four of five.\n\nThe Thunder (6-2) entered the night tied for the NBA's best record, but their offense was inconsistent against the Raptors, and they couldn't find and answer for DeRozan. Victor Oladipo scored 18 points and Steven Adams added 14 points and 12 rebounds for Oklahoma City.\n\nThe Raptors led 62-55 at halftime behind DeRozan's 22 points. Toronto scored 16 points off 11 Oklahoma City turnovers in the first half.\n\n\"Little things like us turning the ball over, then leading to fast breaks,\" Oladipo said. \"Rotations weren't great today. Little things like that that we can correct. We've just got to continue getting better and push forward.\"\n\nA bounce pass by Lowry led to a jam by DeMarre Carroll that gave Toronto a 68-59 lead, and a basket by Pascal Siakam bumped the lead to 11 and led to a timeout by the Thunder. DeRozan's mid-range jumper in the closing seconds of the third quarter gave the Raptors an 88-75 lead.\n\nThe Thunder opened the fourth quarter with a 9-1 run to cut the deficit to 89-84. Oklahoma City eventually cut the deficit to four, but the Raptors rallied, and Lowry's 3-pointer bumped Toronto's lead back to 10 with 3:32 to play.\n\n\"DeMar did a great job of getting to his spots, getting to the free throw line, and Kyle did a great job running the team,\" Oladipo said. \"We're going to have to do a better job next time we play them.\"\n\nTIP-INS\n\nRaptors: DeRozan scored 11 points on 5-for-9 shooting in the first quarter. ... Shot 13 for 23 in the second quarter and outscored the Thunder 42-28. ... C Jonas Valanciunas missed his second straight game with a left knee contusion. ... F Terrence Ross sat out with a sprained right index finger. ... C Lucas Nogueira scored 10 points on 5-for-5 shooting and had seven rebounds.\n\nThunder: Scored the game's first 12 points. ... Shot 52.6 percent in the first quarter. ... Donovan was called for a technical foul late in the second quarter. ... Made just 12 of 34 3-point attempts.\n\nSTAT LINES\n\nWestbrook shot a season-high 12 3-pointers, and made three. It followed a 1-for-6 effort beyond the arc against the Miami Heat on Monday. He's hit a bit of a rough patch after a blistering start, making 14 of 42 shots his past two games combined.\n\nQUOTABLE\n\nDeRozan on fellow Los Angeles native Westbrook: \"I've known Russ way before the NBA was thought of. It's just a thing. You always support guys from L.A. To see the type of player he is -- when you start naming off players from L.A., you put in a Russ, myself and all the other guys from L.A. -- it's a great group of guys. It's great to see what he's doing. The respect has always been there.\"\n\nUP NEXT\n\nRaptors: Play at Charlotte on Friday in an early matchup of leaders in the East.\n\nThunder: Host the Clippers on Friday in a rematch of Oklahoma City's 85-83 win in Los Angeles on Nov. 2.\n\n---\n\nFollow Cliff Brunt on Twitter (at)CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995335.3716989
}