{
  "game_id": "0021800252",
  "espn_id": "401070933",
  "date": "Nov 21, 2018",
  "matchup": "CHA vs. IND",
  "headline": "Lamb scores 21, Hornets topple Pacers 127-109",
  "body": "CHARLOTTE, N.C. --  The Indiana Pacers paid so much attention to Kemba Walker on Wednesday night they seemed to forget about the rest of the Charlotte Hornets.\n\nWalker drew plenty of attention from the Pacers defense in the pick-and-roll after his recent scoring outburst, which allowed his teammates to get open looks from 3-point range.\n\nThe NBA's leading scorer going into the game finished with 16 points and a season-high 11 assists as the Hornets defeated the Pacers 127-109.\n\nWalker had scored 103 points in his previous two games, including 60 against the Philadelphia 76ers on Saturday night. But the two-time All-Star only attempted 10 shots against the Pacers.\n\n\"About time he decided to start passing the ball,\" joked Hornets coach James Borrego, who has encouraged Walker to shoot as much as he can this season.\n\nBorrego said the Hornets offense starts with Walker.\n\n\"He generates so much for us,\" Borrego said. \"I think this is where we have to go as a team right now. The more teams want to put pressure on him, put two guys on the ball, you see what we can accomplish without Kemba having to go for big numbers.\"\n\nJeremy Lamb was one the beneficiaries of the open looks, scoring 21 points on a career-high five 3-pointers. He also attacked the rim well.\n\n\"Kemba can facilitate, he can score, he can do whatever he wants on the court,\" Lamb said. \"Today he facilitated and we were able to knock down some shots.\"\n\nCharlotte shot 62 percent from 3-point range, making a season-high 18 of 29 shots from beyond the arc.\n\n\"Whatever the defense give me, I'm trying to take advantage of that and tonight when they were up in the pick-and-rolls I was just getting rid of the basketball and my teammates were just making shots,\" Walker said.\n\nSaid Borrego: \"Teams will have to decide how they want to play us with Kemba. But no matter what they do, I trust our guys are getting better and understanding spacing.\"\n\nDwayne Bacon had 18 and Cody Zeller 15 for the Hornets, who improved to 6-3 at home.\n\nBojan Bogdanovic had 20 points for the Pacers, who played for a second straight game without Victor Oladipo, who remains out with a sore right knee. Indiana had its three-game winning streak halted.\n\n\"Walker did a good job of scoring when he had opportunities but setting his teammates up and they were knocking down shots,\" Pacers coach Nate McMillan said. \"Just couldn't get stops tonight. Sometimes that happens.\"\n\nTIP INS:\n\nPacers: Domantas Sabonis was 7 of 7 for 15 points before rolling his ankle midway through the second quarter. He returned in the second half, but never scored again and fouled out with 6 minutes left.\n\nHornets: Marvin Williams was taken to the locker room in the third quarter with a face contusion and a bloody nose after taking a knee to the head from Young while on the floor. He returned to the bench, but did not play. ... Malik Monk broke out of a 0-for-14 slump from beyond the arc by making 3 of 6 3-pointers.\n\nKAMINSKY SEES ACTION\n\nFrank Kaminsky had 11 points off the bench, which was more than he had scored all season (nine).\n\nBorrego praise Kaminsky for having a \"fantastic\" attitude and continuing to work hard, even though he had only played a limited role in five games this season after being a role player last year under coach Steve Clifford.\n\n\"I didn't know when the opportunity was going to come,\" Kaminsky said. \"Obviously with Willy being hurt wasn't how I wanted it to happen. But coach has told me all season so far just to stay ready, be ready for whatever comes and then when you get the opportunity you've got to be ready to take it. I was just really excited that I got that chance tonight.\"\n\nBRIDGING THE GAP\n\nRookie Miles Bridges had a nice stretch late in the third quarter to help push Charlotte's lead to 21 points. He knocked down back-to-back 3-pointers and then rejected shots by Thaddeus Young and Cory Joseph seconds later.\n\nUP NEXT\n\nPacers: Host Spurs on Friday night.\n\nHornets: Visit Thunder on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994425.8538618
}