{
  "game_id": "0022400247",
  "espn_id": "401704813",
  "date": "Nov 18, 2024",
  "matchup": "TOR vs. IND",
  "headline": "Barrett scores season-high 39 as Raptors snap 7-game losing streak, beat Pacers 130-119",
  "body": "TORONTO -- — RJ Barrett scored a season-high 39 points, Jakob Poeltl had 30 points and 15 rebounds for his third straight double-double and the Toronto Raptors snapped a seven-game losing streak by beating the Indiana Pacers 130-119 on Monday night.\n\n\r\n              Toronto came in with the NBA’s worst record at 2-12 and won for the first time since beating Sacramento in overtime on Nov. 2.\n\n\r\n              Barrett shot 13 for 21, going 4 for 8 from 3-point range and making 9 of 12 at the free throw line. He finished with nine rebounds.\n\n\r\n              Gradey Dick scored 15 points for Toronto. Ochai Agbaji and Davion Mitchell each had 11 and all five Raptors starters scored in double figures.\n\n\r\n              Benedict Mathurin scored 17 of his 28 points in the fourth quarter and Pascal Siakam had 25 points and 10 rebounds against his former team as the Pacers lost for the third time in four games.\n\n\r\n              Indiana’s Obi Toppin had nine of his 19 points in the final period. Tyrese Haliburton scored 16 points and T.J. McConnell added 10.\n\n\r\n              Pacers center Myles Turner sat out because of a sore right calf. Turner scored a season-high 34 points in Sunday’s home win over Miami.\n\n\r\n              Takeaways\r\n              Pacers: Haliburton shot 5 for 18, missing nine or more field goal attempts for the fourth time in six games. He finished 2 for 9 from 3-point range.\n\n\r\n              Raptors: All three of Toronto’s wins have come at home. They’re 0-8 on the road.\n\n\r\n              Key moment\r\n              Mathurin’s layup with 6:47 left in the fourth cut the gap to 106-99. After a Toronto timeout, Barrett scored three points as the Raptors used a 5-0 run to restore a double-digit advantage.\n\n\r\n              Key stat\r\n              Toronto won despite 23 turnovers leading to 24 points for Indiana. The Raptors had 10 turnovers in the third.\n\n\r\n              Up next\r\n              Indiana visits Houston on Wednesday, while Toronto hosts Minnesota on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996991.766811
}