{
  "game_id": "0021300790",
  "espn_id": "400489663",
  "date": "Feb 13, 2014",
  "matchup": "CHI vs. BKN",
  "headline": "Taj Gibson, Carlos Boozer combine for 31 as Bulls cruise",
  "body": "CHICAGO -- Every NBA team wants to enter the All-Star break on a positive note and get some rest.\nThe Chicago Bulls were able to do just that by winning their third straight.\nTaj Gibson scored 16 points and Carlos Boozer returned from an injury to add 15 in Chicago's 92-76 victory over the Brooklyn Nets on Thursday night. The Bulls (27-25) moved two games above .500 for the first time since they were 6-4 on Nov. 21. They have won four of five.\n\"We're happy, but we're not satisfied. We're hungry,\" said Joakim Noah, who had 14 points and 13 rebounds for his fifth straight double-double.\nPaul Pierce led Brooklyn with 15 points. The Nets are 24-27, going 14-6 since Jan. 1.\n\"I think everybody needs a break right now,\" Pierce said. \"Everybody's played a lot of games. Every team in the league has played over 50 games. I wish the break was a little bit longer, especially for us older guys.\n\"But it is what it is and guys can go home or do whatever they're going do over the weekend and recharge their bodies and get ready for a second-half run.\"\nThe Nets pulled within three on Andrei Kirilenko's 3-pointer with 6:29 left. D.J. Augustin answered with a 3-pointer to start a 9-0 Chicago run.\n\"We've got to get to the point where we're playing better defense, especially when Kevin (Garnett) comes out the game,\" Pierce said. \"That's seems to be one of our glaring weaknesses right now. We can sustain an acceptable level of defense when he's in the game, but he's not going to be able to play 48 minutes a night, so we have to have guys ready to come in and sustain the type of intensity he brings to help this team win.\"\nThe Bulls shot 50 percent to the Nets' 38.8 percent. Mike Dunleavy and Jimmy Butler each had 14 points for the Bulls, who are 15-7 since Jan. 1.\n\"We're playing very well,\" said Boozer, who missed the last three games because of a strained left calf. \"It's good to have a chance to have a break and get away and come back ready for the finish.\"\nBulls coach Tom Thibodeau said Boozer was better than expected in his return.\n\"A little winded,\" Thibodeau said. \"Once he got a second wind he was very, very good.\"\nThe Nets' Joe Johnson and Butler were called for technical fouls and Johnson for an offensive foul after they exchanged words and had to be separated by their teammates with 5:57 left in the third quarter.\nJohnson elbowed Butler on the play, and Butler was restrained by his teammates before Johnson poked Butler's face.\n\"I don't say too much, so if I'm mad, you must have really done something to get underneath my skin,\" Butler said. \"He poked me in the head then backed backwards. I don't think he wanted any of that. I don't play to fight, but come on, man, just play basketball.\"\nDeron Williams added 13 points for the Nets, Johnson had 11, and Shaun Livingston 10.\nBrooklyn cut the lead to 56-53 on Pierce's free throws with 7:59 left in the third quarter. The Bulls extended the lead to 62-53 after baskets by Noah and Boozer and two free throws by Kirk Hinrich.\nThe Bulls are 2-0 against the Nets this season. Chicago won 95-78 on the road on Christmas Day.\nThe Bulls have won four straight against the Nets, who have dropped 13 of their last 16 regular-season games at the United Center.\nGame notes\nThibodeau said Gibson's minutes will remain similar to how much he was playing in Boozer's absence. Gibson has averaged 19.2 points and 9.8 rebounds in eight starts. \"For us to achieve what we want to achieve, Carlos has to play,\" Thibodeau said. \"He has a big role on this team.\" ... Nets guard Marquis Teague was acquired from the Bulls on Jan. 21. \"He's been great,\" Nets coach Jason Kidd said. \"He's done everything that we've asked him to do. He's only 20, so (we're looking) for him to continue working and when he's out there on the floor to get better.\"",
  "source": "espn_api",
  "crawled_at": 1764992651.155924
}