{
  "game_id": "0022300041",
  "espn_id": "401584129",
  "date": "Nov 21, 2023",
  "matchup": "POR @ PHX",
  "headline": "Durant scores 31, now 11th all time in points, Suns roll past Portland 120-107",
  "body": "PHOENIX -- — Kevin Durant scored 31 points, passing Elvin Hayes for 11th place all time, and the Phoenix Suns defeated the Portland Trail Blazers 120-107 in an In-Season Tournament game on Tuesday night.\n\n\r\n              Durant, playing in his 1,000th NBA game, needed 14 points to pass Hayes, who had 27,313 in his career. He achieved that in the first quarter on 6-of-6 shooting, including a 3-pointer and a free throw. He finished 13 of 21 from the field, making both 3-point tries, in 37 minutes.\n\n\r\n              “Being amongst the all-time greats, the guys who set the standard and made the NBA what it is today is an honor,” Durant said. “It’s pretty cool and I just gotta keep going.”\n\n\r\n              Durant scored 39 points in 46 minutes in a double-overtime win at Utah on Sunday. He has 27,330 in his career.\n\n\r\n              “Incredible,” Suns coach Frank Vogel said. “He's one of the best to ever do it. And he's not slowing down.”\n\n\r\n              Devin Booker scored 28 points and was 10 for 10 from the free-throw line for the Suns, who won their fourth in a row overall and are 2-1 in West Group A in the tournament while the Trail Blazers finish group play at 1-3. Phoenix plays its final group game Friday at Memphis.\n\n\r\n              Deandre Ayton, booed heavily by the Footprint Center sellout crowd in his return to Phoenix, finished with 18 points and a team-high eight rebounds for the Trail Blazers, who lost their eighth in a row.\n\n\r\n              Ayton, the No. 1 overall pick in the 2018 NBA draft out of Arizona, played his first five seasons with the Suns. He was traded to Portland in a three-team deal that saw longtime Trail Blazers star Damian Lillard go to Milwaukee and the Suns acquire Grayson Allen and Jusuf Nurkic — both starters for the Suns on Tuesday.\n\n\r\n              “It was fun,” Ayton said. “They are always going to bring the crowd. Definitely felt the environment. I was just trying to do my best having fun.”\n\n\r\n              Nurkic scored 18 points and grabbed a game-high 12 rebounds for Phoenix. Nassir Little had 13 points for Phoenix and Eric Gordon added 10. The Suns had a 66-46 advantage in points in the paint and were 27 of 28 from the free-throw line.\n\n\r\n              “We're getting better. It's still a work in progress,” Vogel said. “We had a lot of great execution and possessions in the second half.”\n\n\r\n              Jerami Grant scored 26 points to lead Portland. Malcolm Brogdon returned from a strained left hamstring and scored 19 for the Trail Blazers, who rallied from 13 points down after the first quarter to tie it midway through the second. Phoenix led 56-51 at halftime and led by as many as 18 down the stretch.\n\n\r\n              “That is just an elite team that will be contending for a championship this year,” Portland coach Chauncey Billups said. “They outlasted us but for the most part I thought we played well. We fouled too much and gave them the free-throw line.\"\n\n\r\n              The Suns again played without Bradley Beal, sidelined with lower back spasms for at least two more weeks. Yuta Watanabe (deep bruise in left thigh) also was out for Phoenix.\n\n\r\n              UP NEXT\n\n\r\n              Portland: Hosts Utah on Wednesday.\n\n\r\n              Phoenix: Hosts Golden State on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996400.551563
}