{
  "game_id": "0021600698",
  "espn_id": "400900119",
  "date": "Jan 27, 2017",
  "matchup": "MIL @ TOR",
  "headline": "Lowry scores 32, Raptors end skid with 102-86 win over Bucks",
  "body": "TORONTO --  Faced with the prospect of the Toronto Raptors losing six straight games for the first time in more than four years, Kyle Lowry certainly lived up to his All-Star billing.\n\nWith 32 points and six assists in a game-high 38:45 of court time, the recently named Eastern Conference All-Star drove the Raptors to a 102-86 win over the Milwaukee Bucks on Friday night.\n\nIn the process, the Raptors snapped their longest losing streak of the season at five games, beating the Bucks for the seventh consecutive time and 13th in the last 14 meetings.\n\n\"We needed to get off this losing streak and everybody felt that tonight and we had an opportunity to do it,\" Lowry said. \"Friday night, our home crowd, we tried our best to win the game and we did it.\"\n\nWith fellow All-Star and leading scorer DeMar DeRozan sidelined for a third straight game due to a sprained ankle, it fell to Lowry to lead the Raptors in scoring for the third outing in a row. He shot 9 of 18 from the floor.\n\n\"I thought he stepped up. The bigger the moment, he performs,\" Toronto coach Dwane Casey said. \"It is the reason he is a three-time All-Star; he carried us.\"\n\nWhile Lowry captured the plaudits, Casey was equally complimentary of his team's defensive play, a sore point for the Raptors' coach during the losing streak. He singled out the play of DeMarre Carroll on another Eastern Conference All-Star, Giannis Antetokounmpo, who was held to 19 points, six rebounds and a game-high eight assists after burning the Raptors in the team's two previous meetings this season.\n\n\"I compared him to Magic Johnson at this stage,\" Casey said of the Bucks' forward. \"He has the same skill set and once he starts shooting that jump shot, he's going to be dangerous. I thought DeMarre did an excellent job on him.\"\n\nHaving trailed since the 4:49 mark of the first quarter and by as many as 19 at one point, the Bucks clawed to within seven entering the fourth. But powered by 3-pointers from Lowry and Patrick Patterson, the Raptors started the final period on a 13-5 run to take control again, handing Milwaukee its seventh loss in eight games.\n\nBucks coach Jason Kidd acknowledged his team \"didn't do a good job\" on Lowry. But after getting back into the game at the start of the fourth, he was disappointed Milwaukee couldn't push on from there.\n\n\"That group in the second quarter got us back in the game,\" Kidd said. \"From there, it's a 77-70 ballgame as bad as we were playing. We just got off to a bad start in the fourth quarter.\"\n\nJabari Parker led the way for the Bucks with 21 points and a career high-tying 13 rebounds for his first double-double of the season. While he said the team was remaining positive, he highlighted the poor start as really making it an uphill battle for the Bucks.\n\nAfter jumping out to an 11-5 lead, Milwaukee was unable to stop the Raptors from responding with a 31-6 run in the first quarter.\n\n\"That's where the game was lost, right in the first few minutes of the game,\" Parker said. \"We always trailed from there and it's bad playing with a deficit.\"\n\nTIP-INS\n\nBucks: Having entered the game leading the NBA in points in the paint with an average of 50.9, Milwaukee was held to 44. ... Milwaukee was outrebounded 47-43.\n\nRaptors: DeRozan (right ankle) missed his third straight game. ... With his 11 rebounds, the Raptors improved to 17-8 this season when Jonas Valanciunas reaches double digits in boards.\n\nDON'T LOOK NOW\n\nToronto has been second in the Eastern Conference for most of the season, but the recent five-game losing streak has the Raptors looking over their shoulder as Boston, Atlanta and Washington are all within 2 1/2 games. Casey is anything but surprised, though.\n\n\"Like I said, it's going to be a dog fight between two and four, five,\" he said. \"That group is all right there together, a lot of equal teams, so we've got to get ready for that mentally and physically.\"\n\nNORTH STAR\n\nLowry was given a standing ovation midway through the first quarter as a Jumbotron presentation recognized the guard for his third consecutive All-Star nod. Lowry was voted on as an Eastern Conference reserve Thursday and will join DeRozan at next month's game in New Orleans, the third time in franchise history that the Raptors will send two players to the game.\n\nFINDING THEIR TOUCH\n\nAfter shooting just 26 percent (36 of 140) from 3-point range during their five-game losing streak, Toronto started to heat up from beyond the arc, converting on 40 percent of its attempts Friday night as six players connected.\n\nUP NEXT\n\nBucks: Host Boston on Saturday, aiming to snap a two-game skid against the Celtics.\n\nRaptors: Host Orlando on Sunday, looking for an eighth straight home win over the Magic.",
  "source": "espn_api",
  "crawled_at": 1764995176.163821
}