{
  "game_id": "0021400004",
  "espn_id": "400578296",
  "date": "Oct 29, 2014",
  "matchup": "MIL @ CHA",
  "headline": "Kemba Walker's late heroics lift Hornets over Bucks in OT",
  "body": "CHARLOTTE, N.C. -- Kemba Walker didn't waste any time at all providing the Charlotte Hornets with a return on their investment.\nOne night after agreeing to a four-year, $24 million contract extension, the diminutive guard knocked down two huge shots, including the 21-footer from the top of the key with 5 seconds left in overtime to lift Charlotte to a 108-106 victory over the Milwaukee Bucks on Wednesday night.\nWalker scored a game-high 26 points and gave fans more reason to celebrate on a night when they welcomed the Hornets name back to the city after a 12-year absence.\n\nWalker struggled in the early going hitting just 2 of 8 shots in the first quarter and was just 9 of 26 for the game.\nBut he came up big when the team needed him most, swishing a tying 3-pointer with 1.6 seconds left in regulation to send the game into overtime and help the Hornets erased a 24-point third-quarter deficit and cap the largest comeback in Charlotte's NBA history -- Hornets or Bobcats.\n\"I was so high on adrenaline that I couldn't calm down,\" Walker said of his slow start. \"I was so anxious to be out there and the crowd was so into it. I was trying my best but it just wasn't working out for me. Those last couple of shots I finally really did relax.\"\nWalker battled through cramps in his right foot, but kept on playing.\n\"He's courageous,\" Hornets coach Steve Clifford said. \"I asked him if he was good and he said, `I'll make one more play.' And he did.\"\nMarvin Williams had 19 points, Michael Kidd-Gilchrist scored 17 and Al Jefferson finished with 14 points and 10 rebounds for Charlotte.\nLance Stephenson had seven points, 13 rebounds and eight assists in his Hornets debut and provided a boost after the Hornets fell behind 74-50 and the crowd starting booing.\n\"I would have booed, too,\" Walker said. \"I know it was tough to watch for those guys. We weren't playing any defense and lot of things weren't going our way.\"\nThe Bucks were led by Brandon Knight, who had 22 points and 13 assists.\nKhris Middleton had a chance to put the Bucks up by four points with 7.1 second left, but made only 1 of 2 foul shots setting up Walker's big 3.\nAfter Middleton made his second free throw, Walker took the inbounds pass, weaved through traffic and pulled up well beyond the 3-point arc. He elevated through his shot as fans in the lower section rose from their seats in unison, almost willing the ball into the basket.\nThe Bucks couldn't get a shot off at the end of regulation.\n\"Bad teams lose these types of games and this is something we are going to have to get over all year,\" said Bucks forward Jared Dudley.\nSTEPHENSON'S NIGHT:\nStephenson got off to a rough start missing his first six shots and failing to score until the 5:49 mark of the third quarter. But a high-flying dunk over Larry Sanders in the lane seemed to ignite the flamboyant swingman, who quickly helped the Hornets trim the lead to 15 entering the fourth quarter. Stephenson, who is battling a groin injury, left the game twice in the final few minutes because of cramping in his leg.\n\"If I ain't scoring I'm going to do other things,\" Stephenson said. \"I'm going to pass to my teammates, rebound, play a little defense and just help us win. I struggled on the offensive end and I'm going to get it together and just keep playing hard.\"\nPARKER's NBA DEBUT:\nThe Bucks finished with the worst record in the league last year and wound up drafting Jabari Parker from Duke with the No. 2 overall pick. Parker finished with eight points in his first NBA game.\n\"It was everything I expected, two great teams going down to the wire,\" Parker said. \"The better team won today but we're going to get better.\"\nTAYLOR PLEADS GUILTY\nHornets forward Jeffery Taylor pleaded guilty Wednesday to a domestic violence charge and admitted he pushed his girlfriend at a hotel in Michigan. Taylor pleaded guilty in East Lansing District Court to domestic abuse and malicious destruction of property charges. He faces up to 93 days in jail, but prosecutors say they won't oppose a diversion program that could clear Taylor's record if he complies with probation rules.\nTIP-INS\nBucks: O.J. Mayo was strong off the bench for the Bucks with 17 points on 6 of 10 shooting. ... The Bucks lost despite shooting 48.8 percent to Charlotte's 40.6 percent.\nHornets: Hornets general manager Rich Cho announced before the game the team has exercised its fourth-year option on forward Michael Kidd-Gilchrist and its third-year option on forward Cody Zeller. ... The Hornets introduced their alternate teal uniforms in front of a sold-out crowd.\nUP NEXT\nMilwaukee hosts Philadelphia on Friday.\nCharlotte hosts Memphis on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764991853.77248
}