{
  "game_id": "0022200263",
  "espn_id": "401468418",
  "date": "Nov 23, 2022",
  "matchup": "ATL vs. SAC",
  "headline": "Young has 35 points, Hawks end Kings' 7-game winning streak",
  "body": "ATLANTA -- — Trae Young scored 35 points, Clint Capela added 11 points and 14 rebounds and the Atlanta Hawks snapped the Sacramento Kings’ seven-game winning streak with a 115-106 victory Wednesday night.\n\n\r\n              Young had 10 points in the third, including a straightaway 3-pointer that gave the Hawks a 97-86 lead, and his 27-foot 3 made it 110-97 with 3:58 left in the game and brought a huge roar from the crowd as the Kings never really threatened the rest of the way.\n\n\r\n              Young iced it with a 3 inside the final minute to make it 113-102. \n\n\r\n              “We were just playing fast, playing aggressive, getting downhill,\" Young said. “When we get into the paint, whether we’re scoring in the paint or firing to somebody on the wing or the perimeter, it brings good offense. We were doing a good job of getting in the paint and making plays.\"\n\n\r\n              Sacramento went on a 15-4 run, pulling within six in the third on Malik Monk’s 3. The Kings entered the fourth trailing by nine but never got any closer than seven the rest of the way as De’Andre Hunter scored five straight points to push the lead to 107-95 midway through the fourth. \n\n\r\n              Monk led the Kings with a season-high 27 points, and Domantas Sabonis had 15 points and 13 rebounds. De’Aaron Fox, coming off two straight games with at least 32 points, finished with 18 points on 7-of-20 shooting for Sacramento, which ended its longest winning streak since Nov. 13-26, 2004. \n\n\r\n              Sacramento, playing on the second night of a back-to-back on the road, began the night third in the Western Conference. The Kings started the game leading the NBA in scoring (120.9) and field-goal percentage (.498), but they shot 46.1%, including 30% on 3s.\n\n\r\n              Coach Mike Brown sensed his team was dealing with tired legs.\n\n\r\n              “Maybe,\" Brown said. “We pressed pretty hard these last couple of weeks. We weren’t as focused as we’d been going into the game, and it showed, especially in the first half. Defensively Atlanta did a great job of moving bodies, moving ball. They were getting out in transition on our mistakes. Give our guys credit, though. They fought in the second half.\"\n\n\r\n              TIP-INS\n\n\r\n              Kings: outscored Atlanta 54-36 in the paint. ... Trey Lyles tied a career high in a regular-season game with five offensive rebounds. ... Sabonis surpassed 4,000 rebounds in his career. ... Monk scored 15 points in the first half.\n\n\r\n              Hawks: Young had five-point play in the third after hitting a 3 and getting fouled by Fox, who picked up a technical foul. Young hit both free throws. ... Dating to March 3, 2022, the Hawks have scored at least 100 points in 39 straight games, the third-longest scoring streak in franchise history and the longest such active streak in the NBA. \n\n\r\n              HE’S BACK\n\n\r\n              Huerter returned for the first time to State Farm Arena, where he averaged 12.1 points in 2021-22, the final year of a four-season run with the Hawks. He was traded to Sacramento in early July for Justin Holiday, Maurice Harkless and a future first-round draft pick.\n\n\r\n              “He’s bought in from day one,” Kings coach Mike Brown said before the game. “He’s fantastic on and off the floor. His work ethic shows.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Boston on Friday night.\n\n\r\n              Hawks: At Houston on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995206.701233
}