{
  "game_id": "0022400413",
  "espn_id": "401704979",
  "date": "Dec 26, 2024",
  "matchup": "ATL vs. CHI",
  "headline": "Hawks erase 21-point deficit by scoring 50 in the 4th quarter in a 141-133 win over the Bulls",
  "body": "ATLANTA -- — Jalen Johnson had a career-high 30 points and the Atlanta Hawks rallied from a late 21-point deficit by scoring 50 points in the fourth quarter in a 141-133 win over the Chicago Bulls on Thursday night.\n\n\r\n              Atlanta trailed 124-107 with 6:23 remaining in the game and used a 23-2 run to take its first lead since the first quarter. \n\n\r\n              Johnson added 15 rebounds and Trae Young scored 27 points, surpassing the 11,000 career point mark, and added 13 assists as the Hawks won their second straight.\n\n\r\n              Zach LaVine scored a season-high 37 points in the loss. Jevon Carter scored 19 of his 26 points in the first quarter as the Bulls lost their third straight despite shooting 54% (53 for 98) from the field.\n\n\r\n              Takeaways\r\n              Bulls: The Bulls trailed by seven points early before going on a 31-12 run in the first quarter for a 33-21 lead after a period. They held the lead until late in the fourth quarter.\n\n\r\n              Hawks: De'Andre Hunter, who scored 25 points, has finished with 15 or more points off the bench in 13 consecutive games. It's the longest such streak for a reserve player in Hawks' history. Six Atlanta players scored in double figures.\n\n\r\n              Key moment\r\n              With three minutes to go in the game, Young hit a tying 3-pointer — the first deadlock since the opener quarter — that sent the home crowd into a frenzy. Seconds later, Johnson took a steal down the floor and scored on a jam to give Atlanta the lead.\n\n\r\n              Key stat\r\n              Chicago hit 22 3-pointers, good for a franchise-record 31st straight game in which the Bulls have made at least 10 3s.\n\n\r\n              Up next\r\n              Atlanta hosts the Miami Heat, and Chicago hosts the Milwaukee Bucks. Both games are Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998298.3522382
}