{
  "game_id": "0021900782",
  "espn_id": "401161424",
  "date": "Feb 08, 2020",
  "matchup": "LAC @ MIN",
  "headline": "McLaughlin, Beasley, new-look Wolves rout Clippers 142-115",
  "body": "MINNEAPOLIS --  Even without D'Angelo Russell, the new era of the Minnesota Timberwolves is off to a flying start.\n\nMalik Beasley made his Minnesota debut with his first career double-double, Jordan McLaughlin scored a career-high 24 points, and the new-look Timberwolves snapped a 13-game losing streak with a 142-115 victory over the Los Angeles Clippers on Saturday night.\n\n\"Amazing, man,\" Beasley said. \"First career double-double. It don't get no better than that. And a `W' after 13 losses, that's the most important thing right there.\"\n\nBeasley, who arrived from Denver as part of Wednesday's four-team trade, scored 23 points and grabbed 10 rebounds. Karl-Anthony Towns just missed a triple-double with 22 points, 13 rebounds and nine assists for the Timberwolves, who won for the first time since Jan. 9.\n\nMcLaughlin added a career-high 11 assists as Minnesota scored its highest point total of the season thanks to a franchise-record 26 3-pointers and a season-high 39 assists.\n\n\"I think my dinner's going to taste a little better tonight,\" Timberwolves coach Ryan Saunders said. \"I might get a little more sleep. I'm just happy for that locker room. More than anything, I'm happy for this organization for having a game like tonight.\"\n\nKawhi Leonard scored 29 points and Paul George had 21 for the Clippers, who had a three-game win streak snapped.\n\n\"Just didn't bring it,\" Leonard said. \"Can't really explain it. There's no excuses for it. They played harder.\"\n\nThe Timberwolves turned over more than half their roster before Thursday's trade deadline. Three separate trades Wednesday and Thursday sent out seven players and brought in eight.\n\nThe most high-profile addition, Russell, did not play. Russell, who was acquired in a trade with Golden State on Thursday, sat out with a right quad contusion.\n\nMinnesota still had plenty of shooting. Ten Timberwolves players hit 3s, setting a franchise record. Beasley made a career-high seven 3s. Seven Minnesota players scored in double figures, including all five starters.\n\n\"When the new guys got into the locker room, they brought a lot of energy,\" McLaughlin said. \"As you could tell, it carried over today.\"\n\nThe Timberwolves shot 15 for 25 from 3-point range in the first half and took an 81-59 lead into halftime. The 81 points were a franchise record for points in a half and the most allowed by the Clippers in a half this season.\n\nMinnesota led by as many as 26 points in the second half. Los Angeles didn't get closer than 17.\n\n\"That was an awful, awful effort,\" Clippers coach Doc Rivers said. \"They outplayed us. They played harder. They were aggressive. They deserved to win.\"\n\nBeasley was 6 for 9 on 3s and scored 20 points in the first half. He scored 11 points in a span of 1:18 late in the second quarter.\n\n\"I was in the zone,\" Beasley said. \"I couldn't see anybody or hear anybody. It just felt good. I had great teammates passing me the ball and setting screens for me.\"\n\nTIP-INS\n\nClippers: Forward Marcus Morris, acquired in a trade with New York on Thursday, did not play. Guard Patrick Beverly missed the game with a right groin injury. ... The game was the start of a four-game road trip for Los Angeles. ... Amir Coffey, who played at the University of Minnesota, scored four points in 11 minutes.\n\nTimberwolves: Forward Jake Layman missed his 37th consecutive game with a left toe sprain. Forward Evan Turner, acquired in the four-team trade Wednesday, is not with the team. ... Russell addressed the crowd prior to tipoff. The nine 3-pointers Minnesota made in the first quarter were a franchise record for one quarter.\n\nOPPORTUNITY KNOCKS\n\nMcLaughlin is on a two-way contract. With Jeff Teague and Shabazz Napier gone in trades and Russell still waiting to make his Timberwolves debut, McLaughlin was the only true point guard available Saturday. His career highs in points and assists came in a team-high 37 minutes.\n\n\"The league is full of opportunities,\" McLaughlin said. \"When you get that opportunity, you have to seize the moment. That's what I'm trying to do, just go in there, playing hard, playing for my teammates and trying to make plays.\"\n\nUP NEXT\n\nClippers: At Cleveland on Sunday. Los Angeles has won the last three meetings.\n\nTimberwolves: At Toronto on Monday. The Raptors have won the last four meetings.",
  "source": "espn_api",
  "crawled_at": 1764996496.154481
}