{
  "game_id": "0022300048",
  "espn_id": "401584136",
  "date": "Nov 24, 2023",
  "matchup": "HOU vs. DEN",
  "headline": "Green, Sengun lead Rockets to 105-86 victory over Nuggets in NBA's In-Season Tournament",
  "body": "HOUSTON -- — Jalen Green scored 25 points, Alperen Sengun added 21 points and 14 rebounds and the Houston Rockets beat the slumping Denver Nuggets 105-86 on Friday night in the NBA's In-Season Tournament.\n\n\r\n              Houston improved to 2-1 in the tournament with a game left next week at Dallas. Denver completed group play 2-2. The defending champion Nuggets have lost five of seven after opening 8-1.\n\n\r\n              Nikola Jokic had a season-high 38 points along with 19 rebounds and eight assists for Denver. Aaron Gordon went 0 for 12 and had two points on a night the Nuggets shot 33.7%.\n\n\r\n              Houston coach Ime Udoka said the game plan was to make Jokic beat them. \n\n\r\n              “We guarded Jokic one-on-one and kept everybody else in check,” he said. “The focus was there to take the others out and in that sense it worked out well.”\n\n\r\n              The Rockets have won three in a row over the Nuggets, including both meetings this season, after dropping the previous 10.\n\n\r\n              “It’s an accomplishment,” Udoka said. “We’ll take it and learn from it and grow. It’s another win from the defending champions so that’s good.”\n\n\r\n              The Nuggets went 1-4 on this road trip that coach Michael Malone called “disappointing.” He said he was going to start trying different players in the rotation after Denver's bench scored just 10 points Friday. \n\n\r\n              “You've got to bring something to the party,” he said. \n\n\r\n              Houston was up by 15 entering the fourth quarter before the Nuggets scored the first six points of the quarter, capped by a 3 from Justin Holiday, to get to 84-75.\n\n\r\n              Sengun made a layup for the Rockets after that but was called for a foul on Jokic on the other end seconds later. Udoka was given a technical for arguing the call and Kentavious Caldwell-Pope made the technical free throw before Jokic made one of two free throws to cut the lead to nine again.\n\n\r\n              But Green was fouled on a dunk on the next possession and finished the 3-point play. Fred VanVleet then swiped the ball from Reggie Jackson and passed to Green for an alley-oop dunk to bring the crowd to its feet and leave the Rockets up 91-77 with less than seven minutes left. \n\n\r\n              The Rockets improved to 8-1 at home with the win, but are 0-5 on the road.\n\n\r\n              “(The fans) are putting on for us, showing up,\" Green said. “We've just got to get a win on the road now. I think that's our biggest goal. So that's what we're focused on.\"\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host San Antonio on Saturday night.\n\n\r\n              Rockets: Wrap up group play in the in-season tournament at Dallas on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995633.296084
}