{
  "game_id": "0022300881",
  "espn_id": "401585509",
  "date": "Mar 04, 2024",
  "matchup": "MIN vs. POR",
  "headline": "Rudy Gobert and Michael Conley power Timberwolves past Trail Blazers 119-114",
  "body": "MINNEAPOLIS -- — Rudy Gobert had 25 points and 16 rebounds for his 43rd double-double of the season, Michael Conley added 19 points and seven assists, and the Minnesota Timberwolves completed a four-game season sweep of Portland, beating the Trail Blazers 119-114 Monday night.\n\n\r\n              With the win, Minnesota (43-19) moved into a tie for first place in the Western Conference with Oklahoma City, which was playing the Lakers in Los Angeles later Monday. The Timberwolves are an NBA-best 30-9 against Western Conference opponents, 20-5 against teams with a less than .500 record and 23-8 at Target Center, for the league's fifth-best home record.\n\n\r\n              “It was a point of emphasis for us coming into the season,\" Minnesota coach Chris Finch said before the game of handling lower-ranked teams.\n\n\r\n              Karl-Anthony Towns scored 14 points, Anthony Edwards had 13, and Naz Reid added 12 points on 4-for-4 shooting from 3-point distance for Minnesota, which was playing its fifth game in seven nights and completed a seven-game homestand with a 4-3 record.\n\n\r\n              Anfernee Simons had 34 points, 14 assists and five rebounds, and Duop Reath shot 5 for 6 from long distance and scored a career-high 26 points for Portland, which was playing its third game in four nights.\n\n\r\n              “We absolutely had to have this one,” said Finch, whose team was coming off back-to-back losses for just the second time this season.\n\n\r\n              The Timberwolves used a 17-5 run and Gobert's 10 points and seven rebounds to build a 55-48 lead at halftime. Gobert, who ranks fifth in the league in double-doubles, had a three-point play on a dunk over Portland's 7-foot-2 center Moses Brown in the third quarter as Minnesota extended its lead to 13 points.\n\n\r\n              “I just tried to be more patient,” said Gobert, who went 9 for 10 from the floor and 7 for 7 from the line. “The last few games, I felt like I wasn’t being aggressive enough. ... Tonight, (I decided) to be aggressive and be more decisive.”\n\n\r\n              Portland cut its deficit to three points before Nickeil Alexander-Walker's 3-pointer made it 86-80 with 1:02 left in the third. Alexander-Walker (13 points) added a transition layup before the third-quarter buzzer.\n\n\r\n              Edwards scored all but four of his points in the fourth quarter. Gobert recorded a block and Conley followed with a 3-pointer that extended Minnesota's lead to 115-101 with 1:22 remaining. \n\n\r\n              “Rudy was super locked in today,” Conley said. “Super efficient, super dominant — that's what we need out of him.”\n\n\r\n              Edwards was delayed in coming out for the opening tip-off and didn't check in until the first whistle. Alexander-Walker started in his place.\n\n\r\n              “I lost track of time,” said Edwards, who usually spends much of pregame warmups doing resistance band work outside the team locker room.\n\n\r\n              The Trail Blazers were without Scoot Henderson, Deandre Ayton, Toumani Camara, Jerami Grant, Malcolm Brogdon, Shaedon Sharpe, Robert Williams III and Mattise Thybulle on Monday night.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Open a six-game homestand against Oklahoma City on Wednesday night.\n\n\r\n              Timberwolves: Start a six-game trip — their longest of the season — at Indiana on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996460.4522738
}