{
  "game_id": "0021601100",
  "espn_id": "400900495",
  "date": "Mar 27, 2017",
  "matchup": "OKC @ DAL",
  "headline": "Westbrook, Thunder top Mavs 92-91 with 14-0 finishing run",
  "body": "DALLAS --  Russell Westbrook rescued Oklahoma City with a stunning rally and guaranteed the first losing record for Dallas in 17 full seasons under owner Mark Cuban.\n\nWestbrook hit a pull-up jumper with seven seconds left and the Thunder erased a 13-point deficit in the final four minutes for a 92-91 victory over the Mavericks on Monday night.\n\nThe six-time All-Star and current NBA scoring leader, whom Cuban steadfastly claims isn't a superstar, had his third straight triple-double with 37 points, 13 rebounds and 10 assists. Westbrook scored 12 in a 14-0 run by Oklahoma City to finish it, but said he wasn't trying to convince Cuban, who was in the first row of seats just a few feet from the winning shot.\n\n\"Nah, man,\" said Westbrook, who has 37 triple-doubles and needs four in the final nine games to tie Oscar Robertson's NBA record set during the 1961-62 season. \"I play every night the same way. Whatever he says doesn't even matter to me. He's going to do his job, and I'm going to do mine.\"\n\nThe Thunder gained possession on a replay reversal with 13 seconds to go and Westbrook hit the decisive shot from just beyond the free throw line over Wesley Matthews.\n\nDallas was out of timeouts, and Harrison Barnes missed a long 3-pointer before the buzzer. The Mavericks (31-42) last had a losing season in 1999-2000, Dirk Nowitzki's second year. Cuban bought the team in January that season, when Dallas finished 40-42.\n\n\"It just happened so fast,\" said Nerlens Noel, who scored 15 points along with Matthews to lead Dallas. \"They were just playing more aggressive than we were late in the game.\"\n\nThe Thunder (42-31) won for the seventh time in nine games since a four-game losing streak that matched a season high. They are a game behind the fifth-place Clippers in the Western Conference and 2 1/2 in front of Memphis for the No. 6 seed.\n\nMavericks rookie Yogi Ferrell scored 11 of his 13 points in the fourth quarter, capped by a 3-pointer for a 91-78 lead with 3:31 remaining. Dallas didn't score again.\n\nWestbrook started the stunning run with a breakaway dunk, followed by a 3. After Steven Adams tipped in Westbrook's missed 3, the star guard hit a floater on a three-point play to get the Thunder to 91-88.\n\nThe Mavericks had possession with the shot clock off after Westbrook missed a jumper, but Dallas got stuck in the backcourt and called its final timeout. With just three seconds to get the ball past midcourt, an inbounds pass for J.J. Barea was tipped by Westbrook, who immediately signaled Oklahoma City ball even though the initial call went Dallas' way.\n\nThere were plenty of celebrating Westbrook fans when he pulled up on a backpedaling Matthews.\n\n\"That's about as good a shot as you're going to get,\" Oklahoma City coach Billy Donovan said. \"You're trying to take away something at the rim.\"\n\nTIP-INS\n\nThunder: Went scoreless for the first 5:25 of the second and finished with 10 points in the period, their lowest total for any quarter this season. ... Victor Oladipo scored 15 points, and Taj Gibson had 13. ... Westbrook scored at least 30 points for the 39th time this season.\n\nMavericks: G Seth Curry was a late scratch with a left shoulder injury. He had started 34 straight games, and Dallas was 20-14 in those games after a horrid start for an injury-plagued team. ... Dallas went on a 31-9 run over more than a quarter in the first half.\n\nTAKING OVER\n\nThe Thunder closed a game with at least a 14-0 run for the second time this season, according to the Elias Sports Bureau. They had a 15-0 spurt in a 114-102 win at home against Memphis on Feb. 3. The rest of the NBA has combined for one such game-ending run this season, Elias said.\n\nZIPPING THE LIP\n\nRick Carlisle was visibly upset after Westbrook wasn't called for traveling while taking a long step and pulling the ball in after changing his mind on a dribble. The Dallas coach wasn't in the mood to address it after the game. \"I didn't look at it so I don't have a real opinion on it,\" he said. \"And if I did, it would cost me a lot of money, so I will pass.\"\n\nGAME OF DROUGHTS\n\nThe Thunder won despite a six-minute scoring drought in the first half. They managed just two points in the last six minutes of the third quarter after nearly wiping out a 15-point halftime deficit in the first six minutes of the period.\n\nUP NEXT\n\nThunder: At the Orlando Magic on Wednesday to finish a three-game trip in four nights.\n\nMavericks: At the New Orleans Pelicans on Wednesday to start season-ending stretch that features seven of nine on the road.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764995249.557215
}