{
  "game_id": "0022301156",
  "espn_id": "401585784",
  "date": "Apr 09, 2024",
  "matchup": "LAC @ PHX",
  "headline": "Clippers build 31-point lead in first quarter and hold on late to beat Suns 105-92",
  "body": "PHOENIX -- — Russell Westbrook had 16 points, 15 rebounds and 15 assists for his first triple-double of the season and 199th of his career, and the Los Angeles Clippers built a 31-point lead in the first quarter before holding on late for a 105-92 victory over the Phoenix Suns on Tuesday night.\n\n\r\n              The Clippers clinched a playoff berth and the Pacific Division title with the victory.\n\n\r\n              It was an embarrassing early showing for the Suns, who are fighting to stay out of the Western Conference play-in tournament. They eventually rallied to cut the margin to 91-84 with 6:45 left on Bradley Beal's free throw, but couldn't get closer.\n\n\r\n              The Clippers — who were playing without All-Stars James Harden and Kawhi Leonard — have won four straight and seven of eight. They host the Suns on Wednesday in the second game of the home-and-home series.\n\n\r\n              “Our will to win was great,” Clippers coach Tyronn Lue said. “We came out with a defensive mindset, we were really physical, offensively we were clicking. This is a hell of a win against a really good team.”\n\n\r\n              Paul George led Los Angeles with 23 points while Ivica Zubac added 17 points and 13 rebounds. All five starters scored in double figures.\n\n\r\n              Westbrook had a standout game in his first start since November.\n\n\r\n              “No surprise on my end because I know I prepare very well,\" Westbrook said. “I take a lot of time to prepare for games, no matter how much time on the floor. I'm grateful for my teammates, believing in me.”\n\n\r\n              Phoenix shot just 2 of 19 from the field in the opening quarter as boos became progressively louder from the home crowd. Los Angeles built a 35-4 lead in less than 10 minutes, when Phoenix went nearly six minutes without scoring.\n\n\r\n              Fans sarcastically cheered when Devin Booker hit two free throws to stop the drought. \n\n\r\n              Kevin Durant led the Suns with 21 points while Beal had 19. Booker finished with 12, shooting just 1 of 11 from the field.\n\n\r\n              The Clippers continued to build their lead in the second. Bones Hyland hit a 3-pointer that made it 51-14 — which was the largest lead of the night — and Los Angeles took a 66-33 lead into the halftime break.\n\n\r\n              Booker, Durant and Beal combined to shoot 4 of 25 from the field before the break. The Suns have dropped two straight.\n\n\r\n              “We got some good looks early, we missed them,” Booker said. “They were hot and that's a bad combination for us.”\n\n\r\n              Phoenix showed some life in the third quarter, cutting the margin to 84-68 heading into the fourth. Coach Frank Vogel elected for a five-guard lineup for most of the second half, hoping the Suns could shoot their way back into the game.\n\n\r\n              It actually worked for a while, but they couldn't overcome 8-of-35 shooting (23%) from 3-point range.\n\n\r\n              Both teams were short-handed, though the Clippers were in worse shape. Los Angeles was missing Harden (foot) and Leonard (knee). Phoenix was playing without starting center Jusuf Nurkic, who has a sprained right ankle.\n\n\r\n              It was the final home game of the season for the Suns, who close the regular season with three road games against the Clippers, Kings and Timberwolves.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996531.273383
}