{
  "game_id": "0022200467",
  "espn_id": "401468622",
  "date": "Dec 21, 2022",
  "matchup": "DET @ PHI",
  "headline": "Embiid leads balanced attack, 76ers beat Pistons, 113-93",
  "body": "PHILADELPHIA -- — Joel Embiid had 22 points and 10 rebounds and the Philadelphia 76ers used a balanced scoring attack to extend their winning streak to six games with a 113-93 win over the Detroit Pistons on Wednesday night.\n\n\r\n              “We like to work together,” Embiid said. “We think we have a top two, top three defense in the league. Offensively, I think we're finding ways even when we're not making shots up there. We just have come together and everyone is understanding their role.”\n\n\r\n              Tobias Harris had 17 points, despite early foul trouble, and James Harden added 15 points and eight assists for the Sixers. Philadelphia got double-figure scoring from six players, including De'Anthony Melton (12), Georges Niang (11) and Montrezl Harrell (10).\n\n\r\n              “We're just staying focused and locked into the goal, which is stringing together a few wins,” Harris said. \n\n\r\n              The Sixers' six-game winning streak is their longest since a seven-game run from Dec. 26-Jan 10 in the 2021-22 season. Philadelphia has won eight straight games at home after starting the season 5-5 in their own building.\n\n\r\n              “We're playing well, but we have a lot of work to do,” Sixers head coach Doc Rivers said.\n\n\r\n              Detroit was led by Jaden Ivey, who followed up his career-best 30 points on Tuesday night with 16 points. Killian Hayes scored 12 and Saddiq Bey 11 for the Pistons, who have lost seven of their last eight games.\n\n\r\n              “We kept shooting ourselves in the foot and we didn't take good care of the basketball,” Pistons head coach Dwane Casey said. “Down the stretch, we couldn't cut into it, but we couldn't close it.”\n\n\r\n              Philadelphia overcame some offensive struggles with defensive stinginess. The 76ers forced 22 turnovers and held the Pistons to 32.1% shooting from the floor in the third quarter. That allowed the Sixers to weather an offensive drought and maintain a double-digit lead.\n\n\r\n              It also allowed Rivers to give some of his starters a much needed breather. Even during this six-game winning streak, most of the Sixers starters have been forced to go deep minutes. Two of the previous five wins in the streak — against the Lakers and Raptors — featured overtime games after Philadelphia had held a sizable lead.\n\n\r\n              Embiid played 34 minutes. Harden totaled 32 minutes. Harris and PJ Tucker (10 rebounds with no points) were on the floor for only 21 minutes.\n\n\r\n              “We want to get to the point where we know we have the game in the fourth quarter,” Harris said. “We know we're going to play great teams where this is not going to be the case. But as a group, we know the teams we should know to have a lead and maintain a lead to have comfort in the fourth quarter to get guys less minutes.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Hayes started for Detroit despite being labeled as a game-time decision with a left knee contusion. ... Detroit has lost nine straight at Wells Fargo Center, dating to March 4, 2017. ... Jalen Duren had his streak of seven straight games with 11 or more rebounds snapped. It was tied with Dwight Howard for the longest in NBA history by a rookie.\n\n\r\n              76ers: Furkan Korkmaz, who has missed the last two games with a non-COVID illness, returned to the Philadelphia bench and was available Wednesday night, playing late in the contest, when the game was secure. ... There is still no timeline on Tyrese Maxey's possible return. Maxey, the Sixers' No. 3 scorer from the guard position, has missed the last 15 games due to a fracture in his foot. \n\n\r\n              UP NEXT\n\n\r\n              Pistons: At Atlanta on Friday night.\n\n\r\n              76ers: Wrap up seven-game homestand on Friday night versus the Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994373.518145
}