{
  "game_id": "0022000683",
  "espn_id": "401307472",
  "date": "Mar 26, 2021",
  "matchup": "BKN @ DET",
  "headline": "Harden, Griffin help Nets hold off Pistons 113-111",
  "body": "DETROIT -- — Blake Griffin seemed to be in the middle of everything in his return to Detroit.\n\n\r\n                    Griffin scored 17 points and was part of a first-half dustup that resulted in Isaiah Stewart's ejection, and the Brooklyn Nets outlasted the Pistons 113-111 on Friday night. James Harden had 44 points, 14 rebounds and eight assists in a disjointed game that was full of free throws, technical fouls and other contentiousness.\n\n\r\n                    “They’re a hard-playing team,\" Griffin said. \"I don’t know if you expect to get elbowed, but I knew it was going to be chippy. They’re going to play hard.”\n\n\r\n                    Griffin spent three-plus years with the Pistons, but he reached a buyout agreement with Detroit earlier this month and went to the contending Nets. The Pistons played a tribute video for him during a first-half timeout, and he stood to acknowledge the small number of fans in attendance.\n\n\r\n                    By the end of the game, however, Detroit coach Dwane Casey didn't want to talk about Griffin at all.\n\n\r\n                    “To talk about somebody else’s players, I’m not going to do that,\" he said.\n\n\r\n                    Make no mistake: Griffin was an opponent. In the second quarter, Stewart appeared to give Griffin a shot to the head with his arm. After a lengthy review, Griffin received a technical foul — and Stewart was called for a flagrant foul and ejected.\n\n\r\n                    “You can’t be baited into a situation like that,\" Casey said.\n\n\r\n                    Harden was back after missing his team's previous game because of neck soreness. Brooklyn was still without Kevin Durant (left hamstring strain) and Kyrie Irving (personal reasons), but the Nets had enough to hold off the last-place Pistons.\n\n\r\n                    Jerami Grant scored 19 points for Detroit.\n\n\r\n                    The game was tied at 82 in the fourth when Griffin made a 3-pointer that started a 10-0 run for the Nets. An alley-oop dunk by Griffin made it 100-90.\n\n\r\n                    The Pistons fought back to tie it at 106 before Harden’s three-point play put Brooklyn back ahead. A 3-pointer by Jeff Green made it 112-107.\n\n\r\n                    The Nets had the ball up by two with 4.5 seconds left, but Detroit's Saddiq Bey intercepted Green's inbound pass, and the Pistons called a timeout with 3.3 seconds to play.\n\n\r\n                    Cory Joseph's driving attempt missed, and it may not have beaten the buzzer anyway. So the Nets escaped.\n\n\r\n                    “We got the win, but we don’t feel great about it,\" Brooklyn coach Steve Nash said.\n\n\r\n                    In addition to the incident between Stewart and Griffin, five other players were called for technical fouls: Wayne Ellington and Hamidou Diallo for Detroit, and DeAndre Jordan, Green and Harden for Brooklyn. Green's was for defensive three seconds.\n\n\r\n                    NEWCOMERS\n\n\r\n                    Joseph and Diallo, both of whom were acquired by the Pistons in recent trades, made their debuts for Detroit. Joseph had nine points and Diallo six.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Jordan had 10 points and nine rebounds. ... Harden's 44 points were the most by a Brooklyn player this season.\n\n\r\n                    Pistons: G Rodney McGruder started for just the second time this season after Detroit traded Delon Wright in the deal for Joseph. ... The Pistons went 34 for 47 on free throws.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host Minnesota on Monday night. The Timberwolves beat Brooklyn twice last season, both times in overtime.\n\n\r\n                    Pistons: Visit Washington on Saturday night. The Wizards went 3-1 against Detroit last season.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997486.013002
}