{
  "game_id": "0021700570",
  "espn_id": "400975316",
  "date": "Jan 05, 2018",
  "matchup": "MIN @ BOS",
  "headline": "Marcus Smart scores 18, Boston tops Minnesota 91-84",
  "body": "BOSTON --  Defense dominated as Boston went back-and-forth with Minnesota for three quarters.\n\nThe fourth belonged to the Celtics, who pulled away early in the final period and held off the Timberwolves 91-84 on Friday night.\n\n\"We just stuck with it and the defense came and gave us a victory,\" said Marcus Smart, who led Boston with 18 points. \"Tonight was one of those games where every last one of us from the starters to the guys coming in off the bench were ready.\"\n\nSmart scored 16 in the second half and fellow reserve Terry Rozier finished with 14 points for the Celtics, whose bench outscored Minnesota's 42-20.\n\n\"We played pretty good defense tonight. That's what pushed us over at the end,\" said Rozier, who added nine rebounds. \"Once we locked in on the defensive end, we were fine. Create our offense by creating defense.\"\n\nKyrie Irving had 16 points, nine rebounds and eight assists, Aron Baynes had 11 points and 10 rebounds and Jaylen Brown also scored 11 for Boston, which has won five straight and six of seven.\n\nKarl-Anthony Towns led the Timberwolves with 25 points and a career-high 23 rebounds. Jimmy Butler scored 14, Jamal Crawford had 13 points and Andrew Wiggins scored 10 for Minnesota, which lost back-to-back games for the first time since November.\n\n\"I think we did a pretty good job defensively making it hard on them. We just didn't make the shots we needed to make,\" Towns said. \"We fought very hard offensively. It just was a funky night for us.\"\n\nBoston had a rough night shooting, going 38 for 94 (40.4 percent) and making just 6 of 36 3-pointers. Minnesota also struggled, shooting 36.8 percent from the field.\n\n\"They are a good team,\" Minnesota coach Tom Thibodeau said. \"You've got to play 48 minutes against them to win. We didn't do that. We had a little lull at the start of the fourth.\"\n\nThe Timberwolves, coming off a 98-97 loss at Brooklyn on Wednesday, faded early in the fourth after leading by as many as seven in what had been a tight game. The lead changed 14 times before Boston went up for good in the final period.\n\nIrving drove for a layup with one second left in the third, starting a 10-2 run that allowed the Celtics to start pulling away. Baynes scored Boston's first four points of the final period, and Rozier banked in a shot and then added a 3-pointer with 8:02 left that gave the Celtics a 77-68 lead.\n\nBoston continued its run, getting a dunk by Baynes followed by a steal by Smart that started a fast break and sent Smart to the line for two free throws that pushed the lead to 85-73 with 6:05 remaining.\n\nPLAYING SMART\n\nBoston coach Brad Stevens said Smart is a luxury to have coming off the bench for the Celtics. He scored 16 on Wednesday night as Boston beat Cleveland 102-88 in a rematch of the 2017 Eastern Conference finals, and then led Boston in scoring Friday when the Celtics needed a late push to pull away from Minnesota.\n\n\"Sometimes when we're struggling, I think the ball is going to find energy. And Marcus Smart has energy,\" Stevens said. \"He's playing at a good level. We need him to continue to do so. Obviously, he's a really important part of our team.\"\n\nREBOUNDING WOES\n\nTowns pulled down more than half of the Timberwolves' 43 rebounds, and no other Minnesota player had more than four as Boston dominated the glass 56-43.\n\n\"We've just got to make a conscious effort to go get them. We can't just rely on Kat (Towns) to get every single rebound,\" Butler said. \"He did a great job of it, but we've got to help him. He can't be everywhere on the floor.\"\n\nTIP-INS\n\nTimberwolves: Hadn't lost back-to-back games since Nov. 19 against Detroit and the following night at Charlotte. ... Lost their 11th straight at Boston. ... Towns had a double-double by halftime with 14 points and 13 rebounds in the first two quarters. His previous career high was 22 rebounds against Houston last Feb. 25, and the most he pulled down this season was 19 against Oklahoma City on Oct. 27.\n\nCeltics: Aren't home again until Jan. 16, a stretch that includes a game in London against Philadelphia on Jan. 11. ... Boston swept the two games against Minnesota last season. ... The Celtics shot 20 percent (3 for 15) from 3-point range in the first half.\n\nUP NEXT\n\nTimberwolves: Host the New Orleans Pelicans on Saturday night.\n\nCeltics: Visit the Brooklyn Nets on Saturday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992644.163342
}