{
  "game_id": "0022400756",
  "espn_id": "401705322",
  "date": "Feb 10, 2025",
  "matchup": "ORL vs. ATL",
  "headline": "Trae Young leads Hawks past Magic 112-106",
  "body": "ORLANDO, Fla. -- — Trae Young scored 11 of his 19 points in the fourth quarter, and the Atlanta Hawks beat the Orlando Magic 112-106 on Monday night.\n\n\r\n              Young was 6 for 17 from the field and committed nine turnovers. But he also had eight assists and five rebounds on the same day he was added to the All-Star roster as an injury replacement for Milwaukee forward Giannis Antetokounmpo.\n\n\r\n              Caris LeVert had 18 points and eight rebounds for the Hawks, who won for the fourth time in five games after an eight-game losing streak. Terance Mann made three 3-pointers and finished with 12 points on perfect shooting.\n\n\r\n              Franz Wagner led Orlando with 35 points. Paolo Banchero added 31 points, including a career-high 20 in the third quarter.\n\n\r\n              Takeaways\r\n              Hawks: Coming off a 35-point, 14-assist game in a win at Washington, Young struggled for much of the night. But he scored seven straight Atlanta points to help the Hawks break away from a 99-99 tie.\n\n\r\n              Magic: With Jalen Suggs missing his 18th game of the team's last 19, the Magic are limping toward the All-Star break with only four wins in their last 17 games.\n\n\r\n              Key moment\r\n              Within an 18-second span of the fourth quarter, Atlanta forwards Larry Nance Jr. and Vit Krejci left the game with injuries. Young responded with his only scoring burst of the game, which included his only 3-pointer with 5:12 remaining.\n\n\r\n              Key stat\r\n              Led by LeVert and Mann, Atlanta had a 54-25 advantage in bench points.\n\n\r\n              Up next\r\n              The Hawks are at New York on Wednesday night. The Magic host Charlotte on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997538.970517
}