{
  "game_id": "0022400551",
  "espn_id": "401705117",
  "date": "Jan 13, 2025",
  "matchup": "HOU vs. MEM",
  "headline": "Green ties career high with 42 points as Rockets rally for 120-118 victory over Grizzlies",
  "body": "HOUSTON -- — Jalen Green tied his career high with 42 points, capped by a layup that gave Houston the lead late, and the Rockets rallied for a 120-118 win over the Memphis Grizzlies on Monday night.\n\n\r\n              The Grizzlies were down by four before Jaylen Wells made a 3-pointer followed by a steal and layup from Brandon Clarke that put them up 115-114 with just under a minute left.\n\n\r\n              Green’s layup put the Rockets on top 116-115 before a turnover by Ja Morant gave Houston the ball back. Amen Thompson was fouled and made two free throws with 8.1 seconds left to make it 118-115.\n\n\r\n              Morant missed two free throws after that and Fred VanVleet added two free throws for Houston with 2.1 seconds left to make it 120-115 and secure the victory. \n\n\r\n              It was Houston’s fourth straight win overall and second in a row over Memphis after beating the Grizzlies 119-115 on Thursday night.\n\n\r\n              Morant swished a 38-footer to put the Grizzlies up by 12 with about eight minutes to go.\n\n\r\n              The Rockets went on a 16-2 run after that to take a 107-105 lead with 4 1/2 minutes remaining. Green and VanVleet had 3-pointers during that stretch and Thompson added six points to help Houston erase the deficit.\n\n\r\n              Morant had 29 points for the Grizzlies, and Desmond Bane scored 25. \n\n\r\n              Takeaways\r\n              Grizzlies: They need to do a better job of finishing after leading by 12 in the fourth quarter.\n\n\r\n              Rockets: Green delivered the kind of dominant performance the Rockets need from him on occasion as they look to remain among the top teams in the Western Conference. \n\n\r\n              Key moment\r\n              Houston’s 16-2 run that erased the double-digit deficit.\n\n\r\n              Key stat\r\n              Houston had 15 offensive rebounds to just eight by Memphis.\n\n\r\n              Up next\r\n              Houston visits Denver on Wednesday night, and the Grizzlies play the first of consecutive games at San Antonio that night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997386.5831711
}