{
  "game_id": "0022401184",
  "espn_id": "401705750",
  "date": "Apr 11, 2025",
  "matchup": "SAC vs. LAC",
  "headline": "Clippers hold off Kings 101-100 to remain tied with Nuggets for No. 4 in tight Western Conference",
  "body": "SACRAMENTO, Calif. -- - James Harden had 23 points, 11 rebounds and 10 assists, Kawhi Leonard scored 28 points and the Los Angeles Clippers held off a late flurry in the final two minutes and beat the Sacramento Kings 101-100 on Friday night.\nIvica Zubic had 17 points and 10 rebounds to help the Clippers win their seventh straight. Norman Powell added 16 points.\nWith one regular-season game remaining the Clippers are tied with the Denver Nuggets at 49-32 for the No. 4 seed in the Western Conference.\nThe Clippers led comfortably most of the game until the Kings surged in the fourth quarter and got within 100-98 with 1:04 minutes remaining. After Sacramento's Zach LaVine made two free throws with 3.9 seconds left, the Kings stole the inbounds pass. But DeMar DeRozan's contested 3-point try at the buzzer clanged off the backboard.\nDeRozan scored 16 points and moved past Reggie Miller into 25th place on the NBA's career scoring list.\nLaVine had 26 points for the Kings, while Domantas Sabonis had 19 points and 16 rebounds.\nSabonis became the sixth player since the ABA/NBA merger to have 60 or more double-doubles for three consecutive seasons, joining Moses Malone, John Stockton, Tim Duncan, Kevin Garnett and Dwight Howard.\nKey moment With the Kings trailing 84-80 in the fourth quarter, interim coach Doug Christie had to be restrained and picked up a technical foul after rookie Devin Carter was called for a defensive foul despite replays showing Harden's arm hitting Carter in the head.\nKey stat Leonard scored more points in the first half (20) than he did total in 13 of the previous 35 games that he played this season.\nUp next The Clippers play at Golden State on Sunday. The Kings host the Phoenix Suns on Friday.\n------\nAP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997299.614229
}