{
  "game_id": "0021800575",
  "espn_id": "401071251",
  "date": "Jan 04, 2019",
  "matchup": "OKC @ POR",
  "headline": "George has 37 and Thunder hold off Blazers 111-109",
  "body": "PORTLAND, Ore. --  The Oklahoma City Thunder had a six-game overall losing streak to the Trail Blazers, and they had lost their last eight at the Moda Center, a streak dating back to 2014.\n\nProclaiming a \"new year, new team,\" Paul George scored 37 points and the Thunder beat the Blazers 111-109 victory on Friday night.\n\n\"We came here, we told ourselves we need to change it -- and we got it done,\" George said.\n\nRussell Westbrook added 31 points for the Thunder, who held off a furious last-minute rally by the Blazers that fell short. Damian Lillard led Portland with 23 points and eight assists.\n\n\"I was thinking about it when I landed yesterday,\" Westbrook said about the long drought. \"For me, this was personal. I wanted the streak to end.\"\n\nThe Thunder trailed by as many as 11 points in the first half but pulled in front late in the third quarter and pushed the lead to 107-97 with just over 4 minutes to go on a basket by Westbrook, who scored 20 points came in the second half.\n\nCJ McCollum's jumper got Portland within 109-105 and Lillard made two of three free throws to cut the deficit with 42.8 seconds left.\n\nLillard and McCollum both missed shots before George made free throws with 4.3 seconds left. The Blazers fell short on Al-Farouq Aminu's basket at the buzzer.\n\n\"The Blazers are a tough team to play against and this is a tough place to play. To find a way to get a win here, since it's been a while, sometimes you've got to do a lot of different things,\" Thunder coach Billy Donovan said.\n\nOklahoma City, sitting in second place in the Western Conference behind the Nuggets, has won three straight, including a 107-100 victory over the Lakers on Wednesday.\n\nThe Thunder rose to 12 games over .500 for the first time this season.\n\nThe Blazers had won two straight overall and were coming off a 113-108 overtime victory in Sacramento on New Year's Day. The game against the Thunder was the first of a five-game homestand.\n\n\"You put yourself in that type of position, it comes down to -- like I always say -- you've got to be perfect. We needed to probably make every shot, get every stop,\" Lillard said. \"We just came up short. We had plenty of opportunity.\"\n\nGeorge got off to a fast start with 13 points in the opening quarter, including a pair of free throws that pulled the Thunder into a 28-all tie.\n\nThe Blazers went up 47-39 after Jake Layman's 3-pointer, and extended the lead to 58-47 after Maurice Harkless' 3.\n\nJusuf Nurkic had 16 first-half points and Portland went into the break with a 62-57 lead.\n\nThe Thunder closed within 80-78 on Steven Adams' layup then took an 83-82 lead on George's 3-pointer. Aminu answered with a 3 for the Blazers but George made another 3 and the Thunder went into the final period with a 93-87 lead.\n\n\"We really increased the defensive pressure in the second half and made it harder for them to score,\" George said.\n\nNurkic finished with 22 points and eight rebounds.\n\n\"It was disappointing, kind of a crazy game,\" Blazers coach Terry Stotts said. \"I thought we had good flow and good momentum most of the game.\"\n\nTIP-INS\n\nThunder: George had 21 points at the half. ... Terrance Ferguson fouled out with 2:43 left. ... It was the first of four meetings between the teams. Last season Portland won all four of its games against the Thunder.\n\nTrail Blazers: Nurkic was coming off a rare 5-by-5 (five points, five rebounds, five assists, five steals, and five blocks) against the Kings on Tuesday, when he had 24 points, 23 rebounds, seven assists, five steals and five blocks. The only other Blazer with one was Nic Batum. Nurkic is the first NBA player to pull off a 5-by-5 with 20-plus points and rebounds.\n\nREMEMBERING LARRY: The Blazers held a moment of silence for Larry Weinberg, one of the founders and original owners of the team, who died on Monday. Weinberg was among those who got the franchise started as an NBA expansion team in 1970. He sold the team to Microsoft co-founder Paul Allen in 1988.\n\nUP NEXT\n\nThunder: Host the Wizards on Sunday.\n\nTrail Blazers: Host the Houston Rockets in the second of a back-to-back on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994590.725826
}