{
  "game_id": "0021600396",
  "espn_id": "400899838",
  "date": "Dec 16, 2016",
  "matchup": "LAL @ PHI",
  "headline": "Randle, Lakers beat 76ers to snap eight-game skid",
  "body": "PHILADELPHIA -- The Los Angeles Lakers took advantage of a timely game against the lowly Philadelphia 76ers.\nJulius Randle scored nine of his 25 points in a dominating first quarter and the Lakers snapped an eight-game losing streak with a 100-89 victory Friday night.\nLou Williams added 18 points and D'Angelo Russell and Nick Young had 15 points apiece. They were playing the third game of a seven-game, 12-day trip -- their longest of the season.\n\"It feels great,\" Young said. \"It's tough coming in after every loss, putting our heads down.\"\nJoel Embiid scored 15 points for the 76ers. They have dropped eight straight at home to fall to an NBA-worst 6-20.\n\"We got jumped from the start,\" Philadelphia coach Brett Brown said.\nSevyn Streeter performed the national anthem wearing a \"We Matter\" jersey. The R&B artist had been scheduled to sing before the 76ers' home opener in October, but was scratched by the team two minutes before the performance because she was wearing a \"We Matter\" T-shirt.\nStreeter came to center court on Friday in a black jersey with the words \"We Matter\" above the No. 7. She received applause upon her introduction and cheers when she completed the song.\nLos Angeles rebounded after a 107-97 loss at Brooklyn on Wednesday night when they shot 38.5 percent from the field, 22.2 percent from 3-point range and 61.8 percent from the free-throw line. Coach Luke Walton publicly challenged his team after the loss.\n\"They're competitors,\" Walton said. \"They're sick of losing.\"\nThe Lakers scored the first 13 points against the 76ers, finished the first quarter up 30-18 and led from start to finish on the way to the rout. They blew the game open in the third quarter by tallying 15 of the first 21 points, taking their biggest lead on Young's drive that made it 68-46 with 5:41 left in the period. The 76ers missed 10 of 12 shots to start the period.\nPhiladelphia cut the third-quarter deficit to 10 points, 74-64, entering the fourth, and the 76ers got as close as seven, 80-73, on Dario Saric's 3-pointer with 9:07 remaining. But the Lakers responded with a 10-2 run to go up 90-75 with 6:19 left.\nThe Lakers won for the first time since Nov. 30.\nGETTING DEFENSIVE\nLos Angeles held Philadelphia to 36.4 percent from the field, including 19.4 percent from the arc. Walton said the Lakers' defense was a key to the victory.\n\"I thought we came out and set our tone defensively early on and had one of our better defensive games,\" Walton said. \"Better communication and better effort from everybody. We had guys really committed to playing defense tonight.\"\nTHREE'S A CROWD?\nPhiladelphia had all three of its coveted big men -- Embiid, Jahlil Okafor and Nerlens Noel -- available together at the same time for the first time.\nEmbiid, the third pick of the 2014 draft, missed the first two seasons with a foot injury. Noel was picked sixth in 2013 by New Orleans and traded to the 76ers. He returned Monday after recovering from offseason knee surgery only to sprain his ankle and miss Wednesday's game.\nNoel had two points in 8 minutes and aired his frustration afterward.\n\"I think I'm too good to be playing eight minutes,\" he said. \"That's crazy. Need to figure this (stuff) out.\"\nOkafor, picked third in the 2015 draft, started alongside Embiid for the second time. He had 14 points.\nThe duo also started in Wednesday's 123-114 loss to the Raptors and Embiid had his worst game as a pro, tallying a season-low nine points.\nEmbiid and Okafor didn't look very comfortable together on the floor again. Both natural centers, Embiid moved to the power forward spot to accommodate Okafor.\n\"Never from the start to the finish did you feel like you were in any type of rhythm or flow,\" Brown said. \"It doesn't surprise me. It saddens me but it doesn't surprise me.\"\nTIP-INS\nLakers: Tarik Black (ankle) missed his sixth straight game, and Jose Calderon (right hamstring) sat out for the seventh consecutive contest. ... Russell was high school teammates with Embiid and 76ers No. 1 pick Ben Simmons at Montverde Academy in Florida. Simmons has been out all season with a foot injury.\n76ers: Philadelphia shot 6-for-31 from 3-point range. ... The 76ers honored Allen Iverson for his recent induction into the Hall of Fame. Iverson rang the replica Liberty Bell in the pregame and spoke at halftime. He questioned the fortitude of present-day players. \"Not taking anything away from the new era, but I could never, ever, ever sit out of a game if something wasn't broke,\" he said\nUP NEXT\nLakers: At Cleveland on Saturday night for one of their 16 back-to-back games of the season.\n76ers: Host Brooklyn on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764995423.579037
}