{
  "game_id": "0021901270",
  "espn_id": "401224745",
  "date": "Aug 06, 2020",
  "matchup": "IND @ PHX",
  "headline": "Suns win 4th straight bubble game, top Pacers 114-99",
  "body": "LAKE BUENA VISTA, Fla. --  The NBA bubble appears to have given the Phoenix Suns new life.\n\nDeandre Ayton had 23 points and 10 rebounds, and the Suns continued their improbable run in Disney World on Thursday, beating the Indiana Pacers 114-99 for their fourth straight win. The Suns have now climbed out of the basement in the West among the teams in Orlando, while keeping their postseason hopes alive.\n\nDevin Booker added 20 points and 10 assists and Cameron Johnson had 14 points and 12 rebounds as the Suns pulled away with a 21-0 run that bridged the end of the the third quarter and the start of the fourth.\n\n\"The sky is the limit right now,\" said Dario Saric, who was instrumental in the big run.\n\nMalcolm Brogdon had 25 points, six assists and six rebounds to lead the Pacers, who fell to 3-1 in Orlando.\n\nTrailing 75-72 with 2:10 left in the third quarter, Saric scored nine of Phoenix's 14 points and Cameron Payne added the other five as the Suns finished the quarter on a 14-0 tear. Saric also had four rebounds during the stretch.\n\n\"We were playing with a bench that hasn't really played together,\" Pacers coach Nate McMillan said of the team's scoring drought. \"We didn't have a flow all night long.\"\n\nThe Suns did most of their damage with Booker on the bench with five fouls.\n\nSaric finished with 16 points and eight rebounds, while Payne chipped in with 15 points.\n\n\"We are feeling great,\" Saric said. \"This hasn't happened overnight. Since the first week of May guys have been working hard every day. We really worked on our games and it has paid off for us. We are playing without pressure and playing freely.\"\n\nThe win pulls the Suns out of the basement in the Western Conference among the teams in Orlando, passing Zion Williamson and the Pelicans. New Orleans lost to the Kings 140-125 earlier in the day.\n\nThe Suns started strong, jumping out to a 15-point lead in the first quarter, but it quickly evaporated as it turned into a back-and-forth game until late in the third quarter.\n\nT.J. Warren was limited to 16 points on 7-of-20 shooting for the Pacers.\n\nWarren had been red hot since his arrival in the bubble, scoring 32 points in a 120-109 win over Orlando. His 119 points over three games stand as the most in franchise history for a three-game span.\n\n\"We can't forget we have been playing well up until this point,\" Pacers guard Victor Oladipo said. \"It's just one loss.\"\n\nTIP INS\n\nPacers: Were outrebound 53-38.\n\nSuns: Booker made more free throws (six) than the entire Pacers team (five) in the first half.\n\nAYTON LEARNING\n\nBooker said Ayton is getting better with each game.\n\n\"He is doing an unbelievable job of screening and we are making good reads,\" Booker said. \"He's grown. Every time out is a new experience for him to learn and he is picking it up. We still have four games left and we have to keep fighting though.\"\n\nUP NEXT\n\nPacers: Play Lakers on Saturday.\n\nSuns: Play Heat on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995829.157017
}