{
  "game_id": "0021500157",
  "espn_id": "400828044",
  "date": "Nov 16, 2015",
  "matchup": "LAL @ PHX",
  "headline": "Knight's triple-double lifts Suns to 120-101 win over Lakers",
  "body": "PHOENIX --  Brandon Knight secured his first career triple-double in fitting fashion Monday, corralling a long rebound well beyond the 3-point line with under five minutes to go.\n\nIt was just one more thing that went perfectly for the Phoenix Suns, who used a late 21-8 run to run away with a 120-101 victory over the Los Angeles Lakers.\n\n\"They (the bench) gave me the cue,\" Knight said. \"I was just thankful it was able to roll back there. I was tired.\"\n\nKnight was at the center of the Suns' fourth quarter push to take control of the game after taking a five-point lead into the period.\n\nLou Williams hit a 3-pointer to pull the Lakers within 82-78 with 11:35 to go. But Knight scored on a bank shot and Archie Goodwin converted a 3-point play to start an 11-3 run capped by a pair of layups by Knight and T.J. Warren as Phoenix took a 93-81 lead with 8:42 left.\n\n\"They came on in the fourth quarter and decided they were going to take it up a notch,\" Williams said. \"I felt we didn't do the same thing.\"\n\nOverall, the Suns outscored the Lakers 21-8 over a span of 5:40 in the fourth quarter to open a 103-86 lead, extending the advantage to as many as 21 points in the closing minutes.\n\n\"The chemistry for this team is pretty good right now,\" said Suns coach Jeff Hornacek, whose team has won its past three games by a combined 57 points. \"They're all cheering each other on. A good sign for a coach to see is them all supporting each other. When you see that, good things happen.\"\n\nEric Bledsoe added 21 points and Warren had a career-best 19 for the Suns, who gradually pulled away after taking a five-point lead into the fourth quarter.\n\n\"They feed off each other,\" Williams said. \"One night Eric Bledsoe can be the high guy then the next night it's Brandon Knight. It's tough to guard guys when they have it going like this.\"\"\n\nJordan Clarkson scored 20 points to lead the weary Lakers, who were playing on consecutive days for the second time in a week.\n\nLakers coach Byron Scott, however, refused to buy into any thoughts of team fatigue.\n\n\"I keep hearing about this back to back,\" said Lakers coach Byron Scott. \"To me, that is a bunch of crap. It really is. It's basketball. You come ready to play. I thought our guys gave an effort but I thought their effort was 10 times better. They seemed to want it a lot more than we didn't tonight.\"\n\nThe Lakers were without All-Star guard Kobe Bryant, who was kept back in Los Angeles to rest rather than having to play on back-to-back nights.\n\nTIP-INS\n\nLakers: G Jordan Clarkson has scored in double figures in seven of his past eight games. . G Lou Williams helped keep the Lakers close with 10 first-half points but scored only six more the rest of the way. ... Bryant officially was out for \"rest\", though his comments following Sunday's game indicated his ailing back and legs were the real cause.\n\nSuns: F Markieff Morris missed his second straight game with a strained left knee. Morris is the Suns' third-highest scorer at 13.0 points per game. ... The Suns have won nine straight at home against the Lakers, one shy of the franchise record last reached from 1977-1981.\n\nIN THE MIDDLE\n\nDespite facing a Lakers squad with little height outside of 7-foot-2 center Roy Hibbert, Suns center Tyson Chandler struggled to get untracked offensively. Chandler entered the game averaging 7.2 points per game and 10.2 rebounds per game but was scoreless with nine rebounds over 22 minutes. But Chandler's struggles didn't prevent the Suns from outscoring the Lakers 54-32 in the paint.\n\nLIKE FATHER, LIKE SON\n\nLakers G Larry Nance Jr. made his Phoenix debut and was scoreless on three shots with  three rebounds, an assist, a steal and a turnover in just under 23 minutes.debut Nance's father, Larry Sr., played for the Suns from 1981-88 and remains the franchise's leader in blocked shots with 940.\n\nFRUSTRATED SCOTT, CONTINUED\n\nLakers coach Byron Scott also was upset by his team's 17 turnovers, which were turned into 24 Phoenix points. \"A lot of the time they didn't really cause to turn over the ball,\" he said. :It was just us being careless with the ball. We have to be a little bit more understanding how important that orange thing is.\"\n\nUP NEXT\n\nLakers: Host Toronto on Friday.\n\nSuns: Host Chicago on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994316.330771
}