{
  "game_id": "0022200093",
  "espn_id": "401468248",
  "date": "Oct 30, 2022",
  "matchup": "ORL @ DAL",
  "headline": "Mavs bounce back, end Banchero's 20-point run to beat Magic",
  "body": "DALLAS -- — Luka Doncic scored 30 of his season-high 44 points in the first half, and the Dallas Mavericks rebounded from a collapse a night earlier by beating the Orlando Magic 114-105 on Sunday night.\n\n\r\n              Rookie Paolo Banchero was held to 18 points for the Magic, the first time this season the No. 1 pick in the draft has failed to reach 20. His six-game streak was tied for the third-longest to begin a career. \n\n\r\n              Tim Hardaway Jr. added a season-best 21 points off the bench for the Mavericks, who lost to Oklahoma City in overtime on Saturday after blowing a 16-point lead in the final four minutes of regulation. Doncic pointed the blame at himself afterward but was sharp Sunday.\n\n\r\n              “It’s a bounce-back game. It’s early on in the season, but we just have to make sure we’re ready, Mavericks guard Josh Green said. “There’s no reason why we shouldn’t be 6-0. For us, this is a learning curve, and I’m just happy we bounced back.”\n\n\r\n              Doncic has scored 30 or more points in each of the first six games. the first player to do that since Michael Jordan in 1986. It’s his second 40-point game in the past three games. He finished 17 of 26 from the field and had five assists and three rebounds.\n\n\r\n              “You could tell he was going to be ready to go,” Mavericks coach Jason Kidd said. “He came out and set the tone.”\n\n\r\n              Banchero shot 6 for 20 from the field, going 1 of 6 on 3-pointers. Bol Bol added 16 points.\n\n\r\n              “We fouled a lot down the stretch, but at the same time, we stuck to the game plan, which was to make Luka grind for all of his buckets,” said Wendell Carter Jr., who had 15 points and nine rebounds. “We gave ourselves a chance down the stretch, but I felt like we just had some mental lapses, especially on the defensive end, and sometimes on the offensive end we were a little too stagnant.”\n\n\r\n              The Mavericks took a 10-point lead with just over 10 minutes remaining on Hardaway’s 3-pointer as part of a 25-8 run, but the Magic closed the deficit to four with 55 seconds remaining on Banchero’s jumper. Dallas answered with Dorien Finney-Smith’s 3 from the right corner on an assist from Hardaway, who scored 12 points in the fourth quarter to make sure there wouldn't be another collaspe.\n\n\r\n              “We knew we were on the second night of a back-to-back, so our legs were running in quicksand a little as per usual for any team in this league,” Hardaway said. “We knew if we could get to the second half and have it within arm’s length, we’d be able to get our legs under us and try to push the pace.”\n\n\r\n              The Mavericks had a season-high 10 steals, including three by Spencer Dinwiddie.\n\n\r\n              TIP INS\n\n\r\n              Magic: Bol Bol also had 11 rebounds for his first-career double-double. He added three blocks. … Mo Bamba recorded his 1,000th career defensive rebound in the first quarter. … Six Magic players scored in double figures.\n\n\r\n              Mavericks: Christian Wood was back in the starting lineup after getting a rest day on the front end of a back-to-back. … The Mavericks took a lead into the fourth quarter for the fifth time in six games.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Thunder on Tuesday.\n\n\r\n              Mavericks: Host Utah on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994661.2617228
}