{
  "game_id": "0021501017",
  "espn_id": "400828904",
  "date": "Mar 17, 2016",
  "matchup": "MIL vs. MEM",
  "headline": "Ennis' big fourth lead Bucks past Grizzlies 96-86",
  "body": "MILWAUKEE --  Tyler Ennis and the rest of the Bucks reserves pulled out a win for Milwaukee.\n\nEnnis scored all 13 of his points in the fourth quarter to lead the Bucks to a 96-86 victory over the short-handed Memphis Grizzlies on Thursday night.\n\nBucks head coach Jason Kidd didn't like what he was getting from any of the starters, so the second unit played the entire fourth quarter.\n\nDamien Inglis finished with 10 points, Miles Plumlee with nine and three blocks, Rashad Vaughn had five points and John Henson scored three points and blocked four shots before he was ejected with 5.5 seconds left.\n\n\"They were like grasshoppers out there,\" Kidd said. \"They had a lot of energy and spunk. I guess the coach has been holding them back a little bit. They earned the minutes to finish that game.\"\n\nEnnis' reverse layup capped a 15-2 run that gave Milwaukee an 83-75 lead with 5:47 to play.  During the surge, Inglis and Henson each had a key block that helped put some life in the Bucks' offense.\n\n\"Tyler Ennis kind of came in and changed the pace of the game,\" Grizzlies coach David Joerger said. \"He started getting confidence.\"\n\nThe game got testy late in the fourth when Henson came up behind Lance Stephenson, who had just grabbed a rebound. Henson swiped the ball away and in the process dumped Stephenson to the floor. After a review, Henson was called for a flagrant 1 and a technical. Barnes made the technical and Stephenson made two free throws that pulled Memphis to 88-83 with 3:43 left in the game.\n\nHenson later blocked Barnes' layup and then turned to stare at Barnes. Referee Marc Davis quickly pushed Henson away. After a review, Henson was slapped with a double technical and ejected. Henson left the court with his arms above his head, egging the raucous crowd on. He tossed his jersey into the stands, making the little child it landed on one happy fan. Barnes was later listed as ejected on the scoresheet.\n\n\"That's not the type of kid that John is,\" Memphis center Ryan Hollins said. \"He's a really great kid, a shot blocker. I thought he played great tonight. So maybe it was just those emotions coming out. That's not his personality. Hopefully, no one loses any money over something that silly.\"\n\nTrailing 53-47 at the half, the Bucks finally played with the energy lacking in the first half. Greg Monroe scored five points and Giannis Antetokounmpo added four during an 11-2 run to open the third. The lead changed seven times in the quarter, the last in Memphis' favor on two free throws apiece by Xavier Munford and Hollins and Briante Weber's pull-up jumper that gave the Grizzlies a 73-68 lead after three.\n\nBarnes scored 20 points, but only two in the second half. Lance Stephenson added 19 and Tony Allen 13, but it wasn't enough as the Grizzlies lost their fourth consecutive game, including fourth straight on the road.\n\nMemphis was without Mike Conley (Achilles), Zach Randolph (knee), Brandan Wright (knee), Vince Carter (calf) and Chris Andersen (shoulder). P.J. Hairston was added to that extensive injury list after straining his groin in Monday's 130-81 blowout loss to Houston.\n\nBLOCK RECORD\n\nThe Bucks' 17 blocks set a franchise record for rejections in a home game, one shy of the overall record set at Detroit in Nov. 12, 1980.\n\nAN ASSIST MACHINE\n\nAntetokounmpo had 11 assists. He came in averaging 7.9 assists since the All-Star break compared to 2.8 before.\n\nTIP-INS\n\nGrizzlies: Hollins had a season-high 10 rebounds. ... Barnes scored 18 points in the first quarter on 7-of-9 shooting from the floor and 3 of 4 from 3-point range. It was a season-high for points in a quarter by a Grizzlies player. ... Carter missed his fourth consecutive game with a left calf strain. \"He's doing everything he can do to try to play,\" Joerger said. ... Munford signed to a 10-day contract on March 16 as a callup from the Bakersfield Jam of the NBA's Development League and made his Memphis debut in the second quarter.\n\nBucks: G Greivis Vasquez moved closer to playing this season. He's missed the last 52 games recovering from a right ankle injury that required surgery. \"He practiced yesterday,\" Kidd said. \"I thought he did a really good job. His spirit was high. We'll see how he feels today, and then go from there.\" ... The Bucks honored team broadcasters Jim Paschke and Jon McGlockin at halftime on their 30 years of calling the action. There were also video tributes before the game and during timeouts.\n\nUP NEXT\n\nGrizzlies: Host the LA Clippers on Saturday night.\n\nBucks: Host the Utah Jazz on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994010.820232
}