{
  "game_id": "0022400572",
  "espn_id": "401705138",
  "date": "Jan 16, 2025",
  "matchup": "IND @ DET",
  "headline": "Turner scores 28 and Siakam has 26 to lead the Pacers past the Pistons, 111-100",
  "body": "DETROIT -- — Myles Turner scored 28 points, Pascal Siakam added 26 and the Indiana Pacers beat the Detroit Pistons 111-100 on Thursday night.\n\n\r\n              Turner was 8 of 11 from 3-point range while his teammates went 5 for 19. Tyrese Haliburton had 17 points and eight assists as the Pacers won for the seventh time in eight games.\n\n\r\n              Tim Hardaway Jr. finished with 25 points while Cade Cunningham had 20 points and nine assists despite shooting 7 for 21 (1 for 7 on 3-pointers). Detroit had won 10 of 12.\n\n\r\n              The Pacers missed 10 of 12 shots to start the fourth quarter, allowing the Pistons to get within 96-90 with 5:38 to play despite committing 19 turnovers.\n\n\r\n              Detroit, though, came up empty on its next six possessions as Indiana moved the lead back to 12 points.\n\n\r\n              The Pistons shot 2 for 17 on 3-pointers in the second half.\n\n\r\n              Takeaways\r\n              Pacers: Aaron Nesmith (left ankle sprain) returned after missing 2 1/2 months and Haliburton (groin) was back after sitting out Indiana's last game. Nesmith started with Bennedict Mathurin suspended for bumping official Natalie Sago in Tuesday's loss to Cleveland.\n\n\r\n              Pistons: Small forward Ausar Thompson had seven rebounds in 22 minutes, but went 3 for 9 from the floor and Detroit was outscored by 22 while he was in.\n\n\r\n              Key moment\r\n              Indiana led 84-64 with 6:53 left in the third period, but Detroit finished the quarter with a 17-8 run to get within 11 going into the fourth. \n\n\r\n              Key stat\r\n              The Pistons committed 13 turnovers in the first half. The Pacers turned them into 13 points, including eight as they outscored Detroit 40-30 in the second quarter.\n\n\r\n              Up next\r\n              Indiana hosts the Philadelphia 76ers on Saturday, while the Pistons remain home against the Phoenix Suns in a game moved to 4 p.m. EST because of the Lions-Commanders game on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998138.501903
}