{
  "game_id": "0021500231",
  "espn_id": "400828118",
  "date": "Nov 27, 2015",
  "matchup": "CHI @ IND",
  "headline": "George's big game pushes Pacers past Bulls 104-92",
  "body": "INDIANAPOLIS -- Paul George and the Indiana Pacers picked up right where they left off before a three-day break.\nThe Chicago Bulls just couldn't keep up.\nGeorge had 33 points and eight rebounds, and Indiana beat Chicago 104-92 on Friday night for its fourth consecutive win.\n\"I feel confident that when it's time to settle things down, I'm ready,\" George said. \"I'm ready for that opportunity, I'm ready for that moment to get the ball in my hand and make the right play.\"\n\nThe Pacers (10-5) have won 10 of 12 overall. Monta Ellis had 14 points, and George Hill finished with 10 assists.\nGeorge has been the catalyst of Indiana's recent surge, rallying from a rugged start to score 20 or more points in 11 consecutive games. And it's not just a one-man show.\nLavoy Allen had 12 points and 10 rebounds, and George Hill also pulled down 10 boards against the Bulls. Ian Mahinmi made 7 of 10 free throws in the closing minutes after making just 5 of 24 all season.\n\"It's good to see the ball go in,\" said Mahinmi, who was fouled on five consecutive possessions with the Bulls trying to rally late in the game. \"It's more mental than anything else, you know, because I knock down my free throws at practice.\"\nChicago (9-5) just had a bad night. It shot a season-low 34.8 percent from the field.\nNikola Mirotic scored a season-high 25 points for the Bulls (9-5), and Jimmy Butler added 16. Chicago had won four of five.\nThe Pacers swung the game with an early 17-2 spurt, which made it 19-9, and never trailed again.\nChicago pulled within four at 66-62 late in the third, but the Pacers finished the quarter on a 6-1 run, opened the fourth with back-to-back baskets and eventually pushed the lead to 16 late.\n\"You've got to do a better job getting back (in transition) against this team with the rhythm they're playing in right now,\" Bulls coach Fred Hoiberg said.\nCOOLING OFF\nGeorge picked up another technical foul for arguing a call in the third quarter and looked as if he might get another in the fourth. But George calmed down and explained later that he is trying to improve his temperament.\nTOUGH NIGHT\nButler and Derrick Rose typified Chicago's troubles. They entered the fourth quarter a combined 2 of 16 from the field and finished a combined 8 of 26. Rose finished with 10 points, five assists and a minus-19 player rating.\n3 FOR THE SHOW\nChicago's staunch 3-point defense held up against the league's best long-range shooting team. After making a franchise-record 19 3s on Tuesday, the Pacers were just 8 of 28 from long range on Friday. The Bulls, meanwhile, used the late flurry, spurred by Butler and Rose, to go 11 of 26 on 3-point attempts.\nTIP-INS\nBulls: Doug McDermott left with an illness after going 0 of 4 from the field. ... Joakim Noah came off the bench and was shut out in nearly 19 minutes of action. He missed two shots and had five rebounds.\nPacers: C.J. Miles scored 16 points. ... Indiana will begin a four-game Western swing by wearing its Hickory uniforms Sunday night at the Los Angeles Lakers.\nUP NEXT\nBulls: Host San Antonio on Monday night.\nPacers: Visit the Lakers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764993968.767071
}