{
  "game_id": "0021400630",
  "espn_id": "400578922",
  "date": "Jan 21, 2015",
  "matchup": "MEM vs. TOR",
  "headline": "Marc Gasol helps Grizzlies past Raptors 92-86",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies know how to grind out a win, even on a rare night when they struggle on the glass.\n\nMarc Gasol scored 26 points, Zach Randolph had 19 points and 13 rebounds, and the Grizzlies beat the Toronto Raptors 92-86 on Wednesday.\n\n\"It wasn't the prettiest game,\" said Memphis guard Mike Conley, who finished with 12 points.\n\n\"It was a tough game for us. Nothing came easy. The ball didn't bounce our way very often, but we found a way.\"\n\nThe Grizzlies broke open a close game with a 13-3 run midway through the fourth quarter. There were 14 ties and six lead changes for the night.\n\nGasol was 9 for 16 from the field, and also had seven rebounds and five assists. Randolph was 8 of 14.\n\nJeff Green made his first start for Memphis since he was acquired from Boston in a three-team trade on Jan. 12. He had six points on 2-of-6 shooting in 26 minutes.\n\nGreen and the Grizzlies are still getting used to each other.\n\n\"We're going to get it right,\" Randolph said. \"It's a good thing. Trying to figure out the chemistry with Jeff and put him in the lineup.\"\n\nToronto had five players score in double figures, but dropped to 3-8 in its last 11 games. Lou Williams scored 21 points, Kyle Lowry had 20 points on 7-for-23 shooting and Jonas Valanciunas added 12 points and 10 rebounds.\n\nThe Raptors shot 32 percent (27 for 85) from the field. It was the lowest percentage for a Memphis opponent this season.\n\n\"We can't hesitate,\" Raptors coach Dwane Casey said. \"We have to walk into our shots -- shots we normally make -- and knock them down. The shots will fall.\"\n\nMemphis scored the first eight points of the fourth quarter for a 68-61 lead with 10 minutes left. But Lowry's six straight points near the midway point of the period got Toronto within one.\n\nThe Grizzlies then scored 13 of the next 16 points to put it away. Randolph's layup made it 84-73 with 1:47 left.\n\nLowry made a 3-pointer for Toronto's only points during the Memphis surge.\n\nThe Raptors' rebounding ability kept them in the game for much of the night despite their poor shooting performance. Toronto finished with a 50-45 edge on the glass, including 21 on the offensive side, leading to 20 second-chance points.\n\nBut Memphis outscored Toronto 46-38 in the paint.\n\n\"You won't see that happen a lot against us, 21 offensive rebounds,\" Randolph said. \"It was just one of those nights. A lot of long shots and the ball just fell in their hands.\"\n\nNeither team led by more than six points in the first half, with Memphis carrying a 41-38 advantage into the locker room. Gasol had 15 points at intermission.\n\n---\n\nTIP-INS\n\nRaptors: DeMar DeRozan, who was held scoreless in Toronto's win Monday over Milwaukee, had six points on 2-of-11 shooting. \"I think he just missed some good looks,\" Casey said.\n\nGrizzlies: Randolph's double-double was his seventh straight after missing nine games with a sore knee.\n\nRANDOLPH CRUISING\n\nWith Memphis up by 11 in the final 2 minutes, Randolph grabbed a rebound and headed up the left side of the court, beating the Raptors down the floor for a layup.\n\n\"I've been doing it a long time, going coast to coast,\" he said. \"It was just one of those plays.\"\n\nUP NEXT\n\nRaptors: At Philadelphia on Friday.\n\nGrizzlies: Host Philadelphia on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764992155.344625
}