{
  "game_id": "401809961",
  "espn_id": "401809961",
  "date": "Oct 26, 2025",
  "matchup": "DET vs BOS",
  "headline": "Cunningham scores 25, helps Pistons overcome slow start and Brown's 41 points to top Celtics 119-113",
  "body": "DETROIT -- — Cade Cunningham scored 25 points and Jalen Duren had 24 to help the Detroit Pistons hold off the Boston Celtics for a 119-113 win on Sunday.\n\n\r\n              Jaylen Brown scored 41 points for Boston, which led 14-2 in the opening minutes and by as much as 17 points.\n\n\r\n              Ausar Thompson added 21 for Detroit, which scored 30 second-chance points, including four by Thompson in the closing minutes.\n\n\r\n              The Celtics didn’t give up 42 points in a quarter as they did in each of the first two losses, but did allow Detroit to score a combined 70 points over the second and third periods to take a 13-point lead into the fourth.\n\n\r\n              Boston pulled within four points with 1:13 left when Brown made two free throws, but Tobias Harris scored off an offensive rebound on the ensuing possession to help seal the win.\n\n\r\n              Harris had 18 points as the team's fourth double-digit scorer. Duren also had 17 rebounds, Thompson had 12 and Cunningham finished with eight assists.\n\n\r\n              Payton Pritchard scored 21 points, Derrick White had 15 and reserve Anfernee Simons scored 12 for the Celtics.\n\n\r\n              The Celtics have lost their first three games, adjusting without injured star Jayson Tatum and departed contributors Jrue Holiday, Kristaps Porzingis and Al Horford.\n\n\r\n              Detroit has won two straight after a season-opening loss at Chicago.\n\n\r\n              Pistons coach J.B. Bickerstaff said before the game that NBA players and coaches have to be mindful of conversations they have with people outside their organizations that may have gambling implications.\n\n\r\n              The NBA’s gambling scandal has been a hot topic in Detroit, where Chauncey Billups helped the Pistons win the 2004 title as NBA Finals MVP and had the most successful stint of his Basketball Hall of Fame career.\n\n\r\n              Up next\r\n              Celtics: At New Orleans on Monday.\n\n\r\n              Pistons: Host Cleveland on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042503.803958
}