{
  "game_id": "0022300413",
  "espn_id": "401585041",
  "date": "Dec 26, 2023",
  "matchup": "POR vs. SAC",
  "headline": "Simons, Reath lead the Trail Blazers past the Kings, 130-113",
  "body": "PORTLAND, Ore. -- — Anfernee Simons scored 29 points to lead the Portland Trail Blazers to a 130-113 victory over the Sacramento Kings on Tuesday night.\n\n\r\n              Duop Reath added a career-high 25 points and grabbed nine rebounds off the bench for the Blazers, who were without starting center Deandre Ayton (right knee tendinitis) and shooting guard Shaedon Sharpe (right adductor strain). Malcolm Brogdon scored 19 points, while Scoot Henderson and Jabari Walker each had 17 off the bench.\n\n\r\n              “We talked about how we needed to get off to better starts and play better at home,” Blazers coach Chauncey Billups said. “And we did that today. We did a really good job of that.”\n\n\r\n              Henderson added a career-high 11 assists and had only one turnover in one of his strongest games of his pro career.\n\n\r\n              “I’m an unselfish player and somebody that just makes plays,” Henderson said. “I just had to go out there and be confident and get the (win) by any means.”\n\n\r\n              De’Aaron Fox scored 43 points and Domantas Sabonis had 34 points, but no other Sacramento players scored in double figures.\n\n\r\n              “We didn’t do a good job defensively,” Kings coach Mike Brown said. “That’s been our Achilles heel for a while. We give up 130 points and allow their bench to get going the way they did, it made for a long night.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Back-to-back matchups against San Antonio at home on Thursday and Friday.\n\n\r\n              Kings: Visit Atlanta on Friday.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Back-to-back matchups against San Antonio at home on Thursday and Friday.\n\n\r\n              Kings: Visit Atlanta on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996585.085021
}