{
  "game_id": "0022300861",
  "espn_id": "401585489",
  "date": "Mar 01, 2024",
  "matchup": "MEM vs. POR",
  "headline": "Trail Blazers end 9-game skid by beating Grizzlies 122-92",
  "body": "MEMPHIS, Tenn. -- — Dalano Banton scored a season-high 19 points, Jabari Walker also had 19 points and 10 rebounds and the Portland Trail Blazers snapped a nine-game skid by defeating the Memphis Grizzlies 122-92 on Friday night.\n\n\r\n              Duop Reath added 18 points for the Trail Blazers, who led the entire game while winning for only the second time on the road against a Western Conference foe. Kris Murray added 14 for Portland, which is now 2-19 against the West on the road.\n\n\r\n              “We did it together. It's good to just get that monkey off your back,” Portland coach Chauncey Billups said of snapping the losing streak. “We've been playing so hard. I think we've been playing well. We just haven't been able to come out with a victory in quite a while.”\n\n\r\n              Portland players expressed relief at ending the losing streak and finally being able to enjoy a postgame. Several credited the victory with more communication on both ends of the floor. That started with the walkthrough earlier Friday.\n\n\r\n              “We stopped the bleeding, and we did it in the right fashion,” said Walker, in his second year out of Colorado. “We were all happy and smiling, so it felt really good. Hopefully, we can build off of it.”\n\n\r\n              The game was the first of a back-to-back between the teams. They play again Saturday night.\n\n\r\n              While the Trail Blazers celebrated, Memphis coach Taylor Jenkins was frustrated by his team's performance. He had very little positive to say about any part of the game. He started his postgame remarks by saying: “This is embarrassing.”\n\n\r\n              “They basically scored 80 points in the paint with free throws. There's a lot to clean up,” Jenkins said. “They played extremely well, and we didn't have it. Played poorly.”\n\n\r\n              Jake LaRavia led Memphis with a career-high 21 points. Lamar Stevens scored 19 points and GG Jackson finished with 11 as the Grizzlies lost their third in a row and 12th in their last 14. Jordan Goodwin was the only Memphis starter in double figures with 10 points, although he was 4 of 13 from the field.\n\n\r\n              It was LaRavia's fourth game back after missing 17 with a left ankle sprain. He missed 10 games earlier this season with a left eye abrasion. His previous career best was 13 points last season against Sacramento.\n\n\r\n              “I thought (teammates) were able to find me for good looks, and some of them dropped,” LaRavia said. “I had a good game, but it doesn't really matter when you lose by 30. We have to figure out what we are doing as a team.”\n\n\r\n              Portland opened the second half with an 11-4 run, grabbing the first double-digit lead of the game and eventually stretching it to 16 points near the midway point of the third quarter. Reath and Murray scored nine points apiece as Portland built the advantage. \n\n\r\n              The Trail Blazers shot 79% in the third quarter, including 5 of 7 from outside the arc, stretching the advantage to 19 entering the fourth — a lead Portland never relinquished.\n\n\r\n              Both teams are mired near the bottom of the Western Conference and dealing with injuries that have impacted their lineups. And their records.\n\n\r\n              Moses Brown, who hadn't played since undergoing left wrist surgery on Jan. 9, returned, and the Trail Blazers fed the 7-foot-2 center in the second quarter. He finished with seven points, hitting all three of his shots.\n\n\r\n              “I thought Moses' minutes were huge for us,” Billups said. \n\n\r\n              Neither team could build a double-digit lead in the first half as both shot under 45%. Memphis was hindered by a dozen first-half turnovers, contributing to a 51-45 lead for Portland at intermission.\n\n\r\n              But the second half was the difference for Portland, as it outscored the Grizzlies 71-47 in the final two frames.\n\n\r\n              “Everything came together,” Murray said. “Offensively, we were really good. Shared the ball really well. Defensively, I thought we played a complete game and didn't let them get on any runs.”\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996005.324728
}