{
  "game_id": "0021600296",
  "espn_id": "400899738",
  "date": "Dec 03, 2016",
  "matchup": "CHI @ DAL",
  "headline": "Barnes, Matthews power Mavericks past Bulls 107-82",
  "body": "DALLAS -- Wesley Matthews has taken greater responsibility with Dirk Nowitzki out of the Dallas Mavericks' lineup much of this season.\nMatthews scored 20 of his 26 points in the second half of Dallas' 107-82 victory over the Chicago Bulls on Saturday night.\n\"Matthews was the star of the game, obviously,\" Mavericks coach Rick Carlisle said. \"He is our leader right now with Dirk out. He really sets the tone for us in the locker room and on the floor. He is just the vocal guy.\"\nMatthews has accepted the expanded role as Nowitzki has been limited to five games by a strained right Achilles tendon.\n\"I feel like that's one of the reasons why they brought me over here (from Portland). Through this rough patch, injuries and everything, everybody had to mold together. It's almost like we had to restructure ourselves. I think everybody has embraced that.\"\nHarrison Barnes scored 17 of his 22 points in the first half to help Dallas improve to 4-15.\nChicago was coming off a 111-105 victory over defending champion Cleveland on Friday night.\nJimmy Butler led Chicago with 26 points.\n\"I don't think anybody played well tonight,\" Butler said. \"We didn't play with energy on either end of the floor.\"\nBarnes powered the Mavericks to a 17-point first-quarter lead with eight points.\n\"They came out and threw the first punch and kept throwing, and we could just never recover from that,\" Bulls coach Fred Hoiberg said. \"We did expend a lot of energy (Friday) night.\"\nDwight Powell (17) and rookie Dorian Finney-Smith (11) had career highs in scoring, and Deron Williams had a season-high 15 assists with only one turnover.\n\"The biggest thing was we were even (43-43) on the boards,\" Carlisle said. Andrew Bogut had a game-high 11 rebounds, and Powell grabbed eight.\nNeither team scored in the first 2:15, but Dallas went on a 7-0 run over the next 1:20. The Mavericks led 23-6 with 3:17 left. The quarter ended with Dallas leading 29-18. Bogut had six points and eight rebounds.\nChicago pulled within six points three times in the second quarter, but Dallas finished the first half with a 57-45 lead. In the third quarter, Matthews had 14 points, and the Maverick led by as many as 21 points.\nTIP-INS\nBulls: C Robin Lopez has a career-high 11 straight games with 10 or more points. He scored 15 against Dallas. ... F Jimmy Butler has reached 20 points in 17 of 19 games. He scored on a drive with 1:00 left in the third quarter, but was charged with a technical foul for arguing that he had been fouled.\nMavericks: G Wesley Matthews made 7 of 11 3-point attempts. ... C Andrew Bogut fouled out, but had 11 rebounds and a season-high eight points. ... The Mavericks' 29 first-quarter points were a season high. ... Their largest margin of victory before Saturday was 12 points.\nWADE RESTS\nBulls G Dwyane Wade missed his second game this season, both to rest. He stayed in Chicago after Friday's win over Cleveland. Their flight landed in the DFW Metroplex at 2:30 a.m. for the second game in a stretch of four games in five days. Nikola Mirotic started in Wade's place and was scoreless in 13 minutes played.\nNOWITZKI \"INDEFINITE\"\nThe Mavericks said that they no longer will keep a timetable for when F Dirk Nowitzki (strained right Achilles tendon) would play. Instead, his return will be listed as \"indefinite.\" He has played in only five games this season.\n\"We said I'm still a few games away, but luck can change, so I just have to go day by day,\" Nowitzki said.\n\"At this stage in my career, I don't move well anyways, so if I'm out there at like 80, 90 percent, I don't think I'm a big help, so I want to make sure my body's responding the right way and we'll go from there.\"\nUP NEXT\nBulls: Return home to play Portland on Monday night. Chicago won at Portland 113-88 behind Jimmy Butler's 27 points on Nov. 15.\nMavericks: Host Charlotte on Monday night in the second game of a four-game homestand. Dallas lost to the Hornets on the road Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995088.565954
}