{
  "game_id": "0022400389",
  "espn_id": "401704955",
  "date": "Dec 22, 2024",
  "matchup": "IND @ SAC",
  "headline": "Pacers use 70-point second half to rout Kings 122-95 for their fourth straight victory",
  "body": "SACRAMENTO, Calif. -- — Pascal Siakam had 19 points and 10 rebounds, and the Indiana Pacers dominated the second half to rout the Sacramento Kings 122-95 on Sunday. \n\n\r\n              Siakam scored 13 points after halftime, when the Pacers outscored the Kings 70-43 after the game was tied at 52 at the break. The Pacers shot 58% for the game and made 17 3-pointers in their season-high fourth straight victory. \n\n\r\n              Myles Turner added 15 points and Ben Sheppard had 14 off the bench. Tyrese Haliburton, who started his career in Sacramento, had 14 points. Seven Pacers finished in double figures.\n\n\r\n              The Pacers took an 87-78 lead into the fourth quarter, and then started the period on a 17-5 run to take a 21-point advantage.\n\n\r\n              De’Aaron Fox had 23 points in the Kings' fourth straight loss. Domantas Sabonis had 17 points and 21 rebounds for his eighth straight double-double.\n\n\r\n              Takeaways\r\n              Pacers: The Pacers recorded 35 assists on 50 field goals, and they have scored 119 points or more points in each of their last four games.\n\n\r\n              Kings: The Kings fell a season-low four games under .500, eliciting boos from the home crowd after the final buzzer. Their prior three losses had come by a combined 18 points. Coach Mike Brown said before the game that Sacramento was struggling to make the one extra play that often determines close games – but Sunday’s game was a blowout.\n\n\r\n              Key moment\r\n              Ahead by 13 in the fourth, the Pacers went on an 8-0 run to seal the win. Sheppard made back-to-back 3-pointers, followed by a layup by Obi Toppin to put Indiana up 104-83. \n\n\r\n              Key stat\r\n              The Pacers shot 62.5% (15 of 24) in the third quarter to take a nine-point lead into the fourth. The Kings were held to 36.5% shooting in the game. \n\n\r\n              Up next\r\n              The Pacers visit the Warriors on Monday, while the Kings host the Pistons on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998151.089997
}