{
  "game_id": "0021501144",
  "espn_id": "400829031",
  "date": "Apr 03, 2016",
  "matchup": "CHA @ CLE",
  "headline": "LeBron scores 31 as Cavaliers down Hornets 112-103",
  "body": "CLEVELAND -- The playoffs are close, just around the corner. LeBron James can't wait for them to begin.\nJames scored 31 points, J.R. Smith matched a season high with 27 and the Cleveland Cavaliers knocked down 16 3-pointers while playing without an injured Kyrie Irving in a 112-103 win over the Charlotte Hornets on Sunday.\nJames, who has jacked his game up to another level lately, added 12 assists and eight rebounds and Kevin Love added 25 points. After nearly blowing a big lead, the Cavs held off a Charlotte comeback in the fourth quarter and opened a 3 1/2-game lead over idle Toronto for the top playoff seed in the Eastern Conference.\nCleveland has five games left in the regular season, precious time to work on its offensive efficiency and defensive intensity. Then, it's time to make another run at an NBA title.\n\"If it started tomorrow, we'd be ready to go,\" James said.\nSmith made six 3-pointers, Love dropped five and, along with James, the trio combined for 83 points while Irving rested a sprained ankle.\nIn his past seven games, James, who claimed several weeks ago that he had shifted into playoff mode, is averaging just over 28 points with 9.0 rebounds and 9.2 assists.\nAnd as he prepares for his second postseason since returning to the Cavaliers from Miami, the four-time MVP is healthy in body and spirit.\n\"I'm ready for whatever level comes at me,\" he said. \"I feel great, best I've felt in the last couple years and continue to lead this team in the right direction.\"\nKemba Walker scored 29 points -- 21 in the second half -- and Marvin Williams added 22 for the Hornets, who got within 96-92 in the fourth before Smith and Love answered with 3-pointers.\nCharlotte clinched a playoff spot Saturday and came in temporarily holding the No. 3 spot in the East. The Hornets are 21-7 since Feb. 1.\n\"They've got so many guys who can make plays,\" Williams said. \"Starting with LeBron, who is obviously one of the best players in the world. They've got Kevin Love and J.R. Smith, and Kyrie, who didn't play. They have a lot of talent over there.\"\nIrving injured his ankle late in the first half of Friday's overtime win at Atlanta. He played in the second half and OT session, but still has some soreness and swelling and the Cavs played it safe and rested their star point guard. Coach Tyronn Lue doesn't know yet if Irving will sit more than one game.\nFor three quarters, the Cavs barely missed him.\nCleveland shot 68 percent from the floor in the first quarter and barely cooled off, making eight of 14 3-pointers in the opening half to take a 58-42 lead at the break.\nThe Cavs pushed their lead to 21 on a 3-pointer by Smith, but as so often has been the case this season, they couldn't maintain their big advantage.\nWalker scored 15 points and the Hornets crept within eight, but Smith made a pair of 3s and Mo Williams knocked down a deep shot to put the Cavs ahead 86-71.\nHAMPERED HORNETS\nCharlotte was without forward Al Jefferson, who has a bruised thigh. Also, forward Nicolas Batum sprained his knee in the first half and did not return. Coach Steve Clifford said the team will be cautious with Batum with the playoffs approaching.\n\"It's not the time of year to be messing with it,\" Clifford said. \"I don't think it will be anything long term, but we need him healthy. The priority will be him getting back to 100 percent before he plays again.\"\nTIP-INS\nHornets: Clifford congratulated his team on making the playoffs during Sunday's morning shootaround. The Hornets qualified when Detroit beat Chicago on Saturday. \"It's great for our guys,\" Clifford said. \"That was our goal at the beginning of the season and the guys have done a good job. Like most teams, we've had our share of adversity and fought through it.\" ... Rookie G Aaron Harrison was recalled from Erie of the NBA Development League. He has appeared in 18 games for Charlotte.\nCavaliers: Irving had a wrap on his ankle and did not have a noticeable limp when he came into the Cavs' locker room before the game. ... Matthew Dellavedova started for Irving and added 6 points and 9 assists. ... Red Sox slugger David Ortiz and pitcher David Price, who will make his Boston debut in Monday's opener against the Indians, both attended the game.\nUP NEXT\nHornets: At Toronto on Tuesday,\nCavaliers: At Milwaukee on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994339.2654872
}