{
  "game_id": "0021600720",
  "espn_id": "400900141",
  "date": "Jan 30, 2017",
  "matchup": "ORL @ MIN",
  "headline": "Wiggins, Rubio help Wolves outlast Magic in OT, 111-105",
  "body": "MINNEAPOLIS --  The Minnesota Timberwolves had a hard time finding the gas pedal against the rugged Orlando Magic.\n\nThat they were still able to grind out a win despite not playing particularly well makes them feel like they're starting to see some progress as they pull themselves out of a 6-18 start.\n\nAndrew Wiggins scored 27 points and Ricky Rubio made a career-high six 3-pointers to lead the Timberwolves to a 111-105 victory in overtime on Monday night.\n\nKarl-Anthony Towns had 23 points and 12 rebounds, Rubio added 22 points, eight rebounds and eight assists, and Wiggins forced overtime with a jumper with 10 seconds to play to help the Wolves win for the eighth time in 11 games.\n\n\"This game we'll say we didn't have it 100 percent, but we still kept winning,\" said Rubio, whose Wolves are now 19-29 and three games out of a playoff spot in the muddled Western Conference. \"That's what's going to make us be able to make a run at the end to try to make the playoffs.\"\n\nElfrid Payton scored 21 points and Serge Ibaka had 17 points and 10 rebounds for the Magic, who came back from nine points down with five minutes to play to take the lead late in regulation. Evan Fournier scored nine points in 23 minutes in his first game since Jan. 13.\n\n\"It's very frustrating,\" Payton said a night after a big win in Toronto. \"It's a tough one to take in.\"\n\nRubio came into the game shooting a ghastly 24 percent from deep. But he went 6 for 9 on Monday night, including three in a row in the third quarter to get the sparse crowd on its feet.\n\n\"The guy's a low-percentage 3-point shooter. That doesn't mean you just stand there and watch him shoot,\" Magic coach Frank Vogel said. \"You've got to guard him.\"\n\nShabazz Muhammad ended the quarter with a shot from halfcourt to give Minnesota an 80-79 lead, and the bench scorer put up a 3 monocle as a swaggered back to the bench.\n\nAaron Gordon's three-point play with 50 seconds to go put the Magic up 98-96, but after Wiggins tied it with a tough pull-up jumper, Payton missed a stepback 3 at the buzzer to send it to overtime.\n\nTowns and Wiggins started the extra period with dunks and Wiggins also blocked a shot by Payton at the rim to help the Wolves hold on.\n\nTIP-INS\n\nMagic: Orlando planned to stay in Minneapolis on the advice of the team sleep specialist and return home on Tuesday morning. ... Gordon played 28 minutes and scored 12 points after being listed as questionable with a sore right ankle. ... All five starters were in double figures, including Nikola Vucevic, who had 13 points and 11 boards. Watson had 18 points.\n\nTimberwolves: Rubio also blocked his third shot of the season when he stuffed a layup by Payton in the third quarter. ... New University of Minnesota football coach P.J. Fleck watched the game courtside with his wife, Heather. ... Gorgui Dieng had a season-high 14 rebounds. ... Towns also had seven assists.\n\nFOURNIER RETURNS\n\nThe French swingman missed eight games with a sore right foot, and the Magic went 2-6 without their leading scorer. Fournier came off the bench on Monday night and hit 4 of 11 shots.\n\n\"I thought I had my legs. I was feeling pretty well,\" Fournier said. \"The first five minutes were tough, though. When you don't touch the ball and you don't really get to run up and down the court, it's tough. But after those five or six first minutes, I thought it was pretty good.\"\n\nCLUTCH WIGGINS\n\nThe Wolves swingman's 21-footer with 10 seconds to play in regulation was his second huge shot in the last week. He hit the game-winner at the buzzer in Phoenix on Jan. 24.\n\n\"My teammates trust me to put the ball in the basket when it counts,\" Wiggins said. \"And that's what I did.\"\n\nUP NEXT\n\nMagic: Orlando heads back home for a two-game stand that starts with a game against Indiana on Wednesday.\n\nTimberwolves: Minnesota goes to Cleveland to face former star Kevin Love and the slumping Cavaliers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995841.97197
}