{
  "game_id": "0022300140",
  "espn_id": "401584768",
  "date": "Nov 05, 2023",
  "matchup": "DET vs. PHX",
  "headline": "Kevin Durant scores season-high 41 points, Suns snap 3-game skid with 120-106 win over Pistons",
  "body": "DETROIT -- — Kevin Durant sat and smiled, trying to speak loudly enough to be heard in a jubilant locker room.\n\n\r\n              “We're excited because we finally got a win,\" Durant said.\n\n\r\n              Durant had a season-high 41 points, and the short-handed Phoenix Suns snapped a three-game losing streak with a 120-106 victory over the Detroit Pistons on Sunday.\n\n\r\n              “It’s not fun losing one in a row, definitely not three in a row,” Suns coach Frank Vogel said.\n\n\r\n              Phoenix was without its banged-up backcourt of Devin Booker (calf) and Bradley Beal (back) and a trio of guards took advantage of more playing time and shots.\n\n\r\n              Eric Gordon scored 21 points, Grayson Allen had 14 and Josh Okogie added 10.\n\n\r\n              “We're doing it by committee,” Durant said.\n\n\r\n              Cade Cunningham had 26 points, six assists and six turnovers for the Pistons, who have lost four in a row.\n\n\r\n              Detroit coach Monty Williams faced his former team for the first time in the regular season after matching up in the preseason. \n\n\r\n              “These are really cool games to be a part of,” Williams said before the game.\n\n\r\n              After the game, though, Williams was not happy.\n\n\r\n              “They were tougher than us,” he said. “They played harder than we did in stretches, pretty much most of the game.”\n\n\r\n              Durant, who made 14 of 27 shots, scored 13 points in the first quarter to give the Suns a one-point lead. The superstar was determined to help them bounce back after losing Saturday at Philadelphia and in consecutive home games to San Antonio.\n\n\r\n              “He, like the rest of us, is tired of losing,” Vogel said. “He really imposed his will.”\n\n\r\n              Durant said he wasn't alone.\n\n\r\n              “We all had that mentality,” he said.\n\n\r\n              Gordon scored 11 points in the second quarter, extending the lead to 58-49 at halftime.\n\n\r\n              Durant added 18 points in the third to give Phoenix a 12-point cushion in the fourth that allowed it to cruise to a comfortable and much-needed victory. He was 12 of 12 at the free throw line.\n\n\r\n              “We had too many situations where we missed assignments,” Williams said. “When you don’t know an assignment on Kevin Durant, that’s a problem.”\n\n\r\n              Detroit rookie reserve Marcus Sasser scored a season-high 22 points.\n\n\r\n              “He’s a handful,” Vogel said. “We know he's capable. We did not get to his catch and shoot and he made us pay. He was also able to generate offense through the pick and roll game. He’s a heck of a player.”\n\n\r\n              Pistons rookie Ausar Thompson had 14 points while Killian Hayes added 13 points.\n\n\r\n              Detroit’s Jalen Duren, who had 12 points and 11 rebounds, was ejected midway through the fourth quarter after being called for a second flagrant foul.\n\n\r\n              Suns owner Mat Ishbia, a season-ticket holder at Little Caesars Arena, watched the franchise he agreed to buy nearly a year ago play against his hometown team. Ishbia sat in his front-row seats, near the Suns bench, with his family. He fired Williams after last season.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Close three-game trip at Chicago on Wednesday night.\n\n\r\n              Pistons: Host Golden State on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995797.142436
}