{
  "game_id": "0022200163",
  "espn_id": "401468318",
  "date": "Nov 09, 2022",
  "matchup": "DET @ BOS",
  "headline": "Tatum scores 31, Celtics beat Pistons for 4th straight win",
  "body": "BOSTON -- — Jayson Tatum had 31 points and five assists, and the Boston Celtics beat the Detroit Pistons 128-112 on Wednesday night to earn their fourth straight victory. \n\n\r\n              Jaylen Brown had 30 points and seven rebounds. Sam Hauser added a career-high 24 points off the bench for Boston, which hasn’t scored fewer than 109 points in each of its wins this season. \n\n\r\n              “Little by little I'm earning more trust from (Celtics interim coach) Joe (Mazzulla),\" Hauser said. “I've still got to keep doing things to earn minutes out there and earning a spot in the rotation.”\n\n\r\n              After scoring just five points during a quiet first half, Tatum had 16 points in the first five minutes in the third quarter on his way to 26 in the second half to help the Celtics take control. \n\n\r\n              He also got his teammates involved, at one point flipping a behind-the-back pass to Al Horford for a corner 3-pointer as Boston built as much as a 16-point advantage in the period. The Celtics led by 24 in the fourth. \n\n\r\n              Mazzulla was proudest of how his team played defensively, limiting Detroit to 42% from the field (37 of 89) and 21% (7 of 33) from 3. \n\n\r\n              “When your best players want to play defense, it gives you a chance,\" Mazzulla said. \n\n\r\n              Jaden Ivey had 19 points and 10 rebounds for the Pistons, who have lost four of five. Saddiq Bey added 18 points and Bojan Bogdanovic finished with 17.\n\n\r\n              Cade Cunningham was 1 of 11 from the field and finished with a season low four points. It was the first time this season he’s failed to reach double figures. He was averaging a team-best 21.4 points per game. \n\n\r\n              “They were into him and didn't allow him to get to his sweet spot,” Pistons coach Dwane Casey said. “Did a good job of switching onto him, challenging his shot — just making it tough on him. It was just one of those nights that you have. He couldn't buy a bucket.” \n\n\r\n              TIP-INS\n\n\r\n              Pistons: Casey left open the possibility Alec Burks (left knee) could make his season debut against the Knicks on Friday. … Wednesday began a stretch that will see Detroit play 8 of its next 10 on the road.\n\n\r\n              Celtics: Malcolm Brogdon left the game with right hamstring tightness and did not play in the second half. … Marcus Smart had 11 assists. He has 33 in the past three games. ... C Luke Kornet was active after missing Boston’s win at Memphis on Monday following the birth of his second child. … Wednesday marked the two-year anniversary of Hall of Famer Tommy Heinsohn’s passing. \n\n\r\n              EARLY ACTION\n\n\r\n              The Celtics entered the night with the NBA’s top offensive rating and came out firing, hitting 4 of their first 6 shots as they sprinted out to a 10-2 lead. \n\n\r\n              Detroit had open looks early on but missed its first six shots on its way to shooting 7 of 30 (2 of 12 from the 3-point line) in the opening quarter.\n\n\r\n              The Pistons stayed close thanks to the Celtics squandering some opportunities with turnovers. . \n\n\r\n              Boston found a rhythm in the second quarter, shooting 70% (14 of 20) and 4 of 8 from beyond the arc to take a 63-49 lead into the half.\n\n\r\n              UP NEXT \n\n\r\n              Pistons: At New York Knicks on Friday. \n\n\r\n              Celtics: Host Denver Nuggets on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995271.476981
}