{
  "game_id": "0022000963",
  "espn_id": "401307766",
  "date": "May 01, 2021",
  "matchup": "OKC vs. IND",
  "headline": "Sabonis has triple-double by half; Pacers top Thunder 152-95",
  "body": "OKLAHOMA CITY -- — Domantas Sabonis had a triple-double in the first half and the Indiana Pacers flirted with the most lopsided victory in NBA history before beating the Oklahoma City Thunder 152-95 on Saturday night.\n\n\r\n                    Sabonis finished with 26 points, 19 rebounds and 14 assists, and the Pacers scored their most points in a game since joining the NBA in 1976. \n\n\r\n                    They led by 67 points with 4:12 remaining before the Thunder scored the game’s next 10 points. The NBA's largest victory margin remains 68, set by Cleveland against Miami in 1991.\n\n\r\n                    Sabonis said he's never experienced anything like it.\n\n\r\n                    “No, especially on the professional level,\" he said. “But we were just out there having fun. We didn’t even realize the score most of the time. We were just running our plays, trying to be aggressive and good things were happening.”\n\n\r\n                    The Pacers' previous record was 150 points against Denver in 1982. Indiana shot 65.5% from the field — the highest percentage for an opponent in Thunder history.\n\n\r\n                    “It’s embarrassing,\" Oklahoma City coach Mark Daigneault said. “I’m not going to try to spin that. It’s tough. It’s demoralizing.”\n\n\r\n                    Sabonis returned after missing six straight games with a sore lower back. He made 10 of 13 shots and had a career-high assist total. \n\n\r\n                    “I surprised myself in the first quarter when I was not that tired,\" he said. “I thought I was going to get winded more, but the coaching staff and medical staff did a great job of trying to keep my conditioning up.”\n\n\r\n                    He clinched the triple-double on an assist to Doug McDermott two minutes before halftime. He finished the first half with 22 points, 11 rebounds and 11 assists for his seventh triple-double of the season the 11th of his career. \n\n\r\n                    He joined Nikola Jokic and Russell Westbrook (twice) as the only players with triple-doubles before halftime since the play-by-play era began in 1997-98, according to Elias. He learned he was closing in on the triple-double during a timeout late in the second quarter.\n\n\r\n                    “We just kept playing,” he said. “Guys were getting open, I was trying to find them and the rest -- they made the shots.” \n\n\r\n                    The Thunder got Sabonis on draft night in 2016, then sent him to the Pacers the next year in the deal that brought Paul George to Oklahoma City. Sabonis showed why Thunder general manager Sam Presti is considered one of the best talent evaluators in the business. \n\n\r\n                    McDermott scored a career-high 31 points and Caris LeVert added 25 for the Pacers, who entered Saturday’s game in ninth place in the Eastern Conference after losing two straight. \n\n\r\n                    Moses Brown scored 16 points for the Thunder, who have lost 19 of their past 21 games.\n\n\r\n                    Indiana led 82-46 at halftime, the most points Oklahoma City has ever allowed in a half. Indiana shot 70% before the break, including 61% from 3-point range. \n\n\r\n                    “You kind of need some stops, or you need them to cool off a little bit, or you need some more offense,\" Daigneault said. “We needed a combination of things.”\n\n\r\n                    The Pacers poured it on in the third quarter, scoring 44 more points to take a 126-70 lead. They surpassed their previous season scoring high of 141 points on a dunk by Amida Brimah with 5:30 remaining and set their NBA scoring record on a 3-pointer by Cassius Stanley in the final minute.\n\n\r\n                    ------\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Guard Malcolm Brogdon sat out after injuring his right hamstring on Thursday. ... Made their first six shots to take a 14-4 lead. ... Shot 65.2% in the first quarter to take a 42-29 lead. ... McDermott scored 16 points in the first quarter. ... Oshae Brissett had 16 points and 13 rebounds in 40 minutes.\n\n\r\n                    Thunder: Guard Charlie Brown Jr. got the start and scored eight points. He's on a 10-day contract. ... Made just 8 of 38 3-pointers and 11 of 23 free throws. ... Recent acquisition Gabriel Deck had eight points and 10 rebounds in 24 minutes.\n\n\r\n                    QUOTABLE\n\n\r\n                    Sabonis on returning to action: “It was fun. It was so much fun to finally be out there with my teammates. Watching on the sidelines for an athlete is never fun, and to be out there again and play the game was awesome.”\n\n\r\n                    BALL MOVEMENT\n\n\r\n                    The Pacers had 41 assists — four short of their team NBA record.\n\n\r\n                    “Everybody was moving and cutting, and when we share the ball, everybody’s getting open shots,” Sabonis said. \n\n\r\n                    STAT LINES\n\n\r\n                    The Thunder nearly set a record for points allowed in a game, but the Pacers fell just short of the 154 points San Antonio scored against Oklahoma City in 2019.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Visit the Washington Wizards on Monday.\n\n\r\n                    Thunder: Host the Phoenix Suns on Sunday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997064.913457
}