{
  "game_id": "0022200854",
  "espn_id": "401469009",
  "date": "Feb 11, 2023",
  "matchup": "SAC vs. DAL",
  "headline": "Fox scores 36 points, Kings beat Mavericks 133-128 in OT",
  "body": "SACRAMENTO, Calif. -- — De'Aaron Fox scored 36 points, including six free throws in the final 18.4 seconds of overtime, leading the Sacramento Kings to a 133-128 victory over the Dallas Mavericks on Saturday night.\n\n\r\n              “Most point guards don’t guard me,” Fox said. “It’s a bit different for me. ... It’s a lot, but I feel like I was blessed with the tools to be able to do that.”\n\n\r\n              Fox shot 12 of 23 from the field and scored 26 of his points in the fourth quarter and overtime. \n\n\r\n              Domantas Sabonis had 22 points and 14 rebounds for his NBA-leading 44th double-double of the season before fouling out with 1:27 remaining in overtime.\n\n\r\n              Terence Davis also scored 22 points off the bench, and Kevin Huerter added 15.\n\n\r\n              “Heck of a job by our guys,” Kings coach Mike Brown said. “Defensively, we did a pretty good job in both second halves. ... We had a lot of great individual performances.”\n\n\r\n              Kyrie Irving scored 28 points and Luka Doncic had 25 points and nine rebounds in the stars' first game on the court together as Mavericks teammates. \n\n\r\n              “I thought it was good,” Mavericks coach Jason Kidd said. “It was just natural. Nothing forced. It’s going to make us that much better. They did an incredible job.”\n\n\r\n              Irving was acquired by Dallas from Brooklyn on Monday before the trade deadline. Josh Green added 23 points.\n\n\r\n              “Amazing, only our first game together, but I think it’s so fun to play with this guy,” Doncic said of playing with Irving. “He’s an amazing basketball player and I think it’s going to be really fun and today, first game, it was really fun, too.”\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Doncic returned to the lineup after missing time with a heel injury. ... Tim Hardaway Jr. left the game with right hamstring tightness in the first half and did not return. The Mavericks made 20 3-pointers.\n\n\r\n              Kings: G Malik Monk was ruled out with an ankle injury. He left in the second half of Friday’s game with the injury and didn’t return.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Travel to Phoenix to face the Suns on Tuesday.\n\n\r\n              Mavericks: Host the Timberwolves on Monday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995295.030494
}