{
  "game_id": "0021800858",
  "espn_id": "401071531",
  "date": "Feb 13, 2019",
  "matchup": "MEM @ CHI",
  "headline": "Porter scores career-high 37, Bulls beat Grizzlies 122-110",
  "body": "CHICAGO --  Otto Porter Jr. is no longer taking a back seat when it comes to scoring.\n\nPorter scored a career-high 37 points on 16-for-20 shooting, Robin Lopez added season-high 25 points, and the Chicago Bulls beat the Memphis Grizzlies 122-110 on Wednesday night.\n\nLauri Markkanen added 21 points as Chicago ended a franchise-record 11-game home losing streak with their first win at the United Center since beating Orlando on Dec. 21.\n\nPorter scored at ease, getting the Bulls' first six points in the third quarter and capping it off with a dunk off a pass from Zach LaVine. Porter later set up LaVine for a three-point play to give the Bulls a 80-66 lead with 7:21 left in the quarter.\n\nPorter was acquired a day before the deadline in a trade with Washington, where Joh Wall and Bradley Beal were the primary options. Porter is adjusting just fine to his new scoring role in the Chicago offense.\n\n\"It's totally different. I mean I'm just getting here, so I'm still figuring it out,\" Porter said.\n\nHe was 3 for 5 from 3-point range in his third career 30-point game.\n\n\"Obviously, Otto had a big night. He let it come to him, he took good shots, had a nice rhythm, got the ball in his hands. His versatility, I thought, really showed,\" Bulls coach Jim Boylen said.\n\nBradley got Memphis to 109-101 with 4:48 left, but the Bulls answered with a 10-0 run. Markkanen made a 3 to give the Bulls a 118-101 lead with 2:33 left.\n\nThe Bulls also won for just the fourth time in 22 games.\n\nAvery Bradley scored 15 points for the Grizzlies, who lost for the second straight night.\n\n\"I think we were tired. There was no about it. We had a bunch of guys put forth a ton of effort in a game that went down to the wire. Guys were competitive and the energy level was high, the spirit was high. Tonight, we just couldn't find a spark,\" Grizzlies coach J.B. Bickerstaff said.\n\nMike Conley was back in the Grizzlies' lineup after missing Tuesday's 108-107 loss to the Spurs with an illness. He finished with 12 points.\n\nPorter shot 8 for 9 from the field and 3 for 3 from 3-point range for 21 points in the first half.\n\n\"He (Porter) played very well, but not only him, but Lopez as well, Robin. He had a really good game. I thought he was the difference maker. He set the tone for the game for their team,\" Bradley said.\n\nThe Bulls led 67-62 at the half. Jaren Jackson Jr. and Jonas Valciunas each had 10 points for the Grizzlies and they each finished with 12 points.\n\nTIME FOR SOME REST\n\nThe break couldn't come at a better time for Bradley, who was traded from the Clippers at the deadline to Memphis. \"I'm going to enjoy it. Go see my family now. It's been a crazy few days so it is going to be nice to get home with my wife and my kids,\" he said.\n\nTIP-INS\n\nGrizzlies: C Joakim Noah, who received a nice ovation when he checked in the first quarter, played against his former team for only the third time. Noah was the 2013-14 Defensive Player of Year with the Bulls. \"My years in Chicago were just so special and I feel I learned so much. In that 10-year span we were really going for it, we were going for a championship, and I thought there was a couple of years where we really had a chance,\" Noah said.\n\nBulls: Former F Bobby Portis indicated in a HoopsHype article the communication with the Bulls leading to his trade to Washington at the deadline wasn't always direct. \"I just don't think it was done the right way,\" Portis was quoted as saying. Boylen didn't agree. \"At this level, a lot of times you get out of something what you put into it. Bobby had a great experience here that he's verbalized. Obviously, he's with a different team now. We did offer Bobby a contract to be here and it's his purgative to choose to not take that deal, part of the league too. Everybody here is being treated with respect. I'm direct and honest with what I want, who we are, who I think we can be,\" Boylen said. ... G Kris Dunn didn't play. He is out with a lower back contusion.\n\nUP NEXT\n\nGrizzlies: Bradley reunites with his former teammates when the Grizzlies host the Clippers on Feb. 22.\n\nBulls: Travel to Orlando after the All-Star break to face the Magic on Feb. 22.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994911.5041978
}