{
  "game_id": "0022400415",
  "espn_id": "401704981",
  "date": "Dec 26, 2024",
  "matchup": "BKN @ MIL",
  "headline": "Nets rally late for 111-105 victory over Bucks, who played again without Antetokounmpo and Lillard",
  "body": "MILWAUKEE -- — Cam Johnson scored 29 points, Noah Clowney added 20 and the Brooklyn Nets rallied late for a 111-105 victory over the Milwaukee Bucks on Thursday night.\n\n\r\n              Nic Claxton had 13 points for the Nets, who had lost eight of 10 before making 16 of 38 3-pointers against a Milwaukee squad that was playing a third straight game without Giannis Antetokounmpo and Damian Lillard.\n\n\r\n              With their top two scorers out, the Bucks got 21 points from Khris Middleton, 20 from Brook Lopez, 18 from Bobby Portis and 14 from Gary Trent Jr. while shooting 50.7% from the floor and 39.5% on 3-point attempts.\n\n\r\n              Takeaways\r\n              Nets: Brooklyn snapped a three-game losing streak at Milwaukee, where its most recent victory had been Feb. 26, 2022. The Nets return on Jan. 2 for the final meeting between the teams looking to clinch their first season series victory in four years.\n\n\r\n              Bucks: Lopez has scored 10 or more points in each of his last five games and has 41 points in his last two.\n\n\r\n              Key Moment\r\n              After trailing the entire second half, Brooklyn rattled off a 7-0 run late in the fourth to pull ahead 99-97. After Middleton scored to tie it, the Nets pulled ahead with a 3-pointer from Clowney and went up by four when Claxton split a pair of free throws with 1:57 to play. Middleton's 3 made it a one-possession game but Johnson converted a four-point play on the other end to put the Nets up 109-102 with 47 seconds to play.\n\n\r\n              Key Stat\r\n              Lopez scored 11 straight points in the second quarter but had just two points after halftime.\n\n\r\n              Up Next\r\n              The Bucks travel to Chicago to face the Bulls on Saturday night, while the Nets return to Brooklyn to host San Antonio before heading back out on the road to close out 2024.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997991.720109
}