{
  "game_id": "0022400494",
  "espn_id": "401705060",
  "date": "Jan 06, 2025",
  "matchup": "PHI vs. PHX",
  "headline": "Bradley Beal comes off the bench to score 25 as Suns top 76ers 109-99 to end 4-game skid",
  "body": "PHILADELPHIA -- — Bradley Beal came off the bench for the first time in nine years and scored 25 points as the Phoenix Suns ended a four-game skid with a 109-99 win over the Philadelphia 76ers on Monday night.\n\n\r\n              Beal was shifted to a reserve role before the game and scored 20 points in the second half as the Suns overcame an early 12-point deficit and won for the second time in nine games.\n\n\r\n              Kevin Durant scored 23 points and Ryan Dunn 15 for the Suns.\n\n\r\n              Tyrese Maxey had 31 points and 10 assists for the Sixers, who were missing Joel Embiid, who was sidelined with a left foot sprain. Kelly Oubre added 26 points as Philadelphia lost for the third time in four games.\n\n\r\n              Takeaways\r\n              Suns: Looking to jumpstart his lineup, Phoenix coach Mike Budenholzer took longtime starters Beal and Jusuf Nurkic out of the lineup and had them come off the bench. The Suns trailed after the first quarter for the fifth consecutive game, but the move paid off as the Phoenix bench outscored Philadelphia's reserves 54-7.\n\n\r\n              76ers: With Embiid out of the lineup for the 21st game this season, Philadelphia turned to Guerschon Yabusele to pick up some of the offensive slack from the center position. Yabusele finished with 14 points and 10 rebounds as the 76ers fell to 7-14 without Embiid.\n\n\r\n              Key Moment\r\n              Phoenix went on a 25-6 run in the third quarter, turning a seven-point deficit into a 12-point lead that was too much for Philadelphia to overcome. \n\n\r\n              Key Stat\r\n              The Suns shot 14-for-30 (46.7%) from beyond the arc, led by three 3s each from Durant, Beal and Dunn.\n\n\r\n              Up Next\r\n              The Suns wrap up a three-game trip in Charlotte on Tuesday. Philadelphia hosts Washington on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998219.8959491
}