{
  "game_id": "0021800371",
  "espn_id": "401071052",
  "date": "Dec 07, 2018",
  "matchup": "TOR @ BKN",
  "headline": "Nets end 8-game skid by edging Raptors 106-105 in OT",
  "body": "NEW YORK --  Kawhi Leonard's short shot went in and out. Fred VanVleet's 3-pointer went around the rim and spun out.\n\nFor 3 1/2 years, the Toronto Raptors had always found a way to beat the Brooklyn Nets.\n\nThis time, not one, but two chances just wouldn't fall.\n\n\"Just how the game goes sometimes,\" Leonard said.\n\nThat allowed the Nets to snap an eight-game losing streak overall and a 12-game skid against the Raptors with a 106-105 victory in overtime on Friday night.\n\nD'Angelo Russell scored 29 points, including six in overtime, and the Nets beat the Raptors for the first time since April 3, 2015.\n\n\"Needed that. Really did,\" Russell said. \"It was tough. We knew what we (had) to do to get it. So now we just got to keep going.\"\n\nJarrett Allen made the go-ahead basket for the Nets with a little more than a minute left, their only basket in overtime not made by Russell.\n\nLeonard scored 32 points for the Raptors, but Toronto couldn't get a look for him on its final possession and had to settle for VanVleet's 3-pointer that just missed.\n\nSpencer Dinwiddie scored 17 points for Brooklyn, which had been regularly falling short during its losing streak. The Nets had lost five times by single digits, including three two-point losses.\n\nJonas Valanciunas added 24 points for the Raptors.\n\nThe Nets led by seven with under 5 minutes remaining in regulation, but Leonard fed VanVleet for a 3-pointer and then scored the next six points himself to give Toronto a 96-94 edge with 2:23 to play. But his shot from in the lane rattled out with 7 seconds to play.\n\n\"Ball was in and out,\" Leonard said.\n\nHe then he blocked Dinwiddie's shot on the other end to force OT.\n\nRussell had the first two baskets in the extra session, Leonard made the next two, but the Raptors couldn't get one more shot to fall and take a victory before their schedule turns tough.\n\n\"They scored four points in about the first 40 seconds of the overtime and then we held them to four the rest of the overtime. They ended up with eight but we didn't do too much better,\" Raptors coach Nick Nurse said.\n\nThe Bucks now host Milwaukee on Sunday before a four-game trip to the Clippers, Golden State, Portland, and Denver. The Bucks are second in the East and three of the West teams are among the top four in that conference.\n\nThe Nets jumped to a 13-2 lead and were ahead 24-20 at the end of Leonard's 0-for-4 first quarter, but he came back with nine points in the second as Toronto tied it at 53 at halftime.\n\n\"I just tried to make it tough for him. He's a phenomenal player. Last five games he's been averaging 30, just being aggressive and being himself,\" Nets forward Rondae Hollis-Jefferson said. \"Just tried to speed him (up), make him take tough shots, make him turn, make him pick it up, settle for midrange.\"\n\nTIP-INS\n\nRaptors: NBA assists leader Kyle Lowry had 11 but was just 1 for 8 from the field for three points. ... The Raptors missed their first eight 3-point attempts before Delon Wright made one in the final minute of the first quarter. ... Valanciunas made just his 10th start of the season, with Serge Ibaka coming off the bench.\n\nNets: Allen finished with 12 points and 10 rebounds. ... The Nets had lost six straight at home to Toronto.\n\nLOWRY'S LAMENT\n\nLowry threw a good pass to VanVleet on the final possession but was hard on himself afterward for his own poor shooting.\n\n\"Just got to play better,\" he said. \"I don't make excuses. I don't have any excuses to make. I'm just not playing well.\"\n\nNO PROBLEM\n\nCoach Kenny Atkinson said he had no problem with Jared Dudley's comments after they blew a 23-point loss to Oklahoma City on Wednesday, when the veteran forward criticized the team for its repeated mistakes in crunch time. Atkinson said he respected Dudley's honesty, adding that at his urging the players held a film session without coaches during their off day so they could attempt to find solutions themselves.\n\nUP NEXT\n\nRaptors: Host Milwaukee on Sunday night.\n\nNets: Visit New York on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994280.235429
}