{
  "game_id": "0021500178",
  "espn_id": "400828065",
  "date": "Nov 20, 2015",
  "matchup": "CHA vs. PHI",
  "headline": "Jefferson, Hornets drop 76ers to 0-13",
  "body": "CHARLOTTE, N.C. --  The times that Al Jefferson is most confident he'll have a good game are not when the Hornets center is going against a rookie, and not even when he's facing a winless team.\n\nBoth of those occasions happened Friday in Charlotte's 113-88 victory over the Philadelphia 76ers. But what made Jefferson salivate most was seeing how the Sixers were defending him -- with only first-year player Jahlil Okafor.\n\n\"What made me start smelling blood is when I noticed they weren't double-teaming,\" he said.\n\nIt doesn't happen that often. When it does, Jefferson tries to take advantage by getting to the places on the floor where he loves to work his post moves the most.\n\nHe missed his first two attempts Friday, but sank the next six on his way to 18 first-half points that helped give the Hornets the kind of decisive lead the Sixers (0-13) have not been able to rebound from this season.\n\nCharlotte led by as many as 26 points before the 76ers outscored the Hornets 29-23 in the third quarter to slice the advantage to 81-70 with 1:06 left in that quarter.\n\nBut Charlotte rookie Frank Kaminsky had seven of the Hornets' next nine points spanning the end of the third and beginning of the fourth quarter to push the lead back to a safe 15.\n\nJefferson finished with 26 points on 11-for-19 shooting. He added 10 rebounds and five blocks.\n\nCharlotte improved to 7-6, and is now 5-1 at home after winning its last five home contests.\n\nNerlens Noel led Philadelphia with 16 points on 7-of-9 shooting in his first game coming off the bench this season.\n\nThe 76ers are within four losses of matching last season's franchise-worst start and are five defeats away from tying the NBA record, set by the 2009 Nets, for longest losing streak to begin a season.\n\nPhiladelphia, which opened a six-game road trip, is three away from tying the NBA record of 26 straight losses.  The 76ers already share that dubious mark with Cleveland, with Philadelphia's skid from Jan. 31-March 27, 2014, matching the Cavaliers' between Nov. 20, 2010-Feb. 9, 2011.\n\n\"We preach and we talk about it (morale) all the time,\" Sixers coach Brett Brown said. \"They give us their attitude and their effort; I am with them unconditionally. . They bust their tails. They are 20-year-old kids and I love coaching them. I respect them and we believe the good days will add up.\"\n\nTIP-INS\n\nSixers: The Sixers did not lead the entire game. . Philadelphia has not won since March 27, finishing last season with a 10-game losing streak.\n\nHornets: Cody Zeller sat out the game with a left ankle strain. . The Hornets lead the Eastern Conference in averaging 108.7 points per game at home. . Kaminsky was 4-for-4 for nine points. . The Hornets hit 48 percent of their 3-point attempts.\n\nFEELING THE PAIN\n\nOne Hornets player who understands the Sixers' winless plight is point guard Kemba Walker. Walker was part of the 2011-12 Charlotte team that was 7-59 in the lockout-shortened season.\n\nHe sees a light at the end of the tunnel for these Sixers.\n\n\"It's tough, but I definitely have to commend the players and the coach and that coaching staff because those guys always come to play, each and every night,\" Walker said. \"Even when I'm at home and watching League Pass, they're always in games. They're always challenging teams, despite their record. They really have some great young talent. And you know, it's a process. One day those guys are going to be really good.\"\n\nFIVE BLOCKS?\n\nEven Jefferson was surprised that he was credited with five blocks in the game. Four came in the first half.\n\n\"I did not realize that,\" Jefferson said. \"I think somebody made a mistake on that one. For real.\"\n\nUP NEXT\n\nSixers: Visit Miami on Saturday night.\n\nHornets: Host Sacramento on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994408.909555
}