{
  "game_id": "0022400534",
  "espn_id": "401705100",
  "date": "Jan 11, 2025",
  "matchup": "TOR @ DET",
  "headline": "Cunningham's triple-double leads Pistons to 123-114 victory over slumping Raptors",
  "body": "DETROIT -- — Cade Cunningham had 22 points, 17 assists and 10 rebounds, and the Detroit Pistons beat the Toronto Raptors 123-114 on Saturday night.\n\n\r\n              Cunningham fell one assist of his career high, set on Dec. 16, and has the second-most triple-doubles in Pistons history.\n\n\r\n              Tim Hardaway Jr. scored 27 points for the Pistons, who have won nine of 11. Malik Beasley added 18.\n\n\r\n              Immanuel Quickley had 25 points for Toronto, which has lost five straight and 16 of 17. Scottie Barnes had 16 points and 11 rebounds as Toronto had seven players score in double figures.\n\n\r\n              Quickley's jumper tied the game at 109 with five minutes left, but Toronto missed four straight free throws to allow Detroit to take a 113-109 lead on Cunningham's short jumper with 3:48 to play.\n\n\r\n              Takeaways\r\n              Raptors: Toronto came up empty on a key fourth-quarter possession despite grabbing three offensive possessions.\n\n\r\n              Pistons: Pistons coach J.B. Bickerstaff has settled on Ausar Thompson to fill Jaden Ivey's spot in the starting lineup. However, sixth man Beasley gets all of the playing time down the stretch. \n\n\r\n              Key moment\r\n              Toronto led 66-65 at halftime, but Hardaway had 11 points in the third quarter as Detroit built a 99-93 lead.\n\n\r\n              Key stat\r\n              The Pistons had 10 first-half turnovers, leading to 19 Toronto points, but the Raptors only got four points off their seven second-half turnovers.\n\n\r\n              Up next\r\n              Both teams return to action on Monday. Toronto will host the Golden State Warriors while the Pistons will travel to New York to face the Knicks.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996966.438625
}