{
  "game_id": "0022400789",
  "espn_id": "401705355",
  "date": "Feb 20, 2025",
  "matchup": "PHI vs. BOS",
  "headline": "Pritchard and Tatum lead Celtics to 124-104 win over 76ers",
  "body": "PHILADELPHIA -- — Payton Pritchard made eight 3-pointers and scored 28 points, Jayson Tatum finished with his fourth career triple-double, and the Boston Celtics beat the Philadelphia 76ers 124-104 on Thursday night.\n\n\r\n              Tatum had 15 points, 11 rebounds and 10 assists. Jaylen Brown added 20 points, Kristaps Porzingis scored 17, and Derrick White had 16 points and 10 rebounds for the Celtics, who have won eight of nine.\n\n\r\n              Paul George scored 17 points to lead the 76ers. Tyrese Maxey and Kelly Oubre Jr. had 16 apiece. The Sixers have lost six straight and eight of nine, falling a season-worst 15 games under .500.\n\n\r\n              Takeaways\r\n              Celtics: The Celtics trailed by 26 points before beating the host 76ers 118-110 on Feb. 2. They needed no such heroics this time, scoring 75 points in the first half and leading by 26 after three quarters.\n\n\r\n              76ers: The Sixers are 7-7 this season in games that Joel Embiid, Maxey and George have started together. They fell behind by 29 in this one and were never competitive during the final three quarters. Embiid scored 15 points on 3-of-9 shooting in 27 minutes.\n\n\r\n              Key moment\r\n              The Celtics' reserves led a 15-6 run early in the second quarter for a 16-point lead. Luke Kornet and Pritchard scored six points each during that span.\n\n\r\n              Key stat\r\n              The Celtics made 11 of their first 16 attempts from 3-point range and shot 15 of 25 on 3s in the first half. They finished 24 of 54 (44.4%). Boston leads the league with 48.3 3-point attempts per game.\n\n\r\n              Up next\r\n              Celtics: Host New York on Sunday.\n\n\r\n              76ers: Host Brooklyn on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998209.415354
}