{
  "game_id": "0021500261",
  "espn_id": "400828148",
  "date": "Nov 30, 2015",
  "matchup": "POR @ LAC",
  "headline": "Jordan grabs 24 rebounds, Clippers beat Blazers 102-87",
  "body": "LOS ANGELES --  The way the Portland Trail Blazers kept fouling DeAndre Jordan down the stretch in a feeble attempt to rally from a double-digit deficit was enough to turn anyone's stomach -- Damian Lillard notwithstanding.\n\nPortland sent Jordan to the free throw line nine times in the final 3:51, and the Clippers' center missed 10 of 18. But it didn't help the cold-shooting Blazers, who finished at 37.9 percent as Los Angeles beat them 102-87 on Monday night.\n\nJordan had a season-high 24 rebounds to go with 18 points, and Blake Griffin scored 23 to help the Clippers win their third in a row. The 34 free throw attempts by Jordan was a Clippers record.\n\n\"That just means more practice,\" he said. \"It gets boring. And it makes me miss my reservations after the game. But other than that, it's the same.\"\n\nLillard, who leads Portland with a 25.4 scoring average, left the game because of abdominal pain with 10:13 remaining in the third quarter and the Blazers trailing 53-51. He finished with seven points and no assists in 17 minutes.\n\n\"I'm pretty sure it was something I ate,\" said Lillard, who had an omelet at the team hotel after the morning shootaround. \"I didn't feel sick when we came out there, but when I went through warmups, I started to feel a little bit sick and I was pretty messed up. I had never felt like that.\n\n\"As soon as the game started, I just felt dead,\" he added. \"I had no energy and I just felt weak. I tried to play through it, just to see if I would be able to get myself going. But I wasn't comfortable turning and running in different directions with that stomach pain. I thought I was going to throw up on the court.\"\n\nLillard has started all 264 regular-season games the Blazers have played since the fourth-year veteran guard entered the NBA. That streak is in danger of ending Tuesday night against Dallas if his ailment doesn't subside.\n\n\"If I'm good enough to go, then I'm going to play,\" he said. \"But I know I can't go out there the way I was tonight. Hopefully I'll be ready.\"\n\nGriffin, who began the day with an NBA-best .548 field goal percentage, made eight of 19 shots and grabbed eight boards. Chris Paul had 10 points and six assists in 24 minutes, exiting in the third quarter because of a strained rib muscle.\n\nGriffin's 450 points are the most by a Clippers player through the first 18 games of a season since the franchise relocated from San Diego to Los Angeles in 1984-85.\n\nThe Clippers barely outrebounded Portland 55-54, the first time in 18 games this season that they had the advantage in that department -- although they have finished on even terms three times.\n\nMaurice Harkless led Portland with 15 points. Shooting guard C.J. McCollum, who entered second on the team with a 20.4 scoring average, missed eight of his first nine shots and finished 4 for 15 with 12 points and 10 assists.\n\nMeyers Leonard trimmed the Clippers' lead to 77-70 on an 11-footer with 9:12 to play, but Los Angeles went on a 15-6 run to pull ahead 92-76 with 4 1/2 minutes remaining. J.J. Redick capped the rally with his fourth and final 3-pointer.\n\nMcCollum hit a 3 from the top of the key with 2 seconds left in the first half, pulling the Blazers into a 49-all tie.\n\nHarkless, the fourth player off the Portland bench, led the Blazers with 11 points in the half -- all during a 21-3 surge that turned a 13-point deficit into a 42-37 lead with 3:34 left in the second quarter.\n\nLos Angeles opened the game with a 19-4 run that included seven points and six rebounds by Jordan, the franchise's career rebounding leader. The Clippers are 16-8 in the regular season when he grabs at least 20.\n\nTIP-INS\n\nTrail Blazers: Lillard, in the first season of a five-year, $120 million contract extension, has led Portland in scoring in 15 of its first 18 games. ... C Chris Kaman, who spent his first eight NBA seasons with the Clippers, didn't play because of a sprained right ankle. ... The Blazers finished a five-game stretch in which they played the Clippers and Lakers twice each. ... The Blazers go into December with a 7-11 record, compared to their 13-4 mark last season. They have won more than 50 games in each of the last two seasons. ... Portland is 0-8 when trailing after three quarters.\n\nClippers: Redick has made a career-high 11 field goals in a game on four occasions, and three of those times he did it against Portland. He was 5 for 14 in this one. ... The Clippers recalled G C.J. Wilcox and F Branden Dawson from the Bakersfield Jam of the D-League. Both were on the inactive list.\n\nUP NEXT\n\nTrail Blazers: Host Dallas on Tuesday.\n\nClippers: Host Indiana on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994526.920655
}