{
  "game_id": "0022200165",
  "espn_id": "401468320",
  "date": "Nov 09, 2022",
  "matchup": "TOR vs. HOU",
  "headline": "VanVleet scores season-high 32, Raptors beat Rockets 116-109",
  "body": "TORONTO -- — Fred VanVleet scored 12 of his season-high 32 points in the fourth quarter, O.G. Anunoby matched his season best with 27 points and added 10 rebounds, and the Toronto Raptors beat the Houston Rockets 116-109 on Wednesday night.\n\n\r\n              Otto Porter Jr. scored 14 points, Scottie Barnes had 13 and Gary Trent Jr. 11 as the Raptors improved to 5-1 at home.\n\n\r\n              VanVleet made a season-high seven 3-pointers, topping the six he hit in Monday’s loss at Chicago. He shot 7 for 16 from long range against the Rockets.\n\n\r\n              “I feel like I’m one of the top shooters in the league,” VanVleet said. “The more attempts I get, the better chance I’ve got to make them.”\n\n\r\n              VanVleet shot 8 for 16 in the second half, going 4 of 9 from long distance.\n\n\r\n              “VanVleet came through for them and made some big plays,” Rockets coach Stephen Silas said.\n\n\r\n              Jabari Smith Jr. had 15 points and 10 rebounds, and Kevin Porter Jr. had 12 points and 11 assists but the Rockets lost for the seventh time in eight games.\n\n\r\n              “I thought Kevin did a great job of getting the ball in the paint and making plays for his teammates,” Silas said.\n\n\r\n              Jalen Green scored 21 points and Alperen Sengun had 17. Seven different Rockets players scored in double digits.\n\n\r\n              Green had two of the Rockets’ four turnovers in the fourth quarter, when the Raptors scored 10 points off Houston miscues.\n\n\r\n              “Those turnovers killed us down the stretch,” Green said. “We’ve got to control that ball.”\n\n\r\n              Houston committed 16 turnovers, leading to 31 points for Toronto.\n\n\r\n              Toronto led 20-19 with 5:53 left in the first but KJ Martin scored five points as Houston closed the quarter with an 18-9 run to lead 37-29 after one.\n\n\r\n              The Rockets shot 14 for 20 in the first, then missed eight of their first nine field goal attempts to begin the second. Houston was 4 of 21 in the second, going 1 for 13 from 3-point range.\n\n\r\n              Anunoby and VanVleet each scored nine points in the second quarter, and Toronto led 57-54 at halftime.\n\n\r\n              VanVleet scored eight points in the third as the Raptors took an 86-82 lead into the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Had 11 assists in the first quarter. They finished with 29. … Dropped to 1-8 on the road. … Sengun had eight rebounds.\n\n\r\n              Raptors: F Precious Achiuwa left early in the fourth quarter because of a sprained right ankle. … F Pascal Siakam (strained right adductor muscle) missed his third straight game. Siakam, injured last Friday at Dallas, is expected to miss at least two weeks. … C Khem Birch (right knee) missed his fourth straight game.\n\n\r\n              BOARD GAMES\n\n\r\n              The Raptors had 20 rebounds in the second quarter and finished with 50. … Toronto got 27 rebounds from bench players, including eight from Thad Young.\n\n\r\n              FRIENDLY RIVALS\n\n\r\n              Barnes was a guest instructor at Green’s youth basketball camp last summer, but the Rockets guard said good vibes between the pair were put on pause Wednesday.\n\n\r\n              “It’s a friendly duel every time we step on the court,” Green said. “Me and Scottie have been friends since seventh grade, eighth grade. Every time we step on that floor, the whole friendship goes out the window. I think that goes for both of us.”\n\n\r\n              GRAND THEFT\n\n\r\n              Anunoby has three or more steals in a career-high six consecutive games.\n\n\r\n              “If he ever gets any meaner, he’s gonna be really scary,” VanVleet said. “He can probably steal the ball whenever he feels like it.”\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Visit the New Orleans Pelicans on Saturday night.\n\n\r\n              Raptors: Visit the Oklahoma City Thunder on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994098.112968
}