{
  "game_id": "0022200207",
  "espn_id": "401468362",
  "date": "Nov 15, 2022",
  "matchup": "LAC @ DAL",
  "headline": "Doncic, Mavs blow big lead, hang on to beat Clippers 103-101",
  "body": "DALLAS -- — Luka Doncic was a little confused reacting to a key 3-pointer that helped Dallas avoid a loss after blowing a 25-point lead against Paul George and the Los Angeles Clippers.\n\n\r\n              The Mavericks superstar gave the home crowd the universal “hush” symbol with an index finger to the lips after he grabbed an errant pass near the sideline and just beat the shot-clock buzzer.\n\n\r\n              “I wanted a celebration,” Doncic said about the last of his 35 points with 27 seconds remaining. “I’m not going to shush our fans, so I don’t know why I did that.”\n\n\r\n              Oh, well. They ignored him, and went home happy.\n\n\r\n              Dorian Finney-Smith scored 21 points and the Mavericks held on for a 103-101 victory, avoiding what would have been a second loss this season after leading by 22 or more.\n\n\r\n              Reggie Bullock broke out of a shooting slump with four 3-pointers in the fourth quarter, including two in a row to put Dallas ahead for good at 99-93 with less than two minutes remaining.\n\n\r\n              About a minute later, Bullock was driving when his pass deflected off Finney-Smith's hand and bounced toward the sideline, where Doncic reached for the ball and got in a shooting position.\n\n\r\n              It was just the second 3 of the game for Doncic, who had 11 rebounds and made all 11 of his free throws.\n\n\r\n              George scored 23 points, playing the entire second half to try to keep the LA rally going on the second night of a Texas back-to-back after winning in Houston.\n\n\r\n              “He got tired,” Clippers coach Tyronn Lue said. “That was on me. They were double-teaming him, just like we wanted them to do. We just had to complete some of the passes, which we didn't do.”\n\n\r\n              Nicolas Batum scored the first 21 of his 22 points all on 3-pointers without a miss, then was fouled on purpose trying to get off a 3 with the Clippers down three in the final seconds. \n\n\r\n              Batum made the first free throw and missed the second on purpose, with the rebound going out of bounds off the Clippers. Dallas inbounded after a timeout and ran out the final 3.2 seconds.\n\n\r\n              The Mavericks led by 25 late in the first half, but the lead was down to two late in the third quarter and gone with about eight minutes remaining in a back-and-forth final quarter that featured seven ties and six lead changes.\n\n\r\n              Bullock scored all 13 of his points in the fourth, and Spencer Dinwiddie had 16. Marcus Morris Sr. scored 18 for the Clippers.\n\n\r\n              BACK IN IT\n\n\r\n              The Clippers finished off a 30-point swing by taking a five-point lead with eight minutes to go before Dallas quickly jumped back in front.\n\n\r\n              John Wall replaced Luke Kennard to start the second half and scored 10 of his 17 points in the third quarter. Kennard didn't return after leaving with a right calf strain less than three minutes in.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Kawhi Leonard, who made the two-game trip to Texas, was out again for right knee injury management. He hasn't played since the third game of the season. ... LA had its lowest-scoring first half (32 points) after matching its worst quarter of the season with 15 in the first. ... Batum is the first Clippers player to finish a game perfect from 3 with at least seven attempts.\n\n\r\n              Mavericks: C JaVale McGee was inactive due to a neck strain. ... F Maxi Kleber went to the locker room after getting upended onto his back in the second quarter, but returned before the end of the first half. He was eventually ruled out with a bruised lower back.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Detroit visits Thursday. LA has won six in a row in the series and is 20-4 since 2009-10, when the Clippers ended a 13-game losing streak against the Pistons.\n\n\r\n              Mavericks: Houston visits on the second night of a back-to-back Wednesday. Dallas swept the Rockets last season, winning the four games by an average of 16.5 points.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994991.256089
}