{
  "game_id": "0021800101",
  "espn_id": "401070782",
  "date": "Oct 30, 2018",
  "matchup": "POR @ HOU",
  "headline": "Lillard, Nurkic score 22 each as Blazers rout Rockets 104-85",
  "body": "HOUSTON --  Coach Mike D'Antoni got tired of answering question after question about what's wrong with the Houston Rockets after they were trounced again Tuesday night.\n\n\"I can sit up here and talk for the next five minutes, but we're not playing well. That's the bottom line,\" he said. \"And we've got to figure out why and do a better job.\"\n\nDamian Lillard and Jusuf Nurkic scored 22 points each, and the Portland Trail Blazers never trailed in a 104-85 rout of the struggling Rockets.\n\nThe Rockets dropped their fourth straight in their second game without James Harden, who is out with a hamstring injury, to fall to 1-5. After entering the season with eyes on a championship, the Rockets have rarely even been competitive, dropping their four home games by an average of more than 17 points.\n\nWhile the Rockets certainly know they need to improve, they're also quick to point out the season is still young.\n\n\"We realize that it's early, and if you run off 10 wins in a row or something like that at some point, this would be an afterthought,\" Chris Paul said.\n\nNow they face a season-long five-game road trip where they'll likely be without Harden and fellow starter James Ennis (right hamstring) for at least the first game and possibly more.\n\nThe Rockets are careful not to point fingers and insist everyone must be better to turn things around.\n\n\"We're going to figure this out together,\" Carmelo Anthony said. \"It's not one person.\"\n\nPortland led by double digits most of the night and was up by 23 entering the fourth quarter. Houston got within 15 with about two minutes left, but that was it in front of a crowd which began steadily streaming out midway through the third quarter.\n\nCJ McCollum added 19 points for the Trail Blazers, who improved to 5-2 with their second straight victory.\n\nPaul led Houston with 17 points and nine assists in his second game back after a two-game suspension for his role in a fight with the Los Angeles Lakers.\n\nWhile getting Harden back will certainly give the Rockets a boost, Houston's problems extend beyond missing last year's MVP. The Rockets have been unable to get into any kind of rhythm on offense and look lost at times on defense. Their 3-pointers aren't falling, and when they get open looks, they seem to miss a lot of those, too.\n\nThe Rockets made just 10 of 43 3-pointers on a night they shot 32.3 percent overall.\n\nD'Antoni insists his team will be good and that it just needs time to gel. But the man known for his fast-paced, high-flying offenses must be scratching his head at how he can get this team on track after such an awful start.\n\nThe Trail Blazers had a 15-point lead by halftime and used an 11-3 run to open the third quarter and extend it to 62-39. Nurkic had two dunks in that stretch, and Jake Layman capped the run with a 3-pointer.\n\n\"That was really good,\" coach Terry Stotts said. \"To get a quick lead and jump out on them like that and get it up to 20, rather than give them any life early, I think that was really important.\"\n\nAnthony made a layup midway through the quarter to cut the lead to 21, but the Trail Blazers scored the next seven points to make it 76-48 about a minute later. The Rockets committed three fouls, missed two free throws and one basket in that stretch.\n\nTIP-INS\n\nTrail Blazers: Nurkic had 10 rebounds. ... Portland made 8 of 20 3-pointers. ... Maurice Harkless sat out with a left knee injury.\n\nRockets: C Nene, who hasn't played this season, remains out indefinitely with a strained right calf strain. ... F Marquese Chriss, who has been inactive all season because of a sprained left ankle, had four points and two rebounds. ... Ennis missed his third straight game with a strained right hamstring.\n\nKEEPING IT LIGHT\n\nDespite the tough start, D'Antoni hasn't lost his sense of humor and responded with a joke when asked about his team's record.\n\n\"We do have 76 games (left). You can ask the analytical guys but mathematically I think we're still in it,\" he said. \"So, we'll figure it out.\"\n\nUP NEXT\n\nBlazers: Host New Orleans on Thursday night.\n\nRockets: Visit Brooklyn on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995205.71822
}