{
  "game_id": "0021800755",
  "espn_id": "401071428",
  "date": "Jan 29, 2019",
  "matchup": "PHI @ LAL",
  "headline": "Embiid scores 28, leads 76ers to 121-105 victory over Lakers",
  "body": "LOS ANGELES --  Philadelphia 76ers coach Brett Brown decided to experiment with his lineup during Tuesday night's game against the Los Angeles Lakers. If one game is any indication, Brown can consider it a success.\n\nThe Sixers led throughout and were up by 24 in the second quarter as they rolled to a 121-105 victory over the short-handed Lakers.\n\nJoel Embiid scored 28 points and grabbed 11 rebounds from his usual spot in the middle, but Jimmy Butler and Ben Simmons thrived in new roles. Butler had 20 points and six assists in his first game at point guard, and Simmons scored 19 while playing the stretch 4 -- power forward with the range of a shooting guard.\n\n\"I think Jimmy did an amazing job getting everyone open. We still need to work on stuff to get better, but it was an amazing start,\" said Embiid, who had his NBA-leading 34th game with at least 20 points and 10 boards.\n\nBrown said he changed the lineup because he wanted to learn more about his team with the trade deadline less than two weeks away and with an eye toward possible matchups in the playoffs.\n\n\"There were some good things that came out of it,\" Brown said. \"These are things to help us win and it gives us a greater level of knowledge about how we need to grow our team.\"\n\nBrandon Ingram had a career-high 36 points for the Lakers, who were missing Kyle Kuzma (hip) along with LeBron James and Lonzo Ball.\n\nButler was back after missing three games due to a sprained wrist. He got off to a quick start with nine points in the first quarter as Philadelphia ran off 12 straight points to take control early. The Sixers extended their lead to 38-17 late in the first and were up 39-20 at the end of the period as they went 15 of 27 from the field and forced eight turnovers.\n\n\"It felt good playing the point,\" Butler said. \"It's a different look. We've got so many guys that do so many things well that it allows us to get to the basket more.\"\n\nSimmons, who had 11 points in the first 12 minutes, said he liked the new-look lineup because he felt less pressure.\n\nA 3-pointer by Landry Shamet gave Philadelphia a 48-24 advantage with 8:14 remaining in the second before Los Angeles scored 16 straight points to get within eight. Ingram scored nine of his 15 points in the quarter during that run. The Sixers answered with a pair of 3-pointers by Wilson Chandler and went into halftime with a 64-53 advantage.\n\nThe Lakers got to 80-71 midway through the third quarter on a pair of free throws by Ivan Zubac, but Shamet and Embiid hit 3s to put Philadelphia's lead back in double digits.\n\n\"We definitely gave them momentum at the start. We fought back but they pretty much had a rhythm throughout the game,\" Ingram said.\n\nThe Sixers went up by 19 in the second half. The only scary moment for them came early in the fourth quarter when Embiid appeared to hurt his back falling down on an alley-oop attempt. He returned later in the game and said he was fine.\n\nTIP-INS\n\n76ers: Mike Muscala added 17 points off the bench. ... Embiid is tied with Utah's Rudy Gobert for the league lead in double-doubles with 41. ... Embiid also picked up his third flagrant foul of the season during the third quarter. ... It was the fourth straight game Philadelphia scored 30 points or more in the first quarter. The 76ers are averaging 30.7 points in the opening 12 minutes, second in the league to Golden State. ... The Sixers had 11 steals in the first half, their most in a half since Jan. 27, 2017, vs. Houston.\n\nLakers: JaVale McGee had 17 points and 14 rebounds. ... Rajon Rondo had 14 assists and has 38 in three games since returning from a finger injury. ... Tyson Chandler, rested by coach Luke Walton in the previous game, had no points in four minutes. Walton said before the game he would try to monitor Chandler's minutes the remainder of the regular season.\n\nUP NEXT\n\n76ers: At the Golden State Warriors on Thursday night.\n\nLakers: Face the Los Angeles Clippers on Thursday night as the visiting team at Staples Center.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Joe Reedy at www.twitter.com/joereedy",
  "source": "espn_api",
  "crawled_at": 1764994024.9482849
}