{
  "game_id": "0022301145",
  "espn_id": "401585773",
  "date": "Apr 09, 2024",
  "matchup": "PHI vs. DET",
  "headline": "Joel Embiid scores 37 as 76ers beat Pistons 120-102 for 6th straight victory",
  "body": "PHILADELPHIA -- — Joel Embiid had 37 points and 11 rebounds and the Philadelphia 76ers extended their winning streak to six games with a 120-102 win over the Detroit Pistons on Tuesday night. \n\n\r\n              Buddy Hield scored 18 and Kelly Oubre Jr. added 17 as the 76ers (45-35) continued their push to avoid the Play-In Tournament and stayed in contention for the sixth spot in the Eastern Conference playoffs. \n\n\r\n              “I keep my eyes on the other games, but it doesn't matter if we (keep winning),” Embiid said. “Play-in or not, it doesn't really matter.”\n\n\r\n              Embiid added eight assists and played 36 minutes — his most in the four game since his return from a meniscus injury suffered on Jan. 30.\n\n\r\n              “I want to keep playing as many minutes as possible,\" Embiid said. “I just want to keep building up because we don't have many days (before the playoffs).”\n\n\r\n              Jaden Ivey scored 25 points and Evan Fournier added 21 for the Pistons, who fell to 13-66 and inched closer to clinching the worst record in the NBA this season.\n\n\r\n              “They were aggressive in the paint and just coming right at us,” Pistons coach Monty Williams said. “It's unbelievably hard to guard when you have guys running through your chest all night. But that's what the NBA is right now and our guys have to adjust to that kind of basketball — especially on the defensive end.”\n\n\r\n              The Pistons, helped by four Philadelphia turnovers, used a scoring outburst by Ivey and Fournier in the third quarter to cut their deficit to 71-70. However, Embiid and the Sixers' offense kicked into gear and Philadelphia extended its lead to 90-78 by the end of the period.\n\n\r\n              “When we had that moment when it was a one point game, their physicality took us out of our pace and we couldn't get the movement and pace that gave us some life in the second and third quarter,” Williams said. \n\n\r\n              Embiid did have an awkward moment in the third when the left knee appeared to slip and hyperextend as he fell near the Philadelphia baseline and bench. \n\n\r\n              “It looked pretty awkwardly and it looked pretty painful,” Sixers head coach Nick Nurse said. “But he went right to his normal spot (on the bench during the timeout) and said he was good to go.”\n\n\r\n              “I'm fine,” Embiid said when asked about the play in the locker room after the game.\n\n\r\n              Philadelphia played without Tyrese Maxey, who scored a career-high 52 in a double overtime victory over Antonio on Sunday night. Maxey was scratched with left hip soreness, while fellow backcourt member Kyle Lowry missed his second straight game with left knee swelling. \n\n\r\n              Tobias Harris returned to the Philadelphia lineup after having a left knee bruise that forced him to miss all three games of the team's road trip. He scored 15 points on 6-of-13 shooting in 28 minutes. De'Anthony Melton also returned to the Sixers' rotation for the first time since Feb. 27, scoring five points in 16 minutes. \n\n\r\n              UP NEXT\n\n\r\n              Pistons: Hosts Chicago on Thursday night\n\n\r\n              76ers: Host Orlando on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996404.625605
}