{
  "game_id": "0022000794",
  "espn_id": "401307587",
  "date": "Apr 10, 2021",
  "matchup": "TOR @ CLE",
  "headline": "Trent scores career-high 44, Raptors rout Cavaliers 135-115",
  "body": "CLEVELAND -- — Gary Trent Jr. scored a career-high 44 points and the severely short-handed Toronto Raptors scored a franchise-record 87 first-half points en route to a 135-115 blowout victory over the Cleveland Cavaliers on Saturday night.\n\n\r\n                    Trent made 17 of 19 field goals, including shooting 7 of 9 from 3-point range, and went 3 of 3 from the foul line in 33 dynamic minutes. The third-year pro was acquired from Portland with Rodney Hood on March 25 for Norman Powell.\n\n\r\n                    “I’ve brought everything I learned from the great players in the Portland Trail Blazers organization to my new team,” said Trent, who is averaging 17.9 points in nine games with Toronto. “I took everything they taught me to heart, and I appreciate being put in certain situations to show what I can do now.”\n\n\r\n                    The Raptors, who built an 84-46 lead late in the second quarter, were without their top three scorers in Pascal Siakam (rest), Fred VanVleet (left hip flexor strain) and Kyle Lowry (right foot infection), who are averaging a combined 57.5 points.\n\n\r\n                    Toronto rookie Malachi Flynn had season highs of 20 points and 11 assists in his second NBA start, while OG Anunoby scored 15 points and Yuta Watanabe added 14 off the bench. Trent also matched his career best with seven rebounds.\n\n\r\n                    “Gary doesn’t need a whole lot of encouragement to keep shooting, which you can probably tell,” Raptors coach Nick Nurse said with a chuckle. “And he was feeling it, too. It was one of those nights, right?”\n\n\r\n                    Collin Sexton scored 29 points, Darius Garland had 19 points and eight assists, and Isaiah Hartenstein posted 12 points, eight boards and six assists for Cleveland, which trailed 47-26 after the first quarter and 87-54 at halftime.\n\n\r\n                    “It was embarrassing what happened in the first half,” Sexton said. “We came out being soft and it’s our job as starters to be better, to set the tone for the game right away.”\n\n\r\n                    Toronto made its first 12 shots and broke the Cavaliers’ opponent records for points in the first quarter and in any half. Trent buried his first nine attempts and had 25 points at the break, six shy of his previous best for an entire game.\n\n\r\n                    “Gary caught fire super early and it never left,” Flynn said. “He didn’t force anything at all. He just kept looking for his shot when it was there.”\n\n\r\n                    The Raptors wrap up a stretch of nine games in 15 days Sunday at New York. Nurse said Siakam will play and Lowry could return against the Knicks.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: VanVleet sat out his fourth straight game and Lowry missed his seventh in a row. Toronto last played with its starting backcourt on March 29 at Detroit. ... G Jalen Harris (right hip pointer) and G Paul Watson Jr. (COVID-19 protocols) also were inactive. ... C Khem Birch, who played for Nurse on the Canadian national team in 2019, was signed before the game and will join the team in New York.\n\n\r\n                    Cavaliers: C Jarrett Allen (concussion), F Larry Nance Jr. (illness) and G Dylan Windler (left knee soreness) remain out, but coach J.B. Bickerstaff said each is making progress. Allen has missed seven games since absorbing an elbow to the head on March 26 at the Lakers. ... F Mfiondu Kabengele signed a 10-day contract. The 6-foot-9, 250-pounder averaged 1.2 points in 23 games with the Clippers this season.\n\n\r\n                    LOVE SHACK\n\n\r\n                    Cavaliers C Kevin Love, who remains on a minutes restriction, scored 18 points in his fifth game back from a three-month absence with a strained right calf. The three-time All-Star is averaging 13.6 points and 7.2 rebounds over 22.8 minutes since returning. “Kevin takes so much pressure off everyone else because teams have to game plan for him,” Bickerstaff said. “He’s such an efficient player.”\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Visit New York on Sunday. Toronto has won its last four games at Madison Square Garden and has beaten the Knicks nine straight times overall.\n\n\r\n                    Cavaliers: Host New Orleans on Sunday. Cleveland has lost five in a row to the Pelicans, including a 116-82 road drubbing in their only meeting last season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996830.063346
}