{
  "game_id": "0022200844",
  "espn_id": "401468999",
  "date": "Feb 10, 2023",
  "matchup": "SAC vs. DAL",
  "headline": "Irving's 25 points, 10 assists lead Mavericks over Kings",
  "body": "SACRAMENTO, Calif. -- — Kyrie Irving had 25 points and 10 assists as the Dallas Mavericks beat the Sacramento Kings 122-114 on Friday night for their third straight win.\n\n\r\n              Irving played his second game since being traded by the Brooklyn Nets to the Mavericks. In his Dallas debut, he scored 24 points Wednesday night in a road win over the Los Angeles Clippers.\n\n\r\n              Josh Green scored 17 points and Tim Hardaway Jr. added 15 as the Mavericks won for the fifth time in six games.\n\n\r\n              “We are playing fast and moving the ball,” Green said. “Playing off the ball. Really unselfish style of the game. It's fun to play with.”\n\n\r\n              Dallas led by as many as 24 points and never trailed. The Kings cut the deficit to six points with 20 seconds remaining. \n\n\r\n              “Just being connected and understanding the roles,” Mavericks coach Jason Kidd said of the success.\n\n\r\n              De’Aaron Fox scored 33 points for Sacramento. The Kings were coming off back-to-back wins over the Houston Rockets.\n\n\r\n              “Yeah, we struggled from 3,” Fox said. “But I don’t think offense was a problem tonight ... 114 points should be enough to win an NBA game.”\n\n\r\n              Domantas Sabonis had 18 points, 10 rebounds and seven assists for the Kings. He leads the NBA in double-doubles with 43.\n\n\r\n              “Dallas came out and hit us in the mouth to begin the game,” Kings coach Mike Brown said. “We gave up 45 points in the first quarter and that’s hard to recover from.”\n\n\r\n              Keegan Murray added 16 points, making four 3s.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Dallas ruled out G Luka Dončić with a right heel contusion. His status for Saturday night's game at Sacramento remains undetermined.\n\n\r\n              Kings: Fox was chosen as an NBA All-Star replacement earlier in the day. It will mark his first All-Star game appearance. … G Malik Monk exited in the final minute of the third quarter after taking a hard fall. He walked off the floor under his own power into the locker room and didn't return because of an injured right ankle.\n\n\r\n              UP NEXT\n\n\r\n              The teams finish a two-game series with another game in Sacramento on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995296.348512
}