{
  "game_id": "0021900193",
  "espn_id": "401160835",
  "date": "Nov 18, 2019",
  "matchup": "HOU vs. POR",
  "headline": "Harden, Westbrook help Rockets rout Trail Blazers 132-108",
  "body": "HOUSTON --  James Harden has been scoring at such a prolific rate this season that his 36-point effort in Houston’s rout of Portland on Monday night actually caused his average to dip.\n\n“For him he had a subpar night,” Portland coach Terry Stotts said with a slight laugh.\n\nRussell Westbrook added 28 points and a triple-double to help the Rockets to their eighth straight win, 132-108.\n\nHarden, who has scored at least 30 points in eight straight games, had six rebounds, five assists and a steal. He leads the NBA by averaging a career-high 39.2 points this season. The second-highest scorer in the league is Milwaukee’s Giannis Antetokounmpo, who is well behind Harden at 30.3 points a game.\n\n“I think that a lot of people like to normalize greatness when you see it over and over again,” Westbrook said. But it's not normal because there's no one else that can do it. If it was normal everybody would do it. He's put himself in a position to one of the best ... scorers of all time.”\n\nWestbrook had 13 rebounds and 10 assists for his third triple-double of the season and the 141st of his career after sitting out to rest in Houston's last game on Saturday night.\n\nCoach Mike D’Antoni loved the way Harden and Westbrook worked together on Monday night.\n\n“You've got a dose of (Westbrook’s) athleticism coming at you and they've got to get back and get a wall and then ... it didn't quite go and get it back to James and just let him do what James does,” D’Antoni said. “It's a pretty good 1-2 punch, that's for sure.”\n\nThe Rockets led by double digits for most of this one on a night they got starters Clint Capela and Danuel House back after both players had missed time with injuries.\n\nHouston was up by 18 with about five minutes left when Harden made a 3-pointer to make it 120-99. Westbrook collected his 10th assist when Harden made a layup with about 3 1/2 minutes left for Houston's next points and the pair along with P.J. Tucker headed to the bench for good after that.\n\nCJ McCollum led the Trail Blazers with 25 points in a game where Damian Lillard shot just 4 of 15 and had 13 points.\n\nStotts was unhappy that his team had more rebounds overall than Houston but had just 12 offensive rebounds to 17 by the Rockets.\n\n“The thing that was probably the most disappointing was their offensive rebounding and how they converted their offensive rebounding into points,” he said. “I thought that was the difference in the first half.”\n\nHouston led by 23 points entering the fourth quarter after scoring 35 points in a big third quarter. The Trail Blazers cut it to 102-85 with about 9 minutes to go but Westbrook had the next three points to pad the lead.\n\nThe Trail Blazers cut the lead to 11 with a 3-pointer by McCollum with about 8 1/2 minutes left in the third quarter. The Rockets then used a 19-6 run to make it 94-70 with about 2 1/2 minutes left in the period. Harden had six points in that stretch and Tucker made a 3-pointer and added five points.\n\nThe Rockets were up by 14 at halftime after a 15-point second quarter from Harden.\n\nTIP-INS\n\nTrail Blazers: Stotts said Carmelo Anthony is expected to join the team on Tuesday. Anthony hasn't played in the NBA since Nov. 8, 2018, when he was with the Rockets ... Portland made 11 of 36 3-pointers.\n\nRockets: G Eric Gordon spoke to reporters on Monday for the first time since having arthroscopic surgery on his right knee last week. Gordon said he is feeling good and hopes to return around Christmas. ... House returned after missing the last three games with a back injury. ... Capela was back in the lineup after sitting out two games with a concussion.\n\nCAPELA & HAYES\n\nCapela added a season-high 22 points and had 20 rebounds to become the first Rocket to have at least 20 rebounds in four straight games since Hall of Famer Elvin Hayes in 1971. Hayes sat courtside with fellow Hall of Famer Hakeem Olajuwon to witness Capela’s big game.\n\n“I talked to him a little bit after the game and he congratulated me,” Capela said. So I’m just proud and hopefully I can keep going.”\n\nUP NEXT\n\nTrail Blazers: Visit New Orleans on Tuesday night.\n\nRockets: Visit Denver on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996653.031192
}