{
  "game_id": "0022300983",
  "espn_id": "401585611",
  "date": "Mar 18, 2024",
  "matchup": "CLE @ IND",
  "headline": "LeVert, Allen lead short-handed Cavs past Pacers 108-103",
  "body": "INDIANAPOLIS -- — Caris LeVert and Jarrett Allen each scored 23 points and the short-handed Cleveland Cavaliers fended off a late push from the Indiana Pacers for a 108-103 win on Monday night.\n\n\r\n              Cleveland played without three regular starters, including star guard Donovan Mitchell, as the Cavs fight to hold onto a top-three seed in the Eastern Conference.\n\n\r\n              Cleveland led by as many as nine in the final quarter before Indiana pulled even with 2:05 remaining. LeVert drove baseline and then pulled up and swished a 9-foot fadeaway jumper to regain the lead. The Pacers didn't score again.\n\n\r\n              “I'm very comfortable in those situations,” LeVert said. “I knew what I was going to.”\n\n\r\n              LeVert had 11 assists and eight rebounds. Allen had nine rebounds.\n\n\r\n              “We've got a lot of guys capable of contributing and making big plays down the stretch,” LeVert said. “Our defense really held up the last three quarters of the game and won us that game. That's a good offensive team. We held them to what, 103? That says a lot about our defense.”\n\n\r\n              Mitchell, who averages a team-high 27.4 points, remains slowed by a left knee bruise that has bothered him since the break. It’s likely the Cavs will rest him a few more games so he’s ready for the postseason. Forward Evan Mobley (ankle) and guard Max Strus (knee) were also out.\n\n\r\n              The absences necessitated signing veteran forward Marcus Morris Sr. to a 10-day contract. Morris scored 14 off the bench in 20 minutes.\n\n\r\n              “It took toughness,” Cavs coach J.B. Bickerstaff said. “It took resilience. It took togetherness to make sure that we never splintered, even with adversity and ups and downs.”\n\n\r\n              Pascal Siakam led the Pacers with 19 points and 12 rebounds. All-Star Tyrese Haliburton had 14 points and 12 assists. Reserve guard T.J. McConnell scored 14.\n\n\r\n              “We're just not getting enough stops down the stretch,” Haliburton said. “And we're not capitalizing enough offensively and that starts with me.”\n\n\r\n              The Cavs entered the night as the conference's No. 3 seed, just behind the Milwaukee Bucks and ahead of the New York Knicks with a few weeks left in the regular season.\n\n\r\n              The Pacers dropped to the No. 7 seed with the loss, passed by the Philadelphia 76ers who beat the Miami Heat on Monday night.\n\n\r\n              “We did some good things to fight out of the hole,” Pacers coach Rick Carlisle said. “But consistency wasn't there. It's a tough loss.”\n\n\r\n              The Pacers led by as much as 15 midway through the second quarter but then went scoreless for about four minutes.\n\n\r\n              “I honestly think we just didn't really make any shots,” McConnell said. “We got a couple of good looks and they just didn't go in.”\n\n\r\n              The Cavaliers surged with an 11-0 run to tie the game in the final minute of the first half.\n\n\r\n              “We've got to stay positive,” Carlisle said. “We've got to be more hungry than everybody we're playing right now.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Miami Heat on Wednesday.\n\n\r\n              Pacers: Visit Detroit Pistons on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996723.931315
}