{
  "game_id": "0022400336",
  "espn_id": "401704902",
  "date": "Dec 06, 2024",
  "matchup": "CHI vs. IND",
  "headline": "Haliburton scores 23 points as the Pacers beat the Bulls 132-123",
  "body": "CHICAGO -- — Tyrese Haliburton had 23 points and eight assists, and the Indiana Pacers stopped a four-game slide with a 132-123 victory over the Chicago Bulls on Friday night.\n\n\r\n              Pascal Siakam scored 21 points for Indiana, and Bennedict Mathurin finished with 19. The Pacers shot 56.5% from the field and had six players score in double figures.\n\n\r\n              Indiana led by 13 at halftime, but Chicago closed to 112-109 on Josh Giddey's layup with 6:53 remaining. Haliburton responded with a 3-pointer, sparking an 8-0 run for the Pacers.\n\n\r\n              Haliburton made five 3s as Indiana went 18 for 29 from long range.\n\n\r\n              Zach LaVine scored 32 points for Chicago, which had won two in a row. Coby White had 19 points and nine assists, and Ayo Dosunmu added 15 points.\n\n\r\n              Takeaways\r\n              Pacers: Siakam and Myles Turner each went 3 for 5 from beyond the arc. The Pacers shot a season-high 62.1% from 3.\n\n\r\n              Bulls: Led by LaVine, Chicago also had a solid night from long range. It just wasn’t as efficient as Indiana. The Bulls shot 21 for 50 from 3.\n\n\r\n              Key moment\r\n              The Pacers shot a blistering 11 of 13 from the field to begin the second quarter, turning a five-point deficit into a 12-point advantage. The 24-9 run by Indiana flipped the game in a quarter that the Pacers eventually won by 17.\n\n\r\n              Key stat\r\n              Indiana outscored Chicago 56-42 in points in the paint.\n\n\r\n              Up next\r\n              The Pacers host the Charlotte Hornets on Sunday. The Bulls continue their three-game homestand when they host the Philadelphia 76ers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997091.085771
}