{
  "game_id": "0022200299",
  "espn_id": "401468454",
  "date": "Nov 28, 2022",
  "matchup": "ATL @ PHI",
  "headline": "Embiid returns from injury, powers 76ers past Hawks 104-101",
  "body": "PHILADELPHIA -- — Joel Embiid won one for the 76ers in 60 seconds.\n\n\r\n              Embiid scored seven of his 30 points in the final minute, including go-ahead 14-footer with 18.6 seconds left, and led Philadelphia past the Atlanta Hawks 104-101 in his return from a sprained left foot on Monday night.\n\n\r\n              “You want to be able to make the last plays so your team wins,” Embiid said.\n\n\r\n              He made them all at the end.\n\n\r\n              Embiid showed why he is so valuable to the Sixers when he twisted inside for a bucket with 56 seconds remaining that pulled the Sixers within 100-99. The Sixers forced a shot clock violation with 31 seconds left and that's when their All-Star center went to work for his biggest plays of the night.\n\n\r\n              The Hawks still had a chance after Embiid's big shot put Philly ahead 101-100. Embiid busted up Trae Young's lob pass in the paint to cut off a potential go-ahead score. Embiid then made three of four free throws in the last few seconds as the crowd roared “MVP! MVP!” for Philly's favorite player.\n\n\r\n              “Whenever I was needed, that's when I felt like I needed to turn it on,” Embiid said.\n\n\r\n              Tobias Harris scored 24 points and Shake Milton had 21 for the Sixers.\n\n\r\n              Young and De'Andre Hunter led the Hawks with 18 points apiece.\n\n\r\n              Embiid missed the last four games with his foot injury and the Sixers didn’t miss a step. They went 3-1 over that span with James Harden and Tyrese Maxey also still out with foot injuries while players such as Milton and Paul Reed lifted them in big moments. That wasn't lost on Embiid.\n\n\r\n              “I came in with the mindset to get my teammates involved,” Embiid said. “Everyone had played so well, I just wanted to keep that going.”\n\n\r\n              The 76ers clearly need their big man. The 76ers can only hope they wins will keep coming with Harden and Maxey soon due to return.\n\n\r\n              “Can we play the same way when everybody’s back? That will be the key for us,” 76ers coach Doc Rivers said.\n\n\r\n              Embiid went 9 of 18 from the floor, sank 12 of 13 free throws and had eight rebounds and seven assists in 35 minutes.\n\n\r\n              “His ability to take over games, especially in the fourth quarter, has been huge for us,” Harris said. “We'd have loved to have him back earlier. It was good to have him back tonight.”\n\n\r\n              The reigning NBA scoring champion, Embiid needed some time to warm up. He missed his first four shots before sinking one in the second quarter but still finished with 14 points at the break.\n\n\r\n              The Sixers, winners at Orlando a night earlier, kept feeding Embiid and he got his groove back. He converted a three-point play in the third that tied the game at 75-all and brought the Sixers back from 16 down. Georges Niang and AJ Griffin swapped 3s that made it 80-80.\n\n\r\n              “Someone’s going to win this ugly game,” Rivers said he thought on the sideline. “Let it be us.”\n\n\r\n              It was the Sixers, in part because of the contributions again from players making the most of their opportunities of late.\n\n\r\n              Milton’s playing time expanded as the Sixers became riddled with injuries. He entered this season averaging 9.7 points and then scored at least 22 in four of the last five games. He shook off a 3-of-10 start in the first half to go 5 of 8 for 11 points in the third. Milton and Harris knocked down key shots that pecked at the Hawks' double-digit lead.\n\n\r\n              “They made timely baskets,” Hawks coach Nate McMillan said. “We were making a run or we were able to get a lead, they made timely baskets to keep it close.”\n\n\r\n              INJURIES\n\n\r\n              Hawks: Jalen Johnson (right ankle soreness) and Bogdan Bogdanovic (right knee injury recovery) missed the game.\n\n\r\n              TURNOVER BATTLE\n\n\r\n              Young's late turnover was one of 20 by the Hawks that led to 19 Sixers points. The Hawks had seven turnovers in the fourth quarter, three by Dejounte Murray. \n\n\r\n              “That's where the execution comes in,” McMillan said. “We had a couple of costly turnovers late in the game.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Play Wednesday at Orlando.\n\n\r\n              76ers: Play Wednesday at Cleveland.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995205.1316009
}