{
  "game_id": "0021500141",
  "espn_id": "400828028",
  "date": "Nov 14, 2015",
  "matchup": "MIL vs. CLE",
  "headline": "Bucks outlast Cavs in 2OT as LeBron James held in check late",
  "body": "MILWAUKEE -- Jerryd Bayless had an unenviable assignment: Guard LeBron James in the final minutes of double overtime.\nDespite giving up 5 inches and 50 pounds, Bayless was up for the challenge. He held James scoreless over the final 3:15 of the second overtime and the Bucks beat Cleveland 108-105, snapping the Cavaliers' eight-game winning streak.\n\"As great as he is, I'm going to try to make it as tough as possible for him,\" Bayless said of guarding James. \"That was my mentality going into it.\"\nBayless scored 17 points in a game with a controversial inadvertent whistle by referee Marc Davis at the end of the first overtime.\nJames scored 37 points for Cleveland, which lost for the first time since dropping a 97-95 decision at Chicago in the season opener on Oct. 27.\nMichael Carter-Williams scored 17 points for Milwaukee while Giannis Antetokounmpo had 16 points and 11 rebounds in 45 minutes before fouling out with 3:15 left in the second overtime. Greg Monroe scored 16 points and had 17 rebounds for the Bucks.\nBayless drew the assignment of guarding James after Antetokounmpo fouled out.\nJ.R. Smith hit a 3-pointer with 27 seconds left to pull Cleveland within 108-105.\nBayless missed a running one-hander with 5 seconds to go, but Monroe grabbed the offensive rebound with 3 seconds left to seal the victory for Milwaukee.\nThe controversy occurred with 7.4 seconds left in the first overtime with the score tied. James blocked a shot by Bayless with 10 seconds left, and described himself as \"full of steam\" to push the ball up court. Marc Davis thought he heard the Cleveland bench call timeout and blew the whistle, forcing the Cavaliers to call timeout to set up a final play.\nJames' 3-point attempt missed at the buzzer to send the game into a second overtime.\n\"We expected they would probably relax a little bit, so we had decided to push it, and we didn't get that chance, unfortunately,\" Cleveland coach David Blatt said. \"Look, we all make mistakes, but that's a bad mistake.\"\nDavis said he heard the Cleveland bench call for a timeout.\n\"I was in my action refereeing the play and off to the side I heard Cleveland's bench ask for a timeout,\" he said. \"I granted them the timeout, at which I looked at the head coach, David Blatt, and realized that he hadn't asked for the timeout.\"\nMo Williams, starting in place of Cleveland's injured Kyrie Irving, was held to four points despite coming into the game averaging 16.9.\nTURNOVER TROUBLE\nJames had seven of Cleveland's 20 turnovers, which led to 27 Milwaukee points. The Cavaliers had 21 assists. \"We've got to do a better job of taking care of the ball, including myself,\" James said. \"It was almost a one-to-one ratio of assists to turnovers, and that's not good for our team.\"\nIMPROVEMENT NEEDED\nJames said the Cavaliers were playing well, but needed to improve to be great despite the 8-2 start. \"We have to play a more sustainable effort throughout 48 minutes,\" he said. \"And, we don't do that. We ... expect we can make a run at the end. We're not good enough to do that.\"\nLOVELY MILESTONE\nCleveland's Kevin Love had 24 points and 14 rebounds for his 300th career double-double in just 449 NBA games.\nTIP-INS:\nCavaliers: Jefferson was questionable before the game with a right ankle injury, but scored 14 points in 39 minutes. He scored eight points in less than 1 minute early in the fourth quarter to get Cleveland back in the game.\nBucks: La Marsellaise, the national anthem of France, was played before the game in remembrance of those killed and injured in the Paris attacks. ... Parker picked up two fouls in the first 1:53 of the game.\nUP NEXT:\nCavaliers: Wrap up three-game trip at Detroit on Tuesday.\nBucks: Visit Washington on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994102.130188
}