{
  "game_id": "0021800064",
  "espn_id": "401070745",
  "date": "Oct 25, 2018",
  "matchup": "POR @ ORL",
  "headline": "Lillard scores 41 to lead Portland to 128-114 win over Magic",
  "body": "ORLANDO, Fla. --  Damian Lillard struggled in the first half then was back in All-Star form after halftime.\n\nLillard scored 34 of his 41 points in the second half, and the Portland Trail Blazers beat the Orlando Magic 128-114 on Thursday night.\n\nCJ McCollum had 22 for the Trail Blazers and Jusuf Nurkic added 18 points and 10 rebounds.\n\nLillard was just 2 for 8 in the first half, then hit 11 of 15 shots in the final two quarters, going 5 of 8 from 3-point territory. He sat out the first four minutes of the final quarter and watched a 13-point lead shrink to just 102-99.\n\n\"It's not really about filling up the stat sheet,\" Lillard said. \"There are opportunities to do it but I think it is more about impacting the game. Even when I am not making shots, I focus on how can I still impact the game.\"\n\nLillard and McCollum then re-entered with 7:54 left after Orlando cut a 13-point deficit to just 102-99 on Gordon's second 3-pointer of the quarter. The guards combined to score 22 of Portland's final 26 points to seal the win.\n\nNikola Vucevic led Orlando with 24 points and 11 rebounds. Terrence Ross had 21 points off the bench and Aaron Gordon and Evan Fournier had 17 apiece. The Magic shot 50 percent from the field and made 12 3-pointers, but never could find a way to stop Portland.\n\n\"If you look at the offensive numbers, you ought to win this game,\" Magic coach Steve Clifford said. \"But the biggest thing tonight was our defense. It started with the first five minutes when we made mistake after mistake. We just weren't good.\"\n\nLillard had 19 points in the third quarter, including 11 of the Blazers' last 13. Magic guards D.J. Augustin and Jerian Grant chased him around the perimeter and into the lane, but never could catch him. He had three 3-pointers and five driving layups, before taking a break to start the fourth quarter.\n\nHowever, Portland couldn't shake the Magic, who trailed 91-80 going to the fourth period. But after Orlando cut it to three, Lillard and McCollum combined for eight straight points and Portland was back in front 110-99.\n\nBackup center Zach Collins had 13 points in nine minutes to help the Blazers to a 58-48 halftime lead. He helped the Blazers overcome a slow start by Lillard (2 for 8) and McCollum (foul trouble).\n\nRoss kept the Magic within striking distance with 12 points on 5-for-7 shooting. The Magic kept pace offensively, but were a step slow at the defensive end and Portland beat them to the basket repeatedly.\n\nTIP-INS\n\nTRAIL BLAZERS: Lillard's 41 points were the most ever scored by a Portland player against Orlando. . Collins hit all five field goal attempts in the first half, including a pair of 3-pointers.\n\nMAGIC: Orlando never led in the game after never trailing in the last game, a 93-90 win over Boston. . Vucevic has scored 25 or more points in five of his last seven games against Portland.\n\nPACE OF PLAY\n\nThe NBA season is only a week old, but Portland coach Terry Stotts and Clifford have noticed the same thing.\n\n\"Right now the pace of games is off the charts,\" Stotts said.\n\n\"Teams are definitely playing faster,\" Clifford added.\n\nThe scoring average for the NBA is up seven points from last season -- 113.4 so far from 106.3. Neither coach was sure how long it would last.\n\n\"It's hard to gauge after four or five games, but guys are pushing the ball up the floor,\" Clifford said. \"I think all of us coaches are interested in seeing what's going to happen 15-20 games in.\"\n\nSaid Stotts: \"It's hard to say it's a trend after one week, but it is a reality right now. I think it's fun. I like offensive basketball, but check back with me in January.\"\n\nUP NEXT\n\nTrail Blazers: Visits Miami on Saturday.\n\nMagic: Visits Milwaukee on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995210.477024
}