{
  "game_id": "0021900431",
  "espn_id": "401161073",
  "date": "Dec 21, 2019",
  "matchup": "BKN vs. ATL",
  "headline": "Nets overcome Trae Young's 47 points, beat Hawks 122-112",
  "body": "NEW YORK --  Spencer Dinwiddie carried the Brooklyn Nets to their largest comeback victory of the season.\n\nBefore the game, Dinwiddie spoke with NBA legend Kobe Bryant, who he grew up idolizing. According to Dinwiddie, Bryant told him he's \"playing like an All-Star.\"\n\nDinwiddie played like one on Saturday night, scoring 39 points as the Nets overcame a 47-point performance by Trae Young and beat the Atlanta Hawks 122-112.\n\nGarrett Temple added 25 points, and DeAndre Jordan had 12 points and a season-high 20 rebounds for Brooklyn.\n\nTemple praised Jordan for being Brooklyn's most consistent bench player, so far.\n\n\"You know what you're going to get out of D, a veteran guy that can really protect the rim, put pressure on the basket on the offensive end and get every rebound that comes off the rim,\" Temple said. \"We need his veteran presence.\"\n\nAlex Len had 23 points and 14 rebounds for Atlanta, which lost its seventh straight game.\n\n\"Frustrating,\" Hawks coach Lloyd Pierce said. \"I thought our guys gave all that they had to put us in a position to win the game. The offense really let us down tonight -- 39 points in the second half. We go 2 for 24 from 3 in the second half. I think you saw some glimpses of a young team lose their will, lose their confidence in a game where we had the will, we had the pace and control of the game.\"\n\nWith Atlanta trailing 113-110, Kevin Huerter lost the ball and Joe Harris drove for a layup and converted a free throw. Dinwiddie iced the game with a layup to give Brooklyn a 118-110 lead with 1:13 remaining.\n\nAtlanta took an 18-point lead, its largest lead of the game, as Young hit a floater in the lane with 7:16 remaining in the third quarter, but couldn't protect it. The Nets went on a 14-0 run to begin the fourth quarter and took a 99-98 lead as the Hawks missed their first nine shots.\n\n\"We had, I think, a 13-point lead headed into the fourth quarter,\" Young said. \"We just let one get away from us. They went on a run, and we couldn't stop it. So yeah, we definitely felt like we let one get away.\"\n\nThe Hawks took a 73-60 lead into the locker room at halftime as Young led all scorers with 24 points. Young's pick-and-roll partner, Len, had a double-double in the half with 16 points and 10 rebounds. Dinwiddie scored 20, a career-high for first-half points, to keep Brooklyn within striking distance.\n\n\"There wasn't much said at halftime,\" Temple said. \"We knew we weren't playing with any energy in the first half. They were outrebounding us, doing everything better than us.\"\n\nTIP-INS\n\nHawks: Pierce said Kevin Huerter's second season has been \"up and down\" due to battling injuries. . Vince Carter moved past John Stockton for fourth place in all-time NBA games played. ... John Collins (suspension) completed his 25-game suspension and will return Monday. ... Evan Turner (hamstring) was out.\n\nNets: Coach Kenny Atkinson addressed the loss of David Nwaba (Achilles) for the season. \"We're going to miss his defense and athleticism,\" Atkinson said. \"He was shooting 42% from 3, too. He was really playing at a high level.\" . Atkinson said the biggest reason for growth in Spencer Dinwiddie's game is his confidence. \"When we first got him, he was a very unsure player,\" Atkinson said. . Kyrie Irving (shoulder impingement) still hasn't been cleared for contact.\n\nNBA LEGEND ON HAND\n\nKobe Bryant, the NBA's No. 3 all-time leading scorer, was courtside.\n\nUP NEXT\n\nHawks: Visit Cleveland on Monday night.\n\nNets: Host New York on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996718.794924
}