{
  "game_id": "0021600565",
  "espn_id": "400899986",
  "date": "Jan 08, 2017",
  "matchup": "PHX vs. CLE",
  "headline": "LeBron James, Cavaliers hold off Suns 120-116",
  "body": "PHOENIX -- The Phoenix Suns, with one of the worst records in the West, threatened to make it an embarrassing night for the Cleveland Cavaliers.\nUntil LeBron James set things straight.\nJames scored 12 of his 28 points in the fourth quarter and the Cavs fought off Phoenix down the stretch for a 120-116 victory Sunday night.\n\"I am just confident in my ability,\" James said. \"I work on my craft. I work on my shooting every day so it is always an option I could go to. I just try to mix it up, playing interior, playing transition, playing on the exterior and I was able to knock a couple of them down.\"\nKyrie Irving added 27 points and Kevin Love 25 for the Cavaliers. They led by as many as 22 in the first half and 20 early in the third quarter.\n\"We play well, you play hard and get the lead and playing the right way then we just messed around,\" Cleveland coach Tyronn Lue said.\nThe Suns tied it late in the third and got within one in the fourth but never took the lead.\n\"We made enough plays down the stretch to win,\" James said. \"We played good ball except for the third quarter. We allowed them to get out in transition and them being young and athletic they took advantage of it.\"\nEric Bledsoe scored 31 points and Devin Booker had 28 for the Suns.\nJames sank consecutive 3-pointers, his only 3s of the game, to give Cleveland a 115-109 lead with 2:46 to play and scored on a driving layup with 44 seconds left to make it 120-114.\n\"That what makes him one of the greatest,\" Booker said. \"We knew down the stretch he wants the ball in his hands and he wants to make the play and he did that. He hit two tough shots, 3s in transition.\"\nThe young Suns turned aggressive and got their running game going to outscore Cleveland 25-7 in one stretch of the third quarter. Tyson Chandler's inside basket cut the Cav' lead to 84-82 with 3:31 left in the period.\nPhoenix tied it twice before the quarter ended, the last at 90 when Booker banked in an 8-footer with 11.2 seconds left, but Irving sank a 3 at the buzzer and Cleveland led entering the fourth 93-90.\nThe Sun got within one three times early in the final quarter, the last at 98-97 on Booker's left-handed drive with 9:37 left. After Phoenix rookie Dragan Bender missed a 3, Irving sank one, then added an acrobatic driving layup to put the Cavaliers up 104-98 with 7:38 left.\nThe Suns still were down only 109-107 after Marquese Chriss made one of two free throws with 4:28 to play but James sank his first three to boost it to 112-107. Bledsoe's layup cut it to 112-109, and James sank his second 3 to make it a six-point game. Phoenix never got closer than four after that.\n\"I'm mad we lost but at the same time this is one of those games that was I guess a good loss,\" Bledsoe said. \"We competed with one of the top teams in the league. To be down like that and come back says a lot. We've just got to start playing like this night in and night out.\"\nNOT YET\nKyle Korver, acquired in a trade with the Atlanta Hawks, joined his new Cleveland teammates Sunday afternoon but couldn't play because physicals and paperwork still had to be completed to finalize the deal that sent Mike Dunleavy, Mo Williams a protected first-round pick and cash considerations to the Hawks.\nKorver could make his Cleveland debut Tuesday night at Utah.\nTIP-INS\nCavaliers: James became the 14th player in NBA history to reach 10,000 career field goals. ... Cleveland has beaten the Suns four times in a row.\nSuns: The 69 points matched the most allowed by Phoenix in the first half this season. ... Phoenix had won two in a row. The Suns have not won three in a row all season. ... Phoenix is 8-5 against the Eastern Conference. ... Olympic swim champion Michael Phelps sat next to Suns owner Robert Sarver at courtside.\nUP NEXT\nCavaliers: Cleveland makes the third stop on its six-game road trip when they face the Jazz on Tuesday.\nSuns: The Suns don't play again until Thursday night when they face Dallas in Mexico City.",
  "source": "espn_api",
  "crawled_at": 1764995975.066903
}