{
  "game_id": "0022300442",
  "espn_id": "401585070",
  "date": "Dec 30, 2023",
  "matchup": "CHI vs. PHI",
  "headline": "Bulls take advantage of NBA MVP Joel Embiid's absence to beat 76ers, 105-92",
  "body": "CHICAGO -- — DeMar DeRozan scored 24 points, Coby White added 20 and the Chicago Bulls took advantage of NBA MVP Joel Embiid’s absence to beat the Philadelphia 76ers 105-92 on Saturday night in the opener of a home-and-home set.\n\n\r\n              Sidelined by a sprained right ankle, Embiid could return when the teams meet again Tuesday night in Philadelphia.\n\n\r\n              Andre Drummond had 15 points and 23 rebounds for the Bulls, They’ve won five of seven and have taken both meetings with Philadelphia.\n\n\r\n              Tyrese Maxey had 20 points and seven assists for the 76ers. Tobias Harris added 15 points.\n\n\r\n              Chicago never trailed in the second half and gave itself some breathing room midway through the final quarter with a 13-2 run that turned a five-point game into a 95-79 lead. DeRozan scored five points during the spurt.\n\n\r\n              “The season didn’t start how we wanted it to start,” White said after the Bulls turned in a 9-5 December to come close to evening out a 4-14 start. “Everybody’s ready to contribute when the opportunity presents itself.”\n\n\r\n              Drummond, seeing increased playing time with starting center Nikola Vucevic out with a groin injury, helped the Bulls outrebound Philadelphia 53-36.\n\n\r\n              “It’s a difficult road trip without Joel the whole way,” 76ers coach Nick Nurse said after his team finished a four-game trip without the MVP. “We’re glad we got out of it 2-2.”\n\n\r\n              The Bulls closed the first half on an 11-2 run to lead 56-48.\n\n\r\n              “We weren’t that great in the first quarter with six turnovers,” Bulls coach Billy Donovan said. “But as the game went on, we got better.”\n\n\r\n              Chicago finished with 16 giveaways.\n\n\r\n              Vucevic missed his third straight game. Coach Billy Donovan said he doubted the former All-Star would be ready to return Tuesday.\n\n\r\n              Chicago star Zach LaVine has missed 15 straight games because of inflammation in his right foot. Donovan said LaVine could resume practicing as early as next week.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995902.0411258
}