{
  "game_id": "0022300578",
  "espn_id": "401585206",
  "date": "Jan 17, 2024",
  "matchup": "BKN @ POR",
  "headline": "Simons hits winner with 0.2 seconds on the clock as Trail Blazers beat Nets 105-103",
  "body": "PORTLAND, Ore. -- — Anfernee Simons started feeling better just in time. \n\n\r\n              Simons hit a winning floater with 0.2 seconds left and the Portland Trail Blazers snapped a four-game losing streak with a 105-103 victory over the Brooklyn Nets on Wednesday night. \n\n\r\n              Questionable going into the game because of an illness, Simons finished with 20 points. Jerami Grant led the Blazers with 30 points and eight rebounds. \n\n\r\n              “I’m glad I was able to get it going at the right time and come up with a win,” Simons said. \n\n\r\n              Mikal Bridges scored 21 for the Nets but had to leave the game for a time in the second half after a collision. Spencer Dinwiddie added 19 points for Brooklyn, which lost its fourth straight.\n\n\r\n              Portland trailed by 11 but pulled in front 88-87 midway through fourth quarter on Grant's 3-pointer. \n\n\r\n              It was close the rest of the way. Dinwiddie made a pair of foul shots with 1:48 left that gave the Nets a 101-97 lead. But then Simons hit a floater that tied it at 101 before Grant's tip-in with 9.1 seconds to go gave Portland a 103-101 edge. \n\n\r\n              Cam Johnson's layup tied the game again, and the Blazers called a timeout with 5.2 seconds left before Simons' game-winner. \n\n\r\n              Portland coach Chauncey Billups said the plan was to get the ball into Simons' hands at the end. \n\n\r\n              “It was a perfectly executed play,\" Billups said. “The guys executed it just beautifully, they really did.”\n\n\r\n              Blazers center Deandre Ayton, who had missed the previous 11 games with right knee tendinitis, was set to make his return but because of icy conditions he was unable to get to the arena in time for the game. \n\n\r\n              Portland also remained without forward Shaedon Sharpe, sidelined for at least the next two weeks because of an abdominal strain. Sharpe was injured Jan. 11 at Oklahoma City. \n\n\r\n              The Nets led 52-51 at halftime, with Bridges leading all scorers with 15 points. \n\n\r\n              Malcolm Brogdon's basket gave the Blazers a 67-60 lead in the third quarter, their biggest of the night. \n\n\r\n              Bridges left the game briefly in the third after colliding with Portland’s Jabari Walker. Bridges limped off the court and was treated on the bench for a time, but after several minutes headed to the locker room.\n\n\r\n              Bridges, who was averaging 21.4 points and 5.4 rebounds per game, returned in the fourth quarter. He is the NBA’s active leader in consecutive games played with 432. He has not missed a game in his first five seasons. \n\n\r\n              The Nets led by 11 late in the third quarter, but the Blazers closed the gap early in the fourth. \n\n\r\n              “It was an accumulation of plays. They were able to get to our rim 36 times, 16 second-chance points. So it's the plays that happened in the first, second, third and fourth quarter,” Nets coach Jacque Vaughn said. \"We were going to double Grant or Simons (in the final moments). Give Simons credit, good move to get to the rim and finish.\" \n\n\r\n              It was the second and final meeting between the teams this season. Portland won the first 134-127 in overtime at Brooklyn earlier this month. \n\n\r\n              There were wide swaths of empty seats as Portland continued to dig out of recent storms that shut down light rail lines, downed trees and iced over roads. \n\n\r\n              UP NEXT\n\n\r\n              Nets: Visit the Los Angeles Lakers on Friday night. \n\n\r\n              Trail Blazers: Host the Indiana Pacers on Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996345.7664351
}