{
  "game_id": "0021901279",
  "espn_id": "401224754",
  "date": "Aug 07, 2020",
  "matchup": "TOR vs. BOS",
  "headline": "Celtics build 40-point lead, roll past Raptors 122-100",
  "body": "LAKE BUENA VISTA, Fla. --  The way the NBA standings look right now, there's a reasonable chance that the Boston Celtics and Toronto Raptors could be slotted to see each other in the Eastern Conference semifinals.\n\nAnd Celtics coach Brad Stevens is already making it clear -- if that happens, a blowout win over the Raptors now won't mean anything then.\n\nJaylen Brown scored 20 points, Jayson Tatum added 18 and the Celtics never trailed on the way to an emphatic 122-100 win over the Raptors on Friday night. Kemba Walker scored 17 points in 23 minutes for the Celtics, who led by 40 at one point and kept slim hope alive of catching the Raptors for the No. 2 spot in the East race.\n\n\"This game will mean nothing if we get that opportunity again,\" Stevens said. \"They're a really good team. I thought they missed a lot of open looks and it just wasn't their night. Our guys played well, but it won't mean anything in a couple weeks.\"\n\nBoston also won the season series against Toronto, taking three of the four meetings. The Celtics also won back-to-back games for the first time in the bubble.\n\n\"We're enjoying each other and building chemistry,\" Tatum said.\n\nFred VanVleet scored 13 for Toronto, which got 11 from Kyle Lowry and 11 more from Pascal Siakam. The Raptors' starters -- VanVleet, Lowry, Siakam, Marc Gasol and OG Anunoby -- combined to shoot 16 for 45 (36%) from the field, 3 for 19 (16%) from 3-point range.\n\n\"One thing about this team, we always bounce back and we always stick together,\" Toronto's Norman Powell said. \"I'm not too worried.\"\n\nToronto's biggest deficit in its first three games in the bubble was six points against the Los Angeles Lakers. The Raptors trailed Miami by three, then didn't trail Orlando at any point in their game on Wednesday.\n\nBut only five minutes into this one, the Raptors were down eight.\n\nAnd it would only get worse from there for the reigning champions.\n\nThe biggest deficit Toronto had faced this season was a 30-point hole against Dallas on Dec. 22, a game where the Raptors rallied to win. The Celtics didn't allow anything close to a rally on Friday -- after the Raptors closed within 10 early in the third, Boston went on a 36-12 run over the final 9:39 of the quarter.\n\nIt was 91-57 entering the fourth, and the Raptors went with subs the rest of the way. Making the night even worse for Toronto: forward Serge Ibaka left early in the fourth after getting hit in the face on a drive by Boston's Gordon Hayward.\n\n\"I hate to say it, but there's nothing really I learned,\" Raptors coach Nick Nurse said. \"The only thing I probably did learn is we've got to get a couple of our guys playing a little better.\"\n\nTIP-INS\n\nCeltics: Boston's final three games before the playoffs -- against Orlando, Memphis and Washington -- come against teams with losing records, and the Wizards will be playing their season finale. ... Boston improved to 3-2 in the bubble.\n\nRaptors: Toronto needs one win in its final four games for a fifth consecutive 50-win season. ... The Raptors missed nine of their first 10 shots on the way to a 12-2 early deficit, setting the tone. ... Raptors Uprising GC, of the NBA's 2K League, completed their regular season Friday with a 16-0 record.\n\nWALKER'S KNEE\n\nWalker gave the Celtics a score about 4-1/2 minutes into the game when he went to the floor and appeared to be dealing with pain in his knee, something he's battled since camp for the season restart began. It didn't take long to show he was fine -- in about a 15-second span shortly afterward, he leaped over a video board on the baseline in an effort to save the ball, blocked a shot at the rim and had a transition assist at the other end.\n\nMCCAW LEAVES\n\nToronto's Patrick McCaw will see a specialist in New York next week to determine a treatment plan for a reoccurrence of a benign mass on the back of his left knee. McCaw saw Dr. Riley Williams at the Hospital for Special Surgery in November for the same issue and will visit him again. McCaw appeared in 37 games this season, averaging 4.6 points.\n\nUP NEXT\n\nCeltics: Face Orlando on Sunday.\n\nRaptors: Face Memphis on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995574.416915
}