{
  "game_id": "0021500077",
  "espn_id": "400827964",
  "date": "Nov 06, 2015",
  "matchup": "LAL @ BKN",
  "headline": "Kobe Bryant scores 18 as Lakers get first win; Nets fall to 0-6",
  "body": "NEW YORK -- The only celebrations Kobe Bryant wants are after victories.\nHe swears he doesn't want a farewell tour, if this does end up being his last season. So while he appreciated the fans chanting his name and lingering afterward to shower him with more applause, the most important thing was that for the first time this season, he walked off the court a winner.\nBryant scored 18 points, his highest performance since opening night, and the Los Angeles Lakers beat the winless Brooklyn Nets 104-98 on Friday night for their first victory.\nIn his 20th NBA season and battling injuries over the last few, Bryant doesn't know if this is the end. But just in case, fans treated him to loud cheers all night, aware they might never seem him on this court again.\n\n\"I have so much appreciation for the game. If this is the last time, I'm fine with that,\" Bryant said. \"I feel at peace with that.\"\nHe felt better about winning, as did coach Byron Scott.\n\"Dinner will taste a whole lot better tonight than it has the last four games,\" Scott said. \"I don't know if it's relief. I just feel good that we came out and did the things that we've been talking about for the past six, eight weeks.\"\nRookie D'Angelo Russell and Jordan Clarkson each scored 16 points for the Lakers (1-4), while the Nets dropped to 0-6.\nThe Lakers' 11-point lead was down to three in the final half-minute but they forced a 5-second violation on an inbounds pass. Bryant then made four straight free throws for a 102-95 lead while receiving booming cheers, as he did all night.\nBrook Lopez had 23 points and 10 rebounds for the Nets, while Joe Johnson scored 22 points.\nThe Nets were in the home whites, but the Lakers sure felt like the home team.\n\"You've got to win your fans over by going out, playing hard, playing well and being successful,\" Nets coach Lionel Hollins said.\nRussell, the No. 2 pick in the draft, had the highest-scoring game of his career but wasn't on the court down the stretch, with Scott turning to veteran point guard Lou Williams to help close it out.\nBryant came in averaging 15.8 points and in a horrendous shooting slump while trying to regain his timing after missing much of the preseason with a leg injury. He still shot poorly, going 5 for 16, but only his 24 points against Minnesota on Oct. 28 were better than this.\nBryant missed his first six shots and started 1 for 8, dropping him to 21 for 70 on the season, an even 30 percent. But he bounced back with 12 points in the second quarter, making his final two shots and walking off at halftime nodding his head with the Lakers leading 52-47.\nBackup Nick Young gave the Lakers just enough of a comfortable cushion, making two 3-pointers and another basket in a fourth-quarter flurry that gave Los Angeles an 11-point lead with 7 minutes to go.\nThe play certainly wasn't stellar but it was definitely spirited, just as Scott predicted from the winless teams before the game.\n\"I think both teams at this particular point should be in that desperate mode. Go out there and you've got to play like this is almost a Game 7,\" Scott said.\nTIP-INS\nLakers: The Lakers began a five-game road trip and a stretch where they play 16 of 20 on the road. At least the next one is an easy trip: They visit the New York Knicks on Sunday and their hotel is close to Madison Square Garden.\nNets: Rookie Rondae Hollis-Jefferson made his first career start and grabbed 11 rebounds. ... The Nets announced they had purchased an NBA Development League affiliate. The Long Island Nets will play next season in Barclays Center before moving to the Nassau Veterans Memorial Coliseum.\nHEY BIG SPENDERS!\nThe NBA's two highest-paid players this season were guarding each other. Bryant is making $25 million and Johnson is just behind him at $24.9 million.\nGIVING PEACE A CHANCE\nThe Lakers gave Metta World Peace his first playing time this season. The New York native signed in September for his second stint with the team he helped lead to the 2010 NBA championship. He had three points and forced a big turnover in the fourth, leading to a basket by Young.\nUP NEXT\nLakers: Visit New York on Sunday.\nNets: Visit Milwaukee on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994325.5623198
}