{
  "game_id": "0021800227",
  "espn_id": "401070908",
  "date": "Nov 17, 2018",
  "matchup": "LAL @ ORL",
  "headline": "Vucevic scores 36, Magic end Lakers' 4-game win streak",
  "body": "ORLANDO, Fla. --  There was a closer on the floor when the Lakers faced the Magic, and it wasn't LeBron James.\n\nNikola Vucevic had 36 points, including eight straight in a crucial stretch of the fourth quarter, and Orlando beat Los Angeles 130-117 on Saturday night, ending the Lakers' four-game winning streak.\n\nJames was on the bench the entire fourth quarter as the Lakers went to a small lineup to trim a 21-point deficit to just 10 with more than four minutes to play. Vucevic snuffed out the rally right there, getting a three-point play against Michael Beasley and following that with five more points to push the advantage back to 13 with just over two minutes to go.\n\n\"We have other guys who could do that, but it is a responsibility I take on myself to finish out games, especially when I have it going,\" Vucevic said. \"I had a good matchup and I wanted to keep it going, that's all.\"\n\nVucevic hit 15 of 23 shots, including 10 of 14 in the second half. He got help from D.J. Augustin, who had 22 points and seven assists, and Evan Fournier, who scored 15. Terrence Ross had 13 points and Aaron Gordon and Jonathon Simmons scored 12 each for the Magic.\n\n\"When teams downsize, they're not going to be able to guard (Vucevic) 1-on-1,\" Magic coach Steve Clifford said. \"He's either going to be able to get good shots like he did tonight, or we're going to be able to play out of double-team, where he is a great passer.\"\n\nThe Lakers got 22 points from James, 19 from Lance Stephenson and 17 from Brandon Ingram, but were down 15 early in the second half and never got closer than 10 in the fourth quarter.\n\n\"I give credit to that group that was out there,\" James said. \"They continued to fight.\"\n\n\"I always appreciate guys not giving up,\" Lakers coach Luke Walton said. \"If you're up or down 20, a NBA game is never over. We gave ourselves a chance and unfortunately they hit some shots that took the lead back up.\"\n\nJames averaged 29.8 points on 55.1 percent shooting during the win streak, but wasn't much of a factor against the Magic.\n\nOrlando opened the second half with back-to-back 3-pointers from Augustin and Fournier and a dunk from Vucevic that pushed the lead to 70-55. The Lakers finally extended their defense, opening easy lanes to the basket, and Augustin and Fournier took advantage.\n\nThe two went unimpeded to the rim, feeding Vucevic, who had 16 points in the quarter, or getting easy layups for themselves. Ten of the next 11 Magic baskets were layups, and Orlando led 100-81 by the end of the third.\n\nTIP-INS\n\nLakers: Lonzo Ball is shooting 51.3 percent (19 of 37) from 3-point range, but just 17.8 percent (five of 28) in road games. ... Three Lakers reserves reached double figures, led by Stephenson's 19 points. Josh Hart had 13 and Kentavious Caldwell-Pope scored 10.\n\nMagic: Jonathon Isaac had four blocks in the first half, including two against James. He finished with five blocks and seven points. ... The Magic and Lakers have split the season series seven years in a row. This was their first meeting this season.\n\nRONDO OUT\n\nRajon Rondo will miss four to five weeks after having surgery to repair a broken bone in his right hand. Rondo started only two games this season and was averaging 8.5 points and 6.5 assists while playing 25 minutes a game. \"Obviously he is missed,\" Walton said. \"You can feel it around the locker room, but our group has been good.\"\n\nCARMELO A LAKER?\n\nJames was asked about the possibility of Carmelo Anthony joining the Lakers roster and said: \"I have no idea, to be honest. That's not a question to ask me. We don't even have a roster spot open right now, so that is not a question for me.\"\n\nUP NEXT\n\nLakers: At Miami on Sunday night.\n\nMagic: Host the New York Knicks on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995032.07809
}