{
  "game_id": "0021800005",
  "espn_id": "401070695",
  "date": "Oct 17, 2018",
  "matchup": "MEM @ IND",
  "headline": "Bogdanovic scores 19 points, Pacers rout Grizzlies 111-83",
  "body": "INDIANAPOLIS --  Indiana Pacers coach Nate McMillan kept asking his team to focus on defense and rebounding during the offseason.\n\nHe witnessed the results of both Wednesday night.\n\nBojan Bogdanovic scored 19 points, Victor Oladipo added 16 and the Pacer blew past the Memphis Grizzlies for a 111-83 victory -- the largest opening-night victory margin in the Pacers' NBA era. The previous mark of 27 was set against the then New Jersey Nets in 1985.\n\n\"I like our effort,\" McMillan said. \"I thought defensively we were really good, only 16 points in the paint. I thought every guy that went out on the floor played hard. The intensity didn't drop off on the defensive end of the floor. I just really liked our effort and our execution, playing the game together.\"\n\nIt showed.\n\nWhile seven Pacers players scored in double figures, Indiana delivered the knockout blows by excelling in the areas McMillan stressed throughout training camp and the preseason.\n\nMemphis shot just 29.8 percent from the field and had only four players in double figures, led by Marc Gasol with 13 points. And Indiana outrebounded the Grizzlies 57-28 including 15 from Domantas Sabonis who also scored 14 points.\n\nThe Pacers wound up with their best rebounding margin in five years -- and that was all it took on a night the Pacers never trailed despite going 10 of 26 on 3-pointers and committing 20 turnovers.\n\nIndiana has won seven of its eight last season openers and eight of its last nine home openers.\n\nThe Pacers figure it's just a start.\n\n\"We've just got to build on it,\" said Oladipo, who was held without a steal for the first time in 64 games. \"It was a great first game, a great first outing, and now we've just got to build on it.\"\n\nClearly, it's not what Grizzlies coach J.B. Bickerstaff envisioned in his debut as a full-time head coach after twice serving on an interim basis, most recently last season in Memphis.\n\n\"We are a much better basketball team than we showed tonight,\" he said. \"We still believe that and we've just got to be better all around.\"\n\nIndiana jumped to a 26-16 lead after one quarter, then used a 14-2 second-quarter run to make it 41-17.\n\nMemphis closed to 56-39 at the half and cut the deficit to 14 twice in the third quarter, but the Pacers fended off the finally charge with 9-3 run to rebuild a 73-53 lead and never let the Grizzlies get closer than 18 the rest of the game.\n\nTIP-INS\n\nGrizzlies: Rookie Jaren Jackson Jr., who grew up in nearby Carmel, Indiana, scored 10 points in his NBA debut. ... Memphis had only seven turnovers. ... Gasol appeared to hurt his right leg during the second quarter but returned before halftime and played throughout the second half before Bickerstaff pulled his starters late in the game..\n\nPacers: Indiana has won three straight over the Grizzlies. ... Doug McDermott had 12 points, Cory Joseph finished with 11 and Thaddeus Young wound up with 10 points and eight rebounds. ... TJ Leaf, Indiana's first-round draft pick in 2017, left late in the first quarter with a sprained left ankle and did not return.\n\nNO LIMITS\n\nAll indications are that Mike Conley's recovery from an injured left heel has gone smoothly.\n\nAfter missing 70 games last season, the Indianapolis high school star returned to his hometown and made his first regular-season appearance since November. He played nearly 29 minutes, scored 11 points and had three assists and one steal.\n\nAnd there's no limitation on Conley's playing time.\n\n\"We'll be mindful of the amount of minutes he's played over his career,\" Bickerstaff said. \"But he hasn't missed a day of camp, he hasn't missed a rep, so he's ready to go.\"\n\nNEW SPOT\n\nTyreke Evans' solid debut with his new team came at the expense of his former team.\n\nHe scored 14 points and had six assists for the Pacers as McMillan tries to determine how best Evans fits in Indiana's rotation.\n\n\"He's trying to see what we want him to do and I'm trying to see how we can use him,\" McMillan said. \"It's going to take some time, but I think he's a guy who has some versatility, who can play the one, two or three and we're certainly going to give him the ball and let him create.\"\n\nUP NEXT:\n\nGrizzlies: Hope to rebound in their home opener against Atlanta on Friday night.\n\nPacers: Make their first road trip this season at Milwaukee on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994150.283128
}