{
  "game_id": "0021901267",
  "espn_id": "401224742",
  "date": "Aug 05, 2020",
  "matchup": "BKN @ BOS",
  "headline": "Brown leads Celtics to 149-115 rout of Nets",
  "body": "LAKE BUENA VISTA, Fla. --  Jaylen Brown scored 21 points, Robert Williams had a career-high 18 points in 19 minutes, and the Boston Celtics rolled past the Brooklyn Nets 149-115 on Wednesday night without All-Star point guard Kemba Walker.\n\nWilliams was 7 of 7 from the field and 4 of 4 from the free throw line. He hadn't played in Boston's first three games of the restart, but didn't let himself get discouraged.\n\n\"It's really just the will to want to play,\" said Williams, the 27th overall pick in the 2018 draft. \"I want to bring the right energy. I think a lot of the young guys brought great energy. That is my job.\"\n\nWilliams said he gained confidence when teammates encouraged him to keep shooting.\n\nStill, Williams said, he needs to work on his conditioning.\n\n\"I should have been contesting more shots,\" he said.\n\nCeltics coach Brad Stevens said it probably wasn't fair to play Williams as much as he did, but was impressed with what he saw.\n\nStevens said he didn't tell Williams he was going to play \"until he was walking on the bus.\" That's when he told the forward he would be checking into the game early on against the Nets.\n\nBrown hit five 3-pointers after averaging 23.3 points his previous three games in Orlando. He finished 7 of 13 from the field.\n\nJayson Tatum added 19 points and Gordon Hayward scored 18 for the Celtics, who posted a season high in points and improved to 2-2 at Disney World.\n\nBoston shot 20 of 39 from 3-point range.\n\nThe Celtics bolted to a fast start, scoring 71 points in the first half on 8-of-17 shooting from 3-point range and never let up. They led by as many as 21 before the break while Walker rested his sore knee.\n\nJeremiah Martin scored 20 points and Joe Harris had 14 for the Nets.\n\nCaris LeVert was held to 13 points, after scoring a career-high 51 in an overtime victory over the Celtics in March just before the suspension of the season because of the coronavirus pandemic.\n\nBut the Nets, a day after knocking off NBA-leading Milwaukee, were never competitive in this one.\n\nHarris said the Nets didn't play the \"right way.\"\n\nHe pointed toward too many turnovers, a lack of defense and not enough ball movement.\n\n\"Against a team that is more talented you are going to end up losing the way we did,\" Harris said. \"... It's the ebbs and flow of the NBA and you have to take the good with the bad.\"\n\nThe third-place Celtics (45-23) are 4 1/2 games behind second-seeded Toronto and two games ahead of Miami. The Nets (32-36) remain in seventh place in the East and will have to wait for another day to clinch a playoff spot.\n\nTIP-INS\n\nNets: Shot 8 of 32 from 3-point range.\n\nCeltics: All 14 Celtics that played scored.\n\nBRING THE D\n\nStevens praised the defensive effort of Romeo Langford.\n\n\"He's a good worker and one of our more solid defenders and that will give him a chance to play, especially with the way we played the first couple of weeks,\" Stevens said.\n\nUP NEXT\n\nNets: Play Kings on Friday.\n\nCeltics: Play Raptors on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996698.661643
}