{
  "game_id": "0022400780",
  "espn_id": "401705346",
  "date": "Feb 12, 2025",
  "matchup": "POR @ DEN",
  "headline": "Jamal Murray scores career-high 55 points, Nuggets beat Trail Blazers 132-121 for 8th straight win",
  "body": "DENVER -- — Jamal Murray scored a career-high 55 points, Nikola Jokic had his 25th triple-double of the season and the Denver Nuggets beat the Portland Trail Blazers 132-121 on Wednesday night for their eighth straight victory.\n\n\r\n              Murray was 20 of 36 from the floor, including seven 3-pointers. It’s the third-most points in the franchise’s NBA history, trailing only David Thompson’s 73-point game on April 9, 1978, and Jokic’s 56-point effort Dec. 7. In the ABA, Spencer Haywood had a 59-point game for the then-Rockets on April 15, 1970.\n\n\r\n              Jokic had with 26 points, 15 rebounds and 10 assists on a night when the team celebrated Serbian Heritage Night and handed out his bobblehead.\n\n\r\n              Denver led by 23 points, only to see Portland cut it to single digits late in the second game between the teams in Denver in three nights. The Nuggets won 146-117 on Monday.\n\n\r\n              Anfernee Simons led Portland with 26 points, and Donovan Clingan had 17 points and 20 rebounds. The Trail Blazers were without Deandre Ayton (strained calf), Scoot Henderson (sprained ankle) and Jerami Grant (sore knee). \n\n\r\n              Takeaways\r\n              Trail Blazers: Ayton's left calf strain will be re-evaluated in a month. \n\n\r\n              Nuggets: The Nuggets were missing Michael Porter Jr. (hamstring), Aaron Gordon (calf), Peyton Watson (knee) and Russell Westbrook (hamstring). \n\n\r\n              Key moment\r\n              Murray missed a free throw with less than a second remaining until halftime, but Jokic was able to crash the boards and tap it in for a 75-56 lead.\n\n\r\n              Key stat\r\n              Denver had seven blocked shots, including four by Zeke Nnaji.\n\n\r\n              Up next\r\n              After the All-Star break, both teams play Feb. 20. The Nuggets host Charlotte, and the Trail Blazers host the Los Angeles Lakers. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998169.7102668
}