{
  "game_id": "0022200576",
  "espn_id": "401468731",
  "date": "Jan 05, 2023",
  "matchup": "MEM @ ORL",
  "headline": "Morant, Jackson lead Grizzlies over Magic for 5th straight",
  "body": "ORLANDO, Fla. -- — Ja Morant scored 32 points, Jaren Jackson Jr. added 31 points and 10 rebounds and the Memphis Grizzlies beat the Orlando Magic 123-115 on Thursday night for their fifth straight win.\n\n\r\n              Ziaire Williams came off the Memphis bench with 6-of-7 shooting and 16 points.\n\n\r\n              Paolo Banchero had 30 points and nine rebounds for Orlando. Franz Wagner added 22 points, 19 in a desperate fourth-quarter comeback attempt.\n\n\r\n              Jackson had 13 points and five rebounds in the Grizzlies' 43-point second quarter that ended with Memphis leading 65-43. The Magic rallied twice late in the game, but never had an answer for Jackson's inside power game.\n\n\r\n              “He set a tone in that first quarter for us, blocked (three) shots,” Memphis coach Taylor Jenkins said. “Overall, you felt his force tonight, his physicality on both sides. It’s definitely one of his most impressive (games), if not the most, so far for J.J.”\n\n\r\n              Jackson made 12 of 14 shots, going 2 for 3 on 3s in his season-high scoring effort.\n\n\r\n              “He’s a one-of-a-kind talent,” said Grizzlies forward Dillon Brooks, who had 11 points, six rebounds and six assists. “He’s one of our guys who’s a mismatch nightmare, so we need him to be aggressive every night on both ends.”\n\n\r\n              Banchero scored Orlando's first 10 points of the second half, but Morant answered with 11 straight for the Grizzlies, giving them a 25-point lead midway through the third quarter. \n\n\r\n              Banchero made three free throws to bring the Magic back within 12 late in the third, but Morant closed the period with a short jumper, and the Grizzlies regained a 21-point lead with three 3-pointers (two by Williams) early in the fourth. \n\n\r\n              Orlando rallied behind Wagner in the fourth quarter and cut the Grizzlies' lead to six on Caleb Houstan's 3-pointer with 1:53 remaining. But Morant drew a sixth foul on Magic center Wendell Carter Jr., and scored Memphis' final three points from the foul line.\n\n\r\n              “Obviously we got a little casual there with some of our late turnovers,” Jenkins said. “Credit them, they came out in a full-court press that sort of threw us off. Then when we got organized, we came up with some big-time plays.”\n\n\r\n              The late charges didn't surprise Banchero, the NBA's leading rookie scorer at 21.3 points per game.\n\n\r\n              “We feel like we can play with anybody,” he said. \"In the first half a lot of good looks weren’t going down, and that allowed them to build a lead at halftime of 20-plus.\n\n\r\n              “You've got to step in with confidence and make shots. That was kind of our message to each other at halftime. They were giving us these looks, and we had to step in and knock 'em down. We came up a little short, but we were definitely better in the second half.”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: With the win, Memphis moved the top of the Western Conference at 25-13. . . . G Desmond Bane did not play in the second game of a back-to-back as part of his management of a toe injury. ... F Brandon Clarke missed a third game with a sore left hip. . . . The Grizzlies are scoring 121.4 points per game on their five-game win streak and winning by an average of 14 points.\n\n\r\n              Magic: Carter had 18 points and seven rebounds before fouling out with 1:21 left. ... Banchero had a 20-point third quarter. ... G Jalen Suggs played five minutes in his first game since Nov. 25 due to a sore right ankle. ... F Bol Bol, who missed a second game in the NBA's health and safety protocols, is expected to rejoin the Magic during their upcoming road trip.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Utah on Sunday.\n\n\r\n              Magic: At Golden State on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994204.249675
}