{
  "game_id": "0022300783",
  "espn_id": "401585411",
  "date": "Feb 14, 2024",
  "matchup": "HOU @ MEM",
  "headline": "GG Jackson has 20, Jaren Jackson adds 18 as Grizzlies snap skid with 121-113 win over Rockets.",
  "body": "MEMPHIS, Tenn. -- — GG Jackson scored 20 points, Jaren Jackson Jr. had 18, including 11 in the fourth quarter, and the Memphis Grizzlies ended their nine-game losing streak with a 121-113 victory over the Houston Rockets on Wednesday night.\n\n\r\n              Luke Kennard finished with 19 points, including a pair of free throws in the closing minute as the Rockets tried to overtake Memphis down the stretch. Lamar Stevens, picked up in a trade deadline swap with the Celtics, scored 14 points. Vince Williams added 12 points, eight rebounds and seven assists.\n\n\r\n              “It definitely feels good,” GG Jackson said of ending the losing streak. “NBA players or any athlete hates to lose.\"\n\n\r\n              Dillon Brooks, Alperen Sengun, Amen Thompson and Aaron Holiday all scored 19 points in Houston’s fifth loss in the last six games. The loss was the last game for Houston before the All-Star break, and at times it showed.\n\n\r\n              “It's been that way for a while now,\" Rockets coach Ime Udoka said. ”Maybe we underestimated the competition, but we came out like the softest team in the league.\"\n\n\r\n              The lack of energy was a common theme between Brooks and Udoka. The Houston coach said he plans to look at his starting lineup and rotations during the break. \n\n\r\n              “We played down to our competition,” said Brooks, who spent his first six seasons with the Grizzlies. “That will sit with you throughout the break.”\n\n\r\n              The Rockets cut the Memphis lead to 84-81 after the third. The Rockets would grab their first lead of the game at 88-87 when Thompson split a pair of free throws with 10:07 remaining.\n\n\r\n              Memphis answered with a 17-5 run to go back ahead by double digits and the lead would later reach 11 on a pair of free throws by Stevens.\n\n\r\n              “We had a poise to us that was great,” said Kennard, who was 5 of 7 from the field and connected on 4 of 6 from outside the arc. He later added: “Guys made big plays. Jaren did his thing in the fourth. ...Overall, the fourth quarter was really good defensively, and I thought that really helped us.”\n\n\r\n              Both teams entered the night in the lower section of the Western Conference. Memphis was on the skid as they piece together lineups through injuries. The Rockets lone win came Monday night when they defeated the New York Knicks 105-103. Holiday's two winning free throws with less than a second left came when the Knicks' Jalen Brunson was called for a foul that officials later said was an incorrect call.\n\n\r\n              Memphis built a 23-point lead in the first half behind accurate 3-point, which was still hovering around 50% midway through the second quarter. The Grizzlies couldn't maintain the shooting pace, and then got lackadaisical with the ball, allowing the Rockets to get back into the game with a 26-8 run late in the half. A couple of late baskets allowed Memphis to hold a 58-49 lead at intermission.\n\n\r\n              “They started hitting 3s, and we started freezing up,” Brooks said. “We can't have that.”\n\n\r\n              Memphis stayed close in many games through the losing streak. Only two of the losses were by more than 10 points. In many cases, the Grizzlies let go of the reins in the fourth quarter.\n\n\r\n              “We've been in different ballgames the last couple of weeks,” Memphis coach Taylor Jenkins said. “Up 20; down 20. Fighting back. A lot of this has come down to the fourth quarter. Defensively was huge late. There was great discipline.”\n\n\r\n              UP NEXT:\n\n\r\n              Rockets: At New Orleans on Feb. 22\n\n\r\n              Grizzlies: Host Milwaukee on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995593.2231512
}