{
  "game_id": "0021900503",
  "espn_id": "401161145",
  "date": "Dec 31, 2019",
  "matchup": "OKC vs. DAL",
  "headline": "Gallinari, Schroder score 20 each as Thunder beat Dallas",
  "body": "OKLAHOMA CITY --  The Oklahoma City Thunder seems to thrive on fourth-quarter pressure, as evidenced by their latest comeback on Tuesday night.\n\nDanilo Gallinari and Dennis Schroder each scored 20 points, Chris Paul hit the go-ahead basket with 40 seconds left and the Thunder rallied from a seven-point deficit in the final three minutes to beat the Dallas Mavericks 106-101.\n\nPaul scored 13 of his 17 points in the fourth quarter and added eight rebounds and seven assists for the Thunder, who have won seven of their last eight games to move into seventh place in the Western Conference. During that stretch, they've also had comebacks from 26, 24 and 18 points down to win.\n\nThe Thunder (18-15) are three games above .500 for the first time this season.\n\n\"The really good teams in our league, the last four or five minutes, they really lock down and tighten up,\" Paul said. \"That's what we did. We've got to figure out how to put the whole game together, but I'm happy with what we've been doing.\"\n\nLuka Doncic led the Mavericks with 35 points, 10 rebounds and seven assists, but he and Maxi Kleber each missed a potential tying 3-point attempt in the final seconds.\n\n\"We got two pretty good looks, I would say,\" Doncic said. \"We think that in any game, but the ball just didn't go in, so I hope the next time it goes in.\"\n\nDallas played without usual starters Kristaps Porzingis and Tim Hardaway Jr., who missed the game due to injuries.\n\n\"We're not going to be an excuse team,\" Dallas coach Rick Carlisle said. \"We're not going to go there. We've just got to execute a little bit better at both ends. It's a one-possession game up until the last part of the game, so one more make and one more miss one way or the other and the thing's different. But that's the NBA now. There's a very thin margin for error and you've got to be really good at both ends.\"\n\nDallas led by as many as 12 points in the first half thanks to 23 points by Doncic, who was listed as questionable to play after he suffered a left wrist sprain and back contusion after taking a hard fall on Sunday against the Los Angeles Lakers.\n\nBut the Thunder closed to within 51-50 by halftime and twice led by six points in the third quarter before Dallas took a 78-77 lead into the fourth quarter. Dallas led 99-92 after a 3-pointer by Doncic with 2:56 left, but Oklahoma City took a 102-101 lead when Paul hit a 17-foot jumper.\n\nGallinari -- who missed the Thunder's previous four games due to a sore left ankle -- poked the basketball away from Doncic at the other end, leading to two free throws by Schroder with 19.9 seconds left.\n\n\"I was just trying to play defense off the scouting report,\" Gallinari said. \"He likes to go left rather than right, so I knew he was going to get back to his left hand. It was a good play.\"\n\nAfter Kleber and Doncic both missed their 3-point attempts, Shai Gilgeous-Alexander sealed the win with two free throws with 2.9 seconds left. Gilgeous-Alexander finished with 19 points and 10 rebounds.\n\n\"We just want to win and we're starting to figure out what we need to do, specifically, on both ends of the floor to get the win, and we're doing it,\" Gilgeous-Alexander said.\n\nTIP-INS\n\nMavericks: Dallas hit 15 of 51 3-point attempts, the 21st straight game in which the Mavericks have made at least 10 3-pointers. . Doncic's 17 first-quarter points tied for the most by a Thunder opponent in a quarter this season. D'Angelo Russell had 17 in a quarter for Golden State on Nov. 9 . It was the third straight year in which the Mavericks played at Oklahoma City on New Year's Eve.\n\nThunder: Guard Hamidou Diallo played for the first time since hyperextending his right elbow on Nov. 22 against the Lakers. He scored four points. ... The Thunder won despite making only 6 of 27 3-point attempts ... Centers Steven Adams (10 points, 11 rebounds) and Nerlens Noel (12 points, 12 rebounds) each had a double-double.\n\nDALLAS STARTERS OUT\n\nHardaway sat out due to a left hamstring injury sustained in the loss to the Lakers. Carlisle said before the game he doesn't know when Hardaway will be ready to play again. Jalen Brunson replaced Hardaway in the starting lineup and scored seven points.\n\nPorzingis also missed the game due to right knee soreness. His absence was unexpected, as he had been listed in the starting lineups that were delivered to the media and scorers before the tipoff. Kleber started in place of Porzingis and played well, finishing with 14 points and a career-high 14 rebounds.\"We've got a deep roster,\" Carlisle said. \"We're very capable of having guys step up and step forward.\"\n\nUP NEXT\n\nMavericks: Start a season-high, six-game homestand on Thursday against Brooklyn.\n\nThunder: Begin a four-game road trip on Thursday at San Antonio.",
  "source": "espn_api",
  "crawled_at": 1764996232.062654
}