{
  "game_id": "0022000605",
  "espn_id": "401307390",
  "date": "Mar 15, 2021",
  "matchup": "LAC @ DAL",
  "headline": "Leonard, Clippers bounce back with 109-99 win over Mavericks",
  "body": "DALLAS -- — Kawhi Leonard and the Los Angeles Clippers answered a couple of low moments in their season — and kept rolling on the second night of back-to-backs.\n\n\r\n                    Leonard scored 22 points, Marcus Morris Sr. added 14 in a rare start and the Clippers beat the Dallas Mavericks 109-99 on Monday.\n\n\r\n                    The Clippers were playing Dallas for the first time since a 51-point blowout on their home court in December, and a night after a 20-point loss in New Orleans. The NBA's only remaining unbeaten team on the back end of consecutive games improved to 7-0 and tied Phoenix (7-1) for the most such victories.\n\n\r\n                    “Back-to-backs test your manhood, test who you are and test your character,” coach Tyronn Lue said. “I thought tonight we responded very well.”\n\n\r\n                    The second meeting — and first of two consecutive games in Dallas — since the Clippers beat the Mavericks in six games in a first-round series in the playoff bubble was a victory for LA's depth over the Mavericks' star power. The Clippers won for the second time in six games while Dallas lost for just the second time in its past seven.\n\n\r\n                    Luka Doncic posted his ninth triple-double for Dallas, finishing with 25 points, 16 assists and 10 rebounds. Kristaps Porzingis scored 22 points.\n\n\r\n                    Paul George scored 15 as seven Clippers finished in double figures. Ivica Zubac had 15 points and 11 rebounds. Nicolas Batum, who sat while Morris made his third start of the season, had a couple of big 3-pointers and scored 14. Reggie Jackson and Patrick Patterson scored 12 apiece.\n\n\r\n                    The Clippers built leads early in both halves with better defense than they displayed a night earlier against the Pelicans, who shot the highest percentage in the NBA this season at 65.4%.\n\n\r\n                    The Mavericks erased a 14-point first-quarter deficit in the second quarter. But they trailed 55-50 at halftime after leading by a NBA-record 50 points (77-27) at the half in their 124-73 victory in LA in December.\n\n\r\n                    “We know how they felt after how we beat them at their place,” said Dallas guard Tim Hardaway, who scored 21 points. “You've got to give them credit. They came out aggressive. They put their foot down.” \n\n\r\n                    Dallas couldn't rally again after falling behind by 12 early in the fourth. The Mavericks trailed 103-99 with three minutes remaining but couldn't convert on two chances to get closer before Leonard got a three-point play off a putback.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: C Serge Ibaka sat out with lower back tightness after playing 23 minutes against the Pelicans. It's just his second missed game of the season. ... G Patrick Beverely isn't on the three-game road trip because of right knee soreness. ... Morris, who missed the first eight games of the season, led all scorers with 12 in the first half, and Lue said he intended to keep 10th-year pro in the lineup. “We wanted to kick-start Marcus and get him going,” Lue said.\n\n\r\n                    Mavericks: C Dwight Powell didn't play because of an illness that coach Rick Carlisle said wasn't related to COVID-19. Powell was among the Dallas players to miss games in January because of health and safety protocols. ... Dallas tied a franchise low with five free-throw attempts (twice before, in 2008 and 1995). The Mavericks made four. It wasn't much of a difference in the game because LA had just 11 attempts, making nine.\n\n\r\n                    LEONARD'S BACK-TO-BACKS\n\n\r\n                    Leonard, who before this season hadn’t played on consecutive nights since near the end of the 2016-17 season, did it for the fourth time and played a season-high 40 minutes. He has played in six of the seven victories on the second nights of back-to-backs.\n\n\r\n                    “Physically I was tired, but mentally I wanted to win the game,” said Leonard, who had eight rebounds, seven assists and four steals while helping LA force seven turnovers by Doncic. “You're going to have these moments down the road where you feel like your juice is gone but you've just got to keep fighting.”\n\n\r\n                    NOT REVIEWABLE\n\n\r\n                    In the final seconds of the third quarter, Doncic pleaded with officials to give him a shot at a four-point play when the 3-pointer he threw up while he was fouled on purpose went in. Officials said there was no shot.\n\n\r\n                    After a discussion during a Dallas timeout, there was no challenge. The Mavericks had a throw-in, and Doncic hit two free throws after getting fouled again on a drive for an 85-78 deficit going to the fourth quarter. Carlisle said it was his mistake not knowing the ruling of no shooting foul wasn't reviewable.\n\n\r\n                    UP NEXT\n\n\r\n                    The teams play in Dallas again Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997683.6579268
}