{
  "game_id": "0021900648",
  "espn_id": "401161290",
  "date": "Jan 20, 2020",
  "matchup": "LAL @ BOS",
  "headline": "Kemba beats LeBron for 1st time, Celtics top LA 139-107",
  "body": "BOSTON --  Kemba Walker finally beat LeBron James, and he did it by helping the Boston Celtics send the Los Angeles Lakers to their biggest loss of the season.\n\nWalker ended a career-long losing streak against James, scoring 20 points to beat him for the first time in 29 tries and lead the Celtics past the rival Lakers 139-107 on Monday night.\n\n\"I'm happy I got one at least, before he goes,\" Walker said with a laugh after the Celtics snapped their three-game losing streak. \"Who knows how long he can play, because he's just incredible. But you know, it's only one. One and 28.\"\n\nJaylen Brown scored 20 points, drawing a taunting technical after dunking over James, and Enes Kanter had 18 points and 11 rebounds for Boston. The Celtics gave up the first eight points of the game but turned things around when Anthony Davis, playing for the first time in almost two weeks, went to the bench with a pair of fouls 49 seconds apart early in the first quarter.\n\n\"The less he plays, the better for everybody else,\" Celtics coach Brad Stevens said.\n\nJames had 15 points and 13 assists for the Lakers, who had won 10 of their previous 11 games. But the Celtics made 13 of their first 22 3-point attempts to open a 103-75 lead in the third quarter -- the biggest against Los Angeles all season until Boston made it a 34-point game in the fourth.\n\n\"We were fortunate to put the ball in the basket quite a bit,\" said Stevens, whose team shot 56% overall. \"The ball going in masks some things.\"\n\nWalker's 28 games with out a win against James was second in NBA history only to Sherman Douglas' 0-30 head-to-head record against Michael Jordan.\n\n\"If anybody: him. The guy I couldn't beat, it'd be him. He's such a great player, he's done so much in this league,\" said Walker, who spent the first eight years of his career in Charlotte. \"He's beaten a lot of guys. I bet you there's a lot of people who don't have a winning record against LeBron James.\"\n\nPOSTER\n\nBrown was called for a technical foul after he hung on the rim with one arm and taunted James after dunking over him in the second quarter.\n\n\"I ain't going to lie, that was pretty nice, pretty awesome,\" Brown said. \"LeBron, he's gotten so many other guys. Just to be out there against one of the best players to ever play the game is an honor. I always like like that matchup and it gives me a little extra boost.\"\n\nJames said there was no shame in getting beaten -- this time.\n\n\"Why would I take it personally? It's part of basketball,\" he said. \"It's not the first time I got dunked on. It might not be the last time I get dunked on. But Jaylen's been playing exceptionally well this year. It was a good play.\"\n\nMINUTES RESTRICTED\n\nDavis was only expected to play 28 minutes in his first game after missing five in a row since he landed hard on his back against the Knicks on Jan. 7. Coach Frank Vogel said he would limit Davis to 28 minutes, but he pulled Davis when he picked up two fouls in the first four minutes.\n\nHe did not return the rest of the quarter, as the Celtics turned a six-point deficit into a three-point lead. They built on it in the second, when Tatum scored 13 points and Kanter had 12 to give Boston a 69-55 lead at the break.\n\nDavis finished with nine points and four rebounds in 23 minutes.\n\n\"I was just trying to get back into game shape and get back in rhythm,\" Davis said. \"For the most part, I felt fine.\"\n\nSTAR-STUDDED\n\nThe Lakers' only visit to Boston this season brought out a few celebrities, including rapper Snoop Dogg, former Red Sox slugger David Ortiz and a handful of members of the New England Patriots.\n\nJames took advantage of the trip to Boston to take in a high school game his son Bronny was playing in Springfield. The Lakers star reportedly made the 90-mile commute across the state in a helicopter.\n\n\"My routine was broken today, but I could care less about it if I was seeing my family,\" he said. \"It was a unique opportunity to see my son, live, play that close to where I'm at. So I could care less about all that. It's all secondary when it comes to my family.\"\n\nTIP-INS\n\nLakers: The 69 first-half points were the most scored against LA this season. ... The Celtics posted pictures outside the Lakers locker room of Rajon Rondo and Avery Bradley from their Boston days, along with one of Vogel, who started in Boston as a video coordinator. ... The Lakers' biggest defeat of the season had been a 128-104 loss to Denver on Dec. 22. That was also the most points they had given up before Monday.\n\nCeltics: Tatum scored eight points during a 16-2 run that left Boston leading 97-68 with about four minutes left in the third and brought out the first \"Beat LA!\" chant of the night. ... The Celtics made just four of their last 12 3-point attempts and finished at 47%.\n\nUP NEXT\n\nLakers: At the Knicks on Wednesday.\n\nCeltics: Host Memphis on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995990.097088
}