{
  "game_id": "0022000891",
  "espn_id": "401307690",
  "date": "Apr 21, 2021",
  "matchup": "SAC vs. MIN",
  "headline": "Hield's late 3 lifts Kings past Timberwolves 128-125",
  "body": "SACRAMENTO, Calif. -- — Buddy Hield scored 29 points, including a 3-pointer with 8.8 seconds remaining, lifting the Sacramento Kings to a 128-125 win over the Minnesota Timberwolves on Wednesday night.\n\n\r\n                    Moments after Minnesota’s D’Angelo Russell missed from above the arc, Hield came back the other way and hit his seventh 3 of the game to help Sacramento avoid being swept in the three-game season series with the Timberwolves.\n\n\r\n                    “It was good to see him shooting and making his shot tonight,” Kings coach Luke Walton said. “If there’s not a hand in front of him, he has the green light to let it go. That’s the type of shooter he is and that’s what we want him doing.”\n\n\r\n                    De’Aaron Fox had 30 points, seven assists and five rebounds for the Kings. Harrison Barnes added 22 points and seven assists. \n\n\r\n                    Karl-Anthony Towns scored 26 points for Minnesota but missed an off-balance one-handed shot in the final seconds.\n\n\r\n                    “I thought there was contact,” Towns said. “I should have recognized the way the game was going that that wasn’t going to be called most likely. I thought it was good. Just landed on the rim and didn’t want to go in.”\n\n\r\n                    Naz Reid added 24 points and seven assists for Minnesota.\n\n\r\n                    The Timberwolves haven’t won consecutive games since beating the Pistons and Jazz in back-to-back games to open the season.\n\n\r\n                    “Very deflating,” Reid said. “It’s not like we can’t do it. I don’t know what it is.”\n\n\r\n                    After Fox made a pair of free throws with 1.4 seconds remaining, the Timberwolves called timeout to advance the ball but failed to get off a shot.\n\n\r\n                    Sacramento trailed early in the fourth quarter, then went on a 12-0 run to go up 117-115. Tyrese Haliburton had a pair of 3s in the middle of the run.\n\n\r\n                    “The game was kind of going like that all day,” Fox said. “For us it was like, let’s tighten up on both ends and we were able to do that.”\n\n\r\n                    The two teams traded shots down the stretch before Hield’s big shot. It was his third made basket of the second half.\n\n\r\n                    Hield has been streaky for most of the season but bounced back from an off night in the first game of the back-to-back when he shot 3 of 11, all on 3-point tries. Hield found his rhythm in the second game and shot 11 of 16 overall.\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Juancho Hernanogomez banked in a 3-pointer at the buzzer to end the third quarter. … Opponents are shooting 42.2 % on 3s against Minnesota since the All-Star break. … Jaylen Howell missed his fourth straight game with a bruised right tibia. \n\n\r\n                    Kings: A visibly angry Hassan Whiteside was hit with a technical foul in the third quarter when he repeatedly pointed to the Timberwolves bench and yelled, “I’ll (mess) you up.” … Sacramento scored 70 or more points in the first half for the second consecutive game. A night earlier the Kings tied their season-high with 74. … Richaun Holmes sat out a fifth game with a right hamstring strain.\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: Play at Utah on Saturday before returning to Minnesota to face the Jazz on Monday.\n\n\r\n                    Kings: Face the Warriors at Chase Center on Sunday night. The two clubs have faced each other twice this season, with the visiting team winning each time.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997946.085286
}