{
  "game_id": "0022300561",
  "espn_id": "401585189",
  "date": "Jan 15, 2024",
  "matchup": "CHI @ CLE",
  "headline": "Donovan Mitchell scores 34 points as the Cavaliers pull away late to beat the Bulls 109-91",
  "body": "CLEVELAND -- — Donovan Mitchell scored 34 points, Jarrett Allen had 10 points and 14 rebounds for his ninth straight double-double, and the Cleveland Cavaliers pulled away late for a 109-91 victory over the Chicago Bulls on Monday night.\n\n\r\n              Caris LeVert added 16 points, seven rebounds and seven assists off the bench as the Cavaliers extended their longest winning streak of the season to five, despite blowing a 21-point lead in the second half.\n\n\r\n              “They’re a good team, a competitive team, so we knew they were going make a run,” said Mitchell, who also had seven assists. “And we missed wide-open shots. But the biggest thing is how we responded, and we did it as a group.”\n\n\r\n              Coby White made two free throws early in the fourth quarter to put Chicago in front for the only time at 81-80, capping a 28-6 run that began after Cleveland went up 74-53 in the third.\n\n\r\n              The Cavaliers immediately answered with 10 straight points, five by Mitchell on drives to the basket, and closed out the game with a 29-10 surge.\n\n\r\n              “Right now we’re getting the timely stops we need, and the really good teams do that,” LeVert said. “We have versatile defenders and we have bigs that can switch. We’re just locking in more defensively and we’re getting better at our scheme.”\n\n\r\n              Cleveland made 20 3-pointers in a franchise-record 57 attempts — an NBA season high in regulation — as it took the court for the first time since beating Brooklyn 111-102 in Paris on Jan. 11. Mitchell, LeVert and Georges Niang each went 4 of 10 beyond the arc.\n\n\r\n              White scored 18 points and Zach LaVine and Nikola Vucevic had 17 apiece for the Bulls, who had won two in a row on the road. Vucevic and Andre Drummond each grabbed 10 rebounds as coach Billy Donovan played them together for much of the second half.\n\n\r\n              “What was disappointing was a lot of the (mistakes) when we went up one were self-induced,” Donovan said. “It was rushed shots, turnovers, offensive rebounds; all stuff we did to ourselves.”\n\n\r\n              Ayo Dosunmo had 10 points in the third to ignite Chicago’s rally, but could not finish the game after his sore left shoulder flared up. Patrick Williams missed his second consecutive game with right ankle soreness that is affecting his heel area.\n\n\r\n              Allen is averaging 18.8 points, 15.1 rebounds and 4.7 assists during his career-long streak of double-doubles. Cleveland is 10-3 since losing power forward Evan Mobley (left knee surgery) and point guard Darius Garland (broken jaw) until February.\n\n\r\n              “J-A gets me open, that’s for sure, and he’s willing to do the little things,” Mitchell said of Allen. “We all appreciate it. He’s playing out of his mind and he should be an All-Star. We need to get him there.\"\n\n\r\n              The Cavaliers made eight 3-pointers in the first — three by Niang — to build a 40-21 advantage. White had eight points in the second for Chicago, which trailed 60-46 at halftime.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit Toronto on Thursday night.\n\n\r\n              Cavaliers: Host Milwaukee on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995894.623622
}