{
  "game_id": "0022300946",
  "espn_id": "401585574",
  "date": "Mar 13, 2024",
  "matchup": "TOR @ DET",
  "headline": "Jalen Duren has career-high 23 rebounds as Pistons beat Raptors 113-104 for 3rd win in 4",
  "body": "DETROIT -- — Jalen Duren had a career-high 23 rebounds along with 24 points and five assists as the Detroit Pistons won three of four games for the first time in nearly two years, beating the Toronto Raptors 113-104 on Wednesday.\n\n\r\n              Detroit, which trailed by 16 points in the second quarter, hadn't won three of four since late in the 2021-22 season — a stretch of 145 games.\n\n\r\n              Duren posted his second game this season with at least 20 points, 20 boards and five assists. Nikola Jokic and Domantas Sabonis are the only other players with two this season.\n\n\r\n              He became the first Pistons player with such a game before his 23rd birthday.\n\n\r\n              “I just wanted to get us a win, honestly,” said Duren, who turns 21 on Nov. 18. “We've talked a lot about running hard through the tape and finishing this year strong.”\n\n\r\n              Cade Cunningham added 19 points for Detroit, which had six players score in double figures. The Pistons have the second-worst record in the league, one game ahead of Washington.\n\n\r\n              Cunningham didn't play in the fourth quarter, but Pistons coach Monty Williams said it wasn't health-related.\n\n\r\n              “I just wanted to go with the group that built our lead,” Williams said. “I had him ready to go, but (Marcus Sasser) hit another 3 and I sat him back down.”\n\n\r\n              Immanuel Quickley scored 25 points for Toronto, which matched a season high by losing five straight. Former Piston Kelly Olynyk scored 19.\n\n\r\n              “We had 32 assists, but we weren't able to get enough on the glass,” Raptors coach Darko Rajakovic said. “We allowed too many second-chance points. That was the biggest difference.”\n\n\r\n              The Raptors led 57-52 at halftime but only scored 22 points in the third. That allowed Detroit to take an 83-79 lead on Stanley Umude's 3-pointer at the buzzer.\n\n\r\n              The Pistons continued to play good defense, holding Toronto to two points on 1-of-8 shooting in the first five minutes of the fourth. A pair of 3-pointers by Sasser put Detroit ahead 100-87 with 4:26 left, and the Raptors never challenged down the stretch.\n\n\r\n              “Hats off to our second unit tonight,” Pistons forward Isaiah Stewart said. “They built on the lead and gave the starters a cushion. Sasser got hot and Cade was a good teammate and told Coach to leave him in.”\n\n\r\n              Toronto started the second quarter with a 26-5 run, with nine players contributing points. Cunningham and Duren combined to go 6 of 10 in the quarter, but the rest of the team shot 1 of 14.\n\n\r\n              “We had it at 16 points — 53-37 — but we lost a little concentration at the end of the half,” Rajakovic said. “That let them get it back to five.”\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Orlando on Friday.\n\n\r\n              Pistons: Host Miami on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996191.415274
}