{
  "game_id": "0022200067",
  "espn_id": "401468222",
  "date": "Oct 27, 2022",
  "matchup": "LAC @ OKC",
  "headline": "Gilgeous-Alexander scores 24 as Thunder beat Clippers again",
  "body": "OKLAHOMA CITY -- — The Thunder have done it again.\n\n\r\n              Shai Gilgeous-Alexander scored 24 points and Oklahoma City earned its second straight win over the Clippers, beating Los Angeles 118-110 on Thursday night.\n\n\r\n              Lu Dort scored 21 points and Aleksej Pokusevski added 15 for the Thunder, who beat the Clippers 108-94 on Tuesday.\n\n\r\n              It was a breakout game for Dort, who entered shooting 26% from the field for the season. He made 9 of 15 shots, while being the primary defender on Clippers All-Star Paul George.\n\n\r\n              “For him, it’s a good confidence blast,” Gilgeous-Alexander said. “I knew that would happen eventually. Lu works so hard, and when you work hard and you play as hard as he does, good things happen.”\n\n\r\n              The Thunder shot 49.5% from the field.\n\n\r\n              “We’ve just got to be able to guard point of attack,” Clippers coach Tyronn Lue said. “They’re just lining us up one-on-one, and guys are able to get whatever they want.”\n\n\r\n              Clippers forward Kawhi Leonard missed both games against the Thunder while managing his previously injured right knee. George played on Thursday after sitting out on Tuesday with an illness and finished with 10 points on 4-for-12 shooting.\n\n\r\n              Norman Powell led the Clippers with 21 points. Reggie Jackson scored 18 and John Wall added 17 for Los Angeles, which lost its third straight.\n\n\r\n              The Thunder scored 31 points off 20 Clippers turnovers two days after scoring 23 points off 19 Los Angeles giveaways.\n\n\r\n              “The live turnovers are killing us,” Lue said. “We’ve got to just clean that up.”\n\n\r\n              The Thunder led 30-12 in the first quarter, but the Clippers rallied and led 60-53 at halftime behind 12 points each from Wall and Jackson. \n\n\r\n              “You know, that’s a really good team,\" Thunder coach Mark Daigneault said. \"They’re not going to lay down. And I thought we really came out with a sense of purpose and obviously threw the first punch. And it’s a good lesson for us that a good team is not just going to accept that.”\n\n\r\n              Gilgeous-Alexander committed his fourth foul with 4.6 seconds left in the second quarter, and he started the second half on the bench. The Thunder rallied without him and took a 71-70 lead before he returned midway through the third quarter. The Thunder led 89-87 heading into the fourth.\n\n\r\n              Wall's driving dunk at the start of the fourth quarter tied the game at 89, but the Thunder pulled away late. Pokusevski hit a 3-pointer, then less than a minute later, Tre Mann walked into a fast break 3-pointer that gave the Thunder a 116-104 with 2:55 remaining.\n\n\r\n              Oklahoma City did not attempt a free throw until 10:22 remained in the fourth quarter, but the Thunder went 7 for 8 from the line in the final period.\n\n\r\n              Daigneault didn't like the free throw situation, but he liked the way the game turned out.\n\n\r\n              “I wasn’t particularly pleased with that, but we weathered it,\" he said. \"And at the end of the day, it’s not easy one way or the other. There’s going to be things you have to deal with, things you have to overcome. And I just thought we played right through it tonight. It didn’t distract us. And we just — we kept on it and obviously emerged. It was good.”\n\n\r\n              GILGEOUS-ALEXANDER'S FREEBIES\n\n\r\n              Gilgeous-Alexander made both of his free throws on Thursday, leaving him one short of the Thunder record for consecutive made free throws to start a season.\n\n\r\n              The record holder? Not Russell Westbrook or Kevin Durant. Not even George, a former Thunder star. It’s Danilo Gallinari, who opened with 23 straight to start the 2019-20 season.\n\n\r\n              Gilgeous-Alexander has already passed the likes of Patrick Patterson (17 during the 2017-18 season) and Kevin Martin (16 during the 2012-2013 season). Corey Brewer made his first 17 after being traded to the Thunder in 2018.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: F Marcus Morris sat out his second straight game for personal reasons. ... The Clippers shot 53.7%. ... Los Angeles made just 9 of 28 3-pointers.\n\n\r\n              Thunder: G Josh Giddey sat out with a sprained right ankle. ... Went 6 for 10 from 3-point range in the first quarter to take a 34-24 lead. They finished 17 for 38 on 3-pointers after going 4 for 30 in Tuesday's game. \n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host the New Orleans Pelicans on Sunday.\n\n\r\n              Thunder: Visit the Dallas Mavericks on Saturday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994998.9952152
}