{
  "game_id": "0021800206",
  "espn_id": "401070887",
  "date": "Nov 14, 2018",
  "matchup": "TOR vs. DET",
  "headline": "Pistons stun Raptors 106-104 in Casey's return to Toronto",
  "body": "TORONTO --  Dwane Casey's return to Toronto delivered drama right up until the final second.\n\nReggie Bullock made the winning shot as time expired and the Detroit Pistons rallied from a 19-point deficit to beat the Raptors 106-104 on Wednesday night, giving Casey an emotional victory over his former team.\n\n\"I felt good for the players,\" Casey said. \"We were 19 down and didn't give up, didn't stop scrapping, didn't give in.\"\n\nBlake Griffin had 30 points and 12 rebounds, Reggie Jackson and Langston Galloway each scored 13 and Stanley Johnson had 12 points for the Pistons, who had lost six of eight.\n\n\"He would never say it, but anytime you come back to a place you spent so much time at, had so much success and obviously the fans love him here, to win Coach of the Year and switch jobs in the same year is tough,\" Griffin said of Casey. \"I think it meant a lot to him. I was just proud of the way we came back and responded.\"\n\nCasey raised his arms in triumph, pumped his fist, then ran onto the court to celebrate with his team after Bullock's tiebreaking basket in the lane.\n\n\"It was obviously good to be able to see a coach come from the other end of the court and celebrate with his players,\" Bullock said.\n\nKawhi Leonard scored 26 points and Pascal Siakam and Greg Monroe each had 17 for the Raptors, who have lost consecutive home games after a 7-0 start. Toronto (12-3) also failed to match the best start in franchise history. The Raptors went 13-2 to begin the 2014-15 season.\n\nRaptors guard Kyle Lowry, who blossomed under Casey's leadership, was left fuming afterward about multiple Toronto miscues, including a blown coverage on the final play.\n\n\"It's a good win for him,\" Lowry said. \"I'm sure he's happy, but we're not happy. I'm not happy for him. We should have won the game.\"\n\nToronto had won six straight over the Pistons, and nine of the previous 11 meetings.\n\nDetroit trailed 88-77 to begin the fourth but took its first lead since the opening quarter, 98-97, on a jump shot by Jackson with 4:54 remaining.\n\nLeonard tied it at 104 by making a jumper with 38 seconds to go. Griffin missed a jumper at the other end and Lowry grabbed the rebound, giving Toronto 10 seconds to try a go-ahead shot. Leonard brought the ball up but lost it out of bounds with 2 seconds to go.\n\nAfter Siakam blocked Glenn Robinson's shot out of bounds, Detroit took the ball under the basket with 1.2 seconds left. Jose Calderon inbounded to a cutting Bullock, who won it with his buzzer-beater.\n\n\"I was pretty much butt-naked under the basket,\" Bullock said. \"I got the ball and just floated it.\"\n\nMonroe played a season-high 21 minutes because starting center Serge Ibaka sat out with a sore right knee. Jonas Valanciunas started in his place.\n\nThe Raptors lost another starter when guard Danny Green left with a sore lower back in the third quarter. He did not return.\n\nToronto coach Nick Nurse expects Ibaka to return Friday at Boston, but said Green's status is unknown.\n\nFans stood and cheered when Casey was introduced before the game, and roared in approval when a video tribute was shown during the first timeout. Players from both benches also stood and applauded as Casey acknowledged the crowd with a wave.\n\n\"He was drawing up a play,\" Griffin said. \"They had finished the video, everybody started clapping. I was watching the video, and the play. He was about to go over it again and I was like, `Coach, you've got to stand up. You deserve that.\"\n\nCasey went 320-238 in seven seasons with the Raptors, more wins than any other coach in franchise history. He was selected NBA Coach of the Year after Toronto set a team record with 59 wins last season, but had been fired by the time he received the award. Casey was let go after the Raptors were swept in the second round of the playoffs by Cleveland, their third straight postseason defeat at the hands of the Cavaliers.\n\nTIP-INS\n\nPistons: Calderon spent parts of eight seasons with the Raptors and is the franchise leader in assists (3,770). . This was the sixth time a Detroit game was decided by three or fewer points, tied with Chicago for most in the NBA.\n\nRaptors: F C.J. Miles, who left Monday's loss to New Orleans because of a strained right adductor, was inactive. There is no timetable for his return. ... For the second straight game, the Raptors missed nine of their first 10 attempts from 3-point range. They finished 4 for 20.\n\nCONFIDENCE IN COACH\n\nGriffin said he wasn't surprised at Casey's ability to draw up two late-game plays. Casey was not considered strong at in-game play-calling during his Toronto tenure.\n\n\"It isn't like we just discovered this for the first time today,\" Griffin said. \"Maybe to Toronto fans or certainly their GM, maybe it was a surprise, but not to us.\"\n\nWEAK FINISH\n\nToronto had eight turnovers in the fourth and scored 16 points, its fewest in any quarter this season.\n\nUP NEXT\n\nPistons: Host Cleveland on Monday night.\n\nRaptors: At Boston on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994291.497173
}