{
  "game_id": "0022200125",
  "espn_id": "401468280",
  "date": "Nov 04, 2022",
  "matchup": "MEM vs. CHA",
  "headline": "Brooks scores 23 as Grizzlies rout Hornets 130-99",
  "body": "MEMPHIS, Tenn. -- — Dillon Brooks scored 23 points, matching his career-high with six 3-pointers, and the Memphis Grizzlies ran past the Charlotte Hornets 130-99 on Friday night.\n\n\r\n              Desmond Bane finished with 19 points as eight Grizzlies players reached double figures. Steven Adams had 13 points and 19 rebounds, controlling the paint as Memphis built a big lead in the first half and continued to extend it after halftime. Brooks was 6 of 7 from 3-point range and is 17 of 29 from outside the arc over the past five games.\n\n\r\n              “We’ve got a lot of options,” Brooks said of the Grizzlies' offense. “There’s going to be a lot of open shots. You’ve just got to step into them and knock them down.”\n\n\r\n              Kelly Oubre Jr. led Charlotte with 17 points but was 5 of 12 from the floor — part of the Hornets shooting 38%. James Bouknight scored 14 points, and Bryce McGowens added 12. P.J. Washington had 10 points on 2-of-15 shooting, including 1 for 7 on 3s.\n\n\r\n              The Hornets were held under 25 points in each of the first three quarters.\n\n\r\n              “I thought we set a tone with our defense early in that first quarter,” Memphis coach Taylor Jenkins said. “Gave up 24 points (in the first quarter), then 23 and 22 (in the second and third periods). We did a good job with our game plan execution.”\n\n\r\n              The Hornets, dealing with injuries to key players, entered the game winning only one of their last five games. In addition to the continued absence of point guard LaMelo Ball (left ankle sprain), Charlotte was also without Gordon Hayward (left shoulder contusion) and leading scorer Terry Rozier (right ankle sprain) — dealing a considerable blow to the offense.\n\n\r\n              But Hornets coach Steve Clifford was more disappointed with his team’s effort than the absence of shooters. He noted that there were four loose balls early in the game. He saw the Grizzlies on the floor for them, “and our guys reaching down time after time.”\n\n\r\n              “That either had to change, which it didn’t,” Clifford said, “or we weren’t going to have much of a chance, and we didn’t.”\n\n\r\n              The Grizzlies’ accurate shooting early allowed them to build a 20-point lead. By halftime, Memphis had pushed the advantage to 71-47 while shooting 53%.\n\n\r\n              While Brooks connected on his first five shots, it was Adams dominating on the inside before the break. He had 13 points and 16 rebounds at halftime, including 10 offensive boards.\n\n\r\n              Memphis’ lead reached 38 late in the third quarter. By the time it was 40 early in the fourth, Jenkins had put in his deep reserves.\n\n\r\n              Clifford continued to express his disappointment in his team’s effort and lack of desire. \n\n\r\n              “We’re not that team,” the Hornets coach said. “Even with everybody, we’re not that talented. If we’re not going to play with some grit, if there’s not some intangibles that get developed about the group, it’s going to be hard to make the improvements that we’re capable of.”\n\n\r\n              TIP-INS: \n\n\r\n              Hornets: Clifford expressed optimism about the return of some of his injured players. “(Rozier) did a lot more today. I think in the next few days, we will have a chance to get him back, Melo back and Cody (Martin) back.” ... The starting frontcourt of P.J. Washington and Jalen McDaniels was a combined 0 for 10 in the first half. \n\n\r\n              Grizzlies: Veteran Danny Green, who has not played this season while recovering from a torn ACL, provided commentary on the Grizzlies’ television broadcast during the second quarter. ... Adams’ 16 rebounds in the first half, was one less than the Hornets had as a team. It was also a franchise record for rebounds in a first half. ... Ja Morant had 12 points and 11 assists.\n\n\r\n              JAREN JACKSON UPDATE\n\n\r\n              Grizzlies forward Jaren Jackson Jr., who has been out the entire season recovering from right foot surgery, continues to build towards his return. “He got mostly three-on-three workouts over the (recent) road trip, so I think the next step is five-on-five pretty soon,” Jenkins said, adding: “His conditioning is picking up. They’re pushing him hard.”\n\n\r\n              LAST WORD\n\n\r\n              “There’s nothing about this performance that was acceptable. Nothing.” -- Hornets coach Steve Clifford.\n\n\r\n              UP NEXT: \n\n\r\n              Hornets: Host Brooklyn on Saturday night.\n\n\r\n              Grizzlies: Host Washington on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994238.980535
}