{
  "game_id": "0022200971",
  "espn_id": "401469126",
  "date": "Mar 06, 2023",
  "matchup": "CLE vs. BOS",
  "headline": "Mitchell scores 40, Stevens rallies Cavs past Celtics in OT",
  "body": "CLEVELAND -- — Lamar Stevens spent three quarters watching and waiting his turn. When it finally came, he didn't waste a single second.\n\n\r\n              Donovan Mitchell scored 40 points and Stevens came off the bench to fuel Cleveland's fourth-quarter comeback with his hustle, leading the Cavaliers to a 118-114 win on Monday night over the Boston Celtics, who lost their second overtime game in less than 24 hours.\n\n\r\n              Evan Mobley added 25 points and 16 rebounds for the Cavs, who improved to 7-0 in OT while avenging a loss in Boston five days ago. Cleveland trailed by 14 entering the fourth before Stevens, who only averages 12 minutes per game, entered and turned the game around.\n\n\r\n              “There is no way we win that game without Lamar,” Cavs coach J.B. Bickerstaff said. “He changed the tone, the physicality, the effort.”\n\n\r\n              Jaylen Brown scored 32 and Malcolm Brogdon 24 for the Celtics, who didn't arrive at their hotel in Cleveland until 2:30 a.m. after losing to the New York Knicks in double overtime on Sunday.\n\n\r\n              But even missing All-Star Game MVP Jayson Tatum, who stayed behind in Boston to rest along with center Al Horford after the taxing loss to the Knicks, the Celtics were up by double digits with seven minutes left.\n\n\r\n              And, they had a chance to win in the final second of regulation, but Grant Williams missed two free throws with 0.8 seconds left and Marcus Smart barely missed a tip-in at the horn as the teams went to OT tied at 109-all.\n\n\r\n              Williams had confidently told Mitchell he was going to make both shots before his misfires.\n\n\r\n              “He gave us both, but I didn't box out Marcus Smart for the tip and that's what I'm thinking about,” Mitchell said. “Thank God he missed 'em and we got the win.”\n\n\r\n              While energizing the Cavs, the misses hurt the Celtics, who were on fumes.\n\n\r\n              “It’s definitely a little deflating,” Brogdon said. \"We were up 10-12 points with three minutes left. We shouldn’t have let it get to that point. We shouldn’t have to rely on free throws. It’s not his fault.”\n\n\r\n              After playing just nine seconds in the first three quarters, Stevens came off the bench and grabbed eight rebounds — six offensive — and scored eight points, including a 3-pointer with 2:14 left in OT to put Cleveland ahead 114-112.\n\n\r\n              “I just felt I could help with a little energy boost,” Stevens said. “I was just trying to impact the game however I could.”\n\n\r\n              His second basket of overtime put the Cavs ahead for good before Brown's layup with 43 seconds left pulled the Celtics within 116-114.\n\n\r\n              However, Darius Garland made a pair of free throws with 9 seconds to go for the Cavs and after securing the final rebound, Mitchell, who played with a badly sprained left middle finger, slammed the ball off the floor as Rocket Mortgage FieldHouse erupted following a win that was probably tougher than needed.\n\n\r\n              Brown didn't make any excuses after the Celtics lost for the fourth time in five games.\n\n\r\n              “There were some key vital plays that we missed, but we can't blame fatigue,” said Brown, who played 45 minutes after logging 47 on Sunday. “I wish one of the games had turned into a win. If I've got to play 47 minutes the next game, I'm down with it.”\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Brown added 13 rebounds and 9 rebounds, just missing his first triple-double this season. ... Coach Joe Mazzulla didn't provide specifics on Tatum's injury, but said he doesn't expect it to sideline him for long. ... C Robert Williams is expected to miss up to 10 days with a hamstring strain. ... Smart celebrated his 29th birthday and Mazzulla credited the team's “emotional leader” with a “beautiful ability to control the game.”\n\n\r\n              Cavaliers: Improved to 3-1 against Boston with each winning coming in OT. ... Mitchell tied J.R. Smith's team record with his 200th 3-pointer. Mitchell made a career-high 232 3-pointers for Utah last season. ... Cleveland is set to begin a unique scheduling quirk in which the Cavs will play consecutive road games in Miami, Charlotte, Brooklyn and Orlando over the final month.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Portland on Wednesday. \n\n\r\n              Cavaliers: Visit Miami on Wednesday, the first of two straight road games against the Heat.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995231.2202508
}