{
  "game_id": "0022300175",
  "espn_id": "401584803",
  "date": "Nov 11, 2023",
  "matchup": "ATL vs. MIA",
  "headline": "Adebayo scores 26 points as depleted Heat show off depth in 117-109 win over Hawks",
  "body": "ATLANTA -- — Bam Adebayo scored 26 points with 17 rebounds and rookie Jaime Jaquez Jr. added a career-high 20 points as the short-handed Miami Heat beat the Atlanta Hawks 117-109 on Saturday night for their fourth straight win.\n\n\r\n              Miami was playing its first game since leading scorer Tyler Herro sprained his right ankle in Wednesday night's 108-102 win at Memphis. Herro is expected to miss at least two weeks. Another top scorer, Jimmy Butler, missed the game against Atlanta for personal reasons.\n\n\r\n              Coach Erik Spoelstra said he was given a strong indication in a pregame meeting that players were eager to fill the void left by Herro and Butler when he informed the team “we were going to have to have some guys step up.”\n\n\r\n              Added Spoelstra: “Everyone was leaning forward with the body language saying ‘It’s me.'”\n\n\r\n              The Heat showed off their depth to find scoring from different sources.\n\n\r\n              Kyle Lowry scored 17 points and Josh Richardson had 16, also a season high. Duncan Robinson scored 11 points in his first start of the season. Kevin Love had seven points.\n\n\r\n              Jaquez, making his third start, almost doubled his previous high of 11 points against Memphis.\n\n\r\n              “I wouldn't say necessarily to score,” Jaquez said when asked how he saw his role in the new lineup. “I would say to just make plays.”\n\n\r\n              The emergence of different scorers was not a surprise to Spoelstra, who said before the game he had “a lot of guys who have been chomping at the bit to get more minutes. ... Guys are prepared.”\n\n\r\n              Trae Young led Atlanta with 27 points, including 14 in the fourth quarter, and 11 assists. Dejounte Murray had 23 points. Each guard attempted nine 3-pointers, but coach Quin Snyder wasn't satisfied with his team's 18 of 46 shooting on long-range shots.\n\n\r\n              “We had some good looks that we didn't take,” Snyder said.\n\n\r\n              Added Young: “We've just got to shoot the ball. When we catch the ball, just shoot it. Don't hesitate.”\n\n\r\n              Young said Miami's defense “will make you think you've got a driving lane and other guys are over there helping. If you're not ready to shoot 3s against this team, you're going to have a tough night.”\n\n\r\n              Jaquez, the first-round pick from UCLA, hit a buzzer-beating 3-pointer to close the first half, giving Miami a 63-52 lead. \n\n\r\n              Miami led by 21 late in the first half. Atlanta's last lead was 5-4.\n\n\r\n              The Hawks were averaging 121.8 points per game, third in the league. It was the best average through eight games for the franchise since the St. Louis Hawks averaged 117.5 in the start of the 1960-61 season.\n\n\r\n              Hawks guard Wesley Matthews (right calf) sank two 3-pointers in the third quarter and scored seven points in his first game of the season. Matthews' father, Wesley Matthews Sr., played a combined 152 games with Atlanta (1980-83, 84 and 1990). They become the first father-son duo to play for the Hawks.\n\n\r\n              The Hawks debuted their fly city edition uniform which included the blue accent used in their 1968 first Atlanta uniform.\n\n\r\n              UP NEXT\n\n\r\n              Miami: Continues its four-game road swing at San Antonio on Sunday night.\n\n\r\n              Atlanta: Visits Detroit on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996312.444404
}