{
  "game_id": "0022301026",
  "espn_id": "401585654",
  "date": "Mar 23, 2024",
  "matchup": "POR vs. DEN",
  "headline": "Nuggets edge youthful Trail Blazers 114-111 after Portland starts 5 rookies",
  "body": "PORTLAND, Ore. -- — Reggie Jackson scored 23 points, Aaron Gordon had 22 points and 12 rebounds and the Denver Nuggets defeated the Portland Trail Blazers 114-111 on Saturday night.\n\n\r\n              The Nuggets won without their star duo of Nikola Jokic and Jamal Murray on a night when the Blazers became the second team to start five rookies since NBA box scores started tracking starters in the 1971-72 season. \n\n\r\n              The reigning champs have won eight of their last nine and are 14-2 since the All-Star Break.\n\n\r\n              “Any time you can win a game without Nikola Jokic and Jamal Murray, especially on the road, you’re always going to take that,” Nuggets coach Michael Malone said. “I’m proud of our group for just fighting through it. Give them credit, they came out of halftime with a head of steam and got us on our heels. \n\n\r\n              \"We didn’t play any defense in (third) quarter, but down the stretch we made enough plays to get the win.” \n\n\r\n              Rookie Duop Reath led the Trail Blazers with 24 points. Scoot Henderson, the No. 3 overall pick in last year’s draft, finished with 22 points and six assists as the Blazers dropped their sixth straight.\n\n\r\n              Denver’s biggest lead was 15. \n\n\r\n              “When we called timeout, our leaders of the team were taking over the huddle making sure we were locked in,” Jackson said of Denver’s resolve in the second half. “We just wanted to get stops, stop offensive rebounds and just make sure we got good shots.” \n\n\r\n              After Porter gave the Nuggets a 109-98 lead with 2:04 remaining, Portland made its final run starting with a 3-pointer by Reath. The Blazers forced a turnover and cut the lead to 109-105 on a layup by Toumani Camara with 50.5 seconds left.\n\n\r\n              A layup from Jackson pushed the Nuggets ahead 111-105. Henderson responded with a layup to make it 111-107 with 27 seconds remaining.\n\n\r\n              Henderson’s layup with 10 seconds left made it 112-109 after Jackson split a pair of free throws. After Gordon split a pair of foul shots of his own, Henderson made another layup to make it 113-111. \n\n\r\n              Portland fouled Jackson with 1.9 seconds and he made one of two at the line again, but Kris Murray’s full-court heave to tie missed.\n\n\r\n              After going 0 for 11 from deep in the first half, Portland made six 3-pointers in the third quarter to get back into it.\n\n\r\n              “I think some of the ones we took in the first half weren’t the ones that we wanted,” Henderson said of Portland’s shooting. “I think in the second half, we were really finding that shot, getting into the paint and then kicking out. We were getting paint touches and then spraying 3s.” \n\n\r\n              A free throw from Dalano Banton cut Denver’s lead to 85-83 heading into the final period.\n\n\r\n              YOUNG BLAZERS\n\n\r\n              Henderson started along with Camara, Reath, Kris Murray and Rayan Rupert.\n\n\r\n              Saturday marked the first time a team started five rookies since the Golden State Warriors on April 26, 2012, according to the Elias Sports Bureau.\n\n\r\n              Klay Thompson started that night for the Warriors alongside Charles Jenkins, Chris Wright, Jeremy Tyler and Mickell Gladness in their final game of a lockout-shortened season. \n\n\r\n              The Blazers have the second-worst record in the Western Conference. On Saturday night, they were without several key players, including Simons, Jerami Grant, Deandre Ayton, Shaedon Sharpe and Malcolm Brogdon.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Memphis on Monday night.\n\n\r\n              Trail Blazers: At Houston on Monday night.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996567.3851352
}