{
  "game_id": "0021501081",
  "espn_id": "400828968",
  "date": "Mar 25, 2016",
  "matchup": "LAL vs. DEN",
  "headline": "Balanced Nuggets overcome Kobe's 28 to beat Lakers, 116-105",
  "body": "LOS ANGELES --  A vintage second half by Kobe Bryant wasn't nearly enough to counteract a steady night of excellence from the Denver Nuggets.\n\nD.J. Augustin scored 20 points and Jusuf Nurkic added a career-high 18 in the Nuggets' 116-105 victory over the Los Angeles Lakers on Friday night.\n\nBryant hit four 3-pointers and scored 28 points in his final meeting with Denver, producing his highest-scoring performance in nearly eight weeks during his farewell season.\n\nNuggets coach Mike Malone saw it coming, but his club weathered a Bryant-led rally that trimmed an 18-point lead to four. Denver survived largely thanks to a bench that scored 71 points, led by Augustin and his five 3-pointers.\n\n\"I got nervous in the third quarter because with Kobe, anything is possible,\" Malone said. \"This game will miss him. He's one of those generational players that come along once every 25, 30 years.\"\n\nWill Barton added 16 points in a balanced effort by the Nuggets, who have won three of four. They have beaten the Lakers six straight times at Staples Center.\n\nAugustin had his fourth 20-point performance since joining Denver last month in a trade with Oklahoma City. Nurkic also had a major game off the bench, going 7 for 11 in the 7-foot Bosnian's best NBA performance.\n\n\"We knew they were going to make a run,\" Augustin said. \"They have Kobe Bryant on their team. We just had to stay calm and patient.\"\n\nBryant had his most prolific offensive game since dropping 38 points on Minnesota on Feb. 2, earning a standing ovation when he checked out with 1:44 to play. He went 10 of 22 from the field in 28 minutes, and his 11-point third quarter made it close for a while.\n\n\"I'm just trying to save up and have as much energy as possible, and try to play all of these games,\" Bryant said. \"I'm just giving it absolutely all I can.\"\n\nJordan Clarkson added 20 points for the Lakers, who have lost six of seven to fall to 15-57. The 16-time NBA champion franchise has never won fewer than 21 games since moving to Los Angeles 56 years ago.\n\nRANDLE'S NUMBERS\n\nJulius Randle had his first career triple-double for the Lakers with 13 points, 18 rebounds and a career-high 10 assists.  At 21, the rangy forward is the youngest Lakers player with a triple-double since Magic Johnson. Randle wrapped up his triple-double with a last-minute assist to Clarkson. \"I said it at the beginning of the year: He's Lamar Odom in a Zach Randolph body,\" Bryant said of Randle.\n\nKOBE IN\n\nBryant suited up for the third time in four days despite his perpetually sore right shoulder. After sitting out the majority of the Lakers' home games in recent weeks to rest his body for road farewells, Bryant intends to try to play in each of the Lakers' last 10 games in his final season, coach Byron Scott said before the game.\n\nThe Lakers' final five home games include dates with Miami and Boston before his finale against Utah on April 13.\n\nD'ANGELO DOWN\n\nD'Angelo Russell was carried off the court with a sprained right ankle. He appeared to be making a normal defensive move late in the first half when he rolled his ankle and immediately went down in pain. The Lakers announced he has a moderate sprain, with X-rays revealing no broken bones. Russell is the NBA's fourth-leading scorer among rookies with 13.3 points per game, and he ranks third with 3.5 assists.\n\nThe Lakers will know more Saturday about his availability for their final 10 games.\n\n\"I definitely want to get out there,\" Russell said. \"We only have a few games left, so I want to finish the season out on a positive note.\"\n\nTIP-INS\n\nNuggets: Kenneth Faried sat out his fifth straight game with lower-back soreness, but the forward made it through the pregame shootaround feeling fairly good. Malone thinks Faried might return to action this weekend.\n\nLakers: Metta World Peace had seven points and a good-looking steal in 14 minutes of action. ... Former Liverpool teammates Steven Gerrard and Jamie Carragher watched from courtside.\n\nUP NEXT\n\nNuggets: At Clippers on Sunday.\n\nLakers: Host Wizards on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994242.712289
}