{
  "game_id": "0021700474",
  "espn_id": "400975225",
  "date": "Dec 22, 2017",
  "matchup": "MIA vs. DAL",
  "headline": "Ellington ties career-best with 28, Heat top Mavs 113-101",
  "body": "MIAMI --  Wayne Ellington was able to stay with Miami this season largely because the Heat made a trade with Dallas over the summer and freed up the money needed to keep him around.\n\nThe Mavericks probably regretted that Friday night.\n\nEllington tied a career high with 28 points and set a career-best by connecting on eight 3-pointers, and the injury-ravaged Heat never trailed on the way to beating the Mavericks 113-101 -- shooting 64 percent, the second-best mark in franchise history.\n\nThe Heat opened both halves on 12-0 runs.\n\nGetting outscored \"12-0 to start the game, 12-0 to start the second half. You combine it, it's ridiculous,\" Mavericks coach Rick Carlisle said. \"Their level of force was greater from start to finish. We made some good runs but when you're swimming against the current the whole game, it's difficult to get over the hump.\"\n\nEllington was 10 for 16 from the field, 8 for 12 from 3-point range.\n\nHe has endeared himself to the Heat coaching staff since the moment he arrived in Miami. He takes more than 100 shots in his pregame routine, which usually ends about a half-hour before game time and always under the watchful eye of Heat assistant coach Octavio de la Grana.\n\n\"He behaves like a champion before he's a champion,\" Heat coach Erik Spoelstra said. \"I love it. ... It's beauty in motion.\"\n\nMiami guard Dion Waiters left in the first quarter after turning his long-problematic left ankle on a drive, meaning the Heat now have seven players dealing with injuries. Hassan Whiteside, Goran Dragic, James Johnson and Justise Winslow all remained out with various injuries, Rodney McGruder and Okaro White are likely not returning anytime soon, and now Waiters is ailing again.\n\nWaiters missed the final 13 games of last season with a left ankle sprain, and it's nagged him at times ever since. That meant more minutes for Ellington, and he delivered.\n\n\"We were going to have to step up collectively,\" Ellington said. \"Everybody's play was going to have to elevate and I definitely took it upon myself as well to elevate my game.\"\n\nJosh Richardson scored 24 points, Tyler Johnson scored 19 and Bam Adebayo scored 14 for Miami. The Heat went 16-for-25 from 3-point range.\n\nYogi Ferrell scored a season-high 23 for the Mavericks. Dirk Nowitzki and Harrison Barnes each had 20 for Dallas, which got outrebounded 35-22. The 22 rebounds were the fewest by an NBA team this season.\n\n\"They just compete. That's their DNA down here,\" Nowitzki said of the Heat.\n\nRichardson made 11 of 14 shots for Miami, which has won four of its last five.\n\nTIP-INS\n\nMavericks: Devin Harris played only eight minutes before leaving with an illness. ... Dallas was denied a two-game winning streak, which would have matched a season best. The Mavs are 2-7 in the game immediately following a win.\n\nHeat: X-rays on Waiters were negative. ... Adebayo, who was 1 when Nowitzki made his NBA debut, spent some time guarding the longtime Dallas star. Adebayo was plus-28 in 37 minutes. ... Kelly Olynyk scored 11 for Miami.\n\nALL TIED UP\n\nIncluding two NBA Finals matchups, the Heat and Mavericks have now played 74 times -- with each team winning 37 of them.\n\nUD-DIRK MEMORIES\n\nNowitzki and Heat forward Udonis Haslem have been going head-to-head for more than a decade -- since the 2006 NBA Finals, at least, and the respect the veterans have for one another is clear. They shared some pleasantries before tip-off Friday, and then found themselves guarding one another briefly during the game.\n\nMCROBERTS REPORT\n\nJosh McRoberts, who was the player Miami traded to Dallas in the move that essentially meant the Heat would keep Ellington, still hasn't played for Dallas because of foot problems. Saturday is the one-year anniversary of his last NBA appearance, though he did play 5-on-5 earlier this week against some Mavericks interns. \"He's been a great guy to have around our club,\" Carlisle said.\n\nUP NEXT\n\nMavericks: Visit Atlanta on Saturday.\n\nHeat: Host New Orleans on Saturday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993560.393124
}