{
  "game_id": "0021700341",
  "espn_id": "400975092",
  "date": "Dec 04, 2017",
  "matchup": "PHX @ PHI",
  "headline": "Devin Booker scores 46 to lift Suns past Ben Simmons, 76ers",
  "body": "PHILADELPHIA -- Devin Booker was unguarded as he swished a 26-foot 3-pointer, and he shrugged as he tossed up his hands.\nThe Suns were surely impressed.\nThe 76ers? Well, they likely wished they could have stayed in bed and called out sick.\nBooker scored 46 points, outplayed a flu-ridden Ben Simmons in a battle of 21-year-old stars and led the Phoenix Suns to a 115-101 win over the Philadelphia 76ers on Monday night.\nBooker and Simmons, the No. 1 overall pick in the 2016 draft, have positioned themselves as future faces of the league. Booker was the one who left Monday's game all smiles.\n\"I know there's more things I have to work on,\" Booker said. \"Turn around this franchise, start to get wins and make the playoffs. Whatever I have to do to do that, I'm with it.\"\nHe shook off a wretched start (2-of-11 in the first quarter) and rallied for perhaps his best game of the season. Booker, who once scored 70 points in a game, made a whopping 11 of 17 shots in the second half for 32 points. His three 3s in the fourth helped the Suns put away an on-the-rise Sixers team that played one of its worst games of the season. Booker made five of eight 3s.\n\"Devin had quite a night,\" 76ers center Joel Embiid said. \"We took them lightly, and we paid for it.\"\nTJ Warren scored 25 points, and Tyler Ulis had 12 points and 12 assists for the Suns.\nEmbiid had 22 points and 12 rebounds, and Simmons scored 20 points. JJ Redick led the Sixers with 25 points.\nRedick rallied the Sixers from 17 down and hit consecutive 3s in the fourth that sliced the deficit to five. Ulis pushed back the Sixers with a 3, and Booker buried two on the next two possessions that squashed the 76ers' comeback. Booker let out a big yell after a fast-break dunk that made it 110-94 and sent The Process fans toward the exits. Booker added one more 3 and a shrug for good measure.\nSimmons had the flu and covered his head with his hoodie as he trudged off the court from pregame warm-ups to the locker room.\n\"I feel like my body kind of hit a wall,\" Simmons said. \"I woke up, and I didn't feel like I could play.\"\nSimmons, who is averaging 23.1 points and 9.4 rebounds, was sick for most of the past three days and didn't leave his place at all on Sunday.\n\"Out of kindness, I've decided to still start him,\" coach Brett Brown.\nSimmons made his first four shots and played 17 minutes in the first half. Fittingly, his first-half highlight was a sick dunk: He reached high, snared a low lob pass from Timothe Luwawu-Cabarrot that skimmed Dragan Bender's outstretched finger and completed the alley-oop. Simmons also scored on an up-and-under layup that brought the crowd to its feet. It just wasn't enough to bring the Sixers a victory.\nEmbiid tried to make it a game in the third. He routinely punished Alex Len defensively; Embiid used his right hand to smack a shot into the backboard in the third. The Sixers recovered the ball, Embiid scored, and it was 82-75. The Sixers trailed by 10 through three.\nThe Sixers, shooting 36 percent on 3s this season, missed a whopping 23 of 30 3s.\nTIP-INS\nSuns: The Suns expect to travel 4,987 miles during the six-game road trip. ... Tyson Chandler had 12 rebounds.\n76ers: G T.J. McConnell could return this week against the Lakers. McConnell, averaging 7.1 points and 5.4 assists, missed his third straight game with a sprained AC joint in his left shoulder. He shot before the game for the first time since he was hurt.\nBOOK 'EM\nBooker shot 7-of-8 from the free throw line, grabbed eight rebounds and had two steals.\nUP NEXT\nSunday: At Toronto on Tuesday.\n76ers: Host the Los Angeles Lakers on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764993911.74981
}