{
  "game_id": "0021301167",
  "espn_id": "400490040",
  "date": "Apr 09, 2014",
  "matchup": "MEM vs. MIA",
  "headline": "Grizzlies' Zach Randolph, Marc Gasol take down LeBron James, Heat",
  "body": "MEMPHIS, Tenn. -- The intensity of the Memphis Grizzlies returned, and so did the character of a team that has struggled the past two weeks.\nThe result was a 107-102 victory over the Miami Heat on Wednesday night, keeping the Grizzlies in the hunt for the last playoff spot in the Western Conference.\nZach Randolph had 25 points and 11 rebounds, while Marc Gasol added 20 points and 14 rebounds as Memphis stayed within a game of the Phoenix Suns, who hold the eighth spot. The Suns defeated the New Orleans Pelicans 94-88 on Wednesday night.\n\"The headline of the day is the Grizzlies got the win, much-needed win,\" said guard Tony Allen, whose defensive intensity in the second half helped Memphis force nine Miami turnovers leading to 20 Grizzlies points. \"We want to continue to polish what we've got going, trying to race into the playoffs.\"\n\nLeBron James led the Heat with 37 points, connecting on 14 of 23 shots, including 3 of 5 from beyond the arc. Rashard Lewis scored 17, and Chris Bosh finished with 13 points. Mario Chalmers scored 12 points for the Heat.\nThe loss, coupled with the Indiana Pacers' 104-102 win at Milwaukee, dropped the Heat into the second spot in the Eastern Conference.\nMike Conley finished with a team-high 26 points and handed out six assists for Memphis. Courtney Lee added 18 points.\nThe scoring of Randolph and Gasol contributed to a 60-30 advantage in the paint for Memphis. The Grizzles outrebounded the Heat 41-27, who were without reserve front-line players Greg Oden, Udonis Haslem and Chris Andersen, along with second-leading scorer Dwyane Wade.\n\"Obviously, those are key guys out against a team you need big bodies against,\" James said of the absences, noting the double-doubles by Randolph and Gasol. \"I thought for the most part, we played a pretty good game to win. The fourth quarter got a little away from us.\"\nThe fourth quarter was where the intensity of Allen that had been missing in recent weeks emerged. The Grizzlies' defensive leader acknowledged having been in a funk recently, but Allen, who guarded James much of the game, returned to his frenetic ways.\n\"When Tony's being Tony, when he's making the big plays defensively, doing the little things offensively, he picks everybody up,\" Conley said. \"He doesn't have to say a word. You can see the energy.\"\nThe teams were tied at 91 after Lewis' 3-pointer was topped with a foul when Gasol bumped him. The ensuing free throw tied the game with 5:43 left.\nMemphis turned up the defense at that point and scored in its transition game. Conley's 3-pointer with just more than 4 minutes left gave Memphis a 100-93 lead, causing Miami coach Erik Spoelstra to call timeout.\nThe Grizzlies got another turnover on the next possession, and Conley converted another 3-pointer to give Memphis its first double-digit lead at 103-93, completing a 12-2 run with 3:34 left and sealing the game for Memphis.\n\"We gave up a couple of leak-outs,\" Bosh said. \"All it takes is one or two times, you don't get guys back. They got it up to an eight-point lead. In a game like this, that's like 20 against a team like this.\"\nThere weren't many misses to start the game. The teams combined to hit 11 of their first 12 shots. Memphis would end up starting 10-of-11, while the Heat were 6-of-7 from beyond the arc, and Randolph hit all eight of his shots in the quarter.\nBy the end of the first quarter, the teams were 27-of-37.\n\"Just trying to be aggressive,\" Randolph said of the perfection. \"You know, I hit shots and guys kept coming to me.\"\nDespite Randolph's accuracy, the Heat carried a 58-54 lead into halftime.\nLee's 3-pointer at the close of the third period originally was ruled too late. But after review, the call was overturned and the teams entered the final quarter tied at 80.\n\"First of all, the turnovers were pick-sixes,\" Spoelstra said of the fourth quarter. \"They had more than a handful of those.\n\"It was a tale of two halves offensively. That probably as much as anything got us in trouble.\"\nGame notes\nJames connected on a four-point play early in the third quarter when he was fouled at the top of the key by Grizzlies F James Johnson. ... The Heat entered the game 27-2 when James scores at least 37 points. ... Randolph's eight field goals in the first quarter tied a franchise mark held by Mike Bibby. ... Memphis has won 12 straight at home. The Grizzlies are 9-0 when facing teams coming into Memphis on the second night of a back-to-back. The Heat lost to Brooklyn 88-87 on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764993043.6605701
}