{
  "game_id": "0021500995",
  "espn_id": "400828882",
  "date": "Mar 14, 2016",
  "matchup": "PHX vs. MIN",
  "headline": "Teletovic's 3 with 1.2 seconds left lifts Suns over Wolves",
  "body": "PHOENIX --  Mirza Teletovic got the call to take the big shot, though he added a little extra drama by taking a couple of dribbles.\n\nThen he knocked down a 3-pointer with 1.2 seconds left that lifted the Phoenix Suns to a 107-104 victory over the Minnesota Timberwolves on Monday night.\n\n\"We executed the play the way it's supposed to be,\" Teletovic said. \"Everybody did their part, everybody played great. It's what was going to happen, make it or miss it. Tried to use as much time as I could.\"\n\nP.J. Tucker scored a career-high 23 points and Teletovic had 21 for the Suns, who won at home for the first time since Feb. 27 and just the second in almost two months. The Timberwolves (21-46) lost for the third time in the past four.\n\nTucker added 12 rebounds and Teletovic had 11 points in the fourth quarter. Devin Booker finished with 16 points and Tyson Chandler had 14 points and 11 rebounds for the Suns, who won despite 24 turnovers.\n\nZach LaVine led the Wolves with 28 points and Andrew Wiggins had 22. Karl-Anthony Towns finished with 17 points and 10 rebounds, and Ricky Rubio had a career-high-tying 17 assists and 13 points.\n\n\"We gave this one away,\" LaVine said.\n\nBooker scored and was fouled by LaVine with 9.2 seconds left, his free throw giving the Suns a 104-102 lead. Wiggins responded with a driving layup with 4.6 seconds left to tie it.\n\nThe Suns got the ball, and Teletovic took the inbounds pass from Tucker, dribbled to his right against Towns and sank the winning shot from 26 feet out. Shabazz Muhammad missed at the buzzer for Minnesota.\n\n\"When the ball went up, I was just looking at the rim,\" Teletovic said.\n\nTucker hit back-to-back 3s early in the fourth quarter to give the Suns an 84-78 lead. Before that, the Suns hadn't led since midway through the second quarter.\n\n\"That was big, man,\" Tucker said. \"That was one thing we talked about, when we get open shots, knocking them down, but just taking them.\"\n\nThe Wolves rallied to tie at 89, and the game went back and forth with Minnesota tying it again at 94 on LaVine's 3 with 1:48 remaining.\n\nLaVine scored 12 points in the first quarter, and Minnesota made 12 of its first 18 shots in the second. The Wolves went on an 8-0 run to take the lead and surged ahead 49-41 when Wiggins dunked in transition off a steal with 2:58 to go until halftime.\n\nWhen Rubio looked off defenders on a sideline inbounds play and lobbed to Wiggins for a jam that came right before the halftime buzzer, the Wolves had their biggest lead of the game at 57-47.  Rubio had 12 assists at the half.\n\n\"We should have come out and had a better outing in the third quarter and been more aggressive and more efficient and little more smart with our play,\" LaVine said.\n\nThe Suns rallied in the third quarter and tied it at 70 on free throws by Alex Len with 2:47 to go. Minnesota scored the next five points and led 78-76 at the start of the fourth quarter.\n\n\"The game is a battle of runs and defense,\" Booker said. \"Once you start shutting teams down, it leads to easy offense and it worked out well.\"\n\nTIP-INS\n\nTimberwolves: F Kevin Garnett missed his 22nd straight game with a right knee injury. ... C Nikola Pekovic has missed the past 18 games with a right ankle injury. ... Towns has 38 double-doubles in this his rookie season. ... Rubio also tied the franchise record for assists in a game.\n\nSuns: Brandon Knight played in his first home game since returning to action from 21 games missed due to injury. Knight had played the past two games, both on the road. He took a hard tumble going for a loose ball in the third quarter and took a knee to his back, but got up on his own and remained in the game.  ...  With Houston's win Monday night, the Suns were officially eliminated from playoff contention with 15 games remaining on their schedule. ... Len's 11 rebounds gave him double digits for the ninth straight game.\n\nUP NEXT\n\nTimberwolves: At Memphis Wednesday night.\n\nSuns: At Utah Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994828.732024
}