{
  "game_id": "0021900708",
  "espn_id": "401161350",
  "date": "Jan 29, 2020",
  "matchup": "IND vs. CHI",
  "headline": "Oladipo spurs late rally as Pacers run past Bulls in OT",
  "body": "INDIANAPOLIS --  Victor Oladipo opened the night by smiling and waving to Pacers fans in his return from a lengthy absence due to injury. He finished it by walking off the court in tears.\n\nThe two-time All-Star capped his first contest in more than a year by making a game-tying 3-pointer with 10 seconds left, and the Indiana Pacers went on to beat Chicago Bulls 115-106 in overtime.\n\n\"I just shot it. Mamba mentality, man. Mamba mentality,\" Oladipo said, his voice cracking. \"That's for Kobe (Bryant) and all the people that were on the helicopter.\"\n\nOladipo returned for the first time since last January, when he left the court on a stretcher with a ruptured quad tendon in his right knee. He spent the next 12 months fighting his way through what he called excruciating pain.\n\nBefore the game, coach Nate McMillan said Oladipo would come off the bench, be limited to 24 minutes and not play in back-to-back games. That will remain the plan until after the All-Star break.\n\nAt times, Oladipo understandably looked rusty and out of sync. But when his team needed it most, the Pacers' biggest star delivered on a night full of emotion.\n\nAs he sat on the scorer's table with 4:12 left in the first quarter, following a video tribute that featured his long journey back, Bulls coach Jim Boylen walked over and shook Oladipo's hand. When Oladipo entered the game, the roaring sellout crowd held up gold placards that read \"Ready 4 Action.\" Even Bulls players were applauding.\n\nOladipo scored nine points and had four assists and two rebounds in 21 minutes, going 2 of 8 from the field and 1 of 7 on 3s.\n\nBut it was the one 3 that capped a 7-0 rally over the final 2 1/2 minutes of regulation and tied the game, providing the jolt of energy Indiana desperately needed. Malcolm Brogdon scored seven of his 15 points in the extra period.\n\n\"We wanted to do it for him,\" Brogdon said. \"We knew how much energy was going to be in the building tonight. There are going to be bumps, but we're going to be able to get through them.\"\n\nZach LaVine had one chance to win it with a 7-foot runner at the end of regulation, but he lost the ball on the way up and it rolled out of bounds as the buzzer sounded.\n\nBrogdon took care of the rest.\n\nHe scored five points in a 9-2 run to open the overtime then sealed the win with a dunk with 1:16 left. Brogdon had nine rebounds and eight assists. T.J. Warren had 25 points to lead the Pacers.\n\nChandler Hutchison scored a career-high 21 points for the Bulls. LaVine added 20 for Chicago, which lost its eighth straight in the series.\n\n\"He's an elite player and I felt like I gave a pretty good contest,\" said Hutchison, who was defending Oladipo on the 3. \"I just have to make him put it down in that situation when the 3 is the only thing that could tie us. I'm going to learn from it and move on, but he hit a pretty tough shot.\"\n\nTIP-INS\n\nBulls: Thaddeus Young scored 16 points and Cristiano Felicio had 11 points and eight rebounds. ... Chicago was 6 of 33 on 3s and had 18 turnovers. .... The Bulls had a two-game winning streak end and have now lost eight straight in Indianapolis. ... LaVine has scored 20 or more points in 16 consecutive games, the longest streak of his career. ... The Bulls played without five injured players including Lauri Markkanen, Wendell Carter Jr. and Otto Porter Jr.\n\nPacers: Domantas Sabonis had 15 points, 11 rebounds, his 37th double-double this season. ... Justin Holiday finished with 13 points and Jeremy Lamb had 10 points and five rebounds. ... Rookie Goga Bitadze had 10 points. ... Indiana was 7 of 27 on 3s but made three of its last four. ... Warren has 23 games this season with 20 or more points. ... Myles Turner sat out with the flu.\n\nGETTING IN SYNC\n\nMcMillan didn't expect Oladipo to be in top form Wednesday.\n\nThe tougher part: Getting the Pacers re-acclimated to the new rotations that incorporate Oladipo.\n\n\"When a player gets hurt and someone steps into his role that's easier than stepping back. That's the trick,\" Boylen said. \"It's an interesting dynamic because it isn't often talked about, and it's different also when (the player) is a starter.\"\n\nUP NEXT\n\nChicago: Makes the second stop on its three-game trip Friday at Brooklyn.\n\nIndiana: Hosts New York on Saturday, looking for its eighth consecutive victory in the series.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995842.5924969
}