{
  "game_id": "0022300355",
  "espn_id": "401584983",
  "date": "Dec 18, 2023",
  "matchup": "MEM @ OKC",
  "headline": "Gilgeous-Alexander scores 30 in 3 quarters as Thunder roll past Grizzlies 116-97",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 30 points and nine rebounds in three quarters to help the Oklahoma City Thunder beat Memphis 116-97 on Monday night in the Grizzlies' final game before Ja Morant returns from his suspension. \n\n\r\n              Memphis lost its fifth straight, but help is on the way. Morant, the team’s star point guard, is eligible to return Tuesday at New Orleans. He was suspended for the first 25 games this season after being caught holding up a handgun during a livestream video in May. \n\n\r\n              Morant, one of the NBA's most electrifying players, averaged 26.2 points, 8.1 assists and 5.9 rebounds in 61 games last season. Grizzlies coach Taylor Jenkins said he expects Morant to play significant minutes in his first game back. \n\n\r\n              “Health-wise, he’s in great shape physically,” Jenkins said. “Now it’s just a matter of just adjusting to NBA game shape. But knowing how hard he plays, he’s going to be going full steam tomorrow and then a day off and get ready for Thursday’s first home game for him. But I won’t anticipate going crazy with his minutes. But I don’t think it’s any kind of restriction, you know, low minutes or anything like that.”\n\n\r\n              Things continued to go well for Oklahoma City, which remained in second place in the Western Conference standings. Gilgeous-Alexander hit a game-winner at Denver on Saturday night and followed it up by making 8 of 18 field goals and 13 of 14 free throws against Memphis. \n\n\r\n              Chet Holmgren had 17 points, seven blocks and six rebounds. Josh Giddey added 16 points and 12 rebounds for the Thunder, who have won four of five. \n\n\r\n              Holmgren, a rookie, has blocked 15 shots over the past two games. \n\n\r\n              “The one thing that stands out for me is the fearlessness in him attacking those plays,\" Thunder coach Mark Daigneault said. \"You know, it’s a vulnerable position when you are contesting shots at the rim, especially with his frame. And he’s always got his nose in the fight there. He’ll get dunked on five times if it means contesting five rim shots. And I think that’s the thing I respect most about him as a competitor.”\n\n\r\n              Holmgren is averaging 13.8 points, 8.8 rebounds and 4.3 blocks in December.\n\n\r\n              “Good, bad, up, down — experiences. He grows and he continues to improve through all that stuff,\" Daigneault said. \"And so it’s not going to be surprising as things start to slow down for him. Obviously, the shot blocking the last couple games has been wild. But things are slowing down for him in all facets of the game.”\n\n\r\n              Ziaire Williams scored 19 points and Desmond Bane added 17 for the Grizzlies (6-19), who have lost five straight. Jaren Jackson Jr., who had scored at least 40 points in two of his past three games, finished with 11.\n\n\r\n              Memphis was without guards Marcus Smart (sprained left foot) and Derrick Rose (strained left hamstring), among other players. The Grizzlies shot 35.3% from the field.\n\n\r\n              Memphis looked overmatched. The Thunder led 68-53 at halftime behind 17 points from Gilgeous-Alexander. Holmgren had 12 points and five blocks before the break.\n\n\r\n              Oklahoma City held Memphis to 2-for-19 shooting in the third quarter to take a 94-66 lead into the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit the New Orleans Pelicans on Tuesday.\n\n\r\n              Thunder: Host the Los Angeles Clippers on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996032.0869179
}