{
  "game_id": "0022300200",
  "espn_id": "401584828",
  "date": "Nov 16, 2023",
  "matchup": "MIA vs. BKN",
  "headline": "Butler scores 36, Robinson adds 26 and Heat top Nets 122-115 to win 7th straight",
  "body": "MIAMI -- — After starting 1-4, things looked bleak for the Miami Heat. Now that stretch seems almost forgotten.\n\n\r\n              Jimmy Butler scored 18 of his 36 points in the third quarter, and the Heat extended the NBA’s current longest winning streak to seven games by beating the Brooklyn Nets 122-115 on Thursday night.\n\n\r\n              Duncan Robinson added 26 for the Heat, who have won seven straight for the first time since Dec. 30, 2017-Jan. 14, 2018. Bam Adebayo scored 20 for Miami, which has won all seven of those games by single digits — and is one of only three teams without a double-digit win this season. Charlotte and Portland are the others.\n\n\r\n              “We're getting a little more organized, more comfortable,” Heat coach Erik Spoelstra said. “And that allows you to be more confident.”\n\n\r\n              Mikal Bridges and Lonnie Walker IV each scored 23 for Brooklyn, which had won its last five games against Miami. Nic Claxton was 7 for 7 from the field and scored 16 for the Nets, and Cam Johnson added 16 as well.\n\n\r\n              Walker got his points in 26 minutes off the bench.\n\n\r\n              “He can score the ball,” Johnson said. “He's been in attack mode. He's been locked in.”\n\n\r\n              Miami lost to Brooklyn on Nov. 1 to fall to 1-4, the worst five-game start in Spoelstra’s 16 seasons. The Heat haven’t lost since and the 8-4 record ties for the fourth-best 12-game start under Spoelstra; the team opened 9-3 on three occasions in that span.\n\n\r\n              Butler’s 18-point third quarter tied his best for any regular-season quarter in a Heat uniform, done on two other occasions. He’s also had quarters of 18, 21 and 22 in playoff games for Miami.\n\n\r\n              For the Heat, it was part of a nine-game, 18-day stretch where they’ll play in eight different arenas. The only one they’ll visit twice in that span is the United Center in Chicago, where they’ll open a two-game set against the Bulls on Saturday night to begin a five-game trip.\n\n\r\n              “It was fun to play at home for once,” Butler said.\n\n\r\n              Johnson picked up his fourth foul with 3:40 left in the first half, making him the 12th player in the league this season to have that many before intermission — and the second Nets player to do so in as many games, after Claxton did it against Orlando on Tuesday. Johnson’s fourth was an offensive foul, drawn by Kevin Love.\n\n\r\n              It sent him to the bench. It sent the Heat off and running.\n\n\r\n              They finished the half on a 14-0 run, the last 12 of those coming following Love taking the charge against Johnson, and went into the break up 60-52. The Nets were 0 for 7 with three turnovers in that stretch, the last of those giveaways coming when Butler stripped Royce O’Neale and set up Haywood Highsmith for a layup 4 seconds before the buzzer.\n\n\r\n              Miami kept the lead for the entirety of the second half.\n\n\r\n              “Their little run going into halftime ... you can't have that momentum shift going into halftime,” Nets coach Jacque Vaughn said. “That's something that we need to learn about, finishing the half and having the momentum going in your favor.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Philadelphia on Sunday.\n\n\r\n              Heat: Visit Chicago on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995387.807434
}