{
  "game_id": "0021800686",
  "espn_id": "401071362",
  "date": "Jan 19, 2019",
  "matchup": "LAL @ HOU",
  "headline": "Harden scores 48 points, Rockets beat Lakers 138-134 in OT",
  "body": "HOUSTON --  James Harden was the star for the Houston Rockets as usual on Saturday night, but he and the team got a big boost from Eric Gordon in his second game back after recovering from a bruised knee.\n\nHarden scored 48 points, Gordon added 30 and the Rockets overcame a 21-point deficit to beat the Los Angeles Lakers 138-134 in overtime.\n\nThe Rockets trailed for most of the night and were down by 18 in the second-half. Gordon sent it to overtime with a 3-pointer, and made four free throws in the last seconds of the extra period.\n\n\"He's playing unbelievable,\" coach Mike D'Antoni said of Gordon.\n\nComing off 57- and 58-point games, Harden had his 19th straight game with at least 30 and he's had 40 in 10 of the last 13. He was 14 of 30 from the field, going 8 of 19 on 3-pointers, and hit 12 of 15 free throws.\n\nHarden was asked if Gordon being back after missing eight games before his return on Wednesday night eased the burden on him a little bit.\n\n\"A little bit? It takes a lot of burden off me,\" Harden said. \"He's so offensively gifted and talented being able to shoot the basketball, being able to get to the rim, being able to make plays for others. You get a guy like that on the floor with you it makes it easier for not only myself but for everybody.\"\n\nBrandon Ingram missed a 3 for Los Angeles before Harden hit 1 of 2 free throws to make it 132-130 with less than a minute left. Ingram tied it with a basket, and Harden again made 1 of 2 free throws to make it 133-132.\n\nLos Angeles missed a 3 before Gordon also made just 1 of 2 free throws to leave Houston up by two with 12.6 seconds left. Kyle Kuzma lost the ball and it went out of bounds to give Houston the ball back. Gordon added four free throws after that to secure the victory.\n\nIt was the second straight overtime game for both teams after Houston lost to Brooklyn on Wednesday night and Los Angeles beat Oklahoma City on Thursday night.\n\nKuzma had 32 points for Los Angeles and Ingram added 21 in a game where coach Luke Walton was ejected in the third quarter.\n\nAlready without LeBron James and Rajon Rondo, the Lakers have another injury concern after Lonzo Ball sprained his left ankle in the third quarter. Walton said his X-rays were negative but that he'd have an MRI and \"we'll see where we are after that.\"\n\nFour straight points by the Lakers stretched the lead to nine in the fourth quarter, but Harden and Gordon made consecutive 3-pointers cut it to 112-109 with about two minutes remaining.\n\nLos Angeles made four free throws to make it 116-109 about a minute later, but Harden made two 3-pointers around a basket by Ivica Zubac to get Houston within three with about 30 seconds left.\n\nLance Stephenson missed a 3-pointer and Harden made two free throws to cut the lead to 118-117 with 5.7 seconds left.\n\nZubac made two more free throws before Gordon's off-balance 3-pointer with 2 seconds left sent it to OT.\n\n\"I saw Kentavious Caldwell-Pope running out to me and I thought he was going to fly right by me, but he stood right there,\" Gordon said. \"So I had to try to shoot it with confidence and I'm glad it went in.\"\n\nThe Lakers built a huge lead early and were up 64-46 at halftime, with Kuzma scoring 24 points.\n\nThey were ahead by 17 with about eight minutes left in the third quarter after scoring five straight points capped by a basket from Kuzma before Houston scored the next 15 points to cut it to 74-72 three minutes later. James Ennis had five points in that stretch and P.J. Tucker capped it with a 3-pointer.\n\nBall was injured just before Houston's run began. He remained on the court for a couple of minutes talking with trainer's before he was helped to his feet where he hopped on his right foot for a few steps before being carried off the court and to the locker room by Stephenson and Michael Beasley.\n\nWalton was ejected a couple of minutes after that when he got two technical fouls after yelling at officials during a timeout.\n\nIngram pointed to losing Ball as when things started to get away from the Lakers.\n\n\"Right when Lonzo went out,\" he said. \"That's exactly when it went away. We lost momentum a little bit.\"\n\nTIP-INS\n\nLakers: James was out for the 13th straight game with a strained left groin and did not make the trip. ... Stephenson finished with 16 points.\n\nRockets: Harden also had eight rebounds, six assists and four steals. ... Ennis returned after missing Wednesday's game after cutting his left leg in a fall at his house. ... Chris Paul missed his 14th game in a row with a strained left hamstring ... Clint Capela had surgery to repair a torn ligament in his right thumb and is expected to be out 4-6 weeks.\n\nTHEY SAID IT\n\nD'Antoni on Houston's comeback: \"Words don't do it. That was just our guys showing a lot of heart.\"\n\nUP NEXT\n\nLakers: Host Golden State on Monday night.\n\nRockets: Visit Philadelphia on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995005.223972
}