{
  "game_id": "0021801057",
  "espn_id": "401071730",
  "date": "Mar 18, 2019",
  "matchup": "PHX vs. CHI",
  "headline": "Lopez helps Bulls end losing streak, bet Bulls 116-101",
  "body": "PHOENIX --  Robin Lopez used his veteran guile to gain an advantage over the Phoenix Suns' young big men, and had major success at the expense of his former team.\n\nLopez scored 24 points on 11-for-14 shooting to help the Chicago Bulls beat the Phoenix Suns 116-101 on Monday night, snapping a five-game losing streak.\n\n\"My teammates, they were putting me in really advantageous positions,\" Lopez said. \"It's always great seeing familiar faces here. I was here for four years, and there are a lot of people I'm still close to.\"\n\nZach LaVine had 17 points, eight rebounds and seven assists, and Lauri Markkanen added 17 points and nine boards for Chicago. The Bulls shot 52 percent (46 for 89) from the field.\n\nDeandre Ayton had 25 points and 12 rebounds, and Devin Booker also scored 25 for Phoenix, which has lost three of four after a 5-2 stretch.\n\nThe Suns played without one of their top scorers and main contributors to their recent run of improved basketball, as Kelly Oubre Jr. missed the game with a left thumb sprain. Guard Tyler Johnson did not play due to a sore knee, missing his third straight game, and forward T.J. Warren hasn't played since Jan. 22 due to an ankle injury. Backup center Richaun Holmes also sat out with a quadriceps strain, his second straight game missed.\n\n\"No excuse,\" Suns head coach Igor Kokoskov said. \"Physicality, strength, explosiveness, aggressiveness, they got us. No question the better team won the game.\"\n\nLopez hit four different angles of hook shots in the first quarter, helping the Bulls take a 34-20 lead into the second. Lopez scored 14 of his points with hook shots.\n\n\"It's tough,\" Lopez said of going against Ayton. \"He's a great defender. He's got a long wingspan, so trying to put that over him, that's difficult.\"\n\nAyton admitted having a hard time defensively, and said he told Lopez he will \"steal\" the move from him.\n\n\"Lopez down low with a traditional hook shot, very unstoppable,\" Ayton said. \"If I really wanted to contest it there would have been a foul every time because I was off and he was really protecting the ball.\"\n\nThe Suns missed their first six 3-pointers, and after Cristiano Felicio's putback dunk and free throw, the Bulls took their largest lead of the game, 19 points, with 10:22 to play in the second quarter.\n\nThe Suns responded with an 11-2 run capped off by Troy Daniels' 3 with 7:03 to go, making it 41-31.\n\nLaVine's layup and free throw put the Bulls up by 19 again, 54-35, with 4:12 left in the half.\n\nThe Suns cut it to 56-43 at halftime, with Booker making just 3 of 11 shots, including four misses from 3-point range.\n\nPhoenix pulled to 56-48 early in the third, but Lopez scored the Bulls' next three baskets for a 66-52 lead with 6:57 to go. Chicago went ahead by 18 in the third and led 86-73 going into the fourth.\n\nThe Suns got the Bulls' lead down to nine early in the fourth, but couldn't get any closer. Antonio Blakeney dunked with 9:25 to play to give the Bulls a 91-77 lead.\n\n\"We're starting to have some fun a little bit, LaVine said. \"I think we shared the wealth a lot.\"\n\nChicago improved to 5-7 in the second of back-to-back games.\n\nTIP-INS\n\nBulls: Shaquille Harrison started at guard against his former team, and his first basket of the game was a driving dunk. ... F Otto Porter Jr. did not play due to a sore shoulder, and Boylen said there is no timetable for when he is able to play next. ... Chicago Cubs 3B Kris Bryant sat courtside for the game.\n\nSuns: Ayton skied for a two-handed alley-oop dunk from Josh Jackson with 2:19 left in the third quarter. ... Rookie Mikal Bridges made his first start since Feb. 13 and scored 12 points. ... Ayton recorded his 36th double-double of the season and is one away from tying Alvan Adams for the franchise's single-season record.\n\nUP NEXT\n\nBulls: Host Washington on Wednesday night.\n\nSuns: Host Detroit on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995048.852437
}