{
  "game_id": "0022300006",
  "espn_id": "401584094",
  "date": "Nov 03, 2023",
  "matchup": "DEN vs. DAL",
  "headline": "Jokic scores 33 points, leads Nuggets to 125-114 win over Mavericks in NBA tournament opener",
  "body": "DENVER -- — The only thing brighter than Denver's new vibrant blue-and-yellow floor was the shooting performance of Nikola Jokic.\n\n\r\n              Jokic scored 33 points and went 14 of 16 from the field as the Nuggets held off the Dallas Mavericks 125-114 on Friday night to open the NBA’s inaugural In-Season Tournament.\n\n\r\n              Jokic also had 14 rebounds, nine assists and one rare outburst of emotion after hitting a 3-pointer at the halftime buzzer. \n\n\r\n              “What I marvel at is just the consistency,” Nuggets coach Michael Malone said. “I mean, the guy is just great every night. ... He’s just a great player. I just love how he impacts the game in every way, shape and form. It’s really the definition of greatness.”\n\n\r\n              Michael Porter Jr. scored 24 points, and Jamal Murray had 18 points and 13 assists for the NBA champion Nuggets, who led by 20 points in the third quarter before seeing Dallas trim it to eight late in the game. Jokic made a cutting layup with 1:11 remaining to seal it.\n\n\r\n              The Mavericks lost for the first time this season. Luka Doncic finished with 34 points, 10 rebounds and eight assists but also had nine turnovers. Kyrie Irving chipped in 22 points.\n\n\r\n              “There’s a lot of positive things to look at,\" Doncic said. “What lost us the game is my turnovers and offensive rhythm. I think if this was last year we would've lost by 30.” \n\n\r\n              Dallas was without coach Jason Kidd, who didn’t make the trip due to a non-COVID-19 illness. Top assistant Sean Sweeney took his spot on the bench.\n\n\r\n              “When you put yourself down that much early on, as we know, it’s tough to overcome that,” Sweeney said. “Especially against guys like this, that are a great team and well-coached.”\n\n\r\n              Jokic showed rare emotion in the first half, letting out a scream after making a 3-pointer at the buzzer. It was big, too, because it elevated Denver's lead to 15 points.\n\n\r\n              So, why the scream?\n\n\r\n              “It was a good play,” Jokic casually said, “and I finally made a 3.”\n\n\r\n              Before the game, the 3-point line on the Nuggets’ colorful court had to be repainted after it was discovered to be the wrong distance. Both teams shot well from deep, hitting a combined 41.7% (30 of 72) from 3-point range.\n\n\r\n              This marked the first In-Season Tournament game for each team. The Nuggets, wearing their “5280” uniforms, and Mavericks are in West Group B with the Los Angeles Clippers, New Orleans, Dallas and Houston. The six group winners make the quarterfinals, along with a pair of wild-card teams — the two best second-place finishers from the groups.\n\n\r\n              One of the tiebreakers that will be in play during the tournament is point differential, which may affect whether coaches take their foot off the gas pedal even if up big. Malone said there's an “unwritten rule about respecting the game, respecting your opponent but at the same time, if this is going to help us advance, you have to use everything to your advantage.” \n\n\r\n              Quarterfinal games are Dec. 4 and 5 at higher seeds; the semifinals are Dec. 7 in Las Vegas and the title game is Dec. 9 in Las Vegas as teams compete for the NBA Cup.\n\n\r\n              “One of the coaches said, ‘Hey, man, we’re almost to Vegas,’” Malone cracked. “We've got to win a couple more games.”\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Clippers on Nov. 10 in next In-season Tournament game. Host Charlotte on Sunday in a regular game.\n\n\r\n              Nuggets: Host Clippers on Nov. 14 in next In-season Tournament game. Host Chicago on Saturday in a regular game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996774.9798899
}