{
  "game_id": "0022401058",
  "espn_id": "401705624",
  "date": "Mar 26, 2025",
  "matchup": "PHX vs. BOS",
  "headline": "Porzingis scores 30 points, Celtics rout Suns 132-102 for 7th straight victory",
  "body": "PHOENIX -- — Kristaps Porzingis scored 30 points, Jaylen Brown added 24 and the Boston Celtics blew past the Phoenix Suns 132-102 on Wednesday night for their seventh straight victory.\n\n\r\n              The Suns had a four-game winning streak snapped. Phoenix still has possession of the final spot in the Western Conference play-in tournament with nine regular-season games remaining.\n\n\r\n              Boston took control late in the second quarter, using a 27-6 run to take a 73-54 lead into halftime. The Celtics — playing without injured star Jayson Tatum — hit 10 3-pointers in the first quarter.\n\n\r\n              Porzingis shot 10 of 15 from the field, including 4 of 5 from 3-point range. Al Horford, Jrue Holiday and Derrick White all added 16 points.\n\n\r\n              Kevin Durant led Phoenix with 30 points on 11-of-16 shooting. Devin Booker added 14 points and 10 assists.\n\n\r\n              Tatum missed the game with a sprained left ankle, an injury he suffered Monday against the Kings. Coach Joe Mazzulla is hopeful Tatum won't be out much longer.\n\n\r\n              The Suns were playing without Bradley Beal, who is out with a strained left hamstring.\n\n\r\n              Takeaways\r\n              Celtics: Boston has bulldozed through its past four games, winning all of them by double figures. The Celtics led by 34 points at one point in the third quarter of Wednesday's game and took a 27-point lead into the fourth.\n\n\r\n              Suns: Phoenix has been playing better defense of late, but couldn't contain Boston's 3-point shooting attack. The Suns have a very difficult schedule over the final few weeks — including another game against the Celtics — making their road to the play-in tournament a treacherous one.\n\n\r\n              Key moment\r\n              The Celtics hit seven of their first nine 3-pointers, jumping to a 21-9 lead in a little more than four minutes. They never trailed.\n\n\r\n              Key stat\r\n              The 30-point margin was the Suns' second-most lopsided loss of the season.\n\n\r\n              Up next\r\n              The Celtics play at the Spurs on Saturday. The Suns play at the Timberwolves on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998232.72442
}