{
  "game_id": "0022200475",
  "espn_id": "401468630",
  "date": "Dec 21, 2022",
  "matchup": "LAL @ SAC",
  "headline": "Sabonis leads balanced scoring as Kings beat Lakers 134-120",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 13 points, 21 rebounds and 12 assists to lead the Sacramento Kings to a 134-120 win over the Los Angeles Lakers on Wednesday night.\n\n\r\n              Sabonis recorded his second triple-double of the season to go along with nine straight double-doubles and his NBA-leading 22 this year. \n\n\r\n              “He’s been rebounding the crap out of the ball,” Kings coach Mike Brown said. “Even if he didn’t get stats, how hard that he plays is unbelievable.”\n\n\r\n              All of Sacramento's starters scored in double figures. Rookie Keegan Murray matched his career high with 23 points. Kevin Huerter scored 26 points and Harrison Barnes added 20.\n\n\r\n              “Today especially we just played desperate and I feel like our starting five did that very well,” Murray said. “We just stuck together and went on runs and that was big for us.\"\n\n\r\n              LeBron James scored 31 points and De’Aaron Fox added 22 points and six assists. Fox was ejected with 3:09 left in the game after receiving two technical fouls.\n\n\r\n              “I'm going to show up to work and be ready to go,” James said. “I'm going to lead the guys on the floor when I'm on the floor.”\n\n\r\n              The Kings have consecutive wins over the Lakers in a season for the first time since 2015-16, when Sacramento won all four against Los Angeles. After an 0-4 start to the season, Sacramento has won 17 of 26.\n\n\r\n              The Kings trailed by one after the first quarter and used a 41-point outburst in the second and a 40-point effort in the third to take a lead. Sacramento, which lost its first game back home to Charlotte on Monday after a six-game trip, is in the midst of a six-game homestand to close out 2022. \n\n\r\n              James has scored 30 points or more in five straight games for the Lakers. All five Lakers starters scored in double-digits. Lonnie Walker lV scored 19 points, Dennis Schroder had 18 and Thomas Bryant added 17 points and 10 rebounds.\n\n\r\n              “We have to be more competitive and give more effort,” Lakers coach Darvin Ham said. “We will figure it out. That’s why we have put together a great staff like we have done.”\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Los Angeles ruled out G Russell Westbrook (left foot soreness), G Austin Reaves (right ankle sprain) and F Anthony Davis (right foot) before the game… Darvin Ham was given a technical foul with 7:38 left.\n\n\r\n              Kings: Sacramento went 17 for 31 from the line in a loss to Charlotte earlier this week. The Kings went 21 for 28 (75%) from line Wednesday… Sacramento improved to 5-0 when Murray scores 20 or more points.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host Charlotte on Friday.\n\n\r\n              Kings: Host Washington on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994142.792752
}