{
  "game_id": "0022300721",
  "espn_id": "401585349",
  "date": "Feb 06, 2024",
  "matchup": "MIA vs. ORL",
  "headline": "Butler scores 23, Heat used balanced attack to run past Magic 121-95",
  "body": "MIAMI -- — It took 63 seconds for Jimmy Butler to decide the game.\n\n\r\n              That's all he needed to go on a personal 8-0 run — a stepback 3-pointer from the right corner, an all-alone 3-pointer from the left wing and then a jumper in the lane — midway through the fourth quarter, and the Miami Heat ran away from there for a 121-95 win over the Orlando Magic on Tuesday night.\n\n\r\n              Butler finished with 23 points to lead seven Miami players in double figures, plus added eight rebounds, eight assists and three steals for the Heat — who won for just the second time in their last seven home games. Terry Rozier scored 18 while Tyler Herro and All-Star Bam Adebayo each scored 14 for Miami.\n\n\r\n              “Overall, that's a quality win against a very good opponent,” Heat coach Erik Spoelstra said.\n\n\r\n              The Heat outscored Orlando by 32 points with Adebayo on the floor, the second-highest plus-minus for a Miami player this season.\n\n\r\n              “Bam was a monster,” Spoelstra said.\n\n\r\n              All-Star forward Paolo Banchero scored 23 for Orlando, the 18th consecutive road game in which he’s scored at least 20 points — tying Tracy McGrady for the second-longest such streak in Magic history. McGrady also has the longest streak, a 21-game run in the 2003-04 season.\n\n\r\n              Wendell Carter Jr. scored 15, while Markelle Fultz and Franz Wagner scored 13 apiece for Orlando.\n\n\r\n              The Heat, who had lost eight of their last 10 games, never trailed Tuesday and pulled into a tie with the Magic atop the Southeast Division with identical 27-24 records.\n\n\r\n              But Miami won the season series 3-1, big in case that tiebreaker comes into play for playoff seeding.\n\n\r\n              “I love the fact that it is becoming a rivalry and that we can rekindle that,” Magic coach Jamahl Mosley said.\n\n\r\n              It sure looked like Miami took the rivalry seriously.\n\n\r\n              “We know how important that was,” Rozier said.\n\n\r\n              Miami led by 20 points in the second quarter — only the second time in a span of 38 games that the Heat had such a big lead before halftime. Miami led Charlotte by 24 on Jan. 14; before that, the last Heat lead of 20 or more before halftime was Nov. 18 against Chicago.\n\n\r\n              It all sounded good, for a few minutes anyway.\n\n\r\n              By halftime, the 20-point lead was down to seven; 53-33 became 56-49 in a flash. Orlando closed the half on a 16-3 run, Banchero leading the way with six of those points, and Miami missed six of its final seven shots.\n\n\r\n              The Magic got within five early in the third, but the Heat ran away in the rest of the period and took a 96-75 edge into the fourth. The closest Orlando got in the fourth was 10, and that's when Butler scored his eight consecutive points to put the game away.\n\n\r\n              “They wanted it more, it seemed like,” Banchero said.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host San Antonio on Thursday night.\n\n\r\n              Heat: Host San Antonio on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995349.6627
}