{
  "game_id": "0022400082",
  "espn_id": "401704648",
  "date": "Oct 25, 2024",
  "matchup": "HOU vs. MEM",
  "headline": "Jalen Green leads the way with 22 points in Houston's 128-108 win over Memphis",
  "body": "HOUSTON -- — Jalen Green scored 22 points and six other Houston players scored in double figures in the Rockets' 128-108 win over the Memphis Grizzlies on Friday night. \n\n\r\n              Dillon Brooks added 18, Alperen Sengun and Fred VanVleet both had 16, Jabari Smith Jr. had 14 points and 16 rebounds, Tari Eason had 13 and Cam Whitmore had 11.\n\n\r\n              Ja Morant scored 24 on 8-of-17 shooting to lead Memphis. Desmond Bane added 17 points, and Scottie Pippen Jr. and Zach Edey both had 13.\n\n\r\n              The Rockets trailed 65-59 at halftime but outscored Memphis 39-18 in the third quarter to take control of the game.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis was outrebounded 64-43. Edey, the Grizzlies 7-foot-4 rookie, led the way with nine rebounds. The Grizzlies were missing 6-11 center Jaren Jackson Jr., who was sidelined with a left hamstring strain.\n\n\r\n              Rockets: Houston avoided a third straight 0-2 start to the season as its young core continued to show progress and resilience that wasn’t common in prior years. The Rockets have also shown improvement from the 3-point line. They made 17 of 43 for 39.5% on Friday, including 2 of 4 from rookie Reed Sheppard.\n\n\r\n              Key moment\r\n              The Rockets went on a 17-0 run in the middle of the third quarter, turning a nine-point deficit into an eight-point lead that they never relinquished. Memphis went on a 4:29 scoring drought during that stretch.\n\n\r\n              Key stat\r\n              The Rockets scored 29 points off Memphis’ 19 turnovers, compared with just 13 points that the Grizzlies scored off Houston’s 19 turnovers.\n\n\r\n              Up next\r\n              The Grizzlies host Orlando on Saturday night.\n\n\r\n              The Rockets visit San Antonio on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997423.637203
}