{
  "game_id": "0022400672",
  "espn_id": "401705238",
  "date": "Jan 29, 2025",
  "matchup": "MIN @ PHX",
  "headline": "Anthony Edwards scores 33 points as Timberwolves beat Suns 121-113 for 4th straight win",
  "body": "PHOENIX -- — Anthony Edwards scored 33 points, Julius Randle added 28 and the Minnesota Timberwolves beat the Phoenix Suns 121-113 on Wednesday night for their fourth straight victory.\n\n\r\n              The Timberwolves trailed for much of the night, but rallied near the end of the third quarter for an 81-77 advantage. Nickeil Alexander-Walker made three 3-pointers early in the fourth to help Minnesota push to a 10-point lead. \n\n\r\n              Alexander-Walker finished with 23 points, making 5 of 10 shots behind the arc. The Timberwolves — who swept the Suns out of the playoffs last season in the first round — shot 56% from the field.\n\n\r\n              Phoenix had its three-game winning streak snapped. Kevin Durant led the team with 33 points while Devin Booker added 28 and Bradley Beal had 17. The Suns' offense stalled in the third quarter with just 18 points on 7 of 22 shooting.\n\n\r\n              Minnesota coach Chris Finch was ejected in the third quarter after receiving a second technical foul. Both were for arguing with officials. Forward Jaden McDaniels was also ejected in the final minute after a brief altercation with Booker.\n\n\r\n              The Suns led 59-55 advantage at half, with Booker scoring 18 points on 7-of-10 shooting.\n\n\r\n              Takeaways\r\n              Timberwolves: It was a nice come-from-behind win after Minnesota looked sluggish for most of the first half. The Timberwolves were playing without forward Naz Reid (illness) and guard Donte DiVincenzo (big toe sprain).\n\n\r\n              Suns: Phoenix has played better over the past few weeks, but Wednesday's game was a reversion to bad habits. The Suns had 16 turnovers.\n\n\r\n              Key moment\r\n              Randle stole a bad pass from Booker and passed to Edwards for a one-handed jam that made it 100-86 with 6:56 left.\n\n\r\n              Key stat\r\n              Alexander-Walker scored 11 points in the fourth quarter.\n\n\r\n              Up next\r\n              Timberwolves are at Utah on Thursday night. The Suns are Golden State on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998087.1065931
}