{
  "game_id": "0022200721",
  "espn_id": "401468876",
  "date": "Jan 25, 2023",
  "matchup": "BKN @ PHI",
  "headline": "James Harden, Tyrese Maxey lead 76ers past Nets, 137-133",
  "body": "PHILADELPHIA -- — James Harden hit two 3-pointers and had a driving layup in the final four minutes against his former Brooklyn teammates and the Philadelphia 76ers stretched their winning streak to six games, outscoring the Nets 137-133 on Wednesday night.\n\n\r\n              Tyrese Maxey led the 76ers with 27 points, and Joel Embiid had 26. Harden added 23, and Philadelphia was 35 of 36 from the foul line.\n\n\r\n              “I don't care about all that stuff,” Harden said when asked if it meant more to score against his former team.\n\n\r\n              Seth Curry had a season-high 32 points for Brooklyn. Kyrie Irving had 30 for the Nets, who have lost five of the last seven games without Kevin Durant. The Nets lost despite shooting 64.5% from the floor.\n\n\r\n              The game was the first regular-season matchup between Embiid and former teammate Ben Simmons since a February 2022 trade that sent Simmons to Brooklyn for Harden. Simmons missed the rest of the 2022 season with various injuries, then Embiid was injured and missed the Sixers' win in Simmons' Philadelphia return Nov. 22.\n\n\r\n              The night started with Simmons matched up on the defensive end against Embiid, who decided to change from his traditional shot facing the basket and muscle down low. Through the night, there were exchanges of words and stares between the two — including right before the start of the second half. It carried through the rest of the rosters, with six technical fouls called. \n\n\r\n              “It didn't matter to me, I always try to play whomever is front of me with the same aggression and trying to score the ball,” said Embiid, who was 6 for 18 from the floor but 13 for 13 from the line. “I missed a lot of shots today, which hasn't happened in a while. But I'm happy we got the win.”\n\n\r\n              The Philadelphia crowd reacted every move that Simmons made, often with boos and derisive chants. Simmons finished 12 points, five rebounds and five assists, but spent most of the critical fourth quarter moments on the bench.\n\n\r\n              “The last time was an eight,” Simmons said of the crowd reaction. \"If we come here for the playoffs, it will probably be a 10.”\n\n\r\n              Brooklyn would start to creep into Philadelphia's 17-point lead in the second half. Simmons scored 10 points in the third quarter to keep the Nets close. Curry and Irving, however, would serve as the main catalyst in an 18-4 run that allowed the Nets to tie the game at 120 with four minutes left.\n\n\r\n              “We had to play perfect basketball to come back in a game like that,” said Curry, who is Sixers coach Doc Rivers' son-in-law. “We made a run at it, but we just couldn't get us over the hump. The first three quarters of the game set us back.”\n\n\r\n              Harden took over after that, with a pair of step-back 3s and a bounce pass to Tobias Harris that allowed Philadelphia to get some breathing room. \n\n\r\n              Maxey — who has been Philadelphia's sixth man since returning from a broken foot on Dec. 30 — had 16 of his 27 points in the first half.\n\n\r\n              “We'll take the win, but that's a good test for us,” Rivers said. “We have to be better at handling our emotions, but you don't want to be emotional. I thought we were caught up in that tonight.”\n\n\r\n              TIP INS\n\n\r\n              Nets: Durant is out with a right MCL sprain. He was active on social media, making comments about trash talk between Embiid and Montrezl Harrell and complaining when Embiid made a D-generation X crotch chop after a three-point play. \n\n\r\n              76ers: The first quarter was the first time this season in the NBA that both teams had over 40 points. ... On Dec. 5, the Sixers were 12-12 after losing in Houston. Since then, they have gone 19-4 and vaulted from the play-in tournament to the second seed in the East.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Detroit on Thursday night.\n\n\r\n              76ers: Host Denver on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994869.963949
}