{
  "game_id": "0021900376",
  "espn_id": "401161018",
  "date": "Dec 13, 2019",
  "matchup": "MEM vs. MIL",
  "headline": "Antetokounmpo has 37 in Memphis, Bucks run win streak to 17",
  "body": "MEMPHIS, Tenn. --  After sitting out Milwaukee’s previous game with right quad tendon soreness, Giannis Antetokounmpo had plenty of energy to lead a fourth-quarter burst that kept the Bucks’ winning streak alive.\n\nAntetokounmpo scored 17 of his 37 points in the final period to help Milwaukee pull away for its 17th straight victory, 127-114 over the Memphis Grizzlies on Friday night. Antetokounmpo helped the Bucks outscore Memphis 37-19 in the fourth to pull away.\n\n“I thought he was fabulous,” Bucks coach Mike Budenholzer said of the league’s reigning MVP. “He makes at least one, maybe two 3s, finishing at the basket, and defensively, I think he is doing good things.\n\n“So, he was just outstanding in the fourth quarter.”\n\nThe Bucks overcame Jaren Jackson Jr.’s career-high 43 points. He scored 26 in the third quarter, converting 7 of 11 3-pointers in the third alone, to give Memphis a 95-90 lead heading into the fourth.\n\n“There hasn’t been anything like that,” Jackson said of his third-quarter offense, “because everything for a minute was going in for me. I felt just like a crazy rhythm and the basket got bigger.\"\n\nBut the Grizzlies couldn’t hold on as Antetokounmpo almost outscored Memphis in the fourth on his own. The Bucks improved to 23-3, keeping pace with the Los Angeles Lakers for the best in the league. The Bucks have not lost since Nov. 8 at Utah.\n\n“We were able to keep our composure, stay together, play together and execute on offense, defend even harder,” said Antetokounmpo, who missed his first game of the season Wednesday night against New Orleans. “It says a lot about this team. It says a lot about how good this team can be, and how good this team is.”\n\nKhris Middleton added 26 points for the Bucks, while Eric Bledsoe finished with 12 before leaving in the third quarter with an injury. The 17-game winning streak is second-longest in franchise history, trailing only a 20-game run in the 1970-71 season.\n\nDillon Brooks had 19 points for Memphis, while Jae Crowder had 15 points.\n\nMemphis played without star rookie Ja Morant, who took the night off for injury maintenance on a balky back.\n\n“It took a heck of a fourth quarter from the Bucks to come away with the victory,” said Memphis coach Taylor Jenkins, a member of the Bucks staff before taking over the Grizzlies this season.\n\nTIP-INS\n\nBucks: Bledsoe left with a right shin contusion. … Antetokounmpo has reached double figures in all 25 games he’s played and has 23 double-doubles. ... D.J. Wilson had 11 points, shooting 5 for 7. … Brook Lopez had 10 points and 10 rebounds.\n\nGrizzlies: Jackson’s 26-point third quarter was a franchise record. The previous mark of 22 points was shared by Troy Daniels and Greg Anthony. … Rookie Brandon Clarke also was out because of a left oblique injury. Clarke ranks fifth in the league – and first among rookies -- in field goal percentage at 63.8% … Jackson has made at least two 3-pointers in seven straight games. He also recorded a block on the night running his string to nine straight game with at least one 3-pointer and one block.\n\nSPEAKING FOR JENKINS\n\nJenkins naturally got a clear endorsement from Budenholzer in the Memphis coach’s first season. “I couldn’t be more excited for Taylor,” Budenholzer said before the game. “I am missing him terribly. … He’s incredibly talented and incredibly gifted. Hopefully, through all of his experiences, he is prepared.”\n\nBut the game also was like watching mirror images of the two teams. “We knew what they were doing, and they knew what we were doing, but it is so hard to stop,” Antetokounmpo said. “They were running our play -- actually their plays -- but it was the same as our plays. … It’s fun playing against (Jenkins).”\n\nFEELING IT\n\nJackson made seven of his first nine attempts behind the arc in the third. As shots started falling in the third quarter, Jackson seemed to go into heat-check, converting shots deeper and deeper on the floor. One from straight away even banked in. That was when Jackson realized he was having a big game. “The banker was just like ‘Thank you for the backboard being there’ because otherwise, I would’ve airballed it. That one was cool.”\n\nUP NEXT\n\nBucks: Face the Cleveland Cavaliers at home on Saturday night in second game of a back-to-back.\n\nGrizzlies: Play the Wizards on Saturday night in the second game of a home back-to-back.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995739.418108
}