{
  "game_id": "0021600894",
  "espn_id": "400900300",
  "date": "Feb 28, 2017",
  "matchup": "LAL vs. CHA",
  "headline": "Kemba Walker scores 30, Hornets rally past Lakers, 109-104",
  "body": "LOS ANGELES --  Way out in California, the Charlotte Hornets have discovered their best form in several weeks.\n\nKemba Walker scored 30 points and hit the go-ahead 3-pointer with 1:55 to play, and the Hornets rallied late for a 109-104 victory over the struggling Los Angeles Lakers on Tuesday night.\n\nFrank Kaminsky had 24 points and 12 rebounds for the Hornets, who won for just the third time in 16 games.\n\nCharlotte has won two of three games for the first time since mid-January. During a four-day stretch in the Golden State, the Hornets beat the Sacramento Kings and lost in overtime to the Los Angeles Clippers before holding off the Lakers.\n\n\"It was a pretty important win for us,\" Walker said. \"We did a lot of things down the stretch that we can use later in the season.\"\n\nWalker and Marvin Williams hit key 3-pointers in the final minutes as the Hornets held off the Lakers with poise and resilience, two qualities that have been lacking earlier in their up-and-down season.\n\nAfter Jordan Clarkson put the Lakers ahead on a driving basket with 2:23 to play, Walker answered with his fifth 3-pointer of the night. Williams then hit his fourth 3-pointer with the shot clock winding down to put Charlotte up 103-98 with 1:08 left.\n\nWalker ended up with 11 points in the fourth quarter as the Hornets hung on to improve to 2/3 during their longest stretch away from home this season. Charlotte played one road game before the All-Star break and then embarked on a six-game trip, which ends Saturday at Denver.\n\n\"Our biggest problem has been fourth-quarter defense, and tonight it was better,\" Charlotte coach Steve Clifford said. \"We were down six in the fourth, we fought back, and we made the plays. It was a good road win.\"\n\nTIP-INS\n\nHornets: Clifford, an assistant coach on the Lakers' last winning team, earned his 150th victory, trailing only Allan Bristow and Paul Silas in franchise history. ... Williams played through a right shoulder strain. ... Walker converted a four-point play in the first quarter to give Charlotte its first lead.\n\nLakers: G David Nwaba played six minutes of the fourth quarter in his NBA debut, stepping in a few hours after getting a call-up from the Lakers' D-League affiliate. The graduate of nearby University High School earned his first NBA shot with strong defensive play, coach Luke Walton said. ... Timofey Mozgov and Luol Deng didn't play for the Lakers. The free agents agreed to four-year contracts worth a combined $136 million last summer.\n\nDOWN THE STRETCH\n\nD'Angelo Russell scored 15 of his 23 points in the first half for the Lakers, but also hit back-to-back 3-pointers in the final minute to make things interesting. Los Angeles hadn't played a close game since trading top scorer Lou Williams to Houston last week, and coach Luke Walton was eager to see how Russell and his young core would handle a pressure situation without Williams' scoring.\n\n\"It's fun to watch those guys out there trying to get to the next level, and I think we'll get there,\" Walton said.\n\nClarkson added 16 points for the Lakers, while Nick Young scored all of his 15 on 3-pointers. Russell also hit five 3-pointers and added nine assists.\n\nZEALOUS ZELLER\n\nCody Zeller returned from a six-game absence with soreness in his quadriceps to get six points in 19 minutes. The Charlotte big man wants more of both. \"I felt good out there, so hopefully the minutes restriction doesn't last long,\" he said.\n\nLOSING LAKERS\n\nThe Lakers (19-42) have lost five straight and 16 of 20. They also clinched four consecutive losing seasons for the first time since 1961, the franchise's first year on the West Coast. Los Angeles had only six losing seasons in the ensuing 52 years before this current four-year stretch of misery.\n\nRIVALRY RULERS\n\nThe Hornets have won their last five meetings with the Lakers.\n\nRANDLE'S EFFORT\n\nJulius Randle had 23 points, 18 rebounds and six assists. The power forward was a bright spot for the Lakers with an energetic performance from the opening tip -- although Walton would like to see that more often.\n\n\"That's the longest period of time he's played that hard all season long,\" Walton said.\n\nUP NEXT\n\nHornets: At Suns on Thursday.\n\nLakers: Host Celtics on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995377.81298
}