{
  "game_id": "0021500936",
  "espn_id": "400828823",
  "date": "Mar 06, 2016",
  "matchup": "HOU @ TOR",
  "headline": "Harden, Rockets end Raptors' home win streak, 113-107",
  "body": "TORONTO --  For the Houston Rockets, sitting in the eighth and final Western Conference playoff berth, this wasn't so much a nice win as a must-win.\n\n\"From here on out there's 20 games left, so each and every game counts, so we've got to find a way to come away with wins,\" James Harden said.\n\nHarden had 40 points and 14 assists, and the Rockets beat Toronto 113-107 on Sunday night to end the Raptors' franchise-record, 12-game home winning streak.\n\nCorey Brewer added 23 points off the bench, while Dwight Howard chipped in with 21 points and 11 rebounds before fouling out in the fourth quarter.\n\n\"I think we just locked in defensively,\" he said. \"As long as we can do that, communicate on defense, and on offense move and screen for each other, we'll put ourselves in position to win every game.\"\n\nThe victory, Houston's first in Canada since the 2006-07 season, was also Toronto's first loss at the Air Canada Centre since Jan. 3 against the Chicago Bulls.\n\nFor Houston coach J.B. Bickerstaff, it's the kind of win that his team can build upon, and it was inspired by a greater defensive focus after halftime.\n\n\"The second half was key,\" he said. \"After giving up (a) 30-point first quarter (and 31-point) second quarter, the third and fourth quarters we held them to the low 20s and that's a sign of who we can be.\"\n\nHaving led from just before the seven-minute mark in the first quarter until Trevor Ariza's 3-point shot with 4:43 to play, Toronto coach Dwane Casey was upset at his team's inability to close out leads, a bad habit that he feels is going to continually undermine his team.\n\n\"That's been our weakness all year,\" he said. \"I've said that millions of times. We've luckily won some of these games, but I've always said it's going to come back and bite us.\"\n\nLuis Scola led the way for the Raptors with 21 points, one shy of his season high, with DeMar DeRozan adding 19. DeRozan's efforts were more focused on slowing down Harden, a tough task for any defender in the NBA.\n\n\"It's tough,\" he said. \"You have to react to everything he does offensively. Whenever he's driving, whenever he's being aggressive you have to try and slow him down.\"\n\nAfter seeing the Rockets start slowly, Bickerstaff took it upon himself to try and put some jump into his team. With Howard called for a flagrant offensive foul on Kyle Lowry in the second quarter, Bickerstaff picked up a technical foul for arguing with the officials.\n\nFor the interim Rockets coach, it was an opportunity to reinforce to his team, down by 13 at the time, that quitting was not an option.\n\n\"Part of it was reaction. Part of it was just to make their awareness that we're going to fight,\" he said. \"It doesn't matter who it is or the situation is, we're not going to give in.\"\n\nFEAR THE BEARD\n\nSunday's win was Harden's fourth game of the season in which he has scored at least 40 points and registered 10 or more assists. The rest of the NBA has four such games combined.\n\nHAPPY TO COMPETE\n\nBy finishing seventh or eighth in the West, the Rockets would likely face a first-round playoff matchup against either the Golden State Warriors or the San Antonio Spurs, both winning at historic clips. But neither matchup overly worries Bickerstaff. \"In a seven-game series, the group that we have, the talent that we have, the only thing that matters is winning,\" he said.  \"There's no doubt of what we're capable of, we've just got to get ourselves to that spot and that's been a struggle.\"\n\nTIP-INS\n\nRockets: Harden's average of 29 points in his five career games in Toronto is his highest in any opposing venue. ... After going 23-7 against Eastern Conference teams in 2014-15, Houston is just 9-13 against East teams this season. ... Houston is now 7-8 in the second game of back-to-back games this season, with the team playing a league-high 20 such games.\n\nRaptors: The loss was the Raptors' first against a Southwest Division team this season (5-1). . Casey received his Eastern Conference coach of the month award for January before the game during an on-court presentation. . With his season-high 38 points in Friday's win over Portland, DeRozan joined Harden and Golden State's Stephen Curry, as the only players from the 2009 NBA draft class to reach 9,000 career points.\n\nUP NEXT\n\nRockets: Visit Philadelphia on Wednesday.\n\nRaptors: Host Brooklyn on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994615.800338
}