{
  "game_id": "0022100073",
  "espn_id": "401359897",
  "date": "Oct 29, 2021",
  "matchup": "MIA vs. CHA",
  "headline": "Banner night for Heat, who hang on and top Hornets 114-99",
  "body": "MIAMI -- — Miami was leading the NBA in scoring defense, Charlotte was leading in scoring offense.\n\n\r\n                    Defense won.\n\n\r\n                    Jimmy Butler scored 32 points, Bam Adebayo had 26 points and 19 rebounds on the night his Olympic gold-medalist banner was unveiled and the Heat held on late to beat the Hornets 114-99 on Friday night.\n\n\r\n                    Tyler Herro scored 26 points off the bench for Miami, which wasted most of a 26-point first-half lead. Duncan Robinson added 10 for Miami. The Heat outrebounded Charlotte 60-37, and held the Hornets to 39% shooting.\n\n\r\n                    “The IQ level of this team is very high,” Heat coach Erik Spoelstra said. “We have experienced, savvy guys, but guys who can read situations in real time. That matters in this league.”\n\n\r\n                    Gordon Hayward scored 23 points and Miles Bridges had 22 for Charlotte. Kelly Oubre Jr. scored 17 points and Cody Martin had 15 for the Hornets, while LaMelo Ball struggled through a 2-for-14 night from the floor.\n\n\r\n                    “It's one of 82. We'll learn from it. We'll respond,\" Hornets coach James Borrego said. “I saw a lot of fight tonight.\"\n\n\r\n                    Miami was 190-1 over the last 25 seasons in games where it led by at least 26 points. The only 26-point lead that was blown by the Heat in that span was one at Boston in a regular-season finale in April 2016.\n\n\r\n                    The record is 191-1 now, though it didn't come easily.\n\n\r\n                    “I thought at the end of the half, we lost our intensity,\" Adebayo said. “And then we picked it up again in the second half.\"\n\n\r\n                    Charlotte whittled what had been a 26-point hole down to just an 84-75 deficit going into the fourth, and then clawed within six points early in the fourth. But a 7-0 Heat spurt made it 95-82, and Miami kept control the rest of the way.\n\n\r\n                    “I thought the fourth quarter was very good,\" Spoelstra said.\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: The Heat left a press-row seat, decorated with a bouquet of flowers, open in memory of longtime Hornets beat writer Rick Bonnell of the Charlotte Observer. Bonnell died in June. ... In no surprise, the Hornets exercised their third-year option on Ball and their fourth-year option on P.J. Washington.\n\n\r\n                    Heat: Robinson has at least one 3-pointer in 53 consecutive games, four shy of matching his career-best streak — which is also the team record. But he was just 2 for 11 from beyond the arc Friday, though Spoelstra insists he wants Robinson to shoot even more. ... DJ Khaled was at the game, celebrating his son Asahd’s fifth birthday. Asahd got serenaded by some in the crowd at halftime. ... Miami had been 19-for-19 from the line or better twice in its first 33 seasons. It has now gone 19-for-19 twice in the span of five days, first on Monday against Orlando and again Friday.\n\n\r\n                    LOWRY'S ROLE\n\n\r\n                    Heat point guard Kyle Lowry is averaging 5.8 points and 5.8 assists through his first four games, on 30% shooting. Spoelstra looks at it differently: Miami is 4-0 when Lowry plays, 0-1 when he doesn't. “Remarkable quarterback play right now,\" Spoelstra said.\n\n\r\n                    FASTEST TO 100\n\n\r\n                    Herro is up to 110 points in the season’s first five games. He’s the first Heat player to score at least 100 off the bench so quickly into a season; Goran Dragic (2019-20) and Tyler Johnson (2016-17) both got there in the seventh game of a season.\n\n\r\n                    DOWN DOUBLES, AGAIN\n\n\r\n                    Charlotte, despite its 4-2 start, hasn’t made matters particularly easy on itself in the first six games. The Hornets have trailed by double digits in every game this season, the 26-point deficit against Miami on Friday being the largest. They’ve overcome deficits of 23 (vs. Indiana), 12 (vs. Orlando), 11 (vs. Cleveland) and 10 (vs. Brooklyn) to win already this season.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host Portland on Sunday.\n\n\r\n                    Heat: Visit Memphis on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764992684.150793
}