{
  "game_id": "0021600463",
  "espn_id": "400899905",
  "date": "Dec 26, 2016",
  "matchup": "CHA @ BKN",
  "headline": "Randy Foye's 3 gives Nets 120-118 victory over Hornets",
  "body": "NEW YORK --  Randy Foye might not even have been in the game if not for Jeremy Lin's injury.\n\nThe Brooklyn Nets were lucky he was.\n\nFoye made a 3-pointer to beat the buzzer and give the Nets a 120-118 victory over the Charlotte Hornets on Monday night.\n\nThe Nets overcame the loss of Lin and a 14-point deficit in the third quarter to stop a five-game losing streak. Foye played a little with Lin in the first half, then was on the floor the entire fourth quarter after the point guard exited.\n\n\"We were already playing together in the second quarter, but when he went out, the next man had to step up,\" Foye said.\n\nBojan Bogdanovic led Brooklyn with 26 points, Sean Kilpatrick had 23 and Brook Lopez scored 10 of his 21 in the fourth.\n\nNicolas Batum had 24 points and Jeremy Lamb added 17 for Charlotte, but the Hornets had their three-game winning streak snapped.\n\n\"We kind of relaxed for a little while,\" center Cody Zeller said. \"We can't play in spurts like we did tonight, like we have early on in the season.\"\n\nLin strained his left hamstring in the third, the same injury that forced him to miss 17 games earlier this season.\n\nLopez scored 10 straight Brooklyn points and then the Nets went outside, with Kilpatrick making a 3-pointer with 1:36 left and Bogdanovic adding another 30 seconds later to make it 117-113.\n\nBut Batum nailed a 3, and after Bogdanovic missed, Kemba Walker drove to the basket. His shot was blocked, but Zeller followed it up to put Charlotte ahead 118-117.\n\nThe Nets called timeout and inbounded from the sideline. Foye caught the pass on a play he said was supposed to be for Lopez -- and hit the second game-winner of his career.\n\nLin landed awkwardly and limped to the line after he was fouled on a drive to the basket early in the third quarter. He made the free throws to start a 15-0 run that erased a 14-point deficit.\n\nBut he didn't run back down court after missing a reverse layup with about eight minutes left in the period, instead walking toward the bench to say he needed to come out. Bogdanovic's three-point play on the Nets' next possession culminated the run and gave them a 69-68 lead, but Charlotte quickly went back ahead and stayed there until Lopez converted his second straight three-point play to tie it at 98 with 7:40 remaining.\n\nTIP-INS\n\nHornets: Walker and Zeller each finished with 15 points. ... G Marco Belinelli missed his first game of the season after spraining his left ankle Friday in a victory over Chicago.\n\nNets: F Joe Harris made his first start with the Nets and second of his career but didn't do much with his chance, going scoreless and taking just two shots in 12 minutes. ... Brooklyn ended an 11-game losing streak against Eastern Conference teams.\n\nWALKER'S WOES\n\nOn the day the Hornets launched their push to get Walker to the All-Star Game at www.walkercharlotteranger.com, the point guard was scoreless in the fourth quarter and 1 for 8 in the second half.\n\n\"It happens. The ball just didn't drop,\" he said. \"I've got to be better for my team offensively because they depend on me for that, but unfortunately the ball just didn't drop.\"\n\nHEALTHY, THEN HURT AGAIN\n\nThe Nets had their full roster healthy and available for the first time all season before Lin's injury.\n\n\"With guys in and out, we've been trying to find the right lineups and right combinations, and you do need a certain -- statistically and from a coaching standpoint -- you need a certain sample size to see a group together to have more of an idea,\" coach Kenny Atkinson said before the game. \"So we're still trying to grasp what our best lineups are and when to put in the best lineups, just trying to figure that whole puzzle out right now.\"\n\nUP NEXT\n\nHornets: Visit Orlando on Wednesday. The Hornets have won the last four meetings, including a 109-88 victory this month.\n\nNets: Visit Chicago on Wednesday. The Bulls hammered the Nets by 30 in Brooklyn on Halloween.",
  "source": "espn_api",
  "crawled_at": 1764995518.166288
}