{
  "game_id": "0022301127",
  "espn_id": "401585755",
  "date": "Apr 06, 2024",
  "matchup": "LAL vs. CLE",
  "headline": "Russell, James help Lakers win 4th straight, move into 8th place with 116-97 victory over Cavaliers",
  "body": "LOS ANGELES -- — D’Angelo Russell scored 28 points, LeBron James added 24 and the Los Angeles Lakers extended their winning streak to four with a 116-97 victory over the Cleveland Cavaliers on Saturday, moving into eighth place in the Western Conference.\n\n\r\n              Anthony Davis added 22 points and 13 rebounds as the Lakers improved to 45-33 with their ninth win in 10 games.\n\n\r\n              They still are in position to land in the play-in tournament, but finishing seventh or eighth means they would only need to win one game to earn a playoff spot.\n\n\r\n              “We’re very confident in our ballclub,\" Davis said. \"We laugh about like, oh, winning nine out of 10, you know, 10 out of 11, whatever. and we’re not gaining anywhere. That's how good the West is.” \n\n\r\n              It is the first time since Dec. 29 the Lakers have been eighth in the conference. With four regular-season games remaining though, coach Darvin Ham isn't focused on seeding but on the Lakers having momentum going into the postseason.\n\n\r\n              “Just take care of us. Continue to look for ways to get better individually and collectively. Everything else will take of itself,” he said. \"We’ll fall exactly in the spot we’re supposed to fall, but the key is for us to be playing at a high level on both sides of the ball.’\n\n\r\n              Darius Garland scored 26 points for Cleveland and Caris LeVert had 21 off the bench. The Cavaliers (46-32) remained in third place in the East but have dropped two straight and three of their last four.\n\n\r\n              “I thought we did some really good things in spurts. We just couldn’t sustain it enough to come out with a win,” coach J.B. Bickerstaff said. “The turnovers kind of bit us in the butt. We also forced turnovers and didn't convert on them.”\n\n\r\n              Russell had six 3-pointers, including five in the first half, when his 23 points helped the Lakers take a nine-point lead.\n\n\r\n              James improved to 18-4 against his former team, where he played for 11 seasons in two different stints. He had a pair of alley-oop dunks against the team he led to its lone NBA title in 2016. \n\n\r\n              Davis scored 11 points in the third quarter, including nine during a 19-0 run. Cleveland led 71-67 before the Lakers regained control during a four-minute span.\n\n\r\n              “Once we defend we get stops and hold teams to one shot, what we do offensively is through the roof. It's hard to contain us,” Ham said. \n\n\r\n              Los Angeles jumped out to a 16-point lead early in the second quarter with a 24-4 run before Cleveland got it down to 65-56 at halftime.\n\n\r\n              Garland, who tied a career high with five steals, had a pair of 3-pointers as the Cavaliers began the second half with an 11-2 spurt to tie it at 67-all.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Remain in Los Angeles to face the Clippers on Sunday afternoon.\n\n\r\n              Lakers: Host the Minnesota Timberwolves Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995475.405555
}