{
  "game_id": "0021601097",
  "espn_id": "400900492",
  "date": "Mar 27, 2017",
  "matchup": "ORL @ TOR",
  "headline": "DeRozan scores 36, Raptors top Magic 131-112 for 6th in row",
  "body": "TORONTO --  DeMar DeRozan started his new work week the way he finished the old one, and the result was a sixth straight victory for the Toronto Raptors.\n\nDeRozan, selected Eastern Conference player of the week earlier in the day, scored 36 points as the Raptors defeated the Orlando Magic 131-112 on Monday night.\n\n\"We can't get comfortable just because we won a few games,\" said DeRozan, who had consecutive 40-point games among his three outings last week. \"Even tonight, we could have done a lot better. We gave up too many points.\n\n\"We've still got to stay focused on the defensive end and let that win us games and not so much rely on scoring 130 points.\"\n\nCory Joseph had his first career double-double with 15 points and a career-high 13 assists for the Raptors (45-29). Jonas Valanciunas added 17 points and nine rebounds.\n\nElfrid Payton had 22 points and nine assists for Orlando (27-47). Evan Fournier added 20 points, and Nikola Vucevic had 12 points and 15 rebounds.\n\nIt was the first game between the teams since the Raptors traded Terrence Ross to the Magic for Serge Ibaka in February. Ross finished with 17 points, while Ibaka had 16 points and seven rebounds.\n\n\"It was fun, besides the loss,\" Ross said of his return to Toronto, which included a video tribute on the scoreboard. \"It was good seeing everybody appreciate what I did over the years.\n\n\"I didn't think people would respond the way they did ,so it made me feel like I was back at home.\"\n\nThe Raptors took a 99-89 lead into the fourth quarter.\n\nDeRozan's basket gave Toronto a 19-point lead with 8:15 to go in the period but the Magic, winners of seven games this season after falling behind by double digits, fought back.\n\nBismack Biyombo made a pair of free throws to cut the Toronto lead to five with 12 seconds to go in the quarter.\n\nBut after DeRozan hit a jumper, Delon Wright stole the inbounds pass and sank a 3-pointer at the buzzer to give Toronto its double-digit lead back going into the fourth.\n\n\"That's a momentum killer,\" Magic coach Frank Vogel said. \"But credit the Raptors, they played a terrific basketball game.\"\n\nToronto shot a season-best 59 percent from the field, including 10 for 15 from beyond the arc.\n\nThe Magic shot a solid 49 percent but were just 4 of 20 on 3s.\n\n\"It was brother-in-law basketball,\" Raptors coach Dwane Casey said. \"We'll take the win but we can't be happy with our defensive performance, trading baskets like that.\"\n\nAfter four ties and seven lead changes in the game's first 15 minutes, the Raptors took charge over the final nine minutes of the second quarter to take a 73-57 lead into halftime.\n\nDeRozan was 7 for 10 from the field in the first quarter and Toronto shot 63 percent.\n\n\"They made tough shots -- fall-aways, fade-aways,\" Orlando's Aaron Gordon said. \"They were moving the ball very well and they executed.\"\n\nTIP-INS\n\nMagic: Ross received a standing ovation after a tribute commemorating his 4 1/2 seasons in Toronto was played on the scoreboard during the first timeout. ... Orlando has hit a 3 in 812 consecutive games, the fifth-longest active streak in the NBA. ... The Magic had a 66-58 edge in the paint. ... Orlando dropped to 2-18 this season when its opponent shoots better than 50 percent from the field. ... Payton has scored in double figures in each of the last seven games.\n\nRaptors: DeRozan's conference player of the week award was his fourth of the season. He averaged a league-best 33.3 points in three games last week. ... Valanciunas pulled down his 3,000th rebound in the second quarter, second to Chris Bosh (4,776) on Toronto's career list. ... The 73 points were the most the Raptors have scored in the first half this season. ... Toronto fell one point short of the franchise mark for a non-overtime game, set earlier this season against Brooklyn. ... Joseph also grabbed six rebounds.\n\nHE SAID IT\n\n\"The guys were knocking down shots. Anyone I was passing to was hitting.\" -- Joseph on his 13 assists.\n\nUP NEXT\n\nMagic: Orlando returns home to face the Oklahoma City Thunder on Wednesday. The Magic won the only previous meeting this season, 119-117 on the road in November.\n\nRaptors: Toronto hosts Charlotte on Wednesday. Toronto is 2-1 in the season series, including a 90-85 victory in February as the Raptors outscored the Hornets 32-10 in the fourth quarter.",
  "source": "espn_api",
  "crawled_at": 1764995814.089545
}