{
  "game_id": "0022401156",
  "espn_id": "401705722",
  "date": "Apr 09, 2025",
  "matchup": "ORL vs. BOS",
  "headline": "Magic clinch 7th spot in Eastern Conference with 96-76 win over depleted Celtics",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 23 points, Cole Anthony came off the bench with 18 points and the Orlando Magic beat the Boston Celtics 96-76 on Wednesday night to clinch seventh place in the Eastern Conference and the top spot in the play-in tournament.\n\n\r\n              Baylor Scheierman and Payton Pritchard scored 15 points each to lead the Celtics, who did not use their top six players and made 7 of 40 3-point shots.\n\n\r\n              Jayson Tatum, Jaylen Brown, Kristaps Porzingis, Derrick White, Jrue Holiday and Al Horford did not play for the Celtics.\n\n\r\n              Paolo Banchero had 15 points and six assists for the Magic. It was Wagner's 12th straight game of scoring 20 or more points.\n\n\r\n              Takeaways\r\n              Celtics: Are locked into the No. 2 spot in the Eastern Conference playoffs and played a day after an overtime win against New York. The 76 points was a season-low for Boston, well under the previous low of 92 points they scored at Oklahoma City on Jan. 5.\n\n\r\n              Magic: Winning for the eighth time in 10 games, the Magic qualified for a home game in the first round of the play-in tournament against an opponent to be determined. A win in that game would earn the seventh seed in the playoffs and a first-round series against the Celtics. The Magic also clinched the Southeast Division. Guard Kentavious Caldwell-Pope did not play in the second half due to a sore left knee.\n\n\r\n              Key moment\r\n              Wagner, Gary Harris and Caleb Houstan hit 3-pointers and Banchero scored six points on a 20-4 third-quarter run that turned an eight-point Orlando lead into a 24-point lead.\n\n\r\n              Key stat\r\n              The Celtics finished the season 33-8 on the road, with two of the losses coming in Orlando. Tatum missed both games.\n\n\r\n              Up next\r\n              Celtics: Play at home against Charlotte on Friday night.\n\n\r\n              Magic: Play at Indiana on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997519.6434839
}