{
  "game_id": "0021800161",
  "espn_id": "401070842",
  "date": "Nov 07, 2018",
  "matchup": "SAC vs. TOR",
  "headline": "Leonard returns to help Raptors improve to NBA-best 11-1",
  "body": "SACRAMENTO, Calif. --  Kawhi Leonard isn't making a big deal out of Toronto's NBA-best 11-1 start. He's trying to stay focused on the nuances of coach Nick Nurse's offense.\n\nOnce that happens, Leonard says, the Raptors will really get rolling.\n\nLeonard had 25 points and 11 rebounds in his return from an ankle injury, and Toronto beat the Sacramento Kings 114-105 on Wednesday night.\n\nPascal Siakam scored 21 points, Serge Ibaka had 14 points and 14 rebounds, and Kyle Lowry added 16 points and eight assists for the Raptors.\n\n\"This isn't our ceiling,\" Leonard said. \"With me not even knowing some of the offense, we have Kyle in the game most of the time. Once I start learning the offense, I can give him a little break and let him get some easier shots. I don't really know the offense in and out yet.\"\n\nToronto has won five straight since its lone loss this season at Milwaukee on Oct. 29.\n\nThe Raptors pulled away against the Kings despite 23 turnovers.\n\n\"We were lucky to come out with this one,\" Danny Green said. \"You look up and down the line, the only thing we beat them in was rebounding. That's a good sign for us, to show how good this team can be.\"\n\nLeonard sat out the previous two games and got off to a sluggish start early against the Kings before helping Toronto pull away.\n\nThe two-time All-Star scored 10 points in the second quarter and 10 in the third, including a soaring, one-handed dunk through traffic. Leonard also made a pivotal 3-pointer in the fourth after Sacramento had pulled to 106-99.\n\n\"He was a little rusty at the start but he made some really big baskets late,\" Nurse said. \"They sent lots of bodies to him, which was good for us to see.\"\n\nToronto has won three straight against the Kings.\n\nWillie Cauley-Stein and Buddy Hield scored 24 points apiece for Sacramento. De'Aaron Fox added 20 points, and second overall draft pick Marvin Bagley III had 13.\n\nThe Kings have lost two straight since winning five in a row.\n\n\"They don't make a lot of mistakes and they tortured us for the mistakes that we did make,\" Sacramento coach Dave Joerger said. \"They did a good job of bottling us up.\"\n\nToronto ended the first quarter on a 15-4 run, then took control once Leonard got going in the second after Sacramento got in foul trouble.\n\nLeonard made five free throws in the period, one coming after a frustrated Joerger was called for a technical foul for arguing with officials. Leonard also had a 3-pointer that put the Raptors up 49-40.\n\nGreen added back-to-back 3s, and OG Anunoby followed with a steal and dunk as Toronto took a 64-51 halftime lead.\n\nBOARDING UP\n\nToronto held a 51-35 rebounding edge, an area where the Raptors have not had much success this season. The 51 boards were a season-high for Nurse's team.\n\n\"I told them we did one rebounding drill today at shootaround and look what happened,\" Nurse said. \"So look for some more in practice coming up.\"\n\nIT'S ALL ABOUT PACE\n\nThe Kings are one of the fastest teams in the NBA this season and several Toronto players felt that Sacramento controlled the tempo of the game. Lowry disagreed.\n\n\"They were picking us up, tried to pressure us to try to speed us up but we didn't allow them to,\" Lowry said. \"We did a good job of staying locked in into what we were doing.\"\n\nTIP-INS\n\nRaptors: Lowry had his string of nine consecutive games with 10 or more assists snapped. ... Siakam scored 13 points in the first half on 5-of-7 shooting. ... Norman Powell was held out because of a left shoulder injury sustained Monday against Utah.\n\nKings: Bogdan Bogdanovic made his season debut after missing the first 10 games recovering from a pair of procedures on his left knee. The second-year guard entered to a rousing ovation midway through the first quarter and made his first two shots, including a 3-pointer. ... Nemanja Bjelica was called for a technical early in the third.\n\nUP NEXT\n\nRaptors: Host the New York Knicks on Saturday.\n\nKings: Host the Minnesota Timberwolves on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994225.7548091
}