{
  "game_id": "0022300790",
  "espn_id": "401585418",
  "date": "Feb 15, 2024",
  "matchup": "MEM vs. MIL",
  "headline": "Ziaire Williams, GG Jackson score 27 points apiece as Grizzlies hang on for 113-110 win over Bucks",
  "body": "MEMPHIS, Tenn. -- — Ziaire Williams and GG Jackson scored 27 points apiece, and the Memphis Grizzlies held on for a 113-110 victory over the Milwaukee Bucks on Thursday night in the last game for both teams before the All-Star break.\n\n\r\n              Vince Williams added 18 points, 12 rebounds and seven assists for Memphis. Ziaire Williams' points were a career high. \n\n\r\n              “It feels good,” Ziaire Williams said of the win over the No. 3 team in the Eastern Conference. “Proud of this team. We've been fighting our (tails) off every game. It's good to see. One man falls down, and another one steps up. We're just having fun.”\n\n\r\n              Giannis Antetokounmpo led the Bucks with 35 points and 12 assists, his 43rd double-double of the season. Damian Lillard finished with 24 points and seven assists. Bobby Portis added 15 points and Brook Lopez had 14 points, 11 rebounds and four blocks, but coach Doc Rivers thought some of his players got caught looking ahead to the break.\n\n\r\n              “We had some guys here, and some guys in Cabo (San Lucas),” Rivers said.\n\n\r\n              Memphis held a nine-point lead with 49 seconds left, but consecutive 3-pointers from Malik Beasley brought the Bucks within 113-110 with 29.2 left. Milwaukee had the last possession, but a scramble at midcourt for the ball took up a lot of the remaining clock, and Lillard's 3-pointer at the horn was short as Memphis won its second straight.\n\n\r\n              “I think (Lillard) just got caught up in traffic,” Rivers said.\n\n\r\n              Lillard said there was some miscommunication between he and Lopez that started the last play in a bad direction.\n\n\r\n              “We did opposite things,” Lillard said, adding: “They just made a play on it, and it was loose and we didn't end up getting a clean look.”\n\n\r\n              While the teams were deadlocked at the half, Memphis took the lead to nine points on a couple of occasions near the midway point of the third. But the Grizzlies' depleted frontline could do little to stop Antetokounmpo going downhill on his drives to the basket.\n\n\r\n              Three quick buckets inside with about 5 minutes to play gave Milwaukee a 100-98 lead. The teams would trade leads until a 3-pointer from Jackson and an alley-oop dunk by Ziaire Williams and the ensuing foul shot took the Memphis lead to 107-102 with 2:15 left. \n\n\r\n              The Memphis lead would reach 92-82 late in the third as the Grizzlies shot 76% in the period, including connecting on all four 3-points attempts. That as the only 10-point lead for either team in the game.\n\n\r\n              Milwaukee got off to a poor start, something that worried Rivers even in his pregame comments. With the break looming, he worried his team may have already departed mentally.\n\n\r\n              “These are tough games,” Rivers said, as if predicting the tone of the game against the short-handed Grizzlies. “Yeah, it's a panic game for coaches.”\n\n\r\n              The Grizzlies announced after the game they had lost another player, saying Scotty Pippen Jr. would miss at least three weeks with a bulging disk in his lower back.\n\n\r\n              For the first half, Milwaukee couldn't shake Memphis, and the teams were tied at 57 at the break. Antetokounmpo took over in the second quarter, with 10 points — hitting all five of his shots — and handing out four assists. \n\n\r\n              Jackson led the Grizzlies with 19 points.\n\n\r\n              He wasn't as successful in the second half, but managed a couple of 3-pointers in the final five minutes as the Bucks were trying to make a comeback. The 19-year-old, who was the 45th pick in last year's draft, said despite his young age, he wasn't feeling the pressure.\n\n\r\n              “It's what every basketball player wants,” Jackson said. “If they don't want to be in that moment, you have to question what kind of athlete they are.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Visit Minnesota on Feb. 23.\n\n\r\n              Grizzlies: Host the Los Angeles Clippers on Feb. 23.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996011.033133
}