{
  "game_id": "0021501085",
  "espn_id": "400828972",
  "date": "Mar 26, 2016",
  "matchup": "DET vs. ATL",
  "headline": "Hawks end Pistons' winning streak with 112-95 victory",
  "body": "AUBURN HILLS, Mich. --  Three terrific quarters from Paul Millsap were enough for the Atlanta Hawks.\n\nMillsap had 23 points and nine rebounds, and the Hawks snapped the Detroit Pistons' five-game winning streak with a 112-95 victory Saturday night. Millsap needed stitches over his left eye and played only 1:06 of the fourth quarter, but he'd already contributed plenty.\n\n\"Obviously, he had a monster game,\" coach Mike Budenholzer said. \"Fortunately, we had a little bit of a lead when it happened and we were able to close it out. Hopefully he'll be OK.\"\n\nThe Hawks have won 13 of their last 16 and moved a game ahead of Miami atop the Southeast Division. The Pistons remained two games ahead of Chicago for the final playoff spot in the Eastern Conference, since the Bulls lost to Orlando on Saturday. Indiana (38-34) is .001 ahead of Detroit (39-35) for seventh place.\n\nAndre Drummond had 19 points and 17 rebounds for Detroit, but the Pistons couldn't recover from a poor first quarter. Atlanta never trailed and led by as many as 20 in the fourth.\n\nJeff Teague had 12 points and 12 assists, and Kent Bazemore added 17 points for Atlanta. Tobias Harris scored 21 points for the Pistons.\n\nThe Hawks have scored over 100 points in a season-high eight straight games, but it was their defense that put Detroit in an early hole. The Pistons missed their first seven shots from the field and fell behind 11-2.\n\n\"They played at a level that we couldn't match. I thought it was more about them,\" Detroit coach Stan Van Gundy said. \"I didn't come away from that game, like I come from a lot, thinking we weren't ready to play or we didn't try. I think we kept trying to hang in there and hang in there.\"\n\nIt was 27-15 after one quarter, and although Detroit pulled within eight late in the second, Millsap responded with a three-point play and a 3-pointer in the final 35 seconds to give Atlanta a 56-42 advantage at halftime.\n\n\"Huge,\" Atlanta's Al Horford said. \"Paul really had a terrific game. It's good to see him playing with that type of rhythm again.\"\n\nAtlanta led 66-47 in the third after a 3-pointer by Teague. The Pistons cut it to seven late in the period, but the deficit was ultimately too much to overcome, and the Hawks put the game away in the fourth.\n\nDrummond and Atlanta's Dennis Schroder had to be separated during an altercation near the basket with 3:14 left in the third. Schroder was given a foul and Drummond received a technical. During the delay to hand out those punishments, the Chicago-Orlando score was announced, giving the Detroit fans something to cheer about during a tough game.\n\nAT BOTH ENDS\n\nMillsap had five assists to go along with all his points and rebounds, and he also added four steals and four blocked shots.\n\n\"He's a heck of a player. We're very fortunate to have him,\" Budenholzer said. \"We actually want more. We're on him and think he could do even more for us. When he plays with great energy and great force, his impact on the game is huge, and he knows that.\"\n\nBACK TO BACK\n\nBoth the Pistons and Hawks played (and won) Friday night, but Atlanta showed no signs of fatigue.\n\n\"Did they play yesterday? It sure didn't seem like it,\" Detroit's Marcus Morris said. \"They played really hard. It was a good game for them.\"\n\nTIP-INS\n\nHawks: Kyle Korver had a four-point play in the second quarter. ... Atlanta had 34 assists.\n\nPistons: Detroit has two games left in a nine-game homestand. The Pistons are 5-2 so far, with both losses coming to Atlanta.\n\nUP NEXT\n\nHawks: At Chicago on Monday night.\n\nPistons: Host Oklahoma City on Tuesday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994896.895478
}