{
  "game_id": "0021800590",
  "espn_id": "401071266",
  "date": "Jan 06, 2019",
  "matchup": "CHA @ PHX",
  "headline": "Walker's big finish gives Hornets win over Suns",
  "body": "PHOENIX -- Kemba Walker didn't have much of an impact in Charlotte's game Sunday night against the Phoenix Suns -- until the final 4 1/2 minutes.\nThen he was the Hornets' everything.\nWalker scored 18 of his 29 points in that late surge -- punctuated by a halfcourt heave at the buzzer -- and Charlotte pulled away to hand the Suns their sixth straight loss, 119-113.\n\"This isn't anything new,\" Hornets coach James Borrego said. \"He's done this most of his career. He's a fourth-quarter player. He shines brightest in those moments.\"\nWalker scored his team's final 14 points.\n\"In these kind of situations my teammates look to me to make big plays and that is what I try to do,\" he said. \"I try to make the right plays. Tonight was me getting to the basket and finishing. My guys, coaches, they count on me big time in situations like this.\"\nTony Parker added 20 points, and Willy Hernangomez and Marvin Williams 16 for the Hornets.\nT.J. Warren had 23 points, Josh Jackson a season-high 22 and Deandre Ayton 19 for Phoenix. Jamal Crawford scored 16. The Suns' Devin Booker left the game with back spasms in the second quarter and did not return.\nPhoenix fell to 0-6 with one game left on a seven-game homestand. The Suns had won five of seven when the homestand began.\nThe Hornets were on the second stop in a season-high, six-game road trip that began with a loss at Denver on Saturday night.\nWalker was 5 of 8 from the field and 7 of 8 on free throws in his late surge, which ended with a basket at the final buzzer from just beyond midcourt. Initially it was waived off but allowed after a video review.\n\"I always said Kemba is one of the most underrated players in the league, even with making a couple of All-Stars,\" Crawford said. \"He's just a handful and a guy like that, once he gets it going, he's pretty much unstoppable.\"\nCharlotte outscored Phoenix 11-4 over the last 1:17, with Walker scoring all of them, after Crawford's 20-footer put Phoenix up 109-108 with 1:21 to play.\nNeither team led by more than eight points in the tight contest.\n\"Losing Devin Booker in the first half kind of changed the game plan,\" Phoenix coach Igor Kokoskov said. \"He's a big piece, he's a big part of our team. We had to adjust on the fly and kept the game close.\"\nKokoskov said he didn't know about Booker's availability for Tuesday's game against Sacramento.\nThere were 13 ties and eight lead changes in the first half, with neither team up by more than six points, and the Suns were ahead 60-57 at the break.\nAyton had 15 points and seven rebounds in the first half.\nCharlotte took an 85-81 into the fourth quarter before the Suns tied it 85-85 on De'Anthony Melton's 3-pointer from the corner with 11:02 to play.\nParker started the subsequent 8-0 run with a layup and ended it with a 16-footer that put Charlotte up 93-85 with 8:55 to play.\nThe Suns came back and repeatedly cut the lead to one before Crawford's basket finally gave them the lead.\nBut four seconds later, Walker converted a three-point play and the Hornets were back on top for good.\nTIP INS\nHornets: Charlotte swept the season series with Phoenix 2-0 last season. ... Walker ranks second to LeBron James in fourth-quarter scoring at 8.27 points per game. The Suns' Booker is third (7.50). ... Charlotte doesn't play another home game until Jan. 17 (Sacramento). ... The Hornets won for just the third time in nine games.\nSuns: Crawford joined Dell Curry as the only NBA players, since starting lineups were recorded, with 11,000 career points as reserves. ... Booker's back problem brought an end to 11 consecutive 20-point games for the Phoenix star guard, the second-longest such streak of his career. ... Phoenix entered the game fourth in the NBA in steals at 8.98 per game.\nUP NEXT\nHornets: At Los Angeles Clippers on Tuesday.\nSuns: Host Sacramento on Tuesday",
  "source": "espn_api",
  "crawled_at": 1764994392.3930619
}