{
  "game_id": "0021600656",
  "espn_id": "400900077",
  "date": "Jan 21, 2017",
  "matchup": "MEM vs. HOU",
  "headline": "Dekker scores career-best 30 leading Rockets past Grizzlies",
  "body": "MEMPHIS, Tenn. -- Sam Dekker made his first career start a memorable one.\nDekker, subbing for the ill Ryan Anderson, scored a career-high 30 points, James Harden added 29 points and 10 assists and the Houston Rockets leaned on their usual 3-point offense to beat the Memphis Grizzlies 119-95 on Saturday night.\nDekker, in his second year out of Wisconsin, said he didn't prepare for the game any differently knowing he would be on the court for the tip. And the opening showed there wasn't any nervousness.\nDekker connected on his first five shots before finishing the night 12 of 19, including 6 of 11 from outside the arc.\n\"I did feel very comfortable from the jump and felt very locked in,\" Dekker said when asked about butterflies, later adding: \"When your first few go in, it really puts you at ease and (you) just kind of think everything is going to go in after that.\"\nEric Gordon added 21 points as the Rockets built the lead to 20 midway through the fourth and eventually 26 in coasting home.\nMarc Gasol scored 32 points and Mike Conley added 15 for the Grizzlies, who lost for the third time in the last four.\n\"Our brains were gone,\" Memphis coach David Fizdale said of his team's offense. \"We couldn't stop them, so offensively, we were going down.\"\nHouston shot 51 percent overall and 38 percent from distance.\n\"We had open shots, and we were able to knock them down,\" said Harden, who finished 7 of 9 from the field and 4 of 6 from 3-point range.\nThe Rockets' aggressive defense gummed up Memphis' offensive flow. Houston defenders double-teamed Memphis and closed out on jumpers. The Grizzlies struggled shooting the entire night, finishing at 37 percent.\nHouston took the lead in the first half and never really let up the rest of the night in bouncing back from a home loss to Golden State on Friday.\nBy the third quarter, the Rockets stretched a 58-49 lead to a 91-72 advantage entering the fourth as Dekker steadily paced the Houston offense.\n\"He played well. He played really well,\" Rockets coach Mike D'Antoni said. \"He hit the 3s that we needed. . Really good game for him.\"\nTIP-INS\nRockets: Anderson missed his third game with the flu. He sat out two games and tried to play in Friday's loss to Golden State before leaving after nine minutes on the floor. ...The Rockets used their 10th different starting lineup this season. ... Despite missing their first seven from outside the arc, the Rockets ended the night 16 for 42. Houston has failed to connect on at least 10 3-pointers in only four games this season.\nGrizzlies: Reserve G Troy Daniels sat out after injuring his right knee in Friday's win over Sacramento. ... F Chandler Parsons, who sat out Friday's win over Sacramento for rest, returned to action, scoring 12 points. .Before Saturday's loss, the Grizzlies had won 10 straight when Gasol scored at least 30 points.\nBACK-TO-BACKS\nThe game featured two of the most successful teams playing on the second night of a back-to-back. Houston is now 11-1, while the Grizzlies, who beat the Kings on Friday, dropped to 8-3 on the second night of back-to-backs.\nONE FOR THE MEMORY BANK\n\"I think I'll remember that my first career start was in Memphis the rest of my life,\" Dekker said. \"That's something you always dream about doing, regardless of the circumstance. I just tried to take advantage of it and happened to have a good night.\"\nHOLD ON THERE, YOUNGSTER\nAh, but even with Dekker's successful first start, the role is only temporary. \"I think he knows what he needs to do, and he's doing it,\" D'Antoni said. \"Now, we'll throw him back on the bench because Ryan will be back next game.\"\nUP NEXT\nRockets: Play the second game of a five-game road trip on Monday against the Bucks in Milwaukee\nGrizzlies: Close out a three-game homestand against the Toronto Raptors on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995598.301467
}