{
  "game_id": "0022200587",
  "espn_id": "401468742",
  "date": "Jan 06, 2023",
  "matchup": "LAC @ MIN",
  "headline": "Gobert, Timberwolves beat short-handed Clippers 128-115",
  "body": "MINNEAPOLIS -- — Rudy Gobert had 25 points and 21 rebounds, D’Angelo Russell also scored 25 and the Minnesota Timberwolves cruised to a 128-115 win against the short-handed Los Angeles Clippers on Friday night.\n\n\r\n              Jaden McDaniels had 18 points for Minnesota, which has won three in a row. While the Timberwolves put together one of their most complete performances of the season, leading scorer Anthony Edwards left the game in the third quarter with left hip soreness and didn’t return.\n\n\r\n              “I think overall in this stretch we’ve been decent with the rebounding,” Minnesota coach Chris Finch said. “I liked our perimeter defense — it’s been a lot better. Shot contests have been a lot better, our pursuit mentality, all that stuff.”\n\n\r\n              Los Angeles played without stars Paul George and Kawhi Leonard on the second night of a back-to-back. The Clippers arrived in Minnesota early Friday morning after a 122-91 loss at Denver and decided to sit George and Leonard as a precaution after the quick turnaround.\n\n\r\n              Reserve forward Norman Powell had a team-high 21 points for Los Angeles, which lost its fifth game in a row. John Wall, held out of Thursday’s game for left knee injury management, had 14 points and eight assists off the bench.\n\n\r\n              “It’s tough when you’re shorthanded the way we were tonight,” Clippers coach Tyronn Lue said. “I thought our guys competed and scrapped, and we were just overmatched at times.”\n\n\r\n              Without George and Leonard, the Clippers’ usually stout defense struggled against the Timberwolves.\n\n\r\n              Minnesota shot 56.8% from the field and scored 62 points in the paint. The Timberwolves led by as many as 25 despite 20 turnovers.\n\n\r\n              Los Angeles was allowing 109.8 points per game coming in, the fourth-lowest total in the league. Meanwhile, opponents were hitting just 45.8% of their shots against the Clippers.\n\n\r\n              “I just thought it was their ability to get into the paint (that) really hurt us,” Lue said. “We were closing out all night on guys driving by us, allowed Rudy to get offensive rebounds and dunks because we couldn’t control the ball and keep the ball in front of us.”\n\n\r\n              Russell, on the bench as Minnesota closed out Portland on Wednesday, scored 10 points in the first quarter. With Gobert also contributing, the Timberwolves got 22 of their first 37 points in the paint.\n\n\r\n              “I don’t think we’ve seen the best Rudy yet,” Gobert said. “I’ve been putting in a lot of work. My teammates are sticking with me. The coaching staff is sticking with me. And I know that it’s going to pay off.”\n\n\r\n              THIRD TIME A CHARM\n\n\r\n              Minnesota closed the first half on a 19-7 run to lead 68-54 and then stretched the lead to 19 early in the third quarter. The Timberwolves, who had been outscored by a league-high 125 points in the third period this season entering the day, saw their lead shrink as Los Angeles went on a 10-0 run. \n\n\r\n              But Minnesota followed with its own 8-0 run to close the third and outscored the Clippers by eight in the quarter.\n\n\r\n              “We don’t really do that well in third quarters most of the time,” McDaniels said. “But today was like, we said like the first five minutes are important, so just kind of putting them away in there and keeping the lead like 20, 25.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Nicolas Batum was held out for the third time in four games as he deals with an ankle sprain. … George is dealing with right hamstring soreness and Leonard was listed out due to right knee injury management. ... For the second straight game, Los Angeles never led. ... Moses Brown had 14 points and 11 rebounds.\n\n\r\n              Timberwolves: Edwards has been dealing with soreness since he landed on his hip against Milwaukee on Dec. 30. Finch didn’t have an update after the game. … Naz Reid returned after missing two games with back spasms, but left in the third with the same injury. … Minnesota shot 65% from the field in the first half. ... The 20 turnovers led to 18 points for the Clippers.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host Atlanta on Sunday.\n\n\r\n              Timberwolves: At Houston on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995058.366508
}