{
  "game_id": "0022400198",
  "espn_id": "401704764",
  "date": "Nov 09, 2024",
  "matchup": "CHI @ ATL",
  "headline": "Bulls pull off comeback to beat Hawks 125-113, snap 4-game skid",
  "body": "ATLANTA -- — After trailing for the majority of the game, the Chicago Bulls stormed back in the second half to defeat the Atlanta Hawks 125-113, snapping a four-game losing streak on Saturday night. \n\n\r\n              Atlanta outscored Chicago 37-24 in the first quarter and led by as many as 18, but the Bulls started the fourth quarter with a 14-3 run and never looked back. \n\n\r\n              Ayo Dosunmu led the Bulls with 19 points, Nikola Vucevic added 18 points and 12 rebounds, and Zack LaVine and Coby White also scored 18. Josh Giddey scored 13 points and Patrick Williams tallied 10.\n\n\r\n              Chicago shot 50% (46 of 92) while Atlanta shot 46.1% (41 of 89). \n\n\r\n              Trae Young had his third double-double in as many games with 14 points and 16 assists, but the effort was wasted for a second game in a row. Clint Capela and Jalen Johnson led all scorers with 20 points apiece. \n\n\r\n              Takeaways\r\n              Bulls: Prior to the four-game losing streak, Chicago strung together two wins in a row (126-123 over Memphis on on Oct. 28 and 102-99 over Orlando on Oct. 30). The Bulls trailed by 20 in both before mounting a comeback. \n\n\r\n              Hawks: Atlanta has played five games in seven days with two back-to-back games in that time. The Hawks are 2/3 in those games.\n\n\r\n              Key moment\r\n              The Bulls trailed until midway through the fourth quarter when Jalen Smith's dunk gave Chicago its first lead, 102-101, with 8:04 left in regulation. Chicago did not trail for the remainder of the game. \n\n\r\n              Key stat\r\n              Chicago was 9 of 16 from the floor as a team in the fourth quarter while Atlanta was 6 of 20. \n\n\r\n              Up next\r\n              Atlanta travels to Boston to play the Celtics on Tuesday. The Bulls return to Chicago to host the Cavaliers on Monday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997110.521355
}