{
  "game_id": "0021600048",
  "espn_id": "400899498",
  "date": "Nov 01, 2016",
  "matchup": "LAL @ IND",
  "headline": "George scores 30, including Pacers' last 12 to beat Lakers",
  "body": "INDIANAPOLIS --  Scoring isn't an issue for Indiana. The Pacers can put up points.\n\nIt's the struggles on the defensive end of the floor that cost them two losses in their first three games, and almost once more on Tuesday night. And their All-Star is very aware.\n\n\"I know what a good defensive team is. I know what it looks like. We're nowhere close to that,\" Paul George said.\n\nGeorge scored 30 points, including Indiana's final 12 of the game to rally the Pacers to a 115-108 victory over the Los Angeles Lakers.\n\nThe Lakers trailed by as many as 16 points, but rallied and had their final lead at 108-107 before George put it away.\n\n\"We were searching for players to go to,\" Pacers coach Nate McMillan said. \"Paul hit his first shot and he looked like he wanted the ball, and we milked it. All-Stars like (Paul), you expect them to make plays like that. That's what makes them great players.\"\n\nGeorge made consecutive 18-foot jumpers for a 111-108 lead, then followed through on the opposite end of the floor with the biggest defensive rebound of the game. The Lakers' Jordan Clarkson missed an almost uncontested layup, and it was George who came down with the rebound, sending him to the free throw line to close out the contest.\n\n\"He's really good and I mean that's what great players do,\" Lakers coach Luke Walton said. \"We did a phenomenal job of coming back in the second half and we started playing with the effort and energy that we need to play the full game with, and at the end of the game anything came happen.\"\n\nMonta Ellis had 17 points and CJ Miles scored 16 for the Pacers. Thaddeus Young finished with 14.\n\nThe Pacers' most impressive moment on defense came in the second quarter, when second-year big man Myles Turner denied Tarik Black's attempted slam dunk with authority. For the majority of the game, though, the defense was nowhere to be found.\n\nLou Williams scored 19 points for the Lakers and Clarkson had 15.\n\nTIP-INS:\n\nLakers: The Lakers are 0-3 on the road this season ... The Lakers rank 30th in turnovers per game, averaging 16.3. On Tuesday night, they turned it over 19 times.\n\nPacers: The Pacers topped 100 points for the third time this season ... The Pacers are 2-0 when George scores 25 points or more ... Indiana has won six of the last seven meetings against the Lakers.\n\nBAD TIMING\n\nThe game was delayed three times in the first 30 seconds while scoring officials tried to fix a malfunction with the game clock. For the first 6  1/2 minutes of the game, the clock was not operable. Scorers were forced to use stop watches, and the Pacers' public address announcer had to announce when there was 10 seconds remaining on the shot clock, then count down when it reached 5 seconds. The issue was resolved with 5:55 remaining in the first quarter.\n\nUP NEXT:\n\nLakers: Visit Atlanta on Wednesday to conclude a four-game trip.\n\nPacers: Travels to Milwaukee on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995452.988925
}