{
  "game_id": "0021900231",
  "espn_id": "401160873",
  "date": "Nov 23, 2019",
  "matchup": "CLE vs. POR",
  "headline": "Clarkson scores 28, Cavs snap 6-game losing streak",
  "body": "CLEVELAND --  Riding a six-game losing streak, coming off a 42-point loss and playing without their leading scorer seemed to be a negative set of circumstances for the Cleveland Cavaliers.\n\nThose obstacles didn't matter Saturday night.\n\nJordan Clarkson made all six of his 3-point attempts and scored 28 points to help Cleveland beat the Portland Trail Blazers 110-104.\n\nClarkson's season high, which included 14 points in the fourth quarter, came a night after he was held scoreless in a 143-101 loss at Dallas. The Cavaliers completed a stretch of five games in seven days Saturday after the team arrived in Cleveland around 3 a.m.\n\nLarry Nance Jr. started in place of forward Kevin Love, who missed his second game this week because of a sore back.\n\n\"Obviously, last night wasn't necessarily a morale booster,\" said Nance, who had 11 points and 12 rebounds. \"To come back in and win this game, I'm really excited to see.\"\n\nCleveland coach John Beilein has remained upbeat despite his team's difficult stretch that dropped the Cavaliers' record to 5-11.\n\n\"I didn't see any fatigue,\" he said. \"I didn't see anything but effort to try and win the game. There are a lot of teams that have had tough schedules, that have had injuries and are rebuilding. We just have to stick together so we can be better than this.\"\n\nTristan Thompson scored 25 points and Cleveland held off a Trail Blazers' run in the fourth quarter.\n\nDamian Lillard returned after missing two games because of back spasms and scored 23 points, but Portland dropped to 5-12 and is 2-10 this month. The Trail Blazers have lost four straight and five of seven.\n\nPortland advanced to the Western Conference finals last season, but the Trail Blazers are struggling without center Jusuf Nurkic, who broke his leg in March and is still sidelined.\n\n\"I'm not a big worrier, but there is reason for concern on certain things,\" Lillard said. \"Because of the expectations for us, absolutely, it's disappointing.\"\n\nCarmelo Anthony, playing his third game with Portland, scored 11 points in 35 minutes. Anthony was 5 of 15 from the field and missed all eight of his 3-point attempts.\n\n\"Physically I feel great,\" he said. \"Mentally I feel great. We've all been in situations like this before where we're trying to figure it out. There is still light at the end of the tunnel.\"\n\nCleveland led 100-88 midway through the fourth quarter, but Lillard scored the Blazers' next nine points, cutting the lead to 102-97. Baskets by Thompson and Nance halted Portland's rally.\n\nLillard had 16 points in the fourth. CJ McCollum finished with 20 points.\n\nTIP-INS\n\nTrail Blazers: C Hassan Whiteside (sore right hip) missed his second straight game. Anthony Tolliver started in his place and scored nine points. ... Gary Trent Jr., who started Thursday, came off the bench with Lillard's return. ... G Rodney Hood, who played two seasons with the Cavaliers, including their 2018 NBA Finals team, scored 11 points.\n\nCavaliers: Collin Sexton scored 19 points. ... Clarkson was 10 of 12 from the foul line. ... Cedi Osman had 12 rebounds. ...Thompson, a 61% free throw shooter, was 7 of 7 at the line.\n\nTOUGH GO\n\nCleveland's tightly packed schedule, which also has three games next week, is one reason why Beilein is being cautious with Love, who also didn't play in New York on Sunday with the back issue.\n\n\"He could probably gut through it, but it's not advantageous for us or the team tonight or in the future if he tries to gut this through,\" Beilein said.\n\nGET TO THE POINT\n\nPortland coach Terry Stotts didn't go into a lot of detail when asked about his team's present state.\n\n\"Look at the record,\" he said. \"That kind of explains it.\"\n\nLillard's return should help and the four-time All-Star said his back\n\nwasn't an issue.\n\n\"I wasn't in pain,\" he said. \"I haven't played in two games, so I'm not going to come out and make every shot. I didn't play good enough to win.\"\n\nUP NEXT\n\nTrail Blazers: Visit Chicago on Monday, ending a six-game trip.\n\nCavaliers: Host Brooklyn on Monday, the second of six straight games at home.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996328.875722
}