{
  "game_id": "0022300198",
  "espn_id": "401584826",
  "date": "Nov 15, 2023",
  "matchup": "LAL vs. SAC",
  "headline": "Kings overcome LeBron's triple-double, hold on in 4th quarter for 125-110 win over Lakers",
  "body": "LOS ANGELES -- — Domantas Sabonis had 29 points and 16 rebounds, and the Sacramento Kings overcame LeBron James' 108th career triple-double and the Lakers' fourth-quarter comeback bid for their fourth straight victory, 125-110 over Los Angeles on Wednesday night.\n\n\r\n              De'Aaron Fox and Kevin Huerter scored 28 points apiece for the Kings, who snapped Los Angeles' three-game winning streak with their fifth win in six meetings with their downstate rivals.\n\n\r\n              “Got out to a great start,” said Huerter, who hit six 3-pointers. “We established ourselves offensively, got out in transition, played fast. I don’t think we maintained it the rest of the game, but shows what we’re capable of when we’re playing at that level.”\n\n\r\n              James had 28 points, 11 assists and 10 rebounds in his first triple-double of his 21st NBA season, breaking his tie with Jason Kidd for the fifth-most in NBA history. He also led the Lakers' rally in the fourth quarter, when they sliced Sacramento's 26-point lead to nine before running out of steam.\n\n\r\n              Sacramento coach Mike Brown called the 38-year-old James' effort “amazing.”\n\n\r\n              “I don’t know if you can put a timetable on when he’s going to be done,” added Brown, who coached James for five seasons in Cleveland. “I think there’s only one person that can, and that’s him. Well, maybe two, because his wife might be able to do something about that. He’s absolutely amazing to do what he does at his age. It’s phenomenal. I’m amazed every time we go against him.”\n\n\r\n              The Kings have won three straight over the Lakers in Los Angeles, and their three top scorers staked them to a 106-80 lead early in the fourth quarter. The Lakers surprisingly kept their starters in the game and made a 30-13 run, but couldn't close the yawning gap.\n\n\r\n              “Whenever we get stops (and) we take care of the ball, we're usually fine,” Lakers coach Darvin Ham said. “I know the amount of scoring that we have on our team, particularly those five guys that finished for us. You've got to give them a chance to see what we can do. Maybe some turnovers, missed shots on their part, you can dig into the lead and make it a game, and I thought we did that.”\n\n\r\n              D'Angelo Russell scored 28 points for the Lakers, who lost at home for the first time in six games this season. Anthony Davis managed just nine points on 3-of-9 shooting with nine rebounds and four blocked shots in Los Angeles' fourth game in six days.\n\n\r\n              Davis scored four points in the game’s first four minutes, but didn’t score again until the fourth quarter.\n\n\r\n              “I just played bad,” said Davis, who has struggled with a hip muscle injury in recent days. “I'm not going to put it on anything. It was just missed shots. ... I'm still treating it every day. Obviously, you don't get that day to really attack it (when playing) back-to-back. It was still bothering me a little bit, but I've still got to go out there and do my job.”\n\n\r\n              The Kings needed overtime to beat the Lakers in Sacramento last month, but they opened a 19-point lead in the first quarter of this matchup. Los Angeles closed the gap to 119-110 on Cam Reddish's 3-pointer with 3:05 left, but James made a turnover and missed a 3-point attempt on the Lakers' next two possessions.\n\n\r\n              The loss ends a positive stretch of play for the Lakers, who followed a three-game skid with a three-game winning streak capped by their first blowout win of the season Tuesday over Memphis. Los Angeles again struggled to defend the perimeter, allowing 16 3-pointers to the Kings after the Grizzlies hit 20.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At San Antonio on Friday.\n\n\r\n              Lakers: At Portland on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995548.577365
}