{
  "game_id": "0022000462",
  "espn_id": "401267622",
  "date": "Feb 20, 2021",
  "matchup": "MEM vs. PHX",
  "headline": "Suns hit team-record 24 3s, blow out short-handed Grizzlies",
  "body": "MEMPHIS, Tenn. -- — On a night the Phoenix Suns made a franchise-record 3-pointers, Chris Paul passed a hero on the NBA's career assists list.\n\n\r\n                    Paul had six assists in the Suns' 128-97 romp over the short-handed Memphis Grizzlies on Saturday night to pass Oscar Robertson for sixth place. Paul has 9,891 assists, four more than Robertson had in his Hall of Fame career.\n\n\r\n                    “It’s an honor and a privilege to play the game as long as I’ve played,” the 35-year-old Paul said, adding that he has been a fan of Roberson since he began playing basketball. “It’s a huge accomplishment, and I’m grateful.”\n\n\r\n                    Paul’s pass that led to Mikal Bridges’ 3-pointer with 7:05 left in the second quarter, moved the Phoenix guard past Robertson.\n\n\r\n                    “I say the same thing, ‘Be legendary every day,’” Suns star Devin Booker said. “Chris is there. He’s a living legend.”\n\n\r\n                    Booker scored 23 points, hitting five of the Suns’ franchise-record 24 3-pointers. Mikal Bridges added 19 points, making 6 of 7 shots overall and 4 of 5 from long range. Cam Payne and Dario Saric also had 19 points, season highs for both, and Paul added 16.\n\n\r\n                    “This is a big-time road win,” Payne said. “We know we’ve got to win on the defensive end. Thought we shot the ball well. But I feel like our defense fires our offense. The fact that we were getting stops, it allows players on the offensive end to get a little bit loose and shoot the ball at a high clip.”\n\n\r\n                    Phoenix won for the eighth time in nine games. The Suns made 22 3-pointers Friday night in New Orleans in a game where they outscored the Pelicans 41-12 in the fourth quarter in a 132-114 victory. Paul had 19 assists in that game.\n\n\r\n                    Gorgui Dieng led Memphis with 15 points, most of them in a mop-up fourth quarter. Ja Morant had 12 points and five assists, and Jonas Valanciunas added 10 points and 12 rebounds.\n\n\r\n                    The Grizzlies also were coming off a victory Friday night, at home over Detroit. Playing their fourth game in five nights, they rested key players Brandon Clarke, Kyle Anderson and Grayson Allen. \n\n\r\n                    “I think there was a focus from the jump to play the way we play no matter who they have in their lineup,” Suns coach Monty Williams said. “Those are the kind of game where you can lose your rhythm.”\n\n\r\n                    Justise Winslow returned for Memphis after being out more than a year because of injuries. He missed all nine of his shots in the first half, eventually finishing with nine points on 3-of-14 shooting.\n\n\r\n                    “Pleased with him all game,” Memphis coach Taylor Jenkins said about Winslow, whose return was one of the lone bright spots for the Grizzlies. “He went out there, and I said before the game, I just wanted him to attack and compete and he just found his groove. He’s the ultimate pro.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: … Ended a four-game losing streak in the series. … The Suns made 13 of 25 3s in the first half. …Early in the third quarter, Paul and Bridges were a combined 11 for 11 from the field, including seven 3-pointers.\n\n\r\n                    Grizzlies: Winslow had played only one game since Dec. 5, 2019, and had not appeared in a Memphis uniform because of injuries since he came to the Grizzlies from Miami in a Feb. 6, 2020 trade. … Used their ninth starting lineup of the season. … The 36-point deficit in the fourth quarter was the largest of the season for Memphis.\n\n\r\n                    REST LIST\n\n\r\n                    With the Grizzlies playing their sixth game in nine days, Allen, Anderson and Clarke, all of whom started in Friday’s win over Detroit were given the night off. “Zero injury concerns whatsoever for Grayson, Kyle and BC,” Jenkins said, adding: “Just taking stock of where our team’s at. …It’s just one game. Those guys will be back in the action (Sunday against Dallas).”\n\n\r\n                    GAME BALL\n\n\r\n                    During his postgame interview, Paul was holding the game ball in recognition of passing Robertson. The ball was tracked down by Booker. “It’s really dope. We’re a team like that,” Paul said of having a younger player like Booker make sure he got the ball. “…These moments are something big. I’m grateful (Booker) got the ball for me.”\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Host Portland on Monday night.\n\n\r\n                    Grizzlies: At Dallas on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997717.117019
}