{
  "game_id": "0021200199",
  "espn_id": "400277919",
  "date": "Nov 26, 2012",
  "matchup": "CHI vs. MIL",
  "headline": "Bucks rebound from 27-point deficit to shock Bulls",
  "body": "CHICAGO --  The Milwaukee Bucks had everything working against them late in the third quarter -- a 27-point deficit, a nine-game skid against Chicago and a flurry of 3-pointers by the Bulls, the league's worst deep-shooting team.\n\nSo Milwaukee coach Scott Skiles cleared the bench and watched his reserves tear off a 31-4 run, leading the Bucks to a stunning 93-92 comeback win over the Bulls on Monday night that snapped a three-game losing streak.\n\nErsan Ilyasova scored 14 of his 18 points in the second half to lead the comeback, including 12 in the fourth quarter when Milwaukee outscored Chicago 30-12 to prevent the Bulls from taking over first place in the Central Division. The first-place Bucks lead the Bulls by 1½ games.\n\n\n\n\"We got different guys in the game,\" Skiles said. \"They played very well together, played with a lot of energy, played some good defense.\"\n\nMilwaukee played the entire fourth quarter with the same five reserves: Ilyasova, Ekpe Udoh, Beno Udrih, Mike Dunleavy and Doron Lamb.\n\n\"It can happen fast,\" Bulls coach Tom Thibodeau said. \"You can lose 10 points in an NBA game in a minute. Everyone says that doesn't happen, but you see it all the time. If you don't play tough with a lead, this is what happens.\"\n\nRichard Hamilton scored a season-high 30 points for the Bulls but missed a shot at the buzzer that would have won it.\n\nJohn Henson, Udrih and Udoh all scored 11 points, while Monta Ellis added 10. Udoh added six rebounds and five of Milwaukee's 12 blocked shots.\n\n\"It's one of those games where we just played well defensively,\" Ilysova said. \"We didn't let them score, and we just got opportunities and made some tough shots. We closed 27 points -- in an NBA game that's not easy.\"\n\nThe Bucks hadn't beaten Chicago since April 6, 2010.\n\n\"We played terrible,\" Bulls forward Luol Deng said. \"I gotta look at it again, but we're not playing like how we need to play. We're not playing like how we used to play.\"\n\nHamilton was coming off a then-season-high 22 points in Chicago's 93-86 win at Milwaukee on Saturday. Kirk Hinrich added a season-best 17 points and six assists.\n\nChicago had one final chance after Dunleavy turned the ball over on an inbound pass under the Milwaukee basket with 7.5 seconds left. Udoh knocked the ball out of bounds reaching for Dunleavy's pass, and Chicago called a timeout.\n\n\"We just wanted to fight back and make it a great game,\" Lamb said. \"We did that and came all the way back and got a lead. We told ourselves we could win the game.\"\n\nHamilton took an inbound pass and worked his way to the foul line, but missed a fadeaway over Lamb as time expired, the ball bouncing off the side of the rim.\n\nCarlos Boozer had 19 points and 11 rebounds for Chicago. Deng added 10 points and eight boards.\n\n\"It's tough, man,\" Boozer said. \"I wish we could go back out there and finish it differently.\"\n\nThe game was reminiscent of the biggest lead the Bulls ever blew at home, a 35-point advantage in a home loss to the Sacramento Kings on Dec. 21, 2009.\n\nHamilton and Boozer combined for 17 points in the third quarter as Chicago seemingly blew the game open.\n\nThe Bulls outscored Milwaukee 28-13 in the third and opened the 27-point lead on Hinrich's 3-pointer with 2:50 to go in the quarter. That gave Hinrich his season high for points, just the third time he's reached double digits this season.\n\nJust before Hinrich's 3, Chicago's third 3-pointer in less than 2 minutes, Skiles inserted Ilyasova, Lamb and Udrih into the game, the last time he substituted.\n\n\"No, I never thought of putting the starters back in,\" Skiles said. \"There was a noticeable uptick in our pressure and we weren't giving up offensive rebounds, and we got off on the break with that group that was in there.\"\n\nHamilton scored eight of his 17 first-half points in the second quarter as Chicago took a 48-40 lead at halftime.\n\nMilwaukee hit just 20 percent from 3-point range (3 of 15). The Bucks entered the game shooting 16 percent from beyond the arc over their last three games (10 of 62).\n\nThat didn't matter behind a group of reserves who outscored their Chicago counterparts 56-10.\n\n\"We were very loose with the lead at the end of the third quarter,\" Thibodeau said. \"That game changed in about 4-5 minutes, at the end of the third quarter and to the fourth. We couldn't stop it.\n\n\"You've got to play 48 minutes in this league, and we've still got a long ways to go in that area.\"\n\nGame notes Henson got his first NBA start for the Bucks, starting in place of Ilyasova. He led Milwaukee with 11 first-half points, but didn't score in the second half. ... Brandon Jennings started despite spraining his left ankle toward the end of Saturday's game against Chicago. He scored six points. Jennings, who is leading the league in steals, failed to record one in a game for the first time this season. ... The Bucks shot 45.9 percent from the field and have shot 50 percent or better just once in their last 34 games against the Bulls, dating to March 26, 2004. The Bulls have won 24 of those games.",
  "source": "espn_api",
  "crawled_at": 1764993406.122884
}