{
  "game_id": "0021400576",
  "espn_id": "400578868",
  "date": "Jan 14, 2015",
  "matchup": "MEM @ BKN",
  "headline": "Grizzlies rout Nets in first matchup with ex-coach Hollins",
  "body": "NEW YORK --  Even with Lionel Hollins gone, the Memphis Grizzlies will always be more force than finesse as long as Zach Randolph and Marc Gasol are around to overpower opponents.\n\nAdding Jeff Green gives them a chance to be both.\n\nRandolph had 20 points and 14 rebounds and the Grizzlies beat the slumping Brooklyn Nets 103-92 on Wednesday night in their first matchup against their former coach.\n\n\"It was good to beat him, honestly,\" Gasol said. \"I know how competitive he is and he knows how competitive I am.\"\n\nHollins' new team dropped its seventh straight since it was 16-16 after winning its first game of 2015.\n\n\"They're a very good defensive team, a very good rebounding team and that's why they're one of the best teams in the league,\" Hollins said.\n\nGasol and Courtney Lee added 18 points apiece for the Grizzlies (27-11), who began working newly acquired Green into one of the Western Conference's top teams. Green finished with 10 points in 26 1/2 minutes off the bench in his first game since his arrival from Boston.\n\n\"We're never going to be a small-ball team, but we do have to be able to match up small ball with all the teams in the West,\" Memphis coach Dave Joerger said.\n\nMason Plumlee had 15 points and nine rebounds for the Nets, playing without the suspended Kevin Garnett and still without the injured Deron Williams.\n\nThat left Hollins without nearly enough experience against a veteran team that enjoyed its best success under him but might be on its way to even greater heights under Joerger, his former assistant.\n\nHollins went 214-201 with the Grizzlies franchise and his last three teams made the playoffs, but he was let go after a 56-26 finish and a trip to the Western Conference finals in 2012-13 when ownership was looking for a change.\n\n\"It was different going against your old coach,\" Randolph said. \"Been through a lot, made history together, did stuff together in Memphis, turned the franchise around, so it was nice to see him out there.\"\n\nThe Grizzlies are much more versatile offensively under Joerger than Hollins' rugged defensive clubs, and they got another scoring option when they acquired Green from Boston in a three-team deal with New Orleans. It wasn't approved by the league until Monday, leaving Green just one workout with Memphis, so Joerger wanted to ease him in.\n\nAveraging a career-best 17.6 points, Green was 3 of 11, missing all four 3-point attempts, but sees how he can be a perfect fit in Memphis.\n\n\"I mean, I'm surrounded by threats,\" the 6-foot-9 forward said. \"It's a great feeling to have. Coach just wants me to go out there and just play my game and just be aggressive.\"\n\nGarnett was suspended by the NBA for head-butting Houston's Dwight Howard on Monday, and Williams is still unsure when he will return from fractured rib cartilage. The Nets still are in playoff position in the Eastern Conference, but that may not last much longer if they can't end this skid soon.\n\n\"Maybe we've maxed out, I don't know,\" Hollins said before the game, \"but that's what we're striving for.\"\n\nLee scored 15 points in the first quarter, going 6 for 7 and making all three 3-pointers, and Memphis led by as much as 19 in the second half.\n\nTIP-INS\n\nGrizzlies: Memphis snapped a three-game road losing streak. ... The Grizzlies are 19-2 when scoring 100 points. ... Randolph is 20 rebounds from passing Pau Gasol (4,096) for the franchise lead in rebounds.\n\nNets: Hollins held a morning shootaround Wednesday, which the Nets haven't been doing for home games. They worked out at their training facility in East Rutherford, New Jersey, but Hollins said he'd like to do it at the arena in hopes it could improve the Nets' shooting at home. \"Just trying to think of things to help us be better,\" he said.\n\nTHE INSIDE STORY\n\nThe Grizzlies were 3 for 17 from 3-point range -- 0 for 13 not counting Lee. But with 66 points in the paint, outside shooting was secondary.\n\n\"That's what we do,\" Randolph said. \"We play inside-out.\"\n\nUP NEXT\n\nGrizzlies: Visit Orlando on Friday night.\n\nNets: Visit Washington on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764992158.499373
}