{
  "game_id": "0022200476",
  "espn_id": "401468631",
  "date": "Dec 21, 2022",
  "matchup": "CHA @ LAC",
  "headline": "Clippers use full roster to rout Hornets 126-105",
  "body": "LOS ANGLEES -- — Paul George scored 22 points, Nicolas Batum added 21 and the injury-ravaged Los Angeles Clippers had their whole roster available in a 126-105 victory over the Charlotte Hornets on Wednesday night.\n\n\r\n              George, Ivica Zubac, Reggie Jackson and Norman Powell returned to the lineup, with Powell making his first appearance since Nov. 29 after missing 10 games because of a groin injury.\n\n\r\n              After the entire roster practiced together for the first time Tuesday, the Clippers shot 50.6% from the field and held the Hornets to 40.2%.\n\n\r\n              “It was a sigh of relief at the start of shootaround,” George said about learning the entire roster would be available. “I think everybody was happy to have everybody healthy and we were definitely talking about it in the locker room that we haven't had this since the first game.”\n\n\r\n              All was not rosy with Clippers coach Tyronn Lue lamenting his team's 27 turnovers that led to 33 Hornets points. Los Angeles offset that with a season high in points and 3-point baskets (23).\n\n\r\n              “It was just good to see everybody back on the floor,” Lue said. “That's the biggest thing, seeing everybody healthy. Now we have to continue building something. First game under our belt but we have a long way to go. We have to figure out rotations and the minute restrictions and the flow of games.”\n\n\r\n              Charlotte star LaMelo Ball, from nearby Chino Hills, had his first triple-double of the season. Ball had 25 points, 11 rebounds and 12 assists.\n\n\r\n              There was little else to celebrate for Charlotte, which trailed by 20 at 33-13 less than 11 minutes into the game. The Clippers led 37-19 after one quarter and were up 71-40 at halftime.\n\n\r\n              “When you don't get your defense set against them, they have so much skill on the floor, and you're always a step behind,” Hornets coach Steve Clifford said. “When we get our defense set we're good and when we don't, like tonight, we're in trouble.”\n\n\r\n              Mason Plumlee scored 18 points for the Hornets, and Jalen McDaniels added 16.\n\n\r\n              TIP INS\n\n\r\n              Hornets: It was Ball’s second career triple-double in a game at Los Angeles after he had one last season against the Lakers.\n\n\r\n              Clippers: Terance Mann was assessed a personal foul for shoving Kelly Oubre Jr. twice near the end of the first quarter, with both players receiving technical fouls after the play was reviewed.\n\n\r\n               UP NEXT\n\n\r\n              Hornets: At Los Angeles Lakers on Friday night.\n\n\r\n              Clippers: At Philadelphia on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994276.900785
}