{
  "game_id": "0021500202",
  "espn_id": "400828089",
  "date": "Nov 23, 2015",
  "matchup": "CHA vs. SAC",
  "headline": "Walker's 39 points lift Hornets over Kings 127-122 in OT",
  "body": "CHARLOTTE, N.C. --  Kemba Walker put the Charlotte Hornets in prime position for a big win when he made a driving one-handed scoop layup with 0.7 seconds left in regulation.\n\n\"Yeah, I thought it was over,\" Walker said with a smile.\n\nInstead, Sacramento scored on an alley-oop inbounds play, forcing Walker and the Hornets to dig a little deeper for a 127-122 comeback win over the Kings on Monday night.\n\nWalker scored 21 of his 39 points in the fourth quarter and had four more in overtime as the Hornets rallied from 22 points down in the second half on the way to their sixth consecutive home win.\n\nIt was the second-largest comeback in franchise history.\n\nThe Hornets trailed 91-74 after three quarters before Walker got hot. He was 9 of 10 from the field in the fourth with three 3-pointers, four rebounds, an assist and a blocked shot.\n\n\"I was doing anything possible to win,\" Walker said. \"I got great looks and my shots were falling. I kept being aggressive and making the right plays. That is what I try to do -- make the right plays.\"\n\nNicolas Batum had 18 points, 10 rebounds and eight assists for the Hornets, who have won four of their last five. Jeremy Lin had seven of his 14 points in overtime.\n\n\"To come back like that and play like we did in the fourth quarter it's good and it shows the fight we have within our group,\" Hornets coach Steve Clifford said.\n\nDeMarcus Cousins had 30 points and 11 rebounds for Sacramento, and Rudy Gay had 28 points and 10 boards. Rajon Rondo had 14 points and 20 assists.\n\nThe Kings forced overtime when Gay scored on a side inbounds pass from Rondo. But the Hornets controlled the extra period.\n\nRookie Frank Kaminsky knocked down a 3-pointer from the top of the key and Lin converted a three-point play off a nifty drive down the right side of the lane, giving the Hornets a 118-114 edge. Lin then sliced through the defense for a reverse layup to push the lead to six and bring the crowd to its feet.\n\nThe Kings pulled within two before Lin hit a step-back jumper from 19 feet to make it a two-possession game with 43 seconds left.\n\nAfter a Rondo turnover, Walker drained two free throws to make it 124-118 and the Kings never challenged again.\n\nThe game was tied at halftime, but Gay scored 16 points in the third to help the Kings build a 22-point lead.\n\nKings coach George Karl felt his team's fatigue was a factor down the stretch.\n\n\"I should have substituted probably earlier and more often,\" Karl said. \"I thought we were going to win the game with the switching.  We probably should have changed it up with more blitzing.\"\n\nAILING COUSINS\n\nKarl said Cousins sprained his back in the third quarter, although he did continue to play and scored 12 points in the fourth. Cousins appeared to be walking fine in the locker room after the game.\n\n\"You could see it was bothering him,\" Karl said. \"He went back in. We probably should have not played him because he was never a hundred percent after that.\"\n\nDIFFERENT LOOK\n\nThe Hornets battled back in the fourth quarter behind a lineup that included Walker, Lin, Batum, Kaminsky and Cody Zeller -- and not star center Al Jefferson. Clifford said the team's improved depth affords him the option to do that.\n\nTIP-INS\n\nKings: Rondo was two assists shy of the franchise record of 22 set by Phil Ford in 1979. ... Sacramento fell to 4-1 after leading entering the fourth quarter.\n\nHornets: Walker moved past David Wesley into third place in Hornets history in made 3-pointers with 393. ... P.J. Hairston started and had a season-high six rebounds.\n\nUP NEXT\n\nKings: Visit Milwaukee on Wednesday night.\n\nHornets: Host Washington on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994407.1085372
}