{
  "game_id": "0022000664",
  "espn_id": "401307453",
  "date": "Mar 23, 2021",
  "matchup": "MIA vs. PHX",
  "headline": "Suns stay hot, Heat struggle again as Phoenix rolls, 110-100",
  "body": "MIAMI -- — The last time the Phoenix Suns won seven consecutive road games, Chris Paul had yet to become an NBA All-Star, Devin Booker and Mikal Bridges were 10, and Deandre Ayton had not even started playing basketball.\n\n\r\n                    That was then. The Suns are rolling now, and the Miami Heat just keep on sputtering as the trade deadline looms.\n\n\r\n                    Booker scored 23 points, Ayton finished with 17 points and 16 rebounds and the Suns added to Miami’s miserable stretch with a 110-100 win over the reigning Eastern Conference champions on Tuesday night.\n\n\r\n                    It was Phoenix’s seventh straight win on the road, the first time the Suns have had such a streak since January 2007.\n\n\r\n                    “I don’t want to make declarations about us,” Suns coach Monty Williams said. “I just like winning games and winning with our defense against a really good team — a team with a championship pedigree and a team that’s been where we want to go.”\n\n\r\n                    Former Heat forward Jae Crowder scored 13 points, Bridges added 12 and Paul had nine assists for the Suns (29-13), who moved within two games of idle Utah for the top spot in the Western Conference.\n\n\r\n                    “I felt like we were all engaged mentally with the game plan and it translated out on the court,\" Crowder said. “We had control of the game the whole way through.\"\n\n\r\n                    Kendrick Nunn scored 25 points for Miami, which has dropped four in a row and continued struggling from the field. The Heat have shot 41% from the field and 28% from 3-point range during this slide, which came immediately after a stretch where Miami won 11 out of 12 games.\n\n\r\n                    “We’ll keep plugging away until we find the right solutions,” Heat coach Erik Spoelstra said. “We’re certainly better than what we’ve shown over the last four games on the offensive end.”\n\n\r\n                    Bam Adebayo scored 15 points and Jimmy Butler had a 14-point, 11-rebound night for Miami. The Heat could be active before Thursday’s 3 p.m. trade deadline, with it looking like they need some sort of spark to get back on track.\n\n\r\n                    The Heat are one of five teams — Atlanta, Charlotte, New York and Chicago are the others — all clustered within one game of each other between fourth and eighth place in the East.\n\n\r\n                    Miami was within 42-39 midway through the second quarter, before the Suns went on a 16-4 run and went into the break up 58-43. The Heat used an 11-0 run to cut a 22-point deficit in half late in the third quarter, but never was closer than 10 in the second half.\n\n\r\n                    Crowder, Booker, Paul and Butler all sat out the fourth quarter. For the Suns, it was a little rest. For Butler, it was probably more frustration than anything else.\n\n\r\n                    “We know we’re not playing to our capability,” Nunn said. “But we’ll get things together.”\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Crowder — a big part of Miami’s run to the NBA Finals last season — was introduced last and got a warm reception, which he acknowledged with a wave. ... The game started a stretch where Phoenix is scheduled to play 18 of its final 31 games on the road. ... This is Phoenix’s best 42-game start since the 2007-08 Suns began 30-12.\n\n\r\n                    Heat: Miami added KZ Okpala (health and safety protocols) to its injury list, along with Avery Bradley (calf), Goran Dragic (back) and Udonis Haslem (protocols). ... Kelly Olynyk played the first nine minutes of the game and sat the rest of the half, then played the first six minutes of the third quarter and didn’t return. He was 0 for 6.\n\n\r\n                    RECORD WATCH\n\n\r\n                    Phoenix is now two wins from matching the franchise record for consecutive road victories. The Suns have won nine consecutive road games in the same season three times; it also happened in a stretch from March 1998 through February 1999, obviously spanning two seasons.\n\n\r\n                    STREAKING\n\n\r\n                    The Heat have had winning streaks of six, five and four games this season — and losing streaks of five, four, three and three games. Somehow, it all adds up to a 22-22 record with 28 games left.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Visit Orlando on Wednesday.\n\n\r\n                    Heat: Host Portland on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996778.333759
}