{
  "game_id": "0022200530",
  "espn_id": "401468685",
  "date": "Dec 30, 2022",
  "matchup": "ATL vs. LAL",
  "headline": "James has season-high 47 on 38th birthday, Lakers beat Hawks",
  "body": "ATLANTA -- — LeBron James started this journey 20 years ago, and there are times when he still feels like a kid on the basketball court. \n\n\r\n              Friday was one of those nights.\n\n\r\n              James scored a season-high 47 points on his 38th birthday with many of the sellout crowd at State Farm Arena cheering his every move, and the Los Angeles Lakers beat the Atlanta Hawks 130-121.\n\n\r\n              “At 18 years old, I knew how to play the game,\" he said. “I knew I belonged in the NBA, but I didn’t know what I could become at 18. But I knew if I continued to put in the work and I continued to reach into the game then I could be one of the greatest players to ever play this game.\"\n\n\r\n              James, a four-time NBA MVP and an 18-time All-Star, finished with 10 rebounds and nine assists. He had 16 points in the second quarter, 13 in the third and 16 in the fourth. James began the game ninth in the league with 27.8 points per game. \n\n\r\n              The Hawks (17-19), who have lost three in row, blew a 15-point lead but regained a 101-100 lead on Aaron Holiday’s 3-pointer with 10:50 remaining. James hit a 3 from the right wing to make it 103-101 and Los Angeles never trailed again. \n\n\r\n              James had his mother Gloria and his wife Savannah sitting courtside for his birthday. \n\n\r\n              “They’ve been with me since before this 20-year campaign started,\" he said. “They’re the rock to everything that I do. To have them there tonight sitting courtside and just being a part of this journey, being here for my birthday, being here for the holidays, it’s pretty cool.\"\n\n\r\n              The Lakers had lost nine of their last 13 but led 120-113 on James’ three-point play with 2:18 to go. Much of the crowd came to its feet roaring as he drew John Collins’ sixth foul and fell down as he hit a baseline layup. He hit the free throw and came back on the next possession with a reverse layup on the baseline that drew the crowd to its feet again.\n\n\r\n              James added two free throws to make it 130-121 with the crowd chanting, “MVP! MVP!”\n\n\r\n              “Atlanta has always been kind and welcoming to myself and my teammates no matter what uniform I’ve been in,\" James said. “They’ve always respected the game.\" \n\n\r\n              Thomas Bryant had 19 points and a season-high 17 rebounds, and Russell Westbrook had 14 points and 11 assists.\n\n\r\n              Trae Young led the Hawks with 29 points and Dejounte Murray had 20. Young said James' defense changed the game.\n\n\r\n              “Most of the time LeBron was in the back quarterbacking and telling everyone where to go,\" Young said. “He was in the back of the paint hanging off our 5s and our 4s and making us shoot 3s and take contested jump shots. It was working early on and as the game went on it kind of turned on us. That’s what happened.\" \n\n\r\n              Down by 15 in the second quarter, Los Angeles took an 82-81 lead late in the third on James’ fast-break lay-in. The Lakers were in the midst of a 17-4 run that ended with James’ three-point play and an 87-83 lead.\n\n\r\n              “He was just locked in,\" Westbrook said. “He’s capable of doing things at an elite level for a long time as well all know. It’s just good to witness it.\" \n\n\r\n              James did a TV interview and signed his jersey for rapper 2 Chainz before leaving the court to another standing ovation.\n\n\r\n              “For me it’s all about preparing the mind, putting in the work every single day,\" said James, a four-time NBA champion. “Seeing how great I can be on a day-to-day basis and then obviously throughout all these seasons, there’s so many narratives and rollercoasters that you have to navigate through. \n\n\r\n              “The frustrations, the good times, the bad times, so I just try to stay as even keel and as sharp as I can be throughout the course of a full season.\"\n\n\r\n              TIP-INS\n\n\r\n              Lakers: James’ previous season high was 39 points Nov. 26 at San Antonio. ... Coach Darvin Ham said Anthony Davis is “trending in the right direction” with his right foot stress injury and that “the pain has just about dissipated.” Davis, who’s been sidelined for two weeks, told reporters before the game that he’s “feeling a lot better” and that “the pain has subsided tremendously.” Davis isn’t expected back until the second week of January. \n\n\r\n              Hawks: Clint Capela (right calf contusion) was out for the sixth time in the last seven games. Onyeka Okongwu started in his spot again and had 17 points. ... De’Andre Hunter (left ankle sprain) missed his third straight game. ... The NBA fined Bogdan Bogdanovic $25,000 for kicking a ball into the stands following Wednesday’s 108-107 home loss to Brooklyn.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Charlotte on Monday. \n\n\r\n              Hawks: At Golden State on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994835.559584
}