{
  "game_id": "401809775",
  "espn_id": "401809775",
  "date": "Nov 07, 2025",
  "matchup": "MIA vs CHA",
  "headline": "Powell scores 25, Heat start fast and run away from Hornets in NBA Cup, 126-108",
  "body": "MIAMI -- — Norman Powell scored 25 points and the Miami Heat enjoyed a record-setting first quarter on the way to a 126-108 victory over the Charlotte Hornets in an NBA Cup game Friday night, giving coach Erik Spoelstra a win a day after his home burned down.\n\n\r\n              Andrew Wiggins scored 22 points and Pelle Larsson added 19 for Miami.\n\n\r\n              Rookie Kon Knueppel had his highest-scoring game as a pro, finishing with 30 for Charlotte. Tre Mann scored 20 points for Charlotte, and Miles Bridges finished with 14 points, 12 rebounds and seven assists.\n\n\r\n              Miami scored a franchise-record 53 points in the first quarter — the second highest-scoring first quarter in NBA history — and led by 26 points with 9:20 left in the second quarter.\n\n\r\n              It was 64-38. Barely seven minutes later, it was 66-65 — after Charlotte went on a 27-2 run. But the Hornets never led, and the Heat pulled away in the fourth.\n\n\r\n              The Heat managed only 19 points in the second quarter. They became the second team in the NBA's shot-clock era — which started in 1954 — to score at least 50 in one quarter and then fail to score 20 in the next quarter of the same regular season game. Memphis also did it on March 5, 2023 in a loss to the Los Angeles Clippers.\n\n\r\n              Hornets rookie center Ryan Kalkbrenner was 5-for-7 from the field — and his shooting percentage actually dropped. Kalkbrenner came into the game shooting 82.9%, and that rate fell to 81.3% on Friday.\n\n\r\n              Up next\r\n              Hornets: Host the Los Angeles Lakers on Monday night.\n\n\r\n              Heat: Host Portland on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042578.530838
}