{
  "game_id": "0022200939",
  "espn_id": "401469094",
  "date": "Mar 01, 2023",
  "matchup": "ORL @ MIL",
  "headline": "Bucks rout Magic 139-117, extend winning streak to 16 games",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo wants to make sure the Milwaukee Bucks shouldn't rely too much on the 3-point shot.\n\n\r\n              But for one night, the Bucks showed how dangerous they could be from long range as they extended the longest winning streak in the NBA this season.\n\n\r\n              Antetokounmpo scored 31 points and the NBA-leading Bucks hit a season-high 26 3-pointers in a 139-117 win over the Orlando Magic on Wednesday night for their 16th straight victory.\n\n\r\n              “It's part of our game, but it's not our only game,” Antetokounmpo said. “We cannot fall in love and rely on our 3-point shot. When it goes in, it's a bonus. It's a plus.”\n\n\r\n              It went in early and often against Orlando.\n\n\r\n              The Bucks went 26 of 56 from 3-point range. Grayson Allen, AJ Green, Joe Ingles and Brook Lopez each sank four 3-pointers. Antetokounmpo and Pat Connaughton added three each.\n\n\r\n              “I didn't even realize we hit that many 3's,” said Lopez, who scored 18 points and shot 4 of 5 from beyond the arc. “I knew we hit a lot, but that's a lot of 3s.”\n\n\r\n              Milwaukee’s win streak is the longest in the NBA since the Phoenix Suns won 18 in a row early last season. The Bucks’ run is their longest since winning 18 straight in the 2019-20 season.\n\n\r\n              The Bucks’ franchise record for consecutive wins came in their 1970-71 championship season, when they claimed 20 straight. \n\n\r\n              “That’s a team that’s rolling right now,” Magic coach Jamahl Mosley said. “They’re playing at a high level.”\n\n\r\n              Milwaukee hasn't lost since Jan. 21, when it fell 114-102 at Cleveland. The Bucks haven’t lost a game in which Antetokounmpo played since Jan. 6 against Charlotte.\n\n\r\n              The Bucks also have won their last 13 matchups with the Magic.\n\n\r\n              Orlando had snapped the Boston Celtics’ nine-game winning streak on Jan. 23 and ended the Philadelphia 76ers’ seven-game streak on Jan. 30, but the Magic couldn’t stop the Bucks.\n\n\r\n              Antetokounmpo shot 10 of 14 overall, 3 of 4 from 3-point range and 8 of 10 from the line. The two-time MVP also had seven rebounds and six assists.\n\n\r\n              Jrue Holiday had 23 points and nine assists for the Bucks. Brook Lopez scored 18 and Ingles 16.\n\n\r\n              “We’ve talked a lot about the depth of our shooting, the quality of our shooting,” Bucks coach Mike Budenholzer said. “It felt like a lot of them caught a hot streak tonight.”\n\n\r\n              Orlando's Cole Anthony scored a season-high 28 points. Markelle Fultz added 21, Wendell Carter Jr. 19 and Franz Wagner 18. Carter also had 10 rebounds.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Jonathan Isaac (strained right hamstring/adductor) missed a third straight game. ... Orlando went 6 of 12 on 3-point attempts in the first half, but was 3 of 21 from beyond the arc the rest of the game. ... Paolo Banchero shot just 4 of 13 overall. Banchero finished with nine points, seven rebounds and five assists.\n\n\r\n              Bucks: The Bucks requested waivers on Sandro Mamukelashvili before the game. The 6-foot-10 forward had appeared in a combined 65 games for the Bucks over the last two seasons after they selected him out of Seton Hall in the second round of the 2021 draft. ... The Bucks rested Khris Middleton on the second night of a back to- ack as they monitor the right knee that caused him to miss 19 straight games earlier this season. .... Wesley Matthews missed a fourth straight game with a strained right calf. \n\n\r\n              UP NEXT\n\n\r\n              Magic: At Charlotte on Friday to close a three-game trip. The Magic are 2-1 against the Hornets this season.\n\n\r\n              Bucks: Host the Philadelphia 76ers on Saturday. The Bucks have split two matchups this season, both at Philadelphia. The Bucks won 90-88 on Oct. 20 and lost 110-102 on Nov. 18. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994321.09098
}