{
  "game_id": "0022400048",
  "espn_id": "401703417",
  "date": "Nov 29, 2024",
  "matchup": "LAL vs. OKC",
  "headline": "Shai Gilgeous-Alexander scores 36 points as Thunder defeat Lakers 101-93 in NBA Cup game",
  "body": "LOS ANGELES -- — Shai Gilgeous-Alexander scored 36 points, including 15 in the fourth quarter, and the Oklahoma City Thunder held on for a 101-93 victory over the Los Angeles Lakers in an NBA Cup game on Friday night.\n\n\r\n              It is the fifth time in the past six games Gilgeous-Alexander has scored at least 30 points. Jalen Williams added 19 points as the Thunder won their fourth straight.\n\n\r\n              Dalton Knecht scored 20 points, including five 3-pointers for the Lakers, who have dropped four of their last five. D’Angelo Russell had 17 points off the bench.\n\n\r\n              With the loss, Los Angeles can not advance to the quarterfinals after winning the inaugural NBA Cup tournament last year.\n\n\r\n              Phoenix, San Antonio and Oklahoma City are all 2-1 in West Group B while the Lakers are 2-2.\n\n\r\n              The Lakers drew within one point before Gilgeous-Alexander hit a 3-pointer with 1:35 remaining to put the Thunder up 95-91.\n\n\r\n              Takeaways\r\n              Thunder: Isaiah Hartenstein scored 11 points and pulled down a season-high 18 rebounds for his fourth double-double of the season. \n\n\r\n              Lakers: Anthony Davis had 15 points and 12 rebounds and LeBron James scored 12.\n\n\r\n              Key moment\r\n              The Lakers still had a chance to come back, down four with 22.4 seconds remaining, but Austin Reaves made a bad pass, which was stolen by Williams and led to an easy dunk to give Oklahoma City a 99-93 advantage.\n\n\r\n              Key stat\r\n              The Lakers committed four of their 17 turnovers in the fourth quarter. ... Oklahoma City tied a season high with 15 offensive rebounds.\n\n\r\n              Up next\r\n              The Thunder are at Houston on Sunday while the Lakers are at Utah on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997204.5380712
}