{
  "game_id": "0021700259",
  "espn_id": "400975010",
  "date": "Nov 22, 2017",
  "matchup": "HOU vs. DEN",
  "headline": "Trevor Ariza has 25 points, Rockets beat Nuggets 125-95",
  "body": "HOUSTON --  With Eric Gordon and Ryan Anderson out, Trevor Ariza decided it was his turn to let it fly from 3-point range.\n\nAriza scored a season-high 25 points, making 7 of 10 from beyond the arc, in the Houston Rockets' 125-95 victory over the Denver Nuggets on Wednesday night.\n\n\"Tonight was my night,\" Ariza said with a grin. \"If those guys are out, call on me. I get it, rightfully.\"\n\nAnderson (illness) and Gordon (right calf tightness) average 17.8 3-point attempts per game, but Ariza was more than happy to pick up the slack.\n\nChris Paul made 4 of 7 from 3 and had 23 points and 12 assists, while James Harden added 21 points, nine assists and eight rebounds.\n\nAfter missing a month because of a knee injury sustained in the season opener, Paul has re-entered Houston's rotation seamlessly.\n\n\"With the court open like that, we can get into the lane, but we've got options,\" Paul said. \"We've got lobs, we've got floaters, we've got whatever's there.\"\n\nThe Rockets have won nine of their last 10 games, and beat Denver for the fifth straight time after sweeping the series 4-0 last season.\n\nHouston led 75-40 at the half, the Rockets' largest halftime lead of the season.\n\nIn a scary moment for Denver midway through the second quarter, Nikola Jokic fell to the ground following a tipped layup with a non-contact injury. He limped off the court to the locker room but returned later in the quarter.\n\n\"I was really worried,\" coach Michael Malone said. \"To see Nikola go down like that and have no idea how serious it was going to be, you can tell the competitor he is. He could have easily said, `I'm going to hang out in the back and watch the rest of this one with my feet in a cold tub.' But he wanted to get back out there.\"\n\nWill Barton led Denver with 20 points, Jokic had 17, and Gary Harris added 13.\n\nDenver played its second game without Paul Millsap. He sustained a left wrist injury Sunday in a loss to the Los Angeles Lakers and is out indefinitely. Starting in his place, Wilson Chandler returned to action after missing a victory Monday night at Sacramento with back pain.\n\nP.J. Tucker started in Anderson's place, while Luc Mbah a Moute scored 13 points in 26 minutes behind Paul. Houston outscored Denver by 57 points in the 26 minutes that Mbah a Moute was on the floor, the best plus-minus by any player in a game over the last 20 seasons, including playoffs, according to ESPN Stats & Info.\n\n\"You've got to understand, I'm not surprised by any of that stuff,\" Paul said. \"Coach (Mike D'Antoni) -- especially early in the season -- would come and tell me, `Luc is good,' and I would be like, `I know.' I played with him. There's a trust factor there and I trust Luc as much as I trust myself.\"\n\nAfter losing two of three on the road trip, the Nuggets will play three of their next four in Denver, where they're 7-2 this season.\n\n\"The NBA is an up-and-down season with the highest of the highs one day and the lowest of the lows the next day,\" Malone said. \"It's been an emotional trip, losing one of our best players for an extended period of time and going home after a real tough loss. But we're going home together, united and have a great belief that we're headed in the right direction.\"\n\nTIP-INS\n\nNuggets: Denver scored a season-low 17 points in the first quarter while allowing a season-high 75 first-half points. ... Denver's bench was outscored 41-35, led by nine points each from Juancho Hernangomez, Mason Plumlee and Malik Beasley.\n\nRockets: Houston recalled rookie C Zhou Qi from Rio Grande Valley after he had 18 points and four blocks on Tuesday night for the G League affiliate. Briante Weber, who is averaging 17.9 points, 7.0 assists and 6.1 rebounds for Rio Grande Valley this season, was also recalled.\n\nKEEPING IT 100\n\nHouston held its opponent to 100 points or less for the fourth time in its last six games. Houston is 7-1 when holding opponents below the century mark this season and was 18-0 when doing so last season.\n\nHALL OF FAMERS IN THE HOUSE\n\nRockets Hall of Famers Hakeem Olajuwon and Elvin Hayes sat courtside next to Rockets owner Tilman Fertitta and were introduced to the crowd early in the second quarter. Olajuwon and Hayes also both played at nearby University of Houston.\n\nFREE THROW (NOT KICK)\n\nAs part of Houston's new \"First Shot\" promotion featuring a local celebrity shooting a pregame free throw for charity, Houston Dynamo defender DaMarcus Beasley rattled in his shot, securing a $5,000 donation from the Rockets to charity. The Dynamo are currently facing Seattle Sounders FC in the Western Conference Championship round.\n\nUP NEXT\n\nNuggets: Host Memphis on Friday night.\n\nRockets: Host the New York Knicks on Saturday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993634.4454799
}