{
  "game_id": "0022000032",
  "espn_id": "401267192",
  "date": "Dec 27, 2020",
  "matchup": "CHA vs. BKN",
  "headline": "Hayward, Hornets hand Nets first loss of season, 106-104",
  "body": "CHARLOTTE, N.C. -- — Gordon Hayward gave Hornets fans a little taste of why owner Michael Jordan felt strongly about luring him to Charlotte with a four-year, $120 million contract last month.\n\n\r\n                    Hayward, acquired in a sign-and-trade with Boston, had 28 points, seven assists and six rebounds, and Charlotte handed the Brooklyn Nets their first loss of the season, 106-104 on Sunday night.\n\n\r\n                    Hayward did a little bit of everything, making 12 of 20 shots while setting up his team with good scoring opportunities and helping the Hornets out of some potentially bad possessions with solid plays before the shot clock expired.\n\n\r\n                    “He brings us calm and poise out there,\" Hornets coach James Borrego said. “He settles us when we need a good possession, an efficient possession. He is able to create that.”\n\n\r\n                    The 6-foot-7 small forward said he's just starting to get comfortable with his new teammates after a limited training camp and missing two preseason games with a broken finger.\n\n\r\n                    “We are constantly building that chemistry,” Hayward said. “We didn’t have as much time as we wanted to get to know each other. We are starting to figure each other out. When I do, that will ultimately help me be a better playmaker.”\n\n\r\n                    Terry Rozier added 19 points, including two clutch free throws, and P.J. Washington finished with 14 points and 12 rebounds for the Hornets, who limited the Nets to 42.7% shooting from the floor.\n\n\r\n                    Kevin Durant led the Nets with 29 points, and Kyrie Irving chipped in with 25 points.\n\n\r\n                    After winning their first two games by 26 and 28 points, Brooklyn as finally in a close game in the fourth quarter, which Durant said he enjoyed. He also said the Nets need to learn they'll get everyone’s best game every night because they're considered a favorite in the East.\n\n\r\n                    “It’s good to have that target on your backs — and it will bring out the best in all of us,” Durant said.\n\n\r\n                    They certainly got Charlotte’s best game.\n\n\r\n                    “We have to treat every team like its Brooklyn,” Hayward said. “We had this sense of urgency.”\n\n\r\n                    The Hornets appeared to break open the game early in the fourth quarter behind seven quick points from Hayward.\n\n\r\n                    But the 16-point lead nearly evaporated as Durant and Irving began to play with a sense of urgency and helped cut the lead to 101-99 with less than two minutes to play. \n\n\r\n                    But with a chance to tie or take the lead, Irving's driving layup was blocked and Devonte Graham knocked down a corner 3 at the other end to give Charlotte a cushion. A short while later Durant missed an open pull-up jumper with 7.4 seconds left with the Nets trailing by two.\n\n\r\n                    Rozier made two free throws to make it a two-possession game and seal the win.\n\n\r\n                    “It looked good when it was leaving my hands,\" Durant said. \"Maybe I could have shot the 3 (instead). I’m sure we will get that shot later in the season and hopefully I can capitalize.”\n\n\r\n                    TIP INS\n\n\r\n                    Nets: Spencer Dinwiddle left the game in the third quarter with a right knee strain and did not return. It's unclear if he will play Monday night. ... Brooklyn was outrebounded 54-46.\n\n\r\n                    Hornets: Washington appeared to roll his ankle with 5.3 seconds remaining and left the game. Borrego said the power forward sprained his ankle, but isn't sure the extent of the injury. \n\n\r\n                    THAT DUNK\n\n\r\n                    In what was clearly the play of the night, the 6-foot-1 Rozier took a look-ahead pass from LaMelo Ball and posterized the 6-foot-10 Durant with a one-handed dunk, drawing the foul for a three-point play.\n\n\r\n                    INJURED REF\n\n\r\n                    Referee JT Orr injured his knee early in the fourth quarter and had to leave the court. The rest of the game was officiated by two referees.\n\n\r\n                    THE PAINT\n\n\r\n                    The Hornets outscored the Nets 64-26 in the paint.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host the Grizzlies on Monday night, the start of a six-game homestand.\n\n\r\n                    Hornets: Head to Dallas on Wednesday night looking for their first road win.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997054.0756638
}