{
  "game_id": "0022200252",
  "espn_id": "401468407",
  "date": "Nov 21, 2022",
  "matchup": "MIA @ MIN",
  "headline": "Towns scores 25, Wolves hold on against Heat for 105-101 win",
  "body": "MINNEAPOLIS -- — Karl-Anthony Towns had 25 points and Anthony Edwards scored 10 of his 22 in the third quarter as the Minnesota Timberwolves outlasted the shorthanded Miami Heat for a 105-101 victory Monday night.\n\n\r\n              Down to eight players due to injuries and rest on the second night of a back-to-back, Miami led by 15 in the first half before Edwards sparked a third-quarter run and Minnesota finally started to knock down 3-pointers to erase the deficit.\n\n\r\n              Jaden McDaniels added 18 points for the Timberwolves and Jordan McLaughlin hit a career-high four 3s, three in the third period, as Minnesota won its fourth straight game.\n\n\r\n              “Coach lit a fire under us at halftime, and we came out and I felt like we saw the ball go in the hoop a little more,” Towns said. “And I think everyone could see the intensity of ours pick up, especially defensively.”\n\n\r\n              Kyle Lowry led the Heat with 21 points and Max Strus had 19. Bam Adebayo, playing in back-to-back games while dealing with a knee injury, had 17 points and 14 rebounds for Miami, which has lost four in a row.\n\n\r\n              “It’s just a shame,” Heat coach Erik Spoelstra said. “We weren’t able to make enough plays. I thought our defense was stable enough.”\n\n\r\n              Jimmy Butler missed his third straight game with a knee injury for the Heat, who were also without Tyler Herro, Duncan Robinson and Gabe Vincent.\n\n\r\n              Despite being depleted and coming off a 113-87 loss at Cleveland a night earlier, it was Miami that had the most energy in the first half and Minnesota that struggled to convert from 3-point territory.\n\n\r\n              The Wolves shot just 3 of 25 from 3 in the opening half. Meanwhile, the Heat were plus-five in rebounding, led 17-2 in fast-break points and went 12 of 14 from the free throw line.\n\n\r\n              “We just didn’t play very hard,” Minnesota coach Chris Finch said. “Got to play harder. We’ve been playing harder. We didn’t have a lot of juice in the first half, and I don’t know exactly why. Sometimes when you come back from a road trip that’s how it is. It’s one of the things in the NBA that happens.”\n\n\r\n              A big defensive play by Edwards finally shook Minnesota from its doldrums. Strus drove and elevated for a possible dunk that was blocked by Edwards. He hit a 3 on the other end as the restless home crowd erupted.\n\n\r\n              McDaniels and McLaughlin drained 3s on the next two possessions to cap a 21-4 run as the Wolves took the lead. McLaughlin added two more 3s and Minnesota was 7 of 11 from beyond the arc in the quarter.\n\n\r\n              Tied 99-all with 3:31, the Wolves went in front and held on thanks to Rudy Gobert finishing at the free throw line. Gobert went without a shot from the floor in the game but sank all four attempts from the line in the final seconds.\n\n\r\n              “I’m not saying this as an excuse: The fourth quarter, you know, the guys’ legs are probably a little bit dead from this road trip,” Spoelstra said. \"They’ve been playing major minutes. That’s not to take anything away from the Timberwolves. That’s certainly not to make an excuse for anything. Guys are giving everything they have.”\n\n\r\n              NOT YET\n\n\r\n              Minnesota played for the first time in its new City Edition uniforms, a colorful contrast from the team’s regular blue, black and green color scheme.\n\n\r\n              What the Timberwolves weren’t able to show off was their new court to match the new uniforms. The team had a new colorful court designed to match the uniforms but had to switch back to its regular court after an imperfection was found in the new one.\n\n\r\n              NOT A FAN\n\n\r\n              Gobert took issue with booing from the home fans as the Wolves struggled in the second quarter and early in the third.\n\n\r\n              “I just don’t appreciate people that come in to boo your team,” Gobert said. “When you’re a fan, you've got to support your team in the tough or the good moments. There’s no team in NBA history that only had good moments, so if you’re not going to support us in the tough moments, just stay home. I think if you’re going to embrace us in the tough moments, then come and then we’re going to love the support.”\n\n\r\n              TIP-INS\n\n\r\n              Heat: Robinson (ankle) was out of the lineup for the second time in three games. Vincent (knee) was questionable before the game but missed his third straight. Miami is also without Udonis Haslem (personal), Victor Oladipo (knee) and Omer Yurtseven (ankle). Herro has an ankle injury.\n\n\r\n              Timberwolves: McLaughlin, who was 4 of 5 from 3, was shooting 12.5% from beyond the arc this season. … Towns was two rebounds and one assist shy of a triple-double before fouling out late.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host the Washington Wizards for two in a row starting Wednesday.\n\n\r\n              Timberwolves: Play at Indiana on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995160.925421
}