{
  "game_id": "0022300263",
  "espn_id": "401584891",
  "date": "Nov 29, 2023",
  "matchup": "HOU @ DEN",
  "headline": "Jokic's triple-double lifts Nuggets past Rockets 134-124 in Murray's return",
  "body": "DENVER -- — Nikola Jokic had 32 points, 15 assists and 10 rebounds, Michael Porter Jr. scored a season-high 30 points and the Denver Nuggets rolled past the Houston Rockets 134-124 on Wednesday night in Jamal Murray's return from a hamstring injury.\n\n\r\n              Murray scored 16 points after missing Denver’s past 11 games. After starting 6-1 with Murray available, the Nuggets were just 6-5 without their point guard.\n\n\r\n              His presence led Denver to one of its best offensive outings of the season, with 19 made 3-pointers and 37 assists to just three turnovers.\n\n\r\n              “One of the security guards said, ‘Hey, great win tonight.’ I said it was a great outcome,” Nuggets coach Michael Malone said. \"I wouldn’t call it a great win. It was a great outcome.”\n\n\r\n              It was the third consecutive win for the NBA champion Nuggets, who had lost four of five before their current streak.\n\n\r\n              Jokic, who was sidelined with a lower back injury in a win Monday at the Los Angeles Clippers, recorded his seventh triple-double of the season. Entering the night, all other NBA players had combined for just eight triple-doubles.\n\n\r\n              “This is pretty easy basketball when you’ve got someone that good with the floater, but also that good at passing,\" said Porter, who had 10 rebounds and made seven of his 12 3s.\n\n\r\n              Denver had lost twice to the Rockets in November, including a 19-point loss in Houston five days earlier. The Nuggets improved their NBA-best home record to 9-0 while dropping the Rockets to 0-7 on the road.\n\n\r\n              While Murray returned, Denver was without forward Aaron Gordon, who missed his third consecutive game with a strained right heel.\n\n\r\n              Welcomed with a roaring “He’s back!” from the public address announcer and a hearty ovation from the home crowd before tip-off, Murray injured his ankle after he came down awkwardly on a missed contested shot at the rim two minutes into the game and walked gingerly back to the bench after a Nuggets timeout. He immediately returned out of the timeout and finished with 22 minutes played, though he described his ankle injury as “frustrating.”\n\n\r\n              “The hamstring’s fine,\" Murray said. \"I’ve worked enough to get it back to strength. Now, it’s just another thing. I’ve got to work on that and hopefully I’ll be ready.”\n\n\r\n              After that initial scare, his team had little reason to worry the rest of the night.\n\n\r\n              Led by 12 points from Porter, the Nuggets scored a season-high 41 points in the first quarter and led by as many as 19 in the period. Denver never trailed and led by double digits for all but the opening 4:16 against a Houston team that was playing the second night of a back-to-back after a loss Tuesday night at the Dallas Mavericks.\n\n\r\n              “We just woke up pretty late,\" Rockets guard Jalen Green said. \"If we started off a little bit better, it would have been a different story.”\n\n\r\n              Green paced the Rockets with 26 points, including 18 in a third quarter in which he made all six of his field goals and all four of his 3s. Alperen Sengun added 22 points for Houston, which lost for the fifth time in seven games following a surprise 6-3 start.\n\n\r\n              The Rockets were without guard Fred VanVleet, the team’s third-leading scorer and $130 million offseason acquisition, who was sidelined with a sprained left thumb.\n\n\r\n              UP NEXT\n\n\r\n              Denver: At Phoenix on Friday.\n\n\r\n              Houston: At Los Angeles Lakers on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995630.598142
}