{
  "game_id": "0021600808",
  "espn_id": "400900213",
  "date": "Feb 11, 2017",
  "matchup": "CHA vs. LAC",
  "headline": "Griffin, Rivers lead Clippers to 107-102 win over Hornets",
  "body": "CHARLOTTE, N.C. --  A strong bench made up for a shaky start for the Los Angeles Clippers.\n\nBlake Griffin had 20 points and 12 rebounds, Austin Rivers scored 16 of his 18 points in the second half and the Clippers beat the Charlotte Hornets 107-102 on Saturday night.\n\nGriffin finished two assists shy of his second triple-double in his past three games. Jamal Crawford provided a spark off the bench, scoring 22 points while going 5 for 8 on 3-pointers.\n\nThree of Crawford's 3-pointers came in the second half, when Los Angeles shot 8 for 13 from behind the arc after going 6 for 21 in the first.\n\n\"In the first half I thought we got great shots. We couldn't make shots, but we still scored,\" Clippers coach Doc Rivers said. \"The second half I thought we started making the 3s and that opened the floor for us.\"\n\nNicolas Batum had 25 points, six rebounds and eight assists for the Hornets, who have lost nine of their past 10 games.\n\nThe Clippers started 0 for 6 from the field, and the Hornets extended their lead to 11 points in the first quarter. Griffin, however, had 11 points, three rebounds and four assists in the period to help Los Angeles enter the second with a 29-27 lead.\n\nThe Clippers received significant contributions from their bench after that, and they ultimately outscored the Hornets 47-30. Los Angeles is 19-9 when its bench outscores its opponents'.\n\n\"I thought the bench, they all had pluses,\" Doc Rivers said. \"I thought in the second quarter they were phenomenal and in the third quarter, the beginning of the fourth, they came in and gave us another stretch.\"\n\nNeither team led by double digits again until the Clippers seized an 11-point edge with about 11 minutes left in the fourth quarter.\n\nLed by Frank Kaminsky, who scored 12 of his 20 points in the fourth, the Hornets cut the deficit to three points with less than 4 minutes left. But after an alley-oop layup by DeAndre Jordan, Austin Rivers made a 3-pointer with less than 2 minutes remaining to give Los Angeles an eight-point edge.\n\nCharlotte pulled within three points again moments later, but Griffin put back Austin Rivers' miss with 44 seconds left to give the Clippers a five-point lead and ultimately their first two-game winning streak since Jan. 14-16.\n\n\"We're right there. We get good leads sometimes and we can't close it,\" Batum said. \"We were pretty good last year, we were pretty good to start, the first 25 games, we never lost those games. We're right there every time, but we've got to figure out how to make plays.\"\n\nTIP-INS\n\nClippers: Starting again for Chris Paul (left thumb), former Bobcats guard Raymond Felton had nine points, seven rebounds and five assists. ... Los Angeles has won five straight meetings against the Hornets. ... Crawford (2,009) passed Vince Carter (2,006) for fifth-most 3-pointers made in NBA history.\n\nHornets: Center Cody Zeller (quad soreness) did not play. Zeller has missed eight of Charlotte's past nine games. ... Marco Belinelli and Jeremy Lamb combined for all 30 of the Hornets' bench points.\n\nDOC RIVERS ADAPTS\n\nDiscussing Kemba Walker's playing time, Hornets coach Steve Clifford said Hall of Famers Michael Jordan, Charlotte's owner, and Patrick Ewing, the team's associate head coach, are confounded by the concept of players sitting out regular-season games.\n\nHaving played in the same era as Jordan and Ewing, Doc Rivers said he understands their point of views. But Rivers added he's adapted, turning to conditioning and sleep experts for advice.\n\n\"I don't talk to any of the ex-players about rest because they kill me,\" he said. \"They don't want to hear it. We were programmed differently.\"\n\nUP NEXT\n\nClippers: Visit Utah on Monday in the final game of their five-game road trip.\n\nHornets: Host Philadelphia on Monday in their last home game until March 6.",
  "source": "espn_api",
  "crawled_at": 1764995490.878572
}