{
  "game_id": "0022200595",
  "espn_id": "401468750",
  "date": "Jan 07, 2023",
  "matchup": "LAL @ SAC",
  "headline": "LeBron James scores 37 points, Lakers beat Kings 136-134",
  "body": "SACRAMENTO, Calif. -- — LeBron James scored 37 points, Dennis Schroder made two free throws with 3.6 seconds left and the Los Angeles Lakers beat the Sacramento Kings 136-134 on Saturday night for their fifth straight victory.\n\n\r\n              \"Trending in the right direction and learning from our mistakes,” Lakers coach Darvin Ham said. “At the end of the day, everything we have gone through I think has been a huge education for us. We are trending in the right direction currently.”\n\n\r\n              De’Aaron Fox had 34 points and nine assists for Sacramento. He missed a halfcourt shot at the buzzer.\n\n\r\n              Schroder finished with 27 points to help the Lakers improve to 19-21 with their sixth victory in seven games.\n\n\r\n              James also had eight rebounds and seven assists. He drew Domantas Sabonis’ sixth foul with 48.1 seconds left and converted the shot and free throw to give the Lakers a one-point lead.\n\n\r\n              Thomas Bryant added 29 points and 14 rebounds for the Lakers.\n\n\r\n              “It says a lot about the confidence,” Bryant said. “Strong resiliency that we try and bring each and every night out. I know each and every last one of those guys are proud of each other out there.”\n\n\r\n              Sabonis had 25 points, 12 rebounds and seven assists. Harrison Barnes scored 18 points and Kevin Huerter had 17.\n\n\r\n              “Bottom line is we have to figure out somehow, someway to stop people,” Kings coach Mike Brown said. “Defensively we are not good, at all.”\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Los Angeles ruled out G Lonnie Walker lV (left knee tendinitis), G Austin Reaves (left hamstring strain) and F Troy Brown Jr. (left quad strain) before the game. F Anthony Davis remains out with right foot soreness. … Lakers coach Darvin Ham received a technical foul with 11:03 left in the second quarter. …James got a technical foul with 6:26 left in the first half.\n\n\r\n              Kings: G Malik Monk was ruled out with a calf injury. Sacramento coach Mike Brown said pregame it was Brown’s decision to sit Monk. … All five Kings starters scored in double-digits for the 13th time this season.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Denver on Monday night.\n\n\r\n              Kings: Host Orlando on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994135.024501
}