{
  "game_id": "0022000085",
  "espn_id": "401267245",
  "date": "Jan 03, 2021",
  "matchup": "DET vs. BOS",
  "headline": "Tatum lifts Celtics past Pistons for weekend split",
  "body": "DETROIT -- — Jayson Tatum hit a fallaway as Blake Griffin stumbled with 2.9 seconds left, then tied up the Detroit veteran on the other end to help the Boston Celtics beat the Pistons 122-120 on Sunday for a weekend split.\n\n\r\n                    Jaylen Brown led Boston with 31 points. He hit a late 3-pointer and was 13 of 16 from the field, two nights after his late miss sealed a loss in the opener in Detroit.\n\n\r\n                    “We haven’t been good, especially down the stretch, executing-wise,” said Marcus Smart, who added 17 points and eight assists. “We got to our spots, we got the ball where we wanted it, and those two players made great shots and great reads. They won us the game.”\n\n\r\n                    Tatum had 24 points and 12 assists for Boston. The Celtics shot a season-best 57%.\n\n\r\n                    “It seems like they made every shot, especially Brown,” Pistons coach Dwane Casey said. “I want to see how many teams do a good job on Jaylen Brown and Tatum. They’re probably two of the most dynamic players I’ve seen in a while.”\n\n\r\n                    Jerami Grant scored 22 points for the Pistons, his career-best fifth straight game with at least 20. Svi Mykhailiuk had 15 points despite not entering the game until under four minutes left in the third quarter.\n\n\r\n                    Semi Ojeleye hit three 3-pointers in less than five minutes to open the fourth quarter for Boston. Sekou Doumbouya and Mykhailiuk responded with back-to-back 3s to give Detroit a 108-106 lead with 6:01 left.\n\n\r\n                    Mykhailiuk scored eight straight Detroit points, and the Pistons took a 118-117 lead on Mason Plumlee’s free throws with 42.2 seconds left. That set up Brown’s 3-pointer with 34.0 seconds to go, and Grant made two free throws 12 seconds later to tie it at 120.\n\n\r\n                    On Friday night, Detroit beat Boston 96-93 for its only victory of the season, with the Celtics missing their final 10 shots and going scoreless for the final 4:15.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: This was Boston’s second pair of consecutive games against the same opponent in the same city this season, and second split of those games. The format is new to the NBA schedule this year. The Celtics also split with Indiana. … The Celtics did not attempt a free throw in the first half.\n\n\r\n                    Pistons: Josh Jackson went down with a right lower-leg injury early in the third quarter when he was fouled on a transition layup. He made the shot and the subsequent free throw, but was taken out of the game and did not return. Casey did not have an update after the game. … Griffin returned for the Pistons after missing a game in the NBA’s concussion protocol. … Griffin, Jackson and Plumlee had 13 points apiece.\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Vs. Toronto in Tampa, Florida, on Monday night.\n\n\r\n                    Pistons: At Milwaukee on Monday and Wednesday nights.",
  "source": "espn_api",
  "crawled_at": 1764997922.693388
}