{
  "game_id": "0022000623",
  "espn_id": "401307408",
  "date": "Mar 17, 2021",
  "matchup": "MIA @ MEM",
  "headline": "Morant layup with 1.2 seconds left lifts Grizzlies over Heat",
  "body": "MEMPHIS, Tenn. -- — Ja Morant dribbled the length of the court for a tiebreaking layup with 1.2 seconds left and the Memphis Grizzlies beat the Miami Heat 89-85 on Wednesday night to end a three-game skid.\n\n\r\n                    Memphis’ Kyle Anderson intercepted the inbound pass after Morant’s basket, was fouled and made two free throws to end Miami’s winning streak at five. \n\n\r\n                    The go-ahead bucket was similar to five days earlier when Morant’s closing drive against Denver was thwarted at the rim by center Nikola Jokic, leading to a Grizzlies loss.\n\n\r\n                    This time, the result was different.\n\n\r\n                    “Go get a bucket,” Morant said when asked about the play. “The same mindset I had against the Nuggets. … I was happy I was able to make the shot for us and hang on to the win.”\n\n\r\n                    “He's special,” Memphis coach Taylor Jenkins said. \"Him going in and scoring that bucket, going fullcourt with no timeouts left, speaks volumes to his ability and what he is able to do in clutch time.”\n\n\r\n                    Morant, Anderson and De’Anthony Melton each scored 13 points, and Melton also had 10 rebounds and six assists.\n\n\r\n                    Jimmy Butler was questionable to play after twisting his left ankle late in Tuesday’s win over Cleveland but led the Heat with 24 points on 10-of-20 shooting — among the few decent efforts in a poor-shooting game. Bam Adebayo scored 15 points and Duncan Robinson finished with 13.\n\n\r\n                    The Heat struggled to score through much of the night, playing their fifth game in seven days.\n\n\r\n                    “I am encouraged by our competitive spirit, playing a game in the mud,” Heat coach Erik Spoelstra said. “Possession game, down the stretch, everything did matter.”\n\n\r\n                    Memphis was able to create some buffer late in the third quarter with 17 consecutive points and led 72-63 entering the fourth.\n\n\r\n                    Tyler Herro and Butler helped Miami tie it at 83 with 1:12 remaining. The score was tied again at 85 after a pair of free throws by Goran Dragic, setting the stage for Morant’s layup off an inbound pass. \n\n\r\n                    Morant got around Butler and got the shot off as Dragic came over to try and contest the attempt.\n\n\r\n                    “I’ve got to do my job,” said Butler, who guarded Morant from the inbound pass in the backcourt. “I’ll take that. That’s OK. I’ll be better the next time I’m in that situation, that position to get a stop. That’s what I’m here to do. I did not do that.”\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Wednesday marked Spoelstra’s 1,000th game as coach of the Heat. “I’m extremely humbled by that, and I’m really grateful for the people I work for,” said Spoelstra, only the third coach in NBA history to reach that milestone coaching one team in his career (Gregg Popovich, Spurs; Al Attles, Warriors). ... Barring a schedule change, this was Miami’s fifth and final one-game road trip of the season. … G/F Andre Iguodala (left hip soreness) and F Moe Harkless (illness) did not travel to Memphis for the game. ... Butler has 14 straight games with a steal.\n\n\r\n                    Grizzlies: Memphis began a stretch of four home games over the next six days. ... Jenkins tweaked his starting lineup, with Grayson Allen playing alongside Morant at guard, while rookie Desmond Bane moved back to the second unit. ... Dillon Brooks started his 181st game for Memphis, tying him with O.J. Mayo for 14th on the franchise list.\n\n\r\n                    ARIZA TRADE\n\n\r\n                    Miami made a trade with Oklahoma City on Wednesday, acquiring Trevor Ariza for Meyers Leonard and a 2027 second-round pick. Ariza has been working out privately in Miami. “I know he’s in great shape. His fitness level is extremely high. He’s been putting in a lot of work. You can’t fake that,” Spoelstra said, adding he doesn’t have a timetable on when Ariza would be ready to play.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Host the Indiana Pacers on Friday.\n\n\r\n                    Grizzlies: Continue a four-game homestand with back-to-back games with the Golden State Warriors beginning Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996783.039225
}