{
  "game_id": "0022200428",
  "espn_id": "401468583",
  "date": "Dec 16, 2022",
  "matchup": "CHA vs. ATL",
  "headline": "Young scores 31, Hawks hold off Ball, Hornets 125-106",
  "body": "CHARLOTTE, N.C. -- — Trae Young scored 31 points, Bogdan Bogdanovic made the most of his first start of the season with 28 points on 7-of-10 shooting from 3-point range and the depleted Atlanta Hawks handed the Charlotte Hornets their seventh straight loss, 125-106 on Friday night.\n\n\r\n              AJ Griffin had 13 points and Frank Kaminsky added 12 off the bench for the Hawks, who built a 24-point lead while shooting 63% from the field in the first half. The Hawks withstood a 16-2 run by the Hornets to start the second half and pulled away in the fourth quarter.\n\n\r\n              Atlanta (15-15) won despite playing without Clint Capella (calf strain), John Collins (ankle sprain) and Dejounte Murray (ankle sprain).\n\n\r\n              Led by Boganovic, the Hawks got off to a great start with 50 points in the first 16 minutes and shot 51.7% (15 of 29) from beyond the arc.\n\n\r\n              “We have been playing our young guys and bringing Bogey off the bench to bring some balance,\" Hawks coach Nate McMillan said. \"But the restrictions were taken off him and I felt like needed to put some know-how out there.”\n\n\r\n              Bogdanovic has played in just seven games this season while battling back from a knee injury.\n\n\r\n              “Everybody likes to start, but I like to finish the game more, honestly,\" Bogdanovic said. “So I talked to the coach and said ‘Whatever you need. ... Whatever is better for the team.'\"\n\n\r\n              Young said it helped having Bogdanovic in the lineup and that it contributed to the fast start.\n\n\r\n              “He has the ability to space the floor with his shooting,” Young said. \n\n\r\n              LaMelo Ball had 27 points on seven 3-pointers in his second game back from an ankle injury for the Hornets, who are a league-worst 7-22. Nick Richards added 13 points and 11 rebounds for Charlotte.\n\n\r\n              Kelly Oubre and Terry Rozier each had a nine-game streak of scoring at least 20 points, but the Hawks kept them in check. Oubre had 16 points and Rozier was limited to 10.\n\n\r\n              Gordon Hayward, who missed nine consecutive games with a fracture in his left shoulder, returned to the lineup and finished with nine points on 3-of-9 shooting for Charlotte.\n\n\r\n              After giving up 141 points in a loss to the Detroit Pistons on Wednesday night, an exasperated Hornets coach Steve Clifford called out his team for its non-existent defense. But the Hornets had another rough outing defensively, surrendering 75 points in the first half.\n\n\r\n              Clifford felt it was more of what the Hawks were doing, rather than his team's lack of effort on this night.\n\n\r\n              “I told our guys after the first timeout we looked like a different team than the other night,” Clifford said. “... But the way (the Hawks) played tonight, they are going to beat most teams.”\n\n\r\n              Hayward said the Hornets need to stick together if they hope to rebound from their current seven-game skid.\n\n\r\n              “We have to try to figure it out here and it certainly won't get any easier. It’s the NBA,” Hayward said. “Things have to start on the defensive end for us. Every night is not going to be good on the offensive end, so we have to give ourselves a chance and that's starts on the defensive end.”\n\n\r\n              TIP INS\n\n\r\n              Hawks: Coach Nate McMillan said Capella is day to day, while Collins and Murray are working their way back. ... Young was 13 of 14 from the line.\n\n\r\n              Hornets: Clifford, Ball and Oubre were assessed technical fouls. ... McDaniels got the start for P.J. Washington, who was out due to personal reasons.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Orlando on Monday night.\n\n\r\n              Hornets: Begin a six-game road trip Sunday night at Denver.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994281.052256
}