{
  "game_id": "0021800939",
  "espn_id": "401071612",
  "date": "Mar 02, 2019",
  "matchup": "MEM @ DAL",
  "headline": "Valanciunas, Noah dominate, Grizzlies beat Mavericks 111-81",
  "body": "DALLAS --  Jonas Valanciunas brought physical play to the new-look Memphis Grizzlies, and the Dallas Mavericks noticed.\n\nValanciunas had 20 points and 10 rebounds, and backup center Joakim Noah scored 12 points to lead Grizzlies to a 111-91 victory over the Mavericks on Saturday night.\n\nMemphis had its largest margin of victory this season in winning for the second time in seven games. Dallas suffered its most lopsided loss of the season. The Mavericks have won one of their last seven games.\n\n\"We got our butts kicked, plain and simple,\" Tim Hardaway Jr. said. \"That's a physical basketball team, especially on the defensive end.\"\n\nDallas coach Rick Carlisle listed ways the Grizzlies excelled against his team.\n\n\"They were physical, they controlled the paint. They set a very physical tone. The NBA game isn't a game where you can come out and ease into it. You have to jump into it, and we just didn't do that.\"\n\nAvery Bradley and rookie Jevon Carter each scored 15 points for the Grizzlies. Mike Conley and C.J. Miles each contributed 12 points.\n\nValanciunas has had at least 20 points and 10 rebounds in three of his six games with Memphis, since being traded from Toronto.\n\nValenciunas said he, Bradley, Miles and Tyler Dorsey, all acquired on Feb. 7, are becoming integrated into the team.\n\n\"Slowly we are. That's what we're working towards. We're trying to learn small things, little things like how to play with each other, how to know your teammates.\"\n\nConley, who has played his entire 12-year career with Memphis, noticed that progression.\n\n\"It feels good to just see guys really developing in front of your eyes. With so many new faces and young guys, having a game like this just shows you what we can do when everything's clicking.\"\n\nLuka Doncic led the Mavericks with 22 points. Dwight Powell had 13 and Hardaway scored 10. The Mavericks shot a season-low 31 percent (26 for 85) from the field. They made only 7 of 40 3-pointers (18 percent).\n\n\"We let our shot making, or lack thereof, kind of dictate the game,\" Mavericks guard Devin Harris said. \"They came out and played harder.\"\n\nGrizzlies coach J.B. Bickerstaff said his defense was prepared.\n\n\"We knew they were going to shoot a bunch of 3s. What we wanted to do was limit the amount of open space that we gave up.\"\n\nThe Grizzlies used a 9-0 run to take a 33-21 lead after the first quarter. The Mavericks didn't shoot or rebound well in the first 12 minutes. They were 7 for 21 (33 percent) from the field, including 1 for 8 on 3-pointers. They were also outrebounded 14-8.\n\nDallas pulled within six points at 41-35 midway through the second quarter, but the Grizzlies increased their lead to as many as 16 points and led 62-49 at halftime.\n\nDallas scored the first six points of the second half on 3-pointers by Dirk Nowitzki and Doncic, but it was mostly downhill from there.\n\nTIP-INS\n\nGrizzlies: They led by as many as 36 points. The previous largest margin of victory was 21 points, 117-96, against Phoenix on Oct. 27. . F Justin Holiday slipped to the floor and injured his right knee in the first quarter. The Grizzlies said he could have returned to the game, but didn't. . Only Kobe Bryant has scored more career points against Memphis than Dallas' Dirk Nowitzki's 1,467. Bryant had 1,636.\n\nMavericks: Dallas previous most lopsided loss this season was 26 points, at New Orleans on Dec. 5. . Doncic missed all five 3-point attempts in the first half. When he canned his first 3-pointer 54 seconds into the second half, he raised his arms triumphantly. His missed his final two attempts. . Dallas has made five or more 3-pointers in 244 straight games. .  Hardaway was in the starting lineup after missing Friday's practice because of an illness.\n\nUP NEXT\n\nGrizzlies: At Oklahoma City on Sunday.\n\nMavericks: Begin a three-game trip at Brooklyn on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994905.19253
}