{
  "game_id": "401810106",
  "espn_id": "401810106",
  "date": "Nov 18, 2025",
  "matchup": "ATL vs DET",
  "headline": "Pistons win 11th straight for their longest streak in 18 years, 120-112 over short-handed Hawks",
  "body": "ATLANTA -- — Cade Cunningham returned from injury with 25 points and 10 assists as the Detroit Pistons won their 11th straight game, 120-112 over the short-handed Atlanta Hawks on Tuesday night.\n\n\r\n              Jalen Duren added 24 points for the Pistons (13-2), who have their best start since going 15-2 out of the gates in 2005-06. That team finished 64-18 and reached the Eastern Conference finals. The Pistons have the NBA's longest winning streak this season and their longest since an 11-gamer during the 2007-08 season, the last time they won a playoff series. That team went 59-23 and also reached the East finals.\n\n\r\n              Duncan Robinson had 14 points including three 3-pointers in the first five minutes for an early spark for the Pistons, who beat Indiana at home on Monday.\n\n\r\n              Cunningham became the first player in Pistons history with 25-plus points and 10-plus assists in five consecutive games played.\n\n\r\n              Jalen Johnson had 25 points, eight rebounds, nine assists and three steals for the Hawks (9-6), who snapped a five-game win streak. Atlanta was missing starting forward Zaccharie Risacher with a hip injury from their previous game on Sunday suffered from an awkward fall following a dunk. Star guard Trae Young and starting center Kristaps Porzingis have also been sidelined by knee injuries.\n\n\r\n              Nickeil Alexander-Walker scored 24 points and Onyeka Okongwu added 21 for the Hawks, who trailed by 19 in the second quarter and 94-80 late in the third before an 18-5 run cut the deficit to one with 6:08 remaining.\n\n\r\n              Alexander-Walker's two free throws with 1:36 left brought the Hawks within two, but Cunningham, who missed the last three games with a hip injury, answered with a jumper and the Pistons inched away. \n\n\r\n              Dyson Daniels, who received his Most Improved Player award in a ceremony before the game, had 12 points, nine rebounds, six assists and three steals for the Hawks.\n\n\r\n              Up next\r\n              The Pistons play at Milwaukee on Saturday. The Hawks play at San Antonio on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042649.2979252
}