{
  "game_id": "0022000922",
  "espn_id": "401307724",
  "date": "Apr 26, 2021",
  "matchup": "MIA vs. CHI",
  "headline": "Bulls hold off Heat late, win 110-102 in Miami",
  "body": "MIAMI -- — The mindset for plenty of teams at this point in the season, the Chicago Bulls included, couldn't be more simple.\n\n\r\n                    Win — or else.\n\n\r\n                    It worked for them Monday, when they found a way to claw closer to one of the play-in spots in the Eastern Conference. Nikola Vucevic scored 24 points, Daniel Theis added 23 and the Bulls pulled away in the final minutes to beat the Miami Heat 110-102.\n\n\r\n                    Chicago moved within a game of Washington for 10th place in the East and the last berth in the play-in tournament. The Wizards lost earlier Monday to San Antonio.\n\n\r\n                    “We have to focus on ourselves, make sure we bring it every night and we approach every game as if it's a win-or-go-home type of mentality,\" Vucevic said. “Try to take care of business ourselves, and hopefully things work out from other teams.\"\n\n\r\n                    Coby White added 17 points for the Bulls, who finished the game on a 36-20 run and outrebounded Miami 51-34. Theis had 12 rebounds and Vucevic 11 for Chicago.\n\n\r\n                    Jimmy Butler scored 33 points and Bam Adebayo added 23 for Miami, which missed a chance to move into the No. 6 spot in the East and give coach Erik Spoelstra his 600th career regular-season win. Trevor Ariza added 18 points for the Heat.\n\n\r\n                    The Heat remained No. 7, a half-game behind Boston for the final guaranteed playoff spot in the East, plus lost a chance to close within a game of No. 5 Atlanta. Miami was without Kendrick Nunn (neck) and Tyler Herro (foot), who missed the game with injuries, then lost Duncan Robinson to illness in the second half.\n\n\r\n                    And without three of their best shooters, the Heat were 7 for 36 from 3-point range.\n\n\r\n                    “Nobody's going to feel sorry for us,” Spoelstra said. “Nobody cares what any particular team is going through and everybody is going through something. We had guys out tonight, so it's a heavier workload for Jimmy and Bam, for sure, and I thought we really competed. We weren't able to get some key stops at key moments.”\n\n\r\n                    Chicago beat Miami for the first time in three tries this season, and Theis had 10 points and seven rebounds in the fourth quarter alone — playing all 12 minutes.\n\n\r\n                    “You always feel his presence,” Bulls coach Billy Donovan said.\n\n\r\n                    It was tied with 5:01 left, and the ending was all Bulls. Chicago held Miami to 2 for 12 shooting in that span, finishing the game on a 13-5 run.\n\n\r\n                    “We didn't guard for the entire game,\" Butler said. “We just outscored them for a little bit, and in the end we weren't able to outscore them. That's the way we've been all year long, honestly.\" \n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Lauri Markkanen had 12 points for Chicago, while Garrett Temple and Thaddeus Young each scored 10. ... Former Bulls center, three-time NBA champion and longtime radio color commentator Bill Wennington turned 58 on Monday.\n\n\r\n                    Heat: Victor Oladipo (knee) missed his 10th straight game, and another 3-point threat for Miami — Andre Iguodala — was out with a bad hip. ... Robinson's team-record 25-game streak of games with multiple 3s was snapped.\n\n\r\n                    VUCEVIC VS. HEAT\n\n\r\n                    This was the fifth time Vucevic faced Miami this season, including three games before he was traded by Orlando. He had 127 points and 63 rebounds against the Heat in 2020-21; only Houston's Hakeem Olajuwon (152 points, 76 rebounds in 1988-89) and New York's Patrick Ewing (149 points, 66 rebounds in 1989-90) have ever had that many points and rebounds in a season against Miami. Olajuwon and Ewing both faced Miami six times in those seasons.\n\n\r\n                    BUTLER VS. BULLS\n\n\r\n                    Butler has faced the Bulls seven times and has scored at least 20 points against his former club in each of those games. His career average — 27.3 points — against Chicago is, by far, his most against any opponent; his 22.0-point average against the Los Angeles Lakers is second.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Visit New York on Wednesday.\n\n\r\n                    Heat: Host San Antonio on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996756.467202
}