{
  "game_id": "0021900794",
  "espn_id": "401161436",
  "date": "Feb 10, 2020",
  "matchup": "BKN @ IND",
  "headline": "Dinwiddie's basket gives Nets win, Pacers 6th straight loss",
  "body": "INDIANAPOLIS --  Spencer Dinwiddie struggled to find his shooting touch Monday night.\n\nHe rediscovered it in the nick of time for Brooklyn.\n\nDinwiddie calmly knocked down the go-ahead 21-footer with 5.2 seconds left, then watched as Indiana's final shot come up well short to give the Nets a 106-105 victory over the Indiana Pacers.\n\n\"I kept thinking I was going to blow the game because we were playing so well collectively,\" he said. \"I was like, `Come on, man! You can't be the one that blows this thing.' That last shot was different.\"\n\nIt was a strange game for Dinwiddie.\n\nHe finished 4 of 15 from the field and 0 for 7 on 3-pointers yet made made 13 of 15 from the free throw line, scoring 21 points and dishing out 11 assists.\n\nBut the only thing that really mattered was Dinwiddie delivering on his last chance in a game Brooklyn controlled for almost the entire first three quarters.\n\nThe result: Brooklyn earned a rare road victory, beat the Pacers for the first time in three tries this season and now, thanks to Dinwiddie, has back-to-back wins at Indiana for the first time in seven seasons.\n\n\"I thought our defense was great in the fourth quarter. We only turned it over twice,\" coach Kenny Atkinson said. \"Guys made plays. That's what it all comes down to in the NBA, at the end of the game, you make plays.\"\n\nFor the Pacers, the fourth-quarter breakdowns are becoming a familiar tale.\n\nThe lead changed hands three times in the final 27 seconds -- with the Nets taking a 104-103 lead, their first of the quarter, on Joe Harris' 3-pointer.\n\nIndiana answered with a layup from Domantas Sabonis with 10 seconds left to make it 105-104.\n\nBut Dinwiddie's basket put the Nets back in front, and Malcolm Brogdon's errant 3 at the buzzer sealed the Pacers' fate, ruining Sabonis' fourth triple-double of the season.\n\nSabonis finished with 23 points, 10 rebounds and 11 assists. T.J. Warren added 19 points as the Pacers lost their sixth in a row -- matching their longest skid since February 2017.\n\n\"We had a four-point lead there, late. We've got to win that,\" Indiana coach Nate McMillan said. \"You've got to score and you've got to get stops and we didn't do that, again. It's us, again, not finishing the game.\"\n\nTIP-INS\n\nNets: DeAndre Jordan had 11 points and 19 rebounds -- the 20th time this season he's had double-digit rebounds off the bench. ... Harris finished with 15 points, Jarrett Allen had 13. Both players grabbed eight rebounds. ... Caris LeVert had 11 points, ending his career-high streak of consecutive 20-point games at three. ... The Nets were 12 of 37 on 3s.\n\nPacers: Myles Turner scored 13 points in the first half, more than he had posted in any game since Jan. 13, and finished with 15. ... Victor Oladipo had 12 points and Doug McDermott wound up with 13, seven coming in a flurry late in the third that gave Indiana the lead. ... Indiana was 7 of 30 on 3s and has now allowed 45 3s in its last three games. ... The Pacers had won 11 of the previous 12 games in this series, including two this season at Brooklyn. ... Indiana has lost five straight home games for the first time since January and February 2008.\n\nALL TOGETHER\n\nThe Pacers had their projected starting lineup intact for the first time all season Monday: Brogdon, Oladipo, Warren, Sabonis and Turner.\n\nIt didn't help the Pacers change course but McMillan believes that will change soon.\n\n\"It's only taken, what, 53 games to get to this point?\" McMillan said. \"But we have a chance now to establish this group and build off that.\"\n\nIRVING UPDATE\n\nKyrie Irving missed another game with a sprained right knee and it remains unclear when he'll return.\n\nBefore the game, Atkinson said he didn't have any update on Irving and he's also unsure what he'll do with lineups once the star guard is healthy.\n\n\"It's kind of like let's cross that bridge when we get to it,\" Atkinson said. \"It's going to be a tough decision because we've got three guys who are playing really well.\"\n\nUP NEXT\n\nNets: Will try to stop a six-game losing streak against Toronto on Wednesday in Brooklyn.\n\nPacers: Hosts Milwaukee on Wednesday, trying to snap a four-game skid in the series.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996707.765782
}