{
  "game_id": "0022300546",
  "espn_id": "401585174",
  "date": "Jan 13, 2024",
  "matchup": "ORL @ OKC",
  "headline": "Thunder beat short-handed Magic 112-100 to tie Timberwolves for Western Conference lead",
  "body": "OKLAHOMA CITY -- — Time after time, Shai Gilgeous-Alexander punished the Orlando Magic by making difficult shots while getting fouled.\n\n\r\n              Gilgeous-Alexander scored 37 points and the Oklahoma City Thunder beat the short-handed Magic 112-100 on Saturday night to tie Minnesota for the Western Conference lead.\n\n\r\n              Gilgeous-Alexander was fouled six times on made baskets and made all six free throws.\n\n\r\n              “A lot of core strength,” he said. “I work on my core a lot. That’s that’s the main thing I work on in summertime. And then I’m always working on my touch around the basket. I just try to focus. After you get hit and you have a shot to make it a three-point play, it’s worth the second of focus to try and get three points.” \n\n\r\n              Gilgeous-Alexander did his damage without making a 3-pointer. He missed all four of his 3-point tries, but was 13 of 16 inside the arc and made 11 of 12 free throws. \n\n\r\n              “Shai is a tough guard,” Orlando coach Jamahl Mosley said. \"You put multiple defenders on him. By the time you send a double team, he’s looking to turn the corner. And that’s what makes him a great player.”\n\n\r\n              Jalen Williams scored 16 points and Chet Holmgren added 15 to help the Thunder win their fourth straight and improve to 27-11.\n\n\r\n              The Thunder made just 8 of 36 3-pointers.\n\n\r\n              “There was like, covers on the hoop in the first half,\" Thunder coach Mark Daigneault said. \"I thought we did a great job of manufacturing a win there out of a night that we didn’t shoot particularly well.”\n\n\r\n              Paolo Banchero had 20 points, nine rebounds and eight assists for the Magic, who lost their third straight. Orlando was missing Franz Wagner (right ankle sprain), Wendell Carter Jr. (right knee tendinitis), Markelle Fultz (left knee injury maintenance), Gary Harris (right calf strain) and Joe Ingles (left ankle injury maintenance).\n\n\r\n              It was the first regular-season matchup between the first two picks of the 2022 draft. Banchero, the No. 1 pick that year, was last season's Rookie of the Year. Holmgren was picked No. 2 overall in 2022 before sitting out last season with a foot injury. He has emerged as one of the favorites for Rookie of the Year this season.\n\n\r\n              Gilgeous-Alexander scored 22 points in the first half to help the Thunder take a 49-40 lead at the break. No Orlando player scored more than six points in the first half. \n\n\r\n              Gilgeous-Alexander stole the ball, then posted up on the other end and made a shot from an awkward angle while being fouled. He made the free throw to put the Thunder up 72-60.\n\n\r\n              Jalen Williams made a shot from just inside halfcourt at the end of the third quarter to put Oklahoma City up 86-73, and the Thunder led by at least six points the rest of the way.\n\n\r\n              “I love our guys’ fight,” Mosley said. “That’s one thing that I think is commonplace for us. That’s how we’re going to have to play. That’s how we give ourselves an opportunity by committee.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: At New York on Monday night.\n\n\r\n              Thunder: At Los Angeles Lakers on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995708.133963
}