{
  "game_id": "0022300831",
  "espn_id": "401585459",
  "date": "Feb 26, 2024",
  "matchup": "MIA @ SAC",
  "headline": "The short-handed Heat beat the Kings 121-110 for their 4th straight win",
  "body": "SACRAMENTO, Calif. -- — Bam Adebayo scored 28 points, Jaime Jaquez Jr. added 26 and the short-handed Miami Heat beat the Sacramento Kings 121-110 on Monday night for their fourth straight win.\n\n\r\n              Kevin Love provided a big spark with 19 points off the bench and Caleb Martin scored 16 for the Heat, who were missing three starters because of injuries or suspensions — including star Jimmy Butler.\n\n\r\n              “When you’re missing a guy like that, everybody has to step up,” Jaquez said. “He’s such a big part of our team and missing him is something that we obviously feel. But no matter, we've still got to play a game. Guys have to step up and we want to do it for those guys.” \n\n\r\n              Sacramento's Domantas Sabonis had 14 points, 14 rebounds and 10 assists for his NBA-high 21st triple-double of the season. Sabonis also became the 10th player in league history with 40 straight double-doubles in a season. \n\n\r\n              Keegan Murray scored 28 points and De'Aaron Fox added 27 for Sacramento, but the Kings were unable to build on a big road win against the Los Angeles Clippers on Sunday and had their three-game winning streak snapped.\n\n\r\n              “They came here and they played well both offensively and defensively,” Fox said. “We have to be better. I can't turn the ball over like I did. But it's not like they didn't come in here and make tough shots.”\n\n\r\n              The key absences led to Miami's 30th different starting lineup in the 57th game of the season. Butler, Nikola Jovic and Thomas Bryant served suspensions for their role in a fight Friday night at New Orleans. Tyler Herro (left knee), Terry Rozier (right knee), Josh Richardson (right shoulder) and Orlando Robinson (back) were out with injuries.\n\n\r\n              But that didn't derail the Heat, who got plenty of contributions from unheralded players like Delon Wright, who scored 13 points in his Miami debut, and reserve Haywood Highsmith, who scored all 15 of his points in the first half.\n\n\r\n              The Heat withstood a 20-4 run by Sacramento spanning the first-quarter break to take a 65-62 halftime lead and just built from there.\n\n\r\n              Love scored 10 points during a 17-2 run to end the third quarter with Miami ahead 101-81.\n\n\r\n              “He just allowed us to kind of go retro Kevin Love, where we were just running our offense through him,” coach Erik Spoelstra said. “He’s so clever, physical, smart. For short stretches he’s every bit as good as he was and you saw that tonight.”\n\n\r\n              The Kings tried to mount a comeback, getting one 3-pointer from Kevin Huerter and two from Murray in less than a minute to spark a 14-1 run that cut the deficit to six midway through the fourth on a floater by Fox. \n\n\r\n              Sacramento got as close as two points on a layup by Fox with 3:41 left, but back-to-back baskets from Jaquez helped hold off the Kings. \n\n\r\n              “That’s what this group is about,” Spoelstra said. “It really became so much less about anything in the huddle or coaching. Just use your competitive spirit and figure out how to win this game.” \n\n\r\n              UP NEXT\n\n\r\n              Heat: Visit Portland on Tuesday.\n\n\r\n              Kings: Visit Denver on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996690.817682
}