{
  "game_id": "0021900052",
  "espn_id": "401160694",
  "date": "Oct 29, 2019",
  "matchup": "MIA vs. ATL",
  "headline": "Butler makes his Miami debut, Heat top Hawks 112-97",
  "body": "MIAMI --  Jimmy Butler made his first four shots and scored 21 in his Miami debut, rookie Tyler Herro scored 29 and the Heat defeated Atlanta 112-97 on Tuesday night in a game where Hawks star Trae Young left early in the second quarter with a sprained right ankle.\n\nThe 19-year-old Herro had a 19-point second quarter for Miami, while fellow reserve Goran Dragic scored 21. Bam Adebayo had 17 points and 10 rebounds for Miami and Kendrick Nunn finished with 17..\n\nYoung left with 9:56 remaining in the first half, turning his ankle when he landed on the foot of Miami's Justise Winslow. The reigning Eastern Conference player of the week -- who had 102 points in Atlanta's first three games -- finished with five points in 11 minutes.\n\nJohn Collins scored 30 for Atlanta, including a career-best five 3-pointers, and Jabari Parker finished with 12 for the Hawks.\n\nButler missed the first three games of the season while celebrating the birth of his daughter Rylee. He was 5 for 11 from the floor, and went 10 for 15 from the line. As a team, Miami was 33 for 45 from the line -- compared with 16 for 24 by Atlanta at the stripe.\n\n\"To win at home, in front of these fans, is special,\" Butler said.\n\nEven without Young, even with Kevin Huerter -- a starter last season -- on a minutes restriction while he works his way back off knee soreness and with Evan Turner out with a sore Achilles, the Hawks still wouldn't go away late. Tyrone Wallace made a pair of free throws to get Atlanta within 11 with 3:24 left, but the Hawks missed shots at the rim on their next two possessions and Miami put the game away.\n\nHerro set a Heat record for points off the bench by a rookie, topping the mark of 28 set by Michael Beasley on March 4, 2009. And Herro and Dragic became the ninth Heat duo all-time to have 20-point games off the Miami bench on the same night.\n\nTIP-INS\n\nHawks: Vince Carter played in Miami for the 35th time, finishing with seven points and became the fourth visiting player to score 700 in road games against the Heat -- including playoffs. He now has 702 and joined Paul Pierce (867), Patrick Ewing (754) and Michael Jordan (722) in that club. ... Atlanta plays its next four games at home.\n\nHeat: Miami's 472 points through four games is a franchise-high. The previous high was 447 in 2012-13. ... Miami is 3-1 for the first time since the 2014-15 season. The Heat were 2-2 in each of the past four seasons. ... Butler's points were the most he's ever scored in a debut for a team. He had two in his debut as a rookie in Chicago, 12 in his first game with Minnesota and 14 in his debut for Philadelphia last season.\n\nHERRO BALL\n\nHerro's 19-point second quarter was the first time a Heat rookie scored that many in a quarter since Caron Butler had a 19-point third quarter on March 10, 2003.\n\nCOLLINS FROM DISTANCE\n\nCollins' single-game high for 3-pointers made entering Tuesday was four. He had four 3s in the first 8 minutes on Tuesday -- after never having previously made more than two in any quarter of his first 138 NBA games.\n\nUP NEXT\n\nThe teams meet again Thursday in Atlanta to conclude a home-and-home series.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995566.188493
}