{
  "game_id": "0021901232",
  "espn_id": "401224687",
  "date": "Jul 30, 2020",
  "matchup": "LAL vs. LAC",
  "headline": "James' layup late lifts Lakers past Clippers, 103-101",
  "body": "LAKE BUENA VISTA, Fla. --  LeBron James and the Los Angeles Lakers showed some rust.\n\nThey knocked it off with time to spare.\n\nAnthony Davis scored 34 points, James had the go-ahead basket with 12.8 seconds left and the Lakers moved closer to clinching the No. 1 seed in the Western Conference playoffs by topping the Los Angeles Clippers 103-101 on Thursday night in the second game of the NBA's re-opening doubleheader.\n\nJames had 16 points, 11 rebounds and seven assists to help the Lakers move 6 1/2 games ahead of the Clippers in the West with seven games remaining. Kyle Kuzma added 16 points.\n\n\"It felt like a real game to me, two teams battling. ... Can't complain for the first game,\" Davis said.\n\nPaul George had 30 points and Kawhi Leonard scored 28 for the Clippers, who had an 11-point lead midway through the third in a game with deep ebbs and flows. The Clippers got that lead after a 26-5 run; the Lakers immediately rebutted with a 36-14 run to reclaim control.\n\nAnd it still came down to the final moments.\n\nGeorge's 3-pointer with 1:50 left cut the Lakers' lead to 99-98. James muscled his way to a layup on the next possession, and then George hit another 3 to tie the game at 101 with 29 seconds remaining.\n\nJames followed his own miss down the lane for the go-ahead basket, then was brilliant on the last defensive possession -- forcing the ball out of Leonard's hands and covering George as his 3-point try at the buzzer misfired.\n\n\"We can't have self-inflicted wounds and I thought we had too many of them,\" said Clippers coach Doc Rivers, whose team -- which remains short-handed with Lou Williams still in quarantine and Montrezl Harrell tending to a family matter -- gave up 29 points off turnovers.\n\nThursday marked the NBA's first game action in 141 days, the league getting back to work after the coronavirus pandemic forced a shutdown.\n\nDuring the pandemic, a renewed discussion about racial injustice happened in this country -- the conversation that surrounds this NBA restart. The courts have \"Black Lives Matter\" on them, and the Lakers and Clippers knelt together during the national anthem in a silent protest to demand equality. New Orleans and Utah did the same in the night's opener.\n\nJames -- who is going to win his first assist title -- had five in the first quarter to get teammates going, and then his first basket of the restart came on a dunk early in the second quarter to put the Lakers up 37-24.\n\nBut for a stretch that basically spanned a full quarter, spanning the second and third periods, the Lakers couldn't make a shot. They went 1 for 10 to end the half, then 0 for 9 to start the third and the Clippers took advantage.\n\nThey turned a 50-40 deficit into a 66-55 edge in the third. And then it was the Lakers' turn to rally, slicing the Clippers' lead to 77-76 going into the fourth.\n\n\"It was a good game,\" Leonard said. \"Still had fun out there. It was great to be back on the floor.\"\n\nTIP-INS\n\nClippers: The Clippers had won 11 of their last 12 games in the state of Florida. In both of those losses, Dion Waiters played for the winning side -- the first being a game in Miami. ... Leonard was charged with two offensive fouls in the first quarter, the first time in his career that happened.\n\nLakers: The Lakers got to the 50-win mark for the 33rd time in franchise history, and this is the 12th time that James has helped a team get to that many wins in his 17 seasons. ... James' 3-pointer with 8:30 left extended his NBA record of consecutive regular-season games with at least 10 points to 989.\n\nCELEB ROW\n\nNBA players are permitted to attend games in the bubble as fans -- with their seats 6 feet apart to satisfy social distancing rules. Among those who attended: Portland's Damian Lillard and C.J. McCollum, San Antonio's DeMar DeRozan and Toronto's Kyle Lowry.\n\nUP NEXT\n\nClippers: New Orleans on Saturday.\n\nLakers: Toronto on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995964.836999
}