{
  "game_id": "401810021",
  "espn_id": "401810021",
  "date": "Nov 04, 2025",
  "matchup": "ATL vs ORL",
  "headline": "Hawks roll to 127-112 victory over the Magic",
  "body": "ATLANTA -- — Zaccharie Risacher scored 21 points, Nickeil Alexander-Walker had 20 and the Atlanta Hawks beat the Orlando Magic 127-112 on Tuesday night.\n\n\r\n              Dyson Daniels added 18 points, Jalen Johnson had 17 and Kristaps Porzingis finished with 15 as Atlanta won for the third time in four games. Onyeka Okongwu added 14 points and seven rebounds off the bench. \n\n\r\n              Daniels was 8 for 9 from the field as the Hawks shot 55.6% and led by 25 points while improving to 2-0 against the Magic this season.\n\n\r\n              Paolo Banchero had 22 points, 11 rebounds and eight assists for the Magic, who lost starting guard Desmond Bane to an ejection in the third quarter.\n\n\r\n              Bane flagrantly fouled Okongwu and then spiked the ball into the Hawks forward’s head as he fell, a technical foul that led to the ejection.\n\n\r\n              The Hawks were in control by then. Risacher scored 11 points in the first four minutes of the game and the No. 1 pick in the 2024 draft had 16 in the first half to reach 1,000 for his career.\n\n\r\n              The Hawks scored more than 30 points in each of the first three quarters. They went on a 13-0 run from the end of the first quarter into the beginning of the second, then had a 14-1 run in the final four minutes of the half. \n\n\r\n              The Hawks have eclipsed 100 points in all eight games this season. \n\n\r\n              The Magic committed 30 fouls with three technicals. \n\n\r\n              Daniels recorded two steals extended his streak to 60 straight games with at least one steal, which is second-longest in franchise history and ninth-longest in NBA history. \n\n\r\n              Up next\r\n              Magic: Host the Boston Celtics on Friday in an NBA Cup East Group B game.\n\n\r\n              Hawks: Host the Toronto Raptors on Friday in an NBA Cup East Group A game. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042559.9007711
}