{
  "game_id": "0022000861",
  "espn_id": "401307657",
  "date": "Apr 18, 2021",
  "matchup": "ATL vs. IND",
  "headline": "Young, Capela power Hawks past Pacers, 129-117",
  "body": "ATLANTA -- — Trae Young scored 34 points, Clint Capela had 25 points and 24 rebounds and the Atlanta Hawks beat the Indiana Pacers 129-117 on Sunday.\n\n\r\n                    Bogdan Bogdanovic and Kevin Huerter each chipped in 23 points and Young had 11 assists for the Hawks, who have won eight of 10 and are 17-6 under interim coach Nate McMillan. Atlanta has won nine of 11 at home.\n\n\r\n                    Young loved how the Hawks kept pushing the ball offensively and giving the Pacers fits. Indiana endured long gaps when it didn't get back in transition quickly enough or let the Hawks have wide-open looks.\n\n\r\n                    “It was tough to do that when guys are knocking down shots and guys are knocking down 3s like they were and Clint doing what he’s doing in the paint,\" Young said. “It’s hard to double a guy in a situation like that.\"\n\n\r\n                    Malcolm Brogdon finished with 29 points and Domantas Sabonis and T.J. McConnell scored 18 apiece for Indiana, which had won five of seven on the road.\n\n\r\n                    The Hawks, who led by 20 in the first quarter, let the Pacers cut the lead to three in the second but went back up by 10 on Bogdanovic's 3 with 6:03 to go in the third.\n\n\r\n                    Indiana was far from done, however, and pulled within one on T.J. McConnell’s fast-break layup at the 2:21 mark of the third. Miles Turner’s layup made it 89-88 before Huerter answered with a 3 in the final minute of the period.\n\n\r\n                    Capela’s putback pushed the lead to eight with 9 minutes remaining before Sabonis’ hook shot forced a 105-all tie with 5:09 to go. After Bogdanovic hit a 3 to make it 115-109 at the 3:19 mark, Capela made it an eight-point lead less than a minute later. That essentially ended the game as the Hawks pushed the lead back to double digits in the final minute.\n\n\r\n                    “We just responded,\" said McMillan, the former Pacers coach. “We had the lead. Indiana is going to keep coming at you. They put a small lineup in to change the tempo of the game. They were able to do that, and we got a little rattled, but we got our composure back and were able to execute down the stretch.\"\n\n\r\n                    The Pacers, who began the day in ninth place in the Eastern Conference standings, missed their first 10 attempts beyond the arc before Aaron Holiday hit one to cut the lead to 43-35.\n\n\r\n                    The Hawks made it 30-10 on two free throws by Young at the 3:19 mark of the first. They ended the period up 12 points, but Indiana pulled within three on Jeremy Lamb’s layup with 5:07 left in the second.\n\n\r\n                    Atlanta made it 60-50 at the 1:28 mark on Capela’s fast-break layup. Capela had 16 points and 10 rebounds at the break and finished with his second 20-20 game this season and 10th of his career.\n\n\r\n                    “At the end of the day we just couldn’t get enough stops,\" McConnell said. “We couldn’t get that one stop to put us over the top. They got loose for a couple of 3s and made us pay.\"\n\n\r\n                    Young has 17 games with at least 30 points.\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Turner was a game-time decision after missing the last five games with a sprained ankle. He was averaging a league-best 3.5 blocks but ended a streak of 64 consecutive games with at least one block. Turner finished with nine points and seven rebounds. ... Sabonis had 14 rebounds. ... F Doug McDermott missed his third straight games with a sprained left ankle. McDermott is averaging career highs with 13.3 points, 3.9 rebounds and 1.4 assists per game.\n\n\r\n                    Hawks: John Collins was a game-time decision after missing the last nine games with an ankle injury. He started and had eight points and two rebounds in 21 minutes. Collins, the No. 19 draft pick in 2017, leads his classmates with 44 games of least 20 points and 10 rebounds, and he’s second with 79 double-doubles. He began the game averaging 18.2 points and 7.8 rebounds, second-most on the team.\n\n\r\n                    NO COMMENT\n\n\r\n                    McMillan wanted no part of discussing his future before the game. The Hawks have climbed to fourth place in the East under his leadership, but McMillan wouldn’t say whether he favors staying with the team.\n\n\r\n                    “I won’t discuss any of that. My focus is on finishing the season here,” he said. “We’ve done some good things, but we still have a ways to go. So the focus is on finishing out the season.”\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host San Antonio on Monday.\n\n\r\n                    Hawks: Host Orlando on Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997624.309185
}