{
  "game_id": "0021500879",
  "espn_id": "400828766",
  "date": "Feb 28, 2016",
  "matchup": "TOR @ DET",
  "headline": "Pistons beat Raptors 114-101 in Lowry's absence",
  "body": "AUBURN HILLS, Mich. --  A lot has changed in the past week for the Detroit Pistons.\n\nAndre Drummond had 15 points and 18 rebounds, and Detroit took advantage of Kyle Lowry's absence to beat the Toronto Raptors 114-101 on Sunday night. It was the fourth straight victory for the Pistons, who had lost five in a row before this run.\n\n\"Young, dumb and we don't know any better,\" Detroit guard Reggie Jackson said. \"That's who we are. We just continue to fight and continue to battle. We come out and try to be the best versions of ourselves.\"\n\nA week ago, the Pistons were reeling after allowing 59 points to New Orleans star Anthony Davis on Feb. 21 in what was Detroit's fifth straight loss. Now the Pistons (31-29) are in a virtual tie with Charlotte (30-28) and Chicago (30-28) for seventh place in the Eastern Conference.\n\nLowry sat out for the first time all season because the Raptors wanted to rest him after a 43-point performance against Cleveland on Friday. Toronto had its four-game winning streak snapped.\n\n\"To be a good team in this league, you have to be able to handle success, and we just embarrassed ourselves trying to do that,\" Raptors coach Dwane Casey said. \"We didn't come out with any defensive disposition. That has nothing to do with Kyle. He doesn't change anyone's defensive focus.\"\n\nThe score was tied at 52 at halftime before the Pistons broke it open with a 37-point third quarter. All five Detroit starters scored in double figures in the game.\n\nTerrence Ross scored 27 points for the Raptors.\n\nThe Pistons shot a season-high 58 percent from the field, and they were particularly efficient in the third quarter, when they went 14 of 18 to take an 89-72 lead into the fourth. Detroit finished with a season high-tying 28 assists and went 12 of 23 from 3-point range.\n\n\"The ball's got to go in to get an assist, so it's both,\" Pistons coach Stan Van Gundy said. \"Our ball movement's better, and because our ball movement's better, we're shooting the ball better. We played better offensively tonight, no question.\"\n\nJackson had 19 points and eight assists for the Pistons, and Kentavious Caldwell-Pope scored 16 points. Tobias Harris and Marcus Morris added 14 points each.\n\nDeMar DeRozan scored 20 points for the Raptors.\n\nDetroit led by nine in the third quarter before going on a 9-0 run that included two 3-pointers by Steve Blake and a three-point play by Caldwell-Pope. The Pistons led by 26 points in the fourth, but a late Toronto run made the final score more respectable.\n\nDrummond's double-double was his 13th in a row, the longest streak he's had in his career. He did not play at all in the fourth quarter.\n\nBALANCE\n\nDetroit's five starters all took between nine and 12 shots.\n\n\"We're just playing off each other, Jackson said. \"The ball's just been moving, and everybody's taking their shots.\"\n\nMOTIVATION\n\nDeRozan said the Pistons might have been fired up by the fact that Lowry wasn't playing.\n\n\"That's a team fighting for the seventh and eighth spots,\" he said. \"Every game matters to them. If they think we are relaxing against them, it is just going to make them play harder.\"\n\nTIP-INS\n\nRaptors: Toronto turned the ball over only five times. ... Jonas Valanciunas scored 11 points, his 11th straight game in double figures.\n\nPistons: Drummond had all nine of Detroit's rebounds in the first quarter. ... The Pistons were without rookie Stanley Johnson, who was out with a sprained right shoulder.\n\nUP NEXT\n\nRaptors: Host Utah on Wednesday night.\n\nPistons: At San Antonio on Wednesday night. The Spurs are 28-0 at home.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994710.5601149
}