{
  "game_id": "0022400847",
  "espn_id": "401705413",
  "date": "Feb 27, 2025",
  "matchup": "DAL vs. CHA",
  "headline": "Kyrie Irving scores 25, Moses Brown adds 20 points and 11 rebounds in Mavs' 103-96 win over Hornets",
  "body": "DALLAS -- — Kyrie Irving scored 18 of his 25 points in the second half and grabbed nine rebounds to lead the Dallas Mavericks to a 103-96 victory over the Charlotte Hornets on Thursday night.\n\n\r\n              Moses Brown, in his penultimate game on a 10-day contract, added 20 points and 11 rebounds in 31 minutes of his first start for the Mavericks.\n\n\r\n              Mark Williams had 26 points and 16 rebounds for the Hornets, who have lost five consecutive games and 16 of their last 19. Miles Bridges had 20 points and 12 rebounds.\n\n\r\n              P.J. Washington Jr. again joined Anthony Davis, Daniel Gafford and Dereck Lively II among Dallas big men unavailable because of injury. Washington left the Mavericks' Feb. 8 game with a sprained right ankle and has missed four of seven games since.\n\n\r\n              LaMelo Ball, who leads the Hornets in scoring and assists, missed his second consecutive game with an ankle injury.\n\n\r\n              Takeaways\r\n              Hornets: Charlotte went 1-8 playing nine consecutive road games, matching a franchise-long road run. The last six followed the All-Star break. The Hornets are 1-21 in games without Ball. \n\n\r\n              Mavericks: At 32-28, the Mavericks are ninth in the Western Conference but only one game out of sixth place and the conference’s last guaranteed playoff berth. ... It was Brown's highest-scoring game since his career-high 24 points for Oklahoma City in the final game of the 2020-21 season.\n\n\r\n              Key moment\r\n              Irving missed a 3-pointer with Dallas leading 94-91 with 1:52 left but tipped the ball amid a scramble out to Klay Thompson, whose right-corner 3 put the Mavericks ahead 97-91 with 1:48 to play.\n\n\r\n              Key stat\r\n              Irving hit eight of his final 11 shot attempts.\n\n\r\n              Up next\r\n              The Hornets will begin a five-game homestand against Washington on Saturday, when the Mavericks will host Milwaukee.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997153.610358
}