{
  "game_id": "0022000590",
  "espn_id": "401307373",
  "date": "Mar 13, 2021",
  "matchup": "SAC @ ATL",
  "headline": "Young, Capela propel Hawks past Kings 121-106",
  "body": "ATLANTA -- — Trae Young scored 17 of 28 points in the third quarter, Clint Capela had 18 of his 24 in the first half, and the Atlanta Hawks beat the Sacramento Kings 121-106 on Saturday night for their fourth straight victory.\n\n\r\n                    The Hawks improved to 4-0 under interim coach Nate McMillan, using a 24-2 run in the first half to overcome a 14-point deficit — taking a 46-35 lead on Kevin Huerter’s corner 3.\n\n\r\n                    “You don’t want to be satisfied with just winning four in a row, but anytime you can win a game in this league, we’re going to take it,\" Young said. “This was a big win for us.\" \n\n\r\n                    Capela’s 25th double-double included 14 boards for the NBA's rebounding leader. \n\n\r\n                    De’Aaron Fox finished with 32 points for the Kings, who began the night with three wins in five games since dropping nine straight last month. Richaun Holmes scored 20 for Sacramento.\n\n\r\n                    Young’s 3 from the right wing put the Hawks up 15 early in the third. Young followed with consecutive 3s coming out of a timeout to make it 81-64. A couple of minutes later, Danilo Gallinari hit a short runner to give the Hawks a 19-point lead. Atlanta led by as many as 23.\n\n\r\n                    “Until we realize and until we get better at playing defense, it’s going to be hard to win,\" Kings coach Luke Walton said. “Tonight it’s like, I can point at a lot of things we can do better, and that’s pretty much every game, but we shot 20% from 3. Most nights that’s not going to happen, but the message to our guys is, ‘Listen, we can’t just rely on scoring to either stay in games or win games.' \n\n\r\n                    \"Right now, that’s kind of what we’re doing most nights out.\"\n\n\r\n                    Sacramento pulled within 10 with 5:03 remaining on Fox’s layup, but the Kings got no closer.\n\n\r\n                    The Kings took their first double-digit lead on Fox’s pair of free throws midway through the first and were up 33-22 entering the second.\n\n\r\n                    Sacramento missed 11 of its first 13 shots beyond the arc. Atlanta was no better, going 0 for 7 early in the second, but Capela and Rajon Rondo got hot, and the Hawks kept adding momentum. The Hawks never trailed after Rondo’s 3 made it 36-35.\n\n\r\n                    John Collins scored 16 for Atlanta. Gallinari had 15 points and Rondo 10.\n\n\r\n                    “You’re not going to play a perfect game for 48 minutes, and we got off to slow start,\" McMillan said. “We gave up 33 points in that first quarter, 30 in the third. We don’t want to give up 30-point quarters, but we continue to stay with it. We continue to believe, continue to work together and we’ve been able to find a way by getting stops defensively and executing on the offensive end of the floor.\" \n\n\r\n                    TIP-INS\n\n\r\n                    Kings: C Hassan Whiteside, still in the health and safety protocols because of COVID-19, missed his eighth straight game. ... Rookie G Tyrese Haliburton was still on a minutes restriction as he returns from an injury and finished with eight points in 24 minutes. ... Sacramento went 7 for 36 on 3s.\n\n\r\n                    Hawks: McMillan said F De’Andre Hunter (right knee surgery) is continuing to work out, but still doesn’t have an immediate timetable for his return. “He played a little bit of 4-on-4 yesterday,” McMillan said. “Went through a little workout today. We’re hoping he’s getting closer.”... F Cam Reddish (right Achilles) is still in a walking boot and appears to be a long way from returning.\n\n\r\n                    STILL A FAMILY\n\n\r\n                    Walton called former Sacramento G Bogdan Bogdanovich, who signed a $72 million, four-year contract with the Hawks in November, a great teammate who is missed in the locker room.\n\n\r\n                    “He was a lot of fun to coach,\" Walton said. \"He’s one of those guys that on the floor and in the locker room just brings a lot to a team. I’m happy he’s in a good situation.”\n\n\r\n                    Bogdanovich had a terrible night shooting, going 2 for 12 from the floor and 0 for 5 on 3s to finish with six points.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Visit Charlotte on Monday.\n\n\r\n                    Hawks: Host Cleveland on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997165.32393
}