{
  "game_id": "0021900147",
  "espn_id": "401160789",
  "date": "Nov 12, 2019",
  "matchup": "CLE @ PHI",
  "headline": "Embiid scores 27, leads 76ers past Cavaliers 98-97",
  "body": "PHILADELPHIA --  The shots weren't falling for the Philadelphia 76ers, so they clamped down on defense.\n\nJoel Embiid scored 27 points, including the go-ahead dunk with 13.2 seconds remaining, and Philadelphia held Cleveland without a point for the final 3  1/2 minutes in a 98-97 win over the Cavaliers on Tuesday night.\n\nJosh Richardson added 17 points and Ben Simmons had 15 for Philadelphia, which won despite missing 30 of 38 3-point attempts. Tobias Harris missed all 11 of his 3-point tries.\n\n\"You better guard if you're not going to make shots,\" 76ers coach Brett Brown said. \"We knew if we were going to do anything, we had to play defense -- and defense we played.\"\n\nJordan Clarkson and Kevin Love each had 20 points to pace Cleveland. Collin Sexton added 18 points and Tristan Thompson had 17 points and 12 rebounds for the Cavaliers.\n\nThe Cavaliers trailed for most of the contest, but took advantage of Philadelphia's poor shooting in the fourth quarter, going up by as many as five points on three occasions.\n\n\"We gave them life and were in a fistfight,\" Brown said. \"You can just feel it. We had a chance to discourage them and we didn't. Certainly a hard-fought game and we're lucky to get away with it.\"\n\nCleveland led 97-92 with 3:34 remaining after Sexton's driving layup, but the Cavaliers wouldn't score again. Harris pulled Philadelphia within 97-94 with a follow layup and then hit a 17-footer on the ensuing possession to make it a one-point game with 1:42 left.\n\nCleveland had chances to build the lead after that, but Love missed a close-range shot before a shot-clock violation on the Cavaliers' next possession.\n\n\"I think our defense was pretty OK,\" Embiid said. \"We just didn't make shots.\"\n\nThe 76ers were having their own trouble scoring with Richardson and Embiid failing to convert on consecutive possessions.\n\nAfter a timeout with 26.6 seconds left, Brown called a high-percentage play with Harris finding Embiid close to the basket. Embiid slammed it home to give the 76ers their first lead, 98-97, since early in the fourth quarter.\n\n\"It was a great play-call by coach and we did the rest,\" Embiid said.\n\nCleveland had a chance to win it, but Love's 3-point attempt from the top of the key rimmed out.\n\n\"Kevin is a great shooter, not a good shooter,\" Cleveland coach John Beilein said. \"He took his time but just didn't nail it. It's one of many looks I'll take at that time.\"\n\nCLOSE CALLS\n\nFour of Philadelphia's seven wins have been by eight points or less. Asked if the 76ers were playing with fire by winning such close games, Brown said, \"It's a blow torch. It is violent.\"\n\n\"I, sadistically, love it,\" he added.\n\nBEN'S BACK\n\nSimmons returned after missing two games due to a sprained AC joint in his right shoulder. He added six assists, five rebounds and two blocks to his point total, but also had four turnovers in 35 minutes. He made 7 of 9 field goals with all but a 6-foot turnaround jumper from close range.\n\nTIP-INS\n\nCavaliers: Kevin Porter Jr. returned in the second half after appearing to injure his hip early in the second quarter. Porter finished with four points. . John Henson (hamstring) and Ante Zizic (foot) sat out.\n\n76ers: Al Horford (rest), Shake Milton (knee) and Trey Burke (left calf) didn't play. . Philadelphia missed its first eight 3-pointers before Embiid connected from long range with 1:49 left in the first quarter. The 76ers finished the first period 1 for 11 from the arc, with Harris missing all five of his 3-point attempts. . The 76ers finished the first half going 3 for 20 from 3-point range, but led 54-48.\n\nUP NEXT\n\nCavaliers: Host Miami on Thursday.\n\n76ers: At Orlando on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996332.772167
}