{
  "game_id": "0021700299",
  "espn_id": "400975050",
  "date": "Nov 28, 2017",
  "matchup": "PHX @ CHI",
  "headline": "Booker scores 33 as Suns top Bulls 104-99",
  "body": "CHICAGO --  For all the big shots he hit, Devin Booker was most proud of the one he blocked.\n\nBooker scored 33 points, and the Phoenix Suns held off the Chicago Bulls for a 104-99 win on Tuesday night.\n\nBooker looked just fine after sitting out a game because of inflammation in his right big toe, nailing five 3-pointers and grabbing nine rebounds. But the play that most stood out to him came in the final minute.\n\nThe Suns were leading by five with about 30 seconds left when Chicago's Kris Dunn stole the ball from Tyler Ulis and went for a layup. Booker raced back to block him.\n\n\"That's crunch time, so whatever I had to do to win,\" he said.\n\nT.J. Warren scored 25 for Phoenix. Alex Len had 13 points and tied a career high with 18 rebounds after not playing in two of the previous three games. The Suns dominated on the glass 57-41 while snapping a three-game losing streak.\n\n\"I'm proud of this team,\" Booker said. \"We fought hard tonight. A lot of energy, talking on defense. Things that we needed to be working on, we did today.\"\n\nThe rebuilding Bulls are a league-worst 3-16 after dropping their sixth straight.\n\nJustin Holiday made a career-high six 3-pointers on his way to 25 points for Chicago. Dunn added a personal-best 24 points, hitting all four from long range, and eight assists.\n\n\"It's tough on everybody,\" Dunn said. \"Everybody, from the coaching staff to the players, we all come from a winning mentality in high school and college, so it's definitely hard. As a group, we have to understand we're young and we have to look at the future. There's going to be something good at the near end.\"\n\nHANGING ON\n\nPhoenix came out on top after Chicago cut a 15-point fourth-quarter lead to three in the final minute.\n\nBulls rookie Lauri Markkanen hit a 3 to make it 102-99 with 22.5 seconds left. But Warren hit two free throws and blocked a 3 by Markkanen to help preserve the win.\n\nThe Suns went on a 12-point run in the third to go up 63-49, with Ulis hitting a 3 and converting a three-point play and Booker nailing two from long range.\n\nThe Bulls cut it to three heading into the fourth. But the Suns went on a 14-2 run to start the quarter, with Troy Daniels nailing a 3 to make it 87-72 with 8:22 left.\n\nQUOTABLE\n\n\"We hung in there when our shots were not going down (in the first half). We talked about making them call the first timeout. I'm sick and tired of calling the first timeout in quarters and they come out with a 7-0 run to take control and put it up to a double-digit game. Then in the fourth quarter, they get off to a 14-2 start. It's just so hard to continue to climb uphill, especially late in the game like that.\" -- Bulls coach Fred Hoiberg.\n\nTIP-INS\n\nSuns: The Suns swept the Bulls for the first time since the 2007-08 season. ... Booker has eight 30-point games this season.\n\nBulls: F Nikola Mirotic attended a game for the first time since a preseason altercation with teammate Bobby Portis left him with several broken bones in his face as well as a concussion. He remains sidelined with the injuries from the altercation at practice on Oct. 17. Hoiberg said the two have not talked as far as he knows. Mirotic started practicing with the team again on Monday, and they did go against each other at times. ... Mirotic and F Zach LaVine (torn ACL) will practice with the G League's Windy City Bulls while Chicago heads to Denver for a game on Thursday.\n\nUP NEXT\n\nSuns: Visit Detroit on Wednesday.\n\nBulls: Visit Denver on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993917.013622
}