{
  "game_id": "0021800966",
  "espn_id": "401071639",
  "date": "Mar 06, 2019",
  "matchup": "DET vs. MIN",
  "headline": "Drummond continues streak for surging Pistons",
  "body": "DETROIT -- All too often this season, the Detroit Pistons' offense has devolved into throwing Blake Griffin the ball and watching whatever happens.\nGriffin was happy to see his teammates doing the heavy lifting Wednesday.\nOn a night when the star forward scored nine points on 4-of-13 shooting, the Pistons got 70 bench points and 31 more from Andre Drummond in a 131-114 win over the Minnesota Timberwolves.\n\"Our second unit was fantastic tonight,\" Griffin said after Detroit's 10th victory in 12 games. \"We didn't get much execution from the starters in the first half, and I was a big part of that, but the guys came off the bench and saved us.\"\nLuke Kennard scored 21 points and Ish Smith had 19 as four Pistons reserves reached double figures.\n\"Luke was a plus-29 and Ish was a plus-28, so you can see what kind of impact they had on this game,\" Pistons coach Dwane Casey said. \"We played a great second half, but it was the second unit that kept us in the game.\"\nDrummond, averaging 21.6 points and 16 rebounds in the last 12 games, added 15 rebounds for his 16th straight double-double -- the second-longest streak in franchise history. He set the record with 18 last season.\n\"What changed is he started passing the ball,\" Casey said. \"Earlier in the year, he was hanging onto the ball too long inside and trying to force shots. Now he's kicking it out, which gives everyone better shots.\"\nThe Pistons (32-31) moved above .500 for the first time since they got to 15-14 by beating the Timberwolves in overtime on Dec. 19.\nMinnesota (30-35) has lost four of five. Karl-Anthony Towns scored 24 points before fouling out.\n\"Give Detroit credit, they are playing as well as anyone in the league right now,\" Minnesota coach Ryan Saunders said. \"We just have to start playing four good quarters in a row.\"\nThe Timberwolves led by 16 until Drummond banked in a 29-foot 3-pointer at the end of the first quarter. The Pistons continued to rally in the second, taking a 57-55 lead before Minnesota ended the half on a 9-3 run.\nMinnesota shot 58.1 percent in the half, including 60 percent on 3s, but Detroit kept the game close with a 16-0 edge in points off turnovers.\n\"You have to take care of the ball when you have it, and you have to be able to get extra chances by forcing turnovers,\" Saunders said. \"We didn't do any of that tonight.\"\nDetroit led 90-88 going into the fourth quarter and started the period with a 3 by Kennard. Langston Galloway added a four-point play on the next possession to make it a nine-point lead, and Glenn Robinson III's dunk put the Pistons up 99-88.\n\"Their bench really took it to us all night,\" Saunders said. \"That quick 9-0 run at the start of the fourth quarter really took us out of the game.\"\nTaj Gibson was ejected with 10:07 to go after an elbow to Drummond's throat while the two fought for a rebound. The players had to be separated after the play, which resulted in a seven-point possession and a 16-point lead for Detroit.\n\"I was just trying to box him out, because he's such a physically strong guy,\" Gibson said. \"I certainly wasn't trying to injure him. I didn't even realize he was hurt. I went to help him up and he came after me.\"\nIn all, the Pistons outscored Minnesota 101-60 during a stretch that started with Drummond's first-quarter buzzer-beater and ended in the fourth.\n\"We are coming in and having a lot of fun,\" said Thon Maker, who had 10 points off the bench. \"We're getting stops and we're running in transition.\"\nTIP-INS\nTimberwolves: Minnesota has lost eight straight games to the Pistons, with its last victory coming at the Palace of Auburn Hills on Feb. 8, 2015. ... Minnesota allowed 24 points off turnovers and scored only two.\nPistons: Drummond's 3-pointer was the 10th of his NBA career. Five have come this season. ... Zaza Pachulia missed the game with a sore Achilles tendon.\nUP NEXT\nTimberwolves: Play at Washington on Saturday.\nPistons: Play at Chicago on Friday.\n---\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994665.075661
}