{
  "game_id": "0022300292",
  "espn_id": "401584920",
  "date": "Dec 11, 2023",
  "matchup": "MIA @ CHA",
  "headline": "Duncan Robinson leads balanced scoring attack as Heat hold on to top Hornets 116-114",
  "body": "CHARLOTTE, N.C. -- — Duncan Robinson had five 3-pointers and scored 24 points, Kevin Love provided a big boost off the bench with a season-high 19 points and the Miami Heat overcame a huge game from Charlotte's Terry Rozier to defeat the Hornets 116-114 on Monday night.\n\n\r\n              Jimmy Butler added 23 points and eight assists and Caleb Martin had 20 points and nine rebounds for Miami, which entered the game having lost five of its last seven. Jaime Jaquez chipped in with 18 points before fouling out late.\n\n\r\n              Rozier scored 34 points with eight 3-pointers for the Hornets, but his halfcourt heave at the final buzzer hit the backboard and bounced away.\n\n\r\n              Robinson was on his game from the outset, eager to bounce back from an 0-for-7 shooting performance in a 111-99 loss to the Cleveland Cavaliers on Friday night.\n\n\r\n              He finished 8 of 14 from the floor and scored on shot-clock beating 3s and drives to the basket.\n\n\r\n              “I get to have a night like I had tonight when he's drawing so much attention, and he's dishing it and making shots and doing a little bit of everything,” Martin said. “He just makes the flow of the offense that much easier and I get to be a recipient of that. I love when he plays well.”\n\n\r\n              Martin played a season-high 39 minutes and walked away satisfied with his best game in Charlotte since leaving the Hornets after the 2020-21 season.\n\n\r\n              Love played well too, making two big 3s in the closing minutes of the first half and finishing 7 of 11 from the field with four 3s.\n\n\r\n              “I can't speak enough about Kevin and his leadership and his presence,” Miami coach Erik Spoelstra said. “He has that highly decorated championship-level experience. He's great for our young guys, but boy is he great for Jimmy. They have a great connection and symmetry when they're out there together.” \n\n\r\n              Miami led most of the game and carried a 12-point lead into the fourth quarter before the Hornets quickly cut the lead to one with 6:51 remaining behind Rozier's seventh 3-pointer of the game.\n\n\r\n              Every time the Hornets attempted to take the lead, the Heat had an answer — whether it was a Kyle Lowry 3-pointer, a Love putback or a drive from Robinson.\n\n\r\n              Still, the Hornets didn't quit, and Rozier's leaning 3 cut Miami's lead to 114-111 with 43 seconds left. \n\n\r\n              After a Rozier free throw, Martin made one of two from the foul line with 9.8 seconds left, giving the Hornets a chance to send the game into overtime. But rather than allow the hot-shooting Rozier to get off another 3, the Heat fouled him with 9.1 seconds and he made both free throws.\n\n\r\n              Spoelstra said Butler pushed for the Heat to foul Rozier during a timeout.\n\n\r\n              “We have had a couple games over the last four years where we have been burned for not doing that,” Spoelstra said. “... At that point we would rather see a free throw game. Rozier had some really tough step-back 3s in this game and we didn't want to see that down the stretch, make or miss.” \n\n\r\n              Charlotte fouled Butler at the other end and he made of two free throws with 4.3 seconds left, leaving the door open for the Hornets to steal one. But Charlotte, without any timeouts, had to push the ball up the court, and Rozier's contested heave didn't have much of a chance.\n\n\r\n              UP NEXT\n\n\r\n              The teams meet again Wednesday night in Miami.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995374.6016672
}