{
  "game_id": "0021600065",
  "espn_id": "400899515",
  "date": "Nov 03, 2016",
  "matchup": "ORL vs. SAC",
  "headline": "Magic hold off Kings in return home",
  "body": "ORLANDO, Fla. --  So much has been made about the process in this first season of the Orlando Magic under Frank Vogel.\n\nThere are just no shortcuts in the climb toward respectability for the Magic. And after slow starts in their first four games, Orlando put together its most complete game this season in a 102-94 victory over the Sacramento Kings on Thursday night.\n\nLed by Evan Fournier's 29 points on 10-of-15 shooting, the Magic were effective on offense and held DeMarcus Cousins and Rudy Gay in check during the second half to come up with their second straight win.\n\n\"It was better tonight obviously,\" Fournier said. \"We were pretty good defensively. The last four games we started the game super flat and had a 10-point deficit by the first quarter.\"\n\nThe Magic never trailed Sacramento by more than eight points. Orlando brought the offensive pressure for a change by building its lead to 13 points with Aaron Gordon, Serge Ibaka and Jeff Green all hitting timely shots.\n\n\"There are no guarantees early in the season but these guys are working to gel to come together as a group on the court and to try to do what I am asking them to do,\" said Vogel, whose team improved to 2-3. \"That takes a little time, it's a process.\"\n\nLate in the second quarter, Vogel turned to his bench of veterans that includes Green, D.J. Augustin, C.J. Watson and Bismack Biyombo to reclaim the lead for good. Bismack was a force with his interior defense, blocking two shots and changing several others, while Augustin and Green both came up with big baskets to give the team a spark.\n\nBut as big as the baskets were, the Magic's defense was even bigger in the second half. Cousins seemed unstoppable in the first half with Ibaka guarding him, but in the fourth quarter Vogel put Nikola Vucevic on Cousins to limit his effectiveness in the paint. Cousins finished with 33 points but only managed eight in the critical fourth quarter once Vucevic was switched on him.\n\nGordon was also huge against the more physical Gay in the second half. Gay only had four points in the second half.\n\n\"This is one of the few complete performances that I've seen being with the Orlando Magic so that is very inspiring and reassuring that this team can be great,\" said Gordon, who had 13 points and 10 rebounds.\n\nSacramento coach Dave Joerger liked the fight in his team, but felt the continued issues with turnovers was the determining factor. The Kings (2-4) committed 14 turnovers after coming in averaging 15 per game.\n\n\"They just got too many second chances with our turnovers and too many second chances on the offensive glass,\" said Joerger, whose team lost its third straight to start a five-game trip. \"That's the story of the game.\"\n\nTIP-INS\n\nKings: The Kings signed veteran free agent G Jordan Farmar to a contract on Tuesday in hopes of adding some flexibility to the backcourt. ...The NBA announced Wednesday that F Matt Barnes has been fined $15,000 for directing inappropriate language at game officials during the Kings' 108-96 overtime loss at Miami on Tuesday.\n\nMagic: The Magic have made at least one 3-pointer in 743 consecutive games dating to March 17, 2007. It's the fifth-longest streak in the NBA.\n\nWORKING LATE\n\nRealizing that he needed to work on his free throw shooting, Bismack said he came up to Amway Center by himself late Wednesday night to put up some extra shots.\n\n\"I always try to do that every other day, just listening to the sound of the ball and doing my game preparation,\" he said. \"I just love doing that. I enjoy the environment of the gym by myself and sometimes I talk to myself.\"\n\nUP NEXT\n\nKings: Sacramento's early five-game road swing continues Saturday night in Milwaukee.\n\nMagic: Orlando will play host to the struggling Washington Wizards on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995886.304936
}