{
  "game_id": "0021500683",
  "espn_id": "400828570",
  "date": "Jan 26, 2016",
  "matchup": "LAL vs. DAL",
  "headline": "Nowitzki's late jumper propels Mavericks past Lakers, 92-90",
  "body": "LOS ANGELES -- After Dirk Nowitzki arched back and released the tiebreaking jumper, he glided back into the Los Angeles Lakers' bench area.\nHe knew the pat on his back came from Kobe Bryant. Nowitzki replied with a shoulder pat of his own.\nBryant's sore right shoulder prevented the friendly rivals from sharing a court for the 50th and final time.\nThey'll share a mutual respect for the rest of their lives.\n\nNowitzki's big shot with 2.1 seconds to play propelled the Dallas Mavericks to a 92-90 victory over the Lakers on Tuesday night, snapping their two-game skid.\nNowitzki scored eight of his 13 points in the fourth quarter as the Mavericks earned their 10th consecutive victory over the Lakers. The 7-foot German did it with his usual incongruous grace, launching the winner over Julius Randle before making that friendly contact with Bryant.\n\"I heard him talk some noise during the game, so that was fun,\" Nowitzki said with a grin. \"It was just fun competition down the stretch. ... I'm not really a big trash-talker, but once I'm talked to, I'll have some fun.\"\nRandle missed a long jumper at the buzzer for the Lakers, who have lost seven straight.\nThe injury prevented Bryant from facing Nowitzki in the last matchup of the NBA's top two active scorers. Nowitzki is two months older than the 37-year-old Bryant, and he entered the NBA in 1998, two years after Bryant's debut.\n\"He's our Michael Jordan for my generation,\" Nowitzki said of Bryant. \"He's one of the best to ever lace `em up, and it's been a pleasure and an honor to compete against him basically almost my entire career.\"\nJ.J. Barea led the Mavericks with 18 points, and Chandler Parsons had 17.\nBIG MISS\nJordan Clarkson scored 18 points for the Lakers, and Randle had 16 points and 11 rebounds -- but he lamented his last try.\n\"Some of my shots happened to fall in, but I'd trade every one of those for that last open shot,\" Randle said. \"I'm extremely upset. It's tough. We just worked so hard all through that game and tried so hard. I really wish we could have gotten that one.\"\nBIG FINISH\nThe teams traded the lead throughout an exciting fourth quarter, with veteran Dallas struggling to put away the Lakers' young lineup.\nNowitzki put the Mavericks ahead on a jumper with 2:31 to play, but Clarkson tied it moments later. Both teams missed open shots before Lou Williams was called for an offensive foul against Barea with 13.5 seconds left, setting the stage for Nowitzki's latest big shot against the Lakers.\n\"Honestly, I don't have anything sensible or nice to say about the play,\" Williams said. \"I just think it was a bad call. ... You have to tip your hat to J.J. That's the way he plays. He flops eight or nine times in a game, and the referees know that. He has a reputation. He's able to draw those fouls in those situations, where it's win or lose.\"\nKOBE'S COMMANDMENTS\nBryant had harsh words of motivation for his young teammates after their most recent loss in Portland, but decided he shouldn't play through the re-occurring pain in his shoulder. \"When he complains about something and says something is sore, you know it's sore and he's not joking around,\" Lakers coach Byron Scott said. \"We'll just rest it and see how he feels.\" Bryant's strained Achilles tendon felt fine, the guard said.\nBryant watched the game from the Lakers' bench -- after removing Larry Nance Jr. from his seat and telling the rookie to grab some floor in a moment that went viral even before the next timeout.\nSWAGGY 3\nNick Young hit his first 3-pointer since Jan. 3 in the second quarter. The veteran guard was 0 for 9 in six games since then, and didn't play in six games during that stretch.\nTIP-INS\nMavericks: Zaza Pachulia sat out to rest his injured Achilles tendon. Salah Mejri started in his place and scored nine points. ... Devin Harris also sat out to rest his injured left foot. The guard got an injection in the foot earlier in the day. ... Nowitzki got a technical foul in the final seconds of the first half for protesting a call.\nLakers: Nance returned from a four-game absence with a sore knee, but went scoreless in 23 minutes. ... Brandon Bass played despite a foot injury, scoring five points.\nUP NEXT\nMavericks: At the Warriors on Wednesday.\nLakers: Host the Bulls on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994273.4177952
}