{
  "game_id": "0021600891",
  "espn_id": "400900297",
  "date": "Feb 28, 2017",
  "matchup": "CHI vs. DEN",
  "headline": "Jokic has triple-double as Nuggets surge past Bulls, 125-107",
  "body": "CHICAGO -- Although the Denver Nuggets were playing on the road, Nikola Jokic felt right at home Tuesday night in the United Center.\nJokic had 19 points, 16 rebounds and 10 assists for his third triple-double of the season, and the Nuggets rode a second-half surge to a 125-107 victory over the Chicago Bulls.\nAfterward, the 22-year-old Serbian celebrated the performance with a host of fans from his homeland.\n\"Chicago has the (biggest) Serbian population, I guess, after Belgrade, the capital,\" he said. \"There are a lot of Serbians here and it's nice to play in front of that crowd with the Serbian flags.\n\"It's a good feeling for me.\"\nAll of Jokic's triple-doubles have come in the last 12 games, but coach Michael Malone considered this a breakout performance.\n\"This is the Nikola Jokic everyone in Denver has been waiting to see,\" Malone said. \"I think he has been playing decent basketball, but tonight for him to score along with those rebounds and assists, it shows what a complete player he is.\"\nDanilo Gallinari scored 22 points and Wilson Chandler added 20 as Denver, which entered the game fourth in the NBA in scoring (110.6 points per game), posted a 69-48 advantage in the second half to erase a halftime deficit.\nGary Harris and Will Barton had 15 points apiece for the Nuggets.\nDwyane Wade and Rajon Rondo had 19 points apiece for Chicago, which had its four-game winning streak snapped. Jimmy Butler finished with just eight points on 3-for-13 shooting.\n\"He just didn't get in the flow or rhythm,\" Bulls coach Fred Hoiberg said of Butler. \"We ran a lot of actions that we run for Jimmy that he normally converts on.\"\nMalone credited Chandler and Gallinari for Butler's lack of rhythm.\n\"One of the keys to guarding a guy like Jimmy is to not foul,\" the coach said. \"He only went to the foul line two times.\"\nChicago had a 59-56 halftime lead and was up 68-60 early in the third quarter before Denver busted out to take a 91-83 advantage into the fourth. The Nuggets were 11 of 20 from the field and 10 of 11 from the free throw line in the third.\nDenver carried the momentum into the final quarter, scoring the first eight points, capped by Gallinari's two 3-pointers, for a 99-83 lead. The margin was up to 21 points (110-89) a few minutes later and the rout was on.\nTIPS IN\nNuggets: F Kenneth Faried (back spasms) did not make the trip and missed his second straight game. He last played against Brooklyn on Friday and is expected to be sidelined at least another week. \"The back is a funny thing, and he's had back issues in the past,\" Malone said.\nBulls: Hoiberg has two main objectives during the final six weeks of the regular season: win enough games to make the playoffs while taking a long look at some of the team's young players, including newly acquired Cameron Payne and Joffrey Lauvergne. \"We played 11 in the first half the other night (against Cleveland) and it's tough to play that many guys,\" Hoiberg said. \"But at the same time, you do want to get a look at the new guys.\"\nBOARD WORK\nThe Bulls had 10 offensive rebounds and a 10-2 edge in second-chance points in the first half, but were held to one offensive rebound and no second-chance points in the second half.\n\"We gave them a lot of second-chance points in the first half,\" Gallinari said. \"We knew if we took care of that in the second half, we had a chance to win.\"\nRONDO ACTIVE\nOne of the bright spots for Chicago was a season-high point total for Rondo, who was 8 for 15 from the field. \"When he's in the game, our pace just goes up a notch,\" Hoiberg said.\nUP NEXT\nNuggets: Visit the Milwaukee Bucks on Wednesday night to wrap up a quick two-game road trip.\nBulls: Host Golden State on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764995033.3450298
}