{
  "game_id": "0022000049",
  "espn_id": "401267209",
  "date": "Dec 29, 2020",
  "matchup": "TOR @ PHI",
  "headline": "Embiid shakes off injury, rallies 76ers past winless Raptors",
  "body": "PHILADELPHIA -- — Joel Embiid had all of Philadelphia holding its breath when he grabbed the back of his right leg and needed a trip to the locker room.\n\n\r\n                    Coach Doc Rivers did not check on the 76ers big man because usually the health update is “bad news.”\n\n\r\n                    The bad news did, indeed, come — for Toronto once Embiid returned to the game. Embiid shook off the injury scare to score 29 points, grab 16 rebounds and lead Philadelphia past the winless Toronto Raptors 100-93 on Tuesday night.\n\n\r\n                    “He was terrific, dominant,” Rivers said.\n\n\r\n                    Embiid, who missed Sunday’s loss against Cleveland with back stiffness, walked gingerly to the locker room early in the third quarter with the leg injury. Team president Daryl Morey and general manager Elton Brand hopped up from their courtside seats and immediately hit the locker room to check on their All-Star center. Rivers, in his first season as coach, remained outwardly calm as he waited out Embiid.\n\n\r\n                    Embiid checked back into the game several minutes later with the Sixers down 11. He sank 14 of 16 free throws — as many makes as Toronto shot (12 of 14) to keep the Sixers in this one.\n\n\r\n                    Embiid dismissed the injury and smiled as he said “everything's fine” without elaboration. \n\n\r\n                    “I just did my job,” Embiid said. \n\n\r\n                    Tobias Harris had 26 points and 11 rebounds to help Embiid on a night the Sixers shot only 38% from the floor.\n\n\r\n                    Kyle Lowry scored 24 points for the Raptors. Pascal Siakam and OG Anunoby each had 20.\n\n\r\n                    “We’ve got to stretch out our good moments,” coach Nick Nurse said. “We’ve played some great moments in all the games.”\n\n\r\n                    Lowry, the Philly native and former Villanova standout, had said the Raptors “gotta figure this out” after an 0-2 start, and a 14-point lead in the second half should have been enough to solve their early woes.\n\n\r\n                    Instead, they lost the lead in one of the weirdest ways possible. Aron Baynes appeared to hit a pump-fake 3 with the shot clock about to expire for a 90-87 lead. Embiid missed a free throw when officials stopped the game and ruled the shot clock had, in fact, expired and Baynes’ points were wiped off the board. Embiid made a second free throw and the Sixers suddenly led by one.\n\n\r\n                    Seth Curry swished a 3 from the top of the arc that pushed the 76ers’ lead to 96-91 and helped them move to 3-1.\n\n\r\n                    “We didn’t play well for long stretches of the game but we stuck it out,” Curry said.\n\n\r\n                    Ben Simmons, who had 11 points and 13 rebounds, joked before the restart last season that he hoped boos would get piped into the bubble if the Sixers played poorly to truly reflect the Philly atmosphere.\n\n\r\n                    Simmons and the Sixers would have been booed off the court had fans been allowed to watch a disaster of the first half. Simmons and Embiid were awful from the floor, a combined 2 of 11 start that let Toronto grab an 11-point lead. Embiid had made all nine free throws to at least keep Philly competitive.\n\n\r\n                    The Sixers are loaded with one-dimensional players who struggle to get their own bucket. In year three, Simmons continues to infuriate the faithful with his massive talent overshadowed by his desire to shoot beyond 15 feet. Simmons has been floated in trade rumors — Morey has said Simmons is off the table — but another dominant shooter would surely help the 76ers.\n\n\r\n                    “We can't do it without our teammates,” Embiid said. “Everybody that plays, we all come in with the same purpose, we all have the same goal.”\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Nurse said the hardest part of adjusting to life in Tampa, Florida, is finding “where the snacks are” inside the arena. But so far, so good for the Toronto-turned-Tampa Raptors. “There’s a lot of bright side,” Nurse said. “Everybody loves the weather. That seems to put a smile on everyone’s faces around the organization.” ... C Chris Boucher scored 22 points, had 10 rebounds and seven blocked shots Saturday against San Antonio. He played 5 minutes against the Sixers.\n\n\r\n                    76ers: Shake Milton missed five of his six 3-point attempts. ... Curry finished with 17 points. ... The bench had just 10 points.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Host the Knicks on Thursday.\n\n\r\n                    76ers: Play Thursday at Orlando.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996905.419181
}