{
  "game_id": "0021501124",
  "espn_id": "400829011",
  "date": "Mar 31, 2016",
  "matchup": "CHI @ HOU",
  "headline": "Mirotic scores 28 as Bulls edge Rockets 103-100",
  "body": "HOUSTON -- The Chicago Bulls overcame injuries and a nine-point fourth-quarter deficit to stun the Houston Rockets and improve their chances of sneaking into the playoffs.\nNikola Mirotic scored 28 points and Jimmy Butler added 21 to lead the Bulls to a 103-100 road win Thursday night.\n\nIn a pivotal game for two teams fighting for the final playoff spots in their respective conferences, the Bulls were fueled by a strong fourth quarter in which they outscored the Rockets 32-20. Chicago entered the fourth facing a nine-point deficit, but was able to overcome it thanks to hot shooting from Mirotic.\n\n\"It was a pretty gutty effort by our guys,\" Bulls coach Fred Hoiberg said. \"I hope this is something we can build off of.\"\nThe Bulls won their second consecutive game following a four-game skid. After Thursday's win, Chicago trails Indiana by one game for the eighth and final playoff spot in the East, thanks to a Pacers loss to Orlando on Thursday night.\nChicago holds the tiebreaker over Indiana.\nTrevor Ariza attempted a tying 3 at the buzzer, but it rimmed out and Chicago held on.\nHouston fell to 37-39, dropping a half-game behind Utah and Dallas, who are tied for the seventh and eighth seeds in the West.\n\"Our problem has been maintaining what works,\" Rockets coach J.B. Bickerstaff said. \"This was a team on the ropes. They put in their second-unit guys and they gave them a huge spark.\"\nChicago's bench outscored Houston's 67-31.\nJames Harden led Houston with 24 points and eight assists, Patrick Beverley had a career-high 22 points, and Michael Beasley added 20 points and 11 rebounds off the bench.\n\"It's very frustrating, especially in games where we should win,\" Harden said of Houston's continued inconsistency. \"We've got to figure it out.\"\nBobby Portis started at power forward for Chicago in place of Taj Gibson, who was sidelined by a broken rib with no clear timetable for a return. Additionally, Derrick Rose (hyperextended left elbow) was limited to 12 minutes and did not play in the second half.\n\"I made the decision for him that it wasn't worth it,\" Hoiberg said. \"He was out there playing with one arm.\"\nDoug McDermott handled the bulk of the minutes in Rose's absence, scoring 15 points and grabbing nine rebounds.\nThe Bulls kept pace with the Rockets in the first half, thanks in large part to 21 first-half points from Mirotic. After scoring a team season-high 15 points in the second quarter of Tuesday's win over Indiana, Mirotic dropped 14 second-quarter points on Houston, hitting four of five 3s.\n\"He's shooting with no conscience,\" Rose said of Mirotic. \"He was huge for us.\"\nHouston had a chance to take a lead into halftime, but a 30-foot attempt from Harden clanked off the front of the rim, and the score was tied at 52 at the break.\nPau Gasol had 12 points and 10 rebounds to become the 11th player in NBA history to have 500 career double-doubles.\n\"It's pretty amazing when I think about it, and it's really special to me,\" Gasol said. \"I'm just humbled and thankful that I've been able to play at this level for so long.\"\nTIP-INS\nBulls: Gibson will be reevaluated Friday, Hoiberg said. Gibson, who tried to play through the injury Tuesday for 10 minutes in Indiana, insisted he will return this season. ... Rose (elbow) wore a thick sleeve and made several trips to the locker room for treatment.\nRockets: Houston fell to 23-35 when allowing 100 or more points. ... Houston missed 16 of 25 3-point attempts, including five of seven misses from Harden. ... Houston dominated Chicago in the paint, outscoring the Bulls 48-30 from close range. ... Clint Capela had eight points and five rebounds off the bench.\nROSE'S ELBOW\nBulls point guard Derrick Rose said the discomfort in his elbow included limited flexibility and a sharp pinch when the arm is extended. He said he has undergone X-rays, which were negative, but said there's a chance an MRI might be the next step beyond his continued treatment. Rose was limited to less than 12 minutes on Thursday night and was unable to play in the second half.\n\"I tried to give it my all while I was out there, but it's really sore,\" Rose said. \"I need to get treatment and try to get back on the court as soon as possible.\"\nHARDEN'S MARCH\nHarden finished March with 457 points, 152 assists and 102 rebounds. Per game, he averaged 28.9 points, 9.6 rebounds and 6.5 assists. According to statistics from the Rockets provided by the Elias Sports Bureau, Harden is the first player to record at least 450 points, 150 assists and 100 rebounds in a single month since Oscar Robertson did it in December of 1967.\n90's THROWBACK THURSDAY\nThe Rockets hosted a 90's Throwback Thursday night, which featured a halftime performance from hip-hop group Tag Team, performing their 1993 hit, \"Whoomp! (There It Is).\" Additionally, Houston's starting lineup was announced by Tim Kitzrow, who rose to prominence in the 90's with his voice contributions to the video game, NBA Jam.\nUP NEXT\nBulls: Host Detroit on Saturday.\nRockets: Host Oklahoma City on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764993897.824919
}