{
  "game_id": "401810156",
  "espn_id": "401810156",
  "date": "Nov 30, 2025",
  "matchup": "UTAH vs HOU",
  "headline": "Houston Rockets dominate Utah Jazz for fifth straight road victory",
  "body": "SALT LAKE CITY -- — Kevin Durant scored 25 points in his return from a two-game absence, leading the Houston Rockets to a 129-101 victory over the Utah Jazz on Sunday.\n\n\r\n              Alperen Sengun had 27 points to help the Rockets win their fifth straight road victory. Steven Adams chipped in 13 points and 12 rebounds off the bench, and Amen Thompson had nine assists.\n\n\r\n              Houston’s defensive pressure led to the Rockets forcing 17 turnovers and scoring 22 points off those takeaways. The Rockets outscored Utah 21-8 in fastbreak points.\n\n\r\n              Ace Bailey led the Jazz with 19 points. Lauri Markkanen added 18 points and eight rebounds. Jusuf Nurkic totaled 14 points, nine assists, and six boards.\n\n\r\n              The Rockets held Keyonte George scoreless on 0-of-6 shooting. George also committed eight turnovers.\n\n\r\n              Houston held the Jazz to a single basket for a 6 ½ minute stretch in the first quarter, opening the door for the Rockets to go on a 19-4 run and stake out a 30-16 lead. Kevin Durant scored a basket, assisted another, and had three steals to fuel the spurt.\n\n\r\n              Utah drew as close as eight points in the second quarter, cutting Houston’s lead to 39-31 after Bailey tipped in a layup. The Rockets pulled away again behind a 16-2 run. Durant made back-to-back baskets to cap the run that put Houston up 55-33.\n\n\r\n              Houston extended its lead to 98-64 late in the third quarter following a 24-3 run sparked by back-to-back baskets from Durant and Sengun. The Jazz went six minutes without scoring a point during the run.\n\n\r\n              Up Next\r\n              Rockets and Jazz play each other again in Salt Lake City on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042721.086092
}