{
  "game_id": "0022000132",
  "espn_id": "401267292",
  "date": "Jan 08, 2021",
  "matchup": "TOR @ SAC",
  "headline": "Raptors set franchise scoring record, win 144-123 over Kings",
  "body": "SACRAMENTO, Calif. -- — Pascal Siakam had 17 points, 11 assists and nine rebounds, Toronto made 20 3-pointers and the Raptors set a franchise record for scoring while winning for the second time this season, 144-123 over the Sacramento Kings on Friday night.\n\n\r\n                    Fred VanVleet scored 34 points to help the Raptors (2-6) snap a three-game losing streak. Toronto’s only other win came on Dec. 31 against the New York Knicks.\n\n\r\n                    Nick Nurse’s team won its seventh straight against the Kings despite being without point guard Kyle Lowry (personal reasons). \n\n\r\n                    That, and the poise the Raptors showed after falling behind by 19 points in the first half, had Nurse beaming afterward.\n\n\r\n                    “When there’s a whole bunch of guys hitting the floor with that level of fight, it kind of snowballs a little bit. It’s contagious,” Nurse said. “There wasn’t a whole lot to hang our heads about other than the start, and we didn’t then.”\n\n\r\n                    Chris Boucher added 23 points and 10 rebounds for Toronto. Norman Powell scored 22 points and Terence Davis had 18. \n\n\r\n                    “We did a great job of playing with energy throughout the game, even at the start,” said Powell, who made four 3s. “We clawed our way back into the game and the guys showed a lot of heart, toughness and togetherness to give us a chance going into that second half.”\n\n\r\n                    De’Aaron Fox scored 23 points and rookie Tyrese Haliburton had 15 points and eight assists for Sacramento.\n\n\r\n                    Toronto outscored Sacramento 33-20 in the fourth quarter.\n\n\r\n                    “They manhandled us, especially in that second half,” Kings coach Luke Walton said. “We built up a nice, big lead, and you see it all the time in the NBA ... they got hot. It didn’t matter who they put in the game, they weren’t missing. We relaxed, and as soon as we relaxed they found a nice smooth rhythm.”\n\n\r\n                    The Raptors’ previous record for scoring in the regular season was 140 points, last done against the New Orleans Pelicans on Oct. 22, 2019. Toronto scored 150 points against the Brooklyn Nets on Aug. 23 in the first round of the Eastern Conference playoffs.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Toronto had six players in double figures. … The Raptors dominated on the boards 44-26.\n\n\r\n                    Kings: Sacramento shot 81% (17 of 21) with six 3s and scored a season-high 43 points in the first quarter. … The Kings had a season-high 36 assists. … Haliburton had a 3-pointer taken away upon review in the first quarter when it was ruled he stepped out of bounds before shooting. … Richaun Holmes picked up his fourth foul with 3:46 left in the second.\n\n\r\n                    BEATS STANDING IN LINE\n\n\r\n                    Fans have not been allowed inside Golden1 Center all season but that hasn’t stopped some from getting as close a look as possible. Two elderly women in wheelchairs peered through the glass doors encircling the arena and were able to see the game being shown on the giant scoreboard above the court, a ritual they have taken on for every home game this season. They were joined Friday night by a small group of people wearing Kings jerseys who were socially distanced nearby.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Visit Golden State on Sunday. Toronto has won three straight in the series, most recently beating the Warriors to clinch a playoff berth in March of last year.\n\n\r\n                    Kings: Host the Trail Blazers on Saturday night. The two teams play again at Golden1 Center next Wednesday.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764996898.6164422
}