{
  "game_id": "0022400380",
  "espn_id": "401704946",
  "date": "Dec 21, 2024",
  "matchup": "PHI @ CLE",
  "headline": "Darius Garland scores 26 points, NBA-leading Cavaliers rout 76ers 126-99 for 25th win in 29 games",
  "body": "CLEVELAND -- — Darius Garland scored 26 points and Evan Mobley had 22 points, 13 rebounds and seven assists, sending the NBA-leading Cleveland Cavaliers to a 126-99 victory over the Philadelphia 76ers on Saturday night.\n\n\r\n              Donovan Mitchell had 19 points and Georges Niang added 13 points off the bench for Cleveland, which is 25-4 for the top record in the league.\n\n\r\n              The Cavaliers tied their season high with 22 3-pointers -- Garland made 6 of 7 -- and improved to an NBA-best 16-1 at home.\n\n\r\n              Tyrese Maxey scored 13 of his 27 points in the third quarter and Paul George had 11 points for Philadelphia. Kelly Oubre Jr. had nine points, but the 76ers were outscored by 34 in his 27 minutes.\n\n\r\n              Philadelphia center Joel Embiid, who has a sinus fracture and knee soreness, did not play the second game of a back-to-back set. The former MVP scored 34 points Friday in a win over Charlotte.\n\n\r\n              Takeaways\r\n              76ers: Coach Nick Nurse felt comfortable with his rotation until rookie shooting guard Jared McCain underwent knee surgery Tuesday. “When you lose McCain, all those plans go right out the window,” Nurse said.\n\n\r\n              Cavaliers: After a scoreless first quarter, Mobley erupted for 12 points in the second and 10 in the third by imposing his will in the paint. The fourth-year pro is averaging a career-high 18.4 points and 9.0 rebounds.\n\n\r\n              Key moment\r\n              Mobley drove down the lane for a thunderous slam over KJ Martin and Andre Drummond — causing the crowd and the Cavaliers’ bench to erupt — as part of a 9-0 run to open the second half.\n\n\r\n              Key stat\r\n              The Cavaliers made 22 3-pointers in 43 attempts, marking the first time in franchise history they have made 19 or more in three consecutive games. Cleveland leads the NBA with a .405 3-point percentage.\n\n\r\n              Up next\r\n              The 76ers host San Antonio on Monday. The Cavaliers host Utah on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998222.1932008
}