{
  "game_id": "0022000724",
  "espn_id": "401307514",
  "date": "Mar 31, 2021",
  "matchup": "BKN vs. HOU",
  "headline": "Nets lose Harden but beat Rockets, move into first in East",
  "body": "NEW YORK -- — Admittedly down in the doldrums, the Brooklyn Nets were behind by 18 points in less than five minutes.\n\n\r\n                    By the end of the night, they were on top of the Eastern Conference.\n\n\r\n                    Kyrie Irving had 31 points and a season-high 12 assists, and the Nets overcame the loss of James Harden to beat the Houston Rockets 120-108 on Wednesday night and move into first place in the East.\n\n\r\n                    Harden sat out the fourth quarter against his former team with right hamstring tightness, finishing with 17 points, eight rebounds and six assists.\n\n\r\n                    The Nets put together the pivotal run without him, scoring 12 straight midway through the final period to turn a six-point deficit into a 107-101 lead.\n\n\r\n                    Coach Steve Nash said the Nets will see how Harden feels Thursday before their game against Charlotte, but was confident the All-Star guard didn't have a long-term injury. Brooklyn has been without Kevin Durant since mid-February because of his own hamstring strain.\n\n\r\n                    “Any time someone goes down it’s very concerning,” Irving said. “Any time someone doesn’t play we definitely have to have that mentality that we’re still going to play at a very high level.”\n\n\r\n                    Joe Harris added 28 points for the Nets, who didn't even lead until the last half-minute of the third quarter, but emerged with their 19th win in 22 games, improving to 26-9 since acquiring Harden from Houston on Jan. 14. \n\n\r\n                    At 33-15, they are a half-game ahead of Philadelphia atop the East. It’s the latest the Nets have led the East since they were 49-31 on April 13, 2003, according to the Elias Sports Bureau.\n\n\r\n                    Kevin Porter Jr. scored 20 points for the Rockets, who got Christian Wood back after missing the previous two games because of injury and illness but were without John Wall because of a knee injury.\n\n\r\n                    Danuel House Jr. added 18 points and Wood had 14, but he pointed the finger at himself after taking just three shots in the final period.\n\n\r\n                    “Fourth quarter we kind of get stagnant and if I’m going to be that franchise guy, that leader that I know I can be, I have to lead my team in the fourth,” Wood said. “I have to be better.”\n\n\r\n                    Nash said before the game his team had been flat lately and its level of play had dropped, and nothing changed in the first few minutes. \n\n\r\n                    The Rockets jumped to a 24-6 lead, with an 8-for-9 start that included makes on all five 3-point attempts. They barely cooled off the rest of the quarter, going 15 for 19 (79%) and taking a 42-29 lead.\n\n\r\n                    “We talked it over. They took the challenge and that’s what matters. You can talk until you’re blue in the face, if they don’t take the challenge it doesn’t matter,” Nash said. “So our guys, they had pride and they had respect for each other and went out and competed and were unbelievable in the second half.” \n\n\r\n                    Brooklyn finally sustained a good stretch with 12-0 run in the third that cut a 13-point deficit to 82-81 and Houston went into the fourth up by one. \n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: Houston used its 32nd different starting lineup in 47 games. ... Wall struggled to 7-for-26 shooting in his last two games and sat out a workout Tuesday because of his knee pain. The Rockets listed the injury as a left knee effusion and it's unknown whether it will keep him out longer. “Kind of remains to be seen as far as the next step or how long it’ll be,” coach Stephen Silas said. “Hopefully it will be just tonight and he’ll play in Boston.” \n\n\r\n                    Nets: Brooklyn finished 11-2 in March, tying its record in February 2004 for the best in franchise history with a minimum of 10 games played. ... Blake Griffin had 11 points.\n\n\r\n                    TAKING THEIR SHOTS\n\n\r\n                    Rockets guard Ben McLemore posted a picture of himself Tuesday after getting a coronavirus vaccine shot, with a caption “Dose #1!! On the road to normalcy.” Silas said vaccinations were made available to Rockets employees, players and staff Tuesday, and the team previously had an information call with the NBA to answer their questions about the vaccines.\n\n\r\n                    “It was up to each individual guy to make the decision whether they wanted to do it or not, but we were in full support as an organization either way,” Silas said. \n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Visit Boston on Friday.\n\n\r\n                    Nets: Host Charlotte on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997482.727829
}