{
  "game_id": "0022400994",
  "espn_id": "401705560",
  "date": "Mar 18, 2025",
  "matchup": "BKN @ BOS",
  "headline": "Baylor Scheierman and Kristaps Porzingis lead the Celtics to a 104-96 win over the Nets",
  "body": "BOSTON -- — Baylor Scheierman scored 13 of his career-high 20 points in the fourth quarter, Kristaps Porzingis had 25 points and 13 rebounds and the Boston Celtics beat the Brooklyn Nets 104-96 on Tuesday night. \n\n\r\n              Scheierman took advantage of some bonus playing time as the Celtics rested injured stars Jayson Tatum and Jaylen Brown against the struggling Nets. Boston still had plenty down the stretch to hold off Brooklyn, which couldn't stop Scheierman’s second-half surge. \n\n\r\n              After beating the buzzer at the end of the third with a 3-pointer that put Boston up 71-70, Scheierman hit three more from beyond the arc in the fourth before leaving to a standing ovation with about four minutes left. Scheierman, a rookie out of Creighton, had never scored more than 15 points before Tuesday. \n\n\r\n              Derrick White scored 18 points, Jrue Holiday had 12 points and eight assists and Payton Pritchard added 10 points for Boston, which won its third straight.\n\n\r\n              D’Angelo Russell led Brooklyn with 18 points. Ziaire Williams scored 15 and Cameron Johnson and Trendon Watford added 11 points apiece. \n\n\r\n              Takeaways\r\n              Celtics: With 13 games remaining in the regular season and facing the struggling Nets, Tatum (knee) and Brown (right knee, back) got some extra rest. The remaining Celtics beat the Nets for the ninth straight time in the regular season. \n\n\r\n              Nets: After snapping a three-game losing streak Sunday with a win over Atlanta and leading after two periods Tuesday, Brooklyn couldn’t hold off the Celtics in the fourth. \n\n\r\n              Key moment\r\n              After a layup by Tyrese Martin put Brooklyn up 80-71 midway through the fourth, Scheierman hit the first of back-to-back 3-pointers that put Boston in control.\n\n\r\n              Key stat\r\n              The Celtics shot 11 for 20 in the fourth quarter, outscoring Brooklyn 33-26 in the period. \n\n\r\n              Up next\r\n              Brooklyn visits Indiana on Thursday night. The Celtics start a six-game trip on Friday night at Utah.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997967.700811
}