{
  "game_id": "0022400438",
  "espn_id": "401705004",
  "date": "Dec 29, 2024",
  "matchup": "TOR vs. ATL",
  "headline": "Young scores 34 as Hawks beat Raptors 136-107, hand Raptors 10th consecutive loss",
  "body": "TORONTO -- — Trae Young had 34 points and 10 assists, De’Andre Hunter scored 22 points and the Atlanta Hawks routed the Toronto Raptors 136-107 on Sunday night for their fourth straight win.\n\n\r\n              Clint Capela had 11 points and 13 rebounds as the Hawks opened a six-game trip by handing the reeling Raptors their 10th consecutive loss.\n\n\r\n              Scottie Barnes scored 19 points and RJ Barrett had 17, but the Raptors fell behind by more than 30 points and allowed more than 130 for the second straight game. Toronto gave up a franchise-worst 155 points in Thursday’s loss at Memphis.\n\n\r\n              Young shot 7 for 13 from 3-point range, singlehandedly making as many shots from distance than the entire Raptors team, who combined to go 7 for 24.\n\n\r\n              Toronto’s Bruce Brown made his season debut after sitting out the first 31 games recovering from right knee surgery. Brown soared for a one-handed dunk for his first points shortly after entering the game in the first quarter. He finished with 12 points in 19 minutes.\n\n\r\n              Takeaways\r\n              Hawks: The Hawks had 10 steals in the first quarter and finished with a season-high 22. Atlanta's previous high was 16.\n\n\r\n              Raptors: Center Jakob Poeltl scored 13 points in his return after missing the past four games because of a strained left groin.\n\n\r\n              Key moment\r\n              Atlanta turned a six-point halftime lead into a 22-point cushion after three quarters thanks to an explosive 40-point third quarter, led by 12 points from Young.\n\n\r\n              Key stat\r\n              Toronto turned the ball over on its first five possessions of the game and six of the first seven. The Raptors had as many miscues (10) as made baskets in the first quarter. They finished with a season-worst 31 turnovers.\n\n\r\n              Up next\r\n              Toronto visits Boston on Tuesday afternoon, while Atlanta heads to Denver for a New Year’s Day matchup on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996974.577868
}