{
  "game_id": "0022400275",
  "espn_id": "401704841",
  "date": "Nov 24, 2024",
  "matchup": "TOR @ CLE",
  "headline": "Mitchell's 26 points help Cavs improve to 17-1, stay perfect at home with 122-108 win over Raptors",
  "body": "CLEVELAND -- — Donovan Mitchell and Ty Jerome scored 26 points apiece as the Cleveland Cavaliers improved to 17-1 and stayed perfect at home with a 122-108 win over the Toronto Raptors on Sunday night.\n\n\r\n              The Cavs, who opened the season 15-0 before losing at Boston last week, are 10-0 on their home floor for the first since the 2017-18 season, when they won their first 13 games at Rocket Mortgage FieldHouse.\n\n\r\n              Jarrett Allen had 23 points and 13 rebounds for Cleveland. Evan Mobley added 14 and 11.\n\n\r\n              Scottie Barnes and Gradey Dick had 18 points apiece for the Raptors, now 0-8 on the road.\n\n\r\n              RJ Barrett added 16 points and Jakob Poeltl had 18 rebounds for Toronto. Barrett was playing his second game after missing 11 straight with a fractured orbital bone.\n\n\r\n              It was another strong performance for Jerome, who has been a surprise contributor for the Cavs after missing almost all of last season with an ankle injury. The 27-year-old scored a career-high 29 in Cleveland's previous game.\n\n\r\n              Takeaways \r\n              Raptors: Played well in spurts, but made far too many mistakes to pull off the upset. Effort isn't the problem, execution is. ... Dick was forced out in the second half with a sore left calf.\n\n\r\n              Cavaliers: A few days off were mentally and physically beneficial, but may have contributed to some sluggishness and sloppiness. Cleveland seemed to be on cruise control for long stretches, allowing Toronto to hang around.\n\n\r\n              Key moment \r\n              With the Raptors only down six points entering the fourth, Mitchell scored seven straight and Jerome dropped a 3-pointer from the extended right elbow in a 10-1 burst to put the Cavs in full control.\n\n\r\n              Key stat \r\n              Allen came in second in the league in field-goal percentage (.685) behind only Dallas' Daniel Gafford (.708).\n\n\r\n              Up Next \r\n              The Raptors continue a four-game trip at Detroit on Monday. The Cavaliers host Atlanta on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996988.486203
}