{
  "game_id": "401810025",
  "espn_id": "401810025",
  "date": "Nov 04, 2025",
  "matchup": "LAC vs OKC",
  "headline": "Thunder surge past Clippers 126-107 to extend season-opening winning streak to 8",
  "body": "INGLEWOOD, Calif. -- — Shai Gilgeous-Alexander had 30 points and 12 assists and the defending champion Oklahoma City Thunder extended their season-opening winning streak to eight games with a 126-107 victory over the Los Angeles Clippers on Tuesday night.\n\n\r\n              Isaiah Joe added 22 points and Cason Wallace and Aaron Wiggins each had 12 to help the Thunder overcame an early surge by the Clippers to set a franchise record for consecutive victories to start a season.\n\n\r\n              Gilgeous-Alexander, who played for the Clippers in his rookie season before he was traded to the Thunder, was 9 of 14 from the floor and 4 of 5 from 3-point range.\n\n\r\n              James Harden scored 25 points and John Collins added 17 for the Clippers. They were without Kawhi Leonard (ankle) and Bradley Beal (knee) on the second night of a home back-to-back.\n\n\r\n              Derrick Jones Jr. scored 16 points as the Clippers lost consecutive home games after winning the first three in their own building.\n\n\r\n              After trailing by as many as 13 points in the first half, the Thunder took the lead for good at 81-78 on a 3-pointer from Aaron Wiggins with 3:34 remaining in the third quarter. Oklahoma City closed the quarter on an 8-2 run to take a 94-86 lead.\n\n\r\n              The Thunder put the game away with a 11-0 run to open the fourth quarter for a 105-86 advantage. It was an extended 17-0 run going back to consecutive 3-pointers from Isaiah Joe and Gilgeous-Alexander to end the third.\n\n\r\n              Up next\r\n              Thunder: At Portland on Wednesday night.\n\n\r\n              Clippers: At Phoenix on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042562.5147579
}