{
  "game_id": "0021900719",
  "espn_id": "401161361",
  "date": "Jan 30, 2020",
  "matchup": "SAC @ LAC",
  "headline": "Kings win 1st hoops game at Staples since Kobe's death",
  "body": "LOS ANGELES --  De'Aaron Fox and the Sacramento Kings knew it was going to be an emotional night in Los Angeles. They responded with one of their best games this season.\n\nFox scored a career-high 34 points and the Kings made a franchise-record 21 3-pointers in a 124-103 victory over the Clippers on Thursday. It was the first basketball game at Staples Center since Kobe Bryant, his 13-year-old daughter Gianna and seven others were killed in Sunday's helicopter crash in Southern California.\n\nPaul George narrated a 2-minute video tribute shown before the game while Bryant's retired No. 8 and No. 24 Lakers jerseys were left uncovered in the upper left corner of the arena.\n\n\"I'm really proud of the way our guys played,\" said Kings coach Luke Walton, a teammate of Bryant's on championship teams with the Lakers. \"We came in down and tired after playing last night (a 20-point loss to Oklahoma City) and then came into an emotional situation in what has been a very tough week.\"\n\nBuddy Hield added 19 points and Cory Joseph had 16 as the Kings took control in the second quarter. The 21-point margin tied for the Kings' largest victory of the season.\n\nWalton praised Fox for doing a nice job of setting the tone early. The third-year guard said he concentrated on coming out aggressive, especially after Wednesday night's struggles.\n\n\"In most games I haven't started off well early, but I wanted to try and come out and stay in attack mode,\" Fox said.\n\nLou Williams scored 22 points and Montrezl Harrell had 21 for the Clippers, who were without Kawhi Leonard. The All-Star forward was scratched after pregame warmups due to a lower back strain.\n\nCoach Doc Rivers said Leonard's back locked up late in warmups. Leonard tried stretching to get it loose but couldn't during the first half. When asked if he was concerned the injury could linger, Rivers said it was too early to know.\n\nGeorge returned after missing the previous nine games due to a left hamstring strain and scored eight points in 19 minutes.\n\n\"Sacramento played last night and were in very good rhythm. We were clearly flat in every area. It was tough basketball-wise,\" Rivers said.\n\nThe Clippers led 33-28 at the end of the first quarter but Sacramento seized control in the second, outscoring Los Angeles by 22 to take a 64-47 advantage at halftime. Joseph led the way with 12 points in the period as he went 4 of 6 on 3-pointers. Nine of the Kings' 13 field goals in the quarter were from beyond the arc.\n\nThe Kings -- who have won three of four following a six-game losing streak -- scored eight straight points to start the second and never trailed after that. JaMychal Green's 3-pointer with 7:54 remaining drew the Clippers to 42-40 before the Kings went on a 22-4 run to put it out of reach. Joseph had nine points and Fox scored eight during the spurt as Sacramento was 8 of 12 from the field compared to the Clippers making only two of 14.\n\nLos Angeles got within 13 in the fourth quarter before the Kings pulled away again. Their largest lead was 23 later in the period on Fox's breakaway dunk.\n\nTIP-INS\n\nKings: Bogdan Bogdanovic had 15 points and Dewayne Dedmon added 11 points and 11 rebounds. ... Marvin Bagley III will be out at least three more weeks due to left foot soreness. The second-year forward has played in only 13 games this season due to a myriad of injuries.\n\nClippers: Landry Shamet scored 15 points and Patrick Beverley had 11. ... It was the 13th game Leonard has missed this season but the first not due to his left knee. George and Leonard have played together in only 18 of the Clippers' 48 games. The last time it happened was Jan. 2 against Detroit. George missed 11 games at the beginning of the season after having shoulder surgery last summer. Then he was out 10 of the last 11 due to his left hamstring.\n\nUP NEXT\n\nKings: Host the Los Angeles Lakers on Saturday. Sacramento has lost its last three against the Lakers, including the first meeting this season.\n\nClippers: Host the Minnesota Timberwolves on Saturday afternoon. Los Angeles won the first meeting by seven on Dec. 13.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996396.376097
}