{
  "game_id": "0022000153",
  "espn_id": "401267313",
  "date": "Jan 11, 2021",
  "matchup": "PHI @ ATL",
  "headline": "Young's 26 points lead Hawks past short-handed 76ers, 112-94",
  "body": "ATLANTA -- — Trae Young scored 26 points, including the first three baskets of Atlanta's dominant start to the second half, and the Hawks beat the short-handed Philadelphia 76ers 112-94 on Monday night.\n\n\r\n                    De'Andre Hunter and Brandon Goodwin had 15 points as the Hawks snapped a four-game losing streak. Clint Capela added 12 points and 10 rebounds as six Atlanta players scored in double figures.\n\n\r\n                    Young, who was held to a combined 22 points in his last two games, regained his scoring touch. He opened the second half with a jumper before adding back-to-back layups. \n\n\r\n                    “We were just playing fast, getting back to what we do and the shots were just going in,” Young said. “You could see the confidence with everybody rolling.”\n\n\r\n                    Young's spurt keyed Atlanta's 15-2 run to open the half. The Hawks stretched a 65-50 halftime advantage to an 80-52 lead with the run.\n\n\r\n                    “I think the most important part of the game was how we came out after the break, and Trae was a big part of that,” said Hawks coach Lloyd Pierce.\n\n\r\n                    Atlanta led 95-65 late in the third before Young and other starters sat out the final period.\n\n\r\n                    Joel Embiid led Philadelphia with 24 points and 11 rebounds. Isaiah Joe had 18 points.\n\n\r\n                    The Sixers used nine players. That may have seemed like an abundance of depth after Philadelphia was limited to only seven players in Saturday's 115-103 home loss to Denver. Forward Mike Scott (knee) and Embiid (back tightness) returned to add depth.\n\n\r\n                    Philadelphia is far from full strength. Ben Simmons (sore left knee) was again held out. The depth problems will continue through the week after Seth Curry tested positive for COVID-19 on Thursday.\n\n\r\n                    Tobias Harris and reserves Shake Milton, Matisse Thybulle and Vincent Poirier were again held out due to COVID-19 protocols. The NBA called off two games on Monday due to the virus. \n\n\r\n                    “No one is going to feel sorry for us,” said Sixers coach Doc Rivers. “We’ve got to try to win these games. We’ve in a tough spot with COVID. ... I have a sneaking feeling a lot of teams are going to have this problem.”\n\n\r\n                    Rookie Tyrese Maxey, who scored 39 points in his first start against Denver, had 15.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Rivers said he hopes Simmons (sore left knee) can return Tuesday night against Miami after missing his second consecutive game. “We thought it'd be one game and now it's two,” Rivers said. The team was fined $25,000 on Monday for failing to list Simmons on the initial injury report Saturday's game against Denver. ... F Furkan Korkmaz (groin) was held out.\n\n\r\n                    Hawks: Pierce had no update on the severity of G Bogdan Bogdanovic's avulsion fracture in his right knee. The team announced Sunday soft tissue inflammation and a bone bruise also was diagnosed. Bogdanovic was one of the major offseason acquisitions for Atlanta, signing a four-year, $72 million contract in free agency. ... G Tony Snell (right foot) made his season debut midway through the fourth period and missed each of his three shots.\n\n\r\n                    ALL 3s\n\n\r\n                    John Collins took only seven shots, and all were 3s. He made four of them to score 12 points. “He shot 3s because they played big and they played down the floor,” Pierce said of the Sixers.\n\n\r\n                    FAMILY AND FRIENDS ONLY\n\n\r\n                    The Hawks have pushed back their plan to allow about 1,700 ticketed fans to home games. The target date to allow 10% capacity was changed from Jan. 18 to Jan. 26. The Hawks credited “an abundance of caution” for making the change after after consulting with state and health officials. The team has had only a few family and friends attend home games.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Return home to play the first of back-to-back games against Miami on Tuesday night. The teams play again in Philadelphia on Thursday night.\n\n\r\n                    Hawks: Open a three-game road trip at Phoenix on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997106.482979
}