{
  "game_id": "0022000261",
  "espn_id": "401267421",
  "date": "Jan 25, 2021",
  "matchup": "LAL @ CLE",
  "headline": "LeBron scores 46, Lakers beat Cavs to stay perfect on road",
  "body": "CLEVELAND -- — Back home, LeBron James kept the Lakers perfect on the road.\n\n\r\n                    James went on a scoring tear in the fourth quarter, getting 21 of his 46 points with a variety of dazzling shots and plays only he seems to make, leading Los Angeles to a 115-108 win over the Cleveland Cavaliers on Monday night.\n\n\r\n                    James' first game in Ohio in more than two years couldn't have gone much better.\n\n\r\n                    “Home cooking,” said James, who got a meal made by his mom, Gloria. “It felt good to be back in my haven.”\n\n\r\n                    Anthony Davis added 17 points as the defending NBA champions improved to 10-0 away from home. The win for Los Angeles came on the eve of the one-year anniversary of Lakers legend Kobe Bryant's tragic death in a helicopter crash.\n\n\r\n                    James' outburst in the fourth was reminiscent of something Bryant might do as well, and it was fueled by him wanting to shut up a member of Cleveland's front office group sitting in the socially-distanced front row across from the Cavs' bench.\n\n\r\n                    When James was short with a 3-pointer at the end of the third quarter, the unidentified Cavs executive celebrated.\n\n\r\n                    “I felt he was a little too excited about seeing me miss,” James said playfully. “I knew I had another quarter and the fourth quarter is my favorite. It's a good thing for him I only come here once.”\n\n\r\n                    Over the final 12 minutes, James made 9 of 10 shots, posing to hold his form after draining a 34-foot 3-pointer just before the 24-second clock expired to put the Lakers ahead 103-98.\n\n\r\n                    James followed that with a step-back 3 and then drained a fadeaway turn-around jumper in the corner before shaking his head at Cleveland' bench.\n\n\r\n                    “When he's playing like that, it's fun to watch,” Davis said. “When he had what 19, 17 in the first? It’s over. ... He wasn't missing. He was everywhere on the floor.”\n\n\r\n                    Andre Drummond scored 25 and added 17 rebounds for the Cavaliers, who were blown out by 38 on Sunday in Boston. Cedi Osman added 20 points and Collin Sexton 17 for the Cavs.\n\n\r\n                    Coach J.B. Bickerstaff said before the game that he wanted his team to “scrap” and that's exactly what the Cavs did — until James took over the way he did in Cleveland for 11 seasons.\n\n\r\n                    “When a guy is doing what he did, he's hard to deal with,” Bickerstaff said. “We've all seen that.”\n\n\r\n                    While still a homecoming for James, this one felt very different.\n\n\r\n                    Due to COVID-19 restrictions, there were only 2,000 fans inside 18,000-plus-seat Rocket Mortgage FieldHouse, which was known as Quicken Loans Arena when James led the Cavs to the 2016 NBA championship and ended a 52-year title drought in Cleveland.\n\n\r\n                    The sparse crowd welcomed him warmly and the building was dotted with plenty of fans wearing James' purple-and-gold LA jersey.\n\n\r\n                    It was only James' second trip back to Cleveland since he left the Cavs for the second time as a free agent after the 2018 season. Last year's game was cancelled by the pandemic.\n\n\r\n                    After dusting off his pregame chalk toss, a ritual he started with the Cavs and only breaks out these days for special occasions, James dropped four 3-pointers and scored 17 in the first quarter.\n\n\r\n                    HONORING KOBE\n\n\r\n                    On Tuesday, the Lakers' family will have painful memories awakened by the loss of Bryant, whose passing shook their organization, the NBA and sports world. The 41-year-old Bryant died while traveling with his 13-year-old daughter, Gianna, from one of her basketball games.\n\n\r\n                    Knowing that Bryant's anniversary will be emotional for everyone, Lakers coach Frank Vogel is giving his players the day off to allow them to better manage their grief and honor their late teammate Bryant “how they see fit.”\n\n\r\n                    “It's not a day remembrance like his birthday,” Vogel said. “It's more of a somber-tone-type-of-day.”\n\n\r\n                    The Lakers are spending the night in Cleveland before flying to Philadelphia — Bryant's hometown — on Tuesday. They play the 76ers on Wednesday.\n\n\r\n                    OLD FRIEND\n\n\r\n                    Bickerstaff first met Bryant at a summer camp while they were in high school.\n\n\r\n                    When Bickerstaff walked onto the court, he noticed none of his teammates had matched up defensively against Bryant, so he said, “I’ll take him.”\n\n\r\n                    Bickerstaff claimed he held his own that day and his admiration for Bryant grew in the years to come.\n\n\r\n                     “He changed the game for the next generation,” Bickerstaff said. “His will to win was second to none. His commitment to his craft was second to none.”\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: C Marc Gasol picked up three fouls in the first 3:02. ... James will one day have his No. 23 jersey retired in Cleveland — and Miami and Los Angeles. He's the Cavs' career leader in games played, points, rebounds, assists, steals, 3-pointers made, free throws and more.\n\n\r\n                    Cavaliers: The Cavs were missing forward Larry Nance Jr., who sprained his right wrist against the Celtics. Nance leads the league with 2.3 steals per game. ... F Kevin Love (calf) and G Matthew Dellavedova (concussion) are the only players left on Cleveland's roster from the '16 title team with James and both missed the game with injuries.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: On their visit to Philadelphia a year ago, which came on the night before Bryant's death, James passed the Black Mamba on the career scoring list.\n\n\r\n                    Cavaliers: Host the Detroit Pistons on Wednesday. The Cavs beat the Pistons in overtime on Dec. 26.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997324.112991
}