{
  "game_id": "0021501174",
  "espn_id": "400829061",
  "date": "Apr 07, 2016",
  "matchup": "CHI @ MIA",
  "headline": "Heat rally past Bulls 106-98 for 46th win of the season",
  "body": "MIAMI -- Dwyane Wade wanted Miami to view Thursday night as a close-out opportunity, a chance for the Heat to essentially finish off a Chicago team desperate to keep its season alive.\nIn short, a dress rehearsal for any series-clinching scenarios that might await in the playoffs.\nIt went exactly to Wade's liking.\nWade scored 21 points, Joe Johnson added 17 and the Heat beat the Bulls 106-98, putting up 66 points in the second half and making big defensive plays to pull away down the stretch.\n\"At this time of year, you have to use certain situations to try to prepare us because we've never been there together as a team,\" Wade said. \"This was one of those situations.\"\nGoran Dragic and Hassan Whiteside each had 16 points and 12 rebounds for Miami, which has 14 consecutive games of scoring 100 or more at home -- the second-longest such streak in franchise history.\nLuol Deng scored 13, Josh Richardson had 11 and Amare Stoudemire added 10 for the Heat (46-32), who remained fifth in the Eastern Conference.\nJimmy Butler scored 25 points for the Bulls (39-40), who now need a series of miracles to get into the postseason. Pau Gasol finished with 21 points and 12 rebounds, and Derrick Rose scored 17 for Chicago, which could be officially eliminated as early as Friday.\n\"Obviously it's not the way that we wanted,\" Butler said. \"I think everybody thinks about it each and every day. It probably keeps everybody up late, I know it does for me. But we can't change it now. It is what it is.\"\nRose had a chance at a layup that would have given Chicago the lead with 3:50 left, only to see it blocked by Whiteside to set up a three-point play by Wade and a 90-86 Heat lead.\n\"That's his gift,\" Heat coach Erik Spoelstra said of Whiteside's block.\nMoments later, Butler thought he saw someone open in the corner but his pass was deflected for a steal by Wade, leading to more Heat points as Miami kept pulling away.\nChicago hasn't missed the playoffs since 2007-08, when the Bulls finished 33-49. They then beat 60-1 odds to win the draft lottery, getting the right to take Rose with the No. 1 overall pick -- while Miami, far and away the NBA's worst team that season, wound up taking Michael Beasley with the No. 2 selection.\nRose isn't ready to concede.\n\"Still have three more to go,\" he said.\nMiami sputtered offensively in the first half, trailing 46-40 at the break. The Heat came out and scored 35 in the third, the 17th time the Bulls gave up that many in a quarter this season. That happened only seven times last season.\nTIP-INS\nBulls: Taj Gibson (ribs) tried to warm up before the game, but wound up missing his fifth consecutive contest. ... Gasol had a double-double against Miami for the 17th time in his career. It was also his 99th in the last two regular seasons, after leading the NBA with 54 last season. ... The Bulls were swept by Miami for the first time since 2003-04, Wade's rookie season.\nHeat: Dragic's 12 rebounds were a career high. ... Justise Winslow appeared in his 75th game. He'll finish the regular season as the Heat leader in games, the fifth rookie in team history to have that distinction. ... The Heat had three assists in the first half, their lowest in any half since Feb. 14, 2012. The trend didn't last -- they had five in the first 4:02 of the second half.\nUNCHARACTERISTIC\nDoug McDermott's flagrant foul against Whiteside late in the third quarter was unusual in many ways. Not only was it Chicago's first flagrant call of the season, it was the first time McDermott was whistled for anything other than a common foul in years. He had no flagrants or technicals in his first 117 NBA games, and no technicals in his 145 games at Creighton.\nBOSH SPEAKS\nChris Bosh blogged again Thursday, following up his recent thoughts about beer and barbecue with revelations of what apps he's using and his affinity for technology. He offered no update on his battle with blood clots or if he's still hoping of returning this season. Thursday was his 25th game missed since being diagnosed with a clot in his leg at the All-Star break.\nUP NEXT\nBulls: Host Cleveland on Saturday.\nHeat: Visit Orlando on Friday.",
  "source": "espn_api",
  "crawled_at": 1764993891.245124
}