{
  "game_id": "0021700987",
  "espn_id": "400975733",
  "date": "Mar 10, 2018",
  "matchup": "CHA vs. PHX",
  "headline": "Hornets hold off Suns 122-115 to snap 5-game skid",
  "body": "CHARLOTTE, N.C. --  Hornets coach Steve Clifford walked into his postgame press conference and smiled.\n\n\"We needed to win a game and we won a game, so that's it,\" he said. \"That's how I feel and I'm sticking with it.\"\n\nIt didn't matter to Clifford that his team nearly squandered a 22-point fourth-quarter lead on Saturday night to a struggling Phoenix Suns squad playing without leading scorer Devin Booker and without any player averaging in double figures. For Clifford, the end of a five-game losing streak was enough to put him in a good mood.\n\nDwight Howard had 30 points and 12 rebounds, Nic Batum flirted with a triple-double as Charlotte held on to beat Phoenix 122-115. Batum added 29 points, 12 rebounds and seven assists and Marvin Williams chipped in with 16 points as the Hornets wrapped up a three-game homestand.\n\n\"We had to grind it out,\" Williams said.\n\nThe Hornets led by eight at halftime and seemed ready to put this one on cruise control after outscoring the Suns 35-21 in the third quarter behind 14 points from Batum.\n\nAfter Charlotte entered the fourth quarter up by 22, Batum thought he was done playing.\n\n\"We (the starters) had to come back out,\" Batum said. \"Give them credit -- they didn't give up. They came back. It was a tough game for us.\"\n\nPhoenix shot 9 of 15 from 3-point range in the fourth quarter, including three each from Dragan Bender and Marquese Chriss and two from Troy Daniels to climb back in with 4 minutes remaining.\n\nBut they couldn't get the one 3-pointer they needed the most to fall.\n\nElfrid Payton's potential go-ahead jumper with 1:45 left bounced off the front rim, and Batum buried his fourth 3-pointer with 51 seconds left at the other end to give Charlotte some breathing room.\n\nHoward and Batum each added two clutch free throws down the stretch to secure the win for Charlotte (29-38).\n\n\"They're very well-coached and they have a lot of fight in them, so we have to do a better job of executing down the stretch,\" Williams said. \"We let them back in the game, they hit a ton of threes in the fourth quarter that really hurt us, so we'll take a look at it. But it was a good win for us.\"\n\nIt was Howard's second straight 30-point game for the Hornets and it marked his 18th game with at least 20 points and 10 rebounds, eighth-most in the NBA.\n\nDaniels had 17 points and Bender had 16 for the Suns (19-49), who have lost 11 of their last 12.\n\n\"As long as we keep fighting like we did in the second half, good things are going to come,\" Bender said.\n\nTIP INS\n\nSuns: Booker did not play because of a strained triceps. Josh Jackson (knee), T.J. Warren (back spasms), Brandon Knight (torn ACL) and Alan Williams (torn meniscus) also sat out. ... Tyler Ulis had 11 points and 10 assists for the Suns. ... Shot 18 of 32 from 3-point range.\n\nHornets: Cody Zeller did not play due to knee soreness. ... Frank Kaminsky had 16 points, but Charlotte's reserves were outscored 47-28.\n\nCUT ME, MICK: Williams left briefly after taking an elbow to the eye that required four stitches.\n\n\"It was unintentional. I don't think he tried to do it on purpose or anything like that,\" Williams said. \"I just kind of wiped my face and had blood on my hand. The trainer was telling me that I had to come back (to the locker room) and get stitches, but I wanted to stay in the game. I didn't realize how bad it was.\"\n\nREED STEPS UP: Suns interim coach Jay Triano was thrilled with the play of Davon Reed, who made the most of his extended playing time by scoring a career-high 16 points on 4-of-4 shooting from 3-point range. Reed's previous career high was four points.\n\nIn fact, Triano thought Reed should have shot a little more.\n\n\"I thought there was probably two or three more he left on the table,\" Triano said. \"He could have taken them and we're encouraging him to shoot the ball. Shaq (Harrison's) been fantastic for us. He's an energizer defensively. He attacked the basket well.\"\n\nUP NEXT\n\nSuns: Host Cavaliers on Tuesday.\n\nHornets: Visit Pelicans on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993318.307023
}