{
  "game_id": "0022200574",
  "espn_id": "401468729",
  "date": "Jan 04, 2023",
  "matchup": "MIA @ LAL",
  "headline": "Schröder propels Lakers past Heat 112-109 without LeBron, AD",
  "body": "LOS ANGELES -- — Dennis Schröder scored 14 of his season-high 32 points in the fourth quarter and the undermanned Los Angeles Lakers improbably overcame LeBron James’ absence for a 112-109 victory over the Miami Heat on Wednesday night.\n\n\r\n              Russell Westbrook had 21 points, nine assists and eight rebounds for the Lakers, who rallied from a six-point deficit in the fourth quarter and held off Miami without their top three scorers. James stayed home with a cold, while Anthony Davis and Lonnie Walker are injured.\n\n\r\n              Thomas Bryant added 21 points and nine rebounds, while Schröder was brilliant down the stretch. The German point guard scored nine points in the final 2:35, and his 9-for-9 performance at the free throw line in the fourth quarter sealed the Lakers’ fourth victory in five games.\n\n\r\n              “I've got to be more aggressive anyway, even when AD and Bron are coming back, to open up things for AD and Bron,” Schröder said. “Hearing that Bron is sick and AD is out as well, everybody just gave a little bit more.”\n\n\r\n              Schröder rolled his ankle midway through the fourth quarter, and Lakers coach Darvin Ham intended to take him out of the game — but Schröder's teammates said he insisted on staying in.\n\n\r\n              “He didn't want to come out,” Bryant said. “He said, ‘No. Let’s be great.'”\n\n\r\n              Bam Adebayo had 30 points and 13 rebounds, and Jimmy Butler had 27 before missing a 3-pointer at the buzzer for the Heat, who lost for only the fourth time in 12 games.\n\n\r\n              “They were rolling,” said Kyle Lowry, who had 11 points. “They were confident in what they were doing. We were a little bit of a step slow tonight.”\n\n\r\n              One week after beating the Lakers in Miami and two days after rallying to beat the Clippers in Los Angeles, Miami blew a late lead and couldn't catch up to the Lakers' reserves and role players.\n\n\r\n              “It's been extremely disappointing every time we get a little bit of footing on the season, and then we have a disappointing loss,” Miami coach Erik Spoelstra said. “That's what this was tonight, but you have to credit the Lakers. They played with a great motor, with spirit with their guys out. We've had some wins like that as well, where we've had guys out and you can catch a team.”\n\n\r\n              After trailing for much of the first three quarters, Miami appeared to be moving toward a victory before the Lakers made a 14-3 rally and eventually went up 102-96 on Schröder's three consecutive free throws with 2:35 to play.\n\n\r\n              After Adebayo trimmed Los Angeles' lead to one point on a putback basket, Schröder hit two free throws and then drove for a vicious layup with 20.3 seconds left for a 108-104 lead.\n\n\r\n              Adebayo got another putback with 15.4 seconds left, but Austin Reaves found Westbrook with a beautiful inbounds pass for a layup. Westbrook missed a free throw and Max Strus hit a 3-pointer with 4 seconds to play, but Schröder hit two more free throws and Butler missed a tough 3-pointer.\n\n\r\n              “Everybody just banded together and continued to fight, and that’s what we have to be about,\" Ham said. \"That’s what our identity has to be.”\n\n\r\n              TIP-INS\n\n\r\n              Heat: The loss overshadowed a third straight 30-point game for Adebayo, who has hit 61% of his shots and grabbed 34 rebounds in that stretch. ... Dewayne Dedmon, the USC product from Lancaster, California, had two points in his return from a six-game absence with plantar fasciitis in his left foot. ... Tyler Herro had nine points on 4-of-14 shooting in his lowest-scoring game since Dec. 12.\n\n\r\n              Lakers: Walker missed his third straight game, but the team changed his injury designation from a tailbone contusion to left knee soreness. Ham said the soreness is “normal” for a player with Walker's explosiveness and leaping ability. ... Troy Brown Jr. missed the second half with a quadriceps strain. He had two points in 14 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At Phoenix on Friday night.\n\n\r\n              Lakers: Host Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993967.263382
}