{
  "game_id": "0021600857",
  "espn_id": "400900263",
  "date": "Feb 24, 2017",
  "matchup": "MEM @ IND",
  "headline": "Pacers beat Grizzlies 102-92 to end six-game skid",
  "body": "INDIANAPOLIS --  Paul George noticed the noise, even before perhaps the loudest ovation he's received all season during player introductions.\n\nThe Pacers kept him at the trade deadline and fans made it clear that was the result they wanted.\n\n\"It was an emotional moment, to be honest,\" George said. \"Even running out of the tunnel, I couldn't help but have a little smirk from them just being happy and cheering, and, again, (being) really happy for me continuing my career here. I felt that. I felt a little queasy going out, but that's the love -- the reason why I love being here -- that's the love I love here.\"\n\nCJ Miles made five 3-pointers and scored 17 points, George had nine points and nine rebounds, and the Pacers snapped a six-game losing streak with a 102-92 victory over the Memphis Grizzlies on Friday night.\n\nWhether it serves as the foundation for a lengthy winning streak that secures a playoff spot and ultimately sways the franchise's All-Star forward to stay when he becomes a free agent in 2018 remains to be seen.\n\nBut Pacers fans were steadfast in their support of George -- possibly even trying to make sure he knows they want him to sign a contract extension.\n\nThe impact the fans' support had on George was evident. He looked refreshed, and in some cases even more energized than in games past. George, who is often looking toward referees after a no-call, or showing frustration through body language, was hustling on both ends of the floor, sprinting back on defense, and even diving for loose balls, colliding with Grizzlies All-Star center Marc Gasol. He shot just 3 for 12 but the Pacers outscored the Grizzlies 64-42 across the middle two quarters and never relinquished their lead, leading by as many as 27 points in the second half.\n\n\"Just tough shooting, tough rhythm, just trying to work through it. It's a tough stretch for me right now, but I'll get through it,\" George said. \"(The bench) did a great job. Everyone contributed tonight.\"\n\nMonta Ellis finished with 16 points, Myles Turner scored 12, and Lavoy Allen, Jeff Teague and Thaddeus Young each added 10 for the Pacers.\n\nTeague and Allen recorded double-doubles. Teague also finished with 10 assists, and Allen snatched 10 rebounds for Indiana. The Pacers made 23 of their 40 field goals by way of an assist. Indiana shot 51 percent and clinched a winning record at home for the 28th consecutive season, the longest active streak in the NBA.\n\nThe Grizzlies finished the game shooting 41 percent from the floor (35 for 84).\n\nTroy Daniels had 13 points for Memphis and Marc Gasol scored 12. Indiana outrebounded Memphis 50-39.\n\n\"We played like it was a preseason game quite honestly,\" Grizzlies coach David Fizdale said. \"We had some spurts where we played some good basketball. Too many stretches we played it like it didn't matter.\"\n\nTIP-INS:\n\nGrizzlies: The Grizzlies lost to the Pacers for the first time since Nov. 11, 2013, when Indiana beat Memphis 95-79. ... Memphis is 10-12 against the Eastern Conference this season.\n\nPacers: Indiana outrebounded Memphis 50-39. ... George needs 13 points to pass Billy Knight into eighth place on the Pacers' NBA career scoring list. ... Miles passed Mike Dunleavy into seventh place in 3-pointers made (411) in Pacers NBA franchise history. ... The Pacers won at home by 10 or more points for the 13th time this season.\n\nTRYING TO STAY POSITIVE\n\nEach of the Pacers' starters finished with a positive plus-minus. Indiana's starting five had a combined plus-minus of 76. Memphis' starting five finished with a combined plus-minus of minus-57.\n\nAN IMPORTANT WIN\n\nThe Pacers avoided joining a list of teams that won seven straight games then lost seven straight games. Indiana also dodged losing five straight home games. The Pacers haven't lost five straight at home since the 2007-08 season.\n\nUP NEXT\n\nGrizzlies: Travel to Denver on Sunday\n\nPacers: Visit Miami on Saturday",
  "source": "espn_api",
  "crawled_at": 1764995582.466187
}