{
  "game_id": "0021801199",
  "espn_id": "401071872",
  "date": "Apr 07, 2019",
  "matchup": "BKN @ IND",
  "headline": "Nets end playoff drought with 108-96 win over Pacers",
  "body": "INDIANAPOLIS --  The Brooklyn Nets were all business Sunday.\n\nThey started fast. They closed hard. And they refused to let anything, even an old nemesis, block their playoff path.\n\nInstead, the Nets beat Indiana at its own physical game and earned their first playoff berth in four years with a 108-96 victory on the road -- though the muted locker room celebration made it hard to tell if players were more relieved or excited that the drought was over.\n\n\"It means a lot, obviously to exceed expectations for a lot of us in here, to see how far we've come,\" Joe Harris said after scoring 18 of his 19 points in the decisive first half. \"It means a ton. Hopefully, it's a sign of things to come for this organization.\"\n\nFor now, the Nets will settle for the victory signifying how much progress they've made this season.\n\nAfter starting the season 8-18, they fought back to post their first non-losing record in four years and can make it a winning season by beating Miami in Wednesday's regular-season finale.\n\nAll of it came just hours after the Heat opened the door for Brooklyn with an overtime loss at Toronto. Then, perhaps fittingly, they had to snap a nine-game losing streak against the Pacers and a seven-game losing streak in Indianapolis that dated back to March 2015.\n\nThis time, though, the Nets were more physical and more aggressive than Indiana and it showed right from the start. Brooklyn scored the first nine points and forced three turnovers before the Pacers called timeout less than two minutes into the game, and Indiana never recovered as D'Angelo Russell scored 20 points. Caris LeVert added 18.\n\n\"They wanted it more than us, I think that's what it was,\" Myles Turner said. \"They were playing for something and they went out and showed it.\"\n\nThe reeling Pacers, meanwhile, have now lost two straight at home and five of seven overall, locking them into the No. 5 seed in the East. They will begin next week's playoffs in either Boston of Philadelphia.\n\nDomantas Sabonis led Indiana with 17 points and 12 rebounds. Thaddeus Young scored 16 in a game coach Nate McMillan promised to limit the minutes his starters logged.\n\nIndiana only led twice -- on a 3-pointer from Turner and another from Wesley Matthews in the first quarter. But Russell answered the second shot with a 9-footer and the Nets never trailed again.\n\nThey led 31-25 after one, 52-44 at the half and closed the third quarter on a 7-0 run to make it 82-69 as they coasted into the playoffs.\n\n\"There was another level of focus,  another level of being locked in,\" coach Kenny Atkinson said. \"They wanted it so bad, there was an extra energy there in these past few games.\"\n\nTIP-INS\n\nNets: Spencer Dinwiddie and Jarrett Allen each scored 12. Dinwiddie had six assists. Allen had eight rebounds. ... Brooklyn was 11 of 36 on 3s, moving within 16 of breaking the single-season franchise record (1,041), which they set last season. ... The Nets had a 52-33 rebounding advantage including a 17-5 edge in offensive rebounds. ... DeMarre Carroll left midway through the third quarter and headed to the locker room with an undisclosed injury. He did not return to the game.\n\nPacers: Sabonis recorded his 30th double-double of the season. ... Bojan Bogdanovic had 13 points, while Cory Joseph added 12. ... Turner finished with six points, four rebounds and three blocks before leaving with a sore right ankle midway through the third quarter. He did not return but said he would be fine for the playoffs. ... Darren Collison was 2 of 12 from the field and missed all four of his 3-pointers after missing the previous three games with an injured groin. He had four points and six assists.\n\nWHAT'S NEXT?\n\nMcMillan was judicious with how he used his lineups in a game that still had meaning. How does he intend to play it in a game that will have no bearing on playoff seeding?\n\n\"We will try to manage Wednesday's game as best as possible and really take this week to get guys whatever they need to get ready for Boston,\" McMillan said.\n\nUP NEXT\n\nNets: Will celebrate their playoff berth by closing the regular season at home against Miami on Wednesday.\n\nPacers: Can pick up their first season sweep of the Hawks since 2004-05 with a win at Atlanta on Wednesday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995383.905754
}