{
  "game_id": "0022301067",
  "espn_id": "401585695",
  "date": "Mar 29, 2024",
  "matchup": "PHI @ CLE",
  "headline": "Donovan Mitchell returns from injury, Mobley hits late 3-pointers as Cavaliers edge 76ers 117-114",
  "body": "CLEVELAND -- — Donovan Mitchell looked different wearing a protective mask. With the All-Star guard finally back, so did the Cavaliers.\n\n\r\n              Mitchell returned after missing six games with a broken nose and made two free throws with 12.8 seconds left as Cleveland edged the Philadelphia 76ers 117-114 on Friday night before hitting the road for five games.\n\n\r\n              Evan Mobley drained a go-ahead 3-pointer with 28.2 seconds left for the Cavs, who have struggled while waiting for Mitchell to get back and have been sliding in the Eastern Conference standings at the worst possible time.\n\n\r\n              This was a step in the right direction.\n\n\r\n              “We've been injured and hurt, but there’s no excuse at this point,” Mitchell said. “We’ve got to go out there and continue to find ways to win these games and be ready at the right time.”\n\n\r\n              Georges Niang scored 25 points against his former Philly teammates and Mobley had 18 of his 20 in the second half as the Cavs won for just the second time in six games.\n\n\r\n              Darius Garland added 14 points and 12 assists for Cleveland, currently holding the No. 3 seed in the East. With the NCAA women's Final Four in town next week, the Cavs will be on the road with games in Denver, Utah, Phoenix, San Antonio and two in Los Angeles.\n\n\r\n              “Every game’s a playoff game,” said Mitchell, who scored 12 points in his first game since March 16. “That’s what it’s going to be every night.”\n\n\r\n              The back-and-forth game featured 27 lead changes, seven in the fourth quarter.\n\n\r\n              Kyle Lowry had 23 points and Tobias Harris 21 for the Sixers, who are hanging onto a play-in spot as they wait for superstar Joel Embiid to get healthy.\n\n\r\n              After the Sixers took a 113-112 lead when Tyrese Maxey tipped the ball away from Garland and scored on a layup, Mobley, who didn't attempt a shot in the first half, hit a 3-pointer from the corner to put Cleveland up two.\n\n\r\n              The Cavs fouled Mo Bamba underneath, but with a chance to tie it, Philly's big man split his free throws. The Sixers put Mitchell on the line and his two free throws with 12.8 seconds made it 117-114.\n\n\r\n              Philadelphia had one last chance to tie it, but Maxey missed a step-back 3 with 2.1 seconds left and the Sixers couldn't corral the rebound.\n\n\r\n              Maxey finished just 7 of 26 from the floor, including 2 of 12 on 3s.\n\n\r\n              “All we needed was that Mobley 3 to not go in and we’d have had a real good chance,” Sixers coach Nick Nurse said. \"We put a decent effort in there, but I don’t think we played that great.”\n\n\r\n              The Cavs have been aimless without Mitchell, who missed 15 of 20 games since the break with a bruised left knee and the nasal fracture. He looked rusty, and admitted the mask isn't ideal.\n\n\r\n              “It’s trying to be able to breathe,” he said. “But it’s that time, so there’s really nothing I can do about it. So let’s go out there and figure it out. First time with a mask. I threw it out the first workout. We got a new one, so this is the final version.”\n\n\r\n              While Cleveland welcomed back Mitchell, the Sixers are getting closer to having Embiid, who has been out since undergoing surgery to repair meniscus in his knee on Feb. 6. He has missed 28 games.\n\n\r\n              Embiid recently began on-court work and is traveling with the team. Nurse said the 7-footer is “progressing forward” and reiterated the expectation is that he'll be back for the playoffs.\n\n\r\n              Nurse didn't divulge any specifics about what Embiid is able to do at the moment, but added \"he is at the point where he needs a few players out there to work against.”\n\n\r\n              Embiid looks anxious to play. During a timeout in the third quarter, the reigning league MVP, who sat on the bench in street clothes, borrowed the game ball and dribbled while both teams huddled.\n\n\r\n              UP NEXT\n\n\r\n              76ers: At Denver on Sunday, the first of five straight road games.\n\n\r\n              Cavaliers: At Toronto on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996407.616357
}