{
  "game_id": "0021800628",
  "espn_id": "401071304",
  "date": "Jan 11, 2019",
  "matchup": "CHA @ POR",
  "headline": "McCollum helps Trail Blazers rout Hornets 127-96",
  "body": "PORTLAND, Ore. --  Almost everything went right for the Portland Trail Blazers on Friday night.\n\nJusuf Nurkic fell just short of a triple-double while resting for much of the fourth quarter of Portland's 127-96 victory over the Charlotte Hornets.\n\nThe 7-foot Nurkic had 11 points, 11 rebounds and tied career highs with eight assists and six blocks. While star guards CJ McCollum and Damian Lillard stayed on the bench for the final period, coach Terry Stotts left Nurkic in for a couple of minutes.\n\nWhen he remained stuck on eight assists, Nurkic was subbed out.\n\n\"If it's not happening right away I'm not going to chase it,\" he said.\n\nStotts said he didn't want to throw off the second unit too much down the stretch.\n\n\"I told him I'd give him two minutes,\" Stotts joked.\n\nMcCollum had 30 points, including five 3-pointers, and Lillard scored 20 before taking the final period off. Lillard had a career-high four blocked shots and the Blazers finished with a season-high 16, one short of the franchise record.\n\nPortland has now won four straight and six of seven overall. It improved to 17-7 at home, tied for best in the Western Conference.\n\nThe victory also extended the Blazers' winning streak over the Hornets in Portland to 11 straight games. Charlotte hasn't won in Portland since 2008.\n\nKemba Walker had 18 points for the Hornets, who fell to 5-14 on the road this season in the fourth of a five-game trip.\n\n\"We've got to try to not let this thing keep going in the wrong direction,\" Walker said. \"We've got to stick together and as best as we can we've got to stay positive.\"\n\nPortland also got another solid performance from its reserves. Seth Curry's 3-pointer extended Portland's lead to 50-36. Jake Layman's alley-oop dunk from Lillard put the Blazers up 61-42.\n\nPortland's backups have accounted for at least 50 points in six games this season, all Blazers wins. They had 48 points against the Hornets, but got extra work because the starters were rested.\n\nThe Blazers led 70-49 at the break and extended the lead to as many as 35 points in the third quarter.\n\n\"We just didn't compete tonight defensively. Overall we just did not compete,\" Hornets coach James Borrego said. \"Too soft on the ball, too soft on the interior. They did whatever they wanted to us offensively.\"\n\nThe Blazers were without forward Maurice Harkless for the second straight game because of left knee soreness. There was no word on how long he'll be out.\n\nOn a tear lately, Nurkic averaged 21.4 points and 11.4 rebounds over the previous eight games. On Friday he became just the third NBA player with at least 11 points, 11 rebounds, eight assists and six blocks in fewer than 30 minutes.\n\n\"The big fella's been awesome,\" McCollum said. \"He's playing extremely well, he's confident. He's finishing around the basket. But what I like most about him is that he's being aggressive on both ends. Defensively he's protecting the rim for us and being selfish on the offensive end and distributing the ball.\"\n\nHEADING OUT\n\nIt was the last of a five-game homestand for the Blazers, who visit Western Conference-leading Denver on Sunday. The Nuggets beat the Blazers in their first meeting this season.\n\n\"They came here and they got one,\" Lillard said. \"We had a shot at the end of the game to beat them and we didn't feel like we played that well. So we've just got to take this brand of basketball that we've been playing over the last few games and take it to their court and go get another win.\"\n\nTIP-INS\n\nHornets: F Nicolas Batum played in Portland for seven seasons. ... Portland's 70 points at the half were the most for a Hornets opponent this season.\n\nTrail Blazers: McCollum got into the campaign to get Lillard to the All-Star game with a video where he re-creates the final dance scene from the movie \"Napoleon Dynamite.\" The video, released on social media on Thursday, was shown on the scoreboard during the first quarter.\n\nUP NEXT\n\nHornets: Visit Sacramento on Saturday night.\n\nTrail Blazers: Open a two-game trip on Sunday against the Denver Nuggets.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994389.158066
}