{
  "game_id": "0022300694",
  "espn_id": "401585322",
  "date": "Feb 02, 2024",
  "matchup": "ORL @ MIN",
  "headline": "Banchero's 23 points lead Magic in comeback from 17 down to defeat Timberwolves 108-106",
  "body": "MINNEAPOLIS -- — Paolo Banchero had 23 points and six assists to help the Orlando Magic overcome a 17-point second-quarter deficit and beat the Minnesota Timberwolves 108-106 on Friday.\n\n\r\n              Wendell Carter Jr. added 18 points and 12 rebounds, Franz Wagner scored 19 points and Jalen Suggs pitched in 15 points in his hometown for the Magic in their rally motivated by a lopsided loss to the Wolves last month when they fell behind by 30 points.\n\n\r\n              “The past few years we were down a lot and learning how to play from behind and continuing to come back,” Suggs said. “Now we’re figuring out how to close 'em out. Some nights are better than others, but we’re continually learning and you just see the progress that we’re making. We’re having fun doing it.”\n\n\r\n              Rudy Gobert had 22 points and 16 rebounds and Anthony Edwards scored 22 points for the Wolves, whose NBA -leading scoring defense has been hindered at times by an underperforming offense. This was another example of ill-timed turnovers and ill-advised shots, as the Wolves had just 18 points in the fourth quarter.\n\n\r\n              “We struggled to get into our stuff. They did a good job with their physicality, their ball pressure, and we didn’t really do a good job of battling back on that front,” Wolves coach Chris Finch said.\n\n\r\n              Mike Conley missed a runner for the Wolves with 1:40 left, and Jonathan Isaac tipped in a rebound for the Magic with 1:16 to go for a 105-101 lead. Gobert hit two foul shots on the other end and rebounded a miss of Banchero's jumper, but Conley missed the go-ahead 3-point attempt.\n\n\r\n              The Wolves fell back into a tie for first place in the Western Conference at 34-15 with the Oklahoma City Thunder with the defending NBA champion Denver Nuggets and Los Angeles Clippers hot on their heels too.\n\n\r\n              “Hopefully we all look ourselves in the mirror individually and get rid of all that stuff that holds us back as a team. Same thing. Ball gets sticky. We stop doing winning plays,” Gobert said. “Until we care, we’re going to keep losing those type of games.”\n\n\r\n              The Magic, who haven't been to the playoffs in four years or won a series since 2010, are tied for eighth place in the Eastern Conference. They showed some serious mettle after falling behind 43-26, halfway through this six-game road trip. The Wolves sank 16 of their first 21 shots from the floor, and Gobert scored 11 points in the first quarter without missing a shot from the floor or the line.\n\n\r\n              But the Magic clamped down on All-Stars Edwards and Karl-Anthony Towns, and Edwards missed the last 4:20 of the second quarter with an injury to his right leg he hobbled off the court to get treatment for.\n\n\r\n              “They’re celebrating in there because there’s a joy to how they know they need to play to become successful,” Magic coach Jamahl Mosley said. “I think that’s what makes the coaching staff so proud.”\n\n\r\n              Suggs, the fifth overall pick in the 2021 draft after one season at Gonzaga, starred at Minnehaha Academy High School in Minneapolis and grew up across the river in St. Paul. After a slow start — “my muscles were tight, my stomach was in knots,” he said — Suggs hit back-to-back 3-pointers early in the third quarter to tie the game at 64.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Visit Detroit on Sunday.\n\n\r\n              Timberwolves: Host Houston on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996181.9646301
}