{
  "game_id": "0022000630",
  "espn_id": "401307416",
  "date": "Mar 18, 2021",
  "matchup": "CHA @ LAL",
  "headline": "LeBron puts Lakers past Hornets 116-105 for 4th straight win",
  "body": "LOS ANGELES -- — LeBron James had 37 points, eight rebounds and six assists, and the Los Angeles Lakers moved back into second place in the Western Conference on Thursday night with their fourth straight victory, 116-105 over the Charlotte Hornets.\n\n\r\n                    Dennis Schröder had 22 points and seven assists as the defending NBA champions moved past Phoenix and pulled 1 1/2 games behind the league-leading Utah Jazz with their sixth win in eight games.\n\n\r\n                    “We haven't really talked about it,” James said of the conference race. “If it gets to a point where we can capture it, why not? But we haven't talked about seeding all year. We’ve gotten better since the break, but the most important things for our ballclub is playing championship basketball every night and being healthy.”\n\n\r\n                    Indeed, Los Angeles is unbeaten since the All-Star break despite playing without All-NBA big man Anthony Davis since Valentine’s Day.\n\n\r\n                    “It was definitely needed,” Lakers coach Frank Vogel said of the All-Star break. “It was clear our guys sort of hit a wall after the short offseason. That stretch before the break, it was clear our guys were a little bit fatigued. I think Bron set a great tone for us, saying, ‘It’s go time,’ after the All-Star break, and guys have responded with some really good play.”\n\n\r\n                    LaMelo Ball had 26 points and seven assists in the dynamic rookie's Southern California homecoming with the Hornets, who have opened their five-game West Coast trip by losing back-to-back games for the first time since Feb. 5.\n\n\r\n                    “Definitely felt good playing out here,” Ball said while wearing a Dodgers cap in his postgame interview. “It felt good, but not too good because we didn’t get the win. ... The whole team knows we can compete. We all know what we can do. It’s just about putting it together and playing hard.”\n\n\r\n                    Although James didn't quite record his third consecutive triple-double — which would have been the 100th of his career — he commanded the floor throughout the night and eventually sealed the win on a driving layup with 15 seconds to play.\n\n\r\n                    James also enjoyed his first showdown with Ball, who spent time around the Lakers when his older brother, Lonzo, was on the team.\n\n\r\n                    “I think he’s damn good to be his age,\" James said. “His speed, his quickness, his ability to make shots at all facets in the paint, floaters, 3s, and he’s going to only get better. Every game is a learning experience for him. Him and Zo are two just very unique players in our league, and they showcase that every night.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Starting big man Cody Zeller didn't play in the second half, but wasn't injured. ... Ball’s parents haven’t seen him play live during his impressive rookie season, and fans aren’t yet allowed inside Staples Center.\n\n\r\n                    Lakers: Marc Gasol missed his sixth straight game, but was cleared to end his quarantine. He still hasn't cleared all of the NBA's health and safety protocols to return to uniform. Gasol hasn't played since February. ... Davis missed his 13th straight game with a right calf injury. ... Alex Caruso scored five points in his return from the NBA's concussion protocol.\n\n\r\n                    BALL AND GOING HOME\n\n\r\n                    Ball was impressive in his first meeting with the team his famous family loved while he grew up in suburban Chino Hills. Ball won a state title as a freshman and verbally committed to UCLA as a teenager before his father, LaVar, put him on the international odyssey that ended with LaMelo becoming the third overall pick in last year’s draft.\n\n\r\n                    “I thought LaMelo was excited to play tonight,” Hornets coach James Borrego said. “You could feel his excitement early. He wanted to prove he belonged in this league. I liked his fight and his competitive spirit, especially in the second half.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: At Clippers on Saturday.\n\n\r\n                    Lakers: Host Hawks on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997011.985782
}