{
  "game_id": "0022400378",
  "espn_id": "401704944",
  "date": "Dec 21, 2024",
  "matchup": "MEM @ ATL",
  "headline": "Bane and Pippen combine for 45 points, Grizzlies cruise past Hawks 128-112",
  "body": "ATLANTA -- — Desmond Bane scored 23 points and the Memphis Grizzlies, without star player Ja Morant, beat the skidding Atlanta Hawks 128-112 on Saturday night.\n\n\r\n              Scotty Pippen Jr. added 22 points and nine assists. Morant, who injured his back in the Grizzlies' Dec. 19 win over Golden State, was ruled out with low back soreness before Saturday night's game.\n\n\r\n              De'Andre Hunter led Atlanta with 26 points and Jalen Johnson added 13 points and 11 rebounds.\n\n\r\n              The Hawks were also without their own star in Trae Young, who was ruled out before the game with a right heel contusion. After winning its first three games in December, Atlanta has now lost four of its last five games.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis kept up its offensive dominance thanks to seven Grizzlies players who finished with double-digit point totals. Memphis was also hot from behind the arc, shooting 43.9% from long range. \n\n\r\n              Hawks: Hunter continued to be a key contributor from the Atlanta bench, as his 26 points came in 24 minutes of playing time. Atlanta fared well enough offensively without Young, but it wasn't enough to overcome a Grizzlies team that shot 51% from the field.\n\n\r\n              Key moment\r\n              With 30 seconds remaining in the third quarter, Memphis forward Jake LaRavia drilled a pull-up 3-pointer off a fast break, putting the Grizzlies up 100-74 and sending Hawks fans to the exits.\n\n\r\n              Key stat\r\n              Memphis has now won 12 of its last 14 games, and the NBA’s top offensive squad put up another convincing display. The Grizzlies have outscored their last two opponents by a combined 67 points. \n\n\r\n              Up next\r\n              Atlanta hosts the Minnesota Timberwolves and Memphis heads home to host the Los Angeles Clippers on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997736.801774
}