{
  "game_id": "0022000865",
  "espn_id": "401307662",
  "date": "Apr 18, 2021",
  "matchup": "TOR vs. OKC",
  "headline": "Boucher, Raptors hand Thunder 10th straight loss, 112-106",
  "body": "TAMPA, Fla. -- — Chris Boucher had 31 points and 11 rebounds, and the Toronto Raptors extended Oklahoma City's season-worst losing streak to 10 games, beating the Thunder 112-106 on Sunday night.\n\n\r\n                    Gary Trent Jr. added 23 points for Toronto, which has won three straight. Malachi Flynn had 15 points and eight rebounds.\n\n\r\n                    Luguentz Dort led the Thunder with 29 points, 21 of them coming in the first quarter of what shaped up as a duel (with Boucher) of players with Montreal roots.\n\n\r\n                    “It put some pep in my step a little bit. It definitely put some more energy into the game,” Boucher said. “I just want people to realize we have guys from Montreal that are really talented. It was an exciting showcase just to show people what we have.”\n\n\r\n                    “They both probably wanted to put on a show tonight and they both did it,” Toronto coach Nick Nurse said.\n\n\r\n                    Darius Bazley added 16 points and eight rebounds for the Thunder, who have lost 13 of 14 since leading scorer Shai Gilgeous-Alexander was sidelined last month by a right foot injury.\n\n\r\n                    The Raptors did not take the lead for keeps until Boucher's 3-pointer with 2:27 remaining. Trent set up Boucher for another 3-pointer that clinched the victory with 10.4 seconds left.\n\n\r\n                    “We’ve been losing a lot of close games, so it definitely felt good to win this one and know that we can finish games,” Boucher said.\n\n\r\n                    Dort made all seven of his shots in the first quarter, including five 3-pointers, and the Thunder moved ahead by 12 points in the second quarter.\n\n\r\n                    Boucher had 20 points in the first half including a 3-pointer buzzer shot that cut Oklahoma City's advantage to 59-52. The Thunder were 9 of 17 from 3-point range in the opening half.\n\n\r\n                    Toronto's Paul Watson Jr., coming off a career-high 30-point game on Friday night, went scoreless in 22 minutes, missing 10 shots.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: C Aleksej Pokusevski blocked six shots. ... Dort, who scored 42 points at Utah on Tuesday night, was listed as questionable before the game with a hip injury. ... The Thunder went into the game leading the NBA in turnovers (15.7 per game) and committed 22 Sunday night. ... Opponents are averaging 123.7 points during the Thunder's 10-game skid.\n\n\r\n                    Raptors: F OG Anunoby (calf) missed his third game of the last five. ... F Pascal Siakam (shoulder) missed his third of the last six. ... G Fred VanVleet (left hip flexor) has missed eight of the last nine games and G Kyle Lowry (toe) has missed 10 of the last 11. ... F Freddie Gillespie signed a second 10-day contract.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: At Washington on Monday night. \n\n\r\n                    Raptors: Host Brooklyn in Tampa on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996824.031938
}