{
  "game_id": "0021501030",
  "espn_id": "400828917",
  "date": "Mar 19, 2016",
  "matchup": "DET vs. BKN",
  "headline": "Backups lift Pistons to 115-103 win over Nets",
  "body": "AUBURN HILLS, Mich. -- Anthony Tolliver on the perimeter and Aron Baynes around the basket.\nIt's not a duo Detroit usually relies on, but in a tight playoff race, the Pistons can use contributions from everyone.\nTolliver scored all 17 of his points in the second half and Baynes scored 17 of his 21 in the fourth quarter to lift the Pistons to a 115-103 victory over the Brooklyn Nets on Saturday night. The two backups helped Detroit overcome a sluggish defensive performance against a Brooklyn team that was without Brook Lopez.\n\"That's why you don't have just five guys on a team,\" Pistons coach Stan Van Gundy said. \"That's why you've got 15, and we had a lot of guys come through tonight.\"\nThe Pistons trailed by six in the third and were in danger of what would have been a terrible home loss, but they were eventually able to take advantage of Lopez's absence. The Brooklyn big man missed the game with a virus.\nThe Pistons (36-34) are a percentage point behind Chicago (35-33) for the final playoff spot in the Eastern Conference.\nTolliver helped turn the game around after not playing at all in the first half. He made four 3-pointers and matched his season high in scoring. Baynes set a career high thanks to his big fourth quarter.\n\"Aron's awesome. He's a pro,\" Tolliver said. \"A guy who prepares every single day and plays really hard, and he's really unselfish. When he goes on the court, he's thinking about screening for people, he's thinking about getting other people open.\"\nThaddeus Young scored 24 points for the Nets. Brooklyn has lost eight of 10.\nTolliver entered with 4:50 left in the third quarter, and a few seconds later, Brooklyn's Bojan Bogdanovic made a jumper to cap a 13-0 run and give the Nets a 71-65 lead.\nAndre Drummond answered with a dunk for Detroit, and the game was tied at 77 at the end of the third. The Pistons then started the fourth with a 16-4 run, and a 3-pointer by Tolliver put Detroit up 93-81.\n\"Their pick-and-roll action puts a lot of pressure on you defensively to get in and help and get back out to shooters,\" Nets coach Tony Brown said. \"For a stretch there, just burned us making all the right reads on that particular action.\"\nLopez's absence was eventually felt inside. Drummond had 16 points and nine rebounds, and Baynes helped Detroit close the game out in the fourth.\n\"They got into us, made us try to take some difficult shots,\" Young said. \"We got some good looks but Anthony Tolliver and Baynes, they were the X-factors in the game. ... Anthony Tolliver made shots. Baynes came in and he did his job, which was get rebounds and seal guys and score.\"\nWORDS OF CAUTION\nEven after the victory, Van Gundy was miffed at his team's problems on defense.\n\"We got the win tonight, against not a great team that was down on people, but if we're going to make a push at the playoffs, we're going to have to defend,\" he said. \"If we keep defending the way we've been defending, we will not make it.\"\nTIP-INS\nNets: Bogdanovic scored 19 points.\nPistons: Baynes' previous career high was 18 points. ... Detroit had 30 assists and eight turnovers. Kentavious Caldwell-Pope equaled a career high with eight assists. ... Reggie Jackson had 14 points and Tobias Harris added 13. Rookie reserve Stanley Johnson had 10 points and six assists.\nUP NEXT\nNets: Host Charlotte on Tuesday night.\nPistons: Host Milwaukee on Monday night.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994898.531179
}