{
  "game_id": "0022301202",
  "espn_id": "401607491",
  "date": "Dec 04, 2023",
  "matchup": "IND vs. BOS",
  "headline": "Haliburton's triple-double and late 4-point play help Pacers oust Celtics from NBA tourney",
  "body": "INDIANAPOLIS -- — All that Tyrese Haliburton wanted before the season was to get his first taste of playoff basketball.\n\n\r\n              Monday night's NBA In-Season Tournament quarterfinal seemed like the perfect dry run.\n\n\r\n              So the 23-year-old All-Star guard registered the first triple-double of his career, completed a tiebreaking four-point play with 1:33 left and heard the large, raucous crowd chanting \"M-V-P! M-V-P!” near the end of Indiana's 122-112 victory, which ousted league-leading Boston from the tourney.\n\n\r\n              “It means the world to me to represent Indiana and this organization,” Haliburton said after acknowledging he struggled to breathe during the first half. “I don't even know if it was as much about what was at stake, as what they did to us the last time. I think that (51-point loss) left a bad taste in our mouths.\"\n\n\r\n              This was one felt far sweeter even if he needed a halftime assist from an inhaler.\n\n\r\n              Haliburton scored 16 of his 26 points in the second half and finished with 13 assists and 10 rebounds. Myles Turner added 17 points and 10 rebounds, and seven Pacers reached double figures as Indiana remained unbeaten in the tourney. The Pacers were 4-0 in group play. \n\n\r\n              Indiana is the first team to reach the inaugural tourney's semifinal round Thursday in Las Vegas and will face the winner of Tuesday's game between New York and Milwaukee.\n\n\r\n              Boston, meanwhile, heads home despite getting another strong performance from its dynamic duo. \n\n\r\n              Jayson Tatum had 32 points and 12 rebounds, and Jaylen Brown finished with 30 points and nine rebounds for the Celtics. But it wasn't enough to extend a three-game winning streak, with All-Star Kristaps Porzingis missing his fourth straight game because of a strained left calf.\n\n\r\n              Still, the Celtics fought back from an 11-point third-quarter deficit and managed to force seven fourth-quarter ties — before Haliburton's 27-footer drew a foul on Brown and ignited Indiana's decisive 9-0 run.\n\n\r\n              “He played well. The whole team played well,” Boston coach Joe Mazzulla said, referring to Haliburton and the Pacers. “(Brown) did the best he could (defensively).\"\n\n\r\n              For the young Pacers, many of whom including Haliburton have never been to the playoffs, this was a different experience. From the towel-waving crowd's chants of “De-fense!\" to the heavy media presence, single-elimination fate and festive atmosphere, this felt like a postseason game.\n\n\r\n              “I haven't heard it like this here in like three or four years, probably since (Victor) Oladipo was here,\" Turner said. “The energy was just incredible. I think this city really started rallying around this team.”\n\n\r\n              There was a difference between the lines, too.\n\n\r\n              In this season’s first matchup on Nov. 1, Boston blew out Indiana 155-104 — posting the second-highest points total in franchise history.\n\n\r\n              This time, Indiana turned the game in the third quarter, charging back from a 55-48 halftime deficit to tie the score at 71 before pulling out to an 85-74 lead.\n\n\r\n              Boston finally tied the score at 94 on Brown's 3-pointer with 6:07 left. But after the teams traded baskets for 4 1/2 minutes, Haliburton made the crowd roar again with his big basket.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host the loser of the New York-Milwaukee quarterfinal Friday.\n\n\r\n              Pacers: Play in Thursday's tournament semifinals at Las Vegas against the New York-Milwaukee winner Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996206.161694
}