{
  "game_id": "0021801181",
  "espn_id": "401071854",
  "date": "Apr 05, 2019",
  "matchup": "ATL @ ORL",
  "headline": "Magic use huge 1st half to rout Hawks 149-113 in home finale",
  "body": "ORLANDO, Fla. --  It didn't take long to tell which team had something on the line Friday night -- and which team didn't.\n\nThe Orlando Magic used a franchise-record 81 points in the first half to cruise past the Atlanta Hawks 149-113 in their regular-season home finale and take another step toward a playoff berth.\n\n\"Our energy level was sky-high,\" Orlando coach Steve Clifford noted.\n\nThe Magic made 13 of their first 15 shots and took a 29-point lead in the first quarter.\n\n\"We won that game in the first quarter,\" said Evan Fournier, one of three Magic players to score 25 points. \"We came out with so much energy and just kept it going.\"\n\nNikola Vucevic and Terrence Ross also scored 25 points for Orlando, which set a season high for points despite having 19 turnovers. Vucevic added 10 rebounds to compile his 59th double-double of the season, and Fournier shot 11 for 14.\n\nThe Magic's 20th win in 29 games left them at 40-40. With road games remaining at Boston and Charlotte, they are attempting to make the playoffs for the first time in seven years. Orlando entered the night in the eighth and final playoff spot in the Eastern Conference, but leapfrogged idle Brooklyn (39-40) and Detroit (39-40), which lost to Oklahoma City, to sit in sixth place.\n\n\"We know we are right there and it's just about closing it out. We can't stop right now,\" said Ross, who made six 3-pointers. \"It would be a shame to stop playing the way we are right at the end when it matters, so we've got to keep this going.\"\n\nTrae Young led the Hawks with 22 points, seven rebounds and six assists.\n\n\"There obviously is a lot they have invested in this game and they came out and showed it,\" Atlanta coach Lloyd Pierce said. \"We just were never part of it. ...They got out in transition, got the crowd involved. They turned their defense up and everything that could go right for them did, and everything that could go wrong for us did.\"\n\nVucevic scored nine points during a five-minute, 28-2 run that gave Orlando a 33-7 lead with 4:56 left in the first quarter. Aaron Gordon's 3-pointer made it 42-13 before the Hawks scored the final five points of the period.\n\nTwo 3-pointers by Ross during a 13-2 run midway through the second quarter stretched Orlando's lead to 71-33. The Magic shot 66%in the first half and made nine of 16 3-point shots.\n\nTAKING NO CHANCES\n\nClifford explained why he put Vucevic, Fournier and point guard D.J. Augustin back into the game with a 28-point lead with 7:58 left.\n\n\"Do you know how quickly they can score?\" Clifford answered. \"When I was in Houston, we were behind San Antonio by 12 with 1:07 left. (Tracy) McGrady went 14-0. I'm the wrong guy to be talking about that stuff.\n\n\"And when people say, `What if they get hurt?' They can get hurt every day in practice. I don't go for that at all. When you have a chance to win a game at this time of year, I'm not messing with that game.\"\n\nTIP-INS\n\nHawks: G Kevin Huerter sat out due to mid-back pain. ... G Kent Bazemore was out with a left adductor strain. ... The Hawks are 58-58 all-time against Orlando, but lost all four meetings this season by double digits.\n\nMagic: Orlando has won nine straight home games for the first time in more than 10 years. ... The Magic played their 33rd straight game with the same starting lineup.\n\nUP NEXT\n\nHawks: Play at Milwaukee on Sunday night.\n\nMagic: Play at Boston on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995339.63729
}