{
  "game_id": "0022300740",
  "espn_id": "401585368",
  "date": "Feb 08, 2024",
  "matchup": "LAL vs. DEN",
  "headline": "Jamal Murray scores 29 points and Nuggets hold off Lakers in the final minutes for a 114-106 victory",
  "body": "LOS ANGELES -- — Jamal Murray scored 29 points, Michael Porter Jr. added 27 and the Denver Nuggets snapped the Los Angeles Lakers' three-game winning streak with a 114-106 victory Thursday night.\n\n\r\n              Nikola Jokic had 24 points, 13 rebounds and nine assists for the defending NBA champion Nuggets, who opened a three-game road trip with their third straight win and eighth in 10 games.\n\n\r\n              Denver blew a 15-point lead in the second half, but never trailed and eventually finished with a 10-2 run in the building where the Nuggets beat LA twice to sweep the Western Conference finals last May.\n\n\r\n              “Give them credit, they had all the momentum and they were attacking us,” Denver coach Michael Malone said. “What I saw in that stretch was poise on offense and executing. To outscore that team 10-2 in the last few minutes, that means you’re defending at a high level and you’re rebounding.”\n\n\r\n              Three hours before the game, the Lakers unveiled a 19-foot-tall bronze statue of Kobe Bryant outside their downtown arena. The Lakers played Denver in their Black Mamba alternate uniforms, and the evening was filled with Bryant tributes before the crowd began chanting “Kobe! Kobe!” in the final minutes to urge on the current Lakers.\n\n\r\n              Anthony Davis scored 32 points and LeBron James had 25 for the Lakers, whose longest winning streak since the In-Season Tournament ended in their first game back from an encouraging six-game road trip. James added nine rebounds and seven assists, while Austin Reaves had 15 points and 10 assists.\n\n\r\n              “Definitely very frustrating,” said Jaxson Hayes, who had nine points and six rebounds for the Lakers. “A close loss like that, you make a good push there at the end, it’s always frustrating. … All of us know what time of year it is, and all of us know we need to lock in and get some more wins. I feel like there’s a sense of urgency from all of us.”\n\n\r\n              Several hours after the Lakers declined to make any moves at the trade deadline, they ran drastically short on guards. D’Angelo Russell sat out with left knee soreness, and Max Christie started in his place and scored seven points before spraining his right ankle shortly before halftime.\n\n\r\n              “This is our team, what we’re going to have, and once we get guys healthy, we can kind of get back into our groove,” Davis said.\n\n\r\n              Denver led by 15 midway through the third quarter, but Los Angeles eventually tied it with 6:41 to play on Davis’ alley-oop dunk from Skylar Mays.\n\n\r\n              Los Angeles tied it again on Reaves' 3-pointer with 2:18 to play after Hayes' spectacular chase-down block on Peyton Watson, but Murray hit a 3-pointer and an 11-foot floater on the Nuggets' next two possessions before Porter drained a 3-pointer with 1:05 left to seal it.\n\n\r\n              Both of these teams made no major moves at the trade deadline, but the Nuggets have more reason to feel optimistic about their championship-winning core than the up-and-down Lakers.\n\n\r\n              Russell's improved play in recent weeks was a primary factor in the Lakers' decision not to move his tradeable contract at the deadline. But the starting point guard couldn't play after undergoing an unspecified procedure on his sore left knee Wednesday.\n\n\r\n              Lakers general manager Rob Pelinka said he decided to stand pat because he didn't find a deal good enough to risk disruption of his roster's chemistry and potential. Pelinka mentioned the fact he would have been allowed to trade only one first-round pick this month, but he'll have three to move this summer in pursuit of a third superstar.\n\n\r\n              “My job is always to look for ways to upgrade our roster, but you can’t buy a house that’s not for sale,” Pelinka said. “The right move wasn’t there, and it’s a thoughtful and tricky calculus at times. ... We didn’t want to shoot a small bullet now that would only lead to very marginal improvement at the expense of making a much bigger and more impactful movement potentially in June and July. \n\n\r\n              \"We tried everything we could, and the market is the market. There were very, very few sellers.”\n\n\r\n              Former Lakers swingman Kentavious Caldwell-Pope sat out for the Nuggets with right hamstring tightness. Justin Holiday had a rough night in his place, scoring two points in 22 minutes as a starter before fouling out early in the fourth quarter.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Sacramento on Friday.\n\n\r\n              Lakers: Host New Orleans on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995503.411883
}