{
  "game_id": "0021700553",
  "espn_id": "400975299",
  "date": "Jan 02, 2018",
  "matchup": "MEM @ LAC",
  "headline": "Williams leads Clippers past Grizzlies, 113-105",
  "body": "LOS ANGELES --  It's happening with such regularity now, people are just expecting Lou Williams to come off the bench and put up 20-plus points while leading the Los Angeles Clippers to a victory.\n\nWilliams did it again Tuesday night, scoring 33 to send the Clippers to their fourth consecutive win, 113-105 over the Memphis Grizzlies.\n\nThe standout reserve shot 8 of 15 from the field. Continually driving to the basket, he hit all 15 of his free throws.\n\n\"He's obviously a great scorer, but when you draw that many fouls and get to the free throw line that many times, you're almost impossible to guard,\" Memphis interim coach J.B. Bickerstaff said.\n\nWilliams leads NBA reserves in scoring at 21.6 points per game. He scored 40 off the bench in his last game against Charlotte. He has scored at least 30 off the bench eight times this season, tied for the second-most in NBA history. Ricky Pierce (1989-90) holds the record with 17.\n\nWilliams got scoring help Tuesday from Blake Griffin, who had 21 points -- including five down the stretch after the Grizzlies had erased most of an 11-point deficit in the fourth quarter to close to 103-101.\n\nTyreke Evans led Memphis with 18 points, six assists and five rebounds. Mario Chalmers had 15 points off the bench.\n\nWilliams and Griffin, however, proved too much for the Grizzlies in the final moments.\n\nRookie guard C.J. Williams, starting for an injured Austin Rivers, added a career-high 18 points for the Clippers in his 10th career start.\n\n\"When I think about it, it's just basketball,\" C.J. Williams said. \"There are so many other things that can engulf your mind outside of basketball. But I'm playing the sport I've played for 20 years now. I just enjoy every moment of it.\"\n\nTIP-INS\n\nGrizzlies: G Wayne Selden Jr. returned Sunday after missing 33 games with a right quadriceps injury. He played 18 minutes against Sacramento, scoring 10 points. Bickerstaff said Selden's minutes would continue to be watched closely until his conditioning improves. \"He's a versatile player. He can be really good defensively. He's athletic, he's strong. And then offensively he has a knack to make plays. From that wing position, he gives us an added dimension to be able to play some pick-and-roll and attack and share with his teammates,\" Bickerstaff said. Selden scored 13 points in 14 minutes Tuesday.\n\nClippers: Los Angeles had expected Rivers to return from his sore Achilles tendon against Memphis, but coach Doc Rivers said his son had not improved enough to play and it was uncertain how close he was. \"I don't know. We thought he was, but the fact that he's not playing says probably not,\" Doc Rivers said. \"He had some discomfort, so they're going to re-evaluate his foot again and send him to another doctor.\"\n\nPLAYOFF HOPES\n\nDespite playing without two starters (Patrick Beverley, Danilo Gallinari) and missing Griffin for 14 games due to a knee injury, the Clippers are 17-19 and one game back of eighth place in the Western Conference for the final playoff spot.\n\n\"We always expected ourselves to be in the mix,\" Lou Williams said. \"Obviously, the makeup of this team has changed over the course of these past couple of months with injuries. We all felt we were a talented team, a playoff team, and so far we've kind of put ourselves back in that position.\"\n\nHANDS OFF\n\nWhat makes Lou Williams so difficult to defend? \"He just knows how to create fouls,\" Chalmers said. \"We have to figure out how to guard him when we can't touch him.\"\n\nUP NEXT\n\nGrizzlies: Return home Friday to face Washington.\n\nClippers: Play the middle game of their five-game homestand Thursday against Oklahoma City.\n\n---\n\nMore NBA basketball: https://apnews.com/tags/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992765.830367
}