{
  "game_id": "0021701024",
  "espn_id": "400975770",
  "date": "Mar 15, 2018",
  "matchup": "MEM vs. CHI",
  "headline": "Bulls hand Grizzlies 19th straight loss on Blakeney's FTs",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies fought, rallied and were on the verge of snapping their losing streak, only to have an ill-advised foul lead to two successful free throws and another defeat.\n\nChicago rookie Antonio Blakeney converted two of the three attempts with 1.8 seconds left Thursday night, allowing the Bulls to escape with a 111-110 victory -- Memphis' 19th straight loss. Blakeney got to the line after Grizzlies guard Tyreke Evans fouled him near the top of the key with Memphis leading 110-109 with 1.8 seconds remaining.\n\n\"I got the ball with about 5 seconds left. I knew I was just going to make a play, an aggressive play,\" said Blakeney, who finished with 10 points. \"I (saw Evans) backing up a little bit, so I rose up and shot it.\"\n\nThe rookie from LSU made the first and the third free throws, providing the final margin.\n\nOn the game's final play, Memphis got the ball to Marc Gasol for a baseline fadeaway that was long. JaMychal Green tipped it in but after the horn, although it appeared to be basket interference anyway.\n\nIt was a game between two teams looking at the bottom of the standings. Both Chicago and Memphis are more interested in improving their chances of a top pick in this summer's draft than wins at this point.\n\nBut for Memphis, the misery is particularly frustrating. The Grizzlies have not won since defeating Phoenix on Jan. 29 and continue to hold the worst record in the NBA at 18-50.\n\nMemphis played its starters in the fourth, while Chicago was content to rely on its reserves. Despite erasing a seven-point deficit near the middle of the fourth, the Grizzlies simply couldn't make the final play to end the losing streak.\n\n\"We played hard. Both teams played hard,\" Evans said. \"We knocked down some shots, but at the end, I made a (stupid) foul, and that's on me.\"\n\nZach LaVine led the Bulls with 20 points while playing only three quarters, while Bobby Portis scored 17. Denzel Valentine had 15 points, going 5 of 7 from outside the arc.\n\nEvans had 25 points and nine assists for Memphis, while Gasol added 21 points and 10 rebounds. Jarell Martin scored 16 points and Green finished with 15 points and 10 rebounds.\n\n\"It's just another one,\" Gasol said of the loss. \"But I thought we did a better job. We looked more like a team. At least we were more consistent.\"\n\nTIP-INS\n\nBulls: Rookie F Lauri Markkanen missed his second straight game with lower back spasms. ... The Bulls' first basket was a 3-pointer from Robin Lopez, his fourth of the season. ... The Bulls have allowed 22 of their past 23 opponents to reach 100 points. The other scored 99. ... Have double-digit steals in six straight games. ... The Bulls had 63 bench points, a season high for Chicago, and the seventh straight game where Bulls' bench outscored the opponent's reserves.\n\nGrizzlies: Dillon Brooks, who scored his career-high 29 points against Chicago on March 7, finished with 15 points. ... Are now 0-9 against the Central Division. ... The loss tied the second-longest losing streak in franchise history. The longest was 23 games from Feb. 16-April 2, 1996, when the team was in Vancouver.\n\nWHAT ABOUT `TANKING'?\n\nThe Bulls played their reserves the bulk of the fourth quarter as LaVine and David Nwaba sat during the period along with Lopez, who played the first quarter and took the rest of the night off -- a pattern Chicago has followed with Lopez in recent games. Asked about whether he hears the talk of \"tanking\" and Bulls fans possibly frowning on a win, Blakeney replied: \"I don't pay attention to any of that. All I can worry about is going out there every day and playing hard and trying to play to win.\"\n\nEVANS RETURNS\n\nEvans returned after missing 10 games with a rib injury. He played almost 33 minutes. \"I (felt) pretty good,\" he said. \"My legs are a little heavy, but I was good.\"\n\nUP NEXT\n\nBulls: Host the Cleveland Cavaliers on Saturday.\n\nGrizzlies: Finish a three-game homestand on Saturday against Denver.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992724.116628
}