{
  "game_id": "0021800709",
  "espn_id": "401071382",
  "date": "Jan 23, 2019",
  "matchup": "MIA vs. LAC",
  "headline": "Clippers control second half, top Heat 111-99",
  "body": "MIAMI --  The Los Angeles Clippers know that little was expected of them this season.\n\nThey're still fighting to prove doubters wrong.\n\nTobias Harris scored 22 of his 31 points in the first half, and the Clippers clamped down on defense after intermission to beat the Miami Heat 111-99 on Wednesday night.\n\n\"We embrace it as a group,\" said Clippers coach Doc Rivers, whose team is eighth in the loaded Western Conference even after a recent slide. \"We heard all the talk. We're pretty good. We have a lot of good players. We don't have a superstar, though Tobias is slowly trying to change the narrative on that. But we have a lot of good guys that can play the game, and what we have most is team toughness.\"\n\nMontrezl Harrell scored 14 of his 16 points in the fourth quarter for the Clippers, who outscored Miami 44-26 in the first 20 minutes of the second half. Lou Williams added 13 points and Avery Bradley scored 12, while Harris had seven rebounds and six assists for the Clippers.\n\n\"Right from the beginning I liked our energy and I liked our pace,\" Harris said.\n\nHassan Whiteside finished with 22 points and 16 rebounds for Miami. Josh Richardson scored 17 points, Tyler Johnson added 15 and Dwyane Wade scored 13 for the Heat.\n\nThe Heat lost by 12 -- the exact margin in which they were outscored in second-chance points, 21-9.\n\n\"We had breakdown after breakdown defensively,\" Heat coach Erik Spoelstra said of the fourth quarter. \"You have to give them credit. They made the necessary plays and we paid the price.\"\n\nWade has scored at least 13 points by halftime four times this season -- twice against the Clippers. But he went scoreless after the break, and the rest of his teammates didn't exactly fare much better in the final two quarters.\n\n\"Our offense wasn't good in the second half,\" Wade said. \"I felt like, defensive-wise, we were doing solid defensively. But offensively, we couldn't muster up enough points. You need defense and you need offense.\"\n\nThe teams were tied at 54 at the half, both shooting exactly 50 percent and pinballing their way through six lead changes and seven ties.\n\nThe first time the Clippers had more than a one-possession lead was midway through the third, when a short jumper by Shai Gilgeous-Alexander put them up by five. Los Angeles held Miami to 18 points in the third, and opened up a 98-80 lead with 4:30 left -- the cue for most fans to head to the exits.\n\nTIP-INS\n\nClippers: The Clippers are 4-1 in their last five trips to Miami. ... Danilo Gallinari (back) missed his third consecutive game. ... Mike Fratello worked the Clippers' broadcast alongside legendary play-by-play man Ralph Lawler. Fratello, now a broadcaster with the Brooklyn Nets, started his TV career with the Clippers in 1990. Lawler is retiring at the end of this, his 40th season with the club.\n\nHeat: James Johnson was dealing with a migraine during the day, but started for Miami. ... Wade exchanged jerseys postgame with Jason Williams, the point guard on the 2006 Miami championship team. Wade got a Sacramento No. 55 jersey from Williams. He also got a bottle of wine from Fratello. ... Whiteside went 1 for 2 on a trip to the line in the third quarter, ending a streak of 14 straight missed free throws by the Heat center.\n\nSPOELSTRA PASSES RILEY\n\nThe game was the 850th as Miami's coach for Spoelstra, one more than Pat Riley had during his tenure on the Heat sideline. Spoelstra is the 13th coach in NBA history to have at least 850 games with one team; the most recent entrant into that club was Rick Carlisle, who coached his 850th game with Dallas on Monday in Milwaukee.\n\nRIVERS PAYS TRIBUTE\n\nRivers played his college ball at Marquette, which is why he has insisted for years that Wade is the second-best player in school history -- a half-serious claim that he's offered many times and repeated Wednesday. \"As good as he's been as a player, he sets a great example of how to conduct yourself off the floor,\" Rivers said. Wade and Rivers had a long postgame embrace.\n\nUP NEXT\n\nClippers: Visit Chicago on Friday. The Clippers have won five consecutive meetings with the Bulls.\n\nHeat: Visit Cleveland on Friday. Miami is 2-0 against the Cavs this season, winning by 24 and 25 points.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995239.100328
}