{
  "game_id": "0021900286",
  "espn_id": "401160928",
  "date": "Dec 01, 2019",
  "matchup": "MEM @ MIN",
  "headline": "Brooks scores 26; short-handed Grizzlies beat Wolves 115-107",
  "body": "MINNEAPOLIS --  Playing without star rookie Ja Morant and veteran center Jonas Jonas Valanciunas, the remodeled Memphis Grizzlies knew Sunday’s look would be experimental for a collection of young players.\n\nThe makeshift lineups produced the needed energy to pull out a win on the road.\n\nDillon Brooks scored 26 points and Grayson Allen added 13 to push the short-handed Grizzlies to a 115-107 road win against the Minnesota Timberwolves on Sunday.\n\n“I hit the guys before the game with a simple message,” Memphis coach Taylor Jenkins said. “I said we’re going to have some funky lineups out there. I just need guys going out and just competing. That’s what we’re all about. That’s what we need to get back to. And I’m super proud of them.”\n\nJae Crowder had 12 points and 10 rebounds and Bruno Caboclo finished with 12 points and 13 rebounds for the Grizzlies, who were missing Morant because of back spasms and Valanciunas because of an illness.\n\nBrooks scored 20 of his points in the second half as the Grizzlies countered each Minnesota run to snap a six-game losing streak.\n\n“We just found a way, figured it out,” Brooks said. “It started with our defense and then we translated it into our offense.”\n\nKarl-Anthony Towns had 21 points and 12 rebounds for the Timberwolves. Andrew Wiggins chipped in with 18 points but Minnesota suffered a letdown at home after back-to-back road wins.\n\n“Very disappointing,” Wolves coach Ryan Saunders said. “You don't want to say it's games you should win, but we're getting guys back, I felt good going into this afternoon. Credit to Memphis, credit to Taylor, credit to that team. They played really hard, they executed, they were good. We lacked energy, big time.”\n\nA sloppy start by both teams followed the afternoon tip-off. They combined to shoot 35% in the first half with 15 total turnovers.\n\nNeither team led by more than five points and Memphis went into half with a 48-47 lead after Minnesota’s Robert Covington hit a buzzer-beating jumper after stealing an inbounds pass from Bruno Caboclo.\n\nThe final minute included a 3-pointer by Josh Okogie that hit the side of the backboard, a missed layup by Grizzlies guard De’Anthony Melton and Okogie getting fouled at halfcourt while off-balance.\n\n“We got to get back to the drawing board tomorrow,” Towns said. “They’re a good team, but we came in with a lot of momentum, we’re home, we had three days off, we shouldn’t have played with the energy that we had.”\n\nThe Wolves appeared ready to shake their lackluster start in the second half when they as Towns scored the team’s first nine points and Minnesota tied the game at 61-all. Memphis followed with an 8-0 run.\n\nThe Wolves had a 12-0 run to take a 72-69 lead before a 10-0 run by the Grizzlies. Memphis finished the third quarter with a 15-3 run in which Minnesota went without a field goal.\n\nTAKING OUT TOWNS\n\nTowns finished with his ninth straight double-double, but his shot was off. He scored just four points in the first half and finished the game 1 of 10 from 3.\n\n“We just made his life hell,” Brooks said. “We pressured the heck out of him. We didn’t want him to get into his spots.”\n\nWELCOME HOME\n\nThe Wolves welcomed back Memphis point guard Tyus Jones with a first-quarter video. A Minnesota native, Jones played four seasons for the Wolves. Jones said he was going to have about 75 family and friends in attendance. He had 12 points and seven assists,.\n\n“I’ve always appreciated the support that I’ve received from everyone in Minnesota,” Jones said. “It’s been nothing but love from the fans. We always support ours. That’s something that makes Minnesota special.”\n\nTIP-INS\n\nGrizzlies: Morant missed the game with an aggravation of back spasms. The team announced that he is considered week to week with the injury. The No. 2 overall draft pick out of Murray State leads all rookies with 18.6 points per game. … Kyle Anderson (right heel soreness) was out. Brandon Clarke (left hip soreness) started after being labeled questionable but didn’t play in the second half. … Memphis got 53 points from its bench. … The Grizzlies are 5-0 when Brooks scores 20 or more points.\n\nTimberwolves: Backup PG Shabazz Napier made his return after missing 12 games with a right hamstring strain. F Jake Layman missed his fifth straight game with a left toe sprain. … Wiggins was 1 of 6 from 3-point territory, tying Anthony Peeler for the most 3s in franchise history.\n\nUP NEXT\n\nGrizzlies: Finish a back-to-back set Monday at home against Indiana.\n\nTimberwolves: Travel to Dallas to play Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995747.4523141
}