{
  "game_id": "0022200885",
  "espn_id": "401469040",
  "date": "Feb 16, 2023",
  "matchup": "LAC @ PHX",
  "headline": "All-Star George, Mann lead Clippers past Suns 116-107",
  "body": "PHOENIX -- — Paul George and Terance Mann each scored 26 points and the Los Angeles Clippers beat the Phoenix Suns 116-107 on Thursday night in the final NBA game before the All-Star break.\n\n\r\n              Kawhi Leonard added 16 points, all in the second half, and nine rebounds. Ivica Zubac and Eric Gordon each scored 13 points and Zubac had 12 rebounds.\n\n\r\n              The Clippers go into the break with wins in their last two games as they adjust to a new lineup rotation. Recent acquisitions Gordon, Bones Hyland and Mason Plumlee all played important roles in the victory. They combined for 30 points and 10 rebounds and were a collective 11 for 11 from the foul line.\n\n\r\n              “The new guys came in and just plugged right in as if we started the season,\" George said. “We played great team basketball. We shared it and got stops as we needed to.\n\n\r\n              “We got everything we need. We just have to bring that all together and find an identity that can carry us.”\n\n\r\n              Leonard missed all eight of his shots in the first half but was 5 of 10 after that and made all six of his free-throw tries.\n\n\r\n              “I just made shots,” Leonard said abut the difference. “You just gotta keep pushing.”\n\n\r\n              The Suns missed nine of their first 10 3-point attempts, with only Josh Okogie warming up later in the game. Okogie led Phoenix with 24 points. He was 6 of 12 from behind the arc, but the rest of the Suns made five combined.\n\n\r\n              “It feels good without having to look over your shoulder when you mess up,” said Okogie, whose recent performances have put him in the running to join Chris Paul, Devin Booker, Kevin Durant and Deandre Ayton in Phoenix's starting lineup when Durant returns from a knee injury.\n\n\r\n              “Coach (Monty Williams) told me, ‘I don’t care if you miss eight in a row. I won't take you out for missing but I will take you out for not shooting.'”\n\n\r\n              Booker had 19 points and nine assists for Phoenix. Ayton scored 18 points and newcomer Terrance Ross had 16 points. Booker was 1 of 6 from 3-point range, but tied Steve Nash's franchise record with 1,051 3s.\n\n\r\n              Paul had 11 assists, two nights after having a season-high 19 against Sacramento.\n\n\r\n              The Clippers have scored 100 or more points in 20 of their last 21 games.\n\n\r\n              The loss was the Suns' first against a Pacific Division opponent in 10 games, and the Clippers moved ahead of Phoenix into second place going into the All-Star break.\n\n\r\n              TURNOVER\n\n\r\n              The Suns won the first two meetings between the teams, both in Los Angeles, but the squads have undergone major changes since then.\n\n\r\n              The Clippers' new threesome made their presence known Thursday night, while the Suns expect Kevin Durant to play soon. He was acquired with T.J. Warren from Brooklyn for Mikal Bridges, Cam Johnson and Jae Crowder plus four first-round picks.\n\n\r\n              Clippers coach Tyronn Lue said the Suns’ trio of Durant, Booker and Paul reminds him of going against Durant, Steph Curry and Klay Thompson when Lue was coaching Cleveland in the NBA Finals. \n\n\r\n              “I don’t want to think about it,” Lue said about the Suns adding Durant to their rotation. “It’s a tough coverage, tough matchup. I’m interested to see how they play, how they share the basketball. But on paper it looks really good.”\n\n\r\n              NEW GUY\n\n\r\n              Ross joined the Suns for the game and made a quick impact, scoring a team-high seven points in the first quarter. Ross, a 6-foot-6 guard/small forward, was waived by Orlando as his contract was expiring after this season.\n\n\r\n              Ross, in his 11th NBA season, was averaging eight points in 22 minutes per game for the Magic.\n\n\r\n              TRAINER’S ROOM\n\n\r\n              Los Angeles played without Norman Powell, who was resting his ailing right knee. “No bigger concerns,” Lue said of Powell resting the Clippers’ last game before the All-Star break. Phoenix remains without Durant (knee), Landry Shamet (foot) and Cameron Payne (foot).\n\n\r\n              NEXT\n\n\r\n              Clippers: Host Sacramento on Feb. 24.\n\n\r\n              Suns: Host Oklahoma City on Feb. 24.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994962.511752
}