{
  "game_id": "401809957",
  "espn_id": "401809957",
  "date": "Oct 25, 2025",
  "matchup": "PHI vs CHA",
  "headline": "Quentin Grimes' clutch 3-pointer lifts 76ers to 125-121 win over Hornets in home opener",
  "body": "PHILADELPHIA -- — Quentin Grimes snapped a tie with a 3-pointer with 14 seconds left and scored 24 points, and Tyrese Maxey scored 28 to lead the Philadelphia 76ers to a 125-121 win over the Charlotte Hornets on Saturday night.\n\n\r\n              Joel Embiid scored 20 points with only two rebounds for the Sixers in their home opener. VJ Edgecombe had 15 points for the Sixers after the 2025 No. 3 overall pick scored 34 in the opener against Boston, the third-most points for an NBA player in his first game.\n\n\r\n              The Hornets lost Brandon Miller in the first half to left shoulder soreness. Miller grabbed his shoulder in pain and ran to the locker room after he was hurt on a play in the second quarter. He scored four points in nine minutes.\n\n\r\n              LaMelo Ball led the Hornets with 27 points and Collin Sexton had 21.\n\n\r\n              The Hornets led by 10 points at the end of the third quarter and blew the lead even with Embiid out of the game in the final frame. Embiid is on a minutes restriction as he returns from knee surgery and used up his 20 allotted minutes by the end of the third quarter.\n\n\r\n              Embiid scored four points on 1-of-9 shooting against Boston and did not play the final 9-plus minutes as Maxey and Edgecombe led them to victory. The 2023 NBA MVP and a two-time league scoring champion, Embiid was limited to 19 games last season because of a sprained left foot, a sinus fracture and arthroscopic surgery on his left knee.\n\n\r\n              Against the Hornets, Embiid hit three 3s and scored 16 points in the first half and showed — while his return to true All-Star form may take time — he's still going to be the difference-maker for a Sixers team that has never been close to as good without him as they are with the 7-footer.\n\n\r\n              Up next\r\n              Hornets play Sunday at Washington.\n\n\r\n              76ers host Orlando on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042500.140919
}