{
  "game_id": "0022300303",
  "espn_id": "401584931",
  "date": "Dec 11, 2023",
  "matchup": "BKN @ SAC",
  "headline": "Kings set franchise record for 3s with 25 and beat Nets 131-118",
  "body": "SACRAMENTO, Calif. -- — DeAaron Fox had 28 points and nine assists, and the Sacramento Kings set a franchise record for 3-pointers with 25 in a 131-118 victory over the Brooklyn Nets on Monday night.\n\n\r\n              Domantas Sabonis added 15 points, 16 rebounds and nine assists for the Kings, who have won three straight against the Nets including a season sweep last year. Keegan Murray scored 24 and Malik Monk had 21 points and nine assists.\n\n\r\n              It was the second time this season the Kings had three players with seven assists or more. They set a team season high with 38 assists overall.\n\n\r\n              “We’re a team that can shoot the basketball, and it was evident tonight,” coach Mike Brown said. “To see us get corner 3s and be able to knock them down was very gratifying because these guys can flat-out shoot and they’re going to share the basketball.”\n\n\r\n              Sacramento shot 25 of 45 from 3-point range (55.6%), breaking the previous Kings record of 23. Fox and Trey Lyles led the sharp shooting from beyond the arc with five 3s apiece.\n\n\r\n              “A lot like last year — that’s exactly what it feels like,” said Monk, who had four 3s. “Best offense in the NBA.”\n\n\r\n              Mikal Bridges led the Nets with 22 points, five assists and five rebounds. Brooklyn was one of the hottest teams in the East going into the night with six wins in its previous seven games.\n\n\r\n              “Their ability to kind of climb into us, their aggressiveness on the basketball, away from the basketball, plugging gaps, making our angles tough to read was really good,” Nets coach Jacque Vaughn said. “You saw that in the first half with some of the turnovers and deflected balls.”\n\n\r\n              The Kings led comfortably most of the way before the Nets pulled to 110-104 with six minutes left. Harrison Barnes responded with his third 3-pointer of the game and Sacramento pulled away.\n\n\r\n              Coming off a 23-point fourth quarter against the Suns last Friday, Fox gave the Kings a quick spark with a corner 3 in the first quarter. The ball bounced off the rim multiple times before falling in as Fox hopped up and down with each bounce.\n\n\r\n              Sacramento limited Brooklyn to 18 points in the first quarter and led by eight.\n\n\r\n              After trailing by double digits early in the second, the Nets got within 71-67 on Cameron Thomas' 3-pointer midway through the third.\n\n\r\n              Sacramento took control after that and led 89-74 following Monk’s thunderous one-handed dunk and Murray’s 3-pointer. Monk later fed Lyles with a lob pass that Lyles dunked to make it 107-90.\n\n\r\n              “A lot of good ball movement,” Murray said. “We shared the ball really well. That led to a lot of open looks.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: Face the Suns in Phoenix on Wednesday.\n\n\r\n              Kings: Play the Clippers in Los Angeles on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996363.073385
}