{
  "game_id": "0022000717",
  "espn_id": "401307506",
  "date": "Mar 29, 2021",
  "matchup": "MIL @ LAC",
  "headline": "Clippers hit 19 3s, beat Bucks 129-105 for 6th win in a row",
  "body": "LOS ANGELES -- — Marcus Morris scored 25 points and three other starters had at least 20 points, helping the Los Angeles Clippers beat the Milwaukee Bucks 129-105 on Monday night for their sixth straight victory.\n\n\r\n                    Kawhi Leonard added 23 points and nine rebounds, Luke Kennard had a season-high 21 points and Reggie Jackson added 20 points.\n\n\r\n                    The Clippers made 19 3-pointers, one off their season high. They hit eight in the fourth, when they stretched a 13-point lead to 24 points. Kennard, starting in place of injured Paul George, made four 3s in a row while the Bucks managed just two points during a stretch midway through the quarter. Kennard finished with five 3s, tying his season high, and Jackson had four.\n\n\r\n                    Los Angeles owned a 25-6 edge in second-chance points and outrebounded the Bucks, 46-32.\n\n\r\n                    “They shot it at a really high clip. Just didn’t think we guarded very well, particularly late. Just too much penetration,\" Bucks coach Mike Budenholzer said. “They did a good job of getting inside of us. They were creating a lot of good looks. We got to be better defensively.”\n\n\r\n                    George was a late scratch because of right foot soreness.\n\n\r\n                    “Everything we’ve been working on and frustrated by earlier in the season, you can see it coming together,” Clippers coach Tyronn Lue said. “We have a defensive mindset every single night.”\n\n\r\n                    Giannis Antetokounmpo led the Bucks with 32 points, making 10 of 12 free throws, and Jrue Holiday added 24 points in the opener of a six-game trip, their longest of the second half. \n\n\r\n                    The Bucks came in tied for first in the NBA in scoring with an average of 119.3 points.\n\n\r\n                    “We held them to 105, that’s just a great defensive effort right there,” Leonard said. “We’re just paying more attention to detail. We’re just playing hard from the first quarter to the fourth quarter.”\n\n\r\n                    Morris opened the fourth with a 3-pointer that extended the Clippers' lead to 13 points. Milwaukee got to 105-98 on a basket by Antetokounmpo. But the Bucks were limited to 19 points in the period after being held to 17 in the second.\n\n\r\n                    After Leonard missed a jumper, the Clippers got the offensive rebound and Kennard converted a 3-pointer to launch his personal run. \n\n\r\n                    “It took a lot of pressure off Kawhi because they were sending guys at him, trying to double him and Luke stepped up,” Lue said of his decision to start Kennard for the first time since early February.\n\n\r\n                    Los Angeles pulled away to a 12-point lead in the third, when the Clippers made six 3-pointers, including four in a row. Jackson had 15 points, hitting three 3-pointers and scoring six straight points in another stretch to send the Clippers into the fourth leading 96-86.\n\n\r\n                    The Clippers led 57-55 at halftime. \n\n\r\n                    The Bucks shot 68% in first quarter and closed with an 18-3 run that gave them their largest lead of the game, 38-26. \n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Their four-game winning streak against LA ended. ... P.J. Tucker (left calf strain) missed his third straight game after appearing in his first three for his new team. ... Bobby Portis (health and safety protocols) didn't make the trip. \n\n\r\n                    Clippers: George missed his 12th game of the season. ... Serge Ibaka (lower back tightness) sat out his eighth in a row. ... Rajon Rondo (right adductor soreness) has yet to play since being acquired last week. ... Team owner Steve Ballmer watched with his legs stretched over the seat in front of him in the stands with three companions. He's spent most of the season sitting alone in a seat on the baseline.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Stay in Los Angeles to play the Lakers on Wednesday.\n\n\r\n                    Clippers: Host Orlando on Tuesday in the second game of a back-to-back. They are 8-0 in such games.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997384.470119
}