{
  "game_id": "0022200199",
  "espn_id": "401468354",
  "date": "Nov 14, 2022",
  "matchup": "TOR @ DET",
  "headline": "Blanton, Boucher lead short-handed Raptors past Pistons",
  "body": "DETROIT -- — Dalano Banton scored a career-high 27 points and Chris Boucher added 20 as the short-handed Toronto Raptors snapped a three-game losing streak with a 115-111 win over the Detroit Pistons on Monday night.\n\n\r\n              “I got a lot of reps in the summer, playing for Team Canada and in the summer league, and I did a lot of training with our development team,” said Banton, whose previous career high was 14 points, on Saturday against the Indiana Pacers. “The coaches trusted me enough to put me in the starting lineup, and Coach Nurse told me I should make the most of it.”\n\n\r\n              O.G. Anunoby added 19 points and seven rebounds for Toronto, which played without Fred VanVleet (non-COVID illness), Pascal Siakam (abdominal strain) and Gary Trent (hip).\n\n\r\n              “I think everybody contributed tonight and that's what it takes when you are playing so many different guys,” Raptors coach Nick Nurse said.\n\n\r\n              The Raptors snapped a six-game losing streak to the Pistons, beating Detroit for the fourth time in 13 meetings since Dwane Casey was fired by Toronto and moved across the border to lead Detroit.\n\n\r\n              “We don't believe in any curse,” Boucher said.\n\n\r\n              Rookie Jaden Ivey scored 21 for Detroit, which lost its fourth straight. Bojan Bogdanovic added 18 points.\n\n\r\n              Detroit trailed by as many as 14 point before Hamadou Diallo hit two free throws with 7:37 remaining to cut the deficit to 94-93. Banton hit a 3-pointer that put the Raptors up six with 4:54 remaining before Isaiah Livers' 3-pointer made it 103-100.\n\n\r\n              But, the Pistons committed a key turnover — their 19th of the game — and missed their 12th free throw, slowing their rally.\n\n\r\n              “It wasn't just that stretch, it was the whole game,” Casey said. “We were attacking the rim and getting to the free throw line, but we have to convert when we get there.”\n\n\r\n              Casey juggled his lineup, going with two bigs in Isaiah Stewart and Marvin Bagley III, and using Saddiq Bey as a scorer off the bench. Stewart, though, played only 13 minutes before leaving with a sprained right foot.\n\n\r\n              “Saddiq did a good job — we're just looking for more balance for our two units,” Casey said. “I know you are all old enough to remember Manu Ginobili, he had a great career off the bench.”\n\n\r\n              The Raptors led 58-51 at halftime, thanks to 14 points from Banton and 13 from Boucher. Toronto then scored the first seven points of the third quarter. They led 88-77 going into the fourth quarter, aided by 10 missed free throws from the Pistons.\n\n\r\n              TIP INS\n\n\r\n              Raptors: Toronto won despite shooting 29.6% on 3-pointers and committing 17 turnovers that led to 24 points by Detroit. ... Otto Porter Jr. missed the second half after a first-half toe injury.\n\n\r\n              Pistons: Detroit's reserves went 13 for 19 (68.4%) from the line and hit 4 of 13 3-pointers. ... Casey said they would know more about Stewart's injury on Tuesday.\n\n\r\n              HONORING THE SAINT\n\n\r\n              The Pistons debuted their green jerseys designed to pay tribute to the mats on the walls of the gym at St. Cecilia's Church, located about five miles from Little Caesars Arena. The “Saint” opened in the 1960s and became the center of the Detroit basketball scene when Hall of Famer Dave Bing trained there during a holdout. He was followed by local stars like Magic Johnson, Isiah Thomas, George Gervin, Chris Webber and Glen Rice. It even hosted multiple generations, with Pistons star Jimmy Walker playing there in the 1970s before his son, Jalen Rose, arrived in the 1990s.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host the Miami Heat on Wednesday.\n\n\r\n              Pistons: Visit the Los Angeles Clippers on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994094.02513
}