{
  "game_id": "0022000295",
  "espn_id": "401267455",
  "date": "Jan 29, 2021",
  "matchup": "BKN @ OKC",
  "headline": "Nets don't miss rested Durant in 147-125 win over Thunder",
  "body": "OKLAHOMA CITY -- — James Harden and Kyrie Irving each scored 25 points Friday night to help Brooklyn roll past the Oklahoma City Thunder 147-125, as the Nets rested Kevin Durant.\n\n\r\n                    Nets coach Steve Nash said he was protecting Durant, the league’s No. 2 scorer. Brooklyn made the move work — the team shot 57% from the field and scored a season-high point total. Nine Brooklyn players scored in double figures.\n\n\r\n                    “It’s huge for us, man,” said Bruce Brown, a guard who stepped into Brooklyn’s starting lineup and scored 19 points said. “It was fun to be out there. We were laughing, playing hard, joking around. We were loose. We had fun. Everybody got in, so that was cool.”\n\n\r\n                    Harden finished with a triple-double — he also had 11 assists and 10 rebounds. It was his third triple-double since joining the Nets two weeks ago. He said the process of working with Irving is coming along.\n\n\r\n                    “We’ve just got to find that balance of when to be aggressive and when to make plays,\" he said. \"I think even with our aggressiveness, we’re still playmakers. I think throughout the course of the game, we did a really good job of getting our guys involved, but then being aggressive and scoring the ball as well. Nothing really changes, even when KD is in the lineup as well.”\n\n\r\n                    Theo Maledon, a 19-year-old rookie, scored 24 points and was perfect on six shots from 3-point range for the Thunder. Shai Gilgeous-Alexander scored 24 points and Hamidou Diallo added 18 for Oklahoma City.\n\n\r\n                    The Nets led by nine at the end of the first quarter, then scored the first 10 points of the second to take a 46-27 lead and forced the Thunder to call a timeout.\n\n\r\n                    The Nets kept it going after the interruption, scoring five more points before the Thunder got on the board in the quarter. It took the Thunder nearly 3½ minutes to score in the period.\n\n\r\n                    “We were active on both ends of the floor,” Harden said. \"Coaches drew up a beautiful game plan and we executed on both ends of the ball. We like to see carryover and these last few games, we’ve been carrying over. We’ve been playing well.”\n\n\r\n                    The Nets led 76-59 at halftime -- their season high point total for a first half and the most the Thunder have allowed in any half this season. Harden had 17 points on 6-for-8 shooting before the break. \n\n\r\n                    Brooklyn made 15 of 23 shots in the third to take a 115-94 lead into the fourth quarter.\n\n\r\n                    “It was tough to defend them,” Oklahoma City's Al Horford said. “We were never able to make up the lead they built.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Shot exactly 15 for 26 from the field in both the first and second quarters. ... Held the Thunder to 33% shooting in the first quarter. ... Former Thunder player Jeff Green scored 11 points for Brooklyn. ... F Joe Harris scored 20 points and made five 3-pointers.\n\n\r\n                    Thunder: G George Hill sat out with a sprained right thumb. ... Dort made just 1 of 9 shots in the first half and 2 of 14 in the game. ... Diallo made a career-high nine free throws on nine attempts.\n\n\r\n                    STAT LINES\n\n\r\n                    Maledon's six made 3-pointers tied Terrance Ferguson's team rookie record. He's the first rookie in team history to make that many 3s without a miss.\n\n\r\n                    QUOTABLE\n\n\r\n                    Brown on if the Nets remembered Oklahoma City's 129-116 win at Brooklyn on Jan. 10: “Definitely. They came to Brooklyn and blew us out, so we had something to prove today.”\n\n\r\n                    UP NEXT\n\n\r\n                    The Thunder host the Houston Rockets on Monday.\n\n\r\n                    The Nets visit the Washington Wizards on Sunday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997509.964853
}