{
  "game_id": "0022300047",
  "espn_id": "401584135",
  "date": "Nov 24, 2023",
  "matchup": "DET @ IND",
  "headline": "Haliburton, Turner lead Pacers to 136-113 tournament win over Pistons",
  "body": "INDIANAPOLIS -- — Tyrese Haliburton had 26 points and 10 assists, Myles Turner scored 10 of his 23 points in the final quarter, and the Indiana Pacers earned a quarterfinal home game in the NBA In-Season Tournament with a 136-113 home victory over the Detroit Pistons on Friday night.\n\n\r\n              The Pacers, 4-0 in East Group A play, will host the next tournament opponent on Dec. 4 or 5.\n\n\r\n              “That's enormous for our team, for the organization, for ownership, for fans,\" Pacers coach Rick Carlisle said. \"That's going to be another opportunity for us. ... I'm real proud of the guys and the effort that they've put into this.”\n\n\r\n              The Pistons, after opening the season 2-1, have lost 13 consecutive games. \n\n\r\n              “We have to learn the formula: when we take care of the ball, we give ourselves a chance,” Pistons coach Monty Williams said. “When we give it away, like we did in the fourth quarter, it's hard.”\n\n\r\n              The Pistons made six of their 14 turnovers in the fourth quarter.\n\n\r\n              Turner overcame first-half foul trouble to finish strong, which included 10 rebounds and five blocks.\n\n\r\n              “I was mad, just sitting out,\" he said. \"Once I got out there, I just told myself, ‘Go. Put your head down and work.' ” \n\n\r\n              The Pistons led by one point in the first minute of the final quarter, but were outscored 39-17 in the fourth.\n\n\r\n              “We're the highest-scoring team on the planet,” Carlisle said of the NBA's No. 1 offense. “Teams are loading up, trying to figure out ways to slow us down.”\n\n\r\n              Despite playing with a sprained right wrist, Haliburton boosted a 9-of-23 shooting effort with five 3-pointers. Seven Pacers players scored at least 15 points.\n\n\r\n              Buddy Hield had 18 to continue his hot streak. In the last three games since being inserted into the lineup, he's scored 73 points and hit 16 of 25 3s. Obi Toppin and Bennedict Mathurin each scored 15.\n\n\r\n              Pistons point guard Cade Cunningham led all scorers with 31 and Jaden Ivey had 25.\n\n\r\n              Carlisle tied Frank Vogel for second on the franchise win list with his 250th victory. Bobby “Slick” Leonard is No. 1 at 529.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Washington on Monday.\n\n\r\n              Pacers: Host Portland on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995786.399165
}