{
  "game_id": "0021500418",
  "espn_id": "400828305",
  "date": "Dec 21, 2015",
  "matchup": "OKC @ LAC",
  "headline": "Thunder edge Clippers on Kevin Durant's jumper, block of Chris Paul",
  "body": "LOS ANGELES -- What Kevin Durant did to the Los Angeles Clippers was analogous to a baseball player hitting a go-ahead home run before robbing someone else of one.\nDurant drained a 19-foot jumper with 5.8 seconds left before blocking a potential game-winning 18-footer by Chris Paul as time expired, and the Oklahoma City Thunder beat the Clippers 100-99 on Monday night.\n\"As a kid, I dreamed about hitting the game-winner,\" Durant said. \"No doubt, the block was good for our team. But as a kid, I wanted to hit the game-winner all the time. So I'll take the game-winner over the block.\"\n\nRussell Westbrook scored 33 points, Durant had 24 and Serge Ibaka added 17 for Oklahoma City. Coming off a 104-100 loss at Cleveland that snapped their six-game winning streak, the Thunder won for the 11th time in 14 games.\nAfter a Clippers turnover and a subsequent foul by J.J. Redick following Westbrook's steal, Dion Waiters' inbounds pass for Westbrook was intercepted by Paul, who quickly went in for a layup that put the Clippers ahead 99-98.\nBut Durant followed with his clutch shot from the right wing before making his game-saving defensive play on Paul.\n\"I feel like my defense has grown,\" Durant said. \"Since my first year, I never was a liability on that end. I just had to learn the skills. So I felt like I could always guard every position if I was locked in and being aggressive, and using my length to my advantage.\n\"I always felt like I was a smart player, but the coaches challenged me at the start of the year to just step it up to another level at the defensive end.\"\nPaul had 32 points and 10 assists in another classic duel with Westbrook, who won his first NBA scoring title last season. Redick and Blake Griffin each scored 15 for the Clippers, whose third straight loss equaled their longest skid of the season.\nOnly five of the Clippers' 16 wins have come against teams currently over .500. They are 0-4 against the three teams ahead of them in the Western Conference, losing twice to Golden State and once each to San Antonio and Oklahoma City.\n\"The great teams are able to bring it every night, no matter who they are playing against,\" Paul said. \"That's why the Spurs, Warriors, those types of teams have the records they do. We have had different lineups every night and different guys in and out, but that is part of fielding a great team.\"\nThe Clippers led 83-75 after reserve center Cole Aldrich followed his block of Westbrook's layup with a fast-break dunk with 10:35 remaining. The Thunder tied the score three times, the third at 93-all on Ibaka's short jumper with 3:13 to play.\nGriffin put Los Angeles ahead about a minute later with an 8-footer, but Westbrook's 3-pointer from the left sideline put Oklahoma City ahead 96-95 with 48.8 seconds to go.\n\"We missed like three layups that would have put us ahead by two, and I missed a wide-open 3. But later on, Russ hit the big shot that got us going,\" Durant said. \"I believe in Russ. He's a big-game player. He takes those shots late in the game because he wants it.\"\nGriffin responded with a dunk 11 seconds later, but Westbrook's 11-foot pull-up jumper made it 98-97 Thunder.\n\"We believe in each other,\" Durant said. \"Russ hit big shots and everybody was excited for him. Serge hit big shots and everybody was excited for him. And when my number was called, you saw the guys hop off the bench when I made the shot. And that's all you want -- that support from your teammates.\"\nTIP-INS\nThunder: Have won the last 11 times Westbrook led them in scoring. Durant led them in each of the previous three games, all losses. Oklahoma City is 6-5 when Durant is the high-point man. ... The Thunder will stay in town for a Wednesday night rematch with the 4-23 Lakers, whom they beat by 40 points Saturday at Oklahoma City.\nClippers: Westbrook was the ninth player to score at least 30 points against the Clippers in their first 29 games, including Stephen Curry twice. ... The Clippers will face the Lakers on Friday as the designated road team. They have won seven straight against their Staples Center co-tenants, and 11 of the last 12 meetings.\nUP NEXT\nThunder: At the Los Angeles Lakers on Wednesday.\nClippers: Will face the Lakers on Christmas for the first time since 1991.",
  "source": "espn_api",
  "crawled_at": 1764994189.413933
}