{
  "game_id": "0021600632",
  "espn_id": "400900053",
  "date": "Jan 18, 2017",
  "matchup": "MIL @ HOU",
  "headline": "Harden, Rockets beat Bucks 111-92",
  "body": "HOUSTON --  James Harden and the Houston Rockets used their defense to get back on track.\n\nHarden had 38 points, eight assists and six rebounds, helping the Rockets beat the Milwaukee Bucks 111-92 on Wednesday night.\n\nHouston had dropped three for four, but it recorded a season-high 12 blocked shots and held Milwaukee to 39.8 percent shooting.\n\n\"That was the key to the game,\" Harden said. \"I think we're realizing that in order for us to get to where we want to go, we have to get stops. When we get stops, we are 10 times better.\"\n\nHarden drilled a straightaway 3-pointer with six minutes left to give Houston a 13-point lead and shimmied his shoulders down the court in a celebratory dance as the Bucks called timeout.\n\nGiannis Antetokounmpo had 32 points, 11 rebounds, six assists and three blocks for Milwaukee, which struggled to score in the first half. Jabari Parker scored 15 points on 5-for-15 shooting, and reserve Michael Beasley had 14 points and eight boards.\n\nAntetokounmpo was visibly frustrated after he was called for goaltending on a chase-down block of Harden as the game slipped away late in the fourth quarter.\n\n\"I've got to do a better job of playing harder, especially in the fourth quarter,\" Antetokounmpo said. \"We could have had that game today, but we gave it away.\"\n\nHouston shooting guard Eric Gordon recaptured his touch after struggling from the field while playing on a tweaked ankle in the Rockets' 109-103 loss in Miami on Tuesday night. Gordon went 7 for 17 from the 3-point range and finished with 25 points.\n\nThe Rockets played without sharp-shooting power forward Ryan Anderson, who was sidelined by the flu for the second straight game. They missed his long-range presence, going 4 for 20 from beyond the arc in the first half before finishing 14 for 44.\n\nBucks coach Jason Kidd said Houston's late success behind the 3-point line helped the Rockets pull away.\n\n\"At the beginning of the game, we made a conscious effort and did a really good job,\" Kidd said. \"But you have to have some pride and it has to be a team effort. Tonight, we just didn't give it.\"\n\nMilwaukee had a five-point lead at the end of the first quarter, but was outscored 30-12 in the second. The Rockets allowed a season-low 39 first-half points and led by 13 at the break.\n\nMontrezl Harrell had 12 points, eight rebounds and five blocks for the Rockets, who host NBA-leading Golden State on Friday night. Harden, Patrick Beverley and Clint Capela each added two blocks.\n\nIn their only previous matchup this season, the Rockets defeated the Warriors 132-127 in a double-overtime thriller in Oakland on Dec. 1.\n\n\"Obviously, we get a big test on Friday,\" coach Mike D'Antoni said. \"But we're ready to see how good we really are.\"\n\nHIGH PRAISE\n\nAfter their scoring duel, Antetokounmpo called Harden the best player in the league.\n\n\"He's tough to guard, and the guys around him makes him even tougher to guard,\" he said. \"He's doing a great job of find his teammates and being unselfish.\"\n\nONE HALF OF THE TWIN TOWERS\n\nRockets Hall of Fame center Ralph Sampson -- one half of the franchise's Twin Towers along with Hakeem Olajuwon in the 1980s -- was honored with a video montage as part of the team's ongoing celebration of its 50th season. The 7-foot-4 big man sat courtside and received a standing ovation when introduced to the Toyota Center crowd. The Rockets also handed out Ralph Sampson figurines as a promotional giveaway.\n\nTIP-INS\n\nBucks: Greg Monroe and Rockets C Nene each received a technical after they tangled on a rebound late in the third quarter. Monroe never re-entered the game. ... Parker also had seven rebounds.\n\nRockets: In Anderson's absence, Trevor Ariza moved from small forward to power forward, and Corey Brewer started in his place. Ariza and Brewer combined for just seven points but played critical roles on the defensive end.\n\nUP NEXT\n\nWizards: Visit Orlando on Friday night.\n\nRockets: Host Golden State on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995184.2375438
}