{
  "game_id": "0022401147",
  "espn_id": "401705713",
  "date": "Apr 08, 2025",
  "matchup": "CHI @ CLE",
  "headline": "Cavaliers claim the No. 1 seed in the Eastern Conference with a 135-113 win over the Bulls",
  "body": "CLEVELAND -- — Darius Garland scored 28 points, Evan Mobley had 21 points, 11 rebounds and seven assists and the Cleveland Cavaliers clinched the top seed in the Eastern Conference with a 135-113 win over the Chicago Bulls on Tuesday night.\n\n\r\n              Ty Jerome added 18 points off the bench and De’Andre Hunter scored 17 for Cleveland, which has the second-best record in franchise history at 63-16. The Cavaliers secured the No. 1 seed in the East for the fourth time.\n\n\r\n              Patrick Williams scored a season-high 21 points and made 5 of 6 3-pointers, and Matas Buzelis added 19 points for Chicago. The Bulls have clinched a play-in tournament berth and are tied with Miami for ninth in the East.\n\n\r\n              Chicago’s top five scorers were not in uniform, including Coby White (rest), Nikola Vucevic (right calf soreness) and Josh Giddey (right forearm). Lonzo Ball (right wrist sprain) also was not available.\n\n\r\n              Takeaways\r\n              Bulls: White, who is averaging team highs of 20.7 points and 33.3 minutes, was rested. Coach Billy Donovan expressed concern “with the load Coby has had to endure,” but expects White to play in the final three regular-season games.\n\n\r\n              Cavaliers: All-Star shooting guard Donovan Mitchell did not dress for precautionary reasons after spraining his left ankle Sunday against Sacramento. Coach Kenny Atkinson said Mitchell will be good to go for the playoffs, but may sit out additional games.\n\n\r\n              Key moment\r\n              Garland made four 3-pointers in eight minutes during the second quarter, triggering a 41-21 run that allowed the Cavaliers to push their lead to 21 points. Cleveland made 10 3-pointers in the period.\n\n\r\n              Key stat\r\n              White, Vucevic, Giddey, Ayo Dosunmu (left shoulder surgery) and Kevin Huerter (cervical strain) are averaging a combined 103.0 points for the Bulls, whose season average is 117.8.\n\n\r\n              Up next\r\n              The Bulls visit Miami on Wednesday in a critical game for seeding. The Cavaliers are at Indiana on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997020.971036
}