{
  "game_id": "0021600965",
  "espn_id": "400900360",
  "date": "Mar 10, 2017",
  "matchup": "CHA vs. ORL",
  "headline": "Walker scores 23, Hornets blow out Magic 121-81",
  "body": "CHARLOTTE, N.C. --  Things haven't gone exactly as Marvin Williams and the Charlotte Hornets planned this season.\n\nBut the veteran forward said he's optimistic the Hornets can still make a playoff run despite a midseason funk. They got headed in the right direction Friday night with a dominating 121-81 win over the Orlando Magic.\n\n\"We're in a playoff battle right now,\" Williams said. \"We're in a fight and we're on the outside looking in but everybody's still staying alive. We're still staying upbeat and working as hard as we can.\"\n\nCharlotte (29-36) entered the night three games behind the Chicago Bulls for the eighth spot in the Eastern Conference and in need of some momentum heading down the stretch.\n\nWilliams helped provide it.\n\nKemba Walker scored 23 points and Williams chipped in with 12 points and a career-high 18 rebounds. Williams provided the highlight of the night with a monster jam over Bismack Biyombo on a three-point play that was replayed on the scoreboard several times, drawing louder roars each time.\n\nWilliams said Biyombo had asked him before the game to come participate in some of his offseason basketball development camps in his native Africa after the season. When asked what he said to Biyombo after posterizing him, Williams laughed and said, \"I was asking him if I was still invited.\"\n\n\"Marvin's on a roll,\" Hornets coach Steve Clifford said. \"He's played really, really well. He's done everything. He's scored, he's rebounded and his defense is always good.\"\n\nNic Batum added 15 points and 10 rebounds.\n\nWalker, who earned NBA Eastern Conference Player of the Week earlier this week, was 9 of 13 from the field and knocked down five of his first seven 3-point attempts in only 24 minutes of action.\n\nThis one was never close as Charlotte posted its first wire-to-wire win since April 13, 2016.\n\n\"They came out red hot and even when we had good coverages they were knocking down 3s,\" Magic coach Frank Vogel said. \"They were red hot and we were ice cold. Sometimes the game goes that way but you have to show some competitive spirit when you get down and we didn't have any of that tonight.\"\n\nTIP-INS:\n\nMagic: Aaron Gordon had 20 points on 8-of-14 shooting for the Magic, who have lost three of their last four. ... Elfrid Payton was coming off back-to-back triple-doubles, but didn't come close to adding to that total against the Hornets. He finished with eight points, 12 assists and two rebounds.\n\nHornets: Improved to 18-13 at home. ... Have won six straight against the Magic. ... Are 18-2 overall and 12-0 at home when holding opponents fewer than 100 points. ... Walker now has a career-high 187 3-pointers this season.\n\nBIG BENCH PRODUCTION\n\nThe Hornets led by as many as 20 in the first half behind strong play off the bench from Marco Belinelli and Brian Roberts, who combined for 33 points. Charlotte stretched the lead to 27 in the third quarter and shot 60 percent for the game.\n\nChristian Wood had 14 points and Jeremy Lamb 10 off the bench.\n\n\"Last year our bench was our absolute strength. This year it hasn't been,\" Clifford said. \"It's as simple as that.\"\n\nWHERE'S ROSS?\n\nTerrence Ross was held scoreless in nearly 28 minutes of action, missing all five shot attempts from the floor. \"Terrence will be fine,\" Vogel said. \"He had a tough night. We have to make sure we can get him the ball in better spots. That's what I can do.\"\n\nUP NEXT\n\nMagic: Orlando's schedule only gets tougher as they host the Cavaliers on Saturday night.\n\nHornets: Charlotte also has a back-to-back, hosting the Pelicans on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995474.224468
}