{
  "game_id": "0022000766",
  "espn_id": "401307558",
  "date": "Apr 05, 2021",
  "matchup": "OKC vs. DET",
  "headline": "Grant scores 21 vs. former team as Pistons dominate Thunder",
  "body": "OKLAHOMA CITY -- — Jerami Grant scored 21 points against his former team, and the Detroit Pistons beat the Oklahoma City Thunder 132-108 on Monday night. \n\n\r\n                    Grant played three seasons for the Thunder, and then was traded after the 2018-19 season. He looked at home during his return, making 7 of 15 shots and adding five rebounds and five assists in just 23 minutes.\n\n\r\n                    Josh Jackson and Sekou Doumbouya scored 14 points apiece for Detroit, which was coming off a 125-81 home loss to the New York Knicks on Saturday — the franchise’s worst defeat since a 44-point loss in 1994.\n\n\r\n                    Pistons coach Dwane Casey wondered how his team would bounce back, and he liked what he saw. Detroit shot 52% from the field.\n\n\r\n                    “More than the victory itself, the response, the way we came out and played — the approach we had was a very energetic, together approach, and that’s something that was important,” he said. \n\n\r\n                    Aleksej Pokusevski scored 19 points for the Thunder, and Svi Mykhailiuk had 17. Mykhailiuk was acquired in a trade with Detroit last month. \n\n\r\n                    Oklahoma City again played without starters Shai Gilgeous-Alexander (plantar fasciitis, right foot), Lu Dort (concussion protocol) and Darius Bazley (bruised left shoulder). Reserves Isaiah Roby and Josh Hall also are in the concussion protocol.\n\n\r\n                    The Thunder have been blown out for three straight games. Oklahoma City’s 133-85 loss at Portland on Saturday was the largest margin of defeat in Thunder history, and that followed a 37-point loss to Phoenix the night before. \n\n\r\n                    Oklahoma City has lost six of seven overall. \n\n\r\n                    “There’s points of the season where things are going well and you’ve got to stay grounded in your process and keep your eye on the ball, even though you’re having success,” Thunder coach Mark Daigneault said. “Then there’s points in the season that you have to endure and you’ve got to just kind of battle up and take your licks and taste your own blood a little bit. And we’re going through that right now.”\n\n\r\n                    The Pistons led 42-19 in the second quarter before taking a 58-47 halftime lead. Grant scored 14 points before the break.\n\n\r\n                    \"We tried to come out here tonight from the jump ball from the tip and be the ones to punch and set the tone and let the other team know that this was the type of game that it was going to be tonight,” Pistons guard Hamidou Diallo said. \n\n\r\n                    Detroit created some distance in the third quarter and led 93-77 heading into the final period. The Pistons' largest lead was 27 points in the fourth.\n\n\r\n                    Casey is hoping to see a similar effort for the rest of Detroit's five-game trip, which also includes matchups with Denver, Portland and the Los Angeles Clippers.\n\n\r\n                    “This is going to be one of the toughest road trips we’re going to have all year, and we’re going to need all hands on deck,” Casey said. \n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Guard Cory Joseph was called for a Flagrant 1 foul for a body block on Justin Robinson in the second quarter. ... Made all nine of their free throws in the third quarter and 21 of 24 overall. ... Starters Mason Plumlee and Wayne Ellington rested.\n\n\r\n                    Thunder: Forward Justin Jackson was waived. ... Robinson, a guard, was added on a 10-day contract, and Jaylen Hoard, a forward, got a two-way deal. Hoard scored 10 points and Robinson added nine. ... Guard/Forward Kenrich Williams left with a sprained left ankle in the fourth quarter.\n\n\r\n                    TONE SETTER\n\n\r\n                    Detroit center Isaiah Stewart blocked four shots in the first quarter despite playing just eight minutes. He went without a block the rest of the game, but he finished with 12 points and six rebounds in 22 minutes.\n\n\r\n                    GOOD RETURN\n\n\r\n                    Diallo, who was traded to Detroit for Mykhailiuk, finished with 11 points, eight rebounds and four assists.\n\n\r\n                    STAT LINES\n\n\r\n                    The Pistons made 13 of 28 3-pointers while the Thunder made just 5 of 27. Oklahoma City had 17 assists to 15 turnovers.\n\n\r\n                    UP NEXT\n\n\r\n                    The Pistons visit the Denver Nuggets on Tuesday.\n\n\r\n                    The Thunder host the Charlotte Hornets on Wednesday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997079.07258
}