{
  "game_id": "0022400712",
  "espn_id": "401705278",
  "date": "Feb 04, 2025",
  "matchup": "DAL @ PHI",
  "headline": "Joel Embiid has triple-double in 1st game in a month as Sixers slip past Mavs 118-116",
  "body": "PHILADELPHIA -- — Joel Embiid had 29 points, 11 rebounds and 10 assists in his first action in a month to lead the Philadelphia 76ers to a 118-116 victory Tuesday night over the Dallas Mavericks, who fell to 0-2 since trading star Luka Doncic to the Los Angeles Lakers.\n\n\r\n              Embiid recorded his first triple-double of an injury-plagued season in which he's appeared in just 14 games. A left knee injury sidelined the seven-time All-Star for the previous 15 games, and he wore a large brace on the knee.\n\n\r\n              But he looked like his usual self, especially down the stretch. Embiid’s layup with 22 seconds left put Philadelphia ahead by a point. He grabbed a rebound on the Mavericks’ next possession and then defended the final play of the game when Dallas turned it over.\n\n\r\n              Tyrese Maxey had 33 points and 13 assists for the Sixers.\n\n\r\n              Kyrie Irving scored 34 points for the Mavs and Naji Marshall added 19. \n\n\r\n              Newly acquired Anthony Davis (abdominal injury) didn’t play but was courtside after Sunday’s trade that brought him to Dallas in exchange for Doncic. Max Christie, also part of the deal, scored 15 points.\n\n\r\n              The Sixers' Paul George missed his fifth straight game with a finger injury.\n\n\r\n              Coach Nick Nurse said Embiid wasn't under any restrictions and he played 36 minutes, going 12 of 23 from the field and 4 of 9 from the free-throw line.\n\n\r\n              Takeaways\r\n              Neither Caleb Martin nor Quentin Grimes played. The players were traded for each other prior to the game, with Martin going to Dallas and Grimes to the 76ers. \n\n\r\n              Key moment\r\n              Embiid threw a no-look bounce pass between his legs to Maxey, who nailed a 3-pointer to make it 99-93 with 8:18 to play.\n\n\r\n              Key stat\r\n              The Sixers improved to 20-29 overall and 8-6 with Embiid in the lineup.\n\n\r\n              Up next\r\n              Dallas: At Boston on Thursday night\n\n\r\n              Philadelphia: Hosts Miami on Wednesday night\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997163.727502
}