{
  "game_id": "0021400619",
  "espn_id": "400578911",
  "date": "Jan 19, 2015",
  "matchup": "MIL vs. TOR",
  "headline": "Lowry scores 18, balanced Raptors beat Bucks 92-89",
  "body": "MILWAUKEE --  Terrence Ross finished what he failed to start Monday night.\n\nKyle Lowry scored 18 points and was one of six Toronto players to reach double figures in the Raptors' 92-89 victory over the Milwaukee Bucks.\n\nRoss, who did not start for just the second time in the last 104 games after he was held scoreless for the only time this season in a 95-93 loss against New Orleans on Sunday, scored his team's final two baskets to end up with 16 points.\n\n\"That's how I started off in the league, so I'm used to it,\" Ross said.\n\nAdded Toronto coach Dwane Casey: \"He played well. He came off the bench relaxed and with a lot of confidence. I thought when he came in in the first half, he got us jump-started. I don't know if it's going to be a permanent thing, but I like the way he came in and played, especially on the defensive end.\"\n\nMilwaukee (21-20), playing for the first time since beating New York 95-79 on Thursday in London, got 20 points, five rebounds, five assists and four steals from Brandon Knight.\n\nThe Bucks, whose biggest loss this season was 124-82 at Toronto on Nov. 21, also got 14 points and a team-high seven rebounds from Ersan Ilyasova. O.J. Mayo scored 13.\n\nWith the shot clock running down, Ross hit a baseline jumper from the right side to give Toronto a 90-87 lead with 26.4 seconds to go.\n\nAfter Knight drove down the court for a layup, Ross was able to sneak behind the defense for a breakaway dunk and a 92-89 lead with 15.9 seconds left. The Atlantic Division leaders (27-14) went on to win for the third time in 10 games.\n\n\"I don't know what happened with the defense, but I kind of just got out in front of them,\" said Ross, who shot 7 of 12 from the floor.\n\nKnight then missed a 3-pointer, but Lowry helped Milwaukee's chances by missing two free throws with 5.8 seconds to play.\n\nIlyasova grabbed the rebound and passed to Mayo, who dribbled past midcourt into Toronto traffic and lost control of the ball to Lou Williams. Toronto was then able to run out the clock.\n\n\"(Knight's miss) was a wide-open shot,\" Milwaukee coach Jason Kidd said. \"That's all you can ask for. As a team, we had a great look and had one of our best shooters shooting the ball. Unfortunately it just didn't go in.\"\n\n---\n\nTIP-INS\n\nRaptors: Toronto has won its last six against Milwaukee after losing 10 straight to the Bucks. ... The Raptors snapped a season-high, three-game losing streak on the road. Five of the team's next seven games are away from home.\n\nBucks: Kenyon Martin was signed to a second 10-day contract. ... Milwaukee is 6-2 against Atlantic Division opponents, with both losses to Toronto. ... This was the team's first home game on a Monday this season.\n\nSANDERS STARTS SUSPENSION\n\nMilwaukee big man Larry Sanders began serving his 10-game drug suspension. He had missed the previous 11 games due to illness and personal reasons.\n\nYOUNG BUCK\n\nGiannis Antetokounmpo (20 years, 44 days) became the youngest Bucks player to reach 1,000 career points, surpassing Brandon Jennings (20 years, 170 days).\n\nHONORING MLK\n\nCasey was asked to reflect on Martin Luther King Jr. before the game and said it is amazing what the NBA represents. \"Whether it is gender, race, creed or nationality, the NBA represents all of those,\" he said. \"The league has done a great job with diversity, and that is what Dr. Martin Luther King Jr. talked about and preached. He preached opportunity, and this league is about opportunity.\"\n\nUP NEXT\n\nRaptors: At Memphis on Wednesday.\n\nBucks: Host Utah on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764991795.4709811
}