{
  "game_id": "0022200898",
  "espn_id": "401469053",
  "date": "Feb 24, 2023",
  "matchup": "CHA @ MIN",
  "headline": "LaMelo Ball helps Hornets beat Timberwolves 121-113",
  "body": "MINNEAPOLIS -- — LaMelo Ball had 32 points, 10 rebounds, eight assists and the dagger 3-pointer down the stretch to lead the Charlotte Hornets past the Minnesota Timberwolves 121-113 on Friday night.\n\n\r\n              Gordon Hayward added a season-high 27 points and 13 rebounds and P.J. Washington had in 20 points for the Hornets. They won their third straight overall and stopped a seven-game road skid, handing the Timberwolves yet another setback against an opponent buried in the standings.\n\n\r\n              “We’ve got a whole lot of talent on the team. Everybody can score. Everybody can shoot,” said Ball, who bested Minnesota All-Star Anthony Edwards in this battle of two of the top three picks in the 2020 draft. Edwards had 29 points and eight rebounds, bringing the Wolves to life in the fourth quarter and on the verge of avoiding a second damaging loss to the lottery-bound Hornets.\n\n\r\n              But after Edwards hit a spin-dribble jumper on Ball for a 104-102 lead with 6:41 left, Ball answered with a step-back 3-pointer to put Charlotte back in front.\n\n\r\n              Hayward's tip-in with 2:11 remaining gave the Hornets a 112-109 advantage. With 1:21 to go, Hayward passed up his own shot in the paint and dished to the top of the key for Ball's fifth 3-pointer of the game and a 117-111 lead.\n\n\r\n              “He certainly isn’t afraid of any moment. It’s been fun to watch him develop over these last three years,” Hayward said.\n\n\r\n              Rudy Gobert had 17 points and 10 rebounds, Mike Conley scored 15 points and Nickiel Alexander-Walker added 13 points for the Wolves, who were lacking focus and foul-happy on defense and watched the Hornets go 25 for 28 from the free-throw line.\n\n\r\n              “We’re capable of doing it. That’s why it’s more disappointing than anything,\" Conley said. “We’ve just got to stop gambling, stop reaching, stop giving them opportunities at the free-throw line.”\n\n\r\n              Kelly Oubre Jr. returned for the Hornets from a 24-game absence with his recovery from left hand surgery complete. Oubre, one of three 20-points-per-game scorers on the squad, had eight points in 23 minutes off the bench.\n\n\r\n              “We had some timely buckets for sure,” Hayward said, “but more than anything we got the stops when we needed them, which has kind of been a problem for us all year.”\n\n\r\n              Same for the Wolves, who had a lot more riding on this. They emerged from their break in seventh place in the Western Conference, with just two fewer wins than the fourth-place Clippers and only two fewer losses than the 13th-place Lakers in this absurdly crowded race for the playoffs. \n\n\r\n              The Wolves have only seven of their last 20 games at home, the fewest left in the league, with a daunting majority of their remaining schedule against teams currently above the postseason cut. That might not hurt them, though. They're 5-8 against the five worst teams in the NBA: Houston, San Antonio, Detroit, Charlotte and Orlando. \n\n\r\n              The Hornets, who beat the Wolves 110-108 at home on Nov. 25, shot 56% from the field in the first half for a 72-64 lead.\n\n\r\n              “Defense, I think that’s the main thing we need to be able to bank on,” Edwards said. \"Every night we need to know that our defense is going to be there.”\n\n\r\n              TOWNS STILL DOWN\n\n\r\n              Timberwolves star Karl-Anthony Towns was sidelined for the 41st straight game with a calf strain, an injury that still lacks a clear timetable for his return. \n\n\r\n              “He’s definitely in the final stages. He’s itching to play,\" coach Chris Finch said. \"I don’t think that it’s a question of anything like going off path right now.”\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Ball set a career best with his fifth straight double-double. His season highs are 33 points and 12 rebounds. ... The Hornets improved to 9-25 on the road.\n\n\r\n              Timberwolves: Naz Reid had 16 points and eight rebounds off the bench. ... Backup PF Taurean Prince was out for personal reasons.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host Miami on Saturday night, starting a four-game homestand.\n\n\r\n              Timberwolves: Play at Golden State on Sunday night, starting a four-game trip to face each of the four California teams. They play at home again in 10 days.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994248.292992
}