{
  "game_id": "0022300106",
  "espn_id": "401584734",
  "date": "Oct 30, 2023",
  "matchup": "MEM vs. DAL",
  "headline": "Luka Doncic's 58th career triple-double powers Mavericks past Grizzlies 125-110",
  "body": "MEMPHIS, Tenn. -- — Luka Doncic had 35 points, 12 rebounds and 12 assists and Derrick Jones Jr. added 22 points as the Dallas Mavericks remained undefeated with a 125-110 victory over the Memphis Grizzlies on Monday night.\n\n\r\n              Tim Hardaway Jr. added 21 points for Dallas and Grant Williams finished with 15. Doncic, who had 49 points in Friday's 125-120 win over the Brooklyn Nets, recorded his 58th career triple-double, shooting 11 of 22 from the field, including 6 of 12 from 3-point range. Dallas improved to 3-0.\n\n\r\n              “It's a great start,” Doncic said. “We know we have a lot of games left, but it's always (nice) to have a great start.”\n\n\r\n              Desmond Bane and Jaren Jackson Jr. led Memphis with 30 points apiece. Jackson grabbed nine rebounds. Marcus Smart finished with 23 points before fouling out late in the game.\n\n\r\n              The loss left the Grizzlies at 0-4, the first time Memphis has lost its first four games in a season since 2004. Monday's game was the largest losing margin.\n\n\r\n              “We've been close,” Bane said of the rough start, “and sooner rather than later, we're going to get in the win column.”\n\n\r\n              Memphis continued to play short-handed with frontline injuries and the 25-game suspension of last year's leading scorer, Ja Morant. \n\n\r\n              Meanwhile Mavs starting guard Kyrie Irving was a late scratch with a left foot sprain. With Irving out of the lineup, Jones, who only scored a total of five points in Dallas' first two games, was the offensive sparkplug to fill the void. He made 7 of 10 shots in the game, and was 4 of 6 from long distance.\n\n\r\n              “We're looking for him to be him,” Dallas coach Jason Kidd said of Jones, whose 22 points were three short of his career high. “He's a pro. ... He's worked on his 3-pointer, and you could see that tonight.”\n\n\r\n              Doncic showed his presence with 22 points in the first half, 15 coming in the second quarter of a closely played affair. Bane tried to keep pace for Memphis with 18 in the half.\n\n\r\n              But the Mavericks led 67-61 at the break, helped by shooting 15 for 26 from beyond the arc.\n\n\r\n              As they have for most games so far, the Grizzlies — who had an eight-point lead in the second quarter — were fighting from behind. That continued in the third quarter as the Mavericks stretched the advantage to 11 points, continuing to shoot better than 50% overall and from 3-point range.\n\n\r\n              Memphis tried to stymie Doncic by double-teaming him, but that just contributed to open shots for other players and assists for the Mavericks guard.\n\n\r\n              “Luka did an amazing job getting two defenders on him, and hitting the open guy,” said Hardaway, who was 8 of 14 from the field. “Luka's always preaching to the guys to play four on three” if he is double-teamed.\n\n\r\n              The Dallas lead reached 17 points in the fourth.\n\n\r\n              “You go down (17 points) in the fourth quarter, and you've got one of two options — you can either lay down or keep fighting,” Bane said. “I thought we responded well after that, and were able to get the lead down. ... There's no quit in this team.”\n\n\r\n              Memphis did rally in the final frame by scoring 11 straight points, including a trio of 3-pointers to cut the lead to 110-106 with five minutes left. But an inside basket by Josh Green and another 3-pointer from Doncic extended the lead to double digits.\n\n\r\n              For Memphis it was another disappointment as it deals with injuries and waits on Morant's return in December. \n\n\r\n              “I thought our execution offensively for the majority of the game was good. Late in the game, that’s where it starts with me,” Memphis coach Taylor Jenkins said. “Got to be better organized. Got to knock down shots throughout the game.\n\n\r\n              “This was a step in the right direction.”\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Chicago on Wednesday.\n\n\r\n              Grizzlies: Travel to Utah to play the Jazz on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996517.962365
}