{
  "game_id": "0022301102",
  "espn_id": "401585730",
  "date": "Apr 03, 2024",
  "matchup": "POR @ CHA",
  "headline": "Scoot Henderson outduels Brandon Miller as Trail Blazers beat Hornets 89-86 to snap 10-game skid",
  "body": "CHARLOTTE, N.C. -- — Scoot Henderson had 22 points and 10 assists and the Portland Trail Blazers beat Brandon Miller and the Charlotte Hornets 89-86 on Wednesday night in a matchup of two of the league’s top three draft picks.\n\n\r\n              Henderson, taken one spot behind Miller at No. 3 overall, shot 9 of 17 from the field as the Trail Blazers snapped a 10-game losing streak. Miller finished with 21 points to lead the Hornets, but struggled from long range finishing 1 of 8 from beyond the arc. \n\n\r\n              It's the first time they've faced each other since entering the NBA.\n\n\r\n              “Me coming here was,” Henderson said when asked if it was extra motivation facing Miller after being selected behind him. “I wasn't thinking about that. It was more like just go out here and try to put on a show for the Hornets.”\n\n\r\n              Said Miller: \"It was good, it was fun. A great environment and I feel like Charlotte the city came out to support so it’s all good vibes.” \n\n\r\n              Deandre Ayton had a monster game with 24 points and 16 rebounds and Jabari Walker had 14 points and a career-high 22 rebounds.\n\n\r\n              With Charlotte's two 7-foot centers out, the Blazers held a 55-36 edge on the glass.\n\n\r\n              Charlotte shot 5 of 31 from beyond the arc just hours after Steve Clifford announced that he is stepping down as head coach after the season.\n\n\r\n              “The last probably five or six minutes I thought Scoot was really good at slowing down and getting the ball to DA (Ayton) where it should’ve been,\" Portland coach Chauncey Billups said. \"Obviously Jabari was a man amongst boys out there tonight, getting his career high in rebounds and hitting the two big free throws.” \n\n\r\n              With the game tied at 81, Henderson drove and dished to Walker for the go-ahead layup. After Tre Mann missed his sixth straight 3-pointer at the other end, Henderson hit a foul line jumper to make it a two-possession game with 1:09 to play.\n\n\r\n              Miller, who had missed his first seven 3s, finally knocked one down from the top of the key bringing the crowd to its feet. Ayton's putback pushed the lead back to three, but Miller answered with a short jumper.\n\n\r\n              The stage was then set for the rookies and a fantastic ending, but both came up short in the clutch.\n\n\r\n              Henderson was fouled with 18.5 seconds left and missed both free throws. That opened the door for Miller to put the Hornets ahead, but he missed a floater over Ayton.\n\n\r\n              After Walker made two free throws, Davis Bertans missed a 3-point attempt at the buzzer that would have sent the game into overtime.\n\n\r\n              “It's good to get the win, but I gotta have those free throws,” Henderson said. “Can't have any slips at the end of the game like that.”\n\n\r\n              Both teams played short-handed.\n\n\r\n              The Hornets played without a number of key players including leading scorer Miles Bridges, point guards Vasa Micic and center Nick Richards due to injuries. LaMelo Ball has already been ruled out for the season, while Mark Williams, Seth Curry and Cody Martin remain out as well.\n\n\r\n              The Blazers are without Malcolm Brogdon, Jerami Grant, Anfernee Simons, Matisse Thybulle, Shaedon Sharpe and Robert Williams. \n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Golden State on Friday night.\n\n\r\n              Hornets: Host Orlando on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996606.376809
}