{
  "game_id": "0022400453",
  "espn_id": "401705019",
  "date": "Dec 31, 2024",
  "matchup": "MEM @ PHX",
  "headline": "Jackson Jr. scores 38, Bane has 31 as Grizzlies top Suns 117-112",
  "body": "PHOENIX -- — Jaren Jackson Jr. scored 38 points to lead the Memphis Grizzlies to a 117-112 victory over the Phoenix Suns Tuesday night.\n\n\r\n              Desmond Bane scored 31 as the Grizzlies, playing without injured Ja Morant (right shoulder strain) and Zach Edey (concussion protocol), never trailed. Reserve Luke Kennard scored 17 points and John Konchar grabbed a game-high 12 rebounds as Memphis moved to 23-11, second in the Western Conference.\n\n\r\n              Devin Booker returned for Phoenix after missing five games with a left groin strain and had 16 points and nine assists. Kevin Durant led the Suns with 29 points and 10 rebounds.\n\n\r\n              The Suns, who lost for the sixth time in seven games, played without Jusuf Nurkic, serving the second of his three-game suspension for his involvement in a fight with the Dallas Mavericks on Friday. Bradley Beal left the game in the first half with a left hip contusion.\n\n\r\n              Though no one fouled out, there were 54 fouls called in the game and 58 free throws attempted. Jackson Jr. was 10 of 17 from the line and also finished with 10 rebounds.\n\n\r\n              Booker last played Dec. 19 in a loss to Indiana. The Suns lost four of the five games they played without Booker, who entered Tuesday’s game against Memphis averaging 25.1 points and 6.4 assists per game.\n\n\r\n              Takeaways\r\n              Grizzlies: Jaylen Wells filled in with 11 points as the Grizzlies won without two starters.\n\n\r\n              Suns: Booker started slow but got back in the rhythm by scoring the Suns’ first five points of the second quarter.\n\n\r\n              Key moment\r\n              Konchar’s three-point play with 1:05 left gave Memphis a 113-106 lead after the Suns had come within one point earlier.\n\n\r\n              Key stat\r\n              Jackson was outscoring the Suns 19-18 at one point late in the first quarter.\n\n\r\n              Up next\r\n              The Suns play Saturday at Indiana. The Grizzlies are at Sacramento on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998121.374146
}