{
  "game_id": "0021800118",
  "espn_id": "401070799",
  "date": "Nov 02, 2018",
  "matchup": "HOU @ BKN",
  "headline": "Paul, Anthony help Rockets top Nets 119-111, end 4-game skid",
  "body": "NEW YORK --  The Rockets had talked long enough about their struggles, and then it was time to do something about it.\n\nSo during a timeout with the Brooklyn Nets carving up their defense early Friday night, the Rockets decided they didn't need to hear any more from their coaches. The only way they could solve things was by themselves.\n\n\"We just said, you all stay out for a second. Let us talk,\" Chris Paul said. \"At some point, enough is enough.\"\n\nPaul had 32 points, 11 assists and seven rebounds, Carmelo Anthony added a season-high 28 points and Houston snapped a four-game losing streak with a 119-111 victory.\n\nClint Capela finished with 22 points and 13 rebounds, and Eric Gordon contributed 21 points for the Rockets, who had stumbled to a 1-5 start a season after winning 65 games and falling a game short of the NBA Finals.\n\n\"We had to watch it, we had to look at it and we had to kind of just hold ourselves accountable to what's going on out there,\" Anthony said. \"Look our own selves in the mirror as individuals, as a team, figure out what we wanted to do and tonight we did that.\"\n\nThey did thanks to one of the best games as a Rocket for Paul, who had season bests in points and assists in the final game before his workload should ease Saturday with the expected return of James Harden. The league MVP missed his third straight game with a strained left hamstring and coach Mike D'Antoni said he would probably return for the second half of a back-to-back in Chicago.\n\nAnthony bounced back from a 2-for-12, eight-point performance against Portland by coming off the bench to hit six 3-pointers.\n\nCaris LeVert scored 29 points for the Nets, who got off to a sizzling start before the Rockets turned around the game.\n\nOne of the NBA's most potent offenses had been held below 90 points in two of the previous three games after doing so only three times all last season. The offense was back Friday, but the defense took a while to get going.\n\nBrooklyn made 14 of its first 18 shots, including 13 of 14 inside the 3-point arc while simply driving by defenders. The Nets finished 15 of 21 in the opening quarter, taking a 32-25 lead. Paul kept the Rockets close with 13 points in the second, including a deep 3-pointer that cut it to 61-56 at halftime\n\nThe Rockets then surged ahead with an 11-0 run in the third, with Anthony making two 3-pointers, a jumper and blocking a shot as Houston went ahead 76-69. Anthony hit two more 3s in the fourth.\n\n\"Third quarter was where they got their break,\" Nets coach Kenny Atkinson said. \"We've had some issues there before and felt like they came out more aggressive and thought we missed some shots. They picked up their defense. I felt that.\"\n\nTIP-INS\n\nRockets: Houston avoided matching its longest skid of last season. The Rockets dropped five in a row from Dec. 20-29. ... Paul's highest-scoring game with the Rockets is 37 points last Jan. 10 against Portland.\n\nNets: Atkinson said there was no decision yet if rookies Rodions Kurucs and Dzanan Musa would play for Long Island on Saturday in its season opener. Both players worked out with the G League affiliate this week. ... The Nets scored 26 of their 32 first-quarter points in the paint, marking their most points in the paint in a quarter since having 26 in the first on Dec. 7, 2016, against Denver.\n\nHARDEN'S HOPES\n\nHarden has worked out without discomfort and D'Antoni said he likely would have returned Friday if the Rockets had been off following the game.\n\nBut because they were playing on two straight nights and he wouldn't use Harden on both of them after returning from injury, D'Antoni is opting to wait the extra day and bring Harden back Saturday at Chicago.\n\nThe league MVP was hurt near the end of a loss to Utah on Oct. 24 and Houston had been routed in both games since.\n\nALL FOULED UP\n\nD'Antoni said before the game there was no explanation for Houston's offensive troubles, saying the Rockets were getting the same shots as last season, just shooting them 20 percent worse.\n\n\"Foul shots not going in. You don't change up a foul shot. We're not even making those,\" D'Antoni said. \"So we've obviously got some kind of malaise over us that we've got to shrug off and get going.\"\n\nThe Rockets entered shooting 70.2 percent at the line, 27th in the NBA, after finishing ninth last season at 78.1 percent.\n\nUP NEXT\n\nRockets: Visit Chicago on Saturday.\n\nNets: Host Philadelphia on Sunday.\n\n---\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995324.141584
}