{
  "game_id": "0022200472",
  "espn_id": "401468627",
  "date": "Dec 21, 2022",
  "matchup": "ORL @ HOU",
  "headline": "Magic rally past Rockets 116-110 for 7th win in 8 games",
  "body": "HOUSTON -- — Franz Wagner scored 25 points, rookie Paolo Banchero had 23 points and 13 rebounds, and the Orlando Magic overcame a 15-point second-half deficit to beat the Houston Rockets 116-110 on Wednesday night.\n\n\r\n              The Magic took their first lead when Cole Anthony, who finished with 15 points, drilled a 3-pointer to make it 96-95 with 7:11 remaining. Orlando has won seven of eight since beginning the season 5-20.\n\n\r\n              “It felt like we were up for a while before then, because I thought we were outplaying them,” Anthony said of his big shot. “I wasn’t even looking at the scoreboard.”\n\n\r\n              Kevin Porter Jr. scored 31 points for the Rockets, who dropped their fourth straight. Jalen Green had 21 points and eight rebounds, Kenyon Martin Jr. scored 18 points, and Alperen Sengun had 13 points, 12 rebounds and six assists.\n\n\r\n              Houston led 64-54 at halftime and 77-62 with 8:24 left in the third quarter before Orlando began its rally. The Magic pieced together a 17-2 run capped by a dunk by Wagner that tied the game at 79-all with 2:59 left in the period.\n\n\r\n              Orlando switched to a zone defense in the second half.\n\n\r\n              “Our coaches did a great job of recognizing we needed to change something up,” Magic coach Jamahl Mosley said. “Going into the zone, I think was a great change up to just give a different look. Our guys understood that we just had to get some energy and momentum going, and that gave us what we needed.”\n\n\r\n              Porter said the defensive switch shouldn't have rattled the Rockets.\n\n\r\n              “We just got static, that zone, it really wasn’t anything,” Porter Jr. said. “It was kind of like a man zone where you get the ball in the middle and they flare out and man up. We knew exactly what they were doing, we just weren’t moving fast enough. We were too slow when they got in that zone.”\n\n\r\n              Leading 102-100 with 4:08 left in the game, the Magic went on an 8-2 run capped by a 3-pointer by Wagner. Banchero later had an emphatic one-handed slam to make it 114-108 with 48 seconds left. It was his 20th game scoring 20 points or more, the most among rookies, and his sixth double-double.\n\n\r\n              Moritz Wagner chipped in 12 points and seven rebounds and Markelle Fultz scored 11 points for the Magic.\n\n\r\n              “We weren’t switching up into guys, they were making more 3s, they were attacking us one-on-one, getting to mid-range shots that were partly contested,” Rockets coach Stephen Silas said. “But it wasn’t necessarily hard on them to score in the second half.”\n\n\r\n              QUESTION ANSWERED\n\n\r\n              Franz Wagner, who scored 12 of his points in the third quarter, had been questionable to play with a sprained right ankle.\n\n\r\n              “We talk about his competitive nature and his edge. He wants to get things done,” Mosley said.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Chuma Okeke (left knee) had arthroscopic surgery on Tuesday and will be re-evaluated in four weeks. “I do feel for Chuma and he’s going to do a great job getting himself back to the court,” Mosley said.\n\n\r\n              Rockets: Jae’Sean Tate (ankle) and Garrison Mathews (illness) were out. ... After going 8 for 53 from 3-point range the last two games, Houston hit 17 against Orlando. \n\n\r\n              UP NEXT\n\n\r\n              Magic: Host San Antonio on Friday.\n\n\r\n              Rockets: Host Dallas on Friday to conclude a seven-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994639.4941409
}