{
  "game_id": "0022300356",
  "espn_id": "401584984",
  "date": "Dec 18, 2023",
  "matchup": "DEN vs. DAL",
  "headline": "Murray scores 22 points as Nuggets race by Doncic and Mavericks 130-104",
  "body": "DENVER -- — Jamal Murray's strained hamstring is on the mend. So are his two sprained ankles. He's feeling more and more like smooth-scoring playoff Murray. \n\n\r\n              The Denver guard finished with 22 points, going 4 for 4 from 3-point range, to help the Nuggets race past the short-handed Dallas Mavericks 130-104 on Monday night.\n\n\r\n              “I’m doing fine. I can’t complain,” Murray said of his rhythm after being in and out of the lineup and missing 15 games this season for the reigning NBA champions. “I think we’re still just trying to, not find our rhythm, but all be on the court healthy at one time.\" \n\n\r\n              Aaron Gordon tied a season high with 21 points, while Nikola Jokic added eight points, nine rebounds and seven assists in a game where the Nuggets starters got the fourth quarter off. The Denver bench outscored the Mavericks reserves by a 62-34 margin. The Nuggets had four players in double figures, led by Reggie Jackson with 18.\n\n\r\n              “I thought our bench was really good tonight,” Nuggets coach Michael Malone said. “That group played the right way, building good habits.”\n\n\r\n              Leading 77-70 with 6:48 remaining in the third, the Nuggets pulled away on the strength of a 21-10 run to close out the quarter, bouncing back from a home loss to Oklahoma City over the weekend.\n\n\r\n              “They were playing great,” said Luka Doncic, who had 38 points and 11 rebounds despite feeling under the weather. “But everybody played great on their team. They were just sharing the ball. There was a lot of open shots for them. They played a really good game.”\n\n\r\n              Denver's strategy against the Mavericks was simple: Keep pushing the pace. The Nuggets held a 32-11 advantage in fast-break points.\n\n\r\n              “We just felt like we could get out and run — especially at home, at altitude,” explained Murray, who averaged 26.1 points in the playoffs last season. “We did a good job of trying to keep them off-balance.”\n\n\r\n              Doncic scored 22 points in the second quarter to keep Dallas close. He also had 11 rebounds. The Mavericks were missing Kyrie Irving (heel), Josh Green (elbow), Maxi Kleber (toe) and Dereck Lively II (ankle).\n\n\r\n              “When we can’t score and we can’t get stops, that’s not a great recipe to win,” Mavericks coach Jason Kidd said. “We have to be better.”\n\n\r\n              Tim Hardaway Jr. made two 3-pointers to move past his father, Tim Hardaway Sr., for 44th on the league's career 3-pointers list.\n\n\r\n              Kentavious Caldwell-Pope finished with nine points in his return to the lineup after missing two games while being in concussion protocol. He also helped cool off Doncic, who went 3 of 8 in the second half. Doncic was 10 of 16 in the first half.\n\n\r\n              Jokic and Markieff Morris were on the floor against each other for the first time since their scuffle on Nov. 8, 2021. In that game, Morris, who was with the Miami Heat at the time, elbowed Jokic in the midsection at half court. Jokic retaliated with a hard shove from behind with his upper arm/shoulder that knocked Morris to the floor. Morris ended up missing four months due to whiplash. Jokic drew a one-game suspension. \n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host the Los Angeles Clippers on Wednesday.\n\n\r\n              Nuggets: Start a three-game trip Wednesday at Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996765.008794
}