{
  "game_id": "0022200320",
  "espn_id": "401468475",
  "date": "Nov 30, 2022",
  "matchup": "DEN vs. HOU",
  "headline": "Murray, Jokic guide Nuggets to 120-100 rout of Rockets",
  "body": "DENVER -- — Jamal Murray scored 26 points, Nikola Jokic had 10 of his 12 assists in the first half and the Denver Nuggets cruised past the Houston Rockets 120-100 on Wednesday night for their fourth straight win. \n\n\r\n              Jokic added 17 points and nine rebounds in just 27 minutes. Aaron Gordon scored 20 points and Bruce Brown had 18 for Denver, which never trailed in beating Houston for the second time in three days. \n\n\r\n              The Nuggets built a 74-47 halftime lead with Jokic taking just two shots. He instead spent most of the half passing to Murray and other open teammates for easy buckets. \n\n\r\n              “I think it's just me getting back to form,” Murray said on his improving two-man game with Jokic as Murray regains confidence following knee surgery. “He's been waiting on me to back cut or screen for him. From the first game to now, you guys have seen the improvement.” \n\n\r\n              No first-half dish was finer than when Jokic had to lunge to grab Kentavious Caldwell-Pope's overthrown pass on the run near the baseline, then threw a behind-the-back bounce pass to Brown for a dunk. \n\n\r\n              “I didn't think he saw me,” Brown said. \n\n\r\n              Kevin Porter Jr. scored 23 points and Alperen Sengun had 18 points and 11 rebounds for the Rockets, who fell behind 6-0 and 13-2 and trailed by as many as 33 points. \n\n\r\n              “Against teams like this, Phoenix and Golden State, you can’t just ease into these games,” Rockets coach Stephen Silas said.\n\n\r\n              After Houston cut the deficit to 19 midway through the fourth quarter, an agitated coach Michael Malone put the starters back in and Jokic quickly hit a jumper and 3-pointer and then fed Caldwell-Pope for a layup. \n\n\r\n              Malone said his team's pattern of playing only one strong half is “not good enough.” \n\n\r\n              “I said to the coaches at halftime, ‘I’m more nervous now being up whatever we were up than I was before the game,'” Malone said. “I know this team. I've seen it time and time and time and time again. It's frustrating.” \n\n\r\n              The Nuggets shot 65.4% from the field and scored a season-high 44 points in the first quarter in building a 20-point lead. The bench doubled the advantage over the final three minutes with Vlatko Cancar (13 points) contributing two 3-pointers and a driving dunk after one of Houston's six turnovers. \n\n\r\n              About the only bright spot for the Rockets, who fell to a Western Conference-worst 5-16, was the play of Sengun. The second-year big man, who grew up idolizing Jokic, shook off a hard fall in the first half and hit 8 of 12 shots, including a coast-to-coast dunk.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: The 44 points allowed in the first quarter were a season-high. The previous worst was 42, scored by Denver two nights earlier. ... F Jae’Sean Tate (right ankle) is still at least a couple weeks away from returning. “We really miss him,” Silas said. \n\n\r\n              Nuggets: G Bones Hyland (illness) was active, but Malone held him out. ... Fs Michael Porter Jr. (left heel) and Jeff Green (right knee) did work on the floor before the game. Both have missed four straight games.\n\n\r\n              SURVIVING THE SCHEDULE\n\n\r\n              Denver played just its eighth home game, fewest in the NBA, and begins a two-game trip Friday. Despite that, the Nuggets moved to 14-7 and remained a game behind West-leading Phoenix. \n\n\r\n              “When the schedule came out in August, I knew getting through October and November was going to be a challenge. And that was if we were fully healthy, which we’re not,” Malone said. “So that’s really remarkable for us to be where we’re at.” \n\n\r\n              UP NEXT\n\n\r\n              Rockets: Four-game trip continues Friday night at Phoenix. \n\n\r\n              Nuggets: At Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994724.9224498
}