{
  "game_id": "0021900836",
  "espn_id": "401161478",
  "date": "Feb 22, 2020",
  "matchup": "CHA vs. BKN",
  "headline": "Luwawu-Cabarrot scores 21 as Nets defeat Hornets 115-86",
  "body": "CHARLOTTE, N.C. --  Timothe Luwawu-Cabarrot and the Brooklyn Nets appeared to be on a mission after surrendering a 20-point lead in their last game.\n\nAnd it showed with almost every Nets player that played.\n\nLuwawu-Cabarrot led a balanced scoring attack with 21 points and the Nets built a 25-point lead in the third quarter and didn't let up, snapping the Charlotte Hornets' three-game win streak with a 115-86 victory Saturday night.\n\nEight Brooklyn players scored in double figures, including Caris LeVert with 17. Garrett Temple added 15 points and 10 rebounds, Jarrett Allen had 12 points and 11 rebounds and the Nets bounced back from an overtime loss in Philadelphia on Thursday.\n\n\"We want more than what we have right now. We just want more,\" Luwawu-Cabarrot said. \"We're hungry.\"\n\nBrooklyn built a 10-point halftime lead and outscored the Hornets 33-13 in the third quarter to take control. This time, the Nets didn't let the lead slip away.\n\n\"We played with a chip on our shoulder,\" said Nets coach Kenny Atkinson. \"I think we wanted to prove something. I felt it before the game in the locker room. We feel like we can still do something special.\"\n\nP.J. Washington had 16 points for the Hornets.\n\n\"They were just making shots pretty much the whole game, getting offensive rebounds and getting stops and getting out in transition,\" Washington said. \"We couldn't really stop them from hitting corner 3s.\"\n\nAtkinson was pleased with the balanced scoring in the aftermath of the team's announcement that point guard Kyrie Irving would not return to play this season.\n\n\"The ball was hopping tonight,\" Atkinson said. \"It was moving around; guys were touching it. But with all that being said, we miss Kyrie and we need Kyrie. Badly. So, it was a good performance, I'm very pleased. Was very pleased by the maturity we showed.\"\n\nThe Hornets managed to beat the Bulls in Chicago on Thursday night without co-leading scorer Devonte Graham scoring a point. But they couldn't replicate the feat against the Nets with Graham struggling again from the field. One of the league's most improved players this season, Graham was limited to six points on 1-of-10 shooting by the Nets.\n\nThe Nets are in the midst of a stretch of eight of 10 games on the road. They are 3-2 so far during that run.\n\nTIP-INS\n\nNets: Former North Carolina Tar Heel Theo Pinson received a big cheer when he scored his first points late in the fourth quarter. ... Spencer Dinwiddle had 10 points, nine assists and six rebounds.\n\nHornets: Malik Monk has scored 15 or more points in six straight games, the longest streak of such games since he had seven straight in 2018. ... Bench was outscored 50-27.\n\nGRAHAM'S SLUMP\n\nHornets coach James Borrego said Graham's slump is in part due to how much attention other teams are paying him. But he said it's up to the second-year guard to continue to fight through the pressure and improve.\n\n\"He just has to keep grinding and working his way through it,\" Borrego said. \"You don't hang your head. You just keeping working and grow. I hope the next team throws the full bucket at him again. That's how you grow and adapt to this league and get better.\"\n\nZONED UP\n\nThe Nets used a zone defense at different points in the game and it seemed to rattle the Hornets.\n\n\"I think the zone really disrupted us, took us out of our little motions so credit to them they were just better than us tonight,\" Monk said.\n\nUP NEXT\n\nNets: Host the Orlando Magic on on Monday night.\n\nHornets: Visit the Indiana Pacers on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764996051.5556638
}