{
  "game_id": "0021600750",
  "espn_id": "400900155",
  "date": "Feb 03, 2017",
  "matchup": "OKC vs. MEM",
  "headline": "Westbrook's 38, triple-double lead Thunder past Grizzlies",
  "body": "OKLAHOMA CITY --  For three quarters, Russell Westbrook did most of his damage passing and rebounding.\n\nOnce his shot started falling, the Memphis Grizzlies were finished.\n\nWestbrook scored 19 of his 38 points in the fourth quarter and had a triple-double to lead the Oklahoma City Thunder in a 114-102 victory Friday night.\n\nWestbrook, the NBA's leading scorer, shot just 4 of 14 from the field in the first three quarters. He bounced back and went 4 of 6 from the floor and 9 of 9 on free throws in roughly nine minutes of action in the fourth. He scored Oklahoma City's last 15 points, all in the final 2:35.\n\n\"He's amazing that, in that pressure moment, he's just like, man, loves it,\" Thunder center Steven Adams said. \"That's what's awesome.\"\n\nThe Thunder trailed 89-85 when Westbrook checked back into the game, and they outscored the Grizzlies 29-13 the rest of the way.\n\nWestbrook also had 13 rebounds and 12 assists. It was his 25th triple-double this season and the 62nd of his career. His season total is the most in the NBA since Wilt Chamberlain had 31 during the 1967-68 season.\n\nAdams had 16 points and 13 rebounds, Joffrey Lauvergne scored a season-high 16 and Anthony Morrow added 15 points for the Thunder, who snapped a three-game losing streak.\n\nWestbrook said it was an important win following a blowout loss to Chicago on Wednesday.\n\n\"Definitely, especially when you get outplayed,\" he said. \"Tonight, we came out and were the more physical team and set the tone in that aspect.\"\n\nMarc Gasol scored 31 points, Mike Conley had 18 and Zach Randolph added 16 for the Grizzlies, who shot 48 percent overall but just 3 of 19 on 3-pointers.\n\nThe Thunder closed the first half strong to lead 58-48 at the break. Westbrook had 10 points, eight assists and seven rebounds at halftime. Conley had 13 points for the Grizzlies.\n\nWestbrook got his 10th assist on Victor Oladipo's layup with 7:28 left in the third quarter, and had nine rebounds when he sat for a rest late in the period. While he was out, Memphis took advantage. Conley's bank shot with 2.3 seconds left in the third gave the Grizzlies an 82-80 lead heading into the fourth.\n\nWestbrook clinched the triple-double on a rebound with 6:49 remaining, but the Thunder still trailed. His 3-pointer with about two minutes to go put the Thunder ahead 105-102. He drained another 3 with 1:25 left to push the lead to six, and Oklahoma City controlled the game from there.\n\n\"We had a breakdown on the pick-and-roll the first 3 that he hit,\" Grizzlies coach David Fizdale said. \"The second one, he just raised up and hit a bomb. That's when the game was done.\"\n\nTIP-INS\n\nGrizzlies: Committed just 12 turnovers. ... Vince Carter led the team with seven points in the first quarter. He didn't score again. ... Made 12 of 15 field goal attempts in the third quarter.\n\nThunder: G Alex Abrines missed his third straight game with back spasms. ... Shot 55 percent in the first half. ... Committed 20 turnovers.\n\nSTAT LINES\n\nGasol went 3 for 9 and scored eight points in the first half. He was 11 of 15 for 23 points in the second half.\n\n\"Second half, he came out more aggressive and he was just making shots,\" Adams said. \"Good player like that is going to make those. Just going to have to live with those.\"\n\nQUOTABLE\n\nWestbrook, on a steal he had in the fourth quarter: \"My closeout speed is not bad.\"\n\nUP NEXT\n\nThe Grizzlies play at the Minnesota Timberwolves on Saturday.\n\nThe Thunder host the Portland Trail Blazers on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995279.330684
}