{
  "game_id": "0022000722",
  "espn_id": "401307512",
  "date": "Mar 31, 2021",
  "matchup": "MIA @ IND",
  "headline": "Heat turns up defensive pressure in 92-87 win at Indiana",
  "body": "INDIANAPOLIS -- — Duncan Robinson and Jimmy Butler provided the scoring punch for Miami on Wednesday night.\n\n\r\n                    It was their defense that changed the game.\n\n\r\n                    Together, the undrafted guard and the All-Star forward combined for the first six points in a decisive fourth quarter run and then helped Miami hold Indiana to five points over the final seven minutes for a 92-87 victory.\n\n\r\n                    “It’s not like an overnight improvement. You’re literally talking about hundreds of days of development,\" Miami coach Erik Spoelstra said, referring to Robinson's defense. “He’s making those efforts to get to the 3-point line. His technique has worked because of all that work.\"\n\n\r\n                    Spoelstra had no quibbles with Robinson's offensive effort, either.\n\n\r\n                    Robinson finished with 20 points, eight rebounds and four assists, making six 3-pointers. Butler had 18 points as Miami won its second straight and avoided a three-game sweep in the season series with the Pacers.\n\n\r\n                    Indiana was led by Myles Turner with 15 points and Caris LeVert and Doug McDermott, who each had 14. The Pacers have lost two straight overall and seven of their last eight at home. This one came like so many others recently — a bad fourth quarter.\n\n\r\n                    “I’d say it has more to do with the defense than the offense,\" McDermott said. “I wouldn’t say we relax but when you’re playing a great team like the Miami Heat, you know they're not going to stop. And they got hot.\"\n\n\r\n                    Miami spent most of the night playing catch-up and finally overtook Indiana when Robinson made his fifth and sixth 3-pointers for a 79-78 lead with 7:44 to go. After trading baskets and the lead for several possessions, Butler and Robinson swung the game with three straight buckets, and Bam Adebayo's 7-footer with 1:06 left made it 89-82.\n\n\r\n                    The Heat defense took care of the rest.\n\n\r\n                    “I like the growth of this team,\" Spoelstra said. “Early on if the ball wasn’t going in, we weren’t defending. Now we're able to do some things even when things aren’t functioning.\"\n\n\r\n                    Indiana led 45-32 in the second quarter but Miami scored the final 11 points of the half to get within 45-43. The Pacers answered by scoring the first 13 points of the second half then gave up 11 straight as the Heat pulled within 58-54 midway through the third and got as close as 67-65 after three.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Adebayo finished with 16 points, extending his career-long streak of consecutive double-figure games to 34. He also had eight rebounds and seven assists. ... Robinson also had eight rebounds. Tyler Herro had 17 points. \n\n\r\n                    Pacers: At 21-25, the Pacers are under .500 at their latest point in the season since being 39-40 in 2016-17. ... Jeremy Lamb sat out with a sprained right toe. ... Turner finished with six rebounds and three blocks despite picking up his fifth foul with 6:05 left in the third quarter. ... T.J. McConnell had 11 points, seven rebounds and five assists. ... LeVert had six assists and four steals.\n\n\r\n                    SABONIS HURT\n\n\r\n                    Pacers All-Star Domantas Sabonis came up just short of his customary double-double with 14 rebounds and nine points. And there may have been a reason why. He was grimacing noticeably late in the game.\n\n\r\n                    “I talked to him during the game and he took a knee to that quad,\" Pacers coach Nate Bjorkgren said. “But he’s tough and I know he’ll be fine. He just took a hard knee there.\"\n\n\r\n                    OLADIPO DEBUT\n\n\r\n                    Two-time All-Star Victor Oladipo did not play against his former team and still hasn't suited up for the Heat. That's expected to change Thursday. Oladipo was traded from Indiana to Houston for LeVert in January and was dealt again last week, this time from Houston to the Heat. Oladipo can become a free agent after this season. \n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Begin a four-game homestand Thursday against Golden State.\n\n\r\n                    Pacers: Host Charlotte on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996774.33952
}