{
  "game_id": "0021800681",
  "espn_id": "401071357",
  "date": "Jan 19, 2019",
  "matchup": "DAL @ IND",
  "headline": "Pacers defense shuts down Doncic, Mavs in 111-99 victory",
  "body": "INDIANAPOLIS --  Indiana Pacers coach Nate McMIllan threw everything he could at rookie Luka Doncic.\n\nMcMillan asked defensive whiz Victor Oladipo to challenge Doncic's shots, outmuscle him on the perimeter and stay in front when Doncic drove. When the calls didn't go his way and the shots didn't fall, Doncic got frustrated and then ejected.\n\nHe finished with his lowest point total in more than a month, and the Pacers pulled away from the Dallas Mavericks for a 111-99 victory on Saturday night.\n\n\"We made him uncomfortable,\" Pacers center Myles Turner said. \"It was a team effort. We were just trying to get more physical with him.\"\n\nIt worked out quite well.\n\nWhile Tyreke Evans scored 19 points and Domantas Sabonis added 16 points and 11 rebounds, Indiana won for the third time in four games because it stymied one of the league's bright young stars with a stellar defensive effort.\n\nDoncic finished with eight points on 3-of-14 shooting. He was 0 for 5 on 3-pointers and 2 of 4 on free throws. And after Doncic drew his second technical foul, with 3 minutes left in the third quarter for kicking the ball, the Mavericks (20-25) never had a chance.\n\n\"I wasn't playing well. For sure, it was one of the worst games I've played this season, so yes I was frustrated,\" the 6-foot-7 Doncic said, joking that he briefly was playing soccer. \"I didn't know I would be ejected because there are different rules in Europe.\"\n\nOladipo had 12 points, eight rebounds and six assists in addition to his defensive effort.\n\nDallas closed to 92-83 on Devin Harris' layup with 8:28 to play, but Indiana answered with a 13-5 spurt to seal the victory.\n\nHarrison Barnes led Dallas with 20 points. DeAndre Jordan had 15 points and 16 rebounds in the Mavs' third straight loss.\n\n\"We got up and pressured the ball and tried to disrupt their rhythm,\" McMillan said. \"I thought Vic did a nice job on the ball.\"\n\nTIP-INS\n\nMavericks: Wesley Matthews had 17 points. ... Doncic was trying to become the first rookie to score 25 points in six straight games since Tim Duncan in February 1998 and the first rookie to record 25 points, five rebounds and five assists in five consecutive games since Michael Jordan did it twice in 1984-85. ... Jordan has 27 double-doubles this season.\n\nPacers: McMillan moved within one victory of tying Jim O'Brien (121) for No. 9 on the Pacers' NBA victory list. McMillan needs two wins to become the 26th coach in league history with 600 wins. ... Indiana hasn't lost back-to-back games since Dec. 18-19. ... Darren Collison scored 16 points.\n\nBASKETBALL DAY IN INDIANA\n\nSaturday's game capped the third annual daylong celebration of basketball around the state.\n\nThe 14-hour marathon featured two high school games played at Bankers Life Fieldhouse, three additional high school games that were televised, the Indiana-Purdue game in West Lafayette and the St. John's-Butler game just a few miles away from the Pacers' home court. It was also Hickory night, a promotion that began by honoring the movie \"Hoosiers.\"\n\nIn addition, Indiana State held a reunion to celebrate the 40th anniversary of its national runner-up team, which featured Hall of Famer Larry Bird.\n\nROOTING FOR DIRK\n\nIf this was Dirk Nowitzki's final game in Indy, Pacers fans gave him a send-off he'll remember.\n\nWhen he entered in the first half, the crowd roared. In the fourth quarter, with the crowd chanting \"We want Dirk,\" he re-entered with 2:59 to play.\n\nNowitzki also had a tough night, going scoreless for the third time this season. He finished 0 for 5 from the field, all on 3s, and had one rebound and one block in a little less than 10 minutes.\n\n\"It was fun being out there, seeing how much respect he has around the league,\" said Turner, who grew up in Dallas. \"The last minute of the game, yeah, I wanted him to get a basket.\"\n\nUP NEXT\n\nMavericks: Head to Milwaukee for an afternoon game Monday.\n\nPacers: Host Charlotte on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995451.3442419
}