{
  "game_id": "0022300664",
  "espn_id": "401585292",
  "date": "Jan 29, 2024",
  "matchup": "MIN @ OKC",
  "headline": "Edwards scores 27 as Timberwolves top Thunder 107-101 in a matchup of Western Conference leaders",
  "body": "OKLAHOMA CITY -- — Anthony Edwards scored 27 points and the Minnesota Timberwolves beat the Oklahoma City Thunder 107-101 on Monday in a matchup of teams that entered the night tied atop the Western Conference standings.\n\n\r\n              Thunder coach Mark Daigneault called this one an “elevated game” for its intensity. There were 24 lead changes and six ties.\n\n\r\n              “I think it was a great game,” Edwards said. “Great effort by both teams. Great job by both coaches. I feel like we just made more plays down the stretch.”\n\n\r\n              Karl-Anthony Towns had 21 points and 10 rebounds, and Rudy Gobert added 12 points and 17 rebounds for Minnesota, which had lost three of five. \n\n\r\n              Edwards did his damage on 10-for-20 shooting.\n\n\r\n              “Anthony did a really good job with picking his spots, trusting his teammates, playing clean and quick, getting downhill, putting the pressure on them,\" Minnesota coach Chris Finch said. \n\n\r\n              Shai Gilgeous-Alexander scored 37 points and Jalen Williams added 20 for the Thunder, who lost their second straight after a five-game win streak. \n\n\r\n              The teams split four meetings this season.\n\n\r\n              “It’s why we play the game,” Gilgeous-Alexander said. “You play to play the best teams in the league. You wake up for games like that. You really get to test yourself and see where you are. It was a dogfight tonight.”\n\n\r\n              Oklahoma City's Chet Holmgren, one of the NBA's top rookies, finished with just four points on 2-for-9 shooting in 32 minutes.\n\n\r\n              “We did a good job of defending him and just made him take tough shots, and I could see it for him, you know, he was trying to get his teammates open, so he was just playing team basketball,\" Towns said. \n\n\r\n              The Thunder led 97-96 with 2:43 remaining before Minnesota took control. A two-handed dunk by Edwards down the middle of the lane in traffic put the Timberwolves up 101-97, and Minnesota led by at least four the rest of the way.\n\n\r\n              The Timberwolves won despite point guard Mike Conley sitting out his second straight game with a sore left hamstring.\n\n\r\n              “We really did a good job of finishing this game, which we haven’t been doing,\" Finch said. \"So hopefully it’s a good step and we can build on that part of it.”\n\n\r\n              Minnesota led 49-47 at halftime behind 13 points apiece from Edwards and Towns.\n\n\r\n              Edwards hit a 3-pointer two minutes into the second half to put the Timberwolves up 56-47. \n\n\r\n              The Thunder rallied, and a dunk by Williams gave them a 63-62 edge midway through the third quarter. Williams' 3-pointer with 1.3 seconds left in the third put Oklahoma City up 77-73. Gilgeous-Alexander scored 12 points in the period.\n\n\r\n              In the end, the young Thunder, with many players still adjusting to the length of the season, struggled on the second night of a back-to-back and their third game in four days.\n\n\r\n              “It’s hard just getting adjusted to,\" Gilgeous-Alexander said. \"Now, with that being said, the NBA doesn’t care. Your opponents don’t care. Nobody cares. You’ve got to fight through it and get it done.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Dallas Mavericks on Wednesday night.\n\n\r\n              Thunder: Host the Denver Nuggets on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996687.3722
}