{
  "game_id": "0021801106",
  "espn_id": "401071779",
  "date": "Mar 25, 2019",
  "matchup": "POR vs. BKN",
  "headline": "Blazers lose Nurkic to severe leg injury, edge Nets in 2 OTs",
  "body": "PORTLAND, Ore. --  They had just clinched a playoff spot, though there were no cheers or celebrations from the Portland Trail Blazers. Instead, just silence and prayers for Jusuf Nurkic.\n\nThe gruesome injury suffered by their center overshadowed everything else Monday night.\n\n\"Devastating,\" Blazers coach Terry Stotts said.\n\nNurkic had 32 points and 16 rebounds before suffering his left leg injury in the second overtime, and the Blazers outlasted the Brooklyn Nets 148-144.\n\n\"It made me sick to my stomach,\" Blazers guard Damian Lillard said of Nurkic's injury. \"As I was walking over there, I saw everyone else turn around real quick and walk away, and then I look and I saw his leg.\"\n\nNurkic was hurt when his leg bent awkwardly as he battled for an offensive rebound. His leg was immobilized and he was removed on a stretcher while surrounded by members of both teams. Nurkic was then transferred to a local hospital and the team said he sustained compound fractures to his left tibia and fibula.\n\nAfter the injury, Blazers made enough plays to get the win, but then reality hit.\n\n\"He wouldn't want us to say, `All right, let's feel sorry for ourselves and feel sorry for Nurk and not care as much,\" Lillard said. \"So we're going to finish the job, try to get the game, but I think after the game, that's when it kicks in.\"\n\nThe Blazers held a collective moment of silence and prayer for Nurkic in the locker room following the game.\n\n\"I'm just going to go home and pray for him,\" Blazers center Enes Kanter said. \"This is bigger than basketball. We clinched the playoff spot but we can't even celebrate. He was a big part of our family. Not our team, our family.\"\n\nThe Nets, who watched guard Caris LeVert wheeled off the court after an injury earlier this season, had the same concern for Nurkic.\n\n\"That's what our guys are talking about in the locker room,\" Nets coach Kenny Atkinson said.\" Not the game or the loss. They're talking about a player who was having a great game and a heck of a player so you just pray it's not a long-term thing and he can bounce back. It just takes the wind out of your sails.\"\n\nThe Blazers are already without starting shooting guard CJ McCollum.\n\n\"You never want to see that with your friend or your teammate, and then especially as a player, you don't want to see anyone have to go through that and it's also going to be hard on our team,\" Lillard said. \"CJ's already out, now (Nurkic) having a tough injury, so every way you look at it, it was a blow.\"\n\nNumerous NBA players, as would be expected, quickly expressed sorrow and sent messages of support on social media after seeing the extent of the injury.\n\n\"Hate this part of the game. Prayers up for Nurkic!,\" Miami's Dwyane Wade tweeted.\n\n\"Never, never give up, my man Jusuf Nurkic.... I know it's hard ... but you'll come back to play ... I'll wait for you !!!\" offered Danilo Gallinari of the Los Angeles Clippers.\n\nLillard finished with 31 points and 12 assists for Portland, while D'Angelo Russell had 39 points, nine rebounds and eight assists for Brooklyn.\n\nNurkic's basket made it 134-132 with 3:40 to go into the second overtime. With center Jarrett Allen and Ed Davis having fouled out and the Nets left without a big man, Nurkic had a huge advantage inside whenever he posted up or went for rebounds.\n\nBut he was hurt while doing so. After he was taken off the court, Anfernee Simons made two free throws for Portland to put them up 136-132.\n\nA 3-pointer by Rodney Hood extended the lead to 139-132 forced the Nets to start fouling.\n\nThere were 12 lead changes and 15 ties over the course of the game, with Portland leading 95-90 after three.\n\nThe Nets, however, would storm back in the fourth thanks to the play of their bench. Brooklyn took multiple leads in the final period, with their biggest coming at 112-102 with 6:07 left after a jumper by LeVert.\n\nPortland fought back and with the Nets up one with the ball, Seth Curry stole Russell's dribble and was fouled. He missed the first free throw but made the second to tie the game at 120 with 3.5 seconds left.\n\nRussell missed a deep 3-pointer to force overtime.\n\nRussell scored five early points in the extra period, but Portland took a 128-125 lead on Nurkic's basket before a 3-pointer by Spencer Dinwiddie tied the game again.\n\nIt went to a second OT tied at 132 after Russell made a layup and Lillard missed a long final attempt.\n\nTIP-INS\n\nNets: Brooklyn had its two-game winning streak snapped and has one game left on its seven-game road trip, at Philadelphia on Thursday. ... The Nets were just 31 off 44 on free throws.\n\nTrail Blazers: Stotts said McCollum is doing well in his recovery from a knee strain he suffered on March 16, but that he will not join them for their four-game road trip. \"He's progressing fine,\" Stotts said. \"He will not go on the road trip. He will stay back and rehab and get some court work back here.\" The Blazers start the trip Wednesday at Chicago before coming back on April 3.\n\nUP NEXT\n\nNets: Thursday at Philadelphia 76ers.\n\nTrail Blazers: Wednesday at Chicago Bulls.",
  "source": "espn_api",
  "crawled_at": 1764995158.030483
}