{
  "game_id": "0022201180",
  "espn_id": "401469335",
  "date": "Apr 04, 2023",
  "matchup": "BKN vs. MIN",
  "headline": "Edwards, Towns help Wolves edge Nets 107-102, end skid at 3",
  "body": "NEW YORK -- — Anthony Edwards scored 23 points, Karl-Anthony Towns had 22 points, 14 rebounds and five assists, and the Minnesota Timberwolves beat the Brooklyn Nets 107-102 on Tuesday night to snap a three-game losing streak.\n\n\r\n              “Right now every win feels like two, and every loss feels like three. It’s just crazy,” Minnesota coach Chris Finch said. “We desperately needed this game.”\n\n\r\n              Rudy Gobert had 12 points and 12 rebounds, and Mike Conley scored 18 points, nine in the fourth quarter. Minnesota moved within a half-game of eighth-seeded New Orleans, which lost to 121-103 to Sacramento.\n\n\r\n              “It’s a very good feeling, obviously us winning,” Towns said. “We need some teams to lose, and they’re losing.”\n\n\r\n              Spencer Dinwiddie had 30 points and six assists, Mikal Bridges scored 24 points and Dorian Finney-Smith had 14 points and 10 rebounds for the Nets, who had their three-game win streak snapped. Their lead over Miami for the No. 6 seed in the Eastern Conference was cut to one game after the Heat’s 118-105 victory in Detroit.\n\n\r\n              “There were a couple of opportunities where we didn’t keep them away from the rim,” Nets coach Jacque Vaughn said. “That ended up being the difference in the game.”\n\n\r\n              Similar to their first meeting, a 124-123 Nets win, the teams traded momentum in the game, which featured 24 lead changes and eight ties. But Minnesota shot 53% in the fourth quarter and outscored Brooklyn 14-7 over the final 4:06 with Gobert, the three-time NBA Defensive Player of the Year, on the bench.\n\n\r\n              “We knew that we were going to have a matchup (advantage) somewhere,” Finch said. “We put as much shooting out there as we could and felt a little more comfortable guarding everyone on the perimeter, and take nothing away from Rudy; he played a great game.”\n\n\r\n              Towns, who is laboring through a calf strain and illness, gave the Timberwolves the lead for good when he made a pair of free throws with a minute remaining, and Edwards went 4 of 4 at the line in the final 19.1 seconds.\n\n\r\n              “Every day I’m getting closer and closer to 100%,” Towns said. “I think today is the most comfortable I’ve felt in the post since I came back, so it was great.”\n\n\r\n              Dinwiddie had two chances to tie the game with 3-pointers in the final 10 seconds, but Edwards blocked his first attempt, and his second hit the back rim.\n\n\r\n              “The second one I probably could’ve drove it, probably hunted the 3 a little too much,” Dinwiddie said. “The first one was try to get an attempt up just because we didn’t have any more timeouts left.”\n\n\r\n              Minnesota’s length wreaked havoc on Brooklyn’s offense early, and the Nets shot just 29% in the first quarter. Towns had six points, eight rebounds and four assists in the period, and the Wolves led 31-24 after one.\n\n\r\n              “We’ve got a big lineup. I think everyone in the world knows we’re playing a two-big lineup,” Towns said. “We might as well utilize the mismatches we have ... instead of trying to outplay them in a chess game. We can just play checkers.”\n\n\r\n              The Nets found their shooting touch in the second quarter, especially from the outside, where they made 5 of 8 from 3-point range. Finney-Smith hit a pair of 3-pointers in Brooklyn’s 11-0 run, and the Nets outscored Minnesota 30-20 in the second, taking a three-point halftime lead.\n\n\r\n              Brooklyn outscored Minnesota 26-10 over a span of 9:46 between the second and third quarters. The Nets scored the first eight points of the third, building their largest lead, 62-51.\n\n\r\n              “I never felt like, even when they went on their little run, or we were chasing, or they were making some threes, that we weren’t doing what we wanted to do,” Finch said. “We knew it was gonna be like this.”\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Gobert’s double-double was his 34th of the season. …. Towns was listed as questionable but played. Guards Jaylen Nowell (left knee tendinopathy) and Austin Rivers (illness) and forward Naz Reid (left scaphoid fracture) were inactive.\n\n\r\n              Nets: Bridges was named Eastern Conference player of the week Monday after averaging 33 points and 5.7 rebounds over three Nets wins. He entered play averaging 27.6 points, 4.7 rebounds and 2.7 assists in 35.2 minutes per game in 23 games since the Nets acquired him from Phoenix on Feb. 9. \n\n\r\n              UP NEXT Timberwolves: At San Antonio on Saturday. Nets: At Detroit on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994845.548193
}