{
  "game_id": "0022001022",
  "espn_id": "401307830",
  "date": "May 09, 2021",
  "matchup": "ORL vs. MIN",
  "headline": "Towns, Russell each score 27 points, T-Wolves throttle Magic",
  "body": "ORLANDO, Fla. -- — Karl-Anthony Towns and D’Angelo Russell each scored 27 points and the Minnesota Timberwolves built a 30-point halftime lead, led by 43 in the third quarter and cruised to a 128-96 rout of the Orlando Magic on Sunday night.\n\n\r\n                    Rookie guard Anthony Edwards added 16 points and 10 rebounds for his third double-double of the season to help the Timberwolves end a three-game losing streak. Ricky Rubio added 18 points for Minnesota, which made 16 3s and shot 48.5%.\n\n\r\n                    “Winning is a lot more fun and when you’re having fun it’s a lot easier to reinforce what you’ve been trying to sell,” said Minnesota coach Chris Finch, whose team improved to 11-13 in its past 24 games. “The guys can see it working, they’re buying in and doing things to make themselves and their teammates better.”\n\n\r\n                    Russell also had eight assists, six rebounds and five made 3s. The point guard said as the chemistry between himself, Towns and Edwards continues to grow, the Timberwolves could blossom into a playoff contender by next season.\n\n\r\n                    “As a team, we know what (rebuilding) felt like, so now any time we get a lead we’re trying to learn how to step on people’s throats and give our fans a taste of what next season is going to look like,” Russell said.\n\n\r\n                    Orlando dressed 10 players, but only after signing former G League player Donta Hall. R.J. Hampton scored a career-high 19 points off the bench for the Magic. They finished the home schedule 11-25 and won just once at Amway Center after trading away Nikola Vucevic, Evan Fournier, Aaron Gordon and others on March 25.\n\n\r\n                    “We’re in a rebuilding situation, so when we made those trades this is what we’re committed to,” Magic coach Steve Clifford said. “What our fans should expect is that we play hard every night. I don’t think it’s any secret where we’re at, but that doesn’t mean we can’t play hard and with purpose every night.”\n\n\r\n                    Towns, Russell and Edwards combined for 51 points and seven 3-pointers in the first half as the Timberwolves smashed the Magic to the tune of a 74-44 lead at intermission. Towns had 20 points by halftime, while Russell poured in four 3s and 19 points.\n\n\r\n                    The Timberwolves pushed its lead to 89-49 on a Rubio 3 with 7:54 left in the third period. Thirty seconds later it was at 43 when Minnesota capped an 18-5 burst. \n\n\r\n                    “The NBA will bring you to your knees,” Clifford remarked.\n\n\r\n                    ROOKIE CANDIDACY\n\n\r\n                    Finch said he doesn’t need to make a case for Edwards to win the NBA’s Rookie of the Year award because of the nightly statement the guard has put forth. In addition to recently scoring 42 points for a second time — joining LeBron James as the second 19-year-old with multiple 40-point games — Edward ranks first among rookies in scoring (21.6) and second in made 3s (157).\n\n\r\n                    “He’s getting better all the time,” Finch said. “His impact on our team as we get better, his ability to put up big numbers, his ability to score down the stretch of games, close games and make key plays … . His shooting has improved, all of his efficiency has improved and he’s now facing double teams and teams are game-planning for him. I think his (Rookie of the Year) case is extremely strong and he makes it all by himself.” \n\n\r\n                     TIP INS\n\n\r\n                    Timberwolves: Juancho Hernangomez did not play because of swelling in his right knee. … Jarred Vanderbilt got the start as Finch continued to shuffle the lineup while trying to find more rebounding and defense. Minnesota is 2-6 when Vanderbilt starts. … Minnesota’s 74 first-half points tied its season high set previously at Sacramento on April 20.\n\n\r\n                    Magic: Play was stopped for more than 10 minutes in the first quarter when a female fan sitting court side needed attention for a medical emergency. The fan was alert as she was taken off on a stretcher following an apparent seizure. … Orlando closed out the home portion of its schedule. Coming into Sunday, the Magic — one of the few NBA teams to allow fans all season — averaged 3,496 fans at the first 35 home games.\n\n\r\n                     UP NEXT\n\n\r\n                    Timberwolves: At Detroit on Tuesday night.\n\n\r\n                    Magic: At Milwaukee on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764997793.86545
}