{
  "game_id": "401810037",
  "espn_id": "401810037",
  "date": "Nov 06, 2025",
  "matchup": "PHX vs LAC",
  "headline": "Green shines in Suns debut with 29 points, and Phoenix tops undermanned Clippers 115-102",
  "body": "PHOENIX -- — Jalen Green scored 29 points in his Phoenix debut, Devin Booker added 24 points and the Suns beat the short-handed Los Angeles Clippers 115-102 on Thursday night.\n\n\r\n              Green, who missed the Suns’ first eight games with a right hamstring strain, played 23 minutes and was 10 of 20 from the field including 6 of 13 from behind the 3-point line.\n\n\r\n              The guard was acquired from Houston in the offseason in the seven-team trade that sent Kevin Durant from Phoenix to the Rockets.\n\n\r\n              Grayson Allen, playing through an illness, scored 18, Mark Williams had 13 points and nine rebounds and Royce O’Neale scored 17, 11 in the third quarter when Phoenix outscored Los Angeles 40-23 to take a 91-74 lead.\n\n\r\n              The Clippers lost their third straight. They played without James Harden, who missed the game for personal reasons, and Kawhi Leonard, sidelined with a right ankle sprain.\n\n\r\n              Ivica Zubac led the Clippers with 23 points and 11 rebounds. Cam Christie scored 17 off the bench, John Collins had 13 and Bogdan Bogdanovic 12.\n\n\r\n              Bradley Beal, in his return to Phoenix, had a miserable night for Los Angeles. The veteran guard was 2 for 14 from the field and finished with five points. Beal played two seasons in Phoenix but was frequently sidelined by injuries. He was booed during introductions and every time he touched the ball during the game.\n\n\r\n              The Suns took their biggest lead at 104-79 on Allen’s 3-pointer with 7:53 to go.\n\n\r\n              Up next\r\n              The teams meet again Saturday night in Inglewood, California.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042572.883731
}