{
  "game_id": "0021501173",
  "espn_id": "400829060",
  "date": "Apr 07, 2016",
  "matchup": "TOR @ ATL",
  "headline": "Teague, Korver help Hawks hold off Toronto",
  "body": "ATLANTA --  Kyle Korver has been waiting for the Atlanta Hawks to play a complete game against the Toronto Raptors.\n\n\"I thought today was probably the best 48-minute game we've played against them,\" Korver said. \"They are a difficult team to guard. Their guards are very tough and physical.\"\n\nJeff Teague scored 23 points, Korver added 14 and the Hawks held on for a 95-87 victory on Thursday night.\n\nIt was one of the season's best performances for the Hawks, who remained in third place in the Eastern Conference by beating the East's No. 2 seed.\n\nWith Paul Millsap scoring 13 points and Al Horford, Tim Hardaway Jr. and Mike Scott each adding 11, Atlanta used a balanced attack to knock off Toronto for the first time in four tries this season.\n\n\"It was a total team effort,\" Korver said. \"We're working on a few things on defense and some of that helped tonight. It really doesn't matter what your coverage is. I think guys were just really locked in and focused.\"\n\nThe Hawks have won 16 of 21 and are a half-game ahead of Boston for the third spot in the East. Toronto dropped 3 1/2 games behind first-place Cleveland.\n\nKyle Lowry and DeMar DeRozan each finished with 16 points and Jonas Valanciunas had 13 for the Raptors. Toronto has dropped two of three.\n\n\"They came out and played like it meant more to them than it did to us early,\" Raptors coach Dwane Casey said. \"We played like, `OK, we got the second (quarter),' and again, you cannot approach games that way.\"\n\nThe Hawks took their biggest lead at 14 on Horford's 3-pointer early in the fourth. DeRozan's runner pulled Toronto within three with 4:10 left and Lowry missed a 3 that would've tied it with 3:03 remaining.\n\nValanciunas hit a free throw to make it a two-point game in the final minute, but Teague followed with a three-point play -- Atlanta's first field goal since the 6:01 mark -- to put the Hawks up 91-86 with 48 seconds left.\n\n\"They came out aggressive on both ends,\" DeRozan said. \"A team that's fighting for something and a team that we beat three times -- I'm pretty sure that they didn't want to make it a fourth -- so they came out ultra-aggressive.\"\n\nMillsap and Teague each hit a pair of free throws in the last 21 seconds to close out the win.\n\nAtlanta, which outscored the Raptors 22-2 on fast-break points, never trailed after Thabo Sefolosha's 3 made it 13-11 early in the first.\n\nHE'S BACK\n\nRaptors F DeMarre Carroll returned from right knee surgery after missing 41 games. Before getting hurt, he averaged 11.7 and 4.8 rebounds in 23 games. Carroll, in the first season of a four-year, $60 million contract after playing the last two seasons for Atlanta, entered the game in the second quarter, played parts of the third and fourth and finished with five points in 14 minutes.\n\nTIP-INS\n\nRaptors: Missed a second straight chance for their 23rd road victory, which would set a regular-season franchise record. Toronto has 22 road victories for three straight seasons and has chances left this season at New York and Brooklyn. ... Dropped to 16-7 against the East's current top eight seeds.\n\nHawks: G Kent Bazemore missed the game with an injured right knee. Sefolosha, took his place in the starting lineup and scored 10 points. ... It was just Atlanta's second win in the last eight games against Toronto.\n\nUP NEXT\n\nRaptors: Host Indiana on Friday.\n\nHawks: Host Boston on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994689.47383
}