{
  "game_id": "0022300604",
  "espn_id": "401585232",
  "date": "Jan 21, 2024",
  "matchup": "PHX vs. IND",
  "headline": "Kevin Durant scores 40 points, Suns hold off Pacers 117-110 for 5th straight victory",
  "body": "PHOENIX -- — The Big 3 is starting to become a reality for the Phoenix Suns. Now the wins are beginning to follow.\n\n\r\n              Kevin Durant scored 40 points, Devin Booker had 26 and the Suns beat the Indiana Pacers 117-110 on Sunday night for their fifth straight victory.\n\n\r\n              Bradley Beal added 25 points on 11-of-16 shooting for Phoenix, which led for most of the night and took a 91-83 advantage into the fourth quarter. It's the second straight game that the All-Star trio of Durant, Booker and Beal has combined for 91 points.\n\n\r\n              “I felt like they played us straight up,” Durant said. “And when teams do that, we're going to be aggressive.”\n\n\r\n              The Pacers made a few runs early in the final period, but Durant seemed to thwart every rally with another mid-range basket. The 35-year-old star made his first five shots of the fourth quarter.\n\n\r\n              Indiana has lost four of five. Buddy Hield led the Pacers with 18 points, and Pascal Siakam — acquired this week from Toronto — had 15 points and seven assists. All-Star guard Tyrese Haliburton sat out for the sixth time in seven games because of a left hamstring strain.\n\n\r\n              Indiana used a 11-0 run to take a 105-103 lead on Hield's 3-pointer with 3:20 left, but Durant responded again, this time with a 3-pointer, and the Suns wouldn't trail again. Durant made 18 of 25 shots, including 4 of 7 from 3-point range, putting together a big scoring night without taking a free throw.\n\n\r\n              “He's a very unusual problem,” Pacers coach Rick Carlisle said. “I thought we fought him hard, had some good possessions on him, but his ability to rise up off the dribble and get complete clearance is special.”\n\n\r\n              Beal hit three baskets in the final 2:11 that were crucial in helping Phoenix keep the lead. Booker shot just 9 of 24 from the field, including 1 of 7 from 3-point range, but had a crucial steal with about 25 seconds remaining to seal it.\n\n\r\n              The Durant-Booker-Beal trio had a rough start to the season, mainly because of injuries. Beal missed most of the first few months with back and ankle injuries while Booker and Durant have also missed a handful of games.\n\n\r\n              But for the past few weeks, the roster has been whole. It's no coincidence that the team's in the midst of a five-game winning streak.\n\n\r\n              “It's the definition of pick your poison,” Booker said. “All of us coming in with an aggressive mindset, it'll be hard to stop us. Especially late game with the spacing out there.”\n\n\r\n              The Suns jumped out to a 33-25 lead after one quarter, shooting 62% from the field, and held a 65-61 advantage at halftime. Durant had 20 points on 9-of-12 shooting.\n\n\r\n              Indiana's Jalen Smith — who was drafted by the Suns in 2021 and part of the roster that made it to the NBA Finals — had 15 points and four rebounds against his former team.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Denver on Tuesday night.\n\n\r\n              Suns: Host Chicago on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996658.19049
}