{
  "game_id": "0021300850",
  "espn_id": "400489723",
  "date": "Feb 25, 2014",
  "matchup": "POR @ DEN",
  "headline": "Damian Lillard scores 31, hits clutch shots late to key Portland",
  "body": "DENVER -- The Trail Blazers took Denver's best shot -- and the Nuggets took way too many errant shots thanks to Portland's stifling defense.\nDamian Lillard made up for the absence of fellow All-Star LaMarcus Aldridge by scoring 31 points in the Trail Blazers' 100-95 win over the Nuggets on Tuesday night, including a pair of free throws and a layup in the closing minutes to help hold off Denver's fourth-quarter rally.\n\"It was a difficult game,\" Blazers coach Terry Stotts said. \"We did a lot of good things, made some big plays defensively to win it at the end. The offense kind of shut down in the fourth quarter but our defense stayed solid, and to get a win like this in Denver is something we needed to do.\"\nThe Nuggets trimmed an 18-point deficit to two but couldn't catch the Blazers. Denver made just 37 of 103 shots, including 27 of 64 in the paint, and couldn't even find the rim at the line, missing 9 of 26 free throws.\nLillard scored 12 points in the third quarter when it looked as if to the Blazers were headed for a blowout win, but he saved his biggest shots for late in the fourth.\nLillard's clutch shooting helped Portland overcome a terrific performance by Denver's J.J. Hickson, who pulled down a career-high 25 rebounds, including 15 on the offensive side. Hickson led the Nuggets to a 64-41 advantage on the glass, appearing as a reserve power forward after starting 52 games at center this season.\n\"Twenty-five boards is exciting, but the win would have been more exciting,\" Hickson said.\nThe Blazers again went with a smaller lineup with Aldridge missing his fourth straight game with a strained left groin, and Dorell Wright helped make up for Aldridge's team-high 23.9 points and 11.4 rebounds by giving Denver another long-range shooter to defend.\nAs Nuggets coach Brian Shaw said before tip-off when talking about Aldridge's absence, \"There's a big sigh of relief that you don't have to deal with that, but at the same time it just creates a different type of problem: They're one of the best -- if not the best -- 3-point shooting teams in the league. They're the best free-throw shooting team in the league. They're the highest-scoring team in the league.\"\nSix Blazers scored in double figures, including Nicolas Batum's 16 points.\nAldridge averaged 34.5 points in the Blazers' two earlier games against Denver this season and the Trail Blazers missed him in the fourth quarter when it was tougher to close this one out than they had expected when they surged to a 79-61 lead in the third.\nRandy Foye led Denver with 17 points.\nDenver again was without Ty Lawson, who leads the Nuggets with averages of 18 points and 8.8 assists. He's missed seven straight games with a broken rib.\nShaw also made a big change with his big man, starting 7-foot-1 Timofey Mozgov at center in place of Hickson, a natural power forward pressed into duty at center after JaVale McGee fractured his left tibia five games into the season.\nHickson filled in admirably, averaging 11.4 points and 9.2 boards, but he shot just 52 percent from the free-throw line, and Shaw said that \"affected his confidence rolling to the basket aggressively and running the floor because maybe he doesn't want to get fouled.\"\nMozgov, who was averaging 8.6 points and 5.8 rebounds, finished with 14 points and six boards. Hickson scored 16 points.\nHickson said he was much more comfortable going back to power forward.\n\"It just felt good to play my natural position,\" he said.\nHe didn't seem bothered coming off the bench, either.\n\"I don't know how many minutes I played, but I definitely played starter's minutes tonight,\" said Hickson, who played just under 30 minutes. \"So, coming off the bench or starting, people always tell me it's not who starts, it's who finishes and tonight, coach made the call to let me finish and that shows he has a lot of confidence in me still.\"\nEvan Fournier's pair of free throws with just over four minutes remaining capped a 15-2 run that pulled Denver to 86-84. Lillard ended the drought with a pair of free throws.\nAfter back-to-back buckets by Denver's Kenneth Faried, Lillard hit a finger-roll layup for a 92-88 lead, and the Nuggets never got any closer.\n\"When you're in a situation like that, you've just got to find a way to get it done,\" Lillard said.\nGame notes\nBlazers F Thomas Robinson played just 14 minutes and had a wrap on his left knee after the game. Stotts said he had no information on the injury.",
  "source": "espn_api",
  "crawled_at": 1764992958.8111308
}