{
  "game_id": "0021900220",
  "espn_id": "401160862",
  "date": "Nov 22, 2019",
  "matchup": "LAL @ OKC",
  "headline": "Davis’ 33 points lead Lakers past Thunder 130-127",
  "body": "OKLAHOMA CITY --  Being coachable paid off for Anthony Davis.\n\nThe star forward scored 24 of his 33 points in the second half to help the Los Angeles Lakers beat the Oklahoma City Thunder 130-127 on Friday night.\n\nHe got in a rhythm after coach Frank Vogel told him to stop hesitating.\n\n\"When I hesitate, I tend to come up short or a bad miss,\" Davis said. \"And it seems to be going in a lot more when I don't hesitate.\"\n\nDavis also had 11 rebounds and seven assists, and the Lakers needed all of it. Though the Thunder have struggled this season, they played the Lakers close this week in Los Angeles and entered the night with a 5-3 home record, including a victory over Philadelphia last week.\n\n\"We find a way to win no matter what the game is,\" said LeBron James, who had 23 points and 14 assists. \"This is a very good team at home. They've struggled on the road a little bit, but we knew they were going to give it their best punch, especially just playing them on Tuesday in LA.\"\n\nThe Lakers won their sixth straight and own the league's best record at 13-2.\n\nShai Gilgeous-Alexander scored 24 points and Steven Adams added 22 for the Thunder, who have lost five of six.\n\nLos Angeles guard Rajon Rondo was ejected early in the fourth quarter after a kick to Dennis Schroder's groin area. Schroder made two free throws, and then Gilgeous-Alexander's layup tied the game at 109.\n\n\"I didn't think it called for an ejection, but the refs have to do what they feel best fits,\" James said. \"But, you know, I didn't think it called for an ejection.\"\n\nDavis hit a corner 3 and was fouled by Adams, then made the free throw to put the Lakers ahead 126-121 with 2:36 to play.\n\nOklahoma City's Chris Paul made a layup with 11.8 seconds left that cut the Lakers' lead to 126-125. Davis was fouled with 8.1 seconds left, and he made both free throws. Gilgeous-Alexander's layup with 4.2 seconds left trimmed the margin to one again, but Davis made two more free throws with 3.8 seconds remaining. James intercepted Oklahoma City's inbounds pass and ran out the clock.\n\n\"Credit OKC,\" Vogel said. \"They played an outstanding game tonight on both ends of the floor. They really competed and made big shots all night.\"\n\nIt was Oklahoma City's seventh loss by five points or fewer this season.\n\n\"Yeah, it's kind of stupid, to tell you the truth,\" Paul said. \"Don't know if that's the right word, but me and Shai was talking about like, you know, we are fighting. This is our job. We are supposed to (win), so we've got to figure it out. We got to find a way to win these games.\"\n\nTIP-INS\n\nLakers: F Kyle Kuzma played with goggles for protection after he suffered an eye injury Tuesday against the Thunder. ... Kentavious Caldwell-Pope hit a 27-foot 3-pointer at the halftime buzzer. He finished with 17 points.\n\nThunder: Coach Billy Donovan got a technical for arguing with officials in the second quarter. ... C Nerlens Noel (illness) did not play. ... Oklahoma City led 67-66 at halftime. The Thunder shot 56.5% from the field and made 21 of 31 shots inside the 3-point line before the break. ... Oklahoma City trimmed what once was a 15-point third-quarter deficit to 106-103 by the end of the period.\n\nROUGH LANDING\n\nThunder guard Hamidou Diallo left the game after taking contact from James on a driving layup early in the fourth quarter. Donovan said Diallo injured his elbow and did not say whether he might miss any games. Diallo was called for a foul on the play. Donovan challenged the play because James extended his elbow on the drive, causing Diallo to fall back. The call and the basket both stood, and James made the free throw.\n\nSTAT LINES\n\nAdams had struggled through much of the season, but his 22 points on Friday night were a season high. He made 9 of 10 shots -- a significant jump for a player who entered the night shooting 51% for the season.\n\nAUTOMATIC\n\nDavis improved his team-best 87% free-throw shooting by making 11 of 11 on Friday, including 9 of 9 in the second half.\n\nUP NEXT\n\nThe Lakers visit the Memphis Grizzlies on Saturday.\n\nThe Thunder visit the Golden State Warriors on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996029.18369
}