{
  "game_id": "0021800576",
  "espn_id": "401071252",
  "date": "Jan 05, 2019",
  "matchup": "CHA @ DEN",
  "headline": "Jokic scores season-high 39, Nuggets beat Hornets 123-110",
  "body": "DENVER --  Nikola Jokic's impressive numbers took a backseat to his coast-to-coast dunk.\n\nCheered by the sellout crowd for his jam, he was also teased by his teammates. To him, the slam was a thing of beauty.\n\n\"Poetry in motion,\" the 7-footer said.\n\nJokic scored a season-high 39 points and grabbed 12 rebounds, reserve Paul Millsap added 18 points and the Western Conference-leading Nuggets knocked off the Charlotte Hornets 123-110 on Saturday for their 10th straight home victory.\n\nThat's two straight games where Jokic's now had a memorable dunk .\n\n\"If I'm not tired and 100 percent sure I'm going to dunk it, I'm going to dunk,\" Jokic explained. \"But two points is two points -- however you score.\"\n\nHis slam in the third quarter led to some good-natured ribbing from teammates such as Torrey Craig, who also had a high-flying dunk.\n\n\"He's feeling pretty bouncy lately,\" Craig playfully said.\n\nJokic took it all in stride.\n\n\"Just because (Craig) can jump high, doesn't mean he can dunk better,\" Jokic said.\n\nJokic turned in another impressive stat line, also adding six assists, three steals and one blocked shot. He was 16 of 29 from the floor and 4 of 5 from the line.\n\n\"You try to play him straight up, he's going to do what he wants,\" Hornets guard Malik Monk said. \"We just tried to play him straight up and he just exploited us on that. He's a great player. I can't say anything bad about him.\"\n\nAt 26-11, the Nuggets are off to their best NBA start in franchise history. This also marks the latest they've been in first place in the conference since March 16, 1977.\n\nTo think, they're not even at full strength yet. But they're getting closer. Millsap and Gary Harris, who had 17 points off the bench, are steadily getting back up to speed after returning from injuries. The team is still missing starter Will Barton.\n\n\"It's good to be healthy. It's good to be whole,\" Nuggets coach Michael Malone said. \"Both (Millsap and Harris) showed they're ready to take their starting jobs back. Me bringing them off the bench was trying to get them back into a game rhythm.\"\n\nKemba Walker had 20 points for the Hornets, who kicked off a six-game trip. Bismack Biyombo added a season-high 16 points.\n\nTrey Lyles and Millsap hit back-to-back 3-pointers early in the fourth quarter to give the Nuggets a 105-93 lead. Craig cemented the win with a dunk on a fast break with 1:50 remaining to extend the lead to 14.\n\nDenver scored 27 points off turnovers.\n\n\"When you play hard, good things happen,\" Harris said. \"We have to continue to do that.\"\n\nTIP-INS\n\nHornets: Biyombo was in the starting lineup with C Cody Zeller out after he had surgery to fix a broken right hand. ... G Jeremy Lamb missed a second straight game with a strained right hamstring. \"He's progressing well,\" coach James Borrego reported. ... F Marvin Williams was called for a flagrant foul when he tried to prevent a layup by Craig in the second quarter.\n\nNuggets: Denver led Charlotte in points in the paint by a 64-48 margin. ... Had a season-high 31 second-chance points. ... Jokic's 29 shot attempts were a season high.\n\nOH, BROTHER\n\nIt was a Hernangomez family reunion as Nuggets forward Juancho Hernangomez faced older brother Willy, who's a center for the Hornets. Juancho didn't score in nearly 20 minutes of work, while Willy had 10 points in 15:35.\n\nWilly Hernangomez didn't play in their first meeting Dec. 7, when Juancho had 15 points in Denver's 113-107 loss.\n\nFRONT-ROW SEAT\n\nCraig had the hustle play of the day late in the fourth, saving a ball heading out of bounds and winding up about five rows deep into the stands.\n\n\"I had beer all over my shorts and legs,\" said Craig, who finished with 12 points.\n\nENERGY\n\nMonk scored 12 of his 16 points in the second half, including a 3-point buzzer-beater over Jamal Murray to end the third that cut it to 89-84.\n\n\"I just try to bring energy every time I step on the court,\" Monk said. \"I did a pretty good job of that.\"\n\nUP NEXT\n\nHornets: At Phoenix on Sunday night.\n\nNuggets: At Houston on Monday, the first of a two-game, back-to-back trip.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994393.8959901
}