{
  "game_id": "0021900939",
  "espn_id": "401161581",
  "date": "Mar 06, 2020",
  "matchup": "LAL vs. MIL",
  "headline": "LeBrilliant: James' 37 points lead Lakers past Bucks 113-103",
  "body": "LOS ANGELES --  LeBron James has repeatedly insisted he doesn't care about winning another MVP award. He knows almost nobody outside the Los Angeles Lakers' locker room thinks he'll beat Giannis Antetokounmpo for the honor.\n\nWhen the reigning MVP brought his Milwaukee Bucks to Staples Center on Friday night, James' brilliant performance still demonstrated the debate shouldn't be over just yet.\n\nJames had 37 points, eight rebounds and seven assists to win his showdown with his fellow All-Star Game captain, and the Lakers beat Milwaukee 113-103 in a clash of the NBA's conference leaders.\n\nAnthony Davis scored 14 of his 30 points in the fourth quarter as the Lakers (48-13) split their season series with the league-leading Bucks (53-10). Los Angeles was carried to its 10th win in 11 games overall by James, who scored 14 points in the third quarter and then kept LA ahead down the stretch.\n\nJames also frequently guarded Antetokounmpo during the middle quarters with consistent success. James capped his night with a one-handed spinning dunk with 27 seconds left, sparking the last of many \"M-V-P!\" chants for him at Staples Center.\n\n\"We know who we are, and this is great competition,\" James said. \"To have the opportunity to compete at a high level, that's fun and exciting. But we know what we're capable of.\"\n\nThe victory even had a symbolic meaning for James and the Lakers: They formally clinched their first playoff spot since 2013, ending the longest drought in franchise history.\n\n\"I came here to put this franchise back where it needed to be,\" James said. \"The league is not what it is if the Lakers are not winning.\"\n\nJames has transformed himself into the NBA's assists leader this season to get the most out of Davis, but he did it without losing any of his own scoring acumen. The Lakers depend on his steady excellence on both ends, and he has rarely been better this season than he was against the Bucks.\n\n\"What was more impressive to me was his defense on Giannis,\" Lakers coach Frank Vogel said. \"For him to take on that assignment and still do what he did offensively, just an incredible performance.\"\n\nAntetokounmpo had 32 points and 11 rebounds for the Bucks, who have lost two of three games for the first time since October. Donte DiVincenzo scored 17 points for Milwaukee, which has still won seven of nine overall.\n\n\"We definitely did not play smart,\" Antetokounmpo said. \"We put them at the line so easily. We've just got to do better. Obviously we're going to learn a lot from this game.\"\n\nAntetokounmpo finished strong with a 12-point fourth quarter after two fairly quiet periods, but Milwaukee just couldn't catch up to the Lakers in the waning minutes of one of the NBA's marquee regular-season matchups.\n\n\"They were just better,\" Milwaukee coach Mike Budenholzer said. \"They're a very good team. They do a lot of things well. I think it's good for us, though. We'll learn from it, and we'll be better.\"\n\nAntetokounmpo appeared to be headed for another monster game when he scored 10 points in the first four minutes at Staples Center, but he managed only two more in the first half when Los Angeles tightened up its defense.\n\nThe Lakers made an 18-0 run in the third quarter to take their first significant lead at 68-55. James drove the surge with his scoring and playmaking, while James and Danny Green valiantly slowed the bigger Antetokounmpo on defense.\n\nTIP-INS\n\nBucks: George Hill missed his second straight game with a bruised groin. ... Both of Antetokounmpo's NBA brothers play for these teams as well. Thanasis Antetokounmpo didn't play off Milwaukee's bench, while Kostas Antetokounmpo wasn't in uniform for the Lakers.\n\nLakers: Dion Waiters wasn't in uniform after signing with the Lakers earlier in the day. The veteran guard will wear No. 18 when he suits up, possibly this weekend. \"He's a guy that we think can really help us with his shooting and on the wing,\" coach Frank Vogel said. ... Davis (sore left elbow) and Alex Caruso (sore right hamstring) both played through minor injuries.\n\nHE'S OK\n\nAntetokounmpo had a scary fall late in the game when he came down on a prone Avery Bradley. The MVP walked it off and stayed in the game, but appeared to be limping off the court late. Afterward, Giannis repeatedly insisted his knee is \"good,\" and Budenholzer was cautiously optimistic.\n\nMILESTONE BUCKET\n\nThe Lakers took the lead for good on James' 3-pointer with 8:59 left in the third quarter. James scored his 34,000th career point during the game, joining Kareem Abdul-Jabbar and Karl Malone as the only players to hit the mark.\n\nSHOOTING BLANKS\n\nKhris Middleton scored 12 points on 5-of-19 shooting for the Bucks. The 21-points-per-game scorer went 2 for 10 on 3-pointers and made three turnovers. \"I just didn't shoot the ball well, and I didn't make the best decisions late in the ballgame,\" he said. \"Still got to shoot, no matter what the situation is. The next one's not going to go in if you don't shoot it.\"\n\nUP NEXT\n\nBucks: Visit the Phoenix Suns on Sunday.\n\nLakers: Face the Los Angeles Clippers as the road team on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995970.136918
}