{
  "game_id": "0022201173",
  "espn_id": "401469328",
  "date": "Apr 02, 2023",
  "matchup": "CLE vs. IND",
  "headline": "Mitchell scores 40, Cavaliers power past Pacers 115-105",
  "body": "CLEVELAND -- — All-Star Donovan Mitchell scored 40 points and Evan Mobley had 14 points and 16 rebounds as the playoff-bound Cleveland Cavaliers pulled away late for a 115-105 victory over the Indiana Pacers on Sunday night.\n\n\r\n              Darius Garland added 20 points and six assists for Cleveland, which reduced its magic number to one for clinching home-court advantage in the first round of the playoffs. The Cavaliers won for the 31st time in 40 games at Rocket Mortgage FieldHouse.\n\n\r\n              “It’s great to be in this position, but we have stuff to prove in the playoffs,” Mitchell said. “The big thing for me is we’re bringing that energy and that vibe to the city. We have expectations. We’re here to win.”\n\n\r\n              Rookie Bennedict Mathurin had 19 points, nine rebounds and three fourth-quarter offensive fouls for Indiana, which was eliminated from postseason contention for the third year in a row. T.J. McConnell had 16 points and five assists off the bench.\n\n\r\n              Mitchell became the first Cleveland player with three straight 40-point games and extended his franchise record for such games in a season to 12. He scored 17 points in the third quarter and 21 in the second half.\n\n\r\n              “Donovan has been great all season, but it’s crazy with those records he’s setting with the 40-point games,” Mobley said. “He comes to work every day with a great attitude, and we’re lucky to have him.”\n\n\r\n              The Cavaliers trailed by 11 points in the opening half and didn’t go in front for good until Garland drained a 3-pointer early in the fourth, making it 92-89. Jarrett Allen returned from a two-game absence with a groin strain and had 15 points and seven rebounds.\n\n\r\n              Cleveland leads New York by three games with four to play in the race for fourth place in the Eastern Conference. The Knicks own the tiebreaker after beating the Cavaliers 130-116 on Friday.\n\n\r\n              “They’re a legit team, a top-four team in a tough conference and they have a great home-court environment,” Pacers coach Rick Carlisle said. “And they’ve got a real superstar in Mitchell. They’re pretty well set up for a long time.”\n\n\r\n              All-Star point guard Tyrese Haliburton missed his third straight game with a sprained right ankle and sore left elbow for Indiana. Center Myles Turner, who has been dealing with a sore left ankle all season, was out for the fifth consecutive game.\n\n\r\n              Pacers rookie Andrew Nembhard had 13 points and eight assists, Jordan Nwora had 15 points and 10 rebounds and Aaron Nesmith scored 14 points.\n\n\r\n              “We’re competing and there are a lot of positives from these experiences,” Carlisle said. “We’ve got cap flexibility and we’ve got assets. We’re headed into a big summer and an important draft.”\n\n\r\n              BIG JAY The Cavaliers welcomed back rim protector Allen, who missed six of the previous nine games with eye and groin injuries. The 6-foot-9, 243-pounder leads the team in rebounding, field goal percentage, contested two-point shots and screen assists.\n\n\r\n              “You notice a distinct difference with Jarrett off the floor because he is our first line of defense at the rim,” coach J.B. Bickerstaff said. “Our defense clicks around the combination of Evan and him being able to protect our other guys out there.”\n\n\r\n              TIP-INS Pacers: Haliburton ranks second in the NBA in assists at 10.4 per game, but has not appeared in the required 58 games to qualify for the season-ending leaders. He must play in two of Indiana’s remaining three contests to reach the mark. … G Chris Duarte (left ankle soreness) and G Kendall Brown (right tibia stress reaction) were inactive.\n\n\r\n              Cavaliers: Mobley averaged 17.0 points, 11.0 rebounds, 5.5 assists and 3.5 blocked shots in the past two games while filling in at center for Allen. … Dean Wade started for the first time since Dec. 2. He made two baskets in six March games. … F Isaac Okoro (left knee soreness), who was injured March 26 against Houston, sat out his third straight game.\n\n\r\n              UP NEXT Pacers: Host New York on Wednesday night.\n\n\r\n              Cavaliers: Visit Orlando on Tuesday night.\n\n\r\n              ------ More AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995228.2461078
}