{
  "game_id": "0021501022",
  "espn_id": "400828909",
  "date": "Mar 18, 2016",
  "matchup": "DET vs. SAC",
  "headline": "After big first half, Pistons hold off Kings 115-108",
  "body": "AUBURN HILLS, Mich. -- Stan Van Gundy was in no position to nitpick. The Detroit Pistons needed this win and got it.\nKentavious Caldwell-Pope made a couple big 3-pointers in the fourth quarter, and the Pistons recovered after blowing a big lead to beat the Sacramento Kings 115-108 on Friday night. Marcus Morris scored 20 of his 24 points in the first half for Detroit.\n\"It's a good win. It doesn't matter how the game goes,\" said Van Gundy, Detroit's coach. \"In this league a lot of times, the team who loses but comes back from like 21 down gets praised more than the team who wins. ... I'll keep taking 21-point leads. That would be good.\"\nIt was actually an 18-point first-half lead that the Pistons couldn't hold, but they didn't let the game slip away after Sacramento tied it early in the fourth quarter. The Pistons (35-34) pulled into a virtual tie with Chicago (34-33) for the last playoff spot in the Eastern Conference.\nDetroit is in the middle of a nine-game homestand, and the Pistons can take a small step toward their first postseason berth since 2009 simply by winning home games against struggling teams such as the Kings. Morris made all six of his 3-point attempts in the first half, and Detroit led 67-54 after two quarters.\nDeMarcus Cousins had 31 points and 10 rebounds for Sacramento, which has lost 11 of 13.\n\"Slow start, slow end,\" Sacramento's Rudy Gay said. \"We've just got to put together a whole game of good basketball.\"\nThe pace was frenetic from the start. Caldwell-Pope pulled up in transition and made a 3-pointer from near the top of the key to give the Pistons a 24-10 lead. It was 39-25 after one.\nDetroit set season highs for points in the first quarter and first half, but the Kings rallied and tied the game early in the fourth. The Pistons didn't crack, and Caldwell-Pope eventually made back-to-back 3-pointers to put Detroit up 107-98.\n\"He's been playing really, really well. He really has, at both ends,\" Van Gundy said. \"You've got to hand it to him. He's been our most consistent player of late, and he's on a good run right now.\"\nCaldwell-Pope finished with 23 points, and Andre Drummond had 14 points and 11 rebounds.\nGUTTING IT OUT\nDetroit's Reggie Jackson said he threw up in his mouth during the game, but he struck a defiant tone when asked about whatever has been ailing him.\n\"If I ain't dead, I'll be back out here tomorrow,\" Jackson said.\nHe had 19 points, nine assists and seven rebounds Friday.\nA STEP SLOW\nDetroit outscored the Kings 12-0 on fast breaks, and Sacramento didn't guard the Pistons all that well in half-court situations, either.\n\"I think sometimes we're indecisive,\" Kings coach George Karl said. \"We're getting in that what I call no-man's land where we don't do anything. With Drummond and Jackson and 3-ball shooters, you've got to do a lot of things right to cover all the actions. We just didn't have enough focus or energy to get it done in the first half.\"\nTIP-INS\nKings: Rajon Rondo returned after missing a game with turf toe, a thumb sprain and a right shoulder bruise. He had 10 points and 13 assists. ... Sacramento was without C Willie Cauley-Stein, who was ill. ... Gay scored 19 points.\nPistons: Morris missed his only 3-point attempt of the second half. ... Detroit turned the ball over 17 times.\nUP NEXT\nKings: At New York on Sunday night.\nPistons: Host Brooklyn on Saturday night.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994900.110543
}