{
  "game_id": "0021600365",
  "espn_id": "400899807",
  "date": "Dec 12, 2016",
  "matchup": "DAL vs. DEN",
  "headline": "Matthews leads Mavs to rare blowout, 112-92 over Nuggets",
  "body": "DALLAS --  Wesley Matthews and the Dallas Mavericks have a long way to go to recover from a miserable start plagued by injuries.\n\nConsecutive home wins for the first time and a .500 record over six games are a start.\n\nMatthews scored 25 points and the last-place Mavericks enjoyed a rare blowout, beating the listless Denver Nuggets 112-92 on Monday night.\n\nHarrison Barnes had 18 points for the Mavericks (6-18), who led 65-43 at the break. They expanded the margin to a season-high 28 points in the third quarter on the way to their second win in three games since a 31-point home loss to Sacramento that prompted a team meeting.\n\n\"That's how we're supposed to play,\" said Matthews, who finished a point shy of the season high he reached in three of the previous five games. \"Now it's just about harnessing that, trying to get a string and run off a couple of wins.\"\n\nThe Nuggets were finishing a season-long six-game road trip and played like it, shooting 42 percent with their starters getting outscored 80-37. Backup center Nikola Jokic led Denver with a season-high 27 points and 11 rebounds.\n\nDenver missed a chance to split the six-game trip, instead losing for the eighth time in 11 games. Emmanuel Mudiay scored 17 points and Danilo Gallinari had 12 points.\n\n\"Very disappointed,\" coach Michael Malone said after bursting through the locker room door, causing it to slam loudly into a wall. \"Not just in the loss, but how we played. It's a bad loss for us.\"\n\nThe NBA's worst-shooting team coming in at 41.5 percent, Dallas shot 65 percent in the first half and a season-high 58 percent for the game. The Mavericks were 12 of 26 from 3-point range after missing six of their first seven.\n\nIt was the best showing for an offense still missing star forward Dirk Nowitzki (strained right Achilles tendon), starting center Andrew Bogut (right knee injury) and key backup guard J.J. Barea (left calf strain).\n\n\"We won't go away,\" said second-year player Justin Anderson, who provided a spark with 11 points and six rebounds. \"We are not going to get down. We are going to continue to build off this.\"\n\nMatthews was 10 of 14 from the field and hit his first five 3-point attempts before finishing 5 of 7. He even made long-range shots that didn't count, hitting a desperation shot from about 30 feet after a shot-clock buzzer in the fourth quarter.\n\nIt was the third game in four nights for the Mavericks, but two were at home and all three in Texas. And they showed plenty of energy, taking a 10-2 lead in the first five minutes and never trailing.\n\nANOTHER CAREER NIGHT\n\nUndrafted Dallas rookie Dorian Finney-Smith had career highs in points and rebounds for the second straight home game, finishing with 13 points and nine boards three nights after getting 12 and eight in a win over Indiana.\n\nQUIET NIGHT FOR LOCALS\n\nIt was a quiet night for Mudiay, who played high school basketball in the area, and Dallas high school product Darrell Arthur. Mudiay was a minus-20 despite his scoring total, and Arthur was pulled 4 1/2 minutes into the game and didn't return. All Malone would say after the game was that Arthur wasn't hurt.\n\nTIP-IN\n\nNuggets: Jokic scored 23 of Denver's 49 second-half points. He had his third double-double in the past four games. ... Jamal Murray scored 15 points. ... Denver gave up 40 points in the paint in the first half.\n\nMavericks: C Salah Mejri had three blocks , one more than his season high, in the first four minutes. He finished with four, two off his career high. ... Previous high for a half was 63 in the second half of a 130-121 overtime loss at Indiana in the season opener.\n\nUP NEXT\n\nNuggets: Home against Portland on Thursday. The Trail Blazers have already beaten Denver twice this season and won five straight in the series.\n\nMavericks: Detroit visits Wednesday in a series that has seen the road team win five straight games.\n\n---\n\nCorrects previous version with 11 rebounds for Nikola Jokic instead of 12.",
  "source": "espn_api",
  "crawled_at": 1764996146.957803
}