{
  "game_id": "0021500898",
  "espn_id": "400828785",
  "date": "Mar 02, 2016",
  "matchup": "CHA @ PHI",
  "headline": "Kemba Walker keeps Hornets rolling in 119-99 win over 76ers",
  "body": "PHILADELPHIA --  Kemba Walker picks his spots for Charlotte. At times, he's the aggressive, go-to scorer who has led the Hornets' playoff push. Other games, he's unselfish and tries to get the rest of the Hornets rolling.\n\nAgainst the pesky Sixers, Walker was the do-it-all guard who put the game away.\n\nWalker had 30 points and seven rebounds, and Cody Zeller scored 15 to lead the Hornets to a 119-99 victory over the Philadelphia 76ers on Wednesday night.\n\n\"(Kemba's) definitely controlling the game and Coach is definitely going through him,\" Charlotte guard Jeremy Lin said.\n\nWith good reason: Walker has nine 30-point games this season.\n\nLin and Marvin Williams each added 14 points for the Hornets as they continue their climb up the Eastern Conference standings. Charlotte won for the second straight night and has won 10 of 13 overall.\n\nThe Hornets let the Sixers hang around for 2 1/2 quarters before closing the third on a 14-4 run. Courtney Lee hit a 3-pointer that sparked Charlotte, and Walker shot 4 of 9 with a 3-pointer and three free throws in the period.\n\n\"These are the type of situations we have to go through,\" Walker said. \"Tonight was us being on top and closing out a game.\"\n\nThe Hornets became the latest team to top 100 points against the 76ers, reaching that mark with 5:26 left. The Sixers have allowed 100-plus in nine straight games and more than 120 points four times during that span.\n\nNo wonder they are the worst team in the NBA. The Sixers have lost 10 consecutive games and 14 of 15 overall.\n\nNerlens Noel, Robert Covington and Isaiah Canaan all scored 17 points for Philadelphia.\n\nThe only suspense came in the waning minutes when the Sixers tried to hit 100 points on the 54-year anniversary of Wilt Chamberlain's 100-point game for the Philadelphia Warriors.\n\nNik Stauskas converted a three-point play with 6 seconds left, but the Sixers fell just shy.\n\nThe Hornets could start to build some separation from Atlanta, Indiana and Detroit with a heavy stretch of home games ahead. The Hornets open a seven-game homestand on Friday night where they are a sterling 20-9 this season.\n\n\"We can get some rest and try our best to take advantage of home court,\" Walker said.\n\nFrank Kaminsky raised three fingers in the air when he sank a 3-pointer in the fourth for a 94-78 lead. That started to empty what was already another sparse crowd inside the Wells Fargo Center.\n\nThose who stayed got a small dose of Linsanity.\n\nStill a fan favorite, Lin was cheered almost every time he touched the ball, and fans were clamoring for his autograph. Walker made 10 of 21 shots and Williams grabbed nine rebounds to help Charlotte hold a 50-38 edge on the boards.\n\nThe result was a mere formality against a Sixers team that started the season 0-18 and is making another run at the league's futility mark.\n\n\"We've got to find ways to get back in it,\" coach Brett Brown said. \"I think the game ends up feeling long; it is long. You're not going to get a win unless you play long.\"\n\nHONORING HARV\n\nThe 76ers honored longtime statistician Harvey Pollack with a tribute night. Pollack, who died in June at 93, worked for the Sixers at the time of his death, spending the past 28 years as the team's director of statistical information. He sat courtside on March 2, 1962, when Chamberlain scored a record 100 points against the New York Knicks. When the game was over, Pollack stuffed the ball in Chamberlain's duffel bag and organized a famed photo. Pollack wrote \"100\" on a piece of paper and gave it to Chamberlain to hold for the classic black-and-white snapshot.\n\nTIP-INS\n\nHornets: Charlotte center Al Jefferson played in back-to-back games for the first time this season. He missed half the season with a torn right meniscus. \"This is like October for him,\" coach Steve Clifford said.\n\n76ers: Rookie center Jahlil Okafor sat out for the second straight game with a bruised right shin. \"I'm surprised that I'm telling you that it went till tonight,\" Brown said. \"I thought the Washington game was going to be the only game (missed). So it just hasn't responded as quickly as we had hoped.\" ... Brown said the frontcourt pairing of Okafor and Noel has been \"far more difficult and far more of a challenge than I anticipated.\"\n\nUP NEXT\n\nThe Hornets host Indiana on Friday.\n\nThe 76ers host Miami on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994362.399455
}