{
  "game_id": "0022300187",
  "espn_id": "401584815",
  "date": "Nov 12, 2023",
  "matchup": "LAL vs. POR",
  "headline": "LeBron sits with injury while Davis, Hachimura propel Lakers to 116-110 win over Trail Blazers",
  "body": "LOS ANGELES -- — Anthony Davis had 30 points and 13 rebounds, Rui Hachimura scored eight of his 19 points in the final 3:43 and the Los Angeles Lakers overcame LeBron James' injury absence to beat the Portland Trail Blazers 116-110 on Sunday night.\n\n\r\n              James missed a game for the first time this season, sitting out because of a bruised left calf. The top scorer in NBA history injured his shin in a collision with Kevin Durant during the first quarter in Phoenix on Friday night.\n\n\r\n              Although James returned to that game, the Lakers decided to rest the 38-year-old star Sunday for their long haul ahead, including back-to-back games starting Tuesday night.\n\n\r\n              James' supporting cast couldn't pull away from Portland, but Davis took charge down the stretch for the Lakers, scoring nine points in the fourth quarter while Los Angeles held on in its first game back from a 1/3 trip.\n\n\r\n              “It’s Anthony Davis,” said Austin Reaves, who scored 18 points. “Anytime he gets on the floor — you never want to have LeBron or anybody out, but anytime you’ve got Anthony Davis on the floor, you’ve got a chance. He changes the game.”\n\n\r\n              Cam Reddish scored 16 of his 18 points in the first half for Los Angeles, and D'Angelo Russell had 11 points and 11 assists.\n\n\r\n              “We've got to just come out from the jump and play to the best of our ability, with energy,” Reddish said. “Obviously, we got the win, so that's all good, but I think we can do a better job of just playing hard throughout the whole 48. But it was a good win.”\n\n\r\n              Jerami Grant scored 23 points and Shaedon Sharpe added 19 for Portland, which has lost three straight after a three-game winning streak. The Blazers shot just one free throw in the final three quarters, finishing with just nine free throw attempts compared to 37 for the Lakers.\n\n\r\n              “AD is obviously one of the best players in our game,” Portland coach Chauncey Billups said. “Sometimes guys like that will get going. ... Their penetration from their guards, it really hurt us a lot of times, because they were able to get it to AD in the pocket. But he was the best player on the floor, and he played well.”\n\n\r\n              The Lakers held a 13-point lead early in the fourth quarter before Portland scored 12 consecutive points. The Blazers trailed just 104-103 with three minutes left, but Los Angeles made an 8-2 run before Hachimura and Reaves hit clinching free throws in the final seconds.\n\n\r\n              “Most games in the NBA, it comes down to executing down the stretch, because it’s always going to be a two- or three-possession game,” said Skylar Mays, who had 15 points and 12 assists for Portland “They had us there, but we showed a lot of fight. We’ve just got to learn how to finish games. It’s early. We’ve got a lot of time to make up for it.”\n\n\r\n              Los Angeles also played without Jarred Vanderbilt and Gabe Vincent, while the Blazers are without Malcolm Brogdon, rookie Scott Henderson and Anfernee Simons.\n\n\r\n              Duop Reath, the Blazers' 27-year-old rookie center, scored 11 points in his NBA debut. The Sudan-born Australian hit a 3-pointer early in the second quarter for his first basket, and he finished with three 3s.\n\n\r\n              “It's always been a dream to get out there on the court,\" Reath said. \"Through the ups and the downs, it's been amazing.”\n\n\r\n              Jamaree Bouyea had six points in his Blazers debut after signing a two-way contract earlier in the day. The second-year guard from the University of San Francisco played briefly for Miami and Washington last season.\n\n\r\n              Matisse Thybulle scored 14 points with four 3-pointers in the first half, but he came out midway through the third quarter and didn’t return for Portland, which didn’t announce an injury.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Utah on Tuesday night in the In-Season Tournament.\n\n\r\n              Lakers: Host Memphis on Tuesday night in the In-Season Tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995550.9928021
}