{
  "game_id": "0021501142",
  "espn_id": "400829029",
  "date": "Apr 02, 2016",
  "matchup": "POR vs. MIA",
  "headline": "McCollum has 24 points, Blazers beat Heat 110-93",
  "body": "PORTLAND, Ore. -- C.J. McCollum said the Portland Trail Blazers are in a position to surprise people.\nAfter a big roster turnover in the offseason, many did not think the Blazers would be in the playoff conversation.\nDamian Lillard said that from the outside, some might be surprised because the Blazers don't have players \"labeled as shooters.\" And still, they are making noise and are in throwing distance of a playoff berth.\n\"We're going to compete,\" McCollum said. \"That's my mindset. I can't speak for other people but we're doing what we're supposed to. We're winning at home.\n\"(We're) beating teams we are supposed to beat.\"\nMcCollum had 24 points and made all six of his 3-point attempts to help the Blazers beat the Heat 110-93 Saturday night for their seventh straight home win. They are in sixth place in the Western Conference but have not clinched a playoff spot yet.\nDespite the loss, the Heat still clinched a postseason berth after the Chicago Bulls fell 94-90 to Detroit earlier in the evening. Miami came into the game tied for the third seed in the East but dropped to sixth with the loss.\nMiami coach Erik Spoelstra said that clinching that playoff spot is not something his team takes for granted.\n\"With this organization, we always have big expectations, that doesn't change from year to year,\" Spoelstra said. \"So, getting over that hurdle does mean something to us, but we still have more that we're working on for right now and that's really what we're focused on. It was a disappointing game. They outplayed us, they played very well and we did not bring a great game that would have been necessary to get this road win.\"\nThe Blazers made 10 3-pointers to break a franchise record for 3-pointers in a season with 808.\nLillard did not play in the fourth quarter and finished with 18 points for the Blazers. Gerald Henderson came off the bench to score 17 points.\nHassan Whiteside led the Heat with 21 points and 13 assists.\nGuard Dwyane Wade missed his second straight game because of back and neck injuries sustained Wednesday against the Los Angeles Lakers.\nPortland built a 23-point lead early in the third quarter and did not let up. Their largest lead of the night was 28 points.\nPortland shot 62 percent from beyond the arc while the Heat made only 31 percent. The Blazers edged the Heat out in fast-break points 18-4. Miami's bench outscored Portland 42-29.\nMiami's Luol Deng chalked the loss up to not playing as hard as Portland did.\n\"We had spurts where we played hard and got it going, but they were more consistent than we were for most of the game,\" Deng said. \"Coming out of the third quarter, they really blew their lead and we didn't have enough to get it back.\"\nSaturday's game was the second of back-to-back games for Miami. Last night, the Heat beat the Sacramento Kings 112-106.\nMcCollum is the second NBA player to make six 3-pointers in a game without a miss this season, joining Matt Barnes.\n\"I knew I'm a good shooter,\" McCollum said. \"I've gotten a lot of reps over the course of my career and I pride myself on mechanics and getting in and getting my reps and trusting the process.\"\nHENDERSON'S HELP:\nHenderson's offensive output was nearly double his average. It was the 10th time in the past 13 games that he has been in double figures.\nPortland is 9-1 when he scores 15 or more.\n\"He's really provided a spark off the bench, quality scoring,\" Blazers coach Terry Stotts said. \"He makes some energy plays, some dynamic plays.\"\nTIP INS:\nHeat: This is the seventh time Miami has made the playoffs in eight seasons under Spoelstra. ... Miami traded Brian Roberts to Portland on Feb. 18 along with a future second-round pick in exchange for cash considerations. Roberts never played a game as a member of the Heat, spending just one day after being traded from Charlotte.\nTrail Blazers: Kris Kaman was listed as active on Saturday night after being inactive for two games with upper-respiratory issues. He came into the game with less than 4 minutes remaining. ... Former Trail Blazer Terry Porter, who was at the game, was named coach of the University of Portland's men's basketball team on Friday.\nUP NEXT:\nThe Trail Blazers face the defending champion Golden State Warriors on Sunday night.\nThe Heat return home to host the Detroit Pistons on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994496.72578
}