{
  "game_id": "0022000303",
  "espn_id": "401267463",
  "date": "Jan 30, 2021",
  "matchup": "PHX @ DAL",
  "headline": "Suns win 111-105 to hand Mavericks fifth straight defeat",
  "body": "DALLAS -- — A Phoenix Suns team tasked with playing without its top scorer was able to turn to its 10-time All-Star to take over a game late Saturday night.\n\n\r\n                    Chris Paul scored 16 of his 27 points in the fourth quarter and had 12 assists to help the Suns rally to beat the Dallas Mavericks 111-105. Deandre Ayton had 18 points and 17 rebounds, and Mikal Bridges and Jae Crowder each scored 14 points.\n\n\r\n                    The Suns trailed by 15 with six minutes to play in the third quarter. \n\n\r\n                    “There’s obviously a comfort in having a guy like that with the ball, knowing that his intention is to make a play for the team,\" Suns coach Monty Williams said about Paul, acquired from the Oklahoma City Thunder in November, \"It could be for him to get a shot or someone else, but I think the game is a bit slower for him down the stretch. I don’t know what that is, a gene, or he just has it.”\n\n\r\n                    The Suns played their fourth straight game without All-Star guard Devin Booker. He's sidelined by a strained left hamstring. The teams will meet again in Dallas on Monday night.\n\n\r\n                    Dallas wasted a terrific performance by Luka Doncic, who scored 18 of his 29 points in the third quarter, including eight straight in a 12-0 run after the teams were tied at halftime. The Mavericks dropped their fifth consecutive game. It's their longest losing streak since dropping seven straight in March 2019. They've also lost four straight at home.\n\n\r\n                    “We had some loose possessions, we had some poor defensive possessions and they got the momentum back,” Mavericks coach Rick Carlisle said. “It just a really disappointing one ’cause of how hard our guys fought. But Phoenix hung in and, and they made plays and they were able to do what they had to do to get the momentum back. We’ve just simply got to do better.”\n\n\r\n                    Phoenix countered Dallas’ third-quarter run by scoring the first eight points of the fourth to take an 85-82 lead.\n\n\r\n                    The Mavericks played without Kristaps Porzingis, who sat out the second game of a back-to-back. Dallas’ two remaining big men, Willie Cauley-Stein and Dwight Powell, each fouled out. Cauley-Stein had 14 points and nine rebounds in 30 minutes, Powell eight points and two rebounds in 18 minutes.\n\n\r\n                    After Cauley-Stein’s tip-in at the halftime buzzer tied it at 55, Cauley-Stein hit a short jumper and Dorian Finney-Smith scored on an alley-oop pass from Doncic to put the Mavericks ahead 59-55. Doncic then scored the next eight points to put Dallas ahead 67-55 with 8:07 to play in the third.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Ayton was sidelined for part of the first half with a left shoulder injury. … Williams said he expects Booker to return soon but wouldn’t specify a date.\n\n\r\n                    Mavericks: Tim Hardaway Jr. scored 19 points. He made three 3-pointers, giving him 1,001 for his career. ... Dallas shot a season-high 53% from the floor.\n\n\r\n                    TOP DRAFTEES MEET AGAIN\n\n\r\n                    Ayton and Doncic were the first and third draftees, respectively, in 2018, with Doncic then winning the 2018-19 Rookie of the Year award and being named first-team All-NBA last season. But Ayton holds the upper hand in head-to-head meetings, winning seven of eight vs. Dallas while missing two games. Doncic, having played in all 10, is 3-7 against the Suns.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997759.5402172
}