{
  "game_id": "0022300577",
  "espn_id": "401585205",
  "date": "Jan 17, 2024",
  "matchup": "LAL vs. DAL",
  "headline": "Anthony Davis, Lakers overcome Luka Doncic's triple-double to beat Mavericks, 127-110",
  "body": "LOS ANGELES -- — Anthony Davis is already an established scorer and rebounder. The Las Angeles Lakers' All-Star center is beginning to show he is developing into an adept passer.\n\n\r\n              Davis had nine assists to finish one shy of his second triple-double in three games and the Lakers overcame Luka Doncic’s triple-double to beat the Dallas Mavericks 127-110 on Wednesday night.\n\n\r\n              “He’s learning from me how to pass out of the post,” said LeBron James with a huge grin after he had 25 points, eight rebounds and eight assists to help the Lakers win for the fourth time in six games. “He’s been working on it and it’s great. Teams are going to stop doubling him soon. As long as we make shots out there for him. It's our job to make sure we are in the right position at the right time when he gets doubled.” \n\n\r\n              Davis also had 28 points on 12-of-17 shooting and added 12 rebounds in 33 minutes.\n\n\r\n              The 12th-year center has averaged 2.4 assists per game in his 12-year career, but has five or more assists in four of the past five games. He had a career-high 11 Saturday in a win over the Utah Jazz as he recorded his second triple-double.\n\n\r\n              “When guys are open, we're throwing them the ball and tell them to shoot it,” Davis said. “It's not like we're going out and being selfish with the shots. We're having fun while we're doing it and making the right plays.\"\n\n\r\n              Davis' nine assists led to 28 Lakers' points. D'Angelo Russell was the primary beneficiary as eight of his team-high 29 points came off passes by Davis.\n\n\r\n              Russell led the Lakers in scoring for the seventh time this season and had five 3-pointers.\n\n\r\n              Returning after missing three games because of a sprained right ankle, Doncic had 33 points, 13 rebounds and 10 assists in 33 minutes for his seventh triple-double of the season and 63rd overall.\n\n\r\n              Doncic though was 2 of 9 from the perimeter.\n\n\r\n              “First game back was tough with the legs. I thought a lot of 3s were going in and they didn't,” he said.\n\n\r\n              Doncic wasn't the only player to struggle from beyond the arc. Dallas was 11 of 40 on 3-pointers as Doncic, Tim Hardaway Jr. and Kyrie Irving combined to go 3 of 21.\n\n\r\n              “We generated a lot of wide open looks and they didn't drop for us,” coach Jason Kidd said. “They made it a point to have pace and took advantage of the misses. When you miss open shots against a team like that, they are going to make you pay.”\n\n\r\n              Los Angeles, which evened its record at 21-21, shot 53.8% from the field (49 for 91) and had 12 3-pointers. It also had a 32-7 advantage in fast-break points.\n\n\r\n              Dereck Lively II added 16 points and 11 rebounds for the Mavericks, who dropped to 5-4 in January.\n\n\r\n              The Lakers had a 55-53 halftime lead before taking control in the third quarter. Los Angeles was up 62-59 two minutes into the quarter before it went on a 27-8 run over the next five minutes where Russell scored 10 points.\n\n\r\n              The Lakers' largest lead was 24 points in the fourth quarter.\n\n\r\n              “Usually when you play good defense, it triggers good offense. Everyone was having that sense of urgency to be in attack mode,” coach Darvin Ham said. “We have to bottle it up and continue to work at it and sustain what we do well.”\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Golden State on Friday night.\n\n\r\n              Lakers: Host Brooklyn on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995517.923609
}