{
  "game_id": "0021500793",
  "espn_id": "400828680",
  "date": "Feb 10, 2016",
  "matchup": "MEM @ BKN",
  "headline": "Grizzlies rout Nets in 1st game since Gasol's broken foot",
  "body": "NEW YORK -- A tough couple days gave way to an easy night for the Memphis Grizzlies.\nMike Conley scored 20 points, Jeff Green had 12 of his 18 in the third quarter, and the Grizzlies beat the Brooklyn Nets 109-90 on Wednesday in their first game since losing Marc Gasol to a broken right foot.\nThe Grizzlies unleashed a strong perimeter attack in the absence of their franchise center, making seven 3-pointers in a 39-point third quarter that blew open the game.\n\n\"That's the way we've got to play,\" said Zach Randolph, who slid over to center. \"We're missing our best player. We've got to move the ball, screen-and-roll, be that team.\"\nRandolph finished with 15 points for the Grizzlies, who were coming off consecutive losses, both in overtime. Gasol was hurt in the first quarter against Portland on Monday and Memphis learned the extent of his injury Tuesday.\n\"It was just a really good feeling because it has not been a fun 36 hours for us with the news about Marc,\" Memphis coach Dave Joerger said. \"And like I said before the game, it kind of set in today. Yesterday was kind of shock, today it kind of set in.\"\nThe Nets' Joe Johnson was scoreless, ending the NBA's longest active streak with at least one field goal. He had a basket in 937 straight games, including a 3-pointer at the buzzer in Brooklyn's victory over Denver on Monday, before going 0 for 3 in 23 minutes Wednesday.\nBrook Lopez scored 20 points for the Nets, who take a 14-40 record to the break and might have more changes ahead.\n\"I know for me especially, I'm looking forward to it,\" Johnson said. \"I don't know what's going to happen after this. We'll see.\"\nThe Grizzlies went with a small starting lineup with JaMychal Green at power forward. They led 50-45 at halftime before Conley opened the second half with consecutive 3-pointers to start the onslaught.\nJeff Green had made 3s on consecutive trips later in the period when the Nets inexplicably had nobody anywhere near him as he stood outside the arc next time Memphis had the ball, so he calmly pulled up and made it three in a row as the lead ballooned to 24. He capped the Grizzlies' best third quarter of the season with a three-point play that made it 89-63.\nTIP-INS\nGrizzlies: Joerger said he wasn't sure if Gasol's absence meant center Ryan Hollins would be signed for the remainder of the season. ... The Grizzlies have won four straight meetings to take a 20-19 lead in the series.\nNets: Three-plus years after moving away, the Nets are finally finished with New Jersey. They had still been practicing in their old East Rutherford facility, where the basketball operations department remained, but will open their new training center in Brooklyn next week, bringing the entire organization to the borough.\nLOVING LIONEL\nThe Nets fired Lionel Hollins after 1 1/2 seasons, but he remains popular with the players in the Grizzlies' locker room. He led Memphis to the Western Conference finals in 2013 and his style and personality fit better there than Brooklyn.\n\"I'm not going to say I liked him when we first picked up,\" Conley said. \"He's very hard, he's a very hard coach, he definitely gets on each and every person and I think that's what our team took away more so than anything, was he kept everybody accountable. And it didn't matter if you were the star or the last guy on the bench, he treated everybody the same and that's why he earned the respect from us.\"\nTRADE TALK\nInterim coach Tony Brown wasn't sure what the Nets, who don't have a general manager after reassigning Billy King when they fired Hollins, would do before next Thursday's trade deadline.\n\"I'm not privy to a lot of those conversations, I've just been concentrating on trying to get the team ready to play,\" Brown said. \"Like any NBA club this time of the season, you're going to explore options, what's available, see what works for you and I'm sure they're doing that.\"\nUP NEXT\nGrizzlies: Host Minnesota on Feb. 19.\nNets: Host New York on Feb. 19.",
  "source": "espn_api",
  "crawled_at": 1764994435.474782
}