{
  "game_id": "0022000765",
  "espn_id": "401307557",
  "date": "Apr 05, 2021",
  "matchup": "SAC @ MIN",
  "headline": "Russell returns with 25 points; Wolves beat Kings 116-106",
  "body": "MINNEAPOLIS -- — D’Angelo Russell scored 25 points in his return from knee surgery and Karl-Anthony Towns had 23 points and 13 rebounds for the Minnesota Timberwolves in a 116-106 win against the Sacramento Kings on Monday night.\n\n\r\n                    Anthony Edwards scored 19 points for Minnesota and started the Timberwolves’ push in the fourth after the teams went back and forth for three quarters. Russell continued Minnesota’s push ahead with a pair of 3-pointers in the fourth. He scored 13 of his points in the fourth.\n\n\r\n                    Russell came off the bench in his first game since Feb. 8. He missed 26 games.\n\n\r\n                    “It felt good,” Russell said of playing with Towns. “I think when you put players out there that just know how to play basketball and try to take advantage of the opportunity each possession. More likely than not, it’s going to be a nice little vibe out there. So, it was cool.”\n\n\r\n                    Juancho Hernangomez added 17 points and nine rebounds for the Wolves off the bench as Minnesota’s reserves outscored Sacramento’s bench 60-16. \n\n\r\n                    De’Aaron Fox had 31 points for the Kings, who lost their fourth in a row. Harrison Barnes added 21 points and 12 rebounds, and Buddy Hield scored 18.\n\n\r\n                    “It's finding that consistency and how we play, and not playing to our opponent,” Barnes said. “I think every single night we match whoever is on the floor. If we’re playing a good team, we’re going to bring our ‘A’ game. If we’re playing a team that’s even with us in the standings, then maybe our effort is less. Whatever it is, we always come out a different way every single game based off who we’re playing.”\n\n\r\n                    The veteran Barnes helped Sacramento to a strong start with 12 of his points coming in the first quarter. But neither team could pull away.\n\n\r\n                    Minnesota used a 10-2 run to close out the third after the Kings’ looked to take control and kept the running going in the fourth with Edwards continually bulling his way to the rim on drives. Russell, on a minutes restriction, then provided a closing punch and finished with 24 minutes.\n\n\r\n                    “He came in off the bench and does what he does best, be DLo, ice in his veins in the fourth quarter,” Towns said. “He did exactly what he needed to do to show how special he is to us.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Hassan Whiteside returned after missing six games with right knee soreness. Whiteside played 13 minutes and had seven points. … Marvin Bagley III missed his 12th straight game with a broken bone in his hand, but coach Luke Walton said he’s working out and will “rejoin the team soon.” … Hield was fined $20,000 by the NBA for directing inappropriate language toward officials following Saturday’s loss to Milwaukee.\n\n\r\n                    Timberwolves: Coach Chris Finch said Russell’s minutes would be “pretty limited. ” Since acquiring Russell in a trade from Golden State on Feb. 6, 2020, Towns and Russell have played a total of six games together. … Ricky Rubio returned after missing two games with back spasms. … Jaylen Nowell missed the game with a right tibia contusion.\n\n\r\n                    BEASLEY INJURED\n\n\r\n                    Minnesota announced that guard Malik Beasley will miss four to six weeks with a left hamstring injury after he had an MRI reveal a Grade 3 injury. The team said he’ll be assessed in three weeks.\n\n\r\n                    Beasley, who missed 12 games earlier this season due to a suspension, missed the previous game with the injury. He’s second on the team averaging 19.6 points this season.\n\n\r\n                    HELLO, FANS\n\n\r\n                    The game marked the return to fans at Target Center for the first time since the COVID-19 pandemic hit. The announced attendance was 1,436. Previously, Minnesota had lifted restrictions to 250 friends and family in attendance.\n\n\r\n                    “I was telling somebody last game, I love the Philadelphia fans even though they boo every time,” Edwards said. “I love the fans, they bring energy to the game.” \n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Return home to face the Detroit Pistons on Thursday.\n\n\r\n                    Timberwolves: Travel to Indiana to play the Pacers on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997951.646185
}