{
  "game_id": "0022200723",
  "espn_id": "401468878",
  "date": "Jan 25, 2023",
  "matchup": "MIL vs. DEN",
  "headline": "Antetokounmpo helps Bucks beat short-handed Nuggets 107-99",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo’s ability to keep getting to the free-throw line assured the Milwaukee Bucks would outlast the short-handed Denver Nuggets.\n\n\r\n              Antetokounmpo had 33 points and 14 rebounds Wednesday night as the Bucks won 107-99 over the Nuggets, who were playing without two-time reigning MVP Nikola Jokic and three other usual starters. \n\n\r\n              Antetokounmpo went 15 of 22 from the line and was two off his career high in free-throw attempts. All but one of those free-throw tries came in the second half.\n\n\r\n              “Just tried to get to the rim, tried to be aggressive as much as I can, get downhill, play within my strength,” Antetokounmpo said. “I tried to enjoy the game. I feel I sometimes get too locked in. I think I've got to enjoy the game more. Usually when I enjoy the game more, I get to the free-throw line more, I get downhill more, I'm able to find my teammates more and just make better plays.\"\n\n\r\n              Jokic had returned after missing two games and recorded his fourth straight triple-double Tuesday in a 99-98 victory at New Orleans. He rested the hamstring Wednesday rather than playing on back-to-back nights. \n\n\r\n              His absence spoiled a potential matchup between the winners of the four last MVPs. Antetokoumpo won the award in 2019 and 2020.\n\n\r\n              The Western Conference-leading Nuggets also were missing Jamal Murray (left knee/injury management), Kentavious Caldwell-Pope (sprained right wrist) and Michael Porter Jr. (personal reasons). Porter missed a third straight game.\n\n\r\n              “We didn't get the outcome that we wanted, but I saw a lot of great things from our group tonight that will help us moving forward,” Nuggets coach Michael Malone said.\n\n\r\n              Jrue Holiday had 20 points for the Bucks, who won despite committing 22 turnovers. Pat Connaughton scored a season-high 19 points, matched a career high with 12 rebounds and shot 7 of 8 overall and 5 of 6 on 3-point attempts.\n\n\r\n              Aaron Gordon had 26 points and 13 rebounds for the Nuggets. Bones Hyland added 15 points.\n\n\r\n              While the Nuggets were missing most of their top players, the Bucks also weren’t at full strength.\n\n\r\n              Milwaukee’s Bobby Portis missed a game for the first time this season after spraining his right medial collateral ligament and right wrist Monday in a 150-130 triumph at Detroit. The Bucks said Portis will be re-evaluated in two weeks. Bucks rookie MarJon Beauchamp was out due to patella tendinitis in his right knee.\n\n\r\n              After trailing by 14 early in the fourth quarter, the Nuggets cut the Bucks’ lead to 94-89 on Christian Braun’s 3-pointer with 5:01 left. The Bucks answered with five straight points and stayed ahead by at least seven the rest of the way, with Antetokounmpo going 9 of 15 from the line in the fourth quarter.\n\n\r\n              “It's a challenge,” Malone said. “The guy is great in transition. He's great in the paint. And he's by far the best in the NBA in terms of drawing fouls and living at the free-throw line.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: With injuries leaving the Nuggets at far below full strength, Vlatko Cancar made his first start of the season and third of his career, Braun made his second career start and Zeke Nnaji made his fifth start of the season and seventh of his career. \n\n\r\n              Bucks: Coach Mike Budenholzer said Portis’ injury hasn’t impacted the status of reserve center Serge Ibaka, who isn’t with the team and hasn’t played since Jan. 1. The Bucks and Ibaka mutually agreed that the team would try to explore a trade involving the 6-11 veteran. ... Khris Middleton came off the bench for the second straight time as he works his way back gradually from a sore right knee. Middleton, who has played just nine games this season, scored 10 points in 15 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Philadelphia on Saturday in the first matchup of the season between the teams.\n\n\r\n              Bucks: At Indiana on Friday. In their only previous meeting this season, the Bucks beat the Pacers 132-119 in Milwaukee on Jan. 16. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994572.058862
}