{
  "game_id": "0022200779",
  "espn_id": "401468934",
  "date": "Feb 02, 2023",
  "matchup": "MEM @ CLE",
  "headline": "Cavs All-Star Mitchell calls Grizzlies' Brooks dirty player",
  "body": "CLEVELAND -- — Donovan Mitchell took his most vicious shots at Dillon Brooks after the game.\n\n\r\n              Accusing Brooks of being a dirty player, Mitchell said the NBA needs to do something about the Memphis guard's unruly bad behavior after he smashed Cleveland's All-Star guard in the groin during the Cavaliers' 128-113 victory over the Grizzlies on Thursday night.\n\n\r\n              “That’s just who he is,” said Mitchell, who was ejected in the third quarter for throwing the ball at Brooks. \"We’ve seen it a bunch in this league with him. Him and I have had our personal battles for years.\n\n\r\n              “There’s no place for that in the game. This has been brewing for years with me and other guys in the league. You all see it. This isn’t new.”\n\n\r\n              Darius Garland scored 32 points shortly after being left off the All-Star team and carried Cleveland following Mitchell's ejection as the Cavs handed the Grizzlies their seventh loss in eight games.\n\n\r\n              Garland was one of several players having All-Star-caliber seasons not named an Eastern Conference reserve by the coaches. He added 11 assists as the Cavs bounced back from a tough loss to Miami on Tuesday night.\n\n\r\n              “He was brilliant,” Cavs coach J.B. Bickerstaff said. “He knew how important this game was to us and what we needed from him. That’s what leaders do.”\n\n\r\n              Mitchell, voted an All-Star starter last week, was tossed in the third quarter for throwing the ball at Brooks after the pair tangled under the basket. Brooks also was thrown out.\n\n\r\n              With the Cavs leading 81-76, Brooks missed a shot and fell in the lane. While on the floor, he flung his arm back and struck Mitchell, who was standing over him, in the groin area. Mitchell dropped in pain and retaliated by firing the ball at Brooks and then charging and shoving him along the baseline in front of the Memphis bench.\n\n\r\n              As the altercation threatened to spill into the seats, officials and players were able to get things under control before any punches were thrown.\n\n\r\n              It's possible the league could punish Brooks further, and Mitchell believes additional penalities are warranted.\n\n\r\n              “There should be something,” he said. \"This isn’t just a Donovan thing. This has happened to other players throughout this league, and it’s complete (expletive). Those guys talk (junk) and that’s fine, that’s all a part of basketball. We all grew up playing that way.\n\n\r\n              \"But when you start doing cheap (stuff), that ain’t it. That’s where my frustration lies. It’s not about talking back and forth. That’s cool, but when you start doing little stuff like that.”\n\n\r\n              Bickerstaff felt Mitchell, who said he has had previous run-ins with Brooks, had every right to defend himself.\n\n\r\n              “That was a cheap shot in multiple ways,” he said. \"A guy should have the right to stand up for himself. I thought Donovan did that. I’m proud of our guys. We don’t have those guys that start (expletive)t, but we have guys who don’t run from (expletive) shit and you have to in this league.\n\n\r\n              \"You have to stand up for yourself. That’s what he did and his teammates had his back.”\n\n\r\n              Brooks refused to discuss the altercation with Mitchell in any detail. When he was asked about the exchange, Memphis All-Star Ja Morant stepped in and said the Grizzlies would not talk about the incident.\n\n\r\n              Brooks did say he agreed with the flagrant-2 call.\n\n\r\n              “It saved me some T’s (technicals),” he said.\n\n\r\n              The Grizzlies have a reputation as the NBA’s most talkative team, but Morant believes they're being unfairly judged.\n\n\r\n              “Anything when it comes to negative about the Grizzlies, we normally, you know, get the punishment,\" Morant said. \"It ain’t the same. They (the NBA) hate us.”\n\n\r\n              While Mitchell said he and Brooks have a long history, Morant denied the Grizzlies having any issues with the four-time All-Star.\n\n\r\n              “We don’t got no history with nobody,” Morant said. \"We don’t beef with nobody.” \n\n\r\n              Cedi Osman scored 21 points and Jarrett Allen added 18 points and 11 rebounds for Cleveland.\n\n\r\n              Evan Mobley had 17 points and 14 rebounds.\n\n\r\n              Desmond Bane scored 25 points and Morant had 24 points, eight rebounds and eight assists for Grizzlies despite being in foul trouble most of the night. \n\n\r\n              Memphis played without All-Star forward Jaren Jackson Jr., who sustained a thigh bruise in Tuesday night in a loss to Portland.\n\n\r\n              FLY EAGLES FLY\n\n\r\n              Bickerstaff has a healthy rooting interest in the Super Bowl. He's a devoted Eagles fan.\n\n\r\n              Because he bounced around as a kid due to his dad, Bernie, being an NBA coach, Bickerstaff didn't have a favorite team. He found a favorite player.\n\n\r\n              “I loved Randall Cunningham,\" he said, mentioning Philadelphia's elusive quarterback and the reason why he pulls for the Eagles.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Jackson Jr. is on pace to become the first player to average at least 16 points and three blocks since Shaquille O’Neal and Alonzo Mourning did it in 1999-2000. ... C Steven Adams (right knee sprain) was unavailable for the sixth consecutive game. ... G Danny Green sat out after making his Memphis debut on Wednesday. He had been sidelined all season while rehabbing a torn left ACL.\n\n\r\n              Cavaliers: G Ricky Rubio scored 11 in the fourth. ... Caris LeVert was out with right hamstring soreness.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Toronto on Sunday.\n\n\r\n              Cavaliers: At Indiana on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994189.008692
}