{
  "game_id": "401809820",
  "espn_id": "401809820",
  "date": "Nov 28, 2025",
  "matchup": "LAL vs DAL",
  "headline": "Reaves scores 38 points, Luka adds 35, Lakers hold off Mavs 129-119 in Anthony Davis' LA return",
  "body": "LOS ANGELES -- — Austin Reaves scored 38 points, Luka Doncic added 35 points and 11 assists in his third meeting with his former team, and the Lakers spoiled Anthony Davis' return to Los Angeles with a 129-119 victory over the Dallas Mavericks on Friday night.\n\n\r\n              Davis had 13 points and five rebounds while on a minutes restriction in his first game in Los Angeles since the Lakers traded him for Doncic 10 months ago.\n\n\r\n              Reaves scored 19 points and Doncic added 17 in an impressive second half, allowing the Lakers to hold on for their sixth consecutive victory. They also swept four games of NBA Cup group play, earning a home quarterfinal.\n\n\r\n              LeBron James scored 13 points after managing just two in the first half, but he hit a decisive 3-pointer with two minutes to play. Reaves hit six 3-pointers and Doncic made four.\n\n\r\n              P.J. Washington scored 22 points and Ryan Nembhard added 17 for Dallas, while Max Christie scored 13 points against his former team. Rookie Cooper Flagg had 13 points, 11 assists and seven rebounds, but the Mavericks lost for the fifth time in six games despite a noticeable improvement on their recent play with Davis' return.\n\n\r\n              Dallas had a narrow lead with less than eight minutes to play, but the Lakers held the Mavs without a field goal for nearly four minutes while making a 13-1 run that included big baskets from Reaves and Deandre Ayton, who finished with 17 points.\n\n\r\n              In his return from a 14-game absence with a strained calf, Davis received a loud, warm reception from Lakers fans when introduced with the Mavs’ starters. The big man is beloved in LA after teaming up with James for a championship run during 5 1/2 seasons with the Lakers.\n\n\r\n              Up next\r\n              Mavericks: At Los Angeles Clippers on Saturday night.\n\n\r\n              Lakers: Host New Orleans on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042712.681004
}