{
  "game_id": "0022200915",
  "espn_id": "401469070",
  "date": "Feb 26, 2023",
  "matchup": "SAC @ OKC",
  "headline": "Fox scores 33 as Kings beat Thunder for 3rd straight win",
  "body": "OKLAHOMA CITY -- — Sacramento Kings coach Mike Brown was worried his team might come out flat two days after one of the wildest games in NBA history.\n\n\r\n              Sacramento defeated the Los Angeles Clippers 176-175 in two overtimes Friday night in the league's second highest-scoring game ever. As it turned out, Brown had nothing to worry about. \n\n\r\n              De'Aaron Fox had 33 points and eight assists and the Kings defeated the short-handed Oklahoma City Thunder 124-115 on Sunday night for their third straight victory.\n\n\r\n              The Kings led 36-26 after the first quarter and never trailed.\n\n\r\n              “At times, we start slow in situations like this, and it was great to see our starters go out there and kind of establish themselves and set the tone,” Brown said. \n\n\r\n              It was Sacramento's third game in four nights — another reason for the concern about energy.\n\n\r\n              “You take a win in that situation a thousand times out of a thousand times,\" Brown said. \n\n\r\n              Keegan Murray scored 20 points and Domantas Sabonis added 14 points, 15 rebounds and eight assists for the Kings, who shot 52.9% from the field.\n\n\r\n              “The effort it takes to defend them for 48 minutes is substantial because they play with great pace, they have good creators and they’ve got shooting everywhere,\" Thunder coach Mark Daigneault said. “So it’s not easy to do. But if you want to win the game, that’s what you have to do.”\n\n\r\n              Brown said he knew the Kings needed to take the Thunder seriously.\n\n\r\n              “It doesn’t matter if they’re down 15, down 20, up 20, they’re playing the same way,\" Brown said. \"They’re coming at you on both ends of the floor with physicality, that if you don’t match it, you’re going to get ran out of the gym.”\n\n\r\n              Isaiah Joe scored 24 points and Lu Dort and Josh Giddey each added 18 for Oklahoma City. The Thunder have lost all three of their games since the All-Star break.\n\n\r\n              Oklahoma City's Shai Gilgeous-Alexander sat out with right ankle soreness and an abdominal strain. The All-Star leads the Thunder with 31 points per game — fifth-most in the league heading into the night.\n\n\r\n              Fox scored 14 points in the first half to help the Kings take a 58-50 lead. He got loose for a windmill dunk on a fast break to give the Kings a 74-59 lead in the third quarter.\n\n\r\n              The Thunder got hot later in the period. Joe scored 11 points in the final 3:50 of the third quarter to trim Sacramento's lead to 94-90 heading into the fourth.\n\n\r\n              The Kings threatened to run away with the game before Joe made a 3-pointer, was fouled and made the free throw with 5:19 remaining to trim Sacramento's lead to 113-104, but the Thunder never made another surge.\n\n\r\n              “They’re a great offensive team, obviously, so there’s got to be a little more resistance defensively to beat them,” Daigneault said. “I thought we got to it in the second quarter a little bit and at different times throughout the game, but not consistently enough.”\n\n\r\n              SPECIAL HONOR\n\n\r\n              The Kings honored radio play-by-play man Gary “G-Man” Gerould as Defensive Player of the Game in honor of his 3,000th Kings broadcast over 38 years.\n\n\r\n              The team cheered the decision loudly in the locker room.\n\n\r\n              “I think that was probably the best call by our coaching staff,” Brown said. “I think our players really thought that G-Man deserved it tonight because of his ability to communicate.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: Sabonis, who was drafted by Orlando in 2016 and traded to Oklahoma City that same night, had nine points, five rebounds and five assists in the first quarter. ... Trey Lyles scored 16 points. \n\n\r\n              Thunder: Joe got the start in place of Gilgeous-Alexander. ... Jalen Williams scored 15 points and Lindy Waters III added 12.\n\n\r\n              UP NEXT\n\n\r\n              The teams play again Tuesday in Oklahoma City. \n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995291.6570969
}