{
  "game_id": "0022200262",
  "espn_id": "401468417",
  "date": "Nov 23, 2022",
  "matchup": "IND vs. MIN",
  "headline": "Towns powers Timberwolves past Pacers for 5th straight win",
  "body": "INDIANAPOLIS -- — Karl-Anthony Towns scored 23 points — nine of them in a row in a key third-quarter run — and the Minnesota Timberwolves beat the Indiana Pacers 115-101 on Wednesday night.\n\n\r\n              Minnesota has won five in a row, four of them on the road, to improve to 10-8. Indiana had a five-game winning streak snapped to drop to 10-7.\n\n\r\n              “I just felt it was important to press the gas,” Towns said about the third quarter. “They came out third quarter with a little bit of fire in them so I wanted to do what I could do to extinguish that or at least match it.”\n\n\r\n              The Pacers closed to a two-point deficit in the third quarter when Towns had the nine-point run as part of a 13-point quarter, after which the Timberwolves led 87-77. The Pacers were never within six points after that. Towns also had 11 rebounds and eight assists. \n\n\r\n              “That team was playing amazingly well and we came in with a lot of respect for them but not intimidated,” Towns said. “If they were going to beat us, we felt like they've got to beat us playing our best.”\n\n\r\n              All five Timberwolves starters scored in double digits. Rudy Gobert had 21 points and 16 rebounds, Anthony Edwards 19 points, Jaden McDaniels 18 and D'Angelo Russell 15 points and 11 assists.\n\n\r\n              “It's been fun, every night we try to set the tone,” Gobert said of the inside play. “I thought Karl did an amazing job and I tried to be more aggressive.”\n\n\r\n              The Timberwolves shot 60.3 percent (47 of 78) compared to the Pacers' 38.5 percent (37 of 96).\n\n\r\n              “I just told the guys that was the best performance of our season, no doubt,\" Timberwolves coach Chris Finch said.\n\n\r\n              Myles Turner led the Pacers with 31 points, including seven 3s. Sixth-man Bennedict Mathurin scored 16 of his 21 in the first half.\n\n\r\n              “We've got to defend better and be better on offense, both sides of the ball,” Pacers coach Rick Carlisle said.\n\n\r\n              The Pacers' top season scorer, Tyrese Haliburton at 20.4 points per game, had an off night with 10 points on 4-of-15 shooting. He did have 12 assists.\n\n\r\n              “We'll have to regroup and get ready for Friday,” Carlisle said. “We're playing better teams. Minnesota is a playoff team. Portland has been a playoff team. We'll play better Friday, I'm confident of that.”\n\n\r\n              Minnesota, which ranks second in first-quarter scoring, scored the game's initial eight points and led by as much as 27-10 early. Indiana, the league's worst in first-quarter scoring, trailed 29-21 entering the second quarter.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Towns appeared in his 500th career game. He's just the fifth NBA player in three decades to amass 11,000 points and 5,000 rebounds in that span.\n\n\r\n              Pacers: Haliburton leads NBA in assists at 10.5 per game. ... SG Andrew Nembhard (left knee) missed his second consecutive start.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Charlotte on Friday night.\n\n\r\n              Pacers: Host Brooklyn on Friday night.\n\n\r\n              ----",
  "source": "espn_api",
  "crawled_at": 1764994336.420584
}