{
  "game_id": "0022200732",
  "espn_id": "401468887",
  "date": "Jan 26, 2023",
  "matchup": "CHA vs. CHI",
  "headline": "Rozier, Plumlee lead Hornets past Bulls 111-96",
  "body": "CHARLOTTE, N.C. -- — Terry Rozier scored 28 points, Mason Plumlee added yet another strong performance with 21 points and 12 rebounds and the Charlotte Hornets defeated the Chicago Bulls 111-96 on Thursday night.\n\n\r\n              Gordon Hayward scored 17 points, and LaMelo Ball returned from a three-game absence due to a sprained ankle and wrist injury and chipped in with 15 points, 11 rebounds and eight assists to overcome a horrible 2-for-15 shooting night.\n\n\r\n              Plumlee, meanwhile, was 9 of 9 from the field, continuing a remarkable run in which he is averaging 17.5 points and 11.2 rebounds over the last 14 games while shooting a 75.8% (94 of 124) from the field.\n\n\r\n              Hornets coach Steve Clifford said the biggest difference is Plumlee's game this season is he's more confident in his free throw shooting and is attacking the basket more aggressively, trying to draw contact instead of avoiding it.\n\n\r\n              Plumlee shot 39.2% from the free throw line last year and eventually changed from shooting right-handed to left-handed.\n\n\r\n              He's shooting 66.6% from the line this year with his left hand.\n\n\r\n              “He has such good instincts, he’s faking and creating contact versus the film I watched last year, he wasn’t going into contact as much,\" Clifford said. \"... He’s taking the ball hard to the basket, and he feels good about his free throw shooting. To be able to do what he’s done (switching shooting hands), I’m not sure many people can do that. He was in here all summer doing it, so he’s got confidence.” \n\n\r\n              Plumlee is even shooting his jump shots left-handed, although he doesn't attempt many.\n\n\r\n              But he buried a 14-footer with 1:30 left in the game to put Charlotte up by 12, screaming excitedly at the Hornets' bench prompting his teammates to jump out of their seats and wave towels.\n\n\r\n              “He works on it every day, so it’s about time he took one,” joked Rozier.\n\n\r\n              Said Plumlee: “Just felt good. Low clock, stepping into it. It felt good.\"\n\n\r\n              DeMar DeRozan had 28 points for the Bulls, while Zach LaVine finished with 18 points and nine rebounds, but was quiet in the second half. Patrick Williams had 15 points, but Chicago’s three-game win streak came to an end.\n\n\r\n              The Bulls built a 55-47 lead at halftime behind a balanced attack while holding the Hornets to 39.5% shooting the first half.\n\n\r\n              But the Hornets battled back to tie the game at 71 late in the third quarter behind Rozier, who tied a franchise record with five third quarter steals while turning the momentum with six straight points.\n\n\r\n              Charlotte began to pull away in the fourth quarter, building a 97-88 lead behind a 3-pointer from Ball and a driving layup by Plumlee. Ball and Plumlee combined for 18 points in the fourth.\n\n\r\n              The Hornets had lost seven of their last nine games, but played an inspired second half, particularly on defense. They limited to the Bulls to 5-of-24 shooting from the field and outscored Chicago 34-17.\n\n\r\n              “There are going to be those nights where we didn’t shoot the ball well at all from the 3, we just didn’t,” Bulls coach Billy Donovan said. “We have got to find just more desperation. We have got to become more desperate, and I think there are times where we are just not desperate enough and that is what it is going to take.” \n\n\r\n              VROOM VROOM\n\n\r\n              NASCAR drivers Bubba Wallace, Kurt Busch and Tyler Reddick took in the game from courtside as the part of “crossover night.” All three drive for the 23XI NASCAR team co-owned by Hornets owner Michael Jordan and driver Denny Hamlin.\n\n\r\n              TIP INS\n\n\r\n              Bulls: Only received 11 points from their bench.\n\n\r\n              Hornets: Outrebounded the Bulls 52-43.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Orlando on Saturday.\n\n\r\n              Hornets: Host Miami on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994261.4149811
}