{
  "game_id": "0022200961",
  "espn_id": "401469116",
  "date": "Mar 04, 2023",
  "matchup": "MIN @ SAC",
  "headline": "Anthony Edwards scores 27 points, Timberwolves edge Kings",
  "body": "SACRAMENTO, Calif. -- — Anthony Edwards scored 27 points and the Minnesota Timberwolves beat Sacramento 138-134 on Saturday night to snap the Kings' winning streak at five games.\n\n\r\n              “De'Aaron Fox has been playing out of his mind,” Edwards said. “We were happy to hold him under 30 tonight. He still played great though in the fourth.”\n\n\r\n              Edwards added eight assists to help Minnesota (34-32) win its third straight. Mike Conley scored 24 points and made two free throws with 15.7 seconds left to extend the lead to four.\n\n\r\n              Jaden McDaniels added 19 points, and Kyle Anderson nearly had a triple-double with 18 points, nine assists and seven rebounds. Rudy Gobert had 13 points and 14 rebounds.\n\n\r\n              \"I thought we played great all night long,” Timberwolves coach Chris Finch said. “Especially when they tightened it up at the end. …we play a lot in flow. A lot of it was Anthony (Edwards) stepping up at the right time.”\n\n\r\n              Kevin Huerter scored 29 points for Sacramento (37-26). He made six three-pointers. ox had 25 points and seven assists, and Domantas Sabonis had 24 points, 14 rebounds and five assists.\n\n\r\n              “At the end of the day, no matter how tired we were, we were terrible defensively,” Kings forward Trey Lyles said “We can outscore anybody, but we cant stop anybody.”\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: C Karl Anthony-Towns remains out with a left knee injury. … Minnesota shot 20 of 39 from 3-point range.\n\n\r\n              Kings: C Richaun Holmes missed his second straight game because of a non-COVID illness. … Sacramento was 22 of 30 on free throws after going 26 of 26 in a victory over the Los Angeles Clippers on Friday night.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host New Orleans on Monday night.\n\n\r\n              Timberwolves: Host the Philadelphia on Tuesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995017.645347
}