{
  "game_id": "0022300254",
  "espn_id": "401584882",
  "date": "Nov 27, 2023",
  "matchup": "IND vs. POR",
  "headline": "Grant, Ayton lead the Trail Blazers to a 114-110 victory over the Pacers",
  "body": "INDIANAPOLIS -- — Jerami Grant scored 34 points and Deandre Ayton had 22 points and 13 rebounds to power the Portland Trail Blazers to a 114-110 victory over the Indiana Pacers on Monday night.\n\n\r\n              Malcolm Brogdon added 24 points for the Trail Blazers, including a game-sealing basket in the closing seconds.\n\n\r\n              “I got some shots to go,” said Grant, who hit 12 of 18 shots. “I just wanted to be aggressive.”\n\n\r\n              Tyrese Haliburton led Indiana with 33 points. Bruce Brown, Myles Turner and Bennedict Mathurin each had 11, but the Pacers were slowed by 20 turnovers and 8-for-33 shooting from 3-point range.\n\n\r\n              “It was a really poor performance, uninspired in many ways,” Pacers coach Rick Carlisle said. \n\n\r\n              \"Getting up for In-Season Tournament games and thinking that we can walk out and just beat other teams is ignorant. I’ve got to do a better job of convincing our guys that, so it’s very disappointing. We all own it. I own it just as much as anybody in there.”\n\n\r\n              Following a Portland turnover, Brown scored to cut the deficit to 112-110 before Brogdon's driving 7-footer put the Trail Blazers ahead 114-110 with 6 seconds left. The Pacers' Buddy Hield missed a long 3-pointer with 2.1 seconds remaining.\n\n\r\n              Rookie Scoot Henderson sank a 12-footer at the end of the third quarter to tie it at 83-all. The teams then traded the lead for the next few minutes. Grant put the Trail Blazers ahead for good at 96-94 with a driving floater with 6:36 to play.\n\n\r\n              The Trail Blazers had surrendered a 26-point lead in the third quarter in a 108-102 loss at Milwaukee on Sunday.\n\n\r\n              “We knew we had to stay poised,\" Grant said.\n\n\r\n              Trail Blazers coach Chauncey Billups said he was proud of the team bouncing back after the emotional loss.\n\n\r\n              “We knew what we had to do to give our team a chance playing against a team that is so brilliant offensively like they are,” Billups said. “We said we had to win first 10 seconds of every possession if we are going to give ourselves a chance to win. For 70% of the game, we did that. We are trying to establish ourselves as a good defensive team and I thought today was an important step.\"\n\n\r\n              The Trail Blazers trailed by four after the first quarter before moving into a 65-60 halftime lead. Portland sank 7 of 11 3-pointers in the first half, while the Pacers were 5 off 15. Brogdon, who played three seasons with the Pacers, led Portland with 15 points in the opening half.\n\n\r\n              Pacers forward Jalen Smith had to be helped to the locker room with a heel contusion with 4:09 left in the third quarter. Smith had nine points.\n\n\r\n              Aaron Nesmith returned for the Pacers after missing the previous two games with a wrist sprain.\n\n\r\n              The Pacers shot 47.7% for the game while the Trail Blazers made 47.1%.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Cleveland on Thursday.\n\n\r\n              Pacers: At Miami for games on Thursday and Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996207.734059
}