{
  "game_id": "0022200756",
  "espn_id": "401468911",
  "date": "Jan 30, 2023",
  "matchup": "ORL @ PHI",
  "headline": "Banchero, Magic rally from early hole, beat 76ers 119-109",
  "body": "PHILADELPHIA -- — Paolo Banchero had 29 points and 10 rebounds as the Orlando Magic stormed back from a 21-point first-quarter deficit to beat the Philadelphia 76ers 119-109 on Monday night.\n\n\r\n              Mo Wagner scored 22 points and his younger brother Franz Wagner scored 19 for the Magic, who stopped a three-game skid and ended the Sixers' seven-game winning streak.\n\n\r\n              It was the latest win over one of the NBA's top teams for the Magic, who improved to 15-11 since their 6-20 start.\n\n\r\n              “They are learning from experiences,” Magic coach Jamahl Mosley said. “They are finding ways to bounce back and believe in each other and understand that it’s got to start on the defensive side of the ball.”\n\n\r\n              Orlando has beaten Boston three times, Golden State twice, Dallas, Phoenix and now Philadelphia.\n\n\r\n              “We are a very good team,” Banchero said. “We just have to learn how to put this effort out every night. We have to be able to take this game and take it to the next game and the game after that no matter who the opponent is.”\n\n\r\n              Joel Embiid had 30 points and 11 rebounds for Philadelphia, his 27th game this season scoring 30 or more and his ninth in the past 10. But he also led the Sixers in turnovers with six, got into foul trouble in the fourth quarter and was visibly frustrated by Orlando's physical defense.\n\n\r\n              The Magic forced 19 turnovers and held Philly to 19 points in the fourth quarter. The 21-point deficit was the largest Orlando has overcome this season and the sixth-largest in franchise history.\n\n\r\n              The Magic methodically worked their way back from the early hole, trimming the Sixers' lead to 10 points at halftime. Orlando went ahead for the first time on a 3-pointer by Gary Harris in the third quarter.\n\n\r\n              “We just wanted to challenge them and turn the heat up,” Banchero said. “We weren’t doing that in the first half and gave them too many easy buckets. You’re not going to stop Embiid, you just have to challenge him and make it difficult on him and we did a good job.”\n\n\r\n              The Magic took the lead for good with 7:03 to play when Mo Wagner made a reverse layup, was fouled and converted the free throw. Wagner converted another three-point play 19 seconds later when he was fouled by Embiid on a driving layup.\n\n\r\n              Sixers coach Doc Rivers unsuccessfully challenged the foul call on Embiid, insisting his big man had established defensive position.\n\n\r\n              Cole Anthony followed with a 3-pointer to complete a 9-0 Orlando run, and the Sixers got no closer than six points the rest of the way.\n\n\r\n              “I don’t think we played with any pace,” Rivers said. “Their pressure, their physicality ... they got into us. We turned the ball over. We were flopping to try to draw fouls. We just turned it off and couldn’t get it back.”\n\n\r\n              Tobias Harris and James Harden scored 17 points apiece for the Sixers.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Almost four years after the Sixers traded him to Orlando, Markelle Fultz played his first game in Philadelphia as a visitor. The former No. 1 overall draft pick has been injured each time the Magic played in Philly since the trade, although he played a road game against the Sixers in 2020 during the pandemic bubble in Florida. Fultz finished with 12 points and 10 assists and said the experience was “amazing.”\n\n\r\n              76ers: Philadelphia has been the hottest team in the NBA for nearly two months but has benefited from playing the league's third-easiest schedule entering Monday night's game. The Sixers have the second-toughest remaining schedule and will play 17 games in March, including 11 on the road. \n\n\r\n              UP NEXT\n\n\r\n              The teams play again at Philadelphia on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994623.659323
}