{
  "game_id": "0022200788",
  "espn_id": "401468943",
  "date": "Feb 03, 2023",
  "matchup": "PHX @ BOS",
  "headline": "Bridges scores 25, leads Suns to 106-94 win over Celtics",
  "body": "BOSTON -- — Devin Booker wore a hockey toque to deal with the sub-zero temperatures in Boston and pulled out a baseball metaphor to describe his possible return to the basketball court.\n\n\r\n              “Rounding third,” Booker said after watching from the bench as his Phoenix Suns teammates beat the Celtics 106-94 on Friday night. \n\n\r\n              Mikal Bridges scored 25 points and Dario Saric had 14 with 13 rebounds Friday night to lead the Phoenix Suns to a 106-94 victory over Boston and send the NBA-leading Celtics to their fourth loss in six games. \n\n\r\n              Chris Paul added 15 points, eight assists and six rebounds for Phoenix, which had a 20-point, second-quarter lead trimmed to one by the end of the third. The Suns opened the fourth with eight straight points to turn back Boston’s rally. \n\n\r\n              Booker, a native of Grand Rapids, Michigan, wore a Detroit Red Wings knit cap as he sat on the bench in the same building where he scored 70 points in 2017. He hasn't played since sustaining a groin injury on Christmas; it was just the second time he has joined the team on a road trip since.\n\n\r\n              “I'm mindful of what I say because I don't want to get everybody excited about it, or depress everybody, either. It's just where he is,” Suns coach Monty Williams said before the game. “We do feel like he’s getting closer and closer to coming back.\"\n\n\r\n              The Suns lost nine of their first 11 games after the three-time All-Star went out, but have won seven of the last nine while they wait for his return, which could come during current the five-game road trip.\n\n\r\n              “For us to win it without Book is big for everyone’s confidence, because he will be back shortly,” center Jock Landale said. “We would have liked to win a few more games, but now that we’re winning a lot of games and he’s on the verge of coming back, it’s big for us.” \n\n\r\n              Jaylen Brown scored 27 points and Jayson Tatum had 20 for the Celtics, who beat the Brooklyn Nets by 43 points on Wednesday and beat the Suns by 27 in December. But the two Boston All-Stars shot a combined 12 for 36 from the floor and 6 for 22 from 3-point range.\n\n\r\n              The Suns led 74-73 to start the fourth quarter before running off the next eight points, prompting Boston coach Joe Mazzulla to call a timeout. Derrick White drove for a layup to snap the slump, but Damion Lee and Saric hit back-to-back 3s, and the Celtics never got closer than six from there. \n\n\r\n              The Celtics scored the first seven points of the game, but quickly gave it all back. Phoenix scored the next 12, with Ayton putting in three straight baskets to start the run. \n\n\r\n              The Suns started the second quarter with back-to-back 3-pointers by Ish Wainright and Lee — sparking another 8-0 run that helped them open a 32-20 lead. It was up to 20 points with four minutes left in the second before Tatum hit his first basket of the game — a 3-pointer — as Boston scored 11 in a row before going into the half trailing 57-44.\n\n\r\n              TIP-INS\n\n\r\n              Tatum missed his first six shots. ... Wainright sank a full-court shot, but it was just after the buzzer to end the third quarter. ... Boston's Luke Kornet left early in the fourth and limped to the locker room. ... The Celtics took the court on Jan. 23 with a 35-12 record and a nine-game winning streak.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Detroit on Saturday.\n\n\r\n              Celtics: At Detroit on Monday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995075.211584
}