{
  "game_id": "0021500155",
  "espn_id": "400828042",
  "date": "Nov 16, 2015",
  "matchup": "OKC @ MEM",
  "headline": "Chalmers scores 29 to led Grizzlies over Thunder 122-114",
  "body": "MEMPHIS, Tenn. -- Mario Chalmers' transformation from one of the most despised figures in Memphis basketball history to fan favorite has taken all of three games.\nHis season-best scoring performance Monday night completed the transition.\nChalmers scored 16 of his 29 points in the fourth quarter as the Memphis Grizzlies held on for a 122-114 victory over the Oklahoma City Thunder.\nAs Chalmers got going in the final quarter, Memphis fans were on their feet cheering the guard acquired last week in a trade with the Miami Heat. One fan hollered: \"I never thought I would cheer for Mario Chalmers.\"\n\nBefore the trade, Chalmers was known in Memphis as the guy whose 3-pointer sent the 2008 national championship game against the Memphis Tigers into overtime -- a game eventually won by Chalmers' Kansas Jayhawks.\nOn Monday, he converted 6 of 13 shots, including 4 of 7 from outside the arc, as five Grizzlies reached double figures. Mike Conley had 22, Jeff Green scored 20, while Marc Gasol added 17. Zach Randolph finished with 12 points and 10 rebounds.\nRussell Westbrook led the Thunder with 40 points, 12 in the fourth quarter trying to bring Oklahoma City back from an 11-point deficit. Serge Ibaka had 18 and Enes Kanter scored 16. Steven Adams and Dion Waiters finished with 14 apiece.\nOklahoma City shot 51 percent, including 10 of 24 from outside the arc. But Memphis converted 12 of 17 3-pointers, much out of character for the Grizzlies, who entered the game ranked near the bottom in 3-point shooting at 29 percent.\n\"I've always been a big believer that when the three-point shot goes up, it's dangerous,\" Thunder coach Billy Donovan said, adding: \"To their credit, they made them.\"\nWestbrook tried to bring the Thunder back in the fourth, fueling a 10-2 rally that pulled Oklahoma City within 108-105 with 1:26 left.\nBut 3-pointers by Conley and JaMychal Green put the game away for Memphis, which won its third straight.\n\"They made some big shots at the end of the game,\" Westbrook said. \".They just made the last run and won the game.\"\nChalmers said the reaction of the Memphis fans despite his role in the national championship game has been refreshing.\n\"It actually gave me more motivation,\" Chalmers said of the cheers. \"Just to come out and prove to the fans that I want to be here. I belong here.\n\"And hopefully they'll forget about 2008,\" he said with a laugh.\nTIP-INS:\nThunder: Andre Roberson sat out the game with flu. Kyle Singler started his first game of the season in Roberson's spot. .Rookie Cameron Payne is from Memphis and played high school ball at Lausanne, the same school Gasol attended. He hit a 3-pointer to close the third quarter, his only points in the game.\nGrizzlies: The Grizzlies wore throwback jerseys of the Memphis Sounds, the local ABA franchise for the 1974-75 season, the last for a Memphis franchise in the league. It was the first of eight times, Memphis will wear the red and white Sounds uniforms. ... Chalmers previous high for the season was 16 against Minnesota.\nGOOD TO SEE YOU AGAIN: The Grizzlies and Thunder have played 39 times, including the playoffs, since the start of the 2010-11 season. That's the most games between two teams in the league over that span.\nDURANT STATUS: The Thunder were without Kevin Durant, who missed his third straight game with a left hamstring strain. Before Donovan said the team is waiting for the next evaluation in a week to determine a timetable for Durant's return. Durant's shot is not impacted, Donovan said, and he can move around tolerating the pain. He's just not ready for basketball work. \"Whenever the doctors feel like he needs to be looked at after that week's period, I'll probably have more of an idea where he's at,\" Donovan said.\nUP NEXT\nThunder: Host Pelicans on Wednesday.\nGrizzlies: Host Rockets on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994215.540672
}