{
  "game_id": "0021600794",
  "espn_id": "400900199",
  "date": "Feb 09, 2017",
  "matchup": "CHA vs. HOU",
  "headline": "Harden scores 30, Rockets beat Hornets 107-95",
  "body": "CHARLOTTE, N.C. --  James Harden had another big offensive night for the Houston Rockets, though the All-Star guard was more excited about his team's effort on the other side of the ball.\n\nHarden had 30 points, 11 rebounds and eight assists, and the Rockets forced 22 turnovers that led to 27 points in a 107-95 win over the Charlotte Hornets on Thursday night.\n\n\"Our communication was really good,\" Harden said. \"We switched off and we contained the ball and contained their shots and closed out. And we made tough shots and took care of the basketball. If we do all of those consistently, we'll be a very good team.\"\n\nThey already are.\n\nPatrick Beverley had 17 points and Montrezl Harrell added 15 off the bench as the Rockets improved to 39-17.\n\nIt was the 25th time Harden has scored at least 30 points along with his league-high 44th double-double. Harden shook off a 2-of-11 start from the field with a big third quarter.\n\n\"They're not going to shut him out the whole game,\" Rockets coach Mike D'Antoni said. \"He's pretty good.  He's pretty special.\"\n\nHarden was just 8 of 21 from the field and had nine turnovers but picked up his play in a decisive third quarter as the Rockets erased a nine-point deficit by outscoring the Hornets 36-22.\n\nCharlotte had 12 turnovers in the third quarter alone.\n\n\"That's just too much, especially against that team -- a team that can score,\" said Hornets guard Nic Batum, who finished with a team-high 15 points and 10 assists.\n\nKemba Walker had 14 points and a season-high six turnovers for the Hornets, who have lost eight of nine.\n\nThe Hornets built a 54-50 halftime lead, holding Harden to 13 points on 3-of-12 shooting.\n\nBut the game got away in the third quarter after a series of miscues, including two bad passes by Batum. The Rockets took command with Harden scoring 14 points.\n\n\"James took over the game,\" Batum said. \"I don't know who is going to be the MVP, but he's up there.\"\n\nBeverley stretched Houston's lead to double digits with less than 3 minutes to play, sending fans streaming to the exits when he knocked down a jumper in the corner over Walker, then stared down the Hornets All-Star point guard and put his hand over his face as he retreated down the floor. The Hornets never challenged after that.\n\nTIP-INS\n\nRockets: Clint Capela had his 30th game this season with 10-plus points, scoring 11.\n\nHornets: Cody Zeller returned to the starting lineup after missing seven games with a quad contusion.  However, he left the game in the second half with soreness in the quad and finished with nine points and four rebounds.\n\nSHORT BENCH\n\nEric Gordon (back soreness) and Nene (shoulder) did not play for the Rockets.\n\nHouston only used eight players, but six finished in double digits in scoring.\n\n\"This is what we need in games like that. Everybody stepped up tonight and was playing well,\" said Rockets forward Ryan Anderson, who had 14 points. \"Everybody was aggressive (and) making shots. This is what we needed to win the game again.\"\n\nNENE's SHOULDER\n\nD'Antoni said Nene's shoulder is \"not bad\" but he needed the rest.\n\nBEVERLEY COMES THROUGH\n\nCharlotte coach Steve Clifford felt Beverley was the difference in the game, hitting two big 3-pointers in the second half.\n\n\"He ran their team. He was their secondary pick-and-roll player and outside of Harden, he was the key to the game,\" Clifford said.\n\nUP NEXT\n\nRockets: Return home to host Phoenix on Saturday night.\n\nHornets: Host the Clippers on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995492.303047
}