{
  "game_id": "0021700304",
  "espn_id": "400975055",
  "date": "Nov 29, 2017",
  "matchup": "OKC @ ORL",
  "headline": "Gordon has 40 and 15, Magic beat Thunder to end 9-game skid",
  "body": "ORLANDO, Fla. --  Aaron Gordon never got out of control, and that made all the difference for the Magic.\n\n\"I think that's what was special about his night -- he wasn't out there trying to play superhero,\" coach Frank Vogel said. \"He played within himself for the most part, and as a result he shot a high percentage.\"\n\nGordon had 40 points and 15 rebounds Wednesday to help Orlando end a nine-game losing streak with a 121-108 win over the struggling Oklahoma City Thunder.\n\n\"I was just aggressive, taking opportunities, not passing anything up. If the open pass presented itself, then I was making the right read,\" he said.\n\nGordon made 13 of 23 shots (57 percent) and scored 20 points in each half. He played the entire second half.\n\n\"He played under control, that was the biggest thing,\" Magic guard D.J. Augustin said. \"It didn't even look like he had that many points because he wasn't forcing anything.\"\n\nRussell Westbrook hit five 3-pointers and scored 20 of his 37 points in the fourth quarter for the Thunder, who lost for the fifth time in six games. Westbrook shot 7 for 10 on 3s and added 11 rebounds, five assists and five steals.\n\n\"It's my responsibility to make sure we're ready to play on both sides of the ball,\" Westbrook said. \"To get us out of this funk we've got to lock in. That starts with me and I'll take ownership because I've been here (and) I know the standards we set.\"\n\nElfrid Payton had 19 points and Evan Fournier added 16 for the Magic, who shot 59 percent in winning for the first time since Nov. 10.\n\nThe Thunder went without a field goal for more than five minutes late in the third period, then went scoreless for the first 3 1/2 minutes of the fourth. They were outscored 28-5 during that span.\n\n\"When the ball moves and you generate assists ... you're going to shoot a relatively high percentage,\" Thunder coach Billy Donovan said. \"I thought in the second half we weren't really able to do that consistently.\"\n\nFournier's free throw with 4:22 left in the third quarter put Orlando ahead to stay.\n\nThe Magic led 100-80 when Westbrook made the first of his fourth-quarter 3s, and his last one cut Orlando's lead to 109-99 with 4:01 remaining. But Nikola Vucevic hit an open jumper and Payton sank a free throw to turn back the Thunder's comeback attempt.\n\nPaul George scored 22 points for the Thunder, who went 0-7 on the road in November.\n\nTIP-INS\n\nThunder: The game ended Westbrook's streak of three straight triple-doubles against Orlando, including his 57-point, 13-rebound, 11-assist performance in an overtime win here on March 29.\n\nMagic: G-F Terrence Ross left in the second quarter with a right knee injury. ... The Magic came in ranked 29th in total rebound percentage and defensive rebound percentage. \"We have guys that don't commit to boxing out, quite frankly,\" Vogel said.\n\nUP NEXT\n\nThunder: Friday night's home game against Minnesota will be the first of 13 games in 24 days.\n\nMagic: The defending NBA champion Golden State Warriors, who have beaten the Magic nine straight times, make their annual visit to Orlando on Friday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993129.809603
}