{
  "game_id": "0022401043",
  "espn_id": "401705609",
  "date": "Mar 24, 2025",
  "matchup": "MIL @ PHX",
  "headline": "Booker hits clutch jumper with 2.4 seconds left to lift Suns over Bucks 108-106 for 4th straight win",
  "body": "PHOENIX -- — Devin Booker made a mid-range jumper with 2.4 seconds remaining to lift the Phoenix Suns over the Milwaukee Bucks 108-106 on Monday night for their fourth straight win.\n\n\r\n              It's a crucial victory for the Suns, who stayed in the final position for the Western Conference play-in tournament with 10 games remaining in the regular season. Kevin Durant scored 38 points, while Booker added 19, including the clutch 20-foot jumper after catching the in-bounds pass in the final moments.\n\n\r\n              Brook Lopez missed a turnaround jumper at the buzzer that could have tied it, ending a frantic final stretch. Milwaukee was led by Giannis Antetokoumpo, who scored 31 points. Lopez added 23.\n\n\r\n              Milwaukee's Kyle Kuzma hit a corner 3-pointer with 1:22 left while being fouled by Durant and completed the 4-point play for a 105-103 lead. Durant responded with a 3 with 26.2 seconds left to put the Suns up 106-105.\n\n\r\n              Lopez made 1 of 2 free throws with 10.7 seconds left to tie it at 106, setting up Booker's winner.\n\n\r\n              Durant scored 13 points in the third quarter to help the Suns take an 81-78 advantage into the fourth.\n\n\r\n              Takeaways\r\n              Bucks: It's a tough loss for the Bucks, who are fighting for the No. 3 through No. 6 playoff positions in the Eastern Conference with the Knicks, Pacers and Pistons.\n\n\r\n              Suns: Coach Mike Budenholzer has tinkered with the playing rotation all season in an effort to find a competitive group to put around Booker and Durant. The current mix of Nick Richards, rookie Ryan Dunn and Collin Gillespie isn't perfect, but its been better than most.\n\n\r\n              Key moment\r\n              Dunn threw down a huge one-handed jam over Antetokounmpo in the third quarter for a 68-67 lead.\n\n\r\n              Key stat\r\n              Phoenix had a 52-36 rebounding edge.\n\n\r\n              Up next\r\n              The Bucks are on the road against the Nuggets on Wednesday; The Suns host the Celtics on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997821.1871018
}