{
  "game_id": "0022400600",
  "espn_id": "401705166",
  "date": "Jan 20, 2025",
  "matchup": "HOU vs. DET",
  "headline": "Cunningham scores 32 points to lead the Pistons over the Rockets 107-96",
  "body": "HOUSTON -- — Cade Cunningham had 32 points, nine rebounds and seven assists to lead the Detroit Pistons to a 107-96 win over the Houston Rockets on Monday.\n\n\r\n              Cunningham was 12 of 22 from the field. He scored 19 points in the third quarter as the Pistons built a 90-80 lead after three.\n\n\r\n              Jalen Duren had 16 points and 14 rebounds, Malik Beasley added 17 points off the bench, and Ausar Thompson had 11 points and nine rebounds for the Pistons, who shot 48% and were 10 of 27 on 3-pointers.\n\n\r\n              Fred VanVleet scored 20 points, and Jalen Green scored 19 points. Amen Thompson, who missed the game at Portland on Saturday with left calf soreness, added 17 points for Houston, which shot 39% and struggled from 3, connecting on 11 of 39.\n\n\r\n              Takeaways\r\n              Detroit: The Pistons committed 23 turnovers but were able to overcome it by forcing the Rockets into 17 turnovers and converting it into 19 points.\n\n\r\n              Houston: The Rockets got balanced scoring with five players in double figures, including Alperen Sengun, who had 11 points and eight rebounds, and Cam Whitmore, who had 10 points off the bench, but they couldn’t overcome poor shooting.\n\n\r\n              Key moment\r\n              After Houston cut Detroit’s lead to 90-85 three minutes into the fourth quarter, Marcus Sasser hit a jumper and three-pointer to spark an 11-2 run as Detroit pulled away.\n\n\r\n              Key stat\r\n              Detroit had a 52-39 advantage in rebounding and a 50-40 edge in points in the paint.\n\n\r\n              Up next\r\n              Houston hosts Cleveland on Wednesday, and Detroit plays at Atlanta the same day.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997382.1536698
}