{
  "game_id": "0022000690",
  "espn_id": "401307479",
  "date": "Mar 26, 2021",
  "matchup": "IND @ DAL",
  "headline": "Sabonis, Brogdon lead Pacers past Doncic-less Mavs, 109-94",
  "body": "DALLAS -- — Domantas Sabonis had 22 points and 15 rebounds, Malcolm Brogdon also scored 22 points, and the Indiana Pacers hit early and often from long range in a 109-94 win over the Dallas Mavericks on Friday night.\n\n\r\n                    The Pacers hit 20 3-pointers led by Brogdon’s 6-for-9 effort, matching the franchise record they previously set this season, to win for the fourth time in their last five games.\n\n\r\n                    “I thought it was a gritty effort, a grind-it-out win,” Pacers coach Nate Bjorkgren said. “It was a good team win. We’re sharing it. We’re playing hard for each other.”\n\n\r\n                    Kristaps Porzingis had 31 points and a season-high 18 rebounds for the Mavericks, who played without All-Star guard Luka Doncic — among the top five in the NBA in scoring and assists — due to back tightness. Tim Hardaway Jr., second among NBA reserves in scoring, had 16 points.\n\n\r\n                    Dallas coach Rick Carlisle said before the game that Doncic would travel with the team Friday night in hopes of being available for Saturday night’s game at New Orleans.\n\n\r\n                    “We had enough talent and available guys to win this game tonight,” Carlisle said. “We just didn’t execute.”\n\n\r\n                    The Pacers built a 17-point lead three minutes into the third quarter after outscoring Dallas 45-12 from behind the arc to that point. The Mavericks pulled to 84-80 two minutes into the fourth quarter, but the Pacers responded with a 14-2 run to retain control.\n\n\r\n                    Indiana led 61-48 at halftime after hitting 7 of 14 3-pointers in the second quarter while Dallas went 1 for 10. The Mavericks finished 8-for-35 from downtown for 22.9 percent.\n\n\r\n                    TURNER’S HOUSE\n\n\r\n                    Pacers big man Myles Turner graduated from high school near Dallas, in the town of Bedford, and attended the University of Texas for one season. Going into the game leading the NBA in blocks at 3.4 a game, Turner had seven against the Mavericks.\n\n\r\n                    “He had like run-down blocks, in-pursuit blocks,” Bjorkgren said. “You think you might be giving up something at the rim. He came out of nowhere a few times and got his hand on it.”\n\n\r\n                    CHANGE OF PACE AHEAD FOR MAVERICKS?\n\n\r\n                    In sending defensive specialist James Johnson and Wes Iwundu to New Orleans for shooting specialist JJ Redick and big man Nicolo Melli on Thursday, Mavericks general manager Donnie Nelson said the team seeks a “different look.”\n\n\r\n                    “JJ obviously is no stranger to playoff intensity, big shots in big moments,” Nelson said. “To put another shooter next to Luka is really important for us. And Melli provides us with just another solid locker room piece that can be kind of a utility guy, a glue guy of sorts.”\n\n\r\n                    Redick, 36, has been out since March 3 with a heel injury with no timetable for his return.\n\n\r\n                    TIP-INS\n\n\r\n                    The road team won for the fourth straight game in this series. … Indiana’s Doug McDermott, who had 12 points on four 3s, went out in the second half with a right ankle sprain. ... Porzingis had 15 points and 13 rebounds in the first half, the first time in his career that he’s had a double-double before halftime.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: At Washington on Monday night.\n\n\r\n                    Mavericks: At New Orleans on Saturday night to open a season-high five-game trip.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997134.358925
}