{
  "game_id": "0021301051",
  "espn_id": "400489924",
  "date": "Mar 24, 2014",
  "matchup": "MEM vs. MIN",
  "headline": "Grizzlies jump out to early lead, easily defeat Timberwolves",
  "body": "MEMPHIS, Tenn. -- The Memphis Grizzlies jumped out to an early lead and didn't let the Minnesota Timberwolves gain any confidence the rest of the way.\nMike Conley had 23 points and six assists, Marc Gasol added 14 points and 12 rebounds and the Grizzlies easily dispatched the short-handed Timberwolves 109-92 on Monday night.\n\"We caught a good team on the second night of a back-to-back,\" Memphis coach Dave Joerger said.\nMemphis' goal was to take immediate advantage of a Minnesota team coming off a 127-120 loss to Phoenix on Sunday in which the Timberwolves squandered a 22-point lead. Memphis never trailed and held a double-digit lead from the 3:27 mark of the first quarter to the end.\n\"We didn't want to give them too much leeway,\" Conley said. \"We've been in the same shoes. You're coming in off a tough game, and you kind of walk through the first part of the game.\n\"We just wanted to jump out there as early as we could, set the tempo and try to get ahead of them.\"\nZach Randolph finished with 17 points for Memphis, while Tayshaun Prince and Ed Davis added 12 points apiece. Mike Miller scored 11 as the Grizzlies won their 10th straight home game.\nKevin Love led the Timberwolves with 16 points, but shot 6-of-18 from the field, part of Minnesota shooting 38 percent for the game. Corey Brewer had 15 points and Kevin Martin finished with 13. Gorgui Dieng, in the starting lineup because of injuries on Minnesota's front line, finished with 11 points and 17 rebounds.\nThe victory left Memphis in the seventh spot in the Western Conference playoff race, a half-game ahead of Dallas and Phoenix.\nMeanwhile, the consecutive losses to the Grizzlies and Suns pushed the Timberwolves seven games behind Phoenix and the Mavericks. While not mathematically eliminated, the Timberwolves are beginning to understand their situation.\n\"We just have to be competitive. That's the biggest key right now -- get through the end of the season and play each game competitively,\" forward Chase Budinger said. \"That's how you have to look at it.\"\nThe Timberwolves continued to deal with injuries as centers Nikola Pekovic and Ronny Turiaf sat out, along with backup point guard J.J. Barea.\nWith the absences, Memphis dominated the inside and outscored Minnesota in the paint 66-42 and held a 54-42 advantage on the boards.\n\"They played physical,\" Love said. \"When you play a team like that on a back-to-back, especially this late in the season, especially without Pek and Ronny and some depth, it's tough.\"\nThe first quarter was a horrid shooting exhibition. The teams combined to miss the game's first nine shots, and Memphis shot only 44.4 percent in the quarter. Minnesota started 3-of-16 before rallying to 5-of-24 (20.8 percent for the quarter).\n\"We just got off to such a bad start and missed a ton of shots,\" Minnesota coach Rick Adelman said. \"We allowed them 40 points in the paint in the first half. They controlled the game pretty much the whole game.\"\nMemphis pushed the first-half lead to as many as 21 before Minnesota got going midway through the second period. But the Grizzlies held a 57-39 lead at the break.\nMemphis extended the lead to 24 in the third quarter and appeared to be in control. But Minnesota closed the period on a 15-4 run, including the final nine to cut the advantage to 81-68 entering the fourth.\nMemphis opened the final period with 12 straight points, including consecutive 3-pointers from Miller and Conley, and Memphis' lead was at 93-68.\n\"We had a little miscommunication, relaxed a little bit, and they took advantage,\" Gasol said. \"At the end of the third, we got a little sloppy, but we picked it up again and went up. The reaction is what matters.\"\nGame notes\nRandolph hit a 3-pointer from the left corner in the third quarter. He was 0-for-16 from outside the arc for the season. ... Memphis has not lost at home since dropping a decision to Dallas on Feb. 5. ... The victory assured Memphis of its fourth straight winning season. ... Memphis G Tony Allen missed the game with a stomach bug.",
  "source": "espn_api",
  "crawled_at": 1764993052.533055
}