{
  "game_id": "0022400724",
  "espn_id": "401705290",
  "date": "Feb 05, 2025",
  "matchup": "OKC vs. PHX",
  "headline": "Shai Gilgeous-Alexander scores 50 points as NBA-leading Thunder rout Suns 140-109",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 50 points and the NBA-leading Oklahoma City Thunder routed the Phoenix Suns 140-109 on Wednesday night to improve to 40-9. \n\n\r\n              The Thunder said Gilgeous-Alexander became the ninth player in NBA history to score at least 50 points three times in a seven-game span. He had a career-high 54 against Utah on Jan. 29 and 52 at Golden State a week ago.\n\n\r\n              Phoenix's Kevin Durant sat out with a sprained left ankle. The 36-year-old All-Star forward remains 26 points short of 30,000 for his career.\n\n\r\n              Oklahoma City's fans still got a show. Several times, they serenaded Gilgeous-Alexander with the “M-V-P! M-V-P!” chants once reserved for Durant as the former Thunder star watched from the Phoenix bench. \n\n\r\n              Bradley Beal led Phoenix with 25 points, Devin Booker had 19 and Royce O'Neale 18. They have lost three in a row.\n\n\r\n              Phoenix led 63-61 at halftime, despite 28 points from Gilgeous-Alexander. \n\n\r\n              The Thunder opened the second half on a 13-0 run to take a 74-63 lead. Gilgeous-Alexander’s steal and two-handed jam gave the Thunder an 81-65 advantage with 6:21 left in the third.\n\n\r\n              Gilgeous-Alexander scored his 50th point on a baseline jumper early in the fourth quarter to give Oklahoma City a 114-84 lead. \n\n\r\n              Takeaways\r\n              Suns: Oklahoma City scored 23 points off Phoenix's 22 turnovers, adding to the challenge of playing without Durant. Booker failed to pick up the slack — making just 3 of 9 field goals.\n\n\r\n              Thunder: The league's best free throw shooting team was good again, making 24 of 27. Oklahoma City also made 40 of 60 shots inside the 3-point arc.\n\n\r\n              Key moment\r\n              Oklahoma City's Lu Dort stuffed Beal's dunk attempt in the third quarter, then Gilgeous-Alexander made a layup at the other end to make it 87-69.\n\n\r\n              Key stat\r\n              The Thunder committed just six turnovers, with two in the final minute.\n\n\r\n              Up next\r\n              Both teams play Friday night. The Suns host Utah, and the Thunder host Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997679.713252
}