{
  "game_id": "0022401042",
  "espn_id": "401705608",
  "date": "Mar 24, 2025",
  "matchup": "CHI @ DEN",
  "headline": "Coby White scores 37, Bulls beat Nuggets 129-119",
  "body": "DENVER -- — Coby White scored 37 points to lead the streaking Chicago Bulls over the short-handed Denver Nuggets 129-119 on Monday night.\n\n\r\n              Josh Giddey had 26 points and nine assists for Chicago, which finished its season-long road trip 4-2.\n\n\r\n              Jamal Murray had 28 points and Peyton Watson scored a career-high 24 points for Denver, which played their fifth straight game without three-time MVP Nikola Jokic. Jokic is expected to return from his left ankle injury during a five-game homestand.\n\n\r\n              Denver was also without Aaron Gordon (right calf injury management).\n\n\r\n              The game was tied entering the fourth quarter but the Bulls put together a 17-4 run to lead 112-103 midway through the period. The Nuggets closed to within 125-119 and had a chance to make it a one-possession game but Russell Westbrook missed a 3-pointer with 1:04 remaining.\n\n\r\n              Takeaways\r\n              Bulls: Chicago has now won eight of their last 10 to give them a chance to challenge for a home game in the Eastern Conference play-in with four of their next five games at home.\n\n\r\n              Nuggets: DeAndre Jordan was out of the rotation for 10 games prior to Sunday and now has started the last two with Jokic sidelined. He had 11 points and 15 rebounds at Houston in a season-high 38 minutes. He had 17 rebounds Monday night\n\n\r\n              Key moment\r\n              Denver opened the fourth quarter with two buckets by Michael Porter Jr. but empty possessions kept the Bulls close. White took advantage with a 3-pointer to spark a 15-3 run that gave Chicago the lead for good.\n\n\r\n              Key stat\r\n              The Nuggets are now 12-3 on the second night of back-to-back games, and have lost their last two. All of the losses have come at home.\n\n\r\n              Up next\r\n              The Bulls return home for two games, starting with the Los Angeles Lakers on Thursday night. The Nuggets continue their five-game homestand against Milwaukee on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_api",
  "crawled_at": 1764997030.3979032
}