{
  "game_id": "0022400369",
  "espn_id": "401704935",
  "date": "Dec 19, 2024",
  "matchup": "IND @ PHX",
  "headline": "Siakam has 25 points and 18 rebounds to lead the Pacers past the Suns, 120-111",
  "body": "PHOENIX -- — Pascal Siakam had 25 points and 18 rebounds, Myles Turner added 19 points and the Indiana Pacers beat the Phoenix Suns 120-111 on Thursday night.\n\n\r\n              Indiana used a 15-4 run to lead 97-83 after three quarters and stretched it to 105-86 early in the fourth. The Pacers shot 16 of 41 from 3-point range to win for the fourth time in five games.\n\n\r\n              Tyrese Halliburton added 13 points and 12 assists, hitting 4 of 9 from 3. Andrew Nembhard added 19 points and Indiana had 25 fast-break points.\n\n\r\n              Kevin Durant led the Suns with 37 points and 10 rebounds. Bradley Beal added 16 points after missing two games because of a swollen right knee. \n\n\r\n              Devin Booker had 17 points, but went out in the third quarter with groin tightness. The Suns shot 9 of 30 from 3.\n\n\r\n              Takeaways\r\n              Pacers: Indiana has been on an offensive roll the past couple of weeks and kept it going in the desert. The Pacers moved the ball well and used their aggressiveness to get to the line, making 26 of 31 free throws.\n\n\r\n              Suns: Phoenix got Beal back, but the injury merry-go-round continued when Booker went down. The Suns shot 49% from the floor, but had 16 turnovers that led to 29 Indiana points.\n\n\r\n              Key moment\r\n              Booker had 14 points in the first half, but left midway through the third quarter with groin tightness. The Suns were unable to mount a comeback without their All-Star.\n\n\r\n              Key stat\r\n              The Pacers had 30 assists on 39 made field goals, with T.J. McConnell dishing out five.\n\n\r\n              Up next\r\n              The Pacers play at Sacramento on Sunday. The Suns host Detroit on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998152.637951
}