{
  "game_id": "0021500420",
  "espn_id": "400828307",
  "date": "Dec 22, 2015",
  "matchup": "DET @ MIA",
  "headline": "Caldwell-Pope's jumper lifts Pistons past Heat, 93-92",
  "body": "MIAMI --  The game's outcome wasn't decided until the absolute final moment. In reality, the Detroit Pistons did what was required to win about two hours earlier.\n\nA second-quarter barrage of 3-pointers helped the Pistons erase an early 18-point deficit, and Kentavious Caldwell-Pope's jumper with 55.5 seconds left went down as the game-winner as Detroit topped the Miami Heat 93-92 on Tuesday night.\n\nDwyane Wade and Chris Bosh missed jumpers in the final three seconds for Miami, though replays suggested Bosh's might not have counted anyway.\n\n\"They missed great shots,\" Pistons coach Stan Van Gundy said. \"I give our guys credit for fighting back to get in that game. I thought we played better defense in the second half. We did get the rebound on Wade's shot, that was great. But let's not go to the point of saying that we stopped them on the last two possessions. They missed great opportunities. Two Hall of Fame players missed shots.\"\n\nReggie Jackson led the Pistons with 18 points, while Stanley Johnson and Caldwell-Pope each had 14. The Pistons were 15 for 29 from 3-point range, outscoring Miami 45-12 in that department.\n\nDetroit has connected on 31 3-pointers in two games against Miami this season, both Pistons victories.\n\n\"That one's a tough one,\" Heat coach Erik Spoelstra said. \"They had a poor first quarter, we had a horrible second quarter and then it became an absolute grind-out, competitive basketball game.\"\n\nBosh scored 20 points for Miami. Wade finished with 19, Hassan Whiteside had 16 points and 16 rebounds, and Beno Udrih -- starting in place of the injured Goran Dragic -- scored 14 for the Heat.\n\nCaldwell-Pope put the Pistons up 91-89 with 2 minutes left on a 3-pointer. The lead changed hands twice more, but the Heat didn't score in the final 1:18.\n\n\"I'd love to have that shot back again,\" Wade said.\n\nMiami led 34-18 after one quarter, pushed the lead to 18 early in the second -- and succumbed to a flurry of Detroit 3-pointers.\n\nJohnson made four 3s in the half, Steve Blake and Anthony Tolliver made two more apiece before the break, and the Pistons took a 54-52 edge into the locker room. Detroit scored 36 points in the second quarter, matching its output in the first and third quarters combined.\n\nAnd when Miami went up by seven early in the fourth, Blake and Tolliver combined for three more 3s to keep Detroit close and start what would become the game-winning rally.\n\n\"Basketball's a pretty simple game,\" Tolliver said. \"If you do the right things, play the right way, things go your way.\"\n\nTIP-INS\n\nPistons: PG Brandon Jennings was active for the first time since tearing his left Achilles in Milwaukee on Jan. 24. As planned, he didn't play. ... Detroit became the sixth team to make 10 3-pointers in a first half this season. It was the Pistons' most in a first half since they made 11 on April 26, 2012, against Philadelphia. ... The Pistons had five shots on one possession early in the third, and a four-shot possession late in the second.\n\nHeat: Real Madrid star Cristiano Ronaldo sat opposite the Heat bench. ... Whiteside made his first two shots, giving him a string of 10 consecutive makes after going 8 for 8 in the second half against Portland on Sunday. ... Going back to March 10, 2012, Miami has made at least one 3-pointer in 300 consecutive regular-season games. ... Miami is now 8-10 against East teams.\n\nDRAGIC OUT\n\nDragic has a variety of ailments, including a sore left calf and achy right thumb -- he's played through both -- and now a troublesome left wrist that kept him out of the game. He was ruled out about 45 minutes before tip-off, forced to sit for the first time this season. He'll be evaluated again before Miami's Christmas Day game against New Orleans.\n\nHARDAWAY RETURNS\n\nTim Hardaway's No. 10 jersey is one of two Heat numbers retired and swaying from the rafters, over the visitors' bench. Hardaway essentially sat underneath it Tuesday, now that he's a Detroit assistant. \"It's not often that you walk into an arena and see one of your coaches' numbers hanging up there,\" Van Gundy said.\n\nUP NEXT\n\nPistons: Visit Atlanta on Wednesday.\n\nHeat: Host New Orleans on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994938.69361
}