{
  "game_id": "0021501229",
  "espn_id": "400829116",
  "date": "Apr 13, 2016",
  "matchup": "PHX vs. LAC",
  "headline": "Teletovic's 22 leads Suns past Clippers reserves, 114-105",
  "body": "PHOENIX -- The second-worst Phoenix Suns season in franchise history ended with a victory, even if it was against a Los Angeles Clippers team almost entirely made up of bench players.\nMirza Teletovic scored 22 points to lead seven Phoenix players in double figures and the Suns beat the Clippers 114-105 on Wednesday night.\nThe loss snapped the Clippers' six-game winning streak. Still, they won 10 of 12 games heading into their first-round playoff series against Portland.\n\nWith the No. 4 spot in the West already assured, Los Angeles left Chris Paul, DeAndre Jordan, Blake Griffin and Jamal Crawford home. The Clippers finished the season 53-29.\n\"We were just having fun,\" the Clippers' Austin Rivers said. \"Everybody was smiling and laughing. We deserve it. We had a good season. Now the season really starts. Tonight was all about us playing hard and practicing good habits defensively. That's all we really cared about.\"\nAlan Williams, who grew up in Phoenix and wasn't drafted out of Santa Clara last year, added 14 points, 12 rebounds and three blocked shots for the Suns in his 10th NBA game.\n\"It was awesome, for sure; a dream come true, for sure,\" Williams said. \"The hometown team, a hometown kid, a storybook beginning, you could say. I hopefully I will improve and take steps in the right direction.\"\nPhoenix's Jon Leuer had 16 points and matched his career best with 14 rebounds.\nWesley Johnson and C.J. Wilcox scored 19 apiece for the Clippers.\nThe Suns, who won three of their last four, went 23-59, fourth-worst in the NBA this season. Only the team's inaugural season of 1968-69 was worse (16-66).\nInterim coach Earl Watson will find out in the coming weeks if he gets the job next season.\n\"We didn't want to lose,\" he said, \"and, at the same time, that Clipper team you know is getting their second unit in, their third unit ready for the postseason. ... Our main thing was to get back defensively. In the third quarter, we played well. The defense kind of set us up to win the game.\"\nPhoenix finished the first half on a 9-2 run. The Suns capped the run when Ronnie Price stole the ball from Pablo Prigioni and fed P.J. Tucker for a layup with 37.9 seconds left to give Phoenix a 62-55 lead at the break. The Suns led by as many as 17 in the third quarter and 18 in the fourth.\nTIP-INS\nClippers: Los Angeles had its fourth straight 50-win season. Before that, the Clippers didn't have even one. ... Clippers are in the playoffs for the fifth straight year, longest stretch in team history. ... Los Angeles' longest winning streak this season was 10 games from Dec. 25 through Jan. 13.\nSuns: Suns were 8-24 under Watson. ... Phoenix was without center Tyson Chandler (concussion protocol). ... Archie Goodwin returned after missing the last game with a sprained ankle. ... Teletovic finished with 179 3-pointers, the most ever for an NBA reserve. The previous record was 164 by Chuck Person in 1994-95. ... In addition to their own high draft pick, the Suns have the Washington Wizards' first-round spot.\nUP NEXT\nClippers: host Portland in first round of the playoffs, game day yet to be determined.\nSuns: End of regular season.",
  "source": "espn_api",
  "crawled_at": 1764994815.505661
}