{
  "game_id": "0021800498",
  "espn_id": "401070234",
  "date": "Dec 25, 2018",
  "matchup": "OKC @ HOU",
  "headline": "Harden's 41 helps Rockets over Thunder 113-109",
  "body": "HOUSTON --  James Harden is on a roll and it's helping the Houston Rockets get on track after their terrible start to the season.\n\nHarden scored 41 points and the Rockets beat the Oklahoma City Thunder 113-109 on Tuesday for their seventh win in the last eight games.\n\nHarden has scored 30 points or more in a career-high seven games in a row, marking the first time a player has done that since Russell Westbrook had eight consecutive 30-point games in November 2016. He has scored at least 35 in his last five, which is the longest such streak since Carmelo Anthony did it in six games in April 2013.\n\nThe Rockets won just one of their first six games this season and were 11-14 after a three-game skid in early December. Since then, powered by Harden's dominance, Houston has lost just once to improve to 18-15 and move a season-high three games above .500.\n\n\"We've had that confidence all year,\" Harden said. \"Our record isn't where we want it to be, but it's getting there. And we've got to continue to work hard every day, continue to get better and grow. We're preparing for a postseason. We're not going to be at our tip top right now.\"\n\nA 3-pointer by Paul George with less than two minutes left got Oklahoma City within 4 before Harden missed a 3. Westbrook missed a shot for the Thunder, but George stole the ball from Harden and was fouled by him.\n\nGeorge made both free throws to get the Thunder within 2 with 43.6 seconds left. Harden then drove past George and into the lane for a layup to make it 112-108 with 20.4 seconds left.\n\nWestbrook made 1 of 2 free throws to cut it to 3 with 15 seconds left, and Austin Rivers made a free throw with 7.4 seconds left to secure the win.\n\nGeorge had 28 points and 14 rebounds for the Thunder, and Westbrook added 21 points with nine rebounds and nine assists.\n\n\"We had some bad bounces which got them a couple of extra possessions which got them some open 3s,\" George said.\n\nHarden became the first player to score 40 or more points on Christmas since Kevin Durant had 44 for the Thunder in 2010. Harden's latest big game came as the Rockets played without Chris Paul, who missed his second straight game with a strained left hamstring. The 9-time All-Star is out for at least the next two weeks with the injury suffered Thursday night.\n\n\"We've got a lot of guys playing at a high level right now,\" coach Mike D'Antoni said. \"So many guys contributed (Tuesday).\n\nClint Capela had 16 points and tied a season high with 23 rebounds.\n\nThe Rockets were up by 6 with about four minutes left when Rivers, whom they signed on Monday, hit a 3-pointer to make it 107-98.\n\nGrant scored five straight points for the Thunder, highlighted by a 3-pointer, to get Oklahoma City to within 107-103, but Rivers made another 3 to push the lead to 7 with two minutes left.\n\n\"Everybody here has welcomed me so it has been a very easy transition,\" Rivers said. \"So my whole focus has just been to play hard and just try to help them in any way I can.\"\n\nHouston had a 1-point lead in the fourth when Harden re-entered the game and found Capela on consecutive possessions for dunks to make it 100-95. Eric Gordon had a layup seconds later to push the lead to 7.\n\nHarden continued the run after the timeout with a driving jump shot before the Thunder scored their first basket in more than three minutes on a layup by Grant to cut the lead to 104-97.\n\nThe Thunder were up by 8 at halftime, but Houston scored the first eight points of the second half to tie it at 60 with about nine minutes remaining in the third quarter. Danuel House and P.J. Tucker made 3s in that stretch to lead the Rockets.\n\nOklahoma City was up by 2 later in the third when the Rockets scored five quick points with a 3 from Harden to take a 73-70 lead.\n\nBut George hit a 3 for the Thunder soon after that to tie it up again. That basket started a 10-2 run for Oklahoma City, which included another 3 from George that made it 80-75 with about three minutes left in the third.\n\nHouston trailed by 4 after two free throws by George late in the third, but the Rockets scored the next six points, capped by a 3 from Harden, to take an 86-84 lead with less than a minute left in the quarter.\n\nThe Thunder led 88-86 entering the fourth.\n\nTIP-INS\n\nThunder: Westbrook received a technical in the second quarter for yelling at an official when he thought he was fouled on a 3-point attempt. ...  Steven Adams had 17 points and seven rebounds. ... The Thunder made nine of 30 3-pointers.\n\nRockets: Rivers scored 10 in his Houston debut. ... James Ennis missed his seventh straight game with a strained right hamstring. ... Gordon had 17 points.\n\nTHEY SAID IT\n\nCapela on his big rebounding day: \"I just told my teammates I had to make a statement that we are going to win the rebound battle.\"\n\nUP NEXT\n\nThunder: Visit Phoenix on Friday night.\n\nRockets: Host Boston on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994599.139512
}