{
  "game_id": "0022200819",
  "espn_id": "401468974",
  "date": "Feb 07, 2023",
  "matchup": "MEM vs. CHI",
  "headline": "Morant, Jackson help Grizzlies beat Bulls, end 3-game skid",
  "body": "MEMPHIS, Tenn. -- — Ja Morant scored 34 points, Jaren Jackson Jr. added 24 points and five blocks, and the Memphis Grizzlies rallied in the fourth quarter to beat the Chicago Bulls 104-89 on Tuesday night.\n\n\r\n              Desmond Bane finished with 17 points and Brandon Clarke had 13 points and 13 rebounds for the Grizzlies, who stopped a three-game skid. Clarke had seven of the team's 11 rebounds in the key fourth.\n\n\r\n              “This was an important game to go get because we kind of battled back in that fourth quarter,” Memphis coach Taylor Jenkins said.\n\n\r\n              Unlike recent losses when Memphis couldn’t close out games, the Grizzlies were solid down the stretch, outscoring the Bulls 32-14 in the fourth — including a 10-0 run.\n\n\r\n              “These recent games we've been giving up too many layups and stuff at the rim. Second-chance points,” Morant said. “We were back to pretty much our defense late and able to execute on the other end.”\n\n\r\n              Nikola Vucevic had 28 points and 17 rebounds for the Bulls, whose three-game winning streak ended. Chicago played without leading scorer DeMar DeRozan because of right hip soreness.\n\n\r\n              Zach LaVine scored 24 points for Chicago and Ayo Dosunmu added 14 points and six assists.\n\n\r\n              But poor shooting hindered the Bulls at the start of the game and in the final period. Chicago was 5 of 19 from the field in the fourth, including making only one of its 10 3-point attempts.\n\n\r\n              “I thought we did some good things in the fourth quarter,” Bulls coach Billy Donovan said. “I didn't think we shot the ball particularly well from the 3 or from the field. ... I think we lost a little bit of rhythm.”\n\n\r\n              The Bulls trailed 49-39 at halftime, plagued by 13 turnovers and 30% shooting, including 3 of 16 from 3-point range. But Chicago got rolling in the third behind Vucevic, who had 14 points in the quarter, and LaVine, who contributed 12. The Bulls led 75-72 entering the fourth.\n\n\r\n              “I think execution-wise, we came down and weren't really organized,” LaVine said. \"We had a lot of opportunities to make shots. We just didn't knock them down.\n\n\r\n              “It was a low-scoring game on both ends. We just didn't get enough stops.”\n\n\r\n              For Memphis, it was a reprieve from its recent troubles where it had lost eight of the last nine. But Jackson said it is a matter of maintaining a balanced mindset through the slumps.\n\n\r\n              “There is no time to get excited or feel bad about a win or a loss,” Jackson said. “The greatest teams never did that. Teams that aren't great, do that.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: G Alex Caruso, who missed the previous two games with mid-foot soreness, started in DeRozan's spot and recorded his 750th career assist in the first quarter. ... The Bulls totaled 14 points in both the first and fourth quarters, their lowest for any quarter this season. ... Vucevic has 34 games this season with at least 10 rebounds.\n\n\r\n              Grizzlies: C Steven Adams missed his seventh game with a PCL strain in his right knee. Memphis is 2-5 since Adams was injured. ... F Dillon Brooks returned to the lineup after missing Sunday's game under a league-assessed one-game suspension in connection with his scuffle with Cleveland's Donovan Mitchell. ... Jackson has 20 blocks in his last four games. ... Jackson entered the game having missed all nine of his 3-point attempts over the past two games. He was 2 of 5 from outside the arc against Chicago.\n\n\r\n              FREE THROW WOES\n\n\r\n              LaVine, a career 83% shooter from the free throw line, surprisingly was 10 of 17 against the Grizzlies. “I've got to do better. It's unacceptable for me to shoot that many free throws and miss,\" he said.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Brooklyn on Thursday night.\n\n\r\n              Grizzlies: Host Minnesota on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994187.760084
}