{
  "game_id": "0021900793",
  "espn_id": "401161435",
  "date": "Feb 10, 2020",
  "matchup": "CHA @ DET",
  "headline": "Hornets beat Pistons 87-76, end 5-game losing streak",
  "body": "DETROIT --  No matter how bad things get for the Charlotte Hornets, they always seem to be able to fix them by playing the Detroit Pistons.\n\nMiles Bridges scored 18 points Monday night and the Hornets ended a five-game losing streak with an 87-76 victory, their 10th straight over Detroit.\n\nThe streak includes two consecutive 4-0 season sweeps. The Hornets are 13-36 against the rest of the league and had lost 13 of their previous 14 games.\n\n\"I don't know how to explain it,\" Bridges said. \"They play good against everybody else and then when we come in, it is different. It's always a close game when we play them, but I want to keep the streak going.\"\n\nMalik Monk added 17 points for the Hornets while Devonte' Graham had 14 points and 11 assists. Charlotte won despite shooting 37.5% from the floor.\n\n\"Obviously, we've had moments where we can't throw it in the ocean -- shooting 37% isn't where we want to be -- but we kept digging in and getting stops,\" Hornets coach James Borrego said. \"I think we showed pride in our defense tonight.\"\n\nThe Pistons have lost three straight and nine of 11. Thon Maker led Detroit with 12 points and a career-high 12 rebounds. Bruce Brown added 10 points and 12 rebounds.\n\n\"This was just an ugly game on both sides,\" Pistons coach Dwane Casey said. \"I thought we played hard but we didn't play smart enough. We're in a funk right now, and we've got to get out of it. No one is going to feel sorry for us.\"\n\nDetroit shot 35.4% and turned the ball over 21 times for 24 points.\n\n\"If you look at the box score, the first thing you see is the points off turnovers,\" Pistons point guard Reggie Jackson said. \"We lost that battle by 14 points and lost the game by 11, so that's a huge difference.\"\n\nAfter trailing by as many as 15 points in the first half, Detroit got as close as two in the third quarter. However, late 3-pointers by Monk and Bridges put Charlotte ahead 66-59 going into the fourth.\n\nThe Hornets led 70-63 with 7:51 to play, then went on an 8-0 run that included 3-pointers from Jalen McDaniels and Graham. That gave them another 15-point lead and the Pistons never seriously challenged down the stretch.\n\nMcDaniels, playing in his fourth NBA game, finished with eight points that included his first two career 3-pointers.\n\n\"I'm getting way more comfortable,\" he said. \"I worked hard every day to get here and I'm really confident in my abilities.\"\n\nOne week after scoring a season-worst 10 points in a quarter against the Memphis Grizzles, the Pistons only scored 11 in the first period against the Hornets. Charlotte led 47-37 at the half, holding Detroit to 32.5% shooting and forcing 11 turnovers.\n\n\"It's going to be tough to win any game when you keep turning the ball over,\" Brandon Knight said. \"Every one of those is a shot we could have gotten off.\"\n\nTIP INS\n\nHornets: Bridges grew up in Flint, about an hour north of Detroit, and played at Michigan State. His college career ended at Little Caesars Arena when the Spartans were upset by Syracuse in the 2018 NCAA tournament. . Cody Zeller left in the third quarter with a facial laceration, but returned to finish the game.\n\nPistons: John Henson, acquired at the trade deadline as part of the Andre Drummond trade, hit his first nine shots as a Piston before missing a tip-in attempt in the fourth quarter.\n\nALMOST BACK HOME\n\nKnight was playing his first home game for the Pistons since he scored 12 points in a 109-101 win over the Philadelphia 76ers at the Palace of Auburn Hills. That summer, he and Khris Middleton were traded to the Milwaukee Bucks for Brandon Jennings.\n\n\"It definitely brought me back to year one and year two in the league,\" said Knight, who was drafted No. 8 overall in the 2011 draft. \"We're in a different city than we were back then, but it is still Detroit.\"\n\nUP NEXT\n\nHornets: Visit the Minnesota Timberwolves on Wednesday.\n\nPistons: Visit the Milwaukee Bucks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996056.240143
}