{
  "game_id": "0022200630",
  "espn_id": "401468785",
  "date": "Jan 12, 2023",
  "matchup": "LAL vs. DAL",
  "headline": "Doncic hits 2 big 3-pointers, Mavs top Lakers 119-115 in 2OT",
  "body": "LOS ANGELES -- — Luka Doncic hit tying 3-pointers in the final seconds of regulation and the first overtime, finishing with 35 points, 14 rebounds and 13 assists in the Dallas Mavericks' 119-115 double-overtime victory over the Los Angeles Lakers on Thursday night.\n\n\r\n              Doncic highlighted his 56th career triple-double with that pair of clutch 3-pointers, hitting with six seconds left in regulation and again with 47.8 seconds to go in the first OT. Christian Wood added 24 points and 14 rebounds in the Mavs' fourth straight win over the Lakers.\n\n\r\n              “We knew we weren’t out of it,” said Tim Hardaway Jr., who had 22 points and eight rebounds. “Anytime you've got (No.) 77 on the floor, you know there's a chance.”\n\n\r\n              Spencer Dinwiddie scored twice in a late 6-0 run to put it away in double OT for the Mavs, who won for only the second time in five games.\n\n\r\n              Russell Westbrook scored a season-high 28 points and LeBron James had 24 points, 16 rebounds and nine assists for the Lakers, who have lost two straight after a five-game winning streak.\n\n\r\n              “We gave ourselves a chance to win,” said James, who went 9 for 28 and missed all seven of his 3-point attempts. “We just couldn't come through late in the game.”\n\n\r\n              Los Angeles rallied all the way back from a 19-point regulation deficit and got to the brink of an unlikely win, but couldn't match Doncic's dramatic flair.\n\n\r\n              “I'm more tired now,” said Doncic, who rested for only 9 seconds in the final 40 minutes of play. “I think I was good in the game with the energy. Now I need to rest.”\n\n\r\n              The Lakers took a lead on Dennis Schröder's layup with 1:31 left in regulation before Westbrook made two free throws with 11.8 seconds left for a 101-98 advantage. Doncic calmly moved past a perimeter screen and drilled a tying 3-pointer for his first field goal of the fourth quarter.\n\n\r\n              “I was a little bit surprised (because) I thought they were going to foul, honestly,” Doncic said. “I tried to get it up before they fouled.”\n\n\r\n              The Lakers had double-teamed Doncic throughout the fourth quarter except on that possession, and coach Darvin Ham said he wished he had instructed his Lakers to force another player to try the shot.\n\n\r\n              “He made a tough shot, simple as that,” Westbrook said. “You just move on. Find a way to execute better.”\n\n\r\n              Troy Brown missed a 3-pointer at the regulation buzzer, failing to get a foul call on what appeared to be clear contact from Hardaway.\n\n\r\n              The Lakers pressured Doncic again in the first overtime, and Westbrook was called for a flagrant foul midway through the period. James hit two free throws to put the Lakers up 108-105 late in the first overtime, but Doncic hit another tying 3-pointer, and Wood blocked James' layup attempt shortly before the buzzer.\n\n\r\n              Doncic then hit the go-ahead layup midway through the second overtime. The Lakers missed four of their final five shots and committed an offensive foul in the final two minutes.\n\n\r\n              James returned from a one-game absence with a sore left ankle, but the Lakers were still short-handed without Anthony Davis, Lonnie Walker, Austin Reaves and Patrick Beverley. The injuries forced Ham to use his 23rd different starting lineup in 42 games.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Dwight Powell played 18 minutes despite a bruised right hip. ... Davis Bertans got a technical foul from the bench in the second quarter for his apparently overzealous celebration of a layup by Wood.\n\n\r\n              Lakers: Brown returned from a three-game absence with a strained right quadriceps and scored eight points. ... Beverley was out with a non-COVID illness.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Portland on Saturday.\n\n\r\n              Lakers: Host Philadelphia on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994132.278192
}