{
  "game_id": "0021700740",
  "espn_id": "400975486",
  "date": "Jan 29, 2018",
  "matchup": "MEM vs. PHX",
  "headline": "Evans, Selden help Grizzlies defeat Suns 120-109",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies put together their biggest scoring quarter of the season, creating enough of a buffer for an easy victory over the shorthanded Phoenix Suns.\n\nTyreke Evans scored 27 points, Wayne Selden added 17 points and the Grizzlies sent Phoenix to its fifth straight loss with a 120-109 victory on Monday night. The major turning point came in the second quarter, when Memphis outscored the Suns 42-21 creating a double-digit lead that eventually would swell to 25 in the third quarter.\n\n\"I thought we competed in the first quarter, then in the second quarter we hit a bit of a slump,\" Suns interim coach Jay Triano said, later adding: \"We dug too big of a hole.\"\n\nPhoenix played without leading-scorer Devin Booker, who suffered a right rib contusion in the Suns' loss Sunday at Houston. X-rays on the Phoenix guard before Monday night's game were negative.\n\nIn a game where both teams seem destined for lottery picks in the draft, it was the potent second-quarter for Memphis that made the difference after a first filled with turnovers and inconsistent offense. Memphis' 17 field goals included the Grizzles converting all three of their shots beyond the arc. Jarell Martin made all three of his shots in the frame, and Evans was perfect on his four attempts. Memphis had 12 of its 29 assists in the second.\n\n\"We did a great job sharing the ball,\" said Martin, who finished with nine points. \"We moved the ball pretty well, limited turnovers and got good looks.\"\n\nOnce Memphis went into halftime up 64-47, the Suns never got the deficit under 10 the rest of the way.\n\nDillon Brooks, Deyonta Davis and Marc Gasol scored 12 points apiece for Memphis, Gasol also grabbed 10 rebounds. Davis missed only one of his six shots on the night, part of the Grizzlies shooting 57 percent for the game.\n\nT.J. Warren led the Suns with 24 points on 10 of 18 shooting, while Josh Jackson scored 20 points.\n\n\"I thought defensively, we picked it up, especially in the second quarter,\" Gasol said. \"That allowed us to run and create easy points.\"\n\nTIP-INS\n\nSuns: Troy Daniels converted a 3-pointer with 9:15 left in the first quarter, the 1,109th consecutive game with a 3-pointer. That surpassed the Dallas Mavericks record of 1,108 between 1999-2012 for the longest in NBA history. ... Won the previous two over the Grizzlies this season -- both games by two points. ...Injuries resulted in Isaiah Canaan starting his first game of the season. ... Tyler Ulis and Jared Dudley both scored 13 points, Ulis handing out seven assists.\n\nGrizzlies: It was Gasol's 33rd birthday. He recorded his 20th double-double of the season. .Evans led the team in scoring for the 20th time this season. He has scored at least 25 points in 14 games.\n\nSUNS DOWN\n\nIn addition to Booker, center Tyson Chandler didn't play, resting on the second night of a back-to-back. Marquese Chriss who is dealing with a left ankle sprain, also sat out. \"We had a lot of talent in the locker room,\" Triano said of the injuries and rest. Before the game, the Suns interim coach went through the list of who was available and who wouldn't play, adding: \"Don't ask me about starters, because I've just gotten a lot of this information (and) haven't had time to process it.\"\n\nHELPING HANDS\n\nThe Grizzlies had 29 assists in the game, led by six each from Selden and Andrew Harrison. \"That's the conversation we're having with our guys,\" interim coach J.B. Bickerstaff said. \"Making the extra pass, going from good to great and just sacrificing what you think might be a good opportunity, but it's more important to get your teammate a great opportunity.\"\n\nUP NEXT\n\nSuns: host the Dallas Mavericks on Wednesday.\n\nGrizzlies: Start a four-game road trip in Indiana on Wednesday to face the Pacers.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992752.2428212
}