{
  "game_id": "401809784",
  "espn_id": "401809784",
  "date": "Nov 14, 2025",
  "matchup": "HOU vs POR",
  "headline": "Durant scores 30 as the Rockets beat the Trail Blazers 140-116 for 3rd straight victory",
  "body": "HOUSTON -- — Kevin Durant scored 30 points, Alperen Sengun added 25 points, 10 rebounds and nine assists and the Houston Rockets won their third straight with a 140-116 win over the Portland Trail Blazers in an NBA Cup game on Friday night.\n\n\r\n              Durant, who had 16 points in the first period, finished 12 of 19 from the field. Jabari Smith Jr. scored 22 points, Amen Thompson had 19 points and Reed Sheppard 13.\n\n\r\n              The Rockets have won eight of their last nine games and improved to 1-1 in NBA Cup play. Houston shot 50%, including 17 of 45 on 3-pointers. The Rockets forced the Trail Blazers into 20 turnovers and converted them into 30 points.\n\n\r\n              Tari Eason left with a bruised right hip after being bumped and falling to the floor. He went to the locker room with a trainer midway through the second quarter.\n\n\r\n              Deni Avdija had 22 points and 10 rebounds, Shaedon Sharpe added 19 points and eight rebounds, Toumani Camara scored 16 points and Jrue Holiday and Jerami Grant each had 13 for Portland, which fell to 1-1 in NBA Cup play. The Trailblazers shot 47% and were 13 of 36 from 3-point range.\n\n\r\n              Leading 58-57 with 2:44 left in the second, Houston ended the half on an 11-3 run and took a 69-60 lead into halftime on a tip-in by Josh Okogie. The Rockets opened the second half with an 8-0 run to increase the lead to 17 points on a 3-pointer by Okogie with 10:49 left in the period. Houston’s lead never dipped below 10 the rest of the way.\n\n\r\n              Up next\r\n              Trail Blazers: At Dallas Mavericks on Sunday in the finale of a five-game trip.\n\n\r\n              Rockets: Host the Orlando Magic on Sunday to finish a three-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042623.7759
}