{
  "game_id": "0021900891",
  "espn_id": "401161533",
  "date": "Feb 29, 2020",
  "matchup": "MEM vs. LAL",
  "headline": "Morant has 27 points, 14 assists as Grizzlies defeat Lakers",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies snapped their five-game losing streak by beating the team they could face in the playoffs if they hold on to the last spot in the Western Conference.\n\nRookie Ja Morant had 27 points and matched his season high with 14 assists, and the Grizzlies beat the Los Angeles Lakers 105-88 on Saturday night.\n\n\"We just locked in, stayed focused, learned from our losses and came out and played a full 48 (minutes),\" Morant said. \"We were able to come out with a great win.\"\n\nDillon Brooks added 24 points and Jonas Valanciunas had 22 points and 20 rebounds as the Grizzlies helped their chances of keeping the eighth spot in the West. Memphis holds a 2 1/2- game edge on the New Orleans Pelicans, who were idle Saturday night and play the Lakers on Sunday. The San Antonio Spurs, who beat Orlando 114-113 on Saturday night, trail Memphis by three.\n\n\"We knew they were going to play with desperation. They are currently the eighth seed in the playoffs and lost five straight,\" Lakers coach Frank Vogel said. \".Our guys have done a great job most of the year of playing with energy and matching the home team. We just fell short of that.\"\n\nLeBron James had 19 points and 10 assists, while Anthony Davis finished with 15 points and nine rebounds as Los Angeles lost for only the second time in February. The 88 points was a season-low for the Lakers, who shot 41% for the game, including only 9 of 36 from 3-point range.\n\nThe Lakers, the top team in the West, entered the game on a seven-game winning streak, but trailed by as many as 22 in the third quarter as Memphis continued to get balanced scoring. The Lakers brought James into more of an active role and a couple of 3-pointers started the second half.\n\nBut Memphis continued to extend the lead and held an 86-66 advantage entering the fourth.\n\nThe Memphis lead dropped to single digits with just under 7 minutes left after a 7-0 Lakers run. But Memphis immediately built the lead back to 18 near the three-minute mark, and Vogel put in his reserves.\n\n\"They just played a great game. Shot the ball extremely well from the perimeter,\" James said. \"Ja made four 3s. Dillon was really good all game and Valanciunas, I think he had like 50 rebounds the last two games. They just played a really good game and kept us at bay.\"\n\nThe Grizzlies hadn't won since the All-Star break and their hold on the final playoff spot had started to dwindle. But, at least outwardly, the young Grizzlies seem to keep their composure.\n\n\"We understand there's going to be adversity,\" Morant said. \"So, there's no reason to panic. We're going to control what we can. That's how we play on the floor.\"\n\nTIP-INS\n\nLakers: Avery Bradley got his 1,000th assist in the first quarter. . James was listed as doubtful pregame with a sore groin, an injury that caused him to miss Thursday's game against the Warriors. . Danny Green sat out with a sore hip, an injury that caused him to miss a game in January. Alex Caruso started his first game of the season in Green's spot. . The Lakers finished February 9-2. . The loss was the first away from Los Angeles for the Lakers against a West team this season. They lost to the Clippers in the season's first game -- a home game for the Clippers.\n\nGrizzlies: Morant set a new career high with four 3-pointers. . Valanciunas had his second straight game of at least 20 rebounds. He had a career-best 25 in Saturday night's loss to Sacramento. He is the first player in Grizzlies history to have consecutive games with 20 rebounds. .Memphis is 5-0 when holding an opponent under 100 points. .The 17-point victory was the largest home win over the Lakers since April 3, 2005 (102-82).\n\nPRAISE FOR MORANT\n\nWith Zion Williamson's return from injury, the Rookie of the Year race is between him and Morant, the top two players in last summer's draft. \"The kid is super special,\" James said. \"And like I said when we played them (Feb. 21) in L.A., Memphis got a great one. The sky's the limit for the kid.\"\n\nUP NEXT\n\nLakers: At New Orleans on Sunday\n\nGrizzlies: At Atlanta on Monday\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995687.570405
}