{
  "game_id": "0021800781",
  "espn_id": "401071453",
  "date": "Feb 02, 2019",
  "matchup": "MIA vs. IND",
  "headline": "Pacers top Heat 95-88, end 4-game winless streak",
  "body": "MIAMI --  Indiana's offense was nowhere to be found in the fourth quarter.\n\nLuckily for the Pacers, neither was Miami's.\n\nBojan Bogdanovic scored 31 points, Darren Collison added 20 and the Pacers had a big third quarter to beat the struggling Heat 95-88 on Saturday night. Indiana ended a season-long four-game losing streak, which started in the game following the one where All-Star Victor Oladipo left with a season-ending knee injury.\n\n\"It was mental, I think,\" Bogdanovic said about the slide after losing Oladipo. \"We needed this win to get it going. We have enough quality in this locker room without Victor to put up the numbers.\"\n\nThe Pacers feasted on Miami turnovers, turning 24 of them into 31 points -- while seeing their 14 giveaways become only seven Heat points. Indiana won despite scoring only 11 points in the fourth, because it held the Heat to exactly 11 in the fourth as well.\n\n\"That was pretty ugly in the fourth quarter for both teams,\" Heat coach Erik Spoelstra said. \"They were just able to hold on.\"\n\nMyles Turner scored 14 points and Thaddeus Young added 11 for the Pacers. They swept the Heat 3-0 this season.\n\n\"It's all about adapting,\" Pacers coach Nate McMillan said about life without Oladipo. \"It takes time and with different guys in and out of the lineup, it's not going to be a quick fix.\"\n\nDwyane Wade scored 21 points for Miami, which dropped its third straight game overall and fourth in a row at home. Hassan Whiteside added 19 points and 14 rebounds, and Josh Richardson and Kelly Olynyk each scored 14 points for the Heat -- who leave Monday for a five-game West Coast trip.\n\n\"You lose three in a row at home, it's tough,\" Wade said. \"It's a lot of things combined. Got to figure it out, man.\"\n\nMiami led 54-53 at the half, but Indiana quickly took control from there.\n\nIndiana scored the first 10 points of the second half, needing only 1:59 to do so, turning a one-point deficit at intermission into a quick nine-point lead. The Pacers eventually led by 18 late in the third, before the Heat found a way to claw back into things.\n\nA 13-2 run over the final 2:31 of the period -- started by a 3-pointer from Wade, and ended by another 3-pointer from Wade -- gave Miami new life, and cut Indiana's lead to 84-77. The Heat scored five points in five seconds to end that spurt, with Whiteside making a layup while getting fouled, missing the free throw, Miami corralling the rebound and Wade making a 3.\n\nBut the Heat never got closer than five again, and fell to 2-13 this season when scoring less than 100 points.\n\n\"We've got to figure it out,\" Wade said.\n\nTIP-INS\n\nPacers: Indiana took 17 of the first 25 shots, largely because Miami committed seven of the game's first eight turnovers. ... Tyreke Evans returned after missing the last three games with lower back soreness. He was 0 for 7 in 16 minutes. ... The Pacers led for 29 minutes on Saturday, after leading for 17 minutes in their last four games combined.\n\nHeat: The Heat fell to 17-3 in games where they allow 101 points or less. ... The Heat aren't back home until Feb. 23, and play their next six on the road -- four of them against teams that are likely playoff locks. ... The Heat shot 9 for 30 from 3-point range. ... Starters Tyler Johnson and James Johnson were a combined 2 for 9 for five points in 34 minutes.\n\nSLOW START\n\nNeither team scored in the first 3 minutes of the fourth quarter. Justise Winslow took a pass from Wade for a layup with 8:54 left, the first points by either side in the final period. Indiana went nearly five minutes in the fourth before scoring.\n\nHOME-HOME\n\nMiami wrapped up the 21st home-home back-to-back in franchise history -- and the Heat have gone 21-21 in those games.\n\nUP NEXT\n\nPacers: At New Orleans on Monday night.\n\nHeat: At Portland on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995235.1244512
}