{
  "game_id": "0021900964",
  "espn_id": "401161606",
  "date": "Mar 10, 2020",
  "matchup": "MEM vs. ORL",
  "headline": "BKN--Magic-Grizzlies",
  "body": "MEMPHIS, Tenn. --  Terrence Ross scored 24 points, including fueling a rally with 18 in the fourth quarter, as the Orlando Magic defeated the Memphis Grizzlies 120-115 on Tuesday night.\n\nMichael Carter-Williams added a season-high 20 for Orlando and Nikola Vucevic finished with 19 points, 11 rebounds and seven assists for the Magic. Ross was 6 of 9 in the fourth quarter, including connecting on 3 of 5 from 3-point range.\n\nMemphis led by 17 in the first half, but the Magic caught the Grizzlies by scoring 70 points over the final two periods.\n\n\"We had confidence,\" said Orlando guard Markelle Fultz, who finished with 14 points and six assists,. \"I think we probably were . too high coming into the game, and we got punched in the mouth first. We had to wake up quick.\"\n\nJonas Valanciunas led Memphis with 27 points and 16 rebounds, while Dillon Brooks and rookie Ja Morant finished with 21 points each.\n\n\"I thought our guys played well in the first half,\" Memphis coach Taylor Jenkins said. \"(The Magic) raised their intensity in the second half. We can't live with giving up 70 points (in a half). I thought our defense definitely let us down.\"\n\nThe game, featuring two teams holding down the eighth and final spot in their respective conferences, was close until the end. A 3-point attempt by Memphis guard Tyus Jones to tie the game bounced off the rim with about two seconds left, preserving the Magic third straight victory.\n\n\"We played hard,\" Ross said. \"We're always in the fight. This is one of one of those nights where we came out a little sluggish, and we picked it up in the second half.\"\n\nOrlando had carried a lead to 110-101 on a pair of free throws from James Ennis with 4:28 remaining and seemed in control. But Memphis rattled off the next seven points, including a 4-point play by Brooks, to pull within one possession.\n\nMemphis would tie the game at 112 on a drive by Morant with just less than two minutes remaining.\n\nBut Ross would answer with a pair of 3-pointer to put the Magic up for good.\n\n\"To me, when you're up 17, everybody kills you when you lose.\" Magic coach Steve Clifford said of the second-half rally, adding that the way players score these days such an advantage is not insurmountable. \"You want to be ahead rather than behind, but you have plenty of time.\"\n\nTIP-INS\n\nMagic: The scoring by Ross and Carter-Williams came off the bench as Orlando's reserves outscored Memphis' 65-36. .Have made a 3-pointer in 1,049 straight games. ... Now lead the series with Memphis 24-23. ... Aaron Gordon was held scoreless in the first half, missing all four of his shots while dealing with foul problems. He ended the game with 8 points. ... Carter-Williams has reached double-figures in four straight games and 13 times this season. ... Orlando coach Steve Clifford challenged a foul call against Vucevic in the third quarter. The foul call was upheld. Clifford is now 14 of 25 on challenges this season.\n\nGrizzlies: Valanciunas already had recorded his 32nd double-double early in the second half. ... Despite the loss, Memphis has won 15 of last 19 games at home. .The Orlando result was the only time a Southeast Division team defeated Memphis at home this season. .Morant's 21 point marked the 20th time he has reached at least 20 points this season and his 21st consecutive game in double figures.\n\nLAST WORD\n\nUnder the new locker room guidelines, Grizzlies coach Taylor Jenkins held his pregame press conference in the room that doubles as the dining facility. Wrapping up his comments, Jenkins looked to the side of the room and said: \"Enjoy the food spread.\"\n\nUP NEXT\n\nMagic: Host Bulls on Thursday.\n\nGrizzlies: Travel to Portland on Thursday\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995679.88012
}