{
  "game_id": "0022300669",
  "espn_id": "401585297",
  "date": "Jan 30, 2024",
  "matchup": "LAL @ ATL",
  "headline": "Trae Young scores 26 points, Hawks hand Lakers another double-digit defeat, 138-122",
  "body": "ATLANTA -- — Trae Young and the Atlanta Hawks knew the Los Angeles Lakers would be a bit weary after playing 24 hours earlier in Houston.\n\n\r\n              So they came out running and gunning, handing LeBron James and the Lakers their second double-digit loss in as many nights.\n\n\r\n              Young scored 26 points, knocking down his first six attempts from 3-point range, and the Hawks raced past Los Angeles 138-122 on Tuesday.\n\n\r\n              “We knew they played last night, so we knew we needed to get up and down and run, play in transition and play fast,” Young said. “We knew as the game would go on, they would tire down. That's what they did.”\n\n\r\n              The Hawks seized control by ripping off three straight baskets to start the second half, pushing their lead to 17 points and forcing the Lakers to call a quick timeout.\n\n\r\n              It didn't help. Atlanta stretched the margin to 20 points and the Lakers never got any closer than 10 the rest of the way in a matchup of teams that reportedly have been in talks ahead of next week’s trade deadline.\n\n\r\n              The Lakers, playing without Anthony Davis after a 135-119 loss at Houston on Monday, slipped back below .500 at 24-25. Austin Reaves scored 28 points and James added 20 in a lackluster performance before a standing-room-only crowd.\n\n\r\n              “We could, on any given night, beat any team in the NBA,” James said. “But, on any given night, we can get our (butt) kicked by any team in the NBA. What’s our record? Under .500? There you go.” \n\n\r\n              Dejounte Murray, who had 24 points for the Hawks, knocked down mid-range jumpers on three straight possessions midway through the fourth quarter to turn back any thoughts of a Lakers comeback. \n\n\r\n              The Hawks guard has been mentioned as someone who might be moved with his team mired seven games under .500 despite its second straight victory. \n\n\r\n              Jalen Johnson chipped in with 19 points for the Hawks, while Bogdan Bogdanovic and Saddiq Bey had 18 apiece. Seven players scored in double figures for Atlanta, which made 16 of 38 from beyond the arc and finished 52% from the field on 101 attempts.\n\n\r\n              “We were making shots,” Young said. “Sometimes when you don't make shots, it allows them to stay in the game, have a rhythm, feel good about themselves. But nights like tonight, when you make shots, they can't have that feeling.”\n\n\r\n              Davis missed his third game of the season, sitting out with what the Lakers listed as left hip and Achilles tendon issues. Jaxson Hayes started in his place and had six points and six rebounds.\n\n\r\n              That was a far cry from the production of Davis, who is averaging 24.9 points and 12.1 rebounds per game.\n\n\r\n              The Lakers also missed Davis at the defensive end.\n\n\r\n              “You've got to have more communication through the course of the possession, because you're gonna have a little slippage,” James said. “When A.D. is out there, he protects us on that third line of defense. When he's not out there, there has to be constant communication.”\n\n\r\n              There also were questions about whether the 39-year-old James would play on consecutive nights. But he went through his pregame routine and was in the starting lineup.\n\n\r\n              “When I'm healthy enough to go out there and play, I just try to perform at a high level, help my teammates do great things out there on the floor, try to be productive,\" James said. “Win, lose or draw, be satisfied with the way I approach the game.”\n\n\r\n              He wasn't satisfied with the way he shot from the free-throw line, going 4 of 9.\n\n\r\n              “I’ve gotta be better,” said James, who had nine rebounds and eight assists.\n\n\r\n              Hawks forward De'Andre Hunter played for first time since Dec. 20, coming off the bench to score six points in 16 minutes. He missed 19 games with right knee inflammation. \n\n\r\n              Young hopes Hunter's return signals better days ahead for the underachieving Hawks.\n\n\r\n              “Any team can do it one night or two nights in row. We've just got be consistent with it,” Young said, \"Hopefully we can string together some wins that propel us forward to where we want to go and need to be.\"\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Continue a six-game trip Thursday night at Boston.\n\n\r\n              Hawks: Host Phoenix on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995508.3115578
}