{
  "game_id": "0021600993",
  "espn_id": "400900388",
  "date": "Mar 13, 2017",
  "matchup": "MIL @ MEM",
  "headline": "Carter scores season-high 24 to lead Grizzlies past Bucks",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies went old school to solve their recent shooting woes, plugging 40-year-old Vince Carter into the starting lineup for the first time this year.\n\nCarter made all eight of his shots, including six from beyond the arc, to score a season-high 24 points and lead the Grizzlies past the Milwaukee Bucks 113-93 on Monday night.\n\nCarter set a season high for 3-point makes in his first start of the season, and Memphis shot 52 percent for the game, including 14 of 27 from deep.\n\n\"He never ceases to amaze me,\" Grizzlies coach David Fizdale said.\n\nMemphis stopped a five-game skid by ending the Bucks' six-game winning streak.\n\n\"Hey, better late than never,\" Carter said of his starting role and perfect night. \"I didn't realize it until (Chandler Parsons) said something to me. I'd rather not know. Just let me play.\"\n\nMike Conley had 20 points and 10 assists for Memphis. Tony Allen had 15 points, while Zach Randolph finished with 14 points.\n\nGiannis Antetokounmpo led the Bucks with 18 points, while Malcolm Brogdon contributed 15 off the bench. Greg Monroe and Matthew Dellavedova finished with 13 points each for Milwaukee, which started a six-game trip against Western Conference teams.\n\n\"I think they came out with more urgency than we did,\" Brogdon said.\n\n\"The controlled the whole game, and the tempo of the game,\" Bucks coach Jason Kidd added.\n\nMilwaukee trailed by 17 in the third quarter but chipped away to pull within 94-87 with just under seven minutes remaining. Then Randolph bullied his way inside for two baskets, and the Grizzlies reclaimed a double-digit lead.\n\n\"We just couldn't get over the hump,\" Kidd said.\n\nMemphis, which struggled mightily from the field during its losing streak, set the tone early. Carter hit six shots in the first half, including four from outside the arc and a reverse dunk. He had 16 points as Memphis carried a 61-51 lead into the break.\n\nTIP-INS\n\nBucks: The Bucks missed an opportunity to record their first seven-game winning streak since winning eight in a row in January 2002. ... Khris Middleton (11 points) started his eighth game. The loss marked the first loss of the season when he starts. Middleton missed the first 50 games of the season recovering from surgery to a ruptured left hamstring. ... Milwaukee had held its previous five opponents under 100 points.\n\nGrizzlies: Randolph (17,530) passed Kidd for 79th on the NBA career scoring list. ... The Grizzlies hold a 21-20 edge in the series. ... Memphis has won six straight home games against Milwaukee. The Bucks have not won a road game in the series since Nov. 21, 2009.\n\nPARSONS INJURY\n\nThe Grizzlies announced forward Chandler Parsons, the team's biggest offseason free agent signing, is out with a partial tear of the meniscus in his left knee. Parsons, signed to a four-year, $94 million contract in the offseason, has had two surgeries on his right knee in the last two years. The team announced earlier this season that he suffered a bruise to his left knee that caused him to miss 17 games.\n\nVETERAN VINCE\n\nCarter, at 40 years, 46 days old, became the oldest player to start an NBA game since Juwan Howard started for Miami on April 17, 2013.\n\n\"We all grew up watching (Carter), and we knew it was in his engine,\" said Allen, 35.\n\n\"I don't think I'll be playing when I'm 40,\" Grizzlies center Marc Gasol said. \"I'll be done. Maybe at the YMCA or something, but not in the NBA.\"\n\nUP NEXT\n\nBucks: Play the second game of a six-game trip against the Western Conference facing the Los Angeles Clippers on Wednesday.\n\nGrizzlies: Travel to Chicago to face the Bulls on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995145.164243
}