{
  "game_id": "0021800994",
  "espn_id": "401071667",
  "date": "Mar 10, 2019",
  "matchup": "PHI vs. IND",
  "headline": "Embiid drops 33 points, lifts 76ers past Pacers in return to action",
  "body": "PHILADELPHIA -- Joel Embiid mouthed \"I'm back\" to a roaring 76ers crowd that had missed the popular big man.\nThe Sixers will need him to stick around to get back among the NBA's elite.\nEmbiid had 33 points and 12 rebounds in his first game in nearly a month, leading Philadelphia past the Indiana Pacers 106-89 in a pivotal Eastern Conference matchup Sunday.\n\"He is a difference-maker in all ways, shapes and forms,\" coach Brett Brown said.\n\nEmbiid returned to the lineup after being sidelined by a sore left knee. The Sixers were 4-4 in his absence, including a blowout loss Friday at Houston that only exacerbated the problem.\nWith Embiid back, the Sixers (42-25) moved into a tie with Indiana for third in the East. They hold the tiebreaker over the Pacers by virtue of their 3-1 record in the season series.\n\"I just felt like I had to play this game just to make sure we were in good position,\" Embiid said.\nEmbiid was greeted with a rousing standing ovation in his first game for the Sixers since he took a flying leap over actress Regina King on Feb. 13 in New York. Embiid hadn't played since he was on the court for 23 minutes in the All-Star Game, though the team has denied a link between playing in the game and his knee injury.\n\"I felt like at some point after the All-Star Game, I was uncomfortable,\" Embiid said. \"We did some tests, and I'm glad everything was good. It's just about making sure that I'm pretty strong.\"\nEmbiid made 11 of 21 shots in 28 minutes and showed the Sixers what they missed in his absence. Early in the fourth, Embiid pump-faked from the top of the 3-point arc, drove the lane and was fouled as he tossed up a one-handed layup. Embiid extended his arms and pointed at himself, mouthing \"I'm back\" as Sixers fans went wild.\n\nHe sank the free throw for an 83-74 lead and hit the bench to a standing ovation. Embiid cupped an ear toward the crowd, a signature move from former 76ers great Allen Iverson.\nThe Sixers are 26-9 at home and want that edge in the playoffs.\n\"We're on the clock, and I think that the sense of urgency and awareness of what we are getting close to, having to perform at the level that we have to perform at is real for these players,\" Brown said. \"I can feel that there's an excitement having Joel back.\"\nThe Pacers missed their shot to knock the Sixers down to fifth in the East. The Pacers missed 17 of 20 shots in the third and scored only 11 points while falling behind 72-70 after holding a 14-point lead. They went the final 6 minutes, 55 seconds of the third without scoring a basket and never got going in the fourth.\nBojan Bogdanovic led the Pacers with 18 points.\n\"All of them hurt,\" Pacers coach Nate McMillan said. \"Certainly, this game, with a team so close to you, big game. Had an opportunity to split the series and didn't get that done.\"\nEmbiid was out of basketball shape -- conditioning has always been a factor for the 7-footer -- and he was whistled for three fouls in his first nine minutes of play.\nHe was already wiped from a scrimmage Saturday that left him concerned he'd miss the game.\n\"Yesterday, I was on the floor, crying for my life,\" Embiid said. \"I didn't think I was going to come in and play.\"\nEmbiid, who missed his first two seasons with injuries, said he expected to sit out other games for rest the remainder of the regular season.\nHe went wild when he was called for a foul on Domantas Sabonis' drive to the basket in the first quarter. Sabonis appeared to drive the baseline untouched by Embiid and hit the court to toss up a shot. Embiid was called for the foul and was quickly hit with a technical foul for yelling at the referees.\nEmbiid was fatigued and frustrated in the first half -- and the fans were fed up.\nThe Sixers were soundly booed off the court by 20,636 fans as they trudged into a timeout down 14 points in the second quarter. JJ Redick buried a 3 out of the timeout and Ben Simmons threw down a dunk to help get the crowd going again.\nSabonis gave the Pacers a big lift after he missed five games with an ankle injury. Sabonis, one of the top reserves in the NBA, had five assists in the first half to help Indiana to a 59-51 lead.\n\"If we're the team that we think we are, these are the kind of games we've got to win,\" Pacers center Myles Turner said.\nTIP-INS\nPacers: Tyreke Evans, a native of nearby Chester, Pennsylvania, did not play because of an illness. ... The Pacers wore their \"Hickory\" uniforms.\n76ers: The 11 points scored by Indiana in the third were the fewest scored against 76ers in any quarter since the New Orleans Pelicans also had 11 in the third on Feb. 9, 2018.\nUP NEXT\nPacers: Return home to play New York on Tuesday.\nSixers: Host Cleveland on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994000.875873
}