{
  "game_id": "0022400158",
  "espn_id": "401704724",
  "date": "Nov 04, 2024",
  "matchup": "MEM @ BKN",
  "headline": "Schroder and Johnson each score 20 as the Nets beat the Grizzlies 106-104",
  "body": "NEW YORK -- — Dennis Schroder and Cam Johnson each scored 20 points, and the Brooklyn Nets beat the Memphis Grizzlies 106-104 on Monday night.\n\n\r\n              Dorian Finney-Smith added 17 points, Cam Thomas had 13 and Nic Claxton 10 for Brooklyn, which evened its record at 4-4.\n\n\r\n              Ja Morant scored 25 points and rookie Zach Edey had season highs of 25 points and 11 rebounds for the Grizzlies, who had won their last two games. Jaren Jackson Jr. had 15 points.\n\n\r\n              With the game tied at 101 with 1:13 left, Finney-Smith hit a 3-pointer and Schroder drove past Edey and made a layup to make it 106-101 with 32 seconds remaining.\n\n\r\n              Jackson answered on the other end with a 3-pointer and the Grizzlies had a chance to win but Santi Aldama missed a 3 as time expired.\n\n\r\n              Takeaways\r\n              Grizzlies: Edey was perfect from the field in the third quarter, hitting each of his five shots along with one free throw for 13 points.\n\n\r\n              Nets: Johnson had his second consecutive game with at least 20 points – the third time he has done since coming to Brooklyn in the Kevin Durant trade.\n\n\r\n              Key Moment\r\n              Playing for the first time at Barclays Center since the 2021-22 season, Morant wowed the crowd late in the second quarter when he drove and spun mid-air for a layup. Early in the third, Jackson found a driving Morant, who leaped and faked the Nets defender as if he was going to throw down a dunk and pulled off a reverse spin before laying it off the glass.\n\n\r\n              Key Stat\r\n              The Grizzlies made just 8 of the 30 attempts beyond the 3-point line.\n\n\r\n              Up Next \r\n              The Nets start a three-game road trip at Boston on Friday night. The Grizzlies host the Los Angeles Lakers on Wednesday night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997758.692102
}