{
  "game_id": "401809809",
  "espn_id": "401809809",
  "date": "Nov 26, 2025",
  "matchup": "POR vs SA",
  "headline": "Fox scores 37 points to lead Spurs past Trail Blazers 115-102 in NBA Cup game",
  "body": "PORTLAND, Ore. -- — De’Aaron Fox had 37 points and eight assists as the San Antonio Spurs defeated the Portland Trail Blazers 115-102 on Wednesday night in an NBA Cup group stage game.\n\n\r\n              Devin Vassell added 23 points for the Spurs, who kept their NBA Cup hopes alive. \n\n\r\n              Deni Avdija led Portland with 37 points and eight assists.\n\n\r\n              The Spurs shot 22 of 25 (88%) from the free-throw line, while the Blazers went 19 for 30 (63%). Portland also connected on only 25% of its attempts from behind the 3-point line, while San Antonio finished at 33%.\n\n\r\n              A layup by Kelly Olynyk put San Antonio up by 11 with 5:23 left before Portland rallied.\n\n\r\n              A 3-pointer by Toumani Camara cut it to 107-99. After a replay review, Olynyk picked up a clear-path foul, giving the Blazers two free throws and possession. But they failed to take advantage of the opportunity. After being nearly perfect at the line, Avdija missed both foul shots and Portland came up empty.\n\n\r\n              Avdija was 2 for 8 — including four straight misses — from the free-throw line in the fourth quarter.\n\n\r\n              A hook shot by Donovan Clingan brought Portland closer at 107-101 with 3:59 left. Fox’s bank shot with 3:22 remaining made it 109-101.\n\n\r\n              Fox was fouled with 2:52 left and made both free throws to put San Antonio ahead 111-101. Portland turned the ball over on the next possession.\n\n\r\n              After the Spurs trailed for most of the first half, a 3-pointer by Fox gave them a 56-54 halftime lead.\n\n\r\n              A key player for each team returned to action. \n\n\r\n              San Antonio rookie Dylan Harper came back from a calf injury when he entered midway through the first quarter after being out since Nov. 2. Portland’s Shaedon Sharpe made his first appearance since Nov. 18 with 3:43 left in the period.\n\n\r\n              Sharpe scored 11 points in 18 minutes, and Harper had seven in 16 minutes.\n\n\r\n              Up next\r\n              San Antonio visits Denver on Friday night.\n\n\r\n              Portland hosts Oklahoma City on Sunday afternoon. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042703.327331
}