{
  "game_id": "0021500174",
  "espn_id": "400828061",
  "date": "Nov 18, 2015",
  "matchup": "CHI @ PHX",
  "headline": "Butler's season-high 32 power Bulls past Suns, 103-97",
  "body": "PHOENIX --  The fourth quarter was Jimmy Butler's time Wednesday night.\n\nButler scored 14 of his season-high 32 points in the final period, leading the Chicago Bulls over the Phoenix Suns 103-97 for their fourth straight victory.\n\nPau Gasol added 17 points and eight rebounds, Kirk Hinrich scored 14 and former Phoenix guard Aaron Brooks had 12 points as Chicago ended the Suns' three-game winning streak.\n\nButler's 3-pointer with 1:08 to play gave the Bulls a 99-92 lead, and he followed it up with a dunk with 9.2 seconds left. The fifth-year guard took on a bigger offensive load with Derrick Rose sidelined by an ankle injury.\n\n\"I just made a couple of shots. But it felt good to see the ball going in,\" Butler said. \"My teammates just kept giving me the ball, to tell you the truth, whether I wanted it or not. Telling me to make plays.\"\n\nBrandon Knight paced Phoenix with 23 points and P.J. Tucker added 20 points and seven rebounds. High-scoring guard Eric Bledsoe had his second-worst shooting night of the season, finishing 7 of 22 while scoring 21 points.\n\nThe Suns led 88-87 with 4:47 left on a pair of free throws by Bledsoe but couldn't hold off the Bulls, who scored the next seven points. Butler played the entire fourth quarter.\n\nHe said he spoke with Rose before the game and was told to be more aggressive on the offensive end.\n\n\"It helps to have a superstar like him in my corner, coaching me up. Obviously we want him out there on the floor with us,\" Butler said.\n\nThe Bulls made 13 of 18 shots and equaled a season high for points in the first quarter with 31, including 10 from Butler.\n\n\"For a guy that played 43 minutes, he didn't look like he was tired at all,\" Suns coach Jeff Hornacek said.\n\nChicago went ahead 42-25 on a turnaround by Gasol with 7 minutes left in the second. But the Suns outscored the Bulls 22-11 until halftime, cutting the deficit to 51-47 on a 3-pointer from Bledsoe with 46 seconds left.\n\nHinrich started in place of Rose, held out with a sprained left ankle.\n\n\"He does such a great job of getting us into our offense and getting our defense organized,\" Bulls coach Fred Hoiberg said about Hinrich, who had season highs in points and assists (six).\n\nBrooks left midway through the third after grabbing his left leg. He went back to the locker room immediately but returned before the quarter was over, only to leave the game again with 4:15 to play due to a hamstring injury.\n\n\"It's pretty bad,\" Brooks said. \"Nothing I've ever been through before. I didn't feel a tear or pop. Wake up and see how it feels.\"\n\nSuns forward Markieff Morris was back in starting lineup after missing the previous two games with a left knee sprain. He scored six points in 28 minutes.\n\nTIP-INS\n\nBulls: Rose is day to day, Hoiberg said before the game. Rose's ankle is still sore and he's not expected to do much in practice on Thursday beyond testing out the ankle with running and making cuts. ... The Bulls have won 11 of the past 14 meetings. ... Joakim Noah grabbed 11 rebounds without scoring a point, the first time a Bulls player had double digits in rebounds without scoring since March 11, 2011, when Noah had 11 boards against Atlanta.\n\nSuns: G Ronnie Price also returned to action, playing 11 minutes. Price missed the previous two games with a concussion. ... The Suns were without key reserve T.J. Warren, out due to flu-like symptoms. ... Hornacek was issued a technical foul for arguing in the third quarter.\n\nBULLS FEEL AT HOME\n\nLate in the fourth quarter, the large contingent of Bulls fans at Talking Stick Resort Arena chanted \"Let's Go Bulls!\" As is the norm in Phoenix, Chicago sports fans were out in full force to support one of the city's teams.\n\nWHAT A PASS!\n\nBrooks bounced a pass between Noah's legs and right to Butler, who hit a 19-foot jumper with 1:04 left in the first quarter. Noah reached down to grab the ball but it moved too fast, and Butler was in the right spot to collect and shoot.\n\nUP NEXT\n\nBulls: At Golden State on Friday night.\n\nSuns: At Denver on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764993972.8997388
}