{
  "game_id": "0021901307",
  "espn_id": "401224782",
  "date": "Aug 12, 2020",
  "matchup": "LAC @ DEN",
  "headline": "George, Leonard lead Clippers past Nuggets for No. 2 seed",
  "body": "LAKE BUENA VISTA, Fla. --  Paul George scored 27 points, Kawhi Leonard had 26 and the Los Angeles Clippers wrapped up the second seed in the Western Conference playoffs with a 124-111 victory over the third-seeded Denver Nuggets on Wednesday night.\n\nThe Clippers will face seventh-seeded Dallas when the playoffs get going next week.\n\nAnd Los Angeles coach Doc Rivers likes how his team is shaping up as things get more serious. He said George and Leonard, the team's two prize offseason acquisitions, are \"in great shape, which is just where we want them to be.\"\n\nThe Clippers took control with 13 straight points midway through the third quarter and barely let the Nuggets get back in it.\n\nGeorge and Leonard were big reasons why. George made two 3-pointers midway through the period, and Leonard sprinted to up from the back court on a defensive possession, picked off a pass at mid-court and glided in for a basket.\n\nThe goal now, Leonard said, is to have everyone healthy and ready to go and \"get in better habits with less mistakes going forward.\"\n\nLos Angeles took the lead for good with 10 minutes left on Lou Williams' jumper and steadily built the advantage to double digits on the way to its second straight win over the Northwest Division champions.\n\nWilliams was the third Clipper with 20-plus points, finishing with 23.\n\nGeorge said the locker room wasn't consumed by finishing as the two seed in the difficult Western Conference because there were bigger goals out there.\n\n\"We know what's at stake and we know what we're here for,\" George said.\n\nJerami Grant, who missed Denver's last game due to injury, led the Nuggets with 25 points. It was the third time in the past four games Grant, who came in averaging less than 12 points a game, went for 20 or more points.\n\nNikola Jokic finished with 17 points and 13 assists, but sat much of the fourth quarter as coach Mike Malone chose to rest many of his top line players down the stretch.\n\n\"We're going to be smart about this,\" Malone said. \"As much as we want to win games, I also want to be healthy come playoffs.\"\n\nThe Nuggets, as the third seed, will face No. 6 Utah in the playoffs.\n\nRivers said the team will work on keeping that momentum, but even if they had not emerged as the second seed, it would not have changed their motivation.\n\n\"We want to win it all,\" he said.\n\nEXPECTATIONS MET\n\nThere were a lot of goals placed on George and Leonard when they joined the Clippers this past offseason. George, for one, is happy he has been able to get things started off the right way with a successful regular season. He said there will be a lot of unknowns going forward in these bubble playoffs, but \"I'm confident. This group is confident.\"\n\nTIP INS\n\nNuggets: Denver coach Mike Malone ended his afternoon media session with a shoutout to another Mile High City team looking to make its playoff mark, saying \"Go Avs\" as he left. The Colorado Avalanche beat Arizona in Game 1 of their NHL playoff series Wednesday. ... Starters Will Barton III and Gary Harris, both starters, continued their absences. Barton has right knee soreness and Harris right hip muscle strain.\n\nClippers: Patrick Beverley and Montrezl Harrell have both returned to the NBA's bubble, although neither could play as yet. Beverley is dealing with a left calf strain. ... Ivica Zubac had 15 points and a team-high 12 rebounds for Los Angeles.\n\nUP NEXT\n\nNuggets: Play Toronto on Friday.\n\nClippers: Play Oklahoma City on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996483.866576
}