{
  "game_id": "0022401146",
  "espn_id": "401705712",
  "date": "Apr 08, 2025",
  "matchup": "MEM @ CHA",
  "headline": "Morant scores 28 as the Grizzlies beat Hornets 124-100; Memphis' Wells breaks wrist in hard fall",
  "body": "CHARLOTTE, N.C. -- — Ja Morant had 28 points, five rebounds and eight assists as the Memphis Grizzlies beat the Charlotte Hornets 124-100 on Tuesday night.\n\n\r\n              Memphis guard Jaylen Wells broke his right wrist on a hard fall on his arm and head and was taken from the court on a stretcher and transported to a hospital after he made a fast-break dunk and had a midair collision with Charlotte’s K.J. Simpson. Wells, who was starting his 74th game, was inadvertently undercut by Simpson from behind. Wells was down for eight minutes before being lifted onto the stretcher with his head strapped in to restrict motion. Officials called a Flagrant 2 foul on Simpson, who was automatically ejected.\n\n\r\n              Desmond Bane scored 19 points, Zach Edey had 17 points and 19 rebounds and Jaren Jackson Jr. 14 points for Memphis (47-32), which kept pace in the Western Conference race. Teams from third to eighth place were separated by two games in the standings heading into Tuesday.\n\n\r\n              Miles Bridges scored 14 points for Charlotte (19-60).\n\n\r\n              Takeaways\r\n              Grizzlies: After missing Saturday’s win at Detroit due to food poisoning, Morant made the most of his “homecoming” visit to Charlotte, which is 107 miles north of his native Dalzell, South Carolina. He had a crowd-pleasing alley-oop dunk late in the first quarter and many cheered his baskets throughout the game.\n\n\r\n              Hornets: Charlotte’s 16-year veteran Taj Gibson played in his 999th career regular-season game. Gibson is in his first season with the Hornets after previously playing for Chicago, Oklahoma City, Minnesota, New York, Washington and Detroit.\n\n\r\n              Key moment\r\n              Bane scored five of the game’s first seven points as Memphis raced to a 7-0 lead. Charlotte never led in the game.\n\n\r\n              Key stat\r\n              Charlotte converted 15 of 32 3-pointers, with Ball going 5 fof 10. Jeffries was 3 for 5, Jusuf Nurkic hit two, Smith went 2 for 4 and Bridges 2 for 5.\n\n\r\n              Up next\r\n              The Grizzlies host Minnesota on Thursday. The Hornets visit Toronto on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764997589.305772
}