{
  "game_id": "0021700037",
  "espn_id": "400974788",
  "date": "Oct 21, 2017",
  "matchup": "PHX @ LAC",
  "headline": "Griffin, Beverley lead Clippers in rout over Suns",
  "body": "LOS ANGELES -- With two straight blowout wins, the Los Angeles Clippers like how they're playing.\nBlake Griffin had 29 points and eight rebounds, Patrick Beverley added 15 points and six steals, and the Clippers cruised to a 130-88 victory over the Phoenix Suns on Saturday night in their home opener.\nThe Clippers are a revamped team this season with nine new players, but early signs are only positive. The defeated the Lakers 108-82 in their season opener.\n\"I like how the ball's moving, I like our pace,\" Clippers coach Doc Rivers said. \"A lot of guys are handling the ball, a lot of guys are contributing.\"\nThe only bad news was watching new starting point guard Milos Teodosic have to be carried off the floor in the second quarter with a left foot injury. The Clippers said X-rays were negative, but Teodosic left on crutches and is scheduled to have an MRI on Sunday.\nThere was little but bad news for the young Suns (0-3), who trailed by 14 at the half and then saw the Clippers open the third quarter with a 14-2 run to take complete command.\n\"We had a chance to take back into the lead to start the third quarter,\" Suns coach Earl Watson said. \"We had a chance to cut it to seven instead of 20. Once it hit 20 we could never bounce back.\"\nOnly two starts finished in double figures, Devin Booker scored 13 points and rookie Josh Jackson had 12 points. Reserve center Alex Len led Phoenix with 15 points.\n\"I thought we started out pretty well,\" Watson said. \"The third game in four nights, you never know what takes effect with a young team. At the same time, I'd like to see the fight be a little bit more. Or a lot more, until you know they're just fatigued.\"\nTIP-INS\nSuns: Phoenix has the youngest team in the NBA. It is starting the season with four rookies and four second-year players. Forward Dragan Bender is 19 and three others are 20.\nClippers: With nine new players this season, it figures to be a while before Rivers is certain exactly what kind of team he has. Said Rivers: \"I think I know this group and know their talent level. I don't know what kind of team we have yet.\"\nTEODOSIC INJURED\nThe Serbian who took over at the point for Chris Paul, was starting his second game. The 30-year-old rookie was a six-time all EuroLeague selection.\nAfter Gallinari missed a 3-point attempt, Teodosic came crashing to the floor near the far end line. He immediately grabbed his left foot/ankle area and motioned to the bench.\n\"It's definitely a foot injury but we don't know what it is,\" Rivers said. \"He's down because he obviously came over here to play basketball, not to be injured. So let's just hope he's not.\"\nGRIFFIN ROLLING\nWith three starters gone from last season's team, the Clippers figure to look more than ever to their power forward to lead the way. He seems eager to respond.\n\"It all starts with Blake offensively,\" said Clippers center DeAndre Jordan. \"We'll follow his lead. And he's playing great.\"\nUP NEXT\nSuns: Host the Sacramento Kings on Monday. Sacramento defeated Phoenix three times in four meetings last season.\nClippers: Host the Utah Jazz on Tuesday. The Clippers took three out of four games from the Jazz last season.",
  "source": "espn_api",
  "crawled_at": 1764993930.557836
}