{
  "game_id": "0021900809",
  "espn_id": "401161451",
  "date": "Feb 12, 2020",
  "matchup": "TOR @ BKN",
  "headline": "Raptors' 15-game win streak snapped with 101-91 loss to Nets",
  "body": "NEW YORK --  The Toronto Raptors were hoping to keep rolling right into the All-Star break.\n\nInstead, they had their franchise-record winning streak stopped at 15 games with a 101-91 loss to the Brooklyn Nets. Still, the reigning NBA champions are 40-15 despite losing Kawhi Leonard last summer and battling injuries all season, so they could easily shrug off a poor performance Wednesday.\n\n\"In the big scheme of things, you look at the overall of where you're sitting and have to be pleased with that,\" coach Nick Nurse said.\n\nThe Raptors couldn't find the form that helped them average 121.2 points and shoot 50% over the previous 15 games. This time, they hit only 37.8%, with Kyle Lowry's triple-double coming on a night when the All-Star point guard was just 4 for 13.\n\n\"We didn't play well. Simple as that,\" Lowry said.\n\n\"They played well and give them credit, they played their butts off. They beat us. It's only one game.\"\n\nCaris LeVert scored 20 points for the Nets, who ended a six-game losing streak against the Raptors. That included Saturday in Toronto, where LeVert scored a career-best 37 points but the Nets fell 119-118.\n\n\"I think we felt like we were right there in Toronto. We were really a last second tip-in from winning the game and we were confident going into it,\" forward Joe Harris said. \"Obviously any time you play home in front of your own fans, you definitely get a distinct advantage that way\".\n\nHarris added 19 points and Spencer Dinwiddie had 17 points and nine assists for the Nets, who head into the break 25-28 after having Kyrie Irving for just 20 games. He sat out again with a sprained right knee.\n\nSerge Ibaka had 28 points and nine rebounds for the Raptors after returning from a one-game absence with flu-like symptoms. Fred VanVleet scored 22 points and Lowry had 12 points, 12 assists and 11 rebounds.\n\nThe Nets extended a 10-point lead after three quarters to 80-65 in the opening 90 seconds of the fourth and spent the rest of the game turning back every Toronto attempt to get back in it. The Raptors' best shot came when Ibaka made a 3-pointer and VanVleet converted a three-point play to cut it to 91-82 with 4:13 remaining, but LeVert made consecutive baskets to quickly push the lead back into double figures.\n\n\"I thought our physicality, the things we were missing in the last two games against them, I thought we just raised that. We wanted it bad,\" Nets coach Kenny Atkinson said. \"The execution wasn't perfect, but our will to win was at a super-high level. That's why we came out with the W.\"\n\nThe Nets scored the first seven points of the second quarter to open a 30-19 lead. The Raptors had the deficit down to six in the final minute of the period, but Harris made three free throws and then a 3 to make it 52-40 at halftime.\n\n\"I thought we were a little flat early and just couldn't really get it going after that,\" VanVleet said. \"It is what it is. We weren't going to win them all.\"\n\nTIP-INS\n\nRaptors: Toronto had won 10 straight on the road. ... The Raptors lost for the first time since Jan. 12 against San Antonio.\n\nNets: Brooklyn has won five straight at home. All were by double digits, matching a franchise record. ... LeVert has averaged 24 points in his last five games.\n\nMISSING MARC\n\nWith center Marc Gasol still sidelined by left hamstring tightness, the Raptors were overwhelmed by the Nets' center tandem. Jarrett Allen had 10 points and 13 rebounds, while backup DeAndre Jordan also had 10 rebounds.\n\nSTREAK STOPPING\n\nToronto's 15-game run was the longest winning streak ever snapped by the Nets. The previous mark was Seattle's 12-game streak the Nets ended with a 111-91 victory on Nov. 21, 1982.\n\nUP NEXT\n\nRaptors: Host Phoenix on Feb. 21.\n\nNets: Visit Philadelphia on Feb. 20.",
  "source": "espn_api",
  "crawled_at": 1764995592.719598
}