{
  "game_id": "0022000140",
  "espn_id": "401267300",
  "date": "Jan 09, 2021",
  "matchup": "SAC vs. POR",
  "headline": "McCollum scores 37 as Trail Blazers rout Kings 125-99",
  "body": "SACRAMENTO, Calif. -- — CJ McCollum scored 37 points, making six 3-pointers, and the Portland Trail Blazers coasted to a 125-99 victory over the Sacramento Kings on Saturday night.\n\n\r\n                    The Trail Blazers led by as many as 31 and faced little resistance from a Kings team that gave up 144 points to Toronto just a night earlier.\n\n\r\n                    Sacramento (4-6) didn’t fare much better defensively Saturday and lost for the fifth time in six games. \n\n\r\n                    McCollum scored 16 points in the first half as the Blazers took a 66-49 lead into the break. Then he scored 16 in a roughly seven-minute span to begin the third as Portland rattled off a 22-8 run that ended any hopes of a Sacramento comeback.\n\n\r\n                    “He's just playing. He's finding his rhythm,” Portland forward Carmelo Anthony said. \"He’s in his groove right now, and he’s leading us at this moment. We all know he can score the basketball. but it’s how he’s doing it. ... His feel for the game is getting better each year.”\n\n\r\n                    Damian Lillard scored 17 points for Portland and Anthony added 13. \n\n\r\n                    Marvin Bagley III had 15 points for the Kings, who shot just 40.7 % (33 for 81) from the floor. They went 8 for 30 from beyond the arc and committed 15 turnovers that Portland converted into 30 points. But defense is the biggest issue for the Kings right now.\n\n\r\n                    “We just have to understand at this level, against a team like Portland and whoever we're playing, we have to bring it every single night, and that’s what we’re looking for,” Kings coach Luke Walton said. \"It was a tough one for us tonight.”\n\n\r\n                    The Blazers made eight of their first 13 shots on the way to a 38-point first quarter. The Kings shot 42.5% from the floor in the first half without a single scorer in double digits.\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: With a 3-pointer midway through the third quarter, McCollum passed Rasheed Wallace (9,119 points) for 10th place on Portland’s career scoring list. Next up is Mychal Thompson at 9,215. ... Enes Kanter finished with 11 points and 15 rebounds.\n\n\r\n                    Kings: Center Richaun Holmes (sore left ankle) was scratched about 30 minutes before opening tip. Walton switched to a three-guard lineup and rookie Tyrese Haliburton made his first NBA start. Haliburton finished with 12 points and eight assists.\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Host Toronto on Monday, having split the season series with the Raptors each of the past two seasons.\n\n\r\n                    Kings: Host Indiana on Monday, the fourth game of a seven-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764997197.4687989
}