{
  "game_id": "0021400623",
  "espn_id": "400578915",
  "date": "Jan 20, 2015",
  "matchup": "OKC @ MIA",
  "headline": "After injury-filled start, Thunder get over .500 for first time this season",
  "body": "MIAMI -- Just about every statistic was what the Miami Heat would have wanted.\nThey kept Kevin Durant and Russell Westbrook off the foul line for the most part, watched Oklahoma City's two stars combine to miss every 3-pointer they tried, limited each to fewer than 20 points and held the Thunder far below their typical scoring output of late.\nAnd even that wasn't enough.\nDurant and Westbrook each scored 19 points, and the Thunder beat the Heat 94-86 on Tuesday night -- the win putting Oklahoma City over the .500 mark for the first time this season.\n\n\"We did a great job of keeping our composure, just playing through the defense,\" Thunder coach Scott Brooks said.\nThe stats that doomed the Heat: a 21-11 difference in turnovers, a 22-9 disparity in points off turnovers and the Thunder getting up 92 shots to Miami's 68.\n\"To leave a real competitive defensive game like that on the table is pretty disappointing,\" Heat coach Erik Spoelstra said.\nWestbrook grabbed 10 rebounds, Durant added eight rebounds and eight assists, Reggie Jackson scored 16 points, and Anthony Morrow added 12 for Oklahoma City -- who were nine games under .500 in late November, when Durant was still sidelined with a broken foot.\nThe Thunder are 13-5 with Durant in the lineup and now winners of 18 of their past 26 -- but Durant said getting over the .500 mark meant \"nothing.\"\n\"We have to keep pushing,\" Durant said. \"We're not worried about it. We didn't come in here and rejoice because we're over .500.\"\nDwyane Wade scored 18 points and Chris Bosh added 16 for Miami, which fell to 7-13 at home.\nDurant was 0-for-8 from 3-point range -- matching the second-worst showing of his career -- and the Thunder got to the foul line only 10 times, less than half their team average going into the night.\nIt didn't matter, especially after Miami shot only 42 percent in the final three quarters. Miami had three shots to tie or take the lead in the fourth quarter, all of them missing, and the Thunder eventually pulled away.\n\"We weren't loose with the ball, but we weren't taking care of the ball,\" Bosh said.\nThe game was the exact midpoint of the regular season for both teams. Oklahoma City went 21-20 in its first 41 games; Miami went 18-23.\n\"Trying,\" Wade said, when asked to describe the season's first half.\nTIP-INS\nThunder: Oklahoma City had four steals in a 55-second span of the first quarter, two by Westbrook, two by Andre Roberson. ... Durant posed for photos and shook hands during warm-ups with U.S. Army Sgt. Ian Vaquero, the night's honoree as part of the Heat's HomeStrong program that honors returning military veterans at each game. ... The Thunder have gone 28-13 over the second half of their schedule in each of the past two seasons.\nHeat: Backup center Chris Andersen had a unique sequence in the second quarter, getting dunked on by Durant at one end and making a 3-pointer -- just the eighth of his career -- on the ensuing Heat possession. ... Miami wore new \"black tie\" uniforms, a nod to men's formalwear. ... Wade appeared in his 750th regular-season game. ... Bosh broke a tie with Glen Rice and moved into the No. 7 spot on Miami's all-time rebound list.\nWHITESIDE HURT\nMiami lost starting center Hassan Whiteside in the second quarter to a sprained right ankle. X-rays were negative. Whiteside finished with 10 points on 5-for-5 shooting -- three of them dunks -- in 11 minutes. He did not travel with the team to Charlotte for a game Wednesday night.\nDURANT FINE\nDurant got a scare in the second half when he fell after a dunk in transition, remaining down on the court for a few minutes. He said after the game that it was just a stinger and he didn't expect it to be an issue going forward.\nUP NEXT\nThunder: At Washington on Wednesday.\nHeat: At Charlotte on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764991898.356562
}