{
  "game_id": "0021800747",
  "espn_id": "401071420",
  "date": "Jan 28, 2019",
  "matchup": "MEM vs. DEN",
  "headline": "Nikola Jokic-led Nuggets match franchise-best rally, down Grizzlies",
  "body": "MEMPHIS, Tenn. -- Nikola Jokic and the Denver Nuggets are off to the best start in franchise history.\nIt only took until the last half of the fourth quarter for them to look the part Monday night.\nJokic scored 24 points and made a go-ahead hook shot with 28.9 seconds left, and the Nuggets overcame a 25-point second-half deficit to beat the Memphis Grizzlies 95-92.\nThe Nuggets rallied hard in the final 4 1/2 minutes, and Will Barton's 3-pointer with 43.9 seconds remaining gave them their first lead of the game at 91-89. After a 3-pointer from Memphis' Justin Holiday, Jokic's basket from 7 feet out put Denver ahead to stay.\n\"We just didn't give up,\" Jokic said, adding: \"That says something about the team. We don't want to quit. We were fighting.\"\nMalik Beasley keyed the fourth-quarter burst, scoring 13 of his 18 points in the final period as the Nuggets erased a 13-point deficit with a 19-4 run.\nHe scored seven points in that stretch and handed out the assist on Barton's basket that completed the rally, giving the Nuggets their first lead of the game.\nThe 25-point margin was the largest of the season that Denver has overcome. The Nuggets trailed 77-60 entering the fourth. That 17-point deficit was the second-largest fourth-quarter deficit the team has come back from in franchise history.\nBy overcoming a 19-point halftime deficit, the Nuggets matched the greatest comeback in franchise history (set in 1981). Overall, NBA teams leading by 25 or more in the second half had been 174-0 this season -- before Monday.\nMarc Gasol led Memphis with 28 points and nine rebounds, and Mike Conley had 23 points and 11 assists. The 25 points marked the largest regular-season blown lead ever for the Grizzlies.\nThe atmosphere was somewhat somber in the Memphis locker room, not only because of the loss but because of the uncertainty of Gasol's and Conley's futures in Memphis, where the two players have spent their entire careers. The Grizzlies revealed last week they would entertain trade offers for the two, the longest-tenured teammates in the NBA.\nMemphis heads out on a three-game road trip and won't return home until Feb. 5. While still two days before the trade deadline, some wondered if this could be the last home appearance for one or both of them.\n\"It's been an awkward week for sure,\" Conley said. \"It's been feeling like it's our eulogy. People giving us hugs and asking for one last autograph, all that stuff. And I'm thinking: 'I'm not gone. I'm still here.'\"\nTIP-INS\nNuggets: Barton had 20 points. ... G Jamal Murray missed his second straight game with a left ankle sprain. ... The previous two times the Nuggets started 33-15 after 48 games -- in 1976-77 and 2009-10 -- they lost the next game. ... The Nuggets had 16 first-quarter points, one off from a season-low for points in a quarter.\nGrizzlies: F Kyle Anderson returned to the starting lineup after missing eight games with left ankle sprain suffered Jan. 12. ... F Omri Casspi missed his second game with knee soreness. F JaMychal Green sat out with left knee soreness. ... The largest blown lead before Monday night was a 23-point advantage against the Los Angeles Lakers on April 4, 2003. ... Conley recorded his seventh double-double of the season.\nHALFTIME PEP TALK\nThe Nuggets had scored at least 70 first-half points the last two games but got nowhere near that against Memphis. Denver shot 30 percent in the first quarter and finished the half at 38 percent to trail 60-41 at the break.\n\"I got onto our guys at halftime,\" Nuggets coach Michael Malone said. \"I wasn't happy. I told my starters: 'You have five minutes to show them you guys want to play,' and in the third quarter I thought we played with great energy and effort. Really good defense.\"\nUP NEXT\nNuggets: Play the Pelicans in New Orleans on Wednesday night.\nGrizzlies: Travel to Minnesota to face the Timberwolves on Wednesday night.\nInformation from The Associated Press and ESPN Stats & Information was used in this report.",
  "source": "espn_api",
  "crawled_at": 1764994918.54559
}