{
  "game_id": "0021500847",
  "espn_id": "400828734",
  "date": "Feb 24, 2016",
  "matchup": "DET vs. PHI",
  "headline": "Harris leads balanced attack as Pistons rout 76ers, 111-91",
  "body": "AUBURN HILLS, Mich. --  After a big road win against first-place Cleveland in their last game, the Detroit Pistons could have been caught overlooking the last-place Philadelphia 76ers back at home on Wednesday night.\n\nHowever, still vying get into a playoff position, the Pistons made sure they avoided that pitfall.\n\nTobias Harris led a balanced offense with 22 points and Andre Drummond had 18 rebounds as Detroit dominated Philadelphia in a 111-91 win.\n\n\"I thought our defense was really good, especially early in the game,\" Pistons coach Stan Van Gundy said. \"They only got 20 points in the first quarter, and that included a banked-in 3 to beat the shot clock and a three-quarters court shot at the end.\n\n\"Our offense was a mess at times, but our defense was good until the last few minutes.\"\n\nPlaying in front of a tiny crowd because of a snowstorm in metro Detroit, the Pistons led by 16 points in the first quarter and were never threatened while winning their second straight after a five-game losing streak.\n\nHollis Thompson scored 19 points to lead the 76ers, who lost their sixth straight. Jahlil Okafor had 13 points, but just two rebounds. No other Philadelphia starter had more than eight points.\n\n\"We had that good stretch before the All-Star break, and it earned us some respect,\" the 76ers' Ish Smith said. \"The problem is that we've lost what we had, so teams are taking us seriously and beating the crap out of us. That's what the Pistons did tonight.\"\n\nThe Pistons were short-handed, thanks to injuries to Anthony Tolliver (knee) and Stanley Johnson (shoulder), leaving them without an established reserve scorer.\n\nHowever, Reggie Bullock came off the bench to score 16 points while playing with a mask to protect his broken nose. Bullock came into the game with six points this season on 1-of-19 shooting.\n\n\"We've lost some guys with Stanley and A.T. being down, but other guys are stepping and picking up the slack,\" Drummond said. \"Reggie works hard every day, even when no one is watching, and tonight, when he got on the floor, he produced for us.\"\n\nDetroit led by 23 points at halftime, and increased the advantage to 30 midway through the third quarter.\n\nStill, Van Gundy didn't stop coaching. After a turnover by Reggie Jackson and a layup by Ish Smith pulled Philadelphia to 76-48, he angrily called a timeout to scream at his players.\n\nIt didn't make much of a difference -- Van Gundy continued to rage at his players' lack of focus even as the Sixers failed to make any kind of serious run. It was 85-61 at the end of the third quarter, and the Pistons cruised to the win.\n\n\"I think we were trying to be unselfish, but we were really sloppy,\" Van Gundy said. \"We were throwing passes all over the place, but at least we were trying to move the ball.\"\n\nDetroit had six players in double figures, with Aron Baynes (nine) just missing out on making it seven.\n\nDetroit dominated early, as Brett Brown's big-man combo of Noel and Okafor was unable to stop a Pistons lineup that could switch Harris and Marcus Morris between small forward and power forward. Brown quickly tried a more traditional combination, but neither player could do much against Drummond.\n\n\"I knew that was going to be tough, because Tobias is a player that I've liked for a long time,\" Brown said. \"He can play 4-3 or he can play 3-4, and so can Morris. That's a tough matchup when we've got two bigs out there.\"\n\nDrummond had eight points and 10 rebounds in the first quarter, and got most of the second period off as Detroit pulled away. It was 65-42 at the half, with Harris having put up 17 points on 7-for-7 shooting. The Pistons outshot the 76ers 52 percent to 35 percent.\n\n\"We have a lot of young, athletic players, and it helps to have Andre back there in the paint,\" Harris said. \"I love being out there with Marcus, because we are both very versatile and we can play off of each other. He can help me and I can help him.\"\n\nTIP-INS\n\n76ers: Robert Covington ended the first quarter with a 55-foot 3-pointer, letting fly from his own 3-point line. It was the second Hail Mary buzzer-beater of the month at the Palace, following Drummond's arena-record 70-footer.\n\nPistons: Justin Harper was in uniform for the first time after signing a 10-day contract with the Pistons, while Joel Anthony was back after going to Houston and Philadelphia after part of the failed trade that would have brought Marcus Thornton and Donatus Motiejunas to Detroit.\n\nUP NEXT\n\n76ers: Host Washington on Friday.\n\nPistons: At Milwaukee on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994909.347927
}