{
  "game_id": "0022300334",
  "espn_id": "401584962",
  "date": "Dec 16, 2023",
  "matchup": "DET @ MIL",
  "headline": "Bucks roll to 146-114 blowout as Pistons suffer their 23rd consecutive loss",
  "body": "MILWAUKEE -- — Damian Lillard's fast start ensured that the Detroit Pistons couldn't get any ideas they might end their lengthy skid against the Milwaukee Bucks.\n\n\r\n              Lillard scored 33 points, Bobby Portis had a season-high 31 and the Bucks trounced Detroit 146-114 on Saturday to hand the Pistons their 23rd consecutive loss. The Bucks matched their highest point total of the season and earned their most lopsided victory.\n\n\r\n              The Bucks rolled to a 24-point lead in the first quarter and never looked back as the Pistons matched the NBA's third-longest skid within the same season. Lillard scored 13 straight Milwaukee points during one stretch late in the first period.\n\n\r\n              “Sometimes those games can be trap games where like, I don't like to say it, but you kind of just play down to the level of who you're playing and you kind of take your foot off the gas and kind of relax and let them hang around the whole game, and in the fourth quarter it's a tight game and you try to turn it on,\" said Portis, who also had a season-high 12 rebounds. “I like how we kind of started from the jump, jumped on them early and kind of controlled the game throughout the game.”\n\n\r\n              Giannis Antetokounmpo had 22 points, eight rebounds and six assists while shooting 7 of 9 in his first game since scoring a franchise-record 64 points Wednesday. Antetokounmpo’s record night came in a 140-126 victory over the Indiana Pacers that featured a postgame confrontation between the teams in the arena hallway involving a dispute over the game ball.\n\n\r\n              “I thought our leaders were leaders tonight,” Bucks coach Adrian Griffin said. “There was no messing around. I thought that in the locker room, there was a seriousness before the game.”\n\n\r\n              Detroit has joined the 1995-96 Vancouver Grizzlies, 1997-98 Denver Nuggets and 2011-12 Charlotte Bobcats in losing 23 straight within the same season.\n\n\r\n              The record for the longest losing streak within a single season is shared by the 2010-11 Cleveland Cavaliers and 2013-14 Philadelphia 76ers, who both dropped 26 consecutive games. The 76ers also had a 28-game losing streak that started in the 2014-15 season and carried over to 2015-16.\n\n\r\n              One night after getting blown out 124-92 at Philadelphia, the Pistons again couldn’t compete with one of the East’s top teams. The Bucks never trailed and built a big enough lead to rest Lillard and Antetokounmpo for the entire fourth quarter.\n\n\r\n              Pistons coach Monty Williams noted his disappointment about having to call an early timeout after the Bucks pulled ahead 32-17 in the first nine minutes.\n\n\r\n              \"We can't afford to start games without the grit and toughness that we display at times,” Williams said. “We just haven't been consistent with it.”\n\n\r\n              Cade Cunningham scored 25 and Bojan Bogdanovic added 24 for the Pistons.\n\n\r\n              The Bucks were missing Malik Beasley due to a non-COVID illness, and they also held out Khris Middleton as they continue to manage his surgically repaired right knee. Detroit didn’t have Isaiah Stewart due to a sprained left shoulder.\n\n\r\n              With Beasley and Middleton unavailable, MarJon Beauchamp made his first start of the season and scored the game’s first seven points. \n\n\r\n              Portis’ 31 points represented his highest total since joining the Bucks in 2020. The highest-scoring game of his career came when he had 38 points for the Chicago Bulls against Philadelphia on Feb. 22, 2018.\n\n\r\n              Beauchamp and Cameron Payne had 11 points apiece. Bucks rookie Andre Jackson Jr. made a rare start and ended up with 10 points and eight rebounds, both career highs.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit the Atlanta Hawks on Monday.\n\n\r\n              Bucks: Host the Houston Rockets on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995782.761515
}