{
  "game_id": "0021800350",
  "espn_id": "401071031",
  "date": "Dec 04, 2018",
  "matchup": "CHI @ IND",
  "headline": "Turner's double-double leads Pacers past Bulls 96-90",
  "body": "INDIANAPOLIS --  The Indiana Pacers aren't picky or worried about style points.\n\nWith All-Star guard Victor Oladipo out for an eighth straight game with a sore right knee, the Pacers will take wins, no matter how they come.\n\nMyles Turner matched his season high with 18 points and added 11 rebounds and five blocked shots as the Pacers defeated Chicago 96-90 on Tuesday night and spoiled the debut of new Bulls coach Jim Boylen.\n\n\"It was a pretty murky, muddy kind of game,\" Turner said. \"It wasn't a pretty win, but wins are hard to come by in this league and we got it done.\"\n\nDarren Collison had 23 points and eight rebounds, Bojan Bogdanovic scored 14 points and Tyreke Evans finished with 10 for Indiana.\n\nLauri Markkanen led the Bulls with 21 points and 10 rebounds. Justin Holiday, facing off against his brother, Indiana rookie Aaron Holiday, finished with 15 points. Chicago has lost seven straight games.\n\nWith the absence of Oladipo hard to ignore, the Pacers relied heavily on their five starters to carry the load. Four of Indiana's five starters scored in double figures, combining for 71 of the Pacers' 96 points.\n\n\"The fact that we're able to hold down the fort without (Oladipo) is big,\" Turner said. \"We have a lot of guys who can go out there and make plays. There's a lot of depth on this team and it's good to not have to rely on one person.\"\n\nOne of Indiana's biggest contributions came from Domantis Sabonis off the bench, and could very well have been the difference, with Pacers' starters working overtime to fill the void left by Oladipo's nagging injury. Sabonis added nine points and 11 rebounds off the bench.\n\nThe teams got off to a sluggish start. Indiana held the slight advantage early, jumping ahead by as many as nine points during the first half. But the Pacers trailed the Bulls 45-43 at halftime despite the early lead and Chicago shooting just 40 percent from the floor over the first two quarters.\n\nThe Pacers closed out the third quarter on a 9-4 run for a 70-67 lead. Chicago never recovered from the deficit, although the Bulls stayed within single digits during the final 12 minutes. The Bulls weren't able to get any closer than three points during the final 1:45.\n\nWhile Indiana faces life without its star player, the Bulls embarked on their first game with a new face at the helm.\n\nBoylen was named Bulls coach on Monday, taking over for the fired Fred Hoiberg, who was let go following a 5-19 start this season. Hoiberg had a 115-155 mark with one playoff appearance in three-plus seasons.\n\n\"I really like this team. I really like these guys,\" Boylen said. \"I thought we battled. I'm proud of this group.\"\n\nTURNING IT UP: Myles Turner has recorded a double-double in consecutive games and in three of his last four. Turner has recorded 11 blocked shots in two games against the Bulls this season.\n\nTIP INS\n\nBulls: New Bulls coach Jim Boylen spent two seasons as an assistant with the Pacers from 2011-13. ... Chicago is 2-11 in its last 13 games. ... The Bulls are 1-6 against Central Division foes.\n\nPacers: Victor Oladipo remains inactive for Indiana while nursing a sore right knee. The Pacers' All-Star missed his eighth straight game. The Pacers are 4-4 during that stretch. ... Indiana is now 5-1 at home against Eastern Conference foes. ... The Pacers were allowing a league-low 102.7 points per game entering Tuesday night's contest.\n\nUP NEXT\n\nBulls: Host the Oklahoma City Thunder on Friday.\n\nPacers: At Orlando to face the Magic on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994835.029112
}