{
  "game_id": "0021500845",
  "espn_id": "400828732",
  "date": "Feb 24, 2016",
  "matchup": "CHA @ CLE",
  "headline": "James, Irving lead Cavaliers past Hornets, 114-103",
  "body": "CLEVELAND -- The Charlotte Hornets picked the wrong time for a trip to Cleveland.\nLeBron James and Kyrie Irving scored 23 points each and the Cavaliers rebounded from one of their worst games of the season with a 114-103 win Wednesday night.\nThe Cavaliers lost Monday to Detroit while James tied a season low with 12 points in a head-scratching performance for the best team in the Eastern Conference.\nCleveland used a 40-point second quarter to take control and dominated the second half, pushing the lead to 24 points in the fourth quarter.\nHornets coach Steve Clifford expected the Cavaliers to be at their best.\n\n\"We knew they would give us everything they had because they didn't live up to their standards in their last game here,\" he said. \"We couldn't guard them. They were very good.\"\nJames shot 5 of 18 from the field, missed all four of his 3-pointers and had six turnovers Monday. He put that performance in the past quickly, hitting 8 of 13 shots with seven rebounds and seven assists in 31 minutes while sitting out the fourth quarter.\nIrving, bitten by bed bugs in his hotel room Saturday night in Oklahoma City, was limited to 9 minutes Sunday against the Thunder. Against the Hornets, he scored 30 points on 10-for-17 shooting with five assists.\n\"For the most part the one day of rest really helped us,\" James said. \"Kyrie made some big shots when they tried to make a run and we just went off that.\"\nKemba Walker added 20 points for Charlotte, which had won four straight on the road and five straight overall.\nChanning Frye, acquired in a trade last week, hit four 3-pointers and finished with 15 points while J.R. Smith scored 16.\nCleveland picked up Frye for his ability to stretch the floor and add another outside shooter.\n\"I told him to shoot every time I throw it to him,\" James said. \"I won't throw it to him unless I know he has the shot. He adds another dynamic piece to our team we hadn't had up to this point.\"\nFrye knows his orders are simple.\n\"When they start yelling at you to shoot the ball then you just have to shoot,\" he said. \"Some of them went in and we took advantage of that opportunity.\"\nFrank Kaminsky scored 16 points while Al Jefferson added 12 for the Hornets, who fell to eighth place in the East.\nThe Hornets beat the Cavaliers 106-97 earlier this month in Charlotte even though Walker and Jefferson were out with injuries. Michael Kidd-Gilchrist played in that game but had season-ending shoulder surgery last week.\nDIFFERENT GOALS\nClifford knows the two teams are in different positions as March approaches.\n\"If you're the Cavaliers, your goal coming into the season was to be the No. 1 seed because they have the best roster,\" he said. \"For us, we wanted to make the playoffs. Our goals are A, to qualify for the playoffs; and B, be playing at a level to be a factor in the playoffs. There will be 2/3 teams in the conference that take off and play a lot better from here on out. We want to be one of them.\"\nNEW ONE ON HIM\nJames' reaction to Irving's bed-bug incident: \"I don't know that I've ever heard it before. Not from a teammate of mine. I think I've heard it before happening, not from a teammate of mine.\"\nTIP INS\nHornets: Jefferson played his third game after missing the previous 23 following knee surgery. ... Spencer Hawes (sore lower back) missed his third consecutive game. ... Charlotte fell to 6-2 in February.\nCavaliers: James moved into third place in team history in rebounds (4,676). ... Mo Williams was diagnosed with swelling in his left knee in a visit to Dr. James Andrews on Tuesday and played 4 minutes. ... Iman Shumpert (sprained left shoulder) missed his third straight game, but might return to practice Thursday.\nUP NEXT\nHornets: At Indiana on Friday.\nCavaliers: At Toronto on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994368.145888
}