{
  "game_id": "401810039",
  "espn_id": "401810039",
  "date": "Nov 08, 2025",
  "matchup": "PHI vs TOR",
  "headline": "Maxey, Embiid lead Philadelphia 76ers to 130-120 win over Toronto Raptors",
  "body": "PHILADELPHIA -- — Tyrese Maxey scored 31 points, Joel Embiid added 29 and the Philadelphia 76ers beat the Toronto Raptors 130-120 on Saturday night.\n\n\r\n              Trendon Watford had 20 points, 17 rebounds and 10 assists for Philadelphia, which lost all four games to Toronto last season.\n\n\r\n              RJ Barrett and Immanuel Quickley each scored 22 points for the Raptors, who had won four in a row. Toronto was playing the second contest of a back-to-back after beating Atlanta 109-97 on Friday night. Brandon Ingram chipped in 21 for the Raptors.\n\n\r\n              Philadelphia took control by outscoring the Raptors 35-20 in the second quarter after Toronto had surged to a 43-33 first-quarter lead. \n\n\r\n              Toronto got within 119-116 on Barrett’s 3-pointer with 3:25 to play. But the 76ers scored the next six points, on VJ Edgecombe's layup, Kelly Oubre Jr.'s dunk and Embiid's follow on his own miss, to take a nine-point lead with 1:25 left.\n\n\r\n              Philadelphia honored the 25-year anniversary of the 2000–01 Eastern Conference champion 76ers for the first of several times this season. The club wore replica black jerseys from that era, and the court featured the colors and logo from that season in which Allen Iverson won the MVP, Larry Brown was named Coach of the Year, Dikembe Mutombo was tabbed as Defensive Player of the Year and Aaron McKie picked as Sixth Man of the Year.\n\n\r\n              After defeating the Lakers in Game 1 of the NBA Finals, Los Angeles, led by Shaquille O’Neal and Kobe Bryant, won the next four games in the series to clinch their second of three consecutive titles.\n\n\r\n              Eric Snow, who teamed with Iverson in the backcourt, was seated courtside. And the 76ers even brought back their dunking, rabbit mascot, Hip Hop, for the occasion. \n\n\r\n              Up Next\n\n\r\n              Raptors: At Brooklyn on Tuesday night.\n\n\r\n              76ers: Host Detroit on Sunday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042583.9424791
}