{
  "game_id": "401810015",
  "espn_id": "401810015",
  "date": "Nov 03, 2025",
  "matchup": "HOU vs DAL",
  "headline": "Amen Thompson scores a season-high 27 points to lead Rockets to fourth straight win",
  "body": "HOUSTON -- — Amen Thompson scored a season-high 27 points, Alperen Sengun added 26 points and 11 rebounds and the Houston Rockets outlasted the Dallas Mavericks for a 110-102 victory on Monday night.\n\n\r\n              Houston has won four straight after dropping its first two games of the season.\n\n\r\n              The Rockets led by one when Sengun drove into the lane and spun around a defender before sinking a shot to make it 105-102 with about 90 seconds left. P.J. Washington missed a 3-pointer before Josh Okogie scored his first points of the game with two free throws that pushed the lead to 107-102 with a minute to go.\n\n\r\n              D’Angelo Russell missed a 3-pointer and Thompson made 1 of 2 free throws to extend it to 108-102 with 27 seconds remaining. Thompson then blocked a 3-point attempt by No. 1 pick Cooper Flagg and Tari Eason sealed the win with a dunk.\n\n\r\n              Washington had season highs of 29 points and 12 rebounds for the Mavericks in their second straight game without Anthony Davis, who is out with a strained calf. Max Christie added 17 points and Flagg had 12 points and five rebounds as Dallas fell to 2-5.\n\n\r\n              Kevin Durant had 21 points, six rebounds and five assists on a night he shot just 6 of 18 from the floor.\n\n\r\n              The Rockets were clinging to a one-point lead when Durant made his first 3-pointer of the night after missing his first six. Daniel Gafford made a layup on the other end before Durant hit another 3 to make it 99-94 with five minutes to go.\n\n\r\n              The Mavericks scored five straight, capped by a three-point play from Washington to tie it at 99-all with four minutes left.\n\n\r\n              Up next\r\n              Mavericks: Host New Orleans on Wednesday night.\n\n\r\n              Rockets: Begin a three-game road trip on Wednesday night in Memphis.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042554.816392
}