{
  "game_id": "0021600922",
  "espn_id": "400900317",
  "date": "Mar 04, 2017",
  "matchup": "CHI vs. LAC",
  "headline": "Veteran sixth man Crawford leads Clippers over Bulls, 101-91",
  "body": "CHICAGO --  A rhythm shooter on a team out of sync, Jamal Crawford and the Los Angeles Clippers broke out on Saturday night.\n\nThe veteran reserve came alive late, scoring 25 points to carry the visiting Clippers to a 101-91 victory over the Chicago Bulls.\n\n\"We definitely needed a win,\" Crawford said after his 10-of-17 shooting performance. \"Everything is better. The food tastes better, the flight will be better, you know, but it's a total team effort.\"\n\nChris Paul added 17 points and Blake Griffin had 16 for Los Angeles, which lost in Milwaukee on Friday and had fallen to the fifth spot in the Western Conference standings.\n\nCrawford, a former Bulls guard who won his third Sixth Man of the Year award last season, scored 10 points during a 14-7 spurt in the fourth quarter as the Clippers won for just the second time in six games.\n\n\"He went 1-on-1 and you can't do nothing when he is going like that,\" said Chicago's Dwyane Wade, who scored 10 points on 2-of-11 shooting. \"When they have guys making shots like that, we are taking the ball out of the basket. Our offensive rhythm is not the same as it was in the first half when we were able to get stops and go the other way.\"\n\nJimmy Butler scored 16 points for the Bulls, who had won five of their last six games, including wins against Cleveland and Golden State.\n\nChicago led by 10 points five times in the second quarter, but the Clippers took control late in the third. Crawford's long 3-pointer at the buzzer closed an 18-5 Los Angeles run at the end of the period to go up 82-73.\n\nLos Angeles then extended its lead to 96-80 midway through the fourth.\n\nCrawford, who averages 15.3 points per game in his career and will turn 37 in two weeks, was in single digits in five of his previous six games.\n\n\"He's going to always break out,\" Clippers coach Doc Rivers said. \"I always tell him to give yourself a shooter's chance. If you don't shoot it, you have no chance of breaking out of it.\"\n\nTIP-INS\n\nClippers: The Clippers are 6-6 on the second of back-to-back games. In those cases, Los Angeles won its first five, then lost six in a row before Saturday's win. ... The Clippers won their first game in 10 tries after trailing at halftime on the road.\n\nBulls: Bobby Portis scored 11 points and was in double figures for the third straight game. It was the first such streak for him this season. ... The Bulls failed to record a blocked shot for the second time this season. ... The Bulls' 30 second-half points were a season low for any half this season. Their 12 points in the third quarter tied their fewest points in any quarter.\n\nALL-STAR IDEA\n\nAfter Clippers teammate Chris Paul approached commissioner Adam Silver about the subject earlier in the week, veteran Paul Pierce offered his own take to AP on how to make the All-Star Game more competitive.\n\n\"Everybody would like (the game) to be a lot more competitive,\" Pierce said. \"This is something we're really going to have to put some thought into it whether it's an added incentive or something else. It may take some big money.\"\n\nAsked how big, Pierce said, \"A hundred thousand for each (player), a hundred thousand dollars. See, this is the younger generation. I'm more competitive. I would play the same way in an All-Star Game as a playoff game. So I'm saying 100,000 (dollars). I think that would be enough to get guys to play hard for one night.\"\n\nCHICAGO ROYALTY COURTSIDE\n\nBulls legends Horace Grant and Scottie Pippen sat courtside for the nationally televised game. Pippen won six rings for the Bulls, while Grant won three in Chicago and a fourth for the Los Angeles Lakers in 2000-01.\n\nChicago's Chance the Rapper, who won three Grammy Awards last month, also was courtside at the United Center.\n\nUP NEXT\n\nClippers: Monday they host Boston, as Rivers will coach against his former team, which he led to the 2008 NBA title.\n\nBulls: Monday they are at Detroit, which is in contention with them near the bottom of the East playoff standings. The Bulls are in seventh, one game ahead of the eighth-place Pistons.",
  "source": "espn_api",
  "crawled_at": 1764995030.852417
}