{
  "game_id": "401809990",
  "espn_id": "401809990",
  "date": "Oct 29, 2025",
  "matchup": "UTAH vs POR",
  "headline": "Jrue Holiday scores 27 points, hits late free throws to help Blazers hold off Jazz 136-134",
  "body": "SALT LAKE CITY -- — Jrue Holiday had 27 points and eight assists, and he hit four free throws in the final seconds to help the Portland Trail Blazers hold off a late Utah rally and beat the Jazz 136-134 on Wednesday night.\n\n\r\n              Deni Avdija added 19 points and nine rebounds for the Blazers, and Shaedon Sharpe and Jerami Grant finished with 18 points apiece. Portland scored 27 points off 21 Utah turnovers on its way to a second straight road victory. The Blazers improved to 3-1 since coach Chauncey Billups was arrested for what federal authorities described as his involvement in illicit gambling activities and was placed on leave.\n\n\r\n              Lauri Markkanen scored 32 points to lead the Jazz, who lost at home for the first time this season. Keyonte George added 29 points and eight assists. Walker Kessler had 18 points and 12 rebounds.\n\n\r\n              Trailing 122-100 with 10:08 left, Utah used a 16-2 run bookended by 3-pointers from Kessler to cut the deficit to single digits.\n\n\r\n              Four straight baskets by George and Cody Williams, followed by free throws from Markkanen and George, trimmed Portland’s lead to 134-133 with 7.7 seconds remaining.\n\n\r\n              Holiday went 4 of 4 from the free-throw line in the final seconds to prevent Utah from completing the comeback.\n\n\r\n              Portland went 14 of 29 from 3-point range in the first half. Sharpe, Grant and Duop Reath hit three 3s apiece before halftime.\n\n\r\n              Hot perimeter shooting sparked the Blazers’ rally from a double-digit deficit to take a 79-73 halftime lead. Portland scored 46 points in the second quarter after Utah tallied 43 first-quarter points.\n\n\r\n              The Blazers pulled away after halftime, going up 106-86 late in the third quarter following an 11-2 run. Toumani Camara made three baskets and assisted another to help Portland build a double-digit lead.\n\n\r\n              Up Next\r\n              Trail Blazers: Host Denver on Friday.\n\n\r\n              Jazz: At Phoenix on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042526.573005
}