{
  "game_id": "0022400849",
  "espn_id": "401705415",
  "date": "Feb 27, 2025",
  "matchup": "MIN @ LAL",
  "headline": "LeBron James powers the Lakers to 4th straight victory, 111-102 over the Timberwolves",
  "body": "LOS ANGELES -- — LeBron James had 33 points and 17 rebounds and the Los Angeles Lakers won their fourth straight game, holding off the Minnesota Timberwolves 111-102 on Thursday night.\n\n\r\n              Austin Reeves added 23 points and Luka Doncic had 21 points and 13 rebounds to help the Lakers improve to 14-3 since Jan. 21.\n\n\r\n              Terrence Shannon Jr. led Minnesota with a career-high 25 points. The Timberwolves have dropped three of four and five of seven.\n\n\r\n              The Timberwolves were able to rally back despite All-Star guard Anthony Edwards being ejected with 5:27 remaining in the third quarter after picking up his second technical foul.\n\n\r\n              Edwards threw the ball into the stands after being ejected. If both technical fouls are upheld, he will be suspended one game for picking up 16 technicals this season.\n\n\r\n              Edwards, who is fourth in the league in scoring at 27.3 points per game, had 18 points.\n\n\r\n              Minnesota was down 92-77 less than three minutes into the fourth quarter before it made a 13-1 run.\n\n\r\n              Doncic though stifled the Timberwolves' momentum by making an off-balance 3-pointer with 3:37 remaining and while the shot clock was winding down to put the Lakers up 98-91.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota overcame a 25-point, second-half deficit Monday night to defeat Oklahoma City, but could not pull off a miraculous comeback for the second straight game.\n\n\r\n              Lakers: A 3-pointer by James gave the Lakers a 47-24 lead early in the second quarter before the Timberwolves started to slowly come back.\n\n\r\n              Key moment\r\n              Doncic had five assists, including a cross court pass to James early in the first quarter, who finished it off with a layup to give the Lakers a 9-3 advantage.\n\n\r\n              Key stat\r\n              The 17 rebounds by James ties a season high.\n\n\r\n              Up next\r\n              Both teams play Friday night. The Timberwolves are at Utah, and the Lakers host the Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998085.0465448
}