{
  "game_id": "0021500963",
  "espn_id": "400828850",
  "date": "Mar 11, 2016",
  "matchup": "CHA vs. DET",
  "headline": "Williams, Hornets top Pistons 118-103 for 6th straight win",
  "body": "CHARLOTTE, N.C. --  Hornets coach Steve Clifford continues to emphasize to his players it's not just about winning games this time of the year -- it's about continuing to improve as the playoffs approach.\n\nThe Hornets seem to be doing just that.\n\nIn a game that had potential playoff tiebreaker implications down the road, Marvin Williams tied a career high with five 3-pointers and scored 22 points and the Hornets routed the Detroit Pistons 118-103 on Friday night for their sixth straight win.\n\n\"The two games with them, we haven't been able to keep up with them in the half court or the full court or in transition,\" Pistons coach Stan Van Gundy said. \"They play too fast.  We play too slow.  We can't keep up with them.\"\n\nNicolas Batum added 17 points and 11 assists for the Hornets, who have won 12 of their last 14 games. Kemba Walker, who had scored at least 30 points in each of the previous four games, finished with 16 points and eight assists.\n\n\"It was big,\" Williams said. \"We knew it was going to be a big time game for us. We wanted to protect our home court and we came out and did that tonight.\"\n\nWith the win the Hornets (36-28) moved eight games over .500 for the first time since the end of the 2000-01 season. They'd never reached that mark during the Bobcats era.\n\n\"Guys that have been in the playoffs and gone deep in the playoffs and know what it takes right now this is when they amp it up and get better,\" Clifford said. \"They get their group to the next level and that's what we need to do.\"\n\nThe Hornets improved to 5-0 on their current seven-game home stand and 24-9 at \"The Hive\" this season.\n\nKentavious Caldwell-Pope had 24 points and Reggie Jackson had 20 points and 10 rebounds for the Pistons. Detroit remained a half-game ahead of Chicago for the eighth and final playoff spot in the Eastern Conference, as the Bulls also lost on Friday night.\n\nThe Hornets were hot from the start, shooting 54 percent from the field to build a 69-53 lead at halftime.\n\nWilliams had 14 points in the first half, including 3 of 4 from 3-point range as the Pistons were slow getting out to get a hand in the veteran forward's face. Batum had 10 points and seven boards at the break and the Hornets scored 15 points of Detroit turnovers to set the tone.\n\nDetroit would cut the lead to six in the fourth quarter on a 3-pointer by Marcus Morris, but the Hornets' reserves helped the team pull away.\n\nRookie forward Frank Kaminsky hit a fall-away jumper, Jeremy Lin found Courtney Lee with a no-look pass for a fast-break layup and Al Jefferson scored twice in the low post to push the lead 16. Jefferson, who has been working in a reserve role since coming back from an injury, had 12 points.\n\nKaminsky continues to improve with his low-post moves and hit his first four shots from the field and finished with 10 points.\n\nLee, acquired recently in a trade, is steadily improving for the Hornets and had 15 points.\n\nTIP-INS\n\nPistons: Caldwell-Pope knocked down his 300th career 3-pointer. ... Pistons turned the ball over 12 times leading to 25 Hornets points.\n\nHornets: After scoring 71 points in the first half against New Orleans on Wednesday, the Hornets scored 69 against the Pistons before the break. ... Bench outscored the Pistons 38-21.\n\nWHERE'S ANDRE\n\nAndre Drummond only attempted one shot from the field and had five points and was pretty much invisible most of the night.\n\nThat didn't sit well with Van Gundy.\n\n\"He didn't play with any energy at all,\" Van Gundy said. \"He didn't roll on his pick and rolls, he didn't run the floor and he didn't go to the offensive glass other than to push people. He basically didn't do anything.\"\n\nKEMBA SCARE\n\nThere was a scary moment for the Hornets early in the third quarter when Walker drove the lane and caught an arm to the head from Reggie Jackson, who was called for a flagrant foul.\n\nWalker was slow to get up but remained in the game and sank both free throws to put the Hornets up 73-58. Jackson walked over and slapped hands with Walker after the play.\n\nUP NEXT\n\nPacers: At Washington on Saturday night.\n\nHornets: At Philadelphia on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994355.901334
}