{
  "game_id": "0022300411",
  "espn_id": "401585039",
  "date": "Dec 26, 2023",
  "matchup": "MIN @ OKC",
  "headline": "Gilgeous-Alexander scores 34 as Thunder beat Timberwolves 129-106",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 34 points, Jalen Williams added 21 and the Oklahoma City Thunder made 18 shots from 3-point range Tuesday night in a 129-106 win over the Minnesota Timberwolves.\n\n\r\n              Chet Holmgren and Lu Dort each added 20 points for the Thunder (19-9), who went 18 for 39 (46.2%) on 3s and forced 24 Minnesota turnovers that led to 23 points. \n\n\r\n              “I think we played together on both ends of the floor, for the most part,” said Gilgeous-Alexander, who finished 14 of 19 from the field and dished out a team-high nine assists. “When we do that and trust that, things go our way, usually.”\n\n\r\n              Dort was 5 of 6 from beyond the arc. Oklahoma City shot 60.5% from the field and led by as many as 25 in the second half of its sixth victory in eight games. \n\n\r\n              “I thought we really were intelligent with our attacks,” coach Mark Daigneault said. “They’re a really hard team to crack, obviously, and you’ve got to be really intentional, and I thought our guys did a great job executing.\"\n\n\r\n              Anthony Edwards had 25 points to pace Minnesota (22-7). Mike Conley added 17 and Karl-Anthony Towns had 16.\n\n\r\n              Towns missed Minnesota’s 110-98 win over Sacramento on Saturday with soreness in his left knee. He entered Tuesday night averaging 22.2 points and 9.5 rebounds per game.\n\n\r\n              Josh Giddey returned to the starting lineup for the Thunder after missing a game with a left ankle sprain. He had 10 points and seven assists.\n\n\r\n              The Thunder led 86-76 with 6:27 left in the third quarter when Holmgren picked up his fourth foul and went to the bench.\n\n\r\n              Giddey sat with three fouls about two minutes later, but OKC increased its lead to 95-83 on a basket by Gilgeous-Alexander with 2:43 left. Another 3 by Dort — his fifth of the game — following a steal by Cason Wallace made 98-83, the Thunder’s largest lead to that point.\n\n\r\n              But back came Minnesota, which cut it to 100-91 on a 3 by Nickeil Alexander-Walker, who is Gilgeous-Alexander’s cousin. That was as close as the Timberwolves got.\n\n\r\n              \"I just thought we had great intensity,” Daigneault said. “I thought both teams were outscoring each other in the first period of the game. As the game wore on, we tightened on that end of the floor. Really in the second half did a great job, too. And I thought the turnovers were a byproduct of that.” \n\n\r\n              Williams made consecutive 3-pointers early in the fourth to extend the Thunder's lead to 108-91 with 9:51 remaining.\n\n\r\n              Oklahoma City led 66-60 at halftime after the teams combined to make 16 3-pointers, including nine by the Thunder.\n\n\r\n              OKC led by 10 in the second quarter following back-to-back 3s by Dort with 3:30 remaining. Gilgeous-Alexander led Oklahoma City, which shot 57.1% in the first two quarters, with 16 points at the break. Williams added 15 points and Dort had 11.\n\n\r\n              Edwards led the Timberwolves — who shot 53.8% from 3-point range (7 of 13) — with 14 first-half points.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Dallas Mavericks on Thursday.\n\n\r\n              Thunder: Host the New York Knicks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996482.761333
}