{
  "game_id": "0021800630",
  "espn_id": "401071306",
  "date": "Jan 12, 2019",
  "matchup": "DET @ LAC",
  "headline": "Griffin has 44 points in return against Clippers",
  "body": "LOS ANGELES --  Blake Griffin kept his emotions to himself in his return to Staples Center for the first time against his old team.\n\nAfter scoring 44 points in the Detroit Pistons' 109-104 victory over the Los Angeles Clippers on Saturday, he allowed himself a trip down memory lane.\n\n\"The best thing to be a part of is something that is bigger than yourself and that is what that was,\" he said in a crowded hallway outside the Pistons' locker room. \"I don't look at what I did.\"\n\nGriffin was greeted with cheers during pregame introductions and received a standing ovation after a first-quarter video tribute from the team that drafted him first overall in 2009.\n\n\"There was a lot of hype coming into this game and I was looking forward to it, but I'm glad that it's over,\" he said. \"The next time I come it won't be as crazy.\"\n\nGriffin stuck his right arm in the air and then brought his raised hands together in a thankful gesture without smiling. He clearly wanted to beat the team that stunningly traded him last January after he had signed a $171 million, five-year extension.\n\nIt showed from the start.\n\nGriffin scored 15 points in the opening quarter when he got razzed by superfan Clipper Darrell during free throw attempts. He had 26 points in the first half to help Detroit to a 65-54 lead.\n\n\"Hey Blake, we miss you but enough for tonight, OK?\" a Clippers fan implored.\n\nGriffin wasn't done.\n\nHis 3-pointer to start the third and a basket by Andre Drummond pushed Detroit to a 16-point lead. Griffin had a one-hand slam reminiscent of his old Lob City days.\n\n\"He played great,\" Clippers coach Doc Rivers said.\n\nGriffin left the court near the end of the third because of back spasms and returned briefly wearing a hot wrap.\n\nThe Clippers tied it at 97 on a 3-pointer by Lou Williams after outscoring the Pistons 17-7 to open the fourth.\n\nReggie Bullock had two 3-pointers around Drummond's dunk and Griffin's hook for a 107-99 lead.\n\n\"We're really happy to get the win for Blake,\" Bullock said.\n\nThe Clippers got within three and Griffin missed two 3-pointers in the closing seconds.\n\nHe stepped out of bounds in the corner of the baseline while trying to save a pass and fell backward, crashing into fans and the floor.\n\nBruce Brown stole the ball with 20 seconds left, got fouled by Danilo Gallinari and made both to keep Detroit ahead 109-104. Gallinari's jumper missed in the waning seconds.\n\n\"Down the stretch we played great defense, got stops and protected the ball and that was the difference,\" Griffin said. \"The Clippers are a tough team. They had three guys who come off the bench on the floor at the end of the game. It was a well-balanced and great win for us.\"\n\nDrummond had 20 points and 21 rebounds for the Pistons, who had lost nine of 11. Bullock finished with 17.\n\nGallinari led the Clippers with 23 points. Williams added 22 points, and Harrell had 21 points and nine rebounds.\n\nGriffin averaged 21.6 points, 9.3 rebounds and 4.2 assists in eight seasons for the Clippers. He was the Rookie of the Year and a five-time All-Star with the franchise.\n\nRivers said he and Griffin haven't spoken since the trade.\n\n\"That's a love lost there those two got to work out,\" Harrell said.\n\nHowever, Rivers credited Griffin for the franchise's resurgence.\n\n\"Blake got this started,\" Rivers said before the game. \"Six playoffs in a row. It doesn't equate to being the winner because we didn't do that but it equates to winning. Blake was part of that. Now when you hear our name you don't think of those bad Clippers before Blake.\"\n\nTIP-INS\n\nPistons: Taylor Griffin was on babysitting duty, bringing his younger brother's son, Ford, to the locker room after the game. ... Drummond had his NBA-leading ninth game of at least 20 points and 20 rebounds. ... Griffin played at Staples on Wednesday night when the Pistons lost to the Lakers 113-100. ... C Zaza Pachulia (right lower leg contusion) missed his seventh straight game. ... G Ish Smith (right adductor tear) sat out his 19th straight game.\n\nClippers: They lost their first game against Griffin's Pistons in Detroit within days of last year's trade. Griffin had 19 points in that game.\n\nNO LOVE LOST\n\nClippers owner Steve Ballmer waited on the sideline for Griffin to finish his early warmups.\n\nGriffin began walking off court as Ballmer stuck out his right hand to shake. Griffin took off running into the tunnel. Ballmer threw up his hands and walked away.\n\n\"As soon as I'm done doing my pregame shooting I make sure there's a path and I take off running to the locker room and I don't stop running,\" Griffin said afterward. \"I don't change that for anybody.\"\n\nAsked if he would have shaken hands with Ballmer, Griffin said, \"I'm not here to answer hypothetical questions.\"\n\nHE SAID IT\n\n\"The West is tough every night and when you lose to an East Coast team it hurts even more.\" -- Rivers.\n\nUP NEXT\n\nPistons: At Utah on Monday night in the finale of four-game Western swing.\n\nClippers: Host New Orleans on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994693.117738
}