{
  "game_id": "0022000912",
  "espn_id": "401307713",
  "date": "Apr 25, 2021",
  "matchup": "BKN vs. PHX",
  "headline": "Durant scores 33 points in return, Nets beat Suns 128-119",
  "body": "NEW YORK -- — Long a superstar, Kevin Durant is turning into a super sub.\n\n\r\n                    Durant came off the bench to score 33 points in his latest return from injury, and the Brooklyn Nets beat the Phoenix Suns 128-119 on Sunday in a matchup of two of the NBA's top teams.\n\n\r\n                    Durant missed three games after bruising his left thigh early in a loss to Miami last Sunday. He played 28 minutes and shot 12 for 21. \n\n\r\n                    “It was a good start. Hopefully, I’ll build on this game and keep going,” Durant said.\n\n\r\n                    Kyrie Irving scored 34 points and Blake Griffin had 15 to help the Eastern Conference leaders improve to 25-7 at home and 20-6 against West teams.\n\n\r\n                    Devin Booker scored 36 points and Deandre Ayton had 20 points and 13 rebounds for the Suns, the No. 2 team in the West who have lost consecutive games for the first time since a three-game skid in January. \n\n\r\n                    “I thought we started off pretty well, they just continued to make shots,” Booker said. “I think we had a lot of miscommunications on a lot of our switches and that’s that.”\n\n\r\n                    Phoenix led for much of the first half but Brooklyn pulled away after halftime, when Durant played his normal minutes after not coming into the game until the second quarter so the Nets could keep his minutes down and he could play down the stretch if it was close. \n\n\r\n                    The Nets used the same strategy when Durant returned from a lengthy layoff with a hamstring injury on April 7 against New Orleans, scoring 17 points in 19 minutes. He has played just 25 games this season and had never come off the bench in an NBA game until this year.\n\n\r\n                    “The thing I love the most is that we all know, one of my favorite things about him is how much he just loves to play basketball,” Griffin said. “So you know when he’s sitting out it’s just like killing him, so just to see that joy of just being able to play basketball again is fun for us.” \n\n\r\n                    The Nets were 2-2 while playing almost entirely without Durant in their previous four, but things change when the four-time scoring champion is on the floor.\n\n\r\n                    “How you guard away from him is different than how you would have guarded before on another guy who couldn’t shoot from 40 feet from the basket, is 7-foot-1 and dribbles like a guard,” Phoenix coach Monty Williams said before the game. \n\n\r\n                    Durant scored 10 points in the third quarter, then had the first five of the fourth to give Brooklyn its first double-digit lead at 102-92.\n\n\r\n                    With Ayton getting 10 points and 10 rebounds in his first 14 minutes, the Suns led by 13 in the second quarter and 61-59 at halftime. \n\n\r\n                    Irving was just 4 for 19 Friday against Boston, but made his first four shots Sunday and never really cooled off. He had 24 points on just seven field goal attempts in the first half, tying his highest-scoring half of the season, and added 12 assists.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Jae Crowder missed his second straight game with a sprained right ankle. Dario Saric sat to rest his left ankle. ... Frank Kaminsky played for the first time on the road trip and had five points. \n\n\r\n                    Nets: Tyler Johnson scored eight points after the former Suns guard missed 10 games with right knee soreness. ... The Nets swept the season series, having coming from 24 down to win at Phoenix without Durant and Irving on Feb. 16.\n\n\r\n                    ROUGH ROAD\n\n\r\n                    The Suns are 2-2 on a five-game trip that started with wins at Milwaukee and Philadelphia, the Nos. 3 and 2 teams in the East, before a loss at Boston. It ends Monday at New York, which has won nine straight. \n\n\r\n                    “Like, these last three games have been playoff games for us in atmosphere, so I think they’re great,” Williams said. “Your armpits and underwear may tell you a different story at the end of the game, but as far as growth is concerned it’s pretty good for our team and our young guys.”\n\n\r\n                    RISING SUNS\n\n\r\n                    Phoenix hasn't made the playoffs since 2010, when Nets coach Steve Nash was still playing there. The two-time MVP is happy for his old team's success.\n\n\r\n                    “They’re clearly one of the best teams in the league and have just had an incredible season start to finish,” Nash said. “So really admire what everyone over there has done, but I’m just happy to see the Suns back in prominence and fighting for a contending position in the playoffs.”\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: At New York on Monday night.\n\n\r\n                    Nets: Play Toronto in Tampa, Florida, on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764997474.805803
}