{
  "game_id": "0022300986",
  "espn_id": "401585614",
  "date": "Mar 18, 2024",
  "matchup": "CHI vs. POR",
  "headline": "DeRozan scores 28 points as the Bulls edge the Trail Blazers 110-107",
  "body": "CHICAGO -- — DeMar DeRozan scored 28 points and found Nikola Vucevic for a key hook shot with 9.3 seconds left, helping the Chicago Bulls edge the Portland Trail Blazers 110-107 on Monday night.\n\n\r\n              “It’s sometimes more than just making a shot,” teammate Alex Caruso said of DeRozan’s performance in a game-high 40 minutes. “It’s boxing out against their guys that are crashing hard. It’s finding Vooch on the mismatch down low to hit the layup to keep us up three. He’s just a winner at heart.”\n\n\r\n              Vucevic had 22 points and nine rebounds in Chicago’s third win in four games. Ayo Dosunmu finished with 23 points and 10 assists.\n\n\r\n              Anfernee Simons scored 12 of his 30 points in the fourth quarter for Portland, but couldn’t get off a 3-point attempt from the top of the key before time expired. Deandre Ayton had 25 points and 15 rebounds in his sixth consecutive game with at least 20 points.\n\n\r\n              The Blazers lost for the seventh time in nine games.\n\n\r\n              “Maybe half a second,” Simons said of how close he was to getting the final shot off. “We had a couple good opportunities and they just didn’t fall.”\n\n\r\n              The Bulls’ NBA-leading 24th clutch victory — a game that is within five points with under five minutes left — moved them within a game of .500 at 34-35. But they were outscored 32-21 in the final quarter.\n\n\r\n              “We got lackadaisical, we got careless with the ball and started to be not so aggressive,” DeRozan said. “We let them get downhill, fouled them, let them get layups. We let go of the rope a little bit.”\n\n\r\n              Each team played without its second-leading scorer. Bulls guard Coby White missed his third straight game with a right hip strain, and Portland’s Jerami Grant sat out for the fourth straight contest with a right hamstring strain.\n\n\r\n              Dosunmu was 9 for 17 from the field while running the offense in White’s absence. He scored a career-high 34 points during Saturday night’s 127-98 victory over Washington.\n\n\r\n              With 3:32 left in the fourth, Simons drilled a contested 3-pointer from the left wing to put Portland up 105-104 for their first lead since the first quarter. But Simons’ potential go-ahead attempt from long distance rimmed out with 34 seconds remaining.\n\n\r\n              Vucevic’s turnaround hook shot made it 108-105 with 9.3 seconds left, and Caruso fouled Simons intentionally to put him on the free-throw line rather than allow him a chance at a tying 3 on the next possession.\n\n\r\n              “A really heads-up play,” Bulls coach Billy Donovan said. “We talked about fouling up three.”\n\n\r\n              Portland entered Monday averaging the third-most turnovers in the NBA, and its miscues weighed heavily once more. The Bulls scored 19 points off 13 Blazers turnovers, including a driving Vucevic dunk on a fast break opened by a Torrey Craig steal that put Chicago up 82-66 with 3:15 left in the third.\n\n\r\n              “It just was a tough passing night for us,” Trail Blazers coach Chauncey Billups said. “End of the game I don’t think we executed very well down the stretch when it really counted.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Return to Portland on Wednesday for the first of two straight home games against the Clippers.\n\n\r\n              Bulls: Visit the Rockets in Houston on Thursday.\n\n\r\n              ------\n\n\r\n              NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995866.2025468
}