{
  "game_id": "0022300195",
  "espn_id": "401584823",
  "date": "Nov 15, 2023",
  "matchup": "TOR vs. MIL",
  "headline": "Lillard scores 37, Bucks overcome Antetokounmpo's absence to beat Raptors 128-112",
  "body": "TORONTO -- — Damian Lillard had 37 points and a season-high 13 assists, Malik Beasley scored a season-high 30 points and the Milwaukee Bucks overcame Giannis Antetokounmpo’s absence to beat the Toronto Raptors 128-112 on Wednesday night.\n\n\r\n              “The situation was right for it,” Lillard said of his big night. “With Giannis not playing I knew I would have more responsibility, I knew I would have to be more aggressive and kind of assert myself from a playmaking and scoring standpoint.”\n\n\r\n              Antetokounmpo missed his first game of the season after playing the first 10, sitting out because of a strained right calf. He played 35 minutes in Monday’s win over Chicago, finishing with 35 points and 11 rebounds. The 7-footer is averaging 29.5 points, 9.6 rebounds and 3.6 assists.\n\n\r\n              Bobby Portis scored 18 points for Milwaukee and Cameron Payne had 13.\n\n\r\n              Lillard shot 9 for 18 and made 15 of 16 at the free throw line. \n\n\r\n              “That’s the Dame we all know,” Milwaukee’s Brook Lopez said. “It was great to see him in a good rhythm, comfortable out there and leading the team.”\n\n\r\n              The Bucks finished 20 for 39 from long range, matching a season-high for made 3-pointers. Lillard made 4 of 10 while Beasley shot 8 for 11 from deep.\n\n\r\n              “He made a lot of timely shots,” Bucks coach Adrian Griffin said of Beasley. “That’s what he’s here for. He’s an unbelievable shooter.”\n\n\r\n              Milwaukee avenged a loss at Toronto and won for the second time since Lillard returned after missing two games because of a sore right calf.\n\n\r\n              “He took control of the game early,” Griffin said of Lillard. “He’s a master at picking his spots and navigating through screens.”\n\n\r\n              Bucks guard MarJon Beauchamp scored four points in 10 minutes before leaving because of a sprained right ankle.\n\n\r\n              Scottie Barnes scored 29 points for Toronto. Jakob Poeltl had 13 points and 11 rebounds.\n\n\r\n              The Raptors fell behind by 20-plus points for the second straight game. Toronto rallied from a 71-48 deficit to beat Washington 111-107 on Monday but didn’t have enough to recover against the Bucks.\n\n\r\n              “The guys starting the game, they’ve got to bring it more,” Raptors coach Darko Rajakovic said.\n\n\r\n              Beasley connected from long range to put Milwaukee up 93-60 with 5:05 left in the third quarter, Toronto’s biggest deficit of the season.\n\n\r\n              Raptors forward O.G. Anunoby missed his second straight game because of a cut finger on his right hand while guard Gary Trent Jr. (plantar fasciitis, right foot) sat for a third straight. \n\n\r\n              With Anunoby out, rookie Gradey Dick made his first start for Toronto. Dick, who turns 20 on November 20, became the third teenager to start a game for the Raptors. Tracy McGrady and Chris Bosh were the others.\n\n\r\n              Toronto led 8-2 early but the Bucks replied with a 17-0 run and never trailed again. Milwaukee led 36-21 after one quarter and 70-47 at the half.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Milwaukee visits the Charlotte Hornets on Friday in an In-Season Tournament game.\n\n\r\n              Raptors: Toronto begins tournament play by hosting the Boston Celtics on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995459.283177
}