{
  "game_id": "0022400846",
  "espn_id": "401705412",
  "date": "Feb 27, 2025",
  "matchup": "MIL vs. DEN",
  "headline": "Antetokounmpo has 28 points as Bucks overcome Jokic's triple-double to beat Nuggets 121-112",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 28 points, pulled down a season-high 19 rebounds and dished out seven assists as the Milwaukee Bucks beat the Denver Nuggets 121-112 on Thursday night.\n\n\r\n              The two-time MVP helped Milwaukee offset another brilliant performance from Nikola Jokic, who shot 13 of 16 and had 32 points, 14 rebounds and 10 assists. Jokichas 27 triple-doubles in the 53 games the three-time MVP has played this season.\n\n\r\n              This was the first matchup of the season between these two multiple-MVP winners. The Bucks play at Denver on March 26.\n\n\r\n              Brook Lopez added 22 points, Damian Lillard 19, Kyle Kuzma 16 and Gary Trent Jr. 15 for the Bucks, who have won five of their last six. \n\n\r\n              Jamal Murray scored 20 points for the Nuggets.\n\n\r\n              Takeaways\r\n              Nuggets: Denver has followed a nine-game winning streak by dropping two of three. After trailing by 12 with four minutes left, the Nuggets got the margin down to five with two minutes remaining but couldn't get any closer.\n\n\r\n              Bucks: Milwaukee is continuing to monitor the workload of Antetokounmpo, who missed six straight games just before the All-Star break while dealing with a strained left calf. The Bucks won this one anyway in part because they outscored Denver in the first five minutes of the fourth quarter while Antetokounmpo was on the bench. A.J. Green made a couple of big 3-pointers during that stretch.\n\n\r\n              Key moment\r\n              Antetokounmpo made just his eighth 3-point basket of the season to give Milwaukee a 67-66 lead with just over seven minutes left in the third quarter. He got a dunk off Taurean's Prince steal 35 seconds later to cap a 12-4 run that put the Bucks ahead for good.\n\n\r\n              Key stat\r\n              The Bucks capitalized on a big disparity at the foul line. Milwaukee was 23 of 28 and Denver 9 of 11.\n\n\r\n              Up next\r\n              The Nuggets play at Detroit on Friday. The Bucks visit Dallas on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997829.6946409
}