{
  "game_id": "0022400711",
  "espn_id": "401705277",
  "date": "Feb 04, 2025",
  "matchup": "HOU @ BKN",
  "headline": "Late 3s by Johnson and Russell give the Nets a 99-97 win over the Rockets",
  "body": "NEW YORK -- — Keon Johnson and D'Angelo Russell made 3-pointers in the final 10 seconds, and the Brooklyn Nets stunned the Houston Rockets 99-97 on Tuesday night for their first home victory in two months.\n\n\r\n              Brooklyn trailed 97-93 when Tosan Evbuomwan inbounded the ball to Johnson, who made a 3 from the wing with 8.1 seconds left. Houston's Amen Thompson then threw an inbounds pass that skipped past Dillon Brooks, and Evbuomwan tipped it to Russell, who buried a 3 to put the Nets ahead with 3.4 seconds remaining.\n\n\r\n              Jalen Green missed a deep 3 at the buzzer for the Rockets as Brooklyn (17-33) ended its 11-game skid at Barclays Center.\n\n\r\n              Johnson scored 22 points, and Evbuomwan and Nic Claxton each scored 14. Russell had 10 points on 3-of-15 shooting.\n\n\r\n              Alperen Sengun had 24 points and 20 rebounds while Reed Sheppard and Brooks each finished with 16 for the Rockets (32-18), who have lost four straight — two to Brooklyn — since a four-game winning streak that included two wins over Cleveland and one against Boston.\n\n\r\n              Takeaways\r\n              Rockets: Thompson was named the Western Conference Player of the Month for January. Thompson, who on Tuesday was selected to the NBA Rising Stars Challenge, averaged 1.4 blocks and 2.2 steals over 12 games last month, the only player to average at least two steals and one block during that time.\n\n\r\n              Nets: Brooklyn swept the season series from the Rockets for the first time since 2022-23.\n\n\r\n              Key moment\r\n              The Nets were down by nine points midway through the third quarter and responded with a 14-0 run in which Claxton and Tyrese Martin did all the scoring.\n\n\r\n              Key stat\r\n              \r\n              Brooklyn’s last victory at Barclays Center was on Dec. 4 against Indiana.\n\n\r\n              Up next\r\n              Brooklyn continues its six-game homestand Wednesday against Washington. Houston visits Minnesota on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997370.7228942
}