{
  "game_id": "0022300684",
  "espn_id": "401585312",
  "date": "Feb 01, 2024",
  "matchup": "LAL @ BOS",
  "headline": "Austin Reaves hits 7 3-pointers, Lakers stun Celtics 114-105 without LeBron James, Anthony Davis",
  "body": "BOSTON -- — LeBron James has been pleading for weeks for the Lakers' supporting cast to provide him and fellow All-Star Anthony Davis some help as they fight to keep pace in a tight Western Conference playoff race. \n\n\r\n              With the two franchise cornerstones watching from the bench, they finally got their wish. \n\n\r\n              Austin Reaves scored a season-high 32 points and hit a career-high seven 3-pointers to help a Los Angeles team missing its biggest stars stun the Boston Celtics 114-105 on Thursday night.\n\n\r\n              “We're all talented players. And this was an opportunity to show the world what you can do,” Reaves said. “Before the game we come to together and was like, 'Look, the least we can do is we can do is go out there and play as hard as we can and live with the results.”\n\n\r\n              The result was perhaps the Lakers' best victory of the season.\n\n\r\n              The anticipated nationally televised meeting between the longtime rivals was tempered when James was ruled out because of a left ankle injury and Davis by an Achilles tendon issue and left hip spasms. \n\n\r\n              That sentiment that the game would be a mismatch didn't affect the remainder of the Lakers' young roster. \n\n\r\n              Reaves was 7 of 10 from beyond the arc. He also was fouled on one of the misses and made all three free throws. The Lakers hit 19 of 36 3-pointers, holding off the NBA-leading Celtics to end a two-game losing streak.\n\n\r\n              D’Angelo Russell added 16 points, 14 assists and eight rebounds for the Lakers. Jaxson Hayes had 16 points and 10 rebounds.\n\n\r\n              Jayson Tatum scored 23 points for the Celtics, who had 15 turnovers. Boston has lost three of its last five at home since starting the season 20-0 in TD Garden.\n\n\r\n              “It just happens. Stretches of bad basketball happen,” Celtics coach Joe Mazzulla said. “We can't sit here and act like we're too entitled for it to happen to us. It happens. And it's a matter of how we respond to it and how we work through it.”\n\n\r\n              Boston never got closer than seven points in the fourth quarter. \n\n\r\n              Lakers big man Jarred Vanderbilt had 10 points, seven rebounds and three steals in 16 minutes. But he limped off the floor in the final minute of the first half as he tried to turn up court following a strip of Tatum. He sat out the rest of the game with what the team said was right foot soreness. \n\n\r\n              The Celtics came alive with a 12-2 run in the third quarter that included four straight 3s to cut it to 77-71. Tatum brought the crowd to its feet during the surge after he dove onto the floor to tie up Rui Hachimura to force a jump ball. \n\n\r\n              Thursday marked the first time this season both James and Davis have sat out the same game for Los Angeles, The Lakers began the day in ninth place in the West standings.\n\n\r\n              Ham said before the game that the injuries are things both players have dealt with throughout the season. It is unclear how long either will be sidelined. James has played 44 of of 49 games this season. Davis has appeared in 46 games.\n\n\r\n              Reaves said there’s no secret what they need to do when James and Davis return.\n\n\r\n              “If you remember Bron's quote the other night — ‘Go out and do your job.’ And I feel like that's just what we did tonight,” Reaves said. “It wasn't nothing special. It wasn't like we was out there running a million set plays. We went out there and competed our (butts) off. We gave it 110% on the defensive end. We competed. We didn't foul much. Just bringing those two back, we need to continue to do the same thing.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At New York on Saturday night.\n\n\r\n              Celtics: Host Memphis on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995507.024561
}