{
  "game_id": "0022400163",
  "espn_id": "401704729",
  "date": "Nov 04, 2024",
  "matchup": "ORL @ OKC",
  "headline": "Williams, Gilgeous-Alexander help Thunder top Magic and improve to 7-0",
  "body": "OKLAHOMA CITY -- — Jalen Williams scored 23 points, Shai Gilgeous-Alexander added 21 points and nine assists and the Oklahoma City Thunder defeated the Orlando Magic 102-86 on Monday night to remain the only unbeaten team in the Western Conference.\n\n\r\n              Chet Holmgren added 14 points, nine rebounds and two blocks for the Thunder. Oklahoma City has won all seven of its games by at least 12 points.\n\n\r\n              Franz Wagner scored 22 points, Jalen Suggs had 19 points, six assists and and six rebounds and Goga Bitadze added 11 points and nine rebounds for the Magic. Orlando (3-5) played without injured starters Paolo Banchero and Wendell Carter Jr. \n\n\r\n              Orlando newcomer Kentavious Caldwell-Pope was held to six points on 1-for-7 shooting while Anthony Black made 1 of 8 field goals and scored three points.\n\n\r\n              Takeaways\r\n              Magic: Orlando struggled to score, connecting on just 29 of 82 shots (35.4%). The Magic had 43 points at halftime and 58 at the end of the third quarter. \n\n\r\n              Thunder: Oklahoma City had five players score in double figures, including Isaiah Joe with 13 points and Aaron Wiggins with 11. The Thunder shot 45.9% from the field. Gilgeous-Alexander set a career high with seven assists in the first quarter.\n\n\r\n              Key moment\r\n              The Thunder led 73-57 with 3:33 left in the third quarter when Joe caught fire and knocked down 3-pointers on three straight possessions to extend the lead to 24 points. The Thunder were up 82-58 after the third one.\n\n\r\n              Key stat\r\n              The Thunder made 12 of 31 3-pointers while the Magic made 1 of 17 in the first half and 5 of 34 for the game.\n\n\r\n              Up next\r\n              The Magic visit Indiana on Wednesday, and the Thunder visit Denver on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997583.4538271
}