{
  "game_id": "0022300095",
  "espn_id": "401584723",
  "date": "Oct 29, 2023",
  "matchup": "DEN @ OKC",
  "headline": "Jokic's 28 points lead Nuggets past Thunder 128-95 in Holmgren's 1st regular-season home game",
  "body": "OKLAHOMA CITY -- — The Oklahoma City Thunder are a young, talented team on the rise. The defending NBA champion Denver Nuggets showed them just how much work they have ahead to reach that elite level.\n\n\r\n              Nikola Jokic had 28 points and 14 rebounds to help the Nuggets roll past the Thunder 128-95 on Sunday for their third straight win to open the season.\n\n\r\n              “They’re defending champs, and they’re not that by fluke,” Thunder star Shai Gilgeous-Alexander said. “They play the right way on both ends of the floor and they are a really good basketball team. They came to play tonight. We weren’t good enough to compete against them.”\n\n\r\n              Michael Porter Jr. had 20 points and nine rebounds and Jamal Murray added 19 points and eight assists for the Nuggets, who shot 60.2% from the field.\n\n\r\n              Denver coach Michael Malone liked the energy the Nuggets brought.\n\n\r\n              “Winning a championship, the one thing you worry about is thinking we can just show up this year and we’re going to win,” he said. “And that’s not the case. This is a brand new season. What we did last year, although magical in nature, has nothing to do with this season. And I think our players, the way they’re playing — it’s very early — but after three games, our guys are playing with the requisite mindset that you need to if you’re going to be a team that can try to win another championship.”\n\n\r\n              Oklahoma City’s Chet Holmgren was the No. 2 pick in the 2022 draft, but he missed last season with a foot injury. He got a loud cheer when he was introduced with the starters in his first regular-season home game and delivered a team-leading 19 points.\n\n\r\n              Gilgeous-Alexander, a first-team All-NBA selection last season, scored just seven points on 2-for-16 shooting. Denver's Kentavious Caldwell-Pope was assigned to guard him.\n\n\r\n              “You’ve got to credit guys like Kentavious Caldwell-Pope, who I think is an all-NBA defender,\" Malone said. \"You know, we asked him to guard the best players 82 regular season games and 20 playoff games last year and he’s totally committed to that. He understands that that’s his greatest gift to this basketball team.”\n\n\r\n              The Nuggets held the Thunder to 41.1% shooting overall.\n\n\r\n              “We know that we have to be a team that can travel, beat the best teams in the NBA on the road,” Malone said. “And to do that, you have to bring the defense. And I felt our defense tonight was outstanding across the board.”\n\n\r\n              Oklahoma City opened the season with road wins over Chicago and Cleveland and could have made an early statement with a win over Denver.\n\n\r\n              Jokic made sure that didn't happen. The two-time MVP and 2023 Finals MVP dominated the first half. He had 22 points, including a layup at the buzzer, to give Denver a 69-51 edge at the break.\n\n\r\n              Holmgren scored 17 points in the first half. Gilgeous-Alexander went 0 for 9 from the field and had three points before the break.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host the Utah Jazz on Monday.\n\n\r\n              Thunder: Host the Detroit Pistons on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996776.1401448
}