{
  "game_id": "0022300209",
  "espn_id": "401584837",
  "date": "Nov 19, 2023",
  "matchup": "ORL @ IND",
  "headline": "Banchero leads fast-starting Magic to 128-116 win over Pacers",
  "body": "INDIANAPOLIS -- — Paolo Banchero scored 24 points, Franz Wagner added 19, and the visiting Orlando Magic routed the Indiana Pacers 128-116 on Sunday.\n\n\r\n              The Magic, who improved to 6-3 on the road, scored the game's first 11 points. They had a 42-21 lead after the first quarter and were ahead by as much as 38 in the second quarter. The margin reached 40 in the second half before the Pacers rallied in the final minutes.\n\n\r\n              “Just come out and hit 'em in the mouth early,” said Magic point guard Jalen Suggs. ”It's like a boxing match. Once you’ve got in their head, that they don't want to get hit, they don't want to play physical, they don't want to play against tough defense ... that's hard to play against, night in and night out.\"\n\n\r\n              Six Magic players scored at least 13. Suggs, who sat out Friday's win at Chicago with a knee injury, scored nine of his 18 in the opening quarter. Moritz Wagner scored 16 and Cole Anthony 15.\n\n\r\n              “I'm extremely pleased with how they played tonight,” said Magic coach Jamahl Mosley. “They came out right away and took on the challenge.”\n\n\r\n              Reserve Jordan Nwora led the Pacers with 19. Pacers All-Star point guard Tyrese Haliburton missed all seven field-goal attempts in a two-point first half. He finished with 12 points.\n\n\r\n              When asked about why his team played so poorly in the first half, Pacers coach Rick Carlisle said, “I'll take the blame.”\n\n\r\n              He later added, “Let's quit talking about offense. We didn't guard them. We’ve got to defend better.”\n\n\r\n              The Pacers came into the game with four wins in five games, including three at home. The Magic wrapped up a four-game road trip with their third consecutive victory.\n\n\r\n              “We've got to be physical back,” said Pacers reserve Jalen Smith, who scored 10. “The NBA is a grown man's league.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Toronto on Tuesday.\n\n\r\n              Pacers: Visit Atlanta on Tuesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995740.880369
}