{
  "game_id": "0022200145",
  "espn_id": "401468300",
  "date": "Nov 07, 2022",
  "matchup": "ORL vs. HOU",
  "headline": "Rockets snap 6-game losing streak, beat Orlando 134-127",
  "body": "ORLANDO, Fla. -- — Jalen Green scored 34 points, K.J. Martin came off the bench to add 21 and the Houston Rockets snapped a six-game losing streak with a 134-127 win over the Orlando Magic on Monday night.\n\n\r\n              Green and Martin were among nine Rockets who made 3-pointers in the game. Houston was 24 for 48 (50%) from behind the arc. Coming into the game as the NBA’s poorest shooting team (42.4%), the Rockets shot 52.9% (46 for 87) in the win.\n\n\r\n              “It was the ball movement that led to the 3-point shooting tonight for us,\" Rockets coach Stephen Silas said. “We're not going to make 24 threes every night, but at least we're creating opportunities for our teammates. I've been talking to them a lot about it and hopefully it's sinking in.”\n\n\r\n              Eric Gordon, who made five 3-pointers and finished with 19 points and four assists, agreed.\n\n\r\n              “That (ball movement) is why we scored a ton of points,” Gordon said, \"and we were knocking them down. We took advantage. It was just an offensive night for both teams and it was good that we made the most runs to win. We didn’t have too many droughts when we weren't scoring.\n\n\r\n              Alperen Sengun had 20 points and 10 rebounds for Houston, and Kevin Porter Jr. added 17 points and 11 assists.\n\n\r\n              Paolo Banchero led the Magic with 30 points. Franz Wagner added 23 points and Terrence Ross had 21, most in a late, futile Magic rally.\n\n\r\n              Green scored seven points in a 12-0 third-quarter run, and the Rockets built a 100-83 advantage before the end of the period. It was the second straight third-quarter debacle for Orlando, which saw a 20-point lead disappear against Sacramento on Saturday night.\n\n\r\n              “They did get hot, obviously,” Orlando coach Jamahl Mosley said. “There were a lot of open looks with our inability to get to the basketball. But give them credit for knocking shots down.”\n\n\r\n              A driving layup by Mo Bamba got Houston's lead down to three early in the fourth quarter, but Daishen Nix, Tari Eason and Martin answered with 3-pointers during another 12-0 outburst that quickly pushed the Rockets' advantage back up to 15 points.\n\n\r\n              The Magic shot 65.8 % in the first half and still trailed 71-65 due to Houston's 14 3-pointers. Gordon and Green had 15 points each in the first half, and Sengun had 14 points and four offensive rebounds.\n\n\r\n              The loss dropped the Magic to 2-9, tied with the Rockets for the worst record in the league.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Thirteen of the Rockets' first 15 shots were 3-pointers. ... Smith and Porter (illness), and Green (left knee contusion) were all game-time decisions, yet all three started. Smith flew directly to Orlando after missing Saturday's game at Minnesota. He played 22 foul-plagued minutes and scored three points.\n\n\r\n              Magic: Orlando shot 54.9% for the game and made 12 of 25 3-pointers. . . . G Markelle Fultz (fractured toe) and G Gary Harris (arthroscopic knee surgery Sept. 1) have yet to play this season and are not expected back during the seven-game homestand which ends Nov. 16.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Play at Toronto on Wednesday night. \n\n\r\n              Magic: Play against Dallas at home Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994655.9442549
}