{
  "game_id": "0021700544",
  "espn_id": "400975290",
  "date": "Dec 31, 2017",
  "matchup": "PHX vs. PHI",
  "headline": "Dario Saric scores 27 points to help 76ers beat Suns",
  "body": "PHOENIX --  The Philadelphia 76ers might now be learning how to win after blowing a big lead, having done it in back-to-back games.\n\nDario Saric tied a season high with 27 points and the Sixers beat the Phoenix Suns 123-110 on Sunday night after blowing an 18-point lead in one quarter.\n\n\"It's on our back all of the time that we can't win at the end of a game,\" Saric said. \"The last two games we showed up in the fourth quarter how we need to play. How we are tough at the end of the game.\"\n\nJoel Embiid added 22 points and nine rebounds, and Ben Simmons had 11 of his 21 points in the fourth quarter to help Philadelphia win for third time in four games.\n\nEmbiid returned after he sat out Saturday's game at Denver to rest his back. He hurt his right hand going for an inbounds pass late in the game, but stayed in until 41 seconds remained. He had X-rays after the game and was told he might have a sprain.\n\nDevin Booker scored 28 of his 32 points in the second half for the Suns, and T.J. Warren had 28.\n\n\"If you weren't coaching against him he's somebody you would pay to go see,\" Sixers coach Brett Brown said of Booker.\n\nThe Sixers came close to dropping their seventh game this season in which they have led by 11 points or more. But J.J. Redick made a 3-pointer with 1:31 to play for an insurmountable 119-108 lead. Redick had 22 points.\n\nPhiladelphia led by 11 at Denver in the fourth quarter on Saturday and had to hang on for a five-point win.\n\n\"We're getting better at closing out games and knowing what we need to do,\" Simmons said. \"I just know he (Brown) needs me to be more aggressive so I just try to take it in my own hands.\"\n\nPhoenix trailed 73-55 with 9:20 left in the third quarter and went on a 32-11 run to take the lead before the quarter ended.\n\nBooker scored 16 of his points in the third as the Suns fought back with energy on both ends. Philadelphia took a 92-89 lead into the fourth quarter after Phoenix took a three-point lead, its largest of the game.\n\nThe Suns couldn't retake the lead throughout the entire fourth quarter, however, as the Sixers pulled away.\n\n\"We are in a lot more games than we used to be and we are winning some games,\" Booker said. \"We are moving in the right direction for sure.\"\n\nWarren made all four of his shots and scored 11 points in the first quarter. The Suns trailed by as many as 12 in the first 12 minutes, and 38-32 when it ended thanks to a 29-foot bank shot by Redick with a second to go.\n\nRedick scored 10 of his points in the first quarter. Simmons added nine rebounds and six assists for the 76ers.\n\nThe Sixers hit their first four shots of the second quarter and took a 51-35 lead on a basket and free throw by Embiid with 8:14 to play. The Suns went three minutes of the quarter without a point and Philadelphia took a 63-49 lead into halftime after going up by 18.\n\nPhoenix made only 6 of 21 second-quarter shots.\n\n\"I credit our guys for getting back in it, but sometimes you use up all that energy,\" Suns coach Jay Triano said.\n\nRAISING THE ROOF\n\nThe Suns brought back a celebratory gesture from recent years when Marquese Chriss followed Booker's miss with a two-handed dunk with 4:39 left in the third. Players on the bench pumped both arms in the air, the jam cutting the Sixers' lead to two at 82-80.\n\nA PHILLY CHEER\n\nSixers fans sitting at midcourt began a cheer as the final seconds ticked off, chanting \"Trust the process\" with a hand clap in unison.\n\nTIP-INS\n\nSixers: Won consecutive games for the first time since Nov. 20-25.\n\nSuns: The Suns' 40 points in the third quarter was the second time they scored 40 or more in a quarter this season. ... F Jared Dudley saw action for the first time since Dec. 20, a stretch of four games.\n\nUP NEXT\n\nSixers: Host San Antonio on Wednesday night.\n\nSuns: Host Atlanta on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764993910.092632
}