{
  "game_id": "0021900870",
  "espn_id": "401161512",
  "date": "Feb 26, 2020",
  "matchup": "MEM @ HOU",
  "headline": "Westbrook scores 33 as Rockets rout Grizzlies 140-112",
  "body": "HOUSTON --  On a night when the Houston Rockets scored 140 points, all anyone wanted to talk about was their defense.\n\nRussell Westbrook and James Harden combined for 63 points as the Rockets sailed to their fifth straight win, 140-112 over the Memphis Grizzlies on Wednesday.\n\nHarden piled up 30 points without playing in the fourth quarter and Westbrook, who had 33, sat down for good with about six minutes left. The duo had 46 points by halftime as Houston built a 73-47 lead.\n\nAlthough the Rockets let up a bit on defense with a huge lead after halftime, coach Mike D'Antoni raved about his team's effort before the break.\n\n“It was just very good activity getting in lanes,\" D'Antoni said. “Our defense, rebounding, boxing out, everything in that first half was just really good.\"\n\nAdded Harden: “We're finally getting there defensively and that's what it's going to take for us to win games. ... If we want to get to where we want to go we have to engage and lock in on the defensive end, and we did that.\"\n\nThe Rockets pushed their advantage to 35 after scoring the first nine points of the third quarter. The Grizzlies then scored the next 13 points, capped by a 3-pointer from De’Anthony Melton, to cut it to 82-60 with about 7½ minutes left in the period.\n\nD’Antoni called a timeout and the Rockets got back on track after that, using a 10-3 spurt, with 3s from P.J. Tucker and Harden, to extend it to 92-63 midway through the quarter.\n\n“On defense our communication is great, and offensively, we can't be guarded,\" Austin Rivers said. “So I think we're the best offensive team in the league and when our defense is up to par, we become a hard team to beat.\"\n\nA 9-0 run late in the third got the Grizzlies within 17, but the Rockets closed out the period with an 11-5 spurt, capped by a 3 from Rivers at the buzzer, to take a 111-88 lead into the fourth.\n\nDillon Brooks had 22 points for the Grizzlies, who finished 0-4 on their longest road trip of the season.\n\nMemphis coach Taylor Jenkins hopes his team can learn from this difficult time.\n\n“We are ready to get home and continue to get back to work,\" he said. “This is a great experience for our guys. It's a tough four-game stretch, but there's a lot of games to be played. Just keep our spirits up and keep getting better.\"\n\nWestbrook also had nine rebounds and eight assists after missing Monday’s game with a sore thumb. It was his second straight 30-point game and fourth in his last five.\n\nHarden hit seven 3-pointers on a night when the Rockets made 23 of 50 from long range.\n\nHouston’s winning streak started in the game before the All-Star break, and the Rockets have scored 120 points or more in all four wins since then, beating Golden State, Utah and New York before Wednesday's rout.\n\nTIP-INS\n\nGrizzlies: Melton received a flagrant foul 1 for a hard foul on Robert Covington early in the third quarter. ... Jonas Valanciunas had 16 points and 10 rebounds. ... Ja Morant scored 12 points with nine assists.\n\nRockets: G Eric Gordon missed the game after bruising his right knee Monday night. ... Thabo Sefolosha sat out with flu-like symptoms. ... Westbrook received a technical foul just before halftime for what officials said after the game was taunting. ... Rivers had 23 points off the bench. ... Covington had three blocks for his fifth straight game with at least three.\n\nWESTBROOK'S TECHNICALS\n\nWestbrook's technical foul gave him an NBA-high 14 this season. If he receives two more he will be suspended for one game without pay.\n\n“I'm going to go out and keep competing,\" he said. “I'm an emotional guy, but that wasn't the technical foul.\"\n\nUP NEXT\n\nGrizzlies: Host the Sacramento Kings on Friday night.\n\nRockets: Visit the Boston Celtics on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995690.809304
}