{
  "game_id": "0021500975",
  "espn_id": "400828862",
  "date": "Mar 12, 2016",
  "matchup": "CHA vs. HOU",
  "headline": "Walker, Hornets beat Rockets 125-109 for 7th straight win",
  "body": "CHARLOTTE, N.C. -- Kemba Walker said the Charlotte Hornets are playing their best basketball of the season right now.\nHe thinks they can be even better.\nIf that's the case, watch out NBA.\nWalker scored 17 of his 26 points in the second half, and the Hornets used a 17-2 run to open the fourth quarter and beat the Houston Rockets 125-109 Saturday night for their seventh straight victory in front of a sellout crowd.\nCharlotte has won 13 of its last 15 games and pulled within a half-game of the Miami Heat for the fourth-best record in the Eastern Conference. The Hornets are hoping to open a playoff series at home, where they are 25-9.\n\"We've got to keep it rolling,\" said Walker, who tallied his 34th game with at least 20 points.\nMarvin Williams added 25 points, Jeremy Lin scored 16 and Al Jefferson had 10 rebounds and 10 assists for the Hornets.\nCorey Brewer had 21 points and Dwight Howard added 16 points and 13 rebounds for the Rockets. The Hornets kept James Harden in check most of the night, limiting the All-Star to 12 points on 2-of-14 shooting from the field. Harden had 10 assists.\nThe Hornets snapped a 10-game losing streak against the Rockets. Their last win against Houston game came on Nov. 26, 2010.\nLed by Walker's four 3-pointers, the Hornets made 15 of 31 shots from behind the arc.\nThe Rockets had won four of their previous five, but the Hornets blew open a tight game in the fourth quarter behind Walker and a solid transition game that led to easy baskets.\nThe Hornets entered the fourth quarter leading by three, but Walker began taking his game to a different level, hitting a 3-pointer and a pull-up jumper from 19 feet.\nThen he scored on a fast-break layup off a dish from Lin and pulled up from the top of the key on another fast break and knocked down his fourth 3-pointer of the game.\n\"They hit the gas they started making shots,\" Brewer said. \"We had a bad start. They went on a 7-0 run and that was the game basically.\"\nCourtney Lee added two more 3-pointers and Walker scored again to push the lead to 24.\n\"I thought our guys just took it to another level in terms of their energy,\" Hornets coach Steve Clifford said.\nIt was Charlotte's defense that led to the production on the offensive end.\n\"Once we limited them in what they wanted to do and tried to take away their first option, the second options, they kind of got stagnant and we were able to get stops, and get the rebound, and get out and run in transition,\" Lee said. \"Then guys were making great plays for each other and we knocked down some shots.\"\nThe Hornets are 5-0 on their current seven-game homestand.\n\"Coming out they made some 3-pointers early and we missed some 3-pointers,\" Rockets coach J.B. Bickerstaff said. \"Those kinds of things change the tide. Our guys fought and they gave it what they had and I think tonight was one of those nights that they didn't have it.\"\nTIP-INS\nRockets: Howard had his 32nd double-double of the season with 16 points and 13 rebounds.\nHornets: Charlotte has scored 60-plus points in the first half of three straight games, a season-best streak. The team is 10-0 when doing so this season.\nFAST STARTS\nThe Hornets have scored 39, 35 and 35 points in the first quarter of their last three games.\nThey led by as many as 19 in the first half behind Williams, who had 14 points in the first quarter. Charlotte repeatedly dumped the ball low to Jefferson, who found backdoor cutters for easy layups and dunks.\nWILLIAMS FIRING\nThe Hornets are getting great play from Williams, who has scored 20-plus points in back-to-back games for the first time this season.\n\"My teammates are doing a great job of getting me open,\" Williams said. \"I think we're doing a good job of putting a lot of pressure on the defense. I'm definitely a beneficiary of playing with great players.\"\nUP NEXT\nRockets: Host Memphis on Monday night.\nHornets: Host Dallas on Monday night",
  "source": "espn_api",
  "crawled_at": 1764994354.356263
}