{
  "game_id": "0022000917",
  "espn_id": "401307720",
  "date": "Apr 26, 2021",
  "matchup": "LAL @ ORL",
  "headline": "Schroder, Davis lead Lakers' late rally past Magic",
  "body": "ORLANDO, Fla. -- — Dennis Schroder scored 13 of 21 points in the fourth quarter, Anthony Davis added 18 points and eight rebounds and the Los Angeles Lakers rallied to beat the Orlando Magic 114-103 on Monday night.\n\n\r\n                    Trailing 80-79 following a sluggish third quarter, the Lakers’ offense came alive late to end their losing streak at three games. LA outscored Orlando 35-23 in the fourth period, improving to 19-12 on the road and 9-20 when trailing after three quarters.\n\n\r\n                    Schroder also had 10 assists as he takes on a bigger role for LA in the absence of injured LeBron James.\n\n\r\n                    “He’s really growing with his floor-general mentality and running the team,” coach Frank Vogel said of Schroder, who made 6 of 7 shots in the fourth quarter and scored or assisted on 16 of LA’s final 18 points. “That’s why we feel like (Schroder’s emergence) is going to be a silver lining. It was accelerated. Having ’Bron out, there’s a lot of silver linings and this is one of them, seeing him grow.”\n\n\r\n                    Montrezl Harrell scored 18 points off the bench for the Lakers, who shot 54% from the floor and hit 11 3-pointers. Andre Drummond chipped in 13 points and 11 rebounds for Los Angeles.\n\n\r\n                    Davis, who was playing his third game after missing 30 games due to a right calf strain, made eight of 15 shots in 31 minutes. Vogel said before the game that Davis was no longer under a minutes restriction. Davis, meanwhile, was frustrated by his sloppy play.\n\n\r\n                    “I probably won’t ever have five turnovers in a game again, but the team kind of covered up those mistakes for me with big plays,” Davis said.\n\n\r\n                    Chuma Okeke scored 18 points and converted a thunderous dunk over Drummond in the first quarter. Gary Harris scored 17 for the Magic, who have lost six straight and 25 of 30. With Detroit’s victory over Atlanta, Orlando has the East’s worst record.\n\n\r\n                    Assistant Tyrone Corbin was acting head coach for the Magic for a second straight game. Coach Steve Clifford tested positive for COVID-19 on Saturday, although he has said he is symptom-free.\n\n\r\n                    Orlando was coming off a blowout loss to the Pacers on Sunday.\n\n\r\n                    “I loved our fight,’’ Corbin said. “After the game (Sunday), to come back and play against a team as talented as they are ... we showed a lot of determination and fight after the rough one we had.”\n\n\r\n                    CHAMPIONSHIP MEMORIES\n\n\r\n                    The Lakers have happy recent memories of the Orlando area, having won last season's championship in the league's pandemic bubble.\n\n\r\n                    “You are driving around those back Disney streets headed to the hotel that we stayed at and it was a sense of reflection on what we were able to accomplish here,” coach Frank Vogel said.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: James, who hasn’t played since March 20 because of a sprained right ankle, posted a video on Instagram of him doing light jogging in Dallas last week. At the end of his many trips up and down the floor, James converted a layup. Vogel said James remains “out indefinitely.” ... Drummond was whistled for a jump ball violation and a turnover on the opening tip. While voicing his displeasure with referee Marc Davis, Drummond surrendered a dunk to Carter.\n\n\r\n                    Magic: Rookie guard Devin Cannady underwent surgery early Monday to repair an ankle he badly injured in the first quarter on Sunday. Cannady, who was recently signed to a second 10-day contract, suffered a dislocated ankle and an open wound, but Monday’s surgery revealed no bone fractures or cartilage tears in the ankle. “He’s expected to make a full recovery and it’s exciting news for him,” Corbin said. … In an announcement played on the Amway Center video board, injured guard Markelle Fultz said he was recently vaccinated against COVID-19 and urged others to get the shots.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: At Washington on Wednesday night.\n\n\r\n                    Magic: At Cleveland on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997280.6300402
}