{
  "game_id": "0022300391",
  "espn_id": "401585019",
  "date": "Dec 23, 2023",
  "matchup": "ORL @ IND",
  "headline": "Paolo Banchero scores 34 points, Magic beat Pacers 117-110 to snap 4-game losing streak",
  "body": "INDIANAPOLIS -- — Paolo Banchero scored 34 points and the Orlando Magic snapped a four-game skid with a 117-110 victory over the Indiana Pacers on Saturday night.\n\n\r\n              Banchero shot 11 of 20 from the field and made 12 of 16 free throws. Franz Wagner added 24 points for the Magic.\n\n\r\n              “Obviously dropping four straight, we were desperate to get back in the win column,” Banchero said. “So everyone was really focused on what we had to do to win the game. We knew it was going to be defense that we had to do it with”\n\n\r\n              Tyrese Haliburton had 29 points and 14 assists for the Pacers. Myles Turner scored 24 and Buddy Hield 20.\n\n\r\n              A disappointed Haliburton wasn't pleased with his own play.\n\n\r\n              “I've been bad for the last week and a half,” he said. “I've been hurting the team more than I've been helping it.”\n\n\r\n              Orlando shot 53% from the field, just one percentage point better than the Pacers. The difference was at the line where the Magic made 33 of 41 attempts while the Pacers went 9 for 13.\n\n\r\n              “I love that we played the right way,\" Magic coach Jamahl Mosley said. “People always say what is the right way. It’s taking what the game gives you. You’re not forcing it. You’re not chasing it. You’re finding the right situation.”\n\n\r\n              The Pacers attempted to make up the difference from 3-point range, hitting 15 shots from long distance compared to six for the Magic.\n\n\r\n              The Pacers rallied from a 14-point deficit and pulled within one at 93-92 after three quarters. The Pacers briefly held an 84-81 lead.\n\n\r\n              \"They came out firing after halftime and we expected that,\" Mosley said. \"Our guys did not blink. They say, ‘OK we have to settled ourselves down.’ We executed offensively and then down the stretch we got some big time stops.”\n\n\r\n               Orlando regained control down the stretch and finished with a 39-33 edge in rebounding.\n\n\r\n              The Magic did much of their damage inside, shooting nearly 62% and building a 73-59 lead by halftime. Banchero scored 23 points in the first half, hitting 7 of 8 shots and 9 of 11 free throws. The Pacers shot 49% from the field before intermission.\n\n\r\n              Pacers coach Rick Carlisle said committing 30 fouls was a killer. Several players were in foul trouble and Andrew Nesmith fouled out.\n\n\r\n              “The foul differential and free throw differential is pretty embarrassing,” Carlisle said.\n\n\r\n              Haliburton said the foul problems are because the Pacers are out of position a lot as a team.\n\n\r\n              “Teams live at the free throw line and it allows them to set their defense,” Haliburton said.\n\n\r\n              The Magic were without starting guard Jalen Suggs, who missed his second consecutive game with a sprained left wrist. Gary Harris, who is from the Indianapolis suburb of Fishers, started in Suggs’ place and scored 15 points.\n\n\r\n              Pacers guard Bruce Brown was sidelined with a bone bruise in his right knee. Andrew Nembhard, who scored 17 points, started in his place.\n\n\r\n              “We are what our record is now, a .500 team (14-14),” Carlisle said. “We've had some high highs and low lows.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Washington on Tuesday in the finale of a three-game trip.\n\n\r\n              Pacers: Open a two-game trip at Houston on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995722.5831301
}