{
  "game_id": "0021800802",
  "espn_id": "401071475",
  "date": "Feb 05, 2019",
  "matchup": "OKC vs. ORL",
  "headline": "Westbrook's 7th straight triple-double leads OKC past Magic",
  "body": "OKLAHOMA CITY --  Russell Westbrook is on another one of those runs.\n\nThe dynamic point guard had 16 points, 16 assists and 15 rebounds in his seventh straight triple-double, and the Oklahoma City Thunder beat the Orlando Magic 132-122 on Tuesday night.\n\nWestbrook matched the longest triple-double streak of his career with his 20th of the season and No. 124 overall. He is averaging 20.0 points, 13.2 rebounds and 14.4 assists during the streak, and the Thunder are 6-1 during that span.\n\nWith Westbrook leading the way, Oklahoma City is averaging 124.6 points in its last seven games.\n\n\"He is definitely the reason for that,\" said Paul George, who scored 39 points against Orlando. \"He is the reason we have had the highest (offensive) months in Thunder history. I cannot say enough for the credit he deserves for our offense being at the level it is at.\"\n\nDennis Schroder scored 20 points and Jerami Grant had 19 to help the Thunder win for the eighth time in nine games.\n\nEvan Fournier scored 25 points for the Magic, and Aaron Gordon added 18 points and 10 assists.\n\nThe Magic committed 29 fouls and had two players foul out. George made 15 of 16 free throws.\n\n\"Well, I think the biggest thing that I'll watch on the film is the fouling,\" Magic coach Steve Clifford said. \"We're on the road, we score 122 -- and that's with playing a really poor third quarter period. But I thought we played three good quarters, but we're not disciplined enough when people are driving the ball.\"\n\nOrlando led 69-62 at halftime behind 15 points from Gordon and 58 percent shooting as a team. George scored 18 in the first half for the Thunder.\n\nOrlando stretched its lead to 79-67 early in the third quarter, causing the Thunder to call a timeout. Oklahoma City came back strong in a two-minute span. A lob from George to Grant for a two-handed jam cut Orlando's lead to 81-78, and the Magic called a timeout.\n\nWestbrook clinched his triple-double on a rebound with 3:33 left in the third quarter. His overall play sparked a 29-10 run that put the Thunder back in front for good. Oklahoma City led 98-92 at the end of the third quarter after making 15 of 24 shots in the period.\n\n\"We were getting busted the first half,\" Thunder guard Terrance Ferguson said. \"We just came together, started being aggressive, started making plays.\"\n\nA steal and 3-pointer by Terrence Ross cut Oklahoma City's lead to 128-122 with 31 seconds to play, but the Thunder held on.\n\nClifford said the Magic simply stopped doing what was working.\n\n\"We just -- I don't want to say we revert back or whatever, but we don't always just stay with it,\" he said. \"When you've got a way to play, especially against a team as good as them, you've got to stay with it.\"\n\nTIP-INS\n\nMagic: Reserve center Mo Bamba is out indefinitely with a stress fracture in his left leg. ... Gordon was called for a technical in the fourth quarter. ... Gordon fouled out with 36.6 seconds left. ... Fournier fouled out with 29.6 seconds to play.\n\nThunder: Westbrook was called for a technical foul in the first quarter. Coach Billy Donovan was called for one in the second. ... Oklahoma City is 14-6 this season when Westbrook gets a triple-double.\n\nSTAT LINES\n\nGeorge scored at least 37 points for the fifth straight game. He is averaging 38.4 points in those contests and has made 31 of 64 3-pointers in that span.\n\nHE SAID IT\n\nFerguson on Westbrook: \"He's a floor general. He sees everything. He gets everyone involved. You need to stop him to stop us, and that's hard to guard, especially when he's in the attack mode like that.\"\n\nUP NEXT\n\nThe Magic play at the Minnesota Timberwolves on Thursday.\n\nThe Thunder host the Memphis Grizzlies on Thursday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994575.156717
}