{
  "game_id": "401809508",
  "espn_id": "401809508",
  "date": "Oct 31, 2025",
  "matchup": "POR vs DEN",
  "headline": "Grant hits free throws with 1.4 seconds left and Blazers beat Nuggets 109-107",
  "body": "PORTLAND, Ore. -- — Jerami Grant made a pair of free throws with 1.4 seconds left and the Portland Trail Blazers rallied for a 109-107 victory over the Denver Nuggets on Friday night in the NBA Cup opener for both teams. \n\n\r\n              Denver led 81-71 going into the fourth quarter. With 27.7 seconds left and the Nuggets in front 107-105, Grant hit a pair of free throws for the Blazers to tie it. \n\n\r\n              After a scramble on the other end, Shaedon Sharpe blocked Aaron Gordon’s jumper and the Nuggets were called for a shot clock violation, giving Portland the ball with three seconds left.\n\n\r\n              A foul was called on Gordon and Grant made the free throws. Nikola Jokic missed a 13-foot jumper as the clock ran out.\n\n\r\n              Jokic had 21 points and 14 rebounds but fell just short of his fifth straight triple double to open the season with nine assists. Jokic went into the game tied with Oscar Robertson (1961-62) and Russell Westbrook (2020-21) for most consecutive triple-doubles to start the season with four. \n\n\r\n              Grant had 16 points off the bench for the Blazers, who won their third straight. Deni Avdija led Portland with 23 and Sharpe had 19. \n\n\r\n              Jamal Murray added 22 points for the Nuggets. The loss snapped Denver's three- game winning streak. \n\n\r\n              Murray was questionable with left calf soreness but started and the Nuggets went up 30-18 on his layup. Avdija's layup tied it for Portland at 41 but the Nuggets went into halftime with a 57-53 lead. \n\n\r\n              The Blazers briefly pulled in front 68-67 on Kris Murray's layup before Denver's 9-0 run to end the third quarter for a 10-point lead. \n\n\r\n              There was a lengthy delay at the end of the first quarter because of a shot clock malfunction at the Moda Center. \n\n\r\n              Up Next\r\n              The Nuggets host the Kings on Monday. \n\n\r\n              The Trail Blazers host the Lakers on Monday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042537.301363
}