{
  "game_id": "0021800890",
  "espn_id": "401071563",
  "date": "Feb 23, 2019",
  "matchup": "SAC @ OKC",
  "headline": "Hield scores 34 as Kings top Thunder 119-116",
  "body": "OKLAHOMA CITY --  The Sacramento Kings finally got that big win they've been looking for.\n\nAfter two-point losses to the Golden State Warriors and the Denver Nuggets -- the top two teams in the Western Conference -- in their previous two games, the Kings were left frustrated.\n\nSacramento broke through against third-place Oklahoma City as Buddy Hield scored 34 points to help the Kings beat the Tunder 119-116 Saturday night.\n\n\"A game ago, it's, `Oh my gosh, we're so close,\" Kings coach Dave Joerger said. \"We had the Warriors. We feel like we had the Warriors, and then they got away. So it's a little bit of relief, also.\"\n\nHield, who played college ball at the nearby University of Oklahoma, shot 12 for 22 from the field. He said holding on for the win was a big deal because of Oklahoma City's Paul George and Russell Westbrook.\n\n\"It's big, especially the way Russ and PG are playing,\" Hield said. \"They're playing great. They're a great team, great defensive team, and we came out to be resilient.\"\n\nGeorge, who hit the game-winner the night before in a 148-147 double-overtime win over Utah, missed a 3-pointer at the buzzer against the Kings that could have forced overtime. He scored 14 points and shot just 4 for 19 after entering the night averaging a league-best 38.9 points per game in February.\n\n\"PG got a good look at the end, and thank God it didn't go down,\" Hield said.\n\nWestbrook had 41 points and 10 rebounds for the Thunder in his third straight game with at least 40 points.\n\nDe'Aaron Fox and Marvin Bagley each added 19 points for the Kings.\n\nHield scored 18 points in the first half to help the Kings take a 63-49 lead at the break, but back-to-back 3-pointers by Terrance Ferguson and George cut Sacramento's lead to 67-64.\n\nBack-to-back 3s by Yogi Ferrell and Hield put Sacramento up 90-74 in the third quarter.\n\nOklahoma City stormed back in the fourth, and Westbrook's 3-pointer with about a minute to play tied the score at 116.\n\nFox made two free throws with 29.3 seconds left to put Sacramento up 118-116. Westbrook came back with a shot that appeared to tie the score, but he was called for an offensive foul after Willie Cauley-Stein took a charge with 11.5 seconds remaining.\n\n\"It was a charge,\" Westbrook said. \"They called a charge. That's it. I can't change the call. It's over with now.\"\n\nThe Kings broke through Oklahoma City's pressure, and Harrison Barnes was fouled with 4.2 seconds left. He made the second of two free throws to give the Kings a 119-116 edge, setting up the final sequence.\n\nThe Kings shot 46 percent for the night.\n\n\"For the most part, we made them shoot some tough ones, and they made them,\" George said. \"It was just a night they made mid-range shots, but they've got guys who can make those plays.\"\n\nTIP-INS\n\nKings: Hield was cheered loudly during pregame introductions. He attended Oklahoma's win over Texas earlier in the day. ... Bagley hit a deep 2-point jumper at the third-quarter buzzer.\n\nThunder: Westbrook was called for a technical in the third quarter. It was his 13th of the season, three short of the threshold for a one-game suspension. Coach Billy Donovan was called for one in the second quarter. ... Recent addition Markieff Morris debuted and played 17 minutes without scoring against Utah on Friday. He scored 10 points on 2-for-8 shooting on Saturday.\n\nHE SAID IT\n\nHield on playing in Oklahoma: \"It's a good place to come in when you've really got to lock in in Oklahoma. Just being here, I feel comfortable.\"\n\nBIG MINUTES\n\nGeorge played 50 minutes, 26 seconds against Utah on Friday, then followed it with 38:29 of action against the Kings.\n\n\"It's was tough, but it's no excuse,\" George said. \"Back-to-backs are in this league for a reason.\"\n\nUP NEXT\n\nKings: At Minnesota on Monday night.\n\nThunder: At Denver on Tuesday night.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994177.62752
}