{
  "game_id": "0021800165",
  "espn_id": "401070846",
  "date": "Nov 08, 2018",
  "matchup": "POR vs. LAC",
  "headline": "Lillard scores 25 as Trail Blazers beat Clippers 116-105",
  "body": "PORTLAND, Ore. --  A gritty group of Trail Blazers backups was able to put away the Los Angeles Clippers.\n\nDamian Lillard had 25 points and Portland won its third straight game, 116-105 over the Clippers on Thursday night. It was a tight game until the fourth quarter, when the Blazers' reserves were able to get some separation.\n\n\"That was a grind-it-out kind of game. I thought our team did a good job just being present for the entire game. Our bench once again came through, with the spark down the stretch,\" Lillard said. \"End of the third, beginning of the fourth they had a really good stretch, opened it up a bit and left it there for us to close it out.\"\n\nCJ McCollum added 23 points for Portland, which has won six of seven. The bench contributed 41 points and was critical when Lillard and McCollum rested at the beginning of the final period.\n\nDanilo Gallinari and Lou Williams each scored 20 for the Clippers. Shai Gilgeous-Alexander had a career-high 19.\n\nPortland had struggled all night to separate from the Clippers, but pulled in front 93-83 on Zach Collins' dunk with 9:42 left. Another dunk by Collins put the Blazers up 100-90 with 6:10 to go.\n\nThe Clippers closed to 107-101 on Gallinari's jumper, but Jusuf Nurkic answered for Portland with a layup and Los Angeles could not get any closer down the stretch.\n\n\"I thought down the stretch -- the last eight minutes of the game -- our offense really let us down,\" Clippers coach Doc Rivers said.\n\nThere were questions before the game about the availability of Clippers forward Tobias Harris because of illness. Rivers said Harris was a game-time decision, but he was ultimately in the starting lineup.\n\nHarris, the team's leading scorer and rebounder, finished with 15 points and 11 boards for his fifth double-double this season.\n\nThe Clippers were without Avery Bradley for the second straight game because of a left ankle sprain, and Luc Mbah a Moute missed his seventh game with a sore left knee.\n\nThe Clippers missed Bradley's perimeter defense against Lillard and McCollum.\n\nPortland was without Maurice Harkless, who has missed seven straight games because of a sore left knee. Jake Layman has been starting in his place.\n\nThe Blazers led 37-28 after the first quarter, paced by McCollum's 10 points. Portland never could extend the lead to double digits and led just 61-57 at the break. Gilgeous-Alexander and Montrezl Harrell each had 12 first-half points for the Clippers, while Lillard led all scorers with 14.\n\nAl-Farouq Aminu hit a 3-pointer that gave Portland a 78-68 lead, its largest to that point, midway through the third quarter. The Clippers narrowed it again, closing to 81-77 on Harris' driving floater.\n\n\"We didn't start the game with very good defense. In the first quarter we gave up 37 points,\" Gallinari said. \"Our defense got better but in the fourth quarter they were better than us, especially in the last five or six minutes when they were able to expand the lead.\"\n\nNurkic fouled out with 1:57 left, finishing with 16 points and nine rebounds.\n\nTIP-INS\n\nClippers: The team put out a statement of sympathy for victims of the mass shooting in ThousandOaks, California, on Wednesday night. ThousandOaks is located northwest of Los Angeles. ... The Clippers were coming off a 120-109 win at home over Minnesota.\n\nTrail Blazers: The club held a moment of silence for victims of the shooting in California. ... Portland was coming off a 118-103 win at home over Milwaukee on Tuesday. ... The Blazers have won the last four meetings between the teams. ... Lillard did not shoot a free throw.\n\nCONTINUITY\n\nBefore the game, Rivers said a key to the Blazers' success is their core group has been together for some time. Portland returned 11 players this season, including all five starters.\n\n\"I think our time together, how good we get along together, our understanding of what our coaches want us to do, our understanding of each other -- I think it's all coming together,\" Lillard said.\n\nUP NEXT\n\nThe Clippers host the Bucks on Saturday.\n\nThe Trail Blazers host the Celtics on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995201.553083
}