{
  "game_id": "0022000616",
  "espn_id": "401307401",
  "date": "Mar 17, 2021",
  "matchup": "TOR @ DET",
  "headline": "Bey's double-double leads Pistons over slumping Raptors",
  "body": "DETROIT -- — Saddiq Bey had 28 points and 12 rebounds, and the Detroit Pistons overcame Norman Powell's 43 points to beat the Toronto Raptors 116-112 on Wednesday night, ending a four-game skid.\n\n\r\n                    Bey, who leads all rookies in 3-pointers with 85, was 6 of 10 from behind the arc for Detroit, which had lost 10 of 12. \n\n\r\n                    “That young man is already a solid pro and he's just getting started,” Pistons coach Dwane Casey said. “He's as strong as an ox and you can see what he's doing with his jump shot. He's going to be a star in this league for a long time.”\n\n\r\n                    Bey has played 38 of Detroit's 40 games but isn't worried about hitting a rookie wall.\n\n\r\n                    “I love this schedule,” he said. “When you are in college, or even when you are playing an 82-game season, you have a lot of downtime between games. This year, we're basically playing every other day with a lot of back-to-backs. This is exactly what players want.”\n\n\r\n                    Delon Wright added 18 points, 10 rebounds and eight assists, and Jerami Grant had 23 points. \n\n\r\n                    The Pistons outrebounded Toronto 54-30, including 13 offensive rebounds.\n\n\r\n                    “There was one stretch in the first half where we got four straight stops, but they beat us to every rebound and got another putback,” Raptors coach Nick Nurse said. “At the end of that, you've worked hard, but you don't have any stops. You can't win when you are being outcompeted.”\n\n\r\n                    Powell went 14 of 18 from the floor, including 8 of 12 on 3-pointers, and Chris Boucher added 21 points on 10-of-16 shooting. However, Toronto's other three starters — Pascal Siakam, Fred VanVleet and Kyle Lowry — missed 30 of their 37 field-goal attempts in a sixth straight loss.\n\n\r\n                    “It is frustrating, because we had a chance to win this game, but we couldn't make shots,” Nurse said. “Norman and Chris gave us a chance, but we couldn’t get there.”\n\n\r\n                    Siakam and VanVleet were both returning from absences related to COVID-19 protocols.\n\n\r\n                    “Obviously, I haven't been able to do much for the last couple weeks, but it was great being back out there,” said Siakam, who had 13 points on 3-of-11 shooting. “I'm tired, though, and I think I've lost some weight. Maybe it will make me faster.”\n\n\r\n                    Powell had 21 points in the first half, but the Pistons' 14-4 edge in second-chance points helped them take a 63-58 lead. Toronto went ahead with a 10-1 run to start the third quarter, aided by flagrant-1 fouls against Wright and Mason Plumlee.\n\n\r\n                    The Pistons, though, continued to dominate on the glass and took an 84-77 lead with 2:38 left in the quarter when Isaiah Stewart tipped in Detroit's third offensive rebound of the possession.\n\n\r\n                    Detroit led 88-81 at period's end and was up by double digits before a late Raptors run made it 105-102 with 2:27 to go.\n\n\r\n                    Josh Jackson hit a 3-pointer but fouled out on the next possession. Powell had a chance at a four-point play with 32 seconds left but missed the free throw to leave the score at 112-109. Grant added a jumper late.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Toronto hadn't lost six straight games since Dec. 3-12, 2012, Casey's second year coaching the Raptors. \n\n\r\n                    Pistons: Little Caesars Arena was allowed to sell 750 tickets for the game — the first time in 374 days the Pistons had played in front of home fans.\n\n\r\n                    GUNNING ALL NIGHT\n\n\r\n                    Powell became the second player this season to score 43 or more points without an assist. The other was guarding him at times on Wednesday -- Grant had 43 points and zero assists against the Chicago Bulls on Feb. 17.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Host the Utah Jazz in Tampa on Friday.\n\n\r\n                    Pistons: Visit the Houston Rockets on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996849.787316
}