{
  "game_id": "0022300700",
  "espn_id": "401585328",
  "date": "Feb 03, 2024",
  "matchup": "CHI vs. SAC",
  "headline": "Domantas Sabonis, De’Aaron Fox lead Kings past Bulls for 123-115 victory",
  "body": "CHICAGO -- — There is nothing complex about Domantas Sabonis' impressive consistency this season.\n\n\r\n              “Just trying to stay ready, trying to keep my body right,” he said. “And I love the game.\"\n\n\r\n              Sure looks that way.\n\n\r\n              Sabonis had a triple-double and De’Aaron Fox scored 41 points, helping the Sacramento Kings hold off the Chicago Bulls 123-115 on Saturday night.\n\n\r\n              Malik Monk had 22 points and seven assists as Sacramento improved to 5-1 on a seven-game trip. It has won six of seven overall, including a 133-122 victory at Indiana on Friday night.\n\n\r\n              “At the end of the day, we had a lot of guys step up,” Kings coach Mike Brown said.\n\n\r\n              Sabonis had 13 points, 14 rebounds and 10 assists in his 14th triple-double of the season and No. 46 for his career. It also was his 31st consecutive game with at least a double-double.\n\n\r\n              “For him to do that 31 times in a row is another reason why we're winning right now,” Monk said, “because he draws a lot of attention, and he's not selfish, either. I think that's just him playing the game, knowing the game, being a vet and not forcing anything.” \n\n\r\n              Coby White scored 26 points for depleted Chicago, and DeMar DeRozan had 24 points, seven rebounds and six assists. Nikola Vucevic finished with 24 points and 12 rebounds.\n\n\r\n              The Bulls played without Zach LaVine, Patrick Williams and Dalen Terry because of injuries, but Torrey Craig returned after missing almost seven weeks with a right foot injury. The team announced that LaVine is going to have season-ending surgery on his right foot next week.\n\n\r\n              “When you go through a situation like that, I'm pretty sure it's frustrating, it's tough on him,” DeRozan said. “It's a whole different type of mental hurdle he's got to go through with that. So hoping for the best for him.\"\n\n\r\n              Chicago trailed by as many as 30 in the third quarter, but DeRozan's turnaround jumper trimmed Sacramento's lead to 118-115 with 59 seconds left. Fox responded with two clutch foul shots for the Kings.\n\n\r\n              DeRozan then missed a contested layup on the other end, and Monk went 1 for 2 at the line. Harrison Barnes also made two foul shots in the final seconds to help the Kings close it out.\n\n\r\n              “I feel like we're learning from our mistakes and we know when a team makes a run, you know we just got to lock in for those last couple minutes,” Sabonis said.\n\n\r\n              Trey Lyles made five 3-pointers and scored 16 points for Sacramento. Barnes finished with 11 points.\n\n\r\n              Fox made a 3 in the final seconds of the first half, lifting Sacramento to a 71-52 lead. He had 22 points at the break on 8-for-13 shooting.\n\n\r\n              The Kings then picked up right where they left off. Kevin Huerter, Fox and Barnes each made a 3 early in the third quarter, and Fox scored again to make it 82-52 with 9:46 left.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Cleveland on Monday night.\n\n\r\n              Bulls: Host Minnesota on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995886.765922
}