{
  "game_id": "0022200007",
  "espn_id": "401468022",
  "date": "Oct 19, 2022",
  "matchup": "MIA vs. CHI",
  "headline": "DeRozan scores 37, Bulls top Heat 116-108 in season opener",
  "body": "MIAMI -- — DeMar DeRozan picked up where he left off last season.\n\n\r\n              DeRozan scored 28 of his 37 points in the second half, Ayo Dosunmu added 17 and the short-handed Chicago Bulls beat the Miami Heat 116-108 in the season-opener for both teams Wednesday night.\n\n\r\n              “Not many guys in this league work as hard as I do,” said DeRozan, who averaged a career-best 27.9 points last season — and got his 14th NBA season off to a flying start in this one.\n\n\r\n              It was the second-most points DeRozan had ever scored in an opener, behind only the 40 he had for Toronto against Detroit on Oct. 26, 2015. He made 14 of 22 shots from the floor.\n\n\r\n              “His whole routine and what he does in the summer and the grind that he puts himself through, I think prepares him for these for these situations,\" Bulls coach Billy Donovan said. “And he takes great care of himself. He’s really, really cerebral. He’s a smart player.\" \n\n\r\n              Nikola Vucevic had 15 points and 17 rebounds for the Bulls, and Goran Dragic added 12 off the Chicago bench.\n\n\r\n              Jimmy Butler scored 24 points and Tyler Herro added 23 for Miami, which got 22 from Max Strus and 12 from Bam Adebayo.\n\n\r\n              “They did everything right. We didn't do too much right,\" Butler said. “We did a lot of things wrong. They pulled away and we couldn't get the lead back.\"\n\n\r\n              The Bulls played without All-Star guard Zach LaVine because of left knee injury management. That knee had him in and out of the lineup last season and required surgery in May. LaVine played in three of Chicago’s preseason games and experienced discomfort in recent days — which Donovan said is to be expected, given that LaVine was limited for much of the summer.\n\n\r\n              “We’re just going to have to get our hands around this,” Donovan said. “But like the medical guys said, he has to ramp up. There’s no way of getting around it. You just can’t tiptoe around it and let him kind of ease his way into the season.”\n\n\r\n              The Bulls did just fine without LaVine — who signed a $215 million deal over the summer.\n\n\r\n              Chicago started the second half on a 34-19 run, breaking open what was a 59-59 halftime tie and turning it into a 93-78 lead. The margin was down to 10 going into the fourth, and the Heat kept chipping away.\n\n\r\n              Strus’ 3-pointer with 6:19 left drew Miami to 102-98, but the Heat got no closer. Vucevic made a 3-pointer with 4:59 left to put Chicago up by nine, and the lead wasn’t challenged again.\n\n\r\n              “There's things that we have to clean up defensively just to get back to our identity,\" Heat coach Erik Spoelstra said.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Dragic was 4 for 4 from 3-point range in the first half. The last time he was at least 4-for-4 from beyond the arc in a first half was Jan. 9, 2021, in Washington, when he played for Miami. ... Chicago turned 19 Miami turnovers into 17 points. ... DeRozan also had nine assists and six rebounds.\n\n\r\n              Heat: Team captain Udonis Haslem, in his 20th and — he says — final season-opener, addressed the crowd pregame and offered remarks in support of Brittney Griner, the WNBA star who remains incarcerated in Russia. ... Caleb Martin became the 76th player in Heat history to get an opening-night start. ... Victor Oladipo (left knee) was inactive. ... Kyle Lowry had two points on 1 for 7 shooting.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Visit Washington on Friday night to end a two-game season-opening trip.\n\n\r\n              Heat: Host Boston on Friday night in a rematch of last season’s Eastern Conference finals.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994001.604623
}