{
  "game_id": "0021800847",
  "espn_id": "401071520",
  "date": "Feb 11, 2019",
  "matchup": "MIA @ DEN",
  "headline": "Jokic, Beasley lead Nuggets past Heat 103-87",
  "body": "DENVER --  The Denver Nuggets halted a three-game skid by turning up their defense and turning things over to their deep guard rotation which will only get deeper when Gary Harris and Isaiah Thomas return to action after the All-Star break.\n\n\"We were tired of losing, three in a row, and coach wasn't too happy about it,\" said Monte Morris, who scored 17 points in Denver's 103-87 win over the Miami Heat on Monday night. \"We just needed to get back to our old style, our old Nuggets basketball, flying around and covering for mistakes.\"\n\nThe Nuggets have found a way to keep all their guards happy.\n\n\"Nobody cares, I mean, it's a different guy every single night,\" Morris said. \"That's what you get when you have a deep team. We've still got guys that haven't even played yet that's coming back. So, if winning is as important as everyone preaches on our team, we shouldn't have a problem.\"\n\nOn a night when Jamal Murray (3 for 12) wasn't shooting well, two other guards stepped up. Not only did Morris score 17, but Malik Beasley chipped in 20.\n\nWith Thomas and Harris coming back soon, fans wonder how coach Michael Malone will get enough playing time for all his guards over the final 25 games.\n\nMalone can't wait.\n\n\"It's going to be a great problem to have,\" Malone said. \"Our depth is something that we think we can wear teams down with and we've shown that we're more than willing and capable of playing small at times. So, you can throw a small lineup out there. So, we'll figure it out. But let's let them get healthy first and then we'll figure out what the best lineup is to win that game.\n\n\"After our first two possessions tonight, I wasn't sure if we had a point guard who could run the team. That was comical. But after that, we got settled and played pretty good basketball from that point on.\"\n\nMurray was at the point when the Nuggets turned the ball over on their first two possessions, leading to fast breaks by the Heat, who would hang tough until the third quarter.\n\nNikola Jokic had 23 points and 12 rebounds for Denver, which swept the season series from the Heat for the first time since 2008-09 and improved to 18-1 when holding opponents under 100 points.\n\nIt marked the first time they did that since a 105-99 win at New Orleans on Jan. 30.\n\nAnd they had allowed an average of 127 points during their losing streak.\n\nThe Nuggets struggled especially with 3-point defense in their losses at Detroit, Brooklyn and Philadelphia, yielding a combined 48 percent success rate from long range in their East Coast swing. And Miami was coming off a heartbreaking two-point loss at Golden State on Sunday in which they sank 18 3-pointers.\n\n\"I hope they got all their makes last night and left that in San Francisco,\" Malone cracked before tip-off.\n\nThe Heat, who were led by Justise Winslow's 15 points, did indeed go cold from long range, finishing 9 of 23 for a 27-percent clip.\n\nThe Nuggets regained their shooting touch, sinking 16 3-pointers including four in a 16-0 run they used to build a 75-57 lead.\n\n\"Our focus and intensity is in the right place, but our execution was a bit off for a bunch of reasons,\" Winslow said. \"But they outplayed us tonight. That's the bottom line. They're the better team.\"\n\nFATIGUE FACTOR\n\nThe Heat scored 38 second-half points and shot 36 percent from the field.\n\n\"I kept reminding our guys, `They played last night. Wear them down,\" Malone said.\n\nThey did.\n\n\"They wanted to run and it got away,\" Dwyane Wade said. \"Losing last night was a tough loss. But this was the toughest one of the trip.\"\n\nTIP-INS\n\nHeat: Miami, the league's only team with more wins on the road, fell to 14-14 away from home. ... Spoelstra looked at the silver lining of facing the Western Conference's top two teams on back-to-back nights, saying before the game: \"What do you want as a competitor? You want to be challenged, you want to be pushed. You want to find out what you're about collectively as a team.\"\n\nNuggets: The Nuggets honored the late Irv Brown during a first-quarter timeout with a video tribute to the former University of Colorado baseball coach, NCAA referee and longtime Denver sports broadcaster who died Feb. 3. ... The Nuggets improved to 24-4 at home.\n\nUP NEXT\n\nHeat: Visit Dallas on Wednesday night.\n\nNuggets: Host the Sacramento Kings on Wednesday night.\n\n---\n\nFollow Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995232.812991
}