{
  "game_id": "0022400681",
  "espn_id": "401705247",
  "date": "Jan 31, 2025",
  "matchup": "PHI vs. DEN",
  "headline": "Jokic makes tiebreaking 3-pointer with 39 seconds left as Nuggets edge Maxey, 76ers 137-134",
  "body": "PHILADELPHIA -- — Nikola Jokic made the tiebreaking 3-pointer with 39 seconds left, Jamal Murray had 31 points and 11 assists, and the Denver Nuggets overcame Tyrese Maxey's 42 points to beat the Philadelphia 76ers 137-134 on Friday night.\n\n\r\n              Jokic finished with 28 points, 13 assists and nine rebounds, just missing what would have been his NBA-leading 22nd triple-double. \n\n\r\n              Michael Porter Jr. scored 24 points and Julian Strawther had 18 off the bench as Denver ended a three-game losing streak. \n\n\r\n              Maxey also had nine assists, but it wasn’t enough to extend the 76ers’ four-game winning streak. Guerschon Yabusele set a career high with 28 points and Kelly Oubre Jr. added 27.\n\n\r\n              Takeaways\r\n              Nuggets: Russell Westbrook left the game with a hamstring injury in the fourth quarter when he was stripped by Ricky Council IV. Coach Michael Malone called time and Westbrook limped off, heading straight to the Nuggets’ locker room. He did not return.\n\n\r\n              76ers: Maxey had his 13th straight game of 28 or more points and fourth straight 30-point outing.\n\n\r\n              Key moment\r\n              Jokic had 13 points in the fourth quarter and Maxey 12. He tied it for the final time at 130 before Jokic's 3-pointer. \n\n\r\n              Key stat\r\n              The Nuggets, who lead the NBA in field goal percentage at 50.3, shot 65.9% (54 for 82) from the field. Six players were in double figures, with Strawther and Christian Braun (15 points) leading a 39-17 edge in bench scoring.\n\n\r\n              Next up\r\n              The 76ers continue a six-game homestand against Boston on Sunday. The Nuggets finish a five-game trip in Charlotte on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998216.2762399
}