{
  "game_id": "0022400778",
  "espn_id": "401705344",
  "date": "Feb 12, 2025",
  "matchup": "OKC vs. MIA",
  "headline": "Gilgeous-Alexander scores 32, and the Thunder rally from 21 down to beat Heat 115-101",
  "body": "Shai Gilgeous-Alexander had 32 points and nine assists, and the Oklahoma City Thunder rallied from a 21-point deficit to defeat the Miami Heat 115-101 on Wednesday night.\n\n\r\n              Jalen Williams scored 18 points and Lu Dort added 17 for the Thunder, who won their seventh straight and improved to a league-best 44-9. \n\n\r\n              Oklahoma City never led until a 24-0 run to start the fourth quarter that put the team ahead for good. The Thunder outscored the Heat 32-8 in the final period led by Gilgeous-Alexander who scored 14 points in the fourth.\n\n\r\n              Bam Adebayo had 27 points and 15 rebounds and Tyler Herro added 14 points for the Heat. Andrew Wiggins added 13 points in his second game with the Heat since being traded from the Golden State Warriors.\n\n\r\n              Miami dominated the first half, scoring at will against the league leader in defensive rating. The Heat led 58-37 in the second quarter, but Gilgeous-Alexander hit a 3-pointer at the halftime buzzer to cut Oklahoma City's deficit to 63-52. Miami shot 58.5% in the first half.\n\n\r\n              Miami led 93-83 at the end of the third quarter, but the Thunder held Miami scoreless for nearly six minutes to start the final period.\n\n\r\n              Takeaways\r\n              Heat: Miami played well for all but about six minutes. Against a team of Oklahoma City's caliber, that lapse was enough to lose the game.\n\n\r\n              Thunder: Oklahoma City has consistently erased second-half deficits half by wearing opponents down with their depth. The Thunder also continued to play with high defensive intensity.\n\n\r\n              Key moment\r\n              Gilgeous-Alexander’s 3-pointer put the Thunder ahead 96-93 with 9:31 to play. It was Oklahoma City's first lead of the game.\n\n\r\n              Key stat\r\n              Oklahoma City made 13 of 23 field goals in the fourth quarter while Miami made just 3 of 18.\n\n\r\n              Up next\r\n              The Heat visit the Dallas Mavericks on Thursday night. The Thunder visit the Minnesota Timberwolves on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997678.3017962
}