{
  "game_id": "0021800466",
  "espn_id": "401071147",
  "date": "Dec 19, 2018",
  "matchup": "OKC @ SAC",
  "headline": "George scores 43, Westbrook has triple-double in Thunder win",
  "body": "SACRAMENTO, Calif. --  Oklahoma City coach Billy Donovan thought his team spent too much time shooting 3-pointers in two losses earlier this season to the Sacramento Kings. But on Wednesday night, the Thunder focused on their inside game and came away with a win.\n\nPaul George scored 43 points, Russell Westbrook had a triple-double and Steven Adams grabbed a career-high 23 rebounds in a 132-113 victory over the Kings. Oklahoma City had a season-best 66 rebounds, compared to 43 for Sacramento.\n\n\"Steven was phenomenal on the glass,\" Donovan said. \"One of the things we wanted to do is play closer to the rim. I felt we needed to play closer to the basket.\"\n\nGeorge hit four 3-pointers and went 9 of 10 from the free throw line. Westbrook had 19 points, 17 assists and 11 boards for the 112th triple-double of his career.\n\nGeorge and Adams had double-doubles -- George pulled down 12 rebounds and Adams scored 20 points -- as the Thunder won for the eighth time in 11 games. Nine of Adams' rebounds came on the offensive end.\n\n\"(Adams) has been doing that all season,\" Westbrook said. \"There's nobody that's going to stop him from doing what he's doing every night.\"\n\nBuddy Hield had a career-best 37 points, including 7-of-14 shooting from 3-point range, and De'Aaron Fox added 28 points and 12 assists for the Kings, who have given up 130 or more points in four of their last five games.\n\n\"It's not exciting for me, watching guys just tee it up and go right down the lane over and over and over,\" coach Dave Joerger said. \"We've got to get better individually guarding the basketball, and we've got to get a little bit more active in our help.\"\n\nFox said the Thunder turned things around after two losses to the Kings by using their height advantage.\n\n\"We see teams trying to crash (the boards) a lot more than they did earlier in the season because they were worried about us running,\" Fox said. \"We just have to stop giving up offensive rebounds and second-chance points.\"\n\nIt was a matchup of short-handed teams. The Kings were missing Iman Shumpert, Marvin Bagley III and Bogdan Bogdanovic because of injuries, while Oklahoma City guards Raymond Felton and Dennis Schroder were serving one-game suspensions for leaving the bench area during a scuffle with the Chicago Bulls on Monday.\n\nGeorge had 19 points, Westbrook scored 17 and Adams added 14 in the first half, and the Thunder held a 71-52 lead at the break. Oklahoma City maintained a double-digit advantage for most of the third quarter, though the Kings pulled within nine entering the fourth quarter.\n\nThe Thunder opened the final period with a 9-0 run -- with all the points coming from George -- and had a comfortable lead the rest of the way.\n\n\"We were getting some really good stops, so we didn't have to do anything tricky,\" Adams said. \"We were just more disciplined than they were and they missed a lot of shots.\"\n\nTIP-INS\n\nThunder: Westbrook also had six steals. ... Adams had a double-double by halftime with 14 points and 15 rebounds. ... OKC missed seven of its first 14 free throws, including five straight misses in less than two minutes of the second quarter by Westbrook. ... The Thunder broke a three-game road losing streak. ... Jerami Grant had 22 points.\n\nKings: Had won their two previous games this season against the Thunder, by 131-120 in Oklahoma City on Oct. 21 and 117-113 in Sacramento on Nov. 19. The teams meet for the final time this regular season Feb. 23 at Oklahoma City.\n\nAILING KINGS\n\nShumpert (bruised right hip) and Bogdanovic (sore right foot) were both listed as day-to-day, while Bagley (bruised left knee) is expected to miss about another week.\n\nREBOUNDING PROBLEMS\n\nThe Thunder's 66 rebounds were the most by a Kings opponent in regulation since the Portland Trail Blazers also had 66 in a 1993 game.\n\nUP NEXT\n\nThunder: At Utah on Saturday. Oklahoma City has won four straight against the Jazz.\n\nKings: Play the second game of a three-game homestand when they host Memphis on Friday. Joerger coached the Grizzlies from 2013-16.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994604.127088
}