{
  "game_id": "0022200158",
  "espn_id": "401468313",
  "date": "Nov 07, 2022",
  "matchup": "LAC vs. CLE",
  "headline": "Clippers rally late, snap Cavaliers' 8-game win streak",
  "body": "LOS ANGELES -- — Paul George scored 26 points and made the tiebreaking three-point play with 37 seconds left, and the Los Angeles Clippers rallied from a 13-point deficit in the final five minutes to snap the Cleveland Cavaliers' eight-game winning streak with a stunning 119-117 victory Monday night.\n\n\r\n              Norman Powell scored 13 of his 17 points in the frantic fourth quarter for the Clippers, who finished on a 21-6 run to swipe their fourth victory in five games.\n\n\r\n              “This is a great win, a team-boosting win against a really good Cleveland team,” George said. “That was just great for our composure late in the game to find a way to scratch and claw our way back in, and then we just closed it out.”\n\n\r\n              Cleveland hadn't lost since opening night in Toronto, and it led 112-100 before the Clippers scored 15 straight points while the Cavs missed seven consecutive shots and committed three turnovers.\n\n\r\n              “I told the guys to just stay in the game,” said Clippers coach Tyronn Lue, who won a ring with Cleveland in 2016. “It was just a team effort. Not giving up. Not giving in. That's who we are, and it was good to get back to that.”\n\n\r\n              Powell tied it on a running layup while getting fouled with 1:03 to play. After Darius Garland missed a 3-pointer, George made his leaner in the lane and hit the free throw for his only points of the fourth quarter.\n\n\r\n              Evan Mobley ended the Cavaliers' five-minute field goal drought on a dunk with 29 seconds left, but Marcus Morris and Reggie Jackson hit two free throws apiece down the stretch. George missed two free throws with 1.4 seconds left, but Kevin Love's full-court heave barely missed.\n\n\r\n              “This is our best win, our biggest win,” George said.\n\n\r\n              Donovan Mitchell hit eight 3-pointers while scoring 30 points, and Mobley added a season-high 26 before fouling out in the final minute. Mitchell had his seventh 30-point performance in nine games with his new team, but didn’t hit a field goal in the final 11 minutes.\n\n\r\n              “The biggest thing is we’ll learn from this,” Mitchell said. “They did a lot of things that we’ll see come playoff time. It was a test. … It’s nothing to overreact to. We’re not in the locker room freaking out. It’s going to be a lesson, and we’re going to get better.”\n\n\r\n              Garland had 19 points and 12 assists, and Jarrett Allen added 10 points and a season-high 20 rebounds as the Cavs' longest winning streak since late 2017 ended in dramatic fashion.\n\n\r\n              “The test of, ‘How do you bounce back from something like this?’ is experience that you need,\" coach J.B. Bickerstaff said. “Through all the hype, we’re a team that’s still building, and we understand that. So as a coach, you don’t expect to win them all. You expect to have some adversity and some ups and downs, but it’s what happens next.”\n\n\r\n              Morris scored 20 points for the Clippers, who rallied and won in the absence of two key veterans.\n\n\r\n              Kawhi Leonard missed his eighth straight game since Oct. 23 while indefinitely resting the surgically repaired right knee that forced him to miss all of last season. John Wall isn’t playing back-to-back games as he rebuilds the strength in his left knee.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Caris LeVert had four points in 36 minutes. ... Love scored 17 points.\n\n\r\n              Clippers: Luke Kennard scored six points after sitting out Sunday with discomfort in his chest. ... Jackson started and had 18 points and seven assists after sitting out the final 18 minutes Sunday following a clash of knees with Utah's Nickeil Alexander-Walker.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Kings on Wednesday.\n\n\r\n              Clippers: Host Lakers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994994.243742
}