{
  "game_id": "0022300258",
  "espn_id": "401584886",
  "date": "Nov 29, 2023",
  "matchup": "LAL @ DET",
  "headline": "Lakers bounce back to rout Detroit, handing Pistons team-record 15th straight loss",
  "body": "DETROIT -- — LeBron James, coming off a career-high 44-point loss at Philadelphia, and his Los Angeles Lakers teammates were very loose during pregame warmups.\n\n\r\n              Perhaps they sensed it would be an easy night to bounce back.\n\n\r\n              And, they were right.\n\n\r\n              D'Angelo Russell scored a season-high 35 points, Anthony Davis had 28 and James 25 to help Los Angeles beat Detroit 133-107 on Wednesday night for the Pistons' franchise-record 15th straight loss.\n\n\r\n              Lakers coach Darvin Ham could see and hear that James was ready to lead the way before the game even started.\n\n\r\n              “He understands the energy he gives off,” Ham said.\n\n\r\n              James was smiling and joking with teammates while getting shots off in warmups, but simply shrugged off the observation.\n\n\r\n              “I’m pretty much always like that,” he said. “I have a lot of energy to give.”\n\n\r\n              The Lakers led 38-24 after the opening quarter, shooting 60% to Detroit's 36%.\n\n\r\n              Even though there were three quarters left, the outcome seemed certain against an offensively challenged team that doesn't play stingy defense and is a league-worst 2-16.\n\n\r\n              “This group struggles with adversity,” Pistons coach Monty Williams said.\n\n\r\n              The Pistons have had a lot of it.\n\n\r\n              Detroit broke the franchise record after sharing it with three teams that had 14-game skids during the 2021-22, 1993-94 and 1979-80 seasons.\n\n\r\n              “My job is to help our guys fight through this,\" said Williams, who is in his first season after leading Phoenix and New Orleans. \"I told our guys, one way you gain this respect in this game and in life is when you’re going through a tough time, and you hang in there.”\n\n\r\n              Detroit’s Cade Cunningham had 15 points, reserve Isaiah Livers scored 14, Isaiah Stewart had 12 points and rookie Ausar Thompson added 12 points.\n\n\r\n              The Pistons' problems started on defense.\n\n\r\n              “The resistance in the pick-and-roll coverage, the resistance to start the game just wasn’t there against D’Angelo,\" Williams said.\n\n\r\n              James said “a lot” had to change Monday night after Los Angeles' 138-94 loss to the 76ers in the most-lopsided loss of his career, and it was facing the right opponent to rebound against.\n\n\r\n              “We responded well,\" James said. \"We played a lot better.”\n\n\r\n              The Lakers started strong with Russell and Davis both scoring in double figures in the first quarter and despite having a huge lead for much of the game, they did not coast with a comfortable cushion.\n\n\r\n              “D’Lo and AD got us started out with the hot streak they had in the first quarter, and we all picked it up off of that,\" James said.\n\n\r\n              Los Angeles' top three scorers did more than make shots. Russell had nine assists, Davis grabbed 16 rebounds and James had eight rebounds and four assists.\n\n\r\n              Christian Wood had 12 points and rookie Jalen Hood-Schifino, who didn't score in his NBA debut in the previous game, scored 10 points.\n\n\r\n              Since the Pistons improved to 2-1 on Oct. 28, they have not won a game with a young team that was expected to improve after winning an NBA-low 17 games last season.\n\n\r\n              “We've got to get the feeling we had the first week of the season,” Williams said.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Oklahoma City on Thursday night.\n\n\r\n              Pistons: At New York on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995540.759539
}