{
  "game_id": "0021600102",
  "espn_id": "400899552",
  "date": "Nov 08, 2016",
  "matchup": "MEM vs. DEN",
  "headline": "Grizzlies beat Nuggets at the buzzer",
  "body": "MEMPHIS, Tenn. --  Trailing by one point, the Memphis Grizzlies had no timeouts and little time. For the oldest player in the NBA, the obstacles were simply a welcome challenge.\n\nThirty-nine-year-old Vince Carter tossed a perfectly timed, and expertly lobbed, inbounds pass to 7-footer Marc Gasol and he dropped in a shot as the buzzer sounded to lift the Grizzlies to a 108-107 victory over the Denver Nuggets on Tuesday night.\n\nGasol's basket came over Emmanuel Mudiay on a high-arcing pass from Carter underneath the Memphis goal. When Carter inbounded the ball there were 0.7 seconds left.\n\n\"I had progressions, I had a couple of options, but I just had to be patient while still keeping the 5-second violation in mind,\" Carter said. \"It's a stressful situation, but I've been in it before. I know how to relax and take my time.\"\n\nCarter scored 20 points, while Gasol had 19 for the Grizzlies, who had lost two straight. Zach Randolph added 16 points.\n\nMudiay had 23 points and Danilo Gallinari added 21 for the Nuggets.\n\nMudiay appeared to have led the Nuggets to a victory when he stripped the ball from Mike Conley and converted a fastbreak layup with 7.9 seconds left. Memphis' James Ennis followed with an errant pass out of bounds.\n\nBut Conley came up with a steal in the closing seconds and drove the length of the court before the ball was knocked out of bounds by Denver with 0.7 seconds to go.\n\nThat set the stage for the Carter-to-Gasol game-winner.\n\n\"The play was executed to perfection,\" Carter said. \"I just wanted to put it up there where only Marc could get it and let him take care of the rest.\"\n\nGasol said the key to the play was the experience of Carter\n\n\"The guy guarding the inbounds pass jumped too early,\" Gasol said. \"That opened up the passing angle and Vince made a great pass.\"\n\nMudiay said he didn't know what the breakdown defensively was on the game-winning shot by Gasol.\n\n\"It just happens sometimes,\" Mudiay said. \"Some games end like that, some games don't end like that.\"\n\nThe Grizzlies went up 83-76 early in the fourth quarter on a twisting layup by Jarell Martin and led by 95-88 following a driving layup by Andrew Harrison midway through the quarter.\n\nBut the Nuggets battled back to take their first lead of the final period, 99-98, on a 3-pointer by Nikola Jokic, with 4:27 left.\n\nThe lead changed hands six times in closing 5 minutes.\n\n\"We make it interesting, don't we?\" Grizzlies coach David Fizdale said. \"I'm just really proud of my guys handling adversity. Everything that could go wrong went wrong, but they just kept staying with it. They stayed in the moment.\"\n\nThe game was 56-all at the half. Denver shot 54 percent and outrebounded Memphis 23-17 to overcome 10 turnovers. Those Nuggets' mistakes led to 16 Grizzlies' points.\n\nMemphis fell behind by seven points in the opening minutes, but recovered behind a 12-0 run in which free-agent pickup Chandler Parsons, playing in only his second game, scored his first points of the season. Parsons went 0 for 8 in Sunday's game against Portland, but had consecutive layups in a 26-second span of the first quarter.\n\nThe Grizzlies built a 42-35 lead midway through the second quarter before the Nuggets closed to tie the game.\n\nTIP-INS\n\nNuggets: G Will Barton, who played at the University of Memphis, did not play because of an ankle injury. ... Wilson Chandler participated in parts of Tuesday's shootaround, but did not play. He is recovering from a left hamstring injury.\n\nGrizzlies: G Tony Allen was placed on the inactive list before the game with a right groin injury. ... Gasol entered the game having made a 3-pointer in each of the team's seven games, but he missed his only attempt. He had nine 3-pointers in those seven games after having made 12 in his first eight seasons. ... The Grizzlies started their sixth different lineup in eight games.\n\nTURNAROUND\n\nThe Grizzlies entered the game ranked last in the NBA in field goal percentage, but shot 51.2 percent. The Grizzlies scored 58 points in the paint.\n\nOLDIE BUT GOODIE\n\nCarter became the oldest player in the NBA to post a 20-point game since Michael Jordan scored 25 for the Washington Wizards in April 2003, at age 40.\n\nUP NEXT\n\nNuggets: Denver returns home after a five-game trip to play the Warriors, whose two-time MVP Stephen Curry set a league record with 13 3-pointers en route to a 46-point effort against the Pelicans Monday night.\n\nGrizzlies: Memphis plays Saturday at Milwaukee, following what amounts to an early season All-Star break -- three straight days off. Milwaukee is 3-1 at home and the Grizzlies are 0-2 on the road.",
  "source": "espn_api",
  "crawled_at": 1764995629.341856
}