{
  "game_id": "0021600839",
  "espn_id": "400900245",
  "date": "Feb 15, 2017",
  "matchup": "DET vs. DAL",
  "headline": "Jackson, Leuer lead Pistons to 98-91 win over Mavericks",
  "body": "AUBURN HILLS, Mich. --  Reggie Jackson snapped out of his scoring slump and helped the Detroit Pistons head into the All-Star break with a win.\n\nJackson scored 22 points, Jon Leuer added 20 and the Pistons beat the Dallas Mavericks 98- 91 Wednesday night.\n\n\"Shots just went in, and coach kept calling my number,\" Jackson said after shooting 8 for 12 from the field, including 3 for 4 on 3-pointers. \"(Dallas) just kept having coverages where they really didn't come off our wings, nor did they want to leave Andre (Drummond). I was just a recipient of the coverage they played.\"\n\nIt was Jackson's first 20-point game since he had 24 at Miami on Jan. 28. He reached double digits just four times in nine games since, averaging 8.9 points during that stretch.\n\n\"I thought he played well tonight, and we needed it,\" Pistons coach Stan Van Gundy said.\n\nJackson had 12 of his points in the first half, when the Pistons roared out to a 62-35 lead.\n\n\"We had no energy,\" Dallas center Dirk Nowitzki said, \"no bounce about ourselves. It was one of the worst halves we've played all season, and you could tell in the second we had a lot more bounce.\"\n\nNowitzki led the way in the third quarter, scoring 13 of his game-high 24 points, to help the Mavericks rally.\n\n\"We burned the first half at halftime,\" Dallas coach Rick Carlisle said. \"The second half has got to be the norm for us. The first half was an embarrassment, and we all know it and we all own it. It cost us the game, it's pretty clear.\"\n\nDallas pulled within eight midway through the fourth quarter, but the Pistons held them off the rest of the way until Deron Williams hit s 3-pointer in the final seconds to provide the final score. Nowitzki also had 10 rebounds. Harrison Barnes added 16 points, Seth Curry had 13 and Williams 12.\n\nKentavious Caldwell-Pope had 16 points, Tobias Harris 13 and Ish Smith 10 for the Pistons. Detroit outrebounded Dallas 57-38, led by Marcus Morris' 14, Drummond's 11 and Aron Baynes' 11.\n\nThe Pistons never trailed, taking a 10-0 lead to start the game, making 52.1 percent of their shots in the first half. However, Dallas outscored Detroit 56-36 in the second half.\n\nTIP-INS:\n\nMavericks:  It was the final appearance at the Palace for coach Rick Carlisle, who coached the Pistons from 2001-03 and was the Indiana Pacers' coach the night of the infamous brawl at the arena in 2004. \"It's going to be hard to imagine coming here and not coming to Auburn Hills to play,\" he said before the game. \"But it sounds like the new arena (in downtown Detroit) is going to be very nice.\" The Pistons move to Little Caesars Arena next season. ... Nowitzki's double-double was his third of the season and the 400th of his career.\n\nPistons: Leuer now has 2,000 points for his career. ... Drummond had nine points in 19 minutes, ending his streak of five straight double-doubles. ... The Pistons won while scoring less than 100 points for only the third time this season. They're 3-20 in that situation. ... It was Detroit's home win over the Mavericks since Jan. 17, 2011, and the first season sweep by the Pistons of the Mavericks since the 1997-98 season\n\nUP NEXT\n\nMavericks: Host Minnesota on Feb. 24.\n\nPistons: Host Charlotte on Feb. 23.",
  "source": "espn_api",
  "crawled_at": 1764996043.355028
}