{
  "game_id": "401810046",
  "espn_id": "401810046",
  "date": "Nov 09, 2025",
  "matchup": "MIL vs HOU",
  "headline": "Durant scores 31 points, leads fourth-quarter comeback as Rockets beat Bucks 122-115",
  "body": "MILWAUKEE -- — Kevin Durant scored 31 points and made a tiebreaking basket with 1:42 remaining to put the Houston Rockets ahead for good in a 122-115 victory over the Milwaukee Bucks on Sunday.\n\n\r\n              Houston bounced back from a 121-110 loss at San Antonio two nights earlier as it ended a three-game trip. The Rockets, who have won six of their last seven, are now at home for their next three games.\n\n\r\n              Durant shot 11 of 15 from the floor and had a season-high seven assists. Alperen Sengun had 23 points, 11 rebounds and seven assists. Jabari Smith and Reed Sheppard added 16 points each.\n\n\r\n              Giannis Antetokounmpo had 37 points and eight rebounds for Milwaukee, but went 1 of 4 from the foul line in the game's final 89 seconds. The Bucks ended up shooting 14 of 24 from the line.\n\n\r\n              Ryan Rollins scored 19 for Milwaukee.\n\n\r\n              The Rockets trailed most of the way before outscoring the Bucks 22-7 over the last 4 minutes, 33 seconds.\n\n\r\n              Smith gave the Rockets a 113-111 advantage — their first lead since the opening period — when he hit a 3-pointer with 1:42 left on an assist from Durant. Rollins answered 25 seconds later with a driving layup that tied the game.\n\n\r\n              Durant then hit a pull-up jumper to put Houston back in front with 1:42 left. Antetokounmpo had a chance to tie it when he got fouled with 1:29 remaining, but missed both free throws.\n\n\r\n              Sengun then made a basket to extend Houston’s lead to 117-113 with 1:09 remaining. Antetokounmpo hit the first of two free throws with 38 seconds left to get the Bucks within three, but he missed his second attempt.\n\n\r\n              Sengun then made a driving layup while getting fouled and completed the three-point play with 23 seconds left.\n\n\r\n              Up Next\r\n              Rockets: Host the Washington Wizards on Wednesday.\n\n\r\n              Bucks: Visit the Dallas Mavericks on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042589.728375
}