{
  "game_id": "0021600008",
  "espn_id": "400899384",
  "date": "Oct 26, 2016",
  "matchup": "MIL vs. CHA",
  "headline": "Kidd-Gilchrist, Hibbert help Hornets beat Bucks 107-96",
  "body": "MILWAUKEE -- The Charlotte Hornets turned up the pressure on the Milwaukee Bucks from the outset of their season opener.\nNicholas Batum disrupted the Bucks on the perimeter. Center Roy Hibbert had his teammates' backs in the paint.\nThe defense helped Charlotte build a big early lead, and Michael Kidd-Gilchrist had 23 points and 14 rebounds in his return from a shoulder injury in the 107-96 victory over Milwaukee on Wednesday night.\n\"Early, they didn't get things easy,\" Hornets coach Steve Clifford said.\nThey led by as many as 24 points in the third quarter before fending off a late charge from Milwaukee.\nThe Bucks, who looked lackluster for much of the game, drew energy from Greg Monroe's hustle in the paint and Jason Terry's floater that cut the lead to 93-85 with 5:08 left.\nBut the Hornets held on down the stretch, getting a straightaway 3 from Marvin Williams for a 12-point lead with 3:21 left.\n\"They definitely outplayed us. We just can't let that happen (any) more,\" Bucks forward Jabari Parker said.\nGiannis Antetokounmpo led the Bucks with 31 points, nine rebounds and five assists. The 6-foot-11 forward, now serving as Milwaukee's primary ball-handler, showed he was worth the four-year $100 million contract extension he signed before training camp.\n\"I'm not happy, we all wanted to start this season with a win ... so that's all I can think about,\" Antetokounmpo said.\nThe Hornets pressed early, and tried to force the Bucks to find other ways to start the offense. The Hornets also had an effective wing defender in the 6-foot-8 Batum.\n\"Nic set the tone with his ball pressure, trying to disrupt the offense, which not many guys his size could do,\" Clifford said.\nWilliams finished with 13 points and 10 rebounds for Charlotte, a playoff team a year ago following a 48-win season.\nTIP INS\nHornets: C Cody Zeller, who did not play the entire preseason because of a right knee injury, was 5 of 6 from the field for 15 points in 14 minutes. ... C-F Frank Kaminsky missed the game with a strained right foot. Kaminsky was a star in college at Wisconsin, where he helped lead the Badgers to two Final Four appearances.\nBucks: Malcolm Brogdon played well in his NBA debut, serving as the point guard when Antetokounmpo and Matthew Dellavedova were off the court. Brogdon, a second-round draft pick, finished with eight points and five assists in 21 minutes.\nMOVIN' IT\nThe Bucks couldn't keep up with Charlotte's crisp ball movement in the first half, when the Hornets had 17 assists on 22 field goals to build a 15-point lead.\nKemba Walker finished with eight assists, six coming in the first half.\n\"We just stuck to our game plan. We made all the right plays. We didn't turn the ball over too much,\" Walker said. \"We got a lot of stops, pushed the tempo, we made shots.\"\nMOVING ON\nCharlotte lost Jeremy Lin, Courtney Lee and Al Jefferson to free agency in the offseason, bringing in Marco Belinelli, Ramon Sessions and Hibbert.\nThe new Hornets are fitting in quite nicely. Kidd-Gilchrist is back after playing just seven games last season.\nThe 7-foot-2 Hibbert had a couple of rim-rocking dunks in the third quarter that helped build the 20-point lead.\nWith Hibbert anchoring the middle defensively, Clifford likes the length and versatility provided by Batum and the 6-7 Kidd-Gilchrist.\nLONG SHOTS\nThe Bucks were haunted by familiar problems that carried over from last year's 33-win squad.\nMilwaukee was just 1 of 9 from behind the 3-point arc in the first half. Interior defense was also an issue and the Hornets took advantage of the scrambling Bucks by moving the ball quickly around the court.\nMilwaukee finished 3 of 16 from behind the arc. Charlotte was 7 of 23 from 3-point range, but their baskets came in clutch situations.\n\"The timely 3s hurt. For us they shot 30 percent from the 3-point line. We'll take that, but when you're behind, your margin of error, it's very slim,\" coach Jason Kidd said.\nUP NEXT\nHornets: At Miami on Friday.\nBucks: Host Nets on Saturday.\n---\nFollow Genaro Armas at: https://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764995235.6364071
}