{
  "game_id": "0021800960",
  "espn_id": "401071633",
  "date": "Mar 05, 2019",
  "matchup": "PHI vs. ORL",
  "headline": "Redick hits 6 3-pointers, 76ers hold off Magic 114-106",
  "body": "PHILADELPHIA --  Stuck in a slump, JJ Redick got a pep talk from his wife, played Legos with his sons and had a few therapeutic talks with his 76ers teammates.\n\nHe turned the positive thinking into his own calming message to coach Brett Brown: \"Look, I'm a big boy. I'll figure it out.\"\n\nRedick solved his shooting funk and hit six 3-pointers and scored 26 points to lead the Philadelphia 76ers to a 114-106 win over the Orlando Magic on Tuesday night.\n\n\"You're going to have these little blips sometimes where you hit a bad stretch,\" he said.\n\nRedick put the blips behind him to knock off an Orlando team in the mix with Charlotte and Miami for the eighth seed in the Eastern Conference playoffs. The Magic have been one of the more baffling teams of late, holding recent wins over Toronto, Golden State and Indiana and losing to Chicago, Cleveland and New York.\n\nThey couldn't complete the comeback against another top team late in the fourth. Nik Vucevic pulled the Magic to 101-99, but they missed five straight shots -- including Vucevic's in-and-out with 3:34 to go -- and Jimmy Butler stretched the lead with a spin move over Jonathan Isaac for a bucket in the paint. Isaac came back and buried a 3 to again slice the deficit to one, and again it was Butler who answered with a big bucket.\n\nButler had the assist on Mike Scott's third 3 of the game and the Sixers held on and improved their push for the third seed in the East. Ben Simmons had 16 points and 13 rebounds for the Sixers.\n\nEvan Fournier led the Magic with 25 points and Aaron Gordon had 24, but the series of missed shots in the waning moments could cost them a playoff spot.\n\n\"You want to win this game on the road against a team like that, you've got to make those shots,\" Magic coach Steve Clifford said. \"You've got to be able to handle these losses and come back or we don't deserve to be a playoff team.\"\n\nSimmons and Joel Embiid are the All-Stars who have carried the Sixers from \"Process\" to prominence. But it's Redick who keeps defenses honest as the team's lone reliable 3-point threat. The 34-year-old Redick entered as the only member of the Sixers to make at least 100 3s, and the Sixers scuffled as he endured his longest dry spell of the season. Consider, in a three-point loss to Golden State on Saturday, Redick missed all 3 attempts.\n\n\"It was a low point for me,\" Redick said. \"My focus was just on these next chunk of games and there's nothing you can do about a five-game stretch where you're shooting 4 percent, or whatever it was.\"\n\nAgainst the Magic, Redick shot like the guard who deserved serious All-Star consideration. He was 5 of 6 from 3-point range in the first half (7 of 10 overall) and paced an offense that shot 64 percent in the half and led 70-64.\n\nRedick had been seriously slumping -- he was 23 of 81 overall over his last seven games and hit 15 3s. Redick, who had his first 20-point game since Feb. 10 against the Lakers, has played his best ball with Embiid in the lineup, but the big man missed his sixth straight game with a sore left knee.\n\nBrown was confident Redick was on the brink of delivering a big game\n\n\"Great shooters shoot. It's 82 games,\" Brown said. \"He had a few games where he was not himself. Some of that you give credit, to the Golden State Warriors as an example. Other bits, it's just part of the flow of an 82-game, six-month season. He will respond. He's that competitive, and that good.\"\n\nTIP-INS\n\nMagic: The Magic played without guard Markelle Fultz, the former Sixer and No. 1 pick of the 2017 draft. The Sixers traded Fultz to the Magic at the deadline and rid themselves of one of the more confounding players in team history. Fultz had a series of injuries that cost him time (notably thoracic outlet syndrome) and a mental block his former trainer attributed to the \"yips.\" Fultz played 19 games this season and is not expected to play for Orlando the rest of the way. Brown called Fultz \"an elite person\" and added of the 20-year-old guard, \"I hope he can resurface. I believe he will.\"\n\n76ers: Brown said Embiid could at least join the Sixers for their game Friday at Houston. ... Big man Jonah Bolden sat out with an illness.\n\nUP NEXT\n\nOrlando: Hosts Dallas on Friday\n\nSixers: At Chicago on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994005.765373
}