{
  "game_id": "0022200413",
  "espn_id": "401468568",
  "date": "Dec 13, 2022",
  "matchup": "LAL vs. BOS",
  "headline": "Celtics blow big lead, rally back, beat Lakers 122-118 in OT",
  "body": "LOS ANGELES -- — Jayson Tatum scored 44 points, Jaylen Brown added five of his 25 in overtime, and the Boston Celtics blew a 20-point lead in the second half before rallying from a late 13-point deficit for a thrilling 122-118 victory over the Los Angeles Lakers on Tuesday night.\n\n\r\n              Marcus Smart hit four 3-pointers and scored 18 points for the NBA-leading Celtics, who wrapped up their six-game trip by avoiding their first three-game losing streak of the season.\n\n\r\n              The old rivals played a wild second half in which the Lakers rallied from an 81-61 deficit midway through the third quarter with a 45-12 surge. Boston then erased Los Angeles’ 106-93 lead in the final 3:40 with a 17-4 run capped by Tatum’s tying jumper with 17.8 seconds left.\n\n\r\n              “That game just says a lot about our experience and mental toughness,” said Brown, who also had 15 rebounds. “That's a tough and perfect way to close out our road trip.”\n\n\r\n              Anthony Davis had 37 points and 12 rebounds, but he also missed two free throws with 28 seconds left, creating an opportunity for Tatum to send it to overtime.\n\n\r\n              LeBron James scored 33 points in a memorable chapter of the famed rivalry between the 17-time champion teams dubbed “the two pillars of our league” by new Lakers coach Darvin Ham.\n\n\r\n              “Everybody can talk about free throws, this and that, but the thing we can’t do is spot teams 15-, 17-, 20-point leads, give up 30-plus points per quarter in the first half,” Ham said. “We have to do a better job of coming out from the tipoff and pressing our will on our opponent.”\n\n\r\n              Russell Westbrook had 20 points and a season-high 14 rebounds for Los Angeles, but he also missed three open jumpers in overtime while the Celtics pulled away with 12 consecutive points.\n\n\r\n              “Games aren't won or lost in the fourth quarter or overtime,” Boston coach Joe Mazzulla said. “We have to be elite at managing the end of the third, beginning of the fourth quarter. That is where NBA games are won and lost, and we didn't do a good job managing that part of the game. So we'll take the positives of how we worked to get back in the game and then managed a run to end it, but we'll also focus on that stretch.”\n\n\r\n              In their first game back from a six-game trip, the Lakers lost for the fourth time in five games after an 8-2 stretch that breathed life into their slow-starting season.\n\n\r\n              James scored 22 points after halftime for Los Angeles, but Smart hit his fourth 3-pointer with 45.8 seconds left to trim the Lakers' lead to 110-108.\n\n\r\n              A weary Davis then bricked two free throws, echoing his miss on a potential winning free throw with 3.7 seconds left in regulation of what became an overtime loss for the Lakers at Philadelphia last Friday.\n\n\r\n              “I haven’t thought about the rest of the game,” Davis said. “To me, the rest doesn’t matter. Had a chance to ice the game, and missed both.”\n\n\r\n              Tatum coolly tied it with his 14-footer near the baseline, and James missed a 3-pointer at the regulation buzzer.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Al Horford missed his fifth straight game. He is expected back this weekend. ... Robert Williams remained out recovering from preseason knee surgery, but he is expected to make his season debut soon.\n\n\r\n              Lakers: James had the 516th 30-point game of his career, passing Wilt Chamberlain for second-most in NBA history. ... Dennis Schröder had two points and one assist against his former team. ... Wenyen Gabriel missed his fifth straight game with a left shoulder sprain.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Orlando on Friday.\n\n\r\n              Lakers: Host Denver on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995052.509655
}