{
  "game_id": "0022401170",
  "espn_id": "401705736",
  "date": "Apr 10, 2025",
  "matchup": "MEM vs. MIN",
  "headline": "Anthony Edwards scores 44, Wolves pour in 52 points in 3rd and beat Grizzlies 141-125",
  "body": "MEMPHIS, Tenn. -- — Anthony Edwards scored 44 points, including 18 during Minnesota's franchise-record, 52-point third quarter, and the Timberwolves beat the Memphis Grizzlies 141-125 on Thursday night in a game between teams fighting to avoid the play-in tournament. \n\n\r\n              Julius Randle added 31 points and 10 rebounds for the Wolves, who broke open the game with the highest-scoring quarter in the NBA this season. Edwards was 5 for 5 in the third and Randle scored 14 points as Minnesota made 18 of 21 shots (85.7%).\n\n\r\n              Naz Reid finished with 14 points as Minnesota won its sixth in the last seven, and joined the Golden State Warriors and Grizzlies tied in the sixth through eighth spots in the Western Conference at 47-33.\n\n\r\n              Ja Morant led Memphis with 36 points, showing off a new celebration by pretending to throw a grenade into the crowd after making a 3-pointer. Desmond Bane added 28 and Jaren Jackson Jr. scored 23 as Memphis had its three-game winning streak snapped. \n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota bounced back after its collapse on Tuesday against Milwaukee, when the Wolves blew a 24-point lead and had their five-game winning streak snapped. \n\n\r\n              Grizzlies: The Grizzlies had shown life with a three-game winning streak under interim coach Tuomas Iisalo that had them on the verge of avoiding the play-in tournament. The loss may have hurt those chances. \n\n\r\n              Key moment\r\n              Minnesota opened the second half with a 26-5 burst, including 17 straight points. Randle spurred the run hitting his first five shots in the half. The Timberwolves would outscore Memphis 52-25 in the third.\n\n\r\n              Key stat\r\n              Memphis shot about 50% overall and from 3-point range. But the Grizzlies committed 15 turnovers leading to 23 Minnesota points.\n\n\r\n              Up next\r\n              Both teams play Friday night. The Timberwolves host Brooklyn, while the Grizzlies travel to Denver to face the Nuggets\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997587.860589
}