{
  "game_id": "0022401159",
  "espn_id": "401705725",
  "date": "Apr 09, 2025",
  "matchup": "DAL vs. LAL",
  "headline": "Luka Doncic scores 45 points in Dallas return as Lakers clinch playoff spot with 112-97 win",
  "body": "DALLAS -- — Luka Doncic scored 45 points in his first game in Dallas since being traded to the Los Angeles, helping the Lakers wrap up a playoff spot with a 112-97 victory over the Mavericks on Wednesday night. \n\n\r\n              Doncic's emotional return came two months after a seismic trade out of nowhere that sent the five-time All-Star to Los Angeles. The 26-year-old star from Slovenia spent his first 5 1/2 seasons with the Mavericks, and still had two seasons left on his contract.\n\n\r\n              The 45 points matched Doncic's season high — he did that once for Dallas and one other time for the Lakers. He also had eight rebounds, six assists and four steals. \n\n\r\n              LeBron James had 13 of his 27 points in the fourth quarter, when the Lakers fell behind before a strong finish. \n\n\r\n              Anthony Davis, who went from the Lakers to Dallas in the Doncic heal, had 13 points and 11 rebounds. Naji Marshall led the Mavs with 23 points and eight assists.\n\n\r\n              Takeaways\r\n              The Lakers remained third in the Western Conference standings after their third game in four days. They came to Dallas after splitting a pair of games at Western Conference-leading Oklahoma City. \n\n\r\n              Dallas (38-42) is guaranteed a losing record a year after making the NBA Finals. The Mavs are still in position to finish 10th and make the play-in tournament. \n\n\r\n              Key moment\r\n              James's three-point play with 8:10 left broke an 87-all tie and put the Lakers ahead to stay, and he added a layup 34 seconds later. That came after Dallas' 15-2 run.\n\n\r\n              Key stat\r\n              James' 1,561st career regular-season game moved him past Kareem Abdul-Jabbar for sole possession of second place on the NBA list. Only Robert Parrish with 1,611 has more than the 40-year-old James. It was his 418th game in seven seasons with the Lakers, after 849 games with Cleveland and 294 with Miami. \n\n\r\n              Up next\r\n              Both teams play their regular-season home finales Friday night, when the Mavericks take on Toronto, and the Lakers host Houston. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997126.860276
}