{
  "game_id": "0022000674",
  "espn_id": "401307463",
  "date": "Mar 24, 2021",
  "matchup": "MEM @ OKC",
  "headline": "Grizzlies top Thunder 116-107 to move a game over .500",
  "body": "OKLAHOMA CITY -- — Dillon Brooks matched a season high with 25 points, and the Memphis Grizzlies defeated the Oklahoma City Thunder 116-107 on Wednesday night in the opening game of a four-game trip.\n\n\r\n                    Grayson Allen scored 20 points and Jonas Valanciunas added 16 points and 15 rebounds for the Grizzlies, who have won four of five to move one game above .500 for the season.\n\n\r\n                    The Grizzlies trailed by 12 in the third quarter, but they closed out the quarter on a 33-12 run to take control for good.\n\n\r\n                    “I hit them really hard at halftime about our undisciplined-ness, our inability to keep the Thunder in front of us -- something that we talked about before the game multiple times,\" Grizzlies coach Taylor Jenkins said. \"We had a lack of competitiveness on the ball, we were turning the ball over, missing some shots, not getting set defensively.”\n\n\r\n                    Memphis guard Ja Morant said the Grizzlies listened to their coach, and got to work.\n\n\r\n                    “I just feel like we picked up our defensive effort,” he said. “We were able to get stops and play in transition, which we like to do -- get out and run. And it opened up a lot for us on the offensive end, got our offense going.”\n\n\r\n                    Moses Brown had 19 points and 12 rebounds, and Al Horford added 13 points, eight rebounds and six assists for the Thunder. \n\n\r\n                    Shai Gilgeous-Alexander, who leads Oklahoma City with 23.7 points per game, was out with plantar fasciitis in his right foot. Coach Mark Daigneault said before the game that there is no set timetable for his return.\n\n\r\n                    “I don’t want to use long term because it’s vague, but it’s not day-to-day,\" Daigneault said. \"It’s going to be a more significant amount of time than day-to-day. This one is now an injury that we need to take a look at.”\n\n\r\n                    The Thunder led 53-49 at halftime behind the play of centers Horford and Brown. Horford had 11 points, six rebounds and six assists at halftime, while Brown had 10 points and 10 rebounds in just 14 minutes. \n\n\r\n                    The Thunder went on a 6-0 run in the first 54 seconds of the third quarter that included a layup and a dunk by Aleksej Pokusevski. \n\n\r\n                    Oklahoma City pushed its lead to 12 before the Grizzlies responded with a flurry. A dunk by Brooks put the Grizzlies ahead, and he followed with a 3-pointer that gave Memphis a 67-63 lead and caused the Thunder to call a timeout. Memphis expanded its lead to 82-73 at the end of the third quarter and remained in control the rest of the way.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Morant scored two points on 1-for-7 shooting in the first half. He made 4 of 7 shots in the second half to finish with 11 points, seven assists and five rebounds. He averages just over 19 points for the season. ... It was Morant's 100th NBA game. ... De'Anthony Melton scored 11 of his 14 points in the fourth quarter.\n\n\r\n                    Thunder: Starting forward Darius Bazley missed the game with a left shoulder contusion. ... Shot 61% in the second quarter. ... Made 10 of 35 3-pointers. ... Had seven players score in double figures.\n\n\r\n                    MORE BOARDS\n\n\r\n                    Valanciunas increased his streak of consecutive games with at least 10 rebounds to 11. It is the longest active streak in the league.\n\n\r\n                    MOSES BROWN\n\n\r\n                    Brown grabbed at least 12 rebounds for the fourth time in his last five games. The second-year player who has spent time in the G-League this season earned praise from Horford.\n\n\r\n                    NOT PERFECT\n\n\r\n                    Thunder guard Ty Jerome made all five of his 3-pointers Monday at Minnesota. He went 3 for 7 against Memphis. He is shooting 45.5% from deep this season.\n\n\r\n                    THE THROWDOWN\n\n\r\n                    Allen's driving one-handed jam with the 7-foot Pokusevski defending cut Oklahoma City's lead to four at halftime.\n\n\r\n                    “I got an open lane to the rim and my eyes kind of lit up as soon as I got that lane,\" Allen said. \"I was able to kind of get to that launching pad and get the one-two down and get up. I know I've still got that bounce.”\n\n\r\n                    UP NEXT\n\n\r\n                    The Grizzlies visit the Utah Jazz for a pair of games Friday and Saturday.\n\n\r\n                    The Thunder host the Boston Celtics on Saturday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996948.358645
}