{
  "game_id": "0021600538",
  "espn_id": "400899959",
  "date": "Jan 05, 2017",
  "matchup": "CHA @ DET",
  "headline": "Pistons hold off Hornets when Belinelli's shot is too late",
  "body": "AUBURN HILLS, Mich. -- It was a shot that would have been replayed for years -- if it had actually counted.\nInstead, Marco Belinelli gets points for creativity, but the Detroit Pistons held on for the win.\nBelinelli's bank shot from 3-point range was disallowed because it came too late, and his Charlotte Hornets lost 115-114 to the Pistons on Thursday night. With Charlotte down by one, Belinelli was inbounding from the sideline with 0.5 seconds left. He bounced the ball off a defender and back to himself, then quickly released a wild shot that went in off the glass.\nThe basket was waved off immediately, and a video review confirmed that Belinelli hadn't beaten the buzzer.\nIt was close, though.\n\"It was a good idea by Marco, but with 0.5 seconds left, you probably don't have time to do anything where more than one person touches the ball,\" Hornets coach Steve Clifford said.\nKemba Walker scored 20 of his 32 points in the final period, helping Charlotte rally from a 19-point fourth-quarter deficit.\nReggie Jackson put Detroit up 115-113 when he made two free throws with 1.9 seconds remaining. Marcus Morris was called for a foul while Charlotte was trying to inbound at the other end, giving the Hornets one free throw and the ball. Belinelli made it to pull Charlotte within one.\nJackson knocked the ensuing inbounds pass out of bounds, leaving 0.5 seconds on the clock. Belinelli then tried his tricky move, but there wasn't quite enough time to pull it off.\nBoban Marjanovic had 15 points and a career-high 19 rebounds, helping the Pistons overcome Andre Drummond's foul trouble. The 7-foot-3 Marjanovic had played only 76 minutes all season, but the Pistons had little choice but to go to him when Drummond was whistled for his second foul with 6:42 left in the first quarter. Backup center Aron Baynes was out with a sprained left ankle.\nBy halftime, Marjanovic had 10 points and 11 rebounds, eight of which came at the offensive end. The Hornets didn't seem ready for the 28-year-old from Serbia, who was able to position himself near the basket and simply reach above other players for rebounds.\n\"Great, great, great effort,\" Detroit coach Stan Van Gundy said. \"Even ran the floor a couple of times for post seals.\"\nDrummond picked up his fourth foul with 10:42 remaining in the third, so Marjanovic came back in and grabbed seven more rebounds by the time that period was over. He finished the game with only four field goal attempts and was 9 of 11 on free throws.\n\"I (have) good size,\" Marjanovic said. \"They don't allow me to make easy baskets. They put me on free throw line.\"\nDetroit scored the final nine points of the third and led 85-70 after Morris made a 33-footer at the buzzer. Charlotte then scored 44 points in the fourth, and the game came down to the wire.\nTobias Harris scored 25 points for the Pistons, and Jackson had 22 points and 11 assists.\nTIP-INS\nHornets: Charlotte was 5 of 22 from the field in the second quarter but still outscored Detroit 22-21 in the period. The Hornets trailed 58-48 at halftime. ... The Hornets were without 7-footer Cody Zeller, who has been going through the NBA's concussion protocol.\nPistons: Detroit had lost eight of 10. ... Morris had 20 points and 10 rebounds.\nTURNOVERS\nThe Pistons and Hornets came into the game averaging 12 turnovers apiece -- the best marks in the NBA. They combined for 12 in this game -- five for Charlotte and seven for Detroit.\nUP NEXT\nHornets: At San Antonio on Saturday night in the second of five straight games on the road.\nPistons: At Portland on Saturday night to start a five-game trip of their own.\n---\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764995511.69245
}