{
  "game_id": "0022200148",
  "espn_id": "401468303",
  "date": "Nov 07, 2022",
  "matchup": "PHX @ PHI",
  "headline": "Embiid has double-double in return, 76ers beat Suns 100-88",
  "body": "PHILADELPHIA -- — Joel Embiid had 33 points and 10 rebounds in his return after missing three games with the flu, Georges Niang scored 21 points on 7-for-10 shooting on 3-pointers, and the Philadelphia 76ers beat the Phoenix Suns 100-88 on Monday night.\n\n\r\n              Tobias Harris added 21 points and Tyrese Maxey had 11 on 4-for-18 shooting from the field to help the 76ers win for the second time in six games.\n\n\r\n              “Our season began today,” Embiid said. “Everything before tonight didn’t count. The Phillies season is over and I enjoyed watching them, and this was our first game since then, so this was the first game of the season.”\n\n\r\n              Devin Booker scored 28 points for the Suns, who have lost two of three after winning seven of their first eight games to begin the season. Mikal Bridges had 15 points, and Cameron Payne and DeAndre Ayton each added 14.\n\n\r\n              Embiid had been struggling in practice with maintaining stamina as a result of breathing issues related to his flu recovery. He was dominant in his return, adding five assists and shooting 16-for-16 from the free-throw line in 36 minutes. \n\n\r\n              “Forget about Joel, let’s talk about Georges Niang,” Harris joked after the game. “Every time they made a run, Georges was there to make a big shot. Especially in the fourth quarter. He would stretch the lead from six to nine or seven to 10 and eventually it deflated them.”\n\n\r\n              Niang helped keep the Suns at bay as they tried to rally from a 19-point deficit. Damion Lee's 3-pointer pulled Phoenix to 78-74 early in the fourth quarter. However, Niang made three 3s as the 76ers closed with a 22-14 run the rest of the way.\n\n\r\n              “We didn’t give him the respect he deserves,” Suns coach Monty Williams said. “I think 75 percent of his shots come from 3. We’re a shift team, but we shifted off of him too much.”\n\n\r\n              Niang missed the only 2-point shot he attempted.\n\n\r\n              LET’S GET PHYSICAL\n\n\r\n              Both Philadelphia and Phoenix play physical, and the tempo was set early with the officials letting the teams play with a little more contact than usual. \n\n\r\n              Still, the two teams combined for 41 personal fouls, with six players picking up four fouls or more. \n\n\r\n              Harris and Philadelphia coach Doc Rivers praised De’Anthony Melton, who was tasked with guarding Booker for much of the night, but it was Embiid who called Melton a “monster” defensively. \n\n\r\n              Despite Booker's scoring total and Melton picking up five fouls, Melton finished plus-12 while on the floor and Booker was minus-9. \n\n\r\n              TIP-INS\n\n\r\n              76ers: Philadelphia coach Doc Rivers was preaching patience – even with his own coaching staff – when it comes to Maxey filling in for the injured James Harden at point guard. He said that as talented as he is, Maxey is still young and is sometimes missing the plays that the Sixers have designed. “When I was playing, if a player wasn’t where he’s supposed to be, I’d pull it back out and tell my teammate where to go,” Rivers said. “Tyrese isn’t seeing yet. He’ll still try to make the play and make a turnover. Those are the little things you have to live with right now.\" ... F Danuel House Jr. remained out with flu symptoms. \n\n\r\n              Suns: G Chris Paul started the game, but gingerly left the court in the second period and did not return to the lineup. According to the Suns, Paul was dealing with right heel soreness. He had two points, two assists, two rebounds and two steals in 13:45.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Minnesota on Wednesday night.\n\n\r\n              76ers: At Atlanta on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995094.102657
}