{
  "game_id": "0022300931",
  "espn_id": "401585559",
  "date": "Mar 10, 2024",
  "matchup": "MEM @ OKC",
  "headline": "Gilgeous-Alexander scores 23 in 3 quarters as Thunder blow out Grizzlies 124-93",
  "body": "OKLAHOMA CITY -- — The Oklahoma City Thunder took no chances against the struggling Memphis Grizzlies.\n\n\r\n              Shai Gilgeous-Alexander had 23 points and six assists in three quarters and the Oklahoma City Thunder rolled past the Memphis Grizzlies 124-93 on Sunday night. \n\n\r\n              Rookie Cason Wallace scored a season-high 22 points, Josh Giddey had 16 points and 10 rebounds and Lu Dort scored 14 points and made all four of his 3-point tries for the Thunder. Oklahoma City won its third straight to stay at the top of the Western Conference standings.\n\n\r\n              Oklahoma City opened up a 22-8 lead midway through the first quarter and never looked back.\n\n\r\n              “They got guys fighting for contracts, fighting for minutes, and that’s a dangerous team to play,\" Giddey said, \"And I thought we did a good job of playing the game, not the opponent.” \n\n\r\n              The only bad news for the Thunder came when No. 2 scorer Jalen Williams left in the second quarter with a sprained right ankle and did not return. Thunder coach Mark Daigneault offered no update after the game, saying the team would look at it in the morning.\n\n\r\n              Rookie GG Jackson II scored a season-high 30 points in just his second career start and Jaren Jackson Jr. added 16 for Memphis, which has lost seven of nine. \n\n\r\n              The Grizzlies were short-handed, as has been the case much of the season. Star guard Ja Morant has missed most of the season. Desmond Bane remained out with a sprained left ankle and Marcus Smart was still out with an injured finger on his right hand, among other injuries for Memphis. \n\n\r\n              The Grizzlies started their 38th starting lineup of the season Sunday.\n\n\r\n              “Yeah, it’s a challenge,\" Grizzlies coach Taylor Jenkins said. \"You’ve got to accept it. You’ve got to accept the reality. I mean, every game’s a different starting lineup, different depth, who’s in and who’s out. It’s a challenge, but these guys go and they compete hard. Trying to find chemistry is definitely a challenge. But we’re putting the work in. \n\n\r\n              \"Tonight just wasn’t our game and we’ll be better on Tuesday.”\n\n\r\n              Giddey sparked the Thunder early with 11 points, four rebounds and three assists in the first quarter to help Oklahoma City take a 38-24 lead.\n\n\r\n              Daigneault said it was important for Oklahoma City to start strong.\n\n\r\n              “I mean, you see games every night in the NBA where a team’s banged up or a team with a lesser record knocks off a team with a better record,\" he said. \"And so I never take for granted when we give that kind of energy output. And it was from the jump.”\n\n\r\n              Gilgeous-Alexander scored 15 points in the first half and the Thunder made 11 3-pointers before the break to take a 64-43 lead. Oklahoma City shot 57% in the first half.\n\n\r\n              Oklahoma City poured it on in the third quarter. A steal and two-handed dunk by Dort put the Thunder ahead 90-57 with just under five minutes remaining in the period. Aaron Wiggins dunked on Jaren Jackson Jr. on a fast break to give Oklahoma City a 99-63 lead. The Thunder led 102-68 after three quarters.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host the Washington Wizards on Tuesday.\n\n\r\n              Thunder: Host the Indiana Pacers on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995997.992491
}