{
  "game_id": "0021800725",
  "espn_id": "401071398",
  "date": "Jan 25, 2019",
  "matchup": "SAC @ MEM",
  "headline": "Hield, Fox lead Sacramento to 99-96 victory over Grizzlies",
  "body": "MEMPHIS, Tenn. --  The Sacramento Kings made the right plays down the stretch to end their losing streak and extend the Memphis Grizzlies' miseries.\n\nBuddy Hield scored 26 points and De'Aaron Fox added 22, including a key 19-footer in the final minute, to help the Kings to a 99-96 victory over the Grizzlies on Friday night.\n\nThe loss was Memphis' eighth straight and 14th in the last 15 games as the team tries to hold itself together amid trade rumors involving star Mike Conley and Marc Gasol.\n\nFor Sacramento, the win was a welcome relief after a two-game slide. The Kings climbed above .500 (25-24) and -- while they are in 10th in the Western Conference -- they remain only two games behind the sixth-place team.\n\nFox provided the cushion to help the Kings down a weird stretch in the closing seconds.\n\nA layup by Memphis guard Shelvin Mack cut the Kings' lead to 96-94 with 32.8 seconds left.\n\nBut on the ensuing possession, Fox broke loose and hit the step-back jumper near the top of the key that gave Sacramento a 98-94 advantage.\n\n\"De'Aaron made a heck of a shot there to put us up four, which was terrific. But we battled,\" said Kings coach Dave Joerger, who characterized the game as \"a crazy win.\"\n\nFox added: \"I just made a tough shot. That's all it was.\"\n\nBut there was still some craziness left after Fox's jumper. The Grizzlies had a chance in the closing seconds to overtake the Kings, but had a call go against them.\n\nWith 4.3 seconds left, Memphis appeared to trap Hield along the sideline in the backcourt when whistles blew. One official called a jump ball and another called a foul on Mack. After the crew got together, the foul was upheld, and Hield hit one of the two ensuing free throws for the final margin.\n\n\"I don't understand how that works to be honest with you,\" said a dejected J.B. Bickerstaff, the Memphis coach. \"The referee that was on the call, called a jump ball, and then he was overruled by another official. . It was clear to everybody in the arena that he called a jump ball.\"\n\nNemanja Bjelica finished with 17 points and 11 rebounds for the Kings.\n\nOmri Casspi led the Grizzlies with 18 points, while Conley added 16 points and nine assists. JaMychal Green finished with 14 points for the Grizzlies, who have won only one game since the day after Christmas.\n\n\"We lost. That's pretty much it,\" Memphis rookie forward Jaren Jackson Jr. said after scoring 11 points.\n\nTIP-INS\n\nKings: Fox had a steal in the fourth quarter, his 18th straight game recording a steal. He entered the game averaging 1.77 steals, seventh-best in the league. ... Rookie Marvin Bagley III, who started the first game of his career when the Kings played Toronto earlier this week, returned to his reserve role. He finished with 14 points. .. .Hield, who was 6 of 9 from outside the arc, made three straight 3-pointers spanning the third and fourth quarters.\n\nGrizzlies: F Bruno Caboclo, who signed to a 10-day contract on Thursday, made his first appearance in the third quarter. He played 8 minutes, but did not score. .Reserve C Joakim Noel returned to the roster after missing the previous three games for \"personal reasons.\" . F Garrett Temple left the floor late in the first quarter with a left shoulder injury. He did not return. \"X-rays were negative,\" Bickerstaff said. \"He's going to get an MRI (Saturday), and we'll see from there.\"\n\nMUST-WIN\n\nWith a two-game slide, it was important for the Kings to get back on track before facing the Clippers in Los Angeles on Sunday to close out a six-game trip. The Clippers are one of the teams ahead of Sacramento in the standings. And Fox noted Hield's contribution to breaking the losing streak. \"With us trying to stay in the playoff race, we definitely need games like that,\" the Kings guard said. \"When we play well, we live with the results.\"\n\nUP NEXT\n\nKings: Close out a six-game trip on Sunday in Los Angeles against the Clippers.\n\nGrizzlies: Host the Indiana Pacers on Saturday\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994190.4720771
}