{
  "game_id": "0021500384",
  "espn_id": "400828271",
  "date": "Dec 17, 2015",
  "matchup": "OKC @ CLE",
  "headline": "LeBron crashes into crowd, fan hurt as Cavaliers top Thunder",
  "body": "CLEVELAND -- Unable to stop himself, LeBron James launched his 250-pound body into the air, crashing hard into the lap of a courtside spectator unable to get out of his way.\nHe had no idea he'd just plowed over the wife of PGA champion Jason Day.\nThere was nothing anyone could do.\nScrambling for a loose ball, the Cavaliers star flattened Ellie Day, sending her to the hospital during the fourth quarter of Cleveland's 104-100 win over the Oklahoma City Thunder on Thursday night.\n\nEllie Day was treated and released from MetroHealth Medical Center early Friday morning, according to hospital spokeswoman Tina Shaerban Arundel.\nIn an instant, the final minutes of an NBA game had become almost trivial.\nEllie Day, who gave birth to her second child last month, was carried from Quicken Loans Arena on a backboard, placed on a stretcher with her head immobilized and taken to the hospital. She was accompanied from the building by her husband, who moments before the collision had chipped foam basketballs to the crowd as part of a promotion.\nAs she was being treated by medical personnel inside the arena, James came over to check on her, grabbing her hand.\n\"She squeezed my hand and said she was fine,\" James said. \"I think she was just a little weary. For me, obviously, her health is very important and hopefully she is doing well. The guys told me she's doing great now. For me, just going for a loose ball, I tried to keep the possession going, I just hate that that was the end result.\"\nJames was on his way to a 33-point, 11-assist, nine-rebound performance when the collision took place with 5 minutes left.\nAn hour after the game, James tweeted: \"Ellie Day I hope you're doing okay! My apologies! Hope u guys come back to another game soon. Love LJ!\"\nJason Day, the No. 2-ranked golfer in the world, won the PGA Championship this year for his first major win on the PGA Tour. On Nov. 11, Ellie Day gave birth to the couple's second child, a girl named Lucy.\nAs his wife was being checked by medical staff, a concerned Jason Day looked on as the Cavs and Thunder played a frantic final few minutes.\nThe Days live in suburban Columbus and have attended Cleveland games in the past. Ellie Day was pregnant when she went to an exhibition game earlier this year. That night on Ohio State's campus, Cavs guard J.R. Smith bought cotton candy for the Days' son, Dash, while he sat on the bench.\nCavs coach David Blatt said he didn't see the full impact of the collision. Blatt has long been nervous about the safety of fans sitting so close to the action.\n\"Honestly, the only thing I saw was LeBron diving for the ball to save the ball,\" Blatt said. \"I kind of got blocked and just saw a sea of bodies. We all hope that she's OK. It's always concerned me, the sideline seats. Always concerned me, because things like that, when you're talking about players of this speed and physicality and effort level, it's not a simple thing.\n\"The powers that be are the ones that really need to decide how to deal with that. He made an honest attempt at the basketball, that's all, obviously. We all hope she's OK.\"\nTristan Thompson had 15 rebounds for the Cavs, who improved to 11-1 at home.\nRussell Westbrook scored 27 and Kevin Durant 25 for the Thunder, who had won six in a row. Oklahoma City was down 98-89 with three minutes left and closed within 103-100, but both Durant and Westbrook missed 3-pointers in the final 10 seconds.\nThe Cavaliers were missing guards Mo Williams (thumb), Iman Shumpert (groin) and Kyrie Irving, who could make his season debut Sunday against Philadelphia.\nThompson added 12 points and his energy kept the Cavs close in the third quarter. Richard Jefferson added 13 points off the bench for Cleveland, now 31-2 in regular season games at home since Jan. 15.\nWith the Cavs down 78-74 to start the fourth, Kevin Love made two critical plays to swing the momentum for Cleveland.\nFirst, he pump faked Nick Collison in the air to draw contact and dropped a 3-pointer while being fouled. After knocking down his free throw, Love grabbed a rebound on the defensive end and heaved a look outlet pass to a waiting James, who was bumped before dropping in his layup to put the Cavs up 80-78.\nAs James went to the line, Love walked over following his deep completion and slapped hands with Browns quarterback Johnny Manziel, who was sitting courtside.\nMUSIC MAN\nAs usual, James got ready for the game while listening to music at his locker room. A huge hip-hop fan, James, who was turned onto the music as a kid by an uncle, was pleased to learn that rap icons N.W.A. will be part of the next class inducted into the Rock and Roll Hall of Fame, based in Cleveland.\n\"I understood that their music was much bigger than them just writing, jotting lyrics on a piece of paper and rapping them or singing them,\" he said. \"They had a bigger meaning and it was a big pop culture thing, not only for the West Coast and Compton, California, but also for every inner-city `hood in America.\"\nSCORING KING\nDurant has already won four scoring titles. He entered the night with 16,056 points, and James believes that Durant, as long as he stays healthy and has a long career, can one day challenge Kareem Abdul-Jabbar's scoring mark of 38,387 points.\n\"His ability to score the ball is obviously up there with the greatest to ever play,\" James said. \"I know that's not in his memory bank right now, him trying to help the team get better and better, but long term he definitely can challenge that.\"\nTIP-INS\nThunder: Oklahoma City is 6-7 against the East and 11-2 versus the West. ... G Anthony Morrow was not with the team because of a personal matter. ... Former Cavs G Dion Waiters was booed when he entered the game in the first quarter. Waiters was traded by Cleveland last season. He finished with 4 points.\nCavaliers: The Cavs observed a moment of remembrance before the game for center John \"Hot Rod\" Williams, who died last week at 53. Williams was a member of those talented Cleveland teams, which included Mark Price, Brad Daugherty and always lost to the Michael-Jordan led Bulls in the playoffs in the 1980s-90s.\nUP NEXT\nThunder: Host Los Angeles Lakers on Saturday.\nCavaliers: Host Philadelphia on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994192.7665448
}