{
  "game_id": "0021900541",
  "espn_id": "401161183",
  "date": "Jan 06, 2020",
  "matchup": "OKC @ PHI",
  "headline": "Embiid, with dislocated finger, leads 76ers past Thunder",
  "body": "PHILADELPHIA --  Joel Embiid's left ring finger looked like the top of a used bendy drinking straw, grotesquely overlapping his pinkie to the point that it seemed he had his fingers crossed.\n\n\"I nearly threw up when I saw that,\" 76ers guard Ben Simmons said.\n\nSo gross.\n\nSimmons' stomach was soon settled, and so were the Sixers when Embiid needed nothing more than a quick trip to the locker room and some tape. Embiid played through the unsightly injury and scored 18 points, Simmons had 17 points and 15 rebounds and Philadelphia snapped a four-game losing streak, beating the Oklahoma City Thunder 120-113 on Monday night.\n\n\"I'm glad he came back out,\" Simmons said. \"We needed him. He's a big part of this team.\"\n\nThe 76ers lost all four games on a trip that knocked them down the Eastern Conference standings and raised questions about how far this team can go in the playoffs.\n\nThey usually last in the postseason as long as a healthy Embiid can take them. The All-Star center dislocated his finger in the first quarter. Embiid returned to start the second quarter, though the injury prevented him from playing with his usual force on the glass and he lost a bunch of rebounds to Steven Adams.\n\n\"I felt my finger snapping and I thought I fractured it,\" Embiid said. \"They did some X-rays and said it was nothing.\"\n\nEmbiid said there was a chance he might not play Thursday against Boston.\n\n\"I couldn't go up with two hands,\" Embiid said. \"There were a couple of times I could have grabbed with both hands but I just couldn't. I just kept tapping it.\"\n\nThe Thunder, who had won five straight, closed within two with 3 minutes left before the Sixers scored nine straight points to put the game away. Embiid's fingers looked fine on a dish to Tobias Harris for a dunk, and Harris buried a 3 to make it 115-106.\n\nAdams had 24 points and 15 rebounds, and Chris Paul scored 18 points.\n\n\"We've gotten down and these guys always fight back,\" Thunder coach Billy Donovan said.\n\nJosh Richardson scored 23 points for the Sixers, and Simmons fell two assists shy of a triple-double in another solid game without a basket beyond 22 feet.\n\nSimmons is an All-Star and triple-double threat but for whatever reason, he won't shoot 3-pointers. His only two career 3s have come this season and after he made one in a Dec. 7 win against Cleveland, coach Brett Brown implored Simmons to shoot more of them.\n\n\"This is what I want,\" Brown said that night. \"I want a 3-point shot per game, minimum. He will be liberated. His world will open up and, in many ways, so will ours.\"\n\nSimmons responded to Brown's edict by doubling down on his refusal to shoot 3s. He had a meaningless heave in a Dec. 10 game against Denver but otherwise has not attempted an honest 3.\n\nBrown acknowledged Simmons has disregarded his request.\n\n\"Evidently, I have failed,\" Brown said. \"It's something that we're all mindful and this is one of these things that is never going to go away. The attention that this has received is remarkable. I guess I helped fuel it. I own it. I've got to help him find this and most importantly he has to help himself.\"\n\nThe Sixers need more 3-point shooting, period. They made only six in each of the last two losses and returned home hopeful of finding the stroke that saw them hit a franchise record-tying 21 3s in a Christmas Day win over Milwaukee.\n\n\"This team needs to find more 3-point opportunities. We do,\" Brown said. \"We need to hunt 3s in a more definitive way than we currently are.\"\n\nThe 76ers got that message, at least early, and they finished an efficient 13 for 26 on 3s.\n\nHarris hit three of Philly's eight 3s (on 14 attempts) in the first half for a 62-52 lead at the break. But they hit just two in the third -- and whiffed on a few easy looks at the basket -- and had their 14-point lead sliced to 90-86.\n\nTIP-INS\n\nThunder: Missed 10 of 31 free throws. Dennis Schroder scored 21 points.\n\n76ers: Shot 51% from the floor.\n\nOLD FRIENDS\n\nDonovan coached 76ers F Al Horford to consecutive NCAA championships at Florida and remains a fan of the All-Star.\n\n\"That's the one thing with Al, he can figure out and look at the dynamics of the team and then he can figure out what he's got to do to impact the team,\" Donovan said. \"He's got a really good awareness of what he needs to do to help the group.\"\n\nUP NEXT\n\nThe Thunder finish their trip Tuesday in Brooklyn.\n\nThe Sixers host the Celtics on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996228.269931
}