{
  "game_id": "0022300698",
  "espn_id": "401585326",
  "date": "Feb 03, 2024",
  "matchup": "BKN @ PHI",
  "headline": "Cam Thomas scores 40 points, Nets rout short-handed 76ers 136-121",
  "body": "PHILADELPHIA -- — Cam Thomas scored 40 points, Mikal Bridges had 23 and the Brooklyn Nets routed the short-handed Philadelphia 76ers 136-121 on Saturday night.\n\n\r\n              The Nets snapped their nine-game losing streak against Philadelphia — including four straight last year against the 76ers during the first round of the NBA playoffs — dating to March 10, 2022. \n\n\r\n              “We started out well and the ball was finding the open man,” said Thomas, who had his third game of 40 or more points this season and seventh of his two-year NBA career. “Everybody was making shots. It was a great thing that we started out well and today was another good start. We have to keep it up.”\n\n\r\n              Philadelphia was without Joel Embiid, the reigning NBA MVP who missed his second game after sustaining a left meniscus injury Tuesday night at Golden State. Philadelphia is 4-10 in the 14 games without Embiid this season.\n\n\r\n              “It was a tough one tonight with the manpower, but I don't like to use any excuses,” 76ers coach Nick Nurse said. “We still should have tried to play a little better — especially at the defensive end and guard the three-point line. Obviously, we gave up way too many and way too many open ones.”\n\n\r\n              Thomas has averaged 36.3 points in his last four games and has drawn more defensive attention. But with the 76ers forced to collapse inside because of Embiid's absence, Thomas had several open looks — including a 10-minute stretch in the third quarter where he scored 21 points on 8-of-13 shooting to break it open.\n\n\r\n              “I've always felt that I was always on the scouting report because of my ability to score,” Thomas said. “Now, they aren't letting me get to (isolation) as much, so I have to get a mismatch and make a right read.”\n\n\r\n              Lonnie Walker IV added 20 points to help Brooklyn win for the third time in four games after losing 10 of 12. Ben Simmons — the former 76ers All-Star guard who was the subject of boos every time he touched the ball in his second game as a visitor at Wells Fargo Center — failed to score and had nine rebounds and five assists in 14 minutes for the Nets.\n\n\r\n              Two nights after scoring a career-high 51 points in a victory at Utah, Tyrese Maxey had 23 points for Philadelphia on 8-for-23 shooting. Terquavion Smith had 17 points, and Kelly Oubre Jr. 16 as the 76ers lost for the fifth time in six games. \n\n\r\n              Besides Embiid, the 76ers were without starters Tobias Harris (illness) and Nicolas Batum (left hamstring tightness) in addition to key reserves DeAnthony Melton (back) and Robert Covington (left knee meniscus injury).\n\n\r\n              “You try to get into simple acts like pick and roll, but they made it difficult because of the trap and did different things,” Maxey said. “You try to do the basic stuff that you learn in training camp, but there was a lot of different lineups and guys who haven't been playing together in situation.\"\n\n\r\n              The Nets were able to take advantage of the short-handed lineup with crisp ball movements that left Philadelphia's reserves scrambling. \n\n\r\n              ““We had a different pace in our group and our drive-and-kick was probably the best of the year,” Nets coach Jacque Vaughn said. \n\n\r\n              Nic Claxton took up a lot of room on the inside for Brooklyn, grabbing 15 rebounds to go along with 12 points. The Nets were 20 for 51 from 3-point range, led by 29 points and outrebounded Philadelphia 53-44.\n\n\r\n              “We've been trying to play that way with multiple shooters on the floor,” Vaughn said. “The fact that Joel was not at the rim was to our advantage tonight because we were able to get to the paint and see him staring at us. That piece was definitely in our favor.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Golden State on Monday night .\n\n\r\n              76ers: Host Dallas on Monday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996340.1946418
}