{
  "game_id": "0022300220",
  "espn_id": "401584848",
  "date": "Nov 20, 2023",
  "matchup": "MIA @ CHI",
  "headline": "Bam Adebayo scores 23 points as the Heat cruise to a 118-100 win over the Bulls",
  "body": "CHICAGO -- — Bam Adebayo scored 23 points and had 11 rebounds, and the Miami Heat blew out the Chicago Bulls 118-100 on Monday night, two nights after blowing a 21-point lead in the same building.\n\n\r\n              “We set the tone our last game too, we just let up a little bit, so I’m glad that we did not do that,” said Jimmy Butler, who rested on the bench for the entire fourth quarter. “I love that. Let my teammates be great. They can have all the minutes and I’ll sit back and relax and enjoy the show.”\n\n\r\n              Butler scored 16 points against his former team.\n\n\r\n              The Heat have now won eight of their last nine games after a 1-4 start to the season. Miami nailed a season-high 17 of 35 3-point attempts from the field despite sharpshooter Tyler Herro missing his sixth-straight game with a right ankle sprain.\n\n\r\n              “Sometimes you do have the opportunities to get better from tough losses,” Heat coach Erik Spolestra said. “We were all very disappointed with how the fourth quarter went the other night. We felt that we were in control for a large part of the game and wound up losing the game. That can humble you.”\n\n\r\n              For a fourth consecutive game, the Bulls faced a large deficit in front of their home fans, falling behind 12-2 less than three minutes in after Duncan Robinson made two early 3-pointers. Robinson scored 11 of his 22 points in the first quarter and has hit at least one 3-pointer in every game so far this season.\n\n\r\n              “Duncan, when he does cut, he’s cutting and he’s finishing well at the rim,” Butler said. “He’s throwing lobs, he’s getting layups. He’s making the right passes, he’s handling the pick-and-roll. He’s so comfortable, he’s so confident, just like everyone else around here.”\n\n\r\n              Coby White led the Bulls with a season-high 20 points, including four 3-pointers. Nikola Vucevic scored 18 points, and DeMar DeRozan added 15.\n\n\r\n              Zach LaVine was limited to 13 points on a season-low nine shot attempts. Alex Caruso also finished with 13 points along with a block and a steal. For the defensive-minded Caruso, six straight games with double-digit scoring is the longest streak of his career.\n\n\r\n              “We weren’t down 20-1 this game,” LaVine said, referencing the Bulls early deficit Saturday night. “So that’s a positive.”\n\n\r\n              Rookie forward Jaime Jaquez Jr. scored 19 points, while Kevin Love added 11 points with eight rebounds for a Heat bench unit that combined for 42 points, compared to just 21 for the Bulls’ reserves.\n\n\r\n              “It’s great to see how well the rook is playing,” Love said of Jaquez, a fellow UCLA product. “He was the one guy I watched more than anybody in his years at UCLA. I was tuning in watching him, love his game. I’m just happy I get to be on the right side of those dunks. He’s working extremely hard.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: Visit the Cleveland Cavaliers on Wednesday night.\n\n\r\n              Bulls: Begin a four-game road trip against the Oklahoma City Thunder on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995384.3574688
}