{
  "game_id": "0022300977",
  "espn_id": "401585605",
  "date": "Mar 17, 2024",
  "matchup": "MIA @ DET",
  "headline": "Bam Adebayo hits buzzer-beating 3 as the Heat topped the Pistons 104-101",
  "body": "DETROIT -- — Bam Adebayo made a 3-pointer at the buzzer to lift the Miami Heat to a 104-101 win over the Detroit Pistons on Sunday.\n\n\r\n              Cade Cunningham missed a 3-pointer for Detroit with 9 seconds left and Terry Rozier sprinted up the court with the rebound. He couldn't get to the basket, so he tossed the ball to Adebayo, who made the 12th 3-pointer of his seven-year career.\n\n\r\n              “Sometimes there's karma in this game,” Heat coach Erik Spoelstra said. “Bam was just outstanding for us, especially defensively, with all the things he was doing and everything he got on the glass. Sometimes the ball just happens to find that guy.”\n\n\r\n              A week ago, Adebayo was a career 11.8% 3-point shooter. He is 3 for 3 in the last three games, including Sunday's 30-footer from the top of the arc.\n\n\r\n              “I saw it was his fourth of the season, but that's basketball,” said Evan Fournier, who scored a season-high 18 points for Detroit. \n\n\r\n              Duncan Robinson scored a season-high 30 points for Miami on 10-for-15 shooting. Adebayo had 20 points and 17 rebounds as the Heat beat the Pistons for the second time in three days.\n\n\r\n              Robinson hit his 1,000th career 3-pointer in the first quarter. He reached the mark in 343 games, breaking the NBA record of 350 by Buddy Hield.\n\n\r\n              Cunningham had 17 points and nine assists, but he went 1 for 6 from beyond the arc.\n\n\r\n              The Pistons honored their 2004 NBA championship team at halftime, and one of the stars had encouraging words for a fanbase that hasn't seen a playoff win since 2008, or a 30-win season since 2018.\n\n\r\n              \"They’re going to be fine,” Portland Trail Blazers coach and 2004 Finals MVP Chauncey Billups said. “It just takes time.”\n\n\r\n              Miami played without Jimmy Butler, forcing Spoelstra to use his franchise-record 32nd starting lineup of the season.\n\n\r\n              “When you don't have Jimmy and you don't have Tyler (Herro), you have to maximize your next best actions,” he said. “Bam is always going to be involved, but Duncan hit on every aspect of the game offensively.”\n\n\r\n              Robinson converted a four-point play with 2:00 left, giving Miami a 101-96 lead. Isaiah Stewart’s 3-pointer cut the margin to two and Adebayo’s putback was ruled to come just after the shot clock expired.\n\n\r\n              Cunningham’s layup tied it, and Robinson turned the ball over to give Detroit a chance at its first lead of the game. \n\n\r\n              With the shot clock off, Cunningham took the 3-pointer earlier than expected.\n\n\r\n              “Maybe it was a little too much time, but if he hit the shot, no one would say a word,” Pistons coach Monty Williams said. “I'm not going to come down on anyone for that kind of possession.”\n\n\r\n              Miami led 90-85 with 6:33 left, thanks to a possession when Adebayo drew a foul and grabbed three offensive rebounds before tipping in the last one. But Fournier answered with his fourth 3 and Jalen Duren tied the game from the free-throw line.\n\n\r\n              The Heat led 60-50 at the half and increased the margin to 73-56 on Haywood Highsmith’s jump hook midway through the quarter.\n\n\r\n              UP NEXT\n\n\r\n              Heat: At the Philadelphia 76ers on Monday.\n\n\r\n              Pistons: At the Boston Celtics on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996523.064936
}