{
  "game_id": "0021600612",
  "espn_id": "400900033",
  "date": "Jan 15, 2017",
  "matchup": "LAL vs. DET",
  "headline": "Harris hits big 3, Pistons beat Lakers 102-97 to snap skid",
  "body": "LOS ANGELES -- Stan Van Gundy and the Detroit Pistons knew their Los Angeles-based team owner, Tom Gores, would be watching when they visited Staples Center.\nIt was a perfect time to snap a couple of losing streaks while allowing Gores to celebrate the Pistons' first win in his adopted hometown since he bought the team.\nTobias Harris scored 23 points and hit a decisive 3-pointer with 30.5 seconds to play, and Detroit ended a three-game skid with a 102-97 victory over the Los Angeles Lakers on Sunday night.\nMarcus Morris scored 23 points and Andre Drummond had 15 points and 17 rebounds for the Pistons, who wrapped up their longest trip of the season by beating the Lakers at Staples Center for the first time in seven tries since Nov. 14, 2008. They've also lost 11 straight to the Clippers, but Gores finally got to congratulate his Pistons after a game in LA.\n\"Every one of us in this organization knows we've got a great owner, and we know we haven't delivered a win here since he's owned the team,\" Van Gundy said. \"That felt almost better than breaking the (three-game losing) streak.\"\nThe Pistons won without two injured starters, wrapping up their five-game road trip with a bounce-back performance from their 33-point loss at Utah on Friday, their worst defeat of the season and their 11th loss in 15 games.\nThe Pistons barely hung on down the stretch of a back-and-forth game with the Lakers, who lost their fourth straight despite 26 points from Lou Williams.\nDetroit had a one-point lead when Harris got the ball from Drummond after Lakers rookie Brandon Ingram deflected it late in an aimless Pistons possession. Harris beat the shot clock with his 3-pointer in front of the Lakers' bench for a 99-95 lead.\n\"It was a huge win for us, just because we've had some tough games that I think we underachieved in,\" Harris said. \"It was good to see us all out there getting defensive stops and executing.\"\nD'Angelo Russell added 20 points for the Lakers, who have lost 20 of 25 since their 10-10 start to coach Luke Walton's first season.\n\"I don't want to keep using the `young team' thing,\" Williams said. \"At some point, we've got to show growth as a group. Some things, like ball movement, should be second nature at this point.\"\nGORES' SUPPORT\nOn Saturday, Gores had a three-hour meeting with Van Gundy. The owner and coach both emerged with excitement about the Pistons' future despite that poor six-week stretch since early December.\n\"(Gores') thing was not to overreact to six weeks out of what has been a 2 1/2-year process,\" Van Gundy said. \"It was good to sit down and talk through things and get his perspective on things.\"\nTO THE BANK\nDrummond banked in a 62-foot shot at the halftime buzzer, holding his hand aloft from the moment he let it go. Even Lakers fans had to applaud when it put Detroit up 59-57 at halftime after the Pistons had erased a 14-point Lakers lead. \"Did I call it? Of course,\" Drummond said with a grin.\nTIP-INS\nPistons: Kentavious Caldwell-Pope missed his second straight game with a strained rotator cuff. ... Drummond's 3-pointer was his second of the season. ... F Jon Leuer missed his fourth straight game with a sore right knee.\nLakers: Tarik Black went to the locker room in the third quarter after apparently injuring his ankle under the basket. ... Williams converted a four-point play in the second quarter. ... The Lakers have played 45 games already this season, most in the NBA by a long shot. They've played nine games in January already. ... Luol Deng returned to the lineup after sitting out Saturday's loss to the Clippers for rest. He Deng scored two points in 36 minutes. Fellow starter Julius Randle had two points in 32 minutes.\nUP NEXT\nPistons: Host Hawks on Wednesday.\nLakers: Host Nuggets on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995399.274358
}