{
  "game_id": "0021800233",
  "espn_id": "401070914",
  "date": "Nov 17, 2018",
  "matchup": "OKC @ PHX",
  "headline": "George, Adams lead Thunder past Phoenix 110-100",
  "body": "PHOENIX --  Still without Russell Westbrook, the Oklahoma City Thunder keep winning.\n\nPaul George scored 32 points, Steven Adams added 26 and the Thunder beat the Phoenix Suns 110-100 on Saturday night, their 10th victory in 11 games.\n\nThe Thunder played without Westbrook for the sixth straight game. He missed the first five with a sprained ankle, but the team said his absence on Saturday was for \"personal reasons.\"\n\nBut Oklahoma City was in control most of the night anyway, leading by as many as 18 points and beating the Suns for the third time this season with two of the victories coming without Westbrook.\n\nGeorge said the Thunder just know each other well.\n\n\"We've been together,\" he said. \"I can't say that enough. There's no more confusion, there's no more trying to figure it out. We know what to do. We've been together long enough now to know what to do in those moments.\"\n\nT.J. Warren scored 23, Deandre Ayton 21 and Devin Booker 16 for Phoenix, which was trying to win consecutive games for the first time this season after beating San Antonio on Wednesday night.\n\nThe rookie Ayton was able to score, but still had a rough night against the physical Adams.\n\n\"That's a tough matchup,\" Suns coach Igor Kokoskov said. \"As we know, Steven Adams is one of the most dominant five-men in the league right now. ... I think he (Ayton) competed in every play, he was more vocal, he was better than the first game, second game.\"\n\nAyton said the Thunder \"just made their shots and got to the line more than us. I know that we played and I know that we competed. The emotions were flowing on the bench. Everybody was really into it. ... Every game we play against them we get better and better.\"\n\nThe Thunder outscored Phoenix 17-4 to start the second half, capped by an 11-0 run that put Oklahoma City up 64-46 on George's 20-footer with 7:05 left in the third quarter. Booker and Josh Jackson each sank 3s in an 8-0 spurt that cut it to 64-54. But Oklahoma City, dominating the game inside, rebuilt the lead to 18 before Jamal Crawford scored the last four points of the quarter to cut the Thunder's advantage to 79-65 entering the fourth.\n\nDown 93-78 after George's two free throws with 5:27 to play, the Suns mounted an 11-2 run to cut it to 95-89 on Warren's 3-pointer with 3:45 remaining. But Adams scored on an offensive rebound and broke free for a dunk and was fouled for a three-point play to boost the lead to 100-89. Phoenix never came closer than seven after that.\n\n\"If you don't defend the 3-point line, it changes in a hurry,\" Oklahoma City coach Billy Donovan said, \"and that's what really changed the game but I give our guys credit when it got to six. We kind of closed out, made some plays, got it back up to 10 and it was 10 the last two minutes of the game.\"\n\nThe game was close through a sloppy first half, when neither team could shoot better than 38 percent.\n\nOklahoma City led 47-42 at the break, despite 12 turnovers. But Phoenix could turn them into just seven points.\n\nTIP-INS\n\nThunder: Westbrook practiced with the team on Friday and was at the Saturday shoot-around. ... Oklahoma City improved to 5-1 in games since Westbrook was hurt. ... The Thunder's two previous victories over Phoenix were in Oklahoma City, the most recent on Tuesday. ... Oklahoma City won its first road game against a Western Conference foe.\n\nSuns: Trevor Ariza missed his second straight game for personal reasons. ... Warren had his fifth straight 20-point game, a career best. .... In Ariza's absence, rookie Mikal Bridges started and scored 14 points. .... Booker was only 5 of 16 from the field, but matched his career best with 12 assists, a mark he set on Wednesday.\n\nUP NEXT\n\nThunder: At Sacramento on Monday night.\n\nSuns: Open a four-game road trip at Philadelphia on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994624.871139
}