{
  "game_id": "0021700636",
  "espn_id": "400975382",
  "date": "Jan 14, 2018",
  "matchup": "PHX vs. IND",
  "headline": "Collison, Oladipo lead balanced Pacers to rout of Phoenix",
  "body": "PHOENIX --  There are some NBA games that are over shortly after they began.\n\nThe Indiana Pacers' 120-97 rout of the Phoenix Suns on Sunday night was one of them.\n\nDarren Collison had 19 points to lead seven players in double figures and the Pacers jumped on the Suns early and never let up.\n\nVictor Oladipo scored 13 of his 17 points in the first half for the Pacers, who were coming off a home victory over Cleveland and have won four of five after a five-game losing streak. Cory Joseph added 16 points, and Bojan Bogdanovic had 14 for Indiana.\n\n\"I thought it was really good. We wanted to start this road trip off right,\" Pacers coach Nate McMillan said. \"I thought defensively we were focused, making them earn everything they got. Offensively, we had good ball movement. We were pretty consistent with that for 48 minutes.\"\n\nRookie Josh Jackson scored a career-best 21 points for Phoenix, which has lost four of five. Devin Booker added 15, but on 5-of-16 shooting, 1 of 6 from 3-point range.\n\n\"I thought we did a good job on some of their best players,\" Collison said. \"Booker is a talented player and we knew if he got it going we were in for a long night. I think we did a good job containing him the best that we can and we just played great team defense. When we play great team defense, we can do what we want at the offensive end.\"\n\nIn an otherwise bad night for Phoenix, 17-year NBA veteran Tyson Chandler grabbed 14 rebounds to become the 40th player in league history to top 10,000 for his career (10,003).\n\n\"It means a lot,\" he said, \"because when you come into this league as a young player you're just trying to survive. Now at the latter part of my career, to start to get some of these milestones, it just reminds you of all the hard work, the sacrifices, the journey you've got to make.\"\n\nInterim coach Jay Triano called the Chandler milestone \"`unbelievable.\"\n\n\"Anytime you do something that only 40 people have done in the history of the game,\" Triano said, \"I think that's an incredible honor.\"\n\nThe Suns, playing without second-leading scorer T.J. Warren, led only briefly early. Indiana went on a 15-4 run to go up 23-11 and led 30-16 after one quarter.\n\nPhoenix never got it to single digits again, trailing by as many as 25 in the second quarter. In the third quarter, the lead reached 92-59 (33 points) on T.J. Leaf's 3-pointer.\n\nIndiana opened the second half with a 16-8 run to lead 46-24 on Al Jefferson's layup with 7:09 left in the half.  Indiana led 64-44 at the break.\n\n\"I just thought tonight we lacked juice, I don't know why, at both ends,\" Triano said. \"Our cuts weren't' precise offensively and defensively we were a half-step behind them every time they made a move.\"\n\nTIP INS\n\nPacers: Indiana committed a season-low six turnovers. ... Opened a five-game trip through the West. ... Indiana shot 54.5 percent to the Suns' 41.2 percent. .... Indiana still is just 8-16 against Suns since 2005-06.\n\nSuns: Warren, averaging 19.7 points per game, was a late scratch with low back soreness. ... Marquese Chriss missed his second straight game with a right hip strain. ... Suns' most one-sided loss of season was 142-116 at home against Houston on Nov. 16. ... Jackson made 4 of 5 shots in the first quarter, the rest of the Suns 2 of 20. ... Phoenix was 2 of 15 on 3s in the first quarter. .... Dragan Bender started and was 0-for-7 shooting, six of them errant 3s, and did not score in 30 minutes. ... Phoenix plays the next four and six of the next seven on the road.\n\nUP NEXT\n\nPacers: at Utah on Monday night.\n\nSuns: at Portland on Tuesday night.\n\n---\n\nFor more NBA coverage: https://a ppnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993907.045145
}