{
  "game_id": "0022300190",
  "espn_id": "401584818",
  "date": "Nov 13, 2023",
  "matchup": "MIL vs. CHI",
  "headline": "Antetokounmpo, Portis produce double-doubles in Bucks' 118-109 victory over Bulls",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 35 points and 11 rebounds and Bobby Portis also had a double-double in the Milwaukee Bucks’ 118-109 victory over the Chicago Bulls on Monday night.\n\n\r\n              “He was phenomenal the whole game,” Bucks coach Adrian Griffin said of Antetokounmpo. “We needed him down the stretch, and he kind of took things in his own hands.”\n\n\r\n              Milwaukee’s Damian Lillard returned to action after missing two games with a calf injury, though he shot just 3 of 17 while scoring 12 points. The Bucks lost both games they played without the seven-time all-NBA guard.\n\n\r\n              “I felt pretty good,” Lillard said. “If I didn't feel good enough to play, I wouldn't have played. But I think any time you miss time, especially when you're already kind of behind to begin with, it's going to have some sort of effect. But given the circumstances, I felt pretty good.”\n\n\r\n              The Bulls were playing for the second straight night after beating the Detroit Pistons 119-108 at home on Sunday.\n\n\r\n              Bobby Portis had 19 points and 10 rebounds, both season highs. \n\n\r\n              Milwaukee’s Khris Middleton scored 13 points to enable him to overtake Michael Redd for fifth place on the Bucks’ career scoring list.\n\n\r\n              Middleton has 11,559 points since joining the Bucks in 2013, while Redd had 11,554 in his Bucks career. The Bucks’ top four scorers are Antetokounmpo (16,575), Kareem Abdul-Jabbar (14,211), Glenn Robinson (12,010) and Sidney Moncrief (11,594).\n\n\r\n              “Salute to Michael Redd,” Middleton said. “He's been a mentor of mine since I came to Milwaukee. I took over his number (No. 22) a little bit. He's been a great person to reach out to from time to time and talk to.”\n\n\r\n              Nikola Vucevic led the Bulls with 26 points and 12 rebounds. Zach LaVine scored 20, Coby White 16, Patrick Williams 13 and DeMar DeRozan 11. DeRozan shot just 3 of 14.\n\n\r\n              Milwaukee scored the game’s first nine points and outscored Chicago 35-18 during an opening period that ended with a buzzer-beating 3-pointer by Antetokounmpo, the 500th of his career. Chicago missed 16 of its first 19 field-goal attempts.\n\n\r\n              The Bulls chipped away at that 17-point deficit and finally took their first lead on an Andre Drummond putback with 5:15 left in the third. The lead changed hands three more times over the next minute or so, with a Portis basket putting Milwaukee back ahead for good.\n\n\r\n              Portis’ basket started a 12-0 run that helped the Bucks regain a double-digit advantage at 81-70. The Bucks carried an 83-74 advantage into the fourth quarter and didn’t allow the lead to drop below eight the rest of the way.\n\n\r\n              The Bulls shot just 38%. \n\n\r\n              “When you have those off shooting nights, the things that I felt like hurt us were the offensive rebounding — the timely ones they got back — and certainly some of the transition, (we were) not matched up and gave some open looks,” Bulls coach Billy Donovan said.\n\n\r\n              Chicago was missing Alex Caruso for a second straight game due to a toe injury. The Bucks were playing their first game without Jae Crowder, who is scheduled to undergo surgery Tuesday for an adductor and abdominal tear that will leave him unavailable for about two months.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Have the first of two straight home games with the Orlando Magic on Wednesday. They host the Magic again on Friday in an In-Season Tournament game.\n\n\r\n              Bucks: At Toronto on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996158.72319
}