{
  "game_id": "0021500800",
  "espn_id": "400828687",
  "date": "Feb 10, 2016",
  "matchup": "POR vs. HOU",
  "headline": "Lillard scores 31 as surging Blazers beat Rockets 116-103",
  "body": "PORTLAND, Ore. -- The Houston Rockets are \"broken,\" according to their coach and star player. The Portland Trail Blazers are in the middle of their best run of basketball all season.\nWhen they went head-to-head Wednesday night, the result was a 116-103 win for the Blazers that vaulted them past Houston into a tie with Utah for seventh place in the Western Conference.\n\"We're broken. It's that simple,\" Rockets interim coach J.B. Bickerstaff said. \"Right now we are a broken team. It's easy to see. It's a fragmented bunch. You can't win that way.\"\n\nIt's a much different story for the surging Blazers, who enter the All-Star break having won three in a row and eight of nine.\nDamian Lillard sparked a second-quarter outburst and finished with 31 points and nine assists for Portland. Maurice Harkless set season highs with 19 points and 13 rebounds.\n\"We just embraced the challenge,\" Lillard said of pushing for a playoff spot. \"You've got to give credit to all the work we put in.\"\nJames Harden had 34 points, 11 assists and nine rebounds for the Rockets, who have dropped three straight and six of eight to fall out of playoff position. Dwight Howard dominated the paint with 28 points and 13 rebounds.\nBut it wasn't nearly enough for a Houston team that committed 20 turnovers, leading to 31 Blazers points.\n\"It's frustrating that we're broken,\" Harden said. \"We're just not willing to help each other out. Talking ain't gonna get it done.\"\nHoward agreed that words will accomplish little.\n\"I'm not going to talk about what's broken,\" he said. \"All we do is talk about the issues that we have. Nobody's being positive.\"\nAfter trailing by as many as 21 in the second half, Houston closed to 93-88 early in the fourth quarter. But a Blazers timeout led to a scoring burst that restored the lead to 20 with 3:47 to go.\n\"I really like the way we're playing right now,\" Portland coach Terry Stotts said. \"It's good to go into the break on a win streak and playing well.\"\nAn entertaining, if at times sloppy, game took on a far more spirited air with 5:02 left in the second quarter. Patrick Beverley committed a hard, and needless, foul on Lillard just past halfcourt, sending the Blazers point guard sprawling.\nLillard spiked the ball in anger, officials reviewed the play to determine if it was a flagrant foul, and the crowd roared as Portland reeled off eight consecutive points and closed the half on a 13-4 run to take a 57-46 lead into the locker room.\nBeverley and Lillard have had run-ins before, and the fans expressed their feelings toward Beverley with a cacophony of boos throughout the game. Lillard sparked the half-ending run with a 3-pointer, and Harkless added another 3 and a driving layup to bring the crowd to its feet.\n\"I'm not even surprised,\" Lillard said of Beverley's foul. \"Every time we play them it's something. (But) I don't think it's personal.\"\nBickerstaff agreed.\n\"He got caught in a couple of situations but I don't think it was anything intentional,\" the coach said. \"Obviously they have a heated past, but I don't think it's anything dirty.\"\nTempers and intensity subsided to start the second half, until Houston's Jason Terry picked up a technical foul for throwing an elbow into the ribs of Meyers Leonard as they ran down the court following Terry's jumper.\nLeonard and C.J. McCollum chipped in 14 points each for Portland. Gerald Henderson scored 13 off the bench.\nTIP-INS\nRockets: F Terrence Jones, who went to nearby Jefferson High School in Portland, missed his fourth consecutive game and remains in the NBA's concussion protocol. He was injured in a car accident on Feb. 3. Bickerstaff, who attended Oregon State, said the team hopes to get positive news regarding Jones' return after the All-Star break.\nTrail Blazers: Lillard was added to the U.S. national team pool. He fell just short of a place on the 2014 World Cup of Basketball roster and wasn't among the original 30 candidates for Rio de Janeiro announced last month. ... F Noah Vonleh was in uniform for the first time after missing three games with a sprained left ankle. He did not play. ... Before the game, the Blazers held a moment of silence in memory of Ingrid Williams, the wife of former Portland assistant coach Monty Williams. She died Wednesday from injuries sustained in a car accident Tuesday in Oklahoma City, where Monty Williams is now an assistant with the Thunder.\nFREQUENT FOES\nIt was the second of three meetings between the teams in a span of 20 days. The Blazers won 96-79 in Houston on Feb. 6, and the Rockets return to the Rose City on Feb. 25 to wrap up the season series. Houston won the opener 108-103 in overtime on Nov. 18, Bickerstaff's debut as interim coach after replacing the fired Kevin McHale.\nUP NEXT\nRockets: At Phoenix on Feb. 19.\nTrail Blazers: Host Golden State on Feb. 19.",
  "source": "espn_api",
  "crawled_at": 1764994510.65293
}