{
  "game_id": "0021900924",
  "espn_id": "401161566",
  "date": "Mar 04, 2020",
  "matchup": "IND @ MIL",
  "headline": "NBA-leading Bucks bounce back, rout Pacers 119-100",
  "body": "MILWAUKEE --  The Milwaukee Bucks have the NBA’s best record in part by avoiding slumps.\n\nGiannis Antetokounmpo had 29 points, 12 rebounds and six assists and the Bucks bounced back from one of their weakest performances of the season to rout the Indiana Pacers 119-100 on Wednesday night.\n\nTwo nights after losing 105-89 in Miami, the Bucks improved to 53-9 as they get ready for a three-game trip west that starts Friday at the Western Conference-leading Los Angeles Lakers. Milwaukee hasn’t lost back-to-back games all season.\n\n“We just tried to get back on track,” Antetokounmpo said. “We didn’t just lose -- we played bad against Miami -- and I think everybody in this locker room wanted to play ball and just get back on track and get a win.’’\n\nIndiana had a four-game winning streak snapped as it fell into a tie with Philadelphia for fifth place in the Eastern Conference standings. The Pacers also lost guard Malcolm Brogdon to a sore left hip in the second quarter.\n\n“I jumped to challenge Khris Middleton’s shot and I felt something pull a little bit,” Brogdon said.\n\nThe Pacers also were without Victor Oladipo for the second straight game because of a sore right knee. Milwaukee was missing reserve guards George Hill (groin contusion) and Kyle Korver (back soreness).\n\nThis game marked a return to form for the NBA’s highest-scoring team.\n\nAfter scoring at least 100 points in 83 consecutive regular-season games -- the third-longest streak in NBA history -- the Bucks failed to reach the century mark in a 93-85 victory at Charlotte on Sunday and their loss at Miami.\n\nBut they got there with time to spare Wednesday. with Eric Bledsoe hitting a 3-pointer to give the Bucks a 101-81 edge with 9:02 left.\n\n“We want to be a really great team,” Bucks coach Mike Budenholzer said. “When you watch great teams around the league, whenever they lose, you don’t want to be the team that comes and plays them next. Can we build that identity? Can we build that as part of our fabric? It speaks to the competitiveness and the character of the team.’’\n\nMiddleton had 20 points and Donte DiVincenzo matched a career high with 19 for the Bucks. Bledsoe added 16 and Wesley Matthews had 15.\n\nT.J. Warren scored 18 points and Doug McDermott had 16 for the Pacers. Domantas Sabonis had 15 points and 10 rebounds, and T.J. McConnell had 14 points.\n\nMilwaukee led 33-11 less than 10 minutes into the game but missed all eight of its 3-point attempts in the second quarter as its halftime advantage shrunk to 58-56.\n\nIn the opening minute of the third quarter, the Pacers forced the first tie since a 2-2 start. The Bucks responded a few minutes later by taking a 78-64 lead with a 15-2 run that culminated with Matthews banking in a 3-pointer.\n\nThe Bucks stayed in front by double digits the rest of the way and led by as much as 28.\n\n“We knew this team had just lost to a good Miami team,” Pacers center Myles Turner said. “They were going to come out with a sense of urgency. We didn’t match that.”\n\nTIP-INS\n\nPacers: Sabonis recorded his 48th double-double of the year and is one away from Troy Murphy’s record for the most by a Pacer in a single season since the franchise joined the NBA in 1976. Murphy had 49 double-doubles in 2008-09. Sabonis also had seven assists.\n\nBucks: The Bucks are 13-1 against Central Division teams this season. The lone loss came Feb. 12 at Indiana, but Antetokounmpo didn’t play in that game. ... Antetokounmpo has recorded at least 20 points, 10 rebounds and five assists in an NBA-leading 27 games this season. ... Korver hasn’t played since Feb. 10, but Budenholzer expressed confidence the veteran guard could join the team for its upcoming trip west.\n\nMEDICAL REPORT\n\nOladipo has played in just two of the Pacers’ last six games, as he missed two games with a sore lower back before this knee issue.\n\nPacers coach Nate McMillan said Oladipo is dealing with some of the issues that come along with returning from a serious injury. Oladipo missed the Pacers’ first 47 games while recovering from a ruptured quadriceps tendon in his right knee,\n\n“He missed some games due to some back spasms, a tweaked ankle and some soreness and swelling in his knee,” McMillan said before the game. “These are things that you expect when guys are coming back. This is really the start of the season for Victor.”’\n\nUP NEXT\n\nIndiana continues its five-game trip Friday night at Chicago.\n\nMilwaukee visits the Lakers on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995833.7762089
}