{
  "game_id": "0021500070",
  "espn_id": "400827957",
  "date": "Nov 05, 2015",
  "matchup": "CHI vs. OKC",
  "headline": "Bulls' Derrick Rose scores 29 points; OKC drops third straight",
  "body": "CHICAGO -- The Chicago Bulls let the lead slip away. Derrick Rose wouldn't let the game get away, too.\nRose came up big down the stretch to score 29 points, and Jimmy Butler added 26 to lead the Bulls to a 104-98 victory over Kevin Durant and the Oklahoma City Thunder on Thursday night.\n\nWhether he can consistently play like a superstar still remains in question. But Rose sure looked like his old MVP self, scoring 10 points over the final 3½ minutes to lift the Bulls after they blew a 10-point lead in the fourth quarter.\n\"For him to have a game like this, I know this is a huge confidence booster,\" coach Fred Hoiberg said.\nOklahoma City tied it with just over five minutes left in the game. But Rose's performance in the closing minutes helped offset Durant's 33 points and lifted the Bulls after they got blown out at Charlotte two nights earlier.\nChicago was clinging to a 98-96 lead when Rose buried consecutive jumpers to make it a six-point game with just over a minute remaining.\nAfter Durant hit a jumper, Pau Gasol nailed a sweeping hook with 38.4 seconds left, sealing the win for the Bulls.\nRose, still wearing a face mask after missing almost the entire preseason because of a fractured left orbital, found his rhythm after three straight single-digit scoring games. Butler set a career-high with 21 first-half points and hit four 3-pointers in the game, and the Bulls got back to winning after getting squashed by Charlotte 130-105 on Tuesday night.\n\"That game was embarrassing a little bit,\" Rose said. \"Looking at film after it happened, we were frustrated. We felt like we let each other down. After the way we practiced yesterday, we could tell we got that competitive spirit again.\"\nRussell Westbrook had 20 points and 10 assists for Oklahoma City, and Serge Ibaka scored 17. But the Thunder, playing their fourth game in five nights, came up short down the stretch again and dropped their third straight. They blew a late eight-point lead in a 105-98 loss to Toronto on Wednesday night.\n\"It's not four games in five nights,\" Durant said. \"We have to figure it out. We have to figure it out, man. We've got to get stops. We have to buckle down and do it.\"\nBULLS RUN, THUNDER RALLY\nThe Bulls were leading 78-77 early in the fourth when Joakim Noah threw an alley-oop pass to Taj Gibson. That started a nine-point run, and Rose finished it by banking in a jumper to make it 87-77 with 8:51 remaining.\nBut the Thunder answered with a 13-3 run. Durant threw down a fast-break dunk and hit two free throws to tie it at 90-all with just over five minutes left before Gasol nailed a jumper.\nPRAISING NOAH\nGiven their history together, it was hardly a surprise that Thunder coach Billy Donovan had high praise for Noah. After all, Noah was part of back-to-back championship teams when he played for Donovan at Florida.\n\"Forget the basketball piece of it,\" Donovan said. \"A lot of people see the floppy hair, the chest-bumping, the passion, but I don't think people a lot of times get a chance to see him in the locker room. He's one of the greatest teammates that I've ever had a chance to coach.\"\nTIP-INS\nThunder: Donovan said C Steven Adams tweaked his back. Adams did not play in the fourth quarter.\nBulls: F Doug McDermott scored nine points in his first career start for Chicago. Tony Snell came off the bench. ... Butler had scored 17 points in a first half three times.\nUP NEXT\nThunder: Host Phoenix on Sunday night.\nBulls: Host Minnesota on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764993980.662209
}