{
  "game_id": "0021800168",
  "espn_id": "401070849",
  "date": "Nov 09, 2018",
  "matchup": "CHA @ PHI",
  "headline": "Joel Embiid has 42 points, 18 rebounds in 76ers' OT win",
  "body": "PHILADELPHIA --  Joel Embiid repeatedly stepped to the free throw line with one thought in mind during critical moments of the Philadelphia 76ers' overtime victory against the Charlotte Hornets.\n\n\"Got to make them,\" Embiid said. \"They call me `clutch' for a reason, so got to make them.\"\n\nEmbiid was 14 for 16 from the line between the fourth quarter and overtime to help ice the 76ers' 133-132 victory Friday night. He had 42 points and 18 rebounds.\n\nThe Hornets fought back from a 21-point deficit and led by five with 1:18 remaining in regulation before the Sixers forced extra time. Kemba Walker scored 19 of his 30 points in the fourth quarter for the Hornets.\n\nEmbiid challenged the Hornets' defense as they attempted a comeback victory and focused on drawing contact.  Hornets starting center Cody Zeller fouled out in regulation after committing five fouls in the fourth.\n\n\"It's tough keeping him off the free throw line just because he is so physical,\" Zeller said. \"He can shoot it from three, play off the dribble, he's obviously a wide body in the post, so those are the toughest guys to defend that can play kind of play at every spot on the court.\"\n\nEmbiid thrives on getting to the line where he is shooting 81.8 percent, up from 76.9 percent last season. He has earned the confidence of the Sixers to aggressively seek out shots there.\n\n\"He's a really good shooter anyways and he's confident by nature, so that's a pretty good collision of skill and mind,\" 76ers coach Brett Brown said. \"You trust him going to the line and shooting a high percentage. He's not afraid of the moment.\"\n\nEmbiid's execution down the stretch left the Hornets searching for answers on defense.\n\n\"I thought our bigs were great,\" Hornets coach James Borrego said. \"They battled him. I thought they were fantastic defensively. They tried to beat him to spots. I don't know what to tell them when Embiid shoots 16 free throws in the fourth quarter and overtime, I don't know what to say to them.\"\n\nTo Embiid, the abundance of free throw attempts were all in a day's work.\n\n\"That's my job,\" he said. \"I've got to step up when there's an opportunity.\"\n\nThe Sixers improved to 7-0 at the Wells Fargo Center, the most home wins to start the season since 2002-03.\n\nMISSED OPPORTUNITY\n\nThe Hornets committed a shot-clock violation with time winding down in regulation, missing an opportunity.\n\n\"I didn't lose track of time,\" Walker said. \"I just wanted to get the last shot. I wish I had got a better shot, but yeah, I just wanted to get something off. I wanted the last shot, that was really it.\"\n\nTIP-INS\n\n76ers: Ben Simmons had 22 points, 13 assists and eight rebounds for the 76ers ... Rookie Jonah Bolden was recalled from the Delaware Blue Coats of the G League. He scored eight points in a career-high 11 minutes. Bolden had not appeared in a game for the 76ers since Oct. 30.\n\nHornets: Dwayne Bacon scored 15 points in only his fifth game of the season ... Walker got off to a slow start, shooting 2 for 15 from the field through three quarters.\n\nUP NEXT\n\n76ers: At Memphis on Saturday night.\n\nHornets: At the Detroit on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994432.093538
}