{
  "game_id": "0021800659",
  "espn_id": "401071335",
  "date": "Jan 16, 2019",
  "matchup": "BKN @ HOU",
  "headline": "James Harden continues tear with 58, but Rockets fall in OT to Nets",
  "body": "HOUSTON -- Spencer Dinwiddie didn't seem to be nearly as wowed by his late-game scoring for the Brooklyn Nets as he was by the fact that his team got an overtime victory on a night when James Harden had a season-high 58 points.\n\"The man had 60 and we won,\" Dinwiddie said, shaking his head and only slightly exaggerating Harden's performance. \"That's big time for a young group.\"\nDinwiddie scored 25 of his 33 points in the fourth quarter and overtime, and the Nets spoiled Harden's night with a 145-142 victory over the Houston Rockets on Wednesday.\nHarden had his second straight season high after scoring 57 in a victory over the Memphis Grizzlies on Monday night, but he was only 5-of-19 from 3-point range. The Rockets shot an NBA-record 70 3s, making just 23.\nHe has scored at least 30 points in 18 straight games and has reached 40 in nine of the past 12. He was 16-of-34 overall from the field, made 21 of 23 free throws and had 10 rebounds and six assists.\n\nBut Harden was disappointed that his team squandered an eight-point lead with about a minute left in the fourth and a seven-point advantage in overtime.\n\"Frustrating,\" Harden said. \"Very frustrating.\"\nDinwiddie forced overtime, making three 3-pointers in the final 30 seconds of regulation. In the extra period, he hit the go-ahead basket with 28 seconds left.\n\"Just fantastic. He was unbelievable,\" Nets coach Kenny Atkinson said. \"The 3s were great, but I also love how he was driving the ball to the rim too.\"\nDinwiddie said he didn't really have time to celebrate his hot shooting as it was happening and kept a businesslike mindset.\n\"It was like: 'Down nine. Down six. Down three. Oh, tied? Let's get a stop,'\" he said about his 3-point spree. \"That's really all it was.\"\nAfter Harden made three free throws to give the Rockets a one-point lead, James Nunnally -- who signed a 10-day contract Wednesday -- hit a 3-pointer to make it 142-135 with 1:28 left in overtime.\nTreveon Graham made a 3 for Brooklyn and Jarrett Allen made a basket but missed a free throw to cut the lead to 142-140. But the Nets grabbed a rebound and Dinwiddie, who had seven points in overtime, made a three-point play to put Brooklyn up 143-142. Austin Rivers missed a 3 for Houston, and Joe Harris made two free throws to make it 145-142 with 1.6 seconds left.\nHouston had a chance to tie it at the buzzer, but Gerald Green's shot clanged off the rim.\nAllen had 20 points and a career-high 24 rebounds, Graham had a career-high 21 points, and DeMarre Carroll added a season-best 22.\nHarden agreed that fatigue contributed to this loss on a night when he and Rivers both played more than 45 minutes and PJ Tucker almost 42.\n\"A little bit,\" Harden said. \"We were small. You've got James [Nunnally] out there his first game, and we had a couple of mistakes out there near the end. But give them credit. They made some big shots.\"\nThe Rockets broke their own record for 3-point attempts after shooting 61 against the New Orleans Pelicans on Dec. 16, 2016. Houston also holds the record for most 3-pointers made after hitting 26 in a win over the Washington Wizards this season. Green, who did not attempt a 2-point basket, made 5-of-15.\nThe Rockets were up by 11 with about 2½ minutes left when Brooklyn used a 9-3 run to get to 127-122 with about 30 seconds remaining.\nTucker made two free throws after that, and Dinwiddie made a 3 for Brooklyn with 26.2 seconds remaining to cut it to 128-125. Harden made one of two free throws, and Dinwiddie struck again with another 3 about five seconds later to get Brooklyn within one.\nTucker missed two free throws, but Harden grabbed a rebound with 12.7 seconds left. He made both free throws. Then Dinwiddie made a third straight 3-pointer to tie it up with 8.4 seconds left. Harden had a chance to win it in regulation, but his 3-point attempt bounced off the rim.\nTIP-INS\nNets: Jared Dudley missed his third straight game with a strained left hamstring. ... Shabazz Napier returned after missing one game with tightness in his right hamstring. ... Rondae Hollis-Jefferson was back after sitting out the past seven games with a right adductor strain.\nRockets: Eric Gordon had 20 points in his return after missing eight games with a bruised right knee. He came out of the game early because his knee was sore, but Gordon said he's OK. ... James Ennis III missed the game after cutting his left leg in a fall at his house. Coach Mike D'Antoni said he should return for the next game. ... Chris Paul missed his 13th game in a row with a strained left hamstring ... Brandon Knight sat out with a sore left knee.\nMORE HARDEN NUMBERS\nHarden's 58 points are the second most in franchise history, behind the career-high 60 he scored against the Orlando Magic on Jan. 30, 2018. It's the second time in his career that he has scored at least 50 points in back-to-back games, after he did it on Dec. 20 and Dec. 22, 2017. It's also his fourth 50-point game this season and the 13th of his career, which ranks sixth in NBA history. He is averaging 40 points in his past 21 games.\nUP NEXT\nNets: At Orlando on Friday night.\nRockets: Host Lakers on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995411.3522592
}