{
  "game_id": "0022400002",
  "espn_id": "401703371",
  "date": "Nov 12, 2024",
  "matchup": "MIA @ DET",
  "headline": "Pistons win first NBA Cup game after Heat call phantom timeout in overtime",
  "body": "DETROIT -- — Malik Beasley made a tiebreaking free throw with 1.1 seconds left in overtime after Miami was given a technical foul for calling a timeout when it had none left, and the Detroit Pistons edged the Heat 123-121 in an NBA Cup game on Tuesday night.\n\n\r\n              Tyler Herro's jumper put Miami up 121-119 with 1.8 seconds left, but after a timeout, Cade Cunningham hit Jalen Duren with an alley-oop on the inbounds pass.\n\n\r\n              The Heat then called the illegal timeout. Beasley hit the foul shot to put Detroit up 122-121, then added another free throw with 0.1 seconds left. \n\n\r\n              Beasley and Cunningham each scored 21 for the Pistons, who went 0-4 in last year's NBA Cup. Herro had 40, including 20 in the fourth quarter and overtime.\n\n\r\n              Takeaways\r\n              Heat: Nikola Jovic left the game in the first quarter after sustaining a reduced septum in a collision with Beasley. Beasley's jaw collided with Jovic's nose and mouth, leaving the Serbian bleeding. \n\n\r\n              Pistons: The game was delayed for several minutes in the third quarter when Tim Hardaway Jr. was injured after a collision with Herro and Duran. Hardaway was already on the floor when Duren landed on him, with Duren's knee hitting him in the head. A bloodied Hardaway stood up briefly after lengthy medical attention but was taken off the floor in a wheelchair.\n\n\r\n              Key moment\r\n              The Pistons led 39-21 early in the second quarter and looked as if they would keep pulling away. Bam Adebayo, Herro and Duncan Robinson, though, scored all but two points in a 23-4 run that put the Heat ahead 44-43 with 4:14 left in the half.\n\n\r\n              Key stat\r\n              Herro scored 18 points in the fourth quarter on 6-of-9 shooting, including 6-of-8 on 3-pointers.\n\n\r\n              Up next\r\n              The Pistons return to action on Wednesday in Milwaukee while the Heat are off until playing at Indiana on Friday and Sunday.",
  "source": "espn_api",
  "crawled_at": 1764998294.049818
}