{
  "game_id": "0022300382",
  "espn_id": "401585010",
  "date": "Dec 22, 2023",
  "matchup": "TOR @ PHI",
  "headline": "Embiid plays through ankle injury to extend 30-10 streak to 13, 76ers beat Raptors 121-111",
  "body": "PHILADELPHIA -- — Joel Embiid played through an ankle injury to push his 30-10 streak to 13 games, finishing with 31 points and 10 rebounds in the Philadelphia 76ers’ 121-111 victory over the Toronto Raptors on Friday night.\n\n\r\n              Embiid scored all 31 points after landing awkwardly trying to block a shot with 5:25 left in the first quarter. The 30-10 streak is the longest in the NBA since Kareem Abdul-Jabbar did it for 16 straight games in 1971-72. Embiid has scored 30 points or more in 14 straight games, the most in the NBA since James Harden had a 32-game run in 2018-19.\n\n\r\n              Embiid briefly went to the locker room after scoring just two points in the first quarter but returned in the second quarter and had 11 points at halftime.\n\n\r\n              “I saw that I wasn’t being aggressive,” Embiid said. “But then I let the game come to me. I didn’t force shots and in the third quarter I was able to get a few shots to go.”\n\n\r\n              The reigning NBA MVP was noticeably hobbling and winced periodically and favored his right leg, but it didn’t slow him down in the second half. He also had nine assists and four blocks. Embiid didn’t want to talk about his ankle after the game.\n\n\r\n              “I don’t know,” he said. “I’ll get it checked out. We’ll see.”\n\n\r\n              Philadelphia coach Nick Nurse confirmed that it was an ankle injury but didn’t offer much more about the injury.\n\n\r\n              “Obviously, he stayed in the game and it didn’t change his rotation at all,” Nurse said. “But he played through it and I’m pretty sure he’ll be sore tomorrow. We’ll have to monitor it over the next couple days before we get on the plane (to Miami).”\n\n\r\n              Tobias Harris and Tyrese Maxey each had 33 points, the second time in franchise history three players have scored 30-plus points in a game. The other was in 1961 when Dick Barnett, Hal Greer and Dolph Schayes did it for the Syracuse Nationals.\n\n\r\n              Harris scored 24 points in the first half. Maxey added 10 assists.\n\n\r\n              “Tobias has been around for a long time,” Maxey said. “He knows how to stay professional and stay ready. He did that tonight. He’s been huge. We appreciate him for that.”\n\n\r\n              Pascal Siakim led Toronto with 31 points. Jakob Poeltl added 19.\n\n\r\n              Toronto built a 15-point first quarter lead, but Philadelphia slowly chipped away and took the lead for good with 1:15 to play in the second quarter on Harris’ three-point play.\n\n\r\n              “Give them credit because they did a good job planning for Joel,” Nurse said. “We got the ball where it needed to go after that and it happened to be Tobias and he energized us. He’s a really good player. Some nights the shots find you and some nights they don’t. Tonight, they found him and he took advantage of it.”\n\n\r\n              Philadelphia played without rotational regulars Nicolas Batum (hamstring), Patrick Beverley (right heel soreness) and DeAnthony Melton (left thigh contusion).\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Utah on Saturday night.\n\n\r\n              76ers; At Miami on Monday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995853.4463081
}