{
  "game_id": "0021600908",
  "espn_id": "400900303",
  "date": "Mar 02, 2017",
  "matchup": "OKC @ POR",
  "headline": "Lillard scores 33 as Trail Blazers beat Thunder 114-109",
  "body": "PORTLAND, Ore. --  The Trail Blazers huddled in a timeout with just more than 17 seconds left against Oklahoma City, and the overwhelming sentiment was simple: relax.\n\nThe Thunder had trimmed Portland's lead to 110-109, but the Blazers refused to get rattled and came away with a 114-109 victory Thursday night.\n\n\"Even though it got scary there at the end, we were still able to calm ourselves down and get the win,\" said Damian Lillard, who finished with 33 points.\n\nRussell Westbrook scored 45 on 12-of-36 shooting for the Thunder, who had their four-game winning streak snapped. Oklahoma City newcomer Taj Gibson added 15 points, including a high-arching buzzer-beater from 61 feet away to put the Thunder up 60-57 at halftime.\n\nAlex Abrines' 3-pointer gave the Thunder their biggest lead at 97-89 with 7:48 left, but Al-Farouq Aminu made a layup that tied it at 101 with 3:43 to go. He missed the free throw, but Jusuf Nurkic got the tip-in to give Portland the lead.\n\nLillard's 3-pointer extended it to 106-101 before Westbrook's driving layup and free throw pulled Oklahoma City to 110-106.\n\nAbrines' 3-pointer with 17.7 seconds left narrowed it to 110-109. After the timeout, Lillard was fouled twice in the final seconds and made all four free throws before Westbrook and Doug McDermott missed 3-pointers at the end.\n\nNurkic, acquired by the Blazers just before the All-Star break in a trade with Denver, was a spark with 18 points, 12 rebounds, a career-high six assists and five blocks.\n\n\"He has a good sense of the game,\" Portland coach Terry Stotts said. \"When you have that, I think the integration goes a little bit better.\"\n\nWestbrook hit all 15 of his free throws. He had eight rebounds and four assists, ending a streak of four straight triple-doubles.\n\nEnes Kanter added 18 points and 10 rebounds.\n\n\"Difference tonight was we just couldn't make our shots,\" Westbrook said. \"We missed the same shots that we've been making every game.\"\n\nThe Thunder were coming off a 109-106 victory over Utah. Westbrook had 43 points, 11 rebounds and 10 assists in that game for his 30th triple-double of the season. The Thunder opened the game against the Jazz with 12 straight 3s.\n\nThe Blazers were coming off a 120-113 overtime loss at Detroit, which capped a 2-7 February.\n\nThe game marked the Thunder debut of guard Norris Cole, signed on Wednesday to help fill the void after the team traded backup point guard Cameron Payne to Chicago. Cole won NBA titles with the Miami Heat in 2012 and 2013, but most recently played with the Shandong Golden Stars of the Chinese Basketball Association.\n\nGibson and McDermott, acquired in the trade with the Bulls, were playing in their fourth game with the Thunder.\n\nCole hit a 3-pointer early in the second quarter, his first field goal with the team, and the Thunder went up 27-26. But the Blazers reclaimed the lead and went ahead 52-45 on Aminu's 3-pointer.\n\nCJ McCollum's 3 gave Portland a 57-48 lead, but Westbrook made consecutive 3-pointers and three straight free throws to tie it before Gibson's stunning shot from beyond halfcourt.\n\nThe Thunder led 85-81 heading into the final period.\n\nTIP-INS\n\nThunder: It was the first of a three-game road trip. ... Thunder assistant coach Maurice Cheeks was head coach of the Blazers for four seasons (2001-05).\n\nTrail Blazers: A fan from Beaverton hit a half-court shot between the third and fourth quarters to win a new Toyota minivan. .... Evan Turner, recovering from a broken bone in his right hand, is due to have his cast removed on Friday and could return to practice as early as next week.\n\nNURKIC ADJUSTS\n\nThrough his first five games with the Blazers, the 7-footer from Bosnia is averaging 14 points and 8.6 rebounds. With his performance against the Thunder, he became just the third NBA player to have 15-plus points, 10-plus rebounds, five-plus assists and five-plus blocks in a game this season, joining Kevin Durant and Giannis Antetokounmpo.\n\nINJURY ISSUES\n\nThe Thunder were without Victor Oladipo for a fourth straight game because of back spasms. Abrines started in his place. Oklahoma City coach Billy Donovan said he did not think the spasms were the sign of a more serious issue. ... Portland got bad news Wednesday when it was revealed that forward Ed Davis will have arthroscopic surgery on his left shoulder and likely miss the rest of the season. The procedure, scheduled for Tuesday in Los Angeles, will repair an injured labrum. Davis averaged 4.3 points and 5.3 rebounds in 46 games, including 12 starts, this season. Speaking before Thursday's game, Stotts said the shoulder had been bothering Davis for a long time. \"It's actually a good thing he's getting the procedure done now so he'll be ready going into next season,\" Stotts said.\n\nUP NEXT\n\nThunder: Oklahoma City visits the Phoenix Suns on Friday night.\n\nTrail Blazers: Portland hosts the Brooklyn Nets on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995266.592916
}