{
  "game_id": "401809816",
  "espn_id": "401809816",
  "date": "Nov 28, 2025",
  "matchup": "NY vs MIL",
  "headline": "Jalen Brunson scores 37 points as Knicks fend off Bucks 118-109 and advance in NBA Cup",
  "body": "NEW YORK -- — Jalen Brunson scored 37 points and the New York Knicks advanced to the knockout round of the NBA Cup, beating the Milwaukee Bucks 118-109 on Friday night in Giannis Antetokounmpo's return from a groin injury.\n\n\r\n              Miles McBride added 19 points, including two 3-pointers in the opening minutes of the fourth quarter to put the Knicks ahead by 13. New York went 3-1 to win East Group C.\n\n\r\n              Josh Hart had 19 points and 15 rebounds in his third game back in the starting lineup. Mikal Bridges scored 14 points as the Knicks shot 44%.\n\n\r\n              Antetokounmpo finished with 30 points, 15 rebounds and eight assists in 28 minutes after missing four games.\n\n\r\n              Kyle Kuzma added 20 points as Milwaukee lost its seventh straight overall and was eliminated from the tournament with a 2-2 record in group play. A.J. Green finished with 18 points for the Bucks, who shot 52.1% and made 18 3-pointers.\n\n\r\n              Brunson had his third 30-point game since returning from a two-game absence due to a right ankle sprain. He made 7 of 8 shots in the third, when the Knicks turned a one-point halftime deficit into a four-point lead.\n\n\r\n              The Bucks nearly rallied from a 13-point deficit in the fourth, but Brunson hit three free throws after being fouled by Antetokounmpo with 3:37 left and set up McBride’s third 3 of the quarter for a 110-107 lead nearly a minute later. Brunson's three-point play with 1:27 left made it 114-107.\n\n\r\n              The Knicks briefly lost a six-point lead late in the third but regrouped and held a 92-88 lead into the fourth after Bridges and Brunson sank 3s in the final minute. McBride made two 3s and Tyler Kolek also hit one for a 101-88 lead early in the period before Milwaukee stormed back.\n\n\r\n              Up next\r\n              Bucks: Host Brooklyn on Saturday.\n\n\r\n              Knicks: Host Toronto on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042710.010583
}