{
  "game_id": "0022200281",
  "espn_id": "401468436",
  "date": "Nov 25, 2022",
  "matchup": "CHI @ OKC",
  "headline": "Gilgeous-Alexander stars as Thunder beat Bulls 123-119 in OT",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 30 points, including five straight free throws in the final minute of overtime, and the Oklahoma City Thunder beat the Chicago Bulls 123-119 on Friday night.\n\n\r\n              Josh Giddey had 10 points, 13 rebounds and nine assists as Oklahoma City stopped a three-game slide. Aleksej Pokusevski scored 15 points.\n\n\r\n              The Thunder were down 119-118 when Gilgeous-Alexander was fouled by DeMar DeRozan on a 3-point attempt with 27.1 seconds remaining in OT. After an unsuccessful challenge by Bulls coach Billy Donovan, Gilgeous-Alexander hit all three free throws.\n\n\r\n              “When I saw the shot clock down low, I knew I was going to shoot a step-back 3,“ Gilgeous-Alexander said. “I just tried to set him up. Felt like he was gonna jump and he fouled me.\"\n\n\r\n              At the other end, DeRozan missed a jumper with five seconds left. The Thunder rebounded and Gilgeous-Alexander was fouled, hitting two more free throws.\n\n\r\n              DeRozan scored 30 points for Chicago, which was coming off encouraging victories over Boston and Milwaukee. Zach LaVine had 27 points, and Nikola Vucevic finished with 13 points and 13 rebounds.\n\n\r\n              Oklahoma City led 87-80 after three quarters, but LaVine rallied Chicago with 12 points in the fourth.\n\n\r\n              DeRozan’s pullup jumper gave the Bulls a 108-104 lead with 2:33 remaining in regulation. But Gilgeous-Alexander made two foul shots and Kenrich Williams converted a tying layup with 1:38 left.\n\n\r\n              The Thunder got 48 bench points, and Gilgeous-Alexander said that is what it will take every night to turn close games into victories.\n\n\r\n              “We were good all across the board. Guys made plays on both ends of the floor,” Gilgeous-Alexander said. “Guys were aggressive and our confidence didn’t waver, based on our losing streak or whatever was going on in the game. We kept our head on straight and really had a next play mentality.”\n\n\r\n              Thunder coach Mark Daignault was impressed by his young team’s perseverance.\n\n\r\n              “These are veteran teams, these guys we’re playing against have been in these situations,\" he said. “It’s a great experience for our guys.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Alex Caruso had 12 points on 4-for-5 shooting. ... The Bulls shot 43.6% (44 of 101) from the field.\n\n\r\n              Thunder: It was the second straight overtime game for OKC, which lost at home Wednesday night to Denver. ... Led by Gilgeous-Alexander, the Thunder went 28 for 32 at the line.\n\n\r\n              NEXT\n\n\r\n              Bulls: Visit Jazz on Monday\n\n\r\n              Thunder: At Rockets on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994506.7141702
}