{
  "game_id": "0022400859",
  "espn_id": "401705425",
  "date": "Feb 28, 2025",
  "matchup": "LAC @ LAL",
  "headline": "Luka Doncic scores 31 on his birthday, and the Lakers beat the Clippers 106-102 for 5 straight wins",
  "body": "LOS ANGELES -- — Luka Doncic scored 31 points on his 26th birthday and LeBron James had 28 points and 13 rebounds in the Los Angeles Lakers' fifth straight victory, 106-102 over the Los Angeles Clippers on Friday night.\n\n\r\n              Doncic scored 10 points in the fourth quarter of a gritty performance by the Lakers, who were missing two injured starters on the second night of a back-to-back home set. They still won their city rivalry game with strong defense and Doncic's playmaking, finally holding on for their 11th win in 13 games.\n\n\r\n              Ivica Zubac had a season-high 27 points and 16 rebounds for the Clippers, who have lost four of five since the All-Star break. Kawhi Leonard scored 21 points, and James Harden had 18 in a 5-for-22 shooting performance, including 1-for-10 on 3-pointers.\n\n\r\n              After struggling with his shot again for three quarters, Doncic hit consecutive 3-pointers midway through the fourth to stretch the lead to 10 points.\n\n\r\n              Takeaways\r\n              Clippers: Undone by 18 turnovers in their first game back in LA since Feb. 12, Zubac's standout effort against the Lakers' undersized frontcourt wasn't enough.\n\n\r\n              Lakers: An impressive performance with minimal rest and a depleted lineup. Austin Reaves left in the first quarter with calf soreness, while Rui Hachimura sat out after straining his left knee Thursday. Coach JJ Redick said he's “optimistic” Hachimura's injury isn't serious.\n\n\r\n              Key moment\r\n              The Lakers' lead was only four when Doncic hit James for a layup with 2:14 left. After Harden missed two clean 3-point attempts, Doncic found Jaxson Hayes for a dunk and a 106-98 lead.\n\n\r\n              Key stat\r\n              Doncic is sixth in NBA history in points scored before his 26th birthday (12,205). James is first (16,081), while Doncic finished just 10 points behind fifth-place Kobe Bryant (12,215).\n\n\r\n              Up next\r\n              A rematch on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997942.307078
}