{
  "game_id": "0022201000",
  "espn_id": "401469155",
  "date": "Mar 10, 2023",
  "matchup": "MIA vs. CLE",
  "headline": "Butler scores 33, Heat rally to topple Cavaliers 119-115",
  "body": "MIAMI -- — Jimmy Butler did everything right in the final minutes. He knew when to score, knew when to rebound, even knew when and how to foul.\n\n\r\n              And the Miami Heat needed all of it.\n\n\r\n              Butler scored 12 of his 33 points in the final 5:11, Tyler Herro added 25 and the Heat rallied from a 14-point, second-half deficit to beat the Cleveland Cavaliers 119-115 on Friday night.\n\n\r\n              “There's a lot at stake,” Herro said. “Every game counts for us.”\n\n\r\n              Donovan Mitchell led all scorers with 42 points for Cleveland, which got 16 apiece from Isaac Okoro and Caris LeVert. Evan Mobley added 12 for the Cavaliers.\n\n\r\n              Cleveland (42-27) fell 3-1/2 games behind Philadelphia in the race for the No. 3 spot in the Eastern Conference; the 76ers (44-22) edged Portland 120-119 on Friday.\n\n\r\n              Miami (36-32) remained No. 7 in the East, still three games in the loss column behind No. 6 Brooklyn (38-29) — which won at Minnesota.\n\n\r\n              “We’re fighting for our competitive lives right now,” Heat coach Erik Spoelstra said. \"Is this the exact position we want to be in? No. But you do have to embrace the competition. When you're dreaming about things in the middle of the summer, this is what you want, games with incredible pressure and context.”\n\n\r\n              Bam Adebayo scored 19 points and Max Strus had 14 for the Heat, who split a two-game home set with the Cavaliers.\n\n\r\n              “We let them get to their spots too easily. ... But I thought it was a heck of a game,” Cleveland coach J.B. Bickerstaff said.\n\n\r\n              Heck of a finish, too.\n\n\r\n              Miami outscored Cleveland 37-26 in the fourth. Butler returned to the game midway through the final period, then scored eight consecutive Heat points over a two-minute stretch to keep Miami on top, albeit barely.\n\n\r\n              “That's why he's Jimmy Butler,” Bickerstaff said.\n\n\r\n              But Cleveland made it very interesting. Helped by Miami committing offensive fouls on illegal screens on back-to-back possessions, the Cavaliers cut the lead to one when Mobley got a dunk with 38.3 seconds left.\n\n\r\n              The Cavs never got the lead back, and a Butler foul helped Miami finish it off. With the Heat up three, Butler fouled Mitchell near midcourt with 5.6 seconds left — not letting Cleveland get any looks at a potentially game-tying 3-point shot.\n\n\r\n              Mitchell made the first and intentionally missed the second. It was a ploy he's used before — most notably in the Jan. 2 game against Chicago when he forced overtime in what became his 71-point game by running down an intentionally missed foul shot and scoring. The Heat knew it was coming, Butler controlled the rebound, and iced the game with two last free throws.\n\n\r\n              “Donovan Mitchell missed that free throw about as perfectly as you could,” Spoelstra said.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: G Darius Garland missed the game with a right quadricep contusion, suffered in Wednesday’s win over Miami. He’s day-to-day. ... Jarrett Allen was inadvertently poked in the eye by Adebayo as the two were among those going for a rebound with 3:53 left. The play was reviewed and determined to be a common foul; Allen left the game.\n\n\r\n              Heat: PG Kyle Lowry missed his 15th consecutive game with left knee soreness. He’s hoping to return at Orlando on Saturday. ... Miami was 11 for 19 on 3's in the second half, after going 3 for 10 in the first half from deep.\n\n\r\n              RALLIED HEAT\n\n\r\n              It was Miami's sixth time coming back and winning after trailing a game by at least 14 points this season.\n\n\r\n              BIG HALF\n\n\r\n              Mitchell scored at least 25 points in a first half for the third time this season — all on the road. He had 27 at Dallas on Dec. 14, 25 in his return to Utah on Jan. 10, and 25 on Friday. He had “only” 16 at the half of his 71-point game in Cleveland against Chicago on Jan. 2.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Charlotte on Sunday.\n\n\r\n              Heat: Visit Orlando on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993926.776453
}