{
  "game_id": "0021400356",
  "espn_id": "400578648",
  "date": "Dec 15, 2014",
  "matchup": "LAL @ IND",
  "headline": "Rodney Stuckey's double-double highlights Pacers' win over Lakers",
  "body": "INDIANAPOLIS -- Rodney Stuckey had a points and rebounds double-double just twice in the last seven seasons -- the last one coming almost two years ago.\nOn Monday night he got his second in 48 hours, getting 20 points and 10 rebounds and adding seven assists to lead the Indiana Pacers over the Los Angeles Lakers 110-91.\nWith the victory over Los Angeles, Indiana snapped an eight-game losing streak. That was more important to Stuckey.\n\"I don't even care about that kind of stuff,\" he said, regarding the back-to-back double-doubles. \"It was just important for us to get a win tonight before we go on this West Coast trip. We have some tough games coming up and it was an important win.\"\n\nStuckey is averaging 12.8 points, 3.4 rebounds and 2.8 assists a game. On Monday night, he was one of Six Pacers who scored in double figures. CJ Miles scored 20, Roy Hibbert added 10, David West C.J. Watson each contributed 12 and Donald Sloan scored 17 points for Indiana.\nIndiana has been shuffling its rotations while battling injuries, relying heavily on a mixture of starters and role players. The Pacers jumped out to a 34-15 lead at the end of the first quarter. The Lakers made 3 of 20 shots, shooting 15 percent from the floor, allowing Indiana to pull away.\n\"We had great energy, we were the more energized team tonight,\" Coach Frank Vogel said. \"We just have to understand that the game is going to change. They were going to pick up their pressure and intensity. We have to handle that better, clearly. We still had a 31 point lead at the end of the third quarter, so we did enough and kept our foot on the gas.\"\nThe Pacers out-rebounded the Lakers 53-38 and their bench outscored the Lakers' 52-46. West and Lavoy Allen each grabbed nine rebounds and Hibbert and Solomon Hill each had seven rebounds.\nKobe Bryant led the Lakers in scoring with 21 points, making 8 of 26 shots from the floor. Nick Young scored 18 points and Carlos Boozer had 13 points and 10 rebounds.\n\"They jumped out to a quick lead on us and we just compounded it that we couldn't throw the ball in the ocean sitting on a boat,\" Bryant said. \"Sometimes you just have to pat yourself on the back for an atrocious job. We didn't have our legs at the start of the ball game. We just could not get ourselves activated.\"\nThe loss snapped a three-game winning streak for the Lakers. Los Angeles had just four points with a little over two minutes remaining in the first quarter and eight of their 15 first quarter points were from the foul line.\nThe Pacers biggest lead was 39 points and it came during the second quarter when they led 60-21. The Lakers cut that lead to 60-27 at halftime. The Lakers shot 16 percent from the floor for the entire first half and ended the game shooting just 33 percent.\n\"I didn't think we came ready, mentally or physically. I thought they were a desperate team,\" Coach Byron Scott said. \"They came out and jumped on us and we didn't react real well to it. The second half, obviously, we came out with more energy. We felt that we were embarrassed the way we played the first half. They were just kicking our butts.\"\nTIP INS\nPACERS: Indiana is 3-9 vs. Western Conference teams this season . The Pacers 34 first quarter points and 60 first half points were their most this season . Indiana is 5-2 when grabbing 50 or more rebounds\nLAKERS: The Lakers lost five of the last six match ups vs. the Pacers including three consecutive . The Lakers 64 second half points was the most this season\nUP NEXT\nPacers travel to Los Angeles to face the Clippers on December 17th\nLakers host the Thunder on December 19th",
  "source": "espn_api",
  "crawled_at": 1764992012.517759
}