{
  "game_id": "401810094",
  "espn_id": "401810094",
  "date": "Nov 16, 2025",
  "matchup": "PHX vs ATL",
  "headline": "Hawks rally from 22 down in 4th quarter, beat Suns 124-122 for 5th straight win",
  "body": "PHOENIX -- — Onyeka Okongwu had 27 points and the Atlanta Hawks overcame a 22-point deficit in the fourth quarter to stun the Phoenix Suns 124-122 on Sunday night.\n\n\r\n              Atlanta won its fifth straight and ended Phoenix’s winning streak at five. The Hawks finished 4-0 on a western trip.\n\n\r\n              Nickell Alexander-Walker had 26 points for Atlanta, making the first of two free throws with three seconds to go. Royce O’Neale rebounded the miss on the second one his shot from beyond halfcourt bounced off the rim.\n\n\r\n              Josh Johnson had 25 points and 10 rebounds, and Dyson Daniels 11 points and 12 assists for the Hawks, who won without All-Star guard Trae Young (right knee sprain) and center Kristaps Porzingis (right knee soreness). \n\n\r\n              Dillon Brooks had 34 points for Phoenix. Devin Booker added 27, and Colin Gillespie had 15 points, and team highs with nine rebounds and eight assists.\n\n\r\n              The Suns were without Grayson Allen (right quadriceps contusion) and Jalen Green, who will miss at least four more weeks because of a strained right hamstring.\n\n\r\n              Atlanta’s Zaccharie Risacher scored 15 points before leaving the game in the fourth quarter after an awkward fall following a dunk. He was down for several minutes before walking off under his own power. The team said after the game had had a left hip contusion.\n\n\r\n              The Suns trailed most of the first half. Atlanta led by 13 before Phoenix closed the half on a 21-7 run to lead 58-57 at the break.\n\n\r\n              Brooks scored 16 points in the third quarter, and the Suns scored the final 15 points in the period to open up a 95-77 lead.\n\n\r\n              Up next\r\n              Hawks: Host Detroit on Tuesday night.\n\n\r\n              Suns: At Portland on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042638.577271
}