{
  "game_id": "0022000538",
  "espn_id": "401267698",
  "date": "Mar 02, 2021",
  "matchup": "ATL @ MIA",
  "headline": "Hawks win McMillan's debut, top Heat 94-80",
  "body": "MIAMI -- — Trae Young took over late and made sure Nate McMillan would win his debut as interim coach of the Atlanta Hawks.\n\n\r\n                    Young scored 18 points, including 13 straight for his team in the fourth quarter, and the Hawks snapped Miami’s six-game winning streak by beating the Heat 94-80 on Tuesday night.\n\n\r\n                    John Collins scored 17 for Atlanta, which lost at Miami on Sunday and fired coach Lloyd Pierce on Monday. Kevin Huerter scored 16 for the Hawks and Clint Capela had 10 points and 17 rebounds.\n\n\r\n                    “Losing Coach Pierce, we all had to do better,\" McMillan said. “And that was the challenge to this team tonight. He took a hit because we didn't do what we were supposed to be doing out there. And I thought tonight, they did better.\"\n\n\r\n                    Duncan Robinson and Goran Dragic each scored 14 for Miami, which missed a chance to get over .500 for the first time this season. Bam Adebayo scored 11 for the Heat, who shot 37% — their fourth-worst showing of the season.\n\n\r\n                    “We had been trending much better offensively,\" Heat coach Erik Spoelstra said. “It just was a flat offensive game. It was not a fluid game for us on that side of the floor.\"\n\n\r\n                    Tony Snell added 11 for the Hawks.\n\n\r\n                    “Ugly game, but in the end you win a lot of games giving up 80 points,\" Huerter said. “Great bounceback from the last 24 hours. And now we've got to finish the first half of the season strong tomorrow in Orlando.\"\n\n\r\n                    Miami was outrebounded 47-26, by far its worst margin of the season, and was held to a season-low in points. The Heat were again without Jimmy Butler, who missed his second consecutive game with right knee inflammation.\n\n\r\n                    Miami shot 29% in the opening quarter and 36% in the half, including a 2-for-15 start from 3-point range. But by limiting Young for the second consecutive game — he had just two points by halftime and five points after three quarters — the Heat hung around, trailing 44-37 at the break and leading 66-63 going into the fourth.\n\n\r\n                    Then Young got hot in the fourth, when the Heat shot just 5 for 18, and just like that what had been the NBA’s longest active winning streak entering the night was finished.\n\n\r\n                    It was Miami's lowest point total in its home building since scoring 79 against Milwaukee on Jan. 19, 2016. The Heat were held to 85 or fewer points for the fifth time this season, by far the most in the NBA — with Butler missing four of those five games.\n\n\r\n                    “Defenses are going to be disruptive and do different things to try to guard us,\" Robinson said. “But there are always counters and ways to be effective. We just have to find solutions.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Bogdan Bogdanovic returned after missing 25 games with an avulsion fracture in his right knee. He had five points in 16 minutes. ... Atlanta had 23 turnovers to Miami’s nine and won anyway. “You're not going to win many games with that amount,\" McMillan said.\n\n\r\n                    Heat: Tyler Herro has a 3-pointer in 32 straight games, tying for the fifth-longest streak in team history. He’s one shy of matching Tim Hardaway — who had two separate 33-game streaks. ... Robinson is four away from 400 career 3-pointers. He’s played 123 games; Young is the fastest to make 400 3s in NBA history, and it took him 159 games.\n\n\r\n                    SLOW FIRST\n\n\r\n                    Just as he did Sunday in Miami, Young went scoreless in the first quarter. The last time he was blanked in the opening quarter of consecutive games was Dec. 10 and 11, 2019, against the Heat and Chicago.\n\n\r\n                    The Hawks had lost 13 consecutive games when he was scoreless in first quarters.\n\n\r\n                    SLOW HALF\n\n\r\n                    The 81 combined points at the half were the fourth fewest by halftime in an NBA game this season. Miami-Dallas had 77 on Jan. 1, New York-Cleveland on Jan. 29 had 80 and Toronto-Minnesota on Feb. 19 also had 80.\n\n\r\n                    The 37 points allowed matched Atlanta’s best first-half defensive effort in its last 145 games. The last time they gave up that few was Jan. 6, 2019 — also against Miami.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Visit Orlando on Wednesday.\n\n\r\n                    Heat: Visit New Orleans on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997643.390368
}