{
  "game_id": "0022400982",
  "espn_id": "401705548",
  "date": "Mar 16, 2025",
  "matchup": "OKC @ MIL",
  "headline": "Gilgeous-Alexander scores 31 as Thunder beat Bucks 121-105 for 10th win in last 11 games",
  "body": "MILWAUKEE -- — Shai Gilgeous-Alexander had 31 points and eight assists as the Western Conference-leading Oklahoma City Thunder defeated the Milwaukee Bucks 121-105 on Sunday night.\n\n\r\n              Isaiah Hartenstein added a career-high 24 points plus 12 rebounds to help the Thunder win for the 10th time in 11 games. Isaiah Joe scored 19 points off the bench. Chet Holmgren had 16 points and eight rebounds.\n\n\r\n              Milwaukee's Giannis Antetokounmpo had 21 points, 12 rebounds and 10 assists for his 52nd career triple-double. Damian Lillard added 19 points for the Bucks despite shooting just 3 of 9 from the floor.\n\n\r\n              Oklahoma City pulled ahead for good early in the second quarter and eventually led by as many as 25 points. The Thunder shot 51.7% while holding Milwaukee to 39.8%\n\n\r\n              Both teams were playing for a second straight night. The Thunder won 113-107 at Detroit on Saturday, while the Bucks beat the Indiana Pacers 126-119 at home.\n\n\r\n              Takeaways\r\n              Thunder: Oklahoma City showcased its depth by winning on a night when it was missing Jalen Williams and Luguentz Dort due to hip issues. Williams sat out a third straight game.\n\n\r\n              Bucks: The road doesn't get any easier for the Bucks, who follow up this lopsided home loss with a five-game trip against Western Conference teams.\n\n\r\n              Key moment\r\n              Antetokounmpo dunked to cut Oklahoma City’s lead to 46-41 with 4:42 left in the second quarter, but the Bucks wouldn’t score again until 10:26 remained in the third period. The Thunder scored 13 straight points during Milwaukee’s drought to extend their advantage to 59-41.\n\n\r\n              Key stat\r\n              The Bucks posted their lowest first-half point total of the season to trail 53-41 at the break. They were outscored 29-15 in the second quarter, matching their lowest second-quarter scoring output of the season.\n\n\r\n              Up next\r\n              The Bucks play at Golden State on Tuesday. The Thunder host the Philadelphia 76ers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997664.370754
}