{
  "game_id": "0022200954",
  "espn_id": "401469109",
  "date": "Mar 03, 2023",
  "matchup": "LAC @ SAC",
  "headline": "Sabonis hits winning free throw, Kings beat Clippers 128-127",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis made two free throws with seven seconds left to cap a near-triple double in the Sacramento Kings' 128-127 victory over the Los Angeles Clippers on Friday night.\n\n\r\n              “We found a way to steal that game,” Kings coach Mike Brown said. “We didn’t respond correctly every time and they took advantage of it. …Sabonis and Foxy, I talked about them making the All-Star game, they’re doing things that warrant All-NBA talk.”\n\n\r\n              Sabonis had 23 points, 10 rebounds and seven assists to help the Kings win their fifth straight game.\n\n\r\n              Paul George missed a 3-pointer at the buzzer for Los Angeles. He finished with 28 points, hitting a 3-pointer to give the Clippers a one-point lead with 51.2 seconds left.\n\n\r\n              Sabonis responded with a layup on the other end, and George made a layup with 33.1 seconds left to take the lead back.\n\n\r\n              De’Aaron Fox added 33 points for Sacramento for his eighth consecutive 30-point game. Harrison Barnes had 20 points and Kevin Huerter scored 18.\n\n\r\n              “It’s great,” Fox said about the season. “It’s a great feeling. It’s great because it’s my first time. This is something we want to make annual. We want to be contending for a title. …it’s great for the city and organization. We still want bigger things for ourselves.”\n\n\r\n              Russell Westbrook scored 28 points for Los Angeles, and Eric Gordon had 21. The Clippers have lost five straight.\n\n\r\n              “I thought we did a good job,” Clippers coach Ty Lue said about the offense in the fourth quarter. “Overall, just trying to get the ball in (Paul George’s) hands.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: F Kawhi Leonard (right knee injury management), Marcus Morris Sr. (left elbow contusion) and C Ivica Zubac (calf soreness) were unavailable for Los Angeles.\n\n\r\n              Kings: C Richaun Holmes was ruled out with a non-COVID illness. …Fox was given a technical with 8:18 left in the third quarter.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Minnesota on Saturday night.\n\n\r\n              Clippers: Host Memphis on Sunday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994956.845759
}