{
  "game_id": "0022000134",
  "espn_id": "401267294",
  "date": "Jan 09, 2021",
  "matchup": "CHA vs. ATL",
  "headline": "LaMelo Ball becomes youngest NBA player with triple-double",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball isn't wasting any time making an impact in the NBA.\n\n\r\n                    The rookie point guard became the youngest player in league history to record a triple-double, with 22 points, 12 rebounds and 11 assists on Saturday night, helping the Charlotte Hornets beat the Atlanta Hawks 113-105 for their third straight win.\n\n\r\n                    “A 19-year-old rookie does not look like this,” Hornets coach James Borrego said. \"This is rare what you’re seeing.”\n\n\r\n                    Ball's history-making performance came just two nights after he missed out on his first triple-double when he finished with 12 points, 10 rebounds and nine assists in a win over his brother Lonzo's New Orleans Pelicans.\n\n\r\n                    He said he hasn't begun to process the accomplishment.\n\n\r\n                    “I live my life and I know what I’m capable of, so stuff like doesn’t move me like that,\" Ball said. “I know that's supposed to happen.”\n\n\r\n                    Ball replaced Markelle Fultz as the youngest NBA player to record a triple-double by 177 days.\n\n\r\n                    “He's a tall PG who can pass, can rebound and he's a smart player,” said Atlanta's Trae Young. “Things are going to become even easier for him in this league as he plays more and more games.”\n\n\r\n                    Terry Rozier had 23 points to lead the Hornets. \n\n\r\n                    Cam Reddish scored 21 points and De’Andre Hunter had 20 for the Hawks. Young struggled all night, shooting 5 of 19 from the floor to finish with 15 points and 10 assists.\n\n\r\n                    Ball tied his highest scoring night on 9-of-13 shooting from the field as the Hornets handed the struggling Hawks their fourth consecutive loss. He became only the fifth rookie in NBA history to record a triple-double and the first Hornets player to do it coming off the bench.\n\n\r\n                    Borrego said he loves Ball's spirit and his energy, but what has impressed him the most is his poise and confidence.\n\n\r\n                    “He's not rattled by the moment. It's like he's been doing this for a number of years,\" Borrego said of Ball, who played overseas before becoming the third pick in the NBA draft.\n\n\r\n                    Ball had several sharp passes, including a perfect behind-the-back strike to set up a 3-pointer by P.J. Washington.\n\n\r\n                    “It's tough because you don't know when it's coming. He might throw it behind his head, behind his back or straight to you,” joked Washington, who also had 22 points and was on the receiving end of several of Ball's passes. “You have to be active and aware when he has the ball. It's always fun playing with a guy like that.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Bogdan Bogdanovic got the start over Reddish but left in the second quarter with a knee injury and did not return. There was no immediate update on his injury.\n\n\r\n                    Hornets: Charlotte came in leading the league in assists and had 27 against the Hawks. ... Gordon Hayward finished with 13 points after averaging 35 points over the past two games.\n\n\r\n                    YOUNG'S INJURY\n\n\r\n                    Young had his wrist iced after the game, saying he fell on it while trying to take a charge. He had X-rays after the game but said it is “nothing severe,” although he added “it's definitely hurting.”\n\n\r\n                    Young doesn't seem too concerned about failing to make a 3-pointer in his last two games.\n\n\r\n                    “You never get too high or too low,” Young said. “Whenever shots aren't going I understand the work that I put in and I know it's going to pay off.”\n\n\r\n                    WASHINGTON BLOCKING SHOTS\n\n\r\n                    The 6-foot-7 Washington has been asking the play the 5 position for the Hornets when they go to a small-ball lineup and he has responded well. He had six blocks against the Hawks as the Hornets got back to .500 on the season.\n\n\r\n                    \"I love blocking shots because it gets us out in transition,\" Washington said.\n\n\r\n                    UP NEXT \n\n\r\n                    Hawks: Return home Monday night to host the 76ers, the first meeting of the teams this season.\n\n\r\n                    Hornets: Back home on Monday night against the Hawks as they continue a grueling stretch of six games in nine nights.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997045.881886
}