{
  "game_id": "0022000667",
  "espn_id": "401307456",
  "date": "Mar 24, 2021",
  "matchup": "IND vs. DET",
  "headline": "Pacers defeat Pistons 116-111, snap 6-game home winless skid",
  "body": "INDIANAPOLIS -- — Caris LeVert's transition to fitting in with the Indiana Pacers was delayed two months by kidney surgery to remove a cancerous mass.\n\n\r\n                    Acquired in a three-team trade on Jan. 16 that involved All-Stars James Harden and Victor Oladipo, LeVert didn't play again until just recently.\n\n\r\n                    His seventh Pacers start was his best yet with 28 points in a 116-111 victory over the Detroit Pistons on Wednesday night.\n\n\r\n                    “I felt like I've tried to be aggressive from day one,” LeVert said, “but it takes time.”\n\n\r\n                    LeVert's fourth 3-pointer with 4.7 seconds remaining enabled the Pacers to snap a six-game home losing streak. \n\n\r\n                    “Very big shot,” Pacers coach Nate Bjorkgren said. “His legs are getting under him more and more each day.”\n\n\r\n                    It's the first time LeVert has surpassed 20 points with his new team.\n\n\r\n                    “I love fourth quarters. I love big moments,” he said. “Every win is important for us right now as we try to make the playoffs.”\n\n\r\n                    The Pacers (20-23) ended their worst winless stretch at home since losing six in a row in 1985. The Pistons (12-31) have the Eastern Conference's worst record.\n\n\r\n                    Edmond Sumner scored 18 points off the bench and Malcolm Brogden scored 16 for the Pacers.\n\n\r\n                    Jerami Grant led the Pistons with 29 points. Saddiq Bey and Wayne Ellington each scored 16.\n\n\r\n                    Levert accounted for the Pacers' last eight points of the first half for a 57-51 lead. The guard scored 15 of 17 first-half points in the second quarter.\n\n\r\n                    The Pistons committed nine of their 15 turnovers in the second quarter to continue a seasonal trend of erratic ballhandling. That meant playing catch-up in the second half.\n\n\r\n                    “This is about execution and making the easy pass,” Bey said.\n\n\r\n                    The Pistons rallied to cut the deficit to 78-76 with 2:15 remaining in the third, but the Pacers bench responded as reserves George Bitadze and Jeremy Lamb sank 3-pointers. The Pacers finished the quarter with an 86-79 lead.\n\n\r\n                    The Pistons tied the game at 92 on an Ellington jumper with 8:23 remaining.\n\n\r\n                    Detroit had a chance to tie or go ahead in the final minute, but Delon Wright committed a turnover.\n\n\r\n                    “At the end of the game, again, we had an untimely turnover,\" Pistons coach Dwane Casey said.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: After making a season-low 4 of 25 3-pointers in Sunday's home loss to Chicago, Detroit had four 3-pointers by the early minutes of the second quarter and were 6 of 15 from beyond the arc in the first half.\n\n\r\n                    Pacers: Have had a winning record at home for 31 consecutive seasons, but must finish 11-5 at Bankers Life Fieldhouse to extend that streak.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host Brooklyn on Friday.\n\n\r\n                    Pacers: Visit Dallas on Friday.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997135.69286
}