{
  "game_id": "0021600176",
  "espn_id": "400899626",
  "date": "Nov 18, 2016",
  "matchup": "PHX @ IND",
  "headline": "Brandon Knight scores 17 points, Suns beat Pacers 116-96",
  "body": "INDIANAPOLIS --  Brandon Knight and the Phoenix Suns' backups outlasted the Indiana Pacers on Friday night.\n\nKnight scored 17 points and helped the bench players combine for an NBA season-best 78 points in the Suns' 116-96 victory over the Pacers.\n\nJared Dudley added 16 points, Alan Williams had 15 points, and Devin Booker and Leandro Barbosa 13 each. The Suns improved to 4-9 with their second road victory.\n\n\"Every day is like a blank canvas for us,\" coach Earl Watson said. \"The good thing is, we're the artists of that blank canvas. The mindset in getting our guys to learn to bring it every night is the process, the journey for us.\"\n\nMyles Turner led the Pacers with 22 points, and Jeff Teague had 21 points and seven assists.\n\n\"We went through the motions. We were on our heels,\" Indiana coach Nate McMillan said. \"It was bad out there. The game should fire you up. When they toss the ball up, you should be ready to go and (on Friday) we weren't.\"\n\nThe Pacers rallied to take their first lead with 7:46 left in the third quarter on Turner's basket. But the Suns pulled ahead again, with Knight scoring all 12 points of his points in the period in a 2 1/2-minute stretch. Phoenix outscored Indiana 27-14 in the fourth.\n\n\"Basketball is a game of runs and we were able to get stops eventually,\" Knight said. \"They started making a lot of shots and when we got consecutive stops, it led to us getting baskets.\"\n\nPacers All-Star Paul George did not play for the second time in four games. He's battling soreness in his left ankle after turning his ankle in Indiana's overtime loss at Philadelphia on Nov. 11. He's scheduled for an MRI on Saturday to assess the severity of the injury.\n\nTIP-INS:\n\nPhoenix: The game was the fourth back-to-back Phoenix has played through 13 games ... Eric Bledsoe and Alex Len were both called for technical fouls for arguing foul calls with official Dan Crawford. ... Phoenix is 2-1 against the Eastern Conference. ... The Suns have won 16 of the last 22 meetings with the Pacers and nine of the last 12 at Indiana.\n\nIndiana: Rodney Stuckey played for the first time since opening night after missing 10 games with strained right hamstring. ... CJ Miles left the game with three minutes left in the first quarter with a left knee injury and did not return to the game ... The contest was the fourth in a stretch for the Pacers that has them playing eight of nine games at home.\n\nREMEMBERING HOOSIERS:\n\n\"Hoosiers\" screenwriter Angelo Pizzo and director David Anspaugh, along with actors who portrayed fictional Hickory High School in the 1986 basketball classic -- including Maris Valainis, who played Jimmy Chitwood -- were in attendance. The Pacers' first \"Hickory Night\" coincides with the 30th anniversary of the movie's release.\n\nBLUEGRASS STATE SUPPORT\n\nWith four Kentucky products on the roster, the Suns had a contingency of about 75 fans cheering behind their bench Friday. Lexington is roughly 190 miles from Indianapolis, and the Kentucky fans watched solid performances from Knight, Booker, Bledsoe and rookie Tyler Ulis.\n\nUP NEXT:\n\nPhoenix visits Philadelphia on Saturday in the fourth game of a six-game trip.\n\nIndiana is on the road Sunday at Oklahoma City, then hosts defending Western Conference champion Golden State on Monday.",
  "source": "espn_api",
  "crawled_at": 1764996005.3770618
}