{
  "game_id": "0022401152",
  "espn_id": "401705718",
  "date": "Apr 08, 2025",
  "matchup": "MIL vs. MIN",
  "headline": "Bucks rally from 24-point, 4th-quarter deficit to beat Timberwolves 110-103",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 23 points, 13 rebounds and 10 assists for his third straight triple-double as the Milwaukee Bucks erased a 24-point, fourth-quarter deficit to beat the Minnesota Timberwolves 110-103 on Tuesday night.\n\n\r\n              Milwaukee won its fifth straight and snapped Minnesota’s five-game winning streak by producing the Bucks' biggest fourth-quarter comeback since at least 1996-97, when the NBA began tracking play-by-play data. The Bucks had lost the last 276 regular-season or playoff games in which they had fallen behind by at least 20 points in the fourth quarter.\n\n\r\n              After trailing 95-71 with less than 10 minutes left, Milwaukee scored 23 straight points and eventually tied it 97-all on AJ Green’s 3-pointer with 3:36 left.\n\n\r\n              On the Timberwolves’ next possession, Milwaukee’s Kevin Porter Jr. and Minnesota’s Rudy Gobert got in a skirmish that resulted in technical fouls for both players. Milwaukee’s Gary Trent Jr., who was jawing at Gobert at the end of the confrontation, got an additional technical foul.\n\n\r\n              Anthony Edwards made a free throw to give Minnesota a 98-97 lead. But on Minnesota’s ensuing possession, Bobby Portis stole the ball from Edwards to set up a Porter dunk that put Milwaukee ahead for good and started an 8-0 run.\n\n\r\n              Porter ended up with 21 points. Portis had 18 points and 10 rebounds in his return from a 25-game suspension.\n\n\r\n              Edwards scored 25 points for Minnesota. Donte DiVincenzo added 24 and Naz Reid had 17.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota blew an opportunity to help itself in the wide-open Western Conference race. The Timberwolves (46-33) entered Tuesday in a four-way tie for fifth place in the West, just a half-game behind fourth-place Denver.\n\n\r\n              Bucks: Antetokounmpo continued his hot streak as he returned after missing one game with tendinopathy in his left shoulder. Antetokounmpo had 35 points, a career-high 20 assists and 17 rebounds in a 126-113 victory at Philadelphia. He followed that up by getting 36 points, 15 rebounds and 10 assists in a 121-115 overtime triumph at Miami.\n\n\r\n              Key moment\r\n              The Timberwolves led 95-71 when Trent made a 3-pointer while getting fouled with 9:53 remaining. Trent then made his ensuing free throw to complete a four-point play that started the 23-0 run that got Milwaukee back into the game.\n\n\r\n              Key stat\r\n              Milwaukee outscored Minnesota 39-8 over the last 10 minutes.\n\n\r\n              Up next\r\n              Both teams will play again on Thursday. The Timberwolves visit Memphis, while the Bucks host New Orleans.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997813.898217
}