{
  "game_id": "0021601000",
  "espn_id": "400900395",
  "date": "Mar 14, 2017",
  "matchup": "OKC @ BKN",
  "headline": "Westbrook has 33rd triple-double, Thunder beat Nets 122-104",
  "body": "NEW YORK --  Russell Westbrook was puzzled, wondering why fans roared for a missed shot by the home team.\n\n\"I thought something happened,\" Westbrook said. \"I was really wondering why they were screaming so loud. I thought that maybe they were giving something out in the crowd or something.\"\n\nNope. Just enjoying one of the best shows in basketball.\n\nWestbrook had 25 points, 19 assists and 12 rebounds in his 33rd triple-double of the season, and the Oklahoma City Thunder beat the Brooklyn Nets 122-104 on Tuesday night.\n\nWestbrook shot just 6 of 18 from the field after scoring 40 or more points in five of his previous eight games, but as usual, he was the dominant player on the floor even when his shot didn't fall.\n\nHe was caught off guard by the appreciation from what was a mostly full and lively crowd despite a winter storm that pounded New York on Tuesday. Fans rewarded him with \"MVP! MVP!\" chants and even yelled to him how many rebounds he needed for his triple-double.\n\nHe finally got it with 4:50 left on a missed shot by Brook Lopez. Teammate Taj Gibson was in better rebounding position, but appeared to turn so Westbrook could grab it for the 70th triple-double of his career.\n\n\"I wanted him to get the triple-double,\" Gibson said. \"I leaned away. I wanted him to get it.\"\n\nVictor Oladipo added 21 points for the Thunder, who won their third straight game. Enes Kanter had 17 points and Brooklyn native Gibson finished with 17 points and eight rebounds.\n\nLopez scored 25 points and Jeremy Lin had a season-high 24 for the Nets, who left impressed by Westbrook after failing in their attempt to win consecutive games for the first time this season.\n\n\"He had a great game. He picked us apart,\" Lin said. \"He made a lot of great reads and I think for me, it's just a good learning experience being able to go back, watch film and see what he does, see the sets they put us in, how they use their personnel.\"\n\nComing off victories over division leaders San Antonio and Utah, the Thunder took a little while to warm up on a snowy day. The teams were tied at 32 after one quarter and 62 at halftime, but the Thunder limited the Nets to 5-of-17 shooting in the third quarter to open a 91-83 lead.\n\nKanter then dominated the early minutes of the fourth as Oklahoma City pushed its lead into double digits and snapped a seven-game road losing streak.\n\nWestbrook already had nine points and eight assists after one quarter and was two-thirds of the way to a triple-double by halftime, but he had only seven rebounds as the Nets' 57.5 percent shooting didn't leave many rebounding opportunities.\n\nTIP-INS\n\nThunder: Oklahoma City is 60-10 when Westbrook has a triple-double. ... Alex Abrines scored 13 points off the bench.\n\nNets: Reserve guard Sean Kilpatrick was limited to just seven minutes in the first half before leaving with a sore left hamstring. ... Rookie Caris LeVert scored 16 points.\n\nSAY NO TO SNOW\n\nOklahoma City coach Billy Donovan grew up on Long Island but has spent most of his adult life in warmer weather, with 19 seasons as the coach at the University of Florida. He was asked if he missed the snow.\n\n\"I do not miss the snow, no. I don't miss the cold. I like the warmth,\" Donovan said. \"I like New York like right around near July, September. August. Those months are good.\"\n\nPRAISING THE POINT GUARD\n\n\"He put his fingerprints all over the game in so many different ways in my opinion.\" -- Donovan, on Westbrook.\n\nUP NEXT\n\nThunder: Visit Toronto on Wednesday, trying to earn a split of the season series.\n\nNets: Visit Knicks on Thursday. Brooklyn beat New York 120-112 at home on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995258.7895381
}