{
  "game_id": "0022400307",
  "espn_id": "401704873",
  "date": "Dec 01, 2024",
  "matchup": "CLE vs. BOS",
  "headline": "Mitchell scores 35, Cavs end Celtics' winning streak with 115-111 win in matchup of East's elite",
  "body": "CLEVELAND -- — Donovan Mitchell scored 20 of his 35 points in the fourth quarter as the Cleveland Cavaliers ended Boston's seven-game winning streak with a 115-111 victory over the Celtics on Sunday night in the second intense matchup between the Eastern Conference’s top teams this season.\n\n\r\n              Mitchell made all six field-goal attempts — including four 3-pointers — in the fourth as the Cavs overcame a 12-point deficit. The All-Star guard scored 30 points in the second half after going just 2 of 8 from the floor in the first.\n\n\r\n              Darius Garland added 22 points for Cleveland, which got some revenge on Boston after the defending NBA champions handed the Cavs their first loss on Nov. 19 following a 15-0 start.\n\n\r\n              Jayson Tatum scored 33 points and Payton Pritchard 24 for the Celtics, who led 93-81 in the fourth before Mitchell took over. Kristaps Porzingis added 21 points for Boston.\n\n\r\n              The Celtics played without two starters: Jaylen Brown (illness) and Derrick White (foot sprain).\n\n\r\n              Takeaways\r\n              Celtics: Even short-handed, they pose so many problems with their offensive balance and arsenal of outside shooters. \n\n\r\n              Cavaliers: Mitchell showed why he's one of the league's best all-around players, shaking off a recent shooting slump (he went 5 of 23 in a loss to Atlanta on Friday) by making every big play down the stretch.\n\n\r\n              Key moment\r\n              With Boston trailing 113-110 with 5 seconds left, Pritchard made his first free throw before intentionally missing his second while hoping for a long rebound. However, he got called for stepping into the lane too early, giving the ball back to Cleveland. Mitchell then put it away with two free throws.\n\n\r\n              Key stat\r\n              Mitchell came in shooting just 40% (42 of 104) in his last five games.\n\n\r\n              Up Next\r\n              Celtics host Miami on Monday to begin a stretch of four home games in six nights, and Cavaliers host Washington on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998324.165065
}