{
  "game_id": "0022401191",
  "espn_id": "401705757",
  "date": "Apr 13, 2025",
  "matchup": "CHI @ PHI",
  "headline": "Bulls get ready for NBA play-in game with 122-102 win over 76ers in regular-season finale",
  "body": "PHILADELPHIA -- — Kevin Huerter hit five 3-pointers and scored 18 points and the Chicago Bulls warmed-up for the play-in game with a 122-102 win over the Philadelphia 76ers on Sunday.\n\n\r\n              The Bulls are the No. 9 seed in the Eastern Conference for the second straight season and will make their third straight appearance in the play-in tournament. The Bulls play the Heat on Wednesday night.\n\n\r\n              Talen Horton-Tucker scored 17 points in a largely meaningless game for both teams.\n\n\r\n              The Bulls had been locked in to their play-in spot. The 76ers finished with only 24 wins and finished the season on a 5-31 stretch.\n\n\r\n              Lonnie Walker IV hit eight 3-pointers and scored 31 points for the Sixers. Jared Butler added 19 points.\n\n\r\n              Takeaways\r\n              Bulls: Bulls coach Billy Donovan expected injured guard Josh Giddey (right wrist) to return for Wednesday's play-in game against Miami. Giddey averaged 14.6 points, 8.1 rebounds and 7.6 assists this season.\n\n\r\n              76ers: The 76ers finished perhaps — given the weight of the expectations with three All-Stars and a massive payroll — their worst season in franchise history. Paul George, Joel Embiid and Tyrese Maxey played all of 15 games together this season. The trio played a combined 119 games. Embiid, a two-time scoring champion, played only 19.\n\n\r\n              Key moment\r\n              The Bulls outscored the 76ers 37-19 in the third quarter to wipe out a halftime deficit.\n\n\r\n              Up next\r\n              The ninth-seeded Bulls host No. 10 Miami on Wednesday in an elimination game.\n\n\r\n              The 76ers are guaranteed at least the fifth-best odds in the NBA draft lottery. That spot gives them a 10.5% chance at getting the top overall pick. They missed the postseason for the first time since the 2016-17 season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997017.627146
}