{
  "game_id": "0021900281",
  "espn_id": "401160923",
  "date": "Nov 30, 2019",
  "matchup": "IND @ PHI",
  "headline": "Embiid, Simmons lead 76ers past Pacers, 119-116",
  "body": "PHILADELPHIA --  Ben Simmons stole a game for the 76ers.\n\nSimmons had three steals in the final 13.9 seconds to lead Philadelphia to a 119-116 victory over the Indiana Pacers on Saturday night.\n\n\"I love being able to get steals and turn guys over,\" said Simmons, who finished with 15 points, 13 assists, six rebounds and four steals. \"I take pride in it and it gives us energy.\"\n\nThe Pacers led 114-113 with a chance to go up more when Simmons intercepted T.J. Warren's pass with 13.9 seconds remaining, then assisted Tobias Harris for a breakway dunk that gave Philadelphia the lead with 9.9 seconds remaining.\n\n\"I was going to steal it,\" Simmons said. \"If everybody on the backside does their job, it's easier to make a play.\"\n\nAfter a timeout, Simmons then stole Jeremy Lamb's inbounds pass with 7.9 seconds remaining. That led to two free throws by Harris that gave the 76ers a 117-114 advantage with 5.1 ticks left. Malcolm Brogdon then made a pair of free throws after being fouled intentionally before Joel Embiid followed with his own two foul shots for a 119-116 Philadelphia lead with 2.8 seconds to play.\n\nSimmons clinched it for the 76ers when he stole Lamb's three-quarter court inbounds pass.\n\n\"Those turnovers late were costly,\" Pacers coach Nate McMillan said. \"That was poor execution on our part.\"\n\nEmbiid had 32 points and 11 rebounds and was 15 for 15 from the free throw line. In three games since going scoreless for the first time in his career at Toronto on Nov. 25, the star center is averaging 30.7 points and 14.7 rebounds while making 40 of 44 foul shots.\n\n\"I changed my mindset,\" Embiid said. \"I hadn't been as aggressive, so I've been more aggressive creating contact and causing other people to foul me.\"\n\nHarris scored 22 points for Philadelphia, which won its third straight while improving to 9-0 at home.\n\nWarren had 29 points and Brogdon added 28 for the Pacers, who had won five straight. Indiana opened a grueling five-game, seven-day road trip.\n\nBoth teams were playing the second game of a back-to-back, but neither offense was sluggish.\n\nIndiana finished 55% (42 of 76) from the field while Philadelphia shot 49% (38 of 77).\n\nTIP-INS\n\nPacers: T.J. McConnell finished with six points and three assists in 11 minutes in his return to Philadelphia, where he played from 2015-19. . Shot 50% (11 of 22) from 3-point range and 84% (21 of 25) from the foul line.\n\n76ers: Josh Richardson (right hamstring strain) missed his second straight game. . Simmons took and missed a 21-foot jump shot with 4:05 left in the third. . Both Simmons and coach Brett Brown were assessed technical fouls by referee Natalie Sago. . Embiid was issued a Flagrant 1 for his foul on Domantas Sabonis with 9:49 remaining in the second.\n\nT.J. THE GREAT\n\nBrown spoke glowingly before the game about McConnell, who played the previous four seasons for the 76ers and was with Brown at the beginning of the rebuilding process.\n\n\"I just loved how hard he played,\" Brown said. \"He plays with his heart on his sleeve and this city loves him.\"\n\nBrown said the intangibles are part of what attracted him to McConnell, but the guard showed he's more than just an \"effort\" guy.\n\n\"He can actually play and play well,\" Brown said. \"I'm very proud of him for his journey. I have a fondness for that man.\"\n\nMcConnell was feted with a video tribute in the first quarter, then received a standing ovation and was embraced by Brown when he entered with 2:59 left in the first. He also was presented a framed 76ers jersey prior to the contest by general manager Elton Brand.\n\nHOME-COURT ADVANTAGE\n\nSimmons praised Philadelphia's fans for helping the team remain perfect at home.\n\n\"We have the best fans in the NBA,\" he said. \"You go anywhere else and there's no atmosphere like it. We want to give everything we have to our city. It's a big responsibility.\"\n\nUP NEXT\n\nPacers: At Memphis on Monday.\n\n76ers: Host Utah on Monday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995872.0763352
}