{
  "game_id": "0022200109",
  "espn_id": "401468264",
  "date": "Nov 02, 2022",
  "matchup": "MIA vs. SAC",
  "headline": "Herro's 3 with 1.8 seconds left lifts Heat by Kings, 110-107",
  "body": "MIAMI -- — Tyler Herro's vision is fine again.\n\n\r\n              Herro's 3-pointer with 1.8 seconds left became the game winner, lifting the Miami Heat past the Sacramento Kings 110-107 on Wednesday night.\n\n\r\n              Herro had a game-high 26 for the Heat, who won for the second straight night after topping Golden State on Tuesday. Herro missed much of that game after temporarily losing vision after getting poked in the left eye.\n\n\r\n              “I got all the space I needed to knock it down,\" Herro said. “Great win for us.\"\n\n\r\n              The Kings saw his last shot from a bit of a different perspective.\n\n\r\n              “Tyler Herro's a great player,\" Kings coach Mike Brown said. “But he traveled. He traveled on the last play. I would not be doing my job if I didn't come up here and protect my guys.\"\n\n\r\n              Kyle Lowry scored a season-high 22 and Bam Adebayo added 20 for Miami.\n\n\r\n              Kevin Huerter and Domantas Sabonis each scored 22 for Sacramento, which got 19 from Malik Monk and 12 from Harrison Barnes. Sabonis added 12 rebounds and eight assists.\n\n\r\n              It was the first game in the NBA this season where neither team held a lead of more than seven points. Sacramento's biggest lead was seven, Miami's was six.\n\n\r\n              Herro added 12 rebounds and three blocks for Miami, which played without Jimmy Butler — sidelined with tightness in his left hip that caused him to miss his first game of the season. Sacramento was without De’Aaron Fox, who sat with a bone bruise on his right knee.\n\n\r\n              Calling this one back-and-forth wouldn’t do it justice.\n\n\r\n              “These are games you want to be in, for sure,” said Huerter, who has scored 75 points over his last three games.\n\n\r\n              There were 12 ties and 26 lead changes, and an 11-1/2 minute stretch of the second half where neither team led by more than three points. Davion Mitchell’s 3-pointer with 8:11 left in the third got the Kings within 62-59, and it stayed that way — a three-point-or-less game — until Huerter made a layup with 8:58 remaining to put Sacramento up 86-81.\n\n\r\n              The Kings led by seven off another score from Huerter with 7:27 remaining. Miami went up 103-99 on a 3-pointer by Strus with 1:43 left, the game was tied three more times from there — until Herro's 3 decided matters.\n\n\r\n              “That was a big-time shot,” Heat coach Erik Spoelstra said. “The only criticism I had was he left a couple seconds on the clock.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: Fox went through a pregame workout, which the Kings took as a good sign. His knee issue is not expected to be a long-term problem. ... Kings backup C Alex Len is from Ukraine, but this was a bit of a homecoming. He has an offseason residence in Miami Lakes, about 20 miles from the arena the Heat call home.\n\n\r\n              Heat: Victor Oladipo (left knee) and Omer Yurtseven (left ankle) still have yet to play this season. ... Vincent missed a free throw midway through the second quarter, snapping a run of 23 consecutive makes from the line by Miami. The Heat were 20 for 20 on Tuesday vs. Golden State.\n\n\r\n              CHALLENGING\n\n\r\n              The Kings challenged an offensive foul call against Sabonis, a surprise because of the timing (35.9 seconds left in the first half) and the situation (it was only his first foul). Sabonis entered Wednesday with 28 fouls so far this season, tied for fifth-most in the NBA. The Kings have found many of those calls puzzling.\n\n\r\n              PAYBACK\n\n\r\n              Miami lost last week at Golden State and Sacramento. This week, they returned home and beat those teams.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit Orlando on Saturday, ending a five-day swing through Florida.\n\n\r\n              Heat: Visit Indiana on Friday, a quick one-game trip.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995200.0588002
}