{
  "game_id": "0022401179",
  "espn_id": "401705745",
  "date": "Apr 11, 2025",
  "matchup": "MIN vs. BKN",
  "headline": "Timberwolves beat depleted Nets 117-91 behind Gobert's 35 points to close in on top-6 finish",
  "body": "MINNEAPOLIS -- — Rudy Gobert matched his career high with 35 points and had 11 rebounds for Minnesota in a 117-91 victory over the Brooklyn Nets on Friday night that put the Timberwolves on the brink of a top-six finish that would avoid the play-in games.\n\n\r\n              Julius Randle added 21 points for the Timberwolves (48-33), who would win the majority of multi-team tiebreakers within the cluster of clubs that have pinballed back and forth for weeks in the Western Conference from third through eighth place.\n\n\r\n              One problem: Anthony Edwards picked up his 18th technical foul of the season. That prompted an automatic suspension for the next game on Sunday that the Timberwolves will need to win to improve their seed. \n\n\r\n              Edwards had just nine points while shooting 1 for 7 from 3-point range. He scored 44 points and went 7 for 11 from deep to lead Minnesota's 141-125 win at Memphis the night before.\n\n\r\n              Keon Johnson scored 20 points for the Nets (26-55), who will finish with their worst record in eight years.\n\n\r\n              Takeaways\r\n              Nets: The scratch list included the entire starting frontcourt of Nic Claxton, Cam Johnson and Ziaire Williams. Claxton (rest) and Williams (knee) both played on Thursday. The starting lineup included rookies Reece Beekman and Drew Timme with Trendon Watford the oldest at 24.\n\n\r\n              Timberwolves: The absence of the 6-foot-10 Claxton and the lack of incentive for the Nets gave Gobert plenty of space to operate in the paint. He went 13 for 17 from the floor.\n\n\r\n              Key moment\r\n              Edwards was whistled for a foul while closely guarding Johnson on the wing midway through the second quarter. After a complaint to official Ray Acosta, he quickly got the technical, too.\n\n\r\n              Key stat\r\n              The Timberwolves are 26-10 this season when Randle has scored 20-plus points.\n\n\r\n              Up next\r\n              The Nets finish at home against New York on Sunday, when the Timberwolves host Utah. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998069.506649
}