{
  "game_id": "0022301118",
  "espn_id": "401585746",
  "date": "Apr 05, 2024",
  "matchup": "SAC @ BOS",
  "headline": "Pritchard scores 21, Celtics hold off late charge by Kings to hold on for 101-100 win",
  "body": "BOSTON -- — Payton Pritchard had 21 points, including five 3-pointers and the Boston Celtics held off a late charge to beat the Sacramento Kings 101-100 on Friday night.\n\n\r\n              Kristaps Porzingis added 20 points and 11 rebounds – his second straight double-double – to help the NBA’s top team claim its 12th consecutive win at home one game after clinching home-court advantage throughout the playoffs. They’ve won 13 of their last 15.\n\n\r\n              De’Aaron Fox had 40 points for the Kings and banked in a go-ahead 26-footer with 27 seconds to play. But after Celtics reserve Xavier Tillman put Boston back in front, Fox misfired on a jumper – one of three potential game-winning shots for the Kings in the final 7 seconds as the Celtics survived. \n\n\r\n              Boston coach Joe Mazzulla rested his starters throughout the fourth quarter and left his reserves on the floor late.\n\n\r\n              \"It's good for our team chemistry — those kinds of moments,\" Porzingis said. “And seeing Joe all hyped up on the sidelines. It was pretty cool. A good win for us.”\n\n\r\n              Domantas Sabonis added 16 points and 16 rebounds for the Kings, who have lost four of their last six as they try to avoid a spot in the play-in tournament. \n\n\r\n              “Fox was phenomenal, especially down the stretch with him having 40. ... He stepped up like he should have. Gave us a chance to win,” Kings coach Mike Brown said. “We did just didn't shoot the ball well.”\n\n\r\n              For the game, Sacramento shot just 38% (38 for 99) and were 17 for 51 (33%) from the 3-point line.\n\n\r\n              Sabonis said they missed a great opportunity to move up in the tight Western Conference race.\n\n\r\n              “We let one slide,” Sabonis said. “We had a chance to come back and steal a game from them and we couldn't. ... We have five games left and Brooklyn's next. We've got to take care of business.”\n\n\r\n              The Kings cut a 19-point fourth deficit to 99-97 on a driving layup by Fox. \n\n\r\n              Colby Jones blocked Pritchard’s jumper on Boston’s next possession, followed by Fox's 3-pointer that gave Sacramento its first lead since the first quarter. \n\n\r\n              Sam Hauser had his short jumper blocked by Keegan Murray on the Celtics’ ensuing possession. But Tillman was able to corral it and score to put Boston back in front for good.\n\n\r\n              The Kings trimmed a 16-point first-half deficit to 54-50 by halftime, but the Celtics outscored them 30-22 in the third quarter to take a 12-point lead to the fourth. \n\n\r\n              Both teams struggled to score in the first five-plus minutes of the game. Boston started just 1 for 10 from the field and Sacramento opened 1 for 8.\n\n\r\n              The Celtics found their touch, ending the first quarter by connecting on 9 of their final 10 shots. The Kings finished 5 of 21.\n\n\r\n              Boston’s lead reached double-digits in the second quarter, but it needed every part of the basket at times to get it there. During one possession, Payton Pritchard fired up a deep 28-footer from beyond the top of the key. The ball bounced high off the back of the rim, clipped the front lip and then rolled off the glass before falling in. \n\n\r\n              Boston was without starters Jaylen Brown and Derrick White. \n\n\r\n              Brown sat with the sprained left hand that also kept him out of Monday’s win over Charlotte. Brown called it a ligament-related issue and acknowledged it was bothering him during Wednesday’s victory over Oklahoma City. Coach Joe Mazzulla said that Friday’s absence was about managing the issue and that he didn’t anticipate Brown being sidelined for the rest of the regular season. \n\n\r\n              White, who has started 70 of Boston’s 77 games this season, was out with a bruised lower back. \n\n\r\n              UP NEXT\n\n\r\n              Kings: At Nets on Sunday.\n\n\r\n              Celtics: Host Trail Blazers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996780.378613
}