{
  "game_id": "0021800695",
  "espn_id": "401071371",
  "date": "Jan 21, 2019",
  "matchup": "ATL vs. ORL",
  "headline": "Fournier, Vucevic power Magic past Hawks, 122-103",
  "body": "ATLANTA --  Though only 11th in the Eastern Conference standings, the Orlando Magic are talking about their playoff hopes.\n\nOne spot back in 12th, the Atlanta Hawks have not shown the consistency needed to join that discussion.\n\nEvan Fournier and Nikola Vucevic scored 29 points apiece to lead the Magic to a 122-103 victory over the Hawks on Monday in the season's first matchup between the Southeast Division rivals.\n\nVucevic had 14 rebounds and Fournier had seven assists as Orlando snapped a three-game losing streak.\n\nDewayne Dedmon led Atlanta with 24 points on the holiday celebrating Martin Luther King Jr. and in the city where the civil rights leader was born.\n\nThe Magic had targeted road games this week against the Hawks and Nets as starting points for a turnaround.\n\n\"We said these next couple games can define our season,\" Vucevic said. \"... We understand if we don't wake up it's going to be really, really hard for us.\"\n\nThe win left the Magic only 2 1/2 games behind eighth-place Charlotte in the East.\n\n\"We're doing everything we can to get into that eighth spot,\" Fournier said.\n\nBy contrast, Atlanta is 5 1/2 games behind Orlando in the conference standings. The young Hawks have lessons to learn about consistency.\n\n\"In the first quarter I thought we were good,\" said rookie Trae Young, referring to Atlanta's 31-28 early lead. \"After that we were just out of rhythm, up and down from there. I don't know what happened.\"\n\nBefore the unusually late first game between division rivals, Magic coach Steve Clifford and Atlanta coach Lloyd Pierce both expressed uncertainties about the matchups. \"I think we'll have to adjust on the fly,\" Pierce said.\n\nThe Hawks struggled to find an answer for Vucevic. The 7-foot center made only one 3-pointer but found most of his points near the basket. He made 12 of 23 shots from the field.\n\nVucevic also made an impact on defense, blocking an Alex Len shot when Atlanta trailed by eight points, 103-95. D.J. Augustin's 3-pointer pushed Orlando's lead back to double figures, 106-95. The Hawks didn't mount another serious surge.\n\nDedmon forced Vucevic to play defense far from the basket. Dedmon made five of seven 3-pointers.\n\nAtlanta led 44-38 before Orlando scored 12 straight points for a 50-44 advantage. The Magic led 60-57 at halftime and stretched the advantage to 91-78 through three quarters.\n\nYoung had 21 points. John Collins had 14 points and 10 rebounds.\n\nTIP-INS\n\nMagic: F Aaron Gordon (sore lower back) missed his second straight game. Clifford said Gordon is doing better but added: \"There's no way he could play. ...  When you can look at him and see he's not OK, then he's not OK.\" ... Augustin had 15 points while making four of six 3s.\n\nHawks: Rookie F Kevin Huerter (sore neck) was ruled out minutes before tipoff. Taurean Prince had nine points as the fill-in starter, shortly after Pierce said there was no immediate plan to move Prince back into the lineup. Huerter has started 27 games and has been an emerging scorer, especially on 3-pointers. ... Jeremy Lin had 15 points.\n\nMLK DAY\n\nFormer Atlanta Mayor Andrew Young, who worked closely with King, and NBA Commissioner Adam Silver attended the game as part of the King holiday celebration. Trae Young wrote King's famous words \"I have a dream\" on his shoe.\n\n\"Today is a different day because it's something bigger than us,\" he said.\n\nSaid Pierce, the first-year coach: \"I'm honored to be the head coach in the city of Atlanta for a lot of reasons. This is at the top of the list, to be here, in Atlanta, the birthplace of the civil rights movement, to honor Dr. King and his legacy.\"\n\nROAD TRIP\n\nThe Hawks packed for a seven-game road trip that ends Feb. 4 at Washington. \"We can't be flat, and we were flat today,\" Pierce said of extended stretch of games away from Atlanta. \"We have to create our own energy.\"\n\nUP NEXT\n\nMagic: Orlando plays at Brooklyn on Wednesday.\n\nHawks: Atlanta visits Chicago on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995360.35844
}