{
  "game_id": "0022000232",
  "espn_id": "401267392",
  "date": "Jan 22, 2021",
  "matchup": "BKN @ CLE",
  "headline": "Sexton scores 25, Cavaliers beat Durant-less Nets 125-113",
  "body": "CLEVELAND -- — Collin Sexton had 25 points and nine assists, Andre Drummond added 19 points and 16 rebounds and the Cleveland Cavaliers beat the Brooklyn Nets for the second time in three days, 125-113 on Friday night.\n\n\r\n                    The Nets played without superstar forward Kevin Durant, who was held out as a precautionary measure as he continues his comeback from right Achilles tendon surgery.\n\n\r\n                    Kyrie Irving scored 38 points and James Harden had 19 points and 11 assists for Brooklyn, which lost 147-135 in double-overtime to the Cavaliers in the debut of its high-scoring trio Wednesday.\n\n\r\n                    Durant scored 38 points and played 50 minutes in that game, so he was rested with another game Saturday.\n\n\r\n                    “I don’t want to overreact, but we need the guys to clean things up because we underperformed in two games,” Nets coach Steve Nash said. “People are excited to play against our team and will bring it every night. I feel like we need a little more and we have to take more pride in what we’re doing.”\n\n\r\n                    Jarrett Allen — acquired from Brooklyn in the Harden megatrade on Jan. 14 — scored 19 points and Larry Nance Jr. had 15 points and 10 rebounds for Cleveland, which has won three in a row and moved above .500 at 8-7.\n\n\r\n                    The Cavaliers outrebounded the Nets 50-29 and scored 70 points in the paint, maintaining a double-digit lead for the final 13 minutes. Taurean Prince, who also was dealt by Brooklyn, had 14 points off the bench.\n\n\r\n                    “We’re kind of learning on the fly because we haven’t had many practices, but we have to have constant effort,” Harden said. “Honestly, our problem isn’t offense. We’re not worried at all about offense. It’s our defense.”\n\n\r\n                    Irving scored back-to-back hoops to open the third, putting Brooklyn in front 64-61 before the Cavaliers answered with a 28-11 run to take the lead for good. Their largest advantage was 16 points late in the fourth.\n\n\r\n                    Cleveland point guard Darius Garland had 11 points after missing eight games with a sprained right shoulder. Sexton, who scored a career-high 42 points two nights earlier, collected 67 points and 14 assists in the sweep.\n\n\r\n                    “When we’re a whole, healthy team, we’re very tough to beat,” Drummond said. “These were great games for us. We have all the tools to be a great team.”\n\n\r\n                    Irving scored 18 points and Harden had 10 points and eight assists in the first half, but the Cavaliers held a 61-60 lead. The Nets started their 11th different lineup in 17 games, moving Jeff Green to a reserve role in favor of Bruce Brown.\n\n\r\n                    Brooklyn had won four in a row before arriving in Cleveland, where Irving spent his first six seasons.\n\n\r\n                    “This was two ugly losses,” Irving said. “I would have loved to get a win coming back to town. We have to figure it out, that’s it. No one else is going to do it for us. We just have to stay focused on making progress.”\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Harden and Irving share the Rocket Mortgage FieldHouse record for points in a game with 55. Harden reached the mark with Houston on Dec. 11, 2019, while Irving did so with the Cavaliers against Portland on Jan. 28, 2015. … C Nicolas Claxton (right knee tendinitis) is expected to rejoin the team in February, while G Spencer Dinwiddie (right knee ACL tear) is out for the season after undergoing reconstructive surgery.\n\n\r\n                    Cavaliers: F Kevin Porter Jr., who was expected to be the sixth man, was traded to Houston for a future second-round pick. Porter was inactive for the first 14 games following a November arrest in Eastern Ohio. The second-year pro created a scene at the arena on Dec. 15 when he realized his locker had been given to newcomer Prince. “We’re moving forward with the group we’ve got,” coach J.B. Bickerstaff said.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host Miami on Saturday. The teams will also play Monday at Barclays Center.\n\n\r\n                    Cavaliers: Visit Boston on Sunday. Cleveland has lost eight straight to the Celtics.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997515.899934
}