{
  "game_id": "0022300570",
  "espn_id": "401585198",
  "date": "Jan 17, 2024",
  "matchup": "ORL @ ATL",
  "headline": "Dejounte Murray hits 17-footer at buzzer to lift Hawks past Magic, 106-104",
  "body": "ATLANTA -- — There were differing versions of whether the Atlanta Hawks wanted to call a timeout to set up their final shot.\n\n\r\n              Dejounte Murray made it a moot point.\n\n\r\n              Murray hit a 17-foot jumper as time expired to give Atlanta a 106-104 victory over the Orlando Magic on Wednesday night.\n\n\r\n              Asked afterward if he considered calling a timeout, Hawks coach Quin Snyder indicated that he wanted his team to get the ball up the court quickly.\n\n\r\n              “That's always a debate,” Snyder said. “If you call timeout, the defense can get set and substitute.”\n\n\r\n              Hawks star Trae Young said Snyder actually tried to call a timeout, but the officials didn't hear him.\n\n\r\n              “We all just spread out and let DJ do his thing,” Young said.\n\n\r\n              In a game that was tight all the way, it was only appropriate that it came down to the final shot.\n\n\r\n              After Paolo Banchero made a 3-pointer from a couple of feet beyond the arc to tie it at 104 with 8.4 seconds left, the Hawks inbounded to Murray and let him go to work.\n\n\r\n              He dribbled down the left wing with Markelle Fultz, pulled up and swished the jumper to finish off a 26-point night.\n\n\r\n              “It's a make or miss league,” Murray said. “I always feel like I'm going to make my next shot.”\n\n\r\n              The Hawks tried to inbound to Young, but the Magic had him covered. Murray worked out just fine as the second option.\n\n\r\n              “I'm a react type of guy. I take what the defense is giving me,\" he said. “Mid-range is my sweet spot. I made a great shot.”\n\n\r\n              Murray untucked his jersey and stood defiantly in front of the cheering crowd before being mobbed by his teammates.\n\n\r\n              It wasn't the only big hoop that Murray made during crunch time. \n\n\r\n              On a wild sequence in which Atlanta was credited with five offensive rebounds, outhustling the Magic for every loose ball, Murray finally connected on a 7-footer in the lane that gave the home team a 100-97 lead with 1:41 remaining.\n\n\r\n              “We're usually on the other end of that,” Murray said. “That just showed we wanted the ball. We were a bunch of guys who wanted the ball and wanted to win the game.”\n\n\r\n              After Young made two free throws with 26.7 seconds left to push Atlanta ahead 104-101, Banchero connected from long range to give the Magic a shot at forcing the second overtime meeting between the teams this season.\n\n\r\n              Murray made sure that didn't happen. \n\n\r\n              “He hit a tough shot over a high hand,” Orlando coach Jamahl Mosley said. “Give them credit for the way they battled and fought.”\n\n\r\n              Banchero led the Magic with 26 points, while Wendell Carter Jr. had 18 and Jalen Suggs 16.\n\n\r\n              Young scored 18 points on a tough shooting night. He was 5 of 14 from the field and 1 of 6 from 3 point range. \n\n\r\n              But plenty of teammates stepped up. Onyeka Okongwu scored 15 points, while Bogdan Bogdanovic and Clint Capela added 12 apiece. The Hawks shot 51.3% from the field, overcoming a sloppy night with the ball.\n\n\r\n              Neither team led by more than seven points. There were 19 lead changes and 20 ties.\n\n\r\n              The Hawks had a season-high 23 turnovers. In one especially sloppy stretch of the second quarter, Atlanta threw it away five times in seven possessions.\n\n\r\n              Murray was responsible for three of those turnovers.\n\n\r\n              “We want to win games a lot better than that,” he said, “There's a lot of things we can work on, like taking care of the ball. That begins with myself.”\n\n\r\n              All was forgiven at the end.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Philadelphia on Friday night.\n\n\r\n              Hawks: At Miami on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995705.51398
}