{
  "game_id": "0022201184",
  "espn_id": "401469339",
  "date": "Apr 04, 2023",
  "matchup": "MEM vs. POR",
  "headline": "Bane's late burst leads Grizzlies past Trail Blazers 119-109",
  "body": "MEMPHIS, Tenn. -- — Desmond Bane scored 30 points and keyed a fourth-quarter rally, Ja Morant added 23 points and nine assists and the Memphis Grizzlies defeated the short-handed Portland Trail Blazers 119-109 on Tuesday night.\n\n\r\n              Luke Kennard added 20 for Memphis, converting 6 of 10 3-pointers.\n\n\r\n              Skylar Mays, who signed a 10-day contract with Portland last weekend, led the Trail Blazers with 24 points and seven assists. Shaedon Sharpe added 20 points, eight rebounds and six assists. Jabari Walker finished with 16 points.\n\n\r\n              Portland held the lead with nine minutes left, but Bane connected on a trio of 3-pointers over a four-minute stretch midway through the fourth. That was part of a 22-2 Memphis run to put away the feisty Trail Blazers.\n\n\r\n              “We tied it up, and we went on a nice run,” Memphis coach Taylor Jenkins said of the fourth quarter when Memphis outscored Portland 23-14. “Des (Bane) helped spark that.”\n\n\r\n              As it has in recent games, Portland played without key pieces, such as leading scorers Damian Lillard (32.2 points a game), Anfernee Simons (21.1 points) and Jerami Grant (20.5 points), along with top rebounder Jusuf Nurkic (9.1 boards per game). \n\n\r\n              That left a number of reserves to carry the Trail Blazers, who are out of the playoff hunt. But Portland coach Chauncey Billups praised his team for their fortitude in a hostile environment. \n\n\r\n              Justin Minaya, the 24-year-old son of former New York Mets general manager Omar Minaya, was signed to a 10-day contract and made his NBA debut. He scored eight points, had four rebounds and two assists in 17 minutes. Minaya had played 27 games for Mexico City in the NBA G League.\n\n\r\n              Memphis not only won its 50th game of the year, but finished the season 35-6 at home, clinching the best home slate in the league. \n\n\r\n              “I thought we definitely played hard,” said Walker, who was 6 of 11 from the field, including a trio of 3-pointers. “We were in it the whole game, and that speaks volumes to all the guys, how competitive we are and how much heart we have.”\n\n\r\n              The Trail Blazers chipped away at a 19-point Memphis lead in the first half when the Grizzlies became lackadaisical with the ball. That, and a much more focused Portland defense, led to Memphis holding a slim 66-62 lead at the break. \n\n\r\n              “We just went to old habits,” Morant said of the lackluster play in the game's middle stages. “Just no energy. That was pretty much it. We weren’t taking them lightly at all. We’d seen what they’ve done the last couple of games.”\n\n\r\n              At the start of the third quarter, Portland's intensity continued, and the Trail Blazers not only pulled even, but took the lead. They were still tied until Bane and the Grizzlies pulled away with the late burst.\n\n\r\n              “For us to be able to stay together and come back and get a win was big-time,” Morant said.\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Portland was one of the few visiting teams to defeat the Grizzlies this season, winning 122-112 on Feb. 1. ... Portland already had eight players listed as “out” with the early injury reports. By the time Billups got to the podium for his pregame comments, three more previously listed as questionable were not available. That left nine Trail Blazers in uniform. ... Jeenathan Williams, the rookie out of Buffalo signed by Portland on Saturday, started his first game and finished with four points.\n\n\r\n              Grizzlies: F Dillon Brooks took the night off with right hip soreness. Kennard started in Brooks' spot. ... The win snapped a four-game losing streak to Portland at FedExForum.\n\n\r\n              KENNARD ACCURACY\n\n\r\n              Kennard started the game hitting all four of his 3-pointers before finishing 6 of 10 from outside the arc. He has made better than 50% of his 3-pointers since joining the Grizzlies in a trade deadline deal in February. Morant told Kennard to keep shooting when he is on that kind of streak. “Whatever shot he likes, we love,” Morant said. \n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Play Thursday at San Antonio against the Spurs.\n\n\r\n              Grizzlies: Play the Pelicans in New Orleans on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994523.005235
}