{
  "game_id": "0022400790",
  "espn_id": "401705356",
  "date": "Feb 20, 2025",
  "matchup": "ORL @ ATL",
  "headline": "Paolo Banchero scores 36 points as Magic rally past Hawks 114-108",
  "body": "ATLANTA -- — Paolo Banchero had 36 points, 10 rebounds and five assists as the Orlando Magic rallied from an early 19-point deficit to beat the Atlanta Hawks 114-108 on Thursday night.\n\n\r\n              Franz Wagner scored 25 points and Cole Anthony had 17 for the Magic, who are seventh in the Eastern Conference — two spots ahead of the Hawks.\n\n\r\n              Banchero now has 47 games with at least 20 points, five rebounds and five assists, the third most by a player before his 23rd birthday behind LeBron James and Giannis Antetokounmpo.\n\n\r\n              Trae Young scored 38 points for the Hawks, and rookie Zaccharie Risacher had his first double-double with 11 points and 12 rebounds.\n\n\r\n              The Magic overcame a poor shooting night from 3-point range, connecting on just 6 of 25 (24%).\n\n\r\n              The Hawks led 40-21 early in the second quarter, but the Magic took a one-point lead into halftime after outscoring Atlanta 38-18 the rest of the period. Banchero had 18 points during that stretch.\n\n\r\n              Takeaways\r\n              Magic: The Magic shot 33% in the first quarter, but turned that around with a 71% second quarter.\n\n\r\n              Hawks: The Hawks' defense in the final three quarters was not good enough. Atlanta will hope to improve on that while playing nine of its next 11 games at home.\n\n\r\n              Key moment\r\n              Back-to-back 3-pointers by Anthony and Banchero with under three minutes left gave the Magic a 109-103 lead, and they held on from there.\n\n\r\n              Key stat\r\n              Dyson Daniels’ three steals gave him 152 for the season, which is more than last season’s steal leaders De’Aaron Fox and Shai Gilgeous-Alexander (150) and is the most of any player since the 2018-19 season. The Hawks have 26 games left.\n\n\r\n              Up next\r\n              The Magic kick off a seven-game homestand Friday against Memphis. The Hawks host Detroit on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997536.2283509
}