{
  "game_id": "0022300855",
  "espn_id": "401585483",
  "date": "Feb 29, 2024",
  "matchup": "MIA @ DEN",
  "headline": "Porter scores 30 points, Nuggets hold off Heat's 4th-quarter rally in 103-97 victory",
  "body": "DENVER -- — Michael Porter Jr. had 30 points to help pick up the scoring load after Jamal Murray left because of a sprained ankle, and the Denver Nuggets staved off Miami's fourth-quarter rally to beat the Heat 103-97 on Thursday night.\n\n\r\n              Porter was 12 of 23 from the floor, including four 3-pointers, and had 11 rebounds to help the Nuggets improve to 5-0 since the All-Star break.\n\n\r\n              “Caught a little rhythm,” Porter said. “But nothing too different. We obviously need Jamal. But some shots were just falling.”\n\n\r\n              Up 16 in the fourth quarter, Denver saw Miami trim it 99-97 after a floating bank shot by Jimmy Butler with 11 seconds remaining. Nikola Jokic made two free throws to seal it in a game where the Nuggets never trailed.\n\n\r\n              Jokic finished with 18 points, 11 rebounds and seven assists, ending a streak of four triple-doubles. The two-time NBA MVP scored eight of Denver's 11 points late in the fourth quarter.\n\n\r\n              “Definitely had a playoff vibe to it,” Porter said. “They play hard. They play really hard.”\n\n\r\n              This marked the first meeting between the Heat and Nuggets since they squared off in the NBA Finals last June. The Nuggets beat the Heat in five games for their first NBA crown.\n\n\r\n              Murray left just before halftime after he sprained his right ankle when he landed on Aaron Gordon's leg after a drive to the basket. Murray tested it out but shut it down for the night, finishing with six points. He's dealt with right hamstring and ankle ailments this season, along with shin splints. \n\n\r\n              “It’s great for him to realize being cautious right now is probably the really prudent decision,\" Nuggets coach Michael Malone said. \n\n\r\n              With Murray out, Denver pieced together the point-guard duties with Reggie Jackson, Christian Braun and Jokic to hold off the Heat. Kentavious Caldwell-Pope added 18 points and Gordon 16 as the Nuggets played at home for a second straight night. \n\n\r\n              “They're really aggressive and they are not quitting,\" Jokic said about the Heat. “They know what they’re doing and it’s always hard to play against that team.”\n\n\r\n              Bam Adebayo had 22 points and Butler added 21 points for a Heat team that had won five in a row. Miami was without Kevin Love, Tyler Herro and Josh Richardson due to injuries. \n\n\r\n              “Our guys have that fortitude and grit to keep on fighting back,” Miami coach Erik Spoelstra said. “There was a little bit of a struggle offensively, and that’s a credit to their defense.”\n\n\r\n              The Heat won five of six on a trip that included two games before the All-Star break. They face the Nuggets again on March 13 at home.\n\n\r\n              “We know who we are,” Butler said. “It’s close to the most important time of the year, so we’ll be OK.”\n\n\r\n              The Nuggets held a pregame ring ceremony for suspended Heat big man Thomas Bryant, who was with Denver last season in its title run. Bryant was presented his championship ring at half-court from Caldwell-Pope in a pregame ceremony and then immediately left the arena.\n\n\r\n              The NBA made an allowance for Bryant to be on hand for the game because it was the Heat’s only visit to Denver. Suspended players are typically not allowed to be present at the arena on game nights. Bryant wrapped up a three-game suspension for his involvement in an altercation that happened during a Heat game against New Orleans last week.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Utah on Saturday night.\n\n\r\n              Nuggets: At Los Angeles Lakers on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995343.5505762
}