{
  "game_id": "0022300144",
  "espn_id": "401584772",
  "date": "Nov 05, 2023",
  "matchup": "MEM @ POR",
  "headline": "Memphis beats Portland 112-100 for first win of the season",
  "body": "PORTLAND, Ore. -- — The Memphis Grizzlies knew that a win would eventually come, sooner rather than later. \n\n\r\n              Desmond Bane had 30 points and the Grizzlies won for the first time this season, rallying late to beat the Portland Trail Blazers 112-100 on Sunday night. \n\n\r\n              “We've been competing, growing and learning a lot. A lot of people are getting new opportunities,” Bane said. \"I'm happy with where we're headed and how we played tonight.\" \n\n\r\n              Jaren Jackson Jr. added 27 points for the Grizzlies, who opened the season with six straight losses, most since the 2002-03 season when the team opened 0-13.\n\n\r\n              Jerami Grant led the Blazers with 27 points. The loss snapped a three-game winning streak. \n\n\r\n              The Blazers led 86-62 going into the final quarter but were hurt when Robert Williams III was knocked to the ground underneath the Grizzlies' basket and came up limping. He tried to play, but left the court and headed straight for the locker room.\n\n\r\n              Memphis went on a 9-0 run to get within 98-95 with 5:26 left, then tied it at 100 on Jackson's dunk. He scored again to put the Grizzlies in front and they led the rest of the way. \n\n\r\n              “You've got to celebrate, you know how hard it is to win this league. We’re going to enjoy this one for sure,” Grizzlies coach Taylor Jenkins said. “It’s been a difficult first couple of weeks. But as I’ve said, our guys are resilient. They respond. We’ve been competitive every single night, sometimes it hasn’t gone our way.” \n\n\r\n              Shaedon Sharpe added 18 points and eight rebounds for the the Blazers, while Malcolm Brogdon had his second straight double-double with 18 points and 11 assists\n\n\r\n              Portland was without rookie guard Scoot Henderson for the second straight game with right ankle sprain. The Blazers were already missing guard Anfernee Simons because of a torn ligament in his right thumb.\n\n\r\n              Bismack Biyombo, signed Wednesday by Memphis, made a very brief debut for the Grizzlies on Friday before starting on Sunday. He got into foul trouble, collecting his fifth in the third quarter and went to the bench. A 12-year NBA veteran, Biyombo played for the Suns the past two seasons.\n\n\r\n              Santi Aldama made his first appearance of the season for Memphis after missing the team's first six games with a sprained right ankle. Jenkins said Aldama's minutes would be limited.\n\n\r\n              Portland led by as many a 11 points early but Memphis got back in it on Luke Kennard's 3-pointer that pulled the Grizzlies within 32-30 at the end of the first quarter.\n\n\r\n              David Roddy's jumper tied it at 40 and the Grizzlies took the lead on Bane's floater. Jackson capped the half with a 3-pointer to give the Grizzlies a 63-55 lead.\n\n\r\n              Grant made three consecutive 3-pointers during an 11-4 Portland run to start the second half and pull to 67-66. Bane had a personal 8-0 run to extend Memphis' lead again.\n\n\r\n              The Grizzlies stayed in front until Skylar Mays' 3-pointer gave Portland an 81-80 lead with just over two minute left in the quarter.\n\n\r\n              Coach Chauncey Billups said the Blazers are still in development. Portland is a young team rebuilding after the departure of All-Star guard Damian Lillard in the offseason.\n\n\r\n              “If it’s something to be taught, I’m teaching no matter if we’re winning or we’re losing, because those things go up and down. You can never know what’s going to happen,” Billups said. “I want to keep teaching and keep demanding it from the dudes, and we’ll just see what it looks like once we get there.”\n\n\r\n              The Blazers beat the Grizzlies 115-113 in overtime on Friday night in the first game for both teams in the NBA’s new In-Season Tournament. \n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host the Miami Heat on Wednesday.\n\n\r\n              Trail Blazers: Visit the Sacramento Kings on Wednesday to kick off a three-game road trip. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996048.577595
}