{
  "game_id": "0022400899",
  "espn_id": "401705465",
  "date": "Mar 06, 2025",
  "matchup": "IND @ ATL",
  "headline": "Trae Young has 22 points and 16 assists in the Hawks' 124-118 victory over the Pacers",
  "body": "ATLANTA -- — Trae Young had 22 points and 16 assists, Onyeka Okongwu added 20 points and 13 rebounds and the Atlanta Hawks beat the Indiana Pacers 124-118 on Thursday night to open a two-game set.\n\n\r\n              Georges Niang scored 12 of his 24 points in the fourth quarter for the Hawks, who had lost five in a row against Indiana since the 2022-23 season. His layup with 1:07 left put Atlanta up 116-109. \n\n\r\n              Pascal Siakam had 35 points for the Pacers, who were playing without two-time All-Star guard Tyrese Haliburton for only the second time this season. Haliburton was out with a hip issue. \n\n\r\n              The Pacers had a 92-82 lead late in the third quarter after a 11-0 run when Siakam hit three 3-pointers. Atlanta outscored them 38-24 in the fourth quarter. \n\n\r\n              Aaron Nesmith added 21 points for the Pacers, while Andrew Nembhard had 15 points and 10 assists. \n\n\r\n              Takeaways\r\n              Pacers: The No. 5 seed in the Eastern Conference hadn't lost to Atlanta since March 25, 2023. Along with Haliburton, the Pacers were without Bennedict Mathurin, who missed his fourth game in a row with a sprained right wrist. \n\n\r\n              Hawks: Atlanta won for only the third time in its last nine games. Coach Quin Snyder was back on the bench after missing Tuesday night's game with flu-like symptoms. \n\n\r\n              Key moment\r\n              The Hawks went ahead to stay when Niang hit consecutive 3-pointers over a 45-second span, the second of those with 5:03 left to make it 107-102. \n\n\r\n              Key stat \r\n              Atlanta made 12 of 18 shots from the field in the fourth quarter.\n\n\r\n              Up next\r\n              The Pacers and Hawks play again in Atlanta on Saturday night. \n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998126.724544
}