{
  "game_id": "0022400372",
  "espn_id": "401704938",
  "date": "Dec 19, 2024",
  "matchup": "LAL @ SAC",
  "headline": "Another record for LeBron James in the Lakers' 113-100 victory over the Kings",
  "body": "SACRAMENTO, Calif. -- — LeBron James had 19 points, six rebounds and seven assists while breaking the NBA record for regular-season minutes, helping the Los Angeles beat the Sacramento Kings 113-100 on Thursday night.\n\n\r\n              James spent 34 minutes on the court against the Kings to give him 57,471 in his career, moving past Hall of Famer Kareem Abdul-Jabbar (57,446) for the record.\n\n\r\n              Anthony Davis had 21 points and 20 rebounds in the opener of a two-game set at Golden 1 Center. Austin Reaves scored 35 points and D’Angelo Russell added 16 points to help the Lakers (15-12) to their third win in four games. \n\n\r\n              The Kings trailed most of the game then closed within 93-90 on De’Aaron Fox’s jumper with eight minutes remaining. Reaves’s short bank shot and two free throws from Davis sparked a 10-2 run that helped the Lakers pull away.\n\n\r\n              Fox had 26 points, five assists and three steals for the Kings. Domantas Sabonis added 18 points, 12 rebounds and nine assists. Malik Monk scored 17 points.\n\n\r\n              Takeaways\r\n              Lakers: Davis fell hard to the floor in the fourth quarter and stayed down for several moments before getting up and limping heavily. Davis, who has been dealing with left plantar fasciitis, stayed in the game and immediately made a big defensive stop.\n\n\r\n              Kings: For the second consecutive game, a poor first quarter doomed Mike Brown’s club. Sacramento fell behind by 14 early, made a run to take the lead in the second then spent the entire fourth quarter playing from behind. \n\n\r\n              Key moment\r\n              The momentum changed when Fox picked up his fifth foul with 6:47 minutes left in the second half, forcing the point guard to the bench. He was limited to 11 minutes the rest of the game.\n\n\r\n              Key stat\r\n              Three days after giving up 76 points in the paint to Denver, the Kings held the Lakers to 44 points inside the key.\n\n\r\n              Up next\r\n              The teams will complete the two-game set in Sacramento on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997196.120886
}