{
  "game_id": "0021600781",
  "espn_id": "400900186",
  "date": "Feb 07, 2017",
  "matchup": "DAL vs. POR",
  "headline": "McCollum's winner sends Blazers past Mavs 114-113",
  "body": "DALLAS --  On a night when Dirk Nowitzki turned back the clock for the Dallas Mavericks, C.J. McCollum had the final answer.\n\nMcCollum scored 32 points, the last two on a runner from the top of the lane with 0.9 seconds left to give the Portland Trail Blazers a 114-113 win over the Dallas Mavericks on Tuesday night.\n\nNowitzki finished with 25 points that included two clutch 3-pointers, the second a potential game-winner with 3.9 seconds left.\n\nPortland and Dallas -- fighting for the eighth and final playoff spot in the Western Conference -- battled through a tense fourth quarter that saw the teams trade 13-0 runs at one point, then exchange leads six times in the final minute.\n\nMcCollum scored Portland's last seven points. On the final sequence, he took Mason Plumlee's inbounds pass and split a double-team of Harrison Barnes and Wesley Matthews to break into the clear.\n\n\"Once I caught it, I knew I was going to attack right away,\" McCollum said. \"I tried to split (the double team), and get to the free-throw line and get to my sweet spot.\"\n\nMcCollum released his runner at the free-throw line and it swished through. Dallas, which was without a time-out, managed only Devin Harris' long heave from three-quarter court that wasn't close.\n\nDamian Lillard added 29 points for the Blazers, who tied their season series with the Mavericks at 2-2 -- each team winning twice on the others' home floor.\n\nBarnes led the Mavericks with 26 points and Matthews added 23.\n\nPortland led 101-89 with 7:19 to go before the Mavericks answered the Blazers' 13-0 run with one of their own. Neither team led by more than two points in the final five minutes.\n\nNowitzki's 3 with 38.9 seconds left gave Dallas a 108-107 lead and prompted a fist pump from the veteran, who was coming off four games of below double figures for only the second time since his rookie season.\n\n\"The shot-making at the end was just vintage,\" coach Rick Carlisle said. \"It was breathtaking.\"\n\nBut McCollum was just getting started. He hit a short jumper, then answered a Devin Harris counter with a three-point play to make it 112-110 with 12.3 seconds to play before Nowitzki hit another long ball.\n\n\"You're just hoping that's `Game'.\" said Nowitzki of his last 3. \"But three seconds in this league is a long time. I've obviously seen a lot of stuff happen. McCollum made a heck of a play.\"\n\nA BAD BREAK\n\nForward Evan Turner suffering a broken right hand in the third quarter after scoring 11 points. He left with 5:08 to play and did not return.\n\nTurner was diagnosed with a broken third metacarpal bone. Neither he nor coach Terry Stotts could gauge how long he would be out, but Turner was told after the game he likely would not need surgery.\n\n\"All I saw was I ran into Harrison Barnes,\" Turner said. \"It didn't feel like crazy pain, more like numbing a little bit. I just went back out there and I caught the ball. I couldn't feel any type of grip or anything like that. That was pretty much it.\"\n\nWith Turner out and Allen Crabbe in foul trouble, it was left to Lillard and McCollum to carry the Blazers' offense.\n\n\"We'll miss him,\" Lillard said of Turner. \"I think what he brings to the table is why we signed him. It's something that it'll be hard to get from one other person, but it'll have to be a collective effort from guys having to step up in his shoes.\"\n\nTIP-INS:\n\nTrail Blazers: During their big 16-2 run in the second quarter, both McCollum and Plumlee scored on alley-oop dunks. McCollum's came directly off an inbounds pass from the right wing. ... After shooting just 4-for-20 for 13 points in the Blazers' 108-104 loss to the Mavericks on Friday, Lillard scored 22 points in the first half and needed only six shots to make his first four field goals.\n\nMavericks: Seth Curry injured his left shoulder in a collision with Portland's Mason Plumlee with 8:49 left in the third quarter. He went to the locker room but returned to the game four minutes later and finished with four points. . Nowitzki moved into 10th place all-time in field goals with 10,517. Also, his two blocked shots gave him 1,200 for this career, the 55th player in NBA history to reach that figure.\n\nMAKING IT OFFICIAL\n\nAfter helping the Mavericks to a 4-1 record on a 10-day contract, Ferrell signed his two-year contract Tuesday, calling it \"one of the happiest days of my life.\" He finished with 12 points against Portland.\n\nDallas owner Mark Cuban said the team didn't want to risk having to bid for Ferrell's services after the contract or a subsequent 10-day expired.\n\n\"I wasn't going to find out (if other teams were interested),\" Cuban said. \"There's just no reason to find out.\"\n\nFerrell averaged 17 points and five assists in his first five games with the Mavericks, numbers that earned the endorsement of his fellow Indiana graduate Cuban.\n\n\"It's a mockery within a travesty within a transmogrification that he wasn't NBA Player of the Week,\" Cuban said.\n\nUP NEXT\n\nTrail Blazers: Home on Thursday against the Celtics, whom they have beaten in six of the teams' last eight meetings.\n\nMavericks: Continue their four-game homestand Thursday against Utah, whom they have not beaten in three tries this season.",
  "source": "espn_api",
  "crawled_at": 1764996119.500245
}