{
  "game_id": "0022200676",
  "espn_id": "401468831",
  "date": "Jan 18, 2023",
  "matchup": "DEN vs. MIN",
  "headline": "Murray, Jokic help Nuggets rally past Timberwolves 122-118",
  "body": "DENVER -- — Jamal Murray hit a go-ahead floater with 55.9 seconds remaining, Nikola Jokic broke Denver’s record for assists on the way to his 14th triple-double of the season, and the Nuggets rallied for a 122-118 victory over the Minnesota Timberwolves on Wednesday night.\n\n\r\n              Jokic finished with 31 points, 13 assists and 11 rebounds as he navigated foul trouble. The two-time reigning NBA MVP passed Alex English for the most assists in team history. Jokic has 3,686 career assists in 568 games — English recorded 3,679 over 837 games in a Denver uniform.\n\n\r\n              Jokic's teammates made sure to appreciate the achievement.\n\n\r\n              “We clapped a little bit,” said Murray, who finished with 28 points. “That’s a lot of passes. That’s pretty impressive.”\n\n\r\n              English thought so, too.\n\n\r\n              “I knew that eventually my all time assist record would be broken. I’m honored to see that it’s 2 time, I mean 3 time MVP of the NBA do it. Congrats big fella,” English posted on his Twitter account.\n\n\r\n              Never one to dwell too much on individual accolades, Jokic said he appreciated this particular mark.\n\n\r\n              “When you have a lot of assists, it just shows that you’re a good team player,” said Jokic, whose teammates plan to sign the ball for him. \"That’s something I want to be. I want everybody to remember me as a guy who was a really good team player.”\n\n\r\n              Murray took over down the stretch to help the Western Conference-leading Nuggets win their 15th straight at home.\n\n\r\n              The Nuggets trailed 118-115 when Murray hit a 3-pointer with 2:05 remaining to tie the game. Then, he nailed a driving floater to give Denver a lead it didn't relinquish. \n\n\r\n              Bruce Brown finished with 16 points for a Denver team playing the second game of a back-to-back. Nuggets coach Michael Malone remained in the NBA’s health and safety protocol for a second straight game. David Adelman filled in as acting head coach.\n\n\r\n              “Winning ugly. Winning pretty. Who cares?\" Adelman said. “Good team win.”\n\n\r\n              Adelman compared the combination of Murray and Jokic to a modern-day version of John Stockton and Karl Malone. Given the way Jokic passes, though, it's hard to say who would represent who.\n\n\r\n              “I don’t think Stockton can score like me,” Murray cracked. “I think we’re very unique, because they try to guard us in so many different ways.” \n\n\r\n              Jaden McDaniels led seven Minnesota players in double figures with 18 points. The Timberwolves led by 10 early in the second half.\n\n\r\n              “I’m mad. I’m mad as hell we lost because I played bad,” said Anthony Edwards, who was 7 of 17 from the floor, including 0 for 4 from 3-point range, and finished with 16 points. \"I could have helped us, for sure.” \n\n\r\n              It was an eventful first quarter for Jokic, who had a basket taken away on review (shot-clock violation) and an offensive foul rescinded courtesy of a challenge. He still had 13 points in the period and five assists, including a full-length pass to Brown for a dunk.\n\n\r\n              “He has a John Stockton kind of mind in a 7-foot body,” Adelman said. \n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: F Kyle Anderson finished with 13 points and 11 rebounds. ... C Naz Reid had 17 points as he started with Rudy Gobert sidelined by a sore groin. ... G Austin Rivers (bruised knee) was inactive. \n\n\r\n              Nuggets: F Jeff Green (broken hand) has started playing 1-on-1 and is “trending the right way,” Adelman said. ... Aaron Gordon added 12 points.\n\n\r\n              FAMILY CIRCLE\n\n\r\n              Nuggets veteran guard Ish Smith played for coach Rick Adelman when he was a rookie with Houston in 2010. \n\n\r\n              Now, he's a reserve on the bench for Adelman’s son.\n\n\r\n              “Small world,” Smith cracked. “I always tell (David), ‘You’ll be a head coach soon.' This is a great audition for him. Guys are playing hard.”\n\n\r\n              EASY GOING\n\n\r\n              Timberwolves coach Chris Finch appreciates the easygoing demeanor of Tim Connelly, the president of basketball operations for the Timberwolves. Connelly had a similar role with Denver — and helped build the team to where it is today — before leaving last spring.\n\n\r\n              “He’s always telling me to have fun, which is simple but hard to sometimes maintain,” Finch said. “He’s always really positive.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Toronto on Thursday night. \n\n\r\n              Nuggets: Host Indiana on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994701.8625228
}