{
  "game_id": "0021500765",
  "espn_id": "400828652",
  "date": "Feb 06, 2016",
  "matchup": "MEM vs. DAL",
  "headline": "Parsons has 26 as Mavericks defeat Grizzlies 114-110 in OT",
  "body": "MEMPHIS, Tenn. --  The Dallas Mavericks probably felt like they should have avoided overtime. Chandler Parsons made sure they didn't squander the opportunity for the win in the extra period.\n\nParsons scored 26 points, including a pair of 3-pointers in overtime, to lead the Mavericks to a 114-110 victory over the Memphis Grizzlies on Saturday night.\n\n\"We enjoy playing basketball, so we don't mind overtime,\" Parsons said with a smile in the Dallas locker room. \"But it definitely would have been nice to be on the flight already.\"\n\nDirk Nowitzki's 21-foot jumper with 16.6 seconds left pushed the Dallas lead to 112-109, and the Mavericks held on to snap a three-game losing streak. The victory came after an embarrassing 116-90 loss Friday night to San Antonio where Dallas scored only 26 points in the first half.\n\nCoach Rick Carlisle referred to the Spurs loss as \"a demolition.\"\n\n\"It was a lousy way to show for our team,\" Carlisle said. \"You don't want to go through that. (Against Memphis) we had to show character.\"\n\nDeron Williams had 22 points and 11 assists, while Nowitzki finished with 18 for Dallas. Parsons was 10 of 15 from the field, including 5 of 8 from outside the arc.\n\nMarc Gasol led Memphis with 22 points, while Zach Randolph had 20 points and 14 rebounds.\n\nThe teams were tied at 102 at the end of regulation. The Mavericks had the last shot with less than a second left, but failed to convert a lob at the rim to Justin Anderson.\n\nMemphis had used a 10-2 run in the closing 3:11 of regulation to send the game into the extra period.\n\nIn overtime, Parsons' 3-pointers countered any Memphis baskets inside by Gasol. Parsons' second long-range conversion gave Dallas a 110-106 lead with 2:24 left in overtime.\n\n\"Those were huge,\" Parsons said. \"(Williams) made a good pass on a drive and kick when (Matt) Barnes helped off. The other one, (Barnes) went under a ball screen, so I made him pay.\"\n\nRaymond Felton added 16 points, including 10 after halftime, and Dwight Powell finished with 10 points, hitting all three of his shots.\n\nBarnes had 17 points and 11 rebounds, Mike Conley finished with 16 points and seven assists for Memphis, which saw an end to its five-game winning streak.\n\n\"Every time they wanted a bucket, they got a shot,\" Gasol said.\n\nTIP-INS:\n\nMavericks: Carlisle was whistled for a technical in the second quarter for complaining a no-call when he thought Nowitzki was fouled. ... Dallas converted 15 3-pointers, the 25th time this season a Memphis opponent has made at least 10 shots outside the arc. . Dallas avoided its first four-game losing streak of the season with the victory.\n\nGrizzlies: Memphis made its first six shots in the game. . The Grizzlies, who ranked third in free-throw percentage at 79.5 percent, were 8 of 14 in the first half and finished the game 13 of 23 (56.5 percent). . Memphis, which led 80-79 at the end of the third, is now 20-3 when leading after three.\n\nANDERSON ADVANCEMENT: Anderson, the rookie swingman from Virginia, scored six points and had four rebounds, but his energy is drawing attention from the Mavericks. \"He's been doing a lot of good things for the last week to 10 days,\" Carlisle said. \".He made some rebounds in traffic (against Memphis) that I haven't seen anybody make in the last seven-plus years.\" Parsons added: \"He just brings the energy and that fire and that youth that we don't have a lot of.\"\n\nSTOP ON GREEN: Memphis reserve F Jeff Green finished with nine points. He had led Memphis in scoring in five straight games, all in a reserve role. Green, who was shooting 60 percent over the span, was 4 of 14 against the Mavericks, including missing all four from 3-point range.\n\nUP NEXT\n\nMavericks: Host Jazz on Tuesday\n\nGrizzlies: Host Trail Blazers on Monday",
  "source": "espn_api",
  "crawled_at": 1764994438.827017
}