{
  "game_id": "0022400460",
  "espn_id": "401705026",
  "date": "Jan 01, 2025",
  "matchup": "HOU vs. DAL",
  "headline": "Rockets beat the Mavericks 110-99 to snap a 2-game skid",
  "body": "HOUSTON -- — Alperen Sengun had 23 points, Jalen Green added 22 and the Houston Rockets built a big lead early in the second half and sailed to a 110-99 victory over the Dallas Mavericks on Wednesday night.\n\n\r\n              Dillon Brooks had 19 points and Cam Whitmore added 18 to help the Rockets get back on track after dropping two straight.\n\n\r\n              The Mavericks led by four midway through the second quarter before Houston used a 21-8 run to take a 61-52 lead into halftime. Green made eight points in that stretch and Whitmore added two 3-pointers.\n\n\r\n              The Rockets then opened the second half with an 11-4 spurt that pushed it to 72-56 with nine minutes left in the third.\n\n\r\n              Houston was up by 14 entering the fourth and maintained a double-digit lead throughout the quarter.\n\n\r\n              Kyrie Irving (shoulder), Klay Thompson (illness) and Dereck Lively II (hip) returned after sitting out Monday. But Naji Marshall remained out serving a four-game suspension for his role in a fight against the Suns.\n\n\r\n              Quentin Grimes led the Mavericks with 17 points off the bench. Thompson and Irving added 16 each.\n\n\r\n              Takeaways \r\n              Mavericks: Lost for the third time in four games playing without Luka Doncic, who strained his calf on Christmas Day. They’ll need to find a way to win without the star, who will be out at least a month.\n\n\r\n              Rockets: Didn’t miss a beat without the bench scoring of Amen Thompson, who served the first of a two-game suspension for a fight with Miami’s Tyler Herro Sunday night.\n\n\r\n              Key moment\r\n              Houston’s 32-12 run to end the first half and start the second half.\n\n\r\n              Key stat\r\n              Houston’s victory was helped by making 18 of 23 free throws compared to just 8 of 16 by Dallas.\n\n\r\n              Up next\r\n              Both teams are back in action Friday night. Dallas hosts Cleveland, and Houston hosts Boston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997391.354746
}