{
  "game_id": "0022300123",
  "espn_id": "401584751",
  "date": "Nov 01, 2023",
  "matchup": "MIN vs. DEN",
  "headline": "T-wolves hand Nuggets 1st loss in wire-to-wire 110-89 rout, hit 26 of 27 free throws",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 24 points for the Minnesota Timberwolves, who delivered the defending NBA champion Denver Nuggets their first loss in five games this season with a 110-89 victory Wednesday in the first rematch of their first-round playoff series from last spring.\n\n\r\n              “I didn’t think our approach was where it needed to be,” Nuggets coach Mike Malone said. “That team came out like they wanted to get some revenge.” \n\n\r\n              Karl-Anthony Towns added 21 points and eight rebounds with tireless defense on Nikola Jokic and Mike Conley had 17 points on 7-for-9 shooting for the Timberwolves (2-2), who went 26 for 27 from the foul line and led from start to finish. \n\n\r\n              “The maturity comes when you stack performances like this on top of each other, so that remains to be seen,” Wolves coach Chris Finch said. “But this was a great focused effort.” \n\n\r\n              Jokic had 25 points and 10 rebounds and Jamal Murray scored 14 points for the Nuggets (4-1), who shot just 6 for 33 from 3-point range to fall below 20% for just the third time in the last four seasons, according to Sportradar. \n\n\r\n              “Hopefully it’s a reminder that we’re going to get everybody’s best every night,” Malone said.\n\n\r\n              Edwards found a huge hole in the lane and soared to the basket for a slam at the first-half buzzer, pulling himself above the rim with a hearty scream as the Wolves surged to the locker room with a 63-44 lead. They were ahead by 19 points at the break in their previous game in Atlanta, too, before the Hawks blew by them to win by 14 points.\n\n\r\n              The second half provided an early litmus test of sorts on Minnesota's maturity. Would these Wolves withstand the inevitable charge from the defending champions or wilt down the stretch like the same old up-and-down bunch?\n\n\r\n              “Our mentality coming into this game, it was going to show one way or another and I feel like we passed that test,” Conley said. “We came in and just competed. No complaints. Guys did their job.”\n\n\r\n              Murray, who started 0 for 9 from the floor and didn't hit one until 8:57 was left in the third, got hot with 12 points in the period. The Wolves had plenty of responses, particularly from the calm-and-cool point guard Conley and reserves Kyle Anderson (nine points) and Naz Reid (16 points, five rebounds).\n\n\r\n              Jokic, who had his 107th career triple-double in the win over Utah on Monday, shot an uncharacteristic 11 for 23 from the field. The two-time NBA MVP had just three assists.\n\n\r\n              “A lot of guys put their body on him and try to make it as hard as possible for him,” Finch said.\n\n\r\n              Denver disposed of Minnesota in five games last spring, but the Wolves — who played the series without Reid and Jaden McDaniels, their best defender — made the Nuggets work for their wins as much as any of the four postseason opponents they felled on the path to the title. Malone confirmed as much in a postgame reflection about that matchup.\n\n\r\n              The Nuggets trailed by just 4:17 over their first four games, never by more than four points, but they ominously missed their first six shots and quickly found themselves buried by an eager-to-run and more-than-willing-to-defend Wolves team.\n\n\r\n              “We were kind of rushing, giving them extra looks, shooting bad shots,” Jokic said.\n\n\r\n              Only once in the last seven seasons have the Wolves attempted 15 or more free throws and shot better from the line than in this game (96.3%). They went 25 for 25 in a win over Chicago on April 11, 2021. \n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Dallas on Friday night.\n\n\r\n              Timberwolves: Host Utah on Saturday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996501.9465542
}