{
  "game_id": "0021800868",
  "espn_id": "401071541",
  "date": "Feb 21, 2019",
  "matchup": "PHI vs. MIA",
  "headline": "76ers overcame Joel Embiid's absence to beat Heat 106-102",
  "body": "PHILADELPHIA -- Boban Marjanovic covered up All-Star center Joel Embiid's absence -- at least for a night.\nMarjanovic had 19 points and 12 rebounds and made three key free throws in the final 1 1/2 minutes to help Philadelphia 76ers beat the Miami Heat 106-102 on Thursday night.\n\"He was our bell-ringer tonight,\" Philadelphia coach Brett Brown said.\nTobias Harris had 12 of his 23 points in the fourth quarter and JJ Redick hit a late 3-pointer to help Philadelphia win its first game without Embiid. He's expected to miss at least a week with a sore left knee.\nDwyane Wade scored 19 points for Miami, and Dion Waiters added 18.\nMiami led 99-98 after Wade's runner with 1:56 left. Marjanovic made two free throws to put Philadelphia ahead 100-99. Following Wade's missed jumper, Redick drained the 3 from the top of the key to make it 103-99 with 1:04 left.\nKelly Olynyk then missed a 3-point attempt, and Marjanovic made the first of two free throws with 38.3 ticks left to put Philadelphia up five.\n\"He was fantastic,\" Redick said about Marjanovic. \"He really stepped up for us tonight.\"\nPerhaps the only way Marjanovic didn't impersonate Embiid was after the game, as he was unavailable for comment due to treatment -- quite unlike the loquacious and quotable Embiid.\nIt was left to his teammates to speak for his performance.\n\"He's a bucket,\" Butler said. \"All you have to do is throw it to him.\"\nAdded Harris, \"I was surprised he didn't shoot a 3 tonight because he had it going.\"\nMarjanovic, starting for Embiid, had 11 points and seven rebounds to help Philadelphia to a 23-13 lead before being lifted with 3:34 left in the first quarter. He returned 3 1/2 minutes into the second, finishing the half with 16 points and eight rebounds while making all six of his field-goal attempts to help the 76ers to a 57-50 halftime lead.\nHe finished 6 for 7 from the field and 7 for 10 from the free-throw line.\n\"He's incredibly skilled for a man of his size,\" Brown said.\nWADE'S EXIT\nThe 37-year-old Wade, playing in his last season, was honored early in the first quarter with a highlight video that included a tribute from 76ers great Allen Iverson. Philadelphia fans gave Wade a standing ovation following the video, and the Miami star pounded his heart and waved back in appreciation.\nWade was touched by the tribute, particularly by Iverson's inclusion. After Michael Jordan, Iverson was Wade's favorite player growing up.\n\"To take myself out of the moment and think 20-something odd years later, Allen Iverson would be the one, his voice would be the one dedicating something to me in this arena, in his city, I couldn't have written it any sweeter, any better,\" Wade said.\nPASSING THE TORCH\nSimmons and Wade exchanged jerseys after the game. Fresh off his first All-Star appearance and a rising star in the league, Simmons reflected on playing against Wade.\n\"It's cool to be on the floor with a legend,\" Simmons said. \"It's an amazing feeling.\"\nSimmons, who had 21 points, seven rebounds and four assists, said he wore Wade's brand of sneakers as a kid.\nTIP-INS\nMiami: G Goran Dragic was inactive. Dragic, who had right knee surgery in December, practiced Wednesday and a return to the court on Thursday was thought to be a possibility. An All-Star last season, Dragic is averaging 15.3 points and 4.9 assists. ... The Heat dropped to 15-15 on the road. They are 11-16 at home. ... James Johnson left with an apparent left shoulder injury with 8:31 left in the first half and didn't return. Heat coach Erik Spoelstra said X-rays were negative and Johnson would have an MRI when the team returns home. ... Derrick Jones Jr. returned after missing eight games due to bone bruises in his right knee. He had nine points.\nPhiladelphia: Philadelphia leads the season series 2-0. The 76ers won 124-114 on Nov. 12 in Miami. The teams will wrap up the series April 9 in Miami. ... Philadelphia improved to 24-7 at home.\nUP NEXT\nHeat: Host Detroit on Saturday night.\n76ers: Host Portland Saturday.\n---\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994013.032106
}