{
  "game_id": "0021300664",
  "espn_id": "400489537",
  "date": "Jan 27, 2014",
  "matchup": "CHI vs. MIN",
  "headline": "Kevin Love scores 31 as Wolves beat short-handed Bulls",
  "body": "CHICAGO -- Both the Chicago Bulls and the Minnesota Timberwolves were missing their starting centers.\nThe Timberwolves were able to overcome the adversity.\nKevin Love scored 31 points to lead the Timberwolves over the Bulls 95-86 Monday night. Ronny Turiaf added 14 points for the Timberwolves, who snapped a seven-game losing streak to the Bulls and won for the fourth time in five games overall.\nTimberwolves center Nikola Pekovic exited with a sore right Achilles tendon midway through the first quarter. Turiaf, who was averaging 2.3 points, scored a season high in his absence.\n\n\"He stepped up when Pekovic went out, and he brings a lot,\" Timberwolves guard Ricky Rubio said. \"He brought everything he had.\"\nThe Bulls were also without their starting center. Joakim Noah was sent home before the game due to an illness. Kirk Hinrich (strained right hamstring) missed his fourth straight game.\n\"They had some people out too, but we knew it was going to be a physical game,\" Timberwolves coach Rick Adelman said. \"We knew how they were going to play, and I thought we responded pretty well.\"\nCarlos Boozer had 20 points and 14 rebounds, and D.J. Augustin added 19 points for the Bulls.\nPekovic, who was averaging 18.4 points and 9.3 rebounds, said he hopes his injury is not serious. The injury has been bothering Pekovic during the team's road trip, Adelman said. Pekovic had one point and one rebound in 6 minutes.\nIn Pekovic's absence, Turiaf grabbed seven rebounds and had his highest-scoring game since he scored 19 points on Jan. 11, 2011, for the New York Knicks against the Portland Trail Blazers.\n\"My goal this year, regardless of the situation, is just to go out there and have some fun,\" Turiaf said. \"No matter how much or how little I play, I just want to have fun.\"\nThe Bulls pulled within five with 1:29 left on Augustin's 3-pointer but got no closer. Love answered with a layup with 1:10 remaining, and Corey Brewer's dunk gave the Timberwolves an 88-79 lead with 57.4 seconds left.\nThe Timberwolves improved to 2-11 on the road when scoring fewer than 109 points. Minnesota shot 46.6 percent compared to the Bulls' 37.6 percent.\n\"We need that,\" Love said. \"We communicated really well and we definitely contested a lot of shots.\"\nChicago had won four of five and is 10-4 in January.\nChase Budinger added 12 points off the bench for Minnesota, and Brewer had 11.\nJimmy Butler scored 16 points, and Mike Dunleavy and Taj Gibson each had 10 for the Bulls.\nGibson started at center in place of Noah and had eight points and seven rebounds at halftime before running into foul trouble in the second half.\n\"He's an All-Star. You're going to feel it,\" Gibson said about the Bulls missing Noah. \"He was playing real phenomenal. He's one of the vocal leaders, rebounding, playing defense, controlling the offensive end and making plays for guys.\n\"We got to keep pushing forward.\"\nThe Timberwolves went cold in the third quarter as the Bulls outscored them 19-18 and pulled within five.\nMinnesota had one field goal in the final 7:38 of the period -- Budinger's dunk with 34.9 seconds left. The Wolves led 72-65 heading into the fourth.\nThe Bulls had won by an average of 13.3 points during their seven-game winning streak against the Timberwolves. Minnesota last won in Chicago on Jan. 3, 2009.\n\"When you lose a guy like Jo your margin for error is smaller,\" Bulls coach Tom Thibodeau said about Noah.\n\"We can get it done. You've got to give Minnesota credit. They're playing real well right now. We can never lose sight of how hard we have to play. We can't play hard for 32 minutes. We have to play hard the whole game.\"\nGame notes\nThe Timberwolves ranked second in the NBA in scoring at 106.8 points per game coming in. The Bulls were holding opponents to 92.9 points per game, second in the league. ... It was the first of two meetings between the teams this season. The Bulls lead the all-time series 28-18.",
  "source": "espn_api",
  "crawled_at": 1764992662.972287
}