{
  "game_id": "0022300458",
  "espn_id": "401585086",
  "date": "Jan 01, 2024",
  "matchup": "MIA @ LAC",
  "headline": "Leonard reaches 13,000 career points in his return, Clippers beat Miami 121-104 for 3rd straight win",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 24 points in his return from injury, Paul George added 23 and the Los Angeles Clippers beat the short-handed Miami Heat 121-104 on Monday night for their third straight win.\n\n\r\n              The Clippers opened the new year where they left off after going 11-2 in December for the West’s best record during the month. Norman Powell added 22 points off the bench and James Harden had 15 points and 10 assists.\n\n\r\n              “It’s better when you try to figure it out winning than trying to figure out losing. That’s what was happening earlier,” Harden said, referring to the team's six-game skid in November. “Every single game, we're trying to find ways to win games. Then towards the end of the season we’ll understand what we’re really good at and what we’re not.”\n\n\r\n              Leonard was back after missing four games with a hip contusion. The Clippers held things down in his absence, going 2-2.\n\n\r\n              Leonard’s dunk to open the fourth gave him 13,000 career points. He had six rebounds and five assists before sitting down for the game's final 5:43. He didn't speak to reporters afterward.\n\n\r\n              “You seen the performance, both ends of the ball just elite,” Harden said of Leonard. “Shotmaking, defensively being active, creating opportunities in transition. We missed him.”\n\n\r\n              Leonard got off to a slow start, missing both of his shot attempts in the first when he was scoreless. \n\n\r\n              But Leonard found his spots in the second, scoring 13 points including 10 in a row, as the Clippers erased a 14-point deficit to lead 59-58 at halftime.\n\n\r\n              “It was really good to see him get going,” Clippers coach Tyronn Lue said.\n\n\r\n              Bam Adebayo led the Heat with 21 points and 15 rebounds. Kevin Love added 17 points off the bench. Kyle Lowry returned after being out with a head contusion and had eight points.\n\n\r\n              Among those missing for Miami were Jimmy Butler (foot), Josh Richardson (back) and Caleb Martin (ankle). Butler got hurt at Utah on Saturday. An X-ray showed no damage and he’ll continue to receive treatment. He had been out four games before that with a strained calf.\n\n\r\n              The Clippers outscored Miami 14-8 to open the third and extend a one-point lead to 73-63. Harden and Terance Mann had five points each. George made back-to-back 3-pointers during a personal 8-0 run that restored their 10-point lead.\n\n\r\n              “Defensively we can be better,” Heat coach Erik Spoelstra said. “We struggled again in 1-on-1 situations.”\n\n\r\n              Reserve Duncan Robinson and Love combined to score 19 points in carrying the Heat to a 35-23 lead in the first. “That was the best quarter,” Spoelstra said. “The rest of it was pretty sloppy.”\n\n\r\n              Four former UCLA players were on the floor — Love and Jaime Jaquez Jr. for the Heat and Powell and Russell Westbrook for the Clippers. The Heat's duo outscored the Clippers' pair, 32-30.\n\n\r\n              It was a homecoming for Jaquez, who grew up about an hour away in Camarillo and was playing on Mexican Heritage Night.\n\n\r\n              “I definitely felt and heard the love from the people in the crowd,” he said. “It felt like a home game for me.” \n\n\r\n              UP NEXT\n\n\r\n              Heat: Stay in Los Angeles to play the Lakers on Wednesday.\n\n\r\n              Clippers: Visit the Phoenix Suns on Wednesday to begin a three-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996526.029998
}