{
  "game_id": "0022100830",
  "espn_id": "401360649",
  "date": "Feb 09, 2022",
  "matchup": "SAC vs. MIN",
  "headline": "Sabonis' double-double leads Kings past Timberwolves 132-119",
  "body": "SACRAMENTO, Calif. -- — Harrison Barnes scored 30 points, Domantas Sabonis had 22 points and 14 rebounds in his Kings debut and Sacramento pulled away late to beat the Minnesota Timberwolves 132-119 on Wednesday night.\n\n\r\n              De’Aaron Fox added 27 points and eight rebounds to help the Kings win in their first game since making a six-player trade with Indiana.\n\n\r\n              “The new guys contributed a lot tonight,” Kings interim coach Alvin Gentry said. “Everybody we put into the game did something that was really good for us. We shared the ball and had really good ball movement. I just thought we had a flow in the game that was pretty consistent.”\n\n\r\n              Sabonis, part of the deal that sent Tyrese Haliburton to the Pacers, celebrated his first game with his new team with a double-double that helped end the Timberwolves’ five-game winning streak. \n\n\r\n              After getting hit in the face in the third quarter, Sabonis returned and scored Sacramento’s first four points of the fourth. Then he made two free throws as part of a 14-2 run that put the Kings ahead 126-117.\n\n\r\n              “It’s been a crazy 36 hours since we found out,” said Sabonis, who wasn’t cleared to play until about an hour before tipoff. “I feel like this is a fresh start for me. It’s going to be exciting. I want to be here. The fans were amazing tonight. Today was a great day.”\n\n\r\n              Sacramento’s other new players had mixed results. Justin Holiday had six points on 2-of-11 shooting, while Jeremy Lamb scored 14 with five assists.\n\n\r\n              Fox, playing his second game after missing nearly three weeks with an ankle injury, had six points during the decisive surge, including a pair of fast-break layups when he outraced Minnesota’s defense the length of the court.\n\n\r\n              D’Angelo Russell had 29 points and 10 assists for the Timberwolves. Karl-Anthony Towns added 21 points, eight assists and seven rebounds. Anthony Edwards scored 26.\n\n\r\n              “Hopefully it gets our attention,” Timberwolves coach Chris Finch said. “We’ve been scoring the ball so easily. Tonight we didn’t get our bench production that we had been getting. We didn’t get to the free-throw line. Our defense was under that much more pressure.”\n\n\r\n              One night after losing to Minnesota by 20, the new-look Kings got off to a sluggish start and trailed by 13 in the first quarter before finding their rhythm. After Barnes and Davion Mitchell made back-to-back 3-pointers, Sabonis followed up his own miss to put the Kings ahead 51-48.\n\n\r\n              Fox added a 3 before halftime that extended Sacramento’s lead to 71-64.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Edwards scored 15 points in the first quarter. … Towns was whistled for two fouls in the opening six minutes. … Finch and Jarred Vanderbilt received technical fouls. … Patrick Beverley (right ankle sprain) was held out.\n\n\r\n              Kings: Fox became the fifth player in franchise history to reach 1,900 career assists. … Moe Harkless (right ankle sprain) did not play. Harkless was injured in the first half Tuesday and did not return.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Play the Bulls in Chicago on Friday. \n\n\r\n              Kings: Start their final road trip before the All-Star break against the Wizards on Saturday. Sacramento hasn’t lost in Washington since 2019.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993894.605526
}