{
  "game_id": "0022000775",
  "espn_id": "401307567",
  "date": "Apr 06, 2021",
  "matchup": "LAC vs. POR",
  "headline": "George scores 36, Clippers rout Trail Blazers 133-116",
  "body": "LOS ANGELES -- — Paul George scored 36 points and the Los Angeles Clippers rode a franchise-best 47-point first quarter to a 133-116 victory over the Portland Trail Blazers on Tuesday night.\n\n\r\n                    Kawhi Leonard added 29 points, 12 rebounds and seven assists as the Clippers followed an 18-point rout of the defending champion Lakers two days ago with another impressive performance at both ends. \n\n\r\n                    George shot 11 of 18, made six 3-pointers and hit all eight of his free throws. He finished three points off his season high of 39. Reggie Jackson added 23 points off the bench.\n\n\r\n                    Norman Powell scored 32 points and CJ McCollum added 24 points for the Blazers, who had their four-game road winning streak snapped. \n\n\r\n                    The Clippers harassed Damian Lillard into 2-of-14 shooting for 11 points, well under his team-leading 29.6 average. A frustrated Lillard earned a technical foul in the third. He had just four points in the second half.\n\n\r\n                    “Just trying to keep ball out of his hands and really trying to make everything tough on him,” Jackson said. “It was a great game plan.”\n\n\r\n                    The Clippers scored 47 points in the first quarter, the most in that quarter in franchise history, while shooting 64%. George’s 22 points were the most by a Clipper in the first since Blake Griffin had the same on March 10, 2014, against Phoenix.\n\n\r\n                    Portland coach Terry Stotts called his team's defensive effort in the first “embarrassing.”\n\n\r\n                    “The first quarter was really bad defensively,” Powell said. “They didn’t feel us. They got in a rhythm and were able to hit shots. We have to put together a full 48-minute effort on the defensive end.\"\n\n\r\n                    George keyed a 24-6 run over the end of the first and start of the second that extended the Clippers’ lead to 26 points, their largest of the game. He scored seven points. Leonard, Nicolas Batum and Jackson hit consecutive 3-pointers and new addition DeMarcus Cousins capped the spurt by scoring on his offensive rebound.\n\n\r\n                    “We talked about attacking the paint,” Clippers coach Tyronn Lue said. “PG and Kawhi really did that and set the tone early on.”\n\n\r\n                    Trailing 62-36, the Blazers worked hard at getting back in the game. They outscored the Clippers 30-11 to close within seven at halftime. Powell scored nine, punctuated by a one-handed slam. McCollum added eight, and Robert Covington closed out the half with a 3-pointer that beat the shot clock.\n\n\r\n                    The Clippers extended their lead to 14 points early in the third. Portland ran off 12 in a row, getting 3-pointers from Powell and Covington, to close to 84-82. That's the closest the Blazers came the rest of the way.\n\n\r\n                    Los Angeles closed with an 18-7 spurt to lead 101-89 going into the fourth. Leonard and Jackson scored eight apiece and Rajon Rondo added a basket.\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: Jusuf Nurkic (right knee inflammation) sat out less than two weeks after returning from a right calf strain. He missed nearly two months with a right wrist fracture. Nurkic's knee began bothering him Sunday after playing in back-to-back games. “As of now, it's not serious,” Stotts said. ... The 47 points were their most allowed in any quarter this season.\n\n\r\n                    Clippers: Their 47 points were the fourth-most in a single quarter in franchise history and the most scored in a single quarter since they had 47 in the second on Jan. 5, 2020, against New York. ... They allowed 11 offensive rebounds in the first half and just three in the second half. ... Patrick Beverley started in his return from being out three weeks because of right knee soreness. He had eight points.\n\n\r\n                    BOOGIE ON OVER\n\n\r\n                    Cousins signed a 10-day contract. The 30-year-old center appeared in 25 games for Houston this season, averaging 9.6 points, 7.6 rebounds, and 2.4 assists.\n\n\r\n                    “He definitely adds toughness,” Lue said. “The biggest thing for him is seeing where his condition is right now. He hasn’t played in a while.”\n\n\r\n                    Cousins had seven points, four rebounds and two assists in eight minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Visit Utah on Thursday to conclude the two-game trip.\n\n\r\n                    Clippers: Host Phoenix on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997674.918198
}