{
  "game_id": "0021800099",
  "espn_id": "401070780",
  "date": "Oct 30, 2018",
  "matchup": "DET @ BOS",
  "headline": "Irving scores 31, Celtics beat Pistons again 108-105",
  "body": "BOSTON --  After averaging 14 points through the first six games, Kyrie Irving knew he was due to start hitting some shots.\n\nIrving broke through Tuesday night with a season-high 31 points and led a third-quarter surge that put Boston in command of a 108-105 win over Detroit, handing the Pistons back-to-back losses after a 4-0 start.\n\n\"I was taking shots that they were giving me,\" said Irving, who made 10 of 16 shots from the floor and added five assists and five rebounds. \"Me taking some of those shots made the defense come out a little higher, then created some other opportunities for my teammates, which felt good.\"\n\nIrving's effect on the game showed in the box score as well with four of his teammates also scoring in double figures as the Celtics won their third straight.\n\nJayson Tatum scored 16, Jaylen Brown had 14 points and Al Horford scored 11 for Boston. Marcus Morris had 15 points and nine rebounds.\n\nIrving's previous high this season was 22 last Monday against Orlando. He scored just three Saturday when the Celtics beat the Pistons 109-89.\n\n\"Law of averages,\" Boston coach Brad Stevens said. \"He's way too good of a scorer for the ball not to go in very long and all that stuff evens out over time.\"\n\nBlake Griffin had 24 points and 15 rebounds for Detroit, which couldn't recover after scoring just 13 points in the third quarter.\n\nThe Pistons chopped Boston's 14-point lead down to a point with 4:21 left to play, and then again with 12 seconds remaining, but couldn't complete the comeback.\n\n\"I like how we played in stretches tonight. Playing at home, getting beat by 25,whatever it was, and then coming out and giving this type of effort is promising,\" Griffin said. \"That's what we have to do. We might not be as talented as some of these teams in the East, but we have enough talent. What's going to set us apart is our will and how we go about putting our will on the game.\"\n\nBoston is still the only team to beat the Pistons this season.\n\nAndre Drummond had 17 points and 12 rebounds and Reggie Bullock scored 16 for Detroit. Ish Smith added 13 points off the bench and gave Detroit one more chance on a 3-pointer with 12 seconds left to play, pulling Detroit within 103-102. But the Celtics sealed it from the foul line.\n\nTatum drew a foul and made both free shots with 10.5 seconds left, then Irving added two more from the line after Detroit turned the ball over on the inbound play.\n\nThe Pistons led 58-56 after a high-paced first half, but fell off in the third quarter, going 4 for 17 from the floor and missing all six attempts from 3-point range.\n\nIrving took over in the third, scoring 13 and starting an early 10-0 run that put Boston up for good.\n\n\"We had to pick our energy level up,\" Brown said.\n\nGriffin hit a pair of free throws with 4:38 left in the period to pull Detroit within 70-65, but Irving responded for the Celtics with three straight 3-pointers as Boston stretched the lead to 14 points late in the period.\n\nDrummond got Detroit back in it in the fourth quarter after Griffin drove for a layup that cut Boston's lead to 88-84 with 6:01 left to play. Drummond drove for a dunk, blocked a shot by Tatum at the other end and was there to tip in a miss by Stanley Johnson to pull within 90-88.\n\nThe Celtics thought Drummond interfered with the ball while it was on the rim and called for a replay, which didn't happen but did get coach Brad Stevens a technical for coming out on the court to argue.\n\nBullock made the foul shot to pull Detroit within a point, but Boston responded again with six straight points.\n\n\"I love our fight,\" Detroit coach Dwane Casey said. \"Like I told the team, we put that type of intensity and fight every night, and that's what we ask, you put yourself in position to win.\"\n\nTIP-INS\n\nPistons: Drummond and Griffin scored 12 points apiece in the first half. ... The Pistons exercised the club option on the contract of G Luke Kennard through next season. Kennard was inactive Tuesday with a sprained right shoulder. ... Detroit outscored Boston 30-25 in the second quarter and led 58-56 at halftime. ... Griffin picked up his fourth foul with 2:22 left in the third quarter.\n\nCeltics: Irving's previous season high was 22 points. ... F Daniel Theis was out with a plantar fascia tear in his right foot. ... Horford was called for a three-second violation twice in the first quarter.\n\nUP NEXT\n\nPistons: Continue a three-game road trip Wednesday night at Brooklyn.\n\nCeltics: Host Milwaukee on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994721.270487
}