{
  "game_id": "0021700986",
  "espn_id": "400975732",
  "date": "Mar 09, 2018",
  "matchup": "CLE @ LAC",
  "headline": "Clippers easily defeat James and Cavaliers 116-102",
  "body": "LOS ANGELES --  Beating LeBron James and the Cavaliers was a statement game to the Los Angeles Clippers only in that it lifted them into the eighth and final Western Conference playoff spot.\n\nDeAndre Jordan had 20 points and 23 rebounds and Tobias Harris scored 23 points in a 116-102 victory Friday night. The Clippers hold the eighth spot by percentage points over Utah and Denver.\n\n\"In the West, (seeds) 3 through 8 is like two, three games apart,\" Austin Rivers said. \"That's nuts, man. The fact that if we won six games in a row we could be the third seed but if we lose, we're out.\"\n\nThe Clippers led most of the game, coming out energized at the start and shooting 50 percent in the first quarter while taking an 18-point lead.\n\n\"We moved the ball, played fast and attacked,\" Clippers coach Doc Rivers said. \"Our defense was tremendous. LeBron is eventually going to get some, but we guarded everyone else.\"\n\nJames had 25 points and 10 rebounds, and Jordan Clarkson added 21 points for the Cavaliers, whose five-game road winning streak ended. Larry Nance Jr. had 16 points and 12 rebounds.\n\nJames shot 11 of 20 from the field and was 3 of 7 from 3-point range. Much of the time he was guarded by rookie Sindarius Thornwell.\n\n\"You're not going to block his shot,\" Thornwell said. \"Just stay in front of him and make it tough for him. It takes a team to slow him down, it wasn't just me.\"\n\nMontrezl Harrell also had 20 points for the Clippers, who controlled the boards 52-40. They owned advantages in the paint (58-42) and second-chance points (25-8).\n\n\"It was exhausting,\" Nance said. \"They've got some big, talented dudes down there.\"\n\nLos Angeles got balanced scoring with six players in double figures, and plenty of help in containing James in the first half when he had just eight points.\n\n\"We wanted to load up and give him (Thornwell) as much help as possible,\" Jordan said. \"We knew how important this game was.\"\n\nCleveland made a final stand in the fourth, as George Hill's 3-pointer got the Cavs to 110-102 before the Clippers scored the game's final six points.\n\nThe Cavs cut a 16-point deficit to 85-77 heading into the fourth. James scored seven of their last 12 points of the third, missing his only two free throws of the game at the end.\n\nJordan and James traded monster dunks over the final 3:49 of the third. Jordan began his move at the top of the arc and Hill was helpless to stop him on his own as Jordan thundered through the paint for a one-handed jam.\n\nJames was on the left wing, let the shot clock wind down against Jordan, faked him and drove baseline for a tomahawk slam that drew raucous cheers from the many Cavs fans in Staples Center.\n\nTIP-INS\n\nCavaliers: James' 3-pointer with 10:54 left in the third quarter extended his double-figure scoring streak to 856 consecutive regular-season games, second only to Michael Jordan (866) in NBA history. ... Nance has scored in double figures in a career-high six straight games. ... The Cavs wore their gray jerseys that read \"The Land\" on the front.\n\nClippers: They split the season series 1-1, having lost 118-113 in OT at Cleveland on Nov. 13 after the Cavs overcame a 15-point deficit. ... Harris has scored 20 or more points in eight of his 14 games as a Clipper. ... G Jawun Evans returned from a sore lower abdominal.\n\nDIFFERENCE OF OPINION\n\nJames returned earlier than usual in the fourth after the Clippers extended their lead to 15 points. Coach Tyronn Lue said he thought James \"got a little tired.\" His superstar disagreed. \"Fatigue is never a factor with me,\" James said. \"You always try to get a minute here, a minute there so you can have fresh legs as much as possible.\"\n\nHE SAID IT\n\n\"I don't play fantasy basketball.\" -- James, on the Cavs' failed pursuit of Jordan at the trade deadline and what he would have brought to them.\n\nUP NEXT\n\nCavaliers: Return to Staples Center on Sunday to play the Lakers.\n\nClippers: Host Orlando on Saturday in the second game of a back-to-back. The Clippers are 2-8 in the second game.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993167.364223
}