{
  "game_id": "0022000156",
  "espn_id": "401267316",
  "date": "Jan 11, 2021",
  "matchup": "SAC vs. IND",
  "headline": "Kings hold off Pacers 127-122 with replay help",
  "body": "SACRAMENTO, Calif. -- — Buddy Hield made a big 3-pointer moments after Indiana’s Domantas Sabonis had a basket taken away following a replay review, and the Sacramento Kings beat the Pacers 127-122 on Monday night.\n\n\r\n                    Hield finished with 18 points on six 3s as the Kings won for the second time in seven games. Harrison Barnes had a season-high 30 points and eight rebounds, and De’Aaron Fox added 21 points and nine assists.\n\n\r\n                    “This was probably our best win just because it was consistent throughout,” Sacramento coach Luke Walton said. “It wasn’t a ton of highs or a ton of lows. It was just consistent basketball. Win or lose, this is how we have to play.”\n\n\r\n                    The Kings held a one-point lead when Sabonis went up underneath the basket and was credited with a bucket as Richaun Holmes was called for goaltending with 1:25 remaining. After a lengthy review, the call was overturned.\n\n\r\n                    After Hield’s 3 made it 121-117, Indiana’s Victor Oladipo missed from beyond the arc. Fox then scored on a soaring one-handed dunk.\n\n\r\n                    “As a group we know we didn’t put forth our best effort these last couple of games,” Holmes said. “It’s about staying locked in. This is how we feel we can play every night. This has to be the standard.”\n\n\r\n                    Sabonis had 28 points and 11 rebounds for the Pacers. Malcolm Brogdon added 24 points, while Oladipo and Doug McDermott scored 21 apiece. \n\n\r\n                    Indiana forced turnovers on two of the first three possessions of the game, but coach Nate Bjorkgren felt the Pacers' defense broke down at key times.\n\n\r\n                    “We have to do a better job on the ball, just being more active there, so they can’t have their pinpoint precise passes right into their shooting pocket like a coach would pass it,” Bjorkgren said. “That wasn’t much fun tonight.”\n\n\r\n                    Oladipo scored 14 of 17 points for Indiana during a late stretch in the fourth. He, too, blamed the Pacers' defense.\n\n\r\n                    “We just have to do a better job of getting stops and do a better job of sacrificing on that end,” Oladipo said. “We have to talk better. We have to communicate better. We have to be decisive and smart. It’s the little things right now. It’s not something major we can’t fix.”\n\n\r\n                    Fox made a buzzer-beating 3 to end the first half with the Kings up 65-64. It came 10 seconds after Brogdon’s 3-pointer over the outstretched arm of the 6-foot-10 Holmes. \n\n\r\n                    TIP-INS \n\n\r\n                    Pacers: McDermott had 13 points in the second quarter on 5-of-6 shooting. … Myles Turner followed an offensive rebound with a tomahawk dunk in the first half. ... Bjorkgren won a challenge in the fourth quarter after Turner was initially called for his fourth foul. The call was overturned and the foul rescinded.\n\n\r\n                    Kings: Holmes had 16 points, 10 rebounds and a career-high six blocks. “He’s our motor,” said first-round draft pick Tyrese Haliburton, who scored 12 points. “When he’s energetic and makes plays like that … it just goes down the line.” ... Sacramento has scored 60 or more points in the first half of five of its 11 games.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Visit the Golden State Warriors on Tuesday night. \n\n\r\n                    Kings: Host the Portland Trail Blazers on Wednesday. It will be the second game in four days between the teams, after the Blazers won 125-99 on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997196.104289
}