{
  "game_id": "0021601174",
  "espn_id": "400900552",
  "date": "Apr 06, 2017",
  "matchup": "ORL vs. BKN",
  "headline": "Elfrid Payton has 22 points, Magic beat Nets 115-107",
  "body": "ORLANDO, Fla. --  The Orlando Magic might finally have found something to build their future around.\n\nElfrid Payton and Aaron Gordon, the team's first-round picks in the 2014 draft, lead the Magic to a 115-107 victory over the Brooklyn Nets on Thursday night.\n\nPayton had 22 points, 11 assists and five rebounds, and Gordon added 21 points, six rebounds and two monster dunks off alley-oop passes from Payton.\n\n\"It's been a tough year for us in the win-loss column, but those two guys (Payton and Gordon) have really developed, especially in the second half of this season,\" Magic coach Frank Vogel said. \"They've been getting a little bit better, a little more confident and that's been a fun thing to be a part of.\"\n\nJodie Meeks contributed 20 points to help Orlando end a five-game losing skid.\n\nJeremy Lin led Brooklyn with 32 points, and Caris LeVert added 20.\n\nPayton had eight assists during the third quarter when Orlando outscored Brooklyn 36-21 to break open a game that was tied at 50 at halftime. Half the assists went to Meeks, who scored 13 straight points in the middle of the period when Orlando seized control of the game.\n\nBut it was the Magic point guard's pass to Gordon at the end of a fast break that brought the house down. Payton looked like he was heading for a layup, but instead banked it hard off the backboard and the trailing Gordon grabbed it above the rim and slammed it home to polish off a 24-5 Magic run.\n\n\"That's the first time I've ever done that in a game,\" Payton said of his pass. \"Aaron and I have talked about it before, but we finally got a chance tonight. The chemistry between us is growing and I'm looking forward to working on it more this summer.\"\n\nThe Nets had a season-high three-game winning streak, but didn't have the legs to run with Orlando in the third quarter. Brooklyn did start the fourth period with a 12-2 run that closed the gap to 88-83 with eight minutes left in the game, but never got closer.\n\n\"I don't think we did the things defensively that were necessary to keep us in the game,\" Nets' coach Kenny Atkinson said. \"They outplayed us individually and collectively. Credit to them, they did a good job.\"\n\n\"They came out with more energy than us in the third quarter,\" said Nets' center Robin Lopez, who had a very quiet night with 10 points and five rebounds. \"I felt like I was just flat out poor tonight. That was rough. We definitely took a step back tonight.\"\n\nTIP INS\n\nNets: SG Sean Kilpatrick sat out the game with a hamstring injury. ... The Nets bench is averaging a league-best 49.7 points a game since March 1. They had 39 points against Orlando. ... The last time the Nets won four straight was in March 2015.\n\nMagic: Scoring leader Evan Fournier was out with a slight hand injury. Payton is the only Magic player to play in every game this season. ... Former Magic player and recent Hall of Fame selection Tracy McGrady sat courtside.\n\nUP NEXT\n\nNets: Home against the Chicago Bulls on Saturday. Brooklyn has lost four straight at home against the Bulls.\n\nMagic: Home against the Indiana Pacers on Saturday. Orlando is 0-3 against Frank Vogel's old team this season.",
  "source": "espn_api",
  "crawled_at": 1764995807.3790941
}