{
  "game_id": "0021700696",
  "espn_id": "400975442",
  "date": "Jan 23, 2018",
  "matchup": "SAC @ ORL",
  "headline": "Temple scores 34 to lead Kings past Magic, 105-99",
  "body": "ORLANDO, Fla. -- Garrett Temple took over in the fourth quarter and led the struggling Sacramento Kings to a big win.\nTemple scored 19 of his career-high 34 points in the final quarter to lift the Kings to a 105-99 win over the Orlando Magic on Tuesday night.\nWillie Cauley-Stein had 21 points and nine rebounds and Buddy Hield added 13 points for the Kings, who stopped an eight-game losing streak. Temple accounted for all of Sacramento's points during a 17-6 run that put the Kings ahead 103-97 with 23.5 seconds to go.\n\"Garrett was in a rhythm,\" teammate Vince Carter said. \"He was out there with veteran guys who just know how to make the right play. It was us being cognizant of `Hey, the hot guy's open, get it to him immediately.' And it worked out that way.\"\nTemple, whose previous career best was 23 points in the fourth game of this season, started 33 games before being demoted. Against Orlando, he hit all seven field goal attempts in the fourth quarter, including three 3-pointers. The rest of the Kings were 2 for 12 in the period.\n\"Garrett has been a fantastic leader for us and I couldn't be happier,\" Sacramento coach Dave Joerger said. \"He's the ultimate professional. For him to have this kind of night, I'm just tickled. He deserves it.\"\nTemple's big game came with Kings regulars Zach Randolph and George Hill out of the lineup.\nEvan Fournier led the Magic with 22 points and Elfrid Payton had 21 points, seven assists and seven rebounds. Aaron Gordon added 16 and Jonathon Simmons had 14 for Orlando, which struggled mightily to score in the final quarter.\nMagic coach Frank Vogel didn't know whether to direct his postgame ire at his team's unwillingness to guard Temple or its sloppy play offensively. The Magic were 6 of 20 from the field in the final period and committed four turnovers.\n\"You gotta cool a guy like (Temple) down and nobody could get it done,\" Vogel said. \"Offensively, we didn't make great decisions in the fourth quarter. Their switching turned us into one-on-one players and we're not a one-on-one team. We chose to play in traffic all night, put our he\nPayton's pull-up jumper with 7:13 remaining had given the Magic 91-86 lead. Orlando made just one more field goal -- a dunk by Bismack Biyombo with 5:33 left -- before Payton made a meaningless layup with under one second to play.\nSacramento rallied from an 11-point third-quarter deficit to take a 94-93 lead on Temple's 3-pointer with 5:11 left in the game. Temple followed that with two perimeter jumpers and another 3-pointer to help the Kings to a 101-97 lead with 1:31 to go.\nThe two teams played dead even for the first 30 minutes of the game before Simmons hit a hot streak that gave the Magic their biggest lead of the game, 79-68. The Magic forward scored 14 points in the third period, including three 3-pointers and a three-point play.\nHowever, as was the case all game, the Magic defense gave up the lead almost as fast as they got it.\nHield started the comeback with a 3-pointer and Cauley-Stein continued to be unguardable in the paint. His dunk cut the deficit to 82-77 by the end of the third quarter. A three-point play by Skal Labissiere made it a one-point game with over minutes to play.\nTIP INS\nKings: PG De'Aaron Fox left the game with 5:03 left in the second quarter with abdominal strain. ... PF Zach Randolph, who has started 39 games this season, was inactive. He has no injury, but didn't play for the second straight game. His replacement, Labissiere, had 10 points and nine rebounds. . C Cauley-Stein got off 10 shots the first quarter.\nMagic: Haven't won consecutive games since beating the Knicks and Suns 10 weeks ago. ... SG Arron Afflalo was in uniform after serving a two-game suspension for fighting. He did not play. ... PF Gordon had five of the team's nine turnovers in the first half. ... SF Mario Hezonja has hit just four of 20 3-point attempts over the last five games. ... The Magic presented $1 million worth of checks to 27 local charities during a halftime ceremony.\nA MAGIC SOLUTION\nTuesday's win over Orlando was the second time in less than a year that Sacramento ended an eight-game losing streak by beating the Magic. The Kings were on an eight-game slide last March when they beat Orlando 120-115. \"It's a happy locker room,\" Kings coach Dave Joerger said. \"We break a losing streak, but we've been getting better. We fought like crazy.\"\nSTILL MISSING VUCEVIC\nOrlando lost center Nikola Vucevic with a broken hand on Dec. 23 and a month later, Vogel says his team only now has adjusted to playing without a guy who has been the focal point of the team's offense for all six of his seasons in Orlando \"Basically, we lost our most complete offensive player and our identity had to change dramatically,\" Vogel said. \"We're starting to put guys in different positions where they can get comfortable with a new identity and be successful.\"\nUP NEXT\nKings: At Miami, where the Kings haven't won in 16 years, on Thursday night.\nMagic: At Indiana on Saturday night. Orlando is 0-2 vs. Pacers this season.",
  "source": "espn_api",
  "crawled_at": 1764993258.067223
}