{
  "game_id": "0022201100",
  "espn_id": "401469255",
  "date": "Mar 24, 2023",
  "matchup": "MEM vs. HOU",
  "headline": "Grizzlies clinch playoff berth with 151-114 rout of Rockets",
  "body": "MEMPHIS, Tenn. -- — Luke Kennard made a franchise-record 10 3-pointers to match his career high with 30 points, Desmond Bane added 25 points and the Memphis Grizzlies clinched a playoff spot after building a 31-point halftime lead and coasting to a 151-114 victory over the Houston Rockets on Friday night.\n\n\r\n              Kennard, acquired from the Los Angeles Clippers in a trade deadline deal Feb. 9, connected on 10 of 11 shots from outside the arc — only the second player in NBA history to score 30 points all on 3-pointers. Bane was 5 of 7 from 3-point range as Memphis made 25 3-pointers to set a franchise mark.\n\n\r\n              “When you start hitting a couple in a row, usually about three for me, I start feeling it a little bit,” Kennard said. “It’s the kind of thing where once it leaves your hand, you think it’s going in. So, it was pretty fun.”\n\n\r\n              Ja Morant scored 18 points and had eight assists in his second game after serving an eight-game league-imposed suspension after he posted a video in which he is shown waving a gun at a Denver-area strip club. Morant, as he did in his first game back Wednesday night also against the Rockets, again came off the bench. He entered with 5:08 left in the first quarter.\n\n\r\n              Jaren Jackson Jr. also scored 18 points and had seven rebounds and two blocks for Memphis, which had the second-most points in franchise history. The Grizzlies won their 11th straight at home and moved within three games of idle Denver, which holds the top spot in the Western Conference.\n\n\r\n              Memphis clinched the Southwest Division on Wednesday night, but weren’t assured a playoff berth until its victory Friday night since division winners don't automatically earn playoff spots.\n\n\r\n              Tari Eason had 21 points to lead Houston, while Kevin Porter Jr. and Jabari Smith Jr. each had 20. Porter also had seven assists and six rebounds. Smith grabbed eight boards.\n\n\r\n              Unlike Wednesday night's game between the teams that was closely played, Memphis put this one out of reach in the first half. The Grizzlies shot 60% overall in the half, connected on 14 of 25 from outside the arc and built the advantage to as many as 31 with an 83-52 lead at the break.\n\n\r\n              “We weren't physical with them. They were physical with us,” Rockets coach Stephen Silas said. “We were just letting them run around wherever they wanted. Obviously, Kennard got going and we were just late (defending the 3-point line).”\n\n\r\n              While Memphis isn't normally known for its 3-point shooting, Silas noted that Kennard and Bane combined to make 15 long-range shots. \n\n\r\n              \"Kennard was 10 for 11. The guy was going,\" Silas said.\n\n\r\n              For Kennard, it was the best game for Memphis since the trade. Soon after he arrived, he was reluctant to take shots as he became more comfortable with his new team. From coaches to players, all have encouraged him to take his shot.\n\n\r\n              “Obviously, he's coming out talking about how we've been on him, his teammates have been on him talking about being more aggressive,” Memphis coach Taylor Jenkins said. \"You see his confidence building one game at a time.\n\n\r\n              “This is why we made the trade for him.”\n\n\r\n              TIP-INS\n\n\r\n              Rockets: Kenyon Martin Jr., who has connected on 59% of his shots since the All-Star break, was 4 of 6 from the field. ... Houston has lost five straight in the series, the longest losing streak of either team. ... The Rockets are 1-5 in their last six road games.\n\n\r\n              Grizzlies: Dillon Brooks returned and started after serving his second one-game suspension for technical fouls. Brooks has 18 this season. The next threshold for another one-game suspension is his 20th technical. ... Memphis went undefeated at home against the Southwest Division. Their only two division losses — to Dallas and New Orleans — both came on the road. ... Bane passed Rudy Gay for fifth in franchise history for 3-pointers made. ... The previous record for 3s in a game was nine, twice by Mike Miller and once by Jackson Jr.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Continue a five-game road trip in Cleveland on Sunday.\n\n\r\n              Grizzlies: At Atlanta on Sunday to face the Hawks\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994168.497325
}