{
  "game_id": "0022000744",
  "espn_id": "401307535",
  "date": "Apr 02, 2021",
  "matchup": "OKC @ PHX",
  "headline": "Suns lead by 30 after 1 quarter, cruise past Thunder 140-103",
  "body": "PHOENIX -- — Devin Booker scored 32 points, Chris Paul had 17 points and 12 assists, and the Phoenix Suns built a 30-point lead by the end of the first quarter en route to a 140-103 victory over the Oklahoma City Thunder on Friday night.\n\n\r\n                    The Suns won their fifth straight game, and this one was decided in a hurry. Booker shot 11 of 20 from the field, made three 3-pointers and added five assists. Paul made all eight of his field goal attempts.\n\n\r\n                    Phoenix dominated from the opening tip, sprinting to a 22-5 lead in the first six minutes. The Suns shot 15 of 25 from the field (60%) and led 43-13 by the end of the quarter. Oklahoma City shot just 4 of 25 (16%) from the field in the opening quarter, struggling to find good looks with an injury-depleted and inexperienced lineup.\n\n\r\n                    The Suns are now 20 games over .500 and have a 34-14 record. Phoenix hasn't made the playoffs in over a decade but has the look of a team that could make it deep into the postseason.\n\n\r\n                    “Just getting better, continuing to get better to reach our goals down the line,” Booker said. “We always say we're not playing against our opponents. We're playing against ourselves.”\n\n\r\n                    Booker threw down a huge one-handed jam during the opening blitz, slicing right through a flat-footed Thunder defense. The 30-point advantage was the largest for the Suns in any single quarter of any game in franchise history.\n\n\r\n                    “I just like winning,” Suns coach Monty Williams said. “30 points, one point, whatever it is. I want to get our team used to winning games and the value of being a good team. It’s something I don’t take for granted. I’ll coach any situation that has us in the victory column.\"\n\n\r\n                    Mikal Bridges and Cameron Johnson both added 17 points for the Suns, who shot 60% from the field. Johnson came back to score his points despite needing stitches in the first half because of a cut above his left eye.\n\n\r\n                    The Suns had a 32-point lead early in the second quarter but Oklahoma City was able to cut the advantage to 73-50 by halftime. Booker had 20 points before the break while Paul had 12 points and seven assists.\n\n\r\n                    It was the second straight big game for Booker, who scored a season-high 45 against the Bulls on Wednesday.\n\n\r\n                    “Devin can score,” Williams said. “It’s hard to come up with another way to describe it. I’ve played with guys like that, been with guys like that, guarded guys like that. It's just a gift.”\n\n\r\n                    The second half was mostly an afterthought. The Thunder closed the advantage to 18 points at one point midway through the third, but the Suns responded with the next five points to eliminate any drama.\n\n\r\n                    “I give (Phoenix) a lot of credit,” Oklahoma City coach Mark Daigneault said. “Their aggressiveness and intensity to start the game was definitely there. They were ready to play and it took us a long time to match that.”\n\n\r\n                    Rookie Théo Maledon was the one bright spot for the Thunder. The 19-year-old scored a career-high 33 points, shooting 10 of 18 from the field, including 5 of 7 3-pointers. Fellow rookie Aleksej Pokusevski added 20 points.\n\n\r\n                    Maledon had his big night despite missing his first four shots.\n\n\r\n                    “I knew at some point they would fall so I had to keep going,” Maledon said. \n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Oklahoma City was without a few of its top players, including G Shai Gilgeous-Alexander (right foot plantar fasciitis) and G Luguentz Dort (concussion protocol). ... G Ty Jerome was questionable but was able to play on a sprained right ankle. Jerome played his rookie season with the Suns before being traded to the Thunder in the deal that brought Paul to the desert. Jermoe finished with five points on 2 of 11 shooting.\n\n\r\n                    Suns: F Frank Kaminsky was out for a third straight game in the league's coronavirus health and safety protocol. ... F Torrey Craig was questionable with left knee soreness but played and finished with seven points. ... Jae Crowder and Dario Saric both scored 11. ... Rookie Ty-Shon Alexander scored the first points his career in the fourth quarter. He hit a 3-pointer and made a free throw to finish with four points.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Travel to face Portland on Saturday.\n\n\r\n                    Suns: Travel to face Houston on Monday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt at www.twitter.com/davidbrandtAP\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997081.814146
}