{
  "game_id": "0022300537",
  "espn_id": "401585165",
  "date": "Jan 12, 2024",
  "matchup": "MEM vs. LAC",
  "headline": "George scores season-high 37 points, Leonard adds 22 as Clippers defeat Grizzlies 128-119",
  "body": "MEMPHIS, Tenn. -- — Paul George scored a season-high 37 points, Kawhi Leonard added 22 and the Los Angeles Clippers defeated the Memphis Grizzlies 128-119 on Friday night. \n\n\r\n              George connected on 12 of 18 shots, going 7 for 10 from 3-point range, in his sixth game this season with at least 30 points. Leonard, who signed a three-year contract extension Wednesday, was 10 of 16 from the field. \n\n\r\n              “(George) is in a great rhythm right now,” Clippers coach Tyronn Lue said. “Ten 3s again tonight. I wish he'd take three or four more.”\n\n\r\n              Amir Coffey had 13 points, making all six of his attempts as the Clippers shot 55% from the floor.\n\n\r\n              “I think we’ve still got a bunch to improve on,\" Leonard said. \"Just things where we’ve got to be more consistent.”\n\n\r\n              Jaren Jackson Jr. led Memphis with 21 points, and Xavier Tillman finished with 20 points — matching his career high — and nine rebounds. David Roddy scored 17.\n\n\r\n              Desmond Bane had 15 points for the injury-riddled Grizzlies before leaving in the third quarter when he sprained his left ankle on a drive to the basket. Memphis coach Taylor Jenkins was unsure of the severity.\n\n\r\n              “That's just the cards we've been dealt,” Roddy said. “Better days are ahead of us. This is something we're going to learn from and laugh about in the future.”\n\n\r\n              Shortly after Bane's departure, the Clippers pushed their lead to 23 points. They were still shooting above 61% overall and 52% from outside the arc at the end of the third.\n\n\r\n              The Clippers have won eight of nine, moving them into fourth place in the West.\n\n\r\n              “Just being able to win in different ways,” Lue said when asked about the difference in his team during the streak. “You've got to be able to win pretty, you've got to be able to win ugly, and win whatever is in between that. You've just got to be able to win games.”\n\n\r\n              Memphis continues to deal with a rash of injuries. Leading scorer Ja Morant, suspended 25 games to start the season for twice waving a gun on social media, underwent surgery on his right shoulder Thursday and is done for the season. \n\n\r\n              Immediately after that, the team announced his backup, point guard Marcus Smart, injured his right ring finger and will be re-evaluated in six weeks. They were part of a half-dozen Memphis rotation players out with injuries against Los Angeles. And now Bane's injury.\n\n\r\n              “It’s unique, that’s for sure, but we’ve got to look past that,” Jenkins said. “Our circumstances are pretty heavy right now.”\n\n\r\n              Meanwhile, the Clippers were at full strength, which showed in the second quarter. Los Angeles outscored Memphis 42-27 in the period, shooting 76.2%, including 7 of 10 from beyond the arc. That stretched the lead to 65-53 at the break. \n\n\r\n              Lue said the difference was George making shots and James Harden, who had 11 points and nine assists, orchestrating the offense.\n\n\r\n              “Defensively, we were able to make some stops, and get out in transition as well,\" Lue said.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Play at Minnesota on Sunday.\n\n\r\n              Grizzlies: Host the New York Knicks on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996511.986583
}