{
  "game_id": "0021900786",
  "espn_id": "401161428",
  "date": "Feb 09, 2020",
  "matchup": "OKC vs. BOS",
  "headline": "Celtics edge Thunder 112-111 for 7th straight win",
  "body": "OKLAHOMA CITY --  With most of their lead gone, the Boston Celtics needed someone to make a stop in the final seconds.\n\nAs usual, Marcus Smart took it upon himself.\n\nSmart o stole the ball from Oklahoma City's Shai Gilgeous-Alexander with 5.8 seconds le,fhelping the Celtics hold on for a 112-111 victory over the Thunder on Sundayry.\n\n\"I didn't even want to give them an attempt to even get a shot up and a chance to tie the game or come close to it,\" Smart said.\n\nKemba Walker scored 27 points and Jayson Tatum had 26 for the Celtics, who won their seventh straight.\n\n\"Good, tough teams,\" Celtics coach Brad Stevens said. \"A lot of smart basketball and then we almost gave it away at the end. But, you know, up to that point I think we played really hard and really well.\"\n\nJaylen Brown finished with 17 points for the Celtics, who made 16 3-pointers. One of them, by Smart with 8:19 remaining, gave Boston the lead for good.\n\nDanilo Gallinari and Gilgeous-Alexander each had 24 points for the Thunder, while point guards Chris Paul and Dennis Schroder finished with 22 apiece. Oklahoma City had its four-game winning streak snapped.\n\n\"I thought our guys really, really competed and played,\" Thunder coach Billy Donovan said. \"We weren't able to finish well enough in some crucial situations.\"\n\nOklahoma City led 61-52 at halftime but Tatum heated up in the third quarter. His 3-pointer made it 70-68 with 7:38 left in the period.\n\n\"I thought they were the aggressor in the last 14 minutes of the first half,\" Stevens said. \"And then we were great out of the gate in the second and then it went back and forth.\"\n\nBoston led 109-101 after Walker made his second straight 3-pointer, but Oklahoma City battled back and had a chance to tie after Schroder blocked Gordon Hayward's layup. But Smart stripped Gilgeous-Alexander before he had a chance to take what would have been a game-tying 3-pointer.\n\n\"It took a lot of grit,\" Tatum said. \"They are a really good team. They are tough and they compete, so we just had to match their intensity.\"\n\nPaul hit a 3-pointer at the final buzzer, but Smart's defense was enough to clinch the win.\n\n\"I saw an opportunity to make a play, and I made it,\" Smart said.\n\nTIP-INS\n\nCeltics: Brown and Daniel Theis both were questionable before tipoff with right ankle sprains, but both started and played at least 30 minutes. . Tatum scored 12 points on 5-of-7 shooting in the third quarter. . Smart picked up a technical foul because he stayed on the court after the halftime buzzer arguing with officials.\n\nThunder: Gilgeous-Alexander didn't record a block for the first time in 10 games. . Terrance Ferguson played 26:18 in his third game back from an eight-game absence for personal reasons. He didn't score. . Darius Bazley didn't play after halftime because a right knee sprain. He injured his knee on a layup late in the second quarter.\n\nCAPITALIZING\n\nThe Celtics forced only 10 Thunder turnovers, but they were able to score 21 points off of those. Boston also excelled in fast-break situations, scoring 12 points on 5-of-6 shooting.\n\nQUOTABLE\n\nTatum, on how often Smart makes game-changing plays:\n\n\"Every time we need it. He definitely saved us today, saved me from the three turnovers I had late in the stretch, so that was a big-time play by him.\"\n\nSmart finished four steals and seven points in 22 minutes.\n\nUP NEXT\n\nCeltics: Visit the Houston Rockets on Tuesday\n\nThunder: Host the San Antonio Spurs on Tuesday",
  "source": "espn_api",
  "crawled_at": 1764996207.3111439
}