{
  "game_id": "0022000194",
  "espn_id": "401307376",
  "date": "Mar 13, 2021",
  "matchup": "IND @ PHX",
  "headline": "Sabonis' triple-double helps Pacers cool off Suns, 122-111",
  "body": "PHOENIX -- — Malcolm Brogden scored 25 points and Domantas Sabonis had a triple-double with 22 points, 13 rebounds and 10 assists to lead the Indiana Pacers over the Phoenix Suns 122-111 on Saturday night.\n\n\r\n                    Doug McDermott added 22 points for the Pacers, who improved to 17-20. Sabonis also had four steals and a block and shot 9 of 13 from the field.\n\n\r\n                    Caris LeVert made his much-anticipated Indiana debut following surgery to remove a mass on his kidney. He was in the starting lineup and played well, scoring 13 points in 27 minutes.\n\n\r\n                    The Pacers were efficient on offense, shooting 53% from the field, but McDermott said the team's success started on defense. The Suns had 16 turnovers and Indiana turned them into several easy baskets.\n\n\r\n                    “Sometimes guys are hanging their heads on offense because shots aren’t falling,” McDermott said. “I think the main thing you can do to get your offense going is bringing energy on the defensive end and we were able to do that.”\n\n\r\n                    Devin Booker had 20 points and Dario Saric came off the bench to score 17 for the Suns, who had their five-game winning streak snapped and fell to 25-12.\n\n\r\n                    The Suns led 33-29 after the first quarter but the Pacers opened the second with a 12-0 run, hitting five of their first six shots to take a 41-33 advantage in the first three minutes. The Pacers had a 62-57 lead at halftime. \n\n\r\n                    Phoenix went cold in the third quarter, hitting only seven shots in 22 attempts. The Pacers capitalized, taking a 97-77 lead into the fourth.\n\n\r\n                    In the final period, the closest the Suns got was nine. \n\n\r\n                    “They were a bit more urgent and desperate than we were tonight from the jump,” Phoenix coach Monty Williams said. “We had it in spurts but they had it more consistently.”\n\n\r\n                    Indiana acquired LeVert on Jan. 16 as part of a four-team trade that sent James Harden to Brooklyn and Victor Oladipo to Houston. It was during the post-trade physical that a mass on LeVert’s left kidney was discovered. Tests showed it was a renal cell carcinoma and LeVert had surgery on Jan. 26 to remove the mass.\n\n\r\n                    “Today was maybe my second time going 5-on-5 since everything happened,” LeVert said. “A little bit of heavy legs and the condition and everything like that, but that will come back.”\n\n\r\n                    Prior to the trade, the 6-foot-6 LeVert averaged 18.5 points and six assists in 12 games with the Nets this season.\n\n\r\n                    “It was great to see him back out there. The players really enjoyed him being there and the things he can do,\" Pacers coach Nate Bjorkgren said. \"You can see he is dynamic with the basketball. That was just the beginning. He did a lot of nice things. I thought he looked great out there.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Improved to 10-9 on the road. … Indiana is 5-3 when playing on the second night of a back-to-back. … The last time Indiana lost in Phoenix was January 2014. The Pacers have won five straight in Arizona. … Former Suns player T.J. Warren sat out again with a left foot stress fracture. … Jeremy Lamb also missed the game with a sore left knee. \n\n\r\n                    Suns: The game was originally scheduled for Jan. 16 but was one of three Suns games postponed due to the NBA’s health and safety protocols. … Cam Johnson sat out because of health and safety protocols. … The Suns are 12-7 at home and 13-5 on the road.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Wrap up their three-game road trip in Denver on Monday.\n\n\r\n                    Suns: Host the Memphis Grizzlies on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997143.2678258
}