{
  "game_id": "0022400736",
  "espn_id": "401705302",
  "date": "Feb 07, 2025",
  "matchup": "ATL vs. MIL",
  "headline": "Trae Young helps Hawks overcome 21-point deficit in 115-110 victory over Bucks",
  "body": "ATLANTA -- — Trae Young had 24 points and seven assists and the Atlanta Hawks overcame a 21-point deficit to beat the Milwaukee Bucks 115-110 on Friday night.\n\n\r\n              Mouhamed Gueye had 15 points, 11 rebounds and four blocks — all season highs — and Dyson Daniels had 15 points and 10 assists. Atlanta ended a five-game home losing streak and won for only the second time in 11 games overall. \n\n\r\n              Bobby Portis had 26 points and 15 rebounds for Milwaukee, with All-Star Giannis Antetokounmpo missing his third straight game because of tightness in his left calf. Damian Lillard had 23 points, 10 assists and nine rebounds. The Bucks have lost five of six.\n\n\r\n              Kyle Kuzma, playing first game for the Bucks since being traded from the Wizards, had 12 points and seven rebounds in 24 minutes. All 12 of his points came in the first half.\n\n\r\n              Takeaways\r\n              Bucks: Kuzma found out he was playing not long before tip-off, and he showed signs that he will make a difference down the stretch in the first half. Bucks coach Doc Rivers said the plan will be for him to join the starting lineup.\n\n\r\n              Hawks: The Hawks showed some serious fight after a rough second quarter as they await the arrivals of trade acquisitions Caris LeVert, Terance Mann and Georges Niang, who should be available for their next game.\n\n\r\n              Key moment\r\n              In a game of big runs, the Hawks made the final one, scoring six straight to take a seven-point lead with just under two minutes left.\n\n\r\n              Key stat\r\n              The Bucks scored 47 points and hit their first 10 3-pointers in the second quarter. They finished 11 for 15 to match the matched the franchise record for 3s in a quarter.\n\n\r\n              Up next\r\n              The Bucks host Philadelphia on Sunday. The Hawks open a three-game trip at Washington on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997921.3617249
}