{
  "game_id": "0022401123",
  "espn_id": "401705689",
  "date": "Apr 04, 2025",
  "matchup": "OKC @ HOU",
  "headline": "Green scores 34 as Rockets snap Thunder's 11-game winning streak with 125-111 victory",
  "body": "HOUSTON -- — Jalen Green had 34 points, Alperen Sengun added 31 and the Houston Rockets snapped the Oklahoma City Thunder's 11-game winning streak with a 125-111 victory Friday night.\n\n\r\n              Houston, which is second in the Western Conference, improved to 2/3 against the top-seeded Thunder with the win. Oklahoma City lost for the first time since March 10.\n\n\r\n              The Rockets led by 23 in the first half but the Thunder got within nine on a shot by Shai Gilgeous-Alexander with about 7 ½ minutes to go. Green scored five points in a 7-2 run to make it 113-99 midway through the quarter and Oklahoma City didn’t get within single digits again.\n\n\r\n              Jalen Williams led the Thunder with 33 points and Gilgeous-Alexander had 22 to reach 20 points for the 70th straight game, moving past Michael Jordan for the fourth-longest single-season streak in NBA history.\n\n\r\n              The Rockets were up by 12 in the third when they used a 10-2 spurt to extend the lead to 93-73 with 3 minutes left in the quarter. But Gilgeous-Alexander scored eight points in a 12-3 run to end the quarter and cut the lead to 96-85 entering the fourth.\n\n\r\n              Takeaways\r\n              Thunder: Chet Holmgren, who had 20 points, made a career-high six 3-pointers after going 1 of 11 combined from long range in his last three games.\n\n\r\n              Rockets: Houston got the win despite missing perhaps its best defender with Dillon Brooks serving a one-game suspension after receiving his 16th technical foul Wednesday night.\n\n\r\n              Key moment\r\n              Houston’s run in the fourth after the Thunder cut the lead to nine, which was capped by a 3 from Green.\n\n\r\n              Key stat\r\n              Houston outrebounded Oklahoma City 48-33.\n\n\r\n              Up next\r\n              Houston visits Golden State on Sunday night and the Thunder play the first of consecutive games against the Lakers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997494.160665
}