{
  "game_id": "0022301007",
  "espn_id": "401585635",
  "date": "Mar 21, 2024",
  "matchup": "MIL vs. BKN",
  "headline": "Lillard sparkles, Antetokounmpo returns to help Bucks hold off Nets, 115-108",
  "body": "MILWAUKEE -- — Damian Lillard had his third straight game with at least 30 points. He made his two biggest plays on the other end of the floor.\n\n\r\n              Lillard had 30 points and 12 assists and made two late steals as the Milwaukee Bucks capitalized on Giannis Antetokounmpo’s return to beat the Brooklyn Nets 115-108 on Thursday night.\n\n\r\n              The first of those two steals led to the winning basket after the Nets overcame a 20-point deficit to take the lead.\n\n\r\n              “I think in my career, I haven't been known as a defender, but down the stretch of games, I've always been able to have a moment or do what I needed to do at the end of the game defensively,\" said Lillard, who has averaged 31 points and 11.3 assists over his last three games. \n\n\r\n              Antetokounmpo had 21 points, nine rebounds and five assists after missing two games because of an issue with his left hamstring. \n\n\r\n              “You try to control what you can control,” Antetokounmpo said. “Things like this are going to pop up now and then. Kind of unexpected, but at the end of the day, these are the cards you've been dealt, and you just have to keep on figuring it out, keep on playing through pain, playing through adversity.”\n\n\r\n              The Bucks rested Khris Middleton a night after he played 33 minutes in a 122-119 loss at Boston, as they continue to manage his workload in his recovery from a sprained left ankle.\n\n\r\n              Mikal Bridges scored 24 points, Nic Claxton had 22 and Cam Thomas 21 for the Nets, who lost their fifth straight.\n\n\r\n              After trailing by 20 points late in the second quarter and 18 early in the third, the Nets pulled ahead by outscoring the Bucks 21-6 over the first 5 1/2 minutes of the final period.\n\n\r\n              “We didn't get a win, but I really believe that we grew tonight,” Nets interim coach Kevin Ollie said. ”That's the message I've been telling them since I took over. I just want them to grow.\"\n\n\r\n              Cam Johnson made a 3-pointer with 6:58 left to put Brooklyn ahead 87-88, giving the Nets their first lead since 11-9. Dennis Smith Jr. followed with a steal and a basket to make 90-87 with 6:41 remaining.\n\n\r\n              Antetokounpmo made a 3-pointer to tie it with six minutes left, and the game went back and forth from there.\n\n\r\n              It was tied at 96 when Lillard got a steal and started a fast break. The sequence resulted in Antetokounmpo scoring on the other end of the floor while getting fouled. Antetokounmpo hit the ensuing free throw to complete a 3-point play with 3:36 remaining.\n\n\r\n              Milwaukee extended the lead to five on two occasions, but the Nets cut it to 103-101 on Bridges' 3-pointer with 2:17 left.\n\n\r\n              After Antetokounmpo missed a shot, the Nets had the ball with a chance to tie or take the lead. Dennis Smith Jr. drove into the lane, but Lillard stole the ball, headed upcourt and found Malik Beasley open for a corner 3-pointer that made it 106-101 with 1:37 remaining.\n\n\r\n              Lillard then sealed the victory by scoring the game's next five points, including a 3-pointer with 41 seconds left.\n\n\r\n              “Dame defensively was phenomenal tonight, all game,\" Bucks coach Doc Rivers said. \"He's a very competitive guy, and you could see that tonight.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: At New York on Saturday.\n\n\r\n              Bucks: Host Oklahoma City on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996105.2593431
}