{
  "game_id": "0021800017",
  "espn_id": "401070703",
  "date": "Oct 19, 2018",
  "matchup": "CHA @ ORL",
  "headline": "Walker leads Hornets to 120-88 rout over Magic",
  "body": "ORLANDO, Fla. --  The Charlotte Hornets have owned the Orlando Magic the last three seasons and nobody is more responsible than Kemba Walker.\n\nWalker missed his first five shots, didn't score until midway through the second period and finished with 26 points as Charlotte beat Orlando 120-88 on Friday night.\n\nIt was the Hornets' 12th straight win over the Magic.\n\n\"I'm not on the court thinking we want to keep running the streak up against Orlando, that's just not the case,\" Walker said. \"The whole object is to win. I just want to play well and do what I need to do to win the game.\"\n\nNicolas Batum and Miles Bridges had 15 points apiece and Michael Kidd-Gilchrist added 12 for the Hornets, who won for first time this season. Charlotte limited the Magic to just 33.3 percent shooting and 54 points in the first three periods.\n\nTerrence Ross came off the bench to lead the Magic with 14 points. Nikola Vucevic and Evan Fournier had 12 points apiece for Orlando, which trailed by 20 at halftime and never got closer than 15 points in the second half.\n\n\"To be consistent, you've got to have a way to play and play that way every night and that wasn't at all the case,\" Magic coach Steve Clifford said. \"At halftime, I thought we had a great chance to win the game. Twenty is not a big number in this league, but then Kemba got going in the third and that was it.\"\n\nWalker helped Charlotte overcome a dreadful first half of offense by hitting a pair of 3-pointers and assisting Marvin Williams on two more 3-pointers at the start of the third period as the Hornets pushed their lead to as many as 31 points in the third quarter.\n\nThe subs for both sides took over at that point, but nothing changed.\n\nThe first half was forgettable for both teams. Each struggled to make shots and that poor shooting was magnified by 18 turnovers between them.\n\nOrlando was slightly worse in both areas with 28.6% shooting and 12 turnovers that allowed Charlotte to build a 51-31 lead by halftime. Walker, who was scoreless in the first quarter, had 14 points in the second, and led an 18-5 run by the Hornets in the final six minutes of the half.\n\nTIP-INS\n\nHORNETS: Charlotte has won 14 of its last 15 games against the Magic. ... The Hornets shot just 30.4 percent and committed four turnovers in the first period and still led 22-10.\n\nMAGIC: C Nikola Vucevic, who didn't have a block in the season opener, had four against Charlotte. ... SG Evan Fournier was shot 0 for 7 in the first half. ... Orlando missed its first 10 3-point attempts and was 6 for 31 (19.4 percent) for the game.\n\nSLOW DOWN FOLKS\n\nOne game into the season, Magic coach Steve Clifford already is hearing questions about when first-round pick Mohamed Bamba is going to replace seven-year veteran Nikola Vucevic in the starting lineup. \"I don't know why we would even have a conversation like that,\" Clifford said. \"Mo is going to be out there playing quality minutes, but he's not ready physically to play starters' minutes.\n\n\"Plus, Nik is like a top 10 or 12 starting center in this league. He might be our best offensive player. We get shots strictly by the space he creates on the floor.\"\n\nLOOKING BACK\n\nHornets coach James Borrego's first NBA coaching gig was in Orlando, where he replaced Jacque Vaughn in the middle of 2014-15 season. Borrego went 6-6 in his first 12 games as the interim coach, but just 4-14 the rest of the way for a 10-20 record. \"I think it laid the foundation for me to be standing here today,\" Borrego said. \"Being thrown into the fire, not knowing what to expect, you've just got to go for it. It gave me the confidence that yeah, you're ready for this.\"\n\nUP NEXT\n\nHornets: At Miami on Saturday night.\n\nMagic: First road game of the season at Philadelphia on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994444.450814
}