{
  "game_id": "0022300737",
  "espn_id": "401585365",
  "date": "Feb 08, 2024",
  "matchup": "CHI @ MEM",
  "headline": "DeMar DeRozan, Andre Drummond lead Bulls past Grizzlies 118-110",
  "body": "MEMPHIS, Tenn. -- — DeMar DeRozan scored 30 points, Andre Drummond added 21 points and 13 rebounds, and the Chicago Bulls rallied in the fourth quarter to beat the Memphis Grizzlies 118-110 on Thursday night.\n\n\r\n              Nikola Vucevic added 20 points and 10 rebounds and Coby White also scored 20 for the Bulls, who won their second straight and third of four. Drummond went 10 of 11 from the field.\n\n\r\n              The Bulls had centers Drummond and Vucevic on the floor together for significant minutes, and the pair dominated inside, contributing to Chicago out-rebounding Memphis 46-34.\n\n\r\n              “We're a force together in the paint,” Drummond said. “It makes teams deal with us on both ends of the court. I really like that lineup, and I look forward to more of it.”\n\n\r\n              Bulls coach Billy Donovan said playing the two big men together creates a scouting problem for opponents. He said the team has worked on the unconventional lineup in recent days.\n\n\r\n              “Those two guys are very good together,” Donovan said. “They know how to play off each other, but it's the other spacing around those guys that has to be better.”\n\n\r\n              Jaren Jackson Jr. scored 28 points for the Grizzlies before fouling out in the fourth quarter. GG Jackson added 27 points and Santi Aldama scored 15, as did Scotty Pippen Jr. Vince Williams Jr. had 13 points, 11 rebounds and eight assists for Memphis, which lost its seventh straight.\n\n\r\n              GG Jackson, a two-way player the Grizzlies took with the 45th pick in last year's draft, had struggled at times recently and came off the bench. He was 9 of 18 from the field, including 4 of 9 from 3-point range.\n\n\r\n              “GG was phenomenal,” Memphis coach Taylor Jenkins said. “Obviously, embracing his role coming off the bench. Offensively, diversified scoring attacks. ... He's still learning. He knows where he can get better, and that's really impressive.”\n\n\r\n              As has been the case several times this season, Memphis couldn't hold a fourth-quarter lead with its makeshift lineup.\n\n\r\n              “There wasn't a difference tonight than any other fourth quarter we've let get away from us,” said point guard Jacob Gilyard, another two-way player who finished with eight points and four assists. “We've just struggled down the stretch, probably because we've had so many injuries, and we're trying to rely on Jaren (Jackson) pretty much 95% of the time.”\n\n\r\n              Neither team led by double digits and Memphis had an 81-80 edge entering the fourth. The Grizzlies extended their lead to six points, but the Bulls took control with a 19-6 burst for a 104-97 lead.\n\n\r\n              The Grizzlies have used 31 starting lineups with 18 players having started at least once this season. Earlier Thursday, Memphis traded forward David Roddy to the Suns.\n\n\r\n              Jaren Jackson returned for the Grizzlies after missing the previous two games with right hip soreness. He had 13 points in the first quarter and 18 at halftime.\n\n\r\n              Memphis held a 56-52 lead at the break despite the Bulls shooting 55% for the half, with Drummond making all five of his shots. Chicago hurt its cause with 10 first-half turnovers, but only committed five in the second half.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At Orlando on Saturday as their four-game trip continues.\n\n\r\n              Grizzlies: At Charlotte on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995883.801792
}