{
  "game_id": "0021900219",
  "espn_id": "401160861",
  "date": "Nov 22, 2019",
  "matchup": "MIA @ CHI",
  "headline": "Butler scores 27 points against former team, Heat beat Bulls",
  "body": "CHICAGO --  Jimmy Butler is turning into a perfectionist.\n\nButler had 27 points against his former team and the Miami Heat beat the Chicago Bulls 116-108 on Friday night for their fifth straight victory.\n\nButler played for the Bulls from 2011-17. He was 7 of 10 from the field and had seven assists and five rebounds\n\nBam Adebayo added 16 points and 14 rebounds, and Kendrick Nunn scored 13 of his 21 points in the first quarter to help Miami improve to 11-3. The Heat led wire-to-wire and had as much as a 26-point lead.\n\nDespite a 11-3 record and a five-game winning streak, Butler wasn't happy to see the lead dwindle to single digits in the fourth quarter.\n\n\"A win is a win. I'm not going to downplay that none, but I think the way we have been winning is not the way we would like to win. We played great basketball in the first half. I think we are all proud of that, but then we just have these mental lapses night after night. It just can't happen if we want to be as good as we say we want to be,\" said Butler.\n\nZach Lavine led the Bulls who finished with 15 points. Chicago is 3-6 at home this season. Bulls coach Jim Boylen pulled LaVine and the other starters midway through the first quarter.\n\n\"I just pulled him. Not combative. Guys know. Zach LaVine and Lauri Markkanen and our starters got to play better for us to become what we can become. That's how it works,\" Boylen said. \"I want him to be a two-way player. That's what I want him to be.\"\n\nLaVine thought he was used as the scapegoat for the Bulls' struggles.\n\n\"I guess I was to blame for it,\" LaVine said. \"I've gotten pulled early before by him. I guess that's just his thing to do. Just got to take it in stride. I'm not the coach.\"\n\nNunn, making his Chicago homecoming, scored 13 points in the first quarter on 5-for-7 shooting. Nunn blew by Markkanen several times and was 3-of-5 from 3-point range in the quarter.\n\nHeat coach Erik Spoelstra was concern how Nunn would handle his return to Chicago after watching Dwyane Wade struggle in his first few games in Chicago.\n\n\"When he has 40 points or if he has zero points, what his facial expression and body language looks like, it would look the same, so I don't know why I even though it potentially could be an issue with him,\" Spoelstra said. \"He's a very serious guy about this game and approach. He understands this is a tremendous opportunity for him and our team. He's gone through a lot and overcome a lot to get to this point and he's trying to take advantage of everything as well as he should.\".\n\nNO PHILLY LOVE?\n\nButler returns to Philadelphia on Saturday after playing 55 games for the 76ers last season. Butler was traded last to the 76ers from Minnesota. Butler he isn't sure how the Philly crowd will react, nor does he care.\n\n\"To tell you the truth, I don't care. I was there and gave my all for them,\" Butler said. \"But I'm here so however they want to welcome me back. We're (there) to do a job anyway, trying to get a W.\"\n\nTIP-IN\n\nThe Bulls played without Chandler Hutchison and Otto Porter. Hutchison is out with shin splits and Porter is out with a left foot sprain. The Heat played without Justise Winslow, who was out with a concussion. ... The Heat outscored the Bulls 34-16 in the first quarter. That was the worst offensive quarter of the season for Chicago. Chicago also had its worst defensive first half, giving up 67 points.\n\nUP NEXT\n\nHeat: At Philadelphia on Saturday.\n\nBulls: At Charlotte on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995549.660161
}