{
  "game_id": "0022300928",
  "espn_id": "401585556",
  "date": "Mar 10, 2024",
  "matchup": "ORL vs. IND",
  "headline": "Pacers beat Orlando 111-97 to close within a game of the Magic in the Eastern Conference",
  "body": "ORLANDO, Fla. -- — Once the Indiana Pacers started running, they were hard to stop.\n\n\r\n              Tyrese Haliburton and Pascal Siakam each scored 20 points and the Pacers beat Orlando 111-97 on Sunday night to close within a game of the Magic in the Eastern Conference standings.\n\n\r\n              Paolo Banchero had 19 points for Orlando, Cole Anthony added 16 and Wendell Carter had 13 points and 15 rebounds.\n\n\r\n              Indiana fell behind by 15 points early, but the game changed abruptly when T.J. McConnell and Obi Toppin came off the bench. They scored 17 points each for the Pacers. McConnell also contributed six assists.\n\n\r\n              “T.J. McConnell gave us a great left when he came into the game because we were struggling to score,” Pacers coach Rick Carlisle said. “He got to the rim a few times and really boosted our energy from there.”\n\n\r\n              The highest-scoring team in the NBA, Indiana had only 18 points in the first quarter. Haliburton’s basket with 6:49 left in the second quarter marked his first points of the game and the Pacers’ only 3-pointer of the first half. After making only seven of their first 23 shots, the Pacers finished the game at 49.4%.\n\n\r\n              “We understand that we’re one of the best teams in transition, and the only way we can get transition buckets is getting stops,” Toppin said. “I felt we locked into getting those stops which allowed us to get a lot more transition points.”\n\n\r\n              The Pacers moved ahead for keeps on a 3-pointer by Aaron Nesmith early in the second half. They led by 15 by the end of the third quarter, and Toppin’s layup early in the fourth gave Indiana its biggest lead of the game, 99-83.\n\n\r\n              “We just didn’t do a great job of having that sense of urgency, to sprint back,” Anthony said. “I know Toppin had five or six layups where he just outran everyone down the court. That can’t happen. That’s their style. They’re comfortable in it. We let them play their game.”\n\n\r\n              The Magic have dropped two in a row for the first time since Jan. 22-26. They shot 37.5% after scoring 128 and 117 points in victories at Indiana in November and December.\n\n\r\n              “We’re a very good running team, and that’s well documented,” Carlisle said. “What we needed tonight was a much higher level of determination than we had in the first two games against these guys.”\n\n\r\n              The Pacers played for the first time since learning that Bennedict Mathurin will miss the rest of the season after having shoulder surgery.\n\n\r\n              The Magic played without Jalen Suggs (thigh contusion) and Markelle Fultz (left knee strain). Caleb Houstan started in place of Suggs and did not score in 22 minutes.\n\n\r\n              The Magic had won 13 of 17 and were beginning a stretch of games in which they will have played 10 of 11 at home. They scored a then-NBA season-low 74 points in a loss at New York on Friday night.\n\n\r\n              “That’s part of this league. Once you get comfortable you can get knocked right off your feet, and I think that’s what’s happened to us these last two games,” Anthony said.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Oklahoma City on Tuesday night.\n\n\r\n              Magic: Host Brooklyn on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996167.1547542
}