{
  "game_id": "0021900309",
  "espn_id": "401160951",
  "date": "Dec 04, 2019",
  "matchup": "BKN @ ATL",
  "headline": "Temple, Dinwiddie pace Nets to easy win over Hawks",
  "body": "ATLANTA --  On a team that's undergone a full roster rebuild and endured significant injuries, Garrett Temple knew the Brooklyn Nets would need extra time to mesh.\n\n\"We had so many new guys,\" Temple said. \"On this team, our defensive principles are a little different than around the NBA. We have a very unique game plan a lot of the times. We are doing a great job out there, and guys are buying in.\"\n\nTemple scored a season-high 27 points, Spencer Dinwiddie had 18 of his 24 in the second half and the Nets beat the Atlanta Hawks 130-118 on Wednesday night.\n\nTaurean Prince finished with 23 points against his former team and Jarrett Allen had 20 points and 13 rebounds for the Nets, who were coming off a three-point home loss Sunday to Miami but have won six of eight despite not having injured stars Kevin Durant, Kyrie Irving and Caris LeVert.\n\nTrae Young had 39 points and 10 assists and rookie Cam Reddish scored a career-high 25 points for Atlanta. The Hawks have lost 11 of 12.\n\nReddish drove for a fast-break layup to cut the lead to eight with 8:49 remaining. But after a Nets timeout, Dinwiddie drove the left side for a basket that pushed the lead to 102-92, and Brooklyn wasn't threatened again.\n\nHawks coach Lloyd Pierce blamed his team's weak defense for the loss.\n\n\"We have to be into the ball a little bit more with pressure,\" Pierce said. \"We have to pressure their passers. It's whoever is on the court has to do a little bit better with regards to their responsibility.\"\n\nJoe Harris' no-look pass from the top of the key to Allen for a dunk completed a 13-5 run that gave Brooklyn a 117-101 lead with 4:38 left in the game.\n\nThe Nets took their first double-digit lead early in the third on Temple's 3. Dinwiddie went into attack mode, prioritizing drives to the lane that resulted in three baskets and two free throws that made it an 11-point lead. Harris scored inside to make it 80-67, and DeAndre Jordan pushed the lead back to 13 with a follow shot that caused a Hawks timeout.\n\nDinwiddie quickly added another inside basket for his 12th point of the third to make it 86-75.\n\nBrooklyn matched his its previous high in offensive rebounds -- 18 against Indiana on Oct. 30 -- late in the third.\n\nThe Nets led 56-47 at halftime. They outrebounded Atlanta by 12 and outscored the Hawks 17-7 in second-chance points before intermission.\n\n\"Dominating on the glass -- that's been a sticking point for us,\" Brooklyn coach Kenny Atkinson said. \"We've talked a lot about rebounding the last couple of days, how much that's hurt us. Collectively, I thought we got on the boards. Even in the first half when we were missing shots, I thought we cleaned up a lot of misses and it was a difference in the game.\"\n\nTIP-INS\n\nNets: Irving missed his 10th straight game with a right shoulder impingement and did not make the two-game road trip to stay home and rehab. ... Brooklyn has won five straight in the series and four in a row in Atlanta. ... The Nets had 10 of their 26 assists in the fourth.\n\nHawks: F Kevin Huerter, returning after missing 11 games with a left rotator cuff strain, was on a 15-minute limit and was scoreless. ... F De'Andre Hunter, sidelined by a dislocated right index finger, missed his first game. DeAndre' Bembry started in his spot and had two points. ... G Allen Crabbe was out with right knee soreness.\n\nLAST MAN STANDING\n\nWith the firing of New Jersey Devils coach John Hynes, Atkinson has the longest tenure of any coach or manager of a major pro sports team in the New York metropolitan area. This is the former Hawks assistant's fourth season.\n\n\"Coaching's a tough business,\" Atkinson said. \"I really don't know what to say. I don't know if it makes me proud or sad for the other guys but it's a tough business to survive in. Especially in New York.\"\n\nHE'S BACK\n\nPrince received some warm applause after the Hawks showed a video tribute early in the first quarter to recognize his three seasons in Atlanta. The Nets acquired Prince in a June trade for Crabbe and a second-round pick. Prince starts at forward and is Brooklyn's fifth-leading scorer with a 13.0 average.\n\nPrince had no trouble getting movitated.\n\n\"One hundred percent,\" he said. \"Especially being the team that traded me away.\"\n\nUP NEXT\n\nNets: At Charlotte on Friday and host Denver on Sunday.\n\nHawks: After three days off, at Charlotte on Sunday and at Miami on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996725.396538
}