{
  "game_id": "0021900914",
  "espn_id": "401161556",
  "date": "Mar 03, 2020",
  "matchup": "TOR @ PHX",
  "headline": "Raptors rally, snap three-game skid by beating Suns 123-114",
  "body": "PHOENIX --  Pascal Siakam scored 33 points, Kyle Lowry added 28 and the Toronto Raptors rallied in the second half for a 123-114 victory over the Phoenix Suns on Tuesday night.\n\nToronto snapped a three-game losing streak, which was tied for its longest of the season. Norman Powell added 26 points while Chris Boucher gave the Raptors crucial production off the bench, finishing with 19 points and 15 rebounds.\n\nToronto trailed by seven at halftime but pushed to an 87-86 lead going into the fourth quarter after Siakam scored 12 in the third. Siakam finished 12 of 20 from the field and had seven rebounds.\n\nThe Suns have lost four straight games. They pulled within 114-113 with 2:22 remaining but Boucher responded with a 3-pointer and the Raptors pulled away. Devin Booker led Phoenix with 22 points while rookie Cameron Johnson had a career-high 21.\n\nThe Raptors trailed by 17 points at one point during the second quarter, but rallied to pull within 68-61 at halftime. Siakam scored 16 for the Raptors before the break. Dario Saric had 13 for the Suns in the first half and finished with 16.\n\nLOWRY LEAVES\n\nLowry took a shot to his left eye and missed an eight-minute chunk of the first half before returning.\n\nThe Raptors point guard was having a good first quarter before the injury, scoring 12 points. He was among three Raptors trying to stop Suns forward Dario Saric from making a layup when teammate Terence Davis' hand inadvertently smacked Lowry in the eye.\n\nLowry went back to the locker room with a towel over the injury before returning.\n\nOUBRE OUT\n\nThe Suns announced before the game that Kelly Oubre Jr. had surgery Tuesday to repair a torn meniscus in his right knee and will miss at least four weeks.\n\nThe 6-foot-7 Oubre is averaging 18.7 points, which ranks third on the team. Phoenix has lost all four games since Oubre's injury and is quickly falling out of the Western Conference playoff race.\n\n\"I think it did emotionally probably brought us down a couple notches,\" coach Monty Williams said before the game. \"It probably sounds a bit weak to admit it, but it's just a reality. You finally get your team close to whole and then you lose Kelly. The guys have probably struggled with it more than they want to admit.\"\n\nTIP-INS\n\nRaptors: F/C Serge Ibaka, G Fred VanVleet and C Marc Gasol all were out with injuries. Ibaka has a sore right knee, VanVleet has a sore left shoulder and Gasol has a tight left hamstring. Combined, they're averaging about 41 points per game.\n\nSuns: Ayton left the game late in the fourth quarter with what appeared to be an ankle injury. The second-year player finished with 13 points and 14 rebounds.\n\nUP NEXT\n\nRaptors: Continue their road trip against Golden State on Thursday night.\n\nSuns: Host Portland on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995581.6902258
}