{
  "game_id": "0022400948",
  "espn_id": "401705514",
  "date": "Mar 12, 2025",
  "matchup": "LAC @ MIA",
  "headline": "Bogdanovic scores 30, Zubac adds 26 and Clippers roll past Heat 119-104",
  "body": "MIAMI -- — Bogdan Bogdanovic scored a season-high 30 points and Ivica Zubac added 26 points and 14 rebounds, helping the Los Angeles Clippers beat the Miami Heat 119-104 on Wednesday night.\n\n\r\n              James Harden had 24 points, 11 assists and eight rebounds for the Clippers, who won for the fourth time in five games and pulled within 1 1/2 games of idle Golden State for the No. 6 — and last guaranteed — playoff spot in the Western Conference.\n\n\r\n              Tyler Herro scored 31 points and Andrew Wiggins added 22 for the Heat, who fell 2 1/2 games behind Atlanta in the race for the No. 7 spot and most advantageous play-in position in the Eastern Conference.\n\n\r\n              The Clippers were again without coach Tyronn Lue, who has missed three straight games while dealing with back pain. Assistant coach Brian Shaw again served as acting coach.\n\n\r\n              Takeaways\r\n              Clippers: Kawhi Leonard didn't play on the second night of a back-to-back, so he couldn't add to his success against the Heat. When Leonard plays — for San Antonio, Toronto or the Clippers — his teams have won 15 consecutive regular-season games against Miami. The last time he played in a loss against the Heat, excluding the NBA Finals, was 2013.\n\n\r\n              Heat: Miami — now 9-19 in its last 28 games — has dropped a season-high five consecutive contests. This is only the fourth losing streak of at least five games for Miami in the last seven years.\n\n\r\n              Key moment\r\n              A 13-4 run over a three-minute span of the fourth quarter pushed the Clippers' lead from eight to 17.\n\n\r\n              Key stat\r\n              Zubac has 10 consecutive double-doubles. He’s the sixth player to do that this season, joining Domantas Sabonis, Giannis Antetokounmpo, Karl-Anthony Towns, Nikola Jokic and Victor Wembanyama.\n\n\r\n              Up next\r\n              Both teams play Friday. The Clippers visit Atlanta and Miami hosts Boston.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997936.903209
}