{
  "game_id": "0021500180",
  "espn_id": "400828067",
  "date": "Nov 20, 2015",
  "matchup": "MEM vs. HOU",
  "headline": "Conley, Gasol lead Grizzlies over Rockets 96-84",
  "body": "MEMPHIS, Tenn. --  Better 3-point shooting has created better spacing and a smoother offense for the Memphis Grizzlies, resulting in a four-game win streak.\n\nMike Conley scored 26 points, Marc Gasol had 16 points, 11 rebounds and 11 assists, and the Grizzlies rode their newfound offensive fluidity to a 96-84 victory over the Houston Rockets on Friday night.\n\n\"The spacing was fantastic,\" Conley said. \"We were able to move the ball, get a lot of easy opportunities. When we're getting a lot of easy opportunities, either in transition or in the flow early in our shot clock, we're a much different team.\"\n\nMatt Barnes finished with 12 points and Mario Chalmers added 10 as Memphis continued to reverse its slow start to the season.\n\n\"There was a lot of movement,\" Gasol said of the offense. \"A lot of good cutting. The tempo was high. People were moving without the ball, passing when guys were open.\"\n\nJames Harden led the Rockets with 22 points, but missed six of his seven shots from beyond the arc. The Rockets have lost five of their last six, going 1-1 since Kevin McHale was fired and J.B. Bickerstaff took over as interim coach.\n\nTrevor Ariza scored 19 points, while Dwight Howard had 12 points and 15 rebounds for Houston, which missed its first 12 shots of the fourth quarter.\n\nNeither team shot particularly well. And Houston was further hampered by a season-high 23 turnovers.\n\n\"I think we were just struggling to find our shots,\" Bickerstaff said. \"We missed 15 shots in the paint, missed 15 free throws and turned the ball over 23 times.\"\n\nThe Rockets steadily pecked away after the Grizzlies built a 20-point lead in the third, and a 3-pointer by Marcus Thornton followed by a 22-footer from Ty Lawson as the quarter ended cut the Memphis lead to 79-70.\n\nBut the Grizzlies took the lead back to 14 as the Rockers steadily missed shots. When Terrence Jones finally made the Rockets' first field goal of the quarter, on a dunk with 3:52 left, the Grizzlies' lead had reached 16.\n\nThe Rockets had only two buckets in the fourth, and were limited to 14 points.\n\n\"We have got to find a way to get baskets, especially with a team like that,\" said guard Jason Terry, who missed four of his five shots, scoring two points.\n\nTIP-INS:\n\nRockets: Terry started his second consecutive game at point guard. ... The 14 points in the fourth were not a season-low for a quarter. Houston scored 12 in the third against Miami on Nov. 1. ... Despite the loss, the game marked the first time this season Houston held an opponent under 100.\n\nGrizzlies: Memphis F Zach Randolph was a late scratch with right knee soreness. JaMychal Green started his first game of the season in Randolph's spot. ... Veteran Vince Carter saw action for only his second game of the season and immediately hit consecutive 3-pointers, his only six points of the night.\n\nNO DWIGHT ON SATURDAY?\n\nBickerstaff indicated Howard probably would not play in Saturday's second game of a back-to-back against the Knicks. \"That's the plan for now,\" he said, noting that has been the routine on weekend consecutive games.\n\nUNDEFEATED WITH CHALMERS\n\nThe Grizzlies' winning streak has coincided with Chalmers coming over in a trade from the Miami Heat. Chalmers has reached double figures in all four of his games with Memphis.\n\nGASOL'S MARK\n\nGasol finally grabbed his 10th rebound with 2 minutes left. His triple-double was the first for Memphis since 2007, when his brother Pau recorded 17 points, 13 rebounds and 12 assists.\n\nUP NEXT\n\nRockets: Host New York Knicks on Saturday.\n\nGrizzlies: Travel to San Antonio on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994475.0305998
}