{
  "game_id": "0021900812",
  "espn_id": "401161454",
  "date": "Feb 12, 2020",
  "matchup": "MEM vs. POR",
  "headline": "Clarke lead Grizzlies to a 111-104 win over Trail Blazers",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies cushioned their lead for the final playoff spot in the West on a night when Portland’s Damian Lillard injured his groin.\n\nBrandon Clarke matched his career high with 27 points, Ja Morant had 20 points and nine assists as the Grizzlies went into the All-Star break with a 111-104 victory over the Trail Blazers on Wednesday night.\n\nClarke scored consistently at the rim on lobs off the pick-and-roll. He connected on 12 of 14 shots, part of Memphis outscoring Portland 76-34 in the paint – a category in which the Grizzlies lead the league.\n\n“The guards just did a really good job at finding me. They made my job really easy,” said Clarke, who entered the game shooting 61.4%, tops among rookies and fourth in the league overall. “All I really had to do was run to the rim hard and jump up and catch a lob dunk. So, I’m really thankful for those guards.”\n\nDe’Anthony Melton and Jonas Valanciunas scored 12 points each, with Valanciunas also grabbing 18 rebounds.\n\nCJ McCollum led the Trail Blazers with 23 points, and Lillard added 20 on a tough shooting night as he went 7 of 19 from the field before leaving with 3:22 left. Lillard took a foul against Jaren Jackson Jr. and immediately walked off the floor and headed to Portland's locker room.\n\nLillard said after the game he suffered a right groin strain and added the injury will prevent him from taking the court in the All-Star Game.\n\n“I don’t think I’m playing in the game. I know I’m not playing,” Lillard said, later adding: “It made no sense to be out there for the last few minutes (against Memphis) and risk trying to play through it and make things worse.\n\n“It almost happened with perfect timing (coming at the All-Star break), so we will see.”\n\nThe Trail Blazers lost their second straight and enter the break four games behind the Grizzlies for the final spot in the Western Conference playoff race.\n\n“It’s cliché, but we’ve got to worry about one game at a time,” Portland coach Terry Stotts said of overcoming the deficit for the postseason.\n\nMemphis built the lead in the second half to double-digits, eventually stretching it to 14. Portland, playing the second night of a back-to-back after a loss at New Orleans on Tuesday, could never overtake Memphis.\n\n“A disappointing two-game trip,” Stotts said. “I don’t know if fatigue came into it with six games in seven nights. It was a tough stretch.”\n\nFor the Grizzlies, the win meant being two games over .500 and having a bi of a buffer for the stretch run.\n\n“It means a lot, especially going into the break,” Morant said of the victory. “Playing against a team we’re fighting for the eighth spot, it’s a big win for us, especially on our home court.”\n\nBut Lillard said Portland will use the break to recover and prepare for the final 25 games.\n\n“It’s far from over,” the Trail Blazers guard said. “Believe that. ... Don’t think that was just it.”\n\nTIP-INS\n\nTrail Blazers: Mario Hezonja and Nassir Little were out (left ankle sprains). That was in addition to Zach Collins (left shoulder dislocation), Rodney Hood (left Achilles tendon rupture) and Jusuf Nurkic (left leg fracture). ... Lillard has scored at least 20 points in 21 straight games. ... Stotts challenged a goaltending call against Hassan Whiteside with 5:24 left and the call was overturned, cutting Memphis' lead to 100-90. ... Whiteside got his second technical foul in the closing seconds and was ejected.\n\nGrizzlies: Gorgui Dieng entered late in the first quarter, his first appearance with the Grizzlies since being acquired in a trade deadline deal. He became the second Senegalese native to play for the franchise, joining Makhtar N’Diaye (1998-99). ... Valanciunas recorded his 26th double-double of the season. It was his second straight game with 18 rebounds. ... The 76 paint points matched a season high recorded against Denver on Jan. 28.\n\nPLAYOFF PICTURE\n\nWith the victory, the Grizzlies have extended their margin over Portland for the eighth spot in the West. The game was an important win for Memphis. The teams only play three times this season, and the next two are in Portland: March 12 and April 5. So, the Grizzlies’ win gave them a game up in the tiebreaker.\n\nUP NEXT\n\nTrail Blazers: host the New Orleans Pelicans on Feb. 21.\n\nGrizzlies: travel to Sacramento on Feb. 20 against the Kings.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995697.213257
}