{
  "game_id": "0021900408",
  "espn_id": "401161050",
  "date": "Dec 18, 2019",
  "matchup": "TOR @ DET",
  "headline": "Lowry has triple double in Raptors' victory over Pistons",
  "body": "DETROIT --  The Toronto Raptors beat Detroit but lost two more players in the process.\n\n\"A win with a heavy price,\" coach Nick Nurse said.\n\nKyle Lowry had 20 points, 10 rebounds and 10 assists for a triple-double and the Raptors had an 11-0 run in the third quarter on their way to a 112-99 victory over the Pistons on Wednesday night. By the time the game ended, however, Toronto was short a few key players after Marc Gasol and Norman Powell left with injuries.\n\nThe Raptors were without guard Fred VanVleet because of right knee injury. Then Gasol left in the first quarter with a left hamstring strain. With 3:17 left in the fourth, Powell departed holding onto his left shoulder.\n\n\"Don't know much,\" Nurse said. \"We've got to check them both tomorrow.\"\n\nToronto still had enough firepower to handle the Pistons. Detroit allowed 133 points in a loss to Washington on Monday night. The Pistons got frontcourt standouts Blake Griffin and Andre Drummond back from injuries for this game, but they still allowed 70 points in the first half and 40 in the second quarter.\n\n\"You never want to give up that many points, but I liked our start, I liked our effort and I like the competitive edge,\" Pistons coach Dwane Casey said. \"If we can keep that up, we can build on that, but that's still one of the best teams in our league.\"\n\nLowry fed Serge Ibaka for a dunk with 37.4 seconds left for the assist he needed for a triple-double. That was a nice accomplishment, but now the defending champions will have to find out the extent of their latest injuries.\n\n\"We avoided the injury bug last year, and that really helped us throughout the whole year,\" Lowry said. \"It's pretty tough for our team, but we've got a bunch of guys that have to step up now, and hopefully it's nothing serious with those two guys.\"\n\nLowry already missed time this season with a thumb injury, and Ibaka was sidelined with a sprained ankle.\n\nToronto led 81-76 before its 11-point run in the third. Pascal Siakam and Ibaka had back-to-back dunks that made it 90-76, and a layup by Rondae Hollis-Jefferson pushed the lead to 16.\n\nDrummond had 22 points and 18 rebounds for Detroit.\n\nTESTY\n\nAs is often the case so close to the Canadian border, there was a divided crowd of Pistons fans and Raptors supporters. The action on the court was contentious at times as well.\n\nThere were four technical fouls handed out: Lowry, Siakam and Drummond received theirs in the second quarter, and Griffin got one in the third.\n\nDRY SPELL\n\nDetroit came into the game shooting 38.5% from beyond the arc, but the Pistons went just 6 of 35 on Wednesday.\n\n\"They did a good job of contesting our shots, but so do other teams,\" said Luke Kennard, who was the only Detroit player to make more than one 3-pointer. \"We usually knock some of those down, but we've had other nights like this.\"\n\nTIP-INS\n\nRaptors: Siakam scored 26 points and Ibaka added 25. Siakam was 6 of 11 from 3-point range.\n\nPistons: F/C Christian Wood left the game with a left knee strain. He scored six points. ... Detroit was not called for a foul in the first quarter until Svi Mykhailiuk committed one with 4.5 seconds left.\n\nUP NEXT\n\nRaptors: Host Washington on Friday night.\n\nPistons: At Boston on Friday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995630.147189
}