{
  "game_id": "0021500610",
  "espn_id": "400828497",
  "date": "Jan 17, 2016",
  "matchup": "PHX @ MIN",
  "headline": "Timberwolves snap 9-game losing streak with win over Suns",
  "body": "MINNEAPOLIS --  A nine-game losing streak mercifully ended, Minnesota Timberwolves interim coach Sam Mitchell carried 6-foot-8, 270-pound assistant coach Vince LeGarza into the locker room on his back and dumped him off to illustrate to his players the weight that had just lifted from his shoulders.\n\nDown the hall at Target Center, the burden only grows larger on Phoenix Suns coach Jeff Hornacek.\n\nRicky Rubio and Andrew Wiggins scored 18 points each and the Timberwolves blew out the Suns 117-87 on Sunday.\n\n\"It's tough when you lose nine games in a row,\" Mitchell said. \"One thing I give the group credit for, they don't hang their head. They don't point fingers. They come to work every day and work on their game and try to become a better basketball team. But you need some wins along the way to verify the hard work you're putting in.\"\n\nKarl-Anthony Towns had 14 points, eight rebounds and three blocks for the Timberwolves, who improved to 6-17 at home. They shot 56.5 percent and got 11 points and eight rebounds from Shabazz Muhammad to win for the first time since they beat Utah on Dec. 30.\n\nBrandon Knight scored 20 points on 9-for-20 shooting, and Markieff Morris had 17 points and five rebounds for free-falling Phoenix. The Suns have lost 13 of 14 games to drop to 13-29.\n\n\"These guys can call themselves basketball players until you go out there and you try to stop somebody and get in front of somebody and take a charge or do something,\" an exasperated Hornacek said. \"We got one, two guys maybe on this team that do that. It is what it is.\"\n\nThe good news for both of these struggling franchises coming into the game was that someone had to win. The Timberwolves had lost 13 of their previous 14 games, bringing heavy criticism on Mitchell.\n\nHornacek has felt plenty of heat himself, with the franchise shaking up his coaching staff by firing his top two assistants on Dec. 28. Morris drew all the wrong kind of attention after being benched for throwing a towel at Hornacek during a game and the team lost guard Eric Bledsoe to a knee injury to zap much of the offense's explosiveness.\n\n\"With us being under-manned and not having everybody available for us guys have to play harder than what they usually would,\" Knight said. \"I don't think it's really there right now and we just have to be professionals and do a better job of that.\"\n\nThe Suns' chemistry issues have certainly contributed to one of the NBA's worst defenses, which entered the game ranked 29th in points allowed. In this last ugly stretch, the Suns have had losses of 33, 21, 23, 20 and 19 points before the 30-point drubbing by the lowly Wolves.\n\n\"When you give up 40 free throws, that means you're not guarding anybody,\" Hornacek said. \"To me, if I'm out there playing I'm going to at least guard my guy.\"\n\nGorgui Dieng added 15 points and six rebounds and the Wolves were able to rest their starters for the entire fourth quarter in their largest margin of victory since a 143-107 win over the Lakers in 2014.\n\n\"They were struggling, we were struggling,\" Wiggins said. \"They probably came in here thinking they were going to beat us. So I wanted to win. We lost a lot straight. I just wanted a win, man.\"\n\nRUBIO'S SHOOTING\n\nRubio has struggled with his shooting in his first four years in the league, but is shooting 45 percent from 3-point range over his last 11 games. He hit 6 of 11 shots against the Suns.\n\n\"We got to do it now with teams that are playing well,\" Rubio said. \"This is a no-mercy league and you have to go out there and win when you have a chance.\"\n\nTIP-INS\n\nSuns: Hornacek said C Alex Len, who has missed the last three games with a sprained left hand, should be ready to return when the Suns get back home on Tuesday. ... The Suns fell to 0-18 when failing to score 100 points.\n\nTimberwolves: After missing the last game with an illness, SG Kevin Martin had 11 points in 16 minutes. ... Towns received his NBA Rookie of the Month award for December. He has been the Western Conference winner for the first two months of the season.\n\nUP NEXT\n\nSuns: Host Indiana on Tuesday night.\n\nTimberwolves: Visit New Orleans on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994849.8006191
}