{
  "game_id": "0021800503",
  "espn_id": "401071179",
  "date": "Dec 26, 2018",
  "matchup": "PHX @ ORL",
  "headline": "Booker, Warren lead Suns past Magic 122-120 in overtime",
  "body": "ORLANDO, Fla. --  Winning is something new for the Phoenix Suns. Devin Booker has been the reason.\n\nBooker, a third-year guard, had 35 points, eight assists and seven rebounds as Phoenix defeated the Orlando Magic 122-120 in overtime Wednesday night.\n\nBooker was the spark as Phoenix won for the fifth time in seven games.\n\nT.J. Warren added 24 points, including all four Phoenix points in overtime. Kelly Oubre Jr. scored had 19 points and Josh Jackson added 10 for Phoenix.\n\n\"Some teams just click sometimes,\" Booker said of the Suns' recent success. \"I remember last year Miami did that and ran off 15 straight or something like that. You never know when a team can click, an adjustment starts working or a new player is added like Kelly (Oubre) and it just clicks.\"\n\nBooker shined in the final minute of regulation when he scored nine straight points, including a 3-pointer to tie game, two driving layups to put Phoenix in front and two free throws with 4.6 seconds left that gave the Suns a 118-115 lead with 4.6 seconds left in regulation.\n\n\"That's Devin's job description, that's what he does for us,\" Suns coach Igor Kokoskov said. \"He is the present and future of our organization. Whatever he decides to do with this program, that's what is going to happen.\"\n\nThe Suns, who have the worst record in the NBA despite their recent success, showed things will never be easy this season. They couldn't protect the three-point lead in the final seconds of regulation because forward Mikal Bridges fouled Magic point guard D.J. Augustin on a corner 3-point attempt with six-tenths of a second left on the clock.\n\nAugustin calmly drained all three free throws to send the game to overtime.\n\n\"We need a defense that gets stops to win a game because we're playing great teams,\" Kokoskov said. \"Our defense has got to be better and so does our understanding of defense.\"\n\nAugustin led the Magic with a season-high 27 points and six assists.  Nikola Vucevic had 22 points and 13 rebounds and Terrence Ross scored 18 points off the bench.  Evan Fournier finished with 16 points, but missed a contested 3-pointer as time expired in overtime.\n\nIt was the fourth straight loss for the Magic, who had several opportunities to seize control the game, but could never sustain good play beyond a 5-6 minute stretch.  They led by 12 early in the game, couldn't hold a nine-point lead late in the third quarter and couldn't finish in the fourth quarter, despite staying a basket in front of Phoenix until the final minute of regulation.\n\nIn the overtime, Vucevic scored with 4:26 to play, but that was Orlando's only points in the extra period. The Magic were 1 for 10 from the field, including 0 for 5 on 3-pointers. They didn't shoot a free throw in overtime.\n\n\"We've proven to me that we're good enough to beat anybody on a given night, but we have to understand that we don't have a group that is going to show up and beat anybody just by outscoring or out-talenting them,\" Magic coach Steve Clifford said. \"Tonight, the offense was much better, but the defense wasn't good enough.\"\n\nRegulation was marked by a series of long runs by each team that didn't end until the middle of the fourth quarter, when Booker hit a baseline jumper that tied the game at 100-all.\n\nTIP-INS\n\nSuns: Deandre Ayton is the first rookie since Blake Griffin (2010) to have three straight games with 20-plus points and 15-plus rebounds. He had 10 rebounds and eight points against Orlando. . Devin Booker is averaging 30.6 points and 8.0 assists in his last six games.\n\nMagic: The 27 points was a season-high for D.J. Augustin.\n\nUP NEXT:\n\nSuns: Start a season-high, seven-game homestand against Oklahoma City on Friday.\n\nMagic: Host Eastern Conference leader Toronto on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995081.998754
}