{
  "game_id": "0022200416",
  "espn_id": "401468571",
  "date": "Dec 14, 2022",
  "matchup": "ORL vs. ATL",
  "headline": "Magic beat Hawks 135-124 for 4th straight victory",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 24 points, Orlando had a franchise-record 50 points in the first quarter and the Magic beat the Atlanta Hawks 135-124 on Wednesday night for their fourth straight victory.\n\n\r\n              Cole Anthony finished the first period with two free throws to make it 50-22, the most points the Magic have ever scored in any quarter. Orlando has its first four-game winning streak since the first four games of the 2020-21 season.\n\n\r\n              Bol Bol added 21 points, Paolo Banchero had 20 points and six rebounds, and Markelle Fultz finished with 16 points, seven rebounds nine assists and a lot of fun.\n\n\r\n              “I kind of thought it was halftime almost,” Fultz said about the big first quarter. \"No disrespect, but it was so crazy how well we were doing it. But it was so much fun. This game is so competitive that sometimes you lose sight of how much fun it is.\n\n\r\n              “Today we had a lot of fun, and a win like this is going to bring out a lot of team chemistry for sure.”\n\n\r\n              Orlando led by 29 at one point and by 28 at the end of the quarter.\n\n\r\n              “The thing I was most happy about is that they scored 22 points in that quarter,” Magic coach Jamahl Mosley said. “It was the defense that got it done in that quarter, and then from there obviously we let them score a little too much.”\n\n\r\n              DeAndre Hunter scored 20 of his 25 points in the second quarter for Atlanta. Trae Young added 19 points and 16 assists.\n\n\r\n              Hunter scored 20 of Atlanta's final 28 points in the first half to help cut the deficit from 29 to 14. \n\n\r\n              The Hawks got the lead down to eight, but Ross finished the third quarter with a 3-pointer and Mo Bamba opened the fourth quarter with another to make it 108-94.\n\n\r\n              The Hawks, who have lost five of six, never thought they were in it after the first quarter.\n\n\r\n              “Giving up 50 points in one quarter is kind of ridiculous,” said Onyeka Okongwu, who came off the bench with 15 points and 11 rebounds. “But that’s the NBA. We’re all here for a reason. Everybody can play, and you’ve got to be ready from the start. We just got ourselves in a big hole and couldn't get out of it.”\n\n\r\n              Said coach Nate McMillan: “Urgency, energy, scrappy play is something that you have to bring every single night. You can't wait until you're busted in the mouth before you respond.”\n\n\r\n              TIP-INS\n\n\r\n              Hawks: C Clint Capela left the game with calf tightness with 5:10 remaining. ... The Hawks shot 8 of 21 with seven turnovers in the first quarter. ... F John Collins missed a seventh straight game since injuring his ankle in the Hawks' last visit to Orlando on Nov. 30. \n\n\r\n              Magic: Eight players scored in double figures, tying a franchise record. ... G R.J. Hampton volunteered to leave the team and play two games with the G League's Lakeland Magic before rejoining the Magic in Boston on Saturday. ... C Wendell Carter Jr. missed a 14th game with right plantar fascia.\n\n\r\n              UP NEXT:\n\n\r\n              Hawks: At Charlotte on Friday night.\n\n\r\n              Magic: At Boston on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994646.077931
}