{
  "game_id": "0022201129",
  "espn_id": "401469284",
  "date": "Mar 27, 2023",
  "matchup": "LAC vs. CHI",
  "headline": "Nicolas Batum hits 8 3-pointers, Clippers beat Bulls 124-112",
  "body": "LOS ANGELES -- - Nicolas Batum got all of his season-high 24 points on eight 3-pointers, and Eric Gordon added 22 points in the Los Angeles Clippers' comfortable 124-112 victory over the Chicago Bulls on Monday night.\nKawhi Leonard scored 22 as the Clippers rebounded from an embarrassing loss to New Orleans with 20 3-pointers in an impressive outside shooting display led by Batum. The Frenchman replaced ailing Marcus Morris in the starting lineup and produced a spectacular game from the perimeter, hitting eight of his first nine 3-point attempts while Los Angeles ran away in the first three quarters.\n\"It was nothing crazy, just really open shots,\" said Batum, who finished one shy of his career high in 3s, set 11 years ago. \"I didn't have to take a dribble on any of those shots. I just had open shots, and my teammates made some good passes. It was just good basketball.\"\nGordon had his biggest scoring performance since returning to the Clippers in a trade last month, and Russell Westbrook added 12 points, 10 assists and five rebounds. The Clippers finished with a season-high 41 assists, topping 40 in a game for the first time since January 2015.\n\"When we're attacking the paint, attacking the rim and playing the right way, we're a really good team,\" coach Tyronn Lue said. \"Tonight was a blueprint of how we should play.\"\nLos Angeles (40-36) kept hold of fifth place in the Western Conference standings and moved a half-game behind fourth-place Phoenix.\nZach LaVine scored 23 points and Nikola Vucevic had 20 points and eight rebounds for the Bulls, who followed up their impressive win over the Lakers on Sunday with a dud.\nDeMar DeRozan had 21 points and seven assists in his hometown, but Chicago lost for only the third time in 10 games and missed a chance to pull even with Toronto and Atlanta for eighth place in the East.\n\"When a team gets into a rhythm, that's what generally happens,\" coach Billy Donovan said. \"Tonight we just didn't do a good enough job all around. ... I felt we gave up too many uncontested 3s, especially early when they started to find their rhythm. And then the ones we did contest, they made, because I think we gave them too many open looks early.\"\nThe Clippers improved to 2-1 without leading scorer Paul George, who is all but certain to miss the rest of the regular season after spraining his right knee in a loss to Oklahoma City last Tuesday.\nBatum immediately clicked with the Clippers' starters, hitting five 3-pointers in the first half. Morris has hit only five 3s in his last seven games combined, and Batum's contributions along with Gordon's 16 first-half points mostly against LaVine's defense boosted Los Angeles to an early 11-point lead.\nThe Clippers rolled to a 22-point lead in the third quarter, and Batum didn't miss his second 3-point attempt until right before the quarter buzzer. Batum didn't take a 2-point shot.\nTIP-INS\nBulls: Alex Caruso sat out to rest his foot injury. ... Vucevic was well rested after getting ejected early in Sunday's win. ... DeRozan got a technical foul in the third quarter. ... Patrick Beverley had nine points in 30 minutes against his former team.\nClippers: Morris sat out with an illness. ... Norman Powell missed his 11th straight game with an injured left shoulder, but is expected to return during LA's upcoming road trip. ... The Clippers have won 40 games for the 12th straight season. They had only eight 40-win seasons in their previous 41 years of existence.\nUP NEXT\nBulls: Host the Lakers on Wednesday.\nClippers: Play at Memphis on Wednesday.\n------\nAP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994949.423682
}