{
  "game_id": "0022400776",
  "espn_id": "401705342",
  "date": "Feb 12, 2025",
  "matchup": "MIN vs. MIL",
  "headline": "Without Antetokounmpo and Lillard, the Bucks beat the Timberwolves 103-101",
  "body": "MINNEAPOLIS -- — Kyle Kuzma had 19 points and 13 rebounds and the Milwaukee Bucks won without All-Stars Giannis Antetokounmpo and Damian Lillard, beating the Minnesota Timberwolves 103-101 on Wednesday night.\n\n\r\n              Anthony Edwards’ jumper in the final seconds was off for Minnesota and Kuzma — playing his fourth game for Milwaukee after being acquired from Washington — came down with the rebound.\n\n\r\n              Gary Trent Jr., who went to high school in a Twin Cities suburb, had 21 points off the bench for the Bucks in their final game before the All-Star break. They had lost six of eight.\n\n\r\n              \r\n                Antetokounmpo missed his sixth straight game because of a strained left calf and Lillard was rested because of a strained right hamstring.\r\n              \n\n\r\n              Edwards scored 28 points for Minnesota, but shot 10 of 33 from the field and 4 of 16 from 3-point territory. At one point, Edwards missed 15 straight shots. Rudy Gobert added 20 points and 14 rebounds, Naz Reid had 22 points and 13 rebounds.\n\n\r\n              Minnesota was without Mike Conley (right index finger strain), Donte DiVincenzo (left great toe sprain) and Julius Randle (right groin strain).\n\n\r\n              Takeaways\r\n              Bucks: Keeping pace in a game without Antetokounmpo and Lillard is a good sign of the team’s depth and Kuzma has provided a scoring punch after his trade from Washington.\n\n\r\n              Timberwolves: Another slow start and tough shooting night for Minnesota led to another disappointing loss.\n\n\r\n              Key moment\r\n              Reid hit a 3 to give the Timberwolves a 101-99 lead with 47.6 seconds left, but Kevin Porter knocked down a mid-range jumper for Milwaukee to tie the game and Brook Lopez drew a foul and knocked down both free throws for the final margin.\n\n\r\n              Key stat\r\n              The Timberwolves, who shot 40% in each of the two previous games, finished a season-worst 37.9% from the field and were 10 of 44 (22.7%) from 3.\n\n\r\n              Up next\r\n              The Bucks host the Los Angeles Clippers on Feb. 20. The Timberwolves host NBA-leading Oklahoma City on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764998282.276223
}