{
  "game_id": "0022001025",
  "espn_id": "401307833",
  "date": "May 09, 2021",
  "matchup": "SAC vs. OKC",
  "headline": "Kings spread the scoring, crush Thunder 126-98",
  "body": "SACRAMENTO, Calif. -- — Maurice Harkless and Terence Davis each scored 18 points to lead eight Sacramento players in double figures, and the Kings beat the Oklahoma City Thunder 126-98 on Sunday night.\n\n\r\n                    Delon Wright had 15 points, seven rebounds and five assists, Richaun Holmes also had 15 points, Buddy Hield scored 14 and Chimezie Metu added 13 points and eight rebounds as Sacramento won for the fifth time in its last six games.\n\n\r\n                    “We did a great job tonight of playing our game and closing them out,” Harkless said. “We took a lead early and never took our foot off the gas. That’s a good sign. That’s something to build on.”\n\n\r\n                    Darius Bazley scored 18 points and Jaylen Hoard 16 for Oklahoma City.\n\n\r\n                    The Kings (30-38) moved within 2½ games of San Antonio (32-35) for the final playoff spot in the Western Conference. \n\n\r\n                    Ending the NBA’s longest playoff drought – 14 years – won’t be easy for coach Luke Walton’s team. After playing the Thunder again on Tuesday, Sacramento travels to Memphis for two games against the Grizzlies then return home to face the Jazz on Sunday.\n\n\r\n                    “We’re just going to focus on ourselves and handle our business,” Harkless said. “Whatever happens around the league happens. In four games, if we’re in a play-in game, we’re in.”\n\n\r\n                    Missing two key starters along with first-round draft pick Tyrese Haliburton, the Kings got off to a quick start and rolled past the flailing Thunder.\n\n\r\n                    Sacramento led by 24 in the first half, outscored Oklahoma City 35-20 in the third, then cruised to its most lopsided win this season.\n\n\r\n                    “Good, disciplined win,” Walton said. “We did a nice job moving the ball, sharing the ball. We got a little selfish at times, but overall a nice game from start to finish. The team did a really nice job of getting themselves going early and playing to a certain standard and a certain level.”\n\n\r\n                    Justin James and Damian Jones hit consecutive 3s late in the third quarter, and Hield made one beyond the arc to put the Kings up 104-69.\n\n\r\n                    The Thunder continued their disappointing slide that began in April. Oklahoma City has lost seven straight and 21 of 22.\n\n\r\n                    “The biggest issues was our first-half defense,” Thunder coach Mark Daigneault said. “We did a lot of damage defensively there and dug ourselves a hole. (The Kings) gained some confidence because the game was coming so easy to them. We didn’t have the competitive grit we needed on that end of the floor.”\n\n\r\n                    PAIR OF KINGS (GMS)\n\n\r\n                    Former Kings general manager Vlade Divac sat courtside next to owner Vivek Ranadive, with current general manager Monte McNair sitting on the other side of Ranadive. Divac and Ranadive frequently chatted while huddled together during timeouts. At one point, Hield walked over and hugged Divac, who stepped down as GM following the 2020 season.\n\n\r\n                    “Vlade, he’s one of those people when you see him, you can’t help but smile,” Walton said. “It was great to see him.”\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Ty Jerome missed a second straight game with a strained left calf. ... Luguentz Dort (right knee patellar tendinitis) was held out. \n\n\r\n                    Kings: Marvin Bagley III had 13 points and nine rebounds in 21 minutes. ... De’Aaron Fox’s status is uncertain after being cleared to return to the team from the NBA’s health and safety protocols. ... Harrison Barnes (left adductor) did not play. \n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997158.983395
}