{
  "game_id": "0022300319",
  "espn_id": "401584947",
  "date": "Dec 14, 2023",
  "matchup": "CLE @ BOS",
  "headline": "Celtics improve to 12-0 at home behind Jayson Tatum's 27 points in 116-107 win over Cavs",
  "body": "BOSTON -- — Jayson Tatum scored 27 points, Jaylen Brown had 22 and the Boston Celtics beat the Cleveland Cavaliers 116-107 on Thursday night to improve to 12-0 at home.\n\n\r\n              Facing the Cavaliers for the second consecutive game at TD Garden after a victory on Tuesday, Boston won for the sixth time in seven games overall.\n\n\r\n              Kristaps Porzingis added 18 points, Jrue Holiday had 15 and Derrick White 14 for the Celtics, who have the best record in the Eastern Conference. Tatum added 11 rebounds, and all five starters scored in double figures. \n\n\r\n              “I think we were locked in, attention to detail,” Holiday said. “This game we kind of controlled the game from beginning to end, withstood their punches and were able to make plays down the stretch.”\n\n\r\n              Donovan Mitchell paced Cleveland with 31 points, Caris LeVert finished with 26 and Darius Garland had 19. The Cavaliers have lost three straight.\n\n\r\n              After having their double-digit lead sliced to three entering the final quarter, the Celtics took control again. Tatum sparked a quick spurt with a fadeaway and a step-back 3-pointer, pushing Boston’s lead to 101-91 with 8 1/2 minutes to go.\n\n\r\n              Cleveland had one more run left, slicing it to 107-102 on LeVert’s driving basket with 3:01 to play, but Holiday hit a layup and Tatum followed Cleveland’s turnover with a dunk with 1:53 to play.\n\n\r\n              “I thought we could have played a lot better, to be honest,” Brown said. “I thought we played a little lethargically and allowed them to keep the game kind of close. That’s kind of dangerous against certain teams; they’re in striking distance and can get hot at any moment. We’ve got to do a better job of putting teams away.” \n\n\r\n              Trailing by double digits most of the third quarter and looking somewhat sluggish, the Cavaliers found a late spark, namely Garland, late in the period when he burst to the basket before hitting a left-handed scoop. He followed that by nailing a 3 from the top with 0.3 seconds on the clock to close to 90-87 after three.\n\n\r\n              Unlike Tuesday’s victory when the Celtics fell behind by 15 in the opening quarter, they combined some steady ball movement that led to numerous open looks with good outside shooting, taking advantage of a cold start by the Cavaliers to jump ahead by 14 on Brown’s right-corner 3 midway into the second quarter.\n\n\r\n              “I think it's growth to constantly be challenged throughout the season,” Boston coach Joe Mazzulla said. “I've seen over the last two games our guys kind of staying at a certain level, really work to execute and play together.”\n\n\r\n              Boston shot 56.1% in the opening half (including 8 of 17 on 3-point attempts) and led 65-54 at the break.\n\n\r\n              Mitchell had 21 first-half points, but the Cavaliers missed 16 of 20 attempts from beyond the arc. Every Cleveland player besides Mitchell shot under 50% from the floor in the opening half. \n\n\r\n              “I don't think that we came out as aggressive and assertive as we needed to,” Cavaliers coach J.B. Bickerstaff said. “I thought we did settle (for shots) a little early, but we did pick it up.”\n\n\r\n              After making all 26 free throws in Tuesday’s win, Boston was 17 of 20 from the foul line.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host the Atlanta Hawks on Saturday night.\n\n\r\n              Celtics: Host the Orlando Magic on Friday, the first of consecutive games between the teams at TD Garden.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996736.2985651
}