{
  "game_id": "0021700249",
  "espn_id": "400975000",
  "date": "Nov 20, 2017",
  "matchup": "DAL vs. BOS",
  "headline": "Irving's 47 lead Celtics past Mavericks to maintain streak",
  "body": "DALLAS --  Double-digit deficits are becoming just a minor annoyance to the Boston Celtics as they continue their winning ways.\n\nKyrie Irving scored 10 of his season-high 47 points in overtime as the Celtics rallied from 13 points down in the fourth quarter to beat the Dallas Mavericks 110-102 on Monday night and extend their winning streak to 16 games.\n\nThe winning streak ties the fourth-longest in franchise history, and for the third game in a row, Boston trailed by double digits.\n\nIn contrast to recent wins over Golden State and Atlanta, this one required a fourth quarter comeback. For that, the Celtics turned to Irving, who delivered his best performance for his new team after Dallas had taken an 87-74 lead with 7:47 to play.\n\n\"For us it's just about battling back when teams get a comfortable rhythm, whether it'd be in the first half or the second half,\" Irving said. \"As a group we continue just to stick together throughout anything and everything.\"\n\nIrving stole the ball from Dirk Nowitzki and fed Jayson Tatum for an alley-oop lay-up that hung on the rim for a full second before dropping through with 1:01 to play to tie the score at 96.\n\nIn the extra period, Irving scored his team's first six points. Then after Jaylen Brown gave Boston a 104-102 lead with a jumper with 1:39 to play, Irving went to work on Yogi Ferrell, backing him down and drawing contact on a lay-up with 48.5 seconds to play. Though Irving missed the free throw to keep the score 106-102, Dallas never got closer.\n\n\"I don't really see it as a pressure situation,\" Irving said of his late-game play. \"It's just like playing basketball, man. It's just like being in a park 7-7 and game is eight.\"\n\nHarrison Barnes scored 31 points and Wesley Matthews had 18 for Dallas, which came back from an early double-digit deficit as the Celtics went cold for much of the second and third quarters. Barnes missed a jumper with less than a second to go in regulation that could have won it for Dallas, which fell to 3-15.\n\n\"We just needed to make a couple more plays at key times,\" Mavericks coach Rick Carlisle said. \"Probably just one more key play in the last minute or minute and a half. That would have been the difference.\"\n\nBrown finished with 22 for Boston. He and Irving combined to go 24-for-35 while the rest of the Celtics went 14-for-49.\n\nThe Mavericks fell behind by as many as 15 points in the first half, outscoring the Celtics 55-35 over the second and third quarters.\n\nNO MORAL VICTORIES\n\nSimilar to recent home games against Cleveland and San Antonio, the Mavericks fought one of the NBA's best teams until the end, getting their home crowd into it. But the Mavericks have three close losses to show for those efforts and perhaps are unfairly saddled with the league's worst record.\n\n\"At the end of the day, it's got to show up in wins and losses,\" Barnes said. \"There are no moral victories around here. Tonight was playing against a great team, and a great opportunity to win here in front of our home fans. We let it slip away.\"\n\nTIP-INS\n\nCeltics: Marcus Smart came into the game shooting just 27 percent from the field, worst among NBA players with at least 10 attempts per game. And he shot 3-for-15 Monday as the Mavericks backed off and dared him to shoot. But Smart's 3 with 1:24 to play in the game put Boston within 96-94. . Boston shot just 10-for-34 over the two middle quarters after building the early lead. ... The game was a homecoming for Boston rookie Semi Ojeleye, who played college basketball at SMU in Dallas.\n\nMavericks: Guard J.J. Barea won the NBA Cares Community Assist Award for October for the relief work he did in the aftermath of Hurricane Maria in his native Puerto Rico. He was presented with the award at halftime. Barea has provided more than 100,000 pounds of supplies to the island, and he has raised nearly $750,000 in funds through his own efforts and a YouCaring.com fund drive.\n\nUP NEXT\n\nCeltics: At Miami on Wednesday. The Celtics beat the Heat on October 28 for win number four of their streak.\n\nMavericks: At Memphis on Wednesday for the team's third meeting of the season. Each team won at home in a back-to-back series in late October.",
  "source": "espn_api",
  "crawled_at": 1764993969.3616672
}