{
  "game_id": "0021600726",
  "espn_id": "400900147",
  "date": "Jan 31, 2017",
  "matchup": "HOU vs. SAC",
  "headline": "Anderson, Gordon lead Kings past Rockets, 105-83",
  "body": "HOUSTON --  The Houston Rockets could not have been happier to be home.\n\nAfter a 2/3 trip and 10 of their last 14 games on the road, the Rockets were revved up again back at Toyota Center.\n\nRyan Anderson had 25 points and 11 rebounds, Eric Gordon added 17 points and Houston used a big second-quarter run to beat the Sacramento Kings 105-83 on Tuesday night.\n\n\"It just felt good to be back at home,\" James Harden said. \"It felt like we were on the road for so long, that we are home, we are comfortable. We got to sleep in our own bed. Tonight, we came out and played hard. We had energy at the beginning of the game and carried that through all four quarters.\"\n\nAnderson shot 6 of 12 from 3-point range and Houston went 14 of 45 from behind the arc as a team.\n\nHarden, who banged knees early in the first quarter, finished with 10 points, seven rebounds and eight assists. He said he would be ready to go Thursday against Atlanta.\n\nClint Capella had 12 points and 11 rebounds for the Rockets.\n\n\"We have a lot of weapons on our team,\" forward Trevor Ariza said. \"On any given night, anyone can step up and be our leading scorer. Tonight with Ryan he shot the ball extremely well like we know he can. We just rode that.\"\n\nHouston used an 18-3 run over the first nine minutes of the second quarter to extend its lead to 47-27 on Nene's dunk. Gordon had eight points in the run, and Nene added six.\n\nThe Kings shot 3 for 16 from the field, committed six turnovers and were outscored 25-11 in the second quarter as Houston opened up a 54-35 halftime lead.\n\n\"They defensively played real well,\" coach Mike D'Antoni said of his Rockets. \"Now, we played good the first quarter, but that second quarter was excellent, and that kind of set the tone.\"\n\nDeMarcus Cousins had 16 points and seven rebounds for the Kings, who shot 35 percent. Kosta Koufos added 12 points.\n\n\"We ran out of gas there in the last game against (Philadelphia), but I thought we really ran out of legs tonight,\" Kings coach Dave Joerger said. \"We didn't shoot it well; they are obviously very offensively potent.\"\n\nSacramento got no closer than 19 in the second half.\n\nTIP-INS\n\nKings: Garrett Temple exited with 9:29 left in the third quarter with an apparent left hamstring injury. Temple fell to the ground and immediately grabbed his left hamstring after a steal. He limped off the court and straight to the locker room. Temple said he is going to have an MRI to see the severity of the injury. He finished with three points. ... Willie Cauley-Stein had 10 points and six rebounds.\n\nRockets: Nene finished with 11 points. ...The Rockets outrebounded Sacramento 60-45. ... Houston wore its Lunar New Year uniforms Tuesday for the first time this season.\n\nEIGHT IS ENOUGH\n\nSacramento finished its eight-game road trip 3-5 after losing its third out of the last four games. The trip featured three back-to-backs in which the Kings went 1-2 in the second game, including Tuesday's loss. The road trip included an awkward Philadelphia to Houston back-to-back after the game against the 76ers, originally scheduled for Nov. 29, was rescheduled for Monday due to wet floor conditions.\n\n\"I think we progressed as a team,\" Cousins said. \"It's been a tough road trip with a lot of unfortunate things happened. A lot of things didn't go our way, but through it, I think we got better as a team.\"\n\nHALL OF FAMERS IN THE HOUSE\n\nHouston honored Hall of Famer Dikembe Mutombo during the second quarter of Tuesday's game as part of the team's 50th season celebration. Mutombo played parts of five seasons with Houston at the end of his career. Hall of Famer Hakeem Olajuwon was also at the game, sitting courtside next to Mutombo.\n\nUP NEXT\n\nKings: Return home to start a six-game homestand against Phoenix on Friday.\n\nRockets: Will continue their four-game homestand and welcome former Rockets center Dwight Howard on Thursday when they host Atlanta.",
  "source": "espn_api",
  "crawled_at": 1764995763.7429178
}