{
  "game_id": "0022400891",
  "espn_id": "401705457",
  "date": "Mar 05, 2025",
  "matchup": "POR @ BOS",
  "headline": "Pritchard scores career-high 43, knocks down 10 3s to lead Celtics over Blazers 128-118",
  "body": "BOSTON -- — Payton Pritchard scored a career-high 43 points and knocked down a career-best 10 3-pointers to lead the short-handed Boston Celtics past the Portland Trail Blazers 128-118 on Wednesday night.\n\n\r\n              Derrick White added career highs with 41 points and nine 3s to lead Boston to its eighth victory in 10 games, making Pritchard and White the first Celtic duo to score 40 or more points in the same game and the first duo in NBA history with nine or more 3-pointers each in a game.\n\n\r\n              With starters Jayson Tatum (shoulder), Jrue Holiday (finger) and Kristaps Porzingis (illness) all sitting out, Pritchard picked up the scoring load for a Celtics team that made 23 3-pointers.\n\n\r\n              The game remained tight throughout the first half, featuring five ties and 15 lead changes. But Boston outscored the Blazers 36-27 in the third quarter.\n\n\r\n              Anfernee Simons led Portland with 30 points and Shaedon Sharpe added 25. \n\n\r\n              It was the sixth game of a seven-game road trip for the Blazers, who had won four of their previous five.\n\n\r\n              Takeaways\r\n              Trail Blazers: Boston made some changes in its defensive coverage that kept Portland from getting to the rim for most of the night. It forced the Blazers to shoot more jumpers and they couldn’t match the Celtics’ output from 3-point range.\n\n\r\n              Celtics: Another solid win in which a reserve stepped up and made a significant impact. Having that depth adds to Boston’s chances of repeating as NBA champions. \n\n\r\n              Key moment\r\n              After the Blazers cut what had been a 25-point deficit to 124-116 with 2:35 to play, Boston came up with back-to-back stops and made enough free throws down the stretch to preserve the win. \n\n\r\n              Key stat\r\n              Pritchard has now connected on five or more 3-pointers in 20 games this season, ranking fourth in the NBA.\n\n\r\n              Up next\r\n              The Blazers conclude their seven-game road trip Friday night at Oklahoma City. The Celtics host the 76ers on Thursday night\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998165.54299
}