{
  "game_id": "0021500749",
  "espn_id": "400828636",
  "date": "Feb 04, 2016",
  "matchup": "HOU @ PHX",
  "headline": "Brewer, Ariza lead Rockets past Suns 111-105",
  "body": "PHOENIX --  The Houston Rockets got off to a slow start, but finished with a flourish.\n\nCorey Brewer scored a season high 24 points and Trevor Ariza 22 to lead the Rockets, who scored 38 points off 24 turnovers by Phoenix in a 111-105 victory over the Suns on Thursday night. Brewer made 9 of 12 shots and had four of his team's 16 steals.\n\nThe Rockets won despite a 4-for-19 shooting night by James Harden, who finished with 17 points, more than 10 under his average. Dwight Howard grabbed 16 rebounds in the 200th meeting between the teams.\n\nHouston trailed by 15 points in the first quarter, but scored 37 second-quarter points, a season high for that second 12 minutes. The Rockets outscored the Suns 20-10 over the last half of the fourth quarter.\n\n\"The best thing is we did was not panic. Teams are going to make runs and it's about how you respond to the runs they make,\" Ariza said.\n\nArchie Goodwin led the Suns with 22 points and six turnovers, while Alex Len added 12 with a career-high 18 rebounds and Devin Booker had 17 points as Phoenix lost its sixth straight.\n\nMirza Teletovic scored the Suns' first 10 points of the fourth quarter to cut the deficit to 91-90. Jordan McRae's layup and free throw gave Phoenix a 95-91 lead with 6:47 to play, but Houston rallied and regained the lead behind two 3-pointers from Brewer and one each from Ariza and Harden.\n\nBrewer sank a 3 with 1:10 left after two offensive rebounds by Patrick Beverly that gave the Rockets a 108-101 lead.\n\n\"We just stayed with it. Then we got a lot of wide-open shots,\" Brewer said. \"Me and Trevor made shots and we were able to get a win.\"\n\nThe Rockets raced out to a 77-66 lead in the third quarter, with Brewer scoring 11 points in less than six minutes and Ariza punctuating a 21-7 run out of halftime with a back-to-the-basket transition layup. Back-to-back 3s for Ty Lawson gave Houston an 83-71 lead with 3:19 to go.\n\nThe Suns committed 10 turnovers in the quarter with Goodwin pressed into service at point guard, a position he's learning.\n\n\"It's small things I'm not doing like getting to the outlet fast enough,\" Goodwin said. \"I see the pass and sometimes I just throw it too hard or I don't drop it in the right spot ... I'll get better at it.\"\n\nThe Rockets took an 88-80 lead into the fourth quarter after Goodwin's running 3-pointer at the buzzer for the Suns, the start of a comeback from the 12-point deficit.\n\nPhoenix led by as many as 15 at 20-5, with Houston making just two of its first 10 shots. The Rockets trailed by as many as 13 in the second quarter. Houston rallied from that deficit to tie it at 51 on Josh Smith's 3-pointer, and Smith's free throw put the Rockets in front 52-51 with 2:02 left in the first half.\n\nMarkieff Morris hit three free throws in the closing seconds and the Suns led 59-56 at halftime.\n\nSIDELINE YOUTH\n\nThe two current youngest head coaches in the NBA went head-to-head -- both interim coaches. The Suns' Earl Watson, who took over on Feb. 1 after the firing of Jeff Hornacek, was at the helm for his second game, while Rockets coach J.B. Bickerstaff has been on the job since Nov. 18. Both are 36 years old, although Watson is three months younger.\n\nTIP-INS\n\nRockets: F-C Donatas Motiejunas left the team after Thursday's shootaround, sent back to Rio Grande Valley of the D-League. Motiejunas was brought back from the D-League earlier in the week because Houston was without depth at forward due to illness and injury, but C-F Clint Capela was cleared to play after missing Tuesday's game with a left hip flexor strain. ... Harden didn't get his first basket until early in the second quarter after playing just four minutes of the first. Bickerstaff subbed in five new players who played the last eight minutes of the quarter. \"It just looked like we were in a fog. We kind of needed to shock us a little bit,\" Bickerstaff said.\n\nSuns: Watson feels G Ronnie Price would be \"excellent\" as an NBA coach when his playing days are done. Price, who is out after toe surgery, is in his 11th NBA season. \"At this point, he is evolved as a player, his mind thinks like a coach,\" Watson said. ... Booker was named one of eight participants in the All-Star Saturday 3-Point Contest on Feb. 13 in Toronto, the Suns announced Thursday. He'll be the youngest participant in the history of the contest at 19 years old. Booker entered Thursday's game making 41.8 percent of his 3s (51 for 122).\n\nUP NEXT\n\nRockets: Host Portland on Saturday.\n\nSuns: Host Utah on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994623.8925152
}