{
  "game_id": "0022300377",
  "espn_id": "401585005",
  "date": "Dec 21, 2023",
  "matchup": "MEM vs. IND",
  "headline": "Ja Morant has 20 points in first home game following suspension, Grizzlies beat Pacers 116-103",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 20 points and eight assists in his first home game following a 25-game suspension to help the Memphis Grizzlies beat the Indiana Pacers 116-103 on Thursday night.\n\n\r\n              Desmond Bane led Memphis with 31 points and also had seven assists. Jaren Jackson Jr. added 21 points and seven rebounds. Bane was 11 of 26 from the field and 5 of 12 from 3-point range, while Morant shot 7 of 15. It the second straight game all three have scored at least 20 points, both victories.\n\n\r\n              “Having those two guys (Bane and Jackson) alongside of me who can pretty much go and score the ball at will at different levels is big time for us,” Morant said. “I feel like it makes us tougher to guard.”\n\n\r\n              Memphis coach Taylor Jenkins added: “We've got a pretty good record when those guys score 20-plus points.”\n\n\r\n              Memphis was still relishing in Morant’s return Tuesday night in New Orleans when he scored 34 points and made the winning, spinning layup as time expired. He was suspended by the NBA for waving a gun at least twice on social media.\n\n\r\n              Obi Toppin led Indiana with 22 points. Tyrese Haliburton added 17 points and 14 assists, and Buddy Hield and Myles Turner each had 15 points.\n\n\r\n              “Overall, this was a tough game for a lot of reasons,” Indiana coach Rick Carlisle said. “We didn't play well, but we kept competing. I was really proud of the way the team kept their poise and their aggression.”\n\n\r\n              Memphis, which led 86-77 entering the third, stretched it to 17 at the midway point of the fourth and coasted to its second straight victory. It was only the Grizzlies second home win of the season after having the best home record in the NBA last season. The Pacers were coming off a 144-113 victory in Charlotte on Wednesday night.\n\n\r\n              \"We got unlucky with some miscues and some missed shots,\" Carlisle said when asked about the difference against Memphis.\n\n\r\n              With Morant back, the Grizzlies seem to have a new attitude that showed in the first half. By the midway point of the second quarter, Memphis was shooting at 60% overall and 50% from 3-point range. The lead had reached 22 points.\n\n\r\n              But the Pacers had a 27-6 run to cut Memphis' advantage to 58-56 at halftime. And by early in the third, the Pacers had erased the lead after a pair of baskets from Haliburton. Memphis answered the Indiana run to retake the lead.\n\n\r\n              For Memphis, the addition of Morant has brought a different energy and the Grizzlies seem to share the ball more. Memphis had 27 assists on the night, 15 between Morant and Bane.\n\n\r\n              “When we just get that ball moving for 48 minutes,” Jenkins said, “that's Grizzlies basketball.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Orlando on Friday night.\n\n\r\n              Grizzlies: At Atlanta on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996029.890031
}