{
  "game_id": "0021800525",
  "espn_id": "401071201",
  "date": "Dec 28, 2018",
  "matchup": "OKC @ PHX",
  "headline": "Westbrook scores 40, Thunder pull away to beat Suns",
  "body": "PHOENIX --  For three quarters on Friday night, the improving Phoenix Suns gave Oklahoma City everything it could handle.\n\nRussell Westbrook and Dennis Schroder took over from there, and the Thunder rolled to a 118-102 victory.\n\nWestbrook scored 40 points, 15 in the game's final 6  1/2 minutes, Schroder scored 14 of his 20 points in the fourth quarter and Oklahoma City snapped a two-game skid despite the absence of Paul George, who missed his first game of the season due to a right quad contusion. Abdel Nader scored a career-high 18 for the Thunder.\n\nWhen the game was on the line, Thunder coach Billy Donovan said, \"We defended really well, we rebounded really well and we took care of the basketball and were able to score points.\"\n\nDevin Booker had 25 points and 10 assists for the Suns, who had a three-point lead after three quarters but were outscored 37-18 in the fourth.\n\n\"We lean on defense all season,\" Westbrook said, \"and it's important that we constantly keep leaning on that to win games.\"\n\nT.J. Warren scored 19 and Deandre Ayton 16 for Phoenix, which had won five of its previous seven games after opening the season 4-24.\n\n\"That's a very winnable game for us,\" Booker said. \"We just let it slip. That team's been together a long time. They know what it takes to close out games. We're still learning.\"\n\nThe Thunder swept the four-game season series from the Suns.\n\nSchroder scored 10, including a pair of 3s, in what proved to be the decisive 17-2 fourth-quarter run that put Oklahoma City ahead 102-88 with 6:09 to play. Westbrook capped the outburst with a 3 and pretty much took over the game from there.\n\n\"In the first half, my shot wasn't falling and everybody else stepped up doing a great job,\" Schroder said. \"In the second half, everybody gave me confidence, told me to keep shooting and I did and in the fourth quarter I kept it going, shot every shot I could get and it went in.\"\n\nThe Suns' reserves were the main contributors in a 16-4 second-quarter run.\n\nNader converted a three-point play then scored again inside to put the Thunder up 43-35 with 10:02 left in the first half.\n\nBut Josh Jackson sank a 19-footer, followed by a 3-pointer, to ignite the surge. Booker also hit a 3-pointer and Mikal Bridges scored from the baseline to put the Suns ahead 51-47 with 5:22 to go. There were five lead changes the rest of the half, with Oklahoma City leading 58-57 at the break.\n\nPhoenix scored the first six points of the second half to lead 63-55 and was up 82-77 after Warren's 3-pointer, but Raymond Felton's steal and layup cut it to 82-79. The Suns led 84-81 entering the fourth.\n\n\"We can be pleased with the three quarters that we played and how we played, how we competed,\" Phoenix coach Igor Kokoskov said, \"but unfortunately it's a 48-minute game.\"\n\nTIP-INS\n\nThunder: Terrance Ferguson left the game due to stomach illness in the first quarter. Alex Abrines missed his second straight game due to stomach illness. ... Oklahoma City has not lost three in a row since starting the season 0-4. ... Thunder have beaten Phoenix six straight times. ... George had started all 33 games this season. ... Schroder made 3 of 12 shots in the first three quarters, 5 of 6 in the fourth. ... Oklahoma City moved into second in the Western Conference, a half-game behind Denver.\n\nSuns: The Suns opened a season-long, seven-game home stand after a 3-2 road trip. ... Booker missed his first six shots and was 1-for-7 shooting in the first quarter but with six assists. ... Phoenix had won more games in the last seven than it had in the previous 28. ... Kelly Oubre Jr. was 2 of 8 shooting, 0 of 4 on 3s, for four points in his home debut for the Suns.\n\nUP NEXT\n\nThunder: At Dallas on Sunday.\n\nSuns: Host Denver on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994597.745383
}