{
  "game_id": "0022400840",
  "espn_id": "401705406",
  "date": "Feb 26, 2025",
  "matchup": "OKC @ BKN",
  "headline": "Thunder bounce back from stunning collapse with fourth-quarter blitz to beat the Nets 129-121",
  "body": "NEW YORK -- — Shai Gilgeous-Alexander scored 27 points, Chet Holmgren had 22 points and 17 rebounds, and the Oklahoma City Thunder rebounded from a stunning collapse with a game-changing blitz in the fourth quarter to beat the Brooklyn Nets 129-121 on Wednesday night. \n\n\r\n              Aaron Wiggins added 24 points and Jalen Williams had 22 for the Thunder, who were playing for the first time since their 131-128 loss to Minnesota on Monday, when they led by 24 points in the fourth quarter and were still ahead by 16 with under 4 minutes remaining in regulation.\n\n\r\n              They had some of the same defensive woes in this one, when they allowed a season-high 76 points in the first half and trailed by 18. But then they unleased an 18-0 run in the fourth quarter, turning a 103-99 deficit into a 117-103 lead. Oklahoma City outscored Brooklyn 27-7 to begin the period.\n\n\r\n              Day'Ron Sharpe scored a career-high 25 points in his first start of the season for the Nets, adding 15 rebounds and five assists. Killian Hayes had a season-best 19 points and Cam Johnson also scored 19.\n\n\r\n              Takeaways\r\n              Thunder: Once they got going, the Western Conference leaders didn't slow down until they had avoided what would have been consecutive losses for just the second time this season. \n\n\r\n              Nets: Sharpe made the most of his chance to start and play major minutes with starting center Nic Claxton suspended for the game by the NBA for accumulation of flagrant foul points. \n\n\r\n              Key moment \r\n              With the Thunder having just taken a two-point lead, Cason Wallace got the next two baskets off his own steals, giving Oklahoma City a 109-103 lead midway through its run. \n\n\r\n              Key stat\r\n              The Nets made a season-high 23 3-pointers on a franchise-record 61 attempts.\n\n\r\n              Up next\r\n              The Thunder visit Atlanta on Friday night and the Nets host Portland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997672.903129
}