{
  "game_id": "0022000866",
  "espn_id": "401307663",
  "date": "Apr 18, 2021",
  "matchup": "SAC @ DAL",
  "headline": "Kings snap 9-game losing streak, beat Mavericks 121-107",
  "body": "DALLAS -- — De’Aaron Fox had 30 points and 12 rebounds, Harrison Barnes scored 24 and Terence Davis II added 23 as the Sacramento Kings snapped a nine-game losing streak with a 121-107 victory over the Dallas Mavericks on Sunday night.\n\n\r\n                    Barnes scored 11 in the third quarter as the Kings built a 21-point lead midway through the period. Sacramento, which never trailed, held off a late Dallas run that cut the lead to six with 3½ minutes left.\n\n\r\n                    “Our communication was better, our rebounding was better, our shot challenging was better,” Kings coach Luke Walton said.\n\n\r\n                    Luka Doncic scored 37 points, 22 in the fourth quarter, for the Mavericks, who dropped their fourth straight home game. Dorian Finney-Smith scored 22 points, one short of his season high, and Jalen Brunson added 20 off the bench.\n\n\r\n                    “Give Sacramento credit,” Mavericks coach Rick Carlisle said. “They came in here on a long losing streak. They decided they were going to throw their best game at us. They did, and they ended up getting the win.”\n\n\r\n                    “That was fun,” Walton said of watching Fox and Doncic trading baskets for much of the fourth quarter. “It probably would have been a little more fun if we weren’t fighting a nine-game losing streak.”\n\n\r\n                    The Kings ran off the game’s first eight points and led by 12 late in the first quarter before Dallas settled down and tied the score 25-all 3½ minutes into the second period. Davis scored 15 points in the second quarter, including all three of his 3-pointers, helping the Kings take a 67-50 lead at halftime.\n\n\r\n                    The Mavericks hit only one of their first 11 from behind the arc and hit six of 24 in the half. Doncic missed all four of his shots from long range and shot 3 for 11 in the half, scoring six points.\n\n\r\n                    GETTING A BIG LIFT\n\n\r\n                    With Marvin Bagley III missing his 18th straight game (broken hand) and Richaun Holmes his third straight (hamstring strain), 31-year-old Hassan Whiteside, the team’s oldest player, made his second start of the season at center. Whiteside responded with five points in the Kings’ initial 8-0 run, closed the quarter with nine points and six rebounds and finished with 12 points and 10 rebounds in 18½ minutes due to early foul trouble.\n\n\r\n                    “He’s really helped us this year when he’s been healthy, and it hasn’t always been huge minutes,” Walton said. “He’s helped anchor our defense.”\n\n\r\n                    ANOTHER LATE START FOR MAVERICKS\n\n\r\n                    Following Dallas’ 12-point home loss to New York on Friday, Carlisle bemoaned the Knicks’ nine-point lead after one quarter and looked for better early results on Sunday. Instead, Sacramento scored the first eight points and, while, threatened later on, never trailed.\n\n\r\n                    “We have to play harder; I have to play harder,” said Doncic, who was 0 for 4 from the floor, 0 for 3 from behind the arc and 2-for-4 from the line in the first quarter. “It starts with me, so I have to play way better.”\n\n\r\n                    TIP-INS\n\n\r\n                    Davis was 5-for-5 on 3-pointers. … The Mavericks, seventh in the Western Conference, are 13-14 at home with four straight losses. … Sacramento’s 45-point second quarter was its best scoring quarter of the season. … Walton said there’s no timetable for Holmes’ return. … Dallas’ Kristaps Porzingis, averaging 20.8 points, was held to nine points, all in the first half. … This was the first of three meetings between Sacramento and Dallas in a 15-day span.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Begin a home back-to-back on Tuesday against Minnesota. They will welcome 1,600 front-line workers, the first fans to attend a game in Sacramento in 13 months.\n\n\r\n                    Mavericks: Host Detroit on Wednesday in the middle game of a five-game homestand.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997950.0303319
}