{
  "game_id": "0022200030",
  "espn_id": "401468185",
  "date": "Oct 22, 2022",
  "matchup": "ORL vs. BOS",
  "headline": "Jayson Tatum, Derrick White lead Celtics over Magic, 126-120",
  "body": "ORLANDO, Fla. -- — Jayson Tatum and Derrick White combined for 12 straight points late in the fourth quarter to help the Boston Celtics beat the Orlando Magic 126-120 on Saturday night.\n\n\r\n              Tatum had 40 points and eight rebounds. He launched a 10-2 run with two free throws with 4:08 remaining to put the Celtics up for good.\n\n\r\n              Tatum is off to such a good start, he was asked about the Most Valuable Player award.\n\n\r\n              “I mean, it’s early but (the MVP) has always been a goal of mine,” Tatum acknowledged. “When I was a kid, getting into the NBA wasn’t all I wanted to do. I wanted to be a champion, reach all those accolades and accomplishments, and MVP is obviously at the top of that list.”\n\n\r\n              White scored 27 points, two short of his career high, to help the Celtics win for the second straight night.\n\n\r\n              Terrence Ross led the Magic with 29 points, rookie Paolo Banchero had 23 and Franz Wagner added 18. The Magic dropped to 0-3 in losing for the Celtics for a 10th straight time.\n\n\r\n              “That is an elite Boston team. There’s a reason they went to the Finals last year,” Orlando coach Jamahl Mosley said. “They’re physical, they’re tough, they’re tied together.” \n\n\r\n              Playing without center Al Horford, the Celtics played most of the game with 6-foot-6 Grant Williams at center. He had 13 points and six rebounds in 31 minutes.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Horford did not play because of what the Celtics reported was a stiff back. ... Noah Vonleh got his first start for the Celtics at center. It was his first NBA start since Nov. 23, 2019, with Minnesota. \n\n\r\n              Magic: G Jalen Suggs did not play after spraining his right ankle in Atlanta on Friday night. ... G Markelle Fultz (fractured toe) has missed all three games and coach Jamahl Mosley said there is no timetable for his return.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Chicago on Monday night.\n\n\r\n              Magic: At New York on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994665.7482371
}