{
  "game_id": "0021900716",
  "espn_id": "401161358",
  "date": "Jan 30, 2020",
  "matchup": "ATL vs. PHI",
  "headline": "Trae Young's 39 points lead Hawks past Simmons, 76ers",
  "body": "ATLANTA --  Trae Young thought it was important for him to play up to his status as an All-Star starter. After all, the Hawks' point guard was matched against two of his All-Star teammates.\n\n“I feel I needed to prove myself a little bit,” Young said.\n\nYoung fulfilled his goal, scoring 39 points and adding a career-high 18 assists to lead Atlanta past Ben Simmons and Philadelphia 127-117 on Thursday night, extending the 76ers' road woes.\n\n“I think I managed the game pretty well tonight from start to finish,” said Young, who's in his second season. “I'm getting better every day.”\n\nYoung ranks third in the league with 29.4 points per game. He is second, behind the Lakers' LeBron James, with 9.2 assists per game.\n\nYoung was dominant from the opening period, when he had 10 assists. After that, he was the focus of the 76ers' defense.\n\n“I think we was too focused on what Trae was doing,” Simmons said.\n\nPhiladelphia's Tobias Harris said Young “is a tough cover.”\n\n“Tonight he just carved us up,\" Harris said. “He was their whole offense tonight.”\n\nYoung and Philadelphia's Joel Embiid, who had 21 points and 14 rebounds, are All-Star starters. Simmons, added to the Eastern Conference team  on Thursday as a reserve, scored 31 points to lead Philadelphia.\n\nShake Milton had a career-high 27 points -- 14 more than his previous high -- but it wasn't enough to improve the 76ers' poor road record. Philadelphia, 22-2 at home, fell to 9-16 in away games.\n\nJohn Collins had 17 points and 20 rebounds for Atlanta.\n\nThe 76ers, who began the night tied with Indiana for fifth place in the Eastern Conference, held their last lead at 21-20 against the Hawks, who are last in the conference.\n\nPhiladelphia coach Brett Brown called a timeout early in the final period after Young's 3-pointer gave Atlanta a 106-94 lead. Apparently still unhappy with his team's defense, Brown called another timeout about one minute later after Young's floater pushed the lead to 14 points at 108-94, capping a 9-0 run.\n\nPhiladelphia cut Atlanta's lead to 121-116 before Vince Carter, who had 14 points, sank two free throws.\n\nTIP-INS\n\n76ers: Tobias Harris had 21 points and nine rebounds. ... Milton had 16 points in the first half, topping his previous career high -- 13 -- for a full game. ... Simmons (minor upper respiratory illness) was cleared following pregame warmups.\n\nHawks: Young needed only one period to log his fifth consecutive double-double. He had 14 points and 10 assists in the first. ... Bruno Fernando (left calf) and Alex Len (right hip) were out as Atlanta again dealt with a lack of depth on its front line. G DeAndre Bembry (right hand) missed his fifth straight game. F Jabari Parker (shoulder) will be evaluated on Tuesday. ... Carter appeared in his 1,523rd game, breaking a tie with Dirk Nowitzki for third all-time.\n\nHONORING KOBE\n\nHawks coach Lloyd Pierce and his assistants wore Kobe Bryant's Nike shoes during the game as their tribute to the retired Los Angeles Lakers great, who was killed Sunday in a helicopter crash. “It's obviously an emotional time,” Pierce said, adding his goal was “trying to find ways to continue to honor and do what we can to keep the legacy of Kobe going.”\n\nTECHNICAL\n\nThe Hawks led by only two points before a key sequence at the end of the first half led to Young making five free throws after he was fouled by Harris, pushing the lead to 74-67. Harris was called for a technical foul before Brown called a timeout to request a coach's challenge of the call that Young was shooting a 3-pointer when fouled.\n\nBrown protested when it was announced the challenge was not possible because Young already had taken one free throw. Brown also was called for a technical foul.\n\n“That was not a good moment of the game,” Brown said.\n\nUP NEXT\n\nThe 76ers continue their four-game trip on Saturday at Boston.\n\nThe Hawks, who are 5-20 on the road, play Saturday at Dallas.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996675.8261209
}