{
  "game_id": "0022200738",
  "espn_id": "401468893",
  "date": "Jan 27, 2023",
  "matchup": "MIA vs. ORL",
  "headline": "Heat rally again, top Magic 110-105 to close 3-0 homestand",
  "body": "MIAMI -- — Bam Adebayo has a theory. All these close games that the Miami Heat are playing now, in his mind, are providing valuable lessons to draw upon later this season.\n\n\r\n              And the fact that they're winning a lot of those games right now is an added bonus.\n\n\r\n              Jimmy Butler had 29 points, Adebayo added 20 and the Heat rallied again in the fourth quarter to beat the Orlando Magic 110-105 on Friday night. It capped a 3-0 homestand for the Heat, with those wins coming by three, four and five points.\n\n\r\n              “I don't know if we just like dogfights,\" Adebayo said. “I don't know if we just like to make it interesting.\"\n\n\r\n              Max Strus scored 17 points, 15 of them on 3-pointers, for Miami — which moved a season-high six games over .500 at 28-22. Caleb Martin scored 13 points, Gabe Vincent had 11 and Tyler Herro had 10 for the Heat.\n\n\r\n              Paolo Banchero, Franz Wagner and Cole Anthony all had 19 points for the Magic, while Wendell Carter Jr. had 16 and Markelle Fultz added 10. Orlando is 14-10 in its last 24 games, after starting the season 5-20.\n\n\r\n              Turnovers simply doomed the Magic. They had 20, compared to 11 by Miami — and the Heat turned Orlando’s giveaways into 32 points. Orlando scored 13 off Miami’s turnovers.\n\n\r\n              “We turned it over,” Magic coach Jamahl Mosley said. “When it comes down to it, you’ve got to take care of the basketball. I loved our fight. I loved the fact that we were in it, in a great environment, on the road, against a tough team. But you’ve got to take care of the basketball.”\n\n\r\n              Strus’ 3-pointer with 3:01 left in the third put Miami up 73-69. The rest of the quarter was all Orlando. The Magic closed the third on a 10-0 run, then scored the first basket of the fourth to go up 81-73 on a dunk by Moritz Wagner.\n\n\r\n              And then the momentum swung right back to Miami. The Heat scored 19 of the next 25 points to go up 92-87, setting up yet another down-to-the-wire finish — the theme of this now-completed three-game Miami homestand.\n\n\r\n              The Heat beat New Orleans by four on Sunday, then Boston by three on Tuesday.\n\n\r\n              “Anytime we win, it's a good thing,\" Butler said.\n\n\r\n              TIP-INS\n\n\r\n              Magic: Jonathan Isaac, who returned to the Magic lineup for the first time in 2-1/2 years earlier this week after knee and hamstring injuries, was inactive on the first night of a back-to-back. He played in Orlando’s games on Monday and Wednesday. ... Anthony had 17 points by halftime, matching his best first half of the season. He also had 17 by intermission against Atlanta on Oct. 21.\n\n\r\n              Heat: Rapper and record executive – and the star of one of Miami’s pregame intro videos this season – Rick Ross was at the game celebrating his birthday. He turns 47 on Saturday. ... It was Miami’s 50th game of the season and 37th decided by single digits; the Heat are 21-16 in those games. ... The Heat outscored the Magic 54-32 in the paint.\n\n\r\n              FIRST OF 4\n\n\r\n              It was the first of four meetings between the Florida rivals this season. They’ll meet again Feb. 11, March 11 and on the season’s final day — April 9.\n\n\r\n              The Magic have now played all other teams in the league at least once this season. Miami has yet to face New York or Philadelphia.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Chicago on Saturday night.\n\n\r\n              Heat: At Charlotte on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993952.85728
}