{
  "game_id": "0022000405",
  "espn_id": "401267565",
  "date": "Feb 12, 2021",
  "matchup": "SAC vs. ORL",
  "headline": "Vucevic scores 42, Carter-Williams helps Magic beat Kings",
  "body": "SACRAMENTO, Calif. -- — Nikola Vucevic’s latest shooting display had teammates calling the Orlando big man All-Star worthy.\n\n\r\n                    Michael Carter-Williams isn’t likely to come up in similar discussions, but his return to a depleted Magic lineup might have been equally as important.\n\n\r\n                    Vucevic scored 42 points and matched his career high of six 3-pointers as slumping Orlando beat the Sacramento Kings 123-112 on Friday night.\n\n\r\n                    “He made the big passes, the big plays,” Magic coach Steve Clifford said. \"He’s playing at an incredibly high level every night. He gets special attention, but he’s scoring inside and then he’s shooting the ball so well from the 3. I just think it’s where he is, his approach, his demeanor. He wants us to turn this around and he’s willing to take responsibility for that.”\n\n\r\n                    With Carter-Williams running the offense and sparking Orlando’s inside game, Vucevic’s shooting beyond the arc helped carry the perimeter attack. The 6-foot-11 big man made three 3s in the first half, two in the third quarter and added a sixth early in the fourth to put the Magic ahead 105-91.\n\n\r\n                    Vucevic shot 17 of 22 and grabbed nine rebounds. Orlando hit 15 3-pointers overall.\n\n\r\n                    “He’s definitely elevated his game,” Carter-Williams said. “He’s always been an unbelievable passer out of the post. Him working on the 3 this year, extending his range … he’s clearly an All-Star. To me, he’s one of the best big men in the league.”\n\n\r\n                    Vucevic sounded more satisfied with how Orlando played on the second half of a back-to-back after losing at Golden State on Thursday night. \n\n\r\n                    “Very proud of everyone. We brought it tonight,” Vucevic said. “Obviously, (the Kings) missed two important players so we knew we would have a good chance if we played well. We started off well and kept it up the whole game. Big win.”\n\n\r\n                    Carter-Williams returned for the Magic after missing more than five weeks and scored 15 of his season-best 21 points in the third quarter. Playing for the first time since a sprained left foot sidelined him for 18 games, Carter-Williams had an uneven shooting night but made up for it by repeatedly driving through the paint and getting to the rim. He also had seven assists and seven rebounds.\n\n\r\n                    “I’m always ready to go play the point,” Carter-Williams said. “I’ve been doing it all my life. I’m always staying sharp in those areas for moments like this. I was itching to get back on the court. I miss playing the game.”\n\n\r\n                    Terrence Ross added 18 points for the Magic, who won for the fourth time in 19 games.\n\n\r\n                    Hassan Whiteside had 18 points and seven rebounds for the Kings, who had won seven of nine.\n\n\r\n                    “They just physically pushed us around tonight,” Sacramento coach Luke Walton said. “They took it to us. The (21) points off (18) turnovers killed us.”\n\n\r\n                    Both teams were missing key players. \n\n\r\n                    Sacramento played without injured starters De’Aaron Fox and Marvin Bagley III. Orlando, already without Markelle Fultz for the remainder of the season, added Frank Mason to a long list of injured players that includes Evan Fournier, Al-Farouq Aminu and Aaron Gordon.\n\n\r\n                    Walton was so frustrated with his team that he pulled his entire starting five off the floor with a mass substitution four minutes into the third quarter while the Magic were in the midst of a 19-3 run.\n\n\r\n                    Vucevic dominated the low paint and had 21 points in the first half. He scored 16 in the first quarter, made 10 of his first 13 shots and had a pair of 3s to help put Orlando ahead 64-59.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Clifford is 7-3 on coach’s challenges this season after losing one early in the third quarter.\n\n\r\n                    Kings: Fox, the Western Conference player of the week, sat out after banging his knee in practice earlier in the week. Bagley has a sore calf. Both had started Sacramento’s first 24 games. … Nemanja Bjelica had 15 points and nine rebounds in his first game since Jan. 9. \n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Visit the Suns on Sunday. Orlando has won six of the last nine in Phoenix.\n\n\r\n                    Kings: Host the Grizzlies on Sunday night. The teams were scheduled to play a back-to-back in late January in Memphis before both games were postponed due to COVID-19 concerns.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997959.1251268
}