{
  "game_id": "0021500220",
  "espn_id": "400828107",
  "date": "Nov 25, 2015",
  "matchup": "MEM @ HOU",
  "headline": "Memphis hands Houston 3rd straight loss, 102-93",
  "body": "HOUSTON -- The Memphis Grizzlies didn't panic after opening the season 3-6 because they were confident they had the players to turn things around.\nNow they've done just that, winning six of their last seven games, capped by a 102-93 victory over the Houston Rockets on Wednesday night to improve to 9-7.\n\"In our case we knew it was us,\" Mike Conley said. \"When we can recognize and be accountable for our mistakes it's easier to fix then to start to think that all the teams are better than us.\"\nJeff Green scored 20 points and Courtney Lee had 10 of his 17 in the fourth quarter to help the Grizzlies beat the struggling Rockets.\nHouston has lost three straight to drop to 1/3 since coach Kevin McHale was fired and replaced by J.B. Bickerstaff.\n\nThe Grizzlies led for most of the game despite playing without Zach Randolph, who missed his fourth straight game with soreness in his right knee.\nLee made the first points of the fourth quarter for Memphis with about 9 minutes left. It was the first of six straight points for Lee, a former Rocket, that pushed the lead to 88-79.\n\"I was just playing within the system,\" Lee said. \"A couple of those plays they broke down and I was just in the right spot at the right time.\"\nJames Harden had 40 points for the Rockets. They are 5-10 overall.\n\"Of course we are all frustrated, but the confidence is still there,\" Harden said. \"We're getting a lot of open shots that we normally make and they're just not falling. So it's putting more pressure on our defense.\"\nThe Rockets made eight free throws in the first almost 10 minutes of the fourth quarter, but did not make a field goal until a 3-pointer by Jason Terry cut it to 98-88 with 2:01 remaining. Houston missed eight shots and had four turnovers in the fourth before Terry's shot.\nCorey Brewer made a 3-pointer after that, but Lee struck again, making a jump shot seconds later to make it 100-91 with just over a minute left.\n\"I was impressed with the zip that we showed to try to get some easy buckets,\" Memphis coach Dave Joerger said. \"Our guys wanted it tonight and we played better and hard and that was a good win for us.\"\nThe Grizzlies led by five after three and neither team scored in the fourth until Trevor Ariza made a pair of free throws with 9:32 left in the quarter. About the only excitement in the beginning of that quarter came when Dwight Howard and JaMychal Green got tangled up fighting for a rebound and pushed each other, drawing a technical foul for both players.\nThe Rockets were down by eight in the third quarter before they used a 9-3 run, with six points from Harden, to get within 66-64 with 8 1/2 minutes left in the quarter. But an 8-2 spurt by Memphis after that pushed the lead to 74-66 just a 1 1/2 minutes later.\nHarden hit a 3-pointer soon after that, but Houston's offense went cold after that and the Rockets didn't make another field goal until a layup by Pat Beverley with 2:18 left in the quarter.\nThose were the first of five straight points for the Rockets that get them to 80-77 with just over a minute left in the quarter.\nThe Grizzlies led by as many as 12 in the first half, but Houston cut it to 56-53 at halftime.\nTIP-INS\nGrizzlies: Improved to 9-0 when leading at the half. ... Mike Conley added 19 points for Memphis. ... Marc Gasol had 11 points and 16 rebounds.\nRockets: Beverley returned after missing five games with a sprained left ankle. He had four points and two assists. ... Howard finished with 12 points, five rebounds and three steals.\nDEKKER'S HEALTH\nHouston rookie first-round pick Sam Dekker was back with the team on Wednesday after having surgery on Friday to repair a herniated disk in his back. No exact timetable has been set for his return but he will likely have to sit out for at least three months. But he's already itching to get back on the court and hopes it doesn't take that long. \"With how I like to do things, hopefully we can get back as soon as possible,\" he said. \"I already began the rehab process.\"\nQUOTABLE\nBickerstaff on the Houston's shooting: \"We can't take shots just because I'm open. We've got to take shots because we believe we're going to knock them down.\"\nUP NEXT\nGrizzlies: Host the Hawks on Friday night.\nRockets: Host the 76ers on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994471.424233
}