{
  "game_id": "0022201205",
  "espn_id": "401469360",
  "date": "Apr 07, 2023",
  "matchup": "ATL vs. PHI",
  "headline": "76ers rest all 5 starters, still beat Hawks 136-131 in OT",
  "body": "ATLANTA -- — The Philadelphia 76ers managed to gain momentum for the playoffs even while resting all their starters.\n\n\r\n              It's easy to see why coach Doc Rivers was giddy afterward.\n\n\r\n              Georges Niang scored 24 points, including a decisive 3-pointer with 12 seconds remaining in overtime, as the 76ers used a lineup of backups to beat the Atlanta Hawks 136-131 on Friday night.\n\n\r\n              “I wanted to win the game,” Rivers said. “I thought it would be good for our guys. I thought this could be an important game for our role players. ... I was into this. This was a lot of fun.”\n\n\r\n              Niang scored eight points in overtime. Jalen McDaniels scored 24 points with 11 rebounds for the 76ers, who were already locked into the No. 3 seed in the Eastern Conference playoffs. Philadelphia will play Brooklyn in the first round.\n\n\r\n              Rivers assembled a lineup of backups that included Jaden Springer, who had a career-high 19 points only hours after his arrival from the G League.\n\n\r\n              “I wanted to show them I can go out and compete and help them out in any way they needed me to,” Springer said.\n\n\r\n              Despite the loss, the Hawks clinched the No. 8 spot in the Eastern Conference play-in tournament with Toronto's 121-102 loss to Boston.\n\n\r\n              Trae Young scored 27 points and set a career high 20 assists but he also committed nine turnovers in a disappointing showing by the Hawks, who led by 15 points in the third quarter. The Hawks saw their three-game winning streak end.\n\n\r\n              “We have to be consistent with what's going good,” Young said, adding the loss would mean “going back to the film room and understand what got us there” in the three-game winning streak.\n\n\r\n              Young's jumper gave Atlanta the lead before Springer offensive rebound and basket tied the game at 119 with 25 seconds remaining in regulation. Young dribbled down the shot clock before his air ball set up the overtime.\n\n\r\n              The 76ers, held out all five regular starters — Tobias Harris, P.J. Tucker, Joel Embiid, Tyrese Maxey and James Harden. Sixth man De'Anthony Melton also missed the game.\n\n\r\n              Rivers wouldn't commit to playing his regulars in Philadelphia's final regular-season game at Brooklyn on Sunday.\n\n\r\n              “I won't tell you that, but we have a plan,” Rivers said before the game.\n\n\r\n              Rivers said the issue of resting starters in late-season games when postseason seeds are set “hasn't changed since ever. It's always been the case. ... We have to do what's good for our team.”\n\n\r\n              Hawks coach Quin Snyder said the loss was “obviously not the result we wanted” but he cautioned against letting the loss hurt his players' confidence.\n\n\r\n              “Obviously, the postseason is where your focus is,” Snyder said. “We need to make sure we do what we need to do as far as our guys being rested. At the same time, we shouldn't let tonight's game be some dramatic statement about where we are.”\n\n\r\n              DOUBLE-DOUBLES\n\n\r\n              Shake Milton had 15 points and 15 assists, and Montrezl Harrell added 11 points and 10 rebounds as the 76ers had three players post double-doubles.\n\n\r\n              SOBERING SUGGESTION\n\n\r\n              After helping the Delaware Blue Coats win the NBA G League, Mac McClung and Springer flew to Atlanta to join the Sixers on Friday. Rivers said he warned the two “to watch their consumption” when celebrating the G League title on Thursday night because they would be playing on Friday night.\n\n\r\n              Springer was named the G League Finals MVP after averaging 34 points in two wins over the Rio Grande Valley Vipers. McClung's 3-pointer late in the third period cut Atlanta's lead to 86-84.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Maxey (neck stiffness) missed his second consecutive game. Injury designations also were listed for Embiid (right calf recovery), Harden (left Achilles injury recovery), Tucker (right calf tightness), Melton (right calf tightness) and Harris (left hip). \n\n\r\n              Hawks: F De'Andre Hunter (left knee) had 14 points in his return after missing four games.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Close regular season at Brooklyn on Sunday.\n\n\r\n              Hawks: Visit Boston on Sunday to end regular season.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994801.367884
}