{
  "game_id": "401809963",
  "espn_id": "401809963",
  "date": "Oct 26, 2025",
  "matchup": "MIA vs NY",
  "headline": "Powell scores 29 as Heat beat Knicks 115-107 in Miami's home opener",
  "body": "MIAMI -- — Norman Powell scored 29 points, Bam Adebayo added 19 points and 13 rebounds and the Miami Heat beat the New York Knicks 115-107 on Sunday night.\n\n\r\n              Jaime Jaquez Jr. finished with 17 points for the Heat, who won their home opener. Miami has scored 382 points so far, the most by any Heat team in three games to open a season. The 2019-20 Heat scored 360.\n\n\r\n              It was Miami's first home game since the news last week that guard Terry Rozier was placed on leave by the NBA after federal officials charged him for alleged involvement with a scheme that helped gamblers beat sportsbooks on certain wagers.\n\n\r\n              Jalen Brunson scored 37 points and Mikal Bridges had 20 for New York, which was within 82-81 after a 3-pointer from OG Anunoby late in the third quarter. But the Heat went on a game-deciding spurt from there, outscoring New York 23-6 over the next seven minutes for an 18-point lead.\n\n\r\n              They needed that cushion, too. New York got within 110-105 on a basket by Brunson with 1:32 left, before Andrew Wiggins' 3-pointer on the next possession steadied things for Miami.\n\n\r\n              The Knicks were seeking what would have been the franchise's second 3-0 start in the last 26 seasons; they were 3-0 to open the 2012-13. They also went 3-0 against Miami last season, scoring exactly 116 points in each of those games.\n\n\r\n              New York came into the game having had a 61-33 edge in free throws attempted this season, a factor in its two early wins. The Heat got to the line 31 times compared with 21 for the Knicks on Sunday.\n\n\r\n              Karl-Anthony Towns had a 15-point, 18-rebound night for New York. Simone Fontecchio scored 14 for Miami.\n\n\r\n              Up next\r\n              Knicks: Visit Milwaukee on Tuesday.\n\n\r\n              Heat: Host Charlotte on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042505.259673
}