{
  "game_id": "0022300779",
  "espn_id": "401585407",
  "date": "Feb 14, 2024",
  "matchup": "MIA @ PHI",
  "headline": "Bam Adebayo has 23 points and 14 rebounds in Heat's 109-104 victory over 76ers",
  "body": "PHILADELPHIA -- — Bam Adebayo had 23 points and 14 rebounds to help the Miami Heat beat the Philadelphia 76ers 109-104 on Wednesday night in the final game for both teams before the NBA All-Star break.\n\n\r\n              Adbebayo’s thundering dunk capped off a 10-2 run in the fourth quarter that gave Miami a lead it never relinquished.\n\n\r\n              Tyler Herro also had 23 points, and Duncan Robinson added 20 in the Heat’s second victory in two nights and fourth in five games. Miami won at Milwaukee on Tuesday night\n\n\r\n              “You always want to go into the All-Star break on a good note,” Adebayo said. “To get two signature wins like that, it shows that if we believe we can do it, we can get stuff done. Even if we don’t have a lot of guys.”\n\n\r\n              Tyrese Maxey scored 30 points for Philadelphia. Buddy Heild had 22 points and 10 assists, and Paul Reed, filling in for the injured Joel Embiid (left knee meniscus procedure), added 18 points and 12 rebounds.\n\n\r\n              The game was back and forth from start to finish with 21 lead changes and 15 ties.\n\n\r\n              “We wanted to make it ugly, honestly,” Herro said. “Just figure out a way how we can get ourselves in a position to win the game at the end. And we did that. We made a few more plays than they did in the fourth quarter and were able to get the win.”\n\n\r\n              With Miami down a point, Haywood Highsmith hit a 3-pointer, Herro made a running layup, Robinson hit another 3-pointer and Adebayo had the dunk on four straight fourth quarter possessions for Miami.\n\n\r\n              “I was encouraged to see the commitment to do the tougher things defensively and I saw a lot of those plays in the last six minutes of the game,” Miami coach Erik Spoelstra said.\n\n\r\n              Maxey briefly left the court hobbled after Reed stepped on his ankle, and the Heat took a one-point lead after three quarters. Maxey returned for the fourth quarter, but Philadelphia missed six of seven shots and had two turnovers.\n\n\r\n              “We turned down a couple of open threes and tried to drive but it was a tough drive because Bam was sitting underneath the basket the whole game,” Philadelphia coach Nick Nurse said. “You’re going to have to go finish after you beat your guy. You have to go finish over him in some fashion.”\n\n\r\n              The 76ers were able to close within three points in the final minute, but the Heat withstood the push, making their final three baskets on second chance plays after getting an offensive rebound.\n\n\r\n              “People just want to see big individual scoring nights,” Spoelstra said. “But those are winning plays. Those extra possessions were huge for us.”\n\n\r\n              Kyle Lowry, who signed with Philadelphia on Tuesday and played for the Heat earlier this season, was unavailable.\n\n\r\n              Philadelphia also played without Nico Batum (left hamstring strain), Robert Covington (left knee bone bruise), Tobias Harris (left hip impingement) and De’Anthony Melton (back; lumbar spine stress response).\n\n\r\n              Miami was without Jimmy Butler (personal reasons), Josh Richardson (right shoulder dislocation), Terry Rozier (right knee sprain) and Dru Smith (right knee surgery).\n\n\r\n              UP NEXT\n\n\r\n              Heat: At New Orleans on Friday, Feb. 23.\n\n\r\n              76ers: Host New York Thursday, Feb. 22.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996677.9646988
}