{
  "game_id": "0022001067",
  "espn_id": "401307881",
  "date": "May 16, 2021",
  "matchup": "BKN vs. CLE",
  "headline": "Durant, Irving power Nets past Cavs for No. 2 seed in East",
  "body": "NEW YORK -- — Blake Griffin started it with a behind-the-back pass and Kevin Durant finished it by slamming down a toss off the backboard.\n\n\r\n                    The Brooklyn Nets saved their best for last, ending the regular season with their highlight play of the season.\n\n\r\n                    Now it's time to forget that and everything else that's already happened.\n\n\r\n                    “Whatever we did so far is out the window,” Kevin Durant said.\n\n\r\n                    “It’s a new season for us and I think that’s the mentality we all want to have. We did some solid things throughout the regular season but we just want to continue to keep getting better but realize that the regular season is over, it’s a new vibe for us.”\n\n\r\n                    Durant had 23 points, 13 assists and eight rebounds and the Nets took the No. 2 seed in the Eastern Conference by beating the Cleveland Cavaliers 123-109 on Sunday night.\n\n\r\n                    Kyrie Irving added 17 points and joined an elite list of shooters for the Nets, who will open the playoffs next weekend against either Boston or Washington. They meet Tuesday in the play-in tournament to determine the No. 7 seed.\n\n\r\n                    Durant made his first eight shots, including the dunk to finish the standout play, to bounce back nicely from a 4-for-17 outing Saturday. It was a strong finale to his first season back after missing 2019-20 while recovering from a ruptured Achilles tendon.\n\n\r\n                    The Nets rested James Harden after he played the last two games following an 18-game absence with a right hamstring strain. That meant Brooklyn finished the regular season with just eight appearances from its Big Three, going 6-2.\n\n\r\n                    But the Nets still managed to finish 48-24, holding off Milwaukee for the No. 2 seed and setting a franchise record for the most games over .500 at any point in a season.\n\n\r\n                    “I think the goal for us was to try to be as healthy as possible by the end of the year and to keep everyone on the same page and excited about what we’re doing, so mission accomplished there,” Nets coach Steve Nash said. \n\n\r\n                    Collin Sexton scored 16 points but was ejected midway through the third quarter for a flagrant foul against Durant. Durant was originally called for the foul, but replay showed Sexton elbowed Durant in the face on his drive, so the call was changed to a Flagrant 2, which carries an automatic ejection.\n\n\r\n                    Isaac Okoro and Dean Wade had 18 points for the Cavaliers. They sat Kevin Love and a number of other players in their 13th loss in the last 14 games of a 22-50 season.\n\n\r\n                    Coach J.B. Bickerstaff said he thanked his players, calling them a pleasure to coach.\n\n\r\n                    “We talked about all the ups and downs that we’ve seen this year and we never had a bad day of work,” he said.\n\n\r\n                    Irving shot 7 for 11 from the field and 3 for 3 from 3-point range. He finished at 50.6% overall, 40.2% from behind the arc and 92.2% on free throws, becoming the ninth player to finish a 50/40/90 season. Nash did it four times and Durant did it once.\n\n\r\n                    The Nets led 67-56 at halftime, with their final basket coming on the play that had fans and players out of their seats. Griffin grabbed a loose ball out of the air and in one motion threw it behind his back ahead to Irving, who passed it ahead to James. James tossed it high off the backboard for a sprinting Durant to slam down.\n\n\r\n                    James, recently signed for the rest of the season after a pair of 10-day contracts, worried that he would be in trouble if Durant hadn't finished the dunk.\n\n\r\n                    “I’m just glad he caught it because like I said, my Nets career could have been really short,” he said.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Darius Garland sat out after returning from a seven-game absence with a sprained left ankle to play Friday against Washington. ... Ending a season in which team outings were largely impossible because of coronavirus protocols, Bickerstaff said the Cavs had an outdoor rooftop dinner in Brooklyn.\n\n\r\n                    Nets: Brooklyn finished 18-3 at home against the East. ... James had 14 points and Jeff Green scored 13.\n\n\r\n                    FOR THE FRO\n\n\r\n                    The Nets played a video tribute for Jarrett Allen in his first game in Brooklyn since being dealt to Cleveland in January as part of the multiteam deal for Harden. He got a warm ovation when the starting lineups were announced and some fans chanted his name when he shot free throws in the first quarter.",
  "source": "espn_api",
  "crawled_at": 1764997466.786981
}