{
  "game_id": "0021801021",
  "espn_id": "401071694",
  "date": "Mar 14, 2019",
  "matchup": "CLE @ ORL",
  "headline": "Gordon, Augustin help Magic rout Cavaliers 120-91",
  "body": "ORLANDO, Fla. --  For one night, the Orlando Magic did almost everything right. The Cleveland Cavaliers didn't do much of anything at all.\n\n\"We knew that we had to respond tonight and play a better game, which we did,\" Orlando center Nikola Vucevic said. \"We played really well from the beginning.\"\n\nAaron Gordon scored 21 points, D.J. Augustin added 20 points and seven assists and the Magic routed the Cavaliers 120-91 on Thursday night. Vucevic had 19 points and 11 rebounds.\n\nThe Magic won for only the second time in six games while chasing the final Eastern Conference playoff spot. The won left them a game and a half behind eighth-place Miami.\n\n\"Every game moving forward for us, the margin of error is getting slimmer and slimmer -- almost to none,\" Vucevic said. \"We have to get on a run now if we want to get back in the eighth spot.\"\n\nIt was the first of five straight home games for the Magic, the first four against losing teams.\n\n\"We're aware of the situation. We know our schedule, so we know we have to take advantage of that stretch of games,\" Orlando swingman Evan Fournier said.\n\nCollin Sexton scored 23 points for the Cavaliers, his fourth straight game over 22 points.\n\nEight Magic players contributed to 45.3 percent 3-point shooting, making 14 of 31 attempts. Cleveland also shot 31 threes, but made only seven.\n\n\"I just liked the way we approached the whole game. This is one of the better games we've played,\" said Magic coach Steve Clifford. \"Since the All-Star break, we've had three or four good ones, but none any better than that.\"\n\nJordan Clarkson came off the bench for 15 points for Cleveland. The Cavs beat the Magic by 14 points at Cleveland on March 3.\n\nGordon, Fournier and Terrence Ross made 3-pointers in a 15-0 run that left the Magic with a 44-20 lead early in the second quarter. Cleveland went more than five minutes without scoring during that stretch and never recovered.\n\nA 3-pointer by Kevin Love cut the margin to 17 a few minutes later, but that is as close as the Cavaliers would get.\n\n\"It seemed like it was one of those days where you've got to give a lot of credit to them,\" Love said. \"They played extremely hard. Obviously they've got something to play for, and a lot of things just didn't go our way.\"\n\nTIP-INS\n\nCavaliers: The Cavs have lost only four of their last 24 games against Orlando, including two this season. ... After missing the preceding game with a foot injury, Love had 10 points and eight rebounds in 24 minutes.\n\nMagic: The Magic are 12-11 while using the same starting lineup in 23 straight games. ... C Khem Birch had his first double-double of the season with 13 points and 11 rebounds. . . . F Jonathan Isaac has made 44.4 percent of his 3-point shots over the last 16 games after shooting 26.5 percent in his first 48.\n\nUP NEXT\n\nCavaliers: At Dallas on Saturday night.\n\nMagic: Host Atlanta on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994740.540357
}