{
  "game_id": "0022400210",
  "espn_id": "401704776",
  "date": "Nov 10, 2024",
  "matchup": "MEM @ POR",
  "headline": "Jaren Jackson leads Memphis with 20 points in 134-89 rout of the Blazers",
  "body": "PORTLAND, Ore. -- — Jaren Jackson Jr. had 20 points and seven rebounds, and the Memphis Grizzlies routed the Portland Trail Blazers 134-89 on Sunday night. \n\n\r\n              Jake LaRavia added 18 points off the bench for the Grizzlies, who led by as many as 45 points and has won five of their last six games. \n\n\r\n              Jerami Grant scored 20 points for Portland, which has lost three straight. \n\n\r\n              Memphis was missing Ja Morant, who is day-to-day with an injured right hip, and Marcus Smart and Desmond Bane.\n\n\r\n              The Grizzlies jumped out to a 31-17 lead after the first quarter and led by as many as 25 in the first half. \n\n\r\n              It was the first meeting between Memphis' rookie Zach Edey and Portland's Donovan Clingan since the 2024 NCAA championship game when Clingan and UConn defeated Edey's Purdue. \n\n\r\n              Clingan finished with 13 points and Edey had 12. \n\n\r\n              Takeaways\r\n              Grizzlies: The Grizzlies went into the game leading the league in points in the paint with 60.8. They had 58 against the Blazers. ... Memphis' 5-foot-8 Rookie Yuki Kawamura came into the game in the fourth quarter to applause from the Blazers fans. \n\n\r\n              Trail Blazers: The Blazers held a moment of silence before the game for former broadcaster Brian Wheeler, who passed away on Friday at age 62.He was the voice of the Trail Blazers from 1998-2019. \n\n\r\n              Key Moment\r\n              In the opening quarter Edey boxed out Clingan and popped out the rebound to Scotty Pippen Jr., who made the 3-pointer to put the Grizzlies up 29-11 and the rout was on. \n\n\r\n              Key Stat\r\n              The Blazers dug a deep hole in the first half, shooting just 17 of 49 from the floor. They were just 1 of 18 from 3-point range. The Blazers finished just 4 of 42 from 3-point range. \n\n\r\n              Up Next\r\n              The Grizzlies visit the Los Angeles Lakers on Wednesday. The Trail Blazers host the Minnesota Timberwolves on Tuesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997757.380966
}