{
  "game_id": "0021900284",
  "espn_id": "401160926",
  "date": "Dec 01, 2019",
  "matchup": "MIA @ BKN",
  "headline": "Heat score final 10 points, edge Nets 109-106",
  "body": "NEW YORK --  Any win on the road is a good one, though Jimmy Butler really liked the way the Miami Heat got their latest.\n\nDown seven with 1:45 to play, they had to play almost perfect -- and on defense, they sure did.\n\n\"I think we finally showed ourselves what we're capable of when we guard,\" Butler said. \"If we don't make shots the way we normally make shots, there's still a way to win and we have to find that way to win. Tonight was a prime example of that.\"\n\nGoran Dragic scored 24 points, including a three-point play that kicked off a closing 10-0 burst, and Butler added 20 as the Heat rallied to beat the Brooklyn Nets 109-106 on Sunday.\n\nBam Adebayo had 17 points and 16 rebounds for the Heat, who trailed 106-99 but pitched a shutout from there and got the victory thanks largely to the aggressiveness of Butler. He kept attacking the rim and had five free throws in the closing run, overcoming his 5-for-17 shooting from the field.\n\n\"What it shows is the mental toughness of great players,\" Heat coach Erik Spoelstra said. \"The ball was not going in all night long but when it really gets to crunch time, when you need a bucket or it is going to be game over, he can put it aside, compartmentalize, and make the big plays. He did that.\"\n\nSpencer Dinwiddie scored 29 points and Harris had a season-high 25 for the Nets, who had won six of their previous eight games. But this was one in which they missed the playmaking of Kyrie Irving, who missed his ninth straight game because of a right shoulder injury.\n\nWithout their All-Star guard, they couldn't get into anything against the tough Miami defense down the stretch and had just one basket in the final 4-plus minutes.\n\n\"A few key possessions kind of got away from us,\" Harris said. \"We didn't do just as good of a job as they did down the stretch to execute.\"\n\nThere were 24 lead changes and 12 ties in the game, with the Nets leading 65-58 at halftime after David Nwaba's 3-pointer with 1.1 seconds left.\n\nBrooklyn's lead was one midway through the fourth quarter before Harris made two 3-pointers in less than 30 seconds. Butler answered with a 3 for Miami, but Dinwiddie scored five straight to make it 103-95, the largest lead for either team all game.\n\nIt was 106-99 after another 3 by Harris with 1:45 to play, but that's where the Nets' scoring finished.\n\n\"We had opportunities, tons of opportunities. They made the plays, we didn't. Just one of those see-saw games,\" Nets coach Kenny Atkinson said.\n\nTIP-INS\n\nHeat: Dion Waiters was with the Heat but inactive, a day after returning to practice following his 10-game suspension for an incident on the team plane. He has not played this season but will travel on Miami's three-game road trip. ... Spoelstra said rookie KZ Okpala (strained Achilles tendon) was nearing a return and would hopefully begin working soon with their G League affiliate in Sioux Falls.\n\nNets: Atkinson said he hadn't decided whether Dinwiddie would return to the bench when Irving returns, or continue to start alongside him until Caris LeVert (right thumb surgery) is healthy. \"Lot of things to juggle there, but I think we've got to focus on this group right now and cross that bridge when we get to it,\" he said.\n\nGOOD GRADES\n\nThe Nets went 9-6 in November, their first winning record in the month since 2012. Atkinson praised the way the responded to losing its starting backcourt during a five-game road trip early in the month.\n\n\"You start going into your 13th guy, 14th guy, 15th guy, can those guys come and help you win games?\" Atkinson said. \"And I'd just give our guys, our program, a B+, A in that sense, that we've come out of this thing with the injuries we've had looking in a positive direction. So I feel good about it in that sense.\"\n\nTHOSE GUYS IN GREEN\n\nAmong the travelers in New York on the holiday weekend were two NBA teams who had games Sunday. Boston was visiting the Knicks and was too close for comfort for Spoelstra.\n\n\"It's awkward. We were staying in the same hotel as the Celtics. I wanted to walk right by them,\" he said with a smile. \"But that's this league. Going to talk about our travel coordination and changes.\"\n\nUP NEXT\n\nHeat: At Toronto on Tuesday night.\n\nNets: At Atlanta on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995543.571032
}