{
  "game_id": "0022200170",
  "espn_id": "401468325",
  "date": "Nov 09, 2022",
  "matchup": "LAL @ LAC",
  "headline": "LeBron hurt late in Clippers' 114-101 win over Lakers",
  "body": "LOS ANGELES -- — LeBron James scored 30 points before leaving the court with pain in his left leg late in the Los Angeles Lakers' 114-101 loss to the Los Angeles Clippers on Wednesday night.\n\n\r\n              James felt discomfort in his leg and groin shortly after he backed down Paul George to draw a foul in the paint with less than five minutes to play. James had sat out Monday's game at Utah to rest the persistent pain in his left foot, but he was having one of his best games of the season before his latest physical setback.\n\n\r\n              “I feel good, besides the injury,” James said. “We’ll get pictures on it tomorrow and go from there. Didn't do anything strenuous on the play. When I landed, I felt a little spasm or strain in my groin. Immediately I asked to come out on the next play down.”\n\n\r\n              James said the injury doesn't feel as painful as his groin injury from Christmas 2018 during his first season with the Lakers. He missed a career-high 17 games with that injury.\n\n\r\n              James, on pace to pass Kareem Abdul-Jabbar this season to become the NBA’s career scoring leader, hit four 3-pointers and added eight rebounds and five assists against the Clippers while finishing one shy of his season high in points.\n\n\r\n              “We'll let him see our medical staff first,” Lakers coach Darvin Ham said. “It's just a lot of adversity. He's been trying his heart out just to be there for us and play at a high level. I thought he had it going really, really well tonight. But it's the NBA season, man. You've got to be ready for a little bit of everything, so we'll see what the results are once he gets evaluated and be ready to move forward.”\n\n\r\n              George scored 29 points as the Clippers extended their recent domination of their arena roommates with their ninth consecutive victory over the Lakers. Norman Powell added 18 for the Clippers, who had seven scorers in double figures during their fifth victory in the past six games without injured star Kawhi Leonard, who missed his 10th game this season.\n\n\r\n              The Clippers are unbeaten in the city rivalry since July 2020 and still perfect against the Lakers under coach Tyronn Lue, who took over in October 2020.\n\n\r\n              “I was proud of how we came out in the third quarter and took control of the game again,” Lue said. “Just being able to get it back in the second half and understanding it's a competition, not a show. I know it's the two LA teams, but we're playing to get better every night, so it's not a show.”\n\n\r\n              Anthony Davis had 21 points and nine rebounds for the Lakers, who dropped to 2-9 with their fourth consecutive defeat. Russell Westbrook added 14 points and nine assists, but the Lakers have the NBA's second-worst record so far.\n\n\r\n              John Wall scored 10 points in his return to the Clippers’ bench after sitting out the second game of a back-to-back Monday night. Wall is being cautious with his knee and his comeback after sitting out two of the past three seasons.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Lonnie Walker missed his second straight game with a non-COVID-19 illness. He started the Lakers' first nine games, averaging 15.3 points. ... Patrick Beverley returned from a two-game absence (illness) and scored seven points.\n\n\r\n              Clippers: Luke Kennard moved back into the starting lineup in place of Terance Mann and scored 13 points. ... Chargers stars Keenan Allen, Derwin James and Mike Williams all watched from courtside. ... The Clippers blocked seven shots in the third quarter.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host the Sacramento Kings on Friday.\n\n\r\n              Clippers: Host the Brooklyn Nets on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994152.943243
}