{
  "game_id": "0021700162",
  "espn_id": "400974913",
  "date": "Nov 08, 2017",
  "matchup": "PHX vs. MIA",
  "headline": "Goran Dragic scores season-high 29, Heat beat Suns 126-115",
  "body": "PHOENIX --  Goran Dragic felt right at home at Talking Stick Resort Arena, and it showed.\n\nThe former Phoenix Suns guard scored a season-high 29 points in the Miami Heat's 126-115 victory over the Suns on Wednesday night.\n\nThe Heat made 12 3-pointers, shot a season-best 53.1 percent overall and never trailed. The Suns lost their fourth straight.\n\n\"The rims are friendly,\" said Dragic, who had two stints with Phoenix before being traded to Miami in 2015. \"I've played a lot of games here and yeah, it definitely helps.\"\n\nDragic scored 10 points in the third quarter. The Heat took a 94-86 lead into the fourth and opened the final period with a 7-0 run.\n\n\"Greatness in this league is consistency, and Goran, you can book it every single night what you're going to get from him,\" Heat coach Erik Spoelstra said. \"He had a little bit extra punch to him in this game.\"\n\nPhoenix made it 112-106 on Devin Booker's jumper with 2:53 to play but got no closer.\n\nHassan Whiteside added 23 points, 10 rebounds and a career-high four blocked shots for Miami.\n\nBooker led Phoenix with 30 points, and Mike James had 18.\n\n\"Everyone in the NBA is a good player and you have to realize that and fight back,\" Booker said. \"We keep getting within 10 and can't get over that hump.\"\n\nGuard Dion Waiters, playing in his first game since last Friday, made a layup to give the Heat a 47-31 lead with 9:18 to go in the second quarter for Miami's largest lead of the first half. Waiters was away from the Heat for the birth of his daughter and returned to score 16 points.\n\nThe Suns went on an 11-1 run to cut the lead to six, but Waiters' 3-pointer with 10.8 seconds left gave the Heat a 69-54 halftime advantage. The 69 points was the highest total in a half for the Heat this season.\n\nThe Heat led by 14 points in the first quarter. Phoenix hit five of its last seven shots of the quarter, and cut the lead to 36-27.\n\nSTAREDOWN\n\nWhiteside blocked James' driving dunk attempt with 4:56 to go in the first half, then stared down at the fallen James. Whiteside was a tough matchup inside for Phoenix without big man Tyson Chandler (back spasms) in the lineup.\n\nWhiteside said he looked longer at James because he thought James was shaken up.\n\n\"He put some force behind that dunk. I didn't know he could dunk like that,\" Whiteside said. \"I challenge anybody at the rim. He tried, he definitely had some heart for trying. Not too many guys would try that.\"\n\nTIP-INS\n\nHeat: Justise Winslow started at power forward for the first time this season and had a season-high 14 points and six rebounds. ... Miami's 17.1 turnovers per game were the third-worst in the NBA entering the game, so Spoelstra said he'd like to simplify things on offense. \"Hopefully that can help, but the responsibility and the accepting of that responsibility is the most important thing,\" Spoelstra said. The Heat had 14 on Wednesday. ... G Tyler Johnson did not play due to illness.\n\nSuns: Alex Len made his first start of the season at center, in place of Chandler. ... Newly acquired C Greg Monroe has yet to report to the team. Monroe, who came over in Tuesday's trade that sent Eric Bledsoe to Milwaukee, is dealing with a calf strain. ... Before the game, F Derrick Jones Jr. was recalled from the Northern Arizona Suns of G League.\n\nUP NEXT\n\nHeat: At Utah Friday night.\n\nSuns: Host Orlando on Friday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993922.748663
}