{
  "game_id": "0022200160",
  "espn_id": "401468315",
  "date": "Nov 09, 2022",
  "matchup": "IND vs. DEN",
  "headline": "Jokic overcomes foul trouble, Nuggets rally past Pacers",
  "body": "INDIANAPOLIS -- — Nikola Jokic spent the first three quarters watching his teammates do the dirty work.\n\n\r\n              When he finally returned early in the fourth, the two-time NBA MVP cleaned up.\n\n\r\n              Limited by foul trouble, Jokic scored 24 points in 21 minutes and helped the Denver Nuggets overcome an 18-point deficit in the second half to rally past the Indiana Pacers 122-199 on Wednesday night.\n\n\r\n              “We did enough on defense,” guard Jamal Murray said after scoring 18 points and playing a key role in the comeback. “I think they got a lot of fast-break points in the first half. We limited that in the second half and just contested every shot and we were able to get going on offense, too.”\n\n\r\n              The biggest obstacle for Denver was Jokic's foul trouble.\n\n\r\n              He picked up four fouls in less than 18 minutes, then was whistled for No. 5 just 58 seconds into the second half. He spent the next 13 minutes on the bench as the Nuggets' 3-point shooters finally started fighting back from an 87-69 deficit.\n\n\r\n              They cut it to 95-89 after three quarters and Jokic took care of the rest when he returned. Aaron Gordon had 18 points and tied his career high with 17 rebounds. Denver has won four straight and six of seven.\n\n\r\n              Indiana had a chance to force overtime at the buzzer but Myles Turner's 3 was off the mark.\n\n\r\n              Bennedict Mathurin led the Pacers with 30 points, 23 coming in the first half. Tyrese Haliburton had 21 points and 11 assists.\n\n\r\n              “He's doing things now that no center really has ever done,” coach Rick Carlisle said, referring to Jokic. “He gets his joy from passing the ball and he's certainly an elite scorer.” \n\n\r\n              Jokic didn't need a lot of time to show it.\n\n\r\n              His teammates got Denver within 103-98 when Jokic re-entered and after Michael Porter Jr.'s 3-pointer made it a one-point game, Jokic hit back-to-back short jumpers to finally give the Nuggets a 108-105 lead.\n\n\r\n              Indiana tied the score at 117 on Haliburton's long 2-pointer with 55.2 seconds to go, but Jokic broke the tie with a 20-footer on the ensuing possession to help put it away.\n\n\r\n              The Pacers had a two-game winning streak snapped.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Porter made three 3s to extend his career-best streak to nine games with three or more from beyond the arc. He had 17 points. ... Kentavious Caldwell-Pope added 15 points on a night when Denver had 20 turnovers. \n\n\r\n              Pacers: Scored a season-high 43 points in the second quarter, falling just short of the best scoring half of the season (75). ... Mathurin made eight of his first 10 shots and wound up 6 of 9 on 3s. ... Turner had 14 points and 11 rebounds, and Isaiah Jackson added 17 points and 10 rebounds. ... Indiana rookie Andrew Nembhard started his second straight game and had eight points and five assists.\n\n\r\n              GETTING TECHNICAL\n\n\r\n              Nuggets coach Mike Malone did everything he could to keep Jokic out of foul trouble. A coach’s challenge on Jokic’s third foul was unsuccessful. And when Gordon’s attempt to draw the fourth foul also proved unsuccessful, Malone's response to a fan drew a technical as Jokic walked to the bench with 6:40 left in the first half. The fan was removed.\n\n\r\n              “He was just a little bit too aggressive, in my face,” Malone said. “I don’t react kindly to that, partner.”\n\n\r\n              GETTING TECHNICAL, PART 2\n\n\r\n              Carlisle also got worked up with 22.2 seconds to go when Mathurin was called for a foul. As Carlisle stepped toward midcourt, he was called for a technical. Murray made all three free throws to give Denver a 122-117 lead.\n\n\r\n              “In that moment, you hope for some basketball decency — let a coach vent,” Carlisle said. “Then he calls a technical, which shocked me, really. But it’s my fault.”\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Make the third stop on a four-game road trip Friday at Boston.\n\n\r\n              Pacers: Close out a four-game homestand Saturday against Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994340.555731
}