{
  "game_id": "401809509",
  "espn_id": "401809509",
  "date": "Oct 31, 2025",
  "matchup": "LAC vs NO",
  "headline": "Kawhi Leonard wins it at buzzer, Clippers hold off hot-shooting Pelicans 126-124",
  "body": "INGLEWOOD, Calif. -- — Kawhi Leonard made a buzzer-beater and finished with 34 points to give the Los Angeles Clippers a 126-124 win over the New Orleans Pelicans on Friday night in the first game of the NBA Cup group stage for both teams.\n\n\r\n              Leonard pump-faked to get Jeremiah Fears up in the air and then rose up for a long 2-point shot to win it after Zion Williamson had tied it with 9.6 seconds remaining by making two free throws. \n\n\r\n              James Harden had 24 points and 14 assists, and the Clippers have won all three home games to start the season. Derrick Jones Jr. scored 16 points, and Ivica Zubac had 14 points and 11 rebounds.\n\n\r\n              Jordan Poole had 30 points and made seven 3-pointers, Williamson finished with 29 points, but the Pelicans remained winless through five games. It is their worst start since dropping eight in a row to begin the 2016-17 campaign.\n\n\r\n              The Clippers had led by as many as 17 in the second half but their struggles to defend the Pelicans’ shooting from 3-point range made things harder than they had to be.\n\n\r\n              New Orleans ended up 18 of 37 (48.6%) from 3, but it wasn’t enough to overcome a dynamic showing from Los Angeles, led by Harden as both a scorer and distributor.\n\n\r\n              Harden had 14 points and five assists in the second quarter alone, including a four-point play when Yves Missi didn’t give him room to land on a long 3.\n\n\r\n              Up next\r\n              Pelicans: Visit the Thunder in Oklahoma City on Sunday.\n\n\r\n              Clippers: Host the Heat on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042538.017117
}