{
  "game_id": "0021800963",
  "espn_id": "401071636",
  "date": "Mar 05, 2019",
  "matchup": "OKC @ MIN",
  "headline": "Towns scores 41 to derail OKC, George's return",
  "body": "MINNEAPOLIS -- Karl-Anthony Towns is putting up impressive offensive numbers. All he cares about, though, are wins.\nAnother huge night from Towns helped Minnesota snap a three-game losing streak Tuesday. The star center had 41 points and 14 rebounds as the Timberwolves spoiled Paul George's return to the Oklahoma City lineup with a 131-120 victory over the Thunder.\nTowns has 182 points over his past five games, the best five-game stretch in team history. He fell one point shy of tying his season high.\n\"You can have all the numbers you want, but you don't ever want to be the guy that's getting good stats on a losing team,\" Towns said. \"We've got to find ways to win. I'd rather have less stats and have more wins than to do what I've been doing recently.\"\nTowns scored 16 in the third quarter as Minnesota kept its foot on the gas after taking a 14-point lead into halftime. He capped the victory with a thunderous dunk to give him his second 40-point game of the season.\nThe Timberwolves have won all three meetings with the Thunder and are 6-1 against Oklahoma City since the beginning of last season.\nDerrick Rose added 19 points and Andrew Wiggins scored 18 for Minnesota, which began the night six games out of a playoff spot.\nThunder guard Russell Westbrook had 38 points on 15-of-28 shooting.\nGeorge was back on the court after missing three games with a right shoulder injury. He scored 25 points but was 8-of-25 from the field, including 4-for-14 from 3-point range.\n\"The rhythm was off a little bit, not only for myself, but just the rhythm with my guys out there,\" George said. \"But I feel fine.\"\nRose scored eight points in the final 2:04 of the first quarter to push Minnesota's lead to 30-22 after one. The Thunder had erased a 10-point deficit before Rose's late outburst put the Timberwolves back on top.\nAfter picking up two fouls early in the first quarter, Towns got hot in the second quarter. He scored six straight Timberwolves points and finished the half with 15.\nTowns' 41-point effort in just 30 minutes came two games after he scored a season-high 42 at the Indiana Pacers. He closed the game against Oklahoma City with 10 points and five rebounds in the fourth quarter.\n\"Everybody followed KAT,\" Rose said. \"When he's got things rolling like that, it's hard to miss him out there, so we just tried to play through him and we tried to keep this thing going.\"\nOklahoma City never led by more than three and couldn't get closer than nine in the fourth quarter.\n\"At the end of the 48 minutes, we scored 120 points,\" Thunder coach Billy Donovan said. \"That's more than enough, so for us, it's on defense.\"\nTIP-INS\nThunder: They also will face the Portland Trail Blazers, LA Clippers and Utah Jazz on their four-game road trip before returning home March 13. ... G Dennis Schroder picked up a technical foul midway through the second quarter, his ninth of the season. ... Oklahoma City had won seven of its previous 10 at Minnesota.\nTimberwolves: F Luol Deng missed his third straight game with a sore left Achilles tendon. Deng was averaging 9.3 points and 4.1 rebounds in his past 12 games after playing sparingly most of the season. ... Towns moved into fifth place on Minnesota's career scoring list, passing Wally Szczerbiak (6,777 points). ... Wiggins averaged 35 points in the first two games against Oklahoma City this season.\nOVERCOMING EARLY FOULS\nTowns had just two points in 3:22 before sitting out the rest of the first quarter due to foul trouble. He said he had to make adjustments to avoid getting into further foul trouble.\n\"I work tremendously hard on my craft to be able to go to another bag, a bag that requires less contact and more skill shots,\" Towns said. \"It worked out.\"\nUP NEXT\nThunder: At Portland on Thursday.\nTimberwolves: Visit the Detroit Pistons on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994562.495195
}