{
  "game_id": "0022300344",
  "espn_id": "401584972",
  "date": "Dec 17, 2023",
  "matchup": "ORL @ BOS",
  "headline": "Jaylen Brown's big 4th quarter carries Celtics to 114-97 win over Magic for 14-0 start at home",
  "body": "BOSTON -- — Boston Celtics center Kristaps Porzingis has a message for teams coming into TD Garden.\n\n\r\n              “For a visiting team to come into this building and beat us, its got to be a special night for them and we totally believe that,” he said after the Celtics beat the Orlando Magic 114-97 on Sunday to improve to an NBA-best 14-0 at home.\n\n\r\n              Jaylen Brown scored 17 of his 31 points in the fourth quarter for Boston, which made 17 3-pointers.\n\n\r\n              It’s the Celtics’ second-best start at home, behind the 1957-58 club led by Bill Russell that opened with 17 straight wins the fall after capturing the first of its 17 NBA titles. The Celtics have won five straight overall to improve to 20-5, a half-game ahead of Minnesota for the NBA lead.\n\n\r\n              “I think we're starting to play what I would call Celtic basketball,” Boston coach Joe Mazzulla said. “From a mentality standpoint, from a toughness standpoint, from defensive standpoint and identity.” \n\n\r\n              Jayson Tatum added 23 points, Porzingis had 15 points and 10 rebounds, and Jrue Holiday scored 14 points for Boston, which completed a sweep of consecutive games at TD Garden against the Magic.\n\n\r\n              Paolo Banchero led Orlando with 36 points and 10 rebounds. Jalen Suggs added 13 points for the Magic, who shot just 38.2%.\n\n\r\n              Porzingis and Al Horford returned to Boston’s lineup after missing Friday’s 17-point victory. Porzingis was sidelined with a calf injury and the 37-year-old Horford for rest after playing a game the night earlier.\n\n\r\n              “I wouldn't say impossible,'” Banchero said when asked about the difficulty of stopping the Celtics when they're making 3s. “I would say they're very hard to stop when the 3-ball is going in like it was today.”\n\n\r\n              The Celtics led by nine entering the final quarter and Brown scored 10 of their initial 12 points to help them keep their distance. He did it from different areas of the floor, connecting on a 3-pointer from both the top of the key and right corner to go along with left baseline and foul-line jumpers.\n\n\r\n              He added a transition 3 that gave Boston a 103-86 edge with 6:25 to play and closed his big final quarter with a fadeaway from the right wing.\n\n\r\n              “When my 3-ball is going in, I don't think there's anybody, anything anybody can do,” Brown said. “I'm going to be aggressive getting to the basket, which everybody knows I want to do. When that 3-ball is going in at a high clip, it makes it tough (to guard me).” \n\n\r\n              Tatum picked up his third foul midway into the second quarter when Magic coach Jamahl Mosley challenged a blocking call against Franz Wagner, but that didn’t hurt the Celtics’ offense.\n\n\r\n              The Celtics just went on a run with Tatum on the end of the bench.\n\n\r\n              The teams were tied at 41 after Banchero’s jumper with 5:48 left in the half before Brown scored nine points during a 20-5 surge over a stretch of nearly five minutes that pushed the Celtics to a 61-50 halftime edge.\n\n\r\n              The Magic tried playing some zone defense during the stretch, it just didn’t slow down Boston’s spurt.\n\n\r\n              “This is not a moral victory,” Mosley said. “We competed, we're growing. Those are great things and that's the truth. The reality is these guys are not happy about not getting the game because they feel they're at a good level of basketball and we can compete against the best teams.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: Host the Heat on Wednesday night.\n\n\r\n              Celtics: At the Warriors on Tuesday, the first of four straight on the West Coast.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995725.610633
}