{
  "game_id": "0022100998",
  "espn_id": "401360817",
  "date": "Mar 11, 2022",
  "matchup": "MIA vs. CLE",
  "headline": "Adebayo scores 30 points, Heat pull away to beat Cavs",
  "body": "MIAMI -- — The Miami Heat are campaigning for Bam Adebayo to get defensive player of the year consideration.\n\n\r\n              Their center reminded them again that he's pretty good at the other end of the floor, too.\n\n\r\n              Adebayo led the way with 30 points and 17 rebounds, and a pair of big third-quarter runs helped the Heat beat the Cleveland Cavaliers 117-105 on Friday night.\n\n\r\n              “I thought he played a great, all-around, winning basketball game,\" Heat coach Erik Spoelstra said. “He impacted the win as much as anybody on both ends of the court.\"\n\n\r\n              Adebayo was 11 for 16 from the field, 8 for 8 from the line.\n\n\r\n              Jimmy Butler scored 24 points, Tyler Herro added 22 and Max Strus finished with 17 for the Heat, who improved to 16-7 in games following a loss. The Heat had a 13-0 run early in the third to open up an eight-point lead, then had 11-0 run later in the quarter to build what was an 84-67 lead.\n\n\r\n              “It felt like everybody had 30 tonight,\" Adebayo said.\n\n\r\n              Darius Garland had 24 points and 10 assists for Cleveland, which has lost seven of its last 10 games. The Cavaliers were bidding to sweep the Heat for the first time since the 2009-10 season; instead, they fell to 1-21 in their last 22 trips to Miami, with the win coming earlier this season.\n\n\r\n              Evan Mobley had 19 points and 12 rebounds for the Cavs, who got 15 points from Lauri Markkanen and 11 from Kevin Love.\n\n\r\n              Cleveland turned the ball over 18 times to Miami's nine, and got outscored 30-10 off turnovers.\n\n\r\n              “Turnovers. They cost you,\" Cleveland coach J.B. Bickerstaff said. “They do a great job of forcing them and then they do a great job of converting after.\"\n\n\r\n              The Heat (45-23) moved 2 1/2 games clear of idle Milwaukee in the Eastern Conference standings, plus three games up on Philadelphia and four games ahead of Chicago — which leads Boston by percentage points for the East’s No. 4 spot. Cleveland remained sixth, six games back of the Heat but still ahead of Toronto in the race for the final playoff berth outside of the play-in round.\n\n\r\n              Cleveland’s biggest lead was five, coming early in the third quarter. The Cavs opened the half on a 6-0 run, making their first two shots.\n\n\r\n              The rest of the third was all Miami.\n\n\r\n              Butler and Adebayo each had five points in the 13-0 spurt that put the Heat up for good; they each had four points in the 11-0 run later that gave Miami the 17-point lead.\n\n\r\n              Miami was without Caleb Martin, who took an awkward fall in Wednesday in a loss to Phoenix and hyperextended his left knee. It was no worse than that, though, and the Heat held him out despite his efforts to convince Spoelstra otherwise before the game.\n\n\r\n              “Considering how awkward it looked, this is great news,” Spoelstra said.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Cleveland missed its first nine shots. ... The Cavs aren’t sure how long All-Star center Jarrett Allen (broken finger on his left hand) will be out. “There’s a process of seeing the specialist and then ... there’s decisions that have to be made on the treatment to rehab,” Bickerstaff said. ... Caris LeVert (sprained right foot) did a pregame on-court workout but missed his eighth consecutive contest.\n\n\r\n              Heat: Victor Oladipo played 17:35 in his third outing of the season, coming in a five-night span. He will sit Saturday on the second night of a back to back. ... Miami had its usual starters — Adebayo, Butler, P.J. Tucker, Kyle Lowry and Duncan Robinson — together for just the 25th time in 68 games this season. ... Miami’s 9-0 run to start the game matched its best spurt to open a contest this season. The Heat also led New York 9-0 on Jan. 26. ... At 45-23, the Heat are on pace to finish with the seventh-best record in the franchise’s 34 seasons.\n\n\r\n              I KNOW YOU\n\n\r\n              Spoelstra played with Mobley’s father, Eric Mobley, in college at Portland. “He just looks exactly like him,” Spoelstra said.\n\n\r\n              1,000 DOWN\n\n\r\n              The game was the 1,000th to be completed in the NBA this season. Starting Saturday, the league will have 227 games remaining of the scheduled 1,230 that will be played before the play-in tournament begins in a month.\n\n\r\n              WINNERS AGAIN\n\n\r\n              All Cleveland needs is four wins in its final 16 games to finish with a winning record this season. It’ll be the first time a Cavaliers team — without LeBron James — finishes over .500 since the 1997-98 squad went 47-35.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Chicago on Saturday.\n\n\r\n              Heat: Host Minnesota on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992629.027925
}