{
  "game_id": "0022300905",
  "espn_id": "401585533",
  "date": "Mar 07, 2024",
  "matchup": "TOR @ PHX",
  "headline": "Kevin Durant scores 35, Grayson Allen adds 26 and the Suns beat the Raptors 120-113",
  "body": "PHOENIX -- — Kevin Durant scored 35 points, Grayson Allen added 26 and the Phoenix Suns beat the Toronto Raptors 120-113 on Thursday night.\n\n\r\n              Bradley Beal had 20 points and eight assists for the Suns, who never trailed. Durant shot 11 of 19 from the field while Allen did all of his scoring in the first half, setting a franchise record with seven 3-pointers in the first quarter.\n\n\r\n              “I got hot on the first few and then guys started looking for me,” Allen said.\n\n\r\n              Gary Trent Jr. led Toronto with 30 points. Immanuel Quickley added 21 points and a career-high 18 assists, while RJ Barrett scored 23. The Raptors have lost four of five.\n\n\r\n              The Suns — playing without injured All-Star guard Devin Booker — led by 14 at halftime. The Raptors cut that margin to 89-82 entering the fourth and pulled within 96-93 with 7:59 left, but Phoenix's Bol Bol responded with a bucket and Toronto never got closer.\n\n\r\n              “I like where we are right now,” Durant said. “I think we can keep growing. That's the best thing about it — we've still got room to grow as a team. We're getting more and more comfortable as the day goes on.”\n\n\r\n              Bol finished with 11 points and eight rebounds in 16 minutes. The Suns have won 10 of their past 12 at home.\n\n\r\n              Allen made seven 3-pointers in the first quarter, missing his first attempt before nailing seven in a row in the span of about seven minutes. His 21 points helped push the Suns to a 39-25 lead.\n\n\r\n              “It feels good, I'm getting good looks,” Allen said. “I'm getting a mix of in-rhythm looks and quick ones.” \n\n\r\n              Allen was acquired just before the season started in the trade that sent Deandre Ayton to Portland. The sixth-year pro is having his best season, averaging 13 points per game while shooting 47% on 3-pointers, which leads the league.\n\n\r\n              “He knows his role in our system and he’s a great shooter,” Suns coach Frank Vogel said. “Everybody knew he was a good player when he was coming in, but he’s a great player. He’s playing phenomenally for us.”\n\n\r\n              Phoenix took a 67-53 lead into halftime.\n\n\r\n              The Suns — who came into the game as the No. 6 team in the Western Conference — are fighting to stay out of the play-in tournament. The top six seeds in each conference automatically advance to the opening round.\n\n\r\n              Toronto was without All-Star Scottie Barnes, who recently had surgery on his fractured hand. Raptors coach Darko Rajakovic said Allen's performance didn't surprise his team, even if if couldn't do much to stop him.\n\n\r\n              “We were late on our rotations,” Rajakovic said. “We had a clear plan on how we wanted to close out on Grayson Allen, but we just didn't follow through. It's going to be good for us to look at the film and learn from it.”\n\n\r\n              UP NEXT\n\n\r\n              Raptors: At Portland on Saturday.\n\n\r\n              Suns: Host Boston on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995405.267117
}