{
  "game_id": "0022401178",
  "espn_id": "401705744",
  "date": "Apr 11, 2025",
  "matchup": "DAL vs. TOR",
  "headline": "Anthony Davis gets first triple-double of the season to lead Mavericks past Raptors 124-102",
  "body": "DALLAS -- — Anthony Davis had 23 points, 13 rebounds and 10 assists for his fourth career triple-double, and the Dallas Mavericks beat the Toronto Raptors 124-102 on Friday night to snap a three-game losing streak.\n\n\r\n              Davis also had a season-high seven blocks. \n\n\r\n              Reserves Max Christie and Brandon Williams scored 17 points each as the Mavericks pulled away in the second quarter, outscoring the Raptors 31-13. Dallas led by as many as 38 points.\n\n\r\n              Dallas (39-42) will play Sacramento on Wednesday in the Western Conference play-in elimination game matching the ninth- and 10th-place teams.\n\n\r\n              Scottie Barnes scored 26 points and Ochai Agbaji added 24, matching a career high with six 3-pointers, for the Raptors (30-51).\n\n\r\n              The Mavericks enjoyed a 16-0 run in the second quarter and led 66-38 at halftime. Dallas shot 65% in the quarter while Toronto shot 19.4%, missing all nine 3-point attempts and going five minutes without a field goal.\n\n\r\n              Agbaji scored 17 points in the first period to match a team high for a quarter this season.\n\n\r\n              Takeaways\r\n              Raptors: They dressed a season-low eight players and played seven with starters RJ Barrett and Immanuel Quickley added to the injury report for “rest” with one game remaining.\n\n\r\n              Mavericks: They rebounded from Wednesday’s emotional 112-97 loss to the Los Angeles Lakers with Luka Doncic scorching them for 45 points in his return to Dallas following the seismic Feb. 1 trade. Williams returned to the lineup signing a multi-year contract Thursday after his time as a two-way player expired on March 29.\n\n\r\n              Key moment\r\n              Dereck Lively II’s alley-oop dunk from a Davis pass with 10:45 left gave Davis his first triple-double since Feb. 5, 2024 as a Laker.\n\n\r\n              Key stat\r\n              While Barnes and Agbaji combined to shoot 12 of 20 during the first half, the other five Raptors who played shot 3 of 31.\n\n\r\n              Up next\r\n              On Sunday’s close to the regular season, the Mavericks will play at Memphis while the Raptors visit San Antonio.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997125.376139
}