{
  "game_id": "0022401120",
  "espn_id": "401705686",
  "date": "Apr 04, 2025",
  "matchup": "PHX @ BOS",
  "headline": "Celtics break NBA season 3s record in 123-103 victory over the Suns",
  "body": "BOSTON -- — Jaylen Brown scored 31 points and hit three 3-pointers and the Boston Celtics broke the NBA record for 3-pointers in a season in a 123-103 victory over the Phoenix Suns on Friday night.\n\n\r\n              Boston was 14 of 39 from 3-point range to push its season total to 1,370. Golden State held the previous record with 1,363 in 2022-23. \n\n\r\n              After having their nine-game winning streak halted in their previous game, the Celtics coasted to the victory.\n\n\r\n              Jayson Tatum added 23 points, eight rebounds and eight assists. Kristaps Porzingis had 15 points before he walked to the locker room holding a towel to the bridge of his nose early in the final quarter after getting hit by Cody Martin’s elbow while the Suns player was driving to the basket.\n\n\r\n              Porzingis raised both arms and waved to the crowd as he headed into the tunnel. He returned to the bench late in the game and the team said the cut required stitches.\n\n\r\n              Devin Booker led the Suns with 37 points. Phoenix has lost five straight.\n\n\r\n              Boston opened a double-digit edge on Payton Pritchard’s 3-pointer early in the second quarter, pushed it to 20 midway into the period and led by 14 at halftime.\n\n\r\n              Boston beat the Suns by 30 points in Phoenix during a 6-0 trip just over a week ago.\n\n\r\n              Takeaways\r\n              Suns: Bradley Beal returned after missing eight games with a hamstring injury. He looked rusty, going 0 for 7 from the floor — missing all three 3-point attempts. He made one free throw in 30 minutes. … Kevin Durant was out for the second straight with an ankle injury.\n\n\r\n              Celtics: At times, Tatum, Brown and Porzingis seem like they can take turns scoring against certain teams. \n\n\r\n              Key moment\r\n              Pritchard hit a left-wing shot 3:40 into the second quarter for the club’s NBA record 1,364th 3-pointer.\n\n\r\n              Key stat\r\n              The Celtics’ lead never fell into single digits in the second half.\n\n\r\n              Up next\r\n              The Suns are at the Knicks on Sunday, and the Celtics host the Wizards the same night.\n\n\r\n              \r\n                ------\r\n              \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998231.296353
}