{
  "game_id": "0021800399",
  "espn_id": "401071080",
  "date": "Dec 10, 2018",
  "matchup": "PHX vs. LAC",
  "headline": "Harris scores 33, Clippers outlast Suns 123-119 in overtime",
  "body": "PHOENIX --  Overtime has been kind to the Clippers this season, and Los Angeles needed it to overcome a short-handed Phoenix Suns team 123-119 on Monday night.\n\nThe Clippers won their fourth overtime game of the season -- without a defeat. Tobias Harris scored 33 points and Patrick Beverley made two free throws with 33.3 seconds left in overtime to lead the Clippers to victory.\n\nAvery Bradley sealed the Clippers' 17th win of the season with a pair of free throws with 1.6 seconds left, after he hustled to control a loose ball off a jump ball and was fouled.\n\nDanilo Gallinari scored 16 of his 25 points in the second half and Harris added eight rebounds.\n\n\"We won. That's all you need to do on the road,\" Clippers coach Doc Rivers said. \"Once we got to overtime the guys said, `OK we are good.' We're 4-0 now in overtime. Maybe that's where we should start playing games like that.\"\n\nDeandre Ayton led the Suns with 20 points and 12 rebounds, the rookie's 15th double-double of the season. Fellow rookie Mikal Bridges added a career high 19 points, and backup center Richaun Holmes chipped in a season-high 19 points as the Suns lost their ninth straight.\n\nThe Clippers twice led by four points in overtime, but the Suns tied it at 119 on Troy Daniels' reverse layup with 51.3 seconds to play. But those were the last points scored by the Suns.\n\n\"These are games very important for them (the Suns) as players, too,\" Harris said. \"Once we picked our physicality up, that was when we were able to see a lot of things go our way.\"\n\nThe Suns' De'Anthony Melton hit a short baseline fadeaway to tie the score at 111 with 5.5 seconds left in regulation. The Clippers had the final possession of regulation, but Gallinari missed a step-back 3-point attempt at the buzzer with two defenders in his face.\n\nHolmes dunked with 7:09 to play to give the Suns a 104-95 lead. But the Clippers rallied, surging ahead by four, 109-105. Then Bridges hit a 3-pointer for the Suns with 1:16 left, and added a technical foul free throw 18 seconds later to tie it at 109.\n\n\"We gave ourselves a chance to win this game,\" Suns coach Igor Kokoskov said.\n\n\"We're going to learn,\" Bridges said. \"We're young. It's a long season and we're making strides in the right direction.\"\n\nBoth teams were without top scorers for the second half.\n\nClippers guard Lou Williams left the court in the second quarter with what was announced as a sore left hamstring, and didn't return. Williams, who was averaging 17.6 points per game going into Monday, had seven points and four rebounds in 12 minutes.\n\nThe Suns got forward T.J. Warren back from a right ankle injury after he missed the past five games. Warren, however, was ejected for drawing back-to-back technical fouls near the end of the second quarter. He had six points in 12 minutes.\n\nThe Clippers' Montrezl Harrell scored seven points in less than a minute in the second quarter as Los Angeles came back from a 10-point deficit.\n\nLos Angeles went ahead by as many as nine points, 56-47, after Warren's ejection. But the Suns finished the half on a 9-2 run, capped off by Ayton rattling in a 20-footer at the buzzer, and trailed 58-56.\n\nThe Clippers made 15 of 23 shots in the second quarter.\n\nPhoenix took a brief one-point lead, 84-83, late in the third quarter, but the Clippers went into the fourth quarter ahead 88-86.\n\nTIP-INS\n\nClippers: G Milos Teodosic saw action for the first time in four games, having missed the previous three due to a coaching decision. ...  The Clippers have won 10 straight over the Suns, with their last loss coming April 13, 2016.\n\nSuns: Phoenix announced the signing of post player Eric Moreland right after tipoff. The 6-foot-10 Moreland, 26, has played for Sacramento and Detroit. ...  For the fourth time this season, the Suns started three rookies -- Melton, Ayton and Bridges. ... The Suns were without guard Devin Booker, inactive for the fourth straight game with a hamstring strain, and guard Jamal Crawford, who was out with a sore left knee.\n\nDANIELS LEAVES, RETURNS\n\nDaniels crumpled to the floor with less than a minute to play trying to defend in the key, and had to be helped to the locker room. He returned for overtime.\n\nBLOCKED AND BLOCK\n\nAyton tried to go up strong with the ball in the paint midway through the first quarter, only to have his shot blocked by Boban Marjanovic. But Ayton got back on defense to swat away Shai Gilgeous-Alexander's layup attempt at the other end.\n\nUP NEXT\n\nClippers: Host Toronto on Tuesday night, their fifth back-to-back set of games this season.\n\nSuns:  At San Antonio on Tuesday night, their fourth back-to-back set of games this season.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995091.658328
}