{
  "game_id": "0022300791",
  "espn_id": "401585419",
  "date": "Feb 15, 2024",
  "matchup": "MIN @ POR",
  "headline": "Timberwolves jump out to a 30-point lead over Blazers and finish with a 128-91 victory",
  "body": "PORTLAND, Ore. -- — Anthony Edwards scored 34 points and the Minnesota Timberwolves built a 30-point lead after the most lopsided first quarter in the NBA this season, handing the Portland Trail Blazers a sixth straight loss with a 128-91 rout on Thursday night.\n\n\r\n              Karl-Anthony Towns added 23 points for the Western Conference-leading Timberwolves, who led 44-14 after one quarter in their fourth straight win. It was Minnesota's West-leading 20th win on the road. \n\n\r\n              “The goal is to win a championship and you know, a lot of people doubt us, and don't believe in us, and that's the beauty of it, too. We believe in ourselves, believe in one another and we truly believe we can write our own story,” said Rudy Gobert, who added 11 points and 12 rebounds. \n\n\r\n              Jerami Grant had 20 points for the Trail Blazers, who closed the gap to single digits in the third quarter. But the Timberwolves pushed the lead to 112-81 midway through the final period on Monte Morris' jumper.\n\n\r\n              The teams also met Tuesday night, with Minnesota pulling away in the fourth quarter for a 121-109 victory.\n\n\r\n              Blazers coach Chauncey Billups moved rookie guard Scoot Henderson back into the starting lineup because of his recent play off the bench. The 19-year-old Henderson, the No. 3 pick in last year's NBA draft, finished with 15 points. \n\n\r\n              “He's so mature for his age, and he allows me to coach him hard. I'm coaching him hard and I'm honest with him at all times. I like to be that way: The best coaches I've played for we honest with me,” Billups said. “He's very coachable and I'm happy with his development, he's been playing really good.”\n\n\r\n              The game wrapped up a five-game road trip for the Timberwolves heading into the All-Star break. Next week Minnesota starts a seven-game homestand.\n\n\r\n              “It feels like we've been on the road a lot, it really has,\" Timberwolves coach Chris Finch said. \"But when you play defense, and you're committed to defense and the guys like to play every night, being on the road is not a daunting thing.”\n\n\r\n              Despite road weariness, the Timberwolves were dominant in the first quarter. Edwards had 13 points in the period, which ended with the second-biggest point differential in any quarter in team history. \n\n\r\n              Portland closed the gap a bit in the second quarter and went into halftime trailing by 66-51.\n\n\r\n              Toumani Camara's layup in the third quarter further chipped away at Minnesota's lead, pulling the Blazers within 73-63. Grant added a pair of free throws to get cut the deficit to within 10.\n\n\r\n              “We fought, fought, fought and we were hanging in there in the third quarter,\" Billups said. “We're still OK, and then man, it just got away from us.”\n\n\r\n              The Timberwolves responded with a 14-4 run to snuff the rally. Edwards had 15 points in the third quarter. It was his 21st game this season with 30 or more points.\n\n\r\n              Edwards said Minnesota isn't looking at the standings just yet. \n\n\r\n              “We just want to win every game that we play,” he said. “If that comes with a No. 1 seed, we'll take it.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Milwaukee Bucks on Feb. 23. \n\n\r\n              Trail Blazers: Visit the Denver Nuggets on Feb. 23. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996464.877407
}