{
  "game_id": "0022200167",
  "espn_id": "401468322",
  "date": "Nov 09, 2022",
  "matchup": "PHX @ MIN",
  "headline": "Booker scores 32; Paul-less Suns beat Wolves 129-117",
  "body": "MINNEAPOLIS -- — Devin Booker had 32 points and a season-high 10 assists, and Mikal Bridges scored 13 of his season-high 31 points in the first quarter as the Phoenix Suns beat the Minnesota Timberwolves 129-117 on Wednesday night.\n\n\r\n              Despite playing without Chris Paul due to right heel soreness and starting forward Cameron Johnson, Phoenix led by as many as 27 against Minnesota to rebound from a disappointing loss at Philadelphia two nights earlier.\n\n\r\n              Cameron Payne scored 23 while starting in place of Paul. Landry Shamet had 16 off the bench for Phoenix, which had lost two of three.\n\n\r\n              “That’s what we stand by; playing the right brand of basketball,” Booker said. “We have a lot of talented guys, even when we’re at full roster. There’s really good players that don’t get a chance to play that are in the rotation now. So, everybody’s taking advantage of their opportunities.”\n\n\r\n              Rudy Gobert returned to the lineup for Minnesota after missing two games while in the league’s health and safety protocols. But Gobert and Karl-Anthony Towns were limited due to early foul trouble.\n\n\r\n              Gobert had 13 of his 25 points in the third quarter. Towns finished with 11. Jaden McDaniels had a career-high 24 points to lead the Timberwolves.\n\n\r\n              Minnesota committed 19 turnovers, leading to 32 points for Phoenix.\n\n\r\n              “The turnovers are killing us, for sure,” Timberwolves coach Chris Finch said. “They’re cashing in every turnover and they’re kind of deflating at the same time. And first quarter urgency’s just not there.”\n\n\r\n              The Timberwolves were in the game early as the Suns missed seven of their first 10 shots. With Bridges leading the way, Phoenix started to hit shots and took control.\n\n\r\n              The Suns hit their next six shots following a timeout and went on a 14-4 run, with Bridges scoring seven in the span.\n\n\r\n              “He’s unbelievable,\" Booker said of Bridges. \"He just keeps getting better and better. That’s the most impressive part. Confidence is there. Aggressiveness is there and he’s doing it on both ends, which is the most important part.”\n\n\r\n              Meanwhile, Towns and Gobert left the first quarter with three fouls apiece and Phoenix extended the lead to double digits with Minnesota’s two big men on the bench.\n\n\r\n              The Suns closed the first half with a 22-9 run to lead 69-51 at the break and the Wolves could only close to within 11 points in the final minutes.\n\n\r\n              “This was a big game for us,” Phoenix coach Monty Williams said. “It’s weird to say that this early in the season, but when you don’t have Chris and you’re coming off of a loss and playing a team in your conference that you want to play well against, it was a big game from a mindset point of view.”\n\n\r\n              MISSING ONE\n\n\r\n              Minnesota played with just four players on the court during a second-quarter Suns’ possession that ended in a 3 for Phoenix. \n\n\r\n              Taurean Prince checked out before a free throw by Jaylen Nowell with D’Angelo Russell set to check-in. Prince left the court and Russell didn’t come on the court until the possession was nearly over.\n\n\r\n              “It’s just the sign of a team that’s lacking a little bit of confidence and purpose right now,” Finch said of the continued mental mistakes.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Paul missed his first game of the season. He left the previous game early, playing just 13:45 in the loss at Philadelphia. Johnson missed his third straight game with a right meniscus tear. Johnson had 29 points and Paul had 15 points and 12 assists when the two teams met in Phoenix last week. … Booker tied a season-high with five 3s. He had 16 points in the third.\n\n\r\n              Timberwolves: G Austin Rivers was ruled out before the game with an illness. C Naz Reid was active but didn’t play. The team said he has an illness. … Anthony Edwards scored 11 points on 4-of-12 shooting.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Play at Orlando on Friday.\n\n\r\n              Timberwolves: Travel to Memphis on Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995092.915762
}