{
  "game_id": "0022400434",
  "espn_id": "401705000",
  "date": "Dec 28, 2024",
  "matchup": "POR vs. DAL",
  "headline": "Shaedon Sharpe scores 23 and Trail Blazers beat short-handed Mavs 126-122",
  "body": "PORTLAND, Ore. -- — Shaedon Sharpe had 23 points, Anfernee Simons scored 22 and the Portland Trail Blazers held off the Dallas Mavericks 126-122 on Saturday night.\n\n\r\n              Deandre Ayton had 21 points, 16 rebounds and three blocks and Deni Avdija had 21 points, five rebounds and five assists. Scoot Henderson had 19 points, four rebounds, six assists and a career-high five steals off the bench.\n\n\r\n              Kyrie Irving led all scorers with 46 points and was the only consistent offensive threat for the Mavericks who were playing without Naji Marshall, PJ Washington — suspended for their involvement in an on-court fight against the Suns — Luka Doncic and Dereck Lively II. \n\n\r\n              Irving had 20 points in the fourth quarter as Dallas tried to mount a comeback that ultimately fell short.\n\n\r\n              Takeaways\r\n              Blazers: Saturday was Portland’s second win in a row, just their second winning streak of the season.\n\n\r\n              Mavericks: Outside of Irving, no other Mavericks player was able to shoulder the scoring load with much of Dallas’ rotation out due to either injury or suspension.\n\n\r\n              Key moment\r\n              After Dallas mounted a fourth-quarter comeback, Ayton stole the ball from Thompson on the perimeter with 20 seconds remaining to ice the game.\n\n\r\n              Key stat\r\n              Portland outrebounded Dallas 50-40 and outscored them in the paint 58-38.\n\n\r\n              Up next\r\n              The Blazers face the Philadelphia 76ers at home on Monday night. The Mavericks face the Kings in Sacramento the same night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998201.1536489
}