{
  "game_id": "0021400811",
  "espn_id": "400579103",
  "date": "Feb 20, 2015",
  "matchup": "MIL vs. DEN",
  "headline": "Middleton, Henson lead Bucks to 89-81 win over Nuggets",
  "body": "MILWAUKEE --  With their roster altered by a trade and their rhythm disrupted by the All-Star break, the Milwaukee Bucks got a jolt from a big man against Denver.\n\nForward John Henson exposed the Nuggets in the paint to give his team a much-needed lift.\n\nHenson scored 14 points on 6-of-8 shooting, Khris Middleton had 15 points and the Bucks beat Denver 89-81 on Friday night in their first game since tweaking their roster at the NBA trade deadline.\n\nThe athletic Henson had four buckets during a 20-7 run over the last 7 minutes of the third quarter to help put Milwaukee ahead for good after trailing the entire first half.\n\nAt halftime, the talk in the locker room was about adjusting to find players rolling to the bucket.\n\n\"In coverage, the roll guys will be open. I was just finishing, doing what I was supposed to do and we got the lead,\" Henson said.\n\nWilson Chandler led Denver with 19 points, while Jusuf Nurkic had 11 points and 15 rebounds. Denver stayed within a possession or two for much of the fourth quarter, but went 1 of 5 from the field with a turnover in the last 3:26.\n\n\"They got up on us at every position. They contested every pass, they challenged us off the dribble and daring us to beat them,\" coach Brian Shaw said.\n\nIt didn't happen, and Denver was saddled with its 14th loss in 16 games.\n\nThe Bucks won their fourth straight game and held Denver to 35 percent shooting, including 31 percent (5 of 16) in the fourth quarter.\n\nMichael Carter-Williams, who was acquired from Philadelphia as part of a three-team deal that sent Brandon Knight to Phoenix, did not play because of a sprained right big toe.\n\nThey didn't need him as the Nuggets went cold in the second half.\n\nAfter going 5 of 6 from the field to start the third period, Denver went on a 5-of-24 spurt that helped contribute to Milwaukee's second-half surge.\n\n\"We just didn't move the ball. Sometimes that happens,\" Nurkic said.\n\nHenson, a 6-foot-11 forward with a long wingspan, led the way in the paint and energized the team with a reverse and two dunks during the run.\n\nDenver drew within 74-71 with 9:35 left in the game on Danilo Gallinari's 3 from the corner. But the Bucks defense came through with less than 2 minutes left, and Middleton hit an open 3 from the corner with 1:24 left to give the Bucks a 10-point lead.\n\n\"This game is about rhythm. But we found a way to get stops when we had to, came up with some big rebounds in the second half,\" coach Jason Kidd said.\n\nTYLER'S TIME\n\nBarely 24 hours after being acquired from Phoenix, rookie Tyler Ennis scored four points off the bench in 18 minutes, along with two assists and three turnovers. The Bucks needed Ennis with Carter-Williams sidelined and Jerry Bayless starting as the only other true point guard on the roster.\n\n\"At first, you've just got to get comfortable, you've got to feel the guys out,\" Ennis said. \"But once you're out there, it's just reads and just playing basketball.\"\n\nTIP-INS\n\nNuggets: Kidd ended up ditching Shaw for dinner when Denver got into town on Thursday night. Some assistant coaches from both squads were also supposed to join them. \"But Jason's kids are in town and he's spending some time with his family so he was the only one who didn't come to dinner last night,\" Shaw said. Both coaches are former NBA guards. ... Guard Ty Lawson was a healthy scratch. Shaw said the team's leading scorer was being \"disciplined internally\" after missing practice this week.\n\nBucks: Milwaukee has taken on a Syracuse feel in the backcourt after dealing for former Orange point guards Carter-Williams and Ennis at this week's trade deadline. Kidd said he reached out to Syracuse coach Jim Boeheim to ask specifically about Ennis, a rookie. \"I like his basketball IQ,\" Kidd said about Ennis, who scored four points in 19 minutes off the bench. ... Guard O.J. Mayo had 13 points in 26 minutes before being treated late in the game on the sideline for a sore right hamstring.\n\nUP NEXT\n\nNuggets: At Oklahoma City on Sunday.\n\nBucks: Hosts Atlanta on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764991775.766158
}