{
  "game_id": "0021900487",
  "espn_id": "401161129",
  "date": "Dec 29, 2019",
  "matchup": "MEM vs. CHA",
  "headline": "Brooks, Clarke lead Grizzlies past Hornets, 117-104",
  "body": "MEMPHIS, Tenn. --  When Memphis guard Dillon Brooks scores 20 points this season, it results in a Grizzlies’ victory.\n\nAnd with Brooks reaching 20 points Sunday night, the Grizzlies sent the Charlotte Hornets to their fifth straight loss with a 117-104 victory. The Grizzlies are 8-0 when Brooks has at least 20 points.\n\n“People say it a lot,” Brooks said when asked about the undefeated streak behind his scoring. “But I’m just out there trying to win regardless of if I shoot it well or if I’m not shooting it well.”\n\nBrandon Clarke, one of the NBA leaders in shooting percentage at 65.1%, scored 18 points and converted 7 of 12 shots. Jonas Valanciunas had 16 points, and Jaren Jackson Jr. added 14 points and 12 rebounds for Memphis.\n\n“Everybody’s just playing together,” Jackson said about Memphis finishing December with an 8-8 record. “It’s not a matter of anything clicking more. Shots are falling a lot, and we’re playing better defensively. That’s the big thing. I think everybody is locked in defensively.”\n\nMalik Monk led Charlotte with 18 points off the bench and provided a fourth-quarter boost that pulled the Hornets within single digits. Devonte’ Graham had 16 points and 10 assists but was 5 of 18 from the field, including 3 of 12 from outside the arc. P.J. Washington also scored 16 points for Charlotte.\n\nThe Hornets struggled early from the field, starting 3 of 16 overall and making only one of their first nine 3-point shots.\n\n“I think we were just coming down and taking early 3’s and taking some early mid-ranges,” Washington said. “I think we could have done a better job of moving the ball.”\n\nThere were times when Charlotte rallied enough that it seemed headed back into the game. But each time the Hornets made a run, the Grizzlies answered, including the final six minutes after the Hornets pulled to 99-91. Brooks scored the next three baskets in the lane, and Memphis led 105-91.\n\n“It’s just part of the game,” Graham said about Charlotte shooting 43% on the night, including 9 of 31 from 3. “You’re going to hit some. You’re going to miss some. I felt like we were taking our normal shots. Guys who shoot the ball shoot the ball, getting to paint, missing some bunnies and floaters, things like that.”\n\nWhile Brooks led Memphis in scoring, he also was responsible for the defensive assignment on Graham. His goal was to take the Hornets’ leading scorer out of his comfort zone, forcing him right and crowding him.\n\n“Just being super aggressive,” Brooks said, adding: “Pressing up on him. Giving him a little contact, then he couldn’t get into his rhythm, couldn’t get into his flow.”\n\nTIP-INS\n\nHornets: Graham started 0 of 4 from 3-point range, then connected on a desperation 41-footer against the shot clock in the second quarter. ... C Cody Zeller scored 14 points on 5-of-8 shooting. ... Graham has three straight games of double-digit assists and has multiple 3-pointers in 13 straight games.\n\nGrizzlies: Grayson Allen matched his season-high with 15 points. ... F Jae Crowder sat out with left ankle soreness. Kyle Anderson started in Crowder’s place, Anderson’s second start of the season. ... Rookie Ja Morant had six points, his lowest-scoring game of the season. He had seven assists.\n\nSLO MO\n\nCharlotte coach James Borrego is familiar with Griz forward Kyle Anderson’s game from their days with the San Antonio Spurs. And Anderson’s nickname of Slo Mo is well-earned because of his deliberate Euro-step moves. Asked if Anderson’s game can slow any more, Borrego replied: “No. Kyle brings the game to a halt on both sides.”\n\nUP NEXT\n\nHornets: At Boston on Tuesday.\n\nGrizzlies: At Sacramento on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995727.2636101
}