{
  "game_id": "0022200358",
  "espn_id": "401468513",
  "date": "Dec 05, 2022",
  "matchup": "PHX @ DAL",
  "headline": "Doncic, Mavericks preserve big lead, roll past Suns 130-111",
  "body": "DALLAS -- — Luka Doncic and the Dallas Mavericks got the most important victory over Phoenix in Game 7 of the Western Conference semifinals last season. \n\n\r\n              Now they can say goodbye to that pesky 10-game, regular-season losing streak.\n\n\r\n              Doncic scored 33 points, Spencer Dinwiddie added 21 and the Mavericks preserved a big lead against the Suns this time in a 130-111 victory on Monday night.\n\n\r\n              The Mavericks remained in control after a 28-8 run covering most of the last 10 minutes of the first quarter, and Doncic got to rest the entire the fourth quarter of a second consecutive blowout win.\n\n\r\n              That didn't happen in the season opener at Phoenix, when Dallas blew a 22-point lead in the second half of a 107-105 loss. That was the first meeting since the Mavs' Game 7 rout in Phoenix.\n\n\r\n              Protecting the lead could help Dallas on Tuesday night in Denver as the Mavs finish the second back-to-back in a stretch of seven games in 11 days.\n\n\r\n              “I’m really happy,” said Doncic, who had eight assists and six rebounds. “I like this.”\n\n\r\n              Deandre Ayton scored 20 points for the Suns, who couldn't recover from a 15-point first quarter, their lowest total in any quarter this season, as they finished a Texas back-to-back after a blowout victory in San Antonio.\n\n\r\n              “It’s only a good sign if the other team has 14,” coach Monty Williams said of Phoenix's woeful opening quarter, which ended with the Suns down 33-15. “That didn’t happen.”\n\n\r\n              Phoenix lost for just the second time in nine games, while Dallas won consecutive games for the first time in three weeks. The Mavs beat the Knicks 121-100 in New York two days earlier.\n\n\r\n              Devin Booker, who was averaging 39 points over the previous four games, scored 11 on 4-of-13 shooting. The Suns shot 26% in the first quarter before finishing at 44% to 52% for the Mavericks.\n\n\r\n              The Suns trailed by as many as 27 and were never closer than 17 in the second half. Booker also sat the entire fourth a night after Phoenix shot 52% overall and 51% from 3-point range in a 133-95 victory over the Spurs.\n\n\r\n              “You’re going to have nights like that, especially when you compare it to how we shot he ball in San Antonio,” Williams said. “We just didn’t have it in the first half.”\n\n\r\n              Christian Wood had 18 points and nine rebounds for Dallas, while Josh Green scored 16 points and tied his career best in plus-minus at plus-26.\n\n\r\n              RECRUITING VISIT\n\n\r\n              Free agent NFL receiver Odell Beckham Jr. attended the game with two stars of the defense for the Dallas Cowboys, linebacker Micah Parsons and cornerback Trevon Diggs. They sat in Cowboys owner Jerry Jones' courtside seats next to the Phoenix bench.\n\n\r\n              Beckham politely declined to discuss in detail his visit with reporters when he arrived at the arena, where fans chanted “O-B-J” multiple times during the game. \n\n\r\n              He was spending Monday and Tuesday with the playoff-contending Cowboys after previous trips to the New York Giants, his first NFL team, and Super Bowl contender Buffalo.\n\n\r\n              The 30-year-old Beckham is recovering from a torn ACL, an injury he sustained in the Super Bowl in February while winning the title with the Los Angeles Rams. \n\n\r\n              Doncic said he spoke briefly with Beckham after the game, and Mavericks owner Mark Cuban also greeted the three-time Pro Bowler.\n\n\r\n              “I tried,” Doncic said of his recruiting pitch. “After the game, I saw him. So, hopefully. I can’t say nothing. Go Cowboys.”\n\n\r\n              TIP-INS\n\n\r\n              Suns: Cameron Payne had 14 points and a game-high 10 assists. ... Josh Okogie scored a season-high 12 points. \n\n\r\n              Mavericks: Kemba Walker dressed but still didn't make his Dallas debut in the fourth game since signing. The four-time All-Star went unsigned the first six weeks of the season. The 32-year-old has been battling knee issues in recent years. ... Rookie Jaden Hardy scored 10 points in the final 2:25 two days after getting the first points of his career (five) against the Knicks. \n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Boston on Wednesday before a four-game trip in a road-heavy December.\n\n\r\n              Mavericks: The Nuggets and Mavericks are playing for the third time in 19 days after splitting consecutive games in Dallas last month.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995088.547881
}