{
  "game_id": "0021500115",
  "espn_id": "400828002",
  "date": "Nov 11, 2015",
  "matchup": "TOR @ PHI",
  "headline": "Raptors top winless 76ers, Philadelphia drops 18th straight",
  "body": "PHILADELPHIA --  After a buzzer-beating 3 put the 76ers on the ropes, Kyle Lowry had fellow Philly native and boxer Danny Garcia at his side in the locker room for a postgame celebration.\n\nThey were there for the latest KO against the Sixers.\n\nLowry scored 23 points and Luis Scola had 21 to help the Toronto Raptors snap a three-game losing streak with a 119-103 victory over the winless Philadelphia 76ers on Wednesday night.\n\nOne year after starting 0-17, the sorry Sixers have lost their first eight games of this season.\n\nPhiladelphia has lost 18 straight games dating to March 27, 2015. That's the fourth-longest mark in franchise history, one shy of the 19 straight dropped from March 21, 1972, to Nov. 10, 1972.\n\nThe Sixers matched an NBA record with 26 straight losses from Jan. 31, 2014, to March 27, 2014, and also lost 20 straight from Jan. 9, 1973, to Feb. 11, 1973.\n\n\"You just can't get into a pity party,\" coach Brett Brown said. \"You have to deal with it and try to figure out ways to try and steal a win.\"\n\nThe Sixers would have to pull off some grand theft to win during a difficult upcoming stretch, with games ahead against Oklahoma City, San Antonio and Dallas.\n\nLowry, a Philadelphia native who played two seasons at Villanova, heard polite applause during pregame introductions and gave hometown fans plenty of reason to cheer. He scored 14 points in the first half, capped by a 27-footer with 0.9 seconds left to send the Raptors into halftime with a 63-57 lead.\n\n\"I always think every time I shoot it it's going in,\" Lowry said.\n\nLowry left about 65 tickets for friends and family and was sleeping in his own bed Wednesday night before meeting up later with the Raptors.\n\n\"It's always good to come home,\" Lowry said. \"We played our game.\"\n\nThe Raptors built a 20-point lead in the third and left no doubt about the outcome.\n\nScola scored 17 points on 8-for-10 shooting in the third quarter and helped Toronto become the latest team to punish the Sixers.\n\n\"When you get easy shots, the confidence builds,\" Scola said. \"It starts with defense. You get a lot of easy shots, the defense tends to collapse and the confidence is higher.\"\n\nWhile the Raptors had four starters in double-digit scoring, the Sixers started marginal NBA players JaKarr Sampson, Nik Stauskas and T.J. McConnell. Stauskas, a noted 3-point shooter at Michigan, has struggled from the arc in the NBA. He missed of 5 of 7 against the Raptors and entered only shooting 29 percent overall on 3s.\n\nJahlil Okafor led the Sixers with 26 points and had seven rebounds. McConnell had 13 assists and Jerami Grant had 12 points and 10 rebounds.\n\nTIP-INS\n\nRaptors: The Raptors beat the Sixers for the ninth straight time, the longest winning streak on either side in 20 years of the series. ... They play their next six games against the Western Conference.\n\nSixers: F Nerlens Noel sat out his second straight game with sore wrists from a fall last week in Cleveland. ... F Richaun Holmes sat out with a strained right hamstring. ... They assigned injured guards Kendall Marshall and Tony Wroten to the Delaware 87ers of the NBA Development League to continue their rehab. The Sixers put Marshall on the inactive list.\n\nSO SORRY\n\nToronto coach Dwane Casey said he did not want to look back at a referee mistake that cost them in the final minute of a 111-109 loss to New York on Tuesday night. Crew chief Ed Malloy said postgame that Carmelo Anthony stepped out of bounds and the ball should have been awarded to Toronto.\n\nCasey said he was an advocate of replay in a situation like that one.\n\n\"We have some of the best officials in the league, in the world,\" Casey said. \"It's honorable that the league admits it, but you take that and $3 and you won't get a cup of coffee.\"\n\nSixers owner Josh Harris apologized after his helicopter landed on the New Jersey field where two youth soccer teams were scheduled to play. The helicopter was at the school Sunday night to pick up Harris after a Devils game at the Prudential Center that went into overtime. Harris, who also owns the Devils, said the mix-up won't happen again and invited the teams and their families to be his guests at a Devils game.\n\nRAPTOR ROOKIE\n\nRookie G Norman Powell scored eight points and quadrupled his point total from his first four career games.\n\nUP NEXT\n\nRaptors: Host New Orleans on Friday.\n\nSixers: Play Friday at Oklahoma City.",
  "source": "espn_api",
  "crawled_at": 1764994768.693537
}