{
  "game_id": "0021900801",
  "espn_id": "401161443",
  "date": "Feb 10, 2020",
  "matchup": "LAL vs. PHX",
  "headline": "Rondo, Davis lead Lakers to 125-100 rout of Suns",
  "body": "LOS ANGELES --  Rajon Rondo's Los Angeles Lakers teammates have been encouraging him to be more aggressive and shoot the ball instead of trying to distribute it to everyone. On Monday night, he took the advice to heart.\n\nThe 13-year veteran point guard scored a season-high 23 points, including 15 in the second quarter, as the Lakers rolled to a 125-100 victory over the Phoenix Suns.\n\n\"He's always had that confidence but he wants to get everyone involved. We've been on him to shoot those shots and he showed you all what he can do. He does it in practice all the time,\" Anthony Davis said.\n\nLos Angeles put the game away in the second, which was only the fifth time in Rondo's 13-year career he has scored 15 or more in a period.\n\n\"We dared Rondo to shoot from the perimeter and he made us pay,\" Suns coach Monty Williams said.\n\nThe Lakers had dropped three of their last four at Staples Center but didn't have any problems against the undersized Suns. They outrebounded Phoenix by 30 (59-29) along with a 58-38 advantage in points in the paint.\n\nThe Suns had only one big man suit up after Deandre Ayton injured his left ankle in Saturday's loss to Denver. Dario Saric and Aron Baynes have also missed extended time due to injuries.\n\nDavis had 25 points and 10 rebounds but it was a big game for the bench. Besides Rondo, Dwight Howard had 14 points and 15 rebounds. It is the Lakers' 40th win of the season, the first time since 2010 they have reached that before the All-Star break.\n\n\"It was a great game for our bench. Rajon had great pace all night and he was taking all the looks he was getting. Dwight controlled the glass,\" said LeBron James, who had 17 points, nine assists and eight rebounds.\n\nMikal Bridges scored 18 points for Phoenix, which has lost six of seven. Cheick Diallo -- who started in place of Ayton -- added 15 points. Jevon Carter and Ricky Rubio scored 13 apiece.\n\n\"It's tough with the size difference and you are missing three rotation bigs. You can always have a plan until the ball comes off the rim,\" said Devin Booker, who had 10 points after going just 2 of 11 from the field. \"When they have three big guys crashing the boards they can still get tip outs.\"\n\nBoth teams started out hot in the first quarter. The Lakers made 10 of their first 13 from the floor and the Suns were 9 of 13 as there were 18 lead changes and four ties in the first 12 minutes.\n\nLos Angeles led 31-30 at the end of the first quarter before breaking it open in the second with an 18-4 run as it made eight of its first nine shots. Rondo scored the first eight points in the period, including a pair of 3-pointers.\n\nThe Suns trailed 61-52 at halftime and got within 63-57 early in the third quarter on Cameron Johnson's 3-pointer. The Lakers scored the next six points and would extend their lead to 27 during the fourth quarter.\n\nTIP-INS\n\nSuns: Kelly Oubre Jr. came off the bench and scored 10 points. He did not start after missing the team bus.\n\nLakers: Avery Bradley had 12 points and has scored in double figures in five of the last six games. He is also 11 of 15 on 3-pointers over the past three games. ... Kentavious Caldwell-Pope added 13 points ... Coach Frank Vogel (second quarter) and Howard (third quarter) received technical fouls.\n\nUP NEXT\n\nSuns: Host Golden State on Wednesday. The teams split their first two meetings this season but Phoenix has lost nine straight at home to the Warriors.\n\nLakers: Travel to Denver on Wednesday. The 128-104 win by the Nuggets on Dec. 22 was Los Angeles' second-biggest loss of the season.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995976.783586
}