{
  "game_id": "0021500561",
  "espn_id": "400828448",
  "date": "Jan 10, 2016",
  "matchup": "HOU vs. IND",
  "headline": "Ariza scores 24, Rockets rally to beat Pacers 107-103 in OT",
  "body": "HOUSTON -- Trevor Ariza routinely has big defensive games for the Houston Rockets.\nHe had another one Sunday night in slowing down Paul George, but Ariza also starred on offense this time to help the Rockets rally past the Indiana Pacers.\nAriza scored a season-high 24 points and Corey Brewer hit the go-ahead 3-pointer in overtime to give Houston a 107-103 victory.\nJames Harden and Ariza spoke to the media at the same time after the game. Houston's bearded star tried to shift the spotlight to Ariza by telling reporters they were missing out on the key figure in this game.\n\n\"I think you all should go over there and talk to him,\" said Harden, who had 21 points. \"He plays so hard no matter what. If the shots are going in or not, he still plays hard. ... He led the team in scoring after guarding a (tough) guy on defense -- shows a lot of character about the guy.\"\nThe Pacers scored the first six points of overtime before Houston scored the next six to tie it at 99 with about 2 minutes left.\nMonta Ellis made two baskets after that to put the Pacers up twice, but each time Houston responded with a 3-pointer. Ariza hit the first one and Brewer made the second to make it 105-103 with 40.9 seconds left.\nAriza added a dunk with 2 seconds left to secure Houston's third straight victory.\nThe Rockets trailed by 12 midway through the fourth quarter before rallying to tie it with 17.1 seconds left on a 3 by Ariza. The Pacers had a chance to win in regulation, but Ellis missed a jump shot at the buzzer.\nAriza downplayed his big night on offense.\n\"I'm more of a rhythm player. I play with the flow of the game,\" he said. \"So tonight the ball found me in the spots where I like to shoot the ball from and they went in.\"\nGeorge had just four points in the first half before scoring 14 of his 20 in a 27-point third quarter to help Indiana build a big lead before Houston came back in the fourth.\n\"We got stagnant and we didn't stick with what was working,\" George said. \"It's the same story every game for us.\"\nThe Pacers' lead was 12 before the Rockets used a 12-1 run to get to 89-88 with about 3 minutes left.\nIndiana led by three at halftime and scored the first five points of the second half to make it 55-48. Houston got a 3-pointer from Patrick Beverley followed by a hook shot from Howard to get within two, but Indiana padded the lead with a 14-6 spurt to make it 69-59.\nGeorge made two 3-pointers in that span, and Lavoy Allen and Ian Mahinmi added four points each for the Pacers. The Rockets scored all their points in that stretch on free throws as they went almost 6 minutes without a field goal.\nHarden finally ended the drought with a layup with less than 3 minutes left in the third. He made a 3-pointer after a dunk by George to cut the lead to 71-64.\nGeorge wasn't done with his work in the quarter as that dunk was the first of eight straight points he scored to end the period and make it 77-64.\nHOWARD'S HEALTH\nThe Rockets didn't decide if Dwight Howard would play until about an hour before the game because of a sore back that kept him out of their previous game. He didn't look to be slowed by the injury, scoring 21 points with 17 rebounds in almost 43 minutes for his fifth straight double-double.\n\"I think he was really good. He was dominant,\" Houston interim coach J.B. Bickerstaff said. \"In the second half ... he was a monster on the glass. They didn't have anyone who could guard him 1-on-1.\"\nLAWSON'S SUSPENSION\nHouston guard Ty Lawson served the second of a three-game suspension for driving under the influence in California last July. It's his second suspension this season after he had to sit out two games last month for a drunken-driving case in Colorado last January.\nLawson, traded from Denver in July, can return Wednesday when Houston hosts Minnesota.\nTIP-INS\nPacers: Indiana had 18 turnovers after committing a season-high 25 in its previous game. ... Ellis had a season-high 13 assists.\nRockets: F/C Donatas Motiejunas missed his fourth straight game with back soreness. ... C Clint Capela had three steals to give him at least three in two straight games after doing so only twice in his first 35 games this season.\nUP NEXT\nPacers: Host Phoenix on Tuesday.\nRockets: At Memphis on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994636.492329
}