{
  "game_id": "0021800929",
  "espn_id": "401071602",
  "date": "Mar 01, 2019",
  "matchup": "CHA @ BKN",
  "headline": "Hornets end skid at 3, roll to 123-112 victory over Nets",
  "body": "NEW YORK --  Frank Kaminsky was told Friday the opportunity he wanted was finally going to come.\n\nCharlotte coach James Borrego hadn't make Kaminsky part of his rotation for much of this season, but that was going to change, at least for one night.\n\n\"He told me today just to compete. Help us on offense. Defend. Rebound. Do the things you know how to do,\" Kaminsky said. \"I just tried to do that.\"\n\nHe did just what the Hornets needed in a game they really needed to have.\n\nKemba Walker scored 25 points, Jeremy Lamb added 22 and Charlotte snapped a three-game skid with a 123-112 victory over the Brooklyn Nets to inch back ahead of Orlando for eighth place in the Eastern Conference.\n\nKaminsky had played in just 26 games, but Borrego figured the 7-footer's passing ability would be helpful against the zone defense the Nets like to employ.\n\n\"Frank gives us a different dimension offensively and I think we saw the effects of that tonight,\" Borrego said.\n\nNicolas Batum had 17 points and Kaminsky re-emerged after sitting out the last four games to score 15. The Hornets put seven players in double figures and shot 53 percent from the field.\n\nD'Angelo Russell scored 22 points for the sixth-place Nets, who were easily beaten for the second time in three nights at home, where they have now lost four of five. DeMarre Carroll had 20 points.\n\n\"We have given up 68 points in the first half two games in a row. It starts on the defensive end,\" Nets coach Kenny Atkinson said. \"It's not about the lineups or working guys back in from injury. It's about defense and we have to do a better job on that end. Right now, we just aren't getting it done.\"\n\nThe Nets had won in Charlotte last Saturday behind a career high-tying 40 points from Russell, and the Hornets followed that by falling to Western Conference powers Golden State and Houston.\n\nBut they took charge of this game with a 17-2 run in the second quarter that turned a one-point game into a 62-46 cushion that really was never threatened much.\n\nAnd when the Nets finally did get it into single digits in the fourth quarter, Batum scored eight straight Charlotte points as the Hornets regained control.\n\nThe Nets shot 51 percent but were woeful defensively, just as when they trailed by as many as 28 in a 125-116 loss to Washington on Wednesday.\n\n\"We can't dig ourselves in holes and expect to get out of it by us scoring,\" Russell said. \"We got to get stops.\"\n\nBrooklyn led 32-31 after one, but Charlotte then made 16 of 26 shots (61.5 percent) while outscoring the Nets 37-18 in the second.\n\nWalker had a couple layups in a 9-0 run that extended a one-point lead to 54-44, and after a Nets basket the Hornets quickly answered with an 8-0 spurt, extending it to 62-46 on Lamb's layup.\n\nThe lead grew to 21 in the third quarter and even when the Nets finally got untracked late in the period and early in the fourth, they never stopped the Hornets enough to make any serious dent in the deficit.\n\nTIP-INS\n\nHornets: Michael Kidd-Gilchrist and Malik Monk both sat the entire game. ... Tony Parker and Cody Zeller each scored 12 points.\n\nNets: Caris LeVert scored 14 points. ... Russell, who averaged 26 points and eight assists in February, had nine assists.\n\nBENCH BOOST\n\nSpencer Dinwiddie scored 15 points off the bench after missing 14 games with torn ligaments in his right thumb. He came into the game second on the team with 17.2 points per game.\n\nHAPPY AS A HORNET\n\nDespite his difficult season, Kaminsky said he wanted to remain in Charlotte, where he was a first-round pick in 2015. He denied a report that he wanted to be bought out by Friday's deadline to be eligible to sign with another team and be eligible for the playoffs.\n\n\"It's been a tough season, a lot of reports and stuff has come out, but none of that has been said by me,\" Kaminsky said.\n\nUP NEXT\n\nHornets: Host Portland on Sunday.\n\nNets: Visit Miami on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994359.099484
}