{
  "game_id": "0022300180",
  "espn_id": "401584808",
  "date": "Nov 12, 2023",
  "matchup": "IND @ PHI",
  "headline": "Tyrese Maxey scores career-high 50 points, leads 76ers to 8th straight win",
  "body": "PHILADELPHIA -- — Tyrese Maxey scored a career-high 50 points, Joel Embiid had 37 points and the Philadelphia 76ers improved to 8-1 with their eighth straight victory, beating the Indiana Pacers 137-126 on Sunday night. \n\n\r\n              Maxey was 20 for 32 from the field and had seven rebounds, five assists and three blocks in the first of two straight games in Philadelphia between the teams. His previous high was 44 against Toronto on Oct. 28, 2022. \n\n\r\n              Maxey's final basket came on a 32-foot step-back 3-pointer with 1:05 to play after Embiid — who has tagged Maxey with the nickname “The Franchise” in past interviews — passed him the ball and set a screen to free him.\n\n\r\n              “Joel wanted me to get 50 more than even I did,” Maxey said. “When he gave me the ball, he said, ‘You are going to shoot this basketball.’ And that's why I appreciate my teammates, my coaches and the fans. It was a great night and we got the win, which is what matters most.”\n\n\r\n              Embiid had 13 rebounds in 33 minutes. The 76ers are off to their best nine-game start since opening 10-0 in 2000-01 en route to the NBA Finals. \n\n\r\n              “We are playing together and trusting each other,” Embiid said. “It may not look like we didn't play defense tonight, but (Indiana) plays so fast its incredible with the pace. So they are going to score a lot, but we just competed. We lowered our guard for a bit, but we had Tyrese to help close it out.”\n\n\r\n              Philadelphia played without Kelly Oubre Jr. after he broke a rib when hit by a car in a hit-and-run incident on a Center City Philadelphia street Saturday night, After the game, Oubre's teammates sent him a video of the post-game locker room celebration after being unable to get him on FaceTime. “\n\n\r\n              “The game today, I'm sure Tyrese was thinking about it and we were all thinking about it,” Embiid said. ”We just want him to take his time, recover and know that we have his back. He's needed because he's a big part of us. We missed him tonight, but he should take his time.\n\n\r\n              Tyrese Haliburton led Indiana with 25 points and Myles Turner had 22. The Pacers had won three a row.\n\n\r\n              “This is one of the top two or three teams in the entire league and we know that,” Pacers coach Rick Carlisle said. “There are certain things that we can and will do better on Tuesday. We have to look at it, be honest about what they are and make those adjustments.”\n\n\r\n              After trailing by 19 in the first half, Indiana took its first lead at 105-104 early in the fourth quarter on Aaron Nesmith's jumper in the paint. The 76ers pulled away with an 18-6 run, capped by Maxey' putback of a Patrick Beverley's errant shot.\n\n\r\n              “There were stretches where they really got going and we couldn't shut off the water there,” 76ers coach Nick Nurse said. “But we really got it going in the fourth.”\n\n\r\n              Maxey raised to average to 28.6 points in his new role as the floor leader in the wake of the trade of James Harden to the Los Angeles Clippers. \n\n\r\n              “I had been missing the open threes and I kept telling my uncle that I can't keep missing them,” Maxey said. “Tonight, they fell.”\n\n\r\n              UP NEXT\n\n\r\n              The teams will meet again Tuesday night at Wells Fargo Center in the NBA In-Season Tournament. They each won their tournament openers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996212.638294
}