{
  "game_id": "0022300291",
  "espn_id": "401584919",
  "date": "Dec 02, 2023",
  "matchup": "LAL vs. HOU",
  "headline": "Davis has 27 points and 14 rebounds, Lakers keep Rockets winless on road with 107-97 victory",
  "body": "LOS ANGELES -- — Anthony Davis had 27 points and 14 rebounds, and the Los Angeles Lakers beat Houston 107-97 on Saturday night, keeping the Rockets winless on the road.\n\n\r\n              Austin Reaves added 18 points off the bench and LeBron James had 16 points and seven assists.\n\n\r\n              Fred VanVleet scored 22 points and Alperen Sengun had 21 points and 13 rebounds for the Rockets, who dropped their third in a row overall while falling to 0-8 away from home. \n\n\r\n              Houston coach Ime Udoka was ejected with 8:35 remaining in the game after picking up his second technical for jawing with James, who also got a tech.\n\n\r\n              “We had some conversation and they didn't like what they heard,” Udoka said, referring to the referees.\n\n\r\n              The Lakers dominated the paint, 54-34, and their bench outscored Houston's reserves 33-24. \n\n\r\n              Sengun scored 12 points in the third, when the Rockets outscored the Lakers 28-20 and trailed 86-72 going into the fourth.\n\n\r\n              After allowing Houston to shoot 60% from the floor in the first quarter, when Davis missed his first six shots, the Lakers took over in the second. Reaves scored 15 points — his career high in a quarter — and keyed a 29-4 run, with Davis adding eight points, that put the Lakers ahead 58-40. VanVleet scored six in a row to leave Houston trailing 60-44 at the break.\n\n\r\n              “That's probably one of the best quarters that we had this year, especially in the first half. We just haven't been a first-half team,” James said. “It came with defending, getting out, sharing the ball, moving the ball and A.R. was special in the second.”\n\n\r\n              Rui Hachimura was available for the Lakers, but didn't play a week after having nose surgery. \n\n\r\n              “Physically he's fine except for his nose,” coach Darvin Ham said.\n\n\r\n              PLAY OF THE GAME\n\n\r\n              James pulled off a slick 360-degree reverse layup at the end of the second. \n\n\r\n              “It was a crazy shot,” Davis said. “At this point in his career he's done everything that he literally just goes out and tries stuff and sees what works.”\n\n\r\n              Teammate Christian Wood got a tech for coming onto the floor as the Lakers bench erupted along with the crowd.\n\n\r\n              “We'll take that one,” James said of the tech. “Just trying to make plays and I felt like that was the best way to kind of finish that one.”\n\n\r\n              As James fell to the floor, he lost track of the ball. “The fans let me know that I made it and then my teammates, by them running on the floor or whatever they did down there, allowed me to see it on the Jumbrotron because it stopped the play because of the technical.”\n\n\r\n              Ham said, “The most impressive thing is at what stage in his career he's doing it in. He's breaking barriers it seems every day.” \n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host Oklahoma City on Wednesday.\n\n\r\n              Lakers: Host Phoenix on Tuesday night in a quarterfinal of the In-Season Tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995538.1281312
}