{
  "game_id": "401810055",
  "espn_id": "401810055",
  "date": "Nov 10, 2025",
  "matchup": "ORL vs POR",
  "headline": "Bane's 3-pointer at the buzzer lifts the Magic to a 115-112 win over the Trail Blazers",
  "body": "ORLANDO, Fla. -- — Desmond Bane hit a 3-pointer at the buzzer to give the Orlando Magic a 115-112 win over the Portland Trail Blazers on Monday night.\n\n\r\n              Bane's basket from 27 feet capped a wild finish in which the Trail Blazers overcame a nine-point deficit only to see their comeback nullified as the buzzer sounded.\n\n\r\n              Paolo Banchero led the Magic with 28 points and nine rebounds. Bane finished with 22 points and seven assists.\n\n\r\n              Shaedon Sharpe scored 31 points for Portland. Devi Avdija added 27 points, including a couple of 3-pointers during an 11-0 Portland run in the final two minutes.\n\n\r\n               Jeremi Grant scored on an inbounds pass from Toumani Camara and added a free throw with 10.6 seconds left to put Portland ahead 112-110.\n\n\r\n              Banchero, who had missed two free throws before Grant's three-point play, drove for a game-tying layup and drew a foul. He missed another free throw, leaving the game tied with five seconds remaining. But Banchero stole Portland's inbounds pass with 1.9 seconds left, setting the stage for Bane's winner.\n\n\r\n              Franz Wagner and Wendell Carter Jr. had 19 points and nine rebounds each for Orlando.\n\n\r\n              Neither team had a double-digit lead until Orlando's Jett Howard hit a 3-pointer to make it 87-75 in the final seconds of the third quarter.\n\n\r\n              Portland, playing the second game of a five-game trip, got it back to 102-100 on a couple of free throws by Avdija with 4:46 left. The Trail Blazers' only lead of the second half came on Grant's play with 10.6 seconds remaining.\n\n\r\n              Bane's game-winning shot was his only successful 3-pointer on six attempts, and the Magic shot only 8 for 30 (26.7%) from distance.\n\n\r\n              Playing their third game in four nights, the Magic were without guard Jalen Suggs (knee).\n\n\r\n              Up next\r\n              Trail Blazers: At New Orleans on Wednesday night.\n\n\r\n              Magic: At New York Knicks on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042597.0501661
}