{
  "game_id": "0022200778",
  "espn_id": "401468933",
  "date": "Feb 02, 2023",
  "matchup": "LAL @ IND",
  "headline": "James closes in on scoring record, Lakers rally past Pacers",
  "body": "INDIANAPOLIS -- — LeBron James just put his head down and repeatedly drove to the basket Thursday night.\n\n\r\n              It was his vintage move.\n\n\r\n              The same late-game philosophy that led to four NBA championships and has him on the precipice of becoming the NBA's new career scoring champ worked perfectly again at Indiana. James finished with 26 points, seven rebounds and seven assists and fueled another frantic fourth-quarter rally, helping erase a 14-point deficit to lead the Los Angeles Lakers to a 112-111 victory over the Pacers.\n\n\r\n              He's now 63 points away from breaking Kareem Abdul Jabbar's career record, 38,387 points.\n\n\r\n              “I just understood my game was needed more on the interior tonight,” James said. “Needed to get some rebounds, need to get some baskets in there and and I felt like we were attacking, especially in the fourth quarter.”\n\n\r\n              James looked content doing the dirty work even though the Lakers trailed the entire first three quarters, usually by double digits.\n\n\r\n              But with a friendly road crowd imploring James to lead the Lakers back, his 3-pointer with 2:35 left in the game gave Los Angeles its first lead of the game. Anthony Davis' short jumper with 35.1 seconds left and subsequent block proved to be the decisive plays on a night he had 31 points and 14 rebounds, but was left out of the All-Star Game.\n\n\r\n              For the third time in 21 months, Indiana found itself at the forefront of a league-changing pursuit. It was here in May 2021 that Russell Westbrook recorded his 181st career triple-double to tie Oscar Robertson’s career mark. And it was here in December 2021 that Stephen Curry made five 3-pointers to pull within one of matching Ray Allen’s career mark of 2,973.\n\n\r\n              James is now at 38,325 and this one clearly means something special to him.\n\n\r\n              “I think it's one of the greatest records in sports, in general,” he said. “It's like the home run record in baseball. It's one of those records that you don't ever see or think will be broken. You see guys like Hank Aaron, who had it for so long. You see guys like Sammy (Sosa) and Mark McGwire and you start climbing it and it's like ‘Oh, this could really happen.’ It's a fun thing as a sports person. It was fun watching those guys chasing it.\"\n\n\r\n              But it was the Pacers who were chasing late.\n\n\r\n              On a night Aaron Nesmith scored a career-high 24 points, newly minted All-Star Tyrese Haliburton added 26 points and 12 assists in his first game in three weeks and Myles Turner had 20 points and 13 rebounds after signing a two-year contract extension, Buddy Hield missed a 17-footer as the clock ran out.\n\n\r\n              Indiana has lost four straight and this one befuddled longtime coach Rick Carlisle.\n\n\r\n              Indiana relied on pace and speed to take control and still led led 98-84 early in the fourth.\n\n\r\n              But the Lakers won it by going to the free-throw line 16 times, compared to zero for Indiana, in the final quarter.\n\n\r\n              “The foul discrepancy and free-throw discrepancy (16-0 in the fourth quarter), is something I've never seen in my 38 years in the league,\" Carlisle said, crediting the Lakers for being aggressive. “There was a lot going on out there and they'll see it in black and white in New York. Or actually, they'll see it in HD.”\n\n\r\n              TIP-INS\n\n\r\n              Lakers: James and Davis combined for 28 points in the first half, while the other seven players who saw action had 26. ... Los Angeles was 6 of 22 on 3s. ... The Lakers have won three straight at Indiana.\n\n\r\n              Pacers: Nesmith also had a a career high five 3s. ... T.J. McConnell had 11 points off the bench. ... Indiana has lost 11 of 12. \n\n\r\n              SHOOTING STAR\n\n\r\n              A few moments before the Pacers public address announcer told the crowd that Haliburton was returning to the starting lineup, Shaquille O'Neal announced Haliburton had been named a reserve on the Eastern Conference All-Star team. The video, from TNT's pregame coverage, was then replayed on the arena's large video board as the crowd roared and teammates congratulated the first-time All-Star.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Close out a five-game trip Saturday at New Orleans.\n\n\r\n              Pacers: Host Sacramento on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995050.137155
}