{
  "game_id": "0022200557",
  "espn_id": "401468712",
  "date": "Jan 02, 2023",
  "matchup": "DEN @ MIN",
  "headline": "Edwards scores 29, short-handed Wolves beat Nuggets 124-111",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 29 points, including 15 in the third quarter to help Minnesota withstand a push by Denver, and the Timberwolves held on for a 124-111 win against the Nuggets on Monday.\n\n\r\n              Jaden McDaniels had 21 points and Kyle Anderson added 19 for Minnesota, which snapped a six-game losing streak and won its fourth in a row against Denver.\n\n\r\n              With Jamal Murray and Nikola Jokic leading the way, the Nuggets made their push early in the third. But Edwards answered the call, scoring 10 of the final 12 points of the quarter to put the Timberwolves back in front for good.\n\n\r\n              “They tell me,” Edwards said of his teammates pushing for him to take control. “Especially this group of guys, they be upfront with me. ‘Hey, it’s time to take over.’ Someone told me going into the third quarter after the first time, ‘Alright, take this game over.’”\n\n\r\n              Jokic finished with 24 points, seven rebounds and nine assists, and Murray added 14 points after a scoreless first-half. Bones Hyland added 18 points off the bench, but Denver was undone by its sluggish start on the second game of a back-to-back following Sunday’s home win against Boston.\n\n\r\n              The Nuggets had won 10 of their previous 12 games.\n\n\r\n              “What I saw was just a team that was more urgent, was more desperate and wanted it more,” Malone said of Minnesota. “Usually that team is going to win the game. Disappointing. Great win last night, but who cares. You just gave it right back tonight.”\n\n\r\n              Playing without D’Angelo Russell (illness) and Naz Reid (low back spasms) was just the latest blow to the Timberwolves, who have been without Karl-Anthony Towns (right calf strain), Taurean Prince (right shoulder subluxation) and Jordan McLaughlin (left calf strain) for extended absences.\n\n\r\n              Holding leads has also been an issue, such as Saturday when Minnesota let an 18-point advantage slip away in a disappointing home loss to last-place Detroit.\n\n\r\n              Wolves coach Chris Finch wondered if there was a sense of entitlement with his struggling, star-laden team and considered possible changes. Finch didn’t have many options for changes due to being short-handed, but seldom-used Luka Garza and Nathan Knight provided a spark off the bench and helped defend Jokic.\n\n\r\n              Meanwhile, energy and focus were no problem against the first-place Nuggets.\n\n\r\n              “Very, very proud of our guys after the weekend,” Finch said. “Obviously, we desperately needed a win here, regardless of who we had playing or who we were playing. It was a total team win. Everybody who came in contributed, executed the game plan to a high level. Played with toughness, played together. It was really fun to watch.”\n\n\r\n              OFF THE MARK\n\n\r\n              Denver, who started the day with the second-best shooting percentage in the league and tops from 3-point territory, simply struggled to make shots in the first half.\n\n\r\n              The Nuggets started the game 3 of 10 from the field, shot 38.9% in the first quarter, including a 1 of 8 mark from 3. They finished the first half at 40.9%.\n\n\r\n              “I think tonight it boils down for me, I think it’s mental,” Denver coach Michael Malone said. “If you’re mentally tough, you’re not giving in to the ‘I’m tired.’ … (Championship) types of teams rise above all the BS, all the noise, all the excuses. You got to tell your body you’re not tired.\"\n\n\r\n              POINT ANT\n\n\r\n              Without Russell and McLaughlin, the team’s primary point guards, the offense ran through Edwards. He had five assists and 10 rebounds.\n\n\r\n              “Finchy did a great job,” Edwards said. “He was calling plays. Other times, he’ll tell me when to go. He’ll be like, ‘Alright, go, go, go,’ like when I’m pushing the ball. So, he kind of helped me out tonight.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Kentavious Caldwell-Pope left the game for a short time with a right wrist sprain. He later returned to the game. … Aaron Gordon missed his first 10 shots of the game, but he finished with 12 points and 16 rebounds, including a career-high 12 offensive boards.\n\n\r\n              Timberwolves: Jaylen Nowell scored 17 points while starting for Russell. … Minnesota shot 60% in the fourth quarter, including 4 of 9 from 3 to stay in front.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Return home against Los Angeles Clippers on Thursday.\n\n\r\n              Timberwolves: Host Portland on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994710.25943
}