{
  "game_id": "0022200720",
  "espn_id": "401468875",
  "date": "Jan 25, 2023",
  "matchup": "ORL vs. IND",
  "headline": "Banchero, Harris lead Magic to 126-120 win over Pacers",
  "body": "ORLANDO, Fla. -- — Paolo Banchero scored 23 points and Garry Harris made all six of his 3-point shots and added 22 points as the Orlando Magic held off a late rally to beat the Indiana Pacers 126-120 on Wednesday night.\n\n\r\n              Bennedict Mathurin came off the Pacers' bench to score 26 points for the second straight game, and Myles Turner added 22 points and 13 rebounds for Indiana, which was coming off a 116-110 win over Chicago a night earlier. Buddy Hield hit his first five 3-point shots and finished with 21 points.\n\n\r\n              Wendell Carter Jr. had 18 points and 10 rebounds for the Magic. Orlando made 15 of 28 attempts from 3-point range and shot 56% overall.\n\n\r\n              Harris, who made 8 of 9 shots, was the only one of 11 Magic players not to have an assist.\n\n\r\n              “My teammates did a good job of finding me,” he said. \"When the ball moves like it did — I mean, we had a season high in assists (34) today. When the ball is popping, you’ve got to step it up and shoot the ball with confidence.\n\n\r\n              “(My shots) definitely came in the rhythm of the game. We did a great job of moving the ball.”\n\n\r\n              The Pacers fell behind 11-0 and never caught up, losing for the eighth time in nine games since NBA assist leader Tyrese Haliburton went out with a sprained left knee and sprained left elbow.\n\n\r\n              Banchero scored 13 points in the Magic's 46-point first quarter in which they shot 64% and built a 17-point lead.\n\n\r\n              “Lousy first quarter. We've got to get off to better starts,” Pacers coach Rick Carlisle said. “They hit us with a lot of shots, drives to the basket, and we were on our heels. The second night of a back to back is not an excuse because we've been good all year in those situations.”\n\n\r\n              Hield hit three 3-pointers in the second quarter as the Pacers got back within two points before trailing 73-68 at halftime.\n\n\r\n              Orlando regained a double-digit lead just before the third-quarter buzzer on Franz Wagner's layup after a length-of-court pass from Jalen Suggs.\n\n\r\n              The Magic went back up by 17 points early in the fourth quarter, before Indiana closed within four in the final minute.\n\n\r\n              It was the ninth win for the Magic in their last 12 home games.\n\n\r\n              “Defense is going to have to be our identity for us to get into the playoffs. That’s kind of our push right now, that’s what everybody’s mind set is,” Carter said. “Defending home court is going to be huge for us.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Hield finished with six 3s and raised his NBA-leading total to 191. ... Haliburton missed his eighth straight game, but might play Friday night. ... G Andrew Nembhard missed a second game due to illness. \n\n\r\n              Magic: F Jonathan Isaac, playing in his second game since missing two-and-a-half seasons with a torn left ACL, had five points and two assists in eight minutes. ... Franz Wagner was the only starter who also started the last game against Indiana, on Dec. 16. \n\n\r\n              HIGH PRAISE FOR THE ROOKIE\n\n\r\n              Nine-year veteran Harris on Banchero: “I’ve never seen anybody come into the league like he’s come into the league, just how locked-in, focused, how mature he is. I’ve never seen a rookie like him. It’s been fun to share the court with him.”\n\n\r\n              Carter on the same subject: “He just gets the game of basketball. ... We’re at our best when he’s aggressive, and he understands that. He understands that there’s a lot of weight on him as the No. 1 pick, but he’s so calm and collected out there.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Milwaukee on Friday night.\n\n\r\n              Magic: At Miami on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994625.04334
}