{
  "game_id": "0022400696",
  "espn_id": "401705262",
  "date": "Feb 02, 2025",
  "matchup": "CLE vs. DAL",
  "headline": "Evan Mobley scores 22, Cavaliers make 26 3s in 144-101 romp over Mavericks following Doncic trade",
  "body": "CLEVELAND -- — Evan Mobley scored 22 points and Cleveland set a franchise record with 91 in the first half as the Cavaliers romped to a 144-101 win on Sunday over Dallas just hours after the Mavericks traded superstar Luka Doncic to the Lakers for Anthony Davis.\n\n\r\n              Darius Garland added 17 points and 10 assists as the Cavs improved the league's best record to 40-9.\n\n\r\n              Sam Merrill made nine 3-pointers and Cleveland set a franchise record with 26 3s.\n\n\r\n              Hoping to return to the Finals, the Mavericks dealt the 25-year-old Doncic, a five-time All-Star and the face of their franchise to Los Angeles for Davis, one of the league's most talented two-way players.\n\n\r\n              Davis will join forces in Dallas with All-Star guard Kyrie Irving, who has plenty of experience playing with other superstars after stints alongside LeBron James, Kevin Durant, James Harden and Doncic.\n\n\r\n              Unfortunately, Irving wasn't available because of injury and the Cavs blitzed the Mavericks from the start. Cleveland scored a franchise record 50 points in the first quarter and opened a 45-point halftime lead.\n\n\r\n              Their 91 points tied for the third-most in a first half in league history.\n\n\r\n              Jaden Hardy paced Dallas with 21 points.\n\n\r\n              Takeaways\r\n              Mavericks: Dallas only had 10 players in uniform as Irving (shoulder), forward P.J. Washington Jr. (knee) and centers Daniel Gafford (ankle), Dereck Lively II (ankle) and Dwight Powell (hip) all sat out with injuries.\n\n\r\n              Cavaliers: An easy afternoon to tune up for Tuesday night's matchup against Boston.\n\n\r\n              Key moment\r\n              Garland made three 3-pointers in a span of 66 seconds as the Cavs opened an early 27-9 lead.\n\n\r\n              Key stat \r\n              The Cavs have made at least 10 3-pointers in 54 straight games, tying Portland for the fourth longest streak. The Houston Rockets hold the record with 97 consecutive games with 10 3s or more.\n\n\r\n              Up Next\r\n              The Mavericks are in Philadelphia on Tuesday. The Cavs host the defending champion Celtics, who ended Cleveland's 15-game winning streak to start the season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998312.58771
}