{
  "game_id": "401810151",
  "espn_id": "401810151",
  "date": "Nov 29, 2025",
  "matchup": "MIA vs DET",
  "headline": "Duncan Robinson gets a win in return to Miami, as Pistons hold off Heat 138-135",
  "body": "MIAMI -- — Cade Cunningham scored 29 points, Duncan Robinson had 18 in his return to Miami and the Eastern Conference-leading Detroit Pistons held off the Heat 138-135 on Saturday night to snap a two-game skid.\n\n\r\n              Miami was down by 22 with 8:09 left, then got within 133-131 when Bam Adebayo scored on a putback with 34 seconds remaining. But Cunningham scored on the next Detroit possession and the Pistons escaped.\n\n\r\n              Tobias Harris was 10 for 12 from the field and scored 26 for the Pistons, who are 16-4 — their best 20-game start since opening 17-3 in 2005-06. Detroit shot 59% and had 76 points in the paint.\n\n\r\n              Andrew Wiggins scored 31 for Miami, which got 28 from Norman Powell and 24 from Tyler Herro. Adebayo had 15 points and 10 rebounds.\n\n\r\n              It was the first time Robinson was back in Miami as an opponent; he was traded to Detroit this past summer. He spent his first seven seasons with the Heat and his story — not even a starter for some of his high school career, beginning college at Division III Williams before heading to Michigan and then going undrafted before becoming Miami's career 3-point leader — is one Heat coach Erik Spoelstra counts as one of his favorites.\n\n\r\n              “It’s one of the great all-time Miami Heat success stories,\" Spoelstra said. \"We all are extremely happy for him. He does look strange in blue. It doesn’t look normal. But that’s life in the NBA.”\n\n\r\n              Robinson made a 3 that started a 13-0 Detroit run to end the first quarter and break what was a 23-all tie. Miami was within 10 late in the third, but a 22-10 spurt by the Pistons pushed the margin out to 121-99 with 8:09 left.\n\n\r\n              Up next\r\n              Pistons: Host the Atlanta Hawks on Monday.\n\n\r\n              Heat: Host the Los Angeles Clippers on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042716.696597
}