{
  "game_id": "0021800023",
  "espn_id": "401070708",
  "date": "Oct 19, 2018",
  "matchup": "MIL vs. IND",
  "headline": "Antetokounmpo, Middleton help Bucks beat Pacers 118-101",
  "body": "MILWAUKEE --  Giannis Antetokounmpo's inside game is setting up the Bucks' new-look, long-range attack.\n\nAntetokounmpo had 26 points and 15 rebounds and Khris Middleton added 25 points to help Milwaukee beat the Indiana Pacers 118-101 on Friday night in the regular-season opener in the new Fiserv Forum.\n\nThe Bucks hoisted up a franchise-record 47 3-point attempts.\n\n\"To some degree if we're attacking the paint, we're attacking the basket and we're getting great shots there, then we'll take them,\" first-year Bucks coach Mike Budenholzer said. \"If there's going to be rotations, there's going to be helps, there's going to be shifts, and there's opportunities to shoot threes, then we'll take those.\"\n\nVictor Oladipo led Indiana with 25 points, and Doug McDermott added 14.\n\nThe Bucks led 62-53 at the half and extended it to 93-76 entering the third quarter.\n\nMilwaukee, which ranked 25th in the NBA last season with 24.7 3-point attempts per game, continued to fire away under new coach Mike Budenholzer. The Bucks were 17 of 47, with Antetokounmpo going 0 for 7.\n\n\"As far as shooting, I want him to shoot. If he's open, I want him to let it fly,\" Budenholzer said. \"I want him to be confident. Again, he can be a lot better. I'm sure tonight he's going to go home and think about all they ways he can be better, and for us, that's exciting.\"\n\nAntetokounmpo said the Bucks perimeter shooting is part of Budenholzer's philosophy.\n\n\"That comes from coach,\" said Antetokounmpo, who is 0 for 10 beyond the arc in two games. \"He wants to shoot the ball. Like, I was 0 for 7 today, but I'm going to keep shooting.\"\n\nMiddleton had five 3-pointers, including a four-point play that put the Bucks up 111-88 with 5:03 remaining.\n\nThe Bucks were 14 of 34 beyond the arc in their 113-112 season-opening victory at Charlotte on Wednesday night.\n\n\"Anytime you're not stopping the ball and that ball is getting to the paint, it forces your defense to collapse,\" Pacers coach Nate McMillan said. \"When the defense collapses, it's going to be a kick-out for three. Antetokounmpo is one of the better players in the league at finding the perimeter guys when he gets deep penetration.\"\n\nThe Bucks shook off a slow start en route to a 30-25 lead after one quarter, extending it to 62-53 at the half. Milwaukee took 26 of its 51 first-half shots from 3-point range, making eight.\n\nAntetokounmpo had 22 points and 11 rebounds in the first half.\n\n\"He demands a lot of attention, obviously,\" Oladipo said. \"One man can't stop him all by himself. We need to load to him and stop him. Overall, we have just got to do a better job of doing that earlier in the game. You know once he finds his rhythm, he starts finding guys, and guys were hitting shots. It's hard to defend, but we have to control what we can control out there.\"\n\nTIP INS\n\nPacers: Bojan Bogdanovic, who had 19 points in the season-opening 111-83 victory over Memphis, was 0 for 7 from the field, with just three points in 27 minutes.\n\nBucks: Reserve center John Henson was 2 for 3 from 3-point range. Henson entered with one 3-pointer in 13 attempts in his first 392 career games.\n\nFISERV FORUM ROCKS\n\nThe Bucks' regular-season home opener was squeezed in amongst a week of concerts at the new Fiserv Forum. Metallica played Tuesday night, followed by the Foo Fighters on Wednesday and Eagles on Thursday. The court comes up again Saturday for a show by Twenty One Pilots. The Bucks also were competing Friday night with the Brewers-Dodgers in Game 6 of the NLCS at Miller Park.\n\nUP NEXT\n\nIndiana: Hosts Brooklyn on Saturday night.\n\nBucks: Host New York on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994537.01811
}