{
  "game_id": "0022200173",
  "espn_id": "401468328",
  "date": "Nov 10, 2022",
  "matchup": "ATL vs. PHI",
  "headline": "Young helps Hawks pull away in 2nd half, beat 76ers 104-95",
  "body": "ATLANTA -- — A sloppy offensive game left the Atlanta Hawks looking for a better finish and the Philadelphia 76ers looking for better play at point guard.\n\n\r\n              Trae Young scored 26 points, Clint Capela added 18 points with 20 rebounds and the Hawks pulled away late in the third period before surviving a late scare to beat the 76ers 104-95 on Thursday night.\n\n\r\n              The Hawks led by 20 points before the 76ers pulled within seven.\n\n\r\n              “We’ve just got to be better at not relaxing at all and not looking at that scoreboard,” Young said. “We’ve just got to finish the game.”\n\n\r\n              Joel Embiid led Philadelphia with 26 points and 13 rebounds for his second straight double-double after missing three games with the flu.\n\n\r\n              The 76ers, still adjusting after losing James Harden for approximately one month with a right foot strain, had 17 turnovers and 15 assists.\n\n\r\n              “The lack of point guard play I thought was really clear tonight,” said 76ers coach Doc Rivers. “We're going to have to make an adjustment there.”\n\n\r\n              Tyrese Maxey made 5 of 17 shots while De'Anthony Melton had three turnovers and one assist as Philadelphia's starting guards. Maxey has made 9 of 35 shots in his last two games.\n\n\r\n              “I've got to get back to attacking to score and not attacking to get to the line,” Maxey said. “It's going to come. It's going to come back to me.” \n\n\r\n              Young and Capela each had two baskets in Atlanta's 12-0 run to close the third quarter. The Hawks led by only two points before taking an 80-66 advantage into the final period.\n\n\r\n              Rookie A.J. Griffin's 3-pointer early in the fourth extended Atlanta's lead to 89-74. \n\n\r\n              Rivers called a timeout with 8:59 remaining and stopped play again about a minute later. The coach couldn't find a way to stop the Hawks' momentum and pulled his starters with less than five minutes remaining.\n\n\r\n              The 76ers’ backups, led by Montrezl Harrell, cut Atlanta’s lead to seven points with about two minutes remaining. Hawks coach Nate McMillan was forced to return all five starters for the final minute.\n\n\r\n              The 76ers couldn't complete the comeback.\n\n\r\n              “We've been in a lot of close ones that should have been wins,” Maxey said. “We've got to break through and start winning these games.”\n\n\r\n              A steal by Dejounte Murray led to a jam by Onyeka Okongwu that extended Atlanta's lead to 20 points at 94-74.\n\n\r\n              The Hawks led 46-42 at halftime as each team struggled with poor shooting, especially from long distance. The Hawks made 1 of 11 3-pointers in the half and finished 6 of 26. The 76ers made 2 of 14 3s in the half and 6 of 30 for the game.\n\n\r\n              Georges Niang, who scored a season-high 21 points in the 76ers' 100-88 win over Phoenix on Monday, was scoreless before his layup tied the game at 55 midway through the third.\n\n\r\n              John Collins answered with a three-point play, giving the Hawks a lead they wouldn't lose.\n\n\r\n              PLAYOFF APPROACH\n\n\r\n              The teams play again on Saturday in Philadelphia. \n\n\r\n              “Our approach was like a playoff series,” McMillan said. “We wanted to get the first one. Now we're greedy and want to get the second one.”\n\n\r\n              TIP-INS\n\n\r\n              76ers: Tucker started and had only three points in 24 minutes after he was added to the injury report as questionable with a left hip contusion. ... Maxey had 15 points and five assists. Tobias Harris had 12 points.\n\n\r\n              Hawks: F Jalen Johnson was treated for tightness in his right hamstring following Wednesday night's game. He was listed as questionable and had two points in only six minutes. ... Capela set a season high in rebounds. ... De'Andre Hunter had 14 points. Okongwu had 10 points and 11 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Rivers said he likes playing the same team in back-to-back games “as far as the competitive part of it.” He said he didn't understand the need to include travel between the games.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995212.605362
}