{
  "game_id": "0022200940",
  "espn_id": "401469095",
  "date": "Mar 01, 2023",
  "matchup": "LAL @ OKC",
  "headline": "Dennis Schroder scores 26 points, Lakers top Thunder 123-117",
  "body": "OKLAHOMA CITY -- — Dennis Schroder scored 22 of his 26 points in the second half and the Los Angeles Lakers beat the Oklahoma City Thunder 123-117 on Wednesday night.\n\n\r\n              Schroder went down holding his left ankle in the first quarter but stayed in the game. He turned out to be fine, making 8 of 18 shots and finishing with six assists to help the Lakers overcome their injury issues. LeBron James and Anthony Davis both were out with right foot injuries and D’Angelo Russell sat out because of a sprained right ankle, yet the Lakers won for the fourth time in five games.\n\n\r\n              Troy Brown Jr. scored a season-high 19 points and Austin Reaves added 19 for the Lakers.\n\n\r\n              Reaves said his role was much different without the Lakers' stars.\n\n\r\n              “Anytime you play without your three most of all dominant guys that you run mostly everything through, the game’s going to be — I won’t say awkward, but there’s just a lot of new situations for guys and especially myself,\" he said.\n\n\r\n              Jalen Williams scored 24 points, Josh Giddey had 22 points, 11 assists and nine rebounds and Lu Dort added 19 points for the Thunder. \n\n\r\n              Thunder guard Shai Gilgeous-Alexander, who averages 31 points, sat out due to health and safety protocols and an abdominal strain. Oklahoma City is 0-5 since the All-Star break.\n\n\r\n              Even with the Thunder missing Gilgeous-Alexander, the Lakers were focused.\n\n\r\n              “They’ve got a lot of talent there, a lot of young talent that knows how to play the game and plays hard,” Reaves said. “They’re not a bad team at all. But we needed this win and we knew that coming in.”\n\n\r\n              The Thunder led 60-57 at halftime behind 12 points each from Dort and Giddey.\n\n\r\n              The Lakers opened the second half on a 10-2 run to take a 67-62 lead. They took a 90-84 edge into the fourth, then took a 13-point lead in the final period before holding on.\n\n\r\n              “For the most part, I thought we played really hard for much of the game,\" Thunder coach Mark Daigneault said. \"Bounced back a couple of times, like, weathered a couple of runs and just kind of kept ourselves in it. Playing from behind like that down the stretch is tough to evaluate, but I was just impressed by the compete level of the team tonight.”\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Reaves, who finished his college career at the University of Oklahoma, made 5 of 5 field goals, his only 3-point try and 8 of 9 free throws. He didn't miss any shots until he missed a free throw in the final minute. He said he “thought it was trash\" to miss the free throw. ... F Wenyen Gabriel had 10 rebounds in 22 minutes. \n\n\r\n              Thunder: Made 11 of 14 shots inside the 3-point line in the second quarter, helping Oklahoma City outscore the Lakers 30-26 in the period. ... F/C Dario Saric scored 13 points in 15 minutes. ... F Jaylin Williams had 12 rebounds.\n\n\r\n              FAIR AND BALANCED?\n\n\r\n              The Lakers shot 39 free throws to 24 for the Thunder, leaving Daigneault unhappy.\n\n\r\n              “The officials aren’t perfect and that’s not the expectation,” he told the media after the game. “All we’re asking for is fairness and consistency. I do feel like I end up answering a lot of questions from you guys about free throw discrepancies and how the game’s called. And I’m not choosing your questions. So I think there’s probably something to that which is disappointing.”\n\n\r\n              QUOTABLE\n\n\r\n              Reaves on the fans being against him late in the game, despite many of them having cheered for him at Oklahoma: “It’s all fun,” he said. “I love those those types of moments. And, you know, that’s what we play the game for.” \n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host the Minnesota on Friday night.\n\n\r\n              Thunder: Host Utah on Friday night.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994114.443109
}