{
  "game_id": "0021800911",
  "espn_id": "401071584",
  "date": "Feb 27, 2019",
  "matchup": "CHA vs. HOU",
  "headline": "Harden, Capella lead Rockets past feisty Hornets 118-113",
  "body": "CHARLOTTE, N.C. --  Rockets coach Mike D'Antoni replaced Kenneth Faried in the starting lineup with Eric Gordon on Wednesday night, a move designed to cut down wear and tear on Chris Paul's body.\n\nThe reasoning behind the move was D'Antoni doesn't want Paul chasing point guards like Charlotte's Kemba Walker all over the court and running off screens this late in the season. Instead, the goal was to have Gordon cover Walker.\n\nWell, that plan got ditched after one half.\n\nPaul told D'Antoni at halftime he wanted to guard Walker after the Hornets three-time All-Star erupted for 27 points on 9-of-10 shooting. D'Antoni agreed, and the change worked -- Paul helped hold Walker to eight points in the second half as the Rockets escaped with a 118-113 win.\n\nJames Harden scored 30 points, Clint Capela had 23 points and a career-high 17 rebounds, and the Rockets won their third straight. Paul also heated up in the fourth quarter and finished with 17 points and 10 assists for the Rockets (36-25).\n\n\"I would rather not (guard Walker) as much as possible, but I also like playing defense,\" Paul said, adding that nobody in the league changes pace like Walker does, making him a difficult cover.\n\nIn his first game since ending his streak of 30-point games at 32, Harden struggled from the field, missing his first eight shots from 3-point range -- even having one blocked by Nic Batum, who gave the MVP candidate fits all night with his defense.\n\nHarden finished 10 of 29 from the field and 1 of 11 from 3-point range, but he made two clutch free throws with 14.6 seconds left to put the game away.\n\nHarden has been bothered by a neck injury the past few games.\n\n\"I'm trying to figure out how to run and move my neck at the same time,\" Harden said. \"Just getting a feel for the game, but I will be all right.\"\n\n\"He was just out of sync,\" D'Antoni said, saying the recent schedule got to him. \"And, the start to the year it takes him about three or four games to get back into rhythm. He will be fine and that is the least of my worries.\"\n\nHarden had plenty of support, especially from Capela, who was all over the glass.\n\nThe Rockets trailed by four entering the fourth quarter but opened with an 18-4 run behind six points from Paul, including four on fall-away mid-range jumpers.\n\nThe Hornets battled back behind Walker and Jeremy Lamb, who had 18 points and 14 rebounds, and had a chance to tie with 17 seconds left. Walker missed a leaning 3-pointer from the right wing and the Hornets fouled Harden, who made two free throws to make it a five-point game. Walker missed another 3 with seven seconds left.\n\n\"Maybe it was some attitude adjustments,\" D'Antoni said of his team's second-half defense. \"We just played harder. In the second quarter, we lost our spirit completely and (the Hornets) played well.\"\n\nThe Hornets are a half-game ahead of the Magic in the battle for the eighth playoff spot in the Eastern Conference.\n\n\"We just have to stay confident,\" Walker said. \"We are playing really hard, competing our butts off. That's really all that matters.\"\n\nTIP INS\n\nRockets: Scored 41 points in the first quarter on 61 percent shooting. ... Faried didn't start but still managed to pick up his fourth foul by the middle of the second quarter. ... Gordon had six points and missed all five 3-point attempts in the start.\n\nHornets: Walker became the first Eastern Conference player to reach 200 3-pointers when he buried a step-back jumper against Harden in the first quarter.\n\nPAUL'S RETURN\n\nPaul, who grew up in Winston-Salem and played at Wake Forest, said he enjoyed finally getting a chance to play a regular-season game in his home state. He'd missed the last two because of injuries.\n\n\"So I'm sure my grandparents and all my family -- all 300 of them that came to the game -- enjoyed it,\" Paul said with a laugh. \"It's nice to play here and not be in a suit.\"\n\nBATUM'S DEFENSE\n\nBatum's defense on Harden was outstanding all night as he flustered the MVP candidate at times and made a couple steals which led to dunks.\n\nBut Batum wasn't relishing in his effort after the game, saying \"we still lost the game so it doesn't mean anything to me. ... We did a good job, trying to contain them, had a game plan. But they made plays.\"\n\nUP NEXT\n\nRockets: Host Heat on Thursday night.\n\nHornets: Visit Nets on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994360.6445282
}