{
  "game_id": "401810097",
  "espn_id": "401810097",
  "date": "Nov 17, 2025",
  "matchup": "DET vs IND",
  "headline": "Duren’s 31 points in return power Pistons to 10th straight win; Pacers' skid reaches 8 games",
  "body": "DETROIT -- — Jalen Duren scored 31 points in his return from an ankle injury and Daniss Jenkins added 26 points as the short-handed Detroit Pistons won their 10th straight game, beating the NBA-worst Indiana Pacers 127-112 on Monday night.\n\n\r\n              The Pistons are on their longest winning streak since an 11-game run in 2007-08, despite playing the last three games without several key players. Cade Cunningham (hip), Tobias Harris (ankle) and Ausar Thompson (ankle) were among the players on the sidelines against Indiana. \n\n\r\n              The 1-13 Pacers, meanwhile, have lost eight straight games. The NBA finalists from a year ago are mired in their longest losing streak since the 2014-15 season. \n\n\r\n              Ten players scored for Detroit, with five reaching double figures. Javonte Green scored 20 points off the bench. Duncan Robinson had 13 points and Isaiah Steward 10.\n\n\r\n              Pascal Siakam led the Pacers with 29 points. Benedict Mathurin added 25 points as Indiana fell to 0-8 on the road.\n\n\r\n              Detroit took the lead for good with seven minutes to go in the first quarter when Robinson hit a 3-pointer, one of three on the night for the guard. Indiana stayed with the Pistons in the first quarter, though, entering the second quarter trailing by five thanks to 3-pointers by Siakam and Jay Huff. \n\n\r\n              The Pistons started the second period with a 20-4 run, increasing their lead to 21 points. Duren scored eight of his points during that run, which gave Detroit a 46-27 lead. Indiana responded with a 12-point run, trimming its deficit to 46-39 on an Andrew Nembhard 3-pointer with 3:49 to go in the second half.\n\n\r\n              Detroit closed the half on a 16-7 run, one in which five players scored, to take a 62-46 lead at the break. \n\n\r\n              The Pacers responded with a strong second half, even outscoring Detroit 56-55 after halftime. But it wasn’t enough to keep the Pistons from being the first team in the Eastern Conference to win 12 games. \n\n\r\n              Up next\r\n              Pacers: Visit the Atlanta Hawks on Tuesday. \n\n\r\n              Pistons: Host the Charlotte Hornets on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042641.772754
}