{
  "game_id": "0021900642",
  "espn_id": "401161284",
  "date": "Jan 20, 2020",
  "matchup": "CHA vs. ORL",
  "headline": "Fournier, Vucevic lead Magic past Hornets 106-83",
  "body": "CHARLOTTE, N.C. --  Evan Fournier has been dealing with an illness and was feeling incredibly sluggish before Orlando's game at Charlotte.\n\nSo the veteran guard did something he normally doesn't do, slugging down one of those tiny energy shots as he prepared to take the floor.\n\nHe said it immediately gave him a spark.\n\n\"It got me going,\" Fournier said with a wide smile as he held of the bottle. \"I just did it because I'm sick. I'm trying anything right now to give me some energy because otherwise I'm just going to be dead tired.\"\n\nIt seemed to work for Fournier, who scored 26 points in the Magic's 106-83 victory over the sliding Hornets on Monday.\n\n\"He was great,\" Magic coach Steve Clifford said. \"He's been hurt, he's been sick and he's playing through it. I mean he wasn't good tonight, he was great.\"\n\nNikola Vucevic added 24 points and 10 rebounds for Orlando, which closed out a six-game trip with a 3-3 record. Terrence Ross scored 16 of his 19 points in the first half.\n\nThe Magic shot 14 for 28 from 3-point range. Fournier made six 3s and Ross finished with five.\n\nMalik Monk scored 20 points and P.J. Washington had 19 for the Hornets, who have lost seven straight.\n\nOrlando began to take control with a 14-1 run to start the second quarter. Charlotte pulled within seven at the end of the third, but the Magic put together a strong finish.\n\nOrlando blew the game open with a 27-8 run to start the final period. Fournier made a pair of 3s, Vucevic scored five quick points and Ross threw down a thunderous slam. Fournier and Vucevic each scored 12 in the fourth.\n\n\"The second half was one of the best we've played this season,\" Clifford said.\n\nCharlotte has gotten most of its scoring this season from Devonte Graham and Terry Rozier, but both guards struggled against the Magic. Graham shot 5 of 17 and had 15 points, while Rozier was held to four points after missing each of his six field goal attempts.\n\nCharlotte was held to 38.2% percent shooting from the field and turned the ball over 18 times, leading to 14 points for the Magic.\n\n\"They weren't running anything tricky,\" Hornets coach James Borrego said. \"These aren't things that we haven't seen or any surprises with any plays. This is strictly just horrible execution, poor awareness, lack of professionalism coming out of the second quarter.\"\n\nTIP INS\n\nMagic: Clifford cost his team when he challenged a defensive foul call in the third quarter. Officials didn't change the foul call, then ruled the Magic also had goaltended on the foul, creating a three-point play opportunity for Charlotte.\n\nHornets: Both teams wore gray shooting shirts during warmups with the words \"We cannot walk alone,\" in honor of Martin Luther King Jr. ... Graham has made 164 3-pointers through 45 games this season, which leads the Eastern Conference.\n\nROAD TRIP OVER\n\nThe Magic have been on the road for nearly two weeks. Clifford said he was impressed by his team's focus -- and he's eager to back home.\n\n\"That was one of our best wins, because of our approach,\" Clifford said. \"Coming off a poor performance, fly across the country, five o'clock (start), we could have had excuses. But I thought our attitude was great and it set the whole thing up.\"\n\nAdded Vucevic: \"Our defense was great. Our energy was great. Out attitude was great. We just really wanted it and we were able to get a great win against a tough team. \"\n\nSTRONG FINISHERS\n\nThe Magic improved to 18-1 this season when leading entering the fourth quarter.\n\n\"We got to keep doing it, keep finding a way to play, sticking with it and playing solid defense,\" Ross said.\n\nIN SEARCH OF THE RIGHT ROTATION\n\nWith his team down by 17 points and in need of a spark, Borrego turned to Cody Martin and Bismack Biyombo off the bench. Charlotte cut the lead to seven, but couldn't sustain the momentum in the fourth quarter.\n\nBiyombo has gone from starting center to third string behind Cody Zeller and Willy Hernangomez as Borrego continues to shake things up looking to snap the losing streak.\n\nUP NEXT\n\nMagic: Face the Thunder on Wednesday night in the team's first home game since Jan. 8.\n\nHornets: Frenchman Nic Batum and the rest of the Hornets will head to Paris, France for Friday's game against the Bucks.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996066.824754
}