{
  "game_id": "0022000702",
  "espn_id": "401307491",
  "date": "Mar 27, 2021",
  "matchup": "SAC vs. CLE",
  "headline": "Kings beat Cavs on Barnes' 3-pointer at the buzzer",
  "body": "SACRAMENTO, Calif. -- — Harrison Barnes hit a 3-pointer at the buzzer after catching an inbounds pass from the opposite end of the court and the Sacramento Kings beat the Cleveland Cavaliers 100-98 on Saturday night.\n\n\r\n                    Barnes finished with 16 points and 11 rebounds. De’Aaron Fox scored 20 of his 36 points in the fourth quarter to go with six assists, and Richaun Holmes added 10 points and 14 rebounds.\n\n\r\n                    “Big-time catch-and-shoot by Harrison,” Kings coach Luke Walton said. “He kept his composure. He had enough time on the clock. He was nice, calm and relaxed and made the shot.”\n\n\r\n                    Sacramento has won four straight, matching its longest streak of the season.\n\n\r\n                    Collin Sexton scored 26 points, including a layup with 1.6 seconds remaining after Holmes was called for goaltending.\n\n\r\n                    That made it 98-97. Fox then heaved the ball from one baseline to Barnes, who caught the ball near the Cavs bench and took a few steps before turning and launching a 26-footer over a pair of defenders as the buzzer sounded. \n\n\r\n                    “I played quarterback growing up. I led him, he was open,” Fox said. “That’s a tough shot. You can’t draw up that shot.”\n\n\r\n                    As soon as the ball went through the net, Kings players stormed the court and mobbed Barnes.\n\n\r\n                    “It was a great pass by Fox,” Barnes said. “He put the ball right in the spot where I was able to turn and get a look. Luckily it dropped.”\n\n\r\n                    The play was reviewed and upheld.\n\n\r\n                    Darius Garland had 18 points for Cleveland, which led for most of the fourth quarter.\n\n\r\n                    “Fought to the end, fought to the wire,” Sexton said. “That was a tough shot (by Barnes) and we have to live with those.”\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Sexton had missed the previous two games with a sore right hamstring. … Cleveland is 4-25 when trailing at halftime.\n\n\r\n                    Kings: Marvin Bagley (broken finger) missed his sixth consecutive game.\n\n\r\n                    WALTON CRIES FOUL\n\n\r\n                    Walton criticized the referees after the Kings took 14 free throws while the Cavs took 23. Sacramento’s coach was particularly upset over the lack of calls for Fox, who made all four of his free throws. \n\n\r\n                    “When the team and De’Aaron are playing that aggressively, there has to be foul calls made,” Walton said. “To shoot four free throws on our home court, that is not right. He’s not getting the foul calls that should be made for him and that’s not right.”\n\n\r\n                    CAVS GO SMALL\n\n\r\n                    The Cavs were without a true center after Jarrett Allen was held out for the first time since being acquired from Brooklyn as part of a multi-team trade in January. Allen suffered a concussion after getting elbowed in the head during Friday’s game against the Lakers.\n\n\r\n                    That left Cleveland in a bind and forced Larry Nance Jr. to move from forward to center. On Friday, the Cavs agreed to a buyout with Andre Drummond. JaVale McGee was traded to Denver before the deadline. The Cavs got 7-footer Isaiah Hartenstein in return but Hartenstein was held out after arriving in Sacramento by plane earlier in the day.\n\n\r\n                    KINGS NEWCOMERS PLAY\n\n\r\n                    Two days after being acquired in a series of trades, Kings newcomers Delon Wright, Terence Davis II and Moe Harkless were on the floor together as part of Sacramento’s second unit late in the first quarter.\n\n\r\n                    Wright scored the first points for the trio, spinning past Cleveland’s Dean Wade for a layup and foul. He finished with four points, Davis had six and Harkless added two assists and one rebound.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Visit the Jazz on Monday. \n\n\r\n                    Kings: Head to San Antonio for two games against the Spurs, on Monday and Wednesday. \n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997954.896629
}