{
  "game_id": "0022100460",
  "espn_id": "401360284",
  "date": "Dec 20, 2021",
  "matchup": "MEM vs. OKC",
  "headline": "Gilgeous-Alexander, Thunder beat Grizz in Morant's return",
  "body": "MEMPHIS, Tenn. -- — Shai Gilgeous-Alexander scored 23 points, Josh Giddey added 19 points and 11 assists, and the Oklahoma City Thunder beat Ja Morant and the Memphis Grizzlies 102-99 Monday night.\n\n\r\n              Morant returned from injury and the league’s COVID-19 protocols after a 12-game absence and finished with 16 points. Desmond Bane led Memphis with 25 points and Dillon Brooks scored 19.\n\n\r\n              Morant, the team’s leading scorer at 24.1 points per game, said it was frustrating to lose the day he returned, but added he was excited to be back on the court.\n\n\r\n              “I’m right there,” Morant said. “I’m definitely real close.”\n\n\r\n              In 28 minutes, Morant made 6 of 12 shots and had a team-high eight assists, but he couldn’t help the Grizzlies avoid a second consecutive loss.\n\n\r\n              The Thunder overcame an 89-84 deficit in the final 4:36 and took the lead for good at 96-95 on Giddey’s layup with 50 seconds remaining. Gilgeous-Alexander added a dunk on an inbounds pass from Giddey and two free throws in the final 16.6 seconds.\n\n\r\n              “We made a lot of plays down the stretch and that’s why we won the game,” Giddey said. “In our last three games, we have executed as good as we could have (in the closing minutes).”\n\n\r\n              The last time these teams met, the Grizzlies set an NBA record for margin of victory in a 152-79 thrashing. In the Dec. 2 game — also at FedExForum — Memphis established franchise records for bench points (93) and field goals made (60).\n\n\r\n              It appeared as if the Grizzlies were going to make another run at a lopsided win at the outset.\n\n\r\n              Memphis took advantage of poor shooting by the Thunder to build a 16-point lead early in the first half. The Thunder missed 12 of their first 14 shots and trailed 39-23 with eight minutes left in the second quarter.\n\n\r\n              The Grizzlies failed to capitalize, and the Thunder rebounded. Memphis went five minutes without a field goal shortly afterward and Oklahoma City rallied. With 1:17 to go before the half, the Thunder tied it at 45 on Giddey’s corner 3.\n\n\r\n              “We kind of stabilized the game after those first four minutes when we fell behind 13-2,” Thunder coach Mark Daigneault said. “They threw the first punch and then from there, I thought we really got our defense into the game.”\n\n\r\n              The Grizzlies led 50-47 at halftime but shot only 39%. The Thunder shot 51% (31 of 61) in the final three quarters after shooting 23% in the first.\n\n\r\n              Oklahoma City surged ahead 69-60 late in the third quarter as Luguentz Dort recovered from 1-for-9 shooting in the first half. Dort made three 3-pointers in the quarter, and the Thunder briefly led by 10 points before ending the period with a 74-72 advantage.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Point guard Tyus Jones did not play because a sprained right finger. Jones started during Morant’s 12-game absence. ... Center Steven Adams had 12 rebounds in the first eight minutes of the opening quarter, the most by a player in a single quarter this season. He finished with 14.\n\n\r\n              Thunder: Darius Bazley did not start for the second consecutive game. He was demoted before Saturday’s 104-103 win over the Clippers. Bazley is averaging 8.6 points, down from the 13.7 he averaged last season.\n\n\r\n              WELCOME BACK?\n\n\r\n              Morant said he was frustrated by fans sitting courtside who were wanting him to come out of the game.\n\n\r\n              “During the game, running down the court, I heard some of our fans courtside tell me I needed to sit back down,” he said. “These were same fans who were shouting `MVP, MVP’ (earlier in the season after a strong start by Morant).” \n\n\r\n              The Grizzlies went 10-2 during Morant’s absence, including the 73-point victory over Oklahoma City on Dec. 2.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Denver on Wednesday night.\n\n\r\n              Grizzlies: At Golden State on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992811.017652
}