{
  "game_id": "0022300074",
  "espn_id": "401584702",
  "date": "Oct 25, 2023",
  "matchup": "LAC vs. POR",
  "headline": "Leonard and George dominate in Clippers' 123-111 win over the Trail Blazers to open the season",
  "body": "LOS ANGELES -- — Paul George scored 27 points and Kawhi Leonard added 23 to lead five players in double figures as the Los Angeles Clippers beat the Portland Trail Blazers 123-111 in their season opener Wednesday night.\n\n\r\n              The Clippers had Leonard and George together for just 38 games last season, when both were derailed by injuries and the team lost in the first round of the playoffs. But they’re healthy and in the lineup at the same time now, raising expectations for the Clippers as they pursue the franchise’s first NBA championship.\n\n\r\n              “It feels good,” Leonard said. “I'm happy I had a good offseason and I'm able to get back healthy.”\n\n\r\n              Ivica Zubac had 20 points and 12 rebounds, and Russell Westbrook added 11 points and 13 assists — making him the first Clippers player with at least 13 assists in a season opener since Andre Miller in October 2002.\n\n\r\n              Leonard made all five of his 3-point attempts and the Clippers hit 16 total, the most in a season opener in franchise history. Their 36 assists also were the most in an opener.\n\n\r\n              “I love how hard we played tonight and how we competed,” coach Tyronn Lue said. “We've got to keep putting it together every night.” \n\n\r\n              Malcolm Brogdon scored 20 points off the bench to lead the Blazers, who opened the season without Damian Lillard. They traded him to Milwaukee in September, ending an 11-year run in Portland that included seven All-Star selections and eight playoff appearances.\n\n\r\n              Portland's Anfernee Simons added 18 points and Deandre Ayton had 12 rebounds while in foul trouble most of the game. The Blazers had six players in double figures.\n\n\r\n              The Clippers controlled the game from the start and never trailed. They led by 30 in the second half. Seven of their first eight baskets were dunks, with five different players contributing. In all, they had 16 dunks.\n\n\r\n              “Russ starting the game was tremendous,” Lue said. “He really led the charge for us.”\n\n\r\n              Los Angeles pulled away to a 20-point lead with a 20-7 run in the second quarter. George scored 10 points and four players hit 3-pointers during the spurt.\n\n\r\n              Turnovers were a problem, though. The Clippers committed 17, with four each by Leonard and George.\n\n\r\n              Terance Mann, who had been named the Clippers' fifth starter, sat out with a sprained ankle. Robert Covington replaced him and had five points.\n\n\r\n              Portland guard Scoot Henderson started in his NBA debut and had 11 points in 36 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host Orlando on Friday in their home opener.\n\n\r\n              Clippers: Visit Utah on Friday in a one-game trip. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996441.5784209
}