{
  "game_id": "0022200881",
  "espn_id": "401469036",
  "date": "Feb 15, 2023",
  "matchup": "DEN vs. DAL",
  "headline": "Green helps Nuggets go into break with 118-109 win over Mavs",
  "body": "DENVER -- — Reserve Jeff Green scored a season-high 24 points, Nikola Jokic notched his 21st triple-double of the season and the Denver Nuggets headed into the All-Star break with a 118-109 victory over the short-handed Dallas Mavericks on Wednesday night.\n\n\r\n              Nikola Jokic finished with 14 points, 13 rebounds and 10 assists for the Western Conference-leading Nuggets, who moved to an NBA-best 27-4 at home this season. Michael Porter Jr. hit five 3-pointers and finished with 22 points. \n\n\r\n              “For us to continue to find ways to win and have different guys step up every night, I think it speaks to our chemistry, our depth,\" Nuggets coach Michael Malone said. \"We’ve got a really good team in there.”\n\n\r\n              Luka Doncic had 37 points in leading a banged-up Dallas team that was missing guard Kyrie Irving due to lower-back tightness. Doncic and Irving have played alongside each other in two games since Irving was acquired as part of a deal with Brooklyn on Feb. 6. \n\n\r\n               The Nuggets led by 21 in the fourth quarter, only to see the Mavericks cut it to 105-95 with 5:50 remaining on Christian Wood's layup. Soon after, Porter blocked a shot on one end, raced back and hit a 3-pointer on the other to gain some breathing room. \n\n\r\n              Where it really got away from the Mavs, coach Jason Kidd conceded, was in the second, when the Nuggets broke open a one-point game with a 35-19 quarter.\n\n\r\n              “You’re sitting in a good place against the best team in the West and so we have to look at doing a better job,” Kidd said. \n\n\r\n              The two teams split their four-game season series. \n\n\r\n              View Denver as a favorite?\n\n\r\n              “When you have a guy like Jokic on your team, you're the favorite,\" Doncic said. \n\n\r\n              Jokic joined some exclusive company by going over 500 assists and 500 rebounds before the All-Star break. The other NBA players to accomplish the feat were Russell Westbrook (three times, ’16-17, ’17-18, ’18-19) and Oscar Robertson (’61-62).\n\n\r\n              Jokic, the two-time reigning MVP, remains on pace to average a triple-double this season.\n\n\r\n              “He makes it look like a walk in the park,” recently acquired backup center Thomas Bryant said of Jokic's ease with triple-doubles. “It’s not easy at all.” \n\n\r\n              Doncic's big night was his 65th career game with 35 or more points. Only LeBron James had more (87) before his 24th birthday. Doncic turns 24 on Feb. 28.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: F Justin Holiday was signed Wednesday. He played in 28 games for Atlanta this season and averaged 4.5 points. ... F Davis Bertans (calf), G Tim Hardaway Jr. (hamstring) and F/C Maxi Kleber (hamstring) were inactive.\n\n\r\n              Nuggets: Denver was without guard Jamal Murray (right knee inflammation) along with forward Aaron Gordon (bruised ribs). \n\n\r\n              FRIENDLY REMINDER\n\n\r\n              Malone made sure to remind his team the All-Star break didn’t begin until 11 p.m. — well after their game. They listened. \n\n\r\n              “Times have changed, guys get their private jets running, waiting to go somewhere,” cracked Malone, who will coach Team LeBron at the All-Star Game. \n\n\r\n              COLORADO KID\n\n\r\n              Backup guard Reggie Jackson jumped at the chance to sign with the Nuggets and play close to home. Jackson, who grew up down the road in Colorado Springs, agreed to a deal with Denver on Tuesday. He wasn't in uniform against Dallas. \n\n\r\n              The 32-year-old Jackson's favorite player as a kid was Chauncey Billups, the Denver native who went to the University of Colorado before embarking on a long NBA career. \n\n\r\n              Jackson will wear No. 7 with Denver — a number Billups wore in 2009 while with the Nuggets. \n\n\r\n              UP NEXT\n\n\r\n              Mavericks: After the All-Star break, start a six-game homestand against San Antonio on Feb. 23. \n\n\r\n              Nuggets: At Cleveland on Feb. 23.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994690.581541
}