{
  "game_id": "0021600721",
  "espn_id": "400900142",
  "date": "Jan 30, 2017",
  "matchup": "DET @ BOS",
  "headline": "Thomas scores 41 for Celtics in 113-109 win over Pistons",
  "body": "BOSTON --  After mixing and matching to get Isaiah Thomas better looks, the Boston Celtics just set their All-Star point guard loose.\n\nThomas came through again, scoring 24 of his 41 points in the fourth quarter as the Celtics held off the Detroit Pistons 113-109 on Monday night.\n\n\"He was unbelievable -- again,\" coach Brad Stevens said. \"They kind of kept us off balance with their coverages so we just tried to get him off the ball some. And then when he got going late, he just got going so it didn't matter he was off the ball or on the ball.\"\n\nThomas extended his run of games with at least 20 points to 32 in a row and carried Boston down the stretch, making nine free throws in the fourth quarter while going 15 for 15 from the line.\n\nThe Pistons held Thomas in check through the first three quarters. Thomas had 13 points at halftime and scored just four points in the third quarter, then took over in the fourth.\n\n\"I always just try to get a little more aggressive to score, to make plays,\" Thomas said. \"They started switching a lot in the fourth quarter and then Brad calls in some really good plays to get the spacing right. We had nice spacing, things opened up for me and I just took advantage of it.\"\n\nThomas also had eight assists while leading the Celtics to their fourth straight win. Jae Crowder added 21 points and Al Horford scored 13 for Boston, which had to rally after Detroit surged midway through the fourth quarter and the teams traded the lead.\n\nAndre Drummond had 28 points and 22 rebounds for the Pistons, who outscored Boston 60-38 in the paint. Kentavious Caldwell-Pope added 18 points for Detroit, which lost its third straight.\n\nCoach Stan Van Gundy said his team played well enough to win and blamed himself for not coming up with a way to stop Thomas in the fourth.\n\n\"The only person I'm upset with right now is myself,\" he said. \"You've got to do a better job than what I did tonight in the fourth quarter. I'm upset at myself, but I was happy with our guys. I thought they fought really, really hard.\"\n\nBoston led 109-107 with 31 seconds left and gave the Pistons a chance with a backcourt violation. Reggie Jackson drove for a layup, but missed and Jonas Jerebko pulled down the rebound for Boston. The Pistons ended up fouling Thomas, who hit both free throws and added two more with 7.5 seconds remaining.\n\nTIP-INS\n\nPistons: Detroit was 1 of 15 on 3-pointers in the first half. ... Van Gundy called President Donald Trump's travel ban \"scary\" when asked about it before the game, saying the policy reminded him of Japanese internment camps and Hitler's treatment of the Jews. \"It's starting to get really, really scary stuff now. We're getting into the days of, now we're judging people by their religion -- trying to keep Muslims out.\"\n\nCeltics: Marcus Smart hit a 3-pointer at the buzzer that gave Boston a 26-25 lead after the first quarter. ... Horford returned after missing the previous two games with a strained groin. ... G Avery Bradley (sore right Achilles' tendon) missed his seventh straight game. Stevens said Bradley is getting closer to being able to practice, but was not sure how soon he could play again.\n\nGOOD COMPANY\n\nThomas averaged 32.5 points in January, the third-highest monthly average in team history. Paul Pierce averaged 33.5 in February 2006, and Larry Bird averaged 33.1 points in February 1988.\n\n\"That doesn't even seem real. It doesn't sound real,\" Thomas said. \"To have my name up there with those legends is unbelievable. Just keep going, keep trying to catch those guys and keep winning.\"\n\nBIG D\n\nBoston seems to bring out the best in Drummond. In the first three meetings, Drummond totaled 68 points and 58 rebounds. His 28 points Monday tied his season high.\n\n\"I really liked his effort tonight,\" Van Gundy said. \"If he continues to play like that, we're going to have a chance to turn this around.\"\n\nUP NEXT\n\nPistons: Are back at home for their next two, starting with New Orleans on Wednesday night.\n\nCeltics: Host Toronto on Wednesday night. The Celtics lead the Raptors by a game in the Atlantic Division.",
  "source": "espn_api",
  "crawled_at": 1764996052.67127
}