{
  "game_id": "0021600155",
  "espn_id": "400899605",
  "date": "Nov 15, 2016",
  "matchup": "CHA @ MIN",
  "headline": "Walker, Hornets snap 2-game skid with win over Timberwolves",
  "body": "MINNEAPOLIS --  Charlotte coach Steve Clifford's fiery halftime speech got his team going in the right direction.\n\nMinnesota Timberwolves coach Tom Thibodeau saved his hollering for after the game because his team is headed in the wrong one.\n\nKemba Walker scored 30 points and the Hornets blitzed the Timberwolves in the third quarter on their way to a 115-108 victory on Tuesday night.\n\nFrank Kaminsky scored 12 of his 20 points in the fourth quarter for the Hornets (7-3), who snapped a two-game skid. Nicolas Batum had 16 points and seven assists, and Charlotte outscored Minnesota 36-17 in the third quarter to wipe out a 12-point halftime deficit.\n\n\"It was perfect timing, and we needed it,\" Walker said of Clifford's speech. \"We just (weren't) ourselves, and he got into us a little bit. It worked out for us, because we needed to pick our energy up.\"\n\nAndrew Wiggins scored 29 points and Karl-Anthony Towns had 21 points and eight rebounds for the Timberwolves, who fell to 1-2 on their four-game homestand. Minnesota turned the ball over 18 times, which led to 20 points for Charlotte.\n\nThe teams entered the game on opposite ends of the spectrum in the third quarter this season. Charlotte leads the league in scoring differential coming out of the break, while Minnesota is dead last.\n\nThe Timberwolves have built double-digit leads in the first half in eight of their first 10 games, but have lost six of them thanks to the failings in the third. That trend continued on Tuesday, with Charlotte opening the third with a 15-2 run and closing it with a 21-4 surge.\n\n\"Very concerned,\" Thibodeau said. \"It tells you we're not learning. That bothers me.\"\n\nWiggins rallied the Wolves in the fourth, giving them a 92-91 lead with a 3-pointer. But Kaminsky responded with a 3 and a three-point play, and Clifford got the best of his longtime friend.\n\n\"We've got guys who have been in the league for a while now,\" Thibodeau said. \"We're making mistakes that never should be made.\"\n\nWALKER'S BACK\n\nA scary moment happened at the end of the first quarter when Walker, who scored 12 points on 6-for-7 shooting in the period, went to the locker room. The team said his back tightened up and he went back to get stretched out.\n\nWalker was able to return to the game midway through the second quarter and played the rest of the game with no visible issues.\n\n\"My training staff, they're the best,\" Walker said. \"They did a great job at looking out for me when I came out the game with the heat pack, good massages, things like that. But I'm feeling good though.\"\n\nBADGERING TOWNS\n\nKaminsky was on the Wisconsin team that stunned Towns and previously undefeated Kentucky in the Final Four two years ago. After ruining Towns' shot at history in college, Kaminsky helped spoil the reigning Rookie of the Year's 21st birthday on Tuesday.\n\n\"I don't have anything against him. He's a great player,\" Kaminsky said. \"I just want to go out there and compete.\"\n\nLAVINE RETURNS\n\nTimberwolves shooting guard Zach LaVine missed the win over the Lakers on Sunday with a sore right knee, something he said he's been dealing with for more than a week. He looked just fine on Tuesday, hitting his first four 3s and finishing with 19 points in 33 minutes.\n\nTIP-INS\n\nHornets: They shot 53.8 percent from the field and made 11 of 24 3s, including eight of their last 14. ... Clifford said G Jeremy Lamb, who has missed the last seven games with a strained left hamstring, practiced on Monday and will work out on Wednesday and Thursday back in Charlotte with the possibility of playing on Friday night against Atlanta.\n\nTimberwolves: F Shabazz Muhammad (right knee) and G/F Brandon Rush (right big toe) both were out. Rush said he hopes to be ready to play on Thursday. ... After shooting 22 free throws on Sunday, Wiggins was just 6 for 9 on Tuesday.\n\nUP NEXT\n\nHornets: Head home to host Atlanta, Marvin Williams' former team, on Friday.\n\nTimberwolves: Wrap up a four-game homestand by hosting Philadelphia on Thursday in a game to be televised on TNT.",
  "source": "espn_api",
  "crawled_at": 1764995543.266439
}