{
  "game_id": "0022300485",
  "espn_id": "401585113",
  "date": "Jan 05, 2024",
  "matchup": "MIN @ HOU",
  "headline": "Anthony Edwards scores 24 points, West-leading Timberwolves beat Rockets 122-95",
  "body": "HOUSTON -- — Anthony Edwards scored 24 points, Karl-Anthony Towns had 22 and the Western Conference-leading Minnesota Timberwolves beat the Houston Rockets 122-95 on Friday night.\n\n\r\n              Edwards had a relatively quiet game considering he entered the night averaging 36.3 points in his previous four games. He had scored at least 25 points in 10 straight games but went 8 for 17 from the field in 32 minutes Friday. Towns added eight rebounds and six assists.\n\n\r\n              “Just having that tenacity and physicality, making it difficult on opponents and making every possession a difficult shot,” Towns said. “Just doing more of that and getting back to that, we knew was important.”\n\n\r\n              Jalen Green led Houston with 20 points, Alperen Sengun had 19 points and Jabari Smith Jr. added 16. The Rockets are 2-4 on a seven-game homestand.\n\n\r\n              “I don’t really know if it was our lack of scoring or quality shots,” Rockets coach Ime Udoka said. “I think they bullied us. It may not have anything to do with our offense, but I thought it was our poorest game from the standpoint of matching physicality and competitiveness and toughness tonight.”\n\n\r\n              Houston has lost eight of the last nine meetings with Minnesota. The outsized Rockets were outscored 60-46 in the paint and outrebounded 51-39.\n\n\r\n              “Everybody played great tonight, everybody was happy,” Edwards said. “It was a great overall team win so it was dope.”\n\n\r\n              Minnesota improved to 25-9. The Timberwolves led by 33 and entered the fourth quarter up 84-72.\n\n\r\n              “I saw our defense in a lot of different ways,” Timberwolves coach Chris Finch said. “They were into it. They were being bothersome, and everybody was out there making grimy defensive plays. That’s the way we’ve got to be. It all started with our attention to detail and defense.”\n\n\r\n              Rockets forward Dillon Brooks remained sidelined for a fifth straight game because of a strained right abdominal oblique.\n\n\r\n              Houston briefly led in the first quarter but trailed much of the game. Minnesota held a 56-46 lead at halftime.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Dallas on Sunday night.\n\n\r\n              Rockets: Host Milwaukee on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996477.801127
}