{
  "game_id": "0021500496",
  "espn_id": "400828383",
  "date": "Jan 02, 2016",
  "matchup": "PHX @ SAC",
  "headline": "Kings scorch Suns to move George Karl into tie for 5th all time in wins",
  "body": "SACRAMENTO, Calif. -- Sacramento Kings coach George Karl shrugged off his milestone 1,155th victory Saturday, preferring to focus on his team's current plight, rather than tying Phil Jackson for the fifth-most career victories in NBA history.\nDeMarcus Cousins had 32 points and nine rebounds to help give Karl and the struggling Kings some temporary relief with a 142-119 victory over the Phoenix Suns, who lost their eighth in a row.\nIt has been a long journey for the 63-year-old Karl, who has a sparkling 1,155-795 record in 27 seasons and has twice overcome cancer in a five-year period. Now he is tasked with turning around a team that has experienced nine straight losing seasons.\nKarl has a combined 23-39 record with the Kings, including a 13-20 mark this season, which has been characterized by erratic play. The latest loss was an agonizing one Wednesday at home against Philadelphia, which has the NBA's worst record.\n\"Our record brings a lot of energizing drama to our team, and in today's world, it gets magnified in a crazy way,\" Karl said. \"Our team has done a better job with what they have been dealt than people give them credit for most of the time.\"\nKarl isn't comparing himself to Jackson, but he planned to enjoy the win.\n\"The beer will taste like champagne,\" Karl said. \"It's good, a fun thing with my family, my son, my daughter, my son-in-law and staff. We joke about it all the time. As I said before, he's a great coach, maybe the best. I don't know what our record is against him, but I'm pretty sure it's not very good.\"\nKarl's latest team was very good in the second half. The point total was the most scored by the Kings since they recorded a Sacramento-era record 154 points against Philadelphia 23 years ago on Jan. 2, 1993.\nDarren Collison had 21 points and six assists, and Marco Belinelli had 19 points for the Kings. Rudy Gay added 16 points, and Rajon Rondo had 15 points and 15 assists. The Kings shot 61.6 percent in snapping a three-game skid.\n\"When we get stops, we are at our best,\" Rondo said. \"We were moving the ball, everyone was getting touches, and we were in rhythm. It was contagious.\"\nBrandon Knight had 23 points and Devin Booker had 21 for the Suns, who have lost 10 of 11. T.J. Warren scored 19 points, and Mirza Teletovic had 13.\nWith 12 straight points in the third quarter, the Kings erased a four-point deficit. Cousins and Rondo both had nine points, and Sacramento produced a season-high 44-point quarter in taking a 103-87 lead into the fourth.\n\"We have to continue to play no matter what happens throughout the game,\" Knight said. \"In the third quarter, we stopped getting stops, and they started to open up their lead by making shots. If you don't get stops in this league, it makes it tough to win.\"\nCHANDLER QUESTIONS EJECTION\nChandler, who started at center, was ejected after arguing a foul in the third quarter. After being called for his fourth personal, Chandler made the \"T\" sign with his hands and quickly drew one technical then an ejection from referee J.T. Orr.\n\"I wasn't expecting that quick of a trigger for two technical fouls,\" said Chandler, who played just more than 12 minutes. \"That might be the first ever in the league to get two technical fouls for the price of one. As soon as I started arguing, he threw me out.\"\nHORNACEK STUCK ON 99\nSuns coach Jeff Hornacek remains one win away from 100 career victories. He has been stuck on 99 for just more than two weeks, with his latest win coming Dec. 18.\nHe had praise for Karl's accomplishment.\n\"He's been coach a long, long time. Even I've played against him,\" Hornacek said. \"But he's always done a great job with his teams, and they've always been high-scoring and high-flying teams. He's one of those great coaches of all time with a lot of wins he's racked up.\"\nTIP-INS\nSuns: The two teams have a combined seven players from the University of Kentucky. ... Disgruntled forward Markieff Morris didn't play for a second straight game.\nKings: San Francisco Giants reliever Sergio Romo sat in a courtside seat for a second straight game. ... The Kings had a 23-2 first-quarter run, after which they led by 17 points. ... Willie Cauley-Stein, a rookie, returned for the first time since Dec. 3, when he went out with a dislocated right finger. He played the game's final five minutes. ... Cousins gave Karl a high-five after the coach was called for a second-quarter technical. ... Rondo, the NBA assists leader, has recorded 10 or more assists 20 times. ...\nUP NEXT\nSuns visit the Lakers on Sunday.\nKings visit Oklahoma City on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994858.7671528
}