{
  "game_id": "0022200338",
  "espn_id": "401468493",
  "date": "Dec 03, 2022",
  "matchup": "LAC vs. SAC",
  "headline": "Sabonis scores 24, leads Kings' 123-96 rout of Clippers",
  "body": "LOS ANGELES -- — Domantas Sabonis scored 24 points on 10-of-11 shooting and the Sacramento Kings handed the undermanned Los Angeles Clippers their worst loss of the season, 123-96 on Saturday.\n\n\r\n              Sabonis set the tone with 15 points in the opening quarter and the Kings' bench kept it going in the second, building a 28-point lead. They led by 29 in the third and by 31 in the fourth.\n\n\r\n              “While everyone warms up, I’m always ready,” Sabonis said. “I feel like that’s where I can take advantage.”\n\n\r\n              Sabonis made both of his two 3-point attempts in the game and hit 2 of 3 free throws. He had six assists and five rebounds despite five fouls.\n\n\r\n              Keegan Murray added 23 points and D'Aaron Fox had 14 points for the Kings, who won their second straight.\n\n\r\n              The Clippers were again without Paul George (right hamstring tendon strain) and Kawhi Leonard (right ankle sprain), as well as Luke Kennard and Norman Powell. George and Leonard are expected to join the team on their upcoming road trip.\n\n\r\n              “We have to hold it up until they're back and then when they're back, hopefully soon, we can build some chemistry out on the court and some consistency,” said Ivica Zubac, who had 13 points and 15 rebounds for his 10th double-double of the season and third in four games. \n\n\r\n              Brandon Boston Jr. scored 18 points off the bench for the Clippers. Terance Mann added 13 points.\n\n\r\n              One of the surprise teams of the young NBA season, the Kings have played well under new coach Mike Brown. They are 12-9 and fifth in the Western Conference standings.\n\n\r\n              “We really didn't have any expectations because we're a new team and figuring each other out,” said Malik Monk, who had 13 points. “We were going to have a chance every night because we've got great guys that can put the ball in the basket and defend, too.”\n\n\r\n              They got out and ran in transition against the Clippers in the first quarter when the Kings shot 68% from the floor. Three of the Clippers' five starters were held scoreless in the period.\n\n\r\n              “On the road, you have to win the possession game. I thought our guys did a great job at taking care of the ball as well as sharing it with one another, 31 assists, just nine turnovers,” Brown said. “It was just a good road win for us.” \n\n\r\n              The Kings opened the second with an 18-4 run to lead 56-28. The Clippers closed with a 10-4 spurt to trail 60-38 at the break. \n\n\r\n              Sacramento outscored the Clippers 12-0 early in the third, taking a 74-45 lead. Sabonis had five points and Harrison Barnes hit a 3-pointer in the spurt. \n\n\r\n              The Kings' 12-0 run to start the fourth pushed their lead to 102-74. Kevin Huerter and Murray each had 3-pointers. \n\n\r\n              HE SAID IT\n\n\r\n              “There’s no nap, which is hard. I love taking my nap.” — Sabonis on early tipoffs.\n\n\r\n              TIP-INS\n\n\r\n              Kings: Huerter rolled his ankle in the third and had it wrapped after the game. ... Evened the season series at a game apiece after losing 111-109 in the first meeting.\n\n\r\n              Clippers: Reggie Jackson took a hard fall, his second this week. He left the court but later returned. ... Held to 14 points in the second, their lowest-scoring quarter of the season. ... Powell sat out his second straight game with a left groin strain. ... Kennard (right calf strain) missed his 10th game of the season.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Chicago on Sunday in the second game of a back-to-back.\n\n\r\n              Clippers: Visit Charlotte on Monday to open a four-game East Coast trip.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994987.833083
}