{
  "game_id": "401809962",
  "espn_id": "401809962",
  "date": "Oct 26, 2025",
  "matchup": "CLE vs MIL",
  "headline": "Mitchell scores 24, Mobley goes perfect at free throw line as Cavaliers edge Bucks 118-113",
  "body": "CLEVELAND -- — Donovan Mitchell scored 24 points, including 10 in the fourth quarter, Evan Mobley added 23 and the Cleveland Cavaliers held off the Milwaukee Bucks 118-113 on Sunday night to win their home opener.\n\n\r\n              Mobley was a career-best 12 for 12 on free throws along with eight rebounds and six assists. The last Cavaliers player to go perfect from the line when making 12 or more attempts was LeBron James on Nov. 5, 2014, against Utah. James was also 12 of 12.\n\n\r\n              It was the 23rd time in franchise history a Cleveland player made all of his free throws when making 12 or more trips.\n\n\r\n              Sam Merrill added 17 points and De'Andre Hunter — who missed the first two games due to a bruised right knee — scored 16 as Cleveland won its second straight after dropping its opener.\n\n\r\n              Milwaukee's Giannis Antetokounmpo was one assist shy of a triple-double with 40 points and 14 rebounds. AJ Green had 20 points.\n\n\r\n              The Bucks were missing Kyle Kuzma (left ankle sprain), Cole Anthony (illness) and Kevin Porter Jr. (left ankle sprain).\n\n\r\n              Milwaukee trailed by 18 midway through the third quarter but a driving dunk by Ryan Rollins tied it at 98 with 6:54 remaining. \n\n\r\n              After Rollins' dunk, the Cavaliers scored seven straight points on Hunter's stepback jumper, Lonzo Ball's 3-pointer and Mitchell's 14-footer.\n\n\r\n              Milwaukee made one final rally and got within 114-112 on Green's 30-footer with 4.2 seconds remaining, but Mobley made a pair of free throws with 3.5 seconds left to make it a two-possession game.\n\n\r\n              Cleveland was up 81-63 midway through the third before Milwaukee closed the quarter on 21-5 run to make it close going into the final 12 minutes.\n\n\r\n              Up Next\r\n              Bucks: Host the New York Knicks on Tuesday night.\n\n\r\n              Cavaliers: At Detroit Pistons on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042504.499725
}