{
  "game_id": "0022300567",
  "espn_id": "401585195",
  "date": "Jan 16, 2024",
  "matchup": "PHX vs. SAC",
  "headline": "Suns end with 23-4 run, beat Kings 119-117 on Durant's free throws. Allen ties team mark with 9 3s",
  "body": "PHOENIX -- — Kevin Durant made two free throws with 1.8 seconds remaining and the Phoenix Suns staged a furious comeback to beat the Sacramento Kings 119-117 on Tuesday night.\n\n\r\n              Grayson Allen tied a franchise record with nine 3-pointers and scored 29 points for the Suns, who trailed 113-96 before closing the game with a 23-4 run. Durant finished with 27 points, then tried to explain how the Suns rallied.\n\n\r\n              “I have no clue,” Durant said. \"I usually know how the game is flowing, but I felt like this was a blur. Everything happened so fast. I guess we were all in a zone and locked in.\n\n\r\n              “They are a team that likes to play a free-flowing movement offense, so when you can disrupt that they turn into a different team. We pressured (Domantas) Sabonis a little bit more. We switched so many screens and made them play 1-on-1.”\n\n\r\n              Devin Booker had 16 points and 11 assists, Bradley Beal scored 13 points and Jusuf Nurkic had 10 points and 15 rebounds for Phoenix.\n\n\r\n              The Kings led by 22 points with 8:22 to play, but Durant sparked a comeback with a pair of 3-pointers in the fourth quarter. Eric Gordon later made consecutive 3-pointers to tie it at 115. He scored 13 points off the bench.\n\n\r\n              “We stayed in it. We stayed in the fight mentally,” Suns coach Frank Vogel said. “There were a lot of moments where our guys were struggling and frustrated, and we were getting our butts kicked.\n\n\r\n              “We have seen firsthand that in the modern NBA teams are never out of a game. We looked at the small lineup. We were going five 3-point shooters. We finally got Eric in there and he hit some big 3s. All of those guys really stepped up.”\n\n\r\n              Durant's free throws with 30 seconds left gave the Suns a 117-115 lead, their first since it was 3-2. De'Aaron Fox, who led all scorers with 33 points, tied it with a jumper with 19 seconds to go. But he then fouled Durant, who was attempting a long jumper. After his free throws, a last-second shot by the Kings was long.\n\n\r\n              Sabonis recorded his 11th triple-double of the season with 21 points, 12 rebounds and 11 assists. It was his 23rd consecutive game with double figures in at least two of the columns and his league-high 36th double-double of the season.\n\n\r\n              “It’s a tough way to lose. Give them credit,” Kings coach Mike Brown said. “We played a good 42 minutes. The last six minutes, we took some tough shots at the rim. We couldn’t score at the rim instead of just continuing to move the ball and move bodies, everything was really stagnant, we turned the ball over.\n\n\r\n              “We had no pace in the halfcourt, we were holding the ball a lot. We have to figure it out. Hopefully it’s something we can learn from.”\n\n\r\n              Keegan Murray scored 18 points, Sasha Vezenkov had 14 and Malik Monk finished with 13 points and eight assists for Sacramento, which has lost three in a row.\n\n\r\n              NEXT\n\n\r\n              Kings: Host Indiana Thursday.\n\n\r\n              Suns: At New Orleans Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996659.999468
}