{
  "game_id": "0021901280",
  "espn_id": "401224755",
  "date": "Aug 08, 2020",
  "matchup": "POR vs. LAC",
  "headline": "McGruder's late 3 helps Clippers edge Trail Blazers 122-120",
  "body": "LAKE BUENA VISTA, Fla. --  Clippers coach Doc Rivers rested Kawhi Leonard and sat Paul George for the final five minutes following Los Angeles' plan to restrict playing time.\n\nThey still pulled out a very big win over the Portland Trail Blazers when All-Star Damian Lillard missed a couple free throws late.\n\n\"We still feel we should we win regardless of who's in the game,\" George said. \"We still have a high expectation. I think we showed it, what we're capable of, not having all our guys on the floor at one time.\"\n\nRodney McGruder hit a 3-pointer with 26.5 seconds left, and the Clippers beat the Trail Blazers 122-117 on Saturday.\n\nPortland had a chance to ensure a play-in for the Western Conference's final playoff berth and eliminate Sacramento with a win. The Trail Blazers led much of the game, but the NBA's top-scoring team inside the bubble was outscored 12-2 in the final 96 seconds.\n\n\"We had our chances,\" Portland coach Terry Stotts said. \"Give the Clippers credit. They had a bunch of young guys running around. ... We didn't make the plays. I mean point blank last two minutes we didn't make the plays at either end to win a game.\"\n\nGeorge finished with 21 points. Landry Shamet scored 19, Reggie Jackson added 17 and Marcus Morris Sr. had 15. JaMychal Green scored 13 points, and Lou Williams finished with 12.\n\nCJ McCollum led Portland with 29 points, hitting 6 of 13 3s. Gary Trent Jr. also made six 3s and finished with 22 points. Damian Lillard had 22, Carmelo Anthony added 21 and Jusuf Nurkic had 10 points and 13 rebounds.\n\nPortland led 115-110 on a free throw by Nurkic with 2:58 left. The Clippers scored five straight, tying it at 115 with 1 minute left on a three-point play by Patrick Patterson. Lillard put Portland up with a driving layup, then McGruder scored from the top of the key with 26.5 seconds left to put the Clippers ahead to stay at 118-117.\n\nGreen and Shamet each hit a pair of free throws to protect the Clippers' lead.\n\nLillard missed a pair of free throws with 18.6 seconds to go. He also missed a 3 with 9.5 seconds left.\n\nStotts was surprised when Lillard missed the free throws.\n\n\"Obviously, you get Dame going to the line at the end of the game you feel pretty good,\" Stotts said. \"So my emotion, I was surprised he missed one much less two.\"\n\nRivers noted he has seen Larry Bird miss two free throws.\n\n\"I was shocked because he doesn't,\" Rivers said of Lillard. \"He's a very clutch player. We just caught the one day that the does. Tiger Woods misses 5-foot putts. It happens. It's a human game. And you'll take it any way you can get it.\"\n\nLillard said he expects himself to make those free throws.\n\n\"And I didn't when my team needed it, which is a failure for me that I can accept,\" Lillard said.\n\nPortland led by as much as 10 in the first quarter and was up 37-34 at the end of the quarter. The Clippers took their first lead in the second quarter on a 3 by Landry Shamet at 44-42, but they never led by more than that as Portland was up 75-69 at halftime. Portland also led 96-95 at the end of the third.\n\nTIP-INS\n\nClippers: Outrebounded Portland 45-41. ... They also outshot the Trail Blazers outside the arc, hitting 15 of 34 (44.1%) compared to 17 of 43 (39.5%).\n\nTrail Blazers: Outscored Los Angeles 46-38 in the paint. ... C Hassan Whiteside did not play with a left hip strain. ... Nurkic just missed a triple-double with nine assists.\n\nQUOTABLE\n\n\"Asking me about Patrick Beverley, who I sent him home before at the end of a game, Paul George just got sent home by me last year in the playoffs, so they know that the reason they're reacting like that is because of what they expect from me, which is a sign of respect. And it just shows what I've done at a high clip more times than not. So I'm not offended by it. If anything it should just tell you how much it hurt them to go through I what I put them through in those situations previously,\" Lillard said of how Beverley and George reacted to his missed free throws.\n\nHEY YOU\n\nThe Trail Blazers had some regional support with Blitz the Seahawk, mascot for the NFL's Seattle Seahawks, sitting in the virtual seats, for the early afternoon game.\n\nUP NEXT\n\nClippers: Play Nets on Sunday.\n\nTrail Blazers: Play Philadelphia on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996602.9769752
}