{
  "game_id": "0022001010",
  "espn_id": "401307817",
  "date": "May 07, 2021",
  "matchup": "LAL @ POR",
  "headline": "Blazers get key tiebreaker with 106-101 win over Lakers",
  "body": "PORTLAND, Ore. -- — Damian Lillard had 38 points to lead Portland to a 106-101 victory over the Los Angeles Lakers on Friday night that gave the Trail Blazers the tiebreaker over their Western Conference foe as the regular season winds to a close.\n\n\r\n                    Lillard had five 3-pointers for the Blazers, who were back at home after going 5-1 on a six-game trip. They were welcomed back to Portland with fans allowed at the Moda Center for the first time this season. \n\n\r\n                    Anthony Davis had 36 points and 12 rebounds for the Lakers, who were without LeBron James for the third straight game. Los Angeles has lost eight of its last 10 games.\n\n\r\n                    \"It’s tough man,\" Davis said. “It’s a tough loss for us. We wanted to get that one.”\n\n\r\n                    The Lakers and the Blazers were both 37-29 heading into the game but the Lakers held sixth in the Western Conference because the series between the two teams was tied 1-1 and Los Angeles had the tiebreaker with a better record against conference teams.\n\n\r\n                    With the win, Portland moved into sixth, a game up on Los Angeles, and also secured the tiebreaker. Both teams are trying to earn a playoff spot outright — and avoid play-in games — with just five games left in the regular season. \n\n\r\n                    The Blazers knew what was at stake. \n\n\r\n                    “I think we've played in enough important games, we know how to prepare going into those games, how to give ourselves a chance to be successful,” Lillard said. \n\n\r\n                    Markieff Morris' tip shot got the Lakers to 89-85 with 7:21 left in the game but Lillard answered with a 3-pointer for Portland.\n\n\r\n                    Davis' 3 and Alex Caruso's layup narrowed it to 94-90 for the Lakers, and again Lillard hit a 3 in response. \n\n\r\n                    Portland went up 100-90 after CJ McCollum's 3-pointer. Davis made a series of free throws before a tip-in that closed the Lakers within five. He added another pair of free throws to make it 100-97 with 1:10 left but the Lakers couldn't catch up. \n\n\r\n                    'I thought there was some urgency to the game by both teams. Obviously, what was at stake — both teams knew it. And I think both teams played at that level,\" Blazers coach Terry Stotts said. “I think for us, having fans in the building brought even more urgency for us.”\n\n\r\n                    Los Angeles was coming off a 118-94 loss to the rival Clippers on Thursday. Davis did not play after the first quarter because of back spasms but he started against the Blazers. \n\n\r\n                    But the Lakers remained without four-time league MVP James, who has missed two games while he recovers from a high ankle sprain. \n\n\r\n                    Lakers coach Frank Vogel said all his team can do is try to win the games that are left. \n\n\r\n                    “Wherever we land we're confident,” Vogel said. “Obviously we still want to finish in the top six. We still have five games to make up some ground if that’s possible.” \n\n\r\n                    Boosted by cheering fans, the Blazers went up 34-20 after the opening quarter. Kentavious Caldwell-Pope hit a 3-pointer late in the first half to get the Lakers to 55-53 but Portland led 59-55 at the break. \n\n\r\n                    Lillard had 19 points in the opening quarter alone and the Blazers were 9 for 9 from the free-throw line. \n\n\r\n                    Caldwell-Pope's jumper tied it at 64 early in the second half before Davis' 3-pointer put the Lakers in front. Anfernee Simon's jumper put Portland back ahead 74-73 and the Blazers led 82-78 heading into the final quarter. \n\n\r\n                    Jusuf Nurkic finished with 10 points and 13 rebounds for Portland, while McCollum added 21 points. \n\n\r\n                    Caruso had a season-high 18 points for the Lakers. \n\n\r\n                    FANS RETURN\n\n\r\n                    The Blazers welcomed fans to the Moda Center for the first time this season, at 10 percent capacity or about 1,900 people. Portland was one of the final teams in the league to allow spectators. Permission was granted after Multnomah County fell out of the “extreme risk” designation. \n\n\r\n                    The fans gave the Blazers a standing ovation when the team took the court for warm-ups before the game, and even started a “Beat L.A.” chant when the Lakers appeared. \n\n\r\n                    “We rode the energy of the fans. I think they definitely deserved this one,” Nurkic said. \n\n\r\n                    TIP INS\n\n\r\n                    Lakers: Los Angeles was also without Dennis Schroder because of health and safety protocols. ... It was the third and final regular-season game between the two teams. ... Andre Drummond fouled out with 6:07 left in the game. \n\n\r\n                    Blazers: Norman Powell returned after missing a game because of a sore right knee. ... Portland's 21-13 road record is the second-best in the league. ... Nurkic has had double-doubles in seven of his last nine games. \n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Host Phoenix on Sunday. \n\n\r\n                    Trail Blazers: Host San Antonio on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764997274.234824
}