{
  "game_id": "0022201009",
  "espn_id": "401469164",
  "date": "Mar 11, 2023",
  "matchup": "CHI @ HOU",
  "headline": "LaVine scores 36 points, Bulls beat Rockets 119-111",
  "body": "HOUSTON -- — Zach LaVine scored 36 points and DeMar DeRozan added 27 as the Chicago Bulls used a huge run in the fourth quarter for a 119-111 win over the Houston Rockets on Saturday night.\n\n\r\n              The Bulls trailed by four points midway through the fourth before going on a 13-0 run for a 115-106 lead with two minutes remaining. \n\n\r\n              DeRozan, who had seven rebounds and five assists, scored the first four points in the run and LaVine scored the next four. LaVine’s second basket in that span came on an alley-oop from DeRozan, and former Rocket Patrick Beverley capped the run with a 3-pointer. \n\n\r\n              “The biggest thing is I felt like there was some resolve there,” coach Billy Donovan said. “We got stops when we needed to get stops ... we just didn’t discouraged. We didn’t back away. We didn’t get emotionally dejected.” \n\n\r\n              It’s the second straight victory for the Bulls, who got 18 points and 11 rebounds from Nikola Vucevic and 16 points and 10 rebounds from Beverley. LaVine had nine rebounds and five assists. \n\n\r\n              Rookie Jabari Smith Jr. had 20 points and 10 rebounds for the Western Conference-worst Rockets, who dropped their third in a row. \n\n\r\n              “It was tough out there,” LaVine said. “It was a track meet. Guys out there were tired. They're better than what their record says. And they've got a lot of guys over there that can make shots. So you've got to really play them and they're going to make you beat them.”\n\n\r\n              Houston's Kevin Porter Jr. was disappointed that the Rockets let the game get away from them late.\n\n\r\n              “We've just got to focus,” he said. “We lost our focus on the defensive end and offensive end and it came to bite us. We definitely had that game and a lack of focus kind of (got) us at the end.”\n\n\r\n              Houston led by nine points early in the fourth quarter before Chicago scored the next nine points to tie it at 98 with 8 ½ minutes to go. Andre Drummond scored the first six points in that stretch and DeRozan capped it with a three-point play. \n\n\r\n              The Rockets got their first points in almost three minutes on a basket by Jalen Green after that. He was fouled on the play and missed the free throw, but Smith grabbed the rebound and finished with a dunk to make it 102-98. \n\n\r\n              The Rockets led by a point at halftime and the teams stayed close through most of the third quarter. A 3-pointer by Vucevic got Chicago within one with about three minutes left in the quarter, but Houston scored the next six points to make it 87-80 a minute later.\n\n\r\n              LaVine made two free throws after that before the Rockets used an 8-2 run, with 3s from Tari Eason and Kevin Porter Jr., to extend the lead to 95-84. \n\n\r\n              LaVine had a three-point play near the end of the third to get the Bulls within 95-87 entering the fourth.\n\n\r\n              Houston led by as many as 13 points early, but the Bulls cut the lead to 55-54 by halftime. \n\n\r\n              TIP-INS\n\n\r\n              Bulls: Drummond had 11 points and five rebounds. ... Chicago made 15 3-pointers. ... Alex Caruso, who played in college at nearby Texas A&M, had five points and and three steals. \n\n\r\n              Rockets: Houston made 16 of 34 3-pointers. ... Green had 18 points and seven assists. ... Eason had 12 points off the bench. ... Alperen Sengun had 10 points, five rebounds and five assists. ... Kenyon Martin Jr. scored 16 points. \n\n\r\n              BOOST FROM BEVERLEY\n\n\r\n              LaVine believes that Beverley has given the Bulls a boost in the seven games since he signed with his hometown team after agreeing to a buyout with the Orlando Magic after a trade from the Lakers. \n\n\r\n              “He gets us going and you can see how much he cares,” LaVine said. “He cares about winning. He cares about his teammates. So we definitely needed somebody like that. You can see the impact he makes on the game every night.”\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host Boston on Monday night. \n\n\r\n              Bulls: Host Sacramento on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994469.958327
}