{
  "game_id": "0021500991",
  "espn_id": "400828878",
  "date": "Mar 14, 2016",
  "matchup": "CHI @ TOR",
  "headline": "Bulls win ninth straight against Raptors, 109-107",
  "body": "TORONTO --  Before the game, Toronto coach Dwane Casey bemoaned the fact the each time his Raptors play the Chicago Bulls, someone has had an \"out-of-body experience.\"\n\nFor the second straight game, that player was reserve Doug McDermott.\n\nMcDermott followed up his career-high 30 points last month with 29 more Monday night to lead the Bulls to their ninth straight victory over the Raptors, 109-107.\n\nMcDermott, who hasn't scored more than 20 points in any other game this season, shot 7 of 7 from the field in the first half as he racked up 24 points, helping hand the Raptors just their second loss in their last 16 at home.\n\n\"There's just something about it,\" McDermott said. \"I played really well against them in Summer League in (Las) Vegas. There's something about it. It's not like I have anything against them, grudges or anything, I just match up really well against them.\"\n\nE'Twaun Moore and Nikola Mirotic added 17 points apiece for a short-handed Chicago team, missing both Derrick Rose, Pau Gasol and Mike Dunleavy, among others.\n\nToronto's last win against Chicago was on Dec. 31, 2013.\n\nJimmy Butler scored 13 points on 5-of-18 shooting after missing three games because of knee soreness. He made a free throw in the closing seconds, then made the crucial defensive play on DeMar DeRozan with the Raptors All-Star guard looking to send the game to overtime with a layup with a second remaining.\n\n\"I've guarded him plenty,\" Butler said. \"I know you bring that ball down you've got to bring it back up to get to the basket. Luckily I had a quick enough hand to get a piece of it, hit off his knee and we took it the other way.\"\n\nFor a Bulls squad fighting for its playoff lives, currently eighth in the Eastern Conference, every win is an important one. But by sweeping the season series against the Raptors for the second straight year, it may have given them a mental edge should the teams meet in the playoffs.\n\n\"It definitely is,\" McDermott said. \"We'll keep this in our memories and whenever we're battling, to win four games against a team that's only lost 21 games, it's just really good for our confidence, our motivation going forward.\"\n\nKyle Lowry had 33 points and 11 rebounds for the Raptors, and like Casey was frustrated by his team's lack of urgency from the start.\n\n\"(We need to) take the lesson of not being aggressive and that starts with me,\" the All-Star guard said. \"Starting the game off relaxed, not being aggressive and not being defensive-minded, so I take a little bit of that on me.\"\n\nBOXING OUT\n\nRetired boxers Lennox Lewis, the last undisputed world heavyweight champion, and George Chuvalo, a former Canadian heavyweight champion who twice went the distance in losses to Muhammad Ali, sat courtside for the game and received personalized Raptors jerseys from the Toronto mascot.\n\nCASEY'S GRIPE\n\nMonday's game marked the end of Toronto's second seven-game homestand of the season. While the team has won 12 of those 14 games at the Air Canada Centre, Casey would prefer not to have to embark on extended stretches of home games, and says his players can get complacent. \"I'd much rather have a balance, two or three games at home and then on the road, a normal NBA schedule,\" he said. \"It is what it is, our guys have played well at home this year, but really it hurts our practice as much as anything: game, day off, game, day off.\"\n\nHURTING HAND\n\nJonas Valanciunas left the game with 2:25 remaining in the first quarter, clutching his left hand. While X-rays came back negative, he didn't return to the game. The left hand was the one he fractured earlier in the season, costing him 17 games. However, Casey said, \"there's nothing wrong with it, he's fine.\"\n\nTIP-INS\n\nBulls: The Bulls' nine-game winning run against Toronto is the team's longest since a 15-game run from Dec. 18, 2002, to Dec. 29, 2006.\n\nRaptors: Lowry scored at least 20 points against Chicago in all four games this season. ... Monday's game marked Chicago's first visit to Toronto since Butler eclipsed Michael Jordan in the Bulls' record book with 40 second-half points, in what was Raptors forward DeMarre Carroll's last game before undergoing right knee surgery. \"I think that helped DeMarre make up his mind to go and have surgery,\" Casey said.\n\nUP NEXT\n\nBulls: Visit Washington on Wednesday.\n\nRaptors: Visit Milwaukee on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764993912.0157208
}