{
  "game_id": "0022200332",
  "espn_id": "401468487",
  "date": "Dec 02, 2022",
  "matchup": "MEM vs. PHI",
  "headline": "Morant, Jackson lead Grizzlies past 76ers, 117-109",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 28 points and eight rebounds, Jaren Jackson Jr. added 22 points and four blocks — one in the closing minute — and the Memphis Grizzlies beat the Philadelphia 76ers 117-109 on Friday night.\n\n\r\n              Dillon Brooks finished with 17 points to help Memphis win for third time in four games.\n\n\r\n              Joel Embiid had 35 points, 11 rebounds and eight assists for Philadelphia. Tobias Harris added 21 points and 11 rebounds, and Shake Milton had 17 points and six assists.\n\n\r\n              Despite Embiid’s scoring, the Grizzlies praised the work of center Steven Adams, who finished with nine points, but 16 rebounds and six assists, but was in charge of guarding Embiid throughout the night.\n\n\r\n              “I know Embiid scored 35, but I think (Adams) won the game on the margins with a lot of the little things he did,” Memphis coach Taylor Jenkins said.\n\n\r\n              Added Morant: “That’s what makes Steve-O so great for us. Him taking on that challenge to guard the best bigs.”\n\n\r\n              The Grizzlies led by 18 early in the fourth, but the 76ers had another push left. They cut the Memphis lead to single digits with about five minutes left and were within 111-106 with three minutes to go.\n\n\r\n              But Memphis was able to hold on, with Jackson blocking a shot at the rim as Embiid went for a dunk with about 25 seconds left.\n\n\r\n              “That block at the end, it was perfect execution,” Jenkins said. “Big-time block, big-time play to seal the win.”\n\n\r\n              Both teams were coming off poor performances in Wednesday night losses. Philadelphia lost to Cleveland by 28 points, while Memphis lost to Minnesota, committing a season-worst 27 turnovers and going 18 of 30 from the free throw line.\n\n\r\n              “We had too many spurts where we weren’t the physical team,” said Harris, who made five of his six 3-pointers. “Didn’t get the 50-50 balls and they killed us on the boards to create extra possessions.”\n\n\r\n              TIP-INS: \n\n\r\n              76ers: Harris, who was questionable before the game with a non-COVID illness, started for Philly. …Harris had a season-high five 3-pointers. ... Have lost nine straight road games in the series. Philadelphia’s last win in Memphis was Dec. 26, 2012. \n\n\r\n              Grizzlies: With a 3-point play in the second quarter, Brooks passed Shane Battier for 11th on the franchise scoring list. … Adams had his second block in the game in the third quarter, giving him 650 in his career. \n\n\r\n              RIVERS RETORT\n\n\r\n              Philadelphia coach Doc Rivers can occasionally have some good-natured banter with fans, and there was a bit of an exchange during the game. One fan hollered: “Sit down, Doc” to which the 61-year-old 76ers coach replied: “I can’t. I’m too old.”\n\n\r\n              UP NEXT: \n\n\r\n              76ers: At Houston on Monday night.\n\n\r\n              Grizzlies: At Detroit on Sunday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994223.5865622
}