{
  "game_id": "0021900595",
  "espn_id": "401161237",
  "date": "Jan 13, 2020",
  "matchup": "CHA @ POR",
  "headline": "Lillard has 30 and Portland beats Charlotte 115-112",
  "body": "PORTLAND, Ore. --  Damian Lillard just knew.\n\nHis shot to end the third quarter against Charlotte was listed at 47 feet in the official statistics.\n\n“I was like, man, that's going to have a chance,” Lillard said. \"It was a good shot.\"\n\nThe rest of the game wasn't nearly as certain for the Portland Trail Blazers, who escaped with a 115-112 victory on Monday night.\n\nLillard finished with 30 points while Anthony Tolliver had a season-high 16, all in the fourth quarter. CJ McCollum added 27 as the Blazers snapped a two-game overall losing streak and a four-game skid at the Moda Center.\n\nThe Blazers, who led by as many as 17 points in the first half before Charlotte closed the gap and took a third-quarter lead, have won their last six games against the Hornets.\n\nTolliver's 3-pointer put Portland up 102-94 but Dwayne Bacon answered with a 3 for the Hornets to keep it close.\n\nCody Zeller's layup pulled Charlotte within 109-107 with just over 3 minutes to go and P.J. Washington made a pair of free throws to tie it. Tolliver's 3-pointer gave the Blazers a 112-109 with 2:11 left before Carmelo Anthony had a key steal and Lillard made a layup.\n\nBut Devonte' Graham's 3-pointer got the Hornets within two points. Lillard made the first of a pair of free throws for a slight cushion, and Graham's 3-pointer in a scramble at the buzzer was blocked by Kent Bazemore. Terry Rozier slipped trying to get open.\n\nBoth teams have been struggling to start the new year. Portland currently sits at 11th in the Western Conference while the Hornets are in ninth in the East.\n\nRozier had 27 points for the Hornets, who were coming off a 100-92 loss at Phoenix the night before. Monday's game was the third of a four-game road trip.\n\n“It's stressful. It hurts and it should hurt,” Hornets coach James Borrego said. “But this is only going to make us stronger, more resilient. Our guys are showing growth in these moments.”\n\nTolliver said his fourth quarter was all about persistence.\n\n“That's who I am, that's what's allowed me to play in the league as long as I have,” he said. “Just being able to stay with it, no matter what the circumstances are. Trusting my work, trusting my faith and just being able to go out there and play with a lot of confidence whether I'm 0 for 5 or 5 for 5.”\n\nHassan Whiteside was back in Portland's starting lineup after missing Saturday's loss to Milwaukee because of a respiratory illness. But Mario Hezonja missed the game because of a sore back.\n\nBorrego started Zeller at center for Bismack Biyombo, who did not play.\n\nThe teams appeared to be fairly evenly matched through the first quarter, but Portland began to pull away midway through the second, when McCollum's driving layup made it 43-37.\n\nGary Trent Jr. capped an 11-0 Portland run with a 3-pointer that put the Blazers ahead 52-37.\n\nThe Blazers took a 62-46 lead into the break, led by McCollum with 20 points in 16 minutes.\n\nThe Hornets hit four straight 3-pointers to open the second half, closing the gap to 62-58. McCollum's 3 ended the run.\n\nGraham's 3-pointer got the Hornets within 67-66, but they couldn’t pull ahead until Willy Hernangomez's layup made it 80-78. Charlotte made nine 3-pointers in the third quarter alone.\n\nLillard's heave from more than 40 feet out gave the Blazers a 91-89 lead to start the final quarter.\n\n“That's a good way to finish off the quarter -- it was a rough quarter,” Lillard said. “We allowed them to shoot a bunch of 3s and that's not how we want to lose the lead, but it happened and we just had to find a way. And we did that.”\n\nTIP INS:\n\nHornets: It was the first of two meetings between the teams. The Blazers visit Charlotte on March 24. ... The Hornets have not beaten the Blazers since January 2017. The team has not won in Portland since March 2008 -- a streak of 12 games.\n\nTrail Blazers: The game ended Portland's short two-game homestand, with the next three on the road. ... Guy Fieri was at Monday's game. ... Lillard had 14 points in the third quarter alone. ... Tolliver also had 11 rebounds.\n\nBIG QUARTER\n\nThe Hornets had 43 points in the third quarter, the most the Blazers had allowed in a quarter all season.\n\n“I would imagine giving up nine 3-pointers is the most 3s we've given up in a quarter as well,” Blazers coach Terry Stotts said. “To be able to withstand that, I'm just glad we had a cushion.”\n\nUP NEXT:\n\nThe Hornets conclude the road trip on Wednesday against the Denver Nuggets.\n\nThe Trail Blazers visit the Houston Rockets on Wednesday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996069.7932968
}