{
  "game_id": "0021800884",
  "espn_id": "401071557",
  "date": "Feb 23, 2019",
  "matchup": "CHA vs. BKN",
  "headline": "Russell's 40 points lift Nets to 117-115 win over Hornets",
  "body": "CHARLOTTE, N.C. --  Six days after his first All-Star appearance, D'Angelo Russell believes his confidence is at an all-time high.\n\n\"For sure, because I feel like when you have that All-Star badge, you have to be aggressive,\" Russell said. \"Teams expect it already, they game plan for you and they are trying to stop you -- and I feel like I can't be stopped.\"\n\nRussell celebrated his 23rd birthday by tying a career high with 40 points, making some huge shots down the stretch to lead the Brooklyn Nets to an important 117-115 win over the Charlotte Hornets on Saturday night.\n\nThe victory kept the Nets alone in sixth place in the Eastern Conference and gives them 2-1 edge in the series entering Friday night's game at Brooklyn.\n\nRussell called it a \"must-win game.\"\n\nThe big effort came on the same floor where Russell played in the All-Star Game last Sunday night.\n\nRussell made 14 of 31 shots from the field with six 3-pointers to go along with seven assists. The Nets repeatedly turned to him to make plays, setting screens to free him up on drives and long jumpers. On several occasions, the Hornets were caught in a switch on the pick-and-roll and Russell buried jumpers over Charlotte's big men.\n\n\"We just jumped on his back,\" said Nets guard Joe Harris. \"He carried us offensively and made some huge plays.\"\n\nThe Hornets -- and their fans -- left the arena upset at the way the game ended.\n\nAfter Russell knocked down a fade-away jumper from 15 feet, and then buried a long 3-pointer from the top of the key with 39 seconds left to give the Nets the lead, the Hornets had a chance to win the game on the final possession.\n\nHowever, Caris LeVert blocked Kemba Walker's 3-point shot as time expired on a bang-bang play. Hornets players threw their arms up in the air looking for a call, thinking LeVert had fouled Walker as the ball bounced harmlessly to the sideline. Walker, a three-time All-Star, sat on the floor in utter disbelief at the no-call with his hands raised to the sky.\n\nThe crowd booed as the officials gathered their coats and walked off the floor.\n\n\"You guys watch the film, you tell me what that was,\" Hornets coach James Borrego said in a brief news conference after the game. \"I know what I saw. I saw it live and I just saw it on film. I know what I saw, but I'll see it in a 2-minute report.\"\n\nWalker refused to comment on the play, saying he didn't want to get fined by the league.\n\n\"It's over and there is nothing I can do about it at this point, so it's whatever,\" Walker said.\n\nLeVert thought he blocked the ball with his elbow, but wasn't completely sure.\n\n\"With plays like that the refs are looking at every little thing, if your hands are in the air,\" LeVert said. \"So the best thing to do is show your hands. If they call it, they call it. Like I said, I feel like it was clean.\"\n\nWalker finished with 32 points, including 28 in the second half to rally the Hornets.\n\nTIP-INS\n\nNets: Different weekend, same result for Joe Harris. Harris was 3 of 4 on 3-pointers on the same floor he won the NBA All-Star 3-point contest last weekend.\n\nHornets: Cody Zeller fouled out with 3:24 left in the game with 13 points and 11 rebounds, a big reason the Hornets lost the late lead. ... Miles Bridges made his second straight start, but had to make an early exit after picking up two quick fouls. He had just four points.\n\nTALKING CHEMISTRY\n\nNets coach Kenny Atkinson said he loves his team's chemistry, calling it a special group.\n\n\"They enjoy being around each other,\" Atkinson said. \"That's worth something. That sounds corny but I think it pushes you through in a tough game like this. And there's a confidence level. I think we're led by D'Angelo, whose confidence is off the charts. I think we're a much more confident team than we've been the past two seasons.\"\n\nPARKER STILL HAS IT\n\nThe loss overshadowed a terrific game from Hornets 36-year-old point guard Tony Parker, who had 21 points, five assists and five rebounds and provided a huge spark off the bench. Parker was instrumental in a 34-9 Hornets run that stretched from the third quarter into the fourth as the Hornets battled back from 19 down to take the lead.\n\nUP NEXT\n\nNets: Host Spurs on Monday.\n\nHornets: Host Warriors on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994363.3790689
}