{
  "game_id": "0021600649",
  "espn_id": "400900070",
  "date": "Jan 20, 2017",
  "matchup": "LAL vs. IND",
  "headline": "Williams, Young lead Lakers to 108-96 win over Pacers",
  "body": "LOS ANGELES --  Although Luke Walton resisted the urge to shout about it, the coach was clearly proud of what the Los Angeles Lakers can do when their crowded schedule allows them to have a couple of real practices.\n\nLou Williams scored 27 points, Nick Young hit five 3-pointers and the Lakers snapped their five-game losing streak with a 108-96 victory over the Indiana Pacers on Friday night.\n\nJulius Randle scored 16 points while Young and rookie Brandon Ingram added 15 apiece as the Lakers made a prolonged second-half surge to win for just the sixth time in 27 games.\n\nThe Lakers have played an NBA-high 47 games, and practice days have been painfully rare for Walton and a youthful team that desperately needs more work in the gym. With the two previous days off, the coach put his team through two thorough workouts, and the results showed in one of the Lakers' best efforts since November.\n\n\"We've played this well before,\" Walton said. \"How long can we maintain it? How long before this is just how we play basketball? That comes with guys just getting time together.\"\n\nEven after D'Angelo Russell left with a leg injury on their second possession, the Lakers showed off excellent ball movement and balanced scoring. Williams hit four 3-pointers in another prolific outside shooting performance, and Young put on his usual theatrics while peppering the Pacers with big buckets.\n\n\"We just picked it up in practice,\" Young said of the Lakers' improved effort. \"We just picked our energy up, stayed with it, and that's about it.\"\n\nYoung also went to the locker room after hyperextending his left knee late in the first half, but he returned for the second half. The Lakers played without veteran forward Luol Deng, who has a sprained right wrist.\n\nPaul George scored 21 points and Al Jefferson added 20 for the Pacers, who had a dismal second half in just their second loss in nine games. Indiana committed 12 turnovers and hit just 14 shots after halftime, getting outscored 35-22 in the third quarter.\n\n\"I just saw (the Lakers) scrap harder,\" Indiana coach Nate McMillan said. \"They wanted the ball more. They went after the ball. ... I thought we were sloppy, certainly sloppy on the offensive end of the floor. Twenty-one turnovers? It's ridiculous at this time of the season. We just have to mature.\"\n\nTIP-INS\n\nPacers: C.J. Miles failed to convert a four-point play in the third quarter. ... One game after Jefferson hit his season high with 20 points at Sacramento, the center matched that total in the first half at Staples Center. He didn't score in the second half, missing all four of his shots.\n\nLakers: Larry Nance Jr. has been cleared to resume practice and to play limited minutes in their next game. The second-year forward has missed 16 games since Dec. 20 with a bone bruise in his left knee. ... Jose Calderon played 19 minutes in Russell's absence, putting up seven points and six assists.\n\nD-LO DOWN\n\nRussell mildly sprained a ligament in his right knee and strained his right calf on the Lakers' second possession. Russell was injured when he lost his footing while going around a screen set by Randle. Russell's left leg alarmingly stretched backward, and he stayed down while holding his right knee before eventually walking to the locker room. Russell entered the game averaging 14.8 points, 4.5 assists and 3.8 rebounds per game in his second NBA season. He will be re-evaluated Saturday before their road trip. \"Awkward position that I fell in caused a little pain, but I'm all right,\" Russell said.\n\nGOING AWAY\n\nThe Pacers dropped to 6-15 outside of Indianapolis, and they aren't sure why. \"We've yet to find our identity on the road, but for some reason, we know how to play at home,\" George said. \"I don't know what it is, but we are totally different when we play on the road.\"\n\nCOUGHING IT UP\n\nJeff Teague led the Pacers with six turnovers, while Myles Turner had five and George four. \"Some of the turnovers we made were head-scratching,\" McMillan said. \"Careless with the ball. Absolutely no value with that basketball. You have to value the ball. We were just loose with the ball all night long.\"\n\nUP NEXT\n\nPacers: At Jazz on Saturday.\n\nLakers: At Mavericks on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995396.1412811
}