{
  "game_id": "0021500837",
  "espn_id": "400828724",
  "date": "Feb 22, 2016",
  "matchup": "MIL vs. LAL",
  "headline": "Bucks beat Lakers 108-101 in Kobe's final game in Milwaukee",
  "body": "MILWAUKEE -- Bucks forward Giannis Antetokounmpo put on a show against the Los Angeles Lakers on Monday night, reeling off the kinds of plays that Kobe Bryant used to make effortlessly in his prime.\nThen Bryant visited Antetokounmpo in the Milwaukee locker room after the Bucks' 108-101 victory, the retiring star imparting wisdom to one of the league's up-and-coming players.\nAntetokounmpo earned his first career triple-double with 27 points, 12 rebounds and 10 assists, making an impression on the Lakers' Bryant in his final visit to the Bradley Center.\nThe 6-foot-11 Antetokounmpo \"has the physical tools, the intelligence. Now it is just a matter of him believing in himself and going after it,\" Bryant said. \"He has the talent to be a great player.\"\n\nBryant had 15 points in 24 minutes, shooting 3 of 12 from the field and 8 of 9 from the foul line. He was feted with a pregame video tribute by Bucks coach Jason Kidd, who faced the 37-year-old Bryant numerous times during his playing days.\nKidd's young team set the pace after outscoring the Lakers 36-17 in the third quarter. The 21-year-old Antetokounmpo led the way, streaking into the lane unabated several times for easy buckets or impressive passes.\nOnce again, the Bucks outplayed an opponent in the paint.\n\"If we could have just taken away that part of the game, then we would have (given) ourselves an opportunity,\" Lakers coach Byron Scott said.\nAll five Bucks starters scored in double figures. Khris Middleton had 18 points and six assists.\nNick Young had 19 points for the Lakers, who lost their sixth straight game.\nA night after losing in Chicago, the Lakers looked tired in the third quarter compared to the Bucks before rallying in the fourth to make it respectable.\nBut they couldn't keep up with Antetokounmpo, who had two running dunks in the final minute of the third quarter. The second came off a pass off the backboard from Middleton to give Milwaukee a 24-point lead.\n\"Giannis, we all trust Giannis. (He) is a playmaker, as much as a scorer, as much as rebounder. He has vision,\" Kidd said.\nKOBE TIME:\nRegardless of the result, much of the focus was on Bryant with the Lakers in town for their only visit of the season.\nThe crowd cheered when Bryant faked Jabari Parker on the wing and stepped around him to hit a high-arching 3.\nFans pulled out their camera phones late in the second quarter when Bryant flexed his right hand after colliding with Milwaukee's Michael Carter-Williams and Miles Plumlee while getting fouled going for a loose ball. Bryant has been playing with a splint to protect his dislocated middle finger.\n\"But it felt good to take a good hit and to know that the finger kind of (stood) up to that. So, it felt OK,\" Bryant said.\nHis night was done with 3 minutes left in the third quarter and the Lakers on their way to their 16th loss in 18 games. Bryant watched from the end of the bench with ice packs on his right shoulder and both knees.\nTO THE POINT\nKidd made a subtle change after the break in assigning Antetokounmpo more ball-handling responsibility. The move has paid off, and Kidd likes the better ball movement and the explosiveness with young forwards Antetokounmpo and Parker.\n\"We're trying to get the ball to (Antetokounmpo) as quick as possible and having everybody else run,\" Kidd said.\nON SCENE\nWisconsin forward Nigel Hayes attended the game with Badgers teammates, wearing a purple Bryant jersey. Hayes used Bryant's locker two years ago when Wisconsin was playing at the Staples Center in the NCAA Tournament.\nTIP-INS\nLakers: D'Angelo Russell and Julius Randle have earned their increased playing time in recent weeks, with both players typically playing at least 30 minutes a game. Asked why he limited their playing time, Scott said, \"Humility, that's all. ... Just letting them know that nothing's going to be given to you. You've got to earn it. Those guys understand that now.\"\nBucks: New acquisition Steve Novak, a former star at Marquette, was in uniform for the first time and played the final 1:24, missing his only shot attempt. ... Parker had 15 points and nine rebounds.\nUP NEXT\nThe Lakers visit the Memphis Grizzlies on Wednesday.\nThe Bucks visit the Boston Celtics on Thursday.\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764994031.269429
}