{
  "game_id": "0022000248",
  "espn_id": "401267408",
  "date": "Jan 23, 2021",
  "matchup": "PHX vs. DEN",
  "headline": "Jokic, Murray push Nuggets to 120-112 win over Suns in 2 OTs",
  "body": "PHOENIX -- — There was extra basketball played in Phoenix for a second straight night and it was all Jamal Murray's fault. \n\n\r\n                    The fifth-year Nuggets guard has done some of the finest work in his NBA career against the Suns and the good times lasted deep into Saturday evening largely because of his clutch shooting.\n\n\r\n                    Murray's difficult, off-balance 3-pointer at the end of regulation forced overtime  and Denver outlasted Phoenix 120-112 in two overtimes. Nikola Jokic scored 29 points and grabbed 22 rebounds while Murray added 26 points.\n\n\r\n                    “This felt like a playoff game,” Denver coach Michael Malone said. “Playing the same team, starters playing in double OT, you ask a lot of your starters and they deliver.”\n\n\r\n                    It was the second straight impressive win for the Nuggets, who have won eight of their past 11 games. Denver won 130-126 in a single overtime Friday after rallying from a 14-point halftime deficit.\n\n\r\n                    Saturday's game was even more entertaining with the two teams trading last-second, game-tying 3s.\n\n\r\n                    Murray hit his while falling out of bounds with Deandre Ayton in his face as time expired in regulation. Phoenix's Jae Crowder responded with a 3-pointer with 0.7 seconds left in the first overtime to send the game deeper into the night.\n\n\r\n                    By comparison, the final minutes were boring. The Nuggets scored the first five points of the second overtime and never trailed.\n\n\r\n                    The Suns played without All-Star guard Devin Booker for the first time this season. Averaging a team-high 22.9 points, he hurt his left hamstring Friday.\n\n\r\n                    Jokic scored 12 of his 29 points during the two overtimes. Michael Porter Jr. came off the bench to score 14 points and grab 11 rebounds.\n\n\r\n                    “I was feeling good,” Jokic said. “When you’re playing, you’re feeling good ... It’s after the game when you feel it.”\n\n\r\n                    Chris Paul hit a 15-foot jumper with 12 seconds left in regulation to put the Suns ahead 98-95 but Murray responded with his clutch 3-pointer. The 6-foot-11 Ayton had a hand right in his face, but the ball splashed through the next anyway.\n\n\r\n                    Murray came into the game averaging 20.8 points against the Suns in his career, which is his most against any team.\n\n\r\n                    The first overtime was just as tight as the fourth quarter. Jokic made a smooth move in the post to get past Frank Kaminsky, making a layup while being fouled with 28 seconds left. He made the free throw to put the Nuggets up 104-102. \n\n\r\n                    The Suns had a chance to take the lead when Abdel Nader was fouled on a 3-pointer from the corner, but he missed two of three free throws. Jokic's two free throws put Denver ahead 106-103 before Crowder responded with a 3 with 0.7 seconds left to tie it and force even more basketball.\n\n\r\n                    It was Crowder's sixth 3-pointer of the night. Crowder and Paul led the Suns with 21 points each. Paul also had 13 assists. Cam Johnson scored 19 points but didn't play in the final minutes because of muscle cramps.\n\n\r\n                    “We did play very hard, put it out there,” Johnson said. “It is frustrating, very frustrating.”\n\n\r\n                    Suns coach Monty Williams said it was hard to be mad about his team's effort. He added that he felt his team — playing without Booker — got tired in the final minutes and couldn't quite finish.\n\n\r\n                    “I was just unbelievably proud of how they competed tonight,” Williams said. “We could have mailed it in coming off a tough one.”\n\n\r\n                    The Nuggets got a big boost from their bench, which added 52 points. \n\n\r\n                    Ayton had 15 points and eight rebounds in the first half as the Suns pushed to a 61-58 halftime lead. Paul had 12 assists before the break, one day after tying a franchise record with 14 assists in the first half.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Murray started despite being listed as questionable with a left shoulder sprain.\n\n\r\n                    Suns: F Dario Saric and F/C Damian Jones were both out because of COVID-19 health and safety protocols. ... Rookie Jalen Smith played in his first game since Dec. 26. The No. 10 overall pick out of Maryland had five points in the first half. Smith missed nearly a month with an ankle injury and then spent time on the COVID-19 list. ... Ayton fouled out in the first overtime and Kaminsky struggled on defense against Jokic.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: At Dallas on Monday night.\n\n\r\n                    Suns: Host Oklahoma City on Wednesday night.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997763.668104
}