{
  "game_id": "0022200597",
  "espn_id": "401468752",
  "date": "Jan 08, 2023",
  "matchup": "TOR vs. POR",
  "headline": "Blazers lose 7th straight on road, Raptors win 117-105",
  "body": "TORONTO -- — Pascal Siakam scored 27 points, Scottie Barnes had 22 and the Toronto Raptors snapped a three-game losing streak by beating the Portland Trail Blazers 117-105 on Sunday.\n\n\r\n              Gary Trent Jr. scored 19 against his former team and Fred VanVleet and O.G. Anunoby each had 14 as the Raptors halted a five-game losing streak against Portland.\n\n\r\n              Toronto won for the second time in nine home games, and the fourth time in its past 15 overall.\n\n\r\n              Barnes bounced back after scoring only seven points in Friday’s loss to the Knicks.\n\n\r\n              “Much better,” coach Nick Nurse said. “Both Scottie and Pascal played much more in rhythm tonight.”\n\n\r\n              Damian Lillard scored 14 of his 34 points in the fourth quarter but Portland’s road losing streak reached seven.\n\n\r\n              The Trail Blazers made a season-worst 24 turnovers, leading to 29 points for Toronto.\n\n\r\n              “For us to win this game, we had to take care of the ball and take good shots,” Portland coach Chauncey Billups said. “Twenty-nine points is just too much.”\n\n\r\n              The Blazers have lost the turnover battle in four of their past five games, losing each time.\n\n\r\n              “They continue to be our Achilles’ heel,” Billups said.\n\n\r\n              Jusuf Nurkic had 14 points and 18 rebounds, Anfernee Simons scored 22 points and Josh Hart had 18. Portland has lost three straight and seven of nine.\n\n\r\n              Jerami Grant scored 14 points as all five Portland starters reached double figures, but the Blazers got just three bench points.\n\n\r\n              After going winless on a three-game trip at Minnesota, Indiana and Toronto, the Blazers play 10 of their next 11 at home, where they have gone 9-6.\n\n\r\n              Still, Hart wasn’t convinced a change of scenery would cure Portland’s problems.\n\n\r\n              “We’ve got to play better,” Hart said. “The arena doesn’t matter. We’ve got to play better.”\n\n\r\n              After hosting Orlando Tuesday, the Blazers play Cleveland, then have two against Dallas.\n\n\r\n              “We’re playing some tough, tough teams,” Billups said.\n\n\r\n              Toronto led 92-76 with 10:40 left in the fourth but Portland cut it to 97-94 on Lillard’s basket with 6:17 remaining. VanVleet answered with back-to-back 3-pointers, giving Toronto a 103-94 edge with 5:45 left to play.\n\n\r\n              Siakam scored 13 points in the first and Toronto closed the quarter on an 11-2 run to lead 34-27.\n\n\r\n              Portland missed eight straight field goal attempts to start the second and fell behind 48-29, before Hart ended the drought with a dunk. The Blazers made nine of their final 12 attempts in the second, cutting the gap to 58-53 at halftime.\n\n\r\n              Toronto restored its double-digit cushion with a 14-0 run to start the second half. Siakam scored 10 points in the third and the Raptors took an 89-74 lead to the fourth.\n\n\r\n              VIEWING DISPLEASURE\n\n\r\n              Hours before the game, Portland’s Hart posted a tweet asking why his ESPN+ subscription wasn’t working. Minutes later, Hart posted another tweet after realizing he couldn’t access the service because he was in Canada. Hart was trying to watch his favorite soccer team, London’s Chelsea, who lost 4-0 to rivals Manchester City.\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: G Gary Payton II, who made his season debut Jan 2, was held out for the third straight game because of a sprained right ankle. Payton had been listed as probable but felt discomfort while warming up. Payton missed the start of the season while recovering from offseason core muscle surgery. … F Justise Winslow (sprained left ankle) missed his seventh straight game. … Rookie G Shaedon Sharpe, from London, Ontario, played in Canada for the first time. … Recorded assists on eight of nine made baskets in the first quarter.\n\n\r\n              Raptors: Trent failed to extend his career-best streak of scoring 20 or more points to a seventh game. … Signed G-F Joe Wieskamp to a 10-day contract Saturday. Wieskamp played 29 games with San Antonio last season. … Barnes had nine rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Host Orlando on Tuesday night.\n\n\r\n              Raptors: Host Charlotte on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994061.091097
}