{
  "game_id": "0022300208",
  "espn_id": "401584836",
  "date": "Nov 19, 2023",
  "matchup": "BKN vs. PHI",
  "headline": "Embiid, Maxey and Melton lead 76ers to a 121-99 win over Nets",
  "body": "NEW YORK -- — Joel Embiid had 32 points, 12 rebounds and nine assists as the Philadelphia 76ers beat the Brooklyn Nets 121-99 on Sunday.\n\n\r\n              Tyrese Maxey finished with 25 points and 10 assists, and De’Anthony Melton scored 21 points on 8-for-10 shooting for his fifth straight double-figure scoring game.\n\n\r\n              “He’s such a good shooter, a good player,” 76ers coach Nick Nurse said of Melton. “It’s huge for us because there should be a lot of crowded paint, so we’re going to need to shoot over the top of those sometimes.”\n\n\r\n              The 76ers (10-3) shot 45.7% from 3-point range in their ninth straight victory over Brooklyn, including a four-game sweep in last season’s Eastern Conference quarterfinals. Philadelphia also won its fifth straight in Brooklyn.\n\n\r\n              Lonnie Walker IV came off the bench to lead Brooklyn with 26 points and six rebounds. Mikal Bridges scored 18 points and Nic Claxton added 10 points and nine rebounds. Brooklyn (6-7) lost its second straight and had its three-game home win streak halted.\n\n\r\n              “It was a solid game, but it’s a loss so it really doesn’t mean anything,” Walker said. “I don’t think the points truly translated if we lost by 20-plus points. I was feeling it. I was within the groove of the game, but we lost.”\n\n\r\n              The Sixers closed the second quarter with a 23-7 run. Philadelphia scored 15 straight points in a span of 3:11 and turned a three-point deficit into a 12-point lead.\n\n\r\n              “It started on defense. We got a few stops,” Embiid said. “We were able to run in transition and then went small and we took advantage with a bunch of high-lows.”\n\n\r\n              Brooklyn was victimized by a half-closing run for the second straight game; Miami went on a 14-0 run on Thursday on the way to a 122-115 win.\n\n\r\n              “Teams are doing different things to us at the end of quarters to disrupt (us), so you have to have a poise about you,” Nets coach Jacque Vaughn said. “We’re still searching for that. We’ll continue to work on that and get better, but you see how those momentum plays make a difference, especially at the end of quarters.”\n\n\r\n              Maxey, who entered play 10th in the NBA in points per game (26.9), had 11 points on 4-for-10 shooting in the first half. He warmed up in the third quarter, scoring nine points and finished with 14 points in the second half while shooting 4 for 7 from 3-point range.\n\n\r\n              The 76ers forced seven turnovers in the third quarter and led by 27 points at 92-65. Philadelphia outscored Brooklyn 33-23 in the third and held the Nets to their lowest scoring output of the season.\n\n\r\n              “We’re just working together,” Embiid said. “We’re doing a great job playing together.”\n\n\r\n              Three players scored for the Sixers in the first quarter. Maxey had just two points on 1-of-4 shooting. But, Embiid scored 13 points in the first, and Melton chipped in eight, helping Philadelphia build an early 10-point lead.\n\n\r\n              “Melt’s a great shooter,” Maxey said. “He did great. He’s great defensively. We know what he brings to the table there, and when he’s making shots, he takes us to a whole new level.”\n\n\r\n              The Nets started 1 for 7 from the field, but closed the frame on an 8-2 run, cutting the 76ers’ lead to 23-22 after one. The Nets held Philadelphia scoreless for three-plus minutes and used a 16-5 run in the second quarter to build their largest lead at 42-38.\n\n\r\n              “Early in the game we probably took too many mid-range shots just because (Embiid was) at the rim,” Vaughn said. “That’s where the premium comes with us getting out in transition, when we were able to get them cross-matched, you get opportunities.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Cleveland Cavaliers on Tuesday.\n\n\r\n              Nets: At Atlanta Hawks on Wednesday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996366.3697019
}