{
  "game_id": "0021500705",
  "espn_id": "400828592",
  "date": "Jan 29, 2016",
  "matchup": "CHA @ POR",
  "headline": "Lillard scores 22 points, Blazers beat Hornets 109-91",
  "body": "PORTLAND, Ore. --  For the Portland Trail Blazers, the current hot streak comes down to trust.\n\nDamian Lillard is getting offensive help from across the roster, and the Blazers aren't blowing leads. They're playing better defense as a unit.\n\nIt was apparent on Friday night when Lillard scored 22 points and Allen Crabbe added 20 off the bench in a 109-91 victory over the Charlotte Hornets.\n\n\"Our team is growing closer,\" Lillard said. \"We're trusting each other more.\"\n\nC.J. McCollum and Al-Farouq Aminu contributed with 17 points apiece for the Blazers, who have won three straight and seven of their last nine games overall. They've won eight straight over Charlotte at home.\n\nMarvin Williams had 20 points and nine rebounds as the Hornets fell to 6-17 on the road this season. Brian Roberts added 17 points off the bench as a late rally fell short.\n\n\"I think we're just more locked in to what we need to do on both ends of the court,\" Portland's Meyers Leonard said, adding that the team may have seen a different result earlier this season.\n\nThe game marked the return of Charlotte's Michael Kidd-Gilchrist, who played his first game of the season after suffering a shoulder injury in the preseason. The Hornets' top defender started and played 33 minutes, getting 13 points and seven rebounds.\n\n\"I was a little winded,\" he said. \"I had a spurt of sprints up and down the floor o I got a little tired but that's going to come.\"\n\nKidd-Gilchrist had surgery for a torn labrum after getting injured in the team's first preseason game at Orlando on Oct. 3. He played in 55 games last season, averaging a career-high 10.9 points, 7.6 rebounds and 1.4 assists in 28.9 minutes a game.\n\nHornets coach Steve Clifford said before the game that he wouldn't restrict Kidd-Gilchrist's minutes but instead would keep a close eye on him.\n\n\"I thought he'd be able to play six to eight minutes at a time,\" Clifford said. \"In the fourth quarter when that group got rolling, I just told him to let me know.\"\n\nNicolas Batum, who spent seven seasons with the Blazers, made his first appearance in Portland since he was traded to the Hornets last summer. He was given a standing ovation by the Moda Center crowd during player introductions. He finished with three points and eight assists in his second game back after missing seven games with a right toe strain that was still bothering him.\n\nLillard and McCollum combined for 18 points in the third quarter, and the Blazers outscored the Hornets 33-24 to take an 83-69 lead going into the final period.\n\nPortland led by as many as 20 points after a back-and-forth first half.\n\nLillard's dunk gave the Blazers a 21-20 lead in the first half. McCollum extended Portland's lead with a 3-pointer and a jumper that made it 33-27.\n\nCharlotte answered with a 9-2 run to go up 37-35, but Portland pulled back into a 50-45 lead at the half.\n\nThe Blazers pushed the lead to 69-61 in the third quarter and went into the fourth leading 83-69. Charlotte came within 100-91 late but couldn't get any closer.\n\nTIP INS:\n\nTrail Blazers: Blazers' super fan Maxine was at the game for her 103rd birthday. ... Mason Plumlee had 13 points and 12 rebounds for his career-high 13th double-double.\n\nHornets: Charlotte was without Jeremy Lin, injured in a loss to the Jazz on Wednesday. Clifford said he had no timetable for Lin's return. ... The Hornets were also missing guard Jeremy Lamb for the fourth game because of a sprained big toe on his right foot.\n\nWHERE'S WALKER?\n\nCharlotte's Kemba Walker had 14 points but did not play the fourth quarter, leading to speculation that he was also injured. But Clifford noted that Roberts was in a groove.\n\n\"I just didn't go back to him because Brian was playing so well,\" Clifford said. \"When you get a group that digs into a lead you go with it, so that's what I did.\"\n\nAMINU'S D:\n\nAminu added 12 rebounds for his seventh double-double of the season, and his 17 points matched his season high.\n\nBut coach Terry Stotts pointed to his defense of Batum.\n\n\"He got into him, didn't let him get to his right hand very easily, didn't let him have clean looks at the basket, contested his dribble, contested his shot,\" Stotts said.\n\nUP NEXT:\n\nThe Hornets visit the Los Angeles Lakers on Sunday.\n\nThe Trail Blazers host Minnesota on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994378.417143
}