{
  "game_id": "0022401011",
  "espn_id": "401705577",
  "date": "Mar 20, 2025",
  "matchup": "BKN @ IND",
  "headline": "Bennedict Mathurin scores 28 and leads Pacers to a 105-99 overtime victory over the Nets",
  "body": "INDIANAPOLIS -- — Bennedict Mathurin scored six of his 28 points in overtime and the Indiana Pacers defeated the Brooklyn Nets 105-99 on Thursday night.\n\n\r\n              Mathurin added a career-high 16 rebounds for the Pacers. Myles Turner added 23 points, 10 rebounds and five blocks.\n\n\r\n              Ziaire Williams and D’Angelo Russell each scored 22 points for Brooklyn.\n\n\r\n              Indiana trailed 52-42 at halftime and outscored the Nets by four points in the third quarter and six in the fourth to force overtime tied at 91. \n\n\r\n              In overtime, Mathurin shot 2 for 3 from the field and 2 for 3 from the line.\n\n\r\n              Takeaways\r\n              Nets: Brooklyn’s free-fall continued with the team's 12th loss in 14 games. Brooklyn led 52-42 at halftime but scored just 39 points in the second half and was outscored 14-8 in overtime.\n\n\r\n              Pacers: Indiana came through in the clutch without its star point guard and now has won five of six. Tyrese Haliburton missed the game with lower back soreness. It was his third straight missed game, and the Pacers have won them all.\n\n\r\n              Key moment\r\n              Indiana’s Bennedict Mathurin made three free throws with 14 seconds left in regulation to tie the game at 91, leading to overtime.\n\n\r\n              Key stat\r\n              The Pacers outscored the Nets by 14 points at the free throw line, making 27. The Nets hits 13.\n\n\r\n              Up next\r\n              The teams meet again on Saturday, in Indianapolis.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997966.366446
}