{
  "game_id": "0021900660",
  "espn_id": "401161302",
  "date": "Jan 22, 2020",
  "matchup": "TOR vs. PHI",
  "headline": "VanVleet scores 22 as Raptors top 76ers for 5th straight win",
  "body": "TORONTO --  Already without star center Joel Embiid, the Philadelphia 76ers couldn’t overcome losing another starter to injury.\n\nPascal Siakam had 18 points and 15 rebounds, Fred VanVleet scored 22 and the Toronto Raptors beat the short-handed 76ers 107-95 on Wednesday night, extending their winning streak to five.\n\nPhiladelphia lost guard Josh Richardson when he strained his left hamstring while trying to make a steal four minutes into the first quarter. He did not return.\n\n“He’s a big part of this team defensively and offensively, so we’re going to miss him for however long he’s out,” Sixers guard Ben Simmons said.\n\nRichardson had scored 15 or more points in seven of the past eight games, He did not speak to reporters following the game, but the team said he will be re-evaluated Thursday. Richardson missed six games in late November and early December because of a right hamstring injury.\n\nEmbiid missed his eighth straight game after undergoing surgery to repair a torn ligament in his left hand.\n\n“We thought that our best opportunity to steal a win on the road without Jo and J-Rich was going to be to hunt some 3s and spread the thing around and play fast and share the ball,” 76ers coach Brett Brown said. “At the start of the game, in the first period, we did that quite well.”\n\nPhiladelphia connected on seven of 14 attempts from beyond the arc in the first, but just 11 of 32 the rest of the way. After making 14 field goals in the first, the Sixers had 18 in the final three quarters combined.\n\n“Even with guys out we still had a chance to be in this game and get a win,” forward Tobias Harris said. “Give them credit, they did a really good job after the first quarter defending us.”\n\nNorman Powell scored 18 points, Marc Gasol shot 7 for 7 and finished with 17 points, and Kyle Lowry and Serge Ibaka each scored 16 as the Raptors won their 15th straight at home against the 76ers.\n\n“They had like five totally uncontested 3s in the first four minutes of the game but we (defended) when it mattered,” Toronto coach Nick Nurse said. “We were moving and flying, playing physical most of the second half, I thought.”\n\nSimmons had 17 points, 10 rebounds and eight assists for the 76ers, narrowly missing his second straight triple-double. But he had just two points and one rebound in the fourth quarter as Philadelphia’s four-game winning streak was snapped.\n\n“There was a physicality to their game that you felt,” Brown said of Toronto’s defense.\n\nHarris scored 22 points, Furkan Korkmaz had 17 and Matisse Thybulle 13 for the 76ers.\n\nPhiladelphia trailed 93-90 after Simmons scored on a dunk with 4:26 left in the fourth, his only points of the final quarter, but Toronto answered with a 10-0 run over the next three minutes as the Sixers missed five straight shots.\n\n“We turned the ball over a couple of times in that stretch, which led to them getting out in transition,” Harris said. “On our part, we didn’t get good offensive execution on getting up good shots and good looks that we needed. It’s something that we’ve got to get better at.”\n\nHarris stopped the drought with a pair of free throws in the final minute, but it was too late for the 76ers.\n\nTIP-INS\n\n76ers: Simmons had six assists in the first quarter, as many as the Raptors had as a team. … Al Horford grabbed 10 rebounds but shot 3 for 11 and scored seven points. … Philadelphia is 9-15 on the road. The Sixers had won two straight away from home following a six-game road losing streak.\n\nRaptors: F Patrick McCaw had to be helped to the locker room with a towel pressed to his face after being struck by Norvel Pelle’s arm while fighting for a rebound early in the second. The Raptors said McCaw broke his nose and will see a specialist Thursday. He is not expected to travel with the team for Friday’s game against the Knicks.\n\nEND OF THE LINE\n\nPowell failed to extend his career-best streak of five straight 20-point games. He had the ball with time winding down but declined to shoot.\n\nPAINT PRESENCE\n\nWith Embiid sidelined, Toronto outscored Philadelphia 52-18 in the paint.\n\nDO YOU REMEMBER?\n\nThe 76ers haven’t won a regular-season game north of the border since Nov. 10, 2012.\n\nUP NEXT\n\n76ers: Host the Los Angeles Lakers on Saturday.\n\nRaptors: Visit the New York Knicks on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995954.537652
}