{
  "game_id": "0022300607",
  "espn_id": "401585235",
  "date": "Jan 22, 2024",
  "matchup": "ORL vs. CLE",
  "headline": "Sam Merrill scores 26, Cavs ease past Magic 126-99 for 8th straight win",
  "body": "ORLANDO, Fla. -- — Sam Merrill helped the Cleveland Cavaliers close out their eighth straight win in the first 15 minutes Monday night.\n\n\r\n              Merrill hit his first five 3-point attempts and scored 20 of his 26 points in the first half as the Cavaliers rolled to a 126-99 win over the Orlando Magic.\n\n\r\n              Donovan Mitchell added 25 points and 13 assists for the Cavs, who shot 20 for 38 (53%) from 3-point range. Cleveland never trailed and led by 36 at one point. Merrill's fifth 3-pointer gave them a 48-27 lead just three minutes into the second quarter.\n\n\r\n              “He’s doing it consistently,” said Jarrett Allen, who set a franchise record with his 12th straight double-double. “We feel like we can give him the ball every single time and he’s going to make the shot. In my mind he hasn’t missed yet.”\n\n\r\n              The Cavs' win streak is one short of the NBA's longest this season (set by the Magic from Nov. 15-Dec. 1 and the Los Angeles Clippers from Dec. 2-20), and all of it has been accomplished without Darius Garland and Evan Mobley, the team's second- and third-leading scorers.\n\n\r\n              Allen, who didn't score until the Cavs had a 21-point lead, finished with 14 points and 11 rebounds and was given a game ball.\n\n\r\n              “Each of our guys is focusing and thriving in their roles, and J.A. is thriving in his role clearly,” said coach J.B. Bickerstaff, who credited Allen for the team's quick starts during the streak.\n\n\r\n              “Jarrett Allen wins the tip and we get the first possession,” Bickerstaff said. “Then our defense has just been incredible. Our guys have been elite on that end of the floor, and when you are that good, you’re going to give yourself a chance to get to those starts. Tonight (the Magic) had seven points around the six-minute mark. That’s difficult to overcome.\"\n\n\r\n              Paolo Banchero had 18 points and six assists for the Magic. Franz Wagner, who played 24 minutes in the second half of a back-to-back after missing eight games with a sprained ankle, scored 17 points.\n\n\r\n              “You can just tell the way they're playing that they're on a win streak,” Banchero said. “We've played that team when they're fully healthy, and a lot of these guys have a bunch of confidence. I think they started off making some tough shots and it was kind of over from there, really. We never really got back in it.”\n\n\r\n              Max Strus, Isaac Okoro, Dean Wade and Mitchell all hit 3-pointers in the first five minutes, staking the Cavs to an 18-7 lead, and then Merrill got involved.\n\n\r\n              “I think there’s definitely a high level of confidence and trust in each other,” said Merrill, who came into the game with an 8.1-point scoring average. “Because of all the new guys and having kind of a new system, we certainly had to grow, and I think we have that right now.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Milwaukee on Wednesday.\n\n\r\n              Magic: Visit Memphis on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995702.82975
}