{
  "game_id": "0021800757",
  "espn_id": "401071430",
  "date": "Jan 30, 2019",
  "matchup": "MIA vs. CHI",
  "headline": "Bulls add to Heat woes at home, win 105-89",
  "body": "MIAMI --  The Chicago Bulls are mired toward the bottom of the NBA standings and know the postseason isn't going to include them. That being said, there's no way coach Jim Boylen is going to let them merely play out the string as though the last 30 games are meaningless.\n\nInstead, he's challenging them.\n\nAnd on Wednesday night, they listened.\n\nBobby Portis scored 22 of his 26 points in the second half, Wayne Selden added 20 and the Bulls ran away after halftime to beat the Miami Heat 105-89 -- getting a win to finish off the second-worst January in franchise history.\n\n\"I just think you make it a competitive experience,\" said Boylen, whose team went 2-13 this month. \"Look, this game today is what the league's about. You get in late after a competitive game and now you're playing at the Miami Heat, a great franchise. Now, a competitive person takes that challenge.\"\n\nLauri Markkanen had 14 points and 13 rebounds for the Bulls, who went 1-13 in January 2001 for their worst first month of the calendar year. Kris Dunn scored 14 and Robin Lopez added 13 for Chicago, which shot 51 percent. That, combined with a 50 percent showing at Brooklyn on Tuesday night, marked the first time the Bulls have made at least half their shots in consecutive games since October.\n\n\"We knew we've got a locker room with no superstars in here,\" Selden said. \"We didn't have any superstars out there tonight, but we had a whole bunch of guys that wanted to fight and we have some dogs in here.\"\n\nMiami -- now without Derrick Jones and Goran Dragic -- held out Dwyane Wade with right knee soreness. Chicago was without Zach LaVine because of a sprained right ankle.\n\nTyler Johnson scored 15 points for Miami, which got 14 from Justise Winslow and 13 apiece from Bam Adebayo and Wayne Ellington. The Heat shot 38 percent, including 12 of 42 from 3-point range.\n\n\"You could just feel missed shots sapped some of our energy and resolve at the other end,\" Heat coach Erik Spoelstra said.\n\nThe Heat fell to 11-14 at home -- and the Bulls, who snapped a four-game slide, moved to 7-20 on the road. Portis had 15 points in the fourth, while Miami's entire roster managed 21 in the final 12 minutes.\n\nThe Bulls led by 10 after the first quarter, took a two-point lead into halftime and then found themselves trailing by six early in the third. But they answered with an 18-5 run over the next five minutes, and led by three when Dion Waiters tried a 3-pointer with 1:38 left for the tie.\n\nIt missed, and with that the Bulls were off and running. Chicago finished the quarter on a 7-0 run, led by 10 going into the fourth and kept the lead the rest of the way.\n\n\"They took advantage of our mistakes,\" said Heat guard Josh Richardson, who finished with 12 points.\n\nTIP-INS\n\nBulls: Carmelo Anthony still appears on Chicago's roster. The official reason for him not playing is listed as \"trade pending.\" ... Chicago has reached 100 points in 14 consecutive games, the team's longest streak since the 1991-92 season.\n\nHeat: Miami won the season series 2-1. The Heat have swept the Bulls only twice in 31 seasons. ... Miami shot 18 of 42 inside the paint.\n\nWADE DEAL\n\nWade was announced Wednesday as an ambassador for BallerTV, a site streaming live amateur sports such as high school basketball. Wade -- who has used it to follow his son's games -- said part of the appeal for him is that students do much of the announcing and camera-operating. \"They get a chance to get a camera from BallerTV and go do this themselves. It helps youth get to their dreams,\" Wade said.\n\nBIG DIFFERENCE\n\nIt was 68 degrees in Miami at game time -- a 102-degree difference from what Chicago felt like. Wind chill there at game time was minus-34.\n\nUP NEXT\n\nBulls: Visit the Charlotte Hornets on Saturday.\n\nHeat: Host the Oklahoma City Thunder on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995236.6913311
}