{
  "game_id": "0022400285",
  "espn_id": "401704851",
  "date": "Nov 25, 2024",
  "matchup": "OKC @ SAC",
  "headline": "Shai Gilgeous-Alexander scores 37 and Thunder bench scores 40 in OKC's 130-109 rout of Kings",
  "body": "SACRAMENTO, Calif. -- — Shai Gilgeous-Alexander had 37 points and the Oklahoma City Thunder’s bench players combined for 40 points in a 130-109 win over Sacramento on Monday night that extended the Kings' losing streak to four.\n\n\r\n              Jalen Williams scored 28 points and Isaiah Hartenstein returned from a stint on the injured list with 17 points for the Thunder.\n\n\r\n              DeMar DeRozan scored 19 points in the first half and finished the game with 30 for the Kings. The Kings bench scored half of what the Thunder's bench did, and Sacramento shot just 25% from 3-point range.\n\n\r\n              Takeaways\r\n              Thunder: Oklahoma City started a challenging road trip with confidence. The Thunder will play the three best teams in the West and Hartenstein's return to the starting lineup was a welcome sight for an Oklahoma City team that needs to stay stout on defense.\n\n\r\n              Kings: Sacramento trailed by one point at halftime after a competitive first half where the lead changed 15 times and Oklahoma City's biggest lead was six points. It was just what head coach Mike Brown wanted to see from his team after he emphasized the need for stronger first halves before the game. But the Kings could not sustain the momentum in the second half. \n\n\r\n              Key moment\r\n              Both teams found themselves in foul trouble in the third quarter, but the Kings' fouls ultimately gave the Thunder the opportunity to pull away. After replay review attributed a gash over the eye of Hartenstein to Domantas Sabonis, back-to-back fouls from Malik Monk started the slide.\n\n\r\n              Key stat\r\n              De'Aaron Fox had only 14 points, a far cry from his 28.9 points per game average and was charged with a technical foul in the fourth.\n\n\r\n              Up next\r\n              Oklahoma City continues a five-game road trip against the Warriors on Wednesday night and the Kings visit the Timberwolves on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997517.246047
}