{
  "game_id": "0022400667",
  "espn_id": "401705233",
  "date": "Jan 29, 2025",
  "matchup": "MIA vs. CLE",
  "headline": "Donovan Mitchell scores 34 points, Cavaliers never trail in 126-106 win over Heat",
  "body": "MIAMI -- — Donovan Mitchell scored 34 points, Ty Jerome added 20 off the bench and the Cleveland Cavaliers never trailed in a 126-106 win over the Miami Heat on Wednesday night.\n\n\r\n              It was Mitchell's 14th 30-point game of the season, his fifth in his last seven outings.\n\n\r\n              Evan Mobley had 22 points and 15 rebounds for Cleveland, which got 13 points from Georges Niang and 12 points and 10 rebounds from Jarrett Allen.\n\n\r\n              Tyler Herro and Terry Rozier each scored 22 points for Miami. Bam Adebayo had 21 points and Duncan Robinson finished with 13 for the Heat, who were outrebounded 47-35.\n\n\r\n              Cleveland improved to 29-2 when holding teams to 116 points or less — the Cavs are 9-7 otherwise — and 33-0 when leading after three quarters.\n\n\r\n              Takeaways\r\n              Cavaliers: Darius Garland — averaging 21.7 points per game — was held out to rest, the second game he's missed this season. “We obviously have all the numbers and the data and all that. I’m just thinking of him first,” Cavs coach Kenny Atkinson said.\n\n\r\n              Heat: Miami was held to 41 points in the first half, tying a season low. The Heat then scored 43 points in the third quarter, with Herro getting eight points in the final 40 seconds to get Miami within 94-84.\n\n\r\n              Key moment\r\n              Just after Miami got within eight early in the fourth, Cleveland went on a 7-0 run in 44 seconds. Mitchell's 3-pointer with 10:15 left made it 101-86 and the Cavs kept control from there.\n\n\r\n              Key stat\r\n              It was Cleveland's sixth wire-to-wire win of the season — the first of those that came on the road. Miami never led, the fourth time this season that's happened to the Heat.\n\n\r\n              Up next\r\n              Cleveland starts a three-game homestand Thursday night against Atlanta. Miami opens a four-game trip Saturday night at San Antonio.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998288.109448
}