{
  "game_id": "0022000772",
  "espn_id": "401307563",
  "date": "Apr 06, 2021",
  "matchup": "TOR vs. LAL",
  "headline": "Lakers build big early lead, cruise past Raptors 110-101",
  "body": "TAMPA, Fla. -- — The Los Angeles Lakers came out with “an angry, nasty defensive disposition,” coach Frank Vogel said, two days after an embarrassing loss to the Clippers.\n\n\r\n                    Hot shooting didn't hurt, either.\n\n\r\n                    The Lakers made 18 3-pointers, including seven of their first eight attempts, in a 110-101 win over the Toronto Raptors on Tuesday night.\n\n\r\n                    “We had high-quality shots, didn't settle for mid-range, and as a result we hit a high percentage (45%),” Vogel said.\n\n\r\n                    The Lakers built a 34-point lead in the first 20 minutes and were never threatened in the second half.\n\n\r\n                    Talen Horton-Tucker led seven Lakers in double figures with 17 points. Markieff Morris scored 15 before leaving the game with five fouls in the third quarter, and Marc Gasol had 13 points and nine rebounds.\n\n\r\n                    “Some days you make shots, some days you don't. You always have to keep that in perspective,\" said Alex Caruso, who made 3 of 4 3-pointers and finished with 13 points. “I think we were just playing through whatever they gave us defensively.”\n\n\r\n                    Pascal Siakam scored 17 of his 27 points in the fourth quarter for Toronto after hitting just 2 of 11 shots in the first half. The Raptors were coming off a last-second win over the Washington Wizards.\n\n\r\n                    “I think we were up against a super-motivated team, to play better than they've been playing,” Toronto coach Nick Nurse said. “And they saw we were coming off an emotional game last night. It's going to happen sometimes when a team makes a ton of 3s, and you don't.”\n\n\r\n                    The Raptors shot 5 for 33 from behind the arc.\n\n\r\n                    The Lakers’ Montrezl Harrell and Toronto’s OG Anunoby were ejected with 2:24 left in the first quarter after Dennis Schroder fouled Anunoby’s layup attempt. Several players, including Harrell, were involved in an altercation after Schroder and Anunoby squared off.\n\n\r\n                    The ejections were determined by a video review of the incident. The Lakers led 34-20 at the time.\n\n\r\n                    The Lakers converted 13 of their first 18 3-point attempts and led 66-32 after Morris scored seven straight points late in the second quarter.\n\n\r\n                    Los Angeles shot 60% overall in the first half and had a 29-13 rebounding advantage to lead 68-42 at the break.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: C Andrew Drummond was unable to play in his first game with the Lakers. He has missed four games with a toe contusion. The Lakaers are hopeful he can start Thursday at Miami.. ... G Wesley Mathews played 23 minutes after missing Sunday night's game with a strained neck. ... The Lakers are 4-5 since LeBron James went out with a sprained ankle, and 11-12 without Anthony Davis (calf strain). ... The Lakers had lost 11 straight to the Raptors.\n\n\r\n                    Raptors: G Kyle Lowry (right foot infection) and G Fred VanVleet (left hip flexor) did not play. ... G Paul Watson Jr. missed a seventh game due to COVID-19 protocols. ... The 34-point first-half deficit came just four days after the Raptors' 130-77 win over Golden State, the biggest victory margin in the NBA this season.\n\n\r\n                    ASK ME LATER\n\n\r\n                    Unable to discuss the impending signing of G Ben McLemore before the game, Vogel said: “If we were going to add a player, we would want to add someone with the skill set we need.”\n\n\r\n                    After the game, Vogel said: “Instantly it elevates our ability to knock down 3s.”\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: At Miami on Thursday night.\n\n\r\n                    Raptors: Host Chicago on Thursday night in Tampa.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996833.581991
}