{
  "game_id": "0021800419",
  "espn_id": "401071100",
  "date": "Dec 13, 2018",
  "matchup": "PHX vs. DAL",
  "headline": "Dirk Nowitzki makes long-awaited return, but Mavs fall to Suns",
  "body": "PHOENIX -- T.J. Warren scored a season-high 30 points, and the Phoenix Suns snapped a 10-game losing streak by beating the Dallas Mavericks 99-89 on Thursday night.\nThe Dallas loss came in the season debut of Dirk Nowitzki, who hadn't played yet while recovering from ankle surgery. When he entered the game late in the first quarter, it marked his 21st season with the Mavericks, the most by a player with one team in NBA history.\nPhoenix beat the Mavericks for the seventh straight time. The Suns have just five wins this season, and two have come against Dallas.\nThe Mavericks were beaten in the season opener 121-100, also in Phoenix. Both games were late tipoffs on national television.\nDallas, which had won three straight and eight of 10, made only 5 of 33 3-pointers.\nJamal Crawford added 17 points and Josh Jackson 14 for the Suns. Trevor Ariza had 13 points, 8 rebounds and 5 assists.\nHarrison Barnes scored 15 but on only 6-of-15 shooting for the Mavericks. DeAndre Jordan added 14 points and 15 rebounds.\nDallas never led after the first quarter. Phoenix was up by 10 at halftime and as many as 15 in the third quarter.\nThe Mavericks tied it twice early in the second period before a 9-2 spurt put Phoenix up 36-28 on Jackson's fast-break dunk. Another dunk on the break, this one by Warren, gave the Suns their biggest lead of the half at 47-36 with 1:14 left. Dallas scored the next four points before Mikal Bridges banked in a 3-pointer from 35 feet at the buzzer to put the Suns up 50-40 at the break.\nThe Mavericks cut it to 56-53 early in the third but Phoenix got two 3-pointers from Ariza and one from Jackson in a 12-4 run to lead 68-57 on Crawford's driving layup. The Suns twice stretched the lead to 15 late in the quarter, the last time at 78-63 after Warren's driving reverse layup with 53 seconds left in the third. Phoenix led 78-67 entering the fourth.\nBarnes' basket cut the lead to 90-83 with 3:43 remaining, but the Suns scrambled for a loose ball and Jackson sank a 3-pointer to make it 93-83. Barnes lost the ball to Ariza for a turnover, Crawford made a 19-footer and the Suns coasted from there.\nTIP-INS\nMavericks: Backup point guard J.J. Barea missed the game with a sprained left ankle. ... Dallas was 2-of-19 on 3-pointers in the first half. Barnes was 0-for-6. ... The Mavs were playing for the second consecutive night, beating Atlanta 114-107 in Dallas on Wednesday.\nSuns: Deandre Ayton, the No. 1 overall draft pick, was just 3-of-13 shooting for seven points with five rebounds and four turnovers, compared with Dallas' Luka Doncic, the No. 3 pick, who had 13 points, 6 assists, 5 rebounds and 4 turnovers. ... It was the first Phoenix win this season without Devin Booker, who missed his sixth straight game (hamstring).",
  "source": "espn_api",
  "crawled_at": 1764995089.437657
}