{
  "game_id": "0022400504",
  "espn_id": "401705070",
  "date": "Jan 07, 2025",
  "matchup": "LAL @ DAL",
  "headline": "Mavericks end 5-game losing streak with a 118-97 victory over Lakers",
  "body": "DALLAS -- — Quinten Grimes had 26 points, nine rebounds and six assists as the Dallas Mavericks snapped a five-game skid with a 118-97 win over the Los Angeles Lakers on Tuesday night.\n\n\r\n              Grimes matched his career high with six 3-pointers on 6-for-11 shooting. P.J. Washington shot 9 for 14 and finished with 22 points and eight rebounds for the Mavs, who shot 52% (18 of 38) from the field.\n\n\r\n              The Mavericks ended their losing streak without their top scorers. Luka Doncic has been out with a left calf strain since Dec. 25, and Kyrie Irving has been sidelined the past two games with a bulging disk in his back.\n\n\r\n              Anthony Davis led the Lakers with 21 points and 12 rebounds. LeBron James added 18 points, 10 rebounds, and eight assists. Los Angeles lost its second straight and for the third time in five games.\n\n\r\n              Takeaways\r\n              Lakers: Los Angeles was 11 of 35 from 3-point range and shot 45% overall from the field. The Lakers were outrebounded 44-33 and trailed by as many as 21 points.\n\n\r\n              Mavericks: Dallas hadn’t lost six consecutive games since Jan. 23-Feb. 1, 2021. \n\n\r\n              Key moment\r\n              The Mavs finished the first half on an 11-0 run to take a five-point lead. They kept it going early in the third quarter, building a 16-point advantage with three minutes remaining in the period.\n\n\r\n              Key stat\r\n              The Mavericks' reserves outscored the Lakers bench 50-25, including 38 combined points from Grimes and Jaden Hardy.\n\n\r\n              Up next\r\n              The Lakers start a five-game homestand against the Charlotte Hornets on Thursday. The Mavericks host the Portland Trail Blazers on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997180.036615
}