{
  "game_id": "0022400715",
  "espn_id": "401705281",
  "date": "Feb 04, 2025",
  "matchup": "LAC vs. LAL",
  "headline": "LeBron scores 26, and the Lakers thrash the Clippers 122-97 with Luka Doncic watching on the bench",
  "body": "INGLEWOOD, Calif. -- — LeBron James had 26 points, nine assists and eight rebounds, and Luka Doncic watched approvingly from the bench while the Los Angeles Lakers thrashed the Los Angeles Clippers 122-97 Tuesday night.\n\n\r\n              Doncic clapped and occasionally fist-pumped during the Lakers' outstanding performance in their first game since they made the seismic trade to acquire the All-NBA scoring champion in exchange for star big man Anthony Davis. James and Doncic, who is close to a return from a strained calf, sat next to each other and talked at times.\n\n\r\n              Austin Reaves and Rui Hachimura scored 20 points apiece for the Lakers, who finished a six-game trip with five victories despite losing Davis to injury even before the trade. The Lakers' victory was their first at Intuit Dome, their crosstown rivals' sparkling new arena.\n\n\r\n              Norman Powell scored 20 points for the Clippers (28-22), who fell two games behind the fifth-place Lakers (29-19) in the West.\n\n\r\n              James Harden went 2 of 12 for seven points, and Kawhi Leonard scored just 11 before both stars took the fourth quarter off.\n\n\r\n              Bronny James hit his first NBA 3-pointer while playing the final six minutes.\n\n\r\n              Patty Mills and Drew Eubanks played the final seven minutes in their debuts with the Clippers, who acquired the veterans Saturday from Utah.\n\n\r\n              Takeaways\r\n              Clippers: A lifeless effort in their return from a four-game trip. Owner Steve Ballmer had little to cheer.\n\n\r\n              Lakers: The results were brilliant, but the method was also impressive. They fought and worked on defense — something they'll have to do every night without Davis.\n\n\r\n              Key moment\r\n              The Lakers put up 45 points in the first quarter — the most they've managed in any period this season.\n\n\r\n              Key stat\r\n              The Lakers didn't make a turnover until midway through the second quarter.\n\n\r\n              Up next\r\n              The Lakers host the Warriors on Thursday. The Clippers host the Pacers on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998031.064097
}