{
  "game_id": "0021900677",
  "espn_id": "401161319",
  "date": "Jan 24, 2020",
  "matchup": "ATL @ OKC",
  "headline": "Gallinari scores 25, leads Thunder past Hawks 140-111",
  "body": "OKLAHOMA CITY --  It's all coming together for Oklahoma City.\n\nDanilo Gallinari scored 25 points and the Thunder beat the Atlanta Hawks 140-111 on Friday night for their fourth straight win.\n\nShai Gilgeous-Alexander scored 24 points and Dennis Schroder added 21 for the Thunder, who shot 58% from the field and posted a season-high point total.\n\nIt was another positive step for one of the league's surprise teams.\n\n\"Sometimes those kinds of underdog-type teams -- there is not really one main guy, there's a lot of guys that really gel together,\" Atlanta guard Trae Young said. \"Their chemistry's great. They just play well off of each other, and that's what I think they have here.\"\n\nYoung, who was named an All-Star starter on Thursday, had 26 points and a season-high 16 assists. John Collins scored 28 points and Cam Reddish 20 for the Hawks.\n\nYoung grew up in Norman, Oklahoma, and played a season of college ball at the University of Oklahoma, about a 30-minute drive south of Chesapeake Energy Arena. He grew up a Thunder fan, and he made a special effort to connect with their fans on Friday.\n\n\"It feels good,\" Young said. \"I was that kid coming back when there was 90 minutes on the clock as soon as the doors open and try to get down there and watch players warm up. So for me, working out with 90 minutes on the clock and then being back home, I just wanted to sign as many autographs as I could.\"\n\nHe was greeted warmly by those fans during pregame introductions.\n\n\"What's the coolest part, too, is to see the way the fans went crazy for him when they heard his name, as they should,\" Thunder guard Chris Paul said. \"He's homegrown. Mr. Oklahoma, and he deserves it, and to be in the All Star game as a starter is unbelievable.\"\n\nYoung's shot was cold early. The league's No. 3 scorer went scoreless until he made a free throw with 5:33 left in the second quarter. His first field goal came with 4:11 left in the second.\n\nThe Thunder led 66-58 at halftime. Young scored 11 points on 2-of-10 shooting before the break, and had eight assists.\n\nThe Thunder extended their lead to 104-90 by the end of the third quarter, and the game was never close in the fourth. Oklahoma City's largest lead was 33 points.\n\n\"We picked up our defense, especially in the fourth quarter,\" Paul said. \"Our coach got on us at halftime about our defense and intensity and he was right. You know that team right there, even though their record isn't that great, they beat some really good teams because you let them hang around. They are NBA players just like us, so we picked up our defense, and I think that sparked our offense also.\"\n\nTIP-INS\n\nHawks: G/F DeAndre' Bembry underwent a non-surgical procedure on his right hand Friday to address nerve inflammation and was not with the team. The Hawks said they will reassess his status before Sunday's game against the Washington Wizards. He averages 5.8 points and 3.5 rebounds. ... Young missed Wednesday's game against the Los Angeles Clippers with a right thigh contusion.\n\nThunder: Were without starters Steven Adams and Terrance Ferguson. Adams, a center, was out for the second straight game with a left ankle sprain. He is averaging 11.3 points and 9.7 rebounds. Ferguson sat for personal reasons for the third straight game. He missed the game before those with an illness. ... Reserve F Abdel Nader sat out with a left ankle sprain. ... Paul hit a 3-pointer at the first quarter buzzer to put Oklahoma City up 33-30.\n\nSTAT LINES\n\nYoung missed his first six shots before going 7 for 14 the rest of the game. He made 10 of 12 free throws. His 16 assists were one short of his career high set last season.\n\n\"The only shots that I made were the crazy shots, and that's when you know it's just not your night,\" he said. \"I was able to get everybody involved though, which was good, but couldn't get the shots to fall tonight.\"\n\nBALANCED OKC\n\nThe Thunder had six players score in double figures. In addition to Gallinari, Gilgeous-Alexander and Schroder, Paul scored 18 points, Darius Bazley scored 11 and Nerlens Noel added 10.\n\nRESPECT\n\nThe crowd also had warm greetings for Atlanta veteran Vince Carter when he checked into the game for the first time in the third quarter and when he checked out for good in the fourth.\n\nQUOTABLE\n\nYoung, on drawing a foul from Paul on his famous rip move: \"I told him that I got it from him,\" Young said. \"That's something I've watched CP do to everybody in this league, and it's something I've learned from CP. I just remember learning it from him from camps.\"\n\nUP NEXT\n\nHawks: Host Washington on Sunday.\n\nThunder: At Minnesota on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996677.425262
}