{
  "game_id": "0021600308",
  "espn_id": "400899750",
  "date": "Dec 05, 2016",
  "matchup": "CHI vs. POR",
  "headline": "Balanced Blazers beat Bulls 112-110 for 3rd straight win",
  "body": "CHICAGO --  Damian Lillard and the Portland Trail Blazers learned from last month's blowout loss to Chicago.\n\nThey turned that knowledge into their own road win Monday night.\n\nLillard had 30 points and seven assists, CJ McCollum scored 24 and the Trail Blazers beat the Bulls 112-110 for their third consecutive victory.\n\nPortland had won five of six before Chicago visited the Moda Center on Nov. 15 and rolled to a 113-88 win. That loss started the Blazers on a bit of a slide, but they are rounding into form again.\n\n\"I think the game in Portland helped us prepare for what kind of game it was going to be,\" Lillard said. \"We saw how physical they were. They compete on both ends of the floor. ... We just came in with the right mindset, knowing what to expect.\"\n\nAllen Crabbe added 17 points for Portland, which opened a five-game trip with its fourth win in five games. Maurice Harkless had 11 and Evan Turner finished with 10, providing a nice boost in the fourth quarter.\n\n\"I'm really pleased the way we responded after the way they beat us the first time,\" Trail Blazers coach Terry Stotts said.\n\nDwyane Wade scored 34 points for the Bulls, and Jimmy Butler finished with 26 points, seven rebounds and five assists. Robin Lopez had seven points and a season-high 14 rebounds.\n\nChicago played without point guard Rajon Rondo, suspended one game for conduct detrimental to the team. There was no public indication from the Bulls on what triggered Rondo's suspension. He is expected to return Tuesday night in Detroit.\n\n\"He's obviously very important with what we do in this building,\" coach Fred Hoiberg said. \"He's a guy that really gets us out and establishes the tempo for our team, especially in the fourth quarter. He's important for what we do, but that's not the reason we lost the game.\"\n\nPortland trailed 93-92 before Ed Davis converted a driving layup with 8:19 left, sparking an 11-0 run for the Trail Blazers. Turner made three straight jumpers and Lillard connected from long range to make it 103-93 with 5:55 left.\n\nChicago closed to 108-105 on Nikola Mirotic's two foul shots with 1:56 remaining, but Lillard made four free throws in the final seconds to help Portland hold on.\n\n\"We used a lot of energy coming back in the third quarter and then from there we didn't make enough shots,\" Wade said.\n\nMirotic finished with 18 points and seven rebounds for the Bulls, who have dropped three of four. Isaiah Canaan had 10 points.\n\nLillard scored 17 to help Portland to a 65-57 halftime lead. The Trail Blazers shot 55 percent in the first half, but the Bulls turned it up on defense to get back in the game in the third quarter.\n\nMirotic capped an 18-4 run with two foul shots, giving Chicago a 75-70 lead with 5:44 left. The Bulls had an 87-83 advantage before McCollum made a 3-pointer in the final second of the period, trimming the lead to one heading into the final quarter.\n\nAMINU'S RETURN\n\nPortland forward Al-Farouq Aminu had three points in 17 minutes in his return to the lineup after being sidelined by a left calf injury. Aminu started the first eight games of the season before he got hurt Nov. 8 against Phoenix.\n\n\"You could tell he had a little rust, but it was good to see him back on the court,\" Stotts said.\n\nTIP-INS\n\nTrail Blazers: C Mason Plumlee had 10 points, five rebounds, two steals and two blocked shots. ... Portland went 13 for 18 from the free throw line, compared to 33 of 38 for Chicago.\n\nBulls: Wade got his fourth assist in the fourth quarter to reach 5,000 for his career. ... F Doug McDermott practiced with the Windy City Bulls after he was assigned to the D-League for conditioning. McDermott hasn't played since Nov. 11 due to a concussion. \"Hopefully he has another good day tomorrow and we'll see what happens with Thursday,\" Hoiberg said. ... G Michael Carter-Williams, sidelined since Oct. 31 with left wrist and left knee injuries, also could head to the D-League soon. Hoiberg said he thinks Carter-Williams is going to be re-evaluated Tuesday.\n\nUP NEXT\n\nTrail Blazers: Visit the Milwaukee Bucks on Wednesday night. Portland is 1-4 in Milwaukee over the past five seasons.\n\nBulls: Visit Detroit on Tuesday night for their first game of the season against the Pistons. Chicago dropped three of four to Detroit last season.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
  "source": "espn_api",
  "crawled_at": 1764995086.680114
}