{
  "game_id": "0021700024",
  "espn_id": "400974776",
  "date": "Oct 20, 2017",
  "matchup": "DAL vs. SAC",
  "headline": "Hill scores 21, leads Kings past Mavericks 93-88 for 1st win",
  "body": "DALLAS --  Buddy Hield's teammates often make fun of his rebounding tenacity during warmups.\n\nThe second-year guard is always hustling to track down loose balls and working his hardest to make sure he gets as many shots as possible before the game. That's exactly what he did prior to the Sacramento Kings' 93-88 victory over the Dallas Mavericks on Friday night.\n\n\"We always tell Buddy, stop being so hungry for the ball to get some shots up during warmups,\" Kings guard George Hill said. \"Let somebody else get some shots, so I guess today for him chasing down those loose balls in shoot-around and all that stuff in warmup lines paid off.\"\n\nWith 30.1 seconds remaining and the Kings holding a three-point lead, Hield tracked down an offensive rebound to extend a possession. He got the ball back to Hill, who knocked down a jumper with 16.1 seconds left to effectively put the game out of reach and secure the Kings' first win of the season.\n\nHill also hit a big 3-pointer with less than two minutes to go and scored 21 points.\n\nHield and Zach Randolph each had 13 points, and rookie point guard De'Aaron Fox added nine points and 10 assists as the Kings bounced back from a season-opening loss to the Houston Rockets.\n\nHarrison Barnes scored 24 points, 16 in the fourth quarter, as Dallas lost back-to-back games to begin the season.\n\nFox, the fifth overall selection in this year's draft, was expected to go to head-to-head with fellow rookie point guard Dennis Smith Jr. But that matchup was squashed when it was announced an hour before the game that Smith, the No. 9 pick, was a late a scratch with swelling in his left knee.\n\nMavericks coach Rick Carlisle said Smith won't play Saturday against the Rockets, but it wasn't a serious injury.\n\n\"It doesn't make any sense to rush through the weekend,\" Carlisle said. \"Doc checked him out, and we think he's going to be fine.\"\n\nWith Smith's injury and Devin Harris missing the game following the death of his brother, J.J. Barea started at point guard and had nine points and 10 assists for the Mavericks. Yogi Ferrell scored 14 off the bench.\n\nDirk Nowitzki added 10 points, and reserve Dorian Finney-Smith had 14.\n\nDallas pulled within two late in the fourth quarter, but Hill hit a 3-pointer with 1:25 remaining to give the Kings an 88-83 lead. Then Hill hit his late jumper to make it 91-86 after Hield had hustled and snagged that key offensive rebound.\n\nSacramento outrebounded the Mavericks 41-29.\n\nDallas kept it close with a 12-0 run to start the fourth quarter after Sacramento built a 71-60 lead at the end of the third.\n\nTIP-INS\n\nKings: Jenny Boucek was added to the coaching staff as an assistant player development coach. Boucek last served as the head coach for the WNBA's Seattle Storm. ... Hill tied the game at 46 on a 3 with 0.1 seconds remaining in the first half.\n\nMavericks: Carlisle said Harris could take as much time away from the team as he needed after his brother was killed in a car accident Thursday. ... G Gian Cavell was activated Friday with Smith unavailable. Cavell, who is on a two-way contract, had three points.\n\nBEEN AROUND THE BLOCK\n\nWhen Vince Carter and Nowitzki where in the game in the first quarter, it was the first time two players in their 20th NBA seasons went head-to-head in the same game. Before the game, Carter, who had six points off the bench, greeted Nowitzki at center court. Carter and Nowitzki where teammates from 2011-14.\n\nWINNING WAYS\n\nThe Kings have won five of their last six meetings with the Mavericks, and flipped a series that used to be dominated by Dallas. From 2003-16, the Kings lost 22 consecutive games in Dallas and still trail 91-67 in the all-time series.\n\nUP NEXT\n\nKings: Complete a back-to-back on the road against the Denver Nuggets on Saturday.\n\nMavericks: Visit the Houston Rockets on Saturday. Houston is without starting point guard Chris Paul (bruised left knee).\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993981.194814
}