{
  "game_id": "0022000905",
  "espn_id": "401307705",
  "date": "Apr 24, 2021",
  "matchup": "MIL vs. PHI",
  "headline": "Antetokounmpo has big day, Bucks trounce 76ers 132-94",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo moved into second place on Milwaukee’s career scoring list and helped the Bucks deliver the short-handed Philadelphia 76ers their fourth straight loss.\n\n\r\n                    Antetokounmpo had 24 points and the Bucks beat the 76ers for the second time in three days, 132-94 on Saturday. Playing without All-Stars Joel Embiid and Ben Simmons, the 76ers matched their lowest point total and suffered their most-lopsided defeat of the season.\n\n\r\n                    Embiid didn’t play due to a sore right shoulder. Simmons missed a fourth straight game because of an unspecified illness.\n\n\r\n                    \r\n                      Khris Middleton found Antetokounmpo for a dunk early in the third quarter that enabled the reigning two-time MVP to overtake Glenn Robinson and become the Bucks' second-leading career scorer. Antetokounmpo increased his career total to 12,023.\n\n\r\n                    \r\n                      Robinson scored 12,010 points for the Bucks from 1994-2002.  The Bucks’ leading scorer is Kareem Abdul-Jabbar, who had 14,211 points while playing for Milwaukee from 1969-75  and went on to finish his career with an NBA-record 38,387 points.\n\n\r\n                    “It's a great compliment,” Antetokounmpo said. “I've got to keep working hard. It's a marathon. It's not a sprint. So I've got to keep working hard, keep believing in myself, keep polishing my skills, keep having great teammates that I love to be playing (with), a great coaching staff. It's good. It's a lot of hard work that paid off, but I've got to keep moving forward.”\n\n\r\n                    Antetokounmpo also had 14 rebounds and seven assists despite playing just 24 minutes. He sat out the entire fourth quarter with most of the other Bucks starters.\n\n\r\n                    Philadelphia (39-21) dropped a full game behind the Brooklyn Nets (40-20) in the Eastern Conference standings. Milwaukee (37-22) is third in the East, 2 1/2 games behind Brooklyn and 1 1/2 back of Philadelphia. \n\n\r\n                    “I’m not concerned about our overall health,” 76ers coach Doc Rivers said. “I’m just concerned about the amount of games we’re missing.”\n\n\r\n                    Rivers added that “we’ve got to get rhythm with all of our guys playing,” \n\n\r\n                    Bobby Portis added 17 points for the Bucks. Bryn Forbes and Jordan Nwora scored 13 each. Jrue Holiday had 12. Donte DiVincenzo and Pat Connaughton added 11 apiece.\n\n\r\n                    Shake Milton and Tyrese Maxey scored 15 points each to lead the 76ers. Dwight Howard had 12 points and 12 rebounds but also picked up his 15th technical foul. Howard's next technical foul will result in a one-game suspension.\n\n\r\n                    “There's not another player on the floor in my opinion that would have gotten a tech for the same thing Dwight did,” Rivers said. “Not one player would have gotten that tech. But it just happened to be Dwight Howard, and he gets techs.”\n\n\r\n                    Milwaukee took the lead for good less than three minutes into the game. \n\n\r\n                    Philadelphia’s Seth Curry scored seven points during a 10-0 run that cut Milwaukee’s lead to 55-54 in the third quarter. The Bucks wasted no time regaining control, as Antetokounmpo had eight points and two assists during a 15-0 spurt that put Milwaukee ahead 75-57.\n\n\r\n                    The Bucks poured it on from there.\n\n\r\n                    Milwaukee swept the regular-season series with the 76ers, who haven’t been at full strength for any of these matchups.\n\n\r\n                    \r\n                      Milwaukee won 109-105 in overtime  at Philadelphia on March 17 when the 76ers were missing Embiid due to a bruised left knee. The Bucks won 124-117 at Milwaukee on Thursday with Simmons out.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Reserves Furkan Korkmaz (right ankle sprain) and Paul Reed (health and safety protocols) also were unavailable Saturday. ... Rivers, a former Marquette star, said he had dinner with new Marquette coach Shaka Smart on Friday. Marquette and the Bucks both play their home games at Milwaukee's Fiserv Forum. During his introductory press conference at Marquette, Smart called Rivers one of his mentors. \n\n\r\n                    Bucks: Milwaukee got 76 points from its reserves. That represents the Bucks' highest single-game bench scoring total since Dec. 15, 1989, when reserves scored 79 points against Sacramento. ... Milwaukee breezed without getting much from Middleton, who scored just four points in 20 minutes. He shot 0 for 6 from the floor.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Host Oklahoma City on Monday as they try to avoid their first five-game skid since December 2017. The 76ers won 117-93 at Oklahoma City on April 10.\n\n\r\n                    Bucks: Visit Atlanta on Sunday as they begin a four-game trip. \n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997377.535817
}