{
  "game_id": "401809235",
  "espn_id": "401809235",
  "date": "Oct 22, 2025",
  "matchup": "DAL vs SA",
  "headline": "Wembanyama scores 40 as Spurs spoil Flagg debut with 125-92 rout of Mavericks",
  "body": "DALLAS -- — Victor Wembanyama had 40 points and 15 rebounds in a highlight-reel return, helping the San Antonio Spurs spoil No. 1 overall pick Cooper Flagg's debut in a 125-92 rout of the Dallas Mavericks on Wednesday night.\n\n\r\n              Flagg, the second-youngest player to start in his NBA debut by two days behind LeBron James, didn't score until the first possession of the second half, finishing with 10 points and 10 rebounds.\n\n\r\n              The 18-year-old from Duke had more trouble getting into the flow than the second overall choice. Dylan Harper came off the San Antonio bench midway through the first quarter, started the run that put the Spurs in control and scored 15 points. Reigning Rookie of the Year Stephon Castle scored 22 points for the Spurs.\n\n\r\n              Anthony Davis had 22 points and 13 rebounds as the Mavericks await the return of star guard Kyrie Irving, who is likely months away from his season debut while recovering from ACL surgery.\n\n\r\n              Wembanyama, who set a Spurs record for most points in a season opener, dominated the matchup of two of the three most recent top draft picks, with the 2023 No. 1 choice adding three blocks to several spectacular dunks and a couple of buckets with fouls that sent Davis and Dereck Lively II to the bench.\n\n\r\n              The 7-foot-4 sensation was playing in the regular season for the first time since deep vein thrombosis, a blood clot condition in the shoulder, required surgery and ended his second season in February.\n\n\r\n              Wembanyama keyed a 13-0 run late in the first half that put the Spurs in control. After Harper scored, the 2024 Rookie of the Year pump faked out of a double team and was fouled by Davis on the way to a reverse dunk. The next time down, he hit a jumper as Davis picked up his fourth foul.\n\n\r\n              Up next\r\n              Spurs: At New Orleans on Friday night.\n\n\r\n              Mavericks: Washington on Friday as part of a five-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042482.9390101
}