{
  "game_id": "0022200127",
  "espn_id": "401468282",
  "date": "Nov 04, 2022",
  "matchup": "TOR @ DAL",
  "headline": "Doncic's 30-point streak hits 8 games as Mavs beat Raptors",
  "body": "DALLAS -- — Luka Doncic scored 35 points, his eighth consecutive game of at least 30 to begin the season, as the Dallas Mavericks beat the Toronto Raptors 111-110 on Friday night.\n\n\r\n              The only other NBA player to score 30 or more points in the first eight games of a season was Wilt Chamberlain, who did it in the first eight of the 1959-60 season and the first 23 of 1962-63.\n\n\r\n              Doncic played 37 minutes and passed the 30-point mark with 18.7 seconds left in the third quarter on a turnaround fadeaway jumper. It was a balanced night for the 23-year-old superstar: 10 for 15 from the floor, 3 for 6 from downtown, 12 for 14 at the free throw line, eight rebounds and six assists.\n\n\r\n              That included one assist on a spin move through a double team, one basket following a flurry of dribbles between his legs, a hook shot to cap the 16-2 run beginning the second half and the floater late in the third period.\n\n\r\n              “He did everything tonight,” Mavericks coach Jason Kidd said. “Did he go through his legs like eight times? When he shot that little floater, I just kind of chuckled because only he can do that.\n\n\r\n              “He surprises a lot of people. I wonder if he surprises himself sometimes.”\n\n\r\n              Does he?\n\n\r\n              “Yeah, sometimes,” Doncic said with a smile. “The best play was my hook shot. Those plays are fun. Later you see them on TV. Everybody talks about them.\" \n\n\r\n              Doncic leads the NBA averaging 36.0 points per game with 8.6 assists in 36.6 minutes.\n\n\r\n              The Raptors cut a 19-point third-quarter deficit to 108-105 with 35.5 seconds left. Doncic sank the first of two free throws with 15.9 seconds to gain a four-point lead. O.G. Anunoby drove for a dunk with 11 seconds left. Spencer Dinwiddie hit two free throws with 3 seconds to go, making the score 111-107. Anunoby hit a 3-pointer at the buzzer.\n\n\r\n              Dinwiddie had 21 points and seven assists for the Mavericks, who have won three straight games after splitting their first six.\n\n\r\n              Anunoby scored 27 points, Pascal Siakam 18 and Chris Boucher 17 off the bench for the Raptors. Siakam left the game in the third quarter with what coach Nick Nurse said is probably a groin injury.\n\n\r\n              DINWIDDIE CALLS OUT OFFICIAL\n\n\r\n              Dinwiddie, called for a technical foul in the final minute of the second period, said he was told by a teammate that the official, Tony Brothers, described him with multiple curse words.\n\n\r\n              “NBA, I would definitely like my money back,” Dinwiddie said. “If there’s anybody that feels that way about me … they can address me personally, face to face.”\n\n\r\n              “I have to talk to Spencer,” Kidd said. “When you look at Tony, what he’s done in this league as a referee, he’s well liked and also one of the best that we have. That’s a sensitive topic.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: They made 10 steals, nearly equaling their league-leading 10.8 per game, but only outscored the Mavericks 27-26 in points off turnovers. … G Fred VanVleet, fourth in the NBA in steals, missed his third-consecutive game with lower back stiffness. Nurse said he thought VanVleet would play after going through a full practice on Thursday. “I’m expecting him pretty soon to be back,” Nurse said.\n\n\r\n              Mavericks: C Dwight Powell, a Toronto native, made his second start of the season, replacing JaVale McGee in the starting lineup. Powell had nine points and two rebounds in 26 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Begin a home-and-home with Chicago at home on Sunday.\n\n\r\n              Mavericks: Host Brooklyn on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994102.628705
}