{
  "game_id": "0021801004",
  "espn_id": "401071677",
  "date": "Mar 11, 2019",
  "matchup": "CHA @ HOU",
  "headline": "Houston extends streak to 9 games with win over Hornets",
  "body": "HOUSTON --  James Harden was forced to carry an almost-impossible load on offense for big stretches of this season while many of the Houston Rockets were out with injuries.\n\nNow that the Rockets are at full strength, Harden is enjoying seeing his teammates shine on offense and help Houston make a late push for the top spot in the Western Conference.\n\nHarden scored 28 points and Eric Gordon added 22 as the Rockets cruised to their season-high ninth straight win, 118-106 over the Charlotte Hornets on Monday night.\n\n\"It was a total team effort,\" Harden said.\n\nThe Rockets, whose 11-14 start had them in the basement of the conference standings, now sit in third place, just 3  1/2 games behind the Warriors, who they meet next.\n\nA night after Gordon ended a streak of 43 straight games where Harden led the team in scoring, the Beard was Houston's top scorer again. But Gordon had another strong outing, making five 3-pointers for the third straight game and the fourth in five games.\n\nHarden, who leads the NBA with 36.2 points a game, was asked if it's a relief to not have to carry the offense every night now that stars such as Clint Capela and Chris Paul have returned from extended absences.\n\n\"Yeah,\" he said. \"I just take what the defense gives me. Making shots or missing shots, I'll take the same shots every single game ... and I got off the ball and multiple guys got open shots. I don't really try to press anything. I just try to take what they give me and be effective.\"\n\nThe Rockets won despite a big performance by Kemba Walker, who finished with 40 points, 10 rebounds and seven assists as the Hornets lost their second in a row.\n\n\"For him to come in here and compete at this stage without a lot of his guys out there on the floor says a lot about his character and who he is as a person and as a leader,\" Charlotte coach James Borrego said.\n\nHouston led by as many as 28 in the third quarter but a big run by the Hornets cut the lead to 13 to start the fourth.\n\nCoach Mike D'Antoni was a bit disappointed that his team let Charlotte get back in it after building such a huge lead.\n\n\"Maybe it's a new reality and maybe players need to get used to that -- that you can't take your foot off the pedal,\" D'Antoni said.\n\nA three-point play by Walker cut the lead to 10 with about 3 1/2 minutes left. But a 7-2 spurt by Houston, highlighted by a dunk from Kenneth Faried, made it 116-101 with about 90 seconds left and Houston's starters went to the bench.\n\nWalker was encouraged that the Hornets kept fighting despite the early hole.\n\n\"I'm not a big fan of moral victories, but hopefully we can build off this, especially as far as our energy and our passion,\" he said.\n\nHouston got 19 points and 15 rebounds from Capela. Paul had 10 points and 10 rebounds, and Harden had 10 assists and six rebounds.\n\nA night after squeaking past the Mavericks 94-93, the Rockets led this one for all but the first few minutes. The Hornets scored the first five points with a hook shot from Willy Hernangomez and a 3 from Jeremy Lamb before the Rockets scored the next eight points to take a lead they would not relinquish.\n\nHouston led by 19 after one and was up 71-44 at halftime.\n\nTIP-INS\n\nHornets: Michael Kidd-Gilchrist missed his second straight game with a strained left knee. ... Lamb received a technical foul in the first quarter. ... Frank Kaminsky had 15 points off the bench.\n\nRockets: Faried had 16 points and nine rebounds in his return after sitting out five games with a hip injury. He has scored at least 10 points in 16 of his 17 games with Houston. ... It was Houston's 11th game this season with at least 70 points in the first half.\n\nDEFENSIVE IMPROVEMENT\n\nThe Rockets have held their opponents to 97.8 points in the last five games after allowing each of their previous six opponents to score 110 points or more. Charlotte shot just 42.7 percent on Monday for Houston's fourth straight game where it held a team to less than 45 percent shooting.\n\nUP NEXT\n\nHornets: Play the third of four straight road games when they visit Washington on Friday night.\n\nRockets: Host Golden State on Wednesday night with a chance to sweep the season series for the first time since 2009-10.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994351.653155
}