{
  "game_id": "0022300716",
  "espn_id": "401585344",
  "date": "Feb 05, 2024",
  "matchup": "ATL vs. LAC",
  "headline": "Kawhi Leonard scores 36 to help Clippers top Hawks 149-144, finish road trip 6-1",
  "body": "ATLANTA -- — Kawhi Leonard scored 36 points, including 11 in the fourth quarter, and the Los Angeles Clippers finished off a long road trip in style with a 149-144 win over the Atlanta Hawks on Monday night.\n\n\r\n              James Harden had 30 points and 10 assists, and Paul George scored 18 for Los Angeles.\n\n\r\n              Trae Young, the Eastern Conference player of the week, had 25 points and De'Andre Hunter matched a season high with 27 off the bench for the Hawks, who had won four in a row.\n\n\r\n              The Clippers went 6-1 on a 13-day road trip and improved to 26-5 since Nov. 30. They won at Miami on Sunday, the front end of this back-to-back.\n\n\r\n              “To go 6-1 against the caliber of teams we played on this trip, coming into it, we knew tonight was going to be tough,” coach Tyronn Lue said. “Got down early in the second half, continued to keep fighting. It was a total team effort.”\n\n\r\n              Los Angeles shot 60% from 3-point range, while the Hawks finished at 51.3%. The 149 points were the Clippers' second-most of the season. They only turned the ball over seven times.\n\n\r\n              “Taking care of the basketball has always been a big key for us,” Lue said. “We are too good offensively to turn it over. If we get shots up, we’re going to be pretty good.”\n\n\r\n              Leonard, the Western Conference player of the week, keyed an 8-2 burst with under 2:30 to play, hitting a 3-pointer, converting a three-point play and assisting on a layup. The run gave the Clippers a 139-130 lead. \n\n\r\n              After three free throws by Young, Harden banked in a 3 while being fouled and stretched the lead to 142-133 with 1:06 left.\n\n\r\n              Lue was disappointed the Clippers permitted 43 points in the fourth quarter.\n\n\r\n              “We've got to get back home and be better (on defense),” he said. “I don’t know if it was fatigue. Guys have played a lot of games, a lot of minutes. I’ll give them a little bit of a break with that, but we have to be better. We had some slippage, so we have to get home and clean this stuff up.”\n\n\r\n              A back-and-forth third quarter ended with a buzzer-beating 3 by Daniel Theis that gave the Clippers a 102-101 edge entering the fourth. \n\n\r\n              Young tied the score at 66 with a driving hoop in the final second of the second period.\n\n\r\n              Hawks center Clint Capela, who has started 47 games, sat out with a left adductor strain and will be re-evaluated in seven to 10 days.\n\n\r\n              Clippers starting center Ivica Zubac also missed the game after being listed as questionable. Zubac has a right calf strain.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host the New Orleans Pelicans on Wednesday.\n\n\r\n              Hawks: At the Boston Celtics on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996285.364002
}