{
  "game_id": "0021500419",
  "espn_id": "400828306",
  "date": "Dec 22, 2015",
  "matchup": "MEM @ PHI",
  "headline": "Gasol scores 19 as Grizzlies beat 76ers 104-90",
  "body": "PHILADELPHIA --  A small lineup has helped the Memphis Grizzlies come up big on defense.\n\nMarc Gasol scored 19 points, Mike Conley had 18 points and six assists, and the Grizzlies held another opponent under 100 points, beating the Philadelphia 76ers 104-90 on Tuesday night.\n\nThe Grizzlies had five players score in double figures. Courtney Lee had 15 points, reserve Zach Randolph added 14 points and eight rebounds, and Matt Barnes finished with 12 points and 10 boards.\n\nMemphis forced 28 Philadelphia turnovers, scoring 36 points off the miscues. The Grizzlies, who switched to a small lineup six games ago, have held five straight opponents under 100 points after accomplishing it just 11 times in the previous 25 games.\n\n\"I thought the level of defensive pressure that we had, our activity was phenomenal, on the ball, weak side,\" Conley said. \"Guys were communicating, trusting each other.\"\n\nJahlil Okafor scored 18 points and Hollis Thompson contributed 16 for Philadelphia, which dropped to 1-29 while losing its 11th straight game. Now the 76ers head out for a six-game trip, and they have lost 22 in a row on the road.\n\nThere wasn't much booing among the home crowd, which is resigned to Philadelphia's losing ways these days, but one fan seated behind the Grizzlies bench wore a paper bag over his head with a sad face.\n\nThe 76ers harped on their offensive miscues in a somber locker room.\n\n\"It's hard to win when you turn the ball over that much,\" Okafor said.\n\nPhiladelphia didn't help itself by shooting 65.6 percent (21 for 32) from the free-throw line.\n\nMemphis blew the game open by scoring eight straight points to begin the fourth quarter. Vince Carter drained a pair of 3-pointers and Randolph had a follow layup to put the Grizzlies in front 85-66 with 10:54 left.\n\nThe Grizzlies' advantage grew to as many as 20 points, and Philadelphia never got closer than 12 the rest of the way.\n\n\"I thought when we didn't settle, we were effective,\" Memphis coach David Joerger said. \"When we didn't turn it over, we were effective.\"\n\nPhiladelphia trailed 53-47 at the break. But Memphis slowly increased its lead to double digits, eventually taking its largest advantage to that point on Barnes' layup that made it 71-56 with 5:16 left in the third quarter.\n\nIt was plenty cushion for Memphis' defense.\n\n\"Defensively we've been obviously more confident and we have more trust,\" Gasol said. \"I thought everybody had pressure (on) their man, and when they were driving we were helping. The weak side was in, and once we got the ball swung, everybody closed out and trusted the guy behind you.\"\n\nSTOP AND SHOP\n\nPhiladelphia coach Brett Brown said there wasn't much else to say about the game, other than his team's turnovers.\n\n\"We can write 28 turnovers for 36 points -- it can be a headline (or) it can be a single sentence -- and we can all go and finish our Christmas shopping,\" he said.\n\nBIG PLAY\n\nOkafor's driving, spinning layup with 2:42 left in the third cut the Grizzlies' lead to 73-64. But Memphis ended the quarter up 77-66 when Conley stripped T.J. McConnell and passed ahead to Lee for an uncontested layup just before the buzzer.\n\n\"It's huge because little plays like that are what can make or break a game, can change the momentum of games, can give guys confidence,\" Conley said. \"It was a big moment for us because Philly doesn't quit.\"\n\nTIP-INS\n\nGrizzlies: Tony Allen returned after sitting out the previous five games due to a knee injury. Allen had one point in 16 minutes. ... Memphis has won six straight in Philadelphia dating to Feb. 11, 2009.\n\n76ers: Kendall Marshall (knee) didn't dress but is expected to play Wednesday at the Bucks with a restriction of 25 minutes. ... Joel Embiid, Philadelphia's 2014 first-round pick who is recovering from his second foot surgery over the summer, worked on shooting before the game.\n\nUP NEXT\n\nGrizzlies: At Washington on Wednesday night.\n\n76ers: At Milwaukee on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994455.75442
}