{
  "game_id": "0021800471",
  "espn_id": "401071152",
  "date": "Dec 21, 2018",
  "matchup": "BKN vs. IND",
  "headline": "Oladipo helps Pacers end Nets' 7-game win streak, 114-106",
  "body": "NEW YORK --  After winning seven straight, Indiana head coach Nate McMillan noticed his team was developing some bad tendencies in their late-game execution.\n\nThe Pacers gave up a buzzer-beating tip-in basket in Tuesday night's one-point loss to Cleveland. The following night, they squandered a 17-point lead in a tough loss at Toronto.\n\nStar guard Victor Oladipo then changed things around in a six-minute span in Brooklyn on Friday night.\n\nOladipo scored 14 of his 26 points in the fourth quarter, Thaddeus Young added 21, and the Pacers won 114-106, ending the Nets' seven-game winning streak.\n\n\"In the NBA you have to (put it behind) if you want to be good because stuff like this happens, unfortunately,\" said Oladipo, who added nine rebounds and six assists.\n\nOladipo was tough on himself after a couple of personal mistakes doomed his team. He missed a pair of free throws with 10 seconds left against the Cavaliers and then turned the ball over twice in the last minute against the Raptors.\n\nThose games are in the past now.\n\n\"You might lose one game, you might lose two, three, but how you respond to the next game (is what matters),\" he said. \"It's a new game, it's a new day. All you got to do is just learn from the last games apply to the current game. It's easier than done, but the good teams can do it.\"\n\nBojan Bogdanovic and Domantas Sabonis each added 17 points for the Pacers.\n\nIndiana has played 77 straight games without losing three in a row.\n\n\"You try to figure it out after two losses,\" McMillan said. \"I thought tonight we did that.\"\n\nRookie Rodions Kurucs, a 2018 second-round draft pick, continued his stellar improvement with a season-high 26 points for Brooklyn, and DeMarre Carroll added 16.\n\nThe Nets struggled in the first half, giving up 37 points in the first quarter, before turning things around late in the second half.\n\n\"We could really never stop them,\" Nets coach Kenny Atkinson said. \"We didn't stop them all night.\"\n\nKurucs hit a free throw with 4:07 left in the game that gave Brooklyn a 100-98 lead before Oladipo accounted for all of Indiana's scoring in an 8-4 run that put the Pacers ahead 106-104. Oladipo punctuated the spurt with an impressive left-handed dunk over Kurucs with 2:01 left.\n\nBogdanovic then hit a 3-pointer that extended the lead to 109-104.\n\nOn the next Brooklyn possession, Nets guard Spencer Dinwiddie was blocked by on a driving layup attempt by Pacers center Myles Turner, and Darren Collinson was then fouled by Kurucs.\n\nNets head coach Kenny Atkinson came running off the bench to argue the call and was immediately ejected with 1:09 left by referee Tony Brothers.\n\nBogdanovic hit the technical free throw to widen the lead to six points.\n\nCollinson hit one of his two free throws to make it 111-104.\n\nKurucs then answered with a pair of free throws to draw the Nets with five before Oladipo's final basket, a 3-pointer, closed it out for Indiana.\n\nTIP INS\n\nPacers: Turner had 15 points and 12 rebounds.\n\nNets: G Joe Harris has hit at least a 3-pointer in 30 consecutive games, a game short of tying Joe Johnson's franchise record of 31 straight set during the 2012-13 season.\n\nFIRST TIME FOR EVERYTHING\n\nKurucs led the Nets in scoring for the first time in his career, shooting 6 for 11 from the field over 34 minutes. He had 15 of his 26 points in the second half, providing a spark for a Nets offense that trailed by 10 points at halftime.\n\n\"It's hard to take him out of the game,\" Atkinson said. \"It wasn't the plan to play him 34 minutes, and he's earning his minutes. He's earning his play, and it's a pleasant, pleasant surprise for a 20-year-old kid.\"\n\nUP NEXT\n\nPacers: Host Washington on Sunday night.\n\nNets: Host Phoenix on Sunday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995418.497251
}