{
  "game_id": "0022400985",
  "espn_id": "401705551",
  "date": "Mar 17, 2025",
  "matchup": "HOU vs. PHI",
  "headline": "Green, Smith each score 30, Rockets extend win streak to 7 games with 144-137 OT victory over 76ers",
  "body": "HOUSTON -- — Jalen Green and Jabari Smith Jr. had 30 points apiece and the Houston Rockets rallied for a 144-137 overtime victory over the Philadelphia 76ers on Monday night, extending their season-best winning streak to seven games.\n\n\r\n              The Rockets trailed by as many as 25 points and never led in regulation before their late rally.\n\n\r\n              Houston was up by six points after opening overtime with a 9-3 run. Quentin Grimes made a 3-pointer to cut the lead to 140-137 with less than 2½ minutes left in OT.\n\n\r\n              But Alperen Sengun made two free throws with just over a minute left before Aaron Holiday added two more with 12.1 seconds remaining, making it 144-137 and securing the win. \n\n\r\n              The Rockets trailed by eight with less than a minute to go in the fourth before using a 10-2 run to tie it at 131, forcing overtime.\n\n\r\n              Smith made one free throw before missing the second, and Sengun grabbed the rebound and made the put-back to tie it with 3.1 seconds left in the fourth. Philadelphia had a chance to win it in regulation, but Jalen Hood-Schifino’s jumper missed.\n\n\r\n              Grimes had career highs of 46 points and 13 rebounds with a career-best eight 3-pointers for the Sixers. His performance helped Philadelphia tie a franchise record with 24 3s.\n\n\r\n              Takeaways \r\n              76ers: These young players, who are filling in for a roster decimated by injuries, continue to play hard, and Grimes has been almost unstoppable lately. The former University of Houston star has scored at least 40 points twice this month and over 30 four times.\n\n\r\n              Rockets: Houston needs to play more consistently after falling into a huge hole early.\n\n\r\n              Key moment\r\n              Sengun’s putback with 3.1 seconds left in the fourth that sent it to overtime.\n\n\r\n              Key stat\r\n              The teams combined for 46 3-pointers, with Houston making a season-high 22.\n\n\r\n              Up next\r\n              Houston visits Orlando on Wednesday, and Philadelphia visits Oklahoma City that night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997354.4153862
}