{
  "game_id": "0022400092",
  "espn_id": "401704658",
  "date": "Oct 26, 2024",
  "matchup": "ORL @ MEM",
  "headline": "Aldama scores 22, Huff has career-high 18 as Grizzlies beat Magic 124-111 in home opener",
  "body": "MEMPHIS, Tenn. -- — Santi Aldama scored 22 points, reserve center Jay Huff added a career-high 18 and the Memphis Grizzlies built a 26-point halftime team in a 124-111 victory over the Orlando Magic on Saturday night in their home opener.\n\n\r\n              Ja Morant added 16 points and 10 assists in his first regular-season home appearance since Jan. 3. Aldama was 9 of 12 from the field, while Huff made seven of his nine shots.\n\n\r\n              Franz Wagner scored 23 points for the Magic and Jalen Suggs added 21, both players grabbing seven rebounds apiece. Paolo Banchero finished with 16 points, but was 4 of 12 from the field, part of the Magic shooting 43% for the game.\n\n\r\n              Memphis held a comfortable lead through much of the game despite withstanding 21 straight points by Orlando in the third quarter.\n\n\r\n              Takeaways \r\n              Magic: Orlando had held opponents to an average of 99 points for the first two games, but turnovers and a solid shooting night from Memphis meant a different result.\n\n\r\n              Grizzlies: Memphis continued to struggle in the third quarter. What looked like a comfortable lead turned into a much closer game with the Grizzlies allowing Orlando to capture the third 35-21, including 21 straight points. The Memphis lead was big enough to withstand the Magic rally.\n\n\r\n              Key moment: \r\n              \r\n              Memphis rattled off 12 straight points for a 69-43 lead at the break fueled by 14 first-half turnovers by Orlando, leading to 21 Memphis points.\n\n\r\n              Key stat: \r\n              \r\n              \r\n              Orlando had 19 turnovers in the game, leading to 30 Memphis points.\n\n\r\n              Up next\r\n              Orlando entertains Indiana on Monday before a five-game road trip. Memphis hosts Brooklyn on Monday night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997584.8221161
}