{
  "game_id": "0022000784",
  "espn_id": "401307577",
  "date": "Apr 08, 2021",
  "matchup": "MIA vs. LAL",
  "headline": "Butler scores 28, Heat beat depleted Lakers 110-104",
  "body": "MIAMI -- — Jimmy Butler scored 28 points to lead the Miami Heat past the depleted Los Angeles Lakers 110-104 on Thursday night.\n\n\r\n                    Victor Oladipo added 18 points but limped off the court, favoring his right knee, after a dunk late in the fourth quarter. Coach Erik Spoelstra said Oladipo, acquired in a trade with Houston on March 25, will be evaluated Friday.\n\n\r\n                    “He gives us another element of attacking,” Spoelstra said.\n\n\r\n                    Tyler Herro finished with 15 points for the Heat, who bounced back from Tuesday’s 12-point home loss against Memphis.\n\n\r\n                    “We always take the Ws in this league. They’re hard to come by,” Butler said. “We can be better but you’ve got to take them when you can get them.”\n\n\r\n                    Miami went on a 9-2 run late in the fourth period and took a 104-94 lead with 2:14 remaining on Butler’s two technical free throws following Markieff Morris’ ejection for arguing with the officials.\n\n\r\n                    The Lakers cut it to 106-100 on Kentavious Caldwell-Pope’s 3-pointer with 29 seconds remaining. Butler’s four throws on Miami’s next two possessions secured the win.\n\n\r\n                    “We’ve been up and down all year long, hopefully we hit a stride that we’re playing the right way and string together wins,” Butler said.\n\n\r\n                    Kentavious Caldwell-Pope scored 28 points, including 6 of 11 3-pointers.\n\n\r\n                    “Very proud of the effort, the fight and the belief we had in one and another that we could beat this team,” Los Angeles coach Frank Vogel said. “Our guys competed their tails off.”\n\n\r\n                    Recently acquired Andre Drummond returned from a four-game absence and had 15 points and 12 rebounds for the Lakers. Drummond hurt his right big toe in his Los Angeles debut on March 31.\n\n\r\n                    “It felt good, a little sore but it’s not going to hold me back,” Drummond said.\n\n\r\n                    The Lakers continued without injured LeBron James and Anthony Davis. James missed his 10th consecutive game because of a sprained ankle and Davis has sat out the last 24 contests with a calf strain. Forward Kyle Kuzma also was sidelined Thursday with a calf strain.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Guard Talen Horton-Tucker served his one-game suspension, handed down by the NBA earlier Thursday for his role in an altercation against Toronto in Tampa, Florida, on Tuesday. ... The Lakers managed to get three nights in Miami on this trip. They arrived late Tuesday night and stayed Wednesday and Thursday. They were scheduled to fly to Newark, New Jersey, on Friday afternoon for games against Brooklyn and New York.\n\n\r\n                    Heat: Miami began shooting penalty free throws just 4:31 into the first period. By the time the Lakers attempted their first free throw with 54 seconds remaining in the quarter, Miami had converted 15 of 16 from the line. ... Rookie Precious Achiuwa played significant minutes in the third quarter and early in the fourth. Achiuwa had seven points, four rebounds, one block and one steal during the stretch. “I thought he gave us a real presence at the rim. He gave us a spark,” Spoelstra said.\n\n\r\n                    DEDMON SIGNS\n\n\r\n                    Miami completed the signing of center Dewayne Dedmon, whose most recent NBA appearance was in March 2020 with Atlanta. Dedmon had been undergoing COVID-19 testing and is now eligible to play. He’s signed for the rest of the season, and Miami still has some cap room left for another signing before the playoffs.\n\n\r\n                    PLAY SOME, SIT SOME\n\n\r\n                    Since he left the Heat following the 2014-15 season, James has returned to Miami 10 times with the Lakers and Cleveland Cavaliers. James sat out four of the games and has averaged 29 points in the six he’s played in his former home arena.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: At Brooklyn on Saturday.\n\n\r\n                    Heat: At Portland on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996768.934824
}