{
  "game_id": "0022300136",
  "espn_id": "401584764",
  "date": "Nov 04, 2023",
  "matchup": "BKN vs. BOS",
  "headline": "Celtics outlast Nets 124-114 behind Tatum and Holiday's double-doubles",
  "body": "NEW YORK -- — Jayson Tatum scored 32 points and grabbed 11 rebounds to lead the Boston Celtics to a 124-112 win over the Brooklyn Nets on Saturday night.\n\n\r\n              Tatum scored his 10,000th career point in the second quarter. The 25-year-old Tatum is the youngest player in franchise history to reach the milestone. The previous record holder was Antoine Walker, who was 26.\n\n\r\n              Tatum was one of five players to finish in double figure scoring for Boston, which improved to 5-0 this season.\n\n\r\n              Jaylen Brown had 23 points for the Celtics, and Kristaps Porzingis added 22. Jrue Holiday recorded a double-double with 18 points and 10 assists. Luke Kornet scored 11 off the bench.\n\n\r\n              “We have depth and we're extremely talented from top-to-bottom,” Tatum said. “What's special about this group is we've got some really good guys and we got some guys (who) really just compete. Guys (who) want to win.” \n\n\r\n              Playing its second game in as many days, Brooklyn dropped to 3-3.\n\n\r\n              Cam Thomas led the Nets with 27. Spencer Dinwiddie and Mikal Bridges each chipped in with 19. Dorian Finney-Smith contributed 14, and Lonnie Walker IV and Day’Ron Sharpe scored 13 and 11, respectively, off the bench.\n\n\r\n              Boston led 70-58 at halftime, but was outscored 30-21 in the third quarter and went into the fourth with a slim, three-point advantage.\n\n\r\n              “We (have) to win these games,” Porzingis said. ”We were not having our best nights and we did that.\" \n\n\r\n              Brooklyn cut the deficit to one, 96-95, on Dennis Smith Jr.’s 3 with 7:47 left, but the Celtics immediately responded with a 14-4 spurt over a two minute span. \n\n\r\n              Tatum scored nine of Boston’s points in the stretch.\n\n\r\n              “Our guys continued to play hard,” Boston coach Joe Mazzulla said.\n\n\r\n              Brooklyn closed to 110-102 on Bridges’ 3, but an Al Horford bucket and a Porzingis free throw extended the lead to 113-102.\n\n\r\n              “Credit to our guys for continuing to chip away, chip away,” Mazzulla said.\n\n\r\n              Horford’s spectacular jam with 1:28 left essentially put the game out of reach.\n\n\r\n              The Nets were shorthanded as starting center Nic Claxton (sprained right ankle) and starting power forward Cameron Johnson (strained left calf missed) each missed their fifth straight game, and starting point guard Ben Simmons sat out with back injury maintenance. \n\n\r\n              \"Just assessing where we are this time of the season,” Nets coach Jacques Vaughn said before the game, when asked about Simmons. “With the back-to-back — not saying that this will continue — but the maintenance is part of his progression right now for this part of the season.”\n\n\r\n              Without three-fifths of his regular starting lineup, Vaughn started Dinwiddie, Thomas, Bridges, Royce O’Neale and Finney-Smith. According to the Nets, it was Brooklyn’s fourth different starting lineup in six games this season. \n\n\r\n              Boston guard Derrick White missed the game due to personal reasons. \n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visits Minnesota on Monday night.\n\n\r\n              Nets: Host Milwaukee on Monday night \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996612.742903
}