{
  "game_id": "0021500136",
  "espn_id": "400828023",
  "date": "Nov 13, 2015",
  "matchup": "HOU @ DEN",
  "headline": "Gallinari's scores 27 points, Nuggets top Rockets 107-98",
  "body": "DENVER -- Ty Lawson hoped for a triumphant return to Denver. Danilo Gallinari and Will Barton made sure it wasn't a pleasant homecoming.\nGallinari had 27 points, Barton scored a career-high 26 points and the Denver Nuggets beat the Houston Rockets 107-98 on Friday night to spoil Lawson's return.\nKenneth Faried added 14 points and 11 rebounds for Denver.\nThe Nuggets have won the first two games of the season series with the Rockets. They won the season opener 105-85 in Houston on Oct. 28.\nDenver has won three straight at home after dropping its first two at the Pepsi Center.\n\"It was big to get three in a row,\" Gallinari said. \"We were looking at this week saying we needed to get these three at home and we did.\"\n\nThe home crowd didn't give Lawson a warm reception despite his mostly productive six years with the Nuggets. Lawson helped Denver reach the playoffs four straight seasons and win a franchise-best 57 games in 2012-13 before a disappointing first-round exit against Golden State. Trouble off the court, including multiple arrests, soured his reputation with the fans and preceded him being dealt to Houston in the summer.\nHe had seven assists but was held scoreless on 0-for-7 shooting.\n\"I just couldn't get a rhythm today,\" Lawson said. \"The second half I got the shot I wanted it just didn't come off right. Still trying to get a feel for it.\"\nJames Harden led the Rockets with 28 points. Terrence Jones added 23 off the bench and Dwight Howard had 12 points and 10 rebounds.\nThe Rockets have lost two straight.\n\"Just small things we can correct. They are major problems, but not major things that are out of our hands,\" Harden said.\nLawson was hoping for a happy return, but the Nuggets did enough to hold off the Rockets. Barton hit two 3-pointers after Houston had made it 87-86 on Harden's three-point play.\nBarton was 4-of-5 from long range and had a highlight-reel alley-oop dunk on a pass from Randy Foye in the third quarter.\n\"Just got into a rhythm and playing off my teammates,\" Barton said. \"Good drives by Randy, Jameer [Nelson] and Emmanuel [Mudiay), and being my active, usual self. Getting up and down the floor, created problems in transition and my shot was falling, especially from 3.\"\nJason Terry answered Barton's baskets with a 3-pointer, but Nelson's jumper gave the Nuggets a 95-89 lead with 6:22 left. Gallinari's 3-pointer with 2:12 left made it 104-91.\n\"He hit a big 3-pointer in front of their bench,\" Nuggets coach Michael Malone said. \"He had 27 points, 7 of 9 from the field 10 of 10 from the free-throw line.\"\nFREE THROW WOES\nThe Rockets shot 25 free throws in the first half but just six in the second. They had one attempt in the fourth quarter.\nHE SAID IT\n\"We didn't play very well,\" Rockets coach Kevin McHale said. \"We had effort issues. We had some times when they outran us. At times they outhustled us on the boards. There were times that we missed easy shots and hung our heads. We just aren't playing very well right now.\"\nTIP-INS\nRockets: F Donatas Motiejunas is still out with a lower-back injury. He has yet to play this season. ... Rookie F Montrezl Harrell started his first career game.\nNuggets: Nelson was back after missing two games with a lower back injury. ... C Joffrey Lauvergne remains sidelined with a lower-back injury that has kept him out the last six games. ... Denver Broncos players Von Miller, DeMarcus Ware and Brandon Marshall were in the crowd.\nMOMENT OF SILENCE\nThere was a moment of silence before the game for the victims in the attacks in Paris.\nUP NEXT\nRockets: Hosts Dallas on Saturday night.\nNuggets: At Phoenix on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994669.9873621
}