{
  "game_id": "0021500303",
  "espn_id": "400828190",
  "date": "Dec 06, 2015",
  "matchup": "OKC vs. SAC",
  "headline": "Russell Westbrook posts third triple-double of season in win over Kings",
  "body": "OKLAHOMA CITY -- Even when he's having a frustrating game, Kevin Durant is Oklahoma City's go-to player in tight situations. He came through Sunday night against the Sacramento Kings.\nDurant committed 10 turnovers but hit the go-ahead jumper with 23 seconds left and then two free throws with 4.4 seconds left to cap a 20-point, nine-rebound outing for the Thunder in a 98-95 win over the Kings. Russell Westbrook recorded his third triple-double of the season, with 19 points, 10 assists and 11 rebounds, and the Thunder won their fourth straight home game. Since the franchise moved to Oklahoma City, it is 14-0 against Sacramento and 23-4 overall in Chesapeake Energy Arena.\n\nOklahoma City trailed 95-94 before Durant buried a 15-footer. At the other end, the Thunder's Steven Adams forced Rudy Gay into a turnover with 5.3 seconds left. Durant followed with his free throws to put Oklahoma City up by three, and Marco Belinelli air-balled a 3-point attempt at the buzzer for Sacramento.\n\"That's what your best player does,\" Westbrook said of Durant's hitting the key shot. \"He's not going to play perfect every night, but you can see he closed the game for us and did a good job defensively.\"\nDurant said he knows he is expected to take the big shot.\n\"I've been trusted my whole career, taking those shots,\" he said. \"I've failed plenty and plenty of times. I've made shots as well. I just try to stay focused and stay disciplined in what I do, and they went down for me.\"\nNBA assists leader Rajon Rondo had 10 to go with seven points for the Kings. Gay scored 20 points for Sacramento, but coach George Karl was critical of his decision to try to play for the final shot after Durant's late basket and said that isn't what was discussed during a timeout.\nSacramento rallied from a 13-point fourth-quarter deficit to lead 93-86 with 3:06 left after a 3-pointer by Belinelli but managed only two points the rest of the way.\n\"The momentum was on our side, and we kind of gave it back to them,\" Karl said.\nBelinelli and Darren Collison finished with 16 points each for the Kings.\nOklahoma City jumped to an 11-2 lead as the Kings missed six of their first seven shots, and the Thunder never trailed in the first half. They couldn't pull away, though, and Sacramento tied the game on three occasions. The Thunder led 51-48 at halftime.\nBoth teams started the third quarter 1-for-7 from the field before Serge Ibaka made three straight baskets and Andre Roberson's putback gave Oklahoma City its biggest lead to that point at 62-51 at the 6:14 mark. About two minutes later, Westbrook came up with a breakaway two-handed dunk off a steal and let out a roar after putting the Thunder up 66-52. Sacramento went seven minutes between baskets in the quarter and went 6-of-19 from the field.\nA 3-pointer by Collison pulled the Kings within 84-81 with 6:38 left, and they took their first lead at 85-84 on a jumper by Gay with 5:29 left.\nTIP-INS\nKings: Omri Casspi started for the second straight game in place of rookie Willie Cauley-Stein, who is out for four to six weeks with a dislocated right index finger suffered Thursday night in a loss to the Boston Celtics. Karl said he might adjust who starts in that spot game-to-game, depending on matchups. ... The Kings were 7-of-23 from the field in the second quarter but still matched the Thunder with 23 points. ... One night after recording a season-high 35 assists in a loss at Houston, the Kings had 20 assists against the Thunder.\nThunder: Ibaka picked up three fouls in the first six minutes and sat out the rest of the first half. ... Official Marc Davis lectured the scorers' table workers at halftime. Davis changed two foul calls in the first half, one from Durant to Ibaka several minutes after it occurred and another from a block on Cousins to a charge on Westbrook after Karl complained. ... Durant's five-game streak of scoring 25 or more points ended. ... Enes Kanter also had a double-double with 14 points and 10 rebounds. ... The Thunder wore their alternate orange uniforms.\nDEFENDING DEMARCUS\nSacramento's DeMarcus Cousins recorded a double-double with 13 points and 10 rebounds but went 5-of-20 from the field and 3-of-9 from the free throw line. It was his third straight subpar performance. Karl hasn't been able to pinpoint what's wrong.\n\"Nothing that I'm aware of, other than [over] 82 games, it's difficult to be a great player every night,\" he said. \"That just doesn't happen all the time. Matchups sometimes are poor. This team has got three really big guys, and Dwight Howard is a pretty good big guy. When you're the first priority of a scouting report, it's sometimes tough to be great.\"\nThunder center Adams said Oklahoma City \"just contested shots. That's pretty much it. We were just trying to be physical and make him make tough shots over us.\"\nUP NEXT:\nKings: Host Utah on Tuesday.\nThunder: Visit Memphis on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994200.6718879
}