{
  "game_id": "0022400556",
  "espn_id": "401705122",
  "date": "Jan 14, 2025",
  "matchup": "ATL vs. PHX",
  "headline": "Young scores season-high 43 points as Hawks continue home dominance over Booker-led Suns, 122-117",
  "body": "ATLANTA -- — Trae Young scored a season-high 43 points and the Atlanta Hawks overcame Devin Booker's 35 points to beat Phoenix 122-117 on Tuesday night and snap the Suns' three-game winning streak.\n\n\r\n              Kevin Durant scored 14 of his 31 points in the third quarter for Phoenix (19-20), which lost for the 11th straight time in Atlanta. Durant added nine rebounds.\n\n\r\n              The Suns are still looking for their first win in Atlanta since March 24, 2014.\n\n\r\n              The Hawks (20-19) were without forwards De'Andre Hunter (left foot soreness), Larry Nance Jr. (right hand) and Jalen Johnson (right shoulder inflammation), who missed his fourth consecutive game.\n\n\r\n              The injuries left Atlanta rookie Zaccharie Risacher with the challenge of guarding Durant. Hawks coach Quin Snyder described the matchup before the game as an “unique experience.”\n\n\r\n              Young, whose status was listed as questionable with an illness, made six 3-pointers and 11 of 14 free throws to carry the Hawks.\n\n\r\n              Takeaways\r\n              Suns: Bradley Beal returned after being escorted to the locker room in the third quarter with a sore left ankle. Beal scored 11 points. ... Booker set a season high with seven 3-pointers.\n\n\r\n              Hawks: Young and Garrison Mathews combined to make 8 of 11 3s in the first half as Atlanta led 64-56 at halftime. Mathews scored 19 points.\n\n\r\n              Key moment\r\n              Durant led the way as the Suns opened the second half with a 20-6 run to take the lead but Atlanta closed the period with a 14-3 spurt to lead 89-87 entering the fourth. Dyson Daniels and Bogdan Bogdanovic then opened the final period with 3s for Atlanta, which kept the lead the remainder of the game.\n\n\r\n              Key stat\r\n              Atlanta's Onyeka Okongwu scored 22 points and set a career high with 21 rebounds.\n\n\r\n              Up next\r\n              Phoenix continues a five-game trip when it plays at Washington on Thursday. The Hawks play at Chicago on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997949.328331
}