{
  "game_id": "0022400377",
  "espn_id": "401704943",
  "date": "Dec 21, 2024",
  "matchup": "ORL vs. MIA",
  "headline": "Magic tie franchise record with 25-point comeback in 121-114 win over Heat",
  "body": "ORLANDO, Fla. -- — Cole Anthony scored 27 of his 35 points in the second half and the Orlando Magic tied their largest comeback in franchise history to beat the Miami Heat 121-114 after trailing by 25 points on Saturday night.\n\n\r\n              The Magic also trailed by 22 entering the fourth quarter before outscoring the Heat 37-8. Their 25-point comeback ties a mark set on Nov. 8, 1989 against the Cleveland Cavaliers.\n\n\r\n              Anthony also had eight rebounds and nine assists. Kentavious Caldwell-Pope scored 24 points and Goga Bitadze added 18 points and 13 rebounds for the Magic, who lost center Mo Wagner to a knee injury in the first quarter and center Wendell Carter Jr. to an ejection before halftime.\n\n\r\n              Bam Adebayo and Terry Rozier led Miami with 23 points each, and Tyler Herro added 22. \n\n\r\n              Wagner went down with a left knee injury and did not return. Guard Jalen Suggs was a late scratch after injuring his ankle Thursday night.\n\n\r\n              Takeaways\r\n              Heat: Playing without Jimmy Butler, the Heat went cold in the fourth quarter to blow their lead.\n\n\r\n              Magic: After Carter was ejected before halftime for disputing a goaltending no-call on Kel'el Ware, the Magic were left with only one player (Caldwell-Pope) who started their season opener at Miami. \n\n\r\n              Key moment\r\n              Despite having to look to their bench, the Magic erased a 22-point deficit and took the lead on a short jumper by Caldwell-Pope with 2:41 remaining.\n\n\r\n              Key stat\r\n              The Heat made eight of their first 17 3-points shots before missing 14 of their next 15.\n\n\r\n              Up next\r\n              The Heat host the Brooklyn Nets and the Magic host the Boston Celtics on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997560.250329
}