{
  "game_id": "0022401166",
  "espn_id": "401705732",
  "date": "Apr 09, 2025",
  "matchup": "LAC vs. HOU",
  "headline": "Clippers extend winning streak to 6 games with 134-117 win over short-handed Rockets",
  "body": "INGLEWOOD, Calif. -- — James Harden had 35 points and 10 assists and the streaking Los Angeles Clippers beat the playoff-bound Houston Rockets 134-117 on Wednesday night for their sixth straight win.\n\n\r\n              The Rockets had already locked up the No. 2 seed in the West and will be making their first playoff appearance since the 2020 bubble in Florida. They rested most of their starting lineup, including Dillon Brooks and Alperen Sengun.\n\n\r\n              Ivica Zubac had 20 points, 11 rebounds and 10 assists for the Clippers, his first career triple-double and the third by a center for the team. Kawhi Leonard returned with 22 points and 10 rebounds after sitting out Tuesday to rest his surgically repaired right knee. Nicolas Batum added 15 points, including the Clippers' first 12 of the second quarter, before leaving with a sore right groin.\n\n\r\n              Reed Sheppard led six Rockets in double figures with 20 points. \n\n\r\n              Takeaways\r\n              Rockets: Jalen Green is on track to start all 82 games, which would make him the ninth Rockets player to do so in multiple seasons and first since Luis Scola in 2008-09 and 2009-10.\n\n\r\n              Clippers: Finished the regular season with a 30-11 mark in the new Intuit Dome.\n\n\r\n              Key stat\r\n              The Clippers made all 19 of their free throws, with Harden going 10 for 10. \n\n\r\n              Key moment\r\n              The Clippers outscored the Rockets 35-23 in the second when Zubac keyed a 12-0 run with six points and Leonard added four. \n\n\r\n              Up next\r\n              Both teams play Friday night. The Rockets stay in Los Angeles to face the Lakers and the Clippers visit Sacramento.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997880.6996071
}