{
  "game_id": "0021600040",
  "espn_id": "400899490",
  "date": "Oct 30, 2016",
  "matchup": "OKC vs. LAL",
  "headline": "Westbrook gets another triple-double, Thunder beat Lakers",
  "body": "OKLAHOMA CITY --  Russell Westbrook wasn't entirely pleased with his 51-point triple-double two nights earlier, so he adjusted his approach.\n\nWestbrook still scored 33 points as part of another triple-double, but he focused more on his role as a facilitator on Sunday. He had 16 assists to go with 12 rebounds, helping the Oklahoma City Thunder beat the Los Angeles Lakers 113-96 to remain undefeated.\n\nWestbrook took a career-high 44 shots against Phoenix on Friday, and he criticized himself for it afterward. This time, he made 11 of 21 field goals.\n\n\"I thought we did a good job of running the offense, letting it work for us,\" he said. \"Getting better shots, easy shots, and it worked out for us.\"\n\nAccording to the Thunder, Westbrook joined Magic Johnson, Jerry Lucas and Oscar Robertson as the only players in NBA history with two triple-doubles in the first three games of a season. He now averages 38.7 points, 12.3 rebounds and 11.7 assists.\n\n\"He had a masterful game tonight -- the way he was getting everyone involved, shooting when the shots were there and playmaking for teammates,\" Lakers coach Luke Walton said. \"When we were aggressive on him, he showed today why he's one of the top point guards in the world.\"\n\nThe Thunder have won 20 straight regular-season games when Westbrook registers a triple-double. He clinched this one, the 39th of his career, in the third quarter.\n\n\"That's standard for him,\" Thunder center Steven Adams said. \"He's a freak.\"\n\nVictor Oladipo added 20 points for the Thunder.\n\nD'Angelo Russell and Julius Randle each scored 20 points for the Lakers.\n\nThe Thunder led 58-46 at halftime, but the Lakers chipped away and pulled to 77-71 by the end of the third quarter.\n\nA putback dunk by Enes Kanter and a steal and dunk by Oladipo pushed Oklahoma City's lead to 10 in the first minute of the fourth.\n\nThe Lakers tried to hang tough. Nick Young made a 3-pointer to trim Oklahoma City's lead to 95-91 with just under five minutes remaining. Adams scored in close, and Westbrook followed with a fast break dunk after a steal by Adams to put the Thunder back in control for good.\n\n\"The biggest part was we had Russ,\" Adams said. \"Russ did an amazing job of just controlling us as players, and then we got everything we wanted because he was scoring the basket, and obviously, they had to overhelp.\"\n\nTIP-INS\n\nLakers:  Randle made 5 of 6 shots in the first half, while the rest of the team made 13 of 39. ... Los Angeles shot 5 for 18 on 3s in the first half and finished 7 for 32 for the game. ... Walton was denied his first road win as Lakers coach.\n\nThunder: Westbrook ranks second among active players behind LeBron James in triple doubles. James has 43. ... Oklahoma City had 17 assists on 23 baskets in the first half. ... Scored 34 points off 21 Lakers turnovers.\n\nSTAT LINES\n\nWestbrook matched a career high with five made 3-pointers. He was 5 for 6 after making going 2 for 10 from beyond the arc against Phoenix.\n\nQUOTE OF THE NIGHT\n\nWestbrook, on upcoming road games against the Los Angeles Clippers and Golden State Warriors: \"Honestly, it don't matter who we play in a back-to-back. We could play the Globetrotters, all I care. It don't matter. Our job -- we're going to go out and play one game at a time and try to get a win.\"\n\nUP NEXT\n\nLakers travel to Indiana to play the Paul George and the Pacers on Tuesday.\n\nThunder head west to play the Los Angeles Clippers on Wednesday, then face the Golden State Warriors and former teammate Kevin Durant on Thursday.\n\n---\n\nFollow Cliff Brunt on Twitter (at)CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764995342.767924
}