{
  "game_id": "0021700580",
  "espn_id": "400975326",
  "date": "Jan 06, 2018",
  "matchup": "HOU @ DET",
  "headline": "Drummond-less Pistons hold off Harden-less Rockets 108-101",
  "body": "DETROIT --  The Detroit Pistons have beaten several of the NBA's top teams this season.\n\nWithout James Harden, Houston might not qualify for that distinction -- but it was still a nice victory for the Pistons after an awful loss the night before.\n\nTobias Harris scored 27 points, and the Pistons held on for a 108-101 win over the Rockets on Saturday night. Detroit lost 114-78 at Philadelphia the previous evening, but the Pistons used a strong third quarter to outlast Houston.\n\nDetroit is only four games over .500, but the Pistons have beaten Golden State, Boston, San Antonio, Minnesota and now Houston. The Rockets are without Harden, but the Pistons were missing their own standout, with Andre Drummond sidelined because of a right rib contusion.\n\n\"We've sort of been up and down,\" Detroit coach Stan Van Gundy said. \"It's a good thing on a night like tonight. It's a bad thing on a night like last night. It's just a little too up and down. We need to be more consistent in what we do.\"\n\nAs usual, Houston relied heavily on 3-point shooting. The Rockets went 7 for 13 from beyond the arc in the first quarter, but were only 8 for 34 after that.\n\n\"I don't know if that was the performance of a tired team or what happened there,\" Houston coach Mike D'Antoni said. \"We're short-handed right now, and it seems like we are always playing our third game in four nights. We just never really had any intensity on defense, even when our offense was flowing.\"\n\nDetroit was the more efficient team from 3-point range, going 12 of 25.\n\nChris Paul had 16 points and 13 assists for Houston. Ish Smith scored 17 points for Detroit, and Dwight Buycks added a career-high 16.\n\nThere were eight lead changes and six ties in the first half, and Houston led 58-57 after two quarters. Detroit then outscored the Rockets 31-19 in the third. A dunk by Harris put the Pistons up 72-65, and Reggie Bullock's 3 near the end of the period made it 86-72.\n\nHouston rallied late and cut the deficit to four with 15.5 seconds left, but Smith made two free throws for Detroit at the other end.\n\nTIP-INS\n\nRockets: Harden is out with a hamstring strain. Houston was also without C Nene, who has a bruised right knee.\n\nPistons: In addition to Drummond, Detroit was without G Reggie Jackson (sprained right ankle) and F Stanley Johnson (strained right hip flexor). ... Eric Moreland replaced Drummond at center for the first start of his career and set career highs with eight points, four assists and 36 minutes.\n\nTURNAROUND\n\nDetroit is 5-2 in the second game of back-to-backs after going 3-14 last season. The Pistons had reason to be ready Saturday.\n\n\"It was tough in Philly last night,\" Bullock said. \"It was a lot of shots going in and out. Obviously, we missed a lot of defensive assignments, but tonight, we came back hungry.\"\n\nTOUGH STRETCH\n\nThe Rockets went 4 for 21 from long distance in the second and third quarters.\n\n\"Once we hit a lull in the second half, we were never able to regain our offensive flow,\" said guard Eric Gordon, who scored 15 points. \"That's a solid team, even with the guys they are missing, and they didn't let up on us once we stopped making shots.\"\n\nQUOTABLE\n\nVan Gundy isn't thrilled with how backup center Boban Marjanovic is being officiated. At 7-foot-3, Marjanovic can be tough to defend, and he had 10 points on 4-of-8 shooting.\n\n\"His size, they just officiate the game differently. They do,\" Van Gundy said. \"If he pushed and shoved guys and held guys the way they're able to do to him, it would be a foul every time.\"\n\nUP NEXT\n\nRockets: Visit the Chicago Bulls on Monday night.\n\nPistons: Visit the New Orleans Pelicans on Monday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993622.2365708
}