{
  "game_id": "0021900938",
  "espn_id": "401161580",
  "date": "Mar 06, 2020",
  "matchup": "PHX vs. POR",
  "headline": "Baynes has career-high 37 points, Suns top Blazers 127-117",
  "body": "PHOENIX --  Aron Baynes scored a career-high 37 points on a career-high nine 3-pointers, Dario Saric added 24 points and the Phoenix Suns beat the Portland Trail Blazers 127-117 on Friday night to snap a four-game losing streak.\n\nBaynes was 9 of 14 from long distance and 12 of 23 overall. He also had 16 rebounds. The huge night came one game after the big Australian didn't even play against the Toronto Raptors because coach Monty Williams didn't like the matchup.\n\n\"It can be funny in the NBA like that,\" Baynes said. \"Night to night it can be completely different. One thing we've done well as a team is a next-man-up mentality. If you go out there and play within Monty's system, he usually puts you in places to succeed.\"\n\nPhoenix never trailed and made 19 3-pointers. It was a much-needed win for the Suns after they had lost four straight home games to hurt their already fading playoff hopes.\n\nThe 6-foot-10 Baynes is an eight-year NBA veteran but almost never shot 3-pointers until last season. He made it a big part of his game when he joined the Suns this season and was hitting them at a 33% rate coming into Friday.\n\nHe came out firing against the Blazers, hitting five from beyond the arc in the first quarter, which already beat his career high of four, He was especially good from his favorite spot at the top of the key and his nine 3-pointers tied a single-game franchise record.\n\nBy the end of the night, the crowd was screaming for him to shoot every time he touched the ball beyond the arc.\n\n\"Exactly how I drew it up this morning,\" Williams said laughing. \"Aron, go for 37. Nine threes. He got the guys going when he started dropping a few of them. Then we started running a few plays for him.\"\n\nDevin Booker added 23 points and 12 assists for the Suns.\n\nCJ McCollum led Portland with 25 points, and Damian Lillard had 24. Hassan Whiteside added 23 points and 20 rebounds. The Blazers are among the teams fighting with the Suns for the final spot in the Western Conference playoffs. They're 3 1/2 games behind eighth-place Memphis. The Suns are six games back.\n\nWhiteside said the Blazers simply didn't have an answer for Baynes.\n\n\"He had a career night, bro. It happens,\" Whiteside said. \"He took 23 shots. He got hot. Once he hit a step back over (Lillard), I knew he was feeling good.\"\n\nSaid Blazers coach Terry Stotts: \"You expect him to make some threes but you don't expect him to make that many.\"\n\nThe Suns led 56-33 midway through the second quarter but Portland responded with a big run to close the gap to 67-58 by halftime. Baynes had 22 points by the break, making six 3-pointers. McCollum had 16 points for the Blazers.\n\nPLUS-MINUS MVP\n\nSuns point guard Ricky Rubio had 13 points and 10 assists for his sixth double-double in seven games. Even more impressive: Phoenix outscored Portland by 32 points during the 33 minutes he was on the court. They were outscored by 22 on the 15 minutes he was on the bench.\n\n\"He's a calming presence out there for us,\" Baynes said. \"There's not any situation he hasn't seen. And he sees it with the ball in his hands.\"\n\nTIP-INS\n\nTrail Blazers: Whiteside had 10 rebounds and three blocked shots in the first half. ... Portland had won two straight before Friday's loss.\n\nSuns: Phoenix had just nine healthy players. Starting center Deandre Ayton missed the game after spraining his ankle at the end of Tuesday's loss to Toronto. Cameron Johnson (illness), Kelly Oubre Jr. (right knee injury) and Frank Kaminsky III (right patella stress fracture) were also out.\n\nUP NEXT\n\nTrail Blazers: Host Sacramento on Saturday night.\n\nSuns: Host Milwaukee on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996568.197781
}