{
  "game_id": "0022000889",
  "espn_id": "401307688",
  "date": "Apr 21, 2021",
  "matchup": "MEM @ LAC",
  "headline": "Clippers recover after poor start, beat Grizzlies 117-105",
  "body": "LOS ANGELES -- — Luke Kennard scored a season-high 28 points and the short-handed Los Angeles Clippers rallied from an 18-point, first-quarter deficit to beat the Memphis Grizzlies 117-105 on Wednesday night.\n\n\r\n                    Marcus Morris added 25 points and Terance Mann had 19 points in helping the Clippers win their third in a row and 10th in 11 games despite being without starters Kawhi Leonard (sore foot), Paul George and Reggie Jackson, who both rested.\n\n\r\n                    “It just comes down to heart, wanting to compete for 48 minutes,” Clippers coach Tyronn Lue said. “We don’t want to make excuses. A lot of teams are down players and finding ways to compete. That’s what we want to do.”\n\n\r\n                    Ja Morant led Memphis with 22 points. \n\n\r\n                    Jaren Jackson Jr. made his season debut for the Grizzlies, with 15 points and eight rebounds to go with five fouls off the bench. He'd been out since August after having surgery on his left meniscus and missing the first 56 games.\n\n\r\n                    “When I checked in, I couldn’t help but laugh a little bit,” Jackson said. “Just being out there in general was the win for me. While I was out there, I was just having fun.”\n\n\r\n                    After being dominated in the first half, the Clippers took their first lead with about three minutes left in the third, when they hit 12 of 17 free throws. Kennard scored 10 points, including six in a row, and Mann dunked off a pass from Yogi Ferrell to send them into the fourth leading 87-82.\n\n\r\n                    “I saw T-Mann pointing his finger and I just threw it up over the rim,” Ferrell said.\n\n\r\n                    The Grizzlies got to 90-89 early in the fourth, but the Clippers pulled away down the stretch. They got consecutive baskets by Ferrell, newly signed to a 10-day contract, and two-way player Amir Coffey, who made his first start. Kennard hit his sixth 3-pointer, tying his career high.\n\n\r\n                    “We lost our pace there in the second half,” Memphis coach Taylor Jenkins said. “We were fouling too much and they were scoring.”\n\n\r\n                    It was the exact opposite in the first half.\n\n\r\n                    The Grizzlies came out firing, shooting 70% and building an 18-point lead in the first quarter. They cooled off to 56% in the second, when the Clippers reduced their deficit to 62-53 at halftime.\n\n\r\n                    Jackson came off the bench and hit a 3-pointer midway through the first. His one-handed jam in the second drew shouts from his bench mates.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Fell to 2-2 on their seven-game trip that is the longest since the 2001-02 season. \n\n\r\n                    Clippers: Won the season series, 2-1.\n\n\r\n                    10-DAY GUYS\n\n\r\n                    Ferrell had seven assists to go with eight points in his first game. DeMarcus Cousins grabbed a team-high 10 rebounds while scoring seven points and taking three big charges. Cousins signed a second 10-day contract last week.\n\n\r\n                    “One thing I'm going to do out there is go play hard for my guys,” Ferrell said. “Everybody is positive, nobody gets down. They want you to shoot the shot if you're open. They weren't pointing fingers when we were down.”\n\n\r\n                    They're still learning plays, but are quickly working their way into the rotation. \n\n\r\n                    “We’re trying to build a culture over this year where everybody believes in each other,” Mann said. “They feel that when they get here and it’s easy to play when all your teammates believe in you.”\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Visit Portland on Friday.\n\n\r\n                    Clippers: Visit Houston on Friday in opener of three-game trip.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996928.263094
}