{
  "game_id": "0022300213",
  "espn_id": "401584841",
  "date": "Nov 19, 2023",
  "matchup": "MEM vs. BOS",
  "headline": "Kristaps Porzingis scores 26, including winning dunk with a minute left as Celtics defeat Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Kristaps Porzingis scored 26 points, including the winning dunk with 1:01 left, as the the Boston Celtics held on for a 102-100 victory over the Memphis Grizzlies on Sunday night.\n\n\r\n              Porzingis’ dunk was followed by a flurry of missed shots including a 3-point attempt by Santi Aldama with 4 seconds left. Ziaire Williams’ 18-footer as time expired was blocked by Porzingis — his sixth of the game — as Boston held on to win its sixth straight.\n\n\r\n              Jayson Tatum finished with 20 points and Sam Hauser added 15 for Boston, including 5 of 7 from outside the arc. Tatum had nine rebounds and five assists, but committed eight of Boston's 17 turnovers.\n\n\r\n              “We were just undisciplined. We didn’t execute defensively as far as our personnel and our tendencies,” Boston coach Joe Mazzulla said.\n\n\r\n              Desmond Bane led Memphis with 30 points, while Aldama added a career-high 28 and Jaren Jackson Jr. finished with 17 points. Aldama, who also had 12 rebounds, was 11 of 27 from the field, including 6 of 15 from outside the arc.\n\n\r\n              “He was awesome,” Memphis coach Taylor Jenkins said. “Career night (scoring). Twelve rebounds, six assists. Six made 3s. He’s got so much versatility.”\n\n\r\n              “I’m lucky to have teammates and a coaching staff that trust me,” Aldama said. “Obviously, I believe in my shot, but everybody does.”\n\n\r\n              Memphis, with a makeshift lineup, stayed close through the night and even took the lead on several occasions in the second half. Memphis led 100-98 with 1:48 left. But the Celtics were able to pull out the victory as Porzingis converted a pair of free throws and the winning dunk.\n\n\r\n              There were seven ties and 18 lead changes.\n\n\r\n              Memphis, as it has done most of the season, played without key players. Last year’s leading scorer Ja Morant is serving a 25-game suspension to start the season. The Memphis frontline has been depleted by a season-ending injury to center Steven Adams, while backup Brandon Clarke is still recovering from an Achilles injury.\n\n\r\n              The injury report also includes point guard and former Celtic Marcus Smart, who sat out with a left foot sprain. Smart played his entire career with Boston before an off-season trade landed him in Memphis.\n\n\r\n              Meanwhile, the Celtics were at full strength, including Jaylen Brown, who was listed as questionable on the pre-game injury report.\n\n\r\n              Porzingis benefitted from going against the smaller Memphis lineup. Despite Memphis playing thin on the frontline, Porzingis, who finished 9 of 13 from the field, said the game plan was not necessarily to focus on that mismatch.\n\n\r\n              “We just played our game,” Porzingis said. “I tried to take advantage of some of the mismatches. It was just one of those games that kind of happened naturally.”\n\n\r\n              The Celtics shot 51% in the first half and held Memphis to 38%. Boston led 56-53 lead at the break.\n\n\r\n              “We got lucky to win that game” Mazzulla said. \n\n\r\n              UP NEXT\n\n\r\n              Celtics: Wrap up a four-game road trip Monday in Charlotte.\n\n\r\n              Memphis: Travels to Houston to face the Rockets and former teammate Dillon Brooks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996044.326723
}