{
  "game_id": "0021500093",
  "espn_id": "400827980",
  "date": "Nov 07, 2015",
  "matchup": "HOU @ LAC",
  "headline": "James Harden scores 46 as Rockets hang on to beat Clippers",
  "body": "LOS ANGELES -- Seven games into the season, the Houston Rockets have already experienced more ups and downs than most teams. They lost their first three games and have turned things around to win four in a row.\nMuch of it is due to James Harden, who scored a season-high 46 points in his second straight game over 40 to help the Rockets beat the Los Angeles Clippers 109-105 Saturday night.\nHarden made 13 of 14 free throws and was 5-of-10 from 3-point range a night after he scored 43 in a 116-110 win at Sacramento.\n\"We got some open shots, and I was just being aggressive,\" Harden said. \"These last couple games when we have been playing well, our defense has led to easy buckets in transition for our offense, so that's what we have to hang our hat on.\"\n\nBlake Griffin had 35 points and 11 rebounds for the Clippers, who played without Chris Paul. The star point guard sat out with a sore right groin as Los Angeles lost at home for the first time in four games.\n\"We needed to make things tougher for James,\" Griffin said. \"We needed to make him drive, but he's good at that just like he's a good shooter. He had it going and we need to do a better job by committee.\"\nMarcus Thornton added 16 points, and Dwight Howard had 20 points and 20 rebounds for the Rockets.\nWith Thornton and Harden hitting 3-pointers, Houston led by 11 midway through the fourth.\nThe Clippers responded by outscoring the Rockets 17-6, tying it at 105 on a 3-pointer from the left corner by Paul Pierce with 41 seconds to go.\nJ.J. Redick fouled Harden, who made both to put Houston ahead 107-105.\nAfter a timeout, Griffin put the ball up, and it hit the rim and bounced away, with the Clippers arguing Howard should have been called for goaltending. Paul, dressed in street clothes, came on the court during a timeout to make a case with one of the referees.\n\"That's textbook goaltending,\" Griffin said. \"The review really didn't help us.\"\nAfter a video review, the ball was awarded to Houston with 17 seconds to go. Ty Lawson made two free throws for a four-point lead before Jamal Crawford's 3-pointer missed at the buzzer.\n\"I thought our entire team played like they had cement boots on the first three games,\" Houston coach Kevin McHale said. \"We were just slow. When you watch the film, we just looked sickly. We were able to turn the corner and get downhill.\"\nRedick added 19 points, and DeAndre Jordan had 11 points and 14 rebounds for the Clippers.\nTIP-INS\nRockets: Harden just missed his career best of 51 points set against Sacramento on April 1. ... The Rockets outscored the Clippers 22-10 in fast-break points. ... They improved to 2-0 in the second game of back-to-backs. ... They have won four straight for the first time since March 23-29 of last season. ... Houston has won three straight against the Clippers for the first time since March 28-Dec. 22, 2009.\nClippers: Austin Rivers started his first game of the season in place of Paul, who is averaging 17 points and 8.2 assists. The coach's son had 10 points in 31 minutes. ... Without Paul, the Clippers still had a season-high 29 assists.\nUP NEXT\nRockets: Host Brooklyn on Wednesday night.\nClippers: Host Memphis on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994673.4597728
}