{
  "game_id": "0022400662",
  "espn_id": "401705228",
  "date": "Jan 28, 2025",
  "matchup": "MIL @ POR",
  "headline": "Avdija scores 30 as the Blazers top former teammate Lillard and the Bucks 125-112",
  "body": "PORTLAND, Ore. -- — Deni Avdija scored a season-high 30 points and the Portland Trail Blazers bested former teammate Damian Lillard with a 125-112 victory over the Milwaukee Bucks on Tuesday night. \n\n\r\n              Anfernee Simons added 25 points for Portland, which has won five of its last six. The Blazers led by 19 points in the final quarter. \n\n\r\n              Giannis Antetokounmpo had 39 points and 12 rebounds for the Bucks, who had won nine of their last 11 but were playing their third game in four nights. \n\n\r\n              The game marked Lillard's second trip to Portland since he was traded to the Bucks ahead of last season. Lillard, who spent 11 seasons with the Blazers, finished with 20 points. \n\n\r\n              The Bucks went up 47-35 on Gary Trent Jr.'s pullup jumper, but Portland went ahead 64-61 at the break. Shaedon Sharpe's 3-pointer stretched the Blazers' lead to 82-73 in the third. \n\n\r\n              Takeaways\r\n              Bucks: Milwaukee was coming off a 125-105 victory at the Jazz. Lillard and Antetokounmpo had 35 points in the win. Taurean Prince was called for a flagrant foul on Avdija in the first quarter. \n\n\r\n              Trail Blazers: Guard Scoot Henderson was named to the Rising Stars event during All-Star weekend. ... Avdija had 14 points in the third quarter. He finished with nine rebounds. ... Jerami Grant left the game in the second half with a right ankle injury. \n\n\r\n              Key moment\r\n              Simons hit a 3-pointer that gave the Blazers a 57-56 lead with 2:23 left in the first half as the Blazers clawed back from a 12-point deficit. Simons had 12 points in the second quarter alone. \n\n\r\n              Key stat\r\n              The Blazers are 3-1 against the Bucks since they traded Lillard. \n\n\r\n              Up next\r\n              The Bucks visit San Antonio on Friday night. The Trail Blazers host Orlando on Thursday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997833.879194
}