{
  "game_id": "0022300456",
  "espn_id": "401585084",
  "date": "Jan 01, 2024",
  "matchup": "PHX vs. POR",
  "headline": "Suns, without Durant, rout Trail Blazers 109-88 for 4th straight win",
  "body": "PHOENIX -- — Bradley Beal scored 21 points and the Phoenix Suns beat the Portland Trail Blazers 109-88 on Monday night for their fourth consecutive victory.\n\n\r\n              With Kevin Durant sidelined by right hamstring tightness, the Suns had seven players score in double figures. Jusuf Nurkic, playing against his former team, had 18 points. Chimezie Metu, starting for Durant, scored 14, and Grayson Allen and reserve Eric Gordon each had 12.\n\n\r\n              “He changes everything,” Nurkic said of Beal, who returned Friday from an ankle injury. “It's simple. We depend on him. When he's out there, it doesn't matter what he does, just being out there makes a big difference for our team.” \n\n\r\n              Phoenix star Devin Booker was held to 10 points on 4-of-16 shooting, but he contributed eight rebounds and six assists. Bol Bol helped make up for Durant's absence with 11 points and nine rebounds.\n\n\r\n              Durant scored 31 points in Sunday’s victory over Orlando, but coach Frank Vogel said he tweaked the hamstring late in the game.\n\n\r\n              “He was able to finish the game, but it was enough to keep him out,” Vogel said before Monday’s win. “He’s day to day.”\n\n\r\n              The Suns allowed their lowest point total of the season.\n\n\r\n              “I want to credit our bench,” Vogel said. “We were getting a lot of stops and getting out on the break, and things are a lot easier when you're not taking the ball out of your own basket and not fouling. Our bench tonight gets the game ball.”\n\n\r\n              Scoot Henderson led the Trail Blazers with 17 points. Jerami Grant scored 15 points, and Malcolm Brogdon and Jabari Walker each had 10.\n\n\r\n              Portland led 29-20 after the first quarter but was outscored 66-32 in the next two periods. Phoenix led by as many as 26 points in the game.\n\n\r\n              “I thought we had a really good first quarter,” Portland coach Chauncey Billups said. “Then we had eight turnovers in the (second) quarter. We just didn't have enough.”\n\n\r\n              Portland played without former Phoenix center Deandre Ayton, who was sidelined by right knee tendinitis. Toumani Camara also missed the game with right knee soreness.\n\n\r\n              The Blazers haven’t won on the road since Nov. 30 against Cleveland. That was their last win before a seven-game losing streak that ended when they beat the Suns 109-104 in Portland on Dec. 19.\n\n\r\n              Nurkic and Allen were acquired by Phoenix in a three-way deal with Portland and Milwaukee in September that included Ayton going from the Suns to the Trail Blazers.\n\n\r\n              NEXT\n\n\r\n              Portland: At Dallas on Wednesday.\n\n\r\n              Phoenix: Hosts Los Angeles Clippers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996661.4448588
}