{
  "game_id": "0021601223",
  "espn_id": "400900601",
  "date": "Apr 12, 2017",
  "matchup": "MEM vs. DAL",
  "headline": "Mavericks end season with 100-93 win over Grizzlies",
  "body": "MEMPHIS, Tenn. --  Without starters Dirk Nowitzki, Harrison Barnes and Wesley Matthews, the Dallas Mavericks were undermanned Wednesday night against the Memphis Grizzlies.\n\nForward Nicolas Brussino, making his second start of the season, and reserve guard Devin Harris each scored 15 points and the short-handed Mavericks ended a five-game losing streak with a 100-93 victory.\n\nThe Mavericks won despite leaving Nowitzki, Barnes and Matthews at home to rest. Reserve guard J.J. Barea, averaging 10.9 points, also remained in Dallas as coach Rick Carlisle opted to use his younger players in the regular-season finale.\n\n\"The group that was out there at the end, everybody did something good,\" Carlisle said. \"All of this stuff really helps these guys get better.\"\n\nMemphis, the seventh seed in the Western Conference, was led by Mike Conley and Zach Randolph, who scored 15 points each. Marc Gasol added 13 points.\n\nThe Grizzlies led by 12 midway through the third quarter following a three-point play by Wade Baldwin, but the Mavericks rallied.\n\nTrailing 74-70 entering the final period, the Mavericks opened with a 17-8 run to take an 87-82 lead with 5:28 to go. A.J. Hammons and Jarrod Uthoff each had six points during the run. The Grizzlies never led again.\n\n\"I think it's a morale booster,\" Uthoff said. \"This is the beginning for a lot of us, for our career, and it is always nice to get a win with us playing.\"\n\nBrussino, completing his rookie season, had a career-high point total and was 4-of-8 from beyond the arc. His 3-pointer with 1:15 to go gave Dallas a 97-90 advantage.\n\n\"They were physical with him early,\" Carlisle said. \"He adjusted and he got into more of a leveraged position on offense and defense. He made them foul him a few times, got open for a few shots and hit the big dagger shot at the end.\"\n\nDallas made its run after the Grizzlies had benched their starters. Conley played the first two quarters (17 minutes) and Gasol played the first three (24 minutes).\n\nNo starters played in the fourth quarter and the Grizzlies went 6-for-26 shooting, including an 0-for-6 effort from Andrew Harrison.\n\n\"They were all trying to make their mark on the game and I think that leads to a lot of mistakes,\" Memphis coach David Fizdale said.\n\n\"I don't think they really worked to help each other, but that's young guys when you throw them in the end of the game and they're trying to show something. The effort was there, but I thought the execution was really poor.\"\n\nBehind 15 points from Conley and 47.6 percent shooting, the Grizzlies led 55-46 at the half. Memphis built a 10-point lead in the second quarter, but a Mavericks' lineup missing players averaging more than 70 points trimmed the margin to two points shortly before the half.\n\nConley said the experience the Memphis reserves received will be invaluable. And their playing time allowed the Grizzlies to be rested with another playoff series against the Spurs looming.\n\n\"Obviously, we want to win every game we play,\" he said. \"I think we're just going to chalk it up and get ready for the series.\"\n\nTIP-INS\n\nMavericks: Forward Dirk Nowitzki, completing his 19th season, did not make the trip. He averaged 14.2 points and 6.5 rebounds in an injury-filled 54-game season. ... Dallas failed to finish at .500 or better for the first time since 1999.\n\nGrizzlies: Memphis started its regular lineup of Mike Conley, Tony Allen, Marc Gasol, Vince Carter and JaMychal Green. Allen left the game with 6:10 to go in the first quarter, hobbling off with a lower right leg injury. Allen did not return. ... Carter played in his 1,347th game and passed Kobe Bryant for 13th in regular-season games played.\n\nGETTING SOME HELP\n\nRandolph got credit for a basket he didn't make in the first quarter. Mavericks center Salah Mejri accidently tipped in a Grizzlies' missed attempt. Randolph moved into 75th place on the NBA's scoring list with his first basket, a field goal that allowed him to pass Magic Johnson (17,707). Randolph, like Johnson, attended Michigan State.\n\nSTAYING HOME\n\nIn addition to Nowitzki, J.J. Barea, Harrison Barnes and Wesley Matthews did not make the trip. In resting the foursome, the Mavericks left nearly 58 points in Dallas. Barnes finished the season as the team's leading scorer (19.2 points per game). Matthews, also a starter, averaged 13.5 points.\n\nUP NEXT:\n\nDallas: Season over.\n\nMemphis: Faces San Antonio in the first round of the Western Conference playoffs. Game 1 is Saturday at 8 p.m.",
  "source": "espn_api",
  "crawled_at": 1764995556.011221
}