{
  "game_id": "0022301183",
  "espn_id": "401585811",
  "date": "Apr 12, 2024",
  "matchup": "HOU @ POR",
  "headline": "Jalen Green has 26 points and Houston cruises to 116-107 win over Portland",
  "body": "PORTLAND, Ore. -- — Jalen Green had 26 points and the Houston Rockets spoiled Portland's final game at home this season with a 116-107 victory Friday night. \n\n\r\n              Jock Landale had 20 points and Aaron Holiday came of the bench to score 18 for Houston, which had already been eliminated from playoff contention. Rookie Amen Thompson had 17 points and 15 rebounds for the Rockets, playing the second of a back-to-back. \n\n\r\n              “I was just trying to go hard, bounce back after last night. I felt the team, we brought the energy today, so it was good,\" Thompson said, reflecting on a lackluster loss to the Jazz the night before. \n\n\r\n              Scoot Henderson had 30 points for the Trail Blazers, who have lost four in a row and 14 of their last 16 with one game left. Portland was second-to-last in the Western Conference. \n\n\r\n              Houston (40-41) led by 20 points in the third quarter but the Blazers narrowed it to 82-73 on Henderson's dunk and free throw. Henderson added a step-back jumper to get Portland closer. \n\n\r\n              Cam Whitmore's 3-pointer early in the fourth quarter extended Houston's lead to double digits again and the Rockets cruised the rest of the way. \n\n\r\n              “It was a little slow to start, but we had a good second quarter,” Rockets coach Ime Udoka said. “A lot of guys stepped up did a lot of good things.” \n\n\r\n              The Rockets were without Fred VanVleet because of a right hip contusion. VanVleet has averaged 17.4 points with a career-high 8.1 assists. He scored a season-high 42 points Thursday in a 124-121 loss to the Utah Jazz. \n\n\r\n              Thompson, who also had six assists, helped pick up the slack. \n\n\r\n              “I love experiences like that, getting to develop in different positions, point guard, everything,” he said. \n\n\r\n              Portland (21-60) had shut down many of its regular starters earlier this month, including Anfernee Simons (left knee tendonitis), Jerami Grant (right hamstring) and Matisse Thybulle (right ankle). The Blazers were coming off a 100-92 loss to the Warriors the night before. \n\n\r\n              The game showcased a trio of rookies, Portland's Henderson and Houston's Thompson and Whitmore, who finished with 11 points. \n\n\r\n              “I was happy to see him come in and really dominate the game today and take care of the ball. One turnover. That was my big takeaway for him, especially against a team like that, that pressures and turns you over, and plays physical,” Blazers coach Chauncey Billups said about Henderson. \n\n\r\n              Henderson's bank shot gave the Blazers a 16-9 lead in the first quarter but the Rockets closed the gap to 24-23 to start the second. \n\n\r\n              The Rockets went on a 16-5 run, capped by Thompson's basket that gave Houston a 41-29 lead. Henderson hit a 3-pointer from midcourt to slow the momentum, but the Rockets led 54-50 at the half. \n\n\r\n              Dillon Brooks' 3-pointer gave the Rockets a 62-42 lead in the third quarter. Green got tangled up with Moses Brown, who appeared to inadvertently step on his foot late in the quarter. Green left the court but returned midway through the fourth quarter. \n\n\r\n              UP NEXT\n\n\r\n              Rockets: Close out the season on the road against the Los Angeles Clippers on Sunday. \n\n\r\n              Trail Blazers: Visit Sacramento on Sunday for the final game of the season. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995558.4140632
}