{
  "game_id": "0021501105",
  "espn_id": "400828992",
  "date": "Mar 28, 2016",
  "matchup": "POR vs. SAC",
  "headline": "Crabbe has 21 and Blazers beat Kings 105-93",
  "body": "PORTLAND, Ore. --  At this point in the season, it's nice for Portland's starters to get a bit of a rest -- as well as a win.\n\nReserve Allen Crabbe scored 21 points and the Trail Blazers cruised to a 105-93 victory over the short-handed Sacramento Kings on Monday night.\n\nCJ McCollum had 16 points, while Damian Lillard added 13 points and nine assists, before both starters sat out the final quarter. Portland, which led by as many as 28 points, remained sixth in the Western Conference with seven games to go.\n\n\"That was a great way to get some rest, not having to play the fourth. Our team handled its business in the first two quarters,\" Lillard said.\n\nThe Blazers have won 14 of their last 16 games at home, including five straight.\n\nSeth Curry had a career-high 21 points in just his third start of the season and Omri Casspi added 18 for the Kings, who have lost five straight to the Blazers.\n\nThe Kings, all but out of the playoff picture, rested Rudy Gay, Rajon Rondo and DeMarcus Cousins. The starting lineup had Curry and Darren Collison in the backcourt, along with forwards Casspi and Quincy Acy and center Kosta Koufos.\n\n\"I think it will happen some more,\" Sacramento coach George Karl said about resting his stars. \"I don't think there's an exact schedule yet but I think you'll see us do it a little bit more, especially in back-to-back situations.\"\n\nThe Kings were without Marco Belinelli for the second straight game because of a sore right foot. That meant the team had just nine available players.\n\nThe Kings were also playing the second of a back-to-back, following a 133-111 win over Dallas in Sacramento on Sunday.\n\n\"It's different,\" McCollum said about playing a Sacramento team that hardly resembled the one the Blazers had seen this season. \"Obviously they had a lot of guys sitting out tonight for various reasons. But there are a lot of players in this league that are very capable of playing at a high level. So, I'm sure a lot of those guys were relishing the opportunity and they played hard.\"\n\nJames Anderson's 3-pointer tied it at 31 in the opening quarter, but it was mostly all Portland from there. Lillard answered with his own 3 and the Blazers went on to lead 37-32 at the end of the first quarter. Portland's Maurice Harkless led all scorers with 10 points in the period.\n\nThe Blazers pushed the margin to 64-48 late in the second quarter with Al-Farouq Aminu's 3, the 11th 3-pointer for the Blazers in the first half alone. Portland led 68-52 at the break. Portland finished with 14 3-pointers in the game.\n\n\"I think we got better as a team as the game went along, but they played well and made a lot of their shots -- so it was tough to play with them, Curry said.\n\nBalancing the fatigue that can hit late in the season, Blazers coach Terry Stotts was giving the team Tuesday off. But to Lillard, the rest is not as important as preparing for the playoffs.\n\n\"I'm going to play, that's the bottom line,\" he said. \"Our team is winning games when they need to win games and that's all that matters.\"\n\nTIP-INS\n\nKings: It was the third loss for the Kings in the four-game series with the Blazers. Sacramento has not dropped three or more to Portland since the 2009-10 season, when it was swept in four. ... The teams meet again next Tuesday in Sacramento.\n\nTrail Blazers: With 11 first-half 3s, the Blazers were one 3-pointer shy of their record for a half. ... Crabbe has scored in double figures in all three games against the Kings this season.\n\nMOVING ON UP?\n\nThe Blazers were 2 1/2 games back of Memphis for the fifth spot in the West. Crabbe was asked if the Blazers were eyeing a move up the standings.\n\n\"We just want to get as many wins as we can for the rest of the season,\" he said. \"We haven't really talked as a team about where we want to finish, but I feel like our main thing is making the playoffs.\"\n\nUP NEXT\n\nKings: Host Washington on Wednesday night.\n\nTrail Blazers: Host Boston on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994498.2097049
}