{
  "game_id": "0021900161",
  "espn_id": "401160803",
  "date": "Nov 14, 2019",
  "matchup": "MIA @ CLE",
  "headline": "Nunn, Adebayo lead Heat past Cavaliers 108-97",
  "body": "CLEVELAND --  The Miami Heat didn't let a night of dominant play slip away in the fourth quarter.\n\nRookie Kendrick Nunn scored 23 points, Bam Adebayo had 16 points and 15 rebounds and Miami, which led the entire game, held off a late Cleveland run and defeated the Cavaliers 108-97 on Thursday night.\n\nMiami, which has the second-best record in the Eastern Conference at 8-3, was up by 27 points in the third quarter before Cleveland cut the lead to 98-88 with seven minutes to play. The Heat regained control and maintained a double-digit lead down the stretch.\n\n\"We found a way to win,\" said Heat forward Jimmy Butler, who had a blocked shot, a basket and a steal in the final three minutes. \"It doesn't matter how you do it, win by one, win by 20. It goes in the same column.\"\n\nMiami lead 96-74 early in the fourth before Cleveland rallied. Kevin Love hit 3-pointers on consecutive possessions to spark the Cavaliers' run. Butler's basket in the lane, a 3-pointer by Duncan Robinson and four points by Adebayo kept Miami in control.\n\n\"It was turnovers, run-outs and not getting stops,\" Miami coach Erik Spoelstra said. \"Then we gathered ourselves. Usually games do not go all according to plan and they didn't tonight, particularly in the fourth quarter.\"\n\nRookie Tyler Herro, who missed Tuesday's game with an ankle injury, had 16 points, while Butler finished with 14.\n\nLove had 21 points and 10 rebounds for Cleveland, while Collin Sexton added 15 points.\n\nCleveland was coming off a 2-1 road trip and nearly beat Philadelphia on Tuesday before losing 98-97.\n\nCavaliers coach John Beilein thinks the Heat are a good example for his rebuilding team to follow.\n\n\"They're doing everything,\" he said. \"They're playing defense as good as it is the league. Their offense is good. They're a high-functioning team. That's how we want to be day in, day out.\"\n\nThe Cavaliers' chances of staying with another of the league's top teams were hit with an early run. Miami made consecutive 3-pointers to take a 9-0 lead, forcing Beilein to use a timeout less than two minutes into the game.\n\nThe Heat continued to roll and had a 32-15 advantage late in the period. Miami was 15 of 25 from the field and didn't go to the foul line in the quarter.\n\nCavaliers forward Larry Nance Jr. injured his left hand on a breakaway dunk in the fourth quarter. He went to the locker room and didn't return, watching the final minutes from the bench. Nance has played with his left thumb wrapped for several games.\n\n\"I'll be all right,\" he said. \"I'm going to get some treatment so we'll know more later. I'm not necessarily certain (what happened). I just felt the pain.\"\n\nThe Heat shot 43 of 79 from the field and made 12 of 30 from 3-point range.\n\nTIP-INS\n\nHeat: F James Johnson was available after being out Tuesday because of illness, but didn't play. ... Robinson played for Beilein at the University of Michigan. ... Justise Winslow (concussion), Derrick Jones Jr. (hip), KZ Okpala (Achilles) were out for Miami.\n\nCavaliers: Cleveland was 13 of 15 from the foul line in the first half, and still trailed by 22 points. ... F Tristan Thompson, who had eight doubles-doubles in the first 10 games, was held to two points and three rebounds in 23 minutes.\n\nBIG NUMBERS\n\nMiami had 31 assists, after having 34 on Tuesday.\n\n\"They should come every single game just because we share the ball so well,\" Butler said. \"We've got guys who can get the ball to the basket so that always helps.\"\n\nBeilein, pointing out the Cavaliers are 27th in the league in assists, believes that is another example for his players.\n\n\"That tells stories about everything, that the ball's not moving the way it can move,\" he said. \"Most winning teams have high assist numbers. They know that, just making that extra pass is going to be key for them to see that.\"\n\nUP NEXT\n\nHeat: Host New Orleans on Saturday. Miami swept the two-game season series over the Pelicans by 11 total points in 2018-19.\n\nCavaliers: Host Philadelphia on Sunday. The 76ers beat visiting Cleveland 98-97 on a Joel Embiid dunk with 14 seconds left Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995553.573339
}