{
  "game_id": "0022400466",
  "espn_id": "401705032",
  "date": "Jan 02, 2025",
  "matchup": "OKC vs. LAC",
  "headline": "Gilgeous-Alexander scores 29 points and Thunder win 13th in a row, 116-98 over Clippers",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 29 points and the Oklahoma City Thunder won their franchise-record 13th consecutive regular-season game, 116-98 over the Los Angeles Clippers on Thursday night.\n\n\r\n              The Thunder trailed by 16 in the first half before pulling within 52-48 at halftime. Shaking off a cold shooting first half, the Thunder exploded for 42 third-quarter points and an 18-point lead heading into the fourth quarter.\n\n\r\n              Gilgeous-Alexander also had a game high eight assists for the Thunder, who are 28-5 and have won 17 of their last 18 regular-season games. He did not play in the fourth quarter.\n\n\r\n              Jalen Williams scored 18 points and Isaiah Hartenstein added 11 points and nine rebounds for Oklahoma City.\n\n\r\n              Amir Coffey led the Clippers with 26 points.\n\n\r\n              After shooting just 31% in the first half, the Thunder wound up at an even 50% for the game and added to their league-leading steal total with 11 takeaways.\n\n\r\n              Takeaways\r\n              Despite the slow start, the Thunder's depth eventually overwhelmed the Clippers, who were without James Harden, a late scratch.\n\n\r\n              Key moment\r\n              Williams hit a runner at the halftime buzzer to cut the Clippers lead to four, then scored the first six points of the second half to jumpstart a 23-5 run that put the Thunder in control.\n\n\r\n              Key stat\r\n              Norman Powell came into the game averaging a career high 24.3 points per game. He missed his first nine shots and didn’t get a basket until eight minutes remained, finishing with six points on 1-of-11 shooting including 0-for-5 from 3-point range.\n\n\r\n              Up next\r\n              The Thunder continue their homestand Friday night against the Knicks. The Clippers return home to host Atlanta on Saturday with the expected return of Kawhi Leonard.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997512.885088
}