{
  "game_id": "401810009",
  "espn_id": "401810009",
  "date": "Nov 02, 2025",
  "matchup": "PHX vs SA",
  "headline": "Booker scores 28 and Wembanyama has off night as Suns hand Spurs their first loss, 130-118",
  "body": "PHOENIX -- — Devin Booker scored 28 points, Grayson Allen and Ryan Dunn each added 17 and the hot-shooting Phoenix Suns handed Victor Wembanyama and the San Antonio Spurs their first loss, 130-118 on Sunday night.\n\n\r\n              Wembanyama had a rare off night, scoring nine points on 4-of-14 shooting while grabbing nine rebounds. It was the first time he was held to fewer than 10 points since Oct. 30, 2024, when Oklahoma City limited him to six.\n\n\r\n              The 7-foot-4 Wembanyama — who also had six turnovers — had averaged 30.2 points and 14.6 rebounds during San Antonio's 5-0 start.\n\n\r\n              The Suns made 14 of their first 20 3-pointers and led by 31 points in the third quarter before settling for a 102-78 advantage heading into the fourth.\n\n\r\n              The Spurs got within 111-97 with 6:24 left but the Suns scored the next 11 points.\n\n\r\n              Phoenix won back-to-back games for the first time this season. Booker shot 10 of 15 from the field and had 13 assists. The Suns' bench scored 50 points, led by Collin Gillespie's 15.\n\n\r\n              Stephon Castle led the Spurs with 26 points. Keldon Johnson scored 19 off the bench.\n\n\r\n              The Suns led for most of the first half and extended their advantage to 70-52 by halftime, shooting 11 of 15 from 3-point range.\n\n\r\n              Booker had 14 points and nine assists before the break. Wembanyama had just two points on 1-of-5 shooting.\n\n\r\n              The Suns were playing without guard Jalen Green (hamstring) and forward Dillon Brooks (core muscle strain). The Spurs were missing guard De'Aaron Fox (hamstring) and center Luke Kornet (sprained ankle).\n\n\r\n              Up next\r\n              Spurs: At the Los Angeles Lakers on Wednesday.\n\n\r\n              Suns: At the Golden State Warriors on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042549.3571699
}