{
  "game_id": "0022400817",
  "espn_id": "401705383",
  "date": "Feb 23, 2025",
  "matchup": "MIL vs. MIA",
  "headline": "Bucks finish strong to beat Heat 120-113 for 4th straight win",
  "body": "MILWAUKEE -- — Damian Lillard scored 28 points and Giannis Antetokounmpo had 23 points and 16 rebounds as the Milwaukee Bucks used a strong fourth quarter to rally past the Miami Heat 120-113 on Sunday for their fourth consecutive victory.\n\n\r\n              Lillard, who sat out Friday night's win over Washington with a hamstring strain, also had eight assists. Brook Lopez added 17 points, Kyle Kuzma and Gary Trent Jr. each scored 16, and Kevin Porter Jr. finished with 11.\n\n\r\n              Tyler Herro had 40 points, matching a season high, and 11 assists for Miami. Bam Adebayo scored 24, Andrew Wiggins had 20 and Kel’el Ware provided 12 points and 12 rebounds.\n\n\r\n              The Bucks, who trailed by as many as 14, outscored the Heat 35-20 in the fourth. After a 3-pointer by Herro tied the score at 109, the Bucks closed the game on an 11-4 run.\n\n\r\n              Takeaways\r\n              Heat: Herro, a Milwaukee native and winner of the NBA 3-point shooting competition during All-Star weekend, went just 1 of 5 from deep in the first half and finished 3 for 12.\n\n\r\n              Bucks: Lillard and Antetokounmpo, who were expected to be on playing-time restrictions due to injuries, played 38 and 32 minutes, respectively. Antetokounmpo played only 19 minutes Friday out of caution and because of foul trouble. \n\n\r\n              Key moment\r\n              After scoring seven consecutive points early in the fourth quarter, Porter threw an alley-oop to Jericho Sims for an easy dunk that put the Bucks in front 97-95 with 9:20 left, giving Milwaukee its first lead since early in the first quarter.\n\n\r\n              Key stat\r\n              Milwaukee's bench outscored Heat reserves 34-12.\n\n\r\n              Up next\r\n              The Heat play at Atlanta on Monday, and the Bucks visit Houston on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997831.0900412
}