{
  "game_id": "0021800459",
  "espn_id": "401071140",
  "date": "Dec 19, 2018",
  "matchup": "TOR vs. IND",
  "headline": "VanVleet hits go-ahead 3-pointer, Raptors beat Pacers 99-96",
  "body": "TORONTO --  After seven straight wins, Victor Oladipo and the Indiana Pacers suddenly are having trouble finishing.\n\nFred VanVleet hit a go-ahead 3-pointer with 25 seconds left and the Toronto Raptors rallied from a 17-point deficit to beat the Pacers 99-96 on Wednesday night.\n\nOne night after he missed a pair of free throws in the final 10 seconds and Indiana surrendered a tip-in at the buzzer in a 92-91 loss to lowly Cleveland that ended a season-long winning streak, Oladipo and the Pacers stumbled again.\n\nOladipo turned the ball over twice in the final minute Wednesday -- once when he failed to get across mid-court within eight seconds.\n\n\"I made a mistake, I guess,\" a downcast Oladipo said. \"I can't do nothing about it now except learn from it.\"\n\nKawhi Leonard scored 28 points, Pascal Siakam had 17 and Greg Monroe 13 as Toronto snapped a two-game losing streak. The Raptors, who have the best record in the NBA at 24-9, avoided their second three-game slump of the season.\n\n\"We did a good job of sticking in there and keeping our heads up\" Leonard said.\n\nVanVleet scored nine of his 11 points in the final quarter as Toronto won its 10th straight home meeting with the Pacers. Indiana has not won in Toronto since March 1, 2013.\n\nOladipo scored 20 points for the Pacers, who made only 5 of 18 shots in the fourth, scoring 11 points.\n\n\"Everything just went their way,\" Oladipo said.\n\nPacers coach Nate McMillan said turnovers were to blame for his team's late collapse. Indiana finished with 23 turnovers, including six by Oladipo and five from fellow guard Darren Collison.\n\n\"Tonight their pressure bothered us,\" McMillan said. \"Just poor execution down the stretch.\"\n\nBojan Bogdanovic scored 18 points, Myles Turner had 10 points and 14 rebounds and Domantas Sabonis had 12 points and 10 rebounds for Indiana.\n\nToronto shot 4 for 22 from 3-point range through the first three quarters, but made 3 of 8 in the fourth to avoid a season-worst performance from long range.\n\n\"It takes a lot of energy to play that bad then that good at the end,\" VanVleet said. \"It was a roller coaster of emotions and energy and effort.\"\n\nThe short-handed Raptors were without starting point guard Kyle Lowry, who missed his third straight game because of a sore left thigh, and center Serge Ibaka, who was inactive because of a sore right knee. VanVleet and Siakam returned to the starting lineup after missing Sunday's loss at Denver because of back soreness. Forward Norman Powell returned after a 21-game absence caused by a left shoulder injury.\n\nToronto trailed 88-75 less than two minutes into the fourth, but battled back to tie it 92-all on Siakam's driving layup at 4:12.\n\nOladipo restored Indiana's lead with a jump shot at 1:36, but VanVleet's long 3-pointer with 25 seconds to go put Toronto up one, 97-96.\n\nWith Indiana looking for a potential winning basket, Toronto's Danny Green forced Oladipo into a jump ball with less than three seconds remaining. The Raptors recovered the ball and Green sealed it with a pair of free throws.\n\nIndiana led 58-50 at halftime and was ahead 85-75 after three.\n\nNO FEAR\n\nVanVleet said he's never afraid to shoot, even when he starts 1 for 12 from the field, as he did Wednesday.\n\n\"If you don't want me to shoot, then I'll be on the bench,\" he said.\n\nBACK-TO-BACK\n\nIndiana lost on the second night of a back-to-back for the first time this season. The Pacers came in 5-0 in such games.\n\nTIP-INS\n\nPacers: Indiana has lost 13 of the last 16 regular-season meetings with Toronto. ... Thaddeus Young scored 11 points.\n\nRaptors: C Jonas Valanciunas (left thumb) missed his third straight game. Valanciunas had surgery Dec. 12 and is expected to miss four weeks. ... The Raptors played the first of six straight games against Eastern Conference opponents. ... Powell suffered a split lip in a collision with Sabonis in the first, but returned. He scored two points in 15 minutes.\n\nUP NEXT\n\nPacers: Visit Brooklyn on Friday night.\n\nRaptors: Host Cleveland on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994119.633308
}