{
  "game_id": "0022300587",
  "espn_id": "401585215",
  "date": "Jan 19, 2024",
  "matchup": "MIA vs. ATL",
  "headline": "Murray hits 3-pointer with 2 seconds left to lift Hawks past Heat, 109-108",
  "body": "MIAMI -- — Dejounte Murray has tons of respect for Udonis Haslem. That said, he wanted to have the last word on Haslem's special night in Miami.\n\n\r\n              Murray made a go-ahead 3-pointer with two seconds left — his second consecutive game with a winner on the final shot — and the Atlanta Hawks spoiled Haslem's jersey retirement night by beating the Miami Heat 109-108 on Friday.\n\n\r\n              “First of all, congratulations to Haslem,” said Murray, who led the Hawks with 22 points. “He's a real vet, real professional. I call him an OG. I just want to put that out there. But we wanted to spoil that night tonight. We wanted to get that win tonight ... so our mentality was win no matter what.”\n\n\r\n              On Wednesday night at home, Murray hit a 17-foot jumper as time expired to give Atlanta a 106-104 victory over Orlando. This time, the Hawks had to wait out one more possession to see if it would be back-to-back winners; the Heat never got a shot off.\n\n\r\n              Bogdan Bogdanovic added 17, Jalen Johnson had 15 and Saddiq Bey 14 for Atlanta, which trailed by four with 35 seconds left. Bogdanovic made a pair of free throws, the Hawks got a stop and then Murray connected.\n\n\r\n              “Can't say enough about Dejounte,” Hawks coach Quin Snyder said. “The shot, of course, that was a big-time play.”\n\n\r\n              Tyler Herro and Jimmy Butler each scored 25 points for the Heat, whose 22-game home winning streak against Southeast Division opponents — a run that dated to March 2021 — was snapped. Bam Adebayo added 21 points, Duncan Robinson had 14 and Caleb Martin 10.\n\n\r\n              On the final possession. Martin inbounded to Butler, who sent the ball back to Martin, but the buzzer sounded and Miami fell to 9-1 in divisional games. The Heat were the last team unbeaten in division play entering Friday.\n\n\r\n              “It was a poor play call and I'm disappointed in my call on that,” Heat coach Erik Spoelstra said. “I had something else in mind.”\n\n\r\n              The win was the 400th of Snyder's regular-season career.\n\n\r\n              Atlanta was without Trae Young, who was sidelined by an illness and missed his third game of a season where he’s averaging 27.2 points and 10.9 assists. The Hawks are 2-1 in those three games without their points and assists leader.\n\n\r\n              Miami used Kyle Lowry off the bench for the first time this season, moving Martin into the starting lineup and giving the Heat their 23rd starting combination in the season’s first 42 games.\n\n\r\n              Lowry had started in all 35 of his appearances this season.\n\n\r\n              Haslem’s jersey retirement came at halftime — leading to a longer-than-usual break for the Heat and Hawks. Typically, intermission is 15 minutes. On Friday, 36 minutes passed from the end of the second quarter to the start of the third quarter, with Haslem and Heat President Pat Riley speaking during the ceremony where the No. 40 banner was raised to the arena rafters.\n\n\r\n              “Nothing but gratitude right now,” Haslem said.\n\n\r\n              He made it very clear to his now-former teammates that a win on his special night was the absolute expectation. The Hawks decided to play spoiler anyway, extending a winning streak to three games for the first time since the first week of November thanks to Murray's heroics.\n\n\r\n              “He hit an extremely tough shot,” Spoelstra said.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Cleveland on Saturday night.\n\n\r\n              Heat: At Orlando on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995361.808597
}