{
  "game_id": "0021900361",
  "espn_id": "401161003",
  "date": "Dec 11, 2019",
  "matchup": "CHI vs. ATL",
  "headline": "LaVine scores 35 in three quarters, Bulls rout Hawks 136-102",
  "body": "CHICAGO --  Zach LaVine believes he needs to be a dependable fourth-quarter scorer for the Chicago Bulls to have success.\n\nAgainst Atlanta on Wednesday night, though, he was happy being a spectator.\n\nLaVine scored 35 points in three quarters, Lauri Markkanen added 22 and Chicago snapped a three-game losing streak with a 136-102 victory over the road-weary Hawks.\n\nLaVine, who sat out the final 14 minutes, was 12 for 15 from the field, including 7 for 7 from 3-point range.\n\n\"It feels good; you want to have wins like that,\" the 24-year-old said. \"It does good for the team and the body. I was just more excited about us just keeping the gas on and not have to come back in.\n\n\"We played a full game.\"\n\nWendell Carter Jr. had 11 points and 10 rebounds and rookie Coby White had 19 points.\n\nTrae Young had 15 points and 13 assists, Alex Len scored 17 points and rookie Cam Reddish added 16 for Atlanta, which has dropped two straight and 13 of 15.\n\nThe Hawks were coming off a 135-121 overtime loss in Miami on Tuesday night -- a game in which they led by six points with less than a minute remaining.\n\nAtlanta didn't arrive at its hotel until about 3 a.m.\n\n\"We've had our struggles on second nights of back-to-backs,\" Hawks coach Lloyd Pierce said. \"I thought our guys were competing. It was a great start to the game. I thought it was one of our better starts to the game ... then it's a tough stretch at the end of the first quarter, tough stretch at the end of the second quarter.\"\n\nChicago scored the final 10 points of the first half for a 66-52 lead at the break. LaVine led the way with 18 points on 7-for-9 shooting before the intermission.\n\nThe Bulls continued the surge and took their largest lead to that point, 93-69, on a layup by Carter with 4 1/2 minutes left in the third quarter.\n\nLaVine had 17 points in the third on 5-for-6 shooting, including 4 for 4 from long range, as Chicago took a 106-87 lead into the fourth.\n\n\"Zach's efficiency was unbelievable,\" Bulls coach Jim Boylen said. \"He's wants to be great and he's working.\"\n\nThe Bulls, who have blown big leads multiple times, put the game away with a 19-3 run early in the final quarter for a 125-93 lead. It was Chicago's biggest margin of victory since a 39-point win over Brooklyn in April 2017.\n\n\"We usually mess up with that,\" LaVine said. \"We finally figured it out today. I think we should have had a couple more wins where we did that.\n\n\"Finally, we were able to take a little bit of a break. We have to do more of that.\"\n\nTIP-INS\n\nHawks: Chicago native and former Bull Jabari Parker had 11 points and seven rebounds in 21 minutes.\n\nBulls: F Otto Porter will be sidelined an additional four-plus weeks after an MRI revealed a small fracture in his left foot. Porter, who hasn't played since Nov. 6, originally was diagnosed with a sprain before a follow-up MRI two weeks later showed a bone bruise. He'll be reassessed in four weeks. \"It's heartbreaking for him and, obviously, difficult for us,\" coach Jim Boylen said. \"He's a big wing and a 40% 3-point shooter. His experience, talent, versatility is something we need.\"\n\nBY THE NUMBERS\n\nThe announced crowd at the United Center was 15,084 two days following a crowd of 14,775 against the Toronto Raptors on Monday night.\n\nBefore Wednesday, the Bulls were averaging 18,747 per game, but the crowds have been shrinking of late.\n\nYOU GOTTA BELIEVE\n\nYoung's reaction with 59 seconds to go in Miami -- he swung his arms apart and yelled, \"It's over!\" -- received plenty of attention because the Heat scored the next 22 points. Young offered a mea culpa with mostly emojis on Twitter following the game, but coach Lloyd Pierce said he had no issue.\n\n\"You gotta love his confidence,\" Pierce said. \"Celebrate. There's nothing wrong with that. It wasn't in anyone's face. He's celebrating his team's success in a position to win on the road.\"\n\nUP NEXT\n\nHawks: Host the Indiana Pacers on Friday night.\n\nBulls: Host the Charlotte Hornets on Friday night in the first of back-to-back home games.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996357.008749
}