{
  "game_id": "0021900422",
  "espn_id": "401161064",
  "date": "Dec 20, 2019",
  "matchup": "DET @ BOS",
  "headline": "Tatum, Brown help Celtics rout Pistons 114-93",
  "body": "BOSTON --  Even with Gordon Hayward out of the lineup and Kemba Walker having a tough shooting night, the Boston Celtics had more than enough offense against the struggling Detroit Pistons.\n\nJaylen Brown and Jayson Tatum each scored 26 points in only three quarters of work, and the Celtics rolled past the Pistons for a 114-93 victory Friday.\n\n\"There's a lot of versatility in scoring with those two,\" coach Brad Stevens said. \"They can both put it on the ground. They can both get to the rim. They're both aggressive. They were really good tonight.\"\n\nThe short-handed Pistons helped the Celtics by turning the ball over 25 times. Boston also dominated inside, outscoring Detroit 58-34 in the paint and finishing with a 51-36 rebounding advantage.\n\nAll 12 Boston players in the lineup scored at least two points and all but Walker, who went 0 for 6 from the floor, hit at least a pair of field goals.\n\n\"It wasn't Kemba's night, but everybody on our team contributed to winning,\" Stevens said.\n\nWalker still had 11 assists and a pair of free throws. The Celtics finished 45 for 86 from the floor while playing without Hayward (sore left foot) and Marcus Smart (left eye infection).\n\nRookie Grant Williams added a career-high 18 points and Enes Kanter pulled down 18 rebounds. Rookie Tacko Fall finally made his home debut for the Celtics when Stevens answered fans' repeated chants of \"We want Tacko!\" midway through the fourth quarter.\n\n\"As the game was closing out, I knew I was getting in for sure,\" Fall said. \"Then it was just a matter of going out there and having some fun.\"\n\nThe Celtics had lots of fun, much of it at the expense of the Pistons. Detroit trailed just 28-26 entering the second quarter, but the Celtics started pulling away before halftime and continued throughout the third.\n\nThe Pistons were missing Blake Griffin (sore left knee), Luke Kennard (bilateral knee soreness) and Christian Wood (left knee bruise).\n\n\"Our biggest nemesis was our turnovers. You're not going to beat a junior high team turning the ball over 25 times for 32 points,\" coach Dwane Casey said. \"So that's the game right there.\"\n\nAndre Drummond had 12 points and 11 rebounds for Detroit. Thon Maker added 15 points and seven rebounds, and Derrick Rose finished with 14 points.\n\nThe Pistons lost for the fourth time in five games.\n\n\"We were in it, you know, in the first half,\" Maker said. \"We just have to continue to grow and take care of the ball like Coach always preaches. And we've just got to find a way to stay together and take care of the ball.\"\n\nTACKO NIGHT\n\nAs Boston continued to expand the lead in the third quarter, some Celtics fans started chanting \"We want Tacko!\" -- hoping for their first look at the 7-foot-5 center who had played in just one game this season.\n\nThey got their wish with 4:31 left in the fourth. Fans roared when Fall got up from the bench and removed his warmups, and then replaced Kanter at center.\n\nHe quickly committed a foul -- although the fans were certain it was a clean block.\n\nFans altered the chant to \"M-V-P!\" when Fall went to the foul line with 52 seconds left and leaped to their feet when he put back an offense rebound with a dunk with 32 seconds to go.\n\nFall finished with five points and two rebounds.\n\nPULLING AWAY\n\nThe Pistons trimmed a 14-point lead down to six late in the second quarter, but Boston quickly regained control.\n\nBrown hit back-to-back 3-pointers, then another from beyond the arc while drawing a foul with 1.1 seconds left in the second quarter. Brown hit the free throw to help the Celtics to a 60-48 halftime lead.\n\nBoston kept up the pace in the third quarter, outscoring Detroit 31-21 while taking advantage of seven more turnovers by the Pistons.\n\nTIP-INS\n\nPistons: Griffin was out for the second time in three games. ... Detroit came close to matching its season high of 29 turnovers from Oct. 28 against Indiana.\n\nCeltics: Kanter hadn't pulled down more than 13 rebounds in his first season with Boston. ... Williams' previous scoring high was 10 points against the Knicks on Nov. 1. ... Stevens said an MRI of Hayward's left foot came back clean. Hayward missed his second straight game and was replaced in the starting lineup by Semi Ojele.\n\nUP NEXT\n\nPistons: Host the Chicago Bulls on Saturday night.\n\nCeltics: Host the Charlotte Hornets on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996289.810148
}