{
  "game_id": "0021600530",
  "espn_id": "400899951",
  "date": "Jan 04, 2017",
  "matchup": "ORL vs. ATL",
  "headline": "Atlanta pulls away late, beats Orlando for 4th straight win",
  "body": "ORLANDO, Fla. -- The Atlanta Hawks hadn't been able to shake an embarrassing home defeat to Orlando on Dec. 13, when Serge Ibaka and the Magic burned them again and again from 3-point range.\nThis time, Atlanta tightened up on Ibaka and the rest of Orlando's deep shooters, riding a big fourth-quarter run to a 111-92 victory over Orlando on Wednesday night.\nIbaka had 29 points in the first meeting but scored just nine points and was 0 for 4 from 3-point range Wednesday night.\n\"It was important, because they put it on us pretty bad,\" said Atlanta forward Paul Millsap, who had a strong second half and finished with 16 points. \"The point of emphasis was not to let them score 130 points, so defense was definitely a point of emphasis. I think we came out and accepted the challenge.\"\nIn the first meeting, Orlando won 131-120 by making 15 3-pointers. On Wednesday, the Magic converted just nine 3-pointers, with a few coming late as they attempted to play catch up.\n\"We're all aware of what they did in the last game,\" said Hawks coach Mike Budenholzer, whose team has won four straight and nine of 13. \"You go out and make them take more tough shots, more contested shots.\"\nAtlanta led by 15 after three quarters, but then Orlando used a 14-2 run to pull within 88-84 with 7:56 left. The Hawks responded with a 21-5 spurt, including back-to-back 3s by Kent Bazemore and Millsap, that put the game out of reach.\nThe Hawks were balanced on offense with six players in double figures. Point guard Dennis Schroder led the way with 18 points while Dwight Howard had 13 points and 12 rebounds. Bazemore had 17 points.\nAtlanta shot 54 percent from the field and 53 percent from beyond the arc.\n\"From the jump, we seemed like we didn't execute completely on the defensive end,\" said Magic forward Aaron Gordon, who tied for a team-high 15 points. \"It kind of bled into our offense and throughout the whole game.\"\nPAYTON'S PLACE\nOrlando point guard Elfrid Payton got his starting position back Wednesday night after losing it 20 games ago to D.J. Augustin.\nIt seems Magic coach Frank Vogel was looking to send a message to his point guard, and he believes he got through.\n\"I've been challenging him to raise his game to get himself back in the starting lineup and I thought in the New York game he had one of his best games of the year defensively where needed him most,\" Vogel said.\nTIP-INS\nHawks: Atlanta took a 6-0 lead on three consecutive drives to the basket in the first, prompting Orlando coach Frank Vogel to call a timeout 2:13 into the game. ... Howard began his career with the Magic from 2004-2012 and heard it from the fans in the Amway Center each time he touched the ball. This was his first return to Orlando as a member of the Hawks.\nMagic: Fournier, the Magic's leading scorer, returned after missing the previous five games with a bruised right heel. Fournier, however, did not start. Jodie Meeks, who had a season-high 23 points Monday in a win over the Knicks, remained in the starting lineup at shooting guard.\nUP NEXT\nHawks: Continue their road swing in New Orleans against the Pelicans on Thursday night. It's their first meeting of the season.\nMagic: Will host Houston on Friday night before beginning a six-game West Coast trip. The Magic will not return to Amway Center until Jan. 20.",
  "source": "espn_api",
  "crawled_at": 1764995854.034731
}