{
  "game_id": "0022200705",
  "espn_id": "401468860",
  "date": "Jan 22, 2023",
  "matchup": "LAL @ POR",
  "headline": "James scores 37, Lakers rally past Trail Blazers 121-112",
  "body": "PORTLAND, Ore. -- — LeBron James said the Lakers had a choice when trailing by 25 points at halftime against the Trail Blazers. \n\n\r\n              “I guess it’s only one or two ways, you can either go out and you can lay down and get ready for the next game or you can see what happens in the third quarter, make a game of it,\" James said. “And for us as competitors, and our team and our makeup this year, we’re not a lay-down team. That's just not the makeup of our club.”\n\n\r\n              James finished with 37 points and 11 rebounds, and the Lakers rallied in the second half to beat the Portland Trail Blazers 121-112 on Sunday night. \n\n\r\n              Thomas Bryant added 31 points and 14 rebounds for the Lakers in the comeback, tied for second-biggest halftime deficit that the team has erased for a win in franchise history. \n\n\r\n              Anfernee Simons had 31 points for the Blazers, who have lost three straight. Damian Lillard added 24 points and 10 assists. \n\n\r\n              The Lakers outscored Portland 40-20 to cut the margin in the third quarter. Troy Brown Jr. made a 3-pointer that got the Lakers within 97-95, before they took the lead on Bryant's 3 with 7:54 left. \n\n\r\n              James made a pair of free throws with 4:36 left that pushed the Lakers' lead to 107-103. After Lillard made free throws, Dennis Schroder's 3-pointer put Los Angeles up by five again. \n\n\r\n              Bryant's dunk gave the Lakers a 114-107 lead with 2:23 left and they held off Portland for the win. \n\n\r\n              Portland was struggling, with wins in just two of the last nine games. The Blazers were coming off a 105-95 loss to the 76ers on Thursday.\n\n\r\n              “Right now, we're just not getting it done,” Lillard said when asked if the Blazers should try to deal before the trade deadline. “I do want to win. I don't think it's a secret that I want to win. I think we've got to do whatever we need to do to be in a position to win.\"\n\n\r\n              The Lakers have likewise struggled this season because of injuries, notably to Anthony Davis, who is currently dealing with a foot injury that has kept him out for 19 games. \n\n\r\n              James was questionable going into the game with a sore ankle but played. James is closing in on Kareem Abdul-Jabbar’s NBA scoring record of 38,387 points. James is 233 points away from matching the record after Sunday's game. \n\n\r\n              Despite the rivalry, the mood was somber at times at the Moda Center following the death on Saturday of longtime broadcaster Bill Schonely who coined the expression “Rip City!” Schonely was 93. \n\n\r\n              Schonely called Blazers games for nearly 30 years, starting the team's first season in 1970 and including the team's championship run in 1977. Following his broadcasting career, he was an ambassador for the team until his retirement last year. \n\n\r\n              The Lakers jumped out to an 18-4 lead early, but Portland caught up, closing to 26-24 on Nassir Little's 3-pointer before the end of the first quarter.\n\n\r\n              Simons' 3-pointer gave the Blazers a 39-38 lead. Lillard hit a nearly half-court shot to push the lead to 68-46, and the Blazers led 71-46 at halftime. Portland outscored the Los Angeles 35-13 in the second quarter alone. \n\n\r\n              Beverley and James hit back-to-back layups to get the Lakers within 81-74 and cap a 16-2 Los Angeles run. A driving layup from James made it even closer at 88-82. \n\n\r\n              “We’ve been through it a lot. And I just want to try to continue to keep improving, throughout late games and one-possession games, two-possession games when we’re down late,\" James said. “And tonight we did a good job of being able to execute defensively and offensively.”\n\n\r\n              It was the third meeting between the Lakers and the Blazers this season. They split the first two. \n\n\r\n              TIP INS\n\n\r\n              Lakers: Davis went through a full-contact scrimmage with the team's “stay ready” group on Saturday. Davis has missed 19 games with a right foot stress injury and is easing his way back. Coach Darvin Hamm said Davis “looked phenomenal.” ... James was questionable going into the game with a sore ankle but played. ... The Lakers' 13 second quarter points were a season low. \n\n\r\n              Trail Blazers: Gary Payton II, who missed the last game with a sore calf, played. ... It was the second of the six-game homestand. ... The Blazers were also mourning the death last week of cameraman John Curry, who had been with the team for 39 years. \n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host the Los Angeles Clippers on Tuesday.\n\n\r\n              Trail Blazers: Host the Spurs on Monday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994125.612948
}