{
  "game_id": "0022300906",
  "espn_id": "401585534",
  "date": "Mar 07, 2024",
  "matchup": "DEN vs. BOS",
  "headline": "Nikola Jokic's triple-double helps Nuggets to season sweep of Celtics with 115-109 win",
  "body": "DENVER -- — Sometimes, Nikola Jokic's triple-double is as meaningful as it is magical.\n\n\r\n              That was certainly the case Thursday night when Jokic recorded his 20th triple-double of the season and the Denver Nuggets withstood a furious fourth-quarter surge by Boston to beat the Celtics 115-109.\n\n\r\n              That gave the reigning NBA champs a sweep of their season series with the Eastern Conference leaders.\n\n\r\n              Jokic had 32 points, 12 rebounds and 11 assists, several of them on alley-oops to Aaron Gordon, who had 16 points on seven dunks and a running hook.\n\n\r\n              Jamal Murray added 19 points and eight assists as the Nuggets improved to 7-1 since the All-Star break.\n\n\r\n              It was Jokic's 30th career 30-point triple-double.\n\n\r\n              “He’s just an incredible basketball player,” Celtics center Kristaps Porzingis said. \"Some things I learned from him today, actually. He’s just so smart, so crafty, so many things you don’t see that he does on the floor that helps that team win. It’s incredible. Whenever you overhelp just a little bit, he’ll find Gordon, he’ll find all these guys. It speaks to how valuable he is for them.”\n\n\r\n              Asked what exactly he had learned, Porzingis said, “a couple of tricks he does, I'll leave it at that.”\n\n\r\n              Maybe some of that sorcery Porzingis was referencing had to do with the Jokic-Gordon alley-oop game that's becoming as big a part of Denver's crunch-time arsenal as the Jokic-Murray pick-and-roll.\n\n\r\n              Gordon's best dunk came off a missed layup by Jokic with two minutes remaining. Gordon corralled the rebound with his right hand and windmilled it through the basket for a 109-103 lead.\n\n\r\n              “It was a bad miss,\" Jokic said, “but a great dunk.”\n\n\r\n              The two teamed up for a game-sealing alley-oop with 20 seconds left after Jayson Tatum's 3-pointer for the lead with 40 seconds remaining rimmed out.\n\n\r\n              Jaylen Brown scored a season-high 41 points and had 14 rebounds for the Celtics, who hadn't lost consecutive games since early November. But Brown was just 7 of 14 from the foul line.\n\n\r\n              “Maybe it's the elevation,” Brown said. “I felt fine shooting the ball.”\n\n\r\n              Boston missed nine free throws overall, while the Nuggets missed just one of 22 foul shots.\n\n\r\n              Porzingis added 24 points and 12 rebounds for Boston, and Tatum had 15 on a tough shooting night.\n\n\r\n              The Nuggets' bench outscored Boston's reserves 28-10, led by Peyton Watson's 11 points and stellar perimeter defense.\n\n\r\n              Both teams were coming off losses that ended long winning streaks. The Celtics' 105-104 defeat at Cleveland on Tuesday snapped an 11-game run, and Denver's 117-107 overtime loss to Phoenix halted the Nuggets' six-game surge.\n\n\r\n              If these teams are barreling toward a collision in the NBA Finals in June, this was a tantalizing preview. Both coaches viewed the showdown as something of a measuring stick heading into the home stretch, with Denver's Michael Malone noting Boston's NBA-best record and Celtics coach Joe Mazzulla calling the reigning champs the league's benchmark.\n\n\r\n              The game was everything expected of two prime contenders. \n\n\r\n              Denver's dynamic duo each had buzzer-beaters in the first half, with Murray sinking a 30-footer to end the first quarter and Jokic banking in a 12-foot shot with Porzingis in his face that gave Denver a 62-54 lead at halftime.\n\n\r\n              Boston quickly erased that deficit with a pair of 3s from Porzingis and a layup from Brown after the break, however.\n\n\r\n              “That team never goes away,” Malone said.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visit Phoenix on Saturday night.\n\n\r\n              Nuggets: Host Utah on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996751.7511628
}