{
  "game_id": "0021600618",
  "espn_id": "400900039",
  "date": "Jan 16, 2017",
  "matchup": "CHA @ BOS",
  "headline": "Thomas' big 4th quarter carries Celtics past Hornets 108-98",
  "body": "BOSTON -- Isaiah Thomas is even starting to amaze some of his teammates.\nThomas scored 17 of his 35 points in the fourth quarter, and the surging Boston Celtics beat the Charlotte Hornets 108-98 on Monday night for their ninth victory in 11games.\nIt was Thomas' 25th straight game with 20 or more points. He's been putting up big final quarters of late -- scoring 20 or more three times this season. No other NBA player had done it more than once entering Monday.\n\"Yeah, he's a special, special player, obviously,\" Boston forward Kelly Olynyk said. \"I don't know if there's another person in the world doing what he's doing. It's unfathomable to sit there and watch every night.\"\nAl Horford had 22 points, while Olynyk and Jae Crowder added 15 apiece for Boston, which has won all three meetings with Charlotte this season.\nBut it was Thomas' late-game performance that kept the Celtics rolling. He credited his teammates for setting him up well in the fourth.\n\"I'm in a really good place right now,\" he said. \"My teammates put me in a position to be me and that's all I can say.\"\nHe even heard chants of \"MVP! MVP!\" late in the game.\n\"They're pretty cool. It just doesn't seem real for them to be chanting MVP to me in (TD) Garden,\" he said. \"It's a feeling I can't explain.\"\nKemba Walker scored 24 points and Marvin Williams had 21 for the Hornets, who lost their fifth straight -- all on the road.\n\"We had things in to get the ball out of his hands, but the way they played, the stuff that they usually go to late, they didn't get to,\" Charlotte coach Steve Clifford said of trying to stop Thomas. \"He made some terrific plays. He's a terrific offensive player.\"\nThomas scored 13 straight points, pushing Boston ahead 93-83 with his 3-pointer from the left wing with 7 1/2 minutes left.\n\"He's been playing as well as anyone in our league,\" Walker said of the 5-foot-9 Thomas. \"He's playing with great confidence, making the plays for his team to win games. So, he's been great.\"\nBoston led 80-71 entering the final period.\nTIP-INS\nHornets: Entered averaging the second-fewest turnovers in the league at 12.1 per game. They had 11.\nCeltics: G Avery Bradley returned after missing four straight games because of a strained right Achilles. He scored five points on 2-of-9 shooting. ... Thomas scored a team-record 29 points in the final quarter of a victory against Miami on Dec. 30 to finish with 52.\nINSPIRING WORDS\nCeltics rookie Jaylen Brown addressed the crowd before the game on Martin Luther King Jr. Day. Without notes, he quoted King in saying: \"The day our lives begin to end, the day we become silent about things that matter.\"\nNICE CATCH\nNew England Patriots running back LeGarrette Blount sat courtside behind a basket and made a two-handed grab of a ball flying out of bounds.\nSPORTS TRANSITION\nIt was the nightcap of a hockey/basketball doubleheader, and 6-foot-4 Celtics guard Marcus Smart entered TD Garden wearing a winter jacket and hat. He paused and stood seemingly unnoticed as a group of youngsters and parents -- most wearing Boston Bruins colors -- walked down a hall to meet some of the hockey players.\nSmart smiled when a media member said, \"I don't think anyone noticed you.\"\nLater, 6-foot-9 Bruins defenseman Zdeno Chara headed past folks walking in for the basketball game.\nUP NEXT\nHornets: Host the Portland Trail Blazers on Wednesday night in the first of five straight at home.\nCeltics: At home against the New York Knicks on Wednesday. It's the third meeting between the teams this season, with Boston winning the most recent one at Madison Square Garden on Christmas.",
  "source": "espn_api",
  "crawled_at": 1764995508.3478668
}