{
  "game_id": "0021500714",
  "espn_id": "400828601",
  "date": "Jan 31, 2016",
  "matchup": "CHI @ LAC",
  "headline": "Clippers blow out Bulls 120-93 for 4th straight victory",
  "body": "LOS ANGELES -- Don't mess with the Clippers' bench.\nTheir reserves have been dominant in Blake Griffin's absence, with Jamal Crawford leading the way with 26 points in a 120-93 victory over the Chicago Bulls on Sunday.\nIn the Clippers' past four games -- all wins -- the reserves have outscored the opponent's bench 184-78. Their winning streak has coincided with Griffin being out at least a month after breaking his right hand while punching the team's assistant equipment manager.\n\"Our bench has been better than fantastic,\" Los Angeles coach Doc Rivers said. \"You could see Jamal had it going and they were trying to get it to him every single time. That whole group, they don't worry about misses anymore. I want them to play free, fast and aggressive.\"\n\nJ.J. Redick added 21 points and DeAndre Jordan had 17 points and 20 rebounds for the Clippers, who improved to 15-3 without Griffin.\n\"It was a collective effort, but Jamal went on a killing spree,\" said Chris Paul, who had 19 points and seven assists. \"That team right there, they don't go away. They just keep on coming and we took all their punches.\"\nThe Clippers had three double-digit scorers off the bench a game after their reserves scored 56 points in a 105-93 win over the Lakers. Austin Rivers added 16 and Wesley Johnson had 11. The Clippers made 17 3-pointers, and Rivers led the way with five.\nJimmy Butler scored 23 points, Derrick Rose added 20 and Pau Gasol had 15 points and 14 rebounds for the Bulls, who never made a run in the fourth. They've lost four of six and dropped to 10-11 on the road.\n\"We're trying to play our best ball up until the All-Star break,\" Rose said. \"Give ourselves a good taste in our mouth and when we come back, we come back with a sense of urgency, giving that effort every game.\"\nCrawford scored the Clippers' first eight points of the fourth, pushing their lead to 92-75. He had 12 points total in the quarter.\n\"We weren't guarding anybody,\" Butler said. \"When we're not guarding anybody we're not very tough.\"\nRose and Butler were held to four points each in the third.\nLos Angeles pulled away in the third after clinging to a four-point lead at the start of the quarter. Led by Redick's 11 points, the Clippers built the game's first double-digit lead. In one stretch, they outscored the Bulls 15-9 despite going nearly 2 1/2 minutes without a field goal to take an 84-73 lead. During that spurt, the Clippers made 7 of 8 free throws and got defensive stops.\nTIP-INS\nBulls: Butler's first basket of the game pushed him over 4,000 career points. ... G Kirk Hinrich was scoreless on two shots in his return after missing six games with a left quad contusion. ... G-F Mike Dunleavy is getting closer to playing after back surgery that has kept him out since the season began. He has resumed practicing and will likely return after the All-Star break.\nClippers: Griffin wasn't at Staples Center for the second straight game and neither was staff member Matias Testi, the team's way of minimizing distractions surrounding their altercation in Toronto last weekend. ... F Jeff Ayres, who has had two points and two blocks in two games since his debut last weekend, will be signed to another 10-day contract. ... The series is even at 1-1 after the Clippers lost 83-80 on the road Dec. 10.\nHACK-A-DJ\nThe Bulls employed a familiar tactic, fouling Jordan down the stretch in an attempt to take advantage of his 42.1 percent free-throw shooting. Jordan hit 5 of 8 in the game, including 3 of 4 in the third.\n\"That takes a strategy away at least momentarily,\" Rivers said. \"It'll be back the next game, don't worry.\"\nBulls coach Fred Hoiberg said, \"We did it to try and stay in it, but DeAndre was in a pretty good rhythm and really had his stroke going.\"\nPAINT POINTS\nAbout the only area the Bulls dominated was in the paint, where they owned a 56-36 edge.\n\"We went into the locker room with a deficit but easily could have had the lead,\" Hoiberg said. \"In the second half it just snowballed. They got comfortable. Our shots weren't falling and it affected us at the other end. You've got to have that grit, that toughness all the way through, and we didn't have it at the end.\"\nUP NEXT\nBulls: At Utah on Monday in the third game of a seven-game trip.\nClippers: Host Minnesota on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993917.943102
}