{
  "game_id": "0021700324",
  "espn_id": "400975075",
  "date": "Dec 01, 2017",
  "matchup": "MIN @ OKC",
  "headline": "George, Adams lead Thunder past Timberwolves 111-107",
  "body": "OKLAHOMA CITY --  It took a scoring burst by Paul George and a perfect performance by Steven Adams for the Oklahoma City Thunder to finally win a close game.\n\nGeorge had 35 points and nine assists and Adams scored a career-high 27 points on perfect shooting from the field and the free throw line to help the Thunder beat the Minnesota Timberwolves 111-107 on Friday night.\n\nIt was Oklahoma City's first win by fewer than nine points this season, and all but two of the team's 12 losses this season have been by nine or fewer points. This time, the Thunder made the tweaks that coach Billy Donovan has been preaching about all season.\n\n\"I think we checked all the boxes down the stretch,\" George said. \"Played great team defense to close the game out. We made our free throws. We just had a winning mentality, and it resulted in a win for us.\"\n\nAdams made all 11 of his shots from the field and all five of his free throws.\n\n\"He's a huge weapon that we have,\" George said. \"More times than not, we find him. We've just got to keep finding him throughout the game.\"\n\nRussell Westbrook added 15 points, 14 assists and nine rebounds for Oklahoma City.\n\nThe Thunder shot 51.9 percent from the field and outrebounded the Timberwolves 42-26 to snap a three-game losing streak.\n\n\"You can't give a team like that two or three shots at a time, so there was times in the second half that I thought we defended OK, but then gave them a second or third shot,\" Minnesota coach Tom Thibodeau said. \"When you do that for great players, you're going to pay for it, and we did.\"\n\nKarl-Anthony Towns and Andrew Wiggins scored 23 points each and Jimmy Butler added 22 for the Timberwolves, who shot 51.3 percent in the loss.\n\nMinnesota won the previous two meetings this season by a combined five points.\n\nOklahoma City posted its highest-scoring quarter of the season to lead 42-33 at the end of the first.\n\nThe Thunder struggled to create distance in the fourth quarter until a 3-pointer by George put Oklahoma City ahead 97-86. A bounce pass by Westbrook led to a dunk by Jerami Grant that gave the Thunder a 101-90 lead.\n\nWiggins made a 3-pointer to cut Oklahoma City's lead to 101-96, and Towns scored in close to make it a three-point game with just over 4 minutes to play.\n\nAdams put back a missed 3-pointer by Westbrook with 26.2 seconds remaining to put the Thunder up 107-102. Wiggins made a quick 3, but George made two free throws with 5.2 seconds left to clinch the win.\n\n\"They played very well,\" Thibodeau said of the Thunder. \"They played hard. They played together.\"\n\nTIP-INS\n\nTimberwolves: Towns knocked heads with Thunder guard Andre Roberson in the first quarter and left the court area for treatment. He got stitches for a cut above his right eye and returned to the game in the second quarter. ... G Jeff Teague played after missing four games with a sore right Achilles. He finished with 11 points and 10 assists.\n\nThunder: Roberson got stitches above his left eye after the collision with Towns and returned later in the first quarter. ... Thunder had just one turnover in the first quarter. ... Largest lead was 21 points in the second quarter.\n\nSTAT LINES\n\nOklahoma City made 21 of 22 free throws. George led the way by making 11 of 11. Westbrook was the only Thunder player to miss a free throw, and he went 3 for 4.\n\nOFF NIGHT\n\nWestbrook made 6 of 21 shots and missed all eight of his 3-point attempts.\n\nQUOTABLE\n\nThibodeau on Adams: \"We have to match his physicality. He's in there banging. He's long. Tough. You've got to match it.\"\n\nUP NEXT\n\nTimberwolves: Host the Los Angeles Clippers on Sunday.\n\nThunder: Host the San Antonio Spurs on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball .",
  "source": "espn_api",
  "crawled_at": 1764992673.012514
}