{
  "game_id": "0021900551",
  "espn_id": "401161193",
  "date": "Jan 07, 2020",
  "matchup": "MEM vs. MIN",
  "headline": "Brooks, Morant lead late surge as Grizzlies beat T'wolves",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies youth movement was supposed to mean a rebuilding year. But, right now, they are sitting on the edge of the final playoff spot in the Western Conference.\n\nDillon Brooks scored 28 points, Ja Morant added 25 and the Memphis rallied in the fourth quarter for a 119-112 victory over the Minnesota Timberwolves on Tuesday night. The win left the Grizzlies in the ninth spot, a half-game behind the San Antonio Spurs.\n\nGranted its early -- approaching the midway point of the season -- but most observers never expected Memphis, one of the league's youngest teams, to be in this position. But the win over Minnesota was the Grizzlies third straight and 10th in the last 16.\n\n\"We're going to take it one game at a time,\" said forward Jae Crowder, who had 14 points and eight rebounds. \"A young team, I don't want to get them too excited. Obviously, we are right where we need to be to gain ground in the playoffs.\"\n\nJaren Jackson Jr finished with 21 points, including a trio of 3-pointers in fourth after entering the period 1 for 7 over the first three quarters. He also recorded three blocks.\n\nJackson, Morant and Brooks were the fourth-quarter catalysts as Memphis escaped an 8-point deficit in the final 7-plus minutes. Jackson had 11 down the stretch, while Brooks and Morant scored 10. The three were a combined 13 of 20 as Memphis overtook Minnesota outscoring the Wolves 37-28 in the fourth.\n\n\"Obviously, a great comeback win for us,\" Memphis coach Taylor Jenkins said, later adding: \"We're just continuing to remind them of what we've built in the last month or so. It's a credit to them.\"\n\nRookie Jarrett Culver, the sixth overall pick in last summer's draft, led the Timberwolves with a career-high 24 points, converting 8 of 11 shots, 3 of 5 from outside the arc. Jeff Teague scored 18 points and handed out six assists for Minnesota, while Robert Covington scored 17 points. Andrew Wiggins had 15 points.\n\n\"They had a couple (of players) to get hot, and they spaced out the floor very well,\" Culver said. \"We still played hard. I feel like we missed a couple of rebounds that we could've gotten, but they made the plays at the end.\"\n\nMemphis was able to grab five offensive rebounds in the final frame, leading to nine second-chance Grizzlies points. On two occasions as Memphis erased the lead, Morant and De'Anthony Melton tipped in their own misses.\n\n\"We've just got to do a better job of getting rebounds,\" Saunders said acknowledging the fourth-quarter offensive rebounds were a problem.\n\nThe teams were still tied at the midway point of the fourth. At that point, Memphis built a six-point buffer behind baskets from Morant and a layup from Melton.\n\nCovington's 3-point play with 1:06 left pulled the Timberwolves within 113-112, but Minnesota could never catch Memphis the rest of the way, leaving the Grizzlies on the edge of the playoff conversation.\n\n\"Our team was counted out,\" Crowder said, \"and we're surprising people with wins here late. I just feel like once you take it one game at a time, you block out all the noise, you block out where you're at in the standings, you find yourself not looking as much and focusing on that one game.\"\n\nTIP-INS\n\nTimberwolves: C. Karl-Anthony Towns missed his 11th straight game with left knee soreness. Asked if Towns was close, Saunders said: \"That would be the hope. He's progressing.\" ... After a horrendous 11-game losing streak in December, the `Wolves had won four of their last six before Tuesday's loss. .Culver's previous career-high was 21 against Brooklyn on Dec. 30.\n\nGrizzlies: Are now 10-0 when Brooks scores at least 20 points. ... Memphis trailed by 14 in the first half, marking the Grizzlies biggest rally in a victory this season. It was their third double-digit comeback win. ... Morant' 10 fourth-quarter points, marked the eighth time this season he's scored at least 10 in the final frame.\n\nFINAL WORD\n\n\"There's going to be doubters. There's going to be people who hop on once (we're) up. Everybody knows that. We're just focused on trying to get better.\" -- Ja Morant on the Grizzlies play lately.\n\nUP NEXT\n\nTimberwolves: Entertain Portland on Thursday\n\nGrizzlies: Host San Antonio on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995720.487602
}