{
  "game_id": "0022400222",
  "espn_id": "401704788",
  "date": "Nov 13, 2024",
  "matchup": "HOU vs. LAC",
  "headline": "Jalen Green scores 21 points in the Rockets' 111-103 victory over the Clippers",
  "body": "HOUSTON -- — Jalen Green had 21 points and Amen Thompson and Tari Eason added 18 each to lead the Houston Rockets to a 111-103 victory over the Los Angeles Clippers on Wednesday night in the opener of a two-game set.\n\n\r\n              The Rockets trailed by 11 early but had taken a five-point lead by halftime. They used a huge run at the end of the third quarter and the beginning of the fourth to push the lead to 19.\n\n\r\n              The Clippers used a 9-2 run to cut the lead to four with about 90 seconds remaining, but Alperen Sengun had a dunk followed by a monster block on the other end to secure Houston’s third straight victory.\n\n\r\n              James Harden had 19 points for the Clippers, who lost a second straight after winning four in a row. He was 3 of 4 on 3-pointers in the first quarter but missed all four attempts after that. He moved within three of tying Ray Allen (2,973) for second-most career 3-pointers in NBA history behind Stephen Curry (3.779). \n\n\r\n              Takeaways \r\n              Clippers: Los Angeles has struggled defensively in the last two games and would certainly benefit from the return of Kawhi Leonard, who hasn’t played this season while rehabilitating his right knee. He didn’t make this road trip and it’s unclear when he’ll make his season debut.\n\n\r\n              Rockets: Eason and Thompson continue to give Houston a boost off the bench. Eason has scored in double figures in five straight games and Thompson has done so in three of the last four.\n\n\r\n              Key moment \r\n              The Rockets led by two late in the third quarter before using a 19-2 run to push the lead to 98-79 with about 10 minutes remaining. Eason made eight points in that stretch.\n\n\r\n              Key stat\r\n              The Rockets got 18 offensive rebounds to 10 by the Clippers and to help them to a 19-6 advantage on second-chance points. \n\n\r\n              Up next \r\n              The teams meet again in Houston on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997412.8267798
}