{
  "game_id": "0021600163",
  "espn_id": "400899613",
  "date": "Nov 16, 2016",
  "matchup": "MIL @ ATL",
  "headline": "Millsap, Muscala help Hawks hold off Bucks",
  "body": "ATLANTA --  Paul Millsap was proud of how well the Atlanta Hawks adjusted with Dwight Howard and Thabo Sefolosha unable to play because of injuries.\n\n\"We have a deep team,\" he said. \"It says a lot about our bench and what they bring, that they came in and did a great job and really set the tone for us, especially in the second quarter.\"\n\nMillsap scored 21 points, Mike Muscala added 16 and the Hawks won their sixth straight game, a 107-100 victory over the Milwaukee Bucks on Wednesday night.\n\nGiannis Antetokounmpo had 26 points and 15 rebounds, and Jabari Parker scored 15 of his 23 points in the third quarter for Milwaukee.\n\nMuscala started in place of Howard, who was sidelined with a left quadriceps contusion. The Hawks improved to 6-1 at home and tied Cleveland for the best record in the Eastern Conference at 9-2.\n\nAtlanta's bench, led by 13 points from Tim Hardaway Jr., outscored the Bucks' 35-25.\n\n\"The defense was amazing,\" Millsap said. \"The second group came in and moved the basketball. We played how we're supposed to play.\"\n\nThe Bucks, who have lost three of four, pulled within four points on Antetokounmpo's dunk with 37 seconds remaining, but Millsap hit a layup on the next possession to make it 104-98.\n\nMilwaukee ended the first quarter with a 26-21 lead but missed their next 11 shots and didn't score until the 5:50 mark of the second. They were outscored 31-9 in the period and went 3 for 27 from the field.\n\nAtlanta took its biggest lead at 24 points on Dennis Schroder's 3-pointer early in the third, but Milwaukee scored 35 points in the third quarter and pulled within six with 9:06 remaining on Mirza Teletovic's third 3 of the period.\n\n\"It was definitely a character game for a young team to come back and put themselves in that position on the road,\" Bucks coach Jason Kidd said. \"With 4 minutes left, it was anybody's ballgame. Again, tip your hat to Atlanta. They made the shots and got the stops when they had to.\"\n\nAntetokounmpo's layup cut the lead to three a couple of possessions later at the 6:24 mark. That was as close as the Bucks could get.\n\n\"Our backs were on the wall, so we had no other choice but to be aggressive if we wanted to try to make it close,\" Parker said. \"Those are still good habits to have leading into the next game. But we know from our mistakes that we can't play the first half like we did.\"\n\nThe Hawks improved to 8-1 when leading after three quarters.\n\nSchroder and Kent Bazemore scored 12 points each for Atlanta.\n\nNEED THE REST\n\nHoward was injured in the third quarter Tuesday at Miami, banging knees with Heat center Hassan Whiteside. He did not return and was unable to watch Wednesday's game from the bench.\n\nHoward, the active career NBA leader in double-doubles, is averaging 14.8 points and 12.3 rebounds. The eight-time All-Star in his first season with Atlanta.\n\nSefolosha, a reserve forward and the team's best defender, did not play because of a strained right hamstring.\n\nHis and Howard's absence helped the Bucks outscore Atlanta 50-28 in the paint.\n\nSHOWING POTENTIAL\n\nDuring a 6-minute stretch of Atlanta's 19-0 run in the second, rookie forward Taurean Prince was the catalyst. He blocked two shots, drew a foul, made two free throws, had three rebounds, a steal and a hard baseline dunk.\n\nPrince, the NBA's No. 12 overall draft pick out of Baylor, finished with eight points and five rebounds in a career-high 19 minutes.\n\n\"I thought Taurean was great,\" Hawks coach Mike Budenholzer said. \"Just the physicality he plays with, the aggressiveness he plays with, he really gave us a big boost on both ends of the floor.\"\n\nUP NEXT\n\nBucks: Visit Miami on Thursday.\n\nHawks: Visit Charlotte on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995222.1720698
}