{
  "game_id": "0022200517",
  "espn_id": "401468672",
  "date": "Dec 28, 2022",
  "matchup": "ATL vs. BKN",
  "headline": "Nets win 10th straight, beating short-handed Hawks 108-107",
  "body": "ATLANTA -- — Kyrie Irving scored 15 of his 28 points in the fourth quarter, Kevin Durant had 26 points and a season-high 16 rebounds and the Brooklyn Nets won their 10th straight game, 108-107 over the short-handed Atlanta Hawks on Wednesday night.\n\n\r\n              The winning streak is the longest in the NBA this season and the Nets’ longest since they took 10 in a row in 2005-06. The 2002-03 team also won 10 straight. The franchise record is 14, set in 2003-04 and matched in 2005-06.\n\n\r\n              Brooklyn (23-12) has won 14 of 15.\n\n\r\n              “For me specifically, when the fourth quarter hits, it's winning time,\" Irving said. “That's all I really know. When I'm out there with that group to start the fourth, I know K.D. is resting a little bit, so I just have to raise my aggression level and raise my efficiency up, and I'm grateful to have the trust of my teammates and coaching staff.\"\n\n\r\n              Yuta Watanabe’s layup in the final minute of the third made it 81-80 for Brooklyn’s first lead since it was 33-32. Durant closed the third with a pair of free throws, and the Nets never trailed again. Irving scored eight consecutive points early in the fourth to put Brooklyn up 93-82 and cap a 17-3 run, and the Hawks called timeout.\n\n\r\n              “I think the whole second half we were there for each other,\" Durant said. “We made a couple of adjustments on a couple of guys and we were able to execute that. We were able to slow them down just a little bit.\"\n\n\r\n              The injury-riddled Hawks (17-18) were without leading scorer Trae Young, leading rebounder Clint Capela and starting forward De’Andre Hunter. Young was scratched before tipoff with a left calf contusion. Capela and Hunter were ruled out long before the game began.\n\n\r\n              Dejounte Murray scored 24 points and John Collins had 21 for Atlanta, which tied it at 104 on Aaron Holiday’s 3 but never took the lead in the closing minutes of the fourth. Onyeka Okongwu finished with 18 points and a season-high 13 rebounds.\n\n\r\n              “I saw fight from our guys tonight,\" Hawks coach Nate McMillan said. “You can live with that. I thought from start to finish we stepped up and played. We didn't think about the guys that were out. The guys that were playing came out and played to win.\"\n\n\r\n              Murray missed a 27-footer with 0.1 seconds remaining as the buzzer sounded. He also missed a layup from the baseline with 50.6 seconds to go and one of two free throws with 29.9 seconds left that ended the scoring.\n\n\r\n              TIP-INS\n\n\r\n              Nets: Brooklyn is 14-4 against the Hawks since the start of 2017-18, the best record against Atlanta over that span. ... The Nets have won six straight on the road. ... Patty Mills scored all 12 of his points in the second quarter. ... Nic Claxton had a career high six blocked shots. ... Vaughn is 21-7 since taking over for Steve Nash. \n\n\r\n              Hawks: Coach Nate McMillan had no immediate update on Capela, who’s missed five of the last six games with a right calf strain. ... The timetable is equally unclear on Hunter, who’s missed two straight games with a left ankle sprain.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Charlotte on Saturday night.\n\n\r\n              Hawks: Host Los Angeles Lakers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994837.056989
}