{
  "game_id": "0022301021",
  "espn_id": "401585649",
  "date": "Mar 23, 2024",
  "matchup": "CHA @ ATL",
  "headline": "Hot-shooting Murray's 28 points power Hawks past Bridges, Hornets 132-91",
  "body": "ATLANTA -- — Dejounte Murray made a season-high seven 3-pointers while scoring 28 points and the Atlanta Hawks beat the Charlotte Hornets 132-91 on Saturday night to strengthen their hold on the final spot in the Eastern Conference play-in tournament.\n\n\r\n              Bruno Fernando scored a career-high 25 points and Garrison Mathews had 20, each in backup roles. Atlanta opened a five-game homestand with its first home win over Charlotte since Nov. 20, 2021. The Hornets took home wins in the first two games of the season series.\n\n\r\n              Murray was 7 of 9 on 3s and set a season high with 12 assists as he continued to handle lead point-guard duties in the team's 14th consecutive game without injured All-Star Trae Young, still recovering from a finger injury.\n\n\r\n              “We miss Trae, but when you have a point guard like (Murray), it makes the offense go,” Mathews said.\n\n\r\n              The Hawks matched their season high with 20 3s, including four from Mathews. Coach Quin Snyder said Murray set the pace on 3-pointers.\n\n\r\n              “The way we were playing tonight, it starts with him,” Snyder said. “You saw it with the catch-and-shoot 3s.”\n\n\r\n              The Hawks are 5 1/2 games ahead of No. 11 Brooklyn for 10th in the East.\n\n\r\n              Miles Bridges scored 27 points for the Hornets, who have lost four straight and 11 of 13 and were eliminated from playoff contention. Charlotte was close before falling behind in the second period, but coach Steve Clifford said he saw his team's struggles begin in the opening period.\n\n\r\n              “It really happened in the first quarter,” Clifford said. “As soon as we started subbing, our intensity went downhill and we really didn't get it back.”\n\n\r\n              Brandon Miller had 13 points while Nick Richards added 12 points with a season-high 16 rebounds. Vasa Micic scored eight points, ending his streak of 10 consecutive games scoring in double figures. \n\n\r\n              Young is the most prominent member of the team's long injury list. Forward Onyeka Okongwu (left big toe) was held out after playing in the final two games of a five-game road trip. \n\n\r\n              Okongwu missed 13 consecutive games with the toe injury before his return on the road. Snyder would not say before the game if Okongwu aggravated the injury. \n\n\r\n              Fernando helped fill the void left by Okongwu's injury. Fernando tied his career high of 19 points with a powerful one-handed jam to open the fourth quarter. He set his career high with a short jumper two minutes later.\n\n\r\n              Forward Jalen Johnson sprained his right ankle in Monday's loss at the Los Angeles Lakers. He missed 16 games with a wrist fracture earlier in the season and is expected to miss at least one week with the ankle injury.\n\n\r\n              Hornets forward JT Thor (left shoulder) did not play.\n\n\r\n              Following the last tie at 39-all, the Hawks closed the first half with a 27-9 run to lead 66-48 at halftime. Atlanta's bench outscored Charlotte's reserves 60-22.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit Cleveland on Monday night.\n\n\r\n              Hawks: Host Boston on Monday night in the first of two games in a four-day span against the Celtics, who visit Atlanta again on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995941.491749
}