{
  "game_id": "0022400208",
  "espn_id": "401704774",
  "date": "Nov 10, 2024",
  "matchup": "DEN vs. DAL",
  "headline": "Michael Porter Jr. hits winning jumper in the final seconds and Denver beats Dallas 122-120",
  "body": "DENVER -- — Michael Porter Jr. hit a mid-range jumper with seven seconds left and the Denver Nuggets won their fifth straight, 122-120 over the Dallas Mavericks on Sunday night.\n\n\r\n              Nikola Jokic had 37 points, 18 rebounds and 15 assists for his fourth straight triple-double and his NBA-best sixth this season. Jamal Murray had 18 points and Porter finished with 17.\n\n\r\n              Kyrie Irving had a season-high 43 points for Dallas. Luka Doncic added 24 points and Daniel Gafford had 16.\n\n\r\n              Trailing by three going into the final period, Dallas got three 3-pointers in a row from Irving to take a 105-102 lead with 8:46 left to play. The teams kept trading shots to keep it close the rest of the way. Irving’s bank shot gave Dallas a 120-118 lead with 1:39 left but Jokic then had a tying tip-in and ahead of Porter’s winning shot. Irving missed a 3-point try at the buzzer.\n\n\r\n              Down by 10 midway through the first quarter, Dallas outscored Denver by nine points in the second period and led 63-60 at halftime.\n\n\r\n              Takeaways\r\n              Mavericks: Irving and Doncic spearheaded the Mavericks’ strong offensive play which just came up short.\n\n\r\n              Nuggets: Sparked their offense with effective 3-point shooting, making 14 of their 29 attempts (48.3 percent). Peyton Watson was 4 of 4 from 3-point range.\n\n\r\n              Key moment\r\n              Dallas, already without injured P.J. Washington (knee), Dereck Lively II (shoulder) and Dante Exum (wrist), feared Doncic would be held out with a left groin strain. But he showcased his mobility and shooting in warmups and was cleared to play.\n\n\r\n              Key stat\r\n              The starting five for both teams all scored in double figures.\n\n\r\n              Up next\r\n              Mavericks: Klay Thompson, who joined Dallas last summer as part of an offseason trade with Golden State and four other teams, faces his former team on Tuesday night.\n\n\r\n              Nuggets: Begin a three-game road trip Friday night in New Orleans.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998352.196983
}