{
  "game_id": "0022201107",
  "espn_id": "401469262",
  "date": "Mar 25, 2023",
  "matchup": "ATL vs. IND",
  "headline": "Collins leads deep Hawks attack in 143-130 win over Pacers",
  "body": "ATLANTA -- — John Collins led eight Atlanta scorers in double figures with 21 points and the Hawks' overcame Jordan Nwora's season-high 33 points to beat the Indiana Pacers 143-130 on Saturday.\n\n\r\n              The Hawks set a season scoring high despite the loss of Trae Young, who was ejected in the third quarter. Four Atlanta backups scored in double figures, led by Saddiq Bey with 18 points.\n\n\r\n              “Our bench was unbelievable,” said Hawks coach Quin Snyder, who added the backups “raised the level of competitiveness in the game.”\n\n\r\n              Dejounte Murray had 20 points in his return after missing two games with a non-COVID illness. Bogdan Bogdanovic, who had nine points, just missed giving the Hawks a ninth player in double figures.\n\n\r\n              That's bad news for Indiana's defense.\n\n\r\n              “We gave up well over 30 a quarter,” said Pacers coach Rick Carlisle, who added that playing without starting center Myles Turner, who was held out with a sore lower back, was a factor. \n\n\r\n              “But it's not an excuse,” he said. \"We've got to be better than that.”\n\n\r\n              The Hawks (37-37) protected their shaky hold on the No. 8 spot in the Eastern Conference playoff standings. They began the day a half-game ahead of No. 9 Toronto and one game ahead of No. 10 Chicago in the tight competition for position in the play-in tournament.\n\n\r\n              Young was ejected after firing an unusually hard pass to referee Scott Wall during a timeout. Wall caught the ball. Young was immediately called for a technical foul and ejected.\n\n\r\n              “It's just a play he can't make,” Snyder said. “I told him that. He knows it.”\n\n\r\n              Only seconds earlier, Young had an apparent 3-pointer disallowed when he was called for a technical foul for sticking out his leg and tripping Aaron Nesmith. The technical foul was Young’s 15th of the season. A 16th technical foul results in an automatic one-game suspension.\n\n\r\n              Young had 14 points and five assists.\n\n\r\n              The game was tied at 84 when Young was ejected. The Hawks outscored the Pacers 21-14 the remainder of the period for a 105-98 lead.\n\n\r\n              Nwora, a second-year player, was acquired by Indiana from Milwaukee as part of a four-team trade on Feb. 9. He scored 21 points for the Bucks against Cleveland on Nov. 16 for his previous season high and topped that with 25 points in just the second quarter against Atlanta.\n\n\r\n              Nwora's scoring outburst led the Pacers to 39 points in the quarter for a 74-72 halftime lead.\n\n\r\n              Tyrese Haliburton scored 19 points and Buddy Hield had 16 for Indiana.\n\n\r\n              NWORA'S BIG GAME\n\n\r\n              Carlisle said it wasn't a complete surprise to see Nowra break out with his big game.\n\n\r\n              “He has the ability to get going,” Carlisle said. “We saw it when he was with Milwaukee against us. ... The thing I loved is he did it in the most efficient way. ... He's got the touch and he's got the range. He's a good player.”\n\n\r\n              Nwora, a 6-foot-9 forward from Louisville, started in four of his first 16 games with Indiana but came off the bench against Atlanta. He nailed a 3-pointer to open the third quarter and kept shooting, making 9 of 11 shots and four of four free throws in the period.\n\n\r\n              A BRIEF TOUCH OF DEFENSE\n\n\r\n              There was a brief display of defense in the third quarter, when the Hawks outscored the Pacers 33-24. It was the only period in which both teams did not score more than 30 points.\n\n\r\n              “I think we just executed the game plan,” said Murray of the defense in the period. \n\n\r\n              TIP-INS\n\n\r\n              Pacers: F Isaiah Jackson scored 14 points with five rebounds and three steals as the fill-in for Turner. ... G Chris Duarte (left ankle) played only 5 minutes after missing five consecutive games. ... Haliburton (right ankle) and F Bennedict Mathurin (right ankle) started after being listed as questionable. ... Nwora's career high is 34 points for the Bucks at Chicago on May 16, 2021.\n\n\r\n              Hawks: Clint Capela had 17 points and 17 rebounds. ... G De'Andre Hunter (left knee contusion) did not play. ... F Jalen Johnson (groin, hamstring) missed his fifth straight game.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: After ending a four-game trip, Indiana hosts the Mavericks on Monday.\n\n\r\n              Hawks: Host Grizzlies on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994808.794573
}