{
  "game_id": "0022000791",
  "espn_id": "401307584",
  "date": "Apr 09, 2021",
  "matchup": "ATL vs. CHI",
  "headline": "Hawks win 120-108, overcome 50-point game by Bulls' LaVine",
  "body": "ATLANTA -- — Trae Young scored 42 points, Clint Capela had 22 points and 10 rebounds, and the Atlanta Hawks overcame a sizzling performance by Zach LaVine to beat the Chicago Bulls 120-108 on Friday night.\n\n\r\n                    LaVine scored 39 of his career-high 50 points in the first half, and Nikola Vucevic had 25 points and 10 rebounds but the Bulls' three-game winning streak was snapped. Chicago was trying to win four straight for the first time since December 2017.\n\n\r\n                    LaVine, who set the NBA high for points in the first half this season, scored 25 straight in the second quarter, but the Hawks didn’t go easily, taking an 86-84 lead entering the fourth.\n\n\r\n                    Atlanta has won five of six to stay competitive to move into fourth place in the Eastern Conference.\n\n\r\n                    “I think it was very important for everybody for the confidence, especially winning these games in the fourth quarter,\" Danilo Gallinari said after scoring 20 points in a reserve role. “I think it gives everybody a lot of confidence. You win games like this and the next time you’re going to approach it the same when you’re in a tight fourth quarter when you know what you want to do and the shots you want to take and the plays you want to play. \n\n\r\n                    \"The chemistry is getting better.\"\n\n\r\n                    It appeared the Bulls were in good shape when LaVine hit a layup to put Chicago up 88-86 with 11:07 remaining. But Gallinari drilled a straightaway 3 at the 5:48 mark, and Atlanta was on the move. Young fed Capela for an alley-oop dunk two possessions later to make it 104-101 in favor of the Hawks.\n\n\r\n                    Another straightaway 3 by Gallinari and a bank shot by Young put Atlanta ahead 111-103 with 3:26 to play. LaVine came out of a timeout to commit a traveling turnover, and the Hawks took a comfortable 10-point lead on Capela’s dunk with 2:42 remaining.\n\n\r\n                    Gallinari followed with a 3 from the left wing to put Atlanta up 116-106 in the final minute to extend a 19-4 run and end any remaining suspense.\n\n\r\n                    LaVine, an All-Star guard, outscored the Hawks 10-4 by the 9:46 mark of the first and then made it 14-10 with a fast-break alley-oop layup. He scored 39 of the Bulls’ first 62 points as Chicago took an 11-point lead with 2:51 left in the second. LaVine was 13 for 18 from the field and 7 for 9 on 3s in the first half. \n\n\r\n                    “I just got in a rhythm,\" LaVine said. “My 3s started falling and then I can get to the mid-range and get to the hoop. I was trying to get to the free-throw line late in the second quarter because I was so damn tired. Trying to get a little bit of a break.\"\n\n\r\n                    LaVine, the first Bulls player to score 30 in the first half since Michael Jordan had as many on Feb. 24, 1997, against Portland, had another crowning achievement this season. He began the game as one of three players to average 25.0 points while shooting 50% from the field, 40% on 3s and 85% on free throws.\n\n\r\n                    Young hit a straightaway 3 and a runner to cut the deficit to six early in the third and hit another runner in the lane to make it 73-69 midway through the third. The Hawks finally broke through, taking the lead on Onyeka Okongwu’s putback in the final minute of the period.\n\n\r\n                    LaVine’s previous season high was 46 on Feb. 10 against New Orleans.\n\n\r\n                    “We had to change the game plan a little bit, of course,\" Gallinari said. “LaVine had an amazing first half. We were way more aggressive on him in trying to get the ball out of his hands.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Coach Billy Donovan said swingman Garrett Temple is making progress, but still isn’t close to returning from a right hamstring strain. He has missed six straight games. “He’s made progress over this last week where he’s able to do some (straight-ahead running). He’s been able to shoot. I still don’t have a timetable until he’s maybe able to take another step where he’s able to do some sprinting and cutting and running at full speed. He’s not doing any of that, but he is inching closer to getting back.”\n\n\r\n                    Hawks: Atlanta played its sixth straight game without starting power forward John Collins, the team’s second-leading scorer and rebounder, and interim coach Nate McMillan didn’t have an immediate timetable for his return from a left ankle sprain. Atlanta is also without two other starters — Cam Reddish (right Achilles soreness) and De’Andre Hunter (right knee soreness) — from their opening night lineup. “It’s an adjustment you have to make when you have injuries, and we’ve been unfortunate to have a lot of injuries this season with guys in and out of the lineup,” McMillan said.\n\n\r\n                    UP NEXT:\n\n\r\n                    Bulls: Visit Minnesota on Sunday.\n\n\r\n                    Hawks: Visit Charlotte on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997625.547244
}