{
  "game_id": "0021500422",
  "espn_id": "400828309",
  "date": "Dec 22, 2015",
  "matchup": "LAL @ DEN",
  "headline": "Kobe Bryant finds old form with season-high 31 in win over Nuggets",
  "body": "DENVER -- Kobe Bryant's turnaround was unstoppable, just as it was years ago. He played suffocating defense on the hot shooter, same as he did years ago.\nFor a night, Bryant was vintage Bryant again. No second thoughts about retirement, though.\n\"Zero. Not even an inkling,\" he said.\nBryant tied a season high with 31 points after missing a game with a sore right shoulder, and the Los Angeles Lakers rallied from a 21-point first-half deficit to beat the short-handed Denver Nuggets 111-107 on Tuesday.\n\nBryant also had five assists and played stellar defense to help bottle up the hot-shooting Will Barton, who had 23 points in the first half only to finish with 25.\n\"I can still play a little bit,\" said Bryant, who was on the court for 32 minutes in the first game of a back-to-back. \"It was a great test for me tonight to see if I could still play both ends of the floor.\"\nThe 37-year-old Bryant announced last month he would retire after the season. He received plenty of cheers during his penultimate game in the Mile High City, including chants of \"Kobe! Kobe!\" in the waning seconds.\nUp 103-100 with 1:23 remaining, Bryant hit two free throws and then a jumper to seal the Lakers' fifth win of the season.\n\"He's still a guy that sees the floor better than everybody,\" coach Byron Scott said. \"He sees it in slow motion.\"\nBut that defensive performance. Now that impressed Scott.\n\"Barton was tearing us up in the first half,\" Scott said. \"I asked Kobe if he wanted to guard him. He's like, 'Yeah, I got him.' Two points after that. He just did a fabulous job.\"\nThe Nuggets were without Danilo Gallinari (sprained left ankle) and Emmanuel Mudiay (sprained right ankle). Gary Harris went down with a strained right knee early in the game, but returned to score 21 points, tying a career high.\n\"Bryant had a game tonight and we didn't have anybody that could guard him,\" Nuggets coach Michael Malone said. \"We had to adjust. Give them credit. That was a good win for them.\"\nDenver's reserves actually outscored the starters by a 58-49 margin.\nLos Angeles turned things around in the third quarter thanks to a 27-10 run, with Bryant leading the way. He didn't play in Oklahoma City on Saturday because of a sore shoulder, two days after dunking for the first time this season against Houston.\nAnd while Scott said his star's shoulder was still \"a little sore,\" it hardly showed. He had a behind-the-back pass in the third quarter that set up a 3-pointer by Lou Williams.\nJust Bryant being Bryant.\n\"I've been watching him since I was a little kid. Nothing new,\" teammate Julius Randle said with a casual shrug.\nTIP-INS\nLakers: Former Lakers star Shaquille O'Neal was among the candidates for the recently announced Naismith Memorial Basketball Hall of Fame's class of 2016. \"Be surprising if he wasn't,\" Scott said. ... Jordan Clarkson had 19 points. ... With his shoulder ailing, Bryant said he took it easy the past few days. \"I just rested completely and watched 'Star Wars,'\" Bryant said.\nNuggets: Nikola Jokic had 15 points and 10 boards. ... Several Broncos sat courtside, including running C.J. Anderson and safety T.J. Ward. ... PG Jameer Nelson was under the weather, but still played nearly 30 minutes and had eight assists.\nAT EASE\nScott has seen a more relaxed Bryant since announcing his retirement. The coach just wishes the Lakers were more competitive in Bryant's farewell season.\n\"I don't think any of us wanted his last season to be like this,\" Scott said. \"We wanted him to go out on top, have a chance to win another championship. The reality is that's not going to happen.\"\nNANCE'S NIGHT\nRookie Larry Nance Jr. played up the road at Wyoming and had quite a contingent show up to root for him. Nance delivered handshakes before the game and then a 10-point performance.\n\"It was really cool,\" Nance said. \"Wish I had more time, would've met all 980 people.\"\nUP NEXT\nLakers: Host Oklahoma City on Wednesday.\nNuggets: At Phoenix on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994295.980921
}