{
  "game_id": "0022000115",
  "espn_id": "401267275",
  "date": "Jan 06, 2021",
  "matchup": "TOR @ PHX",
  "headline": "Suns drain 21 3-pointers, beat Raptors 123-115",
  "body": "PHOENIX -- — Devin Booker scored 24 points, Jae Crowder added 21 and the Phoenix Suns made 21 3-pointers on the way to a 123-115 victory over the Toronto Raptors on Wednesday night. \n\n\r\n                    The Suns made at least 20 3-pointers in a game for the fourth time in franchise history and hit from long range all night, making nine in the first half and 12 more in the second. Crowder led the way with six 3s while Cameron Johnson added four.\n\n\r\n                    The Suns have won five of their past six and improved to 6-2, which is tied for tops in the Western Conference with the Los Angeles Lakers. Phoenix has continued the momentum it gained at the end of last season, when it won all eight games in the NBA’s Florida bubble and nearly qualified for the playoffs.\n\n\r\n                    Crowder was an under-the-radar signing for the Suns during the offseason after helping Miami reach the NBA Finals last year. The veteran forward has scored at least 15 points in four of eight games.\n\n\r\n                    Suns coach Monty Williams said Crowder is useful because he can contribute scoring without being the focal point of the offense. He's quickly found his role with the Suns, providing tough defense and sliding into spaces where he can make shots.\n\n\r\n                    “I just think Jae figures it out,” Williams said. “He’s one of those guys who knows how to space and knows how to read the defense when they close out.”\n\n\r\n                    Johnson scored 16 to lead the Suns bench, which poured in 42 points. Dario Saric added 15 points and Cameron Payne tied a career high with 10 assists.\n\n\r\n                    “We just play really hard,” Payne said. “We try our best to play hard and find each other in the right spots.”\n\n\r\n                    The Suns finished 21 of 40 (52.5%) from 3-point range.\n\n\r\n                    “Give them credit — they kept stepping into them and kept making them for the most part,” Toronto coach Nick Nurse said. “The 3-point defense hurt us tonight.”\n\n\r\n                    Pascal Siakam scored 32 points on 11-of-21 shooting and Kyle Lowry added 24 points for the Raptors, who fell to 1-6 and had their six-game winning streak against Phoenix snapped. The Raptors shot nearly 50% from the field but couldn’t keep up with the Suns.\n\n\r\n                    Phoenix led 96-87 going into the fourth quarter and extended its advantage to 105-90 on a corner 3 by Saric with about 9:30 remaining. The Raptors cut the advantage to 121-115 with 35 seconds left but Chris Paul made two free throws to turn back the rally.\n\n\r\n                    The game stayed tight throughout the first half and the Suns took a 58-54 lead into halftime. Crowder scored 15 points in the first half and made four 3-pointers. Johnson came off the bench to add 13 and made three 3s.\n\n\r\n                    Siakam had 19 points before the break, shooting 7 of 10 from the field.\n\n\r\n                    ANTHEMS\n\n\r\n                    The teams met at center court and linked arms during the singing of the Canadian and U.S. national anthems, reacting to a tumultuous day on which a violent mob supporting President Donald Trump stormed the U.S. Capitol.\n\n\r\n                    “Just a sign, a symbol of unity and togetherness that we want to be a part of as a league and a country,” Williams said. “We realize these are some different times.”\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Forward Aron Baynes returned to the desert after playing last season with the Suns. He averaged a career-high 11.5 points per game last season, playing particularly well early in the season when Ayton was out because of a 25-game suspension. Baynes finished with no points and five rebounds in 13 minutes. ... Lowry was hit in the face during the fourth quarter while trying to defend Ayton. Officials reviewed the play but said no “hostile act” occurred. Lowry stayed down for a minute but returned to the game.\n\n\r\n                    Suns: Deandre Ayton had 11 points and 16 rebounds. ... The Suns shot 22 of 24 on free throws. ... Paul had 12 points and eight assists.\n\n\r\n                    UP NEXT\n\n\r\n                    The Raptors continue their four-game trip Friday at Sacramento.\n\n\r\n                    The Suns travel to face the Detroit Pistons on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996900.372088
}