{
  "game_id": "0022400452",
  "espn_id": "401705018",
  "date": "Dec 31, 2024",
  "matchup": "MIN @ OKC",
  "headline": "Gilgeous-Alexander scores 40 to lead Thunder past Timberwolves 113-105",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 40 points, and the Oklahoma City Thunder rallied to win their seventh straight game, beating the Minnesota Timberwolves 113-105 on Tuesday night.\n\n\r\n              Isaiah Hartenstein added 15 points and 10 rebounds, and Lu Dort and Jalen Williams each had 14 points for the Thunder (27-5), which trailed 52-46 at halftime before outscoring Minnesota 43-23 in the third quarter to take a double-digit lead.\n\n\r\n              Anthony Edwards had 20 points and seven rebounds to lead Minnesota (17-15). His two free throws with 2:03 left cut the Thunder lead to 106-103, but Gilgeous-Alexander answered with a 3-pointer to reach the 40-point plateau for the third time in five games and extend the lead to 109-103.\n\n\r\n              Naz Reid scored 19 points, and Mike Conley added 16 for the Timberwolves, who had won three in a row.\n\n\r\n              Takeaways\r\n              Timberwolves: Minnesota was in control until the second half, when the Timberwolves withered under Oklahoma City's pressure defense and blew a 12-point lead in the third quarter.\n\n\r\n              Thunder: Defense and Gilgeous-Alexander's playmaking ability kept Oklahoma City in the game until his teammates found their shooting touch in the second half.\n\n\r\n              Key moment\r\n              Minnesota got three consecutive 3-pointers from Mike Conley to build a 65-53 lead with 8:30 left in the third quarter. But Oklahoma City went on a 36-10 run and ended the quarter with a 89-75 lead. Gilgeous-Alexander led the way with 19 points in the quarter.\n\n\r\n              Key stat\r\n              Oklahoma City forced 24 turnovers, including 16 steals. The majority came in the second half when the Thunder clawed their way back into the game.\n\n\r\n              Up next\r\n              The Timberwolves host Boston, and the Thunder host the Clippers on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998096.46633
}