{
  "game_id": "0022401213",
  "espn_id": "401736807",
  "date": "Dec 13, 2024",
  "matchup": "LAC @ DEN",
  "headline": "Nuggets rout Clippers 120-98 despite quiet night from Jokic",
  "body": "DENVER -- — Jamal Murray scored a game-high 20 points and the Denver Nuggets beat the Los Angeles Clippers 120-98 on Friday night despite a quiet game from Nikola Jokic.\n\n\r\n              Jokic, who scored 56 and 48 points in the last two games, had a season-low two assists and tied season lows with 16 points and seven rebounds.\n\n\r\n              James Harden had 15 points and nine turnovers for Los Angeles, which has dropped two straight.\n\n\r\n              The Clippers scored 18 straight points in the second quarter to turn a 12-point deficit into a five-point lead. Denver missed eight shots and had 10 turnovers in nearly six minutes when Los Angeles went on its run.\n\n\r\n              The Nuggets answered that with a 23-5 run in the third quarter to take control of the game. Michael Porter Jr. scored 10 of his 17 points in the third quarter.\n\n\r\n              Denver held an opponent below 100 points for the first time since April 9.\n\n\r\n              Takeaways\r\n              Clippers: In the first two games against Denver this season, Norman Powell averaged 32.6 points and hit 63.2% of his 3-point attempts. He was held to 16 points and 3 of 10 from deep.\n\n\r\n              Nuggets: Coach Michael Malone has been trying to find a way to take the pressure off Jokic this season and found an opportunity Friday night. Jokic played less than 30 minutes and didn’t get off the bench in the fourth quarter.\n\n\r\n              Key moment\r\n              The Clippers led 58-55 early in the second half when Murray came up with two steals that sparked Denver’s momentum-turning run.\n\n\r\n              Key stat\r\n              Coming into the night, Denver was 0-5 when playing after two or more days of rest and 4-0 on the second game of a back-to-back.\n\n\r\n              Up next\r\n              Both teams play Monday night, with the Clippers hosting the Jazz and the Nuggets on the road at the Kings.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998045.311708
}