{
  "game_id": "0022000913",
  "espn_id": "401307716",
  "date": "Apr 25, 2021",
  "matchup": "MIL @ ATL",
  "headline": "Lou Williams' hot shooting helps Hawks beat Bucks 111-104",
  "body": "ATLANTA -- — Lou Williams sank four 3-pointers in the final seven minutes, including a jumper that gave Atlanta its first lead of the second half, Bogdan Bogdanovic scored 32 points and the Hawks beat the Milwaukee Bucks 111-104 on Sunday night.\n\n\r\n                    Williams scored all of his 15 points in the fourth quarter. The Hawks overwhelmed the Bucks with their barrage of eight 3-pointers in the final seven minutes.\n\n\r\n                    Williams missed seven shots from the field before his drought-breaking 3 gave Atlanta its first lead of the second half at 85-84 with 6:59 remaining.\n\n\r\n                    Williams knew he hadn’t made a shot from the field, but he wasn’t going to pass up the shot.\n\n\r\n                    “Listen, I’ve had worse games where I haven’t been able to score,” Williams said. “My confidence never wavers. ... For scorers like me, when one drops we feel we can make 10 in a row.”\n\n\r\n                    Giannis Antetokounmpo had 31 points with 14 rebounds, but the Bucks couldn't complete another season sweep of an Eastern Conference rival. Milwaukee settled for two wins in its three-game series against the Hawks one day after a 132-94 rout of Philadelphia completed the sweep of that series.\n\n\r\n                    Khris Middleton had 23 points, and Jrue Holiday had 19 points with 11 assists for Milwaukee.\n\n\r\n                    Kevin Huerter scored 20 points as the Hawks ended a streak of six consecutive losses to Milwaukee. John Collins had 18 points for Atlanta, which has won four of its last five and 11 of 14.\n\n\r\n                    Williams added two more 3s in a string of five consecutive long-distance baskets that gave Atlanta a 98-90 lead. Bogdanovic added two 3s in the run, and a layup by Williams pushed the lead to 100-90.\n\n\r\n                    Point guard Trea Young (left ankle sprain) was held out for the second consecutive game, leaving Atlanta without its top scorer. \n\n\r\n                    After holding Atlanta to 17 second-quarter points, Milwaukee led 51-43 at halftime.\n\n\r\n                    A jumper by Antetokounmpo to open the second half gave the Bucks their first double-digits lead at 53-43, but they couldn't pull away.\n\n\r\n                    “It felt like we were in a little bit of mud in the second half,” Bucks coach Mike Budenholzer said. “We didn’t have enough. Credit to Atlanta. They played well. They had a great finish to the fourth quarter.”\n\n\r\n                    The Hawks outscored the Bucks 41-26 in the final period.\n\n\r\n                    “I just think we were making shots, playing with a lot of confidence, giving ourselves an opportunity to win the game,” Williams said. \n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: F. P.J. Tucker (sore left ankle) did not play, but coach Mike Budenholzer said “we anticipate this should be very short-term. I think he’s in a good place as long as we stay on top of it all.”\n\n\r\n                    Hawks: Atlanta's last win over Milwaukee came on March 31, 2019. ... Coach Nate McMillan said Young “hasn't done anything the last couple of days” in terms of basketball activities while rehabbing the ankle injury. Young's status is uncertain for Monday's game at Detroit, though he said in a TV interview near the Hawks bench during the game he is improving every day. \n\n\r\n                    ON THE ATTACK\n\n\r\n                    After seeing his team have no free throws in the first half, McMillan urged his players to attack on offense. As a result, the Hawks made 18 of 23 free throws in the second half, including 9 of 12 in the final period.\n\n\r\n                    “I thought we needed to be more aggressive attacking the basket,” McMillan said. “I thought we settled in the first half and we had zero free-throw attempts. ... In the second half, we got aggressive and started attacking the basket.\"\n\n\r\n                    CAPELLA ON THE BOARDS\n\n\r\n                    Hawks C Clint Capela, who missed one game with a back contusion, was cleared to start after participating in pregame warmups. He had 14 rebounds, giving him at least 10 for the 13th consecutive game and 48th time in 53 games.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Continue a four-game road trip at Charlotte on Tuesday.\n\n\r\n                    Hawks: Visit Detroit on Monday to complete back-to-back.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997375.89819
}