{
  "game_id": "0022001027",
  "espn_id": "401307834",
  "date": "May 10, 2021",
  "matchup": "IND @ CLE",
  "headline": "Pacers beat Cavaliers 111-102, move into ninth place in East",
  "body": "CLEVELAND -- — Domantas Sabonis had 21 points, 20 rebounds and nine assists as the Indiana Pacers strengthened their hold on a play-in tournament spot with a 111-102 victory over the Cleveland Cavaliers on Monday night.\n\n\r\n                    Kelan Martin scored a career-high 25 points and Caris LeVert had 20 points and 10 assists for the Pacers, who moved one-half game ahead of Washington into ninth place in the Eastern Conference. The Wizards were beaten 125-124 in Atlanta.\n\n\r\n                    “Every game matters and we just saw that the Wizards lost, but it all depends on us,” Sabonis said. “We want to get as high as we can in the play-in round. The most important thing is continuing to distribute the ball because it makes everybody happy.”\n\n\r\n                    Indiana reduced its magic number for clinching a play-in berth to two with four games remaining. Chicago is 11th -- one spot outside of the play-in tourney -- and the Pacers are now within a game of eighth-place Charlotte.\n\n\r\n                    “We weathered the storm all night and Kelan carried us down the stretch,” LeVert said. “I’m really enjoying building chemistry with these guys and Domas is probably the best passing big man I’ve played with. He’s a special talent.”\n\n\r\n                    Collin Sexton scored 25 points for the Cavaliers in their 11th straight loss, matching the eighth-longest skid in team history. Rookie Isaac Okoro had 22 points and 10 rebounds and Dean Wade had 19 points and 12 rebounds in their first career double-doubles.\n\n\r\n                    Cleveland dressed nine players with nine others out with injuries, including starters Kevin Love (right calf strain) and Darius Garland (left ankle sprain). Love played 27 minutes Sunday against Dallas and was given the evening off to rest his leg.\n\n\r\n                    “We fought like hell and I’m appreciative of their effort,” Cavaliers coach J.B. Bickerstaff said. “We had a number of guys carry the load for us like Bull (Sexton), D-Wade and Isaac the whole time. It was all heart and all strength.”\n\n\r\n                    A Sabonis layup put Indiana in front for good at 93-91 with 6:09 left, beginning a 9-1 run that gave it an eight-point lead. The Cavaliers, who were ahead by double-digits in the first half, never got closer than five in the final four minutes.\n\n\r\n                    Justin Holiday scored 11 points and T.J. McConnell had 10 points and seven assists as Indiana’s bench outscored Cleveland’s 47-17. Sabonis added four blocked shots and two steals, falling one assist shy of his ninth triple-double of the season.\n\n\r\n                    “I love playing pick-and-rolls and the two-man game with someone as aggressive as Caris,” Sabonis said. “And Kelan was big. He’s always aggressive and stayed ready. Today was one of those days when he got hot and gave us energy.”\n\n\r\n                    Pacers point guard Malcolm Brogdon missed his sixth straight game with a sore right hamstring.\n\n\r\n                    The Cavaliers held their first halftime lead since April 23 at 60-53, fueled by 19 points from Sexton. Cleveland has lost a season-high seven consecutive home games.\n\n\r\n                    BACK TO COLLEGE\n\n\r\n                    Cavaliers assistant coach Lindsay Gottlieb has been hired as the women’s basketball coach at Southern California. Gottlieb is in her second season on Cleveland’s staff and returns to the Pac-12, where she made seven NCAA Tournament appearances in eight years as the head coach at California. “The NBA is a different monster, but Lindsay was able to make the transition seamlessly,” Bickerstaff said. “She was able to build relationships with the guys and the coaches quickly.” Gottlieb, 43, became the seventh female coach in NBA history when she was hired by Cleveland in 2019.\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Sabonis notched his 45th double-double of the season, five shy of his franchise record set in 2019-2020. … C Myles Turner (right plantar plate tear), G Jeremy Lamb (left knee soreness), F T.J. Warren (left foot stress fracture) and F JaKarr Sampson (concussion) were inactive. Sampson, who last played on April 29, is traveling with the team and worked out earlier in the day.\n\n\r\n                    Cavaliers: No. 5 overall draft pick Okoro has appeared in a team-high 64 games, starting all of them. … F Larry Nance Jr. (right thumb fracture), G Matthew Dellavedova (neck strain), F Cedi Osman (right ankle soreness), C Isaiah Hartenstein (concussion), F Lamar Stevens (concussion), F Taurean Prince (left ankle surgery) and F Dylan Windler (left knee surgery) remain out.\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host Philadelphia on Tuesday. Indiana begins a three-game homestand that also includes the Bucks and Lakers.\n\n\r\n                    Cavaliers: Host Boston on Wednesday. Cleveland plays its final game at Rocket Mortgage FieldHouse this season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997117.464154
}