{
  "game_id": "0022301178",
  "espn_id": "401585806",
  "date": "Apr 12, 2024",
  "matchup": "ATL @ MIN",
  "headline": "Rudy Gobert's big night lifts Timberwolves past Hawks and into a first-place tie in the West",
  "body": "MINNEAPOLIS -- — Rudy Gobert had 25 points, 19 rebounds and five blocks to help the Minnesota Timberwolves defeat the Atlanta Hawks 109-106 on Friday night and move into a three-way tie for first place in the Western Conference.\n\n\r\n              Minnesota is even with Denver and Oklahoma City atop the conference with one game to play. The Timberwolves hold head-to-head tiebreakers over both teams, but the Thunder would win a three-way tiebreaker for the top spot. So, a victory by Minnesota over Phoenix and a loss by either Denver or Oklahoma City would lock up the top seed for the Timberwolves.\n\n\r\n              “The only way you can get help is if you help yourself first,” Timberwolves coach Chris Finch said. “Then we’ll see what happens. Either way though, Game 82 and we’re playing for a chance to win the Western Conference – it’s been a heck of a regular season.”\n\n\r\n              Naz Reid had 19 points, Anthony Edwards scored 14 and Mike Conley added 13 points and 10 assists for the Timberwolves, who welcomed back All-Star forward Karl-Anthony Towns, who had 11 points after missing 18 games following surgery to repair a damaged meniscus in his left knee.\n\n\r\n              “Having had so much time to watch this team and watch from a different lens gave me a good understanding of what I can do when I go out there to help this team and impact it the most,” said Towns, who went 4 for 11 from the field and added eight assists and five rebounds.\n\n\r\n              Trae Young led Atlanta with 19 points in 27 minutes, his second game back after missing six weeks with a hand injury. Bogdon Bogdonović had 17 points and Clint Capela added 13 points and 11 rebounds for the Hawks.\n\n\r\n              Atlanta is locked into the No. 10 seed in the East and will face Chicago in the play-in tournament.\n\n\r\n              Gobert went 10 for 10 from the field, including eight dunks, and scored 10 points in the fourth quarter as the Wolves recovered from blowing a 17-point third-quarter lead.\n\n\r\n              “When he’s playing with this kind of confidence, when he’s playing at this level, we’re going to be really tough to play against,” Towns said.\n\n\r\n              Minnesota led by nine at halftime and pushed its lead to 76-59 midway through the third quarter. But the Timberwolves then went almost five minutes without scoring, allowing the Hawks to score 14 straight points, part of a 21-4 run that tied the score 80-80 heading into the fourth.\n\n\r\n              Towns hit a 3-pointer with 2:29 to play to give Minnesota a 101-100 lead, and Edwards added six points down the stretch as the Timberwolves held on.\n\n\r\n              “My shot didn’t fall, but I just needed to make one and I’m glad that I was able to make that one that I needed to make today,” Towns said. “Next game will be a different story.”\n\n\r\n              The game also marked the return of Alex Rodriguez and Marc Lore, who haven't attended a Timberwolves game since their bid to become majority owners apparently fell through on March 28. The duo sat across the court from Glen Taylor, the team's longtime majority owner who said Rodriguez and Lore missed a deadline to transfer ownership, which the two dispute.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Indiana on Sunday.\n\n\r\n              Timberwolves: Host Phoenix on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996258.357427
}