{
  "game_id": "0021800383",
  "espn_id": "401071064",
  "date": "Dec 08, 2018",
  "matchup": "CHI vs. BOS",
  "headline": "Celtics throttle Bulls by 56 points as both teams set records",
  "body": "CHICAGO -- The Boston Celtics turned in a record-setting performance in their steady climb up the Eastern Conference standings.\nJaylen Brown scored 23 points off the bench, Daniel Theis added a career-high 22 points and grabbed 10 rebounds, and the Celtics routed the Chicago Bulls 133-77 on Saturday night for their fifth straight win.\n\nThe 56-point margin of victory was the largest in franchise history, surpassing a 51-point win (153-102) over the Philadelphia Warriors on March 7, 1962. The winning differential also tied the mark by an NBA road team, set by Seattle in a 136-80 win at Houston on Dec. 6, 1986.\nThe 56-point loss was the worst in Bulls history, eclipsing a 53-point (127-74) defeat at Minnesota on Nov. 8, 2001.\nThe Celtics (15-10) overmatched and sped past the woeful Bulls from the opening tip -- and never let up.\n\"I thought our guys were really locked in,\" Boston coach Brad Stevens said. \"They played hard all the way through.\"\nAnd ran up some impressive numbers.\n\"The offense has gotten better over the last couple of weeks,\" Stevens said. \"We just have to keep building on it.\"\nJayson Tatum had 18 points and Terry Rozier added 15 as the Celtics used a 17-0 start and a balanced attack to roll to their second straight lopsided win after beating New York 128-100 on Thursday. The Celtics have outscored opponents by an average of 126.2 to 97.6 during their five-game run.\n\"I think since the last five games, we've been moving the ball very well, probably average 30 assists in every game we won,\" Theis said. \"That's the way we should play -- just fast.\"\nIt was a different story for the Bulls. \n\"Disappointing effort, disappointing outcome after what I thought was a really hard-fought two games and at home last night,\" Bulls coach Jim Boylen said. \"Got to give Boston credit -- I thought they made the shots.\n\"They kind of punched us and we didn't respond.\"\nShaquille Harrison came off the bench to score a career-high 20 points for Chicago, which has lost eight of nine. Zach LaVine had 11 for the Bulls (6-21), whose previous worst loss this season was by 39 points (122-83) to Toronto on Nov. 17.\n\"We all should be [embarrassed],\" LaVine said.\nThe Bulls fell flat after beating Oklahoma City 114-112 on Friday night on Lauri Markkanen's layup in the closing seconds, giving Boylen his first win as an NBA head coach.\nA longtime NBA assistant, Boylen took over Monday when Fred Hoiberg was fired following a 5-19 start. The Bulls lost at Indiana the following night in Boylen's debut.\nThe Celtics took charge early in this one, racing ahead 17-0 as they shot 8-for-11 from the floor at the start. Boston led 35-17 after one quarter as it shot 60.9 percent, and led 64-43 at the half thanks to 52.4 percent shooting.\nFor the game, the Celtics outshot Chicago 53.8 percent to 38.3 percent.\nThe scoring in Boston's first-half outburst was evenly distributed. Marcus Morris led with 12 points, while Tatum, Theis and Rozier each had 10.\nThe Celtics' biggest lead in the first half was 22 points and Chicago never got closer than 13.\nChicago missed its first 12 field goal attempts, prompting Boylen to pull all five starters 4:45 in. The Bulls didn't score until Jabari Parker hit a pair of free throws 6:18 in -- raising a derisive cheer from the United Center crowd. Chicago didn't get its first basket until Robin Lopez sank a turnaround hook 36 seconds later.\nThe Celtics kept the pressure on, outscoring Chicago 69-34 in the second half.\nTIP-INS\nCeltics: Forward/center Al Horford missed the game with a sore left knee after recording 19 points and 12 rebounds against New York on Thursday. ... Forward/center Aron Baynes (sprained left ankle) also sat out. He limped off the court late in the last two minutes of the first quarter versus the Knicks. ... Forward Guerschon Yabusele had to be helped off the court midway through the fourth quarter after landing awkwardly. Stevens said Yabusele suffered a \"bad sprain.\"\nBulls: Boylen still isn't sure when guard Kris Dunn (sprained left MCL) and forward Bobby Portis (sprained right MCL) will return. \"Long-term health is what we're about,\" Boylen said. \"We expect them back soon, any day, but not today. We'll re-evaluate tomorrow.\" ... A longtime NBA assistant, Boylen said he's very close to Hoiberg and said feelings are still \"really raw\" following the firing of his former boss. Boylen shook off questions about whether Hoiberg \"lost the locker room.\" \"I approach the locker room different than Fred,\" Boylen said. \"It doesn't mean better, worse or whatever. We're different people.\"\nBY THE NUMBERS\nThe Celtics have scored at least 115 points in every game during their five-game winning streak, their longest such run since doing it six consecutive times in March 1988.\nGOT MILK?\nBoylen said he celebrated his first victory as an NBA head coach on Friday night at home with his family. \"We had a bowl of cereal with my kids and watched the 'Family Feud,'\" he said.\nUP NEXT\nCeltics: Host New Orleans on Monday.\nBulls: Host Sacramento on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994833.0238101
}