{
  "game_id": "0021800420",
  "espn_id": "401071101",
  "date": "Dec 14, 2018",
  "matchup": "ATL @ BOS",
  "headline": "Kyrie Irving scores 24 points, Celtics beat Hawks 129-108",
  "body": "BOSTON --  Kyrie Irving credits Boston's defense for an offensive resurgence that has the Celtics riding the longest winning streak in the NBA.\n\nIrving scored 24 points in just three quarters, then rested in the fourth as the Celtics finished off a 129-108 rout of Atlanta on Friday night for their eighth straight victory.\n\n\"We're just pushing the pace,\" said Irving, who also had five assists, five rebounds and four steals. \"I think our identity is on the defensive end. We just try to pressure them and use that to our advantage and create opportunities on the offensive end.\"\n\nJayson Tatum had 22 points for Boston, Marcus Morris added 20, Gordon Hayward had 19 points and five assists, Daniel Theis scored 18 points and rookie Robert Williams III blocked five shots.\n\n\"We've been playing well over the past couple of games, just coming out with some pace and some attitude and just setting the tempo,\" said Morris, who made six of Boston's 19 3-pointers.\n\nKevin Huerter led Atlanta with 19 points, and John Collins had 11 points and 14 rebounds. The Hawks, losers of six of seven, had nine of their 24 turnovers in the first quarter.\n\n\"The hole that we put ourselves in was a big issue,\" Atlanta coach Lloyd Pierce said. \"We just have a way of getting off to slow starts. For some reason, we don't have that urgency.\"\n\nAtlanta regrouped in the second quarter and pulled to 49-45, but Boston pushed the lead back up to 11 at halftime and continued pulling away in the second half with an opening 13-2 run.\n\n\"We've got to do a better job of not putting ourselves in a hole at the start of the third,\" Collins said. \"We give a team like that opportunities, they're going to take them.\"\n\nTatum's three-point play with 2:04 left in the third pushed the Celtics over 100 points at 101-79. A technical on Bazemore after the call led to another free throw, followed by another Ton Atlanta coach Lloyd Pierce 5 seconds later. Boston led 108-82 after three and let its reserves take over in the fourth quarter.\n\nWELCOME BACK CARTER\n\nAtlanta's Vince Carter, who is playing in his 21st season, got a warm reception in a place that's known for being tough on opponents.\n\n\"I'm grateful because I know on the other side there is a lot of boos playing here,\" Carter said. \"I don't expect it, obviously, but until you hear it, it's a pretty cool moment. Very appreciative.\"\n\nOUCH\n\nHayward, who sat out Wednesday's game with an illness, went to the locker room at the end of the third quarter after biting his tongue hard enough to draw blood late in the period.\n\nTIP-INS\n\nHawks: Outscored Boston 37-25 in the second quarter to pull to 67-56 at halftime. ... Huerter tied his career high for points, which he set Wednesday night in a loss at Dallas.\n\nCeltics: The Celtics capitalized on nine turnovers by Atlanta in the first quarter and led 42-19 after one period. Boston outrebounded Atlanta 13-6 in the first and made 16 of 22 shots, going 6 for 8 from 3-point range. ... Boston's 42 points in the quarter was a little short of the season-high 45, also against Atlanta on Nov. 23. ... Hayward and Jaylen Brown returned after missing Wednesday's game with illnesses. ... Al Horford missed his fourth straight game with an injured left knee.\n\nUP NEXT:\n\nHawks: At Brooklyn on Sunday.\n\nCeltics: At Detroit on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995373.288366
}