{
  "game_id": "0022300617",
  "espn_id": "401585245",
  "date": "Jan 23, 2024",
  "matchup": "POR @ OKC",
  "headline": "Shai Gilgeous-Alexander scores 33 points to lift Thunder to 111-109 win over Trail Blazers",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 33 points and Jalen Williams added 19 points, including the game-winner with two seconds left, to help the Oklahoma City Thunder beat the Portland Trail Blazers 111-109 on Tuesday night.\n\n\r\n              Gilgeous-Alexander intercepted a lob intended for Deandre Ayton right before the buzzer sounded to seal the win for Oklahoma City — its seventh-straight over Portland, which lost to the Thunder by 62 points the last time the two teams played.\n\n\r\n              “I thought the guys collectively did a really good job of hanging in there tonight,” Oklahoma City coach Mark Daigneault said. ” ... we obviously just had a hard time finding our rhythm. Some of that was us and some of that was them. They really showed up and played tonight and did a really nice job. They were really tough to compete against.”\n\n\r\n              Scoot Henderson scored 19 points and Anfernee Simons added 17 for Portland, including a 3-pointer with 29 seconds left in the game to give the Trail Blazers a 109-106 lead.\n\n\r\n              A Williams make pulled Oklahoma City to within 109-108 with 15.6 seconds remaining, but Portland turned it over on a double-dribble by guard Malcolm Brogdon. The call infuriated Trail Blazers coach Chauncey Billups, who picked up two technical fouls and was ejected.\n\n\r\n              Billups said he and Brogdon were trying to call timeout on the possession. \n\n\r\n              “We’ve got timeouts,” Billups said. “Referees usually are prepared for that, you know, that instance, that situation. I’m at half court, trying to call a timeout. It’s just frustrating. My guys played too hard for that, it’s a frustrating play.”\n\n\r\n              Gilgeous-Alexander made one of two free throws to tie the score, then Williams connected on a mid-range jumper in traffic to win it for the Thunder.\n\n\r\n              “Shooters shoot,” said Williams, who scored eight points in the fourth quarter. “That shot I work on a lot. Coach drew the play up for me to shoot it. My mind is a little more free just because it’s a tie game, so it’s like worst case, you get to go to OT. But coach had faith in me to get to the spot I wanted to get to and make the shot.”\n\n\r\n              Oklahoma City (30-13) got 13 points off the bench from Aaron Wiggins and eight points, 10 rebounds and five blocks from Chet Holmgren.\n\n\r\n              When the teams played Jan. 11, Oklahoma City shattered its previous record for margin of victory with a 139-77 win. The Thunder also won by 43 points in Portland on Nov. 19.\n\n\r\n              This time, Portland was playing with Ayton, a 7-footer, and Brogdon, who combined for 23 points, nine rebounds and nine assists. Brogdon and Jerami Grant scored 18 points each for Portland (12-31), which has yet to beat a Western Conference team this season (0-16).\n\n\r\n              “They blew us out (by) 62 a week-and-a-half-ago,” Billups said. “We said ‘listen, either you’re going to roll or get rolled on.’ That’s how this game works. Our guys, they rolled today. They played really good, they shared the ball, defensively I thought we did a really good job, we made them earn everything.”\n\n\r\n              Two free throws by Gilgeous-Alexander put Oklahoma City up 38-25 with eight seconds left in the first quarter. The Trailblazers cut the lead to 38-28 on a 3-pointer by Jabari Walker that rolled in at the buzzer. \n\n\r\n              Portland went on a 14-4 run to pull within 42-39 on a 3 by Walker with 8:45 left in the second quarter, prompting Daigneault to take a timeout.\n\n\r\n              The Trail Blazers heated up from beyond the arc after that and outscored the Thunder 38-20 to lead 66-58 at halftime. Portland connected on 12 of 23 of its 3-point shots (52%) in the first half and 18 of 39 for the game.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Visit Houston on Wednesday.\n\n\r\n              Thunder: Visit San Antonio on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996576.0521889
}