{
  "game_id": "0022400717",
  "espn_id": "401705283",
  "date": "Feb 05, 2025",
  "matchup": "CHA vs. MIL",
  "headline": "Lillard scores 29 points as Bucks beat Hornets 112-102 to snap a 4-game losing streak",
  "body": "CHARLOTTE, N.C. -- — Damian Lillard had 29 points and 12 assists, Bobby Portis had 23 points and 17 rebounds in his first game since Jan. 23 and the Milwaukee Bucks defeated the Charlotte Hornets 112-102 on Wednesday night in their first game since trading longtime guard Khris Middleton.\n\n\r\n              Brook Lopez added 14 points on four 3s as the Bucks snapped a four-game losing skid.\n\n\r\n              Nick Smith Jr. had 23 points on four 3s for Charlotte, which has lost six straight.\n\n\r\n              The Bucks pushed their lead to 21 in the third quarter, repeatedly getting open looks from beyond the arc against a depleted Hornets roster. \n\n\r\n              Charlotte had no answers for Lillard, who finished 9 of 18 from the field and 8 of 9 from the foul line, while setting up teammates with open looks with penetration and kickouts.\n\n\r\n              Lillard was forced to carry the load for the Bucks, who played without Giannis Antetokounmpo. Antetokounmpo went through pre-game warmups and was introduced before being scratched due to left calf soreness minutes before tipoff. \n\n\r\n              Takeaways\r\n              Bucks: Lopez set the tone for the Bucks making four 3s in the opening quarter, forcing Hornets center Mark Williams out of the middle of the paint and opening space for his teammates to operate. Williams was ineffective all night.\n\n\r\n              Hornets: Charlotte was without seven players due to injury, including LaMelo Ball who is still nursing an ankle injury. Ball's primary backup Vasa Micic also sat out, leaving the Hornets particularly young and thin at the point guard spot, which made things pretty easy for Lillard.\n\n\r\n              Key moment\r\n              After the Hornets cut the lead to seven early in the fourth quarter Portis knocked down back-to-back 3-pointers to push the lead to 13.\n\n\r\n              Key stat\r\n              Milwaukee finished 18 of 42 on 3s; Charlotte was 11 of 34.\n\n\r\n              Up next\r\n              Both teams are in action Friday night. The Bucks visit the Hawks, while the Hornets close a nine-game homestand against the Spurs.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997704.825473
}