{
  "game_id": "0021800651",
  "espn_id": "401071327",
  "date": "Jan 15, 2019",
  "matchup": "PHX @ IND",
  "headline": "Bogdanovic scores 20, Pacers trounce Suns 131-97",
  "body": "INDIANAPOLIS --  Indiana has its sights set on the top of the Eastern Conference standings.\n\nOn Tuesday night, the Phoenix Suns found themselves directly in the way of a determined Pacers team.\n\nBojan Bogdanovic scored 20 points and the Pacers wasted little time cruising to a 131-97 victory.\n\nWhile impressive, Tuesday's lopsided win isn't the type of performance that's fueling the Pacers.\n\n\"We've proven we can (beat teams like Phoenix) before,\" guard Victor Oladipo said. \"The next step is winning against really good teams -- the Raptors, Milwaukee, Celtics, Golden State. That's the next step, beating (those teams) consistently.\n\n\"At the end of the day, it's over. This game is completely over. We have a big game on Thursday against a team who's really close to us in the standings and the top of the East. We need to take care of business then. That's what it's all about.\"\n\nThe Pacers face Philadelphia on Thursday.\n\nThe Pacers got off to a fast start thanks to Bogdanovic, who scored the Indiana's first 10 points. The Pacers doubled the Suns' total in the first quarter, leading 38-19 at the end of the period.\n\nMyles Turner returned for the first time in four games to finish with 18 points and six rebounds. Turner was nursing a sore right shoulder over the last week.\n\n\"There was definitely some rust,\" Turner said. \"I was a step behind. But it was a great team performance and that's all that matters.\"\n\nThe Pacers led by as many as 37 in a game in which they never trailed.\n\nCory Joseph scored eight of his 10 points in the first quarter, adding to Bogdanovic's hot start. Thaddeus Young scored 10 of his 12 points in the first half and finished the game with seven rebounds. Joseph was one of three Pacers who scored in double figures off the bench. Tyreke Evans scored 20 and Domantas Sabonis finished with 14 and eight rebounds in their usual reserve roles.\n\nThe Suns made it interesting briefly in the first half. Phoenix pulled within seven points in the second quarter, but Indiana never let the Suns regain momentum long enough for it to matter. The Pacers pulled back ahead once again by double digits, leading 62-51 at halftime, and never looked back.\n\nIndiana limited Devin Booker to eight points in 26 minutes.\n\nRookie Deandre Ayton finished with 14 points and eight rebounds. T.J. Warren led Phoenix with 18 points and Kelly Oubre Jr. scored 16 points off the bench.\n\n\"We didn't show up\" Suns coach Igor Kokoskov said. \"We were down the entire game. In the second quarter, we played the way we were supposed to . but there is not much we can take from this game.\"\n\nCOMING IN HOT\n\nIndiana's 34-point blowout of Phoenix kicks off a five-game homestand where the Pacers will face Philadelphia, Dallas, Charlotte and Toronto in the next eight days. The Pacers' 34-point win was the third 30-plus point margin of victory this season, which marks the first time since the 1993-94 season that Indiana has compiled three or more 30-point victories. Indiana's 131 points its second-most this season.\n\nTIP-INS\n\nSuns: Phoenix is 2-5 in January. ... With his next appearance, Jamal Crawford will play in his 1,300th NBA game, becoming just the 22nd player to reach the milestone. Crawford did not dress Tuesday night due to a sore right knee. . The Suns are 4-17 on the road this season.\n\nPacers: Indiana's 38 points in the first quarter tied a season high. ... The Pacers outscored the Suns 27-10 on fast-break points. ... Seven Pacers scored in double digits. ... Indiana scored 58 points off the bench and outscored Phoenix 60-48 in the paint. ... The Pacers' 37-point lead tied for their largest of the season\n\nUP NEXT\n\nSuns: At Toronto on Thursday\n\nPacers: Host Philadelphia on Thursday",
  "source": "espn_api",
  "crawled_at": 1764995070.096114
}