{
  "game_id": "0022300713",
  "espn_id": "401585341",
  "date": "Feb 05, 2024",
  "matchup": "LAL @ CHA",
  "headline": "Anthony Davis has 3rd career triple-double, Lakers beat Hornets 124-118",
  "body": "CHARLOTTE, N.C. -- — Anthony Davis and the Lakers might be starting to find their rhythm — just as the uncertainty of the NBA trade deadline approaches.\n\n\r\n              Davis had 26 points, 15 rebounds and 11 assists for his third career triple-double and Los Angeles held on to defeat the short-handed Charlotte Hornets 124-118 on Monday night for their third straight win.\n\n\r\n              D’Angelo Russell scored 28 points and LeBron James added 26 points for the Lakers (27-25), who finished 4-2 on their road trip to build some much needed momentum.\n\n\r\n              “When we put our minds to it, we can beat any team in this league,” Davis said. “We lost two we felt like we should have won, and we won two that the people in Nevada thought we should lose. When we buckle down defensively and play the right way we are a tough team to beat.”\n\n\r\n              Whether the Lakers will be the same team when they return to the floor Thursday night after the NBA trade deadline remains uncertain as rumors continue to swirl around the In-Season Tournament champions.\n\n\r\n              When asked if the Lakers have the right personnel in the locker room to win the NBA title, James replied, “that's not a question for me. I love what we have in the locker room and that is all I worry about. It isn't like, 'I can't stand you.' I don't get caught up in that.”\n\n\r\n              Miles Bridges erupted for a career-high 41 points and rookie Brandon Miller scored 33 points with five 3-pointers for the Hornets, who suffered their eighth straight loss since trading Terry Rozier to Miami.\n\n\r\n              Miller, who had a career-high 35 points in a loss Sunday night to the Indiana Pacers, became the first Hornets rookie to score at least 30 points in back-to-back games.\n\n\r\n              “I think that shows a lot of confidence,\" Miller said. \"Hats off to my teammates for coming in every day and building my confidence to take the shots that I take in tough matchups like this with the crowd going. It’s really all my teammates not just me. If it wasn’t for them I wouldn’t take those shots.”\n\n\r\n              The Lakers shot 64% from the floor in the first half and built a 74-58 lead heading into the locker room behind 22 points from Russell and 17 from James.\n\n\r\n              James had several highlight reel moment in the opening half, driving past P.J. Washington and dunking over 7-foot center Nick Richards for a three-point play. James had another baseline drive for a high-flying two-handed jam and also fed Davis for an alley-oop dunk.\n\n\r\n              The Lakers had 36 assists.\n\n\r\n              Davis was simply too much to contain for a Hornets team severely lacking height with center Mark Williams still out with a back injury.\n\n\r\n              “He’s seen just about everything,\" Lakers coach Darvin Ham said of the double teams Davis has faced and beaten. \"Just the film study, the breakdowns we go through, him being vocal, him being communicative in terms of what he’s seeing, and where he needs guys to be positioned so he can make the right reads. He’s been doing all the homework he needs to do, and so that’s why you see the top results.”\n\n\r\n              Los Angeles extended its lead to 21 points late in the third quarter as Christian Wood knocked down a 3 and then dunked off a pass from Austin Reaves.\n\n\r\n              But the Hornets would make it a game behind Miller, who had 16 points in the fourth quarter. The No. 2 pick in the draft intercepted a Reaves pass and went the length of the court for a dunk and then added back-to-back 3s to cut the Lakers lead to four with about two minutes remaining.\n\n\r\n              Charlotte had a chance to make it a one-possession game, but Davis tipped Bridges' step-back 3-point attempt and Reaves made two free throws to push the lead to six and seal the win.\n\n\r\n              Bridges finished 16 of 26 from the field with five 3s.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Host the Nuggets on Thursday night.\n\n\r\n              Hornets: Host the Raptors on Wednesday night, their third home game in four nights.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995504.6350038
}