{
  "game_id": "0022000528",
  "espn_id": "401267688",
  "date": "Feb 28, 2021",
  "matchup": "CHA @ SAC",
  "headline": "Monk's three-point play helps Hornets stun Kings 127-126",
  "body": "SACRAMENTO, Calif. -- — PJ Washington scored a career-high 42 points, Malik Monk converted a three-point play with 1.4 seconds remaining and the Charlotte Hornets stunned the Sacramento Kings 127-126 with a late rally Sunday night.\n\n\r\n                    Monk finished with 21 points to help Charlotte come back despite playing without leading scorer Gordon Hayward, who sat out with a hand injury.\n\n\r\n                    LaMelo Ball added 24 points and a career-best 12 assists for the Hornets, who trailed the entire fourth quarter before Monk’s game-winning play.\n\n\r\n                    “It goes back to that term of resiliency, never dropping the sword, never giving in and fighting until the final second,” Hornets coach James Borrego said. “They had to miss some free throws to help us out, but we found a way. Down men, we found a way to win. Just proud of our group.”\n\n\r\n                    Sacramento led 123-115 following a dunk by Harrison Barnes, but coach Luke Walton’s team couldn’t close it out.\n\n\r\n                    The Kings missed five free throws over the final 69 seconds and lost for the 10th time in 11 games.\n\n\r\n                    “Come to an end of a game, that’s where we have to step up and put teams out and we didn’t do it,” Walton said. “Give Charlotte credit. They hit 3s and made every free throw down the stretch. That’s a painful loss for our guys. We didn’t finish it out.”\n\n\r\n                    Terry Rozier hit a 3-pointer and then added three free throws after being fouled by Barnes with 33.7 seconds left. \n\n\r\n                    After Washington’s fifth 3 cut the lead to 125-124 with 17 seconds remaining, Buddy Hield hit one of two free throws for the Kings.\n\n\r\n                    Monk followed by driving down the lane and flipping the ball off the backboard with his right hand. He was fouled by Richaun Holmes.\n\n\r\n                    “It was a play for me or PJ,” Monk said. “I told (Ball) to pass it to P and he was like, nah. I had to make something happen.”\n\n\r\n                    Washington’s previous career high was 27 points against Chicago on Oct. 23, 2019.\n\n\r\n                    “I feel like I got it going early and my 3-point felt good so I kept shooting,” Washington said. “It always feels good when your shots are falling. Whenever my teammates found me I tried to make the defense pay.”\n\n\r\n                    Hield missed a desperation heave from beyond midcourt as time ran out. \n\n\r\n                    Hield scored 30 points and Barnes had 28. De’Aaron Fox added 20 points and 14 assists for Sacramento.\n\n\r\n                    Ball gave the Hornets a scare just before halftime when he crashed into the Charlotte bench after catching an inbounds pass from the opposite end of the court. Ball tried to flip the ball backward, then tumbled over chairs and into a cooler stand before he was helped up.\n\n\r\n                    ROOKIE SHOWDOWN ON HOLD\n\n\r\n                    An anticipated matchup between Ball and Sacramento guard Tyrese Haliburton was postponed when Haliburton sat out a second straight game with a sore left calf. Both are among the early leading candidates for NBA Rookie of the Year. \n\n\r\n                    During a pregame ceremony at midcourt as the Hornets warmed up nearby, Haliburton wore a light blue suit and was presented with the rookie of the month award for games played in December and January.\n\n\r\n                    FASTEST TO 1K\n\n\r\n                    Hield became the fastest player in NBA history to reach 1,000 career 3-pointers, doing so in his 350th career game. Stephen Curry of the Warriors was the previous fastest at 369 games.\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Washington’s 15 field goals were a career high. … Monk picked up a technical foul for yelling at referees after scoring in the second quarter. … Jalen McDaniels was called for an inbounding violation midway through the first.\n\n\r\n                    Kings: Fox picked up two fouls in the first six minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Visit the Trail Blazers on Monday. Portland has won 12 straight at home against Charlotte\n\n\r\n                    Kings: Host the Los Angeles Lakers on Wednesday. The Kings haven’t beaten the Lakers at home since Dec. 27, 2018.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997022.180298
}