{
  "game_id": "0022400940",
  "espn_id": "401705506",
  "date": "Mar 11, 2025",
  "matchup": "BKN @ CLE",
  "headline": "NBA-leading Cavaliers beat Nets 109-104 for their second 15-game win streak of season",
  "body": "CLEVELAND -- — All-Star Darius Garland scored 18 of his 30 points in the fourth quarter and the NBA-leading Cleveland Cavaliers rallied for a 109-104 victory over the Brooklyn Nets on Tuesday night, matching the longest winning streak in franchise history at 15 games.\n\n\r\n              Jarrett Allen had 23 points and 13 rebounds, and Evan Mobley had 21 points, nine rebounds and six assists for Cleveland, which also began this season with a 15-game win streak. The Cavaliers trailed by 18 points in the third quarter.\n\n\r\n              Cleveland is 55-10 -- tying the fifth-best start in NBA history -- and owns the best home record in the league at 30-4. All-Star guard Donovan Mitchell (left groin soreness), forward De’Andre Hunter (illness) and guard Ty Jerome (rest) didn't dress for the game.\n\n\r\n              Cam Thomas scored 27 points, Cameron Johnson had 17 points and Ziaire Williams added 14 before fouling out for Brooklyn. The Nets dropped five games behind Chicago for the final play-in tournament spot in the East.\n\n\r\n              Takeaways\r\n              Nets: Point guard D’Angelo Russell, who logged 29 minutes Monday in a 111-108 win over the Lakers, sat out the second half of the back-to-back set for right ankle injury management.\n\n\r\n              Cavaliers: Coach Kenny Atkinson’s club hasn’t lost since Feb. 4, when it was beaten by Boston 112-105 at Rocket Arena. Its other home losses were to Atlanta, Houston and Indiana.\n\n\r\n              Key moment\r\n              Brooklyn trailed 101-99 with 56 seconds remaining when Johnson missed a 3-pointer that wound up on top of the backboard. Garland raced down for a layup and soon afterward added two free throws to extend the Cavaliers’ lead to six.\n\n\r\n              Key stat\r\n              Cleveland clinched the Central Division title for the eighth time in its 55-year history. Six of the crowns were won during LeBron James’ two tenures with the team.\n\n\r\n              Up next\r\n              The Nets visit Chicago on Thursday. The Cavaliers play at Memphis on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997968.985825
}