{
  "game_id": "0021900604",
  "espn_id": "401161246",
  "date": "Jan 15, 2020",
  "matchup": "DET @ BOS",
  "headline": "Sekou Doumbouya scores 24, Pistons down Celtics 116-103",
  "body": "BOSTON --  The Pistons have been playing most of the past month without three starters.\n\nThey didn't let it stop them from finding a way to get the best of one of the East's top teams.\n\nRookie Sekou Doumbouya scored a season-high 24 points and Detroit snapped a three-game losing streak with a 116-103 win over the Boston Celtics on Wednesday night.\n\nDetroit continued to be without starters Reggie Jackson (back), Blake Griffin (left knee surgery) and Luke Kennard (knee tendinitis). But Doumbouya has begun to get more comfortable lately, reaching double figures in seven of his last eight games.\n\n“I feel like normal, just played my game and not try to do too much,\" he said.\n\nMarkieff Morris matched his season best with 23 points. Derrick Rose added 22 points and Sviatoslav Mykhailiuk had a season-high 21. The Pistons shot a season-best 60.3% from the field.\n\nAndre Drummond added 13 points and 13 rebounds to post his 34th double-double of the season.\n\n“This is probably the best win we've had,\" Morris said. \"We've been struggling lately. To come out and compete like we did tonight, shows us we can play with anybody.”\n\nThe Pistons opened the fourth quarter with a 17-5 run, capped by a dunk by Drummond, to take a 108-87 lead with 7:05 to play.\n\nBoston never got closer than 12 after that. Shortly after coach Brad Stevens pulled his starters, Marcus Smart was called for a foul and ejected after arguing with an official.\n\nIt was the conclusion of a night of frustration for Boston, which has lost four its last six.\n\n“They played well from the beginning of the game,” point guard Kemba Walker said. “They came out extremely aggressive and focused. They took that one.”\n\nBoston was without its second-leading scorer with Jayson Tatum sidelined because of soreness in his right knee. But he is expected to travel with the team for its anticipated matchup with conference leader Milwaukee on Thursday night.\n\nSmart started in his place.\n\nThe Pistons took advantage with Tatum out. They used a 10-0 run, capped by 3-pointer by Mykhailiuk, to build 82-73 lead in the third quarter. He closed the period knocking down a buzzer-beater from just inside the half-court line.\n\nRose hit his first four shots to help Detroit take an early 27-18 lead.\n\nThe Celtics closed the gap led by Hayward, who connected on five of his first seven attempts in the first quarter.\n\nTIP-INS\n\nPistons: Scored 18 points off 15 Boston turnovers.\n\nCeltics: Bench was outscored 47-23.\n\nSECOND-HALF OPTIMISM\n\nWednesday marked the start of the second half of Detroit's schedule. Pistons coach Dwane Casey is hopeful it also bring some improved health for his team.\n\nGriffin and Kennard have been out since December and currently neither has a timetable to return to action. But Casey said Jackson is practicing and could be ready to come back “any day now.”\n\n“We could sit here and make a lot of excuses. ... It's part of the NBA,” Casey said. “Now is the time for everybody who has the opportunity to make sure they take advantage of it.\"\n\nINJURY UPDATE\n\nStevens said he doesn't expect big man Robert Williams (left hip bone edema) to return anytime before the All-Star break.\n\nWilliams hasn't played since Dec. 6. He was last checked out by doctors earlier this month and received a good report. He was put on an action plan that was scheduled to last about a month.\n\n“They’re going to see how his hip responds to that, rescan him and then determine the course of action from there,” Stevens said. \"We were hopeful in the last scan, but we’re also very cautious with his recovery.”\n\nNO CORA\n\nFormer Red Sox manager Alex Cora, who parted ways with the team Tuesday after being implicated in a sign-stealing scandal, was removed from a TD Garden anti-hate speech PSA. The video features various athletes and coaches from Boston and New England sports teams urging fans to stand up against racism and other hate speech.\n\nThe spot includes appearances from Stevens, Red Sox players Mookie Betts and Xander Bogaerts, Patriots Matt Slater and Devin McCourt, Bruins coach Bruce Cassidy and others.\n\nUP NEXT\n\nPistons: At Atlanta on Saturday.\n\nCeltics: At Milwaukee Thursday.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996275.8528252
}