{
  "game_id": "401810176",
  "espn_id": "401810176",
  "date": "Dec 02, 2025",
  "matchup": "NO vs MIN",
  "headline": "Anthony Edwards' late layup forces OT, as Timberwolves edge Pelicans 149-142",
  "body": "NEW ORLEANS -- — Anthony Edwards scored 34 of his season-high 44 points in the second half, including a driving layup to force overtime, and Julius Randle scored eight points in the extra period to lift the Minnesota Timberwolves to a 149-142 victory over the New Orleans Pelicans on Tuesday night.\n\n\r\n              Edwards, who came in averaging 37.2 points in his last five games, struggled from long range early, missing 4 of 5 3-point attempts in the first half. But he caught fire in the second half, going 5 of 8 from deep.\n\n\r\n              Edwards sent the game into overtime by driving past Jose Alvarado for a layup with 2.3 seconds left. New Orleans led 129-125 with 1:03 remaining in regulation on Derik Queen’s dunk but went scoreless the rest of the way.\n\n\r\n              Trey Murphy III led six Pelicans in double figures with 33 points. Saddiq Bey had 22, and Queen and fellow rookie Jeremiah Fears added 21.\n\n\r\n              Rudy Gobert finished with 26 points for Minnesota, including three dunks in overtime, and 13 rebounds. Jaden McDaniels had 17 points and Randle 16 for the Timberwolves, who won their third straight.\n\n\r\n              The Pelicans, with the worst record in the league (3-19), have lost 13 of their last 14 games.\n\n\r\n              The Pelicans used a 15-0 run during a three-minute stretch late in the second quarter to turn a 55-53 deficit into a 68-55 lead. Bey sparked the run with seven points and Murphy added five. Murphy had 11 of his 15 first-half points in the second quarter, when the Pelicans outscored Minnesota 43-27.\n\n\r\n              New Orleans played for the 12th time in 23 games without Zion Williamson, who was scratched with a right adductor strain. Williamson, the Pels’ leading scorer, averaged 22.1 points and 5.6 rebounds in his 10 games this season.\n\n\r\n              Up next\r\n              The Pelicans host the Timberwolves again on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042738.365769
}