{
  "game_id": "0021800098",
  "espn_id": "401070779",
  "date": "Oct 30, 2018",
  "matchup": "SAC @ ORL",
  "headline": "Hield, Kings top Magic 107-99 for fourth straight win",
  "body": "ORLANDO, Fla. --  Sacramento has had some success trying to outrun and outscore opponents. Against the Orlando Magic, the Kings turned to defense.\n\nBuddy Hield finished with 25 points and the Kings defeated Orlando 107-99 on Tuesday night to extend their winning streak to four games.\n\n\"We got six stops in a row,\" said coach David Joerger, referring to a 3  1/2-minute sequence after their 13-point lead was cut to three. \"We had to get some stops and we got those stops. We locked back in and made some plays.\"\n\nHield scored six points in a 13-2 run to close out the third quarter, and the Kings held on to match their longest winning streak since February 2017.\n\nThe Kings' De'Aaron Fox, who played with a sore back, was doubtful until pregame warmups and struggled through a scoreless first half. Fox finished with 14 points, including eight in the fourth quarter.\n\n\"I felt like I had a great second half, a forgettable first half,\" said Fox, who added that the back did affect him. \"But I felt like I had to push through it in the second half.\"\n\nNemanja Bjelica finished with 21 points for Sacramento, and Willie Cauley-Stein added 14 points and 11 rebounds.\n\nAaron Gordon had 18 points and 10 rebounds for the Magic, who lost their third straight. Terrence Ross came off the bench to score 17 points, and Nikola Vucevic finished with 15 points and 15 rebounds.\n\nThe Magic had assists on each of their first 11 field goals and led through most of the first half. Two 3-pointers by Ross gave Orlando its biggest lead at 27-16 late in the first quarter.\n\nSacramento led for the first time at 55-52 when Bjelica made a 3-pointer with 1:17 left in the first half.\n\nThe Kings moved out to a 13-point lead before Ross and Jonathon Simmons led a fourth-quarter charge by the Magic, who got as close as 94-91 with 4:50 left.\n\n\"The inability to score in the third quarter was the biggest part of the game for us,\" said Magic coach Steve Clifford. \"Our defense ignited our offense in the fourth quarter and gave us a chance, (but) we had a couple of things we need to do better late.\"\n\nBut Orlando's comeback bid fizzled due to seven turnovers in the fourth period and 11-for-43 3-point shooting in the game.\n\n\"I just feel like we can never get in control of the game,\" Vucevic said. \"We made mistakes on both ends. Offensively we had stretches where we just couldn't get anything going.\"\n\nTIP-INS\n\nKings: F Iman Shumpert was rested for the second game of a four-game road trip.\n\nMagic: Rookie Mo Bamba had seven rebounds and five blocks. ... No team in the NBA had given up fewer free throws than Orlando (18.33 per game before Tuesday night), but the Kings shot 26 Tuesday night, including 11 in the fourth quarter.\n\nUP NEXT\n\nKings: At Atlanta on Thursday night.\n\nMagic: At home against the Los Angeles Clippers on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994230.585563
}