{
  "game_id": "0022000825",
  "espn_id": "401307620",
  "date": "Apr 13, 2021",
  "matchup": "LAL @ CHA",
  "headline": "Kuzma nets 24, lifts Lakers past short-handed Hornets 101-93",
  "body": "CHARLOTTE, N.C. -- — Frank Vogel isn't complaining about the Los Angeles Lakers finishing a seven-game road trip with a 4-3 record.\n\n\r\n                    “I think all of our guys are really fatigued right now,” the Lakers' second-year head coach said. “We are stretched really thin with all of the injuries and the compact schedule. To come out of it 4-3 on this stretch, we feel good about that.”\n\n\r\n                    Kyle Kuzma scored 24 points, and the Lakers held on for a hard-fought 101-93 win against a Charlotte Hornets team missing five of its top six scorers on Tuesday night.\n\n\r\n                    Dennis Schroder added 19 points and Andre Drummond chipped in with 12 rebounds for the Lakers, who'll return home to face the Boston Celtics on Thursday with fans allowed in the Staples Center.\n\n\r\n                    “It could be a big impact having that energy,” Lakers guard Kentavious Caldwell-Pope said. “That energy can fill you up.”\n\n\r\n                    Devonte Graham led the Hornets with 19 points. Caleb Martin had 17 points and 10 rebounds.\n\n\r\n                    The Lakers held the Hornets to 43.4% shooting overall and 25.7% from 3-point range.\n\n\r\n                    The game was largely a battle of backups, with the Hornets missing four starters due to injury and the Lakers three.\n\n\r\n                    Charlotte was missing more than 72% of its scoring with Terry Rozier and P.J. Washington joining LaMelo Ball, Gordon Hayward and Malik Monk on the bench. The Lakers, who are still without All-Stars LeBron James and Anthony Davis, were also missing Markieff Morris due to a sprained left ankle.\n\n\r\n                    The Lakers built a 10-point lead in the closing seconds of the third quarter behind a jumper by Schroder.\n\n\r\n                    But Charlotte cut the lead to one with 1:54 remaining behind a coast-to-coast layup and a 3-pointer from Graham. The Hornets had a chance to take the lead after getting a defensive stop, but Graham turned the ball over and Alex Caruso made them pay at the other end with a clutch 3 with 43 seconds left.\n\n\r\n                    “That was a big shot to seal the game,” Vogel said of Caruso, who finished with 13 points and six assists. “He does so much dirty work for us that it was great to see him hit that shot. ... He was the star of the game.”\n\n\r\n                    Added Drummond: “He’s a hell of a player. His plus-minus numbers say it. When he’s on the floor good things happen.”\n\n\r\n                    Lacking go-to scorers in the clutch, the Hornets were forced to rely solely on Graham, who missed a spinning 3-point attempt on Charlotte's next possession. Caruso made two free throws to push the lead to six with 28.1 left.\n\n\r\n                    Graham answered with a runner and the Cody Zeller appeared to come up with a steal in the backcourt before losing control of the ball. The Hornets were forced to foul and Kuzma slammed the door on Charlotte with four free throws down the stretch.\n\n\r\n                    “They did what they could,” Hornets coach James Borrego said of his team. \"They competed. I mean, we had the ball down one, that’s all you can ask for in that situation. I thought given the circumstances, the guys continued to compete and play hard.”\n\n\r\n                    TIP INS\n\n\r\n                    Lakers: James supported his teammates from the bench throughout the game and got quite animated following a high-flying one-handed dunk from Kuzma over Bismack Biyombo. ... Coach Frank Vogel picked up a technical foul in the second quarter when he argued a charge call against Drummond. ... Marc Gasol (left hamstring) didn't play despite being cleared before the game.\n\n\r\n                    Hornets: Started their 15th different lineup. ... James Borrego picked up a technical foul in the third quarter. ... Had 18 turnovers resulting in 26 points for the Lakers.\n\n\r\n                    DRUMMOND'S OFFENSE\n\n\r\n                    Drummond had another disappointing offensive night for the Lakers, scoring just four points on 2-of-7 shooting against a Hornets team that has struggled to defend big men.\n\n\r\n                    “I’m still trying to figure it out too,\" Drummond said. \"Offensively, this is the worst I have played in my career. But I know I am here to help the team defensively.”\n\n\r\n                    Vogel doesn't believe Drummond has played poorly, and it is more a matter of how teams are defending the Lakers.\n\n\r\n                    “Having LeBron and AD out there will help him,\" Vogel said. \"Tonight they played zone the whole game to pack it in and take away players like Andre. So you take what the defense gives you.”\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Return home to host the Celtics on Thursday night.\n\n\r\n                    Hornets: Host the Cavaliers on the second night of a back-to-back Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997288.309866
}