{
  "game_id": "0021900180",
  "espn_id": "401160822",
  "date": "Nov 16, 2019",
  "matchup": "TOR @ DAL",
  "headline": "Doncic scores 26 points, leads Mavs past Raptors 110-102",
  "body": "DALLAS --  Luka Doncic was upset when he missed four of 12 free throws in the first three quarters of Saturday night’s game against Toronto.\n\nThen, he went 7 for 7 from the line in the fourth quarter as Dallas built on its one-point lead and the Mavericks went on to beat the Raptors 110-102.\n\n“I don’t expect to make all of them, but I want to make all of them,” Doncic said\n\nDoncic finished with 26 points and 15 rebounds, including a career-best 15 free throws in a career-high 19 attempts.\n\n“(Doncic) can do it all,” said guard Fred VanVleet, who scored 24 points for Toronto. “He’s a threat at every level, mid-range and 3, and kicking out to his teammates. Thought we did a good job on him tonight, just couldn’t keep him off the free throw line.\n\nRaptors coach Nick Nurse seemed tired of seeing Doncic at the line.\n\n“I thought that he got all his points from the foul line. I thought he was treated very well tonight,” Nurse said\n\nDelon Wright finished with 15 points and banked in a fadeaway jumper with 5 seconds left in the third quarter to send Dallas into the fourth quarter with a 78-77 edge. Wright added six points against his former team in the fourth quarter.\n\nKristaps Porzingis had 20 points and matched his career best with 15 rebounds for Dallas.\n\n“I felt much more comfortable today,” he said. “It felt more natural today, not as forced. I just missed a lot of good looks, a lot of open shots, but I’m happy we got the win. If I scored a few more of those open looks, it could have been a much easier game for us.”\n\nSeth Curry scored 15 points, and Dorian Finney-Smith and Maxi Kleber had 10 apiece.\n\nDoncic noted Kleber’s contribution on defense in a win over the defending NBA champions.\n\n“A great win,” Doncic said. “We did a great job on Pascal Siakam. Maxi did a great job especially.”\n\nSiakam, Toronto’s leading scorer, had 15 points on 10-for-24 shooting. Norman Powell led the Raptors with a season-high 26 points, including 13 in the fourth quarter. Matt Thomas scored 10.\n\nThe Mavericks used a 15-0 run in the first quarter to transform a 10-3 deficit into an 18-10 lead. Kleber scored the first five points, and Finney-Smith ended the run with a layup 3½ minutes later.\n\nDallas led 32-22 after the first quarter, with Doncic scoring 14 points. VanVleet had 10 for Toronto, which shot 30% (6 for 20) from the floor.\n\nThe Raptors roared back in the second quarter, shooting 61% (14 for 23) and outscoring the Mavericks 38-21 for a 60-53 halftime lead.\n\nTIP-INS\n\nRaptors: In Matt Thomas’s ninth NBA game, he scored a career-high 10 points, all in the second quarter. He had scored eight twice before. ... Norman Powell had a chance for a 4-point play in the fourth quarter, but he missed the free throw after Dallas’s Jalen Brunson fouled him on the shot.\n\nMavericks: A video review showed that a shot by Kristaps Porzingis in the second quarter left his hand after 24 seconds expired, so 2 points were deducted from the scoreboard. ... The game matched the NBA’s fifth-leading scorer Luka Doncic (28.7ppg.) and eighth-leading scorer Pascal Siakam (27.2 ppg.).\n\nTOUGH STRETCH\n\nThe Mavericks are on a homestand that consists of games against the four teams -- Raptors, Spurs, Warriors and Cavaliers -- that have won the last six NBA titles.\n\n“This is a tough homestand,” coach Rick Carlisle said. “It’s a great opportunity, certainly, to be home. We’ll find out a lot. I don’t know exactly what it will tell me or us, but the opportunity to compete at home in front of your fans, it’s a big deal and it’s a big opportunity.”\n\nMISSING YOU\n\nThe Raptors went 3-2 on a five-game trip, even though C Serge Ibaka (sprained right ankle) and G Kyle Lowry (thumb injury), averaging 35 points per game between them, were injured in the second game.\n\n“Three-and-two and we lost two of our most important players,” said Norman Powell, who took Lowry’s place. “We’re not holding our heads though. We’re going to get in the gym and do better, correct our mistakes.”\n\nUP NEXT\n\nRaptors: Return home for two games, beginning Monday against Charlotte.\n\nMavericks: Play the second of a four-game homestand on Monday against San Antonio.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995652.109157
}