{
  "game_id": "0021801169",
  "espn_id": "401071842",
  "date": "Apr 03, 2019",
  "matchup": "BKN vs. TOR",
  "headline": "Siakam, Leonard lead Raptors past Nets 115-105",
  "body": "NEW YORK --  Fighting desperately to get back in the game, the Brooklyn Nets kept going smaller and smaller until they essentially had four perimeter players on the floor.\n\nGood luck stopping Kawhi Leonard, Pascal Siakam and Serge Ibaka with that.\n\nSiakam had 28 points and 10 rebounds, Leonard added 26 points and nine boards and the Toronto Raptors beat the Nets 115-105 on Wednesday night for their fifth straight victory.\n\nIbaka finished with 23 points and 12 rebounds for the Raptors (56-23), who need to win their final three games to match last season's franchise record for victories. Their victory prevented the Milwaukee Bucks from clinching the No. 1 seed in the Eastern Conference.\n\n\"They were the better team. I don't know how else to say it,\" Nets coach Kenny Atkinson said. \"They were better from start to finish. You have to give them credit. They're a team that's going to compete for a championship. We were not up to those standards that you have to be almost perfect and we weren't. I would say we were average and that's not good enough to beat that team.\"\n\nD'Angelo Russell had 27 points, seven rebounds and six assists for the Nets, who fell to 39-40 and missed another chance to improve their playoff situation. They could have moved ahead of Detroit after the Pistons lost to Indiana, but instead are now tied for seventh with the Orlando Magic.\n\nBrooklyn has lost four of five.\n\nThe Nets had cut the deficit to five early in the third quarter before Siakam made a pair of baskets around Marc Gasol's 3-pointer to make it 66-54. Toronto would get the lead as high as 14 points in the quarter and led 90-78 entering the fourth.\n\nRussell tried to jump-start a rally early in the fourth, scoring seven straight Brooklyn points to trim it to 92-87. He scored 18 in the final period, taking advantage of the space the Nets created with their small lineup. But they got punished on the other end trying to match up with Toronto's versatile forwards, all 6-foot-7 or taller.\n\n\"We obviously said there's some size advantages out there,\" Toronto coach Nick Nurse said. \"When you get some mismatches and you get a small guy on you, start roaming around in the paint and try to get some putbacks.\"\n\nSiakam, Ibaka and Kyle Lowry made 3-pointers over a span of 1:40, before two free throws by Ibaka and another by Siakam pushed it back to 108-96 with 3:15 to play.\n\nRussell had one more flurry, making three 3-pointers to cut it to 110-105 with 1:24 left. But Ibaka scored on a follow shot and the Nets couldn't get anything else to fall.\n\n\"They're a good, veteran ballclub,\" Nets guard Spencer Dinwiddie said. \"Every time we were able to close the gap they tightened the screws on their end. They got the big stop or made the big shot. That was the difference.\"\n\nSiakam scored 18 points after halftime.\n\n\"I kind of got thrown off like at the beginning of the game just seeing the way they were guarding me and I got a little excited,\" Siakam said. \"I just had to calm down a little bit and let the game come to me.\"\n\nTIP-INS\n\nRaptors: Toronto has won 15 of the last 16 meetings. ... Lowry had 10 points.\n\nNets: Russell scored 20 points in all four meetings with Toronto this season. ... Caris LeVert was just 1 for 9 for three points.\n\nPLANNING TO PLAY\n\nNurse said his plan is to play Leonard in their three remaining games. The Raptors have carefully managed the All-Star forward's workload after he was limited to just nine games in San Antonio last season because of a thigh injury, but Nurse said Leonard wants to play to build a rhythm for the postseason.\n\nFANTASTIC FINISH\n\nAtkinson said he watched on his phone when Theo Pinson made a 3-pointer with 0.4 seconds remaining Tuesday to send the Long Island Nets past Lakeland in overtime and into the NBA G League Finals. Pinson, signed by Brooklyn to a two-way contract, often leads the cheers from the bench and Atkinson said it was \"poetic justice\" that he was the one to hit the winner. \"Thrilled for him, thrilled for Long Island going to the finals,\" Atkinson said. \"It really sets up a positive kind of note, just on our program.\"\n\nUP NEXT\n\nRaptors: Visit Charlotte on Friday.\n\nNets: Visit Milwaukee on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995385.467503
}