{
  "game_id": "0022400491",
  "espn_id": "401705057",
  "date": "Jan 05, 2025",
  "matchup": "LAL @ HOU",
  "headline": "Green has 33 points, VanVleet's late steal helps Rockets hold on for 119-115 win over Lakers",
  "body": "HOUSTON -- — Jalen Green scored 33 points and Fred VanVleet grabbed a key steal late to allow the Houston Rockets to hold on for a 119-115 win over the Los Angeles Lakers on Sunday night.\n\n\r\n              Amen Thompson added 23 points and a career-high 16 rebounds in his return after a two-game suspension to help Houston eke out the victory after leading by as many as 22.\n\n\r\n              A basket by LeBron James got the Lakers within 117-115 with eight seconds to go. Alperen Sengun missed 1 of 2 free throws after that to give Los Angeles a chance to tie it.\n\n\r\n              But VanVleet stole the inbounds pass intended for James. VanVleet made 1 of 2 free throws to secure the victory.\n\n\r\n              Anthony Davis had 30 points and 13 rebounds for the Lakers. James added 21 points, 13 rebounds and nine assists.\n\n\r\n              Los Angeles used an 11-2 run, with six points from Davis, to get within two with 4 minutes to go. A dunk by Thompson started a 7-2 run that pushed Houston’s lead to 115-108 with 2 ½ minutes remaining.\n\n\r\n              The Rockets remained up by seven about a minute after that when a 3 by Davis cut the lead to 117-113 before the basket by James.\n\n\r\n              Takeaways\r\n              Lakers: Davis was dominant throughout this one but James struggled to get going early and had just five points at halftime.\n\n\r\n              Rockets: Thompson’s performance Sunday was a good sign for Houston. The second-year player is starting in place of Jabari Smith Jr., who could be out up to two months after breaking a bone in his hand Friday.\n\n\r\n              Key moment \r\n              The steal by VanVleet that sealed the victory.\n\n\r\n              Key stat\r\n              The Rockets had 52 points in the paint to 40 by the Lakers.\n\n\r\n              Up next\r\n              The Lakers visit Dallas on Tuesday night and the Rockets visit Washington that night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997181.441386
}