{
  "game_id": "0022400037",
  "espn_id": "401703406",
  "date": "Nov 26, 2024",
  "matchup": "HOU @ MIN",
  "headline": "Sengun records triple-double and Rockets beat Wolves 117-111 in OT to clinch NBA Cup group",
  "body": "MINNEAPOLIS -- — Alperen Sengun had 22 points, 10 rebounds and 11 assists, Fred VanVleet added 27 points and 11 assists, and the Houston Rockets pulled out a 117-111 overtime win against the Minnesota Timberwolves in an NBA Cup game on Tuesday night.\n\n\r\n              Dillon Brooks added 22 points for Houston, which improved to 3-0 in the competition and clinched West Group A and a spot in the NBA Cup quarterfinals.\n\n\r\n              Anthony Edwards had 29 points and 10 rebounds for Minnesota, which has lost three in a row. Julius Randle scored 21, while Naz Reid had 19 off the bench.\n\n\r\n              Rookie Rob Dillingham, the No. 8 pick in the draft out of Kentucky, had his best game of the season, helping to fill the void left by point guard Mike Conley, who missed his third straight game with a left great toe sprain. Dillingham had 12 points and season highs with seven assists and five rebounds.\n\n\r\n              Takeaways\r\n              Rockets: This young team has shown it’s for real, particularly on the defensive end. It had 12 steals, nine blocks and forced the Wolves into 17 turnovers that led to 16 points.\n\n\r\n              Timberwolves: Regardless of the loss, Minnesota needed this type of performance after back-to-back losses and a narrow win over Phoenix, which was without Kevin Durant and Bradley Beal.\n\n\r\n              Key moment\r\n              With 15 seconds left in regulation, Sengun got a pass on a drive to the basket for a potential layup, but Gobert came across for the block to keep the score tied. Edwards’ jumper on the other end was off the mark and the game went to overtime.\n\n\r\n              Key stat\r\n              Houston shot 15 of 37 from 3-point territory, including a 10 of 18 in the first half to build its lead.\n\n\r\n              UP NEXT\r\n              Both teams were playing the first game of a back-to-back set. Houston plays at Philadelphia on Wednesday night, while the Wolves stay home against Sacramento.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997403.613253
}