{
  "game_id": "0022400553",
  "espn_id": "401705119",
  "date": "Jan 13, 2025",
  "matchup": "LAC vs. MIA",
  "headline": "Harden's big 3rd quarter helps Clippers rally past Heat 109-98",
  "body": "INGLEWOOD, Calif. -- — James Harden scored 13 of his 26 points in a third-quarter revival that rallied the Los Angeles Clippers past the Miami Heat 109-98 on Monday night, snapping a two-game skid.\n\n\r\n              The Clippers were playing their first game in five days after their scheduled game on Saturday was postponed because of deadly wildfires in the Los Angeles area. White towels with LA Strong and the state of California in blue were given out.\n\n\r\n              Norman Powell led the Clippers with 29 points. Ivica Zubac had 21 points and a season-high 20 rebounds for his 25th double-double. Harden added 11 assists.\n\n\r\n              Tyler Herro had 32 points and 11 rebounds to lead Miami, which had its three-game winning streak snapped. Kel'el Ware added 19 points and a career-best 13 rebounds off the bench. \n\n\r\n              Takeaways\r\n              Heat: Miami center Bam Adebayo sat out with lower back pain from a fall at Portland on Saturday. Kevin Love started in his place and made three 3-pointers in the first quarter.\n\n\r\n              Clippers: Kawhi Leonard finished with six points on 3-of-9 shooting and five rebounds in 21 minutes during his third game of the season. He didn't play in the fourth quarter. Clippers coach Tyronn Lue said Leonard's minutes will continue to be restricted as he works to regain his rhythm after returning from injury.\n\n\r\n              Key moment\r\n              The Clippers outscored Miami 36-20 in the third quarter to take a 79-68 lead. They made six 3-pointers — three by Harden and three by Powell. Harden scored eight points in a row to pull the Clippers into a tie before they took the lead for good.\n\n\r\n              Key stat\r\n              The Heat fell to 3-2 on their six-game Western trip.\n\n\r\n              Up next\r\n              The Heat visit the Lakers on Wednesday night. The Clippers host Brooklyn on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998036.21935
}