{
  "game_id": "0021901276",
  "espn_id": "401224751",
  "date": "Aug 07, 2020",
  "matchup": "SAC @ BKN",
  "headline": "Minus stars, Nets clinch playoff spot in victory over Kings",
  "body": "LAKE BUENA VISTA, Fla. --  Caris LeVert scored 22 points, Jarrett Allen added 17 points, 11 rebounds and eight assists and the patchwork Brooklyn Nets clinched a playoff berth by beating the Sacramento Kings 119-106 on Friday.\n\nThe surprising Nets came to the bubble without stars Kevin Durant and Kyrie Irving but continued to display plenty of fight, improving to 3-2 since coming to Florida. Joe Harris added 21 points, shooting 8 of 11 from the field, including 5 of 7 from 3-point range.\n\n\"It's been great to see these guys trust each other in the limited amount of time we've been together and embrace playing together,\" Nets coach Jacque Vaughn said.\n\nThe Nets had a 78-62 lead midway through the third quarter but Bogdan Bogdanovic responded with five quick points to spark a Kings rally. Sacramento pulled within 80-76 before Garrett Temple's 3-pointer got Brooklyn back on track.\n\nBrooklyn pushed its advantage to 93-82 by the end of the third and kept a comfortable lead throughout the fourth. The Nets bounced back from a 149-115 loss to the Boston Celtics two nights before.\n\n\"We actually have a group of people who really like each other,\" Nets guard Tyler Johnson said. \"So we come back in, regroup, come in the next day and get ready to work. We don't sit around and feel bad for ourselves. It's a telltale sign of a maturing team.\"\n\nThe Kings were one day removed from an impressive 140-125 win over the New Orleans Pelicans but couldn't string together two wins and fell further behind in a crowded race for the final Western Conference playoff spot. Sacramento is 1-4 in the bubble.\n\n\"It's frustrating because coming into this game we knew it was more mental than physical,\" Kings forward Harrison Barnes said. \"It was meeting force with force. It was being disciplined. It doesn't matter what scheme we have or gameplan we have, when you don't have the effort needed to execute it doesn't matter. And tonight, we did not play with that effort.\"\n\nBogdanovic led the Kings with 27 points after scoring a career-high 35 against the Pelicans on Thursday. De'Aaron Fox added 21 and Buddy Hield added 17.\n\nLeVert scored 19 points in the first half and added five assists, four rebounds and two steals. Sacramento led 27-24 after one quarter but Brooklyn rallied with 39 points in the second quarter to take a 63-53 halftime lead.\n\nBIG BENCH\n\nBrooklyn got some vital production from its bench, including Johnson, who was waived by the Phoenix Suns earlier this season before being picked up by the Nets. The 6-foot-4 guard finished with 14 points.\n\nBackup guard Chris Chiozza had 14 points, four rebounds and six assists. Timothe Luwawu-Cabarrot added 10 points. The 5-11 Chiozza was particularly effective and the Nets had a plus-24 advantage while he was on the court.\n\nTIP-INS\n\nNets: Veteran G Jamal Crawford (left hamstring) did not play. ... Harris (groin) and Allen (ankle) were questionable but played.\n\nKings: G/F Kent Bazemore (left calf soreness) and F Marvin Bagley III (sprained foot) did not play. ... F Richaun Holmes (hip soreness) was questionable but started. He played 11 minutes in the first half, contributing one point and five rebounds, but did not play in the second half because of the hip issues.\n\nUP NEXT\n\nNets: Plays against the Clippers on Sunday.\n\nKings: Plays against the Rockets on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996374.336087
}