{
  "game_id": "0021900656",
  "espn_id": "401161298",
  "date": "Jan 22, 2020",
  "matchup": "ATL vs. LAC",
  "headline": "Collins, Goodwin rally Hawks from 21 down, beat Clips 102-95",
  "body": "ATLANTA --  With Trae Young cheering him on from the bench, two-way player Brandon Goodwin did a pretty good impression of the Atlanta Hawks' star.\n\nGoodwin scored 19 points -- all in the fourth quarter -- and the Hawks rallied from a 21-point deficit to stun the short-handed Los Angeles Clippers 102-95 on Wednesday night.\n\nJohn Collins scored 33 points and grabbed 16 rebounds, but it was Goodwin who took control in the final period. He made 6 of 11 shots, including all three attempts beyond the arc, and dished off to De'Andre Hunter in the corner for a 3-pointer that gave the Hawks a 99-93 lead with 1:43 remaining.\n\n\"Obviously, when I first got in there, I wasn't doing much,\" Goodwin said. \"When that first 3 fell, I was kind of relieved. I started to hit my shots.\"\n\nYoung, the NBA's third-leading scorer at 29.2 points a game, didn't dress because of a right thigh contusion. Recently acquired Jeff Teague started in his place, but the Hawks turned to a guy who has spent a good portion of the season in the G League with the game on the line.\n\n\"He controlled the offense and made big plays,\" Collins said. \"To give us the minutes he did was extremely valuable.\"\n\nThe Clippers seemingly seized control with a 20-0 run in the first quarter, despite missing starters Kawhi Leonard, Paul George and Patrick Beverly.\n\nLos Angeles went with a lineup that was averaging a cumulative 44.5 points a game. They had no trouble scoring in the first half against the Hawks' 28th-ranked defense, building a 60-41 at the break.\n\nBut the Clippers were dismal offensively in the second half, hitting just 12 of 37 (32.4%) from the field, including 2 of 15 from 3-point range.\n\n`A rough start,\" Collins said. \"But they didn't have a couple of their big guns. We knew we could play with them.\"\n\nClippers coach Doc Rivers felt his team squandered a chance to build an even bigger lead in the final minutes of the first half.\n\nThen, in the first five minutes of the third quarter, Los Angeles let the Hawks back in the game.\n\n\"Once it became a 10-point game, you're like, `Oh boy, it's going to be a tough night,\" Rivers said.\n\nMontrezl Harrell led Los Angeles with 30 points, but his struggles at the foul line (6 of 13) gave the Hawks a chance to rally.\n\nRivers didn't seem too concerned about the loss, which snapped a four-game winning streak.\n\n\"A one-off-game,\" he called it.\n\nLeonard skipped the back-to-back after a 36-point effort the previous night in a victory at Dallas. Beverly missed the game after going down out with a groin injury against the Mavericks. George missed his seventh straight game recovering from a strained left hamstring.\n\nWith many fans still settling into their seats, the Clippers suddenly turned a 12-10 deficit into a 30-12 lead. The Hawks missed 15 straight shots during a nearly six-minute scoring drought, despite giving themselves plenty of second chances by grabbing five offensive rebounds.\n\nThe Hawks rallied with a barrage of 3-pointers, hitting 10 of 23 over the final two quarters after going 1 of 12 in the first half.\n\nThey were essentially a two-man team in the final period. Goodwin and Collins combined for 27 of the team's 33 points.\n\nTEAGUE STARTS\n\nRecently acquired Jeff Teague made his first start for the Hawks since May 8, 2016, when Atlanta lost at Cleveland to complete a four-game sweep in the second round of the playoffs.\n\nHe returned to the Hawks last week in a trade with Minnesota, mainly to serve mainly as the backup point guard. With Young out, he moved into the starting lineup, rekindling memories of his starring role on the 2014-15 team that won 60 games and reached the Eastern Conference final.\n\nTeague managed just 3 points on 1 of 7 shooting, though he did lead the team with eight assists.\n\nTIP-INS\n\nClippers: Lou Williams and Terance Mann started in the Clippers backcourt. Williams scored 18 points, but Mann contributed just two assists and a single point in 15 1/2 minutes of playing time. ... Landry Chamet committed a dismal foul on Goodwin in the closing minutes, slamming into the Atlanta player after he misfired on a 3-pointer. Goodwin made all three free throws to give the Hawks a 96-91 lead.\n\nHawks: Bruno Fernando started at center, scoring six points and grabbing nine rebounds. ... Kevin Huerter (12 points) and Cam Reddish (10) were also in double figures for Atlanta. ... Improved to 6-16 at State Farm Arena, though still far off their pace from a season ago when they went 17-24 on their home court.\n\nUP NEXT\n\nClippers: Travel to Miami to face the Heat on Friday night, the fourth stop on their six-game trip.\n\nHawks: Hit the road for a game Friday night against the Oklahoma City Thunder.\n\n---\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 His work can be found at https://apnews.com\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996679.420225
}