{
  "game_id": "0022200032",
  "espn_id": "401468187",
  "date": "Oct 22, 2022",
  "matchup": "CHI vs. CLE",
  "headline": "Mitchell scores 32 points, Cavaliers roll past Bulls 128-96",
  "body": "CHICAGO -- — No Cavaliers player had opened a season with back-to-back 30-point games, not even LeBron James, until now. \n\n\r\n              That he became the first to do so was all well and good to Donovan Mitchell. More important to him was Cleveland getting its first win.\n\n\r\n              Mitchell scored 32 points, and the Cavaliers made it look easy, pounding the Bulls 128-96 Saturday night in Chicago's home opener.\n\n\r\n              “It's definitely an honor,\" he said. “I'm blessed to be able to do that. Hopefully, I can continue to build and do more. I'm just doing what's asked of me.”\n\n\r\n              Mitchell became the first player in franchise history to start a season with consecutive 30-point games, according to information supplied to the team by the Elias Sports Bureau, after scoring 31 in his Cleveland debut. The three-time All-Star whose arrival from Utah in a blockbuster trade sent expectations soaring just missed a triple-double with nine rebounds and eight assists. He also made four 3-pointers.\n\n\r\n              “He's doing so many other things other than scoring the ball at a high clip,\" Kevin Love said. “We know he's capable of that. Let me tell you first hand, to come to another team and step in the way he has, it's really impressive. He's just a gamer.”\n\n\r\n              Evan Mobley scored 16. Love and Cedi Osman added 15 points apiece. Love also made five of his team’s 16 3-pointers and grabbed 12 rebounds, helping the Cavaliers roll to an easy win after a season-opening loss at Toronto, even though All-Star guard Darius Garland missed the game because of an eye injury.\n\n\r\n              Zach LaVine led Chicago with 23 points after missing the first two games with the team trying to manage his left knee after he had surgery in May.\n\n\r\n              “For him having time off, I thought he came in and played well,” coach Billy Donovan said. \n\n\r\n              Nikola Vucevic scored 16. DeMar DeRozan had a rough night after averaging 34.5 points in the first two games. He scored 13 before picking up two technical fouls and getting ejected with 4:30 left in the game. The Bulls fell to 1-2 with their second straight loss. \n\n\r\n              “It's all about effort,” DeRozan said. “As close to 48 minutes as possible. We can’t have too many lapses like we did tonight and look up, make our job difficult when you realize you’re down 20.”\n\n\r\n              CAVS RESPOND\n\n\r\n              Cleveland led 80-61 early in the third before the Bulls reeled off 10 consecutive points. Vucevic hit back-to-back 3-pointers and DeRozan made two foul shots to make it a nine-point game.\n\n\r\n              But a wide open 3 by Love in transition and floater by Mitchell bumped the lead to 89-75 with 2:28 left in the quarter.\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Garland will probably miss Cleveland's home opener against Washington on Sunday, though coach J.B. Bickerstaff said “miracles do happen.” Garland suffered a laceration inside his eyelid in the first quarter of Cleveland’s season-opening loss to Toronto when Raptors guard Gary Trent Jr. inadvertently poked him in the eye going for a steal. \n\n\r\n              Bulls: Donovan said LaVine missing the first two games was not part of the original plan, while insisting the two-time All-Star's left knee remains structurally sound following surgery in May. Donovan said he experienced discomfort during a stretch of tough practices following the preseason finale against Milwaukee on Oct. 11. And though LaVine is not on a minutes restriction, the Bulls will monitor his workload particularly during busy stretches. “We knew we were going to have to manage that going into the season,” Donovan said. “We just didn't know when or what that would that would look like.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Washington on Sunday.\n\n\r\n              Bulls: Host Boston on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994300.5477288
}