{
  "game_id": "0022200290",
  "espn_id": "401468445",
  "date": "Nov 27, 2022",
  "matchup": "BKN vs. POR",
  "headline": "Durant, Seth Curry help Nets pull away, beat Blazers 111-94",
  "body": "NEW YORK -- — Kevin Durant scored 31 points, Seth Curry added a season-high 29 off the bench and the Brooklyn Nets beat the Portland Trail Blazers 111-94 on Sunday.\n\n\r\n              Curry was 7 for 10 on 3-pointers and had his highest point total with the Nets and the most by a Brooklyn reserve this season.\n\n\r\n              “I've always felt like if I get good shots I'm going to make them at a high clip,” Curry said. “Our offense was flowing pretty well. Guys found me open early on to start the game and I felt pretty good, aggressive.” \n\n\r\n              Kyrie Irving added 22 points for the Nets. Ben Simmons took just three shots but had 12 rebounds and eight assists.\n\n\r\n              “Ben did a great job of getting downhill,” Curry said. “He's a great passer (and) he knows how to find me out there on the floor.”\n\n\r\n              Jerami Grant scored 29 points for Portland. Jusuf Nurkic had 17 points and 14 rebounds, while Anfernee Simons added 15 points and Justice Winslow had 14.\n\n\r\n              The Nets have won four of their last six games, while the Trail Blazers, who are playing without Damian Lillard, have dropped five of six.\n\n\r\n              “Tough little stretch that we're in right now,” Portland coach Chauncey Billups said. “It is what it is. Every team goes through it.” \n\n\r\n              Brooklyn made 52.6% of its shots from the field overall, and 42.9% from 3-point range, in the second matchup between the teams in 10 days.\n\n\r\n              “It's a make-or-miss league,” Durant said. “It's about baskets.”\n\n\r\n              With the Nets leading by four entering the fourth, Curry scored Brooklyn’s first eight points of the quarter. Royce O’Neale's free throw gave the Nets a 93-87 lead and following a Portland turnover, Curry made a 3 that extended the advantage to nine.\n\n\r\n              Nurkic sandwiched a hook shot and free throw around two free throws by Irving to cut Brooklyn’s lead to 98-90. However, after a timeout, Durant hit a 3 to push the lead to 101-90.\n\n\r\n              Brooklyn led 58-57 at halftime, and 84-80 after the third quarter.\n\n\r\n              TIP-INS:\n\n\r\n              Trail Blazers: After going 27-55 last season, the Blazers are 11-8 and are looking for more. “Our core has been pretty healthy,” Billups said before the game. “We’ve given ourselves a chance to win most of our games just by how hard we play and us playing together.”\n\n\r\n              Nets: The matinee was the beginning of a season-high, seven-game homestand, and coach Jacque Vaughn is hoping that the Nets could use it to become a better, more focused team. “The value of each possession,” Vaughn said, when asked why the Nets appear to be intermittently connected over the course of games. “Sometimes we take that for granted (because) we can score and maybe make up the deficit. But we come out (the other night) and give up three straight 3s just because the concentration wasn’t there.”\n\n\r\n              UP NEXT:\n\n\r\n              Trail Blazers: Host the Clippers Tuesday.\n\n\r\n              Nets: Host Orlando on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994887.518213
}