{
  "game_id": "0021500954",
  "espn_id": "400828841",
  "date": "Mar 09, 2016",
  "matchup": "DET @ DAL",
  "headline": "Morris, Drummond help Pistons beat Mavericks 102-96",
  "body": "DALLAS -- The Detroit Pistons are moving in the right direction, while the Dallas Mavericks are looking for answers.\nMarcus Morris scored 20 points, including two 3-pointers during a decisive fourth-quarter run, and Andre Drummond had 25 points and 17 rebounds to help the Pistons beat the Mavericks 102-96 Wednesday night.\nDrummond leads the NBA with 54 double-doubles. Tobias Harris added 19 points for Detroit, which won its 33rd game -- one more than all of last season.\n\n\"We've got a younger team,\" Drummond said. \"(Coach) Stan (Van Gundy) has done a good job of bringing in guys that can really spread the floor. We have a lot of shooters on the team. It makes teams really think about who you're going to match up with.\"\nFollowing a tight first three quarters, Kentavious Caldwell-Pope stole an outlet pass and drove for a layup to give the Pistons an 82-81 lead in the fourth. That started a 12-2 run that included Morris' two 3s, the last to go up 92-83 with 5:21 to go. That was the largest lead either team held in the game.\nChandler Parsons and Dirk Nowitzki each scored 25 points for Dallas, which lost its season-high fourth in a row and has now lost 32 games, the same number it lost in all of 2014-15.\n\"We always do some good things,\" Nowitzki said. \"We just made some bad mistakes here and there, and some bad possessions. Some bad bounces, a missed rotation. When you're in a funk, you've got to play through your mistakes.\"\nThe Mavericks are in a stretch with nine out of 10 games at home but have gone 4-5 in that time.\nDetroit erased an eight-point deficit with a 17-2 run in the second quarter and led 54-52 at halftime. Drummond scored the team's last 10 points of the half over a 4:09 span despite making only 4 of 11 free throws during that stretch. He finished the half with 20 points.\nA TALE OF TWO POSSESSIONS\nAfter the Mavericks closed to 95-92 on Zaza Pachulia's three-point play with 2:07 remaining, Dallas forced a 24-second shot clock violation. But on the Mavericks' next possession, Detroit's defense forced a long 3 by Parsons that never reached the rim as the shot clock was running out.\nThe Mavericks answered on defense and returned the favor, forcing a long, off-balance 3 by Jackson just before the shot clock expired. But Jackson's shot went in, sealing the game.\n\"We picked up the defense right there,\" Nowitzki said. \"But we should have done that earlier and maybe had a lead, and that stuff doesn't happen.\"\nTAKING THE BAIT\nDallas coach Rick Carlisle claimed referee David Jones entered the Mavericks huddle and enticed Deron Williams into a technical foul with 7:33 left in the third quarter.\n\"He went out of his way,\" Carlisle said of Jones. \"He could have walked away from it. I said, `I got it. Let it go.' He said, `No. I got it.' He walked back into our huddle and baited Deron Williams into getting into a technical. And I don't think that that's right. A referee's job is to defuse a situation.\"\nJones would not comment to a pool reporter after the game, while Williams said he didn't want to comment and risk a fine.\nTIP-INS\nPistons: Detroit entered the night a half game behind Chicago for the last playoff spot in the Eastern Conference. ... Pistons forwards Stanley Johnson (sprained right shoulder) and Anthony Tolliver (sprained right knee) missed their seventh and eighth consecutive games, respectively.\nMavericks: This was the Mavs second of nine straight games against teams with winning records. ... Dallas played its 600th game at the American Airlines Center. Its first, on Oct. 30, 2001, also came against Detroit. The Mavericks are 440-160 at home since leaving Reunion Arena for the AAC.\nUP NEXT\nPistons: Visit Charlotte on Friday night.\nMavericks: Host Indiana on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994906.7246552
}