{
  "game_id": "0021600554",
  "espn_id": "400899975",
  "date": "Jan 07, 2017",
  "matchup": "CHI vs. TOR",
  "headline": "Butler scores 42, Bulls rally to beat Raptors 123-118 in OT",
  "body": "CHICAGO --  Jimmy Butler wasn't sure what to make of the \"MVP! MVP!\" chants. He insisted he's not worrying about any trade rumors.\n\nHe's just trying to focus on the job at hand, and is he ever locked in at the moment.\n\nButler scored 42 points, and the Chicago Bulls overcame a 19-point deficit to beat the Toronto Raptors 123-118 in overtime Saturday night.\n\nButler led a big run in the fourth quarter and nailed a spinning, fadeaway 3 with 17.3 seconds left in overtime for a five-point lead.\n\nHe also hit the 40-point mark for the third time in six games thanks to four 3-pointers and an 18-for-20 performance at the foul line. Dwyane Wade added 20 points, and Doug McDermott had 17 to help the Bulls win their 10th in a row against Toronto.\n\n\"My job is not to worry about what the media's writing, what's going on in the outside world,\" Butler said. \"My job is to come in here and work, try to help this team win games. We're all we have in here in. Good, bad indifferent, we always lean on each other. With all the hippidy-hoopla that's going around, just keep being you and keep working.\"\n\nButler once again did everything he could to lift the Bulls to their third straight win. He has gone from scoring 52 against Charlotte to pouring in 14 in the fourth quarter at Cleveland on Wednesday to scoring 32 after halftime to help Chicago beat Toronto.\n\nDeMar DeRozan led the Raptors with 36 points. Kyle Lowry added 27 points, 12 assists and nine rebounds, but the Atlantic Division leaders got outrebounded 60-41 and outscored 26-7 on second-chance points.\n\nThat helps explain how they went from leading by 19 late in the third quarter to losing for the fourth time in six games.\n\n\"You make your breaks, you set the tone, you maintain your tone, the intensity, the toughness,\" coach Dwane Casey said. \"You can't relax, no matter what the lead is in this league. With one-on-one players they have like Butler, different people, we did as good a job as you could, we put him on the free throw line 20 times, but that's what he does. When he does miss, we got to make sure we secure the rebound.\"\n\nFINAL PUSH\n\nIt was tied in overtime when McDermott hit three free throws and cut for a dunk to give the Bulls a 116-111 lead with 2:18 remaining. Two free throws by Lowry made it a three-point game. But Terrence Ross missed potential tying 3-pointers on back-to-back possessions.\n\nButler hit two free throws for Chicago after DeMarre Carroll converted 1 of 2 to make it 118-114 with 1:06 remaining. Lowry then drove for a layup to cut it to two, but Butler then buried the dagger.\n\nWith Lowry guarding him, he spun and stepped back beyond the arm and hit a fadeaway shot to make it 121-116 with 17.3 seconds left.\n\n\"Step-back 3 fading away,\" Lowry said. \"I'm comfortable guarding him. He made a tough shot. That's why he's an All-Star.\"\n\nIN REGULATION\n\nBoth teams had opportunities in the closing seconds of regulation.\n\nWade missed a spinning, driving layup and Felicio missed the tip-in. Toronto had a chance to win, but DeRozan missed a floater and Lowry could not knock down a fadeaway as time expired.\n\nThe Raptors led 82-63 late in the third quarter and were up 99-87 midway through the fourth when the Bulls went on a 14-0 run.\n\nButler scored nine in that stretch and fed Wade for a layup to put Chicago on top 101-99 with three minutes left. After Lowry hit a layup for Toronto, Mirotic made a corner 3 to put the Bulls back on top 104-101 with 2:18 left.\n\nTIP-INS\n\nRaptors: Toronto hasn't beaten the Bulls since Dec. 31, 2013. ... F Patrick Patterson missed his fourth straight game because of a strained left knee. ... DeRozan shot 16 of 17 from the foul line.\n\nBulls: PG Rajon Rondo did not play for the fourth straight game. ... G Denzell Valentine missed his second consecutive game because of a sprained left ankle. ... The Bulls went 36 for 39 at the foul line -- the most free throws they made since they converted 39 against Detroit in a quadruple-overtime game on Dec. 18, 2015.\n\nUP NEXT\n\nRaptors: Host Houston on Sunday.\n\nBulls: Host Oklahoma City on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995060.576421
}