{
  "game_id": "0021601015",
  "espn_id": "400900410",
  "date": "Mar 16, 2017",
  "matchup": "OKC @ TOR",
  "headline": "Another triple-double for Westbrook as Thunder top Raptors",
  "body": "TORONTO --  With four straight triple-doubles contributing directly to wins, Russell Westbrook's ability to make the Oklahoma City Thunder tick is undeniable.\n\nNot that there was any doubt on Thursday night as the NBA's leading scorer had 24 points, 16 assists and 10 rebounds to lead his team to a 123-102 blowout victory over the Toronto Raptors.\n\nIt was Westbrook's 34th triple-double of the season as he continued his assault on the NBA's single-season record for triple-doubles of 41, set by Oscar Robertson during the 1961-62 season.\n\nYou wouldn't know from his postgame comments, though, as he deflected the talk from his play to talk about the play of his teammates. In particular, he downplayed his role in an 18-6 second-quarter Thunder run in which he'd either scored or assisted on every point.\n\n\"They are an aggressive defensive team,\" he said of the Raptors. \"They like to trap and stuff, so my job was to use that to my advantage, take on two people and make sure the guys get open.\"\n\nThe Thunder led wire-to-wire from Steven Adams' hook shot 1:09 in and were rarely challenged, extending their lead to a game-high 32 points in the fourth quarter before running out the clock. The win split the season series with the Raptors.\n\nAlso instrumental in the victory was the play of Victor Oladipo, who chipped in with 23 points, as all five of Oklahoma City's starters registered double-digits in points, combining for 80 points.\n\n\"We just defended our butts off today,\" Oladipo said. \"Collectively as a group and we did it for 48 minutes and that's the reason why we were successful.\"\n\nCoach Billy Donovan was happy with the unselfishness of his team in registering 33 assists, and pointed to his team outscoring the opposition 39-22 in the third quarter as key to his team emerging with the win.\n\n\"We were able to get some consecutive stops and get out in transition and we got going and were able to increase the lead and close out the third,\" he said.\n\nThe Raptors held a closed-door meeting for more than 30 minutes following the loss, their third defeat in four games.\n\n\"That exhibition of basketball is unacceptable,\" coach Dwane Casey said afterward. \"I want to apologize to the fans, to everybody for the way we played tonight.\"\n\nDeMar DeRozan led the way with 22 points, one of five players who scored in double figures, but with just 14 games remaining, time is running out for the fourth-place Raptors to move up in the Eastern Conference.\n\nThe Raptors' leading scorer agreed with his coach's assessment, saying it ultimately came down to work ethic.\n\n\"That team played with a sense of urgency,\" he said of the Thunder. \"Everything you can think of from the get-go, we didn't do -- and the score told that.\"\n\nTIP-INS\n\nThunder: The victory tied the Thunder's season high by going 10 games over .500. ... Oklahoma City improved to 28-6 this season when Westbrook registers a triple-double, and 61-10 during his career. ... Westbrook's 16 assists beat the Raptors' team total of 15. ... All five of Oklahoma City's starters registered double-digit points.\n\nRaptors: G Kyle Lowry (right wrist) missed his 11th straight game since the All-Star break, with the team going 6-5 without him during that stretch. ... F DeMarre Carroll returned after missing the past two games with a sprained left ankle.\n\nHIGHLIGHT REEL\n\nWith 2:08 remaining in the second quarter, Westbrook picked up the ball and threaded a perfect bounce pass through the legs of Cory Joseph and into the hands of Oladipo, who had the simplest task of converting.\n\n\"Honestly, I didn't know if he was passing to me or Taj (Gibson),\" Oladipo said. \"I was running faster than Taj, so I just assumed it was for me. I honestly just looked down, I saw him throw it, I didn't see how he threw it, I looked down and the ball was just in my hands and I just laid it up, so it was kind of crazy.\"\n\nKYLE ON COURSE\n\nLowry continued his recovery from right wrist surgery this week, returning to New York City for what Casey termed a \"regular\" two-week check-up.\n\n\"It's on schedule, on time, but still no timetable or anything like that,\" he said, \"but everything checked out and it's where it should be right now.\"\n\nUP NEXT\n\nThunder: Host Sacramento on Saturday, aiming to improve on their 14-1 record at home against the Kings during the franchise's time in Oklahoma City.\n\nRaptors: At Detroit on Friday for the first of two visits to the Palace of Auburn Hills this season.",
  "source": "espn_api",
  "crawled_at": 1764995256.84957
}