{
  "game_id": "0021400877",
  "espn_id": "400579169",
  "date": "Mar 01, 2015",
  "matchup": "CHI vs. LAC",
  "headline": "DeAndre Jordan grabs 26 rebounds as Clippers win in Chicago",
  "body": "CHICAGO -- DeAndre Jordan's rebounding was too much for the short-handed Chicago Bulls.\nJordan continued his recent tear with 26 rebounds and Chris Paul had 28 points 12 assists and the Clippers earned a 96-86 victory over the Chicago Bulls on Sunday.\nJordan had 17 rebounds in the first two periods, the most by an NBA player in one half this season.\nIn his 300th straight game, the longest active streak in the league, the league's top rebounder also blocked two shots and altered several more.\n\"You look at the stat sheet, you don't see how many times (an opponent) didn't drive because D.J. was there, how many guys went up but didn't shoot because he was there,\" Paul said. \"He should be considered for MVP, but that's how the league works. It's an offensive league.\"\n\"What he's doing defensively, if he was doing that offensively, he would be recognized as the MVP or one of them,\" coach Doc Rivers said. \"But because it's defensively, no one notices.\"\nWell, almost no one.\n\"Particularly with Blake Griffin being out for them, (Jordan) is playing at an unbelievably high level,\" Bulls coach Tom Thibodeau said. \"When you look at their team and scoring margin, it tells you how good they are.\"\nJordan had at least 15 rebounds in his eighth straight game.\n\"I agree because I'm a big guy, but others don't. Our league is about points, obviously,\" he said.\nLos Angeles was behind 76-75 when Jamal Crawford made a 3-pointer with 8:02 left. It never trailed the rest of the way.\nAfter a scoreless first half, Crawford had 16 points in the final two quarters.\nThe Clippers extended their winning streak to five in a row in Chicago, the longest in franchise history. They haven't lost there since Dec. 17, 2008.\nRookie reserve Nikola Mirotic scored a career-high 29 points for a short-handed Bulls team that was without Derrick Rose (right knee surgery) and Taj Gibson (sprained left ankle).\nAnd with Jimmy Butler (sprained left elbow) sidelined for most of the second half and Pau Gasol less than 100 percent, Mirotic accounted for all but one of his team's 17 points in the fourth quarter.\nAaron Brooks finished with 14 points, and Joakim Noah had 13 points and 11 rebounds for Chicago.\n\"Without Derrick, Pau and Jimmy, somebody needed to shoot the ball,\" Mirotic said. \"My teammates were trying to find me. I took some tough shots.\"\nLos Angeles jumped to a 26-18 lead in the first quarter in which Paul scored eight points and Jordan grabbed nine rebounds. But with Paul on the bench at the start of the second period, Chicago went on a 12-2 run to go up 30-28. Mirotic scored eight of his 11 points in the quarter.\nThe Bulls shot only 39 percent in the field but managed to stay in the game because of a 22-13 advantage in free throws and a 17-13 edge in offensive rebounds.\n\"We've just got to find a way to win,\" Thibodeau said. \"It doesn't matter who's out. That was a winnable game down the stretch and we didn't get it done.\"\nThe Clippers improved to 2-1 on their four-game road trip. The Bulls lost for the third time in their past 10 games.\nTIP-INS:\nClippers: Matt Barnes was expected to sit out at least one game because of a strained right hamstring. He suffered the injury on a failed steal attempt in the second quarter and played with a limp the rest of the way. ... Griffin (right elbow surgery) sat out a ninth consecutive game. The Clippers have a 6-3 record with Spencer Hawes as his replacement in the starting lineup. ... Rivers remembered former New York Knicks forward Anthony Mason as a \"great teammate.\" Mason died of heart problems at 48 on Saturday. \"He was so tough and so loyal,\" Rivers said. \"We had a pretty crazy group when you think about Anthony Mason and John Starks and Greg Anthony and Patrick Ewing and Charles Oakley and Anthony Bonner all on one team. I was the saint on that team.\"\nBulls: Butler's status was unknown pending the results of an MRI on Monday. He ran into a Jordan pick three minutes into the second half and did not return. .. A moment of silence was observed for former White Sox star Minnie Minoso, who died earlier in the day. ... The home team wore its red Los Bulls uniforms as part of the league's annual Latin nights program.\nUP NEXT:\nClippers: Visit Minnesota on Monday night.\nBulls: Host Washington on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764991655.471864
}