{
  "game_id": "0022101099",
  "espn_id": "401360918",
  "date": "Mar 24, 2022",
  "matchup": "PHX @ DEN",
  "headline": "Paul's back, Suns clinch top seed with 140-130 win in Denver",
  "body": "DENVER -- — Chris Paul was eager to rejoin his teammates who were having all the fun even if that meant playing his first game in five weeks at altitude.\n\n\r\n              Paul returned from a broken right wrist that sidelined him since the All-Star break to help the Phoenix Suns win their seventh straight game and wrap up the top seed in the NBA playoffs with a 140-130 victory over Denver on Thursday night.\n\n\r\n              “I’ve been playing pickup, 3-on-3, 2-on-2, but 5-on-5 is totally different, especially when your first game back is in Denver. I mean, whew!\" said Paul, who had 17 points and 13 rebounds in serving as the ideal wingman for Devin Booker, who scored a season-high 49 points and 10 assists.\n\n\r\n              The number on Booker's mind, however, wasn't 49.\n\n\r\n              “Sixty wins is something I never even thought of, to be completely honest,” he said.\n\n\r\n              “We have a special team, it's that simple,” Paul said. \"But just being back for the warmup stuff, the pregame stuff, you know what I mean? There’s nothing like being part of this team. I’m just happy that I could get back.”\n\n\r\n              The Suns trailed most of the game, but used a 36-24 fourth quarter to improve to their NBA-best road record to 30-6.\n\n\r\n              “To beat that team, you have to play almost perfect basketball,\" Nuggets coach Michael Malone said. \"We did it for stretches tonight, but down the stretch they showed why they’re the best team in the NBA.\"\n\n\r\n              The Suns, who won 11 of the 15 games while their 12-time All-Star point guard was out, lead the NBA with a 60-14 record and are trying to make the NBA Finals for a second straight season after losing to Milwaukee last year.\n\n\r\n              “I don’t think one person in our locker room wasn’t thinking about 60 wins and what it meant,” Suns coach Monty Williams said after emerging from his boisterous locker room.\n\n\r\n              “I think getting Chris back tonight gave us a ton of confidence,” Williams said. “And Book having one of the best performances I’ve seen him have since I’ve been here ... the fact that he’s not in the MVP conversation is just somewhat silly.”\n\n\r\n              The large contingent of Suns fans sure serenaded Booker with chants of “MVP! MVP!” every time he stepped up to the line — and he responded by sinking 15 of 17 free throws. \n\n\r\n              Williams said before tip-off he was going to limit Paul's minutes but that didn't happen.\n\n\r\n              “I’m a liar. I said I wasn’t going to play him in the 30s. But I was talking to him and he kept letting me know he was fine,” Williams said. “And once he gets going you do not want to mess with that rhythm.”\n\n\r\n              The Nuggets got 28 points from Nikola Jokic, 23 from rookie Bones Hyland and 21 from Aaron Gordon. They shot 59.3% from the floor, but Phoenix was even hotter, hitting at a 60.5% clip.\n\n\r\n              Mikai Bridges added 22 points for the Suns, and it was his basket that gave Phoenix the lead for good at 115-114.\n\n\r\n              Booker was 16 of 25 from the field, while Bridges was 8 of 9. Booker, Bridges and Deandre Ayton played well in Paul’s absence and Ayton had a career-high 35 points Wednesday night in a comeback victory at Minnesota. He had 16 on Thursday night.\n\n\r\n              The Suns were worried that Paul might miss the remainder of the regular season because of the thumb injury, but the veteran has been active in recent practices in a push to return. \n\n\r\n              And even though the Suns did fine without Paul, Booker said he was thrilled “to see him back there and see him getting his legs back.”\n\n\r\n              With a nine-game lead over second-place Memphis with eight games left for both teams, the Suns wrapped up the best record in the NBA and home-court throughout the playoffs.\n\n\r\n              “It’s special, man,” Paul said. “It’s been 17 years for me and only the second time I’ve been on a team that won 60 games.\"\n\n\r\n              TIP-INS\n\n\r\n              Suns: Phoenix got off to a slow start, falling behind 9-2 but Paul's first basket tied it at 15 at the 6:33 mark. ... Booker fouled Hyland hard on a shot that wasn't whistled and then got fouled at the other end on a 3-point try. He made all three foul shots while boos rang down from the crowd.\n\n\r\n              Nuggets: Hyland sank 5 of 7 3-pointers in the first half when he scored 19 points. Along the way he he surpassed Jamal Murray’s rookie record of 115 3-pointers in a season. ... Jokic had an uncharacteristic eight turnovers, same as the entire Suns team.\n\n\r\n              TOAST MALONE\n\n\r\n              In his first comments since his  multi-year contract extension was announced this week, Nuggets coach Michael Malone said, “It's so empowering when you have ownership continue to believe in you. Obviously, seven years in one place in a lifetime in this business. And to know that we have work to do and we’ll be here for a while longer. is just really, really exciting for me and my family.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Philadelphia on Sunday.\n\n\r\n              Nuggets: Host Oklahoma City on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993654.5132601
}