{
  "game_id": "0021901294",
  "espn_id": "401224769",
  "date": "Aug 10, 2020",
  "matchup": "TOR @ MIL",
  "headline": "Raptors beat Bucks 114-106; key players for both teams sit",
  "body": "LAKE BUENA VISTA, Fla. --  Chris Boucher scored a career-high 25 points and grabbed 11 rebounds to help the Toronto Raptors defeat the Milwaukee Bucks 114-106 on Monday.\n\nThough the meeting featured the top two teams in the Eastern Conference standings, both teams were missing key players.\n\nMilwaukee's Giannis Antetokounmpo, the reigning MVP, missed the game after undergoing oral surgery. Bucks coach Mike Budehnolzer said Monday it was uncertain whether Antetokounmpo would play in the team's final two seeding games Tuesday against the Washington Wizards and Thursday against the Memphis Grizzlies.\n\nFor Toronto, Kyle Lowry sat out with a sore lower back, Serge Ibaka missed the game with a bruised right knee and Fred VanVleet was out with a hyperextended right knee.\n\nBoucher made the most of it.\n\n\"We knew some guys was going to be out, so obviously, there was an opportunity,\" he said. \"All year, that's what I've been doing. Every time I get a chance to play 20, 25 minutes -- everybody on this team is doing the same thing. Just being ready and when the opportunity is there -- to play hard and show what you're capable of doing.\"\n\nThe Bucks already had clinched the No. 1 seed in the Eastern Conference for a second straight season, and defending NBA champion Toronto was locked into the No. 2 spot, so there was little to gain for either team.\n\nRookie Matt Thomas scored a season-high 22 points. Raptors coach Nick Nurse said he was glad to see Boucher and Thomas and step up. Boucher averages 6.1 points per game and Thomas averages 4.3.\n\n\"The other guys want to play more than they're playing, and it's hard to find them room sometimes,\" Nurse said. \"It's just a numbers game. I believe in both of them.\"\n\nNorman Powell added points 21 for the Raptors, who improved to 5-1 in the restart.\n\nKyle Korver scored 19 points and Khris Middleton added 17 for the Bucks, who fell to 2-4 since the restart.\n\n\"Most concerning is continued not (having) the effort and execution defensively, not being who we are, being as good and committed as we are on that end of the court,\" Bucks coach Mike Budenholzer said.\n\nTIP-INS\n\nBucks: Toronto's Paul Watson elbowed Korver on a drive to the hoop in the fourth quarter. It was called a Flagrant 1, and Korver ended up with a small cut on his face. Korver stayed in the game, made the free throws, then made a 3-pointer three seconds later. ... Eric Bledsoe had 11 points, seven rebounds and eight assists.\n\nRaptors: Pascal Siakam scored 14 points on 5 for 16 shooting. ... Marc Gasol went scoreless in 20 minutes. ... Forced 19 turnovers.\n\nMINOR DRIP\n\nA small amount of water dripped onto the floor near midcourt before the start of the game. An NBA spokesman said the issue might have been condensation. The game started on time, and gameplay was not affected.\n\nBUCKS BUMPS AND BRUISES\n\nMilwaukee's Pat Connaughton had an awkward fall and hit the back of his head on the floor. Budenholzer said he was fine, but the team will monitor him. Budenholzer also said Wesley Matthews had an issue with his quad/groin areas, and his minutes were limited for precautionary reasons.\n\nUP NEXT\n\nBucks: Play the Washington Wizards on Tuesday.\n\nRaptors: Play the Philadelphia 76ers on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995571.387291
}