{
  "game_id": "0021900213",
  "espn_id": "401160855",
  "date": "Nov 21, 2019",
  "matchup": "MIL vs. POR",
  "headline": "Giannis Antetokounmpo posts triple-double as Bucks beat Trail Blazers",
  "body": "MILWAUKEE -- The Milwaukee crowd greeted Carmelo Anthony with a loud ovation when the 10-time All-Star was introduced before the game. It cheered louder after the Bucks extended their winning streak to six straight.\nGiannis Antetokounmpo had his second triple-double of the season and Milwaukee beat Anthony and the short-handed Portland Trail Blazers 137-129 on Thursday night.\n\"Giannis is Giannis,\" Anthony said about the reining MVP. \"He's a tough check. I thought tonight we actually did a pretty good job. Even though he had a triple-double, when you look at that, it's like `Oh, he had a hell of a game.' But I thought, for the most part, we were back on him. We loaded up on him. He got some and-1s, he got going a little bit. ... He found some guys, they made some 3s, kind of opened the game up.\"\nAntetokounmpo had 24 points, 19 rebounds and a career-high 15 assists to lead the Bucks to their seventh win in the last nine games against Portland.\n\"I couldn't get going offensively,\" Antetokounmpo said. \"Shots weren't falling and they were showing a lot of crowds. I tried to find my teammates and they were in the right spots. They were able to knock down shots and to roll hard. I just did half of the work and my teammates did the rest.\"\nAntetokounmpo, who also had a triple-double in the season opener, became the first player in franchise history to record a game with 20 points, 15 rebounds and 15 assists. The 6-foot-11 forward has 16 career triple-doubles. Milwaukee is 14-2 in those games.\nEric Bledsoe added 30 points and six assists in the Bucks' highest-scoring game of the season.\nAfter scoring 10 points on 4-of-14 shooting in 24 minutes in his season debut Tuesday night against the Pelicans, Anthony had 10 points in the first half Thursday. Anthony finished with 18 points (6-of-15 shooting) and seven rebounds for the Trail Blazers, who were without Hassan Whiteside (hip), Damian Lillard (back), Zach Collins (shoulder) and Jusuf Nurkic (leg).\n\"He's getting his sea legs after having that year off,\" Portland guard CJ McCollum said about Anthony. \"Getting used to that movement, getting used to how the game is flowing.\"\nMcCollum scored 37 points and Skal Labissiere added 22 points, 12 rebounds and five blocks for Portland. The Trail Blazers lost their third straight game overall and their sixth straight in Milwaukee.\nThe Bucks made their first seven shots, including three 3s, and led 17-6. Milwaukee never trailed.\nThe Bucks also had their highest first-half total, leading 72-58.\nThe Blazers used a 40-point third quarter to close the gap and pulled within 117-115 with just over 7:00 play. But Brook Lopez and Wes Matthews hit back-to-back 3s to seal the Bucks victory.\n\"I thought we competed,\" McCollum said. \"I thought we played hard. Obviously, we came up short. But I thought it was a step in the right direction.\"\nMilwaukee made 21 of 26 free throws against 12 of 14 for the Trail Blazers and outrebounded Portland 58-41.\n\"Keep in mind, their starting center (Lopez) didn't even get a rebound,\" Trail Blazers coach Terry Stotts said. \"So they did all that rebounding without even their center getting it. So they got them from a lot of different positions. We have to be aware of it. We can't assume that anybody else is going to get it. We don't have one guy that's going to go snatch all the rebounds. We gotta do it with five guys.\"\nTIP-IN\nAntetokounmpo made his first career NBA start against Anthony. The date was Dec. 18, 2013. Giannis had 10 points and seven rebounds before fouling out. Carmelo scored 29 points in New York's victory.\nUP NEXT\nTrail Blazers: At Cleveland on Saturday night.\nBucks: Host Detroit on Saturday night.\n---\nFollow Keith Jenkins on Twitter: https://twitter.com/MrKeithJenkins\n---\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996171.334688
}