{
  "game_id": "0021600567",
  "espn_id": "400899988",
  "date": "Jan 08, 2017",
  "matchup": "LAL vs. ORL",
  "headline": "Lakers beat Magic 111-95 for 2nd straight victory",
  "body": "LOS ANGELES --  The young Lakers players are starting to show improvement.\n\nLos Angeles used No. 2 picks the last two years on D'Angelo Russell and Brandon Ingram, and a No. 7 on Julius Randle in 2014, who promptly missed all but one game of his rookie season with a broken leg.\n\nNow the trio are starting to pay dividends, including helping Los Angeles to a 111-95 win over the Orlando Magic on Sunday night.\n\nRandle led the Lakers with 19 points and nine rebounds. Russell had 17 points, eight rebounds and seven assists and Ingram matched his career-high for the second consecutive game with 17 points.\n\nLakers coach Luke Walton said Randle, 22, and Russell, 20, gradually have shown improved commitment to their work ethic.\n\n\"We all knew they had the talent to be really good, but I think it's the fact that they really stepped up their professionalism as far as the way they're treating their bodies and approaching practice and every opportunity. It's a direct result from that,\" Walton said.\n\nThe young trio enabled the 15-26 Lakers to put together consecutive victories for the first time in 30 games. The last time the Lakers won a second consecutive game was Nov. 12.\n\nSerge Ibaka, Evan Fournier and Nikola Vucevic each scored 19 points for Orlando, which could not overcome a disastrous start to the second half.\n\nThe Magic trailed by two at the break, but missed their first 10 shots in the second half. They did not connect on a field goal until Ibaka hit a driving hook shot with 4:47 left in the third quarter. Orlando finished just 2 of 10 from the field in third.\n\n\"We settled too much for the perimeter,\" said Magic coach Frank Vogel. \"Going ice cold in the third did us in.\"\n\nIngram was shooting a disappointing 34.5 percent a week ago, but in his last four games has gone 17 of 28 from the field.\n\n\"I'm starting to feel comfortable, just finding openings in the offense and trying to make plays for myself and also for my teammates,\" Ingram said.\n\nTIP-INS\n\nMagic: Vucevic started the first 16 games of the season, averaging 11.8 points, 11.5 rebounds and 27.6 minutes per game while shooting 43.7 percent. In his next 19 games off the bench, he's averaged 14.1 points and 9.5 rebounds in 28.7 minutes, shooting 46.5 percent. ... Orlando is 29th in free-throw percentage (71.4).\n\nLakers: Forward Larry Nance Jr., out since Dec. 20 with a left knee bruise, continues to improve and has begun shooting. \"Hopefully, he's close,\" Walton said. The season-high 127 points the Lakers scored in their win Friday against the Miami Heat included a season-high 62 rebounds.\n\nGETTING DEFENSIVE\n\nLos Angeles held the Magic to just nine points in the third period, a season low for any quarter by a Lakers opponent. The Lakers forced 18 turnovers.\n\nRANDLE UPTICK\n\nThe new year has seen a more aggressive and productive second-year forward for the Lakers. In his last seven games, he's averaged 18.3 points. \"Our practices are carrying over,\" Randle said. \"We are locked in as a unit and just trying to take advantage.\"\n\nUP NEXT\n\nMagic: Remain in Los Angeles to play the Clippers on Wednesday night. Orlando has lost its last six to the Clippers, who now have All-Star guard Chris Paul back from a hamstring injury.\n\nLakers: Play the Trail Blazers for the second time in six days when they host Portland on Tuesday night. The Lakers have lost a team-record nine consecutive games to the Trail Blazers after their 118-109 loss in Portland on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764995404.9488032
}