{
  "game_id": "0022000407",
  "espn_id": "401267567",
  "date": "Feb 13, 2021",
  "matchup": "ATL vs. IND",
  "headline": "McDermott, Turner spark Pacers past struggling Hawks",
  "body": "ATLANTA -- — Doug McDermott scored 26 points, Myles Turner had 19 points and 10 rebounds, and the Indiana Pacers won their second straight game with a 125-113 victory over the Atlanta Hawks on Saturday night.\n\n\r\n                    The Hawks blew a nine-point lead in the fourth quarter as Indiana scored 41 points in the final period and used a 27-7 run to take control of the game. It marked the first time this season that the Pacers have scored 40 or more points in a quarter.\n\n\r\n                    Aaron Holiday was the spark with the outcome on the line, scoring 13 of his 18 points in the fourth.\n\n\r\n                    “We just stuck with it,\" Holiday said. “In the first half, they crept back into the game right before the half ended. We wanted to pick up the pace, move the ball on offense and lock in on defense.\"\n\n\r\n                    Atlanta, a loser in six of its last seven, got 24 points and 10 rebounds from Clint Capela. Trae Young had 15 points and 14 assists but didn’t attempt a 3-pointer for just the second time in his career.\n\n\r\n                    “I think (coach Nate Bjorkgren) has really put a huge emphasis on it,\" McDermott said. “We know where every guy shoots going into the game. He really wants us to flush them off the line.\"\n\n\r\n                    The Hawks took a 73-72 lead on Young’s floater with 8:10 left in the third. A pair of free throws by John Collins matched Atlanta’s biggest lead at the time at eight at the 3:37 mark, and the Hawks were up 87-84 entering the fourth.\n\n\r\n                    It didn’t last long. Leading by nine after a pair of free throws by Cam Reddish, the Hawks were outscored by 20 points before McDermott hit a pair of free throws with 3:03 remaining.\n\n\r\n                    “I think three of the plays Aaron Holiday made were containment plays,\" Atlanta coach Lloyd Pierce said. “Three of the 3s that were given up were tough shots. How do you take away Aaron Holiday’s 3-point shot over Cam? How do you get to Myles Turner a little bit quicker on his catch and shoot? How do you get to his body earlier so he doesn’t have that look? Obviously they all went in, so it looks and feels a lot worse.\"\n\n\r\n                    JaKarr Sampson’s runner gave Indiana its first double-digit lead midway through the second. The Hawks trimmed the lead to one on Capela’s layup before the Pacers were up 62-58 at halftime.\n\n\r\n                    TIP-INS\n\n\r\n                    Pacers: Each of the starters came over to give Hawks assistant Nate McMillan, their former head coach, a hug a few seconds before tipoff. It was the first the teams have played this season. ... Jeremy Lamb came off the bench for the second straight game as coach Nate Bjorkgren stayed with McDermott in the starting lineup. Lamb had seven points in 19 minutes. ... Lamb began the game leading the team with a 96.6% on free throws. He had made 24 in a row before missing in the fourth.\n\n\r\n                    Hawks: Rookie G Skylar Mays, coming off a 20-point performance in Friday’s loss to San Antonio, was the first player off the bench, replacing Reddish midway through the first. Mays finished with no points in nine minutes. ... Young failed to score 20 for the first time in his last 13 games. ... Danilo Gallinari began the game as the NBA’s leader in free throw percentage, but missed for the first time in 22 attempts at the end of the first. ... F De’Andre Hunter (right knee surgery), G Bogdan Bogdanovic (right knee fracture), G Kris Dunn (right ankle surgery), Rajon Rondo (lower back pain) and G Tony Snell (right Achilles tenderness) were out. \n\n\r\n                    LOOKING FOR A ROLE\n\n\r\n                    Pierce said rookie forward Onyeka Okongwu, the No. 6 overall draft pick, is progressing slowly after the cancellation of the NBA Summer League and a left foot injury that delayed his debut until last month. Okongwu, who did not play against the Pacers, is still trying to carve out a role.\n\n\r\n                    “We’re not throwing him out there to be a rotational player right now,” Pierce said. “We’re throwing him out there mainly because we need a body and it does give him an opportunity to get his feet wet some.”\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Host Chicago on Monday.\n\n\r\n                    Hawks: Visit the New York Knicks on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997838.829176
}