{
  "game_id": "0022300535",
  "espn_id": "401585163",
  "date": "Jan 12, 2024",
  "matchup": "ORL @ MIA",
  "headline": "Heat get go-ahead basket from Adebayo, top Magic 99-96 in rare low-scoring game this season",
  "body": "MIAMI -- — By current NBA standards, this was a throwback: A team won without scoring 100 points.\n\n\r\n              Such a thing hadn't happened in more than a month, until the Miami Heat pulled it off on Friday night. Duncan Robinson scored 23 points, Bam Adebayo hit the go-ahead jumper with 18.5 seconds left and the Heat beat the Orlando Magic 99-96.\n\n\r\n              NBA teams are 7-107 this season when scoring fewer than 100 points. Miami got the league's first sub-100-point win since Houston beat San Antonio 93-82 on Dec. 11.\n\n\r\n              “And I think the fans really enjoyed it,” Heat coach Erik Spoelstra said.\n\n\r\n              Heat fans did, anyway. Adebayo finished with 21 points, 11 rebounds and seven assists, while Jaime Jaquez Jr. had 19 points.\n\n\r\n              Paolo Banchero finished with 25 points, eight rebounds and six assists for the Magic. He missed three tries in the final seconds -- two from relatively close range with Orlando down by one on its next-to-last possession, the second of those slipping out of his hands, then a desperation 30-footer on the game’s final attempt.\n\n\r\n              “Got to my spot at the end and had another great look,\" Banchero said. “Can't ask for a better opportunity than that. ... I think we played well enough to win.”\n\n\r\n              Moe Wagner scored 19, Chuma Okeke had 16 and Joe Ingles added 14 for Orlando, which went 12 for 20 from the line and dropped to 7-12 in its last 19 games. The Magic opened a four-game, six-night trip that also includes stops in Oklahoma City, New York and Atlanta.\n\n\r\n              It was only the seventh time this season that an NBA game was won without scoring 100 points. Miami had been 0-6 in such games this season; the Magic had been 8-0 when holding teams under 100.\n\n\r\n              “It is more of a marathon than it is a sprint right now,” Magic coach Jamahl Mosley said. “This one stings and it hurts, but it's also a lesson a young team is going to learn as we get through this.”\n\n\r\n              Banchero made a tough turnaround with 1:10 left to get the Magic within one. Orlando got a stop on the next Miami possession and went to Banchero again. He hit from the right baseline to put the Magic up 96-95 with 38 seconds remaining.\n\n\r\n              It was Orlando’s first lead since late in the third quarter, but Adebayo put the Heat ahead to stay on the next possession.\n\n\r\n              “We ran a lot of actions through him down the stretch and he hit the big one to give us the lead,” Spoelstra said.\n\n\r\n              Miami was again without Jimmy Butler, whose right foot injury is improving but had to sit for the 10th time in the last 11 games. Kyle Lowry (sprained left hand) missed his second straight game and Tyler Herro (strained right shoulder) sat out after getting hurt in Wednesday’s loss to Oklahoma City.\n\n\r\n              The Heat got Caleb Martin back after he missed seven games with a sprained ankle; he finished with 11 points.\n\n\r\n              Orlando was without Franz Wagner (sprained ankle) and Wendell Carter Jr. (sore right knee). It was the fourth consecutive missed game for both; Carter has appeared in only 13 games so far this season. Jalen Suggs played only 14 minutes, largely because he was dealing with an illness that seems to be working its way through Orlando's locker room.\n\n\r\n              Miami improved to 8-0 against Southeast Division opponents, keeping the Heat as the last team in the NBA unbeaten in division games this season. The Heat conclude their four-game homestand Sunday against Charlotte, a game that will include a ceremony commemorating Dwyane Wade’s enshrinement into the Basketball Hall of Fame last year.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Visit Oklahoma City on Saturday.\n\n\r\n              Heat: Host Charlotte on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995709.6429398
}