{
  "game_id": "0022000224",
  "espn_id": "401267384",
  "date": "Jan 20, 2021",
  "matchup": "SAC @ LAC",
  "headline": "Clippers beat Kings 115-96 for season-high 5th straight win",
  "body": "LOS ANGELES -- — Kawhi Leonard scored 32 points, Paul George added 19 and the Los Angeles Clippers beat the Sacramento Kings 115-96 on Wednesday night for their season-high fifth consecutive victory.\n\n\r\n                    The Clippers handed the Kings a 38-point loss at their place last Friday. A new week didn’t change anything. Sacramento dropped its fourth in a row and sixth in seven games.\n\n\r\n                    George tied his career high with 12 assists to go with a team-high six turnovers.\n\n\r\n                    “I got to be better and take care of the ball a lot better, but for me, it’s fun,” George said. “It’s not going to be perfect, but I thrive being on the floor and trying to make my teammates better.”\n\n\r\n                    De'Aaron Fox scored 17 of his 25 points in the first half for the Kings. Glenn Robinson III added 14 points off the bench. Buddy Hield had 11 of his 13 points in the first half, when the Kings led by six.\n\n\r\n                    “We see the mistakes and see what needs to be done. Now it’s on us to fix it,” Robinson said. “We’re still remaining positive.”\n\n\r\n                    Ivica Zubac had 11 points and a season-high 12 rebounds in his new role coming off the bench this season instead of starting.\n\n\r\n                    “We got to keep pumping Zu. Zu just doesn’t know how dominant he can be,” George said. “You forget how young he is and he’s still a baby. He's got to own being the biggest guy on the floor.”\n\n\r\n                    The Clippers improved to 8-1 in games in which they've owned 20-point leads.\n\n\r\n                    “We're still trying to get better. That’s our mindset,” Leonard said. “We want to keep it moving. It’s the first leg of the season, we got to finish it out. We’re not satisfied.”\n\n\r\n                    The Clippers broke the game open with 34 points in the third quarter, when they had scoring runs of 9-0 and 13-0. Leonard and Zubac had five points apiece in the second spurt that helped send Los Angeles into the fourth leading 95-75.\n\n\r\n                    Leonard had 10 points and George seven in the third. The Clippers repeatedly got stops on the defensive end, which helped them score in transition. They shot 52% from the field and limited the Kings to 19 points in the period.\n\n\r\n                    “Those guys are doing a good job coming out with a defensive mindset,” Clippers coach Tyronn Lue said of his team.\n\n\r\n                    The Kings barely outscored the Clippers 21-20 in the fourth, but they never seriously cut into their deficit.\n\n\r\n                    “You could see when we do play the right way and move the ball, it’s believing in that the whole game and believing in each other,” Robinson said.\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: They fell to 1-4 on the road overall, and have dropped four in a row away from home. ... DaQuan Jeffries (left ankle sprain), Jahmi'us Ramsey (left groin strain) and Hassan Whiteside missed the game.\n\n\r\n                    Clippers: They've made at least 15 3-pointers in five straight games, a franchise record. ... Lou Williams had six points in his return after missing two games with left hip discomfort.\n\n\r\n                    HE SAID IT\n\n\r\n                    “I don’t have to put a battery in his back and encourage him to play the way he’s been playing.” — Leonard on George's early-season production.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Host New York Knicks on Friday.\n\n\r\n                    Clippers: Host Oklahoma City on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997190.883796
}