{
  "game_id": "0022300682",
  "espn_id": "401585310",
  "date": "Jan 31, 2024",
  "matchup": "DEN @ OKC",
  "headline": "Gilgeous-Alexander scores 34 points, Thunder beat short-handed Nuggets 105-100",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 34 points to help the Oklahoma City Thunder beat the short-handed Denver Nuggets 105-100 on Wednesday night in a matchup of teams near the top of the Western Conference standings.\n\n\r\n              Denver star Nikola Jokic sat out because of pain in his lower back. Oklahoma City took advantage of the two-time league MVP's absence by holding the defending champion Nuggets to 39.8% shooting. \n\n\r\n              Oklahoma City's MVP contender wasn't sure he'd play, either. Gilgeous-Alexander was questionable but ended up with his 14th game in January with at least 30 points.\n\n\r\n              “Dealing with a little bit of illness, but I (felt) good enough to play, obviously,\" he said. \"I wasn’t sure when I got listed. I wasn’t sure whether I’d be able to go tonight before the game, before a couple naps, couple sleeps. I had enough in me to go.”\n\n\r\n              Chet Holmgren had 18 points, 13 rebounds and five blocks and reserves Aaron Wiggins and Vasilije Micic each added 12 points for the Thunder. \n\n\r\n              Oklahoma City guard Jalen Williams, the team’s No. 2 scorer this season, was out with a sprained right ankle and reserve guard Isaiah Joe sat out with a bruised sternum.\n\n\r\n              “I just thought the team, like, solved problems together,\" Thunder coach Mark Daigneault said. “It was a great team win. We got contributions from everybody. In a game that was obviously a grind, I was just really, really impressed with the energy that we were able to tap into tonight.” \n\n\r\n              The Thunder won the season series 3-1 and avoided their first three-game skid of the season. Oklahoma City outrebounded Denver 53-47 and outscored the Nuggets 20-11 at the free throw line.\n\n\r\n              Aaron Gordon had 16 points, 13 rebounds and seven assists for the Nuggets.\n\n\r\n              “I thought he was just phenomenal in terms of the effort and the aggression, the playmaking, the shot blocking, the defense,\" Denver coach Michael Malone said. \"I mean, we asked a lot of him tonight. ... I thought Aaron was just, phenomenal across the board tonight. And, it’s unfortunate that we weren’t able to get the win.”\n\n\r\n              Michael Porter Jr. added 15 points and eight rebounds for the Nuggets.\n\n\r\n              Oklahoma City led 73-72 heading into the fourth and opened the period on a 10-0 run, highlighted by a 3-pointer from Lu Dort. Holmgren's one-handed putback of a missed 3-pointer by Cason Wallace put the Thunder ahead 87-74.\n\n\r\n              Denver cut its deficit to four before Gilgeous-Alexander scored on a 3-point play, then a 3-pointer, to put Oklahoma City up 10 with about four minutes remaining.\n\n\r\n              Denver stayed focused. Gordon's one-handed dunk in traffic cut Oklahoma City's lead to 98-95, and a pair of free throws by Jamal Murray made it a one-point game.\n\n\r\n              Holmgren's 3-pointer gave Oklahoma City a four-point lead with 22 seconds left. The Thunder then harassed Denver into a five-second call and hung on from there. \n\n\r\n              “We have guys on our team want to win, and will do whatever it takes,\" Gilgeous-Alexander said. \"And no matter what’s going on, in the past and future, all you can do is control the present. And I think we did that tonight. We took it possession by possession. We gave it everything we had those possessions, and it was enough to win, and we were rewarded because of it.”\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Portland on Friday night.\n\n\r\n              Thunder: Host Charlotte on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996755.428225
}