{
  "game_id": "0022000081",
  "espn_id": "401267241",
  "date": "Jan 02, 2021",
  "matchup": "ORL vs. OKC",
  "headline": "Thunder dominate second half and beat Magic 108-99",
  "body": "ORLANDO, Fla. -- — Darius Bazley had a season-high 19 points, George Hill scored 13 of his 18 points in the third quarter and the Oklahoma City Thunder dominated the second half of a 108-99 win over the Orlando Magic on Saturday.\n\n\r\n                    The Thunder ended a three-game losing streak and bounced back nicely from a 33-point loss to New Orleans two nights earlier. Oklahoma City also avenged a 118-107 home loss against the Magic five nights ago.\n\n\r\n                    “I just thought it was a good, resilient game for us because we carried a lot of stuff over from the New Orleans game that we wanted to address and from the last time we played Orlando,” coach Mark Daigneault said. “Orlando is a good team that makes you play a clean game to win and I was pleased with how we did that.”\n\n\r\n                    Orlando (4-2) has dropped two straight after starting the season 4-0. The Magic were routed 116-92 by Philadelphia on New Year’s Eve and lost on Saturday after making just 37% of their shots. \n\n\r\n                    Orlando was even worse in the fourth quarter when it made just eight of 28 shots (28.5%) and missed all 10 of its tries from 3-point range. That allowed the Thunder to outscore the Magic 24-17 over the final 12 minutes to break open a close game.\n\n\r\n                    “It started with one-on-one defense and we weren’t getting stops,” said Magic forward Aaron Gordon, who had 15 points, eight rebounds and five assists, but made only 6 of 15 field goal attempts. “It’s just one-on-one defense and that just comes down to pride, technique and energy.”\n\n\r\n                    Nikola Vucevic scored a season-best 30 points by making 13 of 21 shots, including four 3-pointers. He also grabbed 13 rebounds. Terrence Ross added 26 points and four 3-pointers off the Orlando bench.\n\n\r\n                    Six players scored in double digits for Oklahoma City, which shot 44.2% from the floor with 13 3-pointers. Shai Gilgeous-Alexander added 16 points, while Al Horford, Hamidou Diallo and rookie Theo Maledon each scored 12 points.\n\n\r\n                    Bazley converted a driving, left-handed dunk with 4:37 left to give the Thunder a 99-91 lead, their largest of the night up to that point. Horford drilled a straight-on 3-pointer with 50 seconds to play, sending the Thunder on their way to the second road victory of the season.\n\n\r\n                    “Our coaches really harped on what we needed to improve upon from last game and we carried it over,” Horford said. “We did much better job of setting the tone early in the game.”\n\n\r\n                    The Thunder trailed by three points just after halftime, but they grabbed the lead late in the third quarter and never trailed the rest of the way. They outscored the Magic 22-15 in the fourth period.\n\n\r\n                    Standout guard Evan Fournier missed Saturday’s game with back spasms. Michael Carter-Williams started in place of Fournier and missed nine of his 11 shots and all four tries from 3-point range.\n\n\r\n                    “We struggled a little offensively, especially toward the end, because we didn’t work the offense enough and we could have gotten some better shots,” said Vucevic, who missed four of his six attempts in the final quarter.\n\n\r\n                    TIP INS\n\n\r\n                    Thunder: Saturday’s game was the first stop on a five-game, 10-day road trip for the Thunder. The trip will allow the Thunder to face two teams — Orlando and New Orleans — that they have already lost to this season. ... The Thunder entered Saturday’s game ranked 30th in the league in free throw percentage (62.3%), 29th in makes (12) and 28th in attempts (19.3). They were 19 of 21 from the line on Saturday. \n\n\r\n                    Magic: Orlando entered Saturday last in the league in 3-point attempts (26.8) and makes (8.8) per game. They hit just 10 of 38 attempts from beyond the arc on Saturday. \n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Play at Miami on Monday.\n\n\r\n                    Magic: Host the Cleveland Cavaliers on Monday. The two teams play again in Orlando on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997811.5354922
}