{
  "game_id": "0022000277",
  "espn_id": "401267437",
  "date": "Jan 27, 2021",
  "matchup": "TOR vs. MIL",
  "headline": "Bucks, Antetokounmpo hold off Raptors 115-108",
  "body": "TAMPA, Fla. -- — Giannis Antetokounmpo had 24 points, 18 rebounds and nine assists, and Donte DiVincenzo sparked a five-point sequence in the fourth quarter that helped the Milwaukee Bucks pull away for a 115-108 win over the Toronto Raptors on Wednesday night.\n\n\r\n                    The Bucks (11-6) were leading by just three points after a dunk by DiVincenzo, who followed with a steal and then drew a flagrant foul on Kyle Lowry while driving to score again. \n\n\r\n                    DiVincenzo paid the price for his big play.\n\n\r\n                    “That’s significant contact to Donte’s head,” said Milwaukee coach Mike Budenholzer, who thought a Flagrant 2 should have been called. “He was able to play through it, but we’ll see how serious it is.”\n\n\r\n                    Nobody appreciated DiVincenzo’s play more than Antetokounmpo.\n\n\r\n                    “It was huge,” he said. “He had the dunk, he had the steal and they hit him in the face. But he was playing the right way. He really helped us tonight.”\n\n\r\n                    After DiVincenzo made the two free throws, the Bucks took the ball out of bounds and Bryn Forbes nailed a 3-pointer to put the Bucks up 92-84 with 9:54 left.\n\n\r\n                    That helped the Bucks hold off the Raptors (7-11) down the stretch despite a 14-point scoring burst by Lowry and a two-minute stretch in which Antetokounmpo sat out after getting hit in the face.\n\n\r\n                    Norman Powell led the Raptors with 26 points, the fourth straight 20-plus game for Powell in his seventh start of the season.\n\n\r\n                    “It looks like he’s found a groove,” Toronto coach Nick Nurse said, “and it’s translating to both ends of the floor.”\n\n\r\n                    Fred VanVleet, the Raptors’ leading scorer, had 10 points and 10 assists after a scoreless first half.\n\n\r\n                    Khris Middleton, who finished with 24 points and 10 rebounds, closed the first half with a 3-pointer to put the Bucks up 63-54, the largest lead for either team until 3-pointers by D.J. Augustin and Bobby Portis stretched Milwaukee’s lead to 11 midway through the third quarter.\n\n\r\n                    Toronto scored the final nine points of the third and took an 84-83 lead on Yuta Watanabe’s lane runner early in the fourth.\n\n\r\n                    The Bucks came in as the NBA’s No. 1 shooting team at 49%, and made 10 of their first 14 shots before Antetokounmpo went to the bench with 4:33 left in the first quarter. They shot 43% for the game.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Brook Lopez had his fifth straight double-figure scoring game, finishing with 21 points on 8-of-11 shooting. \n\n\r\n                    Raptors: Played without F OG Anunoby, who missed his first game of the season with a strained left calf. ... VanVleet is the only Raptors player to have started all 18 games. ... Pascal Siakam started after missing two games with a swollen left knee and had 11 points and nine rebounds in 35 minutes. \n\n\r\n                    10,000 POINTS FOR LOWRY\n\n\r\n                    With a 3-pointer in the first minute, Lowry joined DeMar DeRozan (13,296) and Chris Bosh (10,275) as the only players to score 10,000 points as a member of the Raptors. Lowry scored another 3,732 points in stints with Houston and Memphis.\n\n\r\n                    The only other active NBA players to score 10,000 with their current team are Golden State’s Steph Curry and Klay Thompson, Portland’s Damian Lillard, Washington’s Bradley Beal, and Antetokounmpo, who exceeded the 11,000-point mark on Sunday.\n\n\r\n                    Lowry finished with 21 points and six rebounds. He has scored 10,019 points for Toronto.\n\n\r\n                    FAIR WEATHER TEAMS?\n\n\r\n                    Since facing each other in the Eastern Conference finals 20 months ago, the Bucks have met four times -- in Toronto, Milwaukee, Walt Disney World and Tampa. “That’s weird,” noted Budenholzer. “They’re such a great team and organization, and their fan base and city are so unique. To play them here in Tampa, obviously the warm weather is good, but yeah, weird is a good word.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Play at New Orleans on Friday night in the second of nine road games in 19 days.\n\n\r\n                    Raptors: Play at home against Sacramento on Friday night in a rematch of a game from three weeks ago in which Toronto set a franchise scoring record in a 144-123 win.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996881.212657
}