{
  "game_id": "0021700289",
  "espn_id": "400975040",
  "date": "Nov 26, 2017",
  "matchup": "MEM vs. BKN",
  "headline": "Grizzlies bench Marc Gasol in fourth, extend skid to 8 losses",
  "body": "MEMPHIS, Tenn. -- The misery remains for the Memphis Grizzlies, and friction seems to be building in the locker room.\nMemphis dropped its eighth straight on Sunday in a 98-88 loss to the Brooklyn Nets. The Grizzlies made a fourth-quarter dent in a Nets lead that stretched to 19, all while center Marc Gasol was in his warm-ups on the bench. Despite matching Tyreke Evans for the team lead with 18 points, Gasol, who leads the team in scoring, rebounds and assists, wasn't called on to play in the final period.\nAnd he wasn't pleased.\n\"I do not know the why,\" Gasol said of not playing down the stretch, later adding: \"It's a first for me, trust me, and I don't like it one bit. I'm more [ticked] than I can show and frustrated.\"\nSpeaking before Gasol, Memphis coach David Fizdale said his decision was based on the reserves playing well and cutting into the Brooklyn lead. He said not much has worked for the team during the skid, particularly Sunday, when the Grizzlies gave up the lead in a poor third quarter.\nAsked about Gasol's reaction about not playing down the stretch, Fizdale said: \"We'll address it if it needs to be addressed, but it was a pretty simple decision what I did. It's nothing against him. I'm trying to win a game. I'm desperate.\"\nWhile the Grizzlies were grousing, the Nets were celebrating, at least for one night, after snapping a three-game losing streak.\nDeMarre Carroll scored a season-high 24 points and Trevor Booker added 16 points and 11 rebounds. Joe Harris finished with 13 points for the Nets, who used a third-quarter spurt to put away the Grizzlies.\nThe teams were tied at 47 at the break, but the Nets opened the second half with a 22-6 run, looking much more fluid on offense than in the opening half. Brooklyn connected on nine of its first 15 shots to build the lead, outscoring the Grizzlies 32-18.\n\"We came out in the second half and got two big stops, scored,\" Brooklyn coach Kenny Atkinson said. \"We picked up our energy in the second half. The first part of the third quarter, that's where I thought the game turned.\"\nMemphis was able to get back in the game to open the final period, composing a 12-3 run. Memphis got the deficit to five points, but the Brooklyn lead was too much to overcome.\n\"We wanted to get out in transition and make them run,\" Harris said, \"and I thought we did better at that in the second half.\"\nTIP-INS\nNets: Harris started in Allen Crabbe's place. ... Carroll's previous season high was 18 on Oct. 25 against Cleveland. ... The Nets shot 45 percent from the field, breaking a string of surpassing 50 percent the past two games and three of the previous four. ... The Nets had 19 assists, breaking a streak of at least 24 assists in their last five.\nGrizzlies: Memphis had not lost eight straight since a similar skid from Feb. 11 to March 3, 2009. ... The team announced that Chandler Parsons tweaked his knee and did not return in the second half. The team characterized it as a precautionary move.\nMORE INJURY TROUBLES\nThe Nets, who already were without D'Angelo Russell and Jeremy Lin with long-term injuries, had more setbacks. Crabbe, who was going to start, was a late scratch with a sore lower back. Then in the second quarter, Rondae Hollis-Jefferson went down with a right ankle sprain. \"It's unfortunate that we have so many injuries right now, but that's why we have 15 guys on the team,\" Booker said.\nMORE MARC MUSINGS\nGasol spent a lot of time answering questions about the fourth-quarter situation in the Grizzlies locker room. Even after the team's public relations staff asked if everyone was finished, Gasol said he was willing to keep talking, expressing his displeasure about the situation. \"I'm just as competitive as anybody,\" he said. \"I hate not playing. That's what I value the most. If I'm not on the floor, I'm not valued. I'm sure [the coaching staff] knew that would hurt me the most.\"\nUP NEXT\nNets: Visit Houston on Monday.\nGrizzlies: Visit San Antonio on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764992791.585286
}