{
  "game_id": "0021800281",
  "espn_id": "401070962",
  "date": "Nov 24, 2018",
  "matchup": "CHI @ MIN",
  "headline": "Karl-Anthony Towns picks up slack, carries Wolves past Bulls",
  "body": "MINNEAPOLIS -- Karl-Anthony Towns had 35 points and 22 rebounds, Derrick Rose scored 22 points off the bench and the Minnesota Timberwolves pulled away in the fourth quarter for a 111-96 victory over the Chicago Bulls on Saturday night.\nJeff Teague added 18 points for Minnesota, which won for the fifth time in seven games since trading Jimmy Butler to Philadelphia. Both the Timberwolves and Bulls were playing the second game of a back-to-back and their third game in four nights in a listless, sloppy affair.\nZach LaVine scored 28 points and Jabari Parker had 27, keeping their streak of 20-point games intact. Both players have reached 20 points in the past three games, but Chicago lost for the sixth time in seven games.\nJustin Holiday had 14 points and 11 rebounds for the Bulls.\nNeither team led by more than six points until Minnesota slowly started to pull away in the fourth.\nTowns scored 8 points as the Wolves started the period on a 12-2 run. Chicago committed three turnovers and shot 1-of-9 to start the quarter.\nMinnesota was playing in the third city in four nights and started the game shooting 3-of-12. Towns picked up the Wolves with 22 points in the second half.\nAndrew Wiggins and Robert Covington never recovered for the Wolves. Wiggins was scoreless on 0-for-12 shooting. Covington was 0-for-11 in the first half and finished 1-for-18 with 4 points.\nRose picked up the slack by reaching 20 points for the seventh time in the past nine games.\nTIP-INS\nBulls: Rookie F Chandler Hutchison was a game-time decision with back spasms. Hutchinson was active but didn't play for the third consecutive game. ... Coach Fred Hoiberg said Lauri Markkanen had a 2-on-2 workout involving some \"controlled contact\" as he tries to return from an elbow injury that has caused him to miss the entire season. Hoiberg said it is just the elbow that's bothering Markkanen and that the forward has kept up with conditioning. ... Holiday was 4-of-13 from 3-point territory, marking his 31st straight game with a made 3. He tied Kirk Hinrich for the longest streak in team history.\nTimberwolves: Minnesota held a 58-40 rebounding edge. The Wolves had 21 offensive rebounds leading to 29 second-chance points. ... Towns had his third career game with at least 30 points and 20 rebounds. He secured a double-double in each half. It's his 10th double-double in 20 games this season. ... Dario Saric had 19 points and 14 rebounds for his second double-double of the season. It's the third time in six games he's reached double figures in scoring for Minnesota since coming over from Philadelphia in the Butler trade.\nUP NEXT\nBulls: Return home against San Antonio on Monday.\nTimberwolves: Play at Cleveland on Monday.\n---\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994840.0347688
}