{
  "game_id": "0022000481",
  "espn_id": "401267641",
  "date": "Feb 23, 2021",
  "matchup": "DET @ ORL",
  "headline": "Pistons snap 3-game losing streak with 105-93 win over Magic",
  "body": "ORLANDO, Fla. -- — Not long after Saben Lee scored a career-best 21 points and helped the Detroit Pistons snap a three-game losing streak, the point guard was presented with a memento to ensure he won’t soon forget the game.\n\n\r\n                    Lee, a rookie out of Vanderbilt on a two-way contract, made 8 of 11 shots and all three of his 3-pointers as the Pistons started fast and dominated the second half in a 105-93 win over the Orlando Magic on Tuesday night. \n\n\r\n                    Following the 10th game of his NBA career, Lee was presented with the game ball by coach Dwane Casey in a joyous locker room celebration.\n\n\r\n                    “It was a great feeling, just having my teammates there congratulating me and coach Casey giving me the game ball,” said Lee, who topped his previous career high of 12 points set two nights earlier in Orlando. “It was definitely a moment that I’m going to remember. I’m just happy I got to experience that.” \n\n\r\n                    Detroit, which has an NBA-worst road record of 3-14, won for the first time since Feb. 14. Outplayed throughout a 105-96 loss to the Magic on Sunday, the Pistons raced to a 15-point first-quarter lead, dominated the third quarter and rode balanced scoring the rest of the way for the victory.\n\n\r\n                    Lee was pressed into duty the past two games after Delon Wright suffered a groin injury that is expected to keep him out for two weeks. Strong on Sunday with 12 points, five assists and three steals, Lee scored 13 points in the first half on Tuesday to key the Pistons’ strong start. He added four assists and two steals on Tuesday.\n\n\r\n                    “Like I said, he’s not your typical rookie because he’s come from a professional background with his dad going through the NFL,” Casey said of Lee. “He’s been around pro sports, he’s not caught up in the bright lights or overwhelmed with the NBA. And he’s a very intelligent young man and he doesn’t get rattled.”\n\n\r\n                    Detroit’s ninth victory of the season ended Orlando’s three-game winning streak and put a damper on Magic center Nikola Vucevic’s selection as a reserve for the NBA All-Star Game. Just two nights after battering the undersized Pistons for 37 points and 13 rebounds, Vucevic finished with 20 points and nine rebounds. He shot 9 for 22 shots and missed 6 of 8 3-point attempts.\n\n\r\n                    “It was one of the best feelings ever, a huge honor and it’s something I’m really proud to do in my career — make the All-Star team twice,” Vucevic said. “Especially this year, with all the guys in the East who could have made it. Just very humbled and hopefully it’s not the last one.”\n\n\r\n                    Josh Jackson had 18 points for a Detroit bench that came into the game first in the NBA in reserves scoring (41.2 ppg.). Jerami Grant had 17 points, seven rebounds and six assists. Dennis Smith Jr. added 14 points for the Pistons, who shot 46.6% despite 10-for-34 shooting from 3-point range. Detroit’s defense held Orlando to 37.5% shooting. The Magic dropped to 1-12 when failing to score 100 points.\n\n\r\n                    Magic guard Evan Fournier, who scored season-highs of 28 and 29 points in the previous two games, had 14 points in the loss. He left the game in the first quarter after being hit in the jaw by Jackson’s elbow. He returned in the second period and made just 4 of 14 shots in the game.\n\n\r\n                    TIP INS\n\n\r\n                    Pistons: Detroit held 33-year-old guard Wayne Ellington out on the advice of the analytics department, Casey said. Tuesday’s game would have been the eighth in 15 nights for Ellington, who has averaged 10.3 points in 23 games. \n\n\r\n                    Magic: Clifford has been consistent in saying his team wouldn’t make strides until defensive improvements were made. In their five games prior to Tuesday, the Magic went 4-1, largely because of a defensive rating that is second in the NBA since Feb. 12. On Tuesday, Orlando surrendered 20 points off turnovers and 16 fast break points. \n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: At New Orleans on Wednesday.\n\n\r\n                    Magic: At Brooklyn on Thursday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997914.8760698
}