{
  "game_id": "0022000390",
  "espn_id": "401267550",
  "date": "Feb 10, 2021",
  "matchup": "LAL vs. OKC",
  "headline": "LeBron leads Lakers past Thunder again in OT, 114-113",
  "body": "LOS ANGELES -- — LeBron James hit the tying 3-pointer late in regulation and then broke up the Thunder's final possession in overtime to lead the Los Angeles Lakers to their sixth consecutive victory, 114-113 over Oklahoma City on Wednesday night.\n\n\r\n                    James had 25 points, seven assists and six rebounds for the defending NBA champions, who survived their third consecutive overtime game. Montrezl Harrell scored 20 points, and Dennis Schröder had 19 points and seven rebounds as the Lakers rallied back from another huge early deficit and again showed just enough late-game poise to win.\n\n\r\n                    “We’ve got a deep team, a lot of weapons, a lot of ways we can hurt you down the stretch,” Lakers coach Frank Vogel said. “They gave us all we could handle, especially in the first half of these games. But we kept grinding, stayed connected, believed in each other and grinded it out.”\n\n\r\n                    Al Horford scored 25 points and Kenrich Williams had a career-high 24 for the Thunder, who excelled at Staples Center despite having just eight available players for back-to-back narrow losses to the defending NBA champions.\n\n\r\n                    “I’m proud of our fight, the way we competed,” Williams said after his third start. “Coach always emphasizes playing the whole 48. We had a little extra time more than 48, but I’m just proud of our guys.”\n\n\r\n                    James hit a tying 3-pointer with 19.6 seconds to play in regulation, and Luguentz Dort missed a 3 at the buzzer. Wesley Matthews then hit a tiebreaking 3-pointer for the Lakers with 41.4 seconds left in overtime.\n\n\r\n                    After Dort made a driving layup, James airballed a long jumper to give Oklahoma City one last shot with 4.3 seconds to play — but James anticipated the Thunder's midcourt inbounds pass and knocked it into the backcourt, leaving the Thunder with no time to get a good shot.\n\n\r\n                    “It’s getting old, but I've just got to commend them for their effort, their competitiveness,” Thunder coach Mark Daigneault said. “On a short turnaround, after a tough loss the other night, we compete for 53 minutes. These ones sting, because you want to come away with a win when you put that sort of effort forward. But we’re focused on progress, and we continue to show progress.”\n\n\r\n                    Both teams were significantly shorthanded. The Thunder played without leading scorer Shai Gilgeous-Alexander, who has a nagging left knee injury.\n\n\r\n                    Anthony Davis missed his second straight game for the Lakers with an Achilles issue, and key reserve Alex Caruso also missed his second straight game with an injured hand.\n\n\r\n                    Meanwhile, James played at least 40 minutes in three consecutive games for the first time in four years with no noticeable drop-off in play.\n\n\r\n                    “That's why he's probably going to be this year's MVP,” Vogel said.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Gilgeous-Alexander sat out for the third time in five games. ... Mike Muscala returned from a one-game absence with a concussion and scored six points.\n\n\r\n                    Lakers: Caruso went through a lengthy pregame workout before deciding to rest. ... Davis has missed five of the Lakers' 26 games.\n\n\r\n                    OVERTIME FEATS\n\n\r\n                    The Lakers became the seventh team in NBA history to win three consecutive overtime games. Minnesota did it last in January 2007.\n\n\r\n                    Los Angeles hadn't played three straight overtime games since 1991.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: At Nuggets on Friday.\n\n\r\n                    Lakers: Host Grizzlies on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997938.0244858
}