{
  "game_id": "0021500228",
  "espn_id": "400828115",
  "date": "Nov 27, 2015",
  "matchup": "MIL @ ORL",
  "headline": "Payton's double-double powers Magic to 114-90 win over Bucks",
  "body": "ORLANDO, Fla. -- Elfrid Payton has been inconsistent this season for the Orlando Magic.\nThis was a good night for the second-year point guard.\nPayton had 22 points and 10 assists, and the Magic beat the Milwaukee Bucks 114-90 on Friday.\nThe Magic shot 52.4 percent from the field and limited the Bucks to 41.9 percent shooting. Tobias Harris scored 19 points for Orlando, and Evan Fournier and Victor Oladipo had 17 apiece.\nPayton led a strong defensive effort that helped Orlando outscore Milwaukee 65-47 in the second half. He was shooting 35 percent from the field coming into the night, but he connected on 10 of 12 shots against the Bucks.\n\"I was trying to put a little extra pressure on the ball (in the second half) and that helped us get a lot of deflections and get out in transition,\" Payton said. \"As far as shooting, I'm always confident, but the ball was really moving tonight. We were able to penetrate and get a lot of kickouts and shoot the ball in transition. It was all good.\"\nOrlando made each of its six 3-point attempts and 13 of 16 shots (81.3 percent) overall while blowing the game open in the third period. Orlando outscored Milwaukee 37-22 in the quarter to push a six-point halftime lead to 86-65.\n\"The game always looks better when the 3 is going in,\" Magic coach Scott Skiles said.\nMilwaukee was without coach Jason Kidd after he was suspended for one game for a run-in with officials during Wednesday's 129-118 loss to Sacramento.\nGiannis Antetokounmpo and Jerryd Bayless led Milwaukee with 17 points apiece. Khris Middleton had 15, but the Bucks' defense was slow in transition and constantly left Magic shooters wide open on the perimeter.\n\"We have to be a more consistent team,\" said assistant coach Joe Prunty, who took over for Kidd. \"In the first half we were competing, but in the second half there were a couple of things that make you question what kind of team we are.\"\nPayton started the third-quarter surge with a trey 30 seconds into the period. Fournier had a fast-break 3-pointer and Nik Vucevic followed with a traditional three-point play to boost the lead to 77-57.\n\"We just have to play defense,\" Milwaukee forward John Henson said. \"If we don't fix it, it's going to be a long season. You got to care about it.\"\nMiddleton was Milwaukee's only offense in the quarter, scoring 11 points, and the Bucks went 5 for 21 (23.8 percent) from the field against an aggressive Magic defense.\nThe Magic got 12 points from Harris and nine each from Oladipo and Payton on their way to a 49-43 halftime lead. Orlando used five 3-pointers, two from Harris, to make up for a lack of inside scoring.\nTIP-INS\nBucks: Milwaukee gave up 32 points on 22 turnovers. ... Milwaukee took only two jump shots the first quarter. Eighteen of the Bucks' 20 shots were from three feet or inside. ... PG Michael Carter-Williams has 22 turnovers and 22 assists in his last six games. ... Milwaukee is winless (0-8) when trailing at halftime this season.\nMagic: Reserve C Jason Smith is 7 for 7 from the field in the last two games. ... It was only the second game all season that Orlando has shot over 50 percent from the field. ... Orlando starters outscored Milwaukee starters 76-52. ... Oladipo came off the bench for the second straight game. He also had nine assists and six rebounds. ... Orlando won for the first time in four games this season against a Central Division team.\nUP NEXT\nBucks: Visit Charlotte on Sunday.\nMagic: Host Boston on Sunday night.\nKIDD LOST\nThe Bucks found out four hours before game time that Kidd was suspended.\n\"It's not really our decision to be surprised or not,\" Prunty said. \"We (assistant coaches) talked and prepared for the roles we're required to do.\"",
  "source": "espn_api",
  "crawled_at": 1764994092.436606
}