{
  "game_id": "0022200678",
  "espn_id": "401468833",
  "date": "Jan 19, 2023",
  "matchup": "CHI @ DET",
  "headline": "LaVine scores 30, Bulls defeat Pistons 126-108 in Paris",
  "body": "PARIS -- — Victor Wembanyama was sitting courtside, the 19-year-old French phenom and presumed No. 1 NBA draft pick watching some of the players he’ll go up against next season.\n\n\r\n              And a guy with a French surname put on quite a show.\n\n\r\n              Zach LaVine — who said his great-grandfather was French — scored 30 points and the Chicago Bulls never trailed in a 126-108 win over the Detroit Pistons at the NBA Paris Game on Thursday.\n\n\r\n              “Maybe the air up here was good for me,” LaVine said.\n\n\r\n              DeMar DeRozan added 26 points for the Bulls, and Nikola Vucevic finished with 16 points, 15 rebounds and six assists.\n\n\r\n              Bojan Bogdanovic led the Pistons with 25 points. Killian Hayes, the only French player on either roster, scored four points for Detroit on 2-of-13 shooting, but had a game-high eight assists.\n\n\r\n              Hamidou Diallo had 17 points on 7-for-8 shooting for Detroit, while Saddiq Bey and Jaden Ivey each scored 16 for the Pistons.\n\n\r\n              “It was a bit frustrating to not be the winners tonight,\" Hayes said.\n\n\r\n              It was the capper to several days of celebrating the NBA in France, after both teams took part in clinics, touristy events like visits to the Eiffel Tower, some upscale dinners and even a private show for the Pistons at the Paris Opera House.\n\n\r\n              And while the game counted — Chicago (21-24) stayed in 10th in the Eastern Conference and what would be the last play-in spot with the win, while Detroit fell to 12-36, the second-worst mark in the NBA — it also was no mundane middle-of-the-season regular-season matchup.\n\n\r\n              The celebrity list included NBA greats like Magic Johnson, Richard Hamilton, Ben Wallace and Tony Parker; a Bulls legend and native French son in Joakim Noah; the rising star that everybody can’t stop talking about in Wembanyama; WNBA players like Gabby Williams; even Grammy winners and Formula 1 drivers.\n\n\r\n              “I don’t want to quite compare this to All-Star,” NBA Commissioner Adam Silver said, “but it’s the closest thing to a European All-Star Game that we have.”\n\n\r\n              It was also a celebration of the continued strength of the international footprint on today’s NBA game. When the Bulls and Michael Jordan — along with B.J. Armstrong, then a Bulls guard, now an NBA agent who was at the game Thursday — played in Paris during the preseason in 1997, about 1 of every 14 NBA players was born outside the U.S.\n\n\r\n              Now, that’s about 1 in 4.\n\n\r\n              “It is special because we’re representing not only Detroit, but the NBA,” Pistons coach Dwane Casey said. “And we’re trying to put the brand in a good place — in a place where basketball is taking off.”\n\n\r\n              Wembanyama and his family made their way to courtside seats about 15 minutes before tip-off, immediately attracting a huge crowd. When the camera found him and he was shown to the French fans on the big in-arena screens in the second quarter, he clapped and smiled, as did his mother seated one row back over his right shoulder — as the crowd positively roared in delight.\n\n\r\n              Both teams are flying home Friday.\n\n\r\n              “It's great for people here in Paris to get an up-close look at the NBA,\" Bulls coach Billy Donovan said. “It makes you realize that the sport is followed so closely around the world. It was amazing. The place was sold out.\"\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Derrick Jones Jr. had 12 points for Chicago, including four highlight-reel dunks — no surprise for a former NBA dunk champion. ... Ayo Dosunmu scored 13 for the Bulls. ... Chicago shot 54%.\n\n\r\n              Pistons: Jalen Duren had an imperfect start to the trip — he misplaced his passport — then got that settled and had a perfect shooting game, 4-for-4 from the field on his way to a 11-point, 12-rebound effort. ... Isaiah Stewart grabbed 11 rebounds.\n\n\r\n              GLOBAL GAME\n\n\r\n              The NBA has teams in the U.S. and Canada, of course, and this game in France pushed the list of nations where the league has played or practiced this season to seven.\n\n\r\n              Mexico played host to a game between San Antonio and Miami last month. The Heat also had training camp in the Bahamas, and the league went to two other countries for preseason games — Golden State and Washington played twice in Japan, while Milwaukee and Atlanta played twice in the United Arab Emirates.\n\n\r\n              ROAD TRIP\n\n\r\n              It was a “home” game for the Pistons, even though Paris is about 4,000 miles from Detroit. As the home team, the Pistons got to bring a slew of staffers on the trip — including some game operations workers and members of the stat crew that works at the scoring table.\n\n\r\n              James Capers, Karl Lane and Natalie Sago got sent to officiate the game. All three referees had games Saturday in the U.S., then traveled to Paris.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Atlanta on Monday.\n\n\r\n              Pistons: Host Milwaukee on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994289.948276
}