{
  "game_id": "0022300167",
  "espn_id": "401584795",
  "date": "Nov 08, 2023",
  "matchup": "CLE @ OKC",
  "headline": "Gilgeous-Alexander scores 43 as the Thunder top the Cavaliers 128-120",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander put up big numbers without focusing on them.\n\n\r\n              The high-scoring guard had 43 points and the Oklahoma City Thunder defeated the Cleveland Cavaliers 128-120 on Wednesday night.\n\n\r\n              Gilgeous-Alexander made 15 of 22 field goals and 12 of 13 free throws. He fell one point short of his career high and scored at least 40 for the eighth time. \n\n\r\n              Best known for his mid-range prowess and exceptional ability to finish around the basket, Gilgeous-Alexander attempted just two 3-pointers. \n\n\r\n              “I know that’s where I’m at my best,\" he said of his interior offensive play. \"I felt good coming in tonight. I just wanted to play fast, play in my comfort zone and make the right basketball play.”\n\n\r\n              Thunder coach Mark Daigneault said Gilgeous-Alexander was as aggressive about finding help as he was about scoring. He had six assists. \n\n\r\n              “It wasn’t like he just took over and took on Cleveland,” Daigneault said. \"The ball was moving around and we became very difficult to guard.” \n\n\r\n              Jalen Williams and Chet Holmgren each added 15 points for the Thunder, who improved to 5-3 this season.\n\n\r\n              Caris LeVert scored 29 points and Evan Mobley had 22 for Cleveland.\n\n\r\n              Donovan Mitchell, who entered as the NBA’s leading scorer at 32.5 points per game, was held to 20 on 8-for-23 shooting. He scored 43 points in the first meeting between the teams, a 108-105 win for the Thunder on Oct. 27 in Cleveland. \n\n\r\n              The Cavaliers shot 50.6% from the field, but Oklahoma City scored 30 points off their 20 turnovers.\n\n\r\n              “Our approach to start the game wasn’t good enough,” Cleveland coach J.B. Bickerstaff said. \"Where we were mentally and where our focus was wasn’t good enough. Coming out and not executing the game plan the way we did is disappointing.”\n\n\r\n              Gilgeous-Alexander scored 23 points on 10-for-11 shooting in the first half to help the Thunder take a 70-57 lead. He racked up those points without attempting a 3-pointer. Oklahoma City shot 55.3% from the field and hit all 12 of its free throw attempts in the first two quarters. Cleveland shot 53.8% from the field but made just 10 of 19 free throws in the first half.\n\n\r\n              Gilgeous-Alexander had 15 points in the third quarter to put the Thunder ahead 99-87. He took a break to start the fourth and returned to the game with Oklahoma City leading 105-100. \n\n\r\n              Other players handled the scoring for the Thunder until Gilgeous-Alexander hit a 3 from the top of the key to put Oklahoma City up 117-108 with about four minutes remaining. It was his first 3-pointer of the game and just his second attempt.\n\n\r\n              “When they are double-teaming me or loading extra hard, it’s always important to make the right play,\" Gilgeous-Alexander said. \"That’s just how I was taught to play. And then like I said, at the end of the day, I just want to win. ... My teammates are pretty good, so it’s easy to trust them.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit the Golden State Warriors on Saturday.\n\n\r\n              Thunder: Visit the Sacramento Kings on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996743.140033
}