{
  "game_id": "0022400368",
  "espn_id": "401704934",
  "date": "Dec 19, 2024",
  "matchup": "LAC @ DAL",
  "headline": "Clippers beat Dallas 118-95 as Mavericks' star guards Doncic and Irving sit due to injury",
  "body": "DALLAS -- — Norman Powell scored 29 points, James Harden added 24 and Ivica Zubac had 21 points and 15 rebounds as the Los Angeles Clippers beat Dallas 118-95 on Thursday night in the Mavericks’ first game this season playing without star guards Luka Doncic and Kyrie Irving.\n\n\r\n              Doncic sat out with a left heel contusion, Irving with right shoulder soreness, in the first of a two-game series against Los Angeles that will conclude Saturday night.\n\n\r\n              First-year Maverick Klay Thompson scored 22 points, his first game leading the team in scoring. Spencer Didwiddie added 19 making his first start of the season.\n\n\r\n              The Clippers took a 50-49 lead into the second half and outscored the Mavericks 39-28 in the third period, hitting 69.6% (16 for 23) of their field-goal attempts while Dallas shot 40% (8 of 20) in the quarter.\n\n\r\n              Clippers guard Kris Dunn was ejected for committing a flagrant 2 foul against Jazian Gortman late in the third period.\n\n\r\n              Takeaways\r\n              Clippers: Los Angeles led in bench scoring 33-16. Harden was 10 for 10 from the line. Powell played the entire second period, scoring 10 of his team-best 12 first-half points. Zubac didn’t have a rebound during the game’s first 15 minutes.\n\n\r\n              Mavericks: Dallas shot 7 for 30 on 3-pointers for season lows in makes and percentage (23.3%). They’re 5-2 without Doncic, 1-2 without Irving.\n\n\r\n              Key moment\r\n              After P.J. Washington’s runner pulled Dallas within 73-68 with five minutes left in the third quarter, Zubac’s stuff began a 12-1 run, during which the Mavericks missed all four field-goal attempts.\n\n\r\n              Key stat\r\n              The Mavericks, missing a combined 52.8 points from Doncic and Irving, scored a season low and suffered their most lopsided loss of the season.\n\n\r\n              Up next\r\n              The teams meet again Saturday. The teams’ other two meetings will be a back-to-back at Los Angeles on April 4-5.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998043.7408252
}