{
  "game_id": "0022100380",
  "espn_id": "401360204",
  "date": "Dec 09, 2021",
  "matchup": "MEM vs. LAL",
  "headline": "Grizzlies ride second-half push to 108-95 win over Lakers",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. scored 25 points, Desmond Bane added 23 and the Memphis Grizzlies pulled away in the fourth quarter for a 108-95 victory over the Los Angeles Lakers on Thursday night.\n\n\r\n              Tyus Jones and De’Anthony Melton added 12 points apiece for Memphis, which won for the sixth time in seven games.\n\n\r\n              “I thought our activity was fantastic defensively,” Memphis coach Taylor Jenkins said. “I thought the Lakers came out and kind of imposed their will in the first quarter, but we just kept making those winning plays throughout.”\n\n\r\n              LeBron James had a triple-double with 20 points, 11 assists and 10 rebounds, and Anthony Davis led the Lakers with 22 points. Talen Horton-Tucker and Avery Bradley each added 10 points.\n\n\r\n              Memphis opened the fourth quarter on a 9-2 run, pushing the lead to double-digits for the first time for either team. With that spurt, Memphis extended its lead to 94-80. Los Angeles never got its deficit to single digits.\n\n\r\n              The Grizzlies were without leading scorer Ja Morant and their top defender, Dillon Brooks, who are in health and protocol protection. That put Memphis at a personnel disadvantage.\n\n\r\n              “I didn’t know what we were going to look like,” Bane said of learning about an hour before the game that Brooks was out. He said the Grizzlies have had games in which they didn’t have the players individually, but not both missing.\n\n\r\n              “One thing I did know was that we were going to fight, regardless,” Bane said. “Before the game started, I told everybody to have fun. Just do what we do and have fun playing the game.”\n\n\r\n              Memphis, which leads the league in points in the paint, was forced into long-range shots early by the Lakers defense, and the shooting percentage reflected the situation. \n\n\r\n              But in the second quarter, Memphis was able to run more. The transition baskets and more Los Angeles turnovers contributed to the Grizzlies building a 59-53 lead at the half.\n\n\r\n              “The second quarter was where the energy of the game shifted,” Laker coach Frank Vogel said. “Our turnovers went way up. We didn’t rebound the basketball. We were slow to every loose ball.”\n\n\r\n              He added that there was “too much casualness to our approach.”\n\n\r\n              The Lakers continued having trouble holding onto the ball, and by the end of the third quarter had committed 19 turnovers that led to 22 Memphis points. That helped the Grizzlies carry an 85-78 lead into the fourth.\n\n\r\n              By the end of the game, Memphis forced 22 Los Angeles turnovers.\n\n\r\n              “Defensively, I thought we were really good. We just turned the ball over,” James said. “When you hold a team to 108 points and 27 of those came off turnovers, the defense was really good. Offensively, we were not good at all.”\n\n\r\n              CAUTIOUS PRECAUTIONS\n\n\r\n              With Brooks entering health and safety protocols just before the game, it raises the question of trying to control the spread of the virus throughout the league. Several teams are missing players because of the precautions, some teams with a significant number. Memphis coach Taylor Jenkins said they are simply in contact with the league, trying to figure that out with direction from the league.\n\n\r\n              Vogel said they ask players to follow all the steps – hand-washing, wearing a mask, getting the booster shot, etc. “It’s just kind of wait and see,” Vogel said. “You hope for the best and hopefully it doesn’t come to our group.”\n\n\r\n              FINAL WORD\n\n\r\n              “I wouldn’t say I was surprised. I’ve seen it happen with our group this year. We have to keep our foot on the gas and continue to play. … We’ve just got to find a way to prevent that from happening.” – Vogel on the Lakers losing their edge after the first quarter. \n\n\r\n              TIP-INS\n\n\r\n              Lakers: James and Davis were listed on the team’s injury report as probable — James with rectus abdominis strain; Davis with a left thumb sprain — but both played. … The Lakers saw their four-game winning streak in the series end. … James’ steal in the first quarter was the 2,086th of his career, moving him past Karl Malone for 11th on the all-time list.\n\n\r\n              Grizzlies: F Kyle Anderson returned to action after missing four games with back soreness. … Had 13 steals in the first half, nine in the second quarter, setting a franchise record for steals in a quarter.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Oklahoma City on Friday.\n\n\r\n              Grizzlies: Host the Houston Rockets on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993292.511961
}