{
  "game_id": "0021500781",
  "espn_id": "400828668",
  "date": "Feb 08, 2016",
  "matchup": "MEM vs. POR",
  "headline": "Lillard has 33 to lead Blazers past Grizzlies 112-106 in OT",
  "body": "MEMPHIS, Tenn. -- C.J. McCollum struggled with his shooting until overtime when a trio of field goals provided Portland with a winning boost.\nMcCollum had six of his 21 points in overtime, Damian Lillard scored 33 points and the Trail Blazers defeated the Memphis Grizzlies 112-106 on Monday night.\n\"I wasn't very good,\" said McCollum, who was 7 of 19 from the field at the end of regulation. \"I fouled. I gave up some points to Mike Conley. Didn't make shots. But I just had to stick with it. They need me to score. They need me to execute down the stretch and have the confidence to take and make good shots.\"\nThe game would not have reached overtime if not for a strange sequence at the close of regulation.\nMemphis held a 102-100 lead after Tony Allen split a pair of free throws for the Grizzlies with 7.6 seconds left.\nOn the ensuing possession, Lillard launched a 3-pointer that missed, McCollum tapped up the rebound, but that that was off the mark before another tip went through the net as the horn was sounding.\nAllen Crabbe was given credit for the basket, but replays showed Memphis' Jeff Green actually was the one with his hand on the tip that went through.\nAnd after that, officials reviewed the play to make sure of two things -- that the shot was off in time, and there was no basket interference.\nEventually, they ruled the basket good, sending the game to the extra period.\n\"We got the rebound, we got a tip-in, and I just saw all black jerseys down there,\" Lillard said of the final play in regulation. \"There was a little bit over a second (left), and I thought: `We've got a chance to tip something.\"\nAs for Crabbe, he said: \"I tried to make a play on the ball, and it went in. They gave me the two points, so I'm going to take credit for the tip-in.\"\nConley led Memphis with 27 points, while Zach Randolph added 26 points as Memphis lost its second straight overtime game.\nMarc Gasol scored 11 points before leaving late in the first quarter with a right foot injury. He did not return. Mario Chalmers and Green had 12 apiece for Memphis.\nGerald Henderson scored 16 for Portland, while Crabbe finished with 13.\nThe game was close throughout with both teams' biggest leads reaching six points. There were 18 ties and 17 lead changes.\nAfter McCollum's first three baskets of overtime, Memphis tried to claw back and appeared to have a chance. Trailing 108-106, Allen was on a breakaway with about 10 seconds left but missed the layup on the other end, and the Grizzlies never got closer.\n\"That's one I'd like to have back,\" Allen said of the game. \"I want to take this one on the chin personally.\"\nTIP-INS:\nTrail Blazers: F. Noah Vonleh missed his third consecutive game with a left ankle sprain. ... Crabbe, who missed the last game with gastritis, returned to the Portland lineup. ... Portland won its first overtime game of the season after losing the previous two.\nGrizzlies: Green hit a 15-footer at the end of the first quarter to give Memphis a 27-25 lead after one. ... Randolph passed Stephon Marbury in the first half to move into 98th place on the all-time scoring list in the NBA. ... The game was the second straight overtime loss for Memphis. The Grizzlies lost to Dallas 114-110 on Saturday. Memphis is now 2/3 in overtime games this season.\nGIMPY GASOL: There was no immediate word on Gasol's status. \"He is just dinged up,\" Memphis coach Dave Joerger said, adding: \"He's got a problem on one leg. He's got another problem on the other leg.\"\nPORTLAND GOES HOME A WINNER: The Trail Blazers had lost eight straight road games at Memphis, including the playoffs. The last Portland win in Memphis was Jan. 4, 2013. Monday's win gave the Trail Blazers a split in the four-game series between the teams.\nUP NEXT\nTrail Blazers: Host Houston on Wednesday.\nGrizzlies: Travel to Brooklyn Nets on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994437.255305
}