{
  "game_id": "0022300688",
  "espn_id": "401585316",
  "date": "Feb 02, 2024",
  "matchup": "LAC @ DET",
  "headline": "Westbrook reaches 25,000 career points and Leonard scores 33 to lead Clippers past Pistons 136-125",
  "body": "DETROIT -- — Russell Westbrook scored 23 points to become the 25th player in NBA history with 25,000 points, Kawhi Leonard had 21 of his 33 points in the first half and the Los Angeles Clippers put on an offensive show in a 136-125 win over the Detroit Pistons on Friday night.\n\n\r\n              Westbrook, who also had nine assists, joined teammate James Harden on the list of players to score 25,000 points after Harden accomplished the feat in December. Westbrook reached the mark on his final basket, a running layup with 2:44 left.\n\n\r\n              “I’m so grateful to be on this team,” said Westbrook, who immediately fouled Cade Cunningham after his basket and celebrated with his teammates at the bench. “I don’t take any of this for granted.”\n\n\r\n              Los Angeles got off to a slow start while trailing by as many as 14 points in the first quarter, but scored 109 points in the final three periods. They shot 59.6% from the floor and 48.3% on 3-pointers.\n\n\r\n              “We had a bunch of defensive mistakes at the start of the game,\" Clippers coach Tyronn Lue said. \"We weren’t guarding their shooters the way we planned, but we started paying attention to detail after the first timeout. Monty (Williams) has the Pistons playing pretty good basketball, but it is tough to close games with such a young team.”\n\n\r\n              Paul George added 18 points for the Clippers, who have won seven of eight.\n\n\r\n              George played 27:20 after missing the previous game with groin soreness.\n\n\r\n              “He looked good,” Lue said. “We were going to play him more minutes, but we didn’t need him.”\n\n\r\n              Jalen Ivey had 28 points and Bojan Bogdanovic added 26 for Detroit, which is 4-41 after a 2-1 start. Marcus Sasser added 21 points.\n\n\r\n              “You can’t have turnovers and some of the undisciplined errors we had against a team like that,” said Williams, whose team allowed 25 points on 17 rebounds. “It’s something that has hurt us all season long. When we take care of (the ball), we have a better chance of success.”\n\n\r\n              The Clippers led 65-59 at the half and their scoring pace didn’t let up in the third. Leonard reached 30 points with five minutes left in the quarter when he put Los Angeles ahead 89-80.\n\n\r\n              Detroit answered with an 8-0 run before Westbrook hit a 3-pointer. Norman Powell’s last-second 3-pointer gave the Clippers a 101-90 lead going into the fourth.\n\n\r\n              Powell started the fourth with another 3, and Los Angeles led 108-90 after the first minute of the fourth. Detroit got within 116-109, but the Clippers scored nine points in 74 seconds to ice the game.\n\n\r\n              Westbrook and Ivey had a brief conversation at the end of the game.\n\n\r\n              “I actually got to work out with Russ before the start of my rookie year,” Ivey said. “He gave me a lot of advice. He’s just a great, humble dude. He took me under his wing a little bit.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At the Miami Heat on Sunday.\n\n\r\n              Pistons: Host the Orlando Magic on Sunday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996547.720288
}