{
  "game_id": "0021801086",
  "espn_id": "401071759",
  "date": "Mar 22, 2019",
  "matchup": "LAL vs. BKN",
  "headline": "Surging Nets eliminate Lakers from playoff picture, 111-106",
  "body": "LOS ANGELES --  D'Angelo Russell took no public pleasure in playing a pretty big role in officially eliminating the Los Angeles Lakers from playoff contention for yet another season.\n\nRussell is much more excited about the increasing likelihood that he's about to make his postseason debut with the Brooklyn Nets.\n\nJoe Harris hit six 3-pointers while scoring 26 points, and Russell added 21 points and 13 assists against his former team in the Nets' 111-106 win over the Lakers on Friday night.\n\nRussell had seven points and three assists in the fourth quarter while Brooklyn held on to beat the Lakers, who drafted Russell in 2015 and traded him in 2017. He hit two big 3-pointers down the stretch, and he raised his finger to his lips to shush his former fans in the Staples Center crowd.\n\nBut Russell said it was nothing personal, and he didn't think much about putting the final nail in the Lakers' playoff hopes.\n\n\"Sounds good on paper, but at the end of the day, we're not playing them,\" Russell said. \"We're not competing against them for seeding, so the win is good enough.\"\n\nLos Angeles (31-41) will miss the playoffs for a franchise-record sixth straight season even with LeBron James, who fell just short of his 81st career triple-double with 25 points, 14 assists and nine rebounds.\n\n\"It's been a tough season for all of us,\" James said. \"It's not what we signed up for. Throughout the year, things happen. Suspensions, injuries, and us just not being able to play sustainable basketball for 48 minutes. You don't even try to wrap your head around it. You just keep playing and try to get better and go from there.\"\n\nThe Nets needed another big game from Russell, who scored 27 of his 44 points in the fourth quarter of a thrilling win over the Kings three nights earlier. That stunning effort in Sacramento was the latest highlight of a breakout season for LA's former No. 2 overall pick.\n\nRussell was well-liked by Lakers fans -- but not by Magic Johnson, who dumped Russell in a trade to get rid of Timofey Mozgov's onerous contract just a few months after the Hall of Famer took over the Lakers' basketball operations.\n\n\"This is definitely where I started,\" said Russell, who has previously acknowledged being irked by Magic's parting comments about his leadership. \"It's definitely a place that gave me an opportunity. Not many guys started somewhere and then that was forgotten throughout their career. You know, Chauncey Billups, the (Steve) Nashes of that group, so I'm trying to consider myself one of those guys.\"\n\nRussell has grown into an All-Star in Brooklyn, while the Lakers have stayed in largely the same place in the standings despite adding James last summer.\n\nJaVale McGee had career highs of 33 points and 20 rebounds along with six blocked shots for the Lakers, who have lost five straight and 10 of 11.\n\nAfter 23 lead changes, the Lakers got within three points in the final minute, but James committed a turnover and missed a 3-pointer in the closing seconds.\n\nTIP-INS\n\nNets: Allen Crabbe missed his fourth straight game with a sore right knee.\n\nLakers: Tyson Chandler got his first game action since March 2. ... Kuzma hit a 3-pointer from half-court to beat the shot clock in the first quarter.\n\nNETS RISING\n\nSpencer Dinwiddie added 19 points in his hometown as the Nets (38-36) bolstered their playoff chances with their second straight win after an 0-3 start to this seven-game road trip. Brooklyn is seventh in the Eastern Conference standings, a half-game behind sixth-place Detroit and 2  1/2 games ahead of ninth-place Orlando.\n\nSTAYING HOME\n\nThe Lakers will miss for the sixth consecutive season, easily the longest streak in the 16-time NBA champion franchise's history. The Lakers had only missed the playoffs five times in their first 55 seasons of existence before this current drought.\n\nWith 10 games left in the season, the Lakers already know they're staying home again for the playoffs, even after adding James to the roster last July. James has played in the last eight consecutive NBA Finals, but he will miss the postseason for the first time since 2005, his second pro season with the Cleveland Cavaliers.\n\nJAVALE'S BEST\n\nMcGee, the veteran big man with two championship rings from Golden State, had the biggest offensive game of his 11-year NBA career. He went 15 for 20 from the field, repeatedly converting in the paint on 10 assists from James.\n\nUP NEXT\n\nNets: At Trail Blazers on Monday night.\n\nLakers: Host Kings on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994316.914026
}