{
  "game_id": "0022400829",
  "espn_id": "401705395",
  "date": "Feb 25, 2025",
  "matchup": "TOR vs. BOS",
  "headline": "Brown scores 24 points as Celtics extend winning streak to six games, beat Raptors 111-101",
  "body": "TORONTO -- — Jaylen Brown scored 24 points, Derrick White had 22 and the Boston Celtics extended their winning streak to six games by beating the Toronto Raptors 111-101 on Tuesday night.\n\n\r\n              Payton Pritchard scored 20 points and Jayson Tatum had 19 points and 11 assists as the Celtics improved to 24-6 on the road.\n\n\r\n              RJ Barrett scored 22 points and Scottie Barnes had 21 but the Raptors lost for the seventh time in their past nine. Gradey Dick scored 12 points and Immanuel Quickley added 10.\n\n\r\n              White shot 6 for 11 from 3-point range, singlehandedly making more shots from distance than the entire Raptors team. Toronto finished 5 for 32 from 3-point range, its fewest made 3s of the season. The Raptors made six 3-pointers against Philadelphia on Oct. 25.\n\n\r\n              The Raptors shot 8 for 8 on 3-pointers in the fourth quarter of Sunday’s win over Phoenix but opened Tuesday’s game by missing 11 straight from distance. Ochai Agbaji ended the drought when he connected with 9:17 left in the second quarter. \n\n\r\n              Takeaways\r\n              Celtics: Kristaps Porzingis was scratched shortly before tip-off because of a non-COVID illness. Torrey Craig replaced Porzingis in the starting lineup, his first start with Boston. The Celtics were also without Jrue Holiday (rest), Al Horford (left big toe) and Luke Kornet (personal).\n\n\r\n              Raptors: Toronto snapped a 10-game losing streak against Boston when they last met on Jan. 15 but couldn’t build on that victory in their latest encounter with the Atlantic leaders.\n\n\r\n              Key moment\r\n              Toronto trailed by 17 early in the fourth but cut the deficit to seven, 102-95, on Jamal Shead’s basket with 4:18 remaining. Tatum scored with 2:42 left, then stole the ball from Dick. White’s sixth 3-pointer restored Boston’s double-digit edge.\n\n\r\n              Key stat\r\n              Tatum had nine assists in the first two quarters, a career-high for assists in a single half.\n\n\r\n              Up next\r\n              Both teams play on the road Wednesday night. Boston is in Detroit while Toronto visits Indiana. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996946.477472
}