{
  "game_id": "0022000442",
  "espn_id": "401307686",
  "date": "Apr 21, 2021",
  "matchup": "DET @ DAL",
  "headline": "Doncic, Mavs beat Pistons 127-117 to stop 4-game home skid",
  "body": "DALLAS -- — Luka Doncic had 30 points and 10 rebounds, Kristaps Porzingis added 19 points and seven boards and the Dallas Mavericks beat the Detroit Pistons 127-117 on Wednesday night to stop a four-game home losing streak. \n\n\r\n                    Jalen Brunson scored 18 of his 20 points in the first half of a game that was supposed to be played Feb. 17 but was postponed because of severe winter weather in Texas.\n\n\r\n                    “We’ve got to continue to stay positive,” said Brunson, who was 8 of 9 from the floor before halftime. “We have a strong finish to uphold. There’s going to be a lot of trying times. We’ve got to keep it together.”\n\n\r\n                    Jerami Grant scored 26 points and Cory Joseph added 24 for the Pistons, who haven't beaten a team with a winning record since a 108-102 win at Boston on Feb. 12. Mason Plumlee had 13 points and 16 rebounds.\n\n\r\n                    Grant had 15 points in the first quarter, but foul trouble limited Detroit's leading scorer to less than three minutes in the second and third quarters combined. The Pistons' deficit was 16 points by the time Grant finally got back in the flow of the game early in the fourth quarter.\n\n\r\n                    The Mavericks had lost five of seven since a season-best five-game winning streak, including a pair of losses to teams with losing records. Dallas fell behind by eight in the first quarter against lowly Detroit but finished the first half on a 12-2 run for a 67-58 lead.\n\n\r\n                    “We had some untimely turnovers and missed some great shots against the zone,” Detroit coach Dwane Casey said. “Just enough to give them the opportunity to go down there and score.”\n\n\r\n                    The Pistons were within eight in the fourth when Doncic made a free throw and Porzingis stepped in front of a pass for a steal and breakaway dunk for a 115-104 lead with three minutes remaining.\n\n\r\n                    “The second half we did what we needed to do to get the win,” Dallas coach Rick Carlisle said. “Detroit, they're a defiantly competitive team that just keeps coming at you.”\n\n\r\n                    Doncic finished with nine assists, just missing his 10th triple-double of the season. The 22-year-old sensation has gone 17 games without a triple-double, his longest drought since going the first 44 games of his rookie year before getting his first.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Dennis Smith Jr. was out with left knee soreness against the team that drafted him ninth overall in 2017. In his second season with the Mavericks, Smith lost his job as the starting point guard to Doncic and went to the Knicks in the trade that brought Porzingis to Dallas. ... Plumlee, who had seven assists, had his 15th double-double of the season.\n\n\r\n                    Mavericks: F Maxi Kleber tried to play through a lower back contusion after taking a charge against Tyler Cook in the first half but was ruled out at halftime. “It's a substantial bruise,” Carlisle said. “It was a tough fall. He got hit hard.” ... Tim Hardaway Jr. and Dorian Finney-Smith each hit three 3-pointers, with Hardaway scoring 15 and Finney-Smith 11. \n\n\r\n                    DRAFT PICK COMPARISON\n\n\r\n                    Detroit's Saddiq Bey had just his second game in the past 10 with fewer than 10 points, finishing with eight while attempting just two 3-pointers. Bey was the 19th pick in the 2020 draft, one spot behind Josh Green for Dallas. Green did not play as a coach's decision for the 23rd time this season. He has yet to score in double figures. \n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: The second night of a back-to-back is in San Antonio on Thursday, the middle game of a three-game road trip. The Pistons have lost nine of their past 10 games at the Spurs.\n\n\r\n                    Mavericks: The first of consecutive home games against the Lakers is also the second night of a back-to-back Thursday. LA star Anthony Davis says he intends to return after missing 30 games, the longest absence of his nine-year career, with right heel and calf issues.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997904.9980989
}