{
  "game_id": "0021600029",
  "espn_id": "400899479",
  "date": "Oct 29, 2016",
  "matchup": "ORL @ CLE",
  "headline": "LeBron James, Kyrie Irving lead Cavaliers past Magic, 105-99",
  "body": "CLEVELAND --  LeBron James and the Cleveland Cavaliers got a late scare, but their winning streak over the Orlando Magic remained intact.\n\nJames scored 23 points, Kyrie Irving added 20 and Cleveland beat Orlando for the 15th straight time, 105-99 on Saturday night.\n\nCleveland built a 22-point lead late in the third quarter, but the Magic steadily got back in the game and trailed 88-85 with 4 minutes to play.\n\nJ.R. Smith took over, hitting three 3-pointers and scoring 11 points in the quarter as the NBA champion Cavaliers improved to 3-0. They haven't lost to the Magic since Nov. 23, 2012, in Orlando.\n\nCleveland coach Tyronn Lue was unhappy the Cavaliers didn't put the game away earlier against an 0-3 team.\n\n\"I thought we let our guard down because of their record, and not playing them as a good team,\" he said. \"They're struggling right now but they have a good team and we didn't respect that.\"\n\nSmith, who missed most of training camp in a contract dispute, made 3-pointers on consecutive possessions and Cleveland forced a shot-clock violation. James followed with two baskets, including a left-handed finish at the rim.\n\nSerge Ibaka converted a three-point play and hit a free throw, cutting the lead to 98-95 with 45 seconds left, but Smith's 3-pointer from the corner pushed the lead to six.\n\n\"J.R. was able to knock a few down in the fourth quarter when we needed it the most,\" James said.\n\n\"We leave J.R. Smith open, and he's the only person you can't leave open out there,\" Orlando center Bismack Biyombo said.\n\nSmith scored 16 points and Kevin Love had 19 for the Cavaliers. Evan Fournier scored 22 points while Ibaka added 19 for Orlando.\n\nJames put together a personal highlight reel in the first half. He converted a four-point play in the second quarter, hitting a 3-pointer while being fouled in front of Cleveland's bench with the shot clock winding down then made the free throw.\n\nJames drove past Fournier and dunked over Nikola Vucevic despite getting hit in the face in the first quarter. He also motored down the lane for a dunk at the first-half buzzer.\n\nTIP-INS\n\nMagic: G Jodie Meeks (fractured right foot) has not played in a preseason or regular-season game. He was acquired in a June 29 trade with Detroit.\n\nCavaliers: Rookie G Kay Felder made his NBA debut and scored his first points on a drive to the basket. ... C Channing Frye is away from the team because of the death of his mother. He also missed Friday's game in Toronto.\n\nADVANCE ANALYSIS\n\nMagic coach Frank Vogel saw plenty of the Cavaliers while he was on the Pacers' bench.\n\n\"They've grown into what everyone thought they would be when they were put together,\" he said. \"Obviously, they won the championship, and now Cleveland looks like a finished product.\"\n\nBACKUP PLAN\n\nLue has been using Iman Shumpert at backup point guard, but doesn't want to overload the veteran.\n\n\"It's a hard position to play,\" Lue said. \"I know he can guard point guards defensively. As far trying to get him to learn the whole playbook, that's not fair. That's not going to happen. He's going to make some mistakes. We just have to live with it for right now.\"\n\nBASEBALL FEVER\n\nHighlights of Game 4 of the World Series between the Indians and Cubs were shown on the arena scoreboard. The crowd cheered on several occasions as the Indians built the lead to go ahead 3-1 in the series.\n\n\"I looked too,\" Lue said. \"I'm guilty of that.\"\n\nSeveral thousand fans attended a watch party across the street at Progressive Field.\n\nUP NEXT\n\nMagic: They play in Philadelphia on Tuesday night, still searching for their first win of the season.\n\nCavaliers: They host Houston on Tuesday night, seeking their first win over the Rockets at Quicken Loans Arena since March 11, 2012.",
  "source": "espn_api",
  "crawled_at": 1764995888.857121
}