{
  "game_id": "401810011",
  "espn_id": "401810011",
  "date": "Nov 03, 2025",
  "matchup": "BKN vs MIN",
  "headline": "Julius Randle has a triple-double to lead the Timberwolves past the winless Nets",
  "body": "NEW YORK -- — Julius Randle had 19 points, 11 rebounds and 10 assists in his 15th career triple-double, and the Minnesota Timberwolves beat the winless Brooklyn Nets 125-109 on Monday night.\n\n\r\n              Donte DiVincenzo scored 25 points, Jaden McDaniels finished with 22 and Rudy Gobert added 15 points and 12 rebounds for the Timberwolves, who won their two straight.\n\n\r\n              Randle had his first triple-double with the Wolves. \n\n\r\n              Cam Thomas had 25 points and Nic Claxton chipped in 19 for the Nets, who fell to 0-7. The Nets opened the 2009-10 campaign with 18 straight losses while playing in New Jersey, two seasons before their move to Brooklyn.\n\n\r\n              Playing once again without All-Star guard Anthony Edwards (hamstring), Minnesota led by 12 points with 9:09 to play in the third quarter before the Nets answered with a 24-13 run.\n\n\r\n              Ziaire Williams hit a 3-pointer from the left wing and was fouled by Randle before his free throw put Brooklyn ahead 88-87 with 1:57 remaining.\n\n\r\n              The Timberwolves took advantage of four straight missed shots and two turnovers as Randle scored four points for a 91-88 advantage at the end of the period.\n\n\r\n              Minnesota then opened the fourth quarter with a 6-0 run while the Nets misfired on three consecutive shots to increase the lead to 97-88, and eventually put the game out of reach.\n\n\r\n              The Timberwolves shot 56% from the field and 41% from 3-point range while outrebounding Brooklyn 53-40.\n\n\r\n              Michael Porter Jr. didn't play for the Nets because of personal reasons.\n\n\r\n              Up next\r\n              Timberwolves: Remain in New York and will play the Knicks on Wednesday.\n\n\r\n              Nets: Visit the Indiana Pacers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042551.294142
}