{
  "game_id": "0022300542",
  "espn_id": "401585170",
  "date": "Jan 13, 2024",
  "matchup": "HOU @ BOS",
  "headline": "Celtics light up Udoka, Rockets 145-113, improve to 19-0 in Boston",
  "body": "BOSTON -- — If Jayson Tatum wants to argue with the referees during a 30-point blowout, that’s OK with Celtics coach Joe Mazzulla.\n\n\r\n              “I’m a pretty self-aware person. I understand the time and score of the game,” Tatum said after he was ejected on back-to-back technical fouls in the fourth quarter of Boston's 145-113 victory over the Houston Rockets on Saturday. “The game was pretty much over. I’ve got to stand up for myself.\" \n\n\r\n              Tatum had 27 points and eight rebounds before being ejected for the second time in six weeks, and Boston remained unbeaten at home by beating the Rockets and ex-coach Ime Udoka. Jaylen Brown scored 32 points and the Celtics improved to 19-0 in the TD Garden – the first time in the history of the much-decorated franchise that it has opened a season with more than 17 wins in a row.\n\n\r\n              “In the NBA you have that space of having to defend yourself, and for me having to defend my guys,” Mazzulla said. “There’s a time and a place for everything, and you’ve just got to pick and choose your spots.” \n\n\r\n              Cam Whitmore scored 22 points and Alperen Sengun had 19 points and 10 rebounds for the Rockets, who have lost three of their last four to drop their record to 19-19. They won just 22 games all last season.\n\n\r\n              Tatum picked up his first technical for complaining about a non-call when his arm was clearly hit during an attempted dunk with 10:17 left in the fourth quarter and Boston leading 117-90. He continued to complain while Aaron Holiday took the foul shot and picked up a second T, then walked over to point at and shout at referee CJ Washington before walking off the court.\n\n\r\n              “I was frustrated,” Tatum said. “At some point throughout the course of the night, you’ve got to stand up for yourself. This is not an every game thing or every night. ... Tonight I just kind of had to let him know I felt.”\n\n\r\n              Asked about the non-call, Mazzulla said, “When it comes to stuff like that, I try not to have an opinion.” \n\n\r\n              Coming off a 33-point loss to Milwaukee on Thursday, the Celtics returned to Boston and extended their home winning streak to 26 consecutive regular-season games dating to last March. They did lose in the TD Garden in last year’s playoffs, including Miami’s Game 7 win in the Eastern Conference finals.\n\n\r\n              “Last game we didn't feel like we were at our best,” Brown said. “Today we wanted to come out and make sure we stayed undefeated tonight on our home court.”\n\n\r\n              The Rockets led by six points in the first quarter and still trailed just 51-50 midway through the second before Boston scored 18 of the next 24 points to take a double-digit lead into halftime. Houston never got within 10 again, with Boston leading by as many as 27 points in the third quarter and 36 in the fourth.\n\n\r\n              Udoka was coaching in Boston for the first time since he was suspended, and then fired, on the eve of the 2022-23 season for inappropriate workplace behavior. Mazzulla replaced him, first as the interim coach, and then full time.\n\n\r\n              “I'm glad to see Ime back, coaching on the sideline,” said Brown, who was caught by Udoka when he fell out of bounds. “I wish those guys the best of luck.”\n\n\r\n              Udoka, who led the Celtics to the NBA Finals in his only season on the Boston bench, got a mixed reaction when he was introduced before the game.\n\n\r\n              “Obviously want to get a chance to run it back with a group you feel you can build and grow with,” he said before the game. “So for me the biggest thing I would say overall is letting some people down, for sure. But we’ve talked it out … and so we move past it.”\n\n\r\n              UP NEXT\n\n\r\n              Rockets: At Philadelphia on Monday.\n\n\r\n              Celtics: At Toronto on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995613.774122
}