{
  "game_id": "0021800158",
  "espn_id": "401070839",
  "date": "Nov 07, 2018",
  "matchup": "MEM vs. DEN",
  "headline": "Gasol's free throws give Grizzlies 89-87 win over Nuggets",
  "body": "MEMPHIS, Tenn. --  In a season when NBA teams are scoring more and playing faster on offense, the Memphis Grizzlies are taking the opposite approach -- relying on their defense.\n\nThat certainly proved successful Wednesday night against the Denver Nuggets.\n\nMarc Gasol scored 20 points, including the go-ahead free throws with 4.6 seconds remaining, and Memphis edged the Nuggets 89-87 to end their five-game winning streak.\n\nThe Nuggets (9-2) had a chance after Gasol's foul shots, but Nikola Jokic's 3-point attempt bounced off the rim and Denver's rebound tip was also off the mark.\n\nMemphis held the Nuggets to 39 percent shooting, including 8 of 32 from 3-point range. The 87 points were a season low for the Nuggets, and the 176 points combined by the teams tied for the fewest in an NBA game this season.\n\n\"We knew it was going to be an ugly game if we were going to have a chance of winning,\" Grizzlies guard Mike Conley said. \"We tried to get in the mud a little bit, be physical defensively and get the pace where we wanted it.\"\n\nJaren Jackson Jr. also had 20 points for Memphis, and Kyle Anderson finished with 14. Gasol grabbed 12 rebounds.\n\nGary Harris led the Nuggets with 20 points, and Trey Lyles added 16 off the bench. Jamal Murray had 15 points and seven assists after scoring a career-best 48 in Monday night's win over Boston.\n\nMurray shot only 6 of 21 this time.\n\n\"I don't know what it was, but the ball didn't like me today,\" Murray said.\n\nDenver was up 83-82 before Memphis took the lead on a 3-pointer by Shelvin Mack with 1:45 left. Conley hit a floater with 40 seconds to go, but Lyles' dunk and a 22-foot jumper by Murray tied it at 87 before Gasol's winning free throws.\n\nMemphis coach J.B. Bickerstaff told his team he wanted to get back to a defensive mentality and force opponents to fight through low-scoring games if they want to beat the Grizzlies.\n\n\"That's exactly what this win represents,\" Memphis guard Garrett Temple said. \"Holding this team -- as hot as they've been -- to 87 points at home ... it was a big win for us.\"\n\nTIP-INS\n\nNuggets: Murray was limited to seven points on 3-of-10 shooting in the first half. He missed his first four 3-pointers before converting one near the 9-minute mark of the third quarter. ... Jokic, who averages 11 shots a game, took just one -- his 3-point try in the closing seconds. \"I'll have to look at the tape to see what they are doing for him to only take one shot,\" coach Michael Malone said. \"Obviously, I would like him to take more shots, but right now he isn't shooting the ball and we will have to figure out why.\"\n\nGrizzlies: Committed eight turnovers in the first quarter and finished with 18, compared to 19 for Denver. Memphis has had fewer turnovers than its opponent in every game this season. ... The Grizzlies (6-4) are 4-0 at home. . Gasol and Jackson had three blocks each. Jackson also made three steals.\n\nPACE OF PLAY\n\nThe game was a contrast of styles, with Memphis relying on its slower-pace defensive approach against a Denver team that entered averaging almost 112 points per game.\n\n\"They definitely got us into their game,\" Nuggets reserve center Mason Plumlee said, later adding: \"It was a slow, slow game, so I think that benefited them.\"\n\nConley acknowledged Memphis can score 130 points in a game, but: \"Defensively, I do think this is what you should expect from us.\"\n\nUP NEXT\n\nNuggets: Host the Brooklyn Nets on Friday.\n\nGrizzlies: At the Milwaukee Bucks on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994138.7576342
}