{
  "game_id": "0022400959",
  "espn_id": "401705525",
  "date": "Mar 14, 2025",
  "matchup": "IND @ PHI",
  "headline": "Siakam scores 27 points and helps Pacers rally with big second half to beat the 76ers 112-100",
  "body": "PHILADELPHIA -- — Pascal Siakam scored 17 of his 27 points in the second half, and the Indiana Pacers beat the Philadelphia 76ers 112-100 on Friday night.\n\n\r\n              Myles Turner added 18 points and seven rebounds, while Tyrese Haliburton had 14 points and 10 assists as the Pacers ended a four-game road losing streak.\n\n\r\n              Jeff Dowtin scored a career-high 24 points for the 76ers, who lost their third straight. Jared Butler added 17 points and Adem Bona had 16 points and nine rebounds.\n\n\r\n              The 76ers led 26-18 after one and still led 51-47 at the half, before Siakam scored 12 points on 6-of-8 shooting in the third to send Indiana into the lead for good. \n\n\r\n              The Pacers outscored the 76ers by 16 points in the second half.\n\n\r\n              Takeaways\r\n              Pacers: Indiana moved back into a tie with the Bucks for the No. 4 seed in the Eastern Conference ahead of a trip to Milwaukee on Saturday for a rematch of the Pacers' victory Tuesday on Haliburton's four-point play with 3.4 seconds remaining.\n\n\r\n              76ers: Playing without Joel Embiid, Paul George and Tyrese Maxey, Philadelphia will take whatever healthy bodies it has on the road for the next six games.\n\n\r\n              Key moment\r\n              The Pacers opened the fourth quarter with a 12-2 run that turned a three-point game into a double-digit advantage. Siakam hit two baskets during the run, both on assists from Haliburton.\n\n\r\n              Key stat\r\n              The Pacers made up for 28.6% shooting from 3-point range by scoring 60 points in the paint.\n\n\r\n              Up next\r\n              The Pacers stay on the road to visit Milwaukee on Saturday. The 76ers open their road trip at Dallas on Sunday.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997485.9606578
}