{
  "game_id": "0021601026",
  "espn_id": "400900421",
  "date": "Mar 17, 2017",
  "matchup": "ORL @ PHX",
  "headline": "Magic end 4-game skid with 109-103 win over Suns",
  "body": "PHOENIX --  In a season that hasn't gone well, the Orlando Magic entered Friday night with only three wins in the second of back-to-back games this season.\n\nMake it four.\n\nEvan Fournier scored 11 of his 25 points in the first quarter, and the Magic ended a four-game losing streak with a 109-103 win over the Suns. The key was a good start and good finish a night after a 30-point loss at Golden State.\n\nNikola Vucevic, playing on a gimpy ankle that he rolled Thursday night, scored 18 points and grabbed 17 rebounds in 32 minutes. Aaron Gordon added 17 points, and Terrence Ross made a 3-pointer with 2:07 to play that gave Orlando a 107-98 lead that the Suns couldn't overcome.\n\n\"We made plays down the stretch, but I was more impressed with how we started the game,\" Magic coach Frank Vogel said. \"We had 17 deflections in the first quarter. That's probably a high for a quarter.\"\n\nT.J. Warren's 26 points led the Suns, who have lost five of six. Rookie point guard Tyler Ulis, making his second career NBA start, scored 19 points and added eight assists.\n\nSuns leading scorer Devin Booker was held to 10 points and didn't score until the third quarter. After the game, coach Earl Watson said Booker is dealing with Achilles and ankle injuries.\n\n\"I'm sure nine out of 10 people that are on the floor at the time have to have something going on, so no excuse,\" Booker said. \"Game 70, man.\"\n\nThe Magic led by as many 14 points in the first quarter, going on a 15-0 run during one stretch after trailing 14-13. Phoenix had nine turnovers in the first 12 minutes.\n\n\"It's too bad we needed a bad loss to actually have a good game,\" Fournier said. \"That was the key, come out strong. We've had trouble this year closing games, but we had the shots we wanted and fortunately for us, they went in.\"\n\nThe Suns went on a run of their own in the second quarter, tying it at 32 when Ulis tossed a lob to Derrick Jones Jr. for a dunk at the 8:20 mark. But the Magic got hot again, going from a 42-40 lead to a 52-42 advantage after a 3 from Gordon with 3:57 to go.\n\nThe Suns ended the half well, led by Alan Williams and Ulis. Williams scored eight of his 10 second-quarter points in the final three minutes and Ulis scored 12 points in the second quarter, trimming the Magic lead to 60-58 at the break.\n\nPhoenix took a 70-65 lead when Ulis delivered a sharp bounce pass to Warren for a layup with 8:03 to go in the third quarter.\n\n\"He's getting better and better,\" Watson said of Ulis. \"He's learning right now in the NBA you can't come out and play the same game every game as a point guard. You have to start different ways.\"\n\nSuns forward Marquese Chriss left the game in the third quarter after a collision that required four stitches above his right eye. He returned to the bench before the fourth started and got back into the game.\n\nTIP-INS\n\nMagic: The Magic improved to 8-10 all-time on St. Patrick's Day. ... The Magic have made at least one 3-pointer in 808 consecutive games, a streak that started on March 17, 2007. ... Fournier has scored in double figures in 49 games this season.\n\nSuns: G Leandro Barbosa did not play due to illness. ... The Suns appear committed to playing their youngsters for the rest of the season. G Eric Bledsoe and G Brandon Knight have been shut down, and C Tyson Chandler hasn't played since before the All-Star break. Phoenix used nine players Friday. \"If they shut me down, they shut me down,\" said Bledsoe, who started all 66 games in which he played. \"At the end of the day, I can control what I can when I'm out there on the floor.\"\n\nAIR GORDON\n\nGordon, who has taken part in the past two NBA Slam Dunk Contests at All-Star Weekend, had the two dunks of the night when he dribbled up court, crossed over Ulis and soared high for a jam with 6:50 to go in the third quarter. Then he caught a lob from Elfrid Payton and, with one hand, stuffed the ball before hitting the floor hard with 4:53 to play. It gave the Magic a 97-94 lead.\n\nPRICE-D IN\n\nSuns guard Ronnie Price, signed for the duration of the season on Feb. 24, was the only backup at point guard to Ulis on Friday. He played a season-high 20 minutes.\n\nUP NEXT\n\nMagic: Return home for the next three games, starting with Philadelphia on Monday.\n\nSuns: Open six-game road trip Sunday at Detroit.",
  "source": "espn_api",
  "crawled_at": 1764995818.5625331
}