{
  "game_id": "0022000625",
  "espn_id": "401307410",
  "date": "Mar 17, 2021",
  "matchup": "LAC @ DAL",
  "headline": "Doncic, Mavs answer, earn split with Clippers in 105-89 win",
  "body": "DALLAS -- — Luka Doncic thrilled the crowd early with a four-point play after getting fouled by Kawhi Leonard, then turned for a lengthy acknowledgement of those fans after one of several late buckets that helped keep Dallas comfortably in front.\n\n\r\n                    In a two-game set with the feel of a playoff series, the Mavericks got the split behind their young sensation.\n\n\r\n                    Doncic scored 42 points, and the Mavericks answered a loss against their first-round playoff opponent from last season, beating the Los Angeles Clippers 105-89 on Wednesday night.\n\n\r\n                    Josh Richardson scored 14 points and was a defensive spark as the Mavericks followed a 109-99 defeat two nights earlier and won the season series, 2-1. The other Dallas victory was by 51 points in LA three games into the season in December, about four months after the Clippers finished off the Mavs in six games in the NBA’s playoff bubble.\n\n\r\n                    “They’re a really good defensive team,” said Doncic, who was 16 of 28 from the field, including 6 of 11 from 3-point range. “It’s kind of tough, back-to-back games like the playoffs. That’s why we’ve got to be ready for the playoffs if we make it.”\n\n\r\n                    Paul George had 28 points for the Clippers, including a pair of 3-pointers in the final minute of the third quarter that cut a 12-point deficit in half going to the fourth.\n\n\r\n                    Doncic, who scored 22 points in the first half, took over in the fourth quarter, assisting on a 3 for Jalen Brunson’s first points of the game and hitting a fadeaway jumper and a 3 to get the lead back to 12 at 87-75.\n\n\r\n                    Leonard scored 20 points while Marcus Morris Sr. had 11 in his second consecutive start but was just 1 of 9 from 3-point range while the Clippers shot 28% (9 of 32) from long range.\n\n\r\n                    “For the most part I thought we did a good job defensively other than Luka torched us,” coach Tyronn Lue said. “I thought offensively we didn’t trust, we didn’t continue to share the basketball. We forced a lot of stuff all night.”\n\n\r\n                    Richardson, added in an offseason trade that cost the Mavericks their best 3-pointer shooter in Seth Curry as they tried to improve defensively, affected the game in just the way Dallas envisioned.\n\n\r\n                    The fiery guard had two steals on inbound plays after Dallas baskets in the first half, one of them after his own 3-pointer. Richardson, who finished with three steals, also blocked Reggie Jackson's dunk attempt in transition before halftime.\n\n\r\n                    “That set the tone for the game,” coach Rick Carlisle said of the early steals. “That's just a signal to everyone in the arena that we're here. He was here. And we weren't going anywhere. That's a big moment.”\n\n\r\n                    With George hounding him as the Clippers tried to rally in the fourth quarter, Doncic found Maxi Kleber for a 3, then connected with him in an alley-oop dunk on his ninth and final assist to get the lead to 15. Kleber scored 12 points.\n\n\r\n                    “He got comfortable and he made shots,” Leonard said of Doncic, who had six rebounds. “It's hard to turn off that water once a great player like that gets rolling.”\n\n\r\n                    Kristaps Porzingis, Doncic's European sidekick, had a quiet night on offense with 11 points but had 13 rebounds as Dallas won the battle of the boards after losing it two nights earlier.\n\n\r\n                    “I'm not surprised at all at how we came out and stayed with it,” Carlisle said. “These guys have been in the playoffs. They have a very good idea what these types of games are like. The burning question is always where do you take it from here.”\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: C Serge Ibaka missed his second consecutive game with lower back tightness. ... Leonard missed both free throws in the third quarter after Carlisle unsuccessfully challenged a foul call. Tim Hardaway Jr. thought he thwarted a dunk attempt by knocking the ball loose without fouling, but replay showed him grazing Leonard's right hand.\n\n\r\n                    Mavericks: Dorian Finney-Smith was out because of the birth of his son earlier in the day. ... F James Johnson was missed a third consecutive game and will be out for both upcoming games in Portland. Johnson has to pass a series of COVID-19 tests before he can rejoin the team after going to Wyoming to attend to personal business. ... Hardaway scored 15 points.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Coming off three games in four days, LA gets two days off before a home game Saturday against Charlotte, which has lost 10 consecutive games at Staples Center dating to 2009.\n\n\r\n                    Mavericks: A stretch of eight out of nine games on the road starts with two in a row in Portland. The first is Friday. The Trail Blazers won the only meeting in Dallas last month.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997682.285537
}