{
  "game_id": "0021500018",
  "espn_id": "400827905",
  "date": "Oct 29, 2015",
  "matchup": "MEM @ IND",
  "headline": "Gasol, Conley help Grizzlies get past Pacers 112-103",
  "body": "INDIANAPOLIS --  The Memphis Grizzlies believed they could dominate the fourth quarter against the Indiana Pacers on Thursday night.\n\nThen they proved it.\n\nMarc Gasol scored eight of his team-high 20 points and Jeff Green scored half of his 12 points in the final 4 minutes, helping the Grizzlies pull away for a 112-103 victory.\n\n\"The last 5 minutes we played pretty well -- defensively we were a lot more aggressive,\" said Gasol, who had eight rebounds and three assists. \"When our defense is clicking, offensively, things get much better.\"\n\nIt sure wasn't easy -- and maybe not as clean as the Grizzlies (1-1) had hoped.\n\nThey blew a 15-point first-quarter lead and trailed by nine with less than 2 minutes to go in the third quarter before rallying. Memphis scored the final seven points in the third, opened the fourth with four straight to retake the lead and finally closed a topsy-turvy final quarter with an 18-7 run to seal it.\n\nBut after getting blown out by Cleveland in Wednesday's season opener, Memphis hit the road with one goal: Avoid consecutive losses on back-to-back nights.\n\n\"Last night we got our butt whipped, so guys came out with a lot more energy in this game,\" Zach Randolph said after finishing with 11 points and eight rebounds. \"We stuck with it, we stuck to our defense, guys hit shots. It was a good team win.\"\n\nMemphis looked like the team that led the NBA in scoring during the preseason.\n\nSeven players reached double figures, including Mike Conley, who had 13 points and 10 assists. The Grizzlies shot 50 percent from the field and were a solid 7 of 16 on 3-pointers. And they scored 39 points in the final quarter, with Gasol and Jeff Green accounting for 14 points in the closing run.\n\nIt almost wasn't enough, though.\n\nGeorge Hill led the Pacers with 20 points while Paul George had 18 points, eight rebounds and five assists as the Pacers dropped to 0-2 for the first time in six years.\n\n\"It's going to be tough to win games when we give up 30 points and 40 points a quarter,\" Hill said.\n\nSCORING BIG\n\nIn addition to Gasol, Conley, Green and Randolph, Memphis' other double-digit scorers were: Beno Udrih, who had 13 points and six assists; and Matt Barnes and Courtney Lee had 10 each.\n\nNOT SO FINE\n\nJust before tip-off, league officials announced George had been fined $10,000 for publicly criticizing the refs after Wednesday's 106-99 loss at Toronto. Apparently, his complaints didn't stop there. He drew a technical foul 91 seconds into Thursday's game. But it's his shooting numbers that have been more frustrating. George went 5 of 15 from the field against Memphis after a 4-for-17 performance in the season opener.\n\nTHE CROSSROADS\n\nIndiana is a basketball haven, and it was evident again Thursday. Four of the starters were playing in their home state. Randolph, Conley, Lee and Hill, the Pacers' point guard, all played prep ball in Indiana. They combined for 54 points, 17 rebounds and 17 assists.\n\nIN THE SPOTLIGHT\n\nMyles Turner, the Pacers' first-round draft pick, missed the season opener with a sore right ankle. He looked just fine against Memphis. Turner helped spur Indiana's first-half comeback with six points in less than 10 minutes. The second half wasn't as impressive. He finished with eight points and four rebounds on what Turner called a dream night.\n\nTIP-INS\n\nGrizzlies: Memphis has won four straight over the Pacers and two in a row at Indiana. Both tie franchise bests. ... Memphis took advantage of its size differential by outscoring Indiana 48-26 in the paint. ... The Grizzlies had 12 steals and 14 turnovers.\n\nPacers: Indiana is trying to avoid its first 0-3 start since 2009-10. .... F Jordan Hill replaced C.J. Miles in the starting lineup Thursday. Hill finished with four points and six rebounds. Miles added 18 points off the bench. ... Indiana was 12 of 30 on 3s.\n\nUP NEXT\n\nGrizzlies: Memphis hosts Brooklyn on Saturday.\n\nPacers: Indiana hosts Utah on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994491.486686
}