{
  "game_id": "0022401083",
  "espn_id": "401705649",
  "date": "Mar 30, 2025",
  "matchup": "MIL vs. ATL",
  "headline": "Risacher scores 36, Daniels sets Hawks' steals record in 145-124 victory over the Bucks",
  "body": "MILWAUKEE -- — Zaccharie Risacher scored a season-high 36 points, Dyson Daniels added 22 points and five steals while becoming Atlanta's single-season leader, and the Hawks beat the slumping Milwaukee Bucks 145-124 on Sunday night.\n\n\r\n              Trae Young had 19 points and 19 assists, and Georges Niang finished with 17 points for the Hawks, who snapped a two-game skid.\n\n\r\n              Atlanta turned around the game after Milwaukee's blistering start and gained control in the third quarter, outscoring the Bucks 36-17 for a 118-92 lead entering the final period.\n\n\r\n              Milwaukee closed within 133-121 on two free throws by Kevin Porter Jr. with 4:40 remaining. Risacher hit three free throws to put the Hawks up 142-123 with just over 2 ½ minutes left.\n\n\r\n              Giannis Antetokounmpo had 31 points, Porter scored 28 and Kyle Kuzma had 25 for the Bucks, who have lost four straight.\n\n\r\n              Milwaukee made 17 of 20 shots (85%) in the opening quarter, including 5 of 7 beyond the arc. Kuzma was 6 for 6, making both 3-pointers, for 14 points.\n\n\r\n              The Hawks then went ahead 82-75 at the break, their highest-scoring first half of the season. The Bucks shot 69% and Atlanta 57.1%, but the Hawks turned eight turnovers into 16 points.\n\n\r\n              Takeaways\r\n              Hawks: Daniels increased his NBA-leading total to 213 steals and passed Mookie Blaylock, who had 212 three times with the Hawks.\n\n\r\n              Bucks: Since March 5, when the Bucks were a season-best 11 games over .500, they have gone 4-9.\n\n\r\n              Key moment\r\n              The Hawks opened the third quarter with a 17-6 run to extend their lead to 99-81.\n\n\r\n              Key stat\r\n              Risacher and Daniels were a combined 22 of 36 from the field.\n\n\r\n              Up next\r\n              The Hawks host the Trail Blazers on Tuesday, and the Bucks host the Phoenix Suns on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997819.396511
}