{
  "game_id": "0021800184",
  "espn_id": "401070865",
  "date": "Nov 11, 2018",
  "matchup": "CHA @ DET",
  "headline": "Tony Parker has 24 points, Hornets beat Pistons 113-103",
  "body": "DETROIT --  Most of the stars of the 2005 NBA Finals have been out of the league for several years.\n\nTony Parker, is still beating the Detroit Pistons.\n\nSunday, he faced them for the first time as a member of the Charlotte Hornets, but the results weren't any different. The 36-year-old scored 24 points in 28 minutes off the bench to lead Charlotte to a 113-103 victory.\n\n\"That's what Tony does. I'm just surprised that he never loses any of his speed and quickness,\" Pistons coach Dwane Casey said. \"He got to every spot he wanted to out there, and we weren't stopping him.\n\n\"He's probably going to be a first-ballot Hall of Famer, but we've got to be better.\"\n\nParker improved to 20-11 in the regular season against the Pistons, first playing them as a 19-year-old with San Antonio on Jan. 2, 2002. The Spurs also beat Detroit in seven games in the 2005 finals.\n\n\"(Tony) is a leader,\" said Kemba Walker, who had 24 points and seven assists. \"He brings passion and the winning attitude. He just knows how to win.\"\n\nCody Zeller added 14 points as Charlotte won for the third time in four games.\n\n\"I thought they were great tonight,\" Charlotte coach James Borrego said. \"Their effort and their attention to detail were fantastic. I'm really proud of our group on both ends of the floor.\"\n\nAndre Drummond had 23 points and 22 rebounds for the Pistons, and Reggie Bullock had a career-high 23 points, hitting six 3-pointers. Detroit has lost six of eight after a 4-0 start.\n\n\"We are our own worst enemies,\" Casey said. \"We have to make shots and we have to stop getting caught out of position on defense. I'm going to have to make sure everyone understands our defensive assignments.\"\n\nDetroit's Blake Griffin was given a flagrant-2 foul and ejected with 7:06 to play for a shoulder check on Malik Monk. Griffin shot 4-for-16, missing all five 3-pointers, and is 6-for-26 in his last two games.\n\n\"We're asking Blake to carry too much of a load right now,\" Casey said. \"He's bringing the ball up the floor, then going into the post and getting hit on every shot. It's taking a toll on him.\"\n\nThe Hornets started the third quarter with a 10-2 run to go ahead 61-51, and only 12 points from Bullock in the quarter kept Detroit within eight going into the fourth. Walker had nine points in the quarter and Charlotte went 6 of 8 on 3-pointers.\n\n\"We played hard and we played the right way, but the challenge is not getting frustrated,\" said Reggie Jackson. \"We have to find a way to stay consistent all game.\"\n\nCharlotte also jumped on the Pistons at the beginning of the fourth. The Hornets scored the first eight points to take a 16-point lead.\n\n\"I think it was really about urgency,\" Borrego said. \"It isn't about playing perfect basketball but playing with urgency and aggressiveness for 48 minutes.\"\n\nCharlotte rookie Miles Bridges, who played at Michigan State, delighted a huge group of friends and family with an uncontested windmill dunk to make it 95-77 with 8:51 left.\n\n\"This was great, especially getting the win,\" he said. \"I knew I wasn't going to be a star right away on a team with Kemba, so I'm just adjusting to the league and learning my spots.\"\n\nTIP INS\n\nHornets: Michael Kidd-Gilchrist left early in the second quarter with a sprained right ankle and did not return. Kidd-Gilchrist had 12 points and 12 rebounds in a 133-132 overtime loss at Philadelphia on Friday night.\n\nPistons: Drummond's 20-20 game was the 25th of his career and his 301st double-double. He leads both categories since he joined the NBA in 2012-13.\n\nUP NEXT\n\nHornets: At Cleveland on Tuesday night.\n\nPistons: At Toronto on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994430.428183
}