{
  "game_id": "0021500717",
  "espn_id": "400828604",
  "date": "Jan 31, 2016",
  "matchup": "PHX @ DAL",
  "headline": "Williams helps Mavs win without Nowitzki, 91-78 over Suns",
  "body": "DALLAS -- Deron Williams wrapped up a busy January for Dallas by filling the offensive void while Dirk Nowitzki took a night off to rest.\nWith Nowitzki sitting out the 18th game of the month, the front end of a back-to-back and the start of five games in seven days, Williams scored 27 points and his hometown Mavericks surged past the lowly Phoenix Suns 91-78 on Sunday.\n\"I think everyone knows when Dirk is out we have to step up a little bit when it comes to scoring,\" said Williams, the former Dallas-area high school player who finished three points shy of his season best in his first year with the Mavericks.\nDwight Powell had six straight points for all his scoring to give the Mavericks the lead for good in the fourth quarter on a night when Dallas was hoping to rest its 37-year-old leading scorer and still beat a team with 13 straight road losses.\n\nThe Mavericks did that and finished 9-9 in January thanks to a 23-5 run over the final 9 minutes. They gave up their fewest points in the fourth quarter this season, outscoring Phoenix 23-9.\nPowell's points turned a 75-74 deficit into an 80-75 lead, with Raymond Felton assisting on a pair of baskets before Powell made two free throws.\n\"It was one of those nights where you couldn't put the ball in the basket but you have to find a way to contribute to the team no matter what,\" said Felton, who had a game-high six assists with 10 points on 2-of-8 shooting.\nRookie guard Devin Booker led the Suns in scoring for the third straight game with 19 points.\nIt appeared the Suns might make Dallas regret the decision to sit Nowitzki the night before a trip to Atlanta, going up 65-60 in the third quarter on a 10-0 run that included eight consecutive points from Booker.\nThe lead was still five after Markieff Morris hit a fadeaway jumper early in the fourth quarter. But the Suns didn't make another field goal until there was just 1:15 left, a dunk by Morris that cut Phoenix's deficit to 89-78 and ended a 21-3 Dallas surge.\nMorris was the only player to score in the fourth quarter for Phoenix, which went 3 of 15 from the field and shot 37 percent for the game. The Suns' last road win was Dec. 7 at Chicago, and they dropped to 2-19 starting with a blowout loss at Utah on Dec. 21.\n\"Late-game situations have been a problem for us all year,\" said Booker, who had seven rebounds and four assists. \"Other teams start executing, and that's something we have to work on. That's when we need to buckle down.\"\nTyson Chandler had his seventh double-double with 12 points and 13 rebounds in another visit to Dallas, the team he has left twice in free agency after playing a significant leadership role in the franchise's only championship in 2011.\nHis replacement, Zaza Pachulia, just missed what would have been a career-best 22nd double-double. He had nine points and 15 rebounds.\nNO REGRETS\nChandler is already relegated to playing for pride after quickly picking Phoenix in free agency and leaving the Mavericks in the DeAndre Jordan-or-bust scenario that left his former team scrambling at center. The Suns still had hope his first time back. Now he says there are no regrets.\n\"I feel like throughout my career I've always been placed where I'm supposed to be placed,\" he said. \"This definitely has been a tough season but I feel like there has to be some positives that come out of this.\"\nTIP-INS\nSuns: Coach Jeff Hornacek suggested that guards Brandon Knight (left groin strain) and Ronnie Price (right big toe surgery) might sit out until the All-Star break to take advantage of the extra time off. ... F T.J. Warren sat out with a sprained right ankle. He was injured in Cleveland and didn't move well two nights later at New York.\nMavericks: G Devin Harris missed his fourth straight game with a right big toe injury. ... G Wesley Matthews had his fourth straight single-digit scoring game with seven points on 2-of-12 shooting. ... In his 18th season, Nowitzki sat out for the second time in three games after skipping the second night of a back-to-back at Golden State on Wednesday.\nUP NEXT\nSuns: Start a seven-game homestand, their longest of the season, Tuesday against Toronto.\nMavericks: At Atlanta on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994841.56422
}