{
  "game_id": "0022300133",
  "espn_id": "401584761",
  "date": "Nov 04, 2023",
  "matchup": "CHA @ IND",
  "headline": "Mark Williams scores 27 as Hornets rally to edge Pacers 125-124",
  "body": "INDIANAPOLIS -- — Mark Williams scored 27 points, Gordon Hayward had 23 and the Charlotte Hornets snapped a three-game losing streak with a 125-124 victory over the Indiana Pacers on Saturday night.\n\n\r\n              Terry Rozier scored 22 and has scored 20 or more in all five Hornets games this season.\n\n\r\n              Tyrese Haliburton tied a career high with 43 points to lead the Pacers, who have lost three of their last four. \n\n\r\n              Williams, who made 9 of 12 shots and had seven rebounds, scored nine points in the fourth quarter to help Charlotte rally. Nick Richards led the Hornets with 10 rebounds.\n\n\r\n              Williams scored on a layup with 1:03 left to give the Hornets a 125-122 lead. The Pacers closed the deficit to 125-124 on Buddy Hield's basket with 29 seconds left. Hield, who had 19 points, was fouled but missed the potential game-tying free throw.\n\n\r\n              Haliburton had a chance but Charlotte's LaMelo Ball, who had 11 assists, forced a turnover before he could get a shot off. \n\n\r\n              “We did a good job inbounding the ball late and obviously on the last play, Melo made a nice play,” Hornets coach Steve Clifford said.\n\n\r\n              Rozier suffered a left groin strain and needed to be helped off the floor with a little more than six minutes left in the game. Clifford said Rozier will have an MRI.\n\n\r\n              Haliburton, who had 12 assists, scored 25 points in the third quarter as Pacers erased a 54-46 halftime deficit to take a 96-92 lead. Haliburton, who tied Jordan Nwora’s franchise record for points in a quarter, sank 6 of 8 3-pointers in the quarter.\n\n\r\n              “Haliburton's third quarter was historic,” Pacers coach Rick Carlisle said. “We needed to back that up with a solid fourth quarter and they threw some hellacious shot making at us. It was some unfortunate situations for us. We have to continue to work to shore things up.”\n\n\r\n              After the Pacers shot 33.3% in the first half, Indiana made 81% of its shots in the third quarter. The Hornets, who made nearly 49% from the field in the opening half, shot 65% in the third quarter.\n\n\r\n              The teams were tied at 27-all at the end of the opening quarter and Charlotte led 54-46 at halftime.\n\n\r\n              The Hornets have been hurt by slow starts and Clifford said this was their best first half in the five games.\n\n\r\n              “We’ve got to shoot and make more 3s than that but their defense had a lot to do with that,” Clifford said. “Haliburton got going in the third. We tried to double-team him and he took us apart. They moved the ball well and we couldn’t find a scheme that worked.”\n\n\r\n              Jarace Walker, the Pacers first-round draft pick, was sidelined by a respiratory infection.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Charlotte will play its third consecutive road game in Dallas on Sunday.\n\n\r\n              Pacers: Host San Antonio on Monday in the third game of a five-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995669.384908
}