{
  "game_id": "0022400128",
  "espn_id": "401704694",
  "date": "Oct 31, 2024",
  "matchup": "MEM vs. MIL",
  "headline": "Morant's triple-double helps Grizzlies build big lead and coast to 122-99 victory over Bucks",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 26 points, 14 assists and 10 rebounds and helped the Memphis Grizzlies build a 31-point second-half cushion and beat the Milwaukee Bucks 122-99 on Thursday night.\n\n\r\n              Santi Aldama added 19 points and nine rebounds, while Scotty Pippen Jr. and Jaylen Wells finished with 16 points each as the Grizzlies snapped a two-game skid. Memphis ended the night shooting 52%, including Morant going 9 for 16. Seven Grizzlies players finished in double figures.\n\n\r\n              Giannis Antetokounmpo led the Bucks with 37 points and 11 rebounds, connecting on 17 of 22 shots. Brook Lopez scored 12 and Bobby Portis Jr. finished with 11 points.\n\n\r\n              Milwaukee has lost four straight.\n\n\r\n              Takeaways\r\n              Bucks: Damian Lillard continues to struggle with his shooting. Lillard was 1 for 12 in the game , including missing all six of his 3-pointers. Lillard is just 6 for 27 on 3s in his last three games.\n\n\r\n               Grizzlies: After looking lethargic on both ends of the floor in a Wednesday loss to Brooklyn, Memphis came out with much more energy, shooting 51% in the first half and holding the Bucks to 42%. The lead reached 31 early in the fourth as Memphis continued to shoot better than 50%.\n\n\r\n              Key moment\r\n              Morant, who expressed some frustration after Wednesday’s loss to the Nets, took over the game in the first half. At the midway point, he was already on the verge of his 12th career triple-double with 21 points, nine assists and eight rebounds. One of those assists came on a scramble for the ball in the front court before Morant grabbed the ball, and from the seat of his pants, spotted Aldama for a reverse dunk. \n\n\r\n              Key stat\r\n              The Bucks were 9 for 42 from 3-point range, while Memphis finished the night at 52%\n\n\r\n              Up next\r\n              Bucks host Cleveland on Saturday, while the Grizzlies visit Philadelphia.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997761.497222
}