{
  "game_id": "0022000263",
  "espn_id": "401307872",
  "date": "May 14, 2021",
  "matchup": "MEM vs. SAC",
  "headline": "Winslow has 26 points, 13 rebounds as Grizzlies defeat Kings",
  "body": "MEMPHIS, Tenn. -- — Justise Winslow had season highs with 25 points and 13 rebounds, and the Memphis Grizzlies held on to defeat the Sacramento Kings 107-106 on Friday night.\n\n\r\n                    Killian Tillie and Xavier Tillman each had 16 points for Memphis, with Tillman adding 10 rebounds. John Konchar finished with 15 points as the Grizzlies won their fifth straight.\n\n\r\n                    Louis King led the Kings with a career-high 27 points and Damian Jones added 17 points and 11 rebounds. Justin James scored 16 after scoring a career-high 31 in Sacramento’s loss to Memphis on Thursday night.\n\n\r\n                    “This was a tough victory,” Memphis coach Taylor Jenkins said. “Kind of got a little dicey at the end, but made just enough plays throughout the game and down the stretch. Big-time stops.”\n\n\r\n                    The Kings had a chance to win it after Winslow missed a pair of free throws with 5.3 seconds left, but Terence Davis’ 3-point attempt bounced off the rim, preserving Memphis’ win.\n\n\r\n                    “We had chances, but 10 for 42 from 3 is going to be tough when the ball’s not going in like that,” Sacramento coach Luke Walton said. “But the overall effort was great.”\n\n\r\n                    The game meant nothing to either team as far as the standings for the postseason. The Kings were eliminated Thursday night. Meanwhile, Memphis plays at Golden State on Sunday, the winner earning the eighth seed in the Western Conference play-in tournament and the loser dropping to ninth.\n\n\r\n                    With that in mind, there was a lot of “soreness” on the Grizzlies injury report. Eight Memphis players were declared out for the game, including all five starters from Thursday night.\n\n\r\n                    Meanwhile, the Kings were already dealing with the loss of several top scorers, such as De’Aaron Fox, Marvin Bagley and Harrison Barnes. Add to that Richaun Holmes, who left Thursday night’s game with right knee soreness.\n\n\r\n                    That left the game mostly in the hands of the reserve squads.\n\n\r\n                    “It was good to see some guys we were evaluating get some big minutes and play well,” Walton said.\n\n\r\n                    King, who signed a two-way contract with Sacramento on May 1, had 16 at the first half as the Kings took a 57-53 into the break. King continued to produce after halftime.\n\n\r\n                    “A lot of people don’t get this chance,” King said. “Not everyone in the NBA can say they got the opportunity to play a lot of big minutes. Fortunately, coach looked my way, and I took it as an opportunity for myself and a chance for me to shine.”\n\n\r\n                    Winslow led the Grizzlies with 12 points at the half, shooting 4 of 7 from the field, including a pair of 3-pointers.\n\n\r\n                    Memphis erased the Kings’ lead by outscoring Sacramento 26-19 in the third, the Grizzlies holding a 79-76 lead entering the fourth.\n\n\r\n                    Memphis now is able to concentrate on Sunday’s showdown with the Warriors for a better seed in the play-in tournament. Jenkins has been reluctant to look past the two-game series with the Kings before talking about the importance of Sunday’s game.\n\n\r\n                    “Obviously, a pivotal game,” Jenkins said when asked about Sunday in his postgame press conference. “We’ve still got a lot of basketball ahead of us. Big game on Sunday. \n\n\r\n                    “This is the time of year you are hopefully playing your best basketball. Really proud of the efforts our guys have been giving over the last week-plus. Hopefully have that effort again on Sunday against a really good team in a really tough game.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Chimeze Metu drew a technical foul in the first quarter complaining about a no-call. Metu finished with 15 points. ... King’s previous career high was five points in 2019. \n\n\r\n                    Grizzlies: Winslow recorded his first double-double of the season. ... G Tim Frazier grabbed his 500th career defensive rebound. ... De’Anthony Melton added 10 points. ... Memphis’ five-game winning streak is currently the longest in the NBA.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Host the Utah Jazz on Sunday.\n\n\r\n                    Grizzlies: Travel to Golden State to face the Warriors on Sunday.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997715.7847822
}