{
  "game_id": "0022301193",
  "espn_id": "401585821",
  "date": "Apr 14, 2024",
  "matchup": "DEN @ MEM",
  "headline": "Defending champion Nuggets finish second in West, beating Grizzlies 126-111",
  "body": "MEMPHIS, Tenn. -- — Jamal Murray scored 21 points, Nikola Jokic had 15 points and 15 rebounds, and the defending champion Denver Nuggets secured the No. 2 seed in the Western Conference with a 126-111 victory over the Memphis Grizzlies on Sunday.\n\n\r\n              The Nuggets (57-25) matched a franchise high for wins and finished with the same record as Oklahoma City, but the Thunder took the top spot in the West because of a head-to-head tiebreaker. Minnesota's loss to Phoenix dropped the Timberwolves into third, one game behind Denver.\n\n\r\n              Nuggets coach Michael Malone said the key to matching the franchise record was “not being satisfied with last year.”\n\n\r\n              “To tie the franchise record for wins in a season is outstanding, especially on the heels of winning a championship,” Malone said. “That's been the mantra all year long. Not being satisfied.”\n\n\r\n              Denver entered the game in a three-way tie with Minnesota and Oklahoma City. It was the first time such a logjam had existed on the final day of the season with three teams having a chance at the No. 1 seed. The Thunder locked up the top spot by routing Dallas.\n\n\r\n              The Nuggets will play either the New Orleans Pelicans or the Los Angeles Lakers in a first-round playoff series. The Pelicans host the Lakers in a play-in game on Tuesday night.\n\n\r\n              “I’m just happy to be done with the regular season,” Malone said. “We have the 2 seed, and we’ll tune in Tuesday night and watch the New Orleans-LA game.”\n\n\r\n              Christian Braun scored 19 points for the Nuggets and Aaron Gordon added 15.\n\n\r\n              “We just have an identity now,” said Denver forward Michael Porter Jr., who finished with 12 points, five rebounds and four assists. “It’s been a long time since we’ve stared playing together — our core guys. We’ve developed a chemistry.”\n\n\r\n              GG Jackson led Memphis with a career-high 44 points. Jake LaRavia finished with 29 points for the Grizzlies, who finished 27-55, 13th in the West. Memphis ended the season on a five-game skid.\n\n\r\n              Jackson, the 45th pick in last year's draft, began the season as a two-way player. He signed a multi-year contract in February and eclipsed the 40-point mark in his final game of the season.\n\n\r\n              “It's the most adversity I've ever had to deal with mentally,” Jackson said of the season. “My entire career with basketball, everything was given and super smooth. ... I just had to sharpen up and polish.”\n\n\r\n              Denver couldn't build a significant lead in the first half, until a 9-0 run in the latter stages led to a 66-54 halftime advantage. Denver shot 51% in the half, with Murray scoring 19 points.\n\n\r\n              An 11-2 burst for Denver to open the second half increased the lead to 21, and the Nuggets eased home, with their starters sitting out the fourth quarter.\n\n\r\n              While key Denver players like Jokic and Murray were listed as questionable before the game, the team's regular starters all played.\n\n\r\n              Memphis' season was derailed by injuries that kept many key players out for extended periods. The Grizzlies dressed only eight players against Denver, the bulk of them on two-way and 10-day contracts. Just last season, Memphis was the No. 2 seed in the West.\n\n\r\n              “Every season presents something different,” coach Taylor Jenkins said. “Obviously, this presented something no one was expecting.”\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996747.727325
}