{
  "game_id": "0022000526",
  "espn_id": "401267686",
  "date": "Feb 28, 2021",
  "matchup": "PHX @ MIN",
  "headline": "Booker scores 43 points, surging Suns beat T-wolves 118-99",
  "body": "MINNEAPOLIS -- — Devin Booker scored 21 of his season-high 43 points in the third quarter to carry Phoenix in a 118-99 victory over the Minnesota Timberwolves on Sunday night, the 14th win for the Suns in their last 17 games.\n\n\r\n                    Booker made 15 of 26 shots from the floor, repeatedly blowing by his defenders for smooth pullup jumpers and traffic-beating, twisting layups to hit the 40-point mark for the 13th time in his six-year career and help the Suns overcome a sluggish start against the NBA's worst team.\n\n\r\n                    “He’s the complete offensive player,” Suns coach Monty Williams said. “The way he scored the ball is not something I took for granted, and no one should. It's a gift, and we certainly are grateful for it.”\n\n\r\n                    The two-time All-Star Game pick — each as an injury replacement — went 12 for 13 from the free-throw line for the surging Suns (22-11). They are a half-game out of third place in the Western Conference, with the same winning percentage as the Los Angeles Clippers (24-12).\n\n\r\n                    “Once we got it going, we got it going, but obviously we want it to be sooner than later and step on our opponent,” Booker said.\n\n\r\n                    Deandre Ayton added 22 points and 10 rebounds, and Chris Paul had 11 points and 15 assists for the Suns. They smashed open the game with a 21-3 run over a 3:48 span bridging the third and fourth quarters.\n\n\r\n                     Anthony Edwards made a 3-pointer for Minnesota to cut the lead to 76-74, but Booker assisted on a 3-pointer by Cameron Johnson on the next possession and scored seven more points himself before the end of the period.\n\n\r\n                    “He can score. He can pass. He can do everything. Just the sky is the limit for him, I think,” teammate Dario Saric said about Booker. “I hope he will continue to play like this, because we will win the games.”\n\n\r\n                    Edwards scored 24 points on 8-for-22 shooting for the Timberwolves, who were doing a decent job of defending everybody but Booker until fading hard in Finch's first home game. \n\n\r\n                    “He just kind of took the ball and put his head down and went and just made a play for himself,” said Finch, who replaced Ryan Saunders a week ago.\n\n\r\n                    Minnesota has allowed 518 points in four games under Finch. Karl-Anthony Towns had 21 points and 10 rebounds for the Timberwolves (7-27), who lost their eighth straight game and finished the month of February at 2-14.\n\n\r\n                    With D'Angelo Russell sidelined after left knee surgery, the offense is running often through Edwards, the first pick in the draft who has been urged by Finch to attack the basket more. Edwards made all six of his free throws, drawing contact more often than that.\n\n\r\n                    “I’m a rook. I may not get those calls this year, but it’s coming,” Edwards said, smiling as he admiringly changed the subject to Booker. “He was getting great calls, and that’s just respect. He’s good enough to earn those calls.”\n\n\r\n                    GOING TO TOWNS\n\n\r\n                    Ayton's improving defense was on display, as the Suns — with help from Saric and Frank Kaminsky — limited Towns to two shots inside the 3-point arc in the first half. \n\n\r\n                    “D.A. did an exceptional job just trying to make it tough for him to get the ball so he couldn’t get to his sweet spots,” Williams said.\n\n\r\n                    BACK AND FORTH\n\n\r\n                    Kaminsky — who had nine points in 16 minutes — took the first turn at power forward for the Suns, continuing an alternation with Jae Crowder. The Suns are 10-1 with Kaminsky starting.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Saric, who missed the last game with a sprained right ankle, had 13 points in 16 minutes against one of his two former teams. ... Crowder was scoreless in 27 minutes.\n\n\r\n                    Timberwolves: Rubio, playing against the Suns for the first time since he was traded to Oklahoma City for Paul and acquired by Minnesota two days later, had six points, six assists and three steals. Rubio was the team's fourth-leading scorer in his only season with Phoenix. ... Jake Layman scored 11 points off the bench.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: At Los Angeles Lakers on Tuesday night.\n\n\r\n                    Timberwolves: Host Charlotte on Wednesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997750.0830421
}