{
  "game_id": "0022000813",
  "espn_id": "401307607",
  "date": "Apr 11, 2021",
  "matchup": "LAC vs. DET",
  "headline": "Morris scores season-high 33 as Clippers win 5th straight",
  "body": "LOS ANGELES -- — Marcus Morris Sr. scored a season-high 33 points, Paul George added 32 and the Los Angeles Clippers capped a nine-game homestand with a 131-124 victory over the Detroit Pistons on Sunday night.\n\n\r\n                    George has three straight 30-point games despite dealing with a nagging toe injury. He had six points during the fourth quarter as the Clippers rallied for their fifth straight win, which is currently the longest win streak in the NBA.\n\n\r\n                    Morris, who was five points shy of tying his career high, made six 3-pointers and went over 1,000 for his career.\n\n\r\n                    “It was never about offense for us, it was about defense. We got it done at the end, in the fourth quarter,\" said Clippers center Ivica Zubac, who had a career-high seven assists to go along with 13 points and 10 rebounds.\n\n\r\n                    Los Angeles was missing Kawhi Leonard, who sat out to rest as the Clippers were playing their third game in four nights. Everyone else picked up the slack though as they had seven players in double figures and concluded a homestand where they went 7-2 despite still being short-handed. \n\n\r\n                    “The team is coming together. You feel it and the last thing we want to do is not leave a stone unturned. I definitely think there will be some carryover on the road,” George said.\n\n\r\n                    Josh Jackson scored 26 points and Saddiq Bey added 25 for the Pistons, who have dropped three of their last four.\n\n\r\n                    The Clippers shot 62.5% from the field but trailed for most of the night against the Eastern Conference's worst team. Mason Plumlee's layup with 4:03 remaining in the third quarter gave the Pistons a 93-81 advantage before LA started rallying.\n\n\r\n                    “Despite their record, teams are going to get hot and play hard. For our team to stay together and continue to keep playing was important. We were able to chip away when we got a couple stops and converted,” Clippers coach Tyronn Lue said.\n\n\r\n                    The game was tied at 110 with 6:23 remaining before the Clippers seized momentum with a 10-2 run. A 3-pointer by Nicolas Batum gave them the lead for good while George had four points during the run, including a driving dunk on Isaiah Stewart to extend the advantage to five.\n\n\r\n                    “We knew they were going to make a run, eventually. When it was coming, we didn’t know,” Jackson said.\n\n\r\n                    Los Angeles extended its lead to 11 points in the final minute.\n\n\r\n                    The Clippers were 25 of 36 from the field for the first half but didn't lead for the first time until Zubac's dunk gave them a 61-60 advantage with 2:06 remaining in the second quarter.\n\n\r\n                    “It is just tough to sustain getting tough field goals when they have the firepower on 3-pointers along with getting a stop here and there. They're a great shooting team. That is what they do,\" Pistons coach Dwane Casey said. “That is why you're nervous because we didn't get consistent stops, especially in the fourth quarter.”\n\n\r\n                    TIP INS\n\n\r\n                    Pistons: Detroit is 3-9 during the second game of back-to-backs. ... They were 15 of 32 on 3-pointers as Wayne Ellington (15 points) and Bey made five apiece. ... Corey Joseph, who was acquired from Sacramento on March 25, had 18 points and is averaging 11.7 points since joining the Pistons. ... Jerami Grant, who leads the team in scoring with 22.5 points per game, was out for the third straight game due to right knee soreness.\n\n\r\n                    Clippers: LA had a season-high 35 assists ... Zubac got his 11th double-double, which is the most he has had in a season in his four-year career. ... Nicolas Batum scored nine of his 14 points in the second half. ... Luke Kennard scored 11 points and went over 2,000 for his career on a driving layup during the third quarter. ... Serge Ibaka, who missed his 15th straight game due to back issues, will not be on the upcoming road trip. That means the earliest the center could return is April 18 against Minnesota.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Host the Clippers on Wednesday.\n\n\r\n                    Clippers: Begin a three-game road trip on Tuesday at Indiana.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997670.631383
}