{
  "game_id": "0022200468",
  "espn_id": "401468623",
  "date": "Dec 21, 2022",
  "matchup": "CHI @ ATL",
  "headline": "Ayo Dosunmu beats buzzer, Bulls beat Hawks 110-108",
  "body": "ATLANTA -- — Ayo Dosunmu banked in a putback jumper as time expired and the Chicago Bulls rallied after blowing an 18-point lead to win their second straight game, 110-108 over the Atlanta Hawks on Wednesday night.\n\n\r\n              Dosunmu inbounded a pass from the Chicago sideline with four seconds remaining to DeMar DeRozan, who missed a jumper with an airball from the left baseline with De'Andre Hunter defending, but Dosunmu was in place to grab the rebound to beat John Collins to the ball in the paint and score at the buzzer.\n\n\r\n              “Once I hit DeMar and once he got into his shot, I was hoping he was going to make it but I wanted to get around the rim just in case — we’ve lost some games like that this year — so I wanted to get around rim and just try to use my instincts if it came to me,\" Dosunmu said. “If it went in good, if not I’d be there.\"\n\n\r\n              DeRozan led Chicago with 28 points, Zach LaVine added 22 points and Nikola Vucevic had 20.\n\n\r\n              Trae Young scored 34 points for Atlanta, and Dejounte Murray had 15 points and 10 assists.\n\n\r\n              Rookie AJ Griffin made a corner 3-pointer to make it 88-87 and give the Hawks their first lead with 9:31 remaining. The rookie followed with a right-wing 3 at the 7:48 mark to put Atlanta up 95-90, and the Hawks led until LaVine hit consecutive jumpers to make it 106-104 with 44.7 seconds remaining.\n\n\r\n              “We did a good job of staying in the game and making the plays and making the shots,\" LaVine said. “I think you just credit everyone for being confident in what they do, and it was a good win.\"\n\n\r\n              Consecutive alley-oop dunks by Onyeka Okongwu, who finished with 18 points and 11 rebounds, made it 108-all, but Dosunmu had the final say.\n\n\r\n              “It felt good leaving my hands, but I'm glad I air-balled it, and Ayo was in the right place at the right time,\" DeRozan said. \"He got the job done.\"\n\n\r\n              Young hit a season-high seven 3-pointers for the Hawks, who overcame a sloppy shooting in the first half by chipping away at the lead in the third and finally taking control with a 19-7 run in the fourth. \n\n\r\n              “We fought our way back into it,” Young said. “Just came up two points short. I was just in a rhythm, the first few shots went in. I’ve been working to get in a rhythm and I’ve been doing the same routine. I’ve got to be better on shooting from the field, but it was good to see my 3s go in.”\n\n\r\n              DeRozan was pleased to win in this fashion after Chicago lost 123-122 in overtime on a buzzer-beater two weeks ago in Atlanta.\n\n\r\n              “It was crazy,\" he said. “This time fate smiled our way.\"\n\n\r\n              LaVine admired his team's tenacity to overcome an eight-point deficit with five minutes to go after blowing the 18-point lead.\n\n\r\n              “It's how you respond,\" LaVine said. “I think we all talk about we had to do what we had to do and we put together some good quarters. We made some mistakes but we played for each other and came out with the last-second win and got them back at the buzzer.\"\n\n\r\n              TIP-INS\n\n\r\n              Bulls: Alex Caruso got tangled up and hit the floor late in the second. He stayed down on his back for a minute before play was halted, sat up and walked off the floor under his own power. He was later diagnosed with a concussion.\n\n\r\n              Hawks: Young, who had 16 points in the first quarter and 13 in the second, began the game as the only NBA player averaging at least 25 points and 10 assists. \n\n\r\n              UP NEXT\n\n\r\n              Bulls: At New York on Friday night. \n\n\r\n              Hawks: Host Detroit on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994498.821841
}