{
  "game_id": "0021600923",
  "espn_id": "400900318",
  "date": "Mar 04, 2017",
  "matchup": "CHA @ DEN",
  "headline": "Walker scores 27 as Hornets beat Nuggets, 112-102",
  "body": "DENVER --  With Frank Kaminsky out, the Charlotte Hornets needed someone to step up at the end of a long road trip.\n\nIt ended up being a journeyman playing on his third 10-day contract of the season.\n\nJohnny O'Bryant scored a career-high 15 points against his former team to supplement Kemba Walker's 27, and Charlotte beat the Denver Nuggets 112-102 on Saturday night.\n\nNicolas Batum had 21 points and eight assists and Marvin Williams had 14 points and 12 rebounds for the Hornets, who wrapped up a seven-game road trip with an impressive victory with the help of O'Bryant.\n\n\"Johnny O'Bryant was great,\" Charlotte coach Steve Clifford said. \"It's a little bit difficult because he hasn't been here very long, but he hit a big shot and we were fairly organized when he was on the floor. He gave us a big lift.\"\n\nO'Bryant was signed Feb. 24 after playing on two 10-day contracts with Denver in January and February. He had seven points in the fourth quarter when the Hornets held off a late rally to win for just the fourth time in the last 14 games.\n\nO'Bryant had a little inside knowledge after spending 20 days with the Nuggets, and it helped him Saturday with Kaminsky sidelined with a sprained left shoulder suffered Thursday in Phoenix.\n\n\"More than anything it gave me confidence,\" O'Bryant said of his time with Denver. \"I played well with them when I did get minutes.\"\n\nThe Nuggets came out flat after two impressive road wins in the middle of the week. Nikola Jokic led them with 31 points and 14 rebounds, while Danilo Gallinari scored 22 points.\n\n\"We didn't have pace, didn't have enough purpose, didn't have energy,\" Denver coach Michael Malone said. \"When we do that, we are a lot easier to guard.\"\n\nCharlotte took the lead for good with a 17-0 run late in the first quarter and then scored the first 10 points of the third to go up 71-52.\n\nThe Hornets led by as many as 20 in the third before Denver made a run to get it under 10 on Mason Plumlee's three-point play with 7:13 left. Marco Belinelli answered with a corner 3-pointer -- his only points of the game -- to push the lead to 100-89.\n\nDenver got within four with 4:33 left, but Charlotte scored nine straight, including a big 3-pointer by Walker, to go back up by 13 and closed it out at the line.\n\n\"At that moment, we weren't scoring, so I wanted to create some space and get to my shot, and that's what I did,\" Walker said. \"That's a shot I've made all year.\"\n\nTIP-INS\n\nHornets: Charlotte finished its longest road trip of the season with a 3-4 record. ... The Hornets held Denver to 45 percent shooting after Phoenix hit nearly 60 percent of its shots Thursday. ... Walker and Batum have combined to score at least 20 points in eight games this season.\n\nNuggets: G Gary Harris, the team's fourth-leading scorer, went without a point and missed the only shot he took. ... F Kenneth Faried missed his fourth straight game with low back soreness. He first hurt it against Brooklyn on Feb. 24 and hasn't played since. ... G Emmanuel Mudiay was back to third string after playing 18 minutes in Milwaukee on Wednesday.\n\nBIG LOSS IN THE MIDDLE\n\nKaminsky, Charlotte's 7-foot center, is expected to miss several games. Kaminsky, who averaged 17.9 points a game since Feb. 1, was hurt in the fourth quarter of Thursday's loss to the Suns.\n\nHe will get an MRI done on the shoulder once the Hornets return home.\n\n\"Right now, it's day-to-day, depending how he progresses these next two days,\" Clifford said. \"Typically, that injury would be 10 days to two weeks.\"\n\nUP NEXT\n\nHornets: Host the Indiana Pacers on Monday night.\n\nNuggets: Host the Sacramento Kings in a battle of playoff hopefuls on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995479.5477288
}