{
  "game_id": "0022300244",
  "espn_id": "401584872",
  "date": "Nov 25, 2023",
  "matchup": "LAC vs. DAL",
  "headline": "George scores 25 points while fellow LA stars are quiet in the Clippers' 107-88 win over Mavs",
  "body": "LOS ANGELES -- — Paul George had 25 points and nine rebounds, Terance Mann added 17 points and the Los Angeles Clippers beat the Dallas Mavericks 107-88 on Saturday night for their fourth victory in five games.\n\n\r\n              James Harden had just eight points and seven assists, while Kawhi Leonard missed his first nine shots before finishing with eight points for the Clippers, who didn’t need all four of their stars to shine. Russell Westbrook had 14 points, eight rebounds and seven assists, but the Clippers largely dominated with only George scoring consistently in a comfortable victory over the normally high-scoring Mavericks.\n\n\r\n              “That's the beauty of this team,” said Harden, whose only field goals were two 3-pointers. “On any given night, we've got guys that can step up and contribute, whether it's with scoring or whether it's other things. For us as a group, the only thing that matters is winning. So however that looks, there's going to be different ways, different nights. Tonight we just did a really good job of four-quarter basketball.”\n\n\r\n              Mann stepped up in his starting role with his highest-scoring game of the season, and Norman Powell added 15 points with three 3-pointers as the Clippers rebounded from a home loss to New Orleans one night earlier with another exhibition of the many ways they can win since adding Harden to a roster top-heavy with talent.\n\n\r\n              Westbrook also responded well after playing a season-low 14 minutes against New Orleans.\n\n\r\n              “Definitely a big win for us, especially after last night,” Westbrook said. “Whatever time I’m on the floor, my job is to make sure when I come in, we extend our lead or build it.”\n\n\r\n              Luka Doncic scored 30 points and Kyrie Irving had 26 for the Mavs, who had the past two days off in Los Angeles after beating the Lakers on Wednesday. Dallas had its lowest-scoring performance of the season for its second straight game, failing to crack 100 points for the first time.\n\n\r\n              “They were physical from the start, (and) we didn’t shoot the ball well,” Dallas coach Jason Kidd said. “We didn’t get out and run like we talked about on this trip. When we went small, that was really the first time we got a 3 in transition. We’ll go back and look at this and understand the physicality that the Clippers started the game with.”\n\n\r\n              George scored 15 points while Los Angeles built an 18-point lead in the first half. Doncic scored 17 points in the second quarter, keeping it close when the Clippers threatened to pull away.\n\n\r\n              Dallas missed 13 straight shots while going scoreless for more than 5 1/2 minutes in the third quarter, allowing the Clippers to pull ahead by 24.\n\n\r\n              Leonard missed his first nine shots before finally hitting a baseline jumper late in the third quarter. He finished 2 for 12, missing all five of his 3-point attempts.\n\n\r\n              Leonard hasn't missed a game yet this season after playing in only 161 of the Clippers' 308 regular-season games in his first four years in LA because of injuries and preventative rest. Although Clippers coach Tyronn Lue acknowledged Leonard might have missed one of these back-to-back games in previous seasons, he dismissed the notion that Leonard might struggle with the NBA grind.\n\n\r\n              “I don’t have any concerns,” Lue said. “If he needs some time off, he’ll let us know, and so will medical. He feels good right now.”\n\n\r\n              Mavs center Dereck Lively missed the game after bruising his lower back in a fall against the Lakers, and Ivica Zubac had 11 points and 14 rebounds down low for the Clippers.\n\n\r\n              Doncic appeared to hurt his hand in the opening minute, grimacing while getting back on defense, but he stayed in the game. He was 1 for 8 on 3-point attempts.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host Houston on Tuesday night.\n\n\r\n              Clippers: Host Denver on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996564.699147
}