{
  "game_id": "401810056",
  "espn_id": "401810056",
  "date": "Nov 10, 2025",
  "matchup": "MIA vs CLE",
  "headline": "Andrew Wiggins' alley-oop dunk at OT buzzer gives Heat a 140-138 win over the Cavaliers",
  "body": "MIAMI -- — Andrew Wiggins made an alley-oop dunk at the buzzer in overtime, and the Miami Heat beat the Cleveland Cavaliers 140-138 in a wild back-and-forth game Monday night.\n\n\r\n              Norman Powell scored 33 points, Jaime Jaquez Jr. had 22 points, 13 rebounds and seven assists off the bench for the Heat. Wiggins scored 23 for Miami, which got a 14-point, 20-rebound game from Kel’el Ware.\n\n\r\n              Donovan Mitchell had 28 points, 15 rebounds and eight assists for Cleveland, including a 3-pointer to tie the game with 0.4 seconds left in overtime — before Wiggins caught a pass from Nikola Jovic for the game-winner.\n\n\r\n              Cleveland got 23 from De’Andre Hunter and a 21-point, 10-rebound effort from Evan Mobley. \n\n\r\n              The Heat are 5-0 at home for the third time in franchise history, joining 2012-13 (when Miami won the NBA title) and 2019-20 (when Miami lost in the NBA Finals).\n\n\r\n              It was the first meeting between the teams since Game 4 of their Eastern Conference first-round series last season — when Cleveland won 138-83 to finish off a four-game sweep with a total victory margin of 122 points. It was the most lopsided postseason series, in terms of margin, in NBA history.\n\n\r\n              “It was very humbling,” Heat coach Erik Spoelstra said. “It was embarrassing.”\n\n\r\n              Not this one.\n\n\r\n              Miami was missing Bam Adebayo (toe) and Tyler Herro (heel) because of injuries, and the Cavaliers lost Darius Garland in the third quarter with a potential recurrence of the toe injury he has dealt with for months. Cavs coach Kenny Atkinson also was ejected late in the third quarter. \n\n\r\n              Cleveland took 120 shots, including 65 3-point tries — the most by any team since 2019. The Cavs made 21 3-pointers, their NBA-record 98th consecutive regular-season game with at least 10 makes from deep.\n\n\r\n              Up next\r\n              The teams meet again Wednesday in Miami.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042597.873148
}