{
  "game_id": "0021500703",
  "espn_id": "400828590",
  "date": "Jan 29, 2016",
  "matchup": "MIL vs. MIA",
  "headline": "Dwyane Wade scores 24, Heat hold off Bucks for 107-103 win",
  "body": "MILWAUKEE --  Dwyane Wade hit a 19-foot jumper with 44.5 seconds left, turned up the court and signaled to his bench as if everything would be OK.\n\nPalms facing down at the hips, Wade motioned his arms up and down after his clutch shot broke a tie and spurred the Miami Heat to a 107-103 victory over the Milwaukee Bucks on Friday night.\n\nWade finished with 24 points and seven assists, and the Heat wrapped up a five-game road trip with their third straight victory.\n\n\"We've shown some grit and some toughness to win some tough games on the road,\" coach Erik Spoelstra said.\n\nBut there was familiarity for Wade at the Bradley Center, where the All-Star guard played his college ball for Marquette. Miami's bench was at the end of the arena where a banner honoring Wade's retired No. 3 jersey hangs from the rafters.\n\nJust another memorable night in Milwaukee for Wade. His step-back jumper from inside the arc gave Miami a 103-101 lead.\n\n\"As soon as I got a little seam, I shot it off one leg, fading back. I thought it was the best shot I was going to get and it went in,\" Wade said.\n\nThe Heat could have had a smoother finish if Wade hadn't gone 2 of 4 from the foul line after his jumper.\n\nBut Wade finished off the Bucks by hitting two foul shots with 3.9 seconds left to give the Heat a four-point edge.\n\n\"He's done that quite a few times in his career. We've got to get the ball out of his hands,\" Bucks coach Jason Kidd said. \"It's a lesson learned.\"\n\nGiannis Antetokounmpo led the Bucks with 28 points.\n\nTO THE HOOP\n\nAntetokounmpo, a young, athletic forward, wound his way through a crowded lane for a dunk with 59.9 seconds left that tied the game at 101. He was 11 of 17 from the floor.\n\nThe Bucks had a 25-12 edge in transition, but Miami came up with defensive stops when the game slowed down late.\n\n\"This team puts a lot of pressure on the basket,\" Wade said. \"But we got stops when we needed them.\"\n\nGROUP EFFORT\n\nWade led a balanced scoring effort with all five Miami starters scoring in double figures. Chris Bosh added 20.\n\nPlaying through an illness, Gerald Green added 10 points off the bench.\n\nThe Heat snapped a five-game losing streak to Milwaukee.\n\nMIDDLE MEN\n\nThe Heat started strong Friday with a 33-point first quarter, a season high on the road. They held on in the end.\n\nIn between, the Bucks rallied from a 12-point deficit in the first half. They finally broke through for a lead on the first of two 3s late in the third quarter by rookie Rashad Vaughn.\n\nHe finished with eight points. It was a confidence-boosting outing for the guard, a first-round draft pick, who has been working on being less tentative with the ball.\n\n\"It's just something I'm working on, not being hesitant. When I'm open, shoot it,\" Vaughn said.\n\nThe Bucks played to their strengths with Greg Monroe scoring 24 points and Jabari Parker adding 17 to join Antetokounmpo in double figures.\n\nBut their best jump-shooter Khris Middleton, was 2 of 13 for nine points, and guard Jerry Bayless was scoreless in 23 minutes.\n\nGetting someone like Vaughn going from the outside would lengthen the floor for Milwaukee.\n\nTIP-INS\n\nHeat: G Goran Dragic played 32 minutes in his first action since Jan. 11 because of a left calf injury and finished with 12 points and eight assists. ... The Heat went 3-2 on their five-game road trip.\n\nBucks: C John Henson missed a second straight game with a sore lower back, while G O.J. Mayo remained sidelined with a left hamstring injury. ... Antetokounmpo was 5 of 5 for 13 points in the third quarter.\n\nUP NEXT:\n\nHeat: Host Hawks on Sunday.\n\nBucks:  At Kings on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994045.2261498
}