{
  "game_id": "401810118",
  "espn_id": "401810118",
  "date": "Nov 19, 2025",
  "matchup": "POR vs CHI",
  "headline": "Vucevic's buzzer-beating 3 gives the Bulls a 122-121 win over the Blazers",
  "body": "PORTLAND, Ore. -- — Nikola Vucevic hit a 3-pointer at the buzzer and Chicago Bulls held off a furious comeback attempt by the Portland Trail Blazers for a 122-121 victory on Wednesday night. \n\n\r\n              Vucevic finished with 27 points and Coby White had 25 off the bench for the Bulls, who led by 21 points in the fourth quarter. \n\n\r\n              Deni Avdija's 3-pointer tied it for the Blazers at 116 and Donovan Clingan's layup put the Blazers in front with 47 seconds left. Clingan added a free throw to cap a 31-7 run and give Portland a 119-116 lead. \n\n\r\n              White's 3-pointer with 9.1 seconds pulled the Bulls within 120-119. After Jerami Grant hit the second of two free throws, White popped the ball out to Vucevic on the perimeter for the game-winner. \n\n\r\n              Grant finished with 33 points for the slumping Blazers, who have lost four straight and six of the last seven. \n\n\r\n              The Bulls were coming off a 130-127 victory over the Nuggets that ended a five-game losing streak. White sat out that game after returning the night before against Utah from a calf injury that had kept him out the first 11 games of the season. \n\n\r\n              The Blazers were playing the second of a back-to-back after falling 127-110 to the visiting Phoenix Suns on Tuesday night. \n\n\r\n              Jrue Holiday missed a third straight game with a calf injury and the Blazers were also without Shaedon Sharpe because of right calf soreness. Grant, who missed Tuesday’s game with an illness, started. \n\n\r\n              The Blazers led for most of the first quarter before the Bulls pulled in front 33-31 early in the second on White's 26-foot running jumper. Chicago led 62-58 at the break. \n\n\r\n              Up next\r\n              Bulls: Host the Miami Heat on Friday. \n\n\r\n              Trail Blazers: Visit the Warriors on Friday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042659.8383832
}