{
  "game_id": "0021500248",
  "espn_id": "400828135",
  "date": "Nov 29, 2015",
  "matchup": "DET @ BKN",
  "headline": "Young helps Nets beat Pistons 87-83",
  "body": "NEW YORK -- On a night his shot wasn't falling, Brook Lopez did all the little things the Brooklyn Nets needed to win.\nLopez made the tiebreaking free throw with 29 seconds after grabbing an offensive rebound, and the Nets beat the Detroit Pistons 87-83 on Sunday night.\nLopez scored 15 points but shot just 6 of 18 from the field. He added a season-high six blocked shots and five assists, and tied a career high with four steals.\n\n\"We definitely had to grind it out,\" Lopez said. \"We stuck with it, though, and our bench definitely gave us good minutes. Our guys stuck it out, we kept fighting and things weren't going our way the majority of the game, but we kept with it.\"\nThaddeus Young led the Nets with 19 points and 10 rebounds. Wayne Ellington had a season-high 12 points for Brooklyn, which improved to 4-13.\n\"It's really interesting how the league is,\" Nets coach Lionel Hollins said. \"Last night (at Cleveland) we played great and we lost. Tonight we were very inconsistent and we had maybe an eight- or nine-minute stretch of playing well, and we come away with a win.\"\nAndre Drummond recorded his league-leading 15th double-double with 20 points and 18 rebounds, but Detroit fell to 8-9. Kentavious Caldwell-Pope had 21 points and seven rebounds.\nDetroit shot just 34 percent from the field.\n\"I think what it really came down to is we were mentally very weak tonight,\" Pistons coach Stan Van Gundy said. \"We got very frustrated, you know, missing shots, thinking we're getting fouled. It affected our defense. I thought we took several bad shots in the fourth quarter just trying to draw fouls instead of trying to get good shots. I just didn't think we played very smart, poised basketball and that was disappointing.\"\nThe Nets scored the final six points after trailing by two with 1:21 left. After Lopez's free throw made it 84-83, Jarrett Jack added two free throws for a three-point lead. Reggie Jackson missed a 3-pointer and Young closed it out with one more free throw.\nThe teams shot a combined 35 percent for the first half before the action picked up in the fourth quarter.\nTIP-INS:\nPistons: After 1 1/2 years on the job, Van Gundy believes he has the core in place to turn around the culture in Detroit. \"I like the guys we have. I like the character of our team. I like the fit of our team. We've just got to keep working to improve on both ends and gain experience, both together and individually.\" . This was the first game Detroit had after an off day with an opponent coming off back-to-back games. ... Brandon Jennings and Jodie Meeks were inactive.\nNets: Hollins, on the progression he's seen from rookie Rondae Hollis-Jefferson. \"Enough progress to put him in the starting lineup. He's very active with his hands, gets his hands on a lot of balls and he comes back and rebounds. You love to have a 2 or 3 that rebounds the way he does. He's had double-figure rebounds in three or four games this year. He's working on his jump shot to the point where he's making the mid-range wide-open jumper. I told him from the beginning that's a start; everything else builds out of that.\". Andrea Bargnani left the game in the first quarter with a tight left hamstring. . Joe Johnson has now made a field goal in 901 consecutive games, extending the longest active streak in the NBA. ... Chris McCullough and Willie Reed were inactive.\nUP NEXT:\nPistons: Host Houston on Monday.\nNets: Host Phoenix on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994947.7843761
}