{
  "game_id": "0022400547",
  "espn_id": "401705113",
  "date": "Jan 12, 2025",
  "matchup": "CHA @ PHX",
  "headline": "Booker scores 30 points, Durant has 27 as Suns rally to beat the Hornets 120-113",
  "body": "PHOENIX -- — Devin Booker scored 30 points, Kevin Durant added 27 and the Phoenix Suns rallied in the final minutes to beat the Charlotte Hornets 120-113 on Sunday night.\n\n\r\n              The Suns have won three straight and four of five. Charlotte has lost 10 of 11.\n\n\r\n              The Hornets — who were trying to beat the Suns for the second time in a week — pushed to a 98-93 lead after the third quarter and led for much of the fourth. Durant hit a stepback jumper to give the Suns a 111-110 advantage with just over three minutes left.\n\n\r\n              Durant found rookie Oso Ighodaro for a dunk to take a 115-113 lead. Royce O'Neale hit a 3-pointer for an 118-113 advantage with 41.5 seconds left. \n\n\r\n              Charlotte hadn’t played since Tuesday night when it beat the Suns 115-104 at home. The Hornets were supposed to play the Lakers on Thursday and the Clippers on Saturday, but those games were postponed because of the wildfires in the Los Angeles area.\n\n\r\n              LaMelo Ball led the Hornets with 25 points. Mark Williams added a season-high 24 points and 16 rebounds, including 22 points and 13 rebounds in the first half.\n\n\r\n              Takeaways\r\n              Hornets: It's a tough loss for Charlotte, which controlled much of the game. The Hornets had some questionable shot selection down the stretch.\n\n\r\n              Suns: Phoenix struggled for much of the game, but played well in the final minutes to pull out a win. Grayson Allen scored 13 points in the first half, but didn't play in the second because of left knee soreness.\n\n\r\n              Key moment\r\n              Durant's confidence to give the ball to Ighodaro for a dunk during a crucial possession is a good growth moment for the team.\n\n\r\n              Key stat\r\n              Ighodaro scored eight points in the fourth quarter, giving the Suns a much-needed presence in the paint.\n\n\r\n              Up next\r\n              The Hornets are at Utah on Wednesday night. The Suns are at Atlanta on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997448.326665
}