{
  "game_id": "0022200910",
  "espn_id": "401469065",
  "date": "Feb 26, 2023",
  "matchup": "MIL vs. PHX",
  "headline": "Bucks outlast Suns 104-101 for 14th consecutive victory",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo's absence couldn't prevent the Milwaukee Bucks from extending the longest winning streak in the NBA this season.\n\n\r\n              Jrue Holiday scored 33 points and produced a critical steal, Brook Lopez made a tiebreaking layup with 24.8 seconds left and the Bucks edged the Phoenix Suns 104-101 on Sunday for their 14th consecutive victory.\n\n\r\n              The rematch of the 2021 NBA Finals didn't include either Antetokounmpo or new Suns superstar Kevin Durant, but it still featured 14 lead changes and plenty of late drama.\n\n\r\n              “Both teams obviously have history,” Lopez said. “Those are the fun games, where the refs let it get physical a little bit, you can really go after each other. It was a great atmosphere.”\n\n\r\n              Durant has yet to appear in a game for the Suns and hasn’t played since Jan. 8 because of a sprained right medial collateral ligament. Antetokounmpo was out with a bruised right quadriceps after leaving in the first quarter of the Bucks’ 128-99 victory over the Miami Heat on Friday.\n\n\r\n              “It’s enough where he can’t play today, but I think we’re also confident that this is just a fairly common occurrence in our league,” Bucks coach Mike Budenholzer said before the game. “You hit knees, you knock, sometimes it takes a day or two, and it’s really nothing more than that.\"\n\n\r\n              Holiday led all scorers, while Lopez had 22 points and 12 rebounds. Khris Middleton added 11 points and 10 rebounds.\n\n\r\n              Devin Booker scored 24 points, Deandre Ayton had 22 and Chris Paul added 18 for Phoenix. Ayton also had 11 rebounds.\n\n\r\n              After Booker made a game-tying jumper with 33 seconds left, the Bucks called a timeout and got the ball to Middleton, who found Lopez for the go-ahead layup.\n\n\r\n              Holiday said he initially expected Middleton to shoot the ball.\n\n\r\n              “It's a great play,” Holiday said. “At first, I kind of saw it, but I thought that Khris was going to shoot it because that's just what ‘K’ does. But he's a playmaker. He's not just a scorer.”\n\n\r\n              Phoenix called a timeout and went back to Booker, who lost possession as Holiday forced the steal and Lopez got the loose ball.\n\n\r\n              “That’s just the defender he is, the player he is,” Lopez said of Holiday. “He’s one of the top two-way players in the league, at least the top three. Just absolutely phenomenal. Just the best two-way player in the league. Those are the plays he makes just time and time again.”\n\n\r\n              Booker said there was contact on the play, but no foul was called, a reflection of the game's physical nature.\n\n\r\n              “I was touched,\" Booker said. \"But I did the same thing to Jrue on the other end. On that play, he hit my arm. But it’s playoff-type basketball and refs are going to let things go. And that was that.”\n\n\r\n              Joe Ingles made the first of two free throws to extend Milwaukee’s lead to 103-100 with 11.3 seconds left. Ingles missed the second free throw and the ball initially was ruled out of bounds on Milwaukee.\n\n\r\n              But after Budenholzer challenged the call, replays determined the ball actually went out on Phoenix's Terrence Ross. Holiday sank the first of two free throws with 10 seconds left but also missed the second, making the score 104-100.\n\n\r\n              Booker was fouled on a 3 by Ingles with 0.9 seconds left but missed the first free throw. Booker made the second and intentionally missed the third, but Lopez got the rebound to seal the victory.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Booker increased his career point total to 12,143 to overtake Shawn Marion (12,134) for fourth place on the Suns' all-time list. The Suns' career scoring leader is Walter Davis, with 15,666 points from 1977-88. ... The Suns lost for just the fifth time in their last 17 games.\n\n\r\n              Bucks: Wesley Matthews missed a second straight game due to a right calf strain. He also won't be available Tuesday at Brooklyn. ... Pat Connaughton returned after missing the Heat game with a sore left calf, but he went scoreless in 13 minutes. ... Ex-Suns forward Jae Crowder had seven points. He made two 3-pointers during Milwaukee's fourth-quarter comeback. ... The Bucks’ franchise record for consecutive wins is 20 straight during their 1970-71 championship season.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Charlotte on Wednesday.\n\n\r\n              Bucks: at Brooklyn on Tuesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995026.31558
}