{
  "game_id": "0021700103",
  "espn_id": "400974854",
  "date": "Oct 31, 2017",
  "matchup": "MIL vs. OKC",
  "headline": "Paul George, Thunder cruise to 110-91 win over Bucks",
  "body": "MILWAUKEE --  Russell Westbrook and the Oklahoma City Thunder were met with little resistance as they kept attacking the lane.\n\nWhen the reigning NBA MVP didn't take it to the hoop himself, he found Steven Adams in the paint for an easy bucket. Other times, Paul George got his hands on the ball for a 3.\n\nToo many options for the Oklahoma City, and not nearly enough defense for the Milwaukee Bucks in the Thunder's 110-91 win on Tuesday night.\n\n\"Russ, Russ pushes the tempo,\" George said. \"Nobody can push him from the paint, and we're getting wide open looks.\"\n\nGeorge scored 20 points, hitting 4 of 8 from 3-point range. Westbrook had 12 points, 10 rebounds and nine assists, while Carmelo Anthony scored eight of his 17 points in the pivotal first quarter.\n\nOklahoma City went from down four to a 20-8 lead on George's jumper with 4:16 left in the first. It was essentially over from there, especially with the way Westbrook kept finding driving lanes.\n\n\"We really moved the ball well and we generated high-quality shots,\" coach Billy Donovan said. \"We got a little bit lax and had a couple of possessions we needed to clean up but I thought for the most part the guys did a good job of attacking their defense.\"\n\nAdams finished with 14 points and 11 rebounds. Jerami Grant added 17 points off the bench for the Thunder.\n\nMilwaukee's Giannis Antetokounmpo had 28 points on 9-of-14 shooting. But the NBA's scoring leader spent much of the first quarter on the bench with two fouls, and the Bucks struggled from the 3-point line, opening 1 of 14.\n\nNo other Buck scored in double figures.\n\nThe star-laden Thunder taught a lesson to the up-and-coming Bucks, who hope to contend in the Eastern Conference.\n\n\"When we play the grown-ups, we've got to be ready, and we weren't,\" Bucks coach Jason Kidd said. \"They played the grown-ups tonight.\"\n\nBOGGED DOWN\n\nOklahoma City prides itself on defense, with the Thunder came into the game averaging a league-high 11.5 steals. They were second in the league in forcing 19.7 turnovers a night.\n\nThe Bucks coughed up the ball just 14 times but still came up well short. Khris Middleton (nine points, seven rebounds) struggled from the field, going 3 of 13 overall and missing all five 3-point attempts.\n\nKidd said it will be up to Antetokounmpo's teammates to not try to force the ball to the star forward.\n\n\"Every night (the defense does) not want me to get into the paint,\" Antetokounmpo said. \"I think I need to do a better job of getting into the paint and making plays for my teammates and for myself.\"\n\nSTAT LINES\n\nGrant finished 5 of 9 from the floor and scored 17 points for the first time since April 1, 2016. ... Milwaukee's Tony Snell had a team-high five assists, the first time that he had at least five since March 28, 2015.\n\nTIP-INS\n\nThunder: George, Anthony, Adams and Westbrook combined for 48 first-half points. The quartet alone outscored the Bucks in the half, who trailed 60-42 at halftime. ... Among the star trio of Anthony, George and Westbrook, Anthony was the last to leave the floor for the night, playing until there were 6 minutes left in the game with the Thunder leading by 23.\n\nBucks: The team had trouble getting anything going offensively with Antetokounmpo in foul trouble. Snell and Thon Maker hit back-to-back 3s late in the first half to end the 1-of-14 stretch. Milwaukee finished 9 of 30 for the night from behind the arc. ... C Greg Monroe's inside presence was missed. The veteran is out for at least another 12 days with a strained left calf. The 6-foot-11 Monroe helps open up the floor with his ability to score in the lane.\n\nUP NEXT\n\nThunder: Host the Boston Celtics on Friday.\n\nBucks: Visit the Charlotte Hornets on Wednesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993057.0235388
}