{
  "game_id": "0021901295",
  "espn_id": "401224770",
  "date": "Aug 10, 2020",
  "matchup": "MIA vs. IND",
  "headline": "Heat stifle Warren, close in on No. 4 seed with 114-92 win",
  "body": "LAKE BUENA VISTA, Fla. --  Jimmy Butler returned to the Miami lineup and everything started clicking again for the Heat.\n\nButler returned from a foot injury and scored 19 points, Derrick Jones scored 18 off the Miami bench and the Heat kept T.J. Warren largely in check on the way to a 114-92 win over the Indiana Pacers on Monday night.\n\nButler also had 11 rebounds, five assists and four steals.\n\n\"He was dictating the game,\" Heat coach Erik Spoelstra said. \"The ball was going through him. That's the definition of a go-to player.\"\n\nTyler Herro scored 17 while Duncan Robinson and Jae Crowder each added 14 for Miami, which snapped a two-game slide. The Heat took control for good in the third quarter, blowing open what was a tie game with a 35-17 run.\n\nGoran Dragic scored 11 and Bam Adebayo added 10 for Miami.\n\nWarren scored 12 for Indiana on 5 for 14 shooting in 29 minutes. He came into Monday averaging a bubble-leading 34.8 points per game on 61% shooting from the field, 56% from 3-point range, but never got rolling against Butler and the Heat.\n\n\"They came out as the aggressor and they made shots,\" Warren said of the Heat, after Miami improved to 3-0 against Indiana this season. \"They're a well-coached team. They play hard.\"\n\nVictor Oladipo scored 14 and Malcolm Brogdon added 12 for Indiana.\n\nMiami moved a game ahead of Indiana in the race for the No. 4 seed in the Eastern Conference. The Heat (44-27) and Pacers (43-28) both have two games left, and sixth-place Philadelphia (42-28) ends its regular season with three games in four days starting Tuesday.\n\nThe Heat own the tiebreakers over both Indiana and Philadelphia, so one more Miami victory would lock up a spot in the No. 4 vs. No. 5 series that will start early next week.\n\nThe teams play again Friday in the seeding-game finale for both teams and could meet in the opening round of the playoffs that start next week -- raising the possibility that Miami and Indiana could face off as many as nine times in a 10-game span.\n\nIt was the first meeting between the clubs since Jan. 8, a game in Indiana where Butler and Warren's individual matchup stole the show.\n\nWhat happened that night, in seven seconds of court time, has been talked about for seven months since. Warren grabbed Butler's arm on a drive midway through the third quarter, and the reaction by each player resulted in double-technicals. Butler fouled Warren on the next possession, Warren taunted him with some clapping after the call and got ejected.\n\nButler blew kisses his way, Warren offered an obscene gesture in reply and both players got fined.\n\n\"It's not about Jimmy and T.J.,\" Pacers coach Nate McMillan said. \"It's about Miami and Indiana.\"\n\nButler might have taken it personally anyway. He guarded Warren on 25 possessions Monday; Warren scored only two points on 1 for 3 shooting during those trips.\n\nTIP-INS\n\nPacers: McMillan remained tied Rick Carlisle for third on the Pacers' all-time win list. Carlisle was 181-147 with the Pacers; McMillan is now 181-136. ... Indiana was outrebounded 59-45.\n\nHeat: Adebayo played in his 157th consecutive regular season game, which trails only Norris Cole (160), Grant Long (161) and Glen Rice (174) on Miami's all-time list. ... Dragic started for just the second time this season, doing so because Kendrick Nunn is isolating after briefly leaving the bubble last week.\n\nGOOD EFFORT\n\nAdebayo and Oladipo both ended up on the floor going for a loose ball in the first quarter. As play went the other way, Oladipo scrambled to his feet before Adebayo did -- then extended a hand to try and help up Miami's center. Small problem: Adebayo has 45 pounds on Oladipo. Hence, the effort didn't work; both laughed about it.\n\nSOME DEFENSE\n\nTied at 48-48 at the break, it was only the third game in the NBA's bubble where neither team reached the 50-point mark in the opening two quarters. The other games on that list: Toronto leading Miami 48-44 on Aug. 3, and the Los Angeles Lakers leading the Raptors 44-41 on Aug. 1.\n\nUP NEXT\n\nPacers: Play Houston on Wednesday.\n\nHeat: Play Oklahoma City on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995478.199711
}