{
  "game_id": "0022001061",
  "espn_id": "401307875",
  "date": "May 15, 2021",
  "matchup": "IND vs. LAL",
  "headline": "James returns as he and Davis send Lakers by Pacers 122-115",
  "body": "INDIANAPOLIS -- — Los Angles Lakers coach Frank Vogel liked what he saw of LeBron James' return\n\n\r\n                    “It is going to take time to get his timing back to 100%, but for most of the game he looked good,” Vogel said. “He looked like his old self again.”\n\n\r\n                    James, back after a six-game absence, scored 24 points, including seven key points late, to lead the Lakers to a 122-115 victory over the Indiana Pacers Saturday. Anthony Davis led the Lakers with 28 points.\n\n\r\n                    The Lakers can notch the No. 6 seed if they win at New Orleans on Sunday and Portland loses to Denver that day. If the Lakers finish No. 7, they will be in the play-in tournament against the No. 8 seed.\n\n\r\n                    Davis, who missed the previous game because of a tight left thigh, sank 9 of 18 shots and grabbed 10 rebounds. James played 28 minutes, hitting 11 of 22 shots. James had eight assists and seven rebounds.\n\n\r\n                    James was out for the last six games while recovering from high ankle sprain. He missed six weeks and then returned to play two games. \n\n\r\n                    “It felt a lot better than the last time I came back,” James said. “I felt good coming into the game. I think each game I'll get better and better. It will take a few games to get it all back. It's up to coach and training staff if I play (Sunday).”\n\n\r\n                    Davis had missed Wednesday’s game with Houston. \n\n\r\n                    “I felt great the entire time,” Davis said. “It's nice to get the whole team back out there.”\n\n\r\n                    Andre Drummond had 15 rebounds for the Lakers, who held a 45-37 rebounding edge.\n\n\r\n                    The Lakers led 111-97 before the Pacers scored 11 straight points to trim the lead to 111-108 with 3:07 left. James then took over by scoring the next seven points, starting with a 3-pointer to put the Lakers up 118-110.\n\n\r\n                    “We had seven straight stops with the group, Goga (Bitadze) had a couple of blocks,” Pacers coach Nate Bjorkgren said of closing the game. “Then they made some tough shots. We had some good looks but they didn't go down.”\n\n\r\n                    Caris LeVert, who was questionable entering the game with knee injury, was high for the Pacers with 28. JaKarr Sampson came off the bench to score 20.\n\n\r\n                    “JaKarr played one heck of game,” Bjorkgren said. “He was really aggressive and really physical. He was playing as hard as he can.”\n\n\r\n                    The Pacers could finish with the No. 9 or 10 seed. The Pacers are tied with Charlotte and Washington at 33-38, but would lose the tiebreaker against both teams if tied. Washington and Charlotte play Sunday while the Pacers are playing Toronto in Tampa in the regular-season finale.\n\n\r\n                    The Lakers led 64-56 at halftime and 96-88 after three quarters.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Captured the two-game season series with the Pacers, previously winning 105-100 March 12. … Dennis Schroder returned after missing seven games because of the NBA’s safety and health protocol. Schroder finished with 14 points Schroder said he is definitely plans to play Sunday. … Alex Caruso, who had been sidelined with sore left foot, was available but the coach chose to rest him.\n\n\r\n                    Pacers: With Domantas Sabonis sidelined, Goga Bitadze made just his third start of the season. Bitadze had a team-high seven rebounds. … In his third game back after missing six games with a concussion, JaKarr Sampson scored a Pacers career-high 20 points. His previous high with the Pacers was 16.\n\n\r\n                    PACERS’ INJURIES MOUNT\n\n\r\n                    The short-handed Pacers took another blow when forced to play without Domantas Sabonis, who injured his left quad against Milwaukee on Thursday night and wasn’t able to go.\n\n\r\n                    Edmond Sumner (knee) and Aaron Holiday (toe) missed their third consecutive game.\n\n\r\n                    Indiana has been without Myles Turner (toe) since April 18 and Malcolm Brogdon (hamstring) since April 29.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Play at New Orleans on Sunday.\n\n\r\n                    Pacers: Play Toronto at Tampa, Florida, on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997112.498057
}