{
  "game_id": "0022301185",
  "espn_id": "401585813",
  "date": "Apr 12, 2024",
  "matchup": "PHX @ SAC",
  "headline": "Kevin Durant scores 28 points, Jusuf Nurkic makes late free throw as Suns beat Kings 108-107",
  "body": "SACRAMENTO, Calif. -- — Kevin Durant scored 28 points, Jusuf Nurkic made a late free throw and the Phoenix Suns rallied to beat the Sacramento Kings 108-107 on Friday night. \n\n\r\n              With the game tied at 107 after Phoenix overcame a 16-point deficit, Domantas Sabonis fouled Nurkic fighting for the rebound off a missed shot by the Suns' Grayson Allen. Nurkic, who finished with 10 points and 10 rebounds, missed the first, but made the second to give the Suns the lead with 8.1 seconds to play.\n\n\r\n              Bradley Beal then stripped De’Aaron Fox as Fox attempted to pull up for a potential winning shot on the other end. Fox claimed that Beal fouled him on the play, and Kings coach Mike Brown said it looked as if Beal swiped Fox on the arm.\n\n\r\n              “He wasn't even close to the ball,” Fox said.\n\n\r\n              Brown lamented his team not getting the benefit of the whistle, also complaining about the box-out foul on Sabonis in a close affair, “when the game is as physical as it is.”\n\n\r\n              “From my seat, I'm baffled,\" Brown said. “I'm not sure why we can't get a call from an NBA official down the stretch.”\n\n\r\n              Suns coach Frank Vogel called the win “gusty,” praising his team for holding the Kings to 107 points and playing through 18 turnovers. He called Beal the “star of the game defensively.” \n\n\r\n              “Throughout his career, he hasn’t had a lot of opportunities to go on a deep playoff run,” Vogel said. “So his care factor is as high as anybody in the organization, and you see it with the passion that he’s playing with.”\n\n\r\n              Devin Booker added 21 points for Phoenix, and Beal had 20. Sabonis had 25 points, 12 rebounds and nine assists for the Kings.\n\n\r\n              The teams are both headed to the postseason, but the game had major implications for seeding with the Suns seventh and Kings eighth in the West.\n\n\r\n              The Suns have won nine of their last 13 games, entering the day a game back of sixth-place New Orleans for the final automatic playoff spot. With one game left in the season, Phoenix owns the tiebreaker if the teams finish with the same record.\n\n\r\n              The Kings have dropped five of six, and can finish no higher than eighth. With the Los Angeles Lakers winning Friday, Sacramento is in danger of falling to the ninth or 10th seed, which would force the Kings to win two play-in games to advance to the full postseason. \n\n\r\n              “I hope I'm wrong, because to get another two-minute report that says they made a crucial mistake in a game of this magnitude when we're fighting for our playoff lives is just unfair,” Brown said.\n\n\r\n              Durant said that during the playoffs, the technical part of the game matters less than the desire to win. The Suns won Friday's game by hustling for a rebound and with a key defensive play.\n\n\r\n              “Every team knows all your sets,” Durant said. “They know who you are, in and out as a player. So it comes down to who wants it more and who’s got the most will out there. We can’t rely on sets that coach draws up all the time.”\n\n\r\n              The Suns' star-power always gives them a chance, according to Nurkic. \n\n\r\n              “The confidence part is more like, we got to do it,” Nurkic said.\n\n\r\n              The Kings led 54-45 at halftime. Keegan Murray scored 12 points in the second quarter, as Sacramento went on a 9-0 spurt.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Minnesota on Sunday to finish the regular season.\n\n\r\n              Kings: Host Portland on Sunday to finish the regular season.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996634.485867
}