{
  "game_id": "0021900493",
  "espn_id": "401161135",
  "date": "Dec 30, 2019",
  "matchup": "MIL @ CHI",
  "headline": "Antetokounmpo scores 23 in return, Bucks beat Bulls 123-102",
  "body": "CHICAGO --  With an NBA-best 30-5 record, the Milwaukee Bucks are off to a great start.\n\nGiannis Antetokounmpo, though, is more concerned with the team's finish this season.\n\nThe reigning MVP had 23 points and 10 rebounds after missing two games with a sore back, and Milwaukee pulled away in the second half for a 123-102 victory over the Chicago Bulls on Monday night.\n\nAntetokounmpo, the league's second-leading scorer with an average of 30.5 points per game entering this one, played only 27 minutes and sat out the final 5 1/2 because of the lopsided score. He was 8 for 14 from the field with six assists.\n\n\"We won 30 games before January; It's cool, but we can always do better,\" Antetokounmpo said. \"We've got to keep improving because the goal is to play late in the season.\"\n\nKhris Middleton scored 25 points for the Bucks, and Eric Bledsoe had 15 points in 16 minutes after missing the previous eight games with a fractured right leg.\n\n\"We move way faster with him,\" Antetokounmpo said of Bledsoe. \"He's like a sports car. He goes so fast, and we've got to follow him. It's always good to have him back.\"\n\nZach LaVine scored 19 points for Chicago but shot just 7 for 23 from the field. Lauri Markkanen and Coby White had 18 points apiece and Wendell Carter Jr. added 10 points and 11 rebounds for the Bulls.\n\n\"In the first half, I think we were there, but I think in the second half, we weren't playing our best basketball,\" Markkanen said. \"We've shown we can play with anybody, but obviously we've got to do it for 48 minutes to actually win the game.\n\n\"We can't have those lapses we did in the third. We're capable of getting those wins.\"\n\nMilwaukee jumped out to an 8-0 lead as Chicago missed its first six shots. The Bucks led 31-20 at the end of the first quarter and stretched it to 33-20 early in the second on a basket by Robin Lopez.\n\nBut the Bulls -- after shooting 9 of 29 in the first -- suddenly got hot from behind the 3-point arc. White and Markkanen each had three 3-pointers in the second to trim the Milwaukee advantage. Chicago was 8 for 14 on 3s in the quarter.\n\nWith just under two minutes left in the first half, White hit a driving scoop off the glass to give the Bulls a 52-51 lead, their first of the game.\n\nAntetokounmpo quickly answered with a putback on the other end to put the Bucks back on top. Milwaukee led 55-52 at halftime thanks in part to a 15-0 advantage in free throw attempts (making 12).\n\nAny chance of a Chicago upset was quickly dashed in the third. The Bucks opened with a 17-4 run for a 72-56 lead -- with Antetokounmpo capping the spurt with a thunderous dunk that drew a loud roar from the United Center crowd.\n\n\"There's momentum plays, there's things that just give your team energy and may be deflating for your opponent,\" Bucks coach Mike Budenholzer said. \"It was great. For him to miss a couple of games and come back and have a dunk like that was impressive.\"\n\nMilwaukee led 95-77 after three quarters. Kyle Korver hit a 3-pointer 2 1/2 minutes into the fourth for a 105-81 advantage, the Bucks' biggest of the game.\n\nTIP-INS\n\nBucks: G Wesley Matthews sat out with a bruised right thigh. \"He's been playing through it and I think it's at a stage where him not playing is the right move,\" Budenholzer said. \"Hopefully, it's just a short-term thing.\"\n\nBulls: F Chandler Hutchison missed his 15th straight game with a right shoulder injury. Hutchison has been cleared for contact and is expected to practice with the team on Tuesday. \"He'll have full contact,\" coach Jim Boylen said. \"I'll get a chance to watch him play a little bit. We'll just keep working at it.\"\n\nDUNK OF THE NIGHT\n\nAntetokounmpo's dunk in the third might have been the knockout punch, but it wasn't voted dunk of the game in the Bucks locker room. Reserve guard Pat Connaughton took the honors with a flying putback late in the third.\n\n\"It was for sure Pat,\" Bledsoe said. \"Giannis, I mean it's unreal, but we see it. Pat, man, he just comes from out of nowhere and brings the house down.\"\n\nUP NEXT\n\nBucks: Host the Minnesota Timberwolves on Wednesday night.\n\nBulls: Host the Utah Jazz on Thursday night.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996154.352267
}