{
  "game_id": "0021400368",
  "espn_id": "400578660",
  "date": "Dec 16, 2014",
  "matchup": "OKC @ SAC",
  "headline": "Russell Westbrook, OKC extend win streak to 7, keep Kings in rut",
  "body": "SACRAMENTO, Calif. -- The Oklahoma City Thunder know as well as anybody this season how difficult it is to overcome adversity, so forgive them if they have no sympathy for the Sacramento Kings right now.\nBeen there, done that -- and perhaps better for it.\nRussell Westbrook had 32 points and seven assists, Kevin Durant scored 26, and the Thunder beat the reeling Kings 104-92 on Tuesday night for their seventh straight win.\nIt was the first game for the Kings since Michael Malone was fired as coach and lead assistant Tyrone Corbin was promoted to interim coach. They dropped to 2-8 while franchise centerpiece DeMarcus Cousins recovers from viral meningitis.\n\"This is an I-don't-feel-sorry-for-you league,\" Thunder coach Scott Brooks said. \"When we had guys hurt, I didn't get a lot of text messages, 'Hey, hang in there,' from the other 29 coaches in the league.\"\nThe Thunder went ahead by 16 in the first quarter, led by just seven at halftime and pulled away again in the closing minutes behind their leading duo. Oklahoma City improved to 7-1 since Durant returned from a broken right foot.\n\"Defensively, I think we've been locking in,\" said Durant, who played a season-high 35 minutes. \"We have little spurts where we're bad, but overall I think we did a good job in playing defense.\"\nRudy Gay scored 22 points and reserve Carl Landry added 14 for the Kings. Sacramento had 19 turnovers that led to 26 points for the Thunder.\nThe Kings twice went ahead in the fourth quarter on jumpers by Landry. Then Oklahoma City clamped down on defense, and Westbrook and Durant took turns making shots to help the Thunder take a 98-88 lead with 2:47 remaining.\nOklahoma City outshot Sacramento 47.1 percent to 42.9 percent.\n\"These guys showed a lot of fight when they've faced a lot stuff in the last couple of days,\" Corbin said. \"They came out against a great team and had a chance to win the ballgame.\"\nThe Thunder (12-13) started the season 3-12 while dealing with injuries to Durant and Westbrook but are rediscovering their championship-contender form with both healthy again.\nThe Kings (11-14) have struggled since losing their top player and are now dealing with a surprising coaching change. Sacramento fired Malone late Sunday night just 24 games into his second season, citing philosophical differences.\nKings owner Vivek Ranadive and general manager Pete D'Alessandro -- who was hired two weeks after Malone -- want a more up-tempo, offense-oriented system, while Malone preached defense and rebounding.\nRanadive sat in his usual courtside seat. Corbin limped on the sideline with a walking boot on his left leg, which he injured a couple of weeks ago while working out.\nSome fans in the white towel-waving sellout crowd of 17,317 began booing after the Thunder's opening burst, and the game looked ready to become a rout.\nOklahoma City went up 34-18 in the first quarter, but Sacramento sliced the Thunder's lead to three in the second. The Kings also had the highlight of the half when Gay dunked over Serge Ibaka, who finished with a season-high seven blocks, including a couple during Oklahoma City's final surge.\n\"This is not a time to put our heads down and feel sorry for ourselves,\" Kings point guard Darren Collison said. \"Teams are coming in here and they don't care what our situation is.\"\nTIP-INS\nThunder: Durant, who is 26 years old, became the second-youngest player to surpass 15,000 points. Only LeBron James (25) was younger. ... The Thunder improved to 2-0 against Sacramento this season.\nKings: Omri Casspi sat out with a bruised left knee. He is day to day. ... Rookie forward Eric Moreland was recalled from the Reno Bighorns, the team's NBA Development League affiliate. He did not play.\nPROUD PEJA\nThe Kings retired Peja Stojakovic's No. 16 jersey during a halftime ceremony. Former teammates Vlade Divac, Bobby Jackson, Doug Christie, Brad Miller and Scott Pollard attended the ceremony. Stojakovic said he was honored and humbled to have his jersey retired.\nGAY'S OUTBURST\nGay was called for a technical foul in the third quarter for arguing with official Lauren Holtkamp. Durant missed the technical free throw.\nUP NEXT\nThunder: At Golden State on Thursday.\nKings: Host Milwaukee on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764991919.180796
}