{
  "game_id": "0021800927",
  "espn_id": "401071600",
  "date": "Feb 28, 2019",
  "matchup": "PHI @ OKC",
  "headline": "Harris, Simmons lead 76ers past Thunder, 108-104",
  "body": "OKLAHOMA CITY --  The Philadelphia 76ers looked pretty good for a team that claims to be still figuring things out.\n\nGood enough to end a 19-game losing streak to the Thunder.\n\nTobias Harris scored 32 points and Ben Simmons had a triple-double to help the 76ers beat Oklahoma City 108-104 on Thursday night, ending the NBA's longest active winning streak by one team over another.\n\nHarris, acquired earlier in February in a deal with the Los Angeles Clippers, posted his highest point total in eight games with the 76ers. Philadelphia needed his offense because center Joel Embiid, the league's No. 6 scorer, missed his fourth straight game with left knee soreness.\n\nThe 76ers did fine, dropping 33 assists on 42 baskets. Harris thinks they might have actually overdone it with the passing at times.\n\n\"There were a couple plays there in the fourth quarter where we could have made the simple play and we would have been fine with,\" Harris said. \"But I think as a `we' team, we're just trying to feel each other out and make extra passes. Sometimes tonight, I felt we should have went for the easier play. It's not bad, though.\"\n\nPhiladelphia won in Oklahoma City for the first time. The 76ers' last victory had been at home in 2008 in the Thunder's first visit after moving from Seattle.\n\nSimmons finished with 11 points, 13 rebounds and 11 assists for his ninth triple-double of the season.\n\nRussell Westbrook posted his 25th triple-double of the season with 23 points, 11 rebounds and 11 assists, but he made 8 of 24 shots. Jerami Grant added 23 points for the Thunder, who lost their third straight.\n\nThunder forward Paul George, the league's No. 2 scorer, sat out with soreness in his right shoulder. Thunder coach Billy Donovan said before the game that George was injured during a loss at Denver on Tuesday night.\n\nThe 76ers led by 16 in the first half and were up 60-49 at the break.\n\n\"I thought we got some good looks, we just didn't shoot the ball particularly well in the first half,\" Thunder coach Billy Donovan said. \"I thought when we played closer to the basket on post-ups, that helped us get back into the game.\"\n\nThe Thunder cut their deficit down to two late in the third, but the 76ers handled the surge and led 86-79 heading into the fourth.\n\nThe 76ers led by two with 2.1 seconds left and barely got the ball inbounds. JJ Redick made two free throws with 1.5 seconds remaining to put the game out of reach.\n\n\"We're getting there,\" Harris said. \"Obviously, there's still time. There's things that we've still got to work on. But there were some really good spurts out there on the floor with us playing the right way.\"\n\nTIP-INS\n\n76ers: Grant, who started his career in Philadelphia, made 10 of 17 shots and had six rebounds. ... Jonah Bolden, a rookie from Australia, matched a season high with 14 points on 6-of-7 shooting.\n\nThunder: Free agent pickup Markieff Morris got his first start with the Thunder. It was just his fourth game with Oklahoma City. He finished with 17 points in 19 minutes. ... It was the 129th triple-double of Westbrook's career.\n\nSTAT LINES\n\nWestbrook went 1 for 9 from 3-point range. He entered the night shooting 27 percent from deep for the season.\n\n\"He's great downhill,\" Simmons said. \"I'd rather give that up -- him shooting jumpers -- than attacking and driving through the lane.\"\n\nHE SAID IT\n\nThunder guard Dennis Schroder on if the Thunder are worried about their losing streak: \"Hell no. We're in the third spot. We didn't have P (George), who is the MVP in my opinion this season. We had people step up from the bench. When we play the right way, ain't nobody can beat us.\"\n\nOUCH!\n\nWestbrook caught a knee in the midsection from Bolden and a knee to the head from Amir Johnson during the game. He shook off both incidents and played 37:32.\n\nUP NEXT\n\n76ers: Host the Golden State Warriors on Saturday.\n\nThunder: Visit the San Antonio Spurs on Saturday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994008.2343822
}