{
  "game_id": "0021500185",
  "espn_id": "400828072",
  "date": "Nov 20, 2015",
  "matchup": "PHX @ DEN",
  "headline": "Knight scores 38 as Suns rally to beat Nuggets 114-107",
  "body": "DENVER --  A sprained left ankle late in the first half couldn't keep Brandon Knight from leading a stunning Phoenix comeback.\n\nKnight shook off the injury to score a career-high 38 points, Eric Bledsoe had 22 and the Suns rallied from a 17-point deficit to beat the Denver Nuggets 114-107 on Friday night.\n\nKnight, who also pulled down 11 rebounds, had 24 points in the second half after leaving with 3:17 left in the second quarter.\n\n\"I can't tell you how blessed I was,\" Knight said. \"You never really know how those things can extend. They can feel OK right after they happen or you can feel them a lot through the next day. Fortunately I was able to just re-tape it, run up and down and I was able to fight through it.\"\n\nKnight had surgery on the same ankle over the summer but didn't seem bothered by it while hitting five of his six 3-pointers in the second half.\n\n\"I had some pain, but we were down and I wanted to fight through it,\" he said.\n\nRookie guard Emmanuel Mudiay led Denver with a career-high 26 points, and Gary Harris also set a career best with 20. Those marks were lost in the second-half collapse, though.\n\n\"We all came out in the second half a little lackadaisical,\" Mudiay said. \"That can't happen in this league.\"\n\nThe Suns trailed most of the game but went ahead early in the fourth quarter with an 11-0 run. Jon Leuer's 3-pointer made it 89-88, Knight hit another 3 and Mirza Teletovic's putback increased the margin to 94-88.\n\nTeletovic and Knight had consecutive 3-pointers to make it 102-92 with 4:26 remaining.\n\nKnight scored 17 points in the fourth to lead the comeback.\n\n\"We got after it and I thought our defense in the second half was much, much better,\" Suns coach Jeff Hornacek said.\n\nDenver cut it to five on a 3-pointer by Harris and a layup by Mudiay, but Knight hit three free throws and a layup to make it a 10-point game again. Ronnie Price's 3-pointer gave Phoenix a 110-99 lead, its biggest of the game.\n\nDenver came back with five straight points but missed three free throws in the final minute that could have made it a one-possession game. Knight sealed the win with his sixth 3-pointer.\n\nPhoenix outscored Denver 65-44 in the second half.\n\n\"To lose that game the way we lost it is unacceptable,\" Nuggets coach Michael Malone said. \"We guarded nobody in the second half.\"\n\nThe Nuggets started slowly but picked it up late in the first quarter. Danilo Gallinari scored eight points and Will Barton had seven in a 20-0 run capped by Darrell Arthur's jumper on the first shot of the second quarter.\n\nDenver went from down six to ahead 31-17 after the spurt.\n\nThe Nuggets led by as many as 15 in the first half and took a 63-49 lead into the locker room. They pushed it to 68-51 before Phoenix stormed back with a third-quarter surge that trimmed its deficit to 84-80 entering the fourth.\n\nSERVING NOTICE\n\nWithout mentioning names, Malone called out some of his players after his team allowed Phoenix to shoot 67 percent from 3-point range in the second half.\n\n\"Our inability to guard the 3-point line is a joke,\" Malone said. \"We're one of the worst teams in the NBA in guarding the 3-point line.\"\n\nHe added that he was disappointed with the effort of some of his players, and it could mean less court time for some.\n\n\"We have some guys on this team who pick and choose when they play hard,\" Malone said. \"Those guys aren't going to play. Either you play with effort or you don't play. I didn't like the effort from a bunch of our guys tonight. I told them, you play hard or you're going to sit. I don't care who you are.\"\n\nTIP-INS\n\nSuns: Teletovic had 15 points. ... Phoenix entered without a player listed on the injury report. ... The Suns allowed a season-high 63 first-half points. The previous high was 60 against Oklahoma City on Nov. 8. ... The Suns play eight of 10 on the road, starting with Friday's game.\n\nNuggets: Gallinari had 15 points and 10 rebounds. ... C Joffrey Lauvergne missed his 10th straight game with a lower back strain. He is closer to returning but not ready yet. ... The Nuggets' 63 points in the first half were a season high. ... Four players were in double figures by halftime.\n\nUP NEXT\n\nSuns: At New Orleans on Sunday.\n\nNuggets: Host Golden State on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994881.8861282
}