{
  "game_id": "0021500533",
  "espn_id": "400828420",
  "date": "Jan 06, 2016",
  "matchup": "PHX vs. CHA",
  "headline": "Suns hit season-high 19 3s in 111-102  win over Hornets",
  "body": "PHOENIX -- Mired in a nine-game losing streak, the Phoenix Suns took Tuesday off. Instead, they went bowling.\nThe next day, they made a season-high 19 3-pointers, showed purpose on defense and ended that skid with a 111-102 win over the Charlotte Hornets.\nMirza Teletovic made five 3s, Brandon Knight added 18 points and seven assists, rookie Devin Booker notched his first career double-double with 17 points and 10 rebounds and T.J. Warren added 17 points for the Suns in the win.\nSuns coach Jeff Hornacek was asked if the team will go bowling again.\n\"Maybe we should,\" he said with a grin. \"We'll probably take it easy on them (Thursday). After Friday's game we have three days that we can really work on things.\"\nKemba Walker had 25 points to lead the Hornets, who lost their fifth straight. Jeremy Lin and Marvin Williams each added 15 and Cody Zeller had 13 with 11 rebounds.\nThe Hornets trailed by eight at halftime but cut the lead to one, 78-77, on a pair of free throws by Walker with 3:02 to go in the third quarter. They took the lead 24 seconds later when Walker found Zeller for a dunk.\nWalker scored 11 as Charlotte went up by as many as five points in the third, but back-to-back 3s by Teletovic gave the Suns an 86-85 lead going into the fourth.\n\"You feel confident once you defend,\" Teletovic said. \"Everybody was sharing the ball and then the confidence just goes up and you make those shots, easy.\"\nThe Suns scored the first seven points of the fourth quarter and got a key 3 from P.J. Tucker with 54.9 seconds to play for a 109-102 lead. The Hornets got only as close as four points in the fourth after Phoenix's early run.\n\"Too many errors in the defensive end,\" Walker said. \"Not controlling the basketball and letting guys get to the paint. That kind of hurt us all game.\"\nHornacek won his 100th game as an NBA head coach and became the eight Suns head coach in team history to reach that mark.\n\"Just get a win,\" he said. \"It's been a rough stretch for us.\"\nNeither team led by more than four points in the first quarter and both teams shot the ball well. Lin made 5 of 7 first-quarter shots and had 13 points, while the Suns made 5 of 6 3-pointers and took a 34-32 lead into the second quarter.\n\"They had 53 points of the bench. Those guys had 11 threes,\" Hornets coach Steve Clifford said, referring to Teletovic, Booker and Warren. \"We changed coverage time after time, didn't matter.\"\nBUZZWORTHY BLOCKS\nThe Hornets had blocked shots on four straight possessions by the Suns in the first quarter. Zeller, Williams, Walker and Frank Kaminsky were credited with blocks from the 5:49 mark of the quarter to the 4:34 mark.\nTUCKER INJURED BUT RETURNS\nTucker took a knee to his right thigh in the third quarter and had to be helped to the bench. He left the game at the 9:30 mark of the third but returned in the fourth quarter and finished with 10 points. He rode a stationary bike in the tunnel to get loose but was still in pain during and after the game. \"I was going back out regardless,\" Tucker said. \"If I could walk, I could play.\"\nTIP-INS\nHornets: The Hornets were without C Al Jefferson, F Michael Kidd-Gilchrist and G Nicolas Batum due to injuries. . G Jeremy Lamb played seven minutes despite wrist and hip injuries. ... Lin played despite dealing with a right ankle problem.\nSuns: G Ronnie Price got his first start of the season, in place of Booker. Booker had been starting since Eric Bledsoe was lost for the season with a knee injury late last month. ... NASCAR driver Kasey Kahne and Tucker swapped uniforms in an exchange before Wednesday's game. Tucker got a fire suit and Kahne a personalized Suns jersey before he attended the game as part of a trip to the Phoenix area to promote the upcoming start to the 2016 NASCAR season.\nUP NEXT\nHornets: at L.A. Clippers on Saturday.\nSuns: host Miami on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994856.362735
}