{
  "game_id": "0022400167",
  "espn_id": "401704733",
  "date": "Nov 04, 2024",
  "matchup": "PHX vs. PHI",
  "headline": "Kevin Durant lifts Suns past Philadelphia 118-116, spoiling Paul George's 76ers debut",
  "body": "PHOENIX -- — Kevin Durant broke a tie on a driving layup with 24 seconds left and the Phoenix Suns beat Philadelphia 118-116 on Monday night, spoiling Paul George's 76ers debut.\n\n\r\n              After missing the first five games of the season because of a bone bruise in his left knee, George had 15 points, five rebounds and four assists in 32 minutes. He was 4 of 14 from the field and missed a shot that would have tied it in the final seconds.\n\n\r\n              Durant scored 35 points to lead Phoenix to its fifth straight victory. Bradley Beal had 17 points, Jusuf Nurkic had 15 points and 15 rebounds.\n\n\r\n              Tyrese Maxey, who entered Monday averaging 29.8 points with George and All-Star center Joel Embiid sidelined, had 32 points to lead Philadelphia. Maxey was 12 of 22 from the field, 6 of 14 from 3-point range.\n\n\r\n              Guerschon Yabusele had 19 points, six rebounds and six assists off the bench for Philadelphia, which fell to 1-5. Kyle Lowry scored 13 points, all in the first half, and Kelly Oubre Jr. had 11 points before fouling out.\n\n\r\n              TAKEAWAYS\n\n\r\n              76ers: George started slowly and was in foul trouble in the first half, but scored 10 points in the second quarter as he began to blend in with his new team.\n\n\r\n              Suns: Beal was questionable to play with a recurring problem in his right elbow that caused him to miss two games last week. He had five rebounds.\n\n\r\n              KEY MOMENT\n\n\r\n              Durant’s basket with 24 seconds to play decided the game.\n\n\r\n              KEY STAT\n\n\r\n              Devin Booker missed all six of his 3-point attempts and was 3 of 18 from the field. The Suns All-Star was 7 for 7 from the free-throw line to finish with 13 points.\n\n\r\n              UP NEXT\n\n\r\n              Both teams play again Wednesday night. The 76ers are at the Los Angeles Clippers, while the Suns host Miami.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998247.878388
}