{
  "game_id": "0022300324",
  "espn_id": "401584952",
  "date": "Dec 14, 2023",
  "matchup": "SAC vs. OKC",
  "headline": "De’Aaron Fox scores 41 points as Kings beat Thunder 128-123",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox scored 41 points and the Sacramento Kings beat Shai Gilgeous-Alexander and the Oklahoma City Thunder 128-123 on Thursday night.\n\n\r\n              Oklahoma City wasted a stellar performance by Gilgeous-Alexander, who finished with 43 points, nine assists and six rebounds.\n\n\r\n              The Kings led by 14 midway through the fourth quarter, but the Thunder cut the deficit to two with a 13-2 run. Fox and Keegan Murray answered with late baskets, and Sacramento stepped up its defense down the stretch. \n\n\r\n              It was the third 40-point performance this season for Fox, who also had seven assists and three rebounds while shooting 14 of 25 from the field.\n\n\r\n              “I didn’t feel like it was like one of the games where I was just like, hot,” Fox said. “I don’t really know how to describe it. When you're just in the moment, I can’t really say I'm thinking about it. ... I know I had a good game but I can’t say that I felt like I knew I had 40 already.”\n\n\r\n              The game featured two of the NBA's best young point guards in Gilgeous-Alexander and Fox, and both players delivered. Gilgeous-Alexander went 16 for 18 at the free-throw line, and Fox made five 3-pointers.\n\n\r\n              Kings coach Mike Brown said before the game it would be a fun matchup for fans to enjoy, even if he didn't get to appreciate it too much in the moment on the sideline.\n\n\r\n              “It's a fun matchup because you’re talking about two of the youngest stars in this league that are up-and-coming, and that should have some responsibility to bear the torch going forward,” Brown said.\n\n\r\n              The Kings, who were coming off a 119-99 loss at the Los Angeles Clippers on Tuesday, have won eight in a row over the Thunder.\n\n\r\n              Domantas Sabonis had 18 points and 16 rebounds for Sacramento in the opener of a six-game homestand. Malik Monk also scored 18, and Keon Ellis had a career-high 17 points.\n\n\r\n              Ellis, an undrafted free agent who played sparingly last season, had a breakout game. The 23-year-old guard was 5 of 7 from 3-point range and closed out the game with the starters.\n\n\r\n              “It’s just crazy to think,” Ellis said. “Always the dream was just to make it to the NBA, but now everything that’s happening is just kind of wild to think of.”\n\n\r\n              The Thunder had won four of five coming in. \n\n\r\n              Gilgeous-Alexander had 14 points in the first quarter, including a driving layup in the final seconds that gave the Thunder a 30-29 lead at the end of one.\n\n\r\n              Thunder coach Mark Daigneault was proud of his team for executing even when shots weren't falling at first, and took solace in pulling within a possession late in the game.\n\n\r\n              “I thought the last four, five minutes, we did a tremendous job at that end of the floor just executing, understanding what we were trying to get done, taking what the defense gave us,” Daigneault said.\n\n\r\n              He added the team's attacks were much improved.\n\n\r\n              “Even in a loss, I think we can take that as a step forward in that area of the game,” Daigneault said.\n\n\r\n              Sacramento shot better than 50% from the floor in the first half, but Oklahoma City stayed in the game with help from Gilgeous-Alexander’s 20 points and by getting to the foul line, making 15 of 17 attempts.\n\n\r\n              The Kings opened a double-digit lead late in the first half on a three-point play by Fox. Sacramento led 59-53 at halftime.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Visit the Denver Nuggets on Saturday night.\n\n\r\n              Kings: Host the Utah Jazz on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996800.260654
}