{
  "game_id": "0022301179",
  "espn_id": "401585807",
  "date": "Apr 12, 2024",
  "matchup": "MIL @ OKC",
  "headline": "Gilgeous-Alexander scores 23 points as the Thunder beat the injury-depleted Bucks 125-107",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 23 points and the Oklahoma City Thunder beat the injury-depleted Milwaukee Bucks 125-107 on Friday night to boost their hopes of taking the No. 1 seed in the Western Conference playoffs.\n\n\r\n              The Thunder entered the night trailing the Denver Nuggets by one game and tied with the Minnesota Timberwolves in the conference standings with two games remaining. Denver lost to San Antonio on Friday while Minnesota beat Atlanta leaving the three teams tied for the conference lead with a game remaining.\n\n\r\n              Thunder coach Mark Daignealt wasn't concerned about other results in the race for homecourt advantage throughout the Western Conference playoffs.\n\n\r\n              “I don’t have much of a reaction,\" he said. \"We’ve got to run to the finish line.” \n\n\r\n              The Thunder have increased their win total by 16 games two straight years under Daigneault.\n\n\r\n              “I think the big exponential jumps come from small incremental steps,\" Daigneault said. \"I talk all the time about stacking and we really are trying to live that out. We just try to have a good day in the day that’s in front of us and have a good possession in the possession that’s in front of us, good game in the game that’s in front of us and just be very present in the process of improving and in the process of competing.”\n\n\r\n              The Bucks played Friday without All-Stars Giannis Antetokounmpo and Damian Lillard. They already had announced Wednesday that Antetokounmpo would miss the rest of the regular season with a strained left calf. Lillard was out with a sore left adductor. Milwaukee fell to 4-4 in games without Antetokounmpo this season.\n\n\r\n              The Bucks could have clinched the No. 2 seed in the Eastern Conference playoffs with a win. They still can clinch the No. 2 seed with a win at Orlando on Sunday or a New York Knicks home loss to the Chicago Bulls on Sunday. \n\n\r\n              Bucks coach Doc Rivers said before the game that he was more concerned with health than the standings. They could finish anywhere between second and fourth. He said the advantage of being seeded third or fourth would be that they wouldn't have to wait out the Play-In Tournament to know their next opponent.\n\n\r\n              And by having a top-four seed, he knows at least one advantage the Bucks will have in the next round.\n\n\r\n              “The good news is, no matter what, we’ll be at home for Game 1,” he said. “That we do know.\"\n\n\r\n              Chet Holmgren had 22 points and nine rebounds and Aaron Wiggins scored 19 points for the Thunder, who have won four straight. Oklahoma City shot 52.8% from the field. \n\n\r\n              Khris Middleton and Brook Lopez each scored 18 points for Milwaukee. \n\n\r\n              Oklahoma City led 69-52 at halftime behind 16 points from Gilgeous-Alexander. The Thunder shot 55.3% from the field and made 12 of 13 free throws before the break.\n\n\r\n              Oklahoma City maintained control in the third quarter and led 95-81 heading into the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Orlando on Sunday.\n\n\r\n              Thunder: Host Dallas on Sunday.\n\n\r\n              ------\n\n\r\n              A previous version of this report had the Bucks 4-3 when Antetokounmpo does not play. They are actually 4-4.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996370.440692
}