{
  "game_id": "0021900146",
  "espn_id": "401160788",
  "date": "Nov 12, 2019",
  "matchup": "OKC @ IND",
  "headline": "Warren scores 23 to lead Pacers over Thunder 111-85",
  "body": "INDIANAPOLIS --  T.J. Warren was in attack mode to start the second half.\n\nWarren scored 11 of his 23 points in the third quarter to lead the Indiana Pacers over the Oklahoma City Thunder 111-85 Tuesday night.\n\n\"I just wanted to come out with a high sense of urgency out there,\" he said. \"I know we had a good little lead and we just wanted to put them away in the third. I just wanted to be aggressive and attack.\"\n\nMalcolm Brogdon had 20 points, six rebounds and five assists, and Domantas Sabonis had 18 points and 16 rebounds for the surging Pacers (7-4), who have won seven of eight, including four straight.\n\nIt was Warren who provided the spark needed to put the game out of reach, shooting 5 for 5 from the field in the third quarter and 10 for 14 overall.\n\nAs one of nine additions to Indiana's roster this season, Warren is beginning to find a groove.\n\n\"It's a new group,\" Pacers coach Nate McMillan said. \"Part of it is figuring these guys out, where they like the ball, what they can do with the basketball. We're starting to personalize some of the sets in the offense, spotting where guys can be effective and productive.\"\n\nThe Pacers used a big third quarter -- including 71.4 percent shooting -- to take a 26-point lead and put the game away.\n\nAaron Holiday hit two 3-pointers and Warren made another in a 15-2 run that ended with Doug McDermott's layup to put Indiana ahead 84-58 with 1:49 to go.\n\nMcDermott hit a 3-pointer to make it 99-68 with 7:19 to play.\n\nDanilo Gallinari scored 14 points, Deonte Burton had 13 points and Shai Gilgeous-Alexander had 11 points and six rebounds for the Thunder (4-7), who have lost three of four and remained winless on the road.\n\n\"We definitely struggled on offense,\" Thunder coach Billy Donovan said. \"It was 10 at the half and we talked about that coming out of the half. Warren really got going in that stretch and then their whole team kind of got going.\"\n\nThe Pacers first pulled away with a 12-2 run in the first quarter. TJ Leaf's layup gave Indiana a 28-18 lead, and the Pacers led by 15 after a jumper by Brogdon made it 52-37 with 1:58 remaining in the half.\n\nThe Thunder scored five straight points, including a 3-pointer by Gilgeous-Alexander, to close out the first half. The Pacers led 52-42 at halftime.\n\nSUCCESS AT THE LINE\n\nThe Pacers were 10 for 10 from the foul line through the first three quarters and finished 12 for 13 overall. The Thunder were 19 for 20 after three quarters, finishing 21 for 24 from the line. Gallinari shot a perfect 8 for 8 on free throws.\n\nOLADIPO PROGRESSING IN REHAB\n\nVictor Oladipo was assigned to Indiana's G League affiliate in Fort Wayne for a brief period Tuesday. The two-time All-Star was then recalled following a practice with the Mad Ants in Indianapolis, where Oladipo participated in full court drills for the first time, according to McMillan. Oladipo has been out all season as he rehabs a ruptured quad tendon in his right knee suffered in January.\n\nTIP-INS\n\nThunder: G Chris Paul had seven points, five rebounds and eight assists. ... C Nerlens Noel was called twice for goaltending, but the second was overruled following a replay challenge. ... G Terrance Ferguson missed Tuesday's game for personal reasons.\n\nPacers: Holiday scored 15 of his 17 points in the second half. ... C Myles Turner missed a seventh straight game with a sprained right ankle. ... G Jeremy Lamb was out for a fourth consecutive game with a sprained left ankle. ... C Goga Bitadze was out while going through concussion protocol.\n\nUP NEXT\n\nThunder: Host Philadelphia on Friday with a 19-2 series lead during the Oklahoma City era, including one loss to the 76ers last season.\n\nPacers: Travel to Houston on Friday. The Rockets have won four straight after a sweep of the regular season series the last two years.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996252.390222
}