{
  "game_id": "0021800036",
  "espn_id": "401070718",
  "date": "Oct 21, 2018",
  "matchup": "CLE vs. ATL",
  "headline": "Trae Young has 35 points, 11 assists as Hawks rout host Cavs",
  "body": "CLEVELAND -- Trae Young got doused with a bucket of ice water after his third NBA game.\nThe Cavaliers couldn't do anything to cool off Atlanta's rookie guard.\nYoung scored 35 points with 11 assists -- the best line by a first-year player since Steph Curry in 2010 -- and Kent Bazemore scored 23 on Sunday as the Hawks rolled to an easy 133-111 win over Cleveland, which lost its home opener and fell to 0-3 as it readjusts to life without LeBron James.\nThe No. 5 overall pick in this year's draft, Young shook off a slow start and showed why the Hawks believe he's a future superstar. Afterward, Young was targeted by teammates after they soaked coach Lloyd Pierce following his first win.\n\"It was super cold,'' Young said with a smile after his shocking bath. \"I thought it would just be Coach Pierce because he had his first win, but it was all right. I'll take it.''\nYoung was unaware that he matched Curry, who twice scored at least 35 with 10 assists in his first season with Golden State. Just three games into the season, Young has 79 more chances to do it again.\n\"Now that we know what he's capable of, we'll be expecting a little bit more,'' Bazemore joked.\nThe Hawks made a team-record 22 3-pointers, including 10 while scoring 41 in the fourth quarter, to blow open the game and send Cleveland fans home early, with many shaking their heads on the way out.\nJordan Clarkson scored 19, and Kevin Love had 16 with 17 rebounds for the Cavs, who could be in for a very long season post-LeBron.\nCleveland's issues appear to be far deeper than no longer having the game's best player. The Cavs aren't playing professional-level defense and have given up 116, 131 and 133 points in their first three games.\n\"We didn't expect to be 0-3,'' said Love, who was asked if he was alarmed by the performance. \"On opening night at home, we expect to play better in front of our own fans. I don't know if alarming is the right word, but it sure seems right, right now. Our effort level just wasn't there. It's just going to be a growth year for us. We've got to get better.''\nWhile wearing neon green sneakers, Young showed plenty of flash in his game. He made six of seven shots and scored 18 in the second quarter, helping the Hawks erase a 14-point deficit and go up 64-60 at halftime.\n\"Trae is fearless,'' Bazemore said. \"Even in the practices earlier in the summer, he came in and established himself right away. That's what you have to respect: a young guy that comes in, he's not bashful, he's not shy and who has that kind of caliber talent. He's going to have ups and downs. I'm proud of him as a teammate.''\nIt's a whole new ballgame in Cleveland without James, who carried the Cavs to four straight NBA Finals and a title in 2016 before leaving as a free agent -- for the second time -- in July for Los Angeles.\nThe Cavs are starting over, but believe they can still be competitive in the Eastern Conference. They're pinning most of that hope on Love, who signed a four-year, $120 million contract extension this summer. But he doesn't have much help, and it could be a while before Sexton is ready to contribute.\nSexton came off the bench and scored four points on 2-of-11 shooting in 28 minutes. Cavs coach Tyronn Lue thought his young guard might have gotten caught up in his matchup with Young.\n\"He took it personal,'' Lue said. \"He was flying over screens to get there, and that's not what we wanted to do.''\nTIP-INS\nHawks: Atlanta had 32 assists on 48 field goals. ... Atlanta has 10 players with two years or less NBA experience. The Hawks' roster currently averages 3.64 years, a number that drops to 2.63 with the exclusion of Vince Carter, a 20-year veteran.\nCavaliers: Sexton was called for a Flagrant 1 foul in the second quarter for stepping under Bazemore, who was attempting a 3-pointer. ... Love went 6-of-19 and is 17-of-56 in three games.\nMARQUEE MATCHUP\nYoung didn't take any satisfaction in beating Sexton.\n\"You look forward to playing anybody in your class,'' he said. \"Playing against him throughout high school, USA Basketball, things like that. You look forward to playing against guys you grew up with. I was looking to playing against Collin, but at the same time, I look forward to playing against everybody.''\nWELCOME BACK\nPierce was on familiar turf.\nHe began his coaching career in Cleveland, hired by Mike Brown in 2007. Pierce has former Cavs assistants Melvin Hunt and Chris Jent on his staff.\n\"It's somewhat surreal when you think about it, starting here 12 years ago,'' Pierce said. \"We spent many days and afternoons here at the Q. A lot of credit to Mike and the opportunity he gave all of us.''\nUP NEXT\nHawks: Host Dallas in their home opener on Wednesday.\nCavaliers: Host Brooklyn on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994813.156712
}