{
  "game_id": "0021401159",
  "espn_id": "400579451",
  "date": "Apr 07, 2015",
  "matchup": "LAL @ LAC",
  "headline": "Clippers beat Lakers 105-100 in rematch 48 hours later",
  "body": "LOS ANGELES -- The Clippers have three games left until the playoffs begin. They can't get there soon enough.\n\"I like our mindset. Everyone is like, `Let's get to it,\" coach Doc Rivers said. \"It'll be interesting to see how we play the next three.\"\nBlake Griffin and J.J. Redick scored 27 points apiece and the Clippers beat the Lakers 105-100 Tuesday night, completing a 4-0 season sweep of their downtrodden Staples Center co-tenant.\n\n\"We've been about business. I like our attitude and resolve going into games,\" Griffin said.\nChris Paul had 19 points to go over 13,000 in his career for the Clippers, who have won four in a row and 11 of 12. They beat the lottery-bound Lakers for the second time in 48 hours, winning 106-78 after leading in that game by 43.\nThe Lakers hung around in the rematch, and even led by four points early after never leading Sunday. Jordan Clarkson led them with 20 points, all in the first three quarters. Tarik Black added 16 points and Wesley Johnson 15.\n\"I don't think anyone had a great game but our effort was greatly improved,\" Lakers coach Byron Scott said.\nDeAndre Jordan had 17 rebounds and Paul had 10 assists for the Clippers, who were outscored in the third and fourth quarters.\nThe Lakers got within one on a technical free throw by Ryan Kelly, capping a 17-11 stretch that included 3-pointers by Jabari Brown, Johnson and Dwight Buycks.\nCarlos Boozer's jumper left the Lakers trailing 89-88, the closest they got in the final 5 minutes.\n\"Tonight we played better, competed hard and got great looks but we just missed shots,\" Clarkson said.\nThe Clippers hung on to eke out their seventh straight win and 11th in their last 12 against the Lakers, their most successful 12-game stretch in the series in franchise history.\n\"We were chasing Paul and Redick all over,\" said Jeremy Lin, who had 14 points. \"They move the ball well, attack aggressively and they're very active.\"\nRedick hit his fourth 3-pointer and then made both free throws after getting fouled. Matt Barnes dunked on a fast break off Paul's alley-oop pass and Griffin made a free throw for a 97-88 lead with 3 1/2 minutes left.\nPaul and Redick converted four straight free throws to end the game after Lin made a pair, drawing the Lakers within three.\nThe Lakers have dropped four in a row and 11 of their last 14. They remain without a victory in April, having last won at Philadelphia on March 30. Sunday's defeat to the Clippers was their franchise-worst 56th of the season.\n---\nTIP-INS\nLakers: Scott is giving his endorsement for Defensive Player of the Year to Jordan. \"He scares the hell out of guys and alters shots and he makes guys think about coming into the middle,\" Scott said. ... The Lakers haven't beaten the Clippers since Oct. 27, 2013.\nClippers: G Jamal Crawford scored four points playing for the first time since being sidelined by a right calf injury on March 2. \"It said 19 minutes but it felt like 35,\" said a tired Crawford, adding that his timing and shooting rhythm were off. ... Paul became the fourth player in NBA history to record 13,000-plus points and 6,500 assists in less than 700 games. ... Redick hit a halfcourt shot before morning shootaround, which was promptly called off in keeping with the team's tradition when anyone makes such a shot. ... Commissioner Adam Silver attended, as did Terrell Owens.\nQUOTE OF THE NIGHT\n\"I'm sure it's not to get him to stop smoking.\" -- Rivers, about the bloody patch on Griffin's right shoulder after he crashed into the sideboards trying to save the ball.\nUP NEXT\nLakers: At Denver on Wednesday.\nClippers: Host Memphis on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764991959.11688
}