{
  "game_id": "0021700214",
  "espn_id": "400974965",
  "date": "Nov 15, 2017",
  "matchup": "LAL vs. PHI",
  "headline": "Embiid's career-high 46 leads 76ers past Lakers 115-109",
  "body": "LOS ANGELES --  In a matchup of teams with rising young stars, Joel Embiid stood out above the rest.\n\nThe 7-foot center scored a career-high 46 points -- the most by a Philadelphia player in 11 years -- and grabbed 15 rebounds to lead the 76ers past the Los Angeles Lakers 115-109 on Wednesday night.\n\nAnd that was only part of his night. Embiid also had seven assists and seven blocked shots, making him the first NBA player with 40 points, seven assists and seven blocks in a game since Julius Erving did it for the 76ers against Detroit in 1982, according to ESPN Stats & Info.\n\n\"Tonight we realized we had Joel Embiid, and he was just dominant,\" said Sixers coach Brett Brown.\n\nPhiladelphia also got an outstanding game from rookie guard Ben Simmons, who barely missed a triple-double with 18 points, 10 assists and nine rebounds.\n\nYet it was Embiid who was simply unstoppable. The Lakers tried three different defenders on him to no avail, but seldom double-teamed him.\n\n\"I was just playing basketball and being aggressive, just like I was against the Clippers,\" said Embiid, who played 31 games last season and averaged 20.2 points in his NBA debut.\n\nThe 23-year-old Embiid, who missed his first two seasons due to injury, set a career high with 16 rebounds against the Los Angeles Clippers in the same building Sunday, when he had 32 points in a 109-105 victory.\n\n\"I love LA,\" Embiid said. \"I love the Staples Center. I wanted to come out here and put on a show.\"\n\nThat he did. Embiid shot 14 for 20 from the field and 16 of 19 at the free throw line Wednesday, giving him the most points by a Sixers player since Allen Iverson scored 46 against Chicago on Nov. 24, 2006.\n\nIn fact, prior to Embiid's dazzling performance, the previous 35 times someone scored at least 44 for the 76ers it was Iverson, according to ESPN.\n\nBrandon Ingram led Los Angeles with 26 points and 11 rebounds. Lakers rookie Kyle Kuzma added a career-best 24 points, and Jordan Clarkson scored 20 off the bench.\n\nFor the second consecutive game, however, point guard Lonzo Ball spent the entire fourth quarter on the bench. The prized rookie played just 21 minutes, going 1 for 9 from the floor and missing all six 3-point attempts while being completely outplayed by Simmons.\n\nBall finished with two points, five rebounds and two assists.\n\n\"Why do I think he had an off night?\" answered Lakers coach Luke Walton. \"I don't know, because he's 20 years old and plays the toughest position in the NBA? Someone else will have an off night tomorrow. Tonight it didn't seem like he had it.\"\n\nThe Lakers have lost four of five.\n\nPHILLY IMPRESSED\n\nThough almost all the accolades went to Embiid and Simmons, Brown liked what he saw of Ingram and Kuzma.\n\n\"I give Kuzma and Ingram a lot of credit,\" he said. \"The Lakers are on a similar path that we were on, trying to identify keepers, trying to identify franchise-type players. And those two guys tonight were excellent. They kept them in the game.\"\n\nTIP-INS\n\n76ers: Jahlil Okafor, who had been out with a respiratory infection, was available but did not play. ... Brown before the game on the composure displayed by Simmons: \"He really doesn't get rattled. There's a poise internally that's really impressive.\"\n\nLakers: Ball entered shooting just 31.3 percent from the field, including 25 percent from 3-point range. The No. 2 pick in this year's draft has a strange jump shot, but Walton said the team has no current plans to change it. \"We're not even talking about changing it during the season. We may not change it at all ever. He's been a good shooter his whole life and he's going to start making shots. That'll come with time,\" Walton said.\n\nUP NEXT\n\n76ers: Return home Saturday to play defending champion Golden State.\n\nLakers: Play the second of four consecutive home games Friday against Phoenix.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993205.9534879
}