{
  "game_id": "0021900204",
  "espn_id": "401160846",
  "date": "Nov 20, 2019",
  "matchup": "MIL @ ATL",
  "headline": "Antetokounmpo, Bledsoe spark Bucks to win over Hawks",
  "body": "ATLANTA --  Giannis Antetokounmpo wasn’t concerned that the Milwaukee Bucks let the Atlanta Hawks back in the game late in the fourth quarter.\n\nWhat mattered to Antetokounmpo was another road win for his streaking team.\n\n“If you want to be a really good team in this league, you’ve got to win on the road,” he said. “It doesn’t matter where we play, as long as we come out there and give ourselves a chance to win every night.”\n\nAntetokounmpo had 33 points and 11 rebounds, Eric Bledsoe scored 28 and the Bucks won their fifth consecutive game with a 135-127 victory over the Hawks on Wednesday night.\n\nIt marked the league-high ninth time this season that Antetokounmpo, the reigning NBA MVP, has had at least 30 points and 10 rebounds.\n\nThe Bucks, with the league’s second-ranked offense, have won nine of 10 and improved to an NBA-best 8-2 on the road despite a sloppy ending as Atlanta cut the lead to single digits in the final minute.\n\nRookie forward De’Andre Hunter finished with a career-high 27 points and Trae Young scored 25 for the Hawks, who have lost four straight and seven of eight. Atlanta was coming off a 1-4 road trip that included a 49-point loss to the Los Angeles Clippers.\n\n“When we play at other teams’ paces, it’s tough for us,” Young said. “We’ve got to be better at dictating the speed of the game instead of letting them dictate it.”\n\nThis game was close in the first half, but Milwaukee led by 18 on Pat Connaughton’s 3-pointer with 9:53 remaining. The Hawks whittled a 19-point deficit to seven late in the fourth quarter, causing Bucks coach Mike Budenholzer to put Antetokounmpo back in the game before Sterling Brown hit a corner 3 to make it 129-119 with 1:48 left.\n\n“They threw a different type of defense out, press and play hard,” Bledsoe said. “But I thought we did a great job of sustaining.”\n\nAntetokounmpo took a fast-break pass down the right side for a big dunk on the baseline to make it 42-35 in the second quarter and scored on consecutive possessions to put the Bucks up 73-63 in the third, finishing off a 15-2 run with a fast-break dunk.\n\nAfter the Hawks trimmed the lead to five a few minutes later, Antetokounmpo hit a 3 to cap a 17-point performance in the third. Connaughton’s short runner built the lead to 96-83 entering the fourth.\n\nTIP-INS\n\nBucks: G Donte DiVincenzo, making his fourth straight start, had 11 points. It’s been a good run for DiVincenzo, who scored 15 points against Chicago and 14 against Indiana as a starting replacement for Khris Middleton (bruised left thigh).\n\nHawks: Coach Lloyd Pierce said G Kevin Huerter has better range of motion in his shoulder but is still expected to miss at least another week with a left rotator cuff strain.\n\nSPECIAL OUTFITS\n\nThe Hawks went with a new look to celebrate their 50th season in the Peach State, decking out the floor with a black team logo trimmed in peach and a peach logo on the baselines. The team wore black uniforms that read “Peachtree” in white and peach trim across the jerseys. State Farm Arena is about five blocks west of the city’s renowned Peachtree Street.\n\nLOPEZ IN THE PAINT\n\nBucks center Brook Lopez finished with two blocks. He had five blocks in his past two games and ranks third in the league, but Budenholzer thinks Lopez doesn’t get enough credit. “It’s amazing when he’s able to contest a shot, make them miss and get the rebound,” Budenholzer said. “It’s sometimes underrated what he does.”\n\nUP NEXT\n\nBucks: Begin a stretch of four straight home games against Portland on Thursday. Milwaukee plays 12 of its next 15 at home.\n\nHawks: At the Detroit Pistons on Friday and then host Toronto on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996173.3047738
}