{
  "game_id": "0021600859",
  "espn_id": "400900265",
  "date": "Feb 24, 2017",
  "matchup": "CHI vs. PHX",
  "headline": "Wade, Butler lead Bulls over Suns 128-121 in overtime",
  "body": "CHICAGO --  To Dwyane Wade, it felt like an otherworldly experience.\n\nThere he was showing some of his old explosiveness as he drove past Eric Bledsoe for a thunderous right-handed dunk over a rotating Alex Len, an emphatic exclamation mark on a wild overtime victory for the Chicago Bulls.\n\n\"It was an out of body experience,\" he said.\n\nWade scored 23 points, Jimmy Butler added 22 and the Bulls rallied to beat the Phoenix Suns 128-121 in overtime Friday night.\n\nDevin Booker scored 27 points for Phoenix, but missed a chance to win it in regulation after Wade fouled him on a 3-pointer with 1.5 seconds left. Booker hit the first two free throws to tie it, then missed the third.\n\nWade and Butler led the Bulls as they rallied from 11 down in the fourth quarter to beat the Western Conference's last-place team. Both players scored 14 points after the third to help the Bulls win their third straight.\n\nNikola Mirotic scored 20 points and hit four 3-pointers. Robin Lopez added 19 points. Denzel Valentine, who figures to get more playing time after Doug McDermott was traded to Oklahoma City along with Taj Gibson on Thursday, had 15 points. The rookie hit 5 of 8 3-pointers.\n\n\"You get more confidence, obviously, because you're not looking over your shoulder every time something happens,\" Valentine said. \"You get more confidence when you know you're in the rotation.\"\n\nBledsoe had 17 points and 10 assists for Phoenix. T.J. Warren and Marquese Chriss scored 17 apiece. Alan Williams added 16 points on 8-of-9 shooting, but the Suns lost for the sixth time in eight games.\n\n\"Just being inexperienced,\" Booker said. \"Not getting stops down the stretch. Committing dumb turnovers. A bunch of stuff leads to that, a lot of stuff we need to work on. We have a lot of young players playing in crunch time, so we'll learn from it.\"\n\nThe Bulls tied a franchise record by scoring 20 points in overtime and were leading 116-110 after a seven-point spurt that Mirotic started with a 3.\n\nWade put back Butler's airball and hit two free throws to make it 122-115. And he had the crowd roaring in the closing minute when he drove for that dunk on Lin and gave the raise-the-roof gesture.\n\n\"It was nice, right?\" Wade said.\n\nCOMING BACK\n\nThe Suns appeared to be in good shape leading 102-91 with 4:32 remaining in regulation after Booker nailed a 3 to finish a 14-2 run, but the Bulls came storming back.\n\nA dunk by Wade and 3 by Mirotic with 1:53 left cut it to 104-103 and drew a huge roar from the crowd.\n\nButler hit a 3 to tie it at 106-all with 48 seconds remaining, and after a driving Bledsoe lost the ball out of bounds, he nailed a baseline jumper to give Chicago a two-point lead with 9.1 seconds left.\n\nLOOKING AHEAD\n\nButler reiterated his desire to remain in Chicago and expressed support for the front office, a day after the Bulls traded their best shooter (McDermott) and a key interior player (Gibson).\n\n\"Right now this is the organization I'm going to be with, these are the guys I want to compete with, the coaches I want to play for,\" he said. \"That's all I can really focus on. When everything else comes up then we'll worry about that, but right now I'm not going anywhere, baby.\"\n\nThe three-time All-Star guard's name has been linked to trade rumors most notably with Boston since last spring. Those talks figure to resurface in June.\n\nWade's future is also up in the air since he can opt out of the two-year deal he signed last summer.\n\n\"I take my option seriously,\" he said. \"I always look into what's the best thing for me. I haven't talked to (the front office) about that.\"\n\nTIP-INS\n\nSuns: The Suns waived F Mike Scott and C/F Jared Sullinger on Friday, a day after acquiring them in trades. ... The Suns also signed G Ronnie Price for the rest of the season.\n\nBulls: Rajon Rondo will remain in the backup point guard role, coach Fred Hoiberg said. ... G Cameron Payne (flu), acquired from Oklahoma City, was unavailable.\n\nUP NEXT\n\nSuns: Visit Milwaukee on Sunday.\n\nBulls: Visit Cleveland on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995036.578014
}