{
  "game_id": "0021500320",
  "espn_id": "400828207",
  "date": "Dec 09, 2015",
  "matchup": "CHA vs. MIA",
  "headline": "Hornets beat Heat 99-81 for third straight victory",
  "body": "CHARLOTTE, N.C. --  Hornets coach Steve Clifford puts guard Nicolas Batum in lofty company.\n\nAfter watching Batum register a triple-double with 10 points, 11 rebounds and 11 assists in a 99-81 victory over the Miami Heat on Wednesday night, Clifford mentioned him with other exceptional passers, such as Tracy McGrady, Rafer Alston and Steve Nash.\n\n\"They're not going to just pass to a guy where (scoring) is going to be a problem,\" Clifford said. \"That's how Nic plays. Watch him. The only time he looks a guy off is when he knows that's not a good option. That's how he thinks the game.\"\n\nIt was his Batum's fifth career triple-double, and it helped the Hornets (13-8) push a lead past the 30-point mark in the second half of the Eastern Conference matchup. Charlotte acquired Batum as part of a roster overhaul in the offseason, in a trade with Portland for Gerald Henderson and Noah Vonleh.\n\n\"I'm blessed they've embraced me,\" said Batum, whom the Houston Rockets drafted in the first round in 2008.\n\nKemba Walker and Marvin Williams scored 18 points apiece in Charlotte's third straight victory. Williams shot 7 for 11 and hit four 3-pointers on his highest-scoring night of the season.\n\n\"They were the more aggressive team and they jumped us in the beginning,\" Heat coach Erik Spoelstra said. \"We were never able to corral any kind of momentum in the game. You have to credit them for an aggressive game. For us, it was a very sloppy game.\"\n\nTyler Johnson scored a career-high 20 for Miami. Dwyane Wade and Gerald Green each added 11 for the Heat, which has lost three of five. Wade led Miami with four assists, and cited a \"freelance\" approach by his team that isn't working as a reason for the loss.\n\n\"Everybody means well,\" Wade said. \"On the road, you can't come out and spar with them offensively. You've got to get to your game right away. . Not that it's going to guarantee a win, but it'll settle us and let us get better shots.\"\n\nMiami shot 39 percent (29 of 75) and committed 18 turnovers that led to 21 points.\n\nJeremy Lamb scored 10 off the bench for the Hornets, who learned earlier in the day the NBA suspended injured center Al Jefferson for five games for violating the terms of the NBA/NBPA Anti-Drug Program.\n\nJefferson, out with a strained left calf, will begin to serve the suspension when he returns to action.\n\nCharlotte's third straight win comes in a stretch against Eastern Conference teams that figure in the playoff race. The Hornets beat Chicago and Detroit before the win against Miami. Games against Memphis and Boston are next.\n\n\"That's the way the East is,\" Clifford said. \"There's some elite teams, but there's also great parity in the league.\"\n\nTIP-INS\n\nHornets: Charlotte's 12-8 start in 20 games was seven games better than the same stretch last season. ... Charlotte entered the game Wednesday third in the Eastern Conference in offensive rating (103.9). Last season, Charlotte ranked 13th out of 15 Eastern Conference teams. ... Reserve center Tyler Hansbrough's heady play late in the game brought cheers from the home crowd. Hansbrough, a former first-round draft pick out of North Carolina, scored four points and had three fouls in 10 minutes.\n\nHeat: Luol Deng returned to action. He missed six games (left hamstring strain). ... Wade played his 800th career game. Former Hornets center Robert Parish holds the record with 1,611. ... Center Hassan Whiteside, from nearby Gastonia, played for the first time as a pro in Charlotte. Whiteside has opened the season with two or more blocks in every game (22). He trails only Mark Eaton (24, 1988-89 with Utah) and Shaquille O'Neal (23, 1992-93 with Orlando) for longest streaks to start a season.\n\nUP NEXT\n\nHeat: Visit Indiana on Friday.\n\nHornets: Visit Memphis on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994400.638486
}