{
  "game_id": "0021900035",
  "espn_id": "401160677",
  "date": "Oct 26, 2019",
  "matchup": "PHX vs. LAC",
  "headline": "Booker, Oubre lead Suns over Clippers 130-122",
  "body": "PHOENIX --  It had been a downright depressing 24-hour stretch for the Phoenix Suns, who found out their starting center was suspended for 25 games and then immediately lost to the Denver Nuggets by one point in overtime.\n\nThe next night, with every reason to pout, the Suns didn't do it.\n\nInstead, they came out and beat one of the NBA's preseason championship favorites.\n\nDevin Booker scored 30 points, Kelly Oubre Jr. added 20 and the Suns beat the Los Angeles Clippers 130-122 on Saturday for their first win in the series in more than three years.\n\n\"It feels amazing,\" Oubre said. \"Everybody chipped in. We fought through adversity once again, we're finding who we are and we're continuing to grow. That's the most beautiful thing about it.\"\n\nPhoenix (2-1) snapped a 12-game losing streak to the Clippers and won for the first time since losing starting center Deandre Ayton to a 25-game suspension after he tested positive for a diuretic.\n\nThe Suns had a 15-point lead midway through the fourth quarter before Los Angeles' Lou Williams made things interesting with back-to-back 3-pointers. The Clippers pulled within six on Kawhi Leonard's 3-pointer with less than two minutes left, but the Suns' Tyler Johnson responded with his own 3-pointer to stop the rally.\n\nThe teams were tied at 55 at halftime and the Suns pushed to a 91-85 lead after three quarters largely thanks to the unlikely duo of Frank Kaminsky III and Jevon Carter, who combined for 17 points during the rally.\n\n\"When you have losses like (Denver) on the first night on a back-to-back you're just antsy to play because you have that bad taste in your mouth and it's fresh,\" Kaminsky said. \"That showed tonight. We came out with a lot of energy, physicality and set the tone on defense.\"\n\nCarter started in the absence of Ricky Rubio, who missed the game because of a knee injury suffered on Friday against Denver. The second-year pro finished with eight points and six assists in 33 minutes.\n\nKaminsky had 18 points, eight rebounds and six assists. The Suns have won two of the season's first three games for the first time since 2015.\n\n\"The fight was really evident tonight,\" Suns coach Monty Williams said. \"Holding that team to 22 points in the first quarter, we got off to a great start. Then after that, they were the Clippers, but we were pretty good.\"\n\nLos Angeles (2-1) was led by Montrezl Harrell's 28 points. Leonard added 27 points, eight rebounds and 10 assists. The Clippers fought foul trouble for much of the second half, but coach Doc Rivers said his team didn't have anyone to blame but itself after a poor defensive showing.\n\n\"You have a couple of these games where you're just late on everything,\" Rivers said. \"I thought we were late on everything. On the offensive end, we had no pace. We deserved to lose.\"\n\nTHE TALKING GAME\n\nBooker had an efficient night, shooting 10 of 20 from the field and 3 of 6 from 3-point range. He was also locked in when it came to conversation, going back-and-forth with Clippers guard Patrick Beverley with buckets and barbs.\n\nOubre said Booker's performance was fun to watch.\n\n\"It's Devin Booker, man,\" Oubre said. \"I've seen it before. I'll see it again.\"\n\nTIP-INS\n\nClippers: The Clippers got 66 points from the bench, including Harrell's 28 and Williams' 23. Harrell shot 9 of 10 from the field and 10 of 11 on free throws. ... Williams was called for a flagrant one foul in the fourth quarter. .. Beverley fouled out late in the fourth quarter. He finished with 11 points and seven rebounds.\n\nSuns: Rubio didn't play because of a left knee contusion suffered at the end of the team's loss to Denver on Friday. Coach Monty Williams said Rubio banged knees with another player and that his knee was \"pretty swollen.\" ... Aron Baynes was called for a flagrant one foul in the second quarter after his arm hit Ivica Zubac in the face on Zubac's shot attempt.\n\nUP NEXT\n\nClippers: Host the Hornets on Monday.\n\nSuns: Host the Jazz on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-NBA",
  "source": "espn_api",
  "crawled_at": 1764996594.151804
}