{
  "game_id": "0022200688",
  "espn_id": "401468843",
  "date": "Jan 20, 2023",
  "matchup": "IND @ DEN",
  "headline": "Murray gets 1st career triple-double, Nuggets rout Pacers",
  "body": "DENVER -- — The peach-colored coordination between Jamal Murray (shoes) and Nikola Jokic (suit) was purely by accident.\n\n\r\n              This wasn't: Murray turning in his best Jokic imitation.\n\n\r\n              Murray got his first career triple-double and the Denver Nuggets extended their winning streak to nine games by routing the Indiana Pacers 134-111 on Friday night without Jokic. \n\n\r\n              The two-time reigning NBA MVP sat out due to hamstring tightness.\n\n\r\n              Murray finished with 17 points, 14 assists and 10 rebounds to replicate the kind of production usually seen from Jokic, who leads the league in triple-doubles. Jokic had a courtside seat for the Jamal Murray Show and congratulated his point-guard teammate after the feat. \n\n\r\n              “I was just playing our game, playing aggressive,” Murray explained. “We were just having fun out there. The ball was hopping.” \n\n\r\n              About their color-coordinated ensemble: “I didn’t know he was going to come in looking like a peach,” Murray cracked.\n\n\r\n              About emulating Jokic in getting into the triple-double department: “He steals a lot of my triple-doubles,” Murray cracked again. \"It was nice to finally get one on the board.”\n\n\r\n              Aaron Gordon scored 28 points and Michael Porter Jr. added 19 as the Western Conference-leading Nuggets ran their home win streak to 16 games. They haven't lost at Ball Arena since Dec. 6 against Dallas. \n\n\r\n              Nuggets acting head coach David Adelman improved to 3-0. Michael Malone remains out after entering the league’s health and safety protocols. \n\n\r\n              A stat line Malone will certainly appreciate — a season-high 38 assists. This, too — 16 steals.\n\n\r\n              “It was really fun to see our guys continue to play the way we play regardless of who’s on the court,” Adelman said. “It was fun because a lot of guys contributed. Those are special nights.” \n\n\r\n              Adelman was especially pleased for Murray, who's been working his way back from a torn ACL that kept him out all last season.\n\n\r\n              “He’s already had such a storied career here as a Nugget and everything he’s been through,” Adelman said. “So it’s very cool to see that.”\n\n\r\n              Bennedict Mathurin had 19 points and Chris Duarte added 18 for the Pacers, who dropped their sixth straight game. Indiana went 8 of 32 from 3-point range.\n\n\r\n              “We’re making a lot of mistakes. We’re not taking care of the ball, including me,” Duarte said. “We just have to cut that down. I feel if we cut the turnovers down we’re going to be there with the other teams.” \n\n\r\n              Denver had a back-to-back-to-back dunk sequence in the third quarter that drew thunderous applause from the crowd. \n\n\r\n              The Nuggets were jamming along all night with 16 dunks. That was tied for their most since 1996-97 (against Washington on March 20, 2009), according to the team. \n\n\r\n              “We’re very unselfish,” Murray said. “We don’t really care who scores. We’re just playing free.” \n\n\r\n              TIP-INS\n\n\r\n              Pacers: Indiana has lost six in a row to Denver. ... Indiana center Myles Turner had 15 points. \n\n\r\n              Nuggets: F Vlatko Cancar missed the game because of an illness not related to COVID-19. ... F Jeff Green was back after sitting out 14 games with a broken hand. He finished with six points. ... G Bones Hyland didn't play in the second half. He had six points.\n\n\r\n              INJURY UPDATE, PART I\n\n\r\n              Pacers guard Tyrese Haliburton participated in some shooting contests with his teammates Friday. Haliburton has missed the last five games (sprained knee/elbow).\n\n\r\n              “I don’t know exactly when he’ll play, but he’s doing well,” coach Rick Carlisle said.\n\n\r\n              INJURY UPDATE, PART II\n\n\r\n              Adelman said Jokic sitting out was more of a precaution.\n\n\r\n              “He just had a little discomfort,” Adelman said. “If he’s not the best player in the world he’s close, so if he’s feeling discomfort, we’re not going to take a chance.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Finish a four-game trip Saturday at Phoenix.\n\n\r\n              Nuggets: Close out a five-game homestand Sunday against Oklahoma City.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994323.835357
}