{
  "game_id": "0022300238",
  "espn_id": "401584866",
  "date": "Nov 22, 2023",
  "matchup": "LAL vs. DAL",
  "headline": "Dallas blows a 20-point lead in the 4th, but Kyrie's 3-pointer pushes Mavs past Lakers 104-101",
  "body": "LOS ANGELES -- — Kyrie Irving scored 28 points and hit the go-ahead 3-pointer with 22 seconds to play, and the Dallas Mavericks blew a 20-point lead in the fourth quarter before rallying back for a 104-101 victory over the Los Angeles Lakers on Wednesday night.\n\n\r\n              LeBron James scored 16 of his 26 points in the fourth quarter and made the tiebreaking tip-in with 1:16 to play for the Lakers, but the NBA career scoring leader also made a turnover with four seconds left and then missed a tying 3-point attempt at the buzzer.\n\n\r\n              “We gave ourselves a fighting chance, but it's kind of tough when you go down that many points,” James said. “I liked our defense in the last 12 minutes. We've just got to be better for the first 36.”\n\n\r\n              After Luka Doncic and James traded missed 3-point attempts in the final minute, Irving coolly hit his fourth 3-pointer of the night off a pass from Doncic near the Lakers' bench. Doncic then stole James' poor pass to the basket, and Irving hit two free throws before James missed another 3-point attempt.\n\n\r\n              “When you have quarterbacks like Luka and Ky, trust is high,” Dallas coach Jason Kidd said. “A lot of times they’re going to get double-teamed, but Luka makes a heck of a pass, and Ky does what he does. No panic, and he makes a big shot to win.”\n\n\r\n              Doncic scored 30 points for the Mavs, who missed 16 of their 19 shots in the fourth quarter. Dallas led 91-71 entering the fourth against the step-slow Lakers, but promptly missed its first 11 shots while James catalyzed a prolonged surge. \n\n\r\n              “Why would you be upset? You won,” Kidd said. “The game is over, and now we move on to get ready for Thanksgiving. There’s no one upset. It’s a great game against a very talented team.”\n\n\r\n              Los Angeles outscored Dallas 30-13 in the fourth, but couldn't turn it into a win. Anthony Davis had just 10 points and 14 rebounds, going scoreless in the fourth quarter.\n\n\r\n              “We had a shot to win the game,” Davis said. “We got back in it with our defense in the fourth quarter, and (we) made some big-time shots. ... We don't celebrate moral victories, but we're a resilient team that will be fighting 'til the end.”\n\n\r\n              The Lakers missed four free throws down the stretch that could have made it closer.\n\n\r\n              Josh Green scored 15 points for the Mavericks, who won their fourth consecutive road meeting with the Lakers with another offensive barrage by one of the NBA's highest-scoring teams\n\n\r\n              “We’ve put an emphasis on pushing the pace, and we were able to get out to a 20-point lead,” Green said. “They were on a back-to-back, and we knew that.”\n\n\r\n              Austin Reaves scored 17 points and D'Angelo Russell had 15 for the Lakers, who had won six of seven over the past two weeks. Los Angeles lost at home for only the second time in nine games this season.\n\n\r\n              Dallas largely dominated the first three quarters against the step-slow Lakers, who were playing their sixth game in nine days with just nine healthy rotation players.\n\n\r\n              Dereck Lively had to be helped to Dallas' locker room in the third quarter after going down hard under the Mavs' basket. The 7-foot-1 center bruised his lower back on his fall from contact with Davis, the Mavs said.\n\n\r\n              Cam Reddish sat out for the Lakers with groin soreness, joining Jarred Vanderbilt, Gabe Vincent and rookie Jalen Hood-Schifino on the sidelines with injuries.\n\n\r\n              Max Christie had seven in 23 minutes while making his fourth career start in Reddish's place.\n\n\r\n              Dallas' Maxi Kleber missed his seventh straight with a toe injury. When the Mavs visited the Lakers last March, Kleber hit a buzzer-beating 3-pointer to beat Los Angeles 111-110 with Doncic sidelined by injury.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Clippers on Saturday.\n\n\r\n              Lakers: At Cleveland on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995544.98326
}