{
  "game_id": "0021200416",
  "espn_id": "400278136",
  "date": "Dec 26, 2012",
  "matchup": "MEM vs. PHI",
  "headline": "Sixers reject Grizzlies, cut short road skid",
  "body": "MEMPHIS, Tenn. -- Dorell Wright seized the opportunity to step into the starting lineup in place of the injured Jason Richardson and responded with his best scoring performance of the season.\n\nWright scored 28 points and Spencer Hawes had 20, also a season high, and the Philadelphia 76ers snapped a six-game road losing streak with a 99-89 victory over the Memphis Grizzlies on Wednesday night.\n\nRichardson's balky lower back allowed Wright to start his fifth game of the season. He connected on 8 of 11 from the field, part of the Sixers shooting 52 percent. Wright hit 5 of 8 from long range as Philadelphia made nine of its 16 shots outside the arc.\n\n\"It's a lot different,\" Wright said of the starting role. \"That's what I did the last two years (in Golden State). Coming here, that was one of the things I had to sacrifice, coming off the bench. I've been happy with my role. Being able to step up in front for (Richardson) was great. I had the opportunity to make some shots and help the team win. It's always cool whatever job coach (Doug Collins) wants me to do.\"\n\nThaddeus Young and Jrue Holiday had 13 points each for Philadelphia, Holiday adding nine assists. Nick Young finished with 12 points. Hawes blocked five shots, part of Philadelphia's recording a season-high 12 rejections.\n\nZach Randolph led the Grizzlies with 23 points and nine rebounds, while Marc Gasol had 18 points and eight rebounds. Quincy Pondexter scored 13 and Mike Conley had 10 for Memphis, which lost its second straight.\n\nMemphis coach Lionel Hollins said he didn't think his team's effort was \"on par,\" and he didn't find the right combination of players who would run offensive schemes and play with the right intensity until it was too late in the fourth quarter.\n\n\"It's effort. It's effort on defense, and it's effort on offense,\" Hollins said. \"We get the ball, we have to run up the court with some pace. We have to move the ball quickly. We've got too much ball-sticking. We have too much walking.\"\n\nThe Grizzlies played the game without leading scorer Rudy Gay, who was not with the team. Team officials listed his absence as \"personal reasons.\"\n\nThe Sixers held a 16-2 advantage in fast-break points and outrebounded the Grizzlies 38-37, despite Young, who averages a team-best 7.4 rebounds a game, ending the night with only two boards.\n\n\"You know what I was doing most of the night,\" Young said of his two rebounds. \"Just pretty much face-guarding and trying to keep Zach and the other guys off the glass. But it is huge if we can get the rebounds, get out in transition and get easy buckets because (the Grizzlies) thrive off getting boards, offensive rebounds and getting in transition.\"\n\nThe Sixers took control of the game in the early stages of the fourth quarter, when they built the lead to as many as 15 points, enough of a buffer to endure a Memphis rally later in the period.\n\nThe Sixers, who trailed by 10 points in the second quarter, rallied for a 49-47 halftime lead as Wright had 13 points, including 2 of 4 from outside the arc.\n\nPhiladelphia scored the final eight points of the half to erase a six-point Memphis lead.\n\n\"We had the nice finish to go up two at the half,\" Collins said, later adding: \"We made some big shots to give us momentum going into the half, and we took the halftime lead, which I thought was very important.\"\n\nThe real burst came from Hawes entering the game. Gasol had scored 12 first-quarter points against Lavoy Allen. Hawes not only shut down Gasol, but added 11 points, hitting 5 of 7 shots, part of the Sixers connecting at a 50 percent clip in the first half.\n\n\"It was something we knew we needed coming in,\" Hawes said of matching the Grizzlies duo of Randolph and Gasol. \"Playing against a front line like them, that's as good a one-two punch in the frontcourt as you are going to see. They had a little bit of a size, maybe a bit of girth, advantage, but I thought we could match that and counter that with being active and long.\"\n\nCollins said the Sixers knew Memphis was going to pound the ball inside to open the second half, but Philadelphia was able to withstand the Grizzlies' push. The teams remained close though the third period as Wright continued to connect, and the score was tied at 64 after Conley made a 3-pointer for Memphis.\n\nThe Sixers, who were maintaining a 50 percent shooting touch, were able to use a late mini-rally to carry a 75-70 lead into the fourth period.\n\nPhiladelphia extended its lead to 83-73 with consecutive 3-pointers from Royal Ivey and Young and a baseline jumper from Hawes.\n\nMemphis brought the bulk of its starting lineup back at that point, but it didn't stop the Sixers rally. The lead would eventually reach 15 points on Ivey's second 3-pointer of the period with just under 8 minutes to play.\n\n\"We just had no energy,\" Randolph said of the Grizzlies. \"We played hard, but couldn't run anymore. We didn't get stops. ... They had open jump shots all night. It's a combination of them playing well and taking advantage of us.\"\n\nGame notes NASCAR Nationwide series driver Ricky Stenhouse Jr., who lives south of Memphis in Olive Branch, Miss., attended the game and participated in tricycle race with a fan during a first-half timeout. Stenhouse won. ... In three games against the Grizzlies in his career, Evan Turner entered the game with a total of 12 points. He scored one Wednesday night. ... The Sixers' previous high for blocks this season was 11 at Cleveland on Nov. 21. ... The Sixers were playing the second game of an eight-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764993598.568714
}