{
  "game_id": "0022400321",
  "espn_id": "401704887",
  "date": "Dec 04, 2024",
  "matchup": "MIA vs. LAL",
  "headline": "Herro scores 31, Heat roll past LeBron and struggling Lakers 134-93",
  "body": "MIAMI -- — Tyler Herro scored 21 of his 31 points in the third quarter and the Miami Heat set a franchise record for assists in beating the Los Angeles Lakers 134-93 on Wednesday night.\n\n\r\n              The Heat had 42 assists, one more than the previous mark of 41 against Portland on March 29. They tied another franchise record with 24 3-pointers, and the 41-point margin of victory was the third-biggest in team history.\n\n\r\n              Jimmy Butler scored 17 points and Bam Adebayo had 14 points, 10 rebounds and seven assists for the Heat.\n\n\r\n              LeBron James scored 29 points for the Lakers, who have lost six of eight — their last two by a combined 70 points. Rui Hachimura added 14 for the Lakers.\n\n\r\n              Takeaways\r\n              Lakers: James made 12 of 18 shots, snapping a six-game streak of him shooting less than 50%. The last time he had such a streak exceeding six games was his rookie season, 2003-04 (he has streaks of eight and 12 games of shooting below 50% that year).\n\n\r\n              Heat: Miami led by as many as 43 points, by far its biggest lead of the season. The Heat led Washington by 24 points on Nov. 2.\n\n\r\n              Key moment\r\n              More history for James — his 3-pointer with 8:55 left in the third quarter was the 2,451st of his career, breaking a tie with Kyle Korver for No. 7 all-time.\n\n\r\n              Key stat\r\n              Herro had seven 3-pointers in the third quarter, tying the Heat record for any quarter. Duncan Robinson had seven in a second quarter against Cleveland on Nov. 20, 2019. The previous Heat record for a third quarter was six, by now-Lakers guard Gabe Vincent on Jan. 28, 2022.\n\n\r\n              Up next\r\n              The Lakers close their four-game trip Friday in Atlanta. The Heat host Phoenix on Saturday, the second game of a four-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996922.49754
}