{
  "game_id": "0021900737",
  "espn_id": "401161379",
  "date": "Feb 02, 2020",
  "matchup": "DET vs. DEN",
  "headline": "Pistons rally to beat Nuggets 128-123 in OT, snap skid",
  "body": "DETROIT --  It took Detroit just over half a quarter to fall behind by 21. Then the Pistons rallied almost as quickly.\n\n\"We came out as flat as a pancake,\" coach Dwane Casey said. \"But the second group came in and played.\"\n\nBruce Brown had 19 points, 10 rebounds and eight assists, and fellow reserve guard Reggie Jackson scored 20 points to lift the Pistons to a 128-123 overtime victory over the Denver Nuggets on Sunday. Andre Drummond added 21 points and 17 rebounds for Detroit, which snapped a five-game losing streak.\n\nIt was the 400th career double-double for the 26-year-old Drummond. Only Dwight Howard, who was 25, has reached that milestone at a younger age.\n\nNikola Jokic had 39 points, 11 assists and 10 rebounds for Denver.\n\nIt was an impressive day for Detroit's younger players. Brown, who is in his second NBA season, played the most of anyone on the Pistons. Rookie Sekou Doumbouya scored all 17 of his points in the first half to help Detroit dig out of its early hole.\n\nDrummond put the Pistons ahead to stay with a dunk early in overtime, and Brown added a 3-pointer that made it 116-112. Drummond fouled out with 2:43 left, but Detroit was able to hold on.\n\nJokic made a 3-pointer with 29.4 seconds left that made it 126-123, but Thon Maker answered with an alley-oop dunk from Tony Snell at the other end to push the lead to five with 16.5 seconds left.\n\n\"When that last lob went up to Thon, I did hold my breath,\" Casey said. \"Time, score, situation -- but he made it, so it worked out.\"\n\nThe Nuggets were playing for the third time in four days, and the 12:30 p.m. start time -- 10:30 a.m. back in Denver -- made for another potential challenge. The Nuggets looked just fine at the outset, making 16 of their first 20 shots from the field. They led 28-7 and 31-10, but that three-touchdown lead on Super Bowl Sunday didn't last.\n\n\"I was so impressed with the start of the game on both ends of the floor,\" Denver coach Michael Malone said. \"We went to our bench and right when we went to our bench, it was like the bottom fell out.\"\n\nDenver led 44-30 at the end of the first quarter. Detroit rallied in the second, tying the game with a 21-8 run and eventually taking a 68-65 lead into halftime.\n\nIt was tight down the stretch. Jackson missed a runner in the final seconds of regulation with the score tied at 111.\n\nRookie forward Michael Porter Jr. joined the list of injured Denver players, missing the game because of a right ankle problem. The Nuggets are also without Paul Millsap (left knee), Jamal Murray (left ankle) and Mason Plumlee (right foot).\n\nSNAPPED\n\nDerrick Rose's steak of 14 straight games with at least 20 points ended when the Detroit guard exited with a left groin issue. Rose finished with two points in 12:52.\n\n\"Next man up,\" Brown said. \"Everybody has to be ready to play.\"\n\nDEPTH\n\nDetroit's reserves outscored Denver's 62-26. Malik Beasley (12 points) was the only backup for the Nuggets who scored in double figures.\n\n\"I just apologized to (starting forward) Jerami Grant,\" Malone said. \"I played him 45 minutes tonight. That's insane. But guys have to be ready to play and help us and defend, and you can't come in the game and allow three straight blow-bys for layups.\"\n\nTIP-INS\n\nNuggets: Denver had its highest-scoring first quarter of the season, and the 44 points equaled the team's highest total in any quarter. ... It was the 10th triple-double of the season for Jokic and the 38th of his career.\n\nPistons: Luke Kennard (knee) missed the game. ... Snell surpassed 600 3-pointers for his career.\n\nUP NEXT\n\nNuggets: Host Portland on Tuesday night.\n\nPistons: At Memphis on Monday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996266.772265
}