{
  "game_id": "401810109",
  "espn_id": "401810109",
  "date": "Nov 18, 2025",
  "matchup": "POR vs PHX",
  "headline": "Booker scores 19 as the Suns down the Trail Blazers 127-110",
  "body": "PORTLAND, Ore. -- — Devin Booker scored 19 points and the Phoenix Suns pulled away in the second half for a 127-110 victory over the Portland Trail Blazers on Tuesday night. \n\n\r\n              Collin Gillespie added 19 points off the bench for the Suns, who led by as many as 25 after the break. Phoenix coach Jordan Ott rested Booker in the fourth quarter. \n\n\r\n              Shaedon Sharpe had 29 points for the Blazers, who were without Jerami Grant because of an illness. Portland was also missing guard Jrue Holiday for the second straight game because of calf soreness. \n\n\r\n              Rookie center Yang Hansen was back with the Blazers after a stint with the NBA G League Rip City Remix. Yang played his first minutes for Portland since Oct. 29 in the second quarter and drew cheers from the Moda Center crowd when he dunked. \n\n\r\n              The 7-footer from China, the 16th overall pick in the NBA draft, finished with nine points. \n\n\r\n              Phoenix rebounded from a 124-122 loss Sunday to the Atlanta Hawks, who rallied in the final quarter from a 22-point deficit. That defeat snapped a five-game Suns winning streak. \n\n\r\n              Portland, coming off a 1-4 road trip, trailed for much of the first half but stayed within single digits of the Suns until late, when Booker's short basket and free throw put Phoenix in front 64-53. \n\n\r\n              Portland went on an 8-0 run to go into halftime trailing 64-61. But the Suns pulled away in the third quarter, going up 80-63 on Ryan Dunn's dunk. \n\n\r\n              The Blazers made just 10 of 41 attempts from 3-point range (24.4%). Portland has lost three straight and five of six. \n\n\r\n              Dillon Brooks, who finished with 12 points and four assists for the Suns, got his 1,000th career assist in the first half. \n\n\r\n              Up next\r\n              The Suns host the Minnesota Timberwolves on Friday. \n\n\r\n              The Trail Blazers host the Chicago Bulls on Wednesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042651.4875069
}