{
  "game_id": "0022200697",
  "espn_id": "401468852",
  "date": "Jan 21, 2023",
  "matchup": "PHX vs. IND",
  "headline": "Okogie, Bridges lead short-handed Suns past Pacers 112-107",
  "body": "PHOENIX -- — The broad-shouldered Ish Wainright looks as if he should be making plays in the NFL instead of the NBA.\n\n\r\n              For a while, that was the dream.\n\n\r\n              But Wainright's athletic career is back on the basketball court these days, and he used his surprising skill set to help the short-handed Phoenix Suns win their second straight game by beating the Indiana Pacers 112-107 on Saturday night.\n\n\r\n              “Obviously, you need talent in this league,” Suns coach Monty Williams said. “But playing hard, with talent, it's a great combination.”\n\n\r\n              Josh Okogie led the Suns with 24 points and 10 rebounds while Mikal Bridges added 22 points, but it was a couple clutch plays from Wainright during the final possessions iced it.\n\n\r\n              The muscular 6-foot-5, 235-pound forward nailed a corner 3 with 1:10 left to push the Suns up by 107-101 and then added a nifty assist on a pass to Jock Landale for an easy basket — two stellar possessions that kept that feisty Pacers fighting from behind.\n\n\r\n              Indiana had a chance to tie on its final possession, but Buddy Hield missed a rushed 3-pointer with two seconds left. The Pacers lost despite a triple-double from T.J. McConnell, who had 18 points, 12 assists and 10 rebounds.\n\n\r\n              Phoenix and its ragtag roster took an 87-83 lead into the fourth quarter. The Suns were once again missing a big chunk of their staring lineup, including the All-Star backcourt of Chris Paul and Devin Booker. Starting center Deandre Ayton was out with a non-COVID-19 illness.\n\n\r\n              But the Suns are still playing hard and treading water in the Western Conference.\n\n\r\n              “We're holding it down and just building trust,” Wainright said of playing without the team's stars. “They're trusting us, so when they get back, we'll trust them.”\n\n\r\n              Both the Suns and Pacers struggled to score in the fourth quarter.\n\n\r\n              The Suns pushed to a 102-94 lead with 2:49 left but the Pacers scored four points on one possession when Phoenix's Saben Lee was called for a flagrant foul after elbowing Hield in the face. Hield hit both free throws and Bennedict Mathurin made a layup after the Pacers retained possession because of the flagrant foul.\n\n\r\n              The Pacers eventually pulled to 104-101 but Wainright's corner 3 swung the momentum back in the Suns' favor.\n\n\r\n              The Suns won despite shooting 41.8% from the field. The Pacers shot just 37.5%.\n\n\r\n              Indiana was without its leading scorer Tyrese Haliburton, who missed his sixth straight game. The Pacers have lost seven straight.\n\n\r\n              “Getting the next win is going to be challenging,” Pacers coach Rick Carlisle said. “That is how it is in his league.”\n\n\r\n              The Suns had a 59-57 lead at halftime. Bridges led the Suns with 14 points while Bismack Biyombo had 12 points, seven rebounds and three blocks. Mathurin — who played at Arizona in college — scored 12 points for the Pacers and finished with a team-high 23.\n\n\r\n              WAINRIGHT'S JOURNEY\n\n\r\n              Wainright played four seasons of basketball at Baylor before switching to football, where he was a tight end for one season for the Bears.\n\n\r\n              He played well enough on the football field that he earned a tryout with the NFL's Buffalo Bills in 2018, but didn't make the final roster. Then it was back to basketball, and he played in Europe for a couple years before signing a two-way contract with the Suns in 2021.\n\n\r\n              He didn't play much at first, but has slowly earned a bigger role.\n\n\r\n              “It's player development,” Williams said. “But it's also the player committing to the development. You can come in the gym, jack up shots and collect a check, or you can be intentional about it.”\n\n\r\n              MCCONNELL'S TRIPLE DOUBLE\n\n\r\n              McConnell had the third triple-double of his NBA career, grabbing a 10th rebound late in the fourth quarter.\n\n\r\n              “Rebounding is kind of one of those things as a guard, if you are not blocking out, you have to guess where the ball is going,” McConnell said. “Try to chase long rebounds and they kind of came to me tonight. I wasn’t hunting for them they kind of landed in my hands.”\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Haliburton was wearing the jersey of San Francisco 49ers rookie quarterback Brock Purdy while sitting on the bench. Haliburton and Purdy both played in college at Iowa State.\n\n\r\n              Suns: Paul, Booker, Ayton, F Cam Johnson, G Cam Payne and G Landry Shamet were all out. ... Honored the 1992-93 Suns team that won the Western Conference championship. They lost to the Bulls in the NBA Finals in six games. Several players were in attendance, including 11-time All-Star Charles Barkley, who was MVP that season. ... Hosted their 49th straight sellout crowd.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Chicago on Tuesday night.\n\n\r\n              Suns: Host Memphis on Sunday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995111.364874
}