{
  "game_id": "0021800129",
  "espn_id": "401070810",
  "date": "Nov 03, 2018",
  "matchup": "CHI vs. HOU",
  "headline": "James Harden turns it on in second half as Rockets win second straight",
  "body": "CHICAGO -- James Harden wasn't quite back in MVP form, yet he was good enough when the Houston Rockets needed him.\nHarden scored 25 points, including 11 in a decisive run in the third quarter in his return to the Houston lineup, and the Rockets defeated the Chicago Bulls 96-88 on Saturday night.\nHarden, the NBA's reigning MVP, had missed three games with a strained left hamstring. He connected for 11 straight points, including three 3-pointers, in a span of 1 minute, 59 seconds in the third as the Rockets went on a 15-0 run.\n\"Just playing in a full game, contact and all that, felt like it's been a minute,\" Harden said. \"So I just wanted to get out there and just try to be myself.\n\"I think I did a pretty good job of that. Too many turnovers [eight], but once I get my flow back in rhythm, those will [decrease].\"\nHarden also had seven assists, and guard Chris Paul has no doubts Harden be his old self before long.\n\"It was good to see James get going in his first game back,\" Paul said. \"For us, it's about building.\"\nCarmelo Anthony had 17 points and James Ennis added 15 despite just over 17 minutes of playing time as the Rockets won their second game in two nights after starting the season 1-5.\nChicago led 59-58 midway through the third quarter before the Rockets and Harden went ahead for good, outscoring the Bulls 21-7 in the period.\nZach LaVine led Chicago with 21 points, and Wendell Carter Jr. had 14 points and 13 rebounds. Jabari Parker added 15 points as the Bulls lost their fourth consecutive game -- going 0-4 in the homestand -- and dropped their fifth straight to the Rockets.\nHouston opened a 17-point lead in the fourth quarter. Chicago narrowed it to five points with 4:01 left using a 12-2 run and capitalizing on stretch of cold shooting by Houston.\n\"We shut it down, and once you shut it down you can't turn it back on,\" Rockets coach Mike D'Antoni said.\n\"We had one bad quarter and unfortunately it was a really bad third quarter,\" Bulls coach Fred Hoiberg said. \"We were settling for shots. In fourth quarter, we got back in it by attacking the rim and getting to the free throw line.\"\nThe Bulls finished with 19 turnovers, including what Hoiberg called \"mindless\" ones down the stretch, to blunt their late comeback.\nHarden began slowly in his return to the starting lineup. He didn't score until completing a driving layup with 3:55 left in the second quarter. Then he hit back-to-back 3s and had 10 points at the half.\nHarden suffered the hamstring injury near the end of the loss to Utah on Oct. 24, and Houston was routed in the next two games. The Rockets beat the Nets in Brooklyn 119-111 on Friday as Harden got an extra day of rest.\nGuard Eric Gordon was held out of Saturday's game with abductor strain, suffered at Brooklyn.\nThe Bulls held their own with the Rockets in a see-saw, open first half and led 56-54 at intermission. Neither team had more than a five-point lead in the first half.\nEnnis, in his second game back after missing three with a strained right hamstring, led all scorers with 13 points at the half. Parker had 11 for Chicago.\nENNIS THE (POTENTIAL) MENACE\nD'Antoni praised Ennis' effort and thinks the 28-year-old forward will only improve as his hamstring gets stronger. \"The guy can play,\" D'Antoni said. \"He's been hampered by the hamstring since the first game. But 15 points in 17 minutes [17:18] and the energy he gives you ... he's going to be really good.\"\nTIP-INS\nRockets: Before the game D'Antoni didn't have details of Gordon's injury, but thought the guard, who has averaged 15 points through seven games, would be out day-to-day. \"Now we get James back, but we lose Eric,\" D'Antoni said, while noting injuries to top players have taxed other Rockets who aren't used to as much playing time. ... D'Antoni's voice was raspy and barely audible before Saturday's game. He attributed it to his team pulling out its second victory of the season at Brooklyn on Friday. \"I celebrated last night and lost my voice,\" D'Antoni said \"We won a game.\"\nBulls: Hoiberg expects his injury-depleted team will soon get a boost from the return of F Lauri Markkanen (right elbow sprain) and G Denzel Valentine (left ankle sprain), but still doesn't have an exact timetable. \"Denzel will continue to ramp up his activity in the next couple days, and Lauri is doing a little bit more still,\" Hoiberg said, adding that Markkanen might be ready to \"get on floor\" in about a week. ... Hoiberg said Bobby Portis (right knee sprain) and Kris Dunn (left knee sprain) \"are still a ways away.\"\nUP NEXT\nRockets: At Indiana on Monday in third game of a five-game trip.\nBulls: At the New York Knicks on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994849.901592
}