{
  "game_id": "0022400440",
  "espn_id": "401705006",
  "date": "Dec 29, 2024",
  "matchup": "OKC vs. MEM",
  "headline": "Thunder rout short-handed Grizzlies 130-106 for their 11th straight victory",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 35 points and the Oklahoma City Thunder won their 11th straight game, beating the short-handed Memphis Grizzlies 130-106 on Sunday night in a matchup of Western Conference leaders that turned lopsided before halftime.\n\n\r\n              Rookie Ajay Mitchell scored 17 points, Aaron Wiggins contributed 16 and Jalen Williams added 14 points and 10 rebounds for the Thunder (26-5), who opened a five-game lead over second-place Memphis. \n\n\r\n              Gilgeous-Alexander made 14 of 19 shots to go along with seven assists, six rebounds and a team-high four blocks. He sat most of the fourth quarter. Oklahoma City blocked nine shots, including three by center Isaiah Hartenstein.\n\n\r\n              The Thunder led 76-50 at halftime behind 23 points from Gilgeous-Alexander and 12 each from Mitchell and Kenrich Williams, who combined to go 5 for 7 on 3-point shots. Oklahoma City outscored the Grizzlies 42-19 in the second quarter to take control.\n\n\r\n              Desmond Bane had 22 points and nine rebounds for Memphis (22-11), which played without star Ja Morant (shoulder) and Zach Edey, the team’s No. 9 overall draft pick, who was in concussion protocol. Jay Huff added 17 points but Jaren Jackson Jr., the team's leading scorer at 21.9 points per game, managed 13 points on 3-of-17 shooting.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis jumped out to a 9-0 lead but struggled to score after that, making 37 of 97 shots from the field (38.1%) and 14 of 51 from 3-point range (27.5%).\n\n\r\n              Thunder: Oklahoma City lost the rebound battle 51-46, but outscored the Grizzlies 56-36 in the paint.\n\n\r\n              Key moment\r\n              Memphis pulled within 42-36 on a jumper by Jackson, but Oklahoma City went on a 32-9 run to extend the lead to 74-45 and put the game out of reach before halftime.\n\n\r\n              Key stat\r\n              Oklahoma City converted 21 Memphis turnovers into 33 points.\n\n\r\n              Up next\r\n              Grizzlies: Visit Phoenix on Tuesday night.\n\n\r\n              Thunder: Host Minnesota on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997514.436704
}