{
  "game_id": "0022400965",
  "espn_id": "401705531",
  "date": "Mar 14, 2025",
  "matchup": "DEN vs. LAL",
  "headline": "Jamal Murray's clutch 3-pointer helps Nuggets hold off short-handed Lakers 131-126",
  "body": "DENVER -- — Jamal Murray sank a 3-pointer with 5.6 seconds left and Russell Westbrook stole the inbounds pass for a exclamation-point dunk as the Denver Nuggets rebuffed the scrappy, short-handed Los Angeles Lakers 131-126 on Friday night.\n\n\r\n              Murray finished with 26 points and while the win was something to celebrate, there were enough red flags for coach Michael Malone to crumple up the stat sheet as he sat down for his postgame news conference.\n\n\r\n              Austin Reaves scored 37 points and Dalton Knecht added 32 for the Lakers, whose lengthy list of injured players included LeBron James and Luka Doncic, who was ruled out on the second night of back-to-back games because of left calf injury management and a right ankle sprain.\n\n\r\n              James missed his third straight game with a left groin strain and returned to Los Angeles along with Rui Hachimura (left patellar tendinopathy) and Jaxson Hayes (bruised right knee) ahead of the Lakers’ game in Denver. Also, Dorian Finney-Smith and Gabe Vincent sat out to rest left ankle injuries.\n\n\r\n              James’ son, Bronny, scored five points after being recalled from the G League.\n\n\r\n              The Lakers lost their fourth straight despite a furious second-half rally that saw them take a 126-123 lead with 52 seconds remaining.\n\n\r\n              Nikola Jokic, who scored 28, tied it with a three-point play and Reaves misfired from 15 feet before Murray buried the 3 thanks to a screen from Jokic that blocked two defenders.\n\n\r\n              Takeaways\r\n              Lakers: Despite feeling under the weather, Bronny James played 16 minutes. \n\n\r\n              Nuggets: Denver's inability to pull away from a short-handed bunch could be cause for concern for a team jockeying for playoff position.\n\n\r\n              Key moment\r\n              The Lakers were about to get blown out but used a 19-9 run to close the third quarter and cut a 13-point deficit to 102-99. \n\n\r\n              Key stat\r\n              The Nuggets were 21 of 25 from the free throw line before halftime. The Lakers only shot seven free throws in the first half and made six.\n\n\r\n              Up next\r\n              The Lakers host Phoenix on Sunday. The Nuggets host Washington on Saturday night, their fifth game in seven days.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998340.339905
}