{
  "game_id": "0021500165",
  "espn_id": "400828052",
  "date": "Nov 18, 2015",
  "matchup": "CHA vs. BKN",
  "headline": "Batum's 24 points lead Hornets over Nets, 116-111",
  "body": "CHARLOTTE, N.C. --  Nicolas Batum returned to form and the Charlotte Hornets returned to their winning ways.\n\nThe Hornets' leading scorer bounced back from a 1-of-9 shooting night to score 24 points and hand out eight assists, leading Charlotte to a 116-111 victory over the Brooklyn Nets on Wednesday night.\n\nBatum was 7 of 12 from the field and made all seven foul shots.\n\nBatum had been hot before a 102-94 loss to the Knicks on Tuesday night. He won Eastern Conference player of the week honors after averaging 25.5 points per game last week.\n\n\"I tried to score and I tried to get my teammates involved and everything seemed to work better than (Tuesday) night,\" Batum said.\n\nAl Jefferson and Kemba Walker chipped in with 18 points apiece for the Hornets, who have won six of their last nine games to get back to .500 on the season.\n\nMarvin Williams scored 14 points and Jeremy Lin had 13 points and off the bench for the Hornets (6-6).\n\nThe Hornets shot 11 of 25 from 3-point range to overcome 16 turnovers.\n\n\"Nic Batum is such a good playmaker as well as a scorer,\" said Nets coach Lionel Hollins. \"He was making plays at the basket and when we had to help he got the ball back out to the 3-point line and they made them. \"\n\nThaddeus Young had 27 points on 11-of-17 shooting for the struggling Nets. Brook Lopez added 23 points and Jarrett Jack and Joe Johnson each had 16 for Brooklyn.\n\nThe Nets had several chances in the final two minutes, but failed to take advantage of two Charlotte turnovers.\n\nBrooklyn ruined a golden opportunity to make it a one-possession game with two minutes left when Young missed an easy follow shot.\n\nLin turned the ball over with 33 seconds left, but Lopez missed a short jumper.\n\nA few seconds later Batum made an errant pass over the head of 7-foot center Spencer Hawes and out of bounds, but again the Nets failed to take advantage as Lopez was called for an illegal screen at midcourt.\n\n\"It could be a little fatigue, but there are no excuses for missed opportunities,\" Young said of the Nets' miscues. \"We had every chance to win that game and it slipped by us.\"\n\nSECOND GUESSING\n\nHollins said after the game he was still kicking himself for calling timeout after a Nets rebound with 31 seconds left and his team down by four points. In hindsight, he wished he'd allowed point guard Jarrett Jack to bring the ball up the floor.\n\n\"I should have just let him and maybe we would have gotten a two-for-one anyways,\" Hollins said. \"We wound up not getting as good of a shot that we wanted.\"\n\nWINNING ON THE GLASS\n\nWalker and Lin, Charlotte's two point guards, combined for 16 rebounds as the Hornets outrebounded the Nets 49-37. Rebounding has been a major area of concern for coach Steve Clifford this season.\n\n\"We can't give up 20 second-chance points, 18 second-chance points and win,\" Clifford said. \"It's something we're going to have to do.\"\n\nFRANK THE TANK\n\nRookie Frank Kaminsky had a career-high 11 points on 4-of-6 shooting from the field. He saw more playing because starter Cody Zeller was having a particularly four outing. Zeller was held scoreless in 13 minutes of action.\n\nTIP-INS\n\nNets: Lopez has scored 15 or more points 10 times this season along with five 20-point games. ... Johnson had three 3-pointers but the Nets were just 5 of 15 from beyond the arc. ... The Nets had a season-low nine turnovers.\n\nHornets: Walker's three 3-point field goals were a season high. .. The Hornets were 27 of 36 from the foul line.\n\nUP NEXT\n\nNets: Visit Boston on Friday night.\n\nHornets: Host Philadelphia on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994410.3414872
}