{
  "game_id": "0022200551",
  "espn_id": "401468706",
  "date": "Jan 02, 2023",
  "matchup": "CHA vs. LAL",
  "headline": "James pours in 43 as Lakers hold off Hornets, 121-115",
  "body": "CHARLOTTE, N.C. -- — LeBron James is taking giant leaps lately toward breaking Kareem Abdul-Jabbar's career scoring mark.\n\n\r\n              James scored 43 points to pull within 500 of the NBA record, and the Los Angeles Lakers avenged last month’s home loss to the Charlotte Hornets with a 121-115 victory Monday night.\n\n\r\n              James had two dunks on alley-oops, including a high-flying, reverse windmill slam off a feed from Dennis Schroder, to push his career total to 37,903 points. That left him 484 behind Abdul-Jabbar’s long-standing record of 38,387.\n\n\r\n              Thomas Bryant had 18 points and 15 rebounds, and Austin Reaves and Schroder each had 15 points as the Lakers (16-21) finished a 3-2 road trip.\n\n\r\n              “We just had the mindset of wanting to close out this trip the right way,” James said.\n\n\r\n              Terry Rozier had 27 points to lead the Hornets, who have lost 13 of their last 16 games. LaMelo Ball added 24 points and Mason Plumlee had 18 points and 14 rebounds for Charlotte.\n\n\r\n              The Hornets (10-28) beat the Lakers 134-130 on Dec. 23. \n\n\r\n              James, battling ankle soreness, was on his game in this one, adding 11 rebounds and six assists to improve to 47-7 against owner Michael Jordan's Hornets.\n\n\r\n              James picked up where he left off in December, when he averaged 31.2 points over 14 games, including a 47-point effort Friday night on his 38th birthday against the Atlanta Hawks.\n\n\r\n              He was 16 of 26 from the field Monday and had 23 points in the second half.\n\n\r\n              Lakers coach Darvin Ham called it “just another magnificent night” for James.\n\n\r\n              “I just think he is taking his time and really looking at what the defense is trying to do to him,” Ham said. “There were times where he had to be a willing passer and he was just that. If he was going to attack them downhill, making his 3 ball, getting out and running in transition. There was a variety of ways he is on the attack and again, they had a couple of possessions where they were trying to blitz him. He's finding the open man and making plays for other guys, and it forces the defense to play behind us.”\n\n\r\n              The Lakers used a 14-0 run to open the second quarter and build a 15-point halftime lead. James began to take over in the third, scoring on drives, dunks and mid-range jumpers — he was 0 for 5 from 3-point range — while helping the Lakers push their lead to 24.\n\n\r\n              James wouldn't say if the dunk was one of the best of his career, but it sure brought the Spectrum Center crowd — packed with Lakers fans — to its feet.\n\n\r\n              “It's always good to get out on the break,” James said. “The pass always makes the great highlights and I was able to bring it home in fashion.”\n\n\r\n              The Hornets got a huge spark late from Rozier, who had 17 points in the fourth quarter, to cut the margin to 117-113 in the final minute. But then James made four free throws down the stretch to help seal the victory.\n\n\r\n              Rozier said the Hornets need to start quicker.\n\n\r\n              “We’re playing against the best players in the world and you can’t just turn it on whenever you want to,” he said. \"We’ve got a lot of talent, but we’re not disciplined and stuff like that. It kind of puts us on the back burner, so we’ve got to clean it up from the beginning and play with that toughness, that edginess from the beginning, and can’t wait.” \n\n\r\n              HAYWARD INJURED AGAIN\n\n\r\n              Gordon Hayward, who has struggled all season and missed games with a shoulder injury, exited in the second half with a left hamstring injury. His status is expected to be updated on Tuesday.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Outrebounded the Hornets 53-47.\n\n\r\n              Hornets: Dennis Smith Jr. returned from an ankle injury that had kept him out since Nov. 23. At one point he tried to dunk over James, but the ball slipped out of his hands. James was still called for a foul. ... Ball picked up a technical foul for arguing a call while seated on the bench.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Return home to host Miami on Wednesday night.\n\n\r\n              Hornets: Complete a four-game homestand against Memphis on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994270.261299
}