{
  "game_id": "0021600370",
  "espn_id": "400899812",
  "date": "Dec 13, 2016",
  "matchup": "CHI vs. MIN",
  "headline": "Timberwolves beat Bulls 99-94 in Thibodeau's Chicago return",
  "body": "CHICAGO -- Minnesota coach Tom Thibodeau got a loud ovation during pregame introductions before his first game back in Chicago, and his Timberwolves made it a triumphant return.\nZach LaVine scored 24 points, Andrew Wiggins added 23 and Minnesota rallied to beat the Bulls 99-94 on Tuesday night.\nThe Timberwolves wiped out a 21-point deficit and got Thibodeau a victory in his first game in Chicago since the Bulls fired him in an acrimonious split in 2015.\n\"There were far more great times than there were real problem times,\" Thibodeau said. \"In the end, it didn't end great, but most of the time things were good. I'm proud of what our team did. I loved being here and that's how I look at it.\"\nGorgui Dieng and Karl-Anthony Towns each scored 16 points, and the Timberwolves snapped a four-game losing streak.\nJimmy Butler led Chicago with 27 points, and Robin Lopez added 14. But the Bulls continued a pattern of letdowns against losing teams, this time falling to one that came in tied for the NBA's worst record. And, of course, they lost to their former coach.\n\"There wasn't really any emotions, it was just about trying to get a win,\" Chicago's Taj Gibson said. \"Trying to keep them down. That's a struggling team.\"\nThat wasn't what the Timberwolves expected when they hired Thibodeau. After all, the Bulls went 255-139 and made the playoffs in all five of his seasons, including a run to the 2011 Eastern Conference finals with MVP Derrick Rose leading the way.\n\"I know what these guys are doing in there,\" Thibodeau said. \"I know what I'm doing in there. And that's all that matters. If we're doing each and everything you can do every day, that's all that matter.\"\nBIG RALLY\nThe Timberwolves looked like they were going to get blown out, down 38-22 after the first quarter and trailing by 21 in the second. Instead, they closed the half on a 22-5 run to pull within four.\nMinnesota was leading 91-87 in the game's closing minutes when Butler threw down an alley-oop dunk off a feed from Dwyane Wade in transition and nailed a fadeaway jumper off a steal to tie it with 1:34 remaining.\nWiggins then hit a pullup jumper and LaVine scored on a reverse layup to make it 95-91 with 52 seconds left.\nWade picked up two technical fouls and was ejected with 14.1 seconds left after his driving layup was blocked by LaVine. Butler also got called for a foul on the play.\nIt all led to Ricky Rubio hitting two technical free throws and LaVine making two foul shots to make it 99-91, sealing the win for Minnesota.\n\"It was frustration and I told the truth, so I got kicked out,\" Wade said.\nQUOTABLE\n\"I feel like we're good enough to have those results. We've been in every game. We were winning or really close throughout almost every game that we've played, so it shows that record could be flipped. There are a lot of games we should have won.\" -- LaVine on the Timberwolves' expectations.\nTIP-INS\nTimberwolves: The Timberwolves had allowed at least 100 points in nine straight games. ... The 38 points were the most the Timberwolves allowed in the first quarter this season. That also matched a season high for any quarter. ... Nemanja Bjelica played nine minutes after missing the previous two games because of a sore right ankle.\nBulls: Chicago is 5-6 against teams with losing records. ... G Rajon Rondo sat out the game because of a sprained right ankle after landing awkwardly near the end of practice on Monday. ... Coach Fred Hoiberg said G Michael Carter-Williams has a \"pretty important\" doctor's appointment on Friday that could determine if he returns from left wrist and left knee injuries next week. He has been sidelined since Oct. 31.\nUP NEXT\nTimberwolves: Host Houston on Saturday.\nBulls: Visit Milwaukee on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764995080.858328
}