{
  "game_id": "0021901251",
  "espn_id": "401224726",
  "date": "Aug 03, 2020",
  "matchup": "OKC vs. DEN",
  "headline": "Porter, Jokic lead Nuggets past Thunder, 121-113 in OT",
  "body": "LAKE BUENA VISTA, Fla. --  Michael Porter Jr. scored a career-high 37 points and Nikola Jokic had a triple-double to help the Denver Nuggets top the Oklahoma City Thunder 121-113 in overtime on Monday.\n\nPorter, who averages just 7.5 points, had the big performance in only his third start of the season.\n\n\"He has got tremendous size, length, he can score the ball, he's got soft touch and he does so (scores) in a very efficient manner,\" Denver coach Michael Malone said. \"He can also rebound at a very high level. Tonight, we saw all those things put together.\"\n\nPorter made 12 of 16 shots and grabbed 12 rebounds. His previous career high was 25 points.\n\n\"All I've got to focus on is bringing the energy and the effort, lock in on defense and the rest will take care of itself,\" Porter said.\n\nJokic had 30 points, 12 rebounds and 10 assists. He scored 13 points in the fourth quarter and overtime to help Denver strengthen its hold on third place in the Western Conference standings.\n\nIt was a key win for the Nuggets, who were missing three starters. Jamal Murray sat out with left hamstring tightness, forward Will Barton sat out with left knee soreness and guard Gary Harris sat out with a strained right hip.\n\nShai Gilgeous-Alexander scored 24 points, Chris Paul had 23 and Danilo Gallinari added 20 for the Thunder, who also were short-handed. Thunder coach Billy Donovan said Dennis Schroder, Oklahoma City's No. 3 scorer for the season, left the bubble to join his wife for the birth of their second child.\n\nThe game was close throughout. Denver's Monte Morris was fouled with 6 seconds remaining, and he made both free throws to give the Nuggets a 109-108 lead. Paul missed the first and made the second of two free throws with 2.9 seconds remaining to tie the game at 109. Denver's Troy Daniels missed a floater from near the free throw line at the buzzer, and the game went to overtime.\n\nIn the extra period, Denver outscored Oklahoma City 12-4 and held the Thunder to one field goal.\n\n\"In the overtime, I thought we played terrific on both ends of the floor,\" Malone said.\n\nTIP-INS\n\nNuggets: Morris and Paul Millsap each scored 17 points. ... Former Thunder player Jerami Grant scored two points in 33 minutes.\n\nThunder: Donovan and Milwaukee Bucks coach Mike Budenholzer were voted co-winners of the NBCA Coach of the Year Award on Monday. ... G Terrance Ferguson sat out with a right lower leg bruise. ... Thunder C Mike Muscala left the game in the first quarter after hitting his face on the floor following an offensive foul by PJ Dozier and did not return.\n\nQUOTABLE\n\nMalone on Jokic taking over late: \"He's the best center in the NBA, and when he's aggressive, good things happen.\"\n\nSTAT LINES\n\nOutscored the Thunder 30-24 at the free throw line. The game included 61 fouls and 70 free-throw attempts.\n\nUP NEXT\n\nNuggets: Play the San Antonio Spurs on Wednesday.\n\nThunder: Play the Los Angeles Lakers on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996193.184403
}