{
  "game_id": "0021600066",
  "espn_id": "400899516",
  "date": "Nov 03, 2016",
  "matchup": "MIL vs. IND",
  "headline": "Antetokounmpo, Parker lead Bucks to 125-107 win over Pacers",
  "body": "MILWAUKEE --  Milwaukee Bucks head coach Jason Kidd needed plenty of superlatives to describe Thursday night's victory.\n\nGiannis Antetokounmpo and Jabari Parker had 27 points each to lead the Bucks past the Indiana Pacers 125-107.\n\n\"You could see right off the bat they were ready,\" Kidd said of the dynamic duo. \"They took good shots. They shared the ball. If they had an open shot, they took it. If not, they got off of it. They made good, quick decisions. When you do that, you're going to score a lot of points.\"\n\nKidd has turned the offense over to Antetokounmpo, and the 6-foot-11, 222-pound guard has responded. He had nine assists and seven rebounds and his running mate, Parker, made a career-high four 3-pointers and grabbed eight rebounds.\n\nKidd also got production out of Greg Monroe, who added 16 points, 16 rebounds and six assists, and Tony Snell, the newcomer acquired from the Chicago Bulls for Michael Carter-Williams, had 14 points, including a 3 at the buzzer that gave Milwaukee a 63-57 lead at halftime.\n\n\"Everybody was great,\" Kidd said. \"Everybody who participated did their job and stayed in character. It was a great team win against a talented, well-coached team.\"\n\nPaul George scored 23 points, reserve C.J. Miles added 19, Jeff Teague had 16 and Myles Turner 15, but it wasn't enough as the Pacers slipped to 0-3 on the road.\n\nWhen Parker hit from in close and then from beyond the arc to open the fourth quarter, it looked like the Bucks would coast to their third win of the season.\n\nIndiana had other ideas and closed with a flurry led by George who hit a 3-pointer with 9:28 to go, cutting the deficit to 95-82. When Turner made two free throws and Thaddeus Young hit a basket, the Bucks' lead was nine.\n\nAfter a steal by Monta Ellis who dished to George for another basket, the Pacers trailed by seven with 4:11 to play, but that was as close as they got. Snell hit a 3-pointer, Miles Plumlee dunked and Antetokounmpo scored in traffic to push the lead to 14 points and the Bucks regained control of the game.\n\nGeorge was not happy with the outcome, despite coming close down the stretch.\n\n\"I'm real frustrated,\" he said. \"I know how good we could be. I know how good we were. We're nowhere close to it. It's embarrassing the way we're playing and we look on the floor right now.\"\n\nMiles agreed with his teammate's assessment.\n\n\"We're not tied together, man,\" he said. \"You can see it. You can see it. We're not showing no spirit, no heart. You don't see guys getting excited about anything.\"\n\nParker sparked the Bucks with nine points as Milwaukee opened the third quarter with some energy, attacked the boards on both ends and pulled away to a 74-61 lead. Parker hit a 3, two driving dunks and a putback before George stopped the surge with a wide-open 3-pointer with 7:03 left in the quarter. But the Bucks were off and running again, building the lead to as many as 17.\n\n\"You look at what Jabari did tonight, catch-and-shoot, making plays for his teammates,\" Kidd said. \"He scored. He made the extra pass. That's his game. He's the total package.\"\n\nMalcom Brogdon, the Bucks' second-round draft pick from Virginia, scored 12 points, including two free throws that pushed the margin to 90-73 with seconds left in the third.\n\nTIP-INS\n\nPacers: G Rodney Stuckey missed his third consecutive game with a right hamstring strain. ... The Pacers took three of four from the Bucks last season. Indiana's 37-point win on Nov. 21 was the Pacers' largest win and Milwaukee's largest loss in 2015-16.\n\nBucks: Coming into Thursday's game, Antetokounmpo is the only NBA player averaging over 23 points, 9 rebounds, 5 assists and 2 blocks per game. ... F Steve Novak has yet to play in a game.\n\nWE OWN THE PAINT\n\nThe Bucks came into the game tied with Oklahoma City for second in the NBA in points in the paint (53.5) behind only the Washington Wizards (56.7). Milwaukee recorded 62 points in the paint against the Pacers who had 42.\n\nNOT VERY PRETTY\n\nThe Pacers had 21 turnovers which the Bucks turned into 34 points. Milwaukee returned the favor by making 22 miscues which Indiana converted into 26 points.\n\nUP NEXT\n\nPacers: On Saturday, they look for payback against the Bulls who beat them 118-101 on Oct. 29 in Chicago.\n\nBucks: On Saturday, they host the Sacramento Kings who took the two-game series last season.",
  "source": "espn_api",
  "crawled_at": 1764995229.574566
}