{
  "game_id": "0022200610",
  "espn_id": "401468765",
  "date": "Jan 09, 2023",
  "matchup": "ORL @ SAC",
  "headline": "Harrison Barnes scores 30, Kings blowout Magic 136-111",
  "body": "SACRAMENTO, Calif. -- — Harrison Barnes scored a season-high 30 points and the Sacramento Kings hit a franchise record 23 3-pointers to beat the Orlando Magic 136-111 Monday night.\n\n\r\n              “I thought offensively tonight, but really this whole season, we feel confident about what we can do,” Barnes said. “The biggest thing tonight was walking out of here with a win.”\n\n\r\n              Sacramento (21-18) started the new year with a 1/3 record, with losses to the Memphis Grizzlies, Atlanta Hawks and Los Angeles Lakers. \n\n\r\n              \"We got to defend if we expect to get where we want to go and it starts with protecting the paint and spraying out to shooters,\" Kings coach Mike Brown said. \"I’m just excited about what our guys did protecting that paint tonight.”\n\n\r\n              Domantas Sabonis extended his double-double streak to 17 games and finished with 12 points, 10 rebounds and eight assists. Sabonis leads the NBA in double-doubles this season with 30.\n\n\r\n              Rookie Keegan Murray finished with 15 points, knocking down five 3-pointers.\n\n\r\n              Paolo Banchero scored 17 points for Orlando (15-26). The Magic have lost five of their last seven games.\n\n\r\n              \"You have to give them credit, they came out and kicked our tails,” Orlando Magic coach Jamahl Mosley said.\n\n\r\n              Franz Wagner finished with 16 points and Wendell Carter Jr. added 15 points and seven rebounds.\n\n\r\n              “We made a little run to come back,” Magic guard Markelle Fultz said. “It’s hard to come back from that deficit.”\n\n\r\n              TIP-INS\n\n\r\n              Magic: F Bol Bol missed his fourth consecutive game. He cleared the league’s health and safety protocols and is expected to rejoin the Magic on Tuesday.\n\n\r\n              Kings: G Malik Monk returned after a one game absence due to a calf injury and scored 14 points with seven rebounds and six assists. Monk received a technical foul with 7.8 seconds left in the third quarter. … The Kings bench outscored Orlando 54-39.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Travel to Portland to face the Trail Blazers on Tuesday.\n\n\r\n              Kings: Host Houston on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994632.455487
}