{
  "game_id": "0022400432",
  "espn_id": "401704998",
  "date": "Dec 28, 2024",
  "matchup": "DEN vs. DET",
  "headline": "Jokic has 37, Murray scores 34 and Nuggets beat Pistons, 134-121",
  "body": "DENVER -- — Nikola Jokic had 37 points, Jamal Murray scored 21 of his 34 points in a decisive third period, and the Denver Nuggets survived Detroit's fourth-quarter rally to beat the Pistons 134-121 on Saturday night.\n\n\r\n              Michael Porter Jr. finished with 26 points for Denver, which used an 18-4 run to take the lead for good at halftime and then opened a 25-point lead heading into the fourth. Murray scored 12 points in the final 2:27 of the period to give him his first 30-point game of the season.\n\n\r\n              Cade Cunningham and Jaden Ivey scored 17 points each to lead Detroit.\n\n\r\n              With the starters on the bench in the fourth quarter, the Pistons cut a 25-point deficit to 10 and forced Denver coach Michael Malone to put his starters back in. Ronald Holland’s 3-pointer made it 128-121 with 2:35 left but Jokic closed it out with six straight points.\n\n\r\n              Takeaways\r\n              Pistons: It was a tough end to a road trip but it is hard to be disappointed with the four-game set. Detroit beat Phoenix, the Los Angeles Lakers and Sacramento to start the trip before falling to a motivated Denver team.\n\n\r\n              Nuggets: They tightened up their defense after allowing 149 points to Cleveland on Friday night. The Cavaliers had 80 points at halftime but Denver held the Pistons to 61 at the break.\n\n\r\n              Key moment\r\n              Russell Westbrook was called for an offensive foul with 4:44 left in the third quarter but immediately drew one on Cunningham on the inbounds play. The play energized the Nuggets, who finished the quarter on a 22-8 run.\n\n\r\n              Key stat\r\n              Denver is now 6-0 on the second game of a back-to-back and 2-4 on the front end.\n\n\r\n              Up next\r\n              The Pistons open a four-game homestand against Orlando on Wednesday night while the Nuggets travel to Utah on Monday night.\n\n\r\n              ------\n\n\r\n              AP NHL: https://www.apnews.com/hub/NHL",
  "source": "espn_api",
  "crawled_at": 1764998349.8921049
}