{
  "game_id": "0022300239",
  "espn_id": "401584867",
  "date": "Nov 25, 2023",
  "matchup": "PHI @ OKC",
  "headline": "Embiid has 35 points, 11 rebounds and nine assists as 76ers beat Thunder 127-123",
  "body": "OKLAHOMA CITY -- — NBA scoring leader Joel Embiid just missed what would have been Philadelphia’s first triple-double of the season with 35 points, 11 rebounds and nine assists, and the 76ers ended the Oklahoma City Thunder’s six-game winning streak with a 127-123 victory on Saturday.\n\n\r\n              Embiid made 19 of 21 free throws, including six in the final 9.8 seconds to seal the win after the 76ers' nine-point lead with 49 seconds left was cut to two.\n\n\r\n              Tyrese Maxey added 28 points and eight rebounds, and Tobias Harris scored 16 points for the 76ers, who moved to 11-5, the same as the Thunder. Philadelphia rode a sizable advantage at the free throw line, making 37 of 45 attempts compared to 21 of 26 for Oklahoma City. “Everybody is watching games around the league this year and there’s a lot of finishes that are what you would consider wild ones. It’s almost the norm now,” Philadelphia coach Nick Nurse said. “You’ve really got to finish. There’s no time to relax and not execute. … We’ve got to clean it up. If you want to be a really good team, you’ve don’t need that kind of stuff.” Rookie Chet Holmgren led Oklahoma City with 33 points. Shai Gilgeous-Alexander, like Embiid a first-team All-NBA selection last season, scored 31. Oklahoma City has lost four straight home games to the 76ers. With 49 seconds left, Embiid fell to the ground awkwardly and grabbled his left ankle, but he quickly rose under his own power and stayed in the game. He had missed the 76ers’ most recent game, a loss to Minnesota, with left hip soreness. Thunder guard Josh Giddey finished with 10 points, seven rebounds and eight assists. He started despite an investigation by the NBA into accusations he had an  improper relationship with an underage girl. The allegations came in a since-deleted social media post by an anonymous user from an account that’s since been deactivated.\n\n\r\n              Thunder coach Mark Daigneault said before the game “it’s not even a decision” about playing Giddey and called the NBA investigation “a league matter.” The 21-year-old Giddey received mostly cheers from the home crowd at Paycom Center during pregame introductions and after each of his baskets.\n\n\r\n              Giddey declined to comment on the situation Friday. In a game with 12 lead changes, Philadelphia seized control with an 18-5 run in the third quarter that included 3-pointers from Maxey, Nicolas Batum and Harris. A short jumper by Embiid put the 76ers ahead 93-80 with 55 seconds left in the quarter.\n\n\r\n              “They delivered,” Daigneault said of the 76ers. “They made some plays. They made some shots. I thought we had a couple of self-inflicted mistakes and unforced errors on our part.” The 76ers jumped to a 16-5 lead as Oklahoma City made only two of its first eight shots, but the Thunder steadily closed the gap and led 31-29 by the end of the first quarter. Philadelphia was up 65-61 at halftime. Holmgren made a career-high five 3-pointers in 11 attempts. Daigneault also addressed the free-throw discrepancy, saying if he’d had unlimited challenges, he could have used them and he thought most of his challenges would have been upheld. But coaches are limited to only two challenges and on the one Daigneault did use, the call on the court – a blocking foul on Kenrich Williams – was upheld. “With the disparity, I just wish some of the contact that was called for them was called on the other end if that’s the way it’s going to be called,\" Daigneault said. \"But we also have to be better defensively. We can’t put the referee in that situation.” UP NEXT:\n\n\r\n              76ers: Will host the Los Angeles Lakers on Monday. Thunder: Will visit the Minnesota Timberwolves on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764996434.510765
}