{
  "game_id": "0021700147",
  "espn_id": "400974898",
  "date": "Nov 06, 2017",
  "matchup": "PHX vs. BKN",
  "headline": "Russell has 23 points, 9 assists; Nets beat Suns 98-92",
  "body": "PHOENIX --  The Brooklyn Nets had lost their scoring touch during a four-game losing streak, so they turned to defensive pressure to end the skid.\n\nD'Angelo Russell scored 13 of his 23 points in the fourth quarter, and Brooklyn held the Phoenix Suns to 34.9 percent shooting in a 98-92 win Monday night.\n\nRussell added eight assists, Joe Harris scored a season-high 18 points and Brooklyn won a game that featured 32 turnovers and 59 fouls.\n\n\"It wasn't the prettiest game ever played in the NBA,\" Nets head coach Kenny Atkinson said. \"A lot of fouls, but we found a way. Our defense was good. We had contributions from a lot of guys.\"\n\nThe Suns rallied from a 15-point first-half deficit to lead 75-74 after Jared Dudley's layup with 9:17 to play. The Nets went back ahead moments later and held on for their first road win of the season, with Russell scoring eight of his team's next 12 point after it lost the lead.\n\n\"Just didn't want to lose and tried to do whatever it took to win,\" Russell said. \"Everybody came through as a collective unit and did what they were supposed to do.\"\n\nDeMarre Carroll added 14 points and 11 rebounds, and Allen Crabbe scored 15 points.\n\n\"That was the first time we held a team under 100 (points) this year,\" Crabbe said. \"I think we all just came in focused.\"\n\nT.J. Warren had 20 points as the Suns dropped their third straight, including Sunday at San Antonio. Devin Booker scored 18 points before fouling out late in the game.\n\nThe Suns started well, with Booker scoring 11 points in the first seven minutes, before the Nets used a 16-0 run to go up 28-16.\n\nPhoenix cut the lead to one twice in the second quarter but finished the half making 10 of 40 shots. The Nets, behind 14 first-half points from Harris, led 47-41 at the break.\n\n\"Give them credit, they challenged us well,\" Suns interim head coach Jay Triano said. \"We tried ... to see if we could get a bunch of guys going and it was tough to make shots.\"\n\nMR. 3,000\n\nBooker reached 3,000 career points with a 19-foot jumper with 7:46 to play in the first quarter. He needed six points to reach 3,000 entering the game.\n\nBooker, 21, is the fourth-youngest player in NBA history to score 3,000 points, behind LeBron James, Kevin Durant and Carmelo Anthony.\n\n\"It means a lot,\" Booker said after the game. \"My dream my whole life is to play in the NBA. Once I got here I realized I wanted to leave a mark. ... I'm trying to do it, and trying to get wins along with it.\"\n\nTIP-INS\n\nNets: F Rondae-Hollis Jefferson played 17 minutes in the first half but did not return in the second half due to a right hip contusion. ... F Trevor Booker (sore lower back) did not play and is day to day, coach Kenny Atkinson said. Booker didn't take part in the pregame shootaround. ... F Quincy Acy played despite a left groin strain, his first action since Oct. 27.\n\nSuns: Veteran F Jared Dudley played a season-high 21 minutes and scored his first six points of the season. ... Former NBA All-Star and Suns forward Clifford Robinson attended the game. ... The Suns have lost three straight at home to the Nets.\n\nUP NEXT\n\nNets: At Denver on Tuesday night, the third game of five on a Western road trip.\n\nSuns: Host Miami Wednesday night.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993924.887081
}