{
  "game_id": "0021900499",
  "espn_id": "401161141",
  "date": "Dec 31, 2019",
  "matchup": "SAC vs. LAC",
  "headline": "George just misses triple-double, Clippers beat Kings 105-87",
  "body": "SACRAMENTO, Calif. --  Paul George and Kawhi Leonard had far more success passing the ball in the first half than they did shooting it – and the Clippers still put up nearly 60 points.\n\nThat, as Leonard pointed out afterward, bodes well for a franchise in serious pursuit of its first NBA championship.\n\nGeorge had 21 points with season highs of 11 rebounds and nine assists to shake off a slow start, and short-handed Los Angeles thumped the Sacramento Kings 105-87 on Tuesday.\n\nLeonard scored 14 of his 24 points in the third quarter to help the Clippers to their 14th consecutive win in Sacramento dating to 2013.\n\n“That’s what championship teams are about,” said Leonard, who led Toronto to the title a year ago before signing with the Clippers in hopes of bringing a banner to Los Angeles.\n\n“Going through playoff runs, the best players aren’t going to play great some nights. It might be somebody off the bench or somebody (else) starting that has a big game that propels us to win.”\n\nIvica Zubac added eight points and 13 rebounds and Maurice Harkless scored 12 points for the Clippers. Los Angeles also got a big lift from Larry Shamet and Derrick Walton Jr., who combined for 19 points.\n\nThat was pivotal on a night when George shot 6 of 25 and Leonard was 8 of 21.\n\n“We just kind of hung in there,” Los Angeles coach Doc Rivers said. “We went zone a little bit and changed our look. I just like our defense.”\n\nThe Clippers played without Patrick Beverley and sixth man Lou Williams. Beverley is nursing a sprained right wrist he injured during Saturday night’s loss in Utah, while Williams missed the game because of personal reasons.\n\nRichaun Holmes had 22 points and 10 rebounds for Sacramento. The Kings have lost eight straight.\n\n“They pushed us around out there and they had their way,” Sacramento coach Luke Walton said. “We have to come together and we’ve got to be mentally stronger, physically stronger and fight our way out of it. That’s the only way to get out of this type of slump that we’re in, and we’ve done it before.”\n\nThree days after a 13-point loss to Utah, Los Angeles took control in the first half despite both George and Leonard struggling offensively. The All-Stars missed 17 of their first 24 shots combined.\n\nBoth got going after the break.\n\nLeonard made five of seven shots in the third quarter, and George – who missed eight of his first nine shots beyond the arc – made a 3 to open the fourth. George added another 3-pointer later that put the Clippers ahead 103-86.\n\n“I had the mindset of just go and attack, be aggressive, be physical,” George said. “I got the spots I wanted to. I got to the shots I wanted to. But it’s just that stretch for me right now where the ball’s not going down.”\n\nEven with Leonard and George struggling most of the first half, the Clippers still built a big lead on the slumping Kings late in the second quarter. Shamet’s 3-pointer gave Los Angeles a 57-40 halftime lead.\n\nLeonard got going in the third and the Clippers went on a 9-2 run to extend their lead to 19. Montrezl Harrell tipped in an offensive rebound then made a pair of free throws that made it 85-66.\n\nWIN, THEN LOSE, THEN WIN\n\nThe Clippers have alternated wins and losses over the past nine games. George said that’s indicative of a team with new players still trying to adjust. “We’ve probably got one game under our belt where everybody’s been healthy,” George said. “We’re still learning each other. Our winning streak’s going to come, sooner than later I believe.”\n\nTIP-INS\n\nClippers: Beverley was injured Saturday against Utah. Although X-rays taken on his wrist were negative, Beverley is expected to miss a handful of games.\n\nKings: De’Aaron Fox had nine points and six assists after sitting out most of two games because of back spasms. … Sacramento’s losing streak is its longest since an eight-game stretch two seasons ago.\n\nUP NEXT\n\nClippers: Return to Los Angeles to play Detroit on Thursday.\n\nKings: Host Memphis on Thursday. Sacramento has won two straight home games against the Grizzlies but was beaten 119-115 on Dec. 21 in Memphis.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996403.116512
}