{
  "game_id": "401809793",
  "espn_id": "401809793",
  "date": "Nov 21, 2025",
  "matchup": "CHI vs MIA",
  "headline": "Heat dominate Bulls 143-107, led by Kel'el Ware's 20 points and 14 rebounds",
  "body": "CHICAGO -- — Kel'el Ware had 20 points and 14 rebounds, Norman Powell scored 19 points and the Miami Heat rolled past the Chicago Bulls 143-107 on Friday night.\n\n\r\n              Bam Adebayo scored 18 points, while Pelle Larsson and Davion Mitchell each scored 16 for Miami, which topped the 140-point mark for the fourth time this season — matching its total of such games from the last seven seasons combined.\n\n\r\n              Miami — which ended the game averaging an NBA-best 124.8 points per game this season — led by 41 in the closing minutes. That was the second-biggest Heat lead of the season and the biggest Bulls deficit (the previous was 25 against New York on Nov. 2).\n\n\r\n              Ayo Dosunmu scored 23 points for Chicago, which got 19 points, 11 rebounds and nine assists from Josh Giddey. Jalen Smith scored 14 for the Bulls.\n\n\r\n              The Heat moved to 2-1 in NBA Cup games, a half-game behind Milwaukee (2-0) for the East Group C lead. Chicago (1-2 in Cup games) fell to fourth in the group, a half-game behind New York and a half-game ahead of Charlotte.\n\n\r\n              Chicago opened the game on an 18-11 run over the first 5 1/2 minutes, but Miami controlled matters the rest of the way. A 53-21 Heat burst gave Miami a 25-point lead late in the first half, and the margin was never less than 14 again.\n\n\r\n              The Bulls lost Kevin Huerter in the third quarter after he waved at the ball in frustration following a foul call. The ball bounced into the back of referee Che Flores’ leg, and Huerter was ejected.\n\n\r\n              Chicago also saw Matas Buzelis (right ankle) and Dalen Terry (left calf) leave with injuries.\n\n\r\n              Up next\r\n              Heat: At Philadelphia on Sunday.\n\n\r\n              Bulls: Host Washington on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042667.9112709
}