{
  "game_id": "0022000128",
  "espn_id": "401267288",
  "date": "Jan 08, 2021",
  "matchup": "MEM vs. BKN",
  "headline": "Brooks leads Grizzlies to 1st home victory 115-110 over Nets",
  "body": "MEMPHIS, Tenn. -- — Despite losing another key player — this time for coronavirus safety concerns — the Memphis Grizzlies were able to hold on for their first win at home this season.\n\n\r\n                    Dillon Brooks scored 24 points and Memphis pulled out a 115-110 victory over the Brooklyn Nets on Friday night after center Jonas Valanciunas left midway through the game due to health and safety protocols.\n\n\r\n                    Brandon Clarke added 21 for Memphis.\n\n\r\n                    “Great job by our team. … What an unbelievable game,” Memphis coach Taylor Jenkins said. \n\n\r\n                    The Memphis victory came despite 43 points from Caris LeVert, including 25 in the second half as Brooklyn overcame a 22-point, first-half deficit.\n\n\r\n                    “We could have easily folded,” said reserve guard Joe Harris, who finished with 13 points. “The first half was not great by any means.”\n\n\r\n                    There were key starters missing for both teams. The Nets were without Kevin Durant and Kyrie Irving, while Memphis continued missing reigning Rookie of the Year Ja Morant and forward Jaren Jackson Jr.\n\n\r\n                    “For us to be a great team, a team that we know we can be, everyone has to be playing at full strength,” LeVert said. “Everyone has to be confident. Everybody has to be ready.”\n\n\r\n                    The teams were tied at 104 with 4:15 left. Memphis scored the next seven points, capped by a 3-pointer from De’Anthony Melton, who had 14 points on the night. LeVert’s 3-pointer with 11.4 seconds left pulled Brooklyn within 113-110, but the Nets could get no closer.\n\n\r\n                    Memphis lost momentum when Valanciunas did not come out for the second half due to the health and safety protocols. What had been Memphis domination on the boards quickly changed, and the Nets began shooting better than they had in the first half.\n\n\r\n                    “As soon as we got notification and in conversations with the league, we had to pull him from the game with an abundance of caution,” Jenkins said, adding that Valanciunas is not positive for COVID-19.\n\n\r\n                    In the third quarter, LeVert would connect on 6 of 8 from the field, including all five of his 3-pointers to pull the Nets back into the game.\n\n\r\n                    “That third quarter they got going,” Jenkins said. “They had a huge spark. A lot of momentum. Our guys just rallied and stayed the course despite a big run by the Nets.”\n\n\r\n                    TIP-Ins\n\n\r\n                    LeVert passed Richard Jefferson for 13th on the Nets’ career 3-pointers made list. … LeVert was 15 of 23 from the field, 7 of 9 from 3-point range. He entered the game shooting 25.6% from beyond the arc. “Honestly, I’ve been shooting bad all season,” LeVert said. “I felt like I was due for this game.\" \n\n\r\n                    Grizzlies: Beat the Nets in Brooklyn 116-111 in overtime on Dec. 28 and have now won four straight over Brooklyn … Wrapped up a four-game homestand, their longest of the season’s first half. … G Tim Frazier, signed by the Grizzlies on Jan. 4, saw his first action in the second quarter.\n\n\r\n                    ABSENT STARS\n\n\r\n                    Irving missed his second straight game for personal reasons. Asked several times in his pregame availability, Nets coach Steve Nash shared no specifics about the situation. “I messaged with Ky, but I want to keep all that stuff private,” Nash said. He later said as far as future availability that no decision has been made regarding Sunday’s game against Oklahoma City.\n\n\r\n                    As for Durant, who is under the health and safety protocols, Nash said: “Kevin, I believe, is still on track for Sunday, so we just hope the tests continue to be negative and everything stays as is.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Host Oklahoma City on Sunday.\n\n\r\n                    Grizzlies: Open a three-game road trip Monday in Cleveland against the Cavaliers, who defeated the Grizzlies 94-90 on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764996984.172875
}