{
  "game_id": "0021900037",
  "espn_id": "401160679",
  "date": "Oct 27, 2019",
  "matchup": "MEM vs. BKN",
  "headline": "Crowder hits 3-pointer as expires in OT, Grizzlies top Nets",
  "body": "MEMPHIS, Tenn. --  Rookie Ja Morant had the best game of his young career and veteran Jae Crowder hit a game-winner to make the Memphis Grizzlies' first victory of the season memorable.\n\nCrowder's 3-pointer from the top of the key as time expired in overtime lifted the Grizzlies to a 134-133 win over the Brooklyn Nets on Sunday night.\n\n\"We've been playing well these first two games,\" Crowder said of losses to Miami and Chicago. \"We put five quarters together and came out with a win.\"\n\nThe winning shot was possible after Spencer Dinwiddie split a pair of free throws with 7.4 seconds left, Grizzlies reserve Solomon Hill grabbing the rebound when the second shot was missed.\n\nAfter a Nets foul in the backcourt, Memphis inbounded the ball with 3.7 seconds left. Morant, who led the Grizzlies with 30 points, dribbled behind his back as he crossed half court, then handed out his ninth assist, shuffling a pass to the trailing Crowder for the 28-foot game-winner.\n\n\"I believe in Jae the whole way, and he delivered for us,\" Morant, the second pick in last summer's NBA Draft, said of the winning basket.\n\n\"Anytime you lose at the buzzer, it's always a tough loss,\" Nets coach Kenny Atkinson said.\n\nDillon Brooks scored 21 points and Jonas Valanciunas had 16 points and 11 rebounds for the Grizzlies. Morant also blocked Kyrie Irving's 17-footer at the end of regulation to keep the score tied at 120-all.\n\nCrowder's winning 3-pointer was his second basket of the game, as he finished with six points. His previous 3-pointer came with 1:09 left as Memphis took its first lead of overtime at 131-128.\n\nIrving finished with 37 points, seven rebounds and seven assists for the Nets. Caris LeVert added 27 points, Dinwiddie had 16 points on 3-for-13 shooting from the field.\n\n\"What a game, huh?\" Grizzlies first-year coach Taylor Jenkins said. \". Obviously, to get our first win of the season it took a complete team effort.\"\n\nMorant led that \"team effort,\" helping Memphis reach overtime by scoring 17 points in the fourth quarter. Morant's layup -- his final points of the period -- tied the score at 120 with 7 seconds left. He blocked Irving on the ensuing possession as time ran out in regulation.\n\n\"I head-faked,\" Irving said. \"I tried to shoot a fade. He's got long arms. He got a good contest on it and blocked the shot.\"\n\nTIP-INS\n\nNets: DeAndre Jordan started for the first time this season, replacing Jarrett Allen, who opened the first two games at center. Allen entered midway through the first quarter. ... LeVert started the game missing his first six shots, but finished 11 of 22. ... Irving has scored at least 20 points in 11 of the 12 games he has played against the Grizzlies. ... Brooklyn has lost eight straight road openers. The franchise's last win in a road opener was in 2011 against Washington.\n\nGrizzlies: Valanciunas knocked down a 3-pointer in the first quarter, the first of the season for the 7-footer. Then he hit another a minute later, matching his career-high for 3-pointers made in a game. ... Rookie F Brandon Clarke, listed as questionable with back soreness, played. ... Memphis has led at halftime in all three games this season. ... Morant was 13 of 22 from the field for the game and 21 of his points came after halftime.\n\nGAME BALL\n\nAfter Crowder's game-winning basket, the ball ended up on the opposite end of the court from the Grizzlies' bench. Assistant coach Brad Jones sprinted down the court to grab it. In the Grizzlies locker room, the ball was presented to Jenkins in recognition of his first win as an NBA coach.\n\nENDORSING JENKINS\n\nAtkinson and Jenkins were on the Atlanta Hawks staff together under Mike Budenholzer. Atkinson said the Grizzlies made the correct choice in hiring the Memphis coach. \"I know they are really well-coached, I can tell you that,\" Atkinson said of the Grizzlies before the game. \"I think he's going to be great. ... He's going to establish a great program. He has a lot of talent to work with. They are going to be a team on the rise, I'm almost sure of it.\"\n\nUP NEXT\n\nNets: Host Indiana Pacers on Wednesday\n\nGrizzlies: At Los Angeles to face the Lakers on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995771.883818
}