{
  "game_id": "0021600229",
  "espn_id": "400899679",
  "date": "Nov 25, 2016",
  "matchup": "CHI @ PHI",
  "headline": "Butler, Wade lead Bulls to rout of 76ers",
  "body": "PHILADELPHIA --  After a long, six-game road trip, the Chicago Bulls are heading home with a winning record and an infusion of confidence.\n\nJimmy Butler and Dwayne Wade had 26 points apiece to lead the Bulls to a 105-89 victory over the Philadelphia 76ers on Friday night.\n\nTaj Gibson added 12 points for the Bulls, who finished a six-game road trip with a 4-2 record. Butler rested for the entire fourth quarter of the blowout.\n\n\"On this trip, the way we performed, we started to understand we're a good team and can play with anyone in any building,\" Wade said. \"It was a very successful trip and we finished it off right.\"\n\nChicago led from start to finish against the short-handed 76ers, who played without center Joel Embiid.\n\n\"I like the way we're playing,\" Butler said. \"If we keep guarding, rebounding and doing what we're supposed to do, we're going to win a lot of games. Now we have to go home and win a couple more.\"\n\nErsan Ilyasova had 14 points to pace Philadelphia, which certainly could've used Embiid.\n\n\"You saw an NBA team that's good,\" Philadelphia coach Brett Brown said. \"That's a good team, a really good team.\"\n\nThe Bulls ran away from the 76ers with a dominant third quarter in which they outscored Philadelphia 33-17 to enter the fourth quarter ahead 90-64.\n\n\"To come out with this type of effort was terrific,\" Bulls coach Fred Hoiberg said. \"We had good urgency out of the gate.\"\n\nButler had nine points in the period as Chicago did damage inside and outside. Wade's fastbreak dunk early in the period helped the Bulls match their largest lead to that point at 67-52. And the advantage was 20, 79-59, with 4:35 left in the period after a pretty sequence that featured a Wade layup from Rajon Rondo followed by a Butler layup from Wade. Chicago ended the quarter with consecutive 3-pointers from Denzel Valentine and Nikola Mirotic.\n\nThe lead was 28 points with just over seven minutes left in the game when Hoiberg emptied his bench.\n\nROAD BLISS\n\nHoiberg said a long road trip can test a team's mettle.\n\n\"You either come out of it loving each other or hating each other, and I think our guys grew,\" he said. \"Now we have to go home and play with the same type of urgency and effort.\"\n\nMISSING EMBIID\n\nA leading candidate for Rookie of the Year, Embiid missed his fifth game as part of his rehab plan for a foot injury that cost him the last two seasons. Embiid is averaging 17.8 points and 7.6 rebounds in just 22.6 minutes as he is on a minutes restriction.\n\nThat restriction caused him to sit out the second overtime of Philadelphia's 104-99 loss to Memphis on Wednesday night. Embiid could return for Sunday's home game against the Cleveland Cavaliers though Brown was noncommittal.\n\nDuring the third quarter, fans chanted \"Free The Process! Free The Process\" in reference to Embiid's nickname, \"The Process.\"\n\nWADE'S IMPACT\n\nButler spoke afterward about how Wade helps the Bulls on and off the court. On the court, the double-teams Wade draws gives everyone open looks. Off the court, Wade's contribution may be more significant.\n\n\"He gives everybody confidence because he knows what it takes to win,\" Butler said.\n\nTALKING TRASH\n\nWade seemed to thrive on back-and-forth talk with Philadelphia's Jerryd Bayless.\n\n\"Friendly banter,\" Wade joked.\n\nTIP-INS\n\nBulls: G Michael Carter-Williams, out since Oct. 31 with a left wrist and left knee injury, had a cast placed on his left wrist. He will be re-evaluated in two weeks, Hoiberg said prior to the game. ... Hoiberg said he didn't have a timetable for the return of Doug McDermott, who missed his sixth game due to a concussion.\n\n76ers: Vince Papale, a former Philadelphia Eagles walk-on receiver whose story was made into the movie Invincible, rang the bell as part of the 76ers' pregame festivities. ... Former Phillies slugger Ryan Howard was in attendance.\n\nUP NEXT\n\nBulls: Host Lakers on Wednesday night.\n\n76ers: Host Cavaliers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995093.761054
}