{
  "game_id": "0021600818",
  "espn_id": "400900223",
  "date": "Feb 12, 2017",
  "matchup": "DET @ TOR",
  "headline": "Harris leads Pistons to 102-101 comeback win over Raptors",
  "body": "TORONTO -- Despite missing 10 of his first 11 3-point shots, Kentavious Caldwell-Pope showed little hesitation when another opportunity presented itself on Sunday night.\nReceiving the ball from Ish Smith with 13.2 seconds remaining, Caldwell-Pope drilled just his second 3-pointer of the night to cap a 16-point fourth-quarter comeback and lead the Detroit Pistons to a 102-101 win over the Toronto Raptors.\nFinishing with 21 points, the fourth-year guard said that he drew strength from the support of his teammates, even as his shot deserted him.\n\"I had a rough night shooting the ball from the field and from 3, so every time I came out of the huddle and even at halftime, everybody was like, `Just keep shooting,\" he said after finishing 8 of 22 from the floor.\nHe was also quick to deflect credit to teammate Marcus Morris, who guarded DeMar DeRozan on the Raptors' final possession, when the Eastern Conference All-Star had a 17-foot shot to win the game, but could only hit the rim with 0.9 seconds left.\n\"He didn't go for the shot fake, he stayed disciplined, we all did down the stretch, but that was a big shot for Marcus and our opportunity,\" Caldwell-Pope added.\nTobias Harris led the way for the Pistons with 24 points off the bench, while Andre Drummond had 10 points and 18 rebounds for his 36th double-double of the season as the Pistons snapped a four-game skid in Toronto.\nWhile the comeback looked improbable at times, Detroit coach Stan Van Gundy said he was encouraged by what he saw, even as his team shot just 25.8 percent from beyond the arc, compared to the Raptors' 50 percent from that distance.\n\"They fought and fought and fought and it wasn't easy,\" he said. \"It wasn't one of those runs where you hit three or four threes in a row, it was grind it out, grind it out, get it down to a manageable number and got a couple of big stops a great shot down the stretch.\"\nDeRozan finished with a game-high 26 points, while Jonas Valanciunas had 17 points and nine rebounds, but it wasn't enough to keep the Raptors from losing for the 10th time in their last 14 games.\nAsked what went wrong in the fourth quarter, Kyle Lowry didn't mince his words.\n\"Everything,\" he said. \"I mean everything; keep getting in the same situations over and over and not being successful. Something's got to give, something's got to change.\"\nDespite his final miss, on which DeRozan claimed he was fouled by Morris, the All-Star guard said time is running out for the Raptors to get their season back on track, having fallen from second to fourth in the conference during their recent tailspin.\n\"Like I said, 27 more games and that's going to fly by,\" he said. \"We haven't got much time.\"\nTIP-INS\nPistons: Since his rookie season in 2012-13, Drummond has 216 double-doubles, most in the NBA over that span. ... Leading the NBA in allowing second-chance points at 10.1 points per game before Sunday's contest, the Pistons held the Raptors to 14 points in that department.\nRaptors: F Patrick Patterson (left knee) missed his fourth straight game and 14th of the team's last 23. The Raptors are 7-7 without him. Jakob Poeltl made his third career start in his place. ... DeRozan extended his career high of consecutive 20-plus-point games to 20. ... After playing an NBA-high 22 games between Jan. 1 and Feb. 8, the Raptors had a three-day break before Sunday's game.\nI DON'T LIKE SUNDAYS\nThe Raptors fell to 1-5 when playing home games on Sundays with the loss. They have three more Sunday games at Air Canada Centre over the remainder of the regular season.\nKEEPING FOCUS\nWith the NBA's trade deadline on Feb. 23, Raptors coach Dwane Casey was asked before the game if it plays on his thoughts at all.\n\"No, no. I'm more trying to keep our guys' attention off of it,\" he said. \"We've got a lot of issues. I'll leave that to (president) Masai (Ujiri) and (general manager) Jeff (Weltman), (who) do a great job; they're all over it as far as what the league is doing, who's doing what.\"\nUP NEXT\nPistons: Visit Milwaukee on Monday, where Detroit has lost four of its last six games.\nRaptors: Visit Chicago on Tuesday aiming to snap 10-game losing skid against the Bulls.",
  "source": "espn_api",
  "crawled_at": 1764996045.1754649
}