{
  "game_id": "0021800077",
  "espn_id": "401070758",
  "date": "Oct 27, 2018",
  "matchup": "CLE vs. IND",
  "headline": "Bogdanovic, Oladipo lead Pacers past winless Cavs 119-107",
  "body": "CLEVELAND --  Victor Oladipo and the Indiana Pacers didn't have to worry about LeBron James on this trip to Cleveland.\n\nOladipo scored 24 points, Bojan Bogdanovic led the way with 25 points and Indiana kept the Cavaliers winless on the season with a 119-107 victory on Saturday night.\n\nThe teams met for the first time since Cleveland defeated Indiana in the first round of the Eastern Conference playoffs last season. James scored 45 points in Game 7 and the Cavaliers survived their toughest test in reaching the NBA Finals for the fourth straight season.\n\nOladipo hasn't forgotten anything about that game.\n\n\"Every time I play here, I sit here in this same locker,\" he said. \"Every time I land in Cleveland, I think about it. I watched it all summer, probably about 75 times. It's all I thought about.\"\n\nThe Pacers had no such troubles this time. Indiana took control midway through the fourth quarter and followed up its 20-point win in San Antonio on Wednesday with another road victory.\n\nCleveland (0-6) is off to its worst start since losing its first seven games in the 1995-96 season. The Cavaliers are struggling to adjust without James, who signed with the Los Angeles Lakers in free agency. Cleveland also missed forward Kevin Love, who was out for the second straight game because of a sore left foot.\n\nCleveland committed 18 turnovers that led to 30 points and helped Indiana shoot 65 percent (48 for 74) from the field.\n\n\"Our margin for error is slim,\" Cavaliers coach Tyronn Lue said. \"It's very slim.\"\n\nCleveland cut a 15-point lead to 97-91 early in the fourth quarter before Indiana regained control with four straight baskets. Darren Collison scored on a layup and a jumper, Oladipo hit a 12-footer and Domanta Sabonis scored in the lane.\n\nSabonis made another layup and Oladipo's 3-pointer with 3:58 left pushed the lead to 113-98.\n\nIndiana (4-2) placed six players in double figures. Collison, Myles Turner and Sabonis each scored 15 points while Thaddeus Young added 10.\n\n\"We didn't want to make it a trap game,\" Collison said. \"Every team in the NBA is respectable, regardless of who is out there. They played as hard as we did tonight.\"\n\nRodney Hood led Cleveland with 17 points while Larry Nance Jr. came off the bench to score 15.\n\nCleveland has struggled without James, who signed with the Los Angeles Lakers in free agency while Love leads the team with 19 points a game.\n\nIndiana went ahead for good midway through the second quarter. Oladipo scored on a layup, a dunk and a jumper as Indiana turned a four-point deficit into a 60-55 halftime lead.\n\nThe Pacers' run continued in the third quarter. Oladipo and Bogdanovic hit 3-pointers, and Collison knocked down a jumper from the corner and scored in the lane, to lead 81-66.\n\nIndiana guard Tyreke Evans sat out the game because of a violation of team rules. In a tweet posted by the team Friday, Evans said he was late for practice. He's expected to play Monday against Portland.\n\nLOVE UPDATE\n\nThe five-time All-Star, who leads the team scoring 19 points a game, also missed Thursday's game against Detroit. Love missed three of the Cavaliers' four exhibition games because of the injury, and it's uncertain when he'll return.\n\n\"He tried to play through it understanding we hadn't won a game and we were struggling a little bit,\" Lue said. \"He wanted to be on the floor and try to make a difference. We applaud him for that. We just hope he can get healthy soon.\"\n\nTEAM WIN\n\nCoach Nate McMillan was pleased with the way the Pacers played in the final two quarters.\n\n\"In the second half, we got stops when we needed to and really just wore them down,\" he said. \"We did a good job recognizing where we had matchups.\"\n\nTIP-INS\n\nPacers: Indiana's depth has been a major factor in the early going. Six players average in double figures and two others scored nine points a game. ... Evans is averaging 12 points in five games in his first season with the team.\n\nCavaliers: Rookie Collin Sexton was assessed a technical foul after swatting away Cory Joseph's hand as the Pacers guard was battling for position on an inbounds play. Sexton, taken with the eighth pick in the first round of the draft, had 12 points but was 2 of 8 from the field. \"There's going to be ups and downs,\" Lue said. \"I just don't want him to get down on himself. He's going to make mistakes and that's just part of the game.\" ...  F Sam Dekker started in place of Love, scoring six points with five rebounds in 24 minutes.\n\nUP NEXT\n\nPacers: Host Portland on Monday. Indiana is 2-0 at home with an average margin of 20 points.\n\nCavaliers: Host Atlanta on Tuesday. The Hawks were a 133-111 winner in Cleveland on Oct. 21.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994810.160651
}