{
  "game_id": "0021801048",
  "espn_id": "401071721",
  "date": "Mar 17, 2019",
  "matchup": "HOU vs. MIN",
  "headline": "Paul scores 25 to lead Rockets over Wolves 117-102",
  "body": "HOUSTON --  After several less-than-stellar third quarters recently, the Houston Rockets talked at halftime Sunday night about coming out of the break better. And, it was that third-quarter improvement that helped them to the win.\n\nChris Paul scored 25 points, tied a career high with six 3-pointers and had 10 assists, and the Rockets used a big third quarter to pull away and get a 117-102 win over the Minnesota Timberwolves.\n\nThe game was close throughout the first half and the Rockets were up by a point at halftime before using a 43-point third quarter, with from Paul, to extend the lead to 15 to start the fourth.\n\n\"Our focus was better coming out of the locker room,\" coach Mike D'Antoni said. They talked about it among themselves -- that we've been coming out kind of soft and we didn't this time. We came out more focused, especially on the offensive end.\"\n\nPaul's big game came after he sat out on Friday night to rest, but he wasn't sure how much the break helped.\n\n\"I don't know,\" he said. \"I didn't even think about it. For me, it's just about making sure that stuff was right with my body.\"\n\nHouston had a 14-point lead with about nine minutes left before using a 10-2 run, with five points from Clint Capela, to make it 106-84 with 5 1/2 minutes to go.\n\nJames Harden added 20 points and 10 assists despite dealing with a strained neck after a fall in Friday's win over the Suns, and Capela scored 20 with 13 rebounds. Harden liked the way the team played in the third quarter, but still sees room for improvement.\n\n\"We're trying to build on that,\" he said. \"We're trying to get better. We've got 12 games to do it.\"\n\nKarl-Anthony Towns had 22 points and 10 rebounds for the Timberwolves, who have dropped their last three.\n\nHe was disappointed that they let things get away from them in the third quarter after playing well before halftime.\n\n\"We just didn't hit shots, we didn't shoot well and they shot well when they needed to,\" he said. \"They were having their run and we had to stop the bleeding and we just didn't a good job of that.\"\n\nThe victory allows Houston, which has won 11 of its last 12 games overall, to avoid being swept by the Timberwolves this season after they won the first two meetings.\n\nHouston led by 1 at halftime and used an 8-2 run, with consecutive 3s from Eric Gordon, to extend the lead to 58-51 early in the third.\n\nA jump shot by Towns cut the lead to six later in the third before Paul made a 3, stole the ball from Jones and hit another 3 seconds later to make it 70-58.\n\nThe Timberwolves called a timeout before Capela made two free throws and Paul made another 3 to push Houston's run to 11-0 and extend the lead to 75-58.\n\nAn 8-2 run by Minnesota, with all the points by Taj Gibson, cut the lead to 90-78 late in the third. But Paul was fouled on a 3-pointer after that and made all three free throws to leave Houston up by 15 entering the fourth.\n\nTIP-INS\n\nTimberwolves: Derrick Rose missed his third straight game with a sore right elbow. ... Luol Deng missed his ninth game in a row with a sore Achilles' tendon. ... Jeff Teague sat out for the third game inflammation in his left foot. ... Josh Okogie scored 21 points. ... Andrew Wiggins had 14.\n\nRockets: Gordon had 12 points. ... Paul grabbed seven rebounds. ... Danuel House scored 14 points.\n\nTHREES, THREES AND MORE THREES\n\nHouston made 21 3-pointers for its 13th game this season with at least 20 to extend its NBA record. The Rockets attempted 50 3s to give them at least 40 attempts in an NBA-record 53 games this season, besting the 52 they did it in last season.\n\nThe Rockets shot 42 percent from long-range to improve to 13-2 this season when shooting better than 40 percent on 3s.\n\nFADING PLAYOFF HOPES\n\nThe loss leaves the Timberwolves in 10th place in the Western Conference. Although they haven't been eliminated from playoff contention, their latest skid makes it unlikely that they'll be able to move into one of the top eight spots and make the postseason.\n\n\"The odds are against us because a lot of guys are hurt and aren't able to play,\" Wiggins said. \"But everyone's role is to step up and keep fighting until the end.\"\n\nUP NEXT\n\nTimberwolves: Host Golden State on Tuesday night.\n\nRockets: Visit Atlanta on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995289.251559
}