{
  "game_id": "0022000523",
  "espn_id": "401313155",
  "date": "Apr 08, 2021",
  "matchup": "TOR vs. CHI",
  "headline": "LaVine, Vucevic lead Bulls past Raptors, 122-113",
  "body": "TAMPA, Fla. -- — Nikola Vucevic and Zach LaVine each scored 22 points and the Chicago Bulls beat the Toronto Raptors 122-113 on Thursday night for their third straight victory.\n\n\r\n                    LaVine also had 15 assists, and Lauri Markkanen came off the bench to score 18 points, making eight of 10 shots.\n\n\r\n                    “I think we’ve got to be a team now that that really tries to jam it inside,” said Bulls coach Billy Donovan, who has worked the 6-foot-11 Vucevic into the offense since the deadline trade with Orlando. “I think we’re getting more comfortable offensively. We have a better understanding and a better comfort level with how we’re tying to play.”\n\n\r\n                    Markannen played only 18 minutes.\n\n\r\n                    “We're trying to be more physical as a team, and I think for the most part we've done that,” Markannen said. “I'm a competitive guy and I want as many minutes as I can get, but with the new guys coming in we all have to make sacrifices.” \n\n\r\n                    Chris Boucher scored a career-high 38 points and had 19 rebounds for the Raptors. They have lost 15 of 18.\n\n\r\n                    Pascal Siakam added 27 points and eight rebounds for Toronto.\n\n\r\n                    LaVine and Vucevic combined for 15 points on an early 19-3 run that gave the Bulls their first 10-point lead.\n\n\r\n                    Chicago ran off 13 straight points while the Raptors missed 10 straight shots, and a 3-pointer by Coby White made it 51-31 with 6:04 left in the first half.\n\n\r\n                    Two 3-pointers and a three-point play by Boucher helped Toronto cut the margin to seven late in the fourth quarter, but LaVine closed it out with a layup and a 3-pointer with 45 seconds left.\n\n\r\n                    “He had a night, that’s for sure,” Toronto coach Nick Nurse said about Boucher, who made 14 of 24 shots. “He was hitting shots that I don’t think I’ve seen him take before. And he obviously was a problem on the glass for them on both sides.”\n\n\r\n                    Rookie Malachi Flynn had nine points and eight assists in his first NBA start for the Raptors, who had only eight players available for the game. They signed Freddie Gillespie to a 10-day contract early Thursday, but the 6-foot-9 former G-League player had not cleared the NBA's entry protocol in time to play.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: The Bulls have not won four straight since a seven-game winning streak in December 2017. . . . F Garrett Temple (hamstring) participated in Thursday's shootaround but is not ready to sprint, according Donovan. \n\n\r\n                    Raptors: F DeAndre Bembry sat out a one-game suspension for his part in an altercation during the first quarter of Tuesday night's game against the Lakers. G Fred VanVleet was also given a one-game suspension that will be served when he is eligible to return from the injured list. He missed his third game with left hip flexor. . . G Kyle Lowry missed a fifth game with right foot infection.\n\n\r\n                    JUST ENOUGH PLAYERS\n\n\r\n                    Thursday night’s game was a makeup of a game originally scheduled for Feb. 28. It was postponed because the Raptors, then beset by a COVID-19 outbreak, did not have the eight players required to play an NBA game.\n\n\r\n                    Due to injuries, a suspension and a lingering COVID issue with Paul Watson Jr., Toronto suited up only eight players Thursday night. \n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: At Atlanta on Friday night.\n\n\r\n                    Raptors: At Cleveland on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764996831.757536
}