{
  "game_id": "0022201014",
  "espn_id": "401469169",
  "date": "Mar 12, 2023",
  "matchup": "DEN vs. BKN",
  "headline": "Bridges, Nets withstand Jokic's triple-double, beat Nuggets",
  "body": "DENVER -- — Mikal Bridges scored 25 points and the Brooklyn Nets withstood a late rally and another triple-double by Nikola Jokic to beat the Denver Nuggets 122-120 on Sunday.\n\n\r\n              Nic Claxton had 20 points and Dorian Finney-Smith and Spencer Dinwiddie added 15 points each for Brooklyn, which has won five of its last six games.\n\n\r\n              Bridges and Dinwiddie, acquired in trades last month that sent Kevin Durant to Phoenix and Kyrie Irving to Dallas, have played a key part in Brooklyn’s resurgence even as they’re still adjusting to their new team and teammates.\n\n\r\n              “Even if we don’t know what we’re doing sometimes, just scrambling, all five guys help each other,” Bridges said. “Sometimes, it’s not going to be perfect, but I think just the next guy stepping up is the biggest thing.”\n\n\r\n              Jokic had 35 points, 20 rebounds and 11 assists for his league-leading 27th triple-double of the season but missed a contested 14-foot jumper with 5 seconds left that would have given the Nuggets the lead.\n\n\r\n              Michael Porter Jr. added 23 points for Denver, which matched a season high with its third consecutive loss.\n\n\r\n              “Tough loss,” Nuggets coach Michael Malone said. “Our guys fought back, gave ourselves a chance at the end.”\n\n\r\n              Nets coach Jacque Vaughn described his team's third quarter, in which it outscored the Nuggets 37-18 and shot 63%, as one of the most impressive quarters he’s seen in his time with the team.\n\n\r\n              “We started to fly around, 15 turnovers we produced tonight, our ability to be disruptive,” Vaughn said. “We stayed together for an impressive win on the road.”\n\n\r\n              Denver's Jamal Murray, who finished with 16 points, was forced to sit out the fourth quarter because of left knee soreness. Malone said Murray, who missed the last part of the 2020-21 season and all of last season after having surgery to repair a torn ACL in the same knee, would be evaluated.\n\n\r\n              Trailing by eight points at the break, Brooklyn fought back to take an 80-77 lead on Bridges’ jumper midway through the third quarter. The Nets stretched their advantage to 98-87 as Royce O’Neale and Joe Harris connected on successive 3-pointers in the final 40 seconds of the period.\n\n\r\n              Harris hit another 3-pointer to give the Nets a 109-94 advantage with 8:11 left, Brooklyn’s biggest lead to that point. The Nuggets didn’t go away, though, pulling within 116-110 on a three-point play by Christian Braun and Jokic’s floater with 4:41 remaining.\n\n\r\n              Denver got within 121-120 on a pair of free throws by Jokic with 41.6 seconds remaining and the Nuggets won a challenge with 23.2 seconds left to reverse a foul call on Jokic and gain possession, but Jokic then missed the potential go-ahead shot. The Nuggets fouled Bridges with 1.8 seconds remaining and he made one of two free throws.\n\n\r\n              Jokic's jumper at the buzzer fell short.\n\n\r\n              Brooklyn opened a 49-39 lead on Seth Curry’s 3-pointer with 7:23 left in the second quarter but the Nuggets closed the period on a 30-12 run to take a 69-61 halftime lead. Jokic ignited the flurry, scoring 10 of his points in that span, and capped it, pulling up from 33 feet to hit a 3-pointer just before the halftime buzzer.\n\n\r\n              TIP-INS\n\n\r\n              Nets: G/F Ben Simmons was sidelined for a 10th consecutive game with left knee and back soreness. “He’s back home in Brooklyn. We’ll get a chance to kind of see where he’s at when we get back home after this trip,” Vaughn said.\n\n\r\n              Nuggets: F Vlatko Cancar was back in action after missing the past four games with a right wrist sprain. ... F Zeke Nnaji, a key part of the team’s rotation for most of the season, has been sidelined since Feb. 7 with a right shoulder sprain. He is expected to have the injury re-evaluated soon to determine if he can return before the end of the season. “Obviously what we’ve tried to do is not have surgery and give his shoulder time to heal and get better to see where he’s at,” Malone said. “After tonight, there’s still 14 games left so there’s still time left in the season.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: Conclude a five-game trip Tuesday night at Oklahoma City.\n\n\r\n              Nuggets: At Toronto on Tuesday night in the opener of a five-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994684.047721
}