{
  "game_id": "0022301203",
  "espn_id": "401607490",
  "date": "Dec 05, 2023",
  "matchup": "LAL vs. PHX",
  "headline": "LeBron James leads Lakers to the In-Season Tournament semifinals with a 106-103 win over Suns",
  "body": "LOS ANGELES -- — LeBron James scored 15 of his 31 points in the fourth quarter, and the Los Angeles Lakers secured the last semifinal spot in the inaugural NBA In-Season Tournament with a 106-103 victory over the Phoenix Suns on Tuesday night.\n\n\r\n              Anthony Davis had 27 points and 15 rebounds and Austin Reaves scored 20 for the top-seeded Lakers, who will face New Orleans on Thursday in Las Vegas. Milwaukee plays Indiana in the East semifinal.\n\n\r\n              “You’ve got some of the most alpha male competitors in the world, and if you give us an opportunity to play for something meaningful or an incentive, then you get what you’re getting,” said James, who also racked up 11 assists, eight rebounds and five steals. “The In-Season Tournament is what it is, and we have an opportunity to play on a big stage, be on national television, represent our families, our communities, where we come from.”\n\n\r\n              James put on a masterful shooting performance down the stretch, scoring 15 of the Lakers' first 19 points in the final period and getting the assists on his teammates' other two baskets as Los Angeles pulled ahead.\n\n\r\n              Kevin Durant scored 31 points, but he badly missed a long 3-point attempt at the buzzer for the Suns. Phoenix had won eight of 10 before losing to Los Angeles for the third time already this season.\n\n\r\n              Devin Booker cut the Lakers' lead to 102-101 on a layup with 29 seconds to play, but Reaves drilled his third 3-pointer with 15 seconds left.\n\n\r\n              After Durant made another layup moments later, the Suns were left furious when officials granted James' request for a timeout while the ball appeared to be loose because Booker had knocked it away from Reaves an instant earlier.\n\n\r\n              “It’s a loose ball, and you can’t call a timeout on a loose ball,\" Phoenix coach Frank Vogel said. “The whistle blows. I don’t know why. Everything in the league is reviewable. I don’t know why that can’t be reviewable. … We got the trap, we got the turnover, (and the) damn whistle blows. It’s just frustrating.”\n\n\r\n              Reaves said he thought Booker probably fouled him an instant before the timeout was granted.\n\n\r\n              “There was no call, and LeBron made a high-IQ play he’s made a million times,” Reaves said.\n\n\r\n              Durant didn't share his coach's anger about the call, saying he didn't initially believe the ball was loose when the timeout was granted.\n\n\r\n              “That's not the ballgame,” Durant said. “That's one play. It's a 48-minute game. I don't like to complain about calls. Sometimes the ref ain't going to get it right all the time. Sometimes it's on us to play through all that stuff and not worry about putting the game in the ref's hands.”\n\n\r\n              Davis was eventually fouled, but he missed one of two free throws to open the door for Durant's potential tying 30-footer.\n\n\r\n              Booker and Grayson Allen scored 21 points apiece for Phoenix.\n\n\r\n              The Lakers earned the top seed in the West by going unbeaten in the group stage of the inaugural tournament, including a win Nov. 10 in Phoenix. The Suns rebounded from that setback to earn a wild-card spot in the knockout round.\n\n\r\n              While fans are still debating the merits of the In-Season Tournament, both Vogel and Lakers coach Darvin Ham said their players are getting into the spirit of the event, particularly with the motivation to earn financial bonuses for their teams’ support personnel and younger players.\n\n\r\n              “They’re well aware of that bag,” Ham said with a grin. “Money speaks, man.”\n\n\r\n              Bradley Beal missed his 11th straight game with a persistent back injury for the Suns, who hung in despite committing 22 turnovers while their two healthy superstars struggled with foul trouble. Booker picked up his fifth foul early in the fourth quarter, while Durant entered the final period with four fouls and committed his fifth with 3:18 to play.\n\n\r\n              Phoenix committed 10 turnovers in the first quarter alone, the most by any team in the league this season. The Suns trailed by 15 in the first half, but scored 14 consecutive points out of halftime to take a lead.\n\n\r\n              “We didn’t do enough early in the game,” Vogel said. “The turnovers and on the glass, if we do a better job, we’re not talking about a close game like that.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host the Sacramento Kings on Friday.\n\n\r\n              Lakers: Face the Pelicans at Las Vegas in Thursday's tournament semifinals.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995536.727932
}