{
  "game_id": "0021800043",
  "espn_id": "401070724",
  "date": "Oct 22, 2018",
  "matchup": "MIN vs. IND",
  "headline": "Wolves clamp down on defense in 101-91 win over Pacers",
  "body": "MINNEAPOLIS --  Through the first three games of the season, the Minnesota Timberwolves were not playing the type of defense that head coach Tom Thibodeau wanted to see.\n\nThat changed Monday night.\n\nMinnesota clamped down on the defensive end against Indiana as Jimmy Butler returned to the lineup to score 20 points to lead the Timberwolves to a 101-91 win over the Pacers.\n\n\"We played a little bit of defense finally,\" Butler said. \"It felt good.\"\n\nButler, who received a mix of boos and cheers during player introductions, sat out Saturday due to precautionary rest. Karl-Anthony Towns added 17 points and 12 rebounds for Minnesota, while rookie guard Josh Okogie scored 12 points off the bench.\n\nMinnesota also played most of Monday's game without forward Andrew Wiggins, who exited in the first quarter due to a right quad contusion and did not return. Wiggins scored two points in eight minutes before the injury.\n\nThibodeau said Wiggins is day-to-day and the team will know more Tuesday about the injury. Wiggins, a Toronto native, indicated that he'll play Wednesday at the Raptors.\n\nOkogie saw his minutes increase in Wiggins' absence. Okogie made the most of the extended playing time and the home crowd at Target Center gave the rookie a nice ovation as he took a seat on the bench late in the fourth quarter.\n\nWhile Okogie struggled from the floor early, he kept shooting at the behest of his teammates -- and his head coach.\n\n\"I just like the way he sort of persevered through it,\" Thibodeau said of Okogie. \"I thought the spirit of the team was strong. His teammates were encouraging him to shoot, and he just kept playing, which I think is important.\"\n\nThe Wolves led by as many as nine early before Indiana cut it to one point at the half. Victor Oladipo scored 15 of his 20 points before halftime to lead the Pacers. He has now scored at least 20 points in three straight games.\n\nBojan Bogdanovic also had 20 points on 8-of-12 shooting for the Pacers, while Myles Turner chipped in 16.\n\n\"I feel like overall, they kinda forced us into some tough shots as well,\" Oladipo said. \"Credit them, they did a pretty good job defensively.\"\n\nMinnesota's reserves went on a 12-0 run to open the fourth quarter and take an 84-73 lead -- its biggest of the game. Derrick Rose scored four of his 11 points during the run to put the Wolves ahead after they trailed by one entering the fourth.\n\nAfter allowing 140 points in a loss Saturday to Dallas, Minnesota's defense tightened Monday against a Pacers team that scored 132 points its last time out. The Wolves held Indiana to just 38.8 percent shooting from the floor in the first half. The 91 points allowed was the first time Minnesota held a team under 100 this season.\n\nIndiana shot over 55 percent in two of its first three games before shooting 39.6 percent on Monday.\n\n\"I thought our shot collection was poor,\" said Pacers coach Nate McMillan. \"We didn't have ball movement. Basically we were taking quick shots and taking quick, contested shots.\"\n\nTIP-INS\n\nPacers: F Domantas Sabonis returned to action Monday after missing Saturday's game against Brooklyn. Sabonis had eight points in 17 minutes off the bench. ... Indiana assigned C Ike Anigbogu to the Fort Wayne Mad Ants of the NBA G League on Monday. Anigbogu played three minutes Saturday.\n\nWolves: C Karl-Anthony Towns had 17 points and 14 rebounds for his first double-double of the season. ... F Taj Gibson's 3-pointer in the first quarter Monday marked the first time he connected from downtown since Dec. 31, 2017, which also came against Indiana.\n\nCOLD FROM DEEP\n\nThe Timberwolves struggled from 3-point range in Monday's game, finishing 7-for-33 from behind the arc. They were just 3-of-26 after three quarters before shooting 4-of-7 in the fourth.\n\nPUSHING THE TEMPO\n\nMinnesota led Indiana in fast break points, 26-8. Much of that was a result of the Wolves' ability to get stops on the defensive end and turn the ball up the floor quickly. Ten of those fast break points came in the fourth quarter.\n\n\"Our stops got us into the open floor,\" Thibodeau said.\n\nUP NEXT\n\nPacers: Visit San Antonio on Wednesday night.\n\nWolves: Visit Toronto on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994082.1383722
}