{
  "game_id": "0021800037",
  "espn_id": "401070719",
  "date": "Oct 21, 2018",
  "matchup": "SAC @ OKC",
  "headline": "Kings top Thunder 131-120, ruin Westbrook's season debut",
  "body": "OKLAHOMA CITY --  Russell Westbrook was in no mood to talk after his season debut.\n\nIman Shumpert scored 26 points and the Sacramento Kings beat the Oklahoma City Thunder 131-120 on Sunday night to spoil Westbrook's return.\n\nWestbrook missed the preseason and the first two regular-season games after having a procedure to deal with inflammation in his right knee. He had 32 points, 12 rebounds and eight assists in 35 minutes after averaging a triple-double the past two seasons.\n\nWestbrook sat at his locker for more than 20 minutes before getting in the shower and finally addressed the media about an hour after the game ended.\n\n\"I was OK,\" he said. \"It wasn't my best night, but I've got however many more games left to play, so I'm not worried. It was my first time. I just hate losing. Honestly, I don't really care to talk about how I played.\"\n\nThunder coach Billy Donovan liked what he saw from Westbrook, who made 13 of 23 field goals and was his usual unstoppable self when attacking the rim.\n\n\"I thought Russell really played well,\" Donovan said. \"I give him a lot of credit. He worked really hard the last five to six weeks to try to get himself ready. For him to come back, being out as long as he was and play like he did -- I thought we were faster, I thought we got downhill more, I thought the ball was moving.\"\n\nDe'Aaron Fox scored 22 points and Buddy Hield added 17 for the Kings. They shot 54.9 percent to earn their first win of the season.\n\nSacramento coach Dave Joerger said it was a big win for his team, given the buildup for Oklahoma City.\n\n\"They come back from the West Coast, they get their guy back and opening night, and a lot going on,\" Joerger said. \"I've got a lot of respect for them. We got the ball up and down the floor and we played fast.\"\n\nPaul George scored 29 points and Steven Adams added 10 points and 14 rebounds for the Thunder.\n\nSacramento led 68-56 at halftime behind 54.5 percent shooting. Westbrook had 15 points, nine rebounds and six assists at the break.\n\nThe Kings pushed their lead to 17 in the third quarter, but the Thunder rallied. A driving dunk by rookie Hamidou Diallo cut Sacramento's lead to 10 and helped bring the crowd back into the game. Oklahoma City closed the quarter strong, but Sacramento still led 97-90 entering the fourth.\n\nThe Thunder cut the deficit to five in the fourth quarter, but Sacramento held on. Hield hit a 3-pointer with just over 2 minutes remaining to slow Oklahoma City's momentum.\n\nTIP-INS\n\nKings: Shumpert scored 16 points in the first quarter and helped the Kings shoot 60 percent in the period. ... Marvin Bagley III, a rookie from Duke, finished with 13 points and seven rebounds. He scored 19 points in his previous game against New Orleans.\n\nThunder: Westbrook scored 11 points in the first quarter. ... George, Adams and backup center Nerlens Noel each committed three fouls in the first half. George committed his fifth foul late in the third quarter. ... The Thunder made just 19 of 30 free throws.\n\nHOME SWEET HOME\n\nHield, who played his college ball at Oklahoma, got a warm ovation during pregame introductions.\n\n\"It's cool,\" he said. \"Like I said, it's my second home. I was here for four years. Glad to be here. The fans always embrace me well.\"\n\nSHOTS APLENTY\n\nThe Thunder took 104 shots, but made just 44.2 percent of them. Oklahoma City's stars, Westbrook and George, made 23 of 41 shots. The rest of the Thunder made 23 of 63. The Thunder had 18 offensive rebounds, which helped them take 13 more shots than the Kings.\n\nSTRUGGLING SCHRODER\n\nDennis Schroder, the new Thunder player who replaced Westbrook in the starting lineup the first two games, took his share of the blame for the rough start. He made just 5 of 16 shots against the Kings and has made 14 of 50 shots this season.\n\n\"We've got to figure it out,\" Schroder said. \"I think the last couple of games, we didn't do a good job of selecting the shots and I take that on me the first two games. I've got to be better and got to make my shots as well, but as a unit, we've got to be better and take better shots. We've just got to get used to it and figure each other out.\"\n\nUP NEXT\n\nKings: At Denver on Tuesday night.\n\nThunder: Host Boston on Thursday night.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: www.apnews.com/tag/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994235.649728
}