{
  "game_id": "0022101023",
  "espn_id": "401360842",
  "date": "Mar 14, 2022",
  "matchup": "CHA @ OKC",
  "headline": "Terry Rozier shines as Hornets beat Thunder 134-116",
  "body": "OKLAHOMA CITY -- — Terry Rozier scored 30 points, and the Charlotte Hornets beat the Oklahoma City Thunder 134-116 on Monday night.\n\n\r\n              Charlotte closed out a perfect two-game trip, rallying after falling behind by as many as 18 points in the second quarter. Miles Bridges had 27 points and six assists, and LaMelo Ball finished with 21 points and seven assists.\n\n\r\n              “We were just preaching that we had to move the ball,” Bridges said. “Anytime we move the ball, we get any shot we want. ... We were getting a lot of open 3s and knocking them down.”\n\n\r\n              Shai Gilgeous-Alexander led the Thunder with 32 points and eight rebounds, and Darius Bazley scored 25 points.\n\n\r\n              Oklahoma City lost its sixth consecutive game.\n\n\r\n              “We’re the youngest team in the league and banged up on top of that,” Thunder coach Mark Daigneault said. “We’re trying to win games. Our guys are competing hard.”\n\n\r\n              The Thunder opened a 47-29 lead on Aleksej Pokusevski's 3-pointer with 10:26 left in the first half. But Isaiah Thomas rallied the Hornets, going 4 for 4 from 3 in the second quarter to help his team to a 65-64 lead at the break.\n\n\r\n              “(Thomas) gives us great poise and confidence out there on the floor,” Charlotte coach James Borrego said. “(Thomas) was fantastic tonight. He was a big part in turning this game.”\n\n\r\n              Ball made four 3s of his own in the third, including a deep shot from the top of the arc with 6:53 remaining. He scored 14 points to send Charlotte into the fourth quarter with a 102-91 lead.\n\n\r\n              The Hornets led by as much as 20 points down the stretch.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Thomas finished with 12 points in 16 1/2 minutes. ... The Hornets went 20 for 35 from 3-point range as a team.\n\n\r\n              Thunder: Surpassed 40 points in the first quarter for the first time this season. ... Gilgeous-Alexander has scored at least 30 points in eight of the Thunder’s last 10 games. ... Vit Krejci scored a career-high 12 points in 15 minutes off the bench.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host Atlanta on Wednesday night.\n\n\r\n              Thunder: At San Antonio on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992862.184046
}