{
  "game_id": "0022400127",
  "espn_id": "401704693",
  "date": "Oct 30, 2024",
  "matchup": "LAC vs. POR",
  "headline": "Anfernee Simons rallies Trail Blazers to 106-105 win over Clippers with 25-point performance",
  "body": "LOS ANGELES -- — Anfernee Simons scored 25 points, Deandre Ayton had 15 points and 12 rebounds and the Portland Trail Blazers rallied to beat the Los Angeles Clippers 106-105 on Wednesday night.\n\n\r\n              Deni Avdija had 13 points and 10 rebounds and made a game-saving block when he stuffed Norman Powell on a fast break with 29 seconds remaining to preserve a one-point lead. \n\n\r\n              Scoot Henderson added 14 points and Toumani Camara had 12 points for Portland, which trailed the entire fourth quarter until Simons made a go-ahead layup with 2:44 remaining.\n\n\r\n              Powell had 30 points and James Harden had 19 points and 10 assists for the Clippers. Los Angeles made only one field goal and scored just three points and in the final 3:30 of the game.\n\n\r\n              Takeaways\r\n              Trail Blazers: Simons came up big again and again in the fourth quarter for Portland. On consecutive possessions, he drove for a layup to tie the score at 99, hit a 3-pointer to tie the score again at 102 and followed with the go-ahead layup to put them up for good.\n\n\r\n              Clippers: Los Angeles went ice cold down the stretch. After taking a 102-99 lead on a 3-pointer by Harden with 3:35 remaining, they turned the ball over twice, had a pair of shots blocked and went 1 for 4 on free throws to let the game slip away.\n\n\r\n              Key moment\r\n              Ivica Zubac stepped to the line with the Clippers down 106-105 and 1:20 remaining, but he missed both free throws. The Clippers never got another shot up.\n\n\r\n              Key stat\r\n              Ayton has recorded a double-double in all five games this season.\n\n\r\n              Up next\r\n              The Trail Blazers host the Thunder on Friday, while the Clippers continue their five-game homestand against the Suns on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998060.7274399
}