{
  "game_id": "0022200631",
  "espn_id": "401468786",
  "date": "Jan 12, 2023",
  "matchup": "CLE @ POR",
  "headline": "Rubio returns and Cavaliers down struggling Blazers 119-113",
  "body": "PORTLAND, Ore. -- — Donovan Mitchell scored 26 points, Ricky Rubio played in his first game since a knee injury more than a year ago and the Cleveland Cavaliers rallied in the fourth quarter to beat the Portland Trail Blazers 119-113 on Thursday night. \n\n\r\n              Damian Lillard had a season-high 50 points, but it wasn't enough for the Blazers in their fifth straight loss. \n\n\r\n              Jarrett Allen added 24 points and 10 rebounds for the Cavaliers' fifth victory in their last seven games. \n\n\r\n              “Just kept fighting,” Mitchell said. \n\n\r\n              Portland led by 14 points early and had a 91-87 lead going into the final quarter. \n\n\r\n              Lillard's 3-pointer from 29 feet put Portland up 102-97 with 7:11 left, but the Blazers couldn't hold the lead. Allen's layup cut it to 104-103 and Mitchell's jumper gave the Cavs their first lead of the game with 4:40 to go. \n\n\r\n              Anfernee Simons hit a 3-pointer to tie it, but Mitchell and Evan Mobley made consecutive baskets and the Cavaliers pulled away. \n\n\r\n              “We played hard,” Blazers coach Chauncey Billups said. \"We didn’t get into the slump that we are in in one game and we’re not going to get out of it in one game. I think we’re getting close. I’m proud of our effort.” \n\n\r\n              Rubio finished with nine points in 10 minutes — including two 3-pointers in the third quarter. The 32-year-old tore his left anterior cruciate while driving to the basket at New Orleans on Dec. 28, 2021.\n\n\r\n              “Today there was a lot of emotions out there,” Rubio said. “I've been working hard all year just to be healthy so I’m grateful to be out there playing basketball.”\n\n\r\n              The Cavaliers had listed him as questionable on the pregame injury report, but he came in off the bench with 3:38 left in the first quarter. \n\n\r\n              Lillard appeared to struggle with a sore ankle early in the game. He remained in the contest, but at times appeared to be in pain. \n\n\r\n              Despite that, Lillard had 25 points in the opening half and Portland went into the break with a 58-51 lead. \n\n\r\n              Rubio's 3-pointer got the Cavaliers within 74-70 midway through the third quarter. Jerami Grant answered with a 3 for the Blazers. \n\n\r\n              Another Rubio 3-pointer closed the gap to 82-77 as the Cavs kept the margin at single digits.\n\n\r\n              \"It was a game we deserved to win. We just came up short,\" said Lillard, who added that he was hopeful the Blazers were on the verge of a turnaround.\n\n\r\n              FIFTY IS NIFTY\n\n\r\n              It was Lillard's 15th career game with 50 or more points. He joins James Harden and Stephen Curry as the only three players over the last 10 seasons with 10 or more 50-point games. \n\n\r\n              TIP INS\n\n\r\n              Cavaliers: It was the second and final meeting with the Blazers this season. Cleveland routed Portland 114-96 in the first game,\n\n\r\n              Trail Blazers: The team announced that Nassir Little has had on-court contact activities after a hip injury in December, but there's no timeline for his return. Justise Winslow continues to improve from a left ankle sprain, but will miss at least the next two weeks. ... Lillard has four games this season with 25 or more first-half points.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Minnesota on Saturday night. \n\n\r\n              Trail Blazers: Host Dallas on Saturday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995242.12199
}