{
  "game_id": "0022400798",
  "espn_id": "401705364",
  "date": "Feb 21, 2025",
  "matchup": "ORL vs. MEM",
  "headline": "Morant's 4th-quarter burst, Jackson's last-second block give Grizzlies 105-104 win over Magic",
  "body": "ORLANDO, Fla. -- — Ja Morant scored 10 of his 23 points in the fourth quarter and Jaren Jackson Jr. blocked a driving floater by Orlando’s Paolo Banchero in the final second to give the Memphis Grizzlies a 105-104 win over the Magic on Friday night.\n\n\r\n              Desmond Bane, who finished with 16 points and seven rebounds, provided the Grizzlies with their margin of victory with a free throw with 45.2 seconds remaining. Memphis’ Santi Aldama missed two free throws with 10.7 seconds left before Banchero’s failed final drive.\n\n\r\n              Franz Wagner led the Magic with 25 points. Banchero added 21 points on 5 for 21 shooting and Cole Anthony had 17 points, nine rebounds and seven assists for Orlando.\n\n\r\n              Jackson had 16 points and three blocks.\n\n\r\n              After the Grizzlies missed 19 of their first 21 3-point shots, GG Jackson II made three of the Grizzlies’ four 3-pointers during a 19-0 third-quarter run that erased a 19-point Magic lead.\n\n\r\n              Takeaways\r\n              Grizzlies: The Grizzlies avoided their first three-game losing streak of the season, overcoming 7-for-33 3-point shooting and 15 turnovers. They are 8-2 on the second night of back-to-backs.\n\n\r\n              Magic: Playing for the 21st time in their last 22 games without guard Jalen Suggs (left quad contusion), the Magic came up a point short in the first game of a seven-game homestand.\n\n\r\n              Key moment\r\n              With 2:05 remaining and Orlando up by two, a replay reversal gave the ball out of bounds to the Grizzlies after Morant had tapped it away from Wagner. Ten seconds later Morant tied the game with the game’s final field goal.\n\n\r\n              Key stat\r\n              The Magic missed 10 free throws, including four in the fourth quarter.\n\n\r\n              Up next\r\n              Grizzlies: Play at Cleveland on Sunday night.\n\n\r\n              Magic: Play Washington at home on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997534.766923
}