{
  "game_id": "0021800885",
  "espn_id": "401071558",
  "date": "Feb 23, 2019",
  "matchup": "CLE vs. MEM",
  "headline": "Love scores season-high 32 as Cavs beat Grizzlies 112-107",
  "body": "CLEVELAND --  Kevin Love is having fun in his return to the basketball court.\n\nAfter a season of losing streaks, injuries and trades, the Cleveland Cavaliers finally are, too.\n\nLove scored a season-high 32 points, Cedi Osman hit the go-ahead 3-pointer late in the fourth quarter and Cleveland defeated the Memphis Grizzlies 112-107 on Saturday night.\n\nLove, playing in back-to-back games for the first time since foot surgery, had 10 points in the fourth quarter. He was 9 of 15 from the field overall, hit six 3s and made all eight of his free throw attempts.\n\nThe five-time All-Star had surgery on his left foot in November and returned Feb. 8. He's averaging 16.5 points in four games since coming back.\n\n\"I feel like a big part of my life, my identity, is taken away when the game is taken away from you,\" he said. \"So I feel really good and really fortunate just to be out there.\"\n\nLove had 12 rebounds in 26 minutes -- his most since returning from the injury -- but was on the bench for the final 5:23 because he's still on a minutes restriction. He lobbied coach Larry Drew to go back in, but was turned down.\n\n\"I told him with two or three minutes left I was available and he said, 'No, you're done,'\" Love said.\n\n\"It was right in the heat of everything,\" Drew explained. \"It was hard to get him out, but we knew going into the fourth quarter he had anywhere from five to six minutes to play.\"\n\nThe Cavaliers pulled ahead even though Love was done for the night.\n\nOsman's 3-pointer gave Cleveland a 104-103 lead with 1:58 to play. He scored on a layup following a turnover before Collin Sexton hit a 3 to put the Cavs up 109-103.\n\n\"We're really happy that we have Kevin back, but after he came out we knew we had to finish the game out,\" Osman said.\n\nSexton had 20 points and Ante Zizic scored 18 for Cleveland, which also beat Phoenix on Thursday. The Cavaliers (14-46) won consecutive games for the third time this season. Cleveland has yet to win three in a row.\n\nJonas Valanciunas had 25 points 11 rebounds for Memphis, which has lost four straight and 16 of 20. Mike Conley scored 18 and Joakim Noah 16.\n\nValanciunas arrived from Toronto, which has the NBA's second-best record, at the trade deadline.\n\n\"Losing stinks,\" he said. \"We're trying to learn how to win games. Stats are stats. We don't look at the stats. We look at the results.\"\n\nThe Grizzlies, who lost at home to the Los Angeles Clippers on Friday, were on the second part of a back-to-back.\n\nLove hit three 3-pointers and a technical foul shot early in the third quarter to help the Cavaliers build a double-digit lead. Memphis trailed 79-64 but outscored Cleveland 20-3 over the last seven minutes of the third.\n\nMemphis coach J.B. Bickerstaff was hit with a technical foul early in the third. Noah, a constant target of boos by Cavaliers fans, received sarcastic cheers when he picked up a technical in the second.\n\nBickerstaff left the postgame interview room without taking questions.\n\nTIP-INS\n\nGrizzlies: Valanciunas returned after not playing Friday because of personal reasons. He has appeared in three games since being acquired from Toronto on Feb. 7 and made his first start Saturday. ... F Chandler Parsons scored four points in 18 minutes. He returned Friday for the first time since the third game of the season.\n\nCavaliers: Osman finished with 11 points. ... Cleveland dominated the first quarter, holding a 21-5 rebounding edge and making all nine of its free throw attempts. ... Cleveland led 44-26 early in the second.\n\nSTILL SIDELINED\n\nDrew isn't sure when forward Tristan Thompson, who missed his 15th straight game because of a sore left foot, will return.\n\n\"It's still going slow,\" Drew said. \"We're going to take it very slowly as far as bringing him back.\"\n\nBAD TIMING\n\nBickerstaff knows his team must adjust without rookie guard Jaren Jackson Jr., out indefinitely with a bruised right thigh.\n\n\"It's tough, obviously,\" Bickerstaff said before the game. \"We were beginning to feature him more in fourth quarters.\"\n\nUP NEXT\n\nGrizzlies: Host the Los Angeles Lakers on Monday.\n\nCavaliers: Host the Portland Trail Blazers on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994751.331899
}