{
  "game_id": "0022200725",
  "espn_id": "401468880",
  "date": "Jan 25, 2023",
  "matchup": "ATL @ OKC",
  "headline": "Young's 33 points, 11 assists lead Hawks past Thunder",
  "body": "OKLAHOMA CITY -- — Trae Young felt right at home in Oklahoma City against the Thunder. \n\n\r\n              The high-scoring Atlanta Hawks guard grew up in nearby Norman, Oklahoma, and played his one season of college ball at the University of Oklahoma. Thunder fans cheered when Young was introduced with Atlanta's starters, and he gave them a show. \n\n\r\n              Young had 33 points and 11 assists, helping the Hawks beat the Thunder 137-132 on Wednesday night.\n\n\r\n              Young grew up watching the Thunder during their glory days with Kevin Durant and Russell Westbrook. It wasn't his first time playing in Oklahoma City, but it was still surreal. \n\n\r\n              “It’s always fun,” he said. “I mean, I always get a lot of love and support out here and it’s always great coming back here and playing in front of these fans. I grew up obviously, going to a lot of these Thunder games, and so to be on that court is crazy.”\n\n\r\n              He dissected the Thunder defense by making 10 of 20 field goals and 10 of 11 free throws.\n\n\r\n              “I had a lot of respect for the way he played tonight,\" Thunder coach Mark Daigneault said. \"I thought he really controlled the game, especially early, and it really loosened us up defensively. And you know, that obviously was the game for us.”\n\n\r\n              Dejounte Murray scored 21 points and Bogdan Bogdanovic added 20 for the Hawks, who shot a season-high 59.5% from the field to snap a two-game losing streak.\n\n\r\n              “To guard a team, that’s that dynamic, we had to be a lot tighter than we were tonight,\" Daigneault said. \"And it was just kind of — it was death by paper cut. It was kind of everything. It was transition, it was fouling. It was a little bit of the glass. And then, you know, just a lack of discipline.” \n\n\r\n              Shai Gilgeous-Alexander scored 36 points and Jalen Williams added 24 for the Thunder. \n\n\r\n              Oklahoma City almost got away with their poor defensive effort. Williams stole the ball from Young and dunked to cut Atlanta’s lead to 133-132 with 15.3 seconds left. Atlanta's John Collins was fouled with 14.5 seconds remaining. He made both free throws to make it 135-132.\n\n\r\n              Gilgeous-Alexander drove to the hoop to try to get quick points, but Murray blocked his shot. Gilgeous-Alexander rebounded and missed again, and Murray came up with the ball. Murray was fouled and made two free throws at the other end with 2.7 seconds remaining to put the game out of reach.\n\n\r\n              “I think we let one slip tonight for sure,” Gilgeous-Alexander said. “Offense was good enough, we just didn’t bring it defensively. They made us pay.”\n\n\r\n              The teams were tied at 77 at halftime. It was the most points the Hawks have scored in a half this season. Gilgeous-Alexander scored 26 points and Young had 22 before the break. Atlanta shot 58.3% from the field in the first half, while Oklahoma City shot 56.9%. \n\n\r\n              Atlanta led 109-104 at the end of the third quarter, then scored the first 10 points of the fourth. Oklahoma City responded with a 9-0 run to trim its deficit to six and force Atlanta to call a timeout. The game was close the rest of the way.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: F De'Andre Hunter sat out with asthma symptoms. ... Murray was called for a technical foul in the second quarter. ... Young was called for a technical in the third. ... Collins had 19 points and 10 rebounds. ... Capela had 18 points and 10 rebounds.\n\n\r\n              Thunder: G Tre Mann stole an inbounds pass, elevated, cocked the ball back and unleashed a towering right-handed jam in the final minute of the first quarter. ... G Josh Giddey had 16 points, eight rebounds and six assists. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host the Los Angeles Clippers on Saturday.\n\n\r\n              Thunder: Host the Cleveland Cavaliers on Friday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994827.056034
}