{
  "game_id": "0022301106",
  "espn_id": "401585734",
  "date": "Apr 03, 2024",
  "matchup": "BKN vs. IND",
  "headline": "Nets outlast Pacers 115-111, still eliminated from postseason contention",
  "body": "NEW YORK -- — Cam Thomas scored 27 points, rookie Noah Clowney had a career-high 22 points and 10 rebounds, and the Brooklyn Nets outlasted the Indiana Pacers 115-111 on Wednesday night to split a home-and-home set.\n\n\r\n              The Nets were eliminated from postseason contention when Atlanta beat Detroit at home to wrap up at least a spot in the NBA Play-In Tournament. Brooklyn last missed the playoffs in 2017-18.\n\n\r\n              “We’re trying to build championship character, we’re trying to build competitive character,” Nets interim coach Kevin Ollie said. “And that’s just taking care of one another and competing no matter what the outcome is.”\n\n\r\n              Mikal Bridges added 17 points, and Nic Claxton had 14 points and 13 rebounds. The Nets had lost their previous two games, the last a 133-111 loss in Indianapolis on Monday night.\n\n\r\n              Clowney, who is the second youngest player (19 years, 264 days) in the league after Memphis rookie GG Jackson (19 years, 108 days) and has split time with the Nets' G-League affiliate, shot 7 for 9 from the field and made 3 3-pointers.\n\n\r\n              He scored 14 of his 22 points in the second quarter and became the second-youngest player in franchise history to eclipse 20 points in a game.\n\n\r\n              “I got to play with the same confidence I play with in the G (League) that I do here,” Clowney said. “I don’t want to start playing shy and then I am playing bad.”\n\n\r\n              Pascal Siakam scored 26 points and Tyrese Haliburton had for Indiana. The Pacers had won three in a row.\n\n\r\n              “It was an uneven compete level for us tonight,“ Indiana coach Rick Carlisle said. “You know, the second quarter was our undoing and the second half (we) just left too much to chance,” Pacers coach Rick Carlisle said.\n\n\r\n              Brooklyn fell behind by 14 points in the first half and then led by 13 points in the third quarter. Haliburton sparked a 10-2 spurt with seven points of his own, including a 16-foot jumper that cut it to 88-87 with 37 seconds left in the quarter.\n\n\r\n              The Nets led 100-95 with 5:57 left in regulation, but Siakam outscored them 11-3 and put Indiana ahead 106-103 with. 2:16 to play,\n\n\r\n              After Claxton’s dunk, Siakam answered with a basket before Bridges hit a 3-pointer in front of the Indiana bench to even it a 108 with 1:23 left.\n\n\r\n              Indiana called a timeout and Siakam committed an offensive foul driving to the basket. Dennis Schroder hit a 3-pointer and Clowney made two free throws to make it 112-108 with 40 second left.\n\n\r\n              Haliburton then hit a 3-pointer with nine seconds remaining, and Jalen Wilson sealed it with two free throws.\n\n\r\n              Pacer led 31-19 at the end of the first quarter before the Nets responded in the second by shooting 60% from the field and outscoring Indiana 42-31.\n\n\r\n              “That was just a poor defensive quarter,” Haliburton said. “I think it gave them confidence and that allowed them to kind of make their run.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Oklahoma City on Friday night.\n\n\r\n              Nets: Host Detroit on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996322.5198662
}