{
  "game_id": "0022200609",
  "espn_id": "401468764",
  "date": "Jan 09, 2023",
  "matchup": "LAL @ DEN",
  "headline": "Murray, Jokic lead charge as Nuggets beat Lakers 122-109",
  "body": "DENVER -- — Nikola Jokic needed only five shots on his way to a league-leading 11th triple-double of the season. How's that for efficient.\n\n\r\n              “A truly selfless superstar,” Denver coach Michael Malone said.\n\n\r\n              Jokic finished with 14 points — a perfect 5 of 5 from the floor, 3 of 3 from the line — grabbed 11 rebounds and dished out 16 assists as the Nuggets beat the Los Angeles Lakers 122-109 on Monday night in a game where LeBron James sat out due to a sore left ankle. \n\n\r\n              “I know a lot of players that if they took five shots in 35 minutes would be (mad) right now,” Malone said. “Nikola doesn’t care whether he takes five or 25. There’s not many guys like him that I’ve ever been around.\"\n\n\r\n              Count Lakers coach Darvin Ham as impressed. It marked the 12th triple-double in league history with five or fewer shots, according to the Nuggets.\n\n\r\n              \"The way (Jokic) puts his fingerprints all over the game, that’s a rarity, especially at his size,” Ham said. “It’s only a few of those guys in the league that’s able to do that.”\n\n\r\n              Jamal Murray added a season-high 34 points to help the Nuggets win their 11th straight home game. It’s their longest home streak since capturing 12 in a row in 2018.\n\n\r\n              Denver remains tied with Memphis for the top spot in the Western Conference. \n\n\r\n              “We did what we were supposed to do,” Malone said. “The guys came to work with a work mindset. Everybody stepped up and did their job.”\n\n\r\n              Russell Westbrook finished with 25 points despite dislocating his pinky finger — “I put it back in, twice,” he explained — and Thomas Bryant added 17 along with 10 boards for the Lakers, who saw their five-game winning streak halted. \n\n\r\n              James was ruled out hours before tipoff, joining injured forward Anthony Davis (right foot) on the bench. Patrick Beverley didn't play after halftime due to a hip injury. \n\n\r\n              The Lakers entered the game without Troy Brown Jr. (strained left quadriceps), Austin Reaves (strained hamstring strain) and Lonnie Walker IV (knee tendinitis).\n\n\r\n              “Kudos to our guys — they kept fighting and just had a couple bad turnovers, couple balls that didn’t go our way, couple shots didn't go down,” Ham said. “The group that was out there, they were competitive, then gave it their all until we couldn’t give anymore.”\n\n\r\n              Leading by as many as 20 points in the fourth quarter, the Nuggets saw the Lakers make a mini-run. But Murray calmed things down with a 3-pointer. \n\n\r\n              Murray's scoring spree was another big step as the point guard rounds back into form from a torn ACL that caused him to miss all of last season. \n\n\r\n              “I was just playing my game,” Murray said of his performance that included five of the team's 15 3-pointers. \n\n\r\n              TIP-INS\n\n\r\n              Lakers: G Kendrick Nunn had 15 points. ... G Dennis Schroder was called for a technical in the third quarter.\n\n\r\n              Nuggets: F Zeke Nnaji turned 22 on Monday. ... The Nuggets were called for two delay of game technical fouls. ... Kentavious Caldwell-Pope had 16 points and Bruce Brown 15. ... It was Jokic's 87th career triple-double. \n\n\r\n              DAVIS UPDATE\n\n\r\n              The Lakers are starting the ramp-up process for Davis when they return home.\n\n\r\n              “There are different benchmarks built within the process of the upcoming weeks and if he meets those marks and checks off those boxes, then he’ll be back on the court,” Ham said. “Am I willing to put a timetable on it? No.”\n\n\r\n              PLAYER OF THE WEEK\n\n\r\n              James was named Western Conference player of the week Monday. He averaged 35 points, 8.7 rebounds and 7.7 assists over his last three games. \n\n\r\n              The 38-year-old James is 35 points away from joining Kareem Abdul-Jabbar as members of the NBA’s 38,000-point club.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Start a five-game homestand Thursday against Dallas.\n\n\r\n              Nuggets: Host Phoenix on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994133.655618
}