{
  "game_id": "0021600897",
  "espn_id": "400899398",
  "date": "Mar 01, 2017",
  "matchup": "DAL @ ATL",
  "headline": "Paul Millsap helps Hawks hold off rallying Mavericks 100-95",
  "body": "ATLANTA --  The Atlanta Hawks could feel another game slipping away, a common theme in this most inconsistent of seasons.\n\nPaul Millsap bailed them out.\n\nMillsap banked in a shot off a spinning drive with 30.5 seconds remaining, and the Hawks held off the rallying Dallas Mavericks for a 100-95 victory Wednesday night.\n\nMillsap took a pass from Dennis Schroder at the top edge of the lane, dribbled to his left, twirled back to his right and knocked down the shot over Dorian Finney-Smith, giving the Hawks a 96-95 lead after they squandered a 12-point edge.\n\n\"Coach drew up a play, and I just had to make the shot,\" Millsap said. \"It's that simple. You get the opportunity, you've got to make it.\"\n\nHarrison Barnes missed a chance to put the Mavericks back in front, his jumper off the mark with Kent Bazemore right in his face. Ersan Ilyasova was fouled by Finney-Smith going for the rebound and knocked down both free throws to extend Atlanta's lead with 11.1 seconds left.\n\nDallas still had a chance to force overtime, but Seth Curry slipped on the inbounds pass and Bazemore scooped up the loose ball, taking off the other way for a dunk that clinched the victory.\n\n\"That's not the critical play,\" Dallas coach Rick Carlisle said. \"The critical play is the loose-ball foul call on Finney-Smith. When that referee sees it, he's going to have a sleepless night. That's all I can tell you.\"\n\nMillsap had 18 points and just missed a triple-double, dishing out 10 assists to go with eight rebounds. Ilyasova also finished with 18 points.\n\nBarnes led the Mavericks with 25 points.\n\nThe Hawks were up nearly the entire game, but the Mavericks fought back in the final quarter. Barnes knocked down a 3-pointer with 4:05 remaining to put Dallas ahead 90-87 -- its first lead since the opening minutes.\n\nSeth Curry, who finished with 21 points, extended the margin to 93-89 with another 3 -- his fifth of the game.\n\nBut the Hawks finished with an 11-2 spurt of their own in a sloppy game that the home team just couldn't put away, despite shooting a season-best 56.3 percent from the field. Atlanta had 23 turnovers, while the Mavericks gave it up 22 times -- nearly double their NBA-low average of 11.8 turnovers coming into the game.\n\nAt one point in the fourth quarter, the teams combined to turn it over on five straight possessions.\n\n\"They threw a lot at us,\" Bazemore said, especially a 2/3 zone that seemed to throw off the Hawks after what had been a hot-shooting night until the final period. \"We still tried to run our stuff. We've got to do a better job of executing.\"\n\nGHANA IN THE HOUSE\n\nBen Bentil made his NBA debut for the Mavericks.\n\nThe Ghana native was a second-round pick by the Boston Celtics, but didn't make the team. He had played in the D-League and even did a stint in China before signing a 10-day contract with the Mavericks.\n\nBentil entered the game in the second quarter. He failed to score in 4 1/2 minutes of playing time.\n\nDOUBLING UP\n\nAfter being ejected from Atlanta's last game, Dwight Howard made it all the way through this time.\n\nHe had 14 points and 12 rebounds, his 39th double-double of the season.\n\nHoward entered the night tied for sixth in the league in double-doubles.\n\nNOWITZKI WATCH\n\nDirk Nowitzki moved a step closer to becoming just the sixth player in NBA history to score 30,000 points.\n\nHe had 11 points to push his career total to 29,952, leaving him just 48 shy of joining Kareem Abdul-Jabbar, Karl Malone, Kobe Bryant, Michael Jordan and Wilt Chamberlain in the exclusive club.\n\nUP NEXT:\n\nMavericks: Return to Dallas on Friday to face the Memphis Grizzlies, beginning a five-game homestand.\n\nHawks: Host LeBron James and the defending NBA champion Cleveland Cavaliers on Friday, the second of six straight home games for Atlanta.\n\n---\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 . His work can be found at http://bigstory.ap.org/content/paul-newberry .",
  "source": "espn_api",
  "crawled_at": 1764996111.7184849
}