{
  "game_id": "0021500032",
  "espn_id": "400827919",
  "date": "Oct 30, 2015",
  "matchup": "POR @ PHX",
  "headline": "Bledsoe, Knight lead Suns to 110-92 win over Portland",
  "body": "PHOENIX -- The Phoenix Suns bounced back from a dismal season opener. The Portland Trail Blazers fell back to earth after an impressive debut, losing 110-92 on Friday night.\nEach team has a pair of dynamic guards: Eric Bledsoe and Brandon Knight for the Suns, Damian Lillard and C.J. McCollum for the Blazers.\nGive this one to the Suns.\nBledsoe scored 22 points and Knight 18 as Phoenix bounced back from an ugly season-opening loss to Dallas.\n\"We didn't want to let one game dictate how we played the next,\" Bledsoe said. \" We came out aggressive, played hard on defense and had a sense of urgency.\"\n\nLillard led Portland with 24 points on 7-of-20 shooting. McCollum added 16, making just 7 of 22 shots.\nThe teams meet again Saturday night in Portland.\nTyson Chandler set the tone after Phoenix's lackluster opener, scoring 10 points in the first quarter. He finished with 15 points and 13 rebounds.\nT.J. Warren added 17 points for Phoenix on a night when the Suns inducted Steve Nash into the franchise's Ring of Honor in a lengthy halftime ceremony.\nPhoenix coach Jeff Hornacek said there was a little Nash-style play in the pick-and-rolls of Bledsoe and Knight.\n\"They made some great passes and Tyson finished on a couple and they had to foul him on others or he is going to dunk it,\" Hornacek said. \"So that's what we need. When we can get that going then it's going to open up other things.\"\nAl-Farouq Aminu added 16 points and Mason Plumlee 15 for the Blazers.\nPhoenix took the lead for good at 38-37 on Warren's free throw with 6:20 left in the first half.\nThe Blazers were down only 50-49 after Aminu's fast-break dunk 1:24 before the break. The Suns finished the half with five free throws, one by Bledsoe and four by Ronnie Price, to lead 55-49.\nAfter watching much of the Nash ceremony, the Suns built a 14-point lead twice in the third quarter and were up 83-69 entering the fourth. McCollum's 3-pointer cut the lead to 88-75 with 9:19 to play, but Phoenix went on a 14-5 run and Markieff Morris' dunk made it 102-80 with 4:46 left.\nIt was a sloppy contest. Portland committed 23 turnovers, Phoenix 19.\n\"I think we had 10 turnovers in the third quarter,\" Trail Blazers coach Terry Stotts said, \"which is mind-boggling.\"\nFREE THROWS\nPhoenix outscored Portland by 17 points at the foul line and had 23 more attempts. The Suns made 32 of 42 free throws to the Blazers' 15 of 19. Bledsoe was 10 of 11 at the line, Chandler 9 for 12.\n\"It is frustrating,\" Lillard said. \"The refs are going to call the way they see it. We just got to play.\"\nLOTSA SHOTS\nLillard and McCollum are scoring points galore, but are taking a lot of shots to do it. McCollum was 14 of 22 in his career-high, 37-point performance against New Orleans in Portland on Wednesday night. That makes him 21 of 44 in two games. Lillard was 8 of 21 in that game and is 15 of 41 for the season.\nTIP-INS\nTrail Blazers: Portland has lost eight of its last nine games in Phoenix. ... Starting forward Meyers Leonard was 0 for 5 and scoreless. He didn't play in the second half.\nSuns: Phoenix was 4 for 17 on 3-pointers but shot 45 percent overall. ... Bledsoe fell two shy of his career high for free throws attempted. ... Chandler had his 254th career double-double.\nUP NEXT\nThe Suns play at Portland in a rematch Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994529.544537
}