{
  "game_id": "0022400746",
  "espn_id": "401705312",
  "date": "Feb 08, 2025",
  "matchup": "OKC @ MEM",
  "headline": "Shai Gilgeous-Alexander scores 32 to lead Thunder past Grizzlies 125-112",
  "body": "MEMPHIS, Tenn. -- — Shai Gilgeous-Alexander had 32 points and Aaron Wiggins added 26 points and 11 rebounds as the Oklahoma City Thunder beat the Memphis Grizzlies 125-112 on Saturday night in a showdown of the top two teams in the Western Conference.\n\n\r\n              The Thunder dominated the Grizzlies on the boards, outrebounding them 55-40. That includes 21 offensive board leading to 32 second-chance points. Isaiah Hartenstein grabbed 14 rebounds. Jalen Williams scored 25 for the Thunder, who won their fifth straight and stretched their conference lead to 7 1/2 over second-place Memphis.\n\n\r\n              Desmond Bane led the Grizzlies with 20 points, while Jaren Jackson Jr. finished with 19 points. Santi Aldama added 18 points as Memphis saw the end of its four-game winning streak.\n\n\r\n              The Thunder played without several rotation players, including Chet Holmgren, who returned in Friday night's win over Toronto after missing 39 games with a hip injury. Holmgren sat out on the second night of a back-to-back.\n\n\r\n              The Thunder controlled the first half, building double-digits advantages backed by offensive rebounds and forcing Memphis turnovers.\n\n\r\n              Takeaways\r\n              Thunder: Entering the game, Oklahoma City had won six straight over the Grizzlies by an average of 16.8 points. The 13-point victory extended the winning streak.\n\n\r\n              Grizzlies: Nothing seemed to work for Memphis early and the showing was not indicative of a team trying to show that it is among the best in the West.\n\n\r\n              Key moment\r\n              Memphis was trying to make a comeback in the fourth quarter and was within 12 points, but a Williams dunk then another stuff by Hartenstein off a Williams miss took the lead to 117-100.\n\n\r\n              Key stat\r\n              The Thunder have dominated during their winning streak, with an average margin of almost 24 points.\n\n\r\n              Up next\r\n              The Thunder host the Pelicans on Monday. Memphis begins a five-game road trip on Tuesday at Phoenix.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997504.081766
}