{
  "game_id": "0022300153",
  "espn_id": "401584781",
  "date": "Nov 06, 2023",
  "matchup": "HOU vs. SAC",
  "headline": "Sengun has 17 points, 12 assists and 8 rebounds to help Rockets beat Kings, 122-97",
  "body": "HOUSTON -- — Alperen Sengun had 17 points, 12 assists and eight rebounds and Jalen Green scored 23 points in the Houston Rockets’ 122-97 victory over the Sacramento Kings on Monday night.\n\n\r\n              The Rockets have won three straight to improve to 3-3. They are .500 for the first time since Oct. 22, 2021, when they started the 2021-22 season 1-1.\n\n\r\n              Sengun fell just two rebounds shy of his third career triple-double, doing so in just 26 minutes and without playing in the fourth quarter.\n\n\r\n              “We’re playing like animals out there right now,” Sengun said. “Everyone is tough, physical, everyone is helping each other. Nobody is getting easy points anymore. We need to keep it up all year.”\n\n\r\n              Houston shot 48.4% from 3, making 15 of 31. Green was 3 of 5 from beyond the arc and made 10 of 12 free throws.\n\n\r\n              “I loved our aggressiveness at the start,” Rockets coach Ime Udoka said. “They came out with some more physicality and tried to increase their pressure, and we handled it well and kind of threw it back at them. Loved everything we did, coming out and taking the fight, taking the initial hit and responding well.”\n\n\r\n              Keon Ellis scored 15 points off the bench to lead the Kings with star De’Aaron Fox out for a third straight game because of a sprained right ankle.\n\n\r\n              Kevin Huerter scored 13 points, Keegan Murray had 12 points, and Domantas Sabonis added eight points and eight rebounds, well below the league-leading 14.2 rebounds per game that he entered Monday averaging.\n\n\r\n              Houston outrebounded Sacramento 39-34.\n\n\r\n              “Give Houston credit — they kicked our behind, starting with me,” Kings coach Mike Brown said. “They kicked my behind and on down the line. They came to play tonight. They punched us in the mouth, and we did not respond. It was evident.”\n\n\r\n              The Kings are 0-3 without Fox, who averaged 31.3 points in his three games before getting hurt. Fox had a light shootaround session before the game.\n\n\r\n              “The sense of urgency is there — we don’t ever want to get too far behind, but there’s a lot of basketball left,” Brown said. “We’re facing some adversity, and I’m intrigued to see how we handle it.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host Portland on Wednesday night.\n\n\r\n              Rockets: Host the Los Angeles Lakers on Wednesday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995642.885092
}