{
  "game_id": "0022400422",
  "espn_id": "401704988",
  "date": "Dec 27, 2024",
  "matchup": "HOU vs. MIN",
  "headline": "Edwards hits winning 3-pointer to cap Timberwolves rally with 113-112 win over Rockets",
  "body": "HOUSTON -- — Anthony Edwards made a step-back 3-pointer with 23 seconds left to cap a furious rally and lift the Minnesota Timberwolves to a 113-112 win over the Houston Rockets Friday night. \n\n\r\n              The Rockets were up by by 12 with about three minutes left before a 10-0 run by the Timberwolves, highlighted by a 3-point play by Edwards, cut the lead to 110-108 with 90 seconds to go. \n\n\r\n              Alperen Sengun made 1 of 2 free throws after that, but Julius Randle's dunk on the other end got Minnesota within 1. Sengun was fouled a second time and again made just 1 of 2 free throws to leave Houston up 112-110.\n\n\r\n              Edwards then sunk the 3-pointer to give Minnesota its first lead since midway through the third quarter. \n\n\r\n              The Rockets had a chance for the win, but Fred VanVleet's 3-point attempt was off. \n\n\r\n              Randle had 27 points and Edwards added 24 as the Timberwolves won their second straight after losing three in a row. \n\n\r\n              Sengun had a season-high 38 points with 12 rebounds to lead the Rockets, who had a four-game winning streak snapped. \n\n\r\n              Takeaways\r\n              Timberwolves: Edwards had scored just one point in the second half before his late-game heroics secured the win.\n\n\r\n              Rockets: Houston could have used Dillon Brooks for his defense down the stretch Friday night. He missed his third straight game with a sore right ankle. \n\n\r\n              Key moment\r\n              The 3-pointer by Edwards. \n\n\r\n              Key stat\r\n              The Timberwolves got the win despite being outscored 66-40 in the paint. \n\n\r\n              Up next\r\n              Houston hosts Miami and Minnesota hosts San Antonio Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997866.2257469
}