{
  "game_id": "0021800682",
  "espn_id": "401071358",
  "date": "Jan 19, 2019",
  "matchup": "MIL @ ORL",
  "headline": "Bledsoe scores 30 points, Bucks hold off Magic 118-108",
  "body": "ORLANDO, Fla. --  Eric Bledsoe made it easy for the Milwaukee Bucks and superstar Giannis Antetokounmpo.\n\nBledsoe scored 30 points, Antetokounmpo had 25 points and 13 rebounds and the Bucks won their fourth straight game, beating the Orlando Magic 118-108 on Saturday night.\n\n\"It's great to have a lot of options and be able to go in different directions,\" Milwaukee coach Mike Budenholzer said. \"Eric was just great. He made some 3s, got to the basket, did a lot defensively. He just did a little bit of everything.\"\n\nMalcolm Brogdon added 18 points, and Khris Middleton had 15. The Bucks are 11-2 in their last 13 games.\n\n\"Eric can go 12 of 14, score 30 points and still get everyone involved,\" Antetokounmpo said. \"He's a pass- first point guard. We play faster and more together with him. He makes the game a lot easier for me, Malcolm, Khris (Middleton) and Brook (Lopez).\"\n\nNikola Vucevic led Orlando with 27 points, Terrence Ross had 16, D.J. Augustin 14 and Jarell Martin 12.  The Magic struggled with Aaron Gordon sitting out with a back injury, dropping their third straight.\n\n\"We can't play defense like we've played these last four games,\" Magic coach Steve Clifford said. \"Against (Milwaukee's) defense, the best defense in the NBA, we got 108 at home. You've got to give yourself a chance to win, but our defense is just not where it needs to be.\"\n\nVucevic and Ross helped the Magic trim a 16-point third-quarter deficit to five going into the final period. Vucevic had a 3-pointer and three-point play in an 11-2 run, and Ross scored the Magic's last nine points of the quarter to make it 87-82.\n\nMartin's 3-pointer on Orlando's first possession of the fourth quarter made it 87-85, but that was as close as they would get.\n\nBledsoe scored nine points to help the Bucks pull away. His three-point play with 9:09 left gave Milwaukee a 99-89 advantage. Orlando cut it to 106-102 with four minutes to play, but the Bucks scored on seven of their next eight possessions.\n\nTIP-INS\n\nBucks: The Bucks had 31 fast-break points to just two for Orlando. ... C Brook Lopez had four blocks in the first six minutes. ... The Bucks arrived in Orlando early Thursday and had three days of rest waiting for the game.\n\nMagic: Martin made three straight 3-pointers in his first appearance in six games. He finished with four 3-pointers, matching his total for the entire season.\n\nUP NEXT\n\nBucks: Host Dallas on Monday.\n\nMagic: At Atlanta on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994484.32046
}