{
  "game_id": "0022400185",
  "espn_id": "401704751",
  "date": "Nov 08, 2024",
  "matchup": "ATL @ DET",
  "headline": "Cunningham finishes triple-double with huge plays at both ends as Pistons beat Hawks 122-121",
  "body": "DETROIT -- — Cade Cunningham finished his third consecutive triple-double by scoring the winning basket with 8.5 seconds left, and the Detroit Pistons beat the Atlanta Hawks 122-121 on Friday night.\n\n\r\n              Cunningham had 22 points, 13 assists and 11 rebounds. Malik Beasley and Tobias Harris also scored 22 points for Detroit.\n\n\r\n              Cunningham matched Grant Hill for the longest triple-double streak in franchise history. It was Cunningham's fifth career triple-double, tying Isiah Thomas for the second-most in franchise history\n\n\r\n              Trae Young gave the Hawks their first lead of the game at 121-120 with 12.5 seconds left. But Cunningham drove and hit a hook shot in traffic to put Detroit back in front.\n\n\r\n              Young then drove to the basket before dishing the ball to Onyeka Okongwu, but Cunningham blocked his shot as time expired.\n\n\r\n              Young had 35 points and 13 assists. Jalen Johnson scored 20 for Atlanta.\n\n\r\n              The Hawks trailed by as many as 24 points in the first half, but they tied the game on Dyson Daniels' floater with 3:36 to play. \n\n\r\n              Harris answered with a 3-pointer, and after Okongwu's dunk, Jaden Ivey's three-point play made it 120-116 with 2:31 left.\n\n\r\n              Takeaways\r\n              Hawks: Atlanta didn't give Young much help until its final push. He had seven assists in the fourth quarter to go along with his 10 points.\n\n\r\n              Pistons: Detroit built its big first-half lead with very little scoring help from its best player. Cunningham had seven rebounds and nine assists in the half, but only scored two points on 1-for-6 shooting.\n\n\r\n              Key moment\r\n              Detroit led 99-88 early in the fourth quarter, but Larry Nance Jr. dunked in traffic and hit a 3-pointer to get the Hawks within six with 9:05 left.\n\n\r\n              Key stat\r\n              \r\n              The Hawks outscored Detroit 98-82 in the final three quarters.\n\n\r\n              Up next\r\n              Atlanta returns home to play the Chicago Bulls on Saturday. Detroit hosts the Houston Rockets on Sunday afternoon.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998302.1376488
}