{
  "game_id": "0022100531",
  "espn_id": "401360350",
  "date": "Dec 31, 2021",
  "matchup": "SAC vs. DAL",
  "headline": "Porzingis scores 24 to help Mavericks beat Kings 112-96",
  "body": "SACRAMENTO, Calif. -- — Kristaps Porzingis had 24 points, nine rebounds and six assists to help the Dallas Mavericks roll past the Sacramento Kings 112-96 on Friday.\n\n\r\n              Jalen Brunson added 23 points and eight assists for the Mavericks, who had lost five of their previous seven games. Dwight Powell scored 13 points and made four consecutive dunks as part of a huge run from Dallas in the third quarter.\n\n\r\n              “We saw something in the last game and we were able to execute it,” said Mavericks coach Jason Kidd, who wouldn’t go into specifics about the change. “With no practice, you just hope it works. We knew that they were going to load up on (Brunson) and (Porzingis) so we had to figure out how to get other guys involved. Everyone was sharing the ball and we were getting wide-open looks.”\n\n\r\n              Tyrese Haliburton had 17 points and 10 assists for the Kings.\n\n\r\n              Two days after losing in Sacramento on Chimezie Metu’s corner 3-pointer at the buzzer, Dallas closed the second quarter strong, then dominated in the second half, leading by 27 late in the fourth.\n\n\r\n              The Mavericks got a big lift from their defense after Sacramento scored 39 points in the first quarter. The Kings were held to 17 points in the second quarter then missed 12 consecutive shots and went 7½ minutes without a basket in the third.\n\n\r\n              “They moved Porzingis around a little more than they did the other night and they found a way to make adjustments,” Kings interim coach Alvin Gentry said. “We just did not shoot the ball well at all and that put added pressure on the defense.”\n\n\r\n              Brunson’s short jumper broke a 67-67 tie and sparked a 24-2 run for Dallas. Powell’s four straight dunks –- two off of alley-oop passes from Brunson and Reggie Bullock –- highlighted the scoring surge.\n\n\r\n              “They ran the same play like five or six times in a row,” Haliburton said. “Reggie Bullock set the pindown for Powell, set the cross-screen for KP and let him pick whether he was going to go high or low. They just kept scoring out of that. We just have to be better at realizing what they were running. \n\n\r\n              \"It came down to a communication issue. To me, that’s more us than them.”\n\n\r\n              Midway through the second quarter, Haliburton made a 3-pointer and a jumper above the key and Metu followed with a layup to put the Kings ahead by six. But Brunson, Porzingis and Bullock combined for 35 points in the first half, and helped Dallas close it on a 13-5 run to take a 62-56 lead into the half.\n\n\r\n              BULLOCK’S BACK\n\n\r\n              Bullock matched his season high of 16 points and grabbed five rebounds in 31 minutes in his return to the Mavs lineup after missing the previous six games while in the NBA’s COVID-19 health and safety protocols. \n\n\r\n              “It was a tough time,” Bullock said. “It’s going around the whole league. I had to isolate at home. I’ve been feeling well. The break was good for me. I was struggling.”\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Porzingis has scored 20 or more in four consecutive games. … Isaiah Thomas, who was signed to a 10-day hardship contract Wednesday, has entered into the NBA’s health and safety protocol. … Frank Ntilikina was held out because of a left thigh contusion. … Theo Pinson and Marquese Chriss were both signed to second 10-day hardship contracts. \n\n\r\n              Kings: Davion Mitchell was whistled for a technical foul after scoring in the fourth quarter when he appeared to throw the ball at a referee’s feet. … Neemias Queta returned from the health and safety protocol. … Terence Davis did not play because of left ankle soreness.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: At Oklahoma City on Sunday. Dallas has won four of its last five games against the Thunder. \n\n\r\n              Kings: Host the Heat on Sunday. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993099.400426
}