{
  "game_id": "0022000499",
  "espn_id": "401267659",
  "date": "Feb 25, 2021",
  "matchup": "BKN vs. ORL",
  "headline": "Nets rout Magic 129-92, run NBA-leading win streak to eight",
  "body": "NEW YORK -- — Kyrie Irving had 27 points and nine assists, James Harden scored 20 points and the Nets extended their longest winning streak since moving to Brooklyn to eight games with a 129-92 rout of the Orlando Magic on Thursday night.\n\n\r\n                    The Nets have the longest current winning streak in the NBA and their longest since a franchise record-tying 14-game run late in the 2005-06 season. They moved from New Jersey to Brooklyn in 2012.\n\n\r\n                    This roll has come almost entirely without Kevin Durant, who missed his sixth straight game with a strained left hamstring. \n\n\r\n                    “We just want him to stay patient, stay peaceful and when he comes back the world will be on notice again,” Irving said.\n\n\r\n                    They're explosive enough with their other two All-Stars, improving to 7-2 when Irving and Harden play but Durant doesn't. \n\n\r\n                    Landry Shamet added 19 points and nine rebounds for the Nets, who blew open the game with a 26-4 run spanning halftime. The NBA's highest-scoring team reached 120 points for the 20th time, already tying a franchise record in only 34 games.\n\n\r\n                    Nikola Vucevic had 28 points and 12 rebounds for the Magic, who dropped their second straight after a three-game win streak. They committed 18 turnovers, giving the Nets 24 points when they score enough without any help.\n\n\r\n                    “We can’t beat ourselves and we can’t turn the ball over and that’s where it started,” Magic coach Steve Clifford said.\n\n\r\n                    Clifford predicted before the game that the Nets are so gifted offensively that there would be possessions where his team defended well and Brooklyn still scored. \n\n\r\n                    Orlando looked good early, holding Brooklyn to five points in the first six minutes. Even after straightening things out later in the period, the Nets were down 28-24 after the first quarter. \n\n\r\n                    That was about the only highlight for Orlando. The Nets surged ahead with a 12-2 burst midway through the second that gave them a 44-38 lead, with a 19-2 surge late in the period turning a three-point lead into a 65-45 bulge.\n\n\r\n                    “We can’t start every game like how we’ve started the rest of the games during this kind of streak,” Irving said. “So we've just got to turn the next page and we put a few possessions together and we ended the first quarter well and I feel like that put us in position to take control of the pace of the game.”\n\n\r\n                    The Nets outscored the Magic 41-19 in the second, shooting 16 of 22 (72.7%).\n\n\r\n                    Irving, who missed all five 3-pointers in the first half, then made one before his steal and layup capped a 7-0 start out of the locker room that made it 72-47.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: James Ennis III was 5 for 5 and scored 15 points, two off his season high. ... Orlando fell to 1-7 against the Atlantic Division, including 0-5 on the road. \n\n\r\n                    Nets: Coach Steve Nash said before the game he had no update on Durant's status. ... Brooklyn is 12-3 against Orlando at Barclays Center, its best record against any opponent.\n\n\r\n                    THROUGH 20\n\n\r\n                    The Nets improved to 15-5 with Harden in the lineup. His first game with Brooklyn after being acquired from Houston was against the Magic, when he had a triple-double on Jan. 16 while playing with Durant while Irving was out. He finished with nine rebounds and seven assists in this one.\n\n\r\n                    KYRIE ON KOBE\n\n\r\n                    Irving discussed his desire to have Kobe Bryant become the NBA logo. He said he understands that not everybody would like the idea, but believes using Bryant's image would be meaningful to his generation of players who looked up the superstar, who died last year in a helicopter crash.\n\n\r\n                    “My thing is, paying homage to the example that has been set by that man,” Irving said. \n\n\r\n                    “He was the standard for our generation and he will continue on and I want that to be something in history that is changed forever, that our generation was part of that change.” \n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Host Utah on Saturday.\n\n\r\n                    Nets: Host Dallas on Saturday in their final home game before the All-Star break.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997500.275959
}