{
  "game_id": "0022300230",
  "espn_id": "401584858",
  "date": "Nov 22, 2023",
  "matchup": "TOR @ IND",
  "headline": "Pascal Siakam, Scottie Barnes help Raptors beat Pacers 132-131",
  "body": "INDIANAPOLIS -- — Pascal Siakam had 36 points and 10 rebounds, Scottie Barnes drove for the go-ahead dunk with 27 seconds left, and the Toronto Raptors beat the Indiana Pacers 132-131 on Wednesday night.\n\n\r\n              Barnes had 20 points and 11 rebounds, and his slam put Toronto ahead 130-129 for the last of five lead changes in the final 1:22. Dennis Schroder scored 26 points for the Raptors.\n\n\r\n              Buddy Hield missed a potential game-winning 3-pointer with 1.2 seconds left for the Pacers. He finished with 31 points and made 7 of 12 3s. Tyrese Haliburton had 33 points and 16 assists for Indiana.\n\n\r\n              “I take that 10 times out of 10,” Haliburton said of Hield’s final shot. “He works hard every day. That’s a great look for us.”\n\n\r\n              Siakam sank 13 of 24 shots.\n\n\r\n              “Pascal was amazing,” Raptors coach Darko Rajakovic said. “He was so aggressive. He scored points in the paint and was versatile, driving to the rim.”\n\n\r\n              Both teams were playing the second of back-to-back games. The Pacers had set a franchise scoring record a night earlier when they beat Atlanta 157-152. Rajakovic said the goal was to keep the Pacers from running so much.\n\n\r\n              “We knew they were going to be a team that was going to try to run and score a lot,” Rajakovic said. “I thought in the first half we did a good job in transition. They only got five points in transition. We continued to preach to slow those guys down and make them a half-court team. We talked about not letting them shoot early in the shot clock.”\n\n\r\n              The Pacers led 101-100 after three quarters, and the teams traded the lead for much of the fourth. Haliburton’s 3 gave the Pacers a 123-116 lead with 4 minutes left.\n\n\r\n              O.G. Anunoby put Toronto back on top with a 3-pointer with 1:22 left. The Pacers retook the lead two more times before Barnes gave Toronto the lead for good.\n\n\r\n              Pacers coach Rick Carlisle said his team took some questionable shots down the stretch.\n\n\r\n              “We had some shot selection that wasn’t probably appropriate a couple of times,” Carlisle said. “Look, if they go in, everybody claps and says great shot, but time to score is important.”\n\n\r\n              The Pacers shot 55% for the game and the Raptors shot 53%. Toronto shot nearly 63% in the first half, but Indiana kept it close by making 11 of 20 3s.\n\n\r\n              Carlisle said it was another wild night and a disappointing result.\n\n\r\n              “They made plays and we didn’t make enough plays and we made some mistakes we’ll learn from,” Carlisle said.\n\n\r\n              Indiana guard Andrew Nembhard missed his third consecutive game with a sore lower back. The Pacers also were without forward Aaron Nesmith, who missed his first game of the season with a sprained right wrist.\n\n\r\n              Raptors forward Precious Achiuwa was sidelined with a sore right knee.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Chicago on Friday.\n\n\r\n              Pacers: Host Detroit on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995452.4871302
}