{
  "game_id": "0021900808",
  "espn_id": "401161450",
  "date": "Feb 12, 2020",
  "matchup": "DET @ ORL",
  "headline": "Gordon, Fultz lead Magic to 116-112 OT win over Pistons",
  "body": "ORLANDO, Fla. --  Aaron Gordon and Markelle Fultz saved the Orlando Magic from going into the All-Star break with an embarrassing loss.\n\nGordon scored 25 points and Markelle Fultz added 21 as the Magic rallied to beat the Detroit Pistons 116-112 in overtime on Wednesday night.\n\nThe Pistons came back from a 22-point deficit before losing their fourth straight.\n\nGordon, who also had nine rebounds and nine assists, hit two 3-point shots, the second of which tied the game 103-all with 1:03 left after Detroit had taken a seven-point lead.\n\n\"The last seven games I think he's averaging about 20 (actually 19.6). I think it's his best stretch, and his defense has been good. It's a good sign,\" Magic coach Steve Clifford said.\n\n\"I know when I play well, the team plays well. It's kind of a given,\" Gordon said. \"But we've got a long way to go to be a team that can win in the playoffs.\"\n\nThe Magic (24-31) stand eighth in the Eastern Conference at the All-Star break.\n\nFultz had 10 assists and two steals and scored the Magic's first and last points in overtime.\n\nChristian Wood had 26 points and 12 rebounds for the Pistons, who shot themselves back into the game but scored only four points in overtime.\n\n\"Turnovers,\" said coach Dwane Casey. \"We were fighting the shot clock instead of attacking with pace. They made simple plays down the stretch and we tried to make things too complicated.\"\n\nA 3-pointer by Nikola Vucevic gave Orlando a three-point lead with 5.5 seconds left before Detroit's Reggie Jackson hit a 3-pointer with 1.4 seconds left in regulation to send the game into overtime.\n\nThe Pistons fell behind 47-25 after committing nine turnovers in the first quarter. But Wood and Markieff Morris scored 11 points apiece to help Detroit outscore the Magic 30-12 over the final seven minutes of the first half.\n\nTony Snell's 3-pointer pulled the Pistons even, 75-75, with 5:30 left in the third quarter. Orlando regained a six-point lead by the end of the period, but the Magic missed their first 11 shots of the fourth quarter.\n\nThree-pointers by Svi Mykhailiuk, Jackson and Morris gave the Pistons nine straight points, and Jackson's jumper with 5:25 left gave Detroit a 98-91 lead.\n\nGordon scored eight straight points to help Orlando erase that deficit in the final 3 1/2 minutes of the fourth quarter.\n\nTIP-INS\n\nPistons: Derrick Rose played 17 minutes after missing five games with a hip injury. ... F Luke Kennard (knee) and G Khyri Thomas (foot surgery) are hopeful of returning after the All-Star break.\n\nMagic: C Mo Bambo had the flu and did not play. ... G D.J. Augustin (knee) expects to play after the All-Star break. ... At 24-31, the Magic are one game better than last season after 55 games.\n\nROUGH RETURN FOR ROSE\n\nRose, who had a stretch of 14 straight games with 20-plus points before getting injured, attributed his 1-for-13 shooting to rust. \"Rhythm, timing,\" he said. \"Same shots I was getting (before the injury) so I'll just go into the break and work on my game every day.\"\n\nUP NEXT\n\nPistons: Play at home against Milwaukee on Thursday, Feb. 20.\n\nMagic: Play at home against Dallas on Friday, Feb. 21.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996263.773543
}