{
  "game_id": "401809945",
  "espn_id": "401809945",
  "date": "Oct 24, 2025",
  "matchup": "NY vs BOS",
  "headline": "Brunson scores 31 points, Knicks ride huge 2nd quarter to 105-95 victory over the Celtics",
  "body": "NEW YORK -- — Jalen Brunson scored 31 points, Karl-Anthony Towns had 26 points and 13 rebounds and the New York Knicks rode a huge second quarter to a 105-95 victory over the Boston Celtics on Friday night and a 2-0 start to the season.\n\n\r\n              The Knicks outscored the Celtics 42-14 in the second quarter en route to a 64-44 halftime lead. It appeared they would blow out Boston at Madison Square Garden for the second straight time, after rolling to a 119-81 victory in Game 6 to eliminate the Celtics last season in the Eastern Conference semifinals.\n\n\r\n              The Knicks played a sloppy third quarter and the Celtics cut it to single digits in the fourth, but Brunson had a couple baskets to help them build back a cushion. \n\n\r\n              Jaylen Brown scored 23 points on his 29th birthday for the Celtics, who fell to 0-2. They also gave up 42 points in the fourth quarter of their 117-116 loss to Philadelphia on Wednesday. San Hauser added 18 points on six 3-pointers.\n\n\r\n              Josh Hart made his season debut for the Knicks with 14 rebounds in 19 minutes off the bench after hurting his lower back in the preseason opener. But OG Anunoby limped off midway through the fourth after appearing to hurt his knee or upper thigh when he landed trying to block a shot. \n\n\r\n              The Celtics led 30-22 after one quarter, but the Knicks started the second with an 11-0 run to take the lead. Hauser and Derrick White made consecutive 3-pointers to put the Celtics back ahead 36-33, but New York scored 17 unanswered points to make it 50-36, then got the final 12 of the half to make it 64-44. \n\n\r\n              Up next\r\n              Celtics: At Detroit on Sunday.\n\n\r\n              Knicks: At Miami on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042490.950339
}