{
  "game_id": "0021800687",
  "espn_id": "401071363",
  "date": "Jan 19, 2019",
  "matchup": "CLE @ DEN",
  "headline": "Murray, Jokic lead Nuggets past Cavs 124-102",
  "body": "DENVER --  Nikola Jokic likes the way the Denver Nuggets have bounced back from their worst loss of the season.\n\nJokic had 19 points, 12 assists and 11 rebounds in his sixth triple-double this season, and the Nuggets beat the Cleveland Cavaliers 124-102 on Saturday night. Jamal Murray scored 26 points as Denver won for the third time in four games, though the lone blemish in that span was a 31-point loss to Golden State earlier this week.\n\n\"We were focused,\" Jokic said. \"We played the right way from the get-go.\"\n\nTrey Lyles had 16 points and Monte Morris finished with 15 for the Nuggets, who went 15 for 37 from 3-point range. Murray made four 3s, and Jokic, Morris and Malik Beasley each had three.\n\n\"We played with a lot of energy,\" Murray added. \"We played hard, we came out strong and we played for four quarters, which is great. We just have to keep going.\"\n\nAdded Gary Harris: \"Besides a few slipups here and there, we've been taking care of the teams we need to take care of.\"\n\nCleveland closed out a six-game trip with its third consecutive loss. It has dropped 15 of 16 overall.\n\n\"We couldn't match their size,\" Cleveland coach Larry Drew said. \"They are a big, physical team. We tried to move some things around. We tried to change the game up a little bit, play some zone, but in the end, their size just wore us down.\"\n\nAnte Zizic led the Cavaliers with 23 points. Rodney Hood had 18 points, and Cedi Osman finished with 17.\n\nJokic secured his 22nd career triple- double by late in the third quarter, and the Nuggets carried a 25-point lead into the fourth. They substituted freely throughout the final period.\n\nTIP-INS\n\nCavaliers: G J.R. Smith remains away from the team due to personal reasons. ... F Tristan Thompson was sidelined by left foot soreness.\n\nNuggets: F Juancho Hernangomez missed the game with an abdominal strain. ... Coach Michael Malone said there is still no timeline for the return of G Isaiah Thomas, who is rehabbing from right hip surgery that has sidelined him since last spring. Responding to a report that Thomas could return sometime in February, Malone said: \"There is nothing that has been said about February. You will see him when he is ready to play.\"\n\nUP NEXT\n\nCavaliers: Return home to host the Chicago Bulls on Monday.\n\nNuggets: Play at Utah on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994769.995337
}