{
  "game_id": "0021800235",
  "espn_id": "401070916",
  "date": "Nov 18, 2018",
  "matchup": "LAL @ MIA",
  "headline": "LeBron James scores 51 points, Lakers roll past Heat 113-97",
  "body": "MIAMI --  There was a time when LeBron James getting pestered by Lance Stephenson would have worked out wonderfully for the Miami Heat.\n\nSunday was not one of those times.\n\nThe scenario: It was late in the game, the outcome was decided, and Stephenson -- James' former rival, now his teammate with the Los Angeles Lakers -- challenged him to finish the game off with a 3-pointer.\n\n\"I bet you won't go for the 3,\" Stephenson said.\n\nThe Heat probably wish that conversation never took place. James' capped his 51-point night with a 32-foot 3-pointer in the final seconds, pointed at Stephenson to let him know he was wrong, and the Lakers rolled past the Heat 113-97 for their seventh win in their last nine games.\n\nJames reached 50 for the 13th time in his career, including Game 1 of last season's NBA Finals.\n\n\"It's just playing with greatness,\" Lakers guard Lonzo Ball said. \"Tonight he took the game over.\"\n\nJames shot 19 for 31 from the field, 6 for 8 from 3-point range, became the seventh player to score at least 51 in a game against Miami, and started his two-game reunion tour in sensational fashion. The Lakers' next game is Wednesday night in Cleveland, the only other place besides Miami and L.A. that James has called home as a professional.\n\n\"It's always great to be here,\" said James, who hugged a slew of familiar faces in the arena he used to call home. \"We had some not-so-good times, we had more great times, so it's always a respect factor and a love for the people in Miami and especially the people who work here.\"\n\nAnd finally, he left Miami a winner again. Since leaving the Heat after the 2014 NBA Finals James was 0-4 against Miami; his teams were 0-7, when including the three Cleveland-Miami games that he sat out for various reasons.\n\nJames put on a show.\n\nThe Heat threw a shoe.\n\nIt was their fourth straight home loss and frustrations boiled over. Josh Richardson got ejected in the fourth quarter after throwing one of his sneakers into the stands, upset about a call that he felt he didn't get moments earlier.\n\n\"I just can't let that happen,\" Richardson said.\n\nWayne Ellington scored 19 points for Miami (6-10), which is off to its second-worst start in the last 12 years. The Heat were 5-11 at this point of the 2016-17 season, the only other time they've been worse after 16 games in that span.\n\nRichardson and Tyler Johnson each scored 17 points for the Heat, while Rodney McGruder added 14.\n\n\"We're going to get to work,\" Heat coach Erik Spoelstra vowed.\n\nThey need some health, too. Goran Dragic missed the game for Miami because of a right knee problem, one that will be further evaluated Monday. Dwyane Wade remained on leave after the birth of his daughter, and may return to the Heat this week.\n\nMiami hasn't forgotten James, obviously -- he still gets loud cheers when introduced in his former home arena -- but just in case anyone in attendance needed a reminder of his game, he delivered. He made eight of his first nine shots and had the whole arsenal working; dunks in transition, stepback 3-pointers, turnarounds from the baseline.\n\n\"When he's hitting shots like that, what do you want us to do?\" Heat center Hassan Whiteside mused.\n\nEven with James' greatness, the biggest shot for the Lakers might have come from Brandon Ingram with 3:46 left. Miami had clawed within eight and the shot clock was about to expire on the Lakers, but Ingram connected on a long jumper from the left wing to make it 104-94.\n\nFrom there, the only drama was whether James would get 50. And he did.\n\n\"Just give him the ball,\" Lakers guard Kyle Kuzma said, \"and get out of the way.\"\n\nTIP-INS\n\nLakers: The Lakers arrived Saturday night after playing in Orlando and aren't scheduled to fly to Cleveland until Tuesday. ... Kentavious Caldwell-Pope scored 19 points, Kuzma scored 15 and Ingram finished with 13.\n\nHeat: The last time Miami lost four straight at home was early in the 2014-15 season.... Miami had a five-shot possession in the third quarter, four offensive rebounds coming before Ellington made a 3-pointer.\n\nCONSISTENT LEBRON\n\nWhenever James changes teams -- Cleveland to Miami in 2010, Miami to Cleveland in 2014, Cleveland to the Lakers this past summer -- his new team starts 9-7.\n\nHEAT HELP\n\nJames Johnson played for the first time this season after finally being declared good to go following offseason sports hernia surgery. He had four fouls in the first half and finished with eight points.\n\nUP NEXT\n\nLakers: Visit Cleveland on Wednesday night.\n\nHeat: Host Brooklyn on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995030.217786
}