{
  "game_id": "0022200802",
  "espn_id": "401468957",
  "date": "Feb 05, 2023",
  "matchup": "CHA vs. ORL",
  "headline": "Banchero, Magic win as Hornets struggle from foul line",
  "body": "CHARLOTTE, N.C. -- — Paolo Banchero had 22 points and 10 rebounds, Wendell Carter Jr. added 20 points and 12 rebounds and the Orlando Magic took advantage of Charlotte's poor foul shooting to beat the Hornets 119-113 Sunday.\n\n\r\n              The Hornets made just one of nine free throws in the fourth quarter while Orlando was going 13 of 15. Charlotte finished 11 of 23 from the line in its fourth straight loss — Orlando wound up 27 of 30 on foul shots.\n\n\r\n              “You’re going to lose doing that,” Hornets guard LaMelo Ball said. “It’s very frustrating.”\n\n\r\n              Markelle Fultz had 16 points and Frank Wagner chipped in with 14 for the Magic, who improved to 9-19 on the road. Orlando (22-32) finished its road trip with a 3-1 record.\n\n\r\n              “It shows our resilience and that we can go out and compete with some of the best teams in the league,” Carter said of the road trip, which included wins at Philadelphia and Minnesota.\n\n\r\n              The Magic overcame a terrific second half by Ball, who had 26 of his 33 points after the break and finished with six 3-pointers. Terry Rozier had 24 points for the Hornets, 21 of those in the first half. \n\n\r\n              Charlotte trailed by five after three quarters, but Ball knocked down back-to-back 3s in the first 33 seconds of the fourth period for a 91-90 lead.\n\n\r\n              The Hornets' momentum didn't last long as the Magic built a 110-103 lead behind Fultz, who scored on short jumpers and finished 8 of 13 from the field. Charlotte squandered chance after chance with Plumlee missing four straight free throws and a layup during that span, allowing the Magic to begin pulling away.\n\n\r\n              Wagner helped seal the win with a step-through in the lane for a layup to put the Magic up 115-107 with 35 seconds left.\n\n\r\n              Orlando coach Jamahl Mosley liked how his team stepped up its defense after Ball hit the two 3s to open the fourth quarter. From that point on, the Magic outscored the Hornets 29-22 and limited Charlotte to 10 of 23 from shooting from the floor and allowed just one make from beyond the arc.\n\n\r\n              “Our guys did a really good job communicating, covering for one another and just competing,” Mosley said. \"It’s the last game of a long road trip, and think that’s a great way to end it.”\n\n\r\n              Added Carter: “I think we locked into our game plan when it mattered and got stops when we needed them.\"\n\n\r\n              TRADE RUMORS\n\n\r\n              With the Hornets among the worst teams in the NBA record-wise and their playoff hopes fading fast, trade rumors continue to swirl around Rozier and Plumlee, two potential movable veterans that could allow them to pick up assets.\n\n\r\n              Rozier said after the game Charlotte players have talked among themselves on what might be coming, but said he isn't allowing it to become a distraction.\n\n\r\n              “My name has been in rumors my whole career so I will let the people upstairs do their job and I will do mine,” Rozier said.\n\n\r\n              Coach Steve Clifford praised Rozier for his continued effort despite what has become a forgettable season for Charlotte.\n\n\r\n              “He was the one, I felt like, he was determined,” Clifford said. “He is every night. He plays which such effort and toughness. He’s the one for me that fought like, ‘We’re all tired, we’ve all been playing a lot, let’s find a way to win.’ We need more of that.\"\n\n\r\n              TIP-INS\n\n\r\n              Magic: Mo Bamba and Jalen Suggs sat out following their suspensions from an altercation with the Minnesota Timberwolves. Bamba began serving a four-game suspension, while Suggs served his one-game suspension.\n\n\r\n              Hornets: Ball has now made a 3-pointer in 43 straight games. ... Dennis Smith Jr. had 14 points, but Charlotte's bench was outscored 39-28. \n\n\r\n              UP NEXT\n\n\r\n              Magic: Host Knicks on Tuesday night.\n\n\r\n              Hornets: Visit Washington on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994256.016614
}