{
  "game_id": "0021601127",
  "espn_id": "400900522",
  "date": "Mar 31, 2017",
  "matchup": "CHA vs. DEN",
  "headline": "Hornets make 17 3-pointers in 122-114 win over Nuggets",
  "body": "CHARLOTTE, N.C. --  Hornets coach Steve Clifford is the first to admit his bench play hasn't exactly been the strength of his team this season.\n\nBut on a night when the Hornets desperately needed a win to keep their playoff hopes alive, Charlotte's reserves stepped up big time.\n\nAll-Star Kemba Walker had 31 points, and Charlotte's backups -- led by Frank Kaminsky and Marco Belinelli -- outscored their Denver counterparts 50-19 as the Hornets preserved their slim playoff hopes with a 122-114 win Friday night.\n\nKaminsky scored 22 points and Belinelli added 11 with both knocking down three 3-pointers in a pivotal fourth quarter in which the Hornets outscored the Nuggets 36-20. Jeremy Lamb chipped in with 13 off the bench.\n\n\"Those guys were big,\" Walker said.\n\nThe Hornets shot 17 for 36 on 3-pointers, including 7 for 12 in the fourth quarter to pull within two games of Indiana for the eighth spot in the Eastern Conference. Charlotte made 16 3s in a win earlier this season over the Nuggets.\n\n\"They just kept getting hot and it's tough to stop a team when they get hot,\" said Denver's Nikola Jokic, who finished with a triple-double on 26 points, 13 rebounds and 10 assists.\n\nWhile the Hornets were making their run on the offensive end, the Nuggets suddenly couldn't buy a shot on the other end.\n\nDenver outscored Charlotte 52-32 in the paint, but couldn't convert the simple shots when they needed to the most.\n\n\"We struggled to make layups,\" Nuggets coach Mike Malone said. \"We missed 18 layups tonight, a bunch of those in that fourth quarter. Obviously they were getting run outs and Kaminsky and Marco were hot and they were getting it up quick before we could even get anywhere close to them.\"\n\nCharlotte trailed by eight after three quarters, but scored 12 straight points to open the fourth and take control.\n\nWalker, who refused to come out of the game at the end of the third quarter and played 41 minutes, ignited the run with a long 3-pointer to start the fourth and then scored on a drive and drew a foul. When the Nuggets turned their attention to Walker, that's when Kaminsky and Belinelli took advantage by knocking down 3s from all over the perimeter, while Lamb scored on a couple drives.\n\n\"I think we got more aggressive in the fourth quarter, everybody was aggressive,\" Belinelli said.\n\nThe loss dealt a severe blow to Denver's playoff chances. The Nuggets fell two games behind Portland for the eighth spot in the Western Conference.\n\n\"Definitely losing like this the last two it makes it tough, but we still have to do our job,\" said Denver's Danilo Gallinari. \"Have fun with each other, have fun playing basketball and keep focusing on our job every game.\"\n\nTIP INS\n\nNuggets: Denver made 9 of 19 3s in the first half. ... Mason Plumlee had a chance to play against his brother Miles Plumlee.\n\nHornets: Walker became the second player in team history to scored 8,000 career points when he made a 3-pointer early in the first quarter. The only other player to reach that mark is Dell Curry (9,839), the father of the Warriors' Steph Curry. ... Walker's 52 20-point games this season ranks third in team history.\n\nNELSON LEAVES GAME\n\nNuggets guard Jameer Nelson left the game in the second half with a calf injury and did not return.  Nelson had 12 points in 26 minutes.\n\n\"I'm not sure how severe it is,\" Malone said.\n\nHORNETS GO FIVE OUT\n\nThe Hornets went with a \"five out\" approach in the fourth quarter, replacing center Cody Zeller with Kaminsky to give them more offense. The strategy worked and it's something Clifford said he expect to use more down the stretch.\n\nKEMBA WON'T SIT\n\nWhen Walker told Clifford he wasn't sitting for the fourth quarter, the coach just nodded his head.\n\n\"That's OK by me,\" Clifford said.\n\nUP NEXT\n\nNuggets: At Miami on Sunday night. The Hornets would surely appreciate the Nuggets getting a win there.\n\nHornets: The road doesn't get any easier as they travel to Oklahoma City to face the Russell Westbrook and the Thunder.",
  "source": "espn_api",
  "crawled_at": 1764995462.6105878
}