{
  "game_id": "0022401164",
  "espn_id": "401705730",
  "date": "Apr 09, 2025",
  "matchup": "OKC @ PHX",
  "headline": "Jalen Williams scores 33 to lead Thunder past Suns, who were eliminated from playoff race",
  "body": "PHOENIX -- — Jalen Williams scored 33 points, Chet Holmgren added 22 and the short-handed Oklahoma City Thunder beat Phoenix 125-112 on Wednesday night, eliminating the Suns from the playoff race.\n\n\r\n              Phoenix will miss the playoffs for the first time since 2020 despite having a roster that included the high-priced All-Star trio of Kevin Durant, Devin Booker and Bradley Beal.\n\n\r\n              The Thunder have already wrapped up the No. 1 seed in the Western Conference playoffs and were without several key players on Wednesday, including All-Star guard Shai Gilgeous-Alexander, defensive star Luguentz Dort and center Isaiah Hartenstein.\n\n\r\n              That didn't stop them from topping the Suns, who have lost eight straight. \n\n\r\n              Oklahoma City trailed for nearly the entire first half but rallied in the third quarter for a 105-93 advantage entering the fourth. Williams — who played high school basketball in suburban Phoenix — shot 13 of 23 from the field.\n\n\r\n              The Suns were led by Beal's 25 points. Booker added 20 points and 14 assists. Durant missed the game with a sprained ankle suffered last week.\n\n\r\n              Takeaways\r\n              Thunder: Oklahoma City won its 66th game of the season without three of its best players. The Thunder have won 21 of their past 23 and are just trying to stay heatlhy as the playoffs approach.\n\n\r\n              Suns: A miserable season will end without a trip to the postseason. Phoenix entered the season with championship aspirations, but the Durant-Booker-Beal combo never completely gelled and the supporting cast was inconsistent. First-year coach Mike Budenholzer might not be around to lead the team for a second as an offseason of upheavel looms.\n\n\r\n              Key moment\r\n              The Thunder ended the third quarter on a 12-2 run to take control.\n\n\r\n              Key stat\r\n              After starting the season with an 8-1 record, the Suns are 27-44.\n\n\r\n              Up next\r\n              The Thunder are on the road against the Jazz and the Suns host the Spurs on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997490.833473
}