{
  "game_id": "0022000756",
  "espn_id": "401307548",
  "date": "Apr 04, 2021",
  "matchup": "LAL @ LAC",
  "headline": "Clippers rout short-handed Lakers 104-86, end 2-game skid",
  "body": "LOS ANGELES -- — Marcus Morris scored 22 points and the Los Angeles Clippers dominated the short-handed Lakers in a 104-86 victory on Sunday to end a two-game skid.\n\n\r\n                    Kawhi Leonard had 19 points, 10 rebounds and eight assists, and Paul George added 16 points for the Clippers.\n\n\r\n                    “We set the tone early defensively, we were physical and got into bodies,” Clippers coach Tyronn Lue said. \n\n\r\n                    The Lakers trailed the entire game in which they were without injured All-Star duo LeBron James and Anthony Davis, as well as Andre Drummond and Wesley Matthews. They’ve dropped six of nine.\n\n\r\n                    Montrezl Harrell led the Lakers with 19 points against his old team. Marc Gasol was the only starter in double figures with 11 points.\n\n\r\n                    Kyle Kuzma's shooting typified the Lakers' offensive woes. He was held to six points as one of four starters who combined to shoot 12 of 41. \n\n\r\n                    “We got to play the right way on the offensive end,” Kuzma said. “Defensively, we’ll be all right. Offensively, we got to find ways to play together. Can’t win games scoring in the 80s and 90s. Got to find ways to incorporate everyone.”\n\n\r\n                    The Clippers built a double-digit lead midway through the second that the Lakers never reduced to single digits the rest of the way.\n\n\r\n                    “Credit the Clippers' defense,” Lakers coach Frank Vogel said. “They got up into us and we didn’t handle their pressure at all and we had a tough shooting night. We got to play through their pressure and physicality better than we did.” \n\n\r\n                    Five different Clippers powered a 12-3 run to start the third, with George's 3-pointer capping the spurt that created their largest lead of 24 points. They matched that lead later in the quarter on a 3-pointer by Luke Kennard, who scored 12 of his 15 points in the fourth.\n\n\r\n                    The Clippers stretched their lead to 20 points in the second, running off 10 in a row that ended with back-to-back 3-pointers by Marcus Morris.\n\n\r\n                    The Clippers raced to a 13-2 lead to open the game, making their first six shots. Markief Morris scored the Lakers' first seven points. \n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: James has missed two weeks with a right ankle sprain. He tweeted Sunday, “Man I Wanna Hoop! Miss It So Much!” Vogel said James and Davis will join the team for the rest of its five-game road trip, although both are “still a ways away.” Davis has missed 22 games with a right calf strain. ... Drummond (right big toe contusion) still has trouble putting on a shoe and remains in great discomfort. ... No Laker reached double figures in the first half.\n\n\r\n                    Clippers: Patrick Beverley (sore right knee) and Serge Ibaka (tight lower back) have each been out since mid-March. Beverley has been playing 5-on-5, but Ibaka has yet to reach that stage. \n\n\r\n                    RUSTY RONDO \n\n\r\n                    Former Laker Rajon Rondo made his Clippers debut, scoring two points while playing 13 minutes after an injury. He committed four turnovers and had four fouls to go with three assists and two steals. “Just trying to fit in and getting the timing,\" Lue said. “You could just tell his pace brings a different something to our team. We need that.” Rondo missed four games with right adductor soreness after being acquired from Atlanta last month for three-time Sixth Man of the Year Lou Williams. \n\n\r\n                    DUELING BROTHERS\n\n\r\n                    The Morris brothers dueled throughout the game. Marcus scored 22 points to lead the Clippers, while Markief had all of his nine in the first quarter for the Lakers. The identical twins guarded each other at times, with Marcus fouling his brother early in the game. Markief made the free throw to complete the three-point play. “When we were young, we didn’t really go against each other,” Marcus said. “We always went against other people and honestly, I think that’s the reason we’re in the NBA now.”\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Visit Toronto on Tuesday.\n\n\r\n                    Clippers: Host Portland on Tuesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997291.349501
}