{
  "game_id": "0021800846",
  "espn_id": "401071519",
  "date": "Feb 11, 2019",
  "matchup": "OKC vs. POR",
  "headline": "Westbrook sets new triple-double record in Thunder win",
  "body": "OKLAHOMA CITY --  Chalk up another triple-double record for Russell Westbrook.\n\nWestbrook set an NBA record with his 10th straight triple-double, Paul George scored 47 points and the Oklahoma City Thunder beat the Portland Trail Blazers 120-111 on Monday night.\n\nWestbrook broke a tie with Wilt Chamberlain, who had nine straight triple-doubles in 1968, by finishing with 21 points, 14 rebounds and 11 assists. Westbrook already was the only person to average a triple-double in consecutive seasons, and he set the single-season record for triple-doubles with 42 in 2016-17.\n\nHe downplayed this record while still showing respect for Chamberlain.\n\n\"I just go play the game the right way,\" he said. \"It's what I do. Go out and compete every night and leave it on the floor, and whatever happens, happens. I'm very, very blessed to be able to go out and play, and I don't take it for granted.\"\n\nWestbrook clinched the record on an assist to George for a 3-pointer with 3:52 remaining in the fourth quarter.\n\n\"I thought he had it already,\" George joked. \"Usually, Russ has that by the first quarter. I didn't know it was that close.\"\n\nIt was Westbrook's 23rd triple-double of the season and the 127th of his career. Most important to the Thunder, the team has a 9-1 record during his triple-double run.\n\n\"I do know the most important thing for him is to win,\" Thunder coach Billy Donovan said. \"That's what he's about. He wants to win. I think a lot of the things he does that he gets attention for in terms of the triple-doubles are things that impact winning for our team.\"\n\nGeorge had 12 rebounds and 10 assists for the third triple-double of his career. Rookie Deonte Burton had a career-high 18 points and Raymond Felton added a season-high 15 for the Thunder.\n\nDamian Lillard scored 31 points and Jake Layman added 17 for Portland.\n\nThe Thunder shot 56 percent in the first half to lead 68-49 at the break. George scored 21 points and Felton added 15.\n\nThe Trail Blazers started the second half on a 7-0 run to make things interesting, and they trimmed Oklahoma City's lead to 87-82 by the end of the third quarter.\n\nWestbrook had five assists heading into the fourth, and after a rest, he re-entered the game with 9:36 remaining. He got his first assist of the quarter with 6:54 left and was up to his ninth with 4:57 to play.\n\nWestbrook made a 3-pointer in the final minute that gave George his triple-double. Westbrook told George that he was one assist away.\n\n\"Yeah, we talked about it right before that play,\" George said. \"I was clueless at that moment. But he told me the situation. So, it's cool to be on the other end of the triple-double.\"\n\nWestbrook figured he might as well get a different kind of assist.\n\n\"It's amazing to go out and compete,\" he said, \"to see your teammate, your brother, do amazing things, and you can be right on the side of him doing something special as well.\"\n\nTIP INS\n\nTrail Blazers: CJ McCollum was called for a technical in the second quarter. ... McCollum shot 4 for 15. ... Portland shot 33.3 percent in the first half.\n\nThunder: Forward Jerami Grant (right ankle sprain) and guard Dennis Schroder (personal reasons) did not play. ... George scored 17 points in the first quarter. ... Burton hit a 3-pointer at the first-quarter buzzer. ... Forward Patrick Patterson got his fourth start of the season in Grant's place.\n\nSTAT LINES\n\nLillard made 1 of 10 shots and scored six points in the first half, then made 8 of 12 shots and scored 25 points after the break.\n\nHAMMER TIME\n\nHip-hop legend MC Hammer attended the game and chatted with Westbrook for several minutes afterward.\n\nQUOTABLE\n\nGeorge, on the vibe in the arena as Westbrook tried to set the triple-double record: \"It just felt amazing. The energy was awesome.\"\n\nUP NEXT\n\nPortland hosts Golden State on Wednesday.\n\nOklahoma City plays at New Orleans on Thursday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994570.403293
}