{
  "game_id": "0021900205",
  "espn_id": "401160847",
  "date": "Nov 20, 2019",
  "matchup": "CHA @ BKN",
  "headline": "Allen leads Nets to 101-91 victory over Hornets",
  "body": "NEW YORK --  Without Kyrie Irving for the third straight game due to an injured right shoulder, the Brooklyn Nets used a trio of players to pick up the slack.\n\nJarrett Allen led the way with 22 points and a season-high 17 rebounds, and the Nets beat the Charlotte Hornets 101-91 on Wednesday night.\n\n\"I just thought (Allen) was huge,\" Nets coach Kenny Atkinson said. \"They went small, they put Marvin (Williams) at the 5. We said we'll stick with JA, and I thought he did two great things. He guarded when we switched, he guarded their smalls, and then he punished them on the other end with his offensive rebounding.\"\n\nTaurean Prince and Spencer Dinwiddie added 20 points apiece for Brooklyn. It marked the first time the Nets had three players score 20 or more points in a game.\n\nTerry Rozier had 18 points and Devonte' Graham added 17 for Charlotte, which lost its second straight game.\n\nCharlotte held the Nets to two points through the first five minutes of the fourth quarter to cut the deficit to 84-81.\n\n\"We're struggling to score the ball,\" Atkinson said. \"We're going to have to go to the drawing board and find some solutions there. It's tough to defend when you're not putting it in the hole. We have to get back to getting to the free throw line. I feel like we've slipped there. We're hanging out hat on our defense right now.\"\n\nPrince agreed.\n\n\"I think our offense was sparked by the defense tonight,\" Prince said. \"I think we kept the lead when we needed to and it raised our level of intensity on the defensive end when we needed it to as well.\"\n\nThe Nets regrouped from their offensive slump to start the quarter by holding the Hornets to five points over the next five minutes. Prince's driving layup gave the Nets a 95-86 lead with 3:28 remaining during that span and they never looked back.\n\n\"I think they did a good job with their switching. I think their switching really slowed us down a little bit,\" Charlotte's Marvin Williams said. \"We got a little stagnant out there. We just have to continue to move the ball and move bodies to combat some of that switching. So, give those guys a lot of credit. They played well tonight.\"\n\nBrooklyn held the Hornets to 73 points, the fewest the Nets have allowed through three quarters this season, to take a nine-point lead into the fourth quarter. Allen led the Nets with 11 points in the third.\n\nThe Nets took a 56-51 lead into the locker room at the half as Prince and DeAndre Jordan led all scorers with 12 points apiece\n\nBoth teams scored 26 apiece in the first quarter as Prince led the Nets with nine points and Bismack Biyombo scored eight for Charlotte.\n\nTIP-INS\n\nHornets: Coach James Borrego credited Graham's strong start to studying Kemba Walker and Tony Parker last season. ... Charlotte shot 37%.\n\nNets: Atkinson on Irving's injury status: \"I don't think it's a long-term thing. I wouldn't say we're being overcautious. . Do I think it's a long-term thing? No. I don't think he can play through it right now quite honestly. That's where we are. We'll see where that goes.\" . Caris LeVert (right thumb surgery) is also out for Brooklyn.\n\nCENTERS OF ATTENTION\n\nAllen's 22 points equaled the highest total he and Jordan had combined for in a game this season. They totaled 36 on Wednesday, with Jordan making all five shots in his 14-point outing.\n\nUP NEXT\n\nHornets: Visit Washington on Friday night.\n\nNets: Host Sacramento on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996103.172212
}