{
  "game_id": "0022200141",
  "espn_id": "401468296",
  "date": "Nov 06, 2022",
  "matchup": "TOR vs. CHI",
  "headline": "VanVleet has 30 points and 11 assists as Raptors beat Bulls",
  "body": "TORONTON -- — Fred VanVleet returned from injury with season highs of 30 points and 11 assists, Scottie Barnes had 19 points and 10 rebounds, and the Toronto Raptors overcame the absence of leading scorer Pascal Siakam to beat the Chicago Bulls 113-104 on Sunday.\n\n\r\n              O.G. Anunoby scored 22 points, Gary Trent Jr. had 12 and Christian Koloko added career highs of 11 points and six blocks.\n\n\r\n              VanVleet returned after missing three games because of a sore lower back. He made five of Toronto’s 10 3-pointers.\n\n\r\n              “You always want your point guard in the lineup,” Koloko said. “We need him. He’s one of our best shooters.”\n\n\r\n              Nikola Vucevic had 18 points and 12 rebounds, Alex Caruso had a career-high 11 rebounds and 11 assists and DeMar DeRozan scored 20 points for the Bulls, who lost their second straight.\n\n\r\n              DeRozan shot 7 for 9, matching his season low for field goal attempts.\n\n\r\n              “I don’t know what other choices you’ve got other than to go try to get it out of his hands a lot,” Raptors coach Nick Nurse said of his defensive focus on DeRozan.\n\n\r\n              Chicago guard Goran Dragic matched his season high with 16 points, Ayo Dosunmu scored 15 and Patrick Williams had 13.\n\n\r\n              Siakam is expected to miss at least two weeks because of a strained right adductor muscle. Siakam was injured when slipped and fell in the third quarter of Friday’s loss at Dallas.\n\n\r\n              VanVleet said the Raptors have several players ready to step up while Siakam is out.\n\n\r\n              “If you’re on the end of the rotation, your eyes should be big and your mouth should be watering,” VanVleet said.\n\n\r\n              Zach LaVine sat for the Bulls, who host Toronto on Monday night in the second game of this back-to-back.\n\n\r\n              LaVine, who had left knee surgery in the offseason, sat out the first two games of the year and missed the first game of a back-to-back in late October.\n\n\r\n              VanVleet scored 30 or more eight times last season. Toronto was 7-1 in those games.\n\n\r\n              “Hell of a player, one of the best point guards in this league,” DeRozan said of his former teammate. “I didn’t expect anything less from him. That's who he is, aggressive, changes the dynamic of the game.”\n\n\r\n              Chicago trailed 100-99 after a dunk by Williams with 4:23 left to play, but VanVleet converted a three-point play and Anunoby scored on a driving dunk after stealing Caruso’s pass to give the Raptors a 105-99 edge with 3:47 to go.\n\n\r\n              DeRozan’s three-point play with 2:01 remaining made it 107-102, but dunks from Barnes and Anunoby, the second off a bad pass from DeRozan, extended Toronto’s lead to 111-102.\n\n\r\n              Chicago had 17 turnovers, leading to 23 points for Toronto. DeRozan led the Bulls with five turnovers.\n\n\r\n              “I thought some of them were very careless,” Bulls coach Billy Donovan said of his team’s miscues.\n\n\r\n              Chicago led 36-33 one minute into the second quarter, but VanVleet scored 11 points in the period to give the Raptors a 55-49 halftime lead.\n\n\r\n              Toronto took an 83-82 edge to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: C Andre Drummond (left shoulder) sat for the fifth straight game, while G Coby White (left quadriceps) missed his fourth straight. … Vucevic had six assists.\n\n\r\n              Raptors: C Khem Birch (right knee) was out for the second straight game. … Koloko had four blocks in the first quarter, one more than his previous single game high. … VanVleet shot 7 for 7 at the free throw line.\n\n\r\n              EARLY CHALLENGE\n\n\r\n              Nurse successfully challenged a foul call against VanVleet after DeRozan drove on him with 10:22 left in the first quarter.\n\n\r\n              “I clearly saw Fred didn’t touch him,” Nurse said. “I didn’t want him to get in early foul trouble.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Toronto Monday night.\n\n\r\n              Raptors: Visit Chicago Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994101.098517
}