{
  "game_id": "0021500624",
  "espn_id": "400828511",
  "date": "Jan 18, 2016",
  "matchup": "HOU @ LAC",
  "headline": "Redick's career-high 40 help Clippers beat Rockets in OT",
  "body": "LOS ANGELES -- J.J. Redick was getting tired of the Los Angeles Clippers losing to the Houston Rockets, so he finally took matters into his own sharp-shooting hands -- with plenty of help from Chris Paul, of course.\nRedick scored a career-high 40 points and the Clippers made a franchise-record 22 3-pointers in a 140-132 overtime win against the Houston Rockets on Monday night.\nThe Rockets eliminated the Clippers from the playoffs last year, winning in seven games after trailing three games to one in the second round. They also won the first two meetings this season.\n\"I think I take most losses personally, not just to the Rockets,\" Redick said. \"But going back to last year, we had lost five in a row. C.P. and I talked earlier today just about how frustrating it's been. They're a team that thinks they're better than us, and rightfully so given the results over the past season and a half. So it was important tonight for us to hit them first and be more aggressive from the start.\"\n\nRedick connected on his first five attempts behind the arc and finished 9 for 12 on 3-pointers, tying Caron Butler's club record for 3s and coming within three makes of the NBA single-game record shared by Kobe Bryant and Donyell Marshall.\n\"It was one of those games where neither team could get a stop, and there were several players that were the beneficiary of that -- myself included,\" Redick said.\nRedick set a franchise single-season record for 3-pointers in 2014-15 with 200. He has 103 at the midway point of this season.\nPaul had 28 points and 12 assists for the Clippers, whose season-best 10-game winning streak ended Saturday night with a 110-103 home loss to Sacramento. Paul, Redick and Jamal Crawford each made 3-pointers while the Clippers opened overtime on a 9-2 run.\nDwight Howard had 36 points and tied a career high with 26 rebounds en route to his 10th straight double-double, the league's longest active streak, and his longest since a 14-game run three seasons ago. He secured it before halftime with 13 points and 15 boards.\nHouston native DeAndre Jordan was back in the lineup for Los Angeles and had 16 points and 15 rebounds in 41 minutes for his ninth straight double-double. He missed two games with pneumonia that ended his consecutive game streak at 360.\nHoward, a career 57.1 percent free-throw shooter coming in, delighted the sellout crowd by throwing up an air ball from the line in the second quarter, but he finished an uncharacteristic 14 for 18. James Harden, the league's No. 2 scorer, had 20 points and Marcus Thornton had 23 points and five 3-pointers.\nAfter Redick converted two free throws with 16.4 seconds left in regulation for a 118-114 lead, Marcus Thornton made a 3-pointer at the other end with 14.4 seconds remaining to make it a one-point game.\nRedick made two more free throws, but Thornton came back with a 3-pointer with 7.4 seconds left to tie it. Paul missed a 3 at the buzzer.\n\"We knew we were going to find our rhythm. It was just about making it happen,\" Harden said. \"I think if we would have found it a little bit earlier, we would have been in a better situation. I'm just proud of our guys and the way they fought back. Marcus made some big shots.\"\nLos Angeles coach Doc Rivers sat all of his starters at the beginning of the fourth quarter with a 94-80 lead, and the Rockets sliced the margin to 102-96 with 7:13 to play. Thornton capped the rally with a 3-pointer, forcing Redick and Jordan to join Paul back on the floor.\n\"Our execution on the last couple of plays that let them have 3s was poor,\" Rivers said. \"But what I liked was that everyone was furious going into overtime. We got our composure back and played well.\"\nTIP-INS\nRockets: Houston led the league in 3-point defense last year at 32.2 percent and was limiting opponents to 34.9 percent this season. The Clippers were 15 of 60 from behind the arc in two previous meetings with the Rockets this season. ... The Rockets had won their previous 11 overtime games since losing at Golden State on Feb. 20, 2014. ... Point guard Patrick Beverley was back in the starting lineup for Houston and played 16 scoreless minutes after missing a 112-95 victory Sunday night over the Lakers because of a sprained left ankle.\nClippers: Paul got a technical foul with 3:10 left in the second quarter after he was called for an offensive foul while attempting a 3-pointer that missed. The Clippers lead the league with 24 technicals, not counting defensive 3-second violations. ... Jordan and Howard are among three players in NBA history to lead the league in rebounding average and field goal percentage in the same season. The other is Wilt Chamberlain.\nUP NEXT\nRockets: Host Detroit on Wednesday night.\nClippers: At Cleveland on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994630.339823
}