{
  "game_id": "401810012",
  "espn_id": "401810012",
  "date": "Nov 03, 2025",
  "matchup": "IND vs MIL",
  "headline": "Antetokounmpo hits buzzer-beater to send Bucks past Pacers 117-115 in Turner's Indy return",
  "body": "INDIANAPOLIS -- — Giannis Antetokounmpo made a 17-foot buzzer-beating jumper to give the Milwaukee Bucks a 117-115 victory over the short-handed Indiana Pacers on Monday night.\n\n\r\n              Antetokounmpo had 33 points, 13 rebounds and five assists on a night he went 14 of 21 from the field. Kyle Kuzma added 15 points to help the Bucks win for the third time in four games, taking the first of four scheduled regular season matchups against a Central Division rival it has faced 22 times since the start of the 2023-24 season.\n\n\r\n              This time, though, longtime Pacers center Myles Turner was dressed in a Bucks jersey after signing a free-agent deal in July. Fans serenaded him with boos all night, starting with a pregame video tribute that played even before player introductions.\n\n\r\n              Turner had nine points, seven rebounds and five blocks while connecting on 3 of 7 shots and scoring only two points in the second half, a short, tiebreaking basket with 2:22 left.\n\n\r\n              Pascal Siakam led the Pacers with 32 points and eight assists. Turner's replacement, Isaiah Jackson, had 21 points and 10 rebounds. It was Jackson's highest scoring total since a 26-point game in January 2022.\n\n\r\n              Indiana eliminated Milwaukee in the first round of the playoffs each of the past two years and this one had the same kind of feel, with the score close throughout.\n\n\r\n              And it looked the Pacers might steal another one when they charged back from an 11-point deficit with 6:08 to go, finally tying it on Aaron Nesmith's driving layup with 14.6 seconds left.\n\n\r\n              After calling a timeout, Milwaukee inbounded the ball to Antetokounmpo, who never gave it up before hitting the winner.\n\n\r\n              Up next\r\n              Bucks: At Atlanta on Tuesday night.\n\n\r\n              Pacers: Host Brooklyn on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042552.3279612
}