{
  "game_id": "0021801045",
  "espn_id": "401071716",
  "date": "Mar 17, 2019",
  "matchup": "CHA @ MIA",
  "headline": "Dragic, Wade lead Heat past Hornets, 93-75",
  "body": "MIAMI --  Dwyane Wade arrived for work on Sunday not expecting to play much, if at all. His bruised right hip was sore and he was feeling pain with every step.\n\nHe offered to play for a couple of minutes.\n\nHe wound up playing 28, even diving on that bad hip for a loose ball with the outcome still in the balance -- and helping the Miami Heat get perhaps the most important win of their season.\n\nGoran Dragic scored 19 points off the bench, Wade added 17 and the Heat found just enough offense to beat the Charlotte Hornets 93-75 in a game with major Eastern Conference playoff implications. The win kept Miami (33-36) at the No. 8 spot in the East race -- and moved the Heat two games up on No. 10 Charlotte (31-38), with 13 games left for both clubs.\n\n\"Just thankful I could go out there and contribute,\" Wade said.\n\nHe did more than contribute. Even with the bad hip -- hurt on a hard fall Friday night in Miami's loss to Milwaukee -- the 6-foot-4 Wade won a jump ball against Frank Kaminsky midway through the fourth quarter after hitting the floor for a tie-up, then blocked a layup try by Dwayne Bacon about two minutes later and hit a 3-pointer on the ensuing Heat possession.\n\nThat put Miami up 13, and the Heat cruised from there.\n\n\"I'm really going to miss that,\" Heat coach Erik Spoelstra said of the late heroics from the soon-to-be-retired Wade. \"He's a warrior. He knows how important a game like this is. Just the fact that he wasn't able to go through the walkthrough but then he does everything he possibly can ... that's the kind of message that you love your young players getting from a Hall of Fame player.\"\n\nIt was an ugly win: The 168 combined points was the lowest in the NBA this season. Orlando and Chicago combined for 170 on Dec. 21. Charlotte's 75 points were a season-low and tied the third-worst total in the NBA this season.\n\nBam Adebayo finished with 16 points and nine rebounds for Miami. Dion Waiters added 12 for the Heat.\n\nJeremy Lamb led Charlotte with 21 points. Kaminsky scored 13 and Nic Batum had 12, while Kemba Walker scored 10 on 4-for-16 shooting.\n\n\"In the fourth quarter we couldn't make a shot,\" Hornets coach James Borrego said.\n\nThat was sort of an every-quarter issue for Charlotte, which shot a season-worst 31 percent -- along with 19 percent from 3-point range. They were also the best numbers of the season for the Heat defense in both categories.\n\nMiami blitzed Walker all game, and it paid off. And eventually the Heat found a rhythm, outscoring Charlotte 32-15 in the fourth quarter to pull away from what was a 61-60 Heat lead going into the final 12 minutes.\n\n\"They do a great job,\" Walker said. \"They have very athletic guys. They make sure I get rid of the basketball. That's their main goal.\"\n\nIt was 39-39 at the half, a 24-minute stretch that featured one clank after another. The Heat shot 33 percent, the Hornets shot 35 percent, and they combined to go 7 for 35 (20 percent) from 3-point range.\n\nThe difference was Miami heated up, shooting 47 percent after halftime. Charlotte regressed to 28 percent in the last two quarters.\n\nTIP-INS\n\nHornets: Cody Zeller (left knee soreness) did not play. \"There's still swelling there that we have to be cautious with,\" Borrego said. ... It was the 36th and almost certainly final time that Tony Parker got to play against Wade, including their NBA Finals matchups in 2013 and 2014. ... Charlotte hasn't won twice at Miami in the same regular season since 2001-02. The Hornets could have changed that Sunday.\n\nHeat: Justise Winslow (right thigh bruise) didn't play. .. Josh Richardson was 2 for 17, 0 for 9 on 3s. ... Waiters was 4 for 5 on 3s after halftime. ... James Johnson played for the first time in 12 games, after missing time with a shoulder issue and then falling out of the rotation. He played the entire fourth quarter, making a pair of 3s.\n\nSLOW START\n\nThere have been five games in the NBA this season where neither team reached 40 points by halftime -- and Miami has been in three of them. The 39 points tied Miami's fourth-worst first half total of the season, and was Charlotte's third-worst total.\n\nEARLY START\n\nThe 1 p.m. local tip time was the earliest of the season for the Heat -- for now. Miami has a noon game at Toronto on April 7. Charlotte has played a pair of 1 p.m. starts; the Hornets lost 118-108 to Portland on March 3.\n\nUP NEXT\n\nHornets: Host Philadelphia on Tuesday.\n\nHeat: Visit Oklahoma City on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994349.2103198
}