{
  "game_id": "0021700461",
  "espn_id": "400975212",
  "date": "Dec 20, 2017",
  "matchup": "DAL vs. DET",
  "headline": "Barnes scores 25, Mavs top Pistons 110-93 in Smith's return",
  "body": "DALLAS --  Dennis Smith Jr. fooled Reggie Jackson by faking one way, spinning the other and hitting a jumper while drawing a foul as Detroit's veteran guard scrambled back to the Dallas rookie.\n\nThe ninth overall pick in the draft returned after missing six games with a strained left hip, and Rick Carlisle certainly noticed the difference in a 110-93 victory over the Pistons on Wednesday night, even though the coach called Smith's return \"bad, great, shaky and good.\"\n\n\"When he came back in the second quarter, his stretch was the decisive stretch of the game,\" Carlisle said. \"It got our crowd into it, energized the team. Nobody else on our team can make those plays like he can.\"\n\nHarrison Barnes scored 25 points, Smith had 15 points and five assists and the Mavericks, last in the Western Conference, won for just the second time in eight games -- five of those losses without Smith.\n\nAnthony Tolliver led Detroit with a season-high 18 points, going 4 of 6 from 3-point range. Stanley Johnson also had a season high with 16 points, and Andre Drummond had 11 points and 13 rebounds while battling foul trouble.\n\nThe Mavericks shot 79 percent (15 of 19) in the second quarter for their highest-scoring quarter (43) and half (65) of the season, taking a 12-point lead after trailing by nine in the first quarter.\n\nSmith capped a 17-4 finishing run in the first half with a 3-pointer followed by the play against Jackson , who finished with six points of 3-of-9 shooting. Smith was 5 of 10 from the field with five rebounds.\n\n\"No resistance whatsoever,\" Detroit coach Stan Van Gundy said. \"We couldn't contain any of their guards. They were right by us all night long.\"\n\nSmith struggled against Jackson early, and the Mavericks started their rally with him on the bench. But they went ahead for good with him on the floor during his 11-point second quarter.\n\n\"I was just coming out trying to do what I do,\" Smith said. \"My legs were heavy at first. I had to get my second wind. The bad, the good, the shaky, I don't know about that.\"\n\nBarnes was 8 of 15 from the field, 3 of 5 from long range and made all six of his free throws while leading Dallas with seven rebounds.\n\nDirk Nowitzki scored 12 points, including a 3-pointer for Dallas' biggest lead to that point, a 23-point edge (92-69) early in the fourth quarter. J.J. Barea had one of his game-high seven assists on the bucket.\n\nTobias Harris, Detroit's leading scorer, scored 10 points on 4-of-16 shooting, missing all four shots from 3.\n\nTIP-INS\n\nPistons: Drummond had nine rebounds in 17 minutes at halftime, leaving with 3 1/2 minutes left with his third foul. He picked up his fourth and went back to the bench with seven minutes left the third. ... Ish Smith scored 15 points, two shy of his season high.\n\nMavericks: G Kyle Collinsworth scored his first NBA points on a 3 in his debut a day after signing a two-way contract. ... C Salah Mejri had four blocks and was called for goaltending twice in the first half.\n\nJ. COLE SIGHTING\n\nSmith said it wasn't a big deal to have hip hop artist and fellow Fayetteville, North Carolina, product J. Cole watching courtside -- and cheering demonstratively. Smith said Cole was a frequent visitor for games at North Carolina State, and during the summer league in Las Vegas. The pair was planning to grab dinner after the game.\n\nAs for Cole going onto the court briefly to celebrate Smith's three-point play, Smith said he wasn't surprised. \"That's how he is,\" Smith said with a smile.\n\nTHIRD-QUARTER CLUNKER\n\nThe problem was offense for Detroit in the third, with the Pistons going seven minutes without a field goal and shooting 22 percent (4 of 18) after holding Dallas scoreless the first 3 1/2 minutes of the quarter.\n\nUP NEXT\n\nPistons: Home against the Knicks on Friday night.\n\nMavericks: At Miami on Friday night to start a stretch of five of six on the road.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993957.871967
}