{
  "game_id": "0022401180",
  "espn_id": "401705746",
  "date": "Apr 11, 2025",
  "matchup": "MEM @ DEN",
  "headline": "Jokic clinches triple-double average, Murray returns in the Nuggets' 117-109 win over the Grizzlies",
  "body": "DENVER -- — Nikola Jokic became the third player in NBA history to average a triple-double for a season, Jamal Murray hit several clutch shots in his return and the Denver Nuggets beat the Memphis Grizzlies 117-109 on Friday night.\n\n\r\n              After a slow start offensively, Jokic had his 34th triple-double with 26 points, 16 rebounds and a dozen assists. He wrapped up a triple-double average with his fourth assist of the night. The other players to average a triple-double for a full season: Russell Westbrook, Jokic’s current Denver teammate, and Basketball Hall of Famer Oscar Robertson.\n\n\r\n              Aaron Gordon led Denver with 33 points, and Murray chipped in 15 points in his return from a sprained right ankle that sidelined him six games.\n\n\r\n              Desmond Bane led Memphis with 24 points. Ja Morant added 21 for the Grizzlies, who led by as many as 15 in the first half but watched the Nuggets chip away until closing the game on a 14-1 run over the final six minutes.\n\n\r\n              The Nuggets improved to 49-32, strengthening their bid for home-court advantage in the Western Conference playoffs, and the Grizzlies fell to 47-34.\n\n\r\n              Takeaways\r\n              Grizzlies: After getting fined for celebrating 3-pointers with a finger guy pointed at the opponents' bench, Morant continued doing what looks like a grenade pull and lob after big buckets, although he insists it's not what it looks like, telling ClutchPoints, “I'm taking my words and I'm throwing them out there.\"\n\n\r\n              Nuggets: Westbrook also came up clutch for the Nuggets, scoring 14 points.\n\n\r\n              Key moment\r\n              During pregame introductions, Murray's name was announced for the first time since March 26 against Milwaukee. \n\n\r\n              Key stat\r\n              The Grizzlies were just 11 of 31 on 3-pointers in the first half but Denver was a meager 1 of 15. Memphis finished 14 of 43 and Denver 5 of 24.\n\n\r\n              Up next\r\n              Both teams play Sunday. The Grizzlies head home to host Dallas, and the Nuggets travel to Houston to face the Rockets, who have wrapped up the No. 2 seed in the West.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/nba",
  "source": "espn_api",
  "crawled_at": 1764997714.069652
}