{
  "game_id": "0022401131",
  "espn_id": "401705697",
  "date": "Apr 05, 2025",
  "matchup": "MIL @ MIA",
  "headline": "Antetokounmpo's 2nd straight triple-double lifts Bucks over Heat in OT, 121-115",
  "body": "MIAMI -- — Giannis Antetokounmpo had 36 points, 15 rebounds and 10 assists, Kevin Porter Jr. had 24 points off the bench and the Milwaukee Bucks beat the Miami Heat 121-115 in overtime Saturday night.\n\n\r\n              Porter had 12 rebounds, eight assists and a layup with 11 seconds left in overtime for a 119-115 lead.\n\n\r\n              Bam Adebayo had 31 points, 12 rebounds and five assists for Miami, which got a season-high 24 from Alec Burks and 20 from Davion Mitchell.\n\n\r\n              The Bucks (43-34) clinched a playoff berth earlier Saturday when New York beat Atlanta, then moved past Detroit — which lost to Memphis — into the No. 5 spot in the Eastern Conference.\n\n\r\n              Miami (35-43) fell a half-game behind Chicago in the race for No. 9 in the East. The Heat are 1 1/2 games behind No. 8 Atlanta and three games behind No. 7 Orlando.\n\n\r\n              The Heat played without Tyler Herro (right thigh), Andrew Wiggins (right hamstring) and Kevin Love (personal reasons).\n\n\r\n              Takeaways\r\n              Bucks: Antetokounmpo gifted Bucks coach Doc Rivers the game ball from his 35-point, 17-rebound, 20-assist game against Philadelphia on Thursday — a reward for Rivers passing Phil Jackson for No. 7 on the all-time wins list. “He doesn't know he's getting the ball back,” Rivers said.\n\n\r\n              Heat: Miami coach Erik Spoelstra raved about managing general partner Micky Arison's selection into the Basketball Hall of Fame. “He’s been a blessing to South Florida sports,” Spoelstra said. “We’ve been able to put basketball on the map in South Florida in previously what was a football city.\"\n\n\r\n              Key moment\r\n              Porter Jr.'s layup was immediately followed by a Heat turnover, and that was it.\n\n\r\n              Key stat\r\n              The Heat never trailed by more than eight on Thursday against Memphis and their biggest deficit Saturday was seven points. They went 0-2 in those games.\n\n\r\n              Up next\r\n              The Bucks visit New Orleans on Sunday. The Heat host Philadelphia on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997815.1376371
}