{
  "game_id": "0022400255",
  "espn_id": "401704821",
  "date": "Nov 20, 2024",
  "matchup": "MEM vs. PHI",
  "headline": "Jackson, Bane lead Grizzlies to 117-111 victory over Philadelphia",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 25 points, Desmond Bane added 21 points and 10 rebounds and the Memphis Grizzlies set a season-high with 19 3-pointers in a 117-111 win over the Philadelphia 76ers on Wednesday night.\n\n\r\n              Jaylen Wells added 14 points for Memphis as Grizzlies head coach Taylor Jenkins became the winningest coach in franchise history.\n\n\r\n              Joel Embiid led the Sixers with 35 points and 11 rebounds, but Philadelphia lost its fifth straight. Rookie Jared McCain finished with 20 points, while Guerschon Yabusele added 17 points.\n\n\r\n              Memphis, which led 115-100 with 3:15 left, had to withstand a late Philadelphia rally to capture the victory.\n\n\r\n              Takeaways\r\n              76ers: While the Sixers had Tyrese Maxey and Paul George back, Embiid got little help from the other two. Maxey had eight points and George added two.\n\n\r\n              Grizzlies: Jenkins passed Lionel Hollins for the winningest coach in Grizzlies history, and now has 215 victories.\n\n\r\n              Key moment\r\n              The biggest key could have been when the starting lineups were announced. For the first time this season, Philadelphia's three key players — Embiid, George and Maxey — started. Until Tuesday, injuries and league suspensions had kept the trio from appearing on the floor together. It only lasted until early in the second half when George left the game with hyperextended left knee. Team officials said further testing will be done Thursday.\n\n\r\n              Key stat\r\n              Memphis had struggled recently from 3-point range, (33.3%) and Bane was among those having trouble going 2 of 16 from beyond the arc in his last three games. Memphis connected on eight 3-pointers in the second quarter with Bane hitting on three and 4 of 7 in the half as the Grizzlies took the advantage to double digits. A 20-9 rally to open the fourth sealed the victory.\n\n\r\n              Up next\r\n              Philadelphia hosts Brooklyn on Friday night. The Grizzlies travel to Chicago to face the Bulls on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997750.605252
}