{
  "game_id": "0022300661",
  "espn_id": "401585289",
  "date": "Jan 29, 2024",
  "matchup": "MIA vs. PHX",
  "headline": "Gordon scores 23, Booker scores 22 and Suns add to Miami's woes with 118-105 win",
  "body": "MIAMI -- — The Phoenix Suns are figuring things out. The Miami Heat had better do the same soon.\n\n\r\n              Eric Gordon scored 23 points off the bench, Devin Booker scored 22 and the Suns added to Miami's woes with a 118-105 win Monday night, handing the Heat their seventh consecutive loss.\n\n\r\n              Kevin Durant scored 20 and Bradley Beal had 19 for the Suns, who are 8-2 in their last 10 games and swept the Heat for just the second time in the last 17 seasons. The other was 2020-21, when Phoenix made the NBA Finals.\n\n\r\n              “Trying to get wins, that’s the name of the game,” Booker said after the Suns got a split of their Florida back-to-back following a Sunday night loss in Orlando. “We have some things to figure out defensively and we’ll do that. This was a good win today, on a back-to-back, against a really good team.”\n\n\r\n              Booker, Durant and Beal each had seven assists for Phoenix, which led by as many as 28 and took a 100-74 lead into the final quarter. The Suns — the NBA's worst team in terms of fourth-quarter point differential — saw the lead get cut to 115-105 with 1:33 left, but Miami didn't score again.\n\n\r\n              Jimmy Butler scored a game-high 26 points for Miami, which was 24-16 and fifth in the Eastern Conference just two weeks ago. The Heat are now 24-23 and mired in the play-in tournament range, three games behind Indiana in the loss column for the sixth and final guaranteed playoff berth.\n\n\r\n              Terry Rozier scored 21 and Tyler Herro had 17 for Miami.\n\n\r\n              “I just want to see the effort, the toughness, the physicality, the force, the multiple efforts to get through this to see what’s on the other side,” Heat coach Erik Spoelstra said. “We know that there’s something that potentially can be great on the other side. But you got to go through it. You've got to go through the fires together and these uncomfortable times together.”\n\n\r\n              Beal played with a mask to protect his broken nose. The Suns lost starter Grayson Allen in the first half to a sprained right ankle. Suns coach Frank Vogel said X-rays were negative.\n\n\r\n              Phoenix got 48 bench points.\n\n\r\n              “Proud of those guys,” Vogel said. “That's what it should look like on the second night of a back-to-back.”\n\n\r\n              It's the first seven-game losing streak for Miami since a seven-game slide late in the 2007-08 season, the season before Spoelstra took over for Pat Riley. That '07-08 team — which finished 15-67 and, to put it charitably, wasn't exactly trying to win a lot of games — had four such streaks of seven or more losses that season.\n\n\r\n              Before that, the last time a Miami team lost seven straight was the start of the 2003-04 season, when Dwyane Wade and Udonis Haslem were rookies. That team went on to make the Eastern Conference semifinals.\n\n\r\n              There have been plenty of teams that lost seven games — or more — in a row and made the playoffs. But none of those has gone on to win a playoff series since Portland in 2016. And no team has ever lost seven consecutive games in what became a championship season; four eventual champions lost six in a row on their way to the title, most recently when Dallas topped Miami in 2011.\n\n\r\n              “We have to get over this hurdle,\" Spoelstra said, “one way or another.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: Visit Brooklyn on Wednesday.\n\n\r\n              Heat: Host Sacramento on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995354.8483799
}