{
  "game_id": "0021600992",
  "espn_id": "400900387",
  "date": "Mar 13, 2017",
  "matchup": "DAL @ TOR",
  "headline": "DeRozan scores 25 as Raptors beat Mavericks 100-78",
  "body": "TORONTO --  DeMar DeRozan isn't about to start projecting playoff matchups.\n\nToronto is fourth in the Eastern Conference with 15 games remaining and moving past Boston or Washington for second or third would likely mean avoiding a second-round matchup with defending champion Cleveland.\n\nBut DeRozan was having none of it, particularly after his team lost four of its previous six games before a 100-78 victory over the Dallas Mavericks on Monday night.\n\n\"You look at top four, everybody right there,\" DeRozan said after his 25-point outing. \"Somebody have a great week and somebody have a bad week and it can switch quick. It's a lot of games left, and we've got to treat every single one like it's our last.\"\n\nNorman Powell added 19 points in the victory, Toronto's third straight over Dallas, while Jonas Valanciunas had 14 points and 12 rebounds for his 25th double-double of the season.\n\nThe Raptors led by 13 entering the fourth quarter, then opened the period with a 10-2 run that extended the lead to 21 in the opener of the Mavericks' four-game road swing.\n\nToronto held Dallas to just 36.5 percent shooting from the floor and outrebounded the Mavericks 46-27 on the defensive glass.\n\n\"It's always the defense,\" Powell said. \"That's where we've got to make our stand, at the defensive end. We can't play an offensive game. Offensive games are not going to win us basketball. You've got to be able to get stops.\"\n\nThe Mavericks, fighting for a playoff spot but sitting in 11th place in the Western Conference with 16 games to play, lost starting forward Wesley Matthews with a right calf strain with 1:07 to play in the first half.\n\n\"I believe it's a mild strain. Didn't want to risk bringing him back,\" Dallas coach Rick Carlisle said. \"See how he's doing tomorrow and then on Wednesday. I think he'll be listed day-to-day, but we'll see.\"\n\nDallas fell to 8-23 on the road and has lost its last five away from American Airlines Center. Harrison Barnes scored 18 points for the Mavericks, with Dirk Nowitzki chipping in 17.\n\n\"On both ends we didn't get it done,\" Nowitzki said. \"We didn't really shoot the ball well enough; we only shot 36 percent from the field and (28 percent) from 3, it's going to be tough. It puts a lot of strain on the defense and our defense just wasn't good enough.\"\n\nTIP-INS\n\nMavericks: C Nerlens Noel (left knee) sat out his third straight game. ... Seth Curry went scoreless in the first half, before eventually finishing with five points. ... Dallas was outrebounded 34-55 and tied a Toronto opponent season low in points.\n\nRaptors: F DeMarre Carroll (left ankle) missed his second consecutive game. ... Toronto is now 7-4 this season without All-Star G Kyle Lowry, likely out for the remainder of the regular season following surgery on his right wrist. . Toronto plays Dallas again on March 25 at American Airlines Center. ... With a block in the first quarter, Serge Ibaka has recorded at least one block in each of his 10 games with the Raptors since coming over in a trade from Orlando on Feb. 14th. ... After missing on all four 3-point attempts they took in the first quarter, Toronto went 9 of 21 the rest of the way.\n\nRUNNING IN THE FAMILY\n\n\"He's probably shooting better than his brother right now and that's one trait, and Dell, I coached against their dad when I was at Western Kentucky and he was at Virginia Tech, and so all of them could shoot it and not sure their mom did either, but the whole family, it seemed like they could shoot the basketball.\"\n\nRaptors coach Dwane Casey on Seth Curry, currently shooting 48.2 percent from the floor before Monday's game, better than brother Stephen's 46.1 percent.\n\nCHANNELLING ERNIE\n\nWith the Raptors' D-League team also playing at the Air Canada Centre earlier in the day, in front of a D-League record crowd of 18,099, Toronto's Jakob Poeltl and Pascal Siakam played a doubleheader. Casey didn't let the opportunity escape to educate the rookies, who hail from Austria and Cameroon respectively, on one of the most famous sayings in sports.\n\n\"I told 'em, what'd Ernie Banks say? Let's play two,\" he said.\n\nUP NEXT\n\nMavericks: Visit Washington on Wednesday, looking for an eighth consecutive victory in the nation's capital.\n\nRaptors: Host Oklahoma City on Thursday, aiming to wrap up a season sweep of the Thunder.",
  "source": "espn_api",
  "crawled_at": 1764996108.39907
}