{
  "game_id": "0022000540",
  "espn_id": "401267700",
  "date": "Mar 02, 2021",
  "matchup": "MIL vs. DEN",
  "headline": "Jokic's triple-double leads Nuggets to 128-97 rout of Bucks",
  "body": "MILWAUKEE -- — Nikola Jokic reached a career milestone and helped the Denver Nuggets snap the Milwaukee Bucks’ five-game winning streak in emphatic fashion.\n\n\r\n                    Jokic had 37 points, 11 assists and 10 rebounds for his 50th career triple-double and the Nuggets trounced the Bucks 128-97 on Tuesday. Jokic has nine triple-doubles this season.\n\n\r\n                    The only other NBA player to collect at least 50 triple-doubles while primarily playing center was Wilt Chamberlain.\n\n\r\n                    “It just speaks to his greatness.,” Nuggets coach Michael Malone said. “The guy doesn’t get fatigued. He doesn’t get tired. When he was out of the game, he was in the huddles, he’s on the bench imploring his teammates to rebound and play defense and move the ball. When your best player is doing that, that really sends a message.”\n\n\r\n                    Jamal Murray added 24 points as the Nuggets earned their third straight victory and showed no signs of wear one night after winning 118-112 at Chicago. \n\n\r\n                    Denver handed Milwaukee its most lopsided loss of the year and shot 55.8%, the highest field-goal percentage by any Bucks opponent this season. \n\n\r\n                    “It’s definitely up there for best win of the year,” Malone said.\n\n\r\n                    Giannis Antetokounmpo had 27 points and eight rebounds for Milwaukee as the Bucks finished an eight-game homestand in which they went 5-3. Khris Middleton added 20 points.\n\n\r\n                    The Bucks were held below 100 points for just the third time this season. Their 97 total points were one off their season low as they struggled early.\n\n\r\n                    “We just were not good against the zone,” Bucks coach Mike Budenholzer said. “We’ve got to do everything better.”\n\n\r\n                    Antetokounmpo had his string of four straight games with at least 35 points end. The reigning two-time MVP was one off the team record owned by Kareem Abdul-Jabbar, who scored at least 35 points in five straight games on two separate occasions during the 1972-73 season.\n\n\r\n                    P.J. Dozier had 19 points, Will Barton 14, Michael Porter Jr. 11 and Monte Morris 10 for Denver. Brook Lopez had 12 points for Milwaukee.\n\n\r\n                    Antetokounmpo shot 10 of 15 overall and recorded dunks on three straight possessions early in the first quarter. But the Bucks couldn’t slow down the Nuggets, who led 37-23 after going on a 15-2 run to close the first quarter.\n\n\r\n                    Denver extended the margin to 21 in the second quarter and led 64-50 at halftime as the Nuggets continually got open looks near the basket. \n\n\r\n                    “I thought we played with great pace, in the first half especially,” Murray said. “With all those missed shots that they had, we got out and ran and got some quick buckets and changed the tempo on them a little bit.”\n\n\r\n                    The Nuggets stayed in control the rest of the way and maintained a double-digit lead throughout the second half.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Jokic is one assist short of having three straight triple-doubles. He had 39 points, 14 rebounds and nine assists Monday at Chicago. In the game before that, Jokic had 19 points, 11 rebounds and 13 assists in a 126-96 rout of Oklahoma City.\n\n\r\n                    Bucks: Jrue Holiday came off the bench for a second straight game after missing 10 games due to COVID-19. Holiday played 18 minutes and had four points and three assists. … Reserve forward Torrey Craig entered the game late in the first quarter for his first appearance since Feb. 18. Craig, who was part of the Nuggets from 2017-20, hadn’t played at all during the Bucks’ five straight wins … The Bucks and Fiserv announced they were teaming up to give out $10,000 grants to 20 different minority-owned small businesses in the Milwaukee area as part of a forum the team conducted Monday at Fiserv Forum.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: At Indiana on Thursday to cap a four-game road swing.\n\n\r\n                    Bucks: At Memphis on Thursday in their first road game since Feb. 14.\n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997391.18509
}