{
  "game_id": "0021801087",
  "espn_id": "401071760",
  "date": "Mar 23, 2019",
  "matchup": "CHA vs. BOS",
  "headline": "Walker sparks late rally, Hornets beat Boston 124-117",
  "body": "CHARLOTTE, N.C. --  Charlotte had three veterans out of action and three first- or second-year players in the lineup down the stretch. The Hornets hardly looked like a team capable of rallying from an 18-point deficit against the Boston Celtics.\n\nBut that is exactly what the Hornets did.\n\nKemba Walker scored 18 of his game-high 36 points in the fourth quarter and the Hornets rallied to a 124-117 victory over the Celtics on Saturday night.\n\n\"You just keep playing,\" said Walker, who also had 11 rebounds and nine assists in his 23rd game of 30 or more points this season. \"In the league, anything can happen. Once one team gets momentum, things can change really fast.\"\n\nThat's what happened as Charlotte closed the game on a 30-5 run that included all 18 of Walker's fourth-quarter points. The Hornets trailed 112-94 with 8:22 remaining.\n\n\"Obviously, when you lose an 18-point lead, there is a lot of things that go wrong,\" Boston coach Brad Stevens said. \"I thought they did a good job of chipping away at it. (And) we did everything that the book is written on to lose a game that you are up 18 at that point.\"\n\nRookie Miles Bridges scored a career-high 20 points, Marvin Williams and Malik Monk added 13 points apiece and second-year player Dwayne Bacon scored 11. Another rookie, Devonte Graham, made two key defensive plays during the fourth quarter as Charlotte won its second straight, improved to 33-39 and kept its faint postseason hopes alive.\n\nBoston fell to 43-30 with its third straight loss.\n\nIn front of a sellout crowd of 19,438 at Spectrum Center, Kyrie Irving scored 16 of his team-high 31 points in the first quarter as the Celtics appeared to take control of the game.\n\nBut Charlotte rallied and closed within 64-63 at halftime.\n\nAfter the Celtics built the game-high 18-point lead with 8:22 left. Charlotte scored on 12 of its last 19 possessions to catch and pass Boston. Walker scored his 18 fourth-quarter points in the final 7:43, including two clinching free throws with 5.9 seconds left.\n\nBoston scored twice on its final 20 offensive possessions.\n\n\"This game was over in the beginning of the fourth quarter,\" Irving said. \"We took our foot off the gas pedal, got it to a five-point game and momentum shifted from there.\"\n\nIt was Charlotte's largest come-from-behind win of the season and largest comeback in more than a year.\n\nThe Hornets now have 10 wins in games in which they trailed by 10 or more points, the largest previous comeback in a 125-118 home win over Chicago in which they trailed by 15.\n\nIt was the franchise's largest comeback since Charlotte trailed by 23 points in a March 21, 2018, win at Brooklyn.\n\n\"We were down 18 in the fourth quarter, so I love the way they stuck with it,\" Charlotte coach James Borrego said. \"Kemba drove a lot of that fourth quarter, but you have to give Marvin a lot of credit, the way he battled and Miles' big steal down the stretch, Devonte' took two big charges and his defense really ignited us as well so I think it was just a fantastic, overall team effort.\"\n\nJaylen Brown added 29 points and Marcus Morris 15 for the Celtics.\n\nTIP INS\n\nCeltics: Aron Baynes (left ankle sprain) and Gordon Hayward (concussion protocol) could be back in action on Sunday, though neither was in Charlotte with the team. Baynes injured his ankle in Wednesday's 118-115 loss at Philadelphia and Hayward missed his third game on Saturday. The Celtics lost another player, 6-foot-10 rookie Robert Williams, who suffered a lower back injury when he landed hard after missing a follow dunk in the second quarter.\n\nHornets: Cody Zeller (left knee) missed his sixth straight game and Michael Kidd-Gilchrist (concussion protocol) his second straight game on Saturday. Nicolas Batum also missed Saturday's game -- his second of the year -- due to illness.\n\nUP NEXT\n\nCeltics: Host San Antonio on Sunday.\n\nHornets: Visit Toronto on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994346.041703
}