{
  "game_id": "0022300305",
  "espn_id": "401584933",
  "date": "Dec 12, 2023",
  "matchup": "CLE @ BOS",
  "headline": "Tatum, Brown lead Celtics past Cavaliers 120-113 to remain unbeaten in Boston",
  "body": "BOSTON -- — Jayson Tatum had 25 points and 10 rebounds, Jaylen Brown also scored 25 and the Boston Celtics remained unbeaten at home with a 120-113 victory over the Cleveland Cavaliers on Tuesday night. \n\n\r\n              Kristaps Porzingis had 21 points and 10 rebounds, Derrick White added 17 points and Boston held Cleveland scoreless for a stretch of 2 minutes, 40 seconds in the fourth quarter while finally putting away the Cavaliers, who had played on the road the night before. \n\n\r\n              Cleveland came out strong and dominated the first quarter. Boston wasn't able to pull away until the final minutes. \n\n\r\n              “This was a good win, especially with the way we started the game. It could have went south early,” Tatum said. “But we stuck with it and we were just thankful to only be down 10 in that first quarter.”\n\n\r\n              Donovan Mitchell had 29 points and Darius Garland scored 26 for the Cavaliers, who couldn't overcome the cold stretch in the fourth quarter. Cleveland was also outrebounded 45-35 in the opener of a two-game series and was outscored 26-6 at the foul line.\n\n\r\n              The teams play again Thursday in Boston.\n\n\r\n              Max Strus added 17 points and nine rebounds for the Cavs, who set a season high with 19 3-pointers. Cleveland was coming off a 104-94 loss at Orlando on Monday night, when the Cavs scored just 15 points in the third quarter. Cleveland started strong Tuesday, opening the game with an 18-4 run, but could not maintain the pace. \n\n\r\n              “They came out very aggressive and we came out a little bit not as aggressive. They punched first,” said Porzingis, who scored 19 in the second half. “By halftime we were close, but then second half I felt we really turned it on.” \n\n\r\n              Porzingis broke a 106-all tie when he earned back-to-back trips to the line midway through the fourth quarter and made all four free throws, then Tatum stepped back for a 3-pointer that put Boston up 113-106 with 4:26 remaining.\n\n\r\n              The Cavs hadn’t scored since an 18-foot jumper by Mitchell with 6:05 left in the fourth tied it at 106. But Cleveland didn’t score again until Jarrett Allen’s layup with 3:25 left pulled Cleveland within 113-108.\n\n\r\n              “I think they were more organized offensively. They kind of knew what they wanted to get and they got to it and they made shots,” Cavs swingman Caris LeVert said. “On the other end, we kind of were a little disorganized, didn’t necessarily get the ball where we wanted to every single time and they took advantage.”\n\n\r\n              Brown opened the second half with a layup, then hit a quick 3-pointer that put Boston up 64-61. Three straight 3-pointers by Mitchell put Cleveland right back in front and the Cavs continued to lead through much of the third quarter.\n\n\r\n              Boston went back up when Tatum hit a 3-pointer for an 86-84 lead and Boston was up 94-92 entering the fourth quarter, but couldn’t pull away by much.\n\n\r\n              Mitchell was called for a technical after complaining about an on out-of-bounds call with 2:18 left in the second quarter. Tatum’s free throw tied it at 57-all, then a layup by Brown put Boston up 59-57 for the Celtics’ first lead of the game. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996737.860296
}