{
  "game_id": "0021801043",
  "espn_id": "401071717",
  "date": "Mar 17, 2019",
  "matchup": "PHI @ MIL",
  "headline": "Giannis pours in career-high 52 in loss to Sixers",
  "body": "MILWAUKEE --  Giannis Antetokounmpo won the scoring matchup, but Joel Embiid and the Philadelphia 76ers won the game.\n\nAntetokounmpo poured in a career-high 52 points, yet Embiid had 40 points and 15 rebounds to lead the 76ers over the Milwaukee Bucks 130-125 on Sunday.\n\nAntetokounmpo was 15 of 26 from the field, including 3 of 8 from 3-point range, and made 19 of 21 free throws to better his previous career best by eight points.\n\nThe 7-foot, 260-pound Embiid challenged his shots and trips into the paint.\n\n\"He's (Embiid) a tough guy,\" Antetokounmpo said. \"He's a great defender, strong. It was kind of hard going at him.\"\n\nThe Sixers' defense shut down Antetokounmpo in the first two quarters. He was 5 of 13 from the floor and had 17 points and seven rebounds before going 10 of 13 from the floor and 14 of 16 from the line for 35 points in the second half.\n\n\"He carried us for most of that game, but not all of it,\" Khris Middleton said. \"He wreaked havoc in the paint. He got his 3-ball going early. He got into a great rhythm. He was special tonight. Unfortunately, we just didn't get the win for him on a career night.\"\n\nEmbiid was up to the challenge of guarding Antetokounmpo.\n\n\"I thought we all did a pretty good job in the first half,\" Embiid said. \"In the second half, he kind of got going. He is tough to guard.\"\n\nEmbiid and the Sixers weathered a late charge by Milwaukee to beat the team with the best overall record in the NBA (52-18) and the top home record (27-6). It was the fifth time this season Embiid scored 40 or more points and came in his fourth game back after missing nine straight with left knee soreness.\n\n\"They are the best team in the NBA right now, as far as record goes,\" Embiid said. \"No. 1 in our conference. I felt like we had to make a statement. We had to get this win.\"\n\nJimmy Butler added 27 points, JJ Redick 19 and Tobias Harris 12 for the Sixers, near the top of the Eastern Conference standings at 45-15.\n\nMilwaukee had a brief scare when Antetokounmpo was fouled on a driving layup and landed awkwardly late in the third. He got up favoring his right leg, but then sank one of two free throws.\n\nEmbiid scored 18 points and Butler had 14 in the fourth quarter. Antetokounmpo's three-point play pulled the Bucks to 118-114 with 1:18 to go, but Ben Simmons then tipped in Embiid's miss.\n\nThe Bucks got to 3 points twice in the closing seconds, but Embiid and Harris each made two free throws to seal the win.\n\nMiddleton had 19 points, Brooks Lopez 14 and Eric Bledsoe 12 for the Bucks.\n\nMike Scott hit a wide-open 3 to give the Sixers a 98-86 lead early in the fourth and force the Bucks to burn a timeout.\n\nScott also provided a fun highlight -- late in the first quarter, he made a dive into the stands trying to save a loose ball. He landed in the second row, surprised a fan by taking a quick sip of her drink, and ran back on defense as play continued.\n\nTIP-INS\n\n76ers: Philadelphia moved to a season-high 20 games over .500. . The Sixers had 21 second-chance points to the Bucks' 11.\n\nBucks: Nikola Mirotic started for Malcolm Brogdon, who is out with a minor plantar fascia tear in his right foot. Brogdon had started 64 of 69 games and is out indefinitely. ... Recalled F Christian Wood from the Wisconsin Herd.\n\nMOMENT OF SILENCE\n\nThere was a pregame moment of silence for the victims and survivors of the New Zealand mosque attacks.\n\nWINNING COMBINATION\n\nAfter using 20 different starting lineups, Philadelphia's current quintet of Butler, Harris, Embiid, Redick and Ben Simmons played together for just the seventh time and improved to 6-1.\n\n\"This was only our seventh game having everyone healthy,\" Redick said. \"Sixers 3.0 for this season. We are still trying to figure each other out, but to get a win like this on the road is huge.\"\n\nI CAN HEAR YOU\n\n\"There were a couple of middle fingers in the stands,\" Embiid said of the some of the sellout 18,148 spectators. \"I love playing with that. I love being on the road and people are going at me. I want to hear them. I want to hear them, keep doing it because it gets me going.\"\n\nUP NEXT\n\n76ers: Play at Charlotte on Tuesday.\n\nBucks: Host the Los Angeles Lakers on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764993997.9787562
}