{
  "game_id": "0022200280",
  "espn_id": "401468435",
  "date": "Nov 25, 2022",
  "matchup": "MIL vs. CLE",
  "headline": "Bucks storm back in 2nd half to beat Cavaliers 117-102",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo and the Milwaukee Bucks taught the Cleveland Cavaliers a lesson in playoff-type intensity well before the start of December.\n\n\r\n              Antetokounmpo scored 38 points and the Bucks capitalized on a 23-2 run in the first eight-plus minutes of the third quarter to rally past Cleveland 117-102 on Friday night to snap the Cavaliers' four-game winning streak.\n\n\r\n              Milwaukee came back from a 16-point deficit by outscoring the Cavaliers 35-10 in the third period. The Bucks hadn’t outscored a team by such a wide margin in a single quarter since Jan. 4, 2019, when they outscored the Atlanta Hawks 43-14 in the opening period of a 144-112 victory.\n\n\r\n              “We had a little bit of luck on our side and were able to knock down some shots and get downhill and were able to get that momentum and keep it going,” said Antetokounmpo, who also had nine rebounds and six assists. “I think it started from our guards defending the pick-and-roll and Brook (Lopez) just contesting every shot on the defensive end.”\n\n\r\n              The Cavaliers hadn’t scored less than 15 points in any quarter this season before Friday.\n\n\r\n              “They turned it up to a level that we haven't seen, that we haven't experienced,\" said Donovan Mitchell, who led he Cavaliers with 29 points. “That's playoff basketball, and understanding that they're going to turn up the physicality (and) everything has to be sharper, everything has to be more precise.”\n\n\r\n              Darius Garland added 20 for Cleveland. After combining to shoot 14 of 26 and score 38 points in the first half, Mitchell and Garland went 4 of 16 for 11 points over the final two periods. \n\n\r\n              Cleveland’s Jarrett Allen played only 12 minutes and scored one point before leaving with a hip injury. \n\n\r\n              The Cavaliers lost for the first time since their last visit to Milwaukee, a 113-98 Bucks victory on Nov. 16.\n\n\r\n              “We were trying so hard, and we were like running in quicksand,” Cavaliers coach J.B. Bickerstaff said of the second-half struggles. \n\n\r\n              Jevon Carter scored 18 points and Bobby Portis had 14 for the Bucks. \n\n\r\n              After trailing 63-52 at halftime, the Bucks turned the game around in the third quarter. \n\n\r\n              “It felt like us again,” Portis said. “I feel like for the last couple of games, we haven't felt like ourselves, for real, missing a lot of shots and just not playing how we play.”\n\n\r\n              Jrue Holiday, who committed three fouls in the first 1½ quarters, scored his first points of the game in the opening minute of the third. He followed that up with a 3-pointer.\n\n\r\n              Carter then found Antetokounmpo for a dunk, though Antetokounmpo missed a free throw that would have given him a three-point play. Mitchell scored to extend Cleveland’s lead to 65-59, but a Brook Lopez 3-pointer and an Antetokounmpo dunk cut the lead to one.\n\n\r\n              Lopez then recorded one of his six blocks to set up an Antetokounmpo 3-pointer that gave the Bucks their first lead of the night with 7:19 left in the third. The Bucks eventually led by as many as 22.\n\n\r\n              “This is a great lesson for us,” Bickerstaff said. “We played against an established team who knows where they need to go when they need to take it to another level. That's what we're learning. They took the game to playoff-level physicality, and those are things we have to learn how to compete against.”\n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Dean Wade had seven points and 12 rebounds in his return after missing six games with right knee soreness. Kevin Love was out for the third time in four games due to a fractured right thumb. Caris LeVert missed a third straight game with a sprained left ankle.\n\n\r\n              Bucks: Pat Connaughton and Serge Ibaka weren't available due to non-COVID illnesses. Connaughton had just played his first two games of the season earlier this week after recovering from a strained right calf. \n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: At Detroit on Sunday. \n\n\r\n              Bucks: Host Dallas on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994595.463732
}