{
  "game_id": "0022300092",
  "espn_id": "401584720",
  "date": "Oct 28, 2023",
  "matchup": "TOR vs. PHI",
  "headline": "Embiid and Maxey each score 34, 76ers beat Raptors 114-107 to give Nurse first win",
  "body": "TORONTO -- — Joel Embiid and Tyrese Maxey each scored 34 points, and the Philadelphia 76ers beat the Toronto Raptors 114-107 on Saturday night to give new coach Nick Nurse his first win against his former team.\n\n\r\n              Kelly Oubre Jr. scored 18 points and Tobias Harris had 15 as the 76ers won their fourth straight over the Raptors.\n\n\r\n              “(Oubre) said before the game, ‘We’re going to win this one for Coach,’” Maxey said. “That’s what we went out there and did. It was crazy ironic that we were playing (Toronto) and it’s his first win. Congratulations to him, many more to come.”\n\n\r\n              Toronto fired Nurse in April after five seasons as head coach.\n\n\r\n              “I would say that I wasn’t maybe ready for coming back this quick,” Nurse said. “It felt way stranger than I thought it was going to feel.”\n\n\r\n              Nurse led Toronto to the NBA championship in 2019 and was voted NBA Coach of the Year in 2020. Fans rose for a brief standing ovation when Nurse was honored with a video tribute during a first-quarter timeout.\n\n\r\n              Nurse said the Raptors also gave him several framed photos and other mementos from his decade with the team. Nurse was an assistant to Dwane Casey for five seasons before landing the top job.\n\n\r\n              The 76ers again played without guard James Harden. Hoping to be traded, the 2018 MVP arrived late to training camp and said before the season that his fractured relationship with team president Daryl Morey couldn’t be repaired. \n\n\r\n              Harden also did not travel with the team for Thursday’s season-opening loss at Milwaukee.\n\n\r\n              Maxey didn’t take a shot in the first quarter but finished 7 for 9 from 3-point range. The rest of the Sixers went 3 for 19 behind the arc.\n\n\r\n              “It seemed like he had 30 points every time we played them when I was coaching against him, so it’s nice to see him continue that with me around,” Nurse said of Maxey. “He’s really amazing.”\n\n\r\n              Scottie Barnes scored 24 points, Gary Trent Jr. had 17 and rookie Gradey Dick scored 16 points for the Raptors. \n\n\r\n              Dennis Schroder had 15 points and 10 assists, and Pascal Siakam added 11 points. Toronto lost for the second straight day after winning its season opener on Wednesday.\n\n\r\n              The Raptors played without forward O.G. Anunoby, who sat because of muscle cramps. Anunoby left in the fourth quarter of Friday’s overtime loss at Chicago because of cramps in his right leg. Trent started in his place.\n\n\r\n              Raptors forward Precious Achiuwa left after 18 minutes because of a tight left groin.\n\n\r\n              Five players connected from deep as the Raptors shot 7 for 7 from 3-point range in the first quarter to lead 36-27. Toronto scored 35 points in the first half at Chicago on Friday.\n\n\r\n              “We picked it up,” Nurse said. “Second, third and fourth quarter we played much more solid.”\n\n\r\n              Maxey scored 15 points in the second but the Raptors were ahead 59-56 at halftime.\n\n\r\n              Philadelphia reclaimed the lead by scoring 15 of the first 17 points of the second half, including six from Embiid.\n\n\r\n              “We just did not have the juice that stretch there,” Raptors coach Darko Rajakovic said of his team’s play in the third.\n\n\r\n              The 76ers took a 91-79 lead to the fourth.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host the Portland Trail Blazers on Sunday.\n\n\r\n              Raptors: Host the Portland Trail Blazers on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995469.378149
}