{
  "game_id": "401810036",
  "espn_id": "401810036",
  "date": "Nov 05, 2025",
  "matchup": "SAC vs GS",
  "headline": "Westbrook's triple-double and Schroder's clutch run lift Kings over Warriors 121-116",
  "body": "SACRAMENTO, Calif. -- — Russell Westbrook posted his NBA-record 204th career triple-double and Dennis Schroder sparked a key fourth-quarter spurt that gave the Sacramento Kings a 121-116 win over the Golden State Warriors on Wednesday night in a matchup of short-handed teams.\n\n\r\n              Schroder hit three 3-pointers in the 11-0 run that broke a 104-all tie in the fourth quarter, and the Kings held on to win the opener of a five-game homestand.\n\n\r\n              Westbrook had 23 points, 16 rebounds and 10 assists for his first triple-double with Sacramento. DeMar DeRozan led the Kings with 25 points and Schroder finished with 18.\n\n\r\n              Will Richard scored 30 points and Moses Moody added 28 for the Warriors. Jonathan Kuminga scored 24 but missed a shot in the lane with 24 seconds left with Golden State down three. \n\n\r\n              The first matchup of the season between the two Northern California rivals lost a lot of luster leading up to the game when Stephen Curry (illness), Jimmy Butler (back) and Draymond Green (ribs) were ruled out for Golden State, and Domantas Sabonis (ribs) and Zach LaVine (back) were scratched for Sacramento.\n\n\r\n              That left both teams scrambling to put together lineups and combinations. Kuminga and Richard helped get the Warriors off to a fast start by combining for 33 points in the first half as Golden State built the lead up to 13.\n\n\r\n              But the Kings chipped away to get within five at halftime and got 10 points from DeRozan in the third quarter to take a seven-point advantage into the fourth.\n\n\r\n              The Warriors were sloppy all night, throwing away easy passes and even committing an 8-second backcourt violation on the first possession of the fourth quarter. Golden State finished with 19 turnovers. \n\n\r\n              Up next\r\n              Warriors: Visit the Denver Nuggets on Friday night.\n\n\r\n              Kings: Host the Oklahoma City Thunder on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042571.637301
}