{
  "game_id": "0021700044",
  "espn_id": "400974795",
  "date": "Oct 23, 2017",
  "matchup": "MIL vs. CHA",
  "headline": "Antetokounmpo powers Bucks past Hornets 103-94",
  "body": "MILWAUKEE --  Giannis Antetokounmpo is playing \"at a crazy level,\" according to teammate Khris Middleton.\n\nHard to argue with that.\n\nAntetokounmpo had 32 points and 14 rebounds, and the Milwaukee Bucks scored the final nine points in a 103-94 victory over the Charlotte Hornets on Monday night.\n\nThe reigning Eastern Conference player of the week was 13 for 21 from the field and 6 for 8 at the line. He also had six assists and blocked two shots.\n\nThe 22-year-old Antetokounmpo has scored at least 30 points in each of his first four games. He had a career-high 44 points Saturday against Portland.\n\n\"I mean, we need him to play like this,\" Middleton said. \"He's a match-up nightmare for everybody. The more we can play for him, the more that he relies on us too, the easier the games are going to be for us.\"\n\nMiddleton added 20 points for Milwaukee, which played its third game in four days, all at home.\n\nCharlotte, which missed its last seven shots after the score was tied at 94, was led by Frank Kaminsky's 18 points. Jeremy Lamb added 17 points, Kemba Walker had 15 and Dwight Howard grabbed 22 rebounds -- three shy of the team record.\n\nAntetokounmpo's two free throws gave Milwaukee a 96-94 lead with 1:34 left. Charlotte missed two 3-pointers on its next possession and Middleton made a 3 from the top of the arc with 43.5 seconds to go.\n\nHoward missed two foul shots with 33 seconds remaining to finish 0 for 9 from the line, but Charlotte caught a break when the rebound was tapped to Lamb. But he missed a shot after driving through the lane.\n\nAntetokounmpo sank two more free throws, Walker shot an air ball from long range and Middleton capped the scoring with two free throws with 16.2 seconds left.\n\n\"I thought the guys executed their sets offensively and I thought they were patient,\" Milwaukee coach Jason Kidd said. \"Sometimes we can get in a rush and take that first shot because it's wide open but turning down a good shot to get a great shot, those are what the good teams do in this league, and I thought that's what we did tonight.\"\n\nA floating shot by Middleton gave Milwaukee a 90-81 lead with 7:49 left. But Charlotte responded by scoring the next seven points, and shortly after tied the score at 94 on a 3-pointer by Kaminsky with 3:05 remaining. But the Hornets were shut out from there.\n\n\"It was terrible offense,\" Charlotte coach Steve Clifford said. \"The second half, it is just not going to work in this league.\"\n\nSCOUTING REPORT\n\nAntetokounmpo's 147 points through the first four games are the most in team history. Kareem Abdul-Jabbar had 146 in 1970-71.\n\n\"We played Friday, so Saturday you start watching (film on Milwaukee), and you sit and enjoy his greatness,\" Clifford said. \"It's not just his size and athleticism, he has an energy level and a flare and a passion for playing that is fun to watch. Then ...  you're like `What are we going to do?' That happens a lot in this league, but certainly he's one of the guys that you enjoy watching.\"\n\nINJURIES APLENTY\n\nCharlotte announced before the game that guard Julyan Stone will miss four to six weeks with a strained left hamstring. He got hurt in practice Sunday.\n\nBucks guard Malcolm Brogdon also did not play because of a left ankle sprain. It is uncertain how long he will be out.\n\nTIP-INS\n\nHornets: Howard became the first Hornets player with three straight 15-plus rebound games since Al Jefferson in 2014.\n\nBucks: Milwaukee attempted just three free throws in the first half, compared to 22 for Charlotte.\n\nUP NEXT\n\nHornets: Charlotte hosts Denver on Wednesday to begin a three-game homestand.\n\nBucks: Milwaukee hosts the Celtics after opening their season with a win in Boston.",
  "source": "espn_api",
  "crawled_at": 1764993061.1551292
}