{
  "game_id": "0021501129",
  "espn_id": "400829016",
  "date": "Apr 01, 2016",
  "matchup": "DET vs. DAL",
  "headline": "Barea's 29 points lead Dallas to 98-89 win over Pistons",
  "body": "AUBURN HILLS, Mich. -- J.J. Barea celebrated the birth of his daughter early Friday, then took on the Detroit Pistons a few hours later.\nBarea scored 29 points as the short-handed Dallas Mavericks picked up a key 98-89 victory.\n\"He was tremendous,'' Mavericks coach Rick Carlisle said. \"We're all very happy for him - baby Paulina born beautiful, and I'm sure that gave him some inspiration. It's a great day.''\n\nThe win kept Dallas tied with Utah for seventh place in the Western Conference, with the Jazz beating Minnesota on Friday.\n\"We are where we need to be right now,'' Barea said. \"We have six games left and we're focused. We're in a good rhythm, so hopefully we can finish strong.''\nThe Mavericks also pulled a full game ahead of ninth-place Houston.\nEven with the loss, Detroit leads eighth-place Indiana by a half-game and ninth-place Chicago by 1 ½ games in the East. The Pistons visit the Bulls on Saturday.\n\"Now we are going to have to go on the road and beat some good teams if we want to get in,'' Stan Van Gundy said. \"We needed this game.''\nMarcus Morris led the Pistons with a season-high 29 points, while Andre Drummond had 12 points and 17 rebounds.\nMorris scored 16 points in the first quarter, but Detroit's reserves struggled at the start of the second. Dallas put up the first 15 points of the quarter to take a 40-25 lead, forcing Van Gundy to rush his starters back onto the floor.\n\"Our bench has played well all year, especially lately, but they couldn't get anything going at all tonight,'' Van Gundy said. \"That's going to happen, and they got obliterated.''\nThey stopped the surge, but Dallas still had a 51-36 lead at the half. Morris had 22 for Detroit, but Barea had 19 points for the Mavericks while his opposing point guard, Reggie Jackson, was 0 for 7 with four turnovers.\n\"I thought it was a combination of offensive tempo and defensive intensity,'' Carlisle said. \"These guys are buying into a style of play that puts us in a better position to defend. We have a smart, veteran team that is going to do whatever it takes.''\nVan Gundy switched defensive stopper Kentavious Caldwell-Pope onto Barea, and Detroit got back into the game. Jackson scored seven points in the first six minutes of the third, and Morris' sixth 3-pointer tied it at 58.\nHowever, the Pistons missed their next four shots - none by Morris.\n\"Marcus was getting his shots through ball movement, and that whole run had come because we were making two or three passes every possession,'' Van Gundy said. \"Those next four shots were all guys coming off screens and just firing away. That's when Marcus loses out.''\nDallas, though, regained control as soon as Van Gundy put in his reserves. They led 71-61 at the end of the third, but couldn't put the Pistons away.\nStanley Johnson and Caldwell-Pope hit back-to-back 3s to make it 77-73 with 8:19 left, but Van Gundy had to pull Drummond because of intentional fouls with 4:33 left.\nDrummond is shooting 35.9 percent from the line this season, putting him on pace to easily beat Wilt Chamberlain's 38.0 in 1967-68 for the worst percentage in NBA history.\nWith Caldwell-Pope giving up 7 inches to guard the 7-foot Nowitzki, Wesley Matthews got to the line for a three-point play and an eight-point lead. After Morris missed, two free throws by Devin Harris made it 95-85 with 2:05 to play.\n\"That was a really smart game, with amazing intensity,'' Carlisle said.\nTIP INS\nMavericks: With Deron Williams (abdominal strain) and Raymond Felton (groin strain) both sidelined, Harris was the only traditional guard on the Dallas bench. ... Charlie Villanueva, who was on the floor for the Mavericks' 15-0 run, was booed by Pistons fans every time he touched the ball. He played five seasons for Detroit.\nPistons: Drummond missed eight of his first 10 free throws, and was pulled in both the third and fourth quarters when the Mavericks began to intentionally foul. His 38.2 career shooting percentage from the line is also the worst in league history.\nUP NEXT\nMavericks: At Minnesota on Sunday.\nPistons: At Chicago on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994895.406202
}