{
  "game_id": "0021900968",
  "espn_id": "401161610",
  "date": "Mar 10, 2020",
  "matchup": "LAL vs. BKN",
  "headline": "Davis misses 3 at buzzer, Nets hold off Lakers 104-102",
  "body": "LOS ANGELES --  In his second game as Brooklyn's interim coach, Jacque Vaughn watched his Nets fight and scrap for 47 1/2 minutes to carve out a two-point lead over the powerhouse Lakers..\n\nThen Vaughn had to watch from the sideline while Anthony Davis launched a last-second 3-pointer that would have undone it all.\n\n\"It's like the joy and pain of basketball,\" Vaughn said. \"I had the perfect sight line. I see it leave, just watching the flight of it. Looked to see if his feet were behind the line, so I said, `This is a 3-ball. We're either losing this thing, or we're going to win this thing.\"\n\nDavis missed. The Nets' coaching change remains a hit.\n\nSpencer Dinwiddie scored 23 points and hit the tiebreaking jumper with 28.3 seconds to play, and Brooklyn beat the Lakers 104-102 Tuesday night for its second straight win since Vaughn surprisingly replaced Kenny Atkinson last week.\n\nCaris LeVert added 22 points as Brooklyn opened its four-game California road trip by beating the Western Conference's top team.\n\nDavis hit four 3-pointers, but that wide-open 3 at the buzzer would have won it for the Lakers, whose four-game winning streak ended. After back-to-back victories over NBA-leading Milwaukee and the powerhouse Clippers last weekend, the Lakers lost at home for the first time since Feb. 6.\n\nLeBron James had 29 points, 12 rebounds and nine assists for the Lakers, and he flawlessly set up Davis' final shot by driving the lane and kicking out to his fellow All-Star.\n\n\"A great look, a great opportunity to win the game,\" James said. \"We just missed it. That's what the game is about.\"\n\nBrooklyn had a 97-88 lead with six minutes to play, but the Lakers ratcheted up their defense and cut it to 100-99 on James' driving layup with 1:47 left.\n\nDavis scored 20 of his 26 points in the second half, and he hit a tying 3-pointer with 42.6 seconds left on a setup from James.\n\nDinwiddie, a Los Angeles native and lifelong Lakers fans who starred at Taft High School in the San Fernando Valley, calmly drilled his mid-range jumper for the Nets' first field goal in three minutes.\n\n\"It feels good because it's a high-quality opponent on the road for a team that is doing its best right now to continue to find itself,\" Dinwiddie said. \"Obviously, we've gone through injuries and the coaching change as well. There's been a ton of up and down. And they're one of the top, what, three teams in the league, right? The championship contenders, Lakers, Clippers and Bucks. So it's big for a team that learning and going to try to be a champion to add this win.\"\n\nJames drove the lane for a layup that somehow rimmed out with 9 seconds to play, but the Lakers got the ball back after the scramble. James again drove and dished to Davis -- but the All-Star couldn't connect to secure the Lakers' 50th win of the season and a triple-double for James.\n\n\"A lot of shots are going to be open with (James') ability to get in the paint and draw a defense,\" Davis said. \"It's our responsibility to finish plays.\"\n\nAfter their wildly successful weekend, the Lakers understandably seemed a bit less passionate in their return, particularly on defense. They led 58-56 at halftime despite committing nine turnovers and playing less-than-impressive defense.\n\nTIP-INS\n\nNets: Chris Chiozza scored 11 points while hitting three 3-pointers and added five assists. ... Garrett Temple missed his fourth straight game with a sprained left ankle.\n\nLakers: C Dwight Howard sat out with an illness. ... G Dion Waiters remained inactive for the third straight game since signing with Los Angeles. ... Fans near courtside included Oscar-winning screenwriter and director Taika Waititi and NFL stars Todd Gurley, DeAndre Hopkins and Odell Beckham Jr.\n\nTHE FRENCH DISPATCH\n\nBrooklyn took a seven-point lead into the fourth quarter after Timothe Luwawu-Cabarrot scored 11 quick points late in the third.\n\n\"Man, it's one of the biggest wins of the year,\" said Luwawu-Cabarrot, who finished with 13. \"One of the sweetest, too, and it felt great. We played well. The whole team was involved.\"\n\nWITH A THUD\n\nFour of the Lakers' last seven losses have been to sub-.500 opponent, although they are 16-7 in that span. After such an emotionally charged weekend, the Lakers lost for only the second time in 13 games overall.\n\n\"Obviously you don't want to follow up with a dud like this one, but they deserved to win,\" said Danny Green, who scored just six points.\n\nUP NEXT\n\nNets: Visit the Golden State Warriors on Thursday.\n\nLakers: Host the Houston Rockets on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995966.376777
}