{
  "game_id": "0022001032",
  "espn_id": "401307840",
  "date": "May 11, 2021",
  "matchup": "MIA @ BOS",
  "headline": "Heat clinch playoff spot with 129-121 victory over Celtics",
  "body": "BOSTON -- — Tyler Herro scored 24 points and the Miami Heat clinched a playoff spot and sent the Boston Celtics to the brink of the play-in tournament Tuesday night with a 129-121 victory.\n\n\r\n                    Miami moved into a tie with idle Atlanta for fifth place in the Eastern Conference. The surging Heat won for the 10th time in 13 games. They have three games left in the regular season.\n\n\r\n                    “It does mean something. We don't want to act like it's nothing,\" Miami coach Erik Spoelstra said. “It's not everything we want.”\n\n\r\n                    Bam Adebayo and Duncan Robinson each scored 22 points, Kendrick Nunn had 18 and Goran Dragic 17 for the Heat. They swept the two-game series in Boston. \n\n\r\n                    “To have a chance to play for everything is what everyone wants to do,” Robinson said. “It's a good first step.”\n\n\r\n                    Miami star Jimmy Butler had 13 before missing the second half with an eye injury.\n\n\r\n                    Kemba Walker led the Celtics in their regular-season home finale with 36 points. Jayson Tatum scored 33 and Evan Fournier 20. Boston has lost seven of 10. \n\n\r\n                    “It's a pride thing,\" Walker said. “Individually, we've all got to look into the mirror and say: ‘Are we giving everything we’ve got?' And to be honest, we're not.” \n\n\r\n                    The Celtics, who were already assured of a spot in the 7-10 play-in tournament, trail Miami and Atlanta by three games, but lost the tiebreaker against both teams. Boston has three games left.\n\n\r\n                    “When you have an opportunity to still make the postseason, you can't complain about that,” Walker said. \n\n\r\n                    It was the first game for the Celtics since they announced Monday that All-Star forward Jaylen Brown would miss the remainder of the season to undergo surgery on his left wrist for a torn tendon.\n\n\r\n                    “We have to find the best version of the group that's available right now,” Boston coach Brad Stevens said.\n\n\r\n                    Coming off a 130-124 win over the Celtics on Sunday, the Heat showed the scoring balance — even without Butler — that carried them to the Eastern Conference title over Boston last season.\n\n\r\n                    “That's who we are when we're at our best,” Spoelstra said. “The more weapons we have, we're a more viable team.”\n\n\r\n                    Both teams tightened up defensively in the third quarter, and it became more physical, with Boston’s Marcus Smart briefly having words with Robinson after the pair went to the floor hard when Smart was called for a foul.\n\n\r\n                    Robinson scored eight of his 13 third-quarter points during a 17-4 spree that pushed Miami’s lead to 93-77. The Heat led by 14 entering the final quarter.\n\n\r\n                    Dragic's 3 gave the Heat a 105-84 edge with 9:02 to play, bringing some boos cascading down from the crowd filled to 25% percent capacity.\n\n\r\n                    “I feel like this is what every player works for when the lights are on,” Herro said. “I'm ready to make another run again.”\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Butler went to floor in pain late in the second quarter but stayed in after Miami called timeout. … Herro had 13 points in the second quarter, getting by Boston rookie Payton Pritchard for some easy looks.\n\n\r\n                    Celtics: Stevens said Brown had already left Boston and will have the procedure later this week. “You feel for Jaylen, he had a great year,” Stevens said. “He’s such an important part of us as we move forward.” … C Robert Williams III missed the game with left foot turf toe. … Stevens was whistled for a technical in the second quarter.\n\n\r\n                    EARLY INJURY SCARE\n\n\r\n                    Walker left in the game’s opening two minutes with an apparent left shoulder injury after colliding with Adebayo after grabbing a rebound.\n\n\r\n                    Walker immediately dropped the ball, in play near the baseline in front of Miami’s bench as he walked off, heading down a runway toward the locker room with 10:13 left. \n\n\r\n                    Tatum ran back to get the ball as Stevens screamed for guard Carsen Edwards, who took Walker’s place after a Celtics’ timeout. Walker returned with 6:25 left in the quarter.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Host the 76ers on Thursday night. Miami lost both previous meetings, in Philadelphia, coming on consecutive days in January.\n\n\r\n                    Celtics: At Cleveland on Wednesday night. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996747.58032
}