{
  "game_id": "0021300970",
  "espn_id": "400489843",
  "date": "Mar 13, 2014",
  "matchup": "OKC vs. LAL",
  "headline": "Thunder fire back to rout Lakers in rematch",
  "body": "OKLAHOMA CITY -- The Lakers caught the Thunder by surprise Sunday.\nLos Angeles had no such luck in the rematch. Russell Westbrook and Kevin Durant scored 29 points apiece, and Oklahoma City avenged Sunday's surprising loss to the Lakers by rolling past them 131-102 on Thursday night.\nLakers guard Jodie Meeks, who scored a career-high 42 points Sunday, was held to 19 on 6-for-15 shooting. Westbrook said the Thunder didn't pay extra attention to Meeks.\n\n\"We just did what we did,\" Westbrook said. \"He just happened to get lucky the first time. We ain't worried about what Jodie Meeks does. We're just worried about playing Thunder defense.\"\nWestbrook shot poorly against the Lakers on Sunday, but he made 9 of 17 shots and had nine assists in 23 minutes in the rematch. He has become more focused on passing and has been more efficient since his return from knee surgery.\n\"It's real fun, especially when we win,\" he said. \"As long as we continue to do a good job of playing together and everybody gets in a good groove, I think we'll be all right.\"\nSerge Ibaka added 15 points, 13 rebounds and a season-high seven blocks for the Thunder, who won their second straight and climbed within half a game of San Antonio for the top record in the Western Conference.\n\"We knew they were going to be ready, especially here at home,\" Lakers center Pau Gasol said. \"They're playing for trying to get the best record in the league; we're not. Their situation is just a tiny bit different than ours. \"\nKent Bazemore scored 16 points and Gasol added 14 for the Lakers. Los Angeles allowed at least 131 points for the fourth time in five games.\n\"I didn't think we were focused coming out like we were Sunday, and you can't do that against this team,\" Lakers coach Mike D'Antoni said. \"We can't lose them in transition two or three times. They're a good offensive team, so if you give them extra points, then you are going to get beat.\"\nThe Lakers trimmed an 18-point deficit to 11 in the second quarter before Westbrook returned from a brief rest to ignite a 13-1 run that gave the Thunder a 52-29 lead.\nOklahoma City led 60-46 at halftime. Westbrook had 14 points and six assists in 15 minutes, and Durant had 13 points. The Thunder outrebounded the Lakers 33-16 in the first half and held them to 37 percent shooting.\nDurant, who rarely gets into foul trouble, picked up his fourth with 10:16 left in the third quarter. Ryan Kelly hit a 3-pointer with 7:30 left in the period to cut Oklahoma City's lead to 69-58, causing the Thunder to call a timeout. Oklahoma City's Caron Butler hit a 3-pointer right out of the short break and Ibaka followed with a midrange jumper to boost the advantage to 16 points. Westbrook drained a 3-pointer to push Oklahoma City's lead to 23 midway through the quarter, and he wore a broad smile as the Lakers called timeout. By the time Durant re-entered the game, Oklahoma City led 90-68.\n\"When the game was kind of getting out of whack, I just felt like it was the right time to pass the ball, rebound or score, or whatever it took to get us over the hump and keep us rolling,\" Westbrook said.\nIn the final seconds of the third quarter, Ibaka swatted a shot by Xavier Henry and the Thunder rebounded. Butler hit a 3-pointer in the final second of the period to push Oklahoma City's lead to 101-77.\n\"I think it's hard to play the same team twice back to back so that was a little difficult, but it is what it is,\" Gasol said. \"We can't make any excuses and we have to deal with it.\"\nGame notes\nThunder G Andre Roberson, who has spent much of the season in the D-League, got his fifth start. ... Westbrook scored nine points in the first four minutes, including a dunk to start the game. ... The Thunder shot 57 percent in the first quarter and led 33-19 at the end of the period. The Lakers shot just 31 percent in the first 12 minutes. ... Butler had 11 points and six rebounds on his 34th birthday. ... Durant was issued a technical foul with 23 seconds left in the first half.",
  "source": "espn_api",
  "crawled_at": 1764992841.3993862
}