{
  "game_id": "0021100059",
  "espn_id": "320101014",
  "date": "Jan 01, 2012",
  "matchup": "CHA @ MIA",
  "headline": "49ers lock up No. 2 seed in NFC with win over Rams",
  "body": "ST. LOUIS --  No apologies from Jim Harbaugh. Not even close.\n\nAfter the San Francisco 49ers had to make stops late to hold off the suddenly spunky St. Louis Rams in their regular-season finale, their first-year coach was clear he definitely did not have mixed emotions.\n\n\"I feel great,\" Harbaugh said after the 34-27 victory over a two-win team Sunday that turned out to be a lot more hard-fought than expected. \"I'm not going to come in here and be sad that we won.\"\n\n\n\nThe 49ers (13-3) could use the bye week that comes with the No. 2 playoff seed in the NFC, with wide receivers Ted Ginn Jr. (ankle) and Kyle Williams (concussion) out for the finale. Running back Frank Gore sat out the second half with what Harbaugh vaguely described as \"something that was bothering him,\" although Gore said he was not hurt.\n\n\"It was a coach's decision, but I'm fine,\" said Gore, held to 9 yards on seven carries. \"I'm getting my body real fresh. We were up three touchdowns. I'm cool, I'm good.\"\n\nAfter beating the Rams for the second time in five weeks, 49ers players were happy to be getting a break.\n\n\"I'll sit back and watch the games. Let the games begin,\" tight end Vernon Davis said. \"My mind is about to go on a whole new phase, that's the way I see it.\"\n\nRecord-setting kicker David Akers showed off a strong left arm to match his left leg as Michael Crabtree bamboozled defenders on a perfectly executed fake field goal that made it 27-10 in the third quarter. Crabtree appeared to be leaving the field but stopped just shy of the sideline and no defender followed.\n\n\"Kind of like I disappeared on the sideline, but I was 2 feet away, so it worked out,\" Crabtree said. \"They didn't see me. I was just over there really just chillin', waiting on D.A. (Akers) to throw me the ball.\"\n\nCrabtree caught scoring passes from Akers and Alex Smith for the 49ers, who led by 24 in the fourth quarter.\n\nAkers broke the NFL single-season field goal record last week and finished with 44, including five in the first half of the two St. Louis meetings. He missed on a 48-yarder, but clicked from 36 and 42 yards.\n\n\n\nDavis also had a big day for a team short of pass catchers and Tarell Brown had a pair of interceptions that led to touchdowns. The 49ers held St. Louis to just 157 total yards in a 26-0 victory that clinched the NFC West in Week 12 but were hanging on at the finish of the rematch after the Rams scored two touchdowns in just 13 seconds.\n\nBrandon Lloyd caught a 36-yard touchdown pass from Kellen Clemens, the Rams recovered Josh Brown's on-side kick and Cadillac Williams scored on a 1-yard run with 4:39 to go one play after Lloyd drew an interference call on Brown in the end zone.\n\nThe Rams were rescued from the ignominy of landing the No. 1 draft pick for the second time in three years when the Colts (2-14) lost 19-13 to the Jaguars. The Colts hold the tiebreaker based on opponents' strength of schedule, leaving St. Louis with the second overall pick and their fourth top-two pick in five seasons.\n\nThe 49ers' record is their best since another 13-win season in 1997 under another rookie coach, Steve Mariucci.\n\nThe Rams scored 17 points in the fourth quarter, six better than their NFL-low game average, but were down to untested Tom Brandstater and third-and-17 after Clemens injured his right ankle on a sack by NaVorro Bowman with 2:46 to go. Brandstater threw two incompletions, the 49ers took over at their own 40 and needed just one first down to seal it -- and exhale.\n\n\"I think we kind of got a little relaxed and didn't play the type of defense we're supposed to play,\" linebacker Patrick Willis said. \"It can turn on you in a matter of seconds and that's what happened, and we can't allow that to happen going forward.\"\n\nThe 49ers finished 6-2 on the road, the franchise's best showing since 1996. Harbaugh is just the fourth rookie head coach to win 13 games and third by the 49ers, topped by George Seifert's 14-2 showing in 1989.\n\nClemens ran for an 18-yard score to give the Rams the early lead. Clemens made his third straight start in place of Sam Bradford (high left ankle sprain) and A.J. Feeley (broken right thumb). Bradford, the top pick in 2010, missed his fourth straight game and sixth overall.\n\nCoach Steve Spagnuolo is just 10-38 in three seasons and a team source told ESPN senior NFL analyst Chris Mortensen that the Rams will fire both Spagnuolo and general manager Billy Devaney by as early as Monday and as late as Tuesday.\n\nFollowing a six-win improvement last season, Spagnuolo and the Rams were a total bust this year. Attendance was announced as 55,990, about 9,000 shy of capacity at the Edward Jones Dome, but the stadium appeared no better than half-full and drained quickly in the second half.\n\nOwner Stan Kroenke did not attend the game. Spagnuolo talked optimistically about offseason plans and never fretted that this could have been his final game.\n\n\"I don't go there. I think you know me well enough,\" Spagnuolo said. \"In the middle of that game, in the fourth quarter as exciting as it was? Nah.\"\n\nCrabtree had 92 yards on nine receptions and Davis had 118 yards on eight catches, his second 100-yard game of the year.\n\nSteven Jackson had 76 yards on 16 carries for the Rams, a huge improvement over the first meeting against the 49ers in early December when he was held to 19 yards on 10 carries, before injuring his left bicep in the third quarter.\n\nGame notes Gary Pinkel, who coached the 49ers' Aldon Smith and the Rams' Danario Alexander at Missouri, was on the sideline before the game. ...  49ers FB Bruce Miller (left knee) was sidelined in the second quarter, but was in uniform testing it with sprints before halftime. ... Clemens said X-rays were negative.\n\nInformation from The Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764993295.932965
}