{
  "game_id": "0022000222",
  "espn_id": "401267382",
  "date": "Jan 20, 2021",
  "matchup": "PHX @ HOU",
  "headline": "Ayton has season-high 26 points, Suns beat Rockets 109-103",
  "body": "HOUSTON -- — Deandre Ayton had season highs with 26 points and 17 rebounds and the Phoenix Suns beat the Houston Rockets 109-103 on Wednesday night to end a two-game skid.\n\n\r\n                    “He was a monster for us tonight,\" Phoenix coach Monty Williams said. \n\n\r\n                    The Suns won for the first time since Jan. 9. Between the two losses, they had three games postponed because of health and safety protocols after playing at Washington.\n\n\r\n                    The Suns led by 20 points in the third quarter, but the Rockets used a couple of runs to get back in it. A jump shot by Devin Booker, who had 24 points, pushed the lead to eight with less than three minutes to go. But Houston scored the next six points, with four from Victor Oladipo, to cut it to 103-101 with 90 seconds left. \n\n\r\n                    Ayton made two free throws and Booker added two more to push the lead to 106-101 with 45 seconds to go. Oladipo made a pair of free throws for Houston, but a layup by Booker sealed the victory. \n\n\r\n                    Ayton was proud of the way the team responded after Houston cut the lead. \n\n\r\n                    “I did what I was supposed to tonight (and) as a whole team ... we really settled down and locked in at the end and closed the game out the way we should,\" he said. \n\n\r\n                    Oladipo and Eric Gordon had 22 points apiece for the Rockets. They have lost three of four since James Harden was traded to Brooklyn. Coach Stephen Silas said it's challenging to manage his roster with starters John Wall and Danuel House both out.\n\n\r\n                    “We’ve got to do what we can to win each game, but we’re dealing with a lot of different things,\" he said. “But mainly without those guys it’s stagger minutes and try to figure it all out.\" \n\n\r\n                    Chris Paul had 13 points for the Suns to give him 19,004, making him the 60th player in NBA history to reach 19,000.\n\n\r\n                    Mason Jones made a layup for Houston to start the fourth quarter and cut the lead to five before Ayton took over, scoring eight points during a 10-0 run to make it 99-84 with seven minutes to go. Ayton had two dunks and two of his career-high five blocks in that stretch.\n\n\r\n                    Cameron Payne raved about Ayton's work on defense.\n\n\r\n                    “Just to know he’s back there taking care of the dirty work for us is huge,\" he said. \n\n\r\n                    A dunk by Christian Wood soon after that ended a scoring drought of more than five minutes and was the start of a 9-0 run that got Houston within 101-95 with about three minutes left. \n\n\r\n                    The Suns used a 9-0 run to push their lead to 20 points with eight minutes left in the third. Gordon ended the run after that with a 3-pointer, which was the start of an 8-0 run by Houston that cut the deficit to 74-62.\n\n\r\n                    The Suns were up by 14 later in the third before the Rockets used a 10-1 spurt to get within 82-77 with about 2 ½ minutes left in the quarter. Phoenix led 89-82 after three.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Damian Jones and Dario Saric both sat out for a second straight game and Jalen Smith missed his fifth in a row because of health and safety protocols. ... Jae Crowder had 11 points off the bench. \n\n\r\n                    Rockets: Wall missed his fourth straight game with a sore left knee and House (back spasms and self-isolation) sat out for the ninth game in a row. Silas said he doesn’t expect either player to return until at least next week. ... Silas said that P.J. Tucker didn't play much after halftime because he had an abdominal issue. \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Host consecutive games against Denver beginning on Friday night as part of a four-game homestand. \n\n\r\n                    Rockets: Begin a two-game trip on Friday at Detroit.",
  "source": "espn_api",
  "crawled_at": 1764997766.4381618
}