{
  "game_id": "0021801065",
  "espn_id": "401071738",
  "date": "Mar 20, 2019",
  "matchup": "CLE vs. MIL",
  "headline": "Sexton's 25 leads Cavs over bruised Bucks missing Giannis",
  "body": "CLEVELAND --  Collin Sexton has left a sluggish, sometimes painful start to his pro career, behind him.\n\nHe's taking off, and he might just take the Cavaliers with him.\n\nSexton scored 25 points and became the first NBA rookie to score at least 23 in seven straight games since 1998 as Cleveland delayed Milwaukee from clinching the Central Division on Wednesday night with a 107-102 win over the bruised Bucks, who were without superstar Giannis Antetokounmpo.\n\nSexton made a 3-pointer with 1:42 left and dropped a driving layup one minute later as the Cavs held on for one of their signature wins in an otherwise dismal season.\n\nSexton's development has been one of the bright spots for the Cavs, who have undergone a coaching change and been riddled with injuries. His seven-game scoring streak is the longest for any rookie since Tim Duncan did it 21 years ago.\n\n\"That's what's up,\" Sexton said, smiling. \"It's cool. He's a legend. We got the win against the No. 1 team, so that's even better.\"\n\nThe Bucks are staggering toward the end of what has been a special season. The Eastern Conference leaders were without Antetokounmpo, one of the top MVP candidates, who missed his second game in a row with a sprained right ankle. They were also down five other rotational players including starting guard Malcolm Brogdon (foot) and forward Nikola Mirotic (thumb).\n\nKhris Middleton scored 26 points and Eric Bledsoe 24 for the Bucks, who couldn't wrap up their first division title since 2001. They were at a disadvantage as Antetokounmpo sat in warmups and watched from the end of Milwaukee's bench.\n\n\"When you don't come out on top it never feels good,\" coach Mike Budenholzer said. \"The guys, the competitive fight they brought in not the easiest of circumstances, I'll take that any night.\"\n\nDown 105-102, Milwaukee had a chance to tie it but had an ugly turnover without getting a shot off with less than 10 seconds remaining.\n\nCleveland's Kevin Love, who missed Monday's game in Detroit with a sore back, left in the third quarter with an apparent head injury. He banged into Bledsoe late in the second quarter and played just three minutes in the third before going to the locker room for evaluation.\n\nThe team did not have any further information on Love, who finished with 10 rebounds in 18 minutes.\n\n\"He didn't seem to be himself,\" coach Larry Drew said.\n\nWhile the Bucks are nursing injuries, the Cavs were as close to full strength as they've been in months as Tristan Thompson returned after missing 26 games with a sore left foot. It was a rare chance for Drew to have three of his top frontcourt players in Thompson, Love and Larry Nance Jr., who had missed the previous five games with a chest bruise.\n\n\"It felt good having that many bodies,\" Drew said.\n\nMiddleton did all he could to carry the Bucks in the first half by scoring 18. But without enough support, he couldn't keep up with the better-balanced Cavs, who built a 16-point lead and went into the locker room at halftime leading by 11.\n\nMILWAUKEE'S MASH UNIT\n\nThe Bucks were also without guards Sterling Brown (wrist), Donte DiVicenzo (heel), George Hill (groin) and center Pau Gasol (ankle).\n\nBudenholzer dismissed a report that Mirotic, who got hurt during Tuesday's win over the Lakers, could be out for as long as a month. The Bucks did not provide a timeline in their release.\n\n\"These things can always change,\" he said. \"In a perfect world, they're less. Sometimes they take longer. This is a little bit of a unique injury.\"\n\nMARCH MADNESS\n\nSince March 11, the Cavs have beaten Toronto, Detroit and Milwaukee -- three probable playoff teams and in the Raptors and Bucks, the two top teams record-wise in the league.\n\n\"Since the All-Star break, we've been playing well,\" said Thompson, who had seven points and six rebounds in his first game since Jan. 16. \"We've been playing well at home, beaten some good teams at home. I'd like to say if it was the NCAA Tournament, we'd definitely be a bubble team. We've got some good big wins.\"\n\nTIP-INS\n\nBudenholzer and Bledsoe were given technicals for arguing during the break between the first and second quarters. ... Antetokounmpo scored 44 with 14 rebounds in Milwaukee's win at Cleveland on Dec. 14. ... Dropped to 13-2 in the Central.\n\nCavaliers: Nance finished with seven points, a team-high five assists, two steals and two blocks. ... Although having Thompson on the floor would have certainly helped them win some games, Drew said the Cavs didn't push Thompson. \"I was hoping we would have gotten him back sooner,\" Drew said. \"But any time you are dealing with an injury, you can't rush players back. \" ... G Matthew Dellavedova missed his seventh straight game with a concussion.\n\nUP NEXT\n\nBucks: Host Miami on Friday.\n\nCavaliers: Host the Los Angeles Clippers on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994737.3971379
}