{
  "game_id": "0021600579",
  "espn_id": "400900000",
  "date": "Jan 10, 2017",
  "matchup": "DET @ SAC",
  "headline": "Cousins scores 24, Kings come back to beat Pistons 100-94",
  "body": "SACRAMENTO, Calif. --  It took four tries for the Sacramento Kings to win for the first time on their much-anticipated, seven-game homestand.\n\nDeMarcus Cousins had 24 points, 13 rebounds and six assists to help the Kings stage a dramatic fourth-quarter comeback in defeating the Detroit Pistons 100-94 on Tuesday night.\n\nThe Pistons led by as many as 18 points and were up nine entering the fourth, when they were outscored 32-17. The victory snapped a three-game losing streak for the Kings, who had lost five of six since winning a season-high four straight.\n\n\"Everyone did a great job in the second half. What got us going was defense,\" said reserve center Kosta Koufos, who scored eight of his 12 points in the fourth quarter. \"We understood that we had a slow start and it was obvious -- everybody could see what we needed to do. We knew we had to establish ourselves defensively.\"\n\nShooting well through three quarters, the Pistons went 7 of 20 in the fourth and mustered only two points in the final three minutes. Detroit had 38 second-half points after leading 56-43 following an effective first half.\n\nThe Kings closed the game with an 11-2 run.\n\n\"They outrebounded us by 11, we gave them 13 3s and our ball movement was just ridiculous in the second half,\" Detroit coach Stan Van Gundy said. \"We're playing everything 1-on-1 and wouldn't pass the ball. That's why we ended up where we are.\"\n\nAnthony Tolliver added 17 points, while Rudy Gay and Garrett Temple both finished with 11 for Sacramento. The Kings made four 3-pointers in the fourth and were 13 of 24 overall from beyond the arc, including 4 of 5 for Cousins.\n\n\"There were times when they certainly could have really run us out of the gym,\" Sacramento coach Dave Joerger said. \"We didn't put our heads down and we didn't quit. We found a rhythm with that (fourth-quarter) group. I thought Kosta was fantastic.\"\n\nKentavious Caldwell-Pope made six 3s and had 21 points for the Pistons, who had won two straight and three of four. Reggie Jackson had 19 points, Tobias Harris 18 and Andre Drummond added nine points, 12 rebounds and seven blocks.\n\nTemple's 3 with just under two minutes left gave the Kings their first lead since the opening quarter. Cousins hit another 3-pointer to put Sacramento ahead 98-94.\n\nAveraging 28.1 points per game, Cousins had only 55 over the previous three games while shooting 17 of 45. He scored 16 first-half points this time, then picked up his fourth foul early in the third quarter but never got a fifth one.\n\n\"Cuz is the best big man in the NBA. He shows it night in and night out,\" Koufos said.\n\nMONEY TALKS\n\nThere has been recent chatter that the Kings will make Cousins their franchise player this summer, an extension on his current contract that could be worth more than $200 million.\n\n\"Ya'll want me to be here?\" Cousins said, posing the question to the media. \"Well, guess what people? I'm here. We'll talk when it's time to talk.\"\n\nTIP-INS\n\nPistons: Detroit made its first three 3s and was 5 of 7 in the first quarter. The Pistons finished 12 of 27. ... G Reggie Bullock (left knee meniscus tear) hasn't played since Nov. 23, but has been practicing for a week. ... Drummond missed his first five free throws and finished 1 for 6.\n\nKings: Veteran forward Matt Barnes was given the night off by coach Dave Joerger. ... It was Equality Night at Golden 1 Center. Jason Collins, the NBA's first openly gay player, sat courtside and joined various organizations to honor the Sacramento LGBTQ community. ... The Kings had 11 first-half turnovers that led to 12 points. They finished with 16 turnovers.\n\nUP NEXT\n\nPistons: Travel to Golden State for Thursday's game against the team with the NBA's best record.\n\nKings: Host the defending champion Cleveland Cavaliers on Friday.",
  "source": "espn_api",
  "crawled_at": 1764996058.283531
}