{
  "game_id": "0022000693",
  "espn_id": "401307482",
  "date": "Mar 26, 2021",
  "matchup": "LAL vs. CLE",
  "headline": "Lakers rally past Cavaliers to snap 4-game losing streak",
  "body": "LOS ANGELES -- — Most teams would be fazed during a four-game losing streak and without two MVP-caliber players in the lineup. \n\n\r\n                    Not Montrezl Harrell and the Los Angeles Lakers.\n\n\r\n                    Harrell had 24 points and 10 rebounds for his eighth double-double of the season Friday night as the Lakers rallied in the second half to beat the Cleveland Cavaliers 100-86.\n\n\r\n                    It's the Lakers' first win since LeBron James and Anthony Davis have both been sidelined. James has missed four games after spraining his right ankle on March 20 against Atlanta, and Davis hasn't played since mid-February due to a right calf strain.\n\n\r\n                    “I don’t think we felt tension. We were more disappointed about falling behind early,” said Harrell, who has three double-doubles in the last five games. “We have to play next man up. We can’t look forward to 2/3 weeks or whenever they come back. We’re not just looking to hold on or keep our head above water. We’re looking to get wins.”\n\n\r\n                    Los Angeles trailed 51-44 at halftime before seizing control in the third quarter, scoring 19 of the first 21 points. Harrell and Dennis Schröder scored five points apiece during the run. Schröder also had a big defensive play when he blocked Darius Garland's breakaway layup to help the Lakers hold on to a 57-53 lead.\n\n\r\n                    The Lakers shot 11 of 19 from the field and held the Cavaliers to 3-of-21 shooting in taking a 72-61 lead at the end of the quarter.\n\n\r\n                    “We struggled in third quarters the past couple games and we wanted to make sure this one was ours,” Lakers coach Frank Vogel said. “We were flying around, our communication was great and I liked our determination.”\n\n\r\n                    The Lakers largest lead was 19 points in the fourth quarter. Schröder had 17 points and Talen Horton-Tucker added 15. It is the 11th time this season Los Angeles has won after it trailed by double digits \n\n\r\n                    Cleveland's Larry Nance Jr. had his fifth double-double of the season — 17 points and 10 rebounds — but was limited in the second half due to foul trouble. He played only five minutes in the third quarter after drawing his fourth foul, which also helped key the Lakers' run.\n\n\r\n                    “We got great looks, we have to be ready to knock them down. If you don’t make open shots you are going to have a tough time,” Cavaliers coach J.B. Bickerstaff said. “The Lakers have championship DNA. We knew they were not going to go away. In the third quarter, they raised their intensity and we have to match that.”\n\n\r\n                    Garland added 14 points for Cleveland while Jarrett Allen had 13 points and 11 rebounds.\n\n\r\n                    Nance's dunk off Brodric Thomas' missed layup gave the Cavaliers a 47-37 lead late in the second quarter, but things went downhill from there.\n\n\r\n                    DAVIS UPDATE\n\n\r\n                    Davis was re-examined by the team’s medical staff before the game and has been cleared to advance his on-court work. He did do some pregame shooting before the teams came out for warmups.\n\n\r\n                    NOT EXACTLY A CLEAN GAME\n\n\r\n                    Both teams combined for 44 turnovers. Los Angeles turned it over 23 times after having 22 in a loss Thursday night to Philadelphia. Cleveland committed 21, which is its sixth game with 20 or more.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: G Collin Sexton missed his second straight game due to right hamstring soreness after completing a pregame workout. ... The Cavs were 5 of 26 on 3-pointers, marking the fourth time this season they have made five or fewer beyond the arc while shooting under 25%. ... Allen has 18 double-doubles this season, including 13 with Cleveland.\n\n\r\n                    Lakers: Los Angeles had a season-high 15 steals, their most takeaways in a game in nearly two years. ... The Lakers are 13-2 when holding its opponent to 99 points or less and have won all eight games they have played on a Friday this season. \n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Travel to Sacramento on Saturday to face the Kings for the second time in six days. Cleveland lost the first meeting 119-105 on March 22.\n\n\r\n                    Lakers: Host the Orlando Magic on Sunday. The teams split their two meetings last season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997296.852544
}