{
  "game_id": "0021600072",
  "espn_id": "400899522",
  "date": "Nov 04, 2016",
  "matchup": "CHA @ BKN",
  "headline": "Kemba Walker scores season-high 30, Hornets edge Nets 99-95",
  "body": "NEW YORK --  Kemba Walker lost his backup and a few other key players from the best team he's played on in the NBA.\n\nInstead of taking a step back, his Hornets are off to their best start in 16 years.\n\nWalker scored a season-high 30 points and Charlotte improved to 4-1 for the first time since 2000 by beating the Brooklyn Nets 99-95 on Friday night.\n\n\"It's pretty early but I like the team that we can become,\" coach Steve Clifford said.\n\nNicolas Batum added 18 points and nine rebounds, while Marvin Williams, who missed his first 10 shots, made a 3-pointer with 1:05 left after the Nets had cut the lead to one point.\n\nReserve Sean Kilpatrick scored 19 points for the Nets, who didn't have starting point guard Jeremy Lin available to face his former team because of a strained left hamstring that will keep him sidelined for at least two weeks.\n\nLin played behind and alongside Walker last season on a team that went 48-34, but then also lost Al Jefferson and Courtney Lee in free agency. But Walker said he isn't surprised by their fast start.\n\n\"We have players who put in the time and effort and the work, so I'm not surprised at all,\" he said. \"This is what we're supposed to do. I feel like we're a really good team, so we want to continue to get better each and every day.\"\n\nBrook Lopez added 18 points and Trevor Booker had 12 points and 13 rebounds for the Nets, who because of injuries had to turn to rookie Isaiah Whitehead, a second-round pick out of Seton Hall, to make his first career start.\n\nThe Brooklyn native finished with eight points but the best point guard in the game, and from New York, was Walker, who shot 11 for 22 and also grabbed six rebounds.\n\n\"It was a good experience but at the end of the day we lost,\" Whitehead said. \"That's never good.\"\n\nThe Nets had a 13-point lead in the first half and were still ahead 55-43 early in the third before Walker and Cody Zeller, who played just five minutes in the first half because of foul trouble, turned it around. Walker's basket capped an 18-3 run that gave Charlotte a 61-58 lead and it remained a three-point game going to the fourth quarter.\n\n\"I thought that third quarter really hurt us,\" Nets coach Kenny Atkinson said. \"I thought we got stagnant. I thought the ball stopped moving. They got into us.\"\n\nThe lead was down to 92-91 when Williams nailed a 3 from the corner. Walker followed with a free throw to make it 96-91 and the Nets never got closer than three points again.\n\nTIP-INS\n\nHornets: Walker and Batum each scored 11 points in the first quarter. Charlotte's only other point was a free throw by Ramon Sessions.  ... The Hornets followed their 4-1 start in 2000-01 by losing their next five games. They finished 46-36.\n\nNets: Brooklyn was also without guards Greivis Vasquez (sore right ankle) and Randy Foye (strained right hamstring). ... Kilpatrick entered as the NBA's top-scoring reserve with 16.6 points per game.\n\nHORNETS' NEST\n\nCharlotte has won the last five meetings overall and three in a row in Brooklyn.\n\nOFF NIGHTS\n\nWilliams finished 2 for 13 for six points. On the other side, Nets guard Bojan Bogdanovic shot 4 for 17. He had 14 points.\n\nLIN UPDATE\n\nLin, who averaged 11.7 points last season in Charlotte, was at the game with his left leg wrapped. He said he's never had a hamstring injury before and doesn't know yet how long he could be out. \"I think we're just saying like the first three days, it's really important to do a whole lot of nothing, and after that time you can get a much better gauge of where I'm at,\" Lin said.\n\nUP NEXT\n\nHornets: Begin a three-game homestand Monday against Indiana.\n\nNets: Host Minnesota on Tuesday to end a four-game homestand. They begin a five-game trip the next night.",
  "source": "espn_api",
  "crawled_at": 1764995550.1432698
}