{
  "game_id": "0022400411",
  "espn_id": "401704977",
  "date": "Dec 26, 2024",
  "matchup": "ORL vs. MIA",
  "headline": "Herro makes go-ahead jumper with 0.5 seconds left as Heat beat Magic 89-88",
  "body": "ORLANDO, Fla. -- — Tyler Herro hit a 19-foot jumper with 0.5 seconds left Thursday night to give the Miami Heat an 89-88 win over the Orlando Magic.\n\n\r\n              Jalen Suggs, who scored 29 points for the Magic, missed a long jumper at the buzzer.\n\n\r\n              Herro finished with 20 points to help the Heat come back from an early 17-point deficit and avenge a loss to the Magic last Friday in which they squandered a 22-point fourth-quarter lead.\n\n\r\n              Alec Burks scored 11 of his 17 points in the fourth quarter for Miami, and Jaime Jaquez Jr. added 15 points.\n\n\r\n              Tristan da Silva had 18 points and six rebounds for the Magic.\n\n\r\n              Takeaways\r\n              Heat: Playing a third straight game without Jimmy Butler, and five days after squandering a 25-point lead in Orlando, the Heat shot 15 for 30 on 3-pointers and made six in the fourth quarter.\n\n\r\n              Magic: In the third of five straight home games, the Magic managed only 88 points after scoring 31 in the first quarter. They shot 5 for 29 from 3-point range, staying at the bottom of the NBA in that category. \n\n\r\n              Key moment\r\n              A tip-in by Goga Bitadze regained a one-point lead for the Magic with 4.9 seconds left, but they left just enough time for Herro to dribble to an open spot and hit the game-winning shot.\n\n\r\n              Key stat\r\n              The Heat fell behind 14-0 by committing five turnovers and missing their first five shots. But the Magic finished the game with 23 turnovers, including nine in the fourth quarter, to Miami's 21.\n\n\r\n              Up Next\r\n              Heat visit Atlanta on Saturday, and Magic host New York on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997557.488086
}