{
  "game_id": "0022000546",
  "espn_id": "401267706",
  "date": "Mar 03, 2021",
  "matchup": "BKN @ HOU",
  "headline": "James Harden has triple-double in Houston return, Nets roll",
  "body": "HOUSTON -- — The No. 13 on his jersey, James Harden won so many games for the Houston Rockets. \n\n\r\n                    On Wednesday night in the first meeting with his former team, No. 13 had a triple-double for the Brooklyn Nets to send the reeling Rockets to their 13th straight loss. \n\n\r\n                    “A lot of mixed emotions from the fans but I knew that was going to happen,\" Harden said. “I just wanted to come out here and give them a show.\" \n\n\r\n                    He did that with 29 points, 10 rebounds and 14 assists in the 132-114 victory. The Nets set a franchise record with their seventh straight road victory. They've won 10 of their last 11 overall. \n\n\r\n                    Harden has meshed well with his new team and the Nets are 17-7 since the trade.\n\n\r\n                    “So far, so good,\" he said. “It's everything that I signed up for. Top to bottom it’s been great.\" \n\n\r\n                    It’s the longest skid for the Rockets, who had just eight players available because of injuries, since they dropped 15 in a row in 2001. They’ve had a tough time since Harden was traded Jan. 14 and haven’t won since Feb. 4.\n\n\r\n                    The Rockets used a 10-0 run, with five points from John Wall, to cut the lead to eight with about eight minutes left in the fourth. But the Nets scored the next eight points, with two 3s from Harden, to extend it to 113-97 midway through the quarter.\n\n\r\n                    It’s the eighth triple-double for Harden this season and his second straight after he had 30 points, 14 rebounds and 15 assists without a turnover in an overtime victory at San Antonio on Monday night. He didn’t play as clean of a game Wednesday when he had eight turnovers. \n\n\r\n                    Harden got a mixed reception from the crowd. Many of the 3,615 fans booed when he was introduced before the game and more boos came the first few times he touched the ball. \n\n\r\n                    He said it was a “little weird” being on the visitor's side but denied having any extra emotions.\n\n\r\n                    “Once I get on that court I’m just trying to win,\" he said. “So that was kind of my feeling. I wasn’t trying to show off. I wasn’t trying to do anything out of the ordinary that I haven’t been doing. Just playing my brand of basketball.\" \n\n\r\n                    The Rockets played a video showcasing some of the countless highlights of his eight seasons in Houston during a timeout in the first quarter. There were more cheers than boos as it played. Harden stepped out of the huddle and raised his arms before placing his hands in a praying position to acknowledge the fans as it ended. \n\n\r\n                    “You could tell it meant something to him,\" coach Steve Nash said. “This place is special to James. Houston means a lot to him ... so I know it was a big game for him. I was proud of the way he handled it.\" \n\n\r\n                    Wall had a season-high 36 points, and Victor Oladipo also set his season high with 33. \n\n\r\n                    Houston coach Stephen Silas said the strong play of those two stars is an encouraging sign amid this difficult stretch. \n\n\r\n                    “It lets us know that when we get back and we’re healthy and we’re whole and we are in a position where we have enough guys to compete we’re going to be just fine,\" he said. \n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Kevin Durant missed his ninth game in a row with a strained left hamstring. ... Kyrie Irving had 24 points, and Joe Harris 19.\n\n\r\n                    Rockets: Eric Gordon missed a second straight game with a sore left knee. ... David Nwaba will be out at least six weeks after right wrist surgery on Wednesday. ... Danuel House sat out with a bruised right knee. \n\n\r\n                    HARDEN'S JERSEY\n\n\r\n                    Rockets owner Tilman Fertitta told the Houston Chronicle this week that the team will retire Harden's number later this season. He will be the seventh player in franchise history to receive the honor. \n\n\r\n                    He said he learned about it on the internet and was asked what that will mean to him. \n\n\r\n                    “That hopefully I did something right,\" Harden said. “Obviously, I came up short of a championship but the work I put up the past eight years was elite... I think the only thing I didn’t accomplish was a championship.” \n\n\r\n                    UP NEXT\n\n\r\n                    Nets: Resume play after the All-Star break when they host Boston on March 11. \n\n\r\n                    Rockets: Begin the second half of the season on March 11 at Sacramento. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997495.1611688
}