{
  "game_id": "0022300174",
  "espn_id": "401584802",
  "date": "Nov 11, 2023",
  "matchup": "TOR @ BOS",
  "headline": "Jaylen Brown scores 29, Jayson Tatum 27 to lead Celtics to easy 117-94 win over Toronto",
  "body": "BOSTON -- — Jaylen Brown scored 29 points, Jayson Tatum had 27 and the Boston Celtics cruised to a 117-94 victory over the Toronto Raptors on Saturday night.\n\n\r\n              Kristaps Porzingis added 21 points and seven rebounds in 28 minutes for the Celtics, who won their second straight after a 14-point victory over Brooklyn in their first NBA In-Season Tournament game on Friday night.\n\n\r\n              “I feel like we're really far from being a finished product, a team that this is it,\" Porzingis said. \"We're far from that still. ... There's going to be ups and downs. There's going to be like three games where it's going to look insane and three games where it's going to fall apart and the fans are going to overreact.” \n\n\r\n              Pascal Siakam led the Raptors with 17 points and seven rebounds. Dennis Schroder had 14 points and Jakob Poeltl 12.\n\n\r\n              Toronto, which had won its last two games — both on the road — shot just 10 for 37 on 3-point attempts.\n\n\r\n              Boston coach Joe Mazzulla used a challenge — and was successful — with his team up 27 points and 3:27 remaining in the game.\n\n\r\n              “At the end of the day, my responsibility is to my players first,” he said when told the Raptors were upset. “It was a clear opportunity for me to try to empower the players, let them know I'm coaching you.” \n\n\r\n              The Raptors felt differently.\n\n\r\n              “That's disrespectful,” Schroder said in the locker room. \n\n\r\n              Asked if its something they'll remember Friday when the teams meet again in Toronto, he quickly said: “For sure.” \n\n\r\n              Brown scored 14 in the third quarter when the Celtics pushed their nine-point halftime edge to 24 points midway into the quarter. He started his scoring spree with a left-corner 3 and capped it with a putback jam, coming in on the baseline.\n\n\r\n              Brown had 28 points in the win on Friday. Tatum added 23.\n\n\r\n              “Both of them, elite players in this league,” Schroder said. “At the end of the day, we made it easy for them. We've got an opportunity on Friday to make it harder.” \n\n\r\n              Boston led 88-71 after three quarters.\n\n\r\n              With Brown on the bench at the start of the fourth, it was Tatum’s turn. He nailed 3s on back-to-back possessions, pushing Boston’s lead to 96-71.\n\n\r\n              Later, he set up Brown for a crowd-pleasing, fast-break jam that made it 101-73 with just over 8 minutes left.\n\n\r\n              With the Raptors misfiring early and often from 3-point range, it ended up being a relatively easy night for Boston’s starters with all of them on the bench enjoying the final minutes. \n\n\r\n              TD Garden had its traditional parquet floor a night after the tournament game on an NBA-mandated floor with a tournament-themed look.\n\n\r\n              Boston center Al Horford was back in the lineup after having Friday’s game off to manage a right-knee injury. He scored seven points with seven rebounds in 24 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host the Wizards on Monday night, the first of four straight at home.\n\n\r\n              Celtics: Face the Knicks on Monday night, closing a three-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995461.943242
}