{
  "game_id": "0022200492",
  "espn_id": "401468647",
  "date": "Dec 23, 2022",
  "matchup": "LAL vs. CHA",
  "headline": "Hornets overcome LeBron's comeback, hold off Lakers 134-130",
  "body": "LOS ANGELES -- — Gordon Hayward got the tiebreaking layup on a goaltending call against LeBron James with 6.3 seconds to play, and the Charlotte Hornets held off the Los Angeles Lakers 134-130 Friday night for only their second victory in 11 games.\n\n\r\n              James scored 18 of his 34 points while leading a stirring fourth-quarter comeback by the Lakers, who erased a 16-point deficit in the second half. James scored or assisted on 11 straight points in the final 2:30, and he drove for the tying layup with 30 seconds left.\n\n\r\n              After Hayward got an offensive rebound and drew the goaltending call, James fed Dennis Schröder for an open corner 3-point attempt. The German guard missed, and P.J. Washington hit two free throws to ice the Hornets' second win on their six-game trip, matching their highest-scoring performance of the season.\n\n\r\n              “We knew they were going to make a run,” said Mason Plumlee, who had 11 points and eight rebounds. “They’ve got a lot of good players, but we answered the call.”\n\n\r\n              Washington scored 24 points, while LaMelo Ball had 23 points, eight rebounds and eight assists against his hometown team. Terry Rozier also scored 23 in his return from a two-game absence with a bruised right hip as the Hornets earned their first road win over the Lakers in five tries since January 2018.\n\n\r\n              “Obviously, had our chances tonight,” James said. “I won't say (it's) disappointing, because I'm not disappointed in our effort. I'm not disappointed in the guys. You just want to win the game that's right there in front of you.”\n\n\r\n              Austin Reaves scored 20 points and Russell Westbrook had 17 for Los Angeles, which has lost three straight with rapidly declining defense in the absence of Anthony Davis.\n\n\r\n              The eight-time All-Star big man missed his fourth consecutive game with what the Lakers earlier Friday called a stress injury in his right foot. There is no timetable for the return of Davis, who was playing superbly before his latest major injury in three seasons of miserable health.\n\n\r\n              “It's hard when you lose someone like AD,” Reaves said. “He's the centerpiece of what we do defensively. Since he went out, the defensive rating hasn't been great. It's just too many points. You're not going to win many games like that.”\n\n\r\n              Thomas Bryant had eight points and 13 rebounds for the Lakers before leaving the court with 3:16 to play while holding his right shoulder. Bryant, who returned to watch the final possessions, has been solid as Los Angeles’ starting center in Davis’ absence.\n\n\r\n              Coach Darvin Ham had no update on Bryant before the Lakers' postgame flight to Dallas.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Dennis Smith Jr. remained out since Nov. 23 with a left ankle sprain, but he is close to a return. ... Charlotte coach Steve Clifford and Ham were assistants on the Lakers' staff during the 2012-13 season.\n\n\r\n              Lakers: Reaves (ankle) and Westbrook (foot) returned after missing LA's last game. ... The Lakers drew a sellout crowd for the first time since Nov. 6.\n\n\r\n              BRIDGES RETURNS\n\n\r\n              Restricted free agent Miles Bridges attended the game and sat directly under the basket on the Hornets’ end of the court. He gave high-fives to his former teammates during pregame warmups.\n\n\r\n              Bridges, who played his first four NBA seasons with Charlotte, pleaded no contest to a domestic violence charge last month in Los Angeles, receiving probation and no jail time. ESPN reported earlier Friday that the Hornets are closing in on a new contract with Bridges, who is likely to receive a lengthy suspension that can’t begin until he is signed by a team.\n\n\r\n              “Yeah, we’re not going to comment on that right now,” Clifford said when asked before the game about the report.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Portland on Monday.\n\n\r\n              Lakers: At Dallas on Sunday to open a five-game road trip concluding in Charlotte on Jan. 2.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994141.530456
}