{
  "game_id": "0022000288",
  "espn_id": "401267448",
  "date": "Jan 29, 2021",
  "matchup": "CHA vs. IND",
  "headline": "Hornets bounce back, split two-game set with Pacers 108-105",
  "body": "CHARLOTTE, N.C. -- — P.J. Washington knows he is going to have to have a bigger impact if the Charlotte Hornets hope to make a run at the postseason.\n\n\r\n                    The Hornets forward stepped up his game Friday night with 19 points and nine rebounds as Charlotte avenged an earlier loss to Indiana with a 108-105 win over the Pacers.\n\n\r\n                    Terry Rozier scored 19 points and Devonte Graham added 14 points and 10 assists as the Hornets bounced back from a 116-106 loss to the Pacers two nights earlier. \n\n\r\n                    “He's definitely the X-factor,\" Graham said of Washington, who plays the five-spot for the Hornets when they go to a smaller lineup. \"Coach (James) Borrego has been on him non-stop just about being aggressive and coming out with that hunger.”\n\n\r\n                    Washington, who came in averaging 12.6 points, was apparently listening to Borrego.\n\n\r\n                    He was aggressive early, hitting his first seven shots, including three 3-pointers. That helped spread the Pacers' defense and open up the passing lanes for the Hornets, who finished with a season-high 35 assists and shot 50.6% from the field.\n\n\r\n                    “We are a real unselfish team and we like playing together,” Graham said.\n\n\r\n                    Domantas Sabonis led the Pacers with 22 points, 11 rebounds and six assists, nearly duplicating the triple-double he had on Wednesday night. Malcolm Brogdon scored 21 points and Myles Turner had 20 points.\n\n\r\n                    The Hornets led by nine in the fourth quarter before the Pacers battled back and took the lead with three minutes remaining on a one-handed turnaround jumper from the baseline by Turner, who beat the shot clock.\n\n\r\n                    The lead changed hands a few times before Rozier knocked down a 3-pointer from the left wing and Graham buried a transition 3 to put Charlotte up by five.\n\n\r\n                    Brodgon cut the lead to three on a driving layup. After a Charlotte turnover, the Pacers had a chance to tie, but Brodgon's 3-point try bounced off the back of the rim with 6 seconds left and the Pacers couldn't get the rebound.\n\n\r\n                    “We didn’t really establish our defense,” Turner said. \"It seemed like every time we missed a rebound, they would convert a 3. It was the multitude of rebounds and stops that we missed”\n\n\r\n                    TIP INS\n\n\r\n                    Pacers: Doug McDermott had 11 points in 17 minutes after scoring 28 against the Hornets on Wednesday night.\n\n\r\n                    Hornets: Ball had the highlight of the game in the third quarter when he leaped to grab a missed layup by Graham and dunked hard over Sabonis. ... The Hornets shot a season-best 61% in the first half to build a 64-60 lead at break. ... Charlotte held Indiana to 45 points in the second half.\n\n\r\n                    BALL'S EFFORT\n\n\r\n                    Rookie LaMelo Ball, who has been struggling, came alive with 16 points, seven assists and six rebounds as the Hornets won for the second time in eight games. Ball was 0 for 6 from 3-point range and had five turnovers, but still managed to make an impact in other ways, including a highlight reel dunk over Sabonis on an offensive rebound. \n\n\r\n                    “I thought he came in, he gave us great minutes with his pace and energy,\" Borrego said. \"Our pace picked up when he came in.”\n\n\r\n                    SPLITTING TIME\n\n\r\n                    This is the third time the Pacers have played the same team in back-to-back games this season as part of the NBA's new COVID-impacted schedule — and every time they have split the series.\n\n\r\n                    “I was just fine with the scheduling the way it was and our players are continuing to stay safe and following the NBA protocols and the rules and they’re very determined,\" Pacers coach Nate Bjorkgren said. \"They don’t make any excuses about anything – about not being able to leave the hotel or being around people. They’re following the rules. They’re doing a good job of that. We were together here for a few days out on the road, it’s a lot of time to bond together as a team. We fought tonight. We just got beat.”\n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: Have a day off before hosting the 76ers on Sunday night.\n\n\r\n                    Hornets: Host the Bucks on Saturday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997035.54186
}