{
  "game_id": "0021500858",
  "espn_id": "400828745",
  "date": "Feb 25, 2016",
  "matchup": "PHX vs. BKN",
  "headline": "Bogdanovic, Nets top Suns in battle of lowly teams",
  "body": "PHOENIX --  With Joe Johnson gone, Bojan Bogdanovic made the most of his return to the starting lineup.\n\nBogdanovic scored a season-high 24 points to lead the Brooklyn Nets to a 116-106 victory over the Phoenix Suns on Thursday night in a game between two of the NBA's worst teams.\n\nJohnson was waived earlier Thursday after he agreed to a buyout.\n\n\"He was really our leader. Everybody knew we needed more effort,\" Bogdanovic said. \"We are trying to play a little bit faster than usual so we play a lot of secondary offense. After a couple of their bad shots and turnovers, we hit a couple of 3s and that gave us confidence.\"\n\nFor Phoenix, the downward spiral of a season continued. Mirza Teletovic led the Suns with a season-high 30 points, but Phoenix lost its 13th consecutive game, tying a single-season franchise record. The Suns' eighth straight loss at home is a franchise worst.\n\nThaddeus Young added 18 points, eight rebounds and seven steals, and Donald Sloan had 13 points, nine rebounds and six assists for the Nets, who played Portland tough two nights earlier to begin their nine-game road trip.\n\nTeletovic, a former Nets player, added 11 rebounds and Tyson Chandler had 12 points and 11 boards. The Suns cut the lead to 105-95 with 2:08 left but got no closer.\n\n\"It is a great confidence builder. We played so well for a lot of the game in Portland. It was good to break through tonight,\" the Nets' Brook Lopez said. \"Everyone stayed focused. They made a run at the end but we never gave up too much ground.\"\n\nThe Suns trailed the entire second half and never by less than 10 points. They fell to 14-44, while the Nets improved to 16-42.\n\n\"It's tough, man. Nobody likes losing and we're trying to figure it out,\" Teletovic said. \"We just have to bring more energy and be more aggressive.\"\n\nPhoenix took a 13-6 lead with guard Ronnie Price hitting his first four shots, part of his 16 points. But that dissipated quickly as Bogdanovic scored 13 points in the first quarter and 20 in the first half.\n\nPhoenix cut the lead to 46-42 in the second quarter, but Brooklyn scored the final 14 points of the period in the last 2:09. Bogdanovic and Wayne Ellington hit 3-pointers and Bogdanovic scored on a fast-break layup with 1.5 seconds left, giving the Nets a 66-45 lead at halftime.\n\nThe flustered Suns muttered among themselves during a timeout after the layup and fans headed for the concourses in droves, even though halftime hadn't arrived. The 21-point lead was the largest at halftime for the Nets this season.\n\n\"We have to be more creative and innovative as a staff and keep everybody believing and finding focus and finding ways to engage our players mentally more than just physically, and that's just continuous,\" Suns interim coach Earl Watson said.\n\nThe Suns cut it to 70-59 on Teletovic's 3 with 7:15 left in the third quarter, but the Nets went on a 15-2 run over the next four minutes to go up 85-61.\n\nTIP-INS\n\nNets: Johnson started all of the Nets' first 57 games before Thursday. Bogdanovic made his 18th start of the season and first since Jan. 8. \"I'm a little sad that he's not going to be around and I'd like to run plays for him,\" Brown said of Johnson, \"but I have the utmost respect for him and wish him nothing but the best going forward.\" ... Lopez was whistled for a technical foul for arguing a non-call late in the second quarter.\n\nSuns: Guard John Jenkins made his Suns debut a day after being claimed off waivers and scored his first basket on a layup with 1:32 left in the third quarter. Phoenix is Jenkins' third NBA team since being drafted by Atlanta in 2012. ... Chandler returned after missing the past two games with a bruised shoulder. ... F Kris Humphries shot 0 for 9, grabbed 10 rebounds, committed three turnovers and had two shots blocked on the same possession.\n\nUP NEXT\n\nNets: At Utah on Saturday night.\n\nSuns: Host Memphis on Saturday night.\n\n---\n\nThis story has been corrected to show that Bogdanovic's point total was a season high, not career high.",
  "source": "espn_api",
  "crawled_at": 1764994836.772439
}