{
  "game_id": "0022000618",
  "espn_id": "401307403",
  "date": "Mar 17, 2021",
  "matchup": "PHI vs. MIL",
  "headline": "Antetokounmpo lifts Bucks to 109-105 OT victory over 76ers",
  "body": "PHILADELPHIA -- — Giannis Antetokounmpo came up big in overtime, and then took a seat — right on the court.\n\n\r\n                    Antetokounmpo scored 10 of his 32 points in the extra session to lead the Milwaukee Bucks to a 109-105 victory over the Philadelphia 76ers on Wednesday night in a matchup of two of the Eastern Conference’s best teams.\n\n\r\n                    After being hounded by Philadelphia All-Star Ben Simmons for most of the game, Antetokounmpo found his offense late with Simmons in foul trouble.\n\n\r\n                    He scored 10 straight Bucks points, the last a 10-foot jumper in the lane that pushed Milwaukee’s lead to 105-98 with 1:11 left in overtime. He sat on the court near the 76ers bench after the bucket, drawing boos from the fans.\n\n\r\n                    “I haven’t seen that, that’s what I felt like I wanted to do at the time,” he said. “I was just trying to have fun and enjoy the moment.”\n\n\r\n                    The 76ers weren’t thrilled with the show of joy.\n\n\r\n                    “I wanted to go and Stone Cold Stunner him, but I already had one tech,” Philadelphia’s Dwight Howard said. “He had a hell of a game. I don’t want to talk trash or say anything negative, but we’ll see him again.”\n\n\r\n                    With P.J. Tucker reportedly headed to Milwaukee in a trade with Houston, Donte DiVincenzo scored 20 points and Jrue Holiday added 19 for the Bucks, who have won five in a row and 10 of 11.\n\n\r\n                    Milwaukee’s D.J. Augustin and D.J. Wilson, who according to ESPN will be traded to the Rockets, did not play. Torrey Craig, reportedly headed to Phoenix in a separate deal to clear salary space for Tucker, also sat out.\n\n\r\n                    Antetokounmpo finished with 15 rebounds and five assists, ending a streak of three straight triple-doubles. The two-time MVP had just four points and four shots, including a 3-point attempt that was woefully short, in the opening 24 minutes.\n\n\r\n                    “I wasn’t having fun,” he said.\n\n\r\n                    That changed in overtime.\n\n\r\n                    “I just tried to be aggressive,” he said. “There are going to be times when I have to be aggressive and go downhill and there are times when I have to find my teammates.”\n\n\r\n                    Tobias Harris scored 19 points and Danny Green added 18 for Philadelphia, which had its six-game winning streak snapped. Philadelphia All-Star Joel Embiid sat for the third straight game with a bruised left knee. Simmons had 13 points and 12 assists and hit a late 3-pointer.\n\n\r\n                    “They flipped the switch in the second half,” Philadelphia coach Doc Rivers said.\n\n\r\n                    The Bucks (26-14) pulled within 1 1/2 games of the East-leading 76ers (28-13).\n\n\r\n                    SECOND-HALF SUCCESS\n\n\r\n                    Milwaukee rallied from a 19-point second-half deficit and went ahead 91-84 on Holiday’s corner 3 with 52.3 seconds left in regulation. The Bucks still led 93-90 on Khris Middleton’s layup with 3 seconds left. After a timeout, Furkan Korkmaz drained a corner 3 with 0.4 seconds remaining to send the game to overtime.\n\n\r\n                    FIRST-HALF FAILURE\n\n\r\n                    Milwaukee missed 16 of 17 3-point tries in the opening half and 33 of 45 shots overall, settling for a season-low 31 first-half points in addition to 13 turnovers. The Bucks’ previous low in a first half was 41 points.\n\n\r\n                    VETERAN HELP\n\n\r\n                    Tucker has averaged 7.2 points and 5.8 rebounds in an 11-year career for Houston, Toronto and Phoenix.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Improved to 11-9 on the road. ... DiVincenzo played his college ball at nearby Villanova.\n\n\r\n                    76ers: Embiid, who watched from the bench in an orange hoodie and slippers, is expected to miss at least another week. ... Philly fell to 18-4 at home. ... Rivers offered words of support to former 76ers center Shawn Bradley, who was paralyzed in a bicycle accident in January. “Really saddened by it,” Rivers said. “Just sending as much positivity to him and his family as we can.” ... Seth Curry sprained his left ankle while driving to the basket with 7:23 left in the fourth. He hobbled to the locker room and didn’t return.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host San Antonio on Saturday.\n\n\r\n                    76ers: Host Sacramento on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997088.12029
}