{
  "game_id": "0022300409",
  "espn_id": "401585037",
  "date": "Dec 26, 2023",
  "matchup": "HOU vs. IND",
  "headline": "Haliburton’s late 3 leads Pacers to 123-117 win over Rockets",
  "body": "HOUSTON -- — Tyrese Haliburton had 33 points and 10 assists and hit a go-ahead 3-pointer with a minute left to lead the Indiana Pacers to a 123-117 win over the Houston Rockets on Tuesday night.\n\n\r\n              Indiana snapped a three-game losing streak, winning on the road for the first time since Dec. 7.\n\n\r\n              “When you get .500, you feel a little more pressure because nobody wants to be under .500,” Haliburton said. “We felt like this game was kind of a must win for us. That’s a really good team, a really feisty team, and we just figured out a way to pull it out today.”\n\n\r\n              Haliburton went 13 of 21 from the field, including 7 of 13 from 3.\n\n\r\n              “What a great game,” Pacers coach Rick Carlisle said. “Just super competitive, tons of actions, a bunch of lead changes -- high-level players out there. I’m real proud of our guys.”\n\n\r\n              There were 15 lead changes and six ties in the game.\n\n\r\n              Alperen Sengun led Houston with 30 points and 16 rebounds. Sengun was coming off a career-high 37 points in Houston’s 106-104 win over New Orleans on Saturday. He added five assists and four steals on Tuesday.\n\n\r\n              “We knew they’re like the best offensive team in the league,” Sengun said. “We tried to solve it in the gameplan, but they’re still a good team. They made their clutch shots so they win.”\n\n\r\n              Fred VanVleet hit a running layup with 1:50 remaining to give Houston a 117-115 lead, their first since early in the third quarter. VanVleet finished with 18 points and nine assists.\n\n\r\n              Early in the third quarter, Haliburton made three 3-pointers in a two-minute span, capping off a 12-2 run that gave Indiana an 81-74 lead. The Pacers outscored the Rockets 37-23 in the third quarter and entered the fourth quarter with a 101-90 lead.\n\n\r\n              “It was shocking at the point, the way we played in the third quarter and the amount of 3s that they hit that we were still in the game at that point,” Rockets coach Ime Udoka said.\n\n\r\n              Rockets forward Dillon Brooks left the game midway through the third quarter and was later ruled out with a right abdominal oblique strain.\n\n\r\n              Houston outscored Indiana 74-44 in the paint, while the Pacers did more damage from the 3-point line, where they made 19 of 43.\n\n\r\n              The Rockets led 67-64 at the half.\n\n\r\n              Rockets forward Tari Eason tied the game at 33 on the last play of the first quarter by stealing the ball from Andrew Nembhard and finishing with a thunderous breakaway dunk. Eason had 16 points and eight rebounds off the bench for Houston.\n\n\r\n              The Pacers were without Reggie Bullock Jr. (illness) and Bruce Brown (right knee bone bruise). Obi Toppin -- who entered Tuesday having started 27 of 28 games this season -- played 14 minutes off the bench, scoring seven points.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Visit the Bulls on Thursday night.\n\n\r\n              Rockets: Host the Suns on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995614.994467
}