{
  "game_id": "0022300265",
  "espn_id": "401584893",
  "date": "Nov 30, 2023",
  "matchup": "POR @ CLE",
  "headline": "Cavaliers booed at home during 'worst' loss this season as Trail Blazers beat Cleveland 103-95",
  "body": "CLEVELAND -- — Donovan Mitchell heard the boos directed at him and his teammates as the game slipped away in the fourth quarter.\n\n\r\n              He felt they were warranted.\n\n\r\n              “If you don’t play well,” Mitchell said, “that’s what you get.”\n\n\r\n              Cleveland had a major letdown following a solid win with its worst loss this season, 103-95 on Thursday night to the Portland Trail Blazers, who pulled off their second impressive road victory this week.\n\n\r\n              Shaedon Sharpe scored 29 points, rookie Duop Reath added a season-high 13 and Jabari Walker had 12 rebounds for Portland, which came in just 5-12 overall and 3-7 away from home. On Monday, the Blazers won 114-110 at Indiana.\n\n\r\n              The Cavs may have been a little overconfident after playing so well in a 23-point win over Atlanta on Tuesday in the NBA's In-Season Tournament. But whatever momentum Cleveland built, in what has been an up-and-down season so far, is gone.\n\n\r\n              “We’ve said this from the beginning, we want to be a championship-caliber team and we’re not playing like it,\" said Mitchell, who termed the loss a “turning point.”\n\n\r\n              “Let’s go,” he said. \"This is the worst loss of the season. Let’s go. That’s it and it starts with myself. We’ll be fine. We’ll fix it.”\n\n\r\n              Cavs coach J.B. Bickerstaff kept his locker room closed an excessive amount of time before holding a brief postgame news conference during which he seemed in a daze.\n\n\r\n              What was the message to his players?\n\n\r\n              “Just trying to get an understanding of where we’re going and how we’re going to get there,” Bickerstaff said.\n\n\r\n              Sharpe went 11 of 15 from the field and added 10 rebounds for the Blazers, who scored 12 straight points in the fourth quarter to separate from the Cavs. Cleveland went more than five minutes without a field goal.\n\n\r\n              Sharpe's biggest bucket came with 1:33 left on a driving layup that put Portland ahead 99-91. After it dropped, he stood on the baseline and flexed for the crowd while shooting a glance at Cleveland's bench.\n\n\r\n              “Shaedon was special tonight and everyone else chipped in,” said Blazers coach Chauncey Billups. \"He made big shots and got some grown man rebounds. I got on him at halftime because he was playing like we was in the summertime, playing pickup basketball.”\n\n\r\n              Mitchell scored 23 and Evan Mobley 20 for the Cavs. Darius Garland had 15 points, but the All-Star point guard was sloppy with the ball, committing eight turnovers.\n\n\r\n              It was a poor performance for Cleveland, which is finally healthy and looked ready to start stacking some wins.\n\n\r\n              This is a setback.\n\n\r\n              Mitchell understood the crowd's damning reaction.\n\n\r\n              “It’s part of the game,\" he said of the booing. \"I’m not one that's anti that. You come in expecting us to perform a certain way, and we didn’t do that. If you want to prevent the boos, play well and win the game, so that’s part of it.\n\n\r\n              “I was booing when I was a kid too, so I understand. This city wants a championship and rightfully so, so we’ve got to go continue to strive for and handle our business.”\n\n\r\n              The Blazers trailed by 12 midway through the third before using a 16-3 run, capped by Matisse Thybulle's short putback, to take a 74-73 lead. \n\n\r\n              The teams were tied at 83-all before the Blazers went on their game-deciding run, which Reath capped with a 3-pointer from the corner with 6:09 left.\n\n\r\n              Cleveland appeared on the verge of taking control early, outscoring Portland 15-2 in the first 5:38 of the second quarter to open a 40-24 lead.\n\n\r\n              However, Billups went back to his starting lineup and his club responded with a 14-2 spurt to pull within 46-40 at half.\n\n\r\n              The Cavs were guilty of settling for shots, a fact underscored by them attempting just one free throw in the first 24 minutes — on a defensive three-second technical.\n\n\r\n              “We didn’t play well enough,\" Bickerstaff said. \"We did good things and we created a lead and didn’t do enough to sustain it. We do the right thing and good things happen, and we don’t and they are able to go on those runs.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Utah on Saturday.\n\n\r\n              Cavaliers: At Detroit on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996598.010939
}