{
  "game_id": "0022000649",
  "espn_id": "401307438",
  "date": "Mar 21, 2021",
  "matchup": "CHI @ DET",
  "headline": "Markkanen, solid defense lead Bulls over Pistons 100-86",
  "body": "DETROIT -- — Laurie Markkanen had 16 points and eight rebounds and the Chicago Bulls used a strong defensive performance for a 100-86 win over the Detroit Pistons on Sunday night.\n\n\r\n                    Zach LaVine scored 18 points for the Bulls, who had lost two straight. \n\n\r\n                    “These guys are always working to get better,” Bulls coach Billy Donovan said. “We've had some tough losses lately — the kind of losses that can linger — and I've been around teams where that's been a problem. This group is good at avoiding that.”\n\n\r\n                    Daniel Galford added eight points and 11 rebounds for Chicago.\n\n\r\n                    Detroit shot 16% (4 for 25) from 3-point range.\n\n\r\n                    “I'm grateful for every chance I get,” said Gafford, who entered the game after Wendell Carter, Jr. was poked in the eye. “I was in the starting lineup and I took it for granted. I thought I could just keep doing it, and now I've learned I have to keep earning it.” \n\n\r\n                    Jerami Grant scored 26 points for the Pistons, who had won two straight. Rookie Saddiq Bey, who averaged 24.0 points in Detroit's wins over the Toronto Raptors and Houston Rockets. didn't score until hitting a meaningless 3-pointer at the buzzer.\n\n\r\n                    “I thought Saddiq had some good looks, but there are nights you need to see a shot go in to give you that kick start,” Pistons coach Dwane Casey said. “In the last couple games, we did a great job of kicking the ball out to the perimeter and we hit everything we took. Tonight, we weren't as good as getting it out and nothing was going in.”\n\n\r\n                    The Bulls trailed for most of the first half, but used a late run to take a 46-45 lead. Chicago shot 60% on 3-pointers while holding the Pistons to 20%.\n\n\r\n                    Chicago expanded the lead to 11 points in the first five minutes of the third quarter and continued to shut down Detroit's outside shooting. The Pistons went 1 for 8 in the quarter, falling to 16.7% for the game. \n\n\r\n                    “I think the difference in the game was the stretch going into the half and the third quarter,” Casey said. “I thought we got a little of a glazed look in our eyes at the end of the half, and then we didn't respond when we got back out there.”\n\n\r\n                    The Bulls led 75-65 going into the fourth quarter and expanded their lead to 19 points on Denzel Valentine's 3-pointer with 6:51 to play. That kept Donovan from pushing his starters too hard on the front end of a back-to-back. \n\n\r\n                    “I was very happy with what we got from the bench guys tonight,” Donovan said. “They got us back into the game in the second quarter. so I went back to them in the third quarter and they played just as well.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Chicago has won six straight games against the Pistons, including a 4-0 season sweep in 2019-20. The streak has let the Bulls move into a 135-133 lead in the all-time series, which peaked 30 years ago with Michael Jordan's teams against the Bad Boys.\n\n\r\n                    Pistons: Grant, who had a career-high 43 in Chicago in a 105-102 loss on Feb. 17, scored 14 points in the first quarter on Sunday, and finished with 26.\n\n\r\n                    QUICK START\n\n\r\n                    Before the game, Donovan told forward Patrick Williams to watch for a chance to pick off Mason Plumlee's pass on the opening tip. Williams did just that, stealing the ball and scoring on a dunk at the seven-second mark. Williams finished with 10 points and seven rebounds.\n\n\r\n                    “He jumped the tip, just like we had discussed, and I think that really got him going,” Donovan said. “We did some different things with him offensively and he had a nice game.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Return home to host the Utah Jazz on Monday.\n\n\r\n                    Pistons: Travel to Indianapolis to play the Pacers during a break in the NCAA tournament.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997585.9130082
}