{
  "game_id": "0021900771",
  "espn_id": "401161413",
  "date": "Feb 07, 2020",
  "matchup": "ATL @ BOS",
  "headline": "Tatum scores 32, helps Celtics hold off Hawks 112-107",
  "body": "BOSTON --  As well as the Celtics have played lately, guard Marcus Smart believes they can play even better.\n\nJayson Tatum had seven 3-pointers and scored 32 points to help Boston sneak out of TD Garden with a 112-107 win over struggling Atlanta on Friday night.\n\nBut with eight of the Celtics' next nine against teams currently in playoff contention, Smart knows there won't be any room for lapses over the next few weeks.\n\n“That's something as a team we're still learning and we're still getting better at,” Smart said. “We've got to play to the final buzzer. That's what's gonna make us a great team. We still have a lot to learn. But I like they way we did tonight.”\n\nIt was Tatum's eighth consecutive game with at least 20 points. Enes Kanter added 16 points and 15 rebounds. Romeo Langford chipped in 16 points off the bench as Boston posted its sixth consecutive win.\n\nAtlanta led at halftime, despite having only nine players available and playing without Trae Young, DeAndrew Bembry, Cam Reddish and Bruno Fernando. But the Hawks struggled to make shots in the second half.\n\nThey got within 110-107 with 41.3 seconds to play on a dunk by John Collins. The Hawks got the ball back with 18.3 seconds left, but Kevin Huerter and Brandon Goodwin both came up empty from 3. Langford corralled the rebound, was fouled and hit both of his ensuing free throws.\n\n“I was a lot more comfortable,\" said Langford, who at times found himself guarding Vince Carter just a game removed from making his first career start. \"It took me a little bit to get the rhythm of the game, but once I got running up and down the court a little bit, I felt like I belonged out there.”\n\nCollins led Atlanta with 30 points and 10 rebounds. Huerter finished with 25 points.\n\nThe Hawks kept the game close despite also not having trade deadline acquisitions Clint Capela, Dewayne Dedmon and Skal Labissiere, who hadn't yet joined the team as they awaited their deals to be officially completed.\n\n“We've just got to play with effort, no matter if we're short-handed or not,” Huerter said. “It's the kind of thing you've got to do to piece games together. ... Hopefully Sunday we can get more people on the court.\"\n\nThe Celtics were also missing starters with Jaylen Brown (right ankle sprain), Gordon Hayward (left foot soreness) and Daniel Theis (right ankle sprain) all sitting out.\n\nBoston took advantage of the holes in Atlanta's lineup, jumping out to a 21-7 lead, which included 17 combined points by Tatum and Walker.\n\nBut Boston's second unit of Semi Ojeleye, Grant Williams, Vincent Poirier, Brad Wannamaker and Tremont Waters shot just 1 of 8 from the field over the final 6:46 of the opening quarter. Atlanta finished the period trailing 28-26, getting 11 points from Collins and 10 from Huerter.\n\nThe Hawks outscored the Celtics 29-26 in the second quarter and took a 55-54 lead into halftime. The Celtics responded, outscoring Atlanta 22-11 over the final 7:29 of the third quarter to take an 87-73 lead into the fourth.\n\nTIP-INS\n\nHawks: Fell to an Eastern Conference-worse 6-22 on the road with loss. ... Shot just 6 for 21 from the field (five turnovers) in the third quarter.\n\nCeltics: Improved to 35-9 when scoring 100 or more points.\n\nHONORING CARTER\n\nCeltics president of basketball operations Danny Ainge presented Carter with a plaque prior to the game congratulating him on his “22 season Hall of Fame career.” The plaque included a photo of Carter -- then with the Raptors -- shooting a jumper over Paul Pierce. It also included logos of the eight NBA teams the 43-year-old Carter has played for during his career.\n\nLater, Celtics fans erupted in cheers when he checked into the game midway through the first quarter.\n\nUP NEXT\n\nHawks: visit Knicks on Sunday.\n\nCeltics: at Oklahoma City on Sunday.\n\n---\n\nFollow Kyle Hightower on Twitter at https://twitter.com/khightower\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996668.810196
}