{
  "game_id": "0021600380",
  "espn_id": "400899822",
  "date": "Dec 14, 2016",
  "matchup": "HOU vs. SAC",
  "headline": "Harden's triple-double helps Houston to 8th straight win",
  "body": "HOUSTON -- James Harden's latest game left him tied in Houston's record books with perhaps the greatest Rocket of all.\nHarden had a triple-double -- 15 points, 14 assists and 11 rebounds -- in just three quarters to lead the Rockets to their eighth straight win, 132-98 over the short-handed Sacramento Kings on Wednesday night.\nIt was Harden's fifth triple-double this season and the 14th of his career, which ties him with Hakeem Olajuwon for most in franchise history. Harden acknowledged how special it is to be mentioned in the same breath as The Dream.\n\"Yes, obviously all-time Rockets great, best to ever do it (in) a Rocket uniform and one of the best to ever do it period,\" Harden said. \"So just honored. It's a credit to my teammates who helped me and coaches and just trying to win. That's all.\"\nHouston's winning streak is the longest current one in the NBA and the team's longest since 2014.\n\"The biggest thing I'm happy with is we had 40 assists on 50 buckets, so they're sharing the ball,\" coach Mike D'Antoni said. \"James does what he does every night and just a lot of good stuff going on.\"\nHarden's triple-double came in 29 minutes and 52 seconds of play, which is his second when playing less than 30 minutes.\nHouston led by 15 points in the third quarter before using a 10-4 run to push it to 76-53 with about 7 minutes left in the quarter. The Rockets began to pour it on after that, outscoring the Kings 18-5 over the next 3 1/2 minutes to make it 94-58. Trevor Ariza scored the first five points in that span and capped it with a 3-pointer.\nHarden grabbed his 10th rebound soon after that and got one more late in the third before heading to the bench at the end of the quarter to end his night.\nThe Kings played without three starters with Rudy Gay (hip flexor strain) and Ben McLemore (left quadriceps contusion) out with injuries and DeMarcus Cousins getting a planned day of rest. They were led by Garrett Temple's 20 points.\n\"There are times when teams are going to have to rest people and that gives other guys an opportunity to step up,\" Sacramento's Matt Barnes said. \"We have to weather the storm until Ben and Rudy get back and I think DeMarcus is playing in the next game. We have to pick up the pieces and continue to play hard and improve.\"\nRyan Anderson had 22 points and Sam Dekker had a career-high 19 for Houston.\nHarden has thrived running D'Antoni's fast-paced offense and has piled up 53 assists in the last four games.\nTIP-INS\nKings: Have lost six straight in Houston. ... Anthony Tolliver had 12 points and 10 rebounds. ... Trailed by as many as 39. ... Willie Cauley-Stein had 11 points, five rebounds and two blocked shots.\nRockets: Eric Gordon had a season-high eight assists. ... Every Houston starter scored at least 10 points. It's the sixth time that's happened this season. ... Ariza finished with five 3s and has had at least four 3s in 11 games this season. ... The Rockets had 64 points at halftime and have scored at least 60 points in the first half in seven of their last 11 games.\nCOME ON GUYS\nThe Rockets finished with 22 3-pointers to give them at least 15 3s in three straight games, which ties a franchise record. They came just short of tying the NBA record for 3s in a game of 23. With her son on the bench for the entire fourth quarter Harden's mother Monja Willis was imploring Dekker to help the Rockets break the record.\n\"James' mom kept yelling at me,\" Dekker said. \"She was laughing and she kept saying: `You need two more for the record. Two more for the record.' But I didn't pay too much mind to it. We got out of there with a win and with the way we shoot the ball I think we'll get pretty close again.\"\nNO REST\nWith Cousins sitting out to rest Wednesday night, Harden, who has played in 152 consecutive games, was asked why he never wants to take a night off to give his body a break.\n\"I know I'm not going to be playing basketball for the rest of my life,\" he said. \"I cherish moments like these and I love to play basketball. ... I love being on the court.\"\nUP NEXT\nKings: Visit Memphis on Friday.\nRockets: Host New Orleans on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995775.4006631
}