{
  "game_id": "0022301029",
  "espn_id": "401585657",
  "date": "Mar 24, 2024",
  "matchup": "MIA vs. CLE",
  "headline": "Heat build biggest lead in more than a decade, roll past Cavaliers 121-84",
  "body": "MIAMI -- — There was a 2-on-0 break in the third quarter when Jimmy Butler and Bam Adebayo seemed like they couldn't decide which one was going to get the easy basket.\n\n\r\n              It was that kind of night for the Miami Heat. Everything went right.\n\n\r\n              Haywood Highsmith scored 18 points, part of a 59-point effort by Miami's reserves, and the Heat built what was their biggest lead in more than a decade on the way to beating the Cleveland Cavaliers 121-84 on Sunday night to snap a three-game home slide.\n\n\r\n              “Our home fans really deserved this, to be honest with you,” Highsmith said. “We haven't been playing our best basketball at home. They deserve our best version of basketball and tonight was definitely fun for them.”\n\n\r\n              Adebayo had 15 points and 16 rebounds and Butler scored 15 points for the Heat, who led by 45 in the fourth quarter. Their biggest lead this season entering Sunday was 33, also against Cleveland on Nov. 22, and the 45-point cushion was their largest since leading Chicago by 46 in a playoff game on May 8, 2013.\n\n\r\n              Miami started the day seventh in the Eastern Conference and ended there as well, tied with Philadelphia at 39-32. The 76ers won at the Los Angeles Clippers earlier Sunday, but currently trail the Heat because of the head-to-head tiebreaker.\n\n\r\n              Miami was coming off a 23-point loss to New Orleans on Friday.\n\n\r\n              “This group really cares. Even after a night like the other night ... when it’s a really lopsided loss and you can erroneously say, ‘that’s a listless team,’ it’s not,\" Heat coach Erik Spoelstra said. “This is a team that cares deeply.”\n\n\r\n              Evan Mobley scored 15 points for Cleveland (43-28), which lost for the seventh time in 10 games but remained No. 3 in the East, a half-game ahead of New York.\n\n\r\n              Both teams were short-handed Sunday. Cleveland got Mobley back after a nine-game absence with an ankle issue, but was again without Donovan Mitchell, Max Strus and Dean Wade. Miami played without Tyler Herro, Kevin Love, Duncan Robinson and Jaime Jaquez Jr.\n\n\r\n              “Mentally, physically, we're worn,” Cavaliers coach J.B. Bickerstaff said. “It's on us all to figure it out. There's no excuses. It doesn’t get any easier. But I just think tonight was one of those nights where collectively, it just set in on us.”\n\n\r\n              It was the first time since Jan. 30, 2008, that Cleveland had only one player in double figures; it was LeBron James that night.\n\n\r\n              “Just one of those nights,” Bickerstaff said.\n\n\r\n              Terry Rozier and Thomas Bryant each scored 14 for Miami. It was Miami’s biggest victory margin of the season and Cleveland’s most lopsided loss; the previous entry in both cases was also a Heat-Cavs game, the 129-96 win by Miami in November.\n\n\r\n              The Heat got a buzzer-beating layup from Rozier to end the first quarter with a 30-22 lead. Rozier did the same thing to end the second quarter, that score pushing the Miami margin out to 60-39.\n\n\r\n              And in the third, it became a runaway. A 23-2 run over a five-minute stretch wound up pushing Miami's lead to 86-46. Cleveland pulled all five starters just 3 1/2 minutes into the third and four of them — Isaac Okoro, Jarrett Allen, Caris LeVert and Darius Garland — stayed there the rest of the way.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Charlotte on Monday.\n\n\r\n              Heat: Host Golden State on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995331.251968
}