{
  "game_id": "0021500008",
  "espn_id": "400827895",
  "date": "Oct 28, 2015",
  "matchup": "CHA @ MIA",
  "headline": "Healthy Chris Bosh returns with 21 points as Heat win opener over Hornets",
  "body": "MIAMI -- Throughout the preseason, the Miami Heat kept being questioned about whether they had enough 3-point shooting.\nThe answer, on opening night, was a resounding yes.\nChris Bosh scored 21 points in his return after being forced to the sideline last February because of blood clots and pneumonia, and the Heat took control with a 26-6 run fueled mostly by reserves in the second quarter and held on late to beat the Charlotte Hornets 104-94 in the season opener for both teams on Wednesday night.\n\"Guys made shots, but it's a testament to the ball movement and guys giving of themselves to make the shot easier for the next guy,'' said Dwyane Wade, who scored 20 for Miami. \"And it helps when you've got Gerald Green on your team, too.''\n\nCharlotte cut a 20-point deficit to five in the final minute, but Deng's 3-pointer with 38.8 seconds left helped seal the win and cap a 12-for-20 night for Miami from behind the arc.\nThe Heat had 47 games last season with 20 3-point tries or more -- and none of those games saw Miami as good from long range as it was Wednesday.\n\"A good start,'' Heat coach Erik Spoelstra said. \"I really liked the energy.\"\nAl Jefferson scored all of his 17 points in the first half for Charlotte, which cut a 20-point second-half deficit to five in the final minute. Kemba Walker led the Hornets with 19 points, Jeremy Lin scored 17 and Marvin Williams had 10 points and 10 rebounds.\n\"The thing we had done well in preseason we refused to do, which was pass the ball to each other,'' Hornets coach Steve Clifford said. \"The ball was sticking.''\nBosh said the game would carry no extra significance for him after his health scare, saying it was a thing of the past. He was his typically animated self, gesturing to fans as Miami was in control in the fourth quarter, and addressed the sellout crowd shortly before tip-off to thank them for their prayers and support during his absence.\n\"It's been awhile, huh?\" Bosh said, prompting the fans to roar.\nIt was the first time Bosh, Wade, Deng, Goran Dragic and Hassan Whiteside, the lineup assembled for Miami's playoff push last February, played together in a game that counted.\nBut throughout the preseason, the Heat second unit has been all the rage, and it showed why.\nDown 35-28 midway through the second quarter, the Heat went up 54-41 after a barrage of 3-pointers. Rookie Justise Winslow got his first NBA points on a 3 and a dunk to start the big run, then Bosh connected from beyond the arc. Green made back-to-back 3s to push Miami to what was then its biggest lead.\nIn the end, Miami had just enough.\n\"Those guys, they execute their plays and make some big [shots],'' Walker said. \"And that cost us down the stretch.\"\nTIP-INS\nHornets: Jefferson topped 17 first-half points only twice last season, scoring 18 before halftime on Dec. 17 and Dec. 22. ... The Hornets' first timeout of the season paid immediate dividends: They turned an 8-2 deficit into a 10-8 lead out of that stoppage.\nHeat: Miami is now 14-0 at home against Charlotte, including playoffs, since Jan 2, 2010. ... Wade passed Isiah Thomas for No. 53 on the NBA's all-time scoring list when he made a free throw with 8:26 left in the third quarter. Thomas scored 18,822 points in his Hall of Fame career. ... The win was the 200th home regular-season victory for Heat coach Erik Spoelstra (200-80).\nSTOUDEMIRE OUT\nHeat F Amar'e Stoudemire was held out of the game, part of what the team is calling \"rehabilitative recovery\" to preserve his knees. Stoudemire said he expects to play Friday when Miami makes its only trip to Cleveland this season. \"We're being cautious about the way I approach the game, and making sure I'm healthy for big games and playoffs,\" Stoudemire said.\nNEW FACES\nLin, Nicolas Batum, Frank Kaminsky and Spencer Hawes made their first official appearances for Charlotte. Winslow and Green became the 218th and 219th players to get into a game for the Heat.\nUP NEXT\nHornets: Visit Atlanta on Friday.\nHeat: Visit Cleveland on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994423.0055711
}