{
  "game_id": "0021400123",
  "espn_id": "400578415",
  "date": "Nov 14, 2014",
  "matchup": "MIL @ ORL",
  "headline": "Harris leads Magic past Bucks 101-85",
  "body": "ORLANDO, Fla. -- Tobias Harris sensed Orlando was coming together on its recent road trip. Victor Oladipo's return added to the positive momentum for the Magic.\nHarris had 26 points and 10 rebounds to lead Orlando to a 101-85 victory over the Milwaukee Bucks on Friday night.\nThe Magic earned their 17th consecutive home win against the Bucks. Oladipo, who suffered a facial fracture right before the season started, scored 13 points in 25 minutes in his first game of the season.\nOrlando was coming off a 97-95 victory at the New York Knicks on Wednesday. It has won four of six after beginning the season with four consecutive losses.\n\"We've played some great basketball the last three games,\" Harris said. \"We're sharing the ball and building great chemistry. Vic gave us a great spark tonight.\"\nOladipo was 3 for 10 from the field and 6 for 8 at the line. He also had three rebounds and two assists.\n\"To be out playing the game I love is a good feeling,\" Oladipo said. \"It was just a matter of being patient and playing off my teammates, bring some of energy to the game. Tobias has being playing great; we need that from him if we want to continue winning.\"\nPlaying against his former team, Harris gave Orlando an 84-68 lead on a reverse layup with 10:06 left. Harris was 10 for 18 from the field.\nMilwaukee pulled within seven on John Henson's hook shot with 6:15 remaining, but the Magic scored the next seven points to pull away.\nBrandon Knight scored 14 of his 24 points in the first quarter for Milwaukee.\nThe Magic went 10 for 24 from 3-point range and 21 for 27 from the free-throw line, compared to 2 for 19 from long range and 11 of 14 at the line for the Bucks.\nNikola Vucevic scored 18 points for Orlando, Evan Fournier went 3 for 6 from 3-point range and finished with 15 points.\nThe Bucks hit 10 of their first 12 shots and led 21-8 on Giannis Antetokounmpo's layup with 4:55 remaining in the first quarter. Knight was 6 for 8 from the field as Milwaukee led 30-25 after the first 12 minutes.\n\"Thirty points in a quarter and then we started settling for jump shots when we were getting the ball in the paint,\" Milwaukee coach Jason Kidd said. \"When you start to score at that rate, you've got to continue to put pressure on them, and also you've got to knock down shots when you're wide open.\"\nAntetokounmpo finished with 19 points for the Bucks, who had won two in a row.\nHarris made two foul shots to give Orlando a 48-40 lead with 3:30 left in the first half, but Milwaukee closed to 52-49 at the break.\nTIP-INS\nBucks: Have not won three in row since a four-game run from February 26-March 4, 2013. ... Milwaukee had 56 points in the paint.\nMagic: Harris has three double-doubles this season. This was his fourth 20-point game. ... Orlando's last loss at home to Milwaukee was a 111-105 decision on December 29, 2004.\nUP NEXT\nBucks: Continue their road trip Sunday night against the Miami Heat.\nMagic: Travels to Washington to face the Wizards on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764991843.025386
}