{
  "game_id": "0021800188",
  "espn_id": "401070869",
  "date": "Nov 11, 2018",
  "matchup": "POR vs. BOS",
  "headline": "Blazers win fourth straight with 100-94 victory over Boston",
  "body": "PORTLAND, Ore. --  Al-Farouq Aminu says he's grateful his teammates trust him in the big moments.\n\nAminu hit a pair of late 3-pointers and the Portland Trail Blazers won their fourth straight game, holding off the Boston Celtics 100-94 on Sunday night.\n\nDamian Lillard had 19 points and 12 assists while Jusuf Nurkic added 18 points and 17 rebounds. The Blazers have won seven of their last eight games.\n\n\"It's good that we're continuing with it, that we trust each other in all situations, the beginning of the game and at the end of the game,\" Aminu said.\n\nJayson Tatum matched his regular-season career high with 27 points and Kyrie Irving added 21 for the Celtics, who finished their road swing 1-4.\n\nThe Blazers led by as many as 21 points in the game, but the Celtics went on a 13-2 run to start the fourth quarter and pulled to 85-83. Marcus Morris' 3-pointer tied it at 86 with 7:27 left, but Lillard answered with a basket to keep Portland out front.\n\nIrving's 3-pointer with 2:55 left closed the Celtics to 92-91. Aminu came back with a 3-pointer from distance for the Blazers. He made another key 3 at put Portland up 100-94 with a minute left.\n\nAminu finished with 11 points and nine rebounds.\n\n\"We gave ourselves a chance to win the game and to Aminu's credit, he was 1-for-5 going into those last two 3-pointers and the one was from about 28 feet, so you have to tip your cap off to him,\" Celtics coach Brad Stevens said.\n\nThe Blazers wrapped up their homestand 5-1.\n\n\"We've found ways to win. Different people have it going at different times. I think they've been team wins, we're finding different people at different times,\" coach Terry Stotts said. \"We're playing with confidence and poise.\"\n\nIrving returned to the Celtics after missing Friday's loss at Utah because he was at his grandfather's funeral.\n\nCeltics forward Daniel Theis, who sustained a plantar fascia tear on Oct. 27, was upgraded to \"probable\" before the game but Stevens said he would only be available on a minute restriction. Theis played for five minutes and had two rebounds.\n\nLillard's layup put the Blazers up 23-12 in the opening quarter and Portland led by as many as 12 points before Boston closed the gap to 28-26 on Terry Rozier's floater. It didn't last long and Meyers Leonard's 3-pointer gave Portland a 40-31 lead midway through the second quarter.\n\nPortland went into the break ahead 54-37, led by Nurkic with 14 points and 10 rebounds.\n\nThe Celtics got to 61-52 in the third quarter after Tatum's 3-pointer, but CJ McCollum answered with a 3 for the Blazers. Kyrie Irving's 3 closed the Celtics to 71-66, one of seven 3-pointers Boston hit in the third.\n\nThe Blazers went into the final quarter up 83-70.\n\n\"We had our chances, we had our opportunities and they made some key plays, some key shots, and there was a possession there we couldn't get a rebound. And Aminu hit two big 3s,\" Al Horford said.\n\nThe Celtics were coming off a 123-115 loss to the Jazz, which marked Gordon Hayward's first trip back to Salt Lake City after going to Boston as a free agent in the summer of 2017. Hayward fractured his tibia in the Celtics' opener and missed all of last season.\n\nPortland was coming off a 116-105 victory over the Los Angeles Clippers on Thursday.\n\n\"I liked the way we've done it,\" Lillard said about Portland's early season success. \"I think it's been by committee, everybody's been pretty consistent and we've been sharp. I think down the stretch, we usually in the past, we were a lot more up and down. I think this year, we're just getting it done. We're doing the things we need to do to win games and we're doing it consistently.\"\n\nTIP INS\n\nCeltics: Tatum led the Celtics at the break with 13 points. ... The Celtics attempted 18 3-pointers in the third quarter alone, and 42 for the game. They made 14. ... Boston had a three-game winning streak over the Blazers going into the game.\n\nTrail Blazers: Portland wore its new City Edition jerseys that are black and gray with a diagonal red stripe. ... There was a delay to start the second half because something with the south basket was askew. A ladder was brought in to allow arena personnel to adjust it.\n\nON THE ROAD: The loss capped a disappointing road trip for the Celtics. \"We just don't hunt great on offense until it's desperation time and we've spent a lot of time in desperation time on this trip,\" Stevens said.\n\nUP NEXT\n\nThe Celtics head home to host the Bulls on Wednesday.\n\nThe Trail Blazers visit the Lakers on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995200.0504608
}