{
  "game_id": "0022000686",
  "espn_id": "401307475",
  "date": "Mar 26, 2021",
  "matchup": "MIA @ CHA",
  "headline": "Monk scores 32 as Hornets hold on to beat Heat 110-105",
  "body": "CHARLOTTE, N.C. -- — Hornets coach James Borrego isn't sure what gets into Malik Monk when he steps on the floor against the Miami Heat, but he sure likes it.\n\n\r\n                    “Hey whatever he eats or thinks about on Miami game days, just keep doing it,” Borrego said.\n\n\r\n                    Monk diced up the Heat for the second time this season, scoring 32 points on 12-of-17 shooting as Charlotte handed Miami its sixth straight loss, 110-105 on Friday night. Terry Rozier had 26 points and a career-high 11 assists, and Devonte Graham added 16 points and two clutch free throws for the Hornets, who nearly squandered a 30-point first-half lead.\n\n\r\n                    Monk said he drew motivation from something his former Kentucky teammate Bam Adebayo said to him during the game. While Monk wouldn't say what Adebayo said, and added that he knows his old buddy was joking with him, he still took it to heart.\n\n\r\n                    \"It locked me into a different level,” Monk said.\n\n\r\n                    When asked what he said to Monk, Adebayo smiled and said, “I didn't say nothing to that dude, that's the crazy part. I didn't say nothing to him. He said something to me and that's how that turned out. ... But we are brothers since college and have known each other since we were like 12. It's a brotherhood.”\n\n\r\n                    On Feb. 1, Monk scored a career-high 36 points against the Heat to help Charlotte erase a late 10-point deficit in regulation and win 129-121 in overtime.\n\n\r\n                    Monk appeared destined to set a new career best on Friday night after scoring 24 points in the first half on 8-of-11 shooting, including five 3s.\n\n\r\n                    “He can score with the best of them and he showed it tonight,” Rozier said.\n\n\r\n                    Jimmy Butler had 20 points and nine assists for the Heat after missing the Thursday night’s 125-122 loss to the Portland Trail Blazers with a stomach illness. Duncan Robinson also had 20 points.\n\n\r\n                    Charlotte made 12 of its first 20 shots from beyond the arc to build a 61-31 lead midway through second quarter. But Miami battled back and cut the lead to four with 28.7 seconds left in the fourth quarter behind a 15-2 run led by Adebayo and Robinson, who knocked down an off-balance 3.\n\n\r\n                    After Tyler Herro scored on a layup to cut Charlotte’s lead to three with 6.6 seconds remaining, Graham made two free throws with 2.9 seconds left to seal it.\n\n\r\n                    “They sped us up in the second half,\" Rozier said. “They never hung their heads and that is the sign of a good basketball team.”\n\n\r\n                    “Our group has a very competitive character,\" Heat coach Erik Spoelstra said. “Charlotte really had us on our heels in the first half. They looked like a fresh team. They had a lot more speed, energy and quickness.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Kendrick Nunn suffered a right ankle sprain in the first half and did not return. ... Goran Dragic (back), KZ Okpala and Udonis Haslem (both health and safety protocols) also didn’t play. ... Made just 10 of 20 free throws.\n\n\r\n                    Hornets: Bismack Biyombo started at center again over Cody Zeller. ... Charlotte had just two turnovers in the first half. ... P.J. Washington left in the second half with a leg contusion. ... Monk left the game briefly late in the fourth quarter but returned.\n\n\r\n                    NO OLADIPO, BJELICA\n\n\r\n                    Victor Oladipo and Nemanja Bjelica, who were acquired by Miami in trades Thursday, were ruled out for the game as those deals were still being approved by the league. Both players should be ready to play Monday night. \n\n\r\n                    BALL RETURNING?\n\n\r\n                    Hornets general manager Mitch Kupchak said Friday he’s not ruling out rookie point guard LaMelo Ball returning this season. Ball is expected to be re-evaluated in four or five weeks after fracturing his right wrist on March 20.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Visit Knicks on Monday night in another pivotal Eastern Conference matchup.\n\n\r\n                    Hornets: Host Suns on Sunday, their last home game until April 11.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996776.858561
}