{
  "game_id": "0022201066",
  "espn_id": "401469221",
  "date": "Mar 19, 2023",
  "matchup": "MIA @ DET",
  "headline": "Herro's late run helps Heat come back to beat Pistons",
  "body": "DETROIT -- — Tyler Herro scored 10 of his 19 points in the final 3:20 and the Miami Heat rallied for a 112-100 victory over the Detroit Pistons on Sunday night.\n\n\r\n              Miami improved to 39-34, one game behind the Brooklyn Nets for the sixth seed in the Eastern Conference. The Heat host the Nets on Saturday.\n\n\r\n              “This is going to be our March Madness and April Madness,” Heat coach Erik Spoelstra said. “The opportunity is right in front of us, and that's all you can ask for at this part of the season. We are going to have to fight for it -- that's what this is all about.”\n\n\r\n              Herro’s 3-pointer gave the Heat a 101-98 lead with 3:20 left. After he and Jimmy Butler hit jumpers, Herro made another 3-pointer to put Miami up 108-98.\n\n\r\n              “Tyler lives for those moments,” Spoelstra said. “He has the clutch gene -- he really does -- and we know he will knock down some really tough shots when we need them.”\n\n\r\n              Butler had 26 points and 10 assists and Bam Adebayo added 22 points and 10 rebounds for the Heat, who won for the third time in four games. Miami lost 113-99 in Chicago on Saturday.\n\n\r\n              “We definitely let one slip away yesterday, so we knew we had to get one back today,” Adebayo said. “I've been saying this all season, but we have to build on this -- we have to buy into playing this way every night.”\n\n\r\n              James Wiseman led the Pistons with 22 points and 13 rebounds. Killian Hayes put up 13 points and 11 assists. Detroit has lost 14 of its last 15 games.\n\n\r\n              “Our execution wasn't there down the stretch,” Pistons coach Dwane Casey said. “James played a hell of a game, but our transition defense is still tough. We're getting there, but we're not there yet.”\n\n\r\n              Detroit's Jalen Duren and Miami's Kevin Love left the game in the third quarter after banging heads under the basket. Love received four stitches and could have returned, but Duren was being evaluated for a brain injury after feeling “woozy.”\n\n\r\n              Detroit put up a 34-point third quarter, led by 12 points and five rebounds from Wiseman, and took an 81-74 lead on Eugene Omoruyi's buzzer-beating 3-point play.\n\n\r\n              “When I'm not getting touches, I know I have to find other ways to help us win,” Wiseman said. “That means rebounding and defense.”\n\n\r\n              TIP INS\n\n\r\n              Heat: After losing to the Pistons by 20 points at home on Dec. 6, Miami made its first appearance of the season in Detroit. They return on April 4.\n\n\r\n              Pistons: The Little Caesars Arena scoreboard displayed the score backward for the first quarter. When the period ended, the fans cheered after being informed the Pistons were leading 29-26, not Miami.\n\n\r\n              PISTONS STILL TRYING TO GO BIG\n\n\r\n              Marvin Bagley III returned after missing three games with ankle soreness and scored 14 points in 30 minutes. However, he and Duren combined for only four rebounds in 39 minutes as the Pistons continue to work on getting them into two-big lineups with Wiseman.\n\n\r\n              “It's tough for our bigs to get into the habit of matching up on the perimeter,” said Casey, who has said the team needs to dominate the boards when the big lineup is on the floor.\n\n\r\n              HEAT GET BENCH SPARKS\n\n\r\n              Kyle Lowry and Caleb Martin combined for 20 points, 11 rebounds and 10 assists for Miami's second unit. Lowry was a plus-28 in 25 minutes while Martin was a plus-25 in 31 minutes.\n\n\r\n              “Caleb was really inspiring tonight -- he made some shots and he anchored our defense at some key moments,” Spoelstra said. “Kyle just has a huge impact on winning games, because he's so active on both ends of the floor.” \n\n\r\n              UP NEXT\n\n\r\n              Heat: Host the New York Knicks on Wednesday.\n\n\r\n              Pistons: Visit the Atlanta Hawks on Tuesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993919.727654
}