{
  "game_id": "0021500476",
  "espn_id": "400828363",
  "date": "Dec 30, 2015",
  "matchup": "LAL @ BOS",
  "headline": "Kobe Bryant 's double-double carries Lakers past Celtics",
  "body": "BOSTON -- Mark Kobe Bryant down for one more win on the parquet floor in Boston.\nBryant had 15 points and 11 rebounds, and the Los Angeles Lakers beat the Celtics 112-104 on Wednesday night.\nBryant played 33 minutes and recorded his first double-double of what he says is his final season. Jordan Clarkson scored 24 points and Lou Williams had 19 as Los Angeles stopped a four-game slide.\nIt was Bryant's 173rd career double-double. The crowd chanted \"Kobe! Kobe!\" in the final minute. He waved to the crowd as he walked down the runway to the locker room, with the fans cheering and chanting his name.\n\n\"I wish I could do more to show my gratitude to them,\" said Bryant, who has an 11-12 record at Boston for his career, counting the postseason. \"It's a weird feeling walking across center court, looking down at that logo. I tried to cherish it as much as I can.\"\nThe 37-year-old Bryant played in the NBA Finals against Boston in 2008 and 2010. The first one ended with a blowout win by the Celtics in TD Garden. Los Angeles captured the second at Staples Center in a seventh game.\n\"I can't believe this is the last time I'm going to be here. It seems like just yesterday we were playing in the finals,\" he said.\nIsaiah Thomas had 24 points and Evan Turner scored 20 for Boston, which had won four in a row.\n\"Like I said, the fans here are unbelievable as far as their knowledge of the game,\" Los Angeles coach Byron Scott said. \"The battles that we've had with them, especially Kobe over the years. I think they just wanted to show their appreciation.\"\nThe Celtics trailed by 11 with just over six minutes left, but used a 9-0 run to close to 100-98 on Avery Bradley's jam.\nIt was still a two-point game before Bryant hit his second 3-pointer of the quarter, making it 107-102 with 1:40 left.\n\"It was just a mental letdown from top to bottom, from all of us,\" Boston forward Jae Crowder said. \"And it hurt us. And we tried to fight back and claw back and made it a game late in the fourth but it was too late.\"\nLos Angeles (6-27) appears to be headed for another poor finish in Bryant's last season. But the Lakers put together a solid effort against the Celtics, using a 21-4 run in the third to turn a one-point deficit into an 83-69 lead.\n\"We just had good energy,\" Lakers forward Julius Randle said.\nThe Lakers led 89-78 entering the final quarter.\nIn the first half, Bryant scored on consecutive drives 22 seconds apart -- after missing his first eight shots from the floor and a free throw -- to give the Lakers a 51-44 edge.\nLos Angeles led 58-56 at halftime.\nBryant received a huge ovation when he was announced for the starting lineups and touched his chest before waving to the fans.\n\"I think it should be like that. Everywhere that he goes,\" Bradley said. \"He's brought a lot to the NBA, and everyone respects what he does and what he did.\"\nBut those cheers quickly turned to boos the first time he touched the ball, with many of the fans reminding him that he remains a big part of perhaps the NBA's best rivalry. There were loud cheers when he missed the free throw after a Boston technical foul.\nBefore Wednesday's game, Bryant said losing in 2008 helped him discover the leader he needed to become.\n\"For the second half of my career, it's the most important piece,\" he said. \"Because when we lost in 2008, that was the turn. That was when I said, `I have to figure this leadership thing out. I can't go through this.\"\nDECISION WON'T CHANGE\nBryant said despite his solid play of late there's no chance he'll change his mind about retirement.\n\"Zero,\" he said. \"I feel completely at peace. Truly at peace. It's time.\"\nTIP-INS\nLakers: F Brandon Bass played his first game back in Boston after spending four seasons with the Celtics, and got a nice hand. The 30-year-old signed as a free agent with Los Angeles during the summer.\nCeltics: F David Lee returned after missing the last two games with a sore lower back.\nUP NEXT:\nLakers: Host Philadelphia on Friday.\nCeltics: Host Brooklyn on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994290.411076
}