{
  "game_id": "0021600260",
  "espn_id": "400899710",
  "date": "Nov 29, 2016",
  "matchup": "CHA vs. DET",
  "headline": "Harris scores 24, Pistons blow past Hornets 112-89",
  "body": "CHARLOTTE, N.C. -- The Detroit Pistons could have folded when center Andre Drummond was ejected in the second quarter.\nInstead, they rallied for a lopsided win with their talented big man in the locker room, routing the tired-looking Charlotte Hornets 112-89 on Tuesday night.\nHarris scored 24 points and Kentavious Caldwell-Pope and Marcus Morris each had 18 points to lead the Pistons. Ish Smith added 13 points, including two coast-to-coast layups to ignite his team in the third quarter.\nThe Pistons outscored the Hornets by 23 after Drummond was ejected for a flagrant-2 foul when officials ruled he elbowed Roy Hibbert in the head. Drummond laughed and shook his head as he walked off the floor, flabbergasted that he had been ejected.\n\"I thought that was a key part of the game right there,\" Pistons coach Stan Van Gundy said. \"We were down after the play so to come back and be up three at the half was good.\"\nDrummond said he didn't do it on purpose.\n\"I don't make the rules,\" Drummond said. \"I just play the game. They felt that I had done something maliciously. Everybody who knows me knows that's the type player I am. At the end of the day, it wasn't my call so I took the consequences and walked off the floor.\"\nSaid Harris: \"It says a lot about our team, but most importantly about guys like Aron (Baynes) and Jon (Leuer) to fill in for that role and be productive and bring the energy that he had when he was playing when he was out there.\"\nKemba Walker had 23 points for the Hornets, who were playing their fourth game in five nights.\nHornets coach Steve Clifford refused to use that as an excuse.\n\"We can come in here and do the preverbal it's five (games) in seven (nights), but if you do that, to me, you have the wrong expectations of what our team should be,\" Clifford said\nThe Pistons hadn't played since Saturday and looked much fresher throughout the game.\nDetroit took a 10-point lead into the fourth quarter after Caldwell-Pope knocked down a pair of 3-pointers late in the third. Things got sloppy from there with the Hornets turning the ball over frequently on bad passes, and the game quickly turned into a blowout.\nHornets center Cody Zeller said \"there will always be tough nights, but we need to find ways to win those.\"\nTIP INS\nPistons: The win snapped a three-game road losing streak. ... The Pistons had a season-high 12 3-pointers.\nHornets: Walker sent Smith falling to the floor in the second quarter when he faked a drive then stepped back to drain a 3-pointer. ... Walker has scored 20 or more points in 15 of the Charlotte's 18 games this season. ... Charlotte fell to 5-5 at home.\nDRUMMOND EJECTED\nThere is a history between Drummond and Hibbert. Hibbert said back in 2013 he was no longer a fan of Drummond after claiming he talked too much trash.\nCHARLOTTE TROUBLES\nClifford said he's concerned about two things -- the Hornets being 5-5 at home and 1/3 on the tail end of back-to-backs.\n\"If those things continue to happen then we certainly are not going to be in the position where we need to be,\" Clifford said.\nSMITH HOMECOMING\nSmith is a Charlotte native, so he enjoyed getting a win against the Hornets.\n\"It was good to see my family and friends and coaches and mentors who helped me along the way,\" Smith said. \"But it's a business trip. We'll be back in a week and it won't be any easier.\"\nLAMB HURT AGAIN\nCharlotte's Jeremy Lamb left on the first possession of the fourth quarter after banging knees with another player. He had been playing well after missing 10 games with a hamstring injury.\nUP NEXT\nPistons: Detroit has a back-to-back on the road, traveling to Boston to face the Celtics.\nHornets: Charlotte is back at home Thursday night when it hosts the Dallas Mavericks, who are 1-9 on the road this season.",
  "source": "espn_api",
  "crawled_at": 1764995534.867924
}