{
  "game_id": "0021600591",
  "espn_id": "400900012",
  "date": "Jan 12, 2017",
  "matchup": "PHX vs. DAL",
  "headline": "Williams shines, Mavericks beat Suns 113-108 in Mexico City",
  "body": "MEXICO CITY --  Deron Williams' savvy floor game helped the Dallas Mavericks offset Devin Booker's sensational shooting in Mexico City.\n\nWilliams had 23 points and 15 assists, and the Mavericks defeated the Phoenix Suns 113-108 on Thursday night in the fourth regular-season NBA game played in Mexico.\n\nWilliams shot 9 for 15 from the field in a matchup of struggling teams south of the border. Harrison Barnes added 22 points and Dirk Nowitzki scored 18 for the Mavericks, who broke a three-game losing streak.\n\nWilliams has scored at least 20 points six times in his last 10 games.\n\n\"Deron had a great night, both as playmaker and as a scorer, and he was involved in key stops down the stretch,\" Dallas coach Rick Carlisle said. \"When a veteran guy like that has a night like that, it's a real advantage for your team. He was solid and did it in a spectacular fashion -- a sign of a great pro.\"\n\nBooker scored 29 of his 39 points in the fourth quarter for the Suns. Tyson Chandler had 14 points and 19 rebounds against his former team.\n\nPhoenix took a 59-57 lead at halftime, but Williams hit a couple of 3-pointers and a jumper in a 17-4 run that gave the Mavericks a 76-63 lead with seven minutes left in the third quarter.\n\nThe Suns pulled within four after a 3 by Booker with 13 seconds to play in the game, but Dorian Finney-Smith made two free throws to seal it for Dallas.\n\n\"We wanted to get a win. We were sitting on a three-game losing streak and Phoenix just beats us at home a couple of nights ago, so it was a good win for us\", Nowitzki said. \"We made a nice little run in the third quarter and we were able to get some separation, but you've got to give them credit. Devin Booker was fantastic in the second half. He made shot after shot and he kept them in the game. At the end it was a lot closer than we wanted to, but we made big shots ourselves.\"\n\nDallas and Phoenix are tied for the worst record in the Western Conference at 12-27.\n\n\"We are at the point of the season where it's make or break. Every game counts at this point of the season and we need to get wins,\" the 20-year-old Booker said. \"We have a really young team and they put us under fire, but we have a coach that trusts and believes in us.\"\n\nThe game was the first of two that the Suns will play south of the border. Mexico is hosting two games in one season for the first time in NBA history.\n\nThe previous regular-season game in Mexico took place in 2015, when Boston faced Sacramento.\n\nSeth Curry scored nine points in the first quarter for the Mavericks, who took a 27-19 lead. Phoenix rallied and trailed just 32-29 after 12 minutes.\n\nIn the second period, Leandro Barbosa had back-to-back baskets and the Suns took the lead, but Dallas tied it with a shot from Barnes. Marquese Chriss got a layup with 19 seconds to play, sending Phoenix into halftime with the lead.\n\nTIP-INS\n\nSuns: It was the fourth straight game with more than 15 rebounds for Chandler, matching the longest streak by a Phoenix player. Shawn Marion did it in 2006. ... Booker had his 12th career game with 30 or more points.\n\nMavericks: Curry made his seventh start of the season.\n\nA TEAM IN MEXICO?\n\nDallas Mavericks owner Mark Cuban said would support the idea of an NBA team in Mexico. Cuban praised the Arena Ciudad de Mexico, and added that the distance from the United States is not a factor.\n\n\"I would love a team down here. I think it would really help the sport,\" Cuban said. \"I would like to come back with the Mavericks, and every time that the NBA asks, we would love to be here.\"\n\nMexico City's governor, Miguel Angel Mancera, said earlier in the week that he supports the idea of an NBA team in Mexico.\n\nSUNS DON'T SHINE IN MEXICO\n\nPhoenix fell to 0-3 in Mexico -- sort of. The Suns dropped preseason games in 1996 and 2009 to the Utah Jazz and Philadelphia 76ers, respectively.\n\nUP NEXT\n\nSuns: Play the San Antonio Spurs on Saturday in Mexico City.\n\nMavericks: Host the Minnesota Timberwolves on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995973.743458
}