{
  "game_id": "0021800337",
  "espn_id": "401071018",
  "date": "Dec 02, 2018",
  "matchup": "LAL vs. PHX",
  "headline": "Kuzma leads Lakers' 120-96 rout of Suns for 3rd straight win",
  "body": "LOS ANGELES --  Moritz Wagner drove for a layup to put the Los Angeles Lakers up by 31 points, and his teammates erupted off the bench in spontaneous glee for their German rookie's first NBA field goal.\n\n\"He learned how to ride a bike!\" LeBron James said afterward. \"That was that moment. You guys never rode a bike before? Yeah, we were excited. Very excited.\"\n\nThe Lakers had plenty of time for fun and frivolity after making easy work of the Phoenix Suns during the next win in an increasingly impressive season.\n\nKyle Kuzma scored 23 points and James had 22 before both sat out the fourth quarter of the Lakers' third home victory in four days, 120-96 over the struggling Suns on Sunday.\n\nBrandon Ingram scored 15 points and JaVale McGee had 14 points and eight rebounds in three quarters of work for the Lakers, who have won 12 of 16 since their 2-5 start to James' first season on the West Coast.\n\nMichael Beasley scored a season-high 14 points for the Lakers. Although they fell behind by 17 points in the first quarter, they still made easy work of last-place Phoenix despite committing 19 turnovers.\n\n\"I was very happy with our defensive effort again,\" coach Luke Walton said. \"I thought we came out a little flat. Michael Beasley and the second unit did a really good job of getting us started, and then from that point on, the rest of the guys had a pretty solid game.\"\n\nRichaun Holmes scored 15 points, and Josh Jackson and Trevor Ariza scored 13 apiece for the Suns, who have lost five straight to fall to 4-19.\n\n\"It's kind of hard not to focus on the record, but we've still got games to play,\" Jackson said. \"We show flashes of how good we could be. We just have to be able to start stringing those runs together and just be better all the time. The more consistent we get, the better we'll be.\"\n\nNo. 1 overall pick Deandre Ayton had 10 points and 10 rebounds, but the Suns couldn't build on their excellent first quarter.\n\n\"Obviously we can't be happy with the final result, but I thought we came ready to play, to compete,\" Phoenix coach Igor Kokoskov said. \"The first 10 minutes of the game, we can say that we looked like an organized group and we competed.\"\n\nTIP-INS\n\nSuns: T.J. Warren missed his second straight game with ankle soreness, but Kokoskov doesn't think it's serious. Jackson started for the second straight game in Warren's place. ... Ariza, who spent two seasons with the Lakers from 2007-09, attended Westchester High School near the Lakers' training complex before going to UCLA. He got a warm ovation from Lakers fans, many of whom would love to land his services as a 3-point shooting specialist for their team.\n\nLakers: Tyson Chandler had three points and 11 rebounds while facing the Suns for the first time since leaving Phoenix one month ago and signing with Los Angeles as a free agent. Chandler was an early mentor to Ayton.\n\nBOOKER DOWN\n\nDevin Booker scored six points before leaving with a strained left hamstring in the second quarter. Booker hurt his leg while chasing a loose ball out of bounds, going immediately to the locker room.\n\nBooker missed three games in October after straining his left hamstring in the Suns' first game against the Lakers. He was returning Sunday from a one-game absence due to an injured left toe after stubbing it on his hotel bed during the Suns' trip to Los Angeles to play the Clippers last Wednesday.\n\nKokoskov had no immediate update on Booker's condition afterward.\n\nMOE SCORES\n\nWagner scored the first 10 points of his NBA career in the fourth quarter of his fourth game for the Lakers. The first-round pick from Michigan and Berlin hit two free throws before getting his first field goal with 5:01 to play. He added a pair of 3-pointers a few moments later. The start of the 6-foot-11 Wagner's rookie season was slowed by a bruised knee in training camp.\n\nWAKE UP\n\nThe Lakers didn't adapt well to the early start time, falling behind 25-8 in the opening seven minutes with a turnover-plagued beginning. But Kuzma and James sparked an abrupt turnaround late in the first quarter, and the Lakers made a prolonged 45-18 run to a 15-point lead late in the second.\n\nLos Angeles poured it on in the third, taking a 23-point lead with 10 point from James.\n\nUP NEXT\n\nSuns: Host Sacramento on Tuesday night.\n\nLakers: Host San Antonio on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995020.5623648
}