{
  "game_id": "401810144",
  "espn_id": "401810144",
  "date": "Nov 24, 2025",
  "matchup": "NO vs CHI",
  "headline": "Zion Williamson scores 29 and the Pelicans end a 9-game skid with a 143-130 win over the Bulls",
  "body": "NEW ORLEANS -- — Zion Williamson tied a season high with 29 points and the New Orleans Pelicans defeated the Chicago Bulls 143-130 on Monday night to end a nine-game losing streak and win for the first time under interim coach James Borrego.\n\n\r\n              Saddiq Bey had 20 points and 14 rebounds, highlighted by a pair of late 3s to help New Orleans hold a lead that was 18 points with 5:15 left but fell to single digits in the last two minutes.\n\n\r\n              Fans stood to applaud as the Pelicans began to run down the clock for their first victory since Nov. 5 at Dallas, 10 days before the firing of coach Willie Green, when New Orleans was 2-10.\n\n\r\n              Borrego needed six games to get his first win, and it came with a balanced, high-scoring effort.\n\n\r\n              The Pelicans (3-15) had eight players with 10 or more points. Trey Murphy scored 20 points, Jose Alvarado had 16, Yves Missi had 14 points and 14 rebounds, Bryce McGowens scored 11 and Micah Peavy had 10.\n\n\r\n              Ayo Dosunmu scored 28 points and Coby White added 24 for Chicago, which went 20 of 50 on 3-pointers. Josh Giddey added 21 points and Jalen Smith 13 for the Bulls, while Tre Jones had 10 points and 11 assists off the bench.\n\n\r\n              The Pelicans led by as many as 22 points in the second quarter when Murphy made it 55-33 by converting a 3-point play on a reverse layup while being fouled by Smith.\n\n\r\n              After the Bulls had chipped away in the final minutes of the second quarter, Williamson hit a driving layup and added a finger-roll in the final seconds of the period to put the Pelicans up 74-58 at halftime.\n\n\r\n              Up next\r\n              Bulls: Visit the Charlotte Hornets on Friday night.\n\n\r\n              Pelicans: Host the Memphis Grizzlies on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042690.465683
}