{
  "game_id": "401809807",
  "espn_id": "401809807",
  "date": "Nov 26, 2025",
  "matchup": "NO vs MEM",
  "headline": "Jackson, Wells and Edey help the Grizzlies outlast the Pelicans 133-128 in OT",
  "body": "NEW ORLEANS -- — Jaren Jackson Jr. scored 27 points, Jaylen Wells added 25 and the Memphis Grizzlies outlasted the New Orleans Pelicans 133-128 in overtime Wednesday night in NBA Cup play.\n\n\r\n              Zach Edey had 21 points, 15 rebounds and two blocked shots for the Memphis, which improved to 2-1 in West Group B, while the Pelicans completed in-season tournament play at 0-4. The Grizzlies outscored New Orleans by 39 points during the 35 minutes Edey was on the court.\n\n\r\n              Jose Alvarado scored 24 for the Pelicans, who dominated when Edey was on the bench. They went up by 17 in the first half and led for most of regulation. Saddiq Bey had 18 points and 10 rebounds, and Zion Williamson scored 17 for New Orleans, which snapped a nine-game skid on Monday night.\n\n\r\n              After Alvarado's sixth 3-pointer tied the score at 128 late in overtime, Jackson found Wells behind the New Orleans defense for a dunk that gave the Grizzlies the lead for good.\n\n\r\n              New Orleans had three more possessions, but Williamson turned the ball over on one and missed a 3 late in the shot clock on another. Alvarado could not connect with Williamson on an inbounds pass in the final seconds.\n\n\r\n              The Grizzlies were on the brink of winning in regulation, but Williamson hit a difficult driving scoop off the glass with 0.9 seconds left to tie it at 122. \n\n\r\n              Alvarado hit four 3s and scored 18 points on 7-of-10 shooting in his first 12 minutes on the court, helping the Pelicans take a 68-53 lead at halftime.\n\n\r\n              Memphis opened the third quarter on a 13-2 run that included two 3s by Wells and one by Jackson. The Grizzlies hit six of eight 3s in the period.\n\n\r\n              The Pelicans responded by hitting seven of their next 10 from deep — three by Jordan Hawkins and two by Bey.\n\n\r\n              That helped the Pelicans maintain their lead into the fourth quarter, when neither team led by more than nine.\n\n\r\n              Up next\r\n              Grizzlies: Visit the Los Angeles Clippers in West Group B NBA Cup play on Friday night.\n\n\r\n              Pelicans: Visit the Golden State Warriors on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042701.778028
}