{
  "game_id": "0021500234",
  "espn_id": "400828121",
  "date": "Nov 27, 2015",
  "matchup": "OKC vs. DET",
  "headline": "Durant leads Thunder to 103-87 win over Pistons",
  "body": "OKLAHOMA CITY -- The Thunder showed why it pays to have two superstars.\nKevin Durant picked up for Russell Westbrook's off night, posting 34 points and a season-high 13 rebounds to help Oklahoma City beat the Detroit Pistons 103-87 Friday for its fourth straight win.\n\nDurant scored 14 points in the third quarter to help the Thunder seize momentum.\n\"He was aggressive,\" Oklahoma City guard Dion Waiters said. \"He came down and made shots. Also, on the defensive end, he was locked in. Anytime a guy like that is locked in and making shots, it's going to be tough to beat us.\"\nDurant made 10 of 22 shots and all 10 of his free throws.\n\"I'm sure we had some defensive breakdowns, but the guy is a hell of a player,\" Pistons coach Stan Van Gundy said. \"He can get shots over the top of anybody at any time. You're talking about the top two or three players in the world. He's pretty good.\"\nWestbrook, the NBA's No. 3 scorer, finished with 14 points and 11 turnovers. He shot 5 of 14 and fouled out for the eighth time in 524 career regular-season games.\nSerge Ibaka and Enes Kanter added 14 points apiece for the Thunder.\nDetroit center Andre Drummond, who was leading the league with 17.8 rebounds per game, finished with seven. In a matchup of the NBA's top two rebounding teams, the No. 2 Thunder outrebounded the No. 1 Pistons 58-38.\n\"That's something we should have been able to do a better job of,\" Van Gundy said.\nPistons point guard Reggie Jackson was traded by Oklahoma City last season after saying he wanted to be a starter, despite playing behind Westbrook. Jackson was booed loudly during pregame warmups and jeered most of the time when he touched the ball. He finished with 15 points on 4-for-16 shooting.\nThe Thunder scored the first eight points of the game, but the Pistons led 55-48 at halftime. Detroit shot 46 percent in the first half and held Durant and Westbrook to 7-for-20 shooting combined.\nOklahoma City rallied early in the second half as Detroit started missing shots. Consecutive 3-pointers by Durant cut Detroit's lead to 62-60.\nDrummond committed his fourth foul with 4:59 left in the third quarter and the Pistons up 65-61. The Thunder drove right at him for back-to-back layups, and Waiters' bucket put Oklahoma City in front 66-65. Durant scored 14 points in the quarter to help put the Thunder ahead 76-71 heading into the fourth.\nOklahoma City pushed the lead to double digits on a baseline jumper by Ibaka with 9:36 remaining and controlled the game from there.\nSTAT LINES\nDurant shot 4 of 9 on 3-pointers and has made 33 of 70 this season. He entered ranked No. 5 in the league in 3-point percentage (.475), a mark that actually dropped with Friday's effort.\nCHIPPY GAME\nThere were five individual technicals in the game -- on Marcus Morris, Kentavious Caldwell-Pope and Stanley Johnson for the Pistons, and on Waiters and Anthony Morrow for the Thunder. Double technicals were called twice.\nSHUTDOWN D\nOklahoma City held Detroit to 32 points in the second half on 11-for-46 shooting, including 4 of 16 on 3-pointers.\n\"I think we found some shots, we just couldn't get them to go in,\" Jackson said. \"I think that's been the story for us all season. We've got to find a better flow for the offense.\"\nTIP-INS\nPistons: Detroit committed only one turnover in the first quarter and eight overall. ... Jackson got into early foul trouble and played just 6:15 in the first half. ... Drummond was held below 10 rebounds for the first time this season.\nThunder: Durant scored 15 points in the first quarter. ... Westbrook missed his first six shots. ... Ibaka made his first six shots. ... Westbrook's 11 turnovers tied Denver rookie Emmanuel Mudiay for the most in a game this season. ... C Steven Adams finished with eight points and 13 rebounds. ... Ibaka had four blocks and Durant had three.\nUP NEXT\nThe Pistons play at Brooklyn on Sunday.\nThe Thunder play at Atlanta on Monday.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764994207.138186
}