{
  "game_id": "0021700594",
  "espn_id": "400975340",
  "date": "Jan 08, 2018",
  "matchup": "MIN vs. CLE",
  "headline": "Wiggins, Butler lead 127-99 Wolves romp past James, Cavs",
  "body": "MINNEAPOLIS --  The Minnesota Timberwolves, like so many lesser opponents over the years, have been largely unsuccessful in trying to best LeBron James.\n\nThis time, they built a lead on Cleveland as big as 41 points before the end of the third quarter. It was just another example of the difference Jimmy Butler has made on this promising team.\n\nAndrew Wiggins had 25 points in three quarters, Butler pitched in 21 points and tight defense on James, and the Timberwolves cruised to a 127-99 victory over the Cavaliers on Monday night.\n\n\"We did what we're supposed to do at home,\" Butler said. \"We're a really good team. They're a really good team. They missed a lot of shots that they normally make. We all know that. We'll see them again down the road, and hopefully we play the same exact way.\"\n\nKarl-Anthony Towns (19 points, 12 rebounds) and Taj Gibson (16 points, 13 rebounds) were tenacious around the basket for the Timberwolves, who outrebounded the Cavs 56-37, their largest advantage of the season. The Wolves had a 60-42 edge in points in the paint, and every starter but Towns took the whole fourth quarter off.\n\nWith their 116-98 win over New Orleans on Saturday, the Wolves have enjoyed a ferocious start to this five-game homestand.\n\n\"We just came out the last two games with a certain mentality, a certain focus,\" Towns said.\n\nJames had just 10 points on 4-for-8 shooting, taking his first loss at Minnesota in 13 games since Feb. 17, 2005. He posted a career-worst minus-39 rating.\n\n\"I've won a game and had a bad plus-minus before, so what does that matter?\" James said. \"I don't give a damn about no damn plus/minus.\"\n\nThe deficit for the Cavs reached 41 points after a dunk by Wiggins set up by a driving pass by Tyus Jones, who had grabbed his own miss from 3-point range.\n\nButler had plenty to do with that, contributing nine assists and eight rebounds before resting during the fourth quarter. The Wolves led 69-42 at halftime, matching their largest first-half score from just two nights ago, after a rainbow 3-pointer from the top of the key by Butler brought the fans to their feet. That also tied the most points allowed by the Cavs in any half this season.\n\n\"What he's doing every night, it's amazing, but it's also bringing the best out of everyone on the team, and to me that's the true mark of greatness,\" coach Tom Thibodeau said of his hand-picked leader and star who arrived last summer in a trade with Chicago.\n\nButler has experienced seven straight wins over James and the Cavs. He made sure the Wolves didn't slip after the break, knocking down a mid-range fadeaway, stealing the ball back and then swishing a pull-up 3-pointer on the other end to push the lead to 31 points early in the third quarter.\n\nJeff Green scored 22 points off the bench to lead the Cavs, who've lost six of their last nine. Kevin Love, J.R. Smith and Isaiah Thomas, three-fifths of the starting lineup, were a combined 0 for 18 from the field in the first half. Love finished with three points and two rebounds in 21 minutes. But that was hardly the problem.\n\n\"We've got to be better defensively,\" coach Tyronn Lue said.\n\nTIP-INS\n\nCavaliers: Kyle Korver, who had 19 points off the bench, connected four times from beyond the arc and passed Paul Pierce for fourth place on the NBA's all-time list in 3-pointers made with 2,147. Ray Allen (2,973), Reggie Miller (2,560) and Jason Terry (2,244) are ahead of him.\n\nTimberwolves: After shooting 52 percent from the field, the Wolves improved to 12-2 when making at least half of their shots.\n\nHEAVE-HO\n\nThomas was ejected in the third quarter for a flagrant-two foul on Wiggins, for clotheslining him in the jaw as he drove to the basket.\n\n\"I didn't mean to do that,\" Thomas said. \"I'm just glad he's all right.\"\n\nThomas, still on a playing-time restriction coming off a hip injury, had nine points in 19 minutes.\n\n\"I've got to figure out a better way to start the game off,\" he said.\n\nTAKE THAT\n\nJames chased down Jones to swat his fast-break layup attempt into the seats in the second quarter, following with a stare-down and some barbs traded with Aaron Brooks on the Wolves bench.\n\nJones got his revenge a little later in the same period on a similar play, throwing down a dunk just in time before James arrived to try for another block. That was just the second career dunk for Jones, whose first NBA slam was last week.\n\nCROWD PLEASER\n\nThe game marked the fourth consecutive sellout of Target Center for the Timberwolves, their longest streak in nearly five years. Love, who was traded to the Cavs for Wiggins, was the recipient of several rounds of boos in the first quarter.\n\n\"We're playing good basketball. Everyone's playing together. We're giving the fans what they want to see,\" said Wiggins, who beat the Cavs, the team that drafted him first overall in 2014 and dealt him before he ever played for them, for the first time.\n\nUP NEXT\n\nCavaliers: Play at Toronto on Thursday, the fourth stop on a five-game trip.\n\nTimberwolves: Face Oklahoma City on Wednesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992641.323807
}