{
  "game_id": "0022200237",
  "espn_id": "401468392",
  "date": "Nov 19, 2022",
  "matchup": "MIN @ PHI",
  "headline": "Timberwolves hang on, top undermanned 76ers 112-109",
  "body": "PHILADELPHIA -- — Against another short-handed team, the Timberwolves again came up big on the road. \n\n\r\n              Anthony Edwards scored 25 points, D’Angelo Russell had 19 and the Minnesota Timberwolves survived a late scare and won their third straight game, 112-109 over the undermanned Philadelphia 76ers on Saturday night.\n\n\r\n              “We took a lot of bad shots, I definitely did, but we got the win, though,” Edwards said of a 7-of-21 effort.\n\n\r\n              The 76ers have already played without James Harden for two weeks because of a right foot tendon strain and they added starting guard Tyrese Maxey to the injury list with a broken left foot suffered Friday. P.J. Tucker suffered an unspecified injury against the Timberwolves and Joel Embiid injured his left ankle/foot following a late-game collision with a teammate.\n\n\r\n              Embiid, the reigning NBA scoring champion, said well after the final buzzer he was still in pain and he hobbled off the dais following his press conference.\n\n\r\n              “Hopefully, somehow it feels better, but we’ll see,” Embiid said.\n\n\r\n              Maxey and Harden averaged 20-plus points on the season, and their losses left Embiid to carry the load among a lineup that in one stretch included him, Danuel House Jr., De’Anthony Melton, Shake Milton and Georges Niang.\n\n\r\n              “No one feels sorry for you. So I’m not going to feel sorry for us either,” coach Doc Rivers said. “We’ve got to find a way to win. I know that sounds nuts. But we just have to. And we’ll figure it out.”\n\n\r\n              The 76ers need more time.\n\n\r\n              Embiid had 32 points, nine rebounds and made 18 of 20 free throws. Milton had 27 points and Melton 19.\n\n\r\n              Without two top scorers, the Timberwolves pounced early on the Sixers and stretched a winning streak with all three wins on the road. They won at Cleveland, Orlando and moved to .500 at 8-8. \n\n\r\n              The Magic played without rookie Paolo Banchero and center Wendell Carter Jr., their two leading rebounders and two of their top three scorers. Cleveland played without injured All-Stars Donovan Mitchell and Jarrett Allen.\n\n\r\n              “We’re not in a position where we feel like we can afford any letdowns,” Timberwolves coach Chris Finch said. “We’re just starting to play well ourselves.”\n\n\r\n              Embiid gave the Sixers a scare with 5:33 left in the game when he tripped over fallen teammate Georges Niang and crumbled to the court. Embiid rolled his left ankle and lay on his back as he was checked out by a trainer.\n\n\r\n              Embiid hobbled to the bench but stayed in the game. He limped the rest of the game and hit the court again — on a steal and then he followed with a 3 that pulled the Sixers to 105-102.\n\n\r\n              Edwards buried a 3 that stretched the lead to six.\n\n\r\n              Melton, though, hit a 3 with 30 seconds left that inched the Sixers within one but he missed a driving layup in traffic on the next possession that was their best last-gasp effort to complete a comeback from 20 points.\n\n\r\n              Niang airballed a desperation 3 at the horn.\n\n\r\n              “Sometimes the clock in your head goes faster than what you actually have,” he said\n\n\r\n              Minnesota led by 15 points in the fourth and was outscored 19-7 over the final 8:46 of the game.\n\n\r\n              “We were able to hold on, make enough shots, make a couple of big plays to win a game like that,” Finch said. “It shouldn't have come down to that.”\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Finch played at Franklin & Marshall College in Lancaster, Pennsylvania, where he was an NCAA Division III All-American in 1991 and 1992. He played the same time the 76ers used to hold training camp at the college. “Team of my youth but no longer,” Finch said.\n\n\r\n              76ers: Tobias Harris (sore left hip) sat out.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Miami on Monday night.\n\n\r\n              76ers: Welcome back former Sixer Ben Simmons when Brooklyn hits town Tuesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995184.227807
}