{
  "game_id": "0022200604",
  "espn_id": "401468759",
  "date": "Jan 08, 2023",
  "matchup": "ATL @ LAC",
  "headline": "Young scores 30, Hawks rally to beat reeling Clips 112-108",
  "body": "LOS ANGELES -- — Trae Young scored 30 points and the Atlanta Hawks beat the Clippers 112-108 on Sunday night, sending reeling Los Angeles to its season-worst sixth straight loss.\n\n\r\n              De’Andre Hunter added 20 points for the Hawks, who blew a 17-point, first-half lead before rallying from 11 points down in the fourth to pull out the win. \n\n\r\n              “We just got to keep building on it. We can't take no steps back,” Hunter said. \n\n\r\n              Atlanta coach Nate McMillan earned his 750th career victory, putting him fourth all-time among active coaches.\n\n\r\n              “That's a big mark and I'm happy he got it with us,” Young said.\n\n\r\n              Trailing 102-91, Young keyed a 17-4 run that he capped with two free throws to tie it before his basket gave Atlanta a 108-106 lead.\n\n\r\n              Kawhi Leonard answered with a layup that tied it for the second time in the final 1:16.\n\n\r\n              Young scored for a 110-108 lead before Leonard and Marcus Morris missed 3-point attempts on the same possession. Young got fouled and made both free throws to close out the win. He had 14 points in the decisive fourth.\n\n\r\n              Leonard led the Clippers with 29 points. Ivica Zubac had 17 points and 18 rebounds on a night when Paul George missed his second straight game with right hamstring soreness.\n\n\r\n              “Tonight, we had a conscious effort of playing the right way so I can live with the results,” Clippers coach Tyronn Lue said. “We did some good things to get back in the game after being down. I liked our fight. Seeing what we did I was encouraged.”\n\n\r\n              The Clippers trailed by 17 in the second after giving up 41 points. They rallied in the third behind Morris' three 3-pointers in a 21-4 spurt that put them back in front.\n\n\r\n              That set the stage for the fourth, when they raced out to an 11-point lead before the Hawks took over the final six minutes.\n\n\r\n              Atlanta ran off 11 straight points to tie it up, 102-all, on Dejounte Murray's basket. Young hit a 3-pointer and made three free throws in the run.\n\n\r\n              The Clippers dissolved with misses and turnovers down the stretch.\n\n\r\n              “We got some decent shots but then we had some turnovers, too. That led to some easy baskets for those guys,” Lue said. “We got to keep working. No one is going to feel sorry for us.”\n\n\r\n              The Clippers clawed back in the third, outscoring the Hawks 21-4, including 13 in a row, to take an 83-79 lead. Morris opened and closed the run with 3-pointers and hit another one in between. Los Angeles led 87-85 going into the fourth.\n\n\r\n              The Hawks exploded for a 41-point second quarter, punctuating the closing seconds with consecutive dunks. John Collins slammed down an alley-oop pass from Young. Hunter stole the ball from John Wall and scored on a driving dunk to send the Hawks into halftime leading 66-52.\n\n\r\n              “That was a big key for us, getting out in transition and running and just playing fast paced,” Young said. \n\n\r\n              Atlanta broke open a one-point game with runs of 13-0, 7-0 and 7-0 in the second while the Clippers fell behind by 17 points. Jalen Johnson scored nine points in the Hawks' first big spurt, including two 3-pointers.\n\n\r\n              “The first half we were just flowing. Everybody was touching the ball, everybody was getting shots, everybody was playing defense. We just had a good rhythm,” Hunter said.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Improved to 8-13 on the road. ... Had lost five of previous six. ... Clint Capela (right calf strain) remains out.\n\n\r\n              Clippers: Luke Kennard (right calf soreness) sat out. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Milwaukee on Wednesday in one of just five home games in January.\n\n\r\n              Clippers: Host Dallas on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994831.174998
}