{
  "game_id": "0021500706",
  "espn_id": "400828593",
  "date": "Jan 29, 2016",
  "matchup": "LAL @ LAC",
  "headline": "Clippers send Lakers to 9th straight loss with 105-93 win",
  "body": "LOS ANGELES --  The Clippers are facing another month without Blake Griffin dominating inside. His absence has created nightly auditions for whoever wants to step up.\n\nAgainst the Lakers, it was Lance Stephenson, whose 16 points helped the Clippers' reserves dominate in a 105-93 victory Friday night for their franchise-record ninth straight win over their Staples Center co-tenant.\n\n\"This stretch is going to give guys a lot of confidence,\" said Chris Paul, who had a game-high 27 points. \"We can win games, but we need (32) to win this championship.\"\n\nGriffin is nursing a broken right shooting hand after punching a team staff member on the road last weekend. He had already been out since Dec. 26 with another injury. The team is 14-3 without him since he first went down.\n\nAustin Rivers added 17 points and Jamal Crawford had 16 points off the Clippers' bench.\n\nThe Lakers dropped their ninth in a row and 13th in 14 games. They are one loss away from equaling the team's worst skid since moving to Los Angeles, having lost 10 straight at the end of the 1993-94 season when Magic Johnson was interim coach.\n\n\"We put a lot of work in and losing isn't fun,\" said Jordan Clarkson, who scored 17 points.\n\nThe Lakers had 17 turnovers that led to 28 points by the Clippers. Coach Byron Scott lectured his players in a timeout to take care of the ball after three of their previous four possessions were turnovers.\n\n\"We went out and had three more straight turnovers,\" he said. \"Our margin for error was so slim we couldn't afford to give that many possessions away, and they were getting layups on the other end because of our turnovers.\"\n\nJulius Randle had 23 points and 14 rebounds. Kobe Bryant sat out with various ailments.\n\nThe Clippers won their third in a row and fifth in seven games. Their bench carried them on a night when Paul was the only starter in double figures. Their reserves outscored the Lakers' bench 56-25, led by Rivers, Stephenson and Jamal Crawford with 15 points.\n\n\"There are a lot of guys that are playing more than they were with Blake, so when he comes back we're going to have that much deeper of a team,\" Rivers said.\n\nConsecutive 3-pointers by Crawford and Stephenson gave the Clippers a 90-76 lead in the fourth. Randle scored four of the Lakers' next six points to pull them within eight.\n\nCrawford got the Clippers going again with a basket. Stephenson followed with a one-handed jam over Randle that fired up Jordan, who is usually the one responsible for his team's highlight dunks.\n\n\"Come on, bro. That was nice,\" Jordan said to Stephenson, who hasn't played a lot. \"I like seeing my teammates be successful and that was a really big play.\"\n\nStephenson replied, \"I got up high. I really took off too far, but he (Randle) boosted me up a little bit. I felt like I was close enough to dunk so I kept it going.\"\n\nIn the other locker room, Randle was getting grief from his teammates.\n\n\"The guys are giving it to me, but it happens,\" he said. \"It was a good play by Lance.\"\n\nHaving beaten everyone down the court, Crawford then served up the ball to a streaking Jordan for a dunk that extended their lead to 96-82. Jordan had 17 rebounds.\n\nThe Lakers opened the third quarter on a 14-5 run to take a 63-59 lead. Clarkson, Randle and Roy Hibbert each had four points in helping the Lakers run off 10 straight points during the spurt.\n\nThe Clippers regrouped and outscored the Lakers 19-7 to take a 78-71 lead into the fourth. Rivers scored six points, highlighted by a one-handed dunk, and Paul added five points.\n\nTIP-INS\n\nLakers: They fell to 0-2 against the Clippers this season, having lost 94-84 on Christmas night.\n\nClippers: Their winning streak against the Lakers is the third-longest active such streak against any opponent.\n\nLEAVE IT TO DOC\n\nThe rest of the Clippers let coach Doc Rivers know that he is the public face of the team when it comes to Griffin's punching incident.\n\n\"They told me upfront, `Hey, we're out,\" he said. \"We're playing.\"\n\nQUOTE OF THE NIGHT\n\n\"I left last night and said I need to get a drink.\" -- Scott after the Lakers' 23-point loss to the Bulls a night earlier.\n\nUP NEXT\n\nLakers: Host Charlotte on Sunday.\n\nClippers: Host Chicago on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994271.878984
}