{
  "game_id": "401810170",
  "espn_id": "401810170",
  "date": "Dec 01, 2025",
  "matchup": "DEN vs DAL",
  "headline": "Anthony Davis has 32 points as Mavericks beat Nuggets 131-121",
  "body": "DENVER -- — Anthony Davis scored a season-high 32 points in his second game back from injury, and the Dallas Mavericks beat the Denver Nuggets 131-121 on Monday night.\n\n\r\n              Rookie Ryan Nembhard had 28 points and 10 assist, both career bests, to help Dallas win consecutive games for the first time this season. Cooper Flagg added 24 points for Dallas, which hit 16 of 31 shots from 3-point range.\n\n\r\n              The loss was the fourth straight at home for Denver, three of them against teams without winning records. It also spoiled a career night for Spencer Jones, who had 28 points, and Nikola Jokic's 11th triple-double of the season. He finished with 29 points, a season-high 20 rebounds and 13 assists.\n\n\r\n              The already short-handed Nuggets played the fourth quarter without Jamal Murray, who was slow going to the locker room at halftime. He went to the floor in the first minute of the third quarter, hung back at the defensive end and then walked gingerly to the locker room but returned a few minutes later.\n\n\r\n              Davis missed 14 games before returning against the Lakers on Friday night. He sat out Saturday night for maintenance but looked dominant in his seventh game of the season. He grabbed 13 rebounds to tie his season high.\n\n\r\n              The Nuggets led by 17 early in the first half but were outscored 42-27 in the second quarter, the third time in the last six home quarters they allowed 41 or more.\n\n\r\n              The Mavericks trailed by four with 9:31 left but used an 18-5 run to lead 129-117 with 1:29 left. Denver missed 10 straight shots, six from 3-point range, until Peyton Watson scored two straight baskets.\n\n\r\n              Up next\r\n              Mavericks: Host the Miami Heat on Wednesday night.\n\n\r\n              Nuggets: Begin a four-game road trip at Indiana on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042733.097157
}