{
  "game_id": "0022400471",
  "espn_id": "401705037",
  "date": "Jan 03, 2025",
  "matchup": "HOU vs. BOS",
  "headline": "Derrick White scores 23 points as Celtics roll to 109-86 win over Rockets",
  "body": "HOUSTON -- — Derrick White had 23 points and Jayson Tatum and Payton Pritchard added 20 each to lead the Boston Celtics to a 109-86 victory over the Houston Rockets on Friday night.\n\n\r\n              The Celtics led by 10 after three and scored the first 11 points of the fourth quarter to push their advantage to 93-72. White, Kristaps Porzingis and Pritchard made 3s in that stretch to help the Celtics pull away for their third straight victory.\n\n\r\n              Boston was up by 21 points with about 4 1/2 minutes to go when coach Joe Mazzulla cleared the bench. \n\n\r\n              Porzingis added 11 points with five rebounds in his return after missing four games with a sprained left ankle. \n\n\r\n              Jalen Green had 27 points for the Rockets. They lost for the third time in four games. \n\n\r\n              Takeaways \r\n              Celtics: Boston had no trouble handling Houston despite playing without Jaylen Brown, who missed a second straight game with a shoulder strain. Sam Hauser, who had 15 points Thursday night filling in for Brown, didn't score Friday night.\n\n\r\n              Rockets: Houston started 38-year-old Jeff Green for the first time this season with news Friday that Jabari Smith Jr. could miss up to two months after breaking a bone in his hand during shootaround. Amen Thompson, the fourth pick in the 2023 draft, will fill in for him moving forward after finishing up a two-game suspension Friday night for a fight with Miami’s Tyler Herro last weekend.\n\n\r\n              Key moment\r\n              Boston’s big run to open the fourth quarter and extend the lead to 21 points.\n\n\r\n              Key stat\r\n              The Rockets made just 32 of 88 shots with Green going 10 of 21 and Cam Whitmore making just 4 of 17.\n\n\r\n              Up next\r\n              The Celtics visit Oklahoma City on Sunday, and the Rockets host the Los Angeles Lakers on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997389.643618
}