{
  "game_id": "0021501193",
  "espn_id": "400829080",
  "date": "Apr 09, 2016",
  "matchup": "OKC @ SAC",
  "headline": "Kings edge Thunder in final game at Sleep Train Arena",
  "body": "SACRAMENTO, Calif. -- A raucous, sellout crowd was rewarded with a victory on a night when they bid an emotional goodbye to an aging 28-year-old arena that housed one last game for the Sacramento Kings.\nRudy Gay scored 24 points, including two free throws with one second left, to help the Kings celebrate the final game at Sleep Train Arena with a 114-112 victory over the Oklahoma City Thunder on Saturday.\nDarren Collison had season-high 27 points and eight assists for the Kings, who were focused on giving their devoted fans one last victory on their home court. Next season, the team will move to $519 million Golden 1 Center, which is located in downtown Sacramento.\n\"These are some of the best fans in the NBA, and we knew how bad they wanted a win,\" said Seth Curry, who made a career-high six 3-pointers and scored 20 points. \"It was something we wanted to do for the fans.\"\nAlthough there was nothing at stake for either team, fans were on their feet chanting and ringing cow bells. They even did the \"wave\" in the fourth quarter. The energy was reminiscent of a playoff atmosphere, even though the Kings have won just 32 games and won't make the playoffs for a 10th straight season.\n\"It was fun. The crowd was amazing the whole night. They were on their feet pretty much the whole entire game,\" Collison said. \"I remember growing up in L.A. I knew how tough Sacramento was because of the fans. They've always had a good fan base. I'm sure this win means more to them than it means to us.\"\nThere were approximately 50 former Kings players and coaches introduced at halftime. The group included Rick Adelman, Spud Webb, Joe Kleine, Rodney McCray, Tyus Edney, Otis Thorpe, Reggie Theus, Brad Miller, Mike Bibby, Pete Carril, Kenny Smith and Vinny Del Negro.\n\"There's a lot of memories in this place,\" said Miller, who played five-plus seasons for the Kings.\nKevin Durant had 31 points and eight assists for the Thunder, who have a division title and the Western Division's No. 3 seed locked up. Durant has scored at least 20 points in 63 straight games, tying Kobe Bryant (2005-07) for the longest such streak.\nRussell Westbrook had 24 points and 10 assists, and Serge Ibaka scored 14 points for Oklahoma City.\n\"This is a great environment here and I said that before the game,\" Thunder coach Billy Donovan said. \"They've always had great, great support and enthusiasm, but I don't want to sit here and say it was anything our guys hadn't seen before. Guys battled and fought and we made way too many mistakes to find a way to win there at the end.\"\nDeMarcus Cousins had 15 points and seven rebounds, but fouled out with 3:26 remaining and struggled throughout, missing 17 of 24 shots. Cousins said he will not play in the team's final two games.\nGay's clutch foul shots came after the Kings had squandered a seven-point lead with 26 seconds remaining.\n\"They trusted me with the ball at the end and I had to perform,\" said Gay, who had missed two of four free throws in the final minute before making the game-winners.\nAfter defeating Toronto for their eighth straight victory on March 28, the Thunder have dropped four of six games while resting various players.\nAnthony Morrow hit a corner 3-pointer to pull the Thunder within two at 111-109. Gay responded with a free throw for a three-point lead. But Westbrook was fouled on a 3-point attempt and made all three foul shots, tying the game at 112 with 7 seconds remaining.\nDurant had made two free throws to tie the game at 101 with 3:26 remaining as Cousins went to the bench with his sixth foul. Collison hit a 3-pointer and later added a jumper, giving the Kings a 108-103 advantage with 57 seconds left.\n\"We fought back after being down by eight or so late in the fourth and we tied the game up,\" Durant said. \"They put it in the refs' hands again in the fourth and the end of the fourth. (Gay) made those two free throws. I thought we played great defense, but it's their last game in here. I know how it goes.\"\nONE FINAL SELLOUT CROWD\nSellouts have been commonplace throughout the years for the Kings. The building opened in 1988 and had sellouts in 780 of 1,122 games. The Kings had 26 sellouts this season, the most since 2006-07, when all 41 games were at full capacity.\nTIP INS\nThunder: Durant is on track to become the first player since Michael Jordan (1988-89) to average 28 points, eight rebounds and five assists. ... Westbrook had eight of Oklahoma City's 21 turnovers, leading to 26 points. ... The Thunder have two games left and end the regular season Tuesday in San Antonio.\nKings: Playing like his more famous older brother Stephen, Curry made his first five 3-point attempts before missing midway through the second quarter. ... NBA assists leader Rajon Rondo was rested for the third time in four games. ... The Kings haven't made the playoffs since Adelman was fired after the 2005-06 season. Adelman guided the Kings to a winning record in his eight seasons and the team hasn't had a winning record since.\nUP NEXT\nThunder: Host Lakers on Monday.\nKings: At Phoenix on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994118.043943
}