{
  "game_id": "0022300833",
  "espn_id": "401585461",
  "date": "Feb 27, 2024",
  "matchup": "ORL vs. BKN",
  "headline": "Franz Wagner scores 21 points to lead Magic in 108-81 win over Nets",
  "body": "ORLANDO, Fla. -- — The Orlando Magic didn't have their best player, but they did have the memory of two one-sided losses to the Brooklyn Nets to serve them Tuesday night.\n\n\r\n              Franz Wagner scored 17 of his 21 points in the first half and the Magic, playing without All-Star forward Paolo Banchero, rolled to a 108-81 win.\n\n\r\n              “I thought it was an important game for us, knowing how the last two games went against them,” said Wagner. “I was pretty happy with how everybody came out focused for the whole game.”\n\n\r\n              Banchero, Orlando’s leading scorer, missed his second straight game with an illness after playing in the team’s first 57 games.\n\n\r\n              Moritz Wagner had 16 points and five rebounds, and Markelle Fultz and Cole Anthony added 12 points each for Orlando, which had lost by 20 and 28 points at Brooklyn early this season.\n\n\r\n              Dennis Schroder led the Nets with 15 points in his third start with the team. Trendon Watford had 14 points and seven rebounds.\n\n\r\n              Brooklyn forward Mikal Bridges, playing in his 450th consecutive game, was held to four points, his lowest scoring output of the season. Bridges, who has never missed a game in his five NBA seasons, did not score in the first half and shot 2 for 14 for the game, missing all seven of his 3-point shots.\n\n\r\n              “I feel like when I'm open I'm going to take threes,” Bridges said. “They all feel good. It's just not going in. I'll continue to take what the defense gives me and stay aggressive. The only way to get out of a slump is to keep shooting.”\n\n\r\n              Losing for the fifth time in six games, the Nets shot 39.2% and finished with 22 turnovers.\n\n\r\n              Brooklyn coach Kevin Ollie did not see much advantage in getting to face the Magic without Banchero.\n\n\r\n              “They’re all missed opportunities when you lose one,” Ollie said. “These are NBA players. They’re pros. They've got a great team over there without Paolo and ... we just expect guys to step up. Unfortunately we didn't step up enough tonight to get a win.”\n\n\r\n              The Nets played without guards Cam Thomas (sprained ankle) and Ben Simmons (lower back) in the second game of a back-to-back.\n\n\r\n              It was the fourth win in five games for the Magic, who opened a 17-game stretch in which they will play 13 home games while chasing their first playoff berth in four years.\n\n\r\n              Wendell Carter Jr. and Jalen Suggs scored twice each early in the third quarter on a 10-2 run that quickly stretched Orlando's 14-point halftime lead to 27.\n\n\r\n              “You could feel our energy the whole games,” Franz Wagner said. “We've had a couple games already this season where we kind of let it slip in that third (quarter), so it was great the way we came out at halftime.”\n\n\r\n              The rest of the game was played by the benches.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Visit Atlanta on Thursday night.\n\n\r\n              Magic: Host Utah on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995691.392235
}