{
  "game_id": "0022401114",
  "espn_id": "401705680",
  "date": "Apr 03, 2025",
  "matchup": "MEM @ MIA",
  "headline": "Morant beats the buzzer for a game-winner, lifts Grizzlies past Heat 110-108",
  "body": "MIAMI -- — Ja Morant made a 12-foot jumper in the lane as time expired, lifting the Memphis Grizzlies to a 110-108 win over the Miami Heat on Thursday night and giving interim coach Tuomas Iisalo his first victory with the team.\n\n\r\n              Morant finished with 30 points for Memphis, which snapped a four-game slide. Desmond Bane had 17 points and 10 rebounds, Scotty Pippen Jr. added 17 while Jaylen Wells and Jaren Jackson Jr. scored 13 apiece for the Grizzlies.\n\n\r\n              Tyler Herro scored 35 points for Miami, which had its six-game winning streak snapped. Bam Adebayo had 26 points and Kel’el Ware finished with 13 points and 15 rebounds for the Heat — who were the third team in NBA history to lose at least 10 in a row, then immediately follow that with six straight wins.\n\n\r\n              The Heat became locked into the play-in tournament when Milwaukee beat Philadelphia earlier Thursday. It's the third consecutive play-in berth for the Heat, who went from there to the NBA Finals in 2023 and reached the playoffs before falling to Boston last year.\n\n\r\n              Takeaways\r\n              Grizzlies: Morant had 11 of his 30 in the fourth for Memphis, which desperately needed a win to revive its hopes of a top-six seed.\n\n\r\n              Heat: It was the fourth time this season that Adebayo and Herro combined to score at least 59 points in a game. Miami, oddly, is 0-4 in those contests.\n\n\r\n              Key moment\r\n              The Grizzlies got caught in a mismatch with about 50 seconds left, with Morant caught in a switch and forced to guard Adebayo near the foul line. But Adebayo's shot over Morant was short, and Memphis kept a two-point lead.\n\n\r\n              Key stat\r\n              Neither team had a double-digit lead in the game.\n\n\r\n              Up next\r\n              Both teams play Saturday, with Memphis visiting Detroit and Miami hosting Milwaukee.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997717.1178172
}