{
  "game_id": "0021200012",
  "espn_id": "400277732",
  "date": "Oct 31, 2012",
  "matchup": "POR vs. LAL",
  "headline": "Lakers fall to Trail Blazers as Steve Nash exits with injury",
  "body": "PORTLAND, Ore. --  This was not the start the Los Angeles Lakers envisioned.\n\nThe talent-laden Lakers have dropped two straight to open the season -- their opener at home against the Dallas Mavericks followed by a 116-106 thumping by the Portland Trail Blazers on Wednesday night.\n\nTo make matters worse, two-time MVP Steve Nash, brought in by the Lakers in the offseason along with six-time All-Star Dwight Howard, was injured late in the first half against Portland.\n\n\n\n\"We've got to learn how to play together,\" said Howard, who had 33 points and 14 rebounds in the loss to Portland. \"You've got to be good before you can be great.\"\n\nThe Lakers' stockpile of stars lacked a sense of urgency against the Blazers, who led by as many as 19 points. Nicolas Batum had 26 points and Damian Lillard, the sixth overall pick in the June draft, had 22 points and 11 assists in his NBA debut.\n\n\nKobe Bryant had 30 points and Howard's output Wednesday night was a vast improvement over his debut the night before against the Mavs, when he had 19 points and 10 rebounds but made just three of 14 free throws before fouling out. The Lakers lost that one 99-91.\n\nBut it was apparent for the second night in a row that the Lakers were still getting used to each other. The starters rarely played together during an 0-8 preseason.\n\n\"We didn't expect to just come together and be awesome,\" Howard said. \"It's always a process. We've got to stick with it so that at the end of the year we can have a trophy.\"\n\nNash collided with Lillard and limped to the locker room. Although the team initially reported he was fine, Nash struggled when he returned for the second half and left the game for good a short time later.\n\nThe team said he had a bruised left leg. He said after the game he hopes to play Friday when the Lakers host the Clippers.\n\n\"We're not sharp,\" Nash said. \"I think the guys are trying, we just didn't live up to what we're trying to do.\"\n\nThe Blazers, who finished 28-38 last season and out of the playoffs, opened their season with eight newcomers on the roster after an offseason rebuilding effort around All-Star LaMarcus Aldridge, Wesley Matthews and Batum.\n\n\"People probably didn't expect us to come out and beat that type of team, but we've been competing very hard in practice, and we did that same thing tonight,\" Lillard said. \"We were flying around, lots of energy. I think our activity kind of wore on them.\"\n\nPortland pulled out to a 30-26 lead late in the first quarter after Matthews' 3-pointer. Lillard extended the lead to 35-26 with a running bank shot in traffic.\n\nJ.J. Hickson's jumper made it 41-34 for Portland, but Bryant answered for the Lakers with a 3-pointer. Batum's fast-break jam gave the Blazers a 46-40 lead and Portland went into halftime with a 62-57 lead.\n\nPortland took its momentum into the second half, going up 72-64 on another dunk by Batum. Sasha Pavlovic's 3-pointer gave the Blazers an 88-76 lead just before Howard was called for his fourth foul.\n\nMatthews' jumper made it 102-83 in the fourth quarter. Batum had a 3-pointer to make it 108-94 as the game slipped out of reach for the Lakers.\n\nBatum's opener comes after an uncertain offseason as a restricted free agent. The Blazers got into a poker match with the Timberwolves over the 23-year-old Frenchman, eventually matching Minnesota's four-year offer sheet worth more than $45 million.\n\nBatum, like the rest of the Blazers, was trying to keep the victory low-key.\n\n\"This was just one game, just one game,\" he said. \"It was a really good win, but we've got to focus on the next game on the road.\"\n\nPortland visits Oklahoma City on Friday night.\n\nThe Blazers wore new red uniforms for the opener and encouraged fans to wear red, but the crowd was nonetheless sprinkled with plenty of Lakers gold. Among them was a fan that lifted a sign reading, \"I love Steve Nash.\"\n\n\"The morale is fine, but nobody wants to lose,\" Lakers coach Mike Brown said. \"We've just got to focus on what it will take for us to get a win. That's defense, first, and then, obviously, we've got to take care of the basketball.\"\n\nGame notes The Blazers declined team options for next season on guards Elliott Williams and Nolan Smith, and forward Luke Babbitt, to maintain salary cap flexibility. All three will become unrestricted free agents at the end of the season, but the Blazers will retain their Bird rights. ... Portland added 10 players to the roster of the team's NBA D-League affiliate, the Idaho Stampede, including training camp participants Coby Karl, Justin Holiday and Dallas Lauderdale.",
  "source": "espn_api",
  "crawled_at": 1764993527.326634
}