{
  "game_id": "0021900706",
  "espn_id": "401161348",
  "date": "Jan 28, 2020",
  "matchup": "PHX @ DAL",
  "headline": "Booker, Ayton lead Suns to 133-104 blowout of Mavericks",
  "body": "DALLAS --  All Devin Booker can do now is wait for the announcement of All-Star reserves.\n\nThe last impression for the Phoenix guard was a good one.\n\nBooker scored 20 of his 32 points in a decisive third quarter, Deandre Ayton had a season-high 31 points and the Suns never trailed in a 133-104 dismantling of the Dallas Mavericks on Tuesday night.\n\nEighth in the NBA in scoring, Booker is tied for fourth with Portland's Damian Lillard with 20 games of at least 30 points. They trail three All-Star starters in James Harden, Giannis Antetokounmpo and Trae Young. The reserves will be announced Thursday.\n\n\"It's exciting just to be in this situation,\" said Booker, who was 7 of 9 from the field in the third and 12 of 20 for the game. \"Every time I go out on the floor, I try to represent Phoenix, represent my last name in the best way possible and I think making All-Star would amplify that and give something that this city's been waiting on for a long time.\"\n\nBooker started the scoring in the third quarter before the ball had even been thrown in, making a free throw after the last of three first-half technicals against Dallas was called against Tim Hardaway Jr. after the halftime buzzer.\n\nWith the head start from Booker, the Suns outscored the Mavericks 48-22 in the third on their way to surpassing last season's win total of 19 with their fourth victory in the past five road games.\n\nIt was the most points in a quarter for Phoenix since 1990, and the most the playoff-contending Mavericks have given up in any quarter in franchise history.\n\n\"This team has done so many things to get people excited about it and really worked hard to get into a solid position at this point in time,\" coach Rick Carlisle said. \"A performance like this is just tough. Nights like this do happen, but this was extreme.\"\n\nAyton, the 2018 No. 1 overall pick who has been overshadowed during his two seasons by Dallas sensation and third overall choice Luka Doncic, was 13 of 15 from the field as the Suns shot a season-high 59%. Ayton made all five of his free throws and had a game-high nine rebounds.\n\nDoncic, an All-Star starter, scored 21 points with six rebounds and just two assists before leaving the game for good with the Mavericks trailing by 36 with 8:05 remaining. He was the only starter in double figures for Dallas, which was just 7 of 33 from 3-point range.\n\nDoncic and Carlisle drew techs in the first quarter before Hardaway was called for one on his way off the floor not long after he was called for an offensive foul that Carlisle unsuccessfully challenged.\n\nBooker's free throw started an 8-0 run to open the second half and give Phoenix a double-digit lead for good after Dallas had trimmed a 13-point deficit in the first half to five (60-55) at the break.\n\nNow the Suns go home for the first time since the shocking death of former Los Angeles Lakers star Kobe Bryant in a helicopter crash Sunday.\n\n\"It's been hard and it will be hard going forward, but I was just proud of the way our guys made plays for each other,\" coach Monty Williams said. \"I don't think anybody expected us to come in here and win the game.\"\n\nTIP-INS\n\nSuns: Booker, who had nine assists and six rebounds, became the fourth-youngest player (23 years, 90 days) to score 7,000 points, after LeBron James, Kevin Durant and Carmelo Anthony. ... Kelly Oubre Jr. scored 19 points and six rebounds. ... Phoenix's previous high for a quarter was 43 in the first quarter of a 121-110 win at Golden State on Oct. 30.\n\nMavericks: Kristaps Porzingis played the second night of a back-to-back for the first time since returning from a 10-game absence with a sore right knee. The 7-foot-3 forward had nine points and three rebounds in 20 minutes. ... G Ryan Broekhoff played for the first time since breaking his left fibula at the Lakers on Dec. 29.\n\nKOBE TRIBUTES\n\nThe Mavericks honored Bryant in a ceremony before their first home game since the crash that also killed his 13-year-old daughter Gianna and seven others outside Los Angeles.\n\nHighlights of Bryant's career and some of his interactions with the Mavericks, including retired star Dirk Nowitzki, were shown on the video boards during a moment of silence. Nowitzki was courtside with owner Mark Cuban.\n\nDallas' plan to retire the No. 24 in Bryant's honor was announced to cheers, and the teams repeated the tribute Dallas and Oklahoma City displayed a night earlier. The Mavericks took an 8-second backcourt violation to honor Bryant's other number, followed by a 24-second shot clock violation by the Suns.\n\nDALLAS DEBUT\n\nWillie Cauley-Stein made his Dallas debut after coming over in a trade with Golden State, getting four points and three rebounds in 12 minutes, most of them coming with the outcome decided in the fourth quarter.\n\nUP NEXT\n\nSuns: Oklahoma City on Friday in a home game that splits a pair of three-game road trips. The Suns have lost seven straight to the Thunder.\n\nMavericks: At Houston on Friday. Dallas won the opener of the season series at the Rockets in November.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996552.821669
}