{
  "game_id": "0022000846",
  "espn_id": "401307642",
  "date": "Apr 16, 2021",
  "matchup": "LAC @ PHI",
  "headline": "Embiid, 76ers snap Clippers' 7-game winning streak",
  "body": "PHILADELPHIA -- — Joel Embiid had 36 points and 14 rebounds and the Philadelphia 76ers beat the Clippers 106-103 on Friday night, snapping Los Angeles’ seven-game winning streak.\n\n\r\n                    Furkan Korkmaz added 18 points and Ben Simmons had 12 points and nine rebounds for the Eastern Conference-leading Sixers, who have won four in a row.\n\n\r\n                    “I don’t think teams really know what to do when guarding him,” Simmons said of Embiid. “I think he’s clearly the MVP this season. He’s been so dominant. I don’t know how to stop him.”\n\n\r\n                    Paul George had 37 points and nine rebounds for the Clippers, who last lost on April 1. Patrick Patterson added a season-high 18 points and Marcus Morris scored 15 for Los Angeles.\n\n\r\n                    Kawhi Leonard missed his fourth straight game for the Clippers with a sore right foot.\n\n\r\n                    “I thought we did a good job,” Clippers coach Tyronn Lue said. “Overall, I like the way we fought and competed.”\n\n\r\n                    It was the second straight game in which the Sixers beat one of the league’s marquee teams without its stars. Philadelphia got past Brooklyn 123-117 on Wednesday night in a matchup between the East’s top two teams with James Harden and Kevin Durant sidelined.\n\n\r\n                    Patterson hit his fifth 3-pointer to give the Clippers their first lead, 91-90, with 7:14 left in the fourth. Morris’ 18-foot jumper put the Clippers ahead 94-92 with just under five minutes to play, but Los Angeles committed turnovers on four of its next five possessions and Philadelphia scored seven straight to go up 99-94.\n\n\r\n                    Korkmaz’s three-point play made it 104-98 with 47.7 seconds left, but Reggie Jackson’s corner 3 with 20.5 seconds left made it 104-103.\n\n\r\n                    Danny Green hit a pair of free throws and Morris missed a tying 3-point attempt with 5.8 seconds left.\n\n\r\n                    “I liked our intensity,” Philadelphia coach Doc Rivers said. “We played really hard.”\n\n\r\n                    Philadelphia raced out to a 20-3 lead and leveraged that into a 59-47 halftime advantage. Embiid had 15 points and nine rebounds at the break. George got hot in the third, scoring 15 points to help the Clippers pull within 81-77 to start the fourth. Los Angeles hit six 3-pointers in the period.\n\n\r\n                    SHARP SHOOTING\n\n\r\n                    Embiid faced double-teams throughout the night, and the Clippers were forced to foul often when the 76ers big man got the ball near the basket. He made 16 of 18 free throws\n\n\r\n                    “He demands so much attention,” Patterson said. “He’s such a dominant force down low.”\n\n\r\n                    FEELING BETTER\n\n\r\n                    George said he spent the previous 48 hours in bed with chills and feeling sick. He felt much better once out on the court.\n\n\r\n                    “When I started playing, it washed away,” he said. “I would say I was more tired than anything.”\n\n\r\n                    D-D-D DE-FENSE!\n\n\r\n                    Simmons put his defensive skills on display in the first half, making a long dash to block Patterson’s 3-point attempt with 4:53 left in the second quarter. He ended with two steals and a pair of blocks, and Embiid believes his teammate should earn the league’s Defensive Player of the Year award.\n\n\r\n                    “This year he’s been a monster,” Embiid said. “He deserves it.”\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Lue said Leonard is progressing but the club is being cautious. ... Los Angeles fell to 17-11 on the road. ... LA beat the 76ers 122-112 at home on March 27. ... Leonard is 15-1 against the 76ers in the regular season.\n\n\r\n                    76ers: Dwight Howard (left knee soreness), Tobias Harris (right knee soreness) and Seth Curry (left hip flexor tightness) didn’t play. ... Philly improved to 22-5 at home. ... Rivers went 356-208 in the previous seven seasons as Clippers coach. ... Rivers said there isn’t a timetable for George Hill’s return, but the coach is optimistic it could be sometime next week. Hill, acquired at the trade deadline, has been out since Jan. 24 with a thumb injury. ... Embiid has 12 games with 30 or more points and 10 or more rebounds.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Host Minnesota Sunday night.\n\n\r\n                    76ers: Host Golden State on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997668.0636811
}