{
  "game_id": "0022400436",
  "espn_id": "401705002",
  "date": "Dec 29, 2024",
  "matchup": "ORL vs. BKN",
  "headline": "Anthony hits winning layup with 1.3 seconds left, Magic complete 21-point rally to beat Nets 102-101",
  "body": "ORLANDO, Fla. -- — \n\n\r\n              Cole Anthony drove for a layup with 1.3 seconds left to complete the Orlando Magic's 17-point fourth-quarter comeback Sunday in a 102-101 win over the Brooklyn Nets.\n\n\r\n              Cam Thomas missed a jumper from the corner at the final horn.\n\n\r\n              Anthony scored 10, and Tristan da Silva scored 13 of his 21 points in the fourth quarter for Orlando, which was down 71-50 midway through the third quarter. Goga Bitadze added 19 points, 11 rebounds and five assists.\n\n\r\n              The Magic's comeback was their second in eight days after Orlando rallied from 25 points down to beat Miami 121-114 on Dec. 21.\n\n\r\n              Thomas came off the bench with 25 points to lead the Nets in his first game since Nov. 25. Jalen Wilson added 16 points including two free throws with 6.2 seconds left.\n\n\r\n              Thomas, Brooklyn's leading scorer with 24.7 points per game, played 25 minutes after missing 13 games with a strained left hamstring.\n\n\r\n              Takeaways\r\n              Nets: Losing for the seventh time in nine games, the Nets played for the first time without Dorian Finney-Smith, who was traded early Sunday to the Los Angeles Lakers. In their four games against the Magic this season, the Nets used 11 different starters. Only Cam Johnson started all four games.\n\n\r\n              Magic: The Magic completed a four-game season series sweep of the Nets and concluded a 3-4 holiday home stretch. They overcame double-digit second-half deficits in all three of their wins against Miami, Boston and Brooklyn.\n\n\r\n              Key moment\r\n              A 3-pointer by Anthony, who did not play in the first half, launched a 13-0 Orlando run after they had fallen behind by 20 points.\n\n\r\n              Key stat\r\n              The Nets shot 13 for 30 from 3-point range.\n\n\r\n              Up next\r\n              The Nets are at Toronto and the Magic are at Detroit on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997555.057742
}