{
  "game_id": "0021500589",
  "espn_id": "400828476",
  "date": "Jan 14, 2016",
  "matchup": "DET @ MEM",
  "headline": "Chalmers' leaner lifts Grizzlies over Pistons 103-101",
  "body": "MEMPHIS, Tenn. --  For the second time this season, the Memphis Grizzlies ripped away a victory from the Detroit Pistons.\n\nMario Chalmers scored 25 points, including a leaning 19-foot jumper with less than a second left to give the Grizzlies a 103-101 victory over Detroit on Thursday night.\n\nChalmers' basket with 0.8 seconds remaining meant the Pistons lost both games to Memphis this season on a late shot. Matt Barnes' heave from halfcourt with 1.1 seconds left gave the Grizzlies a 93-92 victory on Dec. 9.\n\n\"Certainly, a crazy finish to a good game,\" Memphis coach Dave Joerger said after his team's latest nail-biter.\n\nChalmers was fouled on the play and missed the ensuing free throw. It was unclear whether the shot grazed the front of the rim, and the clock ran out with players scrambling for the rebound.\n\n\"That's very tough,\" Pistons coach Stan Van Gundy said. \"We just couldn't finish. Couldn't get stops.\"\n\nMarc Gasol had 19 points for Memphis and Barnes scored 18, hitting all six of his 3-pointers. Jeff Green finished with 16.\n\nRookie forward Stanley Johnson led the Pistons with 19 points, and Ersan Ilyasova scored 17. Reggie Jackson and Marcus Morris had 12 points apiece, and Andre Drummond added 11 points and 11 rebounds.\n\nWith the game tied at 101, Memphis got a steal credited to Barnes with about 8 seconds left.\n\nChalmers brought the ball up the right side and cut to the middle of the floor, but appeared to be stripped of the ball outside the arc. In the ensuing scramble, Chalmers gathered the ball, gathered himself and leaned forward from the top of the key as Pistons reserve Aron Baynes dove for the ball, sliding under Chalmers' feet.\n\nChalmers said he was thinking, \"Where's the ball? I've got to get to the ball.\"\n\n\"I was able to get to it,\" he said, \"get a shot up and it went in.\"\n\nAnd when it did, that sent Detroit to its second straight loss.\n\nMemphis held a 13-point lead early in the fourth, but suddenly started missing one shot after another. The Pistons rattled off a 23-2 run, and the Grizzlies' only basket in that span came on a goaltending call.\n\nThe rally gave Detroit its largest lead at 96-88 with 5:42 left. Johnson had a trio of 3-pointers in the fourth, including one with just more than 3 minutes left for a 101-96 Pistons lead.\n\nDetroit didn't score again and Chalmers carried the Grizzlies, scoring his team's final seven points to hand the Pistons another heartbreaking loss against Memphis.\n\n\"(Barnes') halfcourt shot, and that play right there, we had mistakes prior to that,\" Johnson said. \"You can't focus on that play.\"\n\nTIP-INS\n\nPistons: Drummond had his NBA-best 33rd double-double. ... Detroit is 18-4 when scoring at least 97 points. ... The Pistons outrebounded Memphis 35-29. Detroit is 19-8 when it outrebounds its opponent.\n\nGrizzlies: The Pistons' 15 3-pointers marked the 20th time this season Memphis has allowed an opponent to make at least 10. ... Memphis has won 12 of the last 13 in the series and seven straight at home. The last Pistons road win in the series was the 2009-10 season opener. ... Zach Randolph was in the starting lineup after coming off the bench in 16 of the last 17 games. He had 13 points.\n\nGREEN TO THE BENCH\n\nJeff Green moved to the bench after 30 straight starts. He did not play in the second half of the Grizzlies' previous game against Houston. \"I can't fault (Joerger) for that,\" Green said. \"I wasn't at my best. Today it was a new day, new game. I just came out and played aggressive.\"\n\nROUND 2\n\nThe Grizzlies play the Knicks on Saturday, the first matchup since an off-the-court altercation between Barnes and New York coach Derek Fisher that led to a two-game suspension for the Grizzlies forward. Asked about Saturday's anticipated meeting, Barnes replied: \"I know I've got to keep my mouth shut because (Fisher) will run and tell.\"\n\nUP NEXT\n\nPistons: Host the Golden State Warriors on Saturday.\n\nGrizzlies: Host the New York Knicks on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994924.864801
}