{
  "game_id": "0022200899",
  "espn_id": "401469054",
  "date": "Feb 24, 2023",
  "matchup": "PHX vs. OKC",
  "headline": "Devin Booker scores 25 points, Suns beat Thunder 124-115",
  "body": "PHOENIX -- — The Phoenix Suns are still looking forward to the debut of recently acquired superstar Kevin Durant.\n\n\r\n              While they wait, Devin Booker isn't a bad backup plan.\n\n\r\n              Booker scored 25 points, Chris Paul added 16 and the Phoenix Suns beat the Oklahoma City Thunder 124-115 on Friday night.\n\n\r\n              Booker's had his own injury problems this season, missing chunks of time with hamstring and groin issues. He got back on the floor a few weeks ago and looks back to his old high-scoring self.\n\n\r\n              “I feel great,” Booker said. “I'm trying to get wind all the way back. Games like this are important for that. When you have injuries to the lower half of your body, you can't really condition.”\n\n\r\n              Surging Phoenix has won 12 of 16.\n\n\r\n              Terrence Ross made a 3-pointer at the third quarter buzzer to put the Suns up 94-87. Phoenix led the rest of the way and Booker’s 3-pointer with two minutes left gave the Suns an 11-point lead.\n\n\r\n              It also gave the three-time All-Star 1,052 career 3-pointers, which broke Steve Nash's franchise record.\n\n\r\n              Isaiah Joe led Oklahoma City with a career-high 28 points. The third-year guard shot 11 of 17, including 6 of 12 from 3-point range. Jalen Williams added 22 points.\n\n\r\n              “Teammates were finding me, I was in the right position, knocking down shots,” Joe said. \n\n\r\n              The Suns are still awaiting the debut of Durant, who was dealt to the desert by the Brooklyn Nets just before the trade deadline. Durant is recovering from a sprained MCL in his right knee but is expected to return soon.\n\n\r\n              The Thunder also were without a key piece — All-Star guard Shai Gilgeous-Alexander missed the game with right ankle soreness.\n\n\r\n              “I thought our offense kept us in the game tonight,” Thunder coach Mark Daigneault said. “We had a hard time getting a handle in them defensively. They did a really good job attacking.”\n\n\r\n              Even without Durant, the Suns showed impressive depth. Josh Okogie scored 15 points, Deandre Ayton added 14 points and 11 rebounds and Cam Payne scored 14 points off the bench in his return from a foot injury.\n\n\r\n              “He brought a level of juice tonight that we needed,” Suns coach Monty Williams said. “The shot making, the quick attacking to the paint and then defensively, I thought he was a pest.”\n\n\r\n              Okogie scored 15 points as the Suns took a 65-60 halftime lead. Joe had 21 points for the Thunder before the break on 8-of-11 shooting, going 5 of 8 from 3-point range.\n\n\r\n              DURANT CLOSE\n\n\r\n              Durant appears close to making his Suns debut.\n\n\r\n              The 13-time All-Star played in a scrimmage on Thursday at the team's facility and Williams said the veteran's body responded well. He was also working out on the court before Friday's game.\n\n\r\n              Durant was dealt to the Suns two weeks ago in a blockbuster deal that sent Mikal Bridges, Cam Johnson, Jae Crowder and four first-round picks back to the Nets.\n\n\r\n              WAINRIGHT SIGNS DEAL\n\n\r\n              Forward Ish Wainright signed a multi-year contract before the game.\n\n\r\n              The backup has emerged as a useful piece in the Suns rotation this season, averaging 4.3 points and 2.1 rebounds per game. The muscular 6-foot-5, 235-pounder played basketball and a year of football in college at Baylor.\n\n\r\n              Wainright had 10 points against the Thunder.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: F Dario Saric returned to Phoenix for the first time since he was traded to Oklahoma City. He was a key part of the rotation when the Suns made the Finals in 2021. The Suns honored Saric with a highlight montage during a timeout in the first quarter.\n\n\r\n              Suns: Payne was available for just the third time since mid-December. He's been battling a foot injury. The backup point guard hit his first 3-pointer of the night, earning a big roar from the home crowd. ... G Landry Shamet (right foot soreness) was not available. ... Hosted a 57th straight sellout crowd.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Sacramento on Sunday.\n\n\r\n              Suns: At to Milwaukee on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995069.133139
}