{
  "game_id": "0022400634",
  "espn_id": "401705200",
  "date": "Jan 25, 2025",
  "matchup": "MIN vs. DEN",
  "headline": "Edwards scores 34, sets Timberwolves career 3-pointer record in 133-104 win over Denver",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 34 points and became the Minnesota Timberwolves' career leader in 3-pointers in a 133-104 victory over the Denver Nuggets 133-104 on Saturday.\n\n\r\n              Edwards made 14 of 23 shots from the floor and scored 23 points in the second half as Minnesota pulled away after leading by 11 at halftime.\n\n\r\n              Julius Randle had 21 points, while Rudy Gobert had 14 points and 14 rebounds for the Timberwolves, who won their second straight.\n\n\r\n              Jamal Murray led the Nuggets with 25 points. Nikola Jokic added 20 points and 11 assists for Denver, which had won won four straight and eight of its last nine. Jokic grabbed just three rebounds, ending his streak of five straight triple-doubles.\n\n\r\n              Minnesota led from wire to wire, scoring a season-high 40 points in the first quarter when it shot 69.2% (18 for 26) from the field.\n\n\r\n              Takeaways\r\n              Nuggets: Denver had won six straight on the road and its 14-8 road record was the third-best in the Western Conference. Saturday's defeat began a five-game road swing.\n\n\r\n              Timberwolves: Minnesota made a season-high 53 field goals and its 55.8% shooting from the field was the team's second-best mark of the year.\n\n\r\n              Key moment\r\n              With the Timberwolves leading 91-77 midway through the third quarter, Edwards missed a 3-pointer from the wing, but Gobert came down with the rebound. Naz Reid then missed a short hook shot, but Gobert tipped the rebound to an open spot on the court and then ran it down. The ball eventually made it back to Edwards, who drained a 3 to give Minnesota its largest lead of the game at 17 points.\n\n\r\n              Key stat\r\n              Edwards' third 3-pointer was No. 976 of his career, passing Karl-Anthony Towns for the most career 3-pointers in Timberwolves history.\n\n\r\n              Up next\r\n              Both teams are back in action on Monday, with the Nuggets visiting Chicago and the Timberwolves hosting Atlanta. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998088.718671
}