{
  "game_id": "401809997",
  "espn_id": "401809997",
  "date": "Nov 01, 2025",
  "matchup": "MIL vs SAC",
  "headline": "LaVine, DeRozan lead Kings past Bucks 135-133",
  "body": "MILWAUKEE -- — Zach LaVine had 31 points, DeMar DeRozan scored 29, and the Sacramento Kings turned back a late rally to hold on for a 135-133 victory over the Milwaukee Bucks on Saturday.\n\n\r\n              The Bucks, who trailed 108-102 entering the final period, pulled within 133-132 on Miles Turner’s 3-pointer from the right corner with 51 seconds remaining.\n\n\r\n              DeRozan missed a pullup jumper on the Kings next possession, but the Bucks failed to capitalize when Giannis Antetokounmpo turned it over with a poor pass with 19 seconds left.\n\n\r\n              Dennis Schroder hit two free throws with 14.8 seconds left to put the Kings up 135-132. A.J. Green missed a 3-pointer on the Bucks' next possession. Green hit the first of two free throws with 1.1 seconds left, but the Bucks could not control the rebound.\n\n\r\n              Russell Westbrook scored on a put back to put the Kings up 126-118, but Antetokounmpo scored the Bucks' next 11 points, cutting the lead to 131-129 with a breakaway dunk.\n\n\r\n              Domantas Sabonis had 24 points and 13 rebounds and Schroder had 24 points for the Kings.\n\n\r\n              Antetokounmpo, who did not play in the Bucks 120-110 win over Golden State on Thursday with left knee soreness, had 26 points, 11 rebounds and eight assists in 32 minutes.\n\n\r\n              Sacramento, which trailed by 15 early, outscored the Bucks 38-31 in the third quarter.\n\n\r\n              The Kings trailed 47-36 after one quarter but pulled even at 70-all on consecutive 3-pointers by Schroder and Levine. Gary Trent Jr. hit the second of two free throws to put the Bucks up 71-70 at the half.\n\n\r\n              The Bucks hit seven of their first eight shots, including 4 of 5 beyond the arc, for an early 21-6 lead.\n\n\r\n              Up next\r\n              Kings: Visit the Denver Nuggets on Monday night.\n\n\r\n              Bucks: Visit the Indiana Pacers on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042538.9767091
}