{
  "game_id": "0022400470",
  "espn_id": "401705036",
  "date": "Jan 03, 2025",
  "matchup": "ORL @ TOR",
  "headline": "Da Silva scores career-high 25 points, Magic overcome loss of Suggs to beat Raptors 106-97",
  "body": "TORONTO -- — Tristan da Silva scored a career-high 25 points and the Orlando Magic overcame the loss of guard Jalen Suggs to back spasms to beat the struggling Toronto Raptors 106-97 on Friday night.\n\n\r\n              Goga Bitadze had 11 points and 13 rebounds and Kentavious Caldwell-Pope scored 15 points to help the Magic win for the fourth time in 10. Orlando's Cole Anthony matched a career high with 11 assists.\n\n\r\n              Orlando came in as the NBA’s worst shooting team from 3-point range, but made 9 of 14 from distance in the first quarter, tying the franchise record for 3s in a quarter.\n\n\r\n              Suggs was playing defense late in the second when he stumbled without any contact and fell over clutching at his lower back. He stayed down for several minutes before being helped into a wheelchair. The fourth-year guard covered his face with a towel as he was wheeled off.\n\n\r\n              Jakob Poeltl scored 25 points for the Raptors. Scottie Barnes added 20, and Immanuel Quickley had 11 points and 11 assists.\n\n\r\n              Takeaways\r\n              Magic: Orlando made nine 3-pointers in the third quarter against San Antonio on Feb. 8, 2024. They also had nine in the third against the Lakers on Jan. 31, 2018.\n\n\r\n              Raptors: Toronto snapped an 11-game losing streak by beating Brooklyn on Wednesday but couldn’t maintain any momentum. The Raptors haven’t won consecutive games since home victories over Miami and Indiana on Dec. 1 and 3. They’ve only won back-to-back games twice this season.\n\n\r\n              Key moment\r\n              Four Magic players connected from deep in a 14-4 run late in the first that gave Orlando a lead it would never relinquish.\n\n\r\n              Key stat\r\n              Orlando shot 19 for 44 from 3-point range, improving to 18-6 this season when making 10 or more from distance. The Magic are 3-9 when they make nine or fewer 3s.\n\n\r\n              Up next\r\n              Orlando hosts Utah on Sunday night. Toronto hosts Milwaukee on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997552.2937012
}