{
  "game_id": "0022200152",
  "espn_id": "401468307",
  "date": "Nov 07, 2022",
  "matchup": "MEM vs. BOS",
  "headline": "Tatum's 39 points help Celtics hold on to beat Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Jayson Tatum scored 39 points, including a pair of free throws with 2.2 seconds left, and the Boston Celtics held on for a 109-106 victory over the Memphis Grizzlies on Monday night.\n\n\r\n              The Grizzlies inbounded the ball after Tatum’s free throws, but Ja Morant slipped in the backcourt and never got off a shot to tie the game against a team that tried to make it tough for him defensively.\n\n\r\n              “That’s really our identity,” Tatum said. “We’re shooting the ball well for the most part, but the thing that helped us get to the championship last year was defending Brooklyn, defending Miami and Milwaukee and things like that. Defense is going to get us ultimately to where we want to get to.”\n\n\r\n              Morant finished with 30 points, nine assists and eight rebounds. Desmond Bane had 19 points for Memphis.\n\n\r\n              “I thought our guys kept battling and kept it really close and didn’t let it get away from us,” said Memphis coach Taylor Jenkins, whose team trailed by as many as 14 points. “We had our chances at the end. Credit the Celtics for making plays.”\n\n\r\n              Jaylen Brown had 21 points and nine rebounds but made only one of his six 3-pointers for the Celtics, who were 12 of 37 from outside the arc. Al Horford and Marcus Smart had 15 points apiece, with Smart handing out 12 assists.\n\n\r\n              Memphis had rallied to take the lead entering the fourth quarter, but a 10-0 Boston rally in the middle stages of the period broke open a 90-90 tie and Boston went on to its third straight win.\n\n\r\n              But just barely, as Memphis tried to close the gap before falling short.\n\n\r\n              In a spirited first quarter, both teams shot well as the bickering about calls led to technicals for Morant and Tatum in the period. But the Celtics had an 18-0 run in the second and a 37-20 advantage in the frame. The Boston lead would reach 14 and the Celtics led by 11 at the break.\n\n\r\n              Tatum had 19 of his 25 first-half points in the period.\n\n\r\n              “We weren’t in our defensive presence,” Morant said. “We weren’t moving or playing Grizzlies basketball. Felt like it was that simple.” \n\n\r\n              The third quarter turned into a shootout featuring Morant and Horford, who hit his first four shots in the quarter, including a pair of 3-pointers. Meanwhile, Morant made all but one of his six shots, scored 14 points in the frame.\n\n\r\n              A 3-pointer by John Konchar (12 points) in the closing seconds allowed Memphis to carry an 85-84 lead into the final frame. \n\n\r\n              “You see how quickly the switch flipped when we actually did what we were supposed to do on the defensive end,” Morant said.\n\n\r\n              The key through most of the night was a switching Boston defense, which saw multiple players guarding Morant, who was 10 of 24 from the field, including 5 of 12 from outside the arc.\n\n\r\n              TIP-INS: \n\n\r\n              Celtics: The game was Boston’s first against the Western Conference this season. … Reserve F Luke Kornet was not with the team for personal reasons. Coach Joe Mazzulla said he expects the 7-foot-2 Kornet to return to the team Wednesday. … Smart’s 12 assists were one short of his career high set last season against Utah.\n\n\r\n              Grizzlies: Morant made five 3-pointers to pass Vince Carter for 12th on the franchise’s career list. … C Steven Adams was out with a right ankle soreness. He suffered the injury in Sunday’s win over Washington. Brandon Clarke started at center for Memphis. … The loss was the first at home for Memphis this season. \n\n\r\n              UP NEXT: \n\n\r\n              Celtics: Host Detroit on Wednesday\n\n\r\n              Grizzlies: At San Antonio on Wednesday to face the Spurs.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994236.7597811
}