{
  "game_id": "0021900329",
  "espn_id": "401160971",
  "date": "Dec 06, 2019",
  "matchup": "LAL @ POR",
  "headline": "Anthony Davis has 39 and Lakers rout the Blazers 136-113.",
  "body": "PORTLAND, Ore. --  While Anthony Davis may have been feeling a bit under the weather recently, it certainly didn't show against Portland.\n\nDavis scored 39 points and the Los Angeles Lakers routed the Blazers 136-113 on Friday night.\n\n“You see what he did on this road trip being sick? And he’s starting to feel a lot better and I don’t quite like it. I might sneeze on him a couple of times,\" said teammate LeBron James, who added 31 points.\n\nIt was the 11th straight road win for the Lakers, who have lost just three games overall this season and sit atop the Western Conference standings.\n\nThe game was costly for Portland. Starting forward Rodney Hood was injured in the first quarter and the team later announced that he had torn his left Achilles tendon.\n\n“You've just got to keep going forward. We've got a season to play, and as disappointing as it is to lose players to injuries, we have a team, and we've got to keep competing and playing. You don't have any other choice,\" Blazers coach Terry Stotts said.\n\nStotts was ejected late in the third quarter after angrily protesting a foul call that earned him a double technical. It was the first time that Stotts has been tossed from a game as an NBA coach.\n\nDamian Lillard, who helped pull Stotts back from the confrontation with referee Leon Wood, finished with 29 points. Portland trailed by as many as 27 in the fourth quarter.\n\nIt was the first meeting of the season between friends James and Carmelo Anthony. The two shared a quick hug on the court just before tipoff.\n\nAnthony scored 15 points after the Trail Blazers guaranteed the 10-time All-Star's contract for the the rest of the season earlier Friday.\n\nPortland (9-14) got off to a slow start this season but had won four of its last five games, including Wednesday night's 127-116 victory over the Sacramento Kings.\n\nThe Lakers (20-3) were coming off a 121-96 rout of the Jazz in Salt Lake City on Wednesday. Davis had 26 points in that one.\n\n“We have our mind set on something special. In order to reach that goal we have to stay in the moment and go game by game,” Davis said. “We take every game personal. We want to go out there and be the best team.\"\n\nAnthony followed up a layup and a free throw with a 3-pointer to pull the Blazers ahead 18-17 midway through the first quarter. The Lakers led 39-34 after the period, led by Davis with 15 points.\n\nRajon Rondo hit back-to-back 3 pointers to kick off a 15-0 run. Davis had 25 points at the half and the Lakers led 77-62.\n\nA pair of free throws from CJ McCollum pulled Portland within 13 points in the third quarter, but the Blazers were never able to close to within single digits.\n\nDavis' dunk extended the lead to 101-81.\n\nLillard got the team together before the start of the fourth quarter.\n\n“I just told them we're up against it. We're playing against a good team, we haven't had a great night, we're not getting anything, you know no calls for us, nothing is going in our favor, not getting the benefit of the doubt in those situations,\" Lillard said. “So we're just going to have to get more aggressive. We're getting called for every touch anyway, so we might as well get physical, get aggressive and live with whatever happens, give ourselves a chance.”\n\nIt was the first of three meetings between the teams this season.\n\nTIP-INS\n\nLakers: Rondo did not return to the game after halftime because of hamstring soreness. ... Los Angeles became the second NBA team to reach 20 wins this season, joining Milwaukee. ... James also had seven rebounds and eight assists before heading to the bench late in the final quarter. ... The team's 136 points were a season high.\n\nTrail Blazers: Hood left the game late in the first quarter after injuring his left leg. He was helped off the court and did not return. ... The Lakers' 77 first-half points were the most the Blazers had allowed in the half this season. ... Hassan Whiteside had 17 points and 10 rebounds for his 13th double-double of the season.\n\nFEELING MELO\n\nJames was asked after the game about how he felt playing against his old friend.\n\n“I can’t even lie, it’s always special to be on the floor with a brother of mine. We got so much history, you know we’ve competed against each other since 2001 when it all started. In Colorado Springs, at the Junior Olympics. ... It’s always great to compete. It’s great to be on the same floor period. No matter if we are teammates or competing on our respective clubs,” James said.\n\nDISAPPOINTMENT\n\nThe Blazers locker room was somber after the game, not so much because of the loss, but because of the loss of Hood. Portland has been hit by difficult injuries this season. The team also lost forward Zach Collins to a shoulder injury.\n\n\"You hate to see one of your teammates go down to an injury like that, especially a starter, and somebody who is really a good person and having a great season, fitting in really well with our team, and a big part of what we do. You just feel for him personally more than anything,\" Lillard said.\n\nUP NEXT\n\nThe Lakers host the Minnesota Timberwolves on Sunday.\n\nThe Trail Blazers continue a four-game homestand on Sunday, hosting Oklahoma City.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996021.0457668
}