{
  "game_id": "0021500146",
  "espn_id": "400828033",
  "date": "Nov 15, 2015",
  "matchup": "MEM @ MIN",
  "headline": "Conley, Green lead Grizzlies over Timberwolves 114-106",
  "body": "MINNEAPOLIS --  Even with the NBA's worst shooting percentage, Mike Conley and the Memphis Grizzlies kept their faith in the team's ability to make shots.\n\nA visit to Minnesota supplied the boost Memphis needed.\n\nJeff Green scored a season-high 21 points, and Conley matched his season-high with 20 to go with six assists and the Grizzlies held on to beat the Timberwolves 114-106 on Sunday.\n\nSix players scored in double figures for Memphis, which won its second straight after losing four in a row. Marc Gasol had 14 points and seven rebounds for the Grizzlies, who shot a season-high 56.3 percent from the field.\n\n\"We know we're shooters,\" Conley said. \"We've been in this league a long time and we've made our names with what we do, so we just have to stay aggressive, stay confident and tonight we finally saw some go in.\"\n\nMemphis entered play last in the NBA in field goal percentage (40.1), with their season-best a 50.0-percent mark at Indiana on Oct. 29. Conley was one of the struggling shooters. In the two previous games, he had shot 5 of 25 and scored 15 total points.\n\nConley's 3-pointer with about 5 minutes left to play snapped an 89-all tie. He scored six points in the fourth quarter and Green added 11 in the final period to allow Memphis to finally pull away.\n\nGreen shot 7 of 12 for the game while Conley was 7 of 14 and hit 4 of his 6 3-point attempts. As a team, the Grizzlies shot 9 of 17 from 3-point range.\n\n\"We got to worry about our defense,\" Minnesota interim head coach Sam Mitchell said. \"We rebounded enough. We had turnovers, bad turnovers at the wrong time of the game, but overall we didn't turn the ball over a lot. We just got to play better defense.\"\n\nZach Lavine scored 25 points to lead Minnesota, which is 0-5 at home this season. Andrew Wiggins added 21 points for the Timberwolves, who dropped their fourth straight overall.\n\nEven with Wiggins, who has scored at least 20 points in four of his past five games, and the immediate contributions from rookie Karl-Anthony Towns, Minnesota is off to its worst start at home since 1994 when it lost its first 10 home games.\n\nTIP-INS:\n\nGrizzlies: Green replaced Courtney Lee in the starting lineup, with Tony Allen moving to shooting guard and matching up with Wiggins. Lee had started every game this season but had been held to single digits in scoring in each of the previous four games. ... Memphis has won 19 of the past 23 games against Minnesota and 10 of the past 12 at Target Center.\n\nTimberwolves: Ricky Rubio missed his fourth straight game with a strained left hamstring, all losses for Minnesota. Mitchell wouldn't reveal a timeframe or any other details about Rubio's progress. Rubio played in just 22 games last season because of an ankle injury. ... Minnesota played the French National Anthem before the game as a tribute to the lives lost in the terrorist attacks in Paris.\n\nANOTHER MILESTONE\n\nKevin Garnett became the fifth player in NBA history to play at least 50,000 minutes. Garnett joined Kareem Abdul-Jabbar, Karl Malone, Jason Kidd and Elvin Hayes. Garnett played a season-high 23:54 on Sunday with eight points, five rebounds and four assists. He's fourth all-time in minutes played.\n\nCOMBO CHALMERS\n\nMario Chalmers played his second game with Memphis after being acquired on Nov. 10 from the Miami Heat, playing 18 minutes with 16 points and four assists. Grizzlies coach Dave Joerger said Chalmers role will continue to expand, as well.\n\nJoerger said Chalmers, the seven-year veteran point guard, could join Conley on the court together once Chalmers gets more acclimated.\n\n\"Long arms, good athlete, defender and he does a good job of getting after people with ball pressure defensively,\" Joerger said of Chalmers. \"He's a good shooter, stand still. Has a real moxie about him and the way he plays in pick-and-roll, just takes his time to find guys like a quarterback would.\"\n\nUP NEXT:\n\nGrizzlies: Host Oklahoma City on Monday.\n\nTimberwolves: Visit Miami on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994476.9956968
}