{
  "game_id": "0022400933",
  "espn_id": "401705499",
  "date": "Mar 10, 2025",
  "matchup": "CHI vs. IND",
  "headline": "Josh Giddey scores season-high 29 points before injuring ankle and Bulls beat Pacers 121-103",
  "body": "CHICAGO -- — Josh Giddey had a season-high 29 points along with 10 rebounds before leaving midway through the fourth quarter with a right ankle injury, and the Chicago Bulls won their third straight game, 121-103 over the Indiana Pacers on Monday night.\n\n\r\n              Coby White also scored 29 points for the Bulls, who hold the final play-in spot in the Eastern Conference.\n\n\r\n              Myles Turner scored 15 points to lead the Pacers, who have lost three straight — all of them with point guard Tyrese Haliburton sidelined by a hip issue.\n\n\r\n              Chicago held Indiana to 39.6% shooting from the field and 10 of 40 (25%) from 3-point range.\n\n\r\n              Takeaways\r\n              Pacers: With Haliburton sidelined, and big game at home Tuesday night, coach Rick Carlisle limited the minutes for his starters after halftime with his team down big. Indiana is fifth in the East and next plays Milwaukee, the team directly ahead of it in the standings.\n\n\r\n              Bulls: The Bulls avoided a series sweep against Indiana, which had won the previous three games by an average margin of more than 13 points. \n\n\r\n              Key moment\r\n              The game was tied at 27 before the Bulls had a 40-point outburst in the second quarter to take a 67-48 lead. Chicago led by double digits the rest of the way.\n\n\r\n              Key stat\r\n              Nikola Vucevic had 11 points and 11 rebounds for his 195th career double-double, moving past Horace Grant for the third most in Bulls history, trailing only Artis Gilmore and Scottie Pippen. \n\n\r\n              Up next\r\n              Indiana is home against Milwaukee on Tuesday night. The Bulls are home against Brooklyn on Thursday night. \n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997040.073929
}