{
  "game_id": "0021700651",
  "espn_id": "400975397",
  "date": "Jan 16, 2018",
  "matchup": "DAL @ DEN",
  "headline": "Jokic's big night helps Nuggets hold off Mavericks 105-102",
  "body": "DENVER --  Michael Malone wasn't all that thrilled about the lack of composure in the final quarter. Or all the turnovers. Or the shot selection. Or even the defense.\n\nStill, he won't quibble with the outcome.\n\n\"We survived,\" Denver's coach said.\n\nNikola Jokic scored 29 points and grabbed a season-high 18 rebounds, Gary Harris hit two late free throws and the Nuggets held off the Dallas Mavericks 105-102 on Tuesday night after nearly blowing a 23-point lead.\n\n\"We lost focus in the fourth quarter and we gave them a chance to come back in the game,\" Jokic said. \"That was bad.\"\n\nThe Nuggets led 82-59 with 4:04 left in the third before Dallas staged a massive comeback. The Mavericks cut the deficit to one on a three-point play by Dennis Smith Jr. with 10.4 seconds remaining. After Harris made two free throws, the Mavericks had a chance for a last-second shot, but Dwight Powell couldn't corral a long pass as the buzzer sounded.\n\n\"We never give up,\" Mavericks coach Rick Carlisle said. \"There are some things to build on here.\"\n\nSo, what exactly changed in the fourth?\n\n\"I don't know. I'll have to go back and watch film to figure it out,\" said Smith, who finished with 25 points.\n\nThe Nuggets unraveled during a fourth quarter in which they were outscored 33-19. They turned the ball over several times, leading to 10 points, hit just 3 of 7 free throws and allowed Dallas to drain three 3-pointers.\n\n\"I thought we looked like a poorly coached team in that fourth quarter,\" Malone said. \"I take that very personally. We all have to be better down the stretch. If that game is 10 seconds longer, we probably lose.\n\n\"But I'm not going to say it's a complete waste -- we got a win. I'm proud of our guys for having enough fortitude down the stretch to get the win.\"\n\nHarris finished with 25 points and Will Barton added 22 for the Nuggets, who won for just the second time in six games.\n\nTrying to address the issue of slow starts, Malone tweaked the starting lineup by inserting Barton and sending Mason Plumlee to the bench. The change worked as Denver led at halftime. That's significant because it halted a streak of seven straight games in which the Nuggets trailed at intermission.\n\nDenver made protecting the paint a point of emphasis in this contest. When the Mavericks beat the Nuggets 122-105 on Dec. 4, they dominated points in the paint with 64. That figure comes with a caveat -- Jokic was sidelined with an ankle sprain.\n\nThis time, Dallas had 42.\n\nHarris and Jokic combined to score Denver's opening 22 points, before Plumlee got in the scoring act with a free throw late in the first quarter.\n\nTIP-INS\n\nMavericks: J.J. Barea sat out with a strained groin. ... F Harrison Barnes contributed 17 points, while reserve Devin Harris had 16.\n\nNuggets: The team had two buzzer-beaters -- Barton on a 3-pointer to end the first quarter and Jokic with a tip-in to close out the second. ... Jokic had seven assists.\n\nINJURY UPDATE\n\nCarlisle said it's looking like at least February until Dorian Finney-Smith (left knee), Nerlens Noel (left thumb) and Seth Curry (left tibia) return.\n\n\"Right now Nerlens is on track to be on the floor before any of them,\" Carlisle said. \"If all goes well it's very possible he could be back playing in the first week of February.\"\n\nYOUTH IS SERVED\n\nA reason for Denver's disparity between its home record (16-5) and road mark (7-16) is plain, old youth.\n\n\"It's our reality. Jamal (Murray) is 20. That's not an excuse, he's 20 years old,\" Malone said. \"We have a lot of young players and we have to help them get through these tough times.\"\n\nSPORADIC JOKIC\n\nMalone isn't worried about Jokic's up-and-down performances. All part of his learning curve.\n\n\"This is his third year in the NBA. He was a second-round pick. Now all of a sudden people want him to be Superman,\" Malone said. \"Very few players in NBA history come in their first, second and third year and put a franchise on their back. What you love about Nikola is he doesn't shy from it.\"\n\nUP NEXT\n\nMavericks: At the Trail Blazers on Saturday.\n\nCavaliers: Travel to the Los Angeles Clippers on Wednesday.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993950.193388
}