{
  "game_id": "0021600523",
  "espn_id": "400899425",
  "date": "Jan 03, 2017",
  "matchup": "DET vs. IND",
  "headline": "George scores 32 as Pacers beat Pistons 121-116",
  "body": "AUBURN HILLS, Mich. --  In a season when most teams are struggling to pull away from the pack in the Eastern Conference, beating a rival on the road is a major accomplishment.\n\nThe Indiana Pacers, one of the NBA's worst clubs away from home, have done that twice to the Detroit Pistons.\n\nPaul George had 32 points and the Pacers beat the Pistons 121-116 on Tuesday night.\n\n\"We have a lot of firepower in our lineup, both our starters and our backups,\" George said. \"The way we have things now, with Monta (Ellis) in the second group, we've got the best of both worlds in both lineups.\"\n\nIndiana also won 105-90 at the Palace of Auburn Hills on Dec. 17. The teams play twice more in Indiana.\n\n\"It's huge to come in here and win for the second time this season,\" Pacers guard Jeff Teague said. \"Things are so crazy and so tight in the Eastern Conference that winning a game like this on the road is huge.\n\n\"Paul was the biggest part of it. He's just a great, great player and we let him go.\"\n\nMyles Turner and Teague each scored 17 for Indiana, which blew a 15-point first-half lead but pulled away in the fourth quarter to win its third straight game. The Pacers (18-18) are 2 1/2 games ahead of Detroit (16-21) in the East standings.\n\nTobias Harris led the Pistons with 22 points. Andre Drummond and Reggie Jackson each had a double-double.\n\nDetroit lost for the eighth time in 10 games, with two of the defeats coming at home to Indiana. George averaged 29 points in the two games.\n\n\"He's one guy that we've never been able to stop in the last couple years,\" Pistons coach Stan Van Gundy said. \"Other guys have big games against us, but we slow them down at times. We never have an answer for Paul.\"\n\nThe Pacers hit six of seven 3-pointers in the first quarter to score a season-high 36 points and take an eight-point lead. The margin was 15 in the second before the Pistons rallied late to pull to 66-60.\n\n\"We were just standing there and watching, hoping someone would miss,\" Van Gundy said. \"We weren't willing to make the effort needed to close out on anyone.\"\n\nGeorge and Teague each had 14 points in Indiana's highest-scoring half of the season. The Pacers shot 59 percent from the floor, 88 percent on 3-pointers and 93 percent from the foul line.\n\nDetroit also shot well, hitting 57 percent of its shots, but couldn't keep up despite 13 points from Jackson.\n\n\"It is like we only play defense when we are down,\" Jackson said. \"We wait until we're back into a corner to apply any pressure, so we're always playing from behind.\"\n\nJackson's jumper early in the third cut the lead to 73-72 and prompted a timeout by Indiana coach Nate McMillan. Jackson's alley-oop to Drummond tied the game at 77, and it was 92-all going into the fourth.\n\n\"They got hot and started knocking down a lot of shots,\" McMillan said. \"We were able to keep ourselves in the game and finally get some stops.\"\n\nIndiana's offense got going again early in the fourth, and the Pacers built a 103-96 lead with seven minutes to play. George's three-point play with 3:28 left made it 114-104, and Detroit couldn't get enough stops to threaten until the final minute.\n\nMarcus Morris' two 3-pointers pulled Detroit to 119-114 with 50.3 seconds left and, after a turnover, Drummond's putback made it a three-point game. Ellis made two free throws before Morris and Jackson missed at the other end.\n\n\"Our starters didn't guard anyone, and neither did our bench,\" Van Gundy said. \"I've got to figure out who to play and when to play them, but they aren't making it easy on us.\"\n\nTIP-INS\n\nPacers: The win was Indiana's fifth of the season on the road, and it snapped a three-game losing streak away from Indianapolis. The Pacers are 2-0 at the Palace this season, and 3-13 in other road games.\n\nPistons: With Aron Baynes sidelined by an ankle injury, Detroit went with little-used Boban Marjanovic as Drummond's backup. Marjanovic matched up mostly with Al Jefferson, who always gives Drummond problems.\n\nSTATISTICAL ODDITY\n\nEight of the game's 10 starters finished with negative plus/minus ratings. Thaddeus Young and Kentavious Caldwell-Pope were each plus-3. Ellis was plus-15 off the Indiana bench.\n\nHISTORIC RIVALRY\n\nAs part of their last season at the Palace of Auburn Hills, the Pistons spent much of the night honoring great moments from their rivalry with Indiana. The list was heavily populated by their postseason battles in the mid-2000s, with No. 1 being Tayshaun Prince's chase-down block of Reggie Miller in the 2004 Eastern Conference finals. Not a surprise: The most memorable Pistons-Pacers moment, the melee involving Ron Artest and fans in November 2004, was not included.\n\nUP NEXT\n\nPacers: Host the Brooklyn Nets on Thursday.\n\nPistons: Host the Charlotte Hornets on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764996061.40627
}