{
  "game_id": "0022201036",
  "espn_id": "401469191",
  "date": "Mar 15, 2023",
  "matchup": "MIA vs. MEM",
  "headline": "Heat get rare easy win, roll past Grizzlies 138-119",
  "body": "MIAMI -- — For the first time in nearly two months, the Miami Heat got an easy one.\n\n\r\n              Bam Adebayo scored 26 points, Tyler Herro added 24 and the Heat shot 59.8% — a season best, by far — on the way to topping the Memphis Grizzlies 138-119 on Wednesday night.\n\n\r\n              “We put together 48 minutes of Miami Heat basketball — getting stops, running in transition and sharing the ball,” Adebayo said.\n\n\r\n              Jimmy Butler scored 23 points, Max Strus had 12, Caleb Martin finished with 11 and Kevin Love and Gabe Vincent each had 10 for the Heat.\n\n\r\n              Miami set a season high for points, and it was only the sixth time — in 38 wins — that the Heat prevailed by more than 10 points. Before Wednesday, Miami's most recent double-digit win was Jan. 18 at New Orleans, a 124-98 romp. And the Heat hadn't shot better than 54.5% in any game this season.\n\n\r\n              “We just haven't had many of these this year,” Heat coach Erik Spoelstra said.\n\n\r\n              Jaren Jackson Jr. scored 25 for Memphis, which got 14 from Luke Kennard, 12 from Ziaire Williams and 11 apiece from Desmond Bane and Tyus Jones.\n\n\r\n              “Credit to the Heat,” Memphis coach Taylor Jenkins said. “They played great tonight. They had an answer for everything we had. I thought our guys gave a great effort tonight. The Heat were just on a different level.”\n\n\r\n              The Heat (38-33) moved within two games of idle Brooklyn (37-30) for the No. 6 spot — and final guaranteed playoff berth — in the Eastern Conference. They ended the third quarter on a 14-0 run, their third-best run of unanswered points all season, and turned a 14-point lead into a 105-77 blowout going into the final 12 minutes.\n\n\r\n              Memphis (41-27) is now tied for second in the Western Conference with Sacramento, which won in Chicago.\n\n\r\n              It was the sixth game that Memphis has played without Ja Morant, who was given an eight-game suspension by NBA Commissioner Adam Silver earlier Wednesday as the penalty for “conduct detrimental to the league” — in this case, the All-Star guard “holding a firearm in an intoxicated state while visiting a Denver area nightclub” and live-streaming it on March 4.\n\n\r\n              The Grizzlies fell to 3-3 in Morant’s absence, but Jenkins said his team is learning plenty by having to use different lineups down the stretch — both because of the All-Star’s suspension and other injury issues.\n\n\r\n              “I’ve always known the togetherness of our team and the competitiveness of our team,” Jenkins said. “Obviously guys are assuming different roles. We haven’t had that come to light over the course of the season until this recent stretch. ... There’s so many things that we’ve seen over the last couple weeks that are going to benefit us moving forward.”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Bane was ejected with 6:44 left in the third quarter after being called for a Flagrant-2 for striking Love just below the waist. ... Memphis’ starters were outscored by Miami’s starters 15-0 from the foul line in the first half. ... The Grizzlies have 14 games left — eight at home, six on the road. ... Kenneth Lofton Jr. scored 10 for Memphis.\n\n\r\n              Heat: Miami’s 28-point lead was its second biggest of the season; the Heat led by 30 at New Orleans on Jan. 18. ... This game ended a run where Miami had eight of nine at home; the Heat now play seven of their final 11 on the road. ... Cody Zeller (broken nose) missed his second straight game. When he plays again — the Heat aren't sure if he'll be ready Saturday at Chicago — it'll be with a mask that he used for the same injury last season.\n\n\r\n              JA VS. MIAMI\n\n\r\n              This was the third consecutive Miami-Memphis game that Morant missed. He didn’t play in the Grizzlies’ 101-93 win on Dec. 5 because of left ankle soreness, and sat out a 105-90 win at Miami on Dec. 6, 2021 with a sprained left knee. Morant’s last game against the Heat was Oct. 30, 2021, a 129-103 Miami win.\n\n\r\n              The Heat are the only team (other than the Grizzlies, obviously) that Morant has never scored more than 20 points against.\n\n\r\n              WELCOME, JALEN\n\n\r\n              Newly acquired Miami Dolphins safety Jalen Ramsey was at the game, along with Dolphins cornerback Xavien Howard. They got Heat jerseys as gifts.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit San Antonio on Friday.\n\n\r\n              Heat: Visit Chicago on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993922.4985301
}