{
  "game_id": "0021701223",
  "espn_id": "400975969",
  "date": "Apr 11, 2018",
  "matchup": "MIL @ PHI",
  "headline": "76ers win 16th straight, earn 3 seed in romp over Bucks",
  "body": "PHILADELPHIA -- Joel Embiid grabbed a loose ball and hustled toward midcourt, feigning like he would dunk.\nEmbiid's gold sneakers and peach-colored jacket -- and a red, white and blue basketball -- were a giveaway that he was again in street clothes. With or without Embiid, the 76ers are streaking into the postseason as the hottest team in the NBA.\nEmbiid and JJ Redick watched from the bench, Ben Simmons had a scoreless first half and the Philadelphia 76ers still won their 16th consecutive game, thumping the Milwaukee Bucks 130-95 Wednesday night to clinch the No. 3 seed in the Eastern Conference.\nThe 52-win Sixers will open the Eastern Conference playoffs against the sixth-seeded Miami Heat. No. 7 Milwaukee will meet No. 2 Boston.\nMarkelle Fultz, the No. 1 pick of the 2017 draft who missed 68 games with a shoulder injury, became the youngest player in NBA history (19 years, 317 days) with a triple-double with 13 points, 10 assists and 10 rebounds.\n\"It was just a matter of going out there and enjoying myself and playing confident,\" Fultz said.\nHis teammates doused Fultz with strawberry milk, chocolate milk and water in celebration of the record feat.\n\"It's all love and appreciation,\" he said.\nFultz should have hit up Embiid and borrowed something to protect his face.\nEmbiid wore a black mask during warmups to protect his broken bone around his left eye, then changed into his garish outfit to watch the Sixers romp to a stunning 80-44 lead at the break.\nEmbiid said he will likely miss at least Game 1 of the playoffs this weekend because of the injury.\nThe 76ers have done just fine without him.\nRedick was a late scratch with lower back tightness and Simmons, who finished with four points, missed both shots in the first half. No problem. The Sixers hit 11 3s in the first half and could have celebrated the No. 3 seed at halftime.\nThe Sixers had to win to earn the three spot and they dominated a Bucks team that was fighting for seeding in the playoffs. At one point, the Sixers led 72-37 -- at the same time the Flyers were down 7-0 to the Pittsburgh Penguins in the NHL playoffs.\nEmbiid, who entertained the crowd during timeouts, hasn't played since March 28 when he suffered a broken bone around his left eye in a collision with Fultz. The Sixers clearly need their big man if they're going to make a run in the Eastern Conference playoffs. Embiid leads the team with 22.9 points and 11 rebounds in 63 games, helping Philly clinch its first playoff berth since 2012.\n\"I want to play but right now I feel like I'm not ready yet,\" Embiid said. \"It's getting there. I've got to keep working every day. With the way it's been progressing, I'm hopeful I'll be back soon.\"\nHe said the eye was still swollen, though he doesn't suffer from blurred vision.\nEven those with 20/20 vision needed a second look at the scoreboard to make sure the numbers were real.\nThe Sixers in the first half\n- shot 59 percent from the floor (31 of 53).\n- shot 46 percent on 3s (11 of 24).\n- had 22 assists, eight steals, three blocks.\n- led by 41, 70-29.\nWith the Sixers up 39, fans started chanting \"Trust the Process! Trust the Process!\"\nThe much-maligned -- now sure to duplicated -- \"process\" method that saw the Sixers strip the roster of talent to guarantee losing and stockpile draft picks has been a winner. Embiid, Simmons and Fultz all played crucial roles in leading the Sixers (52-30) to their best record since the 2001 Eastern Conference champs went 56-26.\n\"It's not something that I deem to be, here we are, we've arrived, significant-type status,\" coach Brett Brown said. \"It's not that. I want them to enjoy it. Take a deep breath. Then reload.\"\nTIP-INS\nBucks: Jabari Parker scored 25 and Giannis Antetokounmpo had 10 points and 10 rebounds.\n\"Right from the start, there were problems,\" Bucks coach Joe Punty said. \"I can rant and rave right now but I don't think that's the important thing. It was clear we didn't play very well.\"\n76ers: The NBA rule says players must wear a clear mask but Embiid and the Sixers could petition the league for a change. ... Embiid said he deserved to win NBA defensive player of the year, Simmons should be rookie of the year and Brown for coach of the year. ... Justin Anderson led the Sixers with 25 points and Dario Saric had 24.\nUP NEXT\nThe Sixers and Bucks both have two days off before the NBA playoffs open.\n---\nFor more AP NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992975.929348
}