{
  "game_id": "0022301043",
  "espn_id": "401585671",
  "date": "Mar 25, 2024",
  "matchup": "LAC vs. IND",
  "headline": "Pascal Siakam helps Pacers pull away from Clippers for 133-116 win",
  "body": "LOS ANGELES -- — Pascal Siakam scored 31 points to lead the Indiana Pacers to a 133-116 win over the Los Angeles Clippers on Monday night.\n\n\r\n              Myles Turner had 24 points and seven rebounds, helping the Pacers to their sixth win in their last seven road games. Tyrese Haliburton finished with 21 points and nine assists.\n\n\r\n              “Our entire roster played well,” Pacers head coach Rick Carlisle said. “I thought Myles Turner was spectacular in this game. ... Tyrese and Pascal were ham and egging it back and forth, and that was really key.” \n\n\r\n              Los Angeles dropped its fifth consecutive home game. Kawhi Leonard and Paul George each scored 26 points for the Clippers, and Russell Westbrook had 14 points and seven assists in his return after missing 12 games because of a fractured left hand.\n\n\r\n              “The only way we're gonna get out of it is playing hard for 48 minutes, doing things right every single night, every single possession,” Clippers head coach Ty Lue said. “Not two out of five, not two out of six. Every time, just do the right thing, and you'll be able to get out of this rut.” \n\n\r\n              Having been walloped 151-127 at home by the Clippers in December, a defeat Carlisle credited with forcing Indiana to put a more consistent emphasis on its defense, the Pacers were determined to rebound after losing 150-145 to the Lakers on Sunday. They clamped down and held the Clippers to 1 for 9 on 3-pointers in the second half, while going 8 for 15 from deep themselves to pull away.\n\n\r\n              “We've shown signs of real progress,” Carlisle said. “Last night was a step back, but in the NBA there's always another game coming. This was a terrific bounce back.” \n\n\r\n              In addition to strong showings from their stars, Indiana also got unexpected contributions from Ben Sheppard, who had seven points starting in place of Aaron Nesmith (knee), and rookie forward Jarace Walker, who had eight points and was “the key guy in the game” according to Carlisle. \n\n\r\n              “He just played exceptionally well,” Carlisle said of Walker. “He made open shots, he made the right pass at the right time, he defended, he rebounded, and he was the biggest plus we had on the team tonight, so congratulations to him.”\n\n\r\n              Unable to bounce back from a 121-107 loss to Philadelphia on Sunday, the reeling Clippers found themselves asking some tough questions in the aftermath of another loss to a playoff-bound opponent. James Harden, who had 11 points, couldn't say who the team is right now.\n\n\r\n              Lue disagreed. \n\n\r\n              “Right now, do we have an identity?\" Lue said. \"I think, yeah, we're soft. That can be an identity if you want to call it that. We got to be tougher, mentally and physically.”\n\n\r\n              The return of Westbrook was the lone bright spot for Los Angeles, providing some noticeable energy off the bench with six points and four assists in the first half. He also helped Norman Powell produce some microwave offense, getting eight of his 22 points in the first quarter.\n\n\r\n              “I thought Russ looked good,” Lue said. “I thought he had some pop. I thought he pushed the pace. It's something for us to build on going forward.” \n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Chicago on Wednesday.\n\n\r\n              Clippers: At Philadelphia on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996537.606072
}