{
  "game_id": "0021700274",
  "espn_id": "400975025",
  "date": "Nov 24, 2017",
  "matchup": "MEM @ DEN",
  "headline": "Nikola Jokic scores 28 points, Nuggets beat Grizzlies 104-92",
  "body": "DENVER -- Nikola Jokic scored 14 of his 28 points in the fourth quarter and had 13 rebounds and eight assists to help the Denver Nuggets beat the Memphis Grizzlies 104-92 on Friday night.\nGary Harris and Jamal Murray added 15 points apiece, and Kenneth Faried had 14. The Nuggets won their fifth straight at home.\nJaMychal Green had 21 points for the Grizzlies in their seventh loss in a row. It's the longest losing streak for the Grizzlies since a seven-game skid from Nov. 1-11, 2009. It also was Memphis' first loss in its last five games in Denver.\nMarc Gasol and Tyreke Evans scored 15 points apiece for the Grizzlies.\nTrailing by 16 at the half, the Grizzlies put together an 11-0 run capped by Dillon Brooks' driving reverse layup to pull to 74-69 and outscored Denver 5-2 over the last 90 seconds of the third quarter to get within two points.\nJokic scored three consecutive baskets to start the fourth to help the Nuggets regain some separation. His jumper off a feed from Harris put Denver up 88-79 with 6:31 remaining.\nJokic and Juan Hernangomez each connected from 3-point range over the next 1 1-2 minutes and just like that Denver was leading 95-81.\nMemphis fought back to 97-89 on a 3-pointer by Mario Chalmers but the Nuggets closed the door in the last 1:38, getting a three-point play from Jokic and a put-back dunk by Faried to fend off the Grizzlies.\nDenver opened a 61-45 lead at halftime, getting nine-point quarters in the first from Murray and the second from Jokic to help etablish a double-digit advantage.\nTIP-INS\nGrizzlies: A left Achilles' tendon injury has forced Mike Conley to miss a fifth consecutive game. No o fficial word yet on when he's expected to return. ... Friday's contest marked David Fizdale's 100th career game as the Grizzlies' head coach. He is 140-50 since being hired ahead of the 2016-17 season.\nNuggets: Team doctors have discovered ligament damage in F Paul Milsap's left wrist and he will be sidelined indefinitely. The team has not indicated whether he will need surgery. Initially, Milsap's injury was announced as a sprain. He was injured in a loss last Sunday at the Los Angeles Lakers.\nUP NEXT\nGrzzlies: Return home to host Brooklyn on Sunday night.\nNuggets: Get a three-day stretch between games before playing at Utah on Tuesday night.\n---\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992793.1268969
}