{
  "game_id": "0021600322",
  "espn_id": "400899764",
  "date": "Dec 07, 2016",
  "matchup": "ORL vs. BOS",
  "headline": "Bradley, Celtics roll to 117-87 victory over Magic",
  "body": "ORLANDO, Fla. --  Avery Bradley and the Boston Celtics made up for Isaiah Thomas' absence by spreading the ball around.\n\nBradley scored 23 points, Jae Crowder had 15 points and 10 rebounds and the Celtics routed the Orlando Magic 117-87 on Wednesday night.\n\nBoston shot 51.2 percent from the field and had seven players score in double figures, bouncing back nicely from a disappointing 107-106 loss at Houston on Monday night. Terry Rozier scored a career-high 16 points, and Amir Johnson, Jaylen Brown and Marcus Smart finished with 13 apiece.\n\nIt was an impressive offensive performance while playing without Thomas, who was held out after he suffered a groin injury against the Rockets. Boston (13-9) trailed by one at the break, but grabbed control with a big third quarter and pulled away in the final period.\n\n\"Whenever we have somebody down we come together and try to figure out a game plan,\" Bradley said. \"And our game plan was to get it done on the defensive end and make sure we are moving the ball on the offensive end.\"\n\nOrlando shot 37 percent from the field. D.J. Augustin scored 15 points -- all the first half -- and Evan Fournier had 14.\n\nThe Magic were coming off a 4-1 road trip, including a 124-116 victory against Washington on Tuesday night.\n\n\"We've just got to play better,\" coach Frank Vogel said. \"The second game of back to back can't be an excuse. Every other team plays in these situations. If we're going to be a playoff team, we've got to win these games.\"\n\nThe Magic (10-13) came out cold in the third quarter and the Celtics took advantage. Bradley made a 3-pointer and Crowder connected on a jumper to help Boston open a 67-54 lead with 6:22 left.\n\nThe Celtics outscored the Magic 58-26 in points in the paint.\n\n\"Like I've said before, we're always trying to attack the paint first,\" Celtics coach Brad Stevens said. \"One of the things we want to do, especially in Isaiah's absence is play through our bigs and through the post.\"\n\nTIP-INS\n\nCeltics: Smart replaced Thomas in the starting lineup. ... Bradley had three of Boston's seven 3-pointers. The Celtics went 7 for 27 from long range. ... Boston enjoyed a 49-37 rebounding advantage.\n\nMagic: Since returning to the bench, Jeff Green's production has improved immensely. The veteran small forward averaged 14 points in the team's recent road trip. ... The Magic had just one blocked shot, highly unusual for a team with Serge Ibaka and Bismack Biyombo.\n\nGRUELING STRETCH\n\nThe Magic struggled with the back-to-back games, and they have another set this weekend when they visit Charlotte on Friday night and then host Denver on Saturday night.\n\n\"It's going to be a challenge,\" Fournier said. \"The last 10 days have been a challenge physically, but that's the NBA.\"\n\nUP NEXT\n\nCeltics: Host Toronto on Friday night.\n\nMagic: Visit Charlotte on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995868.5373042
}