{
  "game_id": "0022200276",
  "espn_id": "401468431",
  "date": "Nov 25, 2022",
  "matchup": "BKN @ IND",
  "headline": "Pacers have 4 players with 20-plus points, beat Nets 128-117",
  "body": "INDIANAPOLIS -- — Buddy Hield scored 26 points to lead four Indiana players with 20 or more, and the Pacers beat the Brooklyn Nets 128-117 on Friday night.\n\n\r\n              “He's unafraid,” Pacers coach Rick Carlisle said. “He puts the ball in the basket. You have to choose to look at things that guys do well.”\n\n\r\n              Myles Turner added 23 points, Tyrese Haliburton had 21 and Bennedict Mathurin finished with 20 for the Pacers. Halburton also had 15 assists.\n\n\r\n              Kevin Durant scored 36 points, including 20 in the fourth quarter for the Nets. Ben Simmons made all eight shots and scored 20 before fouling out in the final minute. Kyrie Irving also had 20.\n\n\r\n              Mathurin, who scored 16 points in the fourth quarter, sank a 3-pointer from the corner to give the Pacers a 99-96 lead, their first since the middle of the first quarter. The Pacers expanded the lead to 108-98 with a 3-pointer by Hield with 6:43 left in the fourth quarter.\n\n\r\n              Brooklyn closed the deficit to 110-107 when Durant sank a 3-pointer, was fouled and converted the four-point play. But Indiana pulled away again. \n\n\r\n              Nic Claxton, who had 12 points and 11 rebounds for the Nets, was called for a flagrant foul for shoving Haliburton, who had to be restrained from going after Claxton. Haliburton sank two free throws to push the lead to 120-111 with 3:38 to go.\n\n\r\n              “I think we have a mature group,” Turner said. “We may be young, but we lock into the details of the game. We don’t allow ourselves to get rattled. We got Tyrese back there, the head of the snake. It seems like he always has his composure in key moments and he keeps us calm.”\n\n\r\n              Turner said that was important in the fourth quarter\n\n\r\n              “There were some chippy plays,” Turner said. “They were trying to get our heads a little bit. They kept composure and didn’t allow that to mess up the flow of the game.”\n\n\r\n              The Pacers outscored the Nets 40-23 in the final period.\n\n\r\n              “They were becoming the aggressor and shifted the momentum in their favor,” Nets coach Jacque Vaughn said.\n\n\r\n              The Nets shot 61% to take a 65-57 lead at halftime. Irving set the pace with 14 points, followed by Simmons with 12. The Pacers made nearly 48% of their shots in the first half.\n\n\r\n              For the game, the Nets shot 53% while the Pacers shot 50%. But the big difference was at the free throw line, where the Pacers sank 30 of 38 while the Nets were 8 of 10.\n\n\r\n               “We wanted to get them off their 3-point line, but I’m not sure how disciplined we were when they got to the rim of not fouling,” Vaughn said. “(We) have to have discipline when they get to the rim and just be vertical. A lot of times guys are going to miss those shots and we rewarded them with fouls. You’re on the road, you can’t expect any calls. For us, it’s a good lesson to be more disciplined in how we approach the defensive end of the floor.”\n\n\r\n              TIP-INS\n\n\r\n              Nets: Yuta Watanabe was sidelined with a right hamstring strain for the second consecutive game. … Simmons scored in double figures for the sixth straight game. In the three games prior to the streak, Simmons had a combined total of 10 points.\n\n\r\n              Pacers: Andrew Nembhard missed his third consecutive game with a bruised left knee. … After a long discussion with the referees during a timeout in the third quarter, Pacers coach Rick Carlisle was issued a technical. Durant missed the free throw. ... Haliburton had four of the Pacers' 13 steals. In contrast, the Nets had two steals.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Portland on Sunday.\n\n\r\n              Pacers: Open seven-game Western road trip Sunday at Los Angeles Clippers.",
  "source": "espn_api",
  "crawled_at": 1764994888.971568
}