{
  "game_id": "0022000882",
  "espn_id": "401307680",
  "date": "Apr 21, 2021",
  "matchup": "OKC @ IND",
  "headline": "Pacers' small ball comes up big in 122-116 win over Thunder",
  "body": "INDIANAPOLIS -- — With seven men out Wednesday night, the Indiana Pacers came up big with a small-ball approach. \n\n\r\n                    Malcolm Brogdon had 29 points, 15 rebounds and seven assists, and Caris LeVert scored 28 points as the severely short-handed Pacers snapped a three-game losing streak with a 122-116 victory over reeling Oklahoma City — despite playing without anyone taller than 6-foot-7.\n\n\r\n                    Indiana was missing three starters — two-time All-Star forward Domantas Sabonis, center Myles Turner and forward T.J. Warren — and four backups. But Brogdon and LeVert delivered in a game they needed to.\n\n\r\n                    “I’d be lying to say thee wasn’t more pressure to carry the team offensively,\" Brogdon said. “We have to tell ourselves ‘Go out and be more aggressive but continue to play the right way, get your teammates involved and give them confidence.'\"\n\n\r\n                    It worked perfectly — for one night.\n\n\r\n                    Darius Bazley matched his career high with 26 points and Svi Mykhailiuk had 20 points to lead the Thunder. Oklahoma City has lost 12 in a row overall, seven straight on the road and is still seeking its first April victory.\n\n\r\n                    Indiana took control early, finishing the first quarter on a 16-6 run to make it 34-28 and extended the margin to 13 late in the second quarter. Oklahoma City never led again.\n\n\r\n                    “Just in the course of the game, we have to be a little cleaner with our execution,\" Thunder coach Mike Daigneault said. “That stuff adds up over the course of the game, so we just need to be better.\"\n\n\r\n                    Oklahoma City fought back in the second half.\n\n\r\n                    The Thunder pulled to 73-72 on Moses Brown's three-point play with 6:59 left in the third — only to watch Indiana answer with a 13-4 spurt. And when they closed to 105-104 midway through the fourth, LeVert broke the game open with a five-point flurry to make it 110-104.\n\n\r\n                    Oklahoma City got one more chance after Brogdon threw the ball away and Theo Maledon's 3-pointer with 24.5 seconds left got the Thunder within 118-116. But Brogdon closed it out by making four free throws.\n\n\r\n                    “It was a stupid play, made it a one possession game,\" Brogdon said of the turnover. “So I knew I had to do what I do best, which is get to the free-throw line and knock down shots to redeem myself.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Brown finished with 12 points and 11 rebounds. ... Mykhailiuk also had nine rebounds, four assists and two blocks. ... Kenrich Williams had 15 points off the bench. ... Oklahoma City's last win came March 31 against Toronto. Its last road win came March 21 at Minnesota. ... The Thunder scored 76 points in the paint.\n\n\r\n                    Pacers: Just hours after Indiana signed Oshae Brissett for the third time this month, he celebrated with 23 points and 12 rebounds. Both were career bests. ... T.J. McConnell had 12 points, eight assists and four rebounds. ... LeVert added five rebounds, six assists and four steals. ... The Pacers avoided their third four-game losing streak of the season, which would have been the franchise's most since 2016-17.\n\n\r\n                    OUT OF ACTION\n\n\r\n                    In addition to Sabonis (lower back), Turner (right foot), Warren (left foot), the Pacers played without Goga Bitazde (left ankle), Jeremy Lamb (left knee) and Doug McDermott (left ankle). JaKarr Sampson sat out, too, after league officials suspended him for one game for headbutting Patty Mills during Monday's loss to San Antonio.\n\n\r\n                    Oklahoma City also was undermanned. Guards Luguentz Dort (right hip) and Shai Gilgeous-Alexander (right foot), forward Josh Hall (knee) and forward-center Mike Muscala (right ankle) all missed the game. Forward Aleksej Pokusevski left in the first half with a non-COVID illness and did not return.\n\n\r\n                    THE STREAK\n\n\r\n                    The victory gives Indiana a remote to extend its streak of consecutive winning seasons on its home court to 32. The Pacers are 10-17 at Bankers Life Fieldhouse with nine home games left. Indiana has the longest active streak in the league and is tied for the third-longest streak in NBA history.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Returns home Friday to face Washington in its only home game during the current seven-game stretch.\n\n\r\n                    Pacers: Can complete a three-game sweep of Detroit by winning Saturday at home.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997068.702174
}