{
  "game_id": "0022300583",
  "espn_id": "401585211",
  "date": "Jan 18, 2024",
  "matchup": "SAC vs. IND",
  "headline": "Bennedict Mathurin scores 25 points, Pacers beat Kings 126-121",
  "body": "SACRAMENTO, Calif. -- — Bennedict Mathurin scored 25 points and the short-handed Indiana Pacers held off the Sacramento Kings 126-121 on Thursday night.\n\n\r\n              Indiana was without newly acquired forward Pascal Siakam, who had yet to join the team following a trade from Toronto, while fellow All-Star Tyrese Haliburton missed his fifth straight game because of a strained left hamstring.\n\n\r\n              Aaron Nesmith (shin) and Andrew Nembhard (back) also were out for the Pacers, and Isaiah Jackson left in the first quarter after taking a hit to the head.\n\n\r\n              “Big-time,” Mathurin said. “We were short a lot of guys on the team tonight. I feel like the guys who didn’t play as much the past couple of games pretty much stepped up.”\n\n\r\n              T.J. McConnell had 20 points and 10 assists to help Indiana win for the 10th time in 13 games. Myles Turner added 18 points and Jalen Smith had 17 points and 13 rebounds.\n\n\r\n              “McConnell set the tone,” Pacers coach Rick Carlisle said. “He was in the paint the entire first half and continued attacking it in the second. I thought Mathurin was terrific in the second half as well.”\n\n\r\n              Kevin Huerter had a career-high 31 points for Sacramento, making 7 of 12 3-pointers. Keegan Murray added 27 points and nine rebounds, but the Kings lost their fourth game in a row.\n\n\r\n              Domontas Sabonis had 21 points, 11 rebounds and 10 assists for his third straight triple-double and his 12th of the season. De'Aaron Fox added 24 points.\n\n\r\n              “A loss like this, it should sting,” Kings coach Mike Brown said. “I know that we can be a better defensive team than what we are. So it has to start there because at the end of the day, we’re going to figure out a way to score. We’ve just got to figure out a way to slow some of these teams down.”\n\n\r\n              The Pacers closed the first half on a 12-2 run to build a 70-57 lead.\n\n\r\n              Huerter answered with seven straight points to start the second half, cutting Indiana’s lead to 70-64.\n\n\r\n              The Pacers led 122-106 with 2:20 remaining, but the Kings staged a furious 15-2 run to climb within three with 32 seconds left.\n\n\r\n              Fox missed a potential tying 3 with seven seconds remaining. Following an offensive rebound, Malik Monk was fouled and missed both free throws.\n\n\r\n              “Obviously, you know they’re going to make a run,” Carlisle said. “But through all that, we made some mistakes, but everyone kept their poise, kept encouraging each other and we got out of here alive.”\n\n\r\n              Sacramento struggled at the free-throw line, going 18 for 32. Indiana made 15 of 19.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At Portland on Friday night.\n\n\r\n              Kings: Host Atlanta on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996795.145632
}