{
  "game_id": "0021900918",
  "espn_id": "401161560",
  "date": "Mar 04, 2020",
  "matchup": "OKC @ DET",
  "headline": "Thunder blow lead, but outlast Pistons 114-107",
  "body": "DETROIT --  Danilo Gallinari made a crucial 3-pointer in the final minute, and the Oklahoma City Thunder beat the Detroit Pistons 114-107 on Wednesday night despite blowing a 16-point second-half lead.\n\nThe depleted Pistons rallied in the fourth quarter and took a 103-102 advantage after a 3-pointer by Svi Mykhailiuk. It was tight the rest of the way, and with the Thunder up by one late, Oklahoma City's Chris Paul dribbled toward Detroit's Brandon Knight, who hit the deck trying to draw an offensive foul.\n\nThere was no whistle, and Gallinari made a 3 with 21.6 seconds remaining to put the Thunder up 111-107.\n\n\"Those calls, they could go either way,\" Paul said. \"I stopped for a second and didn't hear nothing. Saw (Gallinari) open and you just make the right play.\"\n\nShai Gilgeous-Alexander scored 27 points for Oklahoma City, which snapped out of its brief scoring slump. The Thunder had lost their previous two games, not scoring more than 94 points in either. They had that many after three quarters Wednesday.\n\nChristian Wood scored a career-high 29 points for the Pistons, who are without Derrick Rose (right ankle sprain) and have been missing Blake Griffin (left knee surgery) for a while.\n\n\"That's one thing I love about this group, they compete and they are playing hard,\" Detroit coach Dwane Casey said. \"We have a lot of growing up to do, and we have a lot of men in a lot of situations they have not been in before.\"\n\nThe Thunder shot 68% from the field in the first quarter, but led by just five at halftime at 69-64. They extended the lead to 16 late in the third before Detroit made its push.\n\nThe Pistons have lost nine of their last 10 and 15 of their last 18.\n\nThe Thunder entered with a half-game lead on Dallas for the No. 6 seed in the Western Conference. The Mavericks hosted New Orleans on Wednesday night.\n\nTRANSACTION\n\nThe Pistons claimed guard Jordan McRae off waivers, and he stepped in and scored 15 points.\n\nTIP-INS\n\nThunder: Oklahoma City shot 61% from the field for the game, even after scoring only 20 points in the fourth quarter.\n\nPistons: Wood's previous career high was 28 points Dec. 1 vs. San Antonio.\n\nUP NEXT\n\nThunder: Host New York on Friday night.\n\nPistons: Host Utah on Saturday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996196.621184
}