{
  "game_id": "0022000551",
  "espn_id": "401267711",
  "date": "Mar 03, 2021",
  "matchup": "SAC vs. LAL",
  "headline": "Slumping Kings beat short-handed Lakers 123-120",
  "body": "SACRAMENTO, Calif. -- — Buddy Hield shook off a sore ankle to score 29 points and the Sacramento Kings beat the short-handed Los Angeles Lakers 123-120 on Wednesday night.\n\n\r\n                    Hield’s status for the game was in doubt because of a sprained right ankle, but he decided to play through it and helped the Kings win for just the second time in the past 12 games.\n\n\r\n                    “We've been in a bad funk,” Hield said. “If I'm hurt, I can play through that. I don't like taking games off and I hate losing.” \n\n\r\n                    They took advantage of a banged-up Lakers team missing LeBron James and Anthony Davis to bounce back from Sunday’s late-game collapse against Charlotte when they missed five foul shots in the final 69 seconds to blow an eight-point lead.\n\n\r\n                    “We needed that win,” guard Cory Joseph said. “After last game with the mental collapse we had at the end of the game, I felt like we did a good job of the whole 48 minutes staying mentally locked in.”\n\n\r\n                    Sacramento held on at the end to win this one with Harrison Barnes’ layup giving the Kings a 121-120 lead with 30.1 seconds remaining after De’Aaron Fox had just fouled out.\n\n\r\n                    Dennis Schröder and Montrezl Harrell then both missed short shots at the other end and Sacramento got the ball back with 3.0 seconds to play.\n\n\r\n                    Barnes made two free throws and Kyle Kuzma's desperation 3-pointer at the buzzer was off target to seal the win for the Kings.\n\n\r\n                    “Guys are hurt. They’re hurting,” coach Frank Vogel said. “They competed their tails off and fought hard enough to get the win. ... Our guys wanted to win this game very badly and are disappointed.”\n\n\r\n                    Fox finished with 23 points and Barnes had 20 for Sacramento.\n\n\r\n                    Schröder scored 28 to lead Los Angeles, Harrell added 26 and Kuzma scored 25. But it wasn’t enough for the Lakers, who lost for the sixth time in eight games to fall into a tie for third place in the Western Conference. \n\n\r\n                    “The offense wasn't really the issue,” Kuzma said. “It was the defense. Throughout the game we had a few mental lapses. ... We just didn't stop them. Offensively, it wasn’t an issue.”\n\n\r\n                    NO REPLAY\n\n\r\n                    Replays showed Hield had a foot on the line on a 3-pointer in the second quarter, but the play never got overturned. Vogel said the officials told him that by the time the play was reviewed it was determined to be too long after the play to change the call. \n\n\r\n                    INJURY REPORT\n\n\r\n                    James missed his first game of the season for the Lakers with a sore left ankle. James is still expected to play in the All-Star Game Sunday but the Lakers decided to give him a day off.\n\n\r\n                    “He’s pretty banged up right now, so we took this opportunity to keep him home for this game,” Vogel said.\n\n\r\n                    The Lakers were also missing Davis (right calf strain), Marc Gasol (health and safety protocols) and Alex Caruso (neck spasms).\n\n\r\n                    The Kings were also short-handed with rookie Tyrese Haliburton missing his second straight game with an injured left calf. Haliburton is expected to miss one more game before returning after the break.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Los Angeles made 12 of its first 18 shots. ... Harrell was called for a technical foul after yelling “And 1!” after scoring a basket early in the second quarter.\n\n\r\n                    Kings: Hield scored eight straight points in a span of 50 seconds in the second quarter to help the Kings erase a 14-point first-quarter deficit to take a 45-43 lead.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Host Indiana on March 12.\n\n\r\n                    Kings: Visit Portland on Thursday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997169.7537081
}