{
  "game_id": "0022200670",
  "espn_id": "401468825",
  "date": "Jan 18, 2023",
  "matchup": "ATL @ DAL",
  "headline": "Young, Hawks beat Doncic, Mavs 130-122 for 4th straight win",
  "body": "DALLAS -- — Trae Young's latest matchup against Luka Doncic was his first with Dejounte Murray.\n\n\r\n              Atlanta's backcourt mates kept their winning streak alive against the MVP candidate.\n\n\r\n              Murray scored 30 points, Young had 18 points and 12 assists and the Hawks beat the Dallas Mavericks 130-122 on Wednesday night.\n\n\r\n              John Collins added 19 points as Atlanta won a season-best fourth consecutive game to get back over .500 at 23-22.\n\n\r\n              Doncic scored 30 points but had just three in the fourth quarter and fell to 4-3 in head-to-head meetings with Young. They were traded for each other as top-five picks on draft night in 2018, Doncic going third overall and Young fifth.\n\n\r\n              Murray and Collins combined to go 7 of 11 from 3-point range as the Hawks shot 57% from deep and 50% overall. \n\n\r\n              Dallas was down one when Murray, acquired in the offseason for multiple first-round draft picks, hit a 3 for a 124-120 lead just inside the two-minute mark of the fourth quarter. Young pushed the lead to six with 41 seconds left on a high-arching floater.\n\n\r\n              “These are the things we were looking for or have been looking for with (Murray) and Trae,” coach Nate McMillan said. “Trae did a good job ... understanding that (Murray) had a hot hand, was feeling it and was in a rhythm and we tried to milk that.”\n\n\r\n              Dallas shot 52% overall and 38% from long range with 16 3s but couldn't get stops while allowing at least 130 points for the third consecutive game.\n\n\r\n              “It’s a shootaround,” Mavs coach Jason Kidd said. “In this league, you do that, no matter if you have Luka or Kareem or LeBron, you’re going to lose.\n\n\r\n              “Until we put in a better effort into defense and understanding what we have to do, then we’re going to score 120 but we’re going to give 130, 140. One night we might give up 150.” \n\n\r\n              Christian Wood had 22 points and nine rebounds for the Mavericks, who were coming off a 1-4 trip and have lost six of eight since a seven-game winning streak that was their longest since the franchise's lone championship season of 2010-11.\n\n\r\n              Murray put Atlanta ahead for good with a jumper to start a 7-0 that broke a 110-110 in the fourth quarter.\n\n\r\n              Dallas took its first lead at 75-73 in the third quarter on a 3-pointer from Doncic that started an 11-0 run. Murray answered by scoring the next eight points to get the Hawks back within two.\n\n\r\n              MORE CAPELA\n\n\r\n              Atlanta’s Clint Capela had 16 points and six rebounds in his second game back after missing 13 of the previous 14 games with a right calf strain. McMillan said Capela was still on a minutes restriction off the bench. He played 23, two more than in his return and was on the floor with the game on the line late.\n\n\r\n              TWO MAVERICKS RETURN\n\n\r\n              Dorian Finney-Smith started for Dallas after missing 14 games with a right adductor strain, and Josh Green was back from a 20-game absence due to a right elbow sprain. Finney-Smith had nine points and nine rebounds in 35 minutes. Green scored nine points in 20 minutes. \n\n\r\n              TIP-INS\n\n\r\n              Hawks: Eight of the nine Atlanta players scored in double figures. After Capela, Bogdan Bogdanovic had 12 and De'Andre Hunter and Onyeka Okongwu finished with 11 apiece. AJ Griffin scored 10. ... The Hawks were last over .500 on Dec. 27.\n\n\r\n              Mavericks: Spencer Dinwiddie scored 11 of his 20 points in the fourth quarter. ... Reggie Bullock scored 18 on 4-of-7 shooting from 3. \n\n\r\n              MOVING TIME\n\n\r\n              McMillan said the initial goal he set for the team in a chart he showed the players recently was to finish in the top six in the Eastern Conference, which would avoid the play-in tournament. \n\n\r\n              The Hawks won two play-in games last season to get the eighth seed. They lost to top-seeded Miami in five games in the first round after going to the East finals in 2020-21. \n\n\r\n              “We need to start winning some games because we’re in the second half of the season and this thing normally goes pretty fast,” McMillan, whose team entered the game seeded ninth, said before the game. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: The Knicks visit Friday, with New York trying to win a fifth consecutive game in Atlanta.\n\n\r\n              Mavericks: Miami at home Friday. The Heat have won nine of the past 11 in Dallas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994828.412302
}