{
  "game_id": "0022301187",
  "espn_id": "401585815",
  "date": "Apr 14, 2024",
  "matchup": "CLE vs. CHA",
  "headline": "Steve Clifford wins final game as Charlotte coach, Hornets beat playoff-bound Cavaliers 120-110",
  "body": "CLEVELAND -- — Nick Smith Jr. scored a season-high 24 points and Steve Clifford won his coaching farewell as the Charlotte Hornets rallied to beat the playoff-bound Cleveland Cavaliers 120-110 on Sunday.\n\n\r\n              Max Strus had 14 points, 10 rebounds and 11 assists for his first career triple-double for Cleveland, which rested All-Star shooting guard Donovan Mitchell, point guard Darius Garland and sixth man Caris LeVert.\n\n\r\n              The Cavaliers finished fourth in the East and will have home-court advantage against the Orlando Magic in the first round of the playoffs. They locked up a top-four finish Friday by beating Indiana, but lost 12 of their final 19 regular-season games to wind up 48-34.\n\n\r\n              “Orlando is a young team and they’re going to be fighting for a lot, so we have to come in with the mentality to throw the first punch,” Cleveland center Jarrett Allen said. “We need to lock in, watch our film and do everything we can to prepare for the playoffs.”\n\n\r\n              Georges Niang scored 16 points, Allen posted 14 points and seven rebounds, and Evan Mobley had 14 points for Cleveland. Allen made all seven of his field goal attempts and went 20 of 21 from the field over the final two games.\n\n\r\n              Cavaliers forward Pete Nance — the son of former All-Star Larry Nance and brother of Pelicans center Larry Nance Jr. — made a 3-pointer for his first points in the NBA. Second-year pro Isaiah Mobley scored 11 and Craig Porter Jr. started at point guard before spraining his left ankle.\n\n\r\n              “The safety of our guys was the most important thing, so we stuck to our plan of giving the guys who play typical minutes for us no more than the first three quarters,” Cleveland coach J.B. Bickerstaff said. “We wanted to give our younger players some unique experiences today, and we did that.”\n\n\r\n              JT Thor had a career-high 20 points and 10 rebounds for the Hornets, who ended the game on an 18-2 run and finished with the third-worst record in the East at 21-61. Bryce McGowens had 18 points and Marques Bolden added 14 points and four blocked shots.\n\n\r\n              The 62-year-old Clifford, who will likely remain with the franchise as an advisor, has spent seven total seasons with Charlotte, including the past two, and is its career leader in games coached (574) and wins (244).\n\n\r\n              “I thought our guys had a great attitude in the last game of the year,” Clifford said. “Over these last 25-35 games, we were out of it, but they stuck together, practiced well and played some good games. I'm really proud of all of them.\"\n\n\r\n              Hornets small forward Brandon Miller, who ranks second among NBA rookies with a 17.3 scoring average, did not play because of a right wrist sprain. Power forward Miles Bridges was not in uniform with a bruised right wrist.\n\n\r\n              Niang became the first Cavaliers player to appear in all 82 games since LeBron James in 2017-2018.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: NBA draft lottery on May 12.\n\n\r\n              Cavaliers: Host a playoff game on either April 20 or 21.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996715.5986502
}