{
  "game_id": "0022300702",
  "espn_id": "401585330",
  "date": "Feb 03, 2024",
  "matchup": "MIL @ DAL",
  "headline": "Doc Rivers' first win as Bucks coach means he'll lead East All-Stars after huge rally to beat Mavs",
  "body": "DALLAS -- — Giannis Antetokounmpo looked up in slight amazement when told Doc Rivers had just clinched coaching in the All-Star Game.\n\n\r\n              Seems the reaction had more to do with Rivers being the Milwaukee star's coach for exactly three games than the 25-point rally that secured the bid for Rivers and the Bucks' staff. \n\n\r\n              Antetokounmpo scored 48 points and the Bucks overcame the big first-half deficit for their first victory under Rivers, beating the Dallas Mavericks 129-117 on Saturday night.\n\n\r\n              “He’s going to coach the game?” a wide-eyed Antetokounmpo said after going 20 of 28 from the field with 10 of Milwaukee's 34 assists. \n\n\r\n              Rivers, who lost his first two games after the midseason firing of first-year coach Adrian Griffin, was slightly less than amused about leading the Eastern Conference All-Stars on Feb. 18.\n\n\r\n              Boston has the best record in the East two weeks before the game, but Joe Mazzulla is ineligible after coaching the game last year. So the Bucks and their second-best record get the nod.\n\n\r\n              “It’s ridiculously bad. It really is,” Rivers said. “Well, Adrian’s going to get some money, that’s for sure. And a ring. It’s one of these quirky things. I think there should be a rule somehow that someone else does it, other than me. Maybe I’ll send my staff, and I’ll go on vacation.”\n\n\r\n              Damian Lillard scored 30 points on 10-of-11 shooting, making all five 3-pointers, in the second-biggest comeback victory this season for Milwaukee, which trailed Portland by 26 in a November victory. \n\n\r\n              Luka Doncic had 40 points and 11 assists for the Mavericks, who had their biggest blown lead in a loss this season.\n\n\r\n              With Kyrie Irving out for a sixth consecutive game with a sprained thumb, Doncic went to the locker room briefly in the first quarter after getting his right ankle tangled with Antetokounmpo in a battle for a loose ball. \n\n\r\n              The five-time All-Star returned to help finish a 44-20 first quarter for Dallas, which led 49-24 early in the second when Antetokounmpo hit a 3. \n\n\r\n              The Bucks were still down 20 when Lillard scored to trigger a 15-0 run in the final 1:59 of the first half.\n\n\r\n              The flurry included a five-point possession when Doncic was called for a transition take foul and a technical. Lillard made both free throws and AJ Green hit a 3 before Lillard beat the halftime buzzer with another 3 for a 65-60 deficit. \n\n\r\n              “Looking at what Milwaukee did, they just kept playing and took our best shot there in the first half and then ended the half on a positive with Dame making that 3 at the buzzer,” Dallas coach Jason Kidd said. “We didn't take care of the ball.”\n\n\r\n              The Bucks used an extended 38-10 run into the third quarter for an eight-point lead before Dallas regained the lead late in the third.\n\n\r\n              Antetokounmpo put Milwaukee back in front for good when he went the length of the court in 3.7 seconds for a layup and a 93-92 lead, leaving 1.2 seconds to spare in the third.\n\n\r\n              The Bucks, who were without starting center Brook Lopez for personal reasons, had the lead back to eight by the middle of the fourth quarter.\n\n\r\n              Bobby Portis had 12 points and 10 rebounds for Milwaukee. Maxi Kleber scored 21, and Josh Green added 20 for Dallas.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Utah on Sunday night.\n\n\r\n              Mavericks: At Philadelphia on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996121.3847558
}