{
  "game_id": "0021501170",
  "espn_id": "400829057",
  "date": "Apr 06, 2016",
  "matchup": "HOU @ DAL",
  "headline": "Mavs beat Rockets 88-86 to keep slim lead over Utah, Houston",
  "body": "DALLAS -- If the Dallas Mavericks have to creep into the playoffs, they will. It's part of a style change, as coach Rick Carlisle likes to call it.\nAnd it worked again for the Mavericks in a crucial, tense victory over their Texas rivals from Houston.\nJ.J. Barea scored 27 points and Dallas kept a slim cushion over Utah and Houston in the race for the last two Western Conference playoff spots with an 88-86 victory over the Rockets on Wednesday night.\n\"I like to play fast, too, but slowing it down is working us,\" said Barea, who had a game-high eight assists. \"We've got to stay that way.\"\n\nThe Mavericks' fifth straight victory -- one shy of a season best -- put Dallas (40-38) a game ahead of Utah and two up on Houston with four games remaining for all three teams.\nDirk Nowitzki was limited to seven points on eight shots, but had a crucial strip of James Harden on a drive in the final seconds with the Mavericks clinging to a one-point lead.\nHarden scored 26 points and Dwight Howard had 14 points and 16 rebounds for the Rockets, who are in danger of missing the postseason a year after reaching the West finals.\n\"We all know how difficult it is, how important this game was,\" Harden said. \"It's not rocket science.\"\nThe Mavericks held their fifth straight opponent under 90 points after 19 of the previous 21 scored at least 100. It's part defense and part pace, with the Mavericks slowing things considerably since point guard Deron Williams was sidelined by a left abdominal strain.\nBarea has been the most important Dallas player since then, scoring at least 20 points in his fourth straight game and averaging 24.2 points, 3.4 rebounds and 7.0 assists during the five-game surge.\nAnd he was at the center of the play pulled Dallas even late, dribbling across the lane and hitting a leaning shot as he was fouled by Patrick Beverley. The free throw made it 85-all.\nThe last field goal for Houston came with 3:20 remaining when Beverley sprinted through the lane and tipped in Howard's second missed free throw after the 6-foot-11 center was fouled intentionally.\nHarden missed a pair of 3-pointers late, but had a chance to give the Rockets the lead when he drove on Wesley Matthews with less than 10 seconds remaining. Nowitzki reached around him to knock the ball loose, Dallas won the ensuing scramble and Devin Harris made two free throws for an 88-85 lead with 5 seconds to go.\n\"One of the reasons Dirk is having a hard time getting open looks is because we are playing a different style right now,\" Carlisle said. \"I am proud of our guys for being willing to be team guys and play this way. We lived to fight another day.\"\nThe Rockets went ahead 71-70 going in the fourth when Howard tipped in a lob pass from Jason Terry on an inbounds play with just 0.2 seconds left in the third. And Houston had the biggest lead of the fourth at 80-76 before Dallas' defense clamped down, outscoring the Rockets 18-15 in the fourth.\nHouston scored on just three of its last 16 possessions and had six points in the final 9:15 on 2-of-14 shooting.\nMichael Beasley had 15 points off the bench for the Rockets, who didn't have anybody else in double figures.\n\"They got very handsy, they did a very good job of keeping us out of the break,\" Houston coach J.B. Bickerstaff said. \"They smothered us in the backcourt.\"\nMatthews had 16 points for Dallas, including three 3-pointers during a 15-2 run made up entirely of 3s to put Dallas up 10 in the second quarter. Barea had the other two.\nUGLY FOURTH\nHarden had 12 of Houston's 15 points in the fourth, and his teammates were 1 of 11 from the field. The teams combined to shoot 28 percent (11 of 39) in the final quarter. Barea had 10 of his points on 4-of-6 shooting.\nBLOOD BREAKS\nPlay was stopped twice in the first quarter because players were bleeding. The first was Beverly, who had a cut above his left eye and was led off the court with a towel covering it. He got three stitches and returned in the second quarter with a bandage over the eye. Mavericks forward David Lee had a cut on his right arm late in the quarter and left the game as well before returning.\nTIP-INS\nRockets: Houston fell to 2-17 when scoring under 100 points. ... Howard had his 37th double-double. ... Despite the loss, the Rockets will likely hold the tiebreaker over the Mavericks because of a better Southwest Division record.\nMavericks: Dallas quarterback Tony Romo, a regular on the front row for Mavs games, was joined this time by tight end Jason Witten and three of his offensive linemen -- Pro Bowlers Travis Frederick and Zack Martin along with Doug Free. ... Harris scored 10 points.\nUP NEXT\nRockets: Host Phoenix on Thursday.\nMavericks: Host Memphis on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994597.599336
}