{
  "game_id": "0022200010",
  "espn_id": "401468025",
  "date": "Oct 19, 2022",
  "matchup": "MIN vs. OKC",
  "headline": "Gobert thrives in T-wolves debut to lead 115-108 win vs. OKC",
  "body": "MINNEAPOLIS -- — Rudy Gobert stood out on both ends of the floor — on a night when the Minnesota Timberwolves needed a big lift from their new big man.\n\n\r\n              Gobert had 23 points and 16 rebounds in his Minnesota debut, and the Timberwolves recovered to beat the Oklahoma City Thunder 115-108 on Wednesday in the season opener. \n\n\r\n              D'Angelo Russell had 20 points and Jaden McDaniels added 19 points for the Timberwolves, who turned a 16-point lead into a six-point deficit during the third quarter. \n\n\r\n              “It shows how good we can be and how much better we can be at the same time,\" Gobert said. \"It’s going to be a process, and every night’s going to be an opportunity.”\n\n\r\n              Gobert stepped up with a steadying hand when Karl-Anthony Towns (12 points) and Anthony Edwards (11 points) shot a combined 6 for 27 from the floor and the entire team had trouble finishing at the rim. Gobert did his usual shot-altering work on defense in the paint, too.\n\n\r\n              Shai Gilgeous-Alexander led the Thunder with 32 points and cut the lead to 105-103 with 4:04 left, but they didn't get any closer after that.\n\n\r\n              “We have the ability to flip the switch, but the earlier we can do it the better it will be,” said Oklahoma City's Josh Giddey, who pitched in 14 points and 11 rebounds.\n\n\r\n              The Timberwolves won all four matchups with the Thunder last season by an average of more than 26 points. One of the most anticipated seasons for Timberwolves fans in the star-crossed history of their team, coming off a return to the playoffs and the blockbuster addition of Gobert in a trade with Utah, began with the home team in complete control.\n\n\r\n              After Minnesota went ahead by a game-high 16 points, the Thunder went on a 27-5 run. Eugene Omoruyi, who did fine work defending Towns during that stretch, knocked down a shot in the paint for Oklahoma City’s first lead with 3:01 left in the period.\n\n\r\n              Gobert single-handedly cranked the crowd energy back up by stealing a bad pass by Mike Muscala, beating him to the loose ball and flipping in a one-handed runner ahead of the buzzer to tie it at 87. Gobert dunked on Giddey for a 92-89 lead to give the fans yet another highlight.\n\n\r\n              “I appreciate the love,” Gobert said. “It feels good to see the crowd and the community embracing me already.”\n\n\r\n              The Timberwolves had to work for this win against a pesky, young and fast Thunder team that’s playing without injured No. 2 overall draft pick Chet Holmgren.\n\n\r\n              “Scrappy games should suit our guys,” Giddey said. “We're young guys. We should love those type of environments.”\n\n\r\n              The biggest question surrounding the Timberwolves is how effectively Gobert and Towns can play together, a pair of 7-footers — albeit with distinct skill sets — in this age of long-distance shooting and position-less small ball across the NBA.\n\n\r\n              Gobert put his name on the first basket of the season, a put-back of his own miss, and the twin towers provided a glimpse of how well they can play off of each other with Towns twice flipping him top-of-the-key lob passes for dunks in the first half. Towns had eight assists.\n\n\r\n              “I was just trying to utilize my passing ability,” Towns said, “and just play winning basketball.”\n\n\r\n              CONTACT SPORT\n\n\r\n              The Thunder lost rookie Jalen Williams — one of three 2022 lottery selections on the roster — to a right eye injury in the second quarter. He took a hit while trying to defend a dunk attempt by McDaniels and needed assistance to leave the floor. \n\n\r\n              HOMECOMING FOR HOLMGREN\n\n\r\n              The luster was stripped off the opener for Oklahoma City's prized rookie when he ruptured a tendon in his right foot in a pro-am game that ended his first season before it began. Holmgren grew up in south Minneapolis, just a few miles from Target Center, and accompanied the Thunder on the trip so he could see family and enjoy some bonding time with his teammates. The rehab program will take priority for Holmgren over traveling with the team over the course of the season.\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Kenrich Williams and Aleksej Pokusevski were surprise starters in the frontcourt. The 7-foot Pokusevski had 11 points and seven rebounds in 25 minutes. ... Jeremiah Robinson-Earl started the second half in place of Williams.\n\n\r\n              Timberwolves: Jaylen Nowell, who had 13 points, put the Timberwolves ahead for good with his layup with 10:47 remaining. ... Eric Paschall, who played 58 games for Utah last season and was in camp on a two-way contract, was waived before the game amid lingering left Achilles trouble. \n\n\r\n              UP NEXT\n\n\r\n              Thunder: Visit Denver on Saturday night. Their home opener is against Minnesota on Sunday night.\n\n\r\n              Timberwolves: Host Utah on Friday night, when Gobert takes on his former team. “It’s going to be fun,” he said. “It’s all love from me.”\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995189.869498
}