{
  "game_id": "0022200229",
  "espn_id": "401468384",
  "date": "Nov 18, 2022",
  "matchup": "MEM vs. OKC",
  "headline": "Grizzlies beat Thunder, but Morant leaves with ankle injury",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 25 points, 12 rebounds and three blocks and Memphis beat the Oklahoma City Thunder 121-110 on Friday night in a game where Grizzlies star Ja Morant left late with an ankle injury.\n\n\r\n              Morant and John Konchar added 19 each for Memphis, with Morant finishing with 11 assists and Konchar grabbing 10 rebounds. Grizzlies coach Taylor Jenkins said after the game that Morant “tweaked” his ankle, but there was no further word on Morant’s injury. He added that the team would further evaluate the situation on Saturday.\n\n\r\n              For Jackson, who missed the first 14 games of the season, Friday’s performance was much better than his debut in Tuesday’s loss at New Orleans. In that one, Jackson had seven points, hitting only 3 of 14 shots and missing all seven of his 3-point attempts.\n\n\r\n              Against Oklahoma City, Jackson scored first on a dunk then on a 3-pointer to get untracked. Jackson said the difference was probably a combination of shaking off the rust from the debut to getting two baskets early.\n\n\r\n              “You can’t really predict all of that,” Jackson said of his start, “but it just looked a lot better than before rhythm-wise. I felt a lot better out there. I was able to get my feet under me and my legs.”\n\n\r\n              Josh Giddey led Oklahoma City with 20 points and 11 assists. Jalen Williams had 16 points, six rebounds and seven assists. Shai Gilgeous-Alexander had his lowest scoring game of the season with 15 points, going 6 of 18 from the field.\n\n\r\n              Jenkins credited not only the defense of Dillon Brooks on Gilgeous-Alexander, but Memphis’ ability to switch defenders and throw multiple looks at the Thunder’s leading scorer.\n\n\r\n              “We were just trying to keep him off balance,” Jenkins said. \n\n\r\n              Memphis carried a nine-point lead into the fourth period and quickly extended it to 12. But the Thunder got to 106-102 with 2:38 left. The Grizzlies then scored nine straight points after Morant went out with the ankle injury to seal it.\n\n\r\n              “I mean we gave ourselves a chance. We climbed back in it multiple times,” Thunder coach Mark Daigneault said, later adding: “Made some runs, but we were a couple of execution things away. Credit (the Grizzlies). They were better.”\n\n\r\n              Jackson’s early offense helped Memphis build several double-digit leads. But each time, the Thunder battled back. Memphis held a 63-59 lead at the break, but the showdown between the Gilgeous-Alexander and Morant, two of the league’s most dynamic young guards, hadn’t really materialized.\n\n\r\n              Gilgeous-Alexander and Morant both continued to shoot inaccurately through three quarters, representative of both teams connecting on less than 45% of their shots at that point.\n\n\r\n              “Basketball is a game of runs. It’s about how well you can weather storms and how you can extend margins,” Giddey said. “We’ve gotten better at that as the season wore on. We haven’t let too many games get out of hand.”\n\n\r\n              TIP-INS: \n\n\r\n              Thunder: C Aleksej Pokusevski injured his left ankle near the end of the first half and went straight to the locker room. He did not return in the game. Mike Muscala started the second half. … Rookie Jalen Williams, the 12th overall pick out of Santa Clara, started his third game of the season at forward. … F Darius Bazley missed his fifth game with a right ankle sprain. \n\n\r\n              Grizzlies: Memphis avoided its first three-game losing streak of the season and is now 6-1 at home. … Tyus Jones reached 1,750 career assists with a dime in the second quarter. …Konchar set a career high with five 3-pointers.\n\n\r\n              UP NEXT: \n\n\r\n              Thunder: Host New York on Monday night.\n\n\r\n              Grizzlies: At Brooklyn on Sunday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994231.454026
}