{
  "game_id": "0021900693",
  "espn_id": "401161335",
  "date": "Jan 27, 2020",
  "matchup": "DET vs. CLE",
  "headline": "Love's big first half lifts Cavaliers past Pistons 115-110",
  "body": "DETROIT --  Before his team took the court, Cavaliers star Kevin Love spent some of his day looking back at Kobe Bryant's life and career.\n\n\"I watched his short film, I watched all of his highlights, I watched his interviews,\" Love said. \"I have videos on my phone, from the Olympics, from All-Star Games, where they're intimate and behind-the-scenes type of stuff.\"\n\nLove was an Olympic teammate of Bryant's and played college basketball in Los Angeles at UCLA, so it felt fitting when he made six 3-pointers in the first half Monday night during Cleveland's 115-100 win over the Detroit Pistons. The Cavaliers snapped a seven-game losing streak.\n\nIt was the first game for either team since Bryant's death Sunday in a helicopter crash. The teams honored Bryant's two uniform numbers when Cleveland committed a 24-second shot clock violation after the opening tip, and the Pistons gave the ball back with an 8-second violation in the backcourt. Fans observed 24 seconds of silence in Bryant's honor before the game.\n\nCleveland scored 24 points in the first quarter, and Love finished with just over 24 minutes played. Larry Nance Jr. -- a teammate of Bryant's with the Lakers -- scored 10 points for Cleveland in just under 24 minutes.\n\n\"Sometimes, it just happens that way,\" Love said. \"Feels like sometimes it should, if you just go out there and do right by the game of basketball, like Kobe would have wanted.\"\n\nIt was the third meeting this month between the Pistons and Cavaliers. They split a home-and-home series Jan. 7 and 9 in a pair of tightly contested games. This one wasn't nearly as close. Cleveland led 53-45 at halftime.\n\nLove scored all 20 of his points in the first half and did not even need to attempt a shot in the final 24 minutes. It was 89-72 after three quarters. Cleveland had not won by double digits since a 108-87 victory at New York on Nov. 10.\n\n\"We talk about, you know, Kobe this, Kobe that,\" Pistons coach Dwane Casey said. \"Believe me, rest his soul, he would be embarrassed how we, our non-compete level.\"\n\nCollin Sexton had 23 points for the Cavaliers and Tristan Thompson added 17 points and 11 rebounds. Reggie Jackson led Detroit with 16 points.\n\n\"It's tough,\" Pistons guard Langston Galloway said. \"Knowing what Kobe stands for and what he embodies, that's what everybody in this locker room kind of grew up on. Kobe is an icon, a legend.\"\n\nSERIES\n\nThe Pistons and Cavaliers have finished their four-game season series. The road team won every game.\n\n\"I don't know. It's something we should think about,\" Cleveland coach John Beilein said. \"Everybody should think about their home-game routines and things like that, and make sure that there's not something getting in the way, distracting them.\"\n\nINJURIES\n\nThe Pistons have been without Blake Griffin (left knee surgery) and were also missing Tony Snell (illness), Derrick Rose (right knee soreness) and Luke Kennard (bilateral knee tendinitis) in this game.\n\nBrandon Knight (left knee soreness) did not play for the Cavaliers.\n\nTIP-INS\n\nCavaliers: Alfonzo McKinnie scored 15 points. ... Cleveland outscored Detroit 64-42 in the paint.\n\nPistons: Andre Drummond had 15 points and Svi Mykhailiuk added 13.\n\nUP NEXT\n\nCavaliers: Host New Orleans on Tuesday night.\n\nPistons: At Brooklyn on Wednesday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996269.98631
}