{
  "game_id": "0021501205",
  "espn_id": "400829092",
  "date": "Apr 11, 2016",
  "matchup": "CHA @ BOS",
  "headline": "Lin has 25 points to send Hornets to 114-100 rout over Celts",
  "body": "BOSTON -- Jeremy Lin noticed the loud cheers before the game, knew it was Asian-American night and then went out and led the Hornets to a big win.\nLin scored 19 of his 25 points in Charlotte's big second quarter, carrying the Hornets to a 114-100 win over the Boston Celtics on Monday night.\n\"I heard the fans. I saw the fans before the game. I heard them when I was out there before the game,\" he said.\n\"I'm thankful, very thankful. It felt like a home game for me. I think it was like Asian night or whatever -- thanks to whoever planned that event.\"\n\nAs with many of his visits to Boston, Lin had a number of Asian-American fans holding signs and cheering his play. The 27-year-old guard starred at Harvard. Four years ago when he sparked the New York Knicks, Lin's rise was called \"Linsanity.\"\nHis big game came a night after he scored one point in a loss to Washington, going 0 for 6 from the field.\n\"I just felt (Sunday) was disappointing, probably my worst game of the season,\" he said. \"I wanted to come out here tonight, I didn't know what to expect, I didn't know that second quarter was going to be like that, but I knew I was going to be aggressive.\"\nKemba Walker scored 18 points, and Al Jefferson and Marvin Williams each had 16 for the Hornets, who are in a tight race with Boston and Miami in the Eastern Conference playoff chase.\nBut it was Lin's second quarter that sent Boston into a big deficit that it couldn't climb out of the rest of the game.\n\"He was just being aggressive when he was in the game,\" Boston guard Avery Bradley said. \"He was making great plays for his team. Jeremy Lin is a good player and he proved it tonight.\"\nIsaiah Thomas and Bradley led Boston with 17 points apiece. It was just the Celtics' third loss in their past 21 home games.\nThe Hornets trailed by four points after the first quarter, but took charge with a 31-3 run over the final nine minutes of the second. Lin paced the spree with a 3-pointer and scored 11 straight points over a 1:41 span.\n\"It's one of the best games we've played all year,\" Hornets coach Steve Clifford said. \"By far the best game we've played in three weeks or so.\"\nBoston committed six turnovers in the quarter and shot just 13.6 percent (3 of 22) while Charlotte made 57.9 percent of its shots (11 of 19).\nThe Hornets led 94-72 after three.\nThe Celtics made a brief run in the fourth, but never got their deficit into single digits.\nTIP-INS\nHornets: Jefferson made his first start since Nov. 29 because Cody Zeller was out with a bruised sternum. Zeller had started the past 57 games. Clifford said everyone will play -- unless injured -- in the regular-season finale, but no one will get their regular minutes.\nCeltics: F Jae Crowder was sick Saturday, but coach Brad Stevens said he was feeling better. ... Bradley picked up four fouls in just 13 minutes in the opening half. Kelly Olynyk had three in only 10 minutes.\nPERFECT TIMING\nThe Celtics gave out T-shirts to fans with green letters that read \"Asian-American Night.\" The national anthem was performed by a group of Asian-Americans and there was a halftime performance as well.\nBIG STATS\nLin added five assists and five steals.\n\"I did?\" he said, breaking into a wide smile when told all of his steals came in the second quarter.\nPOOR SHOWING\nThe Celtics matched their worst quarter of the season by scoring 13 points in the second.\n\"We laid an egg at the end of the second quarter,\" Stevens said.\nVISITOR\nFormer UConn coach Jim Calhoun visited the Hornets' locker room after the game. Kemba Walker was a star at UConn and led the Huskies to the 2011 NCAA title.\nUP NEXT\nHornets: Host Orlando on Wednesday.\nCeltics: Host Miami on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994335.588746
}