{
  "game_id": "0021701228",
  "espn_id": "400975974",
  "date": "Apr 11, 2018",
  "matchup": "LAL @ LAC",
  "headline": "Hart's 30 lead Lakers past Clippers 115-100 to end season",
  "body": "LOS ANGELES --  The Lakers finished with 35 wins, their most since 2012-13. And coach Luke Walton can live with that.\n\nJason Hart set career highs with 30 points and seven 3-pointers, and the Lakers defeated the Los Angeles Clippers 115-100 on Wednesday night, closing out a fifth consecutive season without a playoff berth.\n\n\"We're on the right path for where we want to get to,\" Walton said. \"Really happy with the progress we made. It was a special, fun year.\"\n\nTwo-way player Gary Payton II added a career-best 25 points off the bench as the Lakers beat their Staples Center co-tenant for the first time since April 4, 2012, as the visiting team. They went 35-47 under Walton in his second year.\n\n\"We're very confident in what we have to build off of,\" Hart said. \"The biggest thing for us is getting the experience and we did that. We all want each other to succeed. We were eliminated from playoff contention and no one went out on their own. Every game until the end of the season, we played hard, competed and played for each other.\"\n\nTobias Harris led the Clippers with 23 points. They ended the season with four straight losses, and finished with a 42-40 record although their streak of consecutive playoff appearances ended at six.\n\n\"I don't like going home, I just don't,\" Clippers coach Doc Rivers said. \"If we were healthy, we'd be in the playoffs.\"\n\nThe Lakers led by nine at halftime and stretched it to 22 points in the third, when Hart scored 14 points, hitting three straight 3-pointers.\n\nAs a team, the Lakers tied their season high with 17 3-pointers, including three each by Payton, Alex Caruso and Brook Lopez.\n\nTIP-INS\n\nLakers: G Lonzo Ball ended his rookie season on the bench, having missed the final eight games with a left knee contusion. In all, he missed 30 games due to injury. Ball averaged 10.2 points, 6.9 rebounds and 7.2 assists in 34.2 minutes. ... The Lakers were 11-19 without Ball in the lineup. ... Fellow rookie F Kyle Kuzma missed the last three games with a sprained left ankle. He averaged 16.1 points and shot 70 percent from the free-throw line.\n\nClippers: G Lou Williams sat out his second straight game with a sprained right ankle. He averaged career highs in points (22.6), assists (5.3) and minutes (32.8). His bench scoring led the NBA in his 13th season. ... They won the season series 3-1. ... They had won 21 of 23 against the Lakers since 2012-13 by an average of 15 points. ... DeAndre Jordan joined the crowd singalong of \"Sweet Caroline\" during a timeout late in the game.\n\nBACK TO EARTH\n\nAndre Ingram came down to earth a night after a 19-point performance in his NBA debut for the Lakers against Houston. The 32-year-old guard scored five points on 2-of-9 shooting and had six assists in 33 minutes. The 10-year veteran of the G League said he had hundreds of messages on his phone on Tuesday. Ingram graduated from American University with a physics degree and he calls math \"a true love of mine.\" He tutors high school students when he has time during the G League season and in the offseason to \"keep that part of the brain functioning.\"\n\nHE SAID IT\n\n\"I don't even know what to do tomorrow.\" -- Rivers, who will miss the playoffs for just the fourth time in 19 years of coaching.\n\nLEBRON TO LAKERS?\n\nChanning Frye thinks it's possible the Lakers could land LeBron James in free agency this summer. \"Any superstar would like to play for Luke (Walton). He's a players' coach,\" Frye said. \"If that's not enough, this is also the Lakers and you'd get to play in LA at Staples Center.\" Frye will be a free agent, too, and the veteran forward would like to stay in LA. \"(Expletive), it's the Lakers,\" he said. \"I want to allow them to make the right decisions with bigger-name guys. I'm a pretty good backup, emergency break-the-glass-type guy.\"\n\nFAREWELL EMBRACE?\n\nJordan and Rivers embraced after the game ended, with neither quite sure of their futures in Los Angeles. Jordan has a player option worth $24.1 million for next season, which he could decline and pursue free agency after spending his first 10 years with the Clippers. Rivers will be heading into the final year of his contract. \"I want to be where I'm wanted,\" Jordan said. \"I want to have a chance to contend. That's really what I'm looking at.\"\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992930.2675169
}