{
  "game_id": "0022400822",
  "espn_id": "401705388",
  "date": "Feb 24, 2025",
  "matchup": "IND vs. DEN",
  "headline": "Aaron Gordon, Nikola Jokic lead Nuggets past Pacers 125-116",
  "body": "INDIANAPOLIS -- — Nikola Jokic had a career-best 19 assists, while adding 18 points and nine rebounds, Aaron Gordon scored 25 points and the Denver Nuggets defeated the Indiana Pacers 125-116 on Monday night.\n\n\r\n              Michael Porter Jr. had 19 points and 11 rebounds, Christian Braun added 17 points and Jamal Murray scored 16 for Denver.\n\n\r\n              Myles Turner led Indiana with 23 points. Tyrese Haliburton had 19 points and 15 assists, Pascal Siakam scored 19 points and Aaron Nesmith 17.\n\n\r\n              The Nuggets shot 56% and held a 46-32 rebounding edge.\n\n\r\n              The Nuggets led by as many as 13 before settling for a 64-58 lead at halftime. The Pacers had trimmed the lead to 56-55 off a fast break dunk by Obi Toppin with 2:43 left in the second quarter. Denver followed with a 6-0 run to regain control.\n\n\r\n              Denver made 8-of-21 3-pointers while the Pacers were 14 of 43 from 3-point range.\n\n\r\n              Takeaways\r\n              Nuggets: Denver used a balanced attack to bounce back after the Los Angeles Lakers ended the Nuggets’ nine-game winning streak on Saturday.\n\n\r\n              Pacers: Indiana saw its three-game winning streak come to an end. The Pacers shot 47% but had trouble stopping Denver’s inside game. Indiana’s largest lead was two points in the first quarter.\n\n\r\n              Key moment\r\n              After the Pacers narrowed the deficit to 115-108, Gordon hit a 19-foot jumper and then Christian Braun scored on a layup from an alley-oop pass from Jokic.\n\n\r\n              Key stat\r\n              The Nuggets held a 74-46 edge of points in the paint.\n\n\r\n              Up next\r\n              The Nuggets are at Milwaukee on Thursday. The Pacers host Toronto on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998129.730668
}