{
  "game_id": "0021800430",
  "espn_id": "401071111",
  "date": "Dec 15, 2018",
  "matchup": "CHA vs. LAL",
  "headline": "James, Ball post triple-doubles in 128-100 win over Hornets",
  "body": "CHARLOTTE, N.C. --  Luke Walton was surprised to hear that LeBron James and Lonzo Ball were only the second Lakers teammates to record a triple-double in the same game.\n\n\"I know it's not easy. There have been a lot of good players in Lakers history and I figured Walton and Kobe (Bryant) would have done it a few times,\" joked Walton, a former small forward with the Lakers.\n\nJames had 24 points, 12 rebounds and 11 assists, while Ball had 16 points, 10 rebounds and 10 assists as Los Angeles routed the Charlotte Hornets 128-100 on Saturday night. The only other Lakers to accomplish the feat in the same game were Magic Johnson and Kareem Abdul-Jabbar on Jan. 22, 1982.\n\n\"It's crazy, man,\" Ball said. \"I watched a lot of him (LeBron) growing up and now we had triple-doubles in the same game. I don't even know if I dreamed of that before.\"\n\nAdded James: \"Any time you can put yourself in the conversation of Laker history, all the guys that have come through this franchise, it's pretty special.\"\n\nJames said he and Ball are \"one in the same\" when it comes to their playmaking ability.\n\n\"We are always looking for our teammates and that's the greatest satisfaction we can have when we see our teammates score the ball,\" James said. \"Always been pretty good rebounders for our positions. Him at the guard spot and me at the 4. ... We just try to be aggressive, attack the rim, make shots. We showed all that tonight.\"\n\nJames continued his dominance over Charlotte, improving to 27-1 in his last 28 games against Michael Jordan's franchise.\n\nHe was unstoppable throughout on penetration, helping the Lakers outscore the Hornets 40-17 in the third quarter and build a 30-point lead with his second triple-double of the season and 75th of his career. He did not need to play in the fourth quarter.\n\nBall played into the fourth quarter to earn his third career triple-double. He finished 7 of 11 from the field, helping hand the Hornets their worst loss of the season on the second night of a back-to-back.\n\nMiles Bridges had a career-high 17 points for the Hornets.\n\nTIP-INS\n\nLakers: Here's an example of the LeBron James factor: The crowd of 19,461 fans was the largest ever to see an NBA game at the Spectrum Center.\n\nHornets: Sideline analyst Stephanie Ready worked her last game for the Hornets and the team did a nice tribute to her on the scoreboard during the first half. Ready is moving on to take a new position outside the organization. ... Charlotte was outrebounded 52-28.\n\nHE BE JAMMING\n\nLance Stephenson was assessed a technical foul in the third quarter for playing the air guitar and taunting Miles Bridges after Stephenson buried a 3-pointer.\n\nBut Walton said the beat must go on for Stephenson.\n\n\"The air guitar, absolutely I'm OK with that,\" Walton said. \"He's been doing it and you can't take that away from the man. It's who he is. I tried once earlier this season and he just keeps doing it. That is what makes him is his competitive greatness and that is who he is.\"\n\nMcGEE PLAYS THROUGH FLU\n\nJaVale McGee was 9 of 10 from the field and had 19 points and six rebounds despite playing with the flu. He had a nurse with IV bags in his own private room before the game.\n\n\"I said that Tyson (Chandler) was starting if he can't go,\" Walton said. \"And right before the game they told me that JaVale wanted to give it a go, so we put him back in the starting lineup.\"\n\nWALKER ICE COLD\n\nHornets two-time All-Star Kemba Walker was held to a season-low four points on 2-of-13 shooting from the field. Once a front-runner for the league MVP, Walker is in the midst of a major shooting slump, making just 32.3 percent (34 of 105) of his shots from the field in the last six games.\n\nHornets coach James Borrego thinks Walker will be fine.\n\n\"He's had a couple of nights where he has struggled shooting the ball but he'll continue to shoot. We trust him,\" Borrego said. \"His confidence is still there. I think he'll kick it back into gear real soon. He's having to work a lot out there. The way teams are guarding him and the way he's having to defend. For whatever reason he just hasn't seen the ball go through the net right now. \"\n\nUP NEXT\n\nLakers: Visit Washington on Sunday.\n\nHornets: Host Cleveland on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994406.979115
}