{
  "game_id": "401810208",
  "espn_id": "401810208",
  "date": "Dec 06, 2025",
  "matchup": "DET vs MIL",
  "headline": "Milwaukee visits Detroit on 5-game road slide",
  "body": "Milwaukee Bucks (10-14, 10th in the Eastern Conference) vs. Detroit Pistons (18-5, first in the Eastern Conference)\n\n\r\n              Detroit; Saturday, 7:30 p.m. EST\n\n\r\n               Pistons -12.5; over/under is 223\n\n\r\n              BOTTOM LINE: Milwaukee will look to end its five-game road skid when the Bucks visit Detroit.\n\n\r\n              The Pistons are 4-3 against division opponents. Detroit scores 118.5 points and has outscored opponents by 5.2 points per game.\n\n\r\n              The Bucks are 3-3 against the rest of their division. Milwaukee gives up 117.7 points to opponents while being outscored by 2.5 points per game.\n\n\r\n              The Pistons average 118.5 points per game, 0.8 more points than the 117.7 the Bucks allow. The Bucks average 15.5 made 3-pointers per game this season, 2.2 more made shots on average than the 13.3 per game the Pistons allow.\n\n\r\n              The teams square off for the third time this season. The Bucks won 113-109 in the last meeting on Dec. 4. Kevin Porter Jr. led the Bucks with 26 points, and Tobias Harris led the Pistons with 20 points.\n\n\r\n              TOP PERFORMERS: Cade Cunningham is averaging 27.7 points, 6.4 rebounds, 9.2 assists and 1.6 steals for the Pistons. Jalen Duren is averaging 18 points and eight rebounds over the past 10 games.\n\n\r\n              Kyle Kuzma is shooting 50.0% and averaging 12.7 points for the Bucks. Bobby Portis is averaging 4.0 made 3-pointers over the last 10 games.\n\n\r\n              LAST 10 GAMES: Pistons: 7-3, averaging 118.9 points, 44.8 rebounds, 25.0 assists, 8.9 steals and 6.1 blocks per game while shooting 49.3% from the field. Their opponents have averaged 114.8 points per game.\n\n\r\n              Bucks: 2-8, averaging 110.7 points, 38.7 rebounds, 27.6 assists, 8.2 steals and 3.5 blocks per game while shooting 48.1% from the field. Their opponents have averaged 116.2 points.\n\n\r\n              INJURIES: Pistons: Marcus Sasser: day to day (hip), Bobi Klintman: day to day (ankle).\n\n\r\n              Bucks: Giannis Antetokounmpo: out (calf), AJ Green: day to day (shoulder), Taurean Prince: out (neck).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042766.8806999
}