{
  "game_id": "0022000954",
  "espn_id": "401307757",
  "date": "Apr 30, 2021",
  "matchup": "MIL @ CHI",
  "headline": "Bucks roll past Bulls 108-98 without injured Antetokounmpo",
  "body": "CHICAGO -- — Brook Lopez and Khris Middleton each scored 22 points, and the Milwaukee Bucks were good enough without Giannis Antetokounmpo to beat the Chicago Bulls 108-98 on Friday night.\n\n\r\n                    The Bucks hope Antetokounmpo won’t be sidelined for long after the reigning two-time MVP rolled his already sprained right ankle in the opening minute at Houston the previous night. They still managed to bounce back from a loss to the NBA-worst Rockets.\n\n\r\n                    “You gotta find ways to get wins,” coach Mike Budenholzer said. “The league is tough. The schedule's tough for everybody. It was good and I think important to get this game tonight.”\n\n\r\n                    The Bucks let a 19-point lead dwindle to two late in the first half. They bumped it back up to 17 entering the fourth and hung on for their 12th straight win against the Bulls.\n\n\r\n                    Middleton scored 10 points in the final quarter. Bobby Portis, starting with Antetokounmpo out, had 16 points and tied a season high with 14 rebounds. Jrue Holiday scored 16 to go with seven assists for Milwaukee, which is third in the Eastern Conference.\n\n\r\n                    “It's good Giannis isn't hurt too seriously,” Lopez said. “He's recovering, he'll be ready when he's ready. But it also gives us a chance to try a lot of different stuff offensively and defensively, so it's great to see Bobby get his looks, a little variety of how we get the ball to him, what situations we give it to him. We can mess with a lot of different combinations as well in that same vein.”\n\n\r\n                    Coby White led Chicago with 21 points. Nikola Vucevic added 17 points and 15 rebounds, though he made just 7 of 27 shots. Daniel Theis finished with 16 points and 10 boards as the Bulls fell three games behind Washington for 10th place in the Eastern Conference and the final spot in the play-in tournament.\n\n\r\n                    “It's not an ideal position,” Vucevic said. “At this point, all we can do is continue to try to look ahead, try to fix what we did wrong and try to win as many games as we can going forward. We understand that we don't really control our destiny. But we have to continue to fight.”\n\n\r\n                    SECOND-QUARTER SURGE\n\n\r\n                    The Bucks led by 19 about five minutes into the second quarter and were up 42-25 when Chicago went on a 15-0 run. Theis scored seven in a row during that stretch, and White hit a 3 to cut it to 42-40 with 2:36 remaining.\n\n\r\n                    Milwaukee reeled off six straight capped by Middleton's jumper before a driving Vucevic scored on a floater with a second left to make it 52-44 at halftime.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Budenholzer said Antetokounmpo's condition is improving and the Bucks will “see how he feels” Saturday. Their next game is against Brooklyn on Sunday. “Get another kind of day of rehab and work on it,” he said. “We'll just see with the early game on Sunday what it looks like, what it feels like.” Antetokounmpo has missed 10 games this season, including six in early April with an ailing left knee. ... The Bucks were also without F Donte DiVincenzo (sore right big toe).\n\n\r\n                    Bulls: The Bulls have not beaten the Bucks since Dec. 26, 2017 at Milwaukee. ... Coach Billy Donovan had no update on All-Star Zach LaVine, who remains in the the league's health and safety protocol, though he did sit on the bench. He missed his ninth game in a row. “I'll probably know a little bit more, I think, once we get through this weekend,” Donovan said.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: Host Brooklyn on Sunday.\n\n\r\n                    Bulls: Visit Atlanta on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997650.131933
}