{
  "game_id": "0021800837",
  "espn_id": "401071510",
  "date": "Feb 10, 2019",
  "matchup": "ATL vs. ORL",
  "headline": "Vucevic leds Magic to 3rd straight win, 124-108 over Hawks",
  "body": "ATLANTA --  Nikola Vucevic played like an All-Star. Jonathan Isaac turned one possession into his own personal block party. And the Orlando Magic picked off road victories on back-to-back nights for the first time in nearly five years.\n\nVucevic, who will be making his first All-Star Game appearance next weekend in Charlotte, scored 19 points and grabbed 12 rebounds to lead the Magic to a 124-108 victory over the Atlanta Hawks on Sunday night.\n\nDespite getting into Atlanta around 2:40 a.m. after a 20-point victory at East-leading Milwaukee the previous night, Orlando looked like the fresher team by far in recording its third straight victory, matching its best run of the season. The last time the Magic pulled off road wins on consecutive nights was April 3-4, 2014, when they defeated Minnesota 97-90 and Milwaukee 97-84.\n\n\"We really played well,\" Vucevic said. \"We took the lead and we never looked back.\"\n\nThe Magic began to pull away late in the first half, ripping off an 11-2 run that sent the road team to the locker room with a 63-48 lead -- its biggest of the game to that point. D.J. Augustin finished off the spurt, racing the length of the court after a couple of Atlanta free throws to lay one in with 1.2 seconds left.\n\nAtlanta's Trae Young hit a desperation shot from just inside the halfcourt line, but he clearly released the ball after the buzzer. That pretty much epitomized the night for the Hawks, who lost their third straight game at State Farm Arena -- giving up an average of 124 points in those defeats\n\n\"Our offense wasn't there too much,\" Atlanta's Kevin Huerter said. \"But I think our biggest problem is on the defensive end.\"\n\nOrlando kept up the onslaught after halftime, scoring 12 of the first 14 points and pushing the lead as high as 26 points in the third quarter. The Magic led 98-74 at the end of the period, sending plenty of fans to the exits.\n\nVucevic led seven players in double figures, including the entire starting five. Isaac and Evan Fournier each had 17 points.\n\nBut Isaac really shined at the defensive end -- especially during a single possession midway through the second quarter.\n\nWhen John Collins attempted to lay one in from right under the basket, Isaac got a hand on it. Collins snatched the offensive rebound, went up again -- and was stuffed again by Isaac.\n\nThe Hawks grabbed another offensive rebound, worked the ball around the perimeter before going inside a third time to Collins.\n\nYep, same result. Isaac got a hand on the ball for his third block in a span of roughly 10 seconds.\n\nIsaac finished with five blocks.\n\nOrlando came into the night 2 1/2 games behind Miami for the final playoff spot in the East. The Magic haven't made the playoffs since 2012.\n\n\"We're playing for something,\" Augustin said. \"Tonight was all about fighting, fighting through fatigue.\"\n\nAlex Len led the Hawks with 16 points, despite picking up four fouls in the first half.\n\nCORBIN HONORED\n\nDuring the first timeout of the game, the Hawks honored Orlando assistant Tyrone Corbin with a video tribute as part of Atlanta's 50th anniversary celebration marking the team's move from St. Louis before the 1968-69 season.\n\nCorbin played in 277 games over two separate stints with the Hawks in the 1990s, helping the team to four playoff appearances.\n\nLEN'S ROUGH PATCH\n\nThe Hawks center bounced back from a rough first half.\n\nFirst, he managed to pick up four fouls in just under 9 minutes of playing time.\n\nPerhaps more embarrassing for the 7-foot-1 Len, both of his shot attempts were blocked by a pair of 6-9 players. A short jumper was swatted away by Khem Birch and an attempted dunk was stuffed by Aaron Gordon.\n\nLen bounced back in the second half to shoot 4-of-5, including a pair of 3-pointers, and didn't pick up any additional fouls.\n\nNot that it mattered.\n\nTIP INS\n\nMagic: Eight players connected from beyond the 3-point arc, led by Isaac's 3-of-7 performance. ... Augustin had 10 assists to go with 14 points.\n\nHawks: The starting frontcourt had a rough night. Collins led the way with 15 points on 5-of-12 shooting, while Taurean Prince was held to eight points and Dewayne Dedmon managed only five. ... Atlanta was outrebounded 49-33.\n\nUP NEXT\n\nMagic: Travel to New Orleans to face the Pelicans on Tuesday night.\n\nHawks: Continue a seven-game homestand Tuesday against LeBron James and the Los Angeles Lakers.\n\n---\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 His work can be found at https://apnews.com/search/paul%20newberry\n\n---\n\nFor more AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995354.836127
}