{
  "game_id": "0021400310",
  "espn_id": "400578602",
  "date": "Dec 09, 2014",
  "matchup": "MEM vs. DAL",
  "headline": "Gasol scores 30, Grizzlies beat Mavericks 114-105",
  "body": "MEMPHIS, Tenn. --  The \"MVP!\" chants started as Marc Gasol stepped to the line for two free throws in the waning seconds.\n\nAfter the 7-foot-1 center from Spain sank both shots, the chants had grown louder and he had reached 30 points, helping the Memphis Grizzlies capture a 114-105 victory over the Dallas Mavericks on Tuesday night.\n\n\"I don't know who started it. It was funny,\" Gasol said of the chants. When prodded, he added that it was \"overwhelming.\"\n\nGasol was limited to only two points in Sunday's victory over Miami, and Memphis coach Dave Joerger wanted to get Gasol involved in the offense early. The result was 14 first-quarter points, including 6 of 7 from the free throw line.\n\n\"He didn't feel like he probably played a great game the other night,\" Joerger said. \"We tried to go to him early and feed off of him, and I thought it was pretty effective for our offense.\"\n\nGasol's inside play, coupled with 17 points and 13 rebounds from frontcourt mate Zach Randolph, helped Memphis dominate the paint 52-26. Memphis also committed just five turnovers.\n\nMike Conley added 22 points for Memphis, while Tony Allen scored 13. Gasol, who was 9 of 14 from the field and 12 of 13 from the line, said while the Grizzlies were successful with outside shooting in the Miami win, he prefers their identity of inside play.\n\n\"I would rather have one way and play out of that, instead of guessing and gambling on trying to be somebody we're not,\" said Gasol, who had six assists.\n\nDallas stayed within striking distance with 3-point shooting, connecting on 18 from long range. Chandler Parsons led the Mavericks with 30 points, going 10 of 18 from the field and 6 of 10 from 3-point range. Jameer Nelson had a season-high 18 points, while J.J. Barea finished with a season-best 17, including 12 in the fourth quarter as Dallas tried to rally.\n\nDevin Harris' long-range jumper pulled Dallas within 101-99 with 4:35 left.\n\nBut Memphis closed the game on a 13-6 run.\n\n\"We were battling, but we just gave up too many points,\" said Mavericks forward Dirk Nowitzki, who shot 4 of 17 and was held to 11 points. \".We gave up 114 to a team that's a slower team, a team that plays a grind-out kind of style. It's too many points.\"\n\nMonta Ellis, Dallas' leading scorer, was limited to two points, missing 10 of his 11 shots, while dealing with a sore right elbow.\n\nThe Mavericks held a 62-56 lead at the half, but coach Rick Carlisle noted Dallas lost its momentum in the third. Memphis went inside to Randolph, who had 13 points and nine rebounds in the frame.\n\nDallas shot 35 percent in the second half, and the 3-pointers were not as kind as they had been in the first half. Nowitzki missed all five of his shots from outside the arc after halftime.\n\n\"We stayed aggressive,\" Carlisle said. \"Everyone was trying to do the right things. I thought we fought hard. We just didn't get the ball in the basket enough.\"\n\nTIP-INS\n\nMavericks: Nowitzki has played in 1,209 games, tied with Dale Ellis for 28th on the NBA career list. ... Dallas, which matched its season high with 14 steals against Milwaukee last time out, managed four against Memphis. ... The Mavericks' 18 3-pointers were a season-best for a Memphis opponent.\n\nGrizzlies: The Grizzlies, who were 15-2 through November, are 2-2 in December. ...The Grizzlies avoided being swept by the three Texas teams in a week. Houston and San Antonio are the teams who have defeated the Grizzlies this month.\n\nELLIS' ELBOW\n\nEllis hurt his right elbow in Dallas' win Sunday over the Bucks. His 1-for-11 performance against Memphis was uncharacteristic for the Mavs' leading scorer at 21.2 points per game. \"It's been a tough situation,\" Carlisle said. \"Hopefully, it's more of a day-to-day thing.\" Carlisle couldn't predict Ellis' status for Wednesday's game against the Pelicans.\n\nGASOL FOR 30\n\nGasol's 30 points marked the fourth time this season he has reached that plateau. Before this season, Gasol had surpassed 30 only once in his first six seasons.\n\nUP NEXT\n\nMavericks: Host New Orleans on Wednesday.\n\nGrizzlies: Host Charlotte on Friday.",
  "source": "espn_api",
  "crawled_at": 1764992180.072212
}