{
  "game_id": "0021401201",
  "espn_id": "400579493",
  "date": "Apr 12, 2015",
  "matchup": "LAL vs. DAL",
  "headline": "Mavericks complete first 4-game season series sweep of Lakers",
  "body": "LOS ANGELES -- Tyson Chandler gave a kind smirk when he learned that the Dallas Mavericks had just swept a four-game season series with the Los Angeles Lakers for the first time in franchise history.\n\"Uh, the Lakers aren't having the best of seasons,\" he said. \"They've had some injuries.\"\nBesides, the Mavericks have bigger goals on their minds this month, starting with a 50-win season and culminating in their upcoming playoff trip.\nChandler had 20 points to lead seven Mavericks in double-figure scoring, and Dallas tuned up for the postseason with a 120-106 victory Sunday night.\n\nRichard Jefferson scored 17 points and Dirk Nowitzki had 16 in the third straight victory for the Mavericks, who will finish seventh in the Western Conference. Dallas led for the final 44 minutes in its 49th victory of the season, leaving the Mavs one win away from their first 50-win season since their 2011 championship team.\n\"It's just an opportunity for us to get tuned up heading into [the playoffs] next weekend,\" coach Rick Carlisle said. \"It's a good win for us. It gives us a chance for 50.\"\nThe Mavericks rested Devin Harris and Amar'e Stoudemire in a nod to their locked-in playoff position, but not to Friday's double-overtime game in Denver, according to Carlisle.\nJordan Clarkson had 26 points for the Lakers, who extended their team record with their 59th loss.\nWesley Johnson scored 16 points and hit four 3-pointers for Los Angeles before spraining his left ankle shortly before halftime. He didn't return, leaving the Lakers with nine healthy players in the second half of their sixth loss in seven games.\nAfter the game, the Lakers announced that rookie Dwight Buycks is out for the season with a broken bone in his right hand. With Jeremy Lin ruled out for the season before this game, the team is down to two healthy guards: Clarkson and fellow rookie Jabari Brown.\n\"I'm just shaking my head,\" coach Byron Scott said. \"It's just like, 'What could happen next?' But I don't want to dare ask that question. Hopefully, we've got seven or eight guys healthy for the next two games, and we can finish it out.\"\nJohnson is unlikely to play Monday in Sacramento, where the Lakers might suit up eight players.\nBuycks is the ninth Lakers player lost for the season with an injury. The Marquette product turned heads while playing under a 10-day contract that expired after this game.\nTIP-INS\nMavericks: F Chandler Parsons missed his fourth straight game with a right knee injury, but Carlisle said he could return soon. ... Isaiah Austin, the former Baylor star who missed out on an NBA career due to Marfan syndrome, took part in a half-court shot contest for charity before the fourth quarter. He laughed after shooting an air ball. ... Dallas has won three straight road games for the first time since early January.\nLakers: X-rays on Johnson's ankle showed no breaks. ... Tarik Black had 10 points and 19 rebounds, becoming the first Lakers rookie with 19 boards in a game since Leroy Ellis in 1963. ... Scott said Lin will miss the final three games with a sore left knee. ... Kobe Bryant and Nick Young watched the game from the Lakers' bench.\nHISTORY AND LOTTERY\nWith 18 losses in their past 23 games, the Lakers must win one of their last two games -- both against Sacramento -- to avoid the worst winning percentage in the 16-time champion franchise's history. They're guaranteed to have the worst home record in club history after dropping to 12-28. The Lakers (21-59) will head into the NBA draft lottery with the league's fourth-worst record. They have roughly an 83 percent chance of keeping their pick, which would go to Philadelphia if it's outside the top five.\nHELLO, RONDO\nRajon Rondo got 11 points, 11 assists, eight rebounds and a warm reception from Lakers fans, who covet the guard in free agency this summer. Rondo is Bryant's close friend and is thought to be interested in speaking to the Lakers. If this was an audition, both teams thought the star guard passed. \"Rondo was terrific,\" Carlisle said. \"Very aggressive, and I thought he did a good job on the boards, too.\"\n\"[Rondo] gets everybody involved,\" Clarkson said. \"He's not going to put up a bunch of shots. He's a good guard.\"\nUP NEXT:\nMavericks: At Utah on Monday night.\nLakers: At Sacramento on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764991954.322989
}