{
  "game_id": "0022400659",
  "espn_id": "401705225",
  "date": "Jan 27, 2025",
  "matchup": "LAC @ PHX",
  "headline": "Devin Booker scores 26 and the Suns survive a late scare to beat the Clippers 111-109",
  "body": "PHOENIX -- — Devin Booker scored 26 points, Kevin Durant added 24 and the surging Phoenix Suns survived a late scare for a 111-109 win over the Los Angeles Clippers on Monday night.\n\n\r\n              The Suns had a 103-90 lead with 5:06 left after Durant's 3-pointer, but the Clippers went on a late 10-0 run, cutting the deficit to 107-106 on Norman Powell’s short jumper with 40 seconds remaining. \n\n\r\n              Phoenix's Grayson Allen made two free throws with 10 seconds left for a 111-107 advantage, which was enough to close out the win.\n\n\r\n              The Suns have won nine of their last 12. Allen scored 18 off the bench while Tyus Jones added 17. Phoenix tied a season high with 22 3-pointers, making 46.8% of its shots from long range. \n\n\r\n              Ivica Zubac had 25 points and 16 rebounds for the Clippers. James Harden added 24 points and 10 assists, while Powell scored 23 points.\n\n\r\n              Los Angeles trailed 60-47 at halftime, but erased that deficit less than seven minutes into the third quarter, taking a 66-65 lead on Kawhi Leonard's one-handed jam. The Suns recovered to take an 83-78 advantage into the fourth.\n\n\r\n              Takeaways\r\n              Clippers: Los Angeles almost pulled out a stunner after trailing for the majority of the night. They did a lot of things right, but couldn't quite overcome the Suns' 3-point barrage.\n\n\r\n              Suns: It was a nice win despite the shaky moments during the final few minutes. Phoenix has sometimes struggled to generate 3-point opportunities this season, but had 47 shots from long range on Monday.\n\n\r\n              Key moment\r\n              Allen missed a free throw on purpose with 1.3 seconds left and the Clippers out of timeouts. Powell's full-court heave at the buzzer was way off.\n\n\r\n              Key stat\r\n              Booker and Jones both made five 3-pointers for the Suns.\n\n\r\n              Up next\r\n              The Clippers are at the Spurs on Wednesday. The Suns host the Timberwolves on Wednesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998032.4428601
}