{
  "game_id": "0022000681",
  "espn_id": "401307470",
  "date": "Mar 25, 2021",
  "matchup": "LAL vs. PHI",
  "headline": "Danny Green lights up Lakers for 28, Sixers win 109-101",
  "body": "LOS ANGELES -- — Danny Green hit eight 3-pointers and scored 28 points against his former team, and the Philadelphia 76ers weathered Los Angeles' late rally for their fourth straight victory, 109-101 over the slumping Lakers on Thursday night.\n\n\r\n                    Seth Curry scored 19 points and Tobias Harris added 17 for the Eastern Conference-leading Sixers, who have won 10 of 11 overall and seven of eight without injured All-Star Joel Embiid.\n\n\r\n                    Green hit six 3-pointers in the first 2 1/2 quarters and added a game-clincher with 30.4 seconds to play in the type of superb shooting performance he rarely achieved during his sole season with the Lakers, where he averaged 8.0 points over 89 starts.\n\n\r\n                    “Got a chance to see some of my brothers, compete against them, and there’s nothing better to come out with a win,” Green said.\n\n\r\n                    Green received his championship ring from the Lakers before the game along with Dwight Howard, who then got ejected after the first quarter. Green won back-to-back titles with Toronto and Los Angeles, but he still hasn't collected his 2019 ring from the Raptors because of the pandemic.\n\n\r\n                    When asked why he played so well against the team that traded him, Green replied: “Coincidence? Possibly. Probably.”\n\n\r\n                    The Lakers traded Green in the offseason to acquire Dennis Schröder, who had 20 points and a season-high 11 assists in Los Angeles' fourth consecutive loss.\n\n\r\n                    Playing without superstars LeBron James and Anthony Davis, the Lakers are on their second four-game skid since mid-February.\n\n\r\n                    Kyle Kuzma scored 25 points and Montrezl Harrell added 20, but the defending NBA champions remained winless since James sprained his ankle last Sunday. Kentavious Caldwell-Pope added 19 points.\n\n\r\n                    “We’re not trying to just hold on,” Harrell said. “We’re trying to compete, play the right way and win some basketball games. We’re in a tough patch right now. We’ve lost a couple of games, but we’re not going to stop, and we’re going to fight.”\n\n\r\n                    Philadelphia led by 18 points in the second half after dominating the third quarter, but the Lakers made a late 18-6 run to trim the margin to 102-98 with 2:20 to play.\n\n\r\n                    Los Angeles got within three points in the final minute before Green beat the shot clock with a sideline 3-pointer to ice it.\n\n\r\n                    “Each of the last three or four games, we’ve had one really bad quarter,” Lakers coach Frank Vogel said. “We need to prevent that and play a 48-minute night. We’re just having a stretch where we make some poor decisions and miss some assignments on the defensive end.”\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: They acquired George Hill from Oklahoma City and Ignas Brazdeikis from New York in a three-team trade, parting with Tony Bradley, Terrance Ferguson, Vincent Poirier, the rights to Emir Preldžić and a slew of draft picks. Hill is averaging 11.8 points per game for the Thunder with 38.6% 3-point shooting. “I think he's going to be great for us,” said Green, Hill's former teammate in San Antonio. ... Curry returned from a three-game absence with an ankle injury.\n\n\r\n                    Lakers: They failed to block a shot for the first time since Feb. 10, 2018, ending a streak of 224 straight games. ... The team played a tribute video and held a pregame moment of silence for Hall of Famer Elgin Baylor, who died Monday. ... Marc Gasol had five points in his first game for the Lakers since February following a nine-game absence under the NBA’s health and safety protocols.\n\n\r\n                    DWIGHT TOSSED\n\n\r\n                    Howard’s ejection prematurely ended his first game after collecting his ring. The journeyman center scored six points in the first quarter but was called for two separate technical fouls related to his lively battle in the paint with Harrell.\n\n\r\n                    “It was a very selfish play,” Philadelphia coach Doc Rivers sid. “You’ve got one tech. You can’t get another one. We just have to have better discipline. I get it. There’s a lot of emotion, but we had one center on our team, and he got thrown out. I know there’s emotion, but he’s a veteran. Got to have better discipline.”\n\n\r\n                    FANS IN STANDS\n\n\r\n                    The Lakers had a few dozen fans in the Staples Center stands for the first time this season after getting permission from the Los Angeles County Health Department to welcome no more than 50 people. The fans mostly watched quietly.\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: At Clippers on Saturday.\n\n\r\n                    Lakers: Host Cavaliers on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997298.343724
}