{
  "game_id": "401809777",
  "espn_id": "401809777",
  "date": "Nov 07, 2025",
  "matchup": "MIL vs CHI",
  "headline": "Antetokounmpo scores 41 points to help Bucks beat Bulls in NBA Cup title defense opener",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 41 points, 15 rebounds and nine assists and the Milwaukee Bucks opened their NBA Cup title defense with a 126-110 victory over the Chicago Bulls on Friday night.\n\n\r\n              The Bucks improved to 9-0 in the NBA Cup's group play stage during the event's three-year history. Milwaukee lost to Indiana in the semifinals two seasons ago and beat Oklahoma City 97-81 last year in the NBA Cup title game.\n\n\r\n              Antetokounmpo scored 19 points in the fourth quarter to help the Bucks pull away. He shot 16 of 32 from the floor, the first time this season he shot below 61.5%.\n\n\r\n              Milwaukee's Myles Turner had 23 points — his highest total since joining the Bucks this year — and Ryan Rollins added 20.\n\n\r\n              Matas Buzelis had 20 points and eight rebounds for Chicago. Josh Giddey had 16 points, 14 assists and seven rebounds for the Bulls.\n\n\r\n              Giddey had triple-doubles in his last two games. He’s the first Bulls player to have triple-doubles in consecutive games since Michael Jordan in April 1989.\n\n\r\n              Chicago had won its NBA Cup opener 135-125 over New York on Oct. 31.\n\n\r\n              The Bucks pulled ahead for good early in the third quarter and went on an 8-0 run to extend their lead to 112-99 with four minutes left.\n\n\r\n              Antetokounmpo started that spurt by hitting a 3-pointer, making him 7 for 13 from beyond the arc this season. Antetokounmpo then dunked on a pass from Rollins. Turner capped the run by driving into the lane and drawing a foul for a 3-point play.\n\n\r\n              The Bucks were playing without Taurean Prince, who has been part of the last two NBA Cup champions after playing for Milwaukee last season and the Los Angeles Lakers in 2023-24. Prince is dealing with a neck strain.\n\n\r\n              Chicago's Ayo Dosunmu returned to action and had seven points in 20 minutes after missing two games with a bruised quadriceps. \n\n\r\n              Up Next\r\n              Warriors: At Cleveland on Saturday night.\n\n\r\n              Bucks: Host Houston on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042579.812053
}