{
  "game_id": "0021900345",
  "espn_id": "401160987",
  "date": "Dec 09, 2019",
  "matchup": "TOR @ CHI",
  "headline": "Siakam scores 22, Raptors beat Bulls 93-92 to stop slide",
  "body": "CHICAGO --  The Raptors held off the Chicago Bulls and then turned their attention toward the superstar who led them to their first championship in his lone season with Toronto.\n\nIt figures to be quite a night on Wednesday when Kawhi Leonard visits Toronto for the first time since signing with the Los Angeles Clippers. The NBA Finals MVP will pick up his ring and probably get a warm welcome.\n\n\"I think it's going to be a good moment for him and I think he's going to be really, really happy to get his ring,\" Kyle Lowry said.\n\nThe Raptors were happy to leave Chicago with a victory on Monday night.\n\nPascal Siakam scored 22 points, and Toronto held on to beat the Bulls 93-92 when Zach LaVine missed a runner in the closing seconds.\n\nNorman Powell added 17 points, including six in the fourth quarter, and the defending NBA champions ended their first three-game skid since last November. After beating Chicago for the 11th straight time, their focus shifted toward Leonard and the Clippers.\n\n\"I would imagine that our fans are going to give him an amazing ovation,\" coach Nick Nurse said. \"If they give him one-fifteenth of what they gave us on opening night, it's still going to be something. It was really amazing the night we got ours.\"\n\nLaVine scored 20 for Chicago -- all in the first half. Wendell Carter Jr. and Daniel Gafford each had 14 points for the Bulls, who made just 12 of 46 3-pointers on the way to their sixth loss in eight games.\n\n\"I coach by faith,\" the Bulls' animated Jim Boylen said. \"I coach and teach every day on where I think we're gonna be. When that's gonna happen, when that's gonna break through, I'm not sure. But I'm gonna keep coaching that way.\"\n\nHe insisted the Bulls are making progress even though the losses continue to mount in a season when they expected to contend for a playoff spot. Some fans are staying away, leaving conspicuous empty seats.\n\nBoylen insisted the Bulls are playing \"good, hard basketball\" and simply need to win \"two or three more possessions.\"\n\n\"I'm not gonna let any negativity deter us from that mission,\" he added.\n\nRaptors guard Fred VanVleet missed the game because of a bruised right knee. Lowry scored 11 points in his third game after missing 11 in a row with a broken left thumb. The five-time All-Star made 1 of 8 3-pointers, and the Raptors hit 7 of 29 from beyond the arc.\n\nHANGING ON\n\nDenzel Valentine led the way as Chicago opened the fourth quarter with a 14-6 run that turned a 71-all tie into an 85-77 lead. He nailed a jumper, buried two 3-pointers and fed Gafford for two alley-oop dunks. But the Raptors responded by scoring nine straight, going ahead on Lowry's two free throws with 3:52 remaining.\n\nToronto was leading 89-87 when Chicago's Lauri Markkanen nailed a 3 with 1:45 left. Powell scored for Toronto and Gafford hit a layup to give Chicago a 92-91 lead. Then Lowry scored on a drive with 51 seconds remaining.\n\nThe Bulls had a chance to win in the closing seconds after an out-of-bounds call got overturned by replay review. Tomas Satoransky inbounded to LaVine, who missed a runner in traffic along the left side. Gafford was unable to control the rebound, and the ball bounced around as time expired.\n\nTIP-INS\n\nRaptors: Nurse said an MRI showed no structural damage on VanVleet. Averaging 18 points and seven assists, he left in the first half of a loss at Philadelphia on Sunday. ... Siakam scored 13 points in the first quarter.\n\nBulls: Chicago has not beaten Toronto since Feb. 14, 2017. ... Valentine scored a season-high 13 points. ... F Chandler Hutchison (right shoulder sprain) missed his sixth consecutive game. Boylen said Hutchison is not ready for contact in practice. ... Boylen said LaVine (shoulder) and G Coby White (hamstring) are playing through pain.\n\nUP NEXT\n\nRaptors: Host the Los Angeles Clippers on Wednesday.\n\nBulls: Host Atlanta on Wednesday.\n\n---\n\nMore AP NBA:  https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995636.7868009
}