{
  "game_id": "0021801218",
  "espn_id": "401071891",
  "date": "Apr 09, 2019",
  "matchup": "OKC vs. HOU",
  "headline": "George hits game-winner as Thunder rally to beat Rockets",
  "body": "OKLAHOMA CITY --  Oklahoma City's Paul George delivered the final blow against Houston's P.J. Tucker.\n\nGeorge hit the game-winning 3-pointer with 1.8 seconds left, and the Thunder rallied from 14 points down in the fourth quarter to beat the Rockets 112-111 on Tuesday night.\n\nIt was a physical matchup between George and Tucker, who at one point had to be separated during an altercation. George scored a hard-earned 27 points on 9-for-25 shooting. He savored the fact that he got his last bucket after Tucker failed to close out successfully on him in the corner.\n\n\"All I needed was a little space, and it's not a guy that's got great lift, so I was able to shoot right over him,\" George said.\n\nRussell Westbrook had 29 points, 12 rebounds and 10 assists for his 33rd triple-double of the season.\n\nThe Thunder won their fourth straight and moved into sixth place in the Western Conference standings with one game remaining. The Thunder play at Milwaukee on Wednesday. The Bucks are expected to sit their key players. The Thunder said that wouldn't matter.\n\n\"All in,\" George said. \"Last game of the year. Playing well. Picked up another big win tonight.\"\n\nJames Harden scored 39 points and Chris Paul added 24 for the Rockets, who slipped into the third spot in the conference standings in their regular-season finale after having their six-game win streak snapped.\n\n\"Not the way we wanted to end it, of course, but I think we are in a pretty good space,\" Harden said. \"We have been playing well. Defensively, we have been getting after it. Offensively, we have been knocking down shots. We are excited. We are ready.\"\n\nHarden scored 26 points in the first half to help the Rockets take a 60-51 lead.\n\nThe Rockets led 93-80 at the end of the third quarter. Oklahoma City rallied, and it hit another level after Westbrook returned from a rest in the fourth. His 3-pointer finally put the Thunder ahead 100-99.\n\nHouston regained the lead, but Westbrook hit a 3-pointer with 20.2 seconds left to cut the Rockets' lead to a point. Harden made two free throws at the other end to make it a three-point game. Westbrook dunked with 9.7 seconds left to trim Houston's lead to 110-109.\n\nHarden made the first and missed the second free throw at the other end with 9.4 seconds left to set up George's shot. Houston had one more chance after George's 3-pointer, but Harden missed a 3-pointer at the buzzer.\n\nIt was the kind of energy and drama that often comes with postseason basketball.\n\n\"The atmosphere was crazy,\" George said. \"It was crazy. It had a playoff kind of feel tonight. That was a good preview for the Western Conference.\"\n\nHarden was ready to move on after the game.\n\n\"This one is over, and now we prepare for something big,\" he said.\n\nTIP-INS\n\nRockets: Harden shot 4 for 11 in the first quarter and still scored 14 points. ... The Rockets shot 16 3-pointers and four 2-pointers in the third quarter. ... Houston made 18 of 53 3-pointers after setting the NBA record with 27 made 3s Sunday against Phoenix. ... Jeff Bzdelik coached in place of Mike D'Antoni, who had been hospitalized with an intestinal virus.\n\nThunder: C Steven Adams had nine rebounds in the first quarter and finished with 13. ... Terrance Ferguson scored 16 points for his highest-scoring game since Jan. 17. ... Westbrook was called for a Flagrant 1 early in the third quarter for running through Tucker. ... It was the 137th triple-double of Westbrook's career, leaving him one behind Magic Johnson for second all-time.\n\nQUOTABLE\n\nGeorge on Tucker's physical play: \"Yeah, it was some things called, some things wasn't.\"\n\nSTAT LINES\n\nWestbrook's averages during Oklahoma City's four-game win streak: 23.8 points, 12.5 rebounds, 15.3 assists.\n\nUP NEXT\n\nRockets: Will host a team to be determined in the first round of the playoffs.\n\nThunder: At Milwaukee on Wednesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994540.309865
}