{
  "game_id": "0021800288",
  "espn_id": "401070969",
  "date": "Nov 25, 2018",
  "matchup": "CHA @ ATL",
  "headline": "John Collins helps Hawks snap 10-game skid",
  "body": "ATLANTA --  John Collins was certain the ball would go to Kemba Walker, so it was just a matter of getting in position to alter his shot.\n\n\"We knew he was going to get to a strong right (move) and get to a step-back if he could,\" Collins said. \"He ended up going for the floater, and I timed it perfectly with the game-winning block.\"\n\nCollins had 23 points and 11 rebounds and swatted away Walker's runner in the lane as time expired, helping the Atlanta Hawks snap a 10-game losing streak with a 124-123 victory over the Charlotte Hornets on Sunday night.\n\nWalker, the NBA's second-leading scorer, hit a jumper to put Charlotte up by one with 48.2 seconds remaining, but he committed a shot-clock turnover on the next possession and finished 7 for 23 from the field for 22 points.\n\nKent Bazemore scored 20 points and hit the go-ahead basket for Atlanta, taking an inbound pass and driving past Dwayne Bacon for a layup with 4.6 seconds to go.\n\n\"They didn't really know what we were running,\" Bazemore said. \"Saw an opportunity to get back with my left hand and made a play.\"\n\nMalik Monk tied a career high with 26 points on seven 3-pointers, and Marvin Williams added a season-high 13 rebounds and chipped in 20 points for the Hornets.\n\n\"We're better than this, and I'm not taking anything away from them,\" Williams said. \"Coach preaches to us day after day that we have to protect the rim.\"\n\nCollins had three hard dunks in the fourth, the last one coming in front of Walker to make it 122-119 with 1:26 remaining. His athletic putback with 2:46 left kept Atlanta leading by two, but his biggest play was stopping Walker in the lane to help the rebuilding Hawks to a rare victory.\n\nThe Hawks began the game with NBA's worst record and had the league's worst defense during its 10-game skid, allowing an averaging of nearly 117 points. Charlotte was the ninth opponent to score at least 40 in the first quarter against Atlanta.\n\nTrae Young finished with 18 points, and the Hawks got 16 each from Taurean Prince and DeAndre' Bembry.\n\nCharlotte took its biggest lead at 13 on Bridges' layup in the first minute of the second quarter. The Hawks tied it at 60-all on Prince's 3 at the 2-minute mark. The Hornets were up one entering the third.\n\n\"They just flat-out put their heads down and drove right by us,\" Hornets coach James Borrego said. \"The second quarter was all about our poor transition defense.\"\n\nWalker was just 3 for 14 when he hit a 3 to make it 82-73 midway through the third. The Hawks tied it at 84-all a couple of minutes later when Young fed Collins for a one-handed dunk, and Borrego called timeout. After Walker followed with an airball 3, Collins hit a layup for the Hawks' first lead since midway through the first.\n\nBembry's layup made it 100-92 for Atlanta's biggest lead.\n\nThe teams took a combined 84 3-point attempts. Walker, Williams and Young each hit four.\n\nTIP-INS\n\nHornets: G Tony Parker missed his second straight game with a rib contusion, but Borrego had him in uniform to provide leadership. It's a relationship of mutual respect. Borrego, in his first season with Charlotte, was a San Antonio assistant for 10 seasons of Parker's 17-year career with the Spurs. During an official timeout early in the fourth, Parker was animated as spoke to the players who were headed back to the floor before Borrego and his staff walked over. ... F Michael Kidd-Gilchrist missed his sixth straight game with a right ankle sprain, but Borrego thinks he's close to returning and could play when Charlotte opens a four-game homestand Monday. Kidd-Gilchrist has averaged 8.6 points and 5.9 rebounds in 13 games.\n\nHawks: Rookie G Kevin Huerter made his third start, this time in place of Bazemore, who was listed as questionable with a left ankle sprain. Huerter scored four points in 22 minutes. Bazemore had started every game this season. \"We have a lot of young guys and as a veteran you've got to give yourself up sometimes,\" he said. \"It's a good opportunity to shake things up. We'd been through 19 games, and it just wasn't working. Sacrifice yourself sometimes, and look, the basketball gods took care of me.\"\n\nUP NEXT\n\nHornets: Host Milwaukee on Monday night.\n\nHawks: At Miami on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994421.794518
}