{
  "game_id": "0021900145",
  "espn_id": "401160787",
  "date": "Nov 11, 2019",
  "matchup": "TOR @ LAC",
  "headline": "Leonard leads Clippers past Raptors in 1st game vs old team",
  "body": "LOS ANGELES --  Kawhi Leonard wasn't at his best against his former team. His new teammates knocked down big shots and won anyway.\n\nLeonard struggled on 2-for-11 shooting and had nine turnovers, but Lou Williams led a big effort from the bench with 21 points and the Los Angeles Clippers beat the defending NBA champion Toronto Raptors 98-88 on Monday night.\n\nLeonard finished with 12 points, 11 rebounds and nine assists to go with those nine turnovers, prompting Clippers coach Doc Rivers to joke about \"almost a quadruple-double.\"\n\nThroughout the game, Leonard faced plenty of double coverage.\n\n\"As soon as I walked across half-court they tried to get the ball out of my hands,\" he said. \"They did a great job on me defending and sending an extra body. It got me better and it's going to get my teammates better.\"\n\nLast season, Leonard led the Raptors to their first championship, averaging 30.5 points and 9.1 rebounds in 24 postseason games to earn his second Finals MVP award.\n\n\"I had a great time there. It's the next chapter now. I can't live in the past,\" he said. \"I'm with a different team and they want to have that same feeling.\"\n\nThe Clippers shot just 37% but dominated the boards 66-38, led by 12 each from Patrick Beverley and JaMychal Green.\n\nLos Angeles' bench outscored Toronto's reserves 56-35, with Montrezl Harrell adding 14 points and 11 rebounds and Green posting 10 points and 12 rebounds.\n\nLeonard's first five points all came on free throws, including two technicals. He missed his first six field goal attempts and finally scored on a coast-to-coast layup midway through the third quarter to put the Clippers up 62-55.\n\nFrom there, the Raptors outscored Los Angles 23-11 the rest of the period. Pascal Siakam had seven points and Fred VanVleet added five in the spurt as neither team led by more than two until Matt Thomas' 3-pointer and basket sent the Raptors into the fourth leading 78-73.\n\n\"It's just fun, just be able to compete against guys who you were with last year,\" Leonard said. \"It's a little bit more competitive because you do talk to them.\"\n\nNot much, though.\n\n\"Maybe whispered a little bit to him here or there about missing a free throw,\" Fred VanVleet said, \"but it didn't work.\"\n\nSiakam had 16 points and 10 rebounds, Norman Powell added 15 points and VanVleet had 14 points for the injury-depleted Raptors, who had their three-game winning streak snapped in the second game of a back-to-back after beating the Lakers on Sunday.\n\n\"That's a hell of a team to play on a back-to-back short-handed,\" VanVleet said. \"Just kind of ran ourselves into the mud and give those guys credit, they closed it out.\"\n\nVanVleet was 1 for 7 in the fourth after notching three double-doubles in his previous five games.\n\nToronto was 4 of 24 from the floor in a fourth quarter that featured a series of mad dashes and bodies piled in the paint on both ends.\n\nThe Raptors tied the game for the last time at 82 on Chris Boucher's 3-pointer. They managed just three field goals the rest of the way.\n\n\"Our guys played their guts out. We totally outplayed them,\" Raptors coach Nick Nurse said. \"We were playing harder, executing better, creating a lot of problems for them but just not quite enough.\"\n\nIN YOUR EYE\n\nRaptors starting forward OG Anunoby got poked in the right eye by Leonard while scrambling for a rebound two minutes into the game and didn't return. Anunoby's eye was patched after the game and he'll see a doctor on Tuesday. Nurse was asked about Anunoby getting called for a foul on the play. \"The guy lost both his contacts and cut his eye open with blood,\" he said. \"Are you kidding me?\" Leonard said he would text Anunoby to see how he's doing.\n\nHE SAID IT\n\n\"I could complain about officiating if you guys want to pitch into the fine pool.\" -- VanVleet to reporters.\n\nTIP-INS\n\nRaptors: They were without G Kyle Lowry (broken left thumb) and F/C Serge Ibaka (right ankle sprain), who both got hurt Friday at New Orleans. Lowry will be re-evaluated in two weeks, while Ibaka is out indefinitely.\n\nClippers: Starting G Landry Shamet went down near the baseline late in the third and had to be helped off the court after spraining his ankle. He was on crutches afterward. ... Los Angeles improved to 6-1 at home.\n\nHONORING GEORGE\n\nPaul George had his No. 24 jersey retired at Fresno State, where Clippers owner Steve Ballmer and some of his current teammates surprised him.\n\nGeorge was honored at halftime of Sunday's 77-74 victory over Winthrop in front of 8,529 fans. He and former Bulldogs coach Jerry Tarkanian are the only basketball jerseys to be retired by the school, where George played from 2008-10 before leaving early for the NBA draft.\n\n\"We walked in and he was shocked to see us,\" Rivers said. \"A really cool thing. It was great for Paul.\"\n\nBeverley, Shamet, Jerome Robinson and Ivica Zubac were aboard the short flight arranged by Ballmer.\n\n\"My plane was broke,\" joked Rivers.\n\nUP NEXT\n\nRaptors: Visit the Portland Trail Blazers on Wednesday in the fourth of five road games, tying their longest trip of the season.\n\nClippers: At the Houston Rockets on Wednesday to start a quick two-game trip that ends in New Orleans.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995655.917984
}