{
  "game_id": "0022400276",
  "espn_id": "401704842",
  "date": "Nov 24, 2024",
  "matchup": "BKN @ SAC",
  "headline": "Cam Thomas scores 34 points and Nets beat Kings 108-103",
  "body": "SACRAMENTO, Calif. -- — Cam Thomas scored 34 points and the Brooklyn Nets beat the Kings 108-103 on Sunday night in Nets coach Jordi Fernandez's return to Sacramento.\n\n\r\n              Fernandez served as the Kings’ associate coach the last two seasons under his mentor, Sacramento coach Mike Brown.\n\n\r\n              The Nets' 19-point first-half lead evaporated, but with the score tied at 88-all after three quarters, they held the Kings to 15 points in the fourth.\n\n\r\n              With the Nets up 107-102, neither team made a field goal in the last two minutes, with the Kings missing their last five attempts. \n\n\r\n              Thomas had nine points in the fourth.\n\n\r\n              De’Aaron Fox led the Kings with 31 points.\n\n\r\n              Brooklyn was without starting guard Dennis Schroder (right ankle soreness), and forward Noah Clowney, who had 18 points, left the game in the fourth quarter with an apparent left ankle injury. Malik Monk (right ankle sprain) missed his seventh straight game for the Kings.\n\n\r\n              Takeaways\r\n              Nets: A young Nets team showed resilience in answering in the fourth quarter after blowing the lead. Brooklyn's bench outscored Sacramento's bench 44-9.\n\n\r\n              Kings: The Kings have made a habit of having to come back in games this season. Brown said before the game that while his team is resilient, he would like them to build on early leads by “hitting a single” rather than going for the “home run three.” \n\n\r\n              Key moment\r\n              The Nets went on a 15-4 run after trailing 94-90 early in the fourth quarter. Cam Johnson and Jalen Wilson hit threes on consecutive possessions to give Brooklyn a 105-98 lead with four minutes left.\n\n\r\n              Key stat\r\n              The Nets made a season-high 13 3-pointers in the first half and were 48.7% (19 of 39) in the game.\n\n\r\n              Up next\r\n              Both teams were on the front end of a back-to-back. The Kings host the Thunder on Monday night while the Nets will play at the Warriors.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997997.706378
}