{
  "game_id": "0022300350",
  "espn_id": "401584978",
  "date": "Dec 18, 2023",
  "matchup": "IND vs. LAC",
  "headline": "Harden, Leonard and George lead Clippers to 151-127 rout of Pacers for eighth straight win",
  "body": "INDIANAPOLIS -- — Kawhi Leonard and Paul George did most of the Los Angeles Clippers' heavy lifting.\n\n\r\n              Then, with the game out of reach in the fourth quarter, James Harden took over.\n\n\r\n              Harden scored 21 of his season-best 35 points in the fourth, and the Clippers got 28 points from Leonard and 27 from George to rout Indiana 151-127 on Monday night for their league-best eighth consecutive victory.\n\n\r\n              “It was fun to watch,” Leonard said when asked about Harden's late flurry.\n\n\r\n              The Clippers have been playing must-see basketball lately, winning five of their last six by double digits. They're on the franchise's longest winning streak since 2015-16 when they won 10 straight, and on Monday, they posted the fourth-highest scoring total in franchise history, and the highest this season.\n\n\r\n              Los Angeles put on its latest show against the NBA's second-worst scoring defense. Meanwhile, the Pacers' usually turbo-charged offense appeared to be a step slow after returning from a 12-day trip that took them through time zones.\n\n\r\n              Bennedict Mathurin had a season-high 34 points to lead Indiana. Isaiah Jackson scored 15 points while starting in place of injured two-time NBA blocks champion Myles Turner.\n\n\r\n              All-Star guard Tyrese Haliburton had an off night after missing Saturday’s game with a bruised knee. He had eight points, 11 assists and four turnovers.\n\n\r\n              But it was the inability to defend, again, that riled up Pacers coach Rick Carlisle.\n\n\r\n              “We've got a huge target on our back because of wining some games in the tournament, so the Pacers aren't sneaking up on anyone,” Carlisle said. “But our mindset, if it's shifted to just simply trying to outscore teams and away from any kind of emphasis defensively, that's got to stop and if it means massive lineup changes, that's what will happen.”\n\n\r\n              George again tormented his former team and the fans who routinely boo him each time he’s come back since forcing Indiana to trade him in the summer of 2017. He is averaging 36 points in his last five games at Indiana.\n\n\r\n              Initially, the Pacers looked fine as they built 51-46 lead midway through the second quarter.\n\n\r\n              But it didn’t last. Los Angeles seized control with a 21-6 spurt to take a 67-57 lead, led 77-66 at the half and pulled ahead 114-94 after three. Indiana never recovered.\n\n\r\n              Harden made sure of it by going 12 of 16 from the field and 8 of 11 on 3-pointers with nine assists in his most efficient performance since being acquired from Philadelphia in October.\n\n\r\n              “We're not trying to play the score,” Leonard said. “We're trying to win the quarters. And even if we have 20 points, we've still got to do our jobs and be efficient.”\n\n\r\n              The Pacers held a pregame tribute for two-time ABA champion George McGinnis, who died Thursday, with a highlight reel and a moment of silence.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Hope to extend their streak Wednesday night at Dallas.\n\n\r\n              Pacers: Host Charlotte on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996200.8457139
}