{
  "game_id": "0022400016",
  "espn_id": "401703385",
  "date": "Nov 15, 2024",
  "matchup": "HOU vs. LAC",
  "headline": "Jabari Smith Jr. has season-high 28 points as Rockets rout Clippers 125-104 in NBA Cup play",
  "body": "HOUSTON -- — Jabari Smith Jr. had a season-high 28 points with five 3-pointers and the Houston Rockets never trailed in a 125-104 rout of the Los Angeles Clippers on Friday night in their NBA Cup opener.\n\n\r\n              It was Houston’s season-high fourth straight victory and the team’s second straight over the Clippers after getting a 111-103 win Wednesday night.\n\n\r\n              The Rockets led comfortably throughout and used a big run in the third quarter to enter the fourth leading by 19.\n\n\r\n              Fred VanVleet added 18 points and 10 assists for Houston and Dillon Brooks scored 17. \n\n\r\n              James Harden had 21 points for the Clippers, who lost their third straight after winning their previous four. He made three 3-pointers to move into a tie with Ray Allen (2,973) for second-most career 3-pointers behind Stephen Curry, who entered Friday with 3,779. \n\n\r\n              Takeaways \r\n              Clippers: Los Angeles was flat in its two games in Houston after its season-long winning streak. They’ll need to regroup and find a way to get more production from their starting lineup while they await the return of Kawhi Leonard. He hasn’t played this season while rehabilitating his right knee. \n\n\r\n              Rockets: Tari Eason and Amen Thompson again gave Houston a boost off the bench. The two combined for 29 points after scoring 18 each in Wednesday’s win.\n\n\r\n              Key moment \r\n              The Clippers used a 6-2 run to get within 12 with about eight minutes left in the third quarter before Houston scored the next nine points to extend the lead to 79-58. Brooks started that run with a 3 before VanVleet found Jalen Green for an alley-oop dunk. \n\n\r\n              Key stat \r\n              The Rockets had 20 fast-break points to just eight by the Clippers. \n\n\r\n              Up next \r\n              The Rockets visit Chicago on Sunday night and the Clippers host Utah that night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997411.0310762
}