{
  "game_id": "0021800679",
  "espn_id": "401071355",
  "date": "Jan 19, 2019",
  "matchup": "CHA vs. PHX",
  "headline": "Walker scores 21 points to help Hornets rout Suns 135-115",
  "body": "CHARLOTTE, N.C. --  Coach James Borrego has been preaching defense to his Charlotte Hornets the last two weeks.\n\nBut on Saturday the Hornets turned up the heat on the other end of the court, getting off to a blistering start and matching a season high in points scored in a 135-115 win over the Phoenix Suns.\n\nAll-Star hopeful Kemba Walker led a balanced scoring attack with 21 points, Jeremy Lamb hit five three-pointers and had 18 points as the Hornets won their third straight game.\n\nCharlotte shot 54.5 percent from the field and made 16 of 34 3-point attempts in the wire-to-wire victory.\n\n\"It started with our defense,\" Lamb said. \"We got stops and were able to get out in transition and get some easy ones. And we moved the ball well tonight.\"\n\nCharlotte had 31 assists -- six each by Lamb and Nic Batum -- much to the delight of Borrego.\n\n\"Our ball movement was great,\" Borrego said. \"When we move the ball like that we are a dangerous offense.\"\n\nDevin Booker had 32 points and 11 assists for the Suns. They have lost 10 of their last 12 and fell to 4-19 on the road.\n\nThis one was never close.\n\nThe Hornets raced to a 29-11 lead, making 10 of 14 shots from the field behind the backcourt duo of Walker and Lamb. They combined for 18 points in the quarter on 7-of-10 shooting. Charlotte extended its lead to 23 by the end of the third quarter.\n\n\"Yeah, they just hit us right in the mouth,\" Suns coach Igor Kokoskov said. \"It was their first punch right to the head. By the time we figured out what was going on, we were down 20 (points). .. Every cut they were making, screens they were setting, everything had a purpose. They were sharper and also had more energy than we did.\"\n\nTIP INS\n\nSuns: Once again started three rookies in Mikal Bridges, Deandre Ayton and De'Anthony Melton. .. After an early dunk by Biyombo over Ayton, Booker yelled \"Get big!\" at his teammate.\n\nHornets: Honored former Hornets small forward Glen Rice at halftime as part of their 30-year anniversary celebration. Rice is the team's career leader in 3-point percentage and is the only Hornets player to play in three All-Star games. An emotional Rice said \"Wow! Wow! Wow!\" while he stood at midcourt after being given a key to the city, and told fans, \"I hope I made you proud.\"\n\nBIG EFFORT FROM BIGS\n\nBismack Biyombo had 11 points and 13 rebounds, and Willy Hernangomez added nine points and 13 rebounds to help the Hornets outrebound the Suns 53-26 despite playing without injured starting center Cody Zeller.\n\nBorrego praised Biyombo's effort as \"fantastic.\"\n\nKokoskov said the Suns got caught in too many switches on defense.\n\n\"When we switch, that's your guy and you have to compete every possession with your guy, so a lot of times it was a mismatch,\" Kokoskov said. \"It comes down to the collective responsibility on the boards, so you have to stay with your guy and compete with him.\"\n\nCONSISTENCY NEEDED\n\nForward Kelly Oubre Jr. said the Suns need more consistency, something that will come with more playing experience. Starting three rookies adds to that inconsistency.\n\n\"A lot of times it's up and down because we're still learning and growing, so I feel as if once we lock in on the little details of being great, everything else will follow suit,\" Oubre said.\n\nBRIDGES DUNK CONTEST?\n\nHornets teammates say they want to see rookie Miles Bridges in the dunk contest at next month's NBA All-Star weekend here in Charlotte, North Carolina. While he's still improving as a player and has a lot to learn, the athletic Bridges has put together quite a highlight reel of high-flying dunks.\n\n\"Of course, he should definitely be in there,\" Lamb said.\n\nBridges said he is looking forward to having a chance to compete, but said he hasn't heard anything definitive from the league.\n\nTAKING CHARGE(S)\n\nWalker isn't just a scorer for the Hornets. The 6-foot-1, 184-pound Walker has shown he'll do anything to win, including taking 15 charges this season -- tied for fifth-most in the NBA. He drew another in the third quarter against the Suns.\n\nUP NEXT\n\nSuns: At Minnesota on Sunday night.\n\nHornets: At Indiana on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994386.7316322
}