{
  "game_id": "0021500851",
  "espn_id": "400828738",
  "date": "Feb 24, 2016",
  "matchup": "LAL @ MEM",
  "headline": "Barnes scores  25 as Grizzlies beat Lakers 128-119",
  "body": "MEMPHIS, Tenn. --  The Grizzlies stole the spotlight from Kobe Bryant's last game in Memphis with their biggest offensive performance of the season.\n\nMatt Barnes recorded a season-best 25 points, the Grizzlies had season highs in scoring and 3-pointers made while leading from start to finish in a 128-119 victory over the Los Angeles Lakers on Wednesday night.\n\n\"It's a lot different,\" Memphis guard Mike Conley, who had 24 points and eight assists, said of the Grizzlies' offense. \"We're taking the wide-open shot. We're not just settling. ... I think everybody's having a lot of fun. And, as you can see, when you have fun, we put up points.\"\n\nSix Grizzlies finished in double figures as Memphis finished 13 for 27 on 3s. P.J. Hairston had 17 points for Memphis, including going 4 of 7 from beyond the arc.\n\n\"I thought, by and large, we made a lot of shots,\" Memphis coach Dave Joerger said. \"Mike Conley shot the ball really well and kept us under control. Matt Barnes obviously had a great night. P.J. made some shots.\"\n\nJordan Clarkson scored 21 of his 28 points in the second half to lead the Lakers, who lost their seventh straight. D'Angelo Russell and Lou Williams added 22 points each. Julius Randle had 11 points and 14 rebounds.\n\nBryant finished with 13 points on 5-for-14 shooting -- including 2 for 7 on 3s.\n\nGrizzlies fans gave the Lakers' star a standing ovation and chanted \"Ko-Be!\" several times, the last when he left the game with a wave to the crowd with 1:03 remaining.\n\nBryant said the farewell tour, such as the last stop in Memphis, is about giving fans an opportunity to see him one last time.\n\n\"You say `thank you' to the fans,\" Bryant said. \"Let the fans know how much I have appreciated you guys over all these years.\"\n\nHe later added: \"Hopefully, the fans can feel how thankful I am for them.\"\n\nThe Grizzlies built an early 15-point lead, hitting seven of their first 10 shots, including three 3s. Bryant hit his first shot -- a 3 -- but missed his next three attempts.\n\nMemphis held a 67-58 lead at the break.\n\nLos Angeles never really threatened in the second half. In the fourth quarter, the Lakers pulled within nine on three occasions.\n\nBut by the time Bryant entered the game one last time with just under 5 minutes left, Memphis held its largest lead at 19. Bryant made a 3-pointer a short time later to pull the Lakers to 120-107.\n\nAfter that, Memphis had enough of a buffer to close out the game, the final nine-point margin coming when Russell hit a 3-pointer -- the Lakers' 17th of the night -- in the closing seconds.\n\nLakers coach Byron Scott said Memphis' scoring was indicative of his team's recent performance.\n\n\"The last three games especially, we just haven't been able to guard anyone,\" Scott said. \"Teams are pretty much scoring at will.\"\n\nTIP-INS:\n\nLakers: Rookie F Larry Nance Jr., who injured his right knee in the Lakers' last game Monday at Milwaukee, played just under 15 minutes and finished with three points. .Russell had a career-high eight assists. .Randle collected his 24th double-double of the season. .Clarkson has 27 straight games in double figures\n\nGrizzlies: G/F Tony Allen missed his second straight game with a sore left knee. ... With a rebound in the second quarter, Randolph passed Johnny Green (9,083) for 48th in career rebounds. ... Vince Carter (nine points) passed Charles Barkley (23,757) for 24th in career points scored. ... Memphis' previous high for points in a game this season was 120 against Oklahoma City on Nov. 16.\n\nBRYANT IN MEMPHIS\n\nBryant has scored more points against the Grizzlies (1,616) than any other opponent in franchise history. He also scored 60 points against Memphis on March 22, 2007, a record for an NBA player at FedExForum.\n\nDOMINATING THE SERIES\n\nThe victory was the eighth straight for Memphis over the Lakers, the longest such stretch against Los Angeles in franchise history. The average margin of victory in those games is 8.0 points.\n\nUP NEXT\n\nLakers: Host Memphis on Friday.\n\nGrizzlies: At the Los Angeles Lakers on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994259.671932
}