{
  "game_id": "0021601113",
  "espn_id": "400900508",
  "date": "Mar 29, 2017",
  "matchup": "MIL @ BOS",
  "headline": "Bucks fend off late Celtics rally in 103-100 win",
  "body": "BOSTON --  The Boston Celtics were hesitant to celebrate after ascending to the top spot of the Eastern Conference standings earlier this week.\n\nAnd just like that, they dropped back into second.\n\nGiannis Antetokounmpo had 22 points and nine rebounds, and the Milwaukee Bucks knocked Boston out of the top spot with a 103-100 victory on Wednesday night.\n\nMalcolm Brogdon, one of the leading contenders for NBA Rookie of the Year, finished with 16 points and nine assists. He had six key points in the final 2:46 to help Milwaukee fend off a late Boston charge.\n\nThe Bucks (39-36) have won five of six, including four straight on the road. Currently the sixth seed, they moved a full two games ahead of seventh-place Miami, and now have the same record as fifth-place Atlanta.\n\nThe 24-year-old Brogdon said his confidence comes from the trust veterans Antetokounmpo, Khris Middleton, and Greg Monroe have shown in him.\n\n\"Tonight the ball was in my hands at the end of the game,\" Brogdon said. \"It takes a lot of character and will to win more than anything to have it in a rookie's hands at the end of the game.\"\n\nBoston (48-27) had won four in a row. The loss dropped the Celtics percentage points behind idle Cleveland.\n\n\"It's just a loss,\" center Al Horford said. \"I feel like they jumped on us early, we fought our way back ... and we just couldn't make plays down the stretch.\"\n\nAfter playing from behind most of the night, Boston had a chance to tie the game in the closing seconds, but couldn't get a clean inbounds pass. Marcus Smart managed only a wild air ball as time expired.\n\nIsaiah Thomas led the Celtics with 32 points. Avery Bradley added 12 points and 10 rebounds.\n\nThe Celtics trailed throughout the fourth quarter before Marcus Smart got free for a driving layup to tie it at 93 with 2:46 left.\n\nBut the Bucks responded with an 8-3 run, led by two baskets and two assists by Brogdon.\n\nThomas scored four straight to get Boston within one, but Brogdon came through again -- this time with a fallaway jumper over Bradley with the shot clock winding down -- to make it 103-100 with just 3.9 seconds left.\n\nTIP-INS\n\nBucks: Had an 11-0 run early in the second quarter and led by as many as 14 in the first half.\n\nCeltics: With his layup in the closing seconds of the first half, Thomas became just the sixth Celtic ever to score 2,000 points in a single season. He also extended his streak with at least one 3-pointer to a franchise-best 50 straight games. ... Thomas picked up his 13th technical foul of the season in the first quarter. ... Smart's technical was his eighth of the season.\n\nPHYSICAL PLAY\n\nAttitudes flared just before halftime when Smart and Middleton collided in midair while trying to corral a loose ball. Both walked away bloodied on the play, and after Smart was initially called for a foul he also received a technical for something he said to an official.\n\nAfter a review the personal foul was changed, and charged to Middleton.\n\nPROSPECT WATCH\n\nGuerschon Yabusele, who was selected by Boston with the 16th overall pick in last June's draft, has joined its D-League affiliate Maine Red Claws and is expected to get his first action there on Friday. Yabusele, from France, was one of two players the Celtics chose to draft and place in leagues overseas last year.\n\n\"I think this is a great opportunity for him,\" Celtics coach Brad Stevens said. \"It's more for him to be around (coach Scott Morrison) and his staff. This is totally for him. It's not an evaluation for us.\"\n\nUP NEXT\n\nBucks: Host the Pistons on Friday.\n\nCeltics: Look for season sweep when they host the Magic on Friday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764995130.710426
}