{
  "game_id": "0021900232",
  "espn_id": "401160874",
  "date": "Nov 23, 2019",
  "matchup": "MEM vs. LAL",
  "headline": "LeBron James scores 30 as Lakers hold off Grizzlies 109-108",
  "body": "MEMPHIS, Tenn. --  LeBron James and the Los Angeles Lakers knew they would be tired playing their second game in as many nights.\n\nExperience made the difference against the young and rested Memphis Grizzlies.\n\nJames scored on a driving layup with 1:30 left to put Los Angeles ahead to stay as the Lakers held off the Grizzlies 109-108 on Saturday night for their seventh straight victory.\n\n\"We just kept our composure,\" James said. \"That's what we do. We are a very resilient team.\"\n\nThe Grizzlies had a final chance with the ball and 1.3 seconds left. Jaren Jackson Jr. went sprawling trying to corral Kyle Anderson's inbounds pass.\n\n\"I was going to catch it and see if I had time to get a shot off or hit Ja (Morant), who would've probably been running full speed right next to me,\" Jackson said. \"Obviously, we didn't get to do all that.\"\n\nJames finished with 30 points. Anthony Davis added 22, Rajon Rondo had 14, Kentavious Caldwell-Pope scored 12 and Dwight Howard had 10.\n\nMorant led Memphis with 26 points. Jae Crowder added 21, Jackson finished with 20, Dillon Brooks had 12 and Anderson scored 10, making rookie coach Taylor Jenkins very proud.\n\n\"If we can play like that every night, we have ourselves a chance,\" Jenkins said.\n\nThe Lakers showed the effects of winning in Oklahoma City on Friday night. James made clear on social media he had trouble getting a nap with their hotel across the street from the FedExForum, where No. 16 Memphis beat Mississippi 87-86 earlier Saturday.\n\n\"We're lucky to get out of here with a win. Credit to the Grizzlies for coming out strong,\" said Lakers coach Frank Vogel, who used earplugs to help him rest. \"There young guys really came after us, in the first quarter in particular. Morant and Jackson are special talents and they put us in a hole.\"\n\nLA never led in the first half and trailed by as much as 15 in the second quarter. The Lakers got going in the third and opened the fourth by jumping out to their biggest lead at 94-87.\n\nThe Grizzlies led 105-100 on a tip-in by Brandon Clarke with 3:24 to go. The Lakers scored the next nine with James hitting his layup for the go-ahead bucket, and Davis followed by tipping in James' miss for a 109-105 lead with 53.5 seconds left.\n\nMorant's layup with 28 seconds left pulled Memphis within a point. James missed a jumper with the Grizzlies grabbing the rebound to set up the final try.\n\nThe Grizzlies lost their third straight on a night they wore their Vancouver teal uniforms for the first time to celebrate their 25th NBA season along with a throwback court.\n\nMemphis led 35-25 after the first quarter and 63-55 at halftime.\n\nTIP-INS\n\nLakers: Rondo played hours after the NBA fined him $35,000 for the foul that got him ejected from the Lakers' win over the Thunder for kicking guard Dennis Schroder in the groin area. Against Memphis, Rondo also had six assists and three rebounds. ... James snapped his seven-game streak with 10 or more assists, the longest in his career, with just four assists. It was the longest such streak for the Lakers since Magic Johnson had 10 straight in 1990-91.\n\nGrizzlies: They hit their first eight 3-pointers before Jackson missed with 10:38 left in the second. The team finished 14 of 30, the eighth time in nine games it has hit at least 10 3s. ... Outscored the Lakers 52-46 in the paint and outrebounded them 47-40. ... Memphis now is 4-1 in games decided by six or fewer points this season.\n\nMOVING ON UP\n\nJames had six rebounds and now has 9,002 for his career. He also had two more steals, giving him 1,958 to move past Derek Harper for 14th all-time. He explained why he's been so successful taking the ball away.\n\n\"Anticipation, being in the right place at the right time, being healthy for the majority of my career so far, and then also being around some really good defensive coaches,\" James said.\n\nNO FOUL TRIPPING\n\nDavis set a Lakers franchise record by making 26 free throws on 27 attempts when these teams first met Oct. 29. Jackson recalled barely playing in that game because of foul trouble. This time, the No. 4 overall pick of the 2018 draft played 33 minutes, having picked up only two fouls. Davis was 5 of 6 at the line this time.\n\nUP NEXT\n\nLakers: Continue a four-game road swing visiting San Antonio on Monday night.\n\nGrizzlies: After wrapping up a four-game homestand, Memphis visits Indiana on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995753.276093
}