{
  "game_id": "0021800163",
  "espn_id": "401070844",
  "date": "Nov 08, 2018",
  "matchup": "OKC vs. HOU",
  "headline": "Thunder top Rockets without Westbrook for 7th straight win",
  "body": "OKLAHOMA CITY --  The Oklahoma City Thunder have figured out how to win without Russell Westbrook -- they lock down on defense.\n\nPaul George scored 20 points, and the Thunder beat the Houston Rockets 98-80 on Thursday night for their seventh straight victory.\n\nWestbrook missed his second game in a row with a sprained left ankle, and the Thunder have won both. Oklahoma City held Cleveland to 37 percent shooting in a 95-86 victory Wednesday night, then limited Houston to 38 percent shooting on Thursday.\n\nGeorge led the defensive charge with six steals.\n\n\"We didn't come in tonight thinking this was going to be an offensive battle, where we've got to outscore them on the offensive end,\" he said. \"We're just going to stick to playing defense. We've got guys that can guard and want to guard. That's just what it comes down to. (Defense) is what we're going to hang our hat on.\"\n\nOklahoma City got plenty of help from Houston -- the Rockets made just 11 of 42 3s. It was the fifth time in seven games that the Rockets failed to score at least 100 points.\n\n\"Maybe because all we do is talk about defense 24 hours,\" Houston coach Mike D'Antoni said. \"Our offense is anemic. I mean, it's bad.\"\n\nJames Harden scored 19 points, but made just 7 of 19 shots. Clint Capela added 17 points for Houston, which had won three in a row despite its offensive struggles.\n\nHouston's Carmelo Anthony, who played for the Thunder last season and was traded this summer, scored two points on 1-for-11 shooting. Chris Paul added 10 points, five assists and six steals.\n\nSteven Adams had 19 points and 10 rebounds, and Terrance Ferguson and Dennis Schroder each added 14 points for Oklahoma City. All five Thunder starters scored in double figures before the end of the third quarter.\n\nThe Thunder led 59-45 at halftime behind 53.8 percent shooting. In the second quarter, George made all five of his shots and scored 14 points. Oklahoma City held Paul and Anthony scoreless before the break.\n\nJerami Grant dunked on a lob from Schroder and made the free throw on the foul to put Oklahoma City up 80-60, a score that held up until the end of the third quarter. The Thunder coasted in the fourth.\n\n\"I don't know if we're just sagging because we don't believe in what we're -- I don't know,\" D'Antoni said. \"We've got to find the answers.\"\n\nTIP-INS\n\nRockets: G Eric Gordon missed his third straight game with a strained muscle in his right thigh. ... Anthony was mostly cheered when he checked into the game for the first time in the first quarter. ... Reserves made 1 of 11 shots in the first half. ... Paul was called for a technical foul in the fourth quarter.\n\nThunder: Ferguson, a 6-foot-7 guard, came out of nowhere to stuff 7-footer Isaiah Hartenstein in the first quarter. ... Made 27 of 44 shots inside the 3-point line but 9 of 37 beyond the arc. ... Outrebounded the Rockets 52-39. ...  George had 11 rebounds and six assists.\n\nQUOTABLE\n\nAdams, on defending Houston's outside shots: \"We knew they were going to put up a lot of threes. They're a 3-point-shooting team. The whole game plan was to try to get as many contests, and we did. It's not just contesting, mate. We did a good job at really getting out there and getting them in an uncomfortable position.\"\n\nBENCH ROLE\n\nHouston's reserves shot a combined 6 for 27 from the field and made just 3 of 18 3-pointers. Oklahoma City's reserves shot 8 for 21. Point guard Raymond Felton led the way with 10 points.\n\nUP NEXT\n\nRockets: At San Antonio on Saturday night.\n\nThunder: At Dallas on Saturday night.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994630.761251
}