{
  "game_id": "0021301043",
  "espn_id": "400489916",
  "date": "Mar 23, 2014",
  "matchup": "MIL @ SAC",
  "headline": "Cousins, Thomas lead Kings past Bucks 124-107",
  "body": "SACRAMENTO, Calif. --  DeMarcus Cousins did something Sunday he's not usually known for: lots of smiling.\n\nThe often-scowling Cousins had 32 points and 12 rebounds, and Isaiah Thomas had 30 points and eight assists in the Kings' 124-107 victory that sent the Milwaukee Bucks to their seventh straight loss.\n\nCousins has shown increasing maturity over the last 13 games since he was called for technical fouls Nos. 14 and 15 of the season and ejected in a Feb. 25 loss at home to Houston. That left Cousins one technical from a mandatory one-game suspension.\n\nBut the emotional Cousins has put a halt to complaining to referees and hasn't drawn another technical. Against the Bucks, he was clearly enjoying a big margin of victory, a rarity this season for the Kings.\n\n\"It's always fun to win,\" said Cousins, who dodged a question about any new-found approach to the game. \"My focus is going out and winning.\"\n\nDifferent approach or not, Cousins clearly had his way with the Bucks. Scoring in a variety of ways, he had 14 points in the first quarter and 21 by halftime. The Bucks were never able to contain the talented Kings center.\n\nCousins made 14 of 19 shots, four of six free throws and added four assists and two steals.\n\n\"Now I see where he is bringing it more (upcourt) on the dribble after the rebound,\" Bucks coach Larry Drew said. \"I was mad at my guys for not getting in his way, but you can see he looks comfortable doing it. It's just the matter of him being under control and it looks like he is and making the right plays out of it.\"\n\nThe Kings demonstrated early they would not be overlooking the struggling Bucks. Sacramento led by 23 points after one quarter, took a 70-44 lead into halftime, and were ahead by 34 points after three quarters.\n\n\"We can't go out there and lay down. I'm not saying we did that tonight,\" Drew said. \"This is one of the few games we came out and laid an egg at the very beginning. We've actually been playing some pretty good basketball.\"\n\nRudy Gay had 24 points and eight rebounds and Ben McLemore scored 15 points for the Kings, who had dropped four of their past five home games against the Bucks.\n\nO.J. Mayo scored 13 of his 21 points in the fourth quarter for Milwaukee. Mayo consistently connected from the outside and the Bucks shot 75 percent in the fourth quarter in outscoring the Kings 37-20.\n\n\"I told our guys that any win in the NBA is something to be happy about, but I just didn't like how we played in the second half,\" Kings coach Michael Malone said. \"We gave up 63 points, they shot 64 percent from the field in the second half. We had no discipline.\"\n\nErsan Ilyasova had 14 points and Jeff Adrien and Ramon Sessions each added 13 for Milwaukee.\n\nBrandon Knight came in averaging 20.1 points in March, but the Milwaukee guard missed his first seven shots and finished 2-of-12 and had six points and seven assists.\n\nMilwaukee (13-57) has dropped 10 of 11 games overall. The Bucks have won only eight home games and have lost eight straight and 18 of 19 on the road, dating to Jan. 2. Their lone road win in that stretch was Feb. 24 against Philadelphia, another struggling team.\n\nMilwaukee will need to reverse the losing trend quickly if it hopes to avoid a franchise-worst season. The 1993-94 Bucks had a 20-62 record.\n\nThomas scored 14 points and Cousins had 11 in the third quarter. Sacramento went over the 100-point mark on Thomas' 3-pointer at the 2:35 mark and was in front 104-70 after three quarters.\n\nThe Kings came out a little sluggish in the third quarter, but seemed to get inspired after Cousins grabbed a rebound and dribbled the length of the court and finished with a resounding dunk. The basket ignited a 16-3 run that put the Kings ahead 90-57.\n\nGame notes Bucks rookie guard Nate Wolters fractured his left hand Thursday against Golden State and will miss the final 13 games. ... Royce White played his second straight game for the Kings, getting in for the final 48 seconds. ... The Bucks shot 27 percent in the opening quarter and 35 percent in the first half. ... Mayo had not played in the previous six games.",
  "source": "espn_api",
  "crawled_at": 1764992726.909774
}