{
  "game_id": "0021800708",
  "espn_id": "401071381",
  "date": "Jan 23, 2019",
  "matchup": "BKN vs. ORL",
  "headline": "Russell's double-double helps Nets edge Magic 114-110",
  "body": "NEW YORK --  D'Angelo Russell could very well make his first NBA All-Star game appearance next month in Charlotte. After yet another big offensive performance for the surging Brooklyn Nets, the young point guard was quick to credit a key defensive play by one of his teammates.\n\nRussell had a double-double with 25 points and 10 rebounds, Spencer Dinwiddie scored 29 points, and the Nets edged the Orlando Magic 114-110 on Wednesday night for their fifth straight victory.\n\nBut it perhaps wouldn't have been possible had Joe Harris not stepped in. The reserve guard took a charge as the 7-foot Nikola Vucevic barreled in for a potential basket that would have cut Brooklyn's lead to one point with 1:25 remaining in regulation.\n\n\"That's a winning play right there,\" Russell said. \"He doesn't make that play, they get a layup or a foul and it changes the game -- but that's the icing on the cake right there.\"\n\nSaid Harris: \"We call it M.I.G. mentality -- it's the `most important guy.' So, it's the opposite wing defender, and I was just on the opposite block.\"\n\nVucevic's tough night continued and cost Orlando a chance at possibly sending the game into overtime.\n\nThe Magic had a chance to tie it at 112 with 3.1 seconds left in regulation, but Vucevic's basket was waved off after replay review confirmed that the Magic center had actually tipped in the ball while it was still on the rim after Evan Fournier had beaten Brooklyn's Jarrett Allen to the hoop.\n\n\"I thought it was already coming out. It's really like split-second, it's hard,\" Vucevic said. \"Two, three plays before, I tipped the ball in their own basket, so it just happens.\"\n\nRussell, who also had seven assists, hit a pair of free throws with 2.4 seconds remaining to seal it for the Nets, who have won seven consecutive games at the Barclays Center. DeMarre Carroll added 19 points for Brooklyn.\n\n\"It's becoming routine and I think we have that belief that we can win more so than we have in my tenure here,\" Dinwiddie said.\n\nVucevic had a double-double with 21 points and 14 rebounds for the Magic, who have lost eight of their last 11. D.J. Augustin added 19 points and Jonathan Isaac scored 16.\n\nTrailing 104-102 with 4:36 remaining in regulation, Brooklyn went on a 7-0 run that was capped by Carroll's 3-pointer with 2:42 left in the fourth quarter to go up 109-104.\n\nAugustin then made a layup to cut the deficit to 109-106 before Vucevic made another costly mistake for the Magic.\n\nCarroll drove inside the paint and missed his shot, but Vucevic tipped the ball in to increase Brooklyn's lead to 111-106 with 40.7 seconds remaining.\n\nAfter calling a timeout, the Magic scored four straight, making it 111-110 after Jonathon Simmons' pair of free throws with 21.7 to go.\n\nTIP INS\n\nMagic: G Isaiah Briscoe sprained his left ankle with four minutes left in the first quarter and did not return.\n\nNets: F Rondae Hollis-Jefferson strained his left shoulder while battling for a rebound late in the third quarter. He immediately walked off the court as soon as the Nets called a timeout with 3:11 remaining in the period. ... Dinwiddie has scored at least 25 points off the bench in 10 games this season, matching a franchise single-season record. Bubbles Hawkins set the mark during the Nets' inaugural NBA season (1976-77). . The Nets bench outscored Orlando's reserves 52-35\n\nRIGHT COMBINATION\n\nDinwiddie and Russell have each tallied over 20 points in the same game four times this season, including twice against the Magic.\n\nThe Brooklyn backcourt tandem combined for 30 points in the second half.\n\n\"I see more as they are meshing. More and more every time,\" Nets coach Kenny Atkinson said. \"I know advanced stuff says they don't play well together, but they're going to be in at the end of the game.\"\n\nUP NEXT\n\nMagic: Host the Washington Wizards on Friday night.\n\nNets: Host the New York Knicks on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995407.882176
}