{
  "game_id": "0021900426",
  "espn_id": "401161068",
  "date": "Dec 20, 2019",
  "matchup": "OKC vs. PHX",
  "headline": "Gilgeous-Alexander career-high 32 points, Thunder beat Suns",
  "body": "OKLAHOMA CITY --  The Oklahoma City Thunder proved earlier in the week they can rally for dramatic wins.\n\nOn Friday night, they showed they can control a game throughout. Shai Gilgeous-Alexander scored a career-high 32 points, and the Thunder rolled past the Phoenix Suns 126-108.\n\nThe Thunder had come back from 26 points down against Chicago to win on Monday and from 24 points down against Memphis to claim a victory Wednesday.\n\nOklahoma City coach Billy Donovan prefers what he got against the Suns.\n\n\"These guys are working hard and they know the last two games against Chicago and Memphis -- that's not sustainable,\" Donovan said.\n\nGilgeous-Alexander helped put the Thunder in a better position by making 13 of his 18 field-goal attempts.\n\n\"The shots just went in today, honestly,\" he said. \"I get those shots a lot of nights, and they went in tonight. But that's just a testament to the work I put in every day, and I trust it, and it worked out for me.\"\n\nGilgeous-Alexander, a second-year guard, leads the Thunder in scoring.\n\n\"It's just a good experience for me,\" he said. \"Not a lot of young guys get to play as much as I do. And the times I do it, I'm blessed and fortunate to be in the position. I'm trying to take full advantage of it.\"\n\nDennis Schroder scored 24 points and Danilo Gallinari scored 22 for the Thunder, who shot 56.3% from the field. Oklahoma City has won three straight and eight of 11 to even its record at 14-14.\n\nRicky Rubio scored 24 points for the Suns.\n\nDevin Booker returned to Phoenix's starting lineup after missing three games with a right forearm contusion. He finished with 18 points, seven below his average. He made 6 of 11 shots.\n\n\"I feel good,\" Booker said. \"I'm excited to be back out there. Obviously not the outcome that I want.\"\n\nIt was Phoenix's fourth straight loss.\n\n\"We're in a tough stretch right now,\" Booker said. \"It's my job, it's our job as leaders on this team to dig ourselves out of this hole.\"\n\nOklahoma City led 57-50 at halftime behind 15 points from Gilgeous-Alexander.\n\nGallinari hit a 3-pointer, was fouled and made the free throw to put the Thunder ahead 77-69 in the third quarter. Oklahoma City led 101-91 at the end of the period.\n\nOklahoma City closed the game out by outscoring the Suns 25-17 in the fourth quarter.\n\n\"That's what we talked about going into this game is that we've really got to try to put a whole game together,\" Donovan said. \"And inside the whole game, you're going to have lapses and moments where you're not playing maybe, pretty basketball. But I felt like the way we were trying to play to an identity standpoint on both ends -- the guys were executing pretty well.\"\n\nTIP-INS\n\nSuns: Coach Monty Williams is a former Thunder assistant. ... Phoenix's starters shot 14 for 23 in the first half while its reserves shot 3 for 12. ... C Aron Baynes was called for a technical foul in the fourth quarter.\n\nThunder: C Steven Adams was issued a technical foul in the second quarter for throwing a ball that hit Baynes. ... Oklahoma City shot 50% in the first half. ... Gallinari was called for a technical in the third quarter for voicing disapproval after Baynes wasn't called for a foul following contact.\n\nSECOND HALF DOMINANCE\n\nIn victories over Chicago, Memphis and Phoenix, the Thunder have averaged 65.3 points in the second half while allowing 50.\n\nSIXTH MAN\n\nSchroder has come in hot off the bench during the win streak. He's averaged 24.3 points in the three games and has made 26 of 50 shots from the field.\n\nHE SAID IT\n\nGallinari, joking about Gilgeous-Alexander's big game: \"It's nice to see him play like that. I always tell him that when he plays like this, he just looks like a young Gallo (Gallinari). So he did a great job.\"\n\nUP NEXT\n\nThe Suns host the Houston Rockets on Saturday.\n\nThe Thunder will host the Los Angeles Clippers and former teammate Paul George on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996235.235431
}