{
  "game_id": "0022000491",
  "espn_id": "401267651",
  "date": "Feb 24, 2021",
  "matchup": "CLE vs. HOU",
  "headline": "Cavaliers hand Rockets ninth straight loss, 112-96",
  "body": "CLEVELAND -- — Jarrett Allen tied his career high with 26 points, grabbed 18 rebounds and blocked four shots as the Cleveland Cavaliers pulled away for a 112-96 win over Houston on Wednesday night, extending the Rockets’ losing streak to nine games.\n\n\r\n                    Allen, who leads the NBA making 67.2% of his field goals, went 10 of 11 from the floor as Cleveland won for the second straight evening after dropping its previous 10 contests. It beat Atlanta 112-111 on Lamar Stevens’ dunk with 4.1 seconds left Tuesday.\n\n\r\n                    “At 22 years old, Jarrett is not near his potential ceiling — and that’s the part I’m most excited about,” Cavaliers coach J.B. Bickerstaff said. “He plays off his teammates well and he knows they’re looking for him.”\n\n\r\n                    Allen did it by himself in the third quarter, going coast to coast with a rebound and finishing with a one-handed dunk that reminded his coach of the legendary Julius Erving in the American Basketball Association.\n\n\r\n                    “I got the rebound and I took two dribbles, so it’s close, it’s close (to what Dr. J did),” Allen said, laughing. “We have the same first initial, we both had the afro and we both were soaring through the air.”\n\n\r\n                    John Wall scored 20 points and Victor Oladipo had 17 points and six rebounds in his return from a strained right foot for Houston, whose last victory occurred at Memphis on Feb. 4. Eric Gordon added 17 points off the bench.\n\n\r\n                    The Rockets were outrebounded 55-33 and didn’t start a player taller than 6-foot-6, which Wall and Oladipo both admitted frustration about. P.J. Tucker and rookie Jae'Sean Tate led Houston with seven boards apiece.\n\n\r\n                    “I’m used to playing with a traditional big that rolls and pops, just like John is, but we’ve got to figure out a way to win,” said Oladipo, who sat out the previous four games.\n\n\r\n                    The Cavaliers blew the game open with a 22-9 run in the fourth, capped by a 3-pointer by rookie Isaac Okoro that made it 106-89. Cleveland later extended its lead to 112-93 on a trey by Collin Sexton, who scored 23 points.\n\n\r\n                    Dean Wade scored 11 points and Cedi Osman had seven points and eight rebounds as the Cavaliers held an opponent below 100 points for the first time since Feb. 1, a span of 11 games.\n\n\r\n                    “Our defense wasn’t good and our offense was disjointed,” Houston coach Stephen Silas said. “It wasn’t very good all around.”\n\n\r\n                    Darius Garland collected 11 points and 10 assists for the Cavaliers, who shot 67.6% in the second half. Rookie Dylan Windler scored 13 points on 4-of-4 3-point shooting, extending his string of makes beyond the arc to nine.\n\n\r\n                    “Continuing to see growth as a player is my goal, game after game and year after year,” Windler said.\n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: Houston will play 10 back-to-back sets in the second half of the season, which it opens on March 11 with a stretch of 11 games in 17 days. ... C Christian Wood (right ankle sprain), who has been out since Feb. 4 at Memphis, will return after the All-Star break. ... G Kevin Porter Jr., acquired from Cleveland on Jan. 29, is averaging 23.3 points for Rio Grande Valley in the G League. Silas said he will join the Rockets in March.\n\n\r\n                    Cavaliers: F Taurean Prince (left ankle soreness) saw his first action since Feb. 14, playing eight minutes before his injury flared up. ... Wade made his second straight start after not playing in the previous two games. ... Bickerstaff’s first head coaching job was on an interim basis with Houston in 2015-2016. “I learned the daily struggle of how hard it is to manage 15 guys there,” he said. “That was a big difference.”\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Play the Raptors in Tampa, Florida on Friday. Wall is averaging 19.1 points and 8.0 assists in 27 career games against Toronto, all of them with Washington.\n\n\r\n                    Cavaliers: Visit Philadelphia on Saturday. Sexton had 22 points as Cleveland beat the 76ers 118-94 on Dec. 27, posting its largest victory margin since March 11, 2019.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997882.797385
}