{
  "game_id": "0021900524",
  "espn_id": "401161166",
  "date": "Jan 04, 2020",
  "matchup": "TOR @ BKN",
  "headline": "Raptors rediscover offense, beat slumping Nets 121-102",
  "body": "NEW YORK --  The Toronto Raptors were coming off their most inept performance of the season and their shooting looked just as off to start their game Saturday night.\n\n\"It don't matter. We're going to keep putting them up,\" Kyle Lowry said. \"That's what we we do. We believe in the work that we put in.\"\n\nEspecially when they play the Brooklyn Nets.\n\nFred VanVleet had 29 points and 11 assists, Lowry scored 26 points and the Raptors bounced back from their worst offensive performance of the season to beat the slumping Nets 121-102.\n\nSerge Ibaka finished with 21 points and 12 rebounds for the Raptors. They were held to season lows for points and shooting in their 84-76 loss in Miami, when they hit just 31.5% overall and went 6 for 42 from 3-point range (14.3%.)\n\n\"We know that Miami game is a game that ain't going to happen much,\" Lowry said. \"Just got to keep playing.\"\n\nThey started slowly in this one but got back into it with a big finish to the first half before their guards -- who both hit five 3-pointers -- carried them in the second half for another win in what's been a one-sided rivalry.\n\n\"I think both those guys really had good floor games as well,\" coach Nick Nurse said. \"There was a lot of silliness, it seemed like for us, falling over or kicking the ball around first 15 minutes of the game and then after that we looked really, really well organized.\"\n\nToronto made 13 3s and beat Brooklyn for the 17th time in 18 meetings.\n\nSpencer Dinwiddie scored 23 points for the Nets, who dropped their fifth straight. They had a 16-point lead in the second quarter but gave almost all of it away by halftime.\n\n\"They forced us into 24 turnovers. That's what they do,\" Nets coach Kenny Atkinson said. \"We couldn't handle their pressure. We could not handle their swarming defense.\"\n\nCaris LeVert returned after a 24-game absence following right thumb surgery and scored 13 points in 16 minutes off the bench.\n\nThe Nets shot 61% in the first quarter and were 6 of 10 from 3-point range to open a 33-24 lead. They were controlling the play in the second, pushing the lead to 52-36 on Taurean Prince's 3-pointer before a sloppy finish to the period. Toronto scored the final 12 points to trim it to 52-48.\n\nBrooklyn had 16 turnovers in the half, leading to 20 points.\n\nVanVleet then scored 14 in the third to keep Toronto ahead until it went into the fourth leading 83-80. Lowry's 3-pointer with 9:08 to play triggered a 15-5 spurt that turned a two-point lead into a 100-88 cushion midway through the period. They blew it open for good later in the fourth.\n\n\"When teams take it to another level, we've got to be able to do the same thing,\" LeVert said. \"We've got to do it first, be the aggressor in that situation.\"\n\nTIP-INS\n\nRaptors: Nurse predicted that the order of return for his injured players would be Matt Thomas (broken finger), Norman Powell (left shoulder), Marc Gasol (left hamstring) and Piascal Siakam (groin). They were hurt in mid-December. ... Ibaka had his fifth straight double-double. ... There was a video tribute for Rondae Hollis-Jefferson after the first quarter. The forward averaged 9.9 points in four seasons in Brooklyn.\n\nNets: Dinwiddie has scored 20 or more points in 11 straight home games, most by a Net since Vince Carter had 13 straight late in the 2005-06 season. ... Brooklyn played the first of 10 games at Barclays Center this month. That's the most home games the Nets play in any games this season and matches their most home games in January, done in 1996 and 2016. ... The Nets signed guard Chris Chiozza to a two-way contract.\n\nINJURED IRVING\n\nKyrie Irving missed his 23rd straight game with a right shoulder injury. He said he recently had a cortisone shot that he hopes will allow him to play but may need surgery.\n\nUP NEXT\n\nRaptors: Host Portland on Tuesday.\n\nNets: Visit Orlando on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995616.366577
}