{
  "game_id": "0022200656",
  "espn_id": "401468811",
  "date": "Jan 16, 2023",
  "matchup": "CHA vs. BOS",
  "headline": "Tatum scores 51, Celtics beat Hornets for 7th straight win",
  "body": "CHARLOTTE, N.C. -- — Jayson Tatum knew he was sitting on 48 points entering the final minute of the Boston Celtics' Martin Luther King Jr. Day matinee against the Charlotte Hornets on Monday and briefly thought about backing the ball out and letting the clock run down with the outcome well in hand.\n\n\r\n              Then he remembered a text from Jamal Crawford earlier this season after Tatum refused to take a late shot against the Miami Heat and finished the game with 49 points.\n\n\r\n              “Jamal texted me after the game and he's like, ‘If you’re ever that close to 50, nobody is going to remember the time and score, they're just going to report if you got 50 or not,'” Tatum said. “That’s what was going through my mind: Jamal telling me if you get that close to 50, go get it.”\n\n\r\n              So Tatum let loose on a 3-pointer from the left wing with 38 seconds left and swished it, giving him a season-high 51 points — causing the crowd to erupt with chants of \"MVP! MVP! — as the Celtics beat the Hornets for the second time in three days, 130-118.\n\n\r\n              It was the seventh 50-point game of Tatum's career.\n\n\r\n              Derrick White added 19 points and eight assists and Malcolm Brogdon scored 16 for the Celtics, who have won seven straight games. Boston is 33-12 on the season, the best record in the Eastern Conference.\n\n\r\n              Tatum was 15 of 23 from the field and 14 of 14 from the foul line.\n\n\r\n              \"He makes me look like a better coach,\" Celtics coach Joe Mazzulla said.\n\n\r\n              Mazzulla said he liked the way Tatum excelled at executing against different coverages the Hornets threw at him.\n\n\r\n              “He didn't settle for shots,” Mazzulla said. “He got catch-and-shoots, he got off the dribbles, he got layups. The other piece of that is the humility of our team to really work with him to get those 51 points.\"\n\n\r\n              Added White: \"He wants to be great and he takes that challenge each and every night. He’s seen a lot of defense during his time in the league and he is making the right read off of that.”\n\n\r\n              Jalen McDaniels led the Hornets with a career-high 26 points on 5-of-7 shooting from 3-point range. LaMelo Ball finished with 25 points on 8-of-23 shooting. Mason Plumlee had perhaps his best all-around game of the season, with 19 points, 12 rebounds and seven assists for the Hornets (11-34), who’ve lost eight of their last nine games.\n\n\r\n              The Celtics set the tone early, jumping out to a 35-22 lead in the first quarter after holding the Hornets to 28.6% shooting from the floor.\n\n\r\n              Charlotte would fight back to cut the lead to 100-98 early in the fourth quarter, but White was fouled by Dennis Smith Jr. on a 3-point attempt and made all three free throws.\n\n\r\n              Moments later, the Celtics got three long offensive rebounds on one possession before White drove to the rim and scored to increase the lead with 6:34 left, causing Hornets coach Steve Clifford to punch the air in frustration.\n\n\r\n              “When a shot goes up, all five guys should be coming back for the rebound,” Clifford said. “That is the way we want it. Defensive rebounding is a challenge for our team and we're not overly physical. We have a habit of leaking out and it has cost us two games.\"\n\n\r\n              Tatum took over down the stretch, finishing with 17 points in the fourth quarter.\n\n\r\n              He drilled a step-back 3 from the top of the key over Smith to push the lead to 10 and then buried the Hornets with a long 3 with 1:02 left. Tatum smiled when asked about the MVP chants.\n\n\r\n              \"I hear them and just being in North Carolina, it all feels a little more special, having gone to school two hours away,\" said Tatum, who spent one season at Duke before entering the NBA draft. \"Coming here feels like I'm back home a little bit.\"\n\n\r\n              MLK JR. DAY\n\n\r\n              During pregame warmups, the Celtics and Hornets wore gray and white T-shirts for Martin Luther King Jr. Day that read “Now is the time to make justice a reality for all” on the front and “Honor King” on the back.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Finished 24 of 25 from the free-throw line.\n\n\r\n              Hornets: P.J. Washington had 17 points. ... Clifford said he hopes to get Gordon Hayward (hamstring) and Cody Martin (knee soreness) back for the team's upcoming four-game road trip.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Washington on Thursday night.\n\n\r\n              Hornets: Open a four-game road trip at Houston on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994264.75322
}