{
  "game_id": "0022300585",
  "espn_id": "401585213",
  "date": "Jan 19, 2024",
  "matchup": "ORL vs. PHI",
  "headline": "Embiid and Maxey each score over 30 points again to set 76ers record in 124-109 win over Magic",
  "body": "ORLANDO, Fla. -- — Joel Embiid and Tyrese Maxey both scored over 30 points for the eighth time this season, leading the Philadelphia 76ers to a 124-109 win over the Orlando Magic on Friday night and breaking a 58-year-old franchise record.\n\n\r\n              Embiid and Maxey surpassed the mark for a 76ers duo set by Wilt Chamberlain and Hal Greer, who went over 30 together seven times during the 1965-66 season.\n\n\r\n              “That’s a cool stat, for sure. Some incredible players there,” 76ers coach Nick Nurse said. “I still say there’s a lot more ceiling there, especially with Tyrese. But they should be a pretty good combo for a while.”\n\n\r\n              It was the franchise-record 19th straight game of 30 points or more for Embiid, the NBA's leading scorer, who didn't play in the fourth quarter of the 76ers' fourth straight win.\n\n\r\n              “That’s our job, our group,” said Maxey, who helped the 76ers expand their lead in the fourth quarter while Embiid watched. “Our job is to take the lead and keep the lead so the big fella can rest. He did a lot in the first three quarters, and our job is to go out there and finish it.”\n\n\r\n              Maxey, who also had five assists and three steals, has scored 20 or more points in 11 straight games.\n\n\r\n              “When the fourth quarter comes along, that’s his time,” Embiid said. “That's who we should trust with the ball. He’s our best player, so we’ve got to make sure he gets the ball so he can score and make plays for everybody else.” \n\n\r\n              Wendell Carter Jr. had 25 points and 11 rebounds for the Magic. Jalen Suggs added 16 points and Paolo Banchero finished with 14 points, eight rebounds and six assists. \n\n\r\n              The 76ers won for the ninth straight time on the road with Embiid in the lineup. They are 2-6 away from home without him.\n\n\r\n              Embiid scored 28 points in the first half.\n\n\r\n              “He's the (2021-22) MVP for a reason,” said Magic coach Jamahl Mosley. “You can have every scheme, but you know he's getting to the area. You put a hand on him it turns into a foul. If you don't put a hand on him, he's making that 15, 17-footer that he's shooting at a 60 percent clip.”\n\n\r\n              Embiid made all 11 of his foul shots and his 36 points came in just 31 minutes.\n\n\r\n              “All this is good,” he said. “I can keep playing these back-to-backs. I was hoping I wouldn't have to go back in. If we can keep that going, it would be nice.”\n\n\r\n              Embiid and Maxey did all the scoring during an 11-0 run that lifted the 76ers to a 62-52 lead late in the half. Embiid's three baskets during that stretch included an 18-foot jumper, a 3-pointer and a thunderous dunk after his underhand scoop off the glass.\n\n\r\n              Maxey and Kelly Oubre Jr. made 3-pointers to help Philadelphia stretch a 12-point lead to as many as 22 early in the fourth quarter.\n\n\r\n              INJURIES\n\n\r\n              Magic forward Franz Wagner missed his eighth straight game with an ankle injury.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit the Charlotte Hornets on Saturday.\n\n\r\n              Magic: Host the Miami Heat on Sunday.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995704.10052
}