{
  "game_id": "0022300033",
  "espn_id": "401584121",
  "date": "Nov 17, 2023",
  "matchup": "ORL @ CHI",
  "headline": "Franz Wagner scores 21 as Magic beat Bulls 103-97 after blowing another 19-point lead",
  "body": "CHICAGO -- — The Orlando Magic held the Chicago Bulls to 33 points in the first half once again and watched their lead slip away after going up by 19.\n\n\r\n              Just as they did two nights earlier, they came away with the win. And Gary Harris could laugh after this one.\n\n\r\n              Franz Wagner scored 21 points, Jonathan Isaac added 18 and the Magic beat the Bulls 103-97 on Friday night in an NBA In-Season Tournament game.\n\n\r\n              “It’s just funny how it happens because it’s the same situation as the last game,” Harris said. “We said you’re going to keep getting the same test until you pass it. It wasn’t technically how we wanted it to go. But just for us to come together and for them to take the lead and for us to regain our composure and go out there and steal another one here in Chicago, it was great. That’s just the resiliency of this team.”\n\n\r\n              The way this one unfolded bore a striking resemblance to Wednesday's game in Chicago. Orlando held Chicago to 33 points in the first half and blew a 19-point lead, only to come away with a 96-94 win.\n\n\r\n              This time, Wagner drove for a go-ahead three-point play in the final minute. Isaac hit two free throws to make it a four-point game with 12 seconds left, sending the Bulls to their seventh loss in nine games.\n\n\r\n              Zach LaVine led Chicago with 35 points. DeMar DeRozan scored 23 after missing a game due to personal reasons. Alex Caruso added 18 and made four 3-pointers for Chicago.\n\n\r\n              Isaac, who missed the 2020-21 and 2021-22 seasons because of a torn ACL, had his highest point total since finishing with 19 at Milwaukee on Dec. 28, 2019.\n\n\r\n              Harris scored 15 for Orlando. Paolo Banchero finished with 13 points and seven turnovers after hitting the winning shot on Wednesday.\n\n\r\n              “I think there’s definitely a belief factor, and we’re still growing,” Isaac said. “We really are so young. It feels like we’re just babies in a sense of coming together and figuring this thing out. But there’s a belief system.”\n\n\r\n              The Magic led by 15 midway through the fourth quarter when Chicago went on a 16-0 run, with LaVine leading the way.\n\n\r\n              LaVine scored 10 during that stretch. He also fed Andre Drummond for a dunk and Coby White for one on a break that put the Bulls on top 90-89 with 3:39 remaining.\n\n\r\n              Harris stopped the run with a corner 3. Orlando led 96-92 in the closing minute when Caruso hit two free throws and then nailed a 3 from the top of the key with 26 seconds left, giving the Bulls a 97-96 lead as the crowd roared.\n\n\r\n              After a timeout, Wagner caught the inbounds and drove for a twisting layup. He got fouled by Nikola Vucevic and made the free throw to lift Orlando to a 99-97 lead.\n\n\r\n              Vucevic missed a 3 from the right corner following a timeout. Isaac got the rebound and made two free throws, boosting the lead to 101-97 with 12 seconds to play.\n\n\r\n              Harris then blocked a 3 by LaVine and made two free throws in the final seconds.\n\n\r\n              “It was just trying to get DeMar the ball and then I came across trying to get a 3 off,” LaVine said. “At that point, you're just trying to get a shot up. Gary got a good hand on the ball. He's a good defender. Not a lot you can do about it.”\n\n\r\n              The Bulls went from setting an NBA season low for a first half with 33 points two nights earlier to matching that in this game, with Orlando leading 48-33 at the break.\n\n\r\n              UP NEXT\n\n\r\n              Magic: Visit Indiana on Sunday. They host Toronto on Tuesday in their next In-Season Tournament game.\n\n\r\n              Bulls: The Bulls host Miami twice in the next three days — Saturday and Monday. They visit Toronto on Nov. 24 in their next In-Season Tournament game.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995742.316395
}