{
  "game_id": "0021800794",
  "espn_id": "401071467",
  "date": "Feb 04, 2019",
  "matchup": "PHX vs. HOU",
  "headline": "Harden scores 44 points, Rockets beat Suns 118-110",
  "body": "PHOENIX --  Another 40-point game for James Harden. That makes 20 of them this season.\n\nThe reigning MVP scored 44 points and the Houston Rockets beat Phoenix 118-110 on Monday night to hand the Suns their season-worst 11th straight loss.\n\nHarden joined Wilt Chamberlain, Michael Jordan and Rick Barry as the only players with 20 games of at least 40 points in the first 50 of a season.\n\nHarden, who also had eight rebounds and six assists, extended his streak of games with at least 30 points to 27, third-longest in NBA history. The only longer streaks are 65 and 31 games, both by Chamberlain.\n\n\"I'm just trying to keep going. Nothing can slow me down,\" Harden said. \"Nothing can stop me. I'm trying to give that same motivation to my teammates and it's not about scoring, it's about attacking the game, being aggressive with the game of basketball -- defensively, offensively. That's all I can give to them.\"\n\nChris Paul scored 18 and Kenneth Faried had 17 points and 14 rebounds for the Rockets, who were without two starters.\n\nJosh Jackson scored 25 points, Kelly Oubre Jr. 23 and Devin Booker 19 for the Suns. Deandre Ayton added 15 points and 11 boards. Booker left in the fourth quarter with a tight hamstring.\n\nThe Suns never led but stayed close through the first half before falling behind by 20 in the third quarter.\n\nPhoenix cut it to single digits on several occasions in the fourth only to be thwarted by a basket from Harden or Paul. Harden scored 14 in the final quarter.\n\nUp by six at halftime, the Rockets opened a big lead in the third quarter. Harden sank a 3-pointer from the corner and Faried dunked a rebound to cap a 13-4 run that put Houston up 84-68. The Rockets boosted the lead to 20 three times in the quarter, the last at 94-74 on Paul's two free throws with 1:02 left. But the Suns finished the period on a 6-0 spurt as Oubre's 3-pointer at the buzzer cut the Rockets' advantage to 94-80 entering the fourth.\n\nThe run reached 10-0 when Phoenix scored the first four of the final quarter, making it 94-84 on Oubre's dunk with 10:57 to play.\n\nHarden sank a pair of 3s in an 8-0 run and Houston led 101-88 with 7:05 remaining.\n\nThe Suns kept it close in the first half, despite Harden's 22 points, five assists and five rebounds.\n\nHarden scored inside twice to ignite a 9-2 spurt that put Houston up 50-42 on Paul's wide-open 3 with 6:03 left in the half.  Austin Rivers' 3 gave Houston its biggest lead of the half, 57-46, with 3:21 left. The Rockets led 63-57 at the break.\n\nThe Suns tried a new defensive strategy on Harden and, overall results notwithstanding, it worked pretty well some of the time.\n\n\"James forces teams to do a coverage that you usually don't do,\" Booker said. \"It was new for us, first time to do it. ... I feel we did pretty well, kept it close, (were) in striking distance most of the game.\"\n\nKOBE'S TAKE\n\nHarden more or less agreed with Kobe Bryant's comments that the Rockets won't win a title with Harden dominating the ball so much.\n\nHarden doesn't expect to have to do that when the playoffs come around.\n\n\"I have to ball-dominate with all of the injuries,\" he said. \"We have had the injuries throughout the course of the year. Right now he is probably right. This way that we are playing won't happen in the playoffs, won't get us where we want to go, but we haven't had a full roster. Yet I am excited for that to come.\"\n\nTIP-INS\n\nRockets: Through 50 games, Harden has 658 3-point attempts, seventh-most for an entire season in NBA history. ... Houston was without Eric Gordon (right knee soreness) and Clint Capela (right thumb injury). ... Five former Suns are on the Rockets' roster: P.J. Tucker, Gerald Green, Marquese Chriss, Brandon Knight and Danuel House Jr. That's not counting Rivers, waived by the Suns immediately after he and Oubre came over from Washington in a trade for Trevor Ariza.\n\nSuns: Phoenix again didn't have T.J. Warren (right ankle soreness) and De'Anthony Melton (right ankle sprain). ... The Suns have lost 10 straight at home to Houston. They last beat the Rockets in Phoenix on April 15, 2013.\n\nUP NEXT\n\nRockets: Play at Sacramento on Wednesday night.\n\nSuns: Play at Utah on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995067.090962
}