{
  "game_id": "0021900312",
  "espn_id": "401160954",
  "date": "Dec 04, 2019",
  "matchup": "OKC vs. IND",
  "headline": "T.J. Warren scores 24 points to help Pacers beat Thunder",
  "body": "OKLAHOMA CITY --  The Indiana Pacers added to Oklahoma City's growing collection of disappointing second halves.\n\nT.J. Warren scored 24 points to help Indiana beat the Thunder 107-100 on Wednesday night.\n\nOklahoma City led by a point at halftime, but the Pacers outscored the Thunder 58-50 after the break.\n\n\"In the second half, we did a better job on both ends of the floor getting stops, continuing to move the ball,\" Pacers coach Nate McMillan said. \"I thought that in the first half, we played in traffic a little bit, but the second half, we had better ball movement and guys were able to knock down shots.\"\n\nDomantas Sabonis added 17 points and 13 rebounds for the Pacers. They have won seven of eight.\n\nEight of Oklahoma City's 12 losses have been by seven or fewer points. The Thunder have battled the better teams on the schedule but have squandered halftime leads against the Los Angeles Lakers, Los Angeles Clippers and Milwaukee Bucks.\n\nThe third quarter has been particularly tough for Oklahoma City this season.\n\n\"Everyone out there is trying to do the right thing,\" Thunder forward Danilo Gallinari said. \"Whether it's adjustments we make at halftime or they (opponents) come in with a lot more pace or more emphasis on it than we do -- we're working on it.\"\n\nSteven Adams scored 20 points on 8-for-8 shooting and Gallinari and Dennis Schroder each added 18 points for the Thunder.\n\nGallinari made four 3-pointers in the first 5 1/2 minutes of the third quarter to help put the Thunder up 64-60. The Pacers rallied, and Justin Holiday's layup with less than a second left in the third quarter put the Pacers up 79-78.\n\nIndiana led 103-100 in the final minute of the fourth quarter and Oklahoma City had a chance to tie. Terrance Ferguson missed a 3-pointer from the corner with 17 seconds left, and Warren made two free throws at the other end with 13.2 seconds to go to put the Pacers in control for good.\n\nOklahoma City decided against calling a timeout before Ferguson's three.\n\n\"I don't think you can draw something up and get a better look than we got,\" Thunder guard Chris Paul said. \"I told Ferg I want him to shoot that every night. That's what he does for us.\"\n\nThe Pacers expected a tough game from the Thunder, given their tendency to play close games.\n\n\"They've got good players over there,\" McMillan said. \"They have a good team and they've been playing good basketball.\"\n\nTIP-INS\n\nPacers: Starters Sabonis and Jeremy Lamb are former Thunder players who were cheered during pregame introductions. Lamb finished with 13 points. ... Another former Thunder player, Doug McDermott, also plays for the Pacers. He scored 14 points. ... Sabonis committed three fouls in a 23-second stretch in the fourth quarter.\n\nThunder: G Andre Roberson is away from the team while recovering from his left knee injury. He has not played for nearly two years. There is no timetable for his return. ... Lost a coaches' challenge in the third quarter. ... Paul went scoreless the first three quarters and finished with 4 points on 2-for-9 shooting.\n\nSTAT LINESAfter getting off to a rough start, Adams has been hot lately. The 7-foot center made all eight of his shots on Wednesday. He has made 14 of 15 in his past two games and 21 of 26 in his past three. He's averaging 16.3 points in those three games.\n\n\"I think he's kind of getting back to where he normally was, the guy we're used to seeing,\" Thunder coach Billy Donovan said. \"Everything for him looks a lot better.\"\n\nOFF NIGHT\n\nShai Gilgeous-Alexander, who entered the night as Oklahoma City's No. 2 scorer for the season with 18.2 points per game, finished with 16 on 7-for-19 shooting. He made just 1 of 7 3-pointers. He was shooting 44 percent from the field and 36 percent from 3-point range before Wednesday night.\n\nHE SAID IT\n\nMcMillan on handling late-game situations: \"I thought they had good pressure on the ball and we had to execute. We had to make plays down the stretch, setting screens and getting the ball to the open man. Those are things we've got to do to win ballgames.\"\n\nUP NEXT\n\nPacers: At Detroit on Friday night.\n\nThunder: Host Minnesota on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996242.8799622
}