{
  "game_id": "0022300452",
  "espn_id": "401585080",
  "date": "Jan 01, 2024",
  "matchup": "TOR vs. CLE",
  "headline": "Barrett, Quickley combine to lead the new-look Raptors to a 124-121 win over the Cavaliers",
  "body": "TORONTO -- — Pascal Siakam scored 36 points, Jakob Poeltl had 14 points and 11 rebounds and the new-look Toronto Raptors recovered after squandering a 19-point lead and held on to beat the Cleveland Cavaliers 124-121 on Monday night.\n\n\r\n              RJ Barrett had 19 points and nine rebounds and Immanuel Quickley added 14 in the players’ first start for the Raptors. Barrett and Quickley were sent to Toronto from the Knicks on Saturday in a trade that sent OG Anunoby to New York. \n\n\r\n              The sellout crowd of 19,800 roared for the Toronto-born Barrett when he was introduced before tipoff. Barrett assisted on Quickley’s 3-pointer to open the scoring for the Raptors.\n\n\r\n              “This was special,” Barrett said of his first home game in Toronto. “Way better than any other time I’ve played here. This was a special one that I’ll always appreciate.”\n\n\r\n              Scottie Barnes scored 20 points and Dennis Schroder added 12 points off the bench as Toronto bounced back after falling at Detroit on Saturday, when the Pistons snapped an NBA record-tying 28-game losing streak.\n\n\r\n              “I think we played good basketball,” Toronto coach Darko Rajakoic said. “Guys were enjoying playing a good brand of basketball and just cheering for each other.”\n\n\r\n              Caris LeVert scored 31 points and Donovan Mitchell had 26 for the Cavaliers, who have lost two straight and three of five. Isaac Okoro, Jarrett Allen and Sam Merrill each had 16 points for Cleveland. \n\n\r\n              Cavaliers coach J.B. Bickerstaff said Siakam should have been called for travelling on Toronto’s final inbounds pass.\n\n\r\n              “He travelled for sure,” Bickerstaff said. “There was no doubt about it. When you inbound the ball on the sideline after a timeout, you’re not allowed to move and he clearly worked his way up the sideline. That’s a violation, the ball should have been ours with a chance to win the game.”\n\n\r\n              Okoro and Mitchell missed 3-point shots with the Cavaliers trailing by two in the final minute of the fourth quarter.\n\n\r\n              “I thought we got open looks,” Bickerstaff said. “We’ve just got to knock them down.”\n\n\r\n              The Cavaliers fell to 5-3 since learning that forward Evan Mobley (left knee surgery) and point guard Darius Garland (fractured jaw) will be sidelined until February.\n\n\r\n              Mitchell went to the free throw line with less than three seconds remaining and made the first, cutting Cleveland’s deficit to 123-121. But Mitchell’s lane violation on his second attempt gave the ball back to Toronto.\n\n\r\n              “That was tough,” MItchell said. “I didn’t agree, but it shouldn’t have come down to that.”\n\n\r\n              After catching Siakam’s controversial inbounds pass, Barnes split a pair of free throws with 1.3 seconds to go and then sealed the win by picking off Cleveland’s long inbounds pass.\n\n\r\n              Toronto built a 59-40 advantage midway through the second quarter and led 67-59 at the half but the Cavaliers battled back. Mitchell’s tiebreaking 3-pointer with 6:48 left in the fourth put Cleveland up 111-108 and gave the Cavaliers their first lead since the opening period.\n\n\r\n              “We kind of put ourselves behind the eight-ball to start the game,” Mitchell said.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Washington on Wednesday.\n\n\r\n              Raptors: Begin a six-game Western Conference trip at Memphis on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995430.437543
}