{
  "game_id": "0021500529",
  "espn_id": "400828416",
  "date": "Jan 06, 2016",
  "matchup": "TOR @ BKN",
  "headline": "Raptors hand Nets 8th straight home loss, 91-74",
  "body": "NEW YORK -- Hours after one of their best defenders had surgery, the Toronto Raptors got back to defending the way they know they can.\nJonas Valanciunas had 22 points and 11 rebounds, and the Raptors handed the Brooklyn Nets their eighth straight home loss, 91-74 on Wednesday night.\nEven without DeMarre Carroll, who could be out a while after arthroscopic surgery on his right knee across town, the Raptors held the Nets below 40 percent shooting and won easily even while missing 18 of their 22 3-point attempts.\n\n\"We're going to have games where we're not going to be able to score,\" guard DeMar DeRozan said. \"We've got to understand we've got to be able to win games in the 80s and keep teams, like tonight, in the low-70s, high-70s.\"\nKyle Lowry had 17 points, eight rebounds and six assists. He made all seven shots inside the arc but was 0 for 7 from 3-point range as Toronto bounced back after giving up nearly 120 points per game in consecutive losses to Chicago and Cleveland.\nBrooklyn is at the other end of the Eastern Conference standings, and its poor play at home is one of the reasons. The Nets haven't won at Barclays Center since beating Philadelphia on Dec. 10.\n\"We need to work through some things,\" center Brook Lopez said. \"It hasn't all gone as planned.\"\nDeRozan scored 15 points.\nCarroll is one of the Raptors' best defensive players, but the Raptors had no trouble getting their defense back on track after their back-to-back losses. They have won 15 straight games when holding opponents below 100.\n\"I thought overall we needed a game like that to show from start to finish we put our defensive imprint on the game,\" coach Dwane Casey said.\nAnd it helped on the other end to have a strong game from Valanciunas with their outside shots not falling.\n\"I think JV just did a good job of being in the right spots tonight,\" Lowry said. \"He was much more active and going against a true big like Brook he just got up for the challenge.\"\nLopez had 24 points and 13 rebounds for Brooklyn, which wore black uniforms reading \"Los Nets\" instead of its usual whites.\nBut the result was the same as usual at home, where the Nets heard a few boos as the Raptors led by double digits throughout the fourth quarter.\n\"It was just overall domination,\" Nets coach Lionel Hollins said.\nThe Raptors outscored the Nets 16-2 to close the second quarter, then finished the third with a 13-4 spurt that gave them a 70-56 lead. Toronto quickly pushed it to 18 to put it away.\nJoe Johnson, battling a bruised left quad, finished with five points on 2-of-7 shooting. He was scoreless until hitting a 3-pointer in the third quarter, giving him a field goal in 919 straight games, the longest active streak in the NBA.\nTIP-INS\nRaptors: Lowry had double-doubles in his previous three games. He was trying to become the first Raptors player with four in a row since Chris Bosh in 2010. ... Toronto is 1-1 on its five-game road trip.\nNets: Thaddeus Young was held to 11 points and seven rebounds. He entered averaging 16.4 points against Toronto, his highest against any opponent. ... Johnson had scored 20 points in consecutive games for first time this season.\nDEMARRE'S DECISION\nCarroll had recently played in five straight games after missing nine last month. Casey said with the team in New York, Carroll consulted with Dr. David Altchek at the Hospital for Special Surgery and they decided on the surgery.\n\"Kind of the treatment situation wasn't going. It kept continuing to swell so they made the decision to do it,\" Casey said.\nTOO CLOSE TO CALL\nThe all-time series is tied at 39-39. The teams split four games last season, with a total score of 434-434, and the score had been 1,504-1,504 in the previous 15 meetings, counting regular season and postseason.\nUP NEXT\nRaptors: Visit Washington on Friday.\nNets: Host Orlando on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994739.090753
}