{
  "game_id": "0021800777",
  "espn_id": "401071450",
  "date": "Feb 02, 2019",
  "matchup": "BKN @ ORL",
  "headline": "Vucevic has 24 points to lift Magic over Nets 102-89",
  "body": "ORLANDO, Fla. --  Nikola Vucevic, as usual, was the key player for Orlando.\n\nBut it was unexpected contributions from Jonathan Isaac and Wes Iwundu that were the difference in the Magic's 102-89 victory over the Brooklyn Nets on Saturday night, their second straight win.\n\nVucevic, selected for his first All-Star Game on Thursday, had 12 of his 24 points in the fourth quarter, when Orlando put away a Brooklyn team that never got it going offensively the entire night.\n\nVucevic and Isaac had three blocks apiece as the Magic limited the Nets to 36.3 percent shooting for the game, including just 10 of 38 (26.3 percent) on 3-point attempts.\n\n\"The first two times we played (the Nets), they got a lot of points in the paint and that opened up their 3-point shooting,\" Vucevic said. \"But we played a really good game defensively this time. Jonathan and I were contesting shots and made it tough on them.\"\n\nIsaac had his second straight double-double (he has three all season) with 10 points and 12 rebounds. Evan Fournier had 16 points, Aaron Gordon 15 and D.J. Augustin handed out eight assists to go with his 12 points.\n\nHowever, it was Iwundu's 10 points, seven in the final minute of the third quarter and a three-point play early in the fourth that ignited the Magic offense. Brooklyn had gone to a zone defense during that stretch, but came out of it after Iwundu's run.\n\n\"That's the Wes we need every game,\" Fournier said. \"That's part of being a consistent team. We need a guy to play like that every night. He was a big part of our win.\"\n\nBrooklyn lost for the third time in its last four games and looked tired in doing so. The Nets were short with nearly every 3-point attempt and had three airballs from behind the line.\n\nD'Angelo Russell had 23 points for Brooklyn. Shabazz Napier added 15 points and Ed Davis was the only other Net in double figures with 11.\n\n\"We've got to freshen up a little bit,\" Nets coach Kenny Atkinson said. \"I don't think we had great juice tonight, one through 12. We didn't have the pop we normally do. It happens. It's slippage, but this isn't the end of the world. I just wish we would have played better.\"\n\nThe Magic took a 78-70 lead into the final period and stretched it to 89-79 after Vucevic finally got free inside for six straight points.\n\nThe Nets shot 7 for 24 (29 percent) in the fourth quarter. They made only 2 of 12 3-point attempts, nullifying any hopes for a comeback. Brooklyn committed 19 turnovers in the game.\n\n\"Everybody is a little banged up and fatigued at this point,\" said Nets guard Joe Harris, who was 3 of 12 for the game, including 0 for 5 on 3-pointers. \"Obviously people get to the All-Star break and you get a little time to rejuvenate yourself, but right now all the focus is on these last few games and we have to make them count.\"\n\nTIP-INS\n\nNets: Napier was bleeding after catching an elbow in the head from Vucevic late in the third quarter. He returned early in the fourth. ... Nets bench outscored Orlando's 46-25. That has happened a league-high 46 times. ... Brooklyn averaged 115 points in January, the second-highest monthly scoring average in team history.\n\nMagic: Backup C Mo Bamba missed the game with a sore left leg. ... F Terrence Ross, who had 30 points in his last game, had only seven against Brooklyn. He has only scored 20 or more points in back-to-back games twice in his career.\n\nUP NEXT:\n\nNets: Host Milwaukee Monday\n\nMagic: Play at Oklahoma City on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995400.866106
}