{
  "game_id": "0021800401",
  "espn_id": "401071082",
  "date": "Dec 10, 2018",
  "matchup": "LAL vs. MIA",
  "headline": "LeBron's Lakers edge Wade's Heat in final meeting, 108-105",
  "body": "LOS ANGELES --  LeBron James hit his first free throw to put the Lakers up by two. Dwyane Wade sidled up to him before the second shot.\n\n\"Bro, just miss it so I can shoot the game-winner,\" Wade said in the waning seconds of their last game together. \"Me and you. One on one. Just let me shoot it and go for it.\"\n\nLeBron didn't miss. Dwyane didn't really expect him to.\n\nThey still got that last showdown, one on one with the game on the line. Wade launched a 27-foot fadeaway jumper that didn't go down, and the buzzer eventually sounded on the Lakers' 108-105 victory over Miami on Monday night while they scrapped for one last rebound.\n\nTo the final moment in their 16 seasons of simultaneous stardom, these rivals and teammates competed with passion and love. When it was over, they hugged and vowed to get together soon.\n\n\"That's just us,\" James said. \"Some people say you shouldn't be friends with your competitors. But even with our friendship, we competed against each other and we pushed each other.\"\n\nJames scored 28 points and Los Angeles survived Wade's 15-point performance in the second half.\n\nJames and Wade savored what was likely the final joint chapter of two careers that have intersected repeatedly since they entered the NBA together in 2003. After seven seasons as Eastern Conference rivals, Wade and James teamed up with the Heat in 2010 to win two championships while reaching four consecutive NBA Finals, and they spent half of last season together in Cleveland.\n\nWade intends to retire after this season, and Staples Center sent him out of Los Angeles in style with multiple standing ovations and a tribute video in the first quarter. Wade's wife, actor Gabrielle Union, was among the fans at courtside as the high-scoring guard played 32 minutes and got rolling with a second-half flurry that recalled his prime.\n\nJames and Wade both missed big shots down the stretch, but James hit those two free throws with 22.5 seconds left. They also got to guard each other down the stretch, their teammates stepping back to allow the superstars to revel in the spotlight.\n\n\"This was the last time I was going to be able to guard him, so I waited to the end,\" said Wade, who finished with 10 assists and five rebounds after a scoreless first half. \"He knows my moves just like I know his moves. I just wanted to enjoy the competition for the last time.\"\n\nThey traded jerseys after their postgame chat, but they could be even closer in the future. Wade expects to spend more time in Los Angeles next year in retirement, and James has already invited him to work out together and to \"help me out with the young guys\" on the Lakers.\n\nKyle Kuzma scored 33 points for the Lakers, who have won 13 of 17 overall and five straight at home.\n\nJustise Winslow scored a career-high 28 points for Miami, hitting six 3-pointers in the third stop on the Heat's six-game road trip.\n\nTIP-INS\n\nHeat: Hassan Whiteside missed his third straight game. He is away from the team for the birth of his child. ... Josh Richardson (right shoulder) started. Tyler Johnson (bruised left hip) was available, but didn't play.\n\nLakers: Brandon Ingram missed his third straight game with a sprained left ankle. He won't be re-evaluated until Saturday before the Lakers play at Charlotte that night. ... Rajon Rondo had fluid drained from his right hand Sunday, possibly signaling a delay in his return from a broken hand. The veteran point guard has been out for 3  1/2 weeks. ... A star-studded crowd gathered for Wade's final game, including Denzel Washington, Kate Beckinsale, Will Ferrell, Kevin Costner, Jessica Alba and Rams stars Jared Goff and Brandin Cooks.\n\nLEBRON ROLLS ON\n\nJames is nearly three years younger than the 36-year-old Wade, and the four-time MVP is nowhere near retirement after signing a four-year contract with the Lakers in July. James' NBA-record streak of scoring in double digits reached 900 games, and the fifth-leading scorer in NBA history also passed Paul Pierce for 10th place in NBA history by scoring at least 10 points for the 1,162nd time in his 1,170 career games.\n\n\"I'm going to be retired for so long while he's still playing, people are going to forget me,\" Wade said.\n\nUP NEXT\n\nHeat: At Jazz on Wednesday.\n\nLakers: At Rockets on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995017.094065
}