{
  "game_id": "0021801222",
  "espn_id": "401071895",
  "date": "Apr 10, 2019",
  "matchup": "CHA vs. ORL",
  "headline": "Walker scores 43 in likely farewell as Charlotte eliminated",
  "body": "CHARLOTTE, N.C. --  Kemba Walker's season is over with the Hornets.\n\nNow the question becomes whether the franchise's leading scorer and three-time All-Star is done playing in Charlotte for good.\n\nWalker can become a free agent in July. He offered little insight into whether he will be back after the Hornets were eliminated from playoff contention Wednesday with a 122-114 loss to the Orlando Magic on the final night of the regular season.\n\n\"I'm not sure,\" Walker said. \"I have a long time to even start thinking about that stuff. Me and my agent, my family, we will discuss that stuff when the time is right.\"\n\nHowever, Walker seemed to leave the door open to leaving, much more so than last September when he said at the Hornets media day that \"this is where I want to be. I don't want to be nowhere else. I want to create something here.\"\n\nIf this was Walker's curtain call in Charlotte, he certainly left Hornets fans with something to remember.\n\nHe scored 43 points on 16-of-25 shooting to go along with five assists. \"MVP!\" chants for Walker started midway through the fourth quarter after he scored his 39th point. He left the game to a standing ovation with 1:06 remaining and received a hug from coach James Borrego.\n\nAfter the game, Walker spent extra time on the floor hugging people.\n\n\"I love that kid,\" Borrego said of Walker. \"He inspires me. I love coaching him, and I look forward to coaching him for many years to come. Obviously it's a big summer for us, but I believe in Kemba. I believe in that group and I think he was inspired by what he saw here down the stretch\" playing alongside the team's younger players like Miles Bridges and Dwayne Bacon.\n\nFor the Magic, it's on to the playoffs.\n\nTerrence Ross scored a season-high 35 points and Aaron Gordon added 27 for Orlando, which clinched the seventh seed in the Eastern Conference playoffs and will face the Toronto Raptors in the first round.\n\nThe teams split the four-game season series.\n\nHowever, the Magic enter the postseason on a tear, winning 11 of its last 13 games and could prove to be a tough out in the postseason.\n\n\"This is perfect man. Great timing,\" Ross said. \"We couldn't ask for more in this position right now. It's about carrying that (over) and making sure we're ready to play.\"\n\nThe Hornets entered the night needing a win and a Detroit loss to the New York Knicks to clinch the final playoff spot in the East.\n\nAside from Walker, nothing went right for Charlotte.\n\nThe Knicks, the worst team in the NBA, didn't put up much of a fight, losing by 26 at home to the Pistons in a game that was never close. Charlotte had its four-game winning streak snapped by the Magic.\n\nOrlando, which clinched a playoff spot earlier this week, shot 54.5 percent from the field and got 18 points from D.J. Augustin.\n\nTIP-INS\n\nMagic: Outscored the Hornets in bench points 51-35.\n\nHornets: Bridges didn't wait long to turn in the play of the game, soaring well above the rim for alley-oop dunk to give Charlotte and early 2-0 lead. Borrego said the rookie has a \"high ceiling\" and expects him to be a much better player next year.\n\nPARKER'S STREAK OVER\n\nThe Charlotte loss means Tony Parker's string of 17 straight playoff appearances is over. Parker didn't have a say in the outcome and hasn't played in the team's last 13 games as Borrego elected to go with younger players.\n\n\"That's hard to hear. That's hard to swallow,\" Borrego said of Parker's streak ending. \"I couldn't be more thankful to Tony for what he gave us and gave me this season. He took a chance on me and this organization when he didn't have to but he believed in us. He gave us everything he had.  He helped us on the court and off the court. Tony's footprint is all over this organization.\"\n\nLOCKING IN\n\nOrlando coach Steve Clifford said now it's time for his team to \"lock into\" studying Toronto in all phases of the game.\n\n\"They know us well and we need to know them well, so it's having an offensive plan and defensive plan and everyone knowing what we are trying to do at both ends of the floor,\" Clifford said.\n\nUP NEXT:\n\nMagic: Will face Raptors in the first round of the playoffs.\n\nHornets: Season over.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994337.793086
}