{
  "game_id": "0021500036",
  "espn_id": "400827923",
  "date": "Oct 31, 2015",
  "matchup": "MEM vs. BKN",
  "headline": "Conley scores 22 points as Grizzlies defeat Nets 101-91",
  "body": "MEMPHIS, Tenn. -- Memphis has a reputation of sporadic 3-point shooting. Against the Brooklyn Nets on Saturday night, the Grizzlies converted as many from long range as they had in their first three games combined.\nMike Conley scored 22 points, including 4 of 7 from outside the arc, and had eight assists to lead Memphis to a 101-91 victory.\nMemphis converted 9 of 23 from long range, compared to 3 of 13 for the Nets. Memphis was 9 of 32 from distance in the first three games.\n\"Some nights we don't (make 3s),\" Conley said. \"Tonight, we made some shots. When we're making shots from the outside, I think we're a tough team to beat. The league knows that, and we've just got to find more consistency with it.\"\nTwo of Conley's 3-pointers came in the final 6 minutes, keying the Memphis offense as the Nets tried to rally from a double-digit fourth-quarter deficit that reached as high as 16 points.\n\"All of a sudden, we turned it on, and we started making some plays,\" Nets coach Lionel Hollins said. \"We turned it around.\"\nZach Randolph and Courtney Lee scored 15 points each for Memphis with Randolph grabbing 13 rebounds. Jeff Green finished with 13 points for the Grizzlies.\nBojan Bogdanovic scored 19 points and Jarrett Jack finished with 15 for the Nets (0-3). Brook Lopez had 12 points and 10 rebounds, while Joe Johnson and Thaddeus Young added 11 points each.\nMemphis held its largest lead of the game at 88-72 with 7:42 left. But Brooklyn cut the deficit to 92-84 when Johnson scored inside with 2:25 remaining.\nIn the midst of that, Conley was scoring and not letting the Nets get the lead under eight until less than a minute was left.\nJack hit a 10-footer in the lane with 55.2 seconds left to cut Memphis' lead to 97-91. The Grizzlies scored the final four points, including two free throws by Conley for the final margin.\n\"He really turned it on down the stretch,\" Memphis coach Dave Joerger said of his point guard.\nWhile Memphis was converting its 3-pointers, the Nets were struggling. Wayne Ellington was 2 of 4 from 3-point range, but the rest of the team was 1 for 9.\n\"I think everybody is pretty frustrated at this point,\" Johnson said, \"but we have to keep working. . Just keep going hard on both ends of the floor. It'll come together.\"\nTIP-INS:\nNets: Hollins, who led Memphis to the Western Conference finals in 2013, got a warm ovation when he was introduced. ... The loss evened the all-time series between the teams at 19-19.\nGrizzlies: In the first quarter, Conley surpassed Shareef Abdur-Rahim (7,801) for third on the Grizzlies' career scoring list. Pau Gasol ranks first with 8,966; Rudy Gay second at 8,562. ... Randolph recorded his 444th career double-double. ... Memphis is 4-4 all-time on Halloween.\nA WORTHY NOTE:\nNets forward Thaddeus Young, who is from Memphis, spoke at the local Race for the Cure Saturday morning -- an event designed to raise breast cancer awareness. Young's mother, Lula Hall, died from the disease a year ago.\nGASOL OFF:\nMemphis center Marc Gasol, who entered the game leading the team in scoring at 16 points a game, was held to seven points, missing eight of 10 shots. He banged his right hand in the game, jamming two fingers. \"That's the reason I don't try to dunk. I try to dunk and jammed both my fingers with the backboard,\" Gasol said.\nFINAL WORD:\n\"Now he's healthy and nobody has risen up and said: `I should have that job over him.\" -- Hollins on Markel Brown starting his first game of the season.\nUP NEXT:\nNets: Host Milwaukee on Monday.\nGrizzlies: Visit Golden State on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994489.418466
}