{
  "game_id": "0021600812",
  "espn_id": "400900217",
  "date": "Feb 11, 2017",
  "matchup": "HOU vs. PHX",
  "headline": "Harden's 40 leads Rockets over Suns 133-102",
  "body": "HOUSTON --  After not reaching 40 wins until April 11 last year, the Houston Rockets feel pretty good about where they're at this season after picking up their 40th victory Saturday night.\n\nHowever, they still have plenty of work to do to get to where they want to be.\n\nJames Harden scored 40 points in three quarters and the Rockets never trailed in a 133-102 victory over the short-handed Phoenix Suns.\n\n\"It's good for us,\" Harden said about reaching 40 wins. \"We've got one more game before the break. We need to finish off strong. Guys get to take a couple of days to rest and be ready to go for the last push and the postseason.\"\n\nIt's the most wins the Rockets through the first 57 games of a season since they also won 41 in 1993-94. Houston had just 41 regular-season wins last season.\n\nHouston led by 26 at halftime and opened the second half with a 14-3 run, led by six points from Harden, to make it 91-54 with nine minutes left in the third quarter.\n\n\"They're a young team and they're talented. Couldn't give them any life, especially early in that game,\" Harden said. \"We want to take advantage of these last two games before the break. We don't want to have any let up. So we just came out with some defensive effort, offensively pushed the ball, got open shots and just did our normal thing.\"\n\nHarden made three 3-pointers in the third quarter, capped by one from the top of the key with about 30 seconds left that gave him 40 points. He found Sam Dekker on an alley-oop after that, and the Rockets got a huge ovation when Dekker finished with a one-handed dunk to make it 111-77 entering the fourth quarter.\n\nThe Suns were playing without starters Eric Bledsoe and Tyson Chandler. Devin Booker had 18 points for the Suns, who lost for the ninth time in 11 games.\n\nPhoenix didn't arrive in Houston until 4 a.m. Saturday.\n\n\"Back to backs are tough in the NBA (but) every team goes through it,\" Phoenix's Jared Dudley said. \"Not having Eric, our leader on the floor hurts because he's our engine. You could have had (Michael) Jordan, but when you give up (133) you're not going to beat anybody.\"\n\nHarden is tied with Russell Westbrook for the most 40-point game this season with nine. He made eight 3s and had eight assists and six rebounds. He played just 29 minutes on Saturday night to become the first Rockets player since Sleepy Floyd in 1991 to score 40 points in less than 30 minutes.\n\nHouston scored the first 13 points of the game while the Suns missed their first five shots. The Rockets had built a 27-5 lead after a 3-pointer by Ryan Anderson midway through the first quarter. They were up by 20 later in the quarter before the Suns closed out the opening frame with a 7-1 run to cut the deficit to 38-24 entering the second quarter.\n\nHouston used a 10-4 run to start the second quarter and push the lead to 48-28. Patrick Beverley led the way in that span with two 3-pointers.\n\nHarden made seven points, with five free throws, in the last 90 seconds of first half to leave the Rockets up 77-51 at halftime.\n\nTIP-INS\n\nSuns: Alex Len fouled out with 6:42 remaining. He had 13 points and eight rebounds. ... Saturday was the first game Bledsoe has missed this season. ... T.J. Warren added 14 points.\n\nRockets: Saturday was the eighth time this season the Rockets have had 100 points before the fourth quarter. ... Eric Gordon missed his second straight game with soreness in his lower back. Coach Mike D'Antoni said before the game that he's feeling better and he expects him back for the next game. ... Houston's 77 points in the first half is the most the team has scored in a half this season. ... Beverley had 19 points and has scored 14 points or more in each of the past three games. ...\n\nRAINING THREES\n\nThe Rockets made 18 3-pointers on Saturday night on 50 percent 3-point shooting. The Rockets have made more than 40 percent of their 3-point attempts in each of the last four games and are 16-1 this season when they shoot at least 40 percent. Houston improved to 25-4 this season when making at least 15 3-pointers.\n\nUP NEXT\n\nSuns: Host New Orleans on Monday.\n\nRockets: Host Miami on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995757.410663
}