{
  "game_id": "0022200045",
  "espn_id": "401468200",
  "date": "Oct 24, 2022",
  "matchup": "MIA vs. TOR",
  "headline": "Raptors clamp down on Miami, top Heat 98-90 for split",
  "body": "MIAMI -- — Another game, another close one for the Toronto Raptors. They're noticing a trend.\n\n\r\n              Fred VanVleet scored 24 points, Pascal Siakam added 23 and the Raptors rallied in the fourth quarter to beat the Miami Heat 98-90 on Monday night and split their two-game trip to South Florida.\n\n\r\n              “I think until we smooth the ship out a little bit, we're going to be in a lot of close games,\" VanVleet said. “Coming down the stretch, you've got to be able to execute.\"\n\n\r\n              Toronto’s first four games: a three-point win, a four-point loss, a three-point loss and a now an eight-point victory, all facing teams expecting to be Eastern Conference contenders — Cleveland, Brooklyn, Miami.\n\n\r\n              Total score: Toronto 420, Opponents 416.\n\n\r\n              “The East is not for the faint-hearted,” Raptors coach Nick Nurse said.\n\n\r\n              Gary Trent Jr. scored 18 points, including a 3-pointer that put Toronto up by six with 22.6 seconds left. Precious Achiuwa grabbed 22 rebounds for the Raptors, the most ever by a Toronto reserve.\n\n\r\n              Jimmy Butler scored 26 points for Miami, which got 22 points and 15 rebounds from Tyler Herro. Bam Adebayo had 14 points and Duncan Robinson added 12 for the Heat.\n\n\r\n              Toronto outscored Miami 27-14 in the fourth quarter, getting five 3’s in the final 12 minutes. The Raptors outscored the Heat 42-24 from 3-point range, and 27-13 on fast breaks.\n\n\r\n              “They made shots,\" Heat coach Erik Spoelstra said. “They made some big shots down the stretch, even the ones that we were defending pretty well.\"\n\n\r\n              The Raptors were without reigning NBA rookie of the year Scottie Barnes, who sat out with a sprained right ankle and will be listed as day-to-day. Miami was without Caleb Martin and Nikola Jovic, both suspended one game by the league for their roles in a scuffle during Saturday night’s game. Martin, the league said, instigated the event with Toronto’s Christian Koloko, and Jovic was suspended for leaving the Heat bench area.\n\n\r\n              Siakam started alongside Koloko for Toronto, the first time in NBA history that two players born in Cameroon started for the same team in the same game.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Koloko got his first career start and became the 175th player to get at least one of those for Toronto. ... VanVleet’s first 3-pointer of the night was the 802nd of his career, breaking a tie with Morris Peterson for second-most in Raptors history. Kyle Lowry made 1,518. ... Chris Boucher, making his season debut after recovering from a hamstring issue, had 10 points in 12 minutes.\n\n\r\n              Heat: The Heat were trying to get Butler back into the game in the fourth, but there was no stoppage and Miami didn't have a time-out to burn. Butler played only 3:38 in the final quarter. ... Miami went 1/3 on its season-opening four-game homestand, allowing an average of 108.5 points. ... Victor Oladipo (left knee) and Omer Yurtseven (left ankle) remained sidelined and have yet to make their season debuts. ... The Heat held Toronto to 40% shooting, but shot only 35%.\n\n\r\n              CONTRITE MARTIN\n\n\r\n              Martin spoke out about his suspension, revealing that he called Koloko to apologize and promised him a future dinner. He accepted his sanction, and said his only issue with the penalties handed out during the game and from the league on Sunday was that Koloko paid too high a price. “I don’t think that Christian should have gotten thrown out or ejected anyways. He did what he had to do,” Martin said.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Philadelphia on Wednesday, then will again on Friday.\n\n\r\n              Heat: Visit Portland on Wednesday, the start of a three-game trip. “This is an opportunity for us to really start to connect and face some adversity on the road,\" Spoelstra said.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993997.2955918
}