{
  "game_id": "0021801178",
  "espn_id": "401071851",
  "date": "Apr 04, 2019",
  "matchup": "SAC vs. CLE",
  "headline": "Kings bounce back from 25-point loss to beat Cavs 117-104",
  "body": "SACRAMENTO, Calif. --  Sacramento's Buddy Hield shook off a poor shooting start from 3-point range and inched closer to an NBA record.\n\nHield made five 3-pointers and scored 23 points, De'Aaron Fox had 16 points and 10 assists and the Kings beat the Cleveland Cavaliers 117-104 Thursday night.\n\n\"That's a good win for us,\" Sacramento coach Dave Joerger said. \"The difference was our defensive activity at times was really good. We got deflections. We got steals. We forced them into turnovers.\"\n\nDefinite positives for a young Kings team that was eliminated from playoff contention last week.\n\nAnother bright spot has been Hield's 3-point shooting. He set the Kings' single-season record earlier this season and needs six more 3s to break Damian Lillard's NBA record for most in a player's first three seasons. Lillard, Portland's All-Star point guard, made 599.\n\n\"I wanted to break it tonight,\" said Hield, who shot 5 of 11 from long range. \"I'm blessed. A kid from the Bahamas, I never thought in a million years that I would be doing this. I mean, I thought I would be doing this, but to be here on the highest level of basketball, it's a great accomplishment.\"\n\nWith all his success shooting, Hield struggled handling with a mop, when he tried to assist a ball boy in freeing a ball that was stuck atop the backboard. It took Hield two jabs with the mop before the ball popped out -- but not before Hield suffered a minor injury.\n\n\"I (messed) my finger up,\" Hield said. \"It bent my nail back.\"\n\nMarvin Bagley III scored seven of his 15 points in the fourth quarter, and Bogdan Bogdanovic added 15 points and eight rebounds for Sacramento.\n\nCollin Sexton scored 19 points and joined LeBron James and Ron Harper as the only Cavaliers rookies to score 1,300 points. Sexton is the 10th rookie in the NBA to reach the milestone.\n\nAnte Zizic had 14 points and 10 rebounds, and Larry Nance Jr. added 11 points and 16 boards for Cleveland, which committed 20 turnovers.\n\nThe Cavs (19-60) have lost seven straight.\n\n\"In this building, against the number one fast break team in the league, you cannot turn the basketball over,\" Cleveland coach Larry Drew said. \"We were still right there in a good position but at the end, their size kind of caught up with us.\"\n\nComing off a 130-105 loss to Houston on Tuesday, Sacramento (39-40) never trailed and led by as many as 15 points in completing a season sweep of Cleveland.\n\nThe Kings led 101-95 and then pulled away with a 9-0 run. Bogdanovic started it with a 17-foot jumper and Bagley followed with a 3-pointer and dunk. Kosta Koufas' 12-foot floater put Sacramento ahead by 15.\n\nCleveland made a final push and closed within 110-100 on a bucket by Zizic, but Fox made a long jumper and Hield added a 3-pointer.\n\nCLOSING IN ON 40\n\nThe Kings last won 40 games in 2005-06, which was also the last time they made the playoffs. While the postseason is out of the equation, Sacramento has three games left to get to 40, if not more.\n\n\"That's a big deal,\" Joerger said. \"You've got an opportunity to possibly be in the top 16 records in the NBA. It's a credit to our guys and the jump that they are making in learning and improving on a nightly basis.\"\n\nTIP-INS\n\nCavaliers: Cleveland was hit with two delay-of-game calls in the first quarter, resulting in a one-shot technical. . Tristan Thompson was given the night off for rest.\n\nKings: Bogdanovic made a buzzer-beating 3-pointer at the end of the third. . Sacramento missed seven of its first eight 3-point attempts. . Corey Brewer gave the Kings a scare in the first quarter when he crashed hard to the floor after dunking. Brewer appeared to lose grip of the rim and fell flat on his back and lay on the court for several moments before getting to his feet and remaining in the game.\n\nUP NEXT\n\nCavaliers: At Golden State on Friday.\n\nKings: At Utah on Friday.\n\n--\n\nMore AP NBA:https://apnews.com/tag/NBA andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994156.730593
}