{
  "game_id": "0022200938",
  "espn_id": "401469093",
  "date": "Mar 01, 2023",
  "matchup": "MEM @ HOU",
  "headline": "Bane scores 30 points to lead Grizzlies over Rockets 113-99",
  "body": "HOUSTON -- — Desmond Bane scored 30 points, Ja Morant added 20 and the Memphis Grizzlies breezed by Houston 113-99 on Wednesday night to send the Rockets to their 11th straight loss. \n\n\r\n              Morant wasn’t nearly as dominant against Houston as he was Tuesday night when he scored 28 of his 39 points in the third quarter of a win over the Los Angeles Lakers. But he also had seven assists and seven rebounds against the Rockets without playing in the fourth quarter to help the Grizzlies to their third straight victory. \n\n\r\n              The win snapped an eight-game road skid in the opener of a four-game road trip and was the Grizzlies' first victory away from Memphis since Jan. 14 at Indiana.\n\n\r\n              “Our focus was just trying to right the ship,” coach Taylor Jenkins said. “And any time you can start a road trip with a victory, it just gives you a different mentality for the rest.”\n\n\r\n              After scoring the final six points of the third quarter, Bane — who had nine rebounds and six assists — opened the fourth with five points, capped by a 3-pointer, to extend the Grizzlies' lead to 90-68. \n\n\r\n              Houston scored the next five points, including a 3 by Josh Christopher, but the Grizzlies used an 8-1 spurt to make it 98-74 with nine minutes to go. Jenkins took most of his starters out soon after that with the game out of hand. \n\n\r\n              Bane discussed the difference in the team after halftime. \n\n\r\n              “We made some adjustments and we were able to get some stops that allowed us to get out in transition,” he said. “We were getting great shots in the first half and they weren’t falling, but in the second half they started to fall.”\n\n\r\n              Bane made six of the team’s 17 3-pointers and Dillon Brooks added four and finished with 16 points. \n\n\r\n              Jalen Green scored 20 points and Kenyon Martin Jr. 19 for Houston.\n\n\r\n              Green was disappointed the Rockets let things get away from them in the third quarter after staying close early. \n\n\r\n              “I'm not sure exactly what happened,” he said. “They just hit big shots, started hitting 3s and stuff. We were pretty solid on defense overall during the game, they just go on that run and we couldn't catch up.”\n\n\r\n              Memphis led by 3 early in the third quarter before going on a 16-5 run to make it 69-55 with 5½ minutes left in the quarter. The Grizzlies got one 3 from Bane and two from Brooks to power that run. \n\n\r\n              A 3-pointer by Tari Eason got Houston within 11 later in the third when Morant made a nifty backwards shot in the lane before hitting another short shot on the next possession to make it 79-64.\n\n\r\n              Jae’Sean Tate made consecutive baskets for Houston, but Bane scored the last six points of the quarter to leave the Grizzlies ahead 85-68 entering the fourth. \n\n\r\n              “I thought our execution was pretty much the same for all four quarters,” Jenkins said. “We just started making shots in that third, got us that juice that we needed to build a nice lead going into the fourth.”\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Jaren Jackson Jr. had 17 points and five blocks. ... The Grizzlies made 16 of 19 free throws, with Morant going 7 for 10. \n\n\r\n              Rockets: Kevin Porter Jr. had a tough night in his return after missing 20 games with a bruised toe, going 3 of 11 for 11 points. … TyTy Washington Jr. left in the second half with a migraine and didn’t return. \n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit the Denver Nuggets on Friday night. \n\n\r\n              Rockets: Visit San Antonio on Saturday night before hosting the Spurs on Sunday night. \n\n\r\n              ------ AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994179.456657
}