{
  "game_id": "0021400822",
  "espn_id": "400579114",
  "date": "Feb 22, 2015",
  "matchup": "MIL vs. ATL",
  "headline": "Paul Millsap helps Hawks beat Bucks 97-86",
  "body": "MILWAUKEE -- A late-night study session worked wonders for the Atlanta Hawks.\nThe best team in the Eastern Conference avoided its first three-game slide of the season by pulling away in the fourth quarter against another surprising NBA squad.\nPaul Millsap had 23 points and 16 rebounds in Atlanta's 97-86 win over the Milwaukee Bucks on Sunday, two days after coach Mike Budenholzer had his team in the film room following a 25-point loss to Toronto.\n\n\"It helps to see what you're doing wrong,\" Millsap said. \"Calling guys out letting them know it's not going to be acceptable. Tonight, guys were playing well.\"\nKyle Korver hit three 3-pointers in the fourth quarter after Atlanta squandered an early 16-point lead. Korver finished with 12 points.\nGiannis Antetokounmpo's two foul shots for Milwaukee with 49 seconds left in the third quarter tied it at 64.\nBut Atlanta returned to its usual formula in the final period, making extra passes on offense and frustrating the Bucks on defense.\nAtlanta opened the fourth with a 24-9 run, including a 3 and an open layup by Millsap for a 90-73 lead with 5:05 left.\n\"We had that third quarter where it got tight,\" Budenholzer said. \"It was good for our group to have it get tight and then respond and find a way (and) get ... better defensively.\nAntetokounmpo and Khris Middleton each finished with 19 points for Milwaukee, which had won four in a row.\nBoth teams seem bound for the playoffs while playing similar brands of team-oriented, defensive-focused basketball.\nMilwaukee was the better squad in the third quarter with five offensive rebounds, five assists and four steals.\nThe athletic Bucks outhustled the Hawks during the period. Antetokounmpo seemed rejuvenated after being whistled for a foul, following the call with two dunks that he finished off with frowns as he jogged back on defense.\nKorver's catch-and-shoot 3s from the wing left Milwaukee frustrated in the fourth. Two shots came in about a 26-second span that turned a five-point lead into a 79-68 edge with 9:30 left.\n\"We fought, we definitely did what we had to do in the third quarter but we gave Korver two good looks and he capitalized on it,\" Bucks coach Jason Kidd said.\nIt was reminiscent of the Hawks' impressive play in the first half.\nThey lured dribblers into double teams along the sideline, possessions which usually led to bad shots or one of Milwaukee's 15 first-half turnovers. The Bucks shot 53 percent in the half but still ended up trailing by double digits.\nTURNING POINT\nKorver's 3 with 9:30 left ended a five-point swing that started with Milwaukee center Zaza Pachulia being called for a flagrant foul for throwing an elbow at the face of Dennis Schroeder while going for a rebound. Schroeder hit two foul shots and Korver flew around a screen for a 3 on the left wing on the next play.\nPachulia said he felt someone was pushing from behind, so he was trying to create space under the glass.\n\"But you know, you've got to move on, you make mistakes throughout the game, but you've got to move on,\" he said. \"For 48 minutes, I don't think we shared the ball, a lot of isolations for us and it's not how we play.\"\nTIP INS\nHawks: The film study session came with the Hawks coming off a 3-4 stretch. \"I think we are always looking for opportunities to learn, improve and be critical of ourselves. I think Friday night was a good night to learn and improve and get better from,\" Budenholzer said. Asked whether his players gave input during the film session, the coach smiled and indicated it was basically a one-way conversation.\nBucks: Guard Michael Carter-Williams, who was acquired from Philadelphia at the trade deadline, missed a second straight game with a right foot injury. ... Forward Johnny O'Bryant was a late scratch for personal reasons.\nUP NEXT\nHawks: Host Dallas on Wednesday night.\nBucks: Visit Chicago on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764991774.17589
}