{
  "game_id": "0022400230",
  "espn_id": "401704796",
  "date": "Nov 16, 2024",
  "matchup": "TOR @ BOS",
  "headline": "Tatum's 3-pointer at the buzzer in overtime gives the Celtics a 126-123 victory over the Raptors",
  "body": "BOSTON -- — Jayson Tatum hit a 3-pointer at the buzzer in overtime and the Boston Celtics rallied to beat the Toronto Raptors 126-123 on Saturday night. \n\n\r\n              Tatum finished with 24 points and 11 rebounds. Jaylen Brown added 27 points. Al Horford and Derrick White scored 18 points apiece. \n\n\r\n              Toronto has lost seven straight and failed to register its first road win of the season despite getting a career-high 35 points from Jakob Poeltl, who finished 16 of 19 from the field with 12 rebounds. RJ Barrett added 25 points and 10 rebounds. \n\n\r\n              With the game tied at 112 in regulation, Barrett connected on a runner in the lane and was fouled by Brown with 59 seconds remaining. But Barrett missed his ensuing free throw. \n\n\r\n              Boston’s Neemias Queta, who started in place of Jrue Holiday (left knee tendinopathy), scored a driving layup on Boston’s next possession.\n\n\r\n              Takeaways\r\n              Raptors: The Raptors entered with Scottie Barnes (orbital fracture) and Bruce Brown (right knee) on the mend. They dodged another big injury. Bruno Fernando was helped off the court in the second quarter after landing awkwardly on a teammate’s foot while pulling down a rebound. But he was able to return. \n\n\r\n              Celtics: The Celtics improved to 11-3 and avoided losing for the third time at TD Garden this season. \n\n\r\n              Key moment\r\n              With the game tied at 123, Toronto won a coach’s challenge on an out of bounds call that originally was awarded to Boston. But Barrett had his driving layup attempt blocked by Queta, giving the ball back to the Celtics with 20.2 seconds remaining. \n\n\r\n              Key Stat\r\n              The Raptors outscored the Celtics 76-42 in the paint. Boston gave up 68 points to Atlanta during its NBA Cup loss to the Hawks earlier this week. \n\n\r\n              Up next\r\n              The Raptors host the Indiana Pacers on Monday. The Celtics resume NBA Cup play on Tuesday against the Cleveland Cavaliers. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996993.181536
}