{
  "game_id": "0022300566",
  "espn_id": "401585194",
  "date": "Jan 16, 2024",
  "matchup": "PHI vs. DEN",
  "headline": "Joel Embiid outshines Nikola Jokic in NBA MVPs matchup, leads 76ers past Nuggets 126-121",
  "body": "PHILADELPHIA -- — Joel Embiid palmed Nikola Jokic's head and whispered into his ear with the highest of praise one MVP could tell another in the aftermath of an epic showdown.\n\n\r\n              Embiid told Jokic that his counterpart was \"the best player in the league.”\n\n\r\n              With good reason: Jokic does have an NBA Finals MVP and a championship ring. Embiid is doing his best to chase him down.\n\n\r\n              Embiid had 41 points and 10 assists to lead the Philadelphia 76ers past Jokic and the Denver Nuggets 126-121 on Tuesday night in a battle of the last two NBA MVP s.\n\n\r\n              Jokic held up his end of a heavyweight showdown with 25 points and 19 rebounds, including 11 offensive boards.\n\n\r\n              “It's funny, because Twitter, we have a war going on between Philly fans and Denver fans,” Embiid said. \"It's funny because both of us are just like, who cares? We want to play basketball and win some games. But he deserves (the praise). Until you knock him down, that's the best in the league. He's the finals MVP. Until you take that away, he can claim that.\n\n\r\n              “But then again, I also believe in myself.”\n\n\r\n              Tyrese Maxey scored 25 points and Tobias Harris had 24 for the Sixers.\n\n\r\n              Embiid got the better of Jokic late, buoyed by a three-point play that stretched the Sixers’ lead. Embiid was fouled on a bucket and crotch-chopped in celebration toward the fans. He made the free throw for a 118-113 lead. Embiid followed with a 3-pointer for an eight-point lead and showed the Sixers are as good as any team when he’s healthy -- even against the NBA champs.\n\n\r\n              Embiid gave the Sixers a scare when he fouled Michael Porter Jr. on a 3-point attempt with 26.6 seconds left. Porter hit the three free throws that pulled the Nuggets within four. Time simply ran out on a comeback.\n\n\r\n              Anyone care for a rematch in June?\n\n\r\n              “I'm not playing against him, I'm playing against Philadelphia,” Jokic said. “It was a good matchup.”\n\n\r\n              Jokic won two straight NBA MVP awards and was beat out last season by Embiid for the honor. Embiid, a two-time defending scoring champ, again leads the league in scoring. Jokic averaged 25.5 points and had Denver rolling with one of the best records in the NBA.\n\n\r\n              Embiid had his 18th straight 30-point game, tying Hall of Famer Elgin Baylor for the sixth-longest streak in NBA history. \n\n\r\n              “The card tonight is more than just the big heavyweight matchup,” 76ers coach Nick Nurse said ahead of tipoff. “There’s a little bit more going on. I think it’s going to be worth going out there for tonight to watch it.”\n\n\r\n              He was on target.\n\n\r\n              The 76ers and Nuggets played one of the most entertaining halves of the season, a 78-all tie, and jolted another packed house onto their feet from the tip.\n\n\r\n              With a national audience watching and Julius Erving in the house, the stars delivered. Embiid and Maxey combined to make 6 of their first 9 shots for 14 points. Jokic and Jamal Murray, who finished with 17 points and 10 assists, kept pace in the shootout.\n\n\r\n              The MVPs showed why each could win another one this season. Embiid buried a 3 that cut it to 30-29 only or Jokic to come back and lay it up over the 76ers center for a 32-29 lead.\n\n\r\n              Embiid placed his hand on Jokic’s back when the Serbian dribbled toward the bucket. Embiid was whistled for a reach-in foul and threw his arms in the air in protest. Nurse barked at the officials. The crowd unkindly chanted at the refs what they thought of them.\n\n\r\n              Kelly Oubre Jr. and Harris finished consecutive alley-oops that sent the crowd into a frenzy. When Murray hit a 3 at the horn, the teams went into halftime tied.\n\n\r\n              Embiid scored 23 points and the 76ers shot 67% from the floor. Jokic had 15 and Denver shot 58% in the half. The teams combined for 17 3s and both shot over 53% in a half with a frantic, videogame feel.\n\n\r\n              “This is my first time with this team against these guys,” Nurse said. “Where are we compared to these guys? What’s it look like up close? I hope we can get something out of that.”\n\n\r\n              Philly sure did: a W.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Hope to have an easier time getting to Boston for Friday's game than they did with a nearly nine-hour flight to Philadelphia.\n\n\r\n              76ers: Visit Orlando on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996426.174957
}