{
  "game_id": "0022300431",
  "espn_id": "401585059",
  "date": "Dec 29, 2023",
  "matchup": "ATL vs. SAC",
  "headline": "De'Aaron Fox's big second half leads Kings to 117-110 come-from-behind win over Hawks",
  "body": "ATLANTA -- — De'Aaron Fox scored 26 of his 31 points after halftime and the Sacramento Kings rallied from a 23-point, first-quarter deficit to beat the Atlanta Hawks 117-110 on Friday night.\n\n\r\n              Domantas Sabonis had 25 points and 10 rebounds for the Kings, who snapped a two-game skid.\n\n\r\n              Trey Lyles added 19 points and Malik Monk had 15 for the Kings.\n\n\r\n              “We got punched in the mouth, but we didn’t fold,” said Kings guard Davion Mitchell, who coach Mike Brown said was the defensive player of the game. “We played hard throughout the whole game.”\n\n\r\n              Trae Young led the Hawks with 24 points and matched a career high with five steals. Dejounte Murray had 18 points, but shot 7 for 20 from the floor for Atlanta, which has lost four straight and 10 of 13.\n\n\r\n              For the second straight game, Fox set a career high for made 3-pointers. He made seven against Portland on Tuesday, then topped that with 8-for-16 shooting from beyond the arc against the Hawks.\n\n\r\n              “They were giving him the 3-ball night. He’s shown he can knock that shot down. That’s a big night for him,” Brown said. “To set a career high in a game this close, with that many attempts, that shows that he can be a special player in this league.”\n\n\r\n              The Kings trailed for most of the night, and were down 14 with eight minutes to play before closing the game on a 24-5 run. The Kings shot 12 for 18 (67%) in the fourth quarter, while the Hawks were limited to 7 for 26 (27%). The Hawks did not score in the final 4:45 and missed their final eight shots.\n\n\r\n              “Just a huge defensive effort,” said Brown, whose team held the Hawks to 39% shooting for the game. “It started with our defense tonight.”\n\n\r\n              Jalen Johnson had 16 points and a career-high 15 rebounds.\n\n\r\n              The Hawks were rolling early, building a 31=8 lead in just over eight minutes. All five starters scored in the first six minutes. The Kings gradually closed the gap thanks to Monk, who had 13 first-half points off the bench.\n\n\r\n              “I just try to provide a spark,” he said. \n\n\r\n              The Hawks ended the first half on an 8-0 run in the final minute thanks to Johnson's 3-pointer and layup, and a three-point play by Young that gave the Hawks a 71-53 lead heading into halftime.\n\n\r\n              Hawks starting forward De'Andre Hunter missed his sixth straight game with right knee inflammation. \n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit the Grizzlies on Sunday to wrap up a three-game road trip.\n\n\r\n              Hawks: At the Wizards on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996298.002344
}