{
  "game_id": "0022200744",
  "espn_id": "401468899",
  "date": "Jan 28, 2023",
  "matchup": "CHI @ ORL",
  "headline": "DeRozan, LaVine lead Bulls to 128-109 win over Magic",
  "body": "ORLANDO, Fla. -- — DeMar DeRozan and Zach LaVine each scored 32 points, Nikola Vucevic added 26 points and 13 rebounds and the Chicago Bulls turned back a late rally and beat the Orlando Magic 128-109 on Saturday night.\n\n\r\n              Mo Wagner led the Magic with 27 points, combining with Cole Anthony and Jalen Suggs to lead a furious second-half rally that cut a 25-point deficit to six with 5:08 remaining.\n\n\r\n              “I thought we controlled most of the game,” said Vucevic, who had 17 points and eight rebounds in the first half. \"They made a really good run and they cut it close. It's been an issue for us all year long, playing with big leads. We let them back in the game, but this time we were able to finish the game off.”\n\n\r\n              Patrick Williams had 16 points and six rebounds for the Bulls, who shot 59.3% for the game just two nights after getting outscored by 23 points in the second half of a loss at Charlotte.\n\n\r\n              “In the Charlotte game we never responded,” coach Billy Donovan said. “The encouraging part is we did respond (tonight). I think it’s good that we had that. ... Being pressed against it, we needed a game where we could respond and come out on the winning side.”\n\n\r\n              The Bulls led 60-47 at halftime. A 3-pointer by Vucevic, who played more than eight seasons in Orlando, stretched their lead to 24 points and a free throw by LaVine made it 89-64, Chicago's largest lead of the game, with 3:27 left in the third quarter.\n\n\r\n              “I don’t know how, but we found some energy and we went on a run, got some easy buckets, hit some shots,” said Anthony, who finished with 21 points, six rebounds and six assists.\n\n\r\n              Wagner scored the Magic's final 11 points in the third period and their first five points in the fourth, pulling the Magic back into contention. But when the Bulls' lead got down to six, DeRozan and LaVine responded with baskets, and a 3-pointer by Williams made it 116-106 with 3:29 left.\n\n\r\n              Magic coach Jamahl Mosley thought the bad start cost his team the game.\n\n\r\n              “Obviously the energy level wasn’t where we wanted it to start the game,” he said. “I really think sometimes it falls down to taking the easy route, in some ways. When it’s hard, you just want to catch and shoot. But we weren’t making shots, and that takes its toll on the defense. But we have to be a defensive team first, whether the shots are falling or not.”\n\n\r\n              “This is not an excuse but we were just flat,” said Mo Wagner, “and part of that was we put our head down too quickly. We kind of let go of our focus.”\n\n\r\n              TIP-INS\n\n\r\n              Bulls: G Lonzo Ball, who has not played since tearing his left meniscus on May 10, 2021, is not yet back to running on a consistent basis and will likely not play this season, unless he is making progress by the All-Star break, according to coach Billy Donovan. ... F Derrick Jones Jr., limped off the floor in the third quarter, but came back to play four minutes in the fourth. . . . G Goran Dragic had seven points in 13 minutes after missing three games due to illness. ... DeRozan, who came into the game with a 26.3 scoring average, played eight scoreless minutes in the first quarter without taking a shot.\n\n\r\n              Magic: F Jonathan Isaac had five points and four rebounds in nine minutes in his third game back from a knee injury. ... The Magic missed their first eight 3-point attempts and finished 10 for 28. . . . Anthony has scored 18 or points in four of his last six games, all off the bench.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host the L.A. Clippers on Tuesday night.\n\n\r\n              Magic: Play at Philadelphia on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994484.94772
}