{
  "game_id": "0021600681",
  "espn_id": "400900102",
  "date": "Jan 25, 2017",
  "matchup": "HOU @ BOS",
  "headline": "Thomas, Crowder push Celtics past Rockets, 120-109",
  "body": "BOSTON -- In a midseason matchup of MVP contenders, the loudest chants at TD Garden were for the little guy carrying the Celtics.\nAs the amped-up crowd serenaded Isaiah Thomas, the 5-foot-9 star played like an MVP with 38 points and nine assists to help Boston beat James Harden and the Houston Rockets 120-109 on Wednesday night.\n\"It's stuff you dream of as a little kid,\" Thomas said. \"I always said to be in the Garden, to play for the Celtics and for them to be chanting MVP is like, it doesn't seem real.\"\nIt was Thomas' 15th game this season with at least 30 points and his 29th consecutive outing with 20 or more. Jae Crowder added 23 points and 10 rebounds, and Al Horford totaled 20 points and nine assists for Boston (27-18), which had lost three straight.\nHarden finished with 30 points and 12 assists, Ryan Anderson scored 19 and Sam Dekker had 15 off the bench as the Rockets (34-15) lost for the sixth time in nine games.\n\"They created a lot of mismatches,\" Harden said after a 6-for-18 shooting night. \"Isaiah made big plays, whether it was scoring or making the right pass.\"\nBoston erased a 58-52 halftime deficit and led by as many as eight in the third quarter before Houston pulled to 88-86 entering the fourth.\nWith 5:12 remaining and the game tied at 98, Thomas hit two free throws after a flagrant-1 foul on Harden and followed with a jumper and a driving hook to put the Celtics up 104-98.\nTerry Rozier hit a 3-pointer before layups by Horford and Crowder capped the 13-2 spurt that put the game out of reach.\nHarden scored 37 points and the Rockets escaped with a 107-106 win in their only other meeting with Boston this season at Houston on Dec. 5. Horford missed a potential game-winning layup as time expired.\n\"I felt like I played a good game there and had a good shot to win and didn't make it,\" Horford said. \"But that's in the past and we had a good opportunity here and we won.\"\nTIP-INS\nRockets: G Eric Gordon (lower back tightness) was a last-minute scratch. \"He just went out to shoot and felt good. Then during the shooting, something just caught him,\" coach Mike D'Antoni said. ... C Nene (rest) had the night off after playing two games in three days before Tuesday's off day.\nCeltics: F Jonas Jerebko was on the receiving end of Harden's flagrant-1 foul in the fourth. Harden's hit split Jerebko's lip open, and he received stitches after the game. \"It wasn't intentional or anything,\" Jerebko said. \"Stuff happens.\" ... G Avery Bradley (sore right Achilles) missed his fourth straight game. Boston coach Brad Stevens said last Saturday that Bradley would miss all four games this week.\nSMART SAYS SORRY\nSmart apologized for his heated argument with assistant coaches during the closing seconds of Tuesday's game at Washington, calling his behavior \"childish and unprofessional\" on Twitter. Smart did not start Wednesday, but Stevens said that had nothing to do with the outburst.\n\"That was one of the first times where you could tell his emotions took control of him,\" Thomas said. \"We know he means well ... and we need (him) to be Marcus Smart, and he was Marcus Smart tonight.\"\nSmart had seven points and six assists in 30 minutes.\nELECTRIC GREEN\nThe Celtics announced a sponsorship deal with General Electric and will wear \"GE\" patches on their jerseys starting next season. Boston's home and away uniforms haven't changed much over the years, but Stevens didn't have any problems with the patches.\n\"We wore (alternate) gray (jerseys) with sleeves yesterday,\" Stevens said. \"It seems like they change every week. I can't keep up with them.\"\nUP NEXT\nRockets: Continue a five-game road trip at Philadelphia on Friday.\nCeltics: Wrap up a two-game homestand Friday against Orlando.",
  "source": "espn_api",
  "crawled_at": 1764995768.373675
}