{
  "game_id": "401809980",
  "espn_id": "401809980",
  "date": "Oct 28, 2025",
  "matchup": "MIL vs NY",
  "headline": "Antetokounmpo scores 37, Rollins adds 25 in Bucks' 121-111 victory over Knicks",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 37 points, eight rebounds and seven assists as the Milwaukee Bucks erased a 12-point halftime deficit and beat the New York Knicks 121-111 on Tuesday night.\n\n\r\n              Milwaukee's Ryan Rollins added a career-high 25 points. New York’s Jalen Brunson scored 36 points but hurt himself midway through the fourth quarter in a play that sparked Milwaukee’s winning rally.\n\n\r\n              Brunson appeared to injure his leg initially while scrambling for a loose ball in the fourth quarter. He remained on the floor but was moving gingerly. Then, he was dribbling behind the 3-point line near Milwaukee’s bench when he fell backward in clear pain and lost the ball.\n\n\r\n              As Brunson continued to sit on the floor, Antetokounmpo got a steal and dunked on the other end to tie the game at 103-all with 6:13 remaining and start an 8-0 run.\n\n\r\n              Brunson stayed in the game after a timeout, but the Knicks couldn’t slow Milwaukee’s momentum. Antetokounmpo put Milwaukee ahead for good by converting a running layup with 5:31 left.\n\n\r\n              Mikal Bridges had 24 points for New York.\n\n\r\n              Milwaukee, which trailed 71-59 at halftime, snapped New York’s five-game winning streak in this series. Milwaukee had won nine straight from the Knicks immediately before this stretch, which began on Christmas Day of 2023.\n\n\r\n              The Bucks were coming off a 118-113 loss at Cleveland in which they were missing Kevin Porter Jr. (sprained left ankle), Kyle Kuzma (sprained left ankle) and Cole Anthony (illness). Anthony and Kuzma returned to action Tuesday, but Porter missed a third straight game.\n\n\r\n              Bucks coach Doc Rivers said before the game that Porter's “going to be out a bit” and that it's too early to tell when the guard might return.\n\n\r\n              “We're not going to rush him because we don't want this to become chronic,” Rivers said. “It was a bad turn, so we just want to be patient.”\n\n\r\n              New York remained without Mitchell Robinson, who hasn't played yet this season as the Knicks continue to monitor his injured left ankle.\n\n\r\n              Up Next\r\n              Knicks: At the Chicago Bulls on Friday\n\n\r\n              Bucks: Host the Golden State Warriors on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042519.42216
}