{
  "game_id": "0021801114",
  "espn_id": "401071787",
  "date": "Mar 26, 2019",
  "matchup": "SAC @ DAL",
  "headline": "Kings top Mavs despite Doncic's 7th triple-double",
  "body": "DALLAS -- Buddy Hield put Sacramento in front with a 3-pointer. His young backcourt mate De'Aaron Fox kept the Kings there.\nFox's 23 points included a crucial basket for a four-point lead in the final minute, not long after Hield's go-ahead 3, and the Kings beat the Dallas Mavericks 125-121 on Tuesday night.\nWith the Kings leading by two points, Fox drove and missed a layup, but he grabbed his own rebound and tried again. The second driving attempt went in for a 121-117 lead with 26 seconds remaining as Sacramento finished 3-0 against Mavericks, sweeping the season series for the first time since 1997-98.\nThe pair combined for 22 points in the fourth quarter, after they had just nine at halftime. Hield scored 15 of his 17 points in the second half, including the 3-pointer to put the Kings ahead for good with 1:07 remaining.\n\"Just guys that want to step up in those moments,'' said Fox, who was 11-of-12 from the free throw line to offset a 6-of-16 shooting night. \"You got a lot of guys in here that want to take that big shot. We were able to do it today.''\nDallas rookie sensation Luka Doncic tied Magic Johnson with his seventh triple-double in his first season, tallying 28 points, 12 rebounds and 12 assists. It's the third-most triple-doubles by a rookie and tied for the most by a player before his 21st birthday, according to Elias Sports Bureau research.\nMarvin Bagley III, taken one pick ahead of Doncic at No. 2 overall in last year's draft, scored 14 points for the Kings after coach Dave Joerger said before the game, \"He's the rookie of the year, on my roster.'' Doncic is considered the front-runner for the award.\nDoncic's 3-point slump continued as he missed all nine from beyond the arc. He is shooting 22 percent in March. The 20-year-old was 10-of-11 from the free throw line, where he also has struggled lately.\nHarrison Barnes scored 18 points in his first appearance at American Airlines Center since the Mavericks traded him to Sacramento while he was playing in a game on his old home court Feb. 6.\nTIP-INS\nKings: G Yogi Ferrell, whose flashy debut with the Mavericks on a 10-day contract two years ago earned him longer-term deals with Dallas and Sacramento, had seven points against his former team. ... C Willie Cauley-Stein scored 16 points, and G Bogdan Bogdanovic matched Bagley with 14.\nMavericks: Doncic has seven of the eight triple-doubles by rookies this season. Atlanta Hawks guard Trae Young, the fifth overall pick who was traded for Doncic on draft night, has the other. ... F Dwight Powell had 21 points and a season-high 13 rebounds. ... F Justin Jackson, who came to Dallas in the Barnes deal, started against his former team but had just two points.\nDIRK SITS\nDirk Nowitzki, in a record 21st season with the same franchise, didn't play in the second half for the Mavericks after scoring nine points before halftime.\nCoach Rick Carlisle said the 40-year-old forward wanted to come off the bench in the third quarter after starting. The matchup problems that prompted Nowitzki's request continued in the second half.\n\"I was talking to him during the second half, and we pretty much agreed it would be tough to get him back in there, especially as cold as he was at that point,'' Carlisle said.\nComing off a season-high 21 points in a surprising blowout of the Golden State Warriors, Nowitzki has four home games remaining in what is expected to be his final season.\nUP NEXT\nKings: At the New Orleans Pelicans on Thursday.\nMavericks: At the Miami Heat on Thursday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994162.556891
}