{
  "game_id": "0021800270",
  "espn_id": "401070951",
  "date": "Nov 23, 2018",
  "matchup": "PHI vs. CLE",
  "headline": "Sixers' home winning streak snapped by Cavaliers",
  "body": "PHILADELPHIA -- On paper, it looked like a mismatch. The Cavaliers didn't view their game against the 76ers that way and it showed.\nJordan Clarkson scored 14 of his 19 points in the fourth quarter, Rodney Hood had 25, and Cleveland stunned Philadelphia 121-112 on Friday night, snapping the 76ers' perfect home record.\nPhiladelphia entered as the NBA's lone undefeated team at home at 10-0, while the Cavaliers were 0-8 on the road with the worst overall record in the league at 2-14.\n\"We're not really going to look at our record and count ourselves out of any game,\" coach Larry Drew said. \"We knew it was going to be a tough task. We knew we had to be on point on both ends of the floor. I'm just happy our guys played with the effort and energy they did. And it finally paid off.\"\nCollin Sexton added 23 points, Cedi Osman scored 20, and Tristan Thompson had 18 points and 13 rebounds for the Cavaliers, who had lost three in a row, including Wednesday's 109-105 home defeat to the Lakers in LeBron James' return to Cleveland.\n\"Despite our record, we're tough and resilient,\" said Andrew Harrison, who made a key 3-pointer with 5:12 remaining. \"We all play hard. If we continue to do what we're doing, [the record] will get better.\"\nJoel Embiid had 24 points and 12 rebounds for Philadelphia, which had won four in a row overall and 20 consecutive contests at home dating to last season. The 76ers' last home loss came on March 13, a 101-98 defeat to Indiana.\nPhiladelphia was booed by a large contingent of the sold-out crowd late in the contest.\n\"We had no spirit,\" 76ers coach Brett Brown said. \"We didn't play defense in front of our home fans. We're at home. That's a game that you win.\"\nJJ Redick scored 23 points and Ben Simmons and Jimmy Butler had 22 apiece for the 76ers. Simmons added 10 assists.\n\"It doesn't feel good,\" Embiid said. \"We have to learn from it. They came here tonight to prove themselves.\"\nThe Cavaliers slowly extended their one-point lead to start the fourth. Cleveland took leads of seven, eight, nine -- on Harrison's 3 -- and 11 before increasing it to 12 on Clarkson's 3 from the right wing with 3:50 left. The advantage eventually grew to 15 points on Clarkson's layup with 1:48, when the outcome was no longer in doubt.\n\"Once he gets going, he's tough to defend,\" Drew said. \"We count on him to bring instant offense, and he did tonight.\"\nThe 76ers took their largest lead on Simmons' layup that made it 79-74 with 2:53 left in the third quarter. The Cavaliers finished the period by scoring 10 of the final 14 points to enter the fourth up 84-83.\nFOR STARTERS\nPhiladelphia came out sluggish to start the contest, and the Cavaliers took advantage by scoring the first seven points and growing their lead to 22-8 on Sexton's jumper with 4:08 remaining in the first.\n\"I thought our guys came out at the start of the game and really dictated the pace of the game,\" Drew said. \"Offensively, I thought we did a really good job of executing and we were able to sustain for four quarters.\"\nHOT SHOOTING\nThe Cavaliers shot 52.7 percent from the field and made 11 of 22 3-pointers.\n\"That's the NBA, anybody on any roster can get hot at any time,\" Butler said. \"They had one of those nights where they were making shots. We have to do a better job of taking them away.\"\nTIP-INS\nCavaliers: Cleveland played its second game without JR Smith since Tuesday's announcement that the Cavaliers sent home the veteran guard, who has requested a trade. ... G George Hill (sprained right shoulder) missed his seventh straight contest.\n76ers: Philadelphia's record for consecutive home victories is 24, set during its 1983 championship season from Nov. 27, 1982, to March 23, 1983. ... G Markelle Fultz missed his second straight game following his agent's announcement on Tuesday that Fultz wouldn't practice or play until having his right shoulder examined. Fultz, who sat on the 76ers bench, is scheduled to see a specialist on Monday in New York. ... Philadelphia native and former middleweight boxing champion Bernard Hopkins sat courtside.\nUP NEXT\nCavaliers: Host Houston on Saturday night.\n76ers: At Brooklyn on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994061.459826
}