{
  "game_id": "0021800437",
  "espn_id": "401071118",
  "date": "Dec 16, 2018",
  "matchup": "PHI @ CLE",
  "headline": "Jimmy Butler returns as 76ers cruise to win in Cleveland",
  "body": "CLEVELAND -- Jimmy Butler's return brought out the best in his Philadelphia teammates.\nBen Simmons had 22 points, 11 rebounds and 14 assists for his third triple-double of the season, Joel Embiid scored 24 points and the 76ers routed the Cleveland Cavaliers 128-105 on Sunday.\nButler scored 19 points after missing two games -- both losses -- with a strained groin.\n\"He's such a large personality and his talent is sort of a spirit he brings to our group,\" coach Brett Brown said.\nButler was 6-of-10 from the field and hit three 3-pointers. He gave Simmons most of the credit.\n\"Ben is doing what he always does for us, passing the ball,\" Butler said. \"When he's playing like that, the game is really easy for everybody.\"\nSimmons had his 15th career triple-double.\n\"Having Jimmy back helped because we had multiple guys that could put it away,\" he said. \"I just do what I can offensively and help find guys who are scoring. Numbers are numbers. Obviously, stat-wise, it looks good.\"\nLandry Shamet added 16 points for Philadelphia, J.J. Redick had 14 points and Wilson Chandler 11.\nCedi Osman and Jordan Clarkson each scored 18 points for Cleveland. Rodney Hood and Matthew Dellavedova each had 13 points, and rookie point guard Collin Sexton added 12.\nPhiladelphia broke it open after Cleveland cut a 13-point lead to 86-85 late in the third quarter.\nThe Sixers led 86-73 midway through the quarter, but Cleveland scored 12 straight points and trailed by one after Larry Nance Jr.'s dunk. Chandler hit a 3-pointer from the corner as time ran out in the period, starting the deciding run.\n\"The margin for error in this game is very small for us,\" Cavaliers coach Larry Drew said. \"Margin for errors is not just a turnover -- it's a bad shot, it's not getting back defensively.\"\nThe Cavaliers led 44-34 early in the second quarter, but Philadelphia ended the first half on a 31-14 run.\nButler was injured in the first quarter Monday against Detroit and went scoreless in 10 minutes. Philadelphia won that game but lost to Brooklyn and Indiana with Butler out.\n\"I felt good,\" he said. \"When you play with such good guys that draw so much attention, I have the easy job. I hang my hat on defense. I don't care how many shots I get or anything.\"\nTOUGH MATCHUP\nDrew knows even trying to slow down Embiid is not an easy task. Not only is the 7-footer a dominant player in the lane, he also has hit 36 3-pointers this season.\n\"He's a force -- size, the ability to shoot it from the 3, the ability to take it off the dribble,\" Drew said. \"You don't see a guy that size being able to shoot the ball as well as he does from the 3. Where he's most deadly is when he's playing with his back to the basket. Just for his size alone, I don't think anybody can defend him one-on-one down low because he's just too big.\"\nLONG TRIP\nThe Sixers complete a challenging back-to-back set in San Antonio on Monday. Simmons was the only player to go more than 30 minutes as Brown made liberal use of his bench.\n\"I'm happy to get on a plane and know nobody played reckless minutes, and we got the win,\" Brown said.\nTIP-INS\n76ers: Redick was limping after landing awkwardly while being fouled in the first quarter, but he remained in the game and played 28 minutes. ... Brown walked halfway on the floor to call timeout after Osman drove the length of the floor for an uncontested layup in the second quarter.\nCavaliers: Hood picked up two fouls in the first 1:13 and went to the bench. ... Ante Zizic started at center after not playing in four straight games. Zizic and Nance each picked up two fouls in the first quarter trying to guard Embiid. ... Channing Frye, who started the previous two games in place of the injured Tristan Thompson, entered the game late in the period.\nUP NEXT\n76ers: At San Antonio on Monday night.\nCavaliers: At Indiana on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994048.3007581
}