{
  "game_id": "401809812",
  "espn_id": "401809812",
  "date": "Nov 28, 2025",
  "matchup": "BKN vs PHI",
  "headline": "Tyrese Maxey scores 22 points, 76ers beat Nets 115-103",
  "body": "NEW YORK -- — Tyrese Maxey scored 22 points, Jared McCain had 20 off the bench and the Philadelphia 76ers beat the Brooklyn Nets 115-103 on Friday night in an NBA Cup game.\n\n\r\n              Quentin Grimes added 19 points, and Paul George had 14 to help the short-handed 76ers snap a two-game losing streak.\n\n\r\n              The 76ers played without starting center Joel Embiid (right knee management) and VJ Edgecombe (left calf tightness), and then lost backup center Andre Drummond (sprained right knee) midway through the second quarter.\n\n\r\n               Drummond attempted to block Tyrese Martin’s floater and then tried to grab the rebound with his left hand, but fell on the court and immediately reached for his knee.\n\n\r\n              Egor Demin scored a career-high 23 points, and Tyrese Martin had 16 for Brooklyn. The Nets have lost three consecutive games and fell to 0-9 at home this season. They are the only team without a home win this season, with their last one at Barclays Center on April 8 against New Orleans.\n\n\r\n              The 76ers led by 1 points in the first half and saw their lead cut to nine after Brooklyn went on an 11-2 run, capped by Denim’s 3-pointer that made it 74-65 with 4:07 left in the third quarter.\n\n\r\n              Denim cut it to nine again with a 3-pointer with 4:35 to play. Demin’s layup made it 112-103 with 1:13 left in regulation before Grimes found an open Adem Bona, whose 3-pointer extended the lead for good.\n\n\r\n              Both teams were 1/3 in NBA Cup play.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Atlanta on Sunday night.\n\n\r\n              Nets: At Milwaukee on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042706.84847
}