{
  "game_id": "0021800175",
  "espn_id": "401070856",
  "date": "Nov 10, 2018",
  "matchup": "MIL @ LAC",
  "headline": "Williams' jumper helps Clippers edge Bucks 128-120 in OT",
  "body": "LOS ANGELES --  Montrezl Harrell left his diamond-studded Energizer bunny necklace at home.\n\nBut not the zest it represents. He always has plenty of that.\n\nHarrell scored 26 points off the bench, Lou Williams hit a driving layup with .3 seconds remaining in overtime and the Los Angeles Clippers edged the Milwaukee Bucks 128-116 on Saturday.\n\n\"They're a top team in the whole league playing phenomenal basketball,\" Tobias Harris said. \"We kept fighting and found a way.\"\n\nHarrell provided the Clippers' energy in the second half, when he alternately dived for loose balls, barreled his way to the basket and wagged his index finger after blocking a shot.\n\nHe had nine rebounds and made 8 of 11 free throws.\n\n\"I come in here every night just looking to give my team the extra boost and that extra push to just will us to win the game,\" Harrell said.\n\nAt halftime, coach Doc Rivers lectured Harrell about his lack of defense.\n\n\"He turned it around,\" Rivers said. \"His energy was infectious.\"\n\nWilliams was just 5 of 15 from the floor with 10 assists. Rivers decided to stay with him in the closing seconds.\n\n\"These type of guys are different,\" Rivers said. \"They think every miss means they're closer to making 10 in a row.\"\n\nGiannis Antetokounmpo's running dunk tied it at 126 with a minute left.\n\nRookie Shai Gilgeous-Alexander missed a pullup jumper for Los Angeles, but he blocked Eric Bledsoe's driving floater. Williams grabbed the rebound and scored from the right side.\n\nAfter a timeout, Boban Marjanovic stole Antetokounmpo's inbounds pass as time expired, sending the Bucks to just their third loss in 12 games.\n\n\"Offensively, I felt kind of weird going down in the fourth quarter and overtime because we've been blowing teams out this year,\" said Antetokounmpo, who had 27 points and 18 rebounds.\n\nBledsoe's 3-pointer tied it at 119 with six seconds remaining. Danilo Gallinari's potential winning shot for Los Angeles missed at the buzzer, sending both teams to their first overtime of the season.\n\n\"I've got to do a better job of making better reads, especially down the stretch,\" Bledsoe said. \"Knowing when to attack, knowing when to pass. I was really indecisive.\"\n\nPatrick Beverley had 21 points for Los Angeles, and Harris finished with 20 points and 11 rebounds.\n\nThe Clippers blew a 15-point lead early in the second. The Bucks fought back with seven 3-pointers -- Brook Lopez hit four -- and they outscored Los Angeles 37-20 to take a 64-62 lead into halftime.\n\nTIP-INS\n\nBucks: Lopez tied his career high with six 3-pointers. ... They have lost three in a row to the Clippers.\n\nClippers: Gallinari's consecutive free throw streak ended at 55 when he missed a technical foul shot in the third quarter. He came up just short of the franchise record of 58 set by Jamal Crawford in 2012. ... Rivers said he has a house under construction in Malibu, where wildfires have forced evacuations of the celebrity enclave. He said he's more concerned about the affected residents than his own project. ... G Avery Bradley (left ankle sprain) missed his third straight game and F Luc Mbah a Moute (sore left knee) sat out his eighth in a row.\n\nMOMENT OF SILENCE\n\nThere was a moment of silence to remember the victims of the recent bar shootings in ThousandOaks. Both teams wore black T-shirts with \"Enough\" on the front and the names of the 12 people shot to death on the back.\n\n\"There can only be so many prayers and thoughts that can go out,\" Harris said. \"Action has to be taken.\"\n\nHE SAID IT\n\n\"We're a blacktop team. We're a team that should have been playing outside with chain nets.\" -- Rivers on his team's toughness.\n\nUP NEXT\n\nBucks: Visit Denver on Sunday in the second game of a back-to-back. The Bucks haven't won there since March 20, 2010.\n\nClippers: Host the Warriors on Monday night in the first of four meetings.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994527.4974499
}