{
  "game_id": "0022400522",
  "espn_id": "401705088",
  "date": "Jan 09, 2025",
  "matchup": "ATL @ PHX",
  "headline": "Bradley Beal leads with 25 points off the bench, Suns pull away late to beat the Hawks 123-115",
  "body": "PHOENIX -- — Bradley Beal scored 25 points, Kevin Durant added 23 and the Phoenix Suns beat the Atlanta Hawks 123-115 on Thursday night.\n\n\r\n              Beal — still adjusting to his new role coming off the bench — shot 11 of 16 from the field in one of his most efficient games this season. Devin Booker added 20 points and 12 assists despite shooting 0 of 8 from 3-point range.\n\n\r\n              Beal made a driving layup just before the third quarter buzzer to give the Suns a 98-92 lead heading into the fourth.\n\n\r\n              Grayson Allen, who scored 23, hit his fifth 3-pointer to give the Suns a 120-105 lead with 3:26 left. The Hawks scored the next 10 points but Allen sealed it with a tough layup in traffic with 36 seconds left.\n\n\r\n              Trae Young led the Hawks with 21 points and seven assists. Seven Atlanta players scored in double figures.\n\n\r\n              The Suns took a 38-31 lead in the first quarter after shooting 75% from the field, but the Hawks rallied with their own hot-shooting quarter to take a 72-68 advantage by halftime. \n\n\r\n              Takeaways\r\n              Hawks: Atlanta falls back to .500 for the season after struggling to stop the Suns' offense. The Hawks — who have dropped four of their last five games — missed forward Jalen Johnson, who missed a third straight game with right shoulder inflammation.\n\n\r\n              Suns: Phoenix has won two of its past three as it tries to shake a slump that's lasted nearly two months. The Suns have a lot of work to do, but now that their Big 3 are healthy, they have a chance to gain some momentum.\n\n\r\n              Key moment\r\n              Durant, Tyus Jones and Allen hit three straight 3s to give the Suns a 120-105 lead with 4:03 left.\n\n\r\n              Key stat\r\n              The Suns shot 57.6% from the field.\n\n\r\n              Up next\r\n              Hawks host Rockets on Saturday; Jazz host Suns on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997951.010273
}