{
  "game_id": "0022300883",
  "espn_id": "401585511",
  "date": "Mar 04, 2024",
  "matchup": "CHI @ SAC",
  "headline": "White scores career-high 37 as Bulls rally from 22 down to stun Kings 113-109",
  "body": "SACRAMENTO, Calif. -- — Coby White had a career-high 37 points and DeMar DeRozan scored 19 of his 33 in the fourth quarter as the Chicago Bulls rallied from 22 points down to beat the Sacramento Kings 113-109 on Monday night.\n\n\r\n              “At this point in the season, however you can get wins, you’ve got to get wins,” White said. “You’ve got to start stacking wins. I don’t care how we get them. I don’t care how it looks. At the end of the day, if we win, that’s all we care about.”\n\n\r\n              White added seven assists and five rebounds, and Chicago outscored Sacramento 36-18 in the fourth period to snap a four-game losing streak against the Kings.\n\n\r\n              “I was just trying to let the game come to me, not force it,” White said. \"I was just trying to play within the flow of the offense.”\n\n\r\n              DeRozan scored 28 points in the second half after attempting just one field goal in the first two quarters.\n\n\r\n              “Some games I feel it right away and some games you’ve got to kind of ease into it,\" he explained. “And just me knowing myself, I know at one point I was going to get it going. So, came through when we needed it.”\n\n\r\n              Ayo Dosunmu scored 20 points and Nikola Vucevic had 10 points and 13 rebounds.\n\n\r\n              De’Aaron Fox led the Kings with 20 points and 10 assists after missing two games with a bruised left knee.\n\n\r\n              Domantas Sabonis had 18 points and 21 rebounds for his 43rd consecutive double-double before fouling out late in the fourth quarter.\n\n\r\n              Sacramento built an 89-67 with 3:28 left in the third, but the Bulls rallied in the fourth — going ahead 111-109 on a layup by White with 47.1 seconds remaining.\n\n\r\n              DeRozan added two free throws with 3.5 seconds left to seal it.\n\n\r\n              “Obviously, everybody’s down because it was a winnable game,” Kings coach Mike Brown said. “Even though we feel like we didn’t play well, we still felt it was a winnable game. We felt like we let this one slip through our fingers, and so it’s tough right now. It’s tough for anybody to swallow this one.”\n\n\r\n              Sacramento closed the first quarter on a 17-1 run to build a 36-22 lead.\n\n\r\n              Chicago responded with a 22-5 start to the second quarter to go up 44-41. The Kings once again finished the quarter strong, scoring the final eight points to lead 56-49 at halftime.\n\n\r\n              The Bulls won despite getting outrebounded 51-32, including 20-7 on the offensive glass.\n\n\r\n              However, Chicago forced 18 turnovers and committed just 10, leading to a 24-12 advantage in points off turnovers.\n\n\r\n              “I thought we were really active with our hands,\" Bulls coach Billy Donovan said. “Us being able to force turnovers certainly helps us get out in transition and it helps you generate some easy baskets.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: At the Utah Jazz on Wednesday night.\n\n\r\n              Kings: At the Los Angeles Lakers on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995875.599461
}