{
  "game_id": "0022000970",
  "espn_id": "401307773",
  "date": "May 02, 2021",
  "matchup": "SAC @ DAL",
  "headline": "Also-ran Kings beat contending Mavs 111-99 to finish sweep",
  "body": "DALLAS -- — Luka Doncic and the Dallas Mavericks simply couldn't figure out the also-ran Sacramento Kings this season.\n\n\r\n                    It remains to be seen how that will affect the playoff positioning for the Mavericks, who now have to worry about their superstar being one technical foul from a one-game suspension after his 15th of the season.\n\n\r\n                    Buddy Hield scored 27 points, Marvin Bagley III had 23 points and nine rebounds and Sacramento beat Dallas 111-99 on Sunday night, giving the Kings a season sweep of the Mavericks.\n\n\r\n                    All three games were in a span of 15 days, which Dallas finished with a 6-0 record against the other teams while going 0-3 for the second time in three seasons against the Kings.\n\n\r\n                    Doncic scored 30 points before getting ejected in the final minute after his second technical foul in another game without European sidekick Kristaps Porzingis, who is battling right knee soreness. \n\n\r\n                    Coach Rick Carlisle also got two techs in tandem with his 22-year-old star, the first pair coming in the second quarter before the second batch — and the ejection of both — with 31 seconds remaining.\n\n\r\n                    “I set a poor example tonight by getting two myself,” Carlisle said. “That’s on me. I apologized to the team after the game for it, too. It’s not the right example.”\n\n\r\n                    Doncic actually has the 16 techs required for an automatic one-game suspension, but one against New York on April 2 was rescinded. Doncic questioned why he got the second technical for throwing the ball at the basket going into a timeout, and the team could petition for another to get rescinded.\n\n\r\n                    “If you get a tech for that, I don't know,” Doncic said.\n\n\r\n                    \r\n                      Crew chief Rodney Mott said in a pool report Doncic's first technical was for using inappropriate language toward an official after being called for an offensive foul. Mott said the second was for unsportsmanlike conduct for throwing the ball the length of the court in frustration, instead of giving to an official. \n\n\r\n                    A one-game ban for Doncic with eight remaining could be significant with the Mavericks battling the Los Angeles Lakers and Portland for the 5-6-7 spots in the Western Conference playoffs. The No. 7 seed will be forced into the play-in tournament.\n\n\r\n                    Losses by Dallas and the Lakers (121-114 to Toronto) combined with the Trail Blazers' 129-119 win at Boston left the three teams tied at 36-28. \n\n\r\n                    “We've got to move on,” Carlisle said.\n\n\r\n                    Dallas was also missing sixth man Tim Hardaway Jr. missed his second game of the season with right ankle soreness.\n\n\r\n                    But the Kings, 12th in the Western Conference and with little hope of reaching the 10th seed that would get them into the play-in tournament, were short-handed, too.\n\n\r\n                    Rookie Tyrese Halliburton was forced to leave in the third quarter with a left knee injury, with the Kings already missing two other starters in De'Aaron Fox (COVID-19 protocols) and Harrison Barnes (left thigh injury).\n\n\r\n                    \r\n                      Halliburton dribbled behind his back near midcourt before going down suddenly. Several players from both teams surrounded him, and he was initially helped off the court before limping the rest of the way to the locker room on his own.\n\n\r\n                    The Kings never trailed in the two games in Dallas, taking an 8-0 lead both times, then staying in front after the Mavericks got even multiple times in the second quarter. \n\n\r\n                    Sacramento won the first game in Dallas 121-107 and trailed for just 42 seconds in a 113-106 win at home before blitzing the Mavericks again. The Kings were coming off an uplifting win at the Lakers in LeBron James' return from an ankle injury, while Dallas was finishing a back-to-back with its fifth game in seven days.\n\n\r\n                    “All three of the games came during a stretch when we were playing pretty well from the standpoint of togetherness and rebounding and our defense was solid tonight,” Kings coach Luke Walton said. “It takes that type of effort to give yourself a chance to win.”\n\n\r\n                    Bagley returned to the startling lineup in his second game back after missing 23 with a broken left hand. While Walton said he was still on a minutes restriction, he played 34 minutes while going 10 of 16 from the field.\n\n\r\n                    Bagley and Hield combined for 13 of the points on a 15-3 run that gave the Kings an 87-70 lead in the third quarter.\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Two games removed from his first career start, F Chimezie Metu was out with lower back soreness. He missed 16 games earlier in the season because of a broken right wrist. ... Richaun Holmes scored 17 points, and former Dallas player Delon Wright had 14, including two big buckets to help Sacramento stay in front late in the fourth quarter.\n\n\r\n                    Mavericks: Jalen Brunson scored 17 points, Dwight Powell had 13 and Josh Richardson 11. ... Porzingis was out for the fifth time in six games. He had to leave early in the only game he did play because of the right knee that was surgically repaired in the offseason. The 7-foot-3 Latvian missed the first nine games coming off that procedure. \n\n\r\n                    MISFIRING MAVS\n\n\r\n                    The Mavericks were within six in the final two minutes when Hield just beat the shot clock with a 3-pointer for a 106-97 lead. Hield was 6 of 10 from deep while the Kings went 11 of 28 as a team compared to 17% (6 of 35) for Dallas, which shot 36% overall in the second half against the NBA's worst team in field goal percentage defense.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: The third game on a four-game trip is Tuesday in Oklahoma City. It's the first of three games between the teams in a span of eight days.\n\n\r\n                    Mavericks: Dallas goes to Miami on Tuesday looking for a season sweep of the Heat, who had won both games in the previous three seasons.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997162.635948
}