{
  "game_id": "0022400381",
  "espn_id": "401704947",
  "date": "Dec 21, 2024",
  "matchup": "CHI vs. BOS",
  "headline": "Tatum scores a season-high 43 to go with 16 rebounds, 10 assist in Celtics 123-98 win over Bulls",
  "body": "CHICAGO -- — Jayson Tatum scored a season-high 43 points, grabbed 16 rebounds and dished out 10 assists for his third career triple-double and the Boston Celtics beat the Chicago Bulls 123-98 on Saturday night.\n\n\r\n              Kristaps Porzingis scored 22 points and Jaylen Brown added 19 to help the Celtics rebound from a 117-108 loss to the Bulls in Boston on Thursday night.\n\n\r\n              Tatum, the five-time All-Star, scored 18 points in the third quarter as Boston used a 19-8 run to open a 93-77 lead heading into the fourth.\n\n\r\n              Nikola Vucevic scored 19 points and 10 assists to lead the Bulls, whose season-high three-game winning streak ended. Zach LaVine, Coby White and Patrick Williams had 14 points each.\n\n\r\n              Referee Aaron Smith left the game in the second half with a hip injury.\n\n\r\n              Takeaways\r\n              Celtics: After a sluggish start, Tatum heated up in the second quarter to reach 16 points and nine assists at the half. Brown helped keep Boston close early, scoring 15 in the first half. \n\n\r\n              Bulls: Shot only 37.9%, missing on airballs and even missed dunks. Guard Josh Giddey missed his second game (ankle) and will have to go through some “protocols” before returning, coach Billy Donovan said.\n\n\r\n              Key moment\r\n              The game was tied at 42 midway through the second quarter, then the Celtics and Tatum found offensive traction. Boston had a 61-54 lead at the half using an 8-0 run to open a 12-point lead at one point. Tatum and the Celtics got hot again and took charge in the third after the Bulls had closed to within five points.\n\n\r\n              Key Stat\r\n              Boston entered leading the NBA with 51.3 3-point attempts per game, but won this one with 62 points in the paint. The Celtics dominated with 58 rebounds and 25 second-chance points.\n\n\r\n              Up next\r\n              The Celtics play at Orlando on Monday night and the the Bulls host Milwaukee.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997085.27394
}