{
  "game_id": "0021600617",
  "espn_id": "400900038",
  "date": "Jan 16, 2017",
  "matchup": "ORL @ DEN",
  "headline": "Jokic scores career-high 30, Nuggets beat Magic 125-112",
  "body": "DENVER -- The Nuggets found a connection while hanging out on their recent trip to London.\nThat bond trailed them back to Denver.\nNikola Jokic scored a career-high 30 points, Emmanuel Mudiay dished out a career-best 13 assists and the Nuggets followed up their \"home\" win in London with another at the Pepsi Center, beating the Orlando Magic 125-112 on Monday.\nJokic also grabbed 11 rebounds and Kenneth Faried scored 20 points for the Nuggets, who certainly packed their surging offense with them when they returned home from Europe. They routed Indiana 140-112 last Thursday during the NBA's Global Games series and remained on that sort of shooting streak, hitting a season-high 58.4 percent from the floor. They also had 33 assists and 76 points in the paint.\n\"London was great for us, a good team trip,\" Faried said. \"We had fun and enjoyed each other's company.\"\nThese days, they're marching to the beat of Jokic, who did a little bit of everything. Most of his shots were from in close, but the 6-foot-10 center also showed his range by hitting a 3-pointer.\nJokic also doesn't force shots, dishing out five assists. His unselfishness has been contagious -- the Nuggets had 33 assists.\n\"If I'm doing that (rubbing off on teammates), I'm so happy,\" Jokic said. \"Because I know if the ball is flying around ... that's really hard to guard. You don't know where the ball is.\"\nMagic coach Frank Vogel was impressed.\n\"The kid Jokic is playing just terrific basketball,\" Vogel said. \"He creates an element of spread offense that is very, very difficult to handle.\"\nElfrid Payton scored 20 points and had 12 assists as the Magic fell to 1-4 on their current six-game trip.\n\"We've got to get a win. We're behind the eight-ball with where we're at in the standings,\" Vogel said. \"It doesn't matter -- home, road, or who we're playing, it doesn't matter. We've got to get a win.\"\nDenver arrived home from London on Friday, took Saturday off and then went through an intense practice Sunday designed to shake any sort of lingering jet lag.\n\"Now, it's mental,\" Nuggets coach Michael Malone said before the game. \"Can you push all that tiredness and fatigue and jet lag out of your mind?\"\nThey certain did. Up 69-63 early in the third quarter, the Nuggets pulled away with a 16-2 run. The Magic cut into a 22-point deficit, but Faried put the game away with an emphatic dunk with 1:28 remaining.\n\"It starts with Nikola. Now you have Emmanuel playing (well),\" Malone said. \"Everybody is trying to play that way.\n\"Right now, everything on offense we're doing with purpose. If we could get to that on defense, we'd be a pretty good team.\"\nTIP-INS\nMagic: G/F Evan Fournier was out with a bruised right heel. ... C Nikola Vucevic scored 17 points, and the Magic had seven players in double figures.\nNuggets: G Gary Harris suffered a sprained right ankle early in the first quarter and didn't return. X-rays were negative. ... Denver has won 12 of the last 14 at home against Orlando.\nAN OFFICIAL SHORT\nThe officials operated with a two-person crew after Nick Buchert was a late scratch for personal reasons. It really didn't seem to be an issue for Tom Washington and Justin VanDuyne, who were never really out of position. They called 27 fouls.\nALL-STAR ATTENTION?\nAlthough Jokic is averaging 13.3 points, 7.9 rebounds and 3.9 assists, Malone doesn't expect his big man to be in All-Star consideration just yet.\nThat has to do with Denver's sub-.500 record and not his play.\n\"Unless you're winning, I don't think you're going to be in the conversation,\" Malone said. \"With that being said, everybody in the NBA knows Nikola and what he brings to the table. He's probably one of the most fun players to watch.\"\nUP NEXT\nMagic: At New Orleans on Wednesday night for the sixth and final game of this trip. It's a homecoming for Payton, who played Louisiana-Lafayette. \"It's just another game,\" Payton said.\nNuggets: At Los Angeles Lakers on Tuesday night. The Nuggets are 1-6 in the second game of a back-to-back this season.",
  "source": "espn_api",
  "crawled_at": 1764995848.597384
}