{
  "game_id": "0021900031",
  "espn_id": "401160673",
  "date": "Oct 26, 2019",
  "matchup": "TOR @ CHI",
  "headline": "Siakam, Anunoby lead Raptors over Bulls 108-84",
  "body": "CHICAGO --  Pascal Siakam is trying to adjust to the attention opponents are giving him now that Kawhi Leonard and Danny Green are no longer around in Toronto.\n\nThe fourth-year power forward is certainly providing offense. He just needs to cut back on the turnovers.\n\nSiakam scored 19 points, OG Anunoby added 17 and the Raptors spoiled Chicago's home opener by beating the Bulls 108-84 on Saturday night.\n\nThe defending NBA champions went on a run in the second quarter to take a 48-40 halftime lead and pulled away for their 10th straight win over the cold-shooting Bulls.\n\nSiakam is giving the Raptors the scoring they need, averaging 28.7 points through three games. But he got called for five fouls and committed four turnovers against Chicago, bringing his team-leading total to 13.\n\n\"I can always argue if it was a foul, wasn't a foul. But as a leader, I have to be able to not be in those situations -- and be in the game,\" said Siakam, the NBA's Most Improved Player last season. \"I've got to figure that out. Turnovers, obviously, it's something new for me seeing double teams. I've got to find a way to not turn the ball over.\"\n\nAnunoby hit three 3-pointers, and Serge Ibaka added 18 points and seven rebounds. Fred VanVleet scored 16 as the Raptors shook off a loss Friday in Boston.\n\nThe Bulls see themselves as playoff contenders coming off a 22-60 season that ranked among the worst in franchise history. But they hardly looked the part, shooting just 30.2% overall and 9 of 35 on 3s.\n\n\"They brought the physicality to us and they threw the first punch,\" Otto Porter Jr. said. \"We didn't really respond well.\"\n\nWendell Carter Jr. led Chicago with 12 points and 11 rebounds. Zach LaVine scored 11 after averaging 26.5 over the first two games. Lauri Markkanen struggled again, finishing with nine points for the second straight night. The 7-footer from Finland shot 3 of 10 after going 4 for 15 in a loss at Memphis.\n\nPORTER HURT\n\nIt didn't help Chicago that Porter missed most of the second quarter after taking what appeared to be an inadvertent elbow to the face while drawing a charge against Stanley Johnson. Porter spent several minutes lying face down as blood poured out, leaving a puddle on the court. He went straight to the locker room with the team's medical staff to get six stitches in the left corner of his mouth and returned to start the second half.\n\nBy then, the Raptors led by eight after outscoring Chicago 17-4 over the final 6 1/2 minutes of the second quarter.\n\nPULLING AWAY\n\nMarc Gasol and Kyle Lowry hit consecutive 3s in the third. Anunoby added another from beyond the arc to bump it to 62-46 with 7:47 left in the quarter, and the Raptors remained in control the rest of the way.\n\n\"That's what we need (Anunoby) to do,\" VanVleet said. \"The way he played tonight, if he plays like that we'll be a tough team to deal with.\"\n\nQUOTABLE\n\n\"Most likely, yeah.\" -- Porter, when asked after the game if he was sore.\n\nTIP-INS\n\nRaptors: Toronto outrebounded Chicago 59-45. ... Raptors coach Nick Nurse might have to pay more attention to the Angels now that Joe Maddon is managing Los Angeles and not his beloved Cubs. \"It's a tough one for me,\" said Nurse, a big Cubs fan growing up in Iowa. \"Always loved the Cubs. Joe and I have become friends the last couple years. I certainly will become a much bigger Angels fan than I ever have been in my life now.\" Nurse brought the Larry O'Brien Trophy to Wrigley Field last season and sang \"Take Me Out To The Ball Game\" while wearing Harry Caray-style glasses. Maddon and the Cubs parted after the season, ending a five-year run that produced a drought-busting championship in 2016. David Ross, a member of the title team, is the new manager. ... F Rondae Hollis-Jefferson (sore left groin) played four minutes in his season debut after Nurse said he and F Patrick McCaw (sore left knee) would not be available. McCaw has missed all three games.\n\nBulls: Coach Jim Boylen said F Chandler Hutchison (hamstring) is \"closer than ever\" to making his season debut. ... The Bulls are obviously looking to play better at the United Center after tying New York for the league's worst home record at 9-32 last season. \"It's a huge point of emphasis,\" Boylen said. \"But those are just words. You've got to go do it.\"\n\nUP NEXT\n\nRaptors: Host the Orlando Magic on Monday.\n\nBulls: Visit the New York Knicks on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995668.5642838
}