{
  "game_id": "0021700068",
  "espn_id": "400974819",
  "date": "Oct 26, 2017",
  "matchup": "POR vs. LAC",
  "headline": "Griffin's 3-pointer beats Blazers, keeps Clippers undefeated",
  "body": "PORTLAND, Ore. -- Blake Griffin made a 3-pointer as time expired and the Los Angeles Clippers remained unbeaten with a 104-103 victory over the Portland Trail Blazers on Thursday night.\nGriffin, who scored 16 of his 25 points during the fourth quarter, got the ball on the left side of the floor and hit the 3-pointer just inside the line, the game's sixth lead change during the final two minutes.\nDeAndre Jordan had seven points and 18 rebounds for Los Angeles, which at 4-0 is one of two unbeaten teams remaining in the NBA. Danilo Gallinari and Austin Rivers had 16 points apiece for the Clippers.\nDamian Lillard scored 14 of his 25 points during the third quarter for Portland (3-2). C.J. McCollum had 23 points, but missed one of two free throws with five seconds remaining that could have given the Blazers a three-point lead.\nAll five Portland starters scored in double figures. Ed Davis had 10 rebounds.\nNeither team led by more than five points in the fourth quarter was a tight battle where neither team led by more than five points. Portland wiped out an 89-84 deficit when a clear-path foul led to a five-point possession for Al-Farouq Aminu.\nGriffin gave the Clippers a 101-100 lead with a minute to play, but McCollum put the Blazers in front when he hit an uncontested 12-foot jumper with 44 seconds remaining. Following an offensive foul by Rivers with five seconds left, McCollum made 1 of 2 free throws, opening the door for Griffin's winner.\nThe Clippers never trailed in the first half after Gallinari hit two free throws for a 14-13 lead. Portland's shooting problems were part of the issue, as the Blazers hit just 10 of their first 35 shots.\nThe Blazers closed within two points twice during the second quarter, but Los Angeles always had an answer. The Clippers outscored Portland 9-3 during the final three minutes to take a 62-53 halftime lead.\nTIP-INS\nClippers: With guard Milos Teodosic out indefinitely (plantar fascia/right foot), there's concern about Los Angeles starters logging heavy minutes. The Clippers' starters played 190 of 240 minutes in Tuesday's win over Utah, and 184 against Portland. . Los Angeles allowed its highest point total of the season. The Clippers came into the game giving up an NBA-low 88.0 points per game. . Griffin has led the Clippers in scoring during their first four games.\nBlazers: Forward Meyers Leonard sat out after spraining his right ankle during Wednesday's practice. . Portland has lost seven consecutive games to the Clippers . Before the game, Lillard was honored as the 2016-17 Magic Johnson Award winner, given by the Professional Basketball Writers Association to a player who combined on-court performance with dignity and cooperation in dealing with the public and media.\nUP NEXT:\nClippers: Hosts Detroit on Saturday to open a five-game homestand.\nBlazers: Hosts Phoenix on Saturday. Portland beat the Suns 124-76 in the season opener.",
  "source": "espn_api",
  "crawled_at": 1764993454.489602
}