{
  "game_id": "0021500581",
  "espn_id": "400828468",
  "date": "Jan 13, 2016",
  "matchup": "HOU vs. MIN",
  "headline": "Harden scores 27 to lead Rockets to 107-104 win over 'Wolves",
  "body": "HOUSTON -- The Houston Rockets are finally on a roll, playing the way they expected to -- but didn't -- to start the season.\nJames Harden had 27 points and 11 assists and the Rockets got their season-high fifth straight win, 107-104 over the Minnesota Timberwolves on Wednesday night.\n\"We're playing for each other. That's the most important thing,\" Harden said. \"So if a guy messes up, guys got his back. Everything isn't going to be perfect all the time and that's what we're starting to realize and we're just helping each other out.\"\n\nMinnesota lost its season-worst eighth in a row.\nThe Timberwolves stuck around the entire second half. They trailed by three when Jason Terry made a 3-pointer with about two minutes left to extend Houston's lead to 105-99.\nHarden followed with a jump shot before Minnesota got a layup from Kevin Martin and a pair of free throws from Karl-Anthony Towns to get within 107-104.\nMinnesota had a chance to tie it just before the buzzer, but Martin's 3-point attempt didn't even touch the rim.\nHarden believes the Rockets would have lost a game like this early in the season when they got off to such a terrible start that it cost coach Kevin McHale his job.\n\"I think we would have let this game slip away, but no matter how bad we struggled, especially in the first three quarters, we locked in and we got stops when we needed to and we just scored,\" he said.\nAndrew Wiggins had 28 points and Towns had 12 points and 16 rebounds for the Timberwolves.\n\"We had too many turnovers,\" Minnesota coach Sam Mitchell said of his team's 20. \"Every time we turned the ball over they got a layup or a dunk. Where those turnovers come from, I don't know. There were things that we just don't normally do.\"\nDwight Howard added 15 points and 10 rebounds and Terrence Jones came off the bench to score 16 with nine rebounds for the Rockets.\nThe Timberwolves opened the fourth quarter with a 6-1 run, capped by a 3-pointer from Nemanja Bjelica to take an 83-82 lead with 10 1/2 minutes remaining.\nThey wouldn't have the lead for long as the Rockets scored the next 10 points to make it 92-83. Howard started that stretch with a reverse dunk that he was fouled on. He missed the free throw, but Jones tipped in the rebound for Houston and also made a 3-pointer in that span.\nHarden later made a free throw for the 10,000th point in his career.\nHouston led 57-50 at halftime and 81-77 after three quarters.\nTIP-INS\nTimberwolves: F Kevin Garnett sat out for rest after playing Tuesday night. ... Nikola Pekovic had eight points and five rebounds in his fourth game back after missing the first 35 games while recovering from surgery on his right Achilles tendon on April 8. ... Ricky Rubio had nine points and 12 assists.\nRockets: PG Ty Lawson had six points and three assists in his return after serving a three-game suspension for driving under the influence in California last July. ... PG Patrick Beverley missed the game for personal reasons. ... F/C Donatas Motiejunas has missed the last six games with lower back soreness.\nHARDEN 10K\nHarden now has 10,005 points in his career, reaching the 10,000-point mark in his 492nd game. He knew he was close to the mark, but didn't realize exactly when he reached it and looked confused when the crowd cheered extra loud on the free throw where he reached it. A few minutes later the Rockets noted the achievement on the video boards and announced that he'd hit 10,000 points and he smiled and gestured to the crowd.\n\"It's definitely a great individual achievement,\" Harden said. \"Credit to this organization for helping me get there. But that's just the beginning. I've got a long way to go.\"\nCLOSE, BUT NO WINS\nThe Timberwolves haven't gotten a win in 2016, but they seem to be playing a bit better lately. Since being blown out by 26 points to Cleveland last Friday their three losses have all been by six points or fewer.\n\"It's very frustrating not being able to win,\" Wiggins said. \"Every game we play good, but it's something that we're not doing right or a mistake we made and we just have to fix it.\"\nUP NEXT\nTimberwolves: Visit Oklahoma City on Friday.\nRockets: Host Cleveland on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994633.796051
}