{
  "game_id": "0021800343",
  "espn_id": "401071024",
  "date": "Dec 03, 2018",
  "matchup": "OKC @ DET",
  "headline": "Adams, Westbrook lead Thunder to rout of Pistons",
  "body": "DETROIT --  Detroit hadn't lost in 12 days. Oklahoma City has been on a tear since the end of October.\n\nOn Monday night, it was the Thunder who stayed hot.\n\nSteven Adams scored 21 points, Russell Westbrook added 18 and the Thunder routed the Pistons 110-83.\n\n\"I thought we played a very complete game,\" Oklahoma City coach Billy Donovan said. \"There were things we could have done better, but I'm pleased that we went on the road and played this well against a very good team.\"\n\nPaul George added 17 points for the Thunder, who are 15-3 since losing their first four games.\n\nDetroit had won the first five games of a six-game homestand, including a victory over the Golden State Warriors on Saturday, but the Thunder held the Pistons to a season low in points.\n\n\"Their defense is very good -- hats off to them,\" Pistons coach Dwane Casey said. \"They came in with the right approach and we didn't. I take the blame for that. I didn't have us ready to play against one of the top defensive teams in the league.\"\n\nBlake Griffin led Detroit with 20 points, while Andre Drummond added 13. The 33 points was 10.5 below their combined season average, and they combined for 11 rebounds after coming in with an average of 25.9.\n\n\"We didn't come out with any urgency, and that's entirely on us,\" Griffin said. \"No coach can go out there and make us play hard. We need to take a hard look at this game and learn from what we did out there.\"\n\nThe Thunder double-teamed Griffin, and while he finished with four assists, he couldn't create easy baskets for his teammates.\n\n\"It is always tough to double Blake because he's such a good passer,\" Donovan said. \"Tonight, though, we were making him send the ball back to the perimeter. I think he hit Andre for one layup, but that was about it.\"\n\nThe Thunder led 50-40 at halftime behind 14 points from Adams and 10 from Jeremi Grant. Griffin had 15 points for Detroit, which shot 34.7 percent from the floor.\n\n\"We were doubling Blake, but we did a great job of rotating and recovering off the double-team,\" Adams said. \"We were playing good defense and we were making shots. That's good stuff.\"\n\nDetroit's offense continued to struggle in the second half without Reggie Bullock, who left the game in the first quarter with an ankle injury. The Thunder took a 71-51 lead midway through the third quarter and led by 28 at the end of the period. In the fourth, Oklahoma City led by as many as 35.\n\n\"We've got to play with more intensity than that,\" said Reggie Jackson, who finished with 10 points against his former team. \"We weren't good enough tonight.\"\n\nAdams made his first seven field-goal attempts, along with five free throws, and forced Drummond and Zaza Pachulia to the bench with four fouls each. The Pistons finished the third quarter with Griffin at center and 6-foot-7 Stanley Johnson at power forward.\n\n\"I thought Steven and Russell did a great job in the pick-and-roll,\" Donovan said. \"Steven was able to create pressure at the rim all night, and even when the Pistons adjusted their coverage, he and Russell adjusted at the next stoppage of the play.\"\n\nTIP-INS\n\nThunder: Oklahoma City is 15-5 against the Pistons since leaving Seattle. ... The Thunder, who came into the game with the league's best defensive rating, are now 4-0 when holding their opponents under 90 points.\n\nPistons: Detroit fell short of its first seven-game home winning streak since March 14-April 4, 2008. ... Drummond went 1-for-2 from the free-throw line and has now missed 19 of his last 24 attempts.\n\nTOUGH CROWD\n\nThe 5-0 homestand didn't prevent the Pistons from getting booed in the second half.\n\n\"I've been in this league for a long time, and you are only as good as your last game,\" Griffin said. \"That's normal these days. It isn't just this fan base.\"\n\nUP NEXT\n\nThunder: At the Brooklyn Nets on Wednesday night.\n\nPistons: At the Milwaukee Bucks on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994616.214915
}