{
  "game_id": "0022400143",
  "espn_id": "401704709",
  "date": "Nov 02, 2024",
  "matchup": "TOR vs. SAC",
  "headline": "Barrett scores 31, Boucher has season-high 24 in Raptors' 131-128 overtime win over Kings",
  "body": "TORONTO -- — RJ Barrett scored 31 points, Chris Boucher had a season-high 24, and the Toronto Raptors snapped a four-game losing streak by beating the Sacramento Kings 131-128 in overtime on Saturday night.\n\n\r\n              Toronto’s Ochai Agbaji scored a season-high 22 points, and Gradey Dick also had 22.\n\n\r\n              Domantas Sabonis had 17 points, 20 rebounds and 10 assists for his 60th career triple-double, but it wasn't enough to keep the Kings' three-game win streak alive.\n\n\r\n              Former Raptor DeMar DeRozan scored 33 points for Sacramento but also missed two 3-pointers to tie in the final minute of overtime.\n\n\r\n              After DeRozan’s first miss, Barrett missed a pair of free throws with nine seconds to go. Both DeRozan and De’Aaron Fox missed 3-pointers on Sacramento's final possession.\n\n\r\n              Fox scored 14 of his 24 points in the fourth quarter but didn’t score in overtime. \n\n\r\n              Kings guard Malik Monk scored 21 points off the bench, and Keegan Murray fouled out with 16 points and 10 rebounds.\n\n\r\n              The Raptors retired former star Vince Carter’s No. 15 jersey during a halftime ceremony.\n\n\r\n              Takeaways\r\n              Kings: Fox shot 3 for 11 through three quarters but made 5 of 9 attempts in the fourth. He missed all 11 of his 3-point attempts. \n\n\r\n              Raptors: Toronto won for the first time in three games since losing All-Star Scottie Barnes to a right orbital fracture. Barnes is expected to miss at least three weeks.\n\n\r\n              Key moment\r\n              Barrett made one of two free throws with just over 10 seconds remaining in the fourth, putting Toronto up by two. Sabonis tipped in his own missed putback with three seconds left to send it to overtime. \n\n\r\n              Key stat\r\n              The Raptors made a season-high 17 3-pointers.\n\n\r\n              Up next\r\n              The Kings visit Miami on Monday, the same night Toronto begins a five-game trip at Denver.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997005.0375628
}