{
  "game_id": "0021600415",
  "espn_id": "400899857",
  "date": "Dec 19, 2016",
  "matchup": "OKC vs. ATL",
  "headline": "Hawks overcome Westbrook's 46 to beat Thunder 110-108",
  "body": "OKLAHOMA CITY --  Paul Millsap took advantage of a chance to show off his rare versatility.\n\nAtlanta's 6-foot-8 forward shifted to center because Dwight Howard was out and scored a season-high 30 points, including the go-ahead 10-footer with 12.7 seconds left. He helped the Hawks overcome Russell Westbrook's 46 points and beat the Oklahoma City Thunder 110-108 on Monday night.\n\n\"It took everything we had,\" Millsap said. \"It took everybody stepping up to get this win tonight.\"\n\nAfter Millsap's late shot, Thunder center Steven Adams rebounded a missed 3-pointer by Westbrook and dunked it, but a review determined that the basket came just after time expired.\n\nWestbrook entered the game as the NBA's leading scorer with more than 30 points per game.\n\n\"If he gets his points -- he's going to get that regardless,\" Millsap said. \"The game plan was try to take everybody else out of it.\"\n\nWestbrook, who made 16 of 33 shots and had 11 rebounds and seven assists, was unimpressed with his effort.\n\n\"No, we don't have any moral victories around here, buddy,\" he said.\n\nDennis Schroder scored 31 points and made 10 of 16 shots for the Hawks, who have won four of six after a six-game losing streak.\n\n\"Pretty special effort by the guys tonight, to come in here down Dwight, without him, and to find a way to compete against a great rebounding team and an individual player that's playing just lights-out basketball,\" Atlanta coach Mike Budenholzer said. \"I was very proud of our players.\"\n\nJerami Grant scored a season-high 15 points, and Andre Roberson matched a season high with 14 points for the Thunder.\n\nWestbrook scored 18 points in the second quarter to help the Thunder take a 53-48 lead. The Hawks shot 50 percent in the first half, but without Howard, they were outrebounded 27-14, and the Thunder outscored them 10-0 on second-chance points. Schroder scored 18 points in the first half, and Millsap added 16.\n\nThe Hawks closed the third quarter well to take an 81-78 lead into the fourth, then Atlanta held on.\n\n\"They made some tough plays toward the end of the game,\" Thunder guard Semaj Christon said. \"We can do better on defense keeping the guys in front of us without fouling.\"\n\n---\n\nTIP INS\n\nHawks: F/C Mike Muscala tipped the ball into his own basket while trying to grab a rebound in the first quarter. The basket was credited to Oklahoma City's Enes Kanter. ... F Thabo Sefolosha, a former Thunder player, scored 15 points.\n\nThunder: Shot just 27.3 percent in the first quarter. ... Made 3 of 19 3-pointers in the first half. ... G Victor Oladipo missed his fourth straight game with a bruised right wrist. ... Adams' streak of six straight games with double figures points ended. He finished with six points. ... Oklahoma's City's four starters other than Westbrook made 7 of 26 shots and scored 24 points.\n\nSTAT LINES\n\nRoberson scored his 14 points on 5-for-14 shooting. He took five more shots than he had ever taken in a regular-season game.\n\n\"I'm just letting it fly, to be honest with you,\" he said. \"It wasn't falling for me early, but I stuck with it, and the team needed me to keep shooting, so that's what I was doing. I just go out there and do anything I can.\"\n\nQUOTABLE\n\nKyle Korver, on Millsap: \"He's just so tough. He's tough mentally, he's tough physically, and he has been doing that for this team for a lot of years.\"\n\nUP NEXT\n\nHawks: Host the Minnesota Timberwolves on Wednesday.\n\nThunder: Play at the New Orleans Pelicans on Wednesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .",
  "source": "espn_api",
  "crawled_at": 1764995306.291801
}