{
  "game_id": "0021800151",
  "espn_id": "401070832",
  "date": "Nov 06, 2018",
  "matchup": "PHX vs. BKN",
  "headline": "LeVert scores 26 to lift Nets past struggling Suns 104-82",
  "body": "PHOENIX --  Phoenix was the perfect place for the improving Brooklyn Nets to start a four-game trip, with the two top teams in the West still to come in Denver and Golden State.\n\nThe Nets beat the struggling Suns 104-82 Tuesday night and are 6-1 in Arizona since moving from New Jersey to Brooklyn in 2012.\n\nCaris LeVert scored 26 points, D'Angelo Russell added 15 and the Nets won their third game in the past four, while the Suns have lost eight of nine.\n\nDevin Booker led Phoenix with 20 points but made just 6 of 21 shots. Deandre Ayton had 15 points and a season-high 13 rebounds.\n\n\"We just tried to make every shot tough, every catch tough,\" LeVert said. \"We did a good job of that.\"\n\nBrooklyn held the Suns to a season low in points and field goal shooting at 34.6 percent.\n\n\"We're growing up in terms of our physicality on the defensive end,\" Nets head coach Kenny Atkinson said.\n\nThe Suns went on a 9-0 run to turn a 14-point deficit in the third quarter to 63-58 difference on Trevor Ariza's corner 3 with 5:31 to play. The Nets regained a 14-point lead, 74-60, with Spencer Dinwiddie's 3 at the 2:18 mark.\n\n\"Not to look forward, but you look at the schedule and you know who you have next and this one is definitely a winnable game,\" Nets center Ed Davis said. \"It's a game we definitely needed to win and handled business.\"\n\nPhoenix never threatened in the fourth, the Suns' cold shooting helping the Nets remain in control. Davis' dunk made it 92-74 with 4:15 to play.\n\nThe Nets' strategy seemed to be to let the 7-foot-1 Ayton shoot mid-range shots rather than allow him to work inside the paint. It worked for much of the game, as the Suns' high-profile rookie made just 6 of 17 shots.\n\nBoth teams struggled to hit shots in the first quarter, with field goal percentages of less than 40 both ways.\n\nThe Nets, up two after one quarter, led by 14 during the second quarter. Rondae Hollis-Jefferson's short turnaround bank shot made it 47-34 with 2:53 to go before halftime.\n\n\"Energy, effort wasn't there, mind wasn't there,\" Suns head coach Igor Kokoskov said.\n\nPhoenix got back-to-back 3s from Mikal Bridges and Ariza to cut the lead to 50-42, and the Suns trailed by 10 at the half.\n\nSuns backup center Richaun Holmes had season highs of 13 points and 10 rebounds.\n\nTIP-INS\n\nNets: The Nets outscored the Suns 54-30 in points in the paint. ... G Jared Dudley returned to Phoenix for the first time since being traded in the offseason. He spent seven seasons over two stints with the Suns. ... F DeMarre Carroll has yet to play this season due to a right ankle injury.\n\nSuns: F T.J. Warren returned after missing the team's last game with back spasms. ... Booker entered the game second in the NBA with an average of 9.8 points per game in the fourth quarter. He had four in the final 12 minutes. ... G Jamal Crawford moved into 29th place career in games played (1,271).\n\nUNEXPECTED LETDOWN\n\nThe Suns, coming off a 102-100 win over Memphis on Sunday, had hoped that win was the start of a turnaround. But it didn't happen, at least right away, and the home team heard the boos toward the end of the game.\n\n\"It sucks, man,\" Booker said. \"We thought last game would be our step forward and we definitely took a step back tonight. We got blown out in front of our fans, so it's embarrassing.\"\n\nKokoskov wasn't pleased with the performance. \"I know the fans love the Phoenix Suns, come here excited to watch these guys. They're not driving home happy,\" he said.\n\nDUDLEY DOING RIGHT\n\nDudley, with 11 pro seasons to his credit, has started all 11 games for the Nets this season, and Atkinson said Dudley gets an \"A-plus\" for leadership. \"He's doing it in the locker room and he is also doing it with his play because he doesn't need the ball in his hands,\" Atkinson said. \"He's going to space the floor and he's an intelligent defender.\"\n\nUP NEXT\n\nNets: At Denver Nuggets on Friday.\n\nSuns: Host the Boston Celtics on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995104.714046
}