{
  "game_id": "0022201218",
  "espn_id": "401469373",
  "date": "Apr 09, 2023",
  "matchup": "CLE vs. CHA",
  "headline": "Hornets rally in fourth, beat playoff-bound Cavaliers 106-95",
  "body": "CLEVELAND -- — Mark Williams had 22 points and 10 rebounds and fellow rookie Bryce McGowens scored 22 points as the Charlotte Hornets rallied in the fourth quarter Sunday for a 106-95 win over the playoff-bound Cleveland Cavaliers.\n\n\r\n              Theo Maledon had 18 points, eight rebounds and six assists for Charlotte, which finished with the fourth-worst record in the NBA at 27-55 and did not advance to the postseason for the seventh year in a row. The Hornets missed their first 24 3-point attempts.\n\n\r\n              “Unless you make the playoffs, it’s a long offseason, but these are important games for our young guys,” Hornets coach Steve Clifford said. “That’s why we played Friday and practiced yesterday to get ready for today against a very good Cleveland team.”\n\n\r\n              All-Star Donovan Mitchell and Darius Garland were not in uniform for the fourth-seeded Cavaliers, who will have home-court advantage in their first-round series with the New York Knicks. Sam Merrill scored 17 points and Danny Green and Raul Neto each had 13.\n\n\r\n              Cleveland blew an 11-point lead to complete the regular season 51-31, qualifying for the playoffs for the first time since reaching the 2018 NBA Finals. It had the sixth-best home record in the league at 31-10.\n\n\r\n              “I’m confident and believe when we’re at our best, we’re a tough out for anybody,” Cavaliers coach J.B. Bickerstaff said. “But it’s going to be a test for us because a lot of our guys are going into their first playoffs.”\n\n\r\n              Evan Mobley had six points and five rebounds, and Jarrett Allen had four points and six boards for the Cavaliers. They played 12 minutes apiece, none after the first quarter.\n\n\r\n              “The NBA season is physically exhausting, so it’s good to take some time to be mentally refreshed,” Bickerstaff said. “We were able to see what some of our other guys can do to support the guys that are going to play heavy minutes in the playoffs.”\n\n\r\n              The Hornets did not dress their top six scorers, including point guard Terry Rozier and small forward Gordon Hayward, and finished 6 of 32 beyond the arc. Williams and McGowens both set career highs in scoring.\n\n\r\n              “We really wanted to end the season on a bright note and we’re really happy to have done that,” said Williams, who made 9 of 10 field goal attempts.\n\n\r\n              Svi Mykhailiuk had 16 points, seven rebounds and six assists, and put Charlotte in front for good at 82-79 with a 3-pointer with 9:49 remaining. The Hornets used a 38-11 run to go up by 12 late in the fourth.\n\n\r\n              BIG MEN BACK\n\n\r\n              Bickerstaff gave his starters the option to sit out the final two games after locking up the No. 4 seed, which guards Mitchell and Garland opted to do. Power forward Mobley and center Allen did not play Thursday at Orlando, but wanted to take the court against the Hornets.\n\n\r\n              “I had a conversation with all those guys to see where they’re at,” Bickerstaff said. “Evan said he’d like to get some time. He just is a basketball player.”\n\n\r\n              TIP-INS\n\n\r\n              Hornets: G Terry Rozier (right foot discomfort), G LaMelo Ball (right foot surgery), F Gordon Hayward (left thumb sprain), F Kelly Oubre Jr. (right shoulder strain), F P.J. Washington Jr. (right foot strain) and F Cody Martin (left knee sprain) were unavailable. … Swingman Oubre, who averaged a career-high 20.3 points, will be an unrestricted free agent. … Charlotte was 13-28 at home and 14-27 on the road.\n\n\r\n              Cavaliers: F Isaac Okoro (left knee soreness) missed the final six games after being hurt March 26 against Houston, but should return for the playoff opener. “We’ve missed him,” Bickerstaff said. “It will be huge having him back with the way he can contain the ball defensively.” … Cleveland sold out all 41 home games at Rocket Mortgage FieldHouse, extending its streak to 50 straight in the regular season.\n\n\r\n              ------ More AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995226.715682
}