{
  "game_id": "0022300307",
  "espn_id": "401584935",
  "date": "Dec 12, 2023",
  "matchup": "CHI vs. DEN",
  "headline": "Jackson scores 25 points as Nuggets beat Bulls 114-106 after Jokic ejection",
  "body": "CHICAGO -- — Nikola Jokic was ejected in the second quarter. Kentavious Caldwell-Pope was held out in the second half after a collision with Nikola Vucevic. Jamal Murray didn't play at all.\n\n\r\n              The rest of the Denver Nuggets picked up the slack.\n\n\r\n              Reggie Jackson scored 25 points and short-handed Denver held off the Chicago Bulls for a 114-106 victory on Tuesday night.\n\n\r\n              “We have an expectation to win the game no matter who is playing,” coach Michael Malone said.\n\n\r\n              Michael Porter Jr. had 17 points and Aaron Gordon finished with 14 points, seven rebounds and six assists, helping Denver to a gritty second straight win after a 129-122 victory at Atlanta on Monday night. Julian Strawther added 16 points.\n\n\r\n              Jackson made five 3-pointers as the reigning NBA champions went 14 for 30 from behind the arc. The Nuggets also beat the Bulls 123-101 in Denver on Nov. 4. \n\n\r\n              “The defense was where it was supposed to be and the guys executed,” Jokic said. “We had a couple guys step up in a different position today. ... It's a good win for us.”\n\n\r\n              Jokic was thrown out for the language he directed toward an official after he felt he was fouled when he missed a reverse layup with 1:12 left in the first half. The two-time NBA MVP said something in the direction of a referee as he made his way back down the court.\n\n\r\n              Jokic was promptly whistled for a technical and thrown out by official Mousa Dagher.\n\n\r\n              “I crossed the line, but sometimes that word doesn't cross the line,” Jokic said.\n\n\r\n              Jokic declined to get into further details because he wanted to avoid a fine by the NBA. Mark Lindsay, the crew chief for the referee crew, also was vague when asked about the exchange.\n\n\r\n              “We don’t typically publicly get into exactly what a player said, but the language reached the standard for an ejection,” Lindsay told a pool reporter.\n\n\r\n              Coby White led Chicago with 27 points, continuing his hot streak. Vucevic finished with 26 points and 16 rebounds.\n\n\r\n              “It was right there. ... The second half, they took it to us, and from there it was just difficult to get back in the game,” Vucevic said.\n\n\r\n              The Bulls were coming off a 133-129 overtime loss at Milwaukee on Monday night that stopped a four-game win streak.\n\n\r\n              White went 8 for 15 from the floor, including a 5-for-10 performance from 3-point range. He is averaging 26.8 points in his last five games.\n\n\r\n              Chicago pulled within five on Ayo Dosunmu's jumper with 1:47 left in the third quarter, but Strawther made a 3-pointer and two foul shots to help Denver carry a 92-80 lead into the final period.\n\n\r\n              The Nuggets stayed in control throughout the fourth. Gordon's 3 made it 109-96 with 3:20 left.\n\n\r\n              “It seemed like when Jokic went out, it was like all right, they all stepped up with confidence,” White said.\n\n\r\n              Already playing without Zach LaVine due to right foot inflammation, the Bulls rested Alex Caruso for the second straight game because of a sprained left ankle. But coach Billy Donovan made it sound as if Caruso could return soon.\n\n\r\n              “The fact that he's even going on the court to try to get himself ready to play I think would indicate that he's pretty close to being back,” Donovan said. “It's just how much he feels like he can do.”\n\n\r\n              The Nuggets played without Murray, who had 29 points and nine rebounds in Monday night's win. Murray has been dealing with a sore right ankle, and he rolled his left ankle in the first quarter against the Hawks.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Open a three-game homestand Thursday night against Brooklyn.\n\n\r\n              Bulls: At Miami on Thursday night and Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996698.780834
}