{
  "game_id": "0022100891",
  "espn_id": "401360710",
  "date": "Feb 24, 2022",
  "matchup": "ATL @ CHI",
  "headline": "DeRozan continues streak with 37 points, Bulls beat Hawks",
  "body": "CHICAGO -- — DeMar DeRozan made enough big shots down the stretch to keep his record run going and Chicago's winning streak intact. \n\n\r\n              DeRozan scored 37 points while extending an NBA-record streak and the Eastern Conference-leading Bulls squeezed by the Atlanta Hawks 112-108 on Thursday night.\n\n\r\n              DeRozan pushed his league mark of scoring at least 35 points while shooting 50% or better to eight consecutive games. The five-time All-Star made 15 of 21 shots and had five points in the final minute, helping the Bulls rally from three down to win for their sixth straight victory.\n\n\r\n              “You love it and you hate it,” he said. “Of course, you don't want to be down and have that pressure on yourself to try to pull out a game. But when you're in those moments, you've got to take it on. I love the moments, I love the challenge, I love the opportunity.”\n\n\r\n              DeRozan also made it nine games in a row with 30 points or more, the longest such streak by a Bulls player since Michael Jordan did it in 10 straight from Dec. 25, 1990, to Jan. 14, 1991.\n\n\r\n              Zach LaVine scored 20 points after missing the final three games prior to the All-Star break because of his ailing left knee. The high-flying guard had platelet-rich plasma therapy, a cortisone injection and fluid drained in Los Angeles last week, hoping the treatment will help him get through the remainder of the season.\n\n\r\n              Nikola Vucevic added 12 points and 10 rebounds. Tristan Thompson provided a lift off the bench, with 11 points and six rebounds in his Bulls debut. And Chicago moved a half-game ahead of idle Miami in the East.\n\n\r\n              BOGDANOVIC, GALLINARI SHINE\n\n\r\n              Atlanta's Bogdan Bogdanovic set a season high with 27 points and matched one with five 3-pointers. Danilo Gallinari scored 26 points, and Clint Capela finished with 14 points and 17 rebounds. \n\n\r\n              Trae Young had a rough game, making just 3 of 17 shots while missing all five 3-pointers. The two-time All-Star finished with 14 points and 10 assists. \n\n\r\n              “I just felt like I couldn't get a shot to go and I was pressing it,” Young said. “Every shot, I was really thinking about it and just not shooting it.\"\n\n\r\n              DEROZAN PROVIDES PUSH\n\n\r\n              The Bulls trailed 108-105 when Atlanta got called for a shot-clock violation with 58 seconds remaining. But with DeRozan leading the way, they pulled out the tight win.\n\n\r\n              “We’re witnessing history,” rookie Ayo Dosunmu said. “What we are witnessing right now is something that people are gonna remember for a long time. And it’s one of those things where it’s gonna be a record for a pretty long time.”\n\n\r\n              DeRozan hit a pull-up jumper. Dosunmu blocked Young's driving layup as the crowd chanted “De-fense! De-fense!”\n\n\r\n              DeRozan then got fouled by Bogdanovic as he nailed a turnaround, fallaway jumper. He hit the free throw to complete the three-point play, putting Chicago on top 110-108 with 15.1 seconds remaining.\n\n\r\n              Bogdanovic missed a 3, and Javonte Green hit two free throws for the Bulls to make it a four-point game with 4.5 seconds remaining.\n\n\r\n              “Too much DeRozan,” Hawks coach Nate McMillan said.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: The Hawks struggled on 3-pointers and free throws, going 8 of 28 from beyond the arc and 18 of 27 at the foul line. ... F De'Andre Hunter missed the second half because of an illness. ... F John Collins (strained right foot) missed his fourth consecutive game. ... G Lou Williams played just under 12 minutes after being listed as questionable because of tension in his left hamstring. ... F/C Gorgui Dieng (personal reasons) missed the game. \n\n\r\n              Bulls: Thompson played 13:14 in his first game since signing with Chicago last week. The veteran center was waived by Indiana after being acquired Feb. 8 from Sacramento in the deal that sent Domantas Sabonis to the Kings. ... LaVine isn't on an minutes restrictions at least for now, though he might rest when the Bulls play on consecutive nights, coach Billy Donovan said. ... Donovan said the Bulls haven't decided if F Patrick Williams (torn ligaments in left wrist) will start of come off the bench once he is ready to return. The second-year pro was injured against the New York Knicks on Oct. 28 and had surgery. ... Jordan holds the franchise record of 11 straight games with 30 points or more, from Feb. 13-March 4, 1987.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Toronto on Saturday night.\n\n\r\n              Bulls: Host Memphis on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993488.9566028
}