{
  "game_id": "0022300847",
  "espn_id": "401585475",
  "date": "Feb 28, 2024",
  "matchup": "DEN vs. SAC",
  "headline": "Jamal Murray scores 32 points, Nuggets use big run to beat Kings 117-96",
  "body": "DENVER -- — Jamal Murray scored 32 points, Nikola Jokic had 14 points, 14 rebounds and 11 assists in just three quarters for his fourth straight triple-double and the Denver Nuggets had a big run to beat the short-handed Sacramento Kings 117-96 on Wednesday night.\n\n\r\n              Jokic had his 19th triple-double of the season as Denver avoided losing all four games to Sacramento this season. Murray made 13 of 15 shots, including five of his six 3-point attempts, to help the Nuggets win their fourth straight since the All-Star break. They had dropped three in a row, including a home loss to the Kings on Feb. 14.\n\n\r\n              “I’m sure there are plenty of people around Denver jumping off bridges,” Denver coach Michael Malone said. “And everybody’s just got to take a chill pill and relax. Take a deep breath. This is a good team and when we’re healthy, we’re a really good team. That’s been the key. This group has proven they can beat anybody on any given night.”\n\n\r\n              Denver trailed 47-32 early in the second quarter and outscored the Kings 68-22 over the next 18:21 to lead by 32. Jokic completed the 124th triple-double of his career when he fed Kentavious Caldwell-Pope for a corner 3-pointer that made it 100-68 with 1:14 left in the third quarter.\n\n\r\n              Sacramento guard De’Aaron Fox was scratched from the lineup about an hour before tip-off because of a left knee contusion. He went through pregame warmups before being ruled out.\n\n\r\n              Domantas Sabonis, the NBA triple-double leader with 21, was held to 13 points, 10 rebounds and seven assists, while Keegan Murray scored 21 points for the Kings.\n\n\r\n              Keegan Murray had 11 points in the first quarter, including a 3-pointer at the end of the period that gave Sacramento a 35-28 lead, but was shut down by the Nuggets’ swarming defense. He made just 2 of 5 shots in the second and third quarters and scored six points with the game already out of reach.\n\n\r\n              Alex Len added 18 points off the bench for the Kings.\n\n\r\n              “They started getting deflections and we started making bad decisions with the basketball,” Sacramento coach Mike Brown said. “As soon as that happened you could see how hard they pushed and ran in transition.”\n\n\r\n              Several of Jokic’s assists led to dunks by Aaron Gordon, who had 17 points. Caldwell-Pope, who missed the last two games against the Kings, had 11 of his 18 points in the third quarter and Michael Porter Jr. finished with 14 points.\n\n\r\n              The Nuggets remain two games behind Minnesota for the top seed in the Western Conference.\n\n\r\n              “We came in after the All-Star break, everybody had the same mentality, the same goals in mind, and that’s to get back to the No. 1 spot and try to go back-to-back,” Caldwell-Pope said.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Minnesota on Friday night.\n\n\r\n              Nuggets: Host Miami on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996753.1146472
}