{
  "game_id": "0022000899",
  "espn_id": "401307698",
  "date": "Apr 23, 2021",
  "matchup": "BKN vs. BOS",
  "headline": "Nets back atop East after beating Celtics 109-104",
  "body": "NEW YORK -- — After Kyrie Irving piled up the points in two previous games against Boston, his shot wasn't there Friday night.\n\n\r\n                    He made up for it with every other aspect of his game.\n\n\r\n                    Irving just missed a triple-double despite an awful shooting night, Joe Harris scored 20 points and the Brooklyn Nets regained first place in the Eastern Conference with a 109-104 victory over the Celtics on Friday night.\n\n\r\n                    “We know that we’re not going to have it right away some games, so we’ve just got to battle through,” Irving said. \n\n\r\n                    He had torched his former team for 77 points in 67 minutes in a pair of victories this season, but this time shot just 4 for 19 and missed all six of his 3-pointers.\n\n\r\n                    But he scored 15 points, including the finishing free throws with 1.6 seconds left, and added 11 assists, nine rebounds and four steals as the Nets finished a season sweep of the Celtics, just the third in their franchise history.\n\n\r\n                    “He didn’t have his typical scoring night, but it’s few and far between that he doesn’t score the ball at a prolific rate,” Nets coach Steve Nash said. “He didn’t, but he definitely disrupted the basketball defensively and overall he draws a lot of attention, so I thought he was great in a lot of different ways than we’re accustomed to.” \n\n\r\n                    Jayson Tatum had 38 points and 10 rebounds but was doing it mostly alone in the first half, when he had 25 of the Celtics' 51 points. \n\n\r\n                    Payton Pritchard (22 points) and Marcus Smart (19) got it going after halftime, but the Celtics couldn't overcome 19 turnovers that gave Brooklyn a whopping 32-0 advantage in fast-break points. \n\n\r\n                    “Any time you turn the ball over a lot and you give a team like Brooklyn opportunities to get out in transition, get easy shots and stuff like that, it’s going to be tough to win games,” Pritchard said.\n\n\r\n                    Both teams were without two of their three best players. Kevin Durant missed a third straight game with a bruised left thigh, remaining sidelined along with James Harden (right hamstring).\n\n\r\n                    Jaylen Brown missed his second straight game with left shoulder bursitis, while Kemba Walker rested his left knee on the second night of Boston's back-to-back after beating Phoenix on Thursday.\n\n\r\n                    Boston cut Brooklyn's 17-point lead to 98-95 with about 3 1/2 minutes left after consecutive 3-pointers by Pritchard and Tatum. But Harris answered with a 3-pointer and Irving passed ahead to Jeff Green for a dunk to quickly push the lead back to eight.\n\n\r\n                    Green had 19 points for Brooklyn, which won for only the third time in six games. But that's good enough to move back ahead of idle Philadelphia, which has dropped three in a row. \n\n\r\n                    Brooklyn piled up a 17-0 advantage in fast-break points in the first half and threatened to blow it open but couldn't contain Tatum, whose 3-pointer with 3.4 seconds left capped his 16-point second quarter and cut it to 60-51 at halftime.\n\n\r\n                    The Nets got their running game going again, with Harris making consecutive 3-pointers off passes from Irving to cap a 10-0 spurt that pushed the lead to 86-70 in the final minute of the third.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: Evan Fournier returned after missing nine straight games because of health and safety protocol reasons but missed all seven shots. ... Brown's injury isn't severe but he doesn't have full range of motion, coach Brad Stevens said, adding the guard would be day to day. \n\n\r\n                    Nets: Mike James scored eight points after signing a 10-day contract Friday. The nine-year pro has played mostly in Europe and spent the last two seasons with CSKA Moscow and averaged 17.8 points in 41 games this season. ... Nash said it was possible but probably not likely that Tyler Johnson (right knee soreness) could return Sunday. \n\n\r\n                    NO REST — OR MAYBE SOME — FOR THE WEARY\n\n\r\n                    With Durant and Harden injured, Irving had played more than 37 minutes in three straight games, including on back-to-back nights Tuesday and Wednesday.\n\n\r\n                    “I’m not comfortable with it, but I don’t know what choice we have,” Nash said. “We’re limited on our bodies, we’re limited on our ballhandlers. So we’re in that difficult position right now.”\n\n\r\n                    The Celtics are in a similar spot with Tatum, but Stevens said he will get a day of rest in the near future. \n\n\r\n                    SEASON SWEEPS\n\n\r\n                    The Nets' other sweeps of Boston came in 1993-94 and 1996-97. They went 4-0 in both seasons. \n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: At Charlotte on Sunday.\n\n\r\n                    Nets: Host Phoenix on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764997476.1654441
}