{
  "game_id": "0022300016",
  "espn_id": "401584104",
  "date": "Nov 10, 2023",
  "matchup": "SAC vs. OKC",
  "headline": "Sabonis gets 15th triple-double with Sacramento, Kings beat Thunder in the In-Season Tournament",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 17 points, 13 assists and 12 rebounds to move into sole possession of second place on the Kings’ career list for triple-doubles, leading Sacramento to a 105-98 victory over the Oklahoma City Thunder in an In-Season Tournament game Friday night.\n\n\r\n              Kevin Huerter scored 19 of his season-high 28 points in the first half and grabbed nine rebounds to help Sacramento win its second consecutive game without point guard De’Aaron Fox. Fox has missed five games overall with a right ankle sprain. Keegan Murray added 24 points.\n\n\r\n              “I keep telling our team we can be a great team,” Kings coach Mike Brown said. “It doesn’t matter what five we throw out there, (if) we play the right way good things will happen.”\n\n\r\n              Sabonis had his first triple-double of the season and 15th with the Kings, breaking a tie with Chris Webber for most in the Sacramento era. Hall of Famer Oscar Robertson holds the franchise record with 176. Sabonis, who was acquired from the Indiana Pacers in a trade on Feb. 8, 2022, has 33 career triple-doubles.\n\n\r\n              Shai Gilgeous-Alexander scored 33 points for the Thunder.\n\n\r\n              “In the first quarter (we) spotted them a pretty good lead on controllable stuff defensively,” Thunder coach Mark Daigneault said. “It took us a long time to get our game plan in the game with the level of urgency that we need to have.”\n\n\r\n              The court at Golden 1 Center was changed, as all courts around the NBA have been, as part of the tournament.\n\n\r\n              “Luckily ours was gray,” Huerter said. “You’ve seen these courts bright red, bright green, bright blue. There was definitely a little bit different energy in the building. It was fun.”\n\n\r\n              The Kings (4-4) blew two big leads in the first three quarters, then opened the fourth with three consecutive 3-pointers to pull away. They also shot 41.8% (38 of 91) from the floor and were 13 of 47 beyond the arc.\n\n\r\n              “That’s a loss for us last year.” Brown said. “I know we can shoot the ball. I’m going to continue pressing our guys on the defensive end of the floor. And we had a lot of guys step up on that end.”\n\n\r\n              Sacramento led the entire game and outrebounded Oklahoma City 51-38 for its seventh consecutive win over the Thunder (5-4). \n\n\r\n              Huerter, whose has struggled shooting in his second season with the Kings, made eight of his first 13 shots, including three 3-pointers in the first half.\n\n\r\n              After blowing most of a 17-point lead in the second quarter, the Kings closed the first half on a 6-0 run capped by Huerter’s driving layup and went up 53-42.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Play the Suns in Phoenix on Sunday.\n\n\r\n              Kings: Host former head coach Luke Walton and the Cavaliers on Monday. Now an assistant with Cleveland, Walton coached the Kings from 2019-21.\n\n\r\n              ------\n\n\r\n              AP NBA: https:.//apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996805.6179268
}