{
  "game_id": "0022400068",
  "espn_id": "401704634",
  "date": "Oct 23, 2024",
  "matchup": "HOU vs. CHA",
  "headline": "Ball has 34 points and 11 assists in return from ankle injury to lead Hornets over Rockets 110-105",
  "body": "HOUSTON -- — LaMelo Ball had 34 points and 11 assists in his return from an ankle injury and Grant Williams made a go-ahead 3-pointer with 40 seconds left to give the Charlotte Hornets a 110-105 win over the Houston Rockets on Wednesday night.\n\n\r\n              Jalen Green scored five quick points to tie it before Williams put the Hornets on top with his step-back 3 to make it 106-103. Ball, who was playing in his first regular-season game since Jan. 26, added two free throws after that to secure the victory.\n\n\r\n              Green led Houston with 28 points and Alperen Sengun added 25 points and 18 rebounds in his return after missing the last 19 games of last season with a severely sprained ankle.\n\n\r\n              Takeaways\r\n              Hornets: This team has been plagued by injuries in recent years and the problems continued in the opener with young star Brandon Miller sitting out the second half with soreness in his left hip. They’ll need to keep him, Ball and Miles Bridges healthy if they hope to return to the playoffs after an eight-year drought.\n\n\r\n              Rockets: They need to play more consistently for four quarters after leading by double figures for most of the first three quarters before letting the Hornets get back into it late.\n\n\r\n              Key moment\r\n              The Hornets used a 10-0 run that spanned from late in the third quarter to early in the fourth to close the gap and put themselves in position for the win after trailing for most of the game.\n\n\r\n              Key stat\r\n              Houston shot 36.9% from the field while the Hornets made 44.7% of their shots.\n\n\r\n              Up next\r\n              The Rockets host the Grizzlies on Friday night and the Hornets visit Atlanta.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997424.82449
}