{
  "game_id": "0021500441",
  "espn_id": "400828328",
  "date": "Dec 26, 2015",
  "matchup": "MIL vs. TOR",
  "headline": "Raptors win third straight over Bucks, 111-90",
  "body": "MILWAUKEE --  The Toronto Raptors needed their best passing display of the season to top the Milwaukee Bucks.\n\nDeMar DeRozan had 22 points and eight assists and Terrence Ross scored 21 points to lead the Raptors past the Bucks 111-90 on Saturday.\n\nThe Raptors had a season-high 31 assists, including nine by Kyle Lowry.\n\n\"Once the ball got moving, the offense got in rhythm, players got in rhythm, shooters got in rhythm,\" head coach Dwane Casey said of 11 assists in the fourth quarter. \"The rhythm passes, that's the way we have to play to be successful offensively.\"\n\nThe previous high was 25 assists against New York on Nov. 10.\n\nThe Bucks concentrated on stopped DeRozan and Lowry, but couldn't contain the rest of the Raptors.\n\n\"They double team a lot with DeMar baseline and myself in the pick-and-roll,\" Lowry said. \"So, we had to find ways to get our guys, be decoys tonight. And, I think we did a good job of it.\"\n\nDeRozan had a chance to become the first player in team history to score 28 points or more in five straight games.\n\nLuis Scola scored 17 points, including 3 of 4 from behind the arc, and grabbed 11 rebounds for the Raptors. Bismack Biyombo added 14 points and 12 rebounds, and DeMarre Carroll, who missed the last nine games with a bruised right knee, scored seven points as Toronto won its third straight over Milwaukee.\n\n\"We got hot with seven good shots,\" Scola said. \"Momentum drifted on our side. They couldn't make shots. We made a couple of defensive plays and that confidence just grew.\"\n\nAfter the Bucks took a slim lead late in the third quarter, the Raptors made eight 3-pointers -- most were wide-open looks -- and closed the game out with seven straight for their final 21 points. Scola and Ross each had two in the surge.\n\n\"They stayed with it and broke us down,\" Khris Middleton said. \"We played well for three quarters, three and a half quarters, then took our foot off the gas.\"\n\nThe Raptors finished with 13 3s and improved to 7-3 when they hit at least 10 from long range.\n\nTrailing by three, the Raptors opened the fourth quarter with a 17-2 run capped by Scola's wide-open 3 from the corner that gave Toronto a 93-81 lead with 6:31 to play. The Bucks went cold for almost four minutes during that decisive stretch. Michael Carter-William's jumper at 6:14 was the first basket by Milwaukee in the quarter.\n\nMiddleton, who scored 20 points, hit a 3-pointer with 6:18 left in the third quarter and gave the Bucks their first lead of the game, 68-67. After a basket by Biyombo, the Bucks went on a 9-2 run capped by Middleton's 3 that put the Bucks up seven. Milwaukee led 79-76 at the end of the third.\n\nGreg Monroe scored 19 points for Milwaukee.\n\nLowry scored 13 of his 16 points in the second quarter and Ross added 10 as the Raptors led 56-52 at the half.\n\nTIP-INS\n\nRaptors: Biyombo grabbed nine rebounds in the first quarter, just one in the second and blocked three shots in the first half. ... Center Jonas Valanciunas missed his 10th game with a broken left hand. He has been cleared to practice.\n\nBucks: Guard O.J. Mayo briefly left the court and received five stitches under his chin after a collision under the Raptors' basket early in the second quarter. ... Forward John Henson had 10 blocks in just 40 minutes over the previous two games. Against the Raptors, he had two in the first half and one in the second. It was his 11th multi-block game of the season.\n\nDOUBLE-DOUBLE STREAK\n\nBiyombo extended his career-best double-double streak to six games with 14 points and 12 rebounds.\n\nUP NEXT\n\nRaptors: play the Bulls in Chicago on Monday.\n\nBucks: face the Mavericks in Dallas on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994070.783686
}