{
  "game_id": "0021500662",
  "espn_id": "400828549",
  "date": "Jan 23, 2016",
  "matchup": "LAL @ POR",
  "headline": "Lillard has 36 points and Blazers beat Lakers 121-103",
  "body": "PORTLAND, Ore. -- While Damian Lillard was the star of Portland's victory over the Lakers, it was Kobe Bryant's night.\nLillard had 36 points, including five 3-pointers, and the Trail Blazers beat Los Angeles 121-103 on Saturday night for Bryant's last game in Portland.\n\"Growing up, I was a Warriors fan but when the playoffs came I was a Lakers fan because we never made the playoffs. I was on Kobe's back, like, `Let's go Kobe, let's go Shaq.\" Lillard said. \"Now to play against him, and to know him, it's been a pleasure.\"\nCJ McCollum added 28 points for the Blazers, who led by as many as 27 points in the first half on the way to their eighth straight victory over the Lakers.\nD'Angelo Russell came off the bench with 21 points for the Lakers, who dropped their sixth straight game. But all eyes were on Bryant, a Portland nemesis dating back to the 2000 Western Conference finals, who finished with 10 points.\n\nIt was the second of a back-to-back for the Lakers, who fell 108-95 to the San Antonio Spurs on Friday night. The game was played on the 10th anniversary of Bryant's 81-point game against Toronto, which remains the second-highest scoring game in NBA history.\nBecause of the back-to-back, there was speculation that Bryant would not even play against the Blazers, but he started. It was Bryant's 62nd career game against Portland.\nBryan finishes 6-26 in Portland, his worst record in any city. But while the Blazers have pestered him during regular season games, most fans remember the 2000 conference finals. Portland was up by 15 points in the fourth quarter of Game 7, but the Lakers -- led by Bryant and Shaquille O'Neal -- came back to win.\nStill, there is grudging respect for Bryant, evident in the mixture of cheers and boos when Bryant was announced in pregame introductions, and an occasional \"Kobe! Kobe!\" chant broke out among the fans.\n\"There were too many Lakers' supporters for my taste, but I'm glad they showed Kobe some appreciation,\" Blazers coach Terry Stotts said, adding with a grin, \"maybe a little too much.\"\nBryant called the night \"a blast.\"\n\"I have so many great memories here. Most of the time I ended up on the losing side of things during the regular season,\" he said. \"The fans, the playoff battles ... great memories. I just tried to take it all in tonight.\"\nBryant said Portland, Sacramento and San Antonio were among his favorite places to play.\nPortland pushed its lead to 35-20 in the first half, with Lillard and McCollum combining for 24 points. Gerald Henderson's 15-foot jumper pushed the lead to 43-24.\nThe Lakers closed the gap to 53-46 after Lou William's jumper and free throw. Williams hit a 3-pointer that got the Lakers within 59-52 at the end of the half, but McCollum answered with his own 3 and the Blazers led 62-52 at the break.\nPortland extended the lead to 101-76, going on an 18-4 run to close out the fourth quarter. The Lakers closed within 103-88 after Russell's 3-pointer and free throw and fans chanted \"We want Kobe,\" but Bryant was already done for the night.\nA fan behind the Lakers' bench held a sign that read \"Thank You Kobe.\" Bryant embraced both Lillard and McCollum after the game and left the court to a loud ovation.\nIt was the sixth time Lillard had 30 or more points against the Lakers.\nTIP INS\nLakers: The Lakers remained without Larry Nance Jr., who missed his fourth straight game with a sore right knee. \"He's getting better,\" Scott said. \"I think if it was up to him he'd play tonight, but it's not.\"\nTrail Blazers: Portland was coming off a 104-98 loss to Atlanta on Wednesday. Lillard passed Damon Stoudamire for fourth on Portland's career 3-pointer list with 719.\nCLYDE THE GLIDE\nKobe Bryant recently listed former Blazer Clyde Drexler among the top five players he's faced in his long career. His coach agreed with him that Drexler was one of the best -- on and off the court.\n\"Clyde is just a great guy, an unbelievable talent,\" Scott said. \"There wasn't a lot he couldn't do with a basketball.\"\nHONORING DR. JACK\nBryant arrived at the Moda Center wearing a plaid suit, which he said afterward was a nod to the late Jack Ramsey, who led the Blazers to the 1977 NBA championship and had a penchant for plaid sport coats and pants.\nUP NEXT\nThe Lakers host Dallas on Tuesday night.\nThe Trail Blazers host Sacramento on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994275.027665
}