{
  "game_id": "0021900356",
  "espn_id": "401160998",
  "date": "Dec 11, 2019",
  "matchup": "CLE vs. HOU",
  "headline": "Harden scores 55, Rockets withstand scare from Cavaliers",
  "body": "CLEVELAND --  James Harden dropped another one of those demoralizing step-back 3-pointers that have made him famous, causing Cavaliers rookie Kevin Porter Jr. to look at Cleveland's bench for help.\n\nNothing could be done.\n\n\"He made a lot of shots you can't do anything about,\" Porter said.\n\nA lot of them is right.\n\nHarden scored 55 points -- 20 in the fourth quarter -- and Russell Westbrook added 23 points as the Houston Rockets withstood an unexpected scare from Cleveland and held on for a 116-110 win Wednesday night over the free-falling Cavs, who have lost eight straight and 14 of 15.\n\nHarden made four 3-pointers and shot 7 of 8 in the fourth while matching Kyrie Irving's arena record for points in a game. His fourth 50-point performance this season bailed out the Rockets, who allowed the Cavs to score 24 straight points in the second half.\n\n\"He's incredible,\" Rockets coach Mike D'Antoni said. \"If it was the first time he's done this, I'd be like, `Wow! Look at that,' but he's done it at this level for years.\"\n\nHarden became the fourth player in NBA history with multiple games of 10 or more 3-pointers, joining Golden State's Stephen Curry (15) and Klay Thompson (5), and former Cavs guard J.R. Smith (3).\n\nCleveland was still leading 108-107 when Harden, who came in as the league's top scorer at 38 points per game, dropped a floater in the lane with 1:03 left. After a turnover by Cavs guard Jordan Clarkson, P.J. Tucker hit a 3 from the corner and Clint Capela had a dunk following another Cleveland miscue.\n\nThe inexperienced Cavs crumbled in the final minute, committing three turnovers.\n\nBut it was their inability to slow down Harden that was their biggest undoing. His 55 points seemed almost effortless, as if he could score whenever he pleased.\n\nNeed a bucket? Call on Harden. A 3-pointer? He's the man. Whatever Houston needed, Harden got it for the Rockets.\n\n\"We caught a guy who plays at an MVP level,\" Cleveland forward Kevin Love said. \"He couldn't miss.\"\n\nHarden finished 20 of 34 from the floor, including 10 of 18 on 3s. He made all five free throws, and added eight assists and two steals.\n\n\"Good defense turned into James Harden offense,\" D'Antoni said. \"I've got nothing but praise for him on the defensive end, in addition to the offensive end. He realized that for us to win big, he's got to do it (play defense) -- and he is doing it. He's always in the right position.\"\n\nHarden shrugged off another big personal night, saying the Rockets have learned they're going to get the other team's best shot every game.\n\n\"We're a great team,\" he said. \"We get their best whether they come to our place or when we're on the road -- so teams are like, `We're playing the Rockets, so we have extra juice.\"\n\nCapela added 13 rebounds for Houston, which figured to have an easy time with the Cavs, who are struggling under first-year coach John Beilein.\n\nCleveland, though, came to play and was led by Porter's season-high 24 points. Collin Sexton added 18 and Love had 17 points and 11 boards.\n\nHarden connected on a pair of 3-pointers during a 16-2 run in the third quarter when the Rockets, who were sleepwalking through long stretches of the first half, appeared to take control.\n\nBut Houston relaxed, and Cleveland went on a jaw-dropping 24-0 run -- all without Love, who was on the bench -- over a 4:53 stretch bridging the third and fourth quarters to a take a 99-88 lead on Porter's bucket.\n\nHarden stopped the Cavs' surge with basket in the lane and scored Houston's next 13 points.\n\nLONG RUN\n\nCleveland's 24-point spurt was the club's longest since a 29-0 burst on Dec. 6, 2009, against Milwaukee.\n\nPOINT, COUNTER POINT\n\nHarden became the third player to score at least 50 in the building's history, joining Irving (55) and Allen Iverson (54, 50), who did it twice.\n\nTUNED OUT\n\nBeilein said the increased trade chatter surrounding Love has not been a distraction.\n\n\"I've been hearing about that from the day I was hired,\" said Beilein, echoing his predecessors. \"Whatever happens in this basketball business happens. We want Kevin to play at his best and I'm sure he does as well. We hope that happens today and every day going forward.\"\n\nTIP-INS\n\nRockets: Irving scored 55 at Rocket Mortgage FieldHouse on Jan. 28, 2015. ... Houston tied a club record with its ninth straight game scoring at least 115 points. ... Harden's 868 points through 23 games were the most since Rick Barry had 886 in 1966-67. ... Harden, who also leads the league in minutes per game, is the only player averaging more than 25.0 points and 2.0 steals. . C Tyson Chandler (illness) missed his third game in a row, while G Austin Rivers (illness) sat out his second straight.\n\nCavaliers: Beilein said he and his staff discussed changing the starting lineup but stuck with the same five: Love, Sexton, Cedi Osman, Tristan Thompson and Darius Garland. \"We've really done some studying which five-man groups or even two-man combinations play best together,\" he said. \"We may be onto some things.\" ... Garland is one of 11 rookies averaging double digits in scoring.\n\nUP NEXT\n\nRockets: Visit the Orlando Magic on Friday. Houston has won 11 of the last 14 games in the series.\n\nCavaliers: Begin a three-game road trip at San Antonio on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764996320.769465
}