{
  "game_id": "0022000157",
  "espn_id": "401267317",
  "date": "Jan 12, 2021",
  "matchup": "MIA @ PHI",
  "headline": "Embiid scores 45, Mathias wins it for 76ers in OT on 3",
  "body": "PHILADELPHIA -- — Pick a position, Joel Embiid got to the basket at will and continued to stir early-season MVP hype. Dakota Mathias needed only one open look to squeeze his way into Embiid's personal highlight reel.\n\n\r\n                    Embiid had 45 points and 16 rebounds, Mathias’ only basket of the game was a go-ahead 3-pointer with 26.1 seconds left and the Philadelphia 76ers hung on to beat the undermanned Miami Heat 137-134 in overtime on Tuesday night.\n\n\r\n                    “I've got a goal. I want to win the championship and I can't do it alone,” Embiid said.\n\n\r\n                    Embiid had some of the great moments of his career and carried the Sixers with a perfect third quarter and clutch buckets in OT to put them on the brink of victory.\n\n\r\n                    “He willed that game for us,” coach Doc Rivers said.\n\n\r\n                    It was little-known Mathias with the stunner that won it. Mathias, who went undrafted in 2018 and signed this season with the Sixers as a two-day G League player, got the ball from the top of the arc and buried it for the 134-132 lead.\n\n\r\n                    “No hesitation,” Rivers said. “It says a lot about him.”\n\n\r\n                    With Jimmy Butler, Bam Adebayo and Goran Dragic among the Heat sitting out for COVID-related reasons, they pushed the Sixers into OT with a mad-dash end to the fourth. Tyler Herro helped the Heat overcome Embiid’s dominant effort when his 3-pointer tied the game 115-all with 2:25 left. Precious Achiuwa scored two straight baskets -- the first off Philly’s shot clock violation, then off a turnover -- for a 119-115 lead.\n\n\r\n                    Embiid buried the pull-up jumper just inside the 3-point arc with 3.3 seconds left that tied it 120-120 and sent the game into overtime. It was his only bucket of the fourth after he made all eight shots in the third. \n\n\r\n                    Embiid’s go-ahead three-point play with 2:37 left in OT put the Sixers up 126-124, and Herro matched his regulation theatrics with another tying 3 for 129-all.\n\n\r\n                    Danny Green matched the 76ers' record with nine 3-pointers and scored 29 points and Mike Scott had 16 points.\n\n\r\n                    Herro finished with 34 points, Duncan Robinson had 26 and Gabe Vincent 24.\n\n\r\n                    “It's a shame because our guys did more than enough to put ourselves in position to win,” Heat coach Erik Spoelstra said. “They could have kept on going another two overtimes. It wasn't a matter of lack of want or lack of effort. Our guys emptied it all out there. It's just a matter of getting over this hurdle of really finishing plays.”\n\n\r\n                    Embiid finished plays in bunches and took over the third quarter when scored 20 points and in OT when he scored 11 points.\n\n\r\n                    Embiid was all over the court in the third.\n\n\r\n                    He smacked the ball away under the basket to break up a Miami possession, then hustled down to hit Isiah Joe for a 3 and cut the hole to four. Embiid followed that by shaking off a double team and tossing an underhand shot for the basket. He made the free throw and Sixers were down one. Embiid made it back-to-back three-point plays when he got the Heat to bite on a pump-fake from the free-throw line.\n\n\r\n                    The big man even handled the rock with ease and went the length of the floor to hit a little fadeaway and extend the lead. \n\n\r\n                    He was 16 of 23 from the floor and made all 13 free throws. Embiid had five steals and a blocked shot.\n\n\r\n                    “There was no chance we were going down,” Embiid said. “Whatever I had to do and whatever my teammates had to do, we did it.”\n\n\r\n                    Achiuwa had 17 points and 13 rebounds and the Heat made 19 of 56 3-pointers.\n\n\r\n                    “We're not just trying to develop guys for the future.,” Spoelstra said. “We're trying to develop guys to learn how to win at the highest level, this year. Right now.”\n\n\r\n                    TIP-INS \n\n\r\n                    Heat: F/C Meyers Leonard sat out with a strained left shoulder. ... The Heat continued to struggle with roster issues after their game Sunday against Boston was postponed because they couldn’t field the minimum number of players.\n\n\r\n                    76ers: Rivers said Ben Simmons had to be summoned back to New York after he tried to return to Philadelphia when the team needed to stay an extra day for additional COVID-19 testing. Simmons had five points, 12 assists and fouled out. ... Dwight Howard moved into 13th on the NBA’s career blocked shots list. ... Dana Barros hit nine 3s on Jan. 27, 1995 vs. Phoenix.\n\n\r\n                    DAY OFF\n\n\r\n                    Embiid said it was “unfortunate” the 76ers had to play when they were short-handed over the weekend because of COVID issues while other games were postponed.\n\n\r\n                    “I guess the league keeps making us play,” he said. “There's really no other explanation behind it.”\n\n\r\n                    UP NEXT\n\n\r\n                    The Heat stay in Philly and finish the two-game set on Thursday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997859.107069
}