{
  "game_id": "401810052",
  "espn_id": "401810052",
  "date": "Nov 09, 2025",
  "matchup": "SAC vs MIN",
  "headline": "Edwards scores 26 points to lead the Timberwolves to a 144-117 win over the Kings",
  "body": "SACRAMENTO, Calif. -- — Anthony Edwards had 26 points, four rebounds, five assists, two steals and led the Minnesota Timberwolves to a 144-117 win over the Sacramento Kings on Sunday night.\n\n\r\n              Edwards shot 7 for 16 from the field, 5 for 11 from 3-point range and made 7 of 8 shots from the line. He was coming off a 37-point effort in a 137-97 victory over the Utah Jazz on Friday. In his last two games, Edwards has hit 12 of 23 shots from 3-point distance.\n\n\r\n              Jaden McDaniels scored 21 points and Julius Randle and Rudy Gobert added 19 points apiece for the Timberwolves (6-4). Naz Reid scored 13 points off the bench. Gobert added 12 rebounds and five blocked shots.\n\n\r\n              Zach LaVine scored 26 points, and DeMar DeRozan added 22 for the Kings (3-7), who lost for the third time in four games. Domantas Sabonis had 20 points and 13 rebounds after missing the last two games due to rib soreness.\n\n\r\n              Edwards missed his first five shots before making a 3-pointer, followed by a four-point play at the 4:07 mark of the second quarter. His 3-point basket gave Minnesota a 67-48 lead in the first half.\n\n\r\n              The Timberwolves led 71-54 at halftime. Edwards had 16 points in the second quarter, making 4 of 6 shots from the field and hitting all three of his attempts from distance. He also hit 5 of 6 free throws.\n\n\r\n              In the third quarter, Reid’s basket gave the Timberwolves a 99-71 lead, their largest margin of the game. Minnesota scored 40 points in the second and third quarters. The Timberwolves scored 64 points in the paint.\n\n\r\n              Kings fans began chanting for Keon Ellis halfway through the third quarter. He started the fourth quarter after sitting for the first three.\n\n\r\n              Up next\r\n              Timberwolves: At Utah on Monday night.\n\n\r\n              Kings: Host Denver on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042594.460566
}