{
  "game_id": "0022300408",
  "espn_id": "401585036",
  "date": "Dec 26, 2023",
  "matchup": "CHI vs. ATL",
  "headline": "Drummond, DeRozan lead the way as Bulls hold off Hawks 118-113",
  "body": "CHICAGO -- — DeMar DeRozan felt like a kid in his bedroom again pouring water on his head to simulate sweat and taking imaginary jumpers, dreaming of moments of like this with the crowd roaring as each shot fell through the net.\n\n\r\n              DeRozan scored 25 points, Drummond had season highs of 24 points and 25 rebounds in his first start of the season, and Chicago cooled off the Hawks' Trae Young somewhat in a 118-113 victory Tuesday night.\n\n\r\n              Young finished with 21 points and 13 assists after tying Oscar Robertson’s record of seven consecutive games with at least 30 points and 10 assists.\n\n\r\n              The Bulls won for the ninth time in 13 games with Zach LaVine sidelined because of inflammation in his right foot. And they did it this time with center Nikola Vucevic out because of bruised muscles around his left hip and groin.\n\n\r\n              DeRozan scored all but four of his points in the second half. He had 11 in the fourth quarter, including eight in the final 2:50 to help Chicago come away with the win.\n\n\r\n              “The kid in me loves those moments,” he said. ”Loved the energy from the crowd. It's fun. It's an honor, a privilege, to be able to be trusted in those moments so you try to take it all in.\"\n\n\r\n              Drummond made 11 of 13 shots and played 39 minutes with Vucevic sidelined. \n\n\r\n              “I still believe I'm a starter in this league,” he said. “But the position I'm in now, I take it and play to the best of my ability.”\n\n\r\n              Coby White and Ayo Dosunmu each scored 19. White missed all seven 3-pointers and the Bulls were 7 of 25 from beyond the arc. But they made enough shots to bounce back from a loss to injury-riddled Cleveland on Saturday.\n\n\r\n              Bogdan Bogdanovic led Atlanta with 22 points. Dejounte Murray finished with 17 after scoring 20 or more in five straight games, and the Hawks lost their third in a row.\n\n\r\n              The game was tied at 106-all when Alex Caruso nailed a 3 with just under four minutes remaining and the Bulls were up 111-110 when DeRozan hit a 14-footer with 1:42 left.\n\n\r\n              Murray then got called for a charge. With a chance to make it a two-possession game, White missed a 3 and Caruso came away with a steal, only to miss a 3 and a layup.\n\n\r\n              Young then cut it to 113-111 when he made a free throw with 43 seconds remaining. But DeRozan spun for a finger roll to bump Chicago's lead to four with 26 seconds left, and the Bulls hung on from there.\n\n\r\n              Atlanta’s Jalen Johnson had 10 points in his first appearance since Nov. 25. The versatile forward missed the previous 14 games because of a broken left wrist.\n\n\r\n              Chicago could be down two key players at least for a little while, with Vucevic joining LaVine on the sideline.\n\n\r\n              Coach Billy Donovan was not sure how long Vucevic will be out. The two-time All-Star had an MRI on Tuesday.\n\n\r\n              Vucevic was hurt trying to defend a dunk by Cleveland’s Max Strus during the Bulls’ loss to the Cavaliers on Saturday. Strus’ right knee struck Vucevic in the groin area.\n\n\r\n              Vucevic, averaging 16.7 points and 10.4 rebounds, missed his first game this season. He played in all 82 games last year.\n\n\r\n              LaVine, meanwhile, started doing some light cutting on Tuesday. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Sacramento on Friday.\n\n\r\n              Bulls: Host Indiana on Thursday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995904.6612349
}