{
  "game_id": "0021500937",
  "espn_id": "400828824",
  "date": "Mar 07, 2016",
  "matchup": "CHA vs. MIN",
  "headline": "Walker scores 34, Hornets hold off Timberwolves 108-103",
  "body": "CHARLOTTE, N.C. --  There's no secret recipe to the Charlotte Hornets' recent success -- when Kemba Walker scores big, the Hornets usually win.\n\nWalker put up another big game Monday night, scoring 21 of his 34 points in the third quarter while the Hornets held off the Minnesota Timberwolves 108-103 for their fourth straight win.\n\nAl Jefferson came off the bench to add 20 points, Marvin Williams had 15 and Nicolas Batum 11 for Charlotte, which has now won eight of its past 10 games.\n\n\"I thought we played hard, especially when we needed to,\" Walker said after his third straight 30-point game and 11th this season. \"This was a very big win for us.\"\n\nKarl-Anthony Towns had 28 points and 14 rebounds, and Anthony Wiggins added 25 points for the Timberwolves, who were up 55-51 with 9:25 left in the third quarter.\n\nBut that's when Walker came up big for the Hornets.\n\nWalker hit five 3-pointers in the third quarter and Charlotte rallied, leading to seven lead changes and two ties. His jumper with 1:52 left put the Hornets up for good, 74-73.\n\n\"I just made a few shots,\" said Walker, who was 7 of 9 from the field in the quarter, including 5 of 5 on 3-pointers. \"I had to step up a little bit, trying to get the momentum back and trying to bring some energy.\n\n\"It helped out -- me scoring got other guys going, especially on the defensive end where we got stops.\"\n\nCharlotte pulled ahead 100-85 on Williams' 3-pointer with 3:50 left in the fourth quarter. Minnesota rallied, though, pulling within 104-101 with 15 seconds remaining before Jeremy Lin hit four free throws over the final 12 seconds for the Hornets.\n\n\"We played well, the thing that got us was we had times we weren't scoring and we weren't playing defense,\" Wiggins said. \"We played hard, we played hard. The whole team, we gave it our all.\"\n\nAn 18-7 run to open the second quarter gave Charlotte its biggest lead of the game, 41-25, on Courtney Lee's jumper with 6:21 remaining.\n\nHowever, the Timberwolves closed out the quarter with a 24-6 run, capped by Gorgui Dieng's follow-up dunk with 3.4 seconds left, to go ahead 49-47.\n\n\"We got off to a good start, but then we had a stretch where (Minnesota) got going,\" Hornets coach Steve Clifford said. \"They have a lot of talented individual players, so the second quarter was a struggle. But Kemba got going again in the third quarter, and we made enough plays to win the game.\"\n\nTIP-INS\n\nTimberwolves: Minnesota has now lost five straight to Charlotte, dating to the 2013-2014 season. ... Ricky Rubio had 10 points and 10 assists, Zach LaVine added 19 points and Dieng 12. ... Forward Kevin Garnett (sore right knee) and center Nikola Pekovic (sore right ankle) were both inactive Monday.\n\nHornets: Center Spencer Hawes was inactive for the ninth straight game with a lower back strain. ... Walker came close to tying his own team record for points scored in a quarter -- 23 points, set against Sacramento on Nov. 23. ... Walker also flirted with a triple-double, adding seven rebounds and six assists.\n\nATHLETIC MOVE\n\nWilliams came up with a block on LaVine's layup attempt early in the first quarter. As the ball was going out of bounds, Williams deflected it off LaVine, giving Charlotte possession.\n\nBENCH SCORING\n\nLed by Jefferson, the Hornets' bench outscored the Timberwolves' reserves 38-9, the fewest allowed by Charlotte this season. The team's previous low was 13 points scored by the Atlanta Hawks on Nov. 1.\n\nUP NEXT\n\nTimberwolves: Host the San Antonio Spurs on Tuesday night.\n\nHornets: Host the New Orleans Pelicans on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994359.003438
}