{
  "game_id": "0022000278",
  "espn_id": "401307613",
  "date": "Apr 12, 2021",
  "matchup": "MEM vs. CHI",
  "headline": "Valanciunas leads late burst as Grizzlies beat Bulls 101-90",
  "body": "MEMPHIS, Tenn. -- — Jonas Valanciunas had 26 points and 14 rebounds, leading a fourth-quarter burst that carried the Memphis Grizzlies to a 101-90 victory over the Chicago Bulls on Monday night.\n\n\r\n                    Valanciunas, who had 32 points and 22 rebounds a night earlier in a loss to the Indiana Pacers, scored 10 in the fourth as Memphis used an 18-6 run to break open a close game.\n\n\r\n                    “Jonas is Jonas, man,” said second-year guard Ja Morant. “He’s a top player for us. He commands the paint. Protects the paint. A walking double-double.”\n\n\r\n                    Valanciunas’ double-double was his 15th in a row, setting a franchise record.\n\n\r\n                    “It’s not an individual sport,” Valanciunas said. “I would not be doing it without my teammates, first of all. Second thing, I’m playing with a high energy. I’m putting a lot of work in trying to go for every rebound. Trying to go for every putback. Stuff like that. That pays off.”\n\n\r\n                    Dillon Brooks finished with 17 points and Grayson Allen added 14. Morant had 13 points and 10 assists. \n\n\r\n                    Zach LaVine scored 21 points, but he was just 5 for 14 from the field as the Bulls lost their third straight. Thaddeus Young scored 20 and Daniel Theis had 18. Nikola Vucevic finished with 17 points and 10 rebounds. \n\n\r\n                    “I think it’s going to be really, really hard to have a lot of guys in double figures when you shoot (42%) from the field and 16% from the 3-point line.” Chicago coach Billy Donovan said. “I think our bench was 0 for 12 from 3. We didn’t shoot the ball particularly well all the way around as a team.”\n\n\r\n                    The teams stayed close through the first three quarters. Vucevic provided a bit of a buffer for the Bulls, scoring 12 in the period for a 74-70 lead entering the fourth.\n\n\r\n                    The game was originally scheduled for Jan. 27, but called off due to health and safety protocols. That left both teams playing Monday on the second night of a back-to-back, and coming off losses.\n\n\r\n                    “We know what we are capable of,” Morant said. “How we are able to bounce back from a loss and move on.”\n\n\r\n                    The lingering effects of the consecutive games still showed early. Neither team managed more than 46% shooting in the first half, and Memphis added to its problems with 12 turnovers, while the Bulls committed nine.\n\n\r\n                    That made for a close half. A 16-6 run to close it gave Memphis a 48-47 lead at intermission.\n\n\r\n                    Neither team led by double digits until Memphis’ run in the fourth.\n\n\r\n                    “Every night we have one category that we don’t perform well,” said Theis, who came over last month in a trade with Boston. “One night the turnover costs us the game. (Sunday against Minnesota) we didn’t get to the line a lot, …Today, we didn’t shoot the ball well from 3.\n\n\r\n                    “Now, we have to put it together. We play defense like (Monday), and we make those shots, we’re going to win games.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: The game wrapped up a span where Chicago played nine of its last 10 on the road. The exception was a home win over Brooklyn on April 4. … Theis was 7 of 8 in the first half, scoring 14 points. … Vucevic tied his season high with five steals. … Chicago’s six-game winning streak in the series was snapped. \n\n\r\n                    Grizzlies: Travel to Chicago on Friday for the second game of the season home-and-home series. The game in Chicago is the first of a seven-game road trip for Memphis. … Valanciunas’ streak topped Zach Randolph’s consecutive games with a double-double from 2011. \n\n\r\n                    SHOOTING OF DAUNTE WRIGHT\n\n\r\n                    In his pregame comments, Grizzlies coach Taylor Jenkins addressed the shooting of Daunte Wright in a Minneapolis suburb. Jenkins said the incident “has just been another reminder about how there is so much change that needs to happen in our country.”\n\n\r\n                    “More work needs to be done,” Jenkins said, “and we talked as a team about the importance of using our voices to speak out on injustices, how there needs to be equality for all, how these situations are avoidable and change needs to happen. There’s a long road ahead.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host Orlando on Wednesday\n\n\r\n                    Grizzlies: Host the Dallas Mavericks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996935.641991
}