{
  "game_id": "0021600837",
  "espn_id": "400900243",
  "date": "Feb 15, 2017",
  "matchup": "CHA @ TOR",
  "headline": "Raptors claw back, rally past Hornets 90-85",
  "body": "TORONTO --  Down 17 points after three quarters, Toronto Raptors coach Dwane Casey turned to his \"fountain of youth\"  -- and the youngsters helped deliver a win heading into the All-Star break.\n\nLooking for a spark, Casey sat three of his starters for the entire fourth quarter in favor of rookie Jakob Poeltl, second-year guard Norman Powell and backup guard Cory Joseph in the Raptors' 90-85 comeback victory over the Charlotte Hornets on Wednesday night.\n\n\"We weren't playing good at the time, so I just tried to go in there and bring some energy,\" said Poeltl, who had two points, six rebounds and two assists while playing all 12 minutes of a fourth quarter that saw the Raptors outscore Charlotte 32-10 to snap a three-game losing slide.\n\n\"It's awesome, that's usually my job, standing out there trying to cheer these guys on and today it was the other way around,\" Poeltl said of having starters DeMar DeRozan, Jonas Valanciunas and Norman Powell standing up at the bench and cheering them on through the comeback.\n\nThe Raptors, who are now 33-24, entered the fourth quarter down 75-58, but quickly erased the lead of the Hornets, who fell to 24-32.\n\nKyle Lowry, who finished with a team-high 21 points, and Joseph each hit a pair of 3s as Toronto began the final quarter by outscoring the Hornets 20-2 over the first 4:49 to surge to a 78-77 lead.\n\n\"It's just inexcusable stuff,\" Charlotte's Frank Kaminsky, who had a game-high 27 points, said of the fourth quarter collapse. \"They outhustled us. They outplayed us. It's as simple as that.\"\n\nKaminsky tied the game at 82 with a 3 with 1:54 to go in the fourth.\n\nLowry had a three-point play to break the tie with 1:40 to go. After Delon Wright's layup made it a five-point game, Nicolas Batum hit a 3 for Charlotte to pull the Hornets within two, but DeMarre Carroll responded with a 3 of his own with 7.4 seconds to go to ice it.\n\nPowell had 17 points and Valanciunas had 10 points and 11 rebounds as the Raptors won for just the fifth time in the past 16 games.\n\n\"We went to the fountain of youth,\" Casey said, \"and those guys came through and played their behinds off.\"\n\nKemba Walker had 24 points and nine assists for Charlotte, which dropped its fourth straight and 11th consecutive road game. Michael Kidd-Gilchrist had six points and a game-high 14 rebounds.\n\nCharlotte took a 75-58 lead into the final quarter on the strength of a dominant third. The Hornets outscored the Raptors 34-14 in the period, shooting a sizzling 77 percent from the field compared to just 25 percent for Toronto. They opened the quarter on an 8-0 run to take the lead for the first time since the opening quarter as the Raptors missed their first seven shots of the second half.\n\nKaminsky led the way for the Hornets in the third period with 15 points.\n\nThe Hornets closed the third quarter on a 13-3 run over the final 3: 46, prompting the Toronto fans to boo the Raptors off the court when the horn sounded to end the period.\n\n\"We just wanted to try and maintain our play and unfortunately we didn't,\" Walker said of the fourth quarter. \"They made a comeback of their own and made big shots down the stretch.\"\n\nToronto took a 44-41 lead into the halftime break, but the Raptors led by as many as 14 points early in the second quarter before Walker got hot. The All-Star guard hit all four 3s he attempted in the quarter, including three in a 48-second stretch. He led all scorers at the half with 15 points, 12 in the second period.\n\n\"Basically, in the fourth quarter what they did was say, `Anyone but Kemba,\" Hornets coach Steve Clifford said. \"They took the ball out of his hands and we've got to make some plays ... and we just didn't do it.\"\n\nSTAGGERING TO THE FINISH\n\nCharlotte shot 42 percent from the field on the night, but just 3 for 18 (17 percent) in the fourth quarter, including just 2 of 13 from beyond the arc.\n\nTEAM UNITED NATIONS\n\nWith the addition of Ibaka (Republic of Congo), the Raptors have seven players on the roster born outside the United States, matching Utah for the most in the NBA.\n\nWEEKEND THREADS\n\nBefore the game, DeRozan and Lowry received a loud ovation from the crowd when they were presented with their All-Star jerseys for this weekend's festivities in New Orleans.\n\nQUOTABLE\n\nClifford: \"If guys play at the level they played at for 56 games, it will not be enough. You can't have 1 1/2, two guys play well and win, not in our league.\"\n\nTIP-INS\n\nHornets: C Miles Plumlee, who strained his right calf in Monday's loss at home to Philadelphia, did not dress. ... C Cody Zeller missed his third straight game with quad soreness. ... F Michael Kidd-Gilchrist had his team-best 15th game of the season with at least 10 rebounds.\n\nRaptors: PF Serge Ibaka, acquired in a trade Tuesday with the Orlando Magic in exchange for Terrence Ross and a first-round draft choice, did not play. ... F Patrick Patterson missed his sixth straight game with a left knee contusion. ... C Jonas Valanciunas posted his team-leading 21st double-double of the season.\n\nUP NEXT:\n\nHornets: return from the All-Star break with a stretch of six straight road games, which begin at Detroit on Feb. 23.\n\nRaptors: expects to have Ibaka in the lineup when they return from the All-Star break to host Boston on Feb. 24.",
  "source": "espn_api",
  "crawled_at": 1764995487.93218
}