{
  "game_id": "0021500345",
  "espn_id": "400828232",
  "date": "Dec 12, 2015",
  "matchup": "CHA vs. BOS",
  "headline": "Bradley, Thomas lead Celtics over Hornets, 98-93",
  "body": "CHARLOTTE, N.C. -- The Boston Celtics easily could have mailed it in Saturday night after losing a grueling double-overtime game to Stephen Curry and the Golden State Warriors the night before.\nBut that's not Boston's style.\nInstead, the Celtics gutted it out on the second night of a back-to-back -- just as they've done most of this season under coach Brad Stevens.\nAvery Bradley scored 23 points, Isaiah Thomas added 21 points and 13 assists, and the Celtics snapped the Charlotte Hornets' four-game winning streak with a 98-93 victory.\n\nThe Celtics improved to 4-1 on the second night of a back-to-back.\n\"It's our determination to come out every single night and play hard for each other,\" Bradley said. \"Mentally some guys could say we played a double-overtime game and we're tired and we're hurting, but we came out tonight and no matter what we wanted to get the win and that shows a lot about the team.\"\nJae Crowder added 16 points and seven rebounds for the Celtics (14-10), who have won seven of their last 10 games.\nStevens called it a big win over a Hornets team that was 10-3 at home coming into the game.\n\"We have been awfully good on the second night of back-to-backs, for whatever reason, on the road,\" Stevens said. \"So we have a lot of confidence that we are going to, if we struggle early, we will find that second wind. We're not going to make any excuses.\"\nThe Hornets had a chance to tie the game late but Nicolas Batum's 30-foot jumper off a side inbounds play with 6.6 seconds remaining missed everything. Evan Turner put away the game with a layup.\nBatum led the Hornets with 21 points and eight rebounds, and Kemba Walker had 16 points. Charlotte shot just 11 of 35 from 3-point range and seemed to lack intensity.\n\"They played with more energy than us tonight,\" Batum said. \"They should be more tired than us. We played a different game than them Friday night (in a win over Memphis). They had double overtime but they had more energy and they came out to beat us.\"\nThe Celtics trailed 42-38 at the half after shooting 35 percent from the field, including 1 of 10 on 3-pointers. But their fortunes changed in the second half as they knocked seven of their first eight shots from beyond the arc to build a 69-57 lead.\nThe Hornets battled back to take the lead in the fourth quarter, but the Celtics went ahead for good when Thomas scored on a 3-on-1 fast break after Walker missed a driving layup in the lane. Walker looked for a foul but didn't get the call.\nDown three with 20 seconds left, the Hornets had a chance to tie but Batum and Marvin Williams both missed 3-pointers.\nTIP-INS\nCeltics: Boston is 12-1 when leading entering the fourth quarter. ... The Celtics have won three straight against the Hornets.\nHornets: Hornets coach Steven Clifford said he is pleased with rookie Frank Kaminsky's defense, saying it is ahead of where he thought it would be this early in the season. ... Batum has hit a 3-pointer in 18 straight games.\nTAKING CARE\nThe Celtics helped themselves by only committing five turnovers against a team that has been decent at scoring off opponent's mistakes.\nJORDAN IN THE HOUSE\nHornets owner Michael Jordan was seen before the game talking to a few players as they walked down the hall. Jordan jokingly grabbed center Cody Zeller on the shoulder and said, \"You aren't tired, are you?\" referring to their game the night before at Memphis.\nTHIRD QUARTER WOES:\nClifford was not happy with his team's defense in the third quarter after the Hornets allowed seven 3-pointers. Thomas, in particular, gave the Hornets fits. He was 8 of 16 from the field and when he wasn't scoring, he was making the right plays to get the ball into the hands of teammates who could.\n\"He got whatever he wanted. He's a handful,\" Clifford said. \"It wasn't the guys guarding him, it was the guys guarding the screener. We just didn't do a good job. He's going to be in the paint. Then you are forced to help and then they are going to get quality shots. That's it.\"\nIN THE CROWD\nRapper Nelly took in the game from a courtside seat.\nUP NEXT\nCeltics: Host Cleveland on Tuesday night.\nHornets: Visit Orlando on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994397.142946
}