{
  "game_id": "0022200374",
  "espn_id": "401468529",
  "date": "Dec 08, 2022",
  "matchup": "MIA vs. LAC",
  "headline": "Adebayo, Butler lift Heat past Kawhi-less Clippers 115-110",
  "body": "MIAMI -- — Bam Adebayo knows the Miami Heat have some work to do to climb up the standings.\n\n\r\n              Thursday was, he hopes, a good start.\n\n\r\n              Adebayo had 31 points and 10 rebounds, Jimmy Butler added 26 points and the Heat held off the Los Angeles Clippers 115-110.\n\n\r\n              “If we worry about ourselves, I feel like we're going to be all right,\" Adebayo said.\n\n\r\n              Tyler Herro scored 19 and Caleb Martin finished with 17 for the Heat. Butler scored the final eight points for Miami (12-14), which is 10th in the Eastern Conference — but only two games back of No. 4 Brooklyn.\n\n\r\n              “We gave Jimmy the ball, and let him do his thing down the stretch,” Adebayo said.\n\n\r\n              Paul George finished with 29 points, eight rebounds and seven assists for the Clippers, who went 0-2 on their Florida swing after falling in overtime at Orlando on Wednesday.\n\n\r\n              Reggie Jackson scored 20 for the Clippers, while Nic Batum and Marcus Morris Sr. each added 11.\n\n\r\n              “We just had too many breakdowns is what it came down to tonight,\" George said. “They're a good team.\"\n\n\r\n              The Clippers were without Kawhi Leonard — he’s now missed 20 of 27 games this season — on the second night of a back-to-back, part of the ongoing plan for managing his right knee issues. For Miami, starting point guard Kyle Lowry was out for the first time this season, given a game off for rest, and backup point guard Gabe Vincent (left knee) remained sidelined.\n\n\r\n              “You’ve just got to try to do what you can do to stay afloat, and the mindset you’ve got to have and the culture you set is no matter who’s on the floor, you’ve got to think you can win the game,” Clippers coach Tyronn Lue said. “That’s been our mindset since I’ve been here.”\n\n\r\n              The win was the 672nd for Heat coach Erik Spoelstra, tying him with Mike D’Antoni for 21st on the NBA’s career list.\n\n\r\n              There were 25 lead changes and 11 ties in a game that was close all the way to the end, until Butler took over in the final moments.\n\n\r\n              “Both teams were going back and forth, pretty much the whole game,\" Spoelstra said. “Our approach from the very beginning was this was going to take the whole 48 minutes, if not more ... and stack play after play after play.\"\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Lue is one win away from tying fellow former NBA player Kevin McHale (232) for 93rd on the coaching list. ... G-F Terance Mann has entered the NBA’s concussion protocols and missed the game. Mann got hurt in the final seconds of overtime in the Clippers’ 116-111 loss at Orlando on Wednesday. ... The Clippers are 5-2 with Leonard and 9-11 without him.\n\n\r\n              Heat: Miami outscored the Clippers 22-6 off turnovers. ... Martin’s 16-point second quarter was the third-most points in a quarter by a Heat player this season. Strus had 19 against Boston in the third quarter on Nov. 30, and Adebayo had an 18-point first quarter against Washington on Nov. 25. ... With Lowry and Vincent sidelined, two-way player Dru Smith made his first career start. He’s now the 201st player to start a game for Miami.\n\n\r\n              BACK AND FORTH\n\n\r\n              From the 9:36 mark of the second quarter to the 4:21 mark of the fourth, a stretch of 29:15 in all, neither team had more than a six-point lead.\n\n\r\n              SOCCER VISITOR\n\n\r\n              U.S. men’s soccer star Christian Pulisic, who figured in all three American goals in their four games at the World Cup — one goal and two assists — was in attendance.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit Washington on Saturday.\n\n\r\n              Heat: Host San Antonio on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993980.213716
}