{
  "game_id": "0021500218",
  "espn_id": "400828105",
  "date": "Nov 25, 2015",
  "matchup": "DET vs. MIA",
  "headline": "Drummond has 18 points, 20 boards as Pistons rout Heat",
  "body": "AUBURN HILLS, Mich. --  Stan Van Gundy is tired of his Detroit players talking a better game than they play.\n\nWednesday night, he asked them to do something about it.\n\n\"I'm always hearing guys talking about playing hard, but the heck with that -- talking doesn't do anything,\" he said. \"I wanted to see guys actually go out and show some leadership by playing hard.\"\n\nOne of his specific messages was that he wanted Andre Drummond to put forth a big effort against Miami's Hassan Whiteside. Drummond responded with 18 points, 20 rebounds and a season-high five blocks in Detroit's 104-81 victory.\n\n\"He was aggressively protecting the rim right from the start of the game, which was what we needed,\" Van Gundy said. \"That's tough because they can throw lobs to Whiteside, but he handled it.\"\n\nDrummond knew what was expected of him. He has grabbed 20 rebounds in four of Detroit's 15 games, but it was his blocks that were important.\n\n\"We had a talk yesterday at practice about me not challenging shots, so I made that a job tonight,\" he said. \"I was going after everything, knowing my teammates would have my back against the lob.\"\n\nDetroit won for the third time in nine games, while Miami lost for only the second time in eight.\n\n\"They had us on our heels pretty much from the get go,\" Heat coach Erik Spoelstra said. \"They dictated the game and they imposed their will. They started that on the first possession of the game and they didn't stop.\"\n\nReggie Jackson added 18 points and seven rebounds for the Pistons.\n\nGerald Green had 16 points for Miami, while Whiteside finished with 15 points and 13 rebounds.\n\nDwyane Wade scored two points on 1-for-9 shooting -- the fewest points he has ever scored in at least 20 minutes of action.\n\n\"I just sucked tonight,\" Wade said. \"Give Detroit credit, because they came out to win this game, and they were very focused. But individually, I just sucked.\"\n\nKentavious Caldwell-Pope, who spent most of the game guarding Wade, missed 13 of his 15 shots, but didn't let it bother his defense.\n\n\"That's something I learned in college. Most of my offense comes from my defense anyway, so I know I had to focus on that first,\" he said. \"He's got so many moves that I just tried to stay on top of him and not give him any space.\"\n\nVan Gundy, though, wasn't giving Caldwell-Pope too much credit.\n\n\"Dwyane has scored a lot of points for me and a lot of points against me, so I know what he's capable of doing,\" he said. \"Give KCP credit, he played really, really hard against him, but I've seen a lot of guys play really, really hard against Dwyane and still give up 30-plus. We got a break tonight.\"\n\nThe Pistons came into the game off a 21-point loss to former teammate Greg Monroe and the Milwaukee Bucks. Detroit responded with a 60-point first half against the second-rated defense, hitting 8-of-14 3-pointers while not allowing a point off their three turnovers.\n\n\"We were upset about what happened in Milwaukee, and we had something to prove tonight,\" Jackson said. \"We can't shoot like that every game, but we can play defense and hustle, and we didn't do that in the last game.\"\n\nDrummond had 12 points, 12 rebounds (six offensive) and three blocked shots in the half, while Wade missed four of his five shots.\n\n\"They were amazing in the first half,\" Wade said. \"They didn't give us anything and we gave them everything.\"\n\nDetroit's lead was 17 at the half and quickly grew to 28 midway through the third.\n\nThe only Pistons player who couldn't get going was Caldwell-Pope, who missed his first 11 shots before hitting a corner 3-pointer late in the third quarter.\n\nTIP-INS:\n\nHeat: Luol Deng missed his first game of the season due to an illness. . The Heat came into the game allowing opponents to shot only 29.7 percent on 3-pointers, third best in the NBA, but allowed the Pistons to go 6 of 8 in the second quarter alone.\n\nPistons: PG Spencer Dinwiddie did not play with a sore knee. . Drummond only played briefly in the fourth quarter, and narrowly missed his fourth 20-point, 20-rebound game of the season. He's the only player to have one in the NBA this season, and would have tied Bill Laimbeer for the most by a Piston in a season in the last 30 years. . Dwight Howard has recorded the only other 20-rebound game in the NBA this season.\n\nUP NEXT\n\nHeat: Visit New York on Friday.\n\nPistons: Visit Oklahoma City on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994949.447239
}