{
  "game_id": "401809973",
  "espn_id": "401809973",
  "date": "Oct 27, 2025",
  "matchup": "SA vs TOR",
  "headline": "Victor Wembanyama and the Spurs move to 4-0 with a 121-103 win over the Raptors",
  "body": "SAN ANTONIO -- — Victor Wembanyama had 24 points and 15 rebounds, and the San Antonio Spurs defeated the Toronto Raptors 121-103 on Monday night to match the best start in franchise history.\n\n\r\n              San Antonio has opened a season 4-0 on four occasions, most recently in 2017, but the Spurs have never won their first five games.\n\n\r\n              Stephon Castle added 22 points and Harrison Barnes had 18 for San Antonio, which did not win its fourth game until Nov. 7 last season.\n\n\r\n              Toronto lost its third straight after winning its season opener.\n\n\r\n              R.J. Barrett had 25 points, Collin Murray-Boyles added 19 and Immanuel Quickley had 15 for the Raptors.\n\n\r\n              Wembanyama, who was named Western Conference player of the week earlier Monday, continued to dazzle spectators. He drove to the rim past Jakob Poeltl, made a 360-degree spin to avoid a charging Scottie Barnes and put the ball off the glass for a layup in the first half.\n\n\r\n              Wembanyama finished 7 of 8 from the field and was 10 for 10 on free throws. \n\n\r\n              Barrett scored 10 points in the third quarter after protesting that he was fouled by Julian Champagnie on a blocked layup attempt in the opening minute of the second half. \n\n\r\n              Barrett’s dunk off a steal in the fourth quarter cut San Antonio’s lead to 101-93 with 7:55 remaining, but Toronto couldn't get closer.\n\n\r\n              Wembanyama blocked Barrett’s layup with 3:59 remaining for his 89th straight game with at least one blocked shot, breaking a tie with Patrick Ewing for the fourth-longest in league history. Ewing holds the record with 145 straight games with a block, followed by Atlanta’s Dikembe Mutombo (116) and Utah’s Mark Eaton (94).\n\n\r\n              San Antonio had six players score in double figures and won its fourth straight against Toronto.\n\n\r\n              Dylan Harper had 11 points to join Wembanyama, David Robinson and Willie Anderson as the only rookies in Spurs history to score in double figures in their first four games.\n\n\r\n              Up next\r\n              Raptors: Host Houston on Wednesday.\n\n\r\n              Spurs: Host Miami on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042513.149256
}