{
  "game_id": "0022300027",
  "espn_id": "401584115",
  "date": "Nov 17, 2023",
  "matchup": "CHA vs. MIL",
  "headline": "Lillard scores 27, leads 3-point barrage as Bucks beat Hornets to remain unbeaten in tourney play",
  "body": "CHARLOTTE, N.C. -- — Damian Lillard scored 27 points, Malik Beasley added 20 and the Milwaukee Bucks overcame a 37-point effort from LaMelo Ball to beat the Charlotte Hornets 130-99 on Friday night and remain unbeaten in NBA In-Season Tournament play.\n\n\r\n              Giannis Antetokounmpo had 16 points, nine assists and eight rebounds for the Bucks, who’ve won three straight. Beasley had six 3s and Lillard five as the Bucks went 22 of 45 from beyond the arc and outscored the Hornets 38-18 in the fourth quarter.\n\n\r\n              “I loved how we shared the ball and moved the ball and were looking for each other,” Bucks coach Adrian Griffin said. “That is what we have been stressing the last week or so, and it's a fun way to play. Giannis really spearheaded that and was spreading it around and we were getting open shots.”\n\n\r\n              Milwaukee’s victory sets up a showdown on Nov. 28 in Miami against the Heat, the only other undefeated team in East Group B in what might determine who’ll advance to the single-elimination knockout stage.\n\n\r\n              Both teams are 2-0 in tournament play.\n\n\r\n              Griffin said he left his starters in the game in the fourth quarter with a big lead to help the Bucks' point differential numbers in the tournament, which will go toward determining the one wild card team in each conference.\n\n\r\n              Lillard followed up a 37-point game against Toronto with another strong performance.\n\n\r\n              He believes that is partly because he's been allowed to play the entire first quarter in each of the last two games — something he routinely did with the Portland Trail Blazers. Lillard said he approached Griffin about the idea earlier in the week, and he agreed to try it.\n\n\r\n              “I think that has been real helpful the last couple of games because it gives me more time to see the coverages and see what's happening and be able to assert myself,” Lillard said. “I'm able to have more impact on the direction of the game and also get myself going a little bit better that way.”\n\n\r\n              Charlotte’s Miles Bridges looked strong in his first NBA action in 583 days, scoring 17 points on 6-of-13 shooting in 33 minutes. Bridges missed all of last season and served a 10-game suspension to start this year for his role in a domestic violence incident in 2022.\n\n\r\n              Bridges received an ovation when he checked into the game in the first quarter and an even louder cheer when he sank his first pullup jumper, helping the Hornets build a 13-point first half lead.\n\n\r\n              “I miss these fans and I didn't know what to expect,” Bridges said. “And they miss me. So I was happy to go out and there and be able to play.”\n\n\r\n              The Bucks began to pull away in the third quarter behind a driving one-handed dunk by Lillard and a corner 3 from Beasley off a feed from Antetokounmpo. A few minutes later Lillard hit a 3 and Pat Connaughton drilled a 3 from corner and the lead was at 14.\n\n\r\n              The Hornets cut the lead to six early in the fourth on a Bridges' and-one, but the Bucks erupted from there with a 17-2 run and steadily built a 33-point lead behind a barrage of 3s.\n\n\r\n              COVER THAT UP\n\n\r\n              Ball came within a point of matching his career high.\n\n\r\n              He did so wearing a blue bandage to cover up an \"LF” tattoo just below his left ear. The tattoo violates NBA rules against exposing commercial logos on players’ bodies. The \"LF\" initials are short for LaFrance, which is the point guard's middle name and his new clothing brand.\n\n\r\n              After the game Ball referred all questions to his management team.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the Dallas Mavericks on Saturday night.\n\n\r\n              Hornets: Host the New York Knicks on Saturday night as part of a five-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995663.879188
}