{
  "game_id": "0022400723",
  "espn_id": "401705289",
  "date": "Feb 05, 2025",
  "matchup": "CHI @ MIN",
  "headline": "Edwards scores 49 to lead Wolves over short-handed Bulls 127-108",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 49 points, including 20 in the third quarter, as the Minnesota Timberwolves beat the short-handed Chicago Bulls 127-108 on Wednesday night.\n\n\r\n              Edwards hit six 3-pointers and was 17 of 18 from the free-throw line and also added nine rebounds. He tied Kevin Garnett for the second-most 30-point games and tied Karl-Anthony Towns for the most 40-point games in team history.\n\n\r\n              Naz Reid had 22 points and 10 rebounds, and Rudy Gobert added 10 points and 15 rebounds.\n\n\r\n              Coby White had 20 points, and Nikola Vucevic had 10 points and 11 rebounds for Chicago, which was without center Zach Collins, swingman Kevin Huerter and guard Tre Jones after the weekend trade that sent Zach LaVine to Sacramento and Kings guard De’Aaron Fox to San Antonio.\n\n\r\n              The Bulls were also without point guard Lonzo Ball (left knee injury management) on the second game of a back-to-back after beating Miami on Tuesday night.\n\n\r\n              Takeaways\r\n              Bulls: Chicago battled back on the second night of a back-to-back after Minnesota started the game on a 22-4 run and led by 21 midway through the first quarter.\n\n\r\n              Timberwolves: It wasn’t easy against another undermanned team, but the Wolves needed a victory. They had lost two in a row to Washington and Sacramento (without Fox).\n\n\r\n              Key moment\r\n              After the Bulls had taken an 82-79 lead with 4:08 in the third, Edwards went to work. Following a Minnesota timeout, he hit a 3-pointer before blocking a 3 on the other end. Edwards then missed a 3 on the offensive end but got an offensive rebound and putback, while being fouled. He hit the free throw to put the Wolves up 3 and they never trailed again.\n\n\r\n              Key stat\r\n              Minnesota was 9 of 16 on 3s in the first quarter, the team’s season high for any quarter this season.\n\n\r\n              UP NEXT\r\n              Bulls: Host Golden State on Saturday.\n\n\r\n              Timberwolves: Host Houston on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764997056.9314141
}