{
  "game_id": "0021600892",
  "espn_id": "400900298",
  "date": "Feb 28, 2017",
  "matchup": "MEM vs. PHX",
  "headline": "Conley, Gasol lead Grizzlies past Suns, 130-112",
  "body": "MEMPHIS, Tenn. --  Marc Gasol has become a weapon from outside the arc, and it has made the Memphis Grizzlies much more potent.\n\nGasol converted all five of his shots from 3-point range Tuesday night en route to 28 points, Mike Conley added 29 and the Grizzlies recorded a season high in points, defeating the Phoenix Suns 130-112.\n\n\"Sometimes you make them, sometimes you miss them,\" Gasol said. \"I got lucky tonight and made them, so that's good.\"\n\nZach Randolph finished with 23 points as Memphis shot 56 percent, including 12 of 25 from outside the arc. Conley was 10 of 19 from the field. Gasol shot 10 of 16 and Randolph was 10 of 15 as the Grizzlies recorded a season-best percentage from the field.\n\n\"They were hitting shots,\" said Suns center Alex Len, who scored 12 points. \"Marc was hitting tough 3s. .This year he has changed his game a lot.\"\n\nEric Bledsoe had 20 points for the Suns, while T.J. Warren finished with 17. Devin Booker, the Suns' second-leading scorer at 21.1 points a game, was limited to nine points on 3 of 11 from the floor as Phoenix lost its third straight and 13th in the last 16.\n\nMemphis got 11 points from Gasol in the third to grab the first double-digit lead of the game late in the quarter before carrying a 93-85 lead into the fourth.\n\nThe Grizzlies broke the game open with the first seven points of the final period, eventually extending the lead to 19 points on Conley's 3-pointer near the midway point.\n\n\"I thought we really competed defensively,\" Memphis coach David Fizdale said. \"We put together a little string of stops, and that allowed us to get out and go a little bit.\"\n\nTIP-INS\n\nSuns: Bledsoe has reached double figures in 46 straight games, dating to Nov. 19. ... The Suns have lost four straight in the series and are 2-12 their last 14 meetings with Memphis. ... It was the first time Booker did not reach double figures since scoring eight points against the San Antonio Spurs on Dec. 28.\n\nGrizzlies: Memphis made 12 3-pointers, marking the 29th time this season the Grizzlies have made at least 10 shots from outside the arc. ... Memphis scored 38 points in the third quarter, matching the most points in a quarter this season. ... Memphis' previous high for points this season was 128 against Golden State on Jan. 6.\n\nNO CHANGE RIGHT NOW\n\nSome have wondered if the Grizzlies would tweak their starting lineup to put slumping forward Chandler Parsons in a different role. Fizdale is not ready tinker with things just yet. \"As we go down the stretch,\" he said, \"I'm going to make sure I look at everything to give us the best chance to win moving forward and going into the playoffs. Nothing is going to happen right now.\" Parsons had four points against the Suns, and in the last five games has scored a total of 19 points.\n\nAND AGAIN\n\nFor the second consecutive game between the teams, there was an altercation, this time between veteran Vince Carter and Booker in the first quarter. Carter flicked an arm out at Booker after a foul was called on the Suns guard, and Booker hit the floor hard. There was an exchange of words and after a review, Carter was assessed a pair of techs, sending him to the locker room. When the teams faced each other Feb. 8, the closing minute included a ruckus stemming from trash talking between Memphis reserve Troy Daniels and Booker. Six players received technicals and three were ejected, including Daniels. Later, Len was given a one-game suspension by the league for leaving the bench area.\n\nFINAL WORD\n\n\"It is what it is, and, fortunately, Vince is very rich and he can afford the fine.\" -- Fizdale, on Carter's ejection.\n\nUP NEXT\n\nSuns: Open a season-high, five-game homestand on Thursday against the Charlotte Hornets.\n\nGrizzlies: Travel to Dallas on Friday to face the Mavericks.",
  "source": "espn_api",
  "crawled_at": 1764995579.271967
}