{
  "game_id": "0022300336",
  "espn_id": "401584964",
  "date": "Dec 16, 2023",
  "matchup": "CLE vs. ATL",
  "headline": "Jarrett Allen has 25 points and 14 rebounds, Cavaliers beat Hawks 127-119",
  "body": "CLEVELAND -- — Jarrett Allen had 25 points and 14 rebounds, Donovan Mitchell added 22 points and a career-high 13 assists, and the Cleveland Cavaliers beat the Atlanta Hawks 127-119 on Saturday night.\n\n\r\n              The Cavaliers built a 23-point lead in the first half of their first game since announcing that starting power forward Evan Mobley and former All-Star point guard Darius Garland will likely be out until February. Cleveland snapped a three-game losing streak.\n\n\r\n              “I knew that our team could do it because we have the next-man up mentality,” Allen said. “It was different with Donovan at point guard. He definitely facilitated tonight, and I think he took pride in it.”\n\n\r\n              Mobley, who is averaging 16.0 points and 10.5 rebounds, will undergo arthroscopic surgery Monday on his left knee. Garland is slated to have a procedure to repair his jaw, which was broken Thursday in a collision with Boston’s Kristaps Porzingis.\n\n\r\n              “We’ve got to do it as a group,” Mitchell said. “We lost two of our dogs. This run we’re about to go on, it’s for them. We’re doing it together as a group.”\n\n\r\n              Allen had the highest-scoring quarter of his career with 17 points in the first — making eight field goals without a miss — and took advantage of the absence of Hawks center Clint Capela, who sat out his first game of the season with left knee soreness.\n\n\r\n              Isaac Okoro scored 18 points and Dean Wade had 16 points as both moved into the starting lineup for the Cavaliers, who scored a season-high 41 points in the first quarter. Caris LeVert added 14 points off the bench.\n\n\r\n              “Donovan got his teammates involved early and we’re going to need that,” Cleveland coach J.B. Bickerstaff said. “He’s going to have to pick his spots, but he’s an elite scorer for a reason.”\n\n\r\n              Trae Young had 35 points and 10 assists for Atlanta, which has dropped six of seven. Dejounte Murray scored 21 points and De’Andre Hunter had 18 points in his return from a three-game absence with right knee discomfort.\n\n\r\n              The Hawks got as close as 96-90 early in the fourth on a Young 3-pointer, but Mitchell made consecutive 3s to push Cleveland’s advantage to 107-94.\n\n\r\n              “We dug ourselves too much of a hole,” Young said. “It’s more about effort and energy, and sometimes about giving a crap. That’s what got us back in the game. You can't win in this league only playing one quarter or three (well), you have to do all four.\"\n\n\r\n              Atlanta small forward Bogdan Bogdanovic, who sprained his right ankle Friday night in a 125-104 win in Toronto, did not play for the first time this season.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Detroit on Monday night.\n\n\r\n              Cavaliers: Host Houston on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996734.9757671
}