{
  "game_id": "0022200933",
  "espn_id": "401469088",
  "date": "Mar 01, 2023",
  "matchup": "PHX @ CHA",
  "headline": "Kevin Durant scores 23 points in Charlotte in Suns debut",
  "body": "CHARLOTTE, N.C. -- — Kevin Durant feels a sense of comfort.\n\n\r\n              Durant scored 23 points on 10-of-15 shooting in his Suns debut, helping Phoenix snap the Charlotte Hornets’ five-game winning streak with a wire-to-wire 105-91 victory Wednesday night.\n\n\r\n              Devin Booker scored 37 points and Deandre Ayton had 16 points and 16 rebounds in the Suns' seventh victory in 10 games. Chris Paul added 11 assists.\n\n\r\n              Durant, acquired in blockbuster trade with the Brooklyn Nets on Feb. 9, showed no lingering effects from a sprained right knee that kept him out of action for more than seven weeks. And the 34-year-old star fit in rather seamlessly with his new club, also grabbing six rebounds and blocking two shots in 27 minutes.\n\n\r\n              “I feel like I fit in pretty well,” Durant said. “Everybody out there was trying to make me as comfortable as possible. I just have to keep riding it, man.”\n\n\r\n              Durant made two 3s, a flurry of mid-range jumpers and showed he still has the burst to get to the hole on a driving left-handed layup for his first basket with the Suns. He also provided a boost on defense, blocking Hornets rookie center Mark Williams twice in the opening five minutes.\n\n\r\n              Suns coach Monty Williams said he doesn't want Durant worrying about being a team leader, but rather just playing.\n\n\r\n              “I think there’s too many players in the NBA that get too much pressure to lead,” Williams said. “I just don’t think it’s necessary. It’s my job to lead. The players do it in spots, but that’s the one thing I told him, I said, ‘I’m not looking for you to lead. We just want you to be yourself and hoop,’ and I think that’s where he’s the most free to be himself.”\n\n\r\n              Phoenix (34-29) entered the game in fourth place in the Western Conference standings, but could be poised for a strong finish with Durant anchoring what has the potential to be an explosive offense.\n\n\r\n              The Hornets played without LaMelo Ball, who underwent season-ending surgery on Wednesday to repair a fracture in his right ankle. Kelly Oubre Jr. picked up the scoring slack with 26 points for Charlotte (20-44), while Terry Rozier added 20 points.\n\n\r\n              “We’ve been together since training camp, but it’s obviously tough when key players are out and in-and-out of the lineup all season with guys missing six weeks and coming back,” Rozier said. \"So, things might be a little off but we fight another day. Just keep fighting.”\n\n\r\n              Durant scored 12 points in the first half as Phoenix opened a 57-41 lead.\n\n\r\n              Charlotte cut Phoenix's lead to six entering the fourth quarter behind former Sun Oubre, who got the start with Ball out. \n\n\r\n              But Durant, who had only played 19 minutes in the first three quarters, returned to the start the fourth quarter and began to take over.\n\n\r\n              He hit a 17-footer off a ball fake, drawing a foul to set up a three-point play. The 15-year seemed to find his groove from there, knocking down three more mid-range jumpers to push the lead to 12 and finished with nine points in the fourth quarter.\n\n\r\n              BALL'S SEASON OVER\n\n\r\n              The Hornets announced Wednesday night that Ball had surgery to repair a fracture in his right ankle and will miss the remainder of the season. \n\n\r\n              The third-year point guard was injured in Charlotte’s victory Monday night over the Detroit Pistons. The 21-year-old Ball was limited to 36 games this season. He sprained his left ankle three times earlier this season, costing him 27 games.\n\n\r\n              TIP INS\n\n\r\n              Suns: There were plenty of questions over who'd be the team's fifth starter, with Williams going with Josh Okogie alongside Durant, Ayton, Booker and Paul.\n\n\r\n              Hornets: P.J. Washington missed his third straight game with knee soreness. ... Oubre returned to the starting lineup in Ball's absense.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Chicago on Friday night.\n\n\r\n              Hornets: Close out a four-game homestand against Orlando on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995067.7846231
}