{
  "game_id": "0021900298",
  "espn_id": "401160940",
  "date": "Dec 02, 2019",
  "matchup": "CHI @ SAC",
  "headline": "Bulls nearly blow big lead, hold off Kings 113-106",
  "body": "SACRAMENTO, Calif. --  Zach LaVine kept getting to the free throw line down the stretch, Lauri Markkanen rediscovered his shooting stroke and the Chicago Bulls finally figured out a way to close one out.\n\nLaVine scored 28 points and made four free throws in the final 11 seconds, and the Bulls overcame a sloppy fourth quarter to hold off the Sacramento Kings 113-106 on Monday night.\n\nMarkkanen had 20 points and seven rebounds, Wendell Carter Jr. added 10 points and 10 rebounds, and Tomas Satoransky scored 14 points as Chicago snapped a three-game losing streak.\n\n\"We made the plays we had to make,\" Bulls coach Jim Boylen said. \"We fought back from being down, we got a lead then we lost it, then we fought back again.\"\n\nThe Bulls (7-14) led by 19 early in the second half but had trouble hanging on. Chicago committed eight of its 18 turnovers in the fourth quarter and made only one basket over the final 4 1/2 minutes.\n\nBuddy Hield hit a step-back jumper that pulled the Kings to 102-100 with 2:18 remaining. After Markkanen made two free throws, he and Hield exchanged 3-pointers to make it 107-103.\n\nSacramento got the ball back but Hield missed three shots from beyond the arc in the last 36 seconds, and LaVine sealed the game at the free throw line.\n\n\"We're supposed to do things like that,\" LaVine said. \"I think we've been underperforming up to this point. We should be playing like this. We should be getting these wins and holding teams off, but we haven't. We have to prove it not just to the general public and other teams, but to ourselves.\"\n\nGetting Markkanen going was a key factor for Chicago. He had been held to nine points or fewer in four of the last seven games and went into this one averaging 13.3 points. Against the Kings, he shot 6 of 12 and made four 3s.\n\nIt's the first time this season Markkanen and LaVine have scored 20 or more in the same game.\n\n\"I've been trying to find my spots and it's been a lot of 3s, so I'm glad I got to the rim a couple times,\" Markkanen said.\n\nHield finished with 26 points for Sacramento. Richaun Holmes added 20 points and nine rebounds.\n\n\"We took them lightly. We didn't respect them enough,\" Hield said. \"We were up by 11 and we got too cool. When you give a team confidence, they come back to bite you quick.\"\n\nThe Bulls took control with a 21-6 run to start the second quarter. After Carter, Kris Dunn and Markkanen scored on consecutive dunks, Markkanen added a 3-pointer -- Chicago's fifth of the period -- and Lavine made a reverse layup to extend the lead to 54-39.\n\nSacramento trailed by 19 early in the third quarter, then went on a late run to pull to 84-74 after a pair of free throws from Harrison Barnes.\n\nTIP-INS\n\nBulls: Chicago had nine steals, giving the Bulls 204 in 21 games this season. They became the fastest Eastern Conference team to reach 200 since Boston did it in 18 games in 2015-16. . Eight players scored in the first quarter.\n\nKings: Trevor Ariza went scoreless in 12 minutes after missing the previous six games for personal reasons. . Sacramento had won its last four against Chicago.\n\nQUOTABLE\n\n\"Once he made his first two, he started looking like back to old Lauri. Hopefully, it's wheels up from there.\" -- LaVine on Markkanen.\n\nUP NEXT\n\nBulls: Host the Memphis Grizzlies on Wednesday.\n\nKings: Begin a four-game road trip Wednesday at Portland. The teams split two games in Sacramento earlier this season.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996359.384372
}