{
  "game_id": "0021601187",
  "espn_id": "400900565",
  "date": "Apr 07, 2017",
  "matchup": "LAL vs. SAC",
  "headline": "Randle, Brewer help Lakers edge Kings 98-94",
  "body": "LOS ANGELES --  Maybe you can't win for losing, but the Los Angeles Lakers may find you can lose by winning.\n\nThe Lakers have picked an odd time to suddenly start playing their best basketball since the start of the season, beating the Sacramento Kings 98-94 Friday night for their third consecutive victory.\n\nWhile some scream for them to tank at the season's end to finish behind the Phoenix Suns for the second-worst record in the NBA and improved odds in the lottery, the young Lakers (24-55) are instead seemingly learning how to win close games.\n\n\"We don't believe in (tanking),\" said forward Julius Randle. \"The basketball gods would come back to haunt us.\"\n\nRandle led the Lakers with 25 points, consistently driving aggressively to the basket. His motivation wasn't hurt by having his old college basketball coach, Kentucky's John Calipari, at the game.\n\nBut the biggest play of the night was turned in on the defensive end by forward Corey Brewer.\n\nThe Lakers were leading 94-92 with 5 seconds left when guard Buddy Hield tried to inbound the ball. Brewer was guarding the inbound pass. Hield lazily tried to throw the ball over Brewer, standing just a couple feet in front of him, and Brewer simply jumped up and snagged the ball.\n\nHe was fouled and made both free throws.\n\n\"I have to do a better job inbounding the ball,\" Hield said. \"I have to use my deception better.\"\n\nThe Kings had five players score in double figures, but it wasn't enough to overcome 23 turnovers.\n\nSkal Labissiere led Sacramento with 19 points, while Hield had 17. Darren Collison added 15 points and 10 assists, Willie Cauley-Stein scored 14 points and Georgios Papagiannis had 10 points and 10 rebounds off the bench.\n\nBrandon Ingram joined Randle in double figures for the Lakers with 14 points, while D'Angelo Russell had 13 points and Jordan Clarkson 12.\n\nTIP-INS\n\nKings: Sacramento is apparently unconcerned with how its play will impact its own lottery chances. The Kings entered Friday having won four of their last six and tied with the Timberwolves for seventh-worst record in the league. Said Kings coach Dave Joerger: \"There's no tanking here.\"\n\nLakers: Had won only 22 games all season, but Wednesday surprised the Spurs in San Antonio with a 102-95 win. Said Lakers coach Luke Walton: \"It's sports. It's odd (but) we beat the Golden State Warriors by 20 earlier this season.\"\n\nBLOCKING OUT\n\nThe Kings outrebounded the Lakers 15-6 in the first quarter but were outrebounded the rest of the way 36-25 (14-5 offensive boards). Said Joerger: \"They threw us around in the paint and got 16 offensive rebounds. . We have to do a better job of protecting the rim.\"\n\nKIDS LEARNING\n\nThe Lakers have struggled to finish close games all season, but particularly after trading leading score Lou Williams to Houston on Feb. 21. Their three consecutive victories, however, have been by 4, 7 and 5 points. Said Walton: \"They seem to be more comfortable. I hope it's from the opportunity they've had and not because it's the end of the season and there really isn't any pressure on us.\"\n\nUP NEXT\n\nKings: Will have their improved play of late tested Sunday when they host the Rockets. Houston has won 11 of the last 12 against the Kings, including all three this season.\n\nLakers: Host the Timberwolves Sunday, a team that beat them by 15 points a week ago in Minnesota. Timberwolves have gone 8-6 against the Lakers after a 22-game skid.",
  "source": "espn_api",
  "crawled_at": 1764995352.151225
}