{
  "game_id": "0022400921",
  "espn_id": "401705487",
  "date": "Mar 09, 2025",
  "matchup": "DAL vs. PHX",
  "headline": "Booker and Durant help Suns hold off injury-depleted Mavs 125-116",
  "body": "DALLAS -- — Devin Booker scored 24 points, Kevin Durant had 21 points, nine rebounds and eight assists and the Phoenix Suns beat the injury-depleted Dallas Mavericks 125-116 on Sunday.\n\n\r\n              Bradley Beal scored 19 points and Grayson Allen added 17 as the Suns pulled within 1 1/2 games of Dallas for the 10th seed in the Western Conference, the final spot in the play-in tournament.\n\n\r\n              Naji Marshall had a career high for the second consecutive game with 34 points for the Mavericks, the defending West champs who were down to seven healthy players by the end of the game.\n\n\r\n              Dallas big men Kessler Edwards and Dwight Powell went to the locker room after their heads collided chasing a loose ball late in the third quarter. Guard Brandon Williams was later ruled out with left hamstring tightness. \n\n\r\n              Edwards returned with a bandage over his left eye, but Powell didn't come back after walking to the bench with a bleeding forehead, getting treated briefly and leaving the court. \n\n\r\n              Takeaways\r\n              Suns: Rim protection is a big issue for the vertically challenged Mavs. And Mason Plumlee had three consecutive dunks in the first half, then back-to-back alley-oop slams after the break. The 6-foot-10 Plumlee finished with 13 points.\n\n\r\n              Mavericks: Dallas matched its longest losing streak of the season at five games and dropped below .500 for the first time since mid-November. The Mavs have lost all three games since star guard Kyrie Irving’s season-ending knee injury.\n\n\r\n              Key moment\r\n              Booker hit a jumper that started a 19-2 run for Phoenix bridging the first and second quarters that put the Suns in front for good. Phoenix turned a 22-18 deficit into a 37-34 lead.\n\n\r\n              Key stat\r\n              The Suns shot 58% from the field.\n\n\r\n              Up next\r\n              Both teams finish a back-to-back Monday. The Suns visit Memphis, and the Mavericks play the first of consecutive games in San Antonio. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997146.3935459
}