{
  "game_id": "0021800495",
  "espn_id": "401071176",
  "date": "Dec 23, 2018",
  "matchup": "POR vs. DAL",
  "headline": "Lillard scores 33, Trail Blazers top Mavericks 121-118 in OT",
  "body": "PORTLAND, Ore. --  A buzzer-beating 3-pointer by Dallas rookie sensation Luka Doncic to send the game into overtime could have rattled the Portland Trail Blazers.\n\nInstead, they made the most of the additional five minutes.\n\n\"I mean, people make shots. It's the NBA,\" Jusuf Nurkic said about Doncic's big 3. \"You can't get down (because of) one shot.\"\n\nPortland recovered in overtime to hand the Mavericks their sixth straight loss, 121-118 on Sunday night.\n\nDamian Lillard had 33 points and Nurkic added 10 points and 12 rebounds for his 16th double-double this season to help the Blazers win for the fourth time in five games.\n\nHarrison Barnes led the slumping Mavericks with 27 points. Doncic had 23 points and 11 rebounds, including a corner 3 at the buzzer that tied it at 107.\n\nMaurice Harkless' layup gave Portland a 114-109 lead with 2:43 to go in the extra period. DeAndre Jordan's dunk pulled the Mavs to 116-115 with under a minute left, but Lillard's layup kept Portland in front with 34.2 seconds to go and the Blazers held on despite a flurry of 3-point attempts by Dallas.\n\n\"It was a wild finish,\" Blazers coach Terry Stotts said. \"Doncic hit an outstanding shot. We didn't defend it well, but it was an amazing shot. I'm glad the way we regrouped and kind of maintained the lead throughout overtime.\"\n\nPortland led by 14 in the third quarter but the Mavericks closed the gap in the fourth.\n\nBarnes and Wesley Matthews made consecutive 3s to bring Dallas to 100-98 with 3:56 left. Matthews, a former Blazer, added another 3 to put Dallas up 101-100.\n\nAfter Doncic's free throw, Harkless hit a 3-pointer to put Portland back in front 103-102 with 1:42 to go. The teams traded baskets before Lillard's layup made it a three-point game.\n\nAs time expired, Doncic connected over Harkless' outstretched arms.\n\n\"The guy has an uncanny knack for making shots like that,\" Mavericks coach Rick Carlisle said. \"I can't say I was surprised when it went in. I've seen him do things like that too many times.\"\n\nDoncic sounded kind of surprised, though: \"I mean, it just went in. It was a tough shot,\" he said.\n\nIt was the fourth game of a road trip and the second half of a back-to-back for Dallas. The Mavericks lost to the Golden State Warriors 120-116 on Saturday night.\n\nDoncic, the NBA's leading rookie scorer, was questionable with a right hip injury but he started.\n\nHe had an immediate impact with seven early points, including a tip that gave the Mavericks a 17-12 lead midway through the first quarter. Evan Turner's basket tied it at 23 as the quarter came to a close.\n\nThe Blazers went on a 16-2 run to pull in front 58-47 and led 62-52 at halftime. Portland scored 37 points in the second quarter.\n\n\"A loss is a loss but these ones are tough because we battled so much. We just came up short,\" Barnes said. \"We've got to find a way to pull it through.\"\n\nThe Mavs played without Dennis Smith Jr., who has a strained right wrist. They also were without Dirk Nowitzki, limited after returning from left ankle surgery that kept him out of the team's first 26 games. Nowitzki, who has appeared in five games, played 13 minutes against the Warriors and scored three points.\n\nThe Blazers were coming of a 120-90 loss on Friday night to Utah, their worst defeat at home in nearly 14 years. It snapped a three-game winning streak.\n\nTIP-INS\n\nMavericks: Dallas beat the Blazers 111-102 at home on Dec. 4. This was the second of four meetings between the teams this season.\n\nTrail Blazers: With a 3-pointer in the first half, CJ McCollum moved past Damon Stoudamire (717) into fifth on the Blazers' career list for 3s. ... Portland's second-quarter points (37) were the most the team had scored in the period this season.\n\nUP THE CHARTS\n\nStotts got his 291st win with the Blazers, tying Rick Adelman for second on the franchise list. Jack Ramsay won 453 games as Portland's coach.\n\nUP NEXT\n\nMavericks: Return home to face New Orleans on Wednesday.\n\nTrail Blazers: On the road on Christmas Day against the Utah Jazz.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995181.540305
}