{
  "game_id": "0022300742",
  "espn_id": "401585370",
  "date": "Feb 09, 2024",
  "matchup": "ATL @ PHI",
  "headline": "Trae Young scores 37 as Hawks end 2-game skid with 127-121 win over short-handed 76ers",
  "body": "PHILADELPHIA -- — Trae Young scored 37 points and hit several key shots in the fourth quarter as the Atlanta Hawks held on to beat the short-handed Philadelphia 76ers 127-121 on Friday night.\n\n\r\n              Onyeke Okongwu added 21 points and Saddiq Bey had 16 points and 11 rebounds as Atlanta snapped a two-game skid.\n\n\r\n              “This isn't the easiest place to play, so coming in here getting a win at any time is a good thing for us,” Young said. “We had some guys out, so we needed other guys to step up and they did.”\n\n\r\n              Kelly Oubre Jr. scored 28 points and Tobias Harris had 21 for Philadelphia, which has lost eight of its last nine games in a stretch in which the 76ers lost reigning NBA MVP Joel Embiid to a meniscus tear. The makeshift lineup on the floor — a result of injuries, illness and new arrivals just into the Sixers complex — created a defensive nightmare that allowed the Hawks to score 73 points in the first half and build a 17-point halftime lead. \n\n\r\n              “I told our team that if we ran back (on defense) in the first half like we did in the second, we could have shaved that halftime lead in half,” Philadelphia coach Nick Nurse said. “We had a tough time picking up who we were supposed to be guarding.”\n\n\r\n              In addition to Embiid, the Sixers were without All-Star guard Tyrese Maxey (illness), starting forward Nic Batum (left hamstring strain), guard De’Anthony Melton (lumbar spine stress relief) and guard Robert Covington (left knee bone bruise) against the Hawks.\n\n\r\n              Buddy Hield and Cam Payne, acquired before the trade deadline on Thursday, each scored 20 points in their Philadelphia debut. \n\n\r\n              “It looked like they competed,\" Nurse said. “I liked their overall feel for the game and it looked like they understood the basketball IQ on the offensive end. Pretty good first night out, considering.”\n\n\r\n              Atlanta used its 3-point shooting to build a big lead, going 16 for 31 from beyond the arc in the first three quarters for a seemingly safe 22-point lead.\n\n\r\n              Philadelphia cut its deficit to six on multiple occasions and four in the game's waning moments thanks in large part to denying Atlanta's shots at the 3-point line (0 for 5) and Oubre getting to the foul line for 14 points in the final quarter. But, every time it appeared the Sixers were ready to make Atlanta sweat, Young repeatedly countered with drives down the lane, capitalizing on Embiid's absence and getting to the rim and the foul line. Young had 13 points in the final quarter\n\n\r\n              “He made a couple of plays for us that were terrific and we need that from him,” Atlanta head coach Quin Snyder said. \n\n\r\n              In addition to his game-high scoring total, Young finished with 12 assists. It is the 77th time in Young's career that he has had 30 or more points and 10 or more rebounds in the same game, fifth-most in NBA history.\n\n\r\n              “I've always felt comfortable with a lot (of weight on my shoulders),” Young said. “But I know I had seven turnovers and that's too much. But I know that I need to do more for my team and I can do a lot for my team, so I try to do that.”\n\n\r\n              Before the game, 76ers team president Daryl Morey expressed optimism that Embiid would return from his knee injury in time for a possible postseason run.\n\n\r\n              “We’re hopeful,” Morey said three days after Embiid underwent surgery on his left knee. “Feedback has been more good than bad since we first heard about what led to his procedure. So, we’re hopeful and we’re building the team to make it better this year. Obviously, it’s not at 100 percent. But with Joel playing at an MVP level, hopefully, he could get back to that. And this is a year that we have a real shot.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host the Houston Rockets on Saturday.\n\n\r\n              76ers: At the Washington Wizards on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996282.5283399
}