{
  "game_id": "0021500250",
  "espn_id": "400828137",
  "date": "Nov 29, 2015",
  "matchup": "TOR vs. PHX",
  "headline": "Eric Bledsoe powers Suns past Raptors, 107-102",
  "body": "TORONTO --  Eric Bledsoe wasted little time atoning for a missed free throw with just 12.3 seconds to go.\n\nAfter sinking his second shot to push the Suns' lead to three, he hustled to block Luis Scola's 3-point attempt that would have tied the game, and grabbed the resulting rebound.\n\nBledsoe then coolly sank the free throws after being fouled by Kyle Lowry to ice away a 107-102 win over the Toronto Raptors on Sunday night to snap Phoenix's four-game losing streak.\n\n\"I definitely wanted to get the ball back, not just because I missed the free throw but I also didn't want to gamble,\" Bledsoe said. \"I just wanted to stay solid and when the play came our way, I made it.\"\n\nBledsoe finished with 20 points and 11 assists for his third double-double, but it was the Suns' improved defense and timely offensive support off the bench that pleased coach Jeff Hornacek the most -- particularly the Suns gave up season highs in points, field-goal percentage and 3-point percentage in a 135-111 loss Friday to the defending NBA champion Golden State Warriors.\n\n\"The last four games we've been giving up a lot of points,\" he said. \". I thought our defensive effort was a lot better tonight. We didn't turn the ball over and when you're on the road you can't turn the ball over.\"\n\nThe depth off the bench also allowed the Suns to kick their season-high, six-game road trip off on a winning note. The Phoenix reserves combined for 51 points while shooting 56 percent from the field, highlighted by T.J. Warren's first career double-double with 15 points and a career-high 11 rebounds, the fourth straight game in which Warren has registered double digits in points.\n\n\"I was just trying to find my spots like I normally do, trying to get into open spots, get myself into a little rhythm and let it carry on throughout the game,\" he said.\n\nMirza Teletovic was 6 of 7 from beyond the arc for 20 points and Jon Leuer added 16.\n\nToronto's four-game winning streak was snapped, a night after a buzzer-beating victory in Washington. The Raptors surrendered 46 points in the paint after allowing just 74 their previous three games combined.\n\n\"We have to stop putting ourselves in a tough predicament by having to fight our way out, when we don't have much time to,\" said DeMar DeRozan. \"We find ourselves in that position a little too much. Once we clean up the little things at both ends, it will be easier for us to close out games.\"\n\nDeRozan tied a Raptors season high with 29 points, the fourth straight game he has scored at least 20.\n\nSTOLEN GOODS\n\nWith a third-quarter steal off Bledsoe, Lowry has registered at least one steal in every game this season. Lowry entered the game ranked first in the NBA in steals per game (2.71).\n\nPOWER ARM\n\nToronto Blue Jays first baseman Chris Colabello showed his arm is in midseason form as a guest at Sunday's game. Colabello autographed mini basketballs during a break in play and launched them into the crowd, even landing one in the luxury boxes at the back of the lower bowl.\n\nROAD WARRIORS\n\nHaving played 12 road games so far this season, tied with Detroit for tops in the NBA, Toronto will now play six of its next seven at the Air Canada Centre, where it has a 4-2 record.\n\nTIP-INS\n\nSuns: Phoenix opened a six-game trip in which it will cover 5,770 miles before returning home to face the Orlando Magic on Dec. 9. ... Bledsoe and Knight are averaging at least 20 points and five assists this season, the only teammates in the league currently to do so. Only four duos in NBA history have kept that up for an entire season, including Michael Jordan and Scottie Pippen in 1991-92, and most recently LeBron James and Kyrie Irving last season. ... Center Tyson Chandler (hamstring) missed his second game of the season.\n\nRaptors: Raptors forward Patterson and Suns guard Bledsoe were two of five players from Kentucky chosen in the first round of the 2010 NBA draft, the first time one school had had five players picked in the draft's opening round.\n\nUP NEXT\n\nSuns: Visit Brooklyn on Tuesday night.\n\nRaptors: Visit Atlanta on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994757.506138
}