{
  "game_id": "0022200370",
  "espn_id": "401468525",
  "date": "Dec 07, 2022",
  "matchup": "IND @ MIN",
  "headline": "Russell scores 15 points in 4th, Wolves beat Pacers 121-115",
  "body": "MINNEAPOLIS -- — D’Angelo Russell had 15 of his 28 points in the fourth quarter, Anthony Edwards scored 26 points and the Minnesota Timberwolves held on to beat the Indiana Pacers 121-115 on Wednesday night.\n\n\r\n              Rudy Gobert added 16 points and 20 rebounds for Minnesota, which blew a 23-point lead and had to overcome an eight-point deficit. The Timberwolves — who had 23 turnovers — won for just the second time in six games.\n\n\r\n              “We stayed with it,” Gobert said. “We got off to a great start and then we kind of let down a little bit. We gave up a 44-point second quarter, which should never happen again, ever. But we kept grinding, kept grinding, raised the level down the stretch, and made some big plays to get the game.”\n\n\r\n              Buddy Hield scored 26 points and hit 7 of 11 from 3-point territory for Indiana, which has lost four of five and couldn’t follow a victory Monday night in Golden State. Tyrese Haliburton added 26 points and 15 assists for the Pacers.\n\n\r\n              “We’re going to have to keep looking at,” Indiana coach Rick Carlisle said of another slow start. “If we got to do things with the lineup, we will. But when you get down, you set yourself up for comebacks. It’s not a good way to do business in this league.”\n\n\r\n              Jordan McLaughlin tied it at 90 for Minnesota with a buzzer-beating jump shot to end the third quarter. With Russell leading the way, the Timberwolves built their lead back to nine but had to hold off another Indiana comeback.\n\n\r\n              “Just had to work for it,” Russell said. “It’s the NBA.\"\n\n\r\n              Myles Turner, who had 23 points for the Pacers, hit a pair of 3-pointers, including tying the game at 115 with 50.5 seconds left. \n\n\r\n              Gobert was fouled and hit a pair of free throws and then followed with a block of Hield at the rim with nine seconds left. Edwards added two free throws to put the game away.\n\n\r\n              “You know in those type of moments, you’ve got to see the floor better,” Hield said. “Just got to do better in that situation to close those games out. Tough loss.”\n\n\r\n              Two wild swings set up the decisive fourth.\n\n\r\n              Minnesota started the game with a dominant first quarter, leading by 19 as Edwards scored 14 points. The Wolves led 47-24 when Russell hit a 3-pointer with 8:16 left in the second.\n\n\r\n              Hield found his touch from 3 and the Pacers outscored Minnesota 37-16 to end the half. Hield had 13 points in the second quarter and hit five 3s in the first half.\n\n\r\n              Turner provided Indiana its first lead of the game early in the second half and the Pacers started the half on a 14-4 run capped by a Haliburton 3 for a 76-67 lead. From Russell’s 3 and a 23-point lead, Indiana outscored the Wolves 51-20 ending with Haliburton’s 3.\n\n\r\n              The eight-point advantage was the Pacers’ largest of the game.\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Haliburton returned to the lineup after missing two games with a sore left groin. Turner was back after missing a game with a hamstring injury.\n\n\r\n              Timberwolves: Karl-Anthony Towns (right calf strain) missed his third straight game and Taurean Prince (right shoulder subluxation) missed his sixth in a row. … Edwards had a career-high seven steals, the first player in the NBA with at least seven steals in a game this season.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Washington on Friday night.\n\n\r\n              Timberwolves: At Utah on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994330.4612548
}