{
  "game_id": "0022300902",
  "espn_id": "401585530",
  "date": "Mar 07, 2024",
  "matchup": "BKN @ DET",
  "headline": "Ivey, Cunningham lead Pistons to first home win since January, 118-112 over Brooklyn",
  "body": "DETROIT -- — Jaden Ivey scored 34 points and Cade Cunningham had 32 points and 11 assists to lead the Detroit Pistons to their first home win since January, 118-112 over the Brooklyn Nets on Thursday night.\n\n\r\n              Detroit (10-52) had lost nine of 10 and hadn't won a home game since a 120-104 victory over the Oklahoma City Thunder on Jan. 28.\n\n\r\n              “I told the guys, you just have to do enough to win the game,” Pistons coach Monty Williams said. “We had to dig deep, but we made enough plays down the stretch.”\n\n\r\n              Dennis Schroder had a season-high 31 points for Brooklyn, which had won three of four. Lonnie Walker IV scored 21. The Nets allowed 13 offensive rebounds and 23 second-chance points.\n\n\r\n              “The rebounding was the biggest difference tonight,” said Nic Claxton, who finished with 15 points and 10 rebounds. “When we are letting them get that many missed shots, it is a big momentum changer.”\n\n\r\n              The game was tied at 98, but the Pistons went on a 9-0 run in 72 seconds to go up 107-98 with 5:05 to play. Cunningham scored the first six of those points, finishing with a fast-break dunk. After another Brooklyn miss, Cunningham set up Ivey for a 3-pointer.\n\n\r\n              “(Ivey) is getting back to shooting the ball the way we know he can,” Williams said. \"He needs to balance making those shots and getting to the basket, because no one can stop that kid from getting to the basket.\n\n\r\n              “Cade was just Cade.”\n\n\r\n              Brooklyn got as close as five, but Cunningham hit two more jumpers and three free throws. He and Ivey combined for 26 points in the fourth quarter.\n\n\r\n              “We talked about playing fast before the game,” Ivey said. “All the guys shared the ball tonight, but we were looking for each other.”\n\n\r\n              The Nets led by three at halftime and had the advantage for most of the third. However, the Pistons used a late 12-0 run to go ahead 85-81 at the end of the quarter.\n\n\r\n              The Pistons led 11-0 and 26-8 at points in the first quarter, but the Nets followed up a 16-point first with 41 in the second on their way to a 57-54 halftime lead. Brooklyn shot 77.3% (17 for 22) in the second quarter.\n\n\r\n              “We got behind by 18 for the second game in a row,” Nets interim coach Kevin Ollie said. “We had the opportunity to come back in the last game, but we can't keep living in that world. It just puts so much pressure on you to come back.”\n\n\r\n              UP NEXT\n\n\r\n              Nets: At the Charlotte Hornets on Saturday night.\n\n\r\n              Pistons: Host the Dallas Mavericks on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996329.4146402
}