{
  "game_id": "401809983",
  "espn_id": "401809983",
  "date": "Oct 29, 2025",
  "matchup": "BOS vs CLE",
  "headline": "Jaylen Brown scores 30 as Celtics snap Cavaliers' win streak",
  "body": "BOSTON -- — Jaylen Brown scored 30 points, including 13 during a 20-3 run to end the first half that helped the Boston Celtics pull away from Cleveland to win 125-105 on Wednesday night and snap the Cavaliers’ three-game winning streak.\n\n\r\n              Sam Hauser scored 21 points off the bench for Boston, which has won two straight since opening the season with three losses in a row. Josh Minott had 14 rebounds, Neemias Queta had 13 and Payton Pritchard had 10 assists for the Celtics. \n\n\r\n              Evan Mobley scored 19 points with 11 rebounds and Jaylon Tyson also scored 19 for the Cavaliers. Donovan Mitchell made all four 3-point attempts for 12 points in the first quarter, when the Cavaliers led 42-40, but made just one of his last eight shots and finished with 15 points.\n\n\r\n              Boston led by 19 points midway through the third quarter and had a 98-80 advantage in the final two minutes of the third before Cleveland scored the next eight points. The Cavs never got closer than nine points from there, shooting 33% (8 for 24) in the fourth quarter as they failed to chip into Boston's lead.\n\n\r\n              Boston’s only previous win this season was on Monday night, when they beat the winless New Orleans Pelicans.\n\n\r\n              The Cavaliers led by three points early in the second quarter and had a 57-55 lead with four minutes left in the half before Boston ran off 20 of the next 23 points to take a 15-point halftime lead.\n\n\r\n              Brown hit three 3-pointers down the stretch, making a 31-footer with 17 seconds left and then a step-back 26-footer at the buzzer to give the Celtics a 75-60 lead.\n\n\r\n              The teams combined for 18 3-pointers in the first quarter, one shy of the NBA record.\n\n\r\n              The Celtics had 20 assists in the first half.\n\n\r\n              Up next\r\n              Cavaliers: Host Toronto on Friday night for the opener of the in-season tournament.\n\n\r\n              Celtics: Visit Philadelphia on Friday night in the tournament.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042522.621584
}