{
  "game_id": "0021800187",
  "espn_id": "401070868",
  "date": "Nov 11, 2018",
  "matchup": "MIL @ DEN",
  "headline": "Brook Lopez hits record-tying eight 3-pointers as Bucks top Nuggets",
  "body": "DENVER -- Brook Lopez always drew attention in the paint. Now, the Milwaukee Bucks' 7-footer is starting to draw a defensive crowd the moment he crosses the half-court line because of his 3-point shooting.\nLopez made a career-high eight 3-pointers, tying the most in a game by a 7-footer in NBA history, and had 28 points to help the Bucks snap an eight-game skid in Denver, beating the Nuggets 121-114 on Sunday night.\n\"That was an interesting experience,\" Lopez said after the Nuggets began face-guarding him at half court later in the game in a bid to slow down his perimeter shooting. \"I'm just super proud of our team, especially after the Clippers game (a 128-126 overtime loss Saturday on a last-second Los Angeles basket). I think we all feel we let that one get away. To see the way we committed on the defensive end, especially after they made that run to start the fourth. That was so big and I think definitely shows what we're capable of because that's a great team that we just beat.\"\nAccording to ESPN Stats & Information research, Lopez tied the single-game 7-footer mark of the Chicago Bulls' Lauri Markkanen, from January, and of the Dallas Mavericks' Dirk Nowitzki, who did it in 2004.\n\nAll five Bucks starters scored in double figures, and four of them had 20 or more points in Milwaukee's first victory at the Pepsi Center since 2010.\nGiannis Antetokounmpo had 22 points, 9 rebounds and 8 assists. Khris Middleton had 21 points and Malcolm Brogdon added 20.\n\"We do not want to be a good team; We want to be a great team,\" Antetokounmpo said after the Bucks withstood the Nuggets' fourth-quarter comeback bid. \"Great teams, no matter what, come back. You've got to keep fighting and keep playing within your game plan and you hope things work. You hope you can knock down shots. That's what we did.\"\nPaul Millsap led the Nuggets with 25 points and Nikola Jokic added 20. Denver has lost three straight.\nLopez didn't make a single 3-point shot in his first six NBA seasons, but he's become a reliable threat from deep. He's made at least six 3-pointers in three of his past four games and is shooting 38.8 percent from long range this season. He was 8-of-13 from beyond the arc Sunday.\nLopez said Bucks coach Mike Budenholzer and his staff have been telling their players to have faith in their shots and their shooting judgment.\n\"Bud and our entire coaching staff have done a great job instilling that confidence and giving us that belief that when we shoot, it's going to go in,\" Lopez said. \"If you're open and that's your shot, let it fly.\"\nUp by four at the break, the Bucks stretched their lead to 99-88 going into the final quarter after Antetokounmpo connected on an 11-foot step-back jumper with just over a second remaining in the third quarter.\nThe Nuggets chipped away at the deficit and pulled into a 103-all tie on a 3-pointer by Jamal Murray with little more than 8 minutes remaining.\nThe game remained tight until Brogdon connected on a 3-pointer and Middleton hit a jumper around successive Nuggets' turnovers to give the Bucks a 117-112 lead with 41.6 seconds remaining. Millsap answered by driving in for a dunk, but Middleton offset that with a pair of free throws. The Nuggets did not score again.\n\"I think turnovers are tough late to overcome, especially live-ball turnovers,\" the Nuggets' Mason Plumlee said. \"We just have to take care of the ball and get good shots and then make or miss. We can live with the make or a miss.\"\nPlumlee added, \"This is our first little bit of adversity, so we have respond. We have to come out and play really well our next home game.\"\nNuggets coach Mike Malone lamented Denver's lack of defensive intensity for much of the game.\n\"Give [the Bucks] credit. They made shots,\" Malone said. \"We had breakdown after breakdown after breakdown.\"\nMilwaukee scored 30 or more points in each of the first two quarters and led 63-59 at the half.\nTIP-INS\nBucks: D.J. Wilson continues to mend from a right hamstring strain that has kept him on the sideline this season, but he is getting very close to a return. ... Eighteen of Lopez's points came in the third quarter, when he connected on six of his 3-pointers.\nNuggets: Will Barton, who underwent surgery Oct. 23 to repair hip and core muscles, has begun rehab work. There is no set timetable for his return. He was injured Oct. 20 against Phoenix.\nUP NEXT\nBucks: Return home to host the Memphis Grizzlies on Wednesday night.\nNuggets: Continues their three-game homestand by hosting the Houston Rockets on Tuesday night.\nInformation from The Associated Press was used in this report.",
  "source": "espn_api",
  "crawled_at": 1764994525.942265
}