{
  "game_id": "0022201221",
  "espn_id": "401469376",
  "date": "Apr 09, 2023",
  "matchup": "TOR vs. MIL",
  "headline": "Trent Jr. scores 23, Raptors beat Bucks 121-105 in finale",
  "body": "TORONTO -- — Gary Trent Jr. scored 23 points, Precious Achiuwa had 14 points and 13 rebounds and the Toronto Raptors beat the Milwaukee Bucks 121-105 on Sunday in a matchup of short-handed teams whose postseason fates already were sealed.\n\n\r\n              Malachi Flynn added a season-high 20 points for the ninth-seeded Raptors in a tuneup for the play-in tournament. They finished 41-41 for the second time in team history. They also did it in 2007-08.\n\n\r\n              Bobby Portis Jr. scored 16 points, Jae Crowder added 13 and Meyers Leonard had 10 points and 12 rebounds for the Bucks, who clinched the NBA’s best record and the No. 1 seed in the Eastern Conference last Wednesday.\n\n\r\n              Lindell Wiggington scored 17 points, and Goran Dragic and Thanasis Antetokounmpo each had 14 for Milwaukee, which finished the regular season 58-24.\n\n\r\n              Two-time MVP Giannis Antetokounmpo was one of seven players out for the Bucks. He missed his third straight game and Khris Middleton missed his second straight, each because of a sore right knee.\n\n\r\n              Jrue Holiday and Brook Lopez sat due to rest, according to the Bucks’ injury report, while Grayson Allen and Pat Connaughton were out because of right ankle injuries.\n\n\r\n              The Bucks don’t know which of four potential opponents, including Toronto, they’ll host in the first round of the playoffs, but coach Mike Budenholzer said the team will be doing more than scouting during their coming downtime.\n\n\r\n              “I think we’ll probably focus on ourselves, too, to be honest with you,” Budenholzer said. “The appropriate amount of scouting and prep will be put in.”\n\n\r\n              Crowder said he welcomed the opportunity to look inward rather than worry about another team.\n\n\r\n              “I think it’s good for us to fine-tune some things and try to focus on us these next few days,” he said. “Obviously we’re going to be watching these play-in games and seeing whoever the opponent may be, but it’s good for us to fine-tune some things leading up to the playoffs.”\n\n\r\n              Fred VanVleet (left thumb), O.G. Anunovy (right ankle) and Pascal Siakam (rest) all sat for the Raptors.\n\n\r\n              A loss Friday at Boston locked Toronto into the ninth seed in the East, setting up a must-win home game Wednesday night against former Raptors star DeMar DeRozan and the 10th-seeded Chicago Bulls.\n\n\r\n              “I love the competition, I love those big hype games,” Toronto’s Scottie Barnes said. “I feel like that’s where I excel. I feel like I’m really hyped for those.”\n\n\r\n              Toronto went 2-1 against Chicago this year, with the home team winning all three meetings.\n\n\r\n              Jakob Poeltl played 11 minutes in the first half but didn’t play after halftime, while Barnes (22 minutes) and Trent (27) checked out with Toronto ahead by double digits in the third quarter.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Portis and Joe Ingles came off the bench after not playing Friday in a home loss to Memphis. Portis and Ingles both played 18 minutes while Crowder played 25. … Milwaukee won the season series 3-1.\n\n\r\n              Raptors: With eight steals, Toronto set a single-season franchise record of 772. The Raptors had 769 steals in 1997-98. ... Anunoby led the NBA with a career-high 1.91 steals per game. … Won their fourth straight at home to finish 27-14 north of the border.\n\n\r\n              FIVE FOR 15\n\n\r\n              Siakam, VanVleet, Trent, Anunoby and Barnes all averaged 15 points per game or better this season. The Raptors also did that in 2019-20 with Siakam, VanVleet, Kyle Lowry, Serge Ibaka and Norman Powell. Before that, it hadn’t been done in the NBA since the 1973-74 Buffalo Braves, led by Hall of Famer Bob McAdoo’s 30.6 points per game.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the East’s eighth-seeded team when the playoffs begin April 15.\n\n\r\n              Raptors: Host Chicago in the 9-10 play-in game on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994003.023196
}