{
  "game_id": "0022200510",
  "espn_id": "401468665",
  "date": "Dec 27, 2022",
  "matchup": "MEM vs. PHX",
  "headline": "Washington scores 26 as banged-up Suns beat Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Duane Washington Jr. scored a career-high 26 points, and the Phoenix Suns beat the Memphis Grizzlies 125-108 on Tuesday night.\n\n\r\n              Washington, a two-way guard in his second year out of Ohio State, went 5 for 9 from 3-point range and 10 of 21 from the field overall.\n\n\r\n              “It felt good, man,” Washington said. “I’ve been working my tail off. I’ve just been believing in myself. Coaches believe in me. My teammates believe in me.”\n\n\r\n              Suns coach Monty Williams praised Washington’s effort.\n\n\r\n              “We needed every bit of it tonight,\" Williams said. \"I thought he gave us a great deal of juice. He gave us a bit of an edge on the floor.”\n\n\r\n              Eight Suns scored in double figures, helping the team stop a three-game slide. Jock Landale scored 16, and Deandre Ayton had 15 points and 10 rebounds. Chris Paul finished with 14 points and six assists.\n\n\r\n              Ja Morant led Memphis with 34 points. Desmond Bane was the only other Memphis player in double figures with 14 before Grizzlies coach Taylor Jenkins cleared his bench midway through the fourth quarter.\n\n\r\n              “All of us have just got to play better offensively,” Jenkins said. “Myself, players. We've just got to be better.”\n\n\r\n              The Suns were without several key players. Devin Booker, who is trying to come back from a groin injury, lasted four-plus minutes in a Christmas Day loss to Denver and remained out against the Grizzlies. Landry Shamet joined Booker, Cameron Payne and Cam Johnson on the injury list.\n\n\r\n              The Grizzlies have dropped four of five. They beat the Suns 125-100 in Phoenix on Friday night for their only win of the tough stretch.\n\n\r\n              “We're just having a rough patch of four or five games,\" Jenkins said. “We haven't lived up to our standard and played like we're capable of.”\n\n\r\n              Washington made three of Phoenix's 10 3-pointers in the first half, helping the Suns to a 65-49 lead at the break. Memphis made three 3s in the first two quarters.\n\n\r\n              Morant scored 22 in the third, but two free throws for Josh Okogie and a driving layup by Washington made it 97-80 after three.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Booker is not with the team, and Williams would not speculate on his return. “He's getting more evaluation back in Phoenix. He can get the best care back there,” Williams said. ... With a block in the second quarter, Mikal Bridges passed Tom Chambers for 18th on the Suns franchise list with 215.\n\n\r\n              Grizzlies: Bane, who was playing his third game after an extended absence with a sprained big toe, entered the night 2 of 15 from 3-point range and missed all four of his attempts from outside the arc. ... Jaren Jackson Jr. tied Rudy Gay for fifth on the franchise list in blocks with 420. \n\n\r\n              GAME ON\n\n\r\n              The Grizzlies confirmed Tuesday afternoon that the game would go on as scheduled. The city is dealing with water pressure problems from an extended cold snap with sub-freezing temperatures. About 38,000 of the city’s utility customers had little or no water as of Tuesday. The biggest problem at FedExForum was there were no fountain drinks at concession stands, but bottled water and soft drinks were available. \n\n\r\n              LAST WORD\n\n\r\n              “It can't get any worse than this. There's the positive,” Memphis reserve center Xavier Tillman said. \n\n\r\n              UP NEXT\n\n\r\n              Suns: Continue a six-game road trip in Washington against the Wizards on Wednesday.\n\n\r\n              Grizzlies: Travel to Toronto to face the Raptors on Thursday.\n\n\r\n              —-",
  "source": "espn_api",
  "crawled_at": 1764994209.589321
}