{
  "game_id": "0021901245",
  "espn_id": "401224720",
  "date": "Aug 02, 2020",
  "matchup": "POR @ BOS",
  "headline": "Tatum has 34 as Celtics beat Trail Blazers 128-124",
  "body": "LAKE BUENA VISTA, Fla. --  Jayson Tatum scored 34 points, Jaylen Brown added 30 and the Boston Celtics built a big early lead before holding on for a 128-124 victory over the Portland Trail Blazers on Sunday.\n\n\"That was a playoff-level energy that we had to play with at the end of the game,\" Boston coach Brad Stevens said. \"This is a great experience.\"\n\nTatum, who added a career-high eight assists, rebounded from a terrible performance in a loss to Milwaukee on Friday when he scored just five points on 2-of-18 shooting.\n\n\"It's just about making the right reads,\" Tatum said. \"Seeing the double-teams. Making the right play. Jaylen was open and those were the right reads.\"\n\nDamian Lillard had 30 points and 16 assists for Portland. Jusuf Nurkic added 30 points in his second official game back after breaking his leg in March 2019.\n\nBoston led by as many as 24 in the second quarter. But Portland opened the fourth quarter with a 15-4 run, with three 3-pointers from Lillard and two from CJ McCollum, to put them on top 101-98.\n\n\"If anything, we'll take away we played extremely well in the second half against a really good team,\" Portland coach Terry Stotts said. \"We don't have any time to have a hangover after a loss.\"\n\nGary Trent Jr. hit a 3-pointer with less than 2 minutes to go before the Celtics used a 7-0 run to take a 125-119 lead with about 30 seconds left.\n\nCarmelo Anthony got the Blazers within three with a 3-pointer and Gordon Hayward was called for a backcourt violation to give Portland the ball back. Lillard lost the ball and the Celtics were called for a foul to give Portland another possession with 6.8 seconds to go.\n\nA layup by Nurkic cut the lead to one with 3.4 seconds left and Hayward added two free throws to push the lead to 127-124. Nurkic's long inbounds pass bounced out of bounds to secure Boston's victory.\n\nThe Celtics had a 10-point lead with less than a minute left in the third when Lillard was fouled as he banked in an off-balance 3-pointer and he made the free throw to get Portland within 92-86.\n\nKemba Walker finished the quarter with a basket for Boston to make it 94-86 entering the fourth.\n\nTIP-INS\n\nTrail Blazers: Trent had 21 points off the bench on seven 3s. ... Portland made its first 14 free throws and finished 15 of 16.\n\nCeltics: Walker had 14 points in 22 minutes as the team limits his minutes to prepare for the playoffs. ... Boston made 18 of 30 3-pointers.\n\nHEALTH UPDATE\n\nNurkic said after the game that his grandmother Hana is now awake after being in a coma after a COVID-19 diagnosis. The 67-year-old is hospitalized in Bosnia.\n\nUP NEXT\n\nTrail Blazers: Play Houston on Tuesday night.\n\nCeltics: Play the Heat on Tuesday night.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996608.134323
}