{
  "game_id": "0021801091",
  "espn_id": "401071764",
  "date": "Mar 23, 2019",
  "matchup": "MEM vs. MIN",
  "headline": "Towns has 33 points, 23 boards to lift Wolves over Memphis",
  "body": "MEMPHIS, Tenn. --  A night after they were eliminated from playoff contention, the Minnesota Timberwolves at least ended a difficult skid.\n\nKarl-Anthony Towns had 33 points and 23 rebounds, and the Timberwolves beat the Memphis Grizzlies 112-99 on Saturday night, ending a five-game slide that matched their longest of the season.\n\n\"It feels good,\" said guard Tyus Jones, who had 12 points and nine assists. \"We've been working (for it). We've been working and fighting, so it feels good to finally come out on the right side of things.\"\n\nAndrew Wiggins added 22 points and rookie Josh Okogie had 17 as all five Minnesota starters reached double figures in scoring.\n\nMike Conley led Memphis with 23 points, and Jonas Valanciunas had 20 points and 14 rebounds.\n\nMemphis led at halftime 50-49, but Minnesota broke it open with a 19-4 run to start the second half. The Grizzlies were getting nothing offensively, going 3 of 14 from the field during the Timberwolves' rally. The lead reached 19 at one point, and Minnesota carried an 84-68 advantage into the fourth.\n\n\"Adjustment-wise, we're just talking about more ball pressure,\" Minnesota interim coach Ryan Saunders said on the difference after halftime. \"We didn't think we had enough ball pressure on them in the halfcourt.\"\n\nA lack of energy plagued the Grizzlies, who were playing a back-to-back after losing to Orlando in overtime Friday. Valanciunas played a season-high 41 minutes in that game, and other Memphis players were extended in playing time. That left the Grizzlies flat when Minnesota made its run.\n\n\"I think fatigue caught up with us after (Friday) night's game,\" Memphis coach J.B. Bickerstaff said. \"The guys competed, but we couldn't find that spark.\"\n\nValanciunas added: \"We just collapsed.\"\n\nMinnesota outscored the Grizzlies 35-18 in the third quarter. That was part of the Timberwolves shooting almost 60 percent in the second half, including going 8 of 16 from 3-point range. Memphis never got the deficit under 11 in the fourth.\n\nIn addition to the five-game losing streak, the road had been tough for Minnesota -- the Timberwolves lost 13 of their previous 14 away games before Saturday night.\n\n\"It's a big sense of relief in a way,\" Saunders said of the road win.\n\nTIP-INS\n\nTimberwolves: Announced earlier Saturday that veteran guard Derrick Rose will miss the rest of the season following surgery to remove bone chips from his right elbow. ... The team had already announced Thursday that Rose, along with guard Jeff Teague and forward Robert Covington, likely would miss the rest of the season with injuries. ... The game was the last in a string where Minnesota played five of six on the road. The Timberwolves play seven of their final nine at home. ... Okogie reached double figures for the fourth straight games.\n\nGrizzlies: Conley (general soreness) and reserve C Joakim Noah (right knee soreness), who missed Friday's overtime loss in Orlando, returned to action. Noah left the game in the second quarter with the same problem and did not return. ... Conley has scored at least 20 points in seven straight games, the longest such streak of his career. ... Memphis had 20 offensive rebounds leading to 23 second-chance points -- season highs in both categories. ... Delon Wright had 12 points and six assists.\n\nUP NEXT\n\nTimberwolves: Host the Clippers on Tuesday.\n\nGrizzlies: Host the Thunder on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994893.9966269
}