{
  "game_id": "0021800832",
  "espn_id": "401071505",
  "date": "Feb 09, 2019",
  "matchup": "OKC @ HOU",
  "headline": "George, Westbrook rally Thunder past Rockets, 117-112",
  "body": "HOUSTON --  Paul George said it took a fiery halftime discussion to help the Oklahoma City Thunder overcome the largest deficit they've seen all season.\n\n\"We just knew we had to have a better second half,\" George said. \"Being down that much at the half, that's not the team we are. We know this team very well and we knew that wasn't us. So we had to come in here and talk and just light a fire under this team and we did that.\"\n\nGeorge scored 45 points, Russell Westbrook matched the NBA record with his ninth straight triple-double and Oklahoma City overcame a 26-point deficit to beat the Houston Rockets 117-112 on Saturday night.\n\nIt was Oklahoma City's largest comeback victory.\n\n\"We just never got into any flow, but then I thought once we got some stops, we got out in transition,\" Thunder coach Billy Donovan said. \"Obviously, Paul with what he did tonight was phenomenal, the way he played. And he was on (James) Harden a lot. He was unbelievable tonight on both ends of the floor.\"\n\nDefensively, George fought through screens in the final minute to stay on Harden.\n\n\"I look forward to playing against the best,\" George said. \"That's how I was taught the game -- just enjoy matchups and have fun with it.\"\n\nWestbrook had 21 points, 11 assists and 12 rebounds to match the record streak set by Wilt Chamberlain in 1968. Westbrook has 22 triple-doubles this season and 126 overall. He also had 10 turnovers and was 8 of 21 from the field.\n\n\"It's really incredible,\" Donovan said. \"It took whatever it was, 60 years, until somebody did it just to show you how hard it is to do and how unique of a player he is to be able to do it.\"\n\nHarden led the Rockets with 42 points, reaching 30 points for the 29th straight game -- two shy of Chamberlain for the second-longest streak in NBA history, but far behind Chamberlain's record run of 65 games. Harden was 11 for 28 from the field, going 6 of 16 from 3-point range, and made 14 of 15 free throws.\n\nThe 26-point deficit was Oklahoma City's largest of the season.\n\nWestbrook gave the Thunder a one-point lead with a driving layup with 26.9 seconds remaining. On the following possession, Harden missed a 3-pointer, and George got the rebound and was fouled with 3.4 seconds left. He made both free throws put Oklahoma City up three. Houston turned it over on the following inbound play.\n\nGeorge made 12 of 22 shots, hit 6 of 14 3-pointers and made 15 of 18 free throws to finish four points shy of his career-high 49 points set in 2013 with Indiana.\n\nThe Thunder made seven of their first eight shots in the third quarter to quickly cut Houston's lead in half. Oklahoma City outscored Houston 42-20 in the quarter to even the score at 90.\n\n\"We knew to get back into the game, we had to defend at a high level,\" Westbrook said. \"We got stops and won a big game on the road.\"\n\nOklahoma City fell into a deep hole in the first half following a sizzling second quarter from the Rockets. After dominating Sacramento 44-17 in the second quarter of a 127-101 win in their previous game on Wednesday night, the Rockets outscored the Thunder 42-23 on Saturday night.\n\n\"We have to be consistent for four quarters,\" Harden said. \"It's pretty simple.\"\n\nHouston had won seven of eight home games against Oklahoma City.\n\n\"They're a good team and they played well,\" Rockets coach Mike D'Antoni said. \"We had our chances. We just didn't finish off. We came out flat the second half for whatever reason. Maybe being up 22 did it, I don't know.\"\n\nDennis Schroder had 17 points off the bench for Oklahoma City.\n\nIman Shumpert, acquired by Houston from Sacramento ahead of the trade deadline, made a 3-pointer from the corner on his second shot attempt and finished with three points in 24 minutes.\n\n\"He'll help us defensively,\" D'Antoni said. \"I thought he may have gotten a little tired in the second half, but the first half, he was a dog out there. It was good. There are a lot of positive things.\"\n\nTIP-INS\n\nThunder: Reserve SG Alex Abrines was released Saturday, with the Thunder citing personal reasons. Abrines appeared in just two games since Dec. 23, sitting out because of undisclosed personal reasons. In 31 games this season, Abrines averaged 5.3 points.\n\nRockets: Houston was outrebounded 53-39. The Rockets fell to 8-5 without leading rebounder Clint Capela. He has a right thumb injury. ... Kenneth Faried had 17 points and 12 rebounds.\n\nUP NEXT\n\nThunder: Host Portland on Monday night.\n\nRockets: Host Dallas on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994572.395158
}