{
  "game_id": "0022000083",
  "espn_id": "401267243",
  "date": "Jan 02, 2021",
  "matchup": "ATL vs. CLE",
  "headline": "Sexton, Drummond pace Cavs' rally in win over Hawks",
  "body": "ATLANTA -- — Collin Sexton scored 27 points, Andre Drummond had 12 points and 11 rebounds and the Cleveland Cavaliers wiped out a 15-point deficit in the third quarter and beat the Atlanta Hawks 96-91 on Saturday night.\n\n\r\n                    The Cavs' keys to the game defensively were to prevent Atlanta from spending the whole game shooting free throws and from firing at will from beyond the arc, two categories in which the Hawks are among NBA leaders.\n\n\r\n                    “In the first quarter they were having their way with some 3s,\" Larry Nance Jr. said. “Get them off the free throw line, get them off the 3-point line and anything in between that we'll live with. Andre and JaVale are way too good at the rim contesting shots. It's hard to finish over that kind of length.\"\n\n\r\n                    JaVale McGee, who finished with 14 points, scooped in a runner to help the Cavs reclaim the lead at 84-83, and Sexton made it a three-point lead with a 17-footer on the next possession to keep Atlanta on its heels.\n\n\r\n                    Clint Capela had 16 points and 16 rebounds for the Hawks, who had 22 turnovers in the final three quarters but tied it at 88-all on Bogdan Bogdanovic's 3 before Sexton hit a 3 to put the Cavs up 91-88 with 27.2 seconds remaining. John Collins missed an ensuing dunk attempt before Darius Garland hit a free throw and Sexton hit four foul shots to end the scoring in the closing seconds.\n\n\r\n                    “It feels good just to have my teammates behind me each night,\" Sexton said. “Early on they were like, ‘Keep going, keep going, you're going to get your rhythm.' ... They pretty much have a lot of confidence in me.\"\n\n\r\n                    Collins' alley-oop dunk on a feed from Trae Young gave the Hawks their biggest lead at 15 points with 6:28 left in the third, but the Cavs went on an 18-5 run to trim it to 72-70 on Garland's 3 in the final minute of the period. They finally took the lead early in the fourth when Cedi Osman's 3-pointer from the right wing made it 76-74 with 9:47 remaining.\n\n\r\n                    Atlanta took its first double-digit lead when Young’s acrobatic layup made it 30-19 at the 2:49 mark of the first. Young had other highlights in the second, stealing the ball and passing from his knees to Cam Reddish for a layup that made it 45-35, and assisting Capela from the left side for an inside basket that kept the lead at 10 at the 2:39 mark.\n\n\r\n                    The Hawks, coming off a win at Brooklyn on Thursday, looked sluggish throughout, but still carried a 56-44 lead into intermission. The closest Cleveland got in the second quarter was a 3 by Osman that made it 53-44, but Kevin Huerter quickly followed with a 3 from the right wing to push the lead back to 12.\n\n\r\n                    The Hawks began the game leading the NBA in scoring (125.8) and free throws made per game (25.2), and ranking second in 3-pointer made, second-chance points (17.0) and rebounds (49.4).\n\n\r\n                    “It happened tonight where they're in a rhythm and getting back into the game,\" Young said. “We've just got to lock in a little bit more.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: G Dante Exum started in place of Isaac Okoro (left foot sprain) for the second straight game and finished with six points in 35 minutes. Exum's defense was primarily responsible Young's struggles. ... Sexton had 13 points in the fourth. ... Cleveland also played without F Kevin Love (right calf strain), Matthew Dellavedova (concussion), Kevin Porter Jr. (personal reasons) and Dylan Windler (left hand fracture). ... The Cavs are 1-2 since Love’s latest injury. \n\n\r\n                    Hawks: Capela had a double-double in the first half with 12 points and 10 rebounds. ... He has led the team in rebounds in each of his four games. ... De'Andre Hunter scored a team-high 17. ... Young added 16. ... F Danilo Gallinari underwent an MRI Saturday morning that confirmed a right ankle sprain. He was injured during the Hawks’ Dec. 30 game at Brooklyn. He will be reviewed in two weeks. ... Reserve G Rajon Rondo (right knee soreness) was held out for the second straight night. ... The Hawks were also without G Kris Dunn (right ankle surgery) and F Onyeka Okongwu (left foot inflammation). ... Huerter limped to the locker room with an undisclosed injury in the fourth.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: At Orlando on Monday.\n\n\r\n                    Hawks: Host New York on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997644.747566
}