{
  "game_id": "0022300707",
  "espn_id": "401585335",
  "date": "Feb 04, 2024",
  "matchup": "CHA vs. IND",
  "headline": "Pacers overcome career-high 35 points from Brandon Miller to beat Hornets 115-99",
  "body": "CHARLOTTE, N.C. -- — Pascal Siakam had 25 points, nine assists and eight rebounds and the Indiana Pacers overcame a career-high 35 points from Hornets rookie Brandon Miller to beat Charlotte 115-99 on Sunday night and snap a three-game skid.\n\n\r\n              Aaron Nesmith added 22 points and Myles Turner had 16 points and 10 rebounds for the Pacers (28-23), who held the Hornets to 39.8% shooting from the field and 27.6% from beyond the arc.\n\n\r\n              Tyrese Haliburton had 17 points in 20 minutes while remaining on a minutes restriction due to a lingering hamstring injury.\n\n\r\n              Miller finished 10 of 25 from the field, 10 of 12 from the foul line and had five 3s for the Hornets. P.J. Washington added 22 points for Charlotte (10-38), which has lost seven straight — five by double digits.\n\n\r\n              Siakam said he is growing more comfortable with his role with the Pacers with each passing game since being acquired in a trade with the Toronto Raptors on Jan. 17.\n\n\r\n              “Just figuring out that balance and being who I am as a player and also fitting in with the team,” Siakam said. “Sometimes I can be trying so hard to make sure everything is right and it can take away from who I am. So everyone is just telling me to be me.”\n\n\r\n              Andrew Nembhard started for the Pacers, and while he didn't score, coach Rick Carlisle said his presence was noticeable.\n\n\r\n              “That is something we thought made sense really for this game and potentially the next few, we’ll see,” Carlisle said. “He gives us flexibility and it makes the ecosystem of our roster work better, so that was good.”\n\n\r\n              The Pacers wasted little time jumping on a Hornets team playing without LaMelo Ball, Gordon Hayward, Mark Williams and Cody Martin, scoring the game's first nine points en route to a 26-13 lead after the first quarter. The Pacers held the Hornets to 5-of-25 shooting in the opening quarter.\n\n\r\n              Indiana led by 24 in the third quarter, but the Hornets would cut the lead to 10 early in the fourth quarter behind Miller, who had 27 points in the second half.\n\n\r\n              But the Hornets could never get within striking distance, and the Pacers pushed the lead back to 17 after Nesmith stole a pass at midcourt and cashed in with an emphatic breakaway two-handed dunk with 5:36 left to secure a wire-to-wire victory.\n\n\r\n              “He's going to be really good,” Haliburton said of Miller, the No. 2 overall pick. “He listens and you can see the improvement. ... With a lot of their guys hurt, it has been kind of baptism by fire for him. He's being looked at to do more than if everyone were healthy.”\n\n\r\n              Hornets coach Steve Clifford said Miller's steady improvement hasn't surprised him.\n\n\r\n              “He works hard, he’s very diligent and that’s the way it works,” Clifford said. \"He’s got a lot of talent, he works hard, so he gets better. He’s getting better for the right reasons. He’s being double teamed now and he did a good job against that, passing out of it.”\n\n\r\n              Miller said his teammates are pushing him to be more aggressive.\n\n\r\n              “You know we have guys out, so everybody has to step up,” Miller said. \"So I think just stepping up being more aggressive coming out with the energy that we need to win a ballgame, that’s important for us.” \n\n\r\n              Miles Bridges had a rough night for the Hornets, finishing 8 of 23 from the floor while missing six layups.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Houston on Tuesday night.\n\n\r\n              Hornets: Host Los Angeles Lakers on second night of a back-to-back. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995966.5260081
}