{
  "game_id": "0022200189",
  "espn_id": "401468344",
  "date": "Nov 12, 2022",
  "matchup": "MIA vs. CHA",
  "headline": "Strus scores 31, Heat roll past sliding Hornets 132-115",
  "body": "MIAMI -- — Max Strus and the Miami Heat finally enjoyed a rare easy win.\n\n\r\n              Strus scored 31 points, one off his career high, and the Heat spoiled LaMelo Ball’s return to the Charlotte lineup by beating the Hornets 132-115 on Saturday night.\n\n\r\n              Strus was 10 of 16 from the floor, 8 of 14 from 3-point range. It was only the second time this season that Miami won a game by more than seven points, and ended a streak of six consecutive single-digit games for the Heat.\n\n\r\n              Miami also made 12 consecutive shots in one stretch from late in the first half through the midpoint of the third quarter, turning a five-point deficit into a 16-point lead.\n\n\r\n              “I feel like that's how we're supposed to play,\" Heat center Bam Adebayo said.\n\n\r\n              Adebayo had 24 points and 15 rebounds for the Heat, who swept a two-game home series with the Hornets and got consecutive wins for only the second time this season. Charlotte lost its eighth straight, extending the longest current slide in the NBA.\n\n\r\n              “You've got to be able to guard your guy in today's NBA,\" Hornets coach Steve Clifford said. “The nights when we do it, we're good. We haven't developed the mindset, the mentality to do it every night and we've got to get to that.\"\n\n\r\n              Jimmy Butler had 20 points, eight assists and seven rebounds for Miami, while Gabe Vincent scored 20 points. Miami outscored Charlotte 45-25 in the third quarter, tying the sixth-highest scoring quarter in any period in Heat history. \n\n\r\n              “I liked the way the flow was going offensively,” Heat coach Erik Spoelstra said.\n\n\r\n              Ball finished with 15 points, six assists and six rebounds in 28 minutes, making his season debut after missing the first 13 games with a sprained ankle. He shot 6 of 17, 1 for 9 from 3-point range.\n\n\r\n              Terry Rozier led the Hornets with 22 points, while Kelly Oubre Jr. scored 20.\n\n\r\n              Charlotte led 59-54 late in the first half, and the next seven minutes were all Miami. The Heat outscored the Hornets 34-13 over that stretch, and Strus had 20 points in the second half.\n\n\r\n              “I got it going early and teammates were looking for me,” Strus said.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Charlotte’s game at Orlando on Monday is the Hornets’ fourth, and last, in the state of Florida this season. ... The Hornets are 0-7 in November, the NBA’s only winless team this month. ... Nick Richards scored 15.\n\n\r\n              Heat: Kyle Lowry had 12 points, 11 rebounds and eight assists. ... Tyler Herro (sprained left ankle) missed his third consecutive game. Victor Oladipo (left knee) and Omer Yurtseven (left ankle) are still out and have yet to play this season. ... Miami had four players score at least 20 for the first time since April 5 — also against Charlotte.\n\n\r\n              HONORING TIMMY\n\n\r\n              The Heat completed a weekend-long celebration of Tim Hardaway’s enshrinement in the Basketball Hall of Fame, after a dinner attended by Pat Riley and others on Friday and a halftime on-court ceremony on Saturday. Hardaway is still Miami’s leader in 3-pointers (Duncan Robinson will likely pass him in the coming weeks) and second in assists. “It lets me know that I brought some joy to people’s lives,” Hardaway said, when asked how he enjoys reactions from fans now.\n\n\r\n              BUSY REFS\n\n\r\n              The Heat and Hornets had Friday off. Josh Tiven and Evan Scott, two of the referees on Saturday’s game, did not. Tiven worked a game in New York on Friday, while Scott worked a game in Orlando. It was Tiven’s third instance of officiating on back-to-back days this season, Scott’s first.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit Orlando on Monday.\n\n\r\n              Heat: Host Phoenix on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993988.432272
}