{
  "game_id": "0022300007",
  "espn_id": "401584095",
  "date": "Nov 03, 2023",
  "matchup": "MEM @ POR",
  "headline": "Trail Blazers open the new In-Season Tournament with a 115-113 win over the Grizzlies in overtime",
  "body": "PORTLAND, Ore. -- — Shaedon Sharpe's cold made his voice a bit raspy, but it didn't impact his sense of humor. \n\n\r\n              Sharpe had a pair of clutch free throws and a block that sent the game to overtime before the Portland Trail Blazers beat the Memphis Grizzlies 115-113 in their In-Season Tournament opener Friday night. \n\n\r\n              Despite fighting that cold, Sharpe finished with 22 points and played a team-high 46 minutes.\n\n\r\n              “I had to ask how many minutes are in a game,” he joked. \n\n\r\n              Jerami Grant led the Blazers with 26 points, including a critical 3-pointer in overtime, and added eight rebounds in Portland's third consecutive victory. Malcolm Brogdon had 24 points, 10 assists, seven rebounds and three steals. \n\n\r\n              “We just never give up,” said Sharpe, treated to “MVP!” chants from the crowd when he went to the line. “We stayed on course. Everybody competes hard. We just stay focused.”\n\n\r\n              Desmond Bane had 33 points and eight rebounds for the Grizzlies, who lost their sixth straight to start the season. \n\n\r\n              Memphis led 100-90 on David Roddy's dunk with 3:21 left in regulation before Portland chipped away, getting within 102-100 when Brogdon made two free throws. \n\n\r\n              Sharpe hit a pair of foul shots with 8.3 seconds left to tie it, then blocked Luke Kennard's attempt from the corner on the other end to send the game to overtime tied at 102.\n\n\r\n              Sharpe's step-back 3 gave the Blazers a 109-106 lead with 1:17 left in OT. Grant's 3 with 39.1 seconds remaining made it 112-108. \n\n\r\n              “Our offense was pretty good for the most part, despite their game plan, and trying to take Des away and physicality. He still found a way to score 33 and we got 29 assists,” Grizzlies coach Taylor Jenkins said. “Defense absolutely failed us.”\n\n\r\n              Both the Grizzlies and Trail Blazers are in West Group A for the new tournament, along with the Los Angeles Lakers, Utah Jazz and Phoenix Suns. The games count toward regular-season records — except for the final, set for Las Vegas in December. \n\n\r\n              “I think it's cool,” Blazers coach Chauncey Billups said. “I really do. I think anytime you can put yourself into a position to play when it's just worth more, and means something. It feels different, the court looks different, different jerseys.”\n\n\r\n              The Blazers host the Grizzlies again Sunday in a regular game. \n\n\r\n              Portland (3-3) was without rookie guard Scoot Henderson, who has a right ankle sprain. The Blazers were already missing guard Anfernee Simons, who had a procedure to repair a torn ligament in his right thumb earlier this week. Simons was expected to be out for up to six weeks.\n\n\r\n              Memphis is the NBA's lone winless team. The Grizzlies haven't lost this many games in a row to start the season since the 2002-03 squad opened 0-13. \n\n\r\n              Bismack Biyombo, signed Wednesday by Memphis, made a brief debut for the Grizzlies late in the third quarter. A 12-year NBA veteran, the center played for the Suns the past two seasons. \n\n\r\n              The Grizzlies continued to miss Ja Morant, who was suspended for the first 25 games of the season for conduct detrimental to the league after brandishing a gun on social media. \n\n\r\n              After the Blazers built a 33-26 lead in the first half, Memphis responded with a 13-0 run to go up 39-33 in the second, capped by Bane's 3-pointer. Another basket by Bane pushed the lead to 44-35. \n\n\r\n              Portland closed the gap with a 10-0 run, and Sharpe's 3 put the Blazers back in front 52-51. They went into halftime up 54-53.\n\n\r\n              The Grizzlies had a 77-76 edge to start the fourth quarter after a back-and-forth third.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Their next In-Season Tournament game is Nov. 10 at home against the Utah Jazz. \n\n\r\n              Trail Blazers: The next In-Season Tournament game is Nov. 14 at Utah. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996516.714276
}