{
  "game_id": "0022300251",
  "espn_id": "401584879",
  "date": "Nov 26, 2023",
  "matchup": "TOR @ CLE",
  "headline": "Darius Garland scores 24 points as the Cavaliers defeat the Raptors 105-102",
  "body": "CLEVELAND -- — Darius Garland had 24 points and eight assists and Max Strus scored his 20 points in the third quarter, helping the Cleveland Cavaliers to a 105-102 victory over the Toronto Raptors on Sunday night.\n\n\r\n              The Cavaliers took their largest lead at 89-77 early in the fourth quarter on a 3-pointer by Garland, then held off a furious comeback attempt led by Dennis Schroder, who scored seven points in the final 95 seconds.\n\n\r\n              Toronto had a chance to force overtime on its last possession, but Gary Trent Jr. stepped out of bounds in the corner before getting off a potential tying shot. Cleveland ran out the clock and snapped its two-game losing streak.\n\n\r\n              “I’m glad we started to get it back together tonight,” Garland said. “We just had to bring the energy, and the crowd picked us up a little bit. I’ve also been telling Max to shoot the ball and he finally did.”\n\n\r\n              Strus hit four 3-pointers and made 8 of 10 field goal attempts in the third as the Cavaliers rallied from 10 down. He missed all six of his shots in the other three quarters, and finished with 11 rebounds and five assists.\n\n\r\n              Raptors center Jakob Poeltl set season highs of 18 points and 13 rebounds, and Pascal Siakam had 18 points, eight rebounds and six assists. Scottie Barnes had 15 points and eight rebounds as Toronto fell to 1-5 on the road against Eastern Conference teams.\n\n\r\n              “I feel like we were in control for most of the game, but we gave them that one stretch in the third that gave them life,” said Poeltl, who has made 34 of 39 shots over the last six games. “We gave up some offensive rebounds and made some sloppy mistakes. That’s how you lose a close game.”\n\n\r\n              Jarrett Allen scored 18 points and Evan Mobley had 12 points and 14 rebounds for Cleveland, which is 1-2 on its five-game homestand. The Cavaliers lost to the Lakers 121-115 on Saturday night.\n\n\r\n              Garland, who sat out the second half of the game against the Lakers with a neck strain caused by striking his head on the knee of Max Christie, played a game-high 41 minutes.\n\n\r\n              “Guys love to play with him because when the ball is in Darius’ hands, everybody is an option,” Cleveland coach J.B. Bickerstaff said. “He does things creatively and unselfishly.”\n\n\r\n              Schroder scored 15 points and Trent added 13 off the bench for Toronto, which had won two in a row.\n\n\r\n              Donovan Mitchell scored 10 points for the Cavaliers in his second game back after missing four straight with a right hamstring strain. The four-time All-Star has made just 8 of his 35 field goal attempts since returning.\n\n\r\n              Cleveland did not commit a foul in the first quarter, preventing Toronto from making its first free throw until midway through the second. The Cavaliers attempted one foul shot in the first 29 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Visit the Brooklyn Nets on Tuesday night.\n\n\r\n              Cavaliers: Host the Atlanta Hawks in an In-Season Tournament game on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995449.6267772
}