{
  "game_id": "401810078",
  "espn_id": "401810078",
  "date": "Nov 12, 2025",
  "matchup": "SAC vs ATL",
  "headline": "Jalen Johnson's double-double leads Hawks past Kings 133-100",
  "body": "SACRAMENTO, Calif. -- — Jalen Johnson had 24 points, 10 rebounds and eight assists as the Atlanta Hawks routed the slumping Sacramento Kings 133-100 on Wednesday night.\n\n\r\n              Johnson scored 18 in the first half and shot 9 of 10 from the field overall for his fourth double-double this season and the 44th of his career. He made all four of his free throws, too.\n\n\r\n              Onyeka Okongwu added 21 points off the bench, Zaccharie Risacher had 15 and the Hawks won their third straight despite playing without Trae Young. The four-time All-Star guard has missed seven games due to a knee sprain and could be sidelined two more months.\n\n\r\n              Atlanta (7-5) led by 44 and never trailed, getting balanced scoring with seven players in double figures.\n\n\r\n              Keon Ellis had 20 points with six 3-pointers for Sacramento (3-9). Domantas Sabonis provided 12 points and Devin Carter added 11. Russell Westbrook and Precious Achiuwa each scored 10.\n\n\r\n              The Kings lost their fourth in a row and have been outscored 398-326 during that span.\n\n\r\n              Atlanta took control early and never let up, even after coach Quin Snyder emptied his bench.\n\n\r\n              The Hawks led by 15 midway through the first quarter before the Kings found a rhythm and pulled to 40-37 on Carter’s 3-pointer early in the second. \n\n\r\n              Sacramento got sloppy after that and missed seven consecutive shots with three turnovers as the Hawks closed the first half on a 25-9 run.\n\n\r\n              Risacher’s dunk extended the lead to 85-52 in the third quarter as loud boos from the home crowd filled Golden 1 Center.\n\n\r\n              The booing continued into the fourth when the Hawks led by 37.\n\n\r\n              Up next\r\n              Hawks: Host the Utah Jazz on Thursday.\n\n\r\n              Kings: Play the Minnesota Timberwolves as part of the in-season tournament Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042616.314579
}