{
  "game_id": "0021600278",
  "espn_id": "400899392",
  "date": "Dec 01, 2016",
  "matchup": "ORL @ MEM",
  "headline": "Gasol scores 25 as Grizzlies rally to edge Magic 95-94",
  "body": "MEMPHIS, Tenn. --  Marc Gasol made the winning free throws, but Tony Allen's defense made the difference down the stretch.\n\n\"That's his job,\" Gasol said. \"That's what he does, and he's really good at it.\"\n\nGasol scored 25 points, including a pair of free throws with 12.2 seconds remaining to give the Memphis Grizzlies a 95-94 victory over the Orlando Magic on Thursday night.\n\nGasol's free throws completed a 14-point comeback in the fourth quarter as the short-handed Grizzlies snapped a two-game losing streak.\n\nThough Gasol carried the offense, both coaches pointed to Allen's defense as the reason for a 13-0 Memphis run that brought the Grizzlies back into the game.\n\n\"He just took over that game defensively,\" Memphis coach David Fizdale said.\n\nAdded Magic coach Frank Vogel: \"Credit his energy. He just made a lot of hustle plays that turned the game around.\"\n\nAfter Gasol's free throws gave Memphis its first lead since early in the second half, Orlando still had a chance to win the game. But JaMychal Green stole the ball from Elfrid Payton near the top of the key. The ball ended up in Gasol's hands as time ran out.\n\nTroy Daniels finished with 19 points for the short-handed Grizzlies, who dressed nine players due to injuries. Andrew Harrison had 11 points and eight assists.\n\nEvan Fournier led the Magic with 28 points, while Nikola Vucevic had 18 points and 11 rebounds. Jeff Green scored 12 of his 14 points early in the fourth as Orlando built its lead.\n\nJaMychal Green's steal from Payton was his second in the fourth quarter. Allen also had a pair and disrupted the Orlando offense.\n\n\"That one hurts. Hurts bad,\" Fournier said. \"They just played more aggressive than us in the final 5 minutes.\"\n\nAnd Fournier didn't leave out Allen as the reason either.\n\n\"Tony Allen changed the game by just being more aggressive, getting in the passing lane and getting more deflections,\" the Magic guard said.\n\nTIP-INS\n\nMagic: Payton, listed as questionable with a right ankle sprain, came off the bench in the first quarter. ... Jodie Meeks remained out recovering from a right foot injury. ... Fournier hit all seven of his shots in the first half before ending the night 11 of 14, including 3 of 5 from outside the arc.\n\nGrizzlies: The game was the final one of a seven-game stretch against Eastern Conference teams. ... Gasol had a steal in the second quarter and flipped the ball backward over his head the length of the court for an assist on Troy Williams' breakaway dunk. ... Memphis has won nine straight home games against Orlando. The Magic have not won at FedExForum since a 112-85 defeat on Jan. 23, 2008. ... Memphis is now 5-0 on the second night of back-to-backs.\n\nTRIAGE UNIT\n\nThe Grizzlies remained short-handed based on injuries and personal leave. Memphis dressed only nine players as it did in Wednesday night's loss in Toronto. Among the injured: G Mike Conley, F Vince Carter, F James Ennis, F Chandler Parsons and F/C Brandan Wright. Also, F Zach Randolph is not with the team due to the death of his mother last week. Fizdale has begun calling the healthy group \"The Nasty Nine.\"\n\nSTREAK STILL ALIVE\n\nFournier connected on a 3-pointer in the first quarter, making 757 straight games Orlando has made a shot from outside the arc. The last game without a 3-pointer was March 14, 2007.\n\nDOUBLE-DOUBLE, BUT NOT ENOUGH\n\nVucevic recorded his 10th double-double of the season and almost put a dagger in the Grizzlies comeback hopes. After JaMychal Green's 3-pointer cut the Magic lead to 94-93, Vucevic fired a 26-footer with 24 seconds left. The ball rattled in the rim before popping out, setting the stage for Gasol's final free throws.\n\nUP NEXT\n\nMagic: Continue a five-game road trip on Friday night, playing the Sixers in Philadelphia.\n\nGrizzlies: Remain home to face the Lakers on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995873.8986082
}