{
  "game_id": "0021800578",
  "espn_id": "401071254",
  "date": "Jan 05, 2019",
  "matchup": "DAL @ PHI",
  "headline": "Embiid, Simmons lead 76ers past Mavericks, 106-100",
  "body": "PHILADELPHIA --  Joel Embiid and Ben Simmons carried the load without Jimmy Butler. And when Butler returns, the 76ers stars expect Philadelphia to keep rolling.\n\nEmbiid had 25 points and 12 rebounds, and Simmons added 20 points, 14 rebounds and 11 assists in Philadelphia's 106-100 victory over the Dallas Mavericks on Saturday night.\n\nEmbiid hit two key free throws late for Philadelphia, which was without Butler for the second straight game due to an upper respiratory infection. The four-time All-Star wasn't around to address a published report that said he recently challenged coach Brett Brown in a disrespectful way about his role in the offense.\n\nBrown downplayed the incident before the game, and both Embiid and Simmons expressed the belief afterward that the three stars can coexist.\n\n\"Everybody is trying to fit in,\" Embiid said. \"We are going to keep working on it. We are inching toward it, and we are going to get there.\"\n\nSimmons added: \"Jimmy's been great, amazing for me.\"\n\nJJ Redick added 20 points for Philadelphia, which improved to 17-3 at home while winning its fourth in the last five.\n\nWesley Matthews had 18 points to pace short-handed Dallas, which fell to 3-18 on the road. The Mavericks were without Dirk Nowitzki (rest), Devin Harris (back) and J.J. Barea (ankle). Rookie guard Jalen Brunson came off the bench to contribute 13 points, 11 rebounds and eight assists.\n\nThe 76ers, who led by as many as 19 points in the second half, were seemingly in total control until Luka Doncic's 3-pointer with just over a minute remaining cut the lead to 101-97. The lead still was four when Dwight Powell made one of two free throws for the Mavericks with 50 seconds left.\n\n\"We gave ourselves a chance to win it,\" Mavericks coach Rick Carlisle said.\n\nBut Embiid, with \"M-V-P! M-V-P!\" chants raining down from the sold-out crowd, drained two foul shots with 28 seconds remaining to give Philadelphia breathing room.\n\n\"Once again, we had to make the game interesting,\" Embiid said.\n\nThe 76ers had a 30-point advantage dwindle to three points before pulling out a 132-127 victory at Phoenix on Wednesday in their previous game.\n\nPhiladelphia methodically pulled away, increasing a 31-26 first-quarter advantage to 59-51 at the half. The 76ers made 10 of 20 field goals in the third quarter, settling for an 87-70 lead to start the fourth.\n\nNowitzki didn't play on the second night of a back-to-back after going scoreless in the Mavericks' 114-93 loss at Boston on Friday night. Nowitzki missed all 10 of his shots, including eight from 3-point range, while failing to score for just the ninth time in his 21-year career. He needed two points to become the Western Conference player with the most points on Boston's home court.\n\nTIP-INS\n\nMavericks: DeAndre Jordan bruised his left hand in the first half but returned. . Doncic had 14 points but shot 4 for 16 from the field, including 1 for 8 from 3-point range.\n\n76ers: Philadelphia is 17-8 since acquiring Butler from the Minnesota Timberwolves in November. ... Simmons reached a triple-double for the sixth time.\n\nBUTLER BABBLE\n\nBrown dismissed the Butler report before Saturday's game.\n\n\"I didn't feel like any of that crossed the line,\" Brown said. \"He's vocal. He's all in and he has opinions, but it's instigated by me. None of this should surprise anybody. He's got opinions. He wants to be heard. And he should be heard.\"\n\nPhiladelphia acquired Butler last month with an eye on making a run to the NBA championship. But meshing Butler with stars Simmons and Embiid hasn't always been easy, which Brown acknowledged.\n\n\"There's nobody trying to figure this out more than I am,\" Brown said.\n\nBRUNSON'S RETURN\n\nBrunson, who played collegiately at nearby Villanova, was honored before the game by the Philadelphia Sports Writers Association as its Amateur Athlete of the Year after helping the Wildcats to their second national title in three years last April. Brunson's dad, Rick, a well-traveled NBA guard who played collegiately at Temple, sat courtside to watch his son's best game of his young career.\n\n\"He was terrific all around,\" Carlisle said. \"He looked right at home. I was happy for him. I thought he did a lot of good things.\"\n\nUP NEXT\n\nDallas: Host Lakers on Monday night.\n\nPhiladelphia: Host Washington on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764995456.0532649
}