{
  "game_id": "0022200031",
  "espn_id": "401468186",
  "date": "Oct 22, 2022",
  "matchup": "MIA vs. TOR",
  "headline": "After a scuffle, Heat hold on to top Raptors 112-109",
  "body": "MIAMI -- — A scuffle inspired Toronto, and the Raptors' response forced the Miami Heat to work a little harder to secure their first win of the season.\n\n\r\n              Jimmy Butler scored 24 points, Max Strus added 20 off the bench and the Heat topped the Raptors 112-109 on Saturday night.\n\n\r\n              The teams will meet again Monday night in Miami.\n\n\r\n              Miami's Kyle Lowry had 17 points against his former club, Tyler Herro had 14 and Bam Adebayo added 10 for the Heat — who wasted much of a 24-point lead before hanging on.\n\n\r\n              “When the result ends like this, I love all of the emotions and experiences,\" Heat coach Erik Spoelstra said.\n\n\r\n              Pascal Siakam and Gary Trent Jr. each scored 23 points for Toronto, which got 18 points and 11 rebounds from former Heat forward Precious Achiuwa. O.G. Anunoby scored 13 points and Scottie Barnes added 11 for Toronto.\n\n\r\n              The Heat saw a 24-point lead cut to six early in the fourth, with Toronto getting on a huge roll after a scuffle — which spilled into a row of baseline seats — seemed to inspire the Raptors.\n\n\r\n              Toronto’s Christian Koloko and Miami’s Caleb Martin were both ejected with 7:46 left in the third quarter. They were jostling for a rebound off a missed 3-pointer by Siakam, and Martin was whistled for a foul. Koloko wound up on the floor, and Martin stepped toward him as the Raptors’ rookie quickly bounced to his feet.\n\n\r\n              In a flash, they were tangled, Martin appearing to drive Koloko into a row of seats that toppled backward. Players from both teams quickly rushed to that spot, which was just a couple of feet in front of the Heat bench. The game was stopped for several minutes while referees reviewed the play and crews used towels to mop up the area.\n\n\r\n              “There was a lot of plays leading up to it,\" Martin said. “It was a chippy game.\"\n\n\r\n              Said Koloko: “I just stood up for myself and I get ejected. That's what happened.\"\n\n\r\n              Toronto coach Nick Nurse said he expects the NBA to take a longer look at what happened.\n\n\r\n              “Several people were in that thing that probably shouldn't have been,\" Nurse said.\n\n\r\n              Miami led 81-59 at the time; the Raptors outscored the Heat 17-2 over the next 5:11, and Toronto didn’t go away.\n\n\r\n              Siakam’s basket with 1:04 left got Toronto to 109-103, but Lowry drove the lane and scored on the ensuing possession to help ensure that Miami would escape.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Chris Boucher and Otto Porter Jr. were both out with strained left hamstrings. Nurse expects Boucher to play Monday. ... Scottie Barnes was shaken up twice in the first half; first he banged his left shoulder, then sprained his right ankle through the second quarter and was ruled out. More tests are expected, and he's not likely to play Monday. ... The season’s first back-to-back wasn’t easy. Toronto lost in Brooklyn on Friday night, got into Miami around 2:45 a.m. Saturday and the hotel arrival was after 3 a.m.\n\n\r\n              Heat: Victor Oladipo (left knee) and Omer Yurtseven (left ankle) remained sidelined. Neither has played this season. ... It was Lowry’s second time facing the Raptors since he left Toronto for Miami. He played once at Toronto last season. ... The Heat avoided what would have been their first 0-3 start since 2007-08.\n\n\r\n              FRED’S FOULS\n\n\r\n              Raptors guard Fred VanVleet had an odd first half: four fouls, zero points. Not surprisingly, that was a first for him. He became the 12th player in Toronto history to post the dubious and unique statline. And then he got his fifth 20 seconds into the third quarter, fouling Lowry on a 3-point attempt.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993998.931595
}