{
  "game_id": "0022000245",
  "espn_id": "401267405",
  "date": "Jan 23, 2021",
  "matchup": "LAL @ CHI",
  "headline": "Davis scores season-high 37 as Lakers beat Bulls 101-90",
  "body": "CHICAGO -- — Anthony Davis missed seeing his family members in the stands. They would have witnessed quite a performance had they been allowed in the arena.\n\n\r\n                    Davis dominated with a season-high 37 points against his hometown team, LeBron James added 17 points and 11 rebounds and the Lakers beat the Chicago Bulls 101-90 on Saturday.\n\n\r\n                    The defending NBA champions improved to 9-0 on the road and a league-best 13-4 overall. And this one never was in doubt.\n\n\r\n                    Davis scored 26 points in the highest scoring half by a Laker this season as Los Angeles grabbed a 63-33 lead. The seven-time All-Star shot 14 of 21, nailing two 3-pointers, and grabbed six rebounds.\n\n\r\n                    “It's tough. Usually, when I come home I get to see my family,” he said. “They come to the games and support me. Being in the Western Conference my entire career so far, I only come home once during the season. I miss seeing them in the stands and coming out and cheering me on, supporting me. That was different.”\n\n\r\n                    James, coming off a season-high 34-point outing in a win at Milwaukee two nights earlier, had six assists and six turnovers. And the Lakers won their eighth in a row against Chicago.\n\n\r\n                    The Bulls had won three in a row and matched a franchise record by scoring 115 or more in seven straight games. But against stingy Los Angeles, they struggled, particularly in the early going.\n\n\r\n                    Zach LaVine led Chicago with 21 points and 10 rebounds. Coby White added 14 points and seven rebounds. \n\n\r\n                    “The first half, we just did not play to our identity like we had been trying to play to,” coach Billy Donovan said. “I thought we penetrated and we charged too much. We didn't find open people when they were there. They were really coming in and protecting the paint. We had some turnovers, gave up some offensive rebounds. The first half, it wasn't who we've been.”\n\n\r\n                    DOMINANT START\n\n\r\n                    The Lakers held off the Bulls 117-115 in Los Angeles two weeks earlier with Davis and Kentavious Caldwell-Pope missing the game because of injuries. Los Angeles wasted no time taking control in this one.\n\n\r\n                    Davis came in averaging 21.1 points — down five from last season. But he set the tone as the Lakers raced out to a 20-6 lead. He scored 13 of Los Angeles' first 16 points, with three dunks in that stretch. \n\n\r\n                    “We want to make sure we're playing through him as much as possible,” coach Frank Vogel said. “We have a lot of new guys on this team, so there's been times early in the season where myself and even AD has been trying to get other guys comfortable. We knew this week, the beginning of this trip, was a time to really start having him be more assertive.”\n\n\r\n                    Davis also made two 3-pointers late in the half, including one in the closing minute to make it 61-31. And after Chicago's Coby White hit a pull-up jumper, Dennis Schroder drove for a layup to bump the lead back to 30.\n\n\r\n                    The Bulls went on a 14-2 run late in the third quarter to pull within 79-66. But back-to-back baskets by Davis made it a 17-point game heading to the fourth.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Davis' previous season high was 34 points against San Antonio on Jan. 1. He scored a career-high 59 for New Orleans at Detroit on Feb. 21, 2016. ... The Lakers were 4 for 19 on 3-pointers after tying a season-high by making 19 of 37 against Milwaukee. ... F Jared Dudley (sore right calf) remains a “game or two” away from returning from an injury that has kept him out the past seven, Vogel said.\n\n\r\n                    Bulls: Chicago shot 39 about percent from the field and made 8 of 25 3-pointers. ... Coach Billy Donovan said C Wendell Carter Jr. (quad) is improving, though he's not sure if he'll be available Monday against Boston after missing the past two games. “He's made progress. He is feeling better,” Donovan said. ... The Bulls also held out Otto Porter Jr. after he played the previous night at Charlotte.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: The Lakers visit Cleveland on Monday, their third in a seven-game trip.\n\n\r\n                    Bulls: Chicago hosts Jaylen Brown, Jayson Tatum and the Celtics.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997325.6032152
}