{
  "game_id": "0022000327",
  "espn_id": "401267487",
  "date": "Feb 03, 2021",
  "matchup": "CHA vs. PHI",
  "headline": "Embiid, 76ers continue dominance of Hornets, win 118-111",
  "body": "CHARLOTTE, N.C. -- — Joel Embiid and the Philadelphia 76ers overpowered the Charlotte Hornets — again. \n\n\r\n                    Embiid had 34 points and 11 rebounds, and the 76ers beat the Hornets 118-111 on Wednesday night for their fourth straight win.\n\n\r\n                    Tobias Harris scored 26 points and Ben Simmons added 15 points and nine assists for the 76ers, who stretched their winning streak against the Hornets to 14 games, tied for the longest active streak in the NBA. The Clippers have also won 14 straight against the Magic.\n\n\r\n                    Almost every time the 76ers needed a bucket, they went to Embiid — and more often than not, he responded with mid-range jumpers or by getting to the foul line. The Eastern Conference player of the month finished 11 of 18 from the field and was 9 of 10 from the foul line.\n\n\r\n                    Hornets forward Miles Bridges said Embiid is “unguardable\" right now.\n\n\r\n                    “I don’t think there is anybody in this league that can guard him when he’s hitting shots from 3 and especially when he’s in the post,\" Bridges said. \"We tried to send double teams and he was hitting turnaround fadeaways. It’s tough, that’s why he’s the top MVP candidate right now, and he’s playing at a very high level. It’s tough to stop him.”\n\n\r\n                    Gordon Hayward and LaMelo Ball each had 22 points for the Hornets, who had their three-game winning streak snapped.\n\n\r\n                    Hornets coach James Borrego said earlier in the day on local sports talk radio that he expected his team to come out with plenty of energy knowing their history against the 76ers.\n\n\r\n                    Instead, Charlotte shot 22.7% from field in the first quarter and fell behind 30-13.\n\n\r\n                    The 76ers stretched the lead to 26 in the third quarter before the Hornets started to get hot from beyond the arc and battled back to cut the deficit to seven with two minutes left. But Danny Green knocked down a 3 from the right corner and Simmons added a driving layup to keep the Hornets at bay.\n\n\r\n                    “You’ve got to give them credit, they’re a heck of a defense,\" Borrego said. “Obviously, they’ve given us trouble over the years defensively with their length and size. … They give us nothing easy at the rim, they take away a lot of our pick-and-roll game, our spread game.”\n\n\r\n                    HARRIS' EURO STEP MOVE\n\n\r\n                    Harris said he's been working on his Euro step, and he broke it out against the Hornets on one drive. \n\n\r\n                    “Just getting downhill and making good decisions when I'm there,\" Harris said. \"The next thing is drawing more contact and fouls when I'm down there. And I have been looking for ways to do that.”\n\n\r\n                    SIMMONS IN THE POST\n\n\r\n                    The 76ers used Simmons in the low post at times, particularly coming out of timeouts. That allowed him to use his court vision and pass out of double teams and find teammates for open looks.\n\n\r\n                    “We’re adding it in for sure,\" coach Doc Rivers said. \"You have to pick your poison. If you’re doubling Ben, you’re asking for trouble with his passing ability.”\n\n\r\n                    HORNETS SYNERGY\n\n\r\n                    Borrego likes the synergy that Ball and Bridges have developed together as they continue to combine for highlight reel alley-oop dunks. On one fast-break possession, Ball fed Bridges a behind-the-back pass which he finished with a windmill dunk.\n\n\r\n                    “I think they play off each other very nicely,” Borrego said. “Especially Miles’ ability to roll and play in transition with LaMelo is important for us and they’ve hit it off.”\n\n\r\n                    TIP INS\n\n\r\n                    76ers: It wasn't much of a homecoming for Charlotte native Seth Curry, who played 16 minutes in the first half and did not attempt a shot. He took three shots in the second half and missed them all. ... Harris was 9 of 9 from the foul line.\n\n\r\n                    Hornets: Ball got his second NBA start with Terry Rozier still out with a sprained ankle. Forward P.J. Washington (foot) also sat out with Bridges getting the start. ... Held to a season-low 42 points in the first half. ... Borrego got his first technical foul of the season in the third quarter. ... Devonte Graham had 18 points but struggled from 3-point range (2 of 11). \n\n\r\n                    UP NEXT\n\n\r\n                    76ers: Return home to host the Blazers on Thursday night.\n\n\r\n                    Hornets: Homestand continues Friday night against the Jazz.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997032.415006
}