{
  "game_id": "0021500254",
  "espn_id": "400828141",
  "date": "Nov 30, 2015",
  "matchup": "HOU @ DET",
  "headline": "Jackson and Drummond lift Pistons over Rockets",
  "body": "AUBURN HILLS, Mich. --  It might have gotten lost in an endless parade of free throws, but Monday night proved something important about the Detroit Pistons.\n\nWhen they hit jump shots, they win. When they don't, they lose. At times, it is really that simple.\n\n\"Wow, we really shot the ball well tonight, didn't we?\" asked Reggie Jackson, sitting at his locker and reading a box score. \"We won the rebounding battle, and I like to see 22 assists and 11 turnovers, but that's great shooting.\"\n\nThe Pistons shot 52.9 percent from the floor in a 116-105 win over the Houston Rockets, including 35 percent on 3-pointers. They were spectacular in the first half, scoring 64 points, struggled in the third quarter, but finished the game with a 32-point fourth.\n\n\"We played great offense all night, and we played great defense in the first half,\" Pistons coach Stan Van Gundy said. \"We didn't play much defense in the second half, but we closed out the win, and I'll take that.\"\n\nThe Pistons led by as many as 28 in the first half, and were still up 64-41 at the intermission.\n\n\"We're playing with fire when we keep giving teams these big leads,\" Rockets coach J.B. Bickerstaff said. \"You put so much pressure on your defense and so much pressure on your offense that you have to play an almost perfect game to have a chance.\"\n\nDetroit's third-quarter offensive slump had very little to do with jump shots and a lot to do with Andre Drummond's inability to hit free throws. The Rockets sent Drummond to the line 14 times in the quarter, including 12 times in a span of 2:20. He made only three of those 12 before Van Gundy had to have his team commit a foul in order to get Aron Baynes onto the floor.\n\n\"If we're playing defense, I can keep him out there if he's making one out of two -- our defense can keep us in the game if we're getting one point per possession,\" Van Gundy said. \"But he went four for 18 tonight, and you can't win when you are getting four points on nine possessions. I had to get him out.\"\n\nThe strategy worked, as Houston brought Detroit's offense to a halt, and were able to pull within 84-73 by quarter's end. The Rockets then scored the first seven points of the fourth, making it 84-80 with 10:45 to play.\n\nDetroit, though, responded with five quick points to take a nine-point lead. Houston went back to fouling Drummond in the last five minutes, but he only missed three straight before Gundy got Baynes into the game.\n\nThe Pistons maintained control, even after Jackson's rookie mistake of fouling Harden on a 3-pointer, giving him a four-point play. When Drummond returned with 1:54 left, the Pistons lead 108-100 and held on for the win.\n\nJackson finished with 31 points, while Drummond had 24 points and 13 rebounds and Stanley Johnson added 19 points and a career-best 10 rebounds.\n\nJames Harden had 29 points, but made just six of 15 field goals against Kentavious Caldwell-Pope.\n\nHouston lost despite getting a perfect start, as Drummond picked up a pair of avoidable fouls in the first three minutes, both while guarding Dwight Howard, and went to the bench. Aron Baynes, though, had eight points and three rebounds in the next 12 minutes as the Pistons pulled out to a 16-point lead.\n\nMoments after Drummond returned, he blocked Howard's dunk, bringing a roar from the Palace crowd. Johnson followed with a high-arcing layup over Howard, making it 44-25.\n\n\"We have to figure out how to start games better,\" Howard said. \"We need to come out and play better defense, but this is a trend. We just don't get off to a good start.\"\n\nTIP-INS:\n\nRockets: Harden has scored 105 points in Houston's last three games.  ... Houston had won two straight after losing seven of eight.\n\nPistons: Morris left the game in the second quarter after injuring his back in a collision with Drummond, but returned late in the period after being stretched out by the training staff. . According to STATS, Drummond's 10 missed free throws in the third quarter matched the second most since 2002-03, but not the most by a Piston -- Ben Wallace went 5-for-20 in the fourth quarter of a 109-101 win over the Los Angeles Clippers on Dec. 11, 2005. DeAndre Jordan also missed 10 in a quarter against San Antonio last season.\n\nUP NEXT:\n\nRockets: Host the Pelicans on Wednesday.\n\nPistons: Host the Suns on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994659.465649
}