{
  "game_id": "0022000425",
  "espn_id": "401267585",
  "date": "Feb 15, 2021",
  "matchup": "MIA @ LAC",
  "headline": "Morris comes up big in Clippers' 125-118 win over Heat",
  "body": "LOS ANGELES -- — Marcus Morris had season highs of 32 points and six 3-pointers, and the Los Angeles Clippers beat the Miami Heat 125-118 on Monday night for their fourth straight victory.\n\n\r\n                    The Clippers won without four starters, including Kawhi Leonard and Paul George, who were out for the second straight night because of injuries. \n\n\r\n                    “A total team effort. We kept grinding,” Clippers coach Tyronn Lue said. \n\n\r\n                    Morris recorded a season-high 23 points during Sunday's win over Cleveland and he came back strong, scoring 26 in the first half. He was making a rare start with most of the regulars out.\n\n\r\n                    “I'm a hooper. Whatever you need me to do,” Morris said. “I don’t just be talking.”\n\n\r\n                    The Clippers have won eight of 11.\n\n\r\n                    Jimmy Butler had 30 points, 10 rebounds and 10 assists for the Heat. He made all 10 of his free throws. Bam Adebayo added 27 points and 12 rebounds, and reserve Tyler Herro scored 27 points.\n\n\r\n                    “I'm not going to say we gave one away, we didn’t deserve to win,” Butler said. “We weren't protecting the paint or rotating or running them off the line to make them miss. They were just comfortable the whole game.”\n\n\r\n                    Ivica Zubac added 22 points for the Clippers. Lou Williams had 18 points and 10 assists, and two-way player Amir Coffey had a season-high 15 points and a career-high five 3-pointers. Coffey was in the G League a few days ago, and made 14 3s in his last game there.\n\n\r\n                    “When you're short-handed, you really find out what your team is made of,” said Terrance Mann, who added 15 points. “It brings your team closer.”\n\n\r\n                    Los Angeles had 31 assists for the second straight game, something the franchise hasn't done since December 2014.\n\n\r\n                    “Sharing the basketball, getting into the paint and making a play for your teammate, we did it all night long,” Lue said. “It’s fun playing that way.”\n\n\r\n                    The Clippers led by one heading into the fourth. They got back-to-back 3-pointers by Luke Kennard and Mann dunked to push their lead to 11 points. \n\n\r\n                    Herro hit his fourth 3-pointer and followed with a basket to draw the Heat to 121-116 before the Clippers controlled the final seconds.\n\n\r\n                    “We had some breatkdowns. They capitalized on the important ones at swing moments of the game,” Heat coach Erik Spoelstra said. “We just did not do things well enough, consistently enough.”\n\n\r\n                    Williams' slick behind-the-back pass to Reggie Jackson gave the Clippers a nine-point lead in the third. Miami ran off 10 straight points, capped by Herro's 3-pointer, to go back in front 76-75. Neither team led by more than three points the rest of the quarter. Coffey's fifth 3-pointer put the Clippers ahead 92-91 going into the fourth.\n\n\r\n                    The Clippers outscored the Heat 20-9 to open the second quarter, using runs of 7-0 and 11-0 that were highlighted by four 3-pointers from Coffey to take a 53-44 lead.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Fell to 4-9 on the road. ... They've dropped nine of their last 14. ... They were without Avery Bradley (right calf strain), Goran Dragic (left ankle sprain), Meyers Leonard (left shoulder surgery) and Chris Silva (left hip flexor strain).\n\n\r\n                    Clippers: Williams had 10 assists in back-to-back games for the second time in his career. ... Improved to 3-1 this season with Leonard and George out. ... Nicolas Batum sat out with a migraine and Patrick Beverley rested on the second night of a back-to-back. ... Have won five in a row over the Heat. ... George watched the game in shorts and a sweatshirt. \n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Visit Golden State on Wednesday.\n\n\r\n                    Clippers: Host Utah on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996799.609313
}