{
  "game_id": "0021500669",
  "espn_id": "400828556",
  "date": "Jan 25, 2016",
  "matchup": "CHI vs. MIA",
  "headline": "Wade, Bosh spark Heat to 89-84 comeback win over Bulls",
  "body": "CHICAGO -- The Windy City is starting to feel like home again for Dwyane Wade.\nWade had 28 points, Chris Bosh added 18 and the Miami Heat rallied from an eight-point deficit early in the fourth quarter for an 89-84 victory over the Chicago Bulls on Monday night, snapping a four-game losing streak.\nWade scored 10 in the fourth quarter. He and Bosh combined for the last five points in the final 1:02 as Miami snapped an 84-all tie.\n\"Early in my career, I always struggled here,\" said Wade, who grew up in Chicago. \"I think of late, the place is like a regular game, even though it's always special being back and seeing my family members.\n\"I felt good, but most importantly it gave us a win, something we haven't had in the last four games.\"\nPau Gasol had 19 points and 17 rebounds to lead the Bulls. Jimmy Butler scored 13 on 5-for-15 shooting.\nChicago, coming off a win at Cleveland on Saturday, has dropped four straight home games.\n\"We had some good stretches,\" coach Fred Hoiberg said. \"The fourth quarter got tough and we didn't handle it well.\"\nBulls guard Derrick Rose didn't play in the second half because of lower back and right hamstring injuries. Aaron Brooks took Rose's place with the starting unit.\nThe Bulls were already playing without backup guards Kirk Hinrich (bruised left quadriceps) and E-Twaun Moore (right hamstring strain).\n\"Derrick, he was great this morning,\" Hoiberg said. \"Something happened from shootaround to game time. We had to sit him, but next man up. We have to come in and perform.\"\nDespite playing without Rose, the Bulls opened the second half with a 13-2 run to grab a 60-51 lead with just more than 7 minutes left in the third. Chicago held Miami to 12 points in the quarter to take a 68-61 advantage into the fourth.\nThe Bulls still had a 73-65 edge 2 minutes into the quarter when the Heat scored nine straight points to grab a 74-73 lead with just more than 7 minutes to play.\nChicago then snapped a scoreless drought of 3:20 to regain a 75-74 lead when Brooks fed Doug McDermott for a fast-break layup with 6 minutes to go.\nWade and Bosh decided the game with a pair of open jumpers on pick-and-roll plays. Bosh gave the Heat the lead for good with an 18-footer with 1:02 to play, and Wade followed with a 16-footer on the next possession.\nWade closed the scoring with a free throw in the final seconds.\n\"We gutted it out tonight,\" Miami coach Erik Spoelstra said. \"We played under control and that win doesn't happen without a good defensive effort. That's a good win for us.\"\nTIP-INS\nHeat: F Luol Deng (right eye) returned after missing the previous game. \"His eye was troublesome for a couple of days, but he's healed quickly,\" Spoelstra said. ... F Chris Andersen (sore left knee), G Goran Dragic (strained left calf), F Josh McRoberts (bruised right knee) and C Hassan Whiteside (strained left hip) all sat out.\nBulls: F Mike Dunleavy, who has yet to play this season following offseason back surgery, is working out with the team and said following the morning shootaround that he hopes to return sometime in February. \"Going through the process, backs are tricky,\" he said. \"They have a mind of their own and it just didn't go the way I wanted it to. But I'm in a good spot, hopeful for what's coming ahead.\"\nBAND OF BROTHERS\nDeng, who spent the first nine-plus years of his career with the Bulls, said he still follows his former team.\n\"The crazy thing is, except when we play them, whenever I watch these guys play I find myself rooting for them because -- obviously, I played with them -- but they're like my brothers,\" he said.\nUP NEXT\nHeat: Visit the Brooklyn Nets on Tuesday.\nBulls: Visit the Los Angeles Lakers on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764993920.931177
}