{
  "game_id": "0021500082",
  "espn_id": "400827969",
  "date": "Nov 06, 2015",
  "matchup": "DET @ PHX",
  "headline": "Marcus Morris helps Pistons best former team with 20-point night",
  "body": "PHOENIX -- Marcus Morris thinks the Phoenix Suns' fans need a few lessons in how to boo a player. Their Detroit counterparts could teach them how it's done.\n\"It was light,\" he said. \"If it was in Detroit, it would have been better, louder. They don't even know what they are doing. They don't even know why they are booing. They are just booing. I thought it would be a little better than that.\"\nMorris scored 20 points to help the Pistons beat his former team 100-92 on Friday night.\nMorris had repeatedly expressed his disdain for the Suns organization and said he was \"disrespected\" when he was sent to the Pistons, splitting him and twin brother Markieff in the process. So for a while in the game, Marcus was booed every time he touched the ball.\n\"It was cool, man,\" he said. \"I had a good time, even better time since we got the W. My teammates held it down for me. They knew how much it meant for me.\"\nMarkieff, who scored 18 points for the Suns, said it was only the second time he had played against his brother.\n\"It was different,\" he said, \"but that's how it goes.\"\nAs for booing Marcus, Markieff said, \"They boo me; why wouldn't they boo him?\"\nReggie Jackson scored 14 of his 23 points in the fourth quarter for Detroit, and Kentavious Caldwell-Pope added 18.\nEric Bledsoe and Brandon Knight scored 22 points apiece for the Suns, who trailed throughout after the game's early moments. Bledsoe fouled out with 1:47 to play.\nAndre Drummond had 12 points and 16 rebounds for the Pistons but was 2-of-13 from the free throw line.\nThe victory put Detroit at 4-1 for the first time since 2008.\n\"It was really satisfying,\" Pistons coach Stan Van Gundy said. \"Again, I thought our defense was really, really good.\"\nPhoenix trailed 42-40 at halftime and almost caught the Pistons in the third quarter.\nEx-University of Arizona star Stanley Johnson made one of two free throws, Alex Len lost control of the dribble for a turnover and Marcus Morris scored on a breakaway dunk, putting the Pistons up 67-63 entering the fourth quarter.\nThe Detroit run reach 9-0 when Anthony Tolliver's 3-pointer made it 74-63 with 10:02 to play. Jackson scored eight consecutive points late to put the game away.\nAt times in the second half, Suns coach Jeff Hornacek walked in front of the bench obviously upset by the play. He said some veterans who should know plays by now apparently didn't.\n\"Our concentration level tonight probably wasn't what it should have been,\" he said.\nMIFFED MARCUS\nAt the morning shootaround, Marcus Morris made certain reporters knew he hadn't softened his feelings toward the Suns.\n\"I felt disrespected the entire time I was in Phoenix,\" Morris said. \"I was playing well, but I still feel like I didn't have a real opportunity to grow.\"\nHe said he didn't think his brother \"looked very happy\" playing with the Suns.\nAnd he looked forward to the game.\n\"Anytime a team trades you away like that, it's a slap in the face,\" Morris said. \"I still feel disrespected, and I feel like I want to disrespect them.\"\nThe twins shook hands and hugged each other just before the opening tip.\nWINGS WEST\nThe Pistons play six games in 10 days in the West, all against teams from the Pacific Division.\nAfter Phoenix, there are stops in Portland, Golden State and Sacramento before finishing in San Francisco. The Suns finish the trip with games against the Clippers and Lakers on consecutive days.\nTIP-INS\nPistons: Detroit has held all five of its opponents to fewer than 95 points. ... Detroit missed its first eight shots. .... Drummond drew his fourth foul when Len tried to dunk on him late in the third quarter. ... Marcus Morris hit a 3-pointer over Markieff in the second quarter. Marcus also scored over Markieff on a physical play under the basket in the third quarter. ... Early in the third quarter, Marcus got a breakaway dunk after Markieff's turnover. In the fourth, Markieff picked off Marcus' pass.\nSuns: Phoenix had more turnovers (16) than assists (14). ...The Suns missed their first seven shots of the second half. ... T.J. Warren had a spectacular dunk at the rim on a rebound of Knight's miss in the second quarter.\nUP NEXT\nPistons: Visit Portland on Sunday.\nSuns: Visit Oklahoma City on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994960.186004
}