{
  "game_id": "0021600862",
  "espn_id": "400900268",
  "date": "Feb 24, 2017",
  "matchup": "DAL @ MIN",
  "headline": "Towns, Wiggins help Wolves beat Mavericks 97-84",
  "body": "MINNEAPOLIS --  For a guy who spent the week engulfed in trade rumors, Ricky Rubio looked right at home in Minnesota.\n\nNo time to worry about speculation. The Timberwolves need him and the rest of their young core if they're going to make a playoff push.\n\nKarl-Anthony Towns had 26 points and 18 rebounds, and Andrew Wiggins scored 27 points to help the Timberwolves beat the Dallas Mavericks 97-84 on Friday night.\n\nRubio added 13 points and 14 assists a day after the Timberwolves declined an opportunity to trade him to the New York Knicks for Derrick Rose. The Wolves shot 52.6 percent to pull within 2 1/2 games of Denver for the eighth seed in the Western Conference.\n\nWhen asked how he was able to refocus after all that had happened on Thursday with the trade talks, Rubio deadpanned, \"What happened? Nothing happened, right?\"\n\nTowns had seven turnovers, but scored 14 of his points in the fourth quarter to turn back the Mavericks.\n\nSeth Curry scored a career-high 31 points, and Harrison Barnes added 20 points and six rebounds for Dallas. Dirk Nowitzki was just 4 for 14, and Wes Matthews was 2 for 9 as the Mavs dropped three games back of the Nuggets.\n\n\"I thought they played with more overall force for the sum total of the game,\" Mavericks coach Rick Carlisle said. \"That can't happen, especially on the road. We've just got to do better in a lot of little areas.\"\n\nThe Mavericks acquired Nerlens Noel from Philadelphia on Thursday, but he wasn't able to join the team in time for the game. They sure could have used him.\n\nMinnesota outscored Dallas 48-30 in the paint, with Wiggins and Towns attacking the rim all game long. Wiggins scored 16 points in the first quarter and Towns exploited the undersized Mavericks in the second half. Even Rubio got into the act, going behind his back on a dribble and scoring with the right hand to give the Wolves a 90-80 lead with three minutes to play.\n\n\"Ricky is a big part of our team, not even just from a skill and leader standpoint. But just morale,\" Towns said. \"Seeing him in the locker room picks us up.\"\n\nCurry tried to keep Dallas in it with his shooting, but he didn't have much help. Nowitzki air-balled a wide open 3 and clanked another great look in the fourth quarter. He missed all four of his shots from long range and finished with eight points.\n\n\"It's unfortunate games like that have to go with a loss,\" Barnes said. \"I think we as a team need to do a better job of, when a guy's rolling like that, give him more support.\"\n\nTIP-INS\n\nMavericks: Curry's previous career-high was 24 points against San Antonio on Jan. 29. ... The Mavericks entered the night leading the NBA with just 11.6 turnovers per game. They committed 16, which led to 18 points for Minnesota. ... Devin Harris had eight points off the bench, and his 3 tied it at 75 with eight minutes to go, but the Wolves finished the game on a 22-9 burst.\n\nTimberwolves: Wiggins topped 20 points for the 16th straight game, which ties a franchise record. ... PF Adreian Payne was back with the team for the first time since Feb. 1. Payne had been at home after being diagnosed with a blood disorder that hindered clotting. He still has not been cleared for contact but did participate in the morning shootaround.\n\nTEMPERS FLARE\n\nTowns and Harris were issued technical fouls in the third quarter after a heated confrontation. Harris took exception to a shot to the ribs and shoved Towns back. The two jawed at each other as teammates stepped between them and Towns waved his arms to the crowd as he went back to the bench.\n\n\"I have a lot of respect for Devin,\" Towns said.\n\nNOEL'S DEBUT\n\nCarlisle said Dallas has been talking with Philadelphia for most of the season about acquiring Noel to bolster the team's athleticism and rim protection in the frontcourt. The deal was completed on Thursday, a few hours before the deadline. Carlisle said he would likely make his Mavericks debut on Saturday at home against the Pelicans.\n\nUP NEXT\n\nMavericks: Dallas heads back home to host New Orleans on Saturday in the Pelicans' second game since acquiring DeMarcus Cousins.\n\nTimberwolves: Minnesota heads to Houston on Saturday to start a four-game trip.",
  "source": "espn_api",
  "crawled_at": 1764996115.430859
}