{
  "game_id": "0022300767",
  "espn_id": "401585395",
  "date": "Feb 12, 2024",
  "matchup": "MIL vs. DEN",
  "headline": "Antetokounmpo posts 36 points, 18 rebounds, Bucks flex defensive muscle in 112-95 win over Nuggets",
  "body": "MILWAUKEE -- — The Milwaukee Bucks believed their defense was improving, even as they struggled to win games immediately after new coach Doc Rivers’ arrival.\n\n\r\n              Now they’re producing results to back that up.\n\n\r\n              Giannis Antetokounmpo had 36 points, 18 rebounds and five assists as the Bucks showcased their improved defense by trouncing the Denver Nuggets 112-95 on Monday night. For the first time all season, the Bucks have allowed fewer than 100 points in back-to-back games.\n\n\r\n              “Right now, we are trying to kind of help one another defensively and just make it as tough as possible,\" Antetokounmpo said. “This is team defense. Nobody can do it by himself. Right now, I feel like we are buying into that philosophy as a team.”\n\n\r\n              After losing five of their first six games under Rivers — including a 113-107 defeat at Denver in his debut with Milwaukee — the Bucks have won two straight by a combined margin of 53 points.\n\n\r\n              This blowout of the reigning NBA champions followed Milwaukee’s most lopsided victory of the season, a 120-84 rout of the Charlotte Hornets.\n\n\r\n              “Our entire staff, they're doing a great job of just calling everything out,” Damian Lillard said. “They're challenging us in a lot of different ways — our communication, how physical we are, how we carry ourselves as a group. We're trying to find our identity. Who do we want to be?”\n\n\r\n              Nikola Jokic had 29 points, 12 rebounds and eight assists for the Nuggets, but he didn’t get nearly enough help on a night when two teammates left with injuries. Aaron Gordon scored 14 and Michael Porter Jr. had 11.\n\n\r\n              Denver’s Jamal Murray scored three points in 18 minutes before sitting out the second half due to shin splints. And, Kentavious Caldwell-Pope played just nine minutes before leaving with tightness in his right hamstring, an issue that had caused him to miss the Nuggets’ last two games.\n\n\r\n              Lillard scored 18 points for the Bucks, and Bobby Portis added 13 before getting ejected with 4:54 remaining. Antetokounmpo's 18 rebounds matched his season high.\n\n\r\n              The Nuggets lost their second in a row. They were playing three nights after a 135-106 loss at Sacramento that snapped a three-game winning streak.\n\n\r\n              “I think for me as a head coach, I’ve got to make sure I am not overreacting and panicking while also that delicate balance of holding (them) accountable and letting them know how we’re playing right now these last two games is not good enough,\" Nuggets coach Michael Malone said. “We’ve got an opportunity to go home and right the ship before we go into the break.”\n\n\r\n              Denver fell behind 13-2 in the first 4½ minutes, but clawed back and led 23-21 after Reggie Jackson’s layup with 1:50 left in the first quarter.\n\n\r\n              But the Nuggets got just one more basket during a stretch lasting nearly seven minutes as the Bucks went on a 22-3 run to grab a 43-26 advantage.\n\n\r\n              Milwaukee pulled ahead by scoring the last seven points of the first quarter while Antetokounmpo and Lillard were on the bench after picking up two early fouls. The Bucks then scored the first seven points of the second period as Antetokounmpo opened the period with a one-handed slam off a pass from Pat Connaughton.\n\n\r\n              The Bucks closed the 22-3 spurt with a Portis one-handed dunk on a pass from Lillard. Milwaukee led by as many as 22 in the second quarter and went into halftime up 60-44.\n\n\r\n              Milwaukee extended the lead to 28 in the final minute of the third quarter on another Portis dunk. That dunk led to the first of Portis’ two technical fouls, which resulted in his ejection.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the Miami Heat on Tuesday.\n\n\r\n              Nuggets: Host the Sacramento Kings on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996116.596949
}