{
  "game_id": "0022300609",
  "espn_id": "401585237",
  "date": "Jan 22, 2024",
  "matchup": "TOR vs. MEM",
  "headline": "Jaren Jackson Jr. has 27 points, career-high six steals as Grizzlies beat Raptors 108-100",
  "body": "TORONTO -- — Jaren Jackson Jr. scored 16 of his 27 points in the first quarter, Luke Kennard added a season-high 19 points, and the Memphis Grizzlies won their fourth straight north of the border, beating the slumping Toronto Raptors 108-100 on Monday night.\n\n\r\n              Vince Williams Jr. had 18 points and 10 rebounds, and Santi Aldama scored 10 points before leaving because of a sore right knee as the short-handed Grizzlies won for the second time in their past six games.\n\n\r\n              “We just finished the game this time,” Williams said. “We just came out, played hard, got a lot of transition points and made them shoot tough shots all night.”\n\n\r\n              Jackson finished with a career-high six steals, all in the first quarter, as the veteran big man wasted no time breaking his previous mark of five.\n\n\r\n              “That’s amazing,” Williams said. “Just him being active, being long and getting deflections at a high level.”\n\n\r\n              Jackson shot 12 of 22 and had five assists and one block.\n\n\r\n              “I thought he was great on both sides of the floor,” Grizzlies coach Taylor Jenkins said. “Obviously, he allowed us to build a nice lead. His defensive presence was definitely impactful.”\n\n\r\n              The Grizzlies never trailed and their biggest lead was 19 points as they improved to 12-12 on the road. Memphis is 4-15 at home, one year after going an NBA-best 35-6 on their own court.\n\n\r\n              “We’ve got to bottle something up here on the road and take it back home,” Jenkins said.\n\n\r\n              RJ Barrett scored 29 points for Toronto, and Scottie Barnes had 22 points and 12 rebounds. Immanuel Quickley had 10 assists but shot 3 for 13 and scored eight points as the Raptors lost for the eighth time in 10 games.\n\n\r\n              Quickley had 26 points when Toronto won at Memphis on Jan. 3.\n\n\r\n              “I thought our guys did a really good job on Quickley,” Jenkins said. “He really hurt us in the first game.”\n\n\r\n              The Grizzlies played without three of their top four scorers. Ja Morant served a 25-game suspension for off-the-court behavior to start the season before suffering a season-ending shoulder injury. Marcus Smart (finger) and Desmond Bane (ankle) are expected to miss at least another month.\n\n\r\n              Toronto lost its third straight since trading two-time All-Star Pascal Siakam to Indiana last week. Siakam didn’t play on Jan. 17, when Toronto beat visiting Miami. The deal was announced after the game and the Raptors haven’t won since. They lost at home to Chicago on Thursday and were blown out at New York on Saturday.\n\n\r\n              Jackson connected on 7 of 8 attempts in the first as Memphis led 30-25 after one. Thanks to Jackson’s steals, the Grizzlies scored 10 points off eight Toronto turnovers in the opening quarter.\n\n\r\n              “It’s a question of focus and it’s a question of bringing that effort to the game,” Raptors coach Darko Rajakovic said. “That was lacking for the start of the game.”\n\n\r\n              Memphis stretched its lead to 53-46 at the half. The Grizzlies were up 85-71 after three.\n\n\r\n              Toronto center Jakob Poeltl missed his eighth straight game because of a sprained left ankle. Before tipoff, Rajakovic said he expects Poeltl back “very soon.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit Miami on Wednesday night.\n\n\r\n              Raptors: Host the Los Angeles Clippers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995417.091517
}