{
  "game_id": "0021500551",
  "espn_id": "400828438",
  "date": "Jan 09, 2016",
  "matchup": "CHI @ ATL",
  "headline": "Horford, Millsap lead Hawks past Bulls 120-105",
  "body": "ATLANTA -- Al Horford thinks the Atlanta Hawks are finally showing how good they can be.\n\"Moving the ball, hustling on defense and trying to do it consistently -- as a team I feel like we have some lapses in those areas,\" Horford said. \"When we're able to be more consistent on the defensive end, we're just a totally different team.\"\nHorford scored a season-high 33 points and had 10 rebounds, Paul Millsap added 18 points and the Atlanta Hawks beat the Chicago Bulls 120-105 on Saturday night.\nJimmy Butler scored 14 of his 27 points in the third quarter and Nikola Mirotic had 24 points for Chicago, but the Bulls ended a six-game win streak.\n\nMike Scott had 14 points and Dennis Schroder and Kyle Korver each scored 13 to help the Hawks lead throughout. Atlanta has won two straight after dropping three of four.\n\"We kind of get it going and then we lose a couple, that type of thing,\" Horford said. \"I think we need to just focus on the next game. We can't look too far ahead. I feel like when we start having success then maybe we do that a little bit and then we get in trouble and lose a couple in a row.\"\nFor the first time since beating Oklahoma City on Nov. 30, Atlanta finally got a signature win entering a three-day break.\nThe Hawks improved to 23-15 and are tied for the second-most victories in the Eastern Conference, but they haven't been able to play consistently at the high level that pushed them to a No. 1 seed last season.\nAt least for one night, they did.\nAtlanta led by 19 points in the second quarter on Scott's 3-pointer and stayed up by 13 early in the third on Kent Bazemore's free throws.\n\"We got up and down, guys were running the floor, we rolled to the basket, got easy lobs and things like that,\" Jeff Teague said after finishing with 12 points and six assists. \"That's how we have to play for us to be a good team.\"\nThanks in part to Butler's prolific third quarter, the Bulls went on a 22-11 run to pull within two on a pair of free throws by Derrick Rose at the 3:38 mark of the period, but the Hawks went back up by 17 on Schroder's jumper with 9:20 left and the game essentially decided.\n\"For whatever reason, right now we're coming out with more energy in the third quarter than we are in the first,\" Bulls coach Fred Hoiberg said. \"That's got to change. We're giving up 30 regularly now in the first quarter. We have to find a way to stop that.\"\nChicago dropped to 22-13.\nTIP-INS\nBulls: F Joakim Noah didn't make the trip, missing his ninth straight game with a left shoulder sprain, but the team hopes to get him back by Monday. \"We'll get him doing some live stuff tomorrow,\" Hoiberg said. \"Hopefully he'll get through a full practice.\" ... The Bulls dropped to 6-8 on the road.\nHawks: Horford added six assists and four blocked shots. ... F Thabo Sefolosha couldn't play after falling during a win Thursday at Philadelphia and hurting his right wrist. Coach Mike Budenholzer described the injury as \"a little bit of a problem\" and hopes he won't miss much time. ... The Hawks improved to 13-7 at home.\nDISCREPANCY AT THE LINE\nAtlanta was called for 22 fouls. The Bulls were whistled just 10 times before Mirotic fouled Millsap on a three-point play to make 111-96 with 4:35 to go. Chicago outscored the Hawks 26-12 at the free-throw line.\nUP NEXT\nBulls: Host Washington on Monday night.\nHawks: Visit Charlotte on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764993934.613845
}