{
  "game_id": "0021800598",
  "espn_id": "401071274",
  "date": "Jan 07, 2019",
  "matchup": "SAC vs. ORL",
  "headline": "Fox scores 20, Kings beat Magic 111-95 to stop 4-game skid",
  "body": "SACRAMENTO, Calif. --  After four excruciating losses, the Sacramento Kings savored a rare blowout victory Monday night.\n\nDe'Aaron Fox had 20 points and the Kings snapped a four-game skid with a 111-95 win over the Orlando Magic.\n\nGetting a little swagger back after blowing fourth-quarter leads in all four of those defeats, the Kings went ahead by double digits in a dominant second period and led by 28 entering the fourth.\n\n\"We've given a few games away, so it's good to come out and control the whole way,\" Fox said. \"It's great to have a game like this.\"\n\nPlaying in their somewhat frenetic offensive style, the Kings were running at every opportunity, especially early when they established the tempo. They outscored the Magic 24-12 in fast-break points and were even more dominant in the paint, owning a 64-24 edge.\n\n\"The ball was moving and everyone was sharing it,\" said Buddy Hield, who had 13 points. \"The ball has been really moving lately, even in the games we lost. When we are moving the ball well it's really hard to stop us.\"\n\nBogdan Bogdanovic had 15 points and seven assists for the Kings, and his 32 minutes marked the most by any starter. Willie Cauley-Stein added 11 points and 11 rebounds, and Justin Jackson also had 11 points.\n\nTerrence Ross hit five 3-pointers and scored 20 points and Nikola Vucevic had 18 points and 13 rebounds for Orlando, which has dropped three straight and eight of 11. Evan Fournier hit four 3s and scored 15 points.\n\n\"It's a tough situation for us and it's disappointing the way we've been playing,\" Vucevic said. \"We have to keep working and find a way to turn things around.\"\n\nThe speedy Fox shot 9 of 14 and directed the Kings' offense with precision, committing only one of Sacramento's nine turnovers. He exited late in the third quarter and never returned, playing 22 minutes.\n\nAn Orlando turnover led to an acrobatic fast-break dunk by Fox, putting the Kings ahead by 25 late in the third quarter. They led 90-62 after three.\n\nBehind a strong effort from their bench, the Kings opened the second quarter on a 20-2 run. Fox had 11 points, helping Sacramento take a 58-42 lead into halftime.\n\nOrlando shot under 37 percent, committed 16 turnovers and was outscored 29-17 in the decisive second quarter.\n\n\"We just struggled to score. We have to find a way to where we have enough shooting on the floor all the time to create spacing. It's a problem,\" Magic coach Steve Clifford said. \"There's not a lot of room with some of the lineups out there for anybody to have a place to go. It makes it hard.\"\n\nBAGLEY IS BACK\n\nAfter missing 11 games with a knee injury, Sacramento rookie Marvin Bagley III had eight points and six rebounds in 20 minutes.\n\nPrior to the injury, Bagley had stepped up his play and was a key figure off the bench. He entered averaging 12.7 points and 6.1 rebounds per game.\n\n\"(The knee) feels great. After a couple of times down the court I got a little tired,\" Bagley said. \"But as the game went on I felt a lot like I did before I was hurt. It will take some time, a game or two to get back in the flow of things.\"\n\nTIP-INS\n\nMagic: Shot a dismal 12 of 39 (31 percent) in the opening half. ... Vucevic had his 27th double-double this season. ... Aaron Gordon shot 3 of 13 and had 10 points.\n\nKings: Had a 13-27 record last year after 40 games. This season, Sacramento is 20-20. ... Starting guard Iman Shumpert missed his second straight game with an injured right index finger. ... The bench produced 48 points.\n\nUP NEXT\n\nMagic: Conclude their six-game road trip Wednesday against Utah.\n\nKings: Play at Phoenix on Tuesday in the second game of a back-to-back.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994202.798749
}