{
  "game_id": "0022000475",
  "espn_id": "401267635",
  "date": "Feb 22, 2021",
  "matchup": "MIA @ OKC",
  "headline": "Heat pull away to beat Thunder 108-94 in finale of road trip",
  "body": "OKLAHOMA CITY -- — Duncan Robinson scored 22 points and made six 3-pointers, leading the Miami Heat to a 108-94 victory over the Oklahoma City Thunder on Monday night in the finale of their seven-game road trip.\n\n\r\n                    Kendrick Nunn added 20 points and nine assists, Bam Adebayo had 19 points and 13 rebounds, and they hooked up on an alley-oop dunk during Miami’s 15-0 run to start the fourth quarter.\n\n\r\n                    Robinson ended it with a 3-pointer that gave the Heat a 94-77 lead midway through the final period. The Heat did it all with five-time NBA All-Star Jimmy Butler on the sideline for the last 12 minutes.\n\n\r\n                    “It was great, just the enthusiasm,” Heat coach Erik Spoelstra said. “I think those guys wanted to play well while he was on the bench and see if we could push the lead. \n\n\r\n                    “Then, when we took that first timeout, I looked at Jimmy, and Jimmy was in the huddle and he said, ’Hey guys, keep going. Let’s give it another two or three minutes and see how it goes.'”\n\n\r\n                    Spoelstra said Butler’s comments energized the group, which kept its double-digit margin and won the final three games of its trip to finish 4-3.\n\n\r\n                    Shai Gilgeous-Alexander scored 27 points for the Thunder, who were outscored 63-40 after halftime.\n\n\r\n                    “I give them a lot of credit. They came out of halftime really focused and we had to earn everything on both ends of the floor in the second half,” Thunder coach Mark Daigneault said. “They just outplayed us. … We definitely enjoy competing against a team like them, because we learn a lot about ourselves. They just outlasted us tonight.”\n\n\r\n                    The Heat made five of their first eight 3-point attempts. Max Strus capped the hot start with one with 4:19 remaining in the first quarter.\n\n\r\n                    Miami missed its next 12 3-point shots. Robinson finally ended the drought with a 31-foot jumper with 43 seconds left until the break.\n\n\r\n                    Meanwhile, the Thunder shot 54% from the floor through the first 24 minutes. Gilgeous-Alexander fueled Oklahoma City’s 54-45 halftime advantage, scoring 18 points on 6-of-7 shooting. His only miss of the half came via a 27-foot stepback as time expired in the first period.\n\n\r\n                    Miami responded with 34 points in the third quarter to take a 79-72 lead with under a minute left. Gilgeous-Alexander rattled off five points in the final 31.6 seconds to bring the Thunder within two entering the final period before Miami promptly blew it open.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Tyler Herro (right hip contusion) was ruled out ahead of Monday’s game. He is day to day, according to Spoelstra. … The Heat haven’t played at home since a Feb. 9 win over the New York Knicks. … Jimmy Butler played in his 600th career game.\n\n\r\n                    Thunder: Al Horford (rest) was not available for Oklahoma City’s second game in as many nights. Isaiah Roby started in Horford’s place. … The Thunder fell to 2-4 when playing the second game of a back-to-back. … Darius Bazley finished with 13 points on 5-of-9 shooting and five rebounds.\n\n\r\n                    END OF THE ROAD\n\n\r\n                    The Heat lost three consecutive games before beating the Sacramento Kings on Feb. 18, the Los Angeles Lakers on Saturday and the Thunder on Monday. Adebayo attributes the team’s time on the road to the group’s strong finish and strengthened bond within the locker room.\n\n\r\n                    “We got better,” Adebayo said. “I feel like it was one of those situations, it felt like the bubble again where we got a chance to be cohesive and feel like brothers again. … When we’re at home, we can’t really hang out with each other. So, being able to be in the hotel and be safe, it feels like the bubble.”\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: Host the San Antonio Spurs on Wednesday.\n\n\r\n                    Heat: Host the Toronto Raptors on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996793.747498
}