{
  "game_id": "0022100783",
  "espn_id": "401360602",
  "date": "Feb 03, 2022",
  "matchup": "ATL vs. PHX",
  "headline": "Young has 43 points, Hawks end Suns' 11-game winning streak",
  "body": "ATLANTA -- — There was no way a sore shoulder was going to prevent Trae Young from playing.\n\n\r\n              Not with Chris Paul and the Phoenix Suns in town.\n\n\r\n              Young scored 43 points and led Atlanta’s flurry of 3-pointers as the surging Hawks beat Phoenix 124-115 on Thursday night to end the Suns’ 11-game winning streak.\n\n\r\n              “I think I just grew up just watching these moments and thinking about being in these moments,\" Young said about the opportunity to face “the best team in the league with the best record. ... I love these moments.”\n\n\r\n              The Hawks made 20 of 41 3-pointers, including six by Young. Young’s final 3 made it 122-113 with 37 seconds remaining. \n\n\r\n              “It was a steady dose of Trae,” Paul said. “Trae is just tough like that. If you watch him on a nightly basis, he’s a handful.”\n\n\r\n              NBA-leading Phoenix dropped to 41-10, losing for the first time since Jan. 8 at home against Miami. Devin Booker and Paul were named All-Stars before the game.\n\n\r\n              Booker led the Suns with 32 points. Mikal Bridges had 24, and Paul 18. \n\n\r\n              Kevin Huerter made five 3s and had 19 points for Atlanta. The Hawks (25-26) have won eight of their last nine games as they have started to regain the form which took them to last season's Eastern Conference finals. They are still only 10th in the conference.\n\n\r\n              “We’ve got to use this as momentum,” Young said. “It’s a big win for us.”\n\n\r\n              The Hawks have won eight of their last nine games, with their only loss to Toronto on Monday coming when Young was held out with a right shoulder contusion. \n\n\r\n              Young, who will start as Atlanta’s only representative in the Feb. 20 All-Star Game, was still being called a game-time decision by coach Nate McMillan less than 2 hours before the game.\n\n\r\n              The Suns couldn't stop the 3-point attack by the Hawks, who led 100-91 entering the final period.\n\n\r\n              “Any team that scores 100 points after three quarters on us, that’s just not something we’re used to,” said Suns coach Monty Williams.\n\n\r\n              The Suns' second winning streak of more than 10 games this season included eight games on the road. They set a franchise record with 18 consecutive wins from Oct. 30 to Dec. 2, including a 121-117 home victory over the Hawks on Nov. 6.\n\n\r\n              Booker's layup trimmed Atlanta's lead to 108-101 before John Collins answered with jams on back-to-back possessions to push the lead to 11 points and force a Phoenix timeout.\n\n\r\n              The Suns led 35-32 before Huerter sank four 3-pointers in a 15-4 Atlanta run early in the second period. \n\n\r\n              Thanks in part to a scoring flurry from Young, the Suns were not given the opportunity to test their 31-0 record when leading after three quarters. Young scored Atlanta's last 12 points of the third.\n\n\r\n              Young sank two 3-pointers and had another basket following a steal of Booker's pass in the hot streak.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Atlanta made 11 of 20 3s in the first half for a 64-61 lead at the break. Young set up a jam by Collins for the Hawks’ last basket of the half. ... Atlanta's streak of 12 games with 10 or more 3s is the third-longest in franchise history. ... G Lou Williams (lower back spasms) did not play. \n\n\r\n              Suns: The All-Star honors are the 12th for Paul and third for Booker. ... Phoenix took its last win in Atlanta on March 24, 2014, before eight consecutive road losses in the series. ... Guards Cameron Payne (right wrist sprain) and Landry Shamet (right ankle sprain) and did not play. \n\n\r\n              THREE TIMES AN ALL-STAR\n\n\r\n              Booker said the All-Star honor “felt great.”\n\n\r\n              “Three times,” Booker said. “I don’t take it for granted. I think back to those days of dreaming just to be in the NBA. Now to be voted a three-time All-Star is pretty cool.”\n\n\r\n              INJURY SCARE\n\n\r\n              Collins scored 19 points before suffering a right shoulder injury with 1:49 remaining. Collins was escorted to the locker room before returning to the court for the end of the game.\n\n\r\n              Collins said the shoulder pain was initially “excruciating” but said he doesn't expect to miss any games.\n\n\r\n              BIG NIGHT FOR YOUNG\n\n\r\n              Young added five assists. He posted his fourth game of the season with at least 40 points and five assists, tying Golden State’s Stephen Curry for the most in the league.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Toronto on Friday night.\n\n\r\n              Suns: At Washington on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993494.389073
}