{
  "game_id": "0021900384",
  "espn_id": "401161026",
  "date": "Dec 14, 2019",
  "matchup": "MIA @ DAL",
  "headline": "Doncic injures ankle, Mavs rally, fall to Heat 122-118 in OT",
  "body": "DALLAS --  A Dallas crowd stunned by Luka Doncic's ankle injury and the big deficit that followed was standing with the Mavericks in position to win late.\n\nStill, a huge comeback without the young phenom came up short.\n\nDoncic left in the opening minutes with a sprained ankle and the Mavericks rallied from 24 points down to take a lead into the final minute of regulation before falling to the Miami Heat 122-118 in overtime Saturday night.\n\nBam Adebayo put Miami in front for good on a put-back dunk with 1:15 remaining in overtime and finished with 18 points, 11 rebounds and 10 assists for his second triple-double in three games.\n\n\"Anytime you lose your best player, the way he's been playing, it's rough,\" said guard J.J. Barea, a big part of the rally with 12 points in 13 minutes. \"But yeah, I think we did a great job. Everybody that came in stepped up and we put in a great effort.\"\n\nDoncic's right foot landed on the foot of Heat guard Kendrick Nunn on a drive less than two minutes into the game.\n\nThe reigning rookie of the year lost control of the ball for a turnover and limped off the court before going down behind the basket while play continued at the other end. He got up a short time later but went straight to the locker room. The team said X-rays were negative, but he didn't return.\n\nDoncic was playing two nights after the 20-year-old dazzled the crowd in Mexico City with a pre-game speech in Spanish before scoring 41 points with 12 rebounds and 11 assists in a 122-111 victory over Detroit. It was his NBA-leading eighth triple-double of the season.\n\nThe Slovenian guard entered the game averaging 30.4 points, 9.9 rebounds and 9.3 assists per game while leading the resurgent Mavericks to the Southwest Division lead.\n\nWhile stressing it was just his opinion, Dallas coach Rick Carlisle said he doesn't expect Doncic to play Monday at Milwaukee.\n\n\"If you play hard and do the right things for 48 minutes, you're always going to have a chance in this league,\" Carlisle said. \"We got plenty on this roster to win a game like this, even with Luka out. We just got to do better.\"\n\nWithout Doncic, Tim Hardaway Jr. scored 18 of his 28 points in the second half to help Dallas rally, but was shut out in overtime.\n\nKristaps Porzingis, the other half of Dallas' star European pairing with Doncic, had 22 points and 14 rebounds but couldn't convert on two possessions late in the extra period. Then the 7-foot-3 Latvian gave up an offensive rebound after Jimmy Butler missed two free throws with nine seconds remaining.\n\nWith another chance after another foul, Butler made two free throws for a three-point lead, and Jalen Brunson missed a 3-pointer just before the buzzer.\n\nButler led Miami with 27 points, and Tyler Herro scored 19 as the Heat again avoided back-to-back losses for the first time this season. It was Miami's first win in five tries on the second night of a back-to-back, coming off a 113-110 loss to LeBron James and the Lakers at home.\n\n\"Obviously, the game looked totally different without Doncic there,\" Heat coach Eric Spoelstra said. \"But regardless, this team, the guys in that locker room, we needed a breakthrough. We've been playing horrible basketball on the second night of back-to-backs.\"\n\nThe Mavericks trailed by four when Doncic went down and the deficit ballooned to 19 in about five minutes and reached 24 in the second quarter.\n\nBut Dallas wiped out a 23-point halftime deficit and the led twice in the fourth quarter, including 112-108 before the Heat scored the final four points of regulation.\n\nHardaway missed a runner in the final seconds of regulation before Butler misfired on a pull-up 3-pointer at the buzzer.\n\n\"It's tough, especially winning on the road,\" Butler said. \"They're a good team, even without Luka. My prayer's out for him. I hate to see people go down, especially him and the year he's having. I was looking forward to the matchup.\"\n\nPorzingis gave a stunned crowd the first chance to cheer by making a 3-pointer from the logo at center court to beat the first-quarter buzzer.\n\nTIP-INS\n\nHeat: Miami has won five straight games in the series. ... Butler extended his streak of games with at least 20 points to eight, the longest since Dwyane Wade had eight in March 2015. ... Adebayo also had two blocks. ... Kelly Olynyk had 17 points and eight rebounds. Nunn scored 13.\n\nMavericks: Delon Wright returned after missing two games with a right abductor strain, going scoreless in nine minutes. ... Brunson had 18 points, eight assists and seven rebounds. ... Maxi Kleber, whose dunk gave Dallas its first lead at 104-103 with 4:28 remaining in the fourth quarter, scored a season-high 17 points on 7-of-9 shooting.\n\nBUSY BUTLER\n\nButler played at least 40 minutes for the third time in five games, finishing at 43 minutes while going 1 of 6 from 3-point range while making 10 of 12 free throws. In the two games that fell short of 40 in the past five, Butler played 36 and 37 minutes.\n\nTALE OF TWO HALVES\n\nThe Heat shot 63% from 3 (12 of 19) in the first half before 4 of 21 after halftime. Duncan Robinson and Butler combined to go 1 of 11 from beyond the arc in the second half and overtime. Robinson was among five Miami players with at least two 3s before halftime.\n\nUP NEXT\n\nHeat: Three-game trip continues with middle game at Memphis on Monday. Miami has a franchise-best five-game winning streak against the Grizzlies.\n\nMavericks: Dallas will be trying to end Milwaukee's three-game winning streak in the series.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995532.2741902
}