{
  "game_id": "0022400043",
  "espn_id": "401703412",
  "date": "Nov 29, 2024",
  "matchup": "ORL @ BKN",
  "headline": "Franz Wagner's 29 points propel Magic to 123-100 NBA Cup win over Nets",
  "body": "NEW YORK -- — Franz Wagner scored 29 points, Kentavious Caldwell-Pope added 19 and the Orlando Magic eased to a 123-100 victory over the Brooklyn Nets on Friday night in an NBA Cup game.\n\n\r\n              Jalen Suggs and Wendell Carter Jr. each had 12 points for the Magic, who improved to 3-0 in Group A play and moved into a tie with New York. Orlando plays the Knicks, who are also 3-0 in the East's Group A, in an NBA Cup game on Tuesday with the winner advancing as group champion.\n\n\r\n              The Magic have won their last five games and 11 of their last 12 following a five-game losing streak, all which came on the road.\n\n\r\n              Shake Milton scored 22 points off the bench, Keon Johnson had 15 also off the bench and Cam Johnson added 14 for the Nets, who had their three-game winning streak snapped and are now 1/3 in the in-season tournament.\n\n\r\n              Takeaways\r\n              Magic: Orlando has won four of its last five road games after losing five straight from Oct. 30 to Nov. 6.\n\n\r\n              Nets: Dennis Schroder, the team’s second-leading scorer with 18.6 points per game, did not play due to personal reasons.\n\n\r\n              Key Moment\r\n              Despite being tied with New York in Group A play, the Magic hold the tie-breaker in the point differential column. The Knicks' margin of victory was at 23 following their win at Charlotte, but the Magic overtook them by one point by hitting their last three shots of the game, all 3-pointers.\n\n\r\n              Key stat\r\n              Orlando shot 18 for 35 from long distance.\n\n\r\n              Up next\r\n              The Nets host the Magic on Sunday to conclude the two-game series in Brooklyn. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997572.0973241
}