{
  "game_id": "0021300803",
  "espn_id": "400489676",
  "date": "Feb 19, 2014",
  "matchup": "CHI @ TOR",
  "headline": "Carlos Boozer scores 20 as Bulls win fourth straight",
  "body": "TORONTO -- Before his team faced the surging Bulls, Toronto coach Dwane Casey praised Chicago for being \"at the head of the class\" when it comes to defense.\nLater on, with the outcome in the balance, Jimmy Butler showed why he's one of the Bulls' top students.\nCarlos Boozer scored 20 points, D.J. Augustin had 19 against his former team and the Bulls won their fourth straight game Wednesday night, edging the Raptors 94-92.\nButler blocked DeMar DeRozan's potential go-ahead jump shot with 2 seconds left in the fourth quarter and the Bulls clinging to a one-point lead.\n\n\"Jimmy had a great play basically to save the game for us,\" Boozer said. \"We needed one stop and Jimmy got it for us.\"\nKirk Hinrich scored 19 points, Butler had 16 and Taj Gibson fouled out with 10 as the Bulls won for the fifth time in six games and halted Toronto's winning streak at three. Joakim Noah added eight points and 13 assists for Chicago.\nBulls coach Tom Thibodeau called Butler \"a big-time player\" who's shown steady improvement in his three NBA seasons.\n\"Each year, I think, he's improved significantly to the point where he's as good as it gets,\" Thibodeau said. \"There's constant pressure on you.\"\nButler had one thought on his mind as he lined up to defend DeRozan after a Toronto timeout in the dying moments of the fourth.\n\"Whatever you do, do not let this guy get a basket,\" Butler said he told himself.\nHe didn't, rising up to block DeRozan's shot, then swallowing the loose ball before being fouled by Kyle Lowry.\nDeRozan led the Raptors with 32 points, while Lowry fouled out with 16. Lowry, who had seven assists, failed to extend his career-best streak of double doubles to four games.\nAugustin, who was waived by Toronto in December before signing with the Bulls as a free agent, hit two 3-pointers early in the third as Chicago took a 76-66 lead at 9:34.\n\"I don't know what they were looking at but we picked up a gem,\" Boozer said of Augustin. \"He's been playing as good as anybody in the league since he came to us, in my opinion.\"\nNoah also heaped praise on Augustin, who scored 13 in the final quarter.\n\"I don't think I would have made the All-Star game if it wasn't for D.J.,\" Noah said. \"He's a quiet guy but he's a good dude and he helps this ballclub a lot.\"\nToronto trailed 76-66 after a 3 by Augustin at 9:34 of the fourth, but a free throw from DeRozan and a jumper by Terrence Ross brought the Raptors to within 86-82 with 3:23 remaining.\nAfter a Chicago timeout, Augustin hit his third 3 of the fourth and Gibson followed with a jump shot, putting the Bulls up 91-84 at 2:10. Toronto, however, wasn't about to roll over.\n\"They didn't go away,\" Thibodeau said. \"They kept coming.\"\nLowry made a pair of free throws, then hit a 3 at 1:30 as Toronto cut it to 91-89. The 3 was Lowry's 129th of the season, matching a career-high he set with Houston in 2010-11.\nButler missed a jumper for Chicago and Toronto called timeout with 1:03 left. The Raptors gave the ball to DeRozan, but his jump shot from the elbow missed the rim. Hinrich hit a jumper at the other end, putting the Bulls up 93-89 with 41 seconds left.\nGibson fouled out as Amir Johnson hit a layup and converted his free throw, making it 93-92 with 34 seconds left. Chicago called timeout with 1 second left on the shot clock, then couldn't get a shot off, giving the Raptors possession with 10 seconds remaining. Toronto gave the ball to DeRozan again, but Butler came up with the pivotal block before being fouled by Lowry, his sixth. Butler made one of two with 2 seconds left, and DeRozan's half-court heave bounced off the glass as the final buzzer sounded.\nToronto's Tyler Hansbrough and Chicago's Nazr Mohammed had to be separated after Mohammed pushed Hansbrough down as the two battled for a rebound early in the second quarter. Mohammed was called for a personal foul on the play and both players were given technical fouls.\nHansbrough was involved in a minor skirmish with Mike Dunleavy in the final minute of the third, resulting in a double foul.\n\"It was definitely high intensity tonight,\" Noah said. \"It felt like a playoff atmosphere.\"\nGame notes\nThibodeau and Lowry were both called for technical fouls in the first quarter, while Boozer and DeRozan both picked up technicals in the third. Augustin got a technical for arguing in the fourth. ... Dunleavy led Chicago with 11 rebounds. ... Actors Kristian Nairn and Isaac Hempstead-Wright from the show \"Game of Thrones\" attended the game.",
  "source": "espn_api",
  "crawled_at": 1764992649.728083
}