{
  "game_id": "0021900721",
  "espn_id": "401161363",
  "date": "Jan 31, 2020",
  "matchup": "BKN vs. CHI",
  "headline": "Irving scores season-high 54, Nets beat Bulls 133-118",
  "body": "NEW YORK --  Kyrie Irving is attempting to process the death of Kobe Bryant by reflecting on the lessons his friend taught him.\n\nHe put them to good use Friday and scored a season-high 54 points, making all 10 shots in the first half and 19 of 23 for the game, to lead the Brooklyn Nets to a 133-118 victory over the Chicago Bulls.\n\n“It's an open wound,” Irving said. “But I think just coming out here knowing that this is a place where we connected on a deeper scale, it makes a lot of sense, what's happening.”\n\nIrving’s previous season high was 50 against the Minnesota Timberwolves in the season-opening 127-126 loss on Oct. 23. Irving is the first player in Nets franchise history to score 45 points in three games in a single season.\n\nSpencer Dinwiddie had 20 points off the bench and Taurean Prince chipped in with 16. Jarrett Allen and Garrett Temple contributed 12 and 11, respectively.\n\n“A little bit was making shots,” Dinwiddie said. “It's all about taking care of your bodies, being locked in, kind of mentally pushing through some of fatigue because everybody's going to have it, and just keeping that focus.”\n\nThe Nets never trailed in their second straight win and third in their last four games, with Irving playing the lead role. He scored 16 points in the first quarter on 6-of-6 shooting, and by halftime he was up to 27 points. Irving capped it by scoring five points in the final 4.9 seconds, including a buzzer-beating 3 from the right side which gave the Nets a 73-57 lead.\n\nIrving also had help as Dinwiddie had 15 and Prince added 11 in the opening 24 minutes.\n\n“My teammates were in the right spots,” Irving said. “They were being aggressive. When they're being aggressive like that, it makes my job a lot easier.”\n\nOne of Brooklyn’s two prized free agent signings along with Kevin Durant, Irving didn’t miss his first shot from the field until 1:24 into the third, a twisting fadeaway mid-range jumper from the left side.\n\nChicago, which trailed by as much as 21, fell to 19-32. Zach LaVine led the Bulls with 22. Luke Kornet finished with 19. Thomas Satoransky had 15, and Thaddeus Young had 14.\n\nChicago lost Kris Dunn for the game with what appeared to be a knee injury on the very first possession. Bulls coach Jim Boylen said Dunn would fly to Chicago Saturday to be evaluated by team doctors.\n\nThe Bulls cut Brooklyn’s lead to 105-99 on Coby White’s 3-pointer 1:17 into the fourth but that was as close as they would get. From that point, the Nets outscored Chicago 28-19.\n\n“I thought we battled,” Boylen said. \"NBA games are spurts games. Brooklyn, that’s a spurt team and they got the final spurt.”\n\nIrving made two free throws with 3:50 left to set his new season high as chants of “MVP! MVP!” rained down from the sellout crowd of 17,732 at Barclays Center. On the next possession, he knocked down a mid-range jumper.\n\n“It felt incredible,” Irving said. “You just want to carry that over into the next game.”\n\nTIP-INS:\n\nBULLS: Boylen made no bones about it: The Bulls are displeased that LaVine will not be inside the United Center during the All-Star Weekend festivities as an active participant.\n\n“I am disappointed, we are disappointed that Zach LaVine was not selected to the team,” Boylen said before the game. LaVine, in his fifth season, is averaging 25.1 points, 4.9 rebounds, and 4 assists for a Bulls team that came into the game in ninth place in the East. “We feel he’s an All-Star caliber player. He’s having an All-Star season, and he’s obviously a huge part to what we’re building. But we respect the process. I believe in the process, and so does Zach.”\n\nNETS: He would not define it as make-it-or-break-it, but Kenny Atkinson is cognizant of the significance of the Nets’ next nine games. “This is starting to get money time, now,” Atkinson said. The Nets are eighth in the East. But as Atkinson explained, it is difficult to assess what his team is because they have rarely been at full strength over the course of the first 47 games of the season. “Now that we’re healthy,” Atkinson said, “We can get a real sample size of our squad. ... The fact that we’re pretty much whole except (for Durant) I think that is super important for our evaluation purposes.”\n\nUP NEXT:\n\nBULLS: Visits Toronto Sunday afternoon.\n\nNETS: Visits Washington Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996710.146226
}