{
  "game_id": "0021600601",
  "espn_id": "400900022",
  "date": "Jan 14, 2017",
  "matchup": "LAL @ LAC",
  "headline": "Jordan tops Clippers' hot shooting in 113-97 win over Lakers",
  "body": "LOS ANGELES --  DeAndre Jordan was getting the ball just where he likes it, and the big man known for his lousy free throw shooting only had to go to the line once.\n\nJordan scored 24 points on 12-of-13 shooting, and the Los Angeles Clippers shot 52 percent to cruise past the Lakers 113-97 on Saturday and improve to 6-0 in 2017.\n\n\"He was as dominant a force as you can have in the NBA,\" Clippers coach Doc Rivers said. \"He disrupted everything. He makes you not want to drive or be near the basket.\"\n\nAnd for the most part the Lakers weren't. Jordan came flying to make his eight dunks, including a two-handed jam on the game's opening possession. He didn't need to post anyone up around the basket, which irked rookie Lakers coach Luke Walton.\n\n\"It would be nice to foul him once in a while,\" Walton said. \"Instead of letting him go 12 for 13 and only shooting one free throw it would be nice to wrap him up a couple of times and make him earn it from the line.\"\n\nJordan's shooting was nearly perfect; he tipped in his own miss with 4:41 remaining in the game. He missed his lone free throw attempt.\n\nHe had 21 rebounds -- 18 on the defensive glass -- among the Clippers' 42 rebounds.\n\n\"I see myself getting better throughout the season, but a lot of it is effort, going after balls,\" Jordan said.\n\nChris Paul added 20 points and 13 assists for the Clippers, off to their best start since going 7-0 to begin 1974 when the franchise was located in Buffalo. Their streak is the longest active one in the NBA.\n\n\"This isn't our team. We're still missing 32,\" Paul said, noting Blake Griffin's absence while recovering from knee surgery. \"That's our singular focus, keep winning games.\"\n\nThe Clippers shot 52 percent and are 15-0 when they do so. Led by Jordan, they had a season-high 56 points in the paint.\n\nJordan Clarkson scored 21 points for the Lakers, who never led in losing their third in a row and seventh in 10 games.\n\n\"We've just got to keep the team growing together, move the ball, make shots,\" Clarkson said. \"We've got to make plays that make things easy for everybody. A lot of it has to do with spacing on the court right now. We've got to work on that.\"\n\nThe Lakers, who shot 44 percent, never made a run in the fourth.\n\nThe Lakers cut their deficit from 19 points to 10 in the third. After an unsportsmanlike technical for hanging on the rim, Timofey Mozgov dunked to launch a 9-2 run that included consecutive 3-pointers by Brandon Ingram and Nick Young and got the Lakers to 69-59.\n\nThe Clippers closed with a 15-9 spurt that sent them into the fourth leading 84-68. Jordan had two more dunks, both one-handers.\n\nTIP-INS\n\nLakers: Starting F Luol Deng rested after playing 19 minutes in Thursday's loss to the Spurs, well under his 27-minute average. He missed his first game of the season on Jan. 5 at Portland. ... G Lou Williams, the team's leading scorer, made his first start of the season. It was the Lakers' 14th different starting lineup. ... They were averaging 10.1 turnovers (71 total) over the previous seven games and had 15 against the Clippers.\n\nClippers: They had eight turnovers, one off their season low. ... Playing without Paul, they lost to the host Lakers on Christmas, snapping their 11-game winning streak in the series. ... The Clippers have won nine in a row at home against the Lakers.\n\nTOUGH CROWD\n\nA day after the Chargers announced they're moving to LA from San Diego, tight end Jeff Cumberland got booed when shown on the video board.\n\nThe team's new logo, which has drawn criticism for its resemblance to the Dodgers' logo, also was booed when shown.\n\nChargers CEO and president Dean Spanos attended the game with his family.\n\nCHANGING THINGS UP\n\nFor just the third time in the 17-year history of Staples Center, all three tenants were playing at home on the same day. The Kings were set to host the Jets in the evening. It takes a 45-person crew nearly two hours to convert the arena from basketball to hockey. The three teams previously played on the same day in 2006 and 2008.\n\nUP NEXT\n\nLakers: Host Detroit on Sunday night.\n\nClippers: Host Oklahoma City on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995400.736023
}