{
  "game_id": "0021900568",
  "espn_id": "401161210",
  "date": "Jan 10, 2020",
  "matchup": "MIA @ BKN",
  "headline": "Nets snap 7-game skid with 117-113 win over Heat",
  "body": "NEW YORK --  Spencer Dinwiddie had the best passing night of his career, and Rodions Kurucs played his best game of the season for Brooklyn.\n\nDinwiddie scored 26 points and had a career-high 14 assists, Kurucs scored a season-best 19 points and Taurean Prince added 17 as the Nets snapped a seven-game losing streak with a 117-113 win over the Miami Heat on Friday night.\n\n\"I hope that's the spark because the talent's there,\" Nets coach Kenny Atkinson said regarding Kurucs' play. \"We saw last year. He decided to come out and defend tonight like he did last year. We gave him the assignment of Jimmy Butler. I think that excited him.\"\n\nKurucs admitted the game may be a \"turning point\" for his play going forward.\n\nJarrett Allen finished with 11 points and 11 rebounds for his team-high 17th double-double of the season.\n\nJimmy Butler scored 33 points and Bam Adebayo added 22 for the Heat.\n\nMiami's Duncan Robinson missed a 3-pointer from the corner with 5.7 seconds left that would've tied the game.\n\n\"The Brooklyn Nets deserved to win this game,\" Miami coach Erik Spoelstra said. \"We got what we deserved. They came out and out-competed us. Even when we were ahead and when we were scoring the basketball, they were winning physicality battles, clearly rebounding, getting to loose balls, things of that nature. You just have to credit them. We are still searching for maturity on the road as a basketball team. We didn't take a step forward in that department tonight.\"\n\nThe loss dropped Miami to 10-10 on the road, which Butler blamed on the starters.\n\n\"If the starters don't set the tone and asked to do what they are supposed to, it will end like that a lot of times,\" Butler said.\n\nThe Nets came up with several clutch plays down the stretch.\n\nCaris LeVert hit a step-back 3-pointer to give Brooklyn a 112-111 lead with 1:09 remaining and Prince hit a floater in the lane that extended the lead to 114-111 with 25.9 seconds left.\n\nButler hit back-to-back jumpers and a layup to give Miami a 109-100 lead with 5:09 remaining, but Brooklyn responded with a pair of 3s by Dinwiddie and LeVert to cut the deficit to three with 3:37 left.\n\nThe Nets turned up the defensive intensity in the third quarter and held Miami to 20 points in the period, which ended in an 89-all tie.\n\nMiami led 69-57 at the half. Butler led all scorers with 19 points. Brooklyn attempted three free throws in the first half and relied on perimeter jumpers.\n\nMiami shot a blistering 65% from the field in the first quarter and Butler scored 13 points as the Heat took a 42-32 lead.\n\nKurucs made a season-high three 3-pointers in the first quarter for Brooklyn.\n\nTIP-INS\n\nHeat: Coach Erik Spoelstra said Justise Winslow (lower back) won't play this weekend against the Knicks and he'll be re-evaluated when the team returns to Miami.\n\nNets: Coach Kenny Atkinson said Kyrie Irving's shoulder responded well to five-on-five play in practice Thursday, and he will play five-on-five again Saturday at practice. . Wilson Chandler (left hamstring) and Garrett Temple (right knee) were out for Brooklyn.\n\nUP NEXT\n\nHeat: At New York Knicks on Sunday.\n\nNets: Host Atlanta Hawks on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995514.896332
}