{
  "game_id": "0022300215",
  "espn_id": "401584843",
  "date": "Nov 19, 2023",
  "matchup": "POR vs. OKC",
  "headline": "Gilgeous-Alexander has 28 points and OKC Thunder routs Blazers 134-91 for 5th straight win",
  "body": "PORTLAND, Ore. -- — Shai Gilgeous-Alexander had 28 points before heading to the bench in the third quarter and the Oklahoma City Thunder won their fifth straight game with a 134-91 rout of the Portland Trail Blazers on Sunday night. \n\n\r\n              Rookie Chet Holmgren added 16 points and six rebounds for the Thunder, who led by as many as 47 points. Isaiah Joe had 15 points, all on 3-pointers. \n\n\r\n              Thunder coach Mark Daigneault started sending his starters to the bench with about five minutes left in the third quarter and they did not return. \n\n\r\n              The Thunder shot 60.5% (49 of 81) from the floor, 61.1% (22 of 36) from 3-point range and 100% (14 of 14) from the free throw line. Eleven different players hit at least one 3. \n\n\r\n              Jerami Grant had 14 points to lead the short-handed Blazers (3-10), who have lost seven straight games. \n\n\r\n              “They just beat us in every way that you could in this game,” Portland coach Chauncey Billups said. \n\n\r\n              The Thunder (10-4) were playing the second of a back-to-back after a 130-123 overtime victory over the Warriors in San Francisco. Gilgeous-Alexander had 40 points in that game.\n\n\r\n              “I think it just showed our mental fortitude to be able to come off a tough overtime game and be able to focus to execute our game plan for today's game,” Joe said. “We had a good game plan coming in and everyone took it upon themselves to be a pro and just get ready.” \n\n\r\n              The Thunder played without starter Jalen Williams, who hurt his left hip during the game against the Warriors and was sore on Sunday morning. Cason Wallace started in his place.\n\n\r\n              Portland has struggled with key injuries to starting guard Anfernee Simons (thumb), rookie Scoot Henderson (ankle) and Malcolm Brogdon (hamstring). The injuries have made it tough as the team tries to move on after All-Star Damian Lillard's departure in the offseason. \n\n\r\n              Portland ranked last in the NBA with an average of 103.9 points per game. \n\n\r\n              “Truth of the matter is we're dealing with a lot of things offensively. And anybody that knows, if you don't have playmakers, you're going to struggle. You're going to struggle,” Billups said. “We know that and we understand that. We don't make any excuses about that.”\n\n\r\n              Billups said that Brogdon was the closest to returning. \n\n\r\n              The Thunder showed no sign of fatigue in the early going, building a 33-18 lead in the first quarter. By midway through the second, Oklahoma City had stretched the lead to 51-29, and the team went into halftime ahead 76-43. \n\n\r\n              Holmgren, who scored all his points in the first half, was 6 for 6 from the field. Oklahoma City shot 71.8% from the floor in the half. \n\n\r\n              The 43-point margin of victory was the largest for the Thunder in the history of the series with Portland. \n\n\r\n              “I thought we played to our identity, regardless the circumstance and regardless of who was on the floor,” Daigneault said. \"It was a testament to the guys, and also to the guys that kept themselves sharp.\"\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host the Bulls on Wednesday night. \n\n\r\n              Trail Blazers: Visit the Phoenix Suns on Tuesday night in an In-Season Tournament game. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996402.01471
}