{
  "game_id": "0022300039",
  "espn_id": "401584127",
  "date": "Nov 21, 2023",
  "matchup": "IND @ ATL",
  "headline": "Haliburton scores 37 as Pacers beat Hawks to clinch quarterfinal berth in In-Season Tournament",
  "body": "ATLANTA -- — Tyrese Haliburton had 37 points and 16 assists, Buddy Hield hit a tiebreaking 3-pointer in the final minute and the Indiana Pacers beat the Atlanta Hawks 157-152 on Tuesday night to clinch a spot in the NBA In-Season Tournament quarterfinals.\n\n\r\n              In the highest-scoring NBA game this season, Hield's jumper from the left wing broke a 152-all tie with 52 seconds left. Dejounte Murray was called for an offensive foul on a 3-point attempt on Atlanta's next possession, then missed a difficult layup following an Indiana turnover with eight seconds remaining. \n\n\r\n              Hield made a layup at the buzzer.\n\n\r\n              “It is exciting,” Haliburton said of advancing to the quarterfinals. “We are the first team to clinch and we are ready to go. We have a few more games before the quarterfinals, so we want to take care of what is in front of us first, but we want to win the championship, of course. It would be awesome.”\n\n\r\n              The Pacers are 3-0 in East Group A with one game left in group play. The Hawks dropped to 1-2. The quarterfinals will be held Dec. 4-5.\n\n\r\n              Hield had 24 points and Obi Toppin scored 21 off the bench as the Pacers set an NBA season high for points. Bennedict Mathurin added 19, including a buzzer-beating shot to close the third quarter.\n\n\r\n              Haliburton leads the league in assists. \n\n\r\n              “Tyrese, you just run out of accolades,” Indiana coach Rick Carlisle said. “Fearless, leader, great competitor — so happy for him.”\n\n\r\n              Trae Young led the Hawks with 38 points and eight assists. Murray scored 28, and Bogdan Bogdanovic had 26 on 10-for-15 shooting.\n\n\r\n              “Tough game,” said Atlanta coach Quin Snyder. “All losses are tough, but I thought we competed.”\n\n\r\n              The Pacers have not reached the NBA playoffs since the 2019-20 season, so having an opportunity to advance in the first year of the in-season tournament has been a focal point for the team.\n\n\r\n              “This essentially is a playoff environment,” Carlisle said. “Atlanta was playing for a lot, too. The in-season tournament is getting a lot of buzz. ... This is a real thing. Hats off to the people in New York for coming up with something that, at least to this point, is strong.”\n\n\r\n              Both teams entered ranked in the top five in points per game and the bottom five in points allowed per game, setting up a high-scoring affair. The first half did not disappoint, as the Hawks set a franchise record with 86 points and led 86-73 at the break.\n\n\r\n              “We were not giving nearly enough resistance defensively (in the first half),” Carlisle said. “We challenged ourselves to pick it up and be defiant with our attitude and give ourselves a chance.”\n\n\r\n              Atlanta led by 20 in the second quarter but the Pacers came all the way back and tied it at 107 when Haliburton hit a 3 with just under four minutes remaining in the third. Haliburton scored 26 points in the period, and Indiana led 119-114 entering the fourth.\n\n\r\n              The Pacers shot 60.6% from the floor and 48.9% from 3-point range, while the Hawks shot 59.4% overall and 48.4% from deep.\n\n\r\n              “This is a classic regular-season game,” Carlisle said. “It had to be really fun to watch for fans.” \n\n\r\n              The Pacers shook up their starting lineup, inserting Hield and Aaron Nesmith in place of Toppin and Mathurin.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Face the Raptors at home Wednesday.\n\n\r\n              Hawks: Host the Nets on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996209.2651541
}