{
  "game_id": "0021600340",
  "espn_id": "400899782",
  "date": "Dec 09, 2016",
  "matchup": "MIL vs. ATL",
  "headline": "Schroder has career-high 33, Hawks rally past Bucks 114-110",
  "body": "MILWAUKEE --  After scoring only 44 points in the first half, the Atlanta Hawks broke loose for 40 in the third quarter to turn the tide.\n\nSparked by Dennis Schroder, who finished with a career-high 33 points, the Hawks rallied to defeat the Milwaukee Bucks 114-110 on Friday night.\n\n\"What happened in the first half, that can't happen,\" Atlanta coach Mike Budenholzer said. \"But I'm very pleased with how they responded and how they competed in the second half.\"\n\nSchroder thought a lack of defensive pressure and a stagnant Hawks offense allowed the Bucks to build a 20-point halftime lead.\n\n\"In the second half, we did it with our energy,\" he said. \"Coach got into us (at halftime). He said to do whatever you have to do to come back.\"\n\nPaul Millsap had 23 points and 14 rebounds for the Hawks, who ended a seven-game losing streak on Wednesday with a win over Miami. Tim Hardaway Jr. scored 18.\n\n\"We missed a lot of easy stuff in the first half, but in the second half our mentality was right,\" Millsap said.\n\nJabari Parker scored 27 points for Milwaukee. Giannis Antetokounmpo, in foul trouble throughout the game, had 14.\n\nAtlanta pulled ahead 105-103 on Kyle Korver's jumper with 3:15 remaining, giving the Hawks their first lead since early in the game.\n\nParker hit a 3-pointer with 1:51 left to give the Bucks a one-point lead. Schroder countered with a driving layup to put the Hawks back in front. A 3-pointer by Hardaway with 36 seconds remaining gave Atlanta a 110-106 lead, and a pair of free throws by Thabo Sefolosha sealed the victory.\n\nA 13-3 run by the Hawks to start the third quarter cut the Bucks' halftime lead in half. Atlanta shot 62 percent in the quarter.\n\n\"Being up 20 doesn't mean the game is over,\" Milwaukee coach Jason Kidd said. \"Our defense, as a whole, was bad in the second half.\"\n\nGreg Monroe, who had 14 points off the bench for the Bucks, said the team lost its intensity after building a big lead.\n\n\"It was a total letdown on both ends,\" he explained.\n\nMilwaukee used strong long-range shooting to take a 64-44 lead at the break, just two points off the team's highest-scoring half of the season.\n\nThe Bucks shot 54 percent to take a 30-23 lead after the first quarter. Schroder scored 17 points in the period.\n\nMISSING IN ACTION\n\nMiles Plumlee, who signed a four-year, $52 million deal with the Bucks in the offseason, didn't play (coach's decision) for the fourth straight game.\n\nCROWDED FIELD\n\nWith about one-fourth of the regular season completed, there's a logjam of teams in contention for playoff spots in the Eastern Conference. Entering play on Friday, just 3 1/2 games separated the third- and 11th-place teams. \"It could be that type of year where you have two or three teams that are on top of the East and then everybody else is bunched up to where you could win two games and go from ninth place to fifth,\" Kidd said.\n\nTIP-INS\n\nHawks: F Mike Scott was recalled from the Delaware 87ers of the NBDL. Assigned to Delaware on Tuesday, Scott played two games with the team and averaged 8.5 points and 3 rebounds. ... G Kent Bazemore missed his second straight game with a sore right knee.\n\nBucks: Eight players scored in the first quarter, compared with just three for Atlanta. ... The Bucks shot 8 of 13 on 3-pointers in the first half, including 3 of 4 by Jason Terry, who had gone only 9 of 31 from long range (29 percent) this season coming into the game. ... Three early fouls limited Antetokounmpo to 10 minutes in the first half.\n\nUP NEXT\n\nHawks: Off until Tuesday, when they host Orlando in the first meeting between the teams this season.\n\nBucks: Play at Washington on Saturday. Milwaukee has lost four straight games to the Wizards in Washington and seven of nine overall.",
  "source": "espn_api",
  "crawled_at": 1764995205.3994188
}