{
  "game_id": "0021700327",
  "espn_id": "400975078",
  "date": "Dec 02, 2017",
  "matchup": "DAL vs. LAC",
  "headline": "Barea, Mavericks pound Clippers 108-82",
  "body": "DALLAS --  Dirk Nowitzki and the Dallas Mavericks shot their way to a milestone victory for coach Rick Carlisle.\n\nNowitzki made five of Dallas' 16 3-pointers, and the Mavericks beat the Los Angeles Clippers 108-82 on Saturday for Carlisle's 700th career win.\n\n\"It just means that I've been very fortunate,\" Carlisle said. \"As time goes on, I count those things even less. It's day to day and trying to improve the situation.\"\n\nDallas had dropped two in a row after a stretch of three wins in four games. J.J. Barea had 21 points and 10 assists, and fellow reserve Devin Harris finished with 15 points.\n\nCarlisle became the 18th coach in NBA history with at least 700 wins. Greg Popovich (1,164) and the Clippers' Doc Rivers (812) are the only other active coaches to make it to the milestone.\n\n\"700. That's a lot of wins. We're happy to get it for him,\" Nowitzki said. \"He's been great for the league. He's been around forever, got great knowledge of the game. That's a big milestone. We're happy for him. We presented him with the game ball afterwards.\"\n\nThe Mavericks (6-17) scored the first eight points and never trailed. They finished 16 for 35 from beyond the arc.\n\n\"We are definitely playing better,\" Barea said. \"The ball is moving better, I think everybody is more active and playing with more energy and the ball has got to keep moving.\"\n\nDeAndre Jordan had 14 points and 17 rebounds for the Clippers (8-13), who have dropped two in a row after winning three straight. Lou Williams scored 18 points.\n\nWhile Dallas had a big day from beyond the arc, Los Angeles was 6 for 22 from 3-point range.\n\n\"It was tough,\" Rivers said. \"It gets frustrating when you are on defense all game. Like in a football game when you are three and out and the other team is on defense.\"\n\nThe Mavericks outscored the Clippers 35-21 in the second quarter for a 59-38 lead at the break.\n\nTIP-INS\n\nClippers: G Austin Rivers was fined $25,000 for a verbal outburst toward a fan in a loss to the Utah Jazz on Thursday.\n\nMavericks: It was the Mavericks' second-largest margin of victory this season after a 111-79 win against Milwaukee on Nov. 18. ... Dallas improved to 91-60 all-time and 53-23 at home in the series with the Clippers. ... Dallas won the rebound battle 54-38.\n\nLUNCH BREAK\n\nNerlens Noel was the only active player that didn't get into the game for the Mavericks, but the center did make a halftime trip to the media room at American Airlines Center for a hot dog.\n\n\"I heard the hot dogs are very good here,\" Carlisle said. \"You'll have to ask him.\"\n\nNoel, who hasn't played since Nov. 22 and is battling a thumb injury, said: \"I needed some energy for the second half.\"\n\nBENCH BOOST\n\nBoosted by Barea and Harris, the Mavericks' reserves outscored the Clippers' backups 59-28 and set a season high for reserve scoring. Each player that got into the game for the Mavs had at least two points and a field goal.\n\nUP NEXT\n\nClippers: Visit the Minnesota Timberwolves on Sunday.\n\nMavericks: Host the Denver Nuggets on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993967.7903202
}