{
  "game_id": "0022401109",
  "espn_id": "401705675",
  "date": "Apr 02, 2025",
  "matchup": "DAL vs. ATL",
  "headline": "Anthony Davis overcomes eye injury to lead the Mavericks past the Hawks, 120-118",
  "body": "DALLAS -- — Anthony Davis’ driving floater with 3.4 seconds left capped his 34-point night, his highest scoring game with Dallas, in the Mavericks' 120-118 victory over the Atlanta Hawks on Wednesday.\n\n\r\n              Davis also had 15 rebounds and five blocks despite missing most of the second period with an eye injury as Dallas overcame an 11-point third-quarter deficit.\n\n\r\n              Klay Thompson had 17 points for the Mavericks. They are ninth in the Western Conference, 1 1/2 games ahead of 10th-place Sacramento. \n\n\r\n              Trae Young had 25 points and 12 assists and Onyeka Okongwu had 20 points and 14 rebounds for the Hawks. They are eighth in the East, trailing Orlando by a half-game and leading Miami by one game.\n\n\r\n              Davis was elbowed by teammate Daniel Gafford while battling for a loose ball beneath the Mavericks’ basket at the end of the first quarter and was bleeding in the area of his right eye. He returned with two minutes in the half with a bandage over the eye.\n\n\r\n              Takeaways\r\n              Hawks: Young’s 21.2 scoring average in 13 games vs. Dallas, which drafted him in 2018 and traded him for Luka Doncic, is his lowest against any opponent.\n\n\r\n              Mavericks: Spencer Dinwiddie has become Dallas’ primary playmaker since Kyrie Irving was lost to a knee injury March 3. Dinwiddie had 14 points and 10 assists, his fourth double-digit assist game in Irving’s absence. Center Dereck Lively II (ankle stress fracture), playing for the first time since Jan. 14, had four points and five rebounds in 16 minutes.\n\n\r\n              Key moment\r\n              Young’s 26-foot 3-point shot at the buzzer while defended by Davis fell short.\n\n\r\n              Key stat\r\n              The Hawks had 14 more field-goal attempts but shot 43.3% (42 of 97) to Dallas’ 53.0% (44 of 83).\n\n\r\n              Up next\r\n              The Hawks will host New York on Saturday. The Mavericks are at the Los Angeles Clippers on Friday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997131.079191
}