{
  "game_id": "0021900823",
  "espn_id": "401161465",
  "date": "Feb 20, 2020",
  "matchup": "CHA @ CHI",
  "headline": "Monk, Bridges lead Hornets over cold-shooting Bulls, 103-93",
  "body": "CHICAGO --  Devonte Graham failed to score for the first time this season. Even with their star guard held without a point, the Hornets had enough to beat the Bulls.\n\nMalik Monk scored 25 points, Miles Bridges added 22 and Charlotte hung on to beat cold-shooting Chicago 103-93 on Thursday night.\n\n\"It showed that everybody can step up at any moment,\" Monk said. \"It showed that we trust in each other. Everybody is able to step up at any time, to step up in the big times.\"\n\nAfter the NBA put on a memorable show last weekend with the All-Star festivities in Chicago for the first time since 1988, the Hornets and Bulls delivered a rather forgettable performance.\n\nThe Hornets let a 21-point lead in the third quarter shrink to two. But they regrouped to win their third in a row after losing five straight and 13 of 14.\n\nThe Bulls missed their first 17 3-pointers before Zach LaVine made one in the third quarter and were 7 of 31 from beyond the arc in losing their seventh straight game.\n\nGraham, making a strong case for the NBA's Most Improved Player Award, had not scored fewer than four points this season. He missed all seven shots but contributed seven assists with the Bulls consistently trapping him.\n\n\"With them, it's next man up,\" Chicago's Thaddeus Young said. \"They had other guys step up. I think we did a good on just showing him traps. You stop one guy, he becomes a basketball player and makes smart decisions. He makes different reads and that's what they did.\"\n\nP.J. Washington scored 17 points for Charlotte. Cody Zeller added 16 points and eight rebounds. Bridges also grabbed eight rebounds after taking MVP honors in the Rising Stars Challenge at the United Center during All-Star weekend.\n\n\"We're not built around one player,\" Hornets head coach James Borrego said. \"We have depth, we have versatility, and ultimately that's how we want to be built.\"\n\nThaddeus Young led Chicago with season highs of 22 points and 11 rebounds. LaVine scored 19 points.\n\n\"We have a lot of season left,\" LaVine said. \"You've got to stay locked in. This is our job. This is a dream job. This is something that millions of people wish they could do -- good or bad. It's a tough situation. Nobody likes being in a losing situation. But you get to see who's fighting with you and who's not. Go out there and battle.\"\n\nREGROUPING\n\nThe Hornets led by 21 early in the third, only to have Chicago's Coby White cut it to 70-68 with a three-point play with 3:05 left in the quarter. Bridges answered with a finger-roll layup, and Terry Rozier got the lead back up to double digits early in the fourth when he nailed a 3 to make it 89-78.\n\n\"Dug in, showed resiliency, could have hung our heads,\" Borrego said. \"We've had a few of those games in the past where we've hung our heads. We've had big leads, we've lost it. This fourth quarter was different though. There's maturity out there, guys are talking, communicating, playing for each other.\"\n\nTIP-INS\n\nHornets: G Dwayne Bacon scored 51 points Wednesday for the Greensboro Swarm in his first game after being assigned to the G League. \"The G League has been really good to us. We've gained a lot of experience and a lot of confidence with our guys that go to Greensboro, and this is a great example of that,\" Hornets coach James Borrego said.\n\nBulls: C Daniel Gafford (dislocated right thumb, sprained right ankle), playing for just the second time since Jan. 15, finished with five points and four rebounds. ... Young's previous highs were 21 points against Toronto on Feb. 2 and 10 rebounds against Philadelphia on Feb. 9.\n\nUP NEXT:\n\nHornets: Host Brooklyn on Saturday.\n\nBulls: Host Phoenix on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996053.124394
}