{
  "game_id": "0021900335",
  "espn_id": "401160977",
  "date": "Dec 08, 2019",
  "matchup": "BKN vs. DEN",
  "headline": "Nets hold off Nuggets 105-102 for 3rd straight victory",
  "body": "NEW YORK --  Spencer Dinwiddie saved the Brooklyn Nets -- again.\n\nDinwiddie scored 24 points and the Nets held off the Denver Nuggets 105-102 on Sunday for their third straight victory.\n\n\"As long as it's working, you're all going to love me,\" Dinwiddie said. \"As soon as I miss, you're all going to hate me and tell me I'm selfish or something. We're going to keep rolling with it until that moment and I'll deal with whatever I've got to say then.\"\n\nDenver had a chance to force overtime, but Jamal Murray missed a 3-pointer from the wing as time expired.\n\nJarrett Allen added 19 points and 11 rebounds for Brooklyn. Star guard Kyrie Irving missed his 12th straight game because of a right shoulder impingement.\n\nNikola Jokic had 24 points and 11 rebounds for Denver, and Murray scored 21 points. The Nuggets have lost two straight.\n\nDinwiddie made consecutive driving layups to give Brooklyn a 103-102 lead with 26.3 seconds remaining. Denver's Will Barton missed a 16-foot off-balance floater, and Taurean Prince grabbed the rebound and was fouled. Prince made both free throws to make it 105-102 with 6.8 seconds left.\n\n\"It's like having an elite running back if you're an NFl coach,\" Nets coach Kenny Atkinson said about Dinwiddie. \"You can just pitch it to him and he can go get a bucket. ... When he gets speed downhill he's basically unstoppable. Those were the two plays where he got a head of steam and you can't stop him.\"\n\nDinwiddie has scored 20 or more points in 10 of his last 12 games.\n\nFor Jokic, Brooklyn's ability to get to the rim at will in crunch time was unacceptable.\n\n\"It was too easy for them,\" Jokic said. \"Second half it was too easy for them. We got to do something. I don't know what it is, but (we) probably need to do something.\"\n\nTIP-INS\n\nNuggets: Coach Michael Malone praised Paul Millsap. \"He's been the quiet unsung hero of our team,\" Malone said. \"We've had a lot of younger guys who have been up and down, inconsistent. If you looked at our first 20 games, Paul has been Mr. consistency for us, and that's what you expect from a 14-year veteran.\" Millsap had nine points and four rebounds in 21 minutes.\n\nNets: Atkinson said Irving will increase his individual on-court work and integrate him into practice in the next week or two.\n\nUP NEXT\n\nNuggets: At Philadelphia on Tuesday night.\n\nNets: Host Charlotte on Wednesday night.\n\n---\n\nMore AP NBA:\n\nhttps://apnews.com/NBA  and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996723.9655838
}