{
  "game_id": "0021500594",
  "espn_id": "400828481",
  "date": "Jan 15, 2016",
  "matchup": "OKC vs. MIN",
  "headline": "Westbrook's triple-double leads Thunder past Timberwolves",
  "body": "OKLAHOMA CITY -- Russell Westbrook followed one of his most forgettable performances of the season with one of his most efficient.\nThe Oklahoma City point guard got his 23rd career triple-double, leading the Thunder to a 113-93 victory over the Minnesota Timberwolves on Friday night.\nWestbrook finished with 12 points, 11 rebounds and 10 assists for his fourth triple-double of the season. He bounced back from being ejected Wednesday against Dallas following two skirmishes with J.J. Barea.\n\nOn Friday, Westbrook made 6 of 10 shots and had just two turnovers before sitting out the fourth quarter because the Thunder were in control. It was the second time this season he had 10 or more assists with two or fewer turnovers while shooting at least 50 percent from the field.\nWestbrook liked the Thunder's overall efficiency.\n\"Everybody's passing the ball, everybody's moving the ball around, making the extra pass and getting guys wide-open shots, wide-open dunks,\" he said.\nWestbrook combined his usual intensity with the efficiency, and it overwhelmed the Timberwolves.\n\"Russell is a quarterback with a linebacker's mentality,\" Minnesota interim coach Sam Mitchell said. \"You can count on your hand the guys in this league with that mentality. He is just a rare, unique individual and as a coach, you have to respect him, because he leaves everything on the floor every single night.\"\nKevin Durant had 21 points, Dion Waiters scored 20 and Cameron Payne added 14 for the Thunder, who won their third straight.\nKarl-Anthony Towns, the league's No. 2 rookie scorer with 15.7 points per game, had nine points and 12 rebounds. He had just five points on 2-for-9 shooting the first three quarters.\nAndrew Wiggins had 25 points, Shabazz Muhammad scored 15 and Zach LaVine added 13 for the Timberwolves, who lost their ninth straight.\n\"We've lost nine straight, and every one stings,\" Towns said. \"We've just got to win, find ways to win.\"\nOklahoma City led 57-43 at halftime. Durant scored 15 points and Waiters had 10 off the bench before the break.\nIn the second half, Westbrook clinched his triple-double. He got his 10th rebound with 7:02 left in the third quarter. He made a layup midway through the third to reach double figures in points. Westbrook secured the triple with an assist on an alley-oop lob to Andre Roberson from just beyond halfcourt. The basket gave the Thunder a 75-54 lead.\n\"Dre did a good job of running the floor,\" Westbrook said. \"I'm just glad I was close on target. He did a good job of catching it and finishing.\"\nOklahoma City was up 82-65 at the end of the third quarter. Mitchell left his starters in the game into the fourth quarter while the Thunder sat several of theirs.\n\"I left some of my young guys out there, even though the game was out of reach, because I wanted them to understand how it feels when you get your butt kicked,\" Mitchell said. \"This is part of the growing pains of learning in the NBA, and sometimes, you can't save them every night. Sometimes you leave them out there and let them play through it.\"\nSTAR POWER\nGrammy Award-wining rapper 50 Cent and former heavyweight boxing champion Evander Holyfield were in the crowd.\n50 Cent's No. 1 hit from 2003, \"In Da Club,\" played before he was shown on the big screen. Holyfield was included on the Flex Cam, and he offered a biceps pose.\nSTAT LINES\nDurant scored at least 20 points for the 26th consecutive game, the league's longest current streak. He rested in the fourth quarter.\nON THE RISE\nPayne's 14 points were his second-highest total of the season. The rookie has taken D.J. Augustin's spot as the team's No. 2 point guard. He played more than 20 minutes for just the third time this season.\nTIP-INS\nTimberwolves: Minnesota missed its first 10 shots and didn't score for the first 4:22. The Wolves made 16 of 34 the rest of the half. ... Towns and Wiggins both went 1 for 6 from the field in the first quarter. ... The Timberwolves outrebounded the Thunder 45-40.\nThunder: Oklahoma City shot 60 percent in the first quarter to take a 31-17 lead. ... The Thunder shot 53 percent for the game. ... Durant also had seven assists and six rebounds. ... The Thunder held the Timberwolves to 40 percent shooting overall.\nUP NEXT\nTimberwolves host Suns on Sunday.\nThunder host Heat on Sunday.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .",
  "source": "espn_api",
  "crawled_at": 1764994171.432095
}