{
  "game_id": "0021500733",
  "espn_id": "400828620",
  "date": "Feb 02, 2016",
  "matchup": "MIL @ POR",
  "headline": "Blazers beat Bucks 107-95 for 5th straight win",
  "body": "PORTLAND, Ore. --  CJ McCollum is hardly surprised the Trail Blazers are having more success.\n\n\"It was just a matter of time before we started to click,\" he said. \"Forty games, 50 games in, that's when you start to see a better brand of basketball all around.\"\n\nMcCollum scored 30 points and Portland beat the Milwaukee Bucks 107-95 on Tuesday night for its season-high fifth straight win.\n\nDamian Lillard had 14 points and 12 assists for his 11th double-double of the season. Al-Farouq Aminu added 16 points for the Blazers, who have won nine of 11.\n\nPortland is eighth in the Western Conference and edging closer to .500 at 24-26.\n\n\"This game was kind of similar to the last few games we've been playing,\" coach Terry Stotts said. \"We've been playing solid defense. Offensively, we've been moving the ball and for the most part playing well with the lead. Just doing a lot of good things.\"\n\nKhris Middleton had 21 points and eight rebounds for the Bucks, who have lost four straight and six of seven. Milwaukee was coming off a 111-104 defeat at Sacramento the night before.\n\nGiannis Antetokounmpo added 19 points and Greg Monroe had 17 for the Bucks. Both of them grabbed eight rebounds, too.\n\nIt was the fifth consecutive home win for the Blazers, who have limited their last three opponents to fewer than 100 points. Portland led by 17 in the second half.\n\n\"We just broke down too many times,\" Middleton said. \"CJ McCollum had his game going all night and broke us down. We just can't get stops when we need them.\"\n\nAminu was on at the start, scoring 10 points before the halfway mark of the first quarter as the Blazers took a 19-8 lead. Portland led 27-19 at the end of the first.\n\nAfter trailing by 13, the Bucks closed the gap and pulled to 56-49 at halftime.\n\nMiddleton's jumper got Milwaukee to 60-57 as Portland's defense, a highlight in recent games, faltered.\n\nPortland was also hurt when forward Noah Vonleh landed awkwardly after going up for a rebound in the third quarter and appeared to injure his left foot. After limping to the bench, he went to the locker room and did not return. The team later said he had a left ankle sprain.\n\nAfterward, Vonleh was limping but his ankle was unwrapped and there didn't appear to be much swelling.\n\n\"I think I'm going to be fine,\" he said.\n\nMonroe's short jumper got Milwaukee within one at 63-62, but Portland answered every Bucks basket before pulling away in the final quarter. Gerald Henderson stretched Portland's lead to 92-77 with a 3-pointer with 7:37 left in the game.\n\nMcCollum said there's still work to be done.\n\n\"Guys are settling into roles. That helps,\" he said. \"We're starting to see that better product. There's still sloppy moments -- that happens in basketball -- but overall we're doing a better job of taking care of the ball and finishing games down the stretch.\"\n\nTIP-INS\n\nBucks: Milwaukee coach Jason Kidd had high praise for Stotts, an assistant when Kidd played for Dallas. Kidd said the Mavericks had a great coaching team in head coach Rick Carlisle, Stotts and fellow assistant Dwane Casey, now head coach of the Toronto Raptors.\n\nTrail Blazers: C Mason Plumlee is the younger brother of Bucks C Miles Plumlee. ... Portland surpassed 500 3-pointers on the season, marking the second time the team has hit the mark in its first 50 games. ... It was Stotts' 162nd win as Portland's coach, moving him into a tie for fifth on the team's all-time list with Maurice Cheeks.\n\nCLUTCH PERFORMANCE\n\nHenderson had 14 points off the bench for the Blazers, 13 in the fourth quarter. He added a season-high nine rebounds.\n\n\"Just making some things happen,\" he said. \"I think my defense has been better. It's given me energy on both sides of the floor and I think it's given the team some pretty good energy.\"\n\nDEFLATED BUCKS\n\n\"It's tough right now,\" Middleton said. \"We've taken a step back. We've got one more game on this road trip. ... We've got to find a way to win these games coming up.\"\n\nUP NEXT\n\nBucks: At Utah on Friday.\n\nTrail Blazers: Host Toronto on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994041.98541
}