{
  "game_id": "0021700081",
  "espn_id": "400974832",
  "date": "Oct 28, 2017",
  "matchup": "DAL vs. PHI",
  "headline": "Simmons leads 76ers past Mavericks",
  "body": "DALLAS --  Ben Simmons' NBA career was put on hold when he missed all of last season with a broken foot.\n\nSix games into his rookie season the first overall pick in the 2016 NBA draft is making up for lost time.\n\n\"He doesn't look like a rookie out there. He's just playing basketball,\" 76ers center Joel Embiid said. \"Once you play basketball, you don't care about nothing. Everything just comes naturally.\"\n\nSimmons had 23 points, eight assists and seven rebounds as Philadelphia outlasted the Dallas Mavericks 112-110 on Saturday night for their second win of the season.\n\n\"Everyone knew he was going to be good, but he's way better than expected,\" Mavericks coach Rick Carlisle said. \"Some of the plays, just amazing stuff.\"\n\nSimmons, who is tall for a point guard at 6-foot-10, also had three steals and shot 10 for 15 from the field.\n\n\"He's incredible,\" teammate T.J. McConnell said. \"A guy his height is able to move like that and distribute the ball the way he does, it opens up the floor and makes things easier for everyone. He's a game changer for sure.\"\n\nEmbiid added 23 points and nine rebounds as the 76ers won in Dallas for the first time since Jan. 29, 2005.\n\nEmbiid did suffer a right hand contusion in the win. He had X-rays immediately after the game, which came back negative.\n\nDallas had a chance to tie the game and force overtime with 0.2 seconds remaining with Yogi Ferrell at the free throw line, but the guard missed the first attempt and Dallas couldn't score on a rebound after he intentionally missed the second.\n\nBefore that miss Ferrell had made 25 of 26 free throws this season.\n\n\"Felt good, just strong back rim,\" Ferrell said. \"They say normally that's a good miss when it's back rim. Went out there with confidence, I wanted to shoot those free throws, I felt like could I have made them, I just didn't.\"\n\nSimmons won the battle of rookie point guards with Dallas' Dennis Smith Jr, who countered with 12 points and eight assists, but struggled with six turnovers.\n\nMcConnell added 15 points off the bench and Robert Covington had 11 points for the 76ers.\n\nHarrison Barnes led Dallas with 25 points. Wesley Matthews had 19, Ferrell 17 and J.J. Barea 15.\n\nEmbiid got the best of former teammate and friend Nerlens Noel, who had four points and four rebounds. Noel spent three and a half seasons with the 76ers before being traded to Dallas last February.\n\nBoth teams relied heavily on 3-pointers as Philadelphia went 16-for-35 from beyond the arc, while Dallas made 19 of 40 3-point attempts.\n\nPhiladelphia seemingly took control and closed the third quarter with a 13-4 run after Dallas took a 76-74 lead with 5:06 remaining in the period.\n\n\"I just thought that we got stops and played fast,\" 76ers coach Brett Brown said. \"All over the place, the game was unusual and I thought to our guys' credit, they played hard, they played together.\"\n\nThe Mavericks opened the fourth quarter with a 9-0 run and kept the game close, but couldn't regain the lead in their final outing before a two-game road trip.\n\nTIP-INS\n\n76ers: F J.J. Reddick missed the game with lower back tightness. Dario Saric started in Reddick's place and had 12 points in 29 minutes. ... Philadelphia led 57-56 at halftime.\n\nMavericks: F Dirk Nowitzki had 11 points and recorded his 1,788th career 3-pointer in the third quarter, moving past Rashard Lewis for sole possession of 13th place on the NBA all-time list. ... 76ers assistant coach Jim O'Brien served as the Mavericks lead assistant during the 2012-13 season. ... Dallas had won 11 straight at home against Philadelphia heading into Saturday.\n\nBENCH BOOST\n\nThe Mavericks' bench helped keep the game close as Ferrell, Barea, Devin Harris and Dwight Powell all had a positive plus-minus showing. Nowitzki, who played with the group most of the game, was the only starter with a positive plus-minus while on the floor. \"Generally when those guys were in we were digging out of some kind of hole,\" Carlisle said.\n\nUP NEXT\n\n76ers: Complete their Texas road trip with a visit to Houston on Monday.\n\nMavericks: Travel to Utah on Monday still looking for their first road win.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993978.281798
}