{
  "game_id": "0021500455",
  "espn_id": "400828342",
  "date": "Dec 27, 2015",
  "matchup": "LAL @ MEM",
  "headline": "Conley, Green lead Grizzlies past Lakers, 112-96",
  "body": "MEMPHIS, Tenn. -- Kobe Bryant scored 14 points in the first quarter, but got little help from his Los Angeles Lakers teammates. The lack of support began a start-to-finish, double-digit victory for the Memphis Grizzlies.\nMike Conley scored 19 points, Jeff Green added 17 and the Grizzlies easily defeated the Lakers 112-96 on Sunday.\n\"I thought it was a good team victory,\" Memphis coach Dave Joerger said. \"I thought we played with a lot of passion and a lot of emotion.\"\nMarc Gasol and Zach Randolph added 16 points apiece, while Courtney Lee contributed 13. Conley and Gasol both connected on 7 of 11 shots and Randolph missed only one of his eight attempts as Memphis shot close to 60 percent for the game before finishing at 56 percent.\n\nBryant, playing in only the first and third quarters while dealing with a sore right knee, scored 19. His 14 were the bulk of the Lakers' 23 first-quarter points, and Los Angeles already trailed by nine after one.\n\"Nothing different,\" Lakers coach Byron Scott said of Bryant. \"I mean, he's still playing hard. . (It) was one of those nights where his knee was a little sore, so I wanted to limit his minutes.\"\nIt really didn't get much better the rest of the way as Memphis held a double-digit lead from late in the second quarter through the rest of the game.\n\"They threw that first punch,\" said Lakers reserve guard D'Angelo Russell, who had 10 points. \"When a game starts, the team that throws the first punch will be ahead. Then, going into the third, the team that throws the first punch will be ahead. They did it both times.\"\nLarry Nance Jr. had 17 points and 11 rebounds, while Jordan Clarkson scored 12.\nMemphis snapped a two-game skid, while Los Angeles lost its third straight and fifth in the last six.\nMemphis outscored the Lakers in every quarter except the fourth, when the lead reached 25 before reserves closed out the game. The Grizzlies used their inside game to hold a 44-28 advantage in the paint.\nMemphis led 59-46 at the half, shooting 55 percent. Meanwhile, the Lakers were limited to 36 percent in the half and finished the game at 38 percent.\nNance had 13 in the third quarter for the Lakers, but like Bryant's first-quarter performance, there was little support to make a dent in the Memphis lead.\n\"We just wanted to win,\" Gasol said, later adding: \"We just want to be more consistent, try to play a whole game of good basketball. Hopefully, we'll put a bunch of them together and get in a good run.\"\nTIP-INS\nLakers: Bryant has more points against the Grizzlies than any other player. He also holds the record for most points scored by an NBA player at the FedExForum, when he had 60 on March 22, 2007. ... Nance, a rookie from Wyoming, recorded his first career double-double. ... Julius Randle had 13 rebounds, marking the 26th time this season he has led Los Angeles in rebounding and the 17th game with more than 10 boards.\nGrizzlies: With his first field goal, Gasol passed Shareef Abdur-Rahim (7,801 points) for 4th on the Grizzlies' scoring list. ... Memphis is 8-2 this season on the second night of a back-to-back. ... Mario Chalmers scored 11 points and had seven of the Grizzlies' season-high 30 assists.\nBRYANT ON TONY ALLEN\nBryant has said Grizzlies guard Tony Allen is the toughest individual defender he has faced in his career. \"He's fundamentally extremely sound,\" Bryant said of Allen. \"Long arms, very athletic. He does his homework. He's old school. He'll sit there and watch film and know where you're going before you go.\"\nFAN DEMANDS\nBryant said he considered not playing because of the sore knee until he saw the fans before the game, saying he would have felt \"really, really awful\" if he decided not to play. Despite the soreness, he plans to play Monday against the Hornets, since, as an Eastern Conference team, it will be the Lakers only visit to Charlotte.\nUP NEXT\nLakers: Visit Charlotte on Monday.\nGrizzlies: Host Miami on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994292.9281878
}