{
  "game_id": "0022300314",
  "espn_id": "401584942",
  "date": "Dec 13, 2023",
  "matchup": "HOU vs. MEM",
  "headline": "Rockets beat Grizzlies 117-104 and extend home winning streak to 11 games",
  "body": "HOUSTON -- — Tari Eason scored a career-high 25 points, Jabari Smith Jr. added 20 points and 10 rebounds and the Houston Rockets extended their home winning streak to 11 games with a 117-104 victory over the Memphis Grizzlies on Wednesday night.\n\n\r\n              Eason came off the bench to shoot 10 for 16 and matched a career high with 14 rebounds.\n\n\r\n              “I feel like this is something where I always play hard,” Eason said. “When you play hard, all the extra stuff happens, but I wouldn’t say I am doing anything outside of myself.”\n\n\r\n              The Rockets and Grizzlies face off again Friday night in Memphis in the second game of the home-and-home set.\n\n\r\n              Houston’s bench outscored the Grizzlies’ backups 58-19.\n\n\r\n              “It’s been big the last few games,” Houston coach Ime Udoka said. “(It’s a) welcome sight to have those guys back and the energy and change of pace that they bring. … It’s a little sluggish at times, and they infuse some energy. Obviously, (they) got us a lead and got it back in the fourth quarter.”\n\n\r\n              Fred VanVleet and Dillon Brooks each scored 11 points and Jae’Sean Tate had 10 points and seven rebounds for Houston, which shot 45%, including 12 of 32 from 3-point range. Houston outrebounded Memphis 58-39.\n\n\r\n              The Rockets’ 11-game home winning streak is their longest since a franchise record 20-game run from Jan. 10-April 5, 2018.\n\n\r\n              Jaren Jackson Jr. had a career-high 44 points and seven rebounds for Memphis, which lost its third straight game. Derrick Rose added 19 points and six assists and Vince Williams Jr. had 10 points and seven rebounds.\n\n\r\n              Jackson was 15 of 24 from the field and scored 29 points in the second half.\n\n\r\n              “I’m just making sure my balance is good,” Jackson said. “Not changing up the recipe too much, making it simple. Even when you miss, don’t try to reinvent everything and just find guys when I start getting doubled.”\n\n\r\n              The Grizzlies shot 43%, but were just 10 of 38 from long distance. Memphis forced 19 Houston turnovers, which they converted into 23 points.\n\n\r\n              Desmond Bane, who is Memphis’ leading scorer at 24.8 points per game, was out with an illness. Bane became the 11th Grizzlies player to miss a game due to injury or illness this season.\n\n\r\n              Houston led by as many as 19 points in the second quarter before Memphis cut the lead to 57-43 at the half. The Grizzlies opened the second half on a 15-3 run and cut the Rockets’ lead to 60-58 on a free throw by Williams with eight minutes remaining in the third.\n\n\r\n              Leading 82-81 to start the fourth, Houston opened the quarter on a 10-2 run, stretching its lead to 92-83 on a jumper by VanVleet with 9 1/2 minutes left. Memphis got no closer than six points the rest of the way.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995624.650954
}