{
  "game_id": "0021900082",
  "espn_id": "401160724",
  "date": "Nov 02, 2019",
  "matchup": "TOR @ MIL",
  "headline": "Antetokounmpo scores 36, Bucks beat Raptors 115-105",
  "body": "MILWAUKEE --  Giannis Antetokounmpo carried a big chip on his broad shoulders against the Toronto Raptors.\n\nAntetokounmpo had 36 points, 15 rebounds, eight assists and four blocks to lead the Milwaukee Bucks to a 115-105 victory over the Raptors on Saturday night in the first meeting between the teams since the Eastern Conference finals.\n\n\"Definitely, I had a lot of motivation,\" he said. \"Obviously, a different team. Kawhi (Leonard) is not on the team, but I think guys have stepped up. (Kyle) Lowry is still playing amazing. (Pascal) Siakam has stepped up a lot for this team. They are the team that cost us a trip to the NBA Finals. Obviously, you are going to come out and play a little bit harder and have a little bit extra juice in you.\"\n\nEric Bledsoe added 14 points and five assists, and Khris Middleton and Brook Lopez each had 11 points for the Bucks.\n\nThe Bucks had the best record in the East last season and then took a 2-0 lead over the Raptors in the conference finals, but Toronto took the next four en route to its first NBA championship.\n\nIn this rematch, Lowry scored a season-high 36 points on 11-of-18 shooting, including 5 of 9 from 3-point range. Pascal Siakam added 16 for Toronto, which had won four of its first five this season. Marc Gasol grabbed 12 rebounds and had 10 points.\n\nThe Bucks' habit of blowing big leads nearly cost them again. They led by 19 in the first half against Boston and 21 in the third quarter over Miami, but lost them both.\n\n\"We've got to get better,\" Antetokounmpo said. \"It's happened three times so far. We've got to get better and be in the moment. We cannot relax. People are coming after us. Nothing is going to be given to us.\"\n\nThe Raptors, who had trailed by as much as 26 points, pulled within four three times in the fourth quarter, the last on a 3-pointer from Fred VanVleet that made it 107-103 with 2:24 to play.\n\nToronto coach Nick Nurse challenged the call on Siakam's sixth foul with 1:41 to play, but a review confirmed it and George Hill pushed the lead to six with two free throws. Antetokounmpo tacked on two more baskets and Bledsoe added one for the final margin.\n\nVanVleet, who finished with 12 points and seven assists, looked at this game as an early season matchup, a learning experience and nothing more.\n\n\"We didn't go into this with a playoff game-plan scheme,\" he said. \"We had a good game plan. We didn't execute it very well. There's going to be games like that.\"\n\nLowry's 17 points and 12 from Siakam pulled Toronto to 95-90 heading into the fourth quarter.\n\nThe Bucks led 36-17 at the end of the first quarter and 66-50 at the half behind 17 points from Antetokounmpo and a dismal offensive showing from Toronto. The Raptors shot 13 of 41 from the floor. Siakam, Toronto's leading scorer averaging 28 points, had five points on 2-for-8 shooting.\n\n\"We played terrible. We couldn't make a shot. We couldn't do anything,\" Siakam said of the Raptors' first half.\n\nTIP-INS\n\nRaptors: Lowry had one game out of 65 last season with 30-plus points. ... Toronto shot 3 for 18 (16.7 percent) from the floor at the end of the first quarter. ... G Patrick McCaw missed the game with left knee pain.\n\nBucks: Outscored Toronto 14-0 in the paint and had no turnovers in the first quarter. ... F Kyle Korver, 38, was back in the lineup after a scheduled game off Friday night against Orlando. ... G Pat Connaughton was out with a right shoulder strain. He was injured in the game against the Magic.\n\nQUOTABLE\n\nReflecting on Lowry scoring 17 of his 36 points in the third quarter, Bucks coach Mike Budenholzer said, \"Hopefully, by the fourth, he was just fatigued. Or, the basketball gods said he can't play that good another quarter.\" Lowry scored only two points in the fourth, a driving layup for the Raptors' final margin.\n\nSTATS LINE\n\nAntetokounmpo had at least 35 points, 15 rebounds, 5 assists and 4 blocks in a game for the second time in his career. The first was last March 17 against Philadelphia.\n\nSiakam came in with three games of 30-plus points already compared to just five last season.\n\nUP NEXT\n\nRaptors: Host Sacramento on Wednesday.\n\nBucks: Play at Minnesota on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995662.825726
}