{
  "game_id": "0022300656",
  "espn_id": "401585284",
  "date": "Jan 28, 2024",
  "matchup": "CHI @ POR",
  "headline": "DeRozan has 20 points and the Bulls snap 2-game skid with 104-96 win over the Blazers",
  "body": "PORTLAND, Ore. -- — DeMar DeRozan finished with 20 points and the Chicago Bulls snapped a two-game losing streak with a 104-96 victory over the Portland Trail Blazer on Sunday night. \n\n\r\n              Coby White had 15 points and 10 assists for the Bulls, playing the last of a short three-game road trip, while Andre Drummond came off the bench with 15. Ayo Dosunmu's 3-pointer with 21 seconds left all but sealed the win. \n\n\r\n              The Bulls, who were never able to extend their lead by more than 11 points and made just eight of 32 3-point attempts, relied on defense for the victory. \n\n\r\n              “I really thought we tried to share the ball,” Bulls coach Billy Donovan said. “I think 27 assists on the number of threes that we generated, that we just didn't shoot the ball very well. But I give the guys credit, we hung in there defensively.\"\n\n\r\n              Jerami Grant led Portland with 24 points, while Deandre Ayton had 22 and 12 rebounds. The Blazers have lost four of their last five games.\n\n\r\n              The Bulls narrowly led by 76-75 going into the final quarter. Chicago rookie Julian Phillips' 3-pointer stretched the lead to 88-80. \n\n\r\n              Anfernee Simons' 3-pointer with 4:34 left got Portland within 92-89 before DeRozan's 3 on the other end ended the threat. \n\n\r\n              Simons got the Blazers within 99-96 late in the game but Dosunmu's 3-pointer snuffed any attempt at a final rally. \n\n\r\n              Dosunmu's 3 came off a pass from Nikola Vucevic. \n\n\r\n              “Anytime you get a win, it always feels good,” Dosunmu said. “It just feels good because of the work I put into it, (Vucevic) trusting me, he could have easily just shot it, because he's a veteran and an All-Sar, but he trusted in me to make the right play.” \n\n\r\n              The Bulls were without Patrick Williams, who has a sore left foot and is scheduled to undergo additional imaging in Chicago before there's a timeline for his return. \n\n\r\n              Williams, averaging 10 points a game, played on Thursday in Los Angeles when the Bulls fell to the Lakers 141-132. His absence impacts Chicago, which is already missing Zach LaVine and Torrey Craig.\n\n\r\n              Grant (back soreness) and rookie Scoot Henderson (quad contusion) were game-time decisions for the Blazers, but both played. Portland, sitting second-to-last in the Western Conference, has struggled throughout January with injuries and illness. \n\n\r\n              The Blazers were coming off a 1/3 road trip that ended on Friday with a 116-100 loss to the Spurs. \n\n\r\n              Portland trailed for the nearly all of the first quarter but closed the gap midway through the second and tied the game at 30 on Duop Reath's 3-pointer. White answered for the Bulls with a 3 of his own. \n\n\r\n              The Bulls stretched the lead to 53-42 at halftime. White led all players with 11 points. \n\n\r\n              Portland closed within 59-55 after Ayton's second straight dunk but the Blazers couldn't get closer until Ayton made a pair of free throws that tied it at 67. Portland pulled ahead on Grant's free throw and the teams wrestled for the lead the rest of the third quarter. \n\n\r\n              The Blazers also struggled from the perimeter, making just six of 33 3-point attempts. \n\n\r\n              “We know we've got the players capable of putting up numbers, scoring from the outside, from the inside. We just have to figure it out,\" Grant said. \"I really don't have the answers for that, but we're definitely capable.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host the Toronto Raptors on Tuesday before visiting the the Hornets the next night. \n\n\r\n              Trail Blazers: Host the Philadelphia 76ers on Monday night. On Wednesday, former Blazers star Damian Lillard returns to Portland with the Milwaukee Bucks. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995890.355534
}