{
  "game_id": "0022100895",
  "espn_id": "401360714",
  "date": "Feb 24, 2022",
  "matchup": "SAC vs. DEN",
  "headline": "Jokic, Barton help Nuggets to 128-110 win over Kings",
  "body": "SACRAMENTO, Calif. -- — Nikola Jokic had 25 points, 12 rebounds and nine assists, Will Barton inched closer to the franchise record for 3-pointers, and the Denver Nuggets beat the Sacramento Kings 128-110 on Thursday night.\n\n\r\n              Denver outscored the Kings 36-23 in the fourth quarter and had 15 3-pointers and 30 assists to give coach Mike Malone his 300th win with the Nuggets.\n\n\r\n              “It was really a nice moment in the locker room,” said Malone, who has 39 wins from his 106-game stint in Sacramento from 2013-14. “Nikola gave me the game ball and said some nice words, which was touching. This is a tough business. I got fired in my first job. I’ve seen my father get fired. This business is not for the weak-minded. Here’s to 300 more.”\n\n\r\n              Jokic did the majority of his scoring in the first half and came up big late to help the Nuggets win their fourth straight. Jokic had eight points in the fourth quarter and fed Monte Morris for a layup that extended Denver’s lead to 116-100. He later made two free throws to make it 126-104.\n\n\r\n              “The fourth quarter was really good for us,” Jokic said. “We did a good job of defending. We literally controlled the whole fourth quarter.”\n\n\r\n              Barton scored a season-high 31 points on 11-for-17 shooting. Barton made three 3-pointers and needs five to pass J.R. Smith for most in franchise history. Smith, who played five seasons in Denver, made 768.\n\n\r\n              Morris finished with 19 points and Aaron Gordon scored 12 for Denver.\n\n\r\n              Domantas Sabonis had 33 points, 14 rebounds and six assists for the Kings. De’Aaron Fox added 20 points. Sacramento has lost four of six.\n\n\r\n              “We had a lot of turnovers which really affected the game,” Sabonis said. “Against a team like that, if you turn it over they’re going to convert on the other end. In that fourth quarter they made a couple of 3s in a row that really hurt us.”\n\n\r\n              The teams play again in Denver on Saturday.\n\n\r\n              Sabonis had 19 points and eight rebounds in the first half, but Jokic and Barton combined for 30 points to put the Nuggets ahead 63-58 at the break.\n\n\r\n              Sacramento trailed by 14 early in the third, but closed strong and closed within 90-87.\n\n\r\n              MISSING ELEMENT\n\n\r\n              Nearly three weeks after trading away their best 3-point shooter as part of the deal to land Sabonis, the Kings are struggling beyond the arc and shot 9 of 29 on 3s against the Nuggets.\n\n\r\n              “We have to shoot the ball better,” Kings interim coach Alvin Gentry said. “We had a lot of open looks we missed and they came down and (made). That’s where the separation starts.”\n\n\r\n              SUPPORTING UKRAINE\n\n\r\n              Players from both teams locked arms and stood near midcourt during a moment of silence for Ukraine. Kings 7-foot center Alex Len, along with fellow Ukrainian Svi Mykhailiuk of the Toronto Raptors, issued a joint statement on Twitter before the game to voice their concern over Russia’s invasion, offering support for their homeland. \n\n\r\n              “Ukraine is a peaceful, sovereign state inhabited by people who want to decide their own destiny,” the pair tweeted. “We pray for our families, friends, relatives and all the people who are in the territory of Ukraine. We hope for an end to this terrible war as soon as possible. Dear fellow Ukrainians, hold on! Our strength is unity! We are with you.”\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Denver hadn’t won in Sacramento since Oct. 28, 2019. … Morris got a tricky assist in the third quarter when he slipped and fell to the court but got the ball to Jeff Green under the basket for an uncontested score. \n\n\r\n              Kings: Sabonis’ points are his most since getting traded from Indiana on Feb. 8.\n\n\r\n              UP NEXT\n\n\r\n              The teams face off again in Denver on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993893.301055
}