{
  "game_id": "0022300293",
  "espn_id": "401584921",
  "date": "Dec 11, 2023",
  "matchup": "IND @ DET",
  "headline": "Mathurin and Haliburton star as Pacers hand Pistons their 20th straight loss with 131-123 victory",
  "body": "DETROIT -- — Bennedict Mathurin scored 30 points and the Indiana Pacers handed the Detroit Pistons their 20th straight loss, winning 131-123 on Monday night.\n\n\r\n              Tyrese Haliburton had 14 points and 16 assists for Indiana in its first game since Saturday’s 123-109 loss to the Los Angeles Lakers in the NBA In-Season Tournament final.\n\n\r\n              “This is one of the most difficult games you can have, coming off the emotions of last week, the game on Saturday, the travel and everything else,” Pacers coach Rick Carlisle said. \"I just thought our guys did a great job of staying together, keeping their composure and their aggression.\n\n\r\n              “Detroit is in an all-out attack mode because of their situation.”\n\n\r\n              Detroit's losing streak is the longest single-season slide in franchise history and matches the NBA's longest since the Houston Rockets lost 20 straight in 2020-21. Detroit lost 21 straight between the end of the 1979-80 season and the start of 1980-81.\n\n\r\n              “As much as this losing hurts us, and it hurts like you can't believe, I see a lot of growth,” Pistons coach Monty Williams said. “I'm encouraged by some of the things we saw tonight. We just need to build on them.”\n\n\r\n              The Philadelphia 76ers hold both NBA records, setting the single-season mark at 26 in a row in 2013-14 and the overall mark at 28 at the end of 2015-16 and start of 2016-17.\n\n\r\n              Miles Turner added 23 points for Indiana.\n\n\r\n              “This was fun, especially coming off a loss in the tournament,” said Mathurin, who added a career-high eight assists. “I don’t think it is about points for me. It’s about how I impact the game.”\n\n\r\n              Cade Cunningham scored 23 points and Ausar Thompson had 20 for the Pistons, who have dropped 44 of their last 48 games dating to last season's trade deadline.\n\n\r\n              Indiana led 98-93 at the start of the fourth quarter, and both teams were able to successfully get to the basket early in the period. Aaron Nesmith hit the only 3-pointer of the first six minutes, helping the Pacers move the margin to 115-108 with six minutes left.\n\n\r\n              Turner's three-point play made it a 10-point game and six straight points from Haliburton made it 129-114 with 3:31 to go.\n\n\r\n              The Pistons missed their four 3-point attempts in the quarter and didn't get an offensive rebound.\n\n\r\n              “Like most professional sports, NBA basketball comes down to possession of the ball,” Carlisle said. “We were able to secure it when we needed to down the stretch.”\n\n\r\n              Mathurin scored 18 points in the first half, including five in a 9-0 run to close the half. The Pacers shot 58.3% to Detroit's 53.7%.\n\n\r\n              “I thought the way we closed to halftime was something that kind of took the wind out of our sails a little bit,” Williams said. “We're still learning that everything we do in the meat of the game has an effect on the end.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At the Milwaukee Bucks on Wednesday\n\n\r\n              Pistons: Host the Philadelphia 76ers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996204.4189608
}