{
  "game_id": "0022300299",
  "espn_id": "401584927",
  "date": "Dec 11, 2023",
  "matchup": "MEM vs. DAL",
  "headline": "Luka Doncic scores 35 points, Mavericks beat Grizzlies 120-113 for 3rd straight win",
  "body": "MEMPHIS, Tenn. -- — Luka Doncic scored 35 points, Dereck Lively II added 16 points and 16 rebounds, and the Dallas Mavericks beat the Memphis Grizzlies 120-113 on Monday night.\n\n\r\n              Jaden Hardy scored 19 points off the Dallas bench and Dante Exum had 16 points for the Mavericks, who have won three straight. The win came despite the Mavericks being short a handful of players due to injuries, including Kyrie Irving, the team's second-leading scorer.\n\n\r\n              “Obviously, we had a lot of people out,” Doncic said. “I said before the game: ‘Everybody be ready.’ The trust factor was huge this game.”\n\n\r\n              Hardy's night included 7 of 15 from the floor, and 5 of 7 from outside the arc. Hardy said it was a matter of confidence to convert from distance.\n\n\r\n              “When I'm out there and the ball is finding me, it's just being ready to shoot,” Hardy said. “I feel like if I'm open, I feel like it is going to go in every time I shoot. Just having the confidence when I'm out there.”\n\n\r\n              Jaren Jackson Jr. scored a season-high 41 points and Desmond Bane added 28 for Memphis. Vince Williams Jr. finished with 10 points, the only other Memphis player to score in double figures. It was an example of how Memphis has struggled offensively.\n\n\r\n              “We didn't have many guys play well tonight,” Memphis coach Taylor Jenkins said. “There was a portion of the game here and there. The second half a little bit better. We can just lean on Des and JJ. So we all have to keep working and play better.”\n\n\r\n              Dallas led by 21 points early in the fourth quarter and continually held off Memphis' attempts to rally. Doncic finished 9 of 21 from the field and 5 of 10 on 3-pointers, including his 1,000th career 3 to open the fourth.\n\n\r\n              Dallas played without Irving, who missed his first game since a right heel contusion suffered in Friday's win over Portland. Tim Hardaway, the Mavericks' sixth man, was a late scratch because of back spasms. The pair collectively averages 40 points per game.\n\n\r\n              The Mavs' Derrick Jones Jr. left the game in the first quarter with a left quad contusion.\n\n\r\n              Memphis continued to play without its leading scorer from last season, Ja Morant, who is serving the final games of his 25-game suspension to open the season after incidents where he displayed a gun. Morant's absence and some key injuries have the Grizzlies near the bottom of the league in scoring at 106 points per game. \n\n\r\n              Lively's work on the boards, which matched his season high, allowed Dallas to control the rebounding with a 43-38 advantage, 10 off the offensive glass. That led to 21 second-chance points for Dallas.\n\n\r\n              Lively's rebounds were what Mavs coach Jason Kidd wanted to see.\n\n\r\n              “I just asked him to get 15 and he got 16,” Kidd said. “I didn't challenge him. I just asked him that we need 15-plus rebounds from him, and he went and got 'em.”\n\n\r\n              For Memphis, the season continues to be a battle. The Grizzlies are now 1-10 at home and near the bottom of the Western Conference as they try to hold things together until Morant's return on Dec. 19 at New Orleans.\n\n\r\n              Bane said that Jenkins talked a lot during the game about how the team was not executing the game plan, and the Grizzlies energy level.\n\n\r\n              “There wasn't too much to be said after the game,” Bane said. “Come in (Tuesday), Get our work. Refresh our minds and be better when we get another opportunity.”\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Host the Los Angeles Lakers on Tuesday\n\n\r\n              Grizzlies: At Houston on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996033.463521
}