{
  "game_id": "0021500813",
  "espn_id": "400828700",
  "date": "Feb 19, 2016",
  "matchup": "MIL vs. CHA",
  "headline": "Walker scores 25 points, Hornets beat Bucks 98-95",
  "body": "MILWAUKEE --  The Charlotte Hornets came out of the All-Star break at top speed.\n\nKemba Walker scored 25 points and Cody Zeller added a season-high 23 in the Hornets' 98-95 victory over the Milwaukee Bucks on Friday night.\n\nTrailing by 13 in the third, the Hornets outscored the Bucks 28-17 in the fourth. They made the right plays at the end to earn their fourth straight victory and start a tough five-game road stretch with their fifth win in the last eight games away from home.\n\n\"It was a gritty win for us, especially coming off the All-Star break,\" Zeller said after going 9 of 12 from the floor. \"We needed this one to get going. Five away games here to start the break. We picked it up and found every energy we could in that fourth quarter.\"\n\nWith Charlotte up 96-95 with 18.3 seconds left, the Hornets' Nicolas Batum tried to feed the ball to Marvin Williams, who was being closely defended by Michael Carter-Williams. The ball bounced off Williams and rolled out of bounds. An officials' review confirmed the ball went to Milwaukee. Khris Middleton missed an open look at the free-throw line and Walker grabbed the rebound. He was fouled and sank the two free throws for the game's final points. Middleton missed a 25-footer as time expired.\n\n\"The fight, down 10 in the third, and you could just tell the way we were playing that, not necessarily that we'd win, but we had the right approach,\" Hornets coach Steve Clifford said. \"We were trying to get good shots, our defense was better.\"\n\nThe Hornets were without Michael Kidd-Gilchrist and didn't play Courtney Lee, the guard acquired in a three-way trade with the Memphis Grizzlies on Tuesday. Lee dressed for the game and is expected to replace Kidd-Gilchrist, out for the season after reinjuring his right shoulder. Clifford made the decision based on Lee's lack of quality practice time with his new team.\n\nThe Bucks hurt themselves with nine turnovers in the fourth quarter that the Hornets converted into 15 points.\n\n\"We have to take care of the ball,\" Bucks head coach Jason Kidd said after his team finished with 22 miscues that led to 28 points. \"We get the offensive rebounds, and we throw it out of bounds. We have to be able to take care of the ball to get a shot in, and we just didn't do that.\"\n\nWilliams finished with 15 points, Jeremy Lamb 14 and Al Jefferson 6 to help the Hornets win.\n\n\"Everybody made plays. Al made big plays. Jeremy Lin made big plays,\" Walker said. \"Everybody contributed to the win. We never let ourselves get out. They were playing well. We were down, but we stayed composed and made some big plays.\"\n\nJabari Parker had a season-high 23 points, Middleton had 20 points, and Giannis Antetokounmpo added 18 points for the Bucks.\n\nCharlotte has won eight of its last 10 games against Milwaukee.\n\nTIP-INS\n\nHornets: C Al Jefferson returned after missing the last 22 games recovering from right knee surgery. He scored six points and grabbed five rebounds. \"A lot better than I could have expected,\" Clifford said of Jefferson's return. \"He hasn't been able to do contact until three days ago. You can tell his knee's a lot better than it's been all year.\" ... C Frank Kaminsky made his debut at center in his return to Wisconsin for the first time since the Hornets made him the ninth pick in the 2015 NBA draft. He popped for 20 tickets for family and friends and received a loud ovation from the sparse crowd when he was introduced. Kaminsky played four years at the University of Wisconsin, and led the Badgers to the 2014 and 2015 NCAA title games. he finished with four points and six rebounds in 24 minutes.\n\nBucks: G Jerryd Bayless missed the game with a sprained knee joint capsule and is not traveling to Atlanta for Saturday night's game. ... Asked about the trade rumors that had Dwight Howard coming to the Bucks, coach Jason Kidd said, \"I think it's good for the league, the rumors and speculation of guys going to different places. But, at the end of the day, some of that stuff could have happened, maybe, but it didn't. You have to be professional with that.\"\n\nUP NEXT\n\nHornets: Visit the Brooklyn Nets on Sunday.\n\nBucks: Visit the Atlanta Hawks on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994035.323013
}