{
  "game_id": "0022300913",
  "espn_id": "401585541",
  "date": "Mar 08, 2024",
  "matchup": "MEM vs. ATL",
  "headline": "Dejounte Murray matches career high with 41 points to lead Hawks past Grizzlies 99-92",
  "body": "MEMPHIS, Tenn. -- — Dejounte Murray matched his career high with 41 points and the Atlanta Hawks beat the Memphis Grizzlies 99-92 on Friday night, their third win in a row.\n\n\r\n              Murray, who also had seven rebounds and six assists, shot 17 of 25 from the field including 6 of 10 from 3-point range. Bogdan Bogdanovic finished with 16 points, and Clint Capela had 15 points and 11 rebounds.\n\n\r\n              “He was managing the game all the way around,” Hawks coach Quin Snyder said of Murray, who had 41 earlier this season against Minnesota. “... Just a cerebral game as well as a big game statistically. His buckets were big buckets.”\n\n\r\n              Murray said he was unaware that he was approaching his career high. His goal was to get teammates involved while filling some of the void from the team's missing key pieces.\n\n\r\n              “Just hoopin',\" Murray said. “I've never been a guy that played for stats. That's just who I am. I love to play. I love to compete.”\n\n\r\n              Jaren Jackson Jr. led Memphis with 21 points, while Jake LaRavia and Vince Williams Jr. finished with 14 points each. Williams added six assists. Santi Aldama and Lamar Stevens had 13 points apiece for Memphis.\n\n\r\n              The Hawks held a late 95-92 lead when Murray's 10-foot baseline jumper with 1:54 left, matching the career best in points, gave the Hawks a 97-92 lead. Memphis could get no closer.\n\n\r\n              \"He shot the ball extremely well,\" Memphis coach Taylor Jenkins said of Murray. \"Tip your cap. He played great. We were probably a little late to some of our adjustments.\"\n\n\r\n              The shooting touch that gave Memphis an early double-digit lead and a 31-20 advantage after one quarter abandoned the Grizzlies in the second period. A solid effort from Atlanta led by Murray’s 21 first-half points left the teams tied at 46 at halftime.\n\n\r\n              Jackson led Memphis with 17 points in the first half.\n\n\r\n              Both teams were dealing with injuries to key players. Atlanta forward Jalen Johnson, who sprained an ankle during Wednesday's win over Cleveland, is listed as day-to-day. Trae Young, the Hawks leading scorer at 26.4 points a game, remains out with a torn ligament in his left pinkie finger.\n\n\r\n              “You go out with whoever is healthy, and the game plan doesn't change as far as what we are trying to do on the defensive end together,” Murray said when asked if he felt a need to fill the void of missing players.\n\n\r\n              Part of that defensive concentration has led the Hawks — who have won five of their last seven — to hold opponents to an average of 96.4 points in those five victories.\n\n\r\n              Meanwhile, the Grizzlies continue to deal with a makeshift lineup, comprised of Jackson, a couple of rotation players, 10-day signings and two-way players. Earlier Friday, Memphis announced the signing of forward Wenyen Gabriel of the G League Wisconsin Herd to a 10-day deal. Gabriel played almost 13 minutes and finished with two points and four rebounds.\n\n\r\n              Memphis was competitive, but unable to close.\n\n\r\n              “The season that we've had with so much adversity, it's always something new,” Stevens said adding that there is little cohesiveness to lineups or who may even be available on a given night. “I think the fact that every night we go out and fight and compete says a lot about the character of this team.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host New Orleans on Sunday night.\n\n\r\n              Grizzlies: Travel to Oklahoma City to face the Thunder on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995999.248607
}