{
  "game_id": "0022301153",
  "espn_id": "401585781",
  "date": "Apr 09, 2024",
  "matchup": "SAC @ OKC",
  "headline": "Gilgeous-Alexander scores 40 as Thunder top Kings; Sabonis' double-double streak ends at 61 games",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 40 points in his return from injury, and the Oklahoma City Thunder rallied from a 20-point deficit to defeat Sacramento 112-105 on Tuesday night as the Kings' Domantas Sabonis had his double-double streak halted at 61 games.\n\n\r\n              Gilgeous-Alexander had missed six of the team’s previous seven games with a bruised right thigh, and the team went 2-4 without him. He gave Oklahoma City a much-needed boost against the Kings, scoring the team's final six points to seal an important win.\n\n\r\n              “Just a few emotions,” he said. “Felt good to be back. I haven’t played in front of the home crowd in a minute.\"\n\n\r\n              Gilgeous-Alexander had been struggling by his standards before resting.\n\n\r\n              “The past couple games, I tried to play through the injury, but it wasn’t healing fast enough, so I figured I’d get (a) break and get some work and not come back until I was 100%. But I felt 100% tonight for sure.”\n\n\r\n              The Thunder entered the contest a game behind the Minnesota Timberwolves for the best record in the Western Conference with four games remaining.\n\n\r\n              De'Aaron Fox scored 33 points and Keon Ellis scored a career-high 26 points for the Kings. \n\n\r\n              Sabonis had eight points and 13 rebounds. He now owns the seventh-longest streak of double-doubles in NBA history.\n\n\r\n              “I mean, it’s awesome,” he said. “You’re mentioned with some of the greats. At the end of the day, you’re just out there trying to play your game and go out there and win. That’s my job as a big man — to get rebounds and to finish.”\n\n\r\n              The game was important to the Kings, too. They entered the night eighth in the Western Conference standings with a shot at avoiding the Play-In Tournament.\n\n\r\n              Sacramento led 64-45 at halftime behind 21 points from Fox and 20 points from Ellis, a career high in just two quarters. Gilgeous-Alexander scored 14 before the break for the Thunder.\n\n\r\n              Gilgeous-Alexander hit a 3-pointer to open the scoring in the second half. He scored 17 points in the third quarter as the Thunder outscored the Kings 39-23.\n\n\r\n              “I just wanted to be aggressive,” Gilgeous-Alexander said. “I think it started defensively. I wanted to just come out at half aggressive overall. We were down 19 and we kind of didn’t have any time to waste, so I wanted to get right to it.”\n\n\r\n              A driving baseline layup by Jalen Williams cut the deficit to 71-69 midway through the third.\n\n\r\n              The Kings scored nine straight after a timeout to temporarily regain control, but the Thunder scored the final five points of the quarter and trailed 87-84 heading into the fourth.\n\n\r\n              Cason Wallace's 3-pointer early in the fourth gave the Thunder their first lead of the game at 89-87.\n\n\r\n              Sacramento coach Mike Brown said his team got away from what worked in the first half. He said the Kings stopped taking open shots and played too much individual ball.\n\n\r\n              “I thought in the first half our ball movement was beautiful,\" he said. “And I thought we got bored with it in the second half.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host the New Orleans Pelicans on Thursday.\n\n\r\n              Thunder: Host the San Antonio Spurs on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996778.8185658
}