{
  "game_id": "0021501175",
  "espn_id": "400829062",
  "date": "Apr 07, 2016",
  "matchup": "HOU vs. PHX",
  "headline": "Suns end 7-game skid with 124-115 win over Rockets",
  "body": "HOUSTON -- James Harden perfectly encapsulated the mood of the Houston Rockets after yet another loss dealt a serious blow to their dwindling playoff chances.\n\"It's frustrating,\" he said. \"Sums up our season.\"\nMirza Teletovic scored 26 points off the bench, P.J. Tucker added 24 and the Phoenix Suns snapped an NBA-high, seven-game skid with a 124-115 victory Thursday night.\nIt's the second straight loss for the Rockets, who fell 1 1/2 games behind the Utah Jazz for the eighth and final playoff spot in the Western Conference.\n\nIt's a disappointing follow-up to last season, when they reached the Western Conference finals for the first time since 1997 before falling to eventual champion Golden State. The season began with the firing of coach Kevin McHale after 11 games and didn't get much better from there.\nHarden has put up even better numbers that he did a year ago, but has failed to get much help from the rest of a team plagued by inconsistent play.\nThe Rockets' recent letdown has them needing to win their last three games and hope for losses by Dallas and Utah to sneak into the postseason.\nHarden was asked if he'll try and talk to his teammates to help them regroup before the next game.\n\"We've been doing too much talking,\" he said. \"Now we've got to go out there and actually play well.\"\nThursday's game was back and forth through the first few minutes of the fourth quarter before the Suns took over.\nThey scored 10 straight points, with eight coming on free throws, to take a 117-110 lead with 1:03 left and send fans streaming for the exits.\nFour of those free throws came from Devin Booker and he added two more down the stretch to put it out of reach.\n\"We knew our effort was going to be consistent, and we can sustain it, but we have to learn how to finish games and finish halves,\" coach Earl Watson said. \"We took a step in the right direction tonight.\"\nTyson Chandler added 21 points for the Suns. Harden led Houston with 30.\nThe game was tied at 103 midway through the fourth quarter when Archie Goodwin made two free throws and Tucker added a layup seconds later to put Phoenix up 107-103.\nPhoenix led by four with about 5 1/2 minutes left when Houston scored the next seven points, highlighted by an alley-oop dunk by Clint Capela and helped by three turnovers by the Suns, to make it 110-107.\nRockets coach J.B. Bickerstaff tried a variety of different lineups, with everyone on the roster getting minutes except for Terrence Jones. He played Josh Smith for almost 18 minutes after playing him only once in the previous 16 games.\nNow the interim coach is left to try to salvage a season that has taken another bad turn.\n\"You've just got to win,\" he said. \"Whatever it is going forward you've got to win. It's the only thing that matters.\"\nThe Rockets led by three at halftime and scored the first 10 points of the third quarter to take a 70-57 lead with 9 minutes left in the quarter. The Suns were awful in that span, committing four turnovers, with two of them coming on shot clock violations.\nTucker finally got the Suns going after that, scoring all of Phoenix's points in a 10-5 run that cut the lead to 75-67 midway through the quarter.\nThe Suns led by four later in the period after a 3-pointer by Booker, but Harden scored the last five points of the quarter to take a 90-89 lead into the fourth.\nTIP-INS\nSuns: Goodwin finished with 16 points. ... The Suns got 36 second-chance points to just eight by Houston. ... Tucker had 12 rebounds and Chandler grabbed 10.\nRockets: Bickerstaff received a technical in the second quarter for arguing with officials. ... Trevor Ariza had 22 points. ... Dwight Howard had 10 points, seven rebounds and four blocks.\nYAO HONORED\nThe Rockets honored Yao Ming for being elected to the Naismith Memorial Basketball Hall of Fame during the second quarter. They showed a video of his career highlights on the large screens at the arena before congratulating him on the honor. Yao, the top overall pick in 2002, was an eight-time All-Star who spent his entire career with the Rockets. Yao is in China and wasn't in town Monday for the announcement of the Hall of Fame or for Thursday's game. He will be enshrined in the Hall of Fame in September.\nUP NEXT\nSuns: Visit New Orleans on Saturday.\nRockets: Host Lakers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994596.253369
}