{
  "game_id": "0021500951",
  "espn_id": "400828838",
  "date": "Mar 09, 2016",
  "matchup": "HOU @ PHI",
  "headline": "Harden, Howard help Rockets fend of 76ers, 118-104",
  "body": "PHILADELPHIA --  Houston Rockets coach J.B. Bickerstaff wasn't surprised to see Jason Terry come through in the clutch.\n\nThat's what he's been doing for nearly two decades.\n\nJames Harden scored 29 points, Dwight Howard had 21 points and 18 rebounds, and the Rockets beat the Philadelphia 76ers 118-104 on Wednesday night.\n\nTerry, a 17-year NBA veteran, finished with 10 points off the bench, seven in the final four minutes after the Sixers had cut Houston's lead to two.\n\n\"Jason Terry did what he does,\" Bickerstaff said. \"He hits huge shots. He's clutch. He's been that way for a long, long time.\"\n\nPatrick Beverly added 16 points -- all in the first half -- and Trevor Ariza finished with 15 for Houston. The Rockets, currently holding the eighth and final playoff spot in the Western Conference, have won three of four to even their record at .500.\n\nIsh Smith scored 21 points and Nerlens Noel and Robert Covington had 17 points apiece for the Sixers (8-56), who lost their 13th straight despite a big fourth-quarter rally.\n\nHarden, who poured in 50 points in Houston's only other meeting with Philly this season, shot just 8 for 26 from the field and was held to five points on only one field goal through the first 1  1/2 quarters. But the NBA's second-leading scorer finished with nine rebounds and eight assists while shooting 13 for 13 from the free throw line.\n\n\"We've just got to continue to do the things that we're doing that's making us successful,\" Harden said. \"Defensively, we're really keying and shutting teams down. And offensively, we're sharing the basketball, moving around and guys are just playing well.\"\n\nTrailing by 16 early in the fourth quarter, the Sixers went on a 13-0 run to pull within 95-92 with 8:08 left. Smith had nine points and an assist during the stretch, beginning it with a 3-pointer and ending it with a pull-up jumper over Harden that got the crowd on its feet.\n\nA floater in the lane from Smith trimmed Houston's lead to 105-103 with 4:02 left, before Terry drilled back-to-back 3-pointers -- getting fouled on the second and hitting the ensuing free throw -- to put Houston ahead 112-103 with 2:14 left and seal the victory.\n\n\"Those were big shots,\" Smith said of the 38-year-old Terry. \"He hits one there from the corner when we closed on him hard. And he still made it.\"\n\nPHILLY FLASHBACKS\n\nAfter the Rockets fell behind by nine early in the second quarter, K.J. McDaniels helped Houston take a 61-52 lead into halftime by finishing a sensational no-look lob from Harden and punctuating the first half with an acrobatic follow dunk in the final seconds.\n\nHe had 10 points in the first half after scoring a total of 30 all season coming into the game, before finishing with 12.\n\n\"It brought back flashbacks,\" said McDaniels, who was drafted by the Sixers in 2014 before getting dealt to the Rockets during his productive rookie season. \"This is where it all started. I'm just happy Coach gave me the opportunity to go out and play.\"\n\nBickerstaff said McDaniels earned the 17 minutes of action he got Wednesday, correctly believing that the 6-foot-6 swingman could create matchup problems against his former team.\n\n\"K.J.'s worked his behind off,\" Bickerstaff said. \"He put himself in the position where if you need him, he's prepared to play.\"\n\nINJURY ISSUES\n\nWhile Noel (knee) and Nick Stauskas (upper-respiratory infection) both returned to the lineup after sitting out Philly's last two games, rookie Jahlil Okafor missed his fifth straight contest with a knee injury.\n\nBefore the game, coach Brett Brown said Okafor had a CT scan on his knee Tuesday and the team would know more about the extent of the injury shortly. The center is also dealing with a separate shin contusion.\n\nTIP-INS\n\nRockets: Houston has won five straight vs. Philadelphia. . The Rockets improved to 2-1 on their five-game road trip. . Signed earlier in the day, guard Andrew Goudelock joined the team in Philly but did not play.\n\n76ers: Noel finished with eight offensive rebounds, the most recorded by a Sixers this season. . Covington led all players with four steals and also had seven rebounds and four assists, one of which was a highlight-reel alley oop to Jerami Grant (13 points). . Sonny Weems suited up for his first game with the Sixers but did not play. He was claimed off waivers Monday after being released by the Phoenix Suns. . Former Sixers star Allen Iverson was in the house, receiving a rousing standing ovation when he was shown on the overhead scoreboard.\n\nUP NEXT\n\nRockets: Visit Boston on Friday night.\n\n76ers: Host Brooklyn on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994613.9546628
}