{
  "game_id": "0021600235",
  "espn_id": "400899685",
  "date": "Nov 25, 2016",
  "matchup": "OKC @ DEN",
  "headline": "Westbrook has triple-double, leads OKC comeback for OT win",
  "body": "DENVER --  The Denver Nuggets contained Russell Westbrook for three quarters, but he took over with the game slipping away from Oklahoma City.\n\nWestbrook had 36 points, 18 assists and 12 rebounds for his sixth triple-double, and the Thunder beat the Denver Nuggets 132-129 in overtime on Friday night.\n\nWestbrook scored 24 points in the fourth quarter and overtime to help the Thunder rally from 13 down and end a three-game losing streak. His 18 assists were a season high and the most in an NBA game this season.\n\n\"It's happened a couple of games. It's happened at different points throughout the year,\" Thunder coach Billy Donovan said. \"It's his will, his competitiveness and get our team in a position where we had a chance.\"\n\nVictor Oladipo had 26 points for the Thunder and a couple of key buckets late in the fourth, one off a steal.\n\n\"He did a great job, using his size, his length, getting out in transition and getting steals,\" Westbrook said. \"That helped us a lot, got us easy buckets.\"\n\nWestbrook scored 17 points in the fourth quarter to start the comeback. His two free throws with 9.5 seconds left made it 122-119, but Denver tied it when Steven Adams fouled Jamal Murray on a 3-point attempt and the rookie hit the free throws.\n\nKenneth Faried blocked Westbrook's layup at the horn to send it into overtime, but the Thunder felt confident after rallying.\n\n\"We've got to win,\" Westbrook said of the mood on the bench. \"Very simple.\"\n\nWilson Chandler finished with a season-high 30 points and 11 rebounds. Jameer Nelson had 21 points and 13 assists, both season highs, for the Nuggets.\n\n\"I thought we played well enough offensively for sure to win the game,\" Nelson said. \"We just couldn't get stops when we needed them.\"\n\nOladipo hit two free throws to put the Thunder ahead 128-126 in overtime. The Nuggets had a chance to tie in the final 20 seconds but Chandler missed a layup and Westbrook hit two more free throws with 13.7 seconds left.\n\n\"We lost a shootout,\" Nuggets coach Michael Malone said. \"My biggest disappointment is that we were never able to consistently get stops. We knew Westbrook at some point was going to go off.\"\n\nTIP-INS\n\nThunder: Westbrook finished an assist shy of his career high. He also had seven turnovers. ... Oklahoma City has used the same starting lineup in all 17 games.\n\nNuggets: Murray finished with 20 points and seven rebounds. ... Denver had just 10 players active. Mike Miller and Will Barton were away from the team for personal reasons. Danilo Gallinari (right thigh), Juancho Hernangomez (right ankle sprain) and Gary Harris were all out. ... Denver Broncos Hall of Famer and current team executive John Elway was sitting courtside.\n\nSCARY MOMENT\n\nMurray took a hard fall when he was fouled on a dunk attempt. He was on the floor for a few minutes but got up and hit the two free throws.\n\nOLD SCHOOL\n\nMalone expressed plenty of admiration for Westbrook before the game. Malone likened the NBA's leading scorer to a bruiser from the days when the league was known for its rough play.\n\n\"I think he's a throwback player,\" Malone said. \"I think he's a guy that would have excelled back in the `80s, which is my favorite period of the NBA when (there wasn't) all this lovey-dovey, hug-and-kissing and no hard fouls. There were real rivalries and everything earned and every game you won had to be earned.\"\n\nUP NEXT\n\nThunder: Host Detroit on Saturday.\n\nNuggets: At Phoenix on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995320.347222
}