{
  "game_id": "0022201159",
  "espn_id": "401469314",
  "date": "Mar 31, 2023",
  "matchup": "SAC @ POR",
  "headline": "Fox has 20 points, playoff-bound Kings beat Blazers 138-114",
  "body": "PORTLAND, Ore. -- — De'Aaron Fox had 20 points and 11 assists and the playoff-bound Sacramento Kings won their second consecutive game against Portland Trail Blazers 138-114 on Friday night.\n\n\r\n              Malik Monk had 20 off the bench for the Kings, who had already secured their first postseason berth since 2006 and home-court advantage for the playoffs with a 120-80 rout of the Trail Blazers on Wednesday. Domantas Sabonis added 20 points and 12 rebounds.\n\n\r\n              Shaedon Sharpe had 27 points for Portland, which has won just one of their last 12. The Blazers were officially eliminated earlier in the night when the Los Angeles Lakers beat Minnesota 123-111.\n\n\r\n              Sharpe's layup got Portland within 110-103 in the fourth quarter, but Monk answered for the Kings with a 3-pointer and Sacramento pushed the lead to 124-105 with 4:23 left on Sabonis' dunk.\n\n\r\n              “I feel like our offense is really flowing right now,\" said Kings rookie Keegan Murray, who also finished with 20 points. \"We're getting the ball to the right guy at the right time, and every guy is making plays. So we all have 100% confidence on the floor and it's really fun to watch.” \n\n\r\n              The win got the Kings closer to clinching the Pacific Division title for the first time since the 2002-03 season, but they were thwarted from clinching it Friday night when the Suns beat the Nuggets 100-93 in the later game. \n\n\r\n              While some teams rest players once the postseason is secured, Sacramento coach Mike Brown said his team had loftier goals. Currently the team is the third spot in the Western Conference behind leader Denver and second-place Memphis.\n\n\r\n              \"Right now, it's too close to think about resting when there's a chance to get to the second spot,” he said. “So we're going to keep playing and when and if everything gets settled and a certain point, then I think we'll revisit then.”\n\n\r\n              Harrison Barnes has also been vocal about wanting to reach the 50-win milestone. The Kings are at 47-30 with five games left.\n\n\r\n              The Blazers, meanwhile, will miss out on the playoffs for the second straight season. They hardly resemble the team that started the season.\n\n\r\n              Portland (32-45) listed its regular starters out with injuries, including Damian Lillard (right calf), Jusuf Nurkic (right knee), Anfernee Simons (right foot) and Jerami Grant (left quad).\n\n\r\n              The Blazers signed Skylar Mays and Shaq Harrison to 10-day contracts Thursday, and both played Friday. Harrison played this season with the G League South Bay Lakers and Mays, who started, played most recently with the G League's Mexico City Capitanes. Mays finished with 14.\n\n\r\n              Portland kept up for much of the opening half, with Sacramento unable to stretch the lead to double digits until Sabonis' basket made it 61-51 with 3:27 left. The Kings led 71-59 at the break.\n\n\r\n              Portland's Nassir Little hurt his left ankle in the second quarter and did not return.\n\n\r\n              Coach Chauncey Billups didn’t mince words about where the Blazers are at the end of the season. \n\n\r\n              “It always sucks to lose,” he said. To get to this point in the season, I didn’t think we would be here last year, to be honest with you, but we are. These games are tough. Tough on me, tough at all levels.” \n\n\r\n              TIP-INS\n\n\r\n              Kings: Murray, who set a rookie record for made 3-pointers against the Blazers on Wednesday, led all scorers with 10 points in the opening quarter. He had four more 3s on Friday night. ... Sabonis had his 63rd double-double of the season, passing Oscar Robertson for eighth place on Sacramento's career list. \n\n\r\n              Trail Blazers: Billups praised Brown, saying he should be a candidate for Coach of the Year. “They play fast as hell, and you know you’re going to have a hard time keeping them under 120, 125 (points) every single night, so he’s been incredible and I think he’s right up there for Coach of the Year with what he’s been able to do with their team.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: Host San Antonio on Sunday. \n\n\r\n              Trail Blazers: Visit the Timberwolves on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995281.78657
}