{
  "game_id": "0022300393",
  "espn_id": "401585021",
  "date": "Dec 23, 2023",
  "matchup": "MEM @ ATL",
  "headline": "Ja Morant scores 30 points in 125-119 win over Hawks as Grizzlies move to 3-0 since his return",
  "body": "ATLANTA -- — On a scale of 1 to 10, Ja Morant was quick to give his rating of how his first three games with the Memphis Grizzlies have gone this season.\n\n\r\n              “A 10,” he said. “We won. That’s what we shoot for, that’s what we play for.”\n\n\r\n              Morant had 30 points and 11 assists as Memphis moved to 3-0 since his return with a 125-119 victory over the Atlanta Hawks on Saturday night.\n\n\r\n              Desmond Bane had 37 points for the Grizzlies, who had not won three straight games all season while stumbling to a 6-19 start as Morant served a 25-game suspension for waving a gun multiple times on social media. Bane also had seven rebounds and six assists.\n\n\r\n              “There’s definitely more spirit when you win games,” Bane said. “It is just natural. We’re definitely feeling good about where we’re at and we’ve got more players coming back to keep it going.”\n\n\r\n              Trae Young made history in defeat, finishing with 30 points and 13 assists. It was his seventh consecutive game with at least 30 points and 10 assists, tying Oscar Robertson for the longest such streak in NBA history. Robertson set the record from December 1964 to January 1965. The Hawks are 3-4 in those seven games.\n\n\r\n              Jaren Jackson Jr. had 20 points on 8-for-10 shooting for Memphis.\n\n\r\n              The Grizzlies' decisive run came after the game was tied at 106. Memphis scored nine straight points, with Morant capping the spurt with a floater over Young in the lane with 3:37 to play. The Hawks never got closer than four after that.\n\n\r\n              Morant's offensive brilliance was on full display as he scored from the lane, the wings, 3-point range and from above the rim with two dunks. He found teammates cutting when the Hawks sent help his way and helped the Grizzlies shoot over 50% for the third time since he returned. That is a first this season for Memphis, which had 29 assists.\n\n\r\n              “I’ve pretty much been here, so I know what type of team we can have and what type of noise we can make in this league,” Morant said. “We didn’t start how we wanted to, but we’re where we need to be. We’re hungry and people are doubting us. That’s when we are at our best.”\n\n\r\n              The Grizzlies allowed 17 second-chance points during the first half, but only four after halftime.\n\n\r\n              “We were down 10 at halftime and I told the team we are guarding pretty well. It was just the second-chance points,” coach Taylor Jenkins said. “There was a better commitment there, a better level of physicality.”\n\n\r\n              The Hawks closed the first half on a 9-3 burst to take a 60-50 lead into the break. Atlanta did not trail for the final 20:32 of the first half after taking an 11-10 lead. In the third quarter, however, the Grizzlies closed the gap with a 10-0 run to start the period.\n\n\r\n              Hawks starting forward De'Andre Hunter missed his second straight game with knee soreness.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit the New Orleans Pelicans on Tuesday in the second game of a four-game trip.\n\n\r\n              Hawks: At the Chicago Bulls on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996028.403727
}