{
  "game_id": "0022200204",
  "espn_id": "401468359",
  "date": "Nov 14, 2022",
  "matchup": "MIL vs. ATL",
  "headline": "Hunter, Young lead Hawks past Giannis, Bucks 121-106",
  "body": "MILWAUKEE -- — De’Andre Hunter scored 24 points and Trae Young had 21 points and nine assists, leading the Atlanta Hawks to a 121-106 victory over Giannis Antetokounmpo and the Milwaukee Bucks on Monday night.\n\n\r\n              Clint Capela added 19 points and 10 rebounds as Atlanta won for the fifth time in seven games. Dejounte Murray also scored 19, and John Collins had 16 points and nine boards. \n\n\r\n              “I thought our guards did a really good of establishing the tempo and making them work on the defensive end,” Hawks coach Nate McMillan said. “Defensively, we didn’t give up anything easy.”\n\n\r\n              Antetokounmpo, who missed the last two games and three of the last four with left knee soreness, scored 27 points in 31 minutes. The Bucks have lost three of four after a 9-0 start.\n\n\r\n              Antetokounmpo made 8 of 21 shots, missing all three 3-point attempts, and was 11 of 18 from the free-throw line. Antetokounmpo said he was a bit rusty in his first game back.\n\n\r\n              “When was the last time I played, like six or seven days ago, a week ago?” Antetokounmpo said. “But that’s part of it. You can’t get too low or get too high. It’s part of it. You can’t expect to be at your best when you haven’t played for a week.”\n\n\r\n              Atlanta led 94-80 entering the final period. Milwaukee scored eight consecutive points to close to 108-99 with 3:12 left. Antetokounmpo fouled out with 1:35 remaining, and Murray hit both free throws to make it 116-101.\n\n\r\n              “They move the ball. They have a lot of capable players that can go one-on-one,” Antetokounmpo said. “Capable scorers, good shooters.”\n\n\r\n              It was the third meeting between the teams in 16 days. The Bucks suffered their first loss of the season at Atlanta a week ago.\n\n\r\n              “The scoring was really well distributed for them tonight,” Bucks coach Mike Budenholzer said. “They’ve beat us different ways. The guards have had big nights. Tonight, there was a lot of balance.”\n\n\r\n              MarJon Beauchamp had 20 points for the Bucks, who lost for the first time at home after seven victories.\n\n\r\n              Atlanta scored 34 points in the paint in the first half en route to a 63-50 lead at the break. The Hawks shot 56.3% in the first half, compared to 39.5% for the Bucks, who were just 3 of 14 from beyond the arc.\n\n\r\n              “Right away, I knew that going against a team like that we’ve got to be the aggressor,” Capela said. “As far as defensive-wise, I feel that’s my job is trying to set the tone.”\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Bogdan Bogdanovic (knee) remained out. He has yet to play this season.\n\n\r\n              Bucks: Both F Khris Middleton (wrist surgery) and G Pat Connaughton (right calf strain) remain out, but are getting closer to returning. Coach Mike Budenholzer said the Bucks have been cautious with both. ... G Jrue Holiday (right ankle sprain) missed his third straight game. G Grayson Allen left with an ankle sprain after playing 10 minutes and did not return. “We’ll just no more in the morning and I’ll leave it at that,” Budenholzer said. \n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host the Boston Celtics on Wednesday.\n\n\r\n              Bucks: Host the Cleveland Cavaliers on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994600.957206
}