{
  "game_id": "0021600126",
  "espn_id": "400899576",
  "date": "Nov 11, 2016",
  "matchup": "OKC vs. LAC",
  "headline": "Griffin scores 25 to help Clippers beat Thunder 110-108",
  "body": "OKLAHOMA CITY --  After four straight blowout victories, the Los Angeles Clippers learned they can handle business in a close game.\n\nBlake Griffin scored 25 points, and the Clippers beat the Oklahoma City Thunder 110-108 on Friday night to improve the league's top record and the best start in franchise history to 8-1.\n\nOklahoma City's Russell Westbrook missed what would have been a game-winning 3-pointer in the closing seconds.\n\nThe Clippers had won their previous four games by an average of 24.5 points, so coach Doc Rivers wasn't sure how his team would handle a game with a tight finish. Los Angeles focused on slowing Westbrook, who burned them for 35 points in Oklahoma City's 85-83 win in Los Angeles earlier in the month that gave the Clippers their only loss so far.\n\nEven though Andre Roberson and Domantas Sabonis found their shooting strokes as the Thunder made 16 of 28 3-pointers, the Clippers stuck to their defensive game plan.\n\n\"This is one of those games you can lose your trust in,\" Rivers said. \"Roberson was making 3s, Sabonis was making 3s, and we're telling our guys to stay and clog the paint. And they're looking at me like, `Why?' We did it, and it worked out for us.\"\n\nJamal Crawford scored 19 points and Chris Paul added 17 points and 10 assists for the Clippers.\n\nWestbrook had 29 points, 14 rebounds and nine assists, but he made just 9 of 25 shots. Victor Oladipo scored 18 points, Enes Kanter had 13 points and 11 rebounds and Roberson added 13 points and nine rebounds for Oklahoma City (6-3).\n\nThe game was tied at 50 at halftime. The Clippers went on an 8-1 run early in the third quarter, highlighted by a spinning layup and 3-pointer by J.J. Redick, to go up 65-56. Griffin had 15 points on 7-for-8 shooting in the period to help the Clippers take an 82-74 lead in the fourth.\n\n\"I think our offense, spacing-wise, was really good,\" Griffin said. \"We attacked more, got out in transition, got some rebounds. Defensive stops led to some easy buckets.\"\n\nWestbrook tied the game at 102 with a 3-pointer with just over 2 minutes remaining, but the Clippers responded with a dunk by DeAndre Jordan and a 3-pointer by Crawford.\n\nThe Thunder rallied again, but Westbrook's 28-footer was just off in the final seconds.\n\n\"Yeah, I probably should have drove it, but it was all right,\" Westbrook said.\n\n---\n\nTIP-INS\n\nClippers: Committed just five turnovers in each half. ... Jordan had 12 points and 13 rebounds. ... Jordan was called for a technical foul early in the third quarter.\n\nThunder: Held the Clippers to 22.7 percent shooting in the first quarter to take a 24-16 lead. ... Oladipo scored 11 points in the first quarter. ... Westbrook was called for a technical after he disagreed with a foul call early in the third period. ... Roberson set a new career high with three 3-point goals. ... Sabonis made 4 of 5 3-pointers.\n\nHAPPY HOMECOMING\n\nGriffin, an Oklahoma City native, has been booed in the past because he's been a thorn in the Thunder's side. Now, with Kevin Durant gone, the fans have dreams of landing him in free agency. They showered Griffin with cheers during pregame introductions, which surprised him.\n\n\"A little bit, but it's always nice to come back home,\" he said.\n\nQUOTABLE\n\nPaul, on how he guarded Westbrook: \"I did a lot differently tonight guarding Russ,\" he said. \"I didn't. It was Luc Mbah a Moute. That was the difference. I only guarded him a few times tonight.\"\n\nUP NEXT\n\nThe Clippers play at the Minnesota Timberwolves.\n\nThe Thunder host the Orlando Magic and former teammate Serge Ibaka.\n\n---\n\nFollow Cliff Brunt on Twitter (at)CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995333.4731789
}