{
  "game_id": "0021400657",
  "espn_id": "400578949",
  "date": "Jan 25, 2015",
  "matchup": "CHI vs. MIA",
  "headline": "Heat's Hassan Whiteside has 12 blocks as part of triple-double",
  "body": "CHICAGO -- Hassan Whiteside bounced around the NBA Development league and played in China and Lebanon, hoping NBA teams were keeping tabs and would give him an opportunity.\nHe was in Charlotte, working out at the downtown YMCA, a few months ago. He then got his chance with the Heat and he's making the most of it.\n\nWhiteside had an unconventional triple-double with a career high 12 blocks to go with 14 points and 13 rebounds to help Miami beat the sluggish Chicago Bulls 96-84 Sunday.\n\"It's a blessing. Like I told my teammates, you won't believe how things work out in life,\" said Whiteside, who signed with Miami in late November. \"Three months ago I was at the downtown Y just chilling, working on my game. I couldn't get a team to pick up the phone.\"\nOn Sunday, he made the Bulls miserable. His teammates did their part, too.\nDwyane Wade scored 26 points, and Chris Bosh finished with 20.\nLuol Deng scored 15 in his return to Chicago. Mario Chalmers had 15 points, and the Heat squashed whatever momentum the Bulls appeared to be building after beating San Antonio and Dallas.\nMiami led by 10 at halftime, 12 going into the fourth quarter and remained in control the rest of the way.\nWade and Bosh came through with strong performances. Deng had 10 rebounds and four assists in his first game at the United Center since the Bulls traded him to Cleveland last season. And Whiteside wreaked all kinds of havoc in just 24 minutes after missing two games with a sprained right ankle.\nPau Gasol had 13 points and 17 rebounds for Chicago, giving him 50 over the past three games. Derrick Rose scored 19 for Chicago but missed all six 3-pointers.\nAaron Brooks scored 17. But Chicago fell to 13-11 at home.\nIt was certainly not what the Bulls had in mind after handing the Spurs their most lopsided loss of the season Thursday in Chicago and then winning at Dallas the following night. Those two wins on the heels of a 2-6 slide seemed like strong signals they were coming around. But this was a big step back. Worse, the Bulls are staring at a tough six-game trip that starts Tuesday at Golden State.\n\"I don't know if there's a straight explanation for it,\" Gasol said. \"We understand the importance of every game, especially here at home. We're trying to get ourselves going, get in some kind of rhythm but we haven't been able to do it yet.\"\nThe Bulls were within 83-76 after Brooks' four-point play with 6:36 left in the game. But the Heat stayed in control thanks to three dunks by Whiteside in about a two-minute span.\nThat spree started with an alley-oop from Chalmers and continued with a dunk over Gasol off a feed from Deng to make it an 11-point game.\nWhiteside then answered a layup by Chicago's Taj Gibson with another dunk, his third in about a two-minute span.\n\"What he's doing is, of course, more than I expected,\" Bosh said. \"But I kinda saw the fit (after he signed). He's just playing at a high level right now. I just want him to stay grounded, just continue to work.\"\nCOMING HOME\nIt was an emotional day for Deng, who was back at the United Center for the first time since the Bulls traded him to Cleveland last year. He spent his first nine-plus seasons in Chicago.\n\"I have so many friends here,\" Deng said. \"You've got everyone (on) your phone (saying) `I can't wait to see you.' It's a lot of distractions at the same time, but it's also exciting.\"\nThe Bulls honored Deng with a video tribute, showing clips of his time in Chicago, during a timeout in the first quarter.\nTIP-INS\nHeat: Whiteside's previous career high was five blocks. ... Bosh scored his 16,000th career point in the first quarter.\nBulls: Chicago was again without Mike Dunleavy Jr., who missed his 13th straight game because of a right ankle injury. The Bulls keep saying he's close to returning, but coach Tom Thibodeau said he is \"just not comfortable enough to be in a game.\"\nUP NEXT:\nHeat: Host Milwaukee on Tuesday.\nBulls: Visit Golden State on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764991675.485145
}