{
  "game_id": "0021600284",
  "espn_id": "400899726",
  "date": "Dec 02, 2016",
  "matchup": "LAL @ TOR",
  "headline": "Raptors beat Lakers 113-80",
  "body": "TORONTO --  Even though it is Kyle Lowry currently shooting lights out for the Toronto Raptors, second-year man Norman Powell is only too happy to take the credit.\n\nLowry had 24 points and seven assists for the Raptors in a 113-80 victory over the Los Angeles Lakers on Friday night, compared to Powell's 16. But according to Powell, it's his pre-game tradition with the All-Star guard that is powering his hot hand.\n\n\"We have a little shooting competition, the first to make five from five spots, and ever since we've started doing that he's been lighting it up, so I'm taking credit for it,\" Powell said jokingly after the game, Toronto's season-high fifth straight victory and a fourth consecutive win over the Lakers.\n\nLowry, who has scored 20-plus points in his last six games against the Lakers, averaging 24.8 points, was only too happy to back up his teammate's claim.\n\n\"He can take credit. My teammates, they can all have the credit,\" he said. \"My teammates are the reason I'm able to do the things that I'm able to do.\"\n\nLowry tied his season high for 3-pointers, going 6 of 9 from beyond the arc as the Raptors registered their biggest win of the season. The 33-point victory surpassed the 27-point win over Philadelphia on Oct. 28.\n\nStill, coach Dwane Casey was more interested in his team's defensive performance, as Toronto held Los Angeles to an opponent season low of 80 points and .344 shooting from the field. The Raptors were particularly dominant in the second quarter, outscoring the Lakers 41-26 while shooting 75 percent from the field.\n\nBut it takes more than that to impress the Raptors' coach.\n\n\"Case don't say nothing about offense. Case don't care,\" said DeMar DeRozan, who had 16 points. \"Everything that comes out of his mouth is defense.\"\n\nEven though the game was the Lakers' third in four nights, coach Luke Walton was not about to use that as an excuse.\n\n\"I felt like we weren't mentally ready to compete against one of the better teams in the NBA tonight,\" he said. \"I don't know if that's just fatigue from the travel and the road trip so far. Even if it is it can't be an excuse in this league.\"\n\nBrandon Ingram had 17 points for the Lakers, who are 1-2 on their four-game road trip. Meanwhile their bench, the top scoring unit in the NBA, chipped in with Jordan Clarkson's 14 and former Raptor Lou Williams' 13.\n\nThe Lakers were held to just 14 points in the third quarter and 32 points in the second half, as Toronto successfully nursed a 21-point halftime lead all the way to the end, emptying its bench and giving minutes to some of its lesser lights.\n\n\"You have to give them credit, they played really good,\" former Raptor Jose Calderon said. \"They kept making shots in the right moment and played good defense. We didn't find a guy today who was really hot or going.\"\n\nTIP-INS\n\nLakers: G D'Angelo Russell (left knee) missed his seventh consecutive game and F Nick Young (right calf) sat out his second straight contest. ... F Julius Randle played his 100th NBA game Friday night. He has 39 double-doubles over that span. ... Williams has made a free throw in 29 straight games, the longest active streak for a Lakers bench player.\n\nRaptors: Usual starting F DeMarre Carroll was rested in the opening game of Toronto's first back-to-back home games since the 2008-09 season as the Raptors continue to exercise caution after Carroll's knee surgery late last season. Powell started in his place. ... DeRozan's six assists extended his career-long streak with at least four assists to 11 games. ... Lowry has made multiple 3-pointers in 10 straight games, tied for the longest such streak of his career.\n\nKERR-AZY VOTERS\n\nDespite leading the Lakers to a surprising 10-10 record over the first month of the season, Walton was passed over for Western Conference coach of the month in favor of his former boss, Steve Kerr of 16-2 Golden State.\n\n\"I'm furious that Steve Kerr won coach of the month,\" Walton said jokingly. \"No, I'm happy for him obviously. It doesn't matter to me who wins coach of the month. We're trying to do something that's bigger than individual awards.\"\n\nDOMINATING FROM DOWNTOWN\n\nThe Raptors, who shot 41.4 percent from 3-point range, had double-digit 3-pointers (12) for the fifth straight game. Lowry led the way with six, and in his last four games is shooting 71 percent (20 of 28) from beyond the arc.\n\nMOVING ON UP\n\nDeRozan's six field goals saw him pass Vince Carter (3,536) for second on the franchise's all-time list. Chris Bosh leads the way with 3,614.\n\nUP NEXT\n\nLakers: Will look to end a five-game losing streak in Memphis when they face the Grizzlies on Saturday.\n\nRaptors: Aiming for sixth straight win when they host Atlanta on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995434.768739
}