{
  "game_id": "401810086",
  "espn_id": "401810086",
  "date": "Nov 15, 2025",
  "matchup": "MIL vs LAL",
  "headline": "Doncic scores 41 points, Reaves adds 25 as Lakers roll to 119-95 win against Bucks",
  "body": "MILWAUKEE -- — Luka Doncic had 41 points and nine rebounds, Austin Reaves added 25 points and eight assists, and the Los Angeles Lakers beat the Milwaukee Bucks 119-95 on Saturday night. \n\n\r\n              Deandre Ayton had 20 points and 10 rebounds for the Lakers.\n\n\r\n              Both teams were playing the second game of a back-to-back, with each notching wins in NBA Cup games on Friday night.\n\n\r\n              The Lakers played without Rui Hachimura (calf tightness) and Marcus Smart (illness). LeBron James also remained out with sciatica and has missed all 14 games this season.\n\n\r\n              Giannis Antetokounmpo had 32 points and 10 rebounds, AJ Green scored 15 points and Gary Trent Jr. added 13 for the Bucks (8-6), who couldn’t overcome ice-cold first-half shooting and ended with a season-low point total.\n\n\r\n              The Lakers led by as many as 13 points and held a 30-18 lead after one quarter. Milwaukee was just 3 for 12 from deep in the period.\n\n\r\n              The Lakers blew it wide open in the second quarter and took a 65-34 lead at the half. Milwaukee made just 10 of 41 shots (24%) and 4 of 21 (19%) from long range in the first half while Los Angeles made 23 of 42 (55%) overall while going 5 for 13 (38%) from 3-point range.\n\n\r\n              Milwaukee opened the third quarter on a 20-5 run sparked by three 3-pointers from AJ Green, who made four from deep in the quarter. The Bucks scored 38 points in the quarter and pulled within 14 points before Doncic closed the period with eight points to give the Lakers a 20-point cushion.\n\n\r\n              Strong 3-point shooting pulled the Bucks to within 13 early in the fourth but the Lakers withstood the rally. \n\n\r\n              Up Next\r\n              Lakers: Host Utah on Tuesday night.\n\n\r\n              Bucks: At Cleveland on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042631.596591
}