{
  "game_id": "0021400335",
  "espn_id": "400578627",
  "date": "Dec 12, 2014",
  "matchup": "OKC @ MIN",
  "headline": "Westbrook's 34 help Thunder beat Wolves, 111-92",
  "body": "MINNEAPOLIS -- Before the season, Oklahoma City coach Scott Brooks declared that Russell Westbrook was the best point guard in the NBA.\nSince returning from a broken hand, Westbrook is backing up that boast.\nWestbrook scored 20 of his 34 points in the first half and the Thunder beat the Minnesota Timberwolves 111-92 on Friday night for their fifth straight victory.\n\"He's a walking triple-double,\" Kevin Durant said of his teammate. \"He passes as good as any point guard. He scores better than any point guard. He rebounds better than any point guard. He plays defense better than any point guard. I don't see what the debate is.\"\nDurant added 16 as he and Westbrook played the second night of back-to-back games for the first time since returning to the Thunder lineup.\nWhile his coach and star teammate were talking him up after the win, Westbrook kept his head down and focused on the Thunder using another win to get back to where they were before all the injuries.\n\"Slowly, but surely,\" Westbrook said. \"Trying to take care of business.\"\nAndrew Wiggins and Shabazz Muhammad each scored 18 points for Minnesota, which hung around in the second half after allowing the Thunder to score a season-high 70 in the first half.\n\"I was happy we finally competed, but it took us a long time to really compete, which was disappointing,\" Wolves coach Flip Saunders said.\nSteven Adams scored a season-high 16 points and grabbed 11 rebounds for Oklahoma City. Anthony Morrow added 14 points off the bench, all in the first half.\nThe Thunder took an 87-63 lead with 3:54 left in the third after Durant found Westbrook for an easy bucket inside off a no-look pass.\nMinnesota cut the deficit to 95-84 following Corey Brewer's breakaway layup with 8 minutes left in the fourth, but Durant nailed a 3 out of a timeout and the Thunder quickly regained control.\nWestbrook shot 12 of 19 and had his pre-injury swagger back, pounding his chest after big shots and giving an angry glance at a fan who yelled at him following a missed dunk in the third.\n\"Russell set the tone of the game,\" Brooks said.\nFor Minnesota, Thaddeus Young had 16 points and Gorgui Dieng added 11 points and nine rebounds, but it wasn't good enough to get the Wolves their first two-game winning streak of the season.\n\"OKC knows they've got to win every game and I think we didn't come out with any sense of urgency in the first quarter,\" Muhammad said.\nTIP-INS\nThunder: Since 2010-11, the Thunder have gone 173-64 with Durant, Serge Ibaka and Westbrook in the starting lineup. ... Oklahoma City has won 18 of its last 21 games against Minnesota. ... Ibaka and Adams shot 7 of 8 and scored 15 points in the game's first seven minutes.\nTimberwolves: PG Mo Williams missed his fifth game with back spasms for the beat-up Wolves. ... Muhammad played through a lingering ankle injury. ... Brewer had four steals, the third straight game he's swiped at least three.\nRUBIO REHABBING\nSaunders said that PG Ricky Rubio is now using an anti-gravity treadmill to rehab his injured ankle. He could test the ankle on land by the middle of next week. \"You can see he really wants to get back,\" Saunders said. \"We've got to hold the reins on him a little bit.\"\nDURANT'S MINUTES\nBrooks said he hasn't talked with Durant about when and how the MVP's minutes might be bumped up from around 30 per game. \"He understands it's the process of him coming back,\" Brooks said. \"He's doing a great job.\"\nBUSY TRAINING ROOMS\nAbout a third of the way through the season, Thunder and Wolves players combined have missed 153 games because of injury.\nUP NEXT:\nThunder: Hosts Phoenix on Sunday.\nTimberwolves: Host the Los Angeles Lakers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764991922.2770119
}