{
  "game_id": "0022000113",
  "espn_id": "401267273",
  "date": "Jan 06, 2021",
  "matchup": "MIL vs. DET",
  "headline": "Fast start helps Bucks breeze past Pistons 130-115",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 25 points and Khris Middleton added 23 as the Milwaukee Bucks rolled past the Detroit Pistons 130-115 on Wednesday night for their third straight victory.\n\n\r\n                    The Bucks and Pistons faced off in Milwaukee for the second time in three nights. The Bucks (5-3) beat the Pistons 125-115 on Monday and have won their last nine regular-season meetings with Detroit.\n\n\r\n                    Even without fans in the stands, the Bucks own a perfect 4-0 record at Fiserv Forum, where they’re outscoring teams by an average margin of 23.5 points.\n\n\r\n                    “We miss our fans, but we're still playing at Fiserv,” Bucks coach Mike Budenholzer said. \"It's comfortable. Our day-to-day routine and rhythm, we're trying to keep as much of that in place. Hopefully we can continue to make this a great place for us.\"\n\n\r\n                    Milwaukee was ahead 82-56 at halftime, led by as many as 34 in the third quarter and coasted to the win.\n\n\r\n                    Jerami Grant had 31 points for the Pistons (1-7) to lead all scorers. Pistons rookie Saddiq Bey had 20 points and 10 rebounds while shooting 6 of 10 from 3-point range.\n\n\r\n                    Pistons coach Dwane Casey said his team hurt itself by starting slowly in the first and third quarters.\n\n\r\n                    “We didn't start the right way,” Casey said. “Subsequently, we had a 15-point loss.”\n\n\r\n                    Brook Lopez scored 17 points, Bobby Portis had 16, rookie Jordan Nwora provided 11 and Jrue Holiday added 10 for the Bucks. \n\n\r\n                    Wayne Ellington scored 12 and Derrick Rose had 10 for the Pistons. Rose left the game early with a bruised right knee.\n\n\r\n                    The game got a bit testy in the closing minutes with physical play that included Antetokounmpo falling to the floor after tangling with Detroit’s Isaiah Stewart. Antetokounmpo went to the Pistons’ bench after the game and exchanged words with Stewart before they were separated.\n\n\r\n                    MAKING A STATEMENT\n\n\r\n                    On the night after a  prosecutor decided not to file charges against a white police officer who shot a Black man in Wisconsin,  both the Bucks and Pistons offered their response  at the start of the game.\n\n\r\n                    After the Bucks won the opening tip, Antetokounmpo held the ball as players from both teams took a knee. After the ensuing inbounds pass, Detroit's Blake Griffin held the ball while players again took a knee.\n\n\r\n                    Budenholzer proposed doing something during the game — when it would be more visible — rather than during the national anthem. The Bucks said they held the ball for seven seconds to reflect the seven times Jacob Blake was shot.\n\n\r\n                    “We know that when the game starts, people are going to be paying attention,” Antetokounmpo said. “That was the right time to do it. It was a great idea by Bud.”\n\n\r\n                    Blake was left paralyzed after getting shot in the back by Kenosha police officer Rusten Sheskey on Aug. 23. The Bucks sat out a first-round playoff game  with the Orlando Magic last summer to protest that shooting. \n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Rookie guard Killian Hayes tore the labrum in his right hip during the third quarter of Monday’s game. The Pistons announced the severity of Hayes’ injury  Wednesday without offering a timetable for his potential return. \n\n\r\n                    Bucks: Milwaukee was 19 of 43 from 3-point range and just missed reaching 20 3-pointers in a game for the fourth time this season. Before this year, the Bucks had made at least 20 3-pointers in a game just four times in franchise history.\n\n\r\n                    UP NEXT\n\n\r\n                    The Bucks host Utah on Friday as they continue a five-game homestand. This will mark the first meeting between the teams since Nov. 25, 2019.\n\n\r\n                    The Pistons return home to face Phoenix on Friday. Detroit has swept its two regular-season matchups with the Suns each of the last three years.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997418.227338
}