{
  "game_id": "0021500472",
  "espn_id": "400828359",
  "date": "Dec 29, 2015",
  "matchup": "MIL @ OKC",
  "headline": "Westbrook and Durant lead Thunder over Bucks 131-123",
  "body": "OKLAHOMA CITY -- Thunder coach Billy Donovan has seen his second unit struggle to preserve leads this season, so he decided this week to make a change, making rookie first-rounder Cameron Payne his backup point guard.\nPayne's second outing started roughly Tuesday night against Milwaukee, as he picked up two fouls in his first minute of action. That's when All-Star Russell Westbrook came over during a dead ball and had some advice for his understudy.\n\"I just told him to play his game and not let those fouls mess up his rhythm,\" said Westbrook. \"Because two quick fouls can mess up your rhythm, mess up your game, so I told him to just keep playing.\"\n\nThe rookie took the advice to heart, scoring seven points in the next six minutes to help bring the Thunder back from a late first quarter deficit. When he hit a 3-pointer at the buzzer off a feed from Kevin Durant, Payne was back in his comfort zone and had already surpassed his previous career high.\n\"All I can say is hard work pays off. Just stay in the gym, keep working,\" said Payne. \"Really it's just the confidence from the other payers that they give me and I just ome out there and play comfortable.\"\n\"I think the one thing I would caution everybody that it's just one game and I know he also played good the last game, but he's going to have his ups and downs,\" Donovan said. \"Cameron has earned, in my opinion the right to have confidence because of the time he's put in the gym.\"\nPayne wasn't finished, adding another run in the fourth quarter to end with 16 points on 5-of-6 shooting, as the Thunder got a big boost from their bench on the way to a 131-123 victory over the Bucks.\nWestbrook (27) and Durant (26) provided their usual output, but in addition to Payne, Enes Kanter led the reserves with 23 points and eight rebounds and Anthony Morrow hot a pair of fourth quarter threes to help keep Milwaukee at bay.\n\"He (Payne) saved us tonight, the second unit saved us tonight,\" said Durant. The first unit didn't play so well. The second unit came through and played big for us.\"\nThe Thunder needed all of that to overcome a career night from Khris Middleton, who had 36 points on 13-of-22 shooting, including 6-of-9 from three. Each time Oklahoma City pulled out to double digit leads, Middleton, Giannis Antetokounmpo (27 points, 10 rebounds) and Michael Carter-Williams (19 points) brought Milwaukee back.\nCarter-Williams steal and dunk made it 127-121 with just under a minute remaining, but Middleton's final three of the night bounced away and the Thunder hit their free throws down the stretch to seal the victory.\n\"I was just trying to be aggressive and get the team back in the game,\" Middleton said. \"We're not going to be able to win with just one man doing everything, though. We need to play as a team and figure it out.\"\nOklahoma City has now won 11 of their last 14 games and two straight with Payne inserted into the rotation. They will look to make it three straight against a struggling and depleted Phoenix team on Thursday night. Milwaukee lost on the road for the second straight night and 15th time in 18 tries. They will continue the road trip Thursday in Indiana.\nTERRIBLE TUESDAYS\nThe Bucks are now 0-4 on Tuesdays. The only day other day of the week they've failed to win is Thursday, which is when they will play their next game.\nCHARITY BEGINS AT HOME\nThe Thunder hit 37-of-40 from the free throw line, with Durant and Westbrook combining for 20-of-21. Milwaukee hit just 15-of-22 from the stripe.\nUP NEXT\nBucks: At the Indiana Pacers on Thursday night.\nThunder: Host the Phoenix Suns on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994066.942821
}