{
  "game_id": "0022301209",
  "espn_id": "401616463",
  "date": "Dec 06, 2023",
  "matchup": "ATL vs. BKN",
  "headline": "Mikal Bridges scores 32, including game-winning basket, as Nets beat Hawks 114-113",
  "body": "ATLANTA -- — Mikal Bridges tied a career high with 45 points on his last trip to Atlanta\n\n\r\n              It wasn’t quite enough to pull out the win.\n\n\r\n              This time, his 32-point effort — including a step-back jumper with 4.5 seconds left — capped one of the most back-and-forth games in NBA history.\n\n\r\n              Bridges' game-winner pushed the Brooklyn Nets to their fifth win in six games, 114-113 over the Atlanta Hawks on Wednesday night.\n\n\r\n              There were 43 lead changes — the most since the NBA began tracking play-by-play in 1996 — along with 11 ties. \n\n\r\n              “You’ve gotta love it,” Brooklyn's Cam Johnson said. “We were trading blows back and forth. That’s what you love as a competitor.\"\n\n\r\n              Bridges held up one finger to signify his first career victory at State Farm Arena after spending his first four-plus seasons with the Phoenix Suns in the Western Conference before he was dealt to Brooklyn last year. \n\n\r\n              “It only took six years,” Bridges said with a smile. “I guess it took me getting to the East. I'm so happy to get this dub.\"\n\n\r\n              Atlanta, which has lost four of five, reclaimed a 110-109 lead on Saddiq Bey's two free throws with 35 seconds remaining. \n\n\r\n              But Spencer Dinwiddie spotted Bridges cutting through the lane for a layup that put the Nets back ahead.\n\n\r\n              Dinwiddie hit a free throw to extend the margin to 112-110, only to have Trae Young swish a 3-pointer that put the Hawks ahead again, 113-112, with 17 seconds left.\n\n\r\n              No problem for Bridges. He worked down the clock before knocking down the 18-foot jumper over De'Andre Hunter. \n\n\r\n              “He was calm, cool,” Johnson said. “Trusting the work, getting to his spots. That little step-back had been working for him, so he went right back to it. Didn’t think twice about it. The result was all we could ask for.” \n\n\r\n              The Hawks had one more chance, putting the ball in Young’s hands after he inbounded to Bey and got it right back. \n\n\r\n              The Atlanta guard, who had 30 points, stumbled at the top of the key as he cut between Bridges and Dennis Smith Jr. Young hurled up an off-balance one-hander that bounced off the rim as the horn sounded. \n\n\r\n              He griped that he was fouled, but there was no call coming.\n\n\r\n              “I've played a lot of games in this league so far,” Young said. “I understand it's just one game. You've got to flush it. As terrible as the end result is, you've got to flush it and try to learn from it.”\n\n\r\n              Smith scored 13 points off the bench and turned in a solid effort on Young, whose points came largely through volume. He was 11 of 24 from the field, including 3 of 9 from 3-point range.\n\n\r\n              “He was fired up, and he got me fired up too,” Nets coach Jacque Vaughn said of Smith. “The guys rally around him. It’s contagious.”\n\n\r\n              The game, among those added to the schedule for teams that failed to advance to the playoffs of the NBA's In-Season Tournament, was reminiscent of the teams' previous meeting two weeks ago. \n\n\r\n              Only in that one, the Hawks prevailed 147-145 in overtime despite Bridges' big performance.\n\n\r\n              Atlanta's largest lead in this game was seven points, while Brooklyn was never up by more than four. The largest run for both teams was seven straight points.\n\n\r\n              “Tough to lose the game on the final possession,” Atlanta coach Quin Snyder said. “I thought we played as well defensively as we have in a while. You'd like that effort to be rewarded with a win.” \n\n\r\n              Cam Johnson added 17 points for the Nets, all but two of them in the first half. Dorian Finney-Smith chipped in with 15 points, while Dinwiddie had 13. \n\n\r\n              Bey had 21 points, while Bogdan Bogdanovic scored 20 for the Hawks. \n\n\r\n              UP NEXT\n\n\r\n              Nets: Host the Washington Wizards on Friday night, then hit the road for a five-game West Coast trip.\n\n\r\n              Hawks: Travel to Philadelphia to meet the 76ers, also Friday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996303.517602
}