{
  "game_id": "0021900003",
  "espn_id": "401160625",
  "date": "Oct 23, 2019",
  "matchup": "CHA vs. CHI",
  "headline": "Hornets rookie Washington nets 27 in 126-125 win over Bulls",
  "body": "CHARLOTTE, N.C. --  When Hornets general manager Mitch Kupchak took PJ Washington with the 12th pick in the draft, he suggested the Kentucky forward might spend this season bouncing back and forth between Charlotte and its G League affiliate to gain experience.\n\nWashington had other ideas.\n\nThe 21-year-old was stellar in his NBA debut, scoring 27 points on 7-of-11 shooting from 3-point range as the Hornets opened the post-Kemba Walker era with a thrilling come-from-behind 126-125 win over the Chicago Bulls on Wednesday night. Washington's seven 3s set an NBA record for a player making his debut, and his 27 points were the most since Gordan Giricek in 2002.\n\nWashington, who wasn't named a starter until 90 minutes before tipoff, laughed when asked about the idea of playing in Greensboro.\n\n\"Definitely I used that as motivation,\" Washington said. \"It's not a bad thing to go down to the G League and produce and get some playing time. But I didn't want to. I wanted to be up here on the biggest stage and improve my game every day.\"\n\nWashington won't be going anywhere if he plays anywhere near like he did against the Bulls.\n\nHe led the charge for the Hornets, who made 23 3-pointers, setting an NBA record for the most 3s in a season opener. It was also the Hornets' most 3-pointers in a regulation game. The franchise record is 24, set in a game that had two overtimes.\n\nBackup point guard Devonte Graham was a difference-maker off the bench with 23 points on 6-of-7 3-point shooting to go along with eight assists, while Marvin Williams had 17 points on five 3s. Washington, Graham and Williams were a combined 18 of 25 from 3-point range, offsetting the Bulls' 78 points in the paint.\n\n\"They got open looks and they got comfortable,\" said Chicago's Lauri Markkanen, who finished with 35 points and 17 rebounds. \"Even if our hand was up, they were making shots. So, 23 3s is way too many.\"\n\nCody Zeller added 15 points and 12 rebounds for Charlotte.\n\nTIP-INS\n\nBulls: Outrebounded the Hornets 49-41. ... Allowed the Hornets to shoot 52.3% from 3-point range.\n\nHornets: Coach James Borrego went with Rozier, Dwayne Bacon, Miles Bridges, Zeller and Washington as his starting five, a combination that has just 13 years of combined NBA experience. ... The previous record for points by a Hornets rookie in a season opener was Emeka Okafor with 19. ... Nic Batum left the game in the second half with a broken finger.\n\nGRAHAM STEPS UP\n\nGraham played so well that he replaced high-profile acquisition Terry Rozier at point guard in the game's final minutes. He led the Hornets back from a 10-point deficit with less than 6 minutes remaining, knocking down a pair of 3-pointers to ignite a rally. Graham also had two key free throws with 11.3 seconds to put the Hornets up by three late in the game.\n\n\"Just keep shooting,\" Graham said. \"My coaches keep telling me to let it fly and they have a lot of confidence in me, so I just have to come out here with that same confidence that they believe I have.\"\n\nFORGETTABLE DEBUT\n\nRozier, who was brought in as Walker's replacement, struggled in his Charlotte debut with seven points on 2-of-10 shooting. He had six assists but turned the ball over four times.\n\nCOSTLY DECISION\n\nInstead of going for a 3-pointer to tie the game with 4 seconds left, Zach LaVine drove for a layup. The Hornets ran out the clock from there with the Bulls unable to foul.\n\n\"I think he was hoping it was like six seconds, but it was four and a half,\" Bulls coach Jim Boylen said.\n\nWHITE'S HOMECOMING\n\nChicago got a strong game from its top draft pick Coby White, who had 17 points, seven assists and only one turnover in his NBA debut in his home state.\n\n\"I feel like I played with a lot of effort and a lot of energy,\" said White, who was 6 of 13 from the field. \"I felt like I could have hit more shots, but shots aren't always going to fall so I'm not going to be too hard on myself. For me, it's all about winning so I'm kind of discouraged we didn't come up with a win.\"\n\nIN THE PAINT\n\nBorrego said if the Hornets give up 78 points in the paint on a regular basis, \"that's going to cost us a lot of points. Our defense has to be better.\"\n\nUP NEXT\n\nBulls: Visit the Grizzlies on Friday night.\n\nHornets: Host the Timberwolves on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996116.3921962
}