{
  "game_id": "0022200248",
  "espn_id": "401468403",
  "date": "Nov 21, 2022",
  "matchup": "ATL @ CLE",
  "headline": "Mitchell, Garland combine for 55 in Cavs' win over Hawks",
  "body": "CLEVELAND -- — Donovan Mitchell had 29 points and nine assists, and Darius Garland scored 26 points, sending the Cleveland Cavaliers to a 114-102 victory over the Atlanta Hawks on Monday night in the teams’ first meeting since the play-in tournament last season.\n\n\r\n              Trae Young had 25 points and 10 assists, and Onyeka Okongwu had a season-high 18 points and 10 rebounds for the Hawks. Key offseason acquisition Dejounte Murray scored 11 points on 4 of 18 shooting.\n\n\r\n              Atlanta claimed the final playoff berth in the East with a 107-101 win at Rocket Mortgage FieldHouse on April 15, extending Cleveland’s postseason drought to four years. The Cavaliers have not made the playoffs without LeBron James since 1998.\n\n\r\n              “This game had some more meaning to it because everyone knows what they did to us last year,” Garland said. “We made up for it on defense and we got some easy buckets in transition. Everyone sees it, our team is just unselfish.”\n\n\r\n              Garland also had nine assists and tied his career high with eight turnovers, and Cedi Osman scored a season-best 23 off the bench as Cleveland won its third in a row following a five-game losing streak. The Cavaliers are 7-1 at home.\n\n\r\n              “We were very precise with what we wanted to do and the way we were playing off each other,” Mitchell said. “I would say tonight was one of our best nights working together, but there is so much more we can do.”\n\n\r\n              Cleveland seized control early in the fourth, using an 11-3 run capped by an Osman basket off a Mitchell steal to push their lead out to 96-85. Mitchell was the Cavaliers’ major move over the summer, coming over from Utah in a trade.\n\n\r\n              Atlanta and Cleveland entered the night tied for the fourth-best record in the NBA at 10-6. Rookie forward AJ Griffin scored 17 points in his first start for the Hawks, who have alternated wins and losses for eight straight games.\n\n\r\n              “Garland and Donovan is a guard combination as good as anyone in the league,” Atlanta coach Nate McMillan said. “Those guys are All-Stars and elite scorers, and they give it to you both ways on both sides of the ball.”\n\n\r\n              Cavaliers forward Kevin Love returned after missing one game with a fractured right thumb, failing to score in 12 minutes.\n\n\r\n              THE LAST CEDI\n\n\r\n              Osman, who fell out of the rotation last season, has played in every game and is averaging 9.6 points. The sixth-year swingman even saw significant time at power forward Saturday against Miami, posting 20 points and 12 rebounds.\n\n\r\n              “Cedi gives you an opportunity to do that with his variety of skills,” coach J.B. Bickerstaff said. “That’s like a spark lineup because you can find more speed, energy and spacing with him in that spot.”\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Murray, who ranks second in the NBA in steals, had one. … F De’Andre Hunter (non-COVID illness) remained at the team hotel to rest. Hunter scored 22 points in 45 minutes Saturday against Toronto before falling ill. … G Tyrese Martin, G Jarrett Culver and G Trent Forrest are on G League assignments with College Park. … Atlanta made its only visit to Cleveland in the regular season.\n\n\r\n              Cavaliers: G Isaac Okoro was whistled for three fouls in three minutes against Young in the first quarter. … G Caris LeVert (left ankle sprain) did not dress after being hurt Saturday against the Heat. LeVert is walking without crutches and was not fitted with a protective boot. … F Dean Wade (right knee soreness) missed his sixth consecutive game. … Cleveland is 3-0 on a four-game homestand.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Sacramento on Wednesday night.\n\n\r\n              Cavaliers: Host Portland on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995208.205566
}