{
  "game_id": "0021900462",
  "espn_id": "401161104",
  "date": "Dec 26, 2019",
  "matchup": "MEM @ OKC",
  "headline": "Grizzlies hang onto lead this time, beat Thunder 110-97",
  "body": "OKLAHOMA CITY --  After what happened eight days earlier in the same arena, the Memphis Grizzlies took extra satisfaction in beating Oklahoma City on Thursday night.\n\nJonas Valanciunas scored 21 points, Jaren Jackson Jr. added 20 and the Grizzlies held onto the lead this time in a 110-97 victory over the Thunder.\n\nTyus Jones added 15 points off the bench on 6-of-7 shooting for Memphis, which blew a 24-point third-quarter lead during its last visit to Oklahoma City on Dec. 18 and lost 126-122. That started a stretch in which the Grizzles dropped three out of four games.\n\n\"Last time was disappointing, because we had a big lead and we lost it,\" Jackson said. \"We weren't able to respond. This time we made sure we responded the right way. We got a big lead again . then made sure we took care of the ball and made the right plays.\n\n\"That one stung before, so we definitely owed them one. I'm glad we got it done.\"\n\nChris Paul had 23 points and 11 assists, Shai Gilgeous-Alexander scored 21 and Dennis Schroder added 20 points for Oklahoma City, which had a four-game winning streak snapped. The Thunder had beaten Memphis nine straight times at Chesapeake Energy Arena, a streak that dated to Nov. 14, 2012.\n\n\"They were rebounding on us and they were just making timely shots,\" Paul said. \"They made the floaters, the mid-range, the 3s. Honestly, we can look and see what we need to do better, but I think give them credit, too -- they played an all-around great game.\"\n\nThe burly Valanciunas went 9 of 11 from the field and fueled an 8-0 run early in the fourth quarter that essentially put the game away. Memphis shot 55% from the field and outrebounded the Thunder 50-34.\n\nMemphis didn't trail after the first quarter. The Grizzlies led by nine in the first and were up 49-47 at halftime. They extended their advantage to double digits for the first time at 79-67 on a 3-pointer by Jones with 2:53 left in the third and pushed their lead to 20 with 9:10 left after six straight points by Valanciunas.\n\nOklahoma City pulled to 106-97 with 2:15 to go, but Schroder missed an open 3 on the Thunder's next possession and Valanciunas dunked at the other end with 1:25 remaining.\n\n\"We've had some tough endings the last (few games), but we don't dwell,\" Memphis coach Taylor Jenkins said. \"We move forward. Our guys are continuing to get better. The competitiveness is there every single night. But when you get that production, that competitive fire from all 11 guys, the unselfishness that we're talking about, the critical learning opportunities that we've had, in the fourth quarter to close out a win is huge for us.\"\n\nBrandon Clarke scored 13 points for Memphis, going 5 of 6 from the floor.\n\nSteven Adams had 16 points for the Thunder.\n\nTIP-INS\n\nGrizzlies: Memphis has made at least 10 3-pointers in a franchise-record 11 straight games -- four more games than the club's previous mark. The Grizzlies went 10 of 25 from behind the arc. . Jackson has hit at least one 3 in 20 straight games. The team record is 31, held by Tyreke Evans. . Ja Morant had 10 points and five rebounds. Thunder: Rookie forward Darius Bazely made his second straight start in place of Danilo Gallinari, who missed a second consecutive game due to left ankle soreness. . Oklahoma native and Broadway star Kristin Chenoweth attended the game. . The Thunder shot 41% from the field. . Kevin Hervey made his NBA debut, playing the final 1:18. GALLINARI OUT\n\nGallinari, the Thunder's second-leading scorer at 18 points per game, was a last-minute scratch Sunday before a win over the Los Angeles Clippers. He sat out Thursday as well. Oklahoma City coach Billy Donovan said Gallinari wouldn't travel with the team to games at Charlotte on Friday and Toronto on Sunday as a precaution.\n\nDonovan said the team has no concerns about \"structural\" issues with Gallinari's ankle but \"as long as the season is and with what we have coming, the most important thing is we want him to get to where he's feeling better.\" UP NEXT Grizzlies: Visit the Denver Nuggets on Saturday. Thunder: Visit the Charlotte Hornets on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995730.432689
}