{
  "game_id": "0022400409",
  "espn_id": "401704975",
  "date": "Dec 25, 2024",
  "matchup": "PHX vs. DEN",
  "headline": "Durant and Beal score 27 points each, Suns beat Nuggets 110-100 to close out Christmas slate",
  "body": "PHOENIX -- — Kevin Durant and Bradley Beal each scored 27 points and the Phoenix Suns beat the Denver Nuggets 110-100 on Wednesday night in the nightcap to the NBA’s Christmas slate of games.\n\n\r\n              The Nuggets blew out Phoenix 117-90 on Monday night in Denver, but the Suns put up much more of a fight despite playing without Devin Booker (groin) and Grayson Allen (concussion protocol).\n\n\r\n              Phoenix led by seven after three quarters and stretched it to 99-81 by the midpoint of the fourth quarter. The Suns pushed the lead to 15 and held off the Nuggets down the stretch to end a three-game losing streak.\n\n\r\n              Nikola Jokic had 25 points and 15 rebounds to lead the Nuggets. Michael Porter Jr. added 22 and Russell Westbrook had 17.\n\n\r\n              Jamal Murray had 13 points, six rebounds and six assists after missing the game Monday game with a sprained ankle.\n\n\r\n              The Suns led by nine early after making six of their first seven 3-pointers, but the teams traded shots the rest of a hot-shooting first half. \n\n\r\n              Takeaways\r\n              Nuggets: Denver got back Murray, but couldn't match the intensity of Monday's blowout. Jokic scored seven points after halftime and the Nuggets shot 8 of 29 from 3-point range.\n\n\r\n              Suns: Phoenix might have been missing two of its best shooters, but still 11 of 36 from 3-point range. Monte Morris gave the Suns a nice lift off the bench with 11 points and three assists.\n\n\r\n              Key moment\r\n              The Suns took advantage of Jokic resting late in the third quarter and early in the fourth, stretching the lead to 12 before he returned. \n\n\r\n              Key stat\r\n              The Suns are at their best when they get out in transition and outscored the Nuggets 15-6 on the break. \n\n\r\n              Up next\r\n              On Friday, the Nuggets host Cleveland, and the Suns host Dallas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998333.250717
}