{
  "game_id": "0022400615",
  "espn_id": "401705181",
  "date": "Jan 22, 2025",
  "matchup": "HOU vs. CLE",
  "headline": "Sengun makes late free throws and Garland misses 2 as Rockets outlast Cavs, 109-108",
  "body": "HOUSTON -- — Alperen Sengun made two free throws with 4.5 seconds left and Darius Garland missed two of three free throws after that to allow the Houston Rockets to hold on for a 109-108 victory over the Cleveland Cavaliers on Wednesday night.\n\n\r\n              Fred VanVleet had 26 points as Houston rallied late after squandering a 13-point lead in the fourth quarter.\n\n\r\n              A flagrant foul by Tari Eason on a 3-point attempt by Garland gave him three free throws with 2.1 seconds left. But he missed the first two before making the third to cut the lead to a point. The Cavaliers had a chance to win it at the buzzer, but Donovan Mitchell’s 3-point attempt was off.\n\n\r\n              Mitchell missed a shot with less than 10 seconds to go. Sengun grabbed the rebound and was fouled by Jarrett Allen to set up the winning free throws. \n\n\r\n              Houston led by 13 with about 11 minutes left before the Cavaliers used an 19-0 run to take a 104-98 lead with about four minutes to go. \n\n\r\n              VanVleet ended a Houston scoring drought of more than seven minutes with a 3 after that and tied it at 104-104 with another 3-pointer on the next possession.\n\n\r\n              Garland led the the NBA-leading Cavaliers with 26 points. They they lost on the road for just the fifth time this season.\n\n\r\n              Takeaways \r\n              Cavaliers: Cleveland missed the rebounding of Evan Mobley, who averages 8.8 rebounds a game and missed his third straight game with a calf injury. The Cavs were outrebounded 53-45.\n\n\r\n              Rockets: Must avoid scoring droughts like they had Wednesday night if they expect to keep winning games against good teams.\n\n\r\n              Key moment\r\n              Garland missing the first two of his three free throws that would have put Cleveland on top.\n\n\r\n              Key stat\r\n              The Cavaliers missed six free throws, including the two by Garland late.\n\n\r\n              Up next\r\n              The Cavaliers visit the 76ers on Friday night before hosting the Rockets on Saturday night in Houston’s next game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997380.534147
}