{
  "game_id": "0021600141",
  "espn_id": "400899591",
  "date": "Nov 13, 2016",
  "matchup": "OKC vs. ORL",
  "headline": "Ibaka hits game winner vs. former team as Magic top Thunder",
  "body": "OKLAHOMA CITY -- Serge Ibaka showed the Thunder the best of what they let go.\nThe forward, traded from Oklahoma City to Orlando in the offseason, hit a baseline jumper with less than a second remaining to give the Magic a 119-117 win over Russell Westbrook and the Thunder on Sunday night.\n\"Coach called my name, and I was ready,\" Ibaka said. \"I work on my shot every night and every summer, so I was just ready to make a play.\"\nThough he enjoyed his time with the Thunder and respects the organization and the fans, he said it was an emotional day and it was important for him to play well. He scored a career-high 31 points and added nine rebounds and four blocks.\n\"I'm not going to lie to you, it feels good,\" he said.\nWith the score tied in the final minute, Westbrook missed a pull-up jumper, and Orlando rebounded and called timeout with 11 seconds remaining to set up Ibaka's winner with 0.4 seconds left. Ibaka pump-faked Steven Adams, got him to bite, then drained the shot.\n\"He had a special performance,\" Magic coach Frank Vogel said. \"A night I'm sure he'll remember for the rest of his career.\"\nIbaka was cheered loudly during pregame introductions. He acknowledged the fans by twice raising both arms to the sky.\n\"It shows that the people still love me, and I respect that and appreciate that a lot,\" he said.\nWestbrook finished with 41 points, 16 assists and 12 rebounds for his third triple-double of the season and 40th of his career. The Thunder had won 20 straight when Westbrook tallied a triple-double.\n\"We were playing too slow,\" he said. \"The faster we play, the harder it is to guard us, especially when we get the ball moving.\"\nElfrid Payton scored 23 points and Evan Fournier added 21 for the Magic, who snapped a three-game losing streak.\nIt was the third straight home loss for the Thunder after a 6-1 start.\n\"We've got a lot we need to work on and continue to work on, and all these guys are working, are trying, are really giving good effort,\" Thunder coach Billy Donovan said.\nOklahoma City's Victor Oladipo, who came to the Thunder in the Ibaka deal, scored 12 points.\nThe Magic led by 21 in the second quarter and were up 57-47 at halftime. Ibaka scored 19 points before the break to match Westbrook's 19 points.\nThe Thunder rallied late in the third quarter. A putback by Enes Kanter with 1:35 left in the third quarter tied the game at 80. Oklahoma City led 84-82 heading into the fourth quarter.\nAfter Ibaka's shot with 0.4 seconds left, Nick Collison and Westbrook couldn't connect on a lob near the basket.\n---\nTIP-INS\nMagic: Ibaka had 13 points, six rebounds and four blocks in the first quarter. ... Payton finished one point short of his career high. ... Jeff Green, another former Thunder player, scored 11 points.\nThunder: Oklahoma City made 6 of 25 shots in the first quarter and missed all eight of its 3-pointers to fall behind 27-13. ... The Thunder made 14 of 21 shots in the third quarter and outscored the Magic 37-25. ... Domantas Sabonis, also acquired in the Ibaka deal, started and scored three points on 1-for-6 shooting.\nSTAT LINES\nOrlando made 11 of 24 3-pointers, while Oklahoma City made just 7 of 25.\nQUOTABLE\nIbaka, on finding the visiting locker room: \"This is my first time to be here,\" he said. \"I haven't been here before. I was walking here, and I didn't know which door. They had to show me every time. It feels kind of weird.\"\nUP NEXT\nThe Magic play at Vogel's former team, the Indiana Pacers, on Monday.\nThe Thunder play at the Detroit Pistons on Monday.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995331.6228611
}