{
  "game_id": "0021900400",
  "espn_id": "401161042",
  "date": "Dec 16, 2019",
  "matchup": "PHX vs. POR",
  "headline": "Lillard converts late 3-point play, Blazers top Suns 111-110",
  "body": "PHOENIX --  Damian Lillard wasn't concerned when officials went to video review over his potential tying layup with 26 seconds left. Either he'd be called for a charge, or the Suns' Aron Baynes would be called for a block.\n\n\"I knew it was a block,\" Lillard said. \"He was moving underneath.\"\n\nSure enough, Baynes was called for the foul and the layup counted. Lillard converted the ensuing free throw for a three-point play, the Blazers put together a final defensive stand and Portland escaped with a 111-110 win over the Suns on Monday night.\n\nCJ McCollum led the Blazers with 30 points on 11-of-20 shooting from the field while Lillard added 27 points.\n\nPortland led for most of the fourth quarter, but Phoenix pulled ahead 110-108 with 32 seconds left when Kelly Oubre Jr. converted a four-point play. He took an inbound pass from Ricky Rubio and nailed a turnaround 3-pointer while being fouled, then hit the free throw.\n\nOn the next possession, Lillard drove straight through the lane and made a layup while crashing into Baynes, who was trying to slide into position for the charge. Lillard made the free throw and Phoenix couldn't score on its final possession as Rubio's 3-point attempt bounced off the rim with two seconds left.\n\n\"There's a lot of opinions in there, but if I would have made the shot, we would've won the game,\" Rubio said. \"It was almost a buzzer beater. We'll take that every day.\"\n\nPortland has won 11 straight against the Suns. The Blazers trailed 49-33 midway through the second quarter but methodically worked their way back into the game.\n\nPhoenix scored just 43 points in the second half on 34% shooting.\n\n\"We held them to 21 points in the third quarter and that was huge for us,\" McCollum said. \"It gave us a chance to come back. Fourth quarter we got stops.\"\n\nOubre led Phoenix with 24 points. Dario Saric and Frank Kaminsky III both added 17 for the Suns, who played a second straight game without star guard Devin Booker because of his right forearm injury.\n\n\"It was an exciting game,\" Portland coach Terry Stotts said. \"I think both teams at the end could have ended up with a win and we were fortunate at the end that we made one extra play.\"\n\nPortland pulled ahead for the first time midway through the third when McCollum's 3-pointer made it 82-80. The Blazers took a 90-88 advantage into the fourth quarter.\n\nCarmelo Anthony, who scored 23 points, hit a 3 to put the Blazers ahead 100-97 with seven minutes left. The 35-year-old also made a turnaround jumper over Oubre with less than three minutes remaining that pushed Portland's advantage to six.\n\nHassan Whiteside added 10 points and 14 rebounds for the Blazers.\n\nPhoenix lost for the fourth time in five games and has a quick turnaround against the Clippers on Tuesday.\n\n\"If you're going to play in high-level games, you've got to learn how to manage nights like this,\" Suns coach Monty Williams said.\n\nThe Suns grabbed an early 11-3 lead and stayed ahead for the entire first half, taking a 67-59 advantage into the break. Oubre and Saric both scored 13 points for Phoenix, while Kaminsky added 12. McCollum led the Blazers with 18.\n\nTIP-INS\n\nTrail Blazers: G Mario Hezonja (back spasms) didn't play in the second half. ... The Blazers improved to 11-16.\n\nSuns: It was the final game of Deandre Ayton's 25-game suspension for violating the NBA/NBPA Anti-Drug Program after testing positive for a diuretic. He can return Tuesday on the road against the Clippers. ... G Tyler Johnson missed the game because of an illness. ... Baynes finished with 13 points. It was his fourth straight game with at least 10 off the bench. ... Phoenix fell to 11-15.\n\nUP NEXT\n\nThe Trail Blazers return home to face Golden State on Wednesday.\n\nThe Suns travel to face the Los Angeles Clippers on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996574.6821241
}