{
  "game_id": "0022000139",
  "espn_id": "401267299",
  "date": "Jan 09, 2021",
  "matchup": "ORL @ DAL",
  "headline": "Hardaway, Burke lead short-handed Mavs past Magic 112-98",
  "body": "DALLAS -- — Tim Hardaway Jr. scored a season-high 36 points, Trey Burke did the same with 29 and Luka Doncic had another triple-double as the short-handed Dallas Mavericks beat the Orlando Magic 112-98 on Saturday night.\n\n\r\n                    Hardaway and Burke took on expanded roles to help Dallas get over .500 for the first time this season with starters Josh Richardson and Dorian Finney-Smith and backup point guard Jalen Brunson sidelined by COVID-19 protocols.\n\n\r\n                    The three Mavericks didn't return with the team from Denver following a 124-117 overtime win Thursday, and coach Rick Carlisle wouldn't discuss how long they would be out. One of the three, who hasn't been identified, tested positive for the virus.\n\n\r\n                    Hardaway and Burke made it a rather quiet second triple-double of the season for Doncic, combining to go 15 of 21 from 3-point range while the star point guard had 20 points, 11 rebounds and 10 assists. \n\n\r\n                    “We got here at 5 o’clock off the whole thing with the Denver trip,” Carlisle said of the team skipping a morning shootaround because of the COVID-19 issues. “I was really impressed with our level of focus and concentration. And it all started with Luka. He understood exactly what the situation was.”\n\n\r\n                    Burke, who missed the Denver trip because of an illness that Carlisle said wasn't coronavirus-related, was 7 of 8 from long range to help the Mavericks finish 20 of 40 against an Orlando team tied for the fewest 3s allowed per game coming in.\n\n\r\n                    “He’s a dangerous scorer,” Carlisle said. “One reason I think he plays well for us is that he knows that we have great confidence in him. He’s a guy that can just get white hot out there.”\n\n\r\n                    Nikola Vucevic had 30 points and 15 rebounds, and Aaron Gordon scored 16 points a night after missing a 42-point loss in Houston with a sore left hamstring as the Magic lost their ninth straight game in Dallas and fell to 2-4 since a 4-0 start.\n\n\r\n                    It was Orlando's second game without guard Markelle Fultz, out for the season with a knee injury, and Gordon said it was the first time he has played point guard since high school.\n\n\r\n                    “The team needs me to step up and carry some of the load of initiating the offense,” Gordon said. “I've got to take it on my shoulders to get us more organized. There were some times that it was just chaotic.”\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: F Evan Fournier missed his fifth straight game with back spasms. Coach Steve Clifford said he might return Monday against Milwaukee. ... Vucevic missed his first five 3s and finished 2 of 7 while Gordon was 1 of 7. Orlando was 6 of 31 from beyond the arc.\n\n\r\n                    Mavericks: A scoring change gave Doncic a career-high fifth steal against the Nuggets. With 38 points, nine rebounds and 13 assists, he became the first player in NBA history with at least those totals in those four categories. ... Rookie first-round pick Josh Green made his first career start because of the COVID-19 absences. He missed his only shot while playing 15 minutes.\n\n\r\n                    ROLLER-COASTER QUARTER\n\n\r\n                    Doncic capped a roller-coaster third quarter by beating the buzzer with a long 3-pointer for an 85-75 lead. The Mavericks led by six at halftime, then trailed by six in the third after a 15-1 Orlando run started by the only 3 from Gordon. Dallas answered with an 18-2 run, with Hardaway scoring 12. \n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Orlando has its only home game in a nine-game span against Milwaukee on Monday in the first meeting since the Bucks won a first-round playoff series in five games in the NBA bubble in Florida in August. Six consecutive road games follow.\n\n\r\n                    Mavericks: Dallas finishes a two-game homestand against New Orleans on Monday. The Mavericks swept the four-game season series in 2019-20, the first time they've done that in six years.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997804.756086
}