{
  "game_id": "0022300527",
  "espn_id": "401585155",
  "date": "Jan 11, 2024",
  "matchup": "BKN @ CLE",
  "headline": "Donovan Mitchell scores season-high 45 points, Cavaliers beat Nets 111-102 in Paris",
  "body": "PARIS -- — Donovan Mitchell scored a season-high 45 points and the Cleveland Cavaliers beat the Brooklyn Nets 111-102 on Thursday in the NBA's third regular-season game in Paris.\n\n\r\n              Mitchell had his 16th 40-point game in just two seasons in Cleveland. He added 12 rebounds, six assists and four steals, joining LeBron James as the only Cavaliers with at least 45 points, 10 boards, five assists and three steals in a game.\n\n\r\n              He'd like to join James on the list of U.S. men's basketball gold medalists when Paris hosts the Olympics this summer.\n\n\r\n              “I’d love to come back and play in the Olympics,” Mitchell said. “This city is a very electric basketball city.” \n\n\r\n              Mitchell’s quick start sent the Cavaliers to a lead they would never lose and he scored 21 points in the fourth quarter, making four 3-pointers after going 0 for 6 through three, to keep the Nets from coming all the way back after cutting a 26-point deficit to single digits.\n\n\r\n              “We did some really good things in the second half and his ability to just put that ball in the hole is a difference maker,” Nets coach Jacque Vaughn said. \n\n\r\n              Caris LeVert added 21 points in Cleveland’s first time playing outside North America in the regular season, while Jarrett Allen had 12 points and 12 rebounds in his career-best eighth straight double-double. The Cavaliers won their fourth straight, improving to 9-3 since Dec. 16.\n\n\r\n              Mikal Bridges and Cam Thomas each scored 26 points for the Nets, who matched their worst half of the season with 34 points in the first half and have lost 12 of 15. Lonnie Walker IV added 20 points, providing energy off the bench with starters Spencer Dinwiddie and Dorian Finney-Smith both ailing and playing limited minutes.\n\n\r\n              The Nets' struggles kept the NBA from delivering much of a show in front of a crowd that included French soccer superstar Kylian Mbappé and former NBA stars Tony Parker and Joakim Noah.\n\n\r\n              But better basketball is ahead.\n\n\r\n              NBA Commissioner Adam Silver noted that the United States, which has won the last four Olympic gold medals in men's basketball, could send a powerhouse roster this summer.\n\n\r\n              “I think a love of competition and a love of this market, seemingly all the marquee U.S. NBA players want to participate,” Silver said during a news conference before the game. \n\n\r\n              He added that the NBA expects to return to France next season, perhaps with the teams selected playing multiple games. Headed by No. 1 pick Victor Wembanyama, France had a record 14 players on opening-night rosters this season and has become one of the league's most important markets, ranking No. 1 in Europe and the Middle East for sales of NBA-branded merchandise.\n\n\r\n              Mitchell scored the game's first six points and Cleveland raced to a 16-4 lead. It was 54-34 at halftime and the Cavs took their largest lead when Mitchell's layup made it 60-34 early in the third. \n\n\r\n              “I think Donovan came out ready for the moment,” Cavs coach J.B. Bickerstaff said. “We talked about beforehand how special this game was to be a part of, what it means for the NBA to select you to come over here and represent the league and the game of basketball on a worldwide stage, and I thought Donovan was phenomenal at giving the audience and us what they came to see and what we needed to go and win the game.” \n\n\r\n              Cleveland's Tristan Thompson was ejected early in the fourth quarter for flagrantly fouling Nic Claxton after the Nets center had dunked and taunted the veteran center.\n\n\r\n              The Cavs, playing without Evan Mobley (knee surgery) and Darius Garland (broken jaw), played the final three quarters without starting guard Max Strus because of right knee soreness. \n\n\r\n              UP NEXT\n\n\r\n              Nets: Host Miami on Monday.\n\n\r\n              Cavaliers: Host Chicago on Monday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996346.929159
}