{
  "game_id": "401809964",
  "espn_id": "401809964",
  "date": "Oct 26, 2025",
  "matchup": "WSH vs CHA",
  "headline": "LaMelo Ball's triple-double helps Hornets handle Wizards, 139-113",
  "body": "WASHINGTON -- — LaMelo Ball had 38 points, 13 rebounds and 13 assists for his 11th career triple-double, and the Charlotte Hornets erased a double-digit halftime deficit Sunday night to defeat the Washington Wizards 139-113.\n\n\r\n              Kon Knueppel, the No. 4 pick in June’s draft, collected 11 of his 20 points during Charlotte’s third-quarter push and Miles Bridges scored 22 points as the Hornets snapped a five-game skid against Washington. Collin Sexton added 20 for Charlotte.\n\n\r\n              The Hornets shot 67.4% in the second half, including 12 of 16 from 3-point range.\n\n\r\n              CJ McCollum scored 24 points and Alex Sarr had 17 of his 21 points in the first half for the Wizards, who received a smattering of boos at the end of their home opener.\n\n\r\n              Washington took a 62-51 halftime lead when Sarr hit a 22-footer at the buzzer to establish the first double-digit lead for either team. The Wizards briefly pushed their advantage, but Charlotte quickly got the margin back to single digits before gradually wearing down Washington’s defense.\n\n\r\n              Ball’s 3-pointer to make it 85-82 gave Charlotte the lead for good, and rookie Sion James hit consecutive 3s to make it 93-86 and cap a 19-4 run. James scored all 13 of his points in the second half.\n\n\r\n              Ball assisted on Bridges’ 3-pointer with 7:52 remaining to make it 110-100 and complete his first triple-double since Nov. 5, 2023.\n\n\r\n              Charlotte outscored the Wizards 44-25 in the fourth quarter.\n\n\r\n              Washington’s Tre Johnson, the No. 6 overall pick in June’s draft, had 18 points in his home debut.\n\n\r\n              Kyshawn George, coming off a career-high 34 points in Friday’s 117-107 victory at Dallas, had six points for the Wizards.\n\n\r\n              Charlotte guard Brandon Miller sat out after leaving Saturday’s loss at Philadelphia with a shoulder injury.\n\n\r\n              Up next\r\n              Hornets: Visit Miami on Tuesday\n\n\r\n              Wizards: Host Philadelphia on Tuesday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042505.687287
}