{
  "game_id": "0022400306",
  "espn_id": "401704872",
  "date": "Dec 01, 2024",
  "matchup": "MEM vs. IND",
  "headline": "Jackson's 25 points rally Grizzlies from 19-point deficit to 136-121 win over Pacers",
  "body": "MEMPHIS, Tenn. -- — Jaren Jackson Jr. had 25 points, eight rebounds and three blocks as the Memphis Grizzlies erased a 19-point first-half deficit and defeated the Indiana Pacers 136-121 on Sunday.\n\n\r\n              Ja Morant finished with 19 points and eight assists, and Marcus Smart and Desmond Bane added 16 points each as Memphis won its sixth straight.\n\n\r\n              Bennedict Mathurin led the Pacers with 19 points and nine rebounds, part of six Indiana players finishing in double figures. Pascal Siakam scored 17 points and handed out six assists, and Obi Toppin had 16 points and eight rebounds.\n\n\r\n              The Pacers got some help on the injury front as starting guard Andrew Nembhard returned after missing 14 games in November with left knee inflammation. His 14 first-half points helped Indiana to a double-digit lead. He did not play in the second half as he was on limited minutes.\n\n\r\n              Takeaways\r\n              Pacers: Indiana was shooting at a 60% clip in the first half as it built a 19-point lead, and its 68 points were the most its scored in a first half this season. The Pacers couldn't keep pace in the second half.\n\n\r\n              Grizzlies: Poor shooting had Memphis struggling early. But the shooting improved after the first quarter as Memphis finished at 53%, including 16 of 46 from 3-point range.\n\n\r\n              Key moment\r\n              The Grizzlies whittled into the Pacers 19-point lead by halftime and outscored Indiana 40-23 in the third quarter with Morant and Jaylen Wells pushing the offense. \n\n\r\n              Key stat\r\n              Indiana's Tyrese Haliburton was averaging 25.5 points over the previous four games, but was limited to eight points and shot 3 of 10 from the field.\n\n\r\n              Up next\r\n              The Pacers are at Toronto on Tuesday night, while the Grizzlies travel to Dallas to face the Mavericks the same night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997744.875322
}