{
  "game_id": "0022200404",
  "espn_id": "401468559",
  "date": "Dec 12, 2022",
  "matchup": "MEM vs. ATL",
  "headline": "Jones, Brooks power Memphis to 128-103 win over Atlanta",
  "body": "MEMPHIS, Tenn. -- — Tyus Jones had 22 points and 11 assists, Dillon Brooks added 18 points and the Memphis Grizzlies beat the Atlanta Hawks 128-103 on Monday night in a game in which both teams were without key starters.\n\n\r\n              Santi Aldama scored 16 points and Jaren Jackson Jr. had 15 points and a career-best eight blocks for Memphis, which won its sixth straight and moved within a half-game of Western Conference-leading New Orleans.\n\n\r\n              Memphis was able to outscore Atlanta in the paint 72-42, while handing out 36 assists.\n\n\r\n              “It’s infectious,” Memphis coach Taylor Jenkins said of Jones dealing 11 assists. “I think we had eight guys with two-plus assists. That’s guards. That’s bigs.”\n\n\r\n              Defensively, with Jackson rejecting shots, it has improved the Memphis defense after he missed the opening 14 games recovering from off-season right foot surgery.\n\n\r\n              “He’s changed our defense singlehandedly,” Jones said. “He impacts the ball and impacts what (opposing) offensive players even think.”\n\n\r\n              De’Andre Hunter led the Hawks with 19 points, and Aaron Holiday finished with 15. Jalen Johnson added 14 points and nine rebounds. AJ Griffin, who scored the winning basket at the overtime buzzer against Chicago on Sunday, had 13 points as the Hawks lost for the fourth time in five games.\n\n\r\n              “They established, set and controlled the tempo right from start to finish. They had great ball movement all night long,” Hawks coach Nate McMillan said.\n\n\r\n              Both teams were missing their leading scorers. Grizzlies guard Ja Morant sat out with right thigh soreness, while his counterpart -- Atlanta’s Trae Young -- was dealing with lower back tightness after playing 42 minutes in Sunday’s win against the Bulls.\n\n\r\n              Young’s absence meant Atlanta was down five of its six top scorers, including Dejounte Murray and Bogdan Bogdanovic. McMillan said such absences “are always a challenge.”\n\n\r\n              “They just pounded us in the paint,” McMillan said noting the 72-42 Memphis advantage. “They were just faster, stronger, better. They did what you need to do when a team is coming in limping.”\n\n\r\n              Memphis, which led 62-51 at halftime, dominated the third quarter, outscoring Atlanta 40-25 and extending the advantage to as many as 31 points in the frame.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Trent Forrest, who started his first game of the season against the Bulls on Sunday, started in Young’s spot. … Jalen Johnson’s 14 points was a career-high for the second-year player out of Duke. … Onyeka Okongwu grabbed 10 rebounds.\n\n\r\n              Grizzlies: Made their first nine shots, including five from beyond the arc. … Jackson had four blocks in the first quarter. … Jones had a season-high four 3-pointers.\n\n\r\n              JACKSON’S DEFENSE\n\n\r\n              Jackson’s eight blocks not only were a personal best, but also tied the Grizzlies' franchise record. Jones said the 6-foot-11 forward “impacts the game on the defensive end like very few people in this league.” Jones went on to call Jackson “the anchor.” Rookie guard Kennedy Chandler had another name — savior. “He helped me out about two times from getting beat,” Chandler said. \n\n\r\n              MISSED OPPORTUNITY\n\n\r\n              Jones had a breakaway in the second half, and the bench rose thinking the 6-foot guard would dunk. Instead, he softly converted the layup catching the good-natured ribbing of his teammates. “They want a dunk out of me. I’ve told them I’m done dunking. I only shoot floaters,” Jones said.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Play the Magic in Orlando on Wednesday\n\n\r\n              Grizzlies: Host the Milwaukee Bucks on Thursday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994217.795022
}