{
  "game_id": "0021900934",
  "espn_id": "401161576",
  "date": "Mar 06, 2020",
  "matchup": "IND @ CHI",
  "headline": "Sabonis dominates, Pacers hang on to beat Bulls 108-102",
  "body": "CHICAGO --  Domantas Sabonis dominated with 24 points and 12 rebounds, and the Indiana Pacers hung on to beat the Chicago Bulls 108-102 on Friday night.\n\nThe Pacers led by as much as 23 in the third quarter and withstood a big push in the fourth to win for the fifth time in six games. They also moved back into a tie with Philadelphia for fifth place in the Eastern Conference, even though they were missing two of their top three scorers with T.J. Warren (sore left leg) and Malcolm Brogdon (sore left hip) sidelined.\n\n\"We're a very talented group, and our depth is one of our strengths,\" Victor Oladipo said. \"It's no surprise to me that guys stepped up and played well tonight. We've just got to continue to build on it.\"\n\nSabonis came through in a big way and tied Troy Murphy's club record with his 49th double-double this season.\n\nOladipo scored 16 in 26 minutes after missing the previous two games because of a sore right knee. Myles Turner added 15 points and eight rebounds. JaKarr Sampson scored 14, and the Pacers won their ninth straight over the Bulls.\n\nChicago lost for the 12th time in 14 games despite rookie Coby White scoring 26 points and Shaquille Harrison setting a career high with 25.\n\nIt was White's seventh straight outing with 19 points or more. But Lauri Markkanen finished with just three points in his second game back after missing 15 because of a stress reaction in his right hip. Leading scorer Zach LaVine sat out his third in a row with a strained left quadriceps.\n\n\"I know (Markkanen) cares,\" coach Jim Boylen said. \"I know he's trying. He's working his way back. It's almost like we're in preseason with some of these lineups and situations. It's nobody's fault. It's what it is, but it's difficult. I don't know if you can miss that much time and just come back where you were. I don't think it works like that.\"\n\nHANGING ON\n\nShredded by Giannis Antetokounmpo and the NBA-leading Bucks in Milwaukee on Wednesday, the Pacers appeared as though they were on their way to an easy victory.\n\nThey led 73-50 after Oladipo's layup with 7:41 left in the third. Things got tight in the fourth, when Harrison nailed back-to-back 3-pointers to cut it to 99-92 with just under five minutes left.\n\nTurner hit two free throws. Oladipo banked in a shot to make it 103-92 with 1:30 left. And the Pacers hung on for the win.\n\nTIP-INS\n\nPacers: Coach Nate McMillan said the Pacers expect to know more about the severity of Brogdon's injury by Saturday, after they consult with doctors. Brogdon exited Wednesday's loss at Milwaukee because of a sore left hip and had an MRI the following day. ... F Doug McDermott (sore right big toe) did not play. ... Murphy had 49 double-doubles in 2008-09. ... The Pacers were outscored 30-19 in the fourth. ... McMillan will continue to consult with the team's medical staff after the Pacers limited Oladipo's minutes. \"I will listen to our doctors and our trainers about the number of minutes we can play him, but being off a couple of days, a couple of games, we can't just immediately go back to playing him 30-plus minutes,\" McMillan said. \"We have to be cautious with him.\"\n\nBulls: Boylen said LaVine will practice Saturday. The Bulls will then decide if he will return at Brooklyn on Sunday. ... Harrison's previous career high was 21 points against Portland on March 27, 2019. ... Thaddeus Young tied a season high with five steals.\n\nUP NEXT\n\nPacers: Visit Dallas on Sunday.\n\nBulls: Visit Brooklyn on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995832.324758
}