{
  "game_id": "0022401069",
  "espn_id": "401705635",
  "date": "Mar 28, 2025",
  "matchup": "CHA @ TOR",
  "headline": "Jakob Poeltl's 24 points and 12 rebounds help Raptors beat Hornets 108-97 for 3rd straight win",
  "body": "TORONTO -- — Jakob Poeltl had 24 points and 12 rebounds to lead the Toronto Raptors to their third straight win, a 108-97 victory over the Charlotte Hornets on Friday night.\n\n\r\n              Immanuel Quickley scored 19 points on 6-for-15 shooting, including 5 for 8 from 3-point distance, and added nine assists.\n\n\r\n              Mark Williams had 18 points, 12 rebounds and five assists as Charlotte lost its fourth straight game. DaQuan Jeffries added 15 points.\n\n\r\n              The Raptors used a 10-point run to take a 20-12 lead in the first quarter. Poeltl led the way with 12 points in the first half for Toronto, which led 49-47 at the break. \n\n\r\n              Takeaways\r\n              Raptors: Toronto’s winning streak has been made up entirely of teams below it in the Eastern Conference standings, with the victory against Charlotte following triumphs over the Brooklyn Nets (23-50) and Washington Wizards (16-57). Toronto, ranked 11th, can complete a sweep of the lower teams in the conference with a win over the Philadelphia 76ers (23-50) on Sunday.\n\n\r\n              Hornets: Star guard LaMelo Ball will miss the rest of the season with a right ankle impingement, and will also undergo a wrist procedure, the team said Friday. Ball wraps his fifth season with Charlotte with a career-high average of 25.2 points in 47 games. \n\n\r\n              Key stat\r\n              The Raptors outscored the Hornets by 15 points from 3-point distance, hitting 14 shots while the Hornets made nine.\n\n\r\n              Key moment\r\n              Poeltl’s layup with 8:17 left in the third quarter put the Raptors ahead 61-60, and Toronto never trailed again. \n\n\r\n              Up next\r\n              Both teams play Sunday. Charlotte is at New Orleans, and Toronto is at Philadelphia. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997699.093536
}