{
  "game_id": "0022000236",
  "espn_id": "401267396",
  "date": "Jan 22, 2021",
  "matchup": "ATL @ MIN",
  "headline": "Young scores 43, Capela nets triple-double in Hawks' win",
  "body": "MINNEAPOLIS -- — Trae Young scored a season-high 43 points, Clint Capela had 13 points, 19 rebounds and 10 blocks, and the Atlanta Hawks topped the Minnesota Timberwolves 116-98 on Friday night. \n\n\r\n                    Young scored 25 points in the first half as the Hawks took a 19-point lead at halftime. He reached 40 points late in the third quarter with a step-back 3-pointer that put the Hawks up 84-59.\n\n\r\n                    \"I'm never going to be surprised when Trae's scoring 40 or 30 or 12 assists or whatever the number is,” Hawks coach Lloyd Pierce said. “He's learning. He's having fun with it.”\n\n\r\n                    Capela had six blocks in the first half as Atlanta held Minnesota to 43 points on 16-of-35 shooting. Hawks players on the bench stood and cheered when Capela picked up his 10th block in the fourth quarter, swatting away a shot by a driving Jordan McLaughin.\n\n\r\n                    Capela became the third player in Hawks history with 10 blocks in a game, joining Dikembe Mutombo and Josh Smith.\n\n\r\n                    “I've never seen 10 blocks in person,\" Young said. “What he did tonight was unbelievable. He's been doing this consistently for us. You've got to give credit where it's due. He's playing really well for us.\"\n\n\r\n                    Second-year forward Cam Reddish returned after missing three games with a knee injury and added 15 points off the bench for the Hawks, who moved to 8-7.\n\n\r\n                    Malik Beasley was one of the few bright spots for Minnesota with 17 points. Naz Reid added 13 points, eight rebounds and four blocks.\n\n\r\n                     “There are some effort mistakes, too,\" Timberwolves coach Ryan Saunders said. “Those are ones we can’t have.”\n\n\r\n                    Minnesota has lost four straight and 11 of its last 12 after starting the season 2-0.\n\n\r\n                    The same two teams faced earlier this week when the Hawks beat the Timberwolves 108-97 in Atlanta despite a season-high 24 turnovers. Each team played a game in between meetings, with Minnesota dropping a home game to Orlando and Atlanta beating the Pistons at home.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Capela recorded his sixth straight double-double and his ninth overall this season. … It was the 13th 40-point game of Young’s career and first this season.\n\n\r\n                    Timberwolves: PG Ricky Rubio returned to action Friday after missing two games due to the league’s health and safety protocols. Rubio was the first player off the bench for Minnesota. … Jake Layman was the only player on the active roster who did not play in the first half Friday.\n\n\r\n                    REMEMBERING HANK AARON\n\n\r\n                    Pierce spoke extensively before Friday’s game about Hank Aaron, the Hall of Fame baseball player who died earlier Friday. Aaron, who spent 21 of his 23 years playing for the Atlanta Braves, spoke to the Hawks at a practice during Pierce’s first season as coach during the 2018-19 season.\n\n\r\n                    Before Aaron addressed the team, Pierce had a chance to speak 1-on-1 for a few minutes with Aaron. That conversation sticks with him to this day.\n\n\r\n                    “For me, as an adult, I met a hero, I met an idol, I met a star. It’s still an awe moment for me,” Pierce said. “I was mostly impressed with his humility, him feeling like it was an opportunity for him. Really it was an opportunity for us to listen to him, to listen to his stories, for him to explain in his own words what he went through leading up to breaking the (home run) record.”\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Atlanta plays in Milwaukee on Sunday.\n\n\r\n                    Timberwolves: Minnesota looks to bounce back with a game Saturday at home against the New Orleans Pelicans. It’s New Orleans’ sixth straight road game.",
  "source": "espn_api",
  "crawled_at": 1764997847.369209
}