{
  "game_id": "0021800788",
  "espn_id": "401071461",
  "date": "Feb 03, 2019",
  "matchup": "OKC @ BOS",
  "headline": "Irving, Celtics outlast Thunder in 134-129 thriller",
  "body": "BOSTON --  Eight days after letting a win slip away against the Golden State Warriors, the Celtics were able to finish the job against another tough Western Conference opponent.\n\nKyrie Irving had 30 points and 11 assists as Boston overcame big games from Oklahoma City stars Paul George and Russell Westbrook to snap the Thunder's seven-game win streak in a 134-129 thriller on Sunday.\n\nBoston has won four straight since a 115-111 home loss to the Warriors on Jan. 26 and has won nine of its last 10 games overall.\n\n\"We battled against Golden State, but (this is) a good win,\" said Al Horford, who had 17 points and nine assists. \"This team has been playing really well and it's just good to get this win here at home.\"\n\nMarcus Morris had 19 points, Marcus Smart added 18 and seven assists and Daniel Theis had 14 off the Celtics bench.\n\nGeorge scored 37 points and Russell Westbrook notched his sixth straight triple-double and 19th of the season with 22 points, 16 assists and 12 rebounds.\n\n\"We just played a good team,\" George said. \"I thought they made some big plays, big shots. Gotta live with it.\"\n\nSteven Adams and Dennis Schroeder each had 16 points for Oklahoma City, and Jerami Grant scored 15.\n\nOklahoma City suffered its first loss since a 138-128 overtime setback against the Los Angeles Lakers on Jan. 17.\n\nWestbrook made two free throws to pull Oklahoma City within 127-125 with 45.9 seconds remaining after Boston had led by six with 1:27 to go.\n\nIrving's driving finger-roll with 23.3 seconds left put Boston up by four, but Grant answered with a 3-pointer to bring the Thunder within 129-128.\n\nOklahoma City squandered a chance to take the lead after Jayson Tatum missed one of two free throws. Irving stripped Westbrook with 8.1 seconds on the clock and Horford got the ball back to Tatum, who sealed the win at the line.\n\n\"In a (tight) game like that, I've just got to take care of the ball, so that's on me,\" Westbrook said.\n\nIrving said \"instincts\" led him to gamble on his steal of Westbrook.\n\n\"It's winning time,\" Irving said. \"I feel like when the ball's in my hand, I've just got to make the right play. Being down the stretch, just trying to make the right decisions.\"\n\nTIP-INS\n\nThunder: George has made at least two 3-pointers in 31 straight games. ... Oklahoma City enjoyed its best offensive month in franchise history in January, averaging 120.6 points and 44.1 made field goals while going 9-5. ... F Abdel Nader (illness) did not play in his return to Boston. Nader, a 2016 second-round draft pick of the Celtics, averaged 3.0 points in 48 games as a rookie last season with Boston.\n\nCeltics: Irving scored 20 in the first half, giving him 20 or more points in a season-high nine straight games. ... C Aron Baynes missed Sunday's game after an MRI exam Saturday revealed a contusion in his left foot. \"I don't anticipate him being back anytime in the next week or so,\" coach Brad Stevens said. ... C/F Robert Williams (back tightness) also sat and is considered day-to-day.\n\nTHE BIG THREE\n\nIrving, George and Westbrook combined for 89 points in the nationally-televised affair that served as a warm-up act for the Super Bowl.\n\n\"Going against the best is always a great challenge,\" Irving said. \"You just want to stay consistent in this game. That's how you get respect. That's all I really care about, getting wins.\"\n\nTHUNDEROUS RESPONSE\n\nOklahoma City began the season with four straight losses, the last a 101-95 home defeat by Boston on Oct. 25.\n\n\"They're 33-14 since, which is as good as anybody in the league and they look like that,\" Stevens said before tipoff.\n\nSUPER SUNDAY\n\nPatriots fans who didn't travel to Atlanta to watch New England face the Los Angeles Rams in the Super Bowl made their presence felt at TD Garden. A sea of Tom Brady jerseys, \"Beat LA\" T-shirts and Pats-related signs accented the crowd. One fan shown on the video board wearing a Rams' Todd Gurley jersey was soundly booed.\n\nBefore last year's Super Bowl, Stevens wore a hoodie after the Celtics game in honor of Patriots coach Bill Belichick. He stuck with his usual wardrobe this time -- because the Patriots lost a year ago.\n\n\"I'm not superstitious as a coach,\" Stevens said. \"I'm superstitious as a fan.\"\n\nUP NEXT\n\nThunder: Host the Magic on Tuesday night to begin a stretch of seven of 11 at home.\n\nCeltics: Visit the Cavaliers on Tuesday night before hosting ex-Cavs star LeBron James and the rival Lakers on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994576.592768
}