{
  "game_id": "0021600503",
  "espn_id": "400899945",
  "date": "Dec 31, 2016",
  "matchup": "CHI vs. MIL",
  "headline": "Antetokounmpo scores 35 as Bucks beat Bulls 116-96",
  "body": "CHICAGO --  While it might be a bit premature to compare Giannis Antetokounmpo to LeBron James and Kobe Bryant, Malcolm Brogdon didn't let that stop him.\n\nIt's easy to see why on a night like this.\n\nAntetokounmpo scored 35 points, Jabari Parker added 27 and the Milwaukee Bucks used a huge fourth quarter to beat the Chicago Bulls 116-96 on Saturday.\n\n\"He's one of those Kobe Bryant, LeBron James-type players,\" Brogdon said. \"Playing with a guy like that makes it a little bit easier.\"\n\nThe Bucks outscored the Bulls 36-20 in the fourth to break open a tight game and come away with a lopsided win after dropping four of six.\n\nAntetokounmpo dazzled with an array of layups and dunks to go with a buzzer-beating 3-pointer at the end of the first half. He also had nine rebounds, seven assists and a career-high seven blocks in another strong all-around performance.\n\nAs for the comparison to Bryant and James?\n\n\"Let me tell you something. That jumper I hit in the second quarter, I felt like Kobe on that one,\" Antetokounmpo said, smiling. \"But it's great to (have) your teammates compare you to the greats. I think I'm not there yet, but I'm going to work as hard as I can.\"\n\nParker scored 18 points in the second half. Brogdon had a triple-double with 15 points, 12 assists and 11 rebounds in his second career start with Matthew Dellavedova sidelined by a strained right hamstring.\n\nGreg Monroe scored 15 points, and the Bucks beat the Bulls again after pounding them on back-to-back nights two weeks ago.\n\nChicago held out struggling point guard Rajon Rondo, hoping Michael Carter-Williams could provide a spark. But the Bulls lost for the eighth time in 11 games.\n\nJimmy Butler scored 26 points for Chicago, and Robin Lopez added 12 points and 10 rebounds. Dwyane Wade had eight points on 3-of-13 shooting.\n\n\"This team (the Bucks), they're as long and athletic as any in the league,\" coach Fred Hoiberg said. \"Obviously, we've had struggles against them in the three times that we've played them. It's an understatement. It's the attention to detail when you have something like that.\"\n\nPULLING AWAY\n\nThe Bucks let an 11-point lead in the third quarter shrink to one early in the fourth, but put it away from there.\n\nChicago closed to 80-79 on a 3 by Nikola Mirotic in the opening seconds of the quarter. But Milwaukee responded with a 10-0 run.\n\nAntetokounmpo started the decisive stretch by driving for a 3-point play and finished it with a free throw that bumped the lead to 90-79 with 8:33 remaining.\n\nRONDO BENCHED\n\nOne night after being benched for poor play in a loss at Indiana, Rondo didn't even get into the game.\n\nThe veteran point guard indicated he might ask for a trade if this continues after watching from the sideline on Saturday.\n\n\"I'm not surprised,\" Rondo said. \"It has been a tough season for us right now. There have been ups and downs. Certain buttons are being pushed. The Bulls are trying to figure things out.\"\n\nCarter-Williams had four points and four assists in 25 minutes. Jerian Grant backed him up and finished with five points and an assist in 18 minutes.\n\nTIP-INS\n\nBucks: Dellavedova missed his second straight game, and his status for Monday's matchup against Oklahoma City was unclear. With Dellavedova out, Brogdon started his second game in a row. ... C Miles Plumlee sat out with a sprained right index finger. ... Milwaukee outscored Chicago 58-28 in the paint and made 9 of 15 3-pointers.\n\nBulls: Butler has led the Bulls in scoring 25 times. ... Lopez has five double-doubles. ... The Bulls were 10 of 27 on 3s and 20 for 28 at the foul line.\n\nUP NEXT\n\nBucks: Host Oklahoma City on Monday.\n\nBulls: Host Charlotte on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995065.250151
}