{
  "game_id": "0021900752",
  "espn_id": "401161394",
  "date": "Feb 04, 2020",
  "matchup": "CHA @ HOU",
  "headline": "Harden scores 40 to lead Rockets over Hornets 125-110",
  "body": "HOUSTON --  James Harden has regained his shooting touch and that's helped the Houston Rockets go on a winning streak despite injuries to other starters.\n\nHarden had 40 points and 11 assists, and the short-handed Rockets overcame an early deficit to beat the Charlotte Hornets 125-110 on Tuesday night.\n\nHouston won its third straight, handing Charlotte its fourth consecutive loss and 12th in 13 games.\n\nHarden finished a rebound shy of a triple-double after also scoring 40 points but falling one assist short of a triple-double in Houston's last game. He's scored at least 35 points in each of his past three games after struggling through a shooting slump over the previous four.\n\nThe Rockets got off to a slow start and trailed throughout most of the first half on a night when they played without starters Clint Capela and Russell Westbrook, who sat out with injuries.\n\nHarden has carried a huge load for Houston during the winning streak, with Capela sidelined for all three games and Westbrook joining him on the bench Tuesday night.\n\nBut Harden was quick to point out that he's had some help.\n\n\"Guys are out with injuries, next guy has the opportunity to step up and play well,\" he said. \"And obviously I think everyone played well tonight, not just offensively but defensively, being in the right spots.\"\n\nThe Hornets led early in the fourth before the Rockets used a 15-2 run to take control midway through the quarter and cruise the rest of the way.\n\nCoach Mike D'Antoni was impressed that the Rockets picked it up in the second half to avoid heading to play the Lakers with a loss.\n\n\"They picked up their energy,\" he said. \"It was a tough game, one of those where after a couple of emotional games we get one without Russell and have to head to L.A. for the next game, (so) this was kind of a trap game where they could get you. But they understood what they were risking and came out after halftime and did the job.\"\n\nMiles Bridges and Terry Rozier had 20 points each for the Hornets, and Malik Monk added 19 off the bench.\n\nCharlotte coach James Borrego was happy to see his young team stay with the Rockets for much of the game.\n\n\"We competed from the start and came out with a great mindset ... we battled tonight,\" he said. \"We got off to a great start, we competed for 48 minutes and I'm proud of the group -- great effort.\"\n\nBridges made a 3-pointer to get Charlotte within eight with about 2 1/2 minutes left, but Harden scored the next seven points to push Houston's lead to 125-110 with about a minute to go. Harden hit a 3 before stepping back to make another one as he was fouled by Cody Martin.\n\nHarden fell onto his backside and smiled broadly as he watched the shot go in before making the free throw to complete a four-point play that sealed the victory.\n\nThe Rockets led by four entering the fourth quarter but consecutive 3s by Devonte' Graham put the Hornets up 101-98 with about eight minutes left.\n\nCharlotte's lead was short-lived, as Houston went on a 10-2 run, with five points from Harden, to make it 108-103 midway through the fourth.\n\nThe Hornets called a timeout, but it didn't stop Houston's run as Danuel House made a 3 seconds after the timeout.\n\nSoon after that Martin got hit in the nose by teammate Cody Zeller's elbow while the two were fighting for a rebound. Martin crouched to the ground holding his face as blood poured onto the court. He was quickly taken to the locker room, but it took a few minutes to clean the blood off the floor and resume play.\n\nHouse added a dunk on an alley-oop after that to extend Houston's lead to 113-103.\n\nMartin returned from the locker room with about five minutes left in the quarter and he re-entered the game with about three minutes to go.\n\nCharlotte led by 15 early but Houston ended the third quarter on a 10-4 run, with 3s from Ben McLemore and Austin Rivers, to take a 92-88 lead into the fourth.\n\nTIP-INS\n\nHornets: PJ Washington returned after missing two games with a sprained right ankle. ... Charlotte had 17 turnovers. ... The Hornets outrebounded Houston 53-41.\n\nRockets: House added 22 points and nine rebounds. ... Eric Gordon scored 16 points and P.J. Tucker had 13 points and 10 rebounds. ... Capela sat out for the fourth time in five games. D'Antoni said Capela won't return until he's pain-free. ... D'Antoni said he expects Westbrook, who has a sprained left thumb, to return Thursday night.\n\n120\n\nThe Rockets have scored 120 points or more in four of their last eight games after reaching the mark only three times in their previous 13 games. Houston is 18-2 when scoring at least 120 this season. It's just the second time in franchise history and first since the 1969-70 season that the Rockets have scored 120 points 20 times in the first 50 games of a season.\n\nUP NEXT\n\nHornets: Host Dallas on Saturday night.\n\nRockets: Visit the Lakers on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764996059.1618009
}