{
  "game_id": "0022000219",
  "espn_id": "401267379",
  "date": "Jan 20, 2021",
  "matchup": "ATL vs. DET",
  "headline": "Young has 38, Collins adds 31 as Hawks beat Pistons in OT",
  "body": "ATLANTA -- — Trae Young scored 38 points, John Collins had 31 and the Atlanta Hawks rallied to beat Jerami Grant and the Detroit Pistons 123-115 in overtime on Wednesday night.\n\n\r\n                    Grant had a career-high 32 points, including all of Detroit’s nine points in overtime, to continue his hot start to the season. But the Pistons fell to 3-11, the worst record in the Eastern Conference.\n\n\r\n                    Clint Capela had 27 points and a career-high 26 rebounds for Atlanta (7-7), the NBA’s first 25-25 game since Karl-Anthony Towns (27-27) on Jan. 12, 2019.\n\n\r\n                    The Hawks were short-handed. Forwards De’Andre Hunter (right knee soreness) and Cam Reddish (left knee contusion) were ruled out during pregame warmups. Reddish missed his third consecutive game.\n\n\r\n                    “I’m just happy we never gave up,” said Young, who had 10 assists. “We never gave up from beginning to end, no matter who was out there. We knew we were down a couple guys.”\n\n\r\n                    Young overcame a slow start. He had only six points in the first half after making only one of five free throws. He made 13 of 19 overall. \n\n\r\n                    Young scored 21 points in the third quarter, when Atlanta charged back after trailing by 14 points. After Young's three-point play cut Detroit's lead to 81-78, the Pistons scored the final 11 points of the period, including six by Grant.\n\n\r\n                    “We don’t come back in this game if Trae Young doesn’t turn into Trae Young down the stretch,” Hawks coach Lloyd Pierce said.\n\n\r\n                    Grant set a scoring high despite making only six of seven free throws.\n\n\r\n                    “It’s not even conscionable think that he’s driving to the basket that much and not getting hit,” Pistons coach Dwane Casey said.\n\n\r\n                    After trailing 99-82, Atlanta rallied again in the final period. Capela's jam, set up by a pass from Young, tied the game at 106. Grant's last-second drive to the basket was blocked by Collins, forcing overtime.\n\n\r\n                    Capela's three-point play gave Atlanta a 116-113 lead it wouldn't lose. Young padded the lead with a 3-pointer.\n\n\r\n                    Capela posted Atlanta’s first game with at least 25 points and 25 rebounds since Dikembe Mutombo’s 27 points and 29 rebounds against Minnesota on Dec. 14, 1999. Collins had 11 rebounds.\n\n\r\n                    “If we continue to get that same type of effort and scoring and rebounding from those guys, the sky is the limit for this team,” Young said.\n\n\r\n                    Detroit led 52-45 at halftime and stretched the lead to 10 points when Ellington opened the second half with a 3-pointer. Ellington sank another 3 to extend the lead to 14 points, 63-49.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Blake Griffin had 17 points and Wayne Ellington had 16. ... Detroit was swept in the two-game season series, including a 128-120 loss in Atlanta on Dec. 28. \n\n\r\n                    Hawks: Capela had 15 rebounds in the first half. The last Atlanta player with 15 rebounds in a half was Dwight Howard against Washington on Oct. 27, 2016. ... Atlanta has been without forward Danilo Gallinari (ankle) for 10 games, and guard Bogdan Bogdanovic (knee) missed his fifth consecutive game.\n\n\r\n                    NO SURGERY FOR HAYES\n\n\r\n                    Pistons rookie guard Killian Hayes won't need surgery after suffering a torn labrum in his right hip on Jan. 4.\n\n\r\n                    Hayes will have rest and rehabilitation and will be evaluated in eight weeks. He was the No. 7 overall pick in the 2020 NBA draft.\n\n\r\n                    “The one thing I’m concerned about is to make sure he stays connected mentally,” Casey said. “Keep the village around him. ... Make sure he stays connected to the team.”\n\n\r\n                    GRANT EXTENDS 20-POINT STREAK\n\n\r\n                    Grant has scored 20 or more points in 13 consecutive games. He opened the season with nine points in a loss at Minnesota and then launched his career-long streak with 28 points against Cleveland on Dec. 26. \n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Play host to Houston on Friday night.\n\n\r\n                    Hawks: Visit Minnesota on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997848.839537
}