{
  "game_id": "0022301196",
  "espn_id": "401585824",
  "date": "Apr 14, 2024",
  "matchup": "OKC vs. DAL",
  "headline": "Thunder rout Mavericks 135-86 to take the No. 1 seed in the Western Conference",
  "body": "OKLAHOMA CITY -- — With about 90 seconds remaining, Oklahoma City's fans stood in unison and began chanting.\n\n\r\n              O-K-C! O-K-C!\n\n\r\n              As the final moments wound down in a 135-86 win over the Dallas Mavericks, the still-standing Thunder fans celebrated a team that went from winning 24 games two seasons ago to having the best record in the Western Conference this season. Shai Gilgeous-Alexander scored 15 points in one half of action, and the Thunder dominated a depleted Dallas squad on Sunday for the No. 1 seed in the Western Conference playoffs.\n\n\r\n              Oklahoma City finished with the same 57-25 record as the Denver Nuggets but owns the tiebreaker. The Thunder hadn’t finished as the top seed since the 2012-13 season and hadn't been to the playoffs since the 2019-20 season.\n\n\r\n              The Thunder say they have climbed by focusing on daily improvement, and they'll continue to do so.\n\n\r\n              “We all know what got us to this point,” Gilgeous-Alexander said. “Just doubling down on that and keeping our heads down and trusting the work. We got this far for a reason. Just don’t veer off of it.”\n\n\r\n              Thunder coach Mark Daigneault said he's proud of a squad that began the season as the third-youngest team in the league.\n\n\r\n              “Nothing’s guaranteed in any year, so, to be a postseason team, to be a one seed — we don’t take that for granted at all,\" he said. “We’re incredibly excited. And now it’s just a matter of letting it rip with that opportunity.”\n\n\r\n              Daigneault said now that the youth won't matter going forward.\n\n\r\n              “We’re zero and zero when we wake up tomorrow morning for the playoffs,\" Daigneault said. \"So what we’ve accomplished to this point doesn’t impact that. But I do think we’ve built great habits. We’ve done it together. Again, I have a lot of confidence, but not because of our age ... but because of how the guys have performed and the things they've built together.”\n\n\r\n              Aaron Wiggins scored 14 points and Chet Holmgren had 13 points and nine rebounds for the Thunder, who won their fifth straight to close the regular season. \n\n\r\n              The Thunder entered the day in a three-way tie with the Nuggets and Timberwolves for the best record in the Western Conference. It was the first time in NBA history that three teams entered the final day of the season tied for a conference lead. They were able to claim the top seed despite Gilgeous-Alexander missing six games late in the season with a bruised right thigh.\n\n\r\n              The Thunder will have to wait for the Play-In Tournament's conclusion to learn their first-round opponent. \n\n\r\n              NBA scoring leader Luka Doncic and star guard Kyrie Irving were among the four starters the Mavericks rested. Doncic had a sore left ankle and Irving had a sore left hamstring. The Mavericks already had clinched the No. 5 seed and a first-round matchup with the Los Angeles Clippers.\n\n\r\n              Brandon Williams scored 22 points and Olivier-Maxence Prosper added 15 for the Mavericks.\n\n\r\n              Oklahoma City ran out to an 11-0 lead as the Mavericks missed their first four shots. The Thunder led 39-22 at the end of the period.\n\n\r\n              Oklahoma City led 82-41 at halftime. The team set a season high for points in a half and fell one point short of a Thunder record for points in a half after missing a shot off the front iron at the buzzer. Oklahoma City shot 60.4% from the field before the break.\n\n\r\n              Gilgeous-Alexander, Jalen Williams and Holmgren sat at the start of the second half with the game under control. Oklahoma City hit the 100-point mark with 3:30 left in the third quarter and led 101-49 after a pair of free throws by Bismack Biyombo. Oklahoma City led 108-57 at the end of the third.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Visit the Los Angeles Clippers in Game 1 of a Western Conference playoff series.\n\n\r\n              Thunder: Will host Game 1 of a Western Conference playoff series.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996700.049221
}