{
  "game_id": "0022300744",
  "espn_id": "401585372",
  "date": "Feb 09, 2024",
  "matchup": "HOU @ TOR",
  "headline": "Immanuel Quickley scores 25 as Raptors beat Rockets 107-104 for 2nd straight victory",
  "body": "TORONTO -- — Immanuel Quickley scored 25 points, RJ Barrett had 21 and the Toronto Raptors held on to beat Houston 107-104 on Friday night for their fourth straight home win over the Rockets.\n\n\r\n              Jakob Poeltl had 16 points and 12 rebounds and Scottie Barnes added 13 points and 10 rebounds as the Raptors won their second straight after losing eight of nine. Toronto, coming off a victory over Charlotte on Wednesday, hadn’t won consecutive games since beating Cleveland on Jan. 1 and Memphis on Jan. 3.\n\n\r\n              Barnes shot 4 for 16 and narrowly missed a triple-double, finishing with eight of Toronto’s 24 assists. \n\n\r\n              “I thought his playmaking tonight was outstanding,” Raptors coach Darko Rajakovic said. “He was finding his teammates.”\n\n\r\n              Barrett’s seven assists were a season high.\n\n\r\n              Toronto’s biggest lead was 22 points before Houston cut its deficit to one, 105-104, on a 3-pointer by Dillon Brooks in the final 30 seconds of the fourth quarter. Barrett answered with a pair of free throws.\n\n\r\n              With five seconds left, Houston’s Aaron Holiday missed a 3-point attempt that would have tied the game. The Rockets got the ball back, but veteran forward Jeff Green missed the final shot.\n\n\r\n              “We put ourselves in a good position,” Green said. “Some shots fall, some don’t. You live with the results.”\n\n\r\n              Brooks scored 11 of his 20 points in the fourth, and Jabari Smith Jr. had 12 points and 11 rebounds for the Rockets. Cam Whitmore scored 17 points before leaving because of a sprained right ankle as Houston lost its fourth straight on the road. Houston is 5-19 away from home. \n\n\r\n              The Rockets have lost three straight following a home win over Toronto on Feb. 2.\n\n\r\n              “We just played this team a week ago and didn’t have a whole lot of carryover,” Houston coach Ime Udoka said.\n\n\r\n              Former Raptors guard Fred VanVleet missed his second straight game because of a strained left adductor, missing a chance to play in the city where he spent the first seven years of his career and won an NBA title in 2019.\n\n\r\n              Udoka said earlier this week that VanVleet likely won’t return until closer to the All-Star break.\n\n\r\n              Fans rose for a standing ovation when the Raptors honored VanVleet with a video tribute during the game’s first timeout. VanVleet walked onto the court and lifted his hands in a gesture of thanks.\n\n\r\n              Toronto newcomers Ochai Agbaji and Kelly Olynyk, acquired from Utah on Thursday, were active, but did not play.\n\n\r\n              The Raptors scored 10 points off eight Houston turnovers in the opening quarter and led 34-20 after one.\n\n\r\n              “We’ve got to bring that intensity from the beginning,” Brooks said. “Our starters, including myself, were a little slow to begin with. We can’t dig ourselves those types of holes.”\n\n\r\n              Whitmore scored 15 points in the second, when the Rockets took their first lead of the game by starting the quarter with a 19-2 run. Toronto rallied and led 61-49 at the half and took an 88-71 lead to the fourth.\n\n\r\n              Referee Courtney Kirkland did not return for the second half. A Raptors spokesperson said Kirkland left because of an illness.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Visit Atlanta on Saturday.\n\n\r\n              Raptors: Host Cleveland on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995597.212258
}