{
  "game_id": "0022300196",
  "espn_id": "401584824",
  "date": "Nov 15, 2023",
  "matchup": "ORL @ CHI",
  "headline": "Banchero hits turnaround jumper with 1 second left as Magic beat Bulls 96-94",
  "body": "CHICAGO -- — Paolo Banchero took four dribbles as he backed into the lane and didn't bother to look at the rim before lifting off for a fadeaway jumper. Moments later, teammates mobbed him.\n\n\r\n              Banchero scored with one second remaining, and the Orlando Magic beat the Chicago Bulls 96-94 on Wednesday night.\n\n\r\n              The Magic held Chicago to 33 points in the lowest scoring first half in the NBA this season and led by 19 in the third quarter. But the Bulls tied it when Zach LaVine buried a 3-pointer in the closing seconds of the game.\n\n\r\n              Banchero, the 2023 Rookie of the Year, then took the inbounds pass on the left side following a timeout and backed into the paint with Alex Caruso guarding him. He turned toward the middle and watched as his 7-footer hit the front and back of the rim before falling through the net. That gave Orlando a wild win after losing three of four.\n\n\r\n              “When Zach hit the last 3, we all just looked at the clock, saw how much time was left and knew that we were gonna be able to get a good look,” said Banchero, who led Orlando with 17 points. “Coach drew it up for me to get it in the post. When we went out there, I thought Patrick Williams was gonna be on me, but it was Caruso, so I wanted to attack the rim if I got the ball. I tried to back him in as far as I could and got a turnaround off.”\n\n\r\n              Caruso seemed to think Banchero traveled. But he also gave him credit for making a difficult shot.\n\n\r\n              “Without saying too much, we’ll look at the (last) two-minute report and see what happened with the foot movement down for Paolo,\" Caruso said. “But overall, I tried to make it tough on him. He made a tough shot.”\n\n\r\n              Goga Bitadze had 15 points and 11 rebounds for the Magic. Cole Anthony scored 16. Franz Wagner added 13 points, and the Magic came away with the win despite shooting 39% and making just 8 of 28 3-pointers.\n\n\r\n              LaVine scored 19 for the Bulls, who were without DeMar DeRozan, who missed the game for personal reasons.\n\n\r\n              Nikola Vucevic had 17 points and nine rebounds. Caruso scored 16 after missing two games with a toe injury, and Andre Drummond grabbed 14 rebounds. But the Bulls — like the Magic — struggled from beyond the arc, making 9 of 33 3s.\n\n\r\n              BULLS RALLY\n\n\r\n              The Magic led by 19 late in the third, only to have Chicago pull within nine — 73-64 — on a buzzer-beating 3 by Caruso.\n\n\r\n              Vucevic cut it to 87-82 when he scored on a hook with three minutes remaining. Banchero then drove for a layup and answered a basket by Caruso with a 3 to make it 92-84 with just over two minutes left.\n\n\r\n              Caruso hit two free throws with 57 seconds remaining to pull Chicago within 92-88.\n\n\r\n              Banchero made 1 of 2 free throws, but the Bulls weren't finished. LaVine cut it to 93-91 when he nailed a 3 with 17 seconds remaining.\n\n\r\n              Orlando's Anthony Black had a chance to make it a two-possession game when he got fouled with 14 seconds remaining but missed the second of two free throws.\n\n\r\n              Caruso got the rebound and LaVine buried a 3 following a timeout to tie it at 94 with 7.5 seconds left.\n\n\r\n              “I loved our guys' resolve at the end, understanding that we've been in these scenarios before and it's why we do the two-minute drills,” Magic coach Jamahl Mosley said. “Did it go perfectly? No. But that's what the will of this team is. They'll find a way. That was a big-time, big-time poise play by Paolo to get in there and finish the play at the end of the game.”\n\n\r\n              UP NEXT\n\n\r\n              The two teams play again Friday in Chicago in an In-Season Tournament Group C game. ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995743.616974
}