{
  "game_id": "0022300128",
  "espn_id": "401584756",
  "date": "Nov 02, 2023",
  "matchup": "TOR @ PHI",
  "headline": "Embiid scores 28 points, 76ers beat Raptors 114-99 in first game since Harden trade",
  "body": "PHILADELPHIA -- — Joel Embiid clips popped up on social media for a handful of blocked shots he seemed to have against Toronto.\n\n\r\n              Just don't check the box score. The reigning NBA MVP had only one.\n\n\r\n              \"I was like, one? I feel like he should have been credited with four,\" coach Nick Nurse said. \"I feel like he got a piece of three others. Does that count if you get a piece? Or do you have to beat it into the third row to get somebody to mark it down?\"\n\n\r\n              Embiid otherwise stuffed the stat sheet with 28 points, 13 rebounds and seven assists and the Philadelphia 76ers won in their first game since trading James Harden, beating the Toronto Raptors 114-99 on Thursday night.\n\n\r\n              The 76ers are now free to play without Harden's situation hanging over the franchise.\n\n\r\n              “I don't think we've ever had any distractions,” Embiid said. “You can see the way we've been playing and the way we've carried ourselves. I don't think we've been bothered. Guys have been focused knowing that we're still good enough.”\n\n\r\n              Kelly Oubre Jr. and Tobias Harris each scored 23 points for the 76ers. Tyrese Maxey had 18. Scottie Barnes led the Raptors with 24 points.\n\n\r\n              Oubre’s ascension to the starting lineup in place of PJ Tucker, who was included in the Harden deal, left the Sixers with a thin bench. Marcus Morris and Nic Batum did not play in their first game since they were dealt by the Clippers. Robert Covington and K.J. Martin got some run in the final 90 seconds with the game in hand.\n\n\r\n              Nurse already faced challenges in his first season on the bench after five seasons in Toronto. He needed to learn about his players, teach his system and do it all while navigating Harden’s complicated playing status.\n\n\r\n              After training camp and a month of practice, Nurse almost has to start from scratch.\n\n\r\n              “It would have been better a month ago, I do know that much,” he said before the game. “It’s here and it’s where we are.”\n\n\r\n              Nurse said the newest 76ers would need extra work at practices and shootarounds — “as much as you can without overloading them — before they earn significant playing time.\n\n\r\n              “They’ll be in extra study halls here for a couple of days so we can just get them up to speed,” Nurse said.\n\n\r\n              The Sixers used nine players and built a 58-49 lead at halftime with big buckets from some unexpected role players.\n\n\r\n              Furkan Korkmaz, a forgotten Sixer in the postseason rotation, stretched the lead with a dunk off a turnover and a 3 that got a rise out of the crowd. When the 76ers wilted a bit in the third, Korkmaz delivered with a baseline reverse bucket and a free throw that nudged the lead to 90-77. He had 10 points and the 76ers named him player of the game.\n\n\r\n              Toronto snapped a three-game losing streak with a 130-111 home victory over the Milwaukee Bucks on Wednesday night. The Raptors failed to build off the win and instead made it two losses already this season to the 76ers.\n\n\r\n              “I think it’s pretty cool playing the same team the same week,” Raptors coach Darko Rajaković said. “You can always use the film from the previous game to teach and show the stuff that we need to do better. I think it’s a great opportunity for a team like ours to grow.”\n\n\r\n              UP NEXT\n\n\r\n              Toronto: At San Antonio on Sunday.\n\n\r\n              76ers: Host Phoenix on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995465.122577
}