{
  "game_id": "0021400621",
  "espn_id": "400578913",
  "date": "Jan 19, 2015",
  "matchup": "POR vs. SAC",
  "headline": "Blazers overcome exit of LaMarcus Aldridge for injured thumb, end skid",
  "body": "PORTLAND, Ore. -- Even after losing All-Star forward LaMarcus Aldridge to an injury, the banged-up Trail Blazers found a winning combination.\nDamian Lillard scored 22 points, including the go-ahead basket with 1:20 remaining, and Portland ended a three-game losing streak Monday night with a 98-94 victory over the Sacramento Kings.\nLillard had six points during the final 80 seconds and helped rally the Trail Blazers (31-11) from an 11-point, second-half deficit. Wesley Matthews scored 17 for Portland.\nThe news wasn't all good for the Blazers, though, because Aldridge exited in the second quarter with a left thumb injury. Portland coach Terry Stotts said the status of Aldridge, who leads the team with averages of 23.5 points and 10.4 rebounds per game, was \"under further review.\" X-rays after the game came back negative.\nThe loss of Aldridge added to an already-depleted Portland front line, with centers Robin Lopez (wrist) and Joel Freeland (shoulder) out for extended periods. And without three of its top inside players, Portland got whipped on the boards by Sacramento (16-25), which outrebounded the Blazers 53-35.\n\"Being relatively undersized, we had to create some offense with our defense,\" Stotts said.\nStotts turned to lightly used reserves Thomas Robinson and Will Barton for long stretches. They, along with Lillard and Matthews, were vital in helping Portland own the fourth quarter, when the Blazers forced eight turnovers and outscored Sacramento 31-19.\n\"I thought Will and Thomas' energy would have a chance to change the game,\" Stotts said.\nThe Kings were led by Rudy Gay with 26 points, while DeMarcus Cousins had 22 points and 19 rebounds. But in a game Sacramento dominated for three quarters, the Kings' eight fourth-quarter turnovers proved to be their undoing.\n\"That's eight more possessions that we had that they didn't,\" Lillard said. \"It came down to us just tightening up. We got a little more physical on defense, got a little more stingy, and offensively we valued those possessions.\"\nThe Blazers, trailing 75-67 after three, grabbed an 84-83 lead with 5:03 remaining on a 3-pointer by Nic Batum that capped a 12-2 spurt.\nCousins tied it at 89 on two free throws with 1:50 left, then fouled out 8 seconds later.\n\"That was huge,\" Lillard said. \"In my opinion, he's one of the best bigs in the league. It would have been a handful down the stretch to stop him.\"\nLillard gave the Blazers the lead for good at 91-89 on a reverse layup. Portland held off Sacramento by making five free throws during the final 1:02.\n\"I thought we did a great job. The pace of the game was good. I thought we fought hard tonight and gave ourselves a chance to win. It's a disappointing loss, but I'm happy with the effort from the guys,\" Kings coach Tyrone Corbin said after his team's fourth consecutive loss.\n\"If we play and compete this hard every night, we've got a chance.\"\nSacramento dominated most of the first quarter, and Darren Collison and Ben McLemore hit 3-pointers to ignite a 23-5 run for a 25-14 Kings lead.\nPortland ran off nine consecutive points to cut the deficit to 31-27 early in the second. A 7-0 surge, punctuated by Meyers Leonard's fast-break dunk, gave the Blazers a 47-43 lead 3 minutes before halftime. But the Kings had a strong finish to the quarter, and Cousins' tip-in not long before the buzzer gave Sacramento a 56-51 halftime lead.\nSacramento continued to control the game during the third quarter, using an 8-0 run to build a lead as large as 11 points.\nTIP-INS\nKings: F Jason Thompson played his 500th career game with Sacramento, third-most in franchise history. ... Sacramento's 23 turnovers were a season high for a Portland opponent. ... In the first game between these teams on Oct. 31, Gay scored a season-high 40 points.\nTrail Blazers: F Victor Claver, who played only 10 minutes in Portland's previous nine games, started the second half in Aldridge's absence. ... Before the game, Blazers owner Paul Allen presented a plaque to Matthews after he became the franchise's career leader in 3-pointers with 778.\nBENCH COMES UP BIG\nWith Aldridge out, Stotts turned to his bench for a scoring boost. Portland reserves scored 37 points, their most since the Blazers bench scored 44 against Houston on Dec. 22. Leonard and Dorell Wright had nine points each.\nDOUBLE TROUBLE\nCousins had his 20th double-double in 22 games. The 6-foot-11 center also had four blocked shots. Cousins, coming off a one-game absence due to a sprained ankle, is tied for the NBA lead in double-doubles with 24.\nUP NEXT\nKings: Home against New Jersey on Wednesday.\nTrail Blazers: At Phoenix on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764992075.395103
}