{
  "game_id": "0021600328",
  "espn_id": "400899770",
  "date": "Dec 07, 2016",
  "matchup": "DAL vs. SAC",
  "headline": "Cousins leads Kings to easy 120-89 win over last-place Mavs",
  "body": "DALLAS --  DeMarcus Cousins and the Sacramento Kings started and ended with victories on a six-game trip that got a little weird in the middle.\n\nNow they're headed home, but the road-heavy schedule isn't quite finished.\n\nCousins had 24 points and 14 rebounds, and the Kings snapped a three-game losing streak with a 120-89 victory over the last-place Dallas Mavericks on Wednesday night.\n\nRudy Gay scored 19 as the Kings wrapped up a trip that started with a win at Brooklyn before an overtime loss at Washington on a back-to-back and a postponement in Philadelphia over poor floor conditions.\n\nIt was the second road trip of at least five games for the Kings, who play 21 of the first 35 games away from their new Golden 1 Center.\n\n\"Nobody wants to fly that long with a loss under their belt,\" said Cousins, who had his 11th double-double and tied his season high with seven assists. \"A good way to go home, good way to end this trip. Hopefully we can gain some momentum from this and start a little streak.\"\n\nDeron Williams had 20 points for the injury-plagued Mavericks, who dropped to 4-17 in what is shaping up as their worst season in more than 20 years. Four rotation players were out, most notably Dirk Nowitzki (strained right Achilles tendon).\n\nThe Kings led by four when they started the second half with an 11-0 run. They led by as many as 23 points in the third quarter before the lead ballooned to 33 late in the fourth.\n\nDallas coach Rick Carlisle didn't take questions after a roughly 30-second statement following the game, and reporters were later asked to leave the locker room for a team meeting.\n\n\"That was a very, very, very disappointing performance,\" Carlisle said. \"The second half was inexcusable. The way we played -- just the way we performed all around -- everything from how we competed, decision-making. Shot-making comes and goes, but the competitive spirit has got to be there.\"\n\nTIP-INS\n\nKings: Kosta Koufos had six of his eight points during the 11-0 run to start the second half. ... Garrett Temple made all four of his 3-point attempts and finished with 17 points. One of the 3s came after Dallas had pulled within 14 midway through the fourth. ... Former Dallas point guard Darren Collison scored 19 points.\n\nMavericks: At halftime, Harrison Barnes received his ring as a member of the gold medal U.S. men's team at the Rio Olympics last summer. ... Dallas got two technicals in the fourth quarter for Carlisle calling a timeout when the Mavericks didn't have any. It's the second time this season that has happened.\n\nTURNABOUT\n\nThe Kings have won two in a row in Dallas following a 22-game streak by the Mavericks that was the longest at home against any opponent in franchise history. The previous streak ran from 2003 to 2016.\n\nWALKING WOUNDED\n\nDallas center Andrew Bogut will be out 10 to 14 days with a right knee injury sustained in Monday's loss to Charlotte, while Nowitzki missed his sixth straight game and 16th overall. The other rotation players out are guards J.J. Barea (left calf injury) and Seth Curry (right knee sprain). Curry is the closest to returning.\n\nFIRST START\n\nKings guard Ben McLemore scored nine points, hitting 1 of 6 from 3-point range, in his first start of the season after sitting for three straight games as a coach's decision. Arron Afflalo didn't play after starting 18 of the first 20.\n\n\"Ben has been doing his work and it is no detriment to Arron or the group or anything,\" coach Dave Joerger said. \"It was just a great opportunity for him.\"\n\nNUMBING NUMBERS\n\nBarnes, Dallas' leading scorer, had 11 points on just 5-of-16 shooting. Wesley Matthews scored 16 points, none in the second half. The Mavericks had a season-high 23 turnovers and were outscored 34-7 on points off turnovers.\n\nUP NEXT\n\nKings: Host Knicks on Friday before traveling to Utah for back-to-back.\n\nMavericks: Finish four-game homestand Friday against Indiana.",
  "source": "espn_api",
  "crawled_at": 1764996150.297306
}