{
  "game_id": "0021800279",
  "espn_id": "401070960",
  "date": "Nov 24, 2018",
  "matchup": "CLE vs. HOU",
  "headline": "Sexton scores 29 as Cavs hold off Harden, Rockets 117-108",
  "body": "CLEVELAND --  Cavaliers coach Larry Drew believes his team is starting to figure things out.\n\nCleveland's players are proving him right, at least for the last two nights.\n\nRookie Collin Sexton scored a season-high 29 points and the Cavaliers won consecutive games for the first time this season, beating Houston 117-108 on Saturday night.\n\nCleveland (4-14) won 121-112 in Philadelphia on Friday and rode that momentum against the Rockets, overcoming 40 points by James Harden.\n\n\"We beat good teams,\" Drew said. \"As I told our guys, I really believe this team is still scratching the surface and there is definitely room to improve.\"\n\nChris Paul, who is second on the team in scoring and leads Houston in assists, was rested after the Rockets lost in overtime to Detroit on Friday. Paul's absence left most of the scoring load to Harden, who played the entire second half.\n\nDrew thinks the Cavaliers are taking positive steps after losing 11 of 12 to start the season and dealing with coach Tyronn Lue being fired and All-Star forward Kevin Love having foot surgery.\n\n\"It's not complicated,\" Drew said. \"You have to play hard every night to give yourself a chance. We're starting to do that. You're starting to see guys play with a lot more confidence.\"\n\nSexton, taken with the eighth pick in the draft, was 14 for 21 from the floor and hit several key baskets in the second half as the Cavaliers held off multiple runs from the Rockets.\n\n\"I'm going out there and playing my game, getting to my shots that I know I'm capable of making nine times out of 10,\" Sexton said.\n\nHarden was 14 for 30 from the floor with 13 assists in 44 minutes, but committed nine turnovers. The reigning MVP scored 24 points in the first half, including 15 for the second straight night in the first quarter. Harden has scored at least 30 points in four consecutive games.\n\nThe first half had 12 lead changes, but Cleveland went ahead for good early in the second quarter.\n\n\"We gave them confidence, offensive rebounds, giving them second-chance rebounds,\" Harden said. \"That's pretty much it.\"\n\nHarden made two free throws in the third quarter, but both were waved off because of his own foul line violations.\n\n\"It shocked me,\" he said. \"Two times in a row.\"\n\nEric Gordon started at point guard and scored 28 points, but the Rockets (9-9) have dropped two straight after winning eight of 10.\n\nTristan Thompson had 16 points and 20 rebounds for Cleveland. Jordan Clarkson added 20 points.\n\nSexton and Clarkson hit baskets after Houston cut a 10-point deficit to 106-102 with five minutes to play. Rodney Hood's 3-pointer gave Cleveland a 115-104 lead with 2:47 remaining.\n\nSTRAIGHT TO THE POINT\n\nRockets coach Mike D'Antoni had a simple explanation for the loss.\n\n\"We played soft to start the game and they got going,\" he said. \"They gained some confidence, and it's hard to turn them off when they get started. We're playing a lot of guys a lot of minutes, but this biggest thing was, mentally and physically, we were soft to start the game.\"\n\nWELL, IT SOUNDS SIMPLE\n\nDrew laughed when asked for the best defensive strategy against Harden.\n\n\"Just hope he misses,\" Drew said. \"He can beat you in. He can beat you out. He's really good.\"\n\nMAPPING IT OUT\n\nThe Rockets want to be cautious with how much the 33-year-old Paul plays. The nine-time All-Star is in his 14th season.\n\n\"The plan was always to monitor his workload,\" D'Antoni said.\n\nPaul scored 20 points in 37 minutes Friday. He averages 17.9 points and 7.7 assists in 15 games.\n\nTIP-INS\n\nRockets: Houston had won 10 of the last 12 meetings with Cleveland going into the game. ... Friday's game began a stretch that will see the Rockets play seven of nine on the road. ... C Clint Capela had 12 points, 10 rebounds and four blocked shots in 40 minutes.\n\nCavaliers: F David Nwaba started for the third straight game in place of Larry Nance. Nwaba had steals on Houston's first two possessions that resulted in Cleveland baskets. ... G George Hill (sprained right shoulder) has begun shooting drills, but Drew isn't sure when he'll return. Hill has missed the last eight games.\n\nUP NEXT\n\nRockets: Visit Washington on Monday.\n\nCavaliers: Host Minnesota on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994798.007422
}