{
  "game_id": "0022400348",
  "espn_id": "401704914",
  "date": "Dec 08, 2024",
  "matchup": "MIL @ BKN",
  "headline": "Bucks snap a 2-game skid with a 118-113 victory over the Nets",
  "body": "NEW YORK -- — Giannis Antetkounmpo had 34 points, 11 rebounds and four assists and the Milwaukee Bucks snapped a two-game skid with a 118-113 win over the Brooklyn Nets on Sunday.\n\n\r\n              Damien Lillard had 15 points and 11 assists and Bobby Portis added 23 points and five rebounds off the bench. The Bucks won for the 10th time in 13 games.\n\n\r\n              Dennis Schroder had 34 points and 10 assists, Cam Johnson scored 26 points and Nic Claxton added 21 points and nine rebounds as the Nets lost for the fourth time in five games, falling to 4-13 against Eastern Conference foes.\n\n\r\n              Takeaways\r\n              Milwaukee: Lillard’s streak of six straight 25-point games ended. Antetokounmpo had his NBA-best 14th game with at least 30 points.\n\n\r\n              Brooklyn: Schroder led Brooklyn in scoring for the fourth time this season, surpassing 30 points for the third time. He is averaging 31.5 points in two games against Milwaukee this season and has 493 points in 31 career games against the Bucks.\n\n\r\n              Key moment\r\n              Brooklyn led 108-104 after Schroder's jumper with 3:08 left, but Milwaukee countered by scoring 15 of the game’s final 20 points.\n\n\r\n              Bucks forward Khris Middleton, playing in just his third game this season while recovering from bilateral ankle surgery, scored seven points in the fourth quarter. Portis put Milwaukee ahead for good, 109-108, with a 3-pointer with 2:08 left.\n\n\r\n              Key stat\r\n              Brooklyn snapped Milwaukee’s 15-game streak of holding opponents to below 50% shooting. The Nets were just the fourth team to make more than 50% of its field goals against the Bucks. Milwaukee improved to 1/3 in games in which it allows a team to shoot better than 50%.\n\n\r\n              After making just 8 of 22 field goals (36.4%) in the first quarter, the Nets shot 56% over the final 36 minutes.\n\n\r\n              Up next\r\n              Milwaukee hosts Orlando in an NBA Cup quarterfinal Tuesday. Brooklyn is at Memphis on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997850.4677958
}