{
  "game_id": "0022400428",
  "espn_id": "401704994",
  "date": "Dec 28, 2024",
  "matchup": "CHA vs. OKC",
  "headline": "Gilgeous-Alexander, Williams lead OKC past Charlotte 106-94 for 10th regular-season straight win",
  "body": "CHARLOTTE, N.C. -- — Shai Gilgeous-Alexander had 22 points, Jalen Williams added 20 points and the Oklahoma City Thunder beat the Charlotte Hornets 106-94 on Saturday night for their 10th straight regular-season win.\n\n\r\n              Aaron Wiggins added 17 points and Isaiah Hartenstein had 12 points and 15 rebounds for the Thunder, who never trailed.\n\n\r\n              Miles Bridges had 19 points and 10 rebounds, while Vasa Micic added 16 points for the Hornets, who have lost 15 of their last 16 games.\n\n\r\n              Both teams were missing multiple starters with LaMelo Ball and Brandon Miller sitting out for Charlotte and Luguentz Dort and Cason Wallace out for the Thunder.\n\n\r\n              Oklahoma City bolted to a 61-46 halftime lead with Gilgeous-Alexander and Wiggins combining for 26 points on 11-of-17 shooting. The Thunder extended the lead to 20 in the third quarter and were never truly challenged again.\n\n\r\n              Takeaways\r\n              Thunder: It wasn't the best game of the season by the Thunder, but they avoided playing down to the level of competition, holding a double-digit lead for most of the game.\n\n\r\n              Hornets: With Ball, Miller and Tre Mann out of the lineup, Charlotte simply didn't have the firepower to keep up with the Thunder. On most offensive sets Micic and Miles Bridges were the focal point of the offense. Charlotte had some chances to get it under 10 late in the game but couldn't sink enough shots. \n\n\r\n              Key moment\r\n              The Hornets cut the lead to 11 with 10 minutes to play but Kenrich Williams scored on a layup off a feed from Ajay Mitchell to squash any comeback hopes. \n\n\r\n              Key stat\r\n              Playing without Ball and Miller, the Hornets needed Bridges to step up but he was just 1 of 8 from beyond the arc.\n\n\r\n              Up next\r\n              The Thunder host Grizzlies on Sunday night in the second night of a back-to-back. The Hornets host the Bulls on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997711.359648
}