{
  "game_id": "0021900206",
  "espn_id": "401160848",
  "date": "Nov 20, 2019",
  "matchup": "MIA vs. CLE",
  "headline": "Robinson’s record night helps Heat beat Cavs, 124-100",
  "body": "MIAMI --  John Beilein had seen Duncan Robinson get on hot shooting stretches plenty of times before.\n\nNone of those were at his expense.\n\nRobinson put on a show for his college coach -- and got himself into the Miami record book as well. He set team marks with seven 3-pointers in the second quarter, eight in the first half and finished with a career-high 29 points as the Heat rolled past Beilein and the Cleveland Cavaliers 124-100 on Wednesday night.\n\n\"That young man the last two years has developed with the Miami culture,\" said Beilein, the first-year Cavaliers coach who had Robinson for three seasons at Michigan. \"He's developed his game into a whole different level. ... Part of it you hate, but it's also part of your blood.\"\n\nRobinson was 9 for 15 from the field, all of them coming from 3-point range.\n\nHis early flurry helped Miami tie a franchise mark with 75 first-half points. The lead was 27 at the break and the Heat stayed in control the rest of the way. Kevin Love's jumper with 9:07 left got Cleveland to 102-86 and capped a 13-3 run, but the Cavs didn't get any closer.\n\n\"It's not lost on me that Coach B has done so much for my career,\" Robinson said. \"So it's pretty cool to have us competing on a stage like this. We're very competitive people so it's nice to come out on top, but I'm also very appreciative of everything he's done for me.\"\n\nTyler Herro scored 22 points for Miami, which had no problem on a night when Jimmy Butler missed 12 of his first 13 shots and finished with 21 points anyway.\n\n\"We can't keep surprising people,\" Butler said. \"We're for real. I don't think anybody wants to play against us and that's the way we want to keep it.\"\n\nLove scored 25 and grabbed 13 rebounds for Cleveland. Collin Sexton added 19 points.\n\nThe Heat record for 3-pointers in a game is 10, a mark held by Mario Chalmers and Brian Shaw. Robinson had three shots in the final moments to get his 10th -- missing them all. He connected on one with about 15 seconds left, but it was waved off by a shot clock violation.\n\nIt was Cleveland's 17th consecutive loss in Miami, a stretch that started during the 2010-11 season -- LeBron James' first with the Heat after leaving the Cavaliers for the first time.\n\nThe Heat record for 3-pointers in a half had been six, held by many and done most recently by Wayne Ellington in the second half against Toronto on April 11, 2018. The record for 3s in a quarter also was six -- Ellington did that twice (the Toronto game in 2018, and against Atlanta in 2017), and Shaw did it first against Milwaukee in 1993.\n\nThose marks belong to Robinson now. He had 24 points by halftime, all on 3-pointers. That was better than his previous career best of 23, set at home earlier this season against Houston.\n\n\"You couldn't be more happy for a guy like Duncan because he puts in so much time,\" Heat coach Erik Spoelstra said.\n\nRobinson's high in three seasons under Beilein at Michigan was 21. His only 30-point effort in college came in 2014 -- for Williams against Amherst in the 2014 NCAA Division III semifinals, before he was given a scholarship by Michigan. His G League high last season was 36 for Sioux Falls.\n\n\"I'm really proud of him,\" Beilein said. \"All of Michigan is proud of him.\"\n\nTIP-INS\n\nCavaliers: Cleveland's 17-game losing streak at Miami has included 74 players and six coaches. The Cavs' last win in Miami was Jan. 25, 2010. ... Cleveland starters Cedi Osman, Darius Garland and Sexton were a combined 2 for 17 for seven points in 43 first-half minutes. They didn't start the second half.\n\nHeat: Miami improved to 10-3, tying the best 13-game start in team history. The 1995-96, 1999-2000, 2012-13 and 2013-14 Heat also were 10-3. ... Bam Adebayo was 4 for 4 in the opening three minutes and finished 5 for 5. ... Spoelstra improved to 533-366 in 899 games as Heat coach. His milestone 900th is Friday in Chicago.\n\nHEAT AT HOME\n\nThe Heat are 6-0 at home, the first time that's happened since 2012-13. The biggest deficit they've faced at home this season is eight points -- every other team in the league has trailed by more at home at least once.\n\nTHOMPSON RESTS\n\nThe Cavaliers gave Tristan Thompson the night off to rest, mindful that they have a back-to-back later this week. It was the first game Thompson has missed this season -- but the third straight Cavaliers at Heat game in which he hasn't played.\n\nUP NEXT\n\nCavaliers: Visit the Dallas Mavericks on Friday.\n\nHeat: Visit the Chicago Bulls on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995551.0604842
}