{
  "game_id": "0021800106",
  "espn_id": "401070787",
  "date": "Oct 31, 2018",
  "matchup": "CHI vs. DEN",
  "headline": "Millsap's putback gives Nuggets 108-107 win over Bulls in OT",
  "body": "CHICAGO --  Paul Millsap knows nobody is perfect in the NBA. The key to being a good team is finding ways to win when not everything is clicking.\n\nThe 13-year veteran believes that's exactly what the Denver Nuggets did Wednesday night.\n\nNikola Jokic had 22 points and 12 rebounds, and Millsap's putback with 0.1 seconds left in overtime gave the Nuggets a 108-107 victory against the Chicago Bulls.\n\nTrailing by a point, Denver inbounded the ball with 3.5 seconds remaining. Jokic missed, but Millsap grabbed the rebound and converted a layup off the glass for the winning basket as the Nuggets improved to 6-1.\n\n\"All games are not going to be pretty,\" Millsap said. \"You're not going to shoot the lights out all the time, but the way that we're winning games is something special, especially with young guys.\n\n\"They're learning how to win without making shots.\"\n\nZach LaVine had 28 points and rookie Wendell Carter Jr. scored a career-high 25 for Chicago.\n\nLaVine has at least 20 points in a career-best nine straight games, a streak that dates back to last season. It was Carter's second consecutive game establishing a new high. He had 18 points Monday against the Golden State Warriors.\n\n\"We have to learn how to win,\" LaVine said. \"We brought it all the way down to the wire, but we fought. It was a bounce back. Still (stinks), though. You play such a good game, you want that result.\"\n\nAfter the Nuggets took a 106-104 lead on a 3-pointer by Jokic -- he had eight of Denver's 10 points in overtime -- Justin Holiday answered with a 3 to put Chicago on top 107-106 with 1:26 to play.\n\nAfter giving up 92 first-half points to Golden State on Monday, the Bulls allowed just 51 in the first two quarters but still trailed by three at halftime.\n\nChicago held a 96-90 edge with three minutes left before Denver went on an 8-2 spurt to tie it at 98 with 1:07 left.\n\n\"I reminded our guys about the opening night in LA,\" Nuggets coach Michael Malone said. \"We were down six or eight and we never panicked. I said, `Tonight, we're not going to panic, either.\"\n\nNeither team could convert multiple opportunities in the final minute, sending the game to overtime.\n\nKEEP SHOOTING\n\nJokic had nine assists to finish one shy of a triple-double, but was having an off shooting night until the final minutes of regulation and overtime. He made his first three shots in OT -- including a pair of 3-pointers -- before the miss Millsap converted.\n\n\"It was unbelievable to see him flip the switch like that, to go from struggling to knocking down 3s in big moments,\" Millsap said. \"He's a special player.\"\n\nREUNION\n\nDenver G Monte Morris played two years under Bulls coach Fred Hoiberg at Iowa State. When Hoiberg made the jump to Chicago in 2016, Morris recalled his former coach told him he'd see him in the NBA. Morris, selected by the Nuggets in the second round (51st overall) of the 2017 draft, was far from a can't-miss prospect.\n\n\"You knew he was going to find a way to make it in this league,\" Hoiberg said. \"He's one of the smartest players, highest IQs, I've ever been around.\"\n\nTIP-INS\n\nNuggets: The team announced Tuesday it picked up next season's option on the rookie-scale contracts of 2016 first-round draft picks Jamal Murray, Juan Hernangomez and Malik Beasley.\n\nBulls: F Lauri Markkanen (sprained right elbow) continues to progress in his rehab and this week added running on the track and upper-body weight training to his routine. \"He's still two to four weeks out,\" Hoiberg said. . G Denzel Valentine (sprained left ankle) is scheduled to have MRI and will be re-evaluated on Thursday. . The team announced Tuesday that next season's option had been picked up on the rookie-scale contracts of Markkanen, Valentine and Kris Dunn.\n\nUP NEXT\n\nNuggets: At the Cleveland Cavaliers on Thursday night.\n\nBulls: Host the Indiana Pacers on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994853.483207
}