{
  "game_id": "0022400225",
  "espn_id": "401704791",
  "date": "Nov 13, 2024",
  "matchup": "MEM @ LAL",
  "headline": "LeBron James has third straight triple-double as Lakers rally for 128-123 victory over Grizzlies",
  "body": "LOS ANGELES -- — LeBron James had 35 points, 14 assists and 12 rebounds for his third straight triple-double and the Los Angeles Lakers rallied to beat the Memphis Grizzlies 128-123 on Wednesday night.\n\n\r\n              Anthony Davis scored 11 of his 21 points in the fourth quarter. He picked up his fifth foul with 3:51 remaining in the third quarter, then came back in with 6:48 left and hit a couple of pivotal baskets, including a 3-pointer with 4:51 remaining to put Los Angeles up for good at 111-108.\n\n\r\n              James was 13 of 22 from the field, hitting 4 of 7 3-pointers.\n\n\r\n              Jaren Jackson Jr. had 29 points for Memphis, which had a three-game winning streak snapped.\n\n\r\n              Rookie Dalton Knecht and Rui Hachimura added 19 points apiece for the Lakers.\n\n\r\n              The Lakers trailed 96-91 at the end of three quarters before starting the quarter with a 10-2 run. The lead would change hands three more times before the 3-pointer by Davis, who also had 14 rebounds.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis had seven players in double figures for the fourth straight game. Marcus Smart returned after missing six games due to ankle injury and had 14 points.\n\n\r\n              Lakers: Los Angeles is 6-0 at home for the first time since the 2010-11 season.\n\n\r\n              Key moment\r\n              Davis reached 18,000 career points with a layup at the 7:51 mark of the first quarter. He is the 80th player in NBA history to reach that milestone as well as the 12th to also have at least 7,000 rebounds and 1,500 blocks since 1973-74.\n\n\r\n              Key stat\r\n              The Lakers made a season-high 20 3-pointers. Knecht made all five of his shots from beyond the arc.\n\n\r\n              Up next\r\n              Both teams have NBA Cup games on Friday night. The Grizzlies are at Golden State. and the Lakers travel to San Antonio.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997756.031154
}