{
  "game_id": "0021801073",
  "espn_id": "401071746",
  "date": "Mar 20, 2019",
  "matchup": "POR vs. DAL",
  "headline": "Lillard scores 33 points, Blazers beat Mavericks 126-118",
  "body": "PORTLAND, Ore. --  Damian Lillard and the Portland Trail Blazers believe they can use games like this one against Dallas to help them prepare for the final push toward the playoffs.\n\n\"It's not about who our opponent is, it's about the style of play that we want to play, the discipline we want to have, the things we want to do well, that will translate to when we play against the top teams,\" Lillard said. \"As long as we have that right attitude and we do things the right way, I think we'll keep getting this result when we play against teams we should beat.\"\n\nLillard had 33 points and 12 assists to lead Portland past the struggling Mavericks 126-118 on Wednesday night.\n\nSeth Curry scored 20 off the bench for the Blazers, who have won five of six as they try to secure home-court advantage in the first round of the playoffs. Portland (44-27) led by as many as 25, and Lillard hit six of the team's 16 3-pointers.\n\nLuka Doncic had 24 points for the Mavericks, who have lost nine of 10 and are ahead of only Phoenix in the Western Conference.\n\nThe Trail Blazers are fourth in the West, a half-game back of Houston and in front of a cluster that includes the Spurs, Thunder, Jazz and Clippers.\n\nPortland rested Lillard in the final period after a 17-point third quarter, which included a stretch when he hit four straight 3-pointers. Enes Kanter added 14 points and 10 rebounds off the bench for his first double-double since joining the Blazers just before the All-Star break.\n\n\"I thought it was another very special night by Damian,\" Blazers coach Terry Stotts said. \"I thought he pretty much controlled the game from our standpoint. He took advantage of his scoring opportunities, had another great night passing, finding people.\"\n\nPortland was coming off a 106-98 victory at home over Indiana on Monday. That was the team's first game without starting guard CJ McCollum, who strained his left knee last weekend. McCollum will be re-evaluated next week, and no timetable has been set for his return.\n\nThe Blazers started Jake Layman for the second straight game in McCollum's place.\n\nLillard had 10 points and four assists as Portland took a 26-17 lead to close the first quarter. It was the lowest first-quarter point total for the Mavs this season.\n\nThe Blazers led by as many as 13 in the first half, but Doncic hit a floater and a pair of free throws to put the Mavericks up 39-38.\n\nThe threat didn't last long and Portland pulled in front 58-52 on Jusuf Nurkic's dunk. Maurice Harkless closed out the half with another dunk to give the Blazers a 65-52 lead at the break.\n\nPortland stretched the lead on 79-66 after Lillard's 3-pointer. Another 3 put the Blazers up 87-69, and Dallas never threatened again.\n\n\"In the third quarter Lillard just had a stretch like great players can have. He hit four 3s in a row and we were just unable to answer,\" Mavericks coach Rick Carlisle said. \"Then the crowd got into it and it just got away.\"\n\nThe Mavs (28-43) have lost eight straight on the road.\n\nDirk Nowitzki, possibly playing his final season, was given a standing ovation in the final quarter when he got up and waved to the Moda Center crowd, which was chanting \"We want Dirk.\" Nowitzki did not play in the final period and finished with three points.\n\n\"I just always remember this being a basketball town. The fans, the way they get behind their team here and get loud when their team makes big runs,\" Nowitzki said. \"It's a tough place and they've always had really great teams year after year.\"\n\nTIP-INS\n\nMavericks: Stotts said he expects Doncic to win the NBA Rookie of the Year award. Carlisle, told of the prediction, joked: \"Boy, he's really putting himself out there.\"\n\nTrail Blazers: It was Lillard's third double-double in his last five games. ... The teams split their four-game season series.\n\nHONORING DIRK\n\nNowitzki passed Wilt Chamberlain for sixth on the NBA's career scoring list in the Mavericks' 129-125 overtime loss to New Orleans on Monday. Stotts was an assistant with the Mavs from 2008-12.\n\n\"It's hard to put into words, especially to people of my generation. Wilt was untouchable. And for someone to be in that context, it's hard to fathom,\" Stotts said. \"I think the way he's done it, being the type of player that he is, he's certainly not the type of player he just passed or the players in front of him. He did it his way, his own style, that I don't think anyone could have foreseen 20 years ago.\"\n\nUP NEXT\n\nMavericks: At the Sacramento Kings on Thursday night.\n\nTrail Blazers: Host the Detroit Pistons on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995159.666451
}