{
  "game_id": "0022300990",
  "espn_id": "401585618",
  "date": "Mar 18, 2024",
  "matchup": "LAL vs. ATL",
  "headline": "LeBron scores 25, D'Angelo Russell ties Lakers 3-pointers record in LA's 136-105 win over Hawks",
  "body": "LOS ANGELES -- — LeBron James had 25 points, 10 assists and seven rebounds, and D'Angelo Russell scored 27 points while tying the Lakers' single-season record for 3-pointers in a 136-105 victory over the Atlanta Hawks on Monday night.\n\n\r\n              Russell's six 3-pointers against the Hawks gave him 183 this season, passing Kobe Bryant's 180 in the 2005-06 season and tying Nick Van Exel's franchise record set in 1994-95. Russell's latest standout shooting display was highlighted by a beautiful 3-pointer at the third-quarter buzzer followed by two more early in the fourth to tie the record before the Lakers emptied their bench.\n\n\r\n              “That's really cool, honestly,” Russell said. “Just to get credit for your game and what you work to do and showcase it every night, and then to get credit for something like this, it's just really cool.”\n\n\r\n              Russell also had 10 assists, while Anthony Davis had 22 points and 15 rebounds as the Lakers snapped a two-game skid with their 13th win in 20 games since losing in Atlanta in late January.\n\n\r\n              Davis left Saturday’s loss to Golden State early with a scratched cornea in his left eye, but the All-Star big man recovered quickly enough from the resulting blurry vision to play a full game against the Hawks. Davis said he chose not to wear goggles.\n\n\r\n              “I've been through that phase in high school,\" said a grinning Davis, who wore prescription glasses and goggles at times while growing up in Chicago before he got corrective eye surgery several years ago. “I'm out of that phase. Obviously (I would have) if the doctors had told me I needed it, but I didn't need it.”\n\n\r\n              Los Angeles, which hasn’t lost three straight games since early January, also moved back up to ninth place in the Western Conference standings with this win and Golden State’s loss to New York. While Russell had another prolific game and Davis looked sharp down low, James produced another outstanding effort, giving him 65 points on 25-of-37 shooting in the past two games.\n\n\r\n              “Bron is Bron, and it's that time of the year,” Davis said. \"He's shooting the ball extremely well. He's been in attack mode, finding guys. He's been locking in defensively.\"\n\n\r\n              Jalen Johnson scored 25 points and Bogdan Bogdanovic had 17 for the Hawks, who have lost four of five overall and three of four on their West Coast road trip.\n\n\r\n              “I thought we were ready to play, (but) there’s two Hall of Fame players that were unselfish, and I thought they played really well,” Atlanta coach Quin Snyder said. “It’s hard to sustain a defensive effort against a team that’s playing the way they are offensively. When the ball isn’t going in, it’s even harder. They made us pay for any mistake we made.”\n\n\r\n              Johnson went down in obvious pain after rolling his ankle while landing with 6:47 to play. Johnson, who only returned two games ago from a sprained ankle, was able to leave the court moments later under his own power. Snyder wasn't sure about the severity of the new injury.\n\n\r\n              Atlanta's Onyeka Okongwu had 11 points and four rebounds while playing 19 minutes in his return from a 13-game injury absence due to a sprained left toe. Okongwu, a Los Angeles-area native who starred at USC, hadn't played since Feb. 12, shortly before the All-Star break.\n\n\r\n              Trae Young missed his 12th straight game following hand surgery. He scored 26 points with six 3-pointers while the Hawks racked up 138 points in their victory over the Lakers in January.\n\n\r\n              Los Angeles gradually pulled away from the Hawks all night, hitting 60% of its shots in the first half while moving the ball smoothly. Russell beat the buzzer with his fourth 3-pointer to boost the Lakers' lead to 111-86 heading to the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At Phoenix on Thursday.\n\n\r\n              Lakers: Host Philadelphia on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764995488.710853
}