{
  "game_id": "0022400056",
  "espn_id": "401703425",
  "date": "Dec 03, 2024",
  "matchup": "MEM @ DAL",
  "headline": "Mavericks rally late to beat Grizzlies 121-116 and advance to NBA Cup quarterfinals",
  "body": "DALLAS -- — Luka Doncic had 37 points and 12 rebounds, Spencer Dinwiddie and P.J. Washington Jr. hit clutch 3-pointers in the final two minutes, and the Dallas Mavericks overcame a 15-point deficit to beat the Memphis Grizzlies 121-116 on Tuesday night and advance to the NBA Cup quarterfinals.\n\n\r\n              The Mavericks needed a win and help on the final night of group play to earn the West wild-card spot. They will face the top-seeded Oklahoma City Thunder. \n\n\r\n              Dallas trailed 111-103 with 3:34 to play and went on a 16-3 run capped by two 3-pointers from Dinwiddie and one from Washington.\n\n\r\n              Washington scored 18 points, Dereck Lively II had 17 points and 11 rebounds, and Dinwiddie scored 16 for the Mavericks, who have won a season-high five consecutive games and nine of their last 10.\n\n\r\n              Ja Morant scored a season-high 31 points, 15 in the fourth period, for the Grizzlies. They had a season-high, six-game winning streak snapped and were eliminated from the Cup race.\n\n\r\n              Desmond Bane added 19 points while Jaren Jackson Jr. scored 14 of his 16 in the first half.\n\n\r\n              After Dallas took a 60-57 lead into the second half, the Grizzlies dominated the third period 38-22. The Mavericks answered back in the fourth, 39-21.\n\n\r\n              Takeaways\r\n              Grizzlies: Morant didn’t take a shot until 10:07 was left in the first half and finished the half with five points.\n\n\r\n              Mavericks: They committed a season-high 25 turnovers but were only outscored on turnover points 27-26 because Memphis committed 19.\n\n\r\n              Key moment\r\n              The first of Dinwiddie’s back-to-back 3s, pulling up on a fast break, put Dallas ahead for good 113-111 with 1:40 left.\n\n\r\n              Key stat\r\n              Dallas shot a season-high 44 free throws (making 30) to Memphis' 14 (making 13). In the fourth quarter, the Mavericks were 18 of 26 from the line while the Grizzlies were 3 of 3.\n\n\r\n              Up next \r\n              The Grizzlies will host the Sacramento Kings on Thursday. The Mavericks will begin a two-game Eastern Conference road trip on Thursday against the Washington Wizards.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997743.138266
}