{
  "game_id": "0021501024",
  "espn_id": "400828911",
  "date": "Mar 18, 2016",
  "matchup": "HOU vs. MIN",
  "headline": "Harden leads Rockets past Timberwolves, 116-111",
  "body": "HOUSTON --  After an emotional players-only meeting, Houston Rockets point guard Patrick Beverley said he felt sorry for the next opponent.\n\nBeverley didn't seem to show any sympathy for the Minnesota Timberwolves on Friday night as the refocused Rockets avenged an ugly loss with a 116-111 victory.\n\nJames Harden had 29 points and 14 assists, and Beverley added a season-high 18 points and career-high 10 assists.\n\n\"He's the fire starter,\" Rockets coach J.B. Bickerstaff said of Beverley. \"The guys feed off of his energy, and they feed off of his fight.\"\n\nAfter allowing a season-high 72 points in the first half of a 122-106 blowout at the hands of the Clippers, the Rockets held Minnesota to 52 first-half points, including just 23 in the first quarter. Houston ranks among the league's worst in first-quarter points allowed.\n\nHouston has won 10 of its last 11 games against Minnesota, including seven straight at home.\n\nKarl-Anthony Towns led Minnesota with 32 points and 11 rebounds. Andrew Wiggins had 21 points and Shabazz Muhammad scored 12 off the bench.\n\nIn their season full of turmoil that included the early firing of coach Kevin McHale, the Rockets have held multiple players-only meetings. The latest came Thursday and  hey regained their defensive focus and rediscovered their offensive chemistry against the Wolves. The Rockets had two players with 10 or more assists in the same game for the first time since 2012.\n\nFor Houston, Donatas Motiejunas scored 17, Trevor Ariza added 15, and Dwight Howard had 10 points and 11 rebounds. Michael Beasley scored 17 points off the bench and has quickly become Houston's second-leading scorer (15.4 ppg) over the last five games.\n\nThe Rockets held a two-point lead at the half, thanks to Beverley's 4-of-6 shooting from 3-point range.\n\nAfter missing his first two 3-point attempts of the second half, Beverley made one from the corner, just in front of Minnesota veteran Kevin Garnett, who has been sidelined for nearly two months by a sore knee. After gesturing, Beverley stared at Garnett as he ran down the court.\n\n\"He's my idol,\" Beverley said. \"Growing up, I wore No. 21 in high school, and they called me KG. This is really my first game playing when he was out there, so I was just ecstatic to see him.\"\n\nIn the third quarter. Howard had a thunderous dunk that rallied the crowd, and it was followed by a Minnesota turnover that led to Ariza's dunk in transition after a behind-the-back pass from Harden. The Rockets took a nine-point lead after those dunks and entered the fourth quarter up 10.\n\nHouston shot a season-high 56.5 percent from the floor and improved to 18-8 when scoring 110 or more points.\n\n\"After a long road trip, I just thought we kind of ran out of gas,\" Timberwolves coach Sam Mitchell said. \"Houston made some tough shots.\"\n\nTIP-INS\n\nTimberwolves: Gorgui Dieng had 13 points, nine rebounds and five assists. . Minnesota ended its four-game road trip in Oklahoma City, Phoenix, Memphis and Houston with a 2-2 record before hosting Golden State and Sacramento on Monday and Wednesday.\n\nRockets: Houston improved to 21-5 when outrebounding opponents this season. The Rockets led the Timberwolves 42-35 on the boards, including 13 on the offensive end. . Veteran PG Jason Terry missed five of six shot attempts, including all three 3-pointers attempted.\n\nMEETING THE DREAM\n\nAfter the game, several Timberwolves players were greeted by Houston Rockets Hall of Famer Hakeem Olajuwon, who attended the game and sat courtside at midcourt. A few of the young Timberwolves, including Zach LaVine and Karl-Anthony Towns even took pictures with Olajuwon.\n\n\"Even after a loss, you have to take advantage of meeting a legend like that,\" LaVine said. \"The career he had -- he was such an honor to even be around.\"\n\nGREEN LIGHT\n\nDespite LaVine's recent streak of hot shooting, Minnesota coach Sam Mitchell said before the game that he's not exactly ready to give LaVine the freedom of shooting at will. LaVine tied a career high with six 3-pointers in a win over Memphis on Wednesday. \"I don't think anybody in the history of the league has had the green light,\" Mitchell said. \"We want guys to take good shots. If that were the case, we'd let them put shots up at half court.\"\n\nLaVine was three of five from beyond the arc on Friday night but made just six of 15 shots for 15 points.\n\nSMITH'S STATUS\n\nFormer Rocket and current Minnesota forward Greg Smith played seven minutes and had two rebounds as he continues to audition for an extended contract. Smith was signed to a second 10-day contract with the Timberwolves on Saturday.\n\nUP NEXT\n\nTimberwolves: Host Golden State on Monday.\n\nRockets: Visit Atlanta on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994608.015307
}