{
  "game_id": "0021800734",
  "espn_id": "401071407",
  "date": "Jan 26, 2019",
  "matchup": "POR vs. ATL",
  "headline": "McCollum has triple-double, Trail Blazers beat Hawks 120-111",
  "body": "PORTLAND, Ore. --  With the Trail Blazers playing without All-Star guard Damian Lillard, CJ McCollum reminded everybody just how good Portland's other guard are.\n\nMcCollum had 28 points, 10 assists and 10 rebounds for his first career triple-double, leading the Trail Blazers to a 120-111 win over the Atlanta Hawks on Saturday night.\n\n\"CJ was terrific, maybe his best all-around game of the year,\" Trail Blazers coach Terry Stotts said.\n\nSeth Curry, who got the start in Lillard's place, scored 22 points. Maurice Harkless also had a season-high 16 points to go with five rebounds.\n\n\"Without (Lillard) out there I was just talking a little bit more, initiate the offense and tried to keep everybody involved,\" McCollum said.\n\nTrae Young had 30 points and eight assists to lead the Hawks.\n\nMcCollum had 10 points and three assists in the third quarter to give Portland a three-point lead heading to the fourth. Atlanta pulled to 101-100 with 7:17 remaining, but Curry scored 11 points during the Trail Blazers' 13-0 game-closing run.\n\n\"I was trying to get (Curry) some shots, he's a very great shooter, a guy who can read on-ball and off-ball screens,\" McCollum said. \"I tried to take advantage of their defensive lapses, they were paying a lot of attention to me. I was trying to be aggressive and mix in making plays.\"\n\n\"When they hit 3s, you feel it,\" Atlanta coach Lloyd Pierce said of the Blazers' final run. \"And Curry did that late in the game with three 3s. And we hit a stretch where we couldn't get anything to go down.\"\n\nStotts thought Curry's night, in particular, was special for him.\n\n\"It's been tough for him, coming off the bench and playing behind Dame and CJ and coming into a new team,\" Stotts said. \"All that -- it's been a rough transition, but I think he showed tonight what he's capable of. He stepped up, I mean we needed a performance like that from him tonight.\"\n\nAfter Atlanta jumped out to a 11-7 lead, the Blazers outscored the Hawks 33-19 to build a 10-point lead after the first quarter.\n\nThe Hawks quickly cut the Blazers lead to three in the early moments of the second quarter. Dwayne Dedmon's dunk with the 7:39 left in the quarter gave Atlanta a one-point lead and the Hawks led by as many as six.\n\nAtlanta held a one-point lead at halftime with Collins and rookie Trae Young leading the way.\n\nMcCollum got off to an early start on a big night, with 14 points, eight rebounds and five assists in the first half.\n\n\"CJ scores the ball, great passing, going after it on the boards,\" Young said about McCollum. \"CJ does what CJ does -- everything.\"\n\nBlazers sixth man Evan Turner was forced from the game at halftime with a sore left Achilles.\n\nTIP-INS\n\nHawks: John Collins has made a big jump from his rookie year in scoring, averaging 19.5 points per game, which is nearly double his average from last season. But another area in which he's improved has been on the offensive rebounding. Collins began the day averaging 3.8 offensive rebounds per game, a full rebound more than last year. In terms of percentage, Collins has improved by two percentage points and he's just outside of the top-10 in that category.\n\nHawks coach Lloyd Pierce commended him for his willingness to embrace the mentality of dominating mismatches.\n\n\"And it's easy to get frustrated when we don't find him when there is a guard defending him. The effort part that he's shown over the last month or two months. When there's a guard on him, we want to find him but if we don't, go to work. Because now you a small down there. He's completely bought into it. I said it a while back, it's like a new toy for him.\"\n\nTrail Blazers: Lillard had been dealing with nagging injuries over the last few weeks. With the Blazers just returning home after a three-game road trip, the team elected to rest Lillard who has been listed with a bruised right hand and a sore right knee.\n\n\"There's nothing serious,\" Blazers coach Terry Stotts said. \"He almost didn't play against Phoenix so I think it's just, he needs a day.\"\n\nLillard was one of only four Blazers who had played in each of the first 50 games this season. The choice to rest Lillard comes at a brief break in the Blazers schedule. After Saturday, the Blazers only have one game in the span of nine days.\n\nUP NEXT\n\nHawks: At Los Angeles Clippers on Monday night.\n\nTrail Blazers: Host Utah on Wednesday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995171.419449
}