{
  "game_id": "0021500149",
  "espn_id": "400828036",
  "date": "Nov 15, 2015",
  "matchup": "OKC vs. BOS",
  "headline": "Marcus Smart stars at OKC; Russell Westbrook: 'Don't get it twisted'",
  "body": "OKLAHOMA CITY -- Marcus Smart got the best of Russell Westbrook, and afterward, Westbrook was already looking for a rematch.\nSmart scored a career-high 26 points to help the Boston Celtics beat the Oklahoma City Thunder 100-85 on Sunday night. He also was the centerpiece of a collective effort that held Westbrook, the reigning scoring champion, to 5-for-20 shooting.\nWestbrook still scored 27 points while carrying a larger load than usual because Kevin Durant was out with a left hamstring strain. He became annoyed when asked about Smart after the game.\n\n\"He had a good game,\" he said. \"Eighty-two games, I do this. Don't get it twisted. Don't get it twisted. He had a good game. ... We'll see him again.\"\nSmart, who played college ball at nearby Oklahoma State, acknowledged the intensity of the matchup, which was littered with hard fouls, trash talking and spills to the floor.\n\"That's the type of guy that Russ is,\" Smart said. \"He loves challenges. He's going to try to do his best every time, and vice versa with me. You put two guys like that going against each other, [and] obviously, we're going to knock heads.\"\nSmart's previous career high was 25 points, also against Oklahoma City.\n\"I think that he likes this gym,\" Celtics coach Brad Stevens said.\nIsaiah Thomas scored 20 points, Avery Bradley had 14, and Jared Sullinger added eight points and 15 rebounds to help the Celtics win their third in four games. Boston shot 48 percent and outrebounded the Thunder 47-34.\nSerge Ibaka scored 16 points, and the Thunder had a season-low point total and their worst shooting performance.\nWestbrook had posted triple-doubles in his previous two games, but he finished this one with just five assists and four rebounds.\nOklahoma City's three-game win streak was snapped.\nThe Thunder led at halftime 52-45 behind 17 points from Westbrook. They pushed the lead to 11 early in the third quarter, but the Celtics rallied and trimmed their deficit to 74-72 by the end of the period. Boston finally took the lead early in the fourth quarter on a 3-pointer by Thomas. Back-to-back 3s by Thomas and Bradley pushed Boston's lead to nine, and a layup by Thomas bumped it to double digits for the first time. The Celtics never lost control from there.\nDURANT HEALING\nDurant missed most of the previous season with a broken bone in his right foot, but he averaged 28.1 points in eight games before missing the past two games with the hamstring injury.\n\"It's definitely frustrating,\" he said. \"I want to play. I felt like I was in a good groove before, but yeah, it's a part of the game. I've got to keep working to get back. I'm working my tail off every day to get back, and my teammates have been holding it down.\"\nSTAT LINES\nOklahoma City made six of 25 3-pointers.\nSTREAK OVER\nWestbrook had at least 10 assists in six straight games before Sunday's loss.\nQUOTABLE\nSullinger on Smart's performance: \"He played a special game. I think Oklahoma has a special place in his heart. There's something about Oklahoma that gives him an extra pep in his step. He was knocking down everything.\"\nTIP-INS\nCeltics: Smart got a technical with 1:47 left in the second quarter. ... Stevens coached at Butler before heading to the NBA to coach the Celtics. He said he was impressed by Butler's 144-71 win over The Citadel on Saturday. ... Boston made just 13 of 20 free throws. ... Kelly Olynyk fouled out with seven points.\nThunder: G Anthony Morrow got his second straight start in Durant's place. He went scoreless in 14:56. ... Kyle Singler had scored 18 points over his first eight games this season but had eight Sunday. ... There was a marriage proposal during the Kiss Cam in the third quarter. ... Westbrook and Dion Waiters were issued technicals in the second half.\nUP NEXT\nCeltics play at Houston on Monday night.\nThunder play at Memphis on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994217.525963
}