{
  "game_id": "401809977",
  "espn_id": "401809977",
  "date": "Oct 27, 2025",
  "matchup": "LAL vs POR",
  "headline": "Trail Blazers beat Lakers 122-108 despite Reaves' 41 points",
  "body": "LOS ANGELES -- — Deni Avdija scored 25, Jrue Holiday had 24 points and six assists, and the Portland Trail Blazers pulled away from the short-handed Los Angeles Lakers 122-108 on Monday night.\n\n\r\n              Jerami Grant added 22 off the bench for the Blazers, who picked up their first road win of the season in the second game of a back-to-back after losing 114-107 at the Clippers on Sunday. Shaedon Sharpe and and Donovan Clingan chipped in with 16 apiece. \n\n\r\n              Austin Reaves scored 41 points to follow up his career-high 51 in a 127-120 win at the Sacramento Kings on Sunday, but the rest of the depleted Lakers struggled to generate offense around him. Rui Hachimura and Deandre Ayton each had 16, and Jarred Vanderbilt scored 14. \n\n\r\n              Already missing two of their best players in Luka Doncic (sprained finger/leg bruise) and LeBron James (sciatica), the Lakers didn’t have guards Marcus Smart (quadriceps contusion) and Gabe Vincent (sprained left ankle), leaving Reaves as the only experienced natural ball handler. Los Angeles had seven players unavailable in total.\n\n\r\n              Portland’s aggressive defense took advantage by forcing 25 turnovers, and the relentless pressure allowed the Blazers to pull away in the second half. \n\n\r\n              Los Angeles magnified its ball security struggles with a poor showing from 3-point range, making 7 of 27 (25.9%). Avdija nearly matched that total himself, going 5 of 8 from long range, and Holiday (4 of 7) and Grant (3 of 7) weren’t far off the pace.\n\n\r\n              Up next\r\n              Trail Blazers: Wrap up a three-game road trip against the Jazz in Salt Lake City on Wednesday.\n\n\r\n              Lakers: Visit the Timberwolves in Minneapolis on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042516.7412028
}