{
  "game_id": "0021900696",
  "espn_id": "401161338",
  "date": "Jan 27, 2020",
  "matchup": "SAC @ MIN",
  "headline": "Hield rallies Kings to 133-129 OT win over Timberwolves",
  "body": "MINNEAPOLIS --  On a night full of tributes to Kobe Bryant, Buddy Hield's stole the show.\n\nChanneling the memories of his childhood hero, Hield poured in a career-high 42 points to rally the Sacramento Kings from a 27-point deficit to a 133-129 overtime victory over the Minnesota Timberwolves on Monday night.\n\n\"That's the reason I wanted to play in the NBA because of Kobe,\" Hield said. \"I feel that he was with me. He never gives up. That's always his mentality. Never give up. No matter what the stakes was, he was always pushing, always pressing. He's making sure guys feel him. That's what I did tonight.\"\n\nDe'Aaron Fox scored 22 for the Kings, putting back the rebound of his intentionally missed free throw as part of a 33-11 run over the final 5:42 of regulation. Sacramento trailed by 17 with 2:49 left. According to ESPN Stats and Info, entering Monday, NBA teams were 0-8,378 since 1996-97 when trailing by 17 or more in the final 3 minutes of the fourth quarter or overtime.\n\n\"No matter what, we should be able to play with a 15-point lead with a couple minutes left,\" Timberwolves coach Ryan Saunders said. \"They made shots. We didn't execute our defensive game plan. We didn't get rebounds when we needed to. We didn't make the needed plays.\"\n\nSacramento ended a five-game road trip with its second consecutive victory. Fox scored 17 points in the second half and overtime. Nemanja Bjelica finished with 20 points.\n\n\"We've been on the road for 10 days, and it's been an emotional last couple days,\" said Kings coach Luke Walton, a teammate of Bryant's for nine seasons with the Los Angeles Lakers.\n\n\"We'll take it. What I love about this group is what they've shown all year, which is they don't ever stop fighting.\"\n\nAndrew Wiggins had 36 points, nine rebounds and eight assists for the Timberwolves, who lost their 10th consecutive game.\n\nWith the Kings down three with 4.7 seconds left in regulation, Fox made his first free throw. He intentionally fired the second off the front of the rim, grabbed his own rebound and laid it in to tie the game with 3.6 seconds left.\n\nThat was after Hield shot the Kings back into the game. Hield grew up in the Bahamas idolizing Bryant, who died Sunday in a helicopter crash. He wears No. 24 in Bryant's honor. After Monday's game, he fondly recalled his first meeting with Bryant while playing in the Elite Eight with Oklahoma.\n\nMonday he scored 18 points in the final 4:36 of regulation. His 42 points came on 24 shots. He was 9 for 14 from 3-point range. Hield is the third player ever to score 40 or more points and make nine or more 3-pointers off the bench. He joins J.R. Smith and Rodrigue Beaubois.\n\n\"I can't wait until I have a son and tell my son about this game,\" Hield said. \"Tell my son about Kobe Bryant. I want to show him his highlights, but I'm going to show him that this was the guy that inspired me. This was the guy who inspired the world.\"\n\nThe Timberwolves built their lead thanks to a franchise-record 23 3-pointers. Wiggins was 7 for 11 beyond the arc.\n\nRobert Covington had 24 points and Karl-Anthony Towns added 23 for Minnesota. It was the first time three Timberwolves have scored 20 or more points in a game since Dec. 13.\n\nThe final result was not the tribute to Bryant that Minnesota had in mind.\n\n\"I mean the loss of Kobe is something that we all think of,\" Timberwolves guard Shabazz Napier said. \"But the competitor he is, he would be upset with us, truly upset with us, and I think once you step on them lines all you're thinking about is playing the game at the highest level. Today we did a dishonest to him, to the Minnesota Timberwolves organization, to the fans.\"\n\nTIP-INS\n\nKings: Forward Marvin Bagley III missed his third consecutive game with left foot soreness. ... Forward Richaun Holmes was out for the seventh straight game with right shoulder soreness. ... The Kings snapped a three-game losing streak against the Timberwolves.\n\nTimberwolves: Guard Allen Crabbe did not play after suffering a left knee subluxation Saturday against Oklahoma City. ... Forward Jake Layman missed his 33rd consecutive game with a left toe sprain. Minnesota's eight first-quarter 3-pointers tied a franchise record for 3s in a quarter. Minnesota hit 10 of its first 15 3-point attempts and shot 14 for 23 from 3 in the first half. That set a franchise record for 3s in a half.\n\nHONORING KOBE\n\nThe Timberwolves honored Bryant prior to tipoff with words from Towns, a video tribute and a moment of silence. Towns wore No. 24 and Covington wore No. 8 while being introduced as part of the starting lineup to honor Bryant. They donned their regular Nos. 32 and 33 before the opening tip.\n\nTo open the game, Minnesota took an 8-second backcourt violation and Sacramento took a 24-second shot-clock violation on the ensuing possession. While taking the 8-second violation, Wiggins placed the ball on the free throw line where Bryant scored to pass Michael Jordan for third place on the career scoring list on Dec. 14, 2014, at Target Center.\n\nUP NEXT\n\nKings: Host Oklahoma City on Wednesday, their first home game since Jan. 15.\n\nTimberwolves: At Los Angeles Clippers on Saturday to begin a two-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764996397.805808
}