{
  "game_id": "0021600300",
  "espn_id": "400899742",
  "date": "Dec 04, 2016",
  "matchup": "ORL @ DET",
  "headline": "Ibaka lifts Magic over Jackson and Pistons 98-92",
  "body": "AUBURN HILLS, Mich. --  For about ten minutes on Sunday night, it appeared the Detroit Pistons had solved the Orlando Magic's lock-down defense.\n\nLike the rest of the NBA, they will have to keep searching for answers.\n\nOrlando gave up 27 points in the first 9:30 but then shut the Pistons down in a 98-92 victory.\n\n\"I'm proud of our guys, because that team was averaging 118 points their last three games, and that was on the road,\" Orlando coach Frank Vogel said. \"We held them to 92, and most of that was our second-half defense. They were at home, and they got 42 points on 37 percent shooting in the second half.\"\n\nSerge Ibaka scored 21 points and blocked four shots, while Nikola Vucevic added 16 points and eight rebounds.\n\nThe Magic have held 10 of their last 11 opponents under 100 points.\n\n\"We just changed our mindset,\" Ibaka said. \"We knew we could play defense, and now we're playing for each other on offense. We knew we could play this well. We just had to keep working.\"\n\nPistons guard Reggie Jackson made his season debut after missing Detroit's first 21 games with knee tendinitis. He had 18 points in 23 minutes. Marcus Morris led Detroit with 21 points.\n\n\"I felt good out there, but I wish we could have gotten a win out of it,\" Jackson said. \"I think there might have been a little rust, but I was able to do everything I need to do. I wouldn't be out there if I was going to be physically limited.\"\n\nOrlando won for the third time in four games while Detroit had its three-game winning streak snapped.\n\n\"We were terrible on defense,\" Pistons coach Stan Van Gundy said. \"Our offensive numbers were good enough to win, especially against that defense, but we didn't guard anyone. We just didn't want to put in the effort.\"\n\nOn Jackson's first possession, the Pistons went to their bread-and-butter play -- he and Andre Drummond running a high pick and roll. Jackson came off the screen and hit a 3-pointer, bringing a cheer from the small crowd. Jackson played the first 5:50 of the quarter as Detroit built a 16-10 lead.\n\nMorris had 14 points in the first 7 minutes but didn't get much support from his teammates. The Magic scored 35 points in the second quarter to take a 58-50 halftime lead. Orlando shot 62.5 percent from the floor in the half to Detroit's 51.2 percent and only turned the ball over four times.\n\n\"We're starting to see the value of the pass on the offensive end,\" Vogel said. \"If we pass with good timing, good intent and good delivery, it will help us shoot the ball, and we've got good shooters.\"\n\nThe Magic led by 11 late in the third, but the Pistons narrowed the gap to 78-73 at quarter's end. Orlando moved the margin back to double figures with nine minutes left, with the Pistons struggling to get open looks against one of the NBA's best defenses.\n\nIbaka ended a Pistons run with a 3-pointer to make it 90-80 with 5:32 to play, then blocked Drummond's dunk attempt at the other end.\n\nKentavious Caldwell-Pope hit a 3-pointer with 40 seconds left to pull the Pistons within 95-90, but Jeff Green clinched the game with a turnaround jumper.\n\nTIP INS\n\nMagic: Former Piston Jodie Meeks had seven points in 15 minutes in his second game of the season. Meeks only played three games last season for Detroit due to chronic foot problems.\n\nPistons: Jackson spent most of the game matched up against D.J. Augustin, the main player given up by the Pistons in the three-team trade that brought him to Detroit in 2015.\n\nTROUBLE FROM THE LINE\n\nThe Pistons were 0 for 5 from the free-throw line in the first half, with Drummond missing four in a row. He came into the game shooting 47.4 percent from the line after setting a league record at 35.5 percent in 2015-16.\n\nRARE STREAK\n\nThe Magic have won two straight road games for the first time this season. They beat the Philadelphia 76ers 105-88 on Friday.\n\nONLY A SINGLE-DOUBLE\n\nVucevic fell two rebounds short of his seventh straight double-double. He had a nine-game double-double streak in 2012-13.\n\nUP NEXT\n\nMagic: Visit the Washington Wizards on Tuesday night.\n\nPistons: Host the Chicago Bulls on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764995870.9348218
}