{
  "game_id": "0021600120",
  "espn_id": "400899570",
  "date": "Nov 10, 2016",
  "matchup": "LAL @ SAC",
  "headline": "Young scores 21 as Lakers rally past Kings, 101-91",
  "body": "SACRAMENTO, Calif. --  Lou Williams assumed the closer role that Kobe Bryant for so long relished against the Sacramento Kings.\n\nWilliams scored 13 of his 21 points in the fourth quarter to help the Los Angeles Lakers rally for a 101-91 victory over the Kings on Thursday night.\n\nWilliams continually hurt the Kings in the fourth quarter, going 4 of 8 from the field and 4 of 5 on free throws to help the Lakers rebound from a poor first half in which they trailed by as many as 19 points.\n\n\"He is one of those players who keeps getting better as the game progresses,\" Lakers coach Luke Walton said. \"He's been doing this his whole career, making big shots.\"\n\nThe Lakers took control by breaking away from a tie game with 10 straight points, the final five by Nick Young, to go ahead 92-82 with 3:36 left. Los Angeles has four wins in a five-game stretch for the first time since November 2013.\n\n\"It's a little like your kids, you love all your victories,\" Walton said when asked if this was the Lakers' best win of the season. \"It was nice to fight like that and get a win on the road.\"\n\nAnother veteran with big-shot capabilities, Young made four 3-pointers and scored 16 points. He had 13 points in the second half, when the Lakers outscored the Kings 56-36.\n\n\"We really were able to pick it up in the second half when we played much more aggressive,\" Young said. \"Starting a (three-game) road trip and winning the first one is great.\"\n\nDeMarcus Cousins had 28 points and nine rebounds, Rudy Gay had 15 points and eight rebounds, and Ty Lawson had 11 points for the Kings, who had their modest two-game win streak snapped. Sacramento had won the last seven meetings with the Lakers.\n\n\"I think our defense broke down towards the end. We let them get a lot of shots that they can hit and that gave them confidence,\" Cousins said. \"We should have buried them in the second half. But we gave them confidence and some momentum in this game for them to finish it out the way they did.\"\n\nD'Angelo Russell scored 17 points and Julius Randle had 15 points and eight rebounds for the Lakers. Timofey Mozgov added 10 points.\n\nWith the Lakers trying to hold on, Williams drove the lane and was fouled while making an off-balance shot. He converted the free throw for a three-point play and a 97-88 lead.\n\nThe Kings led by double digits in the first half but their offense grew stagnant in the third quarter and continued halfway through the fourth, when they were outscored 28-21.\n\nBoth Young and Russell had eight points in the third quarter, when the Lakers outscored the Kings 23-18 and pulled within 73-70 heading into the fourth.\n\nTIP-INS\n\nLakers: The Lakers opened the game making their first five shots, then missed 12 of 14 the remainder of the quarter and trailed 30-16. ... Larry Nance Jr. entered the game in the first quarter. He missed Tuesday's game against Dallas due to concussion symptoms. .. Los Angeles committed 21 turnovers that led to 27 points.\n\nKings: Lawson made his first field-goal attempt. In the previous three games Lawson had missed 15 straight shots and scored six points in 77 minutes. ... Cousins made two 3-pointers in the game's opening four minutes. He entered the game 5 of 22. ... Playing in his second game following an eight-game suspension, Lawson missed nine of 11 shots and had six points.\n\nBENCH BUNCH\n\nWilliams was the key contributor in the Lakers' 41-24 advantage in bench points.\n\nBoth Jordan Clarkson and Tarik Black had seven points in a reserve role. Nance played 22 minutes and had only two points, but he secured seven rebounds and had two steals.\n\n\"He (Williams) is one of the players that can get off at any minute,\" Gay said. \"I honestly think that he's underrated. He's a guy who can get buckets and also he knows how to facilitate.\"\n\nUP NEXT\n\nLakers: Play at New Orleans on Saturday. The Pelicans got their first win of the season Thursday at Milwaukee.\n\nKings: In Portland on Friday night, facing a tough back-to-back.",
  "source": "espn_api",
  "crawled_at": 1764995446.3117719
}