{
  "game_id": "0022300059",
  "espn_id": "401584147",
  "date": "Nov 28, 2023",
  "matchup": "HOU @ DAL",
  "headline": "Doncic scores 41, Mavericks prevent Rockets from advancing with a 121-115 victory",
  "body": "DALLAS -- — Luka Doncic had 41 points, nine rebounds and nine assists, and the Dallas Mavericks prevented the Houston Rockets from advancing to the quarterfinals of the NBA In-Season Tournament with a 121-115 victory on Tuesday night.\n\n\r\n              Kyrie Irving added 22 of his 27 points in the second half for the Mavericks, who had already been eliminated. Their victory allowed the New Orleans Pelicans to win Group B in the Western Conference with a 3-1 record.\n\n\r\n              Doncic fell just short of his 59th career triple-double. That would have tied him for ninth place all-time with Larry Bird. He shot 15 of 29, 3 of 10 on 3-pointers.\n\n\r\n              “Sometimes we take him for granted, and we shouldn’t,” Mavericks coach Jason Kidd said. “He’s about winning, but it just so happens he’s a walking triple-double.”\n\n\r\n              The Mavericks, who trailed by nine points in the third quarter, grabbed the lead for good at 99-98 with 6:25 to play on a drive by Irving. Leading 103-100 with 5:25 left, they went on an 8-2 run that included three free throws by Derrick Jones Jr. when he was fouled by Dillon Brooks on a 25-footer with the shot clock about to expire.\n\n\r\n              Jabari Smith Jr.’s 3-pointer with 8 seconds left pulled the Rockets within 119-115 before Dallas closed it out. \n\n\r\n              Doncic played after sustaining a low-grade sprain of his left thumb on his non-shooting hand early in Saturday’s game. He wore a wrap on the thumb.\n\n\r\n              Doncic made a hook shot from the free throw line after recovering a loose ball near the baseline.\n\n\r\n              “I’m 2 for 2 in my career on the hooks,” Doncic said, saying the other came while playing for the Slovenian national team against Sweden.\n\n\r\n              Irving shot 2 for 11 in the first half, 1 for 5 on 3-pointers, with no free-throw attempts. He was 6 for 11 in the second half, hitting 1 of 2 behind the arc, and sank all nine free throws.\n\n\r\n              “I told the team, ‘Played well enough to win, not smart enough to win,’” Rockets coach Ime Udoka said. “We were extra-aggressive, especially at the end of the third quarter. Had multiple players make a few dumb fouls, put Kyrie at the line and got him going when he didn’t have a lot going. You can be aggressive, obviously, but slapping somebody on a 3-point shot on the arm is an unintelligent play. It has nothing to do with aggression.”\n\n\r\n              Alperen Sengun had a season-best 31 points for the Rockets, who had six scorers in double figures. Fred VanVleet had 10 points and 12 assists.\n\n\r\n              The Rockets have lost all six of their road games this season. They went into play leading the NBA by allowing an average of 104.4 points per game.\n\n\r\n              The Mavericks didn’t use the specially built court for either of their home tournament games, citing dissatisfaction with the quality.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Will finish a back-to-back at Denver on Wednesday.\n\n\r\n              Mavericks: Host Memphis on Friday.\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995631.933527
}