{
  "game_id": "0021800313",
  "espn_id": "401070994",
  "date": "Nov 28, 2018",
  "matchup": "OKC vs. CLE",
  "headline": "Russell Westbrook posts 107th triple-double, tying Jason Kidd",
  "body": "OKLAHOMA CITY -- Russell Westbrook moved into a tie for third place on the NBA list for triple-doubles with 23 points, 19 rebounds and 15 assists, and the Oklahoma City Thunder completed a regular-season sweep of the short-handed Cleveland Cavaliers with a 100-83 victory Wednesday night.\nWestbrook's triple-double was his third this season -- all in the past four games -- and the 107th of his career, matching Jason Kidd and trailing only Oscar Robertson (181) and Magic Johnson (138). Kidd took 1,247 games to reach 107, while Westbrook needed only 760.\nThe 19 rebounds were one off Westbrook's career high, set in last season's finale against Memphis.\nJerami Grant added 21 points, one shy of his career best, on 8-of-12 shooting for the Thunder, who have won 13 of 16 after an 0-4 start.\nJordan Clarkson led Cleveland with 25 points, while Collin Sexton (21 points, 10 rebounds) and Cedi Osman (14 points, 10 rebounds) each had a double-double. The Cavaliers agreed to trade Kyle Korver to the Utah Jazz after the team arrived at Chesapeake Energy Arena, leaving them with only nine players in uniform. Eight of them got into the game.\nOklahoma City trailed 55-51 in the third quarter when Westbrook started a 13-0 run with a 3-pointer. He capped it by assisting on a dunk by Grant with 5:36 left in the period that completed the triple-double and put the Thunder up 64-55.\nBy the end of the quarter, the Thunder led 73-62, and the Cavaliers got no closer than nine the rest of the way.\nCleveland took advantage of early offensive sloppiness by the Thunder to twice go up by 11 points, the latter time at 38-27 after a 3-pointer by Osman with 7:01 left in the second quarter. Oklahoma City used a 20-6 run to get back in the game, which was tied 47-all at halftime.\nTIP-INS\nCavaliers: Asked before the game about the trade set to send Korver to Utah, coach Larry Drew declined comment. Korver was at the arena when he learned of the deal, which still needed to be approved by the NBA. ... Sam Dekker (left ankle sprain) missed his 10th straight game, and George Hill (right shoulder sprain) sat out his ninth in a row. ... David Nwaba missed his second consecutive game with right knee soreness and was replaced in the starting lineup by Larry Nance Jr. ... Tristan Thompson's streak of four straight double-doubles ended. He had four points and two rebounds.\nThunder: Alex Abrines made his first start of the season but went 1-of-9 from the field. ... Nerlens Noel played despite a bruised calf and scored eight points. ... Paul George struggled with foul trouble most of the game but had 18 points. ... The Thunder drew their 353rd straight sellout, the NBA's third-longest active streak and tied with Sacramento for the 10th-longest in league history. ... Oklahoma City won 95-86 at Cleveland on Nov. 7.\nUP NEXT\nCavaliers: Complete a two-game road swing Friday at Boston.\nThunder: Wrap up a four-game homestand Friday against Atlanta.",
  "source": "espn_api",
  "crawled_at": 1764994620.4663382
}