{
  "game_id": "0022401035",
  "espn_id": "401705601",
  "date": "Mar 23, 2025",
  "matchup": "HOU vs. DEN",
  "headline": "Jamal Murray scores 39 points to lift Denver to 116-111 win over Houston",
  "body": "HOUSTON -- — Jamal Murray had 39 points, Michael Porter Jr. added 17 points and nine rebounds and the Denver Nuggets beat Houston 116-111 on Sunday night to snap the Rockets' nine-game win streak. \n\n\r\n              Murray, who scored 17 in the first half, had 17 in the third quarter as Denver outscored the Rockets 39-22 in the quarter to take a 96-79 lead.\n\n\r\n              Russell Westbrook had 14 points off the bench, Aaron Gordon scored 13 points with eight assists and DeAndre Jordan had 11 points and 15 rebounds for the Nuggets, which shot 51% and were 10 of 21 on 3-pointers.\n\n\r\n              Jalen Green scored 30 points, and Dillon Brooks added 21 points for Houston. Alperen Sengun had 17 points, 14 rebounds and 10 assists, and Steven Adams finished with 14 points and 12 rebounds for the Rockets, which shot 44% and were 11 of 34 from behind the arc.\n\n\r\n              Trailing 109-100 with 1 ½ minutes left, Houston used a 7-1 run to cut the lead to three on a Sengun layup with 21 seconds left, but Christian Braun made two free throws with 19 seconds remaining to push the lead back to five.\n\n\r\n              Takeaways\r\n              Nuggets: Nikola Jokic missed his fourth straight game with left ankle impingement, and Denver improved to 2-2 with him out of the lineup.\n\n\r\n              Rockets: Houston remains in second place in the Western Conference with 10 games left, but the Nuggets closed to within a game of Houston.\n\n\r\n              Key moment\r\n              Sengun made one of two free throws with 14 seconds remaining, and Murray made two free throws two seconds later to push the lead to 114-108.\n\n\r\n              Key stat\r\n              Houston finished 22 of 34 from the free throw line, while Denver made 18 of 26.\n\n\r\n              Up next\r\n              Denver hosts the Chicago Bulls on Monday night, while Houston hosts the Atlanta Hawks on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764997350.182933
}