{
  "game_id": "0021900598",
  "espn_id": "401161240",
  "date": "Jan 14, 2020",
  "matchup": "PHX @ ATL",
  "headline": "Young, Huerter power Hawks to 123-110 win over Booker, Suns",
  "body": "ATLANTA --  Kevin Huerter says he has no idea when Trae Young is about to go on one of his hot streaks.\n\nThe latest scoring spree for the Atlanta point guard was especially well-timed.\n\nYoung scored 21 of his 36 points in the fourth quarter and the Hawks pulled away late to beat the Phoenix Suns 123-110 on Tuesday night.\n\n\"Any shot Trae takes looks good to us,\" Huerter said. \"He hit probably two 30-footers. When he's making those, he's tough to guard.\"\n\nDevin Booker led the Suns with 39 points before he was ejected for his second technical foul following his dunk with less than two minutes remaining.\n\nYoung had only 15 points before more than doubling his total in the final period for his 20th game with at least 30 points this season. He is averaging 29.1 points per game.\n\n\"You have to have a closer in this league and you have to be able to execute in the fourth quarter,\" Hawks coach Lloyd Pierce said.\n\nFor Atlanta, saddled with the NBA's worst record, there has been far too little fourth-quarter execution this season. That changed against the Suns, when the Hawks made 12 of 19 shots, including five of eight 3-pointers, in the final period. Young hit four of seven 3s in the final 12 minutes.\n\n\"He's been doing that since high school,\" said Suns center Deandre Ayton, who had 20 points and 10 rebounds.\n\nYoung got help from Huerter, his backcourt partner. Huerter scored 23 points and set career highs with 15 rebounds and eight assists.\n\n\"I was trying to be aggressive,\" he said.\n\nJohn Collins added 22 points and 10 rebounds for the Hawks, who snapped a four-game losing streak.\n\nLed by Young, the Hawks pulled away in the final period after briefly losing their lead in the third. Young's 3-pointer gave Atlanta a 95-92 lead it did not relinquish.\n\nEach team made lineup adjustments.\n\nSuns guard Ricky Rubio did not accompany the team to Atlanta for personal reasons.\n\nPhoenix coach Monty Williams, unhappy with his team's play, ripped off his tie following the game.\n\n\"I thought our offense just sputtered tonight,\" he said. \"Certainly not having Ricky on the floor hurt. ... But we had chances. The ball movement certainly wasn't there.\"\n\nThe Hawks had few options inside as centers Alex Len (lower back pain) and Bruno Fernando did not play. Atlanta was boosted by Young's return after missing one game with a sore left hamstring.\n\nAfter leading 56-51 at halftime, Atlanta opened the second half with a 12-4 run. Collins sank a 3-pointer for a 68-55 lead. The Hawks stretched the lead to 75-61 on another 3 from Collins.\n\nPhoenix rallied late in the third to take its first lead of the second half, 81-80, on Cameron Johnson's three-point play.\n\nTIP-INS\n\nSuns: Elie Okobo missed his only four shots and had three assists in his second start of the season as Rubio's fill-in. ... Booker made all 13 of his free throws. ... Mikal Bridges had 15 points.\n\nHawks: Fernando arrived in Atlanta on Tuesday morning following a 20-hour flight from his native Angola. He missed his fourth game following his mother's death. ... Hawks Hall of Famer Dominique Wilkins was given a cake courtside to celebrate his 60th birthday on Sunday.\n\nEJECTED\n\nWilliams didn't agree with Booker's ejection.\n\n\"There's taunting going on all game,\" Williams said, adding he thought the ejection was \"silly.\"\n\n\"That's what I told the ref. That's a tough one to take,\" he added.\n\nBooker said that after his jam he only said: \"I can do that every time.\" He called the exchange of trash talk \"average NBA game talk.\"\n\nSTAYING ALIVE\n\nWith his team missing two centers, Pierce said his biggest concern was having Collins and Damian Jones get into foul trouble as the team's primary available inside players. Collins finished with five fouls. Jones, who had 11 points, had three fouls.\n\nUP NEXT\n\nSuns: Continue their three-game East Coast trip at New York on Thursday night.\n\nHawks: Play at San Antonio on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996557.841634
}