{
  "game_id": "0021601129",
  "espn_id": "400900524",
  "date": "Mar 31, 2017",
  "matchup": "ORL @ BOS",
  "headline": "Thomas, Celtics hold off Magic for 117-116 win",
  "body": "BOSTON --  Isaiah Thomas and the Boston Celtics passed a surprisingly tough test Friday night to keep their hold atop the Eastern Conference.\n\nThomas scored 35 points, Jae Crowder had 18 and the Celtics rallied to beat the Orlando Magic 117-116 to maintain their slim lead over Cleveland in the East.\n\nThe Cavaliers won easily against Philadelphia, staying within a half-game of Boston.\n\nThe Celtics faced multiple 13-point deficits, but Thomas helped them charge back and Al Horford put them up by a point with two free throws with 1:22 left. Orlando then missed three shots down the stretch, including a driving layup attempt by Elfrid Payton with two seconds remaining.\n\nFor Boston, it was easily the toughest of three victories against Orlando this season -- the first two came by 30 points each.\n\n\"Any way we can get a win is what we're looking forward to,\" Thomas said. \"They're a different team. ... They've been playing a lot better since the All-Star break.\"\n\nOrlando opted not to call a timeout and set up a play before Payton's drive.\n\n\"We all knew that was going to be the plan,\" Magic coach Frank Vogel said. \"I love that we attacked in a scramble situation like that and got to the rim.\"\n\nAaron Gordon scored 20 of his 32 points in the first half and had 16 rebounds, while Evan Fournier scored 20 points for the Magic. Payton dished out a career-high 15 assists and flirted with a triple-double, getting 12 points and nine rebounds.\n\nRoss had 17 points and Jodie Meeks contributed 13 off the bench for Orlando, which has lost three in a row and eight of its last 11. The Magic have dropped 13 straight against the Celtics in Boston.\n\nBoston fell behind by 13 with 1:50 to play in the first half, drawing boos from the home crowd. But the Celtics used a quarter-closing surge to pull within 64-57 at the break.\n\n\"I did tell them you're going to have nights like this,\" Celtics coach Brad Stevens said. \"You're going to have nights where, man, it feels like it's tough to get going and the other team is rolling.\"\n\nTIP-INS\n\nMagic: Gordon started despite being a game-time decision with a sore shoulder after colliding with former teammate Victor Oladipo in Wednesday's loss to Oklahoma City. ... F Jeff Green (back spasms) missed his fifth straight game and did not travel. He will also sit out Saturday at Brooklyn. Green played for the Celtics from 2011 until 2015.\n\nCeltics: G Avery Bradley (illness) was out with a recurrence of the stomach bug that forced him to be hospitalized and miss last Friday's game against Phoenix. \"He's not in the hospital, but he's not doing so hot,\" Stevens said. ... Thomas extended his franchise-record streak of games with at least one 3-pointer to 51.\n\nNO PRESSURE\n\nBoston had not led the East before this week since March 22, 2011. Bradley is the only member of that 2011 team still on the roster, but the team's inexperience on top isn't a concern for the coaching staff.\n\n\"This is a group that doesn't feel any pressure. They just play,\" Celtics assistant Walter McCarty said. \"We've never talked about getting the first seed.\"\n\nA FEW GOOD MEN\n\nStevens sent a congratulatory text message to Gonzaga coach Mark Few after he reached the Final Four and shared experiences from his time at Butler, which he coached to back-to-back NCAA national championship game appearances in 2010 and 2011.\n\n\"I just talked about my perspective and then what our team did to kind of get away from it, because it's a really long week,\" Stevens said, adding that there is \"no better person\" than Few. \"By the time Saturday's games tip off, you're like `Can we please just play the game?\"\n\nUP NEXT\n\nMagic: Continue a three-game trip Saturday against the Nets before a tilt Tuesday at Cleveland.\n\nCeltics: Make a trip to New York on Sunday before returning home to host the Cavaliers on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995812.326027
}