{
  "game_id": "0021800372",
  "espn_id": "401071053",
  "date": "Dec 07, 2018",
  "matchup": "SAC @ CLE",
  "headline": "Fox, Hield lead Kings to 129-110 win over Cavaliers",
  "body": "CLEVELAND --  De'Aaron Fox and the Sacramento Kings found their stride in the second half.\n\nThe Cleveland Cavaliers just couldn't keep up.\n\nFox had 30 points and 12 assists, and the Kings beat the Cavaliers 129-110 on Friday night.\n\n\"We played with a lot more communication and physicality in the second half,\" Sacramento coach Dave Joerger said, \"and we knew we needed to.\"\n\nBuddy Hield added 25 points for the Kings, who led by as many as 25 after the game was tied at 66 at halftime. Marvin Bagley III scored 17 points on 8-for-9 shooting after missing two games due to back spasms.\n\nSacramento led by 15 midway through the first quarter, but a lack of defense and some hot shooting by Cleveland changed the momentum.\n\n\"It was a learning experience,\" Hield said. \"It's the NBA and teams are good. They'll make their runs. We have to find a way to stay locked in.\"\n\nFox and Hield each hit two 3-pointers in the first five minutes of the third quarter, helping Sacramento open an 84-73 lead.\n\n\"I kind of let the game come to me,\" said Fox, who fell one point short of his career high. \"Sometimes I do know that it starts with me so I took the initiative to make that happen.\"\n\nJordan Clarkson scored 26 points for Cleveland, and rookie point guard Collin Sexton had 23. But the Cavaliers couldn't keep up with the Kings' fast pace.\n\n\"I felt like they really exposed us in every area,\" coach Larry Drew said. \"I haven't felt like that all year as far as opponents are concerned.\"\n\nCleveland was short-handed after it agreed to a three-team trade with Milwaukee and Washington. The Cavs got Matthew Dellavedova back from the Bucks, who also parted with forward John Henson and two draft picks in 2021. Guard George Hill went from Cleveland to Milwaukee as part of the deal, and Sam Dekker was traded from the Cavs to the Wizards.\n\nThe Cavs then lost Rodney Hood to a right foot injury. He didn't play in the second half.\n\nThe Kings (13-11) have won three straight, including the first two on their four-game trip.\n\nSacramento came out with a hot first quarter for the second straight game. Drew used a timeout 86 seconds into the game after the Kings hit their first three shots and led 7-2. Sacramento made 17 of 26 shots in the period.\n\nSacramento outscored Phoenix 36-9 in the opening quarter Tuesday.\n\nThe Cavaliers (5-20) regrouped in the second quarter. Sexton scored 14 points and Clarkson's 3-pointer at the buzzer tied the game.\n\nNO WORD\n\nDrew didn't know if Hood will be available when the Cavaliers host Washington on Saturday night.\n\nGOOD DUEL\n\nFox is in his second season while Sexton, the eighth pick in the draft, played in his 25th career game.\n\n\"He's a good player,\" Sexton said. \"I've known De'Aaron, so it was good matching up with him.\"\n\n\"It was a terrific young point guard matchup,\" Joerger said. \"I'm sure that was very enjoyable to watch.\"\n\nTIP-INS\n\nKings: Bogdan Bogdanovic scored 15 points, and Nemanja Bjelica had 13. ... G Iman Shumpert spent four seasons with the Cavaliers, including their 2016 NBA championship year. He scored six points in 23 minutes. \"Shump gives you a guy to put on somebody (defensively), and he fights like crazy and leads with his attitude on and off the court,\" Joerger said.\n\nCavaliers: Alec Burks scored 22 points off the bench. ... Hill's absence caused Drew to juggle his starting lineup. Hood was moved from small forward to shooting guard. Cedi Osman moved to small forward while Larry Nance Jr. started at power forward. Burks was the shooting guard in the third quarter after Hood was injured.\n\nUP NEXT\n\nKings: Visit Indiana on Saturday.\n\nCavaliers: Host Washington on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764994211.72003
}