{
  "game_id": "0021500712",
  "espn_id": "400828599",
  "date": "Jan 30, 2016",
  "matchup": "MEM vs. SAC",
  "headline": "Green scores 29, Gasol 22 as Grizzlies defeat Kings 121-117",
  "body": "MEMPHIS, Tenn. -- The Sacramento Kings waited too long to try to catch the Memphis Grizzlies.\nMemphis built a 22-point lead in the first half, held a 21-point advantage in the third quarter and then thwarted a fourth-quarter Kings rally for a 121-117 victory over Sacramento on Saturday night.\n\"It was a classic case of we showed up too late,\" said Rudy Gay, who led the Kings with 21 points, including 13 in the fourth quarter. \"We showed up to the game at 8:30 (p.m.) instead of 7 when it started.\"\nJeff Green scored 29 points and Marc Gasol had 22 points, six rebounds and five assists to lead Memphis. Courtney Lee added 18 points, including a trio of free throws in the closing seconds.\nThe Kings, who lost their fourth straight, pulled within 118-117 on a 3-pointer from Darren Collison with 18.7 seconds left. Lee converted two free throws for a 120-117 lead. On the next possession, Collison lost the ball, the Kings' 19th turnover, and Memphis held on for its third straight win and ninth in the last 11.\nVince Carter had 13 points on 5 of 8 shooting from the field. Tony Allen had 12 and Zach Randolph scored 10 for Memphis.\nCollison scored 20 points for the Kings, while DeMarcus Cousins had 17 points and 14 rebounds. Omri Casspi matched Cousins' 17 points.\n\"We lost focus and didn't respect those guys down the stretch,\" Allen said of the Kings fourth-quarter rally.\nThe Kings, who entered the quarter trailing 92-77, cut into the Grizzlies' lead, closing to 104-94 with just over seven minutes left. That led to Memphis coach Dave Joerger calling a timeout and sticking Gasol, Allen and point guard Mike Conley back in the game.\nThat didn't slow down Sacramento's run. Gay connected on three free throws after he was fouled by Matt Barnes. Eventually, the Sacramento run reached 13-0 and the Kings closed to 104-102 on a Casspi dunk with 5 minutes remaining.\n\"We played with some urgency and aggressiveness,\" Kings coach George Karl said. \"They missed some shots, and we made some shots.\"\nMemphis built the lead back to 10 points. But Collison scored eight points in the final 2:39 to pull Sacramento to 118-117 before Lee converted three of four free throws.\n\"We kind of relaxed defensively,\" Joerger said. \"Fell in love with the jump shot a little bit, and our defensive toughness kind of -- well, they scored 40 points in the fourth quarter.\"\nMemphis created enough of a cushion in the first half, then carried a 65-51 lead into the break. The Grizzlies were still holding a 92-77 advantage after three periods.\n\"I don't think guys are engaged coming into the game,\" Cousins said of the slow start. \"The focus isn't there. The energy isn't there. The effort isn't there.\"\nTIP-INS\nKings: Rajon Rondo had eight assists before fouling out in the fourth quarter, breaking his streak of 14 straight games with double-digit assists. Gay returned to the lineup after missing the previous two games with a corneal abrasion to his left eye. Gay, who played six-plus seasons in Memphis and still owns a house here, got a mixed reaction when introduced.\nGrizzlies: Memphis has scored 100 points in eighth straight games, tying the longest streak in franchise history for reaching the century mark. The team scored 65 points in the first half, a season-high for a half. ... Green entered the game averaging 17.3 points in his last seven games, shooting just under 51 percent. He was 11 of 16 against the Kings.\nFAST START\nThe Grizzlies scored 36 points in the first quarter, shooting 65 percent. \"It's not always going to be like that,\" Gasol said of the start. \"We're not always going to score 65 percent of our shots. On the other hand, we have to try and keep the other team under 20.\" The Kings scored 22 points in the first.\nBOOGIE DOWN\nCousins left the game with 2:03 remaining after injuring his left ankle. He was helped off the court. He injured the ankle midway through the second quarter and limped to the locker room. He returned to the floor to open the second half. \"There wasn't any hesitance,\" Cousins said. \"Once the pain kind of went away, we wrapped it up a little tighter and I tried to play through it.\"\nUP NEXT\nKings: Host Milwaukee Bucks on Monday.\nGrizzlies: Visit New Orleans Pelicans on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994442.763183
}