{
  "game_id": "0022300069",
  "espn_id": "401584697",
  "date": "Oct 25, 2023",
  "matchup": "TOR vs. MIN",
  "headline": "Schroder scores 22, Anunoby has 20 as Raptors beat Timberwolves 97-94 in season opener",
  "body": "TORONTO -- — Dennis Schroder scored 22 points in his Toronto debut, O.G. Anunoby had 20 and the Raptors gave new coach Darko Rajakovic a victory in his first game by beating the Minnesota Timberwolves 97-94 on Wednesday night.\n\n\r\n              Three of Schroder’s seven assists came in the fourth quarter as Toronto outscored Minnesota 24-20.\n\n\r\n              “New team, new terminology, new coaching staff,” Rajakovic said. \"There’s so much new with our team, and having somebody who’s been through it with different teams in that role of point guard brings calmness.”\n\n\r\n              Kawhi Leonard was the most recent player to score 20 or more in his first game with the Raptors, netting 24 in a home win over Cleveland on Oct. 17, 2018.\n\n\r\n              Scottie Barnes had 17 points and matched his career high with five blocks. Pascal Siakam added 15 points and Jakob Poeltl grabbed 11 rebounds for the Raptors, who celebrated the win by showering Rajakovic with ice water in the locker room.\n\n\r\n              “It was pretty cool,” Anunoby said.\n\n\r\n              Siakam had six assists and Barnes contributed five. \n\n\r\n              Anthony Edwards had 26 points and 14 rebounds, and Rudy Gobert added 15 points and 13 rebounds, but Minnesota lost its 19th straight north of the border.\n\n\r\n              Karl-Anthony Towns finished with 19 points and 10 rebounds, and Mike Conley scored 11 for the Timberwolves. Towns shot 8 for 25, going 2 of 10 from 3-point range.\n\n\r\n              Minnesota coach Chris Finch blamed poor offensive decision-making for his team’s first loss after a 5-0 preseason.\n\n\r\n              “When the season starts for real, the ball gets sticky,” Finch said. “We didn’t trust the movement we’d seen all preseason. We were never able to really establish any sort of rhythm.”\n\n\r\n              Timberwolves forward Jaden McDaniels was not available because of a strained left calf. McDaniels was injured during the preseason NBA Abu Dhabi Games against Dallas.\n\n\r\n              Minnesota is winless in Toronto since Jan. 21, 2004, when Sam Cassell, Kevin Garnett and Latrell Sprewell were the Wolves’ leading scorers in a 108-97 victory.\n\n\r\n              Toronto’s most recent home loss in the series was a 116-112 defeat on Feb. 14, 2021, when the Raptors were playing in Tampa, Florida, because of border restrictions related to the COVID-19 pandemic.\n\n\r\n              Gary Trent Sr. played three minutes for Minnesota the last time it beat the Raptors in Toronto. His son Gary Jr. scored five points off the bench for the Raptors on Wednesday.\n\n\r\n              Six different Raptors players made at least one 3-pointer on Wednesday, with Schroder and Anunoby each making four. Toronto finished 14 for 35 from long range.\n\n\r\n              The Raptors led 53-51 at halftime.\n\n\r\n              Minnesota shot 3 for 15 from 3-point range in the first two quarters but made three of six from distance in the third. The Timberwolves took a 74-73 lead into the fourth.\n\n\r\n              Toronto outscored Minnesota 34-12 in fast-break points.\n\n\r\n              Before the game, Toronto exercised the fourth-year team option on Barnes’ rookie scale contract. Barnes, the NBA Rookie of the Year in 2021-22, is signed through the 2024-25 season.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Miami Heat on Saturday.\n\n\r\n              Raptors: Visit the Chicago Bulls on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995855.343746
}