{
  "game_id": "0022301030",
  "espn_id": "401585658",
  "date": "Mar 24, 2024",
  "matchup": "MIL vs. OKC",
  "headline": "Antetokounmpo scores 30, Middleton gets triple-double as Bucks roll past Thunder 118-93",
  "body": "MILWAUKEE -- — The Milwaukee Bucks emphatically demonstrated just what they're capable of accomplishing when they have all their top players available.\n\n\r\n              Giannis Antetokounmpo had 30 points and a season-high 19 rebounds, Khris Middleton recorded his second career triple-double and the Bucks trounced the Oklahoma City Thunder 118-93 on Sunday.\n\n\r\n              “With a full team out there, we realize what we can do as a team,” said Middleton, who had 11 points, 10 rebounds and 10 assists for his first triple-double since Jan. 20, 2018. “We have so many guys, so many weapons that can carry us, or guys that can make a play or just attract a crowd.”\n\n\r\n              This marked the first time since a Feb. 3 victory at Dallas that the Bucks had Antetokounmpo, Middleton and seven-time All-NBA guard Damian Lillard on the floor for the same game. It was the first time since a Jan. 31 loss at Portland that they had their preferred starting lineup of Antetokounmpo, Lillard, Middleton, Brook Lopez and Malik Beasley.\n\n\r\n              Middleton had missed 16 straight games with a sprained left ankle and also sat a victory over the Brooklyn Nets on Thursday due to injury management. Lillard also had a sprained left ankle that caused him to sit out two games in early February. Antetokounmpo returned Thursday after missing two games due to an issue with his left hamstring.\n\n\r\n              “I just feel this appreciation feeling of having everybody healthy and available to play,” Antetokounmpo said. “Because when we're not healthy, I think sometimes we play well, sometimes we don't, sometimes we create this excuse in our mind that like, ‘OK, when he gets back, we're going to be better.' But now we're all here. There's no more excuses.”\n\n\r\n              Milwaukee broke open a close game in the second half as Oklahoma City (49-21) fell out of the Western Conference lead. The reigning NBA champion Denver Nuggets (50-21) didn’t play Sunday and moved a half-game ahead of the Thunder.\n\n\r\n              Oklahoma City posted its lowest point total and shot its lowest percentage (.371) of the season. Oklahoma City's Shai Gilgeous-Alexander scored 12 points — the first time since Jan. 16 he was held below 20 — and sat out the entire fourth quarter after the Bucks had built a lopsided lead.\n\n\r\n              “They had him in a crowd for much of the night and made it very difficult for him to get his cracks,” Thunder coach Mark Daigneault said. “I thought as a team, just our overall pace and sharpness on offense wasn't where it needed to be.”\n\n\r\n              Milwaukee had seven players score in double figures. Bobby Portis had 15, Lopez 14, Lillard and Pat Connaughton 11 apiece and Jae Crowder 10.\n\n\r\n              “Just having everybody together just makes the game easier for everybody,” Antetokounmpo said. “We don’t have to force anything. We just keep on playing good basketball, keep on moving the ball. There’s going to be some nights that it’s going to be my night. There’s going to be some nights that it’s going to be Khris’ night. There’s going to be some nights that it’s going to be Dame’s night. But we don’t have to force anything. Everybody out there is a threat. I think our bench is unbelievable, and they keep on getting better.”\n\n\r\n              Josh Giddey scored 19 and Jalen Williams added 18 for the Thunder.\n\n\r\n              The Bucks led 48-47 at halftime and broke open the game by outscoring Oklahoma City 18-2 in the first six-plus minutes of the third quarter. Oklahoma City didn’t make its first basket of the third period until Williams converted a layup with 5:38 left that ended a 16-0 Milwaukee spurt.\n\n\r\n              Oklahoma City’s Lu Dort appeared to take a hit to the head under the basket as Williams scored, causing the swingman to leave the game. Although Dort didn't return, Daigneault said after the game that “I think he's fine.”\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At New Orleans on Tuesday.\n\n\r\n              Bucks: Host the Los Angeles Lakers on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996104.034451
}