{
  "game_id": "0021801098",
  "espn_id": "401071771",
  "date": "Mar 24, 2019",
  "matchup": "TOR vs. CHA",
  "headline": "Hornets win on Lamb's half-court buzzer-beater",
  "body": "TORONTO -- Jeremy Lamb added a dose of March Madness to Sunday's NBA action.\nLamb banked home a half-court shot at the buzzer, and the Hornets beat the Toronto Raptors 115-114, Charlotte's third straight win.\nIt was the second-longest game-winning buzzer-beater in the past 20 seasons. Tyreke Evans hit a 49-footer against the Memphis Grizzlies on Dec. 29, 2010.\n\"It feels great,\" Lamb said. \"We fought so hard the whole game. Everybody who came in contributed and played well. They made a big run late. It just feels good to get that win and cap it off like that.\"\nToronto looked to have won the game after Kawhi Leonard hit the go-ahead basket with 44 seconds left, then blocked Kemba Walker at the other end.\nCharlotte got one final chance after Leonard missed a jumper with 5.8 seconds to go. Pascal Siakam knocked the inbounds pass away from Lamb, who chased the ball into the backcourt before launching the game-winning 3-pointer.\n\"He made a tough shot,\" Siakam said. \"I don't know how I could have defended it better. Yeah, March Madness.\"\nHornets coach James Borrego called Lamb's basket \"a contested bomb.\"\n\"I know he threw up a prayer,\" Walker said of Lamb's long heave. \"I guess the basketball gods were on our side tonight. That was an unbelievable shot.\"\nWalker had 15 points and 13 assists, and Willy Hernangomez had 13 points and 10 rebounds for the Hornets, who overcame an 18-point deficit in the fourth quarter to beat Boston on Saturday.\n\"It's a big win,\" Walker said. \"That's an unbelievable team over there. They're going to be a force to be reckoned with in the playoffs. That was impressive.\"\nDwayne Bacon made five 3-pointers and scored 20 points, and rookie Miles Bridges scored 16 for Charlotte, which began the day 2 1/2 games behind eighth-place Miami and 1 1/2 games behind ninth-place Orlando in the Eastern Conference playoff race.\n\"I feel like this is turning our way,\" Borrego said. \"If we keep playing this way, we're going to give ourselves a chance.\"\nLeonard scored 28 points, and Siakam had 23 for the Raptors, who lost consecutive home games for the second time this season. Toronto lost to New Orleans on Nov. 12 and Detroit on Nov 14.\nAll-Star point guard Kyle Lowry returned for Toronto after missing the previous two games because of a sore right ankle. With Lowry in the starting lineup, the Raptors were at full strength for the first time since the trade-deadline acquisition of center Marc Gasol and the subsequent signing of free-agent guard Jeremy Lin.\nStill, having a full complement of players didn't pay off for the Raptors, who surrendered 18 points on 13 turnovers. Toronto had 22 turnovers in Friday's home loss to Oklahoma City, one shy of their season worst.\nCharlotte led 109-96 with 7:50 remaining. Then Toronto's Fred VanVleet hit back-to-back 3-pointers, and dunks from Siakam and Leonard cut it to 109-106 with 5:26 to go.\nLeonard's jumper made it a one-point game before Bacon ended Toronto's 12-0 run by making one of two at the foul line.\nSiakam and Bacon swapped layups before Leonard tied it with a pair at the foul line.\nThe Hornets led 58-57 at halftime.\nTen of Charlotte's 12 field goals in the third quarter were 3-pointers, including five from Bacon. The Hornets set a franchise record by making 10 of 15 from long range in the third. Charlotte took a 95-83 lead into the fourth.\nTIP-INS\nHornets: Charlotte shot 18-for-41 from 3-point range. ... G Tony Parker was away from the team for personal reasons. ... F Cody Zeller (left knee) missed his seventh straight game, and F Nicolas Batum (illness) missed his second straight. F Michael Kidd-Gilchrist (concussion protocol) was absent for the third straight game. ... Charlotte made nine 3-pointers in a quarter against Sacramento on Jan 25, 2016.\nRaptors: Toronto recorded an assist on each of its first six baskets and 11 of 12 in the first quarter. ... Gasol started and scored 17 points. ... The Raptors came in 29-8 at home, tied for the second-most home wins in the NBA.\nBEEN A WHILE\nLamb was asked whether he remembered the last time he hit a half-court buzzer-beater.\n\"In my driveway, growing up, counting down by myself,\" he said.\nSTILL SORE\nLowry said his ankle is still sore, but he wanted to get back into game action before the playoffs.\n\"It's a work in progress,\" he said. \"This is a good first step for me.\"\nUP NEXT\nHornets: Host San Antonio on Tuesday night.\nRaptors: Host Chicago on Tuesday night.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994244.696404
}