{
  "game_id": "0022000312",
  "espn_id": "401267472",
  "date": "Feb 01, 2021",
  "matchup": "CLE vs. MIN",
  "headline": "Sexton scores 26 points, Cavaliers edge Timberwolves 100-98",
  "body": "CLEVELAND -- — Collin Sexton scored 26 points and Jarrett Allen had a season-high 23 points and 18 rebounds, leading the Cleveland Cavaliers to a 100-98 win over the Minnesota Timberwolves and a split of their home-and-home series on Monday night.\n\n\r\n                    Darius Garland had 19 points and 11 assists for the Cavaliers, who had lost four of their last five games, including a 109-104 decision at Minnesota the previous evening.\n\n\r\n                    Allen blocked five shots and made 9 of 14 free throws in his initial start since being acquired from Brooklyn as part of the James Harden mega-trade on Jan. 14.\n\n\r\n                    “That was just unacceptable what happened last night for the Cleveland Cavaliers with our effort,” Allen said. “We play with energy and we give it all on the court. That’s what we’re all about and we showed that tonight.”\n\n\r\n                    D’Angelo Russell scored 18 points and No. 1 overall draft pick Anthony Edwards had 13 points in his third start for the Timberwolves. Minnesota dropped its eighth straight on the road and is 2-8 overall since Jan. 13.\n\n\r\n                    “We’ve got to be better,” Edwards said. “They were playing tough defense, but we’ve just got to be better. That’s it.”\n\n\r\n                    Cleveland held a 98-91 lead with 19 seconds remaining, but the Timberwolves pulled within two after Russell buried a 3-pointer and Malik Beasley scored in the lane.\n\n\r\n                    Taurean Prince made two free throws with 3.9 seconds left to extend the Cavaliers’ advantage to 100-96, making Naz Reid’s layup just before the buzzer irrelevant.\n\n\r\n                    “We could get anything we wanted in the paint tonight, so we wanted to attack with our bigs as much as possible,” Garland said.\n\n\r\n                    Cleveland played without center Andre Drummond (sore lower back), who leads the NBA in rebounding at 15.1 per game. Drummond had 25 points and 22 boards in the opener of the back-to-back set.\n\n\r\n                    “We had an opportunity to close it out a couple of times and we let them back in, but we didn’t fold,” Cavaliers coach J.B. Bickerstaff said.\n\n\r\n                    Minnesota started the fourth with an 11-1 run, taking its first lead since the first quarter at 78-77 on a putback by Jaylen Nowell. Cleveland answered with six straight points and did not trail again.\n\n\r\n                    Edwards is averaging 17.0 points and 4.0 rebounds in 30.0 minutes since being moved into the starting lineup on Jan. 29.\n\n\r\n                    “There are changes in the way teams guard me, but it’s still basketball,” Edwards said. “It really doesn’t make any difference to me.”\n\n\r\n                    TRENDING UPWARD\n\n\r\n                    Timberwolves F Juancho Hernangomez was active for the first time since Jan. 13, but did not play. The fourth-year pro missed eight games because of the NBA’s health and safety protocols, and is still working on his conditioning. “It’s an ongoing process because you want to take care of your guys when they come back,” coach Ryan Saunders said.\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: C Naz Reid (right wrist sprain) returned after missing two games, scoring 12 points in 13 minutes off the bench. ... C Karl-Anthony Towns (COVID-19) was inactive for the ninth straight game and G Jarrett Culver (left ankle sprain) missed his third in a row.\n\n\r\n                    Cavaliers: F Larry Nance Jr. (right wrist sprain) did not dress for the third time since initially being hurt Jan. 24 at Boston. Nance had 24 rebounds over Cleveland’s previous two games, but shot 2 of 12. ... F Kevin Love (right calf strain) missed his 19th straight game, while G Matthew Dellavedova (concussion) has not played this season.\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: At San Antonio on Wednesday. The Spurs beat Minnesota 125-122 in overtime on Jan. 9, but the Timberwolves were 96-88 winners one night later.\n\n\r\n                    Cavaliers: Host the Clippers on Wednesday. Los Angeles coach Tyronn Lue, who led Cleveland to the 2016 NBA championship, returns as a visitor for the first time.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997890.318681
}