{
  "game_id": "0022301063",
  "espn_id": "401585691",
  "date": "Mar 29, 2024",
  "matchup": "LAL @ IND",
  "headline": "Pascal Siakam, Tyrese Haliburton combine for 43 points to lead Pacers past Lakers 109-90",
  "body": "INDIANAPOLIS -- — Coach Rick Carlisle believes his Indiana Pacers are already in playoff mode.\n\n\r\n              If Friday night is any indication, that could be a promising sign for a team that has lost nine straight postseason games and hasn't won a playoff series in a decade.\n\n\r\n              Pascal Siakam finished with 22 points and 11 rebounds, Tyrese Haliburton added 21 points, eight assists and eight rebounds and the Pacers beat the Los Angeles Lakers 109-90 in a pivotal game in the conference standings.\n\n\r\n              “These are all playoff games you know,” Carlisle said after tying the late Red Auerbach for 12th on the NBA's career victory list with No. 938. “I mean, they're fighting for their position in the standings. We are, too.”\n\n\r\n              And yet the Pacers allowed a season-low point total, holding the Lakers 60 points below Sunday's previous meeting with Indiana.\n\n\r\n              LeBron James (left ankle) and Anthony Davis (left knee) both started despite injuries and played like perennial All-Stars as the Lakers tried to improve from starting the night seeded No. 9 in the West.\n\n\r\n              Davis finished with 24 points and 15 rebounds, while James had 16 points, 10 rebounds and eight assists. Austin Reaves added 16 points and 13 rebounds.\n\n\r\n              But three games in four nights also took a toll on the Lakers, who were 5 of 29 on 3-pointers and committed 16 turnovers, five by James.\n\n\r\n              “We didn't have the energy we've had the last few weeks,” James said. “You've got to be able to play through it. We know it's three in four nights, but there's no excuse for unforced turnovers. They can't happen.”\n\n\r\n              The high stakes — and the early up-tempo pace — created an entertaining and sometimes sloppy contest.\n\n\r\n              But after losing to the Lakers 123-109 in the final of the NBA's inaugural In-Season Tournament and 150-145 last Sunday in Los Angeles, Indiana locked down defensively and flipped the script on an old nemesis.\n\n\r\n              The Pacers never trailed after the first nine minutes, building a 40-33 lead midway through the second quarter and extending the margin from 54-49 at halftime to 86-70 late in the third. \n\n\r\n              And when James and Davis tried to rally the Lakers early in the fourth, the Pacers successfully fended off each charge before using a 17-3 spurt to clinch their first winning season since 2020-21.\n\n\r\n              “Yes, I forgot about that — first winning season in four years (in the NBA),” said Haliburton, a two-time All-Star. “But when you get caught up in the standings and how far the playoffs are, matchups and all that stuff, I think you lose what's in front of you and I think we've seen examples of that throughout the course of our season. So for us, it's taking it on a game-to-game basis, understanding every game is very meaningful moving forward.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Make the fourth stop of a six-game road trip Sunday at Brooklyn.\n\n\r\n              Pacers: Face the Nets on Monday in the first of the two games in three days.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995480.369388
}