{
  "game_id": "0022400893",
  "espn_id": "401705459",
  "date": "Mar 05, 2025",
  "matchup": "MIA @ CLE",
  "headline": "Cavaliers hold off Heat 112-107 to extend winning streak to 12 and clinch playoff spot",
  "body": "CLEVELAND -- — Donovan Mitchell scored 26 points, Darius Garland had 10 assists and the Cleveland Cavaliers survived some sloppiness in the final two minutes to win their 12th straight game, 112-107 over the banged-up Miami Heat on Wednesday night.\n\n\r\n              With the win, the Cavs became the first team to clinch a playoff berth.\n\n\r\n              It wasn't easy as the Heat, who were missing several rotational players, led 107-106 with 2:55 left. But Miami didn't score again and Duncan Robinson's apparent tying 3-pointer with 17.4 seconds left was waved off because he stepped out of bounds.\n\n\r\n              Bam Adebayo scored a season-high 34 points for Miami, which was without leading scorer Tyler Herro.\n\n\r\n              The Heat were already missing Jaime Jaquez Jr. (ankle sprain), Nikola Jovic (broken hand), Kel’el Ware (knee sprain) and Andrew Wiggins (ankle sprain) before Herro came down with a head cold in the past 24 hours.\n\n\r\n              Evan Mobley and De'Andre Hunter added 16 points apiece for Cleveland.\n\n\r\n              Takeaways\r\n              Heat: Herro's absence forced Miami to operate differently on offense and limited coach Erik Spoelstra's depth. However, he still had Adebayo and the three-time All-Star made all nine free throws and added 12 rebounds in 38 minutes.\n\n\r\n              Cavaliers: Cleveland's execution was poor down the stretch. Mitchell had two turnovers in the final two minutes.\n\n\r\n              Key moment\r\n              Miami's Kevin Love played his first game in Cleveland since signing with the Heat two years ago. The 36-year-old Love received a rousing ovation from Cavs fans, who'll never forget his major role in helping the team win the 2016 NBA title. Love was saluted with a video tribute during a timeout in the first quarter.\n\n\r\n              Key stat\r\n              Cleveland is one of just seven teams to have three double-digit winning streaks in the same season.\n\n\r\n              Up next\r\n              The Heat host Minnesota on Friday, the first of five straight home games. The Cavaliers are in Charlotte on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764998267.3929129
}