{
  "game_id": "0022400906",
  "espn_id": "401705472",
  "date": "Mar 07, 2025",
  "matchup": "DAL vs. MEM",
  "headline": "Morant's 31 points, Bane's 27 points, 16 rebounds, lead Grizzlies past Mavericks 122-111",
  "body": "DALLAS -- — Ja Morant scored 31 points, including the game’s final seven, and Desmond Bane had 27 points and a career-high 16 rebounds as the Memphis Grizzlies rallied in the fourth quarter to beat the Dallas Mavericks 122-111 on Friday night.\n\n\r\n              Reserve Brandon Williams scored a career-high 31 points and Naji Marshall had career bests with 29 points and 17 rebounds for the Mavericks, who have lost four consecutive games and six of their last seven.\n\n\r\n              The Grizzlies finished on an 18-4 run to snap a season-long four-game losing streak. They played their second straight game without leading scorer Jaren Jackson, Jr., who’s considered week-to-week after injuring his left ankle Monday.\n\n\r\n              After Williams’ free throw pulled Dallas within 115-111 with 2:06 left, Morant had a layup with 1:35 left, a jumper with a minute to play and a pullup 3-pointer with 30 seconds left.\n\n\r\n              The Mavericks, playing their second game since losing Kyrie Irving to a season-ending knee injury, made only one field goal in the final seven minutes.\n\n\r\n              Takeaways\r\n              Grizzlies: They’re fourth in the West with a one-game lead over Houston. Morant opened 1 of 8 in the first quarter and scored 24 points in the second half.\n\n\r\n              Mavericks: In 10th place in the West, they’re at .500 for the first time since being 7-7 on Nov. 17. Caleb Martin made his Mavericks debut and had two points, four rebounds and three assists. Olivier-Maxence Prosper has been lost for the remainder of the season with a wrist injury.\n\n\r\n              Key moment\r\n              When Memphis held the 115-111 lead, Morant rebounded Klay Thompson’s missed 3-pointer to begin his final scoring run.\n\n\r\n              Key stat\r\n              The taller Grizzlies outscored the Mavericks 74-38 in the paint. Ten of Zach Edey’s 13 rebounds were offensive.\n\n\r\n              Up next\r\n              The Mavericks will host Phoenix on Sunday. The Grizzlies will play at New Orleans that night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997148.076938
}