{
  "game_id": "0022000350",
  "espn_id": "401267510",
  "date": "Feb 05, 2021",
  "matchup": "LAC vs. BOS",
  "headline": "Celtics edge George-less Clippers 119-115 behind Tatum's 34",
  "body": "LOS ANGELES -- — Jayson Tatum led a 3-point shooting spree and scored 34 points, helping the Boston Celtics hold off the Clippers 119-115 on Friday night without Paul George in the Los Angeles lineup.\n\n\r\n                    The Clippers sure could have used the NBA’s 3-point shooting leader. George, who is hitting 48% from long range, sat out with a sore right foot two nights after making 8 of 9 3-pointers in a win at Cleveland.\n\n\r\n                    Lou Williams scored the Clippers' final seven points, including a 3-pointer from the left corner that gave them a one-point lead with 46 seconds remaining.\n\n\r\n                    But the Celtics closed the game with six straight free throws to hand the Clippers just their third loss at home.\n\n\r\n                    “Our margin is such that we’re just going to play a lot of close games,” Celtics coach Brad Stevens said. “We got to get used to doing our best in those moments.”\n\n\r\n                    Kawhi Leonard had 28 points and 11 rebounds for the Clippers but missed all five of his 3-point attempts. The team was 14 of 32 from long range. Williams finished with 18 points off the bench.\n\n\r\n                    Kemba Walker added 24 points for the Celtics. They made 16 3-pointers — two off their season high. Tatum had five 3-pointers — one off his season best.\n\n\r\n                    “This was a good win, coming off a loss, down a few guys,” Tatum said. \n\n\r\n                    After trailing throughout the first half, Boston rallied in the third quarter, getting eight 3-pointers from five different players. The Clippers were limited to just two 3s while allowing the Celtics to score 39 points in the period. \n\n\r\n                    The Celtics took their first lead of the game on a 3-pointer by Grant Williams, who followed with another one, capping a run of three consecutive 3-pointers that began with Tatum.\n\n\r\n                    The Clippers rallied from nine down early in the fourth to tie the game three times. Leonard lifted Los Angeles to a 108-106 lead with a turnaround jumper over two defenders.\n\n\r\n                    Boston made five straight free throws to go back in front by three. Lou Williams scored four in a row to put the Clippers ahead by one, but they crumbled in the closing seconds. Leonard turned the ball over, Walker stole it and scored. \n\n\r\n                    “That was definitely a confidence-builder,” Walker said. “We started off slow, but we stuck together throughout the whole game. Energy was great, communication was great, our togetherness was on a whole other level.”\n\n\r\n                    Leonard missed two consecutive baskets and the Clippers were forced to foul. \n\n\r\n                    “Sometimes other teams just play better than you and in that stretch I thought that’s what they did,” Lou Williams said.\n\n\r\n                    TIP-INS\n\n\r\n                    Celtics: They improved to 7-6 on the road. ... Stevens got a technical 26 seconds into the game. ... Walker and Payton Pritchard returned from the inactive list. \n\n\r\n                    Clippers: They got 49 points from the bench, including three players in double figures. ... They still have yet to lose two in a row this season.\n\n\r\n                    UP NEXT\n\n\r\n                    Celtics: Visit Phoenix on Sunday.\n\n\r\n                    Clippers: Host Sacramento on Sunday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997693.458357
}