{
  "game_id": "0022200481",
  "espn_id": "401468636",
  "date": "Dec 23, 2022",
  "matchup": "DET @ ATL",
  "headline": "Young, Murray power Hawks past Pistons, 130-105",
  "body": "ATLANTA -- — Trae Young had 26 points and 13 assists, Dejounte Murray added 26 points, and the Atlanta Hawks used a dominant third quarter to beat the struggling Detroit Pistons 130-105 on Friday night.\n\n\r\n              Bogdan Bogdanovic finished with 19 points, and Clint Capela, returning after missing the last three games with a right calf strain, finished with 10 rebounds and 10 points for the Hawks, who have won three of four to improve to 17-16. They began the night ninth in the Eastern Conference and are 11-6 at home.\n\n\r\n              \"We were still contesting and making it tough on them, but they’re pros and they kept making plays,\" Young said. “We just kept fighting and playing hard, and we ended up stretching out the lead in that third quarter and helping us get this win.”\n\n\r\n              Bojan Bogdanovic scored 23 for the NBA-worst Pistons, who have lost five straight.\n\n\r\n              Atlanta went on a 17-3 run over a four-minute stretch of the third quarter to take its first double-digit lead at 79-69 on Murray’s runner in the lane. Detroit never threatened the rest of the way.\n\n\r\n              The Pistons were outscored 35-18 in the third. Early in the fourth, Bogdan Bogdanovic hit a 3 on a fast break, Onyeka Okongwu followed with a turnaround jumper on the right baseline and Bogdanovic knocked down a right-wing 3 to push the lead to 105-81. Atlanta finished a 21-2 run over a six-minute stretch of the third and the fourth on Griffin’s fast-break dunk.\n\n\r\n              “I think overall we played a great first half,\" said Detroit guard Killian Hayes, who finished with 17 points. “We had a few turnovers, and the ball was moving, but the first half wasn’t the issue. I think the third quarter, when they made that run, it was tough to come back from that and then the game was pretty much done from there.\" \n\n\r\n              Young, who didn’t play in the final period, ended a three-game streak in which he scored at least 30 points. He connected on a season-high seven 3s on Wednesday in a 110-108 loss to Chicago, and he scored 15 points in the third against Detroit.\n\n\r\n              The Pistons shot 27.3% on 3s, the 13th time Atlanta has held an opponent to worse than 30% beyond the arc. The Hawks came into the game tied for the league lead in that statistic.\n\n\r\n              The Hawks went up for the first time in the second half on John Collins’ fast-break dunk early in the third and they didn’t trail again. Young hit a straightaway 3 and De’Andre Hunter knocked down a left-wing 3 to cap a 13-0 run for a 75-66 lead, and the Pistons called timeout.\n\n\r\n              “In the NBA, anybody can be beaten on any given night, so it just shows that we wanted it,” Murray said. “We executed, we took care of the ball, we played together and we won a great game.”\n\n\r\n              Detroit’s biggest lead was eight in the first half, and the Pistons led 63-60 at intermission.\n\n\r\n              “Our third quarters we’re continuing to try to give an opportunity to the young guys to come out in the second half,” Detroit coach Dwane Casey said. “It’s evident we’re not coming out with the right approach, but again we’re here to grow those guys but not to the detriment of losing our spirit, losing our togetherness and losing the games the way we’re losing them.\"\n\n\r\n              TIP-INS\n\n\r\n              Pistons: F Isaiah Livers stayed in Detroit with a right shoulder sprain, but Casey said he should rejoin the team next week. Livers has missed 11 straight games. ... Detroit began the game leading the NBA with 48.2 bench points since Dec. 1 but had its reserves outscored 51-30. \n\n\r\n              Hawks: Hunter twisted his left ankle in the second quarter but stayed in the game and finished with nine points in 27 minutes. ... Bogdanovic began the game as the only player since Dec. 9 to hit at least 28 3s while shooting at least 50% beyond the arc, but he went 3 for 11 against Detroit.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host the Los Angeles Clippers on Monday.\n\n\r\n              Hawks: At Indiana on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994371.858038
}