{
  "game_id": "0021701023",
  "espn_id": "400975769",
  "date": "Mar 15, 2018",
  "matchup": "HOU vs. LAC",
  "headline": "Harden helps Rockets over Clippers 101-96",
  "body": "HOUSTON --  There was no celebrating in Houston's locker room on Thursday night after the Rockets clinched the Southwest Division title.\n\n\"It's good, but not this year. We want that No. 1 seed and that's the main goal right now,\" Eric Gordon said.\n\nJames Harden scored 24 points, Gordon added 23 and the Rockets outlasted the Clippers for a 101-96 victory. The victory, coupled with a loss by the Pelicans to the Spurs, wrapped up the division.\n\nThe Rockets have won 27 of their last 30 games and need just one win to match their total of 55 from last season. But Houston has no intention of letting up in these last 14 games as the Rockets try to remain ahead of Golden State for the top seed in the Western Conference.\n\n\"It was a good win for us,\" Chris Paul said. \"We know that team over there is fighting for their playoff lives and we knew we were going to get a good shot from them.\"\n\nThe Clippers scored six straight points, with four from Austin Rivers, to cut the lead to a basket with less than a minute left. But on the next possession, Harden stepped back and knocked down a long 2-pointer with Rivers in his face to make it 100-96.\n\nRivers missed a 3-pointer after that before Harden made one of two free throws with 6.2 seconds left to secure the victory.\n\nIt's Houston's third straight win and snaps a three-game winning streak for the Clippers, who are vying for one of the last postseason spots in the conference.\n\nLos Angeles Clippers coach Doc Rivers didn't seem too happy with the officiating after the game.\n\n\"It was 24-8 in free throws,\" Rivers said, though Houston actually shot 23. \"That's a joke. That is a complete joke. I thought our guys drove and got hit all game, and (Lou) Williams down the stretch got killed on a play, and no call ... our guys played their hearts out, but for them to shoot that many more free throws than us, and we're the team attacking it just doesn't make basketball sense to me.\"\n\nTobias Harris led the Clippers with 29 points and Rivers had 20.\n\nThe Clippers scored six points in a row, with the last four from Jawun Evans, to tie it at 80-all early in the fourth quarter. Houston got 3-pointers from Gordon and Luc Mbah a Moute in an 8-2 run after that to make it 88-82 with 8 1/2 minutes left.\n\nHouston maintained a lead of seven or eight points for the next few minutes before the late run by Los Angeles.\n\nLos Angeles led by four at halftime and scored the first seven points of the third quarter to make it 58-47. Houston scored five quick points after that, but the Clippers used an 8-2 run to extend the lead to 66-54 with seven minutes left in the period.\n\nTheir big lead was short-lived though, as Houston scored the next 12 points, powered by 3-pointers on consecutive possessions by Gordon, to go on top 68-66. Gordon also had a nice play near the end of the run when he grabbed a rebound and chucked a long pass down the court to Clint Capela, who finished with a basket in the lane.\n\nRivers ended a more than three-minute scoring drought by the Clippers not long after that to tie it back up.\n\nThe game remained tied a couple of minutes later before the Rockets closed out the quarter with a 6-2 run to take a 78-74 lead into the fourth quarter.\n\nTIP-INS\n\nRockets: Ryan Anderson missed his ninth straight game with a sore left hip. ... Chris Paul got a technical foul early in the third quarter for complaining about not getting a foul call. ... Capela finished with 19 points, 12 rebounds and six blocks.\n\nClippers: It was the 30th time Harris has scored 20 or more points this season. ... DeAndre Jordan had eight points and 18 rebounds. ... The Clippers made just four of 18 3-pointers.\n\nJUST A BIT OFF\n\nSeven-time Cy Young Award winner Roger Clemens took the first shot for charity before the game. His shot wasn't nearly as sweet as his fastball once was and the ball clanked off the rim. The Rockets still gave Clemens $1,000 for his charity despite the miss.\n\nBOUNCING BACK\n\nGordon was 8 of 13 and 7 of 9 on 3-pointers on Thursday after scoring just one point and 0 for 7 in Houston's last game. He has 27 20-point games this season after finishing with 19 last season. Gordon's seven 3s tied a season high after he went 0 for 6 from long range on Monday.\n\nUP NEXT\n\nRockets: Visit New Orleans on Saturday night.\n\nClippers: Visit Oklahoma City on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764993593.444374
}