{
  "game_id": "0021900470",
  "espn_id": "401161112",
  "date": "Dec 27, 2019",
  "matchup": "MIA vs. IND",
  "headline": "Dragic hits go-ahead shot, Heat top Pacers 113-112",
  "body": "MIAMI --  Erik Spoelstra warned his team before the game that matchups between Indiana and Miami tend to get decided by a loose ball somewhere.\n\nSure enough, he was right.\n\nGoran Dragic scored in the lane with 6.8 seconds remaining to cap a wild finish, and the Heat improved the NBA's best home record to 14-1 by defeating the Pacers 113-112 on Friday night.\n\nDragic's shot was the third by Miami on the go-ahead possession, after Jimmy Butler and Kendrick Nunn both missed but the Heat were able to grab offensive rebounds to keep hope alive. Those were Miami's final two boards on a night where the Heat outrebounded the Pacers 56-34.\n\n\"Those last two rebounds, those plays speak for themselves,\" Dragic said. \"We're never going to give up.\"\n\nAaron Holiday had a chance to win it for Indiana, but his 10-footer -- well defended by Derrick Jones Jr. -- with about a second left bounced away. The lead changed hands five times in the final 2:21.\n\nButler scored 20 points for Miami. Bam Adebayo had 18 points and 15 rebounds, including the offensive board that set up Dragic's shot. Nunn scored 17, Dragic had 14 and Tyler Herro scored 10.\n\n\"We knew it would be a grind,\" Spoelstra said.\n\nDuncan Robinson had 18 points, all on six 3-pointers to reach 101 for the season. He reached the century mark in 31 games, four games faster than anyone else in Heat history. Damon Jones needed 35 games in 2004-05.\n\nAaron Holiday scored 17 for Indiana, which got 16 from TJ Warren and Jeremy Lamb, 14 from Doug McDermott, 13 from Myles Turner and 11 apiece from Justin Holiday and Edmund Sumner.\n\n\"It comes down to two plays we have to execute and we didn't,\" Pacers coach Nate McMillan said. \"That defensive possession where if we get a stop and we get the rebound and possibly win the game. I think they got three offensive rebounds on that possession and then we have the last possession of the game and we don't score. You have to make those plays and we didn't do that.\"\n\nThe Heat stretched their lead to nine points on two occasions early in the fourth quarter -- first on a 3-pointer by Dragic, the second on a 3 by Herro. And both times, Indiana answered with 3s of its own to avoid letting Miami pull away; Sumner hit the first, McDermott hit the second and then connected again with 8:44 left to trim Miami's lead to 96-93.\n\nThat set up the down-to-the-wire finish, and the Pacers couldn't get the bounce.\n\n\"We'll take that shot any day,\" McDermott said. \"Aaron, we have a lot of faith in him, he's a great scorer, and that's why we want the ball in his hands.\"\n\nTIP-INS\n\nPacers: Indiana committed only four turnovers, tying a franchise record. ... Malcolm Brogdon tested his balky hamstring Friday morning, but was not cleared to play. \"Still a little sore,\" McMillan said. ... Turner had four fouls, all of them against Butler. ... Indiana was looking for a fourth straight win at Miami, something the Pacers had done only once before.\n\nHeat: His latest suspension over, Dion Waiters was active but didn't play. And Justise Winslow, whose back injury is now being called a bone bruise, was again sidelined. ... Heat rookie Chris Silva got a surprise at the team's pregame walkthrough -- the team and the NBA helped arrange for his mother, Carine Minkoue Obame, to arrive for the games this weekend. Silva is a native of Gabon and had not seen his mom for three years. ... Ron Rothstein, the original Heat coach and now part of the team's broadcasting lineup, turned 77 on Friday.\n\nBUSY SATURDAY\n\nThe Heat and Pacers both play on Saturday, which will be one of the busiest days of the NBA season. There are 14 games on the schedule -- tying Nov. 27, Jan. 20 and April 5 as the days with the most games on this season's calendar. Charlotte and Oklahoma City are the only teams with Saturday off.\n\nHAPPY HOLIDAY-S\n\nIndiana is at New Orleans on Saturday, meaning Pacers guards Aaron Holiday and Justin Holiday will be facing off with Pelicans guard Jrue Holiday. If they all play, it will be the first time that the three brothers will be on the floor together for an NBA game. And if that wasn't enough of a family-ties twist, here's this: Pelicans assistant coach Jamelle McMillan is the son of Pacers coach Nate McMillan.\n\nUP NEXT\n\nPacers: Visit New Orleans on Saturday.\n\nHeat: Host Philadelphia on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995524.95236
}