{
  "game_id": "0021300910",
  "espn_id": "400489783",
  "date": "Mar 05, 2014",
  "matchup": "MIL vs. SAC",
  "headline": "Thomas lifts Kings past Bucks 116-102",
  "body": "MILWAUKEE --  So far, so good on the latest road trip for the Sacramento Kings.\n\nIsaiah Thomas scored 25 points and had six assists to lead the Kings to a 116-102 victory over the Milwaukee Bucks on Wednesday night.\n\nSacramento opened its season-high seven-game, 12-day road trip by shooting 52 percent (43-for-82) from the field.\n\n\"To start it off on a positive note is obviously the way that we prefer to start,\" Sacramento coach Michael Malone said. \"For us to come in here and beat the Bucks, who have been playing better as of late, is definitely a positive. Especially with how we played.\"\n\nRudy Gay added 22 points, seven rebounds and six assists, and DeMarcus Cousins had 21 points, 10 rebounds and five assists for the Kings, who won their ninth road game after finishing 8-33 away from home last season.\n\n\"The record doesn't show it, but we are a lot better team than we were in the past,\" Cousins said. \"We are continuing to grow with each game. Still a lot of work to do but we are on the right path.\"\n\nBrandon Knight finished with a team-high 25 points and six assists for Milwaukee, and Jeff Adrien added 15 points off the bench. The Bucks (12-48), who have the worst record in the NBA, were coming off their biggest win of the season, 114-88 over visiting Utah on Monday.\n\n\"You can't dwell on it too much,\" Knight said. \"In the moment, of course you want to win and play well. We might not be vying for a playoff position, but I think we're playing to build the right habits so that we can come into next season strong.\"\n\nMilwaukee was hoping to win consecutive games for the first time since last March 17 and 19, but the Bucks never led in the second half.\n\n\"That was our point of emphasis going into the game,\" Cousins said. \"We didn't need to be that team.\"\n\nSacramento, 3-1 in its last four away games after a seven-game road losing streak, got 10 straight points from Cousins to extend its lead to 74-55 midway through the third quarter.\n\nGay's basket to beat the third-quarter buzzer gave his team a 95-74 lead.\n\n\"We didn't play to the best of our ability,\" Knight said. \"From what I gathered, they scored a lot of easy baskets without any resistance. When you give an offensive team like that easy baskets, they just continue to take what you give them. They sense a little bit of weakness, and they take it.\"\n\nSacramento's biggest lead of the night was 108-83 after two free throws by Reggie Evans with 5:49 left in the fourth.\n\nThomas, who finished with at least 20 points for the eighth time in his last nine games, received a double technical and was ejected with 4:19 remaining.\n\n\"That is not cool at all,\" Thomas said. \"I am going to talk to the NBA about that. I don't have a reputation for getting technicals. I don't say anything disrespectful to anybody and for them to hit me with two straight technicals is just not cool at all. I am going to talk to the NBA about it and try to get that back because I've got two kids.\n\n\"I have never been kicked out of a game in my life.\"\n\nSacramento held a 61-48 advantage at halftime. The score was tied at 33 when the Kings used a 15-2 run to lead the rest of the way.\n\nThe stretch was capped with a four-point play as Thomas drilled a 3-pointer and Cousins added a free throw because of a loose ball foul on Zaza Pachulia, giving the Kings a 48-35 lead with 5:16 left in the second.\n\n\"Physically, they just had their way with us,\" Milwaukee coach Larry Drew said. \"We tried to do some things a little differently from a defensive standpoint, but nothing seemed to have an effect.\"\n\nGame notes Sacramento moved one game ahead of the Los Angeles Lakers for the battle of the worst record in the Western Conference. ... The Kings are 3-8 on the road against the Eastern Conference. ... Milwaukee's 7-25 home record is worst in the league. The team is also 2-21 against the Western Conference. ... Sacramento's Carl Landry, a Milwaukee native, missed his fourth straight game with a sore right knee. ... Milwaukee signed Tony Mitchell to a 10-day contract on Tuesday and he entered the game with 3:26 remaining.",
  "source": "espn_api",
  "crawled_at": 1764992740.7483242
}