{
  "game_id": "0022300435",
  "espn_id": "401585063",
  "date": "Dec 29, 2023",
  "matchup": "DEN vs. OKC",
  "headline": "Gilgeous-Alexander scores 40, Thunder snap Nuggets' 6-game win streak with 119-93 victory",
  "body": "DENVER -- — Shai Gilgeous-Alexander scored 40 points, 17 in the decisive third quarter, and the Oklahoma City Thunder overcame another efficient shooting game from Nikola Jokic to beat the Denver Nuggets 119-93 on Friday night.\n\n\r\n              Gilgeous-Alexander had 40 points or more for the fifth time this season and was four shy of his career best set last season. He was 14 of 20 from the field and made all 10 of his free-throw attempts.\n\n\r\n              “He was just cruising. He let the game come to him,” Thunder coach Mark Daigneault said. “It never seemed like he was forcing. Played the right way throughout, made the right passes, kept them honest. It’s kind of routine at this point but he played a great game.”\n\n\r\n              Oklahoma City has won three straight and eight of its last 10 to surge past Denver in the Northwest Division. The Nuggets, who had their six-game winning streak snapped, have lost just three home games this season and the last two have come against the Thunder.\n\n\r\n              Those are Denver’s only losses in the last 11 games.\n\n\r\n              “It’s not a fluke they won the championship,” Gilgeous-Alexander said. “They’re a really good team and we know that every night we play them. You get out of bed to play against teams like that knowing they’re at the level that you want to get to.”\n\n\r\n              Chet Holmgren scored the Thunder’s first 10 points of the game and finished with 24, was 4 of 4 from 3-point range, and had two blocks. He had eight blocked shots against the Nuggets on Dec. 16.\n\n\r\n              “He’s a threat on the court in so many ways and him drawing that attention only makes it easier for the guys around him, including myself,” Gilgeous-Alexander said.\n\n\r\n              Jokic, who finished with 19 points, made 9 of 10 shots and over the last two games he is 20 of 21 from the field. He made his first four shots Friday night until missing a short jumper with 1:57 left in the first quarter. He had made 16 straight field goals going back to Monday’s game against Golden State.\n\n\r\n              Jokic had 10 rebounds but committed seven turnovers, two shy of his career high.\n\n\r\n              “You’ve got to be clean with the ball, you can’t play in a crowd,” Nuggets coach Michael Malone said of the turnovers. “It’s something they do to most teams, but you’re not going to give yourself a chance to win when you allow them to play to their strength.”\n\n\r\n              The Thunder led by six at halftime and used a 19-4 run to go ahead 75-58 midway through the third quarter. Gilgeous-Alexander scored 11 points late in the period to put Oklahoma City ahead 88-68 heading into the fourth.\n\n\r\n              The Nuggets got within 93-78 on Reggie Jackson’s 3-pointer but Jalen Williams hit two from deep and Kenrich Williams another from behind the line to give the Thunder a 102-80 lead.\n\n\r\n              Denver made one last push but Holmgren’s fourth 3-pointer of the night made it 107-87 with 4:14 left.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host the Brooklyn Nets on Sunday night.\n\n\r\n              Nuggets: Host the Charlotte Hornets on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764996762.43084
}