{
  "game_id": "0021800030",
  "espn_id": "401070713",
  "date": "Oct 20, 2018",
  "matchup": "CHA @ MIA",
  "headline": "Walker scores 39, Hornets survive Heat rally 113-112",
  "body": "MIAMI --  Kemba Walker got a call, and the Charlotte Hornets got a win.\n\nWalker continued his red-hot start by scoring 39 points, including the game-winning free throw with a half-second left, and the Hornets wasted a 26-point second-half lead but still spoiled Dwyane Wade's final home opener by topping the Miami Heat 113-112 on Saturday night.\n\nWade scored with 12.3 seconds left to tie the game, and the Hornets gave the ball to Walker. He drove on Miami's Rodney McGruder, wound up on the ground and got the call from referee Scott Wall -- one the Heat argued to no avail.\n\n\"I just saw a little bit of a lane,\" Walker said. \"I thought I did a good job at getting the contact.\"\n\nWalker made the first free throw, intentionally missed the second and time expired before anyone could contain the rebound.\n\n\"This is a game, for sure, you want it to keep going,\" said Heat coach Erik Spoelstra, who thought McGruder defended Walker perfectly on the deciding play. \"It should have been decided in an overtime, if not more.\"\n\nMalik Monk scored 15 for Charlotte, and Marvin Williams added 13.\n\nWade led the Heat with 21 points. Goran Dragic scored 20, McGruder finished with 19 and Hassan Whiteside grabbed 15 rebounds for Miami.\n\n\"You just want the players to decide the games,\" Wade said. \"Our refs have the toughest job, I feel, of any refs in any sport. But two teams fight like that, you just want the players to decide it. It's tough. Obviously, we all were very angry about it.\"\n\nCharlotte was 12 for 20 from 3-point range in the first half, fueling its run to the huge lead. The Hornets then went 1 for 12 from beyond the arc in the third quarter, and missed their first three tries from deep in the fourth quarter before Monk rattled one down for a 103-97 lead with about 5 minutes left.\n\nBut it wasn't over, not by a long shot.\n\nWade made a pair of 3-pointers, then set up Whiteside for a basket that got the Heat within 107-105. Miami kept chipping away, getting within 111-110 on a drive by McGruder with 46 seconds left. After Michael Kidd-Gilchrist made one of two foul shots after getting fouled by Whiteside -- another call the Heat did not like -- Miami had the ball down two with 24.7 seconds left.\n\nWade tried a 3 for the lead and missed badly -- so badly that he knew where the rebound was going. He scooted in, got the board himself and laid it in for a tie with 12.3 seconds left to mark the first and only time that the Hornets didn't lead after halftime.\n\nThat's when the Hornets gave the ball to Walker for their final play, and he delivered.\n\n\"I was really proud of our group,\" Hornets coach James Borrego said.\n\nTIP-INS\n\nHornets: Charlotte had lost six straight against Miami. ... Walker got his 10,000th career point on a drive in the third quarter. \"You're talking about being in an elite class,\" Borrego said of the milestone. \"You've got to work. You've got to get better every single year. You can't relax.\"\n\nHeat: Miami's three games have been decided by margins of three points, one point and one point, each of them going down to the final second. ... Miami is 9-2 in home openers under Spoelstra. Both losses have come to Charlotte. ... The Heat outrebounded Charlotte 49-40, but saw their 16 turnovers converted into 25 points.\n\nSIZZLING WALKER\n\nWalker has 19 3-pointers already, the most by any NBA player through his team's first three games of any season. Walker also has 106 points through Charlotte's first three games. That's more than he's ever scored in his first four games of an NBA season -- he had 92 in his first four appearances of the 2016-17 season. \"They're like, `Kemba, keep shooting,\" Walker said of his coaches and teammates. \"That's what I'm going to keep on doing.\"\n\nONE LAST DANCE\n\nIt was the final home opener for Wade, who has dubbed this season \"one last dance.\" He and fellow 16-year veteran Udonis Haslem addressed the Miami crowd before the game. \"We want to thank each and every last one of you guys,\" Wade said.\n\nUP NEXT\n\nHornets: Visit Toronto on Monday.\n\nHeat: Host New York on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994889.696049
}