{
  "game_id": "0022200749",
  "espn_id": "401468904",
  "date": "Jan 28, 2023",
  "matchup": "LAL @ BOS",
  "headline": "Brown forces OT, Celtics snap skid by beating LA 125-121",
  "body": "BOSTON -- — Lakers guard Patrick Beverley grabbed a courtside camera in an effort to show referee Eric Lewis what everyone who'd watched the replay already knew: LeBron James was fouled on his missed layup at the end of regulation.\n\n\r\n              Instead of getting the call, Beverley drew a technical foul that gave Boston the lead to start overtime and the NBA-leading Celtics went on to beat Los Angeles 125-121 on Saturday night.\n\n\r\n              “The best player on Earth can’t get a call. It's amazing,” Lakers coach Darvin Ham said. “As much as you try not to put it on the officiating, it's becoming increasingly difficult.”\n\n\r\n              Jaylen Brown scored 37, completing a tying 3-point play with 4.1 seconds left in regulation and adding 11 more points in overtime to help the Celtics snap a three-game losing streak. Brown added nine rebounds, Jayson Tatum had 30 points and 11 rebounds, and Malcom Brogdon scored 15 of his 26 points in the second half of a seesaw game that had 19 lead changes — six in the fourth quarter — and 15 ties.\n\n\r\n              James had 41 points, nine rebounds and eight assists. But it was his missed layup at the end of regulation that enraged him on the court and left him simmering at his locker afterward.\n\n\r\n              “I don't understand. I don't understand what we're doing, and I watch basketball every single day,\" said James, who sat with a towel covering his head during overtime and barely looked up as he spoke from at his locker. \"I watch games every single day and I don't see it happening to nobody else. It's just weird.”\n\n\r\n              Anthony Davis had 16 points with 10 rebounds, coming off the bench for the second game in a row after missing 20 with a foot injury. Beverley scored 15, twice giving the Lakers the lead in the final minute of the fourth. But he also missed a foul shot that might have clinched it, and his technical gave the Celtics the lead to start overtime, and they never trailed again.\n\n\r\n              “At the end of the day, the players decided that game,” Brown said. “We made plays down the stretch; they made plays down the stretch. And I thought it was a good game. It was probably one of the greater games in our recent Lakers-Celtics matchup. And I’m happy we came out on top.”\n\n\r\n              With Celtics Hall of Famer Paul Pierce cheering his former team on from the sideline and the team’s broadcasters — Boston’s Cedric Maxwell and LA’s Mychal Thompson — talking trash on press row, the Celtics swept their longtime rivals in the two-game season series. There was a vocal contingent of Lakers fans making noise when the visitors opened an 11-point lead in the third quarter. But they were out-shouted by the locals when Tatum, who scored 15 in the third, including three 3-pointers, helped erase an 11-point deficit.\n\n\r\n              Beverley hit a 3-pointer to give the Lakers the lead with 52 seconds left and then, after Boston tied it, scored on a putback dunk that made it 104-102 with 19 seconds to play. But after Brown missed a 3, Beverley missed one of two free throws; Al Horford missed a 3, and Brown scored on the putback and picked up a delayed foul call. \n\n\r\n              “That was just the craziness of the game,” Brown said. “It looked like they might have missed a call on their end toward the end of the game. But that’s just life. They’ll be all right.”\n\n\r\n              One game after missing a pair of free throws with 8 seconds left in a one-point game against the Knicks, Brown hit this one to tie it 105-all with 4.1 seconds to play. The Celtics (36-15) have the NBA’s best record despite losing their previous three games. \n\n\r\n              TIP-INS\n\n\r\n              James is 116 points away from matching Kareem Abdul-Jabbar’s NBA record for career points, 38,387. … Pierce was wearing what appeared to be shamrock pajama pants. … Westbrook missed his first six shots, as the crowd taunted him to shoot, before finishing with 12 points on 4 of 14 shooting. … Brown picked up his fifth foul on the first possession of the fourth quarter. … The Celtics beat the Lakers 122-118 in LA on Dec. 13. Tatum scored 44 points. Davis had 37 points and 12 rebounds. James scored 33 with nine boards and nine assists. … The Celtics were without point guard Marcus Smart and big man Robert Williams III, who both have sprained ankles.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Brooklyn on Monday night.\n\n\r\n              Celtics: At Brooklyn on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995051.172451
}