{
  "game_id": "0022400178",
  "espn_id": "401704744",
  "date": "Nov 06, 2024",
  "matchup": "MIA @ PHX",
  "headline": "Durant scores 32 points and Suns rally from 15 down to beat Heat 115-112 for 6th in a row",
  "body": "PHOENIX -- — Kevin Durant scored 32 points, Jusuf Nurkic had 20 points and 18 rebounds, and the Phoenix Suns rallied from a 15-point deficit Wednesday night to defeat the Miami Heat 115-112 and extend their winning streak to six games.\n\n\r\n              The Suns trailed 79-64 in the third quarter but finished the period on a 15-3 run to cut the Heat’s lead to three.\n\n\r\n              Neither team could take control in the fourth, but Durant’s jumper from the free-throw line with 16 seconds to play gave Phoenix a four-point lead.\n\n\r\n              Devin Booker had 22 points and nine assists for Phoenix (7-1), which has won its last five games by six points or fewer. Booker made one of two free throws with 4.8 seconds to go, giving the Heat a chance, but Miami failed to get a shot off before time expired.\n\n\r\n              Grayson Allen scored 12 points and Tyus Jones matched Booker with nine assists for the Suns.\n\n\r\n              Tyler Herro led the Heat (3-4) with 28 points. Reserve forward Haywood Highsmith scored 19 and Jimmy Butler added 15. Bam Adebayo had 12 points and 12 rebounds.\n\n\r\n              Takeaways\r\n              Heat: Adebayo was just 5 of 21 from the field, and three of his baskets were dunks.\n\n\r\n              Suns: Committed 16 turnovers that led to 20 Miami points.\n\n\r\n              Key moment\r\n              Bradley Beal’s 3-pointer put the Suns ahead to stay at 106-103 with 3:52 to play. Beal didn’t score in the first half and was in foul trouble. He finished with seven points.\n\n\r\n              Key stat\r\n              The Suns’ 7-1 start matches the best in franchise history, equaling three previous seasons (1980-81, 2000-01, 2009-10).\n\n\r\n              Up next\r\n              Both teams are on the road Friday. Miami goes to Denver, while Phoenix plays at Dallas.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/nba",
  "source": "espn_api",
  "crawled_at": 1764996935.3297799
}