{
  "game_id": "0022200846",
  "espn_id": "401469001",
  "date": "Feb 11, 2023",
  "matchup": "BKN vs. PHI",
  "headline": "Embiid leads 76ers over Nets in Harden's return to Brooklyn",
  "body": "NEW YORK -- — Joel Embiid had 37 points and 13 rebounds, James Harden scored 29 points in his first game in Brooklyn since being traded a year ago to begin a Big Three breakup, and the Philadelphia 76ers beat the Nets 101-98 on Saturday night.\n\n\r\n              The 76ers got a victory instead of overtime when Spencer Dinwiddie's 3-pointer was ruled too late after a video review. \n\n\r\n              Harden added six rebounds and six assists after being booed in introductions and then early in the game. He arrived in January 2021 to play with Kevin Durant and Kyrie Irving, then asked out and was gone just 13 months later, swapped in a deal for Ben Simmons at last year's trade deadline.\n\n\r\n              Now Durant and Irving are also gone, traded this week.\n\n\r\n              “I don’t get caught up in homecomings or the outside distractions,” Harden said. “I think our focus was just to come here and win a game and we did a good job of that tonight.”\n\n\r\n              Mikal Bridges scored 23 points in his first game with the Nets, but missed a layup that would have given the Nets the lead with about 2 seconds left. Harden then made two free throws with 0.9 seconds to go, and Dinwiddie's shot after a timeout was too late.\n\n\r\n              The Nets started Bridges, Cam Johnson, Dinwiddie and Dorian Finney-Smith, the four players they acquired this week from Phoenix for Durant and Dallas for Irving. The Nets had the look of a tough defensive team that will miss the scoring of their All-Stars, managing only one basket in the last 6 1/2 minutes. \n\n\r\n              “We were getting good looks, just sometimes you can’t control,” Bridges said. “They look good and don’t go in.”\n\n\r\n              The Nets were ahead by nine midway through the fourth quarter before Embiid capped an 8-0 run with a basket that cut it to 96-95 with 3:55 remaining. The Sixers missed numerous chances to take the lead from there until Embiid grabbed the rebound of Harden's missed layup and was fouled going back up. His free throws gave Philadelphia the lead for good with 5.2 to play.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Jalen McDaniels, acquired from Charlotte at the deadline, had five points in 16 minutes. ... Harden will face a former team in the next game, too. The 76ers host Houston on Monday. \n\n\r\n              Nets: Seth Curry, who was also acquired in the Harden-Simmons swap, is sidelined with a left adductor strain. ... Simmons had four points and three rebounds. ... It was coach Jacque Vaughn's 48th birthday. \n\n\r\n              TWINS TRADED\n\n\r\n              “The Twins,” as Bridges and Johnson were nicknamed in Phoenix by former teammate Deandre Ayton because they did so much together, had plenty of time to think about moving to New York. Durant's initial trade request came last summer.\n\n\r\n              “There was a lot of jokes, especially in the summer when KD wanted to come here and we knew the pieces and who might be the ones that were going to go, and us two was the main two,” Bridges said. “And we joked around, we always said, ‘At least we got us, at least we got us,’ and it happened and that’s still to this day. It’s just like, at least I got my twin with me.”\n\n\r\n              BRIDGES ON THE BENCH\n\n\r\n              Bridges had played in all 365 possible games while with Phoenix, along with all 116 games at Villanova, before not being available Thursday night after the trade. \n\n\r\n              “He was shaking. He was like, ‘I’ve got to get out there, I've got to get out there,” said Johnson, who said he told Bridges to calm down.\n\n\r\n              But, Johnson then showed Bridges that he'd already played 56 games with the Suns and the Nets still had 37 remaining beginning Saturday, meaning he can actually play 83 games instead of 82.\n\n\r\n              “I'm trying to keep his spirits up,” Johnson said.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Houston on Monday.\n\n\r\n              Nets: At New York on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994861.318785
}