{
  "game_id": "401810030",
  "espn_id": "401810030",
  "date": "Nov 05, 2025",
  "matchup": "NY vs MIN",
  "headline": "Anunoby and Brunson help Knicks rout Timberwolves 137-114 in Anthony Edwards' return from injury",
  "body": "NEW YORK -- — OG Anunoby scored 25 points, Jalen Brunson had 23 points, 10 assists and seven rebounds, and the New York Knicks spoiled Anthony Edwards' return to the Minnesota Timberwolves' lineup with a 137-114 victory on Wednesday night.\n\n\r\n              Josh Hart added 18 points for the Knicks, who controlled the second half and improved to 5-0 at Madison Square Garden.\n\n\r\n              Edwards scored 15 points in 29 minutes after missing four games with a strained right hamstring, and the Wolves were outscored by 25 points when he was in the game.\n\n\r\n              There wasn't much the All-Star guard could have done to keep the game competitive. The Knicks outworked the Timberwolves, turning 21 offensive rebounds into 31 second-chance points, and outscored them 83-56 after trailing by four at halftime.\n\n\r\n              Julius Randle scored 32 points and Donte DiVincenzo had 21 in the arena that was their home before they were sent to Minnesota before last season in the deal that brought Karl-Anthony Towns to New York. Towns finished with 15 points and 10 rebounds.\n\n\r\n              Randle scored 18 points on 6-for-10 shooting in the first half. DiVincenzo, who set a Knicks record with 283 3-pointers in 2023-24, made four and scored 12 points as the Wolves led 58-54.\n\n\r\n              Brunson and Anunoby combined on a 10-0 run midway through the third quarter to give the Knicks a 76-67 lead. Edwards stopped the surge with a three-point play, his first basket since early in the second quarter. He made a 3-pointer a little more than a minute later, but the Wolves couldn't slow the Knicks' momentum.\n\n\r\n              Brunson's 3-pointer with 2 1/2 minutes left in the period capped a 21-9 run and give the Knicks an 87-76 lead. They outscored the Wolves 40-28 in the third and led 94-86 entering the final period. \n\n\r\n              Anunoby scored eight straight New York points early in the fourth and had 18 in the second half.\n\n\r\n              Up next\r\n              Timberwolves: Host Utah on Friday.\n\n\r\n              Knicks: Host Brooklyn on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042567.111274
}