{
  "game_id": "0022000450",
  "espn_id": "401267610",
  "date": "Feb 19, 2021",
  "matchup": "CHI @ PHI",
  "headline": "Embiid scores career-high 50 points to lead 76ers past Bulls",
  "body": "PHILADELPHIA -- — Joel Embiid was simply unstoppable.\n\n\r\n                    Embiid scored a career-high 50 points to lead the Philadelphia 76ers to a 112-105 victory over the Chicago Bulls on Friday night.\n\n\r\n                    Embiid added 17 rebounds, five assists, four blocks and two steals in a dominating performance at both ends of the court.\n\n\r\n                    “The only difference from this year and last year is about me being willing to dominate every single moment I’m on the floor on defense and on offense,” Embiid said.\n\n\r\n                    Tobias Harris had 22 points and 12 rebounds for the Eastern Conference-leading 76ers, who played without Ben Simmons (illness) for the second straight game and clinched coaching duties for Doc Rivers at the All-Star Game.\n\n\r\n                    Having Embiid, of course, has helped.\n\n\r\n                    “It’s good to have him on our side, I’ll tell you that,” Rivers said.\n\n\r\n                    Zach LaVine scored 30 points for the Bulls.\n\n\r\n                    With the 76ers clinging to a 107-103 lead, Embiid blocked LaVine’s driving attempt with 1:02 remaining, then hit a 17-foot baseline jumper with 41 seconds left. When the Bulls called timeout, Embiid jogged to center court and put both hands up as if requesting cheers from the empty seats while the speakers played artificial “M-V-P!” “M-V-P!” chants.\n\n\r\n                    “I play for the fans, and I play for the city,” Embiid said. “I always feel like they’re here with us even though they’re not.”\n\n\r\n                    The Bulls did fine when Embiid wasn’t in the game.\n\n\r\n                    With Embiid on the bench at the start of the fourth, the Bulls used a 10-2 run over the first 3 1/2 minutes to take an 89-87 lead after Ryan Arcidiacono stole an inbounds pass and converted a three-point play.\n\n\r\n                    Then Embiid returned and scored six points during a 7-0 spurt that made it 94-89. After hitting a 16-footer, he grabbed an offensive rebound and made both free throws after getting fouled and then pulled down another offensive board and scored on a follow on the next possession.\n\n\r\n                    “It really just feels like he’s unstoppable,” Philadelphia’s Matisse Thybulle said. “You start to think that maybe there’s no answer for him.”\n\n\r\n                    It was still a game, though, as LaVine and the Bulls were playing tough until Embiid clinched it with his defensive and offensive prowess.\n\n\r\n                    “Overall I thought the guys really competed, battled and hung in there,” Bulls coach Billy Donovan said.\n\n\r\n                    Voted an All-Star for the fourth consecutive season on Thursday, Embiid scored 25 first-half points in a variety of ways, seemingly however he wanted.\n\n\r\n                    “I’ve been adding a lot to my game and it’s been working well,” he said.\n\n\r\n                    Embiid put an exclamation point on the half with 33 seconds remaining before the break by dribbling from Philadelphia’s free throw line, deking past Wendell Carter Jr. in the Bulls’ paint, scoring and getting fouled -- an amazing show of athleticism from the 7-foot-2 big man.\n\n\r\n                    Then, during one 29-second stretch in the third quarter, Embiid hit a 3-pointer, stole Thad Young’s pass and then assisted Tyrese Maxey’s fast-break layup. Maxey’s bucket gave Philadelphia its largest lead, 83-73 with 1:59 left in the third.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Arcidiacono, who played collegiately at nearby Villanova, had 10 points and four assists. … Have lost six in a row in Philadelphia. … Mo Cheeks, whose retired No. 10 76ers jersey hangs in the rafters in Philadelphia, is an assistant for the Bulls.\n\n\r\n                    76ers: Shake Milton (ankle) missed his fifth straight game, but Rivers said before the contest that he expects Milton to return on Sunday. … Improved to 13-2 at home. … Embiid’s previous career high was 49 points.\n\n\r\n                    BIRDIES OVER BASKETS\n\n\r\n                    The victory gave Philadelphia the best record in the Eastern Conference through games played Feb. 21. That made Rivers the coach of the team captained by Kevin Durant, the leading vote-getter in the East.\n\n\r\n                    While acknowledging prior to the contest that it would be an honor to coach in the All-Star Game, Rivers said his preference would be to play golf over the All-Star break. Instead of tabbing the coach of the team with the best record to lead the All-Stars, Rivers jokingly said that person should get to choose among his colleagues who would be the coach. Asked whom he would select, Rivers said he’d choose Spurs coach Gregg Popovich.\n\n\r\n                    LAVINE LOVE\n\n\r\n                    All-Star reserves will be announced on Tuesday, and Donovan thinks LaVine belongs on the list. He entered sixth in the NBA with 28.5 points per game.\n\n\r\n                    “He’s played at the level of an All-Star caliber player,” Donovan said. “He’s had an incredible year.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host Sacramento on Saturday night.\n\n\r\n                    76ers: Travel to Florida to play the Raptors at their temporary home for two consecutive games, on Sunday and Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764997595.781072
}