{
  "game_id": "0022100911",
  "espn_id": "401360730",
  "date": "Feb 26, 2022",
  "matchup": "SAC @ DEN",
  "headline": "Jokic's triple-double leads Nuggets over Kings, 115-110",
  "body": "DENVER -- — Monte Morris hit a tiebreaking 3-pointer with 28 seconds left, Nikola Jokic had 18 points, 11 assists and 10 rebounds, and the Denver Nuggets beat the Sacramento Kings 115-110 on Saturday night.\n\n\r\n              It was Jokic’s 16th triple-double of the season and the 73rd of his career. His rebound with 19 seconds remaining finished the triple-double and helped Denver to its second win over the Kings in three nights.\n\n\r\n              He spent most of the night battling Domantas Sabonis, who finished with 14 points and 16 rebounds.\n\n\r\n              “I thought Domas did a good job of just staying down, not biting on the pump fakes,” Kings interim coach Alvin Gentry said of the defense on Jokic. “That’s all you can ask him to do. It’s tough to play him. They go to him so much and he puts so much pressure on you.”\n\n\r\n              The Nuggets have won five in a row and moved to 10 games above .500 for the first time this season.\n\n\r\n              “We’re in a good place. We’re 7-1 in our last eight games with some really impressive wins, on the road at Toronto, on the road at Golden State,” Denver coach Michael Malone said. “We’re not satisfied by any means.”\n\n\r\n              De’Aaron Fox had 26 points and 10 assists for Sacramento, which has lost four in a row. Harrison Barnes scored 24 points.\n\n\r\n              “There’s no moral victories,” Barnes said. “We want to win these games and that’s what we’re coming out expecting to do.”\n\n\r\n              The Nuggets trailed by seven late in the third quarter but put together an 18-1 run spanning the third and fourth quarters to lead 94-85. Sacramento scored 10 straight to go up by one, and the teams traded leads over the last 7 1/2 minutes.\n\n\r\n              Aaron Gordon, who had 23 points and nine rebounds, hit a 3-pointer to put Denver ahead 105-104. The Kings rallied to tie it twice before Morris drained the go-ahead basket from the top of the arc. Sabonis missed a layup and Jokic made two free throws with 15 seconds left.\n\n\r\n              ”(Morris) and Nikola playing the two-man game and Fox went under (the screen) three times, basically daring him to take the shot,” Malone said.\n\n\r\n              Morris said he has asked opposing players how the league defends him and he used that knowledge to his advantage.\n\n\r\n              I’m cool with a lot of guys in the NBA and I always ask them after games or if we go out to dinner, just to keep me out of the paint and try to force me to make the play instead of getting the ball to (Jokic),” said Morris, who finished with 21 points. “They’re always trying to get under, make me make a play. \n\n\r\n              “I work on that shot a lot and just having confidence to take it and make it for my team is big.”\n\n\r\n              TIP-INS\n\n\r\n              Kings: C Richaun Holmes (back) missed his second straight game. ... Sacramento swept three games from the Nuggets last season but has lost the first three against them this season. The teams play one more time, March 9 in Sacramento.\n\n\r\n              Nuggets: C Zeke Nnaji (hamstring/knee soreness) missed his fifth game in a row. ... Will Barton moved within one of J.R. Smith for the franchise record in made 3-pointers. He was 3 for 8 behind the line and ended the night with 767 with Denver.\n\n\r\n              CONCERN FOR UKRAINE\n\n\r\n              Gentry said the team is supporting center Alex Len, whose homeland of Ukraine was invaded by Russia this week. Len and Toronto’s Svi Mykhailiuk are the only two Ukrainian players in the NBA.\n\n\r\n              “He’s very much concerned,” Gentry said of Len. “As things escalate over there, you just have no idea what’s going on and communication has gotten that much more difficult. I just make sure he knows we’re thinking about him and we’re concerned about his family.”\n\n\r\n              FULL-TIME GIG\n\n\r\n              The Nuggets on Friday signed center DeMarcus Cousins for the remainder of the season after he played under three separate 10-day contracts with the team.\n\n\r\n              Cousins had nine points and a technical Saturday.\n\n\r\n              “I was just happy for him. It has not been an easy journey,” Malone said. “It’s not just a feel-good moment, he’s helping us. He isn’t on the bench waving a towel, he’s giving us something we need.”\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Oklahoma City on Monday night.\n\n\r\n              Nuggets: At the Portland Trail Blazers on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764993891.376153
}