{
  "game_id": "0022000040",
  "espn_id": "401267200",
  "date": "Dec 27, 2020",
  "matchup": "LAL vs. MIN",
  "headline": "Kuzma leads AD-less Lakers' 127-91 thrashing of Timberwolves",
  "body": "LOS ANGELES -- — Kyle Kuzma scored 20 points in the first half while starting in Anthony Davis' place, and LeBron James added 18 points in the Los Angeles Lakers' 127-91 victory over the Minnesota Timberwolves on Sunday night.\n\n\r\n                    Star big men Davis and Karl-Anthony Towns sat out. Davis has a bruised calf that isn't expected to be a long-term problem, while Minnesota's Towns has a more serious dislocated left wrist.\n\n\r\n                    Kuzma had a phenomenal opening half in his first start since agreeing to a three-year, $40 million contract extension with the NBA champions. He hit three consecutive 3-pointers to open the scoring in a wire-to-wire win for Los Angeles, which led by 20 in the first quarter and 36 in the third.\n\n\r\n                    Lakers coach Frank Vogel believes Kuzma's overall game evolved last season when he moved into a supporting role with Davis' arrival.\n\n\r\n                    “It’s not really about scoring,” Kuzma said. “I just try to impact the game and take shots when I have them, and that’s made me a better player. ... I just try to seize the moment. In a season like this, playing back-to-backs, the coach and the organization being conservative with LeBron and AD allows me to have those nights when I can show what I work on every day.”\n\n\r\n                    Marc Gasol had 12 points, eight assists and seven rebounds in just 21 minutes for the Lakers, who spaced the floor and moved the ball superbly with 32 assists.\n\n\r\n                    “Marc sees the game very similar to how I see it,” James said. “We’ve got guys that can make the right play, make the right pass. You saw some unbelievable passes tonight from Kuz, from (Alex Caruso). The list goes on and on. Nobody should ever feel pressured to take a bad shot because we can always move the ball.”\n\n\r\n                    No. 1 pick Anthony Edwards had 15 points on 6-of-21 shooting in the Timberwolves' first loss of the season. Minnesota missed its first 12 3-point attempts while falling behind by 23 early in the second quarter.\n\n\r\n                    “I thought we didn't play our brand of basketball at all,” Minnesota coach Ryan Saunders said. “There were a lot of things I didn’t like tonight, so we’ll dive into the film. We’ve got a good locker room there. We’ve got guys who want to do the right thing. They feel the same way, I’m sure.”\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Jaden McDaniels scored his first NBA points on a pair of 3-pointers in the fourth quarter. ... Josh Okogie went to the locker room in the second quarter. The team said it was cramping. ... Towns was examined Sunday in Los Angeles. He won't require surgery, but will be evaluated weekly.\n\n\r\n                    Lakers: James rolled his left ankle in the first half for the second time in a week, but stayed in the game. He is questionable for Monday. ... Caruso strained a hand muscle.\n\n\r\n                    LBJ'S DIGITS\n\n\r\n                    James tied Kevin Garnett for fourth place in NBA history by scoring at least 10 points for the 1,260th time.\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: At Clippers on Tuesday.\n\n\r\n                    Lakers: Host Portland on Monday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997336.645371
}