{
  "game_id": "401809806",
  "espn_id": "401809806",
  "date": "Nov 26, 2025",
  "matchup": "OKC vs MIN",
  "headline": "Shai Gilgeous-Alexander scores 40 points while ill, leads Thunder to 10th straight win",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 40 points despite being ill and the Oklahoma City Thunder beat the Minnesota Timberwolves 113-105 on Wednesday night in an NBA Cup Game.\n\n\r\n              Gilgeous-Alexander, who was listed as questionable on the injury report, made 12 of 19 field goals and 15 of 17 free throws. \n\n\r\n              Oklahoma City won its 10th straight and became just the fifth team in NBA history to start a season 18-1. The Thunder improved to 4-0 in West Group A and are well-positioned to reach the knockout round.\n\n\r\n              Gilgeous-Alexander has scored at least 20 points in 91 consecutive games, the third-longest streak in NBA history behind two streaks by Wilt Chamberlain. Gilgeous-Alexander can match Chamberlain’s second-place run of 92 straight on Friday against Phoenix.\n\n\r\n              Anthony Edwards had 31 points and eight rebounds and kept the Timberwolves in the game by making several difficult shots, but couldn't stop Minnesota from losing its third straight. Minnesota made just 22 of 37 free throws.\n\n\r\n              It was a rematch of the Western Conference finals series last season that the Thunder won 4-1. Last time the Timberwolves visited the Paycom Center, they got beat 124-94 in Game 5 as the Thunder clinched the West.\n\n\r\n              Oklahoma City’s Kenrich Williams, who had not played this season because of a left knee injury, got his first action in the first quarter.\n\n\r\n              The Thunder led 24-17 at the end of the opening quarter. It was Minnesota’s second-lowest point total in any quarter this season.\n\n\r\n              Gilgeous-Alexander scored 19 points in the first half to help the Thunder take a 49-39 lead. \n\n\r\n              Minnesota rallied in the third quarter and tied it at 54 and again at 56, but the Thunder took a 78-71 lead into the fourth.\n\n\r\n              Minnesota was within one in the final minute after Edwards made a contested 3-pointer, but Chet Holmgren's corner three put the Thunder up four with 38 seconds remaining. Oklahoma City outscored Minnesota 8-1 in the last 60 seconds.\n\n\r\n              Up next\r\n              Timberwolves: Host Boston on Saturday.\n\n\r\n              Thunder: Host Phoenix on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042700.905691
}