{
  "game_id": "0022200054",
  "espn_id": "401468209",
  "date": "Oct 25, 2022",
  "matchup": "LAC @ OKC",
  "headline": "Gilgeous-Alexander's 33 help OKC top short-handed Clippers",
  "body": "OKLAHOMA CITY -- — There was no celebration for the Oklahoma City Thunder after earning their first win of the season in four tries. \n\n\r\n              Shai Gilgeous-Alexander scored 33 points and the Thunder defeated the short-handed Los Angeles Clippers 108-94 on Tuesday night.\n\n\r\n              Oklahoma City coach Mark Daigneault said the players are more concerned with process than results as the young roster evolves. He said his team is “robotic” about feedback.\n\n\r\n              “We just try to create like, an extremely ruthless consistency with our approach and just trust that if we do that, the guys will improve, the players will grow as they gain experience, things will slow down, their bodies will get stronger,” he said. \"And we just trust in that deal.” \n\n\r\n              The Clippers were without their two biggest stars. Kawhi Leonard sat out to rest his right knee and Paul George missed the game with an illness. Another starter, Marcus Morris, was out for personal reasons. Oklahoma City took advantage by holding the Clippers to 42% shooting.\n\n\r\n              “I didn’t fault our effort,” coach Tyronn Lue said. “I thought we did some good things, but we’ve just got to continue to keep getting better. When you’re short-handed like that, the small things mean a lot. When you’re missing Kawhi, PG & Marcus, all the small things add up.”\n\n\r\n              Luke Kennard scored 15 points and Ivica Zubac had 10 points and 14 rebounds for the Clippers.\n\n\r\n              Gilgeous-Alexander played after sitting out Sunday against Minnesota with a bruised left hip. He said he felt pretty good Monday, but felt “extremely good” on Tuesday after treatment. He showed just how good by making 11 of 22 field goals and 9 of 9 free throws with eight assists.\n\n\r\n              Daigneault said Gilgeous-Alexander has developed a great sense of how to attack defenses.\n\n\r\n              “I don’t tell him anything, to be honest with you, other than process-oriented stuff. ... With guys that have great instincts, you can overcoach them and really mess them up,\" Daigneault said. “So I let him make those decisions.” \n\n\r\n              Tre Mann scored 16 of his 25 points in the first half and Gilgeous-Alexander added 14 to help Oklahoma City take a 49-43 lead at halftime.\n\n\r\n              The Thunder pulled away for good with a 21-0 run in the third quarter. \n\n\r\n              “We had that?\" Mann said. ”That's crazy.\"\n\n\r\n              Gilgeous-Alexander had eight points and two assists during the surge.\n\n\r\n              The Clippers didn't have a player reach double-figure points until Robert Covington made a 3-pointer with 3:20 left in the third quarter to get to 10.\n\n\r\n              Gilgeous-Alexander attempted 19 shots before taking a 3-pointer. He finally took one, and his bucket from straight away as the third quarter expired gave Oklahoma City an 84-68 lead.\n\n\r\n              BIG NUMBERS\n\n\r\n              Gilgeous-Alexander is averaging 31 points through his first three games, but how he’s doing it is as impressive as the total numbers.\n\n\r\n              He’s shooting 49% from the field and 39% from 3-point range. He’s averaging 6.7 assists. He’s made all 20 of his free throws and has seven steals and five blocks.\n\n\r\n              He has scored at least 30 points in 12 of his past 16 games going back to last season.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Shot 37.8% from the field in the first half. ... Former Thunder player Reggie Jackson scored nine points on 4-for-17 shooting. ... Kennard was called for a technical with 3:39 remaining. ... Zubac was the only Clippers starter to score in double figures.\n\n\r\n              Thunder: G Josh Giddey sat out with a sprained right ankle. ... Missed their first 10 3-pointers and made just 4 of 30 overall. ... G Lu Dort scored four points on 1-for-11 shooting. ... Took 110 shots to 83 for Los Angeles and outrebounded the Clippers 60-47. ... F Aaron Wiggins had 11 points and 10 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              The Thunder host the Clippers again on Thursday.\n\n\r\n              ------\n\n\r\n              Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995000.152684
}