{
  "game_id": "0021300840",
  "espn_id": "400489713",
  "date": "Feb 23, 2014",
  "matchup": "POR vs. MIN",
  "headline": "Damian Lillard scores 32 as Blazers rally to top Timberwolves",
  "body": "PORTLAND, Ore. -- Thomas Robinson got it started when he blocked a shot by Corey Brewer. Victor Claver then grabbed the rebound for Portland, leading to Will Barton's dunk on the other end.\nThe fourth-quarter sequence put the crowd on its feet, and the Trail Blazers went on to a 108-97 victory over the Minnesota Timberwolves on Sunday night.\n\"Adrenaline shot through me, I was hyped,\" said Robinson, who had 14 points and a career-high 18 rebounds, providing a spark in the absence of injured All-Star LaMarcus Aldridge. \"I probably said a lot of stuff I don't remember.\"\nBarton's jam gave Portland a 92-83 lead.\n\"It was pandemonium,\" he said.\nDamian Lillard had 32 points for the Blazers, who won their second straight after a three-game slump.\nKevin Love scored 31 for Minnesota, which had won three in a row. It was Love's franchise-best fifth straight game with 30 or more points.\nAfter trailing by as many as 18 points in the first half, Nicolas Batum's fast-break layup gave Portland an 84-80 lead going into the fourth quarter. Claver dunked to extend the lead to 88-80.\nAfter the game-changing sequence from Robinson, Claver and Barton, Lillard's 3-pointer made it 105-91 with 4:14 left, and Timberwolves coach Rick Adelman took Love out with 3:36 to go.\n\"Guys came in and really picked up the energy and brought a lot to the game today,\" Lillard said. \"When we got back to the locker room we were calling (Robinson) `Thomas Aldridge.' He was huge.\"\nThe Timberwolves were coming off a 121-104 victory at Utah on Saturday night. Love led the way with 37 points, 12 rebounds and 10 assists for his first career triple-double.\nLove presented a significant matchup problem for the Blazers with Aldridge sidelined by a left groin strain. Aldridge, who averages a team-high 23.9 points and 11.4 rebounds, is expected to be re-evaluated in the next few days.\n\"This is a good team, even with LaMarcus out,\" said Love, who also had 10 rebounds for his league-leading 47th double-double. \"They're good, they can put up points in a hurry. They shot the ball well and this is one of the best, if not the best, crowds in the league.\"\nAldridge wasn't the only Blazer hurting: The team was also without forward Joel Freeland because of a right knee sprain and center Meyers Leonard because of a left ankle sprain.\nThe Timberwolves continued to miss center Nikola Pekovic because of a sore right ankle and Kevin Martin because of a fractured bone in his left thumb.\n\"A night like tonight hurts a lot,\" Love said. \"It's a reminder to us that we need all our guys back. We need our depth. Even without LaMarcus, we needed all our guys tonight.\"\nLove got off to a fast start with seven points as the Timberwolves built an early 18-9 lead. By the end of the opening quarter, Love had 13. Minnesota extended the lead to 43-28 early in the second quarter on Shabazz Muhammad's short jumper.\nThe Timberwolves stretched the lead to 52-34 after a short jumper and a pair of free throws from J.J. Barea.\nPortland then got back into the game with an 18-8 run capped by Robinson's two layups and Nicolas Batum's 3-pointer, closing the gap to 60-52 at the half.\nA pair of 3-pointers from Lillard and Batum put Portland in front 74-73. It was short-lived and Love drained a 3 to give Minnesota an 80-76 lead before the Blazers' furious fourth-quarter surge.\nPortland was coming off a 102-94 victory over the Jazz on Friday night. Lillard had 28 points, including 14 in the fourth quarter.\nGame notes\nLove is from Lake Oswego, just outside of Portland. ... Adelman coached the Blazers from 1989-94, guiding the team to two Western Conference titles. ... Love has at least 25 points and 10 rebounds in 10 straight games, the longest run of 25-10 games since Shaquille O'Neal had 13 in a row in 2001.",
  "source": "espn_api",
  "crawled_at": 1764992960.643072
}