{
  "game_id": "0022200354",
  "espn_id": "401468509",
  "date": "Dec 05, 2022",
  "matchup": "ATL vs. OKC",
  "headline": "Gilgeous-Alexander scores 35 as Thunder rally past Hawks",
  "body": "ATLANTA -- — Shai Gilgeous-Alexander scored 35 points, Josh Giddey had 12 of his 17 points in the final period, and the Oklahoma City Thunder overcame a 14-point deficit in the third quarter to beat the Atlanta Hawks 121-114 on Monday night.\n\n\r\n              Dejounte Murray finished with 24 points and Trae Young had 23 points and 10 assists for the Hawks (13-11), who have squandered six double-digit leads this season. They began the night tied for second-most in the NBA in that category.\n\n\r\n              In winning its third straight, Oklahoma City (11-13) has outscored its last three opponents 106-68 in the fourth. The Thunder trailed 88-84 entering the final period.\n\n\r\n              “It was an up and down game for us for sure, but when it really mattered it was a good gut check for us tonight,\" Gilgeous-Alexander said. “Kind of midway through the third to end the third and to start the fourth we were really good again. That won us the game.\" \n\n\r\n              Giddey’s three-point play early in the fourth made it 91-90 for the Thunder’s first lead since late in the first. They never trailed again as Gilgeous-Alexander, the league’s third-leading scorer, kept hitting free throws down the stretch. He scored 12 points in the fourth and finished 15 for 15 from the foul line, all in the second half.\n\n\r\n              “Try to be aggressive, I try not to seek them too much, just play aggressive basketball and then when the opportunity presents itself I like to get there,\" Gilgeous-Alexander said. “Unfortunately I didn’t get there in the first half and I knew that going into halftime that I was going to try to get there in the second half for sure.\"\n\n\r\n              Oklahoma City went on a 23-8 run over an eight-minute span until the 2:53 mark of the fourth, putting too much distance for the Hawks to overcome. Gilgeous-Alexander hit a pair of free throws to make it 111-103 with 1:04 remaining to all but finish off Atlanta.\n\n\r\n              “I thought they were able to break down our defense early in the game and forced the defense to collapse and they had their kick-outs,\" Hawks coach Nate McMillan said. “They established the tempo that they wanted to play and with that and our help in the turnovers and outworking us on the glass, it’s going to be tough to beat them.\"\n\n\r\n              Young threw a backward pass over his right shoulder to feed Murray for a dunk that made it 63-54 early in the third, and Oklahoma City called timeout. A.J. Griffin later followed with a 3 that put the Hawks up 66-56, and Atlanta pushed the lead to 14 before the Thunder went on a 17-6 run to close within two on a pair of free throws by Gilgeous-Alexander.\n\n\r\n              Young was 0 for 5 from the field before his baseline runner gave Atlanta a 56-52 lead in the final minute before halftime. The Hawks were ahead 59-54 at intermission.\n\n\r\n              “The good thing about our team is we don’t give in,\" Giddey said. “We play through it. When things get tough, we come together.\"\n\n\r\n              TIP-INS\n\n\r\n              Thunder: Coach Mark Daigneault said swingman Kenrich Williams, who missed the game with a right knee sprain, isn’t expected to be sidelined for long. ... Jalen Williams started instead F Aleksej Pokusevski and had 12 points in 31 minutes. ... The Thunder won in Atlanta for the first time since March 2018.\n\n\r\n              Hawks: Prior to the game, longtime TV announcer Bob Rathbun briefly lost consciousness on the court and was treated for dehydration. He was listed as stable, responsive and heading to a nearby hospital for further evaluation. ... Griffin has connected on at least one 3 in nine straight games, the longest such active streak among NBA rookies. \n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Memphis on Wednesday.\n\n\r\n              Hawks: At New York Knicks on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994842.771946
}