{
  "game_id": "0021601067",
  "espn_id": "400900462",
  "date": "Mar 23, 2017",
  "matchup": "PHX @ BKN",
  "headline": "Nets beat Suns 126-98 for 1st two-game win streak of season",
  "body": "NEW YORK -- The Brooklyn Nets finally have a winning streak.\nBrook Lopez scored 19 points, K.J. McDaniels had a season-high 16 and the Nets beat the Phoenix Suns 126-98 on Thursday night to give them consecutive victories for the first time this season.\n\"I think for us, on the outside looking in it's like, `Man, that's pretty sad,\" guard Jeremy Lin said. \"I guess it is. But on the inside, we'll take every step in the right direction, we'll continue to take and appreciate it and be grateful for it. I think what's happening right now is we are raising our standards slowly.\"\nTrevor Booker added 14 points for the league-worst Nets (15-56), who beat Detroit on Tuesday. They are 6-9 since the All-Star break -- not bad considering that started with an eight-game road trip.\nThe Nets scored a season-high 81 bench points in the first game in their NBA history where they had six reserves in double figures, according to information provided to the team by the Elias Sports Bureau.\n\"I thought our bench was just so big tonight,\" Lopez said. \"They came in and played superb and got us back in the game. I think they were the difference maker tonight.\"\nDevin Booker scored 28 points and Marquese Chriss had 23 points and 11 rebounds for the Suns. Alex Len had 11 points and 11 rebounds.\nBrooklyn took a commanding 84-65 lead into the fourth quarter as Lopez scored 12 points in the third quarter. Brooklyn held Phoenix to 15 points, the fewest points the Nets have allowed in the third quarter this season.\nPhoenix opened the game with a 17-4 run and led 32-22 after the first quarter.\nNets coach Kenny Atkinson felt things changed after a timeout in the period.\n\"We got completely out of rhythm, completely out of sorts, and then we took the timeout and I kind of had to -- wake-up call, let's put it that way, a stern wake-up call,\" Atkinson said. \"Pens were flying and clipboards were flying and sometimes you've got to do that.\"\nBrooklyn turned the tide in the second quarter and took a 52-50 lead into the halftime.\nLin, back from a sprained right ankle, led Brooklyn with 11 points in the half while Booker led Phoenix with 20 points.\nTIP-INS\nSuns: Coach Earl Watson compared Chriss to Russell Westbrook. \"His personality reminds me a lot of Russell Westbrook. I put that together the first five minutes we had a conversation during the pre-draft workout. If you watch him play, he would be misunderstood and you'd think he's not a nice person. He's out there to compete. He doesn't care who likes him and we're happy his technicals have calmed down.\" ... T.J. Warren (left foot contusion), Ronnie Price (lower left leg contusion), Dragan Bender (right ankle surgery), Eric Bledsoe (rest), Tyson Chandler (rest) and Brandon Knight (rest) were all out.\nNets: Several players that are on non-guaranteed contracts beyond this season have impressed Atkinson. \"I think we have guys that are fighting to prove they belong here and that's healthy. Quincy Acy comes right off the top of my head, Archie (Goodwin) the other night. I think Spencer Dinwiddie. These guys are fighting for playing time, fighting to go into the offseason on a positive note, fighting to continue to be a Net.\" ... Joe Harris (sprained left shoulder) and Sean Kilpatrick (strained left hamstring) were out.\nBENCH BUNCH\nBesides McDaniels and Booker, the other reserves in double figures for the Nets were Goodwin (12), Acy (12), Isaiah Whitehead (11) and Justin Hamilton (10).\nUP NEXT\nSuns: Visit Boston on Friday, which will be the fourth game of a six-game road trip.\nNets: Visit Washington on Friday, which marks the first game facing Bojan Bogdanovic since trading him to the Wizards.",
  "source": "espn_api",
  "crawled_at": 1764995947.82245
}