{
  "game_id": "0022000790",
  "espn_id": "401307583",
  "date": "Apr 09, 2021",
  "matchup": "IND @ ORL",
  "headline": "Holiday, Sabonis lead Pacers past Magic, 111-106",
  "body": "ORLANDO, Fla. -- — Indiana Pacers shooting guard Aaron Holiday might want to get used to being a top scoring option off the bench after the way he consistently shot in the last few games.\n\n\r\n                    Holiday scored 20 points and Domantas Sabonis added 16 points, 15 rebounds and six assists in his return from a three-game injury absence to help Indiana hold off the Orlando Magic 111-106 on Friday night. \n\n\r\n                    Holiday made six of Indiana’s 11 3-pointers, two nights after scoring a season-best 22 points in a victory over Minnesota. He made his first four attempts from beyond the arc, giving him nine consecutive 3-point makes dating to April 3 against San Antonio. He finished 6 of 10 from beyond the arc Friday.\n\n\r\n                    “I’m not used to having great games, but I’m used to shooting the ball and making buckets, and I hold myself to a high standard,” said Holiday, who has made 13 of his last 19 3-point shots. “When I’m really mad is when I have really bad games. I had four turnovers today and that was just me making dumb plays.”\n\n\r\n                    Sabonis, who played for the first time since April 2 because of a sprained left ankle, did most of his damage in the first half when he compiled 11 points, 12 rebounds and five assists.\n\n\r\n                    Doug McDermott made 8 of 13 shots and added 19 points off Indiana’s bench. The Pacers improved to 15-12 on the road and 20-6 when leading after three quarters.\n\n\r\n                    “We’re getting guys back, we moved the ball nicely and we’re sharing it really well,” Indiana coach Nate Bjorkgren said. “We’re getting big contributions from our bench. That overall readiness is what I’d like to see continue.”\n\n\r\n                    After seeing a lead once as large as 15 points shrink to three in the third quarter, the Pacers opened the fourth quarter with a 16-6 run to push the advantage back to 10.\n\n\r\n                    Orlando guard Terrence Ross sent a scare into the Pacers by scoring 10 of his 24 points in the fourth quarter.\n\n\r\n                    Ross converted two thunderous dunks seconds apart in the final period to draw the Magic to 108-104. After Malcom Brogdon’s free throw pushed Indiana’s lead back to five, James Ennis III made two free throws to get the Magic to 109-106 with 14.9 seconds remaining. T.J. McConnell sealed it with two free throws with 8.7 seconds remaining.\n\n\r\n                    Brogdon returned after missing the previous four games with a right hip injury. He had 11 points, missing all five of his 3-point shots. \n\n\r\n                    Mo Bamba had 14 points and six rebounds for the Magic.\n\n\r\n                    “I’m definitely trending up, but I’ve got to be tougher on myself,” said Bamba, who blocked three shots.\n\n\r\n                    GARY’S GAINS\n\n\r\n                    Gary Harris, one of the centerpiece players in Orlando’s trade with Denver at the deal deadline, said he sees a lot of similarities with this Magic team and the Nuggets’ squad he played on early in his career.\n\n\r\n                    “When I first got to Denver we were in a rebuilding period and we were able to grow and get our principles, get our core together and we were able to become a championship-contending team,” he said. “This (Orlando) team has all those qualities. We have some very talented guys. This can be a really good team.”\n\n\r\n                    Harris played on Friday for the first time since Feb. 17 because of an adductor strain. He had eight points. \n\n\r\n                    TIP INS\n\n\r\n                    Pacers: Indiana was without center Myles Turner for a second straight game because of a left ankle sprain. Turner leads the NBA in blocked shots (3.5 per game). … McDermott scored 11 points in his first six minutes. He made his first five shots. … Sabonis grabbed at least 15 rebounds for an eighth time this season.\n\n\r\n                    Magic: The Magic created more playing time for Bamba on Thursday by waiving reserve center Khem Birch. … Chuma Okeke, who averaged a team-best 16.1 points in the first six games following the trade deadline, went scoreless in the first quarter for a second straight game. He didn’t make his first field goal until the first minute of the second half. \n\n\r\n                    UP NEXT\n\n\r\n                    Pacers: At Memphis on Sunday night.\n\n\r\n                    Magic: Host Milwaukee on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764997127.115444
}