{
  "game_id": "0021800171",
  "espn_id": "401070852",
  "date": "Nov 09, 2018",
  "matchup": "BKN @ DEN",
  "headline": "Caris LeVert hits floater to lift Nets past Nuggets, 112-110",
  "body": "DENVER --  Brooklyn coach Kenny Atkinson didn't want Denver to have a chance to win with a last-second shot. Caris LeVert made sure the Nuggets didn't have an opportunity to win in overtime, either.\n\nLeVert hit a floater in the lane with 0.3 seconds left, and the Brooklyn Nets scored the last six points of the game to beat the Nuggets 112-110 on Friday night.\n\n\"To have the ball and everybody get out of the way, that's a great feeling to have as a player,\" LeVert said. \"That's what you dream about as a kid.\"\n\nAtkinson put the ball in his hands and let the former Michigan star go to work.\n\n\"We wanted the last shot. We didn't want to mess around with them having 4 seconds or 3 seconds so the fact that we left them with 0.3 is what we wanted,\" Atkinson said. \"That's the best way to control it. It's an (isolation) but, heck, that's what the kid's good at. They pressured him, he got by and made a heck of a shot.\"\n\nThe Nets overcame a big bounce-back night from Denver's Nikola Jokic to win their third straight. In an offensive funk for the last four games, Jokic had a season-high 37 points and tied his career best with 21 rebounds.\n\nIt wasn't enough to prevent Denver's first home loss of the season, thanks to LeVert's heroics. His defense helped hold Gary Harris to four points on 1-of-11 shooting, and then he beat his former Big Ten rival at the end.\n\nJokic took only one shot Wednesday night in a loss to Memphis, a 3-pointer in the final seconds that would have given Denver the win. He took only 18 shots in the first four games of November but topped that before the end of the third quarter.\n\nHe had 11 points in the first quarter and a double-double with 20 points and 12 rebounds at halftime.\n\n\"He was just aggressive,\" Nuggets coach Michael Malone said. \"He took advantage of some chances.\"\n\nJokic, normally jovial in postgame interviews, was subdued after Friday's loss. He said he didn't lack confidence in Memphis and said about Friday's game that he \"was feeling the ball tonight.\"\n\nDenver appeared to take control after Jokic blocked Jarrett Allen, grabbed the rebound and fed Malik Beasley for a layup and a 108-106 lead with 1:23 left. After a Brooklyn miss, Paul Millsap's two free throws made it a four-point game.\n\nThe Nets tied it with 29 seconds left and Jokic was called for traveling with 22 seconds left.\n\nLeVert got the ball up top and was blanketed by Harris. He broke through the tight defense to get into the lane and hit a soft lob to give Brooklyn the win.\n\n\"I just tried to get the last shot and get the kind of shot I wanted to get,\" LeVert said of Harris \"I thought he was going to scoot back at one point but he kind of pressed up the whole time. I saw him leaning so I just took it.\"\n\nD'Angelo Russell led the Nets with 23 points, and Allen had 18.\n\nTIP-INS\n\nNets: DeMarre Carroll scored nine points in 14 minutes in his season debut. He missed the first nine games following right ankle surgery. ... The Nuggets played a short tribute video for Kenneth Faried's return to Denver. Faried was traded to Brooklyn after seven years with the Nuggets.\n\nNuggets: Denver attempted two free throws in the first half and 32 in the second half. ... Harris's four points were a season low. It is the first time in 12 games he hasn't scored in double figures.\n\nGOT YOUR BACK\n\nMalone defended Jokic for his comments last week that drew a $25,000 fine from the NBA. Jokic's was dinged for his use of a gay slur after a win in Chicago on Oct. 31.\n\n\"There's so many things being said about this poor kid, and I understand some of it,\" Malone said. \"Those of us who know him, give the kid a break. He made a mistake, he paid for it, get off his back a little bit. He's a great kid, he loves everybody and meant no offense to anybody. He's going to be fine and let the kid be a 23-year-old young kid who's going to have a great, great future in a Nuggets uniform.\"\n\nBARTON UPDATE\n\nDenver swingman Will Barton talked Friday morning, the first time he spoke to the media since having surgery to fix core and hip muscle injuries.\n\nThere is no timetable for his return. Barton said Friday he's \"getting stronger every day\" but doesn't know when he can get back.\n\n\"Whenever this thing lets me. I wish it was tomorrow,\" he said. \"I'm taking it day by day.\"\n\nBarton was carted off the floor on Oct. 20 against Phoenix after he said he felt something pop when he took off for the basket. He had surgery days later.\n\nUP NEXT\n\nNets: Continue their four-game trip at Golden State on Saturday night.\n\nNuggets: Host Milwaukee on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764995430.975013
}