{
  "game_id": "0021500446",
  "espn_id": "400828333",
  "date": "Dec 26, 2015",
  "matchup": "DET vs. BOS",
  "headline": "Bradley leads Celtics past Pistons 99-93",
  "body": "AUBURN HILLS, Mich. --  Jonas Jerebko enjoyed his time with the Detroit Piston and has no hard feelings about being traded away last season.\n\nThus far, the feeling is mutual -- he has been cheered on each of Boston's visits to the Palace of Auburn Hills this month -- but the fans are starting to get a little annoyed.\n\nTen days after Jerebko hit three straight 3-pointers to give the Celtics a chance to pull out a come-from-behind victory over his former team, he had a clinching jumper in the final seconds of Saturday's 99-93 win.\n\nDetroit pulled within five in the last minute, and Boston's Evan Turner was called for an offensive foul with 36 seconds left. Reggie Jackson's 3-pointer trimmed the Celtics' lead to 95-93, but Jerebko hit a baseline jumper with 10.7 seconds left.\n\n\"The clock was winding down, and they were sinking into the paint, and I got open,\" said Jerebko, who was selected by Detroit in the second round of the 2009 draft. \"I knew I had Steve Blake on me, so I knew I could get the shot off, and I made it.\"\n\nEach of Boston's starters scored in double figures, and Turner added 13 points in a reserve role. Avery Bradley scored 18 points, and Isaiah Thomas had 17 points and nine assists.\n\n\"We were lucky to hold on in some ways, but we put ourselves in a great position,\" Celtics coach Brad Stevens said. \"Jonas hit a big shot, that's for sure.\"\n\nPistons center Andre Drummond had 22 points and 22 rebounds for his fifth 20-20 game of the season. Coming into the day, Houston star Dwight Howard had the only other 20-20 game in the NBA this year.\n\nBut Detroit's starting backcourt of Jackson and Kentavious Caldwell-Pope combined for 23 points on 8-of-27 shooting, including 2 for 10 from 3-point range. They also had four assists and eight turnovers.\n\n\"It's hard to move the ball when you keep turning it over,\" Jackson said. \"Between the turnovers and all the shots we made, we were never able to run, which makes it difficult for me to attack and find open guys.\"\n\nJackson finished with two assists in 27 minutes while his backup, Blake, had six in 21 minutes.\n\n\"We didn't take care of the ball and we didn't pass it,\" Pistons coach Stan Van Gundy said. \"Steve passed it, but that's it.\"\n\nThe Celtics intentionally fouled Drummond in the first two quarters, with two of his misses helping the Celtics build a 10-point lead.\n\nErsan Ilyasova scored the final five points of the half to help Detroit close to 51-46. Drummond had 17 points and nine rebounds in the half, but went 3 for 8 from the line.\n\nBoston increased its lead to 13 midway through the third, with a frustrated Van Gundy pulling several starters after defensive lapses. Drummond wasn't one of them, but he finished the quarter on the bench to avoid being sent back to the free-throw line.\n\n\"Right now, our starters aren't giving us a thing, and our bench is having to try to save us,\" Van Gundy said. \"We've had awful starts in the last three games, and today we had an awful third quarter. They had yesterday off, but they played like they practiced for 6 1/2 hours.\"\n\nThe reserves didn't help, and despite going 4 for 20 from beyond the arc in the first three quarters, Boston held a comfortable 76-61 lead going into the fourth.\n\nStanley Johnson started the final quarter with a 3-pointer, and the return of Drummond and Morris helped Detroit cut the deficit to 80-71 with 8:25 to play. Stevens called a timeout, but Kelly Olynyk missed a pair of free throws, prolonging the Pistons' rally.\n\nBut Detroit couldn't hit enough shots to make a serious run at the lead. Like the Celtics, the Pistons struggled badly from outside, finishing 6 of 25 from 3-point range, and Drummond's offensive rebounds couldn't keep enough possessions alive.\n\nTIP-INS\n\nCeltics: Jae Crowder finished with 11 points and seven rebounds, ending his triple-double streak at three games.\n\nPistons: The Four Tops performed at halftime on the 80th birthday of Duke Fakir, the only remaining founding member of the Motown group. He received a Pistons No. 80 jersey as the crowd sang \"Happy Birthday\" to him. . The Pistons played their second straight home game against Boston, although there was a road trip in between.\n\nUP NEXT\n\nCeltics: Visit the Knicks on Sunday.\n\nPistons: Visit the Knicks on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994935.1996999
}