{
  "game_id": "0022201155",
  "espn_id": "401469310",
  "date": "Mar 31, 2023",
  "matchup": "DET @ HOU",
  "headline": "Rockets snap 7-game skid by beating Pistons 121-115",
  "body": "HOUSTON -- — Kevin Porter Jr. scored 33 points and Jalen Green added 32 to help the Houston Rockets end their seven-game losing streak with a 121-115 win over the Detroit Pistons on Friday night. \n\n\r\n              Porter shot 12 of 20 from the field and made seven 3-pointers, the last of which put Houston up by six with less than a minute to play. It marked the first time this season Porter scored 30 or more points in consecutive games. Meanwhile, Green was 10 of 18 on field goals. \n\n\r\n              “We wanted this one bad, definitely,” Porter said. “The last couple of games, we felt like we should’ve closed some out. So we knew Detroit was our first home game back and we definitely wanted this one to start off our home stretch.”\n\n\r\n              Marvin Bagley III scored 21 points and Jaden Ivey added 18 points and nine assists for Detroit, which lost its eighth in a row and 19th in the last 20 games. \n\n\r\n              “You don’t want to get used to losing,” Bagley said. “I don’t care what the record is, where we’re at and just staying home (for the playoffs). We don’t care about any of that. We just want to win.”\n\n\r\n              In a game that featured 14 ties and 23 lead changes, the Rockets took the lead for good when Porter knocked down a free throw to break a 104-104 tie after Pistons coach Dwane Casey was called for a technical foul with 4:59 to play.\n\n\r\n              Alperen Sengun had 15 points, 13 rebounds, and seven assists for the Rockets. Jabari Smith Jr. finished with 13 points and 11 rebounds for his 15th double-double of the season. LeBron James and Dwight Howard are the only players in NBA history 19 or younger with more than 16 double-doubles.\n\n\r\n              Houston shot 55% on the way to taking a 31-28 lead after a quarter, but Jared Rhoden sparked a 15-4 run by the Pistons midway through the second that was capped off by Killian Hayes' 3-pointer.\n\n\r\n              Detroit took a one-point lead into the fourth, but both teams struggled to make shots. Houston was able to overcome its poor shooting by going 14 of 20 from the foul line in the quarter. The Rockets had 45 free throw attempts overall, compared to 27 for the Pistons.\n\n\r\n              TIP-INS\n\n\r\n              Rockets: K.J. Martin’s consecutive games streak reached 125 despite the Rockets listing him as questionable to play with a hip flexor strain. ... Frank Kaminsky is the only player on either team to have played in a Final Four, which will be played in Houston on Saturday. \n\n\r\n              Pistons: James Wiseman failed to score in double figures for the first time since being acquired in a trade from Golden State. ... Leading scorer Bojan Bogdanovic missed his 14th consecutive game due to left Achilles tendinopathy. He hasn’t been ruled out the remainder of the season, but Casey said the team will remain cautious.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host the Los Angeles Lakers on Sunday.\n\n\r\n              Knicks: Visit Orlando on Sunday. \n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994352.382288
}