{
  "game_id": "0022301212",
  "espn_id": "401616466",
  "date": "Dec 06, 2023",
  "matchup": "HOU vs. OKC",
  "headline": "Dillon Brooks scores 23, Rockets snap a 3-game skid with a 110-101 win over Thunder",
  "body": "HOUSTON -- — Dillon Brooks scored 23 points and the Houston Rockets snapped a three-game skid with a 110-101 win over the Oklahoma City Thunder on Wednesday night.\n\n\r\n              Aaron Holiday scored a season-high 22 points off the bench and matched a career best with six 3-pointers. He also added six rebounds in 27 minutes as Houston improved to 9-9 overall, with all of their wins coming at home.\n\n\r\n              “I think I am a pretty good shooter,” Holiday said. \"Every shot I shoot, I think it’s going in. Sometimes it just doesn’t, that’s the way it goes. For the most part, I think they are going in.”\n\n\r\n              Alperen Sengun added 21 points, six rebounds, and seven assists for the Rockets, and Jabari Smith chipped in a career-high 18 rebounds, helping Houston win the battle of the boards 53-30.\n\n\r\n              Shai Gilgeous-Alexander led the Thunder with 33 points on 13-of-18 shooting. Oklahoma City’s four other starters combined for 29 points while converting on 10 of 38 shots from the field.\n\n\r\n              Jalen Williams scored 13 points for the Thunder, while rookie center Chet Holmgren finished with four points and six blocked shots. Oklahoma City drops to 13-7 on the season after entering the game winners of eight of its last 10 games.\n\n\r\n              “We had them in striking distance,” Thunder coach Mark Daigneault said. “It never felt like we had control of the game. I thought they were outplaying us, and it felt like that. We had a chance. We had a chance to string together a little bit of energy and obviously we couldn’t do that tonight.”\n\n\r\n              Brooks shot 9 for 17 from the field and helped start a run in the third quarter that helped turn a tight game into a lopsided win for the Rockets.\n\n\r\n              Houston scored the first eight points of the third quarter to push a five-point halftime lead to 13. Oklahoma City cut its deficit to one with 3:30 left, but Brooks scored five straight, and the Rockets took a six point lead into the fourth quarter and then broke the game open.\n\n\r\n              “We finished (the third quarter) well,” Rockets coach Ime Udoka said. “Rolled that over into the fourth quarter, and the message was, you let this team hang around, and they’re gonna start making shots, and they got some elite scorers.”\n\n\r\n              Led by Holiday, Houston went on a 20-7 run in the fourth quarter that increased its lead to 17 points. The Rockets maintained at least an eight-point lead the rest of the way.\n\n\r\n              Jalen Green’s nine points in the first quarter, capped a by a 23-footer at the buzzer, helped the Rockets to a 10-point lead after the game’s first 12 minutes. He finished the game with 15 points on 6-of-12 shooting.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Golden State Warriors on Friday.\n\n\r\n              Rockets: At Denver Nuggets on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995628.987415
}