{
  "game_id": "0022000366",
  "espn_id": "401267526",
  "date": "Feb 07, 2021",
  "matchup": "SAC @ LAC",
  "headline": "Streaking Kings win 4th straight, beat Clippers 113-110",
  "body": "LOS ANGELES -- — De’Aaron Fox scored 36 points, Buddy Hield added 22 and the Sacramento Kings beat the Los Angeles Clippers 113-110 on Sunday for their fourth straight victory.\n\n\r\n                    The Kings are 7-1 since suffering a 19-point drubbing by the Clippers on Jan. 20.\n\n\r\n                    “It was a real scrappy win on this back-to-back with an early start,\" Kings coach Luke Walton said.\n\n\r\n                    Sacramento has won seven of eight for the first time since 2006, the last time the team made the playoffs.\n\n\r\n                    “We're playing defense. That’s the biggest thing about what we’re doing right now. We knew we’re able to score with anybody. When we’ve needed stops we’ve been able to get them,” Fox said. “If we can stay locked in defensively and we can keep our turnovers down, we can give ourselves a chance to win.”\n\n\r\n                    Lou Williams scored 23 points off the bench for the Clippers, who dropped two in a row for the first time this season. Kawhi Leonard had 20 points and 10 rebounds as they played without injured Paul George. The Clippers' reserves outscored the starters, 57-53, and the LA bench outscored the Kings' reserves, 57-30.\n\n\r\n                    “Kawhi was a little worn out,\" Clippers coach Tyronn Lue said. “Guys' legs were a little tired, they couldn’t make shots. Our starters didn't have much.\"\n\n\r\n                    Neither team led by more than nine points in the back-and-forth affair that featured 11 ties. \n\n\r\n                    Nicolas Batum’s potential tying 3-pointer missed in the closing seconds for the Clippers. \n\n\r\n                    Williams' pair of free throws tied the game for the last time at 103-all. From there, the Kings stayed in front. Leonard cut Sacramento's lead to 107-106, but Harrison Barnes scored off his own offensive rebound.\n\n\r\n                    Rookie Tyrese Haliburton hit back-to-back 3-pointers that put the Kings ahead by five early in the fourth. Williams scored five points in a 7-0 run that put the Clippers ahead 97-95.\n\n\r\n                    Fox answered with consecutive 3-pointers to take back a 103-101 lead for the Kings.\n\n\r\n                    “His speed and quickness really hurt us,” Lue said of Fox. “He was able to attack us all night and get into the paint and cause havoc.\"\n\n\r\n                    Los Angeles rallied from a seven-point deficit in the third to lead 80-79, helped by nine straight points from four different players. Fox scored Sacramento's final six points of the quarter.\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: They improved to 5-5 on the road and 3-4 against the West away from home. ... Were playing the second game of a back-to-back after beating Denver on Saturday.\n\n\r\n                    Clippers: George missed his second straight game with what was initially described as a sore right foot. More specifically, it's a bone edema in his toe, which is a buildup of fluid within the bone marrow. There is no timetable for his return as he awaits the swelling to go down, Lue said. “He's a little disappointed, especially the way he's been playing,\" Lue said. ... Patrick Beverley worked out on the court before the game. He's been sidelined for a while because of right knee soreness. \n\n\r\n                    HE SAID IT\n\n\r\n                    “Do me a favor and keep the questions short. We want to get home and watch the Super Bowl.” — Walton to reporters after the game.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Host Philadelphia on Tuesday.\n\n\r\n                    Clippers: Visit Minnesota on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997181.359364
}