{
  "game_id": "0022000182",
  "espn_id": "401267342",
  "date": "Jan 15, 2021",
  "matchup": "MIL vs. DAL",
  "headline": "Bucks survive shaky free-throw shooting to edge Mavs 112-109",
  "body": "MILWAUKEE -- — Khris Middleton made a couple of huge 3-pointers and the Milwaukee Bucks overcame poor free-throw shooting to snap the Dallas Mavericks' four-game winning streak.\n\n\r\n                    Middleton scored eight points of his 25 points in the final 2 1/2 minutes of the Bucks' 112-109 victory Friday night. Middleton took over after James Johnson’s corner 3-pointer with 3:09 left put Dallas ahead 104-103 — the Mavericks’ first lead since the opening five minutes.\n\n\r\n                    “He’s just a great decision-maker,” Bucks coach Mike Budenholzer said. “He knows to take what the defense gives him. If he’s got a shot, he’s an incredible shot-maker, but he’s an incredible playmaker. ... He’s just a great finisher.”\n\n\r\n                    Middleton's 3-pointer put the Bucks ahead for good at 106-105 with 2:21 left. Middleton hit another 3-pointer 34 seconds later to make it 109-105. He also hit a pair of free throws with 7.8 seconds remaining to finish with 25 points. \n\n\r\n                    Those free throws were particularly noteworthy on a night when nobody could connect consistently from the foul line.\n\n\r\n                    The Bucks were 12 of 25 on free throws, with Giannis Antetokounmpo going 1 of 10. Dallas was 6 of 13.\n\n\r\n                    “He's just got to keep working through the free-throw line, continue to put the time in, grow his confidence and step up and make them,” Budenholzer said.\n\n\r\n                    Antetokounmpo still scored 31 points as the Bucks won their fourth straight. Luka Doncic had 28 points, 13 assists and nine rebounds for Dallas, which also got 22 points from Tim Hardaway Jr.\n\n\r\n                    The Mavericks entered the night having won 11 of the last 14 regular-season meetings with the Bucks. Dallas also swept two preseason matchups in Milwaukee last month.\n\n\r\n                    Milwaukee went 0-2 against Dallas and 56-15 against the rest of the NBA during the 2019-20 regular season.\n\n\r\n                    Dallas had chances to win this one late as well after trailing by as many as 14 early, but Trey Burke and Kristaps Porzingis missed potential go-ahead 3-point shots in the final 21 seconds.\n\n\r\n                    Doncic appeared to want a timeout to be called once Dallas got the offensive rebound off Burke's miss. The Mavs instead worked the ball to Porzingis, who missed with 10.4 seconds left.\n\n\r\n                    “It’s very difficult to call a timeout and go against a Milwaukee set defense out of the timeout,\" Mavericks coach Rick Carlisle said.\n\n\r\n                    Carlisle added that he thought the Mavericks got two good shots.\n\n\r\n                    “It's Coach's decision,” Doncic said. “If we would have made the shot, everything would have been good.”\n\n\r\n                    Jrue Holiday scored 16 points, and Lopez had 11 for the Bucks, with Bobby Portis adding eight points and 13 rebounds. Dallas got 15 points from Porzingis, 13 each from Burke and Johnson, as well as 11 from William Cauley-Stein. \n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Dallas played without Josh Richardson, Dorian Finney-Smith, Jalen Brunson, Dwight Powell and Maxi Kleber due to health and safety protocols amid the pandemic. This was the third straight games that Brunson, Finney-Smith and Richardson have missed. Powell and Kleber have been out for two games. \n\n\r\n                    Bucks: Reserve forward Torrey Craig was cleared to return to action, though he didn't enter Friday's game. Craig hasn't played since fracturing his nose Dec. 27. Craig said he’s suffered a similar injury twice before, the difference this time being that he underwent surgery for it. Craig doesn’t like wearing a mask because it reduces his peripheral vision and makes him feel hot but added that “I guess I’ll tolerate it for the next few weeks and see what happens.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: At Brooklyn on Monday.\n\n\r\n                    Mavericks: Host Chicago on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997413.206309
}