{
  "game_id": "0022000617",
  "espn_id": "401307402",
  "date": "Mar 17, 2021",
  "matchup": "IND vs. BKN",
  "headline": "James Harden has triple-double, short-handed Nets top Pacers",
  "body": "INDIANAPOLIS -- — Brooklyn Nets coach Steve Nash insists he will never take for granted how James Harden can take control of a game.\n\n\r\n                    Harden did that with 40 points, 15 assists and 10 rebounds for his 11th triple-double of the season, leading Brooklyn to a 124-115 victory over the Indiana Pacers on Wednesday night.\n\n\r\n                    The All-Star guard often demanded double teams in the final quarter, yet still delivered with 14 points, six rebounds and four assists. The Nets outscored the Pacers 35-24 in the fourth.\n\n\r\n                    “It's a remarkable performance,” Nash said. \"He made some huge plays down the stretch. ... All the other guys played their part, but James was the main guy, as we've come to expect.”\n\n\r\n                    The Nets were without fellow All-Stars Kyrie Irving (groin) and Kevin Durant (hamstring) and newcomer Blake Griffin (knee).\n\n\r\n                    Harden was 13 of 27 from the field and 12 of 14 at the line. When he wasn't shooting, he set up open teammates driving to the basket, often for dunks and layups. \n\n\r\n                    “Harden was just doing his thing,” said the Pacers’ Domantas Sabonis.\n\n\r\n                    Harden hit a runner in the lane to tie it at 96 early in the fourth. That started a 13-4 run that included a Harden 3-pointer and another layup that pushed it to 109-100. \n\n\r\n                    “We just kept fighting and showed resilience,” Harden said.\n\n\r\n                    The performance was reminiscent of rallying from a 24-point deficit for a win at Phoenix without Irving and Durant.\n\n\r\n                    “I don't want to be down,” Harden said with a chuckle. “Obviously, we don't want to get used to having K.D. and Kyrie out of the lineup, but if we do, guys have got to be ready to step up.”\n\n\r\n                    Joe Harris added 19 points for the Nets, and Jeff Green and Tyler Johnson each had 15.\n\n\r\n                    Malcolm Brogdon led Indiana with 24 points, Sabonis had a triple-double with 18 points, 11 rebounds, and 11 assists.\n\n\r\n                    “All four games after the break in the fourth quarter, we've struggled,” Sabonis said. “I don't know. We're not getting stops when we need to.”\n\n\r\n                    Caris LeVert scored 19 points in his Pacers home debut since returning from kidney surgery three games ago. He was acquired in a deal that involved Harden going to the Nets.\n\n\r\n                    “I'm trying to get past the return part as much as possible,” LeVert said. “I wish we could have got the win.”\n\n\r\n                    The Pacers scored a season-high 40 points in the first quarter to take a 15-point lead.\n\n\r\n                    Harden held the Nets cut it to 61-58 at the half. He had 15 points and seven assists at the break.\n\n\r\n                    Harris hit a 3-pointer in the final seconds of the third quarter to get the Nets to 91-89.\n\n\r\n                    TIP-INS\n\n\r\n                    Nets: Have won 12 of 13 since Durant was sidelined. ... Harden needs one triple-double to tie Jason Kidd's single-season team record.\n\n\r\n                    Pacers: Myles Turner blocked a shot in the opening minutes for the 55th consecutive game, which surpasses Jermaine O'Neal for the longest streak in team history.\n\n\r\n                    UP NEXT\n\n\r\n                    Nets: At Orlando on Friday night\n\n\r\n                    Pacers: At Miami on Friday night.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997139.700691
}