{
  "game_id": "401809788",
  "espn_id": "401809788",
  "date": "Nov 14, 2025",
  "matchup": "DAL vs LAC",
  "headline": "Harden's 82nd career triple-double leads Clippers past Mavericks 133-127 in 2OT in NBA Cup",
  "body": "DALLAS -- — James Harden scored four of his 10 overtime points in the second extra period and finished with season highs of 41 points and 14 rebounds, along with 11 assists, as the Los Angeles Clippers beat the Dallas Mavericks 133-127 in an NBA Cup game on Friday night.\n\n\r\n              Harden had the 82nd triple-double of his career and Ivica Zubac added a season-high 27 points and 11 rebounds as the Clippers (4-8) snapped a six-game losing streak and improved to 2-0 in the NBA Cup.\n\n\r\n              Naji Marshall, making his first start of the season, and D’Angelo Russell, coming off the bench, scored 28 points apiece to lead the Mavericks (3-10), who are 0-2 in group play. Dallas has lost three straight games and seven of its last eight.\n\n\r\n              Harden, who had two 3-pointers in the first OT, followed two made free throws with a driving basket to give the Clippers a 129-125 lead with 3:07 left in the second OT. Los Angeles led 133-127 with 2:20 to go when Russell committed two of his seven turnovers over the next minute.\n\n\r\n              It appeared the Clippers took a 125-123 lead with 1.4 seconds left in the first overtime when Dallas’ Daniel Gafford was called for goaltending on a Harden shot, but video review reversed the call.\n\n\r\n              The Clippers’ Bogdan Bogdanovic had five 3-pointers and 21 points — both season highs — off the bench.\n\n\r\n              Dereck Lively II, who missed the previous nine games with a sprained right knee, returned to the Mavericks’ short-handed frontcourt. Lively, coming off the bench on a minutes’ restriction, had four points – all in the fourth period – and five rebounds. Dallas played without big men Anthony Davis (eighth consecutive game missed with a strained left calf) and P.J. Washington Jr. (left shoulder strained in Dallas’ previous game).\n\n\r\n              The Clippers played their second game after Bradley Beal was lost for the season with a fractured hip on Saturday. Kawhi Leonard missed his sixth consecutive game with a sprained ankle.\n\n\r\n              Up next\r\n              Clippers: At Boston on Sunday.\n\n\r\n              Mavericks: Host Portland on Sunday in the finale of a four-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042627.6088672
}