{
  "game_id": "0021900446",
  "espn_id": "401161088",
  "date": "Dec 23, 2019",
  "matchup": "TOR @ IND",
  "headline": "Warren, Turner lead Pacers to overtime home win over Raptors",
  "body": "INDIANAPOLIS --  Aaron Holiday likened the back-and-forth test of resiliency against the defending NBA champions to that of a playoff game.\n\nEach time the Indiana Pacers or Toronto Raptors sank a dramatic shot, the intensity level increased that much more, the escalating emotion eventually spilling into overtime.\n\nThat's when Holiday hit his two most important attempts, both 3-pointers, to help the host Pacers snap the Raptors' five-game win streak with a 120-115 overtime triumph on Monday.\n\n\"It's a big win for us,\" said Holiday, who finished with 19 points in getting the start at point guard for the injured Malcolm Brogdon. \"It's fun playing with emotion, especially in big games.\"\n\nHis fourth 3-pointer of the game gave the Pacers a 116-113 lead with 2:05 remaining in overtime. His fifth and final 3-pointer provided a 119-115 advantage with 54 seconds remaining.\n\n\"It just shows the toughness, 48-plus minutes, we're going to be relentless on both ends,\" said T.Y. Warren, who along with Myles Turner led the Pacers with 24 points apiece. \"I'm glad the way we responded, tough shots and we got some key stops at the end.\"\n\nThe Pacers (21-10) set a franchise record with 42 3-pointers attempted and matched a season high with 18 made. That included four in the fourth quarter and overtime.\n\nThe Raptors (21-9) missed 17 of their first 19 shots from 3-point range in falling behind by 15 points in the second quarter. They eventually rallied, despite finishing 11 of 40 from beyond the arc.\n\nBoth teams missed potential game-winning shots in the final minute of regulation as Holiday's layup was too long off the glass before Kyle Lowry's last-second 3-pointer bounced off the front of the rim.\n\nLowry tried his best to be the hero for a second consecutive night in leading all scorers with 30 points. He scored 32 points in a record comeback win from 30 points down at home against the Dallas Mavericks on Sunday.\n\n\"We gutted it out, we played our butts off and gave ourselves a chance to win at the end,\" Lowry said of the Raptors, who were missing two starters due to injuries. \"Unfortunately, we came up short.\"\n\nLowry managed just two points in overtime, when the Pacers outscored the Raptors 13-8.\n\n\"We got ourselves a five-point lead, probably should have put it away there but give them credit,\" Raptors coach Nick Nurse said of the Pacers' fourth-quarter deficit. \"A bunch of 3's late, a bunch in the fourth quarter, a bunch in overtime.\"\n\nSerge Ibaka added 23 and Fred VanVleet 21 for the Raptors\n\nThe Pacers' Myles Turner sank 5 of 6 3-pointers in finishing 9 of 12 from the floor.\n\n\"Resilience, that's what we showed tonight,\" said Pacers coach Nate McMillan. \"That's one of the better teams in the conference. We knew they were going to be a team that scrapped, and our guys came and they fought. They kept their composure throughout the game, despite losing the lead, and stayed with it.\"\n\nTIP-INS\n\nRaptors: Forward Pascal Siakam, who averages a team-high 25.1 points, missed his third consecutive game with a groin strain. Center Marc Gasol also missed his third consecutive game with a left hamstring strain. . Toronto hasn't lost the season series against Indiana since 2011-12.\n\nPacers: Forward Domantas Sabonis moved into second in double-doubles at 25 with 12 points and 17 rebounds. . Brogdon, who averages a team-high 18.3 points, was inactive with a right hamstring strain. He played almost 30 minutes on Sunday. . Coach Nate McMillan (637-570) is one win shy of tying Chuck Daly (638-437) for 23rd on the NBA's career list. . A young Pacers fan wearing an old Roy Hibbert jersey banked in a half-court shot to win Chick-fil-A for a year.\n\nUP NEXT\n\nRaptors: Host Boston on Wednesday.\n\nPacers: At Miami on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995626.030545
}