{
  "game_id": "0021900472",
  "espn_id": "401161114",
  "date": "Dec 28, 2019",
  "matchup": "MEM @ DEN",
  "headline": "Jokic has a triple-double as Nuggets beat Grizzlies 119-110",
  "body": "DENVER -- \n\nNikola Jokic scored at the beginning and passed in the end, and the Denver Nuggets needed every bit of what he provided to avoid a big collapse.\n\nJokic scored a season-high 31 points and added 10 rebounds and 10 assists for his seventh triple-double of the season, leading the Nuggets to a 119-110 victory over the Memphis Grizzlies on Saturday night.\n\nJokic, who has 35 career triple-doubles, has 11 double-doubles in the last 12 games, helping Denver win eight of its last nine. Will Barton had 20 points and Jamal Murray and Mason Plumlee each scored 15 for the Nuggets, who allowed 42 points in the fourth quarter.\n\n\"In the first quarter, they score 11 points and in the fourth they score 42,\" said Jokic, who had 14 points in the first. \"It's a huge difference. We have to be focused on closing the halves, closing the quarters, closing the games.\"\n\nMemphis shot 61.5% in the fourth quarter and 60.4% in the second half after hitting just 3 of 14 shots in the first quarter.\n\n\"It was a tough first quarter for us,\" Grizzlies coach Taylor Jenkins said. \"We weren't able to get a lot of shots to fall, both layups and 3s during the first quarter and a half. But I love our resolve.\"\n\nDenver never trailed and led by as many as 23 points in the first half when its two 7-footers, Jokic and Plumlee, sat with three fouls each. The Grizzlies made a run and closed within 50-39 at the end of the first half, with the final points coming on a dunk by Brandon Clarke just before the horn.\n\nJaren Jackson Jr. led Memphis with 20 points, De'Anthony Melton had 17 off the bench and Ja Morant scored 16 points.\n\nThe Grizzlies missed 20 of their first 25 shots and went 20 for 33 to close out the third quarter.\n\n\"A lot better ball movement and a lot of side-to-side play,\" Jackson said of the improved shooting. \"When we trust our ball movement and trust our pick-and-rolls we just have much more action with more rhythm and everyone gets open looks.\"\n\nMemphis closed within 52-49 early in the third quarter, the closest it had been since early in the first. Denver went on a 16-4 run later in the period and took a 14-point lead into the fourth.\n\n\"Unfortunately, it's another game we blew a big lead and made things more interesting than they needed to be,\" Nuggets coach Michael Malone said.\n\nJonas Valanciunas had eight of his 14 points in the first three minutes of the quarter to get Memphis within eight. Denver went ahead by 14, but a 3-pointer by Jackson cut it to 102-95 with 5:15 left, but the Nuggets scored the next six and held off the Grizzlies.\n\nTIP-INS\n\nGrizzlies: Valanciunas had 10 rebounds. ... Have lost four straight and 31 of their last 38 games played in Denver. ... Memphis made more free throws (13) than field goals (12) in the first half.\n\nNuggets: F Paul Millsap was out with a left quadricep contusion. Millsap missed two games earlier in December with a similar injury. .... Plumlee made his first start of the season after coming off the bench for 30 games. ... Mallory Pugh, a member of USA team that won the women's World Cup last summer, took the ceremonial free throw before the opening tip.\n\nDYNAMIC NIKOLA\n\nJokic had five of his 10 assists in the fourth quarter, including a no-look pass to Jerami Grant for a layup. He also had an alley-opp to Murray, and then rewarded Murray for a backdoor cut that led to another dunk.\n\n\"He's playing at a high level and it's really lifted our team,\" Plumlee said. \"He always does one or two things a game that are impressive.\"\n\nNO FREE PASS\n\nDenver didn't attempt a foul shot in the first half, while the Grizzlies were 13 of 16 from the line. It is the second time this season a Memphis opponent has shot one or fewer free throws. The Nuggets got their first attempts from the line when Jokic hit a pair with 10:47 left in the third.\n\nThey finished 20 of 27 from the line.\n\nUP NEXT\n\nGrizzlies: Host the Charlotte Hornets on Sunday night.\n\nNuggets: Host the Sacramento Kings on Sunday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995729.080389
}