{
  "game_id": "0022000321",
  "espn_id": "401307565",
  "date": "Apr 06, 2021",
  "matchup": "DET @ DEN",
  "headline": "Nikola Jokic's 27 points leads Nuggets past Pistons 134-119",
  "body": "DENVER -- — Nikola Jokic scored 27 points in 27 minutes and the Denver Nuggets spoiled the return of Jerami Grant and Mason Plumlee with a 134-119 shellacking of the Detroit Pistons on Tuesday night.\n\n\r\n                    Jokic was glad to see Plumlee, his former backup, and Grant, who helped the Nuggets make a deep run in the bubble last season.\n\n\r\n                    “Everybody, that team from last year, I’m going to remember those guys for the rest of my life,” Jokic said. “We made history, something no one had ever done, coming back from 3-1 two times. … So it’s always going to be nice to see them.”\n\n\r\n                    Jokic also dished out 11 assists, his 83rd career double-digit assist game, two more than Wilt Chamberlain had in his Hall of Fame career.\n\n\r\n                    The Nuggets got 25 points from Michael Porter Jr. and 24 from Will Barton. Denver led by as many as 28 before sitting most of their starters early in the second half.\n\n\r\n                    Denver has won 15 of 18, seven in a row and all six with Aaron Gordon in the lineup following the trade deadline deals that thrust Denver into the championship conversation.\n\n\r\n                    Grant has had a breakout season in Detroit, where he brought a 22.4-point scoring average into Denver. He scored 29 points over 30 minutes to go with Saddiq Bey's 25 points. \n\n\r\n                    “I know I have to be aggressive in order to give us a chance,” Grant said.\n\n\r\n                    With their usual balanced scoring and deeper than ever bench, the Nuggets took control with 14-0 run early on and closed the first half on an 11-0 outburst to take a 76-56 lead into the break. They scored the first five points after the break and were never challenged over the final 24 minutes.\n\n\r\n                    The Nuggets haven't really been threatened at all with Gordon in the lineup, filling the role Grant occupied last season as a versatile defender who raises the team's athleticism quotient on both ends of the floor.\n\n\r\n                    Gordon was quiet (nine points, four rebounds) but he did his usual damage defensively as Denver outscored Detroit 40-22 in the paint in the decisive first half and 62-48 overall.\n\n\r\n                    “I think it speaks to Aaron wanting to be a part of a high-level team, a team that has championship aspirations,\" Nuggets coach Michael Malone said when speaking of Gordon's quick adjustment to his new teammates. \n\n\r\n                    “He did not come in here trying to stand out, he came in here trying to fit in.\"\n\n\r\n                    That selflessness was evident on a third-quarter sequence when Gordon and Jokic passed the ball back and fourth four times under the basket before Jokic finally sank a hook shot.\n\n\r\n                    MIFFED MALONE\n\n\r\n                    “We’re going to have to defend a hell of a lot better tomorrow night,” Malone said after watching the scrappy Pistons shoot 54.3% and make 15 of 35 from long range. “We had 36 assists, so offensively a great night,\" Malone said. \"Defensively, we just traded baskets all night long.”\n\n\r\n                    Pistons coach Dwayne Casey wishes he had Malone's problems: The Nuggets made 56 of 94 shots compared to Detroit's 44-for-81 performance.\n\n\r\n                    “They shot 60 percent, basically, so we didn’t present any opposition defensively,\" Casey lamented.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Plumlee scored four points. ... The game was originally scheduled for Feb. 1, but was postponed due to Covid-19 contact tracing with the Pistons.\n\n\r\n                    Nuggets: Denver shot a blistering 67.3% in the first half. ... Jamal Murray (ankle) sat out for Denver. ... The biggest cheer of the night from the 4,000 socially distanced fans went up for Hall of Fame QB Peyton Manning when he was shown on the giant videoboard during a second-quarter timeout. \n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Visit the Sacramento Kings on Thursday night for third game of their five-game road swing.\n\n\r\n                    Nuggets: Host the San Antonio Spurs on Wednesday night in the first of a two-game set at Ball Arena that concludes Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997909.447277
}