{
  "game_id": "0021800666",
  "espn_id": "401071342",
  "date": "Jan 17, 2019",
  "matchup": "SAC @ CHA",
  "headline": "Walker, Hornets return home, beat Kings 114-95",
  "body": "CHARLOTTE, N.C. --  Coach James Borrego says the Charlotte Hornets can beat any team in the NBA if they bring defensive intensity.\n\nThe challenge is getting that effort every game.\n\n\"That's the message right now,\" Borrego said. \"If we come out and defend with energy, physicality and disruption, we have a shot against anyone.\"\n\nKemba Walker scored 23 points, surpassing 11,000 for his career, and the Hornets set the tone with a strong defensive effort in the second quarter and powered their way to a 114-95 win Thursday night over the Sacramento Kings.\n\nMiles Bridges and Michael Kidd-Gilchrist each had 15 points off the bench and reserve center Willy Hernangomez added 11 points and 16 rebounds for the Hornets. Charlotte's reserves outscored Sacramento's 60-44 and outrebounded them 25-17 as the Kings' three-game winning streak ended. That run included a win over Charlotte in Sacramento on Saturday.\n\n\"Their role players struggled a little bit at our place, our role players struggled a little bit here,\" Kings coach Dave Joerger said. \"That's generally what happens -- role players play better at home. We're playing a lot of young guys at the same time, so it's going to take a little while to figure out.\"\n\nThe defense and bench play go hand-in-hand for Charlotte.\n\nBorrego has been substituting more frequently of late and going deeper into his bench in an effort to save energy for defense.\n\n\"We want them to be fresh out there to give us all they have defensively,\" Borrego said.\n\nWhile the first-year coach knows that may cost the Hornets some points on the offensive end, he said it's \"worth the payoff on defense.\"\n\nVeteran guard Tony Parker agreed, saying if the Hornets want to make a playoff run -- they are currently eighth in the Eastern Conference standings -- they have to do it with defensive energy and consistently strong play off the bench.\n\n\"The second unit played well and got us back in the game,\" Parker said. \"But we have to have more consistency and keep it going now.\"\n\nThe Hornets entered the game looking to make up ground in the East after a 2-4 West Coast trip.\n\nAfter falling behind by 13 early, Charlotte outscored Sacramento 43-25 in the second quarter to take control and never trailed again, leading by as many as 20 early in the fourth quarter. Kidd-Gilchrist brought energy in the second quarter, scoring with 13 points before the break -- most of those coming in transition after solid defensive play.\n\nIn all, the Hornets scored 24 points off 16 Kings turnovers.\n\n\"To score 43 points, it speaks to our defense there. That's really how we were scoring,\" Borrego said. \"We were getting stops and steals.\"\n\nTIP-INS\n\nKings: Buddy Hield led the Kings with 24 points. ... Were outscored 52-38 in the paint despite being the Hornets being without center Cody Zeller.\n\nHornets: Carolina Panthers All-Pro linebacker Luke Kuechly and former teammate Thomas Davis took in the game from courtside seats. ... Center Frank Kaminsky did not play, even with Zeller out.\n\nGILES' RETURN\n\nNorth Carolina native Harry Giles capped a frustrating night by fouling out with 1:20 left in the game. He finished with one point after missing all three shots from the field and going 1 of 4 from the foul line.\n\nStill, he said it was an \"amazing\" feeling to play in front of so many friends and relatives.\n\n\"I wish I could have played a little bit better,\" Giles said. \"They've seen me hoop before so they know, but just personally you always want to do good.\"\n\nWILLIAMS ON WILLIAMS\n\nNorth Carolina Tar Heels coach Roy Williams made a surprise visit to see former Tar Heels player Marvin Williams play, something he tends to do at least once per season.\n\n\"The funny thing is you never know when he's going to pop up,\" Marvin Williams said. \"I've been in the league 14 years now and coach Williams has found a way to make it to a game every year. It's unbelievable. And I know he does that for a lot of his former players -- it's bigger than basketball for him.\"\n\nUP NEXT\n\nKings: Visit the Pistons on Saturday night.\n\nHornets: Host the Suns on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994196.395972
}