{
  "game_id": "0022101065",
  "espn_id": "401360884",
  "date": "Mar 20, 2022",
  "matchup": "ORL vs. OKC",
  "headline": "Carter, Magic hand Thunder 9th straight loss, 90-85",
  "body": "ORLANDO, Fla. -- — Wendell Carter Jr. scored 10 of his career-high 30 points in the fourth quarter and the Orlando Magic handed the Oklahoma City Thunder their ninth straight loss with a 90-85 victory Sunday night.\n\n\r\n              Carter also had 16 rebounds to help the Magic end a three-game losing streak.\n\n\r\n              “I feel I was able to stretch the floor tonight. That's the next step for me as a big man,” said Carter, who made 12 of 15 shots including a couple of 3 pointers. “I made some shots tonight and that's really about it.”\n\n\r\n              Darius Bazley led Oklahoma City with 18 points. The Thunder shot 32.6% and were 13 of 48 from 3-point range. But Orlando didn't move ahead for good until Franz Wagner scored on a rebound with 2:24 remaining.\n\n\r\n              “At halftime we were very frustrated because we didn't shoot the ball well,” Carter said. “But we had to establish our identity on defense.”\n\n\r\n              The Thunder, the NBA's lowest-scoring team (103.1 points per game) and poorest shooting team at 42.6%, were playing without their top three scorers, including Shai Gilgeous-Alexander, who injured his ankle Friday night at Miami. Bazley was the only active player Sunday night with a scoring average in double figures (10.6). \n\n\r\n              After getting torched by Brooklyn's Kyrie Irving for 60 points in a loss on Tuesday night, and giving up 51 points to Saddiq Bey on Friday night in a loss to Detroit, the Magic had to prove they could stop someone.\n\n\r\n              “We can talk about what we gave up the last two games, and our guys' response to that was very good,” Magic coach Jamahl Mosley said. \n\n\r\n              After 10 quick points by Bazley and a couple of 3-pointers by Tre Mann, the Thunder had a 25-17 lead before going scoreless for the final 3:20 of the first quarter. Orlando scored the final 14 points of the quarter and led 45-43 at halftime.\n\n\r\n              Three-pointers by Theo Maledon and Vit Krejci helped Oklahoma City close the third quarter with a 9-1 spurt , and the Thunder moved ahead by seven points before going on another scoreless stretch of more than four minutes.\n\n\r\n              Two free throws by Isaiah Robey with 2:46 left gave the Thunder their last lead. but Wagner, Carter and Cole Anthony scored the next eight points for Orlando and the Magic led 88-81 with 24 seconds left.\n\n\r\n              “We have them too many second chances,” said Isaiah Robey, who had 11 points and 10 rebounds for the Thunder. “They did a better job of finishing out the game than we did.”\n\n\r\n              TIP-INS\n\n\r\n              Thunder: The Thunder had only nine available players. ... G Kenrich Williams (sprained right knee), C Derrick Favors (sore back) and Gilgeous-Alxeander might be able to play Monday night. . . . The Thunder gave up 116 points or more in each of their first eight losses of the streak.\n\n\r\n              Magic: G Jalen Suggs missed a third straight game with an ankle injury. ... The Magic won a game in which they made 7 of 31 3-pointers and had 21 turnovers. . . . Markelle Fultz was named winner of the Rich & Helen DeVos Community Enrichment Award.\n\n\r\n              UP NEXT\n\n\r\n              Thunder: Host Boston on Monday night.\n\n\r\n              Magic: At Golden State on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764993426.6268852
}