{
  "game_id": "0021800020",
  "espn_id": "401070705",
  "date": "Oct 19, 2018",
  "matchup": "MEM vs. ATL",
  "headline": "Temple, Jackson Jr. lead Grizzlies past Hawks 131-117",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies' newcomers made a fine first impression on the home crowd.\n\nGarrett Temple, picked up in a trade from Sacramento, scored 30 points, rookie Jaren Jackson Jr. added 24 as the Grizzlies built a first-half lead and coasted to a 131-117 victory over the Atlanta Hawks on Friday night.\n\n\"The energy was more like a spectacle,\" Jackson said of pregame fireworks, dancers and the performance by Memphis rapper Young Dolph in the home opener. He later added: \"It's a blur. I ain't gonna lie. I really can't (remember specifics).\"\n\nTemple, obtained in a July trade, missed only one of his 11 shots, making 5 of 6 from 3-point range. While Jackson, the fourth overall pick in last summer's draft, was starry-eyed and giddy with youthful exuberance, Temple, in his ninth NBA season, was more of a steady vet.\n\nParticularly after coach J.B. Bickerstaff texted him Thursday night asking for more leadership to help the Grizzlies forget their season-opening 111-83 loss at Indiana on Wednesday.\n\n\"That's part of the reason they brought me here, for my leadership and competitive toughness,\" Temple said. \". I just wanted to have a pace offensively and do some things defensively.\"\n\nOf his offense, he said: \"The rim opened up for me.\"\n\nMike Conley finished with 16 points and 11 assists for Memphis.\n\nTaurean Prince led the Hawks with 28 points, while Trae Young, the No. 5 overall pick in the draft, added 20 on 7-for-18 shooting. Miles Plumlee and DeAndre' Bembry each added 12 points.\n\n\"For sure not happy with the result, but I feel like I'm getting more comfortable out there,\" Young said of his second NBA regular-season game. \"I'm getting more comfortable with my teammates.\"\n\nThe Hawks, considered one of the league's weakest teams, fell way off the pace in the second quarter when the Grizzlies outscored Atlanta 40-28. From there, the Hawks never really threatened and Memphis extended its lead to 25 points in the third quarter.\n\n\"When we get down so much, and we have to battle back, we're putting ourselves in bad spots early on,\" Young said. \"It's hard for us to battle back and take the lead and things like that.\"\n\nMemphis, which shot 29.8 percent in Wednesday's loss at Indiana, reversed that trend against the Hawks. The Grizzlies finished the game connecting on 54 percent of their shots, including 13-for-26 shooting from beyond the arc.\n\nThe tone was set early as the Memphis offense clicked to a 77-61 lead at the break, the 77 points matching a franchise record for points in any half.\n\n\"We didn't start with the intensity that we wanted to start with defensively and the guys know, and they feel it and understand that,\" Hawks coach Lloyd Pierce said. \"We just have to apply it to the court. But we did get better (Friday night); we've just got to put it together for 48 minutes.\"\n\nTIP-INS\n\nHawks: F Omari Spellman sat out with a sore left ankle after rolling it in Wednesday night's loss to the Knicks. ... Young's corner 3-pointer came just before the buzzer ending the first quarter, giving him 13 points in the frame. He was outdone by 15 from Prince. ... Prince's 28 points marked the sixth straight game -- spanning two seasons -- that he has scored at least 20 points.\n\nGrizzlies: C Marc Gasol was a game-time decision with a sore back. He finished with 13 points. ... Memphis had 77 points in the second half against Golden State on Jan. 3, 2007. The previous first-half standard was 74 on two occasions. ...Temple made his first six shots before his only miss with 7:37 left in the third period. His career-high is 34 against Orlando last season, when he was with Sacramento. . Starting F JaMychal Green left in the third quarter with a mouth injury and did not return.\n\nYOUNG AND OLD\n\nThe game featured the league's second-youngest player in Jackson Jr., 19 years old, and the oldest in 41-year-old veteran Vince Carter, who started the game for the Hawks. Jackson wasn't born when Carter debuted with the Toronto Raptors in 1998.\n\nUP NEXT\n\nHawks: At Cleveland on Sunday.\n\nGrizzlies: At Utah on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994148.894971
}