{
  "game_id": "0021800746",
  "espn_id": "401071419",
  "date": "Jan 28, 2019",
  "matchup": "BKN @ BOS",
  "headline": "Brown and Smart carry Celtics past short-handed Nets 112-104",
  "body": "BOSTON --  The Boston Celtics blocked out an emotional loss to the Golden State Warriors over the weekend.\n\nThey swatted away a franchise record-tying number of shots, too.\n\nJaylen Brown and Marcus Smart each scored 21 points, and the Celtics beat Brooklyn 112-104 on Monday night to snap the injury-riddled Nets' six-game winning streak.\n\nAron Baynes had 16 points, Marcus Morris 15, and Al Horford and Terry Rozier each had 14 for Boston, which tied a franchise record with 16 blocked shots and won for the sixth time in seven games. Horford had 11 rebounds.\n\nThe Celtics played without star guard Kyrie Irving, who was sidelined with a sore left hip.\n\nBoston lost a tough 115-111 contest against the Warriors on Saturday.\n\n\"We're professionals and you've got to move onto the next one,\" Smart said. \"We were short, Kyrie wasn't playing. A lot of guys needed to step up and they did tonight.\"\n\nBrown said the Celtics wanted to carry some of the energy from the loss into the game.\n\n\"It's a hot team,\" he said. \"We wanted to come out and break some of their confidence.\"\n\nD'Angelo Russell led the Nets with 25 points and Shabazz Napier had 20. Brooklyn had won 19 of its previous 24 games.\n\n\"I'm just disappointed; I didn't think we made the extra pass tonight,\" Brooklyn coach Kenny Atkinson said of the blocked shots. \"When they are coming, we've got to kick it for open shots. I felt like it was a little too much put your head down and go against two guys at the rim. We've got to do a better job of making that extra pass.\"\n\nBrooklyn was missing five regular players.\n\n\"It is what it is. It's something that we're going into the game knowing that, so it's not our excuse,\" Russell said. \"Everybody has to step up. It's not the first time we've had to do that, but it's definitely tougher.\"\n\nThe Celtics took charge with an 11-0 run early in the final quarter. Brown capped the spree with a 3-pointer from the right corner, pushing Boston's lead to 102-90 with just over 7 minutes to play.\n\nBoston used a 14-2 run midway into the second quarter en route to a 60-50 halftime edge. Brown triggered the spurt with a 3 and scored seven points.\n\nTIP-INS\n\nNets: Their next win will be the 28th, matching the total for last season. Also, they can match last season's road total of 13 with their next road victory. ... They had won 10 of their first 12 games in January.\n\nCeltics: Coach Brad Stevens explained the need to be smart handling Irving's days he doesn't play. \"He's very open and candid when he's not feeling great,\" he said. \"We're very alert to that and want to make sure we prioritize not only to the short-term health, but obviously to the long term. We were going to sit him eight to 12 games anyways, so when he has nicks and bruises it makes sense to sit.\" ... F Gordon Hayward needed two stitches to close a first-quarter cut on his left hand, but he returned to the floor in the second. Smart also had a cut over his right eye.\n\nBLOCK PARTY\n\nThe 16 blocked shots matched the record set on Jan. 21, 1983, against Chicago. Boston had a season-high 12 blocked shots -- with Horford getting a half dozen -- in the opening half, matching the most by an NBA team for a half this season, according to the Elias Sports Bureau.\n\nThe New York Knicks also had a dozen.\n\nSTICK TO THE PLAN\n\nAs one of the NBA's surprise teams, Atkinson has tried not to waver from his concept on how to turn things around after two losing seasons.\n\nIt's worked so far.\n\n\"What's hard when you're losing is to stick with that culture, not go off the rails and start changing things,\" Atkinson said. \"We did change some things, but the basic foundation of what we wanted to do was established in the beginning and kept on the same way. It's great that we're starting to reap some results.\"\n\nBANGED UP\n\nAtkinson thinks his team has learned the hard way about dealing with injuries.\n\n\"That's been part of our maturity and our confidence, not looking for the guys that are out,\" he said.\n\nThey were missing six players Monday -- five that get decent minutes: F Treveon Graham (sore lower back), G Spencer Dinwiddie (surgery Monday, right thumb), F Allen Crabbe (sore right knee), F Jared Dudley (strained left hamstring), F Caris LeVert (right foot injury) and G/F Dzanan Musa (left shoulder injury).\n\nUP NEXT\n\nNets: Host the Bulls on Tuesday.\n\nCeltics: Host the Hornets on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995405.194378
}