{
  "game_id": "0021501074",
  "espn_id": "400828961",
  "date": "Mar 25, 2016",
  "matchup": "CHA @ DET",
  "headline": "Playoff-chasing Pistons win again, 112-105 over Hornets",
  "body": "AUBURN HILLS, Mich. -- Marcus Morris and the Detroit Pistons are on quite a roll offensively, and each win moves them another step closer to a playoff spot.\nMorris scored 20 points, and the Pistons overwhelmed Charlotte with their highest-scoring first half of the season en route to a 112-105 win over the Hornets on Friday night. Detroit led 72-56 after two quarters and won its fifth straight game, taking a two-game lead over Chicago for the eighth and final playoff spot in the Eastern Conference.\n\"This game meant a lot, other than just making the playoffs,\" Morris said. \"It meant a lot to prove something to ourselves that we could play with them.\"\nCharlotte won the first two meetings with the Pistons this season by 20 and 15 points, but this matchup was a blowout in the opposite direction for most of the night. Andre Drummond had 18 points and 14 rebounds, and Reggie Jackson added 17 points for Detroit.\nMorris scored 19 of his 20 points in the first half. Kentavious Caldwell-Pope scored 16 of his 21 in the second half.\nKemba Walker scored 25 of his 29 points in the first half for Charlotte.\nThe Pistons pulled within a percentage point of seventh-place Indiana. The Hornets fell 1 1/2 games behind first-place Atlanta in the Southeast Division.\nAn alley-oop to Drummond gave Detroit an early 12-3 lead, and it was 34-18 after a 3-pointer by Anthony Tolliver. The Pistons led by as many as 22 points in the second quarter, and they still had a comfortable advantage even after Walker threw in a shot from midcourt at the halftime buzzer.\nDetroit's lead reached 26 points in the fourth quarter before the Hornets went on a 25-4 run to cut the margin to five with less than a minute left, but the Pistons held on.\n\"They're a desperate team that's trying to make the playoffs and they play like a desperate team,\" Charlotte's Cody Zeller said. \"They had good play across the board and we didn't match their intensity.\"\nMorris went 3 of 7 from 3-point range and is now 21 of 32 from beyond the arc in the last eight games. The Pistons have scored at least 112 points six times in that span.\nDetroit (39-34) now has its most wins since finishing 39-43 in 2008-09, which was also the last season the Pistons made the playoffs. They reached 50 wins in seven straight seasons before that.\nLATE SLIDE\nThe Pistons had to make a few free throws at the end to secure the win after going quiet offensively for most of the fourth quarter. Coach Stan Van Gundy wasn't dwelling too much on that unimpressive finish to the game.\n\"We played 39 great minutes,\" Van Gundy said. \"We really outplayed a very good team for 39 minutes, and then their last five guys played really well against us and we didn't handle that well. We didn't handle it very professionally the last nine minutes, but when we played against their best players, we were dominant.\"\nThe Hornets made a couple 3-pointers in the final minute, and it was 108-103 with 37.6 seconds left, but Detroit was able to close the game out from there.\n\"We needed to be able to get one steal and a quick basket to have any chance,\" Charlotte coach Steve Clifford said. \"So we never really got to that point.\"\nTIP-INS\nHornets: Walker equaled his own team mark for most points in a half this season. He scored 25 in the second half on Dec. 28 against the Los Angeles Lakers.\nPistons: Detroit's highest-scoring first half previously was 67 points against Sacramento on March 18. The Pistons have scored 73 points in the second half twice this season. ... The NBA announced that Drummond received the February NBA Cares Community Assist Award for his efforts to empower youth with special needs and give back to the Detroit community. The award is presented by Kaiser Permanente.\nUP NEXT\nHornets: At Milwaukee on Saturday night.\nPistons: Host Atlanta on Saturday night.\n---\nThis version corrects the margin of victory of Charlotte's first victory over Detroit this season. It was a 20-point win.",
  "source": "espn_api",
  "crawled_at": 1764994344.236168
}