{
  "game_id": "0021500325",
  "espn_id": "400828212",
  "date": "Dec 09, 2015",
  "matchup": "LAL @ MIN",
  "headline": "Martin, Towns lift Timberwolves over Lakers, 123-122 in OT",
  "body": "MINNEAPOLIS -- Kobe Bryant went to the bench late in the third quarter for a rest, and then the ultimate shot-taker delivered one of the first passes of his retirement tour.\nAs the Los Angeles Lakers played a tight game against the Minnesota Timberwolves into the fourth quarter, Bryant told coach Byron Scott to \"let the kids play.\"\nIt's an approach Kevin Garnett has already been taking with his Timberwolves.\nKevin Martin scored 37 points and Karl-Anthony Towns had 26 points and 14 rebounds to lift the Timberwolves to a 123-122 overtime victory over the Lakers on Wednesday night.\n\"It's amazing to see the league, see how it's going and how much young talent is present,\" Towns said. \"It's a great thing to see we're taking up from the people that have come before us and trying to play at a high level.\"\nMartin went 6 for 9 from 3-point range and scored 17 in the fourth quarter to help the Timberwolves (9-12) improve to 3-9 at home this season. Towns made 11 of 19 shots and tied a career high for rebounds.\nD'Angelo Russell scored a career-high 23 points and Julius Randle had 20 points and 12 rebounds for the Lakers (3-19) in what was likely Bryant's last game in Minnesota. Bryant scored 11 points on 5-for-13 shooting, but sat the entire fourth quarter and overtime.\n\"They were playing with good energy and great momentum,\" Bryant said of Russell and Randle. \"Just let `em go.\"\nRussell scored nine of the Lakers' final 11 points in regulation, including a runner with 2.2 seconds to play to force overtime. But Martin hit a 3 and Andrew Wiggins scored on a runner with 55 seconds left in the extra period.\nThe Lakers had a chance to win in overtime, but Russell and Roy Hibbert missed jumpers in the final 9.4 seconds.\n\"I mean, that's an honor for him to say something like that knowing that he could have easily told Coach he wants that shot just to add to his collection,\" Russell said of Bryant. \"He probably would have made it.\"\nMore than 18,000 fans spent the last four minutes chanting \"We Want Kobe!\" in an effort to soak up as much of the Lakers star as they could.\nBryant opened the door for this kind of farewell tour when he announced his plans to retire on Nov. 29. He has been serenaded throughout Los Angeles' road trip, which included visits to his hometown Philadelphia, Washington, Detroit and Toronto, the place he scored a career-high 81 points when current Timberwolves coach Sam Mitchell was coaching the Raptors.\nBut Minneapolis has always had a special affection for Bryant and the Lakers. This is where the franchise got its start before moving to Los Angeles and many fans here have clung to that kinship as a coping mechanism through the struggles the Timberwolves have endured.\nKobe passed Michael Jordan on the NBA's career scoring list at Target Center last season, and Wolves public address announcer Rod Johnson introduced him before the game as \"one of the greatest players of all-time.\"\nBryant hit his first three shots, including a 3-pointer, but hit just two of his next 10 shots. And even when it was tight late, Bryant said he never hesitated to stay on the bench.\n\"Not even an inkling,\" Bryant said. \"Coming off the floor, D'Angelo said, `Hey man you've made plenty of those. That was close. It felt good.'\n\"I said, `I've made plenty of them and missed plenty of them, too. It's your first shot, but it won't be your last. So on you go.\"\nMARTIN BREAKS OUT\nMartin had been shooting just 31 percent in 15 games since he missed one due to personal reasons. He called it the longest slump of his career, and he clutched on his right wrist for most of the game after a collision in the first quarter.\nIt was reminiscent of a game last year against the Knicks when he scored 37 points despite breaking a bone in his hand in the first quarter. He will get an X-ray on Thursday.\n\"It's similar\" to the break against the Knicks last November, Martin said. \"It hasn't been a fun wrist for about a year, so we'll see how it is. Hopefully it's all right.\"\nBLAST FROM THE PAST\nBryant met with Bob Williams before the game. Williams played with the Minneapolis Lakers from 1955-57. The 84-year-old was the Lakers' first black player.\n\"He's a pioneer,\" Bryant said. \"It's hard for us to imagine as players in today's game what it must've been like for him to go through the difficulties he faced personally and professionally.\"\nTIP-INS\nLakers: Scott said he has not had a talk with Randle and Russell about their demotions to the bench. He said it will be re-evaluated after 10 games. \"They've been OK,\" Scott said. \"They haven't been moping around or anything like that. It's a big boys' league, simple as that. Just have to come to work every day.\"\nTimberwolves: C Gorgui Dieng missed his first free-throw attempt of the game, snapping a string of 22 straight makes.\nUP NEXT\nLakers: Visit San Antonio on Friday.\nTimberwolves: Visit Denver on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994299.620556
}