{
  "game_id": "0022300521",
  "espn_id": "401585149",
  "date": "Jan 10, 2024",
  "matchup": "ATL vs. PHI",
  "headline": "Jalen Johnson stars as Hawks outlast Embiid-less 76ers, 139-132 in overtime",
  "body": "ATLANTA -- — This time, Jalen Johnson and the Atlanta Hawks finished a close win at home.\n\n\r\n              Johnson hit two tying free throws in overtime and then added a go-ahead 3-pointer with 39 seconds remaining, sending the Hawks to a 139-132 victory over Tyrese Maxey and the Philadelphia 76ers on Wednesday night.\n\n\r\n              Atlanta (15-21) is off to a disappointing start this season, hurt by an inability to win close games. It improved to 6-9 at home.\n\n\r\n              “It's huge,” Johnson said. “We need to understand how important it is to protect home court.”\n\n\r\n              Johnson, who had 25 points, 16 rebounds and seven assists in the opener of a five-game homestand, added two more free throws with 13 seconds remaining.\n\n\r\n              Maxey had 35 points, nine assists, eight rebounds and four steals before fouling out with 1:44 remaining in overtime. Trae Young drew the foul.\n\n\r\n              “I knew he had five fouls and I knew he wasn't going to try to foul again,” Young said, adding he attacked when he saw Maxey on his heels.\n\n\r\n              Philadelphia coach Nick Nurse said watching a replay of the sixth foul “was pretty hard to take for a guy who was really fun to watch tonight.”\n\n\r\n              Tobias Harris added 32 points for the 76ers (23-13), who played without Joel Embiid and suffered their third straight loss.\n\n\r\n              Trailing 125-124, Atlanta called a timeout with 15 seconds remaining in regulation. Maxey was called for a foul on Young's drive to the basket with 12.1 seconds to go. A review upheld the foul. Young missed the first free throw but made the second. Maxey missed a late chance to end the game in regulation.\n\n\r\n              The Hawks snapped a two-game losing streak with their first win over the 76ers in three tries this season. Young scored 28 points and Dejounte Murray had 25. \n\n\r\n              Each team held out its starting center because of an injury. Embiid, the reigning NBA MVP, missed his second consecutive game with swelling in his left knee. Paul Reed was the fill-in starter.\n\n\r\n              Atlanta's Onyeka Okongwu had 19 points and 11 rebounds as the fill-in starter for Clint Capela (right Achilles tendon soreness). Hawks small forward De’Andre Hunter (right knee inflammation) missed his ninth consecutive game.\n\n\r\n              Embiid did not travel with the team to Atlanta but worked on the court in Philadelphia. Nurse said he hopes Embiid will be available against Sacramento on Friday.\n\n\r\n              The Hawks emphasized Okongwu early as they attempted to take advantage of Embiid's absence. Okongwu, whose career high is 21 points, scored 11 of Atlanta's first 18.\n\n\r\n              Philadelphia forward Robert Covington also did not play due to swelling in his left knee. \n\n\r\n              Atlanta's 14 home games before Wednesday night were the fewest in the league. The Hawks had not played so few home games in their first 35 games since their 1967-68 inaugural season in Atlanta.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host the Kings on Friday night.\n\n\r\n              Hawks: Host Indiana Pacers on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996294.5134232
}