{
  "game_id": "0021600422",
  "espn_id": "400899864",
  "date": "Dec 20, 2016",
  "matchup": "ORL @ MIA",
  "headline": "Magic rally twice, then outlast Heat 136-130 in 2OT",
  "body": "MIAMI --  Being down five in the final minute of regulation did not doom the Orlando Magic, nor did a four-point deficit late in the first overtime.\n\nInstead, they fought back and got a rare win over their Florida rival.\n\nNik Vucevic had 26 points and 12 rebounds, Evan Fournier scored 26 and hit the 3-pointer with 1:26 left that put Orlando up for good, and the Magic topped the Heat 136-130 in double overtime Tuesday night.\n\n\"We kept fighting,\" Fournier said, \"and it paid off for us.\"\n\nTyler Johnson had a career-high 32 points, the most any Heat reserve has ever scored in a game. Hassan Whiteside had 32 points and 15 rebounds for Miami, which wasted a five-point lead in the final minute of regulation and a four-point lead in the last 40 seconds of the first overtime.\n\nGoran Dragic added 19 for Miami. The Heat -- the NBA's worst foul-shooting team -- missed one late in regulation that could have made it a three-point game, and four straight from the line in the first overtime that proved costly.\n\n\"There's some really good things that happened over the course of the game,\" Heat coach Erik Spoelstra said. \"That's why I really feel for the guys in the locker room. Team really competed ... and I love going through those moments.\"\n\nElfrid Payton scored 22 points and Serge Ibaka added 20 for the Magic, who beat Miami for the third time in the last 19 meetings.\n\nThe game came two days after the Magic lost by 30 at home against Toronto, and Orlando coach Frank Vogel wouldn't let his team forget.\n\n\"That was the challenge that was presented to each guy every time we got down tonight: `Are we going to give or are we going to fight?\" Vogel said. \"And our guys responded in a big-time way.\"\n\nMiami led by 12 in the first half and by nine early in the fourth. But Orlando went on a 12-0 run later in the final quarter, then rallied twice more in the extra sessions.\n\nTIP-INS\n\nMagic: Dante Marchitelli, the sideline reporter on Magic television broadcasts, paid tribute to the late Craig Sager by wearing a jacket with a loud floral print and pink pocket square. ... Ibaka, who had a total of five 3-pointers his first 19 times facing the Heat, was 4 for 5 from beyond the arc.\n\nHeat: The previous Heat scoring record by a reserve was 29 points, by Voshon Lenard in 1999. ... It was the most points Miami ever scored in a loss. ... Whiteside became the second Heat player to have five consecutive 15-rebound games. Rony Seikaly was the other. ... Miami was without Wayne Ellington (strained right hamstring), Dion Waiters (groin) and Rodney McGruder (sprained left ankle).\n\nREAL DEAL\n\nFormer heavyweight champion Evander Holyfield was at the game. He presented Alonzo Mourning with a custom Heat championship belt at halftime.\n\nROAD MAGIC\n\nOrlando is only 5-10 at home, but 8-7 on the road. \"I think we're a pretty good team,\" Vogel said. \"The bigger, more pressing question is why we haven't had success at home. I think we're a solid basketball team with realistic playoff aspirations.\"\n\nDOUBLE DIGITS\n\nThis may seem a bit unusual for a team that's struggled to score at times: The Heat have a league-high eight players averaging 10 or more points per game -- Dragic, Whiteside, Waiters, Ellington, Tyler Johnson, Winslow, Richardson and James Johnson.\n\nUP NEXT\n\nMagic: Visit the New York Knicks on Thursday, wrapping up a quick two-game trip.\n\nHeat: Host the Los Angeles Lakers on Thursday, ending a six-game homestand. Shaquille O'Neal's No. 32 Heat jersey will be retired at halftime.",
  "source": "espn_api",
  "crawled_at": 1764995859.10558
}