{
  "game_id": "0022300321",
  "espn_id": "401584949",
  "date": "Dec 14, 2023",
  "matchup": "MIN @ DAL",
  "headline": "Naz Reid, Timberwolves shake off slow start, beat Luka Doncic and Mavs 119-101",
  "body": "DALLAS -- — Naz Reid score 19 of his season-high 27 points in the first half, Karl-Anthony Towns had 21 points and a season-high 17 rebounds, and the Minnesota Timberwolves shook off an early 15-point deficit to beat Luka Doncic and the Dallas Mavericks 119-101 on Thursday night.\n\n\r\n              The Wolves (18-5) took the lead for good midway through the third period and led by as many as 22. They avoided their first losing streak of the season and matched Boston for the NBA’s best record.\n\n\r\n              Minnesota was coming off a 121-107 loss at New Orleans on Monday.\n\n\r\n              “They refocus fast,” Wolves coach Chris Finch said. “They don’t really let one performance bleed into the next.”\n\n\r\n              Doncic had 39 points and 13 rebounds for the Mavericks, who had won four in row. It was the ninth consecutive game with at least 30 points for Doncic, who entered second in the NBA in scoring at 32.0 points.\n\n\r\n              Minnesota, which came in allowing the second-fewest points in the league at 105.9 per game, held Dallas to its third-lowest scoring game of the season and worst game shooting behind the arc (21.9% on 7 of 32).\n\n\r\n              Anthony Edwards, the Wolves’ leading scorer, returned to the lineup after missing three of the previous five games with a right hip pointer. Averaging 24.4 points coming in, he scored nine.\n\n\r\n              Reid hit a career-best seven 3-pointers, tying a franchise record for a reserve. It was the third time this season someone other than Edwards or Towns led Minnesota in scoring.\n\n\r\n              “You love to see all the guys trying to get me the ball,” Reid said. “I think with the firepower on this team, anybody can have a crazy night like that.”\n\n\r\n              The Mavericks played their third consecutive game without Kyrie Irving, who has a foot injury.\n\n\r\n              Dallas led 60-59 at halftime with Doncic scoring 26 points on 9-of-15 shooting. The Mavericks shot 51.1% in the first half, hitting 6 of 18 3-pointers. In the second half, they shot 42.1%, making 1 of 14 behind the arc.\n\n\r\n              Doncic was 2 of 7 on 3-pointers, and Tim Hardaway Jr. was 0 of 7.\n\n\r\n              “It’s just one of those nights,” Dallas coach Jason Kidd said. “We got great looks. Minnesota’s the best team in the league. We thought we were playing well. Give them credit.”\n\n\r\n              Doncic was assessed a technical foul in the first half and said he was told, “I can’t clap. I’m serious. It’s crazy, man.”\n\n\r\n              Doncic also had a first-half 3-pointer taken off the board at halftime when it was determined he was out of bounds.\n\n\r\n              “If the refs don’t call it, they can go back and check?” he said. “That’s the first time I saw that.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host Indiana on Saturday.\n\n\r\n              Mavericks: At Portland on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996488.207338
}