{
  "game_id": "0021801022",
  "espn_id": "401071695",
  "date": "Mar 14, 2019",
  "matchup": "SAC @ BOS",
  "headline": "Irving's triple-double leads Celtics past Kings 126-120",
  "body": "BOSTON --  The Boston Celtics are running out of time to work out their kinks with the postseason a month away.\n\nFor the second time in just over a week, they needed some late-game heroics to fend off a Kings team whose playoff hopes have been fading for weeks.\n\nKyrie Irving had 31 points, 12 assists and 10 rebounds to help the Boston overcome a 17-point first-half deficit to beat Sacramento 126-120 on Thursday night.\n\nIt was Irving's second career triple-double. His first was with Cleveland on Feb. 28, 2014, against Utah.\n\nJaylen Brown added 22 points, and Marcus Morris finished with 21 points and 13 rebounds.\n\nIt was Boston's second victory over Sacramento in eight days, and the Celtics' fourth win in five games overall.\n\nAs happy as he was with the comeback, Irving said it doesn't compare to the mentality Boston will need in the postseason to be successful.\n\n\"It's going to be a dogfight, no matter who you are playing against,\" Irving said. \"Obviously, when you have a team fighting for playoff position, it is going to be that type of intensity and you have to be ready for it.\"\n\nBuddy Hield led Sacramento with 34 points. Harrison Barnes added 20, and De'Aaron Fox had 19 points, nine assists and seven rounds as the Kings lost for the 11th straight time in Boston.\n\nThe Kings have dropped 13 of 17 road games as their hopes of catching the Clippers for the Western Conference's final playoff spot took another hit.\n\n\"Still believe we have a chance to make the playoffs,\" Hield said. \"We suck right now. We have to close out games better and I don't know if it's the pressure or something else.\"\n\nSacramento had split the first two games of its four-game trip. The Kings were hoping for a boost with rookie Marvin Bagley III returning after spraining his left knee in a home loss to Milwaukee on Feb. 27 and missing five games.\n\nHe played only 10 minutes in the first half but had 10 points to help the Kings build a 17-point lead. He finished with 14 points and six rebounds.\n\nThe Celtics returned home on the mend following a 3-1 West Coast trip.\n\nJayson Tatum was back in the starting lineup after missing a game with right shoulder soreness. Smart was battling a cold but also started. Meanwhile, Terry Rozier and Daniel Theis both sat out with illnesses.\n\nIt had its effect. Despite playing on two days' rest, the Celtics were slow on switches on defense and relied on jump shots early. They stayed close thanks in large part to Irving's 19 first-half points.\n\nBoston was much more energetic in the third quarter, opening on a 9-2 run to take its first lead since early in the first quarter.\n\nSacramento led 89-79 with less than three minutes to play in the period before a 3 by Irving and three straight 3-pointers by Brown put the Celtics back in front.\n\nBoston led by as many as 13 in the fourth quarter.\n\nTIP-INS\n\nKings: Outscored the Celtics 22-11 in fast-break points.\n\nCeltics: Irving is the first Celtics player to record 30-plus points and a triple-double in the same game since Rajon Rondo on Feb. 12, 2012, against the Bulls. ... Boston shot 39 percent (10 for 26) in the field in the first quarter and 1 for 12 from the 3-point line in the first half.\n\nACCURATE KINGS\n\nBoston missed eight of its first 10 shots as the Kings sprinted out to a 17-6 lead in the first quarter\n\nAnd much like in the Celtics' 25-point loss against the Clippers on Monday, Sacramento was able to rack up easy transition baskets.\n\nThe Kings ended the quarter with a 38-25 lead, shooting 70 percent from the field and connecting on four 3-pointers. Barnes led Sacramento with 11 points in the quarter. Hield added 10, going 4 for 4 from the field and 2 for 2 from deep.\n\nUP NEXT\n\nKings: Visit Philadelphia on Friday.\n\nCeltics: Host Hawks on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764994172.919195
}