{
  "game_id": "0021600509",
  "espn_id": "400899381",
  "date": "Jan 01, 2017",
  "matchup": "DET @ MIA",
  "headline": "Pistons rally past short-handed Heat, 107-98",
  "body": "MIAMI --  When Detroit coach Stan Van Gundy was told pregame how many Miami players were missing because of injuries, he immediately figured that his team would be tested.\n\nHe was right.\n\nFortunately for him, the Pistons responded.\n\nReggie Jackson scored 27 points, Andre Drummond finished with 25 points and 18 rebounds and the Pistons wore down the depleted Heat for a 107-98 victory Sunday night. Miami was without five players, all of whom have started this season -- and had more than 70 percent of its payroll unable to play for a variety of reasons.\n\n\"When other guys get opportunities to have the ball in their hands, it's a dangerous thing,\" Van Gundy said.\n\nAnd it was, for a while. The Heat made their first eight shots and scored 66 points in the first half. But after that sizzling beginning, Miami shot 39 percent the rest of the way and managed only 32 points after halftime.\n\nThe Heat were without what could have been a starting lineup -- Goran Dragic (back), Dion Waiters (groin), Justise Winslow (shoulder), Josh McRoberts (foot) and Hassan Whiteside (eye).\n\n\"They played better,\" Heat coach Erik Spoelstra said, after his team dropped its fifth straight. \"I think to be fair, we probably ran out of gas a little bit. Not as an excuse, but we were playing guys big minutes. ... I told the guys there was nothing to be ashamed of in this game.\"\n\nKentavious Caldwell-Pope scored 23 for Detroit. James Johnson scored 20 points and Wayne Ellington had 18 for Miami, which got 14 from Josh Richardson and led by as many as 14.\n\n\"We really woke up at halftime,\" Drummond said. \"We talked about it. We came out with great intensity.\"\n\nMiami scored 15 points in the third quarter and zero points in the first 5 minutes of the fourth. Detroit took command with a 27-8 run over a stretch of a little more than 8 minutes.\n\n\"I thought we played a lot harder in the second half,\" Van Gundy said.\n\nTIP-INS\n\nPistons: Marcus Morris returned after missing Friday's game in Atlanta with a sore left knee. ... The Pistons committed five fouls in the first 1:45 of the second quarter, but the Heat only got one trip to the line while in the bonus. ... Detroit lost Aron Baynes to a sprained left ankle in the fourth quarter.\n\nHeat: Whiteside was the only Miami player to been in every game this season. Miami has now used 14 different starting lineups in the last 29 games. ... Miami plans to have its injured players, except McRoberts, travel with them when they leave on Monday for a six-game trip that starts in Phoenix on Tuesday. ... Dragic, Winslow and Whiteside could all be back as early as Tuesday.\n\nPAIR OF FIRSTS\n\nA pair of streaks ended in this game. Miami was 6-0 all-time on New Year's Day. And Detroit was 0-17 this season when trailing at the half; the Pistons were down 66-58 at the break Sunday.\n\nUDONIS AND UDRIH\n\nThe only current players in the NBA with names that start with \"Ud\" -- Miami's Udonis Haslem and Detroit's Beno Udrih, a former Heat guard -- chatted for a few minutes at midcourt before the game. Haslem logged a season-high 21 minutes for the short-handed Heat. Udrih didn't play.\n\nSPO AND STAN\n\nEven as both endure rough seasons, Spoelstra and Van Gundy remain among the NBA's winningnest active coaches. Among coaches with at least 500 games, San Antonio's Gregg Popovich is No. 1 in winning percentage, Washington's Scott Brooks is No. 2 -- followed by Spoelstra and Van Gundy.\n\nUP NEXT\n\nPistons: Host Indiana on Tuesday, opening a quick two-game homestand.\n\nHeat: Visit Phoenix on Tuesday. The Heat don't play at home again until Jan. 17.",
  "source": "espn_api",
  "crawled_at": 1764996062.902427
}