{
  "game_id": "0022000106",
  "espn_id": "401267266",
  "date": "Jan 05, 2021",
  "matchup": "CHI @ POR",
  "headline": "White scores 21 and Bulls rally to beat Blazers 111-108",
  "body": "PORTLAND, Ore. -- — Zach LaVine was blunt: The Chicago Bulls of the recent past wouldn't have come back to beat the Trail Blazers like this. \n\n\r\n                    The short-handed Bulls rebounded from a 20-point first-half deficit to down Portland 111-108 on Tuesday night. \n\n\r\n                    Coby White had 21 points and a career-high 10 rebounds, while Otto Porter Jr. added 19 points and 13 rebounds. The Bulls had seven players in double figures. \n\n\r\n                    “We didn't stop playing,” said LaVine, who finished with 18 points and nine assists. “After the first quarter, they came out hitting a lot of tough shots. It's not like we were playing bad, it just happens in a game. We got to a timeout and we just said we're going to keep playing regardless, and we got back into it.\" \n\n\r\n                    Asked point-blank if it was a game last season's Bulls would have won, LaVine emphatically said “No.”\n\n\r\n                    CJ McCollum led the Blazers with 26 points, including six 3-pointers. Damian Lillard had 24 points and nine assists. \n\n\r\n                    The Blazers led by as many as 20 points early in the game, but the Bulls chipped away at the lead, tying it in the fourth quarter at 91 on Porter's 3-pointer. Garrett Temple's 3 gave the Bulls a 96-94 lead with 6:36 left. \n\n\r\n                    Portland went up 100-98 lead on Carmelo Anthony's 3-pointer before Chicago rookie Patrick Williams' floater tied it again with 4:12 to go. Porter's pull-up jumper made it 104-100 with just over three minutes left. \n\n\r\n                    Lillard was fouled on a 3-point attempt and made all his free throws, pulling Portland within 106-103. He added two free throws with 30.8 seconds left to narrow the gap further. \n\n\r\n                    LaVine's step-back 3-pointer appeared to be the winner for Chicago — until Lillard made a 3 to get the Blazers within a point again with 5.7 seconds to go. White made a pair of free throws in the final moments and Portland fell short. \n\n\r\n                    “I think the guys just had a real good disposition when we were down about what we had to do to get back in the game,” Bulls coach Billy Donovan said. \n\n\r\n                    The Blazers (3-4) were coming off a 137-122 loss to Golden State on Sunday. Golden State's Stephen Curry scored a career-high 62 points against Portland. \n\n\r\n                    “Make no mistake. We didn't shoot the ball in the fourth quarter,\" Blazers coach Terry Stotts said. \"We lost this in the second half. Chicago out played us, they played harder than us. We let down our guard and gave up 66 points in the second half after having an outstanding first half defensively.” \n\n\r\n                    After going 0-3 to start the season, the Bulls have improved with wins in four of their last five games, including a 118-108 victory over the Mavericks, paced by LaVine's 39 points. \n\n\r\n                    The Bulls were without Lauri Markkanen, Ryan Arcidiacono, Chandler Hutchinson and Tomas Satoransky for the fourth straight game because of the league's COVID-19 protocols. Hutchinson and Satoransky tested positive and are isolating. \n\n\r\n                    The Blazers made four straight 3-pointers to open the game and went on a 14-0 run to close out the first quarter with a 39-21 lead. Gary Trent Jr.'s shot from distance gave Portland a 47-27 lead. \n\n\r\n                    The Bulls closed the gap with a 13-0 run capped by Porter's 3-pointer to get within 47-40. The Blazers went into halftime with a 54-45 lead. \n\n\r\n                     “When that adversity hits and there are momentum swings, it’s no reason to hang your head and get down,\" Donovan said. \"It’s part of the game, and you've gotta be able to compete through those moments. I thought our guys did a good job of competing and staying the course.”\n\n\r\n                    TIP INS\n\n\r\n                    Bulls: It was the first of a four-game road trip for the Bulls. ... All five of Chicago's starters were in double figures. ... Williams has started in every game his rookie season, so far. \n\n\r\n                    Trail Blazers: Forward Nassir Little was available after recovering from coronavirus. Rodney Hood was questionable with a left quad strain. ... With his first 3-pointer of the night, Lillard became the 18th player in NBA history to reach 1,800 career 3s. \n\n\r\n                    UP NEXT\n\n\r\n                    The Bulls visit Sacramento on Wednesday night. \n\n\r\n                    The Trail Blazers host the Timberwolves on Thursday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997604.37214
}