{
  "game_id": "0022301122",
  "espn_id": "401585750",
  "date": "Apr 05, 2024",
  "matchup": "TOR @ MIL",
  "headline": "Raptors snap 15-game skid and extend slump for Bucks, who lose third straight to sub-.500 team",
  "body": "MILWAUKEE -- — Gary Trent Jr. scored 31 points and Immanuel Quickley narrowly missed a triple-double as the Toronto Raptors snapped a 15-game losing streak with a 117-111 victory over the slumping Milwaukee Bucks on Friday night.\n\n\r\n              Milwaukee, playing without the injured Giannis Antetokounmpo, lost for the fifth time in its last six games, with the last three coming against Washington, Memphis and Toronto, who are all well below .500. Antetokounmpo sat out with a left hamstring injury.\n\n\r\n              “These are situations where we’ve just got to have discipline and get the job done, and we haven’t,” Bucks All-Star Damian Lillard said. “But if you ask anybody in the league, they’ll tell you these are some of the hardest times of the season.\n\n\r\n              “We've got to take accountability. Even if it was one of these games, it’s all right, the next two should be handled. So to have three of them is disappointing. We’ve just got to do better.”\n\n\r\n              Trent was 7 of 15 from 3-point range and helped the Raptors build a 14-point lead in the third quarter before the Bucks mounted a rally. But Lillard fouled out with 1:48 left and Toronto held on to take the season series from Milwaukee, 2-1.\n\n\r\n              RJ Barrett added 26 points and Quickley scored 25 while adding 11 rebounds and nine assists. Quickley was 14 of 15 at the free throw line.\n\n\r\n              “It's great when we have our guys coming back and playing,” Raptors coach Darko Rajakovic said, referring to recent injuries and absences for Barrett and Quickley for personal reasons. \"I thought during the whole stretch the team stayed together. It's good to get a win.\n\n\r\n              “Gary is one of the best 3-point shooters in the league, and it shows how much trust as a group we have in him.”\n\n\r\n              Lillard, who had missed the previous three games, led the Bucks with 36 points and six assists, while Khris Middleton had 21 points. Middleton drilled a 3-pointer to bring the Bucks within two points with 54.5 seconds left, but he missed a potential go-ahead 3-pointer moments later and the Raptors clinched the victory with four free throws.\n\n\r\n              Bobby Portis had 19 points and 10 rebounds for Milwaukee.\n\n\r\n              The Bucks fell to 15-16 since Doc Rivers took over as coach for Adrian Griffin on Jan. 26. The trio of Antetokounmpo, Lillard and Middleton has been together in just six of those games.\n\n\r\n              Milwaukee remains second in the Eastern Conference, leading Cleveland by one game and Orlando and New York by two with five games remaining for each team. The Cavaliers were idle Friday and the Magic and Knicks lost their games, to Charlotte and Chicago, respectively.\n\n\r\n              The Bucks host the Knicks on Sunday night and have two games remaining with Orlando, one at home next week and the season finale on the road on April 14.\n\n\r\n              “The last three were against pretty bad teams, and to me that's inexcusable for all of us,” Rivers said. \"This is on me. I've got to figure out what we've got to do to play at a higher pace. The defense has to be better.\n\n\r\n              “We've got to work ourselves through this.”\n\n\r\n              Rivers said Antetokounmpo went through shootaround on Friday morning and after an evaluation of his sore hamstring it was determined he would sit out. Guard Pat Beverley missed his second straight game with a right ankle injury.\n\n\r\n              Trent returned for the Raptors after missing two games with back spasms and Ochai Agbaji joined him in the starting lineup after sitting out the previous three with a right hip contusion. Barrett had missed 10 of the previous 11 games.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host New York on Sunday.\n\n\r\n              Raptors: Host Washington on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764995806.555147
}