{
  "game_id": "0021401011",
  "espn_id": "400579303",
  "date": "Mar 18, 2015",
  "matchup": "OKC vs. BOS",
  "headline": "Westbrook scores 36 to lead Thunder past Celtics 122-118",
  "body": "OKLAHOMA CITY --  A pair of 73-second stretches turned an ordinary game by Russell Westbrook's standards into another MVP-caliber performance.\n\nWestbrook scored 36 points to help the Oklahoma City Thunder beat Boston 122-118 on Wednesday night, snapping the Celtics' five-game winning streak.\n\nWestbrook's first outburst came in the third quarter. He scored eight points from the 5:22 mark to the 4:09 mark, spearheading a 13-0 run that gave Oklahoma City a 79-70 lead.\n\n\"The first two quarters, they imposed their will on us,\" Westbrook said. \"It was aggressive. We were the ones getting pushed around. Coming out of halftime, I was just trying to change the pace, bring energy, on both sides of the basketball.\"\n\nThe second big stretch for Westbrook came in the last 73 seconds of the game.\n\nHe made his only field goal of the fourth quarter, a long 2-pointer, to push Oklahoma City's lead to nine with 1:13 to play. The Thunder held on as Westbrook went 8 of 8 on free throws in the final minute, despite leaving the game for 22 seconds because he took a hit to the face. He had a small bandage under his right eye during his postgame interview session.\n\n\"It wasn't that bad,\" he said. \"(Coach) Scotty (Brooks) wanted to take me out, but I just came back in the game and tried to find a way to close it.\"\n\nIn those two spans combined, Westbrook scored 18 points in 2:26. In all, he made 19 of 22 free throws to offset an 8-for-26 shooting effort from the field. He matched Houston's James Harden for the most made free throws in a game this season, and his 22 attempts tied a career high.\n\n\"He was aggressive,\" Boston guard Avery Bradley said. \"He was just being aggressive and getting to the free throw line and that really helped his team out. That's how they really broke away.\"\n\nWestbrook, the NBA's leading scorer, also had 10 assists, five rebounds and five steals. Enes Kanter had 22 points and 10 rebounds, and Anthony Morrow added 20 points for Oklahoma City, which moved a half-game ahead of New Orleans in the race for the final Western Conference playoff spot.\n\nMarcus Smart, who played college ball at Oklahoma State, made seven 3s and led Boston with a career-high 25 points. Kelly Olynyk and Brandon Bass each added 20 points for the Celtics.\n\nBoston turned the ball over 20 times.\n\n\"They were speeding us up. We were trying to make thread-the-needle passes and passes that weren't there, myself and all of us,\" Bradley said.\n\nBoston shot 64 percent in the first half, the highest percentage the Thunder have allowed in a half this season. Oklahoma City held the Celtics to 42 percent shooting after the break.\n\nBoston led 57-53 at halftime. Smart scored 14 points and Tyler Zeller added 12 before the break, while Westbrook scored 11 points on 4-for-11 shooting.\n\nA steal and dunk by Westbrook put the Thunder ahead 88-80, and Oklahoma City led 93-81 heading into the fourth. Westbrook scored 15 points in the third, and Kanter added 10. The Thunder held the Celtics to 9-for-24 shooting in the period.\n\nSmart's 3-pointer trimmed Oklahoma City's lead to 108-100 with just under three minutes to play, and Olynyk followed with a 3 to make it a five-point game.\n\nWestbrook closed it out with his free throws.\n\n\"We were playing really hard, but we didn't balance poise and assertiveness well at the level you need to to win in this building, in a game where they played really well,\" Boston coach Brad Stevens said.\n\n---\n\nTIP-INS\n\nCeltics: G Isaiah Thomas sat out with a bruised lower back. ... F Evan Turner had four assists in the first quarter and 10 in the game. ... F Jonas Jerebko's 3-pointer at the halftime buzzer was called good, then reviewed and taken off the board.\n\nThunder: Oklahoma City learned Tuesday it would be without F Serge Ibaka indefinitely after he had a procedure on his right knee. ... Thunder F Kevin Durant is still day to day with soreness in his right foot. ... Oklahoma City improved to 24-9 at home.\n\nQUOTE OF THE NIGHT\n\nSmart, on playing in Oklahoma: \"It felt good to be back here in familiar territory. It's just one of those nights. My teammates did a good job of finding me in the right positions to score the ball.\"\n\nSTAT LINES\n\nOklahoma City made 33 of 39 free throws, while Boston hit 17 of 28. Westbrook made more than Boston's entire team.\n\nUP NEXT\n\nCeltics: At San Antonio on Friday.\n\nThunder: Host Atlanta on Friday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP",
  "source": "espn_api",
  "crawled_at": 1764991875.904125
}