{
  "game_id": "0021900114",
  "espn_id": "401160756",
  "date": "Nov 07, 2019",
  "matchup": "MIA @ PHX",
  "headline": "Butler, Dragic lead Heat over Suns 124-108",
  "body": "PHOENIX --  Goran Dragic was an All-Star just two seasons ago. Miami coach Erik Spoelstra hasn't forgotten.\n\nThe 12-year veteran might come off the bench for the Heat these days, but he's still capable of putting up big numbers and making big baskets. That was on full display Thursday night, when Dragic scored 20 of his 25 points in the second half to push the Miami Heat past the Phoenix Suns 124-108.\n\n\"It's a great luxury for us to bring an All-Star talent, in his prime still, off the bench,\" Spoelstra said. \"I don't take for that granted. And I'm going to make sure the team doesn't take that for granted.\"\n\nJimmy Butler scored 34 points and Dragic had the big second half to help Miami win for the fourth time in five games and bounce back from a 20-point loss to Denver on Tuesday. The Heat improved to 6-2 for the first time since 2012 when they had LeBron James and eventually won the NBA title.\n\nButler had 18 points by the end of the first quarter and 30 at halftime as the Heat built a 64-57 lead. Miami shot 53.5 percent in the first half, hitting 7 of 14 from 3-point range.\n\n\"That guy's special,\" Spoelstra said. \"He really is. He set the tone for the game obviously in that first half. We just played off of his offensive force. Really smart basketball, getting to the rim, getting his open looks.\"\n\nDragic, who played six seasons early in his career with the Suns, hit a 3-pointer just before the buzzer at the end of the third quarter to put the Heat up 93-86.\n\n\"If you ask any player, when you play against your former team, it's extra motivation,\" Dragic said. \"It's always nice to win here.\"\n\nPhoenix had its three-game winning streak snapped. Aron Baynes led the Suns with 23 points and Devin Booker added 22. Ricky Rubio had 11 points and 11 rebounds.\n\nCoach Monty Williams said his team's ball movement wasn't very good.\n\n\"We just didn't have it tonight and that happens,\" Williams said. \"I think it will be a great learning lesson for us.\"\n\nHERRO BALL\n\nMiami rookie Tyler Herro had another solid game with 15 points on 6 of 12 shooting, including 3 of 4 from 3-point range. Spoelstra said Herro had some defensive breakdowns, but he's always competitive on the court.\n\nThe coach said Herro wanted to guard Booker during the second half and the results were mixed.\n\n\"You gotta like the kid's guts, for better or worse,\" Spoelstra said.\n\nTOUGH SCHEDULE\n\nMiami has a tough turnaround with a road game against LeBron James, Anthony Davis and the Los Angeles Lakers in less than 24 hours on Friday night.\n\n\"No excuses,\" Dragic said. \"We'll go there and play hard and try to get a win. It's always fun to play against the best teams in the league. That's why we're here.\"\n\nTHE HOMESTAND CONTINUES\n\nPhoenix is now 1-1 on its six-game homestand. The Suns will face the Nets on Sunday and then have games against the Lakers, Hawks and Celtics.\n\nThe Suns trailed for almost the entire game against the Heat. They fought within two points at multiple points late in the third quarter, but Dragic's big shooting night ended any hope for a win.\n\n\"We just have to bring it every night,\" Booker said. \"Give credit to them. They came out playing high energy, playing real physical from the start and that directly translates to the product that happened on the court.\"\n\nTIP-INS\n\nPhoenix: Rookie guard Ty Jerome missed his eighth straight game with a sprained right ankle. ... The Suns came into the game ranked first in the league with assists on 67.4 percent of their field goals. They had 22 assists on 37 field goals against the Heat.\n\nMiami: The Heat said after the game that guard Justise Winslow was diagnosed with a concussion. He didn't play on Thursday with what the initially said was a headache ... Udonis Haslem and Dion Waiters both missed the game with a stomachache. Derrick Jones Jr. played nine minutes in the first half but didn't return in the second half with a left hip strain. ... Butler shot 9 of 10 from the field in the first half, including 2 of 2 from 3-point range. He was also 10 of 10 on free throws.\n\nUP NEXT\n\nHeat: At Los Angeles Lakers on Friday night.\n\nSuns: Host Brooklyn on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995558.636794
}