{
  "game_id": "0022401199",
  "espn_id": "401705765",
  "date": "Apr 13, 2025",
  "matchup": "POR vs. LAL",
  "headline": "Trail Blazers end season with 109-81 win over short-handed playoff-bound Lakers",
  "body": "PORTLAND, Ore. -- — Dalano Banton scored 23 points and the Portland Trail Blazers ended their season Sunday with a 109-81 victory over the playoff-bound Los Angeles Lakers, playing without Luka Doncic and LeBron James. \n\n\r\n              Rookie Dalton Knecht had 27 points for the Lakers (50-31), who had won the last six meetings with Portland. \n\n\r\n              The Lakers had already locked up the third seed in the Western Conference with a 140-109 win over Houston on Friday. The Lakers will face the sixth-seeded Minnesota Timberwolves in the opening round. \n\n\r\n              With a postseason berth secured, James (left groin strain) and Doncic (left quad soreness) were among those that did not play. Bronny James made his first start of the season, finishing with four points. \n\n\r\n              The Blazers were earlier eliminated from the postseason for the fourth straight season. But Portland, with the second-youngest roster in the league, surpassed expectations to finish 36-46. \n\n\r\n              Earlier Sunday, the Blazers announced that coach Chauncey Billups had agreed to a multi-year contract extension.\n\n\r\n              Portland held off the Lakers throughout the first half. Matisse Thybulle's 3 pointer gave the Blazers a 48-42 lead and Portland went on to extend the lead to 58-43 at the break. \n\n\r\n              Portland went on to lead by as many as 33 points. \n\n\r\n              Takeaways\r\n              Lakers: Also sat starters Rui Hachimura (patellar tendon), Austin Reaves (right ankle) and Jaxon Hayes (right hand contusion). \n\n\r\n              Trail Blazers: Were also short-handed with Anfernee Simons, Shaedon Sharpe, Scoot Henderson Deni Avdija and JeramiGrant sidelined. \n\n\r\n              Key moment\r\n              The Blazers outscored the Lakers 31-18 in the third quarter and headed to the fourth with a 89-61 lead. \n\n\r\n              Key stat\r\n              Alex Len fouled out with just 13 minutes of play for the Lakers. He finished with four points. \n\n\r\n              Up next\r\n              The Lakers host Minnesota in the opening round next weekend with the date and time to be determined. The Trail Blazers head into the offseason. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998065.7966778
}