{
  "game_id": "0021400449",
  "espn_id": "400578741",
  "date": "Dec 27, 2014",
  "matchup": "MIL vs. ATL",
  "headline": "Hawks avenge 30-point loss to Bucks, split home-and-home series",
  "body": "MILWAUKEE -- After the Bucks blew them out by 30 points a night earlier in Atlanta, the Hawks were focused on revenge Saturday.\nThey got it, winning 90-85 for their 15th win in their past 17 games.\n\"You never want to lose two in a row in this league,\" said Kyle Korver. \"It is hard to beat a team in this league two nights in a row and we didn't want to let it happen to us.\"\nThe Hawks won despite shooting 36 percent, including 9-of-29 on 3-pointers.\n\nHawks coach Mike Budenholzer credited his team's rebounding and defense, as Atlanta outrebounded Milwaukee 51-47, including grabbing 17 offensive rebounds, and forced 19 turnovers that resulted in 32 points.\nAtlanta also held Milwaukee to 39 percent shooting.\n\"That was a very good defensive effort on the road,\" Budenholzer said. \"We didn't shoot it well, you can call our offense ugly, but our effort and energy were very good.\"\nJeff Teague started his second game at point guard since returning from a hamstring injury and led the Hawks with 25 points, including 10 in the fourth quarter.\n\"It's really good to have him back,\" Korver said. \"He was able to get in the lane and really open up things for the rest of us.\"\nAl Horford added 20 points and eight rebounds, while Paul Millsap finished with 17 points and eight boards.\n\"The shots were not falling for either team,\" Horford said. \"We had to fight through it and find a way to win. That's what good teams are supposed to do.\"\nTeague scored six straight points midway through the fourth quarter to give Atlanta an 82-75 lead with 4:38 remaining when he hit a driving layup.\nBrandon Knight responded with five straight points for the Bucks, including a 3-pointer to cut the lead to 82-80 with 3:31 remaining, but Atlanta extended the lead as Milwaukee missed four straight shots.\nKhris Middleton led Milwaukee with 21 points, which tied a season high, and O.J. Mayo added 12. Jared Dudley, who made NBA history on Friday by hitting all 10 of his shots, including four 4-pointers, shot just 3-of-8 for nine points.\n\"I think the game was all about offensive rebounds,\" Bucks center Zaza Pachulia said. \"We can't let the other team get second-chance opportunities. We gave them momentum with [offensive rebounds] and the turnovers.\"\nBoth teams struggled from the floor during the first half, with the Hawks missing their first nine shots in the second quarter.\nAtlanta used a 9-2 run late in the second quarter to grab a 39-35 lead late, but Giannis Antetokounmpo hit a short jumper with 3.5 seconds remaining to cut the lead to 39-37 at halftime.\nBucks coach Jason Kidd said turnovers late in the game hurt this team.\n\"They're part of our DNA that we have to address,\" he said. \"Down the stretch, we had some turnovers after we got the stop and that hurt us, too.\"\nTIP-INS\nBucks: Larry Sanders missed his second straight game with an illness. Ersan Ilyasova also missed his second straight game after suffering a concussion in Tuesday's loss to the Hornets. That was his first game after missing nine straight following a Dec. 2 nasal fracture and then undergoing surgery. ... The Bucks hit just 4 of 23 shots in the first quarter and scored 10 points, a season low for a quarter.\nHawks: Pero Antic played despite a right ankle sprain. He scored three points and grabbed five rebounds. ... Korver, who shot 1-of-8 Friday, continued to struggle on Saturday as he hit only 2-of-9, including 2-of-7 on 3-pointers. ... The win was Atlanta's fifth straight over the Bucks in Milwaukee and Atlanta has now beaten Milwaukee 11 of the past 13 times.\nPARKER IN THE HOUSE\nBucks first-round pick Jabari Parker, who injured his knee last week and is out for the season, was at the game as the team handed out bobbleheads with his likeness. He received a large get-well banner from fans during the second quarter.\nUP NEXT\nBucks: Visit Charlotte on Monday.\nHawks: Host Cleveland on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764991809.568887
}