{
  "game_id": "0021800286",
  "espn_id": "401070967",
  "date": "Nov 25, 2018",
  "matchup": "LAL vs. ORL",
  "headline": "Vucevic, Magic hand Lakers another loss 108-104",
  "body": "LOS ANGELES --  The Orlando Magic had swept the season series against the Los Angeles Lakers once in their first 29 seasons in the NBA.\n\nIn a span of eight days, the Magic did it for the second time.\n\nNikola Vucevic had 31 points, 15 rebounds and seven assists and Terrence Ross made a go-ahead lay-up with 34 seconds left to help the Magic beat the Lakers 108-104 on Sunday.\n\nRoss scored 16 points for the Magic, who won 130-117 at home on Nov. 17.\n\n\"We're trying to build something, and wins like these can really help you build some momentum,\" Vucevic said.\n\nRoss got to the rim to break the 104-104 deadlock after LeBron James missed a step-back 3-pointer. Kentavious Caldwell-Pope missed another 3 on the ensuing Lakers possession, and Aaron Gordon got a dunk on the runout to cap off the win.\n\nOrlando was able to overcome poor starts in both games, but had to outlast a late charge to hold off Los Angeles this time after a 14-4 run tied the game with 2:24 to play.\n\nGordon had 17 points and D.J. Augustin added 12 points and nine assists for the Magic.\n\nJames had 24 points and seven assists for the Lakers, who had won three straight games and six of their past seven. Kyle Kuzma scored 21 points and Brandon Ingram added 17.\n\nAfter falling behind by many as 12 points in the first quarter, the Magic would outscore the Lakers 67-42 during the second and third quarter. Orlando made 51 percent of its shots in that stretch, including 9 of 19 3-pointers.\n\n\"It just took time, but we stuck with it and put ourselves in position to win,\" Ross said.\n\nLakers players blamed their inability to protect their lead on a lack of effort.\n\n\"Defensively, we kind of broke down and the energy level was a little lower than our expectations, and they took advantage of that,\" James said.\n\n\"NIGHTMARE\" NIK\n\nVucevic averaged 33.5 points, 14 rebounds and 3.5 assists against the Lakers this season, living up to Lakers coach Luke Walton's pregame description of the former Southern California star as a \"nightmare to matchup with\" because of the versatility of his offensive game.\n\n\"He's got our number this year,\" James said. \"All you can say.\"\n\nSIMMONS' SPARK\n\nMagic coach Steve Clifford credited Jonathon Simmons for helping the team overcome a slow start with his intensity off the bench in the second quarter. Simmons had two points and three assists in the quarter, giving Orlando its first lead of the game on a lay-up with 23 seconds to go before James knocked down a 3 at the buzzer. \"He brought a toughness to our team and the energy level that up until that point we had lacked,\" Clifford said.\n\nSimmons finished with 10 points, helping the Magic's bench outscore the Lakers 42-21.\n\nTIP-INS\n\nMagic: Clifford has not decided whether F Wes Iwundu will remain in the starting lineup when Jonathan Isaac is no longer playing on a minutes restriction. Isaac had six points and five rebounds against the Lakers in his third game back after missing six games because of an ankle injury. \"The challenges of the day are the only things I am worried about,\" Clifford said.\n\nLakers: JaVale McGee finished with 12 points, seven rebounds and seven blocks. McGee and New Orleans C Anthony Davis are the only players in the NBA with at least five blocks in four games this season. . Lance Stephenson had 13 off the bench. . Lonzo Ball had nine points and 10 assists, his second game this season with double-digit assists\n\nUP NEXT\n\nMagic: At Golden State on Monday.\n\nLakers: At Denver on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995027.562356
}