{
  "game_id": "0022400607",
  "espn_id": "401705173",
  "date": "Jan 21, 2025",
  "matchup": "MIA vs. POR",
  "headline": "Simons and Ayton lead Trail Blazers to 116-107 win over Heat",
  "body": "MIAMI -- — Anfernee Simons scored 24 points, Deandre Ayton had 22 points and 15 rebounds, and the Portland Trail Blazers beat the Miami Heat 116-107 on Tuesday night.\n\n\r\n              Jerami Grant finished with 18 points and Deni Avdija added 16 for the Blazers, who lost by 60 the last time they played in Miami on March 29.\n\n\r\n              Shaedon Sharpe had 12 points while Scoot Henderson and Dalano Banton finished with 11 each.\n\n\r\n              Rookie Kel’el Ware had 20 points and 16 rebounds and Duncan Robinson finished with 22 points for the Heat, playing without leading scorer Tyler Herro, who missed his first game of the season because of groin tightness. Jimmy Butler had 13.\n\n\r\n              The Blazers extended a six-point lead early in the third period with a 21-8 run. Ayton scored eight points during the surge that put Portland ahead 86-63.\n\n\r\n              Down 21 early in the fourth, the Heat narrowed the gap with a 19-4 run. Jaime Jaquez’s two free throws with 1:58 remaining got Miami within 112-105 before Grant made three of four free throws to give Portland a 115-105 lead with 35 seconds left.\n\n\r\n              Takeaways\r\n              Trail Blazers: Didn’t commit their first turnover until Henderson’s errant pass with 8:11 remaining in the third quarter. It was the first time they didn’t commit a turnover in a half since Jan. 16, 2019 against Cleveland.\n\n\r\n              Heat: After making 5 of 7 3-pointers in the first period the Heat then missed 19 straight from behind the arc. Ware’s 3-pointer with 3:13 remaining in the third quarter ended the drought.\n\n\r\n              Key moment\r\n              Grant’s 3-pointer and Ayton’s layup in the final minute of the first half gave the Blazers the lead for good at 61-55.\n\n\r\n              Key stat\r\n              The Blazers made 6 of 12 3-pointers in the third period that helped build largest lead at 92-65.\n\n\r\n              Up next\r\n              The Trail Blazers visit Orlando while the Heat play at Milwaukee, both on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996909.636843
}