{
  "game_id": "0022000039",
  "espn_id": "401267199",
  "date": "Dec 27, 2020",
  "matchup": "SAC vs. PHX",
  "headline": "Suns use 2 big 2nd-half runs to beat Kings 116-100",
  "body": "SACRAMENTO, Calif. -- — Mikal Bridges scored 22 points, Cameron Johnson had 21 in 21 minutes and the Phoenix Suns pulled away with two big second-half runs to beat the Sacramento Kings 116-100 on Sunday night.\n\n\r\n                    Devin Booker added 20 points, five rebounds and five assists, and Deandre Ayton had 11 points and 15 rebounds for the Suns, a night after a 106-103 loss in the opener of the two-game set in Sacramento. That loss snapped the Suns’ winning streak at nine.\n\n\r\n                    Booker talked about the importance of Phoenix getting back on track.\n\n\r\n                    “We talked about trusting the system. We have a lot of new players out there trying to figure each other out but always with the right intention,” said Booker, a first-time All-Star a year ago. “We’re getting better. Tonight was a step forward in that on both ends. We just have to continue to grow.”\n\n\r\n                    Buddy Hield scored 17 points for Sacramento. First-round draft pick Tyrese Haliburton added 15 points and six assists.\n\n\r\n                    Tied at 73 with 4:45 left in the third quarter, the Suns closed the period with a 17-5 run. Phoenix extended its lead to 107-88 on Booker’s fast-break layup during an 18-5 run in the fourth.\n\n\r\n                    Bridges was 9 of 15 from the field, going 4 of 8 from long range. Johnson was 7 of 9, hitting 3 of 4 3-pointers. He made all four of his free throws\n\n\r\n                    “When teams throw junk defenses at me and they’re blitzing a lot, we have guys that can make them pay,” Booker said. “That’s why we have the team that we do. Not surprising to me. We knew from the night before that we had a lot of open looks that we didn’t make and me myself needed to take care of the ball better. We’ll figure it out.”\n\n\r\n                    Kings coach Luke Walton said his team made too many mistakes.\n\n\r\n                    “It’s a good learning experience,” Walton said. “They’ve got guys over there, Chris Paul leading the group and an All-Star in Booker, they’ve got pride. They lost the first night, we knew it was going to be even tougher tonight. We just had some real mental breakdowns and when we did they were ready to pounce on it.”\n\n\r\n                    Paul had eight points and 12 assists. The Phoenix newcomer spent much of the fourth quarter cheering on his teammates while casually perched on a barrier between the bench and the court.\n\n\r\n                    Ayton helped the Suns to a 44-39 edge in rebounds.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: The last time Phoenix played the same team in the same city on consecutive days during the regular season was Nov. 2-3, 1990, when it opened the season with two games against the Utah Jazz in the Tokyo Dome.\n\n\r\n                    Kings: The Kings were attempting to go 3-0 for the first time since 2002-03. … Owner Vivek Ranadive sat near midcourt, socially distanced from five others in the organization who also watched from courtside.\n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Return to Phoenix to host New Orleans on Tuesday night.\n\n\r\n                    Kings: Host Denver on Tuesday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997205.247587
}