{
  "game_id": "0022000709",
  "espn_id": "401307498",
  "date": "Mar 29, 2021",
  "matchup": "BKN vs. MIN",
  "headline": "Harden has triple-double, Irving 27 as Nets edge Wolves",
  "body": "NEW YORK -- — James Harden had 38 points, 13 assists and 11 rebounds, tying the Nets' single-season record with his 12th triple-double in just 32 games, and Brooklyn held off the Minnesota Timberwolves 112-107 on Monday night.\n\n\r\n                    Kyrie Irving added 27 points in his return after missing the three-game road trip last week for family reasons. He started fast, but Harden did the biggest work late, with 13 points in the final period.\n\n\r\n                    “He's our leader and he’s meant a lot to us. Another triple-double and you can’t take it for granted, but you tend to, a little bit, because he’s able to pull these out of a hat almost every night,” Nets coach Steve Nash said.\n\n\r\n                    Hall of Famer Jason Kidd had 12 triple-doubles for the Nets in both the 2006-07 and 2007-08 seasons.\n\n\r\n                    The Nets won for the 18th time in 21 games, even as they continue a lengthy stretch without Kevin Durant because of a strained left hamstring. They don’t yet have LaMarcus Aldridge, who signed Sunday but needs to get back in shape after being inactive the last month.\n\n\r\n                    “On paper it looks good, but we’ve got to actually get out there and get going,” Harden said. “I’m excited for those guys to get back very, very soon so we can get this thing going.”\n\n\r\n                    Karl-Anthony Towns had 31 points and 12 rebounds for the Timberwolves in a much better effort than Saturday, when they yielded 129 points in a blowout loss to Houston.\n\n\r\n                    “That got out of hand early and we weren’t ready to play, but tonight we came ready to play and it showed,” rookie Anthony Edwards said. “We didn’t come out with a win, so I don’t think anybody should be satisfied with that, but I mean we competed.” \n\n\r\n                    Edwards had 23 points and 10 boards, but missed a free throw that could have tied it in the final minute and then a short jumper that could have given Minnesota the lead. \n\n\r\n                    Brooklyn led by 17 and was ahead most of the way, but Edwards had a basket while being fouled to cut it to 108-107 with 58 seconds to play. The free throw just fell out, and after his missed jumper, Harden made two free throws and then Irving hit two more to put it away.\n\n\r\n                    Irving was 6 for 7 for 15 points in the first quarter, when the Nets shot 70% en route to a 37-25 lead. Brooklyn managed only 24 points in the second as Minnesota cut a 17-point deficit to 61-52 at halftime.\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Minnesota had won the last five meetings. ... Former Nets guard D'Angelo Russell, recovering from left knee surgery on Feb. 17, didn't travel to the game. Coach Chris Finch said with the Wolves in and out for just one game, Russell could get more work by staying behind. \n\n\r\n                    Nets: Nash said Aldridge, who last played for the Spurs on March 1, would need a little time before he plays for the Nets. “He hasn’t played for a month, so got to get his conditioning, ramp up. So I’d say he probably won’t play for two, three, four games, we’ll see whatever that is, but not too long,” Nash said. “We think he needs some time to develop his conditioning and then we’ll get him out there.”\n\n\r\n                    HEAR HIM ROAR\n\n\r\n                    Nash ended his pregame press conference with a roar, poking fun at a question about the Nets being this season's NBA villains. After trading for Harden and then signing Blake Griffin and Aldridge, they are the first team in league history to acquire three players with five or more All-Star selections during a season. \n\n\r\n                    “It’s not like we did anything illegal. So I don’t know what we’re supposed to do, not try to add to our roster and just sit pat?” Nash said. “That’s the idea of this league, to try to put together the best team you can put together and that doesn’t guarantee you anything.”\n\n\r\n                    FAMILY FAN\n\n\r\n                    \r\n                      Karl Towns was at Barclays Center, his first time watching his son play in person since his wife died last year. Jacqueline Towns died in April from complications of the coronavirus. Both Karl Towns and Karl-Anthony Towns recovered from the illness.\n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: Host New York on Wednesday.\n\n\r\n                    Nets: Host Houston on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997484.634848
}