{
  "game_id": "0022400594",
  "espn_id": "401705160",
  "date": "Jan 19, 2025",
  "matchup": "MIL vs. PHI",
  "headline": "Antetokounmpo scores 34 points in Bucks' 123-109 victory over the short-handed 76ers",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 34 points and 15 rebounds to help the Milwaukee Bucks beat the short-handed Philadelphia 76ers 123-109 on Sunday night.\n\n\r\n              Damian Lillard added 25 points for Milwaukee, which completed a 4-0 homestand. Khris Middleton had 13 points and eight assists in 25 minutes off the bench. Brook Lopez added 12 points, and Taurean Prince had 11.\n\n\r\n              Tyrese Maxey led the 76ers with with 37 points and seven assists. Kelly Oubre Jr. scored 19 points, Ricky Council IV had 13 and Eric Gordon 10. Playing for the second consecutive night, Philadelphia has lost six straightand nine of 11.\n\n\r\n              The 76ers (15-26) were once again missing several key players — Joel Embiid, Paul George, Kyle Lowry and Guerschon Yabusele among them — due to injuries, but hung with the Bucks until fading late. Milwaukee moved to a season-high seven games above .500 at 24-17. \n\n\r\n              Rookie Adem Bona, making his first start for Philadelphia, had 10 points in 24 minutes. He was 4 of 4 from the field after going 5 or 5 on Saturday night against Indiana.\n\n\r\n              Takeaways\r\n              76ers: After trailing by nine after one quarter, Philadelphia opened the second on a 10-0 run to take the lead. It later extended the advantage to five points before cold shooting led to a nine-point deficit at the half.\n\n\r\n              Bucks: After three consecutive games with hot-shooting first quarters, Milwaukee cooled off a bit, but still scored 30 points in the opening period and held a nine-point lead despite struggling to make shots from deep. \n\n\r\n              Key moment\r\n              With 1:11 left in the first half, Antetokounmpo converted a reverse dunk on a pass from Lillard to give the Bucks 56-50 lead. Middleton followed with a step-back 3-pointer to push the lead to nine.\n\n\r\n              Key stat\r\n              The 76ers missed 7 of 14 free throws in the first half.\n\n\r\n              Up next\r\n              Philadelphia plays is at Denver on Tuesday night. Milwaukee is at New Orleans on Wednesday night to start a six-game trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997837.666101
}