{
  "game_id": "0021900342",
  "espn_id": "401160984",
  "date": "Dec 08, 2019",
  "matchup": "LAL vs. MIN",
  "headline": "Anthony Davis scores 50 to power Lakers to win over Wolves",
  "body": "LOS ANGELES -- Anthony Davis had a season-high 50 points and the Los Angeles Lakers improved to a league-best 21-3 with a 142-125 win over the Minnesota Timberwolves on Sunday night.\nDavis hit a floater with 4:39 remaining to reach 50 points for the fourth time in his career. He was 20 of 29 from the field and made all 10 of his free throws to go along with seven rebounds and six assists.\nLeBron James had 32 points and 13 assists despite committing four fouls in the first half. Alex Caruso added 16 points as the Lakers won their fourth straight and improved to 10-2 at home.\nEach of the Timberwolves' starters had at least 12 points. Karl-Anthony Towns and Andrew Wiggins each had 19 points as Minnesota lost its fourth straight game.\nDavis had 42 points through three quarters, one more than his previous single-game best this season, 41 points in his return to New Orleans on Nov. 27. He tacked on 15 points in the third, but balanced scoring allowed Minnesota to stay within 110-103 as the quarter closed.\nIt wasn't until the fourth quarter that the Lakers could relax. Davis went hard to the rim against Towns and drew a foul that put the Lakers in the bonus with 5:30 remaining.\nDavis had eight points during an 11-0 run that gave the Lakers a 73-65 lead at the half. He had 27 through two quarters, making 12 of 15 shots, including his first six attempts from the field. He provided a spark after James got his fourth foul with 2:27 left in the second quarter.\nThe Timberwolves found success from long range to get back into contention after trailing 39-31 after the first quarter. Minnesota hit its first five 3-pointers to start the quarter, with Wiggins providing the first lead at 52-51 midway after trailing by as many as 11.\nTIP-INS\nTimberwolves: Towns passed Anthony Peeler (465) for second-most 3-pointers in team history. . G Shabazz Napier tied a season-high with 13 points. He also had 13 in the Timberwolves' last game, a 137-129 overtime loss at Oklahoma City on Friday.\nLakers: C Dwight Howard celebrated his 34th birthday with eight points and six rebounds in 22 energetic minutes off the bench. . G Rajon Rondo did not play because of a strained hamstring. . G Avery Bradley (leg) is likely to return during the Lakers' upcoming trip after being cleared for full contact, coach Frank Vogel said. Bradley participated in 3-on-3 and 4-on-4 work in practice Sunday. He has not played since Nov. 13 because of a hairline fracture.\nUP NEXT\nTimberwolves: Wrap up a three-game trip at Phoenix on Monday.\nLakers: Open a five-game trip at Orlando on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996019.215631
}