{
  "game_id": "0021500887",
  "espn_id": "400828774",
  "date": "Feb 29, 2016",
  "matchup": "MIL vs. HOU",
  "headline": "Giannis gets triple-double, Bucks outlast Rockets 128-121",
  "body": "MILWAUKEE -- Jabari Parker reminded everyone on Monday night why he was the second overall pick in the NBA draft two years ago.\nStutter-step drives and midrange jumpers. A tricky layup off a baseline move. Parker even hit his first 3-pointer of the season while helping the Milwaukee Bucks to a 128-121 win over the Houston Rockets.\nParker scored a career-high 36 points for the Bucks, who nearly blew a late 13-point lead after the Rockets pieced together a 9-0 run. Khris Middleton had 30 points, and Giannis Antetokounmpo recorded his second career triple-double with 18 points, 17 rebounds and 11 assists.\nMilwaukee's young core stood up to the Rockets' rush. Dwight Howard had 30 points and 13 rebounds for Houston, and Trevor Ariza finished with 20 points and 11 assists.\n\"Even though we gave up a lot of points tonight against a team that scores a lot of points, we got stops when we had to and we built a lead,\" Bucks coach Jason Kidd said.\n\nParker and Antetokounmpo, the team's franchise forwards, led the way up front.\n\"The offense, for us, will come easy. We can score the ball. We all know that,\" Houston coach J.B. Bickerstaff said. \"The defensive end of the floor is where the problem is.\"\nParker, in particular, has been playing well of late, averaging 22.8 points since the All-Star break. He attended the weekend festivities to take part in the Rising Stars Challenge featuring the game's top young players.\nAny lingering doubts about whether Parker was completely over a left knee injury that sidelined him for much of the 2014-15 season have been completely erased.\n\"To be out there with some of the best young guys that we have in the league, it's (helped) him,\" said Middleton, who took part in the All-Star weekend 3-point contest. \"I think that him being selected made him realize he was doing something right, so he took it and ran with it.\"\nParker outshined Rockets star James Harden, who finished with 26 points, nine rebounds and six assists.\nFor all the damage caused by the Bucks' young players, the Rockets still had a shot at the end.\nBut after forcing a turnover, Ariza was whistled for a 5-second violation on inbounds pass with 20 seconds remaining.\nThe Rockets pointed to the season-long question of defense as the main problem. They had few answers in a tense postgame locker room.\n\"It's frustrating. Very frustrating,\" Ariza said. \"We have to continue to remind ourselves every day that we have to do those things.\"\nEND GAME\nThe wild ending culminated a run and gun-style game that otherwise featured alley-oop dunks, deep 3s and little defense.\nFans at the Bradley Center breathed a collective sigh of relief after also watching the Bucks blow a 15-point lead early in the second quarter.\nAt one point this season, the breakneck pace would have favored the Rockets with Harden and their freewheeling 3-point shooters.\nA 13-1 run capped by two 3s by Jerryd Bayless gave Milwaukee a 125-112 lead with 2:29 left. The Bucks held on despite not hitting a field goal the rest of the way.\nTIP-INS\nRockets: Rookie F Sam Dekker returned to the team after being recalled from Rio Grande Valley of the NBA Development League, in time for the teams' trip to his home state of Wisconsin. The former Wisconsin forward and Houston's first-round draft pick played sparingly in three games in November before being sidelined following back surgery. He did not play.\nBucks: PG Michael Carter-Wiliams was a late scratch because of patella tendinitis. But the team did get another ball-handler with Bayless back after he missed the last five games with a left knee injury. ... Parker had 20 points in the first half, a career-best for a half for the second-year forward.\nUP NEXT\nRockets: Host New Orleans on Wednesday.\nBucks: Host Indiana on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994026.227183
}