{
  "game_id": "0022300170",
  "espn_id": "401584798",
  "date": "Nov 08, 2023",
  "matchup": "POR @ SAC",
  "headline": "Sabonis and Monk rally Kings past Trail Blazers 121-118 in overtime",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had 27 points, 11 rebounds and nine assists, Malik Monk made two critical free throws with 13 seconds left in overtime and the Sacramento Kings rallied after trailing late in the fourth quarter to beat the Portland Trail Blazers 121-118 on Wednesday night.\n\n\r\n              Monk scored Sacramento’s final nine points in regulation but was scoreless in overtime before getting fouled by Toumani Camara. Monk calmy sank both free throws to put the Kings ahead by three.\n\n\r\n              At the other end, Jerami Grant missed two 3-pointers for Portland before the final buzzer, and a sold-out crowd at Golden 1 Center broke into chants of “Light the beam!”\n\n\r\n              The teams combined for 22 turnovers and 50 fouls.\n\n\r\n              “That was a grimy, gutty, ugly win,” Kings coach Mike Brown said. “Had a lot of really good performances from a lot of guys. Finding a way to win in a situation like this was a lot of fun.”\n\n\r\n              Monk finished with 23 points and 10 assists to help the Kings snap a three-game skid that included a pair of blowout losses to Houston. Kevin Huerter added 17 points.\n\n\r\n              Grant had a season-high 38 points and nine rebounds for the Blazers. Deandre Ayton added 18 points and 10 boards.\n\n\r\n              Monk was 4 of 16 from the floor, including 0 for 7 from 3-point range. But he finished 15 for 19 at the line, hitting 15 straight after missing his first four free throws. He drained two foul shots to tie it at 111 with 8.1 seconds remaining in the fourth quarter.\n\n\r\n              “(The Blazers) were talking to me when I missed the four, so I was just waiting for a moment when I could shut them up,” Monk said.\n\n\r\n              Brown was very pleased with what he saw from Monk.\n\n\r\n              “He had a huge game for us and he found a way to get something done,” Brown said. “He attacked and attacked and he got to the free throw line. We needed every single one of those free throws.”\n\n\r\n              The Kings led most of the first half but trailed 107-102 late in the fourth, then rallied down the stretch behind Monk. He hit two big free throws to tie it after initially being called for a charge against Shaedon Sharpe. The play was reviewed and overturned, negating the charge while Sharpe fouled out on the reversal.\n\n\r\n              Skylar Mays missed a long 3 just before the buzzer for the Blazers, sending the game to overtime.\n\n\r\n              “We had our chances,” Portland coach Chauncey Billups said. “This happens in a season. There’s some games that you win that you probably shouldn’t have won. There’s some games that you lose that you probably should have won, and this is one of those games. Just didn’t have enough.”\n\n\r\n              Keon Ellis, one of the Kings’ three two-way players, started and had four points and three steals in place of injured De’Aaron Fox. \n\n\r\n              Fox sat out a fourth consecutive game with a right ankle sprain, joining Trey Lyles (left calf strain) on Sacramento’s bench.\n\n\r\n              The Blazers were also short-handed and played without Scooter Henderson (right ankle), Anfernee Simons (thumb) and Robert Williams III (knee). Malcolm Brogdon exited in the first quarter with a left hamstring strain.\n\n\r\n              The game marked the first time that twins Keegan and Kris Murray played against each other in the NBA after two years in college as teammates at Iowa. \n\n\r\n              The fourth overall draft pick in 2022, Keegan Murray had nine points and seven rebounds while Kris Murray, Portland’s first-round selection this season, scored two points in nine minutes. Kris also blocked a shot by his brother shortly after checking in during the second quarter.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Continue their three-game trip against the Lakers in Los Angeles on Sunday.\n\n\r\n              Kings: Face the Oklahoma City Thunder at home in an In-Season Tournament game Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https:.//apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996599.631804
}