{
  "game_id": "0021500201",
  "espn_id": "400828088",
  "date": "Nov 22, 2015",
  "matchup": "LAL vs. POR",
  "headline": "Lillard, McCollum lead Blazers past Lakers, 107-93",
  "body": "LOS ANGELES -- Damian Lillard saw potential in the Los Angeles Lakers' talented young guards. The Portland star guard also demonstrated just how far D'Angelo Russell and Jordan Clarkson have got to go to catch up with the Trail Blazers' brilliant young backcourt.\nLillard had 30 points and a career-high 13 assists, and C.J. McCollum added 19 points in the Blazers' sixth consecutive victory over Los Angeles, 107-93 on Sunday night.\nMason Plumlee added 17 points and 11 rebounds for the Blazers, who have won two straight after a seven-game skid. Portland has won a franchise-record five straight road games against the Lakers after maintaining a steady lead throughout the second half.\n\"We got ourselves together,\" Lillard said. \"The position we've been in, we know it's a game of runs. We tightened down defensively and got it done.\"\n\nThe Lakers trimmed Portland's lead to three points with four minutes to play, but Portland scored eight straight points capped by four from Lillard, who made up for an inconsistent outside shot with exceptional playmaking throughout.\nKobe Bryant scored 18 points on 6-for-22 shooting, missing all five of his 3-point attempts in the Lakers' third straight loss. Los Angeles' 2-11 start is one game behind their pace from last season, the worst year in franchise history.\n\"It's just that we're making little mistakes at the wrong time,\" Bryant said. \"Defensive balance and the wrong rotation here and there, that's really been caving the roof in on us in the last five minutes of the ballgame. Our rotations weren't up to snuff, and they just killed us all night.\"\nJordan Clarkson led the Lakers with 19 points.\nKOBE'S MINUTES\nBryant played a season-high 37 minutes in Friday's loss to Toronto, but returned after just one day off to play 31 minutes against Portland. Coach Byron Scott still insists he will limit the 20-year veteran's mileage by monitoring his minutes and his playing segments. Bryant returned with only 3:39 remaining against the Blazers, leaving for good when Portland wrapped it up.\nSTRUGGLING STROKE\nBryant's 0-for-5 effort on 3-pointers made him 1 for 14 beyond the arc in the last three games. He is a miserable 14 for 70 on 3-pointers this season. \"I'm OK,\" Bryant said. \"I mean, I'm just trying to be calm about the situation and stick to the present. Stick to teaching. Tomorrow in practice, we'll go over things and get ready for the next game.\"\nED RETURNS\nPortland forward Ed Davis returned to Staples Center after spending last season with the Lakers and playing well enough to earn a $20 million free-agent contract. Davis had nine points on 4-of-5 shooting along with three assists and three rebounds in 18 minutes off the bench. \"I had a great time here,\" Davis said. \"The fans were great to me. Everybody took care of me.\"\nED AND JULIUS\nDavis was glad to see a healthy Julius Randle, who was Davis' teammate last year until he broke his leg in the season opener. Randle had 13 points and 13 rebounds. \"The one thing he's got to do is work on his right hand,\" Davis said of Randle. \"As soon as he gets that down, he's going to be tough to stop.\"\nINJURY AVERTED?\nRussell went to the locker room during the third quarter with a mildly sprained left ankle, but the Lakers rookie returned to finish with 13 points, nine rebounds and six assists.\nTIP-INS\nTrail Blazers: They host the Lakers on Saturday after three days off. ... 7-footer Meyers Leonard missed his sixth straight game with a dislocated left shoulder. He has participated in parts of practice for the past week, but hasn't played since Nov. 11.\nLakers: Randle played despite a sore big toe on his left foot. ... They play 10 of their next 11 games on the road.\nUP NEXT\nTrail Blazers: Host Bulls on Tuesday.\nLakers: At Warriors on Tuesday. The Lakers are the only thing standing between the 15-0 defending champs and the best start to a season in NBA history.",
  "source": "espn_api",
  "crawled_at": 1764994312.628006
}