{
  "game_id": "0021801142",
  "espn_id": "401071815",
  "date": "Mar 30, 2019",
  "matchup": "TOR @ CHI",
  "headline": "Ibaka, VanVleet lead Raptors to 124-101 rout of Bulls",
  "body": "CHICAGO --  Playing without their top two players proved to be no problem for the Toronto Raptors.\n\nSerge Ibaka had 23 points and 12 rebounds, Fred VanVleet also scored 23 and the Raptors routed the Chicago Bulls 124-101 on Saturday night despite not having Kawhi Leonard and Pascal Siakam in the lineup.\n\nMarc Gasol added 17 points, eight rebounds and six assists as Toronto won its third straight.\n\n\"When a great player and really important player sit out, somebody else has to pick up those shots, the defensive intensity,\" Gasol said. \"We're all NBA players and we all work together, obviously.\"\n\nLeonard was excused for personal reasons and didn't make the trip to Chicago. He leads the Raptors in scoring at 27 points and has played in 55 of the team's 77 games this season. Siakam, who averages 17 points, was healthy and in uniform on the bench, but was held out to rest. The third-year forward had 31 points Thursday in a win over the New York Knicks.\n\n\"It was a good opportunity to get Serge back in the starting lineup and he responded well,\" Toronto coach Nick Nurse said.\n\nWalt Lemon Jr., in his first game with the team, led the short-handed Bulls with 19 points.\n\n\"I thought he looked like an NBA player,\" Chicago coach Jim Boylen said of Lemon. \"He's not scared. I was very excited about his play, his competitiveness.\"\n\nChicago, which has dropped four straight, was playing without all five of its usual starters. In addition to rookie Wendell Carter Jr., who is out for the season following left thumb surgery in January, Kris Dunn (mid-back strain), Lauri Markkanen (medical assessment), Zach LaVine (right thigh contusion) and Otto Porter Jr. (right shoulder strain) were sidelined. Rookie Chandler Hutchison (right toe) also was out.\n\nVanVleet had 15 first-half points as the Raptors took a 67-56 halftime lead. Toronto scored 41 points in the second quarter on 18-for-24 shooting.\n\nDanny Green and Gasol each had eight points in the third quarter as the Raptors stretched the lead to 93-75 entering the fourth quarter.\n\nThe Bulls never got closer than 15 points in the fourth.\n\nTIP-INS\n\nRaptors: G Patrick McCaw likely will miss approximately three weeks with a sprained right thumb. He was injured during the first half of Thursday's game at New York. \"Possible cartilage issues, so they're going to take him to a specialist when we get back tomorrow,\" Nurse said.\n\nBulls: Lemon was signed Friday to fill some of the void created by the rash of injuries. The Chicago native averaged 20.1 points and 8.9 assists in 33 games with the Windy City Bulls, the team's G League affiliate. \"I can't even describe it, the feelings that I felt,\" the 26-year-old said. \"First, just being in the building, going out there playing on the floor and playing OK in my debut as a Bull. Words can't describe it.\"\n\nHOIBERG REACTION\n\nBoth Nurse and Boylen are friendly with Fred Hoiberg and had some thoughts on the former Bulls coach taking the Nebraska job.\n\nNurse was surprised, saying: \"I didn't know that he'd go right back into it right away. I thought maybe there'd be one of the real premier jobs or something that he would take.\"\n\nBoylen, though, believes Nebraska is a good match for Hoiberg. \"He's a good recruiter, he's proven that,\" Boylen said. \"They need a great recruiter there. From what I hear, they have all the facilities, all the trimmings for that program to take off. He can do it. He will do it.\"\n\nWELCOME TO THE NBA\n\nWith 16 players on the roster before his arrival, the Bulls had to be creative in finding space for Lemon in the locker room. No stalls were free, so a coat rack was set up in an empty space with a banquet-room chair in front of it.\n\nUP NEXT\n\nRaptors: Host Orlando on Monday night.\n\nBulls: Visit New York on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994089.89728
}