{
  "game_id": "0022300601",
  "espn_id": "401585229",
  "date": "Jan 21, 2024",
  "matchup": "MIA @ ORL",
  "headline": "Paolo Banchero scores 20 as Magic turn back cold-shooting Heat 105-87",
  "body": "ORLANDO, Fla. -- — With its season-opening starting lineup back together for the first time in 2 1/2 months, the Orlando Magic took its defense to another level Sunday night in a 105-87 win over the Miami Heat.\n\n\r\n              Paolo Banchero led five Orlando starters in double figures with 20 points and the Magic held the Heat to a season-low point total in Miami's third straight loss. The Heat shot 37.5% and had 18 turnovers.\n\n\r\n              “It felt good to have everyone back tonight, and it’s good to see how effective our defense is when we have that unit in,” said Markelle Fultz, who had 12 points, four assists and a plus-21 in his first start since Nov. 9. \n\n\r\n              “We challenged them the last time we played them and we held them to 99,” said Magic coach Jamahl Mosley. “So we know what we’re capable of doing, and guys understand we’re going to hang our hat on the defensive end of the floor. They took the challenge on one individual at a time.”\n\n\r\n              Wendell Carter Jr. added 17 points and nine rebounds and Franz Wagner, back in the starting lineup after missing eight games with a sprained right ankle, had 19 points and five assists.\n\n\r\n              Bam Adebayo led the Heat with 22 points and 11 rebounds. \n\n\r\n              Jimmy Butler, who did not play in either of Miami's victories over Orlando earlier this season, had 15 points. Tyler Herro added 12 points for the Heat, who shot 37.5% and had 14 turnovers.\n\n\r\n              The Heat played a fourth straight game without rookie forward Jaime Jaquez Jr., who is out with a groin strain.\n\n\r\n              “I feel like we just get stagnant. The biggest thing for us right now is we are in a rough patch and we have to dig ourselves out of it,” said Adebayo.\n\n\r\n              “Sometimes you're going to have rough patches, but as long as you're generating the right types of looks, you can't be obsessed with the results, even if it's frustrating,” said Miami coach Erik Spoelstra. “You also have to give Orlando credit. They were very physical tonight and they kind of blew up a lot of our movement.”\n\n\r\n              Wagner and Jalen Suggs scored five points each during a 14-2 third-quarter spurt that opened up a 15-point lead for Orlando.\n\n\r\n              Miami (24-19) never got the margin back into single figures, and trailed by 24 when Wagner hit a couple of free throws with 3:54 left in the game. Fultz scored twice to help the Magic open the fourth quarter with an 8-0 run that pushed the lead to 89-69.\n\n\r\n              Partly due to prolonged injuries to Carter, Fultz and Wagner, the Magic (23-20) had won only eight of 23 games since the start of December.\n\n\r\n              “(Injuries) are going to happen, and it’s a next-man-up mentality,” Fultz said. “But to have everyone back at full strength, we’re a really good team and we’re hard to beat when we have everyone.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Memphis on Wednesday.\n\n\r\n              Magic: Host Cleveland on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995360.400943
}