{
  "game_id": "0022400179",
  "espn_id": "401704745",
  "date": "Nov 06, 2024",
  "matchup": "LAC vs. PHI",
  "headline": "Clippers beat the one-win 76ers 110-98 in Paul George's return to Los Angeles",
  "body": "INGLEWOOD, Calif. -- — Norman Powell scored 26 points — his seventh straight game with 20 or more — and the Los Angeles Clippers beat the Philadelphia 76ers 110-98 on Wednesday night in Paul George's return to face his old team.\n\n\r\n              George had 18 points on 7 of 9 shooting and seven rebounds in 24 minutes for the Sixers in his second game of the season. He's on a minutes restriction since a left knee injury delayed his season debut.\n\n\r\n              James Harden added 18 points, four rebounds and six assists for the Clippers. \n\n\r\n              Kelly Oubre Jr. also had 18 points for the Sixers. Caleb Martin had 14 points and Andre Drummond had 10 rebounds.\n\n\r\n              The Sixers were without Joel Embiid who is serving a three-game suspension for shoving a Philly sports columnist. He's due to return on Tuesday, although he has yet to play this season because of a knee injury.\n\n\r\n              “I think that it’s really too bad, right? I don’t really want to get into the way people behave but I’m not sure either person was right,” Sixers coach Nick Nurse said before the game when asked about the incident. “Everybody’s got a job to do and both sides need to do it better, right?”\n\n\r\n              The Clippers dominated the fourth quarter, extending their lead to 94-72 on Amir Coffey's 3-pointer off Powell's pass. \n\n\r\n              Takeaways\r\n              Sixers: They dropped to 1-6, with their lone win coming in overtime against Indiana. Since then, they've lost four in a row.\n\n\r\n              Clippers: They improved to .500 at 4-4 while waiting for Kawhi Leonard to make his season debut. He's nursing inflammation in his surgically repaired right knee, the same issue that forced him out at times last season.\n\n\r\n              Key moment\r\n              Sixers starting guard Tyrese Maxey left the game because of right hamstring soreness. He finished with 12 points, one of four Sixers in double figures. He's led them in scoring five times, including a season-high 45 against the Pacers.\n\n\r\n              Key stat\r\n              Powell hit five of the Clippers' 10 3-pointers, the most of anyone in the game. \n\n\r\n              Up next\r\n              The Sixers visit the Los Angeles Lakers on Friday. The Clippers visit Sacramento on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998058.185444
}