{
  "game_id": "0021301148",
  "espn_id": "400490021",
  "date": "Apr 05, 2014",
  "matchup": "MIL vs. TOR",
  "headline": "DeRozan scores 23, Raptors top Bucks 102-98",
  "body": "MILWAUKEE --  The playoff-bound Toronto Raptors found themselves trailing the hapless Milwaukee Bucks by nine points at halftime.\n\nDeMar DeRozan made sure the Raptors recovered to continue their push for postseason position.\n\nThe Toronto guard scored 15 of his 23 points in the fourth quarter and the Raptors beat the Milwaukee Bucks 102-98 Saturday night to keep pace with the Chicago Bulls for the No. 3 seed in the Eastern Conference.\n\n\"We can't look at a team's record, come in here and think this is going to be a cakewalk,\" DeRozan said. \"That team came out here and played extremely hard. They kind of blindsided us and we had to fight the whole game.\"\n\nAfter the Raptors gave up 38 points in the paint to trail 56-47 at halftime, coach Dwane Casey lit into his team at halftime.\n\n\"We let them shoot 58 percent in the first half and I can't accept that,\" Casey said. \"The first half, we were playing in mud. Standing up straight and it wasn't just the starters. Everybody who was in there.\"\n\nToronto is tied the Bulls, who beat Washington on Saturday night, at 45-32 with five games to play.\n\nMilwaukee fell to an NBA-worst 14-63, guaranteeing the team's worst record in its 45-year history.\n\n\"We want to win, but I think if we can play this competitive as a team every night, I think there are some better days to come,\" said Milwaukee's John Henson, who had 23 points and nine rebounds in 39 minutes.\n\nGreivis Vasquez tied a season-high with 26 points for Toronto, which has won three consecutive games and six of seven. Vasquez, who averages 9.1 points, made up the scoring lost when starting point guard Kyle Lowry missed the game with a bruised left kneecap.\n\n\"Coach jumped on us (at halftime) and we reacted pretty well,\" Vasquez said. \"In the second half we came to play.\"\n\nDeRozan made six free throws in the final 24 seconds to seal the victory.\n\n\"We always find ways to fight through,\" DeRozan said. \"We tried to turn up the aggressiveness, especially in the fourth quarter.\"\n\nKhris Middleton scored 20 points for Milwaukee, which has lost 13 of 14 games. Middleton made 6 of 9 shots after a shooting slump in which he made 14 of 41 over the past four games.\n\nDeRozan made a pair of free throws to give the Raptors a 98-94 lead with 24 seconds left. Giannis Antetokounmpo then made two free throws to pull Milwaukee within 98-96 with 20 seconds left.\n\nDeRozan made two free throws to give Toronto a 100-96 lead with 18.6 seconds to go. Jeff Adrien dunked with 11 seconds left, but DeRozan made two more free throws to cap the scoring.\n\nBoth teams played short-handed for the second consecutive night. Lowry and starting forward Amir Johnson were out with injuries for Toronto.\n\nMilwaukee had only eight players available due to injuries.\n\nThe Bucks was 1 of 9 from 3-point range while Toronto was 12 of 27.\n\n\"That is where the difference was,\" Milwaukee coach Larry Drew said. \"If you look at all the other categories, I believe we outscored them in the paint, more assists. A lot of good things we did do, but the 3-point line we did not do a good job defending.\"\n\nThere were nine lead changes in the fourth quarter, but Vasquez hit a 3-pointer to give Toronto the lead for good at 86-84 with 5:24 left. DeRozan then hit a free throw and made a 22-foot jumper to give the Raptors an 89-84 lead.\n\nThe Bucks pulled within 89-88, but DeRozan scored on a driving runner and Jonas Valanciunas converted a 3-point play to give the Raptors a 94-88 lead with 1:43 to go.\n\nGame notes F Chris Wright was signed to his second 10-day contract by the Bucks on Saturday. He scored four points in 16 minutes. ... The PA announcer drew big cheers from the Bradley Center crowd with periodic updates of the Wisconsin-Kentucky game in the NCAA tournament. ... The 1993-94 Bucks went 20-62, the team's previous worst record. ... Toronto's 45th win ties for the franchise's third most wins in a season. The team needs two wins in its final five games to match the team-record 47 wins, set in 2000-01 and 2006-07.",
  "source": "espn_api",
  "crawled_at": 1764992718.004333
}