{
  "game_id": "0022000871",
  "espn_id": "401307669",
  "date": "Apr 19, 2021",
  "matchup": "MIA vs. HOU",
  "headline": "Heat run away in 2nd half, roll past Rockets 113-91",
  "body": "MIAMI -- — The Miami Heat were missing their three leading scorers, and still had more than enough to get past the Houston Rockets.\n\n\r\n                    Kendrick Nunn scored a season-high 30 points, Duncan Robinson and Goran Dragic each added 19 and Miami beat Houston 113-91 on Monday night. \n\n\r\n                    The Heat were playing without Jimmy Butler, Bam Adebayo and Tyler Herro — a trio that averages 55 points per game — and outscored Houston 59-36 after halftime.\n\n\r\n                    “That’s our culture, guys being ready to go and guys wanting to leave their mark on the game,” said Miami’s Andre Iguodala, who scored 16 points. “Tonight was one of those nights where we had a lot of guys leave their mark.”\n\n\r\n                    Iguodala played 28 minutes and the Heat outscored the Rockets by 38 points when he was on the floor. It was the fourth-highest plus-minus of Iguodala's career.\n\n\r\n                    “Andre was terrific tonight,\" Heat coach Erik Spoelstra said.\n\n\r\n                    Miami (30-28) closed within 1 ½ games of No. 4 Atlanta and a game of No. 5 Boston and No. 6 New York in the Eastern Conference standings.\n\n\r\n                    Kevin Porter Jr. and Christian Wood each scored 18 for the Rockets, who have dropped 33 of their last 37 games. John Wall scored 14 for Houston.\n\n\r\n                    “Our communication just wasn't there in the second half,\" Wood said.\n\n\r\n                    \r\n                      The Rockets were without Sterling Brown, after the team said he was assaulted by unknown assailants and suffered facial lacerations one night earlier. The NBA said it was looking into the incident, and the Rockets said Brown — who agreed to a $750,000 settlement last year after being shocked with a Taser and arrested in a 2018 encounter with police in Milwaukee — would recover.\n\n\r\n                    “Maybe the emotion of the day caught up to us toward the end,\" Rockets coach Stephen Silas said. “I think we looked tired toward the end of the game.\"\n\n\r\n                    Houston led 55-54 at the half, and the third quarter turned it all around for Miami. The Heat outscored the Rockets 35-19, with Nunn and Robinson combining for 19 points and five 3-pointers in that quarter alone.\n\n\r\n                    Wood’s 3-pointer with 6:26 left got Houston within 15. Miami then went on a 14-0 run to turn the game into a runaway.\n\n\r\n                    “Guys were out,\" said Nunn, who also had eight assists and seven rebounds. “We had to step up and get the job done.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: Houston is now 6-9 in games immediately following wins this season, and 9-34 after losses. ... The Rockets play seven of their next eight games at home, then finish the season with five out of six on the road.\n\n\r\n                    Heat: Each of Miami’s first 10 field goals was assisted. ... Miami used a different lineup for the third consecutive game. The Heat are up to 24 this season, nine more than a year ago. ... Butler missed the game with a sprained right ankle, Herro with a sore right foot and Adebayo -- whose buzzer-beating jumper gave Miami a 109-107 win over Brooklyn on Sunday -- with a sore right knee. ... Dewayne Dedmon scored 12.\n\n\r\n                    ROBINSON’S 3s\n\n\r\n                    Robinson made five 3-pointers, giving him 202 this season. He’s the first player in Heat history to make 200 3s in a season multiple times, and the 21st player in NBA history to do so. He’s also now up to 482 in his Heat career, moving past Dwyane Wade (481) for sixth on the franchise list.\n\n\r\n                    K.O. TURNS 3-0\n\n\r\n                    Rockets forward Kelly Olynyk, in his first game back in Miami since the trade that sent Victor Oladipo to the Heat, finished with 10 points on his 30th birthday.\n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Host Utah on Wednesday.\n\n\r\n                    Heat: Visit San Antonio on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997857.6652741
}