{
  "game_id": "0021500098",
  "espn_id": "400827985",
  "date": "Nov 08, 2015",
  "matchup": "DET @ POR",
  "headline": "Drummond leads Pistons to comeback 120-103 win over Blazers",
  "body": "PORTLAND, Ore. --  Talk about a comeback.\n\nDown 13 points heading into the fourth quarter against the Trail Blazers, the Detroit Pistons went on a tear, outscoring Portland 41-11 for a 120-103 victory on Sunday night.\n\nReggie Jackson led the way with a career-high 40 points -- including 26 in the fourth quarter alone -- while Andre Drummond had 29 points and 27 rebounds.\n\n\"The funny thing is, when I was scoring I felt like we were scoring. I saw the ball going in the basket but I didn't necessarily know it was myself putting the ball in there a lot,\" Jackson said. \"The team was just moving the ball, great screens which allowed me to get open, and I tried to be aggressive.\"\n\nIt was the Pistons' first win in Portland since 2007 and snapped a six-game overall losing streak to the Blazers.\n\n\"I've coached a long time and have never been part of a fourth quarter like that,\" Pistons coach Stan Van Gundy said.\n\nDetroit's 5-1 start is the best for the team since 2007-08.\n\nDamian Lillard had 26 points and 11 rebounds and the Blazers' modest three-game winning streak was snapped. CJ McCollum added 18 points.\n\nThe Blazers led by as many as 18 points in the third quarter, but Detroit's Kentavious Caldwell-Pope hit a 3-pointer that closed the gap to 98-92 with 7:18 left.\n\nDrummond's layup pulled the Pistons within 98-96 and Jackson's floater with 5:21 left tied it at 98. Jackson hit another to put the Piston's in front with 4:46 left, and they never trailed again.\n\n\"I told him (Jackson) it was time for him to take over,\" Drummond said. \"I told him he needed to step it up and take over in this fourth quarter.\"\n\nDrummond, who came into the game leading the NBA with nearly 19 rebounds per game, has double-doubles in all six of Detroit's games this season. It was his seventh career game with at least 20 points and 20 rebounds.\n\nIt was the second game of a six-game road trip for the Pistons. They won 100-92 in Phoenix on Friday night.\n\nThe Blazers were coming off a 115-96 victory at home over Memphis on Thursday night. The dynamic backcourt of Lillard and McCollum combined for 47 points.\n\nGoing into the game, the duo was averaging a combined 49.5 points per game, second only to Oklahoma City's Kevin Durant and Russell Westbrook (57 points per game).\n\nBut even with a combined 44, they couldn't overcome Detroit's fourth-quarter surge.\n\n\"We've got to learn from it,\" Blazers coach Terry Stotts said. \"We can't back down when teams turn up the pressure. We've got to be aggressive, we've got to do things a little bit better.\"\n\nThe Blazers pulled ahead 38-26 early in the second quarter after Noah Vonleh's layup and McCollum's jumper. Portland led by as many as 14 points en route to a 57-47 advantage at the half.\n\nMcCollum's layup gave Portland a 75-57 layup in the third quarter. But Portland closed within 94-85 on Marcus Morris' running dunk.\n\nBlazers forward Ed Davis was ejected with 8:01 left after he earned a pair of back-to-back technicals for arguing with officials.\n\nTIP INS\n\nPistons: Detroit had not allowed an opponent more than 95 points this season. ... Backup guard Steve Blake spent three stints with the Blazers.\n\nTrail Blazers: The Blazers placed rookie forward Cliff Alexander on the active list and moved guard Luis Montero to the inactive list before the game. Alexander was undrafted out of Kansas. ... Portland's 5-2 start is its best since the 2011-12 season.\n\nDRUMMOND'S BOARDS\n\nIt was the third game of the season that Drummond has had at least 20 rebounds. Last week against Indiana he had 25 points and a career-high 29 rebounds in Detroit's 94-82 loss (its lone loss of the season).\n\nHis 27 rebounds were the most against the Blazers in a regulation game since Bob McAdoo had 28 for Buffalo in 1974.\n\nDrummond also leads all active players with three career 25/25 games; Al Jefferson and Dwight Howard each have two.\n\nPRAISE FOR DRUMMOND\n\nVan Gundy: \"Andre's numbers are phenomenal. If he didn't get a rebound the rest of this trip he'd be in the top three or four in rebounding. What he's doing on the boards is just phenomenal. He was just swallowing the ball up down the stretch.\"\n\nLILLARD'S MILESTONE\n\nLillard is the first Blazer to score at least 20 points in each of the season's first seven games since Clyde Drexler did it in 1988-89.\n\nUP NEXT\n\nThe Trail Blazers visit the Denver Nuggets on Monday night.\n\nThe Pistons visit the defending NBA champion Golden State Warriors on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764994958.6147158
}