{
  "game_id": "0022000199",
  "espn_id": "401307594",
  "date": "Apr 10, 2021",
  "matchup": "OKC vs. PHI",
  "headline": "Joel Embiid scores 27 points, 76ers beat Thunder 117-93",
  "body": "OKLAHOMA CITY -- — Joel Embiid had 27 points and nine rebounds and the Philadelphia 76ers beat the Oklahoma City Thunder 117-93 on Saturday night to pull even with Brooklyn for the Eastern Conference lead. \n\n\r\n                    On Friday night in a loss at New Orleans, Embiid went just 5 for 16 from the floor and scored 14 points. He was 10 for 17 in three quarters of work against the Thunder and had four blocks.\n\n\r\n                    Even with the off night against New Orleans and the 10 games he missed with a bone bruise in his left knee, Embiid still feels he should be at the top of the league MVP race. \n\n\r\n                    “When it comes to the MVP stuff, I feel like I’m still right there,\" he said. “When I'm on the floor, I feel like I’ve been the best all season, just doing my thing, just dominating with the help of my teammates and the coaches putting me in the right positions to succeed.”\n\n\r\n                    Furkan Korkmaz added a season-high 20 points and a career-high five steals for the 76ers. They didn't like the way they played against the Pelicans, but felt better after Saturday's effort. \n\n\r\n                    “We responded good,\" forward Mike Scott said. \"The great thing about the NBA —- there’s a lot of games — back-to-back, quick turnarounds. You learn from your mistakes and you keep moving. No matter the team and no matter the record, it’s always great to come in and get a win, especially on the road.”\n\n\r\n                    Darius Bazley had 17 points and nine rebounds in his first action since missing 15 games with a shoulder bruise. \n\n\r\n                    “We're happy he's back,” Thunder coach Mark Daigneault said. “We're happy he looks like he's in pretty good shape, body looks good. Just keep building from here. This is an important 20 games for him.”\n\n\r\n                    Thunder guard Lu Dort scored 15 points in his first action since missing seven games while in concussion protocol. Tony Bradley added 16 points and 14 rebounds for Oklahoma City, which has lost six straight.\n\n\r\n                    The 76ers led 66-53 at halftime. Embiid made just one of his first four shots, but he went 6-for-6 the rest of the first half and finished it with 21 points. The 76ers led despite making just 5 of 21 3-pointers before the break. The 76ers led 90-76 heading into the fourth quarter.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Guard George Hill, who the Thunder traded to the 76ers as part of a three-team deal last month, remained out with a right thumb injury he suffered early in the season while playing for Oklahoma City. ... Had just 10 turnovers and forced 23. ... Center Dwight Howard had 13 rebounds in just under 15 minutes. ... Guard/forward Danny Green sat out with a sore left hip.\n\n\r\n                    Thunder: Guard Theo Maledon hit a corner 3-pointer as time expired in the first half. ... Thunder forward Aleksej Pokusevski left the game in the first quarter with right arm soreness and didn't return. ... Shot 50% from the field.\n\n\r\n                    BLOWOUT CITY\n\n\r\n                    The Thunder have lost six straight games by an average of 28.5 points per game, with all six losses coming by double digits and five of the six by at least 24 points. The closest game in that stretch was a 113-102 loss to Charlotte on April 7. The worst of the losses was \n\n\r\n                    EMBIID’S JUMPER\n\n\r\n                    Embiid has made just 1-fof-14 3-pointers in his last four games and missed both of his tries from deep against the Thunder. His mid-range shot has been off, too.\n\n\r\n                    “You’ve got to keep shooting them,” he said. “Miss or make, you’ve got to keep taking them. Obviously, they haven’t been going in. A lot of it has to do with the brace and getting back to myself. It just feels like every shot that I take, I just have a hitch in it. Like it’s not a full motion. It’s not as smooth as it was, even on the makes.”\n\n\r\n                    UP NEXT\n\n\r\n                    76ers: At Dallas on Monday night.\n\n\r\n                    Thunder: At Utah on Tuesday night.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997075.069936
}