{
  "game_id": "0022200096",
  "espn_id": "401468251",
  "date": "Oct 31, 2022",
  "matchup": "SAC @ CHA",
  "headline": "Huerter, Mitchell propel Kings past Hornets 115-108",
  "body": "CHARLOTTE, N.C. -- — Kevin Huerter scored 26 points, Davion Mitchell added 23 points including two clutch jumpers late in the game as the Sacramento Kings rallied from a 15-point halftime deficit to beat the Charlotte Hornets 115-108 for their second straight win.\n\n\r\n              Huerter and Mitchell combined to go 10 of 16 from 3-point range and Harrison Barnes added 14 points as the Kings outscored Charlotte 37-18 in the third quarter.\n\n\r\n              P.J. Washington, who scored 31 points in an upset win over the Golden State Warriors on Saturday night, again led the shorthanded Hornets in scoring with 28 points. Kelly Oubre Jr. added 16 for Charlotte.\n\n\r\n              Charlotte’s Jalen McDaniels knocked down a 3-pointer from the corner with 1:09 left to tie the game, but Mitchell immediately answered with a pullup 3-pointer and a 19-foot jumper on consecutive possessions to put the Kings up by five with 24.2 seconds left.\n\n\r\n              “I kind of knew I had a mismatch and I knew I could have got to the rim. But they played back and I just stepped up and hit the shot,” Mitchell said.\n\n\r\n              “He brings a leadership presence from the bench,” Kings coach Mike Brown said of Mitchell, who was 9 of 11 from the floor. “He brings an understanding of what his role is and embraces his role. He's a guy that I know anytime we call his number he is going to be ready to play.”\n\n\r\n              The Hornets turned the ball over 21 times resulting in 25 points for the Kings. Sacramento also lived at the foul line, making 24 of 28 free throws taking advantage of 31 fouls called on the Hornets.\n\n\r\n              “If we turn the ball over 21 times and foul like that, we're not gong to win,\" Hornets coach Steve Clifford said. \"Every drive, we fouled. We kind of gifted them like 10 or 12 points.”\n\n\r\n              Like the Hornets, the Kings were coming off a big win Saturday night after beating the Miami Heat at home.\n\n\r\n              It didn't look good early for Sacramento as the Hornets shot 60.5% in the first half to build a 67-52 lead at the break with all five starters scoring in double figures.\n\n\r\n              But the Kings stormed back in third quarter, outscoring the Hornets 37-18 behind 12 points from Huerter, who broke free for some open jumpers. Matthew Dellavedova gave the Kings their first lead of the game with 3:43 left in the third quarter on a 3-pointer from the right wing.\n\n\r\n              The Hornets would battle back to take the lead in the fourth quarter before the Kings rallied again with Huerter and Keegan Murray banging home back-to-back 3s with 4 1/2 minutes to play.\n\n\r\n              “We are fighting,\" Mitchell said of the team's win streak. “We are a team that don't quit. We try to play 48 minutes.”\n\n\r\n              FOX'S INJURY\n\n\r\n              De'Aaron Fox only played nine minutes after knocking knees with a Hornets player in the first half. Kings coach Mike Brown said he'll know about Fox's injury on Tuesday but doesn't believe it is serious.\n\n\r\n              WASHINGTON'S UPRISING\n\n\r\n              Washington continued to take advantage of his elevation to the starting role with restricted free agent Miles Bridges still out of the league while dealing with domestic violence charges. Bridges led the Hornets in scoring last season and the team is waiting to see what happens legally before making any decision on Bridges' future.\n\n\r\n              “He played terrific and got us back in the game,” Clifford said.\n\n\r\n              Washington is averaging 15.3 points and 4.3 rebounds per game.\n\n\r\n              TIP INS\n\n\r\n              Kings: Domantas Sabonis had 16 rebounds before fouling out with 2:24 left in the game.\n\n\r\n              Hornets: Continued to play without LaMelo Ball (ankle), Terry Rozier (ankle) and Cody Martin (quad). ... Outscored Sacramento 54-34 in the paint.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Miami on Wednesday night.\n\n\r\n              Hornets: At Chicago on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995313.62429
}