{
  "game_id": "0021900260",
  "espn_id": "401160902",
  "date": "Nov 27, 2019",
  "matchup": "MEM vs. LAC",
  "headline": "Harrell tips in Williams’ miss, Clippers edge Grizzlies",
  "body": "MEMPHIS, Tenn. --  When Lou Williams missed a floater in the closing seconds, Montrezl Harrell cleaned it up with a dunk to extend the Los Angeles Clippers’ winning streak.\n\nHarrell’s rebound basket with 2.3 seconds left gave the Clippers their seventh straight victory, 121-119 over the Memphis Grizzlies on Wednesday night.\n\n“I expected to make the shot, but I’m so happy ... that he was there for me,” said Williams, who had 24 points and 13 assists.\n\nMemphis had one more chance to tie or take the lead, but Jaren Jackson Jr.’s 3-point attempt from the right corner was blocked by Maurice Harkless.\n\nHarrell and Williams contributed to another strong bench performance from the Clippers, who lead the league with 51.7 points a game from their reserves. Harrell matched Williams with 24 while also grabbing 10 rebounds. Paul George added 22 points.\n\n“It’s just fantastic,” Clippers coach Doc Rivers said about having Harrell and Williams off his bench. “It’s like you have the ultimate relief pitchers coming in the game”\n\n“It’s come down to the point where, I think we kind of know each other and know kind of what each other wants to do. Each other’s tendencies,” Harrell said of the reserves play, later adding: “We’ve got so many different lineups we can throw out there that we can succeed in.”\n\nPlaying the second night of a back-to-back on the road, Los Angeles forward Kawhi Leonard took the night off to with “injury management” on his left knee.\n\nJonas Valanciunas had 30 points and 16 rebounds for Memphis, both season highs for the center. Jae Crowder and Ja Morant finished with 20 points each, Morant also had 11 assists as the Grizzlies lost their fifth straight.\n\nMemphis, which trailed 92-88 entering the fourth, opened the final period on a 13-2 run. That gave Memphis its biggest lead of the game at that point and led to Rivers calling a timeout after Crowder converted his second 3-pointer from the top of the key.\n\n“We were just playing with energy,” said Grizzlies forward Jaren Jackson Jr., who finished with 17 points. “The bench came in and made a huge impact. Everyone was running in there and having fun again. The defense just led to the offense more.”\n\nWhile Memphis’ lead reached 10 with just under 7 minutes left, the Clippers had a 15-5 run to tie at 113. The teams exchange leads and the game was tied at 119 before Harrell’s winning basket.\n\n“I just try to keep playing, keep executing, just keep fighting all the way through,” Harrell said. “That’s what it is all about, fighting all the way through to the very end. Leave it all out there. That’s all we can do.”\n\nTIP-INS\n\nClippers: Rodney McGruder started in Leonard’s spot, his second start of the season. McGruder would leave in the third quarter with a right lower leg injury. He did not return. ... F Landry Shamet missed his ninth straight game with a high left ankle sprain.\n\nGrizzlies: F Kyle Anderson, who was listed as questionable because of right heel soreness, did not play. ... The Clippers held Morant to one shot and no points in the first half. The rookie scored 14 points in the fourth. ... Memphis challenged an out-of-bounds call in the fourth giving the ball to the Clippers. After review, the call was overturned.\n\nCLARKE CONNECTION\n\nMemphis rookie Brandon Clarke, the 21st overall pick from Gonzaga, was 5 of 8 from the field and has made 60 of 88 over his last 10 games, for 68% over the span. Clarke entered the game leading all rookies in shooting percentage for the season at 63.6%, which also ranks fifth overall.\n\nFINAL WORD\n\n“I just thought you let a team that hasn’t been winning hang around, they start to smell it. We talked about it before the game. Obviously, no one heard it.” -- Rivers.\n\nUP NEXT\n\nClippers: At San Antonio on Friday night.\n\nGrizzlies: Host Utah on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995750.1912792
}