{
  "game_id": "0022201208",
  "espn_id": "401469363",
  "date": "Apr 07, 2023",
  "matchup": "MEM @ MIL",
  "headline": "Grizzlies beat Bucks 137-114, secure No. 2 seed in West",
  "body": "MILWAUKEE -- — Jaren Jackson had 36 points, Luke Kennard added 19 and the Memphis Grizzlies beat the short-handed Milwaukee Bucks 137-114 on Friday night to wrap up the No. 2 seed in the Western Conference for the second consecutive season.\n\n\r\n              Memphis entered the game with a two-game lead over Sacramento for second place in the West, but the Kings owned the tiebreaker. Denver took the No. 1 seed in the West on Wednesday night.\n\n\r\n              “It’s very important,\" Grizzlies guard Ja Morant said about the second seed. “We’re a very good team at home, so we obviously want that home-court advantage. Definitely big time for us.” \n\n\r\n              Morant, who finished with 12 points and eight assists, went to the locker room early in the game after sustaining a right wrist and hand injury in a collision with Milwaukee's Jae Crowder. Morant, who later returned to the game, had a large wrap on his right arm in the locker room afterward. \n\n\r\n              When asked about his condition, Morant said: “I'm good.”\n\n\r\n              After trailing by one point at the half, Memphis took command with a 24-7 run to start the third. The Grizzlies led by 24 in the quarter and held the Bucks at bay throughout the remainder of the game.\n\n\r\n              “Our communication wasn’t great in the first half,\" Kennard said. “We didn't play up to how we have been playing, especially on the defensive end. We weren’t very physical and we kind of laid back a little bit.” \n\n\r\n              Memphis coach Taylor Jenkins said he challenged the team at halftime to be more physical and communicate better.\n\n\r\n              “We raised our level in that third quarter,” Jenkins said. \n\n\r\n              The Grizzlies held the Bucks to 15 points in the third after surrendering 41 points in the second.\n\n\r\n              “Better discipline, a little bit more effort,\" Jackson said. \"We figured it out and I’m glad we did.”\n\n\r\n              The increased intensity on defensive after halftime gave a boost to the Grizzlies offense, Kennard said.\n\n\r\n              “We didn't give them many second chance opportunities and we were able to get out in transition and get some easy looks,” he said.\n\n\r\n              Lindell Wigginton had 25 points and Crowder a season-high 24 to lead Milwaukee. Wigginton had a total of eight points in limited action this season prior to Friday’s output. He also had 11 assists.\n\n\r\n              “It was a great opportunity for Lindell,” Bucks coach Mike Budenholzer said. “He brings a toughness, a competitiveness. He makes shots. He gets to the paint.”\n\n\r\n              The Bucks, who clinched the NBA’s best record and the No. 1 seed in the Eastern Conference with a victory over Chicago on Wednesday, sat six players, including Giannis Antetokounmpo, Jrue Holiday, Khris Middleton and Brook Lopez. \n\n\r\n              Antetokounmpo, who also sat out Wednesday, was listed on the injury report with a sore right knee. Holiday and Lopez rested, while Middleton was held out with a right knee issue. Grayson Allen and Pat Connaughton also sat out with ankle injuries.\n\n\r\n              Bobby Portis and Joe Ingles were active but didn't play.\n\n\r\n              The Bucks' makeshift lineup got off to a hot start and led by nine in the first quarter before the Grizzlies pulled ahead and led 36-31 after the period.\n\n\r\n              After the Grizzlies charged to an 11-point lead in the second, the Bucks rallied to take a 72-71 lead at the half, paced by 18 points from Crowder, who made all seven of his shots from the field, including four from 3-point range. Milwaukee shot 15 of 30 from deep over the first two quarters, which allowed them to hold the lead despite Memphis shooting 65% overall in half. \n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Kennard, who came in averaging 9.1 points per game, had 11 in the first quarter. … Jackson had 22 first-half points. … Outscored the Bucks 62-34 in the paint. … Finished 16-24 on the road. \n\n\r\n              Bucks: Antetokounmpo was honored in a pregame ceremony for his accomplishments this season, including becoming the franchise leader in points, assists and games played. He was joined on the court by Middleton, former Bucks star Paul Pressey and one-time general manager John Hammond, who selected Antetokounmpo with the 15th pick in the 2013 draft.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Oklahoma City on Sunday.\n\n\r\n              Bucks: At Toronto on Sunday.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994159.4406688
}