{
  "game_id": "0022000146",
  "espn_id": "401267306",
  "date": "Jan 10, 2021",
  "matchup": "LAL @ HOU",
  "headline": "Davis has 27 as Lakers roll to 120-102 win over Rockets",
  "body": "HOUSTON -- — Anthony Davis had 27 points, LeBron James added 18 and the Los Angeles Lakers won for the sixth time in seven games with a 120-102 victory over the Houston Rockets on Sunday night.\n\n\r\n                    “(Tonight) was just A.D. being A.D. and just having him back in the lineup gives us a whole other dynamic both offensively and defensively,\" James said. \n\n\r\n                    It was a testy game that included five technical fouls, two flagrant fouls and the first-half ejections of Markieff Morris and DeMarcus Cousins. \n\n\r\n                    Davis, who sat out on Friday with a groin strain, helped the Lakers finish with 62 points in the paint in a game in which they led by as many as 27.\n\n\r\n                    “His shot-making just makes him so difficult to guard and he can hurt you in so many ways,\" Los Angeles coach Frank Vogel said. \n\n\r\n                    The Lakers were up by double figures for most of the night and opened the fourth quarter with a 10-4 run to push the lead to 98-79 with about nine minutes remaining. Houston used a 7-2 run, with a 3-pointer from Ben McLemore, later in the quarter to get within 15 with about five minutes to go. But former Rocket Montrezl Harrell scored four quick points to make it 108-89 and both teams took out most of their starters soon after that. \n\n\r\n                    Christian Wood scored 23 points and James Harden had 20 in the first of two straight games against the Lakers with the second one coming Tuesday night in Houston.\n\n\r\n                    “Two things for us were the turnovers and transition,\" Houston coach Stephen Silas said. “The transition doesn’t have anything to do with us being together for a day, a month, or a year. Run back.”\n\n\r\n                    Morris was ejected in the first quarter after an altercation with Cousin s. Morris knocked Jae’Sean Tate to the ground in the lane with a hard shoulder to the chest and Cousins quickly pushed Morris to the ground. Cousins then turned and was bending down to help Tate off the court when Morris jumped up, charged at Cousins and shoved him with both hands. He was quickly pulled away by teammates and officials but continued jawing at Cousins and trying to follow him to the Houston bench. \n\n\r\n                    After a video review Morris received a flagrant 1 foul for the play on Tate and was given a technical foul and ejected for the ensuing dustup. Cousins was also given a technical foul but was not ejected. \n\n\r\n                    But he wouldn’t remain in the game much longer. James was driving to the basket early in the second quarter when Cousins tried swipe at the ball but instead hit him in the head and face. James fell to the court where he remained for a few seconds before slowly getting up and remaining in the game. \n\n\r\n                    The play was reviewed and Cousins was given a flagrant 2 foul and ejected. \n\n\r\n                    Houston came out flat after Friday night’s blowout win over the Magic and the Lakers had a 19-point lead at halftime. Los Angeles opened the third quarter with an 11-3 run, capped by a 3 from Dennis Schroder, to make it 76-49 with about nine minutes left in the quarter. \n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Talen Horton-Tucker had 17 points off the bench. ... Harrell had 16 points and eight rebounds. \n\n\r\n                    Rockets: Danuel House missed his fourth straight game with back spasms. ... Houston made just 12 of 41 3-pointers. \n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: After Tuesday’s game against Houston, they conclude their road trip at Oklahoma City on Wednesday night. \n\n\r\n                    Rockets: Following the second meeting with Los Angeles, the Rockets play two games at San Antonio on Thursday and Saturday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997332.886698
}