{
  "game_id": "0022201163",
  "espn_id": "401469318",
  "date": "Apr 02, 2023",
  "matchup": "TOR @ CHA",
  "headline": "Raptors beat Hornets, clinch play-in tournament spot",
  "body": "CHARLOTTE, N.C. -- — Pascal Siakam scored 36 points, Fred VanVleet added 20 points and a career-high 20 assists and the Toronto Raptors beat the undermanned Charlotte Hornets 128-108 on Sunday to secure a spot in the NBA play-in tournament.\n\n\r\n              O.G. Anunoby added 23 points for the Raptors, who clinched after the Brooklyn Nets beat the Utah Jazz later in the day.\n\n\r\n              The Raptors (39-39) are now focused on seeding with four games remaining.\n\n\r\n              They entered the day tied with the Atlanta Hawks for eighth place in the Eastern Conference and looking to move up in the standings to secure a better chance of advancing out of the play-in tournament. The team finishing eighth needs just one victory; the team finishing ninth would need two to reach the postseason as the No. 8 seed.\n\n\r\n              “It's really important for us” to get to the 8 seed, VanVleet said. “For the last couple of weeks it has been really simple for us — we're in a win-every-game mode. There's not much to think about. You have to go out and perform and play your best and try to take care of business. We are just trying to play our best basketball at this time of the year.”\n\n\r\n              VanVleet, who now owns the franchise single-game records for points and assists, made sure the Raptors were on top of their game.\n\n\r\n              The Raptors outscored the Hornets 90-44 in the paint in the opener of a two-game series, which helped offset 8-of-28 shooting from 3-point range. The teams meet again Tuesday night in Charlotte.\n\n\r\n              “He was really good,” Toronto coach Nick Nurse said of VanVleet. “He got the ball a lot of places where it needed to go.”\n\n\r\n              Hornets coach Steve Clifford said VanVleet was “high intensity” from the beginning and his team couldn't stop him on the pick-and-roll.\n\n\r\n              “He just crushed us,” Clifford said. “Every pick-and-roll, it didn’t matter, angle, high side, he either scored, got fouled or they got a wide-open shot. So we’ve mixed up the schemes but none of that worked.”\n\n\r\n              Svi Mykhailiuk scored a career-high 26 points and Mark Williams added 15 points and 12 rebounds for the injury-riddled Hornets, who played without all five of the team’s anticipated starters this season. James Bouknight added 21 points and Theo Maledon had 14 assists.\n\n\r\n              The Raptors dominated from the start.\n\n\r\n              VanVleet made his impact felt early, scoring 11 points and assisting on six other baskets in the first quarter as Toronto built a 35-25 lead.\n\n\r\n              The Hornets (26-53) had nine turnovers in the first half leading to 18 Raptors points, the highlight coming when Scottie Barnes came up with a steal and provided an alley-oop lob to a cutting Precious Achiuwa for a fast-break dunk.\n\n\r\n              Charlotte cut Toronto's 18-point lead to 10 midway through the fourth after JT Thor knocked down a corner 3 but Siakam helped the Raptors push the lead safely back to 16 with eight points down the stretch.\n\n\r\n              “I thought we played really disciplined offensively,\" Nurse said. \"We didn’t make a lot of really good shots. We had some really nice two passes to corner 3s and we didn’t make one of them. We're still doing the right things and getting it where it was supposed to go, and that’s all you can do.”\n\n\r\n              TIP INS\n\n\r\n              Raptors: Anunoby suffered what Nurse described as a “mild, mild sprain” of his ankle. ... Turned 18 Charlotte turnovers into 28 points. ... Bench was outscored 40-21. \n\n\r\n              Hornets: Were missing a number of key players including all three point guards in LaMelo Ball, Terry Rozier and Dennis Smith Jr., along with Gordon Hayward, P.J. Washington and Cody Martin. ... Bouknight now has 11 3-pointers in the last two games.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994008.9610481
}