{
  "game_id": "0022000624",
  "espn_id": "401307409",
  "date": "Mar 17, 2021",
  "matchup": "CHA @ DEN",
  "headline": "Nikola Jokic has triple double, Nuggets beat Hornets 129-104",
  "body": "DENVER -- — Nikola Jokic had 12 points, 10 rebounds and 10 assists for another triple-double, Michael Porter Jr. added 28 points and the Denver Nuggets pulled away in the second half to beat the Charlotte Hornets 129-104 on Wednesday night.\n\n\r\n                    Jokic has 10 triple-doubles this season and 51 overall. He also had his 228th double-double to move one past Dikembe Mutumbo for the franchise record. Jokic leads the NBA in double-doubles this season with 36 in 40 games.\n\n\r\n                    “Everybody knows Joker is going to do what he does every single night,” Porter said, referring to Jokic by his nickname. “He can do it all. If he wants to score 30 points, he can score 30 every single night. But he makes sure we get involved and we find our rhythm and that’s what great players do.”\n\n\r\n                    Will Barton scored 23 points to help the Nuggets win for the seventh time in eight games and snap Charlotte's four-game winning streak.\n\n\r\n                    Terry Rozier had 21 points to lead the Hornets. LaMelo Ball had 14 points.\n\n\r\n                    Up 57-45 at the half, the Nuggets took control with a dominant third quarter, outscoring the Hornets 38-22 to take a 95-67 lead into the final period. In the final 3 1/2 minutes of the third, as the Nuggets stretched their lead to 28 points, Jokic had passes to Jamal Murray that set up a 3-pointer, fed JaMychal Green for a dunk and PJ Dozier for a layup before going in for a dunk off a feed from Facundo Campazzo.\n\n\r\n                    Charlotte could not threaten the rest of the way as the Nuggets led by 34 points. They emptied their bench midway through the final quarter.\n\n\r\n                    “Denver’s a really good team,” Charlotte’s Gordon Hayward said. “They’re gearing up to try for a championship. They’ve been together for a while. So when you, as a team and collectively, don’t play your best they can embarrass you. And that’s certainly what happened tonight.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Less than a month after going 3-3 on six-game trip, Charlotte began another extended stay on the road. Wednesday's visit to Denver was the first in a five-game road trip. Nuggets: G Gary Harris remains sidelined by a left abductor strain that has kept him out for most of the last five weeks. There is no timetable yet for his return. “I think for right now, and the foreseeable future, Gary is out and hopefully every day he is inching closer to getting back and being able to play,” coach Michael Malone said before the game.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: At Los Angeles Lakers on Thursday night.\n\n\r\n                    Nuggets: Host Chicago on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764997014.074385
}