{
  "game_id": "401809967",
  "espn_id": "401809967",
  "date": "Oct 26, 2025",
  "matchup": "LAC vs POR",
  "headline": "Clippers beat Portland 114-107 in the Trail Blazers’ 2nd game since Billups' arrest",
  "body": "INGLEWOOD, Calif. -- — Kawhi Leonard had 30 points and 10 rebounds and the Los Angeles Clippers beat Portland 114-107 on Sunday night in the Trail Blazers' second game since head coach Chauncey Billups was arrested on gambling charges.\n\n\r\n              Billups and Miami Heat player Terry Rozier were among those arrested Thursday for what federal law enforcement officials described as their involvement in illicit gambling activities. Billups was charged with participating in a conspiracy to fix high-stakes card games.\n\n\r\n              The NBA placed Billups and Rozier on leave following their arrests. Assistant coach Tiago Splitter is serving as Portland’s interim head coach.\n\n\r\n              Down 60-55 at the half, Los Angeles outscored Portland 32-22 in the third quarter to take an 87-82 lead. Leonard, James Harden and Ivica Zubac each had nine points in the period. \n\n\r\n              Zubac finished with 21 points and eight rebounds. Harden had 20 points and 13 assists — along with seven turnovers. John Collins scored 16 points.\n\n\r\n              Los Angeles improved to 2-1, following an opening loss at Utah and home victory over Phoenix. The Clippers are 19-2 against Portland since the start of the 2019-20 season.\n\n\r\n              Deni Avdija led the Trail Blazers with 23 points. Jrue Holiday had 21, Shaedon Sharpe 19 and Jerami Grant 17.\n\n\r\n              Portland played its first road game of the season. It opened with a loss to Minnesota under Billups, then beat Golden State.\n\n\r\n              Up next\r\n              \r\n              Trail Blazers: At Los Angeles Lakers on Monday night.\n\n\r\n              Clippers: At Golden State on Tuesday night.\n\n\r\n              ------\n\n\r\n               AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042508.1313999
}