{
  "game_id": "0022301042",
  "espn_id": "401585670",
  "date": "Mar 25, 2024",
  "matchup": "PHI @ SAC",
  "headline": "Sabonis' milestone night helps the Kings beat the 76ers 108-96",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis had his NBA-leading 25th triple-double of the season on a milestone night, leading the Sacramento Kings to a 108-96 victory over the Philadelphia 76ers on Monday.\n\n\r\n              Sabonis had 11 points, 13 rebounds and 10 assists to become the fifth player in NBA history with at least 25 triple-doubles in a season, joining Nikola Jokic, Russell Westbrook, Wilt Chamberlain and Oscar Robertson.\n\n\r\n              Sabonis also posted his 54th consecutive double-double, breaking a tie with Kevin Love for the longest streak since the 1976-77 merger between the NBA and ABA. Sabonis is nowhere close to the all-time record of 227 straight double-doubles held by Chamberlain, according to the Elias Sports Bureau. \n\n\r\n              “Shout out to Domas. What a job,” Kings coach Mike Brown said. “What a phenomenal, phenomenal year he's having. Obviously, he should have been an All-Star. Obviously, he should be talked about for first, second, third All-NBA. And he should be in the MVP discussions with the way that he’s playing.\"\n\n\r\n              Keegan Murray and De'Aaron Fox each scored 23 points for the Kings, who snapped a 10-game skid against the Sixers to move into a tie for sixth place in the Western Conference with Dallas. Sacramento hosts the Mavericks on Tuesday night as the teams fight to remain in the top six and avoid the play-in tournament.\n\n\r\n              Tyrese Maxey scored 29 points to lead the Sixers, who wrapped up a 1/3 West Coast swing. Philadelphia dropped into eighth place in the Eastern Conference, a half-game behind idle Miami. \n\n\r\n              Maxey was held to three points in the second half.\n\n\r\n              “They started blitzing everything with him,” Sixers coach Nick Nurse said. “We didn’t do a great job of taking advantage of that. We’ve been really good at it lately and tonight we weren’t as good.”\n\n\r\n              Maxey scored Philadelphia's first 16 points and was a one-man show offensively in the first quarter with 21 of the 25 points (84%) for the 76ers.\n\n\r\n              No player in at least the past 28 seasons had scored a higher share of his team's points in the first quarter with at least 20 points scored. Maxey topped the previous high of 82.8% by Michael Jordan for Washington against Charlotte on Dec. 29, 2001.\n\n\r\n              But Maxey didn't get nearly enough help, and the Sixers trailed 60-48 at halftime.\n\n\r\n              Sacramento maintained a comfortable lead throughout the second half, with the biggest excitement coming in the third quarter when Sabonis reached his milestone. A tribute video was played for him following the first stoppage after he reached the mark.\n\n\r\n              “He didn’t really acknowledge that what he did was amazing to do in this league,\" teammate Davion Mitchell said. \"But it’s amazing to see him do it. Especially to be on the same team with him. That’s a blessing.”\n\n\r\n              Philadelphia played without Kelly Oubre, sidelined by a sore left shoulder sustained in a fall on Sunday against the Clippers. Buddy Hield also left the game early with an ankle injury. X-rays were negative.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host the Los Angeles Clippers on Wednesday night.\n\n\r\n              Kings: Host the Dallas Mavericks on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764996410.231745
}