{
  "game_id": "0022000651",
  "espn_id": "401307440",
  "date": "Mar 21, 2021",
  "matchup": "LAL @ PHX",
  "headline": "Suns roll past LeBron-less Lakers for 111-94 win",
  "body": "PHOENIX -- — The LeBron-less Los Angeles Lakers are off to a predictably slow start.\n\n\r\n                    Devin Booker and Deandre Ayton both had 26 points, Chris Paul had a triple-double with 11 points, 13 assists and 10 rebounds and the Phoenix Suns beat the Lakers 111-94 on Sunday night.\n\n\r\n                    Los Angeles played without 17-time All-Star LeBron James for just the second time this season and fell to 0-2 in his absence. James suffered a high ankle sprain in a 99-94 loss to the Atlanta Hawks on Saturday and is expected to miss significant time.\n\n\r\n                    Even after the loss, Lakers coach Frank Vogel was optimistic after his team's performance. Los Angeles is also playing without All-Star forward Anthony Davis, who has missed a big chunk of the season with a right calf strain.\n\n\r\n                    \"I think our guys really fought tonight,” Vogel said. “We didn’t shoot the ball that well, but I thought we competed at a very high level. It is going to take a little time as we adjust, figure out where the shots are coming from and what our new identity is going to look like.”\n\n\r\n                    Los Angeles struggled on offense without James, shooting 41% from the field. Montrezl Harrell led the Lakers with 23 points off the bench on 10-of-13 shooting. Dennis Schroder added 22 points.\n\n\r\n                    “Second- and fourth-quarter defense — holding them to 18 points in each. That won us the game,” Suns coach Monty Williams said.\n\n\r\n                    Phoenix entered the fourth quarter with an 88-76 advantage. The Lakers pulled within 96-89 with 6:33 left after Schroder made a free throw following a technical foul on Paul, but the Suns responded with the next seven points and pulled away for their 17th win in 21 games.\n\n\r\n                    “We stayed the course,” Paul said. “That’s a talented team over there.”\n\n\r\n                    The Suns pushed out to a 59-44 lead by halftime. Booker had 14 points before the break, while Ayton had 12. The Lakers shot just 37% from the field in the first half. \n\n\r\n                    PAUL GETS TO 10,000\n\n\r\n                    Paul became the sixth player in NBA history with 10,000 assists when he threw an alley-oop pass to Deandre Ayton for a dunk in the third quarter.\n\n\r\n                    “It’s a blessing, first and foremost, just to play this long,” Paul said. \"That’s something I don’t take for granted. There’s a lot of guys I came in with who are coaching and can’t play. \n\n\r\n                    The only players in league history with more assists are John Stockton, Jason Kidd, Steve Nash, Mark Jackson and Magic Johnson. With about 30 games left this season, it's possible Paul could pass Nash, Jackson and Johnson for third on the career list.\n\n\r\n                    “I’m just grateful to be around Chris and enjoy moments like this,” Williams said, who praised Paul's hard work throughout his career. “You don’t get 10,000 assists just by showing up.”\n\n\r\n                    LEBRON'S ABSENCE\n\n\r\n                    Lakers coach Frank Vogel said he wasn't sure how much time James will miss with his ankle injury, but made it clear that a quick return was unlikely.\n\n\r\n                    “We’re prepared for him to be without us basically indefinitely,” Vogel said during pregame Sunday.\n\n\r\n                    Vogel said the Lakers would obviously miss having having the four-time Most Valuable Player on the floor, but the team's offense would have the same “general structure and framework.\"\n\n\r\n                    The coach also hoped that the time off the court would allow James a mental break as well as a physical one. The Lakers won the NBA championship last season in a COVID-19 delayed season that ended on Oct. 11. That gave James and the rest of L.A.'s players less than two months to recover before training camp for the current season.\n\n\r\n                    James was at Sunday's game with a boot on his injured ankle.\n\n\r\n                    FACES IN THE CROWD\n\n\r\n                    Kansas City Chiefs quarterback Patrick Mahomes and tight end Travis Kelce watched Sunday's game from a suite.\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Without James, Los Angeles went with a starting lineup of Wesley Matthews, Kyle Kuzma, Markieff Morris, Kentavious Caldwell-Pope and Schroder. \n\n\r\n                    Suns: F Cam Johnson was available for the first time since missing six straight games in the league's healthy and safety protocol. He made his first shot — a 3-pointer from the corner — after checking in late in the first quarter. He finished with eight points in 15 minutes.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Travel to face the Pelicans on Tuesday.\n\n\r\n                    Suns: Travel to face the Heat on Tuesday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt at www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997300.5723789
}