{
  "game_id": "0022400005",
  "espn_id": "401703374",
  "date": "Nov 12, 2024",
  "matchup": "TOR @ MIL",
  "headline": "Antetokounmpo scores 23 to lead Bucks past Raptors 99-85 in matchup of NBA's worst",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 23 points to lead the Milwaukee Bucks past the Toronto Raptors 99-85 on Tuesday night in an NBA Cup game between teams that entered with the two worst records in the league.\n\n\r\n              Bobby Portis added 17 points off the bench for Milwaukee (3-8). Brook Lopez scored 13 points while AJ Green and Ryan Rollins had 12 apiece. \n\n\r\n              Gradey Dick paced the Raptors (2-10) with 32 points, a career high for the second-year player. Jakob Poeltl scored 13 points and Chris Boucher had 12.\n\n\r\n              The Bucks began to pull away midway through the third quarter and pushed their lead to 21 points early in the fourth. Toronto got within 10 points with less than five minutes remaining but did not get closer.\n\n\r\n              The Bucks were without star guard Damian Lillard, who is in the concussion protocol, while the Raptors' Immanuel Quickley sat out with an elbow injury. \n\n\r\n              Takeaways\r\n              Raptors: Dick had 22 first-half points, which included making 12 of 14 free throws. He came in averaging 19 points per game.\n\n\r\n              Bucks: Milwaukee attempted 31 3-pointers in the first half as the Raptors focused their defensive attention on Antetokounmpo in and around the paint. The Bucks finished 16 of 56 (28.6%) from deep.\n\n\r\n              Key moment\r\n              The Bucks led 54-43 at halftime, but the Raptors went on an 11-0 run to start third quarter. The Bucks responded with an 11-2 run, capped by Green's 3-pointer.\n\n\r\n              Key stat\r\n              The Bucks halted a two-game skid, while the Raptors have lost five straight.\n\n\r\n              Up next\r\n              Raptors: Host Detroit on Friday.\n\n\r\n              Bucks: Host Detroit on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996996.322805
}