{
  "game_id": "0021800226",
  "espn_id": "401070907",
  "date": "Nov 17, 2018",
  "matchup": "ATL @ IND",
  "headline": "Bogdanovic scores 22 points, Pacers hold off Hawks 97-89",
  "body": "INDIANAPOLIS --  With All-Star Victor Oladipo out for most of the game, the Pacers relied on a veteran and a rookie to put away the Hawks.\n\nBojan Bogdanovic scored 22 points, hitting a late 3-pointer and a pair of free throws to seal the win, as Indiana beat Atlanta 97-89 on Saturday night.\n\n\"Bogey is always aggressive,\" Pacers coach Nate McMillan said. \"He's looking to attack. Tonight, in the second half of the fourth quarter, he really made some big shots.\"\n\nRookie Aaron Holiday came off the bench and scored 12 points, all in the second half, including nine in the fourth quarter. Darren Collison also scored 12 and Thaddeus Young had 11 points and seven rebounds for the Pacers.\n\n\"I'm a competitor so if I get the chance, I'm going to go out there and take advantage, and that's what I did,\" said Holiday, who hadn't played since a 119-107 win at Cleveland on Oct. 27. \"I just went out there and played my game.\"\n\nOladipo, who was a game-time decision with a sore right knee, started but didn't last long. He left for the locker room with 7:22 remaining in the first quarter after falling into a broadcast cameraman and fans sitting courtside.\n\nReserve Jeremy Lin scored 16 points and Kent Bazemore had 13 points, five rebounds and four steals for the Hawks, who have lost seven straight.\n\nThe Pacers used an 11-0 run to take the lead for good late in the third quarter.\n\nCollison, who scored 10 points in the third, made a 3-pointer before Holiday hit a 3 to put Indiana ahead 68-67 with 2:39 left in the quarter, and the Pacers led the rest of the way.\n\n\"Just trying to get a group to finish a game,\" Hawks coach Lloyd Pierce said. \"Most good teams put their foot on the gas and they keep going.\"\n\nIt was Indiana's second win in two nights after a 99-91 victory over Miami on Friday, and neither of them had big contributions from Oladipo, who scored eight points against the Heat.\n\nJohn Collins converted a three-point play to put the Hawks ahead 34-30 at the start of a 9-0 spurt that ended with Trae Young's layup to make it 40-30 with 6:43 left in the second quarter.\n\nThe Pacers answered with back-to-back baskets by Turner, and Bogdanovic converted a three-point play and then hit a 3-pointer to put Indiana ahead 47-44 with 2:48 remaining in the quarter.\n\nThe Hawks closed out the half scoring 12 straight to take a 56-47 lead at the break.\n\nMILESTONE WIN\n\nMcMillan got his 100th victory with the Pacers. Now in his third season, McMillan is 100-80 in the regular season and 3-8 in the playoffs. He's 578-532 overall as an NBA coach with a 17-28 playoff record.\n\nFAMILIAR FACE\n\nAlex Poythress got his first start with the Hawks against the team he spent the 2017-18 season with. He appeared in 25 games for the Pacers last season and signed a two-way contract with Atlanta in August. He left Saturday's game with 6:35 remaining in the third quarter with a left ankle contusion.\n\nTIP-INS\n\nHawks: C Dewayne Dedmon had 12 points and seven rebounds. ... Atlanta finished 19 of 27 from the line, including 10 of 13 free throws in the second quarter. ... F Taurean Prince was out for a second straight game with pain in his right Achilles.\n\nPacers: C Myles Turner had 10 points, 11 rebounds and three blocks. ... G Tyreke Evans scored 10 of his 11 points in the first half. ... Indiana is 8-2 against Eastern Conference teams, only losing to Milwaukee and Philadelphia.\n\nUP NEXT\n\nHawks: Host the Los Angeles Clippers on Monday night.\n\nPacers: Home against Utah on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995381.921532
}