{
  "game_id": "0022300515",
  "espn_id": "401585143",
  "date": "Jan 09, 2024",
  "matchup": "MEM @ DAL",
  "headline": "Bane scores 32 to help injury-riddled Grizzlies beat the Mavericks 120-103",
  "body": "DALLAS -- — Desmond Bane scored 32 points to lead the injury-riddled Memphis Grizzlies to a 120-103 win over the Dallas Mavericks on Tuesday night.\n\n\r\n              Bane scored 13 of the Grizzlies’ final 18 points in the third quarter to help build a 20-point lead entering the final quarter in the team’s first game since learning of leading scorer Ja Morant’s season-ending shoulder injury.\n\n\r\n              The Grizzlies (14-23), who are 2-0 since Morant’s injury, were without Marcus Smart for much of the second half. Smart left the game with 7:38 left in the third quarter with a dislocated finger on his right hand.\n\n\r\n              “It was awesome. I’m so proud of the group, obviously, with everything that has transpired in the last 24 hours,” Memphis coach Taylor Jenkins said. “This is one of the most impressive team wins of the season. Our guys came out and played to our standard and with a lot of joy. It was awesome just how they rallied together.”\n\n\r\n              Before his injury, Smart scored 23 points on 9 of 16 shooting. He hit four 3-pointers, including one from the left wing to give Memphis an 18-point lead before leaving the game. He later returned to the bench with an icepack covering his right hand. Jaren Jackson Jr. was unavailable because of a right knee contusion.\n\n\r\n              The Mavericks (22-16) were dealing with injury issues, too. Leading scorer Luka Doncic was in and out of the game with an ankle injury. He left the game briefly in the first half after hitting the floor on a hard foul.\n\n\r\n              After some time in the locker room, he returned for the final seven minutes of the first half. He left the game again late in the third quarter, again retreating to the locker room before returning to the bench. He finished with 31 points. Kyrie Irving scored 33 to lead the Mavericks.\n\n\r\n              The road team won each of the four games between the teams this season.\n\n\r\n              Dallas cut the deficit to 10 points on Jaden Hardy’s fastbreak dunk with under five minutes to go in the third. Bane, however, responded with consecutive 3s — his first of the game after an 0 for 5 start — and extended the Grizzlies’ lead back to 16.\n\n\r\n              After a slow start shooting, Bane heated up in the second half and finished with his 11th game this season with 30 or more points. He was 11 of 27 from the field, including 2 of 9 from the 3-point arc.\n\n\r\n              “He was great tonight. He came out to show that he could beat us by himself without Ja or Jackson,” Mavericks head coach Jason Kidd said. “Their offensive rebounds — 18 — that’s way too many. Their physicality was too much for us. They came out, and they were assertive right off the bat. That put us in a hole, and we were playing uphill from there.”\n\n\r\n              Memphis outrebounded Dallas 54-33, including an 18-8 advantage on offensive rebounds.\n\n\r\n              Up Next\n\n\r\n              Grizzlies: Host Los Angeles Clippers on Friday\n\n\r\n              Mavericks: Host New York on Thursday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996513.314333
}