{
  "game_id": "0022201068",
  "espn_id": "401469223",
  "date": "Mar 19, 2023",
  "matchup": "TOR @ MIL",
  "headline": "Antetokounmpo, Lopez lead Bucks past Raptors, 118-111",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 22 points, 13 rebounds and 10 assists, Brook Lopez scored 17 of his 26 points in the fourth quarter, and the Milwaukee Bucks rallied for a 118-111 victory over the Toronto Raptors on Sunday night.\n\n\r\n              Khris Middleton added 20 points and Bobby Portis had 14 as the Bucks improved to an NBA-best 51-20. Antetokounmpo had his 33rd career triple-double, making all nine of his field goal attempts.\n\n\r\n              Lopez scored the first eight points of the fourth quarter on a pair of 3-point plays and a dunk to put Milwaukee in front 97-95. Middleton’s free throw capped the 15-2 run that put the Bucks up 104-97.\n\n\r\n              “We settled down, we got back in control,” said Lopez, who outscored Toronto 17-16 in the fourth quarter. “We talked about the third quarter-fourth quarter break. They just shot more times than us. We were shooting just as well, or better than them from two and three. We just had to take care of the ball and keep them off the offensive glass.”\n\n\r\n              A dunk by Jakob Poeltl brought Toronto within 110-107, but Lopez scored underneath and Jrue Holiday hit two free throws to make it 114-107 with 1:29 remaining.\n\n\r\n              Bucks coach Mike Budenholzer said Lopez’s outburst to start the fourth quarter was key.\n\n\r\n              “It changed the game,” Budenholzer said. “I think what he did offensively was important, and then the defense always stands out. It was a little bit muddy, not a pretty game there, and he stepped up and kind of just changed our feel and changed the momentum for us, particularly offensively, which we needed tonight.”\n\n\r\n              Fred VanVleet had 23 points and O.G. Anunoby added 22 for the Raptors, who had won their three previous games. Toronto missed a chance to move into eighth in the East Conference ahead of Atlanta, which lost to San Antonio 126-118.\n\n\r\n              “All these games are important to us, that’s for sure,” said Toronto coach Nick Nurse, whose team plays their next four at home. “I like, kind of, how we’re playing. I think we’re very well for long stretches of games. Hopefully, we can just keep building on that.”\n\n\r\n              Anunoby and Gary Trent Jr. hit back-to-back 3-pointers to put the Raptors up 83-76 with just under 4 1/2 minutes left in the third quarter. Toronto led 95-89 entering the final period.\n\n\r\n              “There was just two little probably bad stretches,” Nurse said. “In those stretches, they kind of got a couple of at the rim ... a couple of and-ones. We just kind of lost our rim protection, and then kicked out and made a couple 3s after we kind of got that fixed. Give them credit, they made a couple big ones down the stretch when they needed them.”\n\n\r\n              The Bucks hit seven of their 16 3-pointers in the first period en route to a 33-29 lead.\n\n\r\n              TIP-INS Raptors: F Scottie Barnes exited in the second quarter with a left wrist injury and did not return.\n\n\r\n              Bucks: F Jae Crowder missed his second straight game with left calf soreness. C Meyers Leonard was a late scratch, also with left calf soreness.\n\n\r\n              GIANNIS MOST BUCKS GAMES PLAYED\n\n\r\n              Antetokounmpo, in his 10th season with the Bucks, played in his franchise-record 712th game, surpassing Junior Bridgeman. Antetokounmpo already was the franchise leader in points, assists, triple-doubles, free throws and minutes played. “It’s a great feeling. I wasn’t aware of it coming into the game,” Antetokounmpo said. “It’s been a long, long journey. There’s more to be accomplished yet, I believe.”\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Indiana on Wednesday.\n\n\r\n              Bucks: Host San Antonio on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994017.2165859
}