{
  "game_id": "0022400895",
  "espn_id": "401705461",
  "date": "Mar 05, 2025",
  "matchup": "MEM vs. OKC",
  "headline": "Gilgeous-Alexander scores 41 points as Thunder beat Grizzlies 120-103",
  "body": "MEMPHIS, Tenn. -- — Shai Gilgeous-Alexander scored 41 points and keyed a third-quarter rally as the Oklahoma City Thunder beat the Memphis Grizzlies 120-103 on Wednesday night.\n\n\r\n              Jalen Williams added 20 points and Aaron Wiggins had 16 for the Thunder, who have now won five straight games and seven of their last eight. Isaiah Hartenstein finished with 10 points and 15 rebounds.\n\n\r\n              Ja Morant, who returned after missing two games with a sore shoulder, led Memphis with 24 points, but was 8 of 22 from the field. Desmond Bane and Scotty Pippen Jr. finished with 15 points each as Memphis dropped its fourth straight and seventh in its last nine games.\n\n\r\n              The Thunder used a 15-6 run to create a slight buffer in the second quarter, then outscored Memphis 30-23 in the third.\n\n\r\n              Takeaways\r\n              Thunder: Oklahoma City's winning streak is indicative of how well the Thunder are playing. They have won 14 of 16 and maintain a solid hold on the top seed in the Western Conference.\n\n\r\n              Grizzlies: Memphis has struggled to close games recently, losing the last three in the final seconds. The previous six games were decided by an average of 2.5 points.\n\n\r\n              Key moment\r\n              The Thunder put together a 14-2 run midway through the third quarter to turn a 3-point lead into a 15-point advantage. Gilgeous-Alexander scored 15 in the period.\n\n\r\n              Key stat\r\n              The Thunder force almost 18 turnovers a game, best in the NBA. Memphis commits 16.4, among the worst in the league. That was a recipe for disaster as Memphis committed 15 turnovers, leading to 17 Thunder points.\n\n\r\n              Up next\r\n              Oklahoma City hosts Portland on Friday night in the first of a three-game homestand. Memphis travels to Dallas, also on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997599.104807
}