{
  "game_id": "0021800784",
  "espn_id": "401071457",
  "date": "Feb 02, 2019",
  "matchup": "PHX vs. ATL",
  "headline": "Collins, Young lift Suns past Hawks, 118-112",
  "body": "PHOENIX --  The Atlanta Hawks were in a touchy situation in the final minutes against the ever-struggling Phoenix Suns.\n\nThen their two best young players pulled them out of danger.\n\nJohn Collins matched his career high with 35 points and fell one shy of his career best with 16 rebounds, and the Hawks handed the Suns their 10th straight loss, 118-112 on Saturday night.\n\nTrae Young scored 17 of his 27 points in the fourth quarter, when the Hawks pulled away.\n\n\"I don't think I helped my team in the first three quarters,\" Young said. \"I just felt like I needed to step up. Everyone on the team played well except for me so I decided to do a little bit more for my team in the fourth quarter.\"\n\nDevin Booker scored 32, Josh Jackson 25 and Mikal Bridges 20 for Phoenix. Deandre Ayton, back after missing six games with a sprained left ankle, had 13 points and 11 rebounds.\n\nBooker said Collins and Young \"carried the weight\" for the Hawks, \"especially down the stretch. You know, that's `winning time.' I remember when I was at Kentucky, you know, we were down a lot late some games and we understand. We call it `winning time.\"\n\nAtlanta won despite committing 25 turnovers, resulting in 33 Phoenix points, compared with 10 turnovers by the Suns for 13 Atlanta points.\n\nThere were 11 ties and 10 lead changes in a tight first half with Atlanta leading 58-57 at the break. The Hawks' biggest lead in the first two quarters was 10, the Suns' five.\n\nA 12-2 run put the Hawks up 42-32 with 9:08 left in the half. But Phoenix responded with a 13-2 surge that put the Suns up 45-44 on Booker's three-point play with 5:52 left in the half.\n\nKevin Huerter sank a pair of 3s to help boost Atlanta's lead to 55-49 but the Suns outscored the Hawks 8-3 the rest of the half to make it a one-point game.\n\nPhoenix built its biggest advantage of the night, 84-76, on Booker's breakaway dunk after an Atlanta turnover with 3:08 left in the third quarter. But the Hawks finished the quarter with a 10-4 spurt to cut the Suns' lead to 88-86 entering the fourth.\n\nIt stayed tight with Phoenix taking its last lead at 103-101 on Jackson's hook shot with 3:59 left. Atlanta went on a 15-4 run to go up 116-107 on Collins' dunk with 57 seconds left and that was it for the Suns, who matched their longest losing streak of the season.\n\n\"Tough effort by our guys in the fourth,\" Atlanta coach Lloyd Pierce. \"I thought our guys didn't play great, obviously not smart all of the time with 25 turnovers, but I thought we were tough.\"\n\nCOMFORTABLE LOSS\n\nBooker said afterward the Suns have become too comfortable with losing after doing it for so many years.\n\n\"It's been a common theme here for the past couple of years. We need to break it,\" he said. \"The city deserves more. Everybody supporting us deserves more.\"\n\nBAD BOARDS\n\nPhoenix was outrebounded 53-37 and gave up several critical offensive boards down the stretch. Collins had 10 of Atlanta's 16 offensive rebounds.\n\n\"We say we rebound the ball, we win the game,\" Suns coach Igor Kokoskov said. \"We didn't rebound the ball, we lost the game. ... Not enough discipline, not enough discipline to contain the ball and execute our plan, and to rebound the ball.\"\n\nTIP-INS\n\nHawks: Young was 3-for-11 shooting through the first three quarters, 6 for 10 in the fourth. ...  Home team had won the last seven games in the series until Saturday night. ... Atlanta was without Miles Plumlee again (left knee pain). ... Hawks' season high in turnovers is 27 at Toronto on Jan. 8. ... Atlanta is 3-3 with one to go on a seven-game trip.\n\nSuns: Booker had his 13th 30-point game of the season. ... Suns were without T.J. Warren (right ankle soreness) for the fifth straight game and De'Anthony Melton (right ankle sprain) for the fourth. ... Phoenix was 0-6 without Ayton. ... Jamal Crawford was scoreless in this one but has more points (19,192) than any player not selected for an All-Star Game, other than Eddie Johnson (19,202), now a Suns TV analyst.\n\nUP NEXT\n\nHawks: At Washington on Monday night.\n\nSuns: Host Houston on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995068.7323399
}