{
  "game_id": "0022001054",
  "espn_id": "401307867",
  "date": "May 14, 2021",
  "matchup": "DET vs. DEN",
  "headline": "Howard, Jokic lead Nuggets past Pistons 104-91",
  "body": "DETROIT -- — Markus Howard scored a career-high 20 points, Nikola Jokic had a triple-double and the Denver Nuggets moved closer to a higher playoff seed with a 104-91 victory over the Detroit Pistons on Friday night.\n\n\r\n                    Jokic had 20 points, 15 rebounds and 11 assists for Denver (47-24). The Nuggets improved to 3-0 on a four-game road trip that finishes the regular season.\n\n\r\n                    “We were going to control Nikola’s minutes — we wanted to get some quality minutes, but not push him into the 30s — and he ended up with a triple-double,” Nuggets coach Michael Malone said. “We’ll talk tomorrow about what he’ll do on Sunday in Portland.” \n\n\r\n                    Howard was making his first career start and set a scoring high for the third time in four games. He had 13 points against the Brooklyn Nets on Saturday and 15 against the Minnesota Timberwolves on Thursday.\n\n\r\n                    “It has been awesome to get this chance to play and be able to help the team win games,” he said. “It means even more to do it at this point in the season.”\n\n\r\n                    The Pistons (20-51) lost for the 11th time in 13 games. Hamadou Diallo led the Pistons with 18 points, Tyler Cook scored 17 and Deividas Sirvydis added a career-high 16. The Pistons only dressed eight players, with the oldest being 25-year-old Jahlil Okafor, and shot 16.2% (6-37) on 3-pointers.\n\n\r\n                    “We had good looks, and there have been a lot of nights this season where we have knocked those shots down,” Pistons coach Dwane Casey said. “I think a lot of our guys are dealing with fatigue — we're asking them to play a lot of minutes — but you can't win like that.”\n\n\r\n                    The first half turned into an unexpected scoring duel between Sirvydis and Howard. The rookies each had a career-high 16 points in the half, with Jokic adding 13 points, nine rebounds and nine assists as Denver took a 57-53 lead.\n\n\r\n                    Jokic finished off the triple-double early in the third quarter, and he and Howard both finished the period with 20 points as the Nuggets pulled out to an 87-74 lead.\n\n\r\n                    “I thought we were undisciplined in the first half and weren't playing with much purpose,” Malone said. “That got better in the second half, especially on defense.”\n\n\r\n                    With Sirvydis sidelined with a bruised calf, Denver's reserves didn't have any trouble finishing off the game, leading by as many as 19. \n\n\r\n                    “(Sirvydis) really got us going in the first half, and our goal was to keep getting him the ball in the second half,” Cook said. “Losing him put a wrench into our plans.”\n\n\r\n                    TIP INS\n\n\r\n                    Nuggets: Vlatko Cancar also made his first NBA start, finishing with 11 points in 32 minutes. He and Howard (34) were the only Nuggets to play more than 26 minutes.\n\n\r\n                    Pistons: Sirvydis didn't score in the second half, and his injury left the Pistons with seven healthy players for the fourth quarter. Sirvydis went 4 of 7 on 3-pointers, while the rest of the team went 2-30.\n\n\r\n                    HOWARD GOES OFF\n\n\r\n                    Before the last week, Howard hadn't scored more than six points in a game.\n\n\r\n                    “I'm honestly surprised he hadn't had a game like this when he got to play with us up 20 or down 20,” Malone said. “We know he's capable of making shots. That's how he led the nation in scoring last year at Marquette.”\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Visit the Portland Trail Blazers on Sunday to finish the regular season.\n\n\r\n                    Pistons: Host the Miami Heat on Sunday to finish the season.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997895.992317
}