{
  "game_id": "0022400541",
  "espn_id": "401705107",
  "date": "Jan 12, 2025",
  "matchup": "CHI vs. SAC",
  "headline": "Sabonis stars as DeRozan and the streaking Kings beat the Bulls 124-119",
  "body": "CHICAGO -- — Domantas Sabonis had 22 points, 15 rebounds and eight assists, and the Sacramento Kings beat the Chicago Bulls 124-119 on Sunday to extend their season-high win streak to seven games.\n\n\r\n              De’Aaron Fox scored 26 points and grabbed nine rebounds for Sacramento after missing three games because of a bruised right glute. Malik Monk had 18 points, nine assists and eight rebounds. \n\n\r\n              DeMar DeRozan got a warm reception in his return to Chicago and finished with 21 points. The six-time All-Star spent three seasons with the Bulls before leaving for Sacramento in a three-team trade in July.\n\n\r\n              Sabonis had another big outing after he had 23 points and a season-high 28 rebounds against Boston on Friday. He helped the Kings improved to 7-1 under interim coach Doug Christie, who took over when Mike Brown was fired on Dec. 27.\n\n\r\n              Zach LaVine led Chicago with 36 points. Making his first start since Jan. 14, 2022, Lonzo Ball set season highs with 15 points and five 3s. \n\n\r\n              Takeaways\r\n              Kings: The Kings made enough plays down the stretch to come away with another win.\n\n\r\n              Bulls: LaVine continues to roll along with six straight 30-point games.\n\n\r\n              Key moment\r\n              LaVine made two free throws and a turnaround jumper to cut Sacramento's lead to one with 2:28 remaining. Fox bumped the lead back to three when he made two foul shots with 1:29 left.\n\n\r\n              Vucevic blocked a drive by Monk with 22 seconds remaining. The Bulls then got called for a five-second violation following a timeout, and Sabonis hit two free throws to make it 124-119 with 14 seconds left.\n\n\r\n              Key stat\r\n              Fox went 4 for 8 from long range.\n\n\r\n              Up next\r\n              Both teams are back at it on Tuesday, with the Kings visiting Giannis Antetokounmpo and the Milwaukee Bucks and the Bulls hosting New Orleans. ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997073.790283
}