{
  "game_id": "0021601048",
  "espn_id": "400900443",
  "date": "Mar 20, 2017",
  "matchup": "HOU vs. DEN",
  "headline": "Harden hits layup with 2.4 seconds left to lift Rockets",
  "body": "HOUSTON --  James Harden isn't necessarily known for his speed. That said, he felt extremely fast on his coast-to-coast drive in the fading seconds Monday night.\n\n\"I was running so fast,\" Harden said. \"I felt like I was Usain Bolt.\"\n\nHarden drove the length of the floor for a layup with 2.4 seconds left to lift the Houston Rockets over the Denver Nuggets 125-124.\n\nHarden had 39 points, 11 assists and was three rebounds shy of his 20th triple-double of the season. Houston outlasted Denver in a duel between the second- and third-highest scoring teams in the NBA.\n\n\"The second half just became a shootout at the O.K. Corral -- who's going to score more points?\" Nuggets coach Mike Malone said. \"I hate those kind of games because when you're playing against the third seed in the Western Conference on their home floor and you're turning the ball over, you're going to have a hard time keeping pace with them. But we did that and gave ourselves a chance.\"\n\nHarden likely saved the game for Houston, too, when he batted down an inbounds pass to Mason Plumlee near the basket following his layup.\n\n\"We were trying to get the lob, and I thought it was a good play call,\" Plumlee said. \"We just didn't convert it.\"\n\nWill Barton gave Denver a one-point lead on a three-point play with less than a minute left. On the following possession, Harden missed a layup, but he got it back on the other end of the floor when he rebounded Jameer Nelson's air-ball.\n\nHarden took the ball down the court and scored on a finger-roll layup.\n\nIn a physical matchup between two teams that lean heavily on their ability to get to the free-throw line, neither the Rockets nor Nuggets appeared happy with the officiating in the game.\n\nGary Harris scored a career-high 28 points for Denver by shooting 10 for 16 from the floor and making three 3s. Nikola Jokic also gave Houston problems with his size on both ends of the floor. Jokic had 22 points, 13 rebounds and eight assists.\n\nDenver led 65-62 at the half as it outrebounded the Rockets 30-13 in the first half and Houston made just 7 of 20 3-pointers. Houston's long-range shots finally began to fall late in the third quarter, and a 3-pointer from Patrick Beverley early in the fourth gave Houston a six-point lead that energized the Toyota Center crowd.\n\nThe Rockets finished the game 17 for 38 from 3 (44.7 percent).\n\nEric Gordon scored 18 points off the bench for Houston, and Beverley, Trevor Ariza, Ryan Anderson and Clint Capela all also scored in double figures for the Rockets.\n\nThe Nuggets are fighting for a playoff spot in the West and entered holding the eighth seed, but they're also battling injuries. Danilo Gallinari (knee) and Wilson Chandler (groin) both participated in shootaround but did not play. Nuggets coach Mike Malone is hopeful they can be ready to play when the team faces the Cavaliers in Denver on Wednesday night.\n\nForward Darrell Arthur (left knee soreness) did not travel with the team to Houston, and Malone did not have a timetable for his return.\n\nTIP-INS\n\nNuggets: Denver outrebounded Houston 48-35 in the game but managed only 14 second-chance points to Houston's 10. ... Barton had 24 points, eight assists and seven rebounds off the bench for Denver. ... Denver made 24 of 26 free throws (92.3 percent). ... Houston snapped Denver's three-game road winning streak, a stretch that dated to Feb. 23\n\nRockets: Houston scored 27 points off Denver's 21 turnovers while only turning the ball over 12 times and allowing 14 points on the other end. ... Gordon tied a career high with his 35th block of the season, set during his rookie year in 2008-09.\n\nUP NEXT\n\nNuggets: Host Cleveland on Wednesday night.\n\nRockets: Host New Orleans on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995740.88031
}