{
  "game_id": "0021900818",
  "espn_id": "401161460",
  "date": "Feb 13, 2020",
  "matchup": "LAC @ BOS",
  "headline": "Tatum scores 39, Celtics hold off Clippers 141-133 in 2OT",
  "body": "BOSTON --  Jayson Tatum didn't want to smile. But sometimes the moment calls for it.\n\nThe Celtics were trailing 124-123 in the final minute of overtime in their back-and-forth slugfest with the Clippers and Tatum found himself defended by Landry Shamet and Montrezl Harrell. Tatum hesitated, sidestepped Shamet, then spun around Harrell for a layup. As the crowd cheered around him, Tatum led out a loud yell, flexing his arms.\n\nThe play didn't win the game and gave Tatum just two of the 39 points he scored in Boston's thrilling 141-133 double-overtime win on Thursday night. But it's the latest sign that the first-time All-Star is getting more comfortable as a go-to player.\n\n“I did get a little excited,” Tatum said. “I try to be as calm as I can and try to keep a poker face and move on to the next play. But basketball is a game of emotions and the crowd was into it.\"\n\nMarcus Smart added 31 points and Gordon Hayward finished with 21 points and 13 rebounds. Kemba Walker had 19 points and nine rebounds. Tatum and Smart combined for 16 of Boston's 27 points in the overtime periods.\n\nThe Celtics have won seven straight at home and eight of their last nine overall.\n\nThe Clippers played most of the game without Paul George, who left in the second quarter with a left hamstring strain. Lou Williams led Los Angeles with 35 points. Kawhi Leonard had 28 points and 11 rebounds, and Harrell finished with 24 points and 13 rebounds.\n\nGeorge played 15 minutes, scoring four points on 2-of-7 shooting before heading to the locker room.\n\nThe first meeting between the teams on Nov. 20 was also decided in overtime. The Clippers held on for a 107-104 win.\n\nThe Celtics took a 134-130 lead in the second OT on a driving layup by Smart and another by Tatum.\n\n\"He’s more assertive,\" Leonard said of Tatum. “They are trusting him and he is trusting himself.”\n\nHarrell got a dunk on the Clippers' next trip up the floor. But Hayward responded with a 3 to increase Boston's lead to 137-132.\n\nTatum was called for an offensive foul, but Hayward blocked a runner by Williams off his body to force the turnover with 55 seconds left.\n\nHayward hit four free throws in the final minute to help close it out.\n\nTatum said he left the court feeling relief.\n\n“I'm just happy we won,\" he said. “That would have been tough playing that hard as a team and not coming out with a victory.”\n\nThe All-Star break comes at a perfect time for both teams as they try to get healthy.\n\nClippers guard Patrick Beverley missed his fourth straight game with a sore right groin. The Celtics played without Jaylen Brown, who has a left calf contusion.\n\nSmart started in place of Brown and scored the Celtics' first 10 points, digging them out of an early 7-0 deficit. Smart and Tatum combined for 24 of Boston's 30 first-quarter points. It helped offset a 15-point opening period by Leonard.\n\nBoston limited Leonard to two points in the second quarter but had no answers on the inside for Harrell, who had 16 points in the first half on 5-of-5 shooting from the field.\n\nClippers coach Doc Rivers said he likes his team's position heading into the break.\n\n“We're good,” Rivers said. “We've had a first half of the season where basically we've had more starting lineups than anybody in the league. Our record's pretty solid. We gotta get healthy. That's the key for us. We gotta get healthy.”\n\nTIP-INS\n\nClippers: Had a 65-19 advantage in bench scoring.\n\nCeltics: Tatum and Smart had all 13 of Boston's points in the first overtime.\n\nBACK AND FORTH\n\nA 3-pointer by Marcus Morris gave the Clippers a 122-118 lead in the first extra period. But the Celtics responded and took a 125-124 lead when Tatum split a pair of defenders for a layup with 53.8 seconds left.\n\nLeonard missed a short jumper and Tatum scored again off feed from Walker with 24.8 seconds remaining.\n\nLandry Shamet tied it again with a 3-pointer, giving the Celtics the ball back with 21 seconds left. Tatum got off a 27-footer but came up empty.\n\nCELTICS TO RETIRE GARNETT'S JERSEY\n\nDuring the game's first timeout, the Celtics surprised fans with a video presentation to announce Kevin Garnett’s No. 5 will be retired during the 2020-21 season. It will hang in the open space next to the No. 34 of teammate Paul Pierce, who alongside Garnett led Boston to its most recent title in 2008.\n\nPierce's jersey was retired by the Celtics in 2018. Garnett, in his first year in eligibility for the Naismith Basketball Hall of Fame, is expected to be on the list of finalists when it it is unveiled during NBA All-Star Weekend in Chicago.\n\nUP NEXT\n\nClippers: Host Sacramento on Feb. 22.\n\nCeltics: Begin a four-game road trip Feb. 21 against Minnesota.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Kyle Hightower on Twitter at https://twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764996491.552522
}