{
  "game_id": "0021900709",
  "espn_id": "401161351",
  "date": "Jan 29, 2020",
  "matchup": "DET @ BKN",
  "headline": "Dinwiddie, emotional Irving lead Nets past Pistons, 125-115",
  "body": "NEW YORK --  It's only been a few days, not nearly enough for the players who were close with Kobe Bryant to get over his death.\n\nUnlike Sunday, Kyrie Irving was at least able to take his grief onto the basketball court.\n\n\"I couldn't even come up with wanting to play that game,\" Irving said. \"It was so heartbreaking, and it still is. I'm doing my best.\"\n\nHe scored 20 points in his return to the lineup Wednesday night, Spencer Dinwiddie scored 28 points in his first game with his new jersey number, and the Brooklyn Nets beat the Detroit Pistons 125-115.\n\nIrving didn't play Sunday at New York after learning of Bryant's death, and Dinwiddie, a Los Angeles native, was in tears after that game talking about what the Lakers star meant to him.\n\n\"I think I had still the had the emotion but I'm not going to put all that on this situation,\" Dinwiddie said. \"Our goal of our team is just to come together and try to progress throughout the season.\"\n\nDinwiddie changed his number from No. 8, one of the numbers Bryant wore, to No. 26 on Tuesday. He said he picked the number by adding his birthday, April 6, with his son Elijah's April 20.\n\nIrving was friends with Bryant and appeared to be in tears during a pregame tribute to the superstar, when Bryant's numbers 8 and 24 were lit up on the court and on the overhead video screen that showed the longtime Lakers star's highlights.\n\nThe Nets left two seats open with flowers on them at Barclays Center in honor of Bryant and his 13-year-old daughter Gianna, who were among the nine people killed in a helicopter crash Sunday. The pair sat in those seats near Brooklyn's bench for a Dec. 21 game against Atlanta. Gianna was a fan of the Hawks' Trae Young.\n\nReggie Jackson scored 23 points during one the best games of his injury-plagued season and Derrick Rose had 22 for the Pistons, who have lost four straight.\n\nPistons coach Dwane Casey was upset with the Pistons' poor starts to both halves and was particularly disappointed in rookie Sekou Doumbouya, who was scoreless in eight minutes.\n\n\"We've got to figure it out,\" Casey said. \"We've got to figure out five or six or seven men that's going to come in and compete at a high level, no matter what your contract says. We've got to find them.\"\n\nDinwiddie had two 3-pointers and a couple other baskets during a 12-4 spurt early in the fourth quarter, turning a four-point lead into a 111-97 Brooklyn advantage.\n\nTaurean Prince scored 22 points for the Nets, who won for just the second time in eight games, both against the Pistons. They won at Detroit in overtime Saturday behind 45 points from Irving.\n\nThe Nets raced to a 16-4 lead in less than five minutes, but Detroit cut it to 32-30 by the end of the first quarter. Jackson scored 14 points in the second and Dinwiddie had 12 as Brooklyn took a 70-68 lead to the half, tying its season high for points.\n\nTIP-INS\n\nPistons: Rose, who missed Detroit's last game with knee soreness, had his 13th straight game with 20 or more points. ... Tony Snell returned after a three-game absence with an illness to score six points.\n\nNets: Starting guard Garrett Temple had to leave in the first half to get stitches above his left eye. ... The Nets hosted Chinese cultural night, with their starting lineup announced in Chinese. Brooklyn players wore red shooting shirts before the game with the name Bryant on the back.\n\nNEW NUMBERS\n\nThe game featured two of the players who have changed uniform numbers that Bryant wore. Besides Dinwiddie, Detroit's Markieff Morris swapped No. 8 for No. 88. Neither team has a No. 24.\n\nSEKOU'S STRUGGLES\n\nDoumbouya was 0 for 2 and the Pistons were outscored by 20 points in his brief time on the floor.\n\n\"Our rookie, seven minutes, minus-20,\" Casey said. \"I don't know how bad you have to play to get that many, so we got to get that fire lit under him a bit more because he's lost that zest, that fire that he had.\"\n\nUP NEXT\n\nPistons: Host Toronto on Friday.\n\nNets: Host Chicago on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996268.372329
}