{
  "game_id": "0021400583",
  "espn_id": "400578875",
  "date": "Jan 14, 2015",
  "matchup": "POR vs. LAC",
  "headline": "Jamal Crawford helps visiting Clippers douse Trail Blazers",
  "body": "PORTLAND, Ore. -- Trail Blazers coach Terry Stotts cautioned that it's January, a little early for NBA regular-season games to be played with playoff intensity.\nNot too early for the Los Angeles Clippers, who admitted Wednesday night's game had a postseason feel, as they rallied during the final six minutes to beat Portland 100-94.\nJamal Crawford scored 25 points and the go-ahead basket on a 3-pointer with 3:55 remaining as the Clippers came back from a six-point fourth-quarter deficit.\n\nChris Paul scored 23 and DeAndre Jordan had 17 points and 18 rebounds for Los Angeles (26-13).\nLaMarcus Aldridge had 37 points and 12 rebounds for Portland (30-9). Aldridge, who missed his season high by two points, went 14 of 28 from the floor.\nBoth teams went to their benches sparingly. Eight players played for each and neither team led by more than nine points. There were periods, particularly the end, when things turned physical and incredibly intense.\n\"It's one of those rare regular-season, playoff-type of games,\" Los Angeles coach Doc Rivers said. \"They're a lot of fun to get into, but you don't get a lot of those. We didn't go into it that way, but it turned into that.\"\nThe Clippers ended Portland's four-game winning streak after falling behind 85-79 with 6:41 remaining. They went on a 10-3 run, taking an 89-88 lead on two Paul free throws, then grabbed the lead for good on Crawford's fourth 3-pointer of the game.\nEach team had a key contributor from its bench.\nFor Portland, it was center Meyers Leonard, who had 10 points and 11 rebounds. For the Clippers, it was Crawford, who led the team in scoring after hitting 10 of 22 shots.\n\"Our bench had 25 points tonight. It was one guy,\" Rivers said.\n\nLos Angeles won largely due to its defense. The Clippers held Portland, one of the NBA's most prolific 3-point shooting teams, to 6 of 26 from the arc.\nLos Angeles also kept Blazers' point guard Damian Lillard under control, holding him to 15 points on 5 of 16 shooting.\n\"It's good for us. We've won a lot of games with offense. Tonight we won by getting stops,\" Paul said.\nCrawford said playing Portland, which came in tied with Golden State for most wins in the NBA, provided the Clippers with some motivation.\n\"Them being one of the better teams in the league, us being one of the best teams in the league, and obviously the whole country was watching, so it was a really good game,\" Crawford said. \"It's one of our better wins.\"\nFor Portland, Chris Kaman had 15 points and 11 rebounds.\nThe Blazers trailed the entire first half, despite 22 points from Aldridge. Portland pulled to within 50-49 at halftime on two late free throws by Nicolas Batum.\nLos Angeles led by as many as seven during the third quarter, but Portland eventually wiped out the deficit, as Leonard hit two free throws with 1:26 remaining to tie the score at 72.\nLillard triggered a Portland surge early in the fourth, as his 3-pointer gave the Blazers an 85-79 lead. But the Clippers controlled the final six minutes, outscoring Portland 21-9.\n\"Usually in the fourth quarter when we have the lead with five minutes to go, we're pretty good in those situations. Give the Clippers credit; they made plays. They got stops when they needed to,\" Stotts said.\nTIP-INS\nClippers: Los Angeles signed G Dahntay Jones to a 10-day contract Wednesday. Jones, a 10-year NBA veteran, has been playing for Fort Wayne in the NBA Development League, averaging 14.4 points and 3.4 rebounds a game. ... Portland leads the NBA in 3-point field goal defense at .287, but the Clippers had some success, going 8 of 23.\nTrail Blazers: After playing eight of its past nine games at home, Portland plays three of its next four on the road, at San Antonio, Memphis and Phoenix. ... The Blazers play seven road games during the final 15 days of January.\nPAUL SAVES BEST FOR LAST\nPaul didn't shoot a free throw until the fourth quarter, when he went 10 of 10, including six during the final 1:16. Paul is seventh in the NBA in free-throw shooting at .899.\nUP NEXT\nClippers: Friday at home against Cleveland\nTrail Blazers: Friday at San Antonio",
  "source": "espn_api",
  "crawled_at": 1764992079.8179169
}