{
  "game_id": "0021600886",
  "espn_id": "400900292",
  "date": "Feb 27, 2017",
  "matchup": "HOU vs. IND",
  "headline": "Teague has 25 to lift Pacers over Rockets, 117-108",
  "body": "HOUSTON --  When the Indiana Pacers got into a big hole early Monday night, no one panicked.\n\nJeff Teague scored 25 points to help the Pacers overcome a huge first-half deficit before withstanding a late rally to beat the Houston Rockets 117-108.\n\n\"We did a great job of collecting our thoughts, we went to the bench, talked and we won every quarter after the first quarter,\" Paul George said.\n\nC.J. Miles made a 3-pointer with 40.8 seconds left to make it 113-108, and Teague added two free throws after that to put the game out of reach. It was just the second win in nine games for the Pacers and only their 10th road win of the season.\n\n\"I think it was the best fourth quarter we've played where we were just solid defensively getting stops and offensively executing,\" Pacers coach Nate McMillan said.\n\nThe Pacers trailed by 17 early before taking a halftime lead, then were up by 14 with about four minutes left. The Rockets used a 12-2 run to get within two with less than a minute remaining. Lou Williams had eight points, powered by a pair of 3-pointers in that span, including an off-balance one on which he was fouled to cap the run. He missed the ensuing free throw, and Miles followed with his 3.\n\n\"I told them: `They don't give championships up there for guys who just show up, you've got to go get it,\" Rockets coach Mike D'Antoni said. \"A champion has a heart, a big heart ... and we haven't shown that lately.\"\n\nWilliams led the Rockets with 28 points, James Harden added 25 points with 12 assists and Nene scored 15 points.\n\nA 3-pointer by Teague pushed Indiana ahead 103-92 midway through the fourth. Williams made two free throws after that, but the Pacers scored the next five points, with another 3 from Teague to make it 108-94 with about four minutes left.\n\n\"It's the first game I feel like we really just stuck together,\" Teague said. \"Nobody really got down. We were just cheering each other on and competing.\"\n\nThe Pacers trailed by one late in the third quarter before scoring nine straight points, capped by Rodney Stuckey's 3 to take an 86-78 lead. Harden made a layup after that, but Stuckey made two free throws with a second left in the quarter to get Indiana up 88-80.\n\nThe Rockets were up by 17 after a 3-pointer by Williams with about nine minutes left in the second quarter before the Pacers took over. They outscored Houston 23-8 over the next six minutes.\n\nTIP-INS\n\nPacers: G Aaron Brooks, who spent six seasons with the Rockets, was honored between the first and second quarters as part of Houston's season-long celebration of its 50th anniversary. ... George had 15 points. ... Stuckey added 17 points.\n\nRockets: It was Houston's 47th straight game with at least 100 points, tying a franchise record set in 1969-70. ... The Rockets signed G Isaiah Taylor from D-League Rio Grande Valley. ... The Rockets made 10 3-pointers to give them at least 10 in 15 straight games.\n\nTHEY SAID IT\n\n\"We let up that second quarter,\" Harden said. \"It just wasn't good. We didn't do what we needed to do.\"\n\nWILLIAMS FITTING IN\n\nWilliams has been great since being traded from the Lakers on Thursday. He scored 27 and 17 points in his first two games, and Monday was the NBA-leading 27th time this season in which Williams has scored 20 or more points off the bench.\n\nUP NEXT\n\nPacers: Continue a five-game road trip at San Antonio on Wednesday night.\n\nRockets: Visit the Los Angeles Clippers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995751.3142452
}