{
  "game_id": "0022300637",
  "espn_id": "401585265",
  "date": "Jan 26, 2024",
  "matchup": "TOR vs. LAC",
  "headline": "Harden posts 75th career triple-double as Clippers win 4th straight, beat Raptors 127-107",
  "body": "TORONTO -- — James Harden had 22 points, 13 assists and 10 rebounds for his 75th career triple-double, Paul George added 21 points and the Los Angeles Clippers thumped the Toronto Raptors 127-107 on Friday night for their fourth consecutive win.\n\n\r\n              Harden’s triple-double was his first with the Clippers since joining them in a Nov. 1 trade with Philadelphia. He has the eighth-most triple-doubles in NBA history.\n\n\r\n              “James has been great,” Clippers coach Tyronn Lue said. “He keeps everybody happy. It takes a lot of grind off of PG and Kawhi, acquiring James. It’s huge for us.”\n\n\r\n              Harden has had at least 20 points and 10 assists in each of his past three games.\n\n\r\n              Russell Westbrook scored 20 points and Kawhi Leonard had 16 against his former team for Los Angeles, which has won 12 of 14.\n\n\r\n              “We still want to get better,” Leonard said. “We’re not where we want to be.”\n\n\r\n              Leonard had his second career triple-double in Tuesday’s win over the Lakers. He had seven rebounds and three assists on Friday.\n\n\r\n              Leonard has gone 8-0 against Toronto since leaving the Raptors following their 2019 NBA Championship. He was welcomed with a warm ovation when the starters were introduced.\n\n\r\n              “Everybody knows what I did here and how special that year was,” Leonard said. “They’re very thankful for it. Every time I come I get good praise.”\n\n\r\n              Leonard didn’t play in the fourth quarter, with Lue giving the oft-injured star some rest ahead of Saturday’s clash with Eastern Conference-leading Boston.\n\n\r\n              “He’s good,” Lue said of Leonard. “We’ve got a back-to-back (Saturday) so the more I can lessen him, the better it is for us.”\n\n\r\n              Former Raptors guard Norman Powell scored 17 points as the Clippers opened a season-long seven-game trip by evening their road record at 10-10.\n\n\r\n              Mason Plumlee added 12 points and 12 rebounds as the Clippers won their fourth straight north of the border.\n\n\r\n              “They are big, and they are forceful,” Toronto coach Darko Rajakovic said of the Clippers. ”They were able to attack the paint and get there.”\n\n\r\n              The Clippers finished with a season-best 70 points in the paint.\n\n\r\n              Scottie Barnes scored 14 of his 23 points in the fourth quarter for the Raptors, who lost their fourth straight and ninth of 11.\n\n\r\n              RJ Barrett added 22 points for the Raptors. Gary Trent Jr. and Dennis Schroder each scored 13 while Thad Young had 12.\n\n\r\n              The Clippers led 66-52 at the half and were up 95-81 through three quarters.\n\n\r\n              Bruce Brown made his first start for Toronto, taking the place of injured guard Immanuel Quickley (sore right quadriceps). Brown finished with nine points and nine rebounds.\n\n\r\n              Raptors center Jakob Poeltl missed his ninth straight game because of a sprained left ankle. Toronto’s frontcourt options were further thinned when forward Jontay Porter left after four minutes of action because of irritation in his eye. Porter left Monday’s loss to Memphis after being poked in the eye.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit Boston on Saturday night.\n\n\r\n              Raptors: Begin a six-game trip at Atlanta on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995415.585313
}