{
  "game_id": "0021600655",
  "espn_id": "400900076",
  "date": "Jan 21, 2017",
  "matchup": "MIL @ MIA",
  "headline": "Dion Waiters scores 33 to help Heat beat Bucks 109-97",
  "body": "MIAMI --  When Miami Heat guard Goran Dragic barely beat the shot clock with a 28-footer to seal Saturday's win, he retreated upcourt waving his arms, eager to coax more noise from the modest crowd.\n\nRiding a three-game winning streak for the first time since last March, the Heat and their fans finally have something to cheer about.\n\nDion Waiters tied a career high with 33 points and Dragic added 25 to help the last-place Heat to a 109-97 victory over the Milwaukee Bucks, who are headed the opposite direction.\n\nBucks coach Jason Kidd shook up his lineup, but they lost their fifth game in a row and second in as many nights. Following a defeat Friday at Orlando, the Bucks held a long players-only meeting that became heated at times.\n\n\"We have a lot of games to be played,\" Kidd said after the latest loss. \"There's no reason to panic.\"\n\nWaiters went 12 for 19, including 5 for 8 from 3-point range. Backcourt mate Dragic went 8 for 13 and had six assists.\n\n\"Those guys were making so many shots I almost shot a 3,\" center Hassan Whiteside said. \"They take our team to another whole level when they play like that.\"\n\nWhiteside added 16 points and 15 rebounds while missing one shot. The Heat made 53 percent, just shy of their season high.\n\n\"Guys are playing better,\" Whiteside said. \"I don't know what really got into guys, but I like it. We're hitting shots we were missing earlier in the season.\"\n\nMiami improved to 14-30 thanks to its modest winning streak.\n\n\"It feels better than 0-3,\" coach Eric Spoelstra said.\n\nKidd said the Heat's record affected the Bucks' performance.\n\n\"One of the things that we struggle with is looking at the team's record and not coming out with that same intent if we're playing Cleveland, if we're playing Golden State,\" he said. \"That's something we have to get better at.\"\n\nFollowing Friday's players-only meeting by the Bucks, forward Jabari Parker said he wasn't well received when he expressed his point of view. Parker was held out of the starting lineup Saturday for the first time this season for violating a team rule. Kidd declined to discuss the violation.\n\nParker had 16 points and seven rebounds in 32 minutes off the bench.\n\n\"It's just a challenge, and I just try to be as positive as possible,\" he said.\n\n\"I thought he did a great job,\" Kidd said.\n\nAll-Star starter Giannis Antetokounmpo had 24 points and 10 rebounds for Milwaukee.\n\nThe Bucks led early, but Rodney McGruder and Dragic sank 3-pointers on consecutive possessions to put the Heat ahead 68-56 midway through the third quarter.\n\nWaiters barely beat the 24-second clock with a 3-pointer that made it 103-91 with 2 1/2 minutes left. Dragic's buzzer-beater with 1 1/2 minutes to go put Miami ahead 106-94 lead.\n\nTIP-INS\n\nBucks: While Parker sat out the first quarter, Bucks rookie Thon Maker made his first career start, and guard Matthew Dellavedova started for the first time in 13 games. Maker had six points in 18 minutes, and Dellavedova had 15 points and seven assists.\n\nHeat: Okaro White, who made his NBA debut Thursday after signing a 10-day deal, played 19 minutes but still hasn't scored.\n\n\"His box score doesn't really show the impact he had defensively,\" Spoelstra said. \"He finds ways to fit in.\"\n\nGOING INSIDE\n\nWaiters hurt the Bucks repeatedly with drives from the perimeter.\n\n\"I just try to play every game like it's my last,\" he said. \"Tonight the coaches told me to be aggressive, be me, and do what I do best -- get to the rim. I was able to do that.\"\n\nTRAINER'S ROOM\n\nGuard Tyler Johnson sat out with a sprained left shoulder he injured in the Heat's game Thursday. His status is day to day.\n\nUP NEXT\n\nBucks: Milwaukee plays at home Monday against Houston, which won 111-92 when the teams met Wednesday.\n\nHeat: Miami plays at home Monday against Golden State, which has won five in a row in the series.",
  "source": "espn_api",
  "crawled_at": 1764995180.750867
}