{
  "game_id": "0021800903",
  "espn_id": "401071576",
  "date": "Feb 25, 2019",
  "matchup": "HOU vs. ATL",
  "headline": "Harden's 30-point streak ends as Rockets beat Hawks 119-111",
  "body": "HOUSTON --  James Harden isn't exactly lamenting the end of his impressive scoring run.\n\nHarden had 28 points, snapping his 32-game streak with at least 30 while the Houston Rockets beat the Atlanta Hawks 119-111 on Monday night.\n\nHe's glad it's over, too -- especially since he had no expectation of matching Wilt Chamberlain's 65-game streak, the longest in NBA history. Harden's stretch with 30 or more points ranks second.\n\n\"Yeah I am. It was cool but I knew I wasn't going to get to No. 1,\" Harden said before walking away chuckling.\n\nHouston overcame a scoring outburst from Hawks rookie Trae Young, who set career highs with eight 3-pointers and 36 points.\n\nHarden returned after missing Saturday's win over Golden State with a neck injury and missed all 10 3-pointers he attempted.\n\n\"This was the first time I was able to move it since a few days,\" he said. \"So it kind of felt good to go out there and just move it and run around. I hadn't really done any movement or working out. I've been in bed really.\"\n\nHe got to 28 points with 23.3 seconds left and had the ball on Houston's last possession but did not attempt a shot from half court with the game in hand. When asked if the injury affected his shot he said: \"I don't care. Made shots, missed shots, we won the game.\"\n\nHarden last came up short of 30 points in a Dec. 11 win over Portland, when he had 29. During the streak, he scored 50 or more points four times, including a career-high 61 in a win at the Knicks on Jan. 23.\n\n\"Eventually it was going to have to end one of these days,\" coach Mike D'Antoni said. \"He's unbelievable. He'll start another one.\"\n\nChris Paul added 20 points, and Eric Gordon hit four 3-pointers for 16 points.\n\nThe Hawks cut the lead to five on a basket by John Collins with about 2 1/2 minutes remaining. Harden missed his 10th 3-pointer seconds after that, but Harden was fouled on a 3-pointer on the next possession and made all of the free throws to make it 115-107.\n\nAtlanta scored the first nine points of the fourth quarter, with five points including a long 3-pointer from Young, to cut the lead to one. P.J. Tucker got the Rockets going again when he made a 3-pointer to make it 98-94 with 8 1/2 minutes remaining.\n\nYoung's hot shooting continued after that when he made his seventh 3 to cut the lead to one again.\n\nHarden made four quick points later in the quarter, but Young was at it again after that, sinking his eighth 3-pointer to cut the lead to 107-102 with about five minutes left.\n\nYoung said he couldn't appreciate his big night since the Hawks came up short.\n\n\"For me, I've grown up with a dad who raised me that winning is the only thing that matters,\" he said. \"So for me, of course you want to play well, of course you want to do well in the game and help your team, but at the end of the day I don't feel good about it.\"\n\nVince Carter got the Hawks within one with a 3-pointer later in the third quarter before Houston scored five quick points, capped by a basket from Harden to make it 82-76 with about four minutes left in the third.\n\nAlex Len added a 3 for Atlanta after that but the Rockets padded the lead to 90-79 with an 8-0 run.\n\nThe Hawks got within seven late in the third, but Paul made a shot while being foul and completed the 3-point play to leave Houston up 95-85 entering the fourth.\n\nTIP-INS\n\nHawks: Collins had 20 points. ... Kevin Huerter had seven points in his return after missing the last two games with a sprained left ankle. ... Carter received a flagrant 1 foul in the third quarter when he knocked Austin Rivers to the court on a fast break.\n\nRockets: It was Paul's third straight 20-point game. ... Iman Shumpert returned after missing the last two games with a sore right knee. ... Kenneth Faried had 13 points and has scored at least 10 points in all 15 games as a Rocket, which is the longest streak of his career.\n\nOLD FRIENDS\n\nVince Carter took a second to chat with Hall of Famer Hakeem Olajuwon, who was sitting courtside on Monday night. The Dream and Carter were teammates in Olajuwon's final NBA season in 2001-02, when he left the Rockets after 17 seasons to play for the Raptors at 39.\n\nCarter, who is in his 20th season, is currently the oldest player in the NBA at 42.\n\nTHEY SAID IT\n\nPaul on Young's performance: \"He was hooping. It's funny because coach (D'Antoni) and everybody was like, `Man he can play.' I was like, `Yeah we knew that.\"\n\nUP NEXT\n\nHawks: Host Minnesota on Wednesday night.\n\nRockets: Visit Charlotte on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995295.4387279
}