{
  "game_id": "0021800550",
  "espn_id": "401071226",
  "date": "Jan 01, 2019",
  "matchup": "MIL vs. DET",
  "headline": "Lopez has 25, Giannis monster dunk as Bucks beat Pistons",
  "body": "MILWAUKEE --  Giannis Antetokounmpo and the Milwaukee Bucks started the new year much like the finished the last one.\n\nAntetokounmpo threw down a spectacular one-handed dunk, Brook Lopez continued to show off his long-range shooting prowess and the Bucks cruised past the Detroit Pistons 121-98 on Tuesday night. Milwaukee has won four straight and eight of nine and is an NBA-best 26-10.\n\nAntetokounmpo had just 15 points, but his slam over Jon Leuer was the highlight of the night. Antetokounmpo blew past Andre Drummond, jumped and reached his right arm over a leaping Leuer for the slam during the first quarter.\n\n\"It's fun to have nights like this,\" Antetokounmpo said. \"Everybody has energy and plays hard.\"\n\nKhris Middleton had 22 points and Eric Bledsoe had 18 for Milwaukee. Lopez had 25 points and made 7 of 12 from 3-point range, capping off the night by nailing a shot from beyond the sideline hashmark in the fourth.\n\n\"I was feeling good.\" Lopez said. \"We were moving the ball really well and I was just trying to space the floor. My guys were making great passes to me all night. They're so good at attacking the basket, drawing people and kicking out.\"\n\nBlake Griffin had 29 points and nine rebounds, and Reggie Jackson scored 19 points for Detroit, which fell to 16-19.\n\nAfter leading 92-73 after three quarters, the Bucks built a 28-point lead midway through the fourth.\n\n\"That team is a very good team,\" Pistons coach Dwane Casey said. \"But there's another competitive level we can get to. We've got some guys that are laying it on the line but not enough.\"\n\nNOT BASHFUL\n\nBucks coach Mike Budenholzer admitted he isn't always thrilled with the shot selection of Lopez, who became the first center in NBA history, and the first Bucks player ever, to make seven or more 3s in consecutive games.\n\n\"I've learned that he's going to make some of them,\" Budenholzer said. \"There are times when I'm like `What is he doing?' Then they go in and I sit back down.\"\n\nCASEY STEAMED\n\nCasey said officials refused to review a play in the waning seconds in which he claimed Langston Galloway caught an elbow to the eye from Bucks forward Thon Maker.\n\n\"I was trying to get the officials to review it,\" Casey said. \"(Referee) Karl Lane yelled at me: `Turn it in then.' I was just saying look at it.\"\n\nOPPORTUNITY KNOCKS\n\nSeldom-used rookie Khyri Thomas scored a career-high 13 points off the bench for the Pistons.\n\n\"It gives you an opportunity to further your career, whether it's being a backup or whatever position it is,\" Thomas said. \"That's what I was looking for, so I just went out there and played and had fun.\"\n\nTIP-INS\n\nPistons: C Zaza Pachulia (right lower-leg contusion) sat out and is also likely to miss Wednesday's game at Memphis, Casey said. Pachulia had an MRI on Monday. ... Stanley Johnson didn't play due to a thigh contusion. ... G Ish Smith, who has been out since Dec. 7 with an abductor muscle tear, is making progress in his rehabilitation. ... Griffin fell to the court early in the second quarter holding his knee at the same time teammate Jose Calderon writhed in pain after getting hit in the face. Later in the quarter, Griffin again fell to the floor, this time holding his face after colliding with Antetokounmpo.\n\nBucks: F Ersan Ilyasova has returned to practice but remains out of game action after having surgery to repair a broken nose. Ilyasova hasn't played since Dec. 14. ... Maker received a technical foul in the fourth quarter for arguing.\n\nUP NEXT\n\nPistons: Visit Memphis on Wednesday in the first matchup of the teams this season.\n\nBucks: Host Atlanta on Friday as Milwaukee coach Mike Budenholzer goes against his former team for the first time.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994496.059119
}