{
  "game_id": "0022200346",
  "espn_id": "401468501",
  "date": "Dec 04, 2022",
  "matchup": "BKN vs. BOS",
  "headline": "Celtics snap Nets' 4-game winning streak with 103-92 win",
  "body": "NEW YORK -- — Even when Jaylen Brown was pouring in the points early, the Boston Celtics knew they'd need to turn to their defense late. \n\n\r\n              Then they locked down the Brooklyn Nets, just like they did last spring.\n\n\r\n              “Our defense definitely won us the game tonight, no doubt about that,” Jayson Tatum said. \n\n\r\n              Brown had 34 points and 10 rebounds, Tatum added 29 points and 11 boards and the Celtics snapped the Nets' four-game winning streak with a 103-92 victory Sunday night.\n\n\r\n              Brown got Boston started with a 20-point first quarter and the Celtics forced six turnovers in the fourth quarter of the first meeting since they swept the Nets in the first round of the playoffs. \n\n\r\n              “Even though we’ve been scoring the ball at a high clip, record-breaking numbers, defensively we can’t let that rope slip,” Brown said. “So tonight was a great game.” \n\n\r\n              Kevin Durant scored 31 points for the Nets, but committed eight turnovers. Kyrie Irving added 18 points and eight rebounds but shot just 7 for 21 from the field. \n\n\r\n              “I mean, they’re a good team and when you’re making costly mistakes, especially down the stretch, it’s going to affect you,” Irving said. “It’s going to have an impact on the game, the flow.”\n\n\r\n              The Celtics played without Defensive Player of the Year Marcus Smart because of a bruised left hip but had plenty of defenders left to clamp down on the Nets and bounce back from an overtime loss to Miami on Friday that snapped their five-game winning streak.\n\n\r\n              Boston led by only two nearly midway through the fourth quarter before Al Horford made a 3-pointer for his only basket of the game, then blocked Durant's shot to lead to Brown's fast-break dunk for an 85-76 lead.\n\n\r\n              Tatum had a flurry later in the period to break it open and draw loud cheers from the many Celtics fans in a crowd that also included recently retired tennis superstar Roger Federer sitting near their bench.\n\n\r\n              Though the Celtics (19-5) have raced to the best record in the NBA, they were the only team that had more wins than the Nets' 11 since the start of November, when Brooklyn replaced Steve Nash as coach. The Nets considered suspended Celtics coach Ime Udoka before sticking with Jacque Vaughn.\n\n\r\n              But the Nets still can’t crack the Celtics’ defense, just as they couldn’t in April. \n\n\r\n              “They’re a big team, they shoot the ball well, they’ve got good length,” Durant said. “So you’ve got to match that if you want to be able to compete.” \n\n\r\n              Brooklyn made its first five shots in an 11-2 start, then missed seven in a row while Boston answered with a 14-0 run. Brown was 5 for 5 on 3-pointers in the first quarter.\n\n\r\n              It was tied at 48 with 4 minutes left in the second quarter before the Celtics closed with a 14-2 spurt to take a 62-50 advantage to the locker room.\n\n\r\n              Tatum shot 10 for 19 after going 5 for 18 and missing all seven 3-pointers Friday.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Interim coach Joe Mazzulla said C Robert Williams (left knee surgery) had another workout Sunday and is closing in on a return. ... The Celtics began a six-game road trip. It continues Monday in Toronto before moving to the West for the final four games, including their first matchup with Golden State since the NBA Finals. .... The Nets showed a video tribute after the first quarter for Blake Griffin, who spent nearly two seasons in Brooklyn. \n\n\r\n              Nets: Brooklyn had its six-game home winning streak snapped. ... Joe Harris scored 13 points. Nic Claxton had 14 rebounds but was 1 for 6 from the free throw line.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Toronto on Monday night.\n\n\r\n              Nets: Host Charlotte on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994885.016315
}