{
  "game_id": "0022200149",
  "espn_id": "401468304",
  "date": "Nov 07, 2022",
  "matchup": "MIL @ ATL",
  "headline": "Young sits, but Murray, Hawks hand Bucks 1st loss of season",
  "body": "ATLANTA -- — Dejounte Murray scored 25 points, rookie A.J. Griffin came off the bench in Trae Young's absence to add a career-high 24 and the Atlanta Hawks snapped the Milwaukee Bucks’ season-opening, nine-game winning streak with a 117-98 victory on Monday night.\n\n\r\n              Giannis Antetokounmpo returned from a one-game absence with a sore left knee to score 25 points for the Bucks, who were attempting to become the first team to begin a season 10-0 since the 2014-15 Golden State Warriors got off to a 24-0 start.\n\n\r\n              “We got more aggressive in the third and fourth quarter and were able to beat the best team in the league tonight,\" Hawks coach Nate McMillan said. “Offensively, I thought we had really good movement, made them work and were patient and we didn't settle for the quick shots like we did in the first game against them.\"\n\n\r\n              Young, Atlanta’s leader in points and assists, missed the game with right shin soreness. Griffin filled in admirably, logging 31 minutes and going 10 of 15 from the field.\n\n\r\n              “Coach told me to be ready early,\" Griffin said. “Just to have that mindset, rise to the occasion, take the challenge. You know you put in the work. Credit to the coaches and my teammates to support me. Feeling like family.\"\n\n\r\n              The Bucks committed a season-high 19 turnovers, leading to 22 Atlanta points.\n\n\r\n              Milwaukee’s winning streak was tied for the second-longest under fifth-year coach Mike Budenholzer and the longest since winning 18 in a row in 2019-20.\n\n\r\n              Atlanta took its first lead with 9:20 left in the third quarter when Murray hit a 17-footer that made it 62-60. The Hawks went up by as many as nine twice, the second time when Murray’s 17-footer made it 89-80 in the closing seconds of the third. \n\n\r\n              The Hawks outscored Milwaukee 37-22 in the third. \n\n\r\n              “They got the best of us tonight,\" Bucks forward Bobby Portis said. “They made shots and spread the basketball around. They had more energy than us tonight. It showed.\"\n\n\r\n              Brook Lopez hit a 3 midway through the first quarter for the game’s first double-digit lead. A third 3 by Grayson Allen made it 21-8, and the Hawks called timeout. Atlanta trailed by as much as 14 in the first half but went on a 21-9 run that trimmed the lead to two on Onyeka Okongwu’s baseline jumper midway through the second quarter. \n\n\r\n              Antetokounmpo followed a couple of possessions later in combining with Jrue Holiday on an alley-oop dunk, and Holiday buried a long jumper to make it 45-39. The Bucks led 58-52 at halftime.\n\n\r\n              The Hawks (7-3) are off to their best start to a season through 10 games since the 2016-17 team went 8-2. \n\n\r\n              “Basketball is a game of runs, and like I kept telling the group, ‘They made their run' and were making a bunch of 3s — it wasn't going to be like that all night,\" Murray said. “We've got to continue to fight and fight and things will go our way.\"\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Lopez has blocked at least one shot in each game this season. ... Led by three apiece from Grayson Allen and Lopez, Milwaukee hit 11 3s in the first half, but the Bucks had just two 3s after intermission. ... F Sandro Mamukelashvili, cleared from concussion protocol, played the final six minutes.\n\n\r\n              Hawks: Have won four straight at home against Milwaukee. ... Dating to last March 3, the Hawks have scored at least 100 points in 31 consecutive games, the fifth-longest such streak in franchise history. It’s the second-longest active streak in the NBA to New Orleans’ 36 straight.\n\n\r\n              FAMILY TIES\n\n\r\n              This game marked the sixth time that the Holiday brothers have played in the same game. Jrue Holiday dropped to 5-1 in those meetings. Jrue Holiday finished with 16 points for the Bucks. Justin Holiday had 14 for Atlanta. Aaron Holiday started in Young’s spot and scored four points.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: At Oklahoma City on Wednesday.\n\n\r\n              Hawks: Host Utah on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994602.670491
}