{
  "game_id": "0022200694",
  "espn_id": "401468849",
  "date": "Jan 21, 2023",
  "matchup": "ATL vs. CHA",
  "headline": "Rozier caps 19-point rally, Hornets end Hawks' 5-game streak",
  "body": "ATLANTA -- — Terry Rozier hit three throws with 1.1 seconds remaining, and the undermanned Charlotte Hornets overcame a 19-point, third-quarter deficit to end the Atlanta Hawks’ five-game winning streak with a 122-118 victory on Saturday night.\n\n\r\n              Clint Capela tipped in Trae Young’s missed runner with 5.4 seconds to go for Atlanta, but Rozier, who scored 28 of his 34 points in the second half, drew a foul from Jalen Johnson and buried the ensuing free throws to win it.\n\n\r\n              “He definitely got me,\" Rozier said. “The play was called for me to go to the basket, but I just read him. He was backed up a little bit, but he lunged forward and like high-fived me in the air.\"\n\n\r\n              The Hawks lost when Young, trying to inbound the ball from the right sideline, couldn’t find an open teammate with 7-foot Mason Plumlee making it tough to put the ball in play. His turnover ended it.\n\n\r\n              “They did a good job of blitzing us,\" Young said. “We’ll be better next time.\"\n\n\r\n              The Hornets, playing without injured leading scorer LaMelo Ball, have won two straight after losing eight of nine. They entered the game 12-34, next-to-last in the Eastern Conference. It was their first consecutive wins since the end of November.\n\n\r\n              “Obviously, Melo is our star player,\" Rozier said. “We definitely need him. It’s definitely been our story all season, so we just try to work with what we’ve got and play the best basketball that we can.\"\n\n\r\n              Plumlee finished with a season-high 25 points and P.J. Washington scored 12 of his 23 in the fourth.\n\n\r\n              “We were resilient in the second half, kept applying pressure, guys played well, played good defense, made shots,\" Washington said. “That’s all you can ask for.\"\n\n\r\n              Young made one of his last 12 shots and had 25 points. Dejounte Murray scored 26 points and De’Andre Hunter had a season-high 26 for Atlanta.\n\n\r\n              The Hawks dropped to 13-10 at home. They are 24-23 after beginning the night eighth in the East. \n\n\r\n              Rozier hit five 3s and scored 17 points of his team’s 36 points in the third as the Hornets chipped away from a 19-point deficit go on a 19-6 run to pull within six on Jalen McDaniels’ 12-footer at the 5:37 mark. \n\n\r\n              Rozier hit a left corner 3 and the ensuing free throw to put the Hornets up 104-100 with 5:58 remaining. It was their first lead since it was 10-9, but a 3 by AJ Griffin and a steal and dunk by Murray put the Hawks up 108-104.\n\n\r\n              Hunter scored 18 in the first half while Murray chipped in 17 and Young had 16. \n\n\r\n              Capela’s fast-break alley-oop dunk put the Hawks up 52-41 late in the second, and they led 65-49 at halftime. But Atlanta managed only two offensive rebounds in the second half, leading to easy transition points for the Hornets.\n\n\r\n              “I think our defensive rebounding was much better in the second half, but we ran,\" Charlotte coach Steve Clifford said. “A big part of that game was fastbreak points and a good deal of them was off our defense.\"\n\n\r\n              TIP-INS\n\n\r\n              Hornets: F Gordon Hayward returned after missing the last eight games with left hamstring soreness and had nine points... Ball was sidelined with left ankle soreness for the third time this season, and he also has right knee soreness. ... Reserve F Cody Martin was out with left knee soreness for the third straight game. ... Ball has made 78 3s since returning from an ankle injury Dec. 14, most in the NBA over that span. Charlotte went 13 for 34 on 3s.\n\n\r\n              Hawks: G Bogdan Bogdanovic missed the game with right knee injury management. ... Young has 76 consecutive outings with five or more assists, the longest active streak in the NBA. Nikola Jokic is next-closest at 29 straight games. ... Young had his 150th career game with at least 10 assists, the fifth-most such games in NBA history by a player 24 or younger. ... Atlanta began the game leading the East in scoring average this month at 120.9, field-goal percentage at 50.7 and 3-point percentage at 38.5. They went 54.2 from the field and 44.0 on 3s against Charlotte. \n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Utah on Monday and Phoenix on Tuesday.\n\n\r\n              Hawks: At Chicago on Monday and Oklahoma City on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995203.908293
}