{
  "game_id": "0022400775",
  "espn_id": "401705341",
  "date": "Feb 12, 2025",
  "matchup": "CHI vs. DET",
  "headline": "Cunningham scores 29 points and Pistons beat Bulls for second straight night, 128-110",
  "body": "CHICAGO -- — Cade Cunningham scored 29 points and the Detroit Pistons beat the Chicago Bulls 128-110 on Wednesday after dominating them the previous night.\n\n\r\n              Tobias Harris and Ausar Thompson scored 19, and Jalen Duren added 16 points and 14 rebounds. \n\n\r\n              The Pistons rolled into the All-Star break with their fourth straight win after blowing out the Bulls 132-92 in the same arena on Tuesday. Detroit built a franchise-record, 42-point halftime lead Tuesday on the way to its most lopsided win of the season. Chicago, meanwhile, set a club mark by missing its first 20 3-point attempts.\n\n\r\n              On Wednesday, the Pistons led 82-61 midway through the third quarter after a 25-4 run that started late in the first half, sending the Bulls to their 13th loss in 16 games.\n\n\r\n              Ayo Dosunmu scored 23 for Chicago, and Nikola Vucevic added 21 points and 13 rebounds. But the Bulls again had a rough time shooting 3-pointers, making nine of 41 after going 10 for 47 on Tuesday.\n\n\r\n              Coby White finished with seven points after scoring a season-low five on Tuesday. The guard shot 2 of 14 overall coming off a 2-for-13 outing.\n\n\r\n              Takeaways\r\n              \r\n              Pistons: The Pistons hit the break on a strong note.\n\n\r\n              Bulls: The Bulls were more aggressive at the rim and delivered a better effort than the previous night, though that wasn't exactly a high bar. \n\n\r\n              Key mome\r\n              nt\r\n              After Detroit dominated Chicago 71-29 in the first half Tuesday, this one was tied at 57 with about two minutes left in the second quarter. Things changed in a big way after that.\n\n\r\n              Duren cut for a dunk to start the Pistons’ big run. Cunningham drove for a layup with 11 seconds remaining as the Pistons took a 66-59 lead to the locker room, and capped the run with a driving hook and layup that made it 82-61 with 7:18 remaining in the third.\n\n\r\n              Key stat\r\n              The Pistons shot 51.1% and outscored the Bulls 68-48 in the paint.\n\n\r\n              Up next\r\n              Detroit visits San Antonio on Feb. 21, while Chicago is at New York on Feb. 20. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997052.993137
}