{
  "game_id": "0021900081",
  "espn_id": "401160723",
  "date": "Nov 02, 2019",
  "matchup": "MEM vs. PHX",
  "headline": "Devin Booker, Aron Baynes lead Suns past Grizzlies, 114-105",
  "body": "MEMPHIS, Tenn. --  Aron Baynes isn't worried about style points from 3-point range.\n\nThe Australian center converted a career-best four 3-pointers Saturday night, leading to 20 points and the Phoenix Suns used a third quarter burst to beat the Memphis Grizzlies 114-105.\n\nBaynes' last 3-pointer came from a familiar spot around the top of the key and caromed in from straight away. He didn't really say whether he called bank.\n\n\"I could have made a better play, but at the end of the day, happy it went down,\" the 6-foot-10 center said, adding: \"Better to learn in victory than it is in defeat, though. We'll take it.\"\n\nDevin Booker had 21 points to help the Suns improve to 4-2. He and Baynes combined to go 14 of 23 from the field and 7 of 10 from 3-point range, with Booker converting all three of his 3-point attempts. The Suns finished the night shooting 50%, including 14 of 34 from distance.\n\nRookie Ja Morant led Memphis with 24 points and seven assists. Dillon Brooks and Brandon Clarke scored 16 points each, Clarke adding 11 rebounds.\n\nAs it has through much of the early season, the game would get away from Memphis in the third quarter, part of the ongoing second-half problems for the young Grizzlies. Memphis has held halftime leads in all but one game this season, but have stumbled in the final two frames.\n\nThis time, Phoenix outscored Memphis 37-22 in the third, with the Grizzlies committing 11 turnovers. That helped the Suns to convert a two-point halftime deficit into a lead that reached 14 as Phoenix carried an 82-69 lead into the fourth quarter.\n\n\"We came in (before) the third quarter and talked about the adversity we've faced this season, and how we need to stick together through it all,\" Booker said about the second-half change. \"Went out there, kept moving the ball. Started out very good in the third quarter and it just continued the rest of the game.\"\n\nThe second-half struggles are part of the growing pains for Memphis as it tries to make its way through a rebuilding phase around Morant and second-year forward Jaren Jackson Jr., who left the game in the third quarter with a right knee injury.\n\n\"Up (at) halftime, we've faced this before where teams pick up their energy,\" Memphis coach Taylor Jenkins said. \"I didn't feel our energy was there in the third quarter.\"\n\nTIP-INS\n\nSuns: Kelly Oubre Jr. added 15 points and Frank Kaminsky had 14, 11 in the first half. .Were 11 of 14 inside the arc in the first quarter; 2 of 7 from 3-point range. ... Baynes' previous high for 3s was three, two games ago against Utah. ... Have made at least 13 3-pointers in four straight games. Have made more 3-pointers than their opponents in all six games this season. ... Oubre has reached double figures in 19 straight games\n\nGrizzlies: Reserve G Grayson Allen left the game in the third quarter with a left ankle injury and did not return. Shortly after that, Jackson left with a right knee problem. Jenkins said after the game there were no updates regarding the injuries. ... Jonas Valanciunas had 13 points and seven rebounds, ending his streak of three straight double-doubles. ...Had a 62-48 advantage in points in the paint.\n\nCHANGE OF PACE\n\nThe days of Memphis grinding through a game has already gone through a drastic change. The Grizzlies, who were at the bottom in pace last season, are now second at 108.91 possessions. They ranked in the bottom five in pace every season since 2012-13. \"When we started hitting the first day of camp, our guys really started to buy in,\" Jenkins said. \"Every single day we talk about our pace. Every day in film, we talk about our pace.\"\n\nSMALLER CROWD\n\nThe crowd was a bit smaller than normal for a Saturday night in Memphis due to almost 60,000 attending the Memphis-SMU nationally televised game in town at Liberty Bowl Memorial Stadium.\n\nUP NEXT\n\nSuns: Open a six-game homestand against Philadelphia on Monday night.\n\nGrizzlies: Host Houston on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995768.737816
}