{
  "game_id": "0022000901",
  "espn_id": "401307700",
  "date": "Apr 23, 2021",
  "matchup": "LAC @ HOU",
  "headline": "Clippers overcame 11-point 3rd quarter to beat Rockets",
  "body": "HOUSTON -- — Paul George had 33 points and 14 rebounds and the Los Angeles Clippers shook off an 11-point third quarter to beat the Houston Rockets 109-104 on Friday night for their fourth straight victory.\n\n\r\n                    The Clippers were 5 of 22 from the field and 0 for 6 from 3-point range in the third to fall behind 80-76. The 11 points scored in the third quarter marked a season low for points in a quarter for the Clippers. \n\n\r\n                    “We just had to stay with it,” George said. “Not every game is going to be perfect, and that third quarter was an indication of that. We just couldn’t make a shot. As a team, we didn’t have a rhythm, we missed a lot of shots and turned the ball over a lot. It was just a flat quarter for us.”\n\n\r\n                    Reggie Jackson hit three straight 3s early in the fourth as part of an 11-2 run that helped Los Angeles regain the lead. Jackson finished with 19 points.\n\n\r\n                    “It doesn’t matter if it’s 200-199 or 49-48, we’ve just got to find a way to come out with a win,” Clippers coach Tyronn Lue said. “We’ve got a lot of guys out. We knew it’d be a tough game for us. Guys could’ve easily given up, but they didn’t, and we found a way to win.”\n\n\r\n                    John Wall had 27 points and 13 assists for Houston. Christian Wood had 24 points and 19 rebounds, and Kelly Olynyk 23 points and 10 rebounds.\n\n\r\n                    “No matter what our record says, it’s still the game of basketball,” Wall said. “We’ve got some veterans and some young guys, and no matter what’s going on, you never want to have any quit in you. There’s always something to play for.”\n\n\r\n                    The Rockets have lost eight of their last nine and 13 of their last 15. Houston is 4-34 since Feb. 4.\n\n\r\n                    “We’re very, very banged up, going into tomorrow’s game, and I’m not sure what it’s going to look like at this point,” Rockets coach Stephen Silas said. “Those guys fought hard.” \n\n\r\n                    Los Angeles outscored Houston 33-24 in the fourth quarter.\n\n\r\n                    “We struggled in that third quarter to score the basketball, but we scored well in the other three quarters,” Lue said. “We just had to work hard and find a way to get a victory.”\n\n\r\n                    George had 20 points in the first half, leading the Clippers to a 65-61 lead.\n\n\r\n                    “We can’t fold and start being complacent and start saying, ‘You know what -- tonight’s not our night,’” George said. “You’ve got to continue to keep finding a way. Not every game’s going to be pretty. Give Houston credit for making it a challenging night.” \n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Rajon Rondo missed the game with right wrist inflammation, and Kawhi Leonard (right foot soreness) and Serge Ibaka (lower back tightness) remained sidelined. … Patrick Patterson has 12 points, and fellow former Rocket DeMarcus Cousins added 11. … Los Angeles’ backups outscored Houston’s bench 28-13.\n\n\r\n                    Rockets: Wall will not play Saturday night in the second game of a back-to-back, coach Stephen Silas said before the game. … Kevin Porter Jr. (health and safety protocols) remained sidelined. … Danuel House Jr. returned from a 10-game absence with a right ankle sprain. In 21 minutes off the bench, House had five points.\n\n\r\n                    LONGTIME ROCKETS CEO STEPPING DOWN\n\n\r\n                    Rockets CEO Tad Brown, who has served as the team’s CEO since 2006, will step down from his role after the end of this season, the team announced Friday. Brown said his replacement would be announced soon. \n\n\r\n                    “I am excited to see what the future holds for the franchise,” Brown said in a statement. “Led by (Rockets owner) Tilman (Fertitta), Patrick (Fertitta) and the Fertitta family, the Rockets organization is in great hands for generations to come.” \n\n\r\n                    SHOOTER’S TOUCH\n\n\r\n                    Early in the first quarter, George missed a driving, finger-roll layup that somehow landed and stayed perfectly atop the small rim support connected to the backboard. Clippers big man Ivica Zubac observed the ball curiously for a few seconds before tipping it off of its precarious resting place. \n\n\r\n                    TATE’S COOKIES\n\n\r\n                    Rockets guard Jae’Sean Tate had two steals, giving him 74 on the season, which leads all rookies. Tate entered Friday averaging 2.3 steals over the previous seven games. The undrafted rookie has more steals than turnovers on the season. \n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: At New Orleans on Monday night.\n\n\r\n                    Rockets: At Denver on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764997665.080419
}