{
  "game_id": "0021600713",
  "espn_id": "400900134",
  "date": "Jan 29, 2017",
  "matchup": "HOU @ IND",
  "headline": "George's big night leads Pacers to 120-101 rout of Rockets",
  "body": "INDIANAPOLIS --  Paul George delivered a message Sunday night.\n\nJames Harden might have those eye-popping offensive numbers, but it's the Indiana Pacers All-Star who remains one of the league's most complete players.\n\nGeorge scored 33 points, grabbed nine rebounds and hounded the NBA's second-leading scorer into one of his worst games this season to help the Pacers rout the Houston Rockets 120-101.\n\n\"It's fun playing against the good matchups,\" George said. \"I get a rush and it's an excitement for me. It's what people come out to see -- me versus him and us versus them.\"\n\nThose who have watched George lately probably should have expected another impressive showing.\n\nHe matched a career high by topping the 30-point mark for the fourth straight game. George made 13 of 23 shots, 3 of 7 pointers and all four of his free throw attempts. He dished out three assists, had one steal and one blocked shot, leading Indiana to its third straight win.\n\nAnd on defense, George was absolutely stifling.\n\nJust two days after Harden put up 51 points, 13 rebounds and 13 assists at Philadelphia, the five-time All-Star was just 3 of 17 from the field, 2 of 10 on 3s and had 15 points, five rebounds, eight assists and eight turnovers. He played less than three minutes in the final quarter after picking up his fifth foul with 37 seconds left in the third.\n\nRyan Anderson led the Rockets with 27 points on the final leg of a five-game road trip.\n\n\"We just didn't have it,\" Harden said. \"It was a long road trip. It was a tough game. It was just one of those games where we didn't have it.\"\n\nPerhaps fatigue was a factor, but George also had plenty of help.\n\nMyles Turner had 18 points and 10 rebounds, Jeff Teague finished with 17 points and 15 assists, and Glenn Robinson III added 14 points in a game that was never really in doubt.\n\nIndiana led 33-20 after the first quarter, allowed Houston to get as close as six late in the first half and then pushed the lead to 20 in the third quarter. Houston never got closer than 12 in the second half.\n\n\"We need PG to be PG, whether that's scoring 30 or if it's dishing out 10 assists or whether that's locking up another team's best player,\" Turner said. \"We just need him to be him.\"\n\nTIP-INS\n\nRockets: Have lost four of their last five in Indianapolis. ... ... Five of Houston's last seven losses have come by 10 or more points. ... The Rockets have attempted 2,015 3s this season. ... Eric Gordon finished with 14 points in front of his hometown fans after returning from a tight lower back that had kept him out of the previous two games.\n\nPacers:  Finished January with a 9-4 record while averaging 110.8 points. ... Turner had his sixth double-double in 13 games and added four blocks -- the 12th time this season he's had at least four in a game. ... The Pacers improved to 18-6 at home this season.\n\nIMPERFECT NIGHT\n\nHouston was incredibly imperfect Sunday. It flirted with a season-low shooting percentage until the final minutes, when the percentage jumped to 41.0. The Rockets were 11 of 39 on 3s and the 19-point margin matched their worst off the season.\n\nTEAGUE TIME\n\nTeague was acquired in a summer trade that included Atlanta and Utah, and the former All-Star has really cranked it up. Since Dec. 7, Teague has 12 double-doubles in 26 games, is averaging a career-best 4.3 rebounds and his assist numbers continue to increase.\n\n\"It takes time for all of us to adapt and learn how he can be productive in this system,\" coach Nate McMillan said. \"I think he's starting to get a better idea of how he can help us.\"\n\nUP NEXT\n\nRockets: Will go after their seventh straight home win over Sacramento on Tuesday at the start of a four-game home stand.\n\nPacers: Face former coach Frank Vogel for the third time this season when they visit Orlando on Wednesday. Indiana has won the first two games this season.",
  "source": "espn_api",
  "crawled_at": 1764995765.587491
}