{
  "game_id": "0022400679",
  "espn_id": "401705245",
  "date": "Jan 31, 2025",
  "matchup": "CHA vs. LAC",
  "headline": "Powell, Leonard help Clippers pull away from Hornets late for 112-104 victory",
  "body": "CHARLOTTE, N.C. -- — Norman Powell scored 27 points, Kawhi Leonard added 21 points and nine rebounds, and the Los Angeles Clippers held off the pesky Charlotte Hornets 112-104 on Friday night.\n\n\r\n              All-Star James Harden finished with 14 points and 10 assists for the Clippers, while Ivica Zubac had 14 points and 11 rebounds. \n\n\r\n              The Clippers built a 10-point lead in the third quarter but couldn’t completely shake the Hornets (12-33) until late in the game.\n\n\r\n              Harden’s 3-pointer made it 102-95 with 6:06 to play and Leonard’s dunk with 1:45 to play gave the Clippers their biggest of the game at 110-99.\n\n\r\n              Miles Bridges had 27 points and nine rebounds for Charlotte. Vasa Micic scored 20 points.\n\n\r\n              The Hornets are 1-4 on their franchise-record, nine-game homestand that continues Saturday against Denver.\n\n\r\n              Takeaways \r\n              Clippers: The Clippers have won 13 straight games against the Hornets, with their last loss coming on Nov. 18, 2017, in Charlotte. L.A. leads the Hornets 42-25 in the all-time series.\n\n\r\n              Hornets: Friday’s game was originally to be the final matchup between the teams this season. But the California wildfires earlier this month postponed the Jan. 11 game at the Clippers. It will now be played on March 16.\n\n\r\n              Key moment \r\n              After Charlotte got within 97-95 with 6:44 to play, Kevin Porter Jr. followed with a slam dunk of his own missed 3-pointer to spark a 7-0 run that also included a driving layup by Powell and a 3-pointer from Harden for a 104-95 lead. Charlotte got no closer than five the rest of the way.\n\n\r\n              Key stat \r\n              The Clippers were 11 for 28 on 3-pointers and the Hornets just 7 for 30.\n\n\r\n              Up next \r\n              The Clippers visit Toronto on Sunday and the Hornets host Denver on Saturday.\n\n\r\n              ------\n\n\r\n              This version corrects that Miles Bridges had 27 points. A previous version stated he had 25.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997707.672999
}