{
  "game_id": "0021900217",
  "espn_id": "401160859",
  "date": "Nov 22, 2019",
  "matchup": "BKN vs. SAC",
  "headline": "Spencer Dinwiddie helps Nets beat Kings 116-97",
  "body": "NEW YORK --  The Brooklyn Nets usually do well when they hold opponents under 100 points. They did it again Friday night for the second straight game.\n\nSpencer Dinwiddie scored 23 points and Joe Harris added 22 in the Nets' 116-97 victory over the Sacramento Kings. Brooklyn is 34-6 under coach Kenny Atkinson when keeping opponents under 100.\n\n\"We're just trying to play good basketball, play the right way,\" Harris said. \"We've done a better job here lately defensively. When you're able to get stops, things offensively come a lot easier.\"\n\nGarrett Temple finished with 18 points, Jared Allen had 11 points and nine rebounds, and DeAndre Jordan added 10 rebounds for the Nets.\n\nHarrison Barnes led the Kings with 18 points. Buddy Hield had 16, Justin James 14, Nemanja Bjelica 13 and Richaun Holmes 12 as Sacramento shot 4 of 26 from 3-point range.\n\n\"If you're a 3-point shooting team and you shoot 15 percent, you're not going to win a lot of games,\" Kings coach Luke Walton said. \"Brooklyn also beat us up on the glass.\"\n\nThe Nets outrebounded the Kings 48-33, matching their highest differential of the season.\n\nTemple's 3-pointer opened the scoring and Brooklyn never trailed in the game.\n\nLeading 26-23 after the first quarter, the Nets began the second on a 17-8 run to open a 12-point lead at 43-31. The Kings, with Hield scoring 14 first-half points, pulled within seven at halftime, 56-49.\n\nTemple's 3-pointer capped a 10-2 run and gave the Nets a 15-point lead, 66-51.\n\nThe Kings were able to get back within 10 points at 72-62, but Dzanan Musa's two free throws with 39 seconds left gave the Nets a 16-point lead after three quarters.\n\n\"Looking at all our games before this, the third quarter was really our crutch,\" Allen said. \"Now we're getting rid of it and we're running full speed.\"\n\nJordan's dunk midway through the fourth made it a 22-point advantage at 104-82.\n\n\"I think our defense was outstanding again,\" Atkinson said. \"We talked about it pregame. I thought they were active, just a lot of deflections, forcing turnovers, so that's good news.\"\n\nTIP-INS:\n\nKings: Since relocating to Sacramento prior to the 1985-86 season, the Kings trail the Nets 31-35. However, the franchise as a whole (including its time in Kansas City) leads the overall series 49-41. ... After dropping their first five games this season, the Kings have posted three two-game winning streak followed by a loss.\n\nNets: Kyrie Irving missed his fourth straight game with a shoulder injury. The Nets announced Irving will also miss the next three games -- all away from home -- after having his shoulder examined. He will sit out games at the crosstown-rival Knicks on Sunday, and his two former teams -- at Cleveland on Monday and at Boston on Wednesday. ... Brooklyn has beaten the Kings in the teams' last three meetings, matching their longest winning streak vs. Sacramento. ... The Nets are a perfect 4-0 on Fridays this season. ... The last time these teams met, March 19, 2019, Brooklyn erased a 28-point deficit to win 123-121, the largest comeback victory in franchise history.\n\nTHEN THERE WERE TWO\n\nOnly two players on each team have managed to stay in the starting lineup the entire season. Taurean Prince and Harris have started all of the Nets' 15 games, while just Hield and Barnes have been out on the floor for the opening tip in each of the Kings' 14 games.\n\nEASTERN SWING\n\nThe Kings' visit to Brooklyn was the first of four straight road games against East Coast teams. Sacramento now heads to Washington (Sunday), Boston (Monday) and Philadelphia (Wednesday) before returning home to host Denver on Nov. 30.\n\nUP NEXT\n\nKings: At Washington on Sunday.\n\nNets: At New York on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764996437.477768
}