{
  "game_id": "0022400930",
  "espn_id": "401705496",
  "date": "Mar 10, 2025",
  "matchup": "BKN vs. LAL",
  "headline": "Nets snap 7-game skid by beating Lakers 111-108 in first game since LeBron James' groin injury",
  "body": "NEW YORK -- — Noah Clowney scored 19 points and the Brooklyn Nets beat Los Angeles 111-108 on Monday night in the Lakers' first game since losing LeBron James to a strained left groin.\n\n\r\n              Luka Doncic had 22 points, 12 rebounds and 12 assists for LA, but he shot only 8 for 26. Austin Reaves was 3 for 14 as the guards struggled with James and other key frontcourt players sidelined.\n\n\r\n              Cam Johnson and Keon Johnson each added 18 points for the Nets, who snapped a seven-game losing streak. Tyrese Martin finished with 14 points.\n\n\r\n              Gabe Vincent scored 24 points for the Lakers, who had won eight straight before losing James in the fourth quarter of their 111-101 loss in Boston on Saturday. Dalton Knecht had 19 points and Reaves finished with 17 points, 10 assists and eight rebounds. \n\n\r\n              James watched from the end of the Lakers' bench. Coach JJ Redick said before the game the Lakers were still determining how long James would be out.\n\n\r\n              Takeaways\r\n              Lakers: With Jaxson Hayes (right knee contusion) and forwards Dorian Finney-Smith (left ankle soreness) and Rui Hachimura (left patellar tendinopathy) also out, the Lakers used a lineup of Doncic, Reaves, Vincent, Knecht and Alex Len that had never started together.\n\n\r\n              Nets: After giving up a 12-0 run to end the game in a 105-102 loss in Charlotte on Saturday, Brooklyn executed well enough down the stretch to hang on even as a largely pro-Lakers crowd tried to help the visitors rally.\n\n\r\n              Key moment\r\n              Doncic hit a 35-footer to cut it to 108-106 with 10.6 seconds remaining, but after calling timeout, the Nets designed a nice play to get Clowney free and he dunked while getting fouled for a five-point advantage.\n\n\r\n              Key stat\r\n              Doncic had his fifth triple-double of the season and second with the Lakers.\n\n\r\n              Up next\r\n              The Nets visit NBA-leading Cleveland on Tuesday. The Lakers are off until visiting Milwaukee on Thursday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997970.753481
}