{
  "game_id": "0022100180",
  "espn_id": "401360004",
  "date": "Nov 12, 2021",
  "matchup": "SAC @ OKC",
  "headline": "Dort's late layup gives Thunder comeback win over Kings",
  "body": "OKLAHOMA CITY -- — Lu Dort stole the ball from De’Aaron Fox, then quickly dribbled down the court and made a contested layup in traffic with 1.7 seconds left to give the Oklahoma City Thunder a 105-103 victory over the Sacramento Kings on Friday night.\n\n\r\n                    “I was just trying to stay in front of him,\" Dort said about guarding Fox. \"I mean, I didn’t really move my hand that much, he just kind of just lost the ball and I just took it, and then I had to go up strong. I knew there was not that much time left and I had to go and finish.”\n\n\r\n                    It was the kind of hustle play the Thunder used to overcome an 18-point deficit in the second half.\n\n\r\n                    “Great play,\" Thunder coach Mark Daigneault said. \"He’s just a monster, and we’ve got a bunch. And we had a lot of plays like that. We had big time, big time competitive juice plays.”\n\n\r\n                    Sacramento's Buddy Hield, the former University of Oklahoma star, missed a 3-pointer at the buzzer that would have won it for the Kings. Instead, it was Oklahoma City's fourth straight win.\n\n\r\n                    “I just feel like we got some good looks in the first half, we just didn’t finish it,\" Dort said. “You know, sometimes it happens, and we've just got to play through everything.”\n\n\r\n                    Dort and Shai Gilgeous-Alexander finished with 22 points and Darius Bazley added 15 points and eight rebounds for the Thunder. \n\n\r\n                    Harrison Barnes scored 21 points and Richaun Holmes added 16 points and 15 rebounds for the Kings. They have lost four straight.\n\n\r\n                    “I’m at a loss for words for tonight,\" Barnes said. \"But I think in general, if we’re going to preach consistency, we have to live up to that, and right now there’s too many areas in our game where we’re not doing that.”\n\n\r\n                    Sacramento led 62-48 at halftime as Holmes had 10 points and 11 rebounds on 5-for-5 shooting. The Kings held the Thunder to 35.8% shooting before the break.\n\n\r\n                    Chimezie Metu's 3-pointer rattled in to put the Kings up 77-63 about five minutes into the third quarter. The Thunder trailed by 18 with 5:20 left in the period before cutting their deficit to nine heading into the fourth.\n\n\r\n                    Oklahoma City tied it at 90 on a layup by Bazley, and a 3-pointer by rookie Tre Mann gave the Thunder their first lead of the night at 93-92.\n\n\r\n                    Kings coach Luke Walton said his team is learning about its resolve.\n\n\r\n                    “It’s being tested, but it’s not going anywhere,\" he said. \"We’re 13 games into a season, and yeah, it’s a tough patch right now, but we’re not going anywhere. We’re sticking together. We’ll get through it together.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Holmes had eight rebounds in seven minutes in the first quarter. ... Tyrese Haliburton hit a 3-pointer with 1.9 seconds left in the first quarter to give Sacramento a 23-16 lead. He had missed the previous two games with tightness in his lower back. ... Fox scored 16 points and Hield added 14. \n\n\r\n                    Thunder: Missed their first six shots. Every player in the starting lineup missed at least once before Oklahoma City finally scored with 8:38 left in the first quarter. ... Mann scored 12 points on 5-for-8 shooting. ... Aleksej Pokusevski missed all five of his shots, but he had six rebounds, two highlight-reel assists and a block at the rim.\n\n\r\n                    STAT LINES\n\n\r\n                    Thunder rookie Jeremiah Robinson-Earl made just 1 of 9 shots but had a season-best 14 rebounds.\n\n\r\n                    QUOTABLE\n\n\r\n                    The Thunder wore white and gray uniforms and had an alternate court with gray sidelines and baselines.\n\n\r\n                    “It was so nice. I mean, just stepping on the floor and watching it,\" Dort said. \"I was watching on my phone all the pictures and stuff and I felt like we just looked good.”\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: At Detroit on Monday.\n\n\r\n                    Thunder: Host Brooklyn on Sunday.\n\n\r\n                    ------\n\n\r\n                    Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764993903.603204
}