{
  "game_id": "401810065",
  "espn_id": "401810065",
  "date": "Nov 11, 2025",
  "matchup": "OKC vs GS",
  "headline": "Gilgeous-Alexander's 28 points, Holmgren's perfect shooting lead Thunder in rout of Warriors",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander had 28 points and 11 assists in three quarters, Chet Holmgren had a perfect shooting performance and the league-leading Oklahoma City Thunder rolled past the rival Golden State Warriors 126-102 on Tuesday night.\n\n\r\n              Holmgren had 23 points and 11 rebounds. He made all nine of his field goals, both of his 3-pointers and all three of his free throw attempts.\n\n\r\n              Isaiah Joe scored 18 points and Ajay Mitchell added 17 for the defending champion Thunder, who improved to 11-1.\n\n\r\n              Jonathan Kuminga led the Warriors with 13 points. Stephen Curry, who missed the previous three games due to illness, had 11 points on 4-for-13 shooting. He struggled on defense too — he committed his fifth foul with just under 10 minutes left in the third quarter.\n\n\r\n              Thunder defensive stopper Lu Dort was out with a right upper trapezius strain, but they still had plenty of elite perimeter defenders to frustrate the Warriors. It was their second-lowest scoring effort of the season.\n\n\r\n              The Thunder improved to 5-0 at home this season while Golden State fell to 1-6 on the road.\n\n\r\n              The Thunder led 58-40 late in the second quarter when Golden State's Draymond Green was called for a personal foul and a technical, bringing gleeful cheers from Thunder fans who booed him loudly during pregame introductions. Oklahoma City made all three free throws to extend its lead to 21.\n\n\r\n              Oklahoma City led 63-44 at the break, with Gilgeous-Alexander scoring 15 points and Holmgren adding 11 on 5-for-5 shooting. The Thunder limited Curry to seven points on 3-for-10 shooting in the first half.\n\n\r\n              Gilgeous-Alexander got the crowd fired up when he drove, made a layup and drew contact from Green. The free throw pushed Oklahoma City's lead to 80-58. The Thunder increased their advantage to 107-72 at the end of the third quarter.\n\n\r\n              Up next\r\n              The Warriors visit the San Antonio Spurs on Wednesday.\n\n\r\n              The Thunder host the Los Angeles Lakers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042605.479247
}