{
  "game_id": "0022200366",
  "espn_id": "401468521",
  "date": "Dec 07, 2022",
  "matchup": "TOR vs. LAL",
  "headline": "Siakam scores 25 points, Raptors rout short-handed Lakers",
  "body": "TORONTO -- — Pascal Siakam had 25 points and 10 rebounds and the Toronto Raptors routed Los Angeles 126-113 on Wednesday night, beating a short-handed Lakers team playing without LeBron James and Anthony Davis.\n\n\r\n              James sat out because of a sore left ankle, one night after he played 36 minutes in a 116-102 loss at Cleveland. Davis left after one quarter Tuesday night because of a non-COVID illness.\n\n\r\n              Some in the sellout crowd of 19,800 booed when the names of the injured players were displayed on the video board before the game.\n\n\r\n              Guard Patrick Beverley (right knee) and forward Wenyen Gabriel (left shoulder) also were out for the Lakers, who came in having won six of eight.\n\n\r\n              “I still think the team spirit is pretty high,” center Thomas Bryant said after Los Angeles lost its second straight. “We still have a really good collective unit.”\n\n\r\n              Lakers forward Juan Toscano-Anderson had to be helped off the court early in the fourth quarter after spraining his right ankle. Coach Darvin Ham said Toscana-Anderson will be reevaluated following an MRI Thursday.\n\n\r\n              “It just sucks to see him get hurt,” Ham said. “I thought he was good tonight.”\n\n\r\n              Fred VanVleet scored 25 points and O.G. Anunoby had 23 as Toronto led from wire-to-wire, improving to 10-3 at home. Gary Trent Jr. scored 18 points, Chris Boucher had 16 and Scottie Barnes scored 13 points and matched his career high with 17 rebounds.\n\n\r\n              “We did what we were supposed to do tonight, very professional, locked in from the jump ball and really just didn’t give them any chance to get going,” VanVleet said.\n\n\r\n              Dennis Schroder led the Lakers with 18 points, while Russell Westbrook and Bryant each had 16. Kendrick Nunn scored 15 points and Lonnie Walker IV had 12.\n\n\r\n              Ham said he challenged his team at halftime to play better in the second half and was pleased with their response.\n\n\r\n              “As disappointed as I am in losing the game – you know, you never like to lose – I’m not upset, I’m not distraught,” Ham said. “We pulled it together and we competed like we should have done from the start.”\n\n\r\n              Toronto scored the first 11 points and led 39-31 after one.\n\n\r\n              The Lakers went more than five minutes without scoring in the second as Toronto used a 16-0 run to widen its advantage.\n\n\r\n              “The second quarter was our worst quarter defensively,” Westbrook said.\n\n\r\n              The Raptors led 70-47 at the half, and took a 97-75 lead into the fourth.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: Westbrook led Los Angeles with nine rebounds. … James missed five games in November because of a strained left adductor. He also sat out a Nov. 7 loss at Utah because of a sore left foot.\n\n\r\n              Raptors: F Juancho Hernangomez (sprained right ankle) missed his second straight game and is expected to be out another seven to 10 days, coach Nick Nurse said. … Former Raptors stars Morris Peterson and Charles Oakley attended the game.\n\n\r\n              TRIPLE THREAT\n\n\r\n              Siakam had seven assists, the fifth time this season he’s had at least 20 points, 10 rebounds and five assists. Only Luka Doncic (eight), Nikola Jokic and Giannis Antetokounmpo (seven) and Joel Embiid (six) have done it more often.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Philadelphia on Friday night.\n\n\r\n              Raptors: At Orlando on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994082.992147
}