{
  "game_id": "0022200596",
  "espn_id": "401468751",
  "date": "Jan 08, 2023",
  "matchup": "DET vs. PHI",
  "headline": "Harden's triple-double leads 76ers to easy win over Pistons",
  "body": "DETROIT -- — James Harden had 20 points, 11 rebounds and 11 assists to lead the Philadelphia 76ers to a comfortable 123-111 victory over the Detroit Pistons on Sunday.\n\n\r\n              “I hate to you use this example, but when he's playing like this, it's like having a scoring Magic Johnson on the floor,” Sixers coach Doc Rivers said. “When he runs our team with this kind of pace and he scores and gets assists, we're really good.”\n\n\r\n              Tyrese Maxey added 23 points and Montrezl Harrell scored 20 for the Sixers, who have won four of five. \n\n\r\n              “Our defense was pretty good, we took care of the ball and I think everyone competed hard,” Maxey said. “Even someone like Paul Reed comes in and gets nine points and eight offensive rebounds. He plays with so much energy that the other team can't keep up.”\n\n\r\n              Killian Hayes scored 25 points for Detroit, which has alternated wins and losses in its last seven games after a six-game losing streak.\n\n\r\n              “That's a team playing for a championship and we shot ourselves in the foot,” Pistons coach Dwane Casey said. “We had 22 turnovers -- the same number we had in the last game against them. We can't give them points like that.” \n\n\r\n              Isaiah Stewart finished with 20 points and 13 rebounds, while Bojan Bogdanovic had 20 points.\n\n\r\n              “Stew is the heart of this team,” Casey said. “He's not going to be perfect, but you know what you are going to get from him every night.”\n\n\r\n              The Sixers led 71-54 at halftime, thanks to Harrell's 16 points and Harden's 13 points, 10 rebounds and nine assists. Harden only needed 27 seconds in the second half to complete his triple-double, setting up Tobias Harris' basket to put Philadelphia up by 19.\n\n\r\n              Maxey had 11 points in the third to help stay in control. The Sixers outscored the Pistons 29-28 in the quarter to take a 100-82 lead into the fourth.\n\n\r\n              Detroit narrowed the gap to 116-103 with 3:42 left, Rivers to call a timeout. The Sixers scored the next five points and cruised to the win.\n\n\r\n              “The end showed how deep we are,” Rivers said. “Matisse (Thybulle) had six steals, Paul had eight offensive rebounds, Danuel House Jr. comes in and hit a couple 3s. Our whole room has bought it.”\n\n\r\n              TIP INS\n\n\r\n              Sixers: Harden became the 27th NBA player to score 24,000 career points, passing the mark on a layup with 6:28 left in the third quarter.\n\n\r\n              Pistons: Detroit played without two of its three rotation bigs, Jalen Duren (ankle) and Marvin Bagley III (hand). That prevented Casey from his usual tactic to go big with his starting lineup and small with the second unit.\n\n\r\n              UP NEXT\n\n\r\n              The teams play against on Tuesday in Philadelphia.",
  "source": "espn_api",
  "crawled_at": 1764995269.4367201
}