{
  "game_id": "401810047",
  "espn_id": "401810047",
  "date": "Nov 09, 2025",
  "matchup": "NY vs BKN",
  "headline": "Knicks keep rolling offensively, rout Nets 134-98 to win their fourth straight",
  "body": "NEW YORK -- — Karl-Anthony Towns had 28 points and 12 rebounds, and the New York Knicks routed the Brooklyn Nets 134-98 on Sunday night to win their fourth straight and improve to 6-0 at home. \n\n\r\n              Jalen Brunson and OG Anunoby each added 19 points for the Knicks, who matched the longest winning streak in series history at 11 games. Mikal Bridges had 16, Josh Hart and Jordan Clarkson 11 apiece and Mitchell Robinson finished with eight points and eight rebounds in 16 minutes.\n\n\r\n              Michael Porter Jr. scored 25 for the Nets, who have dropped two straight since their lone victory and fell to 1-9.\n\n\r\n              After scoring a season-high 137 points in their last game, the Knicks kept rolling offensively, shooting 54% from the field and racking up an 18-4 advantage in fast-break points.\n\n\r\n              The Knicks raced to an 8-0 lead, then closed the first quarter with an 11-0 burst to lead 40-22. They were 7 for 11 from 3-point range in the period and the Nets were 1 for 10.\n\n\r\n              New York led 77-62 at halftime. That came after the Knicks scored 83 points in the second half of their victory over Minnesota on Wednesday, giving them 160 points over their last four quarters. \n\n\r\n              New York opened the third quarter with a 12-0 run — all five starters scored — to make it 89-62. It ballooned to 107-70 after Hart had seven points in a 9-0 spurt.\n\n\r\n              The Knicks’ 11-game winning streak in the series began Feb. 13, 2023. The Nets had won nine straight immediately preceding that, having never lost when either Kevin Durant or Kyrie Irving played. Both were traded just before New York began its winning streak.\n\n\r\n              The Nets beat the Knicks 11 straight times in the mid-1980s.\n\n\r\n              Up next\r\n              Nets: Host Toronto on Tuesday.\n\n\r\n              Knicks: Host Memphis on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042590.4704
}