{
  "game_id": "0022400580",
  "espn_id": "401705146",
  "date": "Jan 17, 2025",
  "matchup": "TOR @ MIL",
  "headline": "Antetokounmpo scores 35 to lead Bucks past Raptors 130-112",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 35 points and 12 rebounds to lead the Milwaukee Bucks to a 130-112 victory over the Toronto Raptors on Friday night.\n\n\r\n              Damian Lillard added 26 points and eight assists for Milwaukee, which swept the three-game season series from Toronto. Bobby Portis scored 15 and Khris Middleton had 13 points in 24 minutes off the bench.\n\n\r\n              Antetokounmpo posted his 12th straight double-double, the second-longest active streak in the NBA.\n\n\r\n              The Bucks attempted 41 free throws and made 33 as Toronto committed 31 fouls.\n\n\r\n              RJ Barrett led the Raptors with 21 points and 10 assists. Bruce Brown scored 17.\n\n\r\n              Toronto cut an early 20-point deficit in half after scoring the first six points of the fourth quarter to trail 107-97, but the Bucks made another push to seal their third straight win.\n\n\r\n              Toronto had won two in a row at home — beating Golden State and Boston — following a 10-game losing streak.\n\n\r\n              Takeaways\r\n              Raptors: Scottie Barnes went 1 for 11 from the field and 0 of 5 from 3-point range in the first half while picking up three fouls guarding Antetokounmpo. Barnes finished with 10 points and 10 rebounds but was 4-of-16 shooting and 0 for 6 from beyond the arc.\n\n\r\n              Bucks: Had a big first quarter for the third straight game, scoring 37 points on 50% shooting from the field (11 of 22) and 12 of 14 at the foul line to take a 15-point lead. Milwaukee had 47 points in the first quarter Tuesday against Sacramento and 34 points Wednesday versus Orlando.\n\n\r\n              Key moment\r\n              Toronto challenged a foul call on Barnes with 3.9 seconds left in the first half but lost, resulting in three free throws by Lillard. Milwaukee held a 72-57 halftime lead.\n\n\r\n              Key stat\r\n              Milwaukee went 23 of 27 at the foul line in the first half.\n\n\r\n              Up next\r\n              Toronto hosts Orlando on Tuesday, and the Bucks host Philadelphia on Sunday to close a four-game homestand.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996962.770965
}