{
  "game_id": "0022000552",
  "espn_id": "401267712",
  "date": "Mar 04, 2021",
  "matchup": "TOR @ BOS",
  "headline": "Tatum scores 27, Celtics outlast depleted Raptors 132-125",
  "body": "BOSTON -- — Jayson Tatum had 27 points and 12 rebounds and the Boston Celtics won their fourth straight game, outlasting the short-handed Toronto Raptors 132-125 on Thursday night. \n\n\r\n                    Jaylen Brown added 21 points and seven rebounds, and Kemba Walker finished with 15 points. \n\n\r\n                    Coach Brad Stevens recently challenged his players to finish the final four games before the All-Star break strong after a stretch in which the Celtics lost nine of 14. \n\n\r\n                    He said he likes how they've responded, though he said they also have room to grow. \n\n\r\n                    “Any of these four games could have gone the other way,\" Stevens said. \"We have a lot to improve on if we want to be the kind of team we want to be.” \n\n\r\n                    Part of that, Brown said, will be continuing to find different ways to win games, which has been a challenge at times. \n\n\r\n                    “I think we’re learning and growing as the season goes on,\" Brown said. \"I think we’ve definitely made improvement in different categories and that’s that it's all about.” \n\n\r\n                    Toronto, which played without starters Pascal Siakam, Fred VanVleet and OG Anunoby, along with Malachi Flynn and Patrick McCaw as they remained in the health and safety protocols, has lost four of five. \n\n\r\n                    Coach Nick Nurse and several members of his staff were also in the protocols, leaving the coaching duties to assistant Sergio Scariolo.\n\n\r\n                    The Raptors hit 21 3-pointers and led early before being outscored 35-22 in the third quarter. Chris Boucher led Toronto with 30 points. Norman Powell finished with 25 points and Terence Davis added 22.\n\n\r\n                    Despite the loss, Powell liked the progress the team made following Wednesday's lopsided loss to Detroit. \n\n\r\n                    “We gave ourselves a chance to win down the stretch,” Powell said. “We've got to continue to play like that no matter who's in and out of the lineup.” \n\n\r\n                    Boston's lead grew as high as 121-109 in the fourth before a 10-1 run by Toronto cut it to 122-119. But a free throw by Brown, step-back jumper by Tatum and runner by Jeff Teague gave Boston back a cushion and it was able to close it out at the line. \n\n\r\n                    Being short-handed didn’t stop the Raptors from starting fast. They got 21 first-half points from Powell and connected on 11 3-pointers to take a 70-66 lead into halftime. \n\n\r\n                    The Celtics had eight 3s and shot 58% (23 of 40) from the field in the opening 24 minutes. They also had nine turnovers, leading to 10 Toronto points. \n\n\r\n                    Boston trailed by as many as nine before outscoring Toronto 19-14 to end the half. The run included some nice defensive plays, including a block by Robert Williams on Kyle Lowry that started a fast break and ended with Williams on the receiving end of an alley-oop from Walker. \n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Had 36 assists on 45 made field goals. ... Had 55 bench points. ... Had six 3-pointers in the first quarter. … Rookie Jalen Harris rejoined the team’s G-League affiliate, Raptors 905, to participate in the playoffs. \n\n\r\n                    Celtics: Outscored the Raptors 54-44 in the paint. … Finished with 16 turnovers. … Had six turnovers in the first quarter. \n\n\r\n                    QUOTABLE \n\n\r\n                    “It don't get no better than that.” — Tatum on getting to play in the All-Star Game alongside Bradley Beal, a close friend, who also grew up in St. Louis, Missouri, and attended the same high school as Tatum. \n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Open the second half of their schedule March 11 against Atlanta.\n\n\r\n                    Celtics: Visit Brooklyn on March 11. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996855.78283
}