{
  "game_id": "0022300591",
  "espn_id": "401585219",
  "date": "Jan 19, 2024",
  "matchup": "LAL vs. BKN",
  "headline": "Cam Thomas scores 33 points, Nets dominate 2nd half to rout Lakers 130-112",
  "body": "LOS ANGELES -- — Cam Thomas scored 33 points and the Brooklyn Nets beat the Los Angeles Lakers 130-112 on Friday night, pulling away in a dominant second half to snap a four-game losing streak and win for the fourth time in 18 games.\n\n\r\n              The Nets, who lost by one in overtime against Miami on Monday and by two on a last-second shot by Portland's Anfernee Simons on Wednesday, made sure it didn't go to the last possession this time.\n\n\r\n              “I think that last game in Portland kind of struck a chord in a lot of us. We came out today with a little bit more fight, a little bit more grit and just edge,” said Lonnie Walker IV, who was one of seven Nets players in double figures with 15 points.\n\n\r\n              The Nets outscored the Lakers by 24 in the second half and allowed only 44 points after halftime. That matched the fewest points they have allowed in the second half this season.\n\n\r\n              Brooklyn coach Jacque Vaughn told his team at halftime he wanted them to be more physical. That included showing a clip where the Nets were trying to defend a pick-and-roll and didn't have one guy touching a Lakers' purple jersey.\n\n\r\n              That all changed in the second half.\n\n\r\n              Brooklyn trailed by six early in the third quarter before it went on a 23-8 run over a six-minute span to grab an 87-78 advantage. The Nets took the lead with a 12-4 run, including a 3-pointer by Bridges to give them their first lead at 76-74 with 8:09 remaining in the quarter.\n\n\r\n              The Nets outscored the Lakers 38-22 in the third. That matched their best point differential in the quarter this season.\n\n\r\n              “We saw we had to get a little more physical on them and that’s what we did,” Thomas said. “Once we got physical, the energy picked out. We started getting turnovers, a lot of fast breaks and open 3s And we made them.”\n\n\r\n              The Nets trailed the entire first half, and at one point were down by 12 with four minutes left in the first quarter, before they rallied.\n\n\r\n              Thomas kept them in the game with 20 points in the first half on 9-of- 12 shooting. It was his sixth 20-point half of the season.\n\n\r\n              “He saved us in that first half with his ability to get open looks,\" Vaughn said. \"When they got to the point where they started trapping him, we got some good looks out of that for others.”\n\n\r\n              Nic Claxton had 22 points and 14 rebounds. Spencer Dinwiddie scored 13 of his 19 points in the third quarter as the Nets won for the fifth time in their last six games on the Lakers' home court\n\n\r\n              The Nets — whose largest lead was 23 points late in the fourth quarter — had 19 3-pointers, including four apiece by Thomas, Dinwiddie and Mikal Bridges.\n\n\r\n              Anthony Davis had 26 points and 12 rebounds, and LeBron James added 24 points and 10 rebounds for the Lakers, who dropped back below .500 at 21-22. D’Angelo Russell had 20 points.\n\n\r\n              The Lakers had 10 of their 14 turnovers after halftime and shot 14 of 41 from the field, including 4 of 14 on 3-pointers.\n\n\r\n              “They were able to get into a rhythm, shot the ball from the perimeter well and Cam Thomas had a lot going on,” James said. “I thought us not getting stops affected our energy.”\n\n\r\n              Los Angeles is 7-13 since winning the inaugural NBA In-Season Tournament, the third-worst mark in the Western Conference.\n\n\r\n              James had a simple remedy for trying to get past this game quickly.\n\n\r\n              “Watch the NFL playoffs tomorrow,” he said.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At Los Angeles Clippers on Sunday.\n\n\r\n              Lakers: Host Portland on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995516.5454788
}