{
  "game_id": "0022401160",
  "espn_id": "401705726",
  "date": "Apr 09, 2025",
  "matchup": "CHI vs. MIA",
  "headline": "Giddey dominates with 28 points, 16 rebounds and 11 assists as Bulls beat Heat 119-111",
  "body": "CHICAGO -- — Josh Giddey dominated with 28 points, 16 rebounds and 11 assists and the Chicago Bulls beat the Miami Heat 119-111 Wednesday night in a game with heavy seeding implications.\n\n\r\n              Giddey extended a career high with his seventh triple-double as the ninth-place Bulls (37-43) moved a game ahead of Miami in the Eastern Conference. They also pulled within a half-game of Atlanta for the eighth seed. The ninth-place team gets a home game against the 10th seed in the play-in tournament. The winner then visits the loser of the game between the seventh and eighth seeds.\n\n\r\n              Kevin Huerter scored 22. Nikola Vucevic added 20 points and 11 rebounds. Coby White scored 18 and Matas Buzelis finished with 17 points, helping Chicago win for the eighth time in 11 games. They also completed a three-game season sweep of the Heat.\n\n\r\n              Miami had won seven of 10 after dropping 10 in a row.\n\n\r\n              Tyler Herro scored 30. Bam Adebayo had 18 points and Davion Mitchell scored 17.\n\n\r\n              Andrew Wiggins finished with 14 points after missing six games because of a right hamstring injury. He has played in just 16 of Miami’s 31 games since the Heat acquired him from Golden State in the Jimmy Butler trade.\n\n\r\n              Takeaways\r\n              The Heat came up short even though they had their top trio of Wiggins, Adebayo and Herro available for the first time since March 27. \n\n\r\n              The Bulls continued their run of strong performances.\n\n\r\n              Key moment\r\n              The Bulls regrouped after letting a 14-point lead midway through the third quarter slip to five. Mitchell cut it to 100-95 when he nailed a 3 for Miami. But the Bulls responded with a 10-2 run.\n\n\r\n              Key stat\r\n              Giddey's seven triple-doubles rank second by a Bulls player in a single season behind Michael Jordan's 15 in 1988-89.\n\n\r\n              Up next\r\n              The Heat visit New Orleans on Friday while the Bulls host Washington in their final regular-season home game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997019.577468
}