{
  "game_id": "0022200970",
  "espn_id": "401469125",
  "date": "Mar 05, 2023",
  "matchup": "MEM @ LAC",
  "headline": "George, Leonard big in 4Q, Clippers beat Grizzlies 135-129",
  "body": "LOS ANGELES -- — It had been a rough week for the Los Angeles Clippers. A five-game losing streak. The team plane got struck by lightning. They gave up 51 points in the third quarter against Memphis.\n\n\r\n              Then their fortunes turned.\n\n\r\n              Paul George scored 42 points and led a fourth-quarter comeback to help the Clippers beat the Grizzlies 135-129 on Sunday night.\n\n\r\n              “Tonight was a huge win for us,” coach Tyronn Lue said. “It felt like the stakes were high. Losing five in a row with a team that has a lot of talent.”\n\n\r\n              Kawhi Leonard added 34 points and 10 rebounds to give the Clippers their first win since the All-Star break.\n\n\r\n              “It felt good,” said Russell Westbrook, who got his first win as a Clipper. “Now we can get off our back and move forward.”\n\n\r\n              After getting thrashed in the third when the Grizzlies scored 51 points, the Clippers responded in the fourth.\n\n\r\n              “We just knew we needed to win,” Westbrook said.\n\n\r\n              George and Leonard scored every point in a 17-0 spurt in which the Clippers erased a 10-point deficit and took a 124-121 lead. George had the first eight points and Leonard finished it off with the last nine, hitting a 3-pointer and dunking.\n\n\r\n              “Kawhi did a good job turning it up the last eight minutes,” Lue said. “It was a total team effort.”\n\n\r\n              Desmond Bane scored 30 points, Tyus Jones added 25 and Jaren Jackson Jr. had 24 points for the Grizzlies, who were without star Ja Morant. He's away from the team indefinitely while the NBA investigates his social media post in which the All-Star guard appears to be holding a gun.\n\n\r\n              “Give them a lot of credit. They've got two studs over there that made big-time shots,\" Memphis coach Taylor Jenkins said. “They picked up their physicality, something we've got to learn from obviously.”\n\n\r\n              Trailing 84-79, the Grizzlies caught fire over the final minutes of the third. Jones scored 20 points in the period and drew awe from the crowd as he hit three 3-pointers and canned jumper after jumper. \n\n\r\n              Jones had one of his 12 assists on a pass to Santi Aldama, who scored and then dunked on the next possession. Bane closed the period with back-to-back 3s that sent the Grizzlies into the fourth leading 112-97.\n\n\r\n              “They're one of the best teams playing short-handed in the league,” Lue said.\n\n\r\n              The Grizzlies opened their run with 12 straight points, with Jones scoring six points and Jackson hitting a 3-pointer that pulled them into an 84-all tie. They outscored the Clippers 51-30 in the third.\n\n\r\n              “To give up 51 points in the third quarter, that's got to be a record in some capacity,” Lue said.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Luke Kennard scored 15 points against his old team in his return to Crypto.com Arena. Kennard and Lue shared an embrace after the game. “I miss him. That's one of my favorite guys,” Lue said. ... Ziaire Williams had three fouls in five minutes in the first half after being recalled from the Memphis Hustle. \n\n\r\n              Clippers: Marcus Morris had five points in 25 minutes. ... Mason Plumlee had 15 points and nine rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit Los Angeles Lakers on Tuesday.\n\n\r\n              Clippers: Host Toronto Raptors on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994525.9996438
}