{
  "game_id": "401809786",
  "espn_id": "401809786",
  "date": "Nov 14, 2025",
  "matchup": "MIN vs SAC",
  "headline": "Edwards' 30 points power Timberwolves to 3rd straight win, 124-110 over Kings in NBA Cup",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 30 points and Julius Randle added 26 points and 11 rebounds as the Minnesota Timberwolves pulled away in the fourth quarter and beat the Sacramento Kings 124-110 in an NBA Cup game Friday night.\n\n\r\n              Donte DiVincenzo made five 3-pointers and scored 20 points for the Timberwolves, who have won four in a row and are 2-0 in the NBA Cup. Naz Reid had 12 points and 12 rebounds for Minnesota.\n\n\r\n              Domantas Sabonis led the Kings with 34 points and 11 rebounds. Zach Lavine scored 25 points, while Russell Westbrook extended his NBA record with his 205th career triple-double, posting 13 points, 14 assists and 10 rebounds.\n\n\r\n              Sacramento, which gave up a season-high 144 points in a loss to the Timberwolves on Sunday, has lost five straight overall and is 0-2 in the NBA Cup.\n\n\r\n              Leading 92-91 after three quarters, the Wolves started the fourth on an 11-2 run, keyed by two DiVincenzo 3-pointers, the second coming after Jaden McDaniels rebounded a Randle missed free throw and found DiVincenzo, who buried a 32-foot shot to make it 103-94.\n\n\r\n              After two quick buckets by the Kings, the Wolves went on a 16-2 run to break the game open. Rudy Gobert had a dunk and a tip-in on consecutive possessions as Minnesota pulled away.\n\n\r\n              The Timberwolves led by as many as 11 in the first quarter, but the Kings came back and took a 49-47 lead on an alley-oop layup from Westbrook to Lavine.\n\n\r\n              Up next\r\n              Timberwolves: Host the Denver Nuggets on Saturday.\n\n\r\n              Kings: At the San Antonio Spurs on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042625.569469
}