{
  "game_id": "0022300313",
  "espn_id": "401584941",
  "date": "Dec 13, 2023",
  "matchup": "TOR vs. ATL",
  "headline": "Siakam scores 33 points, Raptors beat Hawks 135-128 to end 4-game losing streak",
  "body": "TORONTO -- — Pascal Siakam scored 33 points, Scottie Barnes had 27 points and 10 rebounds and the Toronto Raptors beat the Atlanta Hawks 135-128 on Wednesday night to end a four-game losing streak.\n\n\r\n              O.G. Anunoby added 22 points for the Raptors in the opener of a two-game home set against the Hawks. \n\n\r\n              Former Hawks guard Dennis Schroder scored 17 points, eclipssing 10,000 for his career, and Jakob Poeltl had 15 points and matched a season high with 13 rebounds.\n\n\r\n              “They had some holes on defense and we tried to attack that,” Poeltl said. “It really helped that we made our outside shots as well.”\n\n\r\n              Siakam finished with seven rebounds and seven assists and matched a season high with five 3-pointers. Gary Trent Jr. added four more as the Raptors connected on 18 of 34 from long range. Toronto had a season-best 19 3-pointers in an overtime win at San Antonio on Nov. 5.\n\n\r\n              “We had some breakdowns but I thought our guys really competed,” Hawks coach Quin Snyder said. “It’s hard to say when a team scores (135), but I thought we played good defense.”\n\n\r\n              Trae Young scored 35 points and matched a season high with 17 assists, but Atlanta’s season-worst losing streak reached five. Young also had 17 assists in a Nov. 15 loss to New York.\n\n\r\n              Atlanta’s Bogdan Bogdanovic, who had a career-high 40 points Monday night in a loss to Denver, scored 10 of his 20 against Toronto in the fourth quarter but it wasn’t enough for the Hawks. Dejounte Murray also scored 20 points for Atlanta and Onyeka Okongwu had 13.\n\n\r\n              “It’s a long season,” Okongwu said. “We’re only a quarter of the way through. We know that we have time, a lot of time, to turn it around.”\n\n\r\n              The teams will meet again Friday night in Toronto. \n\n\r\n              Siakam had 14 points in the first quarter and 10 more in the second but Atlanta led 66-64 at halftime.\n\n\r\n              Toronto made eight straight shots from 3-point distance to start the second half and hit nine of 12 from distance in the third, outscoring the Hawks 39-29. The Raptors took a 103-95 lead to the fourth.\n\n\r\n              “You try to take away the rim first with this team because they’re so good, all their guys attack the rim,” Snyder said. “When you collapse in the paint and shut that down, you’ve got to get back out and you’re not always going to block a shot.”\n\n\r\n              Atlanta forward Jalen Johnson missed his eight straight game because of a fractured left wrist, while forward De’Andre Hunter (right knee) missed his second straight.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995441.860827
}