{
  "game_id": "0022301083",
  "espn_id": "401585711",
  "date": "Mar 31, 2024",
  "matchup": "HOU vs. DAL",
  "headline": "Doncic scores 47 as Mavericks win seventh straight and end Rockets' 11-game win streak",
  "body": "HOUSTON -- — Luka Doncic had 47 points, 12 rebounds and seven assists, Kyrie Irving added 24 points and seven assists, and the Dallas Mavericks won their seventh straight and snapped the Houston Rockets’ 11-game winning streak with a 125-107 victory on Sunday night.\n\n\r\n              Doncic scored 32 points in the first half on 12-of-18 shooting, going 6 of 10 on 3-pointers, as the Mavs led 66-45. Doncic had 22 in the first quarter alone and finished 18 of 30 from the field, including 9 of 16 on 3s. He tied his career high for 3-pointers.\n\n\r\n              “When you talk about best player in the world, understanding the time and where we are in the schedule and this road trip, he came out and showed why he’s one of the best in the world,” Dallas coach Jason Kidd said. “He set the tone offensively. … He put the ball in the basket, was able to read and play the defense we saw tonight. It’s up to him to do his job, and he did it at a high level tonight.\"\n\n\r\n              Doncic had a highlight reel shot, making an underhand lob from inside the 3-point line as time was expiring on the shot clock early in the third quarter.\n\n\r\n              “To see him do that, I feel a lot of people got excited, but I think at the same time, that’s Luka,” Kidd said. “He’s always able to make tough shots. He’s Picasso. Give him the paintbrush, he’s going to do something special. That shot was pretty special.”\n\n\r\n              Dante Exum scored 13 points and P.J. Washington had 12 points and six rebounds for the Mavericks. Dallas shot 52% and made a season-high 24 3-pointers in 47 attempts (51%). \n\n\r\n              “We were aggressive,” Doncic said. “They switched, so I think me and (Kyrie) went to work. Everybody else was open, so we were able to knock those shots down.”\n\n\r\n              Dallas tied idle New Orleans for fifth in the Western Conference with eight games remaining for each team.\n\n\r\n              Jabari Smith Jr. scored 28 points and Aaron Holiday added 16, but Jalen Green was held to just 12 on 5-for-15 shooting as Houston’s push for a play-in spot stalled. The Rockets fell to two games behind 10th place Golden State for the final play-in spot in the West.\n\n\r\n              “We didn’t play our best tonight,” Houston coach Ime Udoka said. “Doncic was too comfortable. Not to diminish what we did, but let’s get it back going. … It’s one game. One guy played really well for them. A few others made shots, but we didn’t particularly play great.”\n\n\r\n              Houston shot 42% and was 13 of 38 on 3s.\n\n\r\n              Dallas used a 23-7 spurt in the first quarter to open up a 30-17 lead on Doncic’s 3-pointer with three minutes left. After Houston closed within 47-37 with 5:43 left in the second, the Mavericks outscored Houston 19-8 to end the half, capped by Doncic’s three-point play.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Travels to Golden State on Tuesday.\n\n\r\n              Rockets: At Minnesota on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995567.173972
}