{
  "game_id": "401809794",
  "espn_id": "401809794",
  "date": "Nov 21, 2025",
  "matchup": "DAL vs NO",
  "headline": "Flagg scores 29 points, Marshall hits late 3 to lead Mavericks past Pelicans, 118-115",
  "body": "DALLAS -- — Cooper Flagg scored a career-high 29 points, Naji Marshall hit the go-ahead 3-pointer against his former team with 30.7 seconds left and the Dallas Mavericks beat the New Orleans Pelicans 118-115 on Friday night in NBA Cup play.\n\n\r\n              The 3-pointer by Marshall, who played four seasons with New Orleans before signing with Dallas in July 2024, put the Mavericks ahead 116-115. \n\n\r\n              The Pelicans missed three 3-pointers in the closing seconds, the last attempt from rookie center Derik Queen with four seconds left after Dallas’ Max Christie made two free throws with 10.9 seconds to go. The Mavericks’ P.J. Washington Jr. grabbed the rebound amid a crowd on the baseline, and the teams scuffled after the final buzzer.\n\n\r\n              Flagg, the No. 1 overall pick last summer, was 12 of 19 from the field and had seven rebounds and five assists after sitting out an NBA game for the first time Wednesday night.\n\n\r\n              Washington had 24 points, tying a season high with five 3-pointers, and Christie scored 23, tying a career best with five 3s. The Mavericks are 5-12 overall. They have won two of their last three home games after beginning the season 2-7 at American Airlines Center.\n\n\r\n              Dallas is 1-2 in NBA Cup play. New Orleans is 0-3.\n\n\r\n              Trey Murphy III scored 25 points to top the Pelicans, who have lost eight straight to drop to 2-14. They are 0-4 under interim coach James Borrego.\n\n\r\n              Zion Williamson scored 22 points in his second game back after missing the previous eight with a strained left hamstring. Jeremiah Fears scored 21, and Queen had 20 points, seven rebounds and a career-high 11 assists.\n\n\r\n              The Mavericks’ Brandon Williams tied a career high with 12 assists.\n\n\r\n              Up next\r\n              Pelicans: Host Atlanta on Saturday night.\n\n\r\n              Mavericks: Host Memphis on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042669.2039208
}