{
  "game_id": "0021900966",
  "espn_id": "401161608",
  "date": "Mar 10, 2020",
  "matchup": "PHX @ POR",
  "headline": "Blazers snap 2-game skid with 121-105 win over the Suns",
  "body": "PORTLAND, Ore. --  Damian Lillard had 25 points and the Portland Trail Blazers got a much-needed 121-105 victory over the Phoenix Suns on Tuesday night.\n\nThe win snapped a two-game losing streak for the Blazers, who were among several teams vying to pull in front of Memphis for the eighth playoff spot in the West.\n\nThe Blazers face the Grizzlies on Thursday.\n\n\"They're the team that we're chasing. Sixteen games left,\" Lillard said. “So it's a game on our home floor, a game that we are more than capable of winning. We've just got to come prepared, come sharp and get it done. That's what it comes down to.”\n\nTrevor Ariza and CJ McCollum had 22 points apiece and Hassan Whiteside added 16 points and 14 rebounds for Portland.\n\nLillard's 3-pointer put Portland up 119-101 with 1:37 left and sealed the win. Lillard finished with five 3s and had seven assists.\n\nThe loss snapped a two-game winning streak for the Suns, who were led by Devin Booker with 29 points. Dario Saric added 22 points and 11 rebounds.\n\n“They hit shots, they hit shots and we missed some,” Booker said. “We kept fighting and I'm proud of this team for that. That's never been a question or problem for us.”\n\nCameron Johnson missed his third straight game for the Suns because of mononucleosis. Deandre Ayton was questionable, but missed his third straight game with a left ankle sprain.\n\nCarmelo Anthony's pull-up jumper gave the Blazers an early 26-15 lead. Portland led by as many as 12 points, but the Suns closed the gap in the second quarter, pulling within 44-40 on Saric's 3 pointer.\n\nBooker's jumper put Phoenix ahead 49-48 with 4:23 left before the half but the Blazers had a 54-53 edge at the break.\n\nPhoenix rallied in the third, going up 63-60 on Aron Baynes' basket. Portland again reclaimed the lead and went into the final period ahead 82-78.\n\nLillard's 3-pointer midway through the fourth gave Portland a 101-88 lead. The Blazers led by as many as 18 points in the last quarter.\n\nAfterward, Suns coach Monty Williams was upset about what he felt were calls his team should have gotten.\n\n“I'm more concerned with the lack of foul calling for our guys. I'm just like over it. I've watched (Booker) hit the floor over and over and over again, “ Williams said. ”That was a pretty physical game and there were 17 fouls called on them and 16 fouls called on us in a 48 minute game.\"\n\nThe two teams had met just last week in Phoenix with the Suns winning 127-117. Baynes had nine of the Suns' 19 3-pointers and finished with 37 points.\n\nThe Suns had another 19 3s on Sunday in a 140-131 victory over the Milwaukee Bucks. They finished with 11 on Tuesday.\n\n“Coming off the game we had in Phoenix, it was obvious we wanted to come back and show a lot more resistance, in a game that we really needed,” Lillard said. “To try and make this final push for the playoffs, we had to have this one.”\n\nIt was the first game with both new rules in place that included closing the locker rooms to reporters after the game because of coronavirus.\n\nThere were more empty seats than usual at Moda Center, and a couple of fans jokingly wore hazmat suits. The game ball was not passed down through the stands by fans before the game, a normal pre-game ritual.\n\n“We had a presentation with our doctors last week. Our guys have tried to be on top of trying to keep the germs down even before this outbreak, with giving guys antibacterial stuff on the plane and the bus, that kind of thing,\" Williams said. \"I just listen to the information and try to do the best I can to keep myself as clean as I can. It's a new normal for us.”\n\nTIP INS\n\nSuns: Assistant coach Steve Blake had three different stints with the Trail Blazers as a player. ... Ricky Rubio finished with 21 points and was 11-of-11 from the free-throw line. ... Booker and Rubio each had nine assists. It was their fourth straight game with eight-plus apiece.\n\nTrail Blazers: Portland was looking forward to the return of big man Jusuf Nurkic, who could make his season debut on Sunday. Nurkic has been recovering from a broken leg. ... Whiteside had his 51st double-double of the season. ... The Blazers were coming off a 123-111 loss at home to Sacramento on Saturday.\n\nUP NEXT\n\nThe Suns visit the Dallas Mavericks on Saturday.\n\nThe Trail Blazers host Memphis on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996566.653708
}