{
  "game_id": "0021900440",
  "espn_id": "401161082",
  "date": "Dec 22, 2019",
  "matchup": "CHA @ BOS",
  "headline": "Tatum, Walker lead Celtics to 119-93 win over Hornets",
  "body": "BOSTON --  The Boston Celtics found a game plan that worked in crunch time against the Charlotte Hornets.\n\nThey got the ball to Jayson Tatum and got out of the way.\n\nTatum scored 22 of his career-high 39 points in the fourth quarter and grabbed 12 rebounds as Boston pulled away and beat Charlotte 119-93 on Sunday night.\n\n\"I was really happy with our team for finding him,\" Celtics coach Brad Stevens said. \"As he got hot, they were locked into him.\"\n\nTatum eclipsed his previous high of 34 points against Brooklyn on Jan. 14. The promising 21-year-old forward didn't have a 30-point game before that but has now had four.\n\n\"I just try to stay aggressive no matter what,\" Tatum said. \"I feel like we've done a good job this year with (finding) different guys. Just trying to continue to make the right play but find the guy that's hot.\"\n\nKemba Walker added 23 points against his former team. Jaylen Brown had 16 points and nine rebounds, and rookie Grant Williams added 12 points off the bench for the Celtics. Boston has won three straight and seven of nine.\n\nDevonte' Graham had 23 points and 10 assists, Bismack Biyombo scored 18 and Miles Bridges 15 to lead the Hornets. Charlotte has dropped three straight and four of five.\n\nTerry Rozier scored 14 for the Hornets in his return to Boston. He left the team in free agency last summer. Rozier finished with three points on 1-of-11 shooting in a 108-87 home loss to Boston on Nov. 7.\n\nRozier didn't get a video tribute as some ex-Celtics do in their return, but a small picture of him with the caption \"welcome back\" was hung outside the Hornets' locker room.\n\n\"Yeah, I think I need a bigger sign,\" Rozier said with a laugh.\n\nWalker had 14 points on 4-of-12 shooting in his return to Charlotte in November. Walker left the Hornets in July after eight seasons, joining the Celtics on a four-year, $141 million deal in free agency.\n\nBoston opened the game's first double-digit lead at 72-62 on a 3-pointer from the right corner by Semi Ojeleye with 7:24 left in the third quarter.\n\nCharlotte pulled within 75-73 after Biyombo's floater with 4:30 left capped an 11-3 run.\n\nMalik Monk's three-point play 13 seconds into the fourth cut the Celtics' lead to 84-80, but Tatum scored 17 of the Celtics' next 19 points to blow the game open.\n\n\"You know he's going to score at some point,\" Charlotte's Marvin Williams said of Tatum. \"You just hope he doesn't get 40 like he did tonight. He's good enough to get 40. It's just one of those nights for him.\"\n\nTatum's step-back 3-pointer with 4:30 remaining gave him a career high.\n\nTatum's late surge reminded Rozier of what it felt like to go on a run in front of the Boston crowd.\n\n\"There's nothing better than these fans. They make you feel like you can touch the sky. He did just that,\" Rozier said. \"He's a superstar in the making and just killed us tonight.\"\n\nBoston led by as many as 26 points in the closing minutes.\n\nGraham scored 17 points as Charlotte led 37-30 after one quarter, but the second-year guard was held to two in the second and Boston took a 59-56 lead into halftime.\n\nKEMBA-LIKE\n\nGraham was hot in the first quarter, going 5 for 6 from beyond the arc. Graham tied a franchise record for 3-pointers in a quarter, a record shared by ex-Hornet Walker. Graham's 17 first-quarter points also matched Walker for the most by a Hornets player in the last two seasons.\n\nNOT SO SCARY\n\nRozier, nicknamed \"Scary Terry\" during his tenure in Boston, is a combined 7 for 28 in two games against his former team.\n\nTACKO TIME II\n\nFor the second straight game, the crowd erupted when Celtics' 7-foot-5 reserve Tacko Fall stood up to check in with three and a half minutes remaining. The crowd again chanted \"MVP!\" and cheered wildly for every play Fall was involved in. Fall finished with four points, two rebounds, and a block.\n\nTIP-INS\n\nHornets: Rookie F P.J. Washington was sidelined for a fifth straight game after fracturing his right pinkie finger on Dec. 13 at Chicago. Washington, the No. 12 overall pick in this year's draft, is averaging 12.3 points through 28 games.\n\nCeltics: F Gordon Hayward (sore left foot) sat out a third straight game, but coach Brad Stevens said he \"felt better\" after a morning workout. \"I would guess he'll be bumped up to probable after today,\" Stevens said. ... G Marcus Smart (eye infection) has been cleared to work out at the team's facilities. Stevens said he expects Smart to return shortly after a six-game absence. ... G Carsen Edwards was available after being considered probable with a right quad contusion. Edwards was recalled from Maine of the NBA G-League before the game.\n\nUP NEXT\n\nHornets: Host Thunder on Friday night.\n\nCeltics: Visit defending champion Raptors at noon on Christmas Day.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996081.088282
}