{
  "game_id": "401809933",
  "espn_id": "401809933",
  "date": "Oct 22, 2025",
  "matchup": "CHA vs BKN",
  "headline": "Brandon Miller scores 25 in return as Hornets beat Nets 136-117 in season opener",
  "body": "CHARLOTTE, N.C. -- — Brandon Miller scored 25 points in his first game since Jan. 15, Miles Bridges added 18 points and 11 rebounds, and the Charlotte Hornets defeated the Brooklyn Nets 136-117 in their season opener Wednesday night.\n\n\r\n              LaMelo Ball added 20 points and eight assists and Collin Sexton provided a spark off the bench with 15 points as the Hornets enjoyed a successful reopening to the newly renovated Spectrum Center.\n\n\r\n              The Hornets had a franchise-record nine players finish in double digits in scoring including rookies Kon Knueppel and Ryan Kalkbrenner, both of whom started. It marked the first time in Hornets history two rookies started the season opener.\n\n\r\n              Nic Claxton had 17 points and Cam Thomas added 15 to lead the Nets. Day’Ron Sharpe and Egor Demin each pitched in with 14 points for Brooklyn.\n\n\r\n              Miller, who missed 55 games with a torn ligament in his wrist last season, sat out most of the first quarter after picking up two early fouls. But the No. 2 overall pick in the 2023 NBA draft, hoping for a breakout season, scored 15 points in the game-changing second quarter as the Hornets outscored the Nets to 39-28 to build a 17-point halftime lead.\n\n\r\n              Charlotte shot 53.3% from the field and 47.2% from beyond the arc, while outrebounding the Nets 50-38.\n\n\r\n              Hornets coach Charles Lee acted coy before the game about his plans for the starting five, refusing to name his final two starters.\n\n\r\n              Lee wound up going with Knueppel and Kalkbreneer alongside the team's key trio of returners in Ball, Miller and Bridges. Kalkbrenner finished with 10 points and 11 rebounds in his NBA debut, while Knueppel had 11 points and five rebounds. \n\n\r\n              Knueppel and Kalkbrenner combined to make their first eight shots from the field, but also made some mistakes that resulted in turnovers.\n\n\r\n              Nets first-round draft pick Danny Wolf sat out after spraining an ankle during the morning shootaround. Wolf is day to day and it's possible he could make his debut in Game 2.\n\n\r\n              Up next\r\n              Nets: Host Cleveland on Friday night.\n\n\r\n              Hornets: At Philadelphia on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042476.323534
}