{
  "game_id": "0021800843",
  "espn_id": "401071516",
  "date": "Feb 11, 2019",
  "matchup": "MIL @ CHI",
  "headline": "Antetokounmpo helps Bucks outlast Bulls 112-99",
  "body": "CHICAGO --  The Greek Freak was back in action -- and the rest of the Milwaukee Bucks eventually got rolling to pull out a win.\n\nGiannis Antetokounmpo scored 29 points and had 17 rebounds, Eric Bledsoe added 19 points and Milwaukee came on late to outlast the pesky Chicago Bulls 112-99 on Monday night.\n\n\"I liked our defensive focus for most of the fourth quarter, and offensively, I thought we were a little closer to ourselves in the second half,\" coach Mike Budenholzer said. \"Played with a little more pace, a little more purpose in the second half. I think it showed.\"\n\nAntetokounmpo recorded his 39th double-double of the season in his return after sitting out his fourth game of the season Saturday, against Orlando in Milwaukee, due to right knee soreness The Bucks had their lowest scoring output of the season in that one as their six-game winning streak ended in a 103-83 loss to the Magic.\n\nMilwaukee built a 100-86 lead midway through the fourth quarter against Chicago, but the Bulls' 11-0 run late in the quarter cut the Bucks' advantage to three points with under 3 minutes left. The Bucks finished the game with a 12-2 spurt to seal the win.\n\n\"I think we just trust one another and were playing with a lot of effort,\" Antetokounmpo said. \"Especially defensively, we tried to pick it up in the second half. We were just finding the open man offensively, and we were able to knock down some shots.\"\n\nMalcolm Brogdon added 17 points and Khris Middleton had 16 to help league-leading Milwaukee win for the seventh time in eight games and improve to 13-2 over its last 15. The Bucks' ball control wasn't at its best as they committed 17 turnovers.\n\n\"They tried to get us with a little spoiler alert today, and we couldn't let it happen, said Bledsoe, who had 12 points in the fourth quarter, including two big 3-point baskets.\n\nZach LaVine finished with 27 points after scoring 17 in the first half, and Lauri Markkanen had 20 points and 17 rebounds to help Chicago stay close until the end. Otto Porter Jr., acquired last week from Washington, added 18 points in his third game with the Bulls, but Chicago lost for the fourth time in five and dropped to 3-18 in its last 21.\n\nCoach Jim Boylen lauded his young team for staying close.\n\n\"I thought the first half we controlled the game a little bit,\" Boylen said. \"I thought the tempo was good. I thought our feel was good. . Got down, we battled back.\"\n\nHe praised the 21-year-old Markkanen, who helped try to cover Antetokounmpo.\n\n\"I thought Lauri matched force with force,\" Boylen said. \"I thought Lauri was aggressive.\"\n\nMarkkanen relished the matchup with one of the NBA's premier stars.\n\n\"I was trying to take the drive away,\" Markkanen said. \"I know (Antetokounmpo) prefers the right, so that's what I was trying to do. But obviously he can go both ways, so it's a difficult task.\"\n\nMilwaukee led 22-21 after one quarter and a sluggish start for both teams, with Chicago making nine of 28 shots from the floor and the Bucks hitting just eight of 24. Antetokounmpo put the Bucks in front in the final seconds on a free throw to complete a 3-point play.\n\nMilwaukee tried to pick up the pace in the second quarter, but couldn't sustain it to pull away. The Bucks opened an eight-point lead midway through the quarter, but LaVine and Markkanen came on and helped Chicago trim Milwaukee's lead to 50-49 at the half.\n\nMilwaukee opened the second half with a 15-4 run for a 12-point lead, but Chicago replied with an 11-2 spurt to stay close. The Bucks led 79-71 after the three quarters.\n\nTIP-INS\n\nBucks: Asked about Antetokounmpo's bothersome knee before the game, Budenholzer said, \"Hopefully we'll be able to keep him in a good place going forward.\" Antetokounmpo had 29 points in a win at Dallas on Friday before sitting out Saturday's game. ... F Nikola Mirotic, acquired from New Orleans in a three-team trade last Thursday, sat out a second game with the Bucks as he recovers from a right calf strain. \"We're just taking Niko kind of day-by-day,\" Budenholzer said. \"We've got one more game (before the All-Star break) on Wednesday and we'll see if he's ready to go. If he's not, the silver lining is we have the All-Star break and well just continue to work with him and get him into a good place.\" ... G George Hill was kneed in the groin by Porter Jr. in the second quarter and crumpled in pain, but returned.\n\nBulls: Chicago recalled G Rawle Alkins from the Windy City Bulls and sent Brandon Sampson back to the G League team. Alkins didn't play. ... Kris Dunn fell hard after missing a driving layup late in the third. He stayed in the game briefly, then left for the locker room.  Boylen didn't have an update after the game.\n\nUP NEXT\n\nBucks: At Indiana on Wednesday, then have eight days off over the All-Star break before hosting Boston on Feb. 21.\n\nBulls: Host Memphis on Wednesday, then resume action on Feb. 22 at Orlando.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994473.064111
}