{
  "game_id": "0022200069",
  "espn_id": "401468224",
  "date": "Oct 27, 2022",
  "matchup": "MEM @ SAC",
  "headline": "Bane scores 31, Morant 22 as Grizzlies beat Kings 125-110",
  "body": "SACRAMENTO, Calif. -- — Desmond Bane made six 3-pointers and scored 31 points as the Memphis Grizzlies defeated the winless Sacramento Kings 125-110 on Thursday night.\n\n\r\n              “Shots are falling,” Bane said. “Early on I was getting similar looks and now I kind of got my legs under me and (now) they’re falling.”\n\n\r\n              Ja Morant added 22 points, six assists and five rebounds for Memphis. \n\n\r\n              Earlier this week, Morant and Bane each scored 38 to help the Grizzlies beat Brooklyn 134-124.\n\n\r\n              “Back-to-back performances show you how good he is,” Morant said. “I don't feel like I've got to say it when you can see it.”\n\n\r\n              Brandon Clarke had 16 points, Tyus Jones added 14 and Jake LaRavia scored 13 off the bench for the Grizzlies (4-1).\n\n\r\n              “We talk about being ready to go,” LaRavia said. “Coming off the bench is a little bit harder but we came with energy and played with energy.”\n\n\r\n              De’Aaron Fox had 27 points and six rebounds to lead Sacramento. Harrison Barnes scored a season-high 20 points and rookie Keegan Murray added 18.\n\n\r\n              “It was just the little things that killed us,” Barnes said. “Offensive rebounds ... 50/50 balls ... The theme in a lot of these games is close but not enough and eventually we've got to get over the hump.”\n\n\r\n              Domantas Sabonis finished with 11 points, 10 rebounds and six assists. Sabonis has three double-doubles this season.\n\n\r\n              The Kings trailed by 16 early in the fourth quarter and cut it to six with 9:22 left before Memphis pulled away.\n\n\r\n              Bane was a big reason. \n\n\r\n              “Great two-game performance,” Grizzlies coach Taylor Jenkins said. “He’s been playing great all season. ... I think his defense was really good as well. ... When he’s in that zone, he’s hard to stop.”\n\n\r\n              Sacramento is 0-4 under first-year coach Mike Brown, its worst start since opening 0-5 during the 2019-20 campaign. The Kings have lost six straight to Memphis dating to the 2020-21 season.\n\n\r\n              The Kings are one of three winless teams in the NBA. The others are the Lakers and Magic.\n\n\r\n              “It’s a long season, so you don’t want to put your head down after the first four games, but we know we have to turn this thing around and it’s as simple as that,\" Fox said. \n\n\r\n              KENTUCKY CONNECTION\n\n\r\n              Fox and Malik Monk connected on alley-oops to each other on back-to-back possessions in the third quarter. They were backcourt mates during the 2016-17 season at Kentucky. This is Monk’s first season in Sacramento after signing a $19 million, two-year deal last offseason.\n\n\r\n              MURRAY JOINS STARTING LINEUP\n\n\r\n              Murray made his first career start for Sacramento. The 22-year-old rookie from Iowa sat out the Kings’ season opener because of NBA health and safety protocols. He came off the bench against the Clippers and Warriors. \n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Memphis announced Wednesday that F Ziaire Williams will miss an additional four to six weeks because of patellar tendinitis in his right knee. Williams, the 10th pick in the 2021 draft out of Stanford, has yet to play this season. … Sacramento’s bench was outscored 23-5 in the first half before receiving a spark from Monk.\n\n\r\n              Kings: F Chima Moneke became the first UC Davis basketball player to check into an NBA game. He played six minutes. … Sacramento ranked last in free throw percentage coming into Thursday. The Kings went 18 for 21 against Memphis.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Continue a four-game trip against Utah on Saturday.\n\n\r\n              Kings: Host the Miami Heat on Saturday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994244.185309
}