{
  "game_id": "0021800385",
  "espn_id": "401071066",
  "date": "Dec 08, 2018",
  "matchup": "POR vs. MIN",
  "headline": "Lillard has 28 and the Blazers beat the TWolves 113-105",
  "body": "PORTLAND, Ore. --  Damian Lillard was waiting all night for just the right moment.\n\nLillard and CJ McCollum each hit 3-pointers in the final minute to give the Portland Trail Blazers a 113-105 victory over the Minnesota Timberwolves on Saturday night.\n\nLillard had been looking for enough space to put a clear shot up and he finally found it with 58.5 seconds left.\n\n\"It was one of the first (looks) where the big wasn't there, so I thought, `I'm taking this,' and it went in,\" Lillard said.\n\nLillard finished with 28 points and eight assists, while McCollum added 19 points. Jusuf Nurkic matched his season-high with 22 points and 11 rebounds.\n\nIt was a close game for most of the night. Jeff Teague's 3-pointer and a pair of Minnesota free throws put the Timberwolves up 102-96 with just under four minutes to go.\n\nMcCollum's 3-pointer pulled Portland within 102-101 and the Blazers took the lead on Lillard's long jumper, but Karl-Anthony Towns hit a 3-pointer that put Minnesota back in front.\n\nLillard buried another 3-pointer with 58 seconds left to give Portland a 108-105 lead. McCollum added his 3 with 24.9 seconds to go and Minnesota couldn't catch up.\n\nLillard passed to McCollum for the clutch 3.\n\n\"I just saw CJ go out the other side by himself and nobody was near him, and I was like, `That's as good a shot as you're gonna get,' and he knocked it down,\" Lillard said.\n\nAndrew Wiggins had 22 points for Minnesota, which had won two straight and six of its last seven games. All five of the Timberwolves' starters were in double figures.\n\n\"Going down the stretch you've got to play tough and we didn't do that,\" Timberwolves coach Tom Thibodeau said. \"We didn't do what we're supposed to do.\"\n\nMcCollum returned for the Blazers after missing the last game with a left ankle sprain. The Blazers won at home Thursday night against the struggling Phoenix Suns, who were without their two best players. The win snapped a three-game losing streak.\n\nThe Timberwolves were coming off a 112-104 victory over the Charlotte Hornets on Wednesday night. Townes had 35 points and 12 rebounds.\n\nThe two teams kept it close in the first half. Jake Layman's dunk gave Portland a 34-27 lead early in the second quarter, but the Timberwolves kept the margin within single digits. Portland led by a slim 53-51 at the half, led by Nurkic with 14 points and eight rebounds.\n\nThe Blazers outrebounded Minnesota 33-19 in the opening half, but they were hurt by 13 turnovers. Portland finished with 19 turnovers.\n\nLillard's 3-pointer and McCollum's basket gave Portland a 66-57 lead early in the third quarter. The Blazers pushed the lead to as many as 10 points but the Timberwolves closed the gap again to 79-78 on Dario Saric's 3-pointer and went ahead on Towns' basket before the end of the period.\n\nTowns finished with 19 points and 10 rebounds.\n\n\"It was good to hit a couple of timely 3s after struggling most of the night with shooting, so that was a definite positive,\" Blazers coach Terry Stotts said. \"I thought we played pretty solid defense for the entire night which kind of kept us in it. \"\n\nIt was the third of four meetings between the two teams after splitting the first two.\n\nTIP INS\n\nTimberwolves: Started the season 0-8 on the road, but they won their last two going into Saturday's game. They went into the game 0-7 against the Western Conference. ... It was the start of a four-game trip. ... Andrew Wiggins passed Wally Sczcerbiak (6,775 points) for fourth place on the Timberwolves' all-time scoring list.\n\nTrail Blazers: Portland has won six straight home games against the Timberwolves. ... A highlight was Nik Stauskas' behind-the-back no-look pass to Jake Layman that made it 89-86 for Portland in the fourth.\n\nNURK'S LINE: In addition to his 22 points and 11 rebounds, Nurkic added four assists, three steals and four blocks. The Blazers said he was the first player in the league this season to hit all of those marks in a single game.\n\nQUOTABLE:\n\n\"We let the game slip. I mean it's that simple. All the guys that got good shots took them and when they don't make them that's something you can deal with but on defensive side we've just got to make it a little bit harder on their players,\" said Derrick Rose, who finished with 18 points and nine assists.\n\nUP NEXT\n\nThe Timberwolves visit the Golden State Warriors on Monday.\n\nThe Trail Blazers are at the Houston Rockets on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995187.6843898
}