{
  "game_id": "0022201092",
  "espn_id": "401469247",
  "date": "Mar 22, 2023",
  "matchup": "PHX @ LAL",
  "headline": "Lakers charge to skid-snapping win over Suns, 122-111",
  "body": "LOS ANGELES -- — Anthony Davis had 27 points and nine rebounds Wednesday night in the Lakers' 122-111 victory over the Phoenix Suns, who were furious with the game's large free-throw disparity favoring Los Angeles.\n\n\r\n              Suns coach Monty Williams gave just one answer before leaving his postgame news conference, both ripping the game officials and describing what he sees as a pattern of unfair officiating against his team in recent games. The Lakers shot 46 free throws to the Suns' 20, outscoring Phoenix by 21 points at the line.\n\n\r\n              “Where do you see a game with 46 free throws for one team?” Williams said. “That’s just not right. I don’t care how you slice it. It is happening to us too much. Other teams are reaching, other teams are hitting, and we’re not getting the same call, and I’m tired of it. It’s old. Forty-six to 20 free throws with Devin Booker on our team. He gets 12. I mean, our bench had no free throws. It’s just … I’m over it. Been talking about the same thing for a while. Doesn’t matter what team it is.”\n\n\r\n              Booker scored 25 of his 33 points in the second half for the Suns, who have been called for 31 personal fouls in each of their last two games. Chris Paul said the box score was \"a little weird-looking.”\n\n\r\n              “We've been seeing some crazy stuff in different situations,” Paul added. “I watch a lot of basketball, and ... we've got a guy (Booker) who goes (to the rim) night in and night out, and you don't necessarily see the same (calls). It's crazy. Crazy how some of (the officials), too, you can't even talk to them or approach them ... because that (communication) is horrible.”\n\n\r\n              D’Angelo Russell scored 26 points for Los Angeles. Austin Reaves had 25 points and a career-high 11 assists after moving into the starting lineup for the Lakers, who improved to 7-5 in LeBron James' latest injury absence with an impressive second half. \n\n\r\n              Reaves shot 13 free throws one game after shooting a career-high 18 against Orlando.\n\n\r\n              “(Reaves) was huge for us, and he's been huge for us all year,\" Lakers coach Darvin Ham said. “He's in a great space right now, feeling his game and locked into what we're trying to accomplish.”\n\n\r\n              Paul had 18 points for the Suns, who have lost five of six. Phoenix hadn't lost to the Lakers in six games since May 2021.\n\n\r\n              The Lakers shot 27 free throws in the first half to the Suns' 10, but Phoenix rallied back to trail by just one point with 7:29 to play. Davis, Russell and Reaves then scored every point in a 16-6 Lakers run to put it away.\n\n\r\n              “After the game is controlled in the first half and we're down 20 to 30 free throws, it's kind of easier for them to give us some after that,” Booker said. “Like Chris said, I watch these games every night, so I kind of understand what's going on. I understand the agendas that are being pushed, and trying to just get that out of my head and go out there and compete.”\n\n\r\n              Booker added six rebounds and five assists, but was limited at key moments by Jarred Vanderbilt while the Lakers maintained a steady lead in the fourth quarter.\n\n\r\n              Kevin Durant missed his seventh straight game for Phoenix with an ankle injury, and Deandre Ayton also didn’t make the trip to Los Angeles while sitting out his second game with a hip injury.\n\n\r\n              James is still sidelined with a foot injury, allowing the Suns to miss him for the third time this season. The Lakers have kept James' recovery under wraps, but he is scheduled to be re-evaluated later this week.\n\n\r\n              Los Angeles endangered its playoff hopes with losses to Houston and Dallas last week, but has surged back into a tie for ninth place in the Western Conference postseason picture with consecutive victories.\n\n\r\n              TIP-INS\n\n\r\n              Suns: Landry Shamet scored 15 points in his second game back from a 25-game absence with a left foot injury.\n\n\r\n              Lakers: Reaves scored a career-high 35 points in Los Angeles’ last game, prompting Ham to promote him into Malik Beasley’s starting spot. Beasley hit two 3-pointers off the bench.\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Sacramento on Friday.\n\n\r\n              Lakers: Host Oklahoma City on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995222.458812
}