{
  "game_id": "0021500100",
  "espn_id": "400827987",
  "date": "Nov 09, 2015",
  "matchup": "CHI @ PHI",
  "headline": "Bulls pull away in 2nd half, top winless 76ers 111-88",
  "body": "PHILADELPHIA --  Jimmy Butler stuck a Sharpie inside a media scrum, using the marker as an imaginary recorder to pick up sound bites nearby from teammate Doug McDermott.\n\nButler could have used the Sharpie to mark a W on the schedule before the opening tip.\n\nPlaying the winless 76ers is about as automatic a win as a team gets these days -- this decade, really -- in the NBA.\n\nNikola Mirotic had 20 points and 10 rebounds and Pau Gasol scored 16 points to lead the Chicago Bulls past Philadelphia, 111-88 on Monday night.\n\nThe Bulls played without Joakim Noah and still cruised to a 15-point lead in the first quarter that they eventually stretched to 26. McDermott scored 18 points, Derrick Rose had 12 and the Bulls looked like title contenders against the woebegone Sixers.\n\n\"We needed something like this,\" McDermott said. \"We've had a couple of good practices but it's good to play against someone else.\"\n\nThe Bulls might have had tougher competition in an intrasquad scrimmage.\n\nPhiladelphia (0-7) has lost 17 straight games dating to March 27, 2015. That matches the fourth-longest mark in franchise history, and three of those lengthy losing streaks have come since the start of the 2013-14 season.\n\nThe Sixers matched an NBA record with 26 straight losses from Jan. 31, 2014, to March 27, 2014, and also lost 17 straight from Oct. 29, 2014, to Dec. 1, 2014, according to STATS LLC.\n\n\"The reality is, we've had a lot of practice at this the last two years,\" third-year coach Brett Brown said.\n\nWith Brown hamstrung because of a talent-thin roster built by team president Sam Hinkie, the Sixers' last win was March 25 against Denver.\n\nLed by Gasol and Rose, the Bulls went on a 22-4 run in the first quarter to race to a 15-point lead, only to lose it in the second quarter. The Bulls are the latest team to cruise to a big lead early, then appear to lose interest and cough it up, only to wake up and step on the gas and put away the game.\n\nMirotic, starting for Noah, hit three 3s in the third.\n\nJahlil Okafor continued to serve as a lone bright spot for the Sixers, shaking off a 2-for-10 start from the floor to finish 9 of 25 and have his first career double-double with 21 points and 15 rebounds. Without Noah around to help out Gasol, Okafor shot 6 of 9 in the third and scored 14 points.\n\n\"He's good in the locker room, he's good on the bench,\" Brown said. \"He continues to work. You don't come out and get 15 rebounds and have a depressed-type of effort.\"\n\nTIP-INS\n\nBulls: The Bulls have beat the 76ers seven straight times, including four straight on the road. ... The Bulls hit double digits in turnovers and have had only one game this season in single digits. They had 17 games in single digits last season.\n\nSixers: The 76ers also lost 20 straight from Jan. 9, 1973-Feb. 11, 1973; and 19 straight from March 21, 1972-Nov. 10, 1972. ... Philadelphia Eagles attended the game and tossed T-shirts into the stands.\n\nOUCH:\n\nBulls: Noah was listed in the starting lineup, then benched for Mirotic. Noah was in the lineup until the final minutes of warmups when it was decided he wouldn't play as a precaution. \"It wasn't any one particular move,\" coach Fred Hoiberg said. \"There's nothing structurally wrong with it.\"\n\nSixers: F Nerlens Noel (12.2 ppg and 9.8 rpg) sat out with soreness in both wrists. Noel was hurt Friday against Cleveland and played the next night against Orlando. But with Noel complaining of soreness and the Sixers facing a loaded schedule this week with games against Toronto, Oklahoma City and San Antonio, Brown decided to rest the big man for a big slate of games ahead. ... F Robert Covington (right knee sprain) could return this weekend. ... The Sixers missed 20 of 25 3-pointers.\n\nBLOCK OUT:\n\nGasol blocked six shots for the second time this season and has 19 career games with at least six blocks.\n\nUP NEXT:\n\nBulls: Host Charlotte on Friday.\n\nSixers: Host Toronto on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764993977.6398551
}