{
  "game_id": "0021500382",
  "espn_id": "400828269",
  "date": "Dec 16, 2015",
  "matchup": "MIL @ LAC",
  "headline": "Paul's 21 points help Clippers beat Bucks 103-90",
  "body": "LOS ANGELES --  Even without the services of center DeAndre Jordan for the last 1 1-2 quarters, the Los Angeles Clippers were able to hold off the stubborn, short-handed Milwaukee Bucks.\n\nChris Paul had 21 points and eight assists and the Clippers overcame Jordan's sudden ejection to win 103-90 on Wednesday night and extend the Bucks' road losing streak to 11 games.\n\nJordan had nine points and eight rebounds in 18 minutes. He left with 6:49 remaining in the third after getting a pair technical fouls from referee Marc Davis with the Clippers leading 66-52. The calls stemmed from a battle over a loose ball with Bucks guard Michael Carter-Williams.\n\nJordan's two technicals increased the Clippers' season total to 17 in 26 games, the most in the league.\n\n\"Obviously, we don't want anybody to get thrown out of a game, but it happens,\" coach Doc Rivers said. \"Honestly, I didn't know if that was enough to get thrown out, but you just never know.\"\n\nJ.J. Redick scored 19 points and Blake Griffin added 15 points, helping the Clippers win for the ninth time in 11 games. They were coming off a 4-1 trip that ended with an overtime win at Detroit on Monday night.\n\nPaul helped seal the win with a pair of 3-pointers 48 seconds apart in the final 2:32.\n\n\"Our guys made some big shots and our defense was the key, as it is every night,\" Paul said. \"We just tried to shrink the court on their scorers and slow those guys down as much as we could.\"\n\nCarter-Williams and O.J. Mayo each scored 17 points for the Bucks. Milwaukee hasn't won away from the Bradley Center since beating the Knicks 99-92 on Nov. 6.\n\nIt was Milwaukee's eighth straight road loss to the Clippers since beating them 87-78 on Dec. 4, 2007, when the coaches were Larry Krystkowiak and Mike Dunleavy.\n\n\"The fight was there and the intent was right,\" coach Jason Kidd said. \"The guys played hard, but the ball did not fall for us. The effort was extremely high, but we just could not make the plays when we needed to.\"\n\nThe Bucks were severely understaffed. Leading scorer and rebounder Greg Monroe missed his second straight game because of a sprained left knee suffered in a shootaround Tuesday morning.  Point guard Greivis Vasquez had surgery on his right ankle on Tuesday. Jerryd Bayless has a left ankle sprain and is not traveling with the team.\n\nThat forced Kidd to use his 12th different starting lineup. Miles Plumlee made his first start in 36 games with the Bucks, who acquired him last February from Phoenix in a three-way trade with the Suns and 76ers. The deal also brought Carter-Williams from Philadelphia.\n\nTHE MORNING AFTER\n\nKidd met with his team Wednesday after some video shot by TMZ showed Plumlee, Monroe, Mayo and Khris Middleton partying at a strip club in the early morning before the team's loss to the Lakers. But there were no disciplinary actions taken by the club. \"We understand that these are young men that have free time, and when you're in the entertainment world, you're going to go out and do different things,\" Kidd said. \"Our guys understand that they're under a microscope, and sometimes photos are going to pop up. So you have to be responsible and make the right decisions.\"\n\nMILESTONE FOR PIERCE\n\nPaul Pierce hit a buzzer beater to end the first quarter and become the fifth active player and 16th in NBA history to reach 26,000 points.\n\n\"Paul is just special,\" said Rivers, who coached Pierce in Boston when the Celtics won an NBA title in 2008. \"He frustrated me when I coached against him, because I didn't see the athleticism. It used to drive me crazy. I think Paul has scored most of his points from fundamentals. Every kid should watch his footwork -- and he's still beating guys off the dribble.\"\n\nTIP-INS\n\nBucks: An MRI taken on Monroe's knee revealed a sprained medial collateral ligament, but no structural damage. ... Giannis Antetokounmpo missed his first eight shots before scoring all nine of his points in the final quarter.\n\nClippers: Small forward Luc Mbah a Moute played his first five NBA seasons with Milwaukee after the Bucks picked him 37th overall in the 2008 draft out of UCLA. The Clippers are 8-2 when Mbah a Moute has started and 8-8 when he comes off the bench.\n\nUP NEXT:\n\nBucks: At Golden State on Friday night.\n\nClippers: At San Antonio on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994075.229464
}