{
  "game_id": "0022001037",
  "espn_id": "401307846",
  "date": "May 11, 2021",
  "matchup": "MEM vs. DAL",
  "headline": "Morant, Brooks help Memphis to 133-104 rout of Mavericks",
  "body": "MEMPHIS, Tenn. -- — Ja Morant had 24 points, eight assists and seven rebounds as the Memphis Grizzlies used a third-quarter burst to beat the Dallas Mavericks 133-104 on Tuesday night. \n\n\r\n                    Dillon Brooks added 22 points and John Konchar had a season-high 18 for the Grizzlies. Kyle Anderson scored 15 points, including 10 in the key third quarter as Memphis continues to try and move up in the Western Conference standings. Konchar and Anderson both were 7 of 10 from the field, part of Memphis shooting 57.3%.\n\n\r\n                    While both teams are in the postseason, they still can improve their seedings. Memphis, which earned a spot in the play-in tournament with Monday night’s win over New Orleans, still has a chance to move up to eighth.\n\n\r\n                    The Mavericks, who are on the cusp of claiming the sixth spot in the West, will have to wait before clinching a spot to avoid the Western Conference’s play-in tournament. \n\n\r\n                    “Obviously we didn’t play well over the course of the 48 minutes,” Dallas coach Rick Carlisle said.\n\n\r\n                    Tim Hardaway Jr. led the Mavericks with 19 points, while Willie Cauley-Stein finished with a season-high 16 points. Jalen Brunson scored 15, while leading scorer Luka Doncic managed 12 points but was 4 of 16 from the floor and missed all four of his 3-point attempts.\n\n\r\n                    “I wasn’t myself,” Doncic said. “We’ve got to bounce back, but that game was obviously one of the worst I’ve ever played. I’ve got to be better than that.”\n\n\r\n                    Memphis outscored the Mavericks 36-25 in the third quarter to take a 96-82 lead entering the fourth. Anderson keyed the rally hitting his first five shots in the quarter and Morant scored 11 in the frame.\n\n\r\n                    That lead would swell to 104-82 with 10 minutes left and Carlisle pulled his starters, spelling the end of the Mavericks four-game winning streak.\n\n\r\n                    “I think our starters set a really good tone in that third quarter,” Memphis coach Taylor Jenkins said. “Our defense was big for us. It was a back-and-forth affair there (in the first half). We were able to get the stops we needed and got on a run (after halftime). The pace was big for us and just really good ball movement.”\n\n\r\n                    But Carlisle actually noted the first quarter as a turning point when Memphis erased an early eight-point Dallas lead.\n\n\r\n                    “They got the momentum from there,” the Dallas coach said. “We were never really able to get it back. Very disappointing loss.”\n\n\r\n                    Both teams were playing without key frontline players. Jonas Valanciunas sat out with a sore back for Memphis, while Jaren Jackson continued to take periodic games off under left knee surgery recovery.\n\n\r\n                    Meanwhile, Kristaps Porzingis missed his seventh straight game for Dallas with right knee soreness.\n\n\r\n                    Memphis’ second-half burst helped the Grizzlies outscore Dallas in all four quarters.\n\n\r\n                    “Our mindset tonight was to just play a full 48 minutes, which we try to do every night,” Morant said. \n\n\r\n                    TIP-INS\n\n\r\n                    Mavericks: Dwight Powell was ejected from the game after he struck Grizzlies forward Brandon Clarke in the head on a block attempt in the fourth quarter. …Porzingis participated in pregame warmups but was previously ruled out. Carlisle, as he discussed Monday, said the 7-foot-3 C/F is “targeted to play (Wednesday)”, when Dallas faces New Orleans. … Cauley-Stein started his fifth straight game. Cauley-Stein’s previous high this season was 15 points against Houston on Jan. 4. …Hardaway connected on his 200th 3-pointer of the season. Of the three seasons, Dallas has a player make 200 3-pointers, Hardaway has two of them. …G JJ Redick left the game in the second quarter with right heel soreness and did not return.\n\n\r\n                    Grizzlies: Rookie Xavier Tillman started his 11th game of the season filling in for Valanciunas. … Jenkins said of Valanciunas: “Just got a little back soreness, and we want to take advantage of him getting healthy. It’s nothing serious.” Jenkins expects Valanciunas and Jackson available for Thursday’s game against Sacramento. …The 29-point victory was the second-largest win for Memphis in the series with the Mavericks. …Memphis had 32 assists and is not 21-3 when it records at least 30 assists.\n\n\r\n                    UP NEXT\n\n\r\n                    Mavericks: Host the New Orleans Pelicans on Wednesday night.\n\n\r\n                    Grizzlies: Entertain Sacramento on Thursday in the first of back-to-back games with the Kings.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996911.426738
}