{
  "game_id": "0021601043",
  "espn_id": "400900438",
  "date": "Mar 19, 2017",
  "matchup": "LAL vs. CLE",
  "headline": "Kyrie gets 46, but Cavaliers barely beat Lakers, 125-120",
  "body": "LOS ANGELES -- Most of the basketball world booed when the Cleveland Cavaliers rested their three best players on Saturday.\nTurns out the Big Three needed every bit of that conserved energy one day later to hold off the last-place Los Angeles Lakers.\nKyrie Irving scored 46 points, LeBron James added 34 and the Cavaliers had to rally from an 11-point deficit in the fourth quarter to edge the Lakers, 125-120 on Sunday night.\nKevin Love had 21 points and 15 rebounds as the Cavaliers survived a surprising challenge from a 20-win opponent to clinch a playoff spot. With a 43-point fourth quarter, Cleveland made sure the Lakers didn't put an unsightly dent on its hopes of securing the top overall seed in the East.\n\"We were out of sync a little bit, but they shot the ball extremely well,\" James said. \"We just had to figure out a way to weather the storm. ... (The Lakers) played well. They don't look like a team that's won only 20 games.\"\nJames, Love and Irving all sat out the defending champs' blowout loss to the Clippers earlier in the weekend, angering fans and the national television audience. James, the budding entertainment mogul with a game show on NBC, joked with Denzel Washington and other celebrities while he played, but still made sure the Cavs got their work done.\n\"(The Lakers) played well against us, but I know our team and the way we are,\" Cavs coach Tyronn Lue said. \"Sometimes you have to understand it is not a show, but a competition. When we get to LA and play teams like this, we consider it a show instead of a competition. When you get down early, it hurts your confidence, and now you've got to fight and try to win your game.\"\nD'Angelo Russell scored a career-high 40 points in a spectacular return to the starting lineup for the Lakers, who have lost five straight and 13 of 14. Russell hit seven 3-pointers and had six assists while committing just one turnover in 41 minutes.\n\"He's a special guy,\" James said. \"He's a special player. Russell was extremely hot tonight, and those guys fed off him.\"\nJordan Clarkson added 19 points for the Lakers, and rookie Brandon Ingram had 18. All five Lakers starters scored in double figures for the first time since Christmas.\nTIP-INS\nCavaliers: Kyle Korver missed his seventh straight game with a sore foot. Lue isn't certain whether Korver will return on this road trip, but reiterated that he'll probably wait to return J.R. Smith to the starting lineup until Korver is healthy because he wants a shooter available as a reserve.\nLakers: Russell surpassed his 39-point performance against Brooklyn last season. That was the game in which he debuted his \"Ice in My Veins\" post-shot celebration.\nUNGUARDED OPTIMISM\nRussell relished the challenge of trading 40-point performances with Irving, one of his models as a combination guard.\nAfter falling behind in the first half and trailing 94-83 early in the fourth quarter, Cleveland finally got rolling behind Irving, who hit six 3-pointers. Russell hit his new career high on a three-point play with 5:49 to play, but he didn't score again.\nAfter Russell committed his only turnover of the night, Irving hit a go-ahead 3-pointer.\n\"He's one of the best guards in the league for a reason,\" Russell said. \"He's a professional scorer. He makes shots, but you just have to try and make it as tough as you can.\"\nROLLING RUSSELL\nRussell came off the bench for the past three games for the Lakers after starting all season. Coach Luke Walton said he simply wanted to experiment with different lineups, and Russell insisted he didn't mind.\nBut when Nick Young was ruled out before game time with gastroenteritis, Russell returned to the starting lineup -- and he certainly appeared to be motivated.\nScoring from inside and outside while also playmaking, Russell scored 18 points in the first quarter and finished the half with 22 points and no turnovers. He propelled the Lakers to a nine-point lead and an eventual 59-55 halftime advantage.\nSUPPORTING CAST\nThe Big Three's teammates contributed just 24 points. Cleveland also lost starter Tristan Thompson in the third quarter when he injured his mouth in a collision with Julius Randle. Smith went 1 for 7 in 26 minutes, making a dunk with 5.9 seconds to play.\nUP NEXT\nCavaliers: At Nuggets on Wednesday.\nLakers Host Clippers on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995365.3615098
}