{
  "game_id": "0022400364",
  "espn_id": "401704930",
  "date": "Dec 19, 2024",
  "matchup": "TOR vs. BKN",
  "headline": "Johnson hits tiebreaking 3, scores 15 of his 33 points in the 4th as Nets rally to beat Raptors",
  "body": "TORONTO -- — Cam Johnson hit a tiebreaking 3-pointer with less than two minutes remaining in the fourth quarter and finished with 33 points as the Brooklyn Nets overcame a 10-point deficit and beat the Toronto Raptors 101-94 on Thursday night.\n\n\r\n              Brooklyn’s Nic Claxton was ejected with 8:46 left in the second after throwing the ball into the stands. Claxton scored seven points in 11 minutes. Nets assistant Juwan Howard prevented Claxton from throwing a cushion before the center left Brooklyn’s bench.\n\n\r\n              Johnson scored 15 points in the fourth as the Nets won for the second time in eight games.\n\n\r\n              Ben Simmons and Shake Milton each scored 12 points, and Noah Clowney had 11 for the Nets, who trailed 76-66 late in the third.\n\n\r\n              Toronto’s Scottie Barnes returned after missing the past two games due to a sprained right ankle, finishing with 16 points in 36 minutes.\n\n\r\n              Ochai Agbaji led the Raptors with 20 points, and Gradey Dick added 19 as Toronto’s losing streak reached six.\n\n\r\n              Raptors center Jakob Poeltl remained out after leaving Monday’s loss to Chicago because of a strained left groin. RJ Barrett sat due to illness, and Davion Mitchell was unavailable because of a strained right shoulder.\n\n\r\n              Takeaways\r\n              Nets: Barnes scored to put the Raptors up 90-88 with 2:46 left, but Johnson answered with 11 straight points as Brooklyn took a 99-90 lead with 23 seconds remaining.\n\n\r\n              Raptors: Toronto’s starting lineup of Barnes, Agbaji, Dick, Jonathan Mogbo and Ja’Kobe Walter was the youngest in team history, with an average age of 22 years, 187 days.\n\n\r\n              Key moment\r\n              After Toronto’s Jamal Shead missed a 3, Simmons grabbed the rebound and passed to Thomas for the decisive 3-pointer.\n\n\r\n              Key stat\r\n              Toronto shot 7 for 11 from 3-point range in the third, but went 1 for 10 from distance in the fourth.\n\n\r\n              Up next\r\n              Brooklyn hosts Utah on Saturday, while Toronto hosts Houston on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996980.346254
}