{
  "game_id": "0022200499",
  "espn_id": "401468654",
  "date": "Dec 26, 2022",
  "matchup": "LAC @ DET",
  "headline": "George, Clippers rally late, beat Pistons 142-131 in OT",
  "body": "DETROIT -- — Paul George scored 32 points and the Los Angeles Clippers overcame a 14-point deficit in the final 3:34 of regulation to beat the Detroit Pistons 142-131 in overtime on Monday night.\n\n\r\n              Clippers coach Tyronn Lue pulled his starters when his team fell behind 126-112, but a lineup of Luke Kennard, Terance Mann, Amir Coffey, Nicolas Batum and Moses Brown finished the fourth quarter with a 16-2 run. Mann hit a tying jumper with 5 seconds left in regulation.\n\n\r\n              “You have to give those guys credit for staying ready,” Lue said. “They came out and played with some urgency. Amir and Moses hadn't played in the game, so for them to come in and produce like the way they did was huge.\"\n\n\r\n              Los Angeles then outscored Detroit 14-3 in the extra period.\n\n\r\n              Ivica Zubac added 12 points and 15 rebounds for Los Angeles, which has beaten Detroit eight straight times. The Clippers had seven players score in double figures.\n\n\r\n              Bojan Bogdanovic led Detroit with 23 points, including the Pistons' only field goal of the last eight minutes. Isaiah Stewart added 21 points for NBA-worst Detroit.\n\n\r\n              “We were down 15 points in the third quarter, fought our way back, got the lead and had a comfortable lead with three minutes left,” Pistons Dwane Casey said. “They threw in the towel and we have to learn how to win that game. I'm proud of the way we put ourselves into position to beat one of the best teams in the West, but we didn't get it.\"\n\n\r\n              George scored five points in the first minute of overtime, and baskets by Kennard and Mann gave the Clippers a 138-131 lead with 2:45 left.\n\n\r\n              The Clippers led by five at the half and expanded the margin to 88-73 midway through the third quarter. However, the Pistons answered with a 21-5 run, taking a 92-91 lead on Stewart's dunk.\n\n\r\n              Stewart’s 3-pointer made it 119-112 with 5:23 left. After a Clippers miss, Bogdanovic's short jumper put the Pistons up by nine and forced Lue to call timeout.\n\n\r\n              Stewart’s three-point play with 3:34 left capped off a 53-24 stretch that started with 6:48 left in the third quarter. From there, the Pistons shot 1 of 12 with five turnovers and two missed free throws.\n\n\r\n              “They took their starters out and we thought the game was over,” Stewart said. “We had the lead and we didn't finish the game. That's completely on us, not the coaches.”\n\n\r\n              Bogdanovic hit a 3-pointer on Detroit's first possession of overtime, but the Pistons missed their last five shots and turned the ball over three times.\n\n\r\n              “I thought our defense is what changed the game,” Lue said. “We were rebounding the ball and we had deflections and steals.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Haven't lost to the Pistons since Jan. 12, 2019, when they fell 109-104 at Detroit. ... Kennard scored 18 points, and Marcus Morris, John Wall and Norman Powell each had 16.\n\n\r\n              Pistons: Came into the game averaging a league-high 46.7 bench points in December, but were outscored 61-39 by the Los Angeles reserves. ... Had eight players in double figures for the first time since Nov. 22 against the New York Knicks. ... Jalen Duren had 15 points and 12 rebounds.\n\n\r\n              GETTING EVERYONE INVOLVED\n\n\r\n              The Clippers used 11 players and all of them scored, with Coffey and Brown the only two who didn't reach five points.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit the Toronto Raptors on Tuesday night.\n\n\r\n              Pistons: Host the Orlando Magic on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994977.647192
}