{
  "game_id": "0022200060",
  "espn_id": "401468215",
  "date": "Oct 26, 2022",
  "matchup": "MIL vs. BKN",
  "headline": "Bucks use lopsided run after Nash ejected, beat Nets 110-99",
  "body": "MILWAUKEE -- — Brooklyn coach Steve Nash wasn't around to watch Giannis Antetokounmpo finish picking the Nets apart.\n\n\r\n              Nash was ejected for the first time in his coaching career after arguing that Antetokounmpo should have been called for an offensive foul against Patty Mills while bringing the ball up the court in the third quarter.\n\n\r\n              Antetokounmpo and the Milwaukee Bucks dominated the rest of the way in a 110-99 victory Wednesday night.\n\n\r\n              “I was just standing up for our guys,” said Nash, who was ejected twice during his 18-season playing career. “I thought Patty took a forearm in the throat from Giannis right in front of the ref. I didn’t feel that was fair. I don’t think I was overly demonstrative. I was upset I got the technical.”\n\n\r\n              Antetokounmpo had 43 points, 14 rebounds and five assists. He scored 34 points in the second half.\n\n\r\n              That performance three nights after he scored 44 points and shot 17 of 21 in a 125-105 rout of the Houston Rockets, marking just the fifth time in NBA history a player had scored at least 44 points while playing less than 28 minutes. \n\n\r\n              “I've been working a lot over these few years and this summer and just so anxious to prove to myself that I can do what I've been working on, and sometimes I think I play not (to) my strength as much,” Antetokounmpo said. “I kind of scratched that, and in the second half, I was just, ‘OK, I’m going to be myself and be OK with it' and just tried to drive as much as I can and find my teammates and get in the paint.”\n\n\r\n              The Nets led 70-66 with about 4 ½ minutes remaining in the third quarter when Nash received a technical foul and then yelled his displeasure as assistant coach Jacque Vaughn and forward Royce O’Neale held him back. Nash’s heated reaction resulted in a second technical that got him ejected.\n\n\r\n              Milwaukee outscored the Nets 44-29 the rest of the way.\n\n\r\n              After shooting just 3 of 10 in the first half, Antetokounmpo went 13 of 15 the rest of the way. He scored 34 points in the second half as the Bucks outscored the Nets 67-44 over the final two periods.\n\n\r\n              “That's vintage Giannis,” Bucks coach Mike Budenholzer said. “That's probably about the best — he's had a lot of great performances — tonight that second half, he did everything. He was phenomenal.”\n\n\r\n              Bobby Portis had 20 points and 11 rebounds for Milwaukee, and Jrue Holiday added 15 points.\n\n\r\n              Kevin Durant scored 33, Kyrie Irving 27 and Royce O’Neale 12 for the Nets.\n\n\r\n              Irving scored 11 straight Brooklyn points and sank a jumper that tied the game at 83 with 10:09 remaining, but the Nets went scoreless for the next 5½ minutes as Milwaukee built a 10-point lead.\n\n\r\n              Durant finally ended Brooklyn’s drought by making a driving layup with 4:37 remaining, the first time any Net other than Irving had scored since free throw by Day’Ron Sharpe with 3:02 left in the third period.\n\n\r\n              TIP-INS\n\n\r\n              Nets: Brooklyn played a second straight game without Markieff Morris, out for personal reasons. Seth Curry (left ankle) and T.J. Warren (left foot) still haven’t made their season debuts. Nash said before the game that Curry will practice with the team's NBA G League affiliate Thursday. ... Nash said before the game he wanted to see Ben Simmons recapture “that joy of playing the game” as the three-time All-Star returns after missing the entire 2021-22 season and undergoing back surgery. Simmons had four points, five rebounds and nine assists Wednesday. He hasn't scored more than seven points in any of Brooklyn's first four games.\n\n\r\n              Bucks: The Bucks continue to play without Khris Middleton (wrist), Pat Connaughton (calf) and Joe Ingles (knee). ... A moment of silence was observed before the game to honor Keith Carrington, who had been a lead supervisor for Fiserv Forum event security since 2018. Carrington died during the offseason.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Host the Mavericks on Thursday in the first of four straight home games.\n\n\r\n              Bucks: Host the New York Knicks on Friday in the third game of a season-high six-game homestand.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994609.8520231
}