{
  "game_id": "0022300958",
  "espn_id": "401585586",
  "date": "Mar 14, 2024",
  "matchup": "MIL vs. PHI",
  "headline": "Giannis Antetokounmpo scores 32 points to lead the Bucks to a 114-105 win over the 76ers",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 32 points and 11 rebounds to lead the Milwaukee Bucks past the Philadelphia 76ers 114-105 on Thursday night. \n\n\r\n              Brook Lopez added 19 points and seven rebounds and Damian Lillard had 17 points and nine assists for the Bucks, who won at home after losing three of four on a West Coast swing, which included a 129-94 drubbing against the Sacramento Kings on Tuesday.\n\n\r\n              Tyrese Maxey scored 30 points for the 76ers, who closed out a 1-2 road trip. Tobias Harris added 15 points and Cam Payne had 13. \n\n\r\n              The Bucks, who trailed 83-80 at the start of the fourth quarter, moved ahead 88-87 on a layup by Bobby Portis with 8:42 left. AJ Green followed with three free throws and a 3-pointer to extend a lead that the Bucks wouldn't relinquish. \n\n\r\n              The sharp-shooting guard came off the bench and finished with 14 points in 28 minutes.\n\n\r\n              “It’s my job to stay ready and when shots are there you just let it rip and trust that they’ll fall,\" Green said. \n\n\r\n              The Bucks were short-handed as starting guard Malik Beasley and reserve MarJon Beauchamp sat out with back spasms. Khris Middleton missed his 16th consecutive game with a sprained left ankle.\n\n\r\n              Without standout Joel Embiid, Philadelphia has been struggling to generate offense. The 76ers have lost 13 of 20 without Embiid, who is recovering from a meniscus injury to his left knee. They were held to 79 points in splitting back-to-back games against the New York Knicks on Sunday and Tuesday, and reached that point total on Thursday with two minutes remaining in the third.\n\n\r\n              “I feel like we had the right juice today. We had fun and it showed on the court,\" Payne said.\n\n\r\n              Payne said the team had success early in the game in pressuring Antetokounmpo, who had seven turnovers. \n\n\r\n              Philadelphia came out firing at the start, connecting on 11 of 20 shots, including 5 of 9 from 3-point range in the first quarter, ending with a 10-0 run.\n\n\r\n              The 76ers led by as many as 12 in the second. Payne, traded by Milwaukee to Philadelphia in February for Patrick Beverley, scored 11 points in the quarter, including three consecutive 3-pointers. Philadelphia led 61-53 at the half on 56% shooting from the field and 58% sniping from long distance. Maxey had 18 first-half points, making 4 of 5 from 3-point range.\n\n\r\n              The Bucks committed 10 first-half turnovers, leading to 17 points for the Sixers.\n\n\r\n              “I think that the effort was really good,” Philadelphia coach Nick Nurse said. “We were doing a lot of things we wanted to do. We turned them over a bunch in the first half. Probably the difference in the game, we didn’t quite get to as many turnovers in the second. But I thought we did a lot of really good things.”\n\n\r\n              Bucks coach Doc Rivers said the 76ers were the more aggressive team until later in the game.\n\n\r\n              “They were the instigators the entire first three quarters,\" Rivers said. “I thought in the fourth quarter it flipped.”\n\n\r\n              The Bucks shifted their attention to stopping Maxey, who didn't make a shot from the field in the fourth. \n\n\r\n              Lopez connected on 5 of 10 shots from deep, which he said was a benefit of getting open shots as Philadelphia focused on stopping pick-and-roll plays involving Antetokounmpo and Lillard.\n\n\r\n              “They draw so much attention, rightfully so,\" Lopez said. “The gravity of that pick and roll. It pulls everyone in. You’ve just got to be ready on the weak side.”\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host Charlotte on Saturday.\n\n\r\n              Bucks: Host Phoenix on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996106.907234
}