{
  "game_id": "0021800824",
  "espn_id": "401071497",
  "date": "Feb 08, 2019",
  "matchup": "SAC vs. MIA",
  "headline": "Kings come back from 11 down in fourth to beat Heat 102-96",
  "body": "SACRAMENTO, Calif. --  The Sacramento Kings have a legitimate chance to end their 13-year playoff drought and Dave Joerger is trying to impress upon his players the importance of doing the little things correctly.\n\nIt took more than three quarters for them to get the message against Miami. Even then, it didn't pay off until a big run late in the final period.\n\nBuddy Hield scored 23 points and made a pair of free throws with 17 seconds left, and the Kings rallied from 11 down in the fourth quarter to beat the Heat 102-96 on Friday night.\n\nSacramento pulled within one-half game of the Los Angeles Clippers for the final playoff spot in the West.\n\n\"I don't think maybe anybody thought we were going to be in this position at this point of the year,\" Joerger said. \"But things have happened in the Western Conference and we've got an opportunity, so now the little stuff matters. The silly quick shot, the silly turnover, not getting back on my guy fast enough. It really matters. Everything is amplified this time of year.\"\n\nBogdan Bogdanovic added 16 points and Harrison Barnes scored 12 in his Kings debut after being acquired from Dallas as part of a three-team trade earlier in the week.\n\nJosh Richardson scored 21 points and Dwyane Wade had 15 for Miami, all coming after the 12-time All-Star was involved in a scary fall with 15 seconds left in the first quarter. Wade landed awkwardly while going for a rebound and his head bounced against the floor. He immediately grabbed the back of his head, and then rolled onto his stomach, where he lay while being checked by a team trainer.\n\nWade was eventually helped to his feet and walked off the court. He was examined by a team trainer and was checked for a possible concussion before returning with 4:35 remaining in the first half.\n\n\"I really don't know what happened,\" Wade said. \"I just know that I went up for the rebound and ended up on my (butt), and then my head hit the ground. But no concussion or anything. I did a lot of tests.\"\n\nHassan Whiteside added 17 points and 19 rebounds, while Dion Waiters scored 12 points for Miami.\n\nThe Kings closed the game on a 9-0 run over the final 2 minutes to extend their winning streak to four over the Heat.\n\nSacramento trailed 96-93 following Richardson's layup with 2:05 left.\n\nAfter Willie Cauley-Stein's dunk, Bogdanovic and Hield both made free throws. Hield then scored off an offensive rebound before he and Cauley-Stein combined for three free throws to end the run.\n\nThe Kings rallied after Hield gave a pep talk in the huddle during a timeout.\n\n\"I was like, `We've been here before, we've done it before,\" Hield said. \"It comes down to confidence, wanting to be in that position and wanting to succeed and excel. As a young team, they don't expect us to excel but for us we have to put pressure on ourselves to do good in those situations so coach can trust us.\"\n\nBefore that, much of the attention was focused on Wade's final game in Sacramento that nearly ended early when Wade appeared to get hurt.\n\nAfter returning, Wade made a trio of 3-pointers then drove around Sacramento's 7-foot center Cauley-Stein for a layup that gave the Heat a 59-50 lead.\n\nWade struggled down the stretch when Miami was trying to hold onto its lead. He committed a turnover while trying to lob a pass to Whiteside, then missed a 3-pointer with 32 seconds left.\n\nRichardson also missed a layup and had a pass go through his hands for a turnover in the final seconds.\n\n\"Defensively, they did a good job of pressuring up and making our shots tough,\" Wade said. \"They did a good job of making us get down late in the shot clock and having to force a few.\"\n\nTIP-INS\n\nHeat: Whiteside's double-double was his fourth consecutive and 27th overall this season. ... Ryan Anderson, acquired in a trade from Phoenix at the deadline, did not play.\n\nKings: Before the game, Corey Brewer signed a 10-day contract. The seventh overall pick in 2007, Brewer played in seven games with Philadelphia this season before being released by the 76ers earlier this week.\n\nQUIET DEBUTS\n\nBarnes played nearly 37 minutes, grabbed seven rebounds and shot 3 of 9 in his first game with Sacramento. Alec Burks, who was also part of the multi-team deal, had nine points and four rebounds.\n\nUP NEXT\n\nHeat: At Golden State on Sunday.\n\nKings: Host Phoenix on Sunday.\n\n--\n\nMore AP NBA:https://apnews.com/tag/NBA andhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994183.241842
}