{
  "game_id": "0022000292",
  "espn_id": "401267452",
  "date": "Jan 29, 2021",
  "matchup": "TOR vs. SAC",
  "headline": "Kings hold off Raptors 126-124 for third straight win",
  "body": "TAMPA, Fla. -- — The Sacramento Kings are starting to feel things going their way.\n\n\r\n                    “Things are turning in the right direction,” Harrison Barnes said after scoring 26 points Friday night in Sacramento's 126-124 victory over the Toronto Raptors, the Kings' third straight win.\n\n\r\n                    “There's some joy in being in these games and winning, but there's no time to sit back and relax. We have to keep that edge and keep hustling.”\n\n\r\n                    De'Aaron Fox added 24 for the Kings, who haven't lost since Jan. 20. Their scheduled six-game Eastern swing has been reduced to four games by a couple of postponements, and they have won twice in Florida.\n\n\r\n                    Buddy Hield had 22 points and Hassan Whiteside came off the bench with 16 points and nine rebounds for the Kings (8-10) in his second game back after missing four games with a hip injury.\n\n\r\n                    “That was huge,” Barnes said of Whiteside's 20-minute contribution. “He's still getting his legs underneath him but he gives us a different look, puts pressure on the defense.”\n\n\r\n                    Sacramento shot 55% overall to offset nine fourth-quarter turnovers.\n\n\r\n                    Pascal Siakam scored 32 points for the Raptors (7-12). Fred VanVleet had 26 points and six assists.\n\n\r\n                    “We didn't play well enough in the first half, and you don't do that in this league,” said Siakam, whose drives got most of the Sacramento frontcourt in foul trouble and got him 14 free throws. “We did a pretty good coming back but you can't get behind like that.”\n\n\r\n                    Barnes scored 13 points in the first quarter, nine during a 17-2 run that carried into the second quarter and left Sacramento with a 17-point lead.\n\n\r\n                    The Kings led 68-58 after a first half in which they shot 54.8%. Sacramento led by 18 at one point and by double digits throughout the second half until Yuta Watanabe's 3-pointer brought the Raptors within seven with 6:02 remaining.\n\n\r\n                    A layup by Watanabe got the Raptors within one with 1:08 left, but Tyrese Haliburton answered with a 3-pointer for Sacramento, putting Toronto into a fouling mode in the final 44 seconds.\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Broke a seven-game losing streak against Toronto. ... C Richaun Holmes brought a league-leading .681 field goal percentage into the game. He shot 1 for 4 before fouling out with 2:04 left. . . . Four of the games seven technical fouls were called on the Kings.\n\n\r\n                    Raptors: G Norman Powell, who had averaged 23.3 points in the preceding four games, missed his first game with a right quad contusion. ... F OG Anunoby (left calf strain) missed his second game with a left calf strain. \n\n\r\n                    20-POINT DEFENSIVE IMPROVEMENT\n\n\r\n                    The Raptors had set a franchise scoring record in a 144-123 win at Sacramento on Jan. 8.\n\n\r\n                    “We were ready and we went out and scored 70 points (actually 74) in the first half. We just couldn’t stop anybody,\" Kings coach Luke Walton said before the rematch. “We feel like we’re a better team now and this is a great opportunity to test it.”\n\n\r\n                    OUT OF THEIR LEAGUE?\n\n\r\n                    The Kings have not won more than three straight since winning five in a row from Oct. 24 to Nov. 1, 2018. Four of those five wins came against Eastern Conference teams.\n\n\r\n                    The three wins on their current streak are against New York, Orlando and Toronto.\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Play at Miami on Saturday night before concluding their road trip at New Orleans on Monday.\n\n\r\n                    Raptors: Play Sunday night against Orlando before leaving Tampa for two weeks while the Super Bowl comes to town.",
  "source": "espn_api",
  "crawled_at": 1764996879.624541
}