{
  "game_id": "0021600615",
  "espn_id": "400900036",
  "date": "Jan 16, 2017",
  "matchup": "MIL vs. PHI",
  "headline": "Embiid strong in 4th quarter as 76ers beat Bucks 113-104",
  "body": "MILWAUKEE --  Once Joel Embiid regained his footing, the Philadelphia 76ers were fine.\n\nEmbiid scored 18 of his 22 points in the second half and the 76ers won for the fourth time in five games, beating the Milwaukee Bucks 113-104 Monday.\n\nThe Sixers improved to 13-26. Their only recent loss was Saturday at Washington, when Embiid didn't play.\n\nEmbiid is limited to 28 minutes per game while trying to overcome injuries that have slowed his career.\n\n\"My legs were really heavy and I didn't play against Washington, so I got out of shape so easily,\" Embiid said. \"In the second half, I just got it going. I rely on my defense to get my offense going and we played really well defensively.\"\n\nEmbiid had 12 rebounds. He made four of nine shots and 13 of 18 free throws.\n\n\"He started the game in the first half, very unlike Joel, he really struggled,\" 76ers coach Brett Brown said. \"The way he came on in the second half, particularly with his competitive physical mind and the way he played, really set the stage and set the table for our defense.\"\n\nPhiladelphia had lost nine in a row to the Bucks, last beating them on Nov. 22, 2013.\n\nJabari Parker and Giannis Antetokounmpo each scored 23 points for Milwaukee. Antetokounmpo was in foul trouble for most of the second half, scoring only two points in 11 minutes after the break and fouling out with 2:51 to go.\n\n\"We had to do something because he really took control of the game in the first half,\" Brown said. \"Our team defense around Giannis improved.\"\n\nDario Saric scored 17 points and Ersan Ilyasova added 12 for the Sixers, who made 14 of 37 3-point attempts.\n\nThe Bucks have given up at least 10 3-pointers in their last seven consecutive games, with opponents taking at least 30 3-point attempts in four of their last five games.\n\n\"At some point, we have to understand what the 3 means to us as a team if we want to win,\" Milwaukee coach Jason Kidd said. \"We can talk about it, but if there's no effort in guarding it and understanding, again, it starts with effort. If we don't give it, we're going to give up a lot of 3s.\"\n\nThe 76ers used a 12-2 run to take control of the game midway through the fourth quarter. A dunk by Jahlil Okafor began the burst and Embiid capped it with a pair of free throws.\n\nMilwaukee missed 10 of its first 13 shots in the quarter to fall behind 97-87 with less than 5 minutes to play.\n\n\"Everyone says we have a young team, but that's an excuse,\" Bucks guard Malcolm Brogdon said. \"I think there's a lack of focus. We've got to come out collectively, it's not anybody individually. It's a unit.\"\n\nNOEL LATE SCRATCH\n\nNerlens Noel was a late scratch for the Sixers with a sprained left ankle, leaving Okafor to back up Embiid. Okafor scored 10 points in 20 minutes off the bench. \"I just tried to get loose as fast as I could,\" he said. \"I've been working extremely hard to stay prepared in case something like this happened.\"\n\nFOUL TROUBLE\n\nAntetokounmpo had a marvelous first half with 21 points, making 9 of 11 shots. But the Bucks star picked up his fourth foul with 6:04 left in the third quarter and didn't return until the beginning of the fourth quarter. He lasted just 38 seconds in the fourth quarter before committing his fifth foul and heading back to the bench.\n\nBUCKS ROOKIE IMPRESSES\n\nBrogdon started for the 10th consecutive game, and scored 11 points with six assists in 28 minutes. He is averaging 13.5 points and the team is 5-5 since he entered the starting lineup.\n\nTIP-INS\n\n76ers: G T.J. McConnell was in Philadelphia to have an MRI on his right wrist, which showed no structural damage.\n\nBucks: Parker spoke to the Milwaukee crowd before the game about Martin Luther King Jr.'s legacy. \"His legacy, his leadership, his characteristics really resemble what our country needs to be like today,\" he said.\n\nUP NEXT\n\n76ers: Host Toronto Wednesday night.\n\nBucks: At Houston Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995185.700202
}