{
  "game_id": "0022000103",
  "espn_id": "401267263",
  "date": "Jan 05, 2021",
  "matchup": "MEM vs. LAL",
  "headline": "Lakers stretch winning streak to 4, beat Grizzlies 94-92",
  "body": "MEMPHIS, Tenn. -- — Anthony Davis and LeBron James each scored 26 points, rallying the Los Angeles Lakers to a 94-92 win over the Memphis Grizzlies on Tuesday night.\n\n\r\n                    James added 11 rebounds and seven assists, and Dennis Schroder finished with 12 points for Los Angeles.\n\n\r\n                    “That’s why he’s great,” Lakers coach Frank Vogel said of James taking over the game with Davis. “He finds a way to make those superhero-type of plays. Our focus is on making sure we don’t need those superhero-type of plays to close games out.”\n\n\r\n                    Jonas Valanciunas, Dillon Brooks and Gorgui Dieng led Memphis with 13 points apiece, and Brandon Clarke added 12 points. Valanciunas finished with 11 rebounds.\n\n\r\n                    On a poor shooting night for both teams, the Lakers were able to depend on James and Davis down the stretch. Los Angeles trailed 79-77 with five minutes left when the two big men combined for a 9-2 run and an 86-81 lead. The final basket came on a dunk by Davis on an assist from James.\n\n\r\n                    James and Davis combined for a run of 15 points late in the fourth to take the lead to 92-83 with 31.1 seconds left.\n\n\r\n                    “I have a lot of confidence in LeBron James in the fourth quarter,” Vogel said. \"I don’t really know any other way to say that. I trust him.”\n\n\r\n                    Memphis was able to put together some late baskets to make it close, but couldn’t overtake the Lakers, who won their fourth straight.\n\n\r\n                    “Obviously in a hard fought game like that, you hope to come out with a victory,” Memphis coach Taylor Jenkins said. “But our guys were amazing.\n\n\r\n                    “Effort again. But the attention to detail, the execution. These guys, for 48 minutes, were unbelievable. Came up a little short in the end.”\n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Entered the game as the only NBA team ranked in the top 5 in offensive efficiency (2nd/115.7) and defensive efficiency (4th/104.5). … Both Kentavious Caldwell-Pope (left ankle sprain) and Alex Caruso (health and safety protocol) again sat out. Both appeared headed for return in the coming games, according to Vogel. \n\n\r\n                    Grizzlies: Valanciunas recorded his seventh straight double-double. … Rookie Desmond Bane saw his streak of games with multiple 3-pointers end at six. That marked the second-longest streak to start an NBA career behind Chicago’s Lauri Markkanen’s 10 straight to open the 2017-18 season. … Swingman John Konchar was the latest Memphis player to miss a game after suffering a left ankle sprain.\n\n\r\n                    SOCIAL JUSTICE: Several Laker players referenced news earlier in the day regarding no charges filed against the Kenosha, Wisconsin, police officer who shot Jacob Blake, who was left paralyzed. “The flame is already lit,” guard Wesley Matthews said. “It just has to continue to keep burning, but burn the right way. Not where anything can be sidetracked.” Matthews later added: “It really is disheartening. But leaders have to be leaders and everybody has to take ownership for their own community.”\n\n\r\n                    LIKE ORLANDO: The NBA season has led to creative scheduling. For example, the Lakers ended a road trip where they played consecutive games in San Antonio and then Memphis. And with very little outside interaction in hopes of avoiding the coronavirus. “It’s almost like we were in the bubble, except we’re not in the bubble,” Vogel said. “You kind of go to work, go back to the hotel and not too much else.”\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: Return home Thursday after a four-game road trip to host the San Antonio Spurs.\n\n\r\n                    Grizzlies: Host the Cleveland Cavaliers on Thursday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996987.417255
}