{
  "game_id": "0022401077",
  "espn_id": "401705643",
  "date": "Mar 29, 2025",
  "matchup": "CHI vs. DAL",
  "headline": "Mavericks outlast Bulls 120-119 to pad lead in play-in race",
  "body": "CHICAGO -- — Klay Thompson scored 20 points, P.J. Washington had 19 and the Dallas Mavericks beat the Chicago Bulls 120-119 on Saturday night.\n\n\r\n              Dallas moved 1 1/2 games ahead of idle Phoenix for the final spot in the Western Conference play-in tournament. \n\n\r\n              Anthony Davis added 18 points and Spencer Dinwiddie had 14 points and 11 assists to help the Mavericks win for the second straight game and fourth time in the last five.\n\n\r\n              Dallas led by 11 points late in the fourth quarter but Chicago cut it to 118-116 with 8.6 seconds left. Thompson made two throws two seconds later and the Mavericks were careful not to foul Chicago’s Nikola Vucevic, who made a 3-pointer with 0.9 seconds left.\n\n\r\n              Rookie Matas Buzelis scored 28 points for Chicago. Vucevic and Coby White each added 25. The Bull had won four straight and nine of 11.\n\n\r\n              Takeaways\r\n              Mavericks: Dallas, Sacramento and Phoenix are fighting for the final two play-in spots in the West. \n\n\r\n              Bulls: The Bulls, seeking a season-best fifth straight victory, missed a chance to move closer to the eighth spot in the Eastern Conference.\n\n\r\n              Key moment\r\n              The Mavericks gave Vucevic plenty of room on his final 3-pointer, ensuring the Bulls, who beat the Lakers a few nights earlier, wouldn’t have another flurry of late dramatics.\n\n\r\n              Key stat\r\n              Dinwiddie was 5 for 8 from the floor in the fourth quarter, including a cutting layup with 36 seconds left.\n\n\r\n              Up next\r\n              Both teams play Monday night. The Mavericks host Brooklyn, and the Bulls are at Oklahoma City.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997027.792874
}