{
  "game_id": "0021400086",
  "espn_id": "400578378",
  "date": "Nov 08, 2014",
  "matchup": "CHI vs. BOS",
  "headline": "Emergency starter Evan Turner scores 19 as Celtics top Bulls",
  "body": "CHICAGO -- A few days into the regular season, the short-handed Boston Celtics and Chicago Bulls already are in grind mode.\nEmergency starter Evan Turner scored 19 points, one of seven Boston players in double figures, as the Celtics passed an early test with a 106-101 victory on Saturday night. The Celtics did it without Rajon Rondo, who missed his fourth game of the season.\n\"Listen, we had to play great tonight, and we did for the better part of the game,\" Celtics coach Brad Stevens said after his team's third game in four days. \"Then Aaron Brooks went nuts at the end. You knew they were going to make a run. I'm just glad we didn't play a 49-minute game.\"\n\nKelly Olynyk finished with 18 points and 11 rebounds for Boston, while Jeff Green contributed 14 points.\nBrooks led Chicago with 26 points -- 19 in the fourth quarter. Pau Gasol added 19 points and nine rebounds.\nAfter Brooks hit a 3-pointer and a pair of free throws to pull the Bulls within 99-96, Olynyk split a pair of free throws. Brooks connected on a two-pointer, but Turner, Olynyk and Green answered with two free throws apiece in the final 17 seconds to seal the outcome.\n\"We just kind of had to weather the storm, make some plays,\" Olynyk said. \"E.T. hit some big shots. We got some big rebounds and just found a way.\"\nThe game was the fourth for the Bulls in five days and their second straight with injured guard Derrick Rose out of the lineup. As usual, Thibodeau wasn't in the mood for excuses after what he described as a \"low-energy\" first half.\n\"No, it was not (because of) four games in five nights,\" Brooks offered. \"We just played badly. I think they were on the same schedule we had.\"\nSpecifically, Thibodeau was concerned about a 45-38 rebound disadvantage. \"We have to do something to change it,\" he said.\nJoakim Noah had a team-high 11 rebounds but sat out the final 2:03 because of what Thibodeau called \"restrictions.\" Neither would say whether they were related to a minute's limitation or complications from Noah's left knee surgery six months earlier.\n\"I'm always concerned,\" Bulls coach Tom Thibodeau said when asked about Noah's health.\nThe Celtics seized control in the final 6 minutes of the second period, which they closed on a 27-8 run to take a 56-41 lead into the break. Avery Bradley scored nine and Turner added six more in the decisive stretch.\nBoston bolted to a 12-2 lead at the outset, as Chicago misfired on 10 of its first 11 field goal tries. After a time-out, Gasol sparked a comeback that saw his team connect on 10 of its final 13 shots in the period to take a 25-20 advantage.\nBut the Bulls couldn't sustain the momentum, and when Tyler Zeller scored off Bradley's lob pass midway through the third quarter, the Celtics took a 36-35 lead that wasn't seriously threatened until the final minute.\n\"We have to get a lot better,\" Stevens said. \"Obviously, we have to get healthy. It was the second night of a back-to-back for both teams. I don't think they played as well as they've played, and I thought we did some really good things, but we have to play more (complete) 48 minutes.\"\nTIP-INS\nCeltics: Turner filled in for Rondo, who remained in Boston to have screws removed from his surgically repaired left hand. Rondo could be available for the date with Oklahoma City on Wednesday night. Smart is expected to miss two-to-three weeks because of a sprained left ankle and bone bruise, which he suffered in a victory against Indiana on Friday night. \"(Smart) feels better, but it's going to take a couple weeks to get back,\" Stevens said. \"And that's hopeful, because sometimes those high ankle sprains are much more difficult than that.\"\nBulls: Rose sat out with sprains in both ankles. Veteran Kirk Hinrich started in his place but went scoreless in 13 minutes. \"Just out,\" Thibodeau said of Rose's status. \"He's not ready to go yet. We'll see where he is tomorrow.\"\nUP NEXT\nCeltics: Wednesday night versus Oklahoma City.\nBulls: Monday night versus Detroit.\nBETTER LATE THAN NEVER?\nGiven the abundance of injuries around the league thus far, Thibodeau said it was \"a good question\" whether star players would sit out long stretches of the regular season with the playoffs in mind. \"There's no way to tell until there's an extended study based on 20 years or so,\" he said. \"There's a school of thought that you have to prepare for the grind of the long season. When you study championship teams, you see that commitment to it.\"",
  "source": "espn_api",
  "crawled_at": 1764991732.341533
}