{
  "game_id": "0022301114",
  "espn_id": "401585742",
  "date": "Apr 04, 2024",
  "matchup": "LAC vs. DEN",
  "headline": "George, Clippers overcome Jokic's triple-double and hang on to beat Nuggets 102-100",
  "body": "LOS ANGELES -- — Paul George scored 28 points, James Harden added 20 and the Los Angeles Clippers overcame an early 17-point deficit to beat the Denver Nuggets 102-100 on Thursday night.\n\n\r\n              The Clippers snapped a five-game skid at home despite the absence of Kawhi Leonard, who missed his second straight game because of a sore right knee.\n\n\r\n              “All in all, it was a good win for us,” Harden said. “The first quarter we got down and didn't panic and the second quarter we made some shots. Defensively, we locked in.”\n\n\r\n              Nikola Jokic had 36 points, 17 rebounds and 10 assists — his 24th triple-double of the season — to lead Denver, but missed a potential winning 3-point attempt as time expired. Aaron Gordon added 18 points.\n\n\r\n              Denver had won two in a row and six of eight. \n\n\r\n              “Kawhi didn't play but they have multiple guys who can defend multiple positions. That's why they're so good,” Jokic said.\n\n\r\n              Nuggets coach Michael Malone was ejected with 7:54 remaining in the game. He came on the court to argue with the officials and was hit with two technical fouls.\n\n\r\n              The Clippers took a 75-70 lead into the fourth. They made 9 of 10 free throws while extending their lead to 90-79. \n\n\r\n              George returned for the Clippers and Jokic came back too, and the Nuggets outscored the Clippers 18-8 to trail 98-97.\n\n\r\n              Ivica Zubac made four straight free throws, but Jokic hit a 3-pointer that cut the Clippers' lead to 102-100.\n\n\r\n              Harden missed a jumper and the Nuggets called timeout with five seconds left. Guarded by P.J. Tucker, Jokic's 3-point attempt at the buzzer missed.\n\n\r\n              “It's really hard in those situations, especially because I think the ball was in the worst possible spot,” Jokic said. “Sometimes you make it, sometimes you don't.”\n\n\r\n              Led by nine points from George, the Clippers outscored the Nuggets 17-8 to open the third and take their largest lead, 70-57. Jokic had just four points in the period. \n\n\r\n              The Clippers got back into it in the second behind their bench, which outscored Denver 21-0 in the first half. After starting 0 for 5, Harden hit a 3-pointer and scored his first 14 points in the period to help the Clippers lead 53-49 at halftime.\n\n\r\n              The Nuggets raced to a 17-point lead to start the game. Jokic assisted on early baskets by his teammates before he finally scored for the first time with 5:18 left in the first.\n\n\r\n              Denver's Jamal Murray sat out with right knee inflammation.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Atlanta Hawks on Saturday night.\n\n\r\n              Clippers: Host Utah Jazz on Friday night in the second game of a back-to-back.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996534.847799
}