{
  "game_id": "0021600998",
  "espn_id": "400900393",
  "date": "Mar 13, 2017",
  "matchup": "LAL @ DEN",
  "headline": "Barton, Murray each score 22, Nuggets beat Lakers 129-101",
  "body": "DENVER --  Will Barton was back in the role of sparkplug for the Denver Nuggets.\n\nThe struggling sixth man scored 22 points, as did Jamal Murray, and the Nuggets beat the Los Angeles Lakers 129-101 on Monday night to match a season high with their third straight win.\n\nBarton had made just five of his previous 21 3-point tries, going 0 for 4 in his last game. He went 3 of 4 behind the arc Monday and 6 of 9 overall in his most productive outing since the All-Star break.\n\n\"We needed that man,\" said Nuggets coach Michael Malone, who gave Barton a pregame pep talk. \"Will Barton is a very important piece of our team and we all know that. Since the break, he hasn't found his groove and tonight to see him shoot the ball as well as he did and to be the playmaker he was, it was fantastic.\"\n\nBarton said he was buoyed by his pregame chat.\n\n\"That helped me a lot because I trust in my coaching staff and they believe in me,\" Barton said. \"They tell me I'm a big part of this team and they need me to play well. It does a lot for my confidence.\"\n\nDanilo Gallinari and Nikola Jokic each added 18 points for the Nuggets, who have a two-game lead over Portland for the No. 8 playoff seed in the Western Conference with 15 games to play.\n\nIvica Zubac had 25 points and 11 rebounds for the Lakers, who have lost 10 of their last 11. Jordan Clarkson, who got the start ahead of D'Angelo Russell, added 19 points and Brandon Ingram had 14.\n\n\"That's a good team over there. I've said that before,\" Lakers coach Luke Walton said. \"They're playing great right now. They're scoring the heck out of the ball and they have shooters all over the floor and big men that are brilliant passers.\"\n\nThe Lakers trailed by 32 points after a layup by Mason Plumlee early in the third quarter but managed to cut the deficit to 93-76 going into the final period, outscoring the Nuggets 29-14 over the last nine minutes of the third.\n\nBut the Nuggets quashed the Lakers' bid to make a game of it, starting the fourth with an 11-0 burst that included 3-pointers by Gallinari and Murray and rebuilt Denver's advantage to 28 points.\n\nThe Nuggets led by as many as 28 points in the first half. They put together a 15-0 run in the second quarter that helped them take a 67-43 lead at halftime.\n\nTIP-INS\n\nLakers: Clarkson started over Russell mainly for evaluation purposes. \"D'Angelo has been playing great when you look at his numbers, but we're 1-7 after the break and I want to see some other looks,\" Walton said before the game.\n\nNuggets: F Wilson Chandler missed the game because of a groin injury. Fellow forwards Kenneth Faried (low back) and Darrell Arthur (knee) also were out. ... Emmanuel Mudiay, supplanted a month ago by veteran Jameer Nelson as the starting point guard, has handled the demotion professionally and understands refining and polishing his game is the surest pathway to rejoining the lineup, Malone said.\n\nPRETTY PLAY\n\nSurrounded by three Lakers players after pulling down an offensive rebound, Jokic flipped a no-look, over-the-shoulder pass to Barton cutting through the lane, and the rangy forward threw down a reverse dunk that brought a gasp from the crowd and gave the Nuggets a 16-point lead with 7:07 left in the second quarter.\n\nUP NEXT\n\nLakers: Head to Houston to play the Rockets on Wednesday night.\n\nNuggets: Continue a three-game homestand by hosting the Los Angeles Clippers on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995368.789827
}