{
  "game_id": "0021501197",
  "espn_id": "400829084",
  "date": "Apr 10, 2016",
  "matchup": "MIL @ PHI",
  "headline": "Middleton scores 36, lifts Bucks past 76ers 109-108 in OT",
  "body": "PHILADELPHIA --  Khris Middleton found some time off was the tonic needed to help him go off on the Philadelphia 76ers.\n\nMiddleton returned from a three-game absence and scored 36 points and John Henson had 18 points and 10 rebounds to lead the Milwaukee Bucks to a 109-108 overtime win over the 76ers on Sunday.\n\n\"I was joking with him, maybe we should give him more time off so he'd have that type of energy,\" Bucks coach Jason Kidd said.\n\nJabari Parker added 15 points and Giannis Antetokounmpo had 14 to help the Bucks hold off the Sixers in OT. Middleton, who had been out with a left thigh injury, made 14 of 24 shots from the floor and all seven free throws.\n\n\"I felt good, I was able to get into a good rhythm,\" Middleton said.\n\nThe Bucks needed all 14 of his buckets against the plucky Sixers.\n\nIsh Smith hit a 3 and Hollis Thompson buried a 26-footer that pulled the Sixers to 109-108. The Sixers would miss three shots on their final possession.\n\nSmith led the Sixers with 22 points and Nerlens Noel had 18 points and 13 rebounds.\n\nThe Sixers made only 13 of their franchise-record 46 3-point attempts.\n\nThe Bucks wasted an 18-point lead in regulation and failed to put the game away in the fourth quarter against the worst team in the NBA.\n\nRobert Covington's driving layup pulled the Sixers within two at 92-90 with 5:44 left and gave the enthusiastic crowd of 16,627 at the home finale a rare reason for optimism. Smith found Noel inside the paint for a bucket that kept it a two-point game, 94-92.\n\nSmith finally tied it for the first time with a layup with 2:20 left.\n\nSixers fans stood and waved their arms as the in-house DJ cranked tunes and shirts were fired into the crowd.\n\n\"We can't thank them enough for accepting the route that we have been on the past three years,\" coach Brett Brown said. \"I'm just blown away at the city at how good, and in some ways, forgiving, they have been to support us the way that they do. That does not go unnoticed.\"\n\nSmith had a bigger bucket ahead, this one a dunk that put Philadelphia up 98-96, its first lead of the game.\n\nBut the lead was short-lived when a goaltending call against Noel tied it at 98 and sent the game into overtime.\n\nTIP-INS\n\nBucks: The Bucks beat the Sixers for the ninth straight time, their longest active winning streak against any opponent. ... Milwaukee snapped a three-game losing streak.\n\nSixers: The Sixers finished 7-34 at home. ... Former Philadelphia 76ers great Allen Iverson was presented with a City of Philadelphia Honorary Resolution for being elected to the Hall of Fame class of 2016. ... The Sixers also honored the NCAA national champion Villanova Wildcats. ... Noel turned 22.\n\nUNDER NEW MANAGEMENT\n\nThe Sixers hired Bryan Colangelo as team president. The Sixers also announced Sunday that his father, Jerry Colangelo, has relinquished his role as chairman of basketball operations and will remain as special adviser to ownership. Bryan Colangelo takes over days after Sam Hinkie quit as general manager via a 13-page manifesto to ownership. He previously worked for the Toronto Raptors and Phoenix Suns.\n\nTeam owner Josh Harris said there are \"no plans\" to hire a general manager, leaving front office responsibility in Colangelo's hands.\n\nCRAWFORD HONORED\n\nThe Sixers honored Philadelphia native Joey Crawford for his nearly four decades as an NBA official. Crawford officiated more than 2,500 games in the regular season and another 344 in the playoffs. He has worked more postseason and NBA Finals games than any current official.\n\nBRAND AWARENESS\n\nHis career seemingly over, Elton Brand returned to play 17 games for the Sixers.\n\nBrand was the first overall pick out of Duke in the 1999 NBA draft by the Chicago Bulls and was named Rookie of the Year.\n\nThe 37-year-old Brand will likely end his career where it all began: Wednesday night at Chicago.\n\n\"I think this is going to be it,\" Brand said. \"We'll see what happens. The travel is tough, having young kids.\"\n\nUP NEXT\n\nBucks: at Orlando on Monday.\n\nSixers: at Toronto on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764993995.517261
}