{
  "game_id": "0021800688",
  "espn_id": "401071364",
  "date": "Jan 20, 2019",
  "matchup": "CHA @ IND",
  "headline": "Pacers keep rolling with 120-95 victory over Hornets",
  "body": "INDIANAPOLIS --  Darren Collison threw the early scoring punches. Victor Oladipo delivered the decisive second-half flurry.\n\nTogether, the Indiana Pacers' starting guards were a knockout combination.\n\nOladipo scored 16 of his 21 points in the second half, Collison finished with 19 points and nine assists and surging Indiana pulled away from the Charlotte Hornets 120-95 on Sunday for their fourth win in five games.\n\n\"Me, Bojan (Bogdanovic), Vic, we were all being aggressive on the pick-and-roll,\" Collison said. \"When all three of us are aggressive, it's tough to beat us.\"\n\nThe Pacers have proven it by going 11-3 over the past month and improving to 16 games above .500 for the first time since the end of 2013-14.\n\nIt's not by happenstance, either. Coach Nate McMillan has repeatedly challenged his players to move the ball and stay aggressive on offense while confounding opponents with their ability to stay in front of the ball on defense.\n\nIndiana has used that blueprint to win its last four games by 86 points, all by at least 12.\n\nCharlotte fell into the same trap as the other teams -- falling behind early and trying to play catch-up against the league's top scoring defense.\n\nKemba Walker led the Hornets with 23 points but didn't get enough from a supporting cast that was held in check. Malik Monk finished with 11 points off the bench while Bismack Biyombo and Jeremy Lamb each scored 10 as the Hornets' three-game winning streak ended.\n\n\"What's kept us in games in the last few games is our defense. Tonight, it didn't,\" Charlotte coach James Borrego said. \"They played well. They shot well.\"\n\nIt didn't take long for the Pacers to start pulling away as Collison scored 11 in the first quarter to help the Pacers jump to a 32-16 lead.\n\nCharlotte fought back with a 12-2 spurt to get within 34-28.\n\nThen Indiana reasserted itself by rebuilding a 45-32 lead, extending the margin to 17 and fending off the Hornets' second-half charges thanks largely to Oladipo.\n\nWhen Miles Bridges made his second straight 3 late in the third to get Charlotte within 77-71, Oladipo answered with a 16-foot pull-up jumper to start a 7-0 run. Indiana sealed it when Tyreke Evans scored five points in another 7-0 run, which made it 99-81 with 6:46 left.\n\n\"We just tried to prepare ourselves defensively, making sure it was tougher for them than it was in the last game,\" Oladipo said, referring to a 26-point loss in Charlotte in November. \"Collectively, we did awesome.\"\n\nTIP-INS\n\nHornets: Walker has topped the 20-point mark 33 times this season but was assessed a technical foul with 1:08 left in the first quarter. ... Biyombo also had 12 rebounds for his third double-double this season. ... Walker and Lamb combined to score 14 of Charlotte's first 16 points. ... Former Indiana University star Cody Zeller did not play because an injured right hand. ... The Hornets were 12 of 35 on 3s.\n\nPacers: Myles Turner had nine points, all on 3s, 16 rebounds and three blocks. ... Bogdanovic and Domantas Sabonis each scored 16. Evans had 14. ... Nate McMillan earned his 121st victory as the Pacers' coach, tying Jim O'Brien for ninth on the franchise's NBA victories list. ... The Pacers honored the late Jimmy Rayl with a moment of silence before the game. Rayl was a two-time All-American at Indiana University and was the state's 1959 Mr. Basketball Award winner. School officials announced Rayl died Sunday at age 77.\n\nTHEY SAID IT\n\nHornets: \"This isn't anything to go into the tank about. Indiana is a very, very good team and they're really good at home,\" Marvin Williams said after scoring nine points.\n\nPacers: \"We did a pretty good job containing Kemba Walker in the pick-and-roll and any time you can slow him down, you slow down the rest of the team as well,\" Turner said.\n\nUP NEXT\n\nHornets: Visit Memphis, where they have won three straight, on Wednesday.\n\nPacers: Will try to avoid a three-game season sweep when Toronto visits Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994384.338562
}