{
  "game_id": "0021500009",
  "espn_id": "400827896",
  "date": "Oct 28, 2015",
  "matchup": "TOR vs. IND",
  "headline": "DeRozan scores 25, Lowry has 23, Raptors beat Pacers 106-99",
  "body": "TORONTO --  DeMar DeRozan felt great about sharing the court with Paul George again. He also enjoyed the solid start for his Toronto Raptors.\n\nDeRozan scored 25 points, and the Raptors beat George and the Pacers 106-99 on Wednesday night in the first game of the season for each team.\n\nJonas Valanciunas had 21 points and 15 rebounds for Toronto, and Kyle Lowry scored 23 points. DeMarre Carroll had 14 in his Raptors debut.\n\nToronto has won its last five games against Indiana.\n\nGeorge missed all but six games last season after breaking his right leg while playing in a scrimmage with Team USA before last year's World Cup. He was 4 for 17 from the field against the Raptors, but finished with 17 points, 12 rebounds and eight assists.\n\n\"I was very comfortable, felt great,\" George said. \"It's the best I've felt all preseason to now.\"\n\nDeRozan, a former teammate with the US national team, said he was glad to see George.\n\n\"I was in that game when he got hurt,\" DeRozan said. \"Just to see him back looking like his old self is definitely great.\"\n\nGeorge Hill scored 19 points for the Pacers, who led by 16 in the second quarter but couldn't hold on. C.J. Miles had 18.\n\nIndiana coach Frank Vogel praised George for not trying to do too much on a night when he was struggling with his shot.\n\n\"He was good at finding people,\" Vogel said. \"Sometimes you're going to have a tough shooting night and you've got to impact the game in other ways. I thought he did that.\"\n\nToronto outscored Indiana 69-54 in the second half.\n\n\"I thought we lost focus in the third quarter,\" Vogel said.\n\nToronto's Terrence Ross opened the fourth with a four-point play and Bismack Biyombo followed with a three-point play as the Raptors scored the first eight points of the quarter to take an 80-68 lead.\n\nIndiana battled back to take a 95-93 lead with 2:18 left. Monta Ellis scored six straight points for the Pacers, including a pair of free throws, George added a jumper off an inbounds pass and Ian Mahinmi added a key layup.\n\nValanciunas answered with a tip-in and DeRozan made a three-point play as Mahinmi fouled out, putting the Raptors up 98-95 with 1:29 remaining.\n\nGeorge was fouled as he banked in a jumper at the other end, but missed the free throw, with DeRozan grabbing the rebound. It was George's only miss at the line in 10 attempts.\n\n\"That one definitely hurt,\" George said. \"It would have changed how we closed this game out.\"\n\nAfter a Toronto timeout, DeRozan made a pull-up jumper to give the Raptors a three-point edge with 50 seconds left. Toronto closed it out by making six of eight at the line.\n\nWASH OUT\n\nPlans to hold a party in the square outside Air Canada Centre where fans could watch the game on a big screen were cancelled after a powerful storm drenched Toronto. A rainfall warning for the city was lifted in late afternoon but winds were expected to remain heavy overnight.\n\nSTAR POWER\n\nBlue Jays pitchers Aaron Sanchez and Marcus Stroman, and second baseman Ryan Goins attended the game. Maple Leafs president Brendan Shanahan watched from a courtside seat.\n\nBEYOND BORDERS\n\nToronto's seven international players are the most in the NBA. Besides Canadians Anthony Bennett and Cory Joseph, the Raptors have players from Argentina (Luis Scola), Brazil (Bruno Caboclo and Lucas Nogueria), Democratic Republic of Congo (Biyombo), and Lithuania (Valanciunas).\n\nHOW HE DID IT\n\nDressed in a red Valanciunas jersey and Raptors warmup top, singer Montell Jordan performed his 1995 hit `This Is How We Do It' during the halftime break.\n\nTIP-INS\n\nPacers: Indiana's last win over Toronto was an 86-79 victory at Indianapolis on Jan 7, 2014. ... Hill and George were whistled for technical fouls in the fourth.\n\nRaptors: Toronto went 7 for 15 at the free-throw line in the first half. ... The teams combined for 11 turnovers in the first quarter, six by Toronto.\n\nUP NEXT\n\nPacers: Host the Grizzlies on Thursday night.\n\nRaptors: Visit the Celtics on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994777.779407
}