{
  "game_id": "0021800416",
  "espn_id": "401071097",
  "date": "Dec 13, 2018",
  "matchup": "LAL @ HOU",
  "headline": "Harden's 50-point triple-double leads Rockets over Lakers",
  "body": "HOUSTON --  The Houston Rockets were clinging to a lead over the Los Angeles Lakers in the fourth quarter on Thursday night when James Harden told coach Mike D'Antoni he needed to come out for a bit to rest -- something the reigning MVP never does.\n\nD'Antoni was perfectly happy to fulfill Harden's request, and the move could not have worked better for the Rockets.\n\nHarden returned with about five minutes left to take over the game, scoring 11 points during a big run to cap a 50-point, 10-rebound and 11-assist night in a 126-111 victory.\n\n\"You play 45, 46 minutes, it's difficult on anybody in this league,\" Harden said. \"The guys are so talented and great, so that little period that I had to rest, came back in re-energized and ready to make good plays.\"\n\nChris Paul was surprised when Harden asked for the break.\n\n\"It's very rare that James or any of us would take ourselves out,\" Paul said. \"But ... I think that gave him that quick little breather that he needed to come in and finish it.\"\n\nHarden grabbed his 10th rebound with less than 90 seconds left to give him his second triple-double this season and the 37th of his career.\n\nLeBron James finished with 29 points for the Lakers, who had won their previous two games.\n\nJames was unhappy that the Lakers sent Harden to the line 19 times, where he only missed once.\n\n\"You can't put him on the line ... he's already talented,\" James said. \"He can put the ball in the hole multiple ways. He can drive, step-back 3s and you (can't) give him easy points.\"\n\nHouston's lead was three after Kyle Kuzma's soaring dunk, but Harden was fouled on a 3-pointer and made all three free throws to make it 112-106.\n\nHarden then made 3-pointers on consecutive possessions to push the lead to 12 and cause Lakers coach Luke Walton to call a timeout. James was in Harden's face on the second one and Harden fell to the court as the ball rolled around the rim for a couple of seconds before dropping in.\n\n\"He's a superstar and he makes tough shots,\" Walton said. \"But that whole thing started with us giving him three free throws.\"\n\nJames added a dunk before Clint Capela and Harden made consecutive baskets to compete the 13-2 run and make it 122-108.\n\nIt was the first meeting between these teams since Paul and Rajon Rondo got into a fight on Oct. 20 that led to suspensions for both players and Brandon Ingram. There wasn't an altercation this time around in a game where Rondo sat out as he recovers from surgery to repair a broken right hand. But there was a spate of technical fouls late in the third quarter that led to the ejection of Nene.\n\nHe was called for a foul after being knocked to the ground trying to defend Kuzma as he drove to the lane. He yelled at officials and received a technical foul.\n\nKuzma made his free throws but Kentavious Caldwell-Pope missed the technical shot.\n\nNene made a hook shot before fouling Kuzma again on the next possession. He continued to scream at officials and was hit with a second technical foul and was ejected. Harden attempted to calm him down, but Nene continued to be agitated until he was escorted to the locker room.\n\nKuzma made all three foul shots and added a 3-pointer with Harden in his face after a 3 by Harden to leave the Lakers up 88-87 with 9.9 seconds left in the quarter.\n\nKuzma was called for a foul after that and Walton got a technical for arguing about that call.\n\nHarden made the technical shot and Paul added two more free throws to leave Houston up 90-88 after three.\n\nTIP-INS\n\nLakers: Kuzma received a technical foul in the first quarter for arguing about a foul call. ... Brandon Ingram missed his fourth straight game with a sprained left ankle. ... Kuzma had 24 points to give him 20 or more points in a career-best six straight games.\n\nRockets: Brandon Knight played in his first game since Feb. 15, 2017, after recovering from surgery to repair a torn left anterior cruciate ligament. He came in with about four minutes left in the first quarter and played about four minutes with one assist and one rebound. ... James Ennis sat out with a strained right hamstring.\n\nMORE HARDEN\n\nThursday was Harden's fourth 50-point triple-double, which is the most in NBA history. It's his second game this season with at least 50 points and 10 assists and he joins Wilt Chamberlain (19) as the only players in NBA history to have more than one 50-point game against the Lakers. He scored 51 against them last season.\n\nUP NEXT\n\nLakers: Visit Charlotte on Saturday night.\n\nRockets: Visit Memphis on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995015.475018
}