{
  "game_id": "0022300199",
  "espn_id": "401584827",
  "date": "Nov 15, 2023",
  "matchup": "POR vs. CLE",
  "headline": "Mitchell has 34 points and Cavaliers end road trip with 109-95 win over Portland",
  "body": "PORTLAND, Ore. -- — Donovan Mitchell scored 34 points and the Cleveland Cavaliers handed the Portland Trail Blazers their fifth straight loss with a 109-95 victory on Wednesday night. \n\n\r\n              Evan Mobley added 21 points and 12 rebounds, and the Cavaliers finished 2-2 on their nine-day western road trip. \n\n\r\n              “I feel we definitely made a step forward tonight, we played pretty consistent throughout the entire game,” Mobley said. “We've just got to keep carrying that into each game, over and over again.”\n\n\r\n              Jerami Grant led shorthanded Portland on the second night of a back-to-back with 17 points and Duop Reath, a center on a two-way contract, came off the bench to score 16 points. \n\n\r\n              Cleveland (5-6) led 83-75 to start the fourth quarter and pushed the lead to 99-81 on Mitchell's pullup 3-pointer. The Cavaliers led by as many as 18 points in the period. \n\n\r\n              Both teams were struggling with injuries. The Cavaliers were without guard Darius Garland, who strained his neck in the second half of Monday’s 132-120 loss in Sacramento.\n\n\r\n              Cleveland was already missing backup point guard Ty Jerome, who has missed nine games with an ankle sprain, and Isaac Okoro, who has been bothered by a knee injury.\n\n\r\n              The injuries are contributing to Cleveland's early season inconsistency, coach J.B. Bickerstaff said. \n\n\r\n              “It’s early,\" he said. \"I think that’s one of those things where we have to live in basketball reality. We missed so much time in training camp and the beginning of the season with key players out, and then you’re working those players back in and adding players, you’re changing the dynamics of the things you have typically done in the past. You know, it takes time to get it right.”\n\n\r\n              The Blazers (3-8) announced over the weekend that rookie guard Scoot Henderson, the third overall pick in the NBA draft, would miss up to three more weeks after an MRI revealed a bone bruise in addition to a sprained right ankle. \n\n\r\n              Portland was already missing guard Anfernee Simons with a torn ligament in his thumb, Malcolm Brogdon with a sore hamstring and Robert Williams III who is out for the season after a knee injury.\n\n\r\n              “We're not, I guess, healthy enough to survive tough shooting nights from our top guys. And then I thought on the other end, and that was something we were concerned about, was just the size,\" Blazers coach Chauncey Billups said. “We couldn't contend for the most part. They crushed us on the glass, kind of locked down the point. So it was tough.” \n\n\r\n              Cleveland led by as many as 14 points in the opening quarter but Portland closed the gap and went ahead 34-32 on Grant's layup. \n\n\r\n              It didn't last long. The Cavaliers pulled back in front 46-38 on Donovan Mitchell's 3-pointer and they led 55-47 at the half. \n\n\r\n              Cleveland stretched the lead to 67-53 in the third quarter on Georges Niang's 3-pointer.\n\n\r\n              “Not that we’re being picky, but we scrapped it out at the end of a long road trip which can be difficult. I thought we did things well in spurts. And it's over with. We get to go home and see our families tomorrow,” Bickerstaff said. \n\n\r\n              It was Portland's first game back at home after an 0-3 road trip, capped by a 115-99 loss to the Utah Jazz on Tuesday. \n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host the Detroit Pistons in the In-Season Tournament. \n\n\r\n              Trail Blazers: Host the Los Angeles Lakers in the In-Season Tournament. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996403.3081422
}