{
  "game_id": "0022000628",
  "espn_id": "401307414",
  "date": "Mar 18, 2021",
  "matchup": "PHX vs. MIN",
  "headline": "Edwards, KAT both top 40 points, T'wolves stun Suns 123-119",
  "body": "PHOENIX -- — Rookie Anthony Edwards scored a career-high 42 points, Karl-Anthony Towns added 41 and the Minnesota Timberwolves suddenly look like a respectable NBA basketball team.\n\n\r\n                    The Timberwolves used the dominant Edwards-KAT combo and a fourth-quarter comeback to stun the Phoenix Suns 123-119 on Thursday night. They've won three of five games since the All-Star break.\n\n\r\n                    “Our future success starts now,” Timberwolves coach Chris Finch said.\n\n\r\n                    The Timberwolves still have the worst record in the NBA at 10-31 but have played much better over the past couple weeks. Edwards and Towns carried Minnesota in this one, pouring in points from all over the floor.\n\n\r\n                    After the game, Edwards gave away his jersey to his “blood brother” who was at the game and gave his shoes to some other fans. The 19-year-old was grinning from ear to ear as he walked off the court. \n\n\r\n                    “We’re winning,\" he said. \"It’s always happy when we’re winning.”\n\n\r\n                    Edwards, who was the No. 1 overall pick out of Georgia last summer, made 15 of 31 shots. Towns was even more efficient, making 15 of 24 shots, including 5 of 7 3-pointers. Juancho Hernangomez dunked with 2.5 seconds left to seal it.\n\n\r\n                    It was just the second time in Minnesota's franchise history that two players scored 40 points in the same game.\n\n\r\n                    “Unbelievably special,\" Finch said. \"They played pretty efficient. KAT almost has a triple double. They were carrying us.”\n\n\r\n                    Jevon Carter hit a 3-pointer just before the third quarter buzzer to give the Suns a 91-83 lead. But the T'wolves kept the game tight, and Towns tied it at 107 after a 3-pointer with less than five minutes remaining. Towns also added 10 rebounds and eight assists.\n\n\r\n                    These were the kinds of performances the T'Wolves envisioned when they selected Edwards, who has a sweet jumper and elite athleticism that led to a few highlight-reel dunks on Thursday. The 6-foot-4 guard is averaging 30.6 points over his last five games.\n\n\r\n                    Devin Booker led the Suns with 35 points on 13-of-22 shooting. Phoenix lost for just the fifth time in its last 23 games. Chris Paul and Mikal Bridges both added 17 points.\n\n\r\n                    “Our game plan discipline wasn’t at a high level on defense and we were sloppy on offense,” Suns coach Monty Williams said. “When a team comes into your home and scores 123 points and two guys go for 83 points, that is a lack of being ready.”\n\n\r\n                    The Suns got off to a slow start, but back-to-back 3s from Dario Saric and Booker tied it at 25 by the end of the first quarter. Phoenix pulled ahead 58-53 by halftime.\n\n\r\n                    Booker had 21 points before the break on 7-of-10 shooting from the field. Edwards had 22 points in the first half for the Timberwolves, including a pair of powerful dunks after slicing through the Suns' defense.\n\n\r\n                    “We didn’t come out the way we should have,” Bridges said. \"We played down to our opponent, looking at their record. They played harder than us. They have talented guys and we just didn’t come out and execute our game plan. \n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Edwards and Towns combined to score 41 of the team's 53 points in the first half. ... Hernangomez had 14 points off the bench, and Naz Reid added 10.\n\n\r\n                    Suns: F Cam Johnson missed his fifth straight game in the league's health and safety protocol. ... F Torrey Craig was acquired from the Bucks in a trade announced Wednesday. Craig wasn't available for Thursday's game. ... Booker was honored before the game for winning the NBA's Western Conference Player of the Month in February. ... Deandre Ayton fouled out with 1:10 left in the game. He had 14 points and seven rebounds.\n\n\r\n                    UP NEXT\n\n\r\n                    The Suns and T'wolves meet again in Phoenix on Friday night.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt at www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997746.0967941
}