{
  "game_id": "0022000833",
  "espn_id": "401307628",
  "date": "Apr 14, 2021",
  "matchup": "ORL @ CHI",
  "headline": "Ennis, Carter Jr. come up big as Magic beat Bulls 115-106",
  "body": "CHICAGO -- — James Ennis scored 22 points, Wendell Carter Jr. added 19 points and 12 rebounds, and the Orlando Magic snapped a six-game losing streak by beating the Chicago Bulls 115-106 on Wednesday night despite big performances by Zach LaVine and Nikola Vucevic.\n\n\r\n                    The Magic outscored Chicago by 20 in the third quarter to turn a one-point lead into a 93-72 advantage and hung on after Chicago cut it to 104-98. Carter scored on a tip-in and Michael Carter-Williams dunked after stealing a pass from LaVine to make it a 10-point game with 3:12 remaining.\n\n\r\n                    “I felt like we were due for a win,” Ennis said. \n\n\r\n                    LaVine scored 30. Vucevic had 29 points and 11 rebounds in his first game against the Magic since they dealt the two-time All-Star to Chicago at the deadline. But the Bulls fell to 3-8 since the trade.\n\n\r\n                    Ennis shot 5 of 6 from 3-point range. He also scored 12 points in the third.\n\n\r\n                    Carter, acquired in the Vucevic trade, came up big in his first game against the team that drafted him with the No. 7 overall pick in 2018. For him, that deal was “absolutely” a chance for a fresh start.\n\n\r\n                    “Being in Orlando, it’s an opportunity for me to showcase my game, an opportunity for me to show that I impact winning,” Carter said. ”It's a huge opportunity for me coming to Orlando. I'm gonna do everything I can to flourish.\"\n\n\r\n                    Gary Harris and Carter-Williams scored 15 apiece for the Magic.\n\n\r\n                    SKID CONTINUES\n\n\r\n                    Vucevic, who played 8 1/2 seasons with the Magic, made five 3-pointers to finish one shy of his career high.\n\n\r\n                    LaVine scored 21 in the fourth quarter. Daniel Theis finished with 16 points, but the Bulls dropped their fourth in a row.\n\n\r\n                    “Guys are frustrated,” LaVine said. “We know we're better and we're supposed to be beating some of these teams. Everybody wants a win. We went on a little winning streak and then we reverted back down to losing. Guys get frustrated. You'd rather have guys frustrated than not. But frustration has to turn into something on the court and we have to put it together sooner than later. ... If we're talking a big game, we have to go out there and walk it, too.”\n\n\r\n                    BREAKING AWAY\n\n\r\n                    Vucevic clearly came to play against his former team, scoring 16 in the first half. He nailed all four 3s, hitting one on the game's opening possession and burying a buzzer beater to cut it to 54-53 after Chicago trailed by as much as 12. \n\n\r\n                    But the Magic dominated Chicago 39-19 in the third with Ennis making three 3s in the period.\n\n\r\n                    “We made a huge run in the third quarter,” Carter said. “We got up by 20 and we understood that their offensive players were gonna take and make big shots down the stretch. We weathered their run and we made great adjustments.”\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: C Mo Bamba (bruised left hip) was held out after he exited Monday's loss to San Antonio. The third-year pro set career scoring highs in two of the three games before that. ... Coach Steve Clifford described Vucevic as a player who leaves a “lasting impression” on teammates and a “role model” for younger players because of his dedication on the court and in the weight room. He also said Chicago “will be a great place\" for Vucevic. “He's very upbeat, very excited about his teammates, really likes them, loves Billy (Donovan), who I think will be a great coach for him,” said Clifford, who visited with Vucevic before the game.\n\n\r\n                    Bulls: Vucevic's only other game against the Magic was during his 2011-12 rookie season with Philadelphia. ... Garrett Temple played 10 minutes after missing the previous eight games because of a strained right hamstring. “He's a great, great competitor,” Donovan said. “He's a team guy. And he'll do whatever he can to help.”\n\n\r\n                    UP NEXT \n\n\r\n                    Magic: Visit Toronto in Tampa, Fla., on Friday.\n\n\r\n                    Bulls: Host Memphis on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997576.893047
}