{
  "game_id": "0022400650",
  "espn_id": "401705216",
  "date": "Jan 27, 2025",
  "matchup": "HOU @ BOS",
  "headline": "Thompson hits game-winning shot and scores 33 points as Rockets rally past Celtics 114-112",
  "body": "BOSTON -- — Amen Thompson hit a game-winning floater with 0.7 seconds left and finished with 33 points to lead the Houston Rockets to a 114-112 victory over the Boston Celtics on Monday night. \n\n\r\n              Dillon Brooks shot 10 of 15 from 3-point range and led Houston with 36 points. The Rockets won for the ninth time in 11 games.\n\n\r\n              Jaylen Brown had 28 points for the Celtics, and Jayson Tatum added 19 after a scoreless first half. Luke Kornet had 18 and Kristaps Porzingis scored 17 to go with eight rebounds.\n\n\r\n              Rockets leading scorer Jalen Green was held to 12 points.\n\n\r\n              Thompson broke free off an inbounds play and went in for an easy dunk, pushing Houston in front 112-110. But after a timeout, Tatum got the ball near midcourt and drove in for the tying layup with 5.3 seconds left. \n\n\r\n              Brooks’ 10th 3-pointer gave the Rockets a 108-106 lead with 1:39 to play. \n\n\r\n              The Celtics easily won the first meeting between the teams in Houston on Jan. 3.\n\n\r\n              Houston coach Ime Udoka said before the game that forward Cam Whitmore was “sick and back at the hotel.”\n\n\r\n              Takeaways\r\n              Rockets: Coming off their second win over East-leading Cleveland in a week, the surprising Rockets rallied after falling behind by 12 early in the final quarter.\n\n\r\n              Celtics: With center Al Horford a very late scratch after going through warmups, Derrick White (bruised right shin) and Sam Hauser (right hip) all out, coach Joe Mazzulla mixed and matched some unusual lineups by going deep into the bench.\n\n\r\n              Key moment\r\n              Thompson took the ball just outside the 3-point line, drove and hit his winning shot over Brown.\n\n\r\n              Key stat\r\n              Tatum missed all five shot attempts in the opening half.\n\n\r\n              Up next\r\n              The Rockets are at the Atlanta Hawks on Tuesday, the third stop on a four-game trip. The Celtics host the Chicago Bulls on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997378.1811259
}