{
  "game_id": "401810131",
  "espn_id": "401810131",
  "date": "Nov 23, 2025",
  "matchup": "ATL vs CHA",
  "headline": "Jalen Johnson scores 28 and lifts Hawks over Hornets 113-110",
  "body": "ATLANTA -- — Jalen Johnson had 28 points, 11 assists and eight rebounds and the Atlanta Hawks won for the seventh time in nine games with a 113-110 victory over the Charlotte Hornets on Sunday night.\n\n\r\n              Nickeil Alexander-Walker had 23 points and five rebounds, and Dyson Daniels added 22 points and nine rebounds for the Hawks. Onyeka Okongwu scored 20 points.\n\n\r\n              The Hornets, who saw their losing streak extended to six games, were led by rookie Kon Knueppel with 28 points. He set a Hornets rookie record with seven made 3-pointers.\n\n\r\n              The Hornets trailed 112-110 with 11 seconds left. Alexander-Walker stripped Knueppel on a drive to the basket and was immediately fouled. He made 1 of 2 free throws. The Hornets had a chance at a game-tying three-pointer, but Miles Bridges shot an air ball under heavy pressure at the buzzer.\n\n\r\n              Johnson has eight straight games of at least 15 points, five rebounds and five assists, setting a franchise record.\n\n\r\n              The Hornets entered the game shooting an NBA-best 41.5%, but were held to 31.8% (14 for 44).\n\n\r\n              Knueppel has shot at least 40% from 3-point range in six straight games and hit 16 of 23 in his last two. He entered the game leading all rookies in scoring at 18.8 points per game and has seven games in November with at least 24 point.\n\n\r\n              The Hawks had a nice burst at the end of a tight third quarter sparked in part by Mouhamed Gueye. The big man had a dunk off an assist from Johnson, a blocked shot of Collin Sexton (22 points) and a pretty baseline drive early in the fourth that gave the Hawks contributions from deep in the rotation. The Hawks put together a 16-2 run over the end of the third and beginning of fourth quarters, but the Hornets would not go away. \n\n\r\n              Up next\r\n              The Hornets host the New York Knicks on Wednesday.\n\n\r\n              The Hawks play at Washington on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042680.62781
}