{
  "game_id": "0021900176",
  "espn_id": "401160818",
  "date": "Nov 16, 2019",
  "matchup": "IND vs. MIL",
  "headline": "Antetokounmpo, Bucks trample Pacers 102-83",
  "body": "INDIANAPOLIS --  Giannis Antetokounmpo rarely makes three 3-pointers in a game.\n\nEven on his way to the MVP award last season, the Milwaukee Bucks' 6-foot-11 superstar reached that mark only six times.\n\nHe did it Saturday night in a 102-83 rout of the Indiana Pacers, finishing with 26 points, 13 rebounds and six assists.\n\n\"I think he's getting more and more comfortable with the 3-ball,\" Milwaukee coach Mike Budenholzer said. \"The ball's in his hands a lot, so he's shooting them off the dribble. He continues to attack at a high rate, so we just want him to keep growing, keep letting it fly.\"\n\nA shaky long-range shooter who was only 25.6% on 3s in the 2018-19 campaign, Antetokounmpo is 16 of 50 -- 32% -- from behind the arc in the Bucks' 9-3 start.\n\nWith length and speed that make him almost unstoppable going to the basket, Antetokounmpo hopes to force defenders to respect the threat of a 3.\n\n\"I haven't seen it yet,\" he said. \"Eventually it might change, or it might not. Pretty much wide-open every shot I take from the top of the key or the wing.\"\n\nHis 3 from the top of the key at the first-quarter buzzer Saturday gave Milwaukee a 26-22 lead and set the tone on a night the Pacers endured their worst shooting performance of the season.\n\nBrook Lopez, who had 15 points and eight boards, blocked five shots to help limit Indiana to a season-low 32% from the field.\n\nMalcolm Brogdon, after joining Indiana in a July sign-and-trade deal with Milwaukee, missed his first chance at facing his former team. The early All-Star candidate developed a sore back during Friday's 111-102 loss at Houston.\n\nThe good news for Indiana was the return of Myles Turner. Playing his first game since Oct. 30, Turner had 16 points, 11 rebounds and four blocks.\n\n\"I really don't know how to answer that,\" Turner said when asked if any pain lingers from his right ankle sprain. \"I'm still battling a little bit, but I felt good enough to play. That's all that matters.\"\n\nThe Bucks shot 45%. They went ahead by 15 points in the second quarter. Indiana then cut its 49-36 halftime deficit to 71-63 entering the fourth quarter.\n\nThe Bucks restored their lead by opening the final period on a 10-2 run, including a pair of spot-up 3-pointers from Sterling Brown in the left corner. Brown finished with 10 points and six rebounds, complementing Donte DiVinzenco (14 points) and Eric Bledsoe (10 points, five assists).\n\nThe only drama thereafter was that Antetokounmpo's run of consecutive 30-point, 10-rebound games ended at six. It was the NBA's longest such streak since Shaquille O'Neal's 11 in 2001.\n\nBudenholzer credited Indiana for playing hard \"no matter who's out there for them.\"\n\nBackup point guard T.J. McConnell (sore right groin) was a late scratch, joining Brogdon, All-Star Victor Oladipo and sixth man Jeremy Lamb on Indiana's crowded inactive list.\n\n\"We're just having some bad breaks,\" coach Nate McMillan said.\n\nTIP-INS\n\nBucks: Antetokounmpo drew oohs and ahs on a highlight-reel dunk early in the second quarter. He started out dribbling beyond the 3-point line, drove left around JaKarr Sampson, picked up the ball above the foul line and soared for a left-handed jam over the outstretched arms of the trailing Sampson and help defender Goga Bitadze. ... Starting small forward Khris Middleton (left thigh contusion) missed his second straight game.\n\nPacers: The Pacers were outscored 34-6 in the paint in the first half and 56-26 for the game. ... The team's video board showed Travis Best in attendance. Best averaged 8.9 points as the backup point guard on the Pacers' 2000 Eastern Conference championship team.\n\nUP NEXT:\n\nBucks: Play at Chicago on Monday night as Milwaukee looks to extend a seven-game win streak against the Bulls.\n\nPacers: Play at Brooklyn on Monday night. They won there 118-108 on Oct. 30.\n\n---\n\nFor more AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995878.550817
}