{
  "game_id": "0022301093",
  "espn_id": "401585721",
  "date": "Apr 02, 2024",
  "matchup": "PHI vs. OKC",
  "headline": "Joel Embiid scores 24 points in his return from knee surgery. Sixers top Thunder 109-105",
  "body": "PHILADELPHIA -- — Joel Embiid put Philadelphia ahead with four free throws in the final 40 seconds and finished with 24 points in his first game in nine weeks following knee surgery, leading the 76ers to a 109-105 win over the Oklahoma City Thunder on Tuesday night.\n\n\r\n              Embiid added seven assists and six rebounds in nearly 30 minutes — but most important, he brought the confidence that the Sixers can salvage their season and make a postseason run with last season's MVP in the lineup.\n\n\r\n              Embiid was congratulated by Hall of Famer Allen Iverson after the game.\n\n\r\n              “I thought I was pretty bad,\" Embiid said. “I just understand. Usually when I come back from these things, I think 30, 40 (points), whatever it takes to get the win. This time, it's a little different. It's going to take me a while to get back to myself and really trust myself. As long as we win, I think my biggest impact is just being out there defensively.”\n\n\r\n              Chet Holmgren scored 22 points to lead the Thunder, who fell one-half game behind Denver for the top spot in the Western Conference. Minnesota moved into a tie with Oklahoma City.\n\n\r\n              The Sixers trailed by 11 points with 7:27 left before they went on a torrid run. Kelly Oubre Jr. hit a 3 that got the comeback rolling, and Embiid capped it off with a series of free throws. Embiid hit two for a 106-105 lead and added two more that made it 108-105. He made all 12 foul shots on the night.\n\n\r\n              Embiid sat exhausted on the scorer's table as the final seconds ticked off before he sauntered over to Iverson.\n\n\r\n              Oubre scored 25 points and Tobias Harris had 18.\n\n\r\n              Embiid was injured on Jan. 30 at Golden State. He had meniscus surgery on his left knee a week later, and the Sixers crashed in the East standings without him. They are currently eighth, 1 1/2 games behind Miami.\n\n\r\n              With a healthy Embiid, the 76ers at least have a better chance to win a series or two in the playoffs.\n\n\r\n              “He changes them significantly,” Thunder coach Mark Daigneault said. “They play a lot different stylistically when he’s in to where they have been lately in the last 30 games he’s been out or so. When he plays, it certainly changes their approach.”\n\n\r\n              The Thunder couldn't hold on in the fourth with All-Star Shai Gilgeous-Alexander out for the third time in four games with a quad injury. Jalen Williams (ankle) also sat out for the Thunder. All-Star guard Tyrese Maxey (hip) was inactive for the 76ers.\n\n\r\n              Sixers coach Nick Nurse was impressed by the state of the Thunder, in large part because of Gilgeous-Alexander’s play.\n\n\r\n              “I think they’ve got a lot of stuff,” Nurse said. “They’ve got an incredible superstar who’s as good as anybody in the league. They’ve got some other emerging superstars that are very good players. They play a system that they’re all in tune with.”\n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Boston on Wednesday.\n\n\r\n              76ers: At Miami on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996405.9087071
}