{
  "game_id": "0021601173",
  "espn_id": "400900551",
  "date": "Apr 06, 2017",
  "matchup": "CHI @ PHI",
  "headline": "Butler has triple-double, fuels Bulls past 76ers 102-90",
  "body": "PHILADELPHIA --  Dwyane Wade was declared finished for the season around the time Chicago's season was all but over.\n\nThe Bulls rallied back and have the postseason in sight -- just like Wade.\n\nJimmy Butler had 19 points, 10 rebounds and 10 assists and helped give Chicago's playoff hopes a needed boost in the Bulls' 102-90 victory over the Philadelphia 76ers on Thursday night.\n\nThe Bulls and Indiana both won to improve to 39-40, and Miami (38-40) had the night off in the chase for the seventh seed in the Eastern Conference playoffs.\n\n\"I know where I want to take this team,\" Butler said.\n\nHe should have some help over the next three games.\n\nRajon Rondo sat out with a sprained right wrist and Wade missed another game with a fractured right elbow. Wade, who scrimmaged on Wednesday for the first time since he was injured on March 15, could return as early as Saturday's game at Brooklyn. Wade, who averaged 18.6 points in his first season with his hometown team, had been ruled out for the season. But Wade was worked hard at joining the team minus any serious setbacks.\n\n\"We're not quite there yet,\" coach Fred Hoiberg said. \"We'll practice (Friday) and hopefully get him through another good, solid contact practice. Hope we'll get him back in the lineup here soon.\"\n\nRondo was hurt Tuesday night in a loss to New York and had his wrist packed in ice in Chicago's locker room after beating the Sixers. He's considered day-to-day.\n\nWith Rondo and Wade sidelined, the Bulls still cruised against the lowly Sixers. Jerian Grant scored 15 points starting for Rondo, Nikola Mirotic scored 22 and the Bulls took a 14-point lead in the first half.\n\nTimothe Luwawu-Cabarrot led the Sixers with 18 points.\n\nThe Bulls wasted a major opportunity when they lost to New York and could not afford a second straight road defeat to an Eastern Conference also-ran. The Bulls, who hold a tiebreaker over the Heat and the Pacers, improved to 7-4 since they lost Wade.\n\nThe Sixers gave up 141 points Tuesday against Brooklyn and their defense was only slightly better against the Bulls.\n\n\"There was a stage I felt like we were getting back in it,\" coach Brett Brown said. \"You look at the results defensively, I'm fine with all of that.\"\n\nThe Bulls seemed on the brink of missing the postseason for a second straight year just a few weeks ago. Mirotic hit his fifth 3 of the game late in the fourth to make it 97-82 and the Bulls firmed up a playoff spot with two key cogs set to return. Butler earned his 10th assist on Mirotic's sixth three to clinch his fourth career triple-double.\n\n\"On the last one, Niko's like, `yo, you need one more.' I was like, `you don't think I know that,\" Butler asked. \"He says, `throw it to me and I'll shoot it.' Say no more.\"\n\nMirotic buried the 3 and Butler broke into a wide smile.\n\nTIP-INS\n\nBulls: Chicago has won 13 of 14 against the Sixers. ... The Bulls have defeated the Sixers seven straight times in Philadelphia. ... Michael Carter-Williams, 2013-14 NBA Rookie of the Year with the 76ers, received mostly boos when he checked in off the bench.\n\n76ers: Brown brought his parents to the game. Brown's father, Bob Brown, was a standout high school and college coach for years in New England. But it's mom, Bonny Brown, who might be the family's biggest hoops junkie. \"My mom is addicted, my mom watches more than dad,\" Brown said. \"The best Christmas gift I give them is League Pass.\" ... Robert Covington (knee), Jahlil Okafor (knee) and Sergio Rodriguez (hamstring) all sat out. ... The Sixers' 10-5 mark in January (which matched last season's total wins) was just a mirage and they crashed down the stretch.\n\nDOUBLE-DOUBLES\n\nChicago's Bobby Portis had 12 points and 11 rebounds. Philadelphia's Richaun Holmes had 10 points and 10 rebounds.\n\nUP NEXT:\n\nChicago plays Saturday at Brooklyn and play its two final games at home.\n\nThe Sixers finish their home slate Saturday against Milwaukee and Monday against Indiana.",
  "source": "espn_api",
  "crawled_at": 1764995004.309352
}