{
  "game_id": "0022400021",
  "espn_id": "401703390",
  "date": "Nov 19, 2024",
  "matchup": "CLE @ BOS",
  "headline": "Celtics hand Cavaliers first loss of season, winning 120-117 to end Cleveland's 15-game win streak",
  "body": "BOSTON -- — The defending NBA champions held off the league’s hottest team on Tuesday night, with Jayson Tatum scoring 33 points and adding 12 rebounds to lead the Boston Celtics to a 120-117 victory over Cleveland and hand the Cavaliers their first loss after 15 straight wins to open the season.\n\n\r\n              Cleveland cut a 21-point deficit to two in the third quarter, and Donovan Mitchell hit a rainbow 3-pointer with 24 seconds left to make it a four-point game. Tatum sank one of two free throws, and then clobbered Mitchell at the other end, leaving the Cavaliers guard on the floor in need of medical attention.\n\n\r\n              Mitchell eventually stepped to the line and sank both free throws, but Boston inbounded the ball without trouble and passed it downcourt for an easy Al Horford dunk to clinch it.\n\n\r\n              Tatum sank six of Boston’s 22 3-pointers, and added seven assists for Boston’s third straight win.\n\n\r\n              Mitchell scored 35 points, and Evan Mobley had 22 points and 11 rebounds for the Cavaliers, who were the fourth team in NBA history to open the season with 15 wins in a row. The 15-game winning streak was longest in Cavaliers franchise history. \n\n\r\n              Takeaways\r\n              Cleveland was an early surprise as the top team in the Eastern Conference, but it knows it will not be easy to get past Boston, should they meet in the playoffs. \n\n\r\n              Key moment\r\n              The Celtics scored 19 of the last 26 points in the second quarter to turn a five-point lead into a 65-48 advantage at the break. Cleveland cut a 21-point deficit to two points in the third.\n\n\r\n              Key stat\r\n              The Celtics were 14 for 22 from 3-point range in the first half. They were up by five points with 5:05 left when they hit four straight 3’s, and six in all down the stretch, opening a 65-48 halftime lead.\n\n\r\n              Up next\r\n              Cavaliers: Host New Orleans on Wednesday.\n\n\r\n              Celtics: Visit the Washington Wizards on Friday, a day after visiting the White House as a perk of their 18th NBA championship.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998325.5626292
}