{
  "game_id": "401810157",
  "espn_id": "401810157",
  "date": "Nov 30, 2025",
  "matchup": "CLE vs BOS",
  "headline": "Payton Pritchard scores 42, Jaylen Brown gets triple-double as Celtics outlast Cavaliers 117-115",
  "body": "CLEVELAND -- — Payton Pritchard scored a season-high 42 points, Jaylen Brown got his fourth career triple-double and the Boston Celtics barely held on to beat the Cleveland Cavaliers 117-115 on Sunday night after giving up most of their big lead.\n\n\r\n              The Celtics led by 21 points in the third quarter and were still up by 11 with less than two minutes left before Cleveland's Donovan Mitchell made consecutive 3-pointers to pull the Cavs within 114—112 with 20.5 seconds left.\n\n\r\n              Pritchard, who made several big buckets down the stretch, then made two free throws to put Boston ahead 116-112 with 5.9 seconds remaining.\n\n\r\n              Cavs guard Darius Garland buried a 3-pointer with 1.2 seconds to go, and Cleveland fouled Brown on the ensuing inbounds pass following a timeout. Boston's All-Star guard could only split a pair of free throws, giving the Cavs a final chance.\n\n\r\n              But Evan Mobley's jumper was short at the final horn, allowing the Celtics to escape.\n\n\r\n              Brown finished with 19 points, 12 rebounds and 11 assists for his first triple-double since Jan. 21, 2024, at Houston. He scored 41 in a loss at Minnesota on Saturday.\n\n\r\n              Mobley led the Cavs with 27 points and 14 rebounds and Garland scored 21. Mitchell was quiet until the final minutes and finished with 18 — 12 below his average.\n\n\r\n              Boston's Jordan Walsh had career-highs with 14 points and 11 rebounds.\n\n\r\n              Both teams were short-handed due to injuries.\n\n\r\n              The Celtics, who had been without star Jayson Tatum all season, rested starters Derrick White (calf bruise) and Neemias Queta (ankle sprain), who was coming off a 19-point, 18-rebound performance.\n\n\r\n              The Cavs have been dealing with their own lengthy list of medical issues. They were without starting center Jarrett Allen (finger sprain), forward Larry Nance Jr. (hand sprain) and guards Lonzo Ball (knee rest) and Sam Merrill (hand sprain).\n\n\r\n              Up next\r\n              Celtics: Host Knicks on Tuesday.\n\n\r\n              Cavaliers: At Pacers on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042721.9332092
}