{
  "game_id": "0022300630",
  "espn_id": "401585258",
  "date": "Jan 25, 2024",
  "matchup": "MIA vs. BOS",
  "headline": "Tatum scores 26 points, Celtics embarrass Heat in East finals rematch, 143-110",
  "body": "MIAMI -- — Boston coach Joe Mazzulla is a movie buff who made big news last season when revealing that he watches “The Town” several times a week. And he recently watched the 1993 crime drama “A Bronx Tale,” another movie that earned his two-thumbs-up rating.\n\n\r\n              One of the key lines from that movie: “Nobody cares.\"\n\n\r\n              That perfectly summed up how he felt about blowing out the Heat.\n\n\r\n              Jayson Tatum scored 26 points, Kristaps Porzingis had 19 before spraining his left ankle and the Celtics made 22 3-pointers on the way to routing the reeling Heat 143-110 on Thursday night, sending Miami to its fifth straight loss.\n\n\r\n              “This game was really good, but it means nothing at all in the grand scheme of things if we don't take the lessons that we need to and apply it to the next game,” Mazzulla said. “So, we'll enjoy it until we get to the plane and then it's on to the next one.”\n\n\r\n              There was much to enjoy. The 143 points were the most Boston ever scored against Miami, and the 33-point margin represented Boston’s most-lopsided win over Miami in 172 meetings between the franchises, including playoffs. The Celtics shot 64% and won the rebound battle 47-31.\n\n\r\n              Jaylen Brown scored 18 points, Jrue Holiday had 17 and Derrick White 15 for the NBA-leading Celtics. They improved to 35-10 and are 2-0 this season against the team that beat them in last season’s Eastern Conference finals. \n\n\r\n              “We just learned from last year, getting so close and not getting over that hump,” Tatum said.\n\n\r\n              Bam Adebayo and Tyler Herro each scored 19 points for Miami, which got 17 from Jimmy Butler. The Heat are in their longest skid since dropping six in a row in March 2021.\n\n\r\n              “I felt like there was a lot of miscommunication throughout the game, defensive lapses, a whole bunch of things that went on through the game that we didn't correct and we paid for,” Adebayo said.\n\n\r\n              The Heat were 8 1/2-point underdogs at game time  They hadn’t been that been of an underdog in their own building since Feb. 27, 2019, when Golden State was favored by 9 1/2 points in what became a 126-125 Miami win.\n\n\r\n              This one didn’t have that sort of ending for Miami. Not even close.\n\n\r\n              Boston wasted little time showing why oddsmakers did what they did. An 18-7 run over a three-minute stretch of the opening quarter gave the Celtics a 40-25 lead, and Boston was off and running. It was 77-64 Boston at the half, the Celtics in total control.\n\n\r\n              And it only got worse for Miami.\n\n\r\n              The Heat came into the night giving up an average of 110.5 points this season; Boston had 111 with a minute left in the third quarter and went into the fourth leading 113-90. Even including playoffs, it was only the fourth time in Heat history a Miami team allowed that many points through the first 36 minutes of a game.\n\n\r\n              Miami has trailed by at least 24 points in three of its last five games — 37 at Toronto on Jan. 17, then 24 at Orlando on Sunday and the biggest lead Thursday for Boston was 34. And those three games wound up as the three most-lopsided losses of this Heat season.\n\n\r\n              “What went wrong was we faced a very potent offensive team that's been doing this for several months now,” Heat coach Erik Spoelstra said. “It was a humbling night. That's for sure. They put us in our place tonight.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Los Angeles Clippers on Saturday night.\n\n\r\n              Heat: At New York on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995357.3897321
}