{
  "game_id": "0022000467",
  "espn_id": "401267627",
  "date": "Feb 21, 2021",
  "matchup": "DET @ ORL",
  "headline": "Nikola Vucevic scores 37 points, Magic beat Pistons 105-96",
  "body": "ORLANDO, Fla. -- — Nikola Vucevic had 37 points and 11 rebounds, Evan Fournier added a season-high 29 points and the Orlando Magic beat the Detroit Pistons 105-96 on Sunday night.\n\n\r\n                    The Magic have won three in a row, their longest winning streak since opening the season 4-0. The Magic and Pistons play again in Orlando on Tuesday night.\n\n\r\n                    “What I’m seeing is that we’re starting the game well and we finished it well, so there are a lot of positives,” said Fournier, who suffered a mild ankle sprain late in the game. “We had one or two stretches where we weren’t as good on defense and not executing, but we kept fighting and got the (win).”\n\n\r\n                    Vucevic had his seventh 30-point game of the season, two days after recording the third triple-double of his career. Fournier had a season high for the second straight game. \n\n\r\n                    Vucevic, took advantage of Detroit’s lack of size on the inside when center Mason Plumlee left the game for an extended period early in the fourth quarter. Vucevic scored 15 points in the fourth quarter.\n\n\r\n                    “I've been feeling good and obviously I've been playing at a high level since the beginning of the year,” Vucevic said. “Once you get in a good rhythm, the game comes easier to you, you don't think so much about stuff and my experience from this being my 10th year helps.”\n\n\r\n                    Fournier, who scored 28 points in Orlando’s victory over Golden State on Friday night, had 16 first-half points. He made 12 of 13 free throws in the game to key Orlando’s 26-of-29 shooting from the line.\n\n\r\n                    “He drove the ball hard and he got to the free throw line, and for our team that’s not an area of strength and it’s something that we badly need,” Magic coach Steve Clifford said. “He’s playing at a high level. Evan is a mentally and physically tough guy. He’s not 100 percent physically, but he wants to be out there and he’s playing very well.” \n\n\r\n                    Jerami Grant bounced back from his poorest shooting game of the season in Memphis on Friday by scoring 24 points for the Pistons. They dropped to 1-17 on the season when trailing after three quarters.\n\n\r\n                    Last in the Eastern Conference, the Pistons have lost three straight and eight of 11. Josh Jackson added 17 points and 10 rebounds, but he missed all six of his 3-point shots. Detroit was just 11 of 40 from beyond the arc and shot only 37.4 percent.\n\n\r\n                    “We didn’t do a good job of knocking down shots, but we had some great looks,” Detroit coach Dwane Casey said.\n\n\r\n                    TIP INS\n\n\r\n                    Pistons: Delon Wright say out because of a Grade 2 groin strain that is expected to sideline him for two weeks. Wright was injured in Friday against Memphis — a game where he had a team-best 16 points. He leads the Pistons in assists (1.4) and steals (1.4). … Dennis Smith Jr. started in place of Wright, but Casey said two-way players Frank Jackson and Saben Lee will get plenty of looks. One stumbling block, Casey said, is the NBA’s limits on how many games two-way players can play before their contracts much be converted. Said Casey: “It’s going to be by committee. With the starting position, it’s going to come down to who maintains it.” … Lee had a career-best 12 points and five assists on Sunday.\n\n\r\n                    Magic: With Aaron Gordon (ankle sprain) still out, the Magic plan to rotate the starters at the power forward position for the next two weeks. Khem Birch started Friday, while Al-Farouq Aminu moved into that slot Sunday despite the minutes’ restriction he is still under following two knee surgeries. Aminu finished with three points and six rebounds in 19 minutes. … Terrence Ross, who had 24 points in Friday’s win, scored 17 points and hit three 3-pointers on Sunday.\n\n\r\n                    HEROES HONORED\n\n\r\n                    The Magic honored 500 frontline workers from AdventHealth and the Orlando community on Sunday as part of their “Healthcare Heroes Night.”",
  "source": "espn_api",
  "crawled_at": 1764997916.269265
}