{
  "game_id": "0022300380",
  "espn_id": "401585008",
  "date": "Dec 21, 2023",
  "matchup": "MIN vs. LAL",
  "headline": "Timberwolves hand LeBron-less Lakers 4th straight loss, 118-111",
  "body": "MINNEAPOLIS -- — Anthony Edwards had 27 points to lead the Minnesota Timberwolves past Los Angeles 118-111 on Thursday and hand the Lakers — with LeBron James sitting out on the second night of back-to-back games — their fourth straight loss.\n\n\r\n              The Wolves — also playing for a second straight night — tied Boston at 21-6 for the NBA 's best record.\n\n\r\n              “All credit to the guys for getting the win on a back-to-back. I know there might not have been a full tank for everyone, but that’s one of those games where if it goes 3 more minutes, we may lose it,” Wolves coach Chris Finch said.\n\n\r\n              Karl-Anthony Towns had 21 points for Minnesota before limping to the locker room for further examination on a lower-leg injury — Finch said Towns took a “bang” but had no update on his condition — with 5:07 left. By then, the Wolves were awake after a sleepy third quarter. \n\n\r\n              Mike Conley finished with 16 points, eight assists and two of the team's 13 steals and Rudy Gobert had 15 points, 13 rebounds and three blocks as the Wolves avoided consecutive losses for the first time this season and improved to 12-1 at home. \n\n\r\n              “We just use our depth and our size,” Conley said. \"That can be overwhelming for certain teams at certain times, and it allows us to just be unpredictable every night.”\n\n\r\n              Anthony Davis had 31 points and eight rebounds, and Rui Hachimura — in the starting lineup with James out to rest tendinitis in his ankle — scored 18 points as the Lakers fell to 1-5 since winning the NBA In-Season Tournament. They're 15-14 overall and 5-11 on the road.\n\n\r\n              “We’ll break through this thing, once we get guys back healthy, get guys back in rhythm,” coach Darvin Ham said. “We’ll be OK.”\n\n\r\n              The Lakers have been in a mini-slump over the last 12 days, whether or not the lag was related to the investment of energy into winning the league's inaugural sideshow in Las Vegas on Dec. 9.\n\n\r\n              While James watched from the bench in a stocking hat and hooded sweatshirt, Davis powered through an ankle injury against one of the league's best groups of big men with Gobert, Towns and backup Naz Reid.\n\n\r\n              “It was a battle from start to finish and he showed why he is who he is, even in a loss,” Ham said. “He’s a pleasure to coach, man.” \n\n\r\n              Austin Reaves (18 points) provided a burst off the bench and Taurean Prince — one of three former Timberwolves in the rotation — hit all of four of his 3-pointers for the Lakers. D'Angelo Russell, who had only two points at Chicago on Wednesday and was in as deep in the rut as anyone, finished with 17 points and eight assists against his old team but shot 7 for 19 from the floor and lamented the lack of continuity afterward.\n\n\r\n              “We still haven’t even seen our postseason lineup that we were successful with last year,\" Russell said. “Every game feels like something new.”\n\n\r\n              The Wolves are allowing the fewest points per game in the league.\n\n\r\n              “Our defense is what we’ve got to hang our hat on,” Conley said.\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Oklahoma City on Saturday. \n\n\r\n              Timberwolves: At Sacramento on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996485.4421911
}