{
  "game_id": "0022400793",
  "espn_id": "401705359",
  "date": "Feb 20, 2025",
  "matchup": "MIL vs. LAC",
  "headline": "Antetokounmpo returns and Bucks use 4th-quarter rally to beat Clippers 116-110",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 23 points in his return after missing six games with a strained calf and the Milwaukee Bucks rallied for a 116-110 victory over the Los Angeles Clippers on Thursday night.\n\n\r\n              Anteotkounmpo was on a minutes restriction and played just under 24 minutes, leaving for good with 6:27 remaining as the Bucks trailed 101-96. Milwaukee then completed its comeback from a 13-point, fourth-quarter deficit with Antetokounmpo on the bench.\n\n\r\n              Brook Lopez scored 22 points and put the Bucks ahead for good by converting a three-point play with 3:02 remaining. \n\n\r\n              Kawhi Leonard had 25 points, James Harden added 24 and Ivica Zubac had 20 points and 15 rebounds for the Clippers, who played without Norman Powell due to knee soreness. \n\n\r\n              Milwaukee was missing Bobby Portis, who began serving a 25-game suspension after testing positive for the painkiller Tramadol, a violation of the league’s anti-drug program. Portis said he took the Tramadol by mistake. \n\n\r\n              Takeaways\r\n              Clippers: Harden increased his career points total to 27,005. He became the 13th player in NBA history to reach the 27,000-point mark. ... Kris Dunn had a career-high six steals. ... The Clippers led 93-80 with less than 11 minutes remaining.\n\n\r\n              Bucks: This was the first time Antetokounmpo played in a game with Kyle Kuzma, Kevin Porter Sr. and Jericho Sims, who were all acquired at the trade deadline. With Portis beginning his suspension, Sims made his Bucks debut and went scoreless in 17 minutes.\n\n\r\n              Key moment\r\n              The game was tied at 104-all when Lopez blocked a shot from Dunn with less than 3½ minutes left. Lopez then got a three-point play on Milwaukee’s ensuing possession to put the Bucks ahead for good.\n\n\r\n              Key stat\r\n              Damian Lillard scored 12 of his 15 points in the last 6:48 of the game\n\n\r\n              Up next\r\n              The Bucks visit former teammate Khris Middleton when they play at Washington on Friday. The Clippers visit Indiana on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997832.444049
}