{
  "game_id": "0021400526",
  "espn_id": "400578818",
  "date": "Jan 07, 2015",
  "matchup": "MEM @ ATL",
  "headline": "Jeff Teague's 25 help Hawks beat Grizzlies, stay hot vs. West",
  "body": "ATLANTA -- Jeff Teague and the Atlanta Hawks continue to use their newly discovered mastery of the Western Conference as their path to the top of the East.\nJeff Teague scored 25 points and the Atlanta Hawks beat the Memphis Grizzlies 96-86 on Wednesday night.\nThe Hawks, who have won six straight overall, have a nine-game winning streak against Western Conference teams. Atlanta (27-8) has won 20 of 22 and has the best record in the Eastern Conference.\n\"It shows that we're a good team,\" said Atlanta's Al Horford, who had 12 points.\n\nThe Hawks were coming off three straight road wins over Utah, Portland and the Clippers. They continued the run against Memphis (25-10), which began the night third in the Western Conference.\n\"Honestly, it's just happened that we played all those teams,\" Horford said. \"At the end of the day, for us it's about wins.\"\nTeague has scored 20 or more points in each of Atlanta's six straight wins -- his longest streak of 20-point games in his career.\n\"In any sport that's what you want, to be really consistent every day,\" Hawks coach Mike Budenholzer said. \"That's what we keep pushing Jeff on. I think he's made a lot of progress.\n\"He's gifted offensively and he's making some good things happen for himself and for his team.\"\nTeague helped the Hawks take control with a 10-0 run following an 84-all tie. Horford started the run with a jumper. Teague and Kyle Korver followed with 3-pointers and Teague added another basket for a 94-84 lead.\n\"We were able to find a way the last three or four minutes to get one more burst,\" Budenholzer said.\nMike Conley led Memphis with 17 points. Marc Gasol had 16, but the Grizzlies hit a wall in the closing minutes.\n\"It was a matter of not getting stops and not executing,\" Gasol said. \"We couldn't make plays. We couldn't execute. And that was it. You can't defend, you can't execute, it's hard to win.\"\nGrizzlies coach David Joerger tried different lineup combinations as he sought to find an answer for Teague and Korver, who had 14 points.\n\"We have to get another playmaker on the floor,\" Joerger said. \"We have to. We're going to have to start playing multiple point guards.\"\nJoerger said the Hawks \"really jammed up\" Conley.\nEach team began the night with its best start in franchise history. This is the latest in the season the Hawks have led the Eastern Conference since the 1993-94 season.\nThe Hawks, with 6-foot-10 Horford at center, are accustomed to size disadvantages, and 7-footers Gasol and Kosta Koufos gave the Grizzlies a dramatic edge. Memphis had only a 39-37 edge in rebounds.\nTIP-INS\nGrizzlies: Gasol was effective with short fallaway shots over Horford. He used his soft touch from a different angle early in the third quarter when he made a shot from behind the corner of the backboard. Fans reacted with gasps. .. Tayshaun Prince had 12 points off the bench. ... Conley had a team-high nine rebounds and six assists.\nHawks: Antic, who had 13 points, set a season high with three 3-pointers. ... Korver made four 3-pointers. .. F Elton Brand was not with the team due to a death in his family.\nDOWN BUT NOT OUT\nHawks guard DeMarre Carroll was knocked to the floor in the third quarter. Play was stopped as he staggered off the court and was escorted to locker room with a right eye contusion.\nHe returned to the bench holding an ice bag over his eye. He was back in the game late in the quarter and had five points.\nTAKING NOTICE\nAttendance was 17,126. Horford said \"it felt like a playoff atmosphere\" when the fans reacted to Korver's late 3-pointer. The Hawks had three straight turnouts over 19,000 to finish their last homestand.\nUP NEXT\nGrizzlies: At New Orleans on Friday.\nHawks: At Detroit on Friday.",
  "source": "espn_api",
  "crawled_at": 1764992162.9447339
}