{
  "game_id": "0022301189",
  "espn_id": "401585817",
  "date": "Apr 14, 2024",
  "matchup": "MIA vs. TOR",
  "headline": "Heat tune up for postseason by topping Raptors 118-103 in regular-season finale",
  "body": "MIAMI -- — After a 46-win regular season, the Miami Heat still aren't in the playoffs. It'll take one more victory to get that job done.\n\n\r\n              And they'll have two chances, if necessary.\n\n\r\n              Thomas Bryant scored 18 points and grabbed 10 rebounds, Jaime Jaquez Jr. added 18 points and the Heat tuned up for a trip to the play-in tournament by beating the Toronto Raptors 118-103 on Sunday.\n\n\r\n              Bam Adebayo and Tyler Herro each scored 17 for Miami, while Jimmy Butler scored 15, Caleb Martin 12 and Delon Wright finished with 11 points and five steals for the Heat (46-36). Miami goes to Philadelphia to open the play-in tournament on Wednesday, with the winner securing the No. 7 seed.\n\n\r\n              “Should be a lot of fun,” Heat coach Erik Spoelstra said.\n\n\r\n              The loser of the Miami-Philadelphia game will play host to either Atlanta or Chicago on Friday to determine the No. 8 seed and who’ll face No. 1 seed Boston in Round 1.\n\n\r\n              “We've just got to go out there and compete, play basketball the right way and do something very difficult — which is to win on Philly's floor,” Butler said. “But it's the time of the year where you'll have to do that anyways if you want to win a championship. Obviously, we'll have to do it if we want to get to 7.”\n\n\r\n              Gary Trent Jr. scored 18 points for Toronto. Jordan Nwora and Gradey Dick each scored 14, Kelly Olynyk scored 11 and Ochai Agbaji added 10.\n\n\r\n              Toronto finished 25-57, the fifth-worst record in franchise history. There was some early hope; the Raptors started 8-8 and a three-game winning streak in late February pushed their record to 22-36.\n\n\r\n              They went 3-21 the rest of the way, playing much of that final stretch without Scottie Barnes — a former rookie of the year who made his first All-Star team this year — because of injury.\n\n\r\n              “I think we managed to keep the group together and keep high spirits and really focused on player development of our young core,\" Raptors coach Darko Rajaković said. \"So, there is a lot of positive things that we're going to embrace and look for going for into the future.”\n\n\r\n              It was tied after one quarter and the intrigue didn't last much longer. Miami outscored Toronto 43-22 in the second to build a 67-46 halftime lead. The 21-point margin in the second quarter was Miami's second-biggest of any period this season; the Heat outscored Portland by 24 in the second quarter of what became a 60-point win on March 29.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995317.422231
}