{
  "game_id": "0021400441",
  "espn_id": "400578733",
  "date": "Dec 26, 2014",
  "matchup": "POR vs. PHI",
  "headline": "Lillard leads Portland past Philadelphia 114-93",
  "body": "PORTLAND, Ore. --  Missing two centers and All-Star forward LaMarcus Aldridge, the Portland Trail Blazers used their long-range shooting to earn another win.\n\nDamian Lillard scored 28 points, Wesley Matthews had 25 and the Trail Blazers hit a season-high 18 3-pointers on their way to a 114-93 win over the Philadelphia 76ers on Friday night.\n\nMatthews went 7 for 14 from beyond the arc, and Lillard made three 3-pointers. Eight Portland players made at least one 3, and the Blazers (24-7) tied a franchise record with 43 3-point attempts.\n\nAldridge was sidelined for the second time in three games with an upper respiratory illness, and centers Chris Kaman (birth of child) and Robin Lopez (right hand fracture) also were unavailable. But the Blazers are among the NBA's top five in 3-point attempts and makes, so they had more than enough offense to post their seventh win in eight games.\n\n\"We knew we were short-handed, obviously without LA and (Lopez), so we knew it was going to be a different type of game,\" Lillard said. \"I thought we went out there and did what we needed to do.\"\n\nPhiladelphia coach Brett Brown pinned much of Portland's perimeter success on defensive mistakes.\n\n\"When you know you're going to get hit, and you didn't really do the job you needed to do to give ourselves a chance, it's discouraging,\" Brown said.\n\nPortland wasn't entirely lost inside. Center Joel Freeland grabbed a career-high 17 rebounds, a Blazers season high.\n\nTony Wroten, who missed Philadelphia's last game with a right knee sprain, came off the bench to score 22 points. Michael Carter-Williams had 17 points, and K.J. McDaniels finished with 12.\n\nPhiladelphia (4-24), which had won two in a row, made 3 of 14 shots from beyond the arc. The Blazers lead the NBA in 3-point shooting defense at 29.9 percent.\n\nLillard and Matthews got rolling during the third quarter. Matthews made back-to-back 3-pointers, and Lillard scored 12 consecutive points for Portland in one stretch. The duo scored 22 of the team's 27 third-quarter points as Portland increased its lead to 88-74.\n\nLeading 27-24 after the first quarter, Portland put together a dazzling display of 3-point shooting. The Blazers made seven 3s, including three by Matthews, to build a lead as large as 16 points. Dorell Wright's 3-pointer just before the buzzer gave Portland a 61-51 halftime lead.\n\n\"We are a relentless team, a confident team. We've played and won every kind of way this season,\" Matthews said.\n\nTIP-INS\n\n76ers: During the past 13 games, Carter-Williams is averaging 17.0 points, 9.4 assists and 7.3 rebounds. Carter-Williams and Houston's James Harden are the only NBA players averaging at least 15 points, seven assists and six rebounds a game this season.\n\nBlazers: With Aldridge and Kaman out, Portland used its eighth starting lineup of the season. Forward Thomas Robinson made his second start, and Freeland his fifth. ... The Blazers have won 13 of 15 home games this season for their best home start since 1998-99 when they were 14-1.\n\nFINALLY A SWEEP\n\nFor the first time since the 2001-02 season, the Blazers swept the two-game season series from Philadelphia. On Nov. 24, Portland beat the 76ers 114-104 in Philadelphia.\n\nHOMECOMING\n\nWroten, who grew up near Seattle and played at the University of Washington, had a strong outing in his annual return to the Northwest. He also had four rebounds and four assists in 27 minutes.\n\n\"It didn't surprise any of us that he was going to have that type of a game,\" Brown said.\n\nUP NEXT\n\n76ers: Visit Utah on Saturday.\n\nTrail Blazers: Host the New York Knicks on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764992090.228912
}