{
  "game_id": "0021601010",
  "espn_id": "400900405",
  "date": "Mar 15, 2017",
  "matchup": "LAL @ HOU",
  "headline": "Williams, Harden send Rockets to 139-100 win over Lakers",
  "body": "HOUSTON --  Rockets guard Lou Williams found the perfect cure for his recent shooting woes -- a good, old-fashioned revenge game.\n\nWilliams scored 30 points against his former team and James Harden had his 17th triple-double of the season to lead Houston over the Los Angeles Lakers 139-100 on Wednesday night.\n\nWilliams broke out of a shooting slump against his ex-teammates. He was just 7 of 30 on 3-pointers (23.3 percent) in six March games before regaining his touch in this one.\n\nHouston sent Corey Brewer and a first-round draft pick to Los Angeles in a trade for Williams three weeks ago. The deal paid off for the Rockets on Wednesday night as Williams went 7 for 9 from beyond the arc and made his first seven field goal attempts, including four straight 3s.\n\n\"It had been a while,\" Williams said. \"I've had some ups and downs. It's been a while since I shot the ball that well. Tonight was just a good night for me. I felt confident in my shot.\"\n\nHarden had 18 points, 13 assists and 12 rebounds as Houston handed the Lakers their 11th loss in 12 games.\n\n\"We've got so many good players and good scorers that he doesn't have to figure anything out,\" Harden said about Williams. \"He's just being patient. Tonight, he got it going, and it was good for us.\"\n\nBrewer, meanwhile, had four points in 22 minutes.\n\nWith D'Angelo Russell struggling to find a rhythm and in foul trouble much of the game, Los Angeles leaned heavily on Julius Randle, who gave Houston fits all night. Randle muscled his way into the paint for a career-high 32 points and eight rebounds.\n\n\"I just have to be more aggressive and look to score and run the floor,\" Randle said. \"It's all stuff that I already know that I have to be more consistent with.\"\n\nRookie forward Brandon Ingram and Jordan Clarkson both scored 18 points for Los Angeles.\n\n\"We just have to keep getting better. It's a process,\" Ingram said. \"Some of us have never been through this before, and the thing we're going through right now will only make us stronger. We just need to continue to come in and try to get better.\"\n\nBut the Rockets' 3-point shooting proved overwhelming for the young Lakers as Houston drained 18 of 43 from outside the arc (41.9 percent). Houston scored 46 points in the fourth quarter, mostly from reserve players while the Rockets held a comfortable lead.\n\n\"It's a balancing act,\" Houston coach Mike D'Antoni said. \"You don't want to get out of rhythm and you've got to be careful. I don't know the formula, and I don't know if there is one.\"\n\nLakers coach Luke Walton expressed his dissatisfaction with his team's lack of effort and composure down the stretch when the game got out of hand. He singled out a few instances when his players didn't get back in transition defense and failed to communicate with each other.\n\n\"I don't know if we think we're too good to have to work like that or if we're not willing to constantly commit, but I'm not OK with it,\" Walton said. \"I have a fire burning in me that gets (ticked) off when we're down 30-something.\"\n\nHouston led 66-52 at halftime and outscored the Lakers in every quarter. Houston won by 39 points, the same margin of victory as the last time it played the Lakers, a 134-95 rout in Los Angeles on Dec. 7.\n\nNick Young was back in the starting lineup for the Lakers, but his shooting woes continued. Young went 0 for 9 from the field, including 0 for 7 from 3-point territory.\n\n\"Nick, obviously, must have been rusty,\" Walton said. \"We needed shooting out there tonight, and unfortunately, he never really got it going.\"\n\nTIP-INS\n\nLakers: Russell fouled out when he was called for an offensive foul with seven minutes remaining. ... Ex-Rockets Brewer, Tyler Ennis, Thomas Robinson, Tarik Black and Metta World Peace all played for Los Angeles.\n\nRockets: Houston has won nine of its last 11 against the Lakers and taken four straight season series for the first time in franchise history. ... Harden had nine of Houston's 19 turnovers, largely on wild passes.\n\nQUOTABLE\n\n\"We need to figure out as a group -- not individually, but as a group -- how to handle adversity and how to react when things get tough,\" Walton said. \"We do a lot of blaming of other people, and we need to look at ourselves and control what we can control. Until we do, unfortunately, there's going to be a lot of frustrating nights like tonight.\"\n\nCLUTCH CITY BLOWOUTS\n\nThe Rockets have won 14 games by 20 points or more this season, matching the 2006-07 team for the highest total in franchise history. Houston improved to 25-1 this season when scoring at least 120 points.\n\nUP NEXT\n\nLakers: Host the Milwaukee Bucks on Friday.\n\nRockets: Visit the New Orleans Pelicans on Friday.",
  "source": "espn_api",
  "crawled_at": 1764995367.21721
}