{
  "game_id": "0021800925",
  "espn_id": "401071598",
  "date": "Feb 28, 2019",
  "matchup": "MIA @ HOU",
  "headline": "Harden scores 58 points, Rockets rally to beat Heat 121-118",
  "body": "HOUSTON --  After scoring 58 points, James Harden pointed to the Houston Rockets' defense and team effort.\n\nHarden also had 10 assists and seven rebounds and the Rockets overcame a 21-point third-quarter deficit to beat the Miami Heat 121-118 on Thursday night.\n\n\"We were lackadaisical on defense, especially in that second quarter,\" Harden said. \"They gained confidence and knocked down shots. They were just too comfortable, so we had to pick the pressure up in the second half, create some turnovers and energy with our defense.\"\n\nHe fell three points short of his career high set at New York on Jan. 23, and had the most points ever against the Heat -- breaking Willie Burton's mark of 53 for Philadelphia on Dec. 13, 1994.\n\n\"We get the stat sheet at the end of the game, and I saw he had 58,\" Rivers said. \"All of us were like, `He had that many points?' We had no idea he had that many points. That's a lot of points. He was incredible.\"\n\nHarden made 8 of 18 3-pointers and was 16 of 32 overall from the field and 18 of 18 on free throws.\n\n\"I wanted to be aggressive and continue to attack the rim,\" Harden said. \"I took my shots when I had the opportunities, and not only myself, but Austin (Rivers), Gary (Clark), Chris (Paul) made some plays down the stretch. It was a total team effort tonight.\"\n\nRivers scored 17 points, and Paul and Clark each had 14 to help Houston win its fourth straight game. The Rockets shot 49 percent, including 19 of 46 on 3-pointers.\n\nHouston held Miami to 20 points in the fourth quarter, outscoring the Heat by 15 in the decisive quarter.\n\n\"I just really think it was a big win for us,\" Houston coach Mike D'Antoni said. \"Just for a lot of reasons -- spirit wise, we did it the right way. We got into them defensively. ... This is a character win, and when you get in the playoffs, that's what counts.\"\n\nKelly Olynyk and Goran Dragic each had 21 points for Miami, Justise Winslow added 19 points and eight assists, and Josh Richardson had 18 points. The Heat shot 52 percent, making 15 of 28 3-pointers.\n\n\"We were in the driver's seat and had an opportunity to close it out and really buckle down defensively, and we started to foul,\" Miami coach Erik Spoelstra said. \"Double-digit lead all of us a sudden you look up and they were right there. That was probably more deflating than anything.\"\n\nMiami was coming off a home victory over Golden State on Wednesday night on Dwyane Wade's banked 3-pointer at the buzzer. Houston played at Charlotte on Wednesday night.\n\nWith Houston down 113-103 after Dragic's 3-pointer with 6:18 remaining, Harden scored 10 points on a 14-0 run that made it 117-113.\n\nMiami had a chance to regain the lead after Paul missed a 3-pointer, but Wade missed a jumper, and Richardson missed a 3-pointer. Paul hit a jumper with 46 seconds left to finish the scoring.\n\n\"Obviously, he (Harden) had the ball a lot and his teammates made timely plays when they needed to,\" Wade said. \"They just got it going, and defensively, we weren't as good as we were early on in the game when we had that lead, and that allowed them to come back.\"\n\nTIP INS\n\nHeat: James Johnson (shoulder sprain) and Hassan Whiteside (hip strain) did not play. ... Wade had 12 points, Waiters had 11 and Adebayo 10. ... The Heat outscored Houston 46-32 in the paint.\n\nRockets: Kenneth Faried (hip), Eric Gordon (knee) and Iman Shumpert (calf) sat out. D'Antoni said Faried was day-to-day after leaving Wednesday's game with the injury. Clark started for the Rockets. ... Houston committed 16 turnovers, which led to 27 points.\n\nTUCKER EJECTED\n\nAfter an offensive foul with 3 1/2 minutes left in the third, Houston forward P.J. Tucker argued the call on his way back up the court, earning two technical fouls and an ejection. Tucker had to be restrained by two assistant coaches as he left the court.\n\nUP NEXT\n\nHeat: Host Brooklyn on Saturday night.\n\nRockets: At Boston on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995228.969127
}