{
  "game_id": "0022000788",
  "espn_id": "401307581",
  "date": "Apr 08, 2021",
  "matchup": "LAC vs. PHX",
  "headline": "George scores 33 points, Clippers snap Suns' winning streak",
  "body": "LOS ANGELES -- — When Paul George and Kawhi Leonard are both healthy, they are one of the most difficult duos to stop in the NBA. The Los Angeles Clippers superstars showed that again Thursday night.\n\n\r\n                    George scored 33 points and Leonard added 27 in the Clippers' 113-103 victory over the Phoenix Suns in a physical matchup between two of the top teams in the Western Conference.\n\n\r\n                    The game carried a playoff intensity, but the officials tried to reign things back in during the second half. There were three technical fouls, two flagrant fouls and a pair of ejections in the final 24 minutes.\n\n\r\n                    “We competed and fought. It was chippy, but that is going to happen and I’m OK with it,” Clippers coach Tyronn Lue said. “We brought the physicality in the second half after they did that in the second quarter. We answered the challenge.”\n\n\r\n                    The Clippers (35-18) are 4 1/2 games behind Utah for the top spot in the Western Conference, but are now within two games of Phoenix for second. Even more important, LA is assured of taking the season series from the Suns, which would give it a key tiebreaker if both teams would tie at the end of the regular season.\n\n\r\n                    Phoenix (36-15) was coming off a big overtime win against Utah on Wednesday, but fell 2 1/2 games behind the Jazz after they beat Portland.\n\n\r\n                    George was 7 of 9 from 3-point range in 30 minutes in his eighth 30-point game of the season. The Clippers made 18 3-pointers, which is the 12th time this season they have made 18 or more in a game.\n\n\r\n                    “We focused on us. They can do the chirping, but I stayed in my zone,” George said. “Tonight was a fun matchup and we appreciate the challenge.”\n\n\r\n                    Leonard scored 19 points in the second half to help the Clippers end the Suns' winning streak at seven. \n\n\r\n                    Los Angeles trailed 67-61 with eight minutes remaining in the third quarter before coming back with an 8-2 run to tie it. It led 83-81 at the end of the third quarter before opening the fourth with a 10-2 run to seize control. The Clippers' largest lead was 16 points late in the fourth.\n\n\r\n                    “This is what I play the game for. I enjoy the aggressiveness,” Leonard said.\n\n\r\n                    Rajon Rondo, acquired from Atlanta near the deadline, added 15 points for the Clippers, who are 5-2 during a season-long, nine-game homestand. \n\n\r\n                    Phoenix didn't have enough down the stretch. Devin Booker led the way with 24 points, and Mikal Bridges had 20.\n\n\r\n                    The Suns made 27 of their first 40 shots, but were 9 of 31 after their hot start. \n\n\r\n                    “To go to overtime on Wednesday against Utah and then play the Clippers is not the best scenario for any team. We weren’t lethargic, we just didn’t have the legs,” Phoenix coach Monty Williams said. “Those are the kind of games and emotions you have to deal with. We were tired, especially in the second half.”\n\n\r\n                    EARLY NIGHT\n\n\r\n                    Clippers guard Patrick Beverley was ejected with 7:01 remaining for a Flagrant 2 foul against Chris Paul. \n\n\r\n                    Replay determined that Beverley's shoulder check and extended elbow against Paul on a fast break was an unnecessarily hard and excessive foul.\n\n\r\n                    Marcus Morris Sr. was ejected late after picking up a pair of technical fouls in the fourth quarter.\n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Phoenix is 9-3 when playing on the second night of a back-to-back. ... Booker failed to score 30 points for the first time in five games.\n\n\r\n                    Clippers: LA has won 13 straight over the Suns at Staples Center. ... DeMarcus Cousins played eight minutes in his LA debut on Tuesday, but did not see action Thursday. \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: Host Washington on Saturday to start a five-game homestand.\n\n\r\n                    Clippers: Host Houston on Friday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997673.2272232
}