{
  "game_id": "0022300756",
  "espn_id": "401585384",
  "date": "Feb 10, 2024",
  "matchup": "TOR vs. CLE",
  "headline": "Allen scores 18 points as Cavs rout Raptors 119-95, extend winning streak to season-high nine",
  "body": "TORONTO -- — Jarrett Allen had 18 points and 15 rebounds, Evan Mobley added 17 points and 11 rebounds, and the Cleveland Cavaliers extended their winning streak to a season-high nine games by routing the Toronto Raptors 119-95 on Saturday night.\n\n\r\n              Donovan Mitchell scored 15 points and Max Strus had 14 as the surging Cavs won for the 22nd time in 26 games and improved their NBA-best road record to 17-8.\n\n\r\n              “We want to win every game,” Strus said. “We want to win every game by as much as we can. That’s what I love about this team, there’s a lot of fight and there’s a lot of hunger. Guys want to be great and it’s fun.”\n\n\r\n              Caris LeVert and Georges Niang each scored 13 points for Cleveland, whose biggest lead was 25. Isaac Okoro scored 12 points and Darius Garland had 11.\n\n\r\n              The Cavaliers are 11-0 this season when holding opponents below 100 points.\n\n\r\n              “In our mind, we want to be elite defensively,” Cleveland coach J.B. Bickerstaff said. “We want to be able to strangle people.”\n\n\r\n              Cleveland’s 36 assists were one shy of a season-high. The Cavs finished with 48 made baskets.\n\n\r\n              “We passed the ball very well tonight,” Allen said. “Everybody was moving, everybody was contributing to having a great game.”\n\n\r\n              Toronto had won four straight and 10 of the past 11 home meetings against Cleveland, including a 124-121 victory on Jan 1. The Cavs returned to Canada having won 16 of 17 since that New Year’s Day defeat, sandwiching eight-game winning streaks around a Jan. 24 loss at Milwaukee. Now that second run has reached nine games, the longest active winning streak in the NBA.\n\n\r\n              “They’re playing really high-level basketball,” Raptors coach Darko Rajakovic said of the Cavs.\n\n\r\n              Cleveland hosts Philadelphia on Monday night.\n\n\r\n              Toronto’s Scottie Barnes scored 20 of his 24 points in the first half, matched his season-high with 10 assists, and added 10 rebounds for his fourth career triple-double and third this season.\n\n\r\n              “He is really taking the next step as the leader of this team,” Rajakovic said. “I’m really proud of his contributions tonight.”\n\n\r\n              Gradey Dick and RJ Barrett scored 14 points each and Immanuel Quickley had 10 for the Raptors.\n\n\r\n              Toronto newcomers Ochai Agbaji and Kelly Olynyk, acquired from Utah on Thursday, both made their debuts. Olynyk scored 11 points in 22 minutes and Agbaji had eight points in 20 minutes.\n\n\r\n              The Toronto-born Olynyk called it “a special moment” after being greeted with a loud ovation when he checked in.\n\n\r\n              “I had chills,” Olynyk said.\n\n\r\n              Up 30-24 after one quarter, Cleveland opened the second with a 21-4 spurt and led 67-47 at the intermission. Allen had 12 points and 10 rebounds in the first half.\n\n\r\n              The Cavaliers took a 95-73 lead to the fourth.\n\n\r\n              Justise Winslow was active for Toronto after signing a 10-day contract on Saturday afternoon, but did not play.\n\n\r\n              Toronto also signed forward Mouhamadou Gueye to a 10-day contract Saturday, but Gueye was not active against the Cavs. Both Gueye and Winslow had been with Raptors 905, Toronto’s NBA G League affiliate.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Philadelphia on Monday.\n\n\r\n              Raptors: Host San Antonio on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995814.901851
}