{
  "game_id": "0022400614",
  "espn_id": "401705180",
  "date": "Jan 22, 2025",
  "matchup": "MIN @ DAL",
  "headline": "Jaden McDaniels goes for career-high 27 points as Wolves outlast Mavs 115-114",
  "body": "DALLAS -- — Jaden McDaniels scored a career-high 27 points, including the clinching free throw with 3 seconds to play, and Anthony Edwards added 21 as the Minnesota Timberwolves outlasted the short-handed Dallas Mavericks 115-114 on Wednesday night.\n\n\r\n              Two free throws by Mike Conley gave Minnesota a 114-111 lead with 11.8 seconds left. After Kyrie Irving missed a 3-pointer, McDaniels grabbed the rebound and made one of two free throws for a four-point lead. Irving hit a running 3 at the buzzer.\n\n\r\n              Irving scored 36 points and P.J. Washington Jr. added a season-high 30 points for the Mavericks, who are 4-11 since superstar Luka Doncic was sidelined with a calf strain early in their Christmas Day loss to the Wolves.\n\n\r\n              The Mavericks announced before the game that center Dereck Lively II has a stress fracture in his right ankle and will be re-evaluated in a month. Guard Klay Thompson (left ankle sprain) was one of four other Dallas regulars out because of injury or illness.\n\n\r\n              The teams are tied for seventh place in the Western Conference at 23-21.\n\n\r\n              Six Timberwolves scored in double figures. Conley’s 18 points were a season best.\n\n\r\n              Takeaways\r\n              Timberwolves: While Dallas had the crowded inactive list, Minnesota used fewer players — eight to the Mavericks’ nine — with seven playing more than 26 minutes each.\n\n\r\n              Mavericks: Irving surpassed 18,000 career points, the 81st NBA player to do so.\n\n\r\n              Key moment\r\n              After Irving’s 3-pointer pulled the Mavericks within 101-100 with 5:45 to play and brought the crowd to its feet, McDaniels hit a right-corner 3, rebounded a miss by Spencer Dinwiddie and fed Edwards for a driving basket and a 106-100 lead.\n\n\r\n              Key stat\r\n              Dallas outscored Minnesota 66-48 in the paint without its starting center.\n\n\r\n              Up next\r\n              The Mavericks play at Oklahoma City on Thursday. The Timberwolves host Denver on Saturday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998090.1727722
}