{
  "game_id": "0021500064",
  "espn_id": "400827951",
  "date": "Nov 04, 2015",
  "matchup": "HOU vs. ORL",
  "headline": "Harden leads Rockets over Magic in overtime 119-114",
  "body": "HOUSTON -- James Harden didn't let another tough shooting night keep him from coming through when the Houston Rockets needed him most.\nHarden scored 28 points, including seven in overtime, to help the Rockets outlast the Orlando Magic for a 119-114 victory on Wednesday night.\nIt was a wild, back-and-forth game that was tied 18 times and featured 22 lead changes.\nHarden was 6 of 22, his fourth game this season where he shot less than 30 percent.\n\"James will be OK,\" coach Kevin McHale said. \"He will be fine. The shot will be fine, the shot will come ... I'm not worried about it too much.\"\n\nDwight Howard and Harden made back-to-back layups to get things going for Houston in overtime and make it 114-110. Evan Fournier made a basket for Orlando before a three-point play by Harden pushed the lead to 117-112.\nHarden talked about the key to his success in overtime.\n\"Trusting in myself and trusting in my teammates,\" Harden said. \"Making the extra pass, having confidence in the shot and just shooting it.\"\nShabazz Napier cut the lead to 117-114 with a jump shot with 2 1/2 minutes left, but the Magic didn't score after that and Harden made a pair of free throws with 0.9 seconds left to secure the victory.\nFournier finished with 29 points and four assists.\n\"We should have won the game,\" Fournier said. \"We have to get mentally stronger and have to close out a game like that.\"\nCorey Brewer missed two free throws with 12 seconds left in the fourth and Fournier tied it at 110 with two free throws with 1.1 seconds remaining. Houston had a chance to win it in regulation, but Howard couldn't hold onto the inbounds pass.\nIt was Houston's second straight win after a 0-3 start and the Magic's fourth loss of five points or less this season, and second in overtime.\nHoward had 23 points and 14 rebounds. He was 10 for 10 to become the first Rocket to make 10 or more field goals without a miss since Yao Ming was 12 for 12 in 2009. Trevor Ariza scored 19 points with four 3-pointers.\nHoward is still working his way back into game shape after missing all but one preseason game with a stiff back.\n\"I was exhausted,\" he said. \"But that's good.\"\nHarden crashed hard to the court when he was fouled by Fournier with about 8 minutes remaining. He remained on the floor for a couple of minutes before slowing getting to his feet and making one of two free throws that put Houston up 98-97.\nTIP-INS\nOrlando: Gordon finished with 19 points and eight rebounds. ... Victor Oladipo had 18 points and seven rebounds. ... Orlando scored 58 points in the paint. ... Nikola Vucevic sprained his knee and will be re-evaluated on Thursday.\nHouston: Howard received a flagrant 1 foul in the second quarter after knocking Gordon to the ground as he drove to the basket. ... Marcus Thornton had 18 points in his third straight start. ... Patrick Beverley felt dizzy after getting hit in the side of his head and did not return after halftime.\nSTIR IT UP\nThe Rockets handed out what they called Harden \"Stir It Up\" bobbleheads to the first 3,000 fans at Wednesday night's game. The bobblehead pays homage to the stirring the pot gesture Harden makes after a big shot. It was a hot commodity with fans lining up more than two hours before the doors opened to snag one. Harden is a fan of his mini-me and called it \"dope.\"\nJONES STILL OUT\nHouston F Terrence Jones missed his third straight game after getting a cut on his eyelid on Friday night against the Warriors. McHale said he could be out for a while after doctors had to remove a couple of the stitches on the cut because they were irritating his eye. His eye remained very swollen on Wednesday.\nQUOTABLE\nMagic coach Scott Skiles on Fournier: \"Evan had a great game. He carried us offensively and guarded Harden most of the game and that is really tough double duty.\"\nUP NEXT\nMagic; Host Toronto on Friday.\nRockets: Visit Sacramento on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994676.810283
}