{
  "game_id": "0022401084",
  "espn_id": "401705650",
  "date": "Mar 30, 2025",
  "matchup": "MIN vs. DET",
  "headline": "After 2nd-quarter fight and ejections, Timberwolves beat Pistons 123-104",
  "body": "MINNEAPOLIS -- — Julius Randle had 26 points and eight rebounds and Anthony Edwards added 25 points and the Minnesota Timberwolves beat the Detroit Pistons 123-104 on Sunday night in a game that was interrupted by a second-quarter fight.\n\n\r\n              Tempers flared after Detroit fouled Timberwolves forward Naz Reid. Five players — including Reid and teammate Donte DiVincenzo — were ejected, along with Detroit head coach J.B. Bickerstaff and Minnesota assistant Pablo Prigioni.\n\n\r\n              Rudy Gobert had 19 points and 25 rebounds to help Minnesota win for the third time in four games.\n\n\r\n              Malik Beasley led Detroit with 27 points. Tim Hardaway Jr. had 20 ,and Dennis Schroder added 11 points and 11 assists.\n\n\r\n              Takeaways\r\n              Pistons: Detroit had won three straight, all with All-Star guard Cade Cunningham out with a calf injury. However, losing three rotation players in the second-quarter skirmish — Isaiah Stewart, Ron Holland II and Marcus Sasser — proved to be too taxing on the Pistons' depth.\n\n\r\n              Timberwolves: Minnesota trailed by 16 in the first quarter, but the Wolves remained patient with their attack and eventually wore down the Pistons to pull away.\n\n\r\n              Key moment\r\n              With 8:40 to play in the third, Edwards hit a 3-pointer to give Minnesota its first lead of the night, 69-67. After a basket by Beasley tied it, Randle hit a 3 to put the Wolves on top 72-69, and they never trailed again.\n\n\r\n              Key stat\r\n              Minnesota outscored Detroit 38-23 in the third quarter. Edwards had 18 points, hitting four 3-pointers in the period.\n\n\r\n              Up next\r\n              The Pistons are at Oklahoma City on Wednesday night. The Timberwolves are at Denver on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998073.731754
}