{
  "game_id": "0021900895",
  "espn_id": "401161537",
  "date": "Mar 01, 2020",
  "matchup": "CHA vs. MIL",
  "headline": "Antetokounmpo's 41 points lift Bucks past Hornets 93-85",
  "body": "CHARLOTTE, N.C. --  Giannis Antetokounmpo caught the ball on the baseline with 2:39 left in the game, turned and faded away to bury a 9-foot jumper over the outstretched hands of Miles Bridges.\n\nBridges shook his head in disbelief as he ran back down the court, knowing there was nothing more he could have done to prevent the reigning MVP from scoring.\n\n\"It's a shot I feel comfortable taking,\" Antetokounmpo said. \"I have been working on it since year three. Some nights I feel good and have the extra pep in my step. As long as I get it high enough and it goes over the rim it's a good shot.\"\n\nAntetokounmpo had plenty of pep in his step, scoring 41 points -- including the last nine for his team -- to go along with 20 rebounds and six assists and helping the Milwaukee Bucks to their sixth straight win, 93-85 over the Charlotte Hornets on Sunday.\n\nBrook Lopez added 16 points and seven rebounds for the Bucks, who've won 20 of their last 22 games. Milwaukee's run of scoring 100 points or more in 83 straight games ended, but it still improved to a league-best 52-8 on the season.\n\nAntetokounmpo scored in almost every way imaginable -- on pick-and-rolls, fast-break dunks, drives to the basket and, of course, the fadeaway jumper.\n\n\"He's tough to stop when he's making shots like that,\" Bridges said. \"It's kind of like a Dirk (Nowitzki) shot. He's 7-foot almost and his release is so high it's tough to block him. I felt like my arm was right there.\"\n\nLopez called Antetokounmpo's work ethic \"incredible.\"\n\n\"He puts the work in every single day, multiple times a day and it's great to see him go into a game and execute those shots,\" Lopez said. \"It looks so good, so natural.\"\n\nThe Bucks led by two entering the fourth quarter after turning the ball over 15 times in the first three quarters. Charlotte hung tough until the final two minutes, when Antetokounmpo took over.\n\nAfter the baseline jumper, he grabbed an offensive rebound off a missed 3-pointer and was fouled, converting both free throws to push the lead to seven. Then he scored on a driving layup with 1:09 left, sending the majority of the crowd streaming to the exits.\n\nAntetokounmpo's 20 rebounds were one shy of his career high. The Bucks outrebounded the Hornets 61-47.\n\nDevonte Graham had 17 points and Willy Hernangomez added 10 points and 13 rebounds to lead the Hornets, who were coming off a victory at defending champion Toronto on Thursday night.\n\nThe Hornets haven't drawn many fans this year, but they showed up in droves to watch the candidate for a second straight MVP -- and he put on quite a show.\n\nWith six minutes left and the Bucks leading by one, Antetokounmpo drove down the middle of the lane, did a spin move to shake Bismack Biyombo and dunked in between two defenders, drawing a foul for a three-point play.\n\nTIP-INS\n\nMarvin Williams, who was released by the Hornets last month and signed with Milwaukee, received a warm ovation when he checked into the game in the first quarter. ... Wesley Matthews received a technical foul in the fourth quarter after arguing a call. ... Hip-hop artist Da Baby attended the game. ... Graham and Terry Rozier were a combined 3 of 11 from 3-point range. The Hornets were 8 of 35 from beyond the arc.\n\nHORNETS DEFENSE\n\nCharlotte took pride in becoming the fist team this season to hold Milwaukee to double digits in points.\n\n\"I'm really pleased with where we're at defensively,\" Hornets coach James Borrego said. \"We're getting better. Obviously, I said this before the game, our personnel, our attention to detail and the pride we're taking on the defensive end is giving us a shot every night. Heck of an effort defensively tonight. That's a hell of a team over there offensively. I thought we made them work for everything and we made them work every possession.\"\n\nBANGED UP\n\nAntetokounmpo and Graham were involved in a mid-court collision in the fourth quarter after Graham attempted to take a charge. Both players were slow to get up. Antetokounmpo took a few seconds to get to his feet and stayed in the game. Graham took a little longer to get up and then headed to the bench to get looked at by trainers. He also returned to the game.\n\nUP NEXT\n\nBucks: At Miami on Monday night.\n\nHornets: Host the Spurs Tuesday night, the second of four straight games at home.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996050.018841
}