{
  "game_id": "0021600643",
  "espn_id": "400900064",
  "date": "Jan 20, 2017",
  "matchup": "MIL @ ORL",
  "headline": "Magic pull away for convincing win over Milwaukee",
  "body": "ORLANDO, Fla. --  Jeff Green not only challenged his Orlando Magic teammates, he challenged himself to play with more urgency and passion following a loss to New Orleans that capped a frustrating six-game road trip.\n\nIt seems the message got through.\n\nGreen and the Magic rebounded from their 1-5 road trip with a dominating 112-96 victory over Milwaukee on Friday night in their first game back at Amway Center since Jan. 6. Green sparked the win with his 16 points off the bench that came primarily on transition baskets and driving layups.\n\n\"It was definitely there,\" the veteran forward said of the improved passion and urgency the team played with Friday. \"We communicated and I'm not talking just on offense but on defense. We were on the same page, we were in synch and we communicated.\n\n\"When we are on the same page we have a chance to be one of the top defensive teams.\"\n\nIt certainly looked that way against the Bucks. Milwaukee, which had led by as many as 10 points in the first quarter, went through several scoring droughts as Orlando contested every basket.\n\nBucks forward Jabari Parker led all scorers with 25 points and recently named East All-Star starter Giannis Antetokounmpo had 17 points, but both players had to put up 17 shots.\n\nThe Magic made Milwaukee work for its 41 percent shooting while their offensive flow seemed much better even with two of their best scorers sidelined Friday with injuries. Orlando shot 46 percent from the field and had 25 assists, which was indicative of its ball movement all night.\n\n\"When you're struggling you have to commit to your process, commit to your work,\" said Magic coach Frank Vogel, whose team snapped a three-game losing streak. \"You have to commit to get better every single day. The focus was good tonight, the urgency and desperation was good tonight. Hopefully we can keep it going.\"\n\nMilwaukee, which has now lost four straight, is simply trying to figure out how to remain in contention for one of the Eastern Conference playoff spots. The Bucks held a players' only meeting after Friday's game and it took coach Jason Kidd over 35 minutes following the game to address the media.\n\n\"If we don't score the ball we tend to take a step back,\" Kidd said. \"Those were the things we were talking about.\"\n\nTIP-INS\n\nBucks: Milwaukee led by as many as 10 points early in the first quarter, but went scoreless in the final four minutes of the period to allow Orlando to turn its deficit into a 25-23 lead going into the second quarter.\n\nMagic: Orlando is extremely thin at the shooting guard spot with starter Evan Fournier listed as day-to-day with a heel injury. Reserve guard Jodie Meeks is now out four to six weeks after a MRI on Thursday revealed he has sprained ligaments in his right thumb. C.J. Watson started shooting guard Friday night. ... Former star point guard Penny Hardaway was inducted into the Magic's Hall of Fame on Friday and honored during the game.\n\nROUGH MEETING\n\nApparently the conversation during the Bucks' players-only meeting got heated at times. Parker says he wasn't well received when he expressed his point of view.\n\n\"I spoke up for the first time and it didn't go my way,\" he said. \"I got thrashed, but hey, I guess I gave them another perspective.\"\n\nUP NEXT\n\nBucks: Milwaukee completes a back-to-back with game at the Miami Heat on Saturday night.\n\nMagic: Orlando gets a day of rest before hosting the Western Conference-leading Golden State Warriors on Sunday at noon.",
  "source": "espn_api",
  "crawled_at": 1764995182.522499
}