{
  "game_id": "0021800512",
  "espn_id": "401071188",
  "date": "Dec 27, 2018",
  "matchup": "HOU vs. BOS",
  "headline": "Harden's 45 lead Rockets in 127-113 win over Celtics",
  "body": "HOUSTON --  James Harden thinks he should be in the MVP discussion again this season and showed why on Thursday night.\n\nHarden had 45 points and six assists, Clint Capela added 24 points and 18 rebounds, and the Houston Rockets beat the Boston Celtics 127-113 for their eighth win in nine games.\n\n\"Of course, I should be in that conversation,\" Harden, the reigning MVP, said. \"I received a lot of hate, but it won't stop me from going out there and killing it every single night and being the dog that I am. You can name a few other people that can be in that conversation, but realistically, it's coming back.\"\n\nHarden, who was playing on a bruised left calf, had 17 points in the first quarter and finished 11 of 26 from the field, including 9 of 18 on 3-pointers.\n\n\"You take those shots, you're confident in those shots and those shots will go in,\" Harden said. \"Sometimes they might not go in, but mostly, they'll go in. I just have to keep going, keep working.\"\n\nEric Gordon scored 20 points for Houston, which shot 48 percent while improving to a season-high four games above .500. Houston finished 18 of 45 on 3-pointers.\n\n\"He has a mastery of the game and a control and an ease of which he plays,\" Houston coach Mike D'Antoni said of Harden. \"It's fun to watch.\"\n\nHarden has scored at least 30 points in eight straight games, the longest such streak since Russell Westbrook had eight straight 30-point games in November 2016. Harden has scored at least 35 points in six straight games, the longest streak since Carmelo Anthony had six straight in April 2013.\n\n\"I think what James is doing is really special because he's really carrying us right now,\" Gerald Green said. \"Not only is he scoring, he's leading us.\"\n\nKyrie Irving had 23 points and 11 assists, Marcus Morris added 19 points before being ejected midway through the fourth quarter, and Jaylen Brown had 18 points off the bench for Boston, which shot 47 percent but was outrebounded 54-38.\n\n\"The first 18 minutes and then the last 24 minutes, the glass killed us,\" Boston coach Brad Stevens said. \"I thought the restricted area generally on both sides of the floor, our finishing and our lack of rebounding were separators.\"\n\nThe Rockets used a 14-4 run to end the third and start the fourth to open up a 103-90 lead on back-to-back 3-pointers by Green with 9 minutes remaining. Boston got no closer than 10 the rest of the way.\n\n\"We just weren't covering up for one another consistently enough,\" Irving said. \"That's really what it comes down to.\"\n\nHouston opened up a 41-24 advantage a minute into the second on 3-pointer by Danuel House Jr. Trailing 50-33, Boston used a 22-7 run to end the half, aided by three technical fouls against the Rockets in barely a minute, to cut the lead to 57-55 on Marcus Smart's 3-pointer. Irving had seven in the run.\n\nTIP-INS\n\nCeltics: Aron Baynes (broken finger) missed his fourth straight game. ... Robert Williams missed the game with a sore left leg. .. Al Horford had 15 points, and Smart scored 11.\n\nRockets: James Ennis missed his eighth straight game with a strained right hamstring, but D'Antoni said he was \"close\" to returning. ... Green and Austin Rivers each scored 10 points.\n\nTECHNICAL FOULS\n\nWithin a 61-second span of the second quarter, Chris Paul, who is out with a left hamstring strain but was sitting on Houston's bench, D'Antoni and Capela were all called for technical fouls. Capela's, which was the last with 2:28 remaining, was called for hanging on the rim following a dunk.\n\nMorris was called for a technical foul with 9 minutes left in the third after taking the ball to the other end of the court after being called for a foul. Morris was called for his second technical foul with 4:38 left in the fourth after arguing an offensive foul. Smart was called for a technical foul with 24 seconds remaining.\n\nUP NEXT\n\nCeltics: Visit Memphis on Saturday night.\n\nRockets: Visit New Orleans on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995305.115689
}