{
  "game_id": "0021501029",
  "espn_id": "400828916",
  "date": "Mar 19, 2016",
  "matchup": "HOU @ ATL",
  "headline": "Horford's 22 points lead hot Hawks past Rockets, 109-97",
  "body": "ATLANTA --  The Atlanta Hawks stayed hot with balanced scoring to overcome the Houston Rockets' powerful combination of Michael Beasley and James Harden.\n\nAl Horford scored 22 points, Tim Hardaway Jr. had 20 and the streaking Hawks continued to feast on Western Conference teams by beating the Rockets 109-97 on Saturday night.\n\nThe Hawks have won five straight and eight of nine. They've also won six straight against Western Conference teams.\n\nBeasley led Houston with a season-high 30 points, including 12 of the team's 14 fourth-quarter points. Harden had 25 but Donatas Motiejunas, who had 13, was Houston's only other scorer in double figures.\n\nThe Hawks, who have moved up to third in the Eastern Conference, had six scorers in double figures, including three reserves. Atlanta (41-29) is a season-high 12 games over .500.\n\n\"I think we're just peaking at the right time as a team,\" Horford said. \"It just so happens that we're playing some of the Western Conference teams.\"\n\nHardaway made a season-high five of seven 3-pointers for his second straight game with at least 20 points.\n\nThe scoring of Hardaway and Kyle Korver, who had 11 points, combined with the strong defense of Kent Bazemore and Thabo Sefolosha, who had 10 points, give the Hawks the wing depth they have lacked since losing DeMarre Carroll to free agency after last season.\n\nHardaway's sudden emergence is one reason the Hawks suddenly look stronger than only a few weeks ago.\n\n\"It feels very different,\" Horford said. \"I feel like we're a much better team. We're much more focused. Our defense is really good, despite the second quarter, and we're starting to put it together on the offensive end.\"\n\nThe Hawks' withstood Houston's 42-point second quarter. Harden, who had only two points in the opening period, had 14 points in the second and the Rockets took a 58-52 halftime lead. Harden scored nine straight points to cap a 13-0 run for the Rockets during the dominant quarter, but the Rockets couldn't maintain the pace late in the game.\n\n\"You play a team of this caliber, you have to take advantage of everything,\" Harden said. \"Down the stretch we just made some mistakes. They make you pay.\"\n\nThe Hawks pulled away in the final three minutes.\n\nA 3-pointer by Horford gave Atlanta a 100-95 lead. Following a turnover by Beasley, Sefolosha's 3-pointer stretched the lead to eight points. Horford's jam, and a free throw by Sefolosha, gave Atlanta a 106-95 advantage.\n\nHardaway scored a season-high 21 points in his first start of the season in Atlanta's 116-98 win over Denver on Thursday night.\n\nHARDEN HURTING\n\nHarden was limping as he left the locker room after the game. He twisted his left ankle when he stepped on Sefolosha's foot in a third-quarter collision. Sefolosha was called for a foul.\n\nHarden missed each of his four shots while playing only about seven minutes in the fourth quarter.\n\n\"The explosiveness wasn't there,\" Harden said. \"I felt I was a couple steps behind. ... It's frustrating, especially when you're starting to get in a groove.\"\n\nTHEY COUNT\n\nDwight Howard grinned after he made two straight free throws -- each on bank shots -- late in the second period. Howard had eight points and 17 rebounds and made four of seven free throws.\n\nTIP-INS\n\nRockets: After having a combined 17 turnovers in the last two games, Harden had only three giveaways, though two came on back-to-back possessions late in the game. ... The 42 points in the second quarter matched Houston's season high for any period. ... F Sam Dekker missed his fourth straight game with lower back soreness.\n\nHawks: Paul Millsap had 11 points and 10 rebounds. Dennis Schroder had 14 points. ... Bazemore had four points after missing one game with a right knee bone bruise. ... The Hawks committed nine of their 16 turnovers turnovers in the second period.\n\nUP NEXT\n\nRockets: At Oklahoma City on Tuesday\n\nHawks: Host Washington on Monday",
  "source": "espn_api",
  "crawled_at": 1764994606.335992
}