{
  "game_id": "0022201007",
  "espn_id": "401469162",
  "date": "Mar 11, 2023",
  "matchup": "MIA @ ORL",
  "headline": "Magic beat Heat in OT, 126-114 despite 38 points by Butler",
  "body": "ORLANDO, Fla. -- — Wendell Carter Jr. had 27 points and 11 rebounds and the Orlando Magic bounced back from a fourth-quarter collapse to beat the Miami Heat 126-114 in overtime Saturday night.\n\n\r\n              Jimmy Butler scored 38 points for the Heat, including 15 in the final six minutes of the fourth quarter when Miami overcame a 15-point deficit. Butler's 3-pointer at the buzzer of regulation sent the game to overtime.\n\n\r\n              But the Magic outscored Miami 18-6 in the extra session.\n\n\r\n              “Being able to withstand their run and shake back, after what they did late in the fourth and the buzzer-beater after they got all the momentum, that’s big-time for us,” said Jalen Suggs, who had 16 points and four steals for Orlando.\n\n\r\n              For Magic coach Jamahl Mosley, the win reminded him of the last Miami-Orlando meeting — a 107-103 Heat OT win on Feb. 11. Only this time, his young team found a way.\n\n\r\n              “I’m more proud of the fact that we were in the exact same scenario the last time we played them and we didn’t fold,” Mosley said. “We gained and learned from the experience from last time, and that shows the growth of a young team.”\n\n\r\n              The finish of the fourth quarter included a wild sequence during which Paolo Banchero’s foul on a 3-point attempt by Butler with 14.5 seconds left was overturned on replay. But Miami got the ball to Butler one last time, and he connected to tie the game.\n\n\r\n              “We didn't deserve to win,\" Butler said.\n\n\r\n              Banchero had 17 points, 10 rebounds and nine assists for the Magic. Franz Wagner had 17 points and eight rebounds before leaving with an ankle injury early in the fourth quarter.\n\n\r\n              Heat guard Kyle Lowry played 36 minutes in his first game in more than a month, and did so without starting for the first time in more than a decade.\n\n\r\n              Lowry, who had 12 points and four assists, had missed 15 games with soreness in his left knee and his return was as a backup to Gabe Vincent. It was Lowry’s first time playing as a reserve since Jan. 26, 2013. He had started in each of his last 771 games, including 94 in the playoffs.\n\n\r\n              “It was great to be back with the guys,” Lowry said.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Tyler Herro played 27 minutes, battling through food poisoning. ... Miami lost C Cody Zeller in the first half after he collided with Orlando’s Jalen Suggs. Zeller needed stitches to repair a cut near his right eye and later it was determined he also broke his nose. ... Zeller’s injury led to C Omer Yurtseven playing for the first time this season after missing much of the year with an ankle injury. ... G Duncan Robinson (health and safety protocols) missed the game, as did F Caleb Martin (left knee soreness).\n\n\r\n              Magic: Carter returned after a three-game absence and was back in the starting lineup, leading Orlando to a 54-35 rebound advantage. ... Orlando plays the Heat only once more this season on April 9 in the regular-season finale for both clubs, at Miami. \n\n\r\n              LATE TECH\n\n\r\n              Butler was called for a technical foul in the final seconds of overtime for leaving the floor early. \n\n\r\n              “I'm not going to get a fine and, league, you're not even going to think about getting a fine,” Heat coach Erik Spoelstra said, pointing straight to a camera in the postgame interview room, as if to underscore his point.\n\n\r\n              The Heat were upset with referee James Williams, especially after it seemed he ignored a request from Butler to talk about getting struck in the face.\n\n\r\n              “He got the last laugh on that one, the official did,” Spoelstra said.\n\n\r\n              UD’S FINALE\n\n\r\n              It was the 40th and, barring an unlikely playoff meeting, the final time Miami would visit Orlando with Udonis Haslem on the Heat roster. He’s retiring after the season.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Host Utah on Monday.\n\n\r\n              Magic: Visit San Antonio on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993925.3698611
}