{
  "game_id": "0021800894",
  "espn_id": "401071567",
  "date": "Feb 24, 2019",
  "matchup": "TOR vs. ORL",
  "headline": "Ross has 28 against former team, Magic beat Raptors 113-98",
  "body": "TORONTO --  Terrence Ross and the Orlando Magic shook off the disappointment of a difficult loss by taking down Ross' former team.\n\nRoss scored 28 points, Nikola Vucevic had 23 points and 12 rebounds and the Magic beat the Raptors 113-98 on Sunday, ending Toronto's winning streak at seven.\n\nJonathan Isaac scored 16 points and D.J. Augustin had 12 as the Magic won for the sixth time in seven games. Orlando had won a season-best five straight before a 110-109 home loss to Chicago on Friday, its first game following the All-Star break.\n\n\"This is the part of the season where you've got to move forward, no matter what,\" Ross said of moving past Friday's narrow defeat. \"You can't let that determine how you start the next game. You've got to make sure that you're ready to play.\"\n\nRoss, who played 4 1/2 seasons in Toronto, connected on nine of 21 attempts, including three of eight from 3-point range, and matched his season high with nine rebounds. He has led the Magic in scoring 11 times this season, including five of the past 10 games.\n\n\"He's been great,\" Vucevic said. \"When he scores for us like that, it just gives us a huge advantage.\"\n\nOrlando made 12 of 20 field goals in the fourth quarter and led by double digits for the final nine minutes.\n\n\"I thought we played hard, with a ton of intensity, and we had good purpose of play,\" coach Steve Clifford said.\n\nKyle Lowry had 19 points and 10 assists and Pascal Siakam had 10 points and 11 rebounds for the Raptors, who lost for the first time since Jan. 31 against Milwaukee.\n\n\"Just never really got in a rhythm,\" coach Nick Nurse said. \"They made some big shots every time we thought we were right where we needed to be.\"\n\nRaptors forward Kawhi Leonard (rest) did not play after scoring 25 points, 19 of them in the second half, in Friday's home win over San Antonio. Nurse said Leonard will return for Tuesday's game against Eastern Conference rival Boston.\n\nToronto is 13-4 without Leonard.\n\n\"We just didn't execute,\" Lowry said.\n\nMarc Gasol scored 16 points and Serge Ibaka had 14, extending his streak of consecutive games with at least 10 points to a career-best 22.\n\nThe Magic led 53-30 at halftime and took an 80-71 lead into the final quarter.\n\nTIP-INS\n\nMagic: G Isaiah Briscoe (NBA concussion protocol) was inactive. Briscoe matched his career high with 10 points against Chicago on Friday. ... Orlando handed Toronto its biggest defeat of the season on Dec. 28, a 116-87 home victory.\n\nRaptors: Gasol made his first start for Toronto, replacing Ibaka. ... Anunoby started in place of Leonard. ... G Jodie Meeks scored 10 points in his Raptors debut. ... Toronto is 7-1 in February.\n\nFAIR AND FOUL\n\nAfter hitting just 13 of 24 free throws against the Bulls, the Magic were better at the foul line against Toronto. Ross connected on all seven of his attempts from the stripe and Orlando made 15 of 20 overall.\n\nUNDER 100\n\nThe Magic are 13-3 when holding their opponent to fewer than 100 points. Orlando has done it three times in its past four victories.\n\nEXCLUSIVE COMPANY\n\nThe Magic are one of three Eastern Conference teams with multiple victories against Toronto this season. Milwaukee (three wins) and Boston (two) are the others. Toronto has also lost twice to Denver.\n\nUP NEXT\n\nMagic: At New York on Sunday night.\n\nRaptors: Host Boston on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994101.6383848
}