{
  "game_id": "0021500246",
  "espn_id": "400828133",
  "date": "Nov 29, 2015",
  "matchup": "MIL @ CHA",
  "headline": "Walker scores 22, Hornets hold off Bucks",
  "body": "CHARLOTTE, N.C. -- The Charlotte Hornets are finding ways to win games this season, even without big man Al Jefferson.\nKemba Walker scored 22 points, and the Hornets overcame the early loss of Jefferson against the Milwaukee Bucks to hold on for an 87-82 victory Sunday.\nNicolas Batum added 15 points, Jeremy Lamb 14 and Marvin Williams 12 for the Hornets, who have won five of six, all at home, and 10 of 15 during the month of November.\n\"That's pretty good. It's been a great month for us,\" Walker said. \"But we've got great depth now. Guys are always willing to step up and make plays.\"\nCharlotte relied on its depth against the Bucks, especially after Jefferson went out of the game with a left calf strain with 5:09 remaining in the first quarter, and did not return.\nJefferson left Time Warner Cable Arena wearing a protective boot on his left foot, and will undergo an MRI on Monday, according to Hornets coach Steve Clifford.\nWith Jefferson out, Charlotte's bench went on to outscore Milwaukee's reserves 34-15 and outrebound them 27-16.\n\"We had a lot of guys step up,\" Clifford said. \"We have a lot of guys who can individually play better as they learn how to help each other play better.\n\"Obviously, from a team standpoint, there are a lot of things that we need to do better. We have a good team, but we have a team that can keep getting better.\"\nStill, the Bucks had their chance late in the fourth quarter, rallying from an 11-point deficit early in the second half to tie it at 80 on Greg Monroe's layup with 1:05 remaining.\nBut Batum put the Hornets back on top with a 3-pointer 19 seconds later and Walker followed with a short jumper and two free throws to extend Charlotte's lead.\n\"Big-time shot by a big-time player,\" Milwaukee coach Jason Kidd said of Batum's 3-pointer. \"We switched, and I kind of think we relaxed. Batum just pulled up and shot the 3.\"\nKhris Middleton had 19 points for the Bucks, who have lost three straight. Monroe added 17 points and 10 rebounds, O.J. Mayo 12, Jerryd Bayless 11 and Jabari Parker 10.\nTIP-INS\nBucks: Kidd was back on the bench after serving a one-game suspension for swiping the ball away from a referee during the team's 129-118 loss to Sacramento on Wednesday. . Without Jefferson on the court, the Bucks went on to outscore Charlotte 44-18 in the paint.\nHornets: The Hornets shot just 38.6 percent from the field (27 of 70) and turned the ball over 14 times, but were 15 of 31 on 3-pointers (tying a franchise record) and 18 of 22 on free throws.\nSHAKEUP\nThe Bucks, who had lost five of six, shuffled their starting lineup Sunday, going with Mayo and Bayless at guards instead of Parker and Michael Carter-Williams. The change appeared to help Milwaukee, which led by as many as 11 points in the first quarter. \"I thought the lineup switch got us off to a really good start,\" Kidd said. \"Defensively, guys were into it. We got a lot of deflections. We had multiple shooters on the floor.\"\nTURNING POINT\nThat came in the second quarter, when Charlotte opened the period by scoring 14 unanswered points, turning a six-point Milwaukee lead into a 36-28 Hornets lead. Charlotte would go on to outscore the Bucks 23-9 in the period. \"When you win three out of four quarters, you tend to win NBA games,\" Kidd said. \"Unfortunately, that second quarter we scored nine points, so we have to look at that.\"\nUP NEXT\nBucks: Visit Denver on Monday night.\nHornets: Host Golden State on Wednesday night.\n---\nThis story has been corrected to show that Middleton had 19 points.",
  "source": "espn_api",
  "crawled_at": 1764994090.12171
}