{
  "game_id": "0021800589",
  "espn_id": "401071265",
  "date": "Jan 06, 2019",
  "matchup": "TOR vs. IND",
  "headline": "Powell scores-season-high 23, Raptors beat Pacers 121-105",
  "body": "TORONTO --  Kyle Lowry returned from injury to help the Toronto Raptors extend a run of home dominance over the Indiana Pacers.\n\nNorman Powell scored a season-high 23 points, Pascal Siakam had 12 points and 10 rebounds, and the Raptors beat Indiana 121-105 on Sunday night, snapping the Pacers' six-game winning streak.\n\nSerge Ibaka scored 18 points, while Lowry had 12 points and eight assists after missing the previous six games because of a sore lower back.\n\n\"He's a big piece of what we're tying to do here,\" Powell said. \"It seemed like he hasn't missed a beat.\"\n\nKawhi Leonard rested on the second night of a back-to-back, but Lowry played 32 minutes and shot 4 for 10, going 2 for 6 from 3-point range.\n\n\"Good to be out there with my guys,\" Lowry said. \"It felt good to be able to help them get a win.\"\n\nThe Pacers lost their 11th consecutive game north of the border. Indiana's most recent win Toronto was March 1, 2013.\n\nLowry also had three steals and three rebounds, and took a pair of charges.\n\n\"There's about 32 other things out there that you're not seeing that he's doing that don't get recorded on the stat sheet,\" coach Nick Nurse said.\n\nDanny Green scored 15 points and Fred VanVleet had 12 as the Raptors returned from a victory in Milwaukee on Saturday to win their fifth straight at home.\n\nPowell made 10 of 12 shots and scored 11 points in the final quarter.\n\n\"He was really good tonight,\" Nurse said.\n\nGreen matched his season high with five 3-pointers and Toronto hit 17 of 33 from long range, one shy of its season best.\n\n\"They were the aggressors all night long,\" Pacers coach Nate McMillan said. \"We never really established that we could stop them.\"\n\nIt was the fifth time this season the Raptors have faced a team that had won at least five straight games. Toronto is now 3-2 in such encounters, also beating Miami on Dec. 26 and Milwaukee on Saturday.\n\n\"Hopefully this will be an eye-opener for us, and realize we've got a lot of work to do if we want to get to where we want to be,\" Indiana's Victor Oladipo said.\n\nBojan Bogdanovic scored 21 points, Domantas Sabonis had 16 points and 11 rebounds, and Oladipo scored 16 points for Indiana. The Pacers have lost five straight and 14 of the past 16 against the Raptors.\n\nThaddeus Young scored 14 points and Darren Collison had 11.\n\nIndiana has won 13 of its past 16, losing twice to Toronto and once to Cleveland in that span. The Raptors rallied from a 17-point deficit to beat the Pacers 99-96 on Dec. 19.\n\n\"This is a tough place to play,\" McMillan said. \"They make it a tough place to play, and we haven't had success here in a number of years.\"\n\nBoth teams shot better than 60 percent in the first quarter but the Raptors made six of nine attempts from 3-point range to lead 37-35.\n\nPowell scored 10 points in the second and Toronto led 70-63 at halftime. Ibaka had 10 in the third as the Raptors took a 96-84 edge into the final quarter.\n\n\"Everybody was wide open tonight,\" McMillan said.\n\nTIP-INS\n\nPacers: C Myles Turner (right shoulder) was not available. Sabonis made his second start of the season. ... All five starters scored at least 10 points.\n\nRaptors: Powell's career high is 30, set at Brooklyn on April 13, 2016. ... Lowry and Leonard have played together in 21 of Toronto's 42 games. ... Lowry had not played since Dec. 22 at Philadelphia. He missed the four games before that because of a sore left thigh.\n\nBENCH BOUNCES BACK\n\nToronto got more bench points in the first quarter (six) than it did in all of Saturday's win at Milwaukee (five). The Raptors finished with 52 bench points.\n\n\"We talked about coming out and setting a tone, bringing the energy and playing our game,\" Powell said.\n\nKAWHI RESTS\n\nLeonard has been held out of at least one game of all eight back-to-backs so far this season, one year after being limited to nine games with San Antonio because of a quadriceps injury.\n\nUP NEXT\n\nPacers: Visit Cleveland on Tuesday night.\n\nRaptors: Host Atlanta on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994112.056271
}