{
  "game_id": "0022200380",
  "espn_id": "401468535",
  "date": "Dec 09, 2022",
  "matchup": "ATL @ BKN",
  "headline": "Durant, Irving help Nets edge Hawks to end 6-1 homestand",
  "body": "NEW YORK -- — Kevin Durant scored 34 points, Kyrie Irving had 33 points and 11 rebounds and the Brooklyn Nets finished a seven-game homestand at 6-1 by beating the Atlanta Hawks 120-116 on Friday night.\n\n\r\n              TJ Warren added 14 points and Ben Simmons returned from a four-game absence with a left calf strain with six points, seven rebounds and six assists as the Nets won for the ninth time in 12 games overall. \n\n\r\n              They hadn't played seven straight home games since moving to Brooklyn a decade ago and they took advantage, losing only to the NBA-leading Boston Celtics while surging into fourth place in the Eastern Conference. \n\n\r\n              Simmons said the successful homestand meant a lot to the Nets, who improved to 15-12 after a 1-5 start.\n\n\r\n              “We know we’ve got a long way to go,” Simmons said. “A lot of guys have been in and out of the rotation obviously so it’s changing a lot, but we’re just staying focused and we’re building day by day.” \n\n\r\n              Brooklyn held on to pull this one out by twice getting offensive rebounds after Durant missed jumpers with a three-point lead, with Seth Curry making two free throws after the Hawks had to foul following the second one.\n\n\r\n              “Winning plays and that’s what it boiled down to,” Nets coach Jacque Vaughn said. \n\n\r\n              Trae Young had 33 points and nine assists for the Hawks, while Bogdan Bogdanovic rebounded from a miserable game at the Knicks two nights earlier with 31 points.\n\n\r\n              Clint Capela had 15 points and 11 rebounds, but the Hawks dropped their third straight while playing without injured starters John Collins, De'Andre Hunter and Dejounte Murray.\n\n\r\n              Those guys might have been useful when the Hawks couldn't corral the rebounds of Durant's two late misses.\n\n\r\n              “Those are plays that a good team like this, they make you pay,” Hawks coach Nate McMillan said.\n\n\r\n               Durant scored 18 points in the first quarter, but the Nets had to rally after the Hawks came back to take the lead in the fourth. Durant's 3-pointer with 3:17 to play gave Brooklyn back the lead for good and he finished the scoring with two free throws with 6.3 seconds remaining. \n\n\r\n              Durant was 9 for 11 in the first quarter as the Nets led 36-30. Bogdanovic had 13 points in the second as the Nets took a 68-64 edge to the break.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Bogdanovic was 3 for 16 overall and missed all 10 3-point attempts in the loss at Madison Square Garden. ... Trent Forrest returned after missing three games while in concussion protocol.\n\n\r\n              Nets: Starting center Nic Claxton sat out with right hamstring tightness. ... The Nets improved to 6-0 against Southeast Division teams. They are 14-4 record against Atlanta since the start of the 2017-18 season.\n\n\r\n              IN OR OUT\n\n\r\n              Vaughn said he expected Simmons to sit out Saturday in Indiana on the second night of back-to-back games but that Yuta Watanabe would return after a nine-game absence with a strained right hamstring. Neither Vaughn nor Durant was certain whether the superstar forward, who came into the game second in the league with nearly 37 minutes per game and logged 36 Friday, would play.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Chicago on Sunday\n\n\r\n              Nets: At Indiana on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994841.450869
}