{
  "game_id": "0021500097",
  "espn_id": "400827984",
  "date": "Nov 08, 2015",
  "matchup": "OKC vs. PHX",
  "headline": "Thunder beat Suns 124-103 to snap 3-game skid",
  "body": "OKLAHOMA CITY -- The Thunder looked more like they usually do on Sunday night.\nKevin Durant had 32 points and 11 rebounds and Oklahoma City beat the Phoenix Suns 124-103 to snap a three-game losing streak.\nRussell Westbrook had 21 points, 13 assists and six rebounds, and Enes Kanter had 21 points on 9-of-10 shooting for the Thunder, who forced 23 turnovers and outrebounded Phoenix 52-33.\n\"I thought we were impressive tonight,\" Westbrook said. \"We did a better job of being aggressive and not letting people come at us, which led to us doing what we do -- getting out into transition and getting steals.\"\n\nDion Waiters added 19 points and the Thunder shot 52 percent overall and 61 percent in the second half.\nOklahoma City opened the season with three straight wins, then lost the next three by a combined 16 points. The Thunder never led Phoenix by fewer than nine in the fourth quarter.\nEric Bledsoe had 28 points and 11 assists, but he was held to eight points on 3-for-6 shooting in the second half.\n\"Pick-and-roll coverage was a lot better in the second half, and we did a good job of keeping the ball in front of us,\" Westbrook said.\nMarkieff Morris scored 19 points and T.J. Warren added 17 for Phoenix, which lost for the third time in four games.\nThe Thunder led 60-54 at halftime. A wild sequence during which the Thunder nearly turned the ball over several times ended with an easy layup for Andre Roberson that gave Oklahoma City a 76-63 lead in the third quarter. A fast break led to a nifty bounce pass from D.J. Augustin to Kanter, who scored and was fouled. The free throw bumped Oklahoma City's edge to 89-75.\nThe Thunder reserves, who were badly outplayed in the first half, handled business early in the fourth quarter. A fast-break dunk by Mitch McGary put Oklahoma City up 96-81 with just under 10 minutes to play.\nAfter some of the starters returned, Durant hit a pull-up 3-pointer, then a fast-break layup to make it 110-90 with six minutes remaining.\n\"It's hard to come back from a team that shoots the ball so well when there is no pressure on them with the lead, when it seemed like they made every shot,\" Phoenix coach Jeff Hornacek said. \"They outplayed us.\"\n---\nUPS AND DOWNS\nOklahoma City has scored at least 112 points in all four of its wins this season and shot at least 45.5 percent from the field in each game. The Thunder have allowed more than 100 points in six of seven games so far under new coach Billy Donovan, and have surrendered at least 103 points in all four losses.\nWESTBROOK'S PASSING\nWestbrook, the league leader in assists, has 10 or more dimes in five of his first seven games. He now averages 10.9 assists, to go along with 26.3 points and 7.0 rebounds per contest.\nSTAT LINES\nThe Thunder shot 75 percent in the fourth quarter to make up for committing seven turnovers.\nSTAT LINES II\nBledsoe had eight assists and one turnover in the second half.\nQUOTABLE:\nHornacek, on Westbrook's rebounding: \"When he shoots the ball, by the time he hits the floor, he's going back after the rebound. He had three or four of those tonight. ... That is just being relentless and wanting the ball.\"\nTIP-INS\nSuns: Bledsoe scored 15 points in the first quarter, the most he's ever scored in an opening period in his six-year career. ... Bledsoe made 6 of 7 field goals in the first quarter. The rest of the team made 4 of 18. ... Bledsoe's 20 points in the first half was the second-highest first-half total of his career.\nThunder: Center Steven Adams started, despite a sore back. He finished with seven points, five rebounds and five blocks in 19:31. ... Westbrook had six points, six assists and three steals in the first quarter. ... Oklahoma City led by 15 points in the first quarter, but the score was tied at 29 at the end of the period. ... Oklahoma City made just 1 of 11 3-pointers in the first half. ... Anthony Morrow, one of Oklahoma City's top scorers in the second half of last season, did not play.\nUP NEXT\nPhoenix hosts the Los Angeles Clippers on Thursday night.\nOklahoma City plays at Washington on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994221.654568
}