{
  "game_id": "0021900530",
  "espn_id": "401161172",
  "date": "Jan 04, 2020",
  "matchup": "CHA @ DAL",
  "headline": "Rozier hits key shots as Hornets top Mavericks 123-120 in OT",
  "body": "DALLAS --  Miles Bridges flexed his muscles at the crowd when Luka Doncic's potential winning 3-pointer over him bounced off the rim at the end of the fourth quarter.\n\nThen the Charlotte forward escaped trouble in overtime with a pass to wide-open Terry Rozier for a 3 that put the Hornets up for good.\n\nRozier scored 29 points, including the go-ahead shot from long range in the extra period after his tying basket in regulation, and the Hornets beat Doncic and the Dallas Mavericks 123-120 on Saturday night.\n\nDevonte Graham had 27 points and 13 assists as the Hornets erased a 12-point deficit in the fourth quarter after leading by 20 in the first half of their second straight win after a season-worst six-game losing streak.\n\n\"We just stayed resilient,\" said Bridges, who had 11 points and 11 rebounds. \"We could have given up when they went up by 12. We didn't give up. We needed that win.\"\n\nDoncic set a Dallas season record with his NBA-leading 10th triple-double, scoring 39 points with 12 rebounds and 10 assists. But the 2019 Rookie of the Year had a turnover and two missed 3s late in regulation.\n\n\"We should have won it in the fourth quarter,\" said Doncic, who had just two points in overtime after scoring 10 each in the third and fourth quarters. \"I messed it up. I didn't make great decisions. Terrible decisions.\"\n\nMaxi Kleber scored a career-high 24 points after getting his season high of 18 in the previous game for Dallas.\n\nKleber hit a tying 3 with 1:02 remaining in overtime to top his previous career best of 21. But Rozier, who was 10 of 15 overall and 5 of 8 from long range, answered with a 3-pointer at the other end on a pass from Bridges for a 117-114 lead.\n\n\"I give our group a lot of credit to come out and get up whatever it was, double digits early, play with poise, play with urgency, play with force,\" Charlotte coach James Borrego said. \"And then to lose that lead, how do we respond? That's all we talked about in the timeout, how are we going to respond?\"\n\nThe Hornets scored the final six points of regulation to force overtime. After a turnover by Doncic, P.J. Washington drove for a dunk and Rozier hit a leaning layup for a 103-all tie with 19 seconds left after Doncic missed a 3 at the other end.\n\nDallas tried Doncic again at the end of regulation, but his 3 over Bridges missed, and Bridges celebrated with his silent flex as he went to the bench.\n\nWashington scored 19 points on 9-of-12 shooting, and Bismack Biyombo had 11 points and 13 rebounds.\n\nJ.J. Barea had 11 points and nine assists in his second straight start -- and first two of the season -- with shooting guard Tim Hardaway Jr. sidelined for a third consecutive games by a left hamstring strain. Kristaps Porzingis has been out the same three games with right knee soreness.\n\nBACKING DONCIC\n\nDallas coach Rick Carlisle sounded off before the game on what he believes is intentionally rough play by opponents against Doncic.\n\n\"It's been going on the entire season,\" Carlisle said. \"Teams are taking liberties on him. It's not good. But he's handling it very well.\"\n\nCarlisle said he talks to game officials when he thinks it's happening in a game, but wouldn't specifically say he has brought it up with NBA officials.\n\n\"He's a great player so people are going to go after him,\" Carlisle said. \"It doesn't mean that a lot of this stuff is right or in the spirit of what the game should look like. He's got scratches all over his arms all the time, stuff like that. Not good.\"\n\nDoncic said he wasn't surprised Carlisle spoke up for him.\n\n\"It's true. I'm not going to lie,\" he said. \"But it's just basketball. It's a physical game. I've just got to keep going.\"\n\nTIP-INS\n\nHornets: Charlotte had five offensive rebounds on one possession and still didn't score. Cody Zeller missed the first layup, and the subsequent tip, before Bridges missed three straight tip attempts. Malik Monk got the fifth straight rebound and took the ball out before getting called for a charge while trying to drive for a bucket.\n\nMavericks: It was the 20th anniversary of owner Mark Cuban's purchase of the team. He was given a standing ovation after a video tribute in the first half. ... Dwight Powell fouled out in the final minute of overtime with 11 points and seven rebounds. ... Dorian Finney-Smith had 15 points and eight rebounds.\n\nUP NEXT\n\nHornets: Host the Indiana Pacers on Monday.\n\nMavericks: Third game of season-high six-game homestand against Chicago on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996073.63953
}