{
  "game_id": "0021800244",
  "espn_id": "401070925",
  "date": "Nov 19, 2018",
  "matchup": "MEM vs. DAL",
  "headline": "Conley and Gasol lead Grizzlies past Mavericks 98-88",
  "body": "MEMPHIS, Tenn. --  While the rest of the NBA trends toward high-scoring, fast-paced offenses, the Memphis Grizzlies are relying on defense.\n\nAnd the longtime partnership of Mike Conley and Marc Gasol.\n\nConley scored 28 points, Gasol had 17 points and 15 rebounds, and the Grizzlies pulled away over Dallas 98-88 on Monday night to snap the Mavericks' four-game winning streak.\n\n\"In today's league, I think a lot of teams are so used to things being easy, nobody really wants to play defense,\" Conley said. \"Everybody wants to get up and down and shoot 3s. So, when they come upon a team that gets into you and is physical and actually plays defense, it's a different game for them.\"\n\nThis one had 17 lead changes and 15 ties before Memphis reeled off 10 straight points in the late stages for the biggest lead in the game for either team. Garrett Temple and Conley each converted 3-pointers in the stretch that gave Memphis the lead for good. The Mavericks' 88 points were not only a season low, but the first time this season Dallas didn't reach 100.\n\n\"That's what Memphis is all about,\" said guard Dennis Smith Jr., who led the Mavericks 19 points. \"They've been like that for years.\"\n\nNeither teams held a lead of more than six points until the final Memphis rally. Several Memphis players said their physical play can wear teams down, and at some point, cracks start showing in the opponents' play.\n\nAs it did in the fourth quarter.\n\n\"I thought we played three tough, solid quarters,\" Dallas coach Rick Carlisle said. \"And then the fourth, we had some breakdowns.\"\n\nJaren Jackson Jr. finished with 13 points and Temple added 12 as Memphis won its sixth in the last seven.\n\nDeAndre Jordan added 17 points and a season-high 20 rebounds. Luka Doncic had 15 points and 10 rebounds -- the rookie's first double-double of his career -- but was 6 of 20 from the field.\n\nThe main impact from the Memphis defense wasn't on turnovers -- Dallas ended the game with 11 -- but rather the Mavericks shooting a season-low 34 percent.\n\n\"We want to be a unique team -- you see all these high, high scoring games -- that holds teams to under 90 points. And grinds out wins,\" Temple said.\n\nTIP-INS\n\nMavericks: Doncic was 0 of 6 in the first quarter before converting the first shot of the second quarter. ... Dallas made only four 3-pointers in the first half, including three by Dorian Finney-Smith. Doncic had the fourth one. ... Jordan has led Dallas in rebounding in all but one game this season (Harrison Barnes with 13 on Nov. 6 against Washington). ... The Maverick previous low in points for a game this season was in the season-opener when they scored 100 points in a loss to Phoenix\n\nGrizzlies: Conley converted a 4-point play in the closing seconds of the first half. ... Gasol had eight rebounds in the first quarter. His 15 for the game was a season-high. ... Gasol, who entered the game having made 12 of 25 3-pointers over the last three games, missed all five of his shots from outside the arc. ... Memphis won its 11th game of the season, halfway to last year's total of 22.\n\nSEE YOU COME SPRING TIME\n\nThe two teams will not meet again until March 2 at Dallas. Then the Southwest Division foes will play a back-to-back in April -- in Dallas on April 5 and then in Memphis on April 7.\n\nCONLEY SHOOTING\n\nConley, coming off a season where a played only 12 games because of a season-ending heel injury, struggled shooting in the early stages this year as he got back into game shape. He has connected on 50 of 102 shots over his last six games. \"I sure hope you didn't think I was going to shoot like 10 percent for the rest of the year\" Conley said after the game.\n\nUP NEXT\n\nMavericks: Host Brooklyn on Wednesday night.\n\nGrizzlies: Travel to San Antonio to face the Spurs on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994947.858484
}