{
  "game_id": "0021900920",
  "espn_id": "401161562",
  "date": "Mar 04, 2020",
  "matchup": "MEM @ BKN",
  "headline": "Grizzlies rout Nets 118-79 in Brooklyn for 3rd straight win",
  "body": "NEW YORK --  Josh Jackson scored 19 points and the Memphis Grizzlies ran away from the Brooklyn Nets during the second half of a 118-79 blowout Wednesday night in a matchup of teams trying to maintain playoff position.\n\nTyus Jones added 18 points for Memphis, which extended its winning streak to three games. Ja Morant scored 15.\n\nThe win moved Memphis back to .500 at 31-31, and the Grizzlies are 3 1/2 games ahead of Sacramento for the final postseason spot in the Western Conference.\n\n\"I think it would mean a lot,\" Morant said about making the playoffs. \"We're a whole new team. We're young. To make the playoffs again, I can't tell you the last time they made the playoffs, but for us to make it would be special.\"\n\nTaurean Prince had 15 points, and Caris LeVert and Chris Chiozza added 14 apiece for Brooklyn.\n\nMemphis opened the second half on a 12-2 run to take a 64-47 lead and never looked back as the Grizzlies built a 41-point lead in the fourth quarter, with the bench unit dancing on the sideline.\n\n\"I think collectively we didn't like our compete level and our spirit wasn't where it needed to be,\" Nets coach Kenny Atkinson said. \"We talked about it in the locker room. The coaches and players had a good old-fashioned ... great communication. These are the moments where you really have to embrace the adversity.\"\n\nMemphis took a 52-45 lead into the locker room at halftime as Jones led the Grizzlies with 10 points. LeVert led Brooklyn with 10 in the first half.\n\nBrooklyn led 23-22 after the first quarter as both teams struggled mightily shooting from the floor.\n\nThe Nets are a half-game ahead of Orlando for the eighth seed in the East.\n\n\"I think you build through struggles like this, games like this and stretches like this, but I'll tell you this: We've got to play better if we're going to stay in this playoff hunt,\" Atkinson said.\n\nTIP-INS\n\nGrizzlies: Coach Taylor Jenkins praised LeVert's growth from afar. \"He's clearly put in all the work, where he can be a dynamic scorer and another guy that sets a tone for them defensively with his size, length and athleticism, and guard multiple positions,\" Jenkins said. ... F Jaren Jackson Jr. is \"progressing in a positive direction\" and could return from a knee sprain as early as next week after being re-evaluated, Jenkins said.\n\nNets: Atkinson said the Nets will feature LeVert heavily on offense going forward and has encouraged him to take more 3-pointers. ... Garrett Temple (left ankle sprain) sat out.\n\nUP NEXT\n\nGrizzlies: Visit the Dallas Mavericks on Friday night.\n\nNets: Host the San Antonio Spurs on Friday night.\n\n---\n\nMore AP NBA:  https://apnews.com/NBA  and  https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995684.0123332
}