{
  "game_id": "0021900321",
  "espn_id": "401160963",
  "date": "Dec 06, 2019",
  "matchup": "CLE vs. ORL",
  "headline": "Magic win fourth straight, 93-87 over slumping Cavaliers",
  "body": "CLEVELAND --  The Orlando Magic spent last season climbing back to relevance. They're at it again.\n\nTerrence Ross scored 21 points, Evan Fournier added 18 and Aaron Gordon had a big dunk in the final 20 seconds to lead the Magic to their fourth straight win, 93-87 Friday night over the slumping Cleveland Cavaliers, who have dropped four in a row and 11 of 12.\n\nOrlando opened the season 2-6, but in winning five of six, the Magic, who had a 17-game improvement in 2018 after winning just 25 games the previous year, reached .500 for the first time.\n\n\"It's good we've gotten back there after the way we started, but time will tell how good we are,\" said Ross, who made two 3-pointers early in the fourth. \"We've got three tough games coming up that will test us.\"\n\nThe Magic face a brutal stretch over the next week, playing at Milwaukee and home against the Los Angeles Lakers and Houston.\n\nCollin Sexton scored 19 points and Cedi Osman 14 for Cleveland, which pulled within 90-87 on rookie Darius Garland's jumper with 42.5 seconds left.\n\nThe Cavs needed a defensive stop on Orlando's next trip, but instead they gave up a dunk on a baseline out of bounds play with just three seconds left on the 24-second shot clock to Gordon, who managed to get free in the lane and scored over Tristan Thompson.\n\nOn Cleveland's next possession, Larry Nance Jr. threw away the ball trying to hit Sexton on the opposite wing, ending the Cavs' last chance at a comeback.\n\nOrlando's surge has come without center Nikola Vucevic, who missed his eighth straight game with a sprained right ankle.\n\n\"Once the big guy comes back, we'll be even more dangerous,\" Fournier said. \"We need to keep the same intensity and focus we're playing with now.\"\n\nDespite another loss, first-year coach John Beilein saw enough positives to feel good about his young squad, which is going through some expected growing pains that are hurting more than expected.\n\n\"It reminded me a lot of what we were playing like at the beginning of the year,\" Beilein said. \"We were gritty. We were tough. Just played really hard, something the coaching staff has been working with them on the last couple of weeks.\"\n\nCleveland was without star forward Kevin Love, who has been battling a flu bug the past few days and stayed home to rest. The Cavs are hoping Love will be available Saturday in Philadelphia. Love recently missed three games with a bruised back and his name is already surfacing in trade rumors.\n\nCHEAP SHOTS\n\nBefore the game, Beilein addressed a report that players have complained about his coaching style. The Athletic, quoting anonymous Cleveland players, said Beilein's methods are not working and they've begun tuning him out.\n\nThe former Michigan coach believes he has his player's attention and said they've been receptive.\n\n\"We really had more than one of them, two, three, four we've met with and it's like, `Coach, keep doing what you're doing because we really need this. We need accountability, we need to play harder, stronger, tougher. Don't stop what you're doing.\"\n\n\"I have a lot of confidence the guys in the locker room are on board, and they've told me that.\"\n\nCOACH'S BACKING\n\nMagic coach Steve Clifford offered his unsolicited support of Beilein.\n\n\"I've known coach Beilein longer than anybody,\" he said. \"He's a phenomenal coach and he's won at every level. This league is a tough league. All I know is he'll find a way to win. It's not easy to do and there is very little growth at any level in any team sport without any conflict.\n\n\"When a guy says something behind the scenes and they won't own it, as a coach, it gets very frustrating.\"\n\nTIP-INS\n\nMagic: Gordon sat out Orlando's win over Cleveland on Nov. 27 with an ankle injury. ... F Jonathan Isaac had four of Orlando's nine blocks. ... Browns defensive coordinator Steve Wilks visited Clifford following the game. They became friends when Wilks worked for the Carolina Panthers.\n\nCavaliers: Nance, who had 11 rebounds, was disappointed teammates commented about Beilein behind his back. \"Ideally you want to keep that in house if there was those issues,\" he said. \"I guess that's today's NBA. ... I've never had an issue with a coach in my career, him being no different. I wanted to play for him at Michigan. I'm enjoying it.\" ... Rookie G/F Dylan Windler scored eight points in his debut for the Canton Charge as he works his way back from a leg stress reaction. ... As part of their 50th anniversary celebration, the Cavs honored players from 1970-83, including Butch Lee, Elmore Smith, Jim Brewer, Jim Chones, Campy Russell and Austin Carr. ... Cleveland went 1-5 on a six-game homestand.\n\nUP NEXT\n\nMagic: Visit Milwaukee on Monday. The teams combined for 84 3-point attempts in a 123-91 Bucks win on Nov. 1.\n\nCavaliers: Visit the 76ers on Saturday. Philly can sweep the three-game season series.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996324.609577
}