{
  "game_id": "0022300351",
  "espn_id": "401584979",
  "date": "Dec 18, 2023",
  "matchup": "CHI @ PHI",
  "headline": "Coby White scores 24 as Bulls snap 76ers' six-game winning streak with 108-104 victory",
  "body": "PHILADELPHIA -- — Coby White scored 24 points and the Chicago Bulls held on to snap the Philadelphia 76ers' six-game winning streak with a 108-104 victory Monday night. \n\n\r\n              Former Sixer Nikola Vucevic chipped in 23 points while DeMar DeRozan added 15 for the Bulls.\n\n\r\n              “All of us are supporting each other and it's contagious,” said Vucevic, who had eight rebounds and shot 10 for 18 from the floor. “We won some games, so that helps, too. We're only 11-17, but hopefully we're on a good path and we can continue that way.”\n\n\r\n              The Bulls have won six of their last nine even though they are playing without All-Star Zach LaVine, who has been sidelined with left foot inflammation and is likely still a little bit away from returning.\n\n\r\n              “We've competed well against the better teams,” Bulls coach Billy Donovan said. “It's a matter for us of maintaining more consistency. The ups and downs of the game are going to happen for every team. I like the way that we are responding.”\n\n\r\n              Joel Embiid had 40 points and 13 rebounds, his 11th straight game with 30 or more points and 10 or more boards. Tyrese Maxey added 29 points in the 76ers' first loss to a team without a winning record this season after starting 12-0 against sub-.500 teams. No other Sixers player was able to crack double figures.\n\n\r\n              “We were just a half step behind on some stuff and they beat us to some rebounds,” 76ers coach Nick Nurse said. “Some of our defensive stuff, while good at times, wasn't good enough on others. And we just didn't get enough good enough individual performances around the horn that we've been getting.”\n\n\r\n              The Sixers' previous five wins, against Atlanta, Washington, Detroit twice and Charlotte, came by an average of 31.8 points.\n\n\r\n              Chicago overcame an early 12-point deficit thanks to White's hot shooting in the first half, when he scored 16 points as the Bulls opened a 55-44 lead. White is averaging 22.9 points in Chicago's last nine games.\n\n\r\n              “I knew that he was capable of doing this, but obviously when Zach went down he has become aggressive and taken advantage of the situation,” Vucevic said. “I'm really happy for him. He's a great guy who is always working hard in the gym and getting better.\"\n\n\r\n              That margin would swell to 12 after three quarters before the Sixers bench climbed their way back into the game and gave Philadelphia a brief 89-87 lead on Maxey's 3-pointer. However, Chicago was able to shrug it off and answered with a 13-2 run that gave the Bulls an eight-point lead with just three minutes to play.\n\n\r\n              DeRozan hit three of four free throws in the game's waning seconds. Philadelphia's last attempt to tie or take the lead fell short when Embiid couldn't finish with Vucevic and White collapsing down on him in the lane.\n\n\r\n              “The most important thing right now for us is five guys connected,” Donovan said. “If you don't have that and the talent level is equal or you are undermanned ... you have zero chance to win. None. So I think the most important thing has been the sharing of the basketball, the moving of it and the covering for each other.\" \n\n\r\n              NEXT\n\n\r\n              Bulls: Host the Los Angeles Lakers on Wednesday night\n\n\r\n              76ers: At home against Minnesota on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995908.557302
}