{
  "game_id": "0021600557",
  "espn_id": "400899978",
  "date": "Jan 07, 2017",
  "matchup": "DAL vs. ATL",
  "headline": "Hardaway, Schroder lead Hawks over Mavericks 97-82",
  "body": "DALLAS --  Tim Hardaway Jr. and Dennis Schroder made sure Atlanta had 3-point shooting covered on Saturday night.\n\nHours after the Hawks traded Kyle Korver, their leading long-range shooter, Hardaway and Schroder combined for 42 points and 8-for-13 3-point shooting to beat the Dallas Mavericks 97-82.\n\n\"Coach just said to be ready to go tonight,\" Hardaway said. \"I felt good today at shootaround. We all know that we prepare for this moment, and you just have to take care of the opportunity at hand. I think we all did that tonight.\"\n\nHardaway finished with 22 points, going 5 of 8 on 3-pointers off the bench. Schroder scored 20 and was 3 for 5 from 3-point range. The Hawks exceeded their season average with 11 3-pointers in 22 attempts.\n\n\"I thought Tim was great,\" coach Mike Budenholzer said. \"Tim has played well often this year, and he did that again tonight.\"\n\nDallas' Dirk Nowitzki said he wasn't surprised by Hardaway.\n\n\"We talked about him. He's been hot.\"\n\nHardaway is 18 for 31 (58 percent) in the last four games and could assume a bigger role with Korver headed to Cleveland.\n\n\"We're going to miss (Korver) as a teammate and a brother,\" Hawks center Dwight Howard said. \"It's a part of the business that you never know what can happen.\"\n\nHoward had 20 rebounds and 15 points for Southeast Division leader Atlanta, which has won six straight games, the last three on the road.\n\nHarrison Barnes led Dallas with 21 points. Nowitzki and Devin Harris had 11 apiece.\n\nJ.J. Barea led a fourth-quarter surge that cut the Hawks' advantage to 69-67. A 15-4 run, including five points by Howard, increased the lead to 84-71 with 5:41 left.\n\n\"They hit a couple of 3s (by Kent Bazemore and Hardaway) on us,\" Dallas coach Rick Carlisle said. \"We had an untimely turnover. It was a game we couldn't ever get over the hump.\"\n\nPaul Millsap made 11 of 13 free throws for 17 points to go with nine rebounds and six assists for the Hawks.\n\nHardaway and Bazemore hit 3-pointers in the final minute of the second quarter as the Hawks went into halftime leading 45-42.\n\nHardaway and Schroder each were 2 for 2 on 3-pointers in the third quarter, which ended with a seven-point Atlanta lead.\n\nTIP-INS\n\nHawks: Neither Mike Dunleavy nor Mo Williams, the players acquired for Korver, was active for Saturday's game. ... Atlanta entered the game shooting 36 percent and averaging about 10 per game from 3-point range, including 41 percent and a team-high 65 made by Korver.\n\nMavericks: They waived G Pierre Jackson on Friday, but have an open roster spot and could re-sign him if he isn't claimed. ... Barea had missed the previous seven games because of a leg injury.\n\nTOEING THE LINE\n\nHoward, a 54 percent free throw shooter, confounded Dallas' strategy to foul him late in the game by finishing 7 for 9 (78 percent).  \"We decided to leave him in, and he made several free throws,\" Budenholzer said, \"but at some point I want to be sure we are taking care of his body.\"\n\nHEADS UP\n\nAtlanta rookie G Malcolm Delaney had a highlight-reel assist on the last field goal of the first half.\n\nDelaney started driving down the lane, but found his way blocked. In midair, he spun and threw a blind pass over his head to Hardaway deep in the right corner for a 3-pointer.\n\nNOWITZKI'S PLAYING TIME GROWING\n\nThe 38-year-old Nowitzki has played 58 minutes in the last two games. He has missed 25 of the team's 37 games because of injury.\n\n\"It's reasonable. There's a range of mid-to-high 20s and occasionally going into the 30s possibly,\" Carlisle said.\n\n\"We're not there yet. There's a long way to go before he really is back to being himself.\"\n\nUP NEXT\n\nHawks: After a brief return to Atlanta, they'll finish four straight road games on Tuesday at Brooklyn. It's their first game against the Nets this season.\n\nMavericks: Begin a two-game trip at Minnesota on Monday. The teams have not met this season, but will play twice in seven days",
  "source": "espn_api",
  "crawled_at": 1764996134.614344
}