{
  "game_id": "0021701074",
  "espn_id": "400975820",
  "date": "Mar 22, 2018",
  "matchup": "HOU vs. DET",
  "headline": "Harden scores 10 in OT to lift Rockets over Pistons 100-96",
  "body": "HOUSTON --  James Harden struggled to find his shot for four quarters before the NBA's leading scorer mustered just enough offense in overtime to help the Houston Rockets to another win.\n\nHarden scored 21 points, including 10 of Houston's 12 points in overtime, to lift the Rockets to a 100-96 victory over the Detroit Pistons on Thursday night.\n\n\"Offensively we couldn't get it going but (it's) like that sometimes,\" he said. \"Got to find ways to win games.\"\n\nAfter going 2 of 16 in regulation, including missing a shot that would have won it, Harden warmed up in overtime. He put Houston up with a basket early in the period before making it 93-90 on a three-point play after a basket by Andre Drummond. He added three free throws with about a minute left before P.J. Tucker's tip-in made it 98-90 with 21 seconds to play.\n\nBlake Griffin, who finished with a triple-double, had a 3-pointer after that, but Harden made two more free throws to push the lead to seven. Harden missed both free throws after a 3-pointer by Ish Smith with 4.2 seconds left, but the Rockets held on to extend their winning streak to seven games.\n\nThe NBA-leading Rockets improved to 58-14 to tie them with the 1993-94 championship team for the most wins in franchise history.\n\n\"There's not just one way you can win a basketball game,\" Harden said. \"We've figured that out and obviously we know one staple that has to happen and that's our defense. Once again tonight we did a really good job.\"\n\nIt was an ugly game which featured 71 missed 3-pointers combined. Houston was 12 of 51 and Detroit made just 6 of 38.\n\nEric Gordon added 22 points for Houston on a night Chris Paul sat out with a sore left hamstring.\n\n\"We found a way to ice the game,\" coach Mike D'Antoni said. \"James found ways to get to the line and manufacture points. Eric kept us in there for most of the game ... everybody had a little bit of a down day.\"\n\nGriffin had 21 points, 10 rebounds and 10 assists. Drummond had 17 points and 20 rebounds.\n\n\"We couldn't make a shot,\" Detroit coach Stan Van Gundy said. \"Their defense had a lot to do with it.\"\n\nThe Pistons trailed by nine with about 4 1/2 minutes left in regulation when Griffin made a layup to start an 11-0 run. Reggie Bullock made a 3-pointer and Luke Kennard had four points in that stretch, including two free throws that put Detroit up 88-86 with about 90 seconds remaining.\n\nHouston tied the game when Drummond was called for goaltending on a shot by Tucker with 30.5 seconds left.\n\nGriffin missed a shot with 9 seconds left and Harden's shot jump shot at the buzzer was off to send the game into overtime.\n\nAfter scoring 42 in Houston's win over Portland on Tuesday, Harden had trouble getting anything going against Detroit. He made 13 of 18 free throws, but was 0 for 8 on 3-pointers.\n\nThe Rockets opened the fourth quarter with five straight points, highlighted by a 3-pointer from Trevor Ariza, to lead 76-68 with about 10 1/2 minutes left.\n\nDetroit got within four points before a 7-2 run by Houston made it 83-74 midway through the quarter.\n\nGriffin received a flagrant foul early in the third quarter when he tripped Harden as he came down after a 3-point attempt. Harden twisted his left ankle as he landed and crashed to the court. He remained there for a couple of minutes before slowly getting to his feet and remaining in the game.\n\nHarden was limping after the game but brushed off a question about his ankle, insisting that he was \"fine.\"\n\nHe made two of three free throws as part of an 8-0 run Houston used to start the third quarter and take a 56-50 lead. The Rockets carried a 71-68 lead into the fourth quarter.\n\nDetroit led for most of the first half and was up 50-48 at halftime.\n\nTIP-INS\n\nPistons: Detroit forced 12 turnovers for its 59th straight game with at least 10, which is the longest such active streak in the NBA. ... Smith finished with 18 points. ... Reggie Jackson was 0 for 6 on 3-pointers.\n\nRockets: D'Antoni said Paul's injury wasn't serious and that he expects him to return on Saturday. ... Luc Mbah a Moute didn't play after halftime because soreness in his left knee. ... Clint Capela had 14 rebounds.\n\nLIMITING THE 3\n\nThe Rockets have limited their opponents to 29.4 percent 3-point shooting during their seven-game winning streak. Houston improved to 27-3 when its opponent makes 10 or fewer 3-pointers and 31-2 when teams shoot 33 percent or less from long range.\n\nTHEY SAID IT\n\nGriffin on the loss: \"It obviously didn't come out how we wanted but I was really proud with how hard we played and the attention to detail and executing the defensive game plan.\"\n\nUP NEXT\n\nPistons: Host Chicago on Saturday night.\n\nRockets: Host New Orleans on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764993589.2376692
}