{
  "game_id": "0022300246",
  "espn_id": "401584874",
  "date": "Nov 26, 2023",
  "matchup": "ATL @ BOS",
  "headline": "Jayson Tatum scores 34, Jaylen Brown 21 in Celtics' 113-103 win over Hawks",
  "body": "BOSTON -- — Jayson Tatum scored 34 points, Jaylen Brown had 21 and the injury-depleted NBA-best Boston Celtics beat the Atlanta Hawks 113-103 on Sunday night.\n\n\r\n              Kristaps Porzingis and Jrue Holiday were sidelined with injuries for Boston (13-4). Holiday was out for the second straight game with a sprained right ankle and Porzingis strained his left calf in a loss at Orlando on Friday afternoon. Both were dressed in street clothes and on the bench.\n\n\r\n              “We've been playing eight for the majority of the season,\" Boston coach Joe Mazzulla said. “You have to to find moments to give guys opportunities, see what we can develop and give guys chances. That was a perfect opportunity when you have guys out.”\n\n\r\n              The Celtics started Dalano Banton at guard and he played nearly 19 minutes, scoring eight points. \n\n\r\n              Derrick White added 15 points and 11 assists for the Celtics, Sam Hauser scored 12 and Al Horford had 15 rebounds with six points. Tatum added nine rebounds and Brown seven.\n\n\r\n              Trae Young paced the Hawks with 33 points and seven assists. He came in averaging 35.7 points in his last three games and made at least five 3-pointers in each. He continued that run by going 6-of-16 on 3-point attempts Sunday.\n\n\r\n              “I think his 3-point shooting is a big part of his game,” Hawks coach Quin Snyder said. “He had a lot going on at the beginning of the season. He had a baby. He's been really committed to running the team to where we're attacking collectively. ... He's recognizing when he's open and not he's not hesitating.”\n\n\r\n              De’Andre Hunter chipped in with 24 points and Bogdan Bogdanovic had 23 for Atlanta.\n\n\r\n              The Hawks announced Sunday that forward Jalen Johnson, who left Saturday night's victory in Washington, had an MRI Sunday morning in Boston that showed he has a fractured left wrist and he will be reevaluated in three-to-four weeks. \n\n\r\n              Boston never trailed and held a 14-point edge on Hauser’s 3 halfway into the final quarter.\n\n\r\n              Brown, who scored all of his points in the opening half, hit the floor hard in the third quarter, running in for a loose ball, flipping out of control onto the back of Hunter, who tried to duck under him, before landing on his own back.\n\n\r\n              “The adrenaline is wearing off now and I can feel it,” Brown said. “I'm sore but I'll be alright.”\n\n\r\n              The Hawks trailed by 19 midway into the third quarter before Bogdanovic sparked a 13-0 run with two of seven 3s.\n\n\r\n              Brown collected a long rebound off a miss by the Celtics, dribbled through traffic, down the lane and had a jam over Clint Capela that gave them a 62-48 lead late in the second quarter and brought a long, loud ovation.\n\n\r\n              Boston led 69-53 at halftime.\n\n\r\n              It was the first meeting of the teams since Boston eliminated the Hawks in six games in the opening-round of the playoffs last spring.\n\n\r\n              Mazzulla said that Porzingis will be evaluated “after a week or so.” He’s not expected to be out too long.\n\n\r\n              Young was whistled for a technical early in the first quarter and had 20 points in the first half.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: At the Cavaliers in an In-Season Tournament game on Tuesday.\n\n\r\n              Celtics: Host the Bulls in an In-Season Tournament game Tuesday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996306.545984
}