{
  "game_id": "0022000804",
  "espn_id": "401307598",
  "date": "Apr 10, 2021",
  "matchup": "DET @ POR",
  "headline": "Kanter has 30 rebounds and Blazers beat Pistons 118-103",
  "body": "PORTLAND, Ore. -- — With each rebound that Enes Kanter added to his new Portland record, his teammates on the bench wildly cheered. \n\n\r\n                    Kanter had 24 points and a franchise-record 30 rebounds, and the Blazers beat the Detroit Pistons 118-103 on Saturday night. \n\n\r\n                    Kanter bested Sidney Wicks' Portland record of 27 rebounds set in 1975. Kanter also surpassed his own career high of 26 set while with the Knicks in 2018. \n\n\r\n                    The raucous sideline cheers were a fitting tribute to Kanter, who has served as both a backup and a starter this season as needed. \n\n\r\n                    “I was so happy when I looked at the bench and everybody was up, everybody was cheering, everybody was smiling, everybody was supporting their teammates. That's what we're all about,\" Kanter said. \"That's what Blazers basketball is all about, just supporting each other.”\n\n\r\n                    Damian Lillard had 27 points and 10 assists and CJ McCollum added 26 points for the Blazers, who snapped a two-game losing streak. \n\n\r\n                    Josh Jackson had 21 points for the Pistons, who trailed by as many as 24 points. Frank Jackson finished with 17 points \n\n\r\n                    Center Jusuf Nurkic was not available for the Blazers because it was the first of a back-to-back. The starting center had knee swelling that kept him out of a game earlier this week against the Clippers. \n\n\r\n                    Blazers coach Terry Stotts said before the game that Nurkic would be available for Sunday night's game at home against Miami. Kanter started in Nurkic's place. \n\n\r\n                    “When you look at the effort that it takes to rebound, the persistence at both ends, the beating that you have to take, all of those things are tough to do,” Stotts said. “And the fact that Enes is such a great guy — you can tell by the benches' reaction, how happy the team was for him — but to get a rebound record speaks a lot about the person's will and drive.” \n\n\r\n                    Nurkic gave a shoutout to Kanter on Twitter following the game:  “The Turkish Tank” \n\n\r\n                    The Pistons, also playing the first of a back-to-back, rested Wayne Ellington. Mason Plumlee returned after missing Thursday night's victory at Sacramento because of concussion protocol. \n\n\r\n                    Carmelo Anthony's jumper put the Blazers up 43-27 in the second quarter, but the Pistons closed the gap with a 14-2 run to get to 45-41. \n\n\r\n                    Portland led 59-50 at the break. Kanter had 11 points and 16 rebounds, while Lillard led all scorers with 14 points. \n\n\r\n                    CJ McCollum's floater put the Blazers up 74-59 in the third quarter and they stretched the lead to 97-76 early in the final period on Derick Jones Jr.'s tip shot. \n\n\r\n                    “You’ve got to be a consistent 3-point shooting team. You saw how easy it was for those guys tonight. They didn’t even shoot it well and they still shot 45%,” Pistons coach Dwane Casey said. “That and the rebounding that led to 24 second chance points was the difference in the game tonight.” \n\n\r\n                    Detroit made just nine of 26 attempts from beyond the arc. \n\n\r\n                    TIP INS\n\n\r\n                    Pistons: Jerami Grant sat out of the second straight game because of a sore right knee. ... “It’s a tough league. It's competitive as heck so you’ve just got to be ready for your moment when you’re number is called,” Frank Jackson said about his performance off the bench. \n\n\r\n                    Trail Blazers: It was the second and last meeting between the two teams. The Blazers won the first, 124-101, in Detroit on March 31. ... It was Kanter's team-high 29th double-double this season. \n\n\r\n                    KANTER TO START?\n\n\r\n                    After the game Stotts was asked whether he'd consider starting Kanter, given Nurkic's issue with his knee. The coach said he'd consider it. \n\n\r\n                    “I don't know what Nurk's minute restrictions are going to be (Sunday),” Stotts said. “If Nurk continues to be at a 20-minute limit, I think it's something I would consider.”\n\n\r\n                    UP NEXT\n\n\r\n                    The Pistons visit the Los Angeles Clippers on Sunday for the first of a two-game set. The second is Wednesday. \n\n\r\n                    The Trail Blazers host Miami in the second of their back-to-back on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764997906.4536939
}