{
  "game_id": "0021801209",
  "espn_id": "401071882",
  "date": "Apr 09, 2019",
  "matchup": "CHA @ CLE",
  "headline": "Walker, Hornets keep playoff push going, beat Cavs 124-97",
  "body": "CLEVELAND --  With one game left, the Charlotte Hornets are still in the playoff chase.\n\nThere's hope, not heartache.\n\nKemba Walker scored 23 points and Charlotte kept its late-season postseason push going by pulling away in the fourth quarter for a 124-97 win Tuesday night over the Cleveland Cavaliers, whose painful first season rebuilding without LeBron James is finally over.\n\nThe Hornets (39-42) were in a must-win situation if they wanted to beat out Detroit and Miami for the No. 8 spot in the Eastern Conference. They did their part and must now defeat Orlando -- and former Charlotte coach Steve Clifford -- at home on Wednesday and hope the Pistons (39-42) lose in New York to clinch their first playoff berth in three years.\n\n\"It felt good, man,\" said Walker. \"We had great energy and great togetherness. We really wanted to win this game.\"\n\nThey really wanted the Pistons to lose, too.\n\nBut Detroit rallied from a 22-point deficit to to beat Memphis 100-93, eliminating Miami from the playoff chase and setting up a dramatic final day of the season.\n\nOnce they finished off the Cavs, Walker and several teammates watched the end of Detroit's game on a TV in their locker room. After the Pistons came back, Walker dejectedly shook his head as he walked from his locker to the shower area.\n\n\"We knew they were down 20 at one point but we also knew they were at home and they would make a run,\" Walker said. \"They played tough down the stretch and got a big win.\"\n\nJeremy Lamb added 23 points and Miles Bridges and Dwayne Bacon scored 18 apiece as the Hornets won their fourth straight.\n\nBridges didn't hide his disappointment in seeing the Pistons win.\n\n\"Of course we were mad about it,\" he said. \"They were down 22 but, hey, we have to worry about ourselves. We still have one more game. We can't worry about what they're doing.\"\n\nThe Cavs dropped their 10th in a row to finish 19-63, the fourth-worst record in franchise history and just the fifth time they've failed to win at least 20.\n\nCleveland again played without star forward Kevin Love, whose season was sabotaged early by a toe injury that required surgery and altered everything for the Cavs. Love's situation made things even tougher on the Cavs, who initially believed they could compete while recovering from the loss of James as a free agent for the second time.\n\nNow the focus turns to coach Larry Drew's future and next month's NBA draft lottery.\n\nRookie Collin Sexton scored 18 points and had a season-high 10 assists for the Cavs. He also joined Larry Bird (1979-80) and Stephen Curry (2009-10) as the only rookies in league history to average at least 16 points while making over 40% of their 3-pointers and 80% of their free throws.\n\nThere were some positives for the Cavs and none bigger than Sexton, who shrugged off a slow start and came on in the season's second half.\n\n\"Everything,\" Sexton said when asked what changed in him from Game 1 to 82. \"It's a whole change. Coming into the league people said I couldn't shoot and stuff like that, but I just kept working on it through the season and it got better and better.\"\n\nIf the Hornets get back to the postseason for the first time in three years, Walker will be the reason.\n\nThe three-time All-Star, who is scheduled to become a free agent on July 1, is averaging 34.4 points in his last five games.\n\nDREW DONE?\n\nIt may be a few days before Drew knows his fate.\n\nHe guided the Cavs through a turbulent, injury-filled season that ended with uncertainty. Before the game, Drew said, \"Let's hope not\" when asked if this season would be his last.\n\nThe 61-year-old, who replaced good Tyronn Lue after six games, was noncommittal when he was asked if wanted to return as Cleveland's coach.\n\n\"Um, I really don't want to get into that part of it right now,\" said Drew, who plans to meet with general manager Koby Altman. \"As tough as the season was, I still really enjoyed coming to work every day.\"\n\nTIP-INS\n\nHornets: F Michael Kidd-Gilchrist was not with the team for the second straight game because of personal reasons. ... C Cody Zeller was again out with a sore left knee. ... Walker enters Wednesday's game -- perhaps the final one of his career with Charlotte -- as the franchise leader in points and made 3-pointers, field goals and free throws.\n\nCavaliers: Love played 13 minutes on Sunday as a salute to close friend Channing Frye, who is retiring. Love was limited to just 22 games because of the toe and other injuries. ... Frye got a rousing ovation when he checked in and a video tribute from former teammates was shown. Frye scored 10 in the fourth quarter. ... Sexton scored in double figures in his final 23 games. He's the first Cavs rookie to play all 82 games since Andre Miller in 1999-2000.\n\nUP NEXT\n\nHornets: Lost to the Magic, Wednesday's opponent, by 38 on Feb. 14.\n\nCavaliers: Eagerly await the NBA draft lottery on May 12.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994339.1333828
}