{
  "game_id": "0022000386",
  "espn_id": "401267546",
  "date": "Feb 10, 2021",
  "matchup": "MEM vs. CHA",
  "headline": "Anderson leads Grizzlies' 3-point spree in win over Hornets",
  "body": "MEMPHIS, Tenn. -- — Kyle Anderson hit a career-high six of Memphis’ franchise-record 23 3-pointers and scored 27 points to help the Grizzlies snap a four-game losing streak with a 130-114 victory over the Charlotte Hornets on Wednesday night.\n\n\r\n                    Dillon Brooks added 20 points, Desmond Bane and Grayson Allen scored 18 each, and Ja Morant had 15 points and 11 assists.\n\n\r\n                    “I feel like we’re a very dangerous team, knocking down shots,” Morant said. “I feel like the team we have now, there’s a lot of shooting we can put on the floor. We encourage everybody from the first man to the last man when they get in the game to shoot it.”\n\n\r\n                    Terry Rozier led the Hornets with 34 points, connecting on 12 of 17 shots. LaMelo Ball added 17 points, and Gordon Hayward and Malcolm Bridges added 15 points apiece. Bridges had 10 rebounds.\n\n\r\n                    “I think we gave great effort at the beginning of the game and kind of went away from it,” Rozier said. “Got discouraged, especially in the second half when they started hitting 3s. They just never looked back.”\n\n\r\n                    The biggest burst for Memphis came in the third quarter. Anderson opened the second half with four 3-pointers in less than 3 minutes, leading to a Charlotte timeout. \n\n\r\n                    “I think I had knocked down a corner 3 in the first half, and it just felt good,” Anderson said. “It came to me about four or five times in a row (in the second half).”\n\n\r\n                    Later in the quarter, the Grizzlies had a 21-7 run and the Memphis lead swelled to 101-83 at the end of the third. Memphis outscored the Hornets 31-15 in the frame as Charlotte, which shot well in the first half, converted only six of its 20 shots.\n\n\r\n                    Charlotte never threatened the rest of the way.\n\n\r\n                    “Poor performance defensively out of our group overall,” Hornets coach James Borrego said about allowing Memphis to connect on the franchise-record 3-pointers. “The commitment we’ve had this season, tonight we were not there. We weren’t locked in.”\n\n\r\n                    Both teams started the game shooting well, but Memphis was hindered by a handful of turnovers and a half dozen fouls in the first quarter.\n\n\r\n                    The Hornets were still shooting 67.6% midway through the second quarter. Still, Memphis shot well enough for a 70-68 lead at the break. Rozier had 24 for Charlotte, while Allen led Memphis with 16 points.\n\n\r\n                    The performance was contrary to the four-game losing streak, particularly recently when the Grizzlies let games get away late.\n\n\r\n                    “I thought our spirit was good, (regardless) of what the result was in the first quarter or the first half,” Memphis coach Taylor Jenkins said. “I think our spirit was there and it just set a tone for us to continue to go out there and grind out a win.”\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Starting G Devonte Graham missed his third game with a left groin strain. “We’ll be cautious,” Hornets coach James Borrego said. “He’s getting better. He’s progressing. We just want to make sure he’s 100%. … Started the game 14 of 19 from the field.\n\n\r\n                    Grizzlies: Have won four straight against Hornets. …Anderson’s previous career high for 3-pointers was four against Brooklyn on Dec. 28, 2020. … Memphis’ previous high for 3-pointers was 21 on April 10, 2019 against Golden State. …The 130 points was the second-highest output of the season for Memphis. The Grizzlies had 133 points against San Antonio on Feb. 1. …Bane has 41 3-pointers in his rookie season, the most 3-pointers in franchise history for a player through his first 20 games.\n\n\r\n                    ASSISTS\n\n\r\n                    Both teams entered the game averaging a league-best 28.1 assists per game. Charlotte ended the night with 23 assists, while Memphis had 34 on its 47 baskets.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host Minnesota on Friday night.\n\n\r\n                    Grizzlies: At Los Angeles Lakers on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996971.136065
}