{
  "game_id": "0021900018",
  "espn_id": "401160660",
  "date": "Oct 25, 2019",
  "matchup": "CHA vs. MIN",
  "headline": "Towns scores 37 points, Timberwolves rout Hornets 121-99",
  "body": "CHARLOTTE, N.C. --  Karl-Anthony Towns took advantage of an obvious mismatch Friday night when Charlotte center Cody Zeller wasn't there to defend him.\n\nTowns had 37 points, 15 rebounds and eight assists, and the Minnesota Timberwolves remained unbeaten with a 121-99 win over the Hornets.\n\nWithout Zeller, who missed the game due to undisclosed personal reasons, the Hornets were forced to turn to Bismack Biyombo and Willy Hernangomez to defend the two-time All-Star. Towns took full advantage, finishing 13 of 18 from the field while using his big frame create space inside. He also drained four 3-pointers.\n\nMinnesota coach Ryan Saunders said he wants his team working on a balanced inside-outside attack, but admitted \"the fact that there was not a defender like Cody Zeller on the court tonight -- and obviously our prayers are with him -- we went inside a little more.\"\n\nAndrew Wiggins added 16 points for Minnesota, which outscored Charlotte 45-25 in the third quarter to break open a two-point game.\n\nTowns said he felt like he needed to take control when the Timberwolves fell behind 12-2 after missing 7 of 8 shots to open the game.\n\n\"That's where I have to do my job and get people buckets and get us going by drawing a lot of attention and making the right pass,\" Towns said.\n\nSaid Minnesota guard Josh Okogie: \"This was a regular night for KAT. I definitely know that he can definitely do more, so I'm definitely excited to see what he can do this season.\"\n\nSaunders said his team's defense fueled the offense in the decisive third quarter.\n\n\"We feel confident that even when we're missing shots, we were generating good looks and we just needed some to fall, but really our defense fueled our offense,\" Saunders said.\n\nTIP-INS\n\nTimberwolves: Outrebounded the Hornets 52-42. ... Shabazz Napier had nine assists.\n\nHornets: Rookie PJ Washington, who had 27 points on seven 3s in Charlotte's season opener, had 10 points and 10 rebounds.. ... Nic Batum said he will miss at least three weeks with a broken finger.\n\nIMPRESSIVE START\n\nHornets backup guard Devonte Graham continued his torrid start to the season, finishing with a team-high 24 points on 6-of-9 shooting from 3-point range. Graham is shooting 75% (12 of 16) from deep in two games.\n\n\"His confidence, he's impressive,\" Saunders said. \"I was telling a few our assistants on the bench that they way he is shooting the ball and the way he is rising up, with that rhythm -- he's definitely got a future.\"\n\nGraham played nearly 28 minutes, while starting point guard Terry Rozier played just 17.\n\nTURNOVER CENTRAL\n\nMinnesota turned 20 Charlotte turnovers into 21 points. The Hornets, who played eight players with less than three years of NBA experience, have now turned the ball over 39 times in two games.\n\n\"We're gonna get smacked in the mouth a few times, it's how you respond,\" said Hornets coach James Borrego.\n\nHONORING THEIR COACH\n\nMembers of the Timberwolves presented their head coach with a game ball and the assistant coaches gave him a large sheet cake to help honor the memory of his father, Flip Saunders, who died on this day four years ago.\n\n\"The motto is `us,' and when someone feels something and is having a moment, we want to be helpful in that moment,\" Towns said. \"We thought it was very important as a team. Me personally, I got our guys understanding how important this game is, four years from the day, we've got to win this for him. We've got to take care of our leader.\"\n\nCake was one of Flip Saunders' favorites.\n\n\"I know he's smiling,\" Towns said. \"His son's doing really well, a tremendous job.\"\n\nUP NEXT\n\nTimberwolves: After two road wins will host the Heat in their home opener Sunday.\n\nHornets: Open four-game road trip against California teams when they visit the LeBron James and the Lakers on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996114.765695
}