{
  "game_id": "0022000578",
  "espn_id": "401307361",
  "date": "Mar 11, 2021",
  "matchup": "SAC vs. HOU",
  "headline": "Fox scores 30, Kings hand Rockets 14th straight loss 125-105",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox had 30 points, nine assists and seven rebounds, and the Sacramento Kings sent the Houston Rockets to their 14th consecutive loss, 125-105 on Thursday night.\n\n\r\n                    Buddy Hield added 20 points, seven assists and six rebounds for Sacramento, which had dropped 11 of 13 before the All-Star break. Harrison Barnes and Richaun Holmes each had 20 points and 11 rebounds.\n\n\r\n                    The Kings won despite 15 turnovers and getting outscored 41-24 in bench points.\n\n\r\n                    “It was a good effort from our group but we know we’ve got to get a lot better,” said coach Luke Walton, whose team committed 15 turnovers. “At times it was sloppy.”\n\n\r\n                    Victor Oladipo had 23 points and eight assists but couldn’t help Houston end its longest losing streak in nearly two decades. Kevin Porter Jr. added 13 points and a career-best 10 assists.\n\n\r\n                    The hard-luck Rockets, already without starters John Wall and P.J. Tucker, lost Eric Gordon to a groin strain midway through the third quarter. Gordon, who scored 17 points, had missed the previous two games with a left knee injury.\n\n\r\n                    It’s been that kind of season for coach Stephen Silas’ team. The Rockets’ slump is their longest since losing 15 straight in 2001. Houston’s last win came Feb. 4 against Memphis.\n\n\r\n                    After the game, Silas said the Rockets are attempting to trade Tucker.\n\n\r\n                    “At some point there was some mutual agreement with P.J., his agent, (Rockets general manager Rafael Stone) and the organization that P.J. will not be with the team anymore,” Silas said.\n\n\r\n                    Sacramento never trailed after a 15-0 run early in the second quarter. Fox and Barnes had six points apiece during the run.\n\n\r\n                    “It was a good win,” Holmes said. “We did a good job of executing, a good job of communicating and helping each other out. A good way to get the second half started.”\n\n\r\n                    TIP-INS\n\n\r\n                    Rockets: Tucker, who has started the last 216 games he’s played in for Houston, was a healthy scratch. … Center Justin Patton picked up his fourth foul with 6:47 left in the second quarter. … Porter limped off the court with an apparent injury to his left leg but returned before halftime. “When you feel a pop or a tweak your first reaction is probably more dramatic than your injury,” Porter said. “I injured the same knee last year so I was definitely concerned when it first happened.” … Danuel House Jr. (bruised knee) did not play. \n\n\r\n                    Kings: Sacramento hadn’t beaten Houston at home since April 11, 2018. … Fox scored 11 in the third quarter. … Sacramento was called for two shot clock violations in the second quarter. \n\n\r\n                    UP NEXT\n\n\r\n                    Rockets: Visit the Jazz on Friday. Houston has won the last three in Utah.\n\n\r\n                    Kings: Visit the Hawks on Saturday to begin a six-game road trip. Sacramento hasn’t lost in Atlanta since Nov. 15, 2017.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997166.650707
}