{
  "game_id": "0022201042",
  "espn_id": "401469197",
  "date": "Mar 16, 2023",
  "matchup": "DEN @ DET",
  "headline": "Nuggets top Pistons to end skid, clinch Northwest Division",
  "body": "DETROIT -- — The Denver Nuggets have been so dominant this season that they've clinched the Northwest Division with a few weeks left in the regular season.\n\n\r\n              Nikola Jokic deferred to teammates early before looking for his shot and finished with 30 points to help the Nuggets beat the Detroit Pistons 119-100 on Thursday night and end a season-high four-game losing streak.\n\n\r\n              “This has to be a building block,” Denver coach Michael Malone said. “I told our team, it’s a good win. Clinched a playoff spot. Won your division. That’s great. Let this be the start of something special. We lost four in a row, lowest of the low for us during this season. Now, let’s get back to playing and go on a run.”\n\n\r\n              Kentavious Caldwell-Pope scored 20 points, Jamal Murray had 19 and Aaron Gordon 15 for the Western Conference-leading Nuggets.\n\n\r\n              Jokic, the two-time reigning NBA MVP, had three assists and three rebounds before his first attempt several minutes into the game and finished 14 of 18 from the field with 10 rebounds and nine assists.\n\n\r\n              The short-handed Pistons were competitive for three quarters, leading by as many as seven points in a game with 16 lead changes and 10 ties. The Nuggets picked up their intensity on defense in the fourth, and pulled away easily to lead by double digits midway through the quarter.\n\n\r\n              “A championship team is going to turn up their energy,” Detroit coach Dwane Casey said. “We talked about that during the timeout. We didn't respond, and that's part of our growth.”\n\n\r\n              Rodney McGruder scored 20 for the Pistons, who have lost 12 of 13 games and have the NBA's worst record. Detroit rookies Jalen Duren had 15 points and 13 assists, while Jaden Ivey added 14 points and six assists.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Jokic was an assist away from a triple-double. The 7-foot center, who often plays like a point guard, has an league-high 27 triple-doubles to nearly triple the rest of the league leaders in the category. ... With the win, Denver is .500 on the road. ... The Nuggets have won the division for the third time in five seasons, and they finished in second place the other two years.\n\n\r\n              Pistons: The banged-up team was missing many injured players: Marvin Bagley III, Bojan Bogdanovic, Alec Burks, Hamidou Diallo and Isaiah Livers, along with Cade Cunningham, who had season-ending shin surgery three months ago.\n\n\r\n              “They have not been winning games, but they’ve been playing hard with the guys they have available,” Malone said.\n\n\r\n              ON D IN THE D\n\n\r\n              Denver limited Detroit to 14 points in the fourth quarter after giving up an average of 117 points over the previous three games.\n\n\r\n              “It always starts with our offense,” Malone said. “When we’re turning the ball over, it makes it really hard to defend.\n\n\r\n              “When we’re not aggressive and we’re not physical, it’s like a layup line out there.\"\n\n\r\n              HE SAID IT\n\n\r\n              Casey said Jokic reminds him of Hall of Famer Larry Bird.\n\n\r\n              “He doesn’t get in a hurry, and you can’t rush or speed him up,” Casey said. “He gets to where he wants to go by taking his time, using his body, angles, pass fakes.\n\n\r\n              \"He’s not the most athletic guy in the world, but he gets exactly where he wants to go when he wants to get there.”\n\n\r\n              Jokic has a shot to be the first player since Bird to win three straight NBA MVP awards. The former Boston Celtics superstar pulled off the feat in the mid 1980s. \n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Stay on the road for third of five-game trip to face the New York Knicks on Saturday afternoon. \n\n\r\n              Pistons: Host Miami on Sunday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994682.714072
}