{
  "game_id": "0022001023",
  "espn_id": "401307831",
  "date": "May 09, 2021",
  "matchup": "DET vs. CHI",
  "headline": "Vucevic's double-double, LaVine's 30 lead Bulls over Pistons",
  "body": "DETROIT -- — Nikola Vucevic had 29 points and 16 rebounds and the Chicago Bulls kept their play-in chances alive with an 108-94 victory over the Detroit Pistons on Sunday night.\n\n\r\n                    Zach LaVine scored 30 points as the Bulls (29-39) moved within 2 1/2 games of the Indiana Pacers (31-36) for the last Eastern Conference play-in spot. \n\n\r\n                    “We know the challenge right now, and we came in with a lot of energy,” LaVine said. “We've got to keep playing like this if we want a chance to keep our season alive.”\n\n\r\n                    Chicago, which also got 21 points from Coby White, had lost five of six.\n\n\r\n                    “Those three really work well together, especially the way Coby and (Vucevic) have learned how to play off each other,” Bulls coach Billy Donovan said. “I'd still rather have games where we have seven guys in double figures than relying just on those three, but they got it done tonight.”\n\n\r\n                    Detroit, which lost for the ninth time in 11 games, played without leading scorer Jerami Grant (knee) and point guard Cory Joseph (ankle). Rookies Killian Hayes (21 points), Saddiq Bey (20) and Isaiah Stewart (19) combined for 60 points and 21 rebounds.\n\n\r\n                    “This is a step forward in the development of this team,” Pistons coach Dwane Casey said. “It's still a loss, and we need to get to a point where we are turning these games into wins, but we had a lot of young players do nice things tonight.”\n\n\r\n                    Hayes and fellow rookie point guard Saben Lee both played more than 30 minutes, with Hayes spending time at shooting guard.\n\n\r\n                    “I love being out there with Saben and being off the ball,” said Hayes, who finished with a career high in points along with eight assists, seven rebounds and seven turnovers. “It's a different way to let me attack defenses and we work well together.”\n\n\r\n                    Chicago outshot the Pistons 54.5% to 37.5% while building a comfortable 57-39 halftime lead. LaVine had 16 points while Vucevic added 14 points and nine rebounds.\n\n\r\n                    “I thought our defense was really good in the first half,” Donovan said. “We are definitely a better team than we were at the start of the year. I wish it hadn't taken this long.”\n\n\r\n                    The Pistons were within 15 at 83-68 at the end of the third quarter, but never seriously threatened in the final 12 minutes.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Swept the three-game season series with Detroit and have now won seven straight against the Pistons.\n\n\r\n                    Pistons: G Frank Jackson did not return after leaving the game in the first quarter with a right ankle injury.\n\n\r\n                    YOUNG OFFENSE\n\n\r\n                    Detroit got 85 of its 96 points from rookies, with Lee (13) and Tyler Cook (12) also reaching double figures. Jahlil Okafor was the only player older than 23 to score for Detroit.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host the Brooklyn Nets on Tuesday night as the Bulls try to earn a play-in spot.\n\n\r\n                    Pistons: Host the Minnesota Timberwolves on Tuesday night in a game with draft lottery implications for both teams.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764997898.873054
}