{
  "game_id": "0021800953",
  "espn_id": "401071626",
  "date": "Mar 04, 2019",
  "matchup": "MIA vs. ATL",
  "headline": "Wade scores 14 in 4th to help Heat stave off Hawks, 114-113",
  "body": "MIAMI --  Dwyane Wade got into the record book for defense.\n\nAnd he saved the Miami Heat with offense.\n\nWade scored 14 of his 23 points in the fourth quarter and the Heat won their season-high third straight home game by topping the Atlanta Hawks 114-113 on Monday night. It was the highest-scoring quarter of the season for Wade, and it helped Miami beat Atlanta for the first time in four tries.\n\n\"That's textbook, Hall of Fame poise,\" Heat coach Erik Spoelstra said. \"He's playing his best basketball of the season right now.\"\n\nJosh Richardson scored 19 points and Justise Winslow added 18 for the Heat, who pulled into a tie with Charlotte for ninth place in the Eastern Conference. Dion Waiters scored 14 and Kelly Olynyk added 12.\n\nVince Carter scored 21 points, all on 3-pointers, for the Hawks -- in his final head-to-head duel with Wade, and tipped his cap afterward.\n\n\"He's been a very dominant player for a long time and on your way out it's easy to say, `I'm going to ride this out and enjoy it,\" Carter said. \"But he's doing it like most Hall of Famers would do it -- go at it and leave my greatness on the floor every night until you don't see it anymore.\"\n\nKent Bazemore had 18 points and Trae Young finished with 14 points and eight assists for the Hawks. Atlanta also got 14 points from Dewayne Dedmon and 13 from Kevin Huerter.\n\nWade made three consecutive jumpers, including a 3, to spark a 12-2 run in the fourth that took the Heat from down one to up by nine with about five minutes left.\n\n\"Got a couple shots to fall, you get in a rhythm,\" Wade said. \"We needed it. Obviously, we've had a lot of trouble with this team.\"\n\nThe end was frantic, starting when Carter hit a pair of late 3-pointers to start the Atlanta rally.\n\nWinslow fouled Young with 2:04 left, then picked up a technical as well. Young missed the technical free throw, then made both for the personal to get the Hawks to 111-107. And down by three, after a Heat turnover, Young had a blow-by for a layup that cut Miami's lead to 112-111 with 1:02 left.\n\nWade got free for a layup on the next possession to put Miami back up by three. Bazemore made a pair of foul shots with nine seconds left, but the Heat inbounded the ball and wound up running out the clock -- with the Hawks never catching anyone to foul.\n\n\"We just fell asleep at the end,\" coach Lloyd Pierce said.\n\nWade's block of Atlanta's B.J. Johnson in the second quarter was a record-setter of sorts. It was the 1,052nd blocked shot of Wade's career, including playoffs -- the most ever by a guard, one more than Michael Jordan. The regular-season mark still belongs to Jordan, who has 893 to Wade's 877.\n\n\"Either way, it's pretty cool,\" Wade said.\n\nTIP-INS\n\nHawks: Bazemore took six free throws in 23 seconds during the third quarter, after getting fouled on 3-point attempts on consecutive possessions. He went 4 for 6, missing the middle free throw each time. ... Young is the 32nd rookie (and first for the Hawks) to have 500 assists in a season. He entered Monday with 499. ... John Collins, a South Florida native, missed the game with flu-like symptoms.\n\nHeat: Richardson, the biggest soccer fan in the Heat locker room, did some futbol-style juggling of the basketball during a fourth-quarter stoppage. Then he hit a 3 for a 104-95 lead. ... Hassan Whiteside (hip strain) returned after missing three games. He played as a reserve for the first time since April 8, 2016, ending a streak of 202 consecutive games played as a starter (including postseason). ... James Johnson (shoulder) was again active, but missed his sixth straight game. .. Goran Dragic (left calf strain) missed his second consecutive game.\n\nMOVING UP\n\nCarter passed Reggie Miller on the career scoring list -- doing so, fittingly, on a 3-pointer. Carter's third 3 of the first half gave him 25,280 points, one more than Miller for 20th place. Carter and Miller are both among the top seven 3-point shooters in NBA history.\n\nWADE'S BLOCKS\n\nJohnson became the 449th player to have a shot blocked by Wade. Joe Johnson and Ben Gordon each got blocked 12 times by Wade, more than any other player. The tallest players who Wade got were both listed at 7-foot-3 -- former Heat center Zydrunas Ilgauskas, and Dallas' Kristaps Porzingis. The shortest to have one swatted by Wade was Earl Boykins, listed at 5-foot-5.\n\nUP NEXT\n\nHawks: Host San Antonio on Monday. It'll be the first Hawks-Spurs game of the season.\n\nHeat: Visit Charlotte on Wednesday. The Heat are 0-2 this season against the Hornets.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995224.997735
}