{
  "game_id": "0022300749",
  "espn_id": "401585377",
  "date": "Feb 10, 2024",
  "matchup": "LAC vs. DET",
  "headline": "George and Leonard combine for 57 points in rallying Clippers past Pistons 112-106",
  "body": "LOS ANGELES -- — Paul George scored 33 points, Kawhi Leonard added 24 and the Los Angeles Clippers rallied in the fourth quarter to beat the Detroit Pistons 112-106 on Saturday.\n\n\r\n              The Clippers opened the game on a 12-2 run before the Pistons tied it up and outplayed the home team for the next two quarters. \n\n\r\n              “It was a great start. It was sluggish after the start,” Clippers coach Tyronn Lue said. “The second half we went small and were able to score a lot better.”\n\n\r\n              George scored 15 points in the fourth, hitting back-to-back 3-pointers that capped an 11-0 run and pushed the Clippers’ lead to 107-94. \n\n\r\n              “Give the Pistons credit. They’re playing well over the past three, four games. This is one of those tough games, play early (in the day) against a young team and you got to be ready for them,” George said.\n\n\r\n              “I thought they were ready to come out. We had to make the adjustments. I thought playing the small ball helped us with creating energy and that was just the turning point of the game.”\n\n\r\n              Simone Fontecchio and Cade Cunningham combined to score eight in a row that drew the Pistons within seven with under two minutes to go. It was part of the Pistons' closing 12-5 run, but it wasn't enough as the team dropped its 10th in a row to the Clippers.\n\n\r\n              “I love Cade’s game. He’s really good, he’s athletic, he's strong. That’s really where he’s going to be a problem for many years to come,” George said. “They got a strong nucleus with him. They’re going to be good when they figure it out playing together.”\n\n\r\n              The Clippers got a spark off the bench from Amir Coffey in the fourth when he hit two 3-pointers. James Harden, who finished with 14 points, eight assists and six rebounds, made three consecutive free throws to give the Clippers their first lead since early in the second.\n\n\r\n              Jaden Ivey scored 23 points to lead the Pistons, who were denied their first three-game winning streak of the season. They opened their current six-game trip with wins at Sacramento and Portland and then led the Clippers by 13 points early in the third.\n\n\r\n              Cunningham had 22 points and 10 assists, and Jalen Duren had 10 points and 18 rebounds. Fontecchio added 20 points and nine rebounds off the bench for Detroit three days after being traded from Utah. \n\n\r\n              Detroit outscored the Clippers 28-18 in taking a 58-49 lead at halftime. The Pistons finished with a 57-35 rebounding edge.\n\n\r\n              Ivey’s basket early in the third gave Detroit a 13-point lead, its largest of the game.\n\n\r\n              After enduring a 28-game skid earlier in the season, the Pistons have now lost a combined nine in a row to the Clippers and Lakers at Crypto.com Arena. Detroit fell to 4-21 on the road this season.\n\n\r\n              Norman Powell of the Clippers got elbowed in the head by Duren going for a rebound with five minutes left. Powell staggered toward the Pistons' bench and went down with his face to the floor. Blood poured from his forehead and his left forearm was stained by it. He received stitches between his eyes.\n\n\r\n              Asked if he was OK, Powell told reporters, “Yeah, yeah. I'm tough.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Stay in Los Angeles to visit the Lakers on Tuesday.\n\n\r\n              Clippers: Host Minnesota on Monday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996546.249811
}