{
  "game_id": "0021501224",
  "espn_id": "400829111",
  "date": "Apr 13, 2016",
  "matchup": "HOU vs. SAC",
  "headline": "Rockets clinch playoff berth with 116-81 win over Kings",
  "body": "HOUSTON -- After it looked as if they'd be heading home early just a week ago, the Houston Rockets are in the playoffs after securing the final Western Conference playoff spot on the last day of the regular season.\n\"A lot of people wrote us off, thought we weren't going to make the playoffs and here we are,\" James Harden said.\nHarden scored 38 points to lead the Rockets to an easy 116-81 victory over the Sacramento Kings on Wednesday night for the playoff spot.\n\nThe Rockets never trailed and had a 64-44 lead at halftime behind 16 points from Harden and 10 each from Dwight Howard and Michael Beasley.\nThey won their last three games to sneak into the playoffs after losing three of the previous four to fall behind Utah and into ninth place in the West. Houston will meet top-seed Golden State in the first round of the playoffs this weekend.\n\"We ... sat here at the beginning of the year thinking the playoffs wouldn't have been this big of a struggle, so we had expectations of making the playoffs,\" coach J.B. Bickerstaff said. \"So, now we have to get busy.\"\nBen McLemore had 24 points for the Kings, in what was likely coach George Karl's final game with the team amid reports that he could be fired as soon as Thursday. Karl went 44-68 since taking the job in February 2015, and this season is the 10th straight season in which the Kings did not make the playoffs.\nKarl didn't address his job status directly, but did reflect on his time with the Kings and said he thinks they built a good foundation for the future.\n\"There were many, many more good days than bad days, but there's no question this season had a lot of negative to it,\" he said. \"But I think I'm proud of how we've persevered and fought through it and actually became a stronger team as we finished the year.\"\nThe Rockets are in the postseason for the fourth straight year, but they certainly didn't have the regular season they had hoped for after reaching the Western Conference finals for the first time since 1997 last season. They returned most of the pieces from that team that won 56 games, but weren't able to build on last year's success.\nThings went wrong early this season and coach Kevin McHale was fired after the team won just four of its first 11 games. He was replaced by Bickerstaff, but it didn't lead to more consistent play and the Rockets were never able to keep pace with the elite teams in the West.\nAfter a loss to the Suns on Thursday, it seemed likely that Houston would miss out on the playoffs. Instead, Utah dropped two of its next three games and the Rockets got back on track to win the remainder of their games and lock up the last postseason spot.\n\"We needed some big wins and guys got those,\" Harden said. \"Tonight we played really well. Even though the Sacramento Kings were short-handed, we went out there and just took care of business. It's about us from here on out.\"\nSacramento was overmatched in this one from the start with Houston racing out to a 10-2 lead by the first media timeout. It wasn't surprising considering the Kings dressed just eight players, with DeMarcus Cousins, Rajon Rondo, Darren Collison, Rudy Gay and Caron Butler sitting out for rest, and Omri Casspi (strained right hamstring) and Marco Belinelli (sore right foot) missing the game with injuries.\nHouston led by 21 in the third quarter when Harden scored the next 10 points, with two 3-pointers, to push it to 88-57.\nThat spurt gave Harden his fourth straight 30-point game, which ties a career high, and it was his 38th game this season with at least 30 points. He played less than a minute in the fourth quarter, and he and the rest of Houston's starters went to the bench for good after his 3-point play with about seven minutes remaining made it 103-71.\nHarden set career marks in points (29), assists (7.5) and rebounds (6.1) to join LeBron James, Michael Jordan and Oscar Robertson as the only players in NBA history to average at least 29 points, seven assists and six rebounds in a season.\nTIP-INS\nKings: Eric Moreland did not play in the second half because of a sore left foot. ... James Anderson added 13 points. ... Willie Cauley-Stein had six points, eight rebounds, three assists, two steals and a block.\nRockets: Howard finished with 14 points and 10 rebounds. ... Patrick Beverley had nine points and his six steals and 12 assists were both career highs. ... K.J. McDaniels added 11 points with four rebounds. ... Clint Capela had a career-high 17 rebounds.\nHOWARD HELPS OUT\nHoward hosted a blood drive on Wednesday to honor Turner sideline reporter Craig Sager, who is fighting acute myeloid leukemia. Howard visited donors at the drive after shootaround, and those who gave blood received a T-shirt featuring illustrations of Howard and Sager. Sager, who is receiving treatment in Houston, attended the game and received a loud ovation when he was introduced in the first quarter.\nUP NEXT\nKings: Season over.\nRockets: Face Golden State in the first round of the playoffs.",
  "source": "espn_api",
  "crawled_at": 1764994592.9531689
}