{
  "game_id": "0022300098",
  "espn_id": "401584726",
  "date": "Oct 29, 2023",
  "matchup": "POR @ PHI",
  "headline": "Joel Embiid, Tyrese Maxey drop double-doubles as Harden watches the 76ers beat winless Portland",
  "body": "PHILADELPHIA -- — Joel Embiid closed his final stat line in the third quarter. The numbers in the NBA MVP's home debut: 35 points, 15 rebounds, seven assists, six blocked shots. Oh, and four WWE-style crotch chops that sent the crowd into a frenzy at the home opener.\n\n\r\n              “Now and then, I might kind of lose myself,” Embiid said, laughing. “That's a just a different me.”\n\n\r\n              Embiid dominated from tipoff, Tyrese Maxey added 26 points and 10 boards, and James Harden watched it all from Philadelphia’s bench in the 76ers’ 126-98 win over the Portland Trail Blazers on Sunday night.\n\n\r\n              Shaedon Sharpe led winless Portland (0-3) with 20 points and Malcom Brogdon had 18.\n\n\r\n              Harden yanked his yellow hood over his head and laughed at times with his teammates -- notably P.J. Tucker -- as he sat out a third straight game. The official listed reason: return to competition reconditioning. \n\n\r\n              Harden has practiced off and on with the Sixers and participated in Sunday’s film session and walkthrough. But his trade demand lingers over the organization and there’s no telling when it will be resolved.\n\n\r\n              Harden had a quick highlight or two in the pregame hype video, though the 10-time All-Star was otherwise not acknowledged by the Sixers. \n\n\r\n              Embiid said it wasn't awkward having Harden on the bench but limited his interactions with the sidelined star.\n\n\r\n              “When I'm playing, I'm always focused on the game,” Embiid said.\n\n\r\n              Embiid's status for the home opener also was in doubt after an early morning arrival from Canada following Saturday night’s victory over the Raptors. The 76ers flirted with resting Embiid.\n\n\r\n              Portland would have gladly signed up that option.\n\n\r\n              Embiid said there was “no chance” he would sit out the opener.\n\n\r\n              “Third game of the season, home opener, love playing in front of the fans, especially in Philly,” Embiid said. “I don't think I would have missed the first game of the season in Philly.”\n\n\r\n              Embiid instead was fired up, no doubt galvanized by the “MVP! MVP!” chants that echoed throughout the Wells Fargo Center. The calls from 20,000 fans each night for Embiid to win the award was spoken into existence last season. He was voted NBA MVP -- that was Harden who bear-hugged Embiid when his name was called -- and won his second straight league scoring title.\n\n\r\n              Embiid and 76ers were also bounced from the second round and that ugly exit sparked an offseason of upheaval. Nick Nurse took over as coach for the fired Doc Rivers. Harden later demanded a trade, called team president Daryl Morey a liar, and was a late arrival for training camp.\n\n\r\n              Embiid always gives Philly a glimmer of hope.\n\n\r\n              De’Anthony Melton heaved a pass from free throw line to free throw line that Embiid caught and drove to the bucket for a finger-roll layup and a 93-71 lead. Embiid then mimicked a crude Degeneration X chop, a throwback show of emotion from the All-Star who has tried to temper in his in-game antics in recent seasons.\n\n\r\n              “Sometimes I think a lot of people see it as, I might not be as interested because I'm not the old Joel that I used to be at getting into it with the crowd and raising my hands all the time,” Embiid said. “But that doesn't mean that I'm not as focused or I'm not interested, I don't have the same passion. The passion is different.”\n\n\r\n              The Embiid-Maxey two-man game clicked from tipoff and could go a long way toward easing the potential loss of Harden. Maxey scored 10 fast points in the first quarter and made all 10 free throws overall. \n\n\r\n              “He's the straw that stirs the drink here,” Portland coach Chauncey Billups said. “Embiid is the guy. He's the man. He's the MVP. But I think Tyrese makes this team go. They feed off his toughness, his energy, his speed. Just his spirit. I think he is the guy here.”\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: Visit Toronto on Monday.\n\n\r\n              76ers: Host Toronto on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996601.4640892
}