{
  "game_id": "0021600570",
  "espn_id": "400899991",
  "date": "Jan 09, 2017",
  "matchup": "DAL @ MIN",
  "headline": "Towns, Rubio lead Timberwolves over Mavericks, 101-92",
  "body": "MINNEAPOLIS --  Karl-Anthony Towns dominated at the start, Ricky Rubio took over in the end and it added up to a big win for the Minnesota Timberwolves.\n\nTowns had 34 points and 11 rebounds, Rubio added 13 points and a season-high 15 assists, and the Timberwolves snapped a four-game losing streak with a 101-92 victory over the Dallas Mavericks on Monday night.\n\n\"The team was struggling lately and everybody had to do a better job in the fourth quarter, and I think we did today,\" said Rubio, whose team has lost 12 games after leading by double digits this season, including a two-point home defeat against Utah on Saturday. \"We've been doing a pretty good job for three quarters all season, but the fourth quarter is just different. It's when you win games.\"\n\nHarrison Barnes scored 30 points for the Mavericks and Dirk Nowitzki had 26, including five 3-pointers.\n\n\"We were never able to control Towns, obviously,\" Nowitzki said. \"He got too deep some; just never really had an answer for him.\"\n\nThe Timberwolves shot 56.3 percent from the floor, with Towns (15 for 19) leading the way. He got off to a scorching start, shooting 8 of 9 in the first quarter.\n\nTowns scored Minnesota's first seven points and 16 total in the first seven minutes. He finished with 20 in the period as the Timberwolves took a 33-14 lead after one quarter.\n\n\"I guess it was my lucky day,\" Towns said. \"I just found good ways to find ways that they couldn't double-team me in spots where it was very difficult to double-team me.\"\n\nRubio scored nine points in the fourth quarter, including consecutive baskets during an 8-0 run that gave the Timberwolves some breathing room after Dallas had whittled a 21-point lead to 81-77.\n\nHis three free throws put the Wolves up by 14 with 2:08 to play, effectively sealing the game.\n\n\"I thought Ricky had great command of the game with his dribble penetration, and I thought he made great reads early with Karl,\" Timberwolves coach Tom Thibodeau said. \"That got Karl going. And he settled us down in the fourth.\"\n\nAfter Minnesota took a 44-23 lead in the second quarter, the Mavericks responded with a 15-2 run to get back in the game. Nowitzki hit 3-pointers on three straight possessions to close the first half as Dallas pulled to 54-46 at the break.\n\nBut in the end, it was another stinging blow for the Mavericks, who lost to Atlanta in similar fashion on Saturday.\n\n\"Yeah, it's tough, because both these games, they played out the same way,\" Barnes said. \"You got down. You battled back. You got an opportunity to kind of get on top, and you fall back into the same routine.\"\n\nTIP-INS\n\nMavericks: Dallas had won seven straight against the Timberwolves, including four in a row at Target Center. This was their first meeting of the season. ... Nowitzki topped his previous season high of four 3-pointers. The last time he had six in a game was April 1, 2014. ... Andrew Bogut missed the fourth quarter with an injured hamstring.\n\nTimberwolves: Towns scored 20 points in a quarter for the second time in his career. He had 22 in the first quarter against New York on Nov. 30. ... Zach Lavine left early in the fourth with a bruised left hip and did not return. Lavine grabbed Devon Harris to get called for a foul, then limped off the court and into the Minnesota locker room. Thibodeau said Lavine would be re-evaluated at practice on Tuesday. ... Shabazz Muhammad scored in double figures off the bench for the sixth time in his last eight games, finishing with 11 points in 20-plus minutes.\n\nDIRK DIGS DEEP\n\nNowitzki played more than 30 minutes in a game for the first time this season. He's missed a total of 25 games this season due to a strained right Achilles and a handful of other injuries and illnesses.\n\n\"It's still a work in progress, but it's a lot better than I was a week ago,\" Nowitzki said. \"Just got to keep working, got to be a little better on both ends and help the fellas.\"\n\nPLAYOFFS?\n\nYes, the Timberwolves climbed out of the Western Conference cellar with the victory. But in a wide-open race for the eighth playoff spot in the West, Minnesota is just three games back in the loss column.\n\n\"It's amazing how long the season is,\" Towns said. \"We have so much time. Don't count us out at any time.\"\n\nBut the veteran Rubio added a word of caution.\n\n\"We've still got time but we've got to hurry up,\" he said. \"The window is closing.\"\n\nUP NEXT\n\nMavericks: Dallas plays the Phoenix Suns on Thursday in Mexico City.\n\nTimberwolves: Minnesota hosts the Houston Rockets on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996132.904567
}