{
  "game_id": "0021900259",
  "espn_id": "401160901",
  "date": "Nov 27, 2019",
  "matchup": "MIA @ HOU",
  "headline": "Harden, Westbrook help Rockets down Heat 117-108",
  "body": "HOUSTON --  When opponents trap and double team James Harden and Russell Westbrook it leaves openings for other players to step up and contribute.\n\nOn Wednesday night that player was Danuel House, who had a career-high 23 points to help the Rockets to a 117-108 victory over the Miami Heat.\n\n\"When those two guys get going downhill it puts a lot of pressure on a lot of people which causes me to be open-open,\" House said. \"So thank you Russ and James.\"\n\nHarden scored 34 points, Westbrook had 27 and the Rockets snapped a three-game skid.\n\nHarden said House is getting better at taking advantages of opportunities when teams double him.\n\n\"He works every single day on his shot,\" Harden said. \"Those opportunities are going to come for him and the more confident he gets the easier those shots will be.\"\n\nHouston led by double digits for most of this one after the Heat used a 46-point first quarter in a 129-100 rout Nov. 3 in the first meeting between the teams this season.\n\n\"In the first half we just didn't bring the right competitive, consistent spirit, particularly when we weren't making shots,\" Heat coach Eric Spoelstra said.\n\nKelly Olynyk scored six straight points to get the Heat within 10 with about a minute left. Harden made a free throw after that and Goran Dragic made one for the Heat. There was a bit of a scuffle after a hard foul by Dragic on House with about 30 seconds remaining. It was reviewed and upgraded to a flagrant 1 foul and House received a technical foul for his reaction after the foul.\n\nTyler Herro had 22 points and Olynyk scored 19 points with leading scorer Jimmy Butler out with an illness.\n\nWestbrook had nine rebounds and seven assists and Houston had 11 steals they converted into 22 points.\n\nHerro scored five straight points for Miami to cut the lead to 17 with about 9 1/2 minutes left. But he turned the ball over on a bad pass after that and House finished with a dunk on the other end to lead Houston up 96-77.\n\nThe Heat used a 10-3 run, with four points from Justise Winslow, to get to 103-91 with about 5 minutes left. Harden, who finished with seven 3s, made an off-balance 3-pointer from the corner before the Heat got one from Olynyk.\n\nA layup by Herro cut the lead to 13 with less than three minutes left before Houston used a 5-2 run with a 3 from House to make it 114-98.\n\nHouston led by at least 20 for most of the third quarter and pushed the lead to 86-62 with a dunk by Ben McLemore with about two minutes left in the third quarter. The Heat used a 6-2 spurt, with 3s from Olynyk and Herro, to cut the lead to 20. But Houston scored the last three points of the quarter to take a 91-68 lead into the fourth quarter.\n\nAfter coming out flat in a 137-123 loss to Dallas on Sunday, the Rockets started strong on Wednesday. Harden and Westbrook combined for 42 points in the first half as they built a 66-42 lead.\n\nTIP-INS\n\nHeat: Miami got 51 points off the bench. ... Bam Adebayo led the Heat's starters with 17 points and 11 rebounds. ... The Heat made 14 of 37 3-pointers.\n\nRockets: C Clint Capela missed the game with a respiratory illness. ... Westbrook received a technical foul in the fourth quarter for yelling at an official when he was unhappy he didn't get a foul call.\n\nIMPROVING CLARK\n\nSecond-year player Gary Clark had 12 points and tied a career-best with eight rebounds in 29 minutes helping to fill in for Capela. Clark hasn't gotten much playing time this season and had logged just 10 minutes this season entering Wednesday's game.\n\n\"His number was called and he was ready to go after not really having an opportunity this season,\" Harden said. \"That shows he's learning.\"\n\nUP NEXT\n\nHeat: Host Golden State on Friday night.\n\nRockets: Host Atlanta on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996619.898314
}