{
  "game_id": "0021800934",
  "espn_id": "401071607",
  "date": "Mar 01, 2019",
  "matchup": "MIL @ LAL",
  "headline": "Bucks outlast Lakers 131-120 for 8th straight win",
  "body": "LOS ANGELES --  Eric Bledsoe began the day with a contract extension. He ended it leading the Milwaukee Bucks to their eighth consecutive victory and 10th in a row on the road.\n\nBledsoe scored 31 points, Malcolm Brogdon added 21 points, and the Bucks beat the Los Angeles Lakers 131-120 on Friday night.\n\n\"We've got a talented young team, we're growing together,\" said Bledsoe, who reportedly received a $70 million, four-year extension. \"We compete for something bigger than ourselves. I just wanted to be part of it.\"\n\nThe NBA's best team had its hands full for much of the fourth quarter, when the game was tied six times over the final seven minutes.\n\n\"We've been doing it all season. Team's going to run, we keep our composure and make our run,\" Bledsoe said.\n\nBledsoe's basket tied it for the last time at 118-all. That launched a game-ending 15-2 run with all but four of the points scored by Bledsoe and Brogdon.\n\n\"Everybody talks about Giannis (Antetokounmpo),\" LeBron James said, \"but it's the supporting cast. They've surrounded Giannis with a great cast.\"\n\nAntetokounmpo was held to 16 points -- below his 27-point average -- and 15 rebounds for Milwaukee.\n\n\"When the season started we knew we had something special and had a great team, but to be honest with you I never thought we'd have the best record in the NBA,\" he said. \"We've worked hard for it, we've played every game, go out there, show up every game, try to win every game.\"\n\nThe Lakers got after the Bucks defensively for the first three quarters, but had three of their nine turnovers in the final five minutes, including two by Rajon Rondo.\n\n\"We had our chances,\" James said. \"We broke down individually down the stretch defensively.\"\n\nBrandon Ingram and James scored 31 points each. James had 10 assists. Rondo added 20 points.\n\nJames and Rondo combined to score 15 straight points during a stretch in the fourth that drew the Lakers to a 113-all tie. But Los Angeles scored just seven points the rest of the game.\n\n\"For some reason we kind of fell apart at the end,\" Lakers coach Luke Walton said. \"One thing we did a poor job of was defending Bledsoe and Brogdon. We couldn't keep them in front of us.\"\n\nIngram powered the Lakers to their largest lead of the game, 79-67, with eight of their first 14 points to open the third. He had a highlight one-handed dunk over 7-foot Brook Lopez that brought the Lakers' bench to its feet.\n\nIngram and James had 10 points each in the quarter.\n\nFrom there, the Bucks closed on a 26-15 run, including nine by Bledsoe, to trail 94-93 going into the fourth.\n\n\"We were kind of on life support there for a lot of the first half, going into halftime and going into the third quarter,\" Milwaukee coach Mike Budenholzer said. \"We caught a good wave there and Bled was a huge part of it.\"\n\nThe Lakers outscored the Bucks 15-9, with six by Kyle Kuzma, to end the first half leading 65-59.\n\nTIP-INS\n\nBucks: Antetokounmpo played 32 minutes without restriction after sitting out with right knee soreness on Monday at Chicago and being limited to 24 minutes on Wednesday at Sacramento. ... They've won four in a row against LA. ... They improved their NBA-best marks to 48-14 overall and 23-9 on the road.\n\nLakers: G Lonzo Ball (bone bruise, sprained left ankle) will be re-evaluated in a week. He's missed 15 straight games since Jan. 19, when he was hurt in a collision with Houston's James Harden. ... G Lance Stephenson (second toe sprain on left foot) sat out, but was not to be missed on the bench in a cherry red jacket. ... They fell to 5-10 without Ball in the lineup. ... Hall of Famer Kareem Abdul-Jabbar sat courtside, and former Lakers ironman A.C. Green attended.\n\nON A TEAR\n\nIngram has been on an offensive tear since the All-Star break ended, averaging 28.4 points in five games. That's much improved from his 17.9 average through the season's first 50 games. \"He can shoot over anybody with his length,\" James said.\n\nHE SAID IT\n\n\"We're aware of it. We don't try to harp on it too much.\" -- Walton on being 3  1/2 games out of a playoff berth in the West.\n\nUP NEXT\n\nBucks: At Utah on Saturday in the second game of a back-to-back.\n\nLakers: At Phoenix on Saturday in the second game of a back-to-back before returning home for three in a row.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994466.713526
}