{
  "game_id": "0021600174",
  "espn_id": "400899624",
  "date": "Nov 18, 2016",
  "matchup": "CHA vs. ATL",
  "headline": "Zeller, Hornets snap Hawks' 6-game win streak, 100-96",
  "body": "CHARLOTTE, N.C. -- Dwight Howard lost his cool, and the Atlanta Hawks lost a potentially key Eastern Conference game.\nHoward was ejected with 5:38 left and his team leading by three when he threw an elbow at the head of Charlotte center Cody Zeller and received a Flagrant-2 foul. The Hornets scored the next nine points -- seven by Kemba Walker -- and snapped Atlanta's six-game winning streak with a 100-96 victory Friday night.\nNic Batum had 24 points and 10 rebounds, and Zeller matched his career high with 23 points on 9-of-10 shooting for the Hornets (8-3), who earned their biggest win of the season.\nWalker overcame a slow start to score 19 of his 21 points in the second half for his 10th straight 20-point game.\nHoward said afterward the contact wasn't intentional and he didn't think it cost his team the game.\n\"It wasn't like I tried to hit him in the face, but my job is to protect my house -- at all costs,\" said Howard, who finished with 10 points and 18 rebounds. \"I am making no apologies for it.\"\nPaul Millsap, who led the Hawks with 22 points and 13 rebounds, said the ejection fueled the home crowd.\n\"Plays like that are momentum shifts,\" Millsap said. \"It kind of sparked them. They took that and added fuel to the fire.\"\nThe ejection revved up the crowd -- and apparently Walker, too.\nThe 6-foot point guard drove baseline and made a reverse layup to give the Hornets the lead for good. Walker added another layup off a hesitation dribble and then connected on a 3-pointer from the top of the arc to push the lead to six.\nZeller said after the game he didn't think Howard's elbow to the face was a dirty play.\n\"I have taken a lot of hard hits with two older brothers,\" Zeller said. \"I knew it was going to be a physical game. But it was a huge play in the game because they couldn't go to him late in the game and we went on a run.\"\nTIP-INS\nHawks: Howard had 11 rebounds at halftime, while the rest of the starting lineup had two combined. ... The Hawks shot just 3 of 17 from the field in the fourth quarter.\nHornets: Michael Kidd-Gilchrist did a nice job guarding Kyle Korver, limiting him to two points through the first three quarters. ... Jeremy Lamb was close to returning to the lineup but is still bothered by a hamstring injury.\nSTRONG SECOND HALF\nWalker, who came in averaging 25.8 points per game -- the third-best mark in the Eastern Conference -- missed all seven of his shots from the field in the first half but was 8 of 13 the rest of the way.\n\"There wasn't anything different,\" Walker said. \"I was aggressive all night, I just stayed aggressive. At one point shots just weren't falling for me like they have been lately. I stuck with it, my teammates just kept telling me `stay with it, it's going to fall.' I just tried to play the game and pick my spots and I was able to come up with some big plays.\"\nHORNETS COMEBACKS\nIn six of Charlotte's eight wins the team has come back from 10 points down. Now, the Hornets have a busy stretch coming up with 18 games in 32 days.\n\"If we're a good team, the kind of team we need to be, then we have to get on this plane with the right attitude and find a way to play a good game tomorrow night on the road and win,\" coach Steve Clifford said. \"That's what the good teams do.\"\nSUPPORTING DWIGHT\nKorver threw his support behind Howard after the game.\n\"He's just kind of a safety net for us,\" Korver said. \"He's back there with all that size, I think he had 18 rebounds tonight, and he's back there to protect the paint. That's his job. That's what he's great at.\"\nUP NEXT\nHawks: Travel to New York to face the Knicks on Sunday afternoon.\nHornets: Head out on the road to New Orleans to face the Pelicans on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995542.126173
}