{
  "game_id": "0022400318",
  "espn_id": "401704884",
  "date": "Dec 02, 2024",
  "matchup": "LAL @ MIN",
  "headline": "Timberwolves blow out Lakers 109-80 behind Randle, Gobert and tough defense",
  "body": "MINNEAPOLIS -- — Julius Randle scored 18 points and Rudy Gobert had 17 points and 12 rebounds to lead the Minnesota Timberwolves past the Los Angeles Lakers 109-80 on Monday night.\n\n\r\n              Naz Reid and Nickeil Alexander-Walker each scored 15 for the Wolves (10-10), who limited the Lakers to their lowest point total since a 122-73 loss at Dallas in 2017, according to Sportradar.\n\n\r\n              Anthony Edwards had only eight points on 3-for-13 shooting for the Wolves, but his Olympic teammates LeBron James and Anthony Davis were just as quiet for the Lakers (12-9).\n\n\r\n              James, who has missed 19 straight 3-pointers, had 10 points on 4-for-16 shooting. Davis had 12 points and 11 rebounds. D’Angelo Russell scored 20 in his return from illness and to the starting lineup.\n\n\r\n              After beating Utah 105-104 on Sunday, the Lakers traveled another time zone east to face a team they beat 110-103 in the season opener behind 36 points and 16 rebounds from Davis.\n\n\r\n              Takeaways\r\n              Lakers: Rookie coach J.J. Redick assessed his team at the quarter mark of the season “uneven and inconsistent.\" The Lakers' fifth loss in their last seven games didn't even clear that bar.\n\n\r\n              Timberwolves: With the defense locked in, Minnesota's other priorities are reviving its transition game and 3-point shooting. Both boxes were checked. The Timberwolves went 15 for 35 from deep and had 20 fast-break points.\n\n\r\n              Key moment\r\n              Gobert, the four-time NBA Defensive Player of the Year, was plenty disruptive against Davis and the Lakers. Gobert stole an inbounds pass from Max Christie for a rare fast-break dunk late in the third. \n\n\r\n              Key stat\r\n              The Wolves held their opponent under 100 points for the second straight game and fourth this season. In 2023-24, when they led the league in scoring defense, they held opponents to double digits 23 times.\n\n\r\n              Up next\r\n              The Lakers play at the Miami Heat on Wednesday, when the Wolves visit the Los Angeles Clippers.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997203.0766232
}