{
  "game_id": "0022000249",
  "espn_id": "401267409",
  "date": "Jan 24, 2021",
  "matchup": "TOR @ IND",
  "headline": "Anunoby's hot hand helps short-handed Raptors beat Pacers",
  "body": "INDIANAPOLIS -- — Toronto coach Nick Nurse knew needed somebody to replace the scoring void left by two missing All-Stars.\n\n\r\n                    OG Anunoby delivered with jab after jab Sunday.\n\n\r\n                    He scored a season-high 30 points, grabbed eight rebounds, defended well and made three of four free throws in the final minute to give the surging Raptors a 107-102 victory over the Indiana Pacers.\n\n\r\n                    “I think it comes with opportunity, really,” coach Nick Nurse said. “We had a couple of guys (Kyle Lowry and Pascal Siakam) who are a good percentage of our offense out, so it’s going to shift somewhere. Tonight it shifted to OG.”\n\n\r\n                    Thanks largely to Anunoby’s strong game and a solid supporting cast, the Raptors have won two straight and five of their last six. Plus, they maintained their dominance over the Pacers, who have lost six straight season series to Toronto.\n\n\r\n                    Anunoby, the former Indiana University star, was the key.\n\n\r\n                    He went 9 of 16 from the field, 4 of 6 on 3-pointers and 8 of 10 from the free-throw line and he excelled defensively, too, helping to hold Domantas Sabonis, Indiana's All-Star forward, scoreless in the second half.\n\n\r\n                    “They played good individual defense and played really well in the gaps,” said Myles Turner, who led Indiana with 25 points and six blocks. “I would say he (Anunoby) was aggressive, chose his spots well, got downhill and got to the free-throw line. He had a good night.”\n\n\r\n                    The Pacers played catch-up most of the game after falling behind midway through the second quarter. Toronto, with the help of Anunoby, extended the lead to 58-47 at the half.\n\n\r\n                    Indiana finally regained the lead briefly in the fourth quarter, twice.\n\n\r\n                    But the Raptors broke an 82-all tie with an 8-0 run and when Indiana tied the score again with 1:07 to play, Anunoby made three of four free throws. \n\n\r\n                    Toronto scored the final five points to hand Indiana its third loss in four games.\n\n\r\n                    “They played hard, that’s for sure,\" Nurse said. “I've really got to compliment the whole group there.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Anunoby extended his streak of double-figure scoring games to eight. He also made four 3s, giving him 27 in the last eight games. ... Fred VanVleet scored 21 points and has made at least one 3-pointer in a franchise-record 48 consecutive games. ... Toronto forced 13 turnovers and went 10 of 18 on 3s in the first half. ... Norman Powell added 20 points.\n\n\r\n                    Pacers: Sabonis had 10 points and 10 rebounds in the first half alone for his 16th consecutive double-double to open the season. It's the longest streak of his career and the longest in Indiana's NBA era. He finished with 19 rebounds and five assists. ... Justin Holiday had 16 points and 10 rebounds. ... Jeremy Lamb scored 13 points and has 42 in three games since returning from a torn anterior cruciate ligament in his left knee. ... First-year coach Nate Bjorkgren lost his first matchup against his former team.\n\n\r\n                    OUT OF ACTION\n\n\r\n                    While Lowry had been listed as a game-time decision on Toronto's injury report because of a sore right foot, Siakam was a surprise inactive with swelling in his left knee. It's unclear whether either will be available for Monday night's rematch.\n\n\r\n                    WELCOME BACK\n\n\r\n                    Indiana welcomed fans back to Bankers Life Fieldhouse on Sunday. Team officials announced previously they would cap attendance at 1,000. After Monday night, they will consider increasing the capacity. Local and state officials have said the Pacers can have as many as 4,500 fans inside the arena.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Face the Pacers again Monday in Indianapolis.\n\n\r\n                    Pacers: Seeking a second straight split in back-to-back home series this season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996884.936865
}