{
  "game_id": "0022000073",
  "espn_id": "401267233",
  "date": "Jan 01, 2021",
  "matchup": "MIL vs. CHI",
  "headline": "Bucks stay hot from 3-point range in 126-96 rout of Bulls",
  "body": "MILWAUKEE -- — The Milwaukee Bucks believe their offseason roster overhaul made them a better 3-point shooting team. \n\n\r\n                    Their recent efficiency from beyond the arc bears that out.\n\n\r\n                    Giannis Antetokounmpo had 29 points, 12 rebounds and eight assists and the Milwaukee Bucks used torrid shooting to blast the Chicago Bulls 126-96 on Friday.\n\n\r\n                    Milwaukee shot 22 of 45 on 3-point attempts. This came three nights after the Bucks made an NBA-record 29 3-pointers on 51 attempts in a 144-97 rout of the Miami Heat.\n\n\r\n                    “The guys that we have, they're ready,” Antetokounmpo said. “They're ready to shoot the ball right now. I told them to stay ready because that ball is coming.”\n\n\r\n                    Antetokounmpo was two assists from a second straight triple-double. The reigning two-time MVP had 26 points, 13 rebounds and 10 assists Wednesday in a 119-108 loss at Miami.\n\n\r\n                    He only went 1 of 5 from 3-point range Friday but set up many of his teammates for open shots. \n\n\r\n                    “We feel like we’ve added a little more shooting depth, more guys who can make shots,” Bucks coach Mike Budenholzer said. “I just feel like Giannis is really doing a great job of kind of being a facilitator, a point guard, finding shooters and finding opportunities.”\n\n\r\n                    Three of the players the Bucks added were Jrue Holiday, Bryn Forbes and Bobby Portis. That trio went a combined 9 of 14 from 3-point range Friday.\n\n\r\n                     Forbes had 18 points in 22 minutes and was the Bucks' second-leading scorer.\n\n\r\n                    “It took some time to get acclimated,” the former San Antonio Spurs guard said. “New system. New players. New coach. I think it took a lot just to kind of find my groove and where I fit in on this team. They've got confidence in me, and playing with guys like Giannis and Khris (Middleton), it makes my job easy.”\n\n\r\n                    The Bucks shot just 7 of 38 on 3-point attempts in a 130-110 loss at New York  on Sunday, but they’ve gone 67 of 137 in three games since. Their latest 3-point outburst helped the Bucks beat the Bulls for an 11th straight time.\n\n\r\n                    “We really felt like we needed to try to jam the lane up a little bit, try to keep the ball out of the paint, certainly try to take away (Antetokounmpo’s) driving angles to the rim,” Bulls coach Billy Donovan said. “Tall order to do. We gave up a lot of 3’s because of that.”\n\n\r\n                    Zach LaVine scored 16 points and Denzel Valentine had 14 for the Bulls. Wendell Carter Jr. and Coby White each added 12.\n\n\r\n                    Middleton had 14 for the Bucks. Bobby Portis provided 13 points and 12 rebounds. Donte DiVincenzo, Pat Connaughton and Holiday added 11 points each.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Valentine went to the locker room midway through the fourth quarter after the right elbow of Bucks forward Thanasis Antetokounmpo hit the left side of Valentine's face as they were battling for a rebound. ... This trip to Milwaukee concluded a three-game road swing for the Bucks, who had won back-to-back games at Washington on Tuesday and Thursday. They briefly come home to face Dallas on Sunday before playing four straight road games.\n\n\r\n                    Bucks: The Bucks played a third straight game without reserve forward Torrey Craig, who underwent surgery Thursday after fracturing his nose Sunday in a loss to the New York Knicks. Budenholzer said he doesn’t expect Craig to be available during this five-game home stand. “I don’t know that we’ve really set a timeline,” Budenholzer said. “I think we’re just kind of seeing how he comes out of the procedure that he’s had. But my guess is it’s longer than that.\"\n\n\r\n                    SHORT-HANDED BULLS\n\n\r\n                    Chicago played its second straight game without forwards Lauri Markkanen and Chandler Hutchison as well as guards Ryan Arcidiacono and Tomas Satoransky as part of the NBA’s health and safety protocols related to COVID-19. Markkanen is the Bulls’ second-leading scorer (17.3) and top rebounder (6.8).\n\n\r\n                    Donovan said before the game that Hutchison had tested positive and was still in Washington, where the Bulls played their last two games. Markkanen, Arcidiacono and Satoransky were back in Chicago. \n\n\r\n                    KEY STAT\n\n\r\n                    Since the start of the 2018-19 season, the Bucks have gone 28-3 against Central Division opponents. They were 13-1 against the Central last season.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host Dallas on Sunday night.\n\n\r\n                    Bucks: Host Detroit on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997421.001906
}