{
  "game_id": "0022400066",
  "espn_id": "401704632",
  "date": "Oct 23, 2024",
  "matchup": "MIL @ PHI",
  "headline": "Lillard and Antetokounmpo power Bucks past short-handed 76ers 124-109",
  "body": "PHILADELPHIA -- — Damian Lillard scored 30 points, Giannis Antetokounmpo added 25 and the Milwaukee Bucks defeated the Philadelphia 76ers 124-109 in the season opener for both teams Wednesday night.\n\n\r\n              Lillard scored 15 points in the third quarter and finished with six 3-pointers, nine rebounds and five assists.\n\n\r\n              Antetokounmpo shot 8 for 11 from the floor and had a game-high 14 rebounds as Milwaukee got double-figure scoring from six players.\n\n\r\n              Taurean Prince and Bobby Portis scored 16 points apiece for the Bucks, how had 16 3-pointers.\n\n\r\n              Tyrese Maxey scored 25 points and Andre Drummond had 13 points and 11 rebounds for Philadelphia, which was without injured stars Joel Embiid and Paul George, who are sidelined due to knee injuries.\n\n\r\n              TAKEAWAYS\n\n\r\n              Bucks: Lillard and Brook Lopez ran the pick and roll frequently against Philly. The picks were extended out beyond the 3-point line. Several of Lopez’s picks were set at or near half court, allowing Lillard to have a combination of time and space to create offense.\n\n\r\n              76ers: Guerschon Yabusele played his first game in the NBA since 2019. After playing internationally for five seasons, Yabusele provided the 76ers with 10 points, four rebounds, three assists and three steals in 25 minutes.\n\n\r\n              KEY MOMENT\n\n\r\n              Milwaukee used a 25-12 run in a six-minute span of the second quarter to pull away. Bobby Portis was a key figure for the Bucks during that time. On consecutive plays, Portis blocked a shot, grabbed a defensive rebound, assisted Taurean Prince on a layup, picked up a steal and scored on a running layup.\n\n\r\n              KEY STAT\n\n\r\n              Lillard and Antetokounmpo became the first pair of Bucks teammates to register at least 25 points, five rebounds and five assists in a season opener.\n\n\r\n              UP NEXT\n\n\r\n              The Bucks have their home opener against Chicago on Friday. On the same night, Philadelphia travels to Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997864.680436
}