{
  "game_id": "0022201165",
  "espn_id": "401469320",
  "date": "Apr 02, 2023",
  "matchup": "MEM @ CHI",
  "headline": "LaVine, DeRozan lead surge as Bulls rally to beat Grizzlies",
  "body": "CHICAGO -- — The Memphis Grizzlies looked as though they were well on their way to yet another win. The Chicago Bulls had other ideas.\n\n\r\n              Zach LaVine scored 36 points, DeMar DeRozan added 31 and the Bulls used a huge second half to beat the Grizzlies 128-107 and overcome Ja Morant's triple-double Sunday.\n\n\r\n              The Bulls outscored the Western Conference’s second-place team 75-39 over the final two quarters after trailing by 23. They dominated the Grizzlies 40-16 in the third, ending it on a 17-0 run while taking the lead. And they responded with another big push in the fourth after Memphis pulled within three.\n\n\r\n              It wasn't hard to see why LaVine called it “for sure” their best second half.\n\n\r\n              “For how much we were down, to be able to come back and get a lead like we did, I think it's great,” he said. “You gotta definitely pat yourself on the back.”\n\n\r\n              Jaren Jackson Jr. scored 31 points and made five 3-pointers for the Grizzlies, who had won eight of nine. Morant had 17 points, 10 rebounds and 10 assists. Desmond Bane scored 21, but the Grizzlies committed 18 turnovers, leading to 31 points for Chicago.\n\n\r\n              The Bulls, eyeing a spot in the Eastern Conference play-in tournament, tied a franchise low with three turnovers.\n\n\r\n              LaVine had nine assists. Coby White scored 19, and Nikola Vucevic added 13 points and 10 rebounds.\n\n\r\n              BULLS RALLY\n\n\r\n              The Grizzlies led by 23 in the first half and headed to the locker room up by 15 after making 13 of 25 3-pointers, only to commit 10 turnovers and get dominated 40-16 in the third. The Bulls scored the final 17 points of the quarter.\n\n\r\n              “That's how you get easy baskets,” White said. “You reach out and get deflections, get steals, get out in transition. And tonight, it helped us a lot.”\n\n\r\n              Chicago took its first lead at 85-84 when Patrick Williams tipped in White's missed 3 with 1:34 remaining and continued to add to it.\n\n\r\n              White and DeRozan converted three-point plays, and Ayo Dosunmu drove for a finger-roll layup in the closing seconds to give Chicago a nine-point lead.\n\n\r\n              Memphis got within 104-101 on Jackson's 3 midway through the fourth. But the Bulls answered with an 11-0 run.\n\n\r\n              GRIZZLIES DOMINATE EARLY\n\n\r\n              It was quite a turnaround after Memphis just about buried the Bulls in the first half. \n\n\r\n              Jackson, who scored 13 in the first half, made three 3s. He hit two during a 15-2 run that broke open a 46-36 game, and Luke Kennard finished that burst with a 3 from the wing, making it 61-38 with just over five minutes left in the half.\n\n\r\n              CLEARING MIND\n\n\r\n              Bulls center Andre Drummond said he needed time to clear his mind, so he missed a game last week.\n\n\r\n              He also expressed appreciation for the support the team gave him as he addressed some things that had been weighing on him.\n\n\r\n              “I had to take some time away to really clear my mind and address some things that I’d been neglecting for a while,” he said after the Bulls rallied to beat Memphis 128-107 on Sunday. “I feel OK. Obviously, I still have a lot of work to do with my mental. But we have a job to do. And that’s to win basketball games and get to the playoffs.”\n\n\r\n              Drummond missed the Bulls’ 121-110 loss to the Los Angeles Lakers on Wednesday night after he posted on Twitter that he was deleting his social media apps to focus on his mental health. He has since played in each of Chicago’s two games.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Memphis finished 19 of 43 on 3-pointers, after cooling off in a big way in the second half. The Grizzlies were 6 for 18 over the final two quarters. ... G John Konchar was available after missing back-to-back games because of a sore left hip.\n\n\r\n              Bulls: Chicago had three previous games with three turnovers, most recently on March 2, 2014 against New York. ... The Bulls have not decided if G Alex Caruso (sore left foot) will miss a game when they host Atlanta on Tuesday and visit Milwaukee on Wednesday. “We haven't predetermined, 'OK, we get to this back-to-back, this is what we're doing,'” coach Billy Donovan said.\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Portland on Tuesday.\n\n\r\n              Bulls: Host Atlanta on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994161.751188
}