{
  "game_id": "0021800848",
  "espn_id": "401071521",
  "date": "Feb 12, 2019",
  "matchup": "ATL vs. LAL",
  "headline": "Trae Young leads Hawks past LeBron James, Lakers 117-113",
  "body": "ATLANTA --  Trae Young knew he'd have to carry a heavy load, and that was OK with him.\n\nThe rookie was pumped to face LeBron James.\n\nYoung had 22 points and 14 assists, John Collins also scored 22 points despite foul trouble, and the Atlanta Hawks defeated James and the Los Angeles Lakers 117-113 on Tuesday night.\n\nThe Hawks snapped a three-game losing streak despite a triple-double from James, who had 28 points, 16 assists and 11 rebounds.\n\n\"I try to live in big moments,\" Young said. \"I feel like I belong here. He's one of the best players of all time. But when I'm out on the court, I'm trying to compete and get a win.\"\n\nYoung matched his season high by playing 38 minutes, taking on a greater burden after the Hawks bought out the contract of his veteran backup, Jeremy Lin. With Jaylen Adams sidelined by a sprained right ankle, Young was the only true point guard on the roster.\n\n\"It was definitely different,\" Young said. Asked if he was tired, he said with a smile, \"A little bit.\"\n\nDespite chants of \"Kobe's better\" from the sellout crowd of 16,824, James was cheered loudly by a hefty contingent of Lakers fans. He turned in a dazzling effort, equaling his season high by playing 43 minutes, but it wasn't enough to make up for the subpar group around him.\n\nThe Lakers dropped 2 1/2 games behind Sacramento for the final playoff spot in the Western Conference.\n\n\"We either make it or we don't make it,\" James said. \"Don't worry about it.\"\n\nBut the frustration was apparent on his face when he stormed straight to the locker room as soon as the horn sounded.\n\n\"Some guys have never played a playoff game before,\" James said. \"You can't teach them that. It's very important to understand how important every game is, no matter who you're playing or where you are.\"\n\nBoth teams struggled mightily in the final quarter after an up-and-down track meet over the first three periods. The Hawks made just 5 of 19 shots over the final 12 minutes; the Lakers weren't much better, hitting 6 of 22. The teams combined to go 3 of 18 from 3-point range.\n\nThe Hawks scored just seven points in the final 6:33 but managed to hold on. Taurean Prince delivered a key 3-pointer with 1:48 remaining, and Young darted past James for a lay-in and a foul that thwarted any hope of a Lakers comeback.\n\nIt sure didn't start out that way.\n\nAtlanta tied a franchise record for 3-pointers in a quarter, going 10 of 17 in the opening period for a 38-32 lead. The Lakers fought back to take a 69-65 edge at the half, but Atlanta pulled ahead for good to lead 100-95 going to the fourth.\n\nThe Lakers had a chance after an Atlanta turnover led to a driving basket by James, cutting the Hawks' lead to 116-113. But after desperately trying to come up with a steal, Los Angeles was forced to foul Kevin Huerter with 4.3 seconds left. He made the second of two free throws to seal the victory.\n\nTIP-INS\n\nLakers: James' triple-double was his fifth this season. ... Rajon Rondo was charged with six turnovers. ... Kyle Kuzma and Brandon Ingram scored 19 points apiece.\n\nHawks: After matching its record for 3s in a quarter, set Oct. 21 at Cleveland, Atlanta missed all six of its attempts beyond the arc the next period. ... Forty-two-year-old Vince Carter turned in some crucial minutes, contributing 11 points, five rebounds and three assists after sitting out Sunday's loss to Orlando. ... Collins picked up his fifth foul with 7:19 remaining but managed to make it to the end.\n\nINJURY REPORT\n\nThe Lakers were without center Tyson Chandler, who was sidelined by a toe injury. Mike Muscala dressed despite a sprained right ankle, but didn't play against his former team.\n\nAdams is set to take over as Atlanta's backup point guard as soon as he is recovered from his ankle injury. In his absence, DeAndre' Bembry and Kent Bazemore shared the playmaking duties when Young wasn't on the court.\n\n\"Those guys did a good job of keeping up afloat,\" Carter said.\n\nSTAYING PUT\n\nThe Lakers stuck with the same starting five they used in Sunday's loss at Philadelphia.\n\nNewcomer Reggie Bullock, acquired last week from Detroit, took the court with James, Kuzma, Ingram and JaVale McGee.\n\nCoach Luke Walton said he wanted to give that group another look before deciding if further changes are needed.\n\nUP NEXT\n\nLakers: Head into the All-Star break after completing a six-game trip. They don't play again until Feb. 21, when Los Angeles will host James Harden and the Houston Rockets.\n\nHawks: Host the New York Knicks on Thursday in their final game before the break.\n\n---\n\nFollow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 . His work can be found at https://apnews.com/search/paul%20newberry\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995352.714505
}