{
  "game_id": "0022000959",
  "espn_id": "401307762",
  "date": "May 01, 2021",
  "matchup": "ATL vs. CHI",
  "headline": "Young scores 33, Capela has double-double, Hawks beat Bulls",
  "body": "ATLANTA -- — Trae Young scored 33 points, Clint Capela had 20 points and 11 rebounds and the Atlanta Hawks snapped a three-game slide with a 108-97 victory over the undermanned Chicago Bulls on Saturday night.\n\n\r\n                    Playing without their two best players — Zach LaVine and Nikola Vucevic — the Bulls took their first double-digit lead on Thaddeus Young’s tip shot in the first minute of the third quarter.\n\n\r\n                    But the Hawks, who began the night in fifth place in the Eastern Conference, went on a 13-0 run, and Chicago quickly called timeout at the 9:15 mark of the third after John Collins’ 3 from the right wing put Atlanta up 67-65. The Hawks didn’t trail again.\n\n\r\n                    The win secured at least a spot in the play-in tournament for Atlanta, which hasn't been to the playoffs since 2017.\n\n\r\n                    “It shows a huge improvement from where we’ve been to where we are now,\" Young said. “It’s really good to see. Obviously it’s a totally different team. We’ve got a lot of guys, but it’s a great feeling. Winning is a really good feeling. Hopefully we can keep it going.\"\n\n\r\n                    The Bulls, who began the game in 11th place in the East, have lost three straight and 10 of their last 14.\n\n\r\n                    Kevin Huerter’s straightaway 3 gave Atlanta an 88-79 lead, but the Bulls kept hanging around. Young, however, hit a 3 with 6:40 remaining to make it 95-85, and the Hawks were never really threatened again.\n\n\r\n                    Despite missing their last nine shots from the field in the third, the Hawks entered the fourth leading 82-75. Atlanta missed its first two shots before Danilo Gallinari’s 3 from the right wing made it 85-77.\n\n\r\n                    Young’s floater padded the lead to 103-91 and ended any remaining suspense with 3:07 to go.\n\n\r\n                    Thaddeus Young led the Bulls with 20 points, and Patrick Williams scored 15 of his 19 in the first half.\n\n\r\n                    “I think the challenge is sustainability,\" Thaddeus Young said. “It’s hard to sustain without your two best scorers in the lineup. That’s a total of almost 50 points between the two of them. When you have guys like and you have to try to make up 40 to 45 points for, that’s difficult.\n\n\r\n                    “That has to come from somewhere and we have to do it as a collective group. That’s the hardest part.\"\n\n\r\n                    Collins finished with 13 points and 10 rebounds for Atlanta.\n\n\r\n                    The Hawks went on a 7-0 run to end the first on Onyeka Okongwu’s hook shot, but a 26-12 spurt put Chicago ahead at 52-44 on Ryan Arcidiacono’s left corner 3 with 4:15 to go in the second.\n\n\r\n                    Atlanta gave up 17 points on 10 first-half turnovers as the Bulls led 63-54 at intermission. Both teams were playing a back-to-back and coming off losses, but it was the home team that looked lethargic early defensively.\n\n\r\n                    The Hawks improved to 21-9 under interim coach Nate McMillan.\n\n\r\n                    “We understood that we needed that this was kind of a must-win game for us after coming off a stretch of losing three in a row,\" Trae Young said. “We needed to get this one being a home. This gets us off to a good streak at home. We definitely came out with a different sense of urgency in that second half.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: Vucevic was questionable before the game with right adductor tightness. ... Markkanen returned after missing one game with an illness. ... LaVine, who scored a career high 50 in the Bulls’ loss at State Farm Arena on April 9, missed his 10th straight game in the NBA’s health and safety protocol. ... Troy Brown Jr. (left ankle sprain) and Cristiano Felicio (illness) were out, too. ... Chicago was 6 for 24 on 3s.\n\n\r\n                    Hawks: G Bogdan Bogdanovic returned after missing the last two games with left hamstring soreness and scored 15 points. ... Huerter, sidelined two games with a left shoulder sprain, had six points. ... F De’Andre Hunter, who has missed most of the second half of the season with right knee soreness, is getting closer to returning, but McMillan still had no immediate timetable. ... F Cam Reddish is likely to miss the rest of the regular season with right Achilles soreness.\n\n\r\n                    NO TANKING\n\n\r\n                    Chicago coach Billy Donovan said the team has had no discussions about sitting veterans to help improve its draft standing. There also has been some buzz that LaVine might not return, with just eight games remaining.\n\n\r\n                    “I haven’t had any conversations like that,” Donovan said. \"Our focus is on tonight and then coming back with Philly. We have not any discussions along those lines at all.”\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Host Philadelphia on Monday.\n\n\r\n                    Hawks: Host Portland on Monday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997621.489093
}