{
  "game_id": "0021801138",
  "espn_id": "401071811",
  "date": "Mar 30, 2019",
  "matchup": "SAC @ HOU",
  "headline": "Harden logs fifth career 50-point triple-double",
  "body": "HOUSTON -- James Harden and the Houston Rockets knew they'd have to be aggressive Saturday night to counteract the young and fast-paced Sacramento Kings.\nIt was that mindset that led to another huge game for the Beard and a victory for the Rockets.\nHarden had 50 points, 11 rebounds and 10 assists, scoring 10 straight Houston points down the stretch to help the Rockets beat the Kings 119-108. \n\"They made a run, which we knew they were going to have in them,\" Harden said. \"But I just tried to be aggressive, whether it was making an assist or getting to the basket or shooting my shot. That was it.\"\nHarden had his 42nd career triple-double and third 50-point game in the past six. He made seven 3-pointers to become the ninth player in NBA history to reach 2,000 career 3s. It was his NBA-record fifth 50-point triple-double, which is two more than second-place Russell Westbrook and the second this season.\nCoach Mike D'Antoni, who is in his third season with the Rockets, continues to be impressed by Harden's performances.\n\"It's remarkable what he does, and he does it every night,\" D'Antoni said. \"I keep thinking, 'Gosh, can he do this every game?' And then he does it for three years.\"\nHouston had a three-point lead when Harden re-entered with less than seven minutes left. Willie Cauley-Stein made an alley-oop dunk to cut it to one before Harden scored all of Houston's points in a 10-2 run that made it 111-102 with three minutes to go. Harden grabbed the rebound after a miss by Marvin Bagley and found Clint Capela for a dunk that pushed the lead to 113-104.\nCapela added 24 points and 15 rebounds, and Chris Paul had 22 points. Houston has won four of five.\nBogdan Bogdanovic had 24 points for the Kings. They have lost two straight and fell to 0-3 against Houston this season.\n\"I liked the way our guys fought,\" Sacramento coach Dave Joerger said. \"Came down to the fourth quarter, and we didn't get enough shots to go down ... they made a lot of big shots, and that's what they do.\"\nSacramento led by two to start the fourth before the Rockets used a 7-2 run, capped by a 3 from Paul, to take a 98-95 lead with about nine minutes left. The Kings made three free throws to tie it, but PJ Tucker made a 3-pointer to put Houston up 101-98 with about seven minutes remaining.\nThe Rockets had a 3-point lead at halftime and opened the third quarter with an 8-2 run, with 3s from Eric Gordon and Paul, to make it 71-62.\nAn 11-2 spurt by the Kings tied it at 83-83 with about 3½ minutes left in the quarter. De'Aaron Fox and Harrison Barnes had 3-pointers in that stretch, and Buddy Hield added a 3-point play.\nHouston missed 3-point attempts in a row to allow the Kings to close the gap.\nHarden, who made 17 of 18 free throws, finally ended the drought when he hit one from the corner right after that to put the Rockets back on top, and he made a layup a few seconds later to make it 88-83.\nBut the Kings scored the next 10 points, with eight from Bagley, to take a 93-88 lead.\nPaul made a 3-pointer for Houston's first points in 2½ minutes to cap the third quarter and cut the lead to 93-91 entering the fourth quarter.\nTIP-INS\nKings: Harry Giles missed his fifth game with a bruised thigh. ... Fox and Joerger both received technical fouls in the second quarter. ... Hield had 21 points, and Bagley added 20.\nRockets: Capela has at least 10 rebounds in a career-high 12 straight games. ... Kenneth Faried sat out for the third straight game with a sore left knee. ... Gerald Green missed his fourth game with a strained groin. D'Antoni said he expects him to return by the middle of next week. ... Harden has scored 30 points or more 53 times this season.\nMORE HARDEN\nSaturday was Harden's ninth 50-point game this season -- that's the most since Kobe Bryant had 10 in 2006-07. Harden needed just 37 minutes to score 50 points on Saturday for his fourth 50-point game in which he has played fewer than 40 minutes and the seventh of his career, which is the most in NBA history.\nUP NEXT\nKings: At San Antonio on Sunday night.\nRockets: At Sacramento on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994160.110803
}