{
  "game_id": "0022000746",
  "espn_id": "401307537",
  "date": "Apr 02, 2021",
  "matchup": "LAL @ SAC",
  "headline": "Kuzma's season-high 30 points lead Lakers past Kings 115-94",
  "body": "SACRAMENTO, Calif. -- — Kyle Kuzma scored 10 of his season-high 30 points in the fourth quarter and the short-handed Los Angeles Lakers thumped the Sacramento Kings 115-94 on Friday night.\n\n\r\n                    Dennis Schroder had 17 points and eight assists as the Lakers bounced back from a 15-point loss to Milwaukee two nights earlier. Kentavious Caldwell-Pope added 13 points and 10 rebounds. Markieff Morris had 14 points and eight rebounds.\n\n\r\n                    “Our guys really had a high level of attention to detail with executing the game plan against one of the hottest offenses in the league,” Lakers coach Frank Vogel said. “Our guys just played with great tenacity and really just had a gem of a defensive performance tonight.”\n\n\r\n                    Already without LeBron James, Anthony Davis and newly signed center Andre Drummond, the Lakers lost reserve guard Wesley Matthews to injury in the first quarter.\n\n\r\n                    It hardly mattered.\n\n\r\n                    Los Angeles led by 13 in the first and stayed comfortably in front the remainder of the game. After Kuzma made his fourth 3-pointer early in the fourth, he converted a three-point play to make it 106-82.\n\n\r\n                    “This was probably our best game with all those guys out, from the standpoint of playing the right way and doing it for 48 minutes,” Kuzma said. “Defensively, holding a team under 100 is what you want to do every time out. And we made shots. Those were the factors.”\n\n\r\n                    Harrison Barnes had 26 points, five rebounds and five assists for the Kings. De’Aaron Fox, recently selected Western Conference player of the week, scored 12 points on 5-of-20 shooting.\n\n\r\n                    Sacramento has lost its last two after winning a season-best five straight.\n\n\r\n                    “We have to do other things better and that starts with the intensity and physicality that we play with,” coach Luke Walton said. “That was a team that had been struggling to score, struggling to shoot and they got into a rhythm. It felt like they were pushing us around tonight.”\n\n\r\n                    GASOL MULLS FUTURE IN LA\n\n\r\n                    Marc Gasol was asked about his future with the Lakers, five days after the team signed Drummond. Gasol, who had five points, six assists and nine rebounds in 28 minutes, has started 39 of the 40 games he’s played in this season but will be back on the bench when Drummond returns from a toe injury.\n\n\r\n                    “It’s a hard pill to swallow because I know I’m going to be out of the lineup at some point,” Gasol said. “You’re not Plan A right now. You’re Plan C, D. You have to accept it because that’s your job, but it’s not easy. You have to adapt. You either take it as a challenge or you move on.”\n\n\r\n                    Vogel spoke with Gasol about the move and said he remains key to the Lakers' success.\n\n\r\n                    “People need to understand how good a player Marc Gasol is and how valuable he is to what we’re doing,” Vogel said. “He’s going to help us win a championship this year. That’s the plan, that’s the vision. Additions of good players change guys' roles and it usually works out. I would say the same thing about this situation.”\n\n\r\n                    TURNOVERS THE KEY\n\n\r\n                    Los Angeles dominated Sacramento on the boards (54-38), but the difference came in points off turnovers. The Lakers scored 24 points off 15 Kings turnovers, while Sacramento had 11 points off 17 Los Angeles turnovers.\n\n\r\n                    FANS SOON IN STANDS\n\n\r\n                    With California set to open for indoor sports, and concerts to resume with limitations on April 15, both the Kings and Lakers are in line to host fans for the first time this season, although neither team has announced a date for that to happen.\n\n\r\n                    The Lakers return from a seven-game road trip and host the Boston Celtics on April 15. The earliest the Kings could let fans back in is April 20 when they host the Minnesota Timberwolves at Golden 1 Center. \n\n\r\n                    TIP-INS\n\n\r\n                    Lakers: Matthews was questionable before the game with a bruised neck and left after appearing to aggravate the injury. He went down and remained on the court for several moments before getting to his feet. After walking off, Matthews dropped to one knee, then got up holding the back of his neck and was helped to the locker room. \n\n\r\n                    Kings: Barnes shot 9 of 10. … First-round draft pick Tyrese Haliburton was held to nine points.\n\n\r\n                    UP NEXT\n\n\r\n                    Lakers: At the Los Angeles Clippers on Sunday afternoon. The Clippers won 116-109 when the teams played in December.\n\n\r\n                    Kings: Play the Bucks on Saturday night. Milwaukee has won four straight on the road and nine overall against Sacramento.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997292.778996
}