{
  "game_id": "0021900821",
  "espn_id": "401161463",
  "date": "Feb 20, 2020",
  "matchup": "MIA @ ATL",
  "headline": "Young's career-high 50 points lead Hawks past Heat, 129-124",
  "body": "ATLANTA --  Trae Young didn't attribute his first 50-point game to confidence gained from his first All-Star start.\n\nBelief in himself has never been a problem for the high-scoring guard with a fondness for 30-foot jumpers.\n\nYoung had a career-high 50 points and the Atlanta Hawks scored the last 10 points of the game to beat the Miami Heat 129-124 on Thursday night.\n\nYoung made 18 of 19 free throws and 8 of 15 3-pointers to set his scoring high in his first game after starting in the NBA All-Star Game.\n\n\"I've always had confidence in myself,\" Young said when asked if he was boosted by the All-Star Game experience.\n\nYoung scored 20 points in the final period.\n\n\"A big game from our leader,\" said Atlanta's John Collins. \"... We got some big plays from our big-time guy.\"\n\nThe Heat had no answer for Young's barrage of 3-pointers, many from well beyond the line.\n\n\"He just got into such an incredible rhythm,\" said Miami coach Erik Spoelstra. \"He's pulling up from six feet behind the line. ... There's not a lot of things you can do about that.\"\n\nBam Adebayo had 28 points and a season-high 19 rebounds for Miami. Adebayo, the NBA All-Star skills champion, added seven assists.\n\nMiami couldn't hold a 124-119 lead. After De'Andre Hunter's tying 3-pointer, Cam Reddish scored with 31 seconds remaining following his steal from Goran Dragic to give the Hawks a 126-124 lead. Young's two free throws increased the lead to four points.\n\nKevin Huerter and Hunter each scored 17 points for Atlanta.\n\nYoung hit a jumper for Atlanta's first field goal of the final period. On the Hawks' next possession, Young's crossover dribble had Andre Iguodala on his heels, and Young then sank a long 3-pointer for a 97-all tie.\n\n\"He's shooting 50-footers,\" Adebayo said. \"At the end of the day you've got to live with that.\"\n\nWith Hawks fans still buzzing after watching Young's knee-buckling fake on replays during a timeout, Iguodala answered with back-to-back baskets, including a 3-pointer, as Miami reclaimed the lead.\n\nYoung wasn't finished. He kept the Hawks close by scoring 14 of Atlanta's first 18 points of the final period. Young's three-point play tied the game at 119-all.\n\nMiami led 36-32 after the first period before a shooting drought in the second quarter as Atlanta took the lead with a 15-0 run. After trailing 41-37, Atlanta led 52-41 after the run, capped by Hunter's 3-pointer.\n\nTIP-INS\n\nHeat: Fresh off winning the All-Star dunk contest, Derrick Jones Jr. was replaced in the starting lineup by Jae Crowder. The move was part of a roster adjustment with C Meyers Leonard (left ankle sprain) held out.\n\nHawks: Young's previous high mark was 47 points at Indiana on Nov. 29. ... C Clint Capela (plantar fasciitis) has started some shooting practice and his recovery will be evaluated in two weeks. Capela and F Skal Labissiere (left knee) were acquired at this month's trade deadline. Labissiere also will evaluated in two weeks. ... Huerter's status was in doubt until pregame warmups following his allergic reaction to a meal.\n\nSLUMP FOR HEAT\n\nMiami has lost five of its last six games. \"We'll figure it out,\" said Jimmy Butler, who had 17 points, nine assists and eight rebounds. \"We've got nothing but time. ... I'm confident in our group.\"\n\nROAD WOES\n\nMiami is 22-3 at home but fell to 13-17 on the road. \"We've just got to win on the road,\" Adebayo said. \"Plain and simple.\"\n\nSpoelstra blamed the defense after the Hawks made 16 of 35 3s and 48.2% of their overall field goal attempts (41 of 85).\n\n\"We have to focus in on closing games out and doing it on the defensive end,\" said Crowder, who had 14 points.\n\nUP NEXT\n\nHeat host Cleveland on Saturday night.\n\nHawks host Dallas on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995494.1999931
}