{
  "game_id": "0022200176",
  "espn_id": "401468331",
  "date": "Nov 11, 2022",
  "matchup": "DEN @ BOS",
  "headline": "Tatum scores 34, Celtics beat Nuggets for 5th straight win",
  "body": "BOSTON -- — Grant Williams dubbed himself “Batman” after he helped the Boston Celtics neutralize Nuggets star Nikola “Joker” Jokic during a win in Denver late last season.\n\n\r\n              The Celtics relied on their offense to keep the reigning back-to-back MVP from getting his revenge. Jayson Tatum had 34 points, eight rebounds and five assists and Boston extended its season-best win streak to five games by beating Denver 131-112 on Friday night.\n\n\r\n              It was Tatum’s third straight game with at least 30 points and seventh time with 30-plus this season. Boston had just seven turnovers and shot 57% from the field with 16 3-pointers. Jaylen Brown had 25 points, eight rebounds and eight assists. \n\n\r\n              \"It's just a lot of fun right now on the offensive end,\" said Al Horford, who had six 3-pointers and finished 21 points and seven rebounds. “Guys are really conscious of understanding of what coach wants and what he expects. He wants good spacing and we're doing a good job of getting to those positions. \n\n\r\n              “It's fun to see when it comes together like that.\"\n\n\r\n              Interim coach Joe Mazzulla said he likes the trust on the floor he sees between his players. \n\n\r\n              “Our guys are bought into making each other better, whether they have the ball or not,” Mazzulla said. \n\n\r\n              The loss snapped the Nuggets’ four-game win streak. \n\n\r\n              Jokic had 29 points and and eight rebounds but struggled with early foul trouble. Aaron Gordon added 17 points and eight rebounds.\n\n\r\n              The Nuggets stayed close despite its bench playing shorthanded after Bones Hyland was placed in the health and safety protocols prior to tipoff. Bruce Brown was the most productive, playing 37 minutes and finishing with 16 points, 10 rebounds and six assists\n\n\r\n              Denver trailed 77-70 when Jokic went to the bench after his fourth foul with about seven minutes left in the third quarter.\n\n\r\n              The Nuggets kept chipping away without him, eventually cutting what had been an 18-point, first-half deficit to 87-85.\n\n\r\n              Jokic returned at the start of the fourth, but it didn’t stop Boston from growing its lead to 111-95. \n\n\r\n              Things got a little chippy in the closing minutes. \n\n\r\n              Gordon was called for a Flagrant 1 foul after he scored on a dunk, then was deemed to have made a hostile act by running over Williams. \n\n\r\n              It did little to stifle the Celtics’ momentum. \n\n\r\n              Boston went on an 11-3 run after that, extending its lead to 127-109. \n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Coach Mike Malone won a challenge on what was originally called an offensive foul on Jokic with 9:37 left in the game. It was changed to a blocking foul on Boston’s Marcus Smart. It would have been Jokic’s fifth foul. … Ish Smith (calf) sat for the fifth straight game. … Closed the first half on a 17-6 run. \n\n\r\n              Celtics: Boston led 102-93 in the fourth when Michael Porter Jr. was called for a flagrant foul after he stepped into Tatum’s landing area on a 3-point attempt. Tatum came down on Porter’s foot and grabbed at his left ankle but was able to remain in the game. … Malcolm Brogdon sat out and is day to day with right hamstring tightness. ... Took a 66-57 lead into halftime. … Led 33-25 at the end of the first, shooting 61% from the field with no turnovers. \n\n\r\n              STICK WITH IT \n\n\r\n              Boston's Payton Pritchard had the hustle play of the game in the second quarter. \n\n\r\n              The Celtics missed fight straight shots on a single possession before the ball was corralled by Denver’s DeAndre Jordan. \n\n\r\n              But just as he turned to push the ball up the court Pritchard — who had rebounded two of Boston’s previous misses — snuck in from behind, ripped it away and dropped in a layup to conclude the wild series. The effort sent the Celtics bench into a frenzy and prompted a Nuggets timeout.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: At Chicago on Sunday. \n\n\r\n              Celtics: At Detroit on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994733.6606221
}