{
  "game_id": "0022300551",
  "espn_id": "401585179",
  "date": "Jan 14, 2024",
  "matchup": "CHA @ MIA",
  "headline": "Bam Adebayo stars as the Miami Heat beat the Charlotte Hornets 104-87",
  "body": "MIAMI -- — Bam Adebayo had 24 points, 10 rebounds and seven assists, helping the Miami Heat beat the Charlotte Hornets 104-87 on Sunday night.\n\n\r\n              Tyler Herro made four 3-pointers and scored 21 points for Miami, which never trailed. Duncan Robinson had 19 points, and Jaime Jaquez Jr. scored 15 before departing early in the second quarter because of a groin strain.\n\n\r\n              The Heat went 11 for 25 from 3-point range while completing a four-game sweep of the regular-season series against Charlotte. They also won their 22nd straight game at home against Southeast Division opponents.\n\n\r\n              “This was potentially a trap game,” Heat coach Erik Spoelstra said. “I thought the approach was terrific and everything was generated, particularly in the first half, by our defensive effort.”\n\n\r\n              Terry Rozier scored 26 points for Charlotte, and LaMelo Ball had 21 points, 10 rebounds and five assists. Miles Bridges finished with 20 points.\n\n\r\n              The Hornets have dropped five in a row and 16 of 17 overall.\n\n\r\n              The Hornets scored 31 points in the first half — an NBA low for any half this season — and trailed by 21 at the break. They went 1 for 18 from 3-point range and committed 10 turnovers in the first two quarters.\n\n\r\n              “I thought early on, we really got a lot of good shots that we’ve been making. They didn’t go in,” Hornets coach Steve Clifford said. “That’s going to happen. I think the bigger part of tonight is when the ball’s not going in we’ve got to keep defending. What we haven’t done in the last three games, we haven’t defended anywhere near the level that we were. That’s what we have to get back to.”\n\n\r\n              Ball, who returned Friday after a 20-game absence because of a right ankle injury, scored 14 points in the third period. Ball’s jumper with 6:06 remaining reduced the deficit to 64-52 before Miami responded with a 13-5 spurt.\n\n\r\n              “Basketball is a game of runs, they’re going to hit shots,” Herro said. “It’s just about answering and making sure we’re playing the right way.”\n\n\r\n              Charlotte lost its previous two games by a total of 61 points. It opened a three-game trip with a 135-99 loss at San Antonio on Friday night.\n\n\r\n              “We have to have a better buy-in. It’s simple as that,” Hornets forward P.J. Washington said. “We’re messing up on coverages, we’re not doing the right thing on offense, just got a lot of cleaning up to do.”\n\n\r\n              Jaquez, who has played in every game of his rookie season, will not travel for the Heat’s two-game road trip that starts Monday at Brooklyn. He sustained a similar injury before the season started, but he doesn't think this one is as serious.\n\n\r\n              “It slowly started to get worse in the duration of the game,” Jaquez said. “I don’t think it’s as severe but a lot of prevention we’re looking at right now.”\n\n\r\n              Frustrations mounted for Ball in in the second quarter. He was laying on the floor when he grabbed Adebayo by the leg as he attempted to race toward the other end of the court.\n\n\r\n              Miami star Jimmy Butler was sidelined by a right foot injury. He has missed 11 of the team’s last 12 games and 15 total on the season. He is on the brink of becoming ineligible for postseason award consideration because of the league’s participation rules.\n\n\r\n              Butler is expected to travel with the team for the road trip.\n\n\r\n              It was the start of a nostalgic week for Miami. The Heat had a halftime ceremony to commemorate Dwyane Wade’s enshrinement in the Basketball Hall of Fame last year. During the ceremony, Heat President Pat Riley announced that a statue of Wade will be unveiled outside the Kaseya Center next year. In their next home game on Friday, the Heat will retire Udonis Haslem’s No. 40 jersey.\n\n\r\n              “I was born and raised in Chicago, but this is where I grew up,” Wade said. “From 21 years old ’til 37, I grew up here. A lot of the fan base, they grew up with me. ... There’s no love like Miami love, and every time I come back here I feel that.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit New Orleans on Wednesday.\n\n\r\n              Heat: Visit Brooklyn on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995656.278451
}