{
  "game_id": "0022400268",
  "espn_id": "401704834",
  "date": "Nov 23, 2024",
  "matchup": "CHA @ MIL",
  "headline": "Ball's career-high 50 points not enough as Antetokounmpo, Lillard lead Bucks past Hornets 125-119",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo had 32 points and 11 rebounds and Damian Lillard added 31 points to lead the Milwaukee Bucks past the Charlotte Hornets 125-119 on Saturday night for their fourth consecutive victory.\n\n\r\n              Milwaukee opened the fourth quarter with a 14-5 spurt for a 110-90 lead, but the Hornets got it to 121-119 on Brandon Miller’s 3-pointer with 15 seconds left.\n\n\r\n              Taurean Prince answered with a pair of free throws for the Bucks to make it a two-possession game, and Charlotte missed a pair of 3-pointers on the ensuing possession. Antetokounmpo hit two free throws with 4.5 seconds left to make it 125-119.\n\n\r\n              LaMelo Ball had a career-high 50 points for the Hornets, and Brandon Miller added 32. Ball hit 17 of 38 shots, including 6 of 17 beyond the arc, and 10 of 13 free throws.\n\n\r\n              Milwaukee, which completed a 4-0 homestand, has won six of its last seven. The only loss in that span was a 115-114 loss to the Hornets on Nov. 16 following a controversial foul call.\n\n\r\n              Charlotte’s Grant Williams went to the locker room late in the fourth quarter with an apparent leg injury and did not return.\n\n\r\n              Takeaways\r\n              Hornets: Charlotte has lost five of its last seven.\n\n\r\n              Bucks: Lillard, who did not play in the Bucks' last game against Charlotte, hit 9 of 21 shots, including 10 of 11 free throws.\n\n\r\n              Key moment\r\n              Milwaukee hit four consecutive 3-pointers for a 12-3 run and a 96-83 lead late in the third quarter.\n\n\r\n              Key stat\r\n              The Bucks were 18 of 37 from beyond the arc, matching their season high in 3-pointers made.\n\n\r\n              Up next\r\n              The Hornets host the Orlando Magic on Monday, and the Bucks are at the Miami Heat in NBA Group Play on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997458.8606951
}