{
  "game_id": "0021500916",
  "espn_id": "400828803",
  "date": "Mar 04, 2016",
  "matchup": "TOR vs. POR",
  "headline": "DeMar DeRozan makes 24 straight FTs in Raptors' win",
  "body": "TORONTO -- After watching his Raptors survive a 50-point game from Damian Lillard and hang on for a 117-115 victory over the Portland Trail Blazers, Toronto coach Dwane Casey was in disbelief.\n\"How he isn't an All-Star in our league, shame on us,\" Casey said. \"That young man can score any which way he wants to. Talk about [Stephen] Curry coming across halfcourt and shooting it? This young man can come across halfcourt and shoot it also.\"\n\nToronto overcame Lillard's outburst behind a season-high 38 points from DeMar DeRozan, who made 24 consecutive free throws. That helped the Raptors win their franchise-record 12th straight home game.\nLillard wasn't selected to the All-Star Game last month in Toronto, and Casey had suggested before the game that the Trail Blazers point guard was playing with a chip on his shoulder as a result of the snub.\n\"He's going to be trouble for all of us for a long period of time,\" Casey said.\nLillard's 50 points were one shy of his career high, set last month in Portland's 137-105 win over the Golden State Warriors.\nAfter starting the fourth quarter on the bench, Lillard scored 22 points in the final 12 minutes and went 4-of-7 from 3-point range while the Trail Blazers closed what had started as a 13-point deficit into a two-point game on multiple occasions.\n\"I told myself on the bench when I get back in the game I'm going after this game, I'm going to go out there and try to take over the game,\" he said. \"That was just my mindset.\"\nIn a chippy game, the Raptors relied on DeRozan and also got 28 points from Kyle Lowry.\nDeRozan was 24-of-25 at the foul line, and his only miss was an intentional one with 0.9 seconds left to run out the clock. He set career highs for free throw attempts and makes, and is the first player to make 24 in a game since Dwight Howard had 25 in 2013. No player in NBA history has ever gone 25-for-25 from the line.\nDeRozan is the first player to take 25 free throws and make 96 percent of them since Michael Jordan in 1987, according to the Elias Sports Bureau.\n\"I was just taking what they were giving me, honestly,\" DeRozan said. \"I wasn't trying to force anything. Every time I saw an angle I was trying to take advantage of it.\"\nToronto set franchise marks in free throws made (43) and attempted (54), and the amount of fouls being called didn't go over particularly well with the players.\n\"It kind of messed up the flow of the game a little bit, but it happens,\" said C.J. McCollum, who had 24 points and joined Lillard as the only Trail Blazer with double figures in points.\nSHARP SHOOTER\nWith his 50-point outing, Lillard became the first Blazer with three 40-point games in a season since Brandon Roy and the second player in franchise history to score 50 or more points twice, joining Geoff Petrie. Lillard also became the second player in Portland history to have 50-plus points in a loss, joining Damon Stoudamire. And he is the second player with multiple 50-point games this season, joining Curry, who has three.\nMR. 9,000\nDeRozan became the third player in Raptors history to score 9,000 points, joining Vince Carter and Chris Bosh. It evidently wasn't really something that he had thought much about. \"Oh really?\" he said. \"I don't know any of this. I swear I don't think anything until you tell me or I read it on Twitter. It's cool with me.\"\nVALANCIUNAS AT THE DOUBLE\nJonas Valanciunas got his team-leading 14th double-double on 17 points and a game-high 10 rebounds. He has scored in double figures in a career-high 13 consecutive games, and Toronto improved to 12-2 when Valanciunas has a double-double.\nCELEBRITY COACH\nCanadian rapper Drake, who was the winning coach against Kevin Hart's team during the All-Star weekend's celebrity game in Toronto last month, took in the game courtside, joining the Raptors broadcast in the second quarter to give his thoughts on Toronto's red-hot play at home of late.\nTIP-INS\nTrail Blazers: Lillard has now scored at least 30 points in nine of his last 11 games, and he averaged 29.8 points per game in February.\nRaptors: With the win, the Raptors swept the season series with the Trail Blazers for the first time since the 1996-97 season. ... Jason Thompson signed with Toronto on Tuesday and saw his first action as a Raptor on Friday night, playing 1:12 in the second quarter. ... The Raptors are now just one win from tying the franchise record for victories against Western Conference teams (16), a mark achieved three times previously.\nUP NEXT\nTrail Blazers: Visit Detroit on Sunday.\nRaptors: Host Houston on Sunday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764994707.9911082
}