{
  "game_id": "0021600347",
  "espn_id": "400899789",
  "date": "Dec 10, 2016",
  "matchup": "ORL vs. DEN",
  "headline": "Gallinari, Faried lead Nuggets to 121-113 win over Magic",
  "body": "ORLANDO, Fla. --  Danilo Gallinari is at his best when being aggressive and imposing his will on opposing teams.\n\nThat hasn't always come easily to the Denver Nuggets forward.\n\nGallinari managed to put it all together Saturday night, scoring 21 points in leading the Nuggets to a 121-113 win over the Orlando Magic. He consistently attacked in the paint and got to the foul line 10 times.\n\n\"That's what I need to do every game,\" said Gallinari, who shot 5 for 8 from the field and 9 of 10 at the free throw line. \"The more I'm aggressive, the more I can make things happen for everybody else.\"\n\nGallinari hit perhaps his biggest shot when he nailed a 3-pointer that put the Nuggets ahead 109-106 late in the fourth quarter. Denver never trailed again in a game that included 12 lead changes and six ties up to that point.\n\n\"It's real simple with Danilo: When he is aggressive, he's a great player,\" said Nuggets coach Michael Malone, whose team improved to 9-15. \"When he settles for jump shots and doesn't get to the foul line, he is not as good of a player.\"\n\nThe entire Nuggets team played aggressively Saturday, successfully attacking a short-handed Orlando interior that was without center Nikola Vucevic, who injured his back during Friday night's loss at Charlotte.  Power forward Serge Ibaka and Bismack Biyombo were there but that did little to slow the Nuggets, who outscored Orlando in the paint 64-34.\n\nIn addition to Gallinari, Denver also got big baskets inside from Jusuf Nurkic, Nikola Jokic and Kenneth Faried. It didn't help the Magic that leading shot blocker Biyombo was nursing a left shoulder injury and wore a brace to protect it.\n\n\"They have shot blockers in there but we can't be afraid of them,\" said Faried, who had 19 points and 10 rebounds off the bench. \"We have to keep attacking them. Sooner or later something is going to give. Either we are going to get our shot blocked or we are going to finish over the top. We were able to finish tonight.\"\n\nIt was a sore point for Magic coach Frank Vogel, who has seen his top-3 defense cave during this stretch of playing eight games in 12 days.\n\n\"Most of it was on the interior,\" said Vogel, whose team has lost three straight. \"Nurkic is a load in there. Not having (Vucevic) hurt us a little bit.\"\n\nNurkic had 17 points on 8-of-11 shooting and grabbed eight rebounds for the Nuggets, who lost their previous two games. Will Barton scored 16.\n\nFaried was 9 of 10 from the field, and Denver shot 57 percent.\n\nTIP-INS\n\nNuggets: Denver outrebounded the Magic 35-26 and benefited with 17 second-chance points to just seven for Orlando. ... Denver's bench outscored Orlando's reserves 58-34.\n\nMagic: Orlando recalled rookie center Stephen Zimmerman from the Erie BayHawks of the NBA Development League.\n\nROOKIE BREAKOUT\n\nDenver rookie Juancho Hernangomez had his best outing as a pro, coming off the bench to score 14 points. After missing his first 3-pointer of the night, he knocked down four straight in the first half. He also had a big basket inside to tie the game at 106 in the fourth.\n\nUP NEXT\n\nNuggets: Their six-game road swing ends Monday in Dallas. The Mavericks have won five of the last six regular-season matchups.\n\nMagic: Orlando visits Atlanta on Tuesday night. The Magic have lost 17 of their last 22 games against the Hawks.",
  "source": "espn_api",
  "crawled_at": 1764995867.059829
}