{
  "game_id": "0022400722",
  "espn_id": "401705288",
  "date": "Feb 05, 2025",
  "matchup": "MEM @ TOR",
  "headline": "Jackson scores 32 points, Morant has 26 as Grizzlies rout Raptors 138-107 for 4th straight win",
  "body": "TORONTO -- — Jaren Jackson Jr. scored 32 points, Ja Morant had 16 of his 26 in the third quarter and the Memphis Grizzlies won their fourth straight game, routing the Toronto Raptors 138-107 on Wednesday night.\n\n\r\n              Making his first professional appearance in his home city, Grizzlies rookie Zach Edey had 13 points and 14 rebounds for his eighth double-double and third in three games.\n\n\r\n              The Grizzlies won their third consecutive meeting with the Raptors and their fifth straight in Toronto.\n\n\r\n              Memphis scored a franchise-record 155 points in Dec. 26 home win over Toronto, including 78 in the first half. The Grizzlies didn’t match that mark Wednesday, but a season-high 85 points in the second half got them close.\n\n\r\n              Jamal Shead, Ochai Agbaji and Ja’Kobe Walter each scored 14 points for the Raptors. Gradey Dick had 13 and Scottie Barnes added 11.\n\n\r\n              Toronto played without leading scorer RJ Barrett (concussion protocol) for the second straight game. Center Jakob Poeltl sat because of the right hip injury that forced him out at halftime Tuesday in a loss to the Knicks.\n\n\r\n              Takeaways\r\n              Grizzlies: Edey shot 5 for 5 and made three of four from the free throw line.\n\n\r\n              Raptors: Barnes didn’t score his first points until the final two minutes of the first half. He shot 4 for 18 and went 0 for 7 from 3-point range.\n\n\r\n              Key moment\r\n              Toronto led 61-53 early in the second half but Morant scored 14 points as Memphis used a 30-11 spurt to lead 83-72 with 4:14 remaining in the third. The Grizzlies maintained a double-digit lead the rest of the way.\n\n\r\n              Key stat\r\n              Morant connected on two of five 3-pointers in the third, one more than the entire Raptors team made in nine attempts from distance.\n\n\r\n              Up next\r\n              Both teams face Western Conference-leading Oklahoma City next. Toronto visits the Thunder on Friday, and Memphis hosts the Thunder on Saturday. ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997726.746621
}