{
  "game_id": "0022200256",
  "espn_id": "401468411",
  "date": "Nov 22, 2022",
  "matchup": "PHI vs. BKN",
  "headline": "Nets' Ben Simmons booed, loses in Philly homecoming 115-106",
  "body": "PHILADELPHIA -- — Ben Simmons shrugged off the boos that rose out of the Philly crowd each time the mercurial guard handled the ball.\n\n\r\n              The Nets guard even egged on fans one more time over their reception toward one of the more loathed former Philly stars in sports history.\n\n\r\n              “I thought it was going to be louder,” Simmons said.\n\n\r\n              Tobias Harris scored 24 points and a spirited Philadelphia 76ers team playing without Joel Embiid and James Harden spoiled Simmons' homecoming with a 115-106 win over Brooklyn on Tuesday night.\n\n\r\n              “I feel like this is a huge win for us,” Harris said. “I knew going into the game we were all going to come out with this type of energy and this type of buzz to get up to play.”\n\n\r\n              There was plenty of buzz from the time the doors opened in anticipation of Simmons' return. He had 11 points, 11 assists and seven rebounds to the tune of steady boos. Simmons even had a late-game fade familiar to the Sixers. He didn’t take a shot, was scoreless in the fourth quarter and scored only two points in the second half.\n\n\r\n              Kyrie Irving scored 23 points and Kevin Durant had 20 before coach Jacque Vaughn pulled his starting lineup with 3 minutes left in the game.\n\n\r\n              “Everybody wants to see our team fail,” Durant said. “Nobody likes Ben. Nobody likes Ky. Nobody likes myself.”\n\n\r\n              The expected marquee matchup was dimmed with Embiid out with a sprained left foot, Harden still out with a tendon strain in his right foot and starting guard Tyrese Maxey also out with a broken left foot.\n\n\r\n              Embiid vs. Simmons will have to wait.\n\n\r\n              Simmons vs. 76ers fans was pretty good.\n\n\r\n              Simmons was heckled, drew a flagrant foul, shushed a sellout crowd of 20,184 on a layup, and even Jordan-shrugged after hitting free throws. Of most importance for a player who has battled mental health issues, Simmons played with poise as boos rained on him for the bulk of his 32 minutes.\n\n\r\n              “I feel like I'm in a good place,” Simmons said. “I'm happy. I do what I love. To be out there and having that experience was amazing.”\n\n\r\n              He already had three assists when he went to the free-throw line early in the game. Simmons was booed but never looked rattled and sank both baskets. Simmons had a reverse layup minutes later for his first bucket.\n\n\r\n              Sixers fans were mostly well-behaved — save for a couple of short-lived “(expletive) Ben Simmons!” chants — and mostly saved the four-letter words for tape on the back of their old No. 25 jerseys. \n\n\r\n              Simmons and second-year Sixer Georges Niang tussled late in the first half and Niang gave his former teammate a light stiff-arm to the body that earned a technical foul.\n\n\r\n              Harden couldn’t believe the call from the bench. Sixers owner Josh Harris looked appalled.\n\n\r\n              Simmons missed the technical free throw and the crowd roared as much as it did all game. Simmons, though, hit the court for a steal and knocked the loose ball to Durant for a bucket.\n\n\r\n              The Sixers still took a 63-57 lead into the break.\n\n\r\n              It wasn’t all jeers, all game. Simmons did make 76ers fans go wild over him when he missed consecutive free throws in the second half and triggered a free fast-food chicken promotion.\n\n\r\n              “I thought he was in attack mode, he was aggressive, showed a lot of poise through the course of the night,” Vaughn said. “The experience to get through and get it behind him, really good.”\n\n\r\n              Simmons averaged 15.9 points, 8.1 rebounds and 7.7 assists over four seasons with Philadelphia, which drafted him out of LSU, where he played only one season. His omnipresent headaches, such as his refusal to shoot beyond 15 feet, outweighed his otherwise gifted defensive and playmaking talents. Simmons’ relationship with the Sixers deteriorated following the 2021 playoffs and he demanded a trade.\n\n\r\n              Simmons made a surprise return to the Sixers shortly before last season opened but was promptly kicked out of practice and suspended for one game. The punishment didn’t matter; the No. 1 pick of the 2016 draft never had any intention of playing.\n\n\r\n              Simmons hugged Rivers in the handshake line and met with friends and family sitting on the baseline before he headed for the visitor's tunnel — and one final chorus of boos.\n\n\r\n              “I think it's going to be like this forever,” Simmons said. “I really don't see it changing.”\n\n\r\n              TIP-INS\n\n\r\n              Nets: Seth Curry scored 14 points. He was involved in the Simmons trade but his part in the deal was a bit more personal. He is 76ers coach Doc Rivers’ son-in-law. ... P.J. Tucker was scoreless for the fourth straight game, giving him the longest streak of games with at least 25 minutes played and zero points scored in NBA history.\n\n\r\n              76ers: Harris grabbed his right ankle and hobbled to the locker room in the third quarter. He gave Sixers fans a scare but returned and hit a jumper that made it 85-82.\n\n\r\n              UP NEXT\n\n\r\n              Nets: Continue a three-game trip Wednesday at Toronto and Friday at Indiana.\n\n\r\n              76ers: Embiid will miss Wednesday’s game at Charlotte.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994546.972505
}