{
  "game_id": "0021901306",
  "espn_id": "401224781",
  "date": "Aug 12, 2020",
  "matchup": "MIA @ OKC",
  "headline": "Mike Muscala hits 2 late 3s, Thunder rally past Heat",
  "body": "LAKE BUENA VISTA, Fla. --  Mike Muscala made a 3-pointer with 5.2 seconds and the Oklahoma City Thunder overcame a 22-point deficit in the fourth quarter to beat the Miami Heat 116-115 on Wednesday night.\n\nIn a game largely played by reserves in the second half, Muscala hit two 3-pointers in the final 35 seconds for his only points of the game.\n\n\"I've got a great deal of respect for Mike Muscala just because he's a total pro and keeps himself ready,\" Thunder coach Billy Donovan said. \"Whenever he's called upon, you know you're going to get a really reliable guy.\"\n\nDarius Bazley scored 21 points and Shai Gilgeous-Alexander added 18 for the Thunder. They outscored the Heat 34-15 in the fourth quarter.\n\nRookie Tyler Herro scored a season-high 30 points for Miami, and Duncan Robinson added 19 -- all in the first half.\n\nMiami shot 56% in the first half and led 66-62 at the break.\n\nGabe Vincent hit a 3-pointer with 0.6 seconds left in the third quarter to put Miami up 100-82.\n\nMuscala's first 3-pointer tied it at 113 with 34.8 seconds remaining. Solomon Hill's driving layup put the Heat ahead by two with 11.6 seconds to play.\n\nMuscala second 3 put the Thunder ahead 116-115, and Herro missed a deep 3 at the buzzer.\n\nMuscala said Bazley's success helped set him up for the game-winner.\n\n\"Baze had a great fourth quarter,\" Muscala said. \"I just told him to keep his eyes up. It was a great play by coach, the drawn out play, and it went in.\"\n\nMiami coach Erik Spoelstra wasn't too upset about the loss.\n\n\"We didn't have a lot of subs going down the stretch,\" he said. \"They were gassed. I loved it.\"\n\nTIP-INS\n\nHeat: Shot 67% in the first quarter to take a 42-29 lead. It matched the most points the Thunder have allowed in a quarter this season. ... Led by 18 points in the first quarter.\n\nThunder: Dennis Schroder has returned to the bubble following the birth of his second child, but it's not clear when he will return to action. He is a finalist for Sixth Man of the Year. ... Went on a 14-0 run in the first half. ... Bazley had a +20 plus/minus score.\n\nROBERSON READY?\n\nThunder guard Andre Roberson, who was one of the league's top perimeter defenders before suffering a knee injury in 2018, appears to be regaining his form.\n\nDonovan said he's not sure how much Roberson will play in the postseason, but he is improving. He scored six points in 10 minutes on Wednesday and spent some time guarding Miami's Jimmy Butler.\n\n\"I definitely think because of this experience and the number of meaningful games he's been in throughout his career, he's a guy I trust in situations that he's going to be very, very reliable, very, very responsible,\" Donovan said. \"He's going to do his job to the best of his ability.\"\n\nMAJOR COLLISION\n\nThunder guard Lu Dort and Heat forward Jae Crowder collided in the first quarter. Both left the game and didn't return. Dort rolled over and held his right knee, which connected with Crowder's right leg. Donovan said he had no update on the severity of Dort's injury after the game. Spoelstra said Crowder felt fine afterward and had an X-ray that came up clean.\n\nUP NEXT\n\nHeat: Play the Indiana Pacers on Friday.\n\nThunder: Play the Los Angeles Clippers on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995476.718734
}