{
  "game_id": "0021601103",
  "espn_id": "400900498",
  "date": "Mar 28, 2017",
  "matchup": "MIL @ CHA",
  "headline": "Snell scores 26 points, Bucks beat Hornets 118-108",
  "body": "CHARLOTTE, N.C. -- Tony Snell doesn't mind being the fourth option in the Milwaukee Bucks offense.\nThere are certain nights, like Tuesday, when it pays not to be the center of attention.\nSnell scored a season-high 26 points on 10-of-14 shooting, Giannis Antetokounmpo had 20 points and eight rebounds and the hot-shooting Bucks handed the Charlotte Hornets' playoff hopes a potentially devastating blow with a 118-108 victory.\n\"It's a credit to Giannis and Khris (Middleton),\" Snell said. \"They draw a lot of attention and there was good ball movement. It was a good night.\"\nMalcolm Brogdon had 14 points and 10 assists for his second double-double of the season, and the Bucks won for the 12th time in 15 games.\n\"He did a great job knocking down shots and just being aggressive off the dribble and going to the rim,\" Antetokounmpo said. \"He's done a great job. He's not just defending, he's out there making shots for us and spacing the floor. For me and Khris, we help him, and he'll help us too. When he makes shots the court is wide-open for me, Moose (Greg Monroe) and everybody.\"\nThe Bucks (38-36) made 20 of their first 26 shots and hit 73 percent from the field in the first half to take a 72-50 lead into the locker room.\nSnell, Brogdon and Antetokounmpo were a combined 15 of 18 from the field in the first half, while Milwaukee's bench combined to hit 12 of 17 shots before the break.\n\"I thought Tony's reads and being able to drive the ball was able to set up a lot of things,\" Bucks coach Jason Kidd said. \"We had a lot of open shots in the second half that we didn't knock down. We can't live or die by the 3, but our defense did a good job and slowed down a good offensive team like Charlotte.\"\nThe Bucks scored with ease on crisp passes, piling up 31 assists. The Hornets appeared a step slow on defense.\n\"Our defense was beyond bad,\" said a visibly frustrated Hornets coach Steve Clifford.\nCharlotte trailed by 26 in the second and never got closer than nine.\nCharlotte (33-41) entered in 11th place in the Eastern Conference and fell three games behind the Miami Heat for the final playoff spot with nine games remaining.\nClifford was disappointed with his team's effort, particularly given the magnitude of the game, saying the \"care factor\" wasn't there.\n\"These are the games where the competitors show up -- and we didn't,\" Clifford said. \"We got killed tonight.\"\nTIP-INS\nBucks: Monroe had 13 points, eight rebounds and five assists off the bench. ... The Bucks earned their first season series win against Charlotte since the 2011-12 season. ... They improved to 19-7 this season when shooting better than 50 percent from the field.\nHornets: Outscored the Bucks 15-2 on fastbreak points. ... Got outrebounded 42-31.\nMARCO CUT\nHornets guard Marco Belinelli left the game late in the fourth quarter with a gash near his right eye after a collision with Middleton.\nHe received several stitches and did not return.\nDEFENDING THE 3\nKidd was happy with his team's perimeter defense, holding the Hornets to 7-of-28 shooting from beyond the 3-point arc.\nSLAP IN THE FACE\nNic Batum, Charlotte's $20 million-a-year man, was held to six points on 2-of-9 shooting and only had two rebounds.\n\"The way we played the last two weeks we were fine and just (felt) like a playoff team,\" Batum said. \"We didn't have it tonight. It was a very, very bad game. Sometimes you need that slap in the face, maybe, to get back on track again and win games.\"\nUP NEXT\nBucks: Travel to Boston to face the Celtics on Wednesday night.\nHornets: At Toronto on Wednesday night.\n---\nFor more AP NBA coverage: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764995132.485321
}