{
  "game_id": "0022301010",
  "espn_id": "401585638",
  "date": "Mar 21, 2024",
  "matchup": "ATL @ PHX",
  "headline": "Devin Booker scores 30 points, Suns get hot from 3-point range to beat Hawks 128-115",
  "body": "PHOENIX -- — Devin Booker scored 30 points, Eric Gordon added 21 off the bench and the Phoenix Suns beat the Atlanta Hawks 128-115 on Thursday night.\n\n\r\n              Phoenix won largely thanks to superior long-range shooting, making 22 of 41 3-pointers. Booker hit six 3s while Gordon and Royce O'Neale both added four. Kevin Durant had 19 points and Grayson Allen added 13.\n\n\r\n              The Suns are 12 games above .500 for the first time this season at 41-29. They've won six of their past nine. Booker had another efficient performance, making 10 of 15 shots and hitting three 3s late in the fourth quarter to finish off the Hawks.\n\n\r\n              “This is more of what we expect out of our group, with the talent we have top to bottom,” Booker said. \n\n\r\n              Atlanta has lost five of six. Dejounte Murray scored 29 points while De'Andre Hunter added 22. \n\n\r\n              The Suns led by five at halftime and took a 96-93 lead into the fourth. \n\n\r\n              Phoenix had a big push midway through the final quarter when O'Neale, Gordon and Bol Bol connected for 3-pointers on three straight offensive possessions for a 112-98 lead. The Suns got 47 points from the bench on 17 of 24 shooting.\n\n\r\n              “Probably the best bench performance of the season,” Suns coach Frank Vogel said.\n\n\r\n              The Hawks responded by cutting the margin to 115-110 with 5:24 left but Durant hit a jumper to turn back the threat. \n\n\r\n              “I think we competed the whole game, which is the most important thing,” Hawks coach Quin Snyder said. “They shot over 50% from three as a team, which is tough to handle, especially against a team that's also so good from mid-range.\"\n\n\r\n              The Suns prevailed despite ample adversity in the second half.\n\n\r\n              Booker picked up his fifth foul midway through the third quarter, forcing Vogel to sit the four-time All-Star until midway through the fourth. Starting center Jusuf Nurkic also missed a big chunk of the second half after getting hit in the side of the face, which sent him back to the locker room for several minutes.\n\n\r\n              The Suns — playing on the second night of back-to-back games — looked sluggish early, falling into a 25-11 hole. They fought back fairly quickly and Bradley Beal's two-handed jam tied the game at 37 early in the second quarter.\n\n\r\n              Phoenix won another game as they fight to stay out of the play-in tournament in the Western Conference. The top six teams automatically advance to the first round. The Suns are currently tied for sixth with Dallas, but the Mavs hold the tiebreaker.\n\n\r\n              “We want to finish in the top six,” Vogel said. “But the competition is fierce.”\n\n\r\n              Phoenix took a 65-60 lead into halftime. Booker led the Suns with 13 before the break while Murray had 18 for the Hawks.\n\n\r\n              Atlanta's All-Star guard Trae Young missed his 13th straight game with a torn finger ligament. Atlanta has a 6-7 record in his absence.\n\n\r\n              Durant, who became the No. 8 scorer in NBA history on Wednesday night, hit another mark Thursday with his 2,000th 3-pointer. He's the 16th player in the league to accomplish that feat.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Charlotte on Saturday night.\n\n\r\n              Suns: At San Antonio on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996269.0416052
}