{
  "game_id": "0021900406",
  "espn_id": "401161048",
  "date": "Dec 17, 2019",
  "matchup": "PHX @ LAC",
  "headline": "George, Leonard team to help Clippers overpower Suns 120-99",
  "body": "LOS ANGELES --  The Los Angeles Clippers are one player short of finally fielding their entire team. And it can't come too soon for Paul George and Kawhi Leonard.\n\nGeorge scored 24 points, Leonard added 20 and the Clippers returned home after two weeks away to beat the Phoenix Suns 120-99 on Tuesday night. They were only missing JaMychal Green after having George and Leonard in and out of the lineup since the season began.\n\n“We can start to get into a rhythm with everybody on the floor,\" Leonard said. “We can see what our rotation is.\"\n\nThe Clippers went 4-2 on their recent road trip, which matched their longest of the season. Leonard didn't play in the finale, a loss Saturday at Chicago.\n\nBut he came back strong at Staples Center, teaming with George in a dominant third quarter that saw the Clippers stretch their lead from five points to 21 by the time it was over. The two superstars combined to score 18 points in a 32-16 run that sent the Clippers into the fourth leading 90-69.\n\n“We just couldn't figure out the Clippers' zone,\" Suns coach Monty Williams said. “We were a bit tired, playing in three time zones in four days. Our starting group just passed it around and was hoping for something to happen.\"\n\nLou Williams added 20 points for the Clippers, scoring their first 11 of the fourth -- including three 3-pointers.\n\n“When he gets it going there is no shot that he can't make,\" Clippers coach Doc Rivers said. “That was a good stretch for us. Lou's offense allowed us to keep Paul and Kawhi off the floor and give them some rest.”\n\nIvica Zubac had 12 points in helping the team win its 12th in a row over the Suns in Los Angeles.\n\nKelly Oubre Jr. scored 19 points and Deandre Ayton added 18 points and 12 rebounds in his return from a 25-game NBA suspension for Phoenix, which lost its fourth in a row.\n\n“He still has to get in his rhythm, so I'm not going to judge him too hard,\" Oubre said. “At the end of the day, he's one piece of this puzzle.\"\n\nAyton played on opening night, scoring 18 points against Sacramento, and then sat out as punishment for violating the league's anti-drug program after testing positive for a diuretic. He showed little rust in notching his second double-double of the season while playing 24 minutes.\n\nAyton also twisted an ankle, although he said it was fine after the game.\n\n“At first I was like, this court is like a soccer field,\" Ayton said. “Then I started to get my second wind.\"\n\nAyton calmed his nerves on the 1 1/2-hour bus ride to the arena.\n\n“It gave me enough time to get all them butterflies out,\" he said. “Once I stepped on the floor I knew I was going to be all right.\"\n\nTIP-INS\n\nSuns: Devin Booker (bruised right forearm) missed his third straight game. ... Tyler Johnson (illness) sat out his second game in a row. ... Cameron Johnson (left hip soreness) also sat out. ... Phoenix lost the second half of a back-to-back.\n\nClippers: Green (tailbone) missed his fifth straight game.\n\nEND OF RUBIO'S RUN\n\nRicky Rubio's streak of nine or more assists in nine straight games ended when he finished with eight. He had tied Steve Nash for the longest such streak by a Suns player. As a team, however, the Suns had 30 assists, their 11th straight game with 29 or more, which made them the first team to do so since Charlotte went 13 straight games from March 30 to April 23, 1989.\n\nUP NEXT\n\nSuns: At the Oklahoma City Thunder on Friday in their first meeting of the season.\n\nClippers: Host the Houston Rockets on Thursday. The teams have split their first two meetings this season, with each winning on its home floor.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996564.699649
}