{
  "game_id": "0022200494",
  "espn_id": "401468649",
  "date": "Dec 25, 2022",
  "matchup": "LAL @ DAL",
  "headline": "Doncic, Mavs top Lakers 124-115 to celebrate Nowitzki statue",
  "body": "DALLAS -- — Luka Doncic and the Dallas Mavericks had trailed from the opening bucket when the crowd erupted at the sight of retired star Dirk Nowitzki on the video boards late in the first half.\n\n\r\n              Nowitzki's old team joined the celebration soon enough on the day of his statue unveiling.\n\n\r\n              Doncic scored 32 points, Tim Hardaway Jr. had 16 of his 26 points in a huge third quarter for Dallas and the Mavericks beat the Los Angeles Lakers 124-115 on Sunday.\n\n\r\n              Christian Wood added 30 points and tied a career high with seven assists as the Mavericks finished off the Nowitzki celebration by winning just the second Christmas Day home game in club history.\n\n\r\n              Dallas took its first lead during a 51-point third quarter, the highest-scoring quarter on Christmas in NBA history and a league-best this season. \n\n\r\n              “I think we had to get the jitters out a little bit, some guys' first time playing on Christmas,” Hardaway said. “Just being able to appreciate the opportunity.”\n\n\r\n              LeBron James scored 38 points, one shy of his season high, and the Lakers led by 12 early in the third before the Mavericks took over.\n\n\r\n              Wood started the surge with a 3-pointer, and Dallas was within one when Doncic had a chance to challenge James at the rim but passed to Hardaway for a corner 3 and the first Dallas lead at 65-63.\n\n\r\n              The Mavericks, who scored just 43 points in the first half and trailed by 11 at the break, didn't slow down from there.\n\n\r\n              Doncic, who had six of his nine assists in the quarter, hit three free throws after a foul and a technical against Russell Westbrook, Hardaway scored inside and out and Wood converted a three-point play to break the 50-point mark.\n\n\r\n              Hardaway was 4 of 5 from deep in the third as Dallas went 9 of 13 as a team and shot 72% overall. Dallas outscored LA 51-21 in the third.\n\n\r\n              “We talked about before the game just being ready to initiate, sustain and finish with energy, effort and competitiveness,” Lakers coach Darvin Ham said. “We left it in the locker room at halftime.”\n\n\r\n              Reggie Bullock scored 14 for Dallas on 4-of-7 shooting from long range, where Dallas went 18 of 44 (41%). Six different players had at least two 3s apiece.\n\n\r\n              CHRISTMAS DO-OVER\n\n\r\n              Dallas lost its other Christmas Day home game 11 years earlier when Nowitzki was the face of the franchise, and the Mavericks were coming off their only championship. Miami won 105-94 in an opener for the lockout-delayed 2011-12 season.\n\n\r\n              REPRIEVE FOR DONCIC\n\n\r\n              Doncic was called for his sixth foul on a charge against Austin Reaves with 3:50 left, but the call was reversed on replay. Reaves was assessed a blocking foul, and Doncic made both free throws. Doncic had nine rebounds.\n\n\r\n              TIP-INS\n\n\r\n              Lakers: James' seven-game run of at least 30 points is the longest active streak in the NBA. ... Westbrook scored 17 points, and Reaves had 16. \n\n\r\n              Mavericks: G Kemba Walker missed a second consecutive game for injury recovery on his left knee. Walker went unsigned the first six weeks of the season. The 32-year-old has a history of knee issues in recent years. ... Dallas also was without G/F Dorian Finney-Smith (right abductor strain), G Josh Green (right elbow sprain) and G Frank Ntilikina (left knee soreness).\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At Orlando on Tuesday. LA swept the two-game series last season.\n\n\r\n              Mavericks: Jalen Brunson returns to Dallas with the Knicks on Tuesday. Brunson was drafted in the second round the year Doncic went third overall (2018) and thrived as his sidekick before signing with New York in free agency. The Mavs won the first meeting in New York this month.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994139.1653068
}