{
  "game_id": "0021500646",
  "espn_id": "400828533",
  "date": "Jan 22, 2016",
  "matchup": "CHI @ BOS",
  "headline": "Thomas scores 22, Celtics hold off late Bulls rally 110-101",
  "body": "BOSTON -- Celtics coach Brad Stevens has been patiently waiting for a return of the defensive brand of basketball that was the calling card for his team early in the season.\nAfter some notable struggles recently, it made a reemergence at the perfect time.\nIsaiah Thomas scored 22 points and the Boston Celtics got some key stops late to hold off a furious rally in the fourth quarter and beat the Chicago Bulls 110-101 on Friday night.\nAvery Bradley added 21 points, and Jared Sullinger finished with 18 points and 12 rebounds as the Celtics ended a two-game losing skid.\n\"We were guarding, that was pretty clear,\" Stevens said. \"Usually when you guard, you're locked and you're engaged, good things can happen offensively.\"\n\nThe victory also gives Boston a 2-1 win in the season series with the Bulls.\n\"We were settling for a lot of jump shots that we weren't making, and we changed it up the last two or three minutes,\" Thomas said. \"We got some baskets and we got some stops, so that really helped us out.\"\nThe Celtics were up by 15 points at the half before seeing their lead drop all the way to a point in the fourth quarter.\nJimmy Butler led Chicago with 28 points and 14 rebounds. Derrick Rose added 27 points, and Pau Gasol finished with 18 points and 11 rebounds.\nThe Bulls have lost six of their last eight.\nAfter a pedestrian first half, Rose took over by scoring 16 points in the third quarter to get the Bulls within eight entering the final period.\nRose rested at the start of the fourth, but the Celtics reserves weren't able to maintain their small cushion and went cold offensively as the Bulls continued to attack the paint.\nWith Rose back on the court Boston's lead continued to dwindle, falling all the way to 97-96 on a pair of free throws by Butler with 4:58 remaining.\nThe Celtics settled down after a timeout, scoring eight straight points to get it back to 105-96.\n\"It's about being on the same page when we're out there. All the hustle plays -- it's effort. We're not getting the extra effort to be a championship team right now.\"\nTIP-INS\nBulls: Drop to 6-16 when their opponent scores 100 or more points.\nCeltics: F Amir Johnson sat out Friday's game for personal reasons, but is expected to rejoin the team in Philadelphia on Sunday, weather permitting.\nSTUMPING FOR THOMAS: Sullinger chuckled at the notion that Thomas had simply a \"good chance\" at earning a reserve slot on the Eastern Conference's All-Star team. \"Good? I'd be shocked if he wasn't in the All-Star Game,\" Sullinger said. \"The guy averages 20 and 7. He's 5-foot-2. Why not put somebody like that in the All-Star Game?\"\nSNOW DAY: The NBA announced that the Celtics matchup with the 76ers, scheduled for Saturday night, has been postponed until Sunday due to potential severe weather in the northeast. Celtics coach Brad Stevens said their original play to fly out Friday night was scrapped and the situation is being monitored by team officials. \"I had a good idea that we had somehow managed to have these two games at Philly and at Washington (Monday) scheduled during the worst snow storm in a while at either,\" Stevens said. \"All of the travel is being discussed and we're staying on our toes.\"\nBLATT REACTION: Both Stevens and Hoiberg expressed surprise at the news of Cleveland's decision to part ways with David Blatt as its head coach. Celtics coach Brad Stevens said it's a reminder that the coaching profession is tenuous. \"He won a ton of games. He handled himself, I thought, with great grace, all the way through,\" Stevens said. \"I would think he's not gonna be unemployed long.\" Bulls coach Fred Hoiberg said that during his last year at Iowa State Blatt welcomed him to the Cavaliers training camp while he was on the road recruiting. \"Just a really good person and I think a hell of a basketball coach,\" Hoiberg said. \"It's a tough day. He was great to me when I got into this league.\"\nUP NEXT\nThe Bulls play at Cleveland on Saturday.\nThe Celtics play at Philadelphia on Sunday.\n---\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "source": "espn_api",
  "crawled_at": 1764993924.347876
}