{
  "game_id": "0022200022",
  "espn_id": "401468177",
  "date": "Oct 21, 2022",
  "matchup": "MIA vs. BOS",
  "headline": "Tatum and Brown combine for 57, Celtics top Heat 111-104",
  "body": "MIAMI -- — Jayson Tatum and the Boston Celtics keep on enjoying their trips to Miami.\n\n\r\n              Tatum scored 29 points, Jaylen Brown added 28 and the Celtics beat the Miami Heat 111-104 on Friday night in a rematch of last season’s Eastern Conference finals.\n\n\r\n              The Celtics — whose most recent trip to Miami was a Game 7 win in that playoff series — outscored Miami 42-24 from 3-point range, and improved to 2-0 under interim coach Joe Mazzulla.\n\n\r\n              “We’ve got a great team and we’re still trying to figure each other out,” Tatum said. “And I love playing against the Heat. We’ve got some history here the last couple years, and they push you. They make you a better team. They’ve got a lot of fire, a lot of great players, a great coach.”\n\n\r\n              Tyler Herro scored 25 points for Miami, which got 19 from Bam Adebayo, 18 from Jimmy Butler and 17 from Kyle Lowry.\n\n\r\n              Miami cut a 14-point deficit to five late, before back-to-back baskets by Tatum helped seal matters.\n\n\r\n              “Our guys love playing defense,\" Mazzulla said. “And any time you have a group of guys who love defense, you have a chance to be special.\"\n\n\r\n              It's Miami's first 0-2 start since 2007-08 — so it's the first in Erik Spoelstra's 15 years as Heat coach. Miami had been one of only two teams without an 0-2 start in that span; now, only Portland is on that list.\n\n\r\n              “We weren't able to get over the hump and get the job done, but we just have to stay the course,\" Spoelstra said. “There was definite improvement from Game 1 to Game 2.\"\n\n\r\n              Boston led by as many as 11 in the first half, took a 59-51 lead into the break and stretched the lead to 12 when Brown made consecutive baskets to open the third.\n\n\r\n              That’s around the time Miami put together perhaps its best stretch of the night. A 20-6 run by the Heat, with Herro and Lowry each scoring six points, gave Miami a 71-69 edge — its first lead since midway through the first quarter.\n\n\r\n              But just when Miami got the lead, Adebayo got his fourth foul, then a technical, the game changed. Miami was plus-20 with Adebayo on the floor, and minus-27 in the 13 minutes when he wasn't on the court.\n\n\r\n              The Celtics matched Miami’s 20-6 run with a 20-6 burst of their own, Tatum scoring eight of those points, Grant Williams ending it with a pair of 3’s and it was 89-77 going into the fourth.\n\n\r\n              “It’s not our offense,” Adebayo said. “I feel like 104 points can win a game. It’s the other end we’ve got to lock in on.”\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Boston has won four straight in Miami, going back to last season’s East finals. The Celtics’ longest winning streak in Miami is five, done twice (1988-90, 2015-17). ... The Celtics had a 27-18 edge in bench scoring. ... Williams and Derrick White each scored 10 for Boston.\n\n\r\n              Heat: Spoelstra has now faced 104 different coaches in his NBA career, after matching wits with Mazzulla for the first time. ... Victor Oladipo (left knee) missed his second consecutive game. He has not made an October appearance in the NBA since 2018.\n\n\r\n              IN MEMORIAM\n\n\r\n              The Heat paid tribute to Celtics great Bill Russell throughout the evening, even with staff wearing T-shirts with a large “6” on them -- Russell’s jersey number, which now is on a banner swaying in Miami’s arena. Miami also had a pregame moment of silence for referee Tony Brown, who died Thursday from pancreatic cancer.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Visit Orlando on Saturday night.\n\n\r\n              Heat: Host Toronto on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994000.451278
}