{
  "game_id": "0022200992",
  "espn_id": "401469147",
  "date": "Mar 09, 2023",
  "matchup": "DET vs. CHA",
  "headline": "Oubre, Rozier help Hornets deal Pistons 10th straight loss",
  "body": "DETROIT -- — Kelly Oubre Jr. scored 27 points and Terry Rozier had 21 points and nine assists as the Charlotte Hornets beat Detroit 113-103 on Thursday night and extended the Pistons' losing streak to 10 games.\n\n\r\n              “I thought we did a good job of following the game plan and staying disciplined,” said Oubre, who is averaging 20.8 points in eight games since returning from a hand injury. “I stayed around the team 24/7 when I was hurt so I would be ready to go when I came back.”\n\n\r\n              P.J. Washington added 20 points and Nick Richards had 13 points and nine rebounds for the Hornets, who won their second straight game and for the seventh time in 10 games.\n\n\r\n              “Our guys are working hard and they are finally getting some results,” Hornets coach Steve Clifford said. “We were really active tonight and we had great rim protection.”\n\n\r\n              Cory Joseph scored 17 points and James Wiseman had 16 points and 13 rebounds for the Pistons.\n\n\r\n              “It's super tough to be playing from behind every night,” Wiseman said. “We need to find a way to come out with better energy to get over this hump.”\n\n\r\n              Detroit played without four of the five starters from its season-opening win over the Orlando Magic. Cade Cunningham (leg), Isaiah Stewart (shoulder) and Bojan Bogdanovic (Achilles) are injured, while Saddiq Bey was traded to the Atlanta Hawks. Rookie Jaden Ivey is the only player to start both games.\n\n\r\n              “I thought our approach was disappointing tonight,\" Pistons coach Dwane Casey said. “I don't know if it is just all the games we've played in a short time, but I didn't feel like we came out with the kind of energy we needed.”\n\n\r\n              The Hornets finished the first half with an 8-0 run and held a 59-50 lead. Charlotte used a 13-5 run at the start of the third quarter and increased the margin to 17 points.\n\n\r\n              Joseph scored 14 points in the quarter, helping Detroit close within 93-83 heading to the fourth. But the Hornets extended their lead to as many as 18 points in the sloppy closing period.\n\n\r\n              “I thought that was the key stretch of the game,” Clifford said. “They had it down to 10, but we got it to 18 early in the fourth and took away their momentum.”\n\n\r\n              TIP INS\n\n\r\n              Hornets: Charlotte beat the Pistons 117-106 at home on Feb. 27, and split the season series 2-2. The Hornets have won eight of their last 11 games against Detroit.\n\n\r\n              Pistons: Detroit announced before the game that Stewart is suffering from a right shoulder impingement and will be evaluated again in three to four weeks. Stewart is second on the team in blocks and rebounds.\n\n\r\n              INJURY UPDATE\n\n\r\n              Charlotte center Mark Williams didn't play in the second half due to a thumb injury.\n\n\r\n              “He went back to the locker room after he did it, but he came back to try to play,” Clifford said. “He just wasn't able to catch the ball. Hopefully, it won't be anything serious.”\n\n\r\n              HAPPY ANNIVERSARY\n\n\r\n              The Pistons honored the 2003 WNBA champion Detroit Shock at halftime. The Shock, who also won titles in 2006 and 2008, moved to Tulsa after the 2009 season and are now the Dallas Wings. \n\n\r\n              “I didn't expect this to happen, because the franchise has been gone for a while now,” said Shock forward Swin Cash-Canal, who was elected to the Basketball Hall of Fame in 2022. “But they called and said they wanted to do it for Women's History Month, and we appreciate it. They have done a top-notch job of this.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Host the Utah Jazz on Saturday.\n\n\r\n              Pistons: Host the Indiana Pacers on Saturday and on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994360.925774
}