{
  "game_id": "0021300878",
  "espn_id": "400489751",
  "date": "Mar 01, 2014",
  "matchup": "MIL vs. BKN",
  "headline": "Thornton scores 25 in Nets' 107-98 win over Bucks",
  "body": "MILWAUKEE --  Marcus Thornton knew he was getting a second chance with the Nets and he made the most of it in just his third game with his new team.\n\nThornton scored 12 of his 25 points in the fourth quarter to lead Brooklyn to a 107-98 victory over the Milwaukee Bucks on Saturday night.\n\nBrooklyn's Kevin Garnett missed the game with back spasms but wasn't needed as the Nets never trailed in the second half against the NBA's worst team.\n\nThornton, playing in his third game for Brooklyn since being obtained in a Feb. 19 trade with Sacramento, came off the bench to make 8 of 13 from the field to help the Nets finish their seven-game road trip 4-3.\n\n\"I'm coming to a team with all these veterans, that know how to win, that have championship aspirations and have championships under their belts already, and a coach that has a championship, too,\" Thornton said. \"I knew it would be a great situation.\"\n\nThe 6-foot-4 guard signed a four-year, $31.2 million contract with Sacramento in 2011, but averaged only 8.3 points while shooting 38 percent in 46 games for the Kings this season.\n\nNets coach Jason Kidd wanted to see whether Thornton -- criticized by Sacramento coach Michael Malone for his defensive play -- could step up offensively and defensively at the end of games.\n\n\"I want to find out coming down the stretch defensively can guys count on him, and then offensively can we count on him,\" Kidd said. \"We know he can shoot the ball, put the ball in the basket, but coming down the stretch can he make plays?\n\n\"This was a great opportunity to see that after a long trip, he stepped up,\" Kidd said.\n\nMilwaukee coach Larry Drew said his team struggled defensively, allowing 42 points in the paint.\n\n\"Just too many defensive mistakes,\" he said. \"Bad rotations. Going into the game one of the things we wanted to do was really try to affect them down on the block.\"\n\nAndray Blatche added 19 points and 13 rebounds for Brooklyn, including eight points and 10 rebounds in the fourth quarter. Jason Collins, who signed a 10-day contract with Brooklyn last Sunday, was held scoreless in 8 minutes.\n\nKhris Middleton and Ramon Sessions scored 16 points apiece for Milwaukee.\n\n\"We didn't get the stops we needed,\" Middleton said. \"We let them get so many things too easy. Our room for error is very small.\"\n\nBrooklyn has gone 18-8 in 2014 after opening the season 10-21. The Nets (28-29) play Chicago at home on Monday night with the chance to get back to .500 for the first time since being 2-2 on Nov. 5.\n\n\"I don't think we have to concentrate on that right now,\" Andrei Kirilenko said of getting to .500. \"We have been playing pretty good games. We need to stick with our game plan. That's the only thing.\"\n\nThe Nets play seven of their next 10 games at home, where they have won 10 of their last 12.\n\nThornton hit a pair of 3-pointers, Paul Pierce made another 3 and Blatche scored on a putback as Brooklyn used an 11-6 run to open a 100-91 lead with 2:46 left.\n\n\"I kind of felt disrespected because he played so far back,\" Thornton said with a laugh of Milwaukee's Jeff Adrien while talking about his fourth-quarter jumpers. \"It was one of those things. I tried to make the shots when the opportunity presented itself.\"\n\nMilwaukee never got closer than six points the rest of the game.\n\nMirza Teletovic hit a 3-pointer to cap an 8-2 run opening the fourth quarter, giving the Nets an 85-74 lead with 10:04 left in the game.\n\nThe Bucks then had an 11-4 run to pull within 89-85 on a pair of free throws by Giannis Antetokounmpo before Thornton sparked the Nets down the stretch.\n\nBrooklyn used a 20-11 run to open the second half and took a 75-64 lead on Joe Johnson's 3-pointer with 4:27 to go in the third quarter.\n\nDeron Williams scored 13 points in the first half and the Nets took a 55-53 lead at halftime. Brooklyn took the lead for good, 43-40, on Thornton's 3-pointer with 7:29 to go in the second quarter.\n\nGame notes Rookie Mason Plumlee made his third start for Brooklyn, scoring five points in 11 minutes. ... Garnett has missed six games for rest, but this was only the second one he missed due to injury. ... The Bucks honored former player Junior Bridgeman, whose No. 2 is retired by the team, in the fourth quarter. ... Milwaukee's Zaza Pachulia has missed 21 of 26 shots in the team's last five games",
  "source": "espn_api",
  "crawled_at": 1764992743.0202692
}