{
  "game_id": "0021500374",
  "espn_id": "400828261",
  "date": "Dec 16, 2015",
  "matchup": "DET vs. BOS",
  "headline": "Caldwell-Pope scores 31 points, Pistons beat Celtics 119-116",
  "body": "AUBURN HILLS, Mich. -- Kentavious Caldwell-Pope's jump shot has been the biggest hole in the Pistons starting lineup this season.\nIt seems to be coming around, though.\nCaldwell-Pope scored a career-high 31 points and the Detroit Pistons beat the Boston Celtics 119-116 Wednesday night.\n\n\"I'd say his shot is definitely back,\" coach Stan Van Gundy said. \"We were pretty comfortable that he would start making shots again, but it is definitely nice to see them going in.\"\nCaldwell-Pope only averaged 12.7 points on 38.2 percent shooting in Detroit's first 20 games, including just 29.2 percent on 3-pointers. He scored 22 points in a rout of the Lakers on Dec. 4, though, and has been in double figures in six of the last seven games.\n\"I never lost confidence in myself, because I know offense is one of those things that comes and goes,\" Caldwell-Pope said. \"I just kept playing hard on defense and stuck to my routine. I knew I would start hitting shots at some point.\"\nThe Pistons needed every bit of Caldwell-Pope's offense while they outscored the Celtics 34-33 in a frantic fourth quarter.\n\"This is the second game in a row where we haven't been able to stop anyone down the stretch,\" Van Gundy said. \"We were lucky that our offense was good all night, because they were scoring at will.\"\nEvan Turner hit a short jumper with 19.3 seconds left and was fouled by Marcus Morris. He made the free throw, pulling Boston within 114-113.\nMorris was fouled and made both shots, and after Jonas Jerebko missed an open layup at the other end, Caldwell-Pope made it a five-point game with two free throws. Isaiah Thomas hit a 3-pointer with 4 seconds left, matching his career high of 38 points, and then Reggie Jackson made one of two free throws.\nBoston, though, was out of timeouts, and Jared Sullinger's baseball heave from 80 feet wasn't close.\n\"We just needed to play better, that's the bottom line,\" Celtics coach Brad Stevens said. \"That's a good team, and we know it was going to be a good team, and that we would have to play really well to win. We didn't play well.\"\nJackson finished with 23 points, including 14 in the third quarter. Andre Drummond had 16 points and 12 rebounds.\nSullinger had 17 points and 10 rebounds for Boston.\nDrummond started with one of his worst halves this season, getting two rebounds and two points and going 0 for 4 from the free-throw line. But with 5 seconds left in the second quarter, he rebounded a missed shot, dribbled tentatively up the floor and knocked down a half-court shot at the buzzer for a 55-52 lead. It was his second career 3-pointer and his first since his rookie season.\n\"I practice that shot all the time, so I knew it had a chance,\" Drummond said. \"It was definitely great to see it go in, though, because it gave us the lead.\"\nDetroit led 72-63 midway through the third, at which point Brad Stevens had the Celtics begin to intentionally foul Drummond. He went 3 of 6 from the line, including an air ball, before Stan Van Gundy brought Aron Baynes off the bench.\nThat helped Boston narrow the gap to 75-69, and when Baynes was forced to leave the game after getting hit in his already-broken nose, the Celtics intentionally fouled Joel Anthony. Anthony, taking his first free throws of the season, made 1 of 2.\nThat gave trainers time to stop the bleeding from Baynes' nose, and he came back in to register a three-point play that helped Detroit keep an 85-83 lead going into the fourth.\nBoston briefly took the lead, but Caldwell-Pope answered with a jumper, a steal and a dunk to help the Pistons regain the lead. Anthony Tolliver then hit back-to-back 3-pointers to make it 97-85 with 8 minutes left.\nJerebko hit three 3-pointers against his old team, pulling Boston within 109-105 with 2:37 left. Jackson answered with a three-point play, giving him 11 points in the quarter, and after Thomas hit three free throws, Jackson answered with another basket.\nTIP INS\nCeltics: PF Amir Johnson is one of only four active NBA players to have won a playoff game with the Pistons, joining Tayshaun Prince, Arron Afflalo and Rodney Stuckey. Johnson, the last player drafted directly out of high school, played limited minutes in Detroit's run to the Eastern Conference finals in 2008.\nPistons: According to Basketball Reference, the buzzer-beating 3-pointer was just the eighth basket of Drummond's career from outside 10 feet. ... Brandon Jennings, sidelined since February after tearing his Achilles' tendon, is considering playing Saturday for Detroit's D League affiliate.\nUP NEXT\nCeltics: Host Atlanta on Friday night.\nPistons: Visit Chicago on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994940.821183
}