{
  "game_id": "401810061",
  "espn_id": "401810061",
  "date": "Nov 10, 2025",
  "matchup": "LAC vs ATL",
  "headline": "Krejci scores career-high 28 points as Hawks send Clippers to fifth straight loss, 105-102",
  "body": "LOS ANGELES -- — Vit Krejci scored a career-high 28 points off the bench, Kristaps Porzingis added 20 and the Atlanta Hawks opened a four-game road trip with a 105-102 victory over the Los Angeles Clippers on Monday night.\n\n\r\n              Jalen Johnson had 16 points and 10 rebounds as the Hawks overcame a 17-point deficit to win consecutive games for the second time this season. Krejci made a career-best eight 3-pointers in 10 attempts.\n\n\r\n              Porzingis (illness) and Johnson (quad) both returned after missing Sunday’s 20-point home victory over the Los Angeles Lakers, while Trae Young (knee) and Nickeil Alexander-Walker (back) remained out.\n\n\r\n              James Harden had 35 points, 11 assists and 10 rebounds in the Clippers' fifth straight loss. Ivica Zubac added 13 points and 12 rebounds.\n\n\r\n              Derrick Jones Jr. and Kris Dunn each scored 11 points for the Clippers, who were without star Kawhi Leonard (ankle) for a fourth consecutive game, while Bradley Beal (hip) was ruled out.\n\n\r\n              Krejci’s biggest 3-pointer came with 36 seconds remaining and gave the Hawks a 105-98 lead. Harden converted a four-point play with 25 seconds remaining to get the Clippers within a possession but missed a game-tying 3-point attempt with 12 seconds left.\n\n\r\n              The Clippers led 36-19 early in the second quarter before the Hawks erased the deficit with a 20-3 run to take a 42-41 lead with 4:09 remaining before the half. Krejci made four 3-pointers in the run, including three consecutive at one point.\n\n\r\n              The game was tied at 52 at halftime after Krejci made six of Atlanta’s seven 3-pointers over the first two quarters. The Hawks pushed in front 79-76 after three quarters.\n\n\r\n              Harden tied the score 92-92 with 5:01 remaining on consecutive 3-pointers before another 3-pointer from Krejci put the Hawks up 95-92 with 4:25 remaining. Harden scored 19 points in the fourth quarter on 6-of-10 shooting and 4 of 7 from 3-point range.\n\n\r\n              Up next\r\n              Hawks: At the Sacramento Kings on Wednesday\n\n\r\n              Clippers: Host the Denver Nuggets on Wednesday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042601.934517
}