{
  "game_id": "0022400129",
  "espn_id": "401704695",
  "date": "Oct 31, 2024",
  "matchup": "HOU @ DAL",
  "headline": "Jalen Green, Alperen Sengun help Rockets hold off late Mavericks rally to win 108-102",
  "body": "DALLAS -- — Jalen Green had 23 points and 12 rebounds, Alperen Sengun added 17 points and 12 rebounds, and the Houston Rockets held off a fourth-quarter Dallas rally to beat the Mavericks 108-102 on Thursday night.\n\n\r\n              The Rockets led by 23 points late in the third quarter before the defending Western Conference champions cut Houston's lead to 103-100 with a minute to play.\n\n\r\n              Dillon Brooks also had 17 for the Rockets, and Tari Eason scored 15 off the bench for the Rockets, whose reserves outscored the Mavericks’ 33-21.\n\n\r\n              Luka Doncic led Dallas with 29 points, including 15 in the fourth quarter. \n\n\r\n              Kyrie Irving scored 28, and Klay Thompson was the only other Maverick to score in double figures with 12 points.\n\n\r\n              Takeaways\r\n              Rockets: Houston was third in the NBA averaging 94.5 field goal attempts per game prior to Thursday and put up 97 shots. Dallas attempted 85 shots.\n\n\r\n              Mavericks: The center tandem of Daniel Gafford and Dereck Lively was plagued by foul trouble. Lively had five and Gafford four through three quarters. They finished with a combined six rebounds as the Rockets outrebounded the Mavericks 50-37 and outscored them 20-8 on second-chance points.\n\n\r\n              Key moment \r\n              Doncic sank a 3-pointer with 1:08 left pulling Dallas within three, but Amen Thompson answered for Houston with a fadeaway jumper with 43 seconds remaining.\n\n\r\n              Key stat\r\n              The Mavericks dug too deep of a hole after shooting 2 for 12 on 3-pointers in the first half.\n\n\r\n              Up next \r\n              The Rockets begin a three-game homestand on Saturday against the Warriors, and the Mavericks play the first of a home back-to-back on Sunday against the Magic.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997419.950142
}