{
  "game_id": "0021500044",
  "espn_id": "400827931",
  "date": "Nov 01, 2015",
  "matchup": "OKC vs. DEN",
  "headline": "Thunder beat Nuggets 117-93",
  "body": "OKLAHOMA CITY --  The Thunder overcame fourth-quarter deficits to beat San Antonio and Orlando in dramatic fashion.\n\nThere was no suspense this time. Kevin Durant scored 25 points to help the Thunder roll past the Denver Nuggets 117-93 on Sunday night.\n\nDurant made 8 of 11 field goals and all six of his free throws to help new coach Billy Donovan remain unbeaten in the NBA. The Thunder have won their first three games for the first time since the 2011-12 season.\n\nIn Friday's double-overtime win over Orlando, Durant and Russell Westbrook combined for 91 points. On Sunday, seven players scored in double figures. Serge Ibaka had 18 points, seven rebounds and five blocks and Westbrook had 15 points, nine rebounds and eight assists.\n\n\"It shows how deep we are,\" Durant said. \"We made it easy for everybody. Making the extra pass, getting steals, kicking the ball ahead. When we play like that, when everybody plays together like that, it makes it easy.\"\n\nDanilo Gallinari and Will Barton each scored 15 points and Jameer Nelson added 13 points and seven assists for the Nuggets, who shot just 38 percent.\n\nOklahoma City led 58-50 at halftime before taking control in the third quarter.\n\nWestbrook scored a breakaway layup to give the Thunder a 68-52 lead. His next bucket was a powerful right-handed putback jam off a miss by Steven Adams as the shot clock wound down. Durant followed with a 3-point play that put Oklahoma City up by 20. The Thunder took a 95-70 lead into the fourth quarter.\n\n\"The third quarter is where we lost it,\" Denver coach Michael Malone said. \"We were in it, we were competing, but in the third quarter, they turned it into a blowout pretty quickly.\"\n\nAll five Oklahoma City starters rested for the entire fourth quarter, and the reserves maintained the lead.\n\n\"I think it was great coming out of that third quarter, Kevin and Russell and Serge didn't have to play a second there, and the other guys played very well,\" Donovan said. \"I thought we carried on from where we picked up starting the second half.\"\n\n---\n\nDURANT'S FREEBIES\n\nDurant struggled by his standards from the free-throw line during the preseason, making just 12 of 16. He has made 24 of 25 to start the regular season. He entered the game as a career 88 percent free-throw shooter.\n\nSTAT LINES\n\nWestbrook, the reigning scoring champion known for his volume shooting and sometimes questionable shot selection, is shooting 50 percent from the field through three games. He shot 42.6 percent last season.\n\nQUOTABLE\n\nMalone on Denver's third quarter collapse: \"For whatever reason, we came out in that third quarter and got our butts kicked. Thirty-seven points (allowed) in one quarter -- that's hard to do.\"\n\nTIP-INS\n\nNuggets: F Wilson Chandler (right hip strain) and C Jusuf Nurkic (left patellar tendon repair) both sat out. ... G Mike Miller played for Donovan at the University of Florida. ... Starting guard Gary Harris went scoreless the first three quarters before scoring seven points in the fourth. ... Jameer Nelson and Westbrook got double technicals at the end of the third quarter.\n\nThunder: Oklahoma City wore its orange alternate uniforms for the first time. ... Andre Roberson scored 10 points. It was just the fifth double-figure scoring game of the third-year pro's career. ... Rookie G Cameron Payne made his debut in the fourth quarter, but he did not score. ... Enes Kanter had 12 points and 10 rebounds.\n\nUP NEXT: Nuggets play at the Los Angeles Lakers on Tuesday. Thunder visit Houston on Monday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .",
  "source": "espn_api",
  "crawled_at": 1764994226.574132
}