{
  "game_id": "0022300464",
  "espn_id": "401585092",
  "date": "Jan 02, 2024",
  "matchup": "CHA @ SAC",
  "headline": "Rozier scores 34 in return from illness, Hornets beat Kings 111-104 to snap 11-game skid",
  "body": "SACRAMENTO, Calif. -- — Terry Rozier scored 14 of his 34 points in the fourth quarter after missing a game due to illness, and the Charlotte Hornets beat the Sacramento Kings 111-104 on Tuesday night to snap an 11-game losing streak.\n\n\r\n              “I don’t ever really want to sit anyway and see my guys fight and go to war while I’m on the side,” Rozier said. “I told Coach (Steve Clifford) that I won’t be able to go last night but I’m going to do whatever I can to get myself ready for tonight.”\n\n\r\n              Rozier added six assists and Charlotte outscored Sacramento 36-26 in the final period, finishing the game on a 10-0 run. Miles Bridges had 27 points and P.J. Washington added 17.\n\n\r\n              “It feels good,” Rozier said. “We’ve been trending in the right way, doing a lot of great things. Obviously, our record hasn’t been saying that, but we notice all the great things we’ve been doing and we know we’re going to put it together sooner or later. We’re just happy to walk out of here with a win.”\n\n\r\n              De’Aaron Fox led the Kings with 30 points, including 12 in the fourth quarter. Domantas Sabonis had 23 points and 19 rebounds for his 15th straight double-double, tied for the longest streak in the NBA this season.\n\n\r\n              Sabonis also committed 11 turnovers, contributing to Sacramento’s season-high 21.\n\n\r\n              “To have 21 turnovers in a ballgame, especially when the turnovers aren’t forced, it just takes away your opportunity to score,” Kings coach Mike Brown said.\n\n\r\n              Washington’s two-handed dunk with 51.5 seconds left gave the Hornets their first lead of the fourth quarter. Cody Martin followed with a transition layup, after Sacramento’s 20th turnover.\n\n\r\n              “It’s not easy to win in this league,” Martin said. “Every time you step on the court, it’s the best talent in the world. So it feels good to start to figure things out. I think we’re starting to collectively figure it out on both sides of the court.”\n\n\r\n              The Kings outrebounded the Hornets 48-35, including 15-4 on the offensive glass, but shot just 43.5% from the field. Charlotte shot 51.2%.\n\n\r\n              Sacramento used a 16-2 run to take an 18-8 lead, but Charlotte responded with a 17-3 spurt to end the first quarter up 25-21.\n\n\r\n              The Kings outscored the Hornets 29-20 in the second to build a 50-45 halftime lead.\n\n\r\n              Sacramento fell to 14-1 when leading at the half and 17-2 when ahead after three quarters.\n\n\r\n              “I think there were times where we just didn’t make shots at the rim,” Fox said. “Obviously, we were trying to tip it in. I just think from the standpoint of a lot of what we did tonight, I don’t think we were good.”\n\n\r\n              Hornets rookie Brandon Miller was a late scratch with a bruised left hip. LaMelo Ball (right ankle sprain), Gordon Hayward (left calf strain), Mark Williams (bruised lower back) and Frank Ntilikina (left tibia fracture) also remained out.\n\n\r\n              Rozier missed Monday's loss at Denver.\n\n\r\n              “That’s part of the game,” Martin said. “It’s a long season. There are a lot of games and unfortunately, guys go down. It’s just about a next-man-up mentality and I think we’re doing a great job of staying together mentally.”\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At the Chicago Bulls on Friday night.\n\n\r\n              Kings: Host the Orlando Magic on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995976.311787
}