{
  "game_id": "0022300001",
  "espn_id": "401584089",
  "date": "Nov 03, 2023",
  "matchup": "IND vs. CLE",
  "headline": "Turner, Haliburton help Pacers beat Cavaliers 121-116 in In-Season Tournament opener",
  "body": "INDIANAPOLIS -- — Myles Turner scored 27 points, Tyrese Haliburton had 18 points and 13 assists and the Indiana Pacers held off the Cleveland Cavaliers 121-116 on Friday night to open the NBA’s inaugural In-Season Tournament.\n\n\r\n              Donavan Mitchell had 38 points, nine assists and five rebounds for Cleveland. The Cavaliers overcame an 18-point deficit to lead by four in the fourth quarter.\n\n\r\n              “It was a strong show of character for our team,” Pacers coach Rick Carlisle said. “First win in the history of the In-Season Tournament. We hung in. Myles had a great game. Our fans are connecting with this team. It’s pretty cool.”\n\n\r\n              Each team shot 52% from the field, but Indiana went 15 of 31 on 3-pointers while limiting the Cavs to 8 of 28. Former Pacer Caris LeVert, who had 13 points, missed a 3 from the left wing that would have tied it with 10 seconds left.\n\n\r\n              “Caris missed a tough one,” Carlisle said. “The crowd getting into it, us getting stops at the right times, were key things.”\n\n\r\n              Mitchell made two free throws to bring the Cavs to 119-116 with 2.6 seconds to go, but Haliburton sealed the win with two of his own. Indiana snapped a two-game skid that followed a 2-0 start.\n\n\r\n              Bruce Brown added 19 points and seven rebounds for Indiana. Evan Mobley had 14 points, 10 rebounds, five assists and four blocks for Cleveland.\n\n\r\n              The Pacers battered Cleveland from beyond the arc in the first half, connecting on nine 3-pointers, including four from Turner, on their way to a 70-53 lead.\n\n\r\n              “In the first half we had guys just trying to figure out where they fit,” said Cleveland coach J.B. Bickerstaff, noting all of his regulars played for the first time. “Minutes change. Roles change. In the second half, we did a much better job and gave ourselves a chance, but down 18 you have to be perfect.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Detroit on Nov. 17 in next In-season Tournament game. Host Golden State on Sunday night in a regular game.\n\n\r\n              Pacers: At Philadelphia on Nov. 14 in next In-season Tournament game. Host Charlotte on Saturday night in a regular game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996215.2969542
}