{
  "game_id": "0021801014",
  "espn_id": "401071687",
  "date": "Mar 13, 2019",
  "matchup": "DET @ MIA",
  "headline": "Heat start 2nd half on 21-0 run, top Pistons 108-74",
  "body": "MIAMI --  The outcome was in doubt at halftime.\n\nIt didn't stay that way for long.\n\nAnd thanks to a 21-0 run to open the second half, the Miami Heat now have a tiny bit of breathing room in the Eastern Conference playoff race. The biggest Heat run of the season led to the biggest Heat win of the season, a 108-74 romp past the Detroit Pistons on Wednesday night.\n\n\"Just a professional win by us tonight,\" Heat guard Dwyane Wade said. \"We played against a team that wasn't making shots early, and we continued to keep going at them and continued to keep applying pressure.\"\n\nJustise Winslow scored 16 points for Miami, which had seven players in double figures. Dion Waiters scored 14, Josh Richardson and Hassan Whiteside each had 13 and Wade finished with 11 for Miami.\n\nMiami's starting five -- Richardson, Winslow, Waiters, Bam Adebayo and Kelly Olynyk -- played 12 minutes together. They shot 12 for 17, 4 for 4 from 3-point range and Miami outscored Detroit 36-13 in those 12 minutes.\n\n\"Our starting lineup has had some good starts and some play that's been trending in the right direction,\" Heat coach Erik Spoelstra said. \"But that was as inspiring as they've been.\"\n\nBlake Griffin scored 13 points for Detroit, which got 11 from Wayne Ellington. Detroit missed its first 11 shots of the third quarter, eight of them from 3-point range.\n\nThe Pistons have now dropped consecutive games for the first time since Jan. 25 and 29 -- and both were blowout losses, with this one on the heels of a 103-75 rout in Brooklyn on Wednesday.\n\n\"It's about our mental fortitude and coming out and having a better mindset at the beginning of games, myself included,\" Griffin said. \"I'm not excluding myself from that at all. If we have any fight about us at all we'll come out and rectify that.\"\n\nMiami (32-35) is still No. 8 in the East, now two games ahead of No. 9 Orlando and two games back of No. 7 Detroit.\n\nAndre Drummond fouled out with 6:30 left and finished with five points and nine rebounds -- snapping his run of 19 consecutive double-doubles, which left him tied with Bob Lanier for the Pistons' all-time record streak in that department.\n\nIt wasn't Drummond's night.\n\nIt wasn't the Pistons' night in any way. They shot 36 percent, got outrebounded 51-36 and were 8 for 37 from 3-point range -- 1 for 17 in the second half. It went down as Detroit's second-worst loss of the season, topped only by a 37-pointer at Indiana on Dec. 28.\n\n\"For two games in a row now, we didn't come out in playoff mode,\" Pistons coach Dwane Casey said. \"There's nothing schematically. There's nothing X-and-O wise. It's our approach. We have to understand at this time of year ... the only thing you can do is scrap and play hard.\"\n\nTIP-INS\n\nPistons: Detroit hadn't lost a quarter by 25 points since Oct. 30, 2010. ... Drummond was looking to join Kevin Love (53), Dwight Howard (separate streaks of 33 and 20), Griffin (27) and Russell Westbrook (23, earlier this season) as players in the last decade with 20 straight double-doubles.\n\nHeat: Miami opened on an 8-0 run, its best to start a game this season. ... It was Miami's 600th sellout at AmericanAirlines Arena -- the last 413 of those coming consecutively -- and 900th home sellout overall. ... The Heat celebrated Pride Night, and the national anthem before the game was performed by the South Florida Gay Men's Chorus.\n\nEIGHT IS ENOUGH\n\nThere have been four instances of a team holding another to eight points or less in a quarter this season. Miami is responsible for three of them. Houston held Chicago to seven in the third quarter on Nov. 3 -- and the rest of the list is all Heat. Miami held the Los Angeles Clippers to eight points in the fourth quarter on Dec. 8, and kept the Milwaukee Bucks to that many in the first quarter on Dec. 22.\n\nWADE BLOCKS\n\nWade had a first-quarter blocked shot against Detroit's 7-foot-1 Thon Maker. It was the 879th block of Wade's career, leaving him 14 shy of Michael Jordan's all-time regular-season record for guards. When adding playoff games, Wade already has more blocks than any guard in history.\n\nSLOW START\n\nDetroit has trailed after the first quarter in each of its last five games, and the 12-point deficit after 12 minutes in this one matched the Pistons' third-largest, after-one-quarter hole this season. They had rallied to win three of the first four in those cases -- but didn't come close in this one.\n\nUP NEXT\n\nPistons: Host the Los Angeles Lakers on Friday.\n\nHeat: Host Milwaukee on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994659.48559
}