{
  "game_id": "0021501009",
  "espn_id": "400828896",
  "date": "Mar 16, 2016",
  "matchup": "HOU vs. LAC",
  "headline": "Jordan, Redick lead Clippers to 122-106 win over Houston",
  "body": "HOUSTON -- J.J. Redick hit four 3-pointers in the first quarter, sending Los Angeles to a quick 10-point lead.\nThe rest of the Clippers jumped in soon after, and there was little Houston could do.\nDeAndre Jordan had 23 points and 16 rebounds, and the Clippers opened up a large halftime lead and never relented in a 122-106 victory over the Rockets on Wednesday night.\nJordan finished 8 of 8 from the floor, with six dunks. Redick added 25 points, including 14 in the first quarter, going 5 of 9 from the 3-point line.\n\nRedick averaged 25.8 points in four contests against Houston this season, shooting 18 of 32 on 3-pointers.\n\"With J.J. shooting the ball like he was early on, that kind of opened the floor for us,\" Jordan said. \"We took what they gave us. They took away the pick-and-roll, and guys were knocking down shots.\"\nChris Paul had 15 points and 16 assists for the Clippers (43-24), who shot 57 percent.\n\"It opens up everything,\" Paul said of Redick's early 3-pointers. \"The way that J.J. was getting loose, and we were getting out in transition. Our defense was setting up our offense.\"\nJamal Crawford had 14 points and seven assists; and Luc Mbah a Moute, Austin Rivers and Wesley Johnson each had 12 points as the Clippers snapped a two-game skid. Los Angeles' bench totaled 37 points.\n\"They changed the game for us,\" Los Angeles coach Doc Rivers said of the second unit. \"That's the point I was trying to make to you guys before the game. You have to stay with your group, and they've been doing it for most of the year and had a little down spurt and tonight, they had a great one.\"\nJames Harden led Houston (34-34) with 33 points and eight assists. Michael Beasley had 16 points and eight rebounds off the bench for the Rockets, who shot 49 percent.\nTrevor Ariza also had 16 points for Houston, which was 9 of 25 on 3-pointers and shot 71 percent from the free throw line.\n\"The intensity wasn't there,\" Houston interim coach J.B. Bickerstaff said. \"We just weren't on our toes; we weren't on our heels to start the game. We didn't come out with any force defensively. You give up 35 points and 37 points in two quarters of play against a very good team, coming back is going to be tough if not impossible.\"\nThe Rockets have allowed 110 or more points in 10 of the last 22 games.\n\"I think it was communication and being in on the weak side, and all of the little things that we've got to be good at,\" Dwight Howard said. \"Tonight, just overall, just wasn't a good game for us from the start.\"\nTrailing 101-77 with 11 minutes left in the game, Houston outscored the Clippers 23-10 to cut the lead to 11 on Montrezl Harrell's dunk with 4:34 left. However, Redick answered with a 3-pointer with 3:40 remaining to push the lead back to 14 and Houston got no closer than 12 the rest of the way.\nThe Clippers started the second quarter with a 21-7 spurt to open a 56-33 lead with 6:45 left in the half on Rivers' 3-pointer.\nLos Angeles led 72-50 at the half. The 72 points were the most the Clippers have scored in a half this season.\nTIP-INS\nClippers: Paul Pierce scored seven points in 18 minutes. Pierce had missed the previous three games with a sore right big toe. ... Los Angeles signed center Jeff Ayres for the rest of season, the team announced Wednesday. ... The Clippers' last loss in the second night of a back-to-back was Dec. 19 at Houston.\nRockets: Jason Terry had 11 points. ... Howard had six points and seven rebounds. ... Houston gave away Harden \"Weird Beards\" to the first 15,000 fans. The fake beard was colored pink and was given away with gummy candy shaped beards.\nHACK-A-JORDAN\nHouston started fouling Jordan with two minutes to go in the first half and he went 3 of 6 from the line. Houston fouled Jordan again with 7:46 left in the third quarter, and Jordan made both.\nUP NEXT\nClippers: Travel to Memphis on Saturday.\nRockets: Host Minnesota on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994609.538628
}