{
  "game_id": "0022401081",
  "espn_id": "401705647",
  "date": "Mar 30, 2025",
  "matchup": "LAC @ CLE",
  "headline": "Jarrett Allen, Donovan Mitchell propel Cavaliers to 127-122 victory over Clippers",
  "body": "CLEVELAND -- — Jarrett Allen scored 25 points, Donovan Mitchell added 24 and the Cleveland Cavaliers held off the Los Angeles Clippers 127-122 on Sunday afternoon.\n\n\r\n              Evan Mobley had 22 points as Cleveland reached 60 wins for the third time in franchise history, and the first since the 2009-10 season. The Cavaliers (60-15) moved 4 1/2 games ahead of Boston for the top spot in the Eastern Conference. \n\n\r\n              Allen and Mitchell also had 12 rebounds, while Mitchell was three assists shy of a triple-double.\n\n\r\n              Norman Powell had 34 points for the Clippers, who were without Kawhi Leonard due to right knee injury management. James Harden added 24 points.\n\n\r\n              The Clippers trailed by 18 points early in the fourth quarter, but went on a 14-5 run during the final three minutes to get within 125-122 with 19 seconds remaining. Darius Garland sank a pair of free throws after being fouled by Nicolas Batum. A steal by Mitchell on the ensuing possession iced the game for Cleveland.\n\n\r\n              Takeaways\r\n              Clippers: Amir Coffey left in the first half due to left knee soreness. He had one point in four minutes.\n\n\r\n              Cavaliers: Mitchell had his sixth double-double of the season, tied for his most in a single season in his eight-year NBA career. He also had six last season.\n\n\r\n              Key moment\r\n              Mobley had 15 points in the third, including seven during a 16-2 run that helped the Cavaliers regain control after the Clippers got within 75-74 less than three minutes into the third.\n\n\r\n              Key stat\r\n              Powell scored 24 points in the first half, the second-most in his nine-year NBA career. He had 25 in the first and second quarters for Portland in a 2021 game vs. Utah.\n\n\r\n              Up next\r\n              The Clippers conclude their four-game road trip in Orlando on Monday while the Cavaliers host the New York Knicks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997933.2046661
}