{
  "game_id": "0022000773",
  "espn_id": "401307564",
  "date": "Apr 06, 2021",
  "matchup": "MIA vs. MEM",
  "headline": "Brooks, Grizzlies end another Heat win streak, 124-112",
  "body": "MIAMI -- — Dillon Brooks scored a season-high 28 points on 10-for-16 shooting and the Memphis Grizzlies ended another Miami winning streak, beating the Heat 124-112 on Tuesday night.\n\n\r\n                    Jonas Valanciunas had 20 points and 10 rebounds, Kyle Anderson finished with 19 points and Desmond Bane added 15 points for the Grizzlies, who won their third straight.\n\n\r\n                    “What I love about our group is they embrace the focus of us,” Memphis coach Taylor Jenkins said. “They relish the opportunity to compete.”\n\n\r\n                    Brooks converted 5 of 9 3-pointers and scored 23 points in the third period to help thwart a Miami comeback bid.\n\n\r\n                    “I feel this is a good stretch for us and we have to keep it rolling to see how far we can take it,” Brooks said. “We know what’s on the line. We know what’s at stake.”\n\n\r\n                    Jimmy Butler scored 28 points and Bam Adebayo had 18 for the Heat, who had won their past four. Three weeks ago, Memphis stalled another Miami win streak at five.\n\n\r\n                    “They hurt us pretty much everywhere,” Miami coach Erik Spoelstra said. “We’re much better than we showed tonight. It shows you how fragile things could be in this league. You’re playing well and then a team can come in and play as well as they did against us tonight.”\n\n\r\n                    Victor Oladipo, in his third game since joining the Heat in a trade with Houston, scored 16 points.\n\n\r\n                    Memphis outscored Miami 13-5 in the first 3:59 of the fourth quarter and extended its lead to 109-94.\n\n\r\n                    Grizzlies leading scorer Ja Morant was held to 10 points. Morant took only one shot in the first half, yet the Grizzles led 63-57 at halftime.\n\n\r\n                    “I’m a pass-first point guard,” said Morant, who finished with 10 assists. “Whatever the team needs from me, that’s what I do. If I have zero points and we win the game, I’m cool with it.”\n\n\r\n                    Valanciunas and Anderson each shot 6-for-8 from the field and combined for 35 points in the half.\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Brooks scored nine consecutive points for the Grizzlies late in the third period. With the Heat converging on him during Memphis’ last possession of the period, Brooks found an open Tyus Jones for a 3-pointer that gave the Grizzlies a 96-89 advantage. \"The situations early in the quarter allowed him to be aggressive to score and he finishes it with a heck of an unselfish play,” Jenkins said. ... Valanciunas extended his double-figure rebounding streak to 17. He also had his 35th double-double of the season. ... De’Anthony Melton (sore left leg) and Brandon Clarke (sore left calf) sat out along with Jaren Jackson (right knee surgery recovery) and Justise Winslow (sore right quadriceps).\n\n\r\n                    Heat: Oladipo’s addition has removed guard Kendrick Nunn from the rotation. Nunn, who has started 26 games and is averaging 13.5 points, saw no playing time for a third consecutive game. ... KZ Okpala (health and safety protocols) sat out Tuesday. … The Heat had 11 assists in the first quarter, following their 13 first-quarter assists against Cleveland on Saturday.\n\n\r\n                    BIG MARGINS\n\n\r\n                    Memphis has won its last four by double digits. After expanding their lead early in the fourth, the Grizzlies didn’t allow the Heat to get closer than 12 points.\n\n\r\n                    WHERE IT ALL BEGAN\n\n\r\n                    Jenkins returned to the city where he made his coaching debut on Oct. 23, 2019.\n\n\r\n                    “A lot of great memories from that game, I do remember the loss,” Jenkins said of the Heat’s 120-101 victory. “The culmination of a great journey for me but understanding there is still a lot of work ahead.”\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: At Atlanta on Wednesday.\n\n\r\n                    Heat: Close their four-game homestand on Thursday against the Los Angeles Lakers.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996770.420216
}