{
  "game_id": "0021900269",
  "espn_id": "401160911",
  "date": "Nov 29, 2019",
  "matchup": "TOR @ ORL",
  "headline": "Powell leads Raptors to 6th straight win, 90-83 over Magic",
  "body": "ORLANDO, Fla. --  The Toronto Raptors weren't getting shots to fall. So they concentrated on defense and waited for somebody to get hot.\n\nNorman Powell delivered in the third quarter, scoring 19 of his career-best 33 points and the Raptors won their sixth straight game, beating the Orlando Magic 90-83 on Friday night.\n\n\"Sometimes a guy just finds a groove in the middle of the game when nobody else has any flow going,\" said Fred Van Fleet, who added 22 points for the Raptors. \"So you want to ride that out as long as you can. Norm took over the offense by himself.\"\n\nPowell was 7-for-9 shooting in the third quarter, including three 3-pointers. He said he was just reacting to the Raptors' seven-point halftime deficit, the result of 31% shooting that included 5 of 24 from 3-point range.\n\n\"You stay in the moment and let plays come to you, continue to shoot and live with the result,\" Powell said. \"Everybody is being really tied into what we are doing (defensively), how we are changing defenses, where we need to be, helping one another, talking, communicating, coming out of timeouts. When we see where an adjustment needs to be made, we were able to pick it up in the second half.\"\n\nThe Raptors won despite 4-for-22 shooting by Pascal Siakam, the NBA's ninth-leading scorer. Siakam finished with 10 points and 13 rebounds.\n\nEvan Fournier scored 19 points for Orlando, which has lost four of five. Markelle Fultz added 15 points. Aaron Gordon, who played 32 minutes for Orlando after missing three games with a right ankle contusion, had eight points and eight rebounds.\n\nThe Magic shot 35% for the game and had 24 turnovers.\n\n\"You're just not going to beat a team that good turning the ball over that much,\" Magic coach Steve Clifford said. \"They help early, they're great with their hands, you take the extra dribble and it's gone. The majority of (the turnovers) were that.\"\n\nThe Magic led by 11 twice in the first half. Van Fleet hit a pair of 3-pointers that helped the Raptors cut Orlando's lead to 47-40 by halftime. But he second half was all Toronto, and especially Powell.\n\n\"We had a stretch of 12 consecutive stops in the third quarter,\" Raptors coach Nick Nurse said. \"That's about as high as it gets. It was excellent. We didn't shoot the ball well, we didn't play well. I was happy when we got to the locker room only down seven.\"\n\nPowell scored Toronto's first 10 points in the second half, eight as part of a 13-0 run that gave the Raptors a 60-53 lead late in the third quarter.\n\nPowell's final 3-pointer gave Toronto an 83-72 lead, their largest of the game, with less than three minutes left.\n\nTIP-INS\n\nRaptors: G Kyle Lowry (fractured left thumb) and F Serge Ibaka (sprained right ankle) sat out their 10th straight games. ... Toronto opponents are shooting .408 after 18 games. Milwaukee's .433 opposing field-goal percentage led the NBA last season.\n\nMagic: C Nikola Vucevic missed a fourth straight game with a sprained right ankle. ...The Magic unveiled new grey and orange City Edition uniforms. ... For the 27th straight year, the Magic served Thanksgiving Breakfast at the Coalition for the Homeless of Central Florida on Thursday. Coach Steve Clifford sponsored the meal, while CEO Alex Martins led a contingent of Magic staff in serving breakfast to more than 700 men, women and children.\n\nFAMILIAR FOES\n\nIncluding the five games in their first-round playoff loss, the Magic have played eight of their last 23 games against the Raptors. Toronto has won the last seven. The teams meet again in the regular-season finale in Orlando on April 15.\n\nUP NEXT\n\nRaptors: Host the Utah Jazz on Sunday night.\n\nMagic: Host the Golden State Warriors on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995642.013362
}