{
  "game_id": "0021801157",
  "espn_id": "401071830",
  "date": "Apr 01, 2019",
  "matchup": "POR @ MIN",
  "headline": "Turner has triple-double as Blazers top Wolves, 132-122",
  "body": "MINNEAPOLIS --  With two of their top three scorers sidelined with injuries, the Portland Trail Blazers are relying on contributions from many different players.\n\nThat balance was on display Monday in Minnesota, and it yielded another win for the Blazers.\n\nEvan Turner had 13 points, 11 rebounds and 10 assists off the bench, and the Blazers moved into a tie for third place in the Western Conference with a 132-122 victory over the Timberwolves.\n\nRodney Hood led Portland with 21 points. Enes Kanter added 20 points and 11 rebounds for the Blazers, who joined the idle Houston Rockets at 49-28.\n\n\"I really thought this game kind of exemplifies the way we need to play,\" Portland coach Terry Stotts said.\n\nTurner completed the fourth triple-double of his career and his first with Portland on a rebound in the fourth quarter. Turner's teammates celebrated on the bench.\n\n\"I think that says a lot about our team,\" Turner said. \"I think we all are genuinely happy when each other sees different parts of success.\"\n\nTurner was a perfect 5 of 5 from the floor, making his triple-double just the seventh in NBA history to happen on five or fewer field goal attempts. He played all 12 minutes of the fourth quarter and had eight points and eight rebounds in the period.\n\nPortland led by as many as 19 in the first half after going 10 of 16 from 3-point range before halftime.\n\nAndrew Wiggins had 21 points for Minnesota, while Gorgui Dieng scored 18 on 7-of-8 shooting.\n\nPortland's lead disappeared in the second half as Minnesota went ahead in the third quarter. The Timberwolves went on a 16-6 run, including eight points from Wiggins, to chip away, then closed the period with a 12-0 run to take a 100-97 lead into the fourth.\n\nA 10-2 run put Portland up 124-114 with 4:29 remaining. Seth Curry had eight of the Blazers' 10 points during the run.\n\n\"We just keep digging ourselves a hole in the first half,\" Wiggins said. \"We fight back. But the majority of the time, we're not going to win fighting back.\"\n\nKanter has seen his minutes increase since the season-ending injury to center Jusuf Nurkic. Kanter played 26 minutes on Monday, his second-most since joining the Blazers in mid-February.\n\nPortland outscored Minnesota 35-22 in the fourth quarter as the Wolves couldn't make stops on defense after taking the lead.\n\n\"It feels like Groundhog Day right now,\" said Timberwolves interim coach Ryan Saunders. \"It's got to hurt when somebody scores on you, too. We've got to get to that point.\"\n\nPortland bounced back after a loss to Detroit on Saturday snapped a six-game winning streak. The Trail Blazers are 10-2 in their last 12 games.\n\nPortland's bench scored 60 points, including 19 from Curry.\n\n\"There was just a lot going well offensively for most of the guys who played,\" Stotts said.\n\nTIP-INS\n\nBlazers: G Damian Lillard was named the Western Conference Player of the Week on Monday. Portland's star guard averaged 25.3 points and 7.3 assists in games against Brooklyn, Chicago, Atlanta and Detroit. It's the first time this season and seventh in his career that Lillard earned the weekly honor. ... Portland won the season series 3-1. ... Hood made his second start for the Blazers since joining the team in early February.\n\nTimberwolves: Minnesota announced that forward Robert Covington underwent successful arthroscopic surgery Monday. The procedure removed loose bodies in Covington's right knee. Covington, acquired in the trade that sent Jimmy Butler to Philadelphia, last played for the Timberwolves on Dec. 31. ... Dieng's 18 points were a season high. ... Wiggins has scored 20 or more points in seven straight games.\n\nUP NEXT\n\nBlazers: Host Memphis on Wednesday night.\n\nTimberwolves: Visit Dallas on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995153.101123
}